{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 111"
        },
        "path": "/books/al-kafi:1:4:111",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب مَوْلِدِ النَّبِيِّ</span> ( صلى الله عليه وآله ) وَ وَفَاتِهِ",
          "en": "Chapter 111 – Nazool (Arrival) of the Prophet<sup>saww</sup> and his<sup>saww</sup> demise"
        }
      }
    ],
    "index": 169,
    "local_index": 111,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 112"
        },
        "path": "/books/al-kafi:1:4:112",
        "titles": {
          "ar": "باب النَّهْيِ عَنِ الْإِشْرَافِ عَلَى قَبْرِ النَّبِيِّ ( صلى الله عليه وآله )",
          "en": "Chapter 112 – The Forbiddance from climbing upon the grave of the Prophet<sup>saww</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 110"
        },
        "path": "/books/al-kafi:1:4:110",
        "titles": {
          "ar": "باب فِي مَعْرِفَتِهِمْ أَوْلِيَاءَهُمْ وَ التَّفْوِيضِ إِلَيْهِمْ",
          "en": "Chapter 110 – Regarding their<sup>asws</sup> recognising their<sup>asws</sup> friends and the Authorisation to them<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:111",
    "titles": {
      "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب مَوْلِدِ النَّبِيِّ</span> ( صلى الله عليه وآله ) وَ وَفَاتِهِ",
      "en": "Chapter 111 – Nazool (Arrival) of the Prophet<sup>saww</sup> and his<sup>saww</sup> demise"
    },
    "verse_count": 40,
    "verse_start_index": 1185,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1186,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ أَخِي حَمَّادٍ الْكَاتِبِ عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سَيِّدَ وُلْدِ آدَمَ فَقَالَ كَانَ وَ اللَّهِ سَيِّدَ مَنْ خَلَقَ اللَّهُ وَ مَا بَرَأَ اللَّهُ بَرِيَّةً خَيْراً مِنْ مُحَمَّدٍ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Abdullah Bin Muhammad Bin Akhy Hammad Al Katib Al Husayn Bin Abdullah who said ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Was Rasool-Allah<sup>saww</sup> the chief of the children of Adam<sup>as</sup>?’ So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! He<sup>saww</sup> was the chief of the ones Allah<sup>azwj</sup> Created, and Allah<sup>azwj</sup> has no created being better than Muhammad<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " The Holy Prophet (s.a) was born on the twelfth of the month of Rabi‘ al-Awwal, in the year of Elephant on a Friday at noon. Also it is narrated that it was at dawn forty years before his receiving Divine messages. His mother conceived with him on the days of Tashriq (1, 12, 13) of dhul Hajj near the middle Jamara (a pillar of stones) and she was in the house of ‘Abdallah ibn ‘Abd al-Muttalib. She gave birth in the Sha‘b of abu Talib (a.s.) in the house of Muhammad ibn Yusuf at the left far corner of the house as you would enter.al-Khayzuran made that house into a mosque and people use for prayers. After receiving Divine commands to work as the Messenger of Allah he remained in Makka for thirteen years. Thereafter he migrated to Madina wherein he lived for ten years. He passed away on Monday the twelfth of the month of Rabi‘ al-Awwal at the age of sixty three. His father ‘Abdallah ibn ‘Abd al-Muttalib died in Madina among his maternal uncles when he (Muhammad) was only two months old. His mother, ’Amina daughter of Wahab ibn ‘Abd Manaf, ibn Zuhra ibn Kilab ibn Murra ibn Ka‘b ibn Luway ibn Ghalib, died when he was a boy of four years old. ‘Abd al-Muttalib died when the Holy Prophet (s.a.) was about eight years old. He married khadija when he was twenty and some years old. From Khadija before receiving the Divine commands of his children biorn were al-Qasim, Ruqiyya, Zaynaband ’Umm Kulthum. Of his children born after he received Divine commands were al-Tayyib, al-Tahir and Fatima (a.s.). It is also narrated that after he received Divine commands no other children besides Fatima (a.s.) and that al-Tayyib and al-Tahir were born before he received divine commands. Khadija (a.s.) died at the time the Holy Prophet (s.a.) came out of Sha‘b of abu Talib. This was one year before his migration to Madina.Abu Talib died one after the death of Khaija. When the Messenger of Allah lost these two people at became very difficult for him to live in Makka. He became extremely sad and complained it to Jibril. Allah then send him the message to leave the town, the town of the unjust people because after abu Talib there is no one in Makka to support you. He was commanded to migrate."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (175/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1187,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ حَمَّادٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ ذَكَرَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَا بَرَأَ اللَّهُ نَسَمَةً خَيْراً مِنْ مُحَمَّدٍ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hajjal, from Hammad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> mentioned Rasool-Allah<sup>saww</sup>, so he<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Allah<sup>azwj</sup> has not Created any creature better than Muhammad<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 1. md ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ‘Abdallah ibn Muhammad son of the brother of Hammad al-Katib from al-Husayn ibn ‘Abdallah who has said the following. “I asked abu ‘Abdallah (a.s.), ‘Was the Messenger of Allah the mater of the children of Adam?” The Imam (a.s.) said, ‘By Allah, he was the master of all whom Allah has created. Allah has not created any creature better than Muhammad (s.a.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/186)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1188,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:3",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عِيسَى وَ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ مُرَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى يَا مُحَمَّدُ إِنِّي خَلَقْتُكَ وَ عَلِيّاً نُوراً يَعْنِي رُوحاً بِلَا بَدَنٍ قَبْلَ أَنْ أَخْلُقَ سَمَاوَاتِي وَ أَرْضِي وَ عَرْشِي وَ بَحْرِي فَلَمْ تَزَلْ تُهَلِّلُنِي وَ تُمَجِّدُنِي ",
          "ثُمَّ جَمَعْتُ رُوحَيْكُمَا فَجَعَلْتُهُمَا وَاحِدَةً فَكَانَتْ تُمَجِّدُنِي وَ تُقَدِّسُنِي وَ تُهَلِّلُنِي ثُمَّ قَسَمْتُهَا ثِنْتَيْنِ وَ قَسَمْتُ الثِّنْتَيْنِ ثِنْتَيْنِ فَصَارَتْ أَرْبَعَةً مُحَمَّدٌ وَاحِدٌ وَ عَلِيٌّ وَاحِدٌ وَ الْحَسَنُ وَ الْحُسَيْنُ ثِنْتَانِ ثُمَّ خَلَقَ اللَّهُ فَاطِمَةَ مِنْ نُورٍ ابْتَدَأَهَا رُوحاً بِلَا بَدَنٍ ",
          "ثُمَّ مَسَحَنَا بِيَمِينِهِ فَأَفْضَى نُورَهُ فِينَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Al Husayn Bin Abdullah, from Muhammad Bin Isa and Muhammad Bin Abdullah, from Ali Bin Hadeed, from Murazim, ",
            "(It has been narrated) from Abu Abullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Blessed and High Said: “O Muhammad<sup>saww</sup>! I<sup>azwj</sup> Created you<sup>saww</sup> and Ali<sup>asws</sup> as ‘نُوراً’ Light, Meaning a spirit without a body, before I<sup>azwj</sup> Created My<sup>azwj</sup> earth, and My<sup>azwj</sup> Throne, and My<sup>azwj</sup> oceans. So you<sup>asws</sup> did not cease to extol My<sup>azwj</sup> Oneness, and praising Me<sup>azwj</sup>. ",
            "Then I<sup>azwj</sup> Gathered both your<sup>asws</sup> spirits and Made these two to be one. So it was glorifying Me<sup>azwj</sup>, and extolling My<sup>azwj</sup> Holiness, and extolling My<sup>azwj</sup> Oneness. Then I<sup>azwj</sup> Divided it into two, and Divided the two into two each, so they came to be four – Muhammad<sup>saww</sup> being one, and Ali<sup>asws</sup> being one, and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup> being two. Then I<sup>azwj</sup> Created (Syeda) Fatima<sup>asws</sup> from ‘نُورٍ’ Light, Beginning her<sup>asws</sup> as a spirit without a body”.",
            "Then He<sup>azwj</sup> Wiped us<sup>asws</sup> by His<sup>azwj</sup> Right Hand, so His<sup>azwj</sup> Light resulted into us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. om Ahmad ibn Muhammad from al-Hajjal from Hammad from abu ‘Abdallah (a.s.) who has said the following. When mentioning the the Messenger of Allah he said, “Amir al-Mu’minin Ali (a.s.) has said, “Allah has not created any creature better than Muhammad (s.a.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/186)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1189,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:4",
        "text": [
          "أَحْمَدُ عَنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ أَوْحَى اللَّهُ تَعَالَى إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) أَنِّي خَلَقْتُكَ وَ لَمْ تَكُ شَيْئاً وَ نَفَخْتُ فِيكَ مِنْ رُوحِي كَرَامَةً مِنِّي أَكْرَمْتُكَ بِهَا حِينَ أَوْجَبْتُ لَكَ الطَّاعَةَ عَلَى خَلْقِي جَمِيعاً فَمَنْ أَطَاعَكَ فَقَدْ أَطَاعَنِي وَ مَنْ عَصَاكَ فَقَدْ عَصَانِي وَ أَوْجَبْتُ ذَلِكَ فِي عَلِيٍّ وَ فِي نَسْلِهِ مِمَّنِ اخْتَصَصْتُهُ مِنْهُمْ لِنَفْسِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Al Husayn, from Muhammad Bin Abdullah, from Muhammad Bin Al Fuzayl, from Abu Hamza who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> the Exalted Revealed unto Muhammad<sup>saww</sup>: “<span class=\"ibTxt\">[19:9] and indeed I Created you before, when you were nothing</span>, and I<sup>azwj</sup> Blew into you<sup>saww</sup> of My<sup>azwj</sup> Spirit, a Prestige from Me<sup>azwj</sup>. I<sup>azwj</sup> Honoured you<sup>saww</sup> with it when I<sup>azwj</sup> Obligated the obedience to you<sup>saww</sup> upon My<sup>azwj</sup> creatures altogether. So the one who obeys you<sup>saww</sup>, so he has obeyed Me<sup>azwj</sup>, and the one who disobeys you<sup>saww</sup>, so he has disobeyed Me<sup>azwj</sup>; and I<sup>azwj</sup> Obligated that regarding Ali<sup>asws</sup> and regarding his<sup>asws</sup> offspring from the ones<sup>asws</sup> whom I<sup>azwj</sup> Chose from them for Myself<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Idris has narrated al-Husayn ibn ‘Abdallah from Muhammad ibn ‘Isa and Muhammad ibn ‘Abdallah from Ali ibn Hadid from Murazim from abu ‘Abdallah (a.s.) who has said the following. “Allah, the Most Holy, the Most High, has said, “O Muhammad I have created you and Ali a ligh, a spirit, without body before I created My heavens, My earth, My Throne, and My ocean. You continued acknowledge Me as you’re the Lord and speak of My glory. I then collected the spirits of both of you and made it one spirit. This spirit continued to speak of My Glory, My Holiness and acknowledge Me as the Lord. I then divided it into two and two which became four: one Muhammad one Ali, al-Hassan and al-Husayn the two of them. Then Allah created Fatima (a.s.) from the spirit that was created first without a body. He then wiped us with his right hand to allow his light reach us all."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (189/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1190,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَبِي الْفَضْلِ عَبْدِ اللَّهِ بْنِ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) فَأَجْرَيْتُ اخْتِلَافَ الشِّيعَةِ فَقَالَ يَا مُحَمَّدُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمْ يَزَلْ مُتَفَرِّداً بِوَحْدَانِيَّتِهِ ثُمَّ خَلَقَ مُحَمَّداً وَ عَلِيّاً وَ فَاطِمَةَ فَمَكَثُوا أَلْفَ دَهْرٍ ثُمَّ خَلَقَ جَمِيعَ الْأَشْيَاءِ فَأَشْهَدَهُمْ خَلْقَهَا وَ أَجْرَى طَاعَتَهُمْ عَلَيْهَا وَ فَوَّضَ أُمُورَهَا إِلَيْهِمْ فَهُمْ يُحِلُّونَ مَا يَشَاءُونَ وَ يُحَرِّمُونَ مَا يَشَاءُونَ وَ لَنْ يَشَاءُوا إِلَّا أَنْ يَشَاءَ اللَّهُ تَبَارَكَ وَ تَعَالَى ",
          "ثُمَّ قَالَ يَا مُحَمَّدُ هَذِهِ الدِّيَانَةُ الَّتِي مَنْ تَقَدَّمَهَا مَرَقَ وَ مَنْ تَخَلَّفَ عَنْهَا مَحَقَ وَ مَنْ لَزِمَهَا لَحِقَ خُذْهَا إِلَيْكَ يَا مُحَمَّدُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Abu Al Fazl Abdullah Bin Idrees, from Muhammad Bin Sinan who said, ",
            "‘I was in the presence of Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, so I flowed (the discussion) of the differing of the Shias. So he<sup>asws</sup> said: ‘O Muhammad! Allah<sup>azwj</sup> Blessed and High did not cease to be Individual by His<sup>azwj</sup> Oneness. Then He<sup>azwj</sup> Created Muhammad<sup>saww</sup>, and Ali<sup>asws</sup>, and (Syeda) Fatima<sup>asws</sup>. So they<sup>asws</sup> remained for ‘أَلْفَ دَهْرٍ’ a thousand Dahr (one Dahr equals the amount of time earth’s existence). Then He<sup>azwj</sup> Created the entirety of the things. So He<sup>azwj</sup> Made them<sup>asws</sup> witness their creation, and Caused to flow their<sup>asws</sup> obedience to be upon these, and Authorised their affairs to them<sup>asws</sup>. Thus, they<sup>asws</sup> are permitting whatever they are so desiring, and permitting whatever they<sup>asws</sup> wish, and they<sup>asws</sup> are never desiring except what Allah<sup>azwj</sup> the Blessed and High Desires’. ",
            "Then he<sup>asws</sup> said: ‘O Muhammad<sup>saww</sup>! This here is the Religion which (if) one who goes ahead of it (exaggerates), would miss it, and the one who remains behind from it would be obliterated, and the one who holds it properly would preserve it. Take it to yourself, O Muhammad<sup>saww</sup>!’"
          ],
          "en.sarwar": [
            " 4. Ahmad has narrated from al-Husayn from Muhammad ibn ‘Abdallah from Muhammad ibn al-Fudayl from abu Hamza who has said the following. “I heard abu Ja‘far (a.s.) say, “Allah, the Most High sent revelation to Muhammad (s.a.) saying, “O Muhammad I created you. You did not exist. I blew into you from My spirit. It was an honor with which I honored you when I made it an obligation on all My creatures to obey you. Whoever would obey you has obeyed Me and whoever would dis obey you has disobeyed Me. I made this an obligation in the case of Ali and those of his descendants whom I have chosen for My-self.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/190)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1191,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ صَالِحِ بْنِ سَهْلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ بَعْضَ قُرَيْشٍ قَالَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) بِأَيِّ شَيْ‏ءٍ سَبَقْتَ الْأَنْبِيَاءَ وَ أَنْتَ بُعِثْتَ آخِرَهُمْ وَ خَاتَمَهُمْ قَالَ إِنِّي كُنْتُ أَوَّلَ مَنْ آمَنَ بِرَبِّي وَ أَوَّلَ مَنْ أَجَابَ حِينَ أَخَذَ اللَّهُ مِيثَاقَ النَّبِيِّينَ وَ أَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ قَالُوا بَلَى فَكُنْتُ أَنَا أَوَّلَ نَبِيٍّ قَالَ بَلَى فَسَبَقْتُهُمْ بِالْإِقْرَارِ بِاللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Salih Bin Sahl, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>: ‘Some of the Qureysh said to Rasool-Allah<sup>saww</sup>, ‘By which thing do you<sup>saww</sup> precede the Prophets<sup>saww</sup>, and you<sup>saww</sup> were Sent at the end of them<sup>as</sup> and as their<sup>as</sup> Seal?’ He<sup>saww</sup> said: ‘I<sup>saww</sup> was the first one to believe in my<sup>saww</sup> Lord<sup>azwj</sup>, and the first one to answer when Allah<sup>azwj</sup> Took the Covenant of the Prophets<sup>as</sup> and Made them to testify upon themselves<sup>as</sup> <span class=\"ibTxt\">[7:172] Am I not your Lord? They said: Yes!</span>. Thus it was so that I<sup>saww</sup> was the first Prophet<sup>as</sup> to say: ‘Yes’, therefore I<sup>saww</sup> preceded them by the acknowledgement with Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 5. Al-Husayn ibn Muhammad al-Asha‘ari has narrated from Mu‘alla ibn Muhammad from abu al-Fadl ‘Abdallah ibn Idris from Muhammad ibn Sinan who has said the following “Once I was in the presence of abu Ja‘far (a.s.), the second and I mentioned the differences among the Shi‘a. The Imam (a.s.) said, “O Muhammad, Allah, the Most Holy, the Most High, is One eternally. He created Muhammad, Ali and Fatima (a.s.). They were there for a thousand Dahr (a turn). Then He created all other things. He made them towitness the creation of all other things, made obedience to them obligatory and gave control of the affairs of the creation. They can, thus, make lawful whatever they would wish and unlawful whatever they would wish and they would never wish anything unless Allah, the Most Holy, the Most High, would wish. He then said, “O Muhammad, this is a religion that if exceeded it would lead to extremism and if ignored it would be degradation and those who would hold to it properly would have proper contact. Keep it with you, O Muhammad.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/193)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1192,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:7",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ إِبْرَاهِيمَ عَنْ عَلِيِّ بْنِ حَمَّادٍ عَنِ الْمُفَضَّلِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) كَيْفَ كُنْتُمْ حَيْثُ كُنْتُمْ فِي الْأَظِلَّةِ فَقَالَ يَا مُفَضَّلُ كُنَّا عِنْدَ رَبِّنَا لَيْسَ عِنْدَهُ أَحَدٌ غَيْرُنَا فِي ظُلَّةٍ خَضْرَاءَ نُسَبِّحُهُ وَ نُقَدِّسُهُ وَ نُهَلِّلُهُ وَ نُمَجِّدُهُ وَ مَا مِنْ مَلَكٍ مُقَرَّبٍ وَ لَا ذِي رُوحٍ غَيْرُنَا حَتَّى بَدَا لَهُ فِي خَلْقِ الْأَشْيَاءِ فَخَلَقَ مَا شَاءَ كَيْفَ شَاءَ مِنَ الْمَلَائِكَةِ وَ غَيْرِهِمْ ثُمَّ أَنْهَى عِلْمَ ذَلِكَ إِلَيْنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Ali Bin Ibrahim, from Ali Bin Hammad, from Al Mufazzal who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘How were you<sup>asws</sup> all when you<sup>asws</sup> were in the shadows?’ So he<sup>asws</sup> said: ‘O Mufazzal! We<sup>asws</sup> were with of our<sup>asws</sup> Lord<sup>azwj</sup> There wasn’t anyone with Him<sup>azwj</sup> apart from us<sup>asws</sup> in the green shadow. We<sup>asws</sup> praised Him<sup>azwj</sup>, and we<sup>asws</sup> extolled His<sup>azwj</sup> Holiness, and we<sup>asws</sup> extolled His<sup>azwj</sup> Oneness, and we<sup>asws</sup> Praised Him<sup>azwj</sup>, and there was none from an Angel of Proximity nor anyone with a spirit apart from us<sup>asws</sup> until there was a beginning for it in the creation of the things. So He<sup>azwj</sup> Created whatever He<sup>azwj</sup> so Desired from the Angels and others, then the knowledge of that ended up to us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 6. A number of our people has narrated from Ahmad ibn Muhammad from ibn Muhbub from Salih ibn Sahl from abu ‘Abdallah (a.s.) who has said the following. “Certain persons from Quraysh asked the Messenger of Allah, ‘By what means did you excel the prophet while you ended them as the last prophet?” The Messenger of Allah said, “I was the first to believe in my Lord, and the first to answer Allah when He called the prophets to make a covenant and beat testimony against their own souls that had answered positively when asked them, “Am I not your Lord? They all had answered, ‘Yes, You Are our Lord.” I was the prophet that said, “Yes, You Are our Lord.” I, thus, excelled them in the acknowledgment that Allah is the Lord.”"
          ]
        }
      },
      {
        "index": 1193,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:8",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ قَالَ سَمِعْتُ يُونُسَ بْنَ يَعْقُوبَ عَنْ سِنَانِ بْنِ طَرِيفٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ قَالَ إِنَّا أَوَّلُ أَهْلِ بَيْتٍ نَوَّهَ اللَّهُ بِأَسْمَائِنَا إِنَّهُ لَمَّا خَلَقَ السَّمَاوَاتِ وَ الْأَرْضَ أَمَرَ مُنَادِياً فَنَادَى أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ ثَلَاثاً أَشْهَدُ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ ثَلَاثاً أَشْهَدُ أَنَّ عَلِيّاً أَمِيرُ الْمُؤْمِنِينَ حَقّاً ثَلَاثاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Muhammad Bin Al Waleed who said, ‘I heard Yunus Bin Yaqoub, from Sinan Bin Tareyf, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> saying: ‘We<sup>asws</sup> were the first family Allah<sup>azwj</sup> Commended by our<sup>asws</sup> names. It was that when He<sup>azwj</sup> Created the skies and the earth, He<sup>azwj</sup> Commanded a Caller to Call out: ‘I testify that there is no god except for Allah<sup>azwj</sup>’, thrice, and, ‘I testify that Muhammad<sup>saww</sup> is Rasool<sup>as</sup> of Allah<sup>azwj</sup>’, thrice, and, ‘I testify that Ali<sup>asws</sup> is Amir Al-Momineen truly’, thrice’."
          ],
          "en.sarwar": [
            " 7. from Sahl ibn Ziyad from Muhammad ibn Ali ibn Ibrahim from Ali ibn Hammad from al-Mufaddal who has said the following. “I asked abu ‘Abdallah (a.s.), “How did you exist when you existed in the shadows?” The Imam (a.s.) said, “O Mufaddal, we were in the presence of our Lord and there was no one else in the green shadow. We would speak of His Glory, Holiness, acknowledge Him as the Lords and speak of His Majesty. There was no angel even of the ones close to Allah or a living being except us in His presence until He decided to create all things. He then created whatever He wanted, in the He wanted of the angels and others. The knowledge of that then came to us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (194/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1194,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:9",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ الصَّغِيرِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْجَعْفَرِيِّ عَنْ أَحْمَدَ بْنِ عَلِيِّ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ كَانَ إِذْ لَا كَانَ فَخَلَقَ الْكَانَ وَ الْمَكَانَ وَ خَلَقَ نُورَ الْأَنْوَارِ الَّذِي نُوِّرَتْ مِنْهُ الْأَنْوَارُ وَ أَجْرَى فِيهِ مِنْ نُورِهِ الَّذِي نُوِّرَتْ مِنْهُ الْأَنْوَارُ وَ هُوَ النُّورُ الَّذِي خَلَقَ مِنْهُ مُحَمَّداً وَ عَلِيّاً فَلَمْ يَزَالَا نُورَيْنِ أَوَّلَيْنِ إِذْ لَا شَيْ‏ءَ كُوِّنَ قَبْلَهُمَا فَلَمْ يَزَالَا يَجْرِيَانِ طَاهِرَيْنِ مُطَهَّرَيْنِ فِي الْأَصْلَابِ الطَّاهِرَةِ حَتَّى افْتَرَقَا فِي أَطْهَرِ طَاهِرَيْنِ فِي عَبْدِ اللَّهِ وَ أَبِي طَالِبٍ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Al Husayn Bin Abdullah Al Sagheer, from Muhammad Bin Ibrahim Al Ja’fary, from Ahmad Bin Ali Bin Muhammad Bin Abdullah Bin Umar, ",
            "(It has been narrated) son of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Existed when there was no other existence. So He<sup>azwj</sup> Created the existence (beings), and the space, and Created the Light of the light from which the lights are illuminated, and Made to flow into it from His<sup>azwj</sup> Own Light from which the lights lit up, and it is the Light from which were created Muhammad<sup>saww</sup> and Ali<sup>asws</sup>. So they<sup>asws</sup> did not cease to be two former lights when there was nothing existing before the two of them<sup>asws</sup>. Thus, they both<sup>asws</sup> did not cease to flow as clean, having been Cleaned, into the clean ‘الْأَصْلَابِ’, until they both<sup>asws</sup> separated in the most clean of the two clean (linages), in Abdullah<sup>as</sup> and Abu Talib<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 8. Sahl ibn Ziyad has narrated from Muhammad ibn al-Walid who has said that he heard Yunus ibn ya‘qub narrated from Sinan ibn Turayf who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘We are the first family whose names Allah has exalted. When He created the heavens and earth He commanded an announcer to proclaim. “I testify that there is no lord besides Allah three times. I testify that Muhammad is the Messenger of Allah, three times and that Ali is the Amir al-Mu’minin Ali (a.s.) (Leader with Divine Authority) in all truth, three times.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/190)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1195,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:10",
        "text": [
          "الْحُسَيْنُ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْمُفَضَّلِ عَنْ جَابِرِ بْنِ يَزِيدَ قَالَ قَالَ لِي أَبُو جَعْفَرٍ ( عليه السلام ) يَا جَابِرُ إِنَّ اللَّهَ أَوَّلَ مَا خَلَقَ خَلَقَ مُحَمَّداً ( صلى الله عليه وآله ) وَ عِتْرَتَهُ الْهُدَاةَ الْمُهْتَدِينَ فَكَانُوا أَشْبَاحَ نُورٍ بَيْنَ يَدَيِ اللَّهِ قُلْتُ وَ مَا الْأَشْبَاحُ قَالَ ظِلُّ النُّورِ أَبْدَانٌ نُورَانِيَّةٌ بِلَا أَرْوَاحٍ وَ كَانَ مُؤَيَّداً بِرُوحٍ وَاحِدَةٍ وَ هِيَ رُوحُ الْقُدُسِ ",
          "فَبِهِ كَانَ يَعْبُدُ اللَّهَ وَ عِتْرَتَهُ وَ لِذَلِكَ خَلَقَهُمْ حُلَمَاءَ عُلَمَاءَ بَرَرَةً أَصْفِيَاءَ يَعْبُدُونَ اللَّهَ بِالصَّلَاةِ وَ الصَّوْمِ وَ السُّجُودِ وَ التَّسْبِيحِ وَ التَّهْلِيلِ وَ يُصَلُّونَ الصَّلَوَاتِ وَ يَحُجُّونَ وَ يَصُومُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn, from Muhammad Bin Abdullah, from Muhammad Bin Sinan, from Al Mufazzal, from Jabir Bin Yazeed who said, ",
            "‘Abu Ja’far<sup>asws</sup> said to me: ‘O Jabir! Allah<sup>azwj</sup>, the first of what He<sup>azwj</sup> Created was the creation of Muhammad<sup>saww</sup> and his<sup>saww</sup> family, the guides, the Guided. So they<sup>asws</sup> were resemblances of ‘نُورٍ’ Light in front of Allah<sup>azwj</sup>’. I said, ‘And what are the resemblances?’ He<sup>asws</sup> said: ‘ظِلُّ النُّورِ’ ‘Shadows of light, bodies of light without spirits, and they<sup>asws</sup> were Supported by one spirit, and it is the Holy Spirit. ",
            "So by it, he<sup>saww</sup> and his<sup>saww</sup> family<sup>asws</sup> worshipped Allah<sup>azwj</sup>, and it was for that that He<sup>azwj</sup> Created them<sup>asws</sup> as forbearing scholars, righteous, elites worshipping Allah<sup>azwj</sup> with the <span class=\"iTxt\">Salat</span>, and the <span class=\"iTxt\">Sawm</span> (Fasts), and the <span class=\"iTxt\">Sujood</span> (Prostrations), and the <span class=\"iTxt\">Tasbeeh</span> (Glorifications), and the extollation of Oneness, and they<sup>asws</sup> are praying <span class=\"iTxt\">Salat</span>, and they<sup>asws</sup> are performing Hajj, and they<sup>asws</sup> are Fasting’."
          ],
          "en.sarwar": [
            " 9. Ahmad ibn Idris has narrated from al-Husayn ibn ‘Abdallah al-Saghir from Muhammad ibn Ibrahim al-Ja‘fari from Ahmad ibn Ali ibn Muhammad ibn ‘Abdallah ibn ‘Umar ibn Ali ibn abu Talib (a.s.) from abu ‘Abdallah (a.s.) who has said the following. “Allah was and no was. He created the was and the place and created the light of lights from which all lights lighted up. He made to flow to it (light of lights) from His own light which lighted up all lights. He was the light from Muhammad and Ali were created. They both continued to be the first two lights because nothing had come into being before them. They continued to flow pure and clean through the clean generations until they separated in two clean persons; ‘Abdallah and abu Talib (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/196)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1196,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:11",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ وَ غَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ شَبَابٍ الصَّيْرَفِيِّ عَنْ مَالِكِ بْنِ إِسْمَاعِيلَ النَّهْدِيِّ عَنْ عَبْدِ السَّلَامِ بْنِ حَارِثٍ عَنْ سَالِمِ بْنِ أَبِي حَفْصَةَ الْعِجْلِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ فِي رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثَلَاثَةٌ لَمْ تَكُنْ فِي أَحَدٍ غَيْرِهِ لَمْ يَكُنْ لَهُ فَيْ‏ءٌ وَ كَانَ لَا يَمُرُّ فِي طَرِيقٍ فَيُمَرُّ فِيهِ بَعْدَ يَوْمَيْنِ أَوْ ثَلَاثَةٍ إِلَّا عُرِفَ أَنَّهُ قَدْ مَرَّ فِيهِ لِطِيبِ عَرْفِهِ وَ كَانَ لَا يَمُرُّ بِحَجَرٍ وَ لَا بِشَجَرٍ إِلَّا سَجَدَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and someone else, from Sahl Bin Ziyad, from Muhammad Bin Al Waleed Shabab Al Sayrafi, from Malik Bin Ismail Al Nahdy, from Abdul Salam Bin Haris, from Salim Bin Abu Hafsa Al Ijaly, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘There were three (qualities) in Rasool-Allah<sup>saww</sup> which did not happen to be in anyone apart from him<sup>saww</sup> – There did not happen to be a shadow for him<sup>saww</sup>, and it was so that he<sup>saww</sup> did not pass by a street; and no one would pass through it after two days or three, except that one would recognise that he<sup>saww</sup> had passed through it, due to the (still left therein) fragrance of Rasool-Allah<sup>saww</sup> (making him<sup>saww</sup>) recognised; and it was so that he<sup>saww</sup> neither passed by a rock nor by a tree except these prostrated to him<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 10. Al-Husayn has narrated from (Muhammad) ibn ‘Abdallah from Muhammad ibn Sinan from al-Mufaddal from Jabir ibn Yazid who has said the following. “Abu Ja‘far (a.s.) said to me, ‘O Jabir, the first thing that Allah created was Muhammad (s.a) and his offspring who are the rightly guided guides. They existed in ’Ashabah (form ) of light in the presence of Allah.” I then asked, “What is ’Ashabah?” The Imam (a.s.) said, “It is the shadow of light, the lighting bodies without the spirit. It was supported by one spirit which is the Holy spirit. In that state he and his offspring worshipped Allah and for this reason He created them forbearing scholars, conscientious pure one who worship Allah through prayer, fasting, prostration, speaking of His Glory and the acknowledgment that He is the only Lord. They perform prayers, perform Hajj and fast.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/197)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1197,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:12",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا عُرِجَ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) انْتَهَى بِهِ جَبْرَئِيلُ إِلَى مَكَانٍ فَخَلَّى عَنْهُ فَقَالَ لَهُ يَا جَبْرَئِيلُ تُخَلِّينِي عَلَى هَذِهِ الْحَالَةِ فَقَالَ امْضِهْ فَوَ اللَّهِ لَقَدْ وَطِئْتَ مَكَاناً مَا وَطِئَهُ بَشَرٌ وَ مَا مَشَى فِيهِ بَشَرٌ قَبْلَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammad Bin Usman, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When there was an Ascension (Mi’raj) with Rasool-Allah<sup>saww</sup>, Jibraeel<sup>as</sup> ended up with him<sup>saww</sup> to a place, and he<sup>as</sup> isolated from him<sup>saww</sup>. So he<sup>saww</sup> said to him<sup>as</sup>: ‘O Jibraeel<sup>as</sup>! You<sup>as</sup> are isolating from me<sup>saww</sup> upon this state?’ So he<sup>as</sup> said: ‘Carry on, for by Allah<sup>azwj</sup>, you<sup>saww</sup> are treading in a place in which no person has trod upon and no person has walked in it before you<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 11. Ali ibn Muhammad and others have narrated from Sahl ibn Ziyad from Muhammad ibn al-Walid Shabab al-Sayrafi from Malik ibn ’Isma‘il al-Nahdi from ‘abd al-Salamibn Harith from Salim ibn abu Hafsa al-‘Ijli from abu Ja‘far (a.s.) who has said the following. “The Messenger of Allah had three qualities that no one else had. He did not have any shadow. Whatever path he would walk even after two or three days one could still notice his passing thereby due to his fragrance that remained along the path. Whatever stones and trees that he would pass by it would prostrate for him our of respect.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (199/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1198,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:13",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَأَلَ أَبُو بَصِيرٍ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا حَاضِرٌ فَقَالَ جُعِلْتُ فِدَاكَ كَمْ عُرِجَ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ مَرَّتَيْنِ فَأَوْقَفَهُ جَبْرَئِيلُ مَوْقِفاً فَقَالَ لَهُ مَكَانَكَ يَا مُحَمَّدُ فَلَقَدْ وَقَفْتَ مَوْقِفاً مَا وَقَفَهُ مَلَكٌ قَطُّ وَ لَا نَبِيٌّ إِنَّ رَبَّكَ يُصَلِّي فَقَالَ يَا جَبْرَئِيلُ وَ كَيْفَ يُصَلِّي قَالَ يَقُولُ سُبُّوحٌ قُدُّوسٌ أَنَا رَبُّ الْمَلَائِكَةِ وَ الرُّوحِ سَبَقَتْ رَحْمَتِي غَضَبِي فَقَالَ اللَّهُمَّ عَفْوَكَ عَفْوَكَ قَالَ وَ كَانَ كَمَا قَالَ اللَّهُ قابَ قَوْسَيْنِ أَوْ أَدْنى ",
          "فَقَالَ لَهُ أَبُو بَصِيرٍ جُعِلْتُ فِدَاكَ مَا قَابَ قَوْسَيْنِ أَوْ أَدْنَى قَالَ مَا بَيْنَ سِيَتِهَا إِلَى رَأْسِهَا فَقَالَ كَانَ بَيْنَهُمَا حِجَابٌ يَتَلَأْلَأُ يَخْفِقُ وَ لَا أَعْلَمُهُ إِلَّا وَ قَدْ قَالَ زَبَرْجَدٌ فَنَظَرَ فِي مِثْلِ سَمِّ الْإِبْرَةِ إِلَى مَا شَاءَ اللَّهُ مِنْ نُورِ الْعَظَمَةِ ",
          "فَقَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى يَا مُحَمَّدُ قَالَ لَبَّيْكَ رَبِّي قَالَ مَنْ لِأُمَّتِكَ مِنْ بَعْدِكَ قَالَ اللَّهُ أَعْلَمُ قَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ أَمِيرُ الْمُؤْمِنِينَ وَ سَيِّدُ الْمُسْلِمِينَ وَ قَائِدُ الْغُرِّ الْمُحَجَّلِينَ ",
          "قَالَ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِأَبِي بَصِيرٍ يَا أَبَا مُحَمَّدٍ وَ اللَّهِ مَا جَاءَتْ وَلَايَةُ عَلِيٍّ ( عليه السلام ) مِنَ الْأَرْضِ وَ لَكِنْ جَاءَتْ مِنَ السَّمَاءِ مُشَافَهَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad Al Jowhary, from Ali Bin Abu Hamza who said, ",
            "‘Abu Baseer asked Abu Abdullah<sup>asws</sup> and I was present, so he said, ‘May I be sacrificed for you<sup>asws</sup>! How many times was Rasool-Allah<sup>saww</sup> Ascended (Mi’raj) with?’ So he<sup>asws</sup> said: ‘Twice. So Jibraeel<sup>as</sup> paused him<sup>saww</sup> at a pausing stop and he<sup>as</sup> said to him<sup>saww</sup>: ‘In your<sup>saww</sup> place, O Muhammad<sup>saww</sup>, for you<sup>saww</sup> have paused at a pausing strop, no Angel has paused at all, not any Prophet<sup>saww</sup>, your<sup>saww</sup> Lord<sup>azwj</sup> is Praying <span class=\"iTxt\">Salat</span>’. So he<sup>saww</sup> said: O Jibraeel<sup>as</sup>, and how does He<sup>azwj</sup> Pray <span class=\"iTxt\">Sal</span>ā<span class=\"iTxt\">t</span>?’ He<sup>as</sup> said: ‘He<sup>azwj</sup> is Saying: “Glorious, Holy am I<sup>azwj</sup>! Lord<sup>azwj</sup> of the Angels and the Spirit. My<sup>azwj</sup> Mercy precedes My<sup>azwj</sup> Wrath”. So he<sup>saww</sup> said: ‘Your<sup>azwj</sup> Pardon! Your<sup>azwj</sup> Pardon!’ He<sup>asws</sup> said: ‘And it was just as Allah<sup>azwj</sup> Said <span class=\"ibTxt\">[53:9] So he was the measure of two bows or even closer</span>’.",
            "So Abu Baseer said, ‘May I be sacrificed for you<sup>asws</sup>! What is <span class=\"ibTxt\">the measure of two bows or even closer</span>?’ He<sup>asws</sup> said: ‘What is between its centre to its top (radius)’. So he said, ‘And there was a Veil between the two, sparkling, pulsating’, and I (the narrator) do not know it except and he<sup>asws</sup> had said: ‘Of aquamarine. So he<sup>saww</sup> looked into like an eye of the needle towards whatever Allah<sup>azwj</sup> so Desired from the Light of the Magnificence. ",
            "So Allah<sup>azwj</sup> Blessed and High Said: “O Muhammad<sup>saww</sup>!” He<sup>saww</sup> said: ‘At Your<sup>azwj</sup> service my<sup>saww</sup> Lord<sup>azwj</sup>!’ He<sup>azwj</sup> Said: “Who is for your<sup>saww</sup> community from after you<sup>saww</sup>?” He<sup>saww</sup> said: ‘Allah<sup>azwj</sup> is more Knowing’. He<sup>azwj</sup> Said: “Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, Amir Al-Momineen and chief of the Muslims, and guide of the resplendent”. ",
            "He (the narrator) said, ‘Then Abu Abdullah<sup>asws</sup> said to Abu Baseer: ‘O Abu Muhammad! By Allah<sup>azwj</sup>! The Wilayah of Ali<sup>asws</sup> did not come from the earth, but it came from the sky Verbally’."
          ],
          "en.sarwar": [
            " 12. Ali ibn Ibrahim has narrated from from his father from Ahmad ibn Muhammad ibn abu Nasr from Hammad ibn ‘Uthman from abu Basir from abu ‘Abdallah (a.s.) who has said the following. “When the Messenger of Allah was taken for the ascension Jibril took him to place and left him there alone. He said, “Jibril, How would leave me in such a condition?” Jibril said, “Go on. By Allah, you have stepped at a place whereat no human has ever stepped and no human had ever walked on before you.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (200/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1199,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:14",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) صِفْ لِي نَبِيَّ اللَّهِ ( عليه السلام ) قَالَ كَانَ نَبِيُّ اللَّهِ ( عليه السلام ) أَبْيَضَ مُشْرَبَ حُمْرَةٍ أَدْعَجَ الْعَيْنَيْنِ مَقْرُونَ الْحَاجِبَيْنِ شَثْنَ الْأَطْرَافِ كَأَنَّ الذَّهَبَ أُفْرِغَ عَلَى بَرَاثِنِهِ عَظِيمَ مُشَاشَةِ الْمَنْكِبَيْنِ ",
          "إِذَا الْتَفَتَ يَلْتَفِتُ جَمِيعاً مِنْ شِدَّةِ اسْتِرْسَالِهِ سُرْبَتُهُ سَائِلَةٌ مِنْ لَبَّتِهِ إِلَى سُرَّتِهِ كَأَنَّهَا وَسَطُ الْفِضَّةِ الْمُصَفَّاةِ وَ كَأَنَّ عُنُقَهُ إِلَى كَاهِلِهِ إِبْرِيقُ فِضَّةٍ يَكَادُ أَنْفُهُ إِذَا شَرِبَ أَنْ يَرِدَ الْمَاءَ وَ إِذَا مَشَى تَكَفَّأَ كَأَنَّهُ يَنْزِلُ فِي صَبَبٍ لَمْ يُرَ مِثْلُ نَبِيِّ اللَّهِ قَبْلَهُ وَ لَا بَعْدَهُ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Sayf, from Amro Bin Shimr, from Jabir who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘Describe to me the Prophet<sup>saww</sup> of Allah<sup>azwj</sup>’. He<sup>asws</sup> said: ‘He<sup>saww</sup> was white merged with red (complexion), the whiteness of his<sup>saww</sup> eyes was intensely white and the black was intensely black, the two eyebrows almost joined, fleshy limbs as if the gold had been moulded upon his<sup>saww</sup> fingers & toes, great fleshy shoulders. ",
            "Whenever he<sup>saww</sup> turned, he<sup>azwj</sup> turned entirely due to his<sup>saww</sup> uninhibitedness to make his questioner to be at ease; from below his<sup>saww</sup> neck to his<sup>saww</sup> navel was like a clear silver streak, and as if his<sup>saww</sup> necks was like shoulders of a silver jug (long); his<sup>saww</sup> nose almost touched the water when he<sup>saww</sup> drank. When he<sup>saww</sup> walked, he<sup>saww</sup> leaned as if he<sup>saww</sup> was descending into a slope. There was none like him<sup>saww</sup> a Prophet<sup>as</sup> of Allah<sup>azwj</sup> before him<sup>saww</sup>, nor after him<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 13. A number of our people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad al-Jawhari from Ali ibn abu Hamza who has said that abu Basir asked abu ‘Abdallah (a.s.) when I was also present. He said, May Allah take my soul in service for your cause, how many time the Messenger of Allah was taken for ascension?” The Imam (a.s.) said, “It happened twice. Jibril asked him to stop at a place saying wait right there O Muhammad, you have stood at a place whereat no angel or prophet has ever stood before you. Your Lord Is praying.” He asked, “O Jibril, How does He pray?” Jibril said, “He says, ‘the Glorious, the Holy, I am the Lord of the angels and the Spirit. My mercy exceeds my anger.” The Holy Prophet (s.a) then said, “O Lord, I beg Your forgiveness, I beg Your forgiveness.” The Imam (a.s.) said, “it was as Allah has said, “. . until he was as close to him as the distance of two bows, or even less.” (53:9) Abu Basir then asked, May Allah take my soul in service for your cause, what is “. . the distance of two bows, or even less.”? (53:9) The Imam (a.s.) said, “It is the distance between the ark and the head of the bow.” The Imam (a.s.) then said, “Between the two there was a barrier that shined and oscillate that I do not know except that he said it was Zabarjad (chrysolite). He looked into the light of Greatness of the size of needle’s eye or so that Allah willed. Allah, the Most Holy, the Most High, said, “O Muhammad.” He replies, Yes, my Lord.” He asked, “Who will be after you to guide your followers?” He replied, “Allah knows best.” He said, “Ali ibn abu Talib (a.s.) will be Amir al-Mu’minin (a.s.) ( the Leader with Divine Authority), the master of the Muslim, the leader of the ones marked with brightness on their foreheads.” The narrator has said the then abu ‘Abdallah (a.s.) said to abu Basir, “O abu Muhammad, by Allah, Wilaya of Amir al-Mu’minin Ali (a.s.) did not come form earth but it came from the heavens by words clearly spoken.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/208)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1200,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:15",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي جَمِيلَةَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ إِنَّ اللَّهَ مَثَّلَ لِي أُمَّتِي فِي الطِّينِ وَ عَلَّمَنِي أَسْمَاءَهُمْ كَمَا عَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا فَمَرَّ بِي أَصْحَابُ الرَّايَاتِ فَاسْتَغْفَرْتُ لِعَلِيٍّ وَ شِيعَتِهِ إِنَّ رَبِّي وَعَدَنِي فِي شِيعَةِ عَلِيٍّ خَصْلَةً قِيلَ يَا رَسُولَ اللَّهِ وَ مَا هِيَ قَالَ الْمَغْفِرَةُ لِمَنْ آمَنَ مِنْهُمْ وَ أَنْ لَا يُغَادِرَ مِنْهُمْ صَغِيرَةً وَ لَا كَبِيرَةً وَ لَهُمْ تُبَدَّلُ السَّيِّئَاتُ حَسَنَاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A nmber of our companions, from Ahmad Bin Muhammad, from Ibn Fazzal, from Abu Jameela, from Muhammad Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Made a resemblance of my<sup>saww</sup> community for me<sup>saww</sup> in the clay and Taught me<sup>saww</sup> their names just as He<sup>azwj</sup> had Taught Adam<sup>saww</sup> the names, all of them. So the owners of the flags passed by me<sup>saww</sup>, and they sought Forgiveness for Ali<sup>asws</sup> and his<sup>asws</sup> Shias. My<sup>saww</sup> Lord<sup>azwj</sup> Promised me<sup>saww</sup> a characteristic with regards to the Shias of Ali<sup>asws</sup>’. It was said, ‘O Rasool-Allah<sup>saww</sup>! And what is it?’ He<sup>saww</sup> said: ‘The Forgiveness for the ones from them who believe and that neither a minor (sin) nor a major (sin) of theirs would be left, and the evil deeds would be changed to good deeds’."
          ],
          "en.sarwar": [
            " 14. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn Sayf from ‘Amr ibn Shimr from Jabir who has said the following. “I asked abu Ja‘far (a.s.), ‘describe to me the Prophet (s.a) of Allah.” The Imam (a.s.) said, “The Holy Prophet (s.a) has a white reddish complexion, large balck eyes, the eyebrows almost joined, chubby hands and feet as if gold molded as to the form of his fingers and toes and with manifest shoulder bones. When he would turn to a person he would so with the whole of his body. Due to kind and tender heartiness. A line of hair extended from the front cavity of his neck down to his bellybutton as if it was a clear and pure silver lining. His neck was tall and clear, his nose would almost touch the water when he wanted to drink and when walking he would somehow lean forwards as if walking on a downward slope. No one similar to him was seen before or after the Holy Prophet (s.a) of Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/212)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1201,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:16",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ سَيْفٍ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ خَطَبَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) النَّاسَ ثُمَّ رَفَعَ يَدَهُ الْيُمْنَى قَابِضاً عَلَى كَفِّهِ ثُمَّ قَالَ أَ تَدْرُونَ أَيُّهَا النَّاسُ مَا فِي كَفِّي قَالُوا اللَّهُ وَ رَسُولُهُ أَعْلَمُ فَقَالَ فِيهَا أَسْمَاءُ أَهْلِ الْجَنَّةِ وَ أَسْمَاءُ آبَائِهِمْ وَ قَبَائِلِهِمْ إِلَى يَوْمِ الْقِيَامَةِ ",
          "ثُمَّ رَفَعَ يَدَهُ الشِّمَالَ فَقَالَ أَيُّهَا النَّاسُ أَ تَدْرُونَ مَا فِي كَفِّي قَالُوا اللَّهُ وَ رَسُولُهُ أَعْلَمُ فَقَالَ أَسْمَاءُ أَهْلِ النَّارِ وَ أَسْمَاءُ آبَائِهِمْ وَ قَبَائِلِهِمْ إِلَى يَوْمِ الْقِيَامَةِ ",
          "ثُمَّ قَالَ حَكَمَ اللَّهُ وَ عَدَلَ حَكَمَ اللَّهُ وَ عَدَلَ فَرِيقٌ فِي الْجَنَّةِ وَ فَرِيقٌ فِي السَّعِيرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sli Bin Ibrahim, from his father, from Al Hassan Bin Sayf, from his father, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> addressed the people, then raised his<sup>saww</sup> right hand gripping his<sup>saww</sup> palm, then said: ‘O you people! What is in my<sup>saww</sup> palm?’ They said, ‘Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> are more knowing’. So he<sup>saww</sup> said: ‘In it are the names of the inhabitants of the Paradise and the names of their fathers and their tribes, up to the Day of Judgment’. ",
            "Then he<sup>saww</sup> raised his<sup>saww</sup> left hand and he<sup>saww</sup> said: ‘O you people! Do you know what is in my<sup>saww</sup> palm?’ They said, ‘Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> are more knowing’. So he<sup>saww</sup> said: ‘The names of the inhabitants of the Fire, and the names of their fathers and their tribes, up to the Day of Judgment’. ",
            "Then he<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Judged and was Just! Allah<sup>azwj</sup> Judged and was Just! A party in the Paradise and a party in the Blazing Fire’."
          ],
          "en.sarwar": [
            " 15. A number of our people has narrated from Ahmad ibn Muhammad from Faddal from abu Jamila from Muhammad al-Halabi from abu ‘Abdallah (a.s.) who has said the following. “The Messenger of Allah has said, ‘Allah presented my ’Umma (followers) to me in the realm of clay and taught me their names jus as He had taught all the names to Adam. The people of flags passed by and I prayed to ask forgiveness for Ali (a.s.) and his followers. My Lord has promised me a quality for the Shi‘a of Ali (a.s.).” It was asked, “What is that quality O The Holy Prophet (s.a) of Allah?” He replied, “It is forgiveness for those of them who have faith and that no minor or major sins from them will be left without being changed to good deeds.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/213)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1202,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:17",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ إِسْحَاقَ بْنِ غَالِبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي خُطْبَةٍ لَهُ خَاصَّةً يَذْكُرُ فِيهَا حَالَ النَّبِيِّ وَ الْأَئِمَّةِ ( عليهم السلام ) وَ صِفَاتِهِمْ",
          "فَلَمْ يَمْنَعْ رَبَّنَا لِحِلْمِهِ وَ أَنَاتِهِ وَ عَطْفِهِ مَا كَانَ مِنْ عَظِيمِ جُرْمِهِمْ وَ قَبِيحِ أَفْعَالِهِمْ أَنِ انْتَجَبَ لَهُمْ أَحَبَّ أَنْبِيَائِهِ إِلَيْهِ",
          "وَ أَكْرَمَهُمْ عَلَيْهِ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ ( عليه السلام ) فِي حَوْمَةِ الْعِزِّ مَوْلِدُهُ وَ فِي دَوْمَةِ الْكَرَمِ مَحْتِدُهُ غَيْرَ مَشُوبٍ حَسَبُهُ وَ لَا مَمْزُوجٍ نَسَبُهُ وَ لَا مَجْهُولٍ عِنْدَ أَهْلِ الْعِلْمِ صِفَتُهُ بَشَّرَتْ بِهِ الْأَنْبِيَاءُ فِي كُتُبِهَا وَ نَطَقَتْ بِهِ الْعُلَمَاءُ بِنَعْتِهَا وَ تَأَمَّلَتْهُ الْحُكَمَاءُ بِوَصْفِهَا",
          "مُهَذَّبٌ لَا يُدَانَى هَاشِمِيٌّ لَا يُوَازَى أَبْطَحِيٌّ لَا يُسَامَى شِيمَتُهُ الْحَيَاءُ وَ طَبِيعَتُهُ السَّخَاءُ مَجْبُولٌ عَلَى أَوْقَارِ النُّبُوَّةِ وَ أَخْلَاقِهَا مَطْبُوعٌ عَلَى أَوْصَافِ الرِّسَالَةِ وَ أَحْلَامِهَا إِلَى أَنِ انْتَهَتْ بِهِ أَسْبَابُ مَقَادِيرِ اللَّهِ إِلَى أَوْقَاتِهَا وَ جَرَى بِأَمْرِ اللَّهِ الْقَضَاءُ فِيهِ إِلَى نِهَايَاتِهَا أَدَّاهُ مَحْتُومُ قَضَاءِ اللَّهِ إِلَى غَايَاتِهَا ",
          "تُبَشِّرُ بِهِ كُلُّ أُمَّةٍ مَنْ بَعْدَهَا وَ يَدْفَعُهُ كُلُّ أَبٍ إِلَى أَبٍ مِنْ ظَهْرٍ إِلَى ظَهْرٍ لَمْ يَخْلِطْهُ فِي عُنْصُرِهِ سِفَاحٌ وَ لَمْ يُنَجِّسْهُ فِي وِلَادَتِهِ نِكَاحٌ مِنْ لَدُنْ آدَمَ إِلَى أَبِيهِ عَبْدِ اللَّهِ فِي خَيْرِ فِرْقَةٍ وَ أَكْرَمِ سِبْطٍ وَ أَمْنَعِ رَهْطٍ وَ أَكْلَإِ حَمْلٍ وَ أَوْدَعِ حَجْرٍ",
          "اصْطَفَاهُ اللَّهُ وَ ارْتَضَاهُ وَ اجْتَبَاهُ وَ آتَاهُ مِنَ الْعِلْمِ مَفَاتِيحَهُ وَ مِنَ الْحُكَمِ يَنَابِيعَهُ ابْتَعَثَهُ رَحْمَةً لِلْعِبَادِ وَ رَبِيعاً لِلْبِلَادِ وَ أَنْزَلَ اللَّهُ إِلَيْهِ الْكِتَابَ فِيهِ الْبَيَانُ وَ التِّبْيَانُ قُرْآناً عَرَبِيّاً غَيْرَ ذِي عِوَجٍ لَعَلَّهُمْ يَتَّقُونَ",
          "قَدْ بَيَّنَهُ لِلنَّاسِ وَ نَهَجَهُ بِعِلْمٍ قَدْ فَصَّلَهُ وَ دِينٍ قَدْ أَوْضَحَهُ وَ فَرَائِضَ قَدْ أَوْجَبَهَا وَ حُدُودٍ حَدَّهَا لِلنَّاسِ وَ بَيَّنَهَا وَ أُمُورٍ قَدْ كَشَفَهَا لِخَلْقِهِ وَ أَعْلَنَهَا فِيهَا دَلَالَةٌ إِلَى النَّجَاةِ وَ مَعَالِمُ تَدْعُو إِلَى هُدَاهُ ",
          "فَبَلَّغَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا أُرْسِلَ بِهِ وَ صَدَعَ بِمَا أُمِرَ وَ أَدَّى مَا حُمِّلَ مِنْ أَثْقَالِ النُّبُوَّةِ وَ صَبَرَ لِرَبِّهِ وَ جَاهَدَ فِي سَبِيلِهِ وَ نَصَحَ لِأُمَّتِهِ وَ دَعَاهُمْ إِلَى النَّجَاةِ وَ حَثَّهُمْ عَلَى الذِّكْرِ وَ دَلَّهُمْ عَلَى سَبِيلِ الْهُدَى بِمَنَاهِجَ وَ دَوَاعٍ أَسَّسَ لِلْعِبَادِ أَسَاسَهَا وَ مَنَارٍ رَفَعَ لَهُمْ أَعْلَامَهَا كَيْلَا يَضِلُّوا مِنْ بَعْدِهِ وَ كَانَ بِهِمْ رَءُوفاً رَحِيماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Is’haq Bin Ghalib, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> in a sermon of his<sup>asws</sup> especially mentioning therein the state of the Prophet<sup>saww</sup> and the Imams<sup>asws</sup> and their<sup>asws</sup> description: -",
            "‘So our<sup>asws</sup> Lord<sup>azwj</sup> was not prevented, due to His<sup>azwj</sup> Forbearance and His<sup>azwj</sup> Care, and His<sup>azwj</sup> Kindness, from the greatness of their crimes and the ugliness of their deeds, that He<sup>azwj</sup> should Choose for them the most Beloved of His<sup>azwj</sup> Prophets to Him<sup>azwj</sup>. ",
            "And He<sup>azwj</sup> Honoured them upon it, Muhammad<sup>saww</sup> Bin Abdullah<sup>saww</sup> with regards to the respectability of his<sup>saww</sup> linage, and regarding the prestigious-ness of his<sup>saww</sup> family environment, without there being a blemish in his<sup>saww</sup> descent nor an inter-mingling in his<sup>asws</sup> lineage, nor being unknown in the presence of knowledgeable people of his<sup>saww</sup> description which the Prophets<sup>as</sup> had given glad tidings with, in their<sup>as</sup> Books, and the scholars had spoken with his<sup>saww</sup> epithet, and the wise ones had pondered on his<sup>saww</sup> description. ",
            "A mannerism which no Hashimite had reached or was an equivalent of, nor had a person of Bat’ha had ever reached to such a peak. And his<sup>saww</sup> nature was generous and had a natural tendency upon the dignity of the Prophet-hood and its mannerisms, bring naturally upon the qualities of the Messenger-ship and its magnanimity, up to that he<sup>saww</sup> ended up to the Pre-determinations of Allah<sup>azwj</sup> to its timings, and there flowed, by the Command of Allah<sup>azwj</sup>, the Ordainments with regards to him<sup>saww</sup> up to its end goals, fulfilling the Inevitable Ordainment of Allah<sup>azwj</sup> to its peak.",
            "Every community gave the glad tidings of it from after him<sup>saww</sup>, and every father handed it over to a father, from back to back.  There did not did not mix it in the cutthroat race and did not defile the marriage in his<sup>saww</sup> linage from since Adam<sup>as</sup> up to his<sup>saww</sup> father<sup>as</sup> Abdullah<sup>as</sup>, being in the best of the parties, and the most prestigious of tribes, and the most protected of groups, and the most preserved of lap, and the safest of laps. ",
            "Allah<sup>azwj</sup> Chose him<sup>saww</sup>, and Favoured him<sup>saww</sup>, and Selected him<sup>saww</sup>, and Gave him<sup>saww</sup> from the Knowledge, its keys, and from the Wisdom, its springs, a Mercy to the servants, and a Sustainer to the cities. An Allah<sup>azwj</sup> Revealed the Book unto him<sup>saww</sup> wherein were the statements and the explanations, <span class=\"ibTxt\">[39:28] An Arabic Quran without any crookedness, that they may fear</span>.",
            "He<sup>azwj</sup> had Explained it to the people and Programmed it with knowledge. He<sup>azwj</sup> had Detailed it, a Religion He<sup>azwj</sup> had Clarified it, and necessities He<sup>azwj</sup> had Obligated these, and Legal Punishments He<sup>azwj</sup> had Defined these for the people and explained these, and matters he<sup>saww</sup> has uncovered to His<sup>azwj</sup> creatures, and Proclaimed therein the evidence to the salvation and information Calling to His<sup>azwj</sup> Guidance.",
            "So Rasool-Allah<sup>saww</sup> delivered what He<sup>azwj</sup> had been Sent with, and expounded openly with whatever he<sup>saww</sup> had been Commanded with, and fulfilled whatever he<sup>saww</sup> was carrying from the burden of the Prophet-hood, and observed patience for his<sup>saww</sup> Lord<sup>azwj</sup>, and struggled in His<sup>azwj</sup> Way, and advised to his<sup>saww</sup> community and called them to the salvation, and urged them upon the Remembrance (Zikr), and pointed them upon the way of the Guidance by manifestos and prepared grounds of foundations for the servants, and raised beacons for them as their signs, perhaps they might not stray from after him<sup>saww</sup>, and he<sup>saww</sup> was kind and merciful with them’."
          ],
          "en.sarwar": [
            " 16. Ali ibn Ibrahim has narrated from father from al-Hassan ibn Sayf from his father from those he mentioned from abu ‘Abdallah (a.s.) who has said the following. “Once the Holy Prophet (s.a) addressed the people and he raised his right hand while holding his fingers closed and said, ‘Do you know, O people, what is in my hand?” They said, “Allah and His Messenger know best.” He then said, “In my hand there are the names of the people of Paradise, the names of their fathers and the names of their tribes up to the Day of Judgment. He then raised his left and asked, ‘O people, do you know what is my hand?” They said, “Allah and His Messenger know best.” He then said, “In my hand there are the names of the people of Hell, the names of their fathers and the names of teir tribes up to the day of Judgment.” Then he said, “Allah has decreed and He has done justice. Allah has decreed and He has done justice. One group will go to Paradise and the other group to Hell.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (216/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1203,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:18",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَعْدِ بْنِ عَبْدِ اللَّهِ عَنْ جَمَاعَةٍ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ هِلَالٍ عَنْ أُمَيَّةَ بْنِ عَلِيٍّ الْقَيْسِيِّ قَالَ حَدَّثَنِي دُرُسْتُ بْنُ أَبِي مَنْصُورٍ أَنَّهُ سَأَلَ أَبَا الْحَسَنِ الْأَوَّلَ ( عليه السلام ) أَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَحْجُوجاً بِأَبِي طَالِبٍ فَقَالَ لَا وَ لَكِنَّهُ كَانَ مُسْتَوْدَعاً لِلْوَصَايَا فَدَفَعَهَا إِلَيْهِ ( صلى الله عليه وآله ) قَالَ قُلْتُ فَدَفَعَ إِلَيْهِ الْوَصَايَا عَلَى أَنَّهُ مَحْجُوجٌ بِهِ فَقَالَ لَوْ كَانَ مَحْجُوجاً بِهِ مَا دَفَعَ إِلَيْهِ الْوَصِيَّةَ قَالَ فَقُلْتُ فَمَا كَانَ حَالُ أَبِي طَالِبٍ قَالَ أَقَرَّ بِالنَّبِيِّ وَ بِمَا جَاءَ بِهِ وَ دَفَعَ إِلَيْهِ الْوَصَايَا وَ مَاتَ مِنْ يَوْمِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Saeed Bin Abdullah, from a group of our companions,from Ahmad Bin Hilal, from Amayya Bin Ali Al Qaysi who said, ",
            "‘Dorost Bin Abu Mansour narrated to me that he asked Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, ‘Was Rasool-Allah<sup>saww</sup> (ever) cautioned by Abu Talib<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘No, he<sup>asws</sup> was a repository of the bequest, so he<sup>asws</sup> handed it over to him<sup>saww</sup>’. I said, ‘So he<sup>as</sup> handed over the bequest to him<sup>saww</sup> upon that he<sup>saww</sup> was incapacitated by him<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘Had he<sup>saww</sup> been incapacitated by him<sup>asws</sup>, he<sup>asws</sup> would not have handed over the bequest to him<sup>saww</sup>’. So I said, ‘So what was the state of Abu Talib<sup>as</sup><sup>ws</sup>?’ He<sup>saww</sup> said: ‘He<sup>as</sup><sup>ws</sup> acknowledge with the Prophet<sup>saww</sup> and with whatever he<sup>saww</sup> came with, and handed over the bequest, and passed away on that day’."
          ],
          "en.sarwar": [
            " 17. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Ishaq ibn Ghalib from abu ‘Abdallah (a.s.) who has said the following in a special sermon in which he has described the The Holy Prophet (s.a) and the Imams (a.s.) and their qualities. “Despite the great sins and their bad deeds it did not prevent Our Lord due to His forbearance, considerate and kindness to chose for them the best of His prophets and most respectable to Him who is Muhammad ibn ‘Abdallah who was born in an honorable environment and a noble family. His association was suspicious and his lineage was not unknown to the people of knowledge to describe. The glad news of his coming was mentioned in the books of the prophets and spoken of in the words of the scholars and whose qualities were discussed in the thinking of the people of wisdom. No person of Hashimit descent has ever reached the level of his discipline to become parallel to him and no person of the inhabitants of Abtah has ever climbed to his high position. Restraint was of his attributes and generosity was part of his nature. He was made with the dignity of prophet-hood and its discipline. His nature was formed out of the qualities of Divine messenger and its wisdom. The means and measures of Allah brought him to the appointed time and the decree by the commands of Allah continued to their goals. The determined decision of Allah delivered him to their objects. Every nation would gave the glad news about him to the one thereafter and every father would deliver to the next one from one generation to the next. No indecency ever mixed his element and no conjugal relation ever made him unclean from Adam to his father ‘Abdallah. He was in the best group and most honorable descent, the tribe of glory, in the well preserved womb and in the best protective hands. Allah had chosen him as it pleased Him, selected him, gave him the keys to knowledge and the sources of wisdom. He raised as the mercy and blessings for His servants and as the season of spring for His lands. Allah sent to him the Book in which there is communication and explanations. It is a reading in Arabic free of complexities so that they may perhaps observe piety (before Allah). He has explained to people. He has arranged it into a system with the knowledge that explains in details and a religion that he has clarified its obligations, determined his limits for the people and has clarified them. There are matters that He has stated to His servants openly. In it there is guidance to salvation and evidence to show the right guidance. The Messenger of Allah has preached the message that he had brought and demanded obedience to what he was ordered to preach and delivered the responsibilities of a prophet towards his followers. He exercised patience for the sake of his Lord and strove hard in the way of the Lord. He gave good advise to his followers and called them to salvation. He exhorted them in the matters of al-Dhikr (reminder) and showed them the right guidance. He did so with systems and potentials that he established on certain foundations for the servants (of Allah) and with the sources of light for which he raised proper beacons. He did so, so that they will not be mislead after him and he was very compassionate and kind to them.” for .warned made clear e in accordance with His been a parallel of him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (223/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1204,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:19",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مَنْصُورِ بْنِ الْعَبَّاسِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ يَعْقُوبَ بْنِ سَالِمٍ عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا قُبِضَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بَاتَ آلُ مُحَمَّدٍ ( عليهم السلام ) بِأَطْوَلِ لَيْلَةٍ حَتَّى ظَنُّوا أَنْ لَا سَمَاءَ تُظِلُّهُمْ وَ لَا أَرْضَ تُقِلُّهُمْ لِأَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَتَرَ الْأَقْرَبِينَ وَ الْأَبْعَدِينَ فِي اللَّهِ",
          "فَبَيْنَا هُمْ كَذَلِكَ إِذْ أَتَاهُمْ آتٍ لَا يَرَوْنَهُ وَ يَسْمَعُونَ كَلَامَهُ فَقَالَ السَّلَامُ عَلَيْكُمْ أَهْلَ الْبَيْتِ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ إِنَّ فِي اللَّهِ عَزَاءً مِنْ كُلِّ مُصِيبَةٍ وَ نَجَاةً مِنْ كُلِّ هَلَكَةٍ وَ دَرَكاً لِمَا فَاتَ ",
          "كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ وَ إِنَّما تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ الْقِيامَةِ فَمَنْ زُحْزِحَ عَنِ النَّارِ وَ أُدْخِلَ الْجَنَّةَ فَقَدْ فازَ وَ مَا الْحَياةُ الدُّنْيا إِلَّا مَتاعُ الْغُرُورِ",
          "إِنَّ اللَّهَ اخْتَارَكُمْ وَ فَضَّلَكُمْ وَ طَهَّرَكُمْ وَ جَعَلَكُمْ أَهْلَ بَيْتِ نَبِيِّهِ وَ اسْتَوْدَعَكُمْ عِلْمَهُ وَ أَوْرَثَكُمْ كِتَابَهُ وَ جَعَلَكُمْ تَابُوتَ عِلْمِهِ وَ عَصَا عِزِّهِ وَ ضَرَبَ لَكُمْ مَثَلًا مِنْ نُورِهِ وَ عَصَمَكُمْ مِنَ الزَّلَلِ وَ آمَنَكُمْ مِنَ الْفِتَنِ فَتَعَزَّوْا بِعَزَاءِ اللَّهِ",
          "فَإِنَّ اللَّهَ لَمْ يَنْزِعْ مِنْكُمْ رَحْمَتَهُ وَ لَنْ يُزِيلَ عَنْكُمْ نِعْمَتَهُ فَأَنْتُمْ أَهْلُ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ بِهِمْ تَمَّتِ النِّعْمَةُ وَ اجْتَمَعَتِ الْفُرْقَةُ وَ ائْتَلَفَتِ الْكَلِمَةُ وَ أَنْتُمْ أَوْلِيَاؤُهُ فَمَنْ تَوَلَّاكُمْ فَازَ وَ مَنْ ظَلَمَ حَقَّكُمْ زَهَقَ",
          "مَوَدَّتُكُمْ مِنَ اللَّهِ وَاجِبَةٌ فِي كِتَابِهِ عَلَى عِبَادِهِ الْمُؤْمِنِينَ ثُمَّ اللَّهُ عَلَى نَصْرِكُمْ إِذَا يَشَاءُ قَدِيرٌ فَاصْبِرُوا لِعَوَاقِبِ الْأُمُورِ فَإِنَّهَا إِلَى اللَّهِ تَصِيرُ قَدْ قَبَّلَكُمُ اللَّهُ مِنْ نَبِيِّهِ وَدِيعَةً وَ اسْتَوْدَعَكُمْ أَوْلِيَاءَهُ الْمُؤْمِنِينَ فِي الْأَرْضِ فَمَنْ أَدَّى أَمَانَتَهُ آتَاهُ اللَّهُ صِدْقَهُ",
          "فَأَنْتُمُ الْأَمَانَةُ الْمُسْتَوْدَعَةُ وَ لَكُمُ الْمَوَدَّةُ الْوَاجِبَةُ وَ الطَّاعَةُ الْمَفْرُوضَةُ وَ قَدْ قُبِضَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ قَدْ أَكْمَلَ لَكُمُ الدِّينَ وَ بَيَّنَ لَكُمْ سَبِيلَ الْمَخْرَجِ فَلَمْ يَتْرُكْ لِجَاهِلٍ حُجَّةً فَمَنْ جَهِلَ أَوْ تَجَاهَلَ أَوْ أَنْكَرَ أَوْ نَسِيَ أَوْ تَنَاسَى فَعَلَى اللَّهِ حِسَابُهُ وَ اللَّهُ مِنْ وَرَاءِ حَوَائِجِكُمْ وَ أَسْتَوْدِعُكُمُ اللَّهَ وَ السَّلَامُ عَلَيْكُمْ",
          "فَسَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) مِمَّنْ أَتَاهُمُ التَّعْزِيَةُ فَقَالَ مِنَ اللَّهِ تَبَارَكَ وَ تَعَالَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Myhammad, from Mansour Bin Al Abbas, from Ali Bin Asbat, from Yaqoub Bin Salim, from a man, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When Rasool-Allah<sup>saww</sup> passed away, the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> spent long nights until they<sup>asws</sup> thought that there is no sky to shade them nor any land below them<sup>asws</sup>, because Rasool-Allah<sup>saww</sup> had held together the near ones and the far ones for the Sake of Allah<sup>azwj</sup>. ",
            "So while they<sup>asws</sup> were in that (situation), a comer came to them. They<sup>asws</sup> were not seeing him but they<sup>asws</sup> were hearing his speech. So he said, ‘The greetings be upon you<sup>asws</sup> the People<sup>asws</sup> of the Household, and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings! In Allah<sup>azwj</sup> there is a consolation from every difficulty and salvation from every destruction, and recovery of whatever is lost.",
            "<span class=\"ibTxt\">[3:185] Every self shall taste the death, but rather you shall only be paid fully your Reward on the Day of Judgement; then whoever is removed far away from the Fire and is made to enter the Paradise he indeed has succeeded; and what is the life of the world except for a deceptive pleasure</span>.",
            "Allah<sup>azwj</sup> Chose you all (Imams<sup>asws</sup>), and Preferred you<sup>asws</sup>, and Purified you<sup>as</sup><sup>ws</sup>, and Made you<sup>asws</sup> the People<sup>asws</sup> of the Household of His<sup>azwj</sup> Prophet<sup>saww</sup>, and Entrusted His<sup>azwj</sup> Knowledge to you<sup>asws</sup>, and Made you<sup>asws</sup> to inherit His<sup>azwj</sup> Book, and Made you<sup>asws</sup> a Container of His<sup>azwj</sup> Knowledge, and a Staff of His<sup>azwj</sup> Mighty, And Struck for you<sup>asws</sup> a resemblance from His<sup>azwj</sup> Light and Protected you<sup>asws</sup> from the error, and Secured you<sup>asws</sup> from the strife. Thus, you<sup>asws</sup> were consoled by the Condolences of Allah<sup>azwj</sup>. ",
            "So Allah<sup>azwj</sup> did not Remove His<sup>azwj</sup> Mercy from you<sup>asws</sup> and never Declined His<sup>azwj</sup> Bounties from you<sup>asws</sup>. You<sup>asws</sup> are ‘أَهْلُ اللَّهِ’ the People<sup>asws</sup> of Allah<sup>azwj</sup> Mighty and Majestic, those by whom<sup>asws</sup> the Bounties are completed, and the parties gather together, and the speeches are harmonised. And you<sup>asws</sup> are the Guardians<sup>asws</sup> of Allah<sup>azwj</sup>. So the one who is in your<sup>asws</sup> Wilayah would succeed and the one who oppressed your<sup>asws</sup> rights would vanish. ",
            "(Adopting) your<sup>asws</sup> cordiality is from Allah<sup>azwj</sup>, being an Obligation in His<sup>azwj</sup> Book upon His<sup>azwj</sup> servants who are the Momineen. Then, Allah<sup>azwj</sup> is Able upon Helping you<sup>asws</sup> whenever He<sup>azwj</sup> so Desires to. Therefore, be patient for the consequential ending of the affairs, for these are proceeding to Allah<sup>azwj</sup>. Allah<sup>azwj</sup> has Accepted you<sup>asws</sup> from His<sup>azwj</sup> Prophet<sup>saww</sup> as a depository and Entrusted you<sup>asws</sup> with His<sup>azwj</sup> friends, the Momineen, in the earth. So the one who fulfils his entrustment, Allah<sup>azwj</sup> would Give him (Rewards for) his truthfulness. ",
            "Thus, you<sup>asws</sup> are the Entrusted entrustments, and for you<sup>asws</sup> is the Obligatory cordiality and the necessitated obedience, and Allah<sup>azwj</sup> has Captured (the soul of) His<sup>azwj</sup> Prophet<sup>saww</sup>, and has Perfected the Religion for you all and Explained to you the way out (deliverance). Therefore He<sup>azwj</sup> did not leave an argument for the ignorant one. So the one who is ignorant or pretends to be ignorant, or denies, or forgets, or pretends to forget, so his Reckoning is upon Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> is behind (the fulfilment of) all your needs, and I<sup>asws</sup> entrust you all to Allah<sup>azwj</sup>, and the greetings be upon you all’.",
            "So I asked Abu Ja’far<sup>asws</sup>, ‘From who does the consolation come to them<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘From Allah<sup>azwj</sup> Blessed and High’."
          ],
          "en.sarwar": [
            " 18. Muhammad ibn Yahya has narrated from Sa‘d ibn ‘Abdallah from a group of our people from Ahmad ibn Hilal from ’Umayya ibn Ali al-Qaysi who has said that narrated to me Durust ibn abu Mansur who has said the following. “ I once asked abu al-Hassan (a.s.), ‘Did the Messenger of Allah receive any authority from abu Talib (a.s.) ?” The Imam (a.s.) said, “No, but abu Talib was the trustee of certain (items) that he delivered to the Holy Prophet (s.a.) .” I then asked, “What was the condition of abu Talib?” The Imam (a.s.) Imam said, “ He acknowledged the Holy Prophet (s.a.) and his Divine message. He delivered to him the (Items of) will and died on that day.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/225)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1205,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:20",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ إِسْمَاعِيلَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا رُئِيَ فِي اللَّيْلَةِ الظَّلْمَاءِ رُئِيَ لَهُ نُورٌ كَأَنَّهُ شِقَّةُ قَمَرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Muhammad Bin Sinan, from Ibn Muskan, from Ismail Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was so that whenever Rasool-Allah<sup>saww</sup> was looked at in the dark night, there was seen to be a ‘نُورٌ’ Light for him<sup>saww</sup> as if it was a portion of the moon’."
          ],
          "en.sarwar": [
            " 19. Al-Husayn ibn Muhammad al-Asha‘ari has narrated from Mu‘alla ibn Muhammad from Mansur ibn al-‘Abbass from Ali ibn Asbat from Ya’qub ibn Salim from a man from abu Ja‘far (a.s.) who has said the following. “When the Messenger of Allah passed away the family of Muhammad (s.a.) experienced the longest night. They thought there is no sky to provide them shadow or earth to hold them up. The Messenger of Allah had united all people just for the sake of Allah. In such a condition sommeone came to them whom they would not see but would hear his words. He offered them greetings say, “Peace be with you, O members of the family of the Holy Prophet (s.a.) and may Allah’s mercy and blessings be with you. With Allah is the best of condolences for all kinds of suffering and the salvation from all forms of destruction and a remedy for the losses.. He then read the words of Allah “Every soul is destined to experience the agony of death. You (Muslims) will receive the recompense for your deeds on the Day of Judgment. To be saved from the fire and admitted to Paradise is certainly a great triumph. The worldly life is no more than a deceitful possession.” (3:185) He the continued, “Allah hass selected you, granted you distinction, purified, and made members of the family of His prophet. He has entrusted you with His knowledge and has made you to inherit His book He has made you the chest (ark) of His knowledge and the staff of His Majesty. He has given for an example of His light and has protected you from all sins and mistakes. He has protected you against all forms of mischief. Accept the condolences of Allah. Allah has not withdrawn His blessings away from you and He will never remove any of His bounties from you. You are the people of Allah, the Most Majestic, the Most Gracious, through whom the bounties increase, different groups become united and words receive harmony. You are His friends Those who would love you they achieve success and those who has said the following would do injustice to you will banish.To love you is obligatory because of the commands of Allah in His book on His believing servants. Besides, Allah is full power to help and support whenever He would wish. Exercise patience against the consequences of the matters because they all proceed to Allah.. Allah has accepted you as the Holy Prophet (s.a.) has entrusted you with Him and He has entrusted you with to His faithful friends on earth. Whoever would be truthful to the trust with him Allah will give him the reward for his truthfulness. You are the entrusted trust and to love you is made obligatory on people and obedience to you is a duty. Allah has taken His Messenger away from this world and He has completed the religion for you. He has explained to you how to come out of (difficulties). He has not left any excuse for any one. Whoever, would not know or pretend to be ignorant, deny, forget or pretend to forget will be held accountable before Allah. Allah will always pursue to fulfill your needs. I entrust you with Allah. May peace and blessings be with you.” The narrator has said that then he asked the Imam (a.s.), “ From who did the condolences came?” The Imam (a.s.) said, “It came from Allah, the Most Holy, the Most High.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (232/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1206,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:21",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنِ الْحُسَيْنِ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ الْحُسَيْنِ الصَّغِيرِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْجَعْفَرِيِّ عَنْ أَحْمَدَ بْنِ عَلِيِّ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ سَعْدِ بْنِ عَبْدِ اللَّهِ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ ابْنِ فَضَّالٍ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ نَزَلَ جَبْرَئِيلُ ( عليه السلام ) عَلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ يَا مُحَمَّدُ إِنَّ رَبَّكَ يُقْرِئُكَ السَّلَامَ وَ يَقُولُ إِنِّي قَدْ حَرَّمْتُ النَّارَ عَلَى صُلْبٍ أَنْزَلَكَ وَ بَطْنٍ حَمَلَكَ وَ حَجْرٍ كَفَلَكَ فَالصُّلْبُ صُلْبُ أَبِيكَ عَبْدِ اللَّهِ بْنِ عَبْدِ الْمُطَّلِبِ وَ الْبَطْنُ الَّذِي حَمَلَكَ فَآمِنَةُ بِنْتُ وَهْبٍ وَ أَمَّا حَجْرٌ كَفَلَكَ فَحَجْرُ أَبِي طَالِبٍ .",
          "وَ فِي رِوَايَةِ ابْنِ فَضَّالٍ وَ فَاطِمَةَ بِنْتِ أَسَدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">Ahmad Bin Idrees, from Al Husayn Bin Ubeydullah Al Husayn Al Sageer, from Muhammad Bin Ibrahim Al Ja’fary, from Ahmad Bin Ali Bin Muhammad Bin Abdullah Bin Umar son of </span>Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, from Abu Abdullah<sup>asws</sup><span style=\"font-size: small\">, and Muhammad Bin Yahya, from Sa’ad Bin Abdullah, from Yaqoub Bin Yazeed, from Ibn Fazzal, from some of his men, </span>",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘Jibraeel<sup style=\"font-weight: normal\">as</sup> descended into the Prophet<sup style=\"font-weight: normal\">saww</sup> and he<sup style=\"font-weight: normal\">as</sup> said: ‘O Muhammad<sup style=\"font-weight: normal\">saww</sup>! Your<sup style=\"font-weight: normal\">saww</sup> Lord<sup style=\"font-weight: normal\">azwj</sup> Conveys the Greetings to you<sup style=\"font-weight: normal\">saww</sup> and is Saying: “I<sup style=\"font-weight: normal\">azwj</sup> have Prohibited the Fire upon the ‘صُلْبٍ’ <span class=\"iTxt\">Sulb</span> (Linage) which brought you<sup style=\"font-weight: normal\">saww</sup> down, and the lap which bore you<sup style=\"font-weight: normal\">saww</sup>, and the lap which took care of you<sup style=\"font-weight: normal\">saww</sup>. So the صُلْبٍ is the صُلْبٍ of your<sup style=\"font-weight: normal\">saww</sup> father Abdullah Bin Abdul Muttalib, and the lap which carried you<sup style=\"font-weight: normal\">saww</sup> is Fatima<sup style=\"font-weight: normal\">asws</sup> Bin Asad<sup style=\"font-weight: normal\">as</sup>. As for the lap which took care of you<sup style=\"font-weight: normal\">saww</sup>, so it is the lap of Abu Talib<sup style=\"font-weight: normal\">as</sup><sup style=\"font-weight: normal\">ws</sup>”’. ",
            "And in a report of Ibn Fazzal: “And Fatima<sup>asws</sup> Bin Asad”’."
          ],
          "en.sarwar": [
            " 20. A number of our people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Muhammad ibn Sinan from ibn Muskan from Isma‘il ibn ‘Ammar from abu ‘Abdallah (a.s.) who has said the following “When one would look at the Messenger of Allah in the dark night a light like that from the moon could be seen from him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> سنده الول مجهول والثاني مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/232)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1207,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:22",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يُحْشَرُ عَبْدُ الْمُطَّلِبِ يَوْمَ الْقِيَامَةِ أُمَّةً وَاحِدَةً عَلَيْهِ سِيمَاءُ الْأَنْبِيَاءِ وَ هَيْبَةُ الْمُلُوكِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Umeyr, fromJameel Bin Darraj, from Zurara Bin Ayn, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abdul Muttalib<sup>as</sup><sup>ws</sup> would be Resurrected on the Day of Judgment as one community. Upon him<sup>saww</sup> would be a mark of the Prophets<sup>as</sup> and ‘هَيْبَةُ’ awe of the kings’."
          ],
          "en.sarwar": [
            " 21. Ahmad ibn Idris has narrated from al-Husayn ibn ‘Ubaydallah from abu ‘Abdallah al-Husayn al-Saghir from Muhammad ibn Ibrahim al-Ja‘fari from Ahmad ibn Ali ibn Muhammad ibn ‘Abdallah ibn ‘Umar ibn Ali ibn abu Talib from abu ‘Abdallah (a.s.) and Muhammad ibn Yahya from Sa‘d ibn ‘Abdallah from Ya’qub ibn Yazid from ibn Faddal from certain persons of his people from abu ‘Abdallah who has said the following “Jibril came to the Holy Prophet (s.a.) and said, “O Muhammad, Allah offers you greetings and says, “I have prohibited the fire to harm the man and woman who carried your seed and the man whose lap provided you protection and guardianship. The man who carried your seed is ‘Abdallah ibn ‘Abd al-Muttalib and the woman whose womb carried you is ’Amina daughter of Wahab and the man whose lap provided you protection and guardianship is abu Talib.” In the hadith of ibn Faddal it say Fatima daughter of Asad.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (236/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1208,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:23",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنِ الْهَيْثَمِ بْنِ وَاقِدٍ عَنْ مُقَرِّنٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ عَبْدَ الْمُطَّلِبِ أَوَّلُ مَنْ قَالَ بِالْبَدَاءِ يُبْعَثُ يَوْمَ الْقِيَامَةِ أُمَّةً وَحْدَهُ عَلَيْهِ بَهَاءُ الْمُلُوكِ وَ سِيمَاءُ الْأَنْبِيَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Abdul Rahman Al Asamma, from Al Haysam Bin Waqid, from Muqarran, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abdul Muttalib<sup>as</sup> was the first one who said (believed) in <span class=\"iTxt\">Al-Bada’a</span> (Change of Allah<sup>azwj</sup>’s Decision). He<sup>as</sup><sup>ws</sup> would be Resurrected on the Day of Judgment as one community. Upon him<sup>saww</sup> would be the majesty of the kings and a mark of the Prophets<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 22. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn abu ‘Umayr from Jamil ibn Darraj from Zurara ibn ‘A‘yan from abu ‘Abdallah (a.s.) who has said the following. “On the Day of Judgment ‘Abd al-Muttalib will be resurrected as a whole nation and he will have the complexion like those of the prophets and the majestic presence like those of the kings.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/237)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1209,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:24",
        "text": [
          "بَعْضُ أَصْحَابِنَا عَنِ ابْنِ جُمْهُورٍ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ وَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ جَمِيعاً عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يُبْعَثُ عَبْدُ الْمُطَّلِبِ أُمَّةً وَحْدَهُ عَلَيْهِ بَهَاءُ الْمُلُوكِ وَ سِيمَاءُ الْأَنْبِيَاءِ وَ ذَلِكَ أَنَّهُ أَوَّلُ مَنْ قَالَ بِالْبَدَاءِ ",
          "قَالَ وَ كَانَ عَبْدُ الْمُطَّلِبِ أَرْسَلَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) إِلَى رُعَاتِهِ فِي إِبِلٍ قَدْ نَدَّتْ لَهُ فَجَمَعَهَا فَأَبْطَأَ عَلَيْهِ فَأَخَذَ بِحَلْقَةِ بَابِ الْكَعْبَةِ وَ جَعَلَ يَقُولُ يَا رَبِّ أَ تُهْلِكُ آلَكَ إِنْ تَفْعَلْ فَأَمْرٌ مَا بَدَا لَكَ",
          "فَجَاءَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِالْإِبِلِ وَ قَدْ وَجَّهَ عَبْدُ الْمُطَّلِبِ فِي كُلِّ طَرِيقٍ وَ فِي كُلِّ شِعْبٍ فِي طَلَبِهِ وَ جَعَلَ يَصِيحُ يَا رَبِّ أَ تُهْلِكُ آلَكَ إِنْ تَفْعَلْ فَأَمْرٌ مَا بَدَا لَكَ وَ لَمَّا رَأَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَخَذَهُ فَقَبَّلَهُ وَ قَالَ يَا بُنَيَّ لَا وَجَّهْتُكَ بَعْدَ هَذَا فِي شَيْ‏ءٍ فَإِنِّي أَخَافُ أَنْ تُغْتَالَ فَتُقْتَلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Some of our companions, from Ibn Jamhour, from his father, from Ibn Mahboub, from Ibn Raib, from Abdul Rahman Bin Al Hajjaj, and frm Muhammad Bin Sinan, from Al Mufazzal Bin Umar, altogether, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abdul Muttalib<sup>as</sup><sup>ws</sup> would be Resurrected (on the Day of Judgment) as one community. Upon him<sup>as</sup> would be the glory of the kings and a mark of the Prophets<sup>as</sup>, and that is because he<sup>asws</sup> was the first one to say (believe) in <span class=\"iTxt\">Al-Bada’a</span> (Change of Allah<sup>azwj</sup>’s Decision’.",
            "He<sup>asws</sup> said: ‘And it was so that Abdul Muttalib<sup>as</sup><sup>ws</sup> sent Rasool-Allah<sup>saww</sup> to his<sup>as</sup><sup>ws</sup> shepherds among camels which had spread out. So he<sup>saww</sup> gathered them, but was delayed upon it. So he<sup>as</sup><sup>ws</sup> grabbed the ring of the Door of the Kabah and went on saying: ‘O Lord<sup>azwj</sup>! Will You<sup>azwj</sup> Destroy Your Sign? If You<sup>azwj</sup> do so, it would be a matter what is Changed for You<sup>azwj</sup>’. ",
            "So Rasool-Allah<sup>saww</sup> came over with the camels, and Abdul Muttalib<sup>as</sup> had looked for him<sup>saww</sup> in every road and in every cave seeking him<sup>saww</sup>, and went on shouting: ‘O Lord<sup>azwj</sup>! Will You<sup>azwj</sup> destroy Your<sup>azwj</sup> Sign? If You<sup>azwj</sup> do so, it would be a matter what is Changed for You<sup>azwj</sup>’. When he<sup>as</sup> saw Rasool-Allah<sup>saww</sup>, he<sup>as</sup> grabbed him<sup>saww</sup>, and kissed him<sup>as</sup>, and said: ‘O my<sup>as</sup> son<sup>saww</sup>! I<sup>as</sup> will not divert you<sup>saww</sup> after this with regards to anything, for I<sup>as</sup><sup>ws</sup> fear that you<sup>saww</sup> might be assassinated, murdered’."
          ],
          "en.sarwar": [
            " 23. Ali ibn Ibrahim has narrated from his father from ‘Abdallah ibn ‘Abd al-Rahman al-’Asamm from al-Hatham ibn Waqid from Muqarrin from abu ‘‘Abdallah (a.s.) who has said the following. “ ‘Abd al-Muttalib is the first one who believer in Bada’ (Allah’s revised will). He will be resurrected as a whole nation. He will have a august presence like kings and an countenance like the prophets.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/237)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1210,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:25",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ حُمْرَانَ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَمَّا أَنْ وَجَّهَ صَاحِبُ الْحَبَشَةِ بِالْخَيْلِ وَ مَعَهُمُ الْفِيلُ لِيَهْدِمَ الْبَيْتَ مَرُّوا بِإِبِلٍ لِعَبْدِ الْمُطَّلِبِ فَسَاقُوهَا فَبَلَغَ ذَلِكَ عَبْدَ الْمُطَّلِبِ فَأَتَى صَاحِبَ الْحَبَشَةِ فَدَخَلَ الْآذِنُ فَقَالَ هَذَا عَبْدُ الْمُطَّلِبِ بْنُ هَاشِمٍ قَالَ وَ مَا يَشَاءُ قَالَ التَّرْجُمَانُ جَاءَ فِي إِبِلٍ لَهُ سَاقُوهَا يَسْأَلُكَ رَدَّهَا",
          "فَقَالَ مَلِكُ الْحَبَشَةِ لِأَصْحَابِهِ هَذَا رَئِيسُ قَوْمٍ وَ زَعِيمُهُمْ جِئْتُ إِلَى بَيْتِهِ الَّذِي يَعْبُدُهُ لِأَهْدِمَهُ وَ هُوَ يَسْأَلُنِي إِطْلَاقَ إِبِلِهِ أَمَا لَوْ سَأَلَنِيَ الْإِمْسَاكَ عَنْ هَدْمِهِ لَفَعَلْتُ رُدُّوا عَلَيْهِ إِبِلَهُ فَقَالَ عَبْدُ الْمُطَّلِبِ لِتَرْجُمَانِهِ مَا قَالَ لَكَ الْمَلِكُ فَأَخْبَرَهُ فَقَالَ عَبْدُ الْمُطَّلِبِ أَنَا رَبُّ الْإِبِلِ وَ لِهَذَا الْبَيْتِ رَبٌّ يَمْنَعُهُ ",
          "فَرُدَّتْ إِلَيْهِ إِبِلُهُ وَ انْصَرَفَ عَبْدُ الْمُطَّلِبِ نَحْوَ مَنْزِلِهِ فَمَرَّ بِالْفِيلِ فِي مُنْصَرَفِهِ فَقَالَ لِلْفِيلِ يَا مَحْمُودُ فَحَرَّكَ الْفِيلُ رَأْسَهُ فَقَالَ لَهُ أَ تَدْرِي لِمَ جَاءُوا بِكَ فَقَالَ الْفِيلُ بِرَأْسِهِ لَا فَقَالَ عَبْدُ الْمُطَّلِبِ جَاءُوا بِكَ لِتَهْدِمَ بَيْتَ رَبِّكَ أَ فَتُرَاكَ فَاعِلَ ذَلِكَ فَقَالَ بِرَأْسِهِ لَا فَانْصَرَفَ عَبْدُ الْمُطَّلِبِ إِلَى مَنْزِلِهِ",
          "فَلَمَّا أَصْبَحُوا غَدَوْا بِهِ لِدُخُولِ الْحَرَمِ فَأَبَى وَ امْتَنَعَ عَلَيْهِمْ فَقَالَ عَبْدُ الْمُطَّلِبِ لِبَعْضِ مَوَالِيهِ عِنْدَ ذَلِكَ اعْلُ الْجَبَلَ فَانْظُرْ تَرَى شَيْئاً فَقَالَ أَرَى سَوَاداً مِنْ قِبَلِ الْبَحْرِ فَقَالَ لَهُ يُصِيبُهُ بَصَرُكَ أَجْمَعَ فَقَالَ لَهُ لَا وَ لَأَوْشَكَ أَنْ يُصِيبَ فَلَمَّا أَنْ قَرُبَ قَالَ هُوَ طَيْرٌ كَثِيرٌ وَ لَا أَعْرِفُهُ يَحْمِلُ كُلُّ طَيْرٍ فِي مِنْقَارِهِ حَصَاةً مِثْلَ حَصَاةِ الْخَذْفِ أَوْ دُونَ حَصَاةِ الْخَذْفِ",
          "فَقَالَ عَبْدُ الْمُطَّلِبِ وَ رَبِّ عَبْدِ الْمُطَّلِبِ مَا تُرِيدُ إِلَّا الْقَوْمَ حَتَّى لَمَّا صَارُوا فَوْقَ رُءُوسِهِمْ أَجْمَعَ أَلْقَتِ الْحَصَاةَ فَوَقَعَتْ كُلُّ حَصَاةٍ عَلَى هَامَةِ رَجُلٍ فَخَرَجَتْ مِنْ دُبُرِهِ فَقَتَلَتْهُ فَمَا انْفَلَتَ مِنْهُمْ إِلَّا رَجُلٌ وَاحِدٌ يُخْبِرُ النَّاسَ فَلَمَّا أَنْ أَخْبَرَهُمْ أَلْقَتْ عَلَيْهِ حَصَاةً فَقَتَلَتْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Umeyr, from Muhammad Bin Humran, from Aban Bin Taghlub who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When the master of Ethiopia (Abraha) diverted with the cavalry horses and with them were the elephants, in order to demolish the House (Kabah), they passed by the camels of Abdul Muttalib. So they ushered them (for themselves). So (the news of) that reached Abdul Muttalib<sup>as</sup>, and he<sup>asws</sup> came to the master of Ethiopia (Abraha). So the proclaimer entered and said, ‘This is Abdul Muttalib<sup>asws</sup> Bin Hashim<sup>asws</sup>!’. So he said, ‘And what does he<sup>asws</sup> desire?’ The translator said, ‘He<sup>asws</sup> has come regarding camels of his<sup>asws</sup> which have been ushered (by us), asking you to return them’. ",
            "So the king of Ethiopia said to his companions, ‘This is a chief of the people and their leader. I have come to his<sup>as</sup><sup>ws</sup> House which he<sup>as</sup><sup>ws</sup> worships, in order to demolish it, and he<sup>as</sup><sup>ws</sup> is asking me to free his<sup>asws</sup> camels? But, had he<sup>as</sup><sup>ws</sup> asked me to refrain from demolishing it, I would have done so. Return his<sup>as</sup><sup>ws</sup> camels to him’. So Abdul Muttalib<sup>as</sup><sup>ws</sup> said to his translator: ‘What did the king say to you?’ So he informed him<sup>as</sup><sup>ws</sup>. So Abdul Muttalib<sup>as</sup><sup>ws</sup> said: ‘I<sup>as</sup><sup>ws</sup> am the lord of the camels, and for this House (Kabah), there is a Lord<sup>azwj</sup>, Protecting it’.",
            "So he returned his<sup>as</sup><sup>ws</sup> camels to him<sup>as</sup><sup>ws</sup>, and Abdul Muttalib<sup>as</sup><sup>ws</sup> left towards his<sup>as</sup><sup>ws</sup> house. So he<sup>as</sup><sup>ws</sup> passed by the elephant during his<sup>as</sup><sup>ws</sup> leaving, and he<sup>as</sup><sup>ws</sup> said to the elephant: ‘O Mahmoud!’ So the elephant moved its head. So he<sup>as</sup><sup>ws</sup> said: ‘Do you know why they have come with you?’ So the elephant said with its head, ‘No’. So Abdul Muttalib<sup>as</sup><sup>ws</sup> said: ‘They came with you in order to demolish the House of your Lord<sup>azwj</sup>. Do you see yourself doing that?’ So it said with its head, ‘No’. So Abdul Muttalib<sup>as</sup><sup>ws</sup> left to go to his<sup>as</sup><sup>ws</sup> house’. ",
            "So when it was morning, they went with it in order to demolish the Sanctuary. But it refused and prevented upon them. So Abdul Muttalib<sup>as</sup> said to one of his<sup>as</sup><sup>ws</sup> friends during that: ‘Ascend to the top of the mountain and look if you can see anything’. So he said, ‘I see blackness from the direction of the sea’. So he<sup>as</sup> said to him: ‘Do you visualise all of it?’ So he said to him<sup>as</sup>, ‘No, I can almost see it’. So when it was nearer, he said, ‘There are a lot of birds and I do not understand it. Every bird has a pebble in its beak like a flicking pebble, or smaller than a flicking pebble’.  ",
            "So Abdul Muttalib<sup>as</sup><sup>ws</sup> said: ‘By the Lord<sup>azwj</sup> of Abdul Muttalib<sup>as</sup><sup>ws</sup>! They are not intending except for the group of people’. When they came to be above their heads, they cast the pebbles altogether, and every pebble fell on top of a man and exited from his behind, and killed him. So none escaped from them except for one man who (ran back to his hometown and) informed the people (what had happened to the king and his army). So when he had informed them, a pebble was thrown upon him, and killed him’."
          ],
          "en.sarwar": [
            " 24. Certain persons of our people have narrated from ibn Jumhur from his father from ibn Mahbub from ibn al-Ri’ab from ‘Abd al-Rahman ibn al-Hajjaj (and) from Muhammad ibn Sinan from al-Mufaddal ibn ‘Umar all from abu ‘Abdallah (a.s.) who has said the following. “‘Abd al-Muttalib will be resurrected as a whole nation (one ’Umma) with the grandeur of the kings and the complexion of the prophets. It is because he was the first one who believed in Bada’ (Allah’s revised will). Once ‘Abd al-Muttalib sent the Messenger of Allah to the shepherds of his camels to help them with a runaway camel. He collected them all but had delayed to return home. ‘Abd al-Muttalib out of anxiety was holding the ring of the door of Ka‘ba. He kept saying, “O Lord, will destroy your own people.? If You would do so then it means that You have revised you decision.” The Messenger of Allah came with camels and ‘Abd al-Muttalib had sent people to search him in all directions and valleys of (Makka). He would keep crying, “O Lord, will you destroy Your own people? If would do so then You may have revised Your decision.” When saw the Messenger of Allah he held him to kiss and said, “Son, I will not sent thereafter for anything. I am afraid for you to be kidnapped and killed.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (239/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1211,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:26",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ رِفَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ عَبْدُ الْمُطَّلِبِ يُفْرَشُ لَهُ بِفِنَاءِ الْكَعْبَةِ لَا يُفْرَشُ لِأَحَدٍ غَيْرِهِ وَ كَانَ لَهُ وُلْدٌ يَقُومُونَ عَلَى رَأْسِهِ فَيَمْنَعُونَ مَنْ دَنَا مِنْهُ فَجَاءَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ طِفْلٌ يَدْرِجُ حَتَّى جَلَسَ عَلَى فَخِذَيْهِ فَأَهْوَى بَعْضُهُمْ إِلَيْهِ لِيُنَحِّيَهُ عَنْهُ فَقَالَ لَهُ عَبْدُ الْمُطَّلِبِ دَعِ ابْنِي فَإِنَّ الْمَلَكَ قَدْ أَتَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Rifa’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abdul Muttalib<sup>as</sup><sup>ws</sup> was such that they used to furnish for him<sup>as</sup> in the courtyard of the Kabah. It was not furnished for anyone apart from him<sup>as</sup><sup>ws</sup>. And it was so that his<sup>as</sup><sup>ws</sup> sons would be standing by his<sup>as</sup><sup>ws</sup> head protecting him<sup>as</sup><sup>ws</sup> from the ones who approached him<sup>as</sup><sup>ws</sup>. So Rasool-Allah<sup>saww</sup> came over, and he<sup>saww</sup> was a child who had begun to walk, until he<sup>saww</sup> came to be upon his<sup>as</sup><sup>ws</sup> thigh. So one of them gestured towards him<sup>saww</sup> in order to prevent him<sup>saww</sup> from him<sup>asws</sup>, but Abdul Muttalib<sup>asws</sup> said to him: ‘Leave my<sup>asws</sup> son<sup>saww</sup>, for an Angel has come with him<sup>saww</sup>’ (as a servant)."
          ],
          "en.sarwar": [
            " 25. Has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn abu ‘Umayr from Muhammad ibn Humran from Aban ibn Taghlib who has said the following. “Abu ‘Abdallah (a.s.) has said, ‘When the fellow from Ethiopia marched with horse and elephants to destroy the Ka‘ba they passed by the camels of ‘Abd al-Muttalib and they herded them together. When ‘Abd al-Muttalib learned about it he went to the man from Ethiopia and asked permission for a meeting. His man told him that ‘Abd al-Muttalib ibn Hashim asks permission for a meeting. He said, “What does he want?” The translator said, “He has come asking that his camels be released.” The king of Ethiopia said to his people, “This is the leader and the chief of the people here. I have come to destroy his house of worship but asks me to order the release of his camels. Had he asked me not to destroy the house I would have done so. Release his cameels.” ‘Abd al-Muttalib asked the translator. “What did the king say?” When the words of the king were explained to him he said, “I am the owner of the camels. The house has an owner who is to protect it. His camels were release and ‘Abd al-Muttalib returned home. He passed by the elephant on his way home. He said to the elephant, “O Muhmud. The elephant shock his head. Then he said, “Do you know why have they brought you here?” The elephant said by shaking his head, “No, I do not know.” ‘Abd al-Muttalib said, “They have brought you to destroy the house of your Lord. Will you do so?” The elephant by shaking his head said, “I will not do so.” ‘Abd al-Muttalib returned home. Next morning they tried the elephant to enter the Holy precinct to destroy it but the elephant refused. ‘Abd al-Muttalib at that time said to some of his servants, “Climb up the hill and see if you observe anything.” He said, “I can see black spots in the direction of the sea. He asked, “Do you see all of it” He said, “Not all of it but almost. When the black spots came closer he said, “They are great many birds. I can see that every bird has a pebble in his beak of the size thrown with a finger.” ‘Abd al-Muttalib said, “By Allah, the Lord of ‘Abd al-Muttalib that the birds aim only those people.” When the birds arrived over their heads they threw the pebble on their heads and every pebble fell on top of their scales and pierced its way down to their bottom end and left them dead. Only man was left alive who went with the news to the others. When he gave them the new a pebble fell on his head and killed him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/249)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1212,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:27",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَعْدِ بْنِ عَبْدِ اللَّهِ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الثَّقَفِيِّ عَنْ عَلِيِّ بْنِ الْمُعَلَّى عَنْ أَخِيهِ مُحَمَّدٍ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا وُلِدَ النَّبِيُّ ( صلى الله عليه وآله ) مَكَثَ أَيَّاماً لَيْسَ لَهُ لَبَنٌ فَأَلْقَاهُ أَبُو طَالِبٍ عَلَى ثَدْيِ نَفْسِهِ فَأَنْزَلَ اللَّهُ فِيهِ لَبَناً فَرَضَعَ مِنْهُ أَيَّاماً حَتَّى وَقَعَ أَبُو طَالِبٍ عَلَى حَلِيمَةَ السَّعْدِيَّةِ فَدَفَعَهُ إِلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Sa’d Bin Abdullah, from Ibrahim Bin Muhammad Al Saqafy, from Ali Bin Al Moalla, from his brother Muhammad, from Dorost Bin Abu Mansour, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the (parents of) Prophet<sup>saww</sup> were blessed, he<sup>saww</sup> remained for days, there wasn’t any milk for him<sup>saww</sup>. So Abu Talib<sup>as</sup><sup>ws</sup> cast him<sup>saww</sup> upon his<sup>as</sup><sup>ws</sup> own breast, and Allah<sup>azwj</sup> Sent down milk from it. So he<sup>saww</sup> breast-fed from him<sup>as</sup><sup>ws</sup> for days until Abu Talib<sup>as</sup><sup>ws</sup> came to Haleema Saeeda, so he<sup>as</sup><sup>ws</sup> handed him<sup>saww</sup> over to her’."
          ],
          "en.sarwar": [
            " 26. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad ibn abu Nasr from Rifa‘Abdallah from abu ‘Abdallah (a.s.) who has said the following. “At a certain place around the Ka‘ba ‘Abd al-Muttalib’s people would spread house furnishings for him only and for no one else. His sons would stand around him for protection. Once the Messenger of Allah, then a small child who had just began to walk came to ‘Abd al-Muttalib and sat in his lap. One of the people standing as a guard came to remove the child away but ‘Abd al-Muttalib said, “Leave my child alone. The angel has just come to him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/252)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1213,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:28",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ مَثَلَ أَبِي طَالِبٍ مَثَلُ أَصْحَابِ الْكَهْفِ أَسَرُّوا الْإِيمَانَ وَ أَظْهَرُوا الشِّرْكَ فَآتَاهُمُ اللَّهُ أَجْرَهُمْ مَرَّتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘An example of Abu Talib<sup>as</sup><sup>ws</sup> is a example of the Companions of the Cave (As’haab Al-Kahf). They were secretive of the Eman and they manifested the polytheism, so Allah<sup>azwj</sup> Gave them the Recompense twice’."
          ],
          "en.sarwar": [
            " 27. Muhammad ibn Yahya has narrated from Sa‘d ibn ‘Abdallah from Ibrahim ibn Muhammad al-Thaqafi from Ali ibn Mu‘alla from his brother, Muhammad from Durust ibn abu Mansur from Ali ibn abu Hamza from abu Basir from abu ‘Abdallah (a.s.) who has said the following. “When the Holy Prophet (s.a) was born he remained for days without milk. Abu Talib himself breast fed him and Allah sent milk through his nipples. It continued for several days until abu Talib found Halima al-Sa‘diya and the child was given to her”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (253/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1214,
        "local_index": 29,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:29",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ بَكْرِ بْنِ مُحَمَّدٍ الْأَزْدِيِّ عَنْ إِسْحَاقَ بْنِ جَعْفَرٍ عَنْ أَبِيهِ ( عليه السلام ) قَالَ قِيلَ لَهُ إِنَّهُمْ يَزْعُمُونَ أَنَّ أَبَا طَالِبٍ كَانَ كَافِراً فَقَالَ كَذَبُوا كَيْفَ يَكُونُ كَافِراً وَ هُوَ يَقُولُ أَ لَمْ تَعْلَمُوا أَنَّا وَجَدْنَا مُحَمَّداً نَبِيّاً كَمُوسَى خُطَّ فِي أَوَّلِ الْكُتُبِ .",
          "وَ فِي حَدِيثٍ آخَرَ كَيْفَ يَكُونُ أَبُو طَالِبٍ كَافِراً وَ هُوَ يَقُولُ . لَقَدْ عَلِمُوا أَنَّ ابْنَنَا لَا مُكَذَّبٌ لَدَيْنَا وَ لَا يَعْبَأُ بِقِيلِ الْأَبَاطِلِ‏وَ أَبْيَضُ يُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ ثِمَالُ الْيَتَامَى عِصْمَةٌ لِلْأَرَامِلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad and Muhammad Bin Yahya, from Ahmad Bin Is’haq, from Bakr Bin Muhammad Al Azady, ",
            "(It has been narrated) from Is’haq son of Ja’far<sup style=\"font-weight: normal\">asws</sup>, from his father<sup style=\"font-weight: normal\">asws</sup>, said, ‘It was said to him<sup style=\"font-weight: normal\">asws</sup>, ‘They (people) are claiming that Abu Talib<sup style=\"font-weight: normal\">as</sup><sup style=\"font-weight: normal\">ws</sup> was a disbeliever’. So he<sup style=\"font-weight: normal\">as</sup><sup style=\"font-weight: normal\">ws</sup> said: ‘They are lying! How can he<sup style=\"font-weight: normal\">as</sup><sup style=\"font-weight: normal\">ws</sup> happen to be a disbeliever and he<sup style=\"font-weight: normal\">as</sup><sup style=\"font-weight: normal\">ws</sup> was saying: ‘Are you not knowing that we<sup style=\"font-weight: normal\">as</sup><sup style=\"font-weight: normal\">ws</sup> found Muhammad<sup style=\"font-weight: normal\">saww</sup> as a Prophet<sup style=\"font-weight: normal\">as</sup><sup style=\"font-weight: normal\">ws</sup> like Musa<sup style=\"font-weight: normal\">as</sup>, written in the former Books?’.",
            "And in another Hadeeth – ‘How can Abu Talib<sup>as</sup><sup>ws</sup> happen to be a disbeliever and he<sup>as</sup><sup>ws</sup> was saying (in prose): ‘They (people) have know that our<sup>as</sup><sup>ws</sup> son<sup>saww</sup> neither lies from us<sup>asws</sup>, nor can he<sup>saww</sup> be faulted with the words of falsehood, and he<sup>saww</sup> is white, the clouds quench by his<sup>saww</sup> face, a protector of the orphans and chastity of the widows’."
          ],
          "en.sarwar": [
            " 28. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim from abu ‘Abdallah (a.s.) who has said the following. “The case of abu Talib islike the case of the people of the cave who hid their faith and expressed polytheism. Allah gave them twice as much reward.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح وآخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/253)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1215,
        "local_index": 30,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:30",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ بَيْنَا النَّبِيُّ ( صلى الله عليه وآله ) فِي الْمَسْجِدِ الْحَرَامِ وَ عَلَيْهِ ثِيَابٌ لَهُ جُدُدٌ فَأَلْقَى الْمُشْرِكُونَ عَلَيْهِ سَلَى نَاقَةٍ فَمَلَئُوا ثِيَابَهُ بِهَا فَدَخَلَهُ مِنْ ذَلِكَ مَا شَاءَ اللَّهُ فَذَهَبَ إِلَى أَبِي طَالِبٍ فَقَالَ لَهُ يَا عَمِّ كَيْفَ تَرَى حَسَبِي فِيكُمْ فَقَالَ لَهُ وَ مَا ذَاكَ يَا ابْنَ أَخِي فَأَخْبَرَهُ الْخَبَرَ ",
          "فَدَعَا أَبُو طَالِبٍ حَمْزَةَ وَ أَخَذَ السَّيْفَ وَ قَالَ لِحَمْزَةَ خُذِ السَّلَى ثُمَّ تَوَجَّهَ إِلَى الْقَوْمِ وَ النَّبِيُّ مَعَهُ فَأَتَى قُرَيْشاً وَ هُمْ حَوْلَ الْكَعْبَةِ فَلَمَّا رَأَوْهُ عَرَفُوا الشَّرَّ فِي وَجْهِهِ ثُمَّ قَالَ لِحَمْزَةَ أَمِرَّ السَّلى عَلَى سِبَالِهِمْ فَفَعَلَ ذَلِكَ حَتَّى أَتَى عَلَى آخِرِهِمْ ثُمَّ الْتَفَتَ أَبُو طَالِبٍ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ يَا ابْنَ أَخِي هَذَا حَسَبُكَ فِينَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Al Hakam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘While the Prophet<sup>saww</sup> was in the Sacred Masjid and upon him<sup>saww</sup> were new clothes, so the Polytheists threw upon him<sup>saww</sup> the stomach contents of a she-camel. So his<sup>saww</sup> clothes were stained by it. So there entered into him<sup>saww</sup> due to that, whatever Allah<sup>azwj</sup> so Desired. So he<sup>saww</sup> went to Abu Talib<sup>as</sup><sup>ws</sup> and said to him<sup>as</sup><sup>ws</sup>: ‘O Uncle! How do you<sup>as</sup><sup>ws</sup> view my<sup>as</sup><sup>ws</sup> nobility among you all?’ So he<sup>as</sup><sup>ws</sup> said to him<sup>saww</sup>: ‘And what is that, O son<sup>saww</sup> of my<sup>as</sup><sup>ws</sup> brother<sup>as</sup>?’ So he<sup>saww</sup> informed him<sup>as</sup><sup>ws</sup> the news. ",
            "So Abu Talib<sup>as</sup><sup>ws</sup> called Hamza<sup>as</sup><sup>ws</sup> and grabbed the sword and said to Hamza<sup>as</sup><sup>ws</sup> to take the stomach contents (of a camel), then divert towards the group, and the Prophet<sup>saww</sup> was with him<sup>as</sup><sup>ws</sup>. So he<sup>as</sup><sup>ws</sup> came to the Qureysh, and they were around the Kabah. So when they saw him<sup>as</sup><sup>ws</sup>, they recognised the ferocity in his<sup>as</sup><sup>ws</sup> face. Then he<sup>as</sup><sup>ws</sup> said to Hamza<sup>as</sup><sup>ws</sup>: ‘Paste the stomach contents (of a camel) upon their faces’. So he<sup>as</sup><sup>ws</sup> did that until he<sup>as</sup><sup>ws</sup> came to their last one. Then Abu Talib<sup>as</sup><sup>ws</sup> turned towards the Prophet<sup>saww</sup>, so he<sup>as</sup><sup>ws</sup> said: ‘O son<sup>saww</sup> of my<sup>as</sup><sup>ws</sup> brother<sup>as</sup><sup>ws</sup>! This is your<sup>saww</sup> nobility among us’."
          ],
          "en.sarwar": [
            " 29. Al-Husayn ibn Muhammad and Muhammad ibn Yahya have narrated from Ahmad ibn Ishaq from Bakr ibn Muhammad al-Azdi from Ishaq ibn Ja‘far from his father (a.s.) who has said the following. “They think that abu Talib was an unbeliever. They speak lies, how could he be an unbeliever when he would say such worlds as herein below. “Do they not know that we found Muhammad as a prophet like Musa (Moses) whose name is written in the ancient books.” In another hadith he has said, “How could abu Talib be an unbeliever when he would say, “They certainly know that our child is not a liar to us and the false words are not paid any attention to. The (beautiful) white face that prays for rain from the clouds, is the helper of the orphans and the protector of the widows.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/256)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1216,
        "local_index": 31,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:31",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا تُوُفِّيَ أَبُو طَالِبٍ نَزَلَ جَبْرَئِيلُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا مُحَمَّدُ اخْرُجْ مِنْ مَكَّةَ فَلَيْسَ لَكَ فِيهَا نَاصِرٌ وَ ثَارَتْ قُرَيْشٌ بِالنَّبِيِّ ( صلى الله عليه وآله ) فَخَرَجَ هَارِباً حَتَّى جَاءَ إِلَى جَبَلٍ بِمَكَّةَ يُقَالُ لَهُ الْحَجُونُ فَصَارَ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Nasr, from Ibrahim Bin Muhammad Al Ashary, from Ubeyd Bin Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Abu Talib<sup>as</sup><sup>ws</sup> passed away, Jibraeel<sup>as</sup> descended unto Rasool-Allah<sup>saww</sup> and he<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! Exit from Makkah, for there isn’t a helper for you<sup>saww</sup> therein, and the Qureysh arose against the Prophet<sup>saww</sup>, so he<sup>saww</sup> went out fleeing until he<sup>saww</sup> came to a mountain of Makkah called Al-Hajoun, so he<sup>saww</sup> came to it’."
          ],
          "en.sarwar": [
            " 30. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn al-Hakam from abu ‘Abdallah (a.s.) who has said the following. “Once when the Holy Prophet (s.a) in the sacred Mosque wearing new clothes the pagans threw the contents of the stomach of camel on him and his new clothes was messed up. Allah knows how hard it was for him. He went to abu Talib and asked, “How is mannerism and discipline among you?” He asked what is the matter, O son of my brother?” The Holy Prophet (s.a) informed him of the incident. Abu Talib called Hamza and pickup a sword. He asked Hamza to pick up the stomach of the camel and they came to the peole along with the Holy Prophet (s.a). They found people of Quraysh around the Ka‘ba. When the saw him they read trouble from his face. Abu Talib asked Hamza to level of the contents of camel stomach against everyone’s mustache and Hamza did so to the last person. Abu Talib then turned to the Holy Prophet (s.a) and said, “Son of my brother, this is how much we value your mannerism and discipline (face such great risk).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/257)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1217,
        "local_index": 32,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:32",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أَبَا طَالِبٍ أَسْلَمَ بِحِسَابِ الْجُمَّلِ قَالَ بِكُلِّ لِسَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Abdullah and Muhammad Bin Yahya, from Muhammad Bin Abdullah, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abu Talib<sup>as</sup><sup>ws</sup> professed to Al-Islam by the accounting of Al-Jummal (Use of alphabetical letters in accordance to their numerical value)’. He<sup>asws</sup> said: ‘In every language’."
          ],
          "en.sarwar": [
            " 31. Ali has narrated from his father from ibn abu Nasr from Ibrahim ibn Muhammad al-Ash‘ari from ‘Ubayd ibn Zurara from abu ‘Abdallah (a.s.) who has said the following. “When abu Talib (a.s.) passed away, Jibril came to the Messenger of Allah and said, “O Muhammad, migrate from Makka. There is no one to help you. Qurash revolted against the Holy Prophet (s.a) and came out of Makka running away until he reach one of the mountains of Makka. Called al-Hajun. He went there.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/257)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1218,
        "local_index": 33,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:33",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ وَ عَبْدِ اللَّهِ ابْنَيْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِيهِمَا عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ إِسْمَاعِيلَ بْنِ أَبِي زِيَادٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَسْلَمَ أَبُو طَالِبٍ بِحِسَابِ الْجُمَّلِ وَ عَقَدَ بِيَدِهِ ثَلَاثاً وَ سِتِّينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad and Abdullah, two sons of Muhammad Bin Isa, from their father, from Abdullah Bin Al Mugheira, from Ismail Bin Abu Ziyad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abu Talib<sup>asws</sup> professed to Al-Islam by the accounting of Al-Jummal (Use of alphabetical letters in accordance to their numerical value)’, and he<sup>asws</sup> formed ‘sixty three’ with his<sup>asws</sup> hands’."
          ],
          "en.sarwar": [
            " 32. Ali ibn Muhammad ibn ‘Abdallah and Muhammad ibnyh have narrated from Muhammad ibn ‘Abdallah who in a in a marfu‘ manner has narrated it from abu ‘Abdallah (a.s.) who has said the following. “Abu Talib acknowledged Islam through the expression of (al-Jummal). (It is a system wherein each letter of the alphabet is given a certain numerical and instead of a letter its numeric value is used for secrecy or other reasons.)”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/258)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1219,
        "local_index": 34,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:34",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْحُسَيْنِ بْنِ عُلْوَانَ الْكَلْبِيِّ عَنْ عَلِيِّ بْنِ الْحَزَوَّرِ الْغَنَوِيِّ عَنْ أَصْبَغَ بْنِ نُبَاتَةَ الْحَنْظَلِيِّ قَالَ رَأَيْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) يَوْمَ افْتَتَحَ الْبَصْرَةَ وَ رَكِبَ بَغْلَةَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ قَالَ أَيُّهَا النَّاسُ أَ لَا أُخْبِرُكُمْ بِخَيْرِ الْخَلْقِ يَوْمَ يَجْمَعُهُمُ اللَّهُ فَقَامَ إِلَيْهِ أَبُو أَيُّوبَ الْأَنْصَارِيُّ فَقَالَ بَلَى يَا أَمِيرَ الْمُؤْمِنِينَ حَدِّثْنَا فَإِنَّكَ كُنْتَ تَشْهَدُ وَ نَغِيبُ فَقَالَ إِنَّ خَيْرَ الْخَلْقِ يَوْمَ يَجْمَعُهُمُ اللَّهُ سَبْعَةٌ مِنْ وُلْدِ عَبْدِ الْمُطَّلِبِ لَا يُنْكِرُ فَضْلَهُمْ إِلَّا كَافِرٌ وَ لَا يَجْحَدُ بِهِ إِلَّا جَاحِدٌ",
          "فَقَامَ عَمَّارُ بْنُ يَاسِرٍ رَحِمَهُ اللَّهُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ سَمِّهِمْ لَنَا لِنَعْرِفَهُمْ فَقَالَ إِنَّ خَيْرَ الْخَلْقِ يَوْمَ يَجْمَعُهُمُ اللَّهُ الرُّسُلُ وَ إِنَّ أَفْضَلَ الرُّسُلِ مُحَمَّدٌ ( صلى الله عليه وآله ) وَ إِنَّ أَفْضَلَ كُلِّ أُمَّةٍ بَعْدَ نَبِيِّهَا وَصِيُّ نَبِيِّهَا حَتَّى يُدْرِكَهُ نَبِيٌّ",
          "أَلَا وَ إِنَّ أَفْضَلَ الْأَوْصِيَاءِ وَصِيُّ مُحَمَّدٍ عَلَيْهِ وَ آلِهِ السَّلَامُ أَلَا وَ إِنَّ أَفْضَلَ الْخَلْقِ بَعْدَ الْأَوْصِيَاءِ الشُّهَدَاءُ أَلَا وَ إِنَّ أَفْضَلَ الشُّهَدَاءِ حَمْزَةُ بْنُ عَبْدِ الْمُطَّلِبِ وَ جَعْفَرُ بْنُ أَبِي طَالِبٍ لَهُ جَنَاحَانِ خَضِيبَانِ يَطِيرُ بِهِمَا فِي الْجَنَّةِ لَمْ يُنْحَلْ أَحَدٌ مِنْ هَذِهِ الْأُمَّةِ جَنَاحَانِ غَيْرُهُ شَيْ‏ءٌ كَرَّمَ اللَّهُ بِهِ مُحَمَّداً ( صلى الله عليه وآله ) وَ شَرَّفَهُ وَ السِّبْطَانِ الْحَسَنُ وَ الْحُسَيْنُ وَ الْمَهْدِيُّ ( عليهم السلام ) يَجْعَلُهُ اللَّهُ مَنْ شَاءَ مِنَّا أَهْلَ الْبَيْتِ",
          "ثُمَّ تَلَا هَذِهِ الْآيَةَ وَ مَنْ يُطِعِ اللَّهَ وَ الرَّسُولَ فَأُولئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَ الصِّدِّيقِينَ وَ الشُّهَداءِ وَ الصَّالِحِينَ وَ حَسُنَ أُولئِكَ رَفِيقاً. ذلِكَ الْفَضْلُ مِنَ اللَّهِ وَ كَفى بِاللَّهِ عَلِيماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Al Hsayn Bin Ulwan Al Kalby, from Ali Bin Al Hazawwar Al Ghanawy, from Asbagh Bin Nubata Al Hanzaly who said, ",
            "‘I saw Amir Al-Momineen<sup>asws</sup> on the day he<sup>asws</sup> was victorious over Al-Basra and rode the mule of Rasool-Allah<sup>saww</sup>, then said: ‘O you people! Shall I<sup>asws</sup> inform you with the nest of the creature on the Day Allah<sup>azwj</sup> would Gather them?’ So Abu Ayoub Al-Alansary stood up to him<sup>asws</sup> and said, ‘Yes, O Amir Al-Momineen<sup>asws</sup>! Narrate to us, for you<sup>asws</sup> were present and we were absent’. So he<sup>asws</sup> said: ‘The best of the creatures on the Day Allah<sup>azwj</sup> would Gather them, are seven from the sons of Abdul Muttalib. None will deny their merits except for an Infidel, nor would anyone reject it except for a renegade’. ",
            "So Ammar Bin Yasir, may Allah<sup>azwj</sup> have Mercy on him stood up and he said, ‘O Amir Al-Momineen<sup>asws</sup>! Name them for us in order for us to recognise them’. So he<sup>asws</sup> said: ‘The best of the creatures on the Day Allah<sup>azwj</sup> would Gather them are the Rasools<sup>saww</sup>, and that the most superior of the Rasools<sup>as</sup> is Muhammad<sup>saww</sup>, and that the most superior of every community after its Prophet<sup>saww</sup> is the successor<sup>as</sup> of its Prophet<sup>as</sup>, until he<sup>as</sup> comes across a (another) Prophet<sup>as</sup>. ",
            "Indeed! And the most superior of the succesors<sup>as</sup> is the successor<sup>asws</sup> of Muhammad<sup>saww</sup>, may the greetings be upon him<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>. Indeed! And the most superior of the creatures after the succesors<sup>as</sup> are the martyrs. Indeed! And the most superior of the martyrs is Hamza<sup>asws</sup> Bin Abdul Muttalib<sup>asws</sup>, and Ja’far<sup>asws</sup> Bin Abu Talib<sup>asws</sup>. For him<sup>asws</sup> are two fresh wings. He<sup>as</sup><sup>ws</sup> flies with these two in the Paradise. No one from this community has been Granted two wings apart from him<sup>asws</sup>. It is a thing which Allah<sup>azwj</sup> Prestige Muhammad<sup>saww</sup> with, and Ennobled him<sup>saww</sup>, and the two grandsons Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>, and Al-Mahdy<sup>asws</sup>. Allah<sup>azwj</sup> would Make him<sup>asws</sup> to be the one whomsoever Allah<sup>azwj</sup> so Desires from us<sup>asws</sup>, the People<sup>asws</sup> of the Household’. ",
            "Then he<sup>asws</sup> recited this Verse <span class=\"ibTxt\">[4:69] And whoever obeys Allah and the Rasool, these are with those upon whom Allah has Bestowed Favours from among the Prophets and the Truthful and the Martyrs and the Righteous, and a goodly company are they! [4:70] That is the Grace from Allah, and Sufficient is Allah as the Knower</span>’."
          ],
          "en.sarwar": [
            " 33. Muhammad ibn Yahya has narrated from from Ahmad and ‘Abdallah sons of Muhammad ibn ‘Isa from their father from ‘Abdallah ibn ;a-Mughira from ’Isma‘il ibn abu Ziyad from abu ‘Abdallah (a.s.) who has said the following. “Abu Talib acknowledged Islam through the expression of al-Jummal. He formed number sixty three with his hands.” Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn al-Faddal from al-Husayn ibn ‘Ulwan al-Kalbi from Ali ibn al-Hazawwar al-Ghanawi from Asbagh ibn Nubata al-Hanzali who has said the following. “I saw Amir al-Mu’minin Ali (a.s.) on the day of victory in Basra while he was riding the on the mule of the Messenger of Allah (then) he said, “O people do you want me to tell who the best of the creatures of Allah will be on the Day when He will bring all of them at one place?” Abu Ayyub al-Ansari stood up and said, “Yes, O Amir al-Mu’minin (a.s.) please explain to use. Your were present and we were absent.” The Imam (a.s.) then said, “The best of the people on the day of resurrection when will bring all people together are seven people from the descendant of ‘Abd al-Muttalib whose distinction no one except an unbeliever would deny and no one would reject except a deviant.” ‘Ammar ibn Yasir (may Allah grand him blessings) then stood up and said, “O Amir al-Mu’minin (a.s.) tell us their names so we can recognise them properly..” The Imam (a.s.) said, “The best in the creatures of Allah on the Day when He will bring all creature together are the messenger and the best of the messengers is Muhammad (s.a). The best after the prophet in his ’Umma (followers) is the executor of his will until the prophet would come. There is no doubt that the best among the executors of the wills of the prophets is the executor of the will of Prophet Muhammad (s.a). There is also no doubt that the best among the people after the executors of the will of the prophets are the martyrs and the best of the martyrs is Hamza ibn ‘Abd al-Muttalib and Ja‘far ibn abu Talib who were given two fresh wings with which they fly in Paradise. No one else besides him from this ’Umma. With this Allah honored and granted dignity t Muhammad (s.a). Also of the seven people are the two grand sons of the Holy Prophet (s.a) and al-Mahdi (a.s.). Whoever Allah would want will al-Mahdi from us Ahl al-Bayt. The he read this verse of the Holy Quran. “One who obeys God and the Messenger is the friend of the Prophets, saints, martyrs, and the righteous ones to whom God has granted His favors. They are the best friends that one can have (4:69). The favors of God are such, and He knows very well (how to reward you).” (4:70)”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (262/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1220,
        "local_index": 35,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:35",
        "text": [
          "مُحَمَّدُ بْنُ الْحُسَيْنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ أَبِي مَرْيَمَ الْأَنْصَارِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ كَيْفَ كَانَتِ الصَّلَاةُ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) قَالَ لَمَّا غَسَّلَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ كَفَّنَهُ سَجَّاهُ ثُمَّ أَدْخَلَ عَلَيْهِ عَشَرَةً فَدَارُوا حَوْلَهُ ثُمَّ وَقَفَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي وَسَطِهِمْ فَقَالَ إِنَّ اللَّهَ وَ مَلائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَ سَلِّمُوا تَسْلِيماً فَيَقُولُ الْقَوْمُ كَمَا يَقُولُ حَتَّى صَلَّى عَلَيْهِ أَهْلُ الْمَدِينَةِ وَ أَهْلُ الْعَوَالِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Husayn, from Sahl Bin Ziyad, from Ibn Fazzal, from Ali Bin Al Numan, from Abu Maryam Al Ansary, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘How was the (funeral) <span class=\"iTxt\">Salat</span> upon the Prophet<sup>saww</sup>?’ When Amir Al-Momineen<sup>asws</sup> washed him<sup>saww</sup> and enshrouded him<sup>saww</sup>, covered him<sup>saww</sup>. Then ten (people) came over to him<sup>saww</sup> and they circled around him<sup>saww</sup>. Then Amir Al-Momineen<sup>asws</sup> paused in the middle of them and he<sup>asws</sup> said: ‘<span class=\"ibTxt\">[33:56] Surely Allah and His Angels are Sending Blessings upon the Prophet; O you who believe! Send blessings upon him and submit to him with a (complete) submission</span>’. So the people were saying just as he<sup>asws</sup> was saying until the people of Al-Medina had prayed <span class=\"iTxt\">Salat</span> upon him<sup>saww</sup>, and (so did) the people of Al-Awaly’."
          ],
          "en.sarwar": [
            " 34. Muhammad ibn al-Husayn has narrated from Sahl ibn Ziyad from ibn al-Faddal from Ali ibn al-Nu‘man from abu Maryam al-Ansari who has said the following. “I asked abu Ja‘far (a.s.),”How was the prayer for the dead body of the Holy Prophet (s.a)?” The Imam (a.s.) said, “When Amir al-Mu’minin Ali (a.s.) washed his body and he placed him in the shroud and covered his body then ten persons came in and they walked around him. Amir al-Mu’minin Ali (a.s.) then stood in the middle of them and said, “God showers His blessings upon the Prophet and the angels seek forgiveness for him. Believers, pray for the Prophet and greet him with, “Peace be with you.” (33:56) The group also said what the Imam (a.s.) had said until the people of Madina and people of ‘Awali also said so.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/264)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1221,
        "local_index": 36,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:36",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ أَبِي الْمَغْرَاءِ عَنْ عُقْبَةَ بْنِ بَشِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) لِعَلِيٍّ ( عليه السلام ) يَا عَلِيُّ ادْفِنِّي فِي هَذَا الْمَكَانِ وَ ارْفَعْ قَبْرِي مِنَ الْأَرْضِ أَرْبَعَ أَصَابِعَ وَ رُشَّ عَلَيْهِ مِنَ الْمَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Ali Bin Sayf, from Abu Al Magra’a, from Uqba Bin Bashir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said to Ali<sup>asws</sup>: ‘O Ali<sup>asws</sup>! Bury me<sup>saww</sup> in this place, and raise my<sup>saww</sup> grave from the ground by four fingers, and sprinkle upon it from the water’."
          ],
          "en.sarwar": [
            " 35. Muhammad ibn Yahya has narrated from from Salma ibn al-Khattab from Ali ibn Sayf from abu al-Maghra’ from ‘Uqba ibn Bashir from abu Ja‘far (a.s.) who has said the following. “The Holy Prophet (s.a) said to Ali (a.s.), O Ali, bury me in this place, raise the surface of my grave from the ground by the width of four fingers and sprinkle water on it.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/266)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1222,
        "local_index": 37,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:37",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَتَى الْعَبَّاسُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ يَا عَلِيُّ إِنَّ النَّاسَ قَدِ اجْتَمَعُوا أَنْ يَدْفِنُوا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فِي بَقِيعِ الْمُصَلَّى وَ أَنْ يَؤُمَّهُمْ رَجُلٌ مِنْهُمْ فَخَرَجَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِلَى النَّاسِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) إِمَامٌ حَيّاً وَ مَيِّتاً وَ قَالَ إِنِّي أُدْفَنُ فِي الْبُقْعَةِ الَّتِي أُقْبَضُ فِيهَا",
          "ثُمَّ قَالَ عَلَى الْبَابِ فَصَلَّى عَلَيْهِ ثُمَّ أَمَرَ النَّاسَ عَشَرَةً عَشَرَةً يُصَلُّونَ عَلَيْهِ ثُمَّ يَخْرُجُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Al-Abbas came over to Amir Al-Momineen<sup>asws</sup>, so he said, ‘O Ali<sup>asws</sup>! The people are gathering that they would be burning Rasool-Allah<sup>saww</sup> in the spot of the Praying place, and that a man from them would be leading the (funeral) <span class=\"iTxt\">Salat</span>. So Amir Al-Momineen<sup>asws</sup> came out to the people and he<sup>asws</sup> said: ‘O you people! Rasool-Allah<sup>saww</sup> is an Imam<sup>asws</sup>, be he<sup>saww</sup> alive or expired, and he<sup>saww</sup> said: ‘I<sup>saww</sup> want to be buried in the spot in which I<sup>saww</sup> would pass away’.  ",
            "Then he<sup>asws</sup> said: ‘(Come) at the door, so pray <span class=\"iTxt\">Salat</span> upon him<sup>saww</sup>’. Then he<sup>asws</sup> instructed the people, ten by ten to be praying <span class=\"iTxt\">Salat</span> upon him<sup>saww</sup>. Then they went out’."
          ],
          "en.sarwar": [
            " 36. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabi from abu ‘Abdallah (a.s.) who has said the following. “Al-‘Abbass came to Amir al-Mu’minin Ali (a.s.) and said, “O Ali, people have come in a group to bury the Messenger of Allah in Baqi‘, the prayer place. Amir al-Mu’minin Ali (a.s.) them came out to the people and said, “O people, the Messenger of Allah is the Imam whether dead or living. He had said that he must be buried in the place where he died.. He then stood at the door and prayed for him. Then he commanded every ten people to come in and pray for him and come out”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/266)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1223,
        "local_index": 38,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:38",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا قُبِضَ النَّبِيُّ ( صلى الله عليه وآله ) صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ وَ الْمُهَاجِرُونَ وَ الْأَنْصَارُ فَوْجاً فَوْجاً ",
          "قَالَ وَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ فِي صِحَّتِهِ وَ سَلَامَتِهِ إِنَّمَا أُنْزِلَتْ هَذِهِ الْآيَةُ عَلَيَّ فِي الصَّلَاةِ عَلَيَّ بَعْدَ قَبْضِ اللَّهِ لِي إِنَّ اللَّهَ وَ مَلائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَ سَلِّمُوا تَسْلِيماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Ali Bin Sayf, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When the Prophet<sup>saww</sup> passed away, there Prayed <span class=\"iTxt\">Salat</span> upon him<sup>saww</sup>, the Angels, and the Emigrants, and the Helpers, droves and droves’. ",
            "He<sup>asws</sup> said: ‘And Amir Al-Momineen<sup>asws</sup> said: ‘I<sup>asws</sup> heard Rasool-Allah<sup>saww</sup> saying during his<sup>saww</sup> good health and his<sup>saww</sup> well-being: ‘But rather, this Verse was Revealed unto me<sup>saww</sup> regarding the <span class=\"iTxt\">Salat</span> upon me<sup>saww</sup> after Allah<sup>azwj</sup> Captures (my<sup>saww</sup> soul) <span class=\"ibTxt\">[33:56] Surely Allah and His Angels are Sending Blessings upon the Prophet; O you who believe! Send blessings upon him and submit to him with a (complete) submission</span>’."
          ],
          "en.sarwar": [
            " 37. Muhammad ibn Yahya has narrated from from Salma ibn al-Khattab from Ali ibn Sayf from ‘Amr ibn Shimr from Jabir from abu Ja‘far (a.s.) who has said the following. “When the Holy Prophet (s.a) passed away, the angels, the immigrant Muslims (al-Muhajirun) and the helping Muslims (al-Ansar) prayed over his body group after group.” The narrator has said that Amir al-Mu’minin Ali (a.s.) has said, “I heard the Messenger of Allah say in good health, “This verse is revealed to me about praying for after I Allah will take me away from this world. ““God showers His blessings upon the Prophet and the angels seek forgiveness for him. Believers, pray for the Prophet and greet him with, “Peace be with you.” (33:56)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/267)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1224,
        "local_index": 39,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:39",
        "text": [
          "بَعْضُ أَصْحَابِنَا رَفَعَهُ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ دَاوُدَ بْنِ كَثِيرٍ الرَّقِّيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ مَا مَعْنَى السَّلَامِ عَلَى رَسُولِ اللَّهِ فَقَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمَّا خَلَقَ نَبِيَّهُ وَ وَصِيَّهُ وَ ابْنَتَهُ وَ ابْنَيْهِ وَ جَمِيعَ الْأَئِمَّةِ وَ خَلَقَ شِيعَتَهُمْ أَخَذَ عَلَيْهِمُ الْمِيثَاقَ وَ أَنْ يَصْبِرُوا وَ يُصَابِرُوا وَ يُرَابِطُوا وَ أَنْ يَتَّقُوا اللَّهَ ",
          "وَ وَعَدَهُمْ أَنْ يُسَلِّمَ لَهُمُ الْأَرْضَ الْمُبَارَكَةَ وَ الْحَرَمَ الْآمِنَ وَ أَنْ يُنَزِّلَ لَهُمُ الْبَيْتَ الْمَعْمُورَ وَ يُظْهِرَ لَهُمُ السَّقْفَ الْمَرْفُوعَ وَ يُرِيحَهُمْ مِنْ عَدُوِّهِمْ وَ الْأَرْضِ الَّتِي يُبَدِّلُهَا اللَّهُ مِنَ السَّلَامِ وَ يُسَلِّمُ مَا فِيهَا لَهُمْ لَا شِيَةَ فِيهَا ",
          "قَالَ لَا خُصُومَةَ فِيهَا لِعَدُوِّهِمْ وَ أَنْ يَكُونَ لَهُمْ فِيهَا مَا يُحِبُّونَ وَ أَخَذَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَى جَمِيعِ الْأَئِمَّةِ وَ شِيعَتِهِمُ الْمِيثَاقَ بِذَلِكَ وَ إِنَّمَا السَّلَامُ عَلَيْهِ تَذْكِرَةُ نَفْسِ الْمِيثَاقِ وَ تَجْدِيدٌ لَهُ عَلَى اللَّهِ لَعَلَّهُ أَنْ يُعَجِّلَهُ جَلَّ وَ عَزَّ وَ يُعَجِّلَ السَّلَامَ لَكُمْ بِجَمِيعِ مَا فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Some of our companions, raising it, from Muhammad Bin Sinan, from DAwood Bin Kaseer Al Raqqy who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is the Meaning of the greetings upon Rasool-Allah<sup>saww</sup>?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High, when He<sup>azwj</sup> Created His<sup>azwj</sup> Prophet<sup>saww</sup> and his<sup>saww</sup> successor<sup>asws</sup> and his<sup>saww</sup> daughter, and his<sup>saww</sup> two (grand) sons<sup>asws</sup>, and the entirety of the Imams<sup>asws</sup>, and Created their<sup>asws</sup> Shias, Took the Covenant upon them that they would be patient, and (make others to) observe patience, and that they would fear Allah<sup>azwj</sup>. ",
            "And He<sup>azwj</sup> Promised them that He<sup>azwj</sup> would Submit the Blessed earth to them, and the ‘الْحَرَمَ الْآمِنَ’ Just Al-Harrum, and that He<sup>azwj</sup> would Bring down the Oft-Frequented House (Bayt Al-Mamour) to them, and He<sup>azwj</sup> would Manifest the Raised Ceiling to them, and Given them rest/respite from their enemies, and the earth Which Allah<sup>azwj</sup> would Change for them from the peace and safety for whatever it therein for them there being no blemish in it’. ",
            "He<sup>asws</sup> said: ‘There will be no disputes therein of their enemies, and there would happen to be for them in it what they would be loving. And Rasool-Allah<sup>saww</sup> took the Covenant upon the entirety of the Imams<sup>asws</sup> and their<sup>asws</sup> Shias with that. And rather, the greetings upon him<sup>saww</sup> is a reminder to the self of the Covenant and the renewal of it upon Allah<sup>azwj</sup>, perhaps He<sup>azwj</sup> the Majestic and Mighty might Hasten the peace for you all with the entirety of whatever is in it’."
          ],
          "en.sarwar": [
            " 38. Certain persons of our people have narrated from in a in a marfu‘ manner have narrated from Muhammad ibn Sinan from Dawud ibn Kathir al-Raqqi who has said that he asked abu ‘Abdallah (a.s.) the following. “What is the meaning of ‘peace be with the Messenger of Allah’?” The Imam (a.s.) said, “When Allah, the Most Holy, the Most High, created His Prophet, the executor of the will of His Prophet, the daughter of His Prophet, their two sons, all the Imams (a.s.) and their Shi‘a (followers) He made them to form a covenant to exercise patience, help to exercise patience, establish good relations and live piously before Allah. He promised them to give to them the blessed land and sacred sanctuary and to bring down to them the constructed house (al-Bayt al-Ma‘mur) and to manifest to the raised ceiling (alsaqf al-Marfu‘) and grant them relief against their enemies. Also He grant them the earth that He will change with peace and protect all that is therein for them without any quarrels therein against the enemies and there will exist all that they would love. The Messenger of Allah made all the Imams and their Shi‘a to form a covenant similarly. Offering of peace to him is to remind of that covenant and renew it before Allah. that pehaps He, the Most Majestic, the Most gracious, would allow that peace to take place soon for all of you with all that is therein.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/268)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1225,
        "local_index": 40,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:111:40",
        "text": [
          "ابْنُ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ صَفِيِّكَ وَ خَلِيلِكَ وَ نَجِيِّكَ الْمُدَبِّرِ لِأَمْرِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘O Allah<sup>azwj</sup>! Send <span class=\"iTxt\">Salawat</span> upon Muhammad<sup>saww</sup>, Your<sup>azwj</sup> elite and Your<sup>azwj</sup> friend, and Your<sup>azwj</sup> confidant, the manager of Your<sup>azwj</sup> affairs’."
          ],
          "en.sarwar": [
            " 39. Ibn Mahbub has narrated from ‘Abdallah ibn Sinan who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘O Lord, grant blessings up on Muhammad, Your chosen one, Your friend and Your selected one who manages Your affairs.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:111",
  "kind": "verse_list"
}