{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 112"
        },
        "path": "/books/al-kafi:1:4:112",
        "titles": {
          "ar": "باب النَّهْيِ عَنِ الْإِشْرَافِ عَلَى قَبْرِ النَّبِيِّ ( صلى الله عليه وآله )",
          "en": "Chapter 112 – The Forbiddance from climbing upon the grave of the Prophet<sup>saww</sup>"
        }
      }
    ],
    "index": 170,
    "local_index": 112,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 113"
        },
        "path": "/books/al-kafi:1:4:113",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَوْلِدِ أَمِيرِ</span> الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ",
          "en": "Chapter 113 – Nazool (Arrival) of Amir Al-Momineen<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 111"
        },
        "path": "/books/al-kafi:1:4:111",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب مَوْلِدِ النَّبِيِّ</span> ( صلى الله عليه وآله ) وَ وَفَاتِهِ",
          "en": "Chapter 111 – Nazool (Arrival) of the Prophet<sup>saww</sup> and his<sup>saww</sup> demise"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:112",
    "titles": {
      "ar": "باب النَّهْيِ عَنِ الْإِشْرَافِ عَلَى قَبْرِ النَّبِيِّ ( صلى الله عليه وآله )",
      "en": "Chapter 112 – The Forbiddance from climbing upon the grave of the Prophet<sup>saww</sup>"
    },
    "verse_count": 1,
    "verse_start_index": 1225,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1226,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/114",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1206",
              "text": "جَعْفَرِ بْنِ الْمُثَنَّى الْخَطِيبِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ جَعْفَرِ بْنِ الْمُثَنَّى الْخَطِيبِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:112:1",
        "text": [
          " كُنْتُ بِالْمَدِينَةِ وَ سَقْفُ الْمَسْجِدِ الَّذِي يُشْرِفُ عَلَى الْقَبْرِ قَدْ سَقَطَ وَ الْفَعَلَةُ يَصْعَدُونَ وَ يَنْزِلُونَ وَ نَحْنُ جَمَاعَةٌ فَقُلْتُ لِأَصْحَابِنَا مَنْ مِنْكُمْ لَهُ مَوْعِدٌ يَدْخُلُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) اللَّيْلَةَ فَقَالَ مِهْرَانُ بْنُ أَبِي نَصْرٍ أَنَا وَ قَالَ إِسْمَاعِيلُ بْنُ عَمَّارٍ الصَّيْرَفِيُّ أَنَا فَقُلْنَا لَهُمَا سَلَاهُ لَنَا عَنِ الصُّعُودِ لِنُشْرِفَ عَلَى قَبْرِ النَّبِيِّ ( صلى الله عليه وآله ) ",
          "فَلَمَّا كَانَ مِنَ الْغَدِ لَقِينَاهُمَا فَاجْتَمَعْنَا جَمِيعاً فَقَالَ إِسْمَاعِيلُ قَدْ سَأَلْنَاهُ لَكُمْ عَمَّا ذَكَرْتُمْ فَقَالَ مَا أُحِبُّ لِأَحَدٍ مِنْهُمْ أَنْ يَعْلُوَ فَوْقَهُ وَ لَا آمَنُهُ أَنْ يَرَى شَيْئاً يَذْهَبُ مِنْهُ بَصَرُهُ أَوْ يَرَاهُ قَائِماً يُصَلِّي أَوْ يَرَاهُ مَعَ بَعْضِ أَزْوَاجِهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from Ja’far Bin Al Musna Al Khateeb who said, ",
            "‘I was in Al-Medina and the ceiling of the Masjid which was upon the grave had fallen, and the workers were ascending and descending, and we were a group. So I said to our companions, ‘Whom from you all to seek an appointment for him to see Abu Abdullah<sup>asws</sup> tonight?’ So Mihran Bin Abu Nasr said, ‘I do’. And Ismail Bin Ammar Al-Sayrafi said, ‘I do’. So we said to them both, ‘You both ask him<sup>asws</sup> for us about the ascending to see above the grave of the Prophet<sup>saww</sup>’. ",
            "So when it was the morning, we met up with them both, and all of us had gathered. So Ismail said, ‘We had asked him<sup>asws</sup> for you all about what you had mentioned, so he<sup>asws</sup> said: ‘I<sup>asws</sup> do not like it for anyone from you that he should be higher above him<sup>saww</sup>, and there is no safety for him that he should see something due to which his eyesight would go away, or he may see him<sup>saww</sup> standing praying <span class=\"iTxt\">Salat</span>, or he might see him<sup>saww</sup> along with one of his<sup>saww</sup> wives’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad al-Barqi from Ja‘far ibn al-Muthanna al-Khatib who has said the following. “I was in Madina when the roof over the grave of the Holy Prophet (s.a) had crumbled down and the workers were climbing up and down (for repairs). We were a group and said to our people, “Who has an appointment with abu ‘Abdallah (a.s.)?” Mihran ibn abu Nasr said, “I have an appointment with the Imam (a.s.).” ’Isma‘il ibn ‘Ammar al-Sayrafi said, “I have an appointment with the Imam (a.s.).” I said to them, “Ask the Imam (a.s.) if it is permissible to climb up and look on to the grave of the Holy Prophet (s.a).” Next day we met them and we all came together. ’Isma‘il said, “We asked your question and he said this. “I do not like anyone to climb over him and I do not feel safe for anyone whose eye sight may go away because of catching sight of something that cause him such loss or see him standing in prayer or see him with anyone of his wives.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:112",
  "kind": "verse_list"
}