{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 113"
        },
        "path": "/books/al-kafi:1:4:113",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَوْلِدِ أَمِيرِ</span> الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ",
          "en": "Chapter 113 – Nazool (Arrival) of Amir Al-Momineen<sup>asws</sup>"
        }
      }
    ],
    "index": 171,
    "local_index": 113,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 114"
        },
        "path": "/books/al-kafi:1:4:114",
        "titles": {
          "ar": "باب مَوْلِدِ الزَّهْرَاءِ فَاطِمَةَ ( عليها السلام )",
          "en": "Chapter 114 – The Nazool (Arrival) of Al-Zahra Fatima<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 112"
        },
        "path": "/books/al-kafi:1:4:112",
        "titles": {
          "ar": "باب النَّهْيِ عَنِ الْإِشْرَافِ عَلَى قَبْرِ النَّبِيِّ ( صلى الله عليه وآله )",
          "en": "Chapter 112 – The Forbiddance from climbing upon the grave of the Prophet<sup>saww</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:113",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَوْلِدِ أَمِيرِ</span> الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ",
      "en": "Chapter 113 – Nazool (Arrival) of Amir Al-Momineen<sup>asws</sup>"
    },
    "verse_count": 11,
    "verse_start_index": 1226,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1227,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1207",
              "text": "مُحَمَّدِ بْنِ يَحْيَى الْفَارِسِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1208",
              "text": "أَبِي حَنِيفَةَ مُحَمَّدِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1209",
              "text": "الْوَلِيدِ بْنِ أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1210",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْفَارِسِيِّ عَنْ أَبِي حَنِيفَةَ مُحَمَّدِ بْنِ يَحْيَى عَنِ الْوَلِيدِ بْنِ أَبَانٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِيهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:1",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ فَاطِمَةَ بِنْتَ أَسَدٍ جَاءَتْ إِلَى أَبِي طَالِبٍ لِتُبَشِّرَهُ بِمَوْلِدِ النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ أَبُو طَالِبٍ اصْبِرِي سَبْتاً أُبَشِّرْكِ بِمِثْلِهِ إِلَّا النُّبُوَّةَ ",
          "وَ قَالَ السَّبْتُ ثَلَاثُونَ سَنَةً وَ كَانَ بَيْنَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ثَلَاثُونَ سَنَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Muhammad Bin yahya Al Farsy, from Abu Haneefa Muhammad Bin Yahya, from Al Waleed Bin Aban, from Muhammad Bin Abdullah Bin Muskan, from his father who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Fatima<sup>asws</sup> Bint Asad<sup>as</sup> came over to Abu Talib<sup>as</sup><sup>ws</sup> in order to give him<sup>as</sup><sup>ws</sup> the glad tidings of the Nazool (Coming) of the Prophet<sup>saww</sup>. So Abu Talib<sup>as</sup><sup>ws</sup> said: ‘Be patient for a ‘Sabta’, I<sup>as</sup> shall give you<sup>as</sup> glad tidings similar to it, except for the Prophet-hood’. ",
            "And he<sup>asws</sup> said: ‘The ‘Sabt’ is of thirty years, and between Rasool-Allah<sup>saww</sup> and Amir Al-Momineen<sup>asws</sup> was (a span of) thirty years’."
          ],
          "en.sarwar": [
            " Amir al-Mu’minin Ali (a.s.) was born thirty years after the year of elephant. He was martyred in month of Ramadan twenty first Sunday night in the year fortieth after Hijra (migration). He was sixty three years at that time. He lived for thirty years after the death of the Holy Prophet (s.a). His mother was Fatima daughter of Asad Ibrahimn Hashim ibn ‘Abd Manaf. He was the first person whose both parents belonged to Hashim."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/277)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1228,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/33",
              "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1014",
              "text": "السَّيَّارِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/242",
              "text": "مُحَمَّدِ بْنِ جُمْهُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنِ السَّيَّارِيِّ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:2",
        "text": [
          " إِنَّ فَاطِمَةَ بِنْتَ أَسَدٍ أُمَّ أَمِيرِ الْمُؤْمِنِينَ كَانَتْ أَوَّلَ امْرَأَةٍ هَاجَرَتْ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنْ مَكَّةَ إِلَى الْمَدِينَةِ عَلَى قَدَمَيْهَا وَ كَانَتْ مِنْ أَبَرِّ النَّاسِ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله )",
          "فَسَمِعَتْ رَسُولَ اللَّهِ وَ هُوَ يَقُولُ إِنَّ النَّاسَ يُحْشَرُونَ يَوْمَ الْقِيَامَةِ عُرَاةً كَمَا وُلِدُوا فَقَالَتْ وَا سَوْأَتَاهْ فَقَالَ لَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَإِنِّي أَسْأَلُ اللَّهَ أَنْ يَبْعَثَكِ كَاسِيَةً",
          "وَ سَمِعَتْهُ يَذْكُرُ ضَغْطَةَ الْقَبْرِ فَقَالَتْ وَا ضَعْفَاهْ فَقَالَ لَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَإِنِّي أَسْأَلُ اللَّهَ أَنْ يَكْفِيَكِ ذَلِكِ وَ قَالَتْ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) يَوْماً إِنِّي أُرِيدُ أَنْ أُعْتِقَ جَارِيَتِي هَذِهِ فَقَالَ لَهَا إِنْ فَعَلْتِ أَعْتَقَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهَا عُضْواً مِنْكِ مِنَ النَّارِ",
          "فَلَمَّا مَرِضَتْ أَوْصَتْ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَمَرَتْ أَنْ يُعْتِقَ خَادِمَهَا وَ اعْتُقِلَ لِسَانُهَا فَجَعَلَتْ تُومِي إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِيمَاءً فَقَبِلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَصِيَّتَهَا فَبَيْنَمَا هُوَ ذَاتَ يَوْمٍ قَاعِدٌ إِذْ أَتَاهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ هُوَ يَبْكِي فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا يُبْكِيكَ فَقَالَ مَاتَتْ أُمِّي فَاطِمَةُ فَقَالَ رَسُولُ اللَّهِ وَ أُمِّي وَ اللَّهِ وَ قَامَ مُسْرِعاً حَتَّى دَخَلَ",
          "فَنَظَرَ إِلَيْهَا وَ بَكَى ثُمَّ أَمَرَ النِّسَاءَ أَنْ يَغْسِلْنَهَا وَ قَالَ ( صلى الله عليه وآله ) إِذَا فَرَغْتُنَّ فَلَا تُحْدِثْنَ شَيْئاً حَتَّى تُعْلِمْنَنِي فَلَمَّا فَرَغْنَ أَعْلَمْنَهُ بِذَلِكَ فَأَعْطَاهُنَّ أَحَدَ قَمِيصَيْهِ الَّذِي يَلِي جَسَدَهُ وَ أَمَرَهُنَّ أَنْ يُكَفِّنَّهَا فِيهِ وَ قَالَ لِلْمُسْلِمِينَ إِذَا رَأَيْتُمُونِي قَدْ فَعَلْتُ شَيْئاً لَمْ أَفْعَلْهُ قَبْلَ ذَلِكَ فَسَلُونِي لِمَ فَعَلْتُهُ",
          "فَلَمَّا فَرَغْنَ مِنْ غُسْلِهَا وَ كَفْنِهَا دَخَلَ ( صلى الله عليه وآله ) فَحَمَلَ جَنَازَتَهَا عَلَى عَاتِقِهِ فَلَمْ يَزَلْ تَحْتَ جَنَازَتِهَا حَتَّى أَوْرَدَهَا قَبْرَهَا ثُمَّ وَضَعَهَا وَ دَخَلَ الْقَبْرَ فَاضْطَجَعَ فِيهِ ثُمَّ قَالَ فَأَخَذَهَا عَلَى يَدَيْهِ حَتَّى وَضَعَهَا فِي الْقَبْرِ ثُمَّ انْكَبَّ عَلَيْهَا طَوِيلًا يُنَاجِيهَا وَ يَقُولُ لَهَا ابْنُكِ ابْنُكِ [ابْنُكِ]",
          "ثُمَّ خَرَجَ وَ سَوَّى عَلَيْهَا ثُمَّ انْكَبَّ عَلَى قَبْرِهَا فَسَمِعُوهُ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ اللَّهُمَّ إِنِّي أَسْتَوْدِعُهَا إِيَّاكَ ثُمَّ انْصَرَفَ فَقَالَ لَهُ الْمُسْلِمُونَ إِنَّا رَأَيْنَاكَ فَعَلْتَ أَشْيَاءَ لَمْ تَفْعَلْهَا قَبْلَ الْيَوْمِ فَقَالَ الْيَوْمَ فَقَدْتُ بِرَّ أَبِي طَالِبٍ إِنْ كَانَتْ لَيَكُونُ عِنْدَهَا الشَّيْ‏ءُ فَتُؤْثِرُنِي بِهِ عَلَى نَفْسِهَا وَ وَلَدِهَا",
          "وَ إِنِّي ذَكَرْتُ الْقِيَامَةَ وَ أَنَّ النَّاسَ يُحْشَرُونَ عُرَاةً فَقَالَتْ وَا سَوْأَتَاهْ فَضَمِنْتُ لَهَا أَنْ يَبْعَثَهَا اللَّهُ كَاسِيَةً وَ ذَكَرْتُ ضَغْطَةَ الْقَبْرِ فَقَالَتْ وَا ضَعْفَاهْ فَضَمِنْتُ لَهَا أَنْ يَكْفِيَهَا اللَّهُ ذَلِكَ فَكَفَّنْتُهَا بِقَمِيصِي وَ اضْطَجَعْتُ فِي قَبْرِهَا لِذَلِكَ وَ انْكَبَبْتُ عَلَيْهَا فَلَقَّنْتُهَا مَا تُسْأَلُ عَنْهُ فَإِنَّهَا سُئِلَتْ عَنْ رَبِّهَا فَقَالَتْ وَ سُئِلَتْ عَنْ رَسُولِهَا فَأَجَابَتْ وَ سُئِلَتْ عَنْ وَلِيِّهَا وَ إِمَامِهَا فَارْتَجَّ عَلَيْهَا فَقُلْتُ ابْنُكِ ابْنُكِ [ابْنُكِ] ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Abdullah, from Al Sayyari, from Muhammad Bin Jamhour, from some of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Fatima<sup>asws</sup> Bint Asad<sup>as</sup> is the mother of Amir Al-Momineen<sup>asws</sup>. She<sup>as</sup><sup>ws</sup> was the first woman to emigrate to Rasool-Allah<sup>saww</sup>, from Makkah to Al-Medina upon her<sup>as</sup><sup>ws</sup> feet, and she<sup>as</sup><sup>ws</sup> was the most righteous of the people with Rasool-Allah<sup>saww</sup>. ",
            "So she<sup>as</sup> heard Rasool-Allah<sup>saww</sup> and he<sup>saww</sup> was saying: ‘The people would be Resurrected on the Day of Judgment, naked just as they were born’. So she<sup>as</sup><sup>ws</sup> said: ‘Oh the evil of it!’ So Rasool-Allah<sup>saww</sup> said to her: ‘So I<sup>saww</sup> shall ask Allah<sup>azwj</sup> that He<sup>azwj</sup> should Resurrect you<sup>as</sup><sup>ws</sup> clothed’. ",
            "And she<sup>as</sup><sup>ws</sup> heard him<sup>saww</sup> mention the compression of the grave, so she<sup>as</sup><sup>ws</sup> said: ‘Oh the weakness from it!’ So Rasool-Allah<sup>saww</sup> said to her<sup>as</sup><sup>ws</sup>: ‘So I<sup>saww</sup> shall ask Allah<sup>azwj</sup> that He<sup>azwj</sup> Restrain that’. And she<sup>as</sup><sup>ws</sup> said to Rasool-Allah<sup>saww</sup> one day, ‘I<sup>as</sup><sup>ws</sup> intend to free this maid of mine’. So he<sup>saww</sup> said to her<sup>asws</sup>: ‘Allah<sup>azwj</sup> would Free, with every body part of hers, a body part of yours<sup>as</sup>, from the Fire’. ",
            "When she<sup>as</sup><sup>ws</sup> was ill, she<sup>as</sup><sup>ws</sup> bequeathed to Rasool-Allah<sup>saww</sup> and instructed that he<sup>saww</sup> should free her<sup>as</sup> servant, and her<sup>as</sup><sup>ws</sup> tongue seized up, so she<sup>as</sup><sup>ws</sup> went on gesturing to Rasool-Allah<sup>saww</sup> with gestures. So Rasool-Allah<sup>saww</sup> accepted her<sup>as</sup><sup>ws</sup> bequest. So while he<sup>saww</sup> was seated one day, when Amir Al-Momineen<sup>asws</sup> came over and he<sup>asws</sup> was weeping. So Rasool-Allah<sup>saww</sup> said to him<sup>asws</sup>: ‘What makes you<sup>asws</sup> weep?’ So he<sup>asws</sup> said: ‘My<sup>asws</sup> mother<sup>as</sup> Fatima<sup>asws</sup> passed away’. So Rasool-Allah<sup>saww</sup> said: ‘And (she<sup>as</sup> was) my<sup>saww</sup> mother (as well), by Allah<sup>azwj</sup>!’, and he<sup>saww</sup> stood up quickly until he<sup>saww</sup> went over.",
            "So he<sup>saww</sup> looked at her<sup>as</sup><sup>ws</sup> and wept. Then he<sup>saww</sup> instructed the women that they should wash her<sup>as</sup><sup>ws</sup> and said: ‘When you are free, so do not do anything new until you let me<sup>saww</sup> know’. So when they were free, they let him<sup>saww</sup> know of that, so He<sup>saww</sup> gave them one of his<sup>saww</sup> shirts which was beneath his<sup>saww</sup> body, and instructed them that they should enshroud her<sup>as</sup><sup>ws</sup> in it, and said to the Muslims: ‘When you see me<sup>saww</sup> to have done something I<sup>saww</sup> have not done before that, so ask me<sup>as</sup> why I<sup>saww</sup> have done it’. ",
            "So when they were free from washing her<sup>as</sup> and enshrouding her<sup>as</sup>, he<sup>saww</sup> came over and carried her<sup>as</sup><sup>ws</sup> coffin upon his<sup>saww</sup> shoulder. So he<sup>saww</sup> did not cease to be beneath her<sup>as</sup><sup>ws</sup> coffin until he<sup>saww</sup> came near her<sup>as</sup><sup>ws</sup> grave, and placed it and entered her<sup>as</sup><sup>ws</sup> grave. So he<sup>saww</sup> laid down in it’. Then he<sup>asws</sup> said: ‘So he<sup>saww</sup> took her<sup>as</sup><sup>ws</sup> upon his<sup>saww</sup> hands until he<sup>saww</sup> placed her<sup>as</sup><sup>ws</sup> in the grave. Then he<sup>saww</sup> devoted upon her<sup>as</sup><sup>ws</sup> for a long time, whispering to her<sup>as</sup><sup>ws</sup>, and he<sup>saww</sup> was saying to her: ‘Your<sup>as</sup><sup>ws</sup> son<sup>asws</sup>! Your<sup>as</sup><sup>ws</sup> son<sup>asws</sup>! Your<sup>as</sup><sup>ws</sup> son<sup>asws</sup>!’. ",
            "Then he<sup>saww</sup> came out and evened (the soil) upon her<sup>as</sup><sup>ws</sup>. Then he<sup>saww</sup> devoted upon her<sup>as</sup><sup>ws</sup> grave and he<sup>saww</sup> was heard saying: ‘There is no god Except Allah<sup>azwj</sup>! O Allah<sup>azwj</sup>! I<sup>saww</sup> hereby entrust her<sup>as</sup><sup>ws</sup> to You<sup>azwj</sup>’. Then he<sup>saww</sup> left. So the Muslims said, ‘We saw you<sup>saww</sup> doing things which you<sup>saww</sup> did not do those before today’. So he<sup>saww</sup> said: ‘Today I<sup>saww</sup> lost the righteousness of Abu Talib<sup>as</sup><sup>ws</sup>. If she<sup>as</sup><sup>ws</sup> ever happened to have anything with her<sup>as</sup><sup>ws</sup>, so she<sup>as</sup><sup>ws</sup> would prefer me<sup>saww</sup> with it upon her<sup>as</sup><sup>ws</sup> own self, and her<sup>as</sup><sup>ws</sup> sons<sup>as</sup>. ",
            "And I<sup>saww</sup> mentined the Day of Judgment that the people would be Resurrected naked, so she<sup>as</sup><sup>ws</sup> said: ‘O the evil of it!’. So I<sup>saww</sup> guaranteed to her<sup>as</sup><sup>ws</sup> that Allah<sup>azwj</sup> would Resurrect her<sup>as</sup><sup>ws</sup> clothed. And I<sup>saww</sup> mentioned the compression of the grave, so she<sup>as</sup><sup>ws</sup> said: ‘O the weakness from it!’ So I<sup>saww</sup> guaranteed to her<sup>asws</sup> that Allah<sup>azwj</sup> would Restrain that. So I<sup>saww</sup> enshrouded her<sup>asws</sup> with my<sup>saww</sup> shirt, and I<sup>saww</sup> laid down in her<sup>asws</sup> grave for that and devoted upon her<sup>as</sup>, so I<sup>saww</sup> indoctrinated her<sup>as</sup> (Talqeen) what she<sup>saww</sup> would be question about. So she<sup>saww</sup> was questioned about her<sup>asws</sup> Lord<sup>azwj</sup>, so she<sup>asws</sup> said it, and she<sup>asws</sup> was asked about her<sup>asws</sup> Rasool<sup>saww</sup>, so she<sup>asws</sup> answered, and she<sup>asws</sup> was asked about her<sup>asws</sup> Gardian<sup>asws</sup> and her<sup>asws</sup> Imam<sup>asws</sup>. So she<sup>asws</sup> was shaken over it, so I<sup>saww</sup> said: ‘Your<sup>as</sup><sup>ws</sup> son<sup>asws</sup>! Your<sup>as</sup><sup>ws</sup> son<sup>asws</sup>! Your<sup>as</sup><sup>ws</sup> son<sup>asws</sup>!’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad has narrated from Muhammad ibn Yahya al-Farisiy from abu Hanifa Muhammad ibn Yahya from al-Walid ibn Aban from Muhammad ibn ‘Abdallah ibn Muskan from who has said the following. “Abu ‘Abdallah (a.s.) has said, ‘Once Fatima, daughter of Asad came to abu Talib with the glad news of the birth of the Holy Prophet (s.a). Abu Talib said, “Wait for a sabt then I will give a similar glad news except prophet-hood.” The Imam (a.s.) said, “A sabt is thirty years. Amir al-Mu’minin Ali (a.s.) was born thirty years after the birth of the Holy Prophet (s.a).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/278)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1229,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/80",
              "text": "بَعْضُ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/285",
              "text": "عُمَرَ بْنِ أَبَانٍ الْكَلْبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "الْمُفَضَّلِ بْنِ عُمَرَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "بَعْضُ أَصْحَابِنَا عَمَّنْ ذَكَرَهُ عَنِ ابْنِ مَحْبُوبٍ عَنْ عُمَرَ بْنِ أَبَانٍ الْكَلْبِيِّ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:3",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَمَّا وُلِدَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فُتِحَ لآِمِنَةَ بَيَاضُ فَارِسَ وَ قُصُورُ الشَّامِ فَجَاءَتْ فَاطِمَةُ بِنْتُ أَسَدٍ أُمُّ أَمِيرِ الْمُؤْمِنِينَ إِلَى أَبِي طَالِبٍ ضَاحِكَةً مُسْتَبْشِرَةً فَأَعْلَمَتْهُ مَا قَالَتْ آمِنَةُ فَقَالَ لَهَا أَبُو طَالِبٍ وَ تَتَعَجَّبِينَ مِنْ هَذَا إِنَّكِ تَحْبَلِينَ وَ تَلِدِينَ بِوَصِيِّهِ وَ وَزِيرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Some of our companions, from the one who mentioned it, from Ibn Mahboub, from Umar Bin Aban Al Kalby, from Al Mufazzal Bin Umar who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When (Syeda) Aamina<sup>as</sup> was blessed with Rasool-Allah<sup>saww</sup>, there were opened up (displayed) for, the white (houses) of Persian, and palaces of Syria (as having been conquered). So (Syeda) Fatima<sup>asws</sup> Bint Asad<sup>as</sup>, mother<sup>asws</sup> of Amir Al-Momineen<sup>asws</sup> came over to Abu Talib<sup>asws</sup>, smiling, giving glad tidings, and let him<sup>asws</sup> know what Aamina<sup>asws</sup> had said. So Abu Talib<sup>asws</sup> said to her<sup>asws</sup>: ‘You<sup>asws</sup> are being astounded from this? You<sup>asws</sup> would be blessed with and bring up his<sup>saww</sup> successor<sup>asws</sup> and his<sup>saww</sup> Vizier’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Muhammad ibn ‘Abdallah has narrated from al-Sayyariy from Muhammad ibn Jumhur from certain persons of our people from abu ‘Abdallah (a.s.) who has said the following. “Fatima, mother of Amir al-Mu’minin Ali (a.s.) was the first woman who has said the following. migrated to the Messenger of Allah from Makka to Madina on foot. She was the most kind person to the Messenger of Allah She heard the Messenger of Allah say, “On the Day of Judgment people will be raised naked as they were born.” She said, “My goodness, what a shame!” The Messenger of Allah then said, “I will pray to Allah to resurrect you all dressed up.” She heard him speak of the constraint in the grave.” She then said, “ Alas! How pitiful is my weakness!” the Messenger of Allah said, “I will pray to Allah to make it easy for you.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه للمفضل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/282)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1230,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/566",
              "text": "الْبَرْقِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1211",
              "text": "أَحْمَدَ بْنِ زَيْدٍ النَّيْسَابُورِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1212",
              "text": "عُمَرُ بْنُ إِبْرَاهِيمَ الْهَاشِمِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1213",
              "text": "عَبْدِ الْمَلِكِ بْنِ عُمَرَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1214",
              "text": "أَسِيدِ بْنِ صَفْوَانَ صَاحِبِ رَسُولِ اللَّهِ ( صلى الله عليه وآله )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْبَرْقِيِّ عَنْ أَحْمَدَ بْنِ زَيْدٍ النَّيْسَابُورِيِّ قَالَ حَدَّثَنِي عُمَرُ بْنُ إِبْرَاهِيمَ الْهَاشِمِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَرَ عَنْ أَسِيدِ بْنِ صَفْوَانَ صَاحِبِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:4",
        "relations": {
          "Mentions": [
            "/books/quran:2:156"
          ]
        },
        "text": [
          " لَمَّا كَانَ الْيَوْمُ الَّذِي قُبِضَ فِيهِ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) ارْتَجَّ الْمَوْضِعُ بِالْبُكَاءِ وَ دَهِشَ النَّاسُ كَيَوْمَ قُبِضَ النَّبِيُّ ( صلى الله عليه وآله ) وَ جَاءَ رَجُلٌ بَاكِياً وَ هُوَ مُسْرِعٌ مُسْتَرْجِعٌ وَ هُوَ يَقُولُ الْيَوْمَ انْقَطَعَتْ خِلَافَةُ النُّبُوَّةِ حَتَّى وَقَفَ عَلَى بَابِ الْبَيْتِ الَّذِي فِيهِ أَمِيرُ الْمُؤْمِنِينَ( عليه السلام )",
          "فَقَالَ رَحِمَكَ اللَّهُ يَا أَبَا الْحَسَنِ كُنْتَ أَوَّلَ الْقَوْمِ إِسْلَاماً وَ أَخْلَصَهُمْ إِيمَاناً وَ أَشَدَّهُمْ يَقِيناً وَ أَخْوَفَهُمْ لِلَّهِ وَ أَعْظَمَهُمْ عَنَاءً وَ أَحْوَطَهُمْ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ آمَنَهُمْ عَلَى أَصْحَابِهِ وَ أَفْضَلَهُمْ مَنَاقِبَ وَ أَكْرَمَهُمْ سَوَابِقَ وَ أَرْفَعَهُمْ دَرَجَةً وَ أَقْرَبَهُمْ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَشْبَهَهُمْ بِهِ هَدْياً وَ خَلْقاً وَ سَمْتاً وَ فِعْلًا وَ أَشْرَفَهُمْ مَنْزِلَةً وَ أَكْرَمَهُمْ عَلَيْهِ ",
          "فَجَزَاكَ اللَّهُ عَنِ الْإِسْلَامِ وَ عَنْ رَسُولِهِ وَ عَنِ الْمُسْلِمِينَ خَيْراً قَوِيتَ حِينَ ضَعُفَ أَصْحَابُهُ وَ بَرَزْتَ حِينَ اسْتَكَانُوا وَ نَهَضْتَ حِينَ وَهَنُوا وَ لَزِمْتَ مِنْهَاجَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِذْ هَمَّ أَصْحَابُهُ وَ كُنْتَ خَلِيفَتَهُ حَقّاً لَمْ تُنَازَعْ وَ لَمْ تَضْرَعْ بِرَغْمِ الْمُنَافِقِينَ وَ غَيْظِ الْكَافِرِينَ وَ كُرْهِ الْحَاسِدِينَ وَ صِغَرِ الْفَاسِقِينَ ",
          "فَقُمْتَ بِالْأَمْرِ حِينَ فَشِلُوا وَ نَطَقْتَ حِينَ تَتَعْتَعُوا وَ مَضَيْتَ بِنُورِ اللَّهِ إِذْ وَقَفُوا فَاتَّبَعُوكَ فَهُدُوا وَ كُنْتَ أَخْفَضَهُمْ صَوْتاً وَ أَعْلَاهُمْ قُنُوتاً وَ أَقَلَّهُمْ كَلَاماً وَ أَصْوَبَهُمْ نُطْقاً وَ أَكْبَرَهُمْ رَأْياً وَ أَشْجَعَهُمْ قَلْباً وَ أَشَدَّهُمْ يَقِيناً وَ أَحْسَنَهُمْ عَمَلًا وَ أَعْرَفَهُمْ بِالْأُمُورِ",
          "كُنْتَ وَ اللَّهِ يَعْسُوباً لِلدِّينِ أَوَّلًا وَ آخِراً الْأَوَّلَ حِينَ تَفَرَّقَ النَّاسُ وَ الْآخِرَ حِينَ فَشِلُوا كُنْتَ لِلْمُؤْمِنِينَ أَباً رَحِيماً إِذْ صَارُوا عَلَيْكَ عِيَالًا فَحَمَلْتَ أَثْقَالَ مَا عَنْهُ ضَعُفُوا وَ حَفِظْتَ مَا أَضَاعُوا وَ رَعَيْتَ مَا أَهْمَلُوا وَ شَمَّرْتَ إِذَا اجْتَمَعُوا وَ عَلَوْتَ إِذْ هَلِعُوا وَ صَبَرْتَ إِذْ أَسْرَعُوا وَ أَدْرَكْتَ أَوْتَارَ مَا طَلَبُوا وَ نَالُوا بِكَ مَا لَمْ يَحْتَسِبُوا",
          "كُنْتَ عَلَى الْكَافِرِينَ عَذَاباً صَبّاً وَ نَهْباً وَ لِلْمُؤْمِنِينَ عَمَداً وَ حِصْناً فَطِرْتَ وَ اللَّهِ بِنَعْمَائِهَا وَ فُزْتَ بِحِبَائِهَا وَ أَحْرَزْتَ سَوَابِغَهَا وَ ذَهَبْتَ بِفَضَائِلِهَا لَمْ تُفْلَلْ حُجَّتُكَ وَ لَمْ يَزِغْ قَلْبُكَ وَ لَمْ تَضْعُفْ بَصِيرَتُكَ وَ لَمْ تَجْبُنْ نَفْسُكَ وَ لَمْ تَخِرَّ كُنْتَ كَالْجَبَلِ لَا تُحَرِّكُهُ الْعَوَاصِفُ",
          "وَ كُنْتَ كَمَا قَالَ ( عليه السلام ) آمَنَ النَّاسِ فِي صُحْبَتِكَ وَ ذَاتِ يَدِكَ وَ كُنْتَ كَمَا قَالَ ( عليه السلام ) ضَعِيفاً فِي بَدَنِكَ قَوِيّاً فِي أَمْرِ اللَّهِ مُتَوَاضِعاً فِي نَفْسِكَ عَظِيماً عِنْدَ اللَّهِ كَبِيراً فِي الْأَرْضِ جَلِيلًا عِنْدَ الْمُؤْمِنِينَ لَمْ يَكُنْ لِأَحَدٍ فِيكَ مَهْمَزٌ وَ لَا لِقَائِلٍ فِيكَ مَغْمَزٌ [وَ لَا لِأَحَدٍ فِيكَ مَطْمَعٌ] وَ لَا لِأَحَدٍ عِنْدَكَ هَوَادَةٌ",
          "الضَّعِيفُ الذَّلِيلُ عِنْدَكَ قَوِيٌّ عَزِيزٌ حَتَّى تَأْخُذَ لَهُ بِحَقِّهِ وَ الْقَوِيُّ الْعَزِيزُ عِنْدَكَ ضَعِيفٌ ذَلِيلٌ حَتَّى تَأْخُذَ مِنْهُ الْحَقَّ وَ الْقَرِيبُ وَ الْبَعِيدُ عِنْدَكَ فِي ذَلِكَ سَوَاءٌ شَأْنُكَ الْحَقُّ وَ الصِّدْقُ وَ الرِّفْقُ وَ قَوْلُكَ حُكْمٌ وَ حَتْمٌ وَ أَمْرُكَ حِلْمٌ وَ حَزْمٌ وَ رَأْيُكَ عِلْمٌ وَ عَزْمٌ فِيمَا فَعَلْتَ",
          "وَ قَدْ نَهَجَ السَّبِيلُ وَ سَهُلَ الْعَسِيرُ وَ أُطْفِئَتِ النِّيرَانُ وَ اعْتَدَلَ بِكَ الدِّينُ وَ قَوِيَ بِكَ الْإِسْلَامُ فَظَهَرَ أَمْرُ اللَّهِ وَ لَوْ كَرِهَ الْكَافِرُونَ وَ ثَبَتَ بِكَ الْإِسْلَامُ وَ الْمُؤْمِنُونَ وَ سَبَقْتَ سَبْقاً بَعِيداً وَ أَتْعَبْتَ مَنْ بَعْدَكَ تَعَباً شَدِيداً",
          "فَجَلَلْتَ عَنِ الْبُكَاءِ وَ عَظُمَتْ رَزِيَّتُكَ فِي السَّمَاءِ وَ هَدَّتْ مُصِيبَتُكَ الْأَنَامَ فَإِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ رَضِينَا عَنِ اللَّهِ قَضَاهُ وَ سَلَّمْنَا لِلَّهِ أَمْرَهُ فَوَ اللَّهِ لَنْ يُصَابَ الْمُسْلِمُونَ بِمِثْلِكَ أَبَداً كُنْتَ لِلْمُؤْمِنِينَ كَهْفاً وَ حِصْناً وَ قُنَّةً رَاسِياً وَ عَلَى الْكَافِرِينَ غِلْظَةً وَ غَيْظاً فَأَلْحَقَكَ اللَّهُ بِنَبِيِّهِ وَ لَا أَحْرَمَنَا أَجْرَكَ وَ لَا أَضَلَّنَا بَعْدَكَ",
          "وَ سَكَتَ الْقَوْمُ حَتَّى انْقَضَى كَلَامُهُ وَ بَكَى وَ بَكَى أَصْحَابُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ طَلَبُوهُ فَلَمْ يُصَادِفُوهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Al Barqy, from Ahmad Bin Zayd Al Neyshapouri who said, ‘Umar Bin Ibrahim Al Hashimy narrated to me, from Abdul Malik Bin Umar, ",
            "(It has been narrated) from Aseyd Bin Safwan, a companion of Rasool-Allah<sup>saww</sup> who said, ‘When it was the day in which Amir Al-Momineen<sup>asws</sup> passed away, the place/world/earth vibrated with the crying and the people were staggered like on the day the Prophet<sup>saww</sup> passed away; and a man came over crying, returning quickly, and he was saying, ‘Today the Caliphate of the Prophet-hood has been cut off’, until he paused at the door of the house in which was Amir Al-Momineen<sup>asws</sup>. ",
            "So he said, ‘May Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>, O Amir Al-Momineen<sup>asws</sup>! You<sup>asws</sup> were the first of the people of Al-Islam and the most sincere of them in Eman, and the most intense of them in conviction, and the most fearful of them of Allah<sup>azwj</sup>, and of the greatest hardship of them, and the most protective of them upon Rasool-Allah<sup>saww</sup>, and the most trustworthy of them upon his<sup>saww</sup> companions, and the most superior of them in virtues, and the most prestigious of them in precedence, and the loftiest of them in levels, and the closest of them from Rasool-Allah<sup>saww</sup>, and the most resembling of them with him<sup>as</sup> in (providing) Guidance, and morals, and attributes, and deeds, and the noblest of them in status, and the most prestigious to him<sup>saww</sup>.",
            "So may Allah<sup>azwj</sup> Recompense you<sup>asws</sup> good on behalf of Al-Islam, and on behalf of His<sup>azwj</sup> Rasool<sup>saww</sup>, and on behalf of the Muslims. You<sup>asws</sup> strengthened them when his<sup>saww</sup> companions were weak, and you<sup>asws</sup> went for duels when they were humbled, and you<sup>asws</sup> rose up when they were languishing, and you<sup>asws</sup> necessitated the manifesto of Rasool-Allah<sup>saww</sup> when his<sup>saww</sup> companions were distressed, and you<sup>asws</sup> were his<sup>saww</sup> true Caliph. You<sup>asws</sup> did not dispute and were not humbled by the opposition of the hypocrites, and the anger of the Infidels, and the abhorrence of the envying ones, and the lowliness of the transgressors. ",
            "So you<sup>asws</sup> stood with the matter where they failed, and you<sup>asws</sup> spoke where they were dumbfounded, and you<sup>asws</sup> went (ahead) with the Light of Allah<sup>azwj</sup> where they paused. So had they followed you, they would have been Guided. And you<sup>asws</sup> were the lowest of them in voices, and the highest of them in devoutness, and the least of them in speeches, and the most correct of them in speaking, and the greatest of them in ideas, and the bravest of them of heart, and the most intense of them in conviction, and the most excellent of them in deeds, and the most understanding of them with the affairs. ",
            "By Allah<sup>azwj</sup>! You<sup>asws</sup> were the Leading figure (Yasoob) of the Religion, being the first and the last. The first, where the people scattered, and the last where they failed. For the Momineen you<sup>asws</sup> were a merciful father where they came to be dependent upon you<sup>asws</sup>. So you<sup>asws</sup> carried what they were weak from, and you<sup>asws</sup> preserved what they wasted, and you were a shepherd upon what they ignored, and you<sup>asws</sup> tightened (economized) when they amassed, and you<sup>asws</sup> rose high when they got lower, and you<sup>asws</sup> were patient when they were hasty, and you<sup>asws</sup> achieved the cords of what they were (still) seeking, and they attained with you<sup>asws</sup> what they were not even reckoning. ",
            "You<sup>asws</sup> were a Punishment, a calamity and a disaster upon the disbelievers; and for the Momineen a pillar and a fortress. So, by Allah<sup>azwj</sup>, you<sup>asws</sup> flew by its Bounties and succeeded with its awards, and you<sup>asws</sup> attained its accomplishments, and you<sup>asws</sup> went with its merits. Your<sup>asws</sup> argument was not blunted and your<sup>asws</sup> heart did not waver, and your<sup>asws</sup> insight did not weaken, and your<sup>asws</sup> self did not fear, and you<sup>asws</sup> did not fall. You<sup>asws</sup> were like a mountain which the storms could not move. ",
            "And you<sup>asws</sup> were just as he<sup>saww</sup> (Rasool-Allah<sup>saww</sup>) said: ‘The people are safe in your<sup>asws</sup> company and that which is in your<sup>asws</sup> hands’. And you<sup>asws</sup> were just as he<sup>saww</sup> said: ‘Weak in your<sup>asws</sup> body, strong in the Command of Allah<sup>azwj</sup>, modest within yourself<sup>asws</sup>, magnificent in the Presence of Allah<sup>azwj</sup>, great in the earth, majestic in the presence of the Momineen. There did not happen to be any faulting for anyone regarding you, nor any criticism for a speaker regarding you<sup>asws</sup>, nor any corruption for anyone regarding you<sup>asws</sup>, nor was there a leniency for anyone with you<sup>asws</sup>. ",
            "The weak and the humiliated was strong and honourable in your<sup>asws</sup> presence until you<sup>asws</sup> seized for him his right; and the strong (and) the honourable was weak and humiliated in your<sup>asws</sup> presence until you<sup>asws</sup> seized the right from him, and the near ones and the distant ones were equal in your<sup>asws</sup> presence with regards to that. Your<sup>asws</sup> dealings were the right, and (based on) the truthfulness, and the kindness, and your<sup>asws</sup> words were decisive judgments, and your<sup>asws</sup> orders were forbearing and determined, and your<sup>asws</sup> view were knowledgeable and resolute in whatever you<sup>asws</sup> did.",
            "And the Way has been programmed, and the difficulties have been eased, and the two fires have been extinguished, and the Religion has been straightened by you<sup>asws</sup>, and Al-Islam has been strengthened by you<sup>asws</sup>. So the Command of Allah<sup>azwj</sup> appeared even though the disbelievers disliked it, and Al-Islam was affirmed by you<sup>asws</sup> and (so were) the Momineen, and you<sup>asws</sup> preceded with a far precedence, and exhausted the ones after you<sup>asws</sup> with an intense exhaustion.",
            "You<sup>asws</sup> are gravely missed by the weeping, and how great is your<sup>asws</sup> issue in the skies, and your<sup>asws</sup> calamity has threatened the people (with chaos), <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h156\">[2:156]</a> Surely we are for Allah and to Him we are returning</span>. We are pleased from Allah<sup>azwj</sup> of His<sup>azwj</sup> Ordainment, and we submit to Allah<sup>azwj</sup> to His<sup>azwj</sup> Command, for the Muslims will never come across the like of you<sup>asws</sup>, ever! You<sup>asws</sup> were a cave for the Momineen and a fortress, and a mountain top, and upon the disbelievers a ruggedness and a fury. So, may Allah<sup>azwj</sup> Join you<sup>asws</sup> with His<sup>azwj</sup> Prophet<sup>saww</sup> and not Deprive us from your<sup>asws</sup> Recompense, nor let us to stray after you<sup>asws</sup>’. ",
            "And the people were silent until his speech terminated, and he wept, and the companions of Rasool-Allah<sup>saww</sup> wept. Then they sought him, but they could not come across him’."
          ],
          "en.sarwar": [
            " 3. Certain persons of our people have narrated from those he mentioned from ibn Mahbub from ‘Umar ibn Aban al-Kalbi from al-Mufaddal ibn ‘Umar who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘When the Messenger of Allah was born the whiteness (houses) of the Persian kingdom and the palaces of Sham (Syria) was shown to Amina, his mother, openly (conquered). Fatima daughter of Asad, mother of Amir al-Mu’minin Ali (a.s.) came to abu Talib laughing with glad news and explained to him what Amina had said. Abu Talib said to her, “Has it surprised you so much? You will conceive a child who will be the executor of the will and the vizier of this new born.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (283/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1231,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/479",
              "text": "صَفْوَانَ الْجَمَّالِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ صَفْوَانَ الْجَمَّالِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:5",
        "relations": {
          "Mentions": [
            "/books/quran:2:156"
          ]
        },
        "text": [
          " كُنْتُ أَنَا وَ عَامِرٌ وَ عَبْدُ اللَّهِ بْنُ جُذَاعَةَ الْأَزْدِيُّ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فَقَالَ لَهُ عَامِرٌ جُعِلْتُ فِدَاكَ إِنَّ النَّاسَ يَزْعُمُونَ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) دُفِنَ بِالرَّحْبَةِ قَالَ لَا قَالَ فَأَيْنَ دُفِنَ قَالَ إِنَّهُ لَمَّا مَاتَ احْتَمَلَهُ الْحَسَنُ ( عليه السلام ) فَأَتَى بِهِ ظَهْرَ الْكُوفَةِ قَرِيباً مِنَ النَّجَفِ يَسْرَةً عَنِ الْغَرِيِّ يَمْنَةً عَنِ الْحِيرَةِ فَدَفَنَهُ بَيْنَ رَكَوَاتٍ بِيضٍ ",
          "قَالَ فَلَمَّا كَانَ بَعْدُ ذَهَبْتُ إِلَى الْمَوْضِعِ فَتَوَهَّمْتُ مَوْضِعاً مِنْهُ ثُمَّ أَتَيْتُهُ فَأَخْبَرْتُهُ فَقَالَ لِي أَصَبْتَ رَحِمَكَ اللَّهُ ثَلَاثَ مَرَّاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Safwan Al Jammal who said, ",
            "‘I, and Aamir, and Abdullah Bin Juza’at Al-Azdy were in the presence of Abu Abdullah<sup>asws</sup>. So Aamir said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The people are alleging that Amir Al-Momineen<sup>asws</sup> is buried at Al-Rahba’. He<sup>asws</sup> said: ‘No’. He said, ‘So where is he<sup>asws</sup> buried?’ He<sup>asws</sup> said: ‘When he<sup>asws</sup> passed away, Al-Hassan<sup>asws</sup> carried him<sup>asws</sup> and came with him<sup>asws</sup> to behind Al-Kufa, near from Al-Najaf, left of Al-Ghary, right of Al-Hira. So he<sup>asws</sup> buried him<sup>asws</sup> between the two white dunes’. ",
            "He (the narrator) said, ‘So when it was afterwards, I went to the place. So I suspected a place from it. Then I went over to him<sup>asws</sup> and informed him<sup>asws</sup>, so he<sup>asws</sup> said: ‘You hit it. May Allah<sup>azwj</sup> have Mercy on you’ – thrice’."
          ],
          "en.sarwar": [
            " 4. A number of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Barqi from Ahmad ibn Zayd al-Naysaburi who has said that narrated to me ‘Umar ibn Ibrahim al-Hashimi from ‘Abd al-Malik ibn ‘Umar from ’Asid ibn Safwan the companion of the Messenger of Allah who has said the following. “On the day that Amir al-Mu’minin Ali (a.s.) passed away the place shock as people wept and cried and they were frightened like al-Thaqafi day the Holy Prophet (s.a) passed away. A man came weeping who seemed in a hurry and saying the words of the Holy Quran, “We are the servants of God and to Him we shall all return.” <a href=\"/#/books/quran:2#h156\">[2:156]</a> He continued, “Today the government as succession of that of the Holy Prophet (s.a) is discontinued.” He stood at the door of the house in which Amir al-Mu’minin Ali (a.s.) was and said, “May Allah grant you blessing, O abu al-Hassan. You were the first in the nation who accepted Islam and were of the purest faith among them. You were of the most solid certainty and feared Allah the most among them. The degree of your hard work (for the cause of Allah) was the greatest and you were the most cautious in protecting the Messenger of Allah among them. You were the most trusted in the affairs of his companions and of the most distinguished in excellence, of the most honorable past credentials, of the highest degree of virtue and the closest as relatives to the Messenger of Allah among them. You were the most similar among them to him (the Messenger of Allah) in the matters of providing guidance, moral discipline, mannerism and deeds. You were the most precious to him (the Messenger of Allah) among them, in value and the most honorable to him among them. May Allah grant you good rewards on behalf of Islam, His Messenger and the Muslims. You exercised strength when his (the Messenger of Allah’s) companions became weak. You would come out (to face the enemy) when they showed humiliation, you rose up whenever showed laziness. You maintained steadfastness in adherence to the system of the Messenger of Allah whenever his companions attended othewise. You, indeed, were his undisputed successor and you did not cause strife 9in the community) despite the mischief of the hypocrites, of the anger of the unbelievers, the dislike of the jealous ones, and lowliness of the transgressors. You stood firm for the truth when they failed, spoke clearly when they became speechless, marched forwards in the light of Allah and they halted and if they followed you they found the right guidance. You were the softest in tone and of the highest degree of prayer among them, of the smallest amount of speech and of the most correct and valid statements. You were of the greatest ideas, of the bravest heart, of the most solid certainty, of the best of deeds and the most knowledgeable of the issues among them. You, by Allah, were the lead figure in religion at first and at last. You were the first when people digressed in chaos and the last when they failed. Your as a kind father to the believers as they become dependent up on you and you bore such burdens that others felt much weak to carry. Your protected what they had lost and guarded what they had ignored. You tightened your belt when they accumulated (wealth with greed), you rose high when they despaired (in humiliation). You exercised patience when they rushed and you achieved what they had never dreamed to achieve and through you they gained what they had never expected to gain. You were as pouring calamity and disaster up on the unbelievers and the fortress and support for the believers. You were invented for the task of Leadership with Divine Authority with its blessing and you succeeded to achieve its awards, established its prerequisite and left with its distinctions. Your evidence in support your divine Authority never last its sharp edge and your heart never wavered, your intelligence never weakened, your soul did not falter or become frightened. You were like a mountain that strong winds could not move. It is just as the Holy Prophet (s.a) has said, “People lived secure in your company and their property well preserved in your hands.” You were just as the Holy Prophet (s.a) has said, “Physically weak but very strong to support the cause of Allah, of a very humble soul, but very great in the sight of Allah, the chief on earth and majestic in the sight of the believers. No one could ever find faults with you or advance criticism. No one could ever involve you in corruption. You never showed anyone (corrupt) compliance. The weak and feeble to you were strong popular until you would restore their rights and the powerful and popular were weak and feeble to you until you would make to yield to others rights. People of close relation or otherwise were all equal to you in such cases. You aimed the truth, the true and kindness. Your words were law and final and your commands were based on forbearance and determination your view was knowledge and the final decision in what you would do. The system is established, the pitfalls are routed, the fires (of mischief) are extinguished, religious issues are balanced and through you Islam has become strong. The guidance of Allah has become manifest even though the unbelievers dislike. Islam, the through you, and the believers are strengthened. You have raced (for Divine excellence) a long race and cause a great deal of weariness to those behind you. Losing you can never be compensated with weeping and your death is a great issue in heavens and it has threatened the people (with emergence of chaos). “We are the servants of God and to Him we shall all return.” <a href=\"/#/books/quran:2#h156\">[2:156]</a> We accept the decision of Allah and submit to His commands. By Allah, the Muslims will never find any one like you. You were a fortress and the stronghold like a heavy mountain and the intense anger for the unbelievers. May Allah join you with His Holy Prophet (s.a). May Allah not deprive us of your rewards and keep us safe against mis-guidance after you. People remained silent until he finished his words. He wept and the companions of the Messenger of Allah wept. Thereafter, they searched for him but he was nowhere to be found.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (304/ 5)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/52)"
        ],
        "index": 1232,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/162",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:6",
        "text": [
          " أَتَانِي عُمَرُ بْنُ يَزِيدَ فَقَالَ لِي ارْكَبْ فَرَكِبْتُ مَعَهُ فَمَضَيْنَا حَتَّى أَتَيْنَا مَنْزِلَ حَفْصٍ الْكُنَاسِيِّ فَاسْتَخْرَجْتُهُ فَرَكِبَ مَعَنَا ثُمَّ مَضَيْنَا حَتَّى أَتَيْنَا الْغَرِيَّ فَانْتَهَيْنَا إِلَى قَبْرٍ فَقَالَ انْزِلُوا هَذَا قَبْرُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقُلْنَا مِنْ أَيْنَ عَلِمْتَ فَقَالَ أَتَيْتُهُ مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) حَيْثُ كَانَ بِالْحِيرَةِ غَيْرَ مَرَّةٍ وَ خَبَّرَنِي أَنَّهُ قَبْرُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Al Qasim Bin Muhammad, from Abdullah Bin Sinan who said, ",
            "‘Umar Bin Yazeed came over to me and said to me, ‘Ride’. So I rode with him, and we went until we came to the house of Hafs Al-Kunasy, So we got him out, and he rode with us. Then we went until we came over to Al-Ghary, so we ended up to a grave. So he said, ‘Descend! This is the grave of Amir Al-Momineen<sup>asws</sup>’. So we said, ‘From where did you know that?’ So he said, ‘I came to it along with Abu Abdullah<sup>asws</sup> when he<sup>asws</sup> was at Al-Hira, more than once, and he<sup>asws</sup> informed me that it is his<sup>asws</sup> grave’."
          ],
          "en.sarwar": [
            " 5. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Safwan al-Jammal who has said the following. “Once I , ‘Amir and ‘Abdallah ibn Jiza‘Abdallah al-’Azdi were in the presence of abu ‘Abdallah (a.s.). The narrator has said that ‘Amir said to The Imam (a.s.), May Allah take my soul in service for your cause, people think that Amir al-Mu’minin Ali (a.s.) was buried in al-Rahba (and open space near the mosque of Kufa).” The Imam (a.s.) said, “No, he was not buried there.” He then asked, “Where is he buried?” The Imam (a.s.) said, “When he dies al-Hassan (a.s.) carried him towards behind Kufa near al-Najaf, towards the right of al-Ghari and the left of al-Hira. He buried him among the small dunes of white sands.” Later on I went to the place and I thought of one place as being it. I then returned and informed The Imam (a.s.) about it. The Imam (a.s.) said, “You found it three times. May grant you blessing.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/308)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1233,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/325",
              "text": "سَلَمَةَ بْنِ الْخَطَّابِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/148",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/617",
              "text": "عَبْدِ اللَّهِ بْنِ الْقَاسِمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1215",
              "text": "عِيسَى شَلَقَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ عِيسَى شَلَقَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:7",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) لَهُ خُئُولَةٌ فِي بَنِي مَخْزُومٍ وَ إِنَّ شَابّاً مِنْهُمْ أَتَاهُ فَقَالَ يَا خَالِي إِنَّ أَخِي مَاتَ وَ قَدْ حَزِنْتُ عَلَيْهِ حُزْناً شَدِيداً قَالَ فَقَالَ لَهُ تَشْتَهِي أَنْ تَرَاهُ قَالَ بَلَى قَالَ فَأَرِنِي قَبْرَهُ ",
          "قَالَ فَخَرَجَ وَ مَعَهُ بُرْدَةُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مُتَّزِراً بِهَا فَلَمَّا انْتَهَى إِلَى الْقَبْرِ تَلَمْلَمَتْ شَفَتَاهُ ثُمَّ رَكَضَهُ بِرِجْلِهِ فَخَرَجَ مِنْ قَبْرِهِ وَ هُوَ يَقُولُ بِلِسَانِ الْفُرْسِ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَ لَمْ تَمُتْ وَ أَنْتَ رَجُلٌ مِنَ الْعَرَبِ قَالَ بَلَى وَ لَكِنَّا مِتْنَا عَلَى سُنَّةِ فُلَانٍ وَ فُلَانٍ فَانْقَلَبَتْ أَلْسِنَتُنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Abdullah Bin Muhammad, from Abdullah Bin Al Qasim, from Isa Shalqan who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Amir Al-Momineen<sup>asws</sup> had a maternal uncle for him<sup>asws</sup> among the Clan of Makhzoum, and a youth from them came over to him<sup>asws</sup>. So he said, ‘O my maternal uncle! My brother died and I am in grief over him with intense grief’. So he<sup>asws</sup> said: ‘Do you crave to see him?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘So show me<sup>asws</sup> his grave’. ",
            "He<sup>asws</sup> said: ‘So he<sup>asws</sup> went out and with him<sup>asws</sup> was a cloak of Rasool-Allah<sup>saww</sup> being girded with it. So when he<sup>asws</sup> ended up to the grave, he<sup>asws</sup> moved his<sup>asws</sup> lips, then kicked it with his<sup>asws</sup> left. So he came out from his grave and he was saying (something) in the Persian language. So Amir Al-Momineen<sup>asws</sup> said: ‘Did you not die and you were a man from the Arabs?’ He said, ‘Yes, but we died upon the Sunnah of so and so, and so and so, so our language changed’."
          ],
          "en.sarwar": [
            " 6. Ahmad ibn Muhammad has narrated from ibn abu ‘Umayr from al-Qasim ibn Muhammad from ‘Abdallah ibn Sinan who has said the following. “Once ‘Umar ibn yazid came to me and said, “Ride with us and rode with them and went until we came to the house of Hafs al-Kunasi. He took him also with us and we continued the journey until we arrived at al-Ghari and to the grave. He said, “dismount, this is the grave of Amir al-Mu’minin Ali (a.s.).” We asked him, “How did you find out?” He said, “I have come here several times with abu ‘Abdallah (a.s.) when he was in al-Hira and he told me that this is his (Amir al-Mu’minin Ali (a.s.) grave.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (308/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1234,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:8",
        "text": [
          " لَمَّا قُبِضَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قَامَ الْحَسَنُ بْنُ عَلِيٍّ ( عليه السلام ) فِي مَسْجِدِ الْكُوفَةِ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ صَلَّى عَلَى النَّبِيِّ ( صلى الله عليه وآله ) ثُمَّ قَالَ أَيُّهَا النَّاسُ إِنَّهُ قَدْ قُبِضَ فِي هَذِهِ اللَّيْلَةِ رَجُلٌ مَا سَبَقَهُ الْأَوَّلُونَ وَ لَا يُدْرِكُهُ الْآخِرُونَ إِنَّهُ كَانَ لَصَاحِبَ رَايَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عَنْ يَمِينِهِ جَبْرَئِيلُ وَ عَنْ يَسَارِهِ مِيكَائِيلُ لَا يَنْثَنِي حَتَّى يَفْتَحَ اللَّهُ لَهُ ",
          "وَ اللَّهِ مَا تَرَكَ بَيْضَاءَ وَ لَا حَمْرَاءَ إِلَّا سَبْعَمِائَةِ دِرْهَمٍ فَضَلَتْ عَنْ عَطَائِهِ أَرَادَ أَنْ يَشْتَرِيَ بِهَا خَادِماً لِأَهْلِهِ وَ اللَّهِ لَقَدْ قُبِضَ فِي اللَّيْلَةِ الَّتِي فِيهَا قُبِضَ وَصِيُّ مُوسَى يُوشَعُ بْنُ نُونٍ وَ اللَّيْلَةِ الَّتِي عُرِجَ فِيهَا بِعِيسَى ابْنِ مَرْيَمَ وَ اللَّيْلَةِ الَّتِي نُزِّلَ فِيهَا الْقُرْآنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad and Ali Bin Muhammad, from Sahl Bin Ziyad, altogether from Ibn Mahboub, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When Amir Al-Momineen<sup>asws</sup> passed away, Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> stood up in Masjid Al-Kufa. So he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled upon Him<sup>azwj</sup>, and send Salawat upon the Prophet<sup>saww</sup>, then said: O you people! He<sup>asws</sup> has passed away during this night, a man (the likes of whom) has not preceded among the former ones nor will he be among the later ones. He<sup>asws</sup> was the bearer of the flag of Rasool-Allah<sup>saww</sup>. Upon his<sup>asws</sup> right was Jibraeel<sup>as</sup>, and on his<sup>asws</sup> left was Mikaeel<sup>as</sup>. He<sup>asws</sup> was not deterred until Allah<sup>azwj</sup> Granted victory to him<sup>asws</sup>. ",
            "By Allah<sup>azwj</sup>! He<sup>asws</sup> neither left behind a white nor a red, except for seven hundred Dirhams, being an excess from his<sup>asws</sup> gifts. He<sup>asws</sup> intended to buy a servant with it for his<sup>asws</sup> family. By Allah<sup>azwj</sup>! He<sup>asws</sup> has passed away during the night in which the successor<sup>as</sup> of Musa<sup>as</sup> Yoshua Bin Noun<sup>as</sup> passed away, and the night in which Isa Bin Maryam<sup>as</sup> was ascended with, and the night in which the Quran was Send down’."
          ],
          "en.sarwar": [
            " 7. Muhammad ibn Yahya has narrated from Salma ibn al-Khattab from ‘Abdallah ibn Muhammad from ‘Abdallah ibn al-Qasim from ‘Isa Shalqan who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘Amir al-Mu’minin Ali (a.s.) has maternal uncles in tribe of descendant of Makhdhum and a young man from them came to him (Amir al-Mu’minin Ali (a.s.) and said, “Uncle, my brother has died and I am very sad because of his death.” The narrator has said that he asked him, “Do you want to see him?” He said, “Yes, I want to see him.” He said, “show me his grave.” The narrator has said that he (Amir al-Mu’minin Ali (a.s.) came out with him with the gown of the Messenger of Allah on him and when he reach the grave he moved his lips and knocked his grave with hid foot and he came of his grave speaking in Persian language. Amir al-Mu’minin Ali (a.s.) asked, “Did you not die as a Arab man?” He said, “ Yes, but we died in the tradition of so and so son of so and so then our language changed.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (310/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1235,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:9",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَمَّا غُسِلَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) نُودُوا مِنْ جَانِبِ الْبَيْتِ إِنْ أَخَذْتُمْ مُقَدَّمَ السَّرِيرِ كُفِيتُمْ مُؤَخَّرَهُ وَ إِنْ أَخَذْتُمْ مُؤَخَّرَهُ كُفِيتُمْ مُقَدَّمَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When Amir Al-Momineen<sup>asws</sup> was washed (for funeral), there was a call from the side of the room: ‘If you were to grab the front of the coffin, I shall suffice for its back, and if you were to grab its back, I shall suffice for its front’."
          ],
          "en.sarwar": [
            " 8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Ali ibn mmd from Sahl ibn Ziyad all from kbn Mahbub from abu Hamza from abu Ja‘far (a.s.) who has said the following. “When Amir al-Mu’minin Ali (a.s.) passed away, al-Hassan ibn Ali stoop up in the Mosque if Kufa. He praises Allah and spoke of His Glory prayed to Allah to grant blessings up on the Holy Prophet (s.a) and then he said this. People tonight a man has passed away the like whom can not be found in previous and the coming generations. He was the standard bearer of the Messenger of Allah, with Jibril on his right micha’il on his left. He would not turn back until Allah would grant him victory. All that he has left of the worldly belongings is a seven hundred Dirham extra from his gifts with which he wanted to buy ( hire) a servant for his household. By Allah, he died during a night in which the executor of the will of Musa (Moses) Yusha‘ ibn Nun had passed away, the night in which Jesus son of Mary was taken to heavens and the night in which the Holy Quran was revealed.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/310)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1236,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1216",
              "text": "عَبْدُ اللَّهِ بْنُ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1217",
              "text": "سَعْدُ بْنُ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1218",
              "text": "إِبْرَاهِيمَ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1219",
              "text": "أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1037",
              "text": "حَبِيبٍ السِّجِسْتَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَبْدُ اللَّهِ بْنُ جَعْفَرٍ وَ سَعْدُ بْنُ عَبْدِ اللَّهِ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ حَبِيبٍ السِّجِسْتَانِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:10",
        "text": [
          " سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ وُلِدَتْ فَاطِمَةُ بِنْتُ مُحَمَّدٍ ( صلى الله عليه وآله ) بَعْدَ مَبْعَثِ رَسُولِ اللَّهِ بِخَمْسِ سِنِينَ وَ تُوُفِّيَتْ وَ لَهَا ثَمَانَ عَشْرَةَ سَنَةً وَ خَمْسَةٌ وَ سَبْعُونَ يَوْماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Abdullah Bin Ja’far and Sa’d Bin Abdullah, altogether from Ibrahim Bin Mahziyar, from his father Ali Bin Mahziyar, from Al Hassan Bin Mahboub, from Hisham Bin Salim, from Habeeb Al Sijistany who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> was blessed with daughter (Syeda) Fatima<sup>asws</sup> after the Message of Rasool-Allah<sup>saww</sup> by five years, and she<sup>asws</sup> passed away, and for her were eighteen years and seventy five days’."
          ],
          "en.sarwar": [
            " 9. Ali ibn Muhammad has narrated from in a marfu‘ manner from abu ‘Abdallah (a.s.) who has said the following. “When Amir al-Mu’minin Ali (a.s.) was washed for burial they called from the side of the house, “If you would lift up the front of the coffin you would not need to lift up the back of the coffin and if you would lift up the back side then you would not need to lift up the front side.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (311/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1237,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1217",
              "text": "سَعْدُ بْنُ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/48",
              "text": "الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1220",
              "text": "عَبْدِ اللَّهِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "سَعْدُ بْنُ عَبْدِ اللَّهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بُكَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:113:11",
        "text": [
          "هُ سَمِعَهُ يَقُولُ لَمَّا قُبِضَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَخْرَجَهُ الْحَسَنُ وَ الْحُسَيْنُ وَ رَجُلَانِ آخَرَانِ حَتَّى إِذَا خَرَجُوا مِنَ الْكُوفَةِ تَرَكُوهَا عَنْ أَيْمَانِهِمْ ثُمَّ أَخَذُوا فِي الْجَبَّانَةِ حَتَّى مَرُّوا بِهِ إِلَى الْغَرِيِّ فَدَفَنُوهُ وَ سَوَّوْا قَبْرَهُ فَانْصَرَفُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Sa’d Bin Abdullah, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Ali Bin Fazzal, from Abdullah Bukeyr, from some of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that he heard him<sup>asws</sup> saying: ‘When Amir Al-Momineen<sup>asws</sup> passed away, Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup> and two other men brought him<sup>asws</sup> out until when they came out from Al-Kufa. They left it (Al-Kufa) upon their right, then they took (the way) of Al-Jabban until they passed with him<sup>asws</sup> to Al-Ghary, so they buried him<sup>asws</sup>, and evened out his<sup>asws</sup> grave, and they left’."
          ],
          "en.sarwar": [
            " 10. ‘Abdallah ibn Ja‘far and Sa‘d ibn ‘Abdallah together have narrated from Ibrahim ibn Mahziyar from his brother, Ali ibn Mahziyar from al-Hassan ibn Mahbub from Hisham ibn Salim from Habib al-Sajistani who has said the following. “I heard abu Ja‘far (a.s.) say, “Fatima, daughter of the Holy Prophet (s.a) was born five years after the proclaimed to be the Messenger of Allah and she passed away when she was eighteen years and seventy five days old.”"
          ]
        }
      },
      {
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": " "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1221",
              "text": "11ـ سَعْدُ بْنُ عَبْدِ الله"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/48",
              "text": "الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1222",
              "text": "عَبْدِ الله بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/455",
              "text": "أَبِي عَبْدِ الله (عَلَيْهِ السَّلام)"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": " 11ـ سَعْدُ بْنُ عَبْدِ الله عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ عَبْدِ الله بُكَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) أَنَّ"
        },
        "part_type": "Hadith",
        "text": [
          "هُ سَمِعَهُ يَقُولُ لَمَّا قُبِضَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) أَخْرَجَهُ الْحَسَنُ وَالْحُسَيْنُ وَرَجُلانِ آخَرَانِ حَتَّى إِذَا خَرَجُوا مِنَ الْكُوفَةِ تَرَكُوهَا عَنْ أَيْمَانِهِمْ ثُمَّ أَخَذُوا فِي الْجَبَّانَةِ حَتَّى مَرُّوا بِهِ إِلَى الْغَرِيِّ فَدَفَنُوهُ وَسَوَّوْا قَبْرَهُ فَانْصَرَفُوا."
        ],
        "translations": {
          "en.sarwar": [
            " 11. Sa‘d ibn ‘Abdallah has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Ali ibn Faddal from ‘Abdallah ibn Bukaayr from certain persons of our people who has said the following. “He heard abu ‘Abdallah (a.s.) say, ‘ When Amir al-Mu’minin Ali (a.s.) died, al-Hassan and al-Husayn and two other man carried his body out until they went out of Kufa. They continued with Kufa on their right and then they moved forwards on the path of Jabana until they passed al-Ghari. They then buried him and leveelled his grave and then return (home).”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:113",
  "kind": "verse_list"
}