{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 114"
        },
        "path": "/books/al-kafi:1:4:114",
        "titles": {
          "ar": "باب مَوْلِدِ الزَّهْرَاءِ فَاطِمَةَ ( عليها السلام )",
          "en": "Chapter 114 – The Nazool (Arrival) of Al-Zahra Fatima<sup>asws</sup>"
        }
      }
    ],
    "index": 172,
    "local_index": 114,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 115"
        },
        "path": "/books/al-kafi:1:4:115",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَوْلِدِ الْحَسَنِ</span> بْنِ عَلِيٍّ صَلَوَاتُ اللَّهِ عَلَيْهِمَا",
          "en": "Chapter 115 – The Nazool (Arrival) of Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>, may the Salawat of Allah<sup>azwj</sup> be upon them<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 113"
        },
        "path": "/books/al-kafi:1:4:113",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَوْلِدِ أَمِيرِ</span> الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ",
          "en": "Chapter 113 – Nazool (Arrival) of Amir Al-Momineen<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:114",
    "titles": {
      "ar": "باب مَوْلِدِ الزَّهْرَاءِ فَاطِمَةَ ( عليها السلام )",
      "en": "Chapter 114 – The Nazool (Arrival) of Al-Zahra Fatima<sup>asws</sup>"
    },
    "verse_count": 10,
    "verse_start_index": 1237,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1238,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/355",
              "text": "ابْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/309",
              "text": "أَبِي عُبَيْدَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:114:1",
        "text": [
          " إِنَّ فَاطِمَةَ ( عليها السلام ) مَكَثَتْ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) خَمْسَةً وَ سَبْعِينَ يَوْماً وَ كَانَ دَخَلَهَا حُزْنٌ شَدِيدٌ عَلَى أَبِيهَا وَ كَانَ يَأْتِيهَا جَبْرَئِيلُ ( عليه السلام ) فَيُحْسِنُ عَزَاءَهَا عَلَى أَبِيهَا وَ يُطَيِّبُ نَفْسَهَا وَ يُخْبِرُهَا عَنْ أَبِيهَا وَ مَكَانِهِ وَ يُخْبِرُهَا بِمَا يَكُونُ بَعْدَهَا فِي ذُرِّيَّتِهَا وَ كَانَ عَلِيٌّ ( عليه السلام ) يَكْتُبُ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Abu Ubeyda, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘(Syeda) Fatima<sup>asws</sup> remained after Rasool-Allah<sup>saww</sup> for seventy five days, and intense grief entered into her<sup>asws</sup> upon her<sup>asws</sup> father<sup>saww</sup>, and Jibraeel<sup>as</sup> used to come to her<sup>asws</sup> and would excellently console her<sup>asws</sup> upon her<sup>asws</sup> father<sup>saww</sup>, and that would make her<sup>asws</sup> better and he<sup>as</sup> would inform her<sup>asws</sup> about her<sup>asws</sup> father<sup>saww</sup>, and his<sup>saww</sup> place, and he<sup>as</sup> would inform her<sup>asws</sup> with what would be happening after her<sup>asws</sup> among her<sup>asws</sup> children, and Ali<sup>asws</sup> would write that down’."
          ],
          "en.sarwar": [
            " Fatima (a.s.) was born five years after the Messenger of Allah declared his message. She died when she was eighteen years and seventy five days old. She lived for seventy five days after the death of her father (s.a).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/314)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1239,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/612",
              "text": "الْعَمْرَكِيِّ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/613",
              "text": "عَلِيِّ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1223",
              "text": "أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:114:2",
        "text": [
          " إِنَّ فَاطِمَةَ ( عليها السلام ) صِدِّيقَةٌ شَهِيدَةٌ وَ إِنَّ بَنَاتِ الْأَنْبِيَاءِ لَا يَطْمَثْنَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Amraky Bin Ali, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan<sup>asws</sup> having said: ‘(Syeda) Fatima<sup>asws</sup> was truthful, a martyr, and that the daughters of the Prophets<sup>as</sup> do not menstruate’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn al-Ri’ab from abu ‘Ubayda from abu ‘Abdallah (a.s.) who has said the following. “Fatima live for seventy five days of the death of the Messenger of Allah. She has become extremely sad for her father. Jibril would come to her for condolences because of the death of her father and to provide solace. He would inform her about her father about the where he was and about what would happen after her death to her descendants and Ali (a.s.) would down such information.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/315)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1240,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1070",
              "text": "أَحْمَدُ بْنُ مِهْرَانَ رَحِمَهُ اللَّهُ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1224",
              "text": "وَ أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1225",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ الشَّيْبَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1226",
              "text": "الْقَاسِمُ بْنُ مُحَمَّدٍ الرَّازِيُّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مِهْرَانَ رَحِمَهُ اللَّهُ رَفَعَهُ وَ أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ الشَّيْبَانِيِّ قَالَ حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ الرَّازِيُّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:114:3",
        "relations": {
          "Mentions": [
            "/books/quran:2:156"
          ]
        },
        "text": [
          " حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ الْهُرْمُزَانِيُّ عَنْ أَبِي عَبْدِ اللَّهِ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام ) قَالَ لَمَّا قُبِضَتْ فَاطِمَةُ ( عليها السلام ) دَفَنَهَا أَمِيرُ الْمُؤْمِنِينَ سِرّاً وَ عَفَا عَلَى مَوْضِعِ قَبْرِهَا ثُمَّ قَامَ فَحَوَّلَ وَجْهَهُ إِلَى قَبْرِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ عَنِّي وَ السَّلَامُ عَلَيْكَ عَنِ ابْنَتِكَ وَ زَائِرَتِكَ وَ الْبَائِتَةِ فِي الثَّرَى بِبُقْعَتِكَ وَ الْمُخْتَارِ اللَّهُ لَهَا سُرْعَةَ اللِّحَاقِ بِكَ",
          "قَلَّ يَا رَسُولَ اللَّهِ عَنْ صَفِيَّتِكَ صَبْرِي وَ عَفَا عَنْ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ تَجَلُّدِي إِلَّا أَنَّ لِي فِي التَّأَسِّي بِسُنَّتِكَ فِي فُرْقَتِكَ مَوْضِعَ تَعَزٍّ فَلَقَدْ وَسَّدْتُكَ فِي مَلْحُودَةِ قَبْرِكَ وَ فَاضَتْ نَفْسُكَ بَيْنَ نَحْرِي وَ صَدْرِي بَلَى وَ فِي كِتَابِ اللَّهِ لِي أَنْعَمُ الْقَبُولِ إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ",
          "قَدِ اسْتُرْجِعَتِ الْوَدِيعَةُ وَ أُخِذَتِ الرَّهِينَةُ وَ أُخْلِسَتِ الزَّهْرَاءُ فَمَا أَقْبَحَ الْخَضْرَاءَ وَ الْغَبْرَاءَ يَا رَسُولَ اللَّهِ أَمَّا حُزْنِي فَسَرْمَدٌ وَ أَمَّا لَيْلِي فَمُسَهَّدٌ وَ هَمٌّ لَا يَبْرَحُ مِنْ قَلْبِي أَوْ يَخْتَارَ اللَّهُ لِي دَارَكَ الَّتِي أَنْتَ فِيهَا مُقِيمٌ",
          "كَمَدٌ مُقَيِّحٌ وَ هَمٌّ مُهَيِّجٌ سَرْعَانَ مَا فَرَّقَ بَيْنَنَا وَ إِلَى اللَّهِ أَشْكُو وَ سَتُنْبِئُكَ ابْنَتُكَ بِتَظَافُرِ أُمَّتِكَ عَلَى هَضْمِهَا فَأَحْفِهَا السُّؤَالَ وَ اسْتَخْبِرْهَا الْحَالَ فَكَمْ مِنْ غَلِيلٍ مُعْتَلِجٍ بِصَدْرِهَا لَمْ تَجِدْ إِلَى بَثِّهِ سَبِيلًا وَ سَتَقُولُ وَ يَحْكُمُ اللَّهُ وَ هُوَ خَيْرُ الْحَاكِمِينَ",
          "سَلَامَ مُوَدِّعٍ لَا قَالٍ وَ لَا سَئِمٍ فَإِنْ أَنْصَرِفْ فَلَا عَنْ مَلَالَةٍ وَ إِنْ أُقِمْ فَلَا عَنْ سُوءِ ظَنٍّ بِمَا وَعَدَ اللَّهُ الصَّابِرِينَ وَاهَ وَاهاً وَ الصَّبْرُ أَيْمَنُ وَ أَجْمَلُ وَ لَوْ لَا غَلَبَةُ الْمُسْتَوْلِينَ لَجَعَلْتُ الْمُقَامَ وَ اللَّبْثَ لِزَاماً مَعْكُوفاً وَ لَأَعْوَلْتُ إِعْوَالَ الثَّكْلَى عَلَى جَلِيلِ الرَّزِيَّةِ ",
          "فَبِعَيْنِ اللَّهِ تُدْفَنُ ابْنَتُكَ سِرّاً وَ تُهْضَمُ حَقَّهَا وَ تُمْنَعُ إِرْثَهَا وَ لَمْ يَتَبَاعَدِ الْعَهْدُ وَ لَمْ يَخْلَقْ مِنْكَ الذِّكْرُ وَ إِلَى اللَّهِ يَا رَسُولَ اللَّهِ الْمُشْتَكَى وَ فِيكَ يَا رَسُولَ اللَّهِ أَحْسَنُ الْعَزَاءِ صَلَّى اللَّهُ عَلَيْكَ وَ عَلَيْهَا السَّلَامُ وَ الرِّضْوَانُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, raising it, and Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar Al Shaybani who said, ‘Al Qasim Bin Muhammad Al Razy narrated to me saying, ‘Ali Bin Muhammad Al Hurmuzani narrated to us, ",
            "(It has been narrated) from Abu Abdullah Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> having said: ‘When (Syeda) Fatima<sup>asws</sup> passed away, Amir Al-Momineen<sup>asws</sup> buried her<sup>asws</sup> secretly, and effaced upon the place of her<sup>asws</sup> grave. Then he<sup>asws</sup> stood and turned his<sup>asws</sup> face towards the grave of Rasool-Allah<sup>saww</sup> and he<sup>asws</sup> said: ‘The greetings be upon you<sup>saww</sup>, O Rasool-Allah<sup>saww</sup> from me<sup>asws</sup> and the greetings be upon you<sup>saww</sup> from your<sup>saww</sup> daughter<sup>asws</sup>, and she<sup>asws</sup> would be visiting you<sup>saww</sup> and spending the night in the soil in your<sup>saww</sup> spot, and Allah<sup>azwj</sup> Chose for her<sup>asws</sup> a quick meeting with you<sup>saww</sup>.",
            "Little is my<sup>asws</sup> patience from losing you<sup>saww</sup> and excuse my<sup>asws</sup> tolerance from (losing) the chief-tess of the women of the worlds, except that for me<sup>asws</sup> is the solace with your<sup>saww</sup> Sunnah during your<sup>saww</sup> separation in place of condolence. So I<sup>asws</sup> had placed your<sup>saww</sup> pillow in the chasm of your<sup>saww</sup> grave, and your<sup>saww</sup> soul left between my<sup>asws</sup> throat and my<sup>asws</sup> chest. Yes, and in the Book of Allah<sup>azwj</sup>, there is for me<sup>asws</sup> the best of the acceptances <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h156\">[2:156]</a> Surely we are for Allah and to Him we are returning</span>. ",
            "I<sup>asws</sup> have returned the deposit and taken the pledge, and the blossom (Al-Zahra<sup>asws</sup>) is no more. So how ugly is the greenery and the dust, O Rasool-Allah<sup>saww</sup>! As for my<sup>asws</sup> grief, so it is perpetual, and as for my<sup>asws</sup> night, so it is sleepless, and the worries do not come out from my<sup>asws</sup> heart, unless Allah<sup>azwj</sup> Chooses for me<sup>asws</sup> your<sup>saww</sup> dwelling which you<sup>saww</sup> are staying in. ",
            "I<sup>asws</sup> am heartsicken, sorrowful, anxious, upset. How quick was the separation between us<sup>asws</sup>. And to Allah<sup>azwj</sup> I<sup>asws</sup> complain, and your<sup>saww</sup> daughter<sup>asws</sup> will be informing you<sup>saww</sup> of the concerted efforts of your<sup>saww</sup> community upon devouring her<sup>asws</sup>. So as her<sup>asws</sup>, you<sup>saww</sup> will come to know of the state. So how many were her<sup>asws</sup> sorrows grabbing her<sup>asws</sup> chest, she<sup>asws</sup> could not find a way to expressing them, and she<sup>asws</sup> was saying: ‘And Allah<sup>azwj</sup> will Judge, and He<sup>azwj</sup> is the best of the judges’. ",
            "Greetings of farewell is not what I<sup>asws</sup> say, nor out of weariness. So, if I<sup>asws</sup> leave, it would not be from disappointment, and if I<sup>asws</sup> stay it would not be from pessimism with what Allah<sup>azwj</sup> Promised the patient ones. Alas! And the patience is more fruitful and more beautiful, and were it not for the pre-dominance of the mischievous ones, I<sup>asws</sup> would have made the place and the remaining (here) to be unambiguous and wailed the wailing of the bereaved mother upon the calamity of the child.",
            "So in the Sight of Allah<sup>azwj</sup>, your<sup>saww</sup> daughter is buried secretly, and her<sup>asws</sup> rights have been devoured, and her<sup>asws</sup> inheritance prevented, and the covenant is not distance and your<sup>saww</sup> memories are still fresh; and to Allah<sup>azwj</sup>, O Rasool-Allah<sup>saww</sup>, is the complaint, and regarding you<sup>saww</sup>, O Rasool-Allah<sup>saww</sup> is the best of the condolences. May Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawat</span> upon you<sup>saww</sup> and upon her<sup>asws</sup>, the peace and the (Divine) Pleasure’."
          ],
          "en.sarwar": [
            " 2. Muhammad in Yahya has narrated from al-‘Amrakiy ibn Ali from Ali ibn Ja‘far from his brother from abu al-Hassan (a.s.) who has said the following. “Fatima is truthful and a martyr. The daughter of the prophet do not experience menses.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/321)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1241,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/239",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1227",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/384",
              "text": "الْمُفَضَّلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَالِمٍ عَنِ الْمُفَضَّلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:114:4",
        "relations": {
          "Mentions": [
            "/books/quran:2:156"
          ]
        },
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَنْ غَسَلَ فَاطِمَةَ قَالَ ذَاكَ أَمِيرُ الْمُؤْمِنِينَ وَ كَأَنِّي اسْتَعْظَمْتُ ذَلِكَ مِنْ قَوْلِهِ فَقَالَ كَأَنَّكَ ضِقْتَ بِمَا أَخْبَرْتُكَ بِهِ قَالَ فَقُلْتُ قَدْ كَانَ ذَاكَ جُعِلْتُ فِدَاكَ قَالَ فَقَالَ لَا تَضِيقَنَّ فَإِنَّهَا صِدِّيقَةٌ وَ لَمْ يَكُنْ يَغْسِلُهَا إِلَّا صِدِّيقٌ أَ مَا عَلِمْتَ أَنَّ مَرْيَمَ لَمْ يَغْسِلْهَا إِلَّا عِيسَى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr, from Abdul Rahman Bin Salim, from Al Mufazzal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, (the narrator says) ’I said to Abu Abdullah<sup>asws</sup>, ‘Who Washed (Syeda) Fatima<sup>asws</sup> (for funeral)?’ He<sup>asws</sup> said: ‘That was Amir Al-Momineen<sup>asws</sup>’, and it was as if I took that as grievous from his<sup>asws</sup> words. So he<sup>asws</sup> said: ‘It is as if you<sup>asws</sup> are constricted with what I<sup>asws</sup> informed you with’. So I said, ‘It has been that, may I be sacrificed for you<sup>asws</sup>!’ So he<sup>asws</sup> said: ‘Do not be constricted, for she<sup>asws</sup> is a Truthful and none could have happened to have washed her<sup>asws</sup> except for a Truthful. Do you not know that Maryam<sup>as</sup>, no one washed her<sup>as</sup> (for funeral) except for Isa<sup>as</sup>?’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Mihran, may Allah grant him blessing, has narrated from narrated in a in a marfu‘ manner and Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar al-Shaybani has said that narrated to me al-Qasim ibn Muhammad al-Razi who has said that narrated to him Ali ibn Muhammad al-Hurmuzi from abu ‘Abdallah al-Husayn ibn Ali (a.s.) who has said the following. “When Fatima (a.s.) passed away Amir al-Mu’minin Ali (a.s.) buried her secretly, camouflaged her grave site he then stood up facing the grave of the Messenger of Allah said, “O the Messenger of Allah may He grant you blessings on behalf of me the on behalf of your daughter who is visiting you and will pass this night in the soil in your location whom Allah chose to make join you the fastest. O the Messenger of Allah of my patience has reached to the brims and I miss so much your chosen one (daughter) and my self-control is banished for the departure of the leader of the ladies of the worlds. The only solace for me is to follow your tradition and be mournful for your own departure from us. A little while ago I placed you in your grave and your spirit left your body between my own throat and chest. Yes, in the book of Allah (for me) there is the best form to express acceptance of Allah’s decision ““We are the servants of God and to Him we shall all return.” <a href=\"/#/books/quran:2#h156\">[2:156]</a> The trust is returned and the commit is recalled amd al-Zahra’ is taken away from us. How sad, O the Messenger of Allah, the green skies and the dusty earth seem to us. My sadness has become perpetual and my night have become sleepless. There is an anxiety that will not relieve my heart until Allah will chose for me the dwelling like that where you are. I have a heart bleeding sorrow and a restless anxiety. How quickly the separation took place? To Allah I raise my complains and your own daughter will explain to you how your ’Umma (followers) succeeded in committing injustice against her. You may ask her questions and find information about the case from her. How great was the sorrow that she will find a place and an ear to express to. She would say Allah will judge because he is the best judge. I offer my prayer to Allah to grant you blessings as a note of farewell but not because of disappointment and despaired. If I return it is not that I have become tired and if I will stand up it will not be because of pessimism in the promise of Allah to those who exercise patience. Indeed to exercise patience is more safe and fruitful. Had not been for the mischief of the enemies I would have turned the place a place of worship andd would have kept my worship continuous and would cried like the mothers for the death of their son for the great loss. In the sight of Allah your daughter is buried secretly, her rights are taken away unjustly, her inheritance is withheld for no valid reason. It all has happen just after you left and your memories are still fresh. To Allah O the Messenger of Allah we complain and from youu O the Messenger of Allah we seek condolences. May Allah grant blessings to you and to her. May the peace and happiness of Allah be with you.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (342/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1242,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1166",
              "text": "صَالِحِ بْنِ عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1228",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْجُعْفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/281",
              "text": "أَبِي جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْجُعْفِيِّ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:114:5",
        "text": [
          "ا إِنَّ فَاطِمَةَ ( عليها السلام ) لَمَّا أَنْ كَانَ مِنْ أَمْرِهِمْ مَا كَانَ أَخَذَتْ بِتَلَابِيبِ عُمَرَ فَجَذَبَتْهُ إِلَيْهَا ثُمَّ قَالَتْ أَمَا وَ اللَّهِ يَا ابْنَ الْخَطَّابِ لَوْ لَا أَنِّي أَكْرَهُ أَنْ يُصِيبَ الْبَلَاءُ مَنْ لَا ذَنْبَ لَهُ لَعَلِمْتَ أَنِّي سَأُقْسِمُ عَلَى اللَّهِ ثُمَّ أَجِدُهُ سَرِيعَ الْإِجَابَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Salih Bin Uqba, from Abdullah Bin Muhammad Al Ju’fy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having said: ‘(Syeda) Fatima<sup>asws</sup>, when it was from their affair what was (Abu Bakr and Umar’s burning down her<sup>asws</sup> door etc.), she<sup>asws</sup> grabbed the collar of Umar and pulled him, then she<sup>asws</sup> said: ‘But, by Allah<sup>azwj</sup>, O son of Khattab! Had it not been for my<sup>asws</sup> dislike of the affliction hitting the ones who has not sin for him, you would have known that I<sup>asws</sup> would have sworn upon Allah<sup>azwj</sup> (for a curse to befall), then a quick Response would have been found’."
          ],
          "en.sarwar": [
            " 4. A number of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ahmad ibn Muhammad ibn abu Nasr from ‘Abd al-Rahman ibn Salim from al-Faddal who has said the following. “I asked abu ‘Abdallah (a.s.), “Who washed Fatima (for burial)?” he said, “Amir al-Mu’minin Ali (a.s.) did.” My impression from his words seemed to be an extraordinary one. He said, “You seem to be constrained from what I said.” The narrator has said that I replied, “Yes, May Allah take my soul in service for your cause, it is so.” The narrator has said that the Imam (a.s.) then said, “Do not be constrained. She was the all truism person and no one has the authority to wash an all truism person but another all truism person. Did you not know that no one could wash Mary but Jesus.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/342)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1243,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1166",
              "text": "صَالِحِ بْنِ عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1229",
              "text": "يَزِيدَ بْنِ عَبْدِ الْمَلِكِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ يَزِيدَ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:114:6",
        "text": [
          " لَمَّا وُلِدَتْ فَاطِمَةُ ( عليها السلام ) أَوْحَى اللَّهُ إِلَى مَلَكٍ فَأَنْطَقَ بِهِ لِسَانَ مُحَمَّدٍ ( صلى الله عليه وآله ) فَسَمَّاهَا فَاطِمَةَ ثُمَّ قَالَ إِنِّي فَطَمْتُكِ بِالْعِلْمِ وَ فَطَمْتُكِ مِنَ الطَّمْثِ ",
          "ثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ اللَّهِ لَقَدْ فَطَمَهَا اللَّهُ بِالْعِلْمِ وَ عَنِ الطَّمْثِ فِي الْمِيثَاقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Salih Bin Uqba, from Yazeed Bin Abdul Malik, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When (Rasool-Allah) was Blessed with (Syeda) Fatima<sup>asws</sup>, Allah<sup>azwj</sup> Revealed to an Angel, so he spoke with in the tongue (tone) of Muhammad<sup>saww</sup>: ‘So name her<sup>asws</sup> as ‘فَاطِمَةَ’ Fatima<sup>asws</sup>’. Then said: ‘I<sup>azwj</sup> have Liberated the knowledge for you<sup>asws</sup> and Freed you<sup>asws</sup> from any impurity’. ",
            "Then Abu Ja’far<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> had Liberated the knowledge for her<sup>asws</sup> and Freed you<sup>asws</sup> from any impurity’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ’Isma‘il fmSalih ibn ‘Aqaba from ‘Abdallah ibn Muhammad al-Ju‘fi from abu Ja‘far (a.s.) and abu ‘Abdallah (a.s.) who has said the following. “During the time of their doing (setting the door on fire) what they did Fatima held ‘Umar by his collar and pulled (down) saying, “By Allah, O son of al-Khattab, had I not disliked to inflicting calamity up on the innocent people, you would have learned how quickly my swearing up on Allah would have brought the swift response (with the wrath of Allah up on you).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (344/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1244,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1166",
              "text": "صَالِحِ بْنِ عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/203",
              "text": "عَمْرِو بْنِ شِمْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/181",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:114:7",
        "text": [
          " قَالَ النَّبِيُّ ( صلى الله عليه وآله ) لِفَاطِمَةَ ( عليها السلام ) يَا فَاطِمَةُ قُومِي فَأَخْرِجِي تِلْكَ الصَّحْفَةَ فَقَامَتْ فَأَخْرَجَتْ صَحْفَةً فِيهَا ثَرِيدٌ وَ عُرَاقٌ يَفُورُ فَأَكَلَ النَّبِيُّ ( صلى الله عليه وآله ) وَ عَلِيٌّ وَ فَاطِمَةُ وَ الْحَسَنُ وَ الْحُسَيْنُ ثَلَاثَةَ عَشَرَ يَوْماً ",
          "ثُمَّ إِنَّ أُمَّ أَيْمَنَ رَأَتِ الْحُسَيْنَ مَعَهُ شَيْ‏ءٌ فَقَالَتْ لَهُ مِنْ أَيْنَ لَكَ هَذَا قَالَ إِنَّا لَنَأْكُلُهُ مُنْذُ أَيَّامٍ فَأَتَتْ أُمُّ أَيْمَنَ فَاطِمَةَ فَقَالَتْ يَا فَاطِمَةُ إِذَا كَانَ عِنْدَ أُمِّ أَيْمَنَ شَيْ‏ءٌ فَإِنَّمَا هُوَ لِفَاطِمَةَ وَ وُلْدِهَا وَ إِذَا كَانَ عِنْدَ فَاطِمَةَ شَيْ‏ءٌ فَلَيْسَ لِأُمِّ أَيْمَنَ مِنْهُ شَيْ‏ءٌ ",
          "فَأَخْرَجَتْ لَهَا مِنْهُ فَأَكَلَتْ مِنْهُ أُمُّ أَيْمَنَ وَ نَفِدَتِ الصَّحْفَةُ فَقَالَ لَهَا النَّبِيُّ ( صلى الله عليه وآله ) أَمَا لَوْ لَا أَنَّكِ أَطْعَمْتِهَا لَأَكَلْتِ مِنْهَا أَنْتِ وَ ذُرِّيَّتُكِ إِلَى أَنْ تَقُومَ السَّاعَةُ ",
          "ثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ الصَّحْفَةُ عِنْدَنَا يَخْرُجُ بِهَا قَائِمُنَا ( عليه السلام ) فِي زَمَانِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Salih Bin Uqba, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said to (Syeda) Fatima<sup>asws</sup>: ‘O Fatima<sup>asws</sup>! Arise and bring out that tray to me<sup>saww</sup>’. So she<sup>asws</sup> arose and brought out a tray which contained porridge and some steamed meat. So the Prophet<sup>saww</sup>, and Ali<sup>asws</sup>, and (Syed) Fatima<sup>asws</sup>, and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup> ate (from it) for thirteen days.",
            "Then Umm Ayman<sup>as</sup> saw Al-Husayn<sup>asws</sup> having something with him<sup>asws</sup>, so she<sup>as</sup> said to him<sup>asws</sup>: ‘From where did this come for you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘We<sup>asws</sup> have been eating it for days’. So Umm Ayman<sup>as</sup> came over to (Syeda) Fatima<sup>asws</sup> and she<sup>as</sup> said: ‘O Fatima<sup>asws</sup>! Whenever there is something for Umm Ayman<sup>as</sup>, so rather it would be for (Syeda) Fatima<sup>asws</sup> and her<sup>asws</sup> children, and when there was something with (Syeda) Fatima<sup>asws</sup>, so there isn’t anything from it for Umm Ayman<sup>as</sup>?’ ",
            "So she<sup>asws</sup> brought out for her<sup>as</sup>, from it, and Umm Ayman<sup>as</sup> ate from it and the tray ran out. So the Prophet<sup>saww</sup> said to her<sup>asws</sup>: ‘But, had you<sup>asws</sup> not fed her<sup>as</sup>, there would have eaten from it, yourself<sup>asws</sup> and your<sup>asws</sup> offspring, until the Establishment of the Hour’. ",
            "Then Abu Ja’far<sup>asws</sup> said: ‘And the tray is with us<sup>asws</sup>. Our<sup>asws</sup> Qaim<sup>asws</sup> would come out with it during his<sup>asws</sup> era’."
          ],
          "en.sarwar": [
            " 6. Through the same chain of narrators it is narrated from Salih ibn ‘Aqaba from Yazid ibn ‘Abd al-Malik from abu Ja‘far (a.s.) who has said the following. “When Fatima (a.s.) was born Allah sent an angel to make the tongue of Muhammad (s.a) call her ‘Fatima’. Then he said, “I set you free (from ignorance) with knowledge and set you free from menses.” Abu Ja‘far (a.s.) then said, “By Allah, He had set her free with knowledge (from ignorance) and from menses at the time universal covenant (al-Mithaq).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (345/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1245,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1230",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/613",
              "text": "عَلِيِّ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:114:8",
        "text": [
          " سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ بَيْنَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) جَالِسٌ إِذْ دَخَلَ عَلَيْهِ مَلَكٌ لَهُ أَرْبَعَةٌ وَ عِشْرُونَ وَجْهاً فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَبِيبِي جَبْرَئِيلُ لَمْ أَرَكَ فِي مِثْلِ هَذِهِ الصُّورَةِ قَالَ الْمَلَكُ لَسْتُ بِجَبْرَئِيلَ يَا مُحَمَّدُ بَعَثَنِي اللَّهُ عَزَّ وَ جَلَّ أَنْ أُزَوِّجَ النُّورَ مِنَ النُّورِ قَالَ مَنْ مِمَّنْ قَالَ فَاطِمَةَ مِنْ عَلِيٍّ ",
          "قَالَ فَلَمَّا وَلَّى الْمَلَكُ إِذَا بَيْنَ كَتِفَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ عَلِيٌّ وَصِيُّهُ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مُنْذُ كَمْ كُتِبَ هَذَا بَيْنَ كَتِفَيْكَ فَقَالَ مِنْ قَبْلِ أَنْ يَخْلُقَ اللَّهُ آدَمَ بِاثْنَيْنِ وَ عِشْرِينَ أَلْفَ عَامٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Ali, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup> having said: ‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘While Rasool-Allah<sup>saww</sup> was seated, an Angel came over who had twenty four faces for him So he said to Rasool-Allah<sup>saw</sup>: O Muhammad<sup>saww</sup>! Allah<sup>azwj</sup> Mighty and Majestic Sent me to pair up ‘أَنْ أُزَوِّجَ النُّورَ مِنَ النُّورِ’ the Light with the Light. He<sup>saww</sup> said: ‘Who with who?’ He said: (Syeda) ‘Fatima<sup>asws</sup> to Ali<sup>asws</sup>’. ",
            "He<sup>asws</sup> said: ‘So when the Angel turned around, where was (written) between his shoulders: ‘Muhammad<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup> and Ali<sup>asws</sup> is his<sup>saww</sup> successor<sup>asws</sup>’. So Rasool-Allah<sup>saww</sup> said: ‘Since how many (years) has this been written between your shoulders?’ So he said: ‘From before Allah<sup>azwj</sup> Created Adam<sup>as</sup> by twenty two thousand years’."
          ],
          "en.sarwar": [
            " 7. Through the same chain of narrators it is narrated from Salih ibn ‘Aqaba from ‘Amr ibn Shimr from Jabir from abu Ja‘far (a.s.) who has said the following. “Once the Holy Prophet (s.a) said to Fatima, “Rise and bring that tray.” She went and took out the tray with fresh bread and steaming meat on it. The Holy Prophet (s.a), Ali, Fatima, al-Hassan and al-Husayn (a.s.) continued to have their meals from it for thirteen days. Then ’Umm Ayman saw al-Husayn with certain things with him. She asked, “Where from did you get it?” He replied, “We are having this for our meal for the past thirteen days.” ’Umm Ayman came to Fatima and said, “O Fatima, “If ’Umm Ayman would have anything it is all for Fatima and her sons but if Fatima would have anything then there is nothing in it for ’Umm Ayman. She (Fatima) then took out from the tray food for her and ’Umm Ayman ate but the food from the tray banished. The Holy Prophet (s.a) said, “Had you not fed her (a non-infallible) from it you and your descendants would have had food from it up to the Day of Judgment.” Abu Ja‘far (a.s.) then said, “The tray is with us and our Al-Qa’im (the one who will rise with Divine Authority) will take it out at his time.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/347)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1246,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/109",
              "text": "غَيْرُهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/239",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ وَ غَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:114:9",
        "text": [
          " سَأَلْتُ الرِّضَا ( عليه السلام ) عَنْ قَبْرِ فَاطِمَةَ ( عليها السلام ) فَقَالَ دُفِنَتْ فِي بَيْتِهَا فَلَمَّا زَادَتْ بَنُو أُمَيَّةَ فِي الْمَسْجِدِ صَارَتْ فِي الْمَسْجِدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and somone else, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I asked Al-Reza<sup>asws</sup> about the grave of (Syeda) Fatima<sup>asws</sup>’. So he<sup>asws</sup> said: ‘She<sup>asws</sup> is buried in her<sup>asws</sup> house. So when the Clan of Umayya increased in the (boundaries) of the Masjid, she<sup>asws</sup> came to be in the Masjid’."
          ],
          "en.sarwar": [
            " 8. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad ibn Ali from Ali ibn Ja‘far who has said the following. “I heard abu al-Hassan (a.s.) say, ‘Once when the Messenger of Allah was sitting an angel who had twenty four faces came to him. The Messenger of Allah said to him, “My friend Jibril, I had not seen you in this form before.” The angel said, “ Iam not Jibril, O Muhammad. Allah, the Most Majestic, the Most gracious, has sent me to join in marriage the light with the light.” He then asked, “Who with who?” The angel said, “Fatima and Ali (a.s.).” The Imam (a.s.) said, “When the angel turned back on his shoulder it said, “Muhammad the Messenger of Allah, and Ali (a.s.) the executor of his will.” The Messenger of Allah asked, “Since when this has been written on your shoulder?” The angel replied, “It was there twenty two thousand year before Allah created Adam.”"
          ]
        }
      },
      {
        "index": 1247,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/63",
              "text": "الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1231",
              "text": "الْخَيْبَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1058",
              "text": "يُونُسَ بْنِ ظَبْيَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنِ الْخَيْبَرِيِّ عَنْ يُونُسَ بْنِ ظَبْيَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:114:10",
        "text": [
          " سَمِعْتُهُ يَقُولُ لَوْ لَا أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى خَلَقَ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) لِفَاطِمَةَ مَا كَانَ لَهَا كُفْوٌ عَلَى ظَهْرِ الْأَرْضِ مِنْ آدَمَ وَ مَنْ دُونَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Washha, from Al Khaybari, from Yunus Bin Zabyan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Had Allah<sup>azwj</sup> Blessed and High not Created Amir Al-Momineen<sup>asws</sup> for (Syeda) Fatima<sup>asws</sup>, there would not have been a match for her<sup>asws</sup> on the surface of the earth, from Adam<sup>as</sup> and the ones after him<sup>as</sup>’ (until the Day of Judgement)."
          ],
          "en.sarwar": [
            " 9. Ali ibn Muhammad and others have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr who has said the following. “I asked al-Rida (a.s.) about the grave of Fatima (a.s.). He said, “She was buried in her own house. When the Amawids enlarged the Mosque it became part of the Mosque.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (349/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": " "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/306",
              "text": "10ـ عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/63",
              "text": "الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1231",
              "text": "الْخَيْبَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1058",
              "text": "يُونُسَ بْنِ ظَبْيَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/455",
              "text": "أَبِي عَبْدِ الله (عَلَيْهِ السَّلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": " 10ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنِ الْخَيْبَرِيِّ عَنْ يُونُسَ بْنِ ظَبْيَانَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ"
        },
        "part_type": "Hadith",
        "text": [
          " سَمِعْتُهُ يَقُولُ لَوْ لا أَنَّ الله تَبَارَكَ وَتَعَالَى خَلَقَ أَمِيرَ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) لِفَاطِمَةَ مَا كَانَ لَهَا كُفْوٌ عَلَى ظَهْرِ الارْضِ مِنْ آدَمَ وَمَنْ دُونَهُ."
        ],
        "translations": {
          "en.sarwar": [
            " 10. A number of our people has narrated from Ahmad ibn Muhammad from al-Washsha’ from al-Khaybari from Yunus ibn Zabyan who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘Had Allah not created Amir al-Mu’minin Ali (a.s.) for Fatima, there would been no match on earth for her from Adam to the end.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:114",
  "kind": "verse_list"
}