{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 114"}, "path": "/books/al-kafi:1:4:114", "titles": {"ar": "باب مَوْلِدِ الزَّهْرَاءِ فَاطِمَةَ ( عليها السلام )", "en": "Chapter 114 – The Nazool (Arrival) of Al-Zahra Fatima<sup>asws</sup>"}}], "index": 172, "local_index": 114, "part_type": "Chapter", "path": "/books/al-kafi:1:4:114", "titles": {"ar": "باب مَوْلِدِ الزَّهْرَاءِ فَاطِمَةَ ( عليها السلام )", "en": "Chapter 114 – The Nazool (Arrival) of Al-Zahra Fatima<sup>asws</sup>"}, "verse_count": 10, "verse_start_index": 1237, "verses": [{"index": 1238, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:114:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ فَاطِمَةَ ( عليها السلام ) مَكَثَتْ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) خَمْسَةً وَ سَبْعِينَ يَوْماً وَ كَانَ دَخَلَهَا حُزْنٌ شَدِيدٌ عَلَى أَبِيهَا وَ كَانَ يَأْتِيهَا جَبْرَئِيلُ ( عليه السلام ) فَيُحْسِنُ عَزَاءَهَا عَلَى أَبِيهَا وَ يُطَيِّبُ نَفْسَهَا وَ يُخْبِرُهَا عَنْ أَبِيهَا وَ مَكَانِهِ وَ يُخْبِرُهَا بِمَا يَكُونُ بَعْدَهَا فِي ذُرِّيَّتِهَا وَ كَانَ عَلِيٌّ ( عليه السلام ) يَكْتُبُ ذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Abu Ubeyda, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘(Syeda) Fatima<sup>asws</sup> remained after Rasool-Allah<sup>saww</sup> for seventy five days, and intense grief entered into her<sup>asws</sup> upon her<sup>asws</sup> father<sup>saww</sup>, and Jibraeel<sup>as</sup> used to come to her<sup>asws</sup> and would excellently console her<sup>asws</sup> upon her<sup>asws</sup> father<sup>saww</sup>, and that would make her<sup>asws</sup> better and he<sup>as</sup> would inform her<sup>asws</sup> about her<sup>asws</sup> father<sup>saww</sup>, and his<sup>saww</sup> place, and he<sup>as</sup> would inform her<sup>asws</sup> with what would be happening after her<sup>asws</sup> among her<sup>asws</sup> children, and Ali<sup>asws</sup> would write that down’."}]}, {"index": 1239, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:114:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ إِنَّ فَاطِمَةَ ( عليها السلام ) صِدِّيقَةٌ شَهِيدَةٌ وَ إِنَّ بَنَاتِ الْأَنْبِيَاءِ لَا يَطْمَثْنَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Al Amraky Bin Ali, \n(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan<sup>asws</sup> having said: ‘(Syeda) Fatima<sup>asws</sup> was truthful, a martyr, and that the daughters of the Prophets<sup>as</sup> do not menstruate’."}]}, {"index": 1240, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:114:3", "text": "أَحْمَدُ بْنُ مِهْرَانَ رَحِمَهُ اللَّهُ رَفَعَهُ وَ أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ الشَّيْبَانِيِّ قَالَ حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ الرَّازِيُّ قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ الْهُرْمُزَانِيُّ عَنْ أَبِي عَبْدِ اللَّهِ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام ) قَالَ لَمَّا قُبِضَتْ فَاطِمَةُ ( عليها السلام ) دَفَنَهَا أَمِيرُ الْمُؤْمِنِينَ سِرّاً وَ عَفَا عَلَى مَوْضِعِ قَبْرِهَا ثُمَّ قَامَ فَحَوَّلَ وَجْهَهُ إِلَى قَبْرِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ عَنِّي وَ السَّلَامُ عَلَيْكَ عَنِ ابْنَتِكَ وَ زَائِرَتِكَ وَ الْبَائِتَةِ فِي الثَّرَى بِبُقْعَتِكَ وَ الْمُخْتَارِ اللَّهُ لَهَا سُرْعَةَ اللِّحَاقِ بِكَ\nقَلَّ يَا رَسُولَ اللَّهِ عَنْ صَفِيَّتِكَ صَبْرِي وَ عَفَا عَنْ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ تَجَلُّدِي إِلَّا أَنَّ لِي فِي التَّأَسِّي بِسُنَّتِكَ فِي فُرْقَتِكَ مَوْضِعَ تَعَزٍّ فَلَقَدْ وَسَّدْتُكَ فِي مَلْحُودَةِ قَبْرِكَ وَ فَاضَتْ نَفْسُكَ بَيْنَ نَحْرِي وَ صَدْرِي بَلَى وَ فِي كِتَابِ اللَّهِ لِي أَنْعَمُ الْقَبُولِ إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ\nقَدِ اسْتُرْجِعَتِ الْوَدِيعَةُ وَ أُخِذَتِ الرَّهِينَةُ وَ أُخْلِسَتِ الزَّهْرَاءُ فَمَا أَقْبَحَ الْخَضْرَاءَ وَ الْغَبْرَاءَ يَا رَسُولَ اللَّهِ أَمَّا حُزْنِي فَسَرْمَدٌ وَ أَمَّا لَيْلِي فَمُسَهَّدٌ وَ هَمٌّ لَا يَبْرَحُ مِنْ قَلْبِي أَوْ يَخْتَارَ اللَّهُ لِي دَارَكَ الَّتِي أَنْتَ فِيهَا مُقِيمٌ\nكَمَدٌ مُقَيِّحٌ وَ هَمٌّ مُهَيِّجٌ سَرْعَانَ مَا فَرَّقَ بَيْنَنَا وَ إِلَى اللَّهِ أَشْكُو وَ سَتُنْبِئُكَ ابْنَتُكَ بِتَظَافُرِ أُمَّتِكَ عَلَى هَضْمِهَا فَأَحْفِهَا السُّؤَالَ وَ اسْتَخْبِرْهَا الْحَالَ فَكَمْ مِنْ غَلِيلٍ مُعْتَلِجٍ بِصَدْرِهَا لَمْ تَجِدْ إِلَى بَثِّهِ سَبِيلًا وَ سَتَقُولُ وَ يَحْكُمُ اللَّهُ وَ هُوَ خَيْرُ الْحَاكِمِينَ\nسَلَامَ مُوَدِّعٍ لَا قَالٍ وَ لَا سَئِمٍ فَإِنْ أَنْصَرِفْ فَلَا عَنْ مَلَالَةٍ وَ إِنْ أُقِمْ فَلَا عَنْ سُوءِ ظَنٍّ بِمَا وَعَدَ اللَّهُ الصَّابِرِينَ وَاهَ وَاهاً وَ الصَّبْرُ أَيْمَنُ وَ أَجْمَلُ وَ لَوْ لَا غَلَبَةُ الْمُسْتَوْلِينَ لَجَعَلْتُ الْمُقَامَ وَ اللَّبْثَ لِزَاماً مَعْكُوفاً وَ لَأَعْوَلْتُ إِعْوَالَ الثَّكْلَى عَلَى جَلِيلِ الرَّزِيَّةِ \nفَبِعَيْنِ اللَّهِ تُدْفَنُ ابْنَتُكَ سِرّاً وَ تُهْضَمُ حَقَّهَا وَ تُمْنَعُ إِرْثَهَا وَ لَمْ يَتَبَاعَدِ الْعَهْدُ وَ لَمْ يَخْلَقْ مِنْكَ الذِّكْرُ وَ إِلَى اللَّهِ يَا رَسُولَ اللَّهِ الْمُشْتَكَى وَ فِيكَ يَا رَسُولَ اللَّهِ أَحْسَنُ الْعَزَاءِ صَلَّى اللَّهُ عَلَيْكَ وَ عَلَيْهَا السَّلَامُ وَ الرِّضْوَانُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Mihran, raising it, and Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar Al Shaybani who said, ‘Al Qasim Bin Muhammad Al Razy narrated to me saying, ‘Ali Bin Muhammad Al Hurmuzani narrated to us, \n(It has been narrated) from Abu Abdullah Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> having said: ‘When (Syeda) Fatima<sup>asws</sup> passed away, Amir Al-Momineen<sup>asws</sup> buried her<sup>asws</sup> secretly, and effaced upon the place of her<sup>asws</sup> grave. Then he<sup>asws</sup> stood and turned his<sup>asws</sup> face towards the grave of Rasool-Allah<sup>saww</sup> and he<sup>asws</sup> said: ‘The greetings be upon you<sup>saww</sup>, O Rasool-Allah<sup>saww</sup> from me<sup>asws</sup> and the greetings be upon you<sup>saww</sup> from your<sup>saww</sup> daughter<sup>asws</sup>, and she<sup>asws</sup> would be visiting you<sup>saww</sup> and spending the night in the soil in your<sup>saww</sup> spot, and Allah<sup>azwj</sup> Chose for her<sup>asws</sup> a quick meeting with you<sup>saww</sup>.\nLittle is my<sup>asws</sup> patience from losing you<sup>saww</sup> and excuse my<sup>asws</sup> tolerance from (losing) the chief-tess of the women of the worlds, except that for me<sup>asws</sup> is the solace with your<sup>saww</sup> Sunnah during your<sup>saww</sup> separation in place of condolence. So I<sup>asws</sup> had placed your<sup>saww</sup> pillow in the chasm of your<sup>saww</sup> grave, and your<sup>saww</sup> soul left between my<sup>asws</sup> throat and my<sup>asws</sup> chest. Yes, and in the Book of Allah<sup>azwj</sup>, there is for me<sup>asws</sup> the best of the acceptances <span class=\"ibTxt\">[2:156] Surely we are for Allah and to Him we are returning</span>. \nI<sup>asws</sup> have returned the deposit and taken the pledge, and the blossom (Al-Zahra<sup>asws</sup>) is no more. So how ugly is the greenery and the dust, O Rasool-Allah<sup>saww</sup>! As for my<sup>asws</sup> grief, so it is perpetual, and as for my<sup>asws</sup> night, so it is sleepless, and the worries do not come out from my<sup>asws</sup> heart, unless Allah<sup>azwj</sup> Chooses for me<sup>asws</sup> your<sup>saww</sup> dwelling which you<sup>saww</sup> are staying in. \nI<sup>asws</sup> am heartsicken, sorrowful, anxious, upset. How quick was the separation between us<sup>asws</sup>. And to Allah<sup>azwj</sup> I<sup>asws</sup> complain, and your<sup>saww</sup> daughter<sup>asws</sup> will be informing you<sup>saww</sup> of the concerted efforts of your<sup>saww</sup> community upon devouring her<sup>asws</sup>. So as her<sup>asws</sup>, you<sup>saww</sup> will come to know of the state. So how many were her<sup>asws</sup> sorrows grabbing her<sup>asws</sup> chest, she<sup>asws</sup> could not find a way to expressing them, and she<sup>asws</sup> was saying: ‘And Allah<sup>azwj</sup> will Judge, and He<sup>azwj</sup> is the best of the judges’. \nGreetings of farewell is not what I<sup>asws</sup> say, nor out of weariness. So, if I<sup>asws</sup> leave, it would not be from disappointment, and if I<sup>asws</sup> stay it would not be from pessimism with what Allah<sup>azwj</sup> Promised the patient ones. Alas! And the patience is more fruitful and more beautiful, and were it not for the pre-dominance of the mischievous ones, I<sup>asws</sup> would have made the place and the remaining (here) to be unambiguous and wailed the wailing of the bereaved mother upon the calamity of the child.\nSo in the Sight of Allah<sup>azwj</sup>, your<sup>saww</sup> daughter is buried secretly, and her<sup>asws</sup> rights have been devoured, and her<sup>asws</sup> inheritance prevented, and the covenant is not distance and your<sup>saww</sup> memories are still fresh; and to Allah<sup>azwj</sup>, O Rasool-Allah<sup>saww</sup>, is the complaint, and regarding you<sup>saww</sup>, O Rasool-Allah<sup>saww</sup> is the best of the condolences. May Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawat</span> upon you<sup>saww</sup> and upon her<sup>asws</sup>, the peace and the (Divine) Pleasure’."}]}, {"index": 1241, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:114:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَالِمٍ عَنِ الْمُفَضَّلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَنْ غَسَلَ فَاطِمَةَ قَالَ ذَاكَ أَمِيرُ الْمُؤْمِنِينَ وَ كَأَنِّي اسْتَعْظَمْتُ ذَلِكَ مِنْ قَوْلِهِ فَقَالَ كَأَنَّكَ ضِقْتَ بِمَا أَخْبَرْتُكَ بِهِ قَالَ فَقُلْتُ قَدْ كَانَ ذَاكَ جُعِلْتُ فِدَاكَ قَالَ فَقَالَ لَا تَضِيقَنَّ فَإِنَّهَا صِدِّيقَةٌ وَ لَمْ يَكُنْ يَغْسِلُهَا إِلَّا صِدِّيقٌ أَ مَا عَلِمْتَ أَنَّ مَرْيَمَ لَمْ يَغْسِلْهَا إِلَّا عِيسَى .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr, from Abdul Rahman Bin Salim, from Al Mufazzal, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, (the narrator says) ’I said to Abu Abdullah<sup>asws</sup>, ‘Who Washed (Syeda) Fatima<sup>asws</sup> (for funeral)?’ He<sup>asws</sup> said: ‘That was Amir Al-Momineen<sup>asws</sup>’, and it was as if I took that as grievous from his<sup>asws</sup> words. So he<sup>asws</sup> said: ‘It is as if you<sup>asws</sup> are constricted with what I<sup>asws</sup> informed you with’. So I said, ‘It has been that, may I be sacrificed for you<sup>asws</sup>!’ So he<sup>asws</sup> said: ‘Do not be constricted, for she<sup>asws</sup> is a Truthful and none could have happened to have washed her<sup>asws</sup> except for a Truthful. Do you not know that Maryam<sup>as</sup>, no one washed her<sup>as</sup> (for funeral) except for Isa<sup>as</sup>?’."}]}, {"index": 1242, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:114:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْجُعْفِيِّ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَا إِنَّ فَاطِمَةَ ( عليها السلام ) لَمَّا أَنْ كَانَ مِنْ أَمْرِهِمْ مَا كَانَ أَخَذَتْ بِتَلَابِيبِ عُمَرَ فَجَذَبَتْهُ إِلَيْهَا ثُمَّ قَالَتْ أَمَا وَ اللَّهِ يَا ابْنَ الْخَطَّابِ لَوْ لَا أَنِّي أَكْرَهُ أَنْ يُصِيبَ الْبَلَاءُ مَنْ لَا ذَنْبَ لَهُ لَعَلِمْتَ أَنِّي سَأُقْسِمُ عَلَى اللَّهِ ثُمَّ أَجِدُهُ سَرِيعَ الْإِجَابَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Salih Bin Uqba, from Abdullah Bin Muhammad Al Ju’fy, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having said: ‘(Syeda) Fatima<sup>asws</sup>, when it was from their affair what was (Abu Bakr and Umar’s burning down her<sup>asws</sup> door etc.), she<sup>asws</sup> grabbed the collar of Umar and pulled him, then she<sup>asws</sup> said: ‘But, by Allah<sup>azwj</sup>, O son of Khattab! Had it not been for my<sup>asws</sup> dislike of the affliction hitting the ones who has not sin for him, you would have known that I<sup>asws</sup> would have sworn upon Allah<sup>azwj</sup> (for a curse to befall), then a quick Response would have been found’."}]}, {"index": 1243, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:114:6", "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ يَزِيدَ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا وُلِدَتْ فَاطِمَةُ ( عليها السلام ) أَوْحَى اللَّهُ إِلَى مَلَكٍ فَأَنْطَقَ بِهِ لِسَانَ مُحَمَّدٍ ( صلى الله عليه وآله ) فَسَمَّاهَا فَاطِمَةَ ثُمَّ قَالَ إِنِّي فَطَمْتُكِ بِالْعِلْمِ وَ فَطَمْتُكِ مِنَ الطَّمْثِ \nثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ اللَّهِ لَقَدْ فَطَمَهَا اللَّهُ بِالْعِلْمِ وَ عَنِ الطَّمْثِ فِي الْمِيثَاقِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by this chain, from Salih Bin Uqba, from Yazeed Bin Abdul Malik, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When (Rasool-Allah) was Blessed with (Syeda) Fatima<sup>asws</sup>, Allah<sup>azwj</sup> Revealed to an Angel, so he spoke with in the tongue (tone) of Muhammad<sup>saww</sup>: ‘So name her<sup>asws</sup> as ‘فَاطِمَةَ’ Fatima<sup>asws</sup>’. Then said: ‘I<sup>azwj</sup> have Liberated the knowledge for you<sup>asws</sup> and Freed you<sup>asws</sup> from any impurity’. \nThen Abu Ja’far<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> had Liberated the knowledge for her<sup>asws</sup> and Freed you<sup>asws</sup> from any impurity’."}]}, {"index": 1244, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:114:7", "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) لِفَاطِمَةَ ( عليها السلام ) يَا فَاطِمَةُ قُومِي فَأَخْرِجِي تِلْكَ الصَّحْفَةَ فَقَامَتْ فَأَخْرَجَتْ صَحْفَةً فِيهَا ثَرِيدٌ وَ عُرَاقٌ يَفُورُ فَأَكَلَ النَّبِيُّ ( صلى الله عليه وآله ) وَ عَلِيٌّ وَ فَاطِمَةُ وَ الْحَسَنُ وَ الْحُسَيْنُ ثَلَاثَةَ عَشَرَ يَوْماً \nثُمَّ إِنَّ أُمَّ أَيْمَنَ رَأَتِ الْحُسَيْنَ مَعَهُ شَيْ‏ءٌ فَقَالَتْ لَهُ مِنْ أَيْنَ لَكَ هَذَا قَالَ إِنَّا لَنَأْكُلُهُ مُنْذُ أَيَّامٍ فَأَتَتْ أُمُّ أَيْمَنَ فَاطِمَةَ فَقَالَتْ يَا فَاطِمَةُ إِذَا كَانَ عِنْدَ أُمِّ أَيْمَنَ شَيْ‏ءٌ فَإِنَّمَا هُوَ لِفَاطِمَةَ وَ وُلْدِهَا وَ إِذَا كَانَ عِنْدَ فَاطِمَةَ شَيْ‏ءٌ فَلَيْسَ لِأُمِّ أَيْمَنَ مِنْهُ شَيْ‏ءٌ \nفَأَخْرَجَتْ لَهَا مِنْهُ فَأَكَلَتْ مِنْهُ أُمُّ أَيْمَنَ وَ نَفِدَتِ الصَّحْفَةُ فَقَالَ لَهَا النَّبِيُّ ( صلى الله عليه وآله ) أَمَا لَوْ لَا أَنَّكِ أَطْعَمْتِهَا لَأَكَلْتِ مِنْهَا أَنْتِ وَ ذُرِّيَّتُكِ إِلَى أَنْ تَقُومَ السَّاعَةُ \nثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ الصَّحْفَةُ عِنْدَنَا يَخْرُجُ بِهَا قَائِمُنَا ( عليه السلام ) فِي زَمَانِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by this chain, from Salih Bin Uqba, from Amro Bin Shimr, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said to (Syeda) Fatima<sup>asws</sup>: ‘O Fatima<sup>asws</sup>! Arise and bring out that tray to me<sup>saww</sup>’. So she<sup>asws</sup> arose and brought out a tray which contained porridge and some steamed meat. So the Prophet<sup>saww</sup>, and Ali<sup>asws</sup>, and (Syed) Fatima<sup>asws</sup>, and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup> ate (from it) for thirteen days.\nThen Umm Ayman<sup>as</sup> saw Al-Husayn<sup>asws</sup> having something with him<sup>asws</sup>, so she<sup>as</sup> said to him<sup>asws</sup>: ‘From where did this come for you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘We<sup>asws</sup> have been eating it for days’. So Umm Ayman<sup>as</sup> came over to (Syeda) Fatima<sup>asws</sup> and she<sup>as</sup> said: ‘O Fatima<sup>asws</sup>! Whenever there is something for Umm Ayman<sup>as</sup>, so rather it would be for (Syeda) Fatima<sup>asws</sup> and her<sup>asws</sup> children, and when there was something with (Syeda) Fatima<sup>asws</sup>, so there isn’t anything from it for Umm Ayman<sup>as</sup>?’ \nSo she<sup>asws</sup> brought out for her<sup>as</sup>, from it, and Umm Ayman<sup>as</sup> ate from it and the tray ran out. So the Prophet<sup>saww</sup> said to her<sup>asws</sup>: ‘But, had you<sup>asws</sup> not fed her<sup>as</sup>, there would have eaten from it, yourself<sup>asws</sup> and your<sup>asws</sup> offspring, until the Establishment of the Hour’. \nThen Abu Ja’far<sup>asws</sup> said: ‘And the tray is with us<sup>asws</sup>. Our<sup>asws</sup> Qaim<sup>asws</sup> would come out with it during his<sup>asws</sup> era’."}]}, {"index": 1245, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:114:8", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ بَيْنَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) جَالِسٌ إِذْ دَخَلَ عَلَيْهِ مَلَكٌ لَهُ أَرْبَعَةٌ وَ عِشْرُونَ وَجْهاً فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَبِيبِي جَبْرَئِيلُ لَمْ أَرَكَ فِي مِثْلِ هَذِهِ الصُّورَةِ قَالَ الْمَلَكُ لَسْتُ بِجَبْرَئِيلَ يَا مُحَمَّدُ بَعَثَنِي اللَّهُ عَزَّ وَ جَلَّ أَنْ أُزَوِّجَ النُّورَ مِنَ النُّورِ قَالَ مَنْ مِمَّنْ قَالَ فَاطِمَةَ مِنْ عَلِيٍّ \nقَالَ فَلَمَّا وَلَّى الْمَلَكُ إِذَا بَيْنَ كَتِفَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ عَلِيٌّ وَصِيُّهُ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مُنْذُ كَمْ كُتِبَ هَذَا بَيْنَ كَتِفَيْكَ فَقَالَ مِنْ قَبْلِ أَنْ يَخْلُقَ اللَّهُ آدَمَ بِاثْنَيْنِ وَ عِشْرِينَ أَلْفَ عَامٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Ali, \n(It has been narrated) from Ali son of Ja’far<sup>asws</sup> having said: ‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘While Rasool-Allah<sup>saww</sup> was seated, an Angel came over who had twenty four faces for him So he said to Rasool-Allah<sup>saw</sup>: O Muhammad<sup>saww</sup>! Allah<sup>azwj</sup> Mighty and Majestic Sent me to pair up ‘أَنْ أُزَوِّجَ النُّورَ مِنَ النُّورِ’ the Light with the Light. He<sup>saww</sup> said: ‘Who with who?’ He said: (Syeda) ‘Fatima<sup>asws</sup> to Ali<sup>asws</sup>’. \nHe<sup>asws</sup> said: ‘So when the Angel turned around, where was (written) between his shoulders: ‘Muhammad<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup> and Ali<sup>asws</sup> is his<sup>saww</sup> successor<sup>asws</sup>’. So Rasool-Allah<sup>saww</sup> said: ‘Since how many (years) has this been written between your shoulders?’ So he said: ‘From before Allah<sup>azwj</sup> Created Adam<sup>as</sup> by twenty two thousand years’."}]}, {"index": 1246, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:1:4:114:9", "text": "عَلِيُّ بْنُ مُحَمَّدٍ وَ غَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ الرِّضَا ( عليه السلام ) عَنْ قَبْرِ فَاطِمَةَ ( عليها السلام ) فَقَالَ دُفِنَتْ فِي بَيْتِهَا فَلَمَّا زَادَتْ بَنُو أُمَيَّةَ فِي الْمَسْجِدِ صَارَتْ فِي الْمَسْجِدِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad and somone else, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr who said, \n‘I asked Al-Reza<sup>asws</sup> about the grave of (Syeda) Fatima<sup>asws</sup>’. So he<sup>asws</sup> said: ‘She<sup>asws</sup> is buried in her<sup>asws</sup> house. So when the Clan of Umayya increased in the (boundaries) of the Masjid, she<sup>asws</sup> came to be in the Masjid’."}]}, {"index": 1247, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:1:4:114:10", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنِ الْخَيْبَرِيِّ عَنْ يُونُسَ بْنِ ظَبْيَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ لَوْ لَا أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى خَلَقَ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) لِفَاطِمَةَ مَا كَانَ لَهَا كُفْوٌ عَلَى ظَهْرِ الْأَرْضِ مِنْ آدَمَ وَ مَنْ دُونَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Washha, from Al Khaybari, from Yunus Bin Zabyan, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Had Allah<sup>azwj</sup> Blessed and High not Created Amir Al-Momineen<sup>asws</sup> for (Syeda) Fatima<sup>asws</sup>, there would not have been a match for her<sup>asws</sup> on the surface of the earth, from Adam<sup>as</sup> and the ones after him<sup>as</sup>’ (until the Day of Judgement)."}]}]}, "index": "al-kafi:1:4:114", "kind": "verse_list"}