{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 115"}, "path": "/books/al-kafi:1:4:115", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَوْلِدِ الْحَسَنِ</span> بْنِ عَلِيٍّ صَلَوَاتُ اللَّهِ عَلَيْهِمَا", "en": "Chapter 115 – The Nazool (Arrival) of Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>, may the Salawat of Allah<sup>azwj</sup> be upon them<sup>asws</sup>"}}], "index": 173, "local_index": 115, "part_type": "Chapter", "path": "/books/al-kafi:1:4:115", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَوْلِدِ الْحَسَنِ</span> بْنِ عَلِيٍّ صَلَوَاتُ اللَّهِ عَلَيْهِمَا", "en": "Chapter 115 – The Nazool (Arrival) of Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>, may the Salawat of Allah<sup>azwj</sup> be upon them<sup>asws</sup>"}, "verse_count": 6, "verse_start_index": 1247, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 1248, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:115:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنِ الْحُسَيْنِ بْنِ إِسْحَاقَ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَمَّنْ سَمِعَ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ لَمَّا حَضَرَتِ الْحَسَنَ ( عليه السلام ) الْوَفَاةُ بَكَى فَقِيلَ لَهُ يَا ابْنَ رَسُولِ اللَّهِ تَبْكِي وَ مَكَانُكَ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الَّذِي أَنْتَ بِهِ وَ قَدْ قَالَ فِيكَ مَا قَالَ وَ قَدْ حَجَجْتَ عِشْرِينَ حَجَّةً مَاشِياً وَ قَدْ قَاسَمْتَ مَالَكَ ثَلَاثَ مَرَّاتٍ حَتَّى النَّعْلَ بِالنَّعْلِ فَقَالَ إِنَّمَا أَبْكِي لِخَصْلَتَيْنِ لِهَوْلِ الْمُطَّلَعِ وَ فِرَاقِ الْأَحِبَّةِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Al Husayn Bin Is’haq, from Ali Bin Mahziyar, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Abdullah Bin Sinan, ", "(It has been narrated) from the one who heard Abu Ja’far<sup>asws</sup> saying: ‘When the death presented itself to Al-Hassan<sup>asws</sup>, he<sup>asws</sup> wept. So it was said to him<sup>asws</sup>, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! You<sup>asws</sup> are weeping and your<sup>asws</sup> status from Rasool-Allah<sup>saww</sup> which you<sup>asws</sup> are with, and he<sup>saww</sup> has said regarding you<sup>asws</sup> what he<sup>saww</sup> said, and you<sup>asws</sup> have performed Hajj twenty Pilgrimages walking, and you<sup>asws</sup> have distributed your<sup>asws</sup> wealth three times, step by step’. So he<sup>asws</sup> said: ‘But rather, I<sup>asws</sup> weep for two reasons – for the fear of Hereafter (for my<sup>asws</sup> Shias) and the separation from the loved ones’."]}}, {"index": 1249, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:115:2", "text": ["سَعْدُ بْنُ عَبْدِ اللَّهِ وَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحَسَنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُبِضَ الْحَسَنُ بْنُ عَلِيٍّ ( عليه السلام ) وَ هُوَ ابْنُ سَبْعٍ وَ أَرْبَعِينَ سَنَةً فِي عَامِ خَمْسِينَ عَاشَ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَرْبَعِينَ سَنَةً ."], "translations": {"en.hubeali": ["Sa’d Bin Abdullah and Abdullah Bin Ja’far, from Ibrahim Bin Mahziyar, from his brother Ali Bin Mahziyar, from Al Hassan Bin Saeed, from Muhammad Bin Sinan, from Ibn Muskan, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> passed away and he<sup>asws</sup> was forty-seven years old, in the year fifty. He<sup>asws</sup> lived after Rasool-Allah<sup>saww</sup> for forty years’."]}}, {"index": 1250, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:115:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ إِنَّ جَعْدَةَ بِنْتَ أَشْعَثَ بْنِ قَيْسٍ الْكِنْدِيِّ سَمَّتِ الْحَسَنَ بْنَ عَلِيٍّ وَ سَمَّتْ مَوْلَاةً لَهُ فَأَمَّا مَوْلَاتُهُ فَقَاءَتِ السَّمَّ وَ أَمَّا الْحَسَنُ فَاسْتَمْسَكَ فِي بَطْنِهِ ثُمَّ انْتَفَطَ بِهِ فَمَاتَ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Numan, from Sayf Bin Ameyra, from Abu Bakr Al Hazramy who said, ", "‘Jo’da Bin Ash’as Bin Qays Al-Kindy poisoned Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> and poisoned a female slave of his<sup>asws</sup>. So, as for the female slave, she vomited the poison, and as for Al-Hassan<sup>asws</sup>, so it stayed in his<sup>asws</sup> stomach, which caused swelling that killed him<sup>asws</sup>’."]}}, {"index": 1251, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:115:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنِ الْقَاسِمِ النَّهْدِيِّ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنِ الْكُنَاسِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ خَرَجَ الْحَسَنُ بْنُ عَلِيٍّ ( عليه السلام ) فِي بَعْضِ عُمَرِهِ وَ مَعَهُ رَجُلٌ مِنْ وُلْدِ الزُّبَيْرِ كَانَ يَقُولُ بِإِمَامَتِهِ فَنَزَلُوا فِي مَنْهَلٍ مِنْ تِلْكَ الْمَنَاهِلِ تَحْتَ نَخْلٍ يَابِسٍ قَدْ يَبِسَ مِنَ الْعَطَشِ ", "فَفُرِشَ لِلْحَسَنِ ( عليه السلام ) تَحْتَ نَخْلَةٍ وَ فُرِشَ لِلزُّبَيْرِيِّ بِحِذَاهُ تَحْتَ نَخْلَةٍ أُخْرَى قَالَ فَقَالَ الزُّبَيْرِيُّ وَ رَفَعَ رَأْسَهُ لَوْ كَانَ فِي هَذَا النَّخْلِ رُطَبٌ لَأَكَلْنَا مِنْهُ فَقَالَ لَهُ الْحَسَنُ وَ إِنَّكَ لَتَشْتَهِي الرُّطَبَ فَقَالَ الزُّبَيْرِيُّ نَعَمْ ", "قَالَ فَرَفَعَ يَدَهُ إِلَى السَّمَاءِ فَدَعَا بِكَلَامٍ لَمْ أَفْهَمْهُ فَاخْضَرَّتِ النَّخْلَةُ ثُمَّ صَارَتْ إِلَى حَالِهَا فَأَوْرَقَتْ وَ حَمَلَتْ رُطَباً فَقَالَ الْجَمَّالُ الَّذِي اكْتَرَوْا مِنْهُ سِحْرٌ وَ اللَّهِ قَالَ فَقَالَ الْحَسَنُ ( عليه السلام ) وَيْلَكَ لَيْسَ بِسِحْرٍ وَ لَكِنْ دَعْوَةُ ابْنِ نَبِيٍّ مُسْتَجَابَةٌ قَالَ فَصَعِدُوا إِلَى النَّخْلَةِ فَصَرَمُوا مَا كَانَ فِيهِ فَكَفَاهُمْ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya and Ahmad Bin Muhammad, from Muhammad Bin Al Hassan, from al Qasim Al Nahdy, from Ismail Bin Mihran, from Al Kunasy, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: Once ‘Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> went outside (the town) with him<sup>asws</sup> was a man from the sons of Al-Zubeyr who was saying (believing) in his<sup>asws</sup> Imamate. So they encamped in an oasis from those oasis beneath a dry palm tree which had dried from the drought. ", "So it was furnished (carpeted) for Al-Hassan<sup>asws</sup> beneath the palm tree, and its was furnished for Al-Zubeyri by the side beneath another palm tree. So Al-Zubeyri said, and raised his head, ‘If only there were dates in this palm tree, we could have eaten from it’. So Al-Hassan<sup>asws</sup> said to him: ‘And you are desiring the dates?’ So Al-Zubeyri said, ‘Yes’. ", "He (Abu Abdullah<sup>asws</sup> said): ‘So he<sup>asws</sup> raised his<sup>asws</sup> hands towards the sky and supplicated with a speech which he did not understand, and the palm tree turned green. Then it came to be to its state whereby it sprouted leaves and bore fruit. So the cameleer whom they had hired camels from, said, ‘Sorcery, by Allah<sup>azwj</sup>!’ So Al-Hassan<sup>asws</sup> said: ‘Woe be unto you! It isn’t sorcery. But, a supplication of the son<sup>asws</sup> of a Prophet<sup>azwj</sup> that is Answered’. So, they climbed up the palm tree and they picked whatever was in it, and it sufficed them’."]}}, {"index": 1252, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:115:5", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْحَسَنَ ( عليه السلام ) قَالَ إِنَّ لِلَّهِ مَدِينَتَيْنِ إِحْدَاهُمَا بِالْمَشْرِقِ وَ الْأُخْرَى بِالْمَغْرِبِ عَلَيْهِمَا سُورٌ مِنْ حَدِيدٍ وَ عَلَى كُلِّ وَاحِدٍ مِنْهُمَا أَلْفُ أَلْفِ مِصْرَاعٍ وَ فِيهَا سَبْعُونَ أَلْفَ أَلْفِ لُغَةٍ يَتَكَلَّمُ كُلُّ لُغَةٍ بِخِلَافِ لُغَةِ صَاحِبِهَا وَ أَنَا أَعْرِفُ جَمِيعَ اللُّغَاتِ وَ مَا فِيهِمَا وَ مَا بَيْنَهُمَا وَ مَا عَلَيْهِمَا حُجَّةٌ غَيْرِي وَ غَيْرُ الْحُسَيْنِ أَخِي ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad and Muhammad Bin yahya, from Muhammad Bin Al Hassan, from Yaqoub Bin Yazeed, from Ibn Abu Umeyr, from his men, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Al-Hassan<sup>asws</sup> said: 'For Allah<sup>azwj</sup> there are two cities, one of them in the east and the other one in the west. Upon those there are walls of iron, and upon each one of these there are a thousand (upon) thousand (million) shutters, and therein seventy thousand (upon) thousand (million) languages are spoken, every language being different from its counterpart, and I<sup>asws</sup> understand the entirety of the languages, and whatever there is in them, and what is between them, and there is no Divine Authority upon these two apart from me<sup>asws</sup> and Al-Husayn<sup>asws</sup> my<sup>asws</sup> brother<sup>asws</sup>’."]}}, {"index": 1253, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:115:6", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ النُّعْمَانِ عَنْ صَنْدَلٍ عَنْ أَبِي أُسَامَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ خَرَجَ الْحَسَنُ بْنُ عَلِيٍّ ( عليه السلام ) إِلَى مَكَّةَ سَنَةً مَاشِياً فَوَرِمَتْ قَدَمَاهُ فَقَالَ لَهُ بَعْضُ مَوَالِيهِ لَوْ رَكِبْتَ لَسَكَنَ عَنْكَ هَذَا الْوَرَمُ فَقَالَ كَلَّا إِذَا أَتَيْنَا هَذَا الْمَنْزِلَ فَإِنَّهُ يَسْتَقْبِلُكَ أَسْوَدُ وَ مَعَهُ دُهْنٌ فَاشْتَرِ مِنْهُ وَ لَا تُمَاكِسْهُ فَقَالَ لَهُ مَوْلَاهُ بِأَبِي أَنْتَ وَ أُمِّي مَا قَدِمْنَا مَنْزِلًا فِيهِ أَحَدٌ يَبِيعُ هَذَا الدَّوَاءَ فَقَالَ لَهُ بَلَى إِنَّهُ أَمَامَكَ دُونَ الْمَنْزِلِ ", "فَسَارَا مِيلًا فَإِذَا هُوَ بِالْأَسْوَدِ فَقَالَ الْحَسَنُ ( عليه السلام ) لِمَوْلَاهُ دُونَكَ الرَّجُلَ فَخُذْ مِنْهُ الدُّهْنَ وَ أَعْطِهِ الثَّمَنَ فَقَالَ الْأَسْوَدُ يَا غُلَامُ لِمَنْ أَرَدْتَ هَذَا الدُّهْنَ فَقَالَ لِلْحَسَنِ بْنِ عَلِيٍّ فَقَالَ انْطَلِقْ بِي إِلَيْهِ فَانْطَلَقَ فَأَدْخَلَهُ إِلَيْهِ فَقَالَ لَهُ بِأَبِي أَنْتَ وَ أُمِّي لَمْ أَعْلَمْ أَنَّكَ تَحْتَاجُ إِلَى هَذَا أَ وَ تَرَى ذَلِكَ وَ لَسْتُ آخُذُ لَهُ ثَمَناً إِنَّمَا أَنَا مَوْلَاكَ وَ لَكِنِ ادْعُ اللَّهَ أَنْ يَرْزُقَنِي ذَكَراً سَوِيّاً يُحِبُّكُمْ أَهْلَ الْبَيْتِ فَإِنِّي خَلَّفْتُ أَهْلِي تَمْخَضُ فَقَالَ انْطَلِقْ إِلَى مَنْزِلِكَ فَقَدْ وَهَبَ اللَّهُ لَكَ ذَكَراً سَوِيّاً وَ هُوَ مِنْ شِيعَتِنَا ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad, from Muhammad Bin Ali Bin Al Nu’man, from Sandal, from Abu Asama, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> went out to Makkah one year, walking. So his<sup>asws</sup> feet swelled up. So some of his<sup>asws</sup> slave said to him<sup>asws</sup>, ‘If only you<sup>asws</sup> were to ride, this would settle from you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘Never! When we come to this encampment, so a black man would welcome you and with him would be some oil. So buy it from him and do not haggle (for its price)’. So his<sup>asws</sup> slave said to him<sup>asws</sup>, ‘May my father and my mother be (sacrificed) for you<sup>asws</sup>! There is no such encampment in front of us wherein there would be anyone selling this medicine’. So he<sup>asws</sup> said to him: ‘Yes, it is in front of you beside the encampment’. ", "So they travelled for a mile, and there was a black man. So Al-Hassan<sup>asws</sup> said to his<sup>asws</sup> slave: ‘Below you is the man, so take the oil from him and give him the price’. So the black man said, ‘O slave! For whom are you intending this oil?’ So he said, ‘For Al-Hasan<sup>asws</sup> Bin Ali<sup>asws</sup>’. So he said, ‘Come with me to him<sup>asws</sup>’. So he came over to him<sup>asws</sup> and said to him<sup>asws</sup>, ‘By my father and my mother being (sacrificed) for you<sup>asws</sup>! I did not know you<sup>asws</sup> were needy to this. Had I known that, I would not have taken a price for it. But rather, I am your<sup>asws</sup> slave. But, supplicate to Allah<sup>azwj</sup> that He<sup>azwj</sup> should Grace me a male child, healthy, who would be loving you<sup>asws</sup>, the People<sup>asws</sup> of the Household, for I left behind my wife, expecting’. So he<sup>asws</sup> said: ‘Go to your house, so Allah<sup>azwj</sup> has Endowed a healthy male child to you, and he is from our<sup>asws</sup> Shias’."]}}]}, "index": "al-kafi:1:4:115", "kind": "verse_list"}