{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 116"
        },
        "path": "/books/al-kafi:1:4:116",
        "titles": {
          "ar": "باب مَوْلِدِ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام )",
          "en": "Chapter 116 – Nazool (Arrival) of Al-Husayn Bin Ali<sup>asws</sup>"
        }
      }
    ],
    "index": 174,
    "local_index": 116,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 117"
        },
        "path": "/books/al-kafi:1:4:117",
        "titles": {
          "ar": "باب مَوْلِدِ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )",
          "en": "Chapter 117 – Nazool (Arrival) of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 115"
        },
        "path": "/books/al-kafi:1:4:115",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَوْلِدِ الْحَسَنِ</span> بْنِ عَلِيٍّ صَلَوَاتُ اللَّهِ عَلَيْهِمَا",
          "en": "Chapter 115 – The Nazool (Arrival) of Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>, may the Salawat of Allah<sup>azwj</sup> be upon them<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:116",
    "titles": {
      "ar": "باب مَوْلِدِ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام )",
      "en": "Chapter 116 – Nazool (Arrival) of Al-Husayn Bin Ali<sup>asws</sup>"
    },
    "verse_count": 8,
    "verse_start_index": 1253,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1254,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:116:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">س</span>َعْدٌ وَ أَحْمَدُ</span> بْنُ مُحَمَّدٍ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُبِضَ الْحُسَيْنُ بْنُ عَلِيٍّ ( عليه السلام ) يَوْمَ عَاشُورَاءَ وَ هُوَ ابْنُ سَبْعٍ وَ خَمْسِينَ سَنَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Sa’d and Ahmad Bin Muhammad, altogether from Ibrahim Bin Mahziyar, from his brother Ali Bin Mahziyar, from Al Husayn Bin Saeed, from Muhammad Bin Sinan, from Ibn Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> passed away on the day of Ashoura, and he<sup>asws</sup> was fifty-seven years old’."
          ],
          "en.sarwar": [
            " Al-Husayn ibn Ali (a.s.) was born in the third year AH. He left this word in the month of Muharram in the year sixty one AH. He lived for fifty seven years and few months. ‘Ubaydulla ibn Ziyad murdered him (may Allah condemn him) during the Caliphate of Yazid ibn Mu‘awiya (may Allah’s condemnation be up on him. He was the governor of Kufa. The horse men who murdered him were lead by ‘Umar ibn Sa‘d (may condemn him) in the plain of Karbala. It took place on Monday the tenth of the month of Muharram. His mother was Fatima, daughter of the Messenger of Allah ."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه صحيح عندي    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/362)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1255,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:116:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ الْعَرْزَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ بَيْنَ الْحَسَنِ وَ الْحُسَيْنِ ( عليهما السلام ) طُهْرٌ وَ كَانَ بَيْنَهُمَا فِي الْمِيلَادِ سِتَّةُ أَشْهُرٍ وَ عَشْراً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdul Rahman Al Arzamy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There was between Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup> a gap that of one cycle (six months and ten days), and the age gap between the two (Imams) was six months and ten (days)’."
          ],
          "en.sarwar": [
            " 1. Sa‘d and Ahmad ibn Muhammad together have narrated from Ibrahim ibn mahziyar from his brother, Ali ibn Mahziyar from al-Husayn ibn Sa‘id from Muhammad ibn Sinan from ibn Muskan from abu Basir from abu ‘Abdallah (a.s.) who has said the following. “Al-Husayn (a.s.) passed away on the day of ‘Ashura’ and he was fifty seven years old.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/362)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/53)"
        ],
        "index": 1256,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:116:3",
        "refs": {
          "Mentions": [
            "/books/quran:46:15"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو الزَّيَّاتِ عَنْ رَجُلٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ جَبْرَئِيلَ ( عليه السلام ) نَزَلَ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) فَقَالَ لَهُ يَا مُحَمَّدُ إِنَّ اللَّهَ يُبَشِّرُكَ بِمَوْلُودٍ يُولَدُ مِنْ فَاطِمَةَ تَقْتُلُهُ أُمَّتُكَ مِنْ بَعْدِكَ فَقَالَ يَا جَبْرَئِيلُ وَ عَلَى رَبِّيَ السَّلَامُ لَا حَاجَةَ لِي فِي مَوْلُودٍ يُولَدُ مِنْ فَاطِمَةَ تَقْتُلُهُ أُمَّتِي مِنْ بَعْدِي ",
          "فَعَرَجَ ثُمَّ هَبَطَ ( عليه السلام ) فَقَالَ لَهُ مِثْلَ ذَلِكَ فَقَالَ يَا جَبْرَئِيلُ وَ عَلَى رَبِّيَ السَّلَامُ لَا حَاجَةَ لِي فِي مَوْلُودٍ تَقْتُلُهُ أُمَّتِي مِنْ بَعْدِي",
          "فَعَرَجَ جَبْرَئِيلُ ( عليه السلام ) إِلَى السَّمَاءِ ثُمَّ هَبَطَ فَقَالَ يَا مُحَمَّدُ إِنَّ رَبَّكَ يُقْرِئُكَ السَّلَامَ وَ يُبَشِّرُكَ بِأَنَّهُ جَاعِلٌ فِي ذُرِّيَّتِهِ الْإِمَامَةَ وَ الْوَلَايَةَ وَ الْوَصِيَّةَ فَقَالَ قَدْ رَضِيتُ",
          "ثُمَّ أَرْسَلَ إِلَى فَاطِمَةَ أَنَّ اللَّهَ يُبَشِّرُنِي بِمَوْلُودٍ يُولَدُ لَكِ تَقْتُلُهُ أُمَّتِي مِنْ بَعْدِي فَأَرْسَلَتْ إِلَيْهِ لَا حَاجَةَ لِي فِي مَوْلُودٍ مِنِّي تَقْتُلُهُ أُمَّتُكَ مِنْ بَعْدِكَ فَأَرْسَلَ إِلَيْهَا أَنَّ اللَّهَ قَدْ جَعَلَ فِي ذُرِّيَّتِهِ الْإِمَامَةَ وَ الْوَلَايَةَ وَ الْوَصِيَّةَ فَأَرْسَلَتْ إِلَيْهِ أَنِّي قَدْ رَضِيتُ فَ حَمَلَتْهُ أُمُّهُ كُرْهاً وَ وَضَعَتْهُ كُرْهاً وَ حَمْلُهُ وَ فِصالُهُ ثَلاثُونَ شَهْراً",
          "حَتَّى إِذا بَلَغَ أَشُدَّهُ وَ بَلَغَ أَرْبَعِينَ سَنَةً قالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَ عَلى والِدَيَّ وَ أَنْ أَعْمَلَ صالِحاً تَرْضاهُ وَ أَصْلِحْ لِي فِي ذُرِّيَّتِي فَلَوْ لَا أَنَّهُ قَالَ أَصْلِحْ لِي فِي ذُرِّيَّتِي لَكَانَتْ ذُرِّيَّتُهُ كُلُّهُمْ أَئِمَّةً ",
          "وَ لَمْ يَرْضَعِ الْحُسَيْنُ مِنْ فَاطِمَةَ ( عليها السلام ) وَ لَا مِنْ أُنْثَى كَانَ يُؤْتَى بِهِ النَّبِيَّ فَيَضَعُ إِبْهَامَهُ فِي فِيهِ فَيَمُصُّ مِنْهَا مَا يَكْفِيهَا الْيَوْمَيْنِ وَ الثَّلَاثَ فَنَبَتَ لَحْمُ الْحُسَيْنِ ( عليه السلام ) مِنْ لَحْمِ رَسُولِ اللَّهِ وَ دَمِهِ وَ لَمْ يُولَدْ لِسِتَّةِ أَشْهُرٍ إِلَّا عِيسَى ابْنُ مَرْيَمَ ( عليه السلام ) وَ الْحُسَيْنُ بْنُ عَلِيٍّ ( عليه السلام ) .",
          "وَ فِي رِوَايَةٍ أُخْرَى عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) كَانَ يُؤْتَى بِهِ الْحُسَيْنُ فَيُلْقِمُهُ لِسَانَهُ فَيَمُصُّهُ فَيَجْتَزِئُ بِهِ وَ لَمْ يَرْتَضِعْ مِنْ أُنْثَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ali Bin Ismail, from Muhammad Bin Amro Al Zayyat, from a man from our comanions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Jibraeel<sup>as</sup> descended unto Muhammad<sup>saww</sup> and said to him<sup>saww</sup>: ‘O Muhammad<sup>saww</sup>! Allah<sup>azwj</sup> Give you<sup>saww</sup> glad tidings that (Syeda) Fatima<sup>asws</sup> will be Blessed with the one<sup>asws</sup> who Your<sup>saww</sup> community will kill after you<sup>saww</sup>’. So he<sup>saww</sup> said: ‘O Jibraeel<sup>saww</sup>, and upon my<sup>saww</sup> Lord<sup>azwj</sup> be the greetings! Why there is a need for me<sup>saww</sup> regarding a son<sup>asws</sup> whom my<sup>saww</sup> community would be killing after me<sup>saww</sup>’. ",
            "So he<sup>as</sup> ascended, then descended, and said to him<sup>saww</sup> the likes of that. So he<sup>saww</sup> said: ‘O Jibraeel<sup>as</sup>! And upon my<sup>saww</sup> Lord<sup>azwj</sup> be the greetings! Why there is a need for me<sup>saww</sup> regarding a birth whom my<sup>saww</sup> community would be killing, from after me<sup>saww</sup>’. ",
            "So Jibraeel<sup>as</sup> ascended to the sky, then descended, so he<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! Your<sup>saww</sup> Lord<sup>azwj</sup> Conveys the greetings and Gives you<sup>saww</sup> that He<sup>azwj</sup> would be Making to be Imams<sup>asws</sup> in his<sup>asws</sup> offspring, and the Wilayah, and the successorship’. So he<sup>saww</sup> said: ‘I<sup>saww</sup> have been pleased’. ",
            "Then he<sup>saww</sup> sent a message to (Syeda) Fatima<sup>asws</sup>: ‘Allah<sup>azwj</sup> Gives you<sup>asws</sup> glad tidings that you<sup>asws</sup> will be Blessed (with a son). My<sup>saww</sup> community would be killing him<sup>asws</sup> after me<sup>saww</sup>’. So she<sup>asws</sup> sent a message to him<sup>saww</sup>: ‘Why there is a need for me<sup>asws</sup> having the one<sup>asws</sup> who would be killed by your<sup>saww</sup> community after you<sup>saww</sup>’. So he<sup>saww</sup> sent a message to her<sup>asws</sup>: ‘Allah<sup>azwj</sup> has Made to be in his<sup>asws</sup> offspring, the Imamate, and the Wilayah, and the succesorship’. So she<sup>asws</sup> sent a message to him<sup>saww</sup>: ‘I<sup>asws</sup> have been pleased’. <span class=\"ibTxt\"><a href=\"/#/books/quran:46#h15\">[46:15]</a> with abhorrence did his mother bear him and with abhorrence did she bring him forth; and the bearing of him and the weaning of him was thirty months</span>. ",
            "When he<sup>asws</sup> reached strength and reached forty years of age, he<sup>asws</sup> said: ‘Lord<sup>azwj</sup>! Advise me<sup>asws</sup> to thank for Your<sup>azwj</sup> Bounties which You<sup>azwj</sup> have Favoured upon me<sup>asws</sup> and upon my<sup>asws</sup> parents, and the righteous deeds You<sup>azwj</sup> would be Pleased with, and Correct for me<sup>asws</sup> among my<sup>asws</sup> offspring’. And had he<sup>asws</sup> not said ‘Correct for me<sup>asws</sup> among my<sup>asws</sup> offspring’, it would have been so that his<sup>asws</sup> offspring, all of them would have been Imams<sup>asws</sup>. ",
            "And Al-Husayn<sup style=\"font-weight: normal\">asws</sup> did not take milk from Fatima<sup style=\"font-weight: normal\">asws</sup>, nor from a (another) woman. He<sup style=\"font-weight: normal\">asws</sup> used to be brought to the Prophet<sup style=\"font-weight: normal\">saww</sup>, so he<sup style=\"font-weight: normal\">saww</sup> would place his<sup style=\"font-weight: normal\">saww</sup> thumb in his<sup style=\"font-weight: normal\">asws</sup> mouth, so he<sup style=\"font-weight: normal\">asws</sup> would suckle from it what sufficed him<sup style=\"font-weight: normal\">asws</sup> for two days or three. Thus, the flesh of Al-Husayn<sup style=\"font-weight: normal\">asws</sup> was built from the flesh of Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> and his<sup style=\"font-weight: normal\">saww</sup> blood. And there was not come in (in the world) a six months except for Isa<sup style=\"font-weight: normal\">as</sup> Bin Maryam<sup style=\"font-weight: normal\">as</sup> and Al-Husayn<sup style=\"font-weight: normal\">asws</sup> Bin Ali<sup style=\"font-weight: normal\">asws</sup>’. ",
            "And in another report from Abu Al-Hassan Al-Reza<sup>asws</sup>: ‘The Prophet<sup>saww</sup>, they used to come to him<sup>saww</sup> with Al Husayn<sup>asws</sup>, so he<sup>saww</sup> would morsel for him<sup>asws</sup> his<sup>saww</sup> own tongue, so he<sup>asws</sup> would suckle with it, and he<sup>asws</sup> did not breastfeed from a woman’."
          ],
          "en.sarwar": [
            " 2. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Abd al-Rahman al-‘Arzami from abu ‘Abdallah (a.s.) who has said the following. “The time between the birth of al-Hassan and the conception for al-Husayn was like one menstuaral cycle and the time between the birth of the two was six months and tendays.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (362/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1257,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:116:4",
        "refs": {
          "Mentions": [
            "/books/quran:37:89",
            "/books/quran:37:88",
            "/books/quran:46:15"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَنَظَرَ نَظْرَةً فِي النُّجُومِ فَقالَ إِنِّي سَقِيمٌ قَالَ حَسَبَ فَرَأَى مَا يَحُلُّ بِالْحُسَيْنِ ( عليه السلام ) فَقَالَ إِنِّي سَقِيمٌ لِمَا يَحُلُّ بِالْحُسَيْنِ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:37#h88\">[37:88]</a> Then he looked with a consideration at the stars <a href=\"/#/books/quran:37#h89\">[37:89]</a> Then he said: I feel sick</span>.  He<sup>asws</sup> said: ‘He<sup>as</sup> calculated (from the stars by looking at them), so he<sup>as</sup> saw what the conditions would be with Al-Husayn<sup>asws</sup>, so he<sup>as</sup> said: ‘I<sup>as</sup> feel sick at what (I<sup>as</sup> see of the) deterioration of the conditions with Al-Husayn<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Washsha’ and al-Husayn ibn Muhammad from Mu‘alla ibn Muhammad from al-Washsha’ from Ahmad ibn ‘A’idh from abu Khadija from abu ‘Abdallah (a.s.) who has said the following. “When Fatima (a.s.) conceived al-Husayn (a.s.) Jibril came to the Messenger of Allah and said, “Fatima will soon give birth to a son. Your ’Umma (followers) will kill him after you will die.” When Fatima had conceived al-Husayn she was unhappy and when she gave birth she was unhappy. Then The Imam (a.s.) said, “No mother has ever been seen in the word to bear a child that she would not like. However, she was unhappy because she knew that he will be killed.” The Imam (a.s.) has said, “It is this case for which the following verse of the Holy Quran came. “We have advised the human being to be kind to his parents; his mother bore him with hardship and delivered him while suffering a great deal of pain. The period in which his mother bore and weaned him lasted for thirty months. . .” <a href=\"/#/books/quran:46#h15\">[46:15]</a>.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل وآخرم أيضا مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/364)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1258,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:116:5",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ مُحَمَّدِ بْنِ حُمْرَانَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَمَّا كَانَ مِنْ أَمْرِ الْحُسَيْنِ ( عليه السلام ) مَا كَانَ ضَجَّتِ الْمَلَائِكَةُ إِلَى اللَّهِ بِالْبُكَاءِ وَ قَالَتْ يُفْعَلُ هَذَا بِالْحُسَيْنِ صَفِيِّكَ وَ ابْنِ نَبِيِّكَ قَالَ فَأَقَامَ اللَّهُ لَهُمْ ظِلَّ الْقَائِمِ ( عليه السلام ) وَ قَالَ بِهَذَا أَنْتَقِمُ لِهَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Al Hassan, from Muhammad Bin Isa Bin Ubeyd, from Ali Bin Asbat, from Sayf Bin Ameyra, from Muhammad Bin Humran who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When it was from the matter of Al-Husayn<sup>asws</sup> what was, the Angels raised a clamour to Allah<sup>azwj</sup> with the wailing, and they said: ‘This has been done to Al-Husayn<sup>asws</sup>, Your<sup>azwj</sup> elite and a son<sup>asws</sup> of Your<sup>azwj</sup> Prophet<sup>saww</sup>!’ So Allah<sup>azwj</sup> Established a shadow of Al-Qaim<sup>asws</sup> for them and Said: “With this one I<sup>azwj</sup> shall Take revenge for this one<sup>asws</sup>”’."
          ],
          "en.sarwar": [
            " In another hadith from abu al-Hassan al-Rida (a.s.) it is said that the Holy Prophet (s.a) woulld come to al-Husayn and would place his tongue in his mouth and it would suffice him (as food) and that he did have any milk from any female."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (366/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1259,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:116:6",
        "refs": {
          "Mentions": [
            "/books/quran:37:89",
            "/books/quran:37:88"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ أَعْيَنَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا نَزَلَ النَّصْرُ عَلَى الْحُسَيْنِ بْنِ عَلِيٍّ حَتَّى كَانَ بَيْنَ السَّمَاءِ وَ الْأَرْضِ ثُمَّ خُيِّرَ النَّصْرَ أَوْ لِقَاءَ اللَّهِ فَاخْتَارَ لِقَاءَ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Abdul Malik Bin Ayn, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When the helpers descended unto Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> until they were between the sky and the earth, then he<sup>asws</sup> was Given the choice, then help or meeting Allah<sup>azwj</sup>. So he<sup>asws</sup> chose meeting Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 5. Ali ibn Muhammad has narrated from in in a marfu‘ manner from abu ‘Abdallah (a.s.) who has said the following about the words of Allah, the Most Majestic, the Most gracious. “. . Then he looked at the stars <a href=\"/#/books/quran:37#h88\">[37:88]</a> and said, “I am sick!” <a href=\"/#/books/quran:37#h89\">[37:89]</a>. The Imam (a.s.) said, “He calculated and found what had t happen to al-Husayn (a.s.) then he said, “I am sick for what will happen to al-Husayn (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/367)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1260,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:116:7",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي أَبُو كُرَيْبٍ وَ أَبُو سَعِيدٍ الْأَشَجُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ أَبِيهِ إِدْرِيسَ بْنِ عَبْدِ اللَّهِ الْأَوْدِيِّ قَالَ لَمَّا قُتِلَ الْحُسَيْنُ ( عليه السلام ) أَرَادَ الْقَوْمُ أَنْ يُوطِئُوهُ الْخَيْلَ فَقَالَتْ فِضَّةُ لِزَيْنَبَ يَا سَيِّدَتِي إِنَّ سَفِينَةَ كُسِرَ بِهِ فِي الْبَحْرِ فَخَرَجَ إِلَى جَزِيرَةٍ فَإِذَا هُوَ بِأَسَدٍ فَقَالَ يَا أَبَا الْحَارِثِ أَنَا مَوْلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَهَمْهَمَ بَيْنَ يَدَيْهِ حَتَّى وَقَفَهُ عَلَى الطَّرِيقِ وَ الْأَسَدُ رَابِضٌ فِي نَاحِيَةٍ فَدَعِينِي أَمْضِي إِلَيْهِ وَ أُعْلِمُهُ مَا هُمْ صَانِعُونَ غَداً ",
          "قَالَ فَمَضَتْ إِلَيْهِ فَقَالَتْ يَا أَبَا الْحَارِثِ فَرَفَعَ رَأْسَهُ ثُمَّ قَالَتْ أَ تَدْرِي مَا يُرِيدُونَ أَنْ يَعْمَلُوا غَداً بِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) يُرِيدُونَ أَنْ يُوطِئُوا الْخَيْلَ ظَهْرَهُ قَالَ فَمَشَى حَتَّى وَضَعَ يَدَيْهِ عَلَى جَسَدِ الْحُسَيْنِ ( عليه السلام ) فَأَقْبَلَتِ الْخَيْلُ فَلَمَّا نَظَرُوا إِلَيْهِ قَالَ لَهُمْ عُمَرُ بْنُ سَعْدٍ لَعَنَهُ اللَّهُ فِتْنَةٌ لَا تُثِيرُوهَا انْصَرِفُوا فَانْصَرَفُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad said, ‘Abu Kureyb and Abu Saeed Al Ashajja narrated to me saying, ‘Abdullah Bin Idrees narrated to us, from his father Idrees Bin Abdullah Al Awdy who said, ",
            "‘When Al-Husayn<sup>asws</sup> was killed, the people (army) wanted the cavalry horses to trample him<sup>asws</sup>. So Fizza<sup>as</sup> said to (Syeda) Zaynab<sup>as</sup>: ‘O my<sup>as</sup> chieftess!’ A ship broke in the sea, so it came out to an island, and there he was with a lion. So he said, ‘O Abu Haris! I am a slave of Rasool-Allah<sup>saww</sup>!’ So it murmured to him until he paused upon the road, and the lion was crouching nearby. So leave me<sup>as</sup> to go to it and let it know what they are thinking of doing tomorrow’. ",
            "So he (the narrator) said, ‘So she<sup>as</sup> went to it and said: ‘O Abu Al-Haris!’ So it raised its head. Then she<sup>as</sup> said: ‘Do you know what they are intending of doing tomorrow with Abu Abdullah<sup>asws</sup>? They are intending that the cavalry horses trample upon his<sup>asws</sup> back’. So it went until it placed its paws upon the body of Al-Husayn<sup>asws</sup>. So the cavalry horses came over, but when they looked at it, Umar Bin Sa’d, may Allah<sup>azwj</sup> Curse him, said to them, ‘A strife! Do not raise it. Leave!’ So they left’."
          ],
          "en.sarwar": [
            " 6. Ahmad ibn Muhammad has narrated from Muhammad ibn al-Hassan from Muhammad ibn ‘Isa ibn ‘Ubayd from Ali ibn Asbat from Sayf ibn ‘Amira from Muhammad ibn humran who has said the following. “Abu ‘Abdallah (a.s.) has said, ‘When all that happened to al-Husayn had happened, the angels wept and cried before Allah and said, “How such thing would happen to al-Husayn Your chosen one and the grand son of Your Prophet?” The Imam (a.s.) has said that Allah then showed to them the shadow of Al-Qa’im (the one who will rise with Divine Authority) and said, “Through him I will take My revenge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/368)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1261,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:116:8",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ يُونُسَ عَنْ مَصْقَلَةَ الطَّحَّانِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَمَّا قُتِلَ الْحُسَيْنُ ( عليه السلام ) أَقَامَتِ امْرَأَتُهُ الْكَلْبِيَّةُ عَلَيْهِ مَأْتَماً وَ بَكَتْ وَ بَكَيْنَ النِّسَاءُ وَ الْخَدَمُ حَتَّى جَفَّتْ دُمُوعُهُنَّ وَ ذَهَبَتْ فَبَيْنَا هِيَ كَذَلِكَ إِذَا رَأَتْ جَارِيَةً مِنْ جَوَارِيهَا تَبْكِي وَ دُمُوعُهَا تَسِيلُ فَدَعَتْهَا فَقَالَتْ لَهَا مَا لَكِ أَنْتِ مِنْ بَيْنِنَا تَسِيلُ دُمُوعُكِ قَالَتْ إِنِّي لَمَّا أَصَابَنِي الْجَهْدُ شَرِبْتُ شَرْبَةَ سَوِيقٍ ",
          "قَالَ فَأَمَرَتْ بِالطَّعَامِ وَ الْأَسْوِقَةِ فَأَكَلَتْ وَ شَرِبَتْ وَ أَطْعَمَتْ وَ سَقَتْ وَ قَالَتْ إِنَّمَا نُرِيدُ بِذَلِكِ أَنْ نَتَقَوَّى عَلَى الْبُكَاءِ عَلَى الْحُسَيْنِ ( عليه السلام ) ",
          "قَالَ وَ أُهْدِيَ إِلَى الْكَلْبِيَّةِ جُوَناً لِتَسْتَعِينَ بِهَا عَلَى مَأْتَمِ الْحُسَيْنِ ( عليه السلام ) فَلَمَّا رَأَتِ الْجُوَنَ قَالَتْ مَا هَذِهِ قَالُوا هَدِيَّةٌ أَهْدَاهَا فُلَانٌ لِتَسْتَعِينِي عَلَى مَأْتَمِ الْحُسَيْنِ فَقَالَتْ لَسْنَا فِي عُرْسٍ فَمَا نَصْنَعُ بِهَا ثُمَّ أَمَرَتْ بِهِنَّ فَأُخْرِجْنَ مِنَ الدَّارِ فَلَمَّا أُخْرِجْنَ مِنَ الدَّارِ لَمْ يُحَسَّ لَهَا حِسٌّ كَأَنَّمَا طِرْنَ بَيْنَ السَّمَاءِ وَ الْأَرْضِ وَ لَمْ يُرَ لَهُنَّ بِهَا بَعْدَ خُرُوجِهِنَّ مِنَ الدَّارِ أَثَرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Ahmad, from Al Hassan Bin Ali, from Yunus, from Masqala Al Tahhan who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When Al-Husayn<sup>asws</sup> was killed, his<sup>asws</sup> wife of the clan of Al-Kalby, organised a mourning ceremony, and she wept and the women wept and the servants, until they tears dried up and went. So while she was like that when she saw a maid from her maids weeping and her tears were flowing. So she called her over and said to her, ‘What is the matter you are from between us and your tears are flowing?’ She said, ‘I, when I am hit by the stress, I drink the drink of Suweyq’. ",
            "He<sup>asws</sup> said: ‘So she instructed with the meal and al-Suweyq, so she ate and drank, and fed and quenched, and she said, ‘But rather I intend with that we should be strengthened upon the weeping upon Al-Husayn<sup>asws</sup>’. ",
            "He<sup>asws</sup> said: ‘Certain birds were gifted to the Kalby woman in order to be supported by it upon the mourning of Al-Husayn<sup>asws</sup>. So when she saw these, she said, ‘What are these?’ They said, ‘A gift which so and so has gifted in order to support us upon the mourning of Al-Husayn<sup>asws</sup>’. So she said, ‘We are not in a marriage. So what shall we do with these?’ Then she instructed with these, so they were taken away from the house. So when these were taken out from the house, there was no sight of these. It was as if they had flown between the sky and the earth, and no trace was seen of these after their exit from the house’."
          ],
          "en.sarwar": [
            " 7. Al-Husayn ibn Muhammad has said that abu Kurayb and abu Sa‘id al-Ashja‘ narrated to him that ‘Abdallah ibn Idris narrated to themfm his father, Idris ibn ‘Abdallah al-’Awi who has said the following. “When al-Husayn (a.s.) was murdered the people wanted to make the horses run over his (al-Husayn’s) body. Fizzah then said to Zaynab, “My lady, there was a shipwreck and Safina came out on an Island face to face with a lion. He said to the loin, “O abu al-Harith, I am a the slave of the Messenger of Allah.” The loin murmured in front of him and showed him the way. There lives a loin in this area allow me to go and inform him of what the people intend to do to al-Husayn (a.s.) tomorrow.” The narrator has said that she went to the loin and said, “O abu al-Harith, and the loin raised his head and she said, “Do you know what these people intend to do to abu ‘Abdallah (a.s.)? They intend to make the horses run over his body.. The narrator has said that the loin walked and placed both of his hands over the body of al-Husayn (a.s.). When the horse men came they found the lion in that condition and ‘Umar ibn Sa‘d ( may Allah condemn him) told them, “It is is mischief. Do not bother and turn back and turned back."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/368)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "part_type": "Hadith",
        "text": [
          " 8ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي أَبُو كُرَيْبٍ وَأَبُو سَعِيدٍ الاشَجُّ قَالَ حَدَّثَنَا عَبْدُ الله بْنُ إِدْرِيسَ عَنْ أَبِيهِ إِدْرِيسَ بْنِ عَبْدِ الله الاوْدِيِّ قَالَ لَمَّا قُتِلَ الْحُسَيْنُ (عَلَيْهِ السَّلام) أَرَادَ الْقَوْمُ أَنْ يُوطِئُوهُ الْخَيْلَ فَقَالَتْ فِضَّةُ لِزَيْنَبَ يَا سَيِّدَتِي إِنَّ سَفِينَةَ كُسِرَ بِهِ فِي الْبَحْرِ فَخَرَجَ إِلَى جَزِيرَةٍ فَإِذَا هُوَ بِأَسَدٍ فَقَالَ يَا أَبَا الْحَارِثِ أَنَا مَوْلَى رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) فَهَمْهَمَ بَيْنَ يَدَيْهِ حَتَّى وَقَفَهُ عَلَى الطَّرِيقِ وَالاسَدُ رَابِضٌ فِي نَاحِيَةٍ فَدَعِينِي أَمْضِي إِلَيْهِ وَأُعْلِمُهُ مَا هُمْ صَانِعُونَ غَداً قَالَ فَمَضَتْ إِلَيْهِ فَقَالَتْ يَا أَبَا الْحَارِثِ فَرَفَعَ رَأْسَهُ ثُمَّ قَالَتْ أَ تَدْرِي مَا يُرِيدُونَ أَنْ يَعْمَلُوا غَداً بِأَبِي عَبْدِ الله (عَلَيْهِ السَّلام) يُرِيدُونَ أَنْ يُوطِئُوا الْخَيْلَ ظَهْرَهُ قَالَ فَمَشَى حَتَّى وَضَعَ يَدَيْهِ عَلَى جَسَدِ الْحُسَيْنِ (عَلَيْهِ السَّلام) فَأَقْبَلَتِ الْخَيْلُ فَلَمَّا نَظَرُوا إِلَيْهِ قَالَ لَهُمْ عُمَرُ بْنُ سَعْدٍ لَعَنَهُ الله فِتْنَةٌ لا تُثِيرُوهَا انْصَرِفُوا فَانْصَرَفُوا."
        ],
        "translations": {
          "en.sarwar": [
            " 8. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn Ahmad from al-Hassan ibn Ali from Yunus from Masqala al-Tahhan who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘When al-Husayn was murdered his wife who was from the tribe of al-Kalb began to organize a mourning gathering. She wept and the ladies and servants wept until their tears dried up. There was one female servant (slave) who would weep and her tears would not stop. She called her and said, “How is it that our tears have dried up and your tears have not?” She said, “When I suffer I drink Sawiq, (a kind of soup made of wheat and or barley).” She then ordered to prepare Sawiq and food. She drink and eat and give others to drink and eat and would say, “We find energy to weep for al-Husayn.” The Imam (a.s.) said, “Certain birds were given to al-Kalbia lady to help her in her mourning for al-Husayn (a.s.). When she saw them she asked, “What are these?” They told her that they were a gift to help her in mourning for al-Husayn (a.s.).” She said, “We are not in a wedding. What do we do with them?” She told her servants to take them out of the house. When they were taken out of the house they just disappeared as if they did not exist or flew between the heavens and earth and afterwards no trace of them were found in the house.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:116",
  "kind": "verse_list"
}