{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 117"
        },
        "path": "/books/al-kafi:1:4:117",
        "titles": {
          "ar": "باب مَوْلِدِ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )",
          "en": "Chapter 117 – Nazool (Arrival) of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>"
        }
      }
    ],
    "index": 175,
    "local_index": 117,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 118"
        },
        "path": "/books/al-kafi:1:4:118",
        "titles": {
          "ar": "باب مَوْلِدِ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام )",
          "en": "Chapter 118 – Arrival of Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 116"
        },
        "path": "/books/al-kafi:1:4:116",
        "titles": {
          "ar": "باب مَوْلِدِ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام )",
          "en": "Chapter 116 – Nazool (Arrival) of Al-Husayn Bin Ali<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:117",
    "titles": {
      "ar": "باب مَوْلِدِ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )",
      "en": "Chapter 117 – Nazool (Arrival) of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>"
    },
    "verse_count": 6,
    "verse_start_index": 1261,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1262,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:117:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ الْحَسَنِ</span> الْحَسَنِيُّ رَحِمَهُ اللَّهُ وَ عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ الْخُزَاعِيِّ عَنْ نَصْرِ بْنِ مُزَاحِمٍ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا أُقْدِمَتْ بِنْتُ يَزْدَجَرْدَ عَلَى عُمَرَ أَشْرَفَ لَهَا عَذَارَى الْمَدِينَةِ وَ أَشْرَقَ الْمَسْجِدُ بِضَوْئِهَا لَمَّا دَخَلَتْهُ فَلَمَّا نَظَرَ إِلَيْهَا عُمَرُ غَطَّتْ وَجْهَهَا وَ قَالَتْ أُفٍّ بِيرُوجْ بَادَا هُرْمُزْ فَقَالَ عُمَرُ أَ تَشْتِمُنِي هَذِهِ وَ هَمَّ بِهَا فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَيْسَ ذَلِكَ لَكَ خَيِّرْهَا رَجُلًا مِنَ الْمُسْلِمِينَ وَ احْسُبْهَا بِفَيْئِهِ",
          "فَخَيَّرَهَا فَجَاءَتْ حَتَّى وَضَعَتْ يَدَهَا عَلَى رَأْسِ الْحُسَيْنِ ( عليه السلام ) فَقَالَ لَهَا أَمِيرُ الْمُؤْمِنِينَ مَا اسْمُكِ فَقَالَتْ جَهَانْ شَاهُ فَقَالَ لَهَا أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بَلْ شَهْرَبَانُوَيْهِ ثُمَّ قَالَ لِلْحُسَيْنِ يَا أَبَا عَبْدِ اللَّهِ لَتَلِدَنَّ لَكَ مِنْهَا خَيْرُ أَهْلِ الْأَرْضِ فَوَلَدَتْ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) وَ كَانَ يُقَالُ لِعَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) ابْنُ الْخِيَرَتَيْنِ فَخِيَرَةُ اللَّهِ مِنَ الْعَرَبِ هَاشِمٌ وَ مِنَ الْعَجَمِ فَارِسُ .",
          "وَ رُوِيَ أَنَّ أَبَا الْأَسْوَدِ الدُّؤَلِيَّ قَالَ فِيهِ : وَ إِنَّ غُلَاماً بَيْنَ كِسْرَى وَ هَاشِمٍ * لَأَكْرَمُ مَنْ نِيطَتْ عَلَيْهِ التَّمَائِمُ"
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Al Hassan Al Hassany, and Ali Bin Muhammad Bin Abdullah, altogether from Ibrahim Bin Is’haq Al Ahmar, from Abdul Rahman Bin Abdullah Al Khuzaie, from Nasr Bin Muzahim, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When the daughter of Yazdjard was brought to Umar, the young girls of Al-Medina flocked to see her<sup>asws</sup> and the Masjid sparkled by her<sup>asws</sup> illumination when she<sup>asws</sup> entered it. So when Umar looked at her<sup>asws</sup>, she<sup>asws</sup> covered-up her<sup>asws</sup> face and she<sup>asws</sup> said (in Persian), ‘Uff! May the Hurmuz turn black!’ So Umar said, ‘Is this one insulting me?’, and he was concerned with it. So Amir Al-Momineen<sup>asws</sup> said to him: ‘That is not for you. Give her the choice of a man from the Muslims, and count her<sup>asws</sup> as his share of the booty’, ",
            "So he gave her<sup>asws</sup> the choice, and she<sup>asws</sup> came over until she<sup>asws</sup> placed her<sup>asws</sup> hand upon the head of Al-Husayn<sup>asws</sup>. So Amir Al-Momineen<sup>asws</sup> said to her<sup>asws</sup>: ‘What is your name?’ So she<sup>asws</sup> said, ‘Jahan Shah’. So Amir Al-Momineen<sup>asws</sup> said to her<sup>asws</sup>: ‘But, (It is) ‘Shehr-bano’. Then he<sup>asws</sup> said to Al-Hassan<sup>asws</sup>: ‘O Abu Abdullah<sup>asws</sup>! You<sup>asws</sup> will be Blessed from her<sup>asws</sup>, the best of the people of the Earth’. So she<sup>asws</sup> was Blessed with Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and it used to be said for Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, ‘Son of the two best ones’. So the Chosen one of Allah<sup>azwj</sup> from the Arabs was Hashim<sup>as</sup>, and from the non-Arabs was Persia’. ",
            "And it is reported that Abu Al-Aswad Al-Dawwaly said regarding it, ‘And the boy is between Chosroe and Hashim. The honourable one upon whom amulets are stitched’."
          ],
          "en.sarwar": [
            " Ali ibn al-Husayn was born in the year thirty eight AH. He passed away in the year ninety five at the age of fifty seven. His mother was Slama daughter of Yazdjurd ibn Sharyar ibn Shiruwayh ibn kisra ‘A Perwiz. Yazdjurd was the last Persian king."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف وأخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1263,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:117:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ كَانَ لِعَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) نَاقَةٌ حَجَّ عَلَيْهَا اثْنَتَيْنِ وَ عِشْرِينَ حَجَّةً مَا قَرَعَهَا قَرْعَةً قَطُّ قَالَ فَجَاءَتْ بَعْدَ مَوْتِهِ وَ مَا شَعَرْنَا بِهَا إِلَّا وَ قَدْ جَاءَنِي بَعْضُ خَدَمِنَا أَوْ بَعْضُ الْمَوَالِي فَقَالَ إِنَّ النَّاقَةَ قَدْ خَرَجَتْ فَأَتَتْ قَبْرَ عَلِيِّ بْنِ الْحُسَيْنِ فَانْبَرَكَتْ عَلَيْهِ فَدَلَكَتْ بِجِرَانِهَا الْقَبْرَ وَ هِيَ تَرْغُو فَقُلْتُ أَدْرِكُوهَا أَدْرِكُوهَا وَ جِيئُونِي بِهَا قَبْلَ أَنْ يَعْلَمُوا بِهَا أَوْ يَرَوْهَا قَالَ وَ مَا كَانَتْ رَأَتِ الْقَبْرَ قَطُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zurara who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘There was a she-camel of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, he<sup>asws</sup> performed Hajj upon it, twenty two Pilgrimages, not having whipped it with a whip at all. So she came over after his<sup>asws</sup> passing away, and we were not aware of it except that one of our<sup>asws</sup> servants came over to me<sup>asws</sup>, or one of the slaves, so he said, ‘The she-camel came out and came over to the grave of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>. So she rubbed herself upon it by its side and she was moaning. So I said, ‘Be aware of her, be aware of her, and go to her before they (people) come to know of her or see her’. He<sup>asws</sup> said: ‘And she had not seen the grave (beforehand) at all’."
          ],
          "en.sarwar": [
            " وَإِنَّ غُلاماً بَيْنَ كِسْرَى وَهَاشِمٍ***لاكْرَمُ مَنْ نِيطَتْ عَلَيْهِ التَّمَائِمُ‏ 1. al-Husayn ibn al-Hassan al-Hassani may grant him blessings and Ali ibn Muhammad ibn ‘Abdallah all of them from Ibrahim ibn Ishaq al-Ahmar from ‘Abd al-Rahman ibn ‘Abdallah al-Khuza’i from Nasr ibn Muzaham from ‘Amr ibn Shimr from Jabir from abu Ja‘far (a.s.) who has said the following. “When the daughter of Yazdjurd was brought to before ‘Umar the girls of Madina would love to see her. When entered the Mosque it become all delightful and bright. When ‘Umar looked at her she covered her face and said in her own language, “’Uff, bay ruj ba’ da Hurmuz (May, the life of Hurmuz turn black).” ‘Umar asked, “Is she abusing me and he turned to her. Amir al-Mu’minin Ali (a.s.) said, “That is not for you. Give her the chance to chose whoever of the Muslims she likes and then count as his share of the booty. He allowed her to choose and she came all the way to placed her hand on the head of al-Husayn (a.s.). Amir al-Mu’minin Ali (a.s.) asked her, “What is your name?” She said, “It is Jahan Shah.” Amir al-Mu’minin Ali (a.s.) said, “In fact, it is Shahra Ba’nuwayh.” He then said to al-Husayn (a.s.), “O abu ‘Abdallah, she will give birth to a son for you who will be the best of the inhabitants of earth. She gave birth to Ali ibn al-Husayn (a.s.). Ali ibn al-Husayn was called the son of the two best. The chosen from Arabs was the tribe of Hashim and from none Arab was Persains. It is narrated that abu al-Aswad al-Du’ili said about it. “A boy from Kisra and Hashim the most noble one on who sacred symbols are stitched for safety.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/ 6)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/53)"
        ],
        "index": 1264,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:117:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَمَّنْ ذَكَرَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا مَاتَ أَبِي عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) جَاءَتْ نَاقَةٌ لَهُ مِنَ الرَّعْيِ حَتَّى ضَرَبَتْ بِجِرَانِهَا عَلَى الْقَبْرِ وَ تَمَرَّغَتْ عَلَيْهِ فَأَمَرْتُ بِهَا فَرُدَّتْ إِلَى مَرْعَاهَا وَ إِنَّ أَبِي ( عليه السلام ) كَانَ يَحُجُّ عَلَيْهَا وَ يَعْتَمِرُ وَ لَمْ يَقْرَعْهَا قَرْعَةً قَطُّ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim Bin Hashim, from his father, from Muhammad Bin Isa, from Hafs Bin Al Bakhtary, from the one who mentioned it, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> passed away, a she-camel of his<sup>asws</sup> came over from the pen until she struck herself upon the side of the grave and wallowed upon it. So I<sup>asws</sup> ordered with her, and she was returned to her pen, and that my<sup>asws</sup> father<sup>asws</sup> had performed Hajj and Umrah upon her, and he<sup>asws</sup> had not whipped it with a whip at all’."
          ],
          "en.sarwar": [
            " 2. A number of our people has narrated from Ahmad ibn Muhammad from ibn al-Faddal from ibn Bukayr from Zurara who has said the following. “I heard abu Ja‘far (a.s.) say, ‘Ali ibn al-Husayn (a.s.) had a she camel. He had taken this camel twenty two times to Hajj (pilgrimage to Makka) and had not used the whip against not even once. The Imam (a.s.) has said that the camel came after he passed away and we were not aware but we noticed only when one of the servants or slaves came and said, “The she camel has went out all the way to the grave of Ali ibn al-Husayn (a.s.) and sat on the grave. She rubs her neck against the grave and moans. I then asked them to quickly get to her before they would know about her or see her. The Imam (a.s.) has said, “She had never seen the grave before.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/8)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1265,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:117:4",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدِ بْنِ عَامِرٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ بْنِ سَعْدٍ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ أَبِي عُمَارَةَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا كَانَ فِي اللَّيْلَةِ الَّتِي وُعِدَ فِيهَا عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) قَالَ لِمُحَمَّدٍ ( عليه السلام ) يَا بُنَيَّ ابْغِنِي وَضُوءاً قَالَ فَقُمْتُ فَجِئْتُهُ بِوَضُوءٍ قَالَ لَا أَبْغِي هَذَا فَإِنَّ فِيهِ شَيْئاً مَيِّتاً ",
          "قَالَ فَخَرَجْتُ فَجِئْتُ بِالْمِصْبَاحِ فَإِذَا فِيهِ فَأْرَةٌ مَيْتَةٌ فَجِئْتُهُ بِوَضُوءٍ غَيْرِهِ فَقَالَ يَا بُنَيَّ هَذِهِ اللَّيْلَةُ الَّتِي وُعِدْتُهَا فَأَوْصَى بِنَاقَتِهِ أَنْ يُحْظَرَ لَهَا حِظَارٌ وَ أَنْ يُقَامَ لَهَا عَلَفٌ فَجُعِلَتْ فِيهِ ",
          "قَالَ فَلَمْ تَلْبَثْ أَنْ خَرَجَتْ حَتَّى أَتَتِ الْقَبْرَ فَضَرَبَتْ بِجِرَانِهَا وَ رَغَتْ وَ هَمَلَتْ عَيْنَاهَا فَأُتِيَ مُحَمَّدُ بْنُ عَلِيٍّ فَقِيلَ لَهُ إِنَّ النَّاقَةَ قَدْ خَرَجَتْ فَأَتَاهَا فَقَالَ صَهْ الْآنَ قُومِي بَارَكَ اللَّهُ فِيكِ فَلَمْ تَفْعَلْ فَقَالَ وَ إِنْ كَانَ لَيَخْرُجُ عَلَيْهَا إِلَى مَكَّةَ فَيُعَلِّقُ السَّوْطَ عَلَى الرَّحْلِ فَمَا يَقْرَعُهَا حَتَّى يَدْخُلَ الْمَدِينَةَ ",
          "قَالَ وَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَخْرُجُ فِي اللَّيْلَةِ الظَّلْمَاءِ فَيَحْمِلُ الْجِرَابَ فِيهِ الصُّرَرُ مِنَ الدَّنَانِيرِ وَ الدَّرَاهِمِ حَتَّى يَأْتِيَ بَاباً بَاباً فَيَقْرَعُهُ ثُمَّ يُنِيلُ مَنْ يَخْرُجُ إِلَيْهِ فَلَمَّا مَاتَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) فَقَدُوا ذَاكَ فَعَلِمُوا أَنَّ عَلِيّاً ( عليه السلام ) كَانَ يَفْعَلُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Bin Aamir, from Ahmad Bin Is’haq Bin Sa’ad, from Sa’dan Bin Muslim, from Abu Umara, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: When it was the night in which Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was to pass away, he<sup>asws</sup> said to Muhammad<sup>asws</sup>: ‘O my<sup>asws</sup> son<sup>asws</sup>! Prepare the <span class=\"iTxt\">Wudou</span> (ablution water) for me’. So he<sup>asws</sup> said: ‘So I<sup>asws</sup> arose but (someone) brought to him<sup>asws</sup> with the (water for) Wudou’. But he<sup>asws</sup> said: ‘This is not proper for there is something dead in it’. ",
            "He<sup>asws</sup> said: ‘So I<sup>asws</sup> went out and came with the lantern, and there was a dead rat in it. So I<sup>asws</sup> brought to him<sup>asws</sup> with <span class=\"iTxt\">Wudou</span> (water) other than it. So he<sup>asws</sup> said: ‘O my<sup>asws</sup> son<sup>asws</sup>”. This is the night which I<sup>asws</sup> have been Promised it’. So he<sup>asws</sup> bequeathed with his<sup>asws</sup> she-camel, and a stable be made for her and that feed should be established for her’. So I<sup>asws</sup> made her to be in it’. ",
            "He<sup>asws</sup> said: ‘So it was not long before she exited until she came to the grave, and she struck herself by its side and rolled over it, and her eyes were flooded. So they came to Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>, and said to him<sup>asws</sup> that the she-camel had gone out. So he<sup>asws</sup> went over to her and said: ‘Calm down now, arise, may Allah<sup>azwj</sup> Bless you!’ But she did not do so. So he<sup>asws</sup> said: ‘And even when he (Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>) went out to Makkah upon her, so he<sup>asws</sup> would hang the whip upon the carriage, and he<sup>asws</sup> would not whip her until he<sup>asws</sup> entered Al-Medina’. ",
            "He<sup>asws</sup> said: ‘And it was so that Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> would go out during the dark night, so he<sup>asws</sup> would carry the sack in which would be the packets of Dinars and Dirhams, until he<sup>asws</sup> would come upon door after door, so he<sup>asws</sup> would know upon it, then he<sup>asws</sup> would give it to the one who came out to him<sup>asws</sup>. So when Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> passed away, that was missed, and they came to know that Ali<sup>asws</sup> was the one doing it’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim ibn Hashim has narrated from his fatherfm Muhammad ibn ‘Isa from Hafs ibn al-Bakhtari from the persom he mentioned from abu Ja‘far (a.s.) who has said the following. “ When my father, Ali ibn al-Husayn (a.s.) passed away the she camel that belonged to him came from the pasture and placed her neck against his grave and role her body on the ground. I commanded to return her back to her pasture. My father would take her for the journey to Hajj and ‘Umra (pilgrimage to Makka) and had never used the whip against her.” Note: The last words of this hadith that read ‘Ibn Babu wayh’. The interpreters have assumed that it is the name of the well know narrator of hadith. These words indicate that the following hadith is recorded in the copy of this book that belonged to ibn Babuwayh and other’s copies do not have it. There is also the possibility of misprint. The difference of ‘Babu’ and ‘Banu’ is only a dot above or below without a change in the main body of the word. If the word is ‘Banu’ then it is part of the previous hadith and the whole phrase ‘Ibn Banu wayh’ would mean, “He was the son of the noble lady ‘Banu wayh, (daughter of the King of Persia),’ after all. There is not wonder why he was so kind to the she camel.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/10)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1266,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:117:5",
        "text": [
          "مُحَمَّدُ بْنُ أَحْمَدَ عَنْ عَمِّهِ عَبْدِ اللَّهِ بْنِ الصَّلْتِ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ بِنْتِ إِلْيَاسَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) لَمَّا حَضَرَتْهُ الْوَفَاةُ أُغْمِيَ عَلَيْهِ ثُمَّ فَتَحَ عَيْنَيْهِ وَ قَرَأَ إِذَا وَقَعَتِ الْوَاقِعَةُ وَ إِنَّا فَتَحْنَا لَكَ وَ قَالَ الْحَمْدُ لِلَّهِ الَّذِي صَدَقَنَا وَعْدَهُ وَ أَوْرَثَنَا الْأَرْضَ نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ فَنِعْمَ أَجْرُ الْعَامِلِينَ ثُمَّ قُبِضَ مِنْ سَاعَتِهِ وَ لَمْ يَقُلْ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ahmad, from his uncle Abdullah Bin Al Salt, from Al Hassan Bin Ali Bin Bint Ilyas, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, when the death presented itself to him<sup>asws</sup>, had faintness upon him<sup>asws</sup>. Then he<sup>asws</sup> opened his<sup>asws</sup> eyes and recited <span class=\"ibTxt\">[56:1] When the great event occurs</span> (Chapter 56), and <span class=\"ibTxt\">[48:1] Surely We have Given to you a clear victory</span> (Chapter 48), and said: ‘<span class=\"ibTxt\">[39:74] The Praise is due to Allah, Whose Promise has been Proven to be True for us, and Made us to inherit the earth; we may abide in the Paradise wherever we desire to; so goodly is the Recompense of the workers</span><span class=\"iTxt\">’. </span>Then he<sup>asws</sup> passed away from that moment of his<sup>asws</sup>, and did not do anything (else)’."
          ],
          "en.sarwar": [
            " 4. al-Husayn ibn Muhammad ibn ‘Amir has narrated from Ahmad ibn Ishaq ibn Sa‘d from Su‘dan ibn Muslim from abu ‘Imara from a man from abu ‘Abdallah (a.s.) who has said the following. “When it was the night wherein Ali ibnhy (a.s.) would pass away he asked his Muhammad (a.s.), his son, “Son bring me water for Wudu (cleaning for prayer). Muhammad has said, “I then brought water for him.” He said, “I do not like this water. There is something dead in it.” I then brought the water in the light and found a dead mouse in it. I then brought him other water. He said, “Son this is the night in which I am promise to be taken out of this world. He explained his recommendations about his she camel and that a stable be prepared for her and that she is fed properly and I personally did so. Very shortly there after she came out of the stable and reached the grave, placed her neck on it, rolled her bodyon the ground and her eyes had become full of tears. Muhammad ibn Ali (a.s.) was informed that the she camel had gone. He came to her and said, “Control your emotion and get up, may Allah grant you good fortune. She would not do so. The Imam (a.s.) has said, “When he would take the camel to Makka, he would hang the whip from the luggage and would not use it until he would return to Madina.” The Imam (a.s.) has said, “Ali ibn al-Husayn (a.s.) would come out in the dark night with a sack containing Darahim and Dananir ( units of money) and would go door to door, knock them and gave a certain amount to the person that would come. When Ali ibn al-Husayn died these people would see the person with money and then they realized that Ali ibn al-Husayn (a.s.) must have been the distributor of money among them.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/11)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1267,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:117:6",
        "text": [
          "سَعْدُ بْنُ عَبْدِ اللَّهِ وَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْحِمْيَرِيُّ عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُبِضَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) وَ هُوَ ابْنُ سَبْعٍ وَ خَمْسِينَ سَنَةً فِي عَامِ خَمْسٍ وَ تِسْعِينَ عَاشَ بَعْدَ الْحُسَيْنِ خَمْساً وَ ثَلَاثِينَ سَنَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Sa’d Bin Abdullah and Abdullah Bin Ja’far Al Humeyri, from Ibrahim Bin Mahziyar, from his brother Ali Bin Mahziyar, from Al Husayn Bin Saeed, from Muhammad Bin Sinan, from Ibn Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> passed away and he<sup>asws</sup> was fifty-seven years old, during the year ninety-five (A.H.). He<sup>asws</sup> lived after Al-Husayn<sup>asws</sup> for thirty five years’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Ahmad has narrated from his uncle, ‘Abdallah ibn al-Salt from al-Hassan ibn Ali ibn bint al-Yahya’s who has said the following. “I hear abu al-Hassan (a.s.) say, ‘When Ali ibn al-Husayn (a.s.) was about ‘Uthman pass away he passed out then he opened his eyes and recited chapters 48 and 56 from the Holy Quran and said, “All praise belongs to Allah Who has fulfilled His promise to us and made us to inherit the earth passed out and chose from Paradise whatever we would like and thus, is the reward for those who work. Within the hour he passed away and did not say any thing.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور صحيح عند ي   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/12)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "part_type": "Hadith",
        "text": [
          " 6ـ سَعْدُ بْنُ عَبْدِ الله وَعَبْدُ الله بْنُ جَعْفَرٍ الْحِمْيَرِيُّ عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قُبِضَ عَلِيُّ بن الحسين (عَلَيْهما السَّلام) وَهُوَ ابْنُ سَبْعٍ وَخَمْسِينَ سَنَةً فِي عَامِ خَمْسٍ وَتِسْعِينَ عَاشَ بَعْدَ الْحُسَيْنِ خَمْساً وَثَلاثِينَ سَنَةً."
        ],
        "translations": {
          "en.sarwar": [
            " 6. Sa‘d ibn ‘Abdallah and ‘Abdallah ibn Ja‘far al-Himyari have narrated from Ibrahim ibn Mahziyar from his brother, Ali ibn Mahziyar from al-Husayn ibn Sa‘id from Muhammad ibn Sinan from ibn Muskan from abu Basir from abu ‘Abdallah (a.s.) who has said the following. “Ali ibn al-Husayn (a.s.) passed away at the age of fifty seven in the year ninety five. He lived for thirty five years after al-Husayn (a.s.).”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:117",
  "kind": "verse_list"
}