{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 118"
        },
        "path": "/books/al-kafi:1:4:118",
        "titles": {
          "ar": "باب مَوْلِدِ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام )",
          "en": "Chapter 118 – Arrival of Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>"
        }
      }
    ],
    "index": 176,
    "local_index": 118,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 119"
        },
        "path": "/books/al-kafi:1:4:119",
        "titles": {
          "ar": "باب مَوْلِدِ أَبِي عَبْدِ اللَّهِ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام )",
          "en": "Chapter 119 – Arrival of Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 117"
        },
        "path": "/books/al-kafi:1:4:117",
        "titles": {
          "ar": "باب مَوْلِدِ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )",
          "en": "Chapter 117 – Nazool (Arrival) of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:118",
    "titles": {
      "ar": "باب مَوْلِدِ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام )",
      "en": "Chapter 118 – Arrival of Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>"
    },
    "verse_count": 6,
    "verse_start_index": 1267,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1268,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:118:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عَبْدِ اللَّهِ بْنِ أَحْمَدَ عَنْ صَالِحِ بْنِ مَزْيَدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ أَبِي الصَّبَّاحِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَتْ أُمِّي قَاعِدَةً عِنْدَ جِدَارٍ فَتَصَدَّعَ الْجِدَارُ وَ سَمِعْنَا هَدَّةً شَدِيدَةً فَقَالَتْ بِيَدِهَا لَا وَ حَقِّ الْمُصْطَفَى مَا أَذِنَ اللَّهُ لَكَ فِي السُّقُوطِ فَبَقِيَ مُعَلَّقاً فِي الْجَوِّ حَتَّى جَازَتْهُ فَتَصَدَّقَ أَبِي عَنْهَا بِمِائَةِ دِينَارٍ ",
          "قَالَ أَبُو الصَّبَّاحِ وَ ذَكَرَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) جَدَّتَهُ أُمَّ أَبِيهِ يَوْماً فَقَالَ كَانَتْ صِدِّيقَةً لَمْ تُدْرَكْ فِي آلِ الْحَسَنِ امْرَأَةٌ مِثْلُهَا.",
          "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ أَحْمَدَ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Abdullah Bin Ahmad, from Salih Bin Mazeed, from Abdullah Bin Al Mugheira, from Abu Al Sabbah, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘My<sup>asws</sup> mother was seated by a wall, and the wall cracked, and we heard intense thuds (noise of the cracking). So, she<sup>asws</sup> said, ‘No, by Allah<sup>azwj</sup>, and right of Al-Mustafa<sup>saww</sup>! Allah<sup>azwj</sup> has not Permitted you for the falling!’ So (the wall) remained hanging in the atmosphere until she allowed it (to fall). So my<sup>asws</sup> father<sup>asws</sup> gave in charity one hundred Dinars on her<sup>asws</sup> behalf’. ",
            "Abu Al-Sabbah said, ‘And Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> mentioned his<sup style=\"font-weight: normal\">asws</sup> grandmother<sup style=\"font-weight: normal\">asws</sup>, the mother of his<sup style=\"font-weight: normal\">asws</sup> father, and he<sup style=\"font-weight: normal\">asws</sup> said: ‘She<sup style=\"font-weight: normal\">asws</sup> was truthful. No woman has been come across in the progeny of Al-Hassan<sup style=\"font-weight: normal\">asws</sup>, the like of her’. ",
            "Muhammad Bin Al-Hassan, from Abdullah Bin Ahmad – similar to it."
          ],
          "en.sarwar": [
            " Abu Ja‘far (a.s.) was born in the year seventy five AH. He passed away in the year one hundred fourteen at the age of fifty seven. He was buried in al-Baqi’ cemetery in Madina near the gave of his father, Ali ibn al-Husayn (a.s.). His mother was ’Umm ‘Abdallah daughter of al-Hassan ibn Ali ibn abu Talib, may Allah grant him and his rightly guided offspring blessings."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف بسنديه بعبدال بن أحم د   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/15)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1269,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:118:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الْأَنْصَارِيَّ كَانَ آخِرَ مَنْ بَقِيَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ وَ كَانَ رَجُلًا مُنْقَطِعاً إِلَيْنَا أَهْلَ الْبَيْتِ وَ كَانَ يَقْعُدُ فِي مَسْجِدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ مُعْتَجِرٌ بِعِمَامَةٍ سَوْدَاءَ وَ كَانَ يُنَادِي يَا بَاقِرَ الْعِلْمِ يَا بَاقِرَ الْعِلْمِ",
          "فَكَانَ أَهْلُ الْمَدِينَةِ يَقُولُونَ جَابِرٌ يَهْجُرُ فَكَانَ يَقُولُ لَا وَ اللَّهِ مَا أَهْجُرُ وَ لَكِنِّي سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ إِنَّكَ سَتُدْرِكُ رَجُلًا مِنِّي اسْمُهُ اسْمِي وَ شَمَائِلُهُ شَمَائِلِي يَبْقُرُ الْعِلْمَ بَقْراً فَذَاكَ الَّذِي دَعَانِي إِلَى مَا أَقُولُ",
          "قَالَ فَبَيْنَا جَابِرٌ يَتَرَدَّدُ ذَاتَ يَوْمٍ فِي بَعْضِ طُرُقِ الْمَدِينَةِ إِذْ مَرَّ بِطَرِيقٍ فِي ذَاكَ الطَّرِيقِ كُتَّابٌ فِيهِ مُحَمَّدُ بْنُ عَلِيٍّ فَلَمَّا نَظَرَ إِلَيْهِ قَالَ يَا غُلَامُ أَقْبِلْ فَأَقْبَلَ ثُمَّ قَالَ لَهُ أَدْبِرْ فَأَدْبَرَ ثُمَّ قَالَ شَمَائِلُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ الَّذِي نَفْسِي بِيَدِهِ يَا غُلَامُ مَا اسْمُكَ قَالَ اسْمِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ فَأَقْبَلَ عَلَيْهِ يُقَبِّلُ رَأْسَهُ وَ يَقُولُ بِأَبِي أَنْتَ وَ أُمِّي أَبُوكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُقْرِئُكَ السَّلَامَ وَ يَقُولُ ذَلِكَ",
          "قَالَ فَرَجَعَ مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ إِلَى أَبِيهِ وَ هُوَ ذَعِرٌ فَأَخْبَرَهُ الْخَبَرَ فَقَالَ لَهُ يَا بُنَيَّ وَ قَدْ فَعَلَهَا جَابِرٌ قَالَ نَعَمْ قَالَ الْزَمْ بَيْتَكَ يَا بُنَيَّ فَكَانَ جَابِرٌ يَأْتِيهِ طَرَفَيِ النَّهَارِ وَ كَانَ أَهْلُ الْمَدِينَةِ يَقُولُونَ وَا عَجَبَاهْ لِجَابِرٍ يَأْتِي هَذَا الْغُلَامَ طَرَفَيِ النَّهَارِ وَ هُوَ آخِرُ مَنْ بَقِيَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ ( صلى الله عليه وآله )",
          "فَلَمْ يَلْبَثْ أَنْ مَضَى عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) فَكَانَ مُحَمَّدُ بْنُ عَلِيٍّ يَأْتِيهِ عَلَى وَجْهِ الْكَرَامَةِ لِصُحْبَتِهِ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ فَجَلَسَ ( عليه السلام ) يُحَدِّثُهُمْ عَنِ اللَّهِ تَبَارَكَ وَ تَعَالَى فَقَالَ أَهْلُ الْمَدِينَةِ مَا رَأَيْنَا أَحَداً أَجْرَأَ مِنْ هَذَا ",
          "فَلَمَّا رَأَى مَا يَقُولُونَ حَدَّثَهُمْ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ أَهْلُ الْمَدِينَةِ مَا رَأَيْنَا أَحَداً قَطُّ أَكْذَبَ مِنْ هَذَا يُحَدِّثُنَا عَمَّنْ لَمْ يَرَهُ فَلَمَّا رَأَى مَا يَقُولُونَ حَدَّثَهُمْ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ فَصَدَّقُوهُ وَ كَانَ جَابِرُ بْنُ عَبْدِ اللَّهِ يَأْتِيهِ فَيَتَعَلَّمُ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Aban Bin Taghlub, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Jabir Bin Abdullah Al-Ansary was the last ones to remain, from the companions of Rasool-Allah<sup>saww</sup>, and he was a man who had cut himself off to us<sup>asws</sup>, the People<sup>asws</sup> of the Household, and he was sitting in the Masjid of Rasool-Allah<sup>saww</sup>, and he was turbaned with a black turban, and he was calling out, ‘يَا بَاقِرَ الْعِلْمِ يَا بَاقِرَ الْعِلْم’ ‘O expounder of the knowledge! O expounder of the knowledge! ",
            "And it was so that the people of Al-Medina were saying, ‘Jabir is hallucinating’. So he was saying, ‘No, by Allah<sup>azwj</sup>! I am not hallucinating. But, I heard Rasool-Allah<sup>saww</sup> saying: ‘You (Jabir) would be coming across a man from me<sup>saww</sup>, his<sup>asws</sup> name would be my<sup>saww</sup> name, and his<sup>asws</sup> mannerisms would be my<sup>saww</sup> mannerisms. He<sup>asws</sup> would expound the knowledge with an expansion’. So that is what is calling me to what I am saying’. ",
            "He<sup>asws</sup> said: ‘So while Jabir was walking around one day in one of the streets of Al-Median, when some scribes passed by in that street, among whom was Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>. So when he looked at him<sup>asws</sup>, he said, ‘O boy<sup>asws</sup>! Come!’ So, he<sup>asws</sup> came. Then he said, ‘By Allah<sup>azwj</sup>! The mannerisms of Rasool-Allah<sup>saww</sup>, by the One<sup>azwj</sup> in Whose Hand is my soul! O boy<sup>asws</sup>! What is your<sup>asws</sup> name?’ He<sup>asws</sup> said: ‘My<sup>asws</sup> name is Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>’. So he went faced him<sup>asws</sup>, and kissed his<sup>asws</sup> head and he was saying, ‘By my father and my mother be (sacrificed) for you<sup>asws</sup>! Your<sup>asws</sup> father Rasool-Allah<sup>saww</sup> conveys the greetings to you<sup>asws</sup> and he<sup>saww</sup> was saying (all) that’. ",
            "He<sup>asws</sup> said: ‘So Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> returned to his<sup>asws</sup> father<sup>asws</sup>, and he<sup>asws</sup> was alarmed, <span style=\"text-decoration: line-through\">So,</span> he<sup>asws</sup> informed him<sup>asws</sup> of the news. So, he<sup>asws</sup> said to him<sup>asws</sup>: ‘O my<sup>asws</sup> son<sup>asws</sup>, and Jabir did it?’ He<sup>asws</sup> said: ‘Yes’. He<sup>asws</sup> said: ‘Necessitated your<sup>asws</sup> house (stay at home), O my<sup>asws</sup> son!’ So Jabir used to come to him<sup>asws</sup> at both ends of the day, and the people of Al-Medina were saying, ‘O how strange of Jabir to come to this boy<sup>asws</sup> at both ends of the day, and he is the last one to remain from the companions of Rasool-Allah<sup>saww</sup>’. ",
            "It was not long before Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> passed away (martyred), and Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> used to go to him (Jabir Bin Abdullah) upon the aspect of the honour of his companionship to Rasool-Allah<sup>saww</sup>. He<sup>asws</sup> would sit and narrate to them (directly) from Allah<sup>azwj</sup> Blessed and High. The people of Al-Medina would say, ‘We have not seen anyone so audacious than this one’. ",
            "When he<sup>asws</sup> saw what they were saying, he<sup>asws</sup> narrated to them (directly) from Rasool-Allah<sup>saww</sup>. So, the people of Al-Medina said, ‘We have not seen anyone at all more lying than this one (Nouzobillah), narrating to us from the one<sup>saww</sup> he<sup>asws</sup> has not even seen. When he<sup>asws</sup> saw what they were saying, he<sup>asws</sup> narrated to them from Jabir Bin Abdullah. (In that way) they ratified him<sup>asws</sup>, and it was so that Jabir Bin Abdullah used to come to him<sup>asws</sup>, to learn from him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " Muhammad ibn al-Hassan has narrated from ‘Abdallah ibn Ahmad has narrated a similar hadith."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور صحيح عند ي  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1270,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:118:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُثَنًّى الْحَنَّاطِ عَنْ أَبِي بَصِيرٍ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقُلْتُ لَهُ أَنْتُمْ وَرَثَةُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ نَعَمْ قُلْتُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَارِثُ الْأَنْبِيَاءِ عَلِمَ كُلَّ مَا عَلِمُوا قَالَ لِي نَعَمْ قُلْتُ فَأَنْتُمْ تَقْدِرُونَ عَلَى أَنْ تُحْيُوا الْمَوْتَى وَ تُبْرِءُوا الْأَكْمَهَ وَ الْأَبْرَصَ قَالَ نَعَمْ بِإِذْنِ اللَّهِ ",
          "ثُمَّ قَالَ لِيَ ادْنُ مِنِّي يَا أَبَا مُحَمَّدٍ فَدَنَوْتُ مِنْهُ فَمَسَحَ عَلَى وَجْهِي وَ عَلَى عَيْنَيَّ فَأَبْصَرْتُ الشَّمْسَ وَ السَّمَاءَ وَ الْأَرْضَ وَ الْبُيُوتَ وَ كُلَّ شَيْ‏ءٍ فِي الْبَلَدِ ثُمَّ قَالَ لِي أَ تُحِبُّ أَنْ تَكُونَ هَكَذَا وَ لَكَ مَا لِلنَّاسِ وَ عَلَيْكَ مَا عَلَيْهِمْ يَوْمَ الْقِيَامَةِ أَوْ تَعُودَ كَمَا كُنْتَ وَ لَكَ الْجَنَّةُ خَالِصاً قُلْتُ أَعُودُ كَمَا كُنْتُ فَمَسَحَ عَلَى عَيْنَيَّ فَعُدْتُ كَمَا كُنْتُ ",
          "قَالَ فَحَدَّثْتُ ابْنَ أَبِي عُمَيْرٍ بِهَذَا فَقَالَ أَشْهَدُ أَنَّ هَذَا حَقٌّ كَمَا أَنَّ النَّهَارَ حَقٌّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Musna Al Hannat, from Abu Baseer who said, ",
            "‘I went over to Abu Ja’far<sup style=\"font-weight: normal\">asws</sup>, so I said to him<sup style=\"font-weight: normal\">asws</sup>, ‘You (Imams<sup style=\"font-weight: normal\">asws</sup>) are the inheritors of the Prophets<sup style=\"font-weight: normal\">saww</sup>?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes’. I said, ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> is an inheritor of the Prophets<sup style=\"font-weight: normal\">as</sup>, knowing everything what they<sup style=\"font-weight: normal\">as</sup> were knowing?’ He<sup style=\"font-weight: normal\">asws</sup> said to me: ‘Yes’. I said, ‘So you (Imams<sup style=\"font-weight: normal\">asws</sup>) are able upon reviving the death, and curing the blind and the leper?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes, by the Permission of Allah<sup style=\"font-weight: normal\">azwj</sup>’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said to me: ‘Approach me<sup style=\"font-weight: normal\">asws</sup>, O Abu Muhammad!’ So I approached him<sup style=\"font-weight: normal\">asws</sup>, and he<sup style=\"font-weight: normal\">asws</sup> wiped his<sup style=\"font-weight: normal\">asws</sup> hand upon my face and upon my eyes. So I visualised the sun, and the sky, and the earth, and the houses, and everything in the city. Then he<sup style=\"font-weight: normal\">asws</sup> said to me: ‘Would you love it to become like this, and for you would be what is for the people, and upon you would be what would be upon them on the Day of Judgment, or to return to just as you were, and for you would be the Paradise purely?’ I said, ‘To return to just as I was’. So he<sup style=\"font-weight: normal\">asws</sup> wiped upon my eyes, so I returned to just as I was’. ",
            "He (Abu Baseer) said, ‘So I narrated to Ibn Abu Umeyr with this, so he said, ‘I testify that this is true just as the day is true’."
          ],
          "en.sarwar": [
            " 2. A number of our people has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from Aban ibn Taghlib from abu ‘Abdallah (a.s.) who has said the following. “Jabir ibn‘Abdallah al-Ansari was last surviving of the companions of the Messenger of Allah. He was a devoted follower of us, Ahl al-Bayt. He would sit in the Mosque of the Messenger of Allah, wearing a black turban. He would call, “O Baqir al-‘Ilm, O Baqir al-‘Ilm, (a person of deep knowledge)” The people of Madina would say, “Jabir is hallucinating.” He would say, “No, by Allah, I do not hallucinate, but I heard the Messenger of Allah say, “You will soon meet a man from me whose name will be as my name and his manners would be as my manners. He will dig very deep in knowledge”’ This is what maakes me say what I say.” The Imam (a.s.) has said, “Jabir would still come and go and one day in one of the roads of Madina when passing he found a few of the school children among who Muhammad ibn Ali (a.s.) was also present (for a reason other than schooling. Imams are not heard of as attending schools). He looked at him and called him (Muhammad ibn Ali) to himself. The boy came to him and then he said, “Go back.” The boy went back. Then he said, “I swear by the One in Whose hand is my life, (that I see) manners as the manners of the Messenger of Allah. O boy, What is your name?” He replied, “My name is Muhammad ibn Ali ibn al-Husayn (a.s.). Jabir came forwards and began to kiss his head and say, “May Allah take my soul and the souls of my parents in service for your cause, your great-great grandfather told me to convey his greetings and Salam to you and would say all of that. The Imam (a.s.) has said, “Muhammad ibn Ali ibn al-Husayn came to his father and he was anxious. He explained to him about Jabir. His father asked, “Did Jabir really do this?” He replied, “Yes, he did so.” The Imam (a.s.) said, “My son, stay home (and do not expose yourself to the enemy because Jabir will maintain secrecy).” Jabir thereafter would come to him mornings and evenings and the people of Madina would say, “It is so strange that Jabir, the only surving companion of the Messenger of Allah would come to a boy on both ends of the day everyday.” Very shortly Ali ibn al-Husayn (a.s.) passed away Muhammad ibn Ali (a.s.) would go to visit Jabir out of respect for his being a companion of the Messenger of Allah and would speak to people from Allah, the Most Holy, the Most High. The people of madina would say, “We have not seen anyone as bold as he is.” On hearing this from them he began to speak to them from the Messenger of Allah. The people of Madina began to say, “We have not seen a greater liar as he is because he speaks from one whom he has never seen.” On hearing this from them he began to narrate to them from Jabir. The Imam (a.s.) has said, “They would accept what he would narrate from Jabir ibn ‘Abdallah. However, Jabir would come to him and would from him (Muhammad ibn ali ibn al-Husayn (a.s.)).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1271,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:118:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كُنْتُ عِنْدَهُ يَوْماً إِذْ وَقَعَ زَوْجُ وَرَشَانَ عَلَى الْحَائِطِ وَ هَدَلَا هَدِيلَهُمَا فَرَدَّ أَبُو جَعْفَرٍ ( عليه السلام ) عَلَيْهِمَا كَلَامَهُمَا سَاعَةً ثُمَّ نَهَضَا فَلَمَّا طَارَا عَلَى الْحَائِطِ هَدَلَ الذَّكَرُ عَلَى الْأُنْثَى سَاعَةً ثُمَّ نَهَضَا ",
          "فَقُلْتُ جُعِلْتُ فِدَاكَ مَا هَذَا الطَّيْرُ قَالَ يَا ابْنَ مُسْلِمٍ كُلُّ شَيْ‏ءٍ خَلَقَهُ اللَّهُ مِنْ طَيْرٍ أَوْ بَهِيمَةٍ أَوْ شَيْ‏ءٍ فِيهِ رُوحٌ فَهُوَ أَسْمَعُ لَنَا وَ أَطْوَعُ مِنِ ابْنِ آدَمَ إِنَّ هَذَا الْوَرَشَانَ ظَنَّ بِامْرَأَتِهِ فَحَلَفَتْ لَهُ مَا فَعَلْتُ فَقَالَتْ تَرْضَى بِمُحَمَّدِ بْنِ عَلِيٍّ فَرَضِيَا بِي فَأَخْبَرْتُهُ أَنَّهُ لَهَا ظَالِمٌ فَصَدَّقَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Al Husayn, from Muhammad Bin Ali, from Aasim Bin Humeyd, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘We were in his<sup>asws</sup> presence one day when a pair of wood pigeons settled upon the wall and cooed their cooing’s. Abu Ja’far<sup>asws</sup> responded upon them with their speech for a while. Then they rushed off. when they flew upon the wall, the male cooed to the female for a while, then they both flew away. ",
            "So I said, ‘May I be sacrificed for you<sup>asws</sup>! What are these birds (saying)?’ He<sup>asws</sup> said: ‘O Ibn Muslim! Everything Allah<sup>azwj</sup> Created from the birds, or beasts, something in which is a spirit, so it would listen to us<sup>asws</sup> and would be more obedient than the children of Adam<sup>asws</sup>. This pigeon was suspicious with his wife, so she swore an oath to him that she had not done (anything wrong), and she said, ‘Would you be pleased with Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> (as an arbitrator)?’ So they were both pleased with me<sup>asws</sup>, and I informed him that he is being unjust to her, so he ratified her’."
          ],
          "en.sarwar": [
            " 3. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-Muthanna al-Hannat from abu Basir who has said the following. “Once I went to see abu Ja‘far (a.s.) and asked him, “Are you the heirs of the Messenger of Allah?” He said, “Yes, we are his heirs.” I then asked, “Was the Messenger of Allah the heir of the prophets and knew all that they knew?” He said to me, “Yes, it is true.” I then asked, “Do you have the power to bring the dead back to life and cure the lepers, and the blind?” He said, “Yes, we do have such powers by the permission of Allah.” The he said to me, “Come closer to me, O abu Muhammad.” I went closer to him and he rubbed my face and my eyes and saw the sun, the skies, the earth, the houses and all things in the town. Then he said to me, “Do you like to live this way and will have what others have and be responsible for whatever they will be held responsible on the Day of Judgment or like to live as before and will have paradise purely?” I said, “I would like to live as I lived before.” He rubbed my eyes and I found myself as before.” The narrator has said that he told it to ibn abu ‘Umayr who said, “I testify that this is true just as the day is true.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1272,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:118:5",
        "refs": {
          "Quran": [
            "/books/quran:7:128",
            "/books/quran:11:86"
          ]
        },
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ صَالِحِ بْنِ حَمْزَةَ عَنْ أَبِيهِ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ لَمَّا حُمِلَ أَبُو جَعْفَرٍ ( عليه السلام ) إِلَى الشَّامِ إِلَى هِشَامِ بْنِ عَبْدِ الْمَلِكِ وَ صَارَ بِبَابِهِ قَالَ لِأَصْحَابِهِ وَ مَنْ كَانَ بِحَضْرَتِهِ مِنْ بَنِي أُمَيَّةَ إِذَا رَأَيْتُمُونِي قَدْ وَبَّخْتُ مُحَمَّدَ بْنَ عَلِيٍّ ثُمَّ رَأَيْتُمُونِي قَدْ سَكَتُّ فَلْيُقْبِلْ عَلَيْهِ كُلُّ رَجُلٍ مِنْكُمْ فَلْيُوَبِّخْهُ ثُمَّ أَمَرَ أَنْ يُؤْذَنَ لَهُ",
          "فَلَمَّا دَخَلَ عَلَيْهِ أَبُو جَعْفَرٍ ( عليه السلام ) قَالَ بِيَدِهِ السَّلَامُ عَلَيْكُمْ فَعَمَّهُمْ جَمِيعاً بِالسَّلَامِ ثُمَّ جَلَسَ فَازْدَادَ هِشَامٌ عَلَيْهِ حَنَقاً بِتَرْكِهِ السَّلَامَ عَلَيْهِ بِالْخِلَافَةِ وَ جُلُوسِهِ بِغَيْرِ إِذْنٍ فَأَقْبَلَ يُوَبِّخُهُ وَ يَقُولُ فِيمَا يَقُولُ لَهُ يَا مُحَمَّدَ بْنَ عَلِيٍّ لَا يَزَالُ الرَّجُلُ مِنْكُمْ قَدْ شَقَّ عَصَا الْمُسْلِمِينَ وَ دَعَا إِلَى نَفْسِهِ وَ زَعَمَ أَنَّهُ الْإِمَامُ سَفَهاً وَ قِلَّةَ عِلْمٍ وَ وَبَّخَهُ بِمَا أَرَادَ أَنْ يُوَبِّخَهُ",
          "فَلَمَّا سَكَتَ أَقْبَلَ عَلَيْهِ الْقَوْمُ رَجُلٌ بَعْدَ رَجُلٍ يُوَبِّخُهُ حَتَّى انْقَضَى آخِرُهُمْ فَلَمَّا سَكَتَ الْقَوْمُ نَهَضَ ( عليه السلام ) قَائِماً ثُمَّ قَالَ أَيُّهَا النَّاسُ أَيْنَ تَذْهَبُونَ وَ أَيْنَ يُرَادُ بِكُمْ بِنَا هَدَى اللَّهُ أَوَّلَكُمْ وَ بِنَا يَخْتِمُ آخِرَكُمْ فَإِنْ يَكُنْ لَكُمْ مُلْكٌ مُعَجَّلٌ فَإِنَّ لَنَا مُلْكاً مُؤَجَّلًا وَ لَيْسَ بَعْدَ مُلْكِنَا مُلْكٌ لِأَنَّا أَهْلُ الْعَاقِبَةِ يَقُولُ اللَّهُ عَزَّ وَ جَلَّ وَ الْعاقِبَةُ لِلْمُتَّقِينَ ",
          "فَأَمَرَ بِهِ إِلَى الْحَبْسِ فَلَمَّا صَارَ إِلَى الْحَبْسِ تَكَلَّمَ فَلَمْ يَبْقَ فِي الْحَبْسِ رَجُلٌ إِلَّا تَرَشَّفَهُ وَ حَنَّ إِلَيْهِ فَجَاءَ صَاحِبُ الْحَبْسِ إِلَى هِشَامٍ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي خَائِفٌ عَلَيْكَ مِنْ أَهْلِ الشَّامِ أَنْ يَحُولُوا بَيْنَكَ وَ بَيْنَ مَجْلِسِكَ هَذَا ثُمَّ أَخْبَرَهُ بِخَبَرِهِ فَأَمَرَ بِهِ فَحُمِلَ عَلَى الْبَرِيدِ هُوَ وَ أَصْحَابُهُ لِيُرَدُّوا إِلَى الْمَدِينَةِ وَ أَمَرَ أَنْ لَا يُخْرَجَ لَهُمُ الْأَسْوَاقُ وَ حَالَ بَيْنَهُمْ وَ بَيْنَ الطَّعَامِ وَ الشَّرَابِ",
          "فَسَارُوا ثَلَاثاً لَا يَجِدُونَ طَعَاماً وَ لَا شَرَاباً حَتَّى انْتَهَوْا إِلَى مَدْيَنَ فَأُغْلِقَ بَابُ الْمَدِينَةِ دُونَهُمْ فَشَكَا أَصْحَابُهُ الْجُوعَ وَ الْعَطَشَ قَالَ فَصَعِدَ جَبَلًا لِيُشْرِفَ عَلَيْهِمْ فَقَالَ بِأَعْلَى صَوْتِهِ يَا أَهْلَ الْمَدِينَةِ الظَّالِمِ أَهْلُهَا أَنَا بَقِيَّةُ اللَّهِ يَقُولُ اللَّهُ بَقِيَّتُ اللَّهِ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ وَ ما أَنَا عَلَيْكُمْ بِحَفِيظٍ",
          "قَالَ وَ كَانَ فِيهِمْ شَيْخٌ كَبِيرٌ فَأَتَاهُمْ فَقَالَ لَهُمْ يَا قَوْمِ هَذِهِ وَ اللَّهِ دَعْوَةُ شُعَيْبٍ النَّبِيِّ وَ اللَّهِ لَئِنْ لَمْ تُخْرِجُوا إِلَى هَذَا الرَّجُلِ بِالْأَسْوَاقِ لَتُؤْخَذُنَّ مِنْ فَوْقِكُمْ وَ مِنْ تَحْتِ أَرْجُلِكُمْ فَصَدِّقُونِي فِي هَذِهِ الْمَرَّةِ وَ أَطِيعُونِي وَ كَذِّبُونِي فِيمَا تَسْتَأْنِفُونَ فَإِنِّي لَكُمْ نَاصِحٌ",
          "قَالَ فَبَادَرُوا فَأَخْرَجُوا إِلَى مُحَمَّدِ بْنِ عَلِيٍّ وَ أَصْحَابِهِ بِالْأَسْوَاقِ فَبَلَغَ هِشَامَ بْنَ عَبْدِ الْمَلِكِ خَبَرُ الشَّيْخِ فَبَعَثَ إِلَيْهِ فَحَمَلَهُ فَلَمْ يُدْرَ مَا صَنَعَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Asbat, from Salih Bin Hamza, from his father, from Abu Bakr Al Hazramy who said, ",
            "‘When Abu Ja’far<sup>asws</sup> was carried to Syria to Hisham Bin Abdul Malik and came to his door, he said to his companions, the ones who were in his presence from the Clan of Umayya, ‘When you all see me to have rebuked Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>, then you see me to be silent, so let every man from you speak against him<sup>asws</sup>, so let him rebuke him<sup>asws</sup>’. Then he ordered to permit for him<sup>asws</sup> (to enter). ",
            "When Abu Ja’far<sup>asws</sup> came over to him, he<sup>asws</sup> said: ‘The greetings be upon you all’, by the gesture of his<sup>asws</sup> hand, and generalised them all with the greetings. Then he<sup>asws</sup> was seated. Hisham increased the resentment upon him<sup>asws</sup> for his<sup>asws</sup> neglecting the greetings upon him with the Caliphate, and his<sup>asws</sup> sitting down without his permission. He turned to face him<sup>asws</sup> and he was saying, among what he was saying, ‘O Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>! The man from among you (Imams<sup>asws</sup>) does not cease to cause cracks in the staff of the Muslims and calling to himself<sup>asws</sup> and claims that he<sup>asws</sup> is the Imam<sup>asws</sup> of the foolish ones, and of little knowledge!’ And he rebuked him<sup>asws</sup> with whatever he intended to rebuke him<sup>asws</sup>. ",
            "When he was silent, the group of people turned to face him, man after a man, rebuking him<sup>asws</sup> until the last of them terminated. When the group of people were silent, he<sup>asws</sup> rushed standing up, then said: ‘O you people! Where are you going? And where are you intending to be? By us<sup>asws</sup> Allah<sup>azwj</sup> Guided your former ones and by us<sup>asws</sup> would end your later ones. So, if there happens to be a kingdom for you at the moment, so for us<sup>asws</sup> would be a kingdom in the future, and there wouldn’t be a kingdom after our<sup>asws</sup> kingdom, because we<sup>asws</sup> are the people of the end-of-time. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h128\">[7:128]</a> and the end is for those who are pious</span>’. ",
            "He (Caliph Hisham) ordered with him<sup>asws</sup> to the prison. When he<sup>asws</sup> came to be in the prison, he<sup>asws</sup> spoke, and there did not remain a man in the prison except that he sympathised with him<sup>asws</sup> and inclined towards him<sup>asws</sup>. So the warden of the prison went over to Hisham and he said, ‘O commander of the faithful! I am fearing upon you from the people of Syria that they would overturn between you and this gathering of yours’. Then he informed him with his<sup>asws</sup> news. He ordered with him<sup>asws</sup> to be carried upon the transport camels, him<sup>asws</sup> and his<sup>asws</sup> companions, in order to be returned to Al-Medina, and he ordered that the markets (commodities) do not be brought out to them, and there be a hindrance between them and the food and the drinks.",
            "So they travelled for three (days), neither finding any food nor water, until they ended up to Madayn, but the doors of the city were closed to them. His<sup>asws</sup> companions complained of the hunger and the thirst, so he<sup>asws</sup> ascended a hill in order to overlook upon them, and he<sup>asws</sup> said at the top of his<sup>asws</sup> voice: ‘O people of the city, the unjust ones being its inhabitants! I<sup>asws</sup> am the remaining one of Allah<sup>azwj</sup>. Allah<sup>azwj</sup> is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h86\">[11:86]</a> What remains of Allah is better for you if you are Momineen, and I am not a keeper over you</span>’. ",
            "He (the narrator) said, ‘And among them there was an old man. He went over to them (the people of the city) and said to them, ‘O group of people! By Allah<sup>azwj</sup>, this is the calling of Shuayb<sup>as</sup> the Prophet<sup>as</sup>. By Allah<sup>azwj</sup>! If you do not go out to this man with the commodities, you would be seized from your above and from below your feet, therefore ratify me during this time, and obey me, and you can belie me regarding what you are carrying, for I am a (sincere) adviser to you all’. ",
            "He (the narrator) said, ‘So they came out to Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> and his<sup>asws</sup> companions with the commodities and the news of the old man reached Hisham Bin Abdul Malik. Hee sent (people) to him (the old man), and they attacked him, and it is not known what they did with him’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Muhammad ibn al-Husayn from Muhammad ibn Ali from ‘Asim ibn Hamid from Muhammad ibn Muslim who has said the following. “One day I was in the presence of abu Ja‘far (a.s.) that a pair of turtledove came and sat on the wall and exchanged voices as they usually do. Abu Ja‘far (a.s.) then also exchanged voices with them for a while. They then flew away and on the other wall the male sounded to the fame for a while and then both of them flew away. I then asked The Imam (a.s.), “May Allah take my soul in service for your cause, “What were these birds?” The Imam (a.s.) said, “O ibn Muslim, all that Allah has created, such as birds, animals or other things that have life they obey us better than people. The male dove was suspicious about the female and she denied it on oath which the male did not accept. Then she asked if he would abide by the decision of Muhammad ibn Ali? He agreed and told him that he had wronged his pair then he believed her.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1273,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:118:6",
        "refs": {
          "Quran": [
            "/books/quran:7:128",
            "/books/quran:11:86"
          ]
        },
        "text": [
          "سَعْدُ بْنُ عَبْدِ اللَّهِ وَ الْحِمْيَرِيُّ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُبِضَ مُحَمَّدُ بْنُ عَلِيٍّ الْبَاقِرُ وَ هُوَ ابْنُ سَبْعٍ وَ خَمْسِينَ سَنَةً فِي عَامِ أَرْبَعَ عَشْرَةَ وَ مِائَةٍ عَاشَ بَعْدَ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) تِسْعَ عَشْرَةَ سَنَةً وَ شَهْرَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sa’d Bin Abdullah and Al Himeyri, altogether from Ibrahim Bin Mahziyar, from his brother Ali Bin Mahziyar, from Al Husayn Bin Saeed, from Muhammad Bin Sinan, from Ibn Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Muhammad<sup>asws</sup> Bin Ali Al-Baqir<sup>asws</sup> passed away and he<sup>asws</sup> was fifty seven years old, during the year one hundred and twenty four. He<sup>asws</sup> lived after Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> for nineteen years and two months’."
          ],
          "en.sarwar": [
            " 5. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ali ibn Asbat from Salih ibn Hamza from his father from abu Bakr al-Hadrami who has said the following. “When abu Ja‘far (a.s.) was taken to al-Sham (Damascus) to the court of hisham ibn ‘Abd al-Malik. When arrived at his door he (Hisham) instructed his people from the Amawids, “When I will finish exasperating Muhammad ibn Ali (a.s.) and stop then each of you one after the other should reprimand and level blames on him.” He then ordered to allow Muhammad ibn Ali to come to his presence. When abu Ja‘far (a.s.) arrived he made a gesture with his hand to all of them and offered a general greeting. He then sat down. This increased the disappointment of Hisham because he did not he did not address him as the caliph and sat down without his permission. Hisham then began to reprimand and scold him and said to him among other things, “O Muhammad ibn Ali, why is it that one or the other from cause disunity among the Muslims and call people to follow him thinking that he is the Imam because of his ignorance and foolishness. He scolded him as much as he wanted. When he became quite others one after the other began to annoy and nag him. When they all became quite, he rose and stood up and said, “O people, what is that you want and where are you headed? Through us, Allah granted you guidance to the first one of you and through us the last of you can receive guidance. If you have a temporary power to us belongs the future power and there will be no power after our power because to us belong the consequences as Allah, the Most Majestic, the Most gracious, has said, “The final victory is for the pious ones.” <a href=\"/#/books/quran:7#h128\">[7:128]</a>.” He ordered to imprison him. In the prison to whoever that he spoke he would sympathize with him. The guard came to Hisham and said, “O Amir al-Mu’minin, I am afraid for from the people al-Sham (Damascus). They may remove you from this position. He gave him the full report. Hisham then ordered to escort the Imam (a.s.) and his people to Madina. He ordered his people not to allow the Imam and his people to go to marketplaces. They were denied food and water. They traveled three days without food and water until they arrived at Madyan. They were left behind the locked doors therein. People of the Imam complained to him for hanger and thirst. The Imam (a.s.) has said the he then climbed a hill above them and said loudly, “O people of Madyan, the town of unjust people. I am Baqiyat Allah (the power that Allah has kept in reserve) as He has said, “If you are true believers then know that the profit (the reserved power) which God has left for you is better for you (than what you may gain through deceitful ways). I am not responsible for your deeds.” <a href=\"/#/books/quran:11#h86\">[11:86]</a> The Imam (a.s.) has said that among them there was an old man who went to them (people of the town) and said, “By Allah, this is the call of Shu‘ayb the Prophet of Allah. If you would not go to this man in the marketplaces, you will be seized from the above and below. Believe me and obey me this time but you may reject me next time. I am giving you a good advise.” The Imam (a.s.) has said, ‘They came out quickly to Muhammad ibn Ali (a.s.) and his people in the marketplace. The news reached Hisham ibn ‘Abd al-Malik who summoned the old man and he was taken to the court but it is not known what did he do to him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/25)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "part_type": "Hadith",
        "text": [
          " 6ـ سَعْدُ بْنُ عَبْدِ الله وَالْحِمْيَرِيُّ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قُبِضَ مُحَمَّدُ بْنُ عَلِيٍّ الْبَاقِرُ وَهُوَ ابْنُ سَبْعٍ وَخَمْسِينَ سَنَةً فِي عَامِ أَرْبَعَ عَشْرَةَ وَمِائَةٍ عَاشَ بَعْدَ عَلِيِّ بن الحسين (عَلَيْهما السَّلام) تِسْعَ عَشْرَةَ سَنَةً وَشَهْرَيْنِ."
        ],
        "translations": {
          "en.sarwar": [
            " 6. Sa‘d. ibn ‘Abdallah and al-Himyari all have narrated from Ibrahim ibn Mahziyar from his brother, ali ibn Mhaziyar from al-Husayn ibn Sa‘id from Muhammad ibn Sinan from ibn Muskan from abu Basir from abu ‘Abdallah who has said the following. “Muhammad ibn Ali al-Baqir passed away at the age of fifty seven, in the year one hundred fourteen AH. He lived for nineteen years and two months after Ali ibn al-Husayn (a.s.).”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:118",
  "kind": "verse_list"
}