{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 119"}, "path": "/books/al-kafi:1:4:119", "titles": {"ar": "باب مَوْلِدِ أَبِي عَبْدِ اللَّهِ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام )", "en": "Chapter 119 – Arrival of Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>"}}], "index": 177, "local_index": 119, "part_type": "Chapter", "path": "/books/al-kafi:1:4:119", "titles": {"ar": "باب مَوْلِدِ أَبِي عَبْدِ اللَّهِ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام )", "en": "Chapter 119 – Arrival of Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>"}, "verse_count": 8, "verse_start_index": 1273, "verses": [{"index": 1274, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:119:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ أَحْمَدَ عَنْ إِبْرَاهِيمَ بْنِ الْحَسَنِ قَالَ حَدَّثَنِي وَهْبُ بْنُ حَفْصٍ عَنْ إِسْحَاقَ بْنِ جَرِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ سَعِيدُ بْنُ الْمُسَيَّبِ وَ الْقَاسِمُ بْنُ مُحَمَّدِ بْنِ أَبِي بَكْرٍ وَ أَبُو خَالِدٍ الْكَابُلِيُّ مِنْ ثِقَاتِ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ وَ كَانَتْ أُمِّي مِمَّنْ آمَنَتْ وَ اتَّقَتْ وَ أَحْسَنَتْ وَ اللَّهُ يُحِبُّ الْمُحْسِنِينَ \nقَالَ وَ قَالَتْ أُمِّي قَالَ أَبِي يَا أُمَّ فَرْوَةَ إِنِّي لَأَدْعُو اللَّهَ لِمُذْنِبِي شِيعَتِنَا فِي الْيَوْمِ وَ اللَّيْلَةِ أَلْفَ مَرَّةٍ لِأَنَّا نَحْنُ فِيمَا يَنُوبُنَا مِنَ الرَّزَايَا نَصْبِرُ عَلَى مَا نَعْلَمُ مِنَ الثَّوَابِ وَ هُمْ يَصْبِرُونَ عَلَى مَا لَا يَعْلَمُونَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Abdullah Bin Ahmad, from Ibrahim Bin Al Hassan who said, ‘Wahab Bin Hafs narrated to me, from Is’haq Bin Jareer who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘It was so that Saeed Bin Al-Musayyab, and Al-Qasim Bin Muhammad Bin Abul Bakr, and Abu Khalid Al-Kabuly were from the reliable ones of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>. And it was so that my<sup>asws</sup> mother was from the ones who believed, and was pious and a good doer, and <span class=\"ibTxt\">[2:195] surely Allah loves the doers of good</span>’.\nHe<sup>asws</sup> said: ‘And my<sup>asws</sup> mother said that my<sup>asws</sup> father<sup>asws</sup> said: ‘O Umm Farwa! I I<sup>asws</sup> tend to supplicate to Allah<sup>azwj</sup> for the sins of our<sup>asws</sup> Shias during the day and the night, a thousand times, because we<sup>asws</sup>, regarding what we<sup>asws</sup> face from the deprivations. We<sup>asws</sup> observe patience upon what we<sup>asws</sup> know from the Rewards, and they are being patient upon what they are unaware of’."}]}, {"index": 1275, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:119:2", "text": "بَعْضُ أَصْحَابِنَا عَنِ ابْنِ جُمْهُورٍ عَنْ أَبِيهِ عَنْ سُلَيْمَانَ بْنِ سَمَاعَةَ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ وَجَّهَ أَبُو جَعْفَرٍ الْمَنْصُورُ إِلَى الْحَسَنِ بْنِ زَيْدٍ وَ هُوَ وَالِيهِ عَلَى الْحَرَمَيْنِ أَنْ أَحْرِقْ عَلَى جَعْفَرِ بْنِ مُحَمَّدٍ دَارَهُ فَأَلْقَى النَّارَ فِي دَارِ أَبِي عَبْدِ اللَّهِ فَأَخَذَتِ النَّارُ فِي الْبَابِ وَ الدِّهْلِيزِ فَخَرَجَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَتَخَطَّى النَّارَ وَ يَمْشِي فِيهَا وَ يَقُولُ أَنَا ابْنُ أَعْرَاقِ الثَّرَى أَنَا ابْنُ إِبْرَاهِيمَ خَلِيلِ اللَّهِ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Some of our companions, from Ibn Jamhour, from his father, from Suleyman Bin Sama’at, from Abdullah Bin Al Qasim, from Al Mufazzal Bin Umar who said, \n‘Abu Ja’far Al-Mansour (the Caliph) directed Al-Hassan Bin Zayd, and he was his governor upon the two <span class=\"iTxt\">Harrums</span> (in Makkah and Al-Medina), that he burn down upon Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>, his<sup>asws</sup> house. So, he cast the fire in the house of Abu Abdullah<sup>asws</sup>, and the fire took hold in the door and the corridor. Abu Abdullah<sup>asws</sup> came out skipping the fire and walking in it, and he<sup>asws</sup> was saying: ‘I<sup>asws</sup> am the son<sup>asws</sup> of ‘<span class=\"iTxt\">A’araq Al-Sara</span>’ (Ismail<sup>as</sup>)! I<sup>asws</sup> am the son<sup>asws</sup> of Ibrahim<sup>as</sup>, Friend of Allah<sup>azwj</sup>!’"}]}, {"index": 1276, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:119:3", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْبَرْقِيِّ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ رُفَيْدٍ مَوْلَى يَزِيدَ بْنِ عَمْرِو بْنِ هُبَيْرَةَ قَالَ سَخِطَ عَلَيَّ ابْنُ هُبَيْرَةَ وَ حَلَفَ عَلَيَّ لَيَقْتُلُنِي فَهَرَبْتُ مِنْهُ وَ عُذْتُ بِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَأَعْلَمْتُهُ خَبَرِي فَقَالَ لِيَ انْصَرِفْ وَ أَقْرِئْهُ مِنِّي السَّلَامَ وَ قُلْ لَهُ إِنِّي قَدْ آجَرْتُ عَلَيْكَ مَوْلَاكَ رُفَيْداً فَلَا تَهِجْهُ بِسُوءٍ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ شَامِيٌّ خَبِيثُ الرَّأْيِ فَقَالَ اذْهَبْ إِلَيْهِ كَمَا أَقُولُ لَكَ فَأَقْبَلْتُ\nفَلَمَّا كُنْتُ فِي بَعْضِ الْبَوَادِي اسْتَقْبَلَنِي أَعْرَابِيٌّ فَقَالَ أَيْنَ تَذْهَبُ إِنِّي أَرَى وَجْهَ مَقْتُولٍ ثُمَّ قَالَ لِي أَخْرِجْ يَدَكَ فَفَعَلْتُ فَقَالَ يَدُ مَقْتُولٍ ثُمَّ قَالَ لِي أَبْرِزْ رِجْلَكَ فَأَبْرَزْتُ رِجْلِي فَقَالَ رِجْلُ مَقْتُولٍ ثُمَّ قَالَ لِي أَبْرِزْ جَسَدَكَ فَفَعَلْتُ فَقَالَ جَسَدُ مَقْتُولٍ ثُمَّ قَالَ لِي أَخْرِجْ لِسَانَكَ فَفَعَلْتُ فَقَالَ لِيَ امْضِ فَلَا بَأْسَ عَلَيْكَ فَإِنَّ فِي لِسَانِكَ رِسَالَةً لَوْ أَتَيْتَ بِهَا الْجِبَالَ الرَّوَاسِيَ لَانْقَادَتْ لَكَ\nقَالَ فَجِئْتُ حَتَّى وَقَفْتُ عَلَى بَابِ ابْنِ هُبَيْرَةَ فَاسْتَأْذَنْتُ فَلَمَّا دَخَلْتُ عَلَيْهِ قَالَ أَتَتْكَ بِحَائِنٍ رِجْلَاهُ يَا غُلَامُ النَّطْعَ وَ السَّيْفَ ثُمَّ أَمَرَ بِي فَكُتِّفْتُ وَ شُدَّ رَأْسِي وَ قَامَ عَلَيَّ السَّيَّافُ لِيَضْرِبَ عُنُقِي فَقُلْتُ أَيُّهَا الْأَمِيرُ لَمْ تَظْفَرْ بِي عَنْوَةً وَ إِنَّمَا جِئْتُكَ مِنْ ذَاتِ نَفْسِي وَ هَاهُنَا أَمْرٌ أَذْكُرُهُ لَكَ ثُمَّ أَنْتَ وَ شَأْنَكَ\nفَقَالَ قُلْ فَقُلْتُ أَخْلِنِي فَأَمَرَ مَنْ حَضَرَ فَخَرَجُوا فَقُلْتُ لَهُ جَعْفَرُ بْنُ مُحَمَّدٍ يُقْرِئُكَ السَّلَامَ وَ يَقُولُ لَكَ قَدْ آجَرْتُ عَلَيْكَ مَوْلَاكَ رُفَيْداً فَلَا تَهِجْهُ بِسُوءٍ فَقَالَ وَ اللَّهِ لَقَدْ قَالَ لَكَ جَعْفَرُ بْنُ مُحَمَّدٍ هَذِهِ الْمَقَالَةَ وَ أَقْرَأَنِي السَّلَامَ فَحَلَفْتُ لَهُ فَرَدَّهَا عَلَيَّ ثَلَاثاً ثُمَّ حَلَّ أَكْتَافِي ثُمَّ قَالَ لَا يُقْنِعُنِي مِنْكَ حَتَّى تَفْعَلَ بِي مَا فَعَلْتُ بِكَ قُلْتُ مَا تَنْطَلِقُ يَدِي بِذَاكَ وَ لَا تَطِيبُ بِهِ نَفْسِي فَقَالَ وَ اللَّهِ مَا يُقْنِعُنِي إِلَّا ذَاكَ فَفَعَلْتُ بِهِ كَمَا فَعَلَ بِي وَ أَطْلَقْتُهُ فَنَاوَلَنِي خَاتَمَهُ وَ قَالَ أُمُورِي فِي يَدِكَ فَدَبِّرْ فِيهَا مَا شِئْتَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Barqy, from his father, from the one who mentioned it, from Rufeyd, a slave of Yazeed Bin Amro Bin Hubeyra who said, \n‘Ibn Ubeyra was angry upon me and swore against me that he would kill me. So I fled from him and sought refuge with Abu Abdullah<sup>asws</sup>, and I let him know of my compulsion. So he<sup>asws</sup> said to me: ‘Leave, and convey the greetings to him from me<sup>asws</sup>, and say to him that I<sup>asws</sup> have undertook upon you (to protect) your slave Rufeyd, therefore do not approach him with evil’. So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! He is a Syrian, of bad views’. So he<sup>asws</sup> said: ‘Go to him just as I<sup>asws</sup> am saying to you’. So I returned.\nWhen I was in one of the valleys, a Bedouin faced me and he said, ‘Where are you going? I see a face of a killed one’. Then he said to me, ‘Bring out your hand’. So I did, and he said, ‘A hand of a killed one’. Then he said to me, ‘Bring forward your leg’. So I brought my leg forward, and he said, ‘A leg of a killed one’. Then he said to me, ‘Bring forward your body towards me’. So I did, and he said, ‘A body of a killed one’. Then he said to me, ‘Bring out your tongue’. So I did, and he said to me, ‘Carry on, for there is no evil upon you, for in your tongue is a message. If you were to go with it to the tall mountain, it would be in obedience to you’. \nHe (the narrator) said, ‘So I went until I paused upon the door of Ibn Hubeyra and sought permission. When I came over to him, he said, ‘The traitor comes over on his own legs. O slave! (Bring me) the leather cords and the sword!’ Then he ordered with me, so I was bound and my head held tight, and the swordsman stood over me to strike my neck off. So I said, ‘O you Emir! You did not overcome me by force, and rather I came over to you from my own self, and over here there is a matter I want to mention to you, then it would be you and your business (whatever you want to do)’. \nHe said, ‘Speak’. So I said, ‘Isolate with me’. He instructed the ones present, and they went out, and I said to him, ‘Ja’far<sup style=\"font-weight: normal\">asws</sup> Bin Muhammad<sup style=\"font-weight: normal\">asws</sup> conveys the greetings to you and is saying to you: ‘I<sup style=\"font-weight: normal\">asws</sup> have undertaken upon you, your slave Rufeyda, therefore do no approach him with evil’. So he said, ‘By Allah<sup style=\"font-weight: normal\">azwj</sup>, Ja’far<sup style=\"font-weight: normal\">asws</sup> Bin Muhammad<sup style=\"font-weight: normal\">asws</sup> said these words to you, and conveyed the greetings to me?’ So I swore on oath to him, and he reiterated it thrice upon me. Then he freed my ropes, then said, ‘I will not be content from you until you do with me what I did with you’. I said, ‘My hand will not go with (doing) that, nor will my self be good with it’. So he said, ‘By Allah<sup style=\"font-weight: normal\">azwj</sup>! I will not be contented except with that’. So I did with him just as he had done with me and I untied him. So he gave me his seal and said, ‘My affairs are in your hands, therefore manage these as you so desire to’."}]}, {"index": 1277, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:119:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنِ الْخَيْبَرِيِّ عَنْ يُونُسَ بْنِ ظَبْيَانَ وَ مُفَضَّلِ بْنِ عُمَرَ وَ أَبِي سَلَمَةَ السَّرَّاجِ وَ الْحُسَيْنِ بْنِ ثُوَيْرِ بْنِ أَبِي فَاخِتَةَ قَالُوا كُنَّا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ عِنْدَنَا خَزَائِنُ الْأَرْضِ وَ مَفَاتِيحُهَا وَ لَوْ شِئْتُ أَنْ أَقُولَ بِإِحْدَى رِجْلَيَّ أَخْرِجِي مَا فِيكِ مِنَ الذَّهَبِ لَأَخْرَجَتْ \nقَالَ ثُمَّ قَالَ بِإِحْدَى رِجْلَيْهِ فَخَطَّهَا فِي الْأَرْضِ خَطّاً فَانْفَرَجَتِ الْأَرْضُ ثُمَّ قَالَ بِيَدِهِ فَأَخْرَجَ سَبِيكَةَ ذَهَبٍ قَدْرَ شِبْرٍ ثُمَّ قَالَ انْظُرُوا حَسَناً فَنَظَرْنَا فَإِذَا سَبَائِكُ كَثِيرَةٌ بَعْضُهَا عَلَى بَعْضٍ يَتَلَأْلَأُ فَقَالَ لَهُ بَعْضُنَا جُعِلْتُ فِدَاكَ أُعْطِيتُمْ مَا أُعْطِيتُمْ وَ شِيعَتُكُمْ مُحْتَاجُونَ قَالَ فَقَالَ إِنَّ اللَّهَ سَيَجْمَعُ لَنَا وَ لِشِيعَتِنَا الدُّنْيَا وَ الْآخِرَةَ وَ يُدْخِلُهُمْ جَنَّاتِ النَّعِيمِ وَ يُدْخِلُ عَدُوَّنَا الْجَحِيمَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Umar Bin Abdul Aziz, from Al Khaybari, from Yunus Bin Zabyan and Mufazzal Bin Umar, and Abu Salma Al Sarraj and Al Husayn Bin Suweyr Bin Abu Fakhta who said, \n‘We were in the presence of Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said: ‘With us<sup>asws</sup> there are treasures of the earth and their keys, and had I<sup>asws</sup> so desired to, I<sup>asws</sup> would be saying (gesturing) with one of my<sup>asws</sup> legs: ‘Bring out whatever is inside you from the gold!’ It would bring it out’. \nHe (the narrator) said, ‘Then he<sup>asws</sup> said (gestured) it with one of his<sup>asws</sup> legs, and marked the ground with a marking, so the ground burst out. Then he<sup>asws</sup> said (gestured) with his<sup>asws</sup> hand, so a gold ingot came out of a measurement of a palm’s width. Then he<sup>asws</sup> said: ‘Look properly’. So we looked and there were many ingots, on top of each other, shining. So, one of us said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! You (Imams<sup>asws</sup>) have been Given what you<sup>asws</sup> have been Given, and your<sup>asws</sup> Shias are needy’. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> would be Gathering for us<sup>asws</sup> and for our<sup>asws</sup> Shias, the world and the Hereafter, and He<sup>azwj</sup> will Enter them into the Gardens of Bliss, and He<sup>azwj</sup> would Enter our<sup>asws</sup> enemies into the Blazing Fire’."}]}, {"index": 1278, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:119:5", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ الْمُعَلَّى بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي بَصِيرٍ قَالَ كَانَ لِي جَارٌ يَتَّبِعُ السُّلْطَانَ فَأَصَابَ مَالًا فَأَعَدَّ قِيَاناً وَ كَانَ يَجْمَعُ الْجَمِيعَ إِلَيْهِ وَ يَشْرَبُ الْمُسْكِرَ وَ يُؤْذِينِي فَشَكَوْتُهُ إِلَى نَفْسِهِ غَيْرَ مَرَّةٍ فَلَمْ يَنْتَهِ فَلَمَّا أَنْ أَلْحَحْتُ عَلَيْهِ فَقَالَ لِي يَا هَذَا أَنَا رَجُلٌ مُبْتَلًى وَ أَنْتَ رَجُلٌ مُعَافًى فَلَوْ عَرَضْتَنِي لِصَاحِبِكَ رَجَوْتُ أَنْ يُنْقِذَنِيَ اللَّهُ بِكَ فَوَقَعَ ذَلِكَ لَهُ فِي قَلْبِي \nفَلَمَّا صِرْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) ذَكَرْتُ لَهُ حَالَهُ فَقَالَ لِي إِذَا رَجَعْتَ إِلَى الْكُوفَةِ سَيَأْتِيكَ فَقُلْ لَهُ يَقُولُ لَكَ جَعْفَرُ بْنُ مُحَمَّدٍ دَعْ مَا أَنْتَ عَلَيْهِ وَ أَضْمَنَ لَكَ عَلَى اللَّهِ الْجَنَّةَ فَلَمَّا رَجَعْتُ إِلَى الْكُوفَةِ أَتَانِي فِيمَنْ أَتَى فَاحْتَبَسْتُهُ عِنْدِي حَتَّى خَلَا مَنْزِلِي ثُمَّ قُلْتُ لَهُ يَا هَذَا إِنِّي ذَكَرْتُكَ لِأَبِي عَبْدِ اللَّهِ جَعْفَرِ بْنِ مُحَمَّدٍ الصَّادِقِ ( عليه السلام ) فَقَالَ لِي إِذَا رَجَعْتَ إِلَى الْكُوفَةِ سَيَأْتِيكَ فَقُلْ لَهُ يَقُولُ لَكَ جَعْفَرُ بْنُ مُحَمَّدٍ دَعْ مَا أَنْتَ عَلَيْهِ وَ أَضْمَنَ لَكَ عَلَى اللَّهِ الْجَنَّةَ\nقَالَ فَبَكَى ثُمَّ قَالَ لِيَ اللَّهِ لَقَدْ قَالَ لَكَ أَبُو عَبْدِ اللَّهِ هَذَا قَالَ فَحَلَفْتُ لَهُ أَنَّهُ قَدْ قَالَ لِي مَا قُلْتُ فَقَالَ لِي حَسْبُكَ وَ مَضَى فَلَمَّا كَانَ بَعْدَ أَيَّامٍ بَعَثَ إِلَيَّ فَدَعَانِي وَ إِذَا هُوَ خَلْفَ دَارِهِ عُرْيَانٌ فَقَالَ لِي يَا أَبَا بَصِيرٍ لَا وَ اللَّهِ مَا بَقِيَ فِي مَنْزِلِي شَيْ‏ءٌ إِلَّا وَ قَدْ أَخْرَجْتُهُ وَ أَنَا كَمَا تَرَى \nقَالَ فَمَضَيْتُ إِلَى إِخْوَانِنَا فَجَمَعْتُ لَهُ مَا كَسَوْتُهُ بِهِ ثُمَّ لَمْ تَأْتِ عَلَيْهِ أَيَّامٌ يَسِيرَةٌ حَتَّى بَعَثَ إِلَيَّ أَنِّي عَلِيلٌ فَأْتِنِي فَجَعَلْتُ أَخْتَلِفُ إِلَيْهِ وَ أُعَالِجُهُ حَتَّى نَزَلَ بِهِ الْمَوْتُ فَكُنْتُ عِنْدَهُ جَالِساً وَ هُوَ يَجُودُ بِنَفْسِهِ فَغُشِيَ عَلَيْهِ غَشْيَةً ثُمَّ أَفَاقَ فَقَالَ لِي يَا أَبَا بَصِيرٍ قَدْ وَفَى صَاحِبُكَ لَنَا ثُمَّ قُبِضَ رَحْمَةُ اللَّهِ عَلَيْهِ \nفَلَمَّا حَجَجْتُ أَتَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَاسْتَأْذَنْتُ عَلَيْهِ فَلَمَّا دَخَلْتُ قَالَ لِيَ ابْتِدَاءً مِنْ دَاخِلِ الْبَيْتِ وَ إِحْدَى رِجْلَيَّ فِي الصَّحْنِ وَ الْأُخْرَى فِي دِهْلِيزِ دَارِهِ يَا أَبَا بَصِيرٍ قَدْ وَفَيْنَا لِصَاحِبِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Al Moalla Bin Muhammad, from some of his companions, from Abu Baseer who said, \n‘There was a neighbour of ours who followed (the biddings of) the ruling authorities, so he attained wealth. So he used to prepare (hold parties), female singers, and they all used to gather to him and drink the wine, and it used to bother me. So I complained to him repeatedly, but he did not end it. So when I was insistent upon it, so he said to me, ‘O you! I am an afflicted man and you are a healthy man. So if you would present me to your Master<sup>asws</sup>, I am hopeful that Allah<sup>azwj</sup> would Rescue me through you’. So that occurred in my heart.\nSo when I came to Abu Abdullah<sup>asws</sup>, I mentioned his state to him<sup>asws</sup>. So he<sup>asws</sup> said to me: ‘When you return to Al-Kufa, go to him and say to him, ‘Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> is saying to you: ‘Leave what you are upon and I<sup>asws</sup> (personally) guarantee the Paradise for you, upon (the Guarantee of) Allah<sup>azwj</sup>’. So when I returned to Al-Kufa, he came to me among the ones he came with. So I withheld him with me until my house was empty. Then I said to him, ‘O you! I mentioned you to Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad Al-Sadiq<sup>asws</sup>. So he<sup>asws</sup> said to me: ‘When you return to Al-Kufa, go to him and say to him, ‘Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> is saying to you: ‘Leave what you are upon and I<sup>asws</sup> (personally) guarantee the Paradise for you, upon (the Guarantee of) Allah<sup>azwj</sup>’.\nHe (the narrator) said, ‘So he wept, then said to me, ‘By Allah<sup>azwj</sup>! Abu Abdullah<sup>asws</sup> said this to you?’ So I swore on oath to him and he<sup>asws</sup> had said so. He said to me what I said. So he said to me, ‘You have sufficed’, and he went away. So when it was a few days afterwards, he sent a message to me, and called me over, and there he was, bare, behind his door. So he said to me, ‘O Abu Baseer! No, by Allah<sup>azwj</sup>! There does not remain anything in my house but I have thrown it out, and I am just as you see’.  \nHe (the narrator) said, ‘So I went to our brethren and gathered for him what he could be clothed with. Then, there did not pass upon him a few days until he sent a message to me, ‘I am sick’. So I went over to him, and I used to come and go to him and treat him until the death descended with him. So I was seated in his presence and he was struggling with himself, and there was a fainting upon him. He fainted, then woke up, and he said to me, ‘O Abu Baseer! Your Master<sup>asws</sup> has fulfilled for us’. Then he passed away, may Allah<sup>azwj</sup> have Mercy upon him. \nSo, when I performed Hajj, I went over to Abu Abdullah<sup>asws</sup>, and sought permission to see him<sup>asws</sup>. So when I entered, he<sup>asws</sup> said to me initiating from inside the house, and one of my legs was in the courtyard and the other one in the corridor: ‘O Abu Baseer! We<sup>asws</sup> have fulfilled (our<sup>asws</sup> promise) for your companion’."}]}, {"index": 1279, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:119:6", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ الْأَشْعَثِ قَالَ قَالَ لِي أَ تَدْرِي مَا كَانَ سَبَبُ دُخُولِنَا فِي هَذَا الْأَمْرِ وَ مَعْرِفَتِنَا بِهِ وَ مَا كَانَ عِنْدَنَا مِنْهُ ذِكْرٌ وَ لَا مَعْرِفَةُ شَيْ‏ءٍ مِمَّا عِنْدَ النَّاسِ قَالَ قُلْتُ لَهُ مَا ذَاكَ قَالَ إِنَّ أَبَا جَعْفَرٍ يَعْنِي أَبَا الدَّوَانِيقِ قَالَ لِأَبِي مُحَمَّدِ بْنِ الْأَشْعَثِ يَا مُحَمَّدُ ابْغِ لِي رَجُلًا لَهُ عَقْلٌ يُؤَدِّي عَنِّي فَقَالَ لَهُ أَبِي قَدْ أَصَبْتُهُ لَكَ هَذَا فُلَانُ بْنُ مُهَاجِرٍ خَالِي قَالَ فَأْتِنِي بِهِ\nقَالَ فَأَتَيْتُهُ بِخَالِي فَقَالَ لَهُ أَبُو جَعْفَرٍ يَا ابْنَ مُهَاجِرٍ خُذْ هَذَا الْمَالَ وَ أْتِ الْمَدِينَةَ وَ أْتِ عَبْدَ اللَّهِ بْنَ الْحَسَنِ بْنِ الْحَسَنِ وَ عِدَّةً مِنْ أَهْلِ بَيْتِهِ فِيهِمْ جَعْفَرُ بْنُ مُحَمَّدٍ فَقُلْ لَهُمْ إِنِّي رَجُلٌ غَرِيبٌ مِنْ أَهْلِ خُرَاسَانَ وَ بِهَا شِيعَةٌ مِنْ شِيعَتِكُمْ وَجَّهُوا إِلَيْكُمْ بِهَذَا الْمَالِ وَ ادْفَعْ إِلَى كُلِّ وَاحِدٍ مِنْهُمْ عَلَى شَرْطِ كَذَا وَ كَذَا فَإِذَا قَبَضُوا الْمَالَ فَقُلْ إِنِّي رَسُولٌ وَ أُحِبُّ أَنْ يَكُونَ مَعِي خُطُوطُكُمْ بِقَبْضِكُمْ مَا قَبَضْتُمْ \nفَأَخَذَ الْمَالَ وَ أَتَى الْمَدِينَةَ فَرَجَعَ إِلَى أَبِي الدَّوَانِيقِ وَ مُحَمَّدُ بْنُ الْأَشْعَثِ عِنْدَهُ فَقَالَ لَهُ أَبُو الدَّوَانِيقِ مَا وَرَاءَكَ قَالَ أَتَيْتُ الْقَوْمَ وَ هَذِهِ خُطُوطُهُمْ بِقَبْضِهِمُ الْمَالَ خَلَا جَعْفَرَ بْنَ مُحَمَّدٍ فَإِنِّي أَتَيْتُهُ وَ هُوَ يُصَلِّي فِي مَسْجِدِ الرَّسُولِ ( صلى الله عليه وآله ) فَجَلَسْتُ خَلْفَهُ وَ قُلْتُ حَتَّى يَنْصَرِفَ فَأَذْكُرَ لَهُ مَا ذَكَرْتُ لِأَصْحَابِهِ\nفَعَجَّلَ وَ انْصَرَفَ ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ يَا هَذَا اتَّقِ اللَّهَ وَ لَا تَغُرَّ أَهْلَ بَيْتِ مُحَمَّدٍ فَإِنَّهُمْ قَرِيبُو الْعَهْدِ بِدَوْلَةِ بَنِي مَرْوَانَ وَ كُلُّهُمْ مُحْتَاجٌ فَقُلْتُ وَ مَا ذَاكَ أَصْلَحَكَ اللَّهُ قَالَ فَأَدْنَى رَأْسَهُ مِنِّي وَ أَخْبَرَنِي بِجَمِيعِ مَا جَرَى بَيْنِي وَ بَيْنَكَ حَتَّى كَأَنَّهُ كَانَ ثَالِثَنَا\nقَالَ فَقَالَ لَهُ أَبُو جَعْفَرٍ يَا ابْنَ مُهَاجِرٍ اعْلَمْ أَنَّهُ لَيْسَ مِنْ أَهْلِ بَيْتِ نُبُوَّةٍ إِلَّا وَ فِيهِ مُحَدَّثٌ وَ إِنَّ جَعْفَرَ بْنَ مُحَمَّدٍ مُحَدَّثُنَا الْيَوْمَ \nوَ كَانَتْ هَذِهِ الدَّلَالَةُ سَبَبَ قَوْلِنَا بِهَذِهِ الْمَقَالَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ja’far Bin Muhammad Bin Al Ash’as who said, \n‘He said to me: ‘Do you know what was the cause of our entry into this matter (Al-Wilayah) and our understanding with it, and what there was nothing with us from it, neither a Zikr (Mention) nor any understanding) from what was with the people’. I said, ‘What is that (cause)?’ Abu Ja’far, meaning Al-Dawaniqy said to Abu Muhammad Bin Al-Ash’as, ‘O Muhammad! Find a man for me who has intellect for him who can officiate on my behalf’. So my father said to him, ‘I have come across him for you. This is so and so Bin Muhajir, my maternal uncle’. He said, ‘So come to me with him’. \nHe (the narrator) said, ‘So I went over to him with my maternal uncle. So Abu Ja’far said to him, ‘O Ibn Muhajir! Take this wealth and go to Al-Medina, and go to Abu Abdullah Bin Al-Hassan Bin Al-Hassan, and a number of his family, among them being Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>, and say to them, ‘I am a stranger from the people of Khurasan, and with it a Shia from your Shias diverted me to you with this wealth’, and hand it over to each one of them upon a stipulation of such and such. So when they take possession of the wealth, so say, ‘I am a messenger and I would love it if there happens to be your letters with me of your having taken possession of whatever you have taken possession of’.\nSo he took the wealth and went to Al-Medina. Then he returned to Al-Dawaniqy, and Muhammad Bin Al Ash’as was in his presence. So Abu Al-Dawaniqy said to him, ‘What is behind you?’ He said, ‘I went to the group of people and these here are their letters of their having taken possession of the wealth, apart from Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>, for I went over to him<sup>asws</sup> and he<sup>asws</sup> was praying <span class=\"iTxt\">Salat</span> in the Masjid of Rasool<sup>saww</sup>. So I sat (there waiting) him<sup>asws</sup>, and I said (to myself), ‘(I shall wait) until he<sup>asws</sup> finishes, then I shall mention to him<sup>asws</sup> what I mentioned to his<sup>asws</sup> companions’. \nSo he<sup>asws</sup> hastened and finished, then turned around to me, so he<sup>asws</sup> said: ‘O you! Fear Allah<sup>azwj</sup> and do not deceive the People<sup>asws</sup> of the Household of Muhammad<sup>saww</sup>, for they are very close to the era of the government of Marwan, and all of them are needy’. So I said, ‘And what is that? May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well!’ So he<sup>asws</sup> brought his<sup>asws</sup> head close to mine and informed me with the entirety of what had flowed between me and you to the extent that it was as if he<sup>asws</sup> was a third of us’. \nHe (the narrator) said, ‘So Abu Ja’far said to him, ‘O Ibn Muhajir! Know that there isn’t a Prophet-hood from the People<sup>asws</sup> of the Household except and among them is a <span class=\"iTxt\">Muhaddath</span>, and that Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> is our <span class=\"iTxt\">Muhaddath</span> today (the one with whom the Angels speak to)’.  \nAnd thus, this here is the evidence, the cause of our words (beliefs), due to this discussion’."}]}, {"index": 1280, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:119:7", "text": "سَعْدُ بْنُ عَبْدِ اللَّهِ وَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ قُبِضَ أَبُو عَبْدِ اللَّهِ جَعْفَرُ بْنُ مُحَمَّدٍ ( عليه السلام ) وَ هُوَ ابْنُ خَمْسٍ وَ سِتِّينَ سَنَةً فِي عَامِ ثَمَانٍ وَ أَرْبَعِينَ وَ مِائَةٍ وَ عَاشَ بَعْدَ أَبِي جَعْفَرٍ ( عليه السلام ) أَرْبَعاً وَ ثَلَاثِينَ سَنَةً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Sa’d Bin Abdullah, and Abdullah Bin Ja’far, altogether from Ibrahim Bin Mahziyar, from his brother Ali Bin Mahziyar, from Al Husayn Bin Saeed, from Muhammad Bin Sinan, from Ibn Muskan, from Abu Baseer who said, \n‘Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> passed away and he<sup>asws</sup> was fifty-six years old in the year one hundred and forty eight (A.H.), and he<sup>asws</sup> lived after Abu Ja’far<sup>asws</sup> for thirty-four years’."}]}, {"index": 1281, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:119:8", "text": "سَعْدُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ عُمَرَ بْنِ سَعِيدٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ أَنَا كَفَّنْتُ أَبِي فِي ثَوْبَيْنِ شَطَوِيَّيْنِ كَانَ يُحْرِمُ فِيهِمَا وَ فِي قَمِيصٍ مِنْ قُمُصِهِ وَ فِي عِمَامَةٍ كَانَتْ لِعَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَ فِي بُرْدٍ اشْتَرَاهُ بِأَرْبَعِينَ دِينَاراً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Sa’d Bin Abdullah, from Abu Ja’far Muhammad Bin Umar Bin Saeed, from Yunus Bin Yaqoub, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘I<sup>asws</sup> enshrouded my<sup>asws</sup> father<sup>asws</sup> in two clothes, both being Shatwany (a type of cloth). He<sup>asws</sup> used to wear it as Ihram (for Hajj/Umrah), and in a shirt from his<sup>asws</sup> shirts, and in a turban which used to be for Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and in a cloak which he<sup>asws</sup> had purchased it for forty Dinars’."}]}]}, "index": "al-kafi:1:4:119", "kind": "verse_list"}