{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 120"}, "path": "/books/al-kafi:1:4:120", "titles": {"ar": "باب مَوْلِدِ أَبِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام )", "en": "Chapter 120 – Arrival of Abu Al Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>"}}], "index": 178, "local_index": 120, "part_type": "Chapter", "path": "/books/al-kafi:1:4:120", "titles": {"ar": "باب مَوْلِدِ أَبِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام )", "en": "Chapter 120 – Arrival of Abu Al Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>"}, "verse_count": 9, "verse_start_index": 1281, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 1282, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:120:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ السِّنْدِيِّ الْقُمِّيِّ قَالَ حَدَّثَنَا عِيسَى بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ قَالَ دَخَلَ ابْنُ عُكَّاشَةَ بْنِ مِحْصَنٍ الْأَسَدِيُّ عَلَى أَبِي جَعْفَرٍ وَ كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَائِماً عِنْدَهُ فَقَدَّمَ إِلَيْهِ عِنَباً فَقَالَ حَبَّةً حَبَّةً يَأْكُلُهُ الشَّيْخُ الْكَبِيرُ وَ الصَّبِيُّ الصَّغِيرُ وَ ثَلَاثَةً وَ أَرْبَعَةً يَأْكُلُهُ مَنْ يَظُنُّ أَنَّهُ لَا يَشْبَعُ وَ كُلْهُ حَبَّتَيْنِ حَبَّتَيْنِ فَإِنَّهُ يُسْتَحَبُّ", "فَقَالَ لِأَبِي جَعْفَرٍ ( عليه السلام ) لِأَيِّ شَيْ‏ءٍ لَا تُزَوِّجُ أَبَا عَبْدِ اللَّهِ فَقَدْ أَدْرَكَ التَّزْوِيجَ قَالَ وَ بَيْنَ يَدَيْهِ صُرَّةٌ مَخْتُومَةٌ فَقَالَ أَمَا إِنَّهُ سَيَجِي‏ءُ نَخَّاسٌ مِنْ أَهْلِ بَرْبَرَ فَيَنْزِلُ دَارَ مَيْمُونٍ فَنَشْتَرِي لَهُ بِهَذِهِ الصُّرَّةِ جَارِيَةً", "قَالَ فَأَتَى لِذَلِكَ مَا أَتَى فَدَخَلْنَا يَوْماً عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ أَ لَا أُخْبِرُكُمْ عَنِ النَّخَّاسِ الَّذِي ذَكَرْتُهُ لَكُمْ قَدْ قَدِمَ فَاذْهَبُوا فَاشْتَرُوا بِهَذِهِ الصُّرَّةِ مِنْهُ جَارِيَةً قَالَ فَأَتَيْنَا النَّخَّاسَ فَقَالَ قَدْ بِعْتُ مَا كَانَ عِنْدِي إِلَّا جَارِيَتَيْنِ مَرِيضَتَيْنِ إِحْدَاهُمَا أَمْثَلُ مِنَ الْأُخْرَى قُلْنَا فَأَخْرِجْهُمَا حَتَّى نَنْظُرَ إِلَيْهِمَا فَأَخْرَجَهُمَا فَقُلْنَا بِكَمْ تَبِيعُنَا هَذِهِ الْمُتَمَاثِلَةَ قَالَ بِسَبْعِينَ دِينَاراً قُلْنَا أَحْسِنْ", "قَالَ لَا أَنْقُصُ مِنْ سَبْعِينَ دِينَاراً قُلْنَا لَهُ نَشْتَرِيهَا مِنْكَ بِهَذِهِ الصُّرَّةِ مَا بَلَغَتْ وَ لَا نَدْرِي مَا فِيهَا وَ كَانَ عِنْدَهُ رَجُلٌ أَبْيَضُ الرَّأْسِ وَ اللِّحْيَةِ قَالَ فُكُّوا وَ زِنُوا فَقَالَ النَّخَّاسُ لَا تَفُكُّوا فَإِنَّهَا إِنْ نَقَصَتْ حَبَّةً مِنْ سَبْعِينَ دِينَاراً لَمْ أُبَايِعْكُمْ فَقَالَ الشَّيْخُ ادْنُوا فَدَنَوْنَا وَ فَكَكْنَا الْخَاتَمَ وَ وَزَنَّا الدَّنَانِيرَ فَإِذَا هِيَ سَبْعُونَ دِينَاراً لَا تَزِيدُ وَ لَا تَنْقُصُ", "فَأَخَذْنَا الْجَارِيَةَ فَأَدْخَلْنَاهَا عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) وَ جَعْفَرٌ قَائِمٌ عِنْدَهُ فَأَخْبَرْنَا أَبَا جَعْفَرٍ بِمَا كَانَ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ لَهَا مَا اسْمُكِ قَالَتْ حَمِيدَةُ فَقَالَ حَمِيدَةٌ فِي الدُّنْيَا مَحْمُودَةٌ فِي الْآخِرَةِ ", "فَقَالَ يَا جَعْفَرُ خُذْهَا إِلَيْكَ فَوَلَدَتْ خَيْرَ أَهْلِ الْأَرْضِ مُوسَى بْنَ جَعْفَرٍ ( عليه السلام ) ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Ali Bin Al Sindy Al Qummy who said, ‘Isa Bin Abdul Rahman narrated to us from his father saying, ", "‘Ibn Ukasha Bin Mihsan Al-Asady came over to Abu Ja’far<sup>asws</sup>, and Abu Abdullah<sup>asws</sup> was standing in his<sup>asws</sup> presence. So he placed forward some grapes to him<sup>asws</sup>, and he<sup>asws</sup> said: ‘One seed by one seed eats an aged old man and a young child eats three and four (at a time, as well as) the one who thinks he is not satiated, and (you) eat two by two, for it is recommended’.", "So he said to Abu Ja’far<sup>asws</sup>, ‘For which thing are you<sup>asws</sup> not getting Abu Abdullah<sup>asws</sup> to be married, for he<sup>asws</sup> was reached the marriageable age?’ He (the narrator) said, ‘And in front of him<sup>asws</sup> was a sealed bag, so he<sup>asws</sup> said: ‘There would be coming a slave trader from the people of Berbers, and they would be encamping in the house of Maymoun, so we<sup>asws</sup> would buy a slave girl for him<sup>asws</sup> with this bag’. ", "So there came for that what came, and one day we went over to Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> said: ‘Shall I<sup>asws</sup> inform you all about the slave trader whom I<sup>asws</sup> mentioned to you? They have come. So go and buy with this bag, and slave girl from him’. So we went to the slave trader, but he said, ‘I have sold whatever was with me except for two slave girls, both being sick, one of them more favourable than the other’. So we said, ‘Bring them out until we look at them’. So he brought them out, and we said, ‘With how much will you sell to us this more favourable one?’ He said, ‘Seventy Dinars’. We said, ‘Good’. ", "He said, ‘I will not reduce from Seventy Dinars’. We said to him, ‘We shall buy her from you with this bag, whatever it reaches, and we do not know what is in it’, and there with him a man of white haired and beard. He said, ‘Open it and weight it’. So the slave trader said, ‘Do not open it, for if it is deficient by even one grain from seventy Dinars, I will not sell to you’. So the old man said, ‘Approach’. So we approached and we opened the seal and weighed the Dinars, and there were seventy Dinars, neither more nor less. ", "So we took the slave girl and brought her over to Abu Ja’far<sup>asws</sup>, and Ja’far<sup>asws</sup> was standing in his<sup>asws</sup> presence. So we informed Abu Ja’far<sup>asws</sup> with what had happened. So he<sup>asws</sup> praised Allah<sup>azwj</sup> and extolled upon Him<sup>azwj</sup>, then said to her: ‘What is your name?’ She said, ‘Hameeda’. So he<sup>asws</sup> said: ‘Hameeda (praised) in the world, and even more praised in the Hereafter. ", "So he<sup>asws</sup> said: ‘O Ja’far<sup>asws</sup>! Take her to yourself<sup>asws</sup>’. So she gave birth to the best of the people of the earth, Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>’."]}}, {"index": 1283, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:120:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عَبْدِ اللَّهِ بْنِ أَحْمَدَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنِ ابْنِ سِنَانٍ عَنْ سَابِقِ بْنِ الْوَلِيدِ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ أَنَّ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) قَالَ حَمِيدَةُ مُصَفَّاةٌ مِنَ الْأَدْنَاسِ كَسَبِيكَةِ الذَّهَبِ مَا زَالَتِ الْأَمْلَاكُ تَحْرُسُهَا حَتَّى أُدِّيَتْ إِلَيَّ كَرَامَةً مِنَ اللَّهِ لِي وَ الْحُجَّةِ مِنْ بَعْدِي ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Abdullah Bin Ahmad, from Ali Bin Al Husayn, from Ibn Sinan, from Sabiq Bin Al Waleed, from Al Moalla Bin Khunays that, ", "‘Abu Abdullah<sup>asws</sup> said: ‘Hameeda is as refined from the pollution like and ingot of gold. The Angels did not cease to guard her until she was to me<sup>asws</sup> as a prestige from Allah<sup>azwj</sup> for me, and the Divine Authority from after me<sup>asws</sup>’."]}}, {"index": 1284, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:120:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ أَبِي قَتَادَةَ الْقُمِّيِّ عَنْ أَبِي خَالِدٍ الزُّبَالِيِّ قَالَ لَمَّا أُقْدِمَ بِأَبِي الْحَسَنِ مُوسَى ( عليه السلام ) عَلَى الْمَهْدِيِّ الْقُدْمَةَ الْأُولَى نَزَلَ زُبَالَةَ فَكُنْتُ أُحَدِّثُهُ فَرَآنِي مَغْمُوماً فَقَالَ لِي يَا أَبَا خَالِدٍ مَا لِي أَرَاكَ مَغْمُوماً فَقُلْتُ وَ كَيْفَ لَا أَغْتَمُّ وَ أَنْتَ تُحْمَلُ إِلَى هَذِهِ الطَّاغِيَةِ وَ لَا أَدْرِي مَا يُحْدِثُ فِيكَ فَقَالَ لَيْسَ عَلَيَّ بَأْسٌ إِذَا كَانَ شَهْرُ كَذَا وَ كَذَا وَ يَوْمُ كَذَا فَوَافِنِي فِي أَوَّلِ الْمِيلِ ", "فَمَا كَانَ لِي هَمٌّ إِلَّا إِحْصَاءَ الشُّهُورِ وَ الْأَيَّامِ حَتَّى كَانَ ذَلِكَ الْيَوْمُ فَوَافَيْتُ الْمِيلَ فَمَا زِلْتُ عِنْدَهُ حَتَّى كَادَتِ الشَّمْسُ أَنْ تَغِيبَ وَ وَسْوَسَ الشَّيْطَانُ فِي صَدْرِي وَ تَخَوَّفْتُ أَنْ أَشُكَّ فِيمَا قَالَ فَبَيْنَا أَنَا كَذَلِكَ إِذَا نَظَرْتُ إِلَى سَوَادٍ قَدْ أَقْبَلَ مِنْ نَاحِيَةِ الْعِرَاقِ فَاسْتَقْبَلْتُهُمْ فَإِذَا أَبُو الْحَسَنِ ( عليه السلام ) أَمَامَ الْقِطَارِ عَلَى بَغْلَةٍ فَقَالَ إِيهٍ يَا أَبَا خَالِدٍ قُلْتُ لَبَّيْكَ يَا ابْنَ رَسُولِ اللَّهِ فَقَالَ لَا تَشُكَّنَّ وَدَّ الشَّيْطَانُ أَنَّكَ شَكَكْتَ فَقُلْتُ الْحَمْدُ لِلَّهِ الَّذِي خَلَّصَكَ مِنْهُمْ فَقَالَ إِنَّ لِي إِلَيْهِمْ عَوْدَةً لَا أَتَخَلَّصُ مِنْهُمْ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad and Ali Bin Ibrahim, from his father, altogether from Abu Qatada, from Abu Khalid Al Zabaly who said, ", "‘When they proceeded with Abu Al-Hassan Musa<sup>asws</sup> to Al-Mahdi (the Caliph), for the first proceeding, he<sup>asws</sup> was lodged at Zubala. I discussed with him<sup>asws</sup>, and he<sup>asws</sup> saw me as gloomy, so he<sup>asws</sup> said to me: ‘O Abu Khalid! What is the matter I<sup>asws</sup> see you as gloomy?’ So I said, ‘And how can I not be gloomy and you are being carried to this tyrant, and I do not know how his conduct will be with regards to you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘There is no problem upon me<sup>asws</sup>. When it would be such and such a month and such and such a day, so meet me in the first mile’. ", "So there were no worries for me except that I counted the months and the days until it was that day. So I went at the mile, and I did not cease to be with it until the sun almost set, and there was the whispering of the Satan<sup>la</sup> in my chest, and I feared I might doubt regarding what he<sup>asws</sup> had said. So while I was like that when I looked at blackness which had appeared from the direction of Al-Iraq. So I welcomed them and there was Abu Al-Hassan<sup>asws</sup>, in front of the caravan upon a mule. So he<sup>asws</sup> said: ‘Is it you, Abu Khalid?’ I said, ‘At your<sup>asws</sup> service, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>!’ So he<sup>asws</sup> said: ‘Do not be doubting. The Satan<sup>la</sup> loves it that you doubt’. So I said, ‘The Praise is for Allah<sup>azwj</sup> who Save you<sup>asws</sup> from them’. So he<sup>asws</sup> said: ‘There is return for me<sup>asws</sup> to them. I<sup>asws</sup> will not be safe from them’."]}}, {"index": 1285, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:120:4", "text": ["أَحْمَدُ بْنُ مِهْرَانَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ جَمِيعاً عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ يَعْقُوبَ بْنِ جَعْفَرِ بْنِ إِبْرَاهِيمَ قَالَ كُنْتُ عِنْدَ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) إِذْ أَتَاهُ رَجُلٌ نَصْرَانِيٌّ وَ نَحْنُ مَعَهُ بِالْعُرَيْضِ فَقَالَ لَهُ النَّصْرَانِيُّ أَتَيْتُكَ مِنْ بَلَدٍ بَعِيدٍ وَ سَفَرٍ شَاقٍّ وَ سَأَلْتُ رَبِّي مُنْذُ ثَلَاثِينَ سَنَةً أَنْ يُرْشِدَنِي إِلَى خَيْرِ الْأَدْيَانِ وَ إِلَى خَيْرِ الْعِبَادِ وَ أَعْلَمِهِمْ وَ أَتَانِي آتٍ فِي النَّوْمِ فَوَصَفَ لِي رَجُلًا بِعُلْيَا دِمَشْقَ فَانْطَلَقْتُ حَتَّى أَتَيْتُهُ فَكَلَّمْتُهُ", "فَقَالَ أَنَا أَعْلَمُ أَهْلِ دِينِي وَ غَيْرِي أَعْلَمُ مِنِّي فَقُلْتُ أَرْشِدْنِي إِلَى مَنْ هُوَ أَعْلَمُ مِنْكَ فَإِنِّي لَا أَسْتَعْظِمُ السَّفَرَ وَ لَا تَبْعُدُ عَلَيَّ الشُّقَّةُ وَ لَقَدْ قَرَأْتُ الْإِنْجِيلَ كُلَّهَا وَ مَزَامِيرَ دَاوُدَ وَ قَرَأْتُ أَرْبَعَةَ أَسْفَارٍ مِنَ التَّوْرَاةِ وَ قَرَأْتُ ظَاهِرَ الْقُرْآنِ حَتَّى اسْتَوْعَبْتُهُ كُلَّهُ", "فَقَالَ لِيَ الْعَالِمُ إِنْ كُنْتَ تُرِيدُ عِلْمَ النَّصْرَانِيَّةِ فَأَنَا أَعْلَمُ الْعَرَبِ وَ الْعَجَمِ بِهَا وَ إِنْ كُنْتَ تُرِيدُ عِلْمَ الْيَهُودِ فَبَاطِي بْنُ شُرَحْبِيلَ السَّامِرِيُّ أَعْلَمُ النَّاسِ بِهَا الْيَوْمَ وَ إِنْ كُنْتَ تُرِيدُ عِلْمَ الْإِسْلَامِ وَ عِلْمَ التَّوْرَاةِ وَ عِلْمَ الْإِنْجِيلِ وَ عِلْمَ الزَّبُورِ وَ كِتَابَ هُودٍ وَ كُلَّ مَا أُنْزِلَ عَلَى نَبِيٍّ مِنَ الْأَنْبِيَاءِ فِي دَهْرِكَ وَ دَهْرِ غَيْرِكَ وَ مَا أُنْزِلَ مِنَ السَّمَاءِ مِنْ خَبَرٍ فَعَلِمَهُ أَحَدٌ أَوْ لَمْ يَعْلَمْ بِهِ أَحَدٌ فِيهِ تِبْيَانُ كُلِّ شَيْ‏ءٍ وَ شِفَاءٌ لِلْعَالَمِينَ وَ رَوْحٌ لِمَنِ اسْتَرْوَحَ إِلَيْهِ وَ بَصِيرَةٌ لِمَنْ أَرَادَ اللَّهُ بِهِ خَيْراً وَ أَنِسَ إِلَى الْحَقِّ فَأُرْشِدُكَ إِلَيْهِ فَأْتِهِ وَ لَوْ مَشْياً عَلَى رِجْلَيْكَ فَإِنْ لَمْ تَقْدِرْ فَحَبْواً عَلَى رُكْبَتَيْكَ فَإِنْ لَمْ تَقْدِرْ فَزَحْفاً عَلَى اسْتِكَ فَإِنْ لَمْ تَقْدِرْ فَعَلَى وَجْهِكَ ", "فَقُلْتُ لَا بَلْ أَنَا أَقْدِرُ عَلَى الْمَسِيرِ فِي الْبَدَنِ وَ الْمَالِ قَالَ فَانْطَلِقْ مِنْ فَوْرِكَ حَتَّى تَأْتِيَ يَثْرِبَ فَقُلْتُ لَا أَعْرِفُ يَثْرِبَ قَالَ فَانْطَلِقْ حَتَّى تَأْتِيَ مَدِينَةَ النَّبِيِّ ( صلى الله عليه وآله ) الَّذِي بُعِثَ فِي الْعَرَبِ وَ هُوَ النَّبِيُّ الْعَرَبِيُّ الْهَاشِمِيُّ فَإِذَا دَخَلْتَهَا فَسَلْ عَنْ بَنِي غَنْمِ بْنِ مَالِكِ بْنِ النَّجَّارِ وَ هُوَ عِنْدَ بَابِ مَسْجِدِهَا وَ أَظْهِرْ بِزَّةَ النَّصْرَانِيَّةِ وَ حِلْيَتَهَا فَإِنَّ وَالِيَهَا يَتَشَدَّدُ عَلَيْهِمْ وَ الْخَلِيفَةُ أَشَدُّ", "ثُمَّ تَسْأَلُ عَنْ بَنِي عَمْرِو بْنِ مَبْذُولٍ وَ هُوَ بِبَقِيعِ الزُّبَيْرِ ثُمَّ تَسْأَلُ عَنْ مُوسَى بْنِ جَعْفَرٍ وَ أَيْنَ مَنْزِلُهُ وَ أَيْنَ هُوَ مُسَافِرٌ أَمْ حَاضِرٌ فَإِنْ كَانَ مُسَافِراً فَالْحَقْهُ فَإِنَّ سَفَرَهُ أَقْرَبُ مِمَّا ضَرَبْتَ إِلَيْهِ ثُمَّ أَعْلِمْهُ أَنَّ مَطْرَانَ عُلْيَا الْغُوطَةِ غُوطَةِ دِمَشْقَ هُوَ الَّذِي أَرْشَدَنِي إِلَيْكَ وَ هُوَ يُقْرِئُكَ السَّلَامَ كَثِيراً وَ يَقُولُ لَكَ إِنِّي لَأُكْثِرُ مُنَاجَاةَ رَبِّي أَنْ يَجْعَلَ إِسْلَامِي عَلَى يَدَيْكَ", "فَقَصَّ هَذِهِ الْقِصَّةَ وَ هُوَ قَائِمٌ مُعْتَمِدٌ عَلَى عَصَاهُ ثُمَّ قَالَ إِنْ أَذِنْتَ لِي يَا سَيِّدِي كَفَّرْتُ لَكَ وَ جَلَسْتُ فَقَالَ آذَنُ لَكَ أَنْ تَجْلِسَ وَ لَا آذَنُ لَكَ أَنْ تُكَفِّرَ فَجَلَسَ ثُمَّ أَلْقَى عَنْهُ بُرْنُسَهُ ثُمَّ قَالَ جُعِلْتُ فِدَاكَ تَأْذَنُ لِي فِي الْكَلَامِ قَالَ نَعَمْ مَا جِئْتَ إِلَّا لَهُ فَقَالَ لَهُ النَّصْرَانِيُّ ارْدُدْ عَلَى صَاحِبِي السَّلَامَ أَ وَ مَا تَرُدُّ السَّلَامَ فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) عَلَى صَاحِبِكَ إِنْ هَدَاهُ اللَّهُ فَأَمَّا التَّسْلِيمُ فَذَاكَ إِذَا صَارَ فِي دِينِنَا", "فَقَالَ النَّصْرَانِيُّ إِنِّي أَسْأَلُكَ أَصْلَحَكَ اللَّهُ قَالَ سَلْ قَالَ أَخْبِرْنِي عَنْ كِتَابِ اللَّهِ تَعَالَى الَّذِي أُنْزِلَ عَلَى مُحَمَّدٍ وَ نَطَقَ بِهِ ثُمَّ وَصَفَهُ بِمَا وَصَفَهُ بِهِ فَقَالَ حم. وَ الْكِتابِ الْمُبِينِ. إِنَّا أَنْزَلْناهُ فِي لَيْلَةٍ مُبارَكَةٍ إِنَّا كُنَّا مُنْذِرِينَ. فِيها يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ مَا تَفْسِيرُهَا فِي الْبَاطِنِ", "فَقَالَ الرَّجُلُ صِفْ لِيَ الْأَوَّلَ وَ الْآخِرَ مِنْ هَؤُلَاءِ الرِّجَالِ فَقَالَ إِنَّ الصِّفَاتِ تَشْتَبِهُ وَ لَكِنَّ الثَّالِثَ مِنَ الْقَوْمِ أَصِفُ لَكَ مَا يَخْرُجُ مِنْ نَسْلِهِ وَ إِنَّهُ عِنْدَكُمْ لَفِي الْكُتُبِ الَّتِي نَزَلَتْ عَلَيْكُمْ إِنْ لَمْ تُغَيِّرُوا وَ تُحَرِّفُوا وَ تُكَفِّرُوا وَ قَدِيماً مَا فَعَلْتُمْ", "قَالَ لَهُ النَّصْرَانِيُّ إِنِّي لَا أَسْتُرُ عَنْكَ مَا عَلِمْتُ وَ لَا أُكَذِّبُكَ وَ أَنْتَ تَعْلَمُ مَا أَقُولُ فِي صِدْقِ مَا أَقُولُ وَ كَذِبِهِ وَ اللَّهِ لَقَدْ أَعْطَاكَ اللَّهُ مِنْ فَضْلِهِ وَ قَسَمَ عَلَيْكَ مِنْ نِعَمِهِ مَا لَا يَخْطُرُهُ الْخَاطِرُونَ وَ لَا يَسْتُرُهُ السَّاتِرُونَ وَ لَا يُكَذِّبُ فِيهِ مَنْ كَذَّبَ فَقَوْلِي لَكَ فِي ذَلِكَ الْحَقُّ كَمَا ذَكَرْتُ فَهُوَ كَمَا ذَكَرْتُ", "فَقَالَ لَهُ أَبُو إِبْرَاهِيمَ ( عليه السلام ) أُعَجِّلُكَ أَيْضاً خَبَراً لَا يَعْرِفُهُ إِلَّا قَلِيلٌ مِمَّنْ قَرَأَ الْكُتُبَ أَخْبِرْنِي مَا اسْمُ أُمِّ مَرْيَمَ وَ أَيُّ يَوْمٍ نُفِخَتْ فِيهِ مَرْيَمُ وَ لِكَمْ مِنْ سَاعَةٍ مِنَ النَّهَارِ وَ أَيُّ يَوْمٍ وَضَعَتْ مَرْيَمُ فِيهِ عِيسَى ( عليه السلام ) وَ لِكَمْ مِنْ سَاعَةٍ مِنَ النَّهَارِ فَقَالَ النَّصْرَانِيُّ لَا أَدْرِي ", "فَقَالَ أَبُو إِبْرَاهِيمَ ( عليه السلام ) أَمَّا أُمُّ مَرْيَمَ فَاسْمُهَا مَرْثَا وَ هِيَ وَهِيبَةُ بِالْعَرَبِيَّةِ وَ أَمَّا الْيَوْمُ الَّذِي حَمَلَتْ فِيهِ مَرْيَمُ فَهُوَ يَوْمُ الْجُمُعَةِ لِلزَّوَالِ وَ هُوَ الْيَوْمُ الَّذِي هَبَطَ فِيهِ الرُّوحُ الْأَمِينُ وَ لَيْسَ لِلْمُسْلِمِينَ عِيدٌ كَانَ أَوْلَى مِنْهُ عَظَّمَهُ اللَّهُ تَبَارَكَ وَ تَعَالَى وَ عَظَّمَهُ مُحَمَّدٌ ( صلى الله عليه وآله ) فَأَمَرَ أَنْ يَجْعَلَهُ عِيداً فَهُوَ يَوْمُ الْجُمُعَةِ", "وَ أَمَّا الْيَوْمُ الَّذِي وَلَدَتْ فِيهِ مَرْيَمُ فَهُوَ يَوْمُ الثَّلَاثَاءِ لِأَرْبَعِ سَاعَاتٍ وَ نِصْفٍ مِنَ النَّهَارِ وَ النَّهَرُ الَّذِي وَلَدَتْ عَلَيْهِ مَرْيَمُ عِيسَى ( عليه السلام ) هَلْ تَعْرِفُهُ قَالَ لَا قَالَ هُوَ الْفُرَاتُ وَ عَلَيْهِ شَجَرُ النَّخْلِ وَ الْكَرْمِ وَ لَيْسَ يُسَاوَى بِالْفُرَاتِ شَيْ‏ءٌ لِلْكُرُومِ وَ النَّخِيلِ فَأَمَّا الْيَوْمُ الَّذِي حَجَبَتْ فِيهِ لِسَانَهَا وَ نَادَى قَيْدُوسُ وُلْدَهُ وَ أَشْيَاعَهُ فَأَعَانُوهُ وَ أَخْرَجُوا آلَ عِمْرَانَ لِيَنْظُرُوا إِلَى مَرْيَمَ فَقَالُوا لَهَا مَا قَصَّ اللَّهُ عَلَيْكَ فِي كِتَابِهِ وَ عَلَيْنَا فِي كِتَابِهِ", "فَهَلْ فَهِمْتَهُ قَالَ نَعَمْ وَ قَرَأْتُهُ الْيَوْمَ الْأَحْدَثَ قَالَ إِذَنْ لَا تَقُومَ مِنْ مَجْلِسِكَ حَتَّى يَهْدِيَكَ اللَّهُ قَالَ النَّصْرَانِيُّ مَا كَانَ اسْمُ أُمِّي بِالسُّرْيَانِيَّةِ وَ بِالْعَرَبِيَّةِ فَقَالَ كَانَ اسْمُ أُمِّكَ بِالسُّرْيَانِيَّةِ عَنْقَالِيَةَ وَ عُنْقُورَةَ كَانَ اسْمُ جَدَّتِكَ لِأَبِيكَ وَ أَمَّا اسْمُ أُمِّكَ بِالْعَرَبِيَّةِ فَهُوَ مَيَّةُ وَ أَمَّا اسْمُ أَبِيكَ فَعَبْدُ الْمَسِيحِ وَ هُوَ عَبْدُ اللَّهِ بِالْعَرَبِيَّةِ وَ لَيْسَ لِلْمَسِيحِ عَبْدٌ", "قَالَ صَدَقْتَ وَ بَرِرْتَ فَمَا كَانَ اسْمُ جَدِّي قَالَ كَانَ اسْمُ جَدِّكَ جَبْرَئِيلَ وَ هُوَ عَبْدُ الرَّحْمَنِ سَمَّيْتُهُ فِي مَجْلِسِي هَذَا قَالَ أَمَا إِنَّهُ كَانَ مُسْلِماً قَالَ أَبُو إِبْرَاهِيمَ ( عليه السلام ) نَعَمْ وَ قُتِلَ شَهِيداً دَخَلَتْ عَلَيْهِ أَجْنَادٌ فَقَتَلُوهُ فِي مَنْزِلِهِ غِيلَةً وَ الْأَجْنَادُ مِنْ أَهْلِ الشَّامِ قَالَ فَمَا كَانَ اسْمِي قَبْلَ كُنْيَتِي قَالَ كَانَ اسْمُكَ عَبْدَ الصَّلِيبِ قَالَ فَمَا تُسَمِّينِي قَالَ أُسَمِّيكَ عَبْدَ اللَّهِ", "قَالَ فَإِنِّي آمَنْتُ بِاللَّهِ الْعَظِيمِ وَ شَهِدْتُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ فَرْداً صَمَداً لَيْسَ كَمَا تَصِفُهُ النَّصَارَى وَ لَيْسَ كَمَا تَصِفُهُ الْيَهُودُ وَ لَا جِنْسٌ مِنْ أَجْنَاسِ الشِّرْكِ", "وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ أَرْسَلَهُ بِالْحَقِّ فَأَبَانَ بِهِ لِأَهْلِهِ وَ عَمِيَ الْمُبْطِلُونَ وَ أَنَّهُ كَانَ رَسُولَ اللَّهِ إِلَى النَّاسِ كَافَّةً إِلَى الْأَحْمَرِ وَ الْأَسْوَدِ كُلٌّ فِيهِ مُشْتَرِكٌ فَأَبْصَرَ مَنْ أَبْصَرَ وَ اهْتَدَى مَنِ اهْتَدَى وَ عَمِيَ الْمُبْطِلُونَ وَ ضَلَّ عَنْهُمْ مَا كَانُوا يَدْعُونَ ", "وَ أَشْهَدُ أَنَّ وَلِيَّهُ نَطَقَ بِحِكْمَتِهِ وَ أَنَّ مَنْ كَانَ قَبْلَهُ مِنَ الْأَنْبِيَاءِ نَطَقُوا بِالْحِكْمَةِ الْبَالِغَةِ وَ تَوَازَرُوا عَلَى الطَّاعَةِ لِلَّهِ وَ فَارَقُوا الْبَاطِلَ وَ أَهْلَهُ وَ الرِّجْسَ وَ أَهْلَهُ وَ هَجَرُوا سَبِيلَ الضَّلَالَةِ وَ نَصَرَهُمُ اللَّهُ بِالطَّاعَةِ لَهُ وَ عَصَمَهُمْ مِنَ الْمَعْصِيَةِ فَهُمْ لِلَّهِ أَوْلِيَاءُ وَ لِلدِّينِ أَنْصَارٌ يَحُثُّونَ عَلَى الْخَيْرِ وَ يَأْمُرُونَ بِهِ", "آمَنْتُ بِالصَّغِيرِ مِنْهُمْ وَ الْكَبِيرِ وَ مَنْ ذَكَرْتُ مِنْهُمْ وَ مَنْ لَمْ أَذْكُرْ وَ آمَنْتُ بِاللَّهِ تَبَارَكَ وَ تَعَالَى رَبِّ الْعَالَمِينَ", "ثُمَّ قَطَعَ زُنَّارَهُ وَ قَطَعَ صَلِيباً كَانَ فِي عُنُقِهِ مِنْ ذَهَبٍ ثُمَّ قَالَ مُرْنِي حَتَّى أَضَعَ صَدَقَتِي حَيْثُ تَأْمُرُنِي فَقَالَ هَاهُنَا أَخٌ لَكَ كَانَ عَلَى مِثْلِ دِينِكَ وَ هُوَ رَجُلٌ مِنْ قَوْمِكَ مِنْ قَيْسِ بْنِ ثَعْلَبَةَ وَ هُوَ فِي نِعْمَةٍ كَنِعْمَتِكَ فَتَوَاسَيَا وَ تَجَاوَرَا وَ لَسْتُ أَدَعُ أَنْ أُورِدَ عَلَيْكُمَا حَقَّكُمَا فِي الْإِسْلَامِ ", "اللَّهِ أَصْلَحَكَ اللَّهُ إِنِّي لَغَنِيٌّ وَ لَقَدْ تَرَكْتُ ثَلَاثَمِائَةِ طَرُوقٍ بَيْنَ فَرَسٍ وَ فَرَسَةٍ وَ تَرَكْتُ أَلْفَ بَعِيرٍ فَحَقُّكَ فِيهَا أَوْفَرُ مِنْ حَقِّي فَقَالَ لَهُ أَنْتَ مَوْلَى اللَّهِ وَ رَسُولِهِ وَ أَنْتَ فِي حَدِّ نَسَبِكَ عَلَى حَالِكَ", "فَقَالَ و فَحَسُنَ إِسْلَامُهُ وَ تَزَوَّجَ امْرَأَةً مِنْ بَنِي فِهْرٍ وَ أَصْدَقَهَا أَبُو إِبْرَاهِيمَ ( عليه السلام ) خَمْسِينَ دِينَاراً مِنْ صَدَقَةِ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) وَ أَخْدَمَهُ وَ بَوَّأَهُ وَ أَقَامَ حَتَّى أُخْرِجَ أَبُو إِبْرَاهِيمَ ( عليه السلام ) فَمَاتَ بَعْدَ مَخْرَجِهِ بِثَمَانٍ وَ عِشْرِينَ لَيْلَةً ."], "translations": {"en.hubeali": ["Ahmad Bin Mihran and Ali Bin Ibrahim, altogether from Muhammad Bin Ali, from Al Hassan Bin Rashid, from Yaqoub Bin Ja’far Bin Ibrahim who said, ", "‘I was in the presence of Abu Al-Hassan Musa<sup>asws</sup> when a Christian man came over to him<sup>asws</sup>, and we were with him<sup>asws</sup> at Al-Urayz. So the Christian said to him<sup>asws</sup>, ‘I come to you<sup>asws</sup> from a distant city and a grievous journey, and I had asked my Lord<sup>azwj</sup> thirty years ago that He<sup>azwj</sup> should Guide me to the best of the Religion, and to the best of the servants, and the most knowledgeable of them. And a comer came to be during the sleep, and he described a man to me in the upper part of Damascus. So I went until I came over to him and spoke to him.", "So he said, ‘(No doubt) I know more than the most people of my religion, but there is another who is more knowledgeable than me’. So I said, ‘Guide me to the one who is more knowledgeable than you, for there neither is the journey too difficult nor too distant upon me, and I have recited the Evangel, all of it, and the Psalms of Dawood<sup>as</sup>, and I have read the four Books from the Torah, and I have read the apparent Quran to the extent that I have absorbed all of it’. ", "So the scholar said to me, ‘If you are intending the knowledge of Christianity, so I am the most knowledgeable of the Arabs and non-Arabs with it, and if you were intending the knowledge of the Jews, so Baty Bin Shurjeel Al-Samiry is the most knowledgeable of the people with it today, and if you are intending the knowledge of Al-Islam, and the knowledge of the Torah, and the knowledge of the Evangel, and the knowledge of the Psalms, and the Book of Hud<sup>as</sup>, and everything which was Revealed unto a Prophet<sup>as</sup> from the Prophets<sup>as</sup> during your time and the time of others, and whatever was Revealed from the sky from a news, so whether anyone knows it or does not know of it, wherein is an explanation of everything and a healing for the world, and a rest for the one who seeks rest to it, and an insight for the one who intends Allah<sup>azwj</sup> with it, a goodness and a comfort to the Truth, so I can guide you to him<sup>asws</sup>. So go to him<sup>asws</sup>, and even if it be walking upon your feet. So if you are not able, so crawl upon your knees. So if you are not able, then dragging upon your body/bottom. So if you are not able, so upon your face’. ", "So I said, ‘No, but I am able upon the travelling, regarding the body (health) and the wealth’. He said, ‘So go immediately until you get to Yasrib’ (Madina). I said, ‘I do not recognise Yasrib’. He said, ‘So go until you come to Medina of the Prophet<sup>saww</sup> who was Sent among the Arabs, and he is the Arabian Prophet<sup>saww</sup>, the Hashimite. So when you enter it, so ask about the Clan of Ghanam Bin Malik Bin Al-Najjar, and it would be by the door of its Masjid, and display the overall of the Christians and their ornaments, for its governor is difficult upon them and the Caliph is even more difficult. ", "Then you should ask about the Clan of Amro Bin Mabzoul, and it would be at the spot of Al-Zubeyr. Then you should ask about Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> and where his<sup>asws</sup> house is, and whether he<sup>asws</sup> is, travelling or present. So if he<sup>asws</sup> was travelling, so meet up with him<sup>asws</sup>, for his<sup>asws</sup> journey would be nearer that what you would have to travel to him<sup>asws</sup>. Then let him<sup>asws</sup> know that the high Bishop of Al-Ghowtat, the Ghowta of Damascus, he is the one who guided you to him<sup>asws</sup>, and he conveys a lot of greetings and is saying to you<sup>asws</sup>, ‘I frequently tend to whisper to my Lord<sup>azwj</sup> that He<sup>azwj</sup> Makes my Islam to be upon your<sup>asws</sup> hands’. ", "So he (the Christian man) related this story and he was standing, leaning upon his<sup>asws</sup> staff, then he said: ‘If you<sup>asws</sup> permit me, O my Master<sup>asws</sup>, to fold my hands to you<sup>asws</sup> and be seated’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> permit for you that you be seated, and I<sup>asws</sup> do not permit for you that you fold hands’. So he sat down, then threw down his hat from himself, then said, ‘May I be sacrificed for you<sup>asws</sup>! Do you<sup>asws</sup> permit for me regarding the speech?’ He<sup>asws</sup> said: ‘Yes. You have not come (here) except for it’. So the Christian said to him<sup>asws</sup>, ‘Will you return the greeting upon my companion, or you<sup>asws</sup> will not return the greeting?’. So Abu Al-Hassan<sup>asws</sup> said: ‘Upon your companions is that Allah<sup>azwj</sup> Guided him. So, as for the greeting, so that is when he comes to be upon our Religion’. ", "So the Christian said, ‘I would like to ask you<sup>asws</sup>, may Allah<sup>azwj</sup> Keep you<sup>asws</sup> well!’ He<sup>asws</sup> said: ‘Ask’. He said, ‘Inform me about the Book of Allah<sup>azwj</sup> the Exalted which He<sup>azwj</sup> Revealed unto Muhammad<sup>saww</sup>, and he<sup>saww</sup> spoke by it. Then He<sup>azwj</sup> Described with what He<sup>azwj</sup> Described with, So He<sup>azwj</sup> Said: ‘<span class=\"ibTxt\">[44:1] Ha Mim! [44:2] I swear by the Clarifying Book [44:3] Surely We Revealed it on a Blessed Night surely We are ever Warning [44:4] Therein every wise affair is made distinct</span> – what is its esoteric interpretation (hidden meanings)?’", "فَقَالَ أَمَّا حم فَهُوَ مُحَمَّدٌ ( صلى الله عليه وآله ) وَ هُوَ فِي كِتَابِ هُودٍ الَّذِي أُنْزِلَ عَلَيْهِ وَ هُوَ مَنْقُوصُ الْحُرُوفِ وَ أَمَّا الْكِتابِ الْمُبِينِ فَهُوَ أَمِيرُ الْمُؤْمِنِينَ عَلِيٌّ ( عليه السلام ) وَ أَمَّا اللَّيْلَةُ فَفَاطِمَةُ ( عليها السلام ) وَ أَمَّا قَوْلُهُ فِيها يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ يَقُولُ يَخْرُجُ مِنْهَا خَيْرٌ كَثِيرٌ فَرَجُلٌ حَكِيمٌ وَ رَجُلٌ حَكِيمٌ وَ رَجُلٌ حَكِيمٌ ", "So he<sup>asws</sup> said: ‘As for <span class=\"ibTxt\">[44:1] Ha Mim!</span>, so it is Muhammad<sup>saww</sup>, and it is in the Book of Hud<sup>as</sup> which was Revealed unto him<sup>as</sup>, and it is an abbreviation of the letters. And as for the Book, so it is Amir Al-Momineen Ali<sup>asws</sup>, and as for the night, so it is (Syeda) Fatima<sup>asws</sup>, and as for His<sup>azwj</sup> Words <span class=\"ibTxt\">[44:4] Therein every wise affair is made distinct</span>, He<sup>azwj</sup> is Saying that there comes out from it a lot of good, so a wise man, and a wise man, and a wise man’. ", "So the man said, ‘Describe the first and the last to me, who are these men?’ So he<sup>asws</sup> said: ‘The descriptions are similar, but the third from the group, I<sup>asws</sup> shall describe to you, what came out from his<sup>asws</sup> lineage, and he<sup>asws</sup> is with you all in the Books which were Revealed unto you, if you have not changed, altered and the rejected (these), and for long (this is) what you have been doing’. ", "The Christian said to him<sup>asws</sup>, ‘I shall not veil upon you<sup>asws</sup>, nor shall I lie, and you<sup>asws</sup> know what I am saying is true and its lies. By Allah<sup>azwj</sup>! Allah<sup>azwj</sup> has Granted you<sup>asws</sup> from His<sup>azwj</sup> Grace and Distributed upon you<sup>asws</sup> from His<sup>azwj</sup> Bounties what neither the notifiers have been notified of it, nor have the concealer concealed it, nor can he belie with regards to it, the one who belies. So, my words to you<sup>asws</sup> regarding it is that the truth is just as I mention, so it is indeed just as I mentioned’. ", "So Abu Ibrahim<sup>asws</sup> said to him: ‘I<sup>asws</sup> can give you news as well which none recognise it except for a few from the ones who read the Books. Inform me<sup>asws</sup>, what is the name of the mother of Maryam<sup>as</sup>, and in which day was (the spirit of) Maryam<sup>as</sup> blown into her, and at what time of the day, and in which day did Maryam<sup>as</sup> place (was blessed with) Isa<sup>as</sup>, and at which time of the day?’ So the Christian said, ‘I don’t know’. ", "So Abu Ibrahim<sup>asws</sup> said: ‘As for the mother of Maryam<sup>as</sup>, so her name was Martha, and it is ‘prestige’ in Arabic, and as for the day in which Maryam<sup>as</sup> was born, so it was the day of Friday at midday, and it is the day in which the Trustworthy Spirit descended, and there isn’t an Eid (festival) for the Muslims which was higher than it. Allah<sup>azwj</sup> Blessed and High Magnified it, and Muhammad<sup>saww</sup> magnified it, so he<sup>saww</sup> ordered that it be made to be an Eid, so it is a day of gathering.", "And as for the day in which Maryam<sup>as</sup> was born, so it is the day of Tuesday, four and half hours from the day. And the river at which Maryam<sup>as</sup> gave birth to Isa<sup>as</sup>, do you know it?’ He said, ‘No’. He<sup>asws</sup> said: ‘It is the Euphrates, and upon it was a palm tree and the dates, and there isn’t a place equal to the Euphrates for the dates and the palm trees. So, as for the day in which she veiled her<sup>as</sup> tongue, and Qaydous (the Chief of the Israelites) called his sons and his adherents, so they supported him and threw out the Family of Imran<sup>as</sup> in order to look at Maryam<sup>as</sup>. So they said to her, ‘What is the story of Allah<sup>azwj</sup> upon you<sup>as</sup> in His<sup>azwj</sup> Book, and against us in His<sup>azwj</sup> Book?’", "So, do you understand it?’ He said, ‘Yes, and I recited it today, a while ago’. He<sup>asws</sup> said: ‘Then you should not be standing from your seat until Allah<sup>azwj</sup> Guides you’. The Christian said, ‘What was the name of my mother in Assyrian and in Arabic?’ So he<sup>asws</sup> said: ‘The name of your mother in Assyrian was Anqaliya, and Unqoura was the name of your grandmother of your father’s side; and as for the name of your mother in Arabic, so it is Mayya, and as for the name of your father, so it was Abdul Maseeh, and it is Abdullah in Arabic, and there is no worshipper for the Messiah’. ", "He said, ‘You speak the truth and are vindicated. So what was the name of my grandfather?’ He<sup>asws</sup> said: ‘The name of your grandfather was Jibraeel and it is Abdul Rahman. I<sup>asws</sup> name him in this gathering of mine<sup>asws</sup>’. He said, ‘But, was he a Muslim?’ Abu Ibrahim<sup>as</sup> said: ‘Yes, and he was killed a marty. The army came upon him, so they killed him in his house as an assassination, and the forces were from the people of Syria’. He said, ‘So what used to be my name before my teknonym?’ He<sup>asws</sup> said: ‘Your name was Abdul Saleeb’. He said, ‘So what would you<sup>asws</sup> name me as?’ He<sup>asws</sup> said: ‘Your name is Abdullah’. ", "He said, ‘So I hereby believe in Allah<sup>azwj</sup> the Magnificent, and I testify that there is no god except Allah<sup>azwj</sup>, Alone, there being no associates for Him<sup>azwj</sup>, Individual, Self’Sufficient. He<sup>azwj</sup> isn’t as the Christians describe Him<sup>azwj</sup>, and He<sup>azwj</sup> isn’t as the Jews describe Him<sup>azwj</sup>, nor is He<sup>azwj</sup> a species from the species of the ‘Al-Shirk’. ", "And I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>. He<sup>azwj</sup> Sent him<sup>azwj</sup> with the Truth. So he<sup>saww</sup> explained it to its rightful ones and blinded the falsifies, and he<sup>saww</sup> was Rasool<sup>saww</sup> of Allah<sup>azwj</sup> to the people, all of them - to the red and the black. All were common with regards to it. So he noticed, the one who noticed, and he was guided, the one who was guided, and the falsifiers were blinded and it was from them what they were calling to.", "And I testify that his<sup>saww</sup> successor<sup>asws</sup> spoke with his<sup>saww</sup> wisdom, and that the one who was before him<sup>saww</sup> from the Prophets<sup>saww</sup> spoke with the eloquent wisdom, and they backed each other upon the obedience to Allah<sup>azwj</sup> and they<sup>as</sup> separated the falsehood and its people, and the uncleanness and its people, and they fled from the way of the straying, and Allah<sup>azwj</sup> Helped them<sup>as</sup> with the obedience to Him<sup>azwj</sup> and Rescued them<sup>as</sup> from the disobedience. Thus, they<sup>as</sup> were the Guardians<sup>asws</sup> of Allah<sup>azwj</sup> and the helpers of the Religion, urging upon the goodness and enjoining with it. ", "I believe in the young of them<sup>as</sup> and the old, and the ones who were Mentioned from them<sup>as</sup> and the ones who were not Mentioned. And I believe in Allah<sup>saww</sup> Blessed and High, Lord<sup>azwj</sup> of the world’. ", "Then he cut off his strap and his crucifix of gold which was in his neck, then said, ‘Order me until I place my charities wherever you<sup>asws</sup> instruct me to’. So he<sup>asws</sup> said: ‘Over there is a bother of yours upon the like of your Religion, and he is a man from your people from Qays Bin Sa’alba, and he is in a Bounty like your Bounty. Therefore console each other and co-operate with each other, and I<sup>asws</sup> will not let you leave your rights which are upon you in Al-Islam’. ", "So he said, ‘By Allah<sup>azwj</sup>! May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! I am rich, and I have left three hundred horses, male and female, and left a thousand camels, therefore your<sup>asws</sup> right are more than my rights’. So he<sup>asws</sup> said to him: ‘You are a slave of Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and you are in a limit of your ancestry, upon your state’. ", "So he (the narrator) said, ‘And excellent was his Islam, and he married a woman from the Clan of Fihr, and Abu Ibrahim<sup>asws</sup> paid her dowry of Fifty Dinars from the charity of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and gave him a servant and accommodated him, and looked after him until Abu Ibrahim<sup>asws</sup> was brought out (to go to prison). So he died after his<sup>asws</sup> exit by twenty-eight nights’."]}}, {"index": 1286, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:120:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ وَ أَحْمَدُ بْنُ مِهْرَانَ جَمِيعاً عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ يَعْقُوبَ بْنِ جَعْفَرٍ قَالَ كُنْتُ عِنْدَ أَبِي إِبْرَاهِيمَ ( عليه السلام ) وَ أَتَاهُ رَجُلٌ مِنْ أَهْلِ نَجْرَانَ الْيَمَنِ مِنَ الرُّهْبَانِ وَ مَعَهُ رَاهِبَةٌ فَاسْتَأْذَنَ لَهُمَا الْفَضْلُ بْنُ سَوَّارٍ فَقَالَ لَهُ إِذَا كَانَ غَداً فَأْتِ بِهِمَا عِنْدَ بِئْرِ أُمِّ خَيْرٍ", "قَالَ فَوَافَيْنَا مِنَ الْغَدِ فَوَجَدْنَا الْقَوْمَ قَدْ وَافَوْا فَأَمَرَ بِخَصَفَةِ بَوَارِيَّ ثُمَّ جَلَسَ وَ جَلَسُوا فَبَدَأَتِ الرَّاهِبَةُ بِالْمَسَائِلِ فَسَأَلَتْ عَنْ مَسَائِلَ كَثِيرَةٍ كُلُّ ذَلِكَ يُجِيبُهَا وَ سَأَلَهَا أَبُو إِبْرَاهِيمَ ( عليه السلام ) عَنْ أَشْيَاءَ لَمْ يَكُنْ عِنْدَهَا فِيهِ شَيْ‏ءٌ ثُمَّ أَسْلَمَتْ ثُمَّ أَقْبَلَ الرَّاهِبُ يَسْأَلُهُ فَكَانَ يُجِيبُهُ فِي كُلِّ مَا يَسْأَلُهُ", "فَقَالَ الرَّاهِبُ قَدْ كُنْتُ قَوِيّاً عَلَى دِينِي وَ مَا خَلَّفْتُ أَحَداً مِنَ النَّصَارَى فِي الْأَرْضِ يَبْلُغُ مَبْلَغِي فِي الْعِلْمِ وَ لَقَدْ سَمِعْتُ بِرَجُلٍ فِي الْهِنْدِ إِذَا شَاءَ حَجَّ إِلَى بَيْتِ الْمَقْدِسِ فِي يَوْمٍ وَ لَيْلَةٍ ثُمَّ يَرْجِعُ إِلَى مَنْزِلِهِ بِأَرْضِ الْهِنْدِ فَسَأَلْتُ عَنْهُ بِأَيِّ أَرْضٍ هُوَ فَقِيلَ لِي إِنَّهُ بِسُبْذَانَ وَ سَأَلْتُ الَّذِي أَخْبَرَنِي فَقَالَ هُوَ عَلِمَ الِاسْمَ الَّذِي ظَفِرَ بِهِ آصَفُ صَاحِبُ سُلَيْمَانَ لَمَّا أَتَى بِعَرْشِ سَبَإٍ وَ هُوَ الَّذِي ذَكَرَهُ اللَّهُ لَكُمْ فِي كِتَابِكُمْ وَ لَنَا مَعْشَرَ الْأَدْيَانِ فِي كُتُبِنَا", "فَقَالَ لَهُ أَبُو إِبْرَاهِيمَ ( عليه السلام ) فَكَمْ لِلَّهِ مِنِ اسْمٍ لَا يُرَدُّ فَقَالَ الرَّاهِبُ الْأَسْمَاءُ كَثِيرَةٌ فَأَمَّا الْمَحْتُومُ مِنْهَا الَّذِي لَا يُرَدُّ سَائِلُهُ فَسَبْعَةٌ فَقَالَ لَهُ أَبُو الْحَسَنِ ( عليه السلام ) فَأَخْبِرْنِي عَمَّا تَحْفَظُ مِنْهَا قَالَ الرَّاهِبُ لَا وَ اللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى وَ جَعَلَ عِيسَى عِبْرَةً لِلْعَالَمِينَ وَ فِتْنَةً لِشُكْرِ أُولِي الْأَلْبَابِ وَ جَعَلَ مُحَمَّداً بَرَكَةً وَ رَحْمَةً وَ جَعَلَ عَلِيّاً ( عليه السلام ) عِبْرَةً وَ بَصِيرَةً وَ جَعَلَ الْأَوْصِيَاءَ مِنْ نَسْلِهِ وَ نَسْلِ مُحَمَّدٍ مَا أَدْرِي وَ لَوْ دَرَيْتُ مَا احْتَجْتُ فِيهِ إِلَى كَلَامِكَ وَ لَا جِئْتُكَ وَ لَا سَأَلْتُكَ", "فَقَالَ لَهُ أَبُو إِبْرَاهِيمَ ( عليه السلام ) عُدْ إِلَى حَدِيثِ الْهِنْدِيِّ فَقَالَ لَهُ الرَّاهِبُ سَمِعْتُ بِهَذِهِ الْأَسْمَاءِ وَ لَا أَدْرِي مَا بِطَانَتُهَا وَ لَا شَرَائِحُهَا وَ لَا أَدْرِي مَا هِيَ وَ لَا كَيْفَ هِيَ وَ لَا بِدُعَائِهَا فَانْطَلَقْتُ حَتَّى قَدِمْتُ سُبْذَانَ الْهِنْدِ فَسَأَلْتُ عَنِ الرَّجُلِ فَقِيلَ لِي إِنَّهُ بَنَى دَيْراً فِي جَبَلٍ فَصَارَ لَا يَخْرُجُ وَ لَا يُرَى إِلَّا فِي كُلِّ سَنَةٍ مَرَّتَيْنِ وَ زَعَمَتِ الْهِنْدُ أَنَّ اللَّهَ فَجَّرَ لَهُ عَيْناً فِي دَيْرِهِ وَ زَعَمَتِ الْهِنْدُ أَنَّهُ يُزْرَعُ لَهُ مِنْ غَيْرِ زَرْعٍ يُلْقِيهِ وَ يُحْرَثُ لَهُ مِنْ غَيْرِ حَرْثٍ يَعْمَلُهُ", "فَانْتَهَيْتُ إِلَى بَابِهِ فَأَقَمْتُ ثَلَاثاً لَا أَدُقُّ الْبَابَ وَ لَا أُعَالِجُ الْبَابَ فَلَمَّا كَانَ الْيَوْمُ الرَّابِعُ فَتَحَ اللَّهُ الْبَابَ وَ جَاءَتْ بَقَرَةٌ عَلَيْهَا حَطَبٌ تَجُرُّ ضَرْعَهَا يَكَادُ يَخْرُجُ مَا فِي ضَرْعِهَا مِنَ اللَّبَنِ فَدَفَعَتِ الْبَابَ فَانْفَتَحَ فَتَبِعْتُهَا وَ دَخَلْتُ فَوَجَدْتُ الرَّجُلَ قَائِماً يَنْظُرُ إِلَى السَّمَاءِ فَيَبْكِي وَ يَنْظُرُ إِلَى الْأَرْضِ فَيَبْكِي وَ يَنْظُرُ إِلَى الْجِبَالِ فَيَبْكِي", "فَقُلْتُ سُبْحَانَ اللَّهِ مَا أَقَلَّ ضَرْبَكَ فِي دَهْرِنَا هَذَا فَقَالَ لِي وَ اللَّهِ مَا أَنَا إِلَّا حَسَنَةٌ مِنْ حَسَنَاتِ رَجُلٍ خَلَّفْتَهُ وَرَاءَ ظَهْرِكَ فَقُلْتُ لَهُ أُخْبِرْتُ أَنَّ عِنْدَكَ اسْماً مِنْ أَسْمَاءِ اللَّهِ تَبْلُغُ بِهِ فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ بَيْتَ الْمَقْدِسِ وَ تَرْجِعُ إِلَى بَيْتِكَ فَقَالَ لِي وَ هَلْ تَعْرِفُ بَيْتَ الْمَقْدِسِ قُلْتُ لَا أَعْرِفُ إِلَّا بَيْتَ الْمَقْدِسِ الَّذِي بِالشَّامِ قَالَ لَيْسَ بَيْتَ الْمَقْدِسِ وَ لَكِنَّهُ الْبَيْتُ الْمُقَدَّسُ وَ هُوَ بَيْتُ آلِ مُحَمَّدٍ ( صلى الله عليه وآله )", "فَقُلْتُ لَهُ أَمَّا مَا سَمِعْتُ بِهِ إِلَى يَوْمِي هَذَا فَهُوَ بَيْتُ الْمَقْدِسِ فَقَالَ لِي تِلْكَ مَحَارِيبُ الْأَنْبِيَاءِ وَ إِنَّمَا كَانَ يُقَالُ لَهَا حَظِيرَةُ الْمَحَارِيبِ حَتَّى جَاءَتِ الْفَتْرَةُ الَّتِي كَانَتْ بَيْنَ مُحَمَّدٍ وَ عِيسَى ( صلوات الله عليهما ) وَ قَرُبَ الْبَلَاءُ مِنْ أَهْلِ الشِّرْكِ وَ حَلَّتِ النَّقِمَاتُ فِي دُورِ الشَّيَاطِينِ فَحَوَّلُوا وَ بَدَّلُوا وَ نَقَلُوا تِلْكَ الْأَسْمَاءَ وَ هُوَ قَوْلُ اللَّهِ تَبَارَكَ وَ تَعَالَى الْبَطْنُ لآِلِ مُحَمَّدٍ وَ الظَّهْرُ مَثَلٌ إِنْ هِيَ إِلَّا أَسْماءٌ سَمَّيْتُمُوها أَنْتُمْ وَ آباؤُكُمْ ما أَنْزَلَ اللَّهُ بِها مِنْ سُلْطانٍ ", "فَقُلْتُ لَهُ إِنِّي قَدْ ضَرَبْتُ إِلَيْكَ مِنْ بَلَدٍ بَعِيدٍ تَعَرَّضْتُ إِلَيْكَ بِحَاراً وَ غُمُوماً وَ هُمُوماً وَ خَوْفاً وَ أَصْبَحْتُ وَ أَمْسَيْتُ مُؤْيَساً أَلَّا أَكُونَ ظَفِرْتُ بِحَاجَتِي فَقَالَ لِي مَا أَرَى أُمَّكَ حَمَلَتْ بِكَ إِلَّا وَ قَدْ حَضَرَهَا مَلَكٌ كَرِيمٌ وَ لَا أَعْلَمُ أَنَّ أَبَاكَ حِينَ أَرَادَ الْوُقُوعَ بِأُمِّكَ إِلَّا وَ قَدِ اغْتَسَلَ وَ جَاءَهَا عَلَى طُهْرٍ وَ لَا أَزْعُمُ إِلَّا أَنَّهُ قَدْ كَانَ دَرَسَ السِّفْرَ الرَّابِعَ مِنْ سَهَرِهِ ذَلِكَ فَخُتِمَ لَهُ بِخَيْرٍ", "ارْجِعْ مِنْ حَيْثُ جِئْتَ فَانْطَلِقْ حَتَّى تَنْزِلَ مَدِينَةَ مُحَمَّدٍ ( صلى الله عليه وآله ) الَّتِي يُقَالُ لَهَا طَيْبَةُ وَ قَدْ كَانَ اسْمُهَا فِي الْجَاهِلِيَّةِ يَثْرِبَ ثُمَّ اعْمِدْ إِلَى مَوْضِعٍ مِنْهَا يُقَالُ لَهُ الْبَقِيعُ ثُمَّ سَلْ عَنْ دَارٍ يُقَالُ لَهَا دَارُ مَرْوَانَ فَانْزِلْهَا وَ أَقِمْ ثَلَاثاً ثُمَّ سَلْ عَنِ الشَّيْخِ الْأَسْوَدِ الَّذِي يَكُونُ عَلَى بَابِهَا يَعْمَلُ الْبَوَارِيَّ وَ هِيَ فِي بِلَادِهِمُ اسْمُهَا الْخَصَفُ فَالْطُفْ بِالشَّيْخِ وَ قُلْ لَهُ بَعَثَنِي إِلَيْكَ نَزِيلُكَ الَّذِي كَانَ يَنْزِلُ فِي الزَّاوِيَةِ فِي الْبَيْتِ الَّذِي فِيهِ الْخُشَيْبَاتُ الْأَرْبَعُ ", "ثُمَّ سَلْهُ عَنْ فُلَانِ بْنِ فُلَانٍ الْفُلَانِيِّ وَ سَلْهُ أَيْنَ نَادِيهِ وَ سَلْهُ أَيُّ سَاعَةٍ يَمُرُّ فِيهَا فَلَيُرِيكَاهُ أَوْ يَصِفُهُ لَكَ فَتَعْرِفُهُ بِالصِّفَةِ وَ سَأَصِفُهُ لَكَ قُلْتُ فَإِذَا لَقِيتُهُ فَأَصْنَعُ مَا ذَا قَالَ سَلْهُ عَمَّا كَانَ وَ عَمَّا هُوَ كَائِنٌ وَ سَلْهُ عَنْ مَعَالِمِ دِينِ مَنْ مَضَى وَ مَنْ بَقِيَ ", "فَقَالَ لَهُ أَبُو إِبْرَاهِيمَ ( عليه السلام ) قَدْ نَصَحَكَ صَاحِبُكَ الَّذِي لَقِيتَ فَقَالَ الرَّاهِبُ مَا اسْمُهُ جُعِلْتُ فِدَاكَ قَالَ هُوَ مُتَمِّمُ بْنُ فَيْرُوزٍ وَ هُوَ مِنْ أَبْنَاءِ الْفُرْسِ وَ هُوَ مِمَّنْ آمَنَ بِاللَّهِ وَحْدَهُ لَا شَرِيكَ لَهُ وَ عَبَدَهُ بِالْإِخْلَاصِ وَ الْإِيقَانِ وَ فَرَّ مِنْ قَوْمِهِ لَمَّا خَافَهُمْ فَوَهَبَ لَهُ رَبُّهُ حُكْماً وَ هَدَاهُ لِسَبِيلِ الرَّشَادِ وَ جَعَلَهُ مِنَ الْمُتَّقِينَ وَ عَرَّفَ بَيْنَهُ وَ بَيْنَ عِبَادِهِ الْمُخْلَصِينَ وَ مَا مِنْ سَنَةٍ إِلَّا وَ هُوَ يَزُورُ فِيهَا مَكَّةَ حَاجّاً وَ يَعْتَمِرُ فِي رَأْسِ كُلِّ شَهْرٍ مَرَّةً وَ يَجِي‏ءُ مِنْ مَوْضِعِهِ مِنَ الْهِنْدِ إِلَى مَكَّةَ فَضْلًا مِنَ اللَّهِ وَ عَوْناً وَ كَذَلِكَ يَجْزِي اللَّهُ الشَّاكِرِينَ ", "ثُمَّ سَأَلَهُ الرَّاهِبُ عَنْ مَسَائِلَ كَثِيرَةٍ كُلُّ ذَلِكَ يُجِيبُهُ فِيهَا وَ سَأَلَ الرَّاهِبَ عَنْ أَشْيَاءَ لَمْ يَكُنْ عِنْدَ الرَّاهِبِ فِيهَا شَيْ‏ءٌ فَأَخْبَرَهُ بِهَا ثُمَّ إِنَّ الرَّاهِبَ قَالَ أَخْبِرْنِي عَنْ ثَمَانِيَةِ أَحْرُفٍ نَزَلَتْ فَتَبَيَّنَ فِي الْأَرْضِ مِنْهَا أَرْبَعَةٌ وَ بَقِيَ فِي الْهَوَاءِ مِنْهَا أَرْبَعَةٌ عَلَى مَنْ نَزَلَتْ تِلْكَ الْأَرْبَعَةُ الَّتِي فِي الْهَوَاءِ وَ مَنْ يُفَسِّرُهَا قَالَ ذَاكَ قَائِمُنَا يُنْزِلُهُ اللَّهُ عَلَيْهِ فَيُفَسِّرُهُ وَ يُنَزِّلُ عَلَيْهِ مَا لَمْ يُنَزِّلْ عَلَى الصِّدِّيقِينَ وَ الرُّسُلِ وَ الْمُهْتَدِينَ ", "ثُمَّ قَالَ الرَّاهِبُ فَأَخْبِرْنِي عَنِ الِاثْنَيْنِ مِنْ تِلْكَ الْأَرْبَعَةِ الْأَحْرُفِ الَّتِي فِي الْأَرْضِ مَا هِيَ قَالَ أُخْبِرُكَ بِالْأَرْبَعَةِ كُلِّهَا أَمَّا أَوَّلُهُنَّ فَلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ بَاقِياً وَ الثَّانِيَةُ مُحَمَّدٌ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مُخْلَصاً وَ الثَّالِثَةُ نَحْنُ أَهْلُ الْبَيْتِ وَ الرَّابِعَةُ شِيعَتُنَا مِنَّا وَ نَحْنُ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ رَسُولُ اللَّهِ مِنَ اللَّهِ بِسَبَبٍ", "فَقَالَ لَهُ الرَّاهِبُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ وَ أَنَّ مَا جَاءَ بِهِ مِنْ عِنْدِ اللَّهِ حَقٌّ وَ أَنَّكُمْ صَفْوَةُ اللَّهِ مِنْ خَلْقِهِ وَ أَنَّ شِيعَتَكُمُ الْمُطَهَّرُونَ الْمُسْتَبْدَلُونَ وَ لَهُمْ عَاقِبَةُ اللَّهِ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ", "فَدَعَا أَبُو إِبْرَاهِيمَ ( عليه السلام ) بِجُبَّةِ خَزٍّ وَ قَمِيصٍ قُوهِيٍّ وَ طَيْلَسَانٍ وَ خُفٍّ وَ قَلَنْسُوَةٍ فَأَعْطَاهُ إِيَّاهَا وَ صَلَّى الظُّهْرَ وَ قَالَ لَهُ اخْتَتِنْ فَقَالَ قَدِ اخْتَتَنْتُ فِي سَابِعِي ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim and Ahmad Bin Mihran, altogether from Muhammad Bin Ali, from Al Hassan Bin Rashid, from Yaqoub Bin Ja’far who said, ", "‘I was in the presence of Abu Ibrahim<sup>asws</sup>, and a man came over to him<sup>asws</sup> from the people of Najran of Al-Yemen, from the Monks, and with him was a Nun. So Al-Fazl Bin Sawwar sought permission for them, so he<sup>asws</sup> said to him: ‘When it is the morning, so come with both of them by the well of Umm Khayr’. ", "He (the narrator) said, ‘So we kept the appointment the next day, and we found the people to have (also) kept the appointment. So he<sup>asws</sup> ordered with the mat of palm leaves, then was seated, and they were seated. So the nun began with the questions, and she asked a lot of questions. Each of that he<sup>asws</sup> answered her. And Abu Ibrahim<sup>asws</sup> asked her about things, and there did not happen to be anything with her. Then she became a Muslim. Then the Monk turned to ask him<sup>asws</sup>. So he<sup>asws</sup> answered regarding everything what he asked him<sup>asws</sup>. ", "So the Monk said, ‘I used to be strong upon my religion and I was not behind anyone from the Christians in the earth who would reached my level in the knowledge, and I had heard of a man in India who, whenever he so desired to, he could go for pilgrimage to Bayt Al-Maqdis in one day and one night, then return to his house, in the land of India. So I asked about him, in which land he was, and it was said to me that he was in Subzan. And I asked the one who informed me, so he said, it is the knowledge of the Name which Asif<sup>as</sup>, the companions of Suleyman<sup>as</sup> was successful with when he came with the throne of Saba, and it is which Allah<sup>azwj</sup> Mentioned to you all in your Book, and for us our circle of religions in our Books’. ", "So Abu Ibrahim<sup>asws</sup> said to him: ‘So how many Names are there for Allah<sup>azwj</sup> which do not get repelled?’ So the Monk said, ‘Many Names, but as for the inevitable from these which its questioner does not get repelled, so (these are) seven’. So Abu Al-Hassan<sup>asws</sup> said to him: ‘So inform me<sup>asws</sup> about what you have preserved from these’. The Monk said, ‘No, by Allah<sup>azwj</sup> Who Revealed the Torah upon Musa<sup>as</sup> and Made Isa<sup>as</sup> as a lesson for the Momineen and a Trial for the gratefulness of the ones of understanding, and Made Muhammad<sup>saww</sup> as a Blessing and a Mercy, and Made Ali<sup>asws</sup> as a lesson and an insight, and Made the successors<sup>asws</sup> to be from his<sup>asws</sup> lineage and lineage of Muhammad<sup>saww</sup>, I do not know, and had I known, I would not have argue with regards to it to your<sup>asws</sup> speech, nor would I have come to you<sup>asws</sup>, nor asked you<sup>asws</sup>’. ", "So Abu Ibrahim<sup>asws</sup> said: ‘Return to the discussion of the Indian’. So the Monk said to him<sup>asws</sup>, ‘I had heard of these Names and I did not know what their esoteric (meanings) were nor of their segments, nor did I know what these were, nor how they were, nor of their supplications. So I went until I arrived at Subzan in India, and I asked around about the man, so it was said to me, ‘He has built a monastery in a mountain, so he has become such that he neither comes out nor is seen except twice during every year’. And the Indians were alleging that Allah<sup>azwj</sup> Burst out a stream for him in his monastery and the Indians were alleging that it is cultivated for him from without any planting occurring in it, and it is farmed for him from without any farmers working on it. ", "So I ended up to its door and I stayed there for thee (days) not knocking the door nor trying to open the door. So when it was the fourth day, Allah<sup>azwj</sup> Opened the door and a cow came over. Upon her was some firewood. Her udders were flowing such that there almost came out from these whatever was in her udders from the milk. So she pushed the door, so it opened wide and I followed her and entered. There, I found the man standing looking towards the sky then weeping, and looking at the earth and weeping, and looking at the mountain and weeping.", "So I said, ‘Glory be to Allah<sup>azwj</sup>! How scarce are the likes of you during this times of ours’. So he said to me, ‘By Allah<sup>azwj</sup>! I am not, except for a good deed from the good deeds of a man you have left behind your back’. So I said to him, ‘I am informed that with you are Names from the Names of Allah<sup>azwj</sup> by which you can reach Bayt Al-Maqdis every day and night, and return to your house’. So he said to me, ‘And do you recognise the Bayt Al-Maqdis (the Holy House)?’ I said, ‘I do not know except of the Bayt Al-Maqdis which is in Syria (Jerusalem of today)’. He said, ‘It isn’t the Bayt Al-Maqdis, but the Bayt Al-Maqdis (the Holy House) is the house of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’. ", "So I said to him, ‘But, I have not heard with it up to this day of mine that it is Bayt Al-Maqdis’. So he said to me, ‘There were the Prayer Niches (<span class=\"iTxt\">Mihraabs</span>) of the Prophets<sup>as</sup>, and rather it used to be called ‘Hangar of the Prayer Niches’, until there came the gap which was between Muhammad<sup>saww</sup> and Isa<sup>as</sup>, and killings and the afflictions from the people of Polytheism, and released the Curses in the houses of the Satans<sup>la</sup>. So they transformed and changed and turned over those Names; and these are the Words of Allah<sup>azwj</sup> Blessed and High in its esoteric (meaning) the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and the apparent it is a parable <span class=\"ibTxt\">[53:23] They are naught but names which you have named, you and your fathers; Allah has not sent for them any authority</span>’.", "So I said to him, ‘I have come to you from a distant city, exposed to oceans, and sorrows, and worries, and fear. In the morning and evening I was despairing that I would not be succeeding with my need’. So he said to me, ‘I do not see your mother to have carried you except an Honourable Angel would have been present, nor do I know that your father, when he intended to copulate with your mother, except he would have washed and would have come to her upon purity, nor do I allege except that he would have learnt the fourth part of the Torah from that vigil of his. Thus, it ended with goodness for him.", "Return to wherever you came from, so go until you disembark as the city of Muhammad<sup>saww</sup> which is called Tayba, and its name during the Pre-Islamic period was Yasrib. Then deliberate to a place from it called Al-Baqie. Then ask about the house called the house of Marwan, so lodge in it, and stay for three (days). Then ask about the black Sheikh who would happen to be upon its door working (producing) the matting, and in their city its name is ‘Al-Khasaf’. So be kind to the Sheikh and say to him, ‘He has sent me to you, your lodger who used to lodge in the corner of the house wherein were four planks of wood’. ", "Then ask him about so and so, son of so and so, and ask him where his association is, and ask him which time he would be passing by therein. So he would either show it to you or describe it for you. So recognise him<sup>asws</sup> with the description and I shall describe him<sup>asws</sup> to you’. I said, ‘So when I do meet him<sup>asws</sup>, so what is that should I do?’ He said, ‘Ask him<sup>asws</sup> about what has happened, and about what is going to happen, and ask him<sup>asws</sup> about the teachings of the ones who has passed away and the ones who remain’. ", "So Abu Ibrahim<sup>asws</sup> said to him: ‘Your companion whom you met has given you good advice’. So the Monk said, ‘What is his name? May I be sacrificed for you<sup>asws</sup>!’ He<sup>asws</sup> said: ‘He is Motamim Bin Feyrouz, and he is from the sons of Persia, and he is from the ones who believe in Allah<sup>azwj</sup> Alone, there being no associates for Him<sup>azwj</sup>, and worships Him<sup>azwj</sup> with the sincerity and the conviction, and he fled from his people due to what his fearing was from them, so his Lord<sup>azwj</sup> Endowed wisdom to him and Guided him to the way of righteousness, and Made him to be from the pious ones, and understanding between him and His<sup>azwj</sup> sincere servants. And there is none from a year except he visits Makkah during it as a Pilgrim, and he performs Umrah at the beginning of every month time and again, and he come from his place from India to Makkah as a Grace from Allah<sup>azwj</sup> and Assitance. And like that, Allah<sup>azwj</sup> Recompenses the grateful ones’. ", "Then the Monk asked him<sup>asws</sup> a lot of questions, each one of that he<sup>asws</sup> answered with regards to it. And he<sup>asws</sup> asked the Monk about things he did not happen to have anything with regards to these. So he<sup>asws</sup> informed him with it. Then the Monk said, ‘Inform me about the eight ‘Hurouf’ (letter/sentences) which were Revealed. So four from these were Manifested in the earth and there remain four of these in the atmosphere, upon whom would these four be Revealed which are in the atmosphere, and who would be interpreting these?’ He<sup>asws</sup> said: ‘That would be our<sup>asws</sup> Qaim<sup>asws</sup>. Allah<sup>azwj</sup> would be Revealing unto him<sup>asws</sup>, so he<sup>asws</sup> would be interpreting these, and there would be Revealed unto him<sup>asws</sup> what was not Revealed upon the truthful ones, and the Rasools<sup>as</sup> and the Guided ones’. ", "Then the Monk said, ‘So inform me about the two from those four ‘Hurouf’ which are in the earth, what are these?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> shall inform you with all four of them. As for the first of these so it is, ‘There is no god except Allah<sup>azwj</sup> Alone, there being no associates for Him<sup>azwj</sup> surviving’; and the second, ‘Muhammad<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, purely’; and the third is us<sup>asws</sup>, the People<sup>asws</sup> of the Household; and the fourth, ‘Our<sup>asws</sup> Shias are from us<sup>asws</sup> and we<sup>asws</sup> are from Rasool-Allah<sup>saww</sup>, and Rasool-Allah<sup>saww</sup> is from Allah<sup>azwj</sup> by a cause’. ", "So the Monk said to him<sup>asws</sup>, ‘I testify that there is no god except Allah<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>, and that whatever he<sup>saww</sup> came with from the Presence of Allah<sup>azwj</sup> is true, and you (Imams<sup>asws</sup>) are the elites of Allah<sup>azwj</sup> from His<sup>azwj</sup> creatures, and that your<sup>asws</sup> Shias are the clean ones, the exchanged ones, and for them is the goodly end of Allah<sup>azwj</sup>, and the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’. ", "So Abu Ibrahim<sup>asws</sup> called for a gown (made of) Khazz, and a Qowhy shirt, and a pallium, and shoes, and a cap, so he<sup>asws</sup> gave these to him, and he<sup>asws</sup> prayed Al-Zohr <span class=\"iTxt\">Salat</span> and said to him: ‘Get circumcised’ (unless its already been done). So he said, ‘I was circumcised during my seventh (year)’."]}}, {"index": 1287, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:120:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ قَالَ مَرَّ الْعَبْدُ الصَّالِحُ بِامْرَأَةٍ بِمِنًى وَ هِيَ تَبْكِي وَ صِبْيَانُهَا حَوْلَهَا يَبْكُونَ وَ قَدْ مَاتَتْ لَهَا بَقَرَةٌ فَدَنَا مِنْهَا ثُمَّ قَالَ لَهَا مَا يُبْكِيكِ يَا أَمَةَ اللَّهِ قَالَتْ يَا عَبْدَ اللَّهِ إِنَّ لَنَا صِبْيَاناً يَتَامَى وَ كَانَتْ لِي بَقَرَةٌ مَعِيشَتِي وَ مَعِيشَةُ صِبْيَانِي كَانَ مِنْهَا وَ قَدْ مَاتَتْ وَ بَقِيتُ مُنْقَطَعاً بِي وَ بِوُلْدِي لَا حِيلَةَ لَنَا ", "فَقَالَ يَا أَمَةَ اللَّهِ هَلْ لَكِ أَنْ أُحْيِيَهَا لَكِ فَأُلْهِمَتْ أَنْ قَالَتْ نَعَمْ يَا عَبْدَ اللَّهِ فَتَنَحَّى وَ صَلَّى رَكْعَتَيْنِ ثُمَّ رَفَعَ يَدَهُ هُنَيْئَةً وَ حَرَّكَ شَفَتَيْهِ ثُمَّ قَامَ فَصَوَّتَ بِالْبَقَرَةِ فَنَخَسَهَا نَخْسَةً أَوْ ضَرَبَهَا بِرِجْلِهِ فَاسْتَوَتْ عَلَى الْأَرْضِ قَائِمَةً فَلَمَّا نَظَرْتِ الْمَرْأَةُ إِلَى الْبَقَرَةِ صَاحَتْ وَ قَالَتْ عِيسَى ابْنُ مَرْيَمَ وَ رَبِّ الْكَعْبَةِ فَخَالَطَ النَّاسَ وَ صَارَ بَيْنَهُمْ وَ مَضَى ( عليه السلام ) ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdullah Bin Al Mugheira who said, ", "‘Al-Abd Al-Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) passed by a woman at Mina, and she was crying, and her children were crying around her, and a cow of hers had died. So he<sup>asws</sup> went closer to her, then said to her: ‘What makes you cry, O maid of Allah<sup>azwj</sup>?’ She said, ‘O servant of Allah<sup>azwj</sup>! For us there are orphaned children, and there was a cow for me for my livelihood and the livelihood of my children which was from it, and it has died, and I and my children have been cut off, there are no means for us’. ", "So he<sup>asws</sup> said: ‘O maid of Allah<sup>azwj</sup>! Would it be a solution for you if I<sup>asws</sup> were to revive it for you?’ So she was inspired and said, ‘Yes, O servant of Allah<sup>azwj</sup>!’. So he<sup>asws</sup> went aside and prayed two Cycles of <span class=\"iTxt\">Salat</span>, then raised his<sup>asws</sup> hands for a while and moved his<sup>asws</sup> lips, then stood, so he<sup>asws</sup> struck the cow and pushed it with a push or struck it with his<sup>asws</sup> leg. So it sat upright upon the ground and stood up. So when the woman looked at the cow, she shouted and said, ‘Isa<sup>as</sup> Bin Maryam<sup>as</sup>, by the Lord<sup>azwj</sup> of the Kabah!’. So he<sup>asws</sup> mingled with the people and came to be between them and went away’."]}}, {"index": 1288, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:120:7", "text": ["أَحْمَدُ بْنُ مِهْرَانَ رَحِمَهُ اللَّهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَمِعْتُ الْعَبْدَ الصَّالِحَ يَنْعَى إِلَى رَجُلٍ نَفْسَهُ فَقُلْتُ فِي نَفْسِي وَ إِنَّهُ لَيَعْلَمُ مَتَى يَمُوتُ الرَّجُلُ مِنْ شِيعَتِهِ فَالْتَفَتَ إِلَيَّ شِبْهَ الْمُغْضَبِ فَقَالَ يَا إِسْحَاقُ قَدْ كَانَ رُشَيْدٌ الْهَجَرِيُّ يَعْلَمُ عِلْمَ الْمَنَايَا وَ الْبَلَايَا وَ الْإِمَامُ أَوْلَى بِعِلْمِ ذَلِكَ ", "ثُمَّ قَالَ يَا إِسْحَاقُ اصْنَعْ مَا أَنْتَ صَانِعٌ فَإِنَّ عُمُرَكَ قَدْ فَنِيَ وَ إِنَّكَ تَمُوتُ إِلَى سَنَتَيْنِ وَ إِخْوَتَكَ وَ أَهْلَ بَيْتِكَ لَا يَلْبَثُونَ بَعْدَكَ إِلَّا يَسِيراً حَتَّى تَتَفَرَّقَ كَلِمَتُهُمْ وَ يَخُونُ بَعْضُهُمْ بَعْضاً حَتَّى يَشْمَتَ بِهِمْ عَدُوُّهُمْ فَكَانَ هَذَا فِي نَفْسِكَ ", "فَقُلْتُ فَإِنِّي أَسْتَغْفِرُ اللَّهَ بِمَا عَرَضَ فِي صَدْرِي فَلَمْ يَلْبَثْ إِسْحَاقُ بَعْدَ هَذَا الْمَجْلِسِ إِلَّا يَسِيراً حَتَّى مَاتَ فَمَا أَتَى عَلَيْهِمْ إِلَّا قَلِيلٌ حَتَّى قَامَ بَنُو عَمَّارٍ بِأَمْوَالِ النَّاسِ فَأَفْلَسُوا ."], "translations": {"en.hubeali": ["Ahmad Bin Mihran, from Muhammad Bin Ali, from Sayf Bin Ameyra, from Is’haq Bin Ammar who said, ", "‘I heard Al-Abd Al-Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) giving the news of death to a man of his own death. So I said within myself (with surprise), ‘And he<sup>asws</sup> knows when a man from his<sup>asws</sup> Shias would be passing away’. So he<sup>asws</sup> turned towards me resembling the angered one and he<sup>asws</sup> said: ‘O Is’haq! It was so that Rusheyd Al-Hajary knew the knowledge of the death and afflictions, and the Imam<sup>asws</sup> is higher with the knowledge of that’. ", "Then he<sup>asws</sup> said: ‘O Is’haq! Do whatever you are doing, for your life-span has perished and you would be dying in two years, and your brethren and the people of your household would not be remaining after you except for a little while, until their speeches would differ and they would be deceiving each other until their enemies would be gloating upon them. So, what was this within yourself?’ ", "So I said, ‘So I hereby seek Forgiveness of Allah<sup>azwj</sup> due to what presented in my chest’. So Is’haq did not remain after this gathering except for a little until he died. So there did not come upon them except for a little (time) until the sons of Ammar stood with the wealth of (other) people, and they were bankrupted’."]}}, {"index": 1289, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:120:8", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُوسَى بْنِ الْقَاسِمِ الْبَجَلِيِّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ قَالَ جَاءَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ وَ قَدِ اعْتَمَرْنَا عُمْرَةَ رَجَبٍ وَ نَحْنُ يَوْمَئِذٍ بِمَكَّةَ فَقَالَ يَا عَمِّ إِنِّي أُرِيدُ بَغْدَادَ وَ قَدْ أَحْبَبْتُ أَنْ أُوَدِّعَ عَمِّي أَبَا الْحَسَنِ يَعْنِي مُوسَى بْنَ جَعْفَرٍ ( عليه السلام ) وَ أَحْبَبْتُ أَنْ تَذْهَبَ مَعِي إِلَيْهِ", "فَخَرَجْتُ مَعَهُ نَحْوَ أَخِي وَ هُوَ فِي دَارِهِ الَّتِي بِالْحَوْبَةِ وَ ذَلِكَ بَعْدَ الْمَغْرِبِ بِقَلِيلٍ فَضَرَبْتُ الْبَابَ فَأَجَابَنِي أَخِي فَقَالَ مَنْ هَذَا فَقُلْتُ عَلِيٌّ فَقَالَ هُوَ ذَا أَخْرُجُ وَ كَانَ بَطِي‏ءَ الْوُضُوءِ فَقُلْتُ الْعَجَلَ قَالَ وَ أَعْجَلُ فَخَرَجَ وَ عَلَيْهِ إِزَارٌ مُمَشَّقٌ قَدْ عَقَدَهُ فِي عُنُقِهِ حَتَّى قَعَدَ تَحْتَ عَتَبَةِ الْبَابِ", "فَقَالَ عَلِيُّ بْنُ جَعْفَرٍ فَانْكَبَبْتُ عَلَيْهِ فَقَبَّلْتُ رَأْسَهُ وَ قُلْتُ قَدْ جِئْتُكَ فِي أَمْرٍ إِنْ تَرَهُ صَوَاباً فَاللَّهُ وَفَّقَ لَهُ وَ إِنْ يَكُنْ غَيْرَ ذَلِكَ فَمَا أَكْثَرَ مَا نُخْطِئُ قَالَ وَ مَا هُوَ قُلْتُ هَذَا ابْنُ أَخِيكَ يُرِيدُ أَنْ يُوَدِّعَكَ وَ يَخْرُجَ إِلَى بَغْدَادَ فَقَالَ لِيَ ادْعُهُ فَدَعَوْتُهُ وَ كَانَ مُتَنَحِّياً فَدَنَا مِنْهُ فَقَبَّلَ رَأْسَهُ وَ قَالَ جُعِلْتُ فِدَاكَ أَوْصِنِي", "فَقَالَ أُوصِيكَ أَنْ تَتَّقِيَ اللَّهَ فِي دَمِي فَقَالَ مُجِيباً لَهُ مَنْ أَرَادَكَ بِسُوءٍ فَعَلَ اللَّهُ بِهِ وَ جَعَلَ يَدْعُو عَلَى مَنْ يُرِيدُهُ بِسُوءٍ ثُمَّ عَادَ فَقَبَّلَ رَأْسَهُ فَقَالَ يَا عَمِّ أَوْصِنِي فَقَالَ أُوصِيكَ أَنْ تَتَّقِيَ اللَّهَ فِي دَمِي فَقَالَ مَنْ أَرَادَكَ بِسُوءٍ فَعَلَ اللَّهُ بِهِ وَ فَعَلَ ثُمَّ عَادَ فَقَبَّلَ رَأْسَهُ ثُمَّ قَالَ يَا عَمِّ أَوْصِنِي", "فَقَالَ أُوصِيكَ أَنْ تَتَّقِيَ اللَّهَ فِي دَمِي فَدَعَا عَلَى مَنْ أَرَادَهُ بِسُوءٍ ثُمَّ تَنَحَّى عَنْهُ وَ مَضَيْتُ مَعَهُ فَقَالَ لِي أَخِي يَا عَلِيُّ مَكَانَكَ فَقُمْتُ مَكَانِي فَدَخَلَ مَنْزِلَهُ ثُمَّ دَعَانِي فَدَخَلْتُ إِلَيْهِ فَتَنَاوَلَ صُرَّةً فِيهَا مِائَةُ دِينَارٍ فَأَعْطَانِيهَا وَ قَالَ قُلْ لِابْنِ أَخِيكَ يَسْتَعِينُ بِهَا عَلَى سَفَرِهِ", "قَالَ عَلِيٌّ فَأَخَذْتُهَا فَأَدْرَجْتُهَا فِي حَاشِيَةِ رِدَائِي ثُمَّ نَاوَلَنِي مِائَةً أُخْرَى وَ قَالَ أَعْطِهِ أَيْضاً ثُمَّ نَاوَلَنِي صُرَّةً أُخْرَى وَ قَالَ أَعْطِهِ أَيْضاً فَقُلْتُ جُعِلْتُ فِدَاكَ إِذَا كُنْتَ تَخَافُ مِنْهُ مِثْلَ الَّذِي ذَكَرْتَ فَلِمَ تُعِينُهُ عَلَى نَفْسِكَ فَقَالَ إِذَا وَصَلْتُهُ وَ قَطَعَنِي قَطَعَ اللَّهُ أَجَلَهُ ثُمَّ تَنَاوَلَ مِخَدَّةَ أَدَمٍ فِيهَا ثَلَاثَةُ آلَافِ دِرْهَمٍ وَضَحٍ وَ قَالَ أَعْطِهِ هَذِهِ أَيْضاً", "قَالَ فَخَرَجْتُ إِلَيْهِ فَأَعْطَيْتُهُ الْمِائَةَ الْأُولَى فَفَرِحَ بِهَا فَرَحاً شَدِيداً وَ دَعَا لِعَمِّهِ ثُمَّ أَعْطَيْتُهُ الثَّانِيَةَ وَ الثَّالِثَةَ فَفَرِحَ بِهَا حَتَّى ظَنَنْتُ أَنَّهُ سَيَرْجِعُ وَ لَا يَخْرُجُ ثُمَّ أَعْطَيْتُهُ الثَّلَاثَةَ آلَافِ دِرْهَمٍ ", "فَمَضَى عَلَى وَجْهِهِ حَتَّى دَخَلَ عَلَى هَارُونَ فَسَلَّمَ عَلَيْهِ بِالْخِلَافَةِ وَ قَالَ مَا ظَنَنْتُ أَنَّ فِي الْأَرْضِ خَلِيفَتَيْنِ حَتَّى رَأَيْتُ عَمِّي مُوسَى بْنَ جَعْفَرٍ يُسَلَّمُ عَلَيْهِ بِالْخِلَافَةِ فَأَرْسَلَ هَارُونُ إِلَيْهِ بِمِائَةِ أَلْفِ دِرْهَمٍ فَرَمَاهُ اللَّهُ بِالذُّبَحَةِ فَمَا نَظَرَ مِنْهَا إِلَى دِرْهَمٍ وَ لَا مَسَّهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin isa, from Musa Bin Al Qasim Al Bajaly, ", "(It has been narrated) from Ali son of Ja’far<sup>asws</sup> who said, ‘Muhammad Bin Ismail came over to me and we had performed the Umrah of Rajab, and in those days we were in Makkah. So he said, ‘O uncle! I am intending to go to Baghdad and would love to bid farewell to Abu Al-Hassan<sup>asws</sup>, meaning Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>, and I would love it if you could go with me to him<sup>asws</sup>.", "So I went out with him towards my brother<sup>asws</sup>, and he<sup>asws</sup> was in his<sup>asws</sup> house which was at Al-Howba, and that was after Al-Maghrib by a little. So I knocked the door and my brother<sup>asws</sup> answered me: ‘Who is this?’ So I said, ‘Ali’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> am just coming’. And it was so that he<sup>asws</sup> would perform his<sup>asws</sup> Wudou slowly’. So I said, ‘Hurry up’. He<sup>asws</sup> said: ‘And I<sup>asws</sup> am hurrying’. So he<sup>asws</sup> came out and upon him<sup>asws</sup> was a wrapping which was tied to his<sup>asws</sup> neck, until he<sup>asws</sup> sat at the threshold of the door. ", "So Ali<sup>asws</sup> Bin Ja’far<sup>asws</sup> said: ‘So I bowed to him<sup>asws</sup> and kissed his<sup>asws</sup> head, and I said, ‘I have come to you regarding a matter, if you<sup>asws</sup> deem it as correct, so may Allah<sup>azwj</sup> Cause him to achieve for him, and if it happens to be other than that, so how often have we erred’. He<sup>asws</sup> said: ‘And what is it?’ I said, ‘This is a son of your<sup>asws</sup> brother. He is intending to bid you<sup>asws</sup> farewell and he wants to go out to Baghdad’. So he<sup>asws</sup> said to me: ‘Call him’. So I called him over, and he was embarrassed. So he went near to him<sup>asws</sup> and kissed his<sup>asws</sup> head, and said, ‘May I be sacrificed for you<sup>asws</sup>! Advise me’. ", "So he<sup>asws</sup> said: ‘I advise you that you should fear Allah<sup>azwj</sup> with regards to my<sup>asws</sup> blood’. So he said in response to him<sup>asws</sup>, ‘The one who intends evil with you<sup>asws</sup>, so may Allah<sup>azwj</sup> Do with him (the same)’. Then he repeatedly kissed his<sup>asws</sup> head, then said, ‘O uncle! Advise me’. ", "So he<sup>asws</sup> said: ‘I<sup>asws</sup> advise you that you should fear Allah<sup>azwj</sup> with regards to my<sup>asws</sup> blood’. So he supplicated against the one who would intend evil with him<sup>asws</sup>, then isolated from him, and I went away with him. So my brother<sup>asws</sup> said to me, ‘O Ali! (Stay) in your place’. So I stood in my place. So he<sup>asws</sup> entered into his<sup>asws</sup> house, then called me over. So I entered to see him<sup>asws</sup>, and he gave me a bag in which were one hundred Dinars and said: ‘Say to your nephew to be assisted by it upon his journey’. ", "Ali said, ‘So I took it, and secured it in a corner of my robe. Then he<sup>asws</sup> gave me another hundred and said, ‘Give it to him as well’. Then he<sup>asws</sup> gave me another bag and said, ‘Give it to him as well’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! When you<sup>asws</sup> are fearful from him the like of which you<sup>asws</sup> mentioned, so why assist him against yourself<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘When I<sup>asws</sup> help him and he cut off (relationship), Allah<sup>azwj</sup> would Cut off his term (of life)’. Then he<sup>asws</sup> gave me a sack in which were three thousand pure Dirhams, and said: ‘Give it to him as well’. ", "He (Ali) said, ‘So I went out to him and I gave him the first hundred (Dinars). So he was happy with it with an intense happiness and supplicated for his uncle<sup>asws</sup>. Then I gave him the second and the third. So he was happy with it to the extent that I thought that he would retract and not (bother) going out (to Baghdad). Then I gave him the three thousand Dirhams. ", "So he went upon his direction (to Baghdad) until he entered upon Haroun (Al-Rashid, the Caliph). So he greeted upon him with the Caliphate and said, ‘I did not think that there would be two Caliphs in the earth until I saw my uncle Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> being greeted upon him<sup>asws</sup> with the Caliphate’. So Haroun sent one hundred thousand Dirhams to him, but Allah<sup>azwj</sup> Pelted him with the (illness) Angina. So he did not look from it to (even a single) Dirham, nor touched it (and he died)’."]}}, {"index": 1290, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:1:4:120:9", "text": ["سَعْدُ بْنُ عَبْدِ اللَّهِ وَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ قُبِضَ مُوسَى بْنُ جَعْفَرٍ ( عليه السلام ) وَ هُوَ ابْنُ أَرْبَعٍ وَ خَمْسِينَ سَنَةً فِي عَامِ ثَلَاثٍ وَ ثَمَانِينَ وَ مِائَةٍ وَ عَاشَ بَعْدَ جَعْفَرٍ ( عليه السلام ) خَمْساً وَ ثَلَاثِينَ سَنَةً ."], "translations": {"en.hubeali": ["Sa’d Bin Abdullah and Abdullah Bin Ja’far, altogether from Ibrahim Bin Mahziyar, from his brother Ali Bin Mahziyar, from Al Husayn Bin Saeed, from Muhammad Bin Sinan, from Ibn Muskan, ", "(It has been narrated) from Abu Baseer who said, ‘Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> passed away and he<sup>asws</sup> was fifty-four years old, in the year one hundred and eighty three (A.H.), and he<sup>asws</sup> lived after (his<sup>asws</sup> father<sup>asws</sup>) Ja’far<sup>asws</sup> for thirty five years’."]}}]}, "index": "al-kafi:1:4:120", "kind": "verse_list"}