{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 121"
        },
        "path": "/books/al-kafi:1:4:121",
        "titles": {
          "ar": "باب مَوْلِدِ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )",
          "en": "Chapter 121 – Arrival of Abu Al-Hassan Al-Reza<sup>asws</sup>"
        }
      }
    ],
    "index": 179,
    "local_index": 121,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:121",
    "titles": {
      "ar": "باب مَوْلِدِ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )",
      "en": "Chapter 121 – Arrival of Abu Al-Hassan Al-Reza<sup>asws</sup>"
    },
    "verse_count": 11,
    "verse_start_index": 1290,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1291,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ أَحْمَرَ قَالَ قَالَ لِي أَبُو الْحَسَنِ الْأَوَّلُ هَلْ عَلِمْتَ أَحَداً مِنْ أَهْلِ الْمَغْرِبِ قَدِمَ قُلْتُ لَا قَالَ بَلَى قَدْ قَدِمَ رَجُلٌ فَانْطَلِقْ بِنَا فَرَكِبَ وَ رَكِبْتُ مَعَهُ حَتَّى انْتَهَيْنَا إِلَى الرَّجُلِ فَإِذَا رَجُلٌ مِنْ أَهْلِ الْمَدِينَةِ مَعَهُ رَقِيقٌ فَقُلْتُ لَهُ اعْرِضْ عَلَيْنَا فَعَرَضَ عَلَيْنَا سَبْعَ جَوَارٍ كُلَّ ذَلِكَ يَقُولُ أَبُو الْحَسَنِ ( عليه السلام ) لَا حَاجَةَ لِي فِيهَا",
          "ثُمَّ قَالَ اعْرِضْ عَلَيْنَا فَقَالَ مَا عِنْدِي إِلَّا جَارِيَةٌ مَرِيضَةٌ فَقَالَ لَهُ مَا عَلَيْكَ أَنْ تَعْرِضَهَا فَأَبَى عَلَيْهِ فَانْصَرَفَ ثُمَّ أَرْسَلَنِي مِنَ الْغَدِ فَقَالَ قُلْ لَهُ كَمْ كَانَ غَايَتُكَ فِيهَا فَإِذَا قَالَ كَذَا وَ كَذَا فَقُلْ قَدْ أَخَذْتُهَا فَأَتَيْتُهُ فَقَالَ مَا كُنْتُ أُرِيدُ أَنْ أَنْقُصَهَا مِنْ كَذَا وَ كَذَا فَقُلْتُ قَدْ أَخَذْتُهَا",
          "فَقَالَ هِيَ لَكَ وَ لَكِنْ أَخْبِرْنِي مَنِ الرَّجُلُ الَّذِي كَانَ مَعَكَ بِالْأَمْسِ فَقُلْتُ رَجُلٌ مِنْ بَنِي هَاشِمٍ قَالَ مِنْ أَيِّ بَنِي هَاشِمٍ فَقُلْتُ مَا عِنْدِي أَكْثَرُ مِنْ هَذَا فَقَالَ أُخْبِرُكَ عَنْ هَذِهِ الْوَصِيفَةِ إِنِّي اشْتَرَيْتُهَا مِنْ أَقْصَى الْمَغْرِبِ فَلَقِيَتْنِي امْرَأَةٌ مِنْ أَهْلِ الْكِتَابِ فَقَالَتْ مَا هَذِهِ الْوَصِيفَةُ مَعَكَ قُلْتُ اشْتَرَيْتُهَا لِنَفْسِي فَقَالَتْ مَا يَكُونُ يَنْبَغِي أَنْ تَكُونَ هَذِهِ عِنْدَ مِثْلِكَ إِنَّ هَذِهِ الْجَارِيَةَ يَنْبَغِي أَنْ تَكُونَ عِنْدَ خَيْرِ أَهْلِ الْأَرْضِ فَلَا تَلْبَثُ عِنْدَهُ إِلَّا قَلِيلًا حَتَّى تَلِدَ مِنْهُ غُلَاماً مَا يُولَدُ بِشَرْقِ الْأَرْضِ وَ لَا غَرْبِهَا مِثْلُهُ",
          "قَالَ فَأَتَيْتُهُ بِهَا فَلَمْ تَلْبَثْ عِنْدَهُ إِلَّا قَلِيلًا حَتَّى وَلَدَتِ الرِّضَا ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Hisham Bin Ahmar who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> said to me: ‘Do you know anyone from the people of Al-Maghreb (Morocco) to have arrived?’ I said, ‘No, but  a man has arrived (from somewhere)’. So we went, and he<sup>asws</sup> rode and I rode with him until we ended up to the man. But, there was thin man from the people of Al-Medina with him. So I said to him, ‘Display to us’. So he displayed seven slave girls to us, for each of that Abu Al-Hassan<sup>asws</sup> was saying to the man from the people of Al-Medina: ‘There is no need for me with regards to her’. ",
            "Then he<sup>asws</sup> said: ‘Display to us’. So he said, ‘There is nothing with me except for a sick slave girl’. So he<sup>asws</sup> said to him: ‘What is it to you if you were to display her’. But he refused to him<sup>asws</sup>. So he<sup>asws</sup> left. Then he<sup>asws</sup> sent me the next day, and he<sup>asws</sup> said to me: ‘Say to him, ‘How much was your maximum price regarding her?’ So if he says, ‘Such and such’, so say, ‘I take her’. So I went over to him, but he said, ‘I would not have taken anything less than such and such’. So I said, ‘I have taken her’. ",
            "So he said, ‘She is yours, but, inform me, who was the man who was with you yesterday?’ So I said, ‘A man from the Clan of Hashim<sup>as</sup>’. He said, ‘From which son of Hashim<sup>as</sup>?’ So I said, ‘There is nothing more with me than this’. So he said, ‘I inform about this maid. I bought her from the outskirts of Al-Maghreb, and a woman from the People of the Book met me, and she said, ‘Who is this maid with you?’ I said, ‘I bought her for myself’. So she said, ‘It does not happen to be befitting that this one should be with the likes of you. This slave girl is such that it is befitting that she happens to be with the best of the people of the earth. So she would not remain with him except for a little until she would be Blessed with a boy from him such that the like of him has neither been born in the east nor its west. ",
            "He (the narrator) said, ‘So I went over to him<sup>asws</sup> with her, and she did not remain with him<sup>asws</sup> except for a little until she was Blessed Al-Reza<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " Abu al-Hassan al-Rida (a.s.) was born in the year the one hundred forty eight AH. He passed away in the month of Safar in the year two hundred and three at the age of fifty-five. All the views about this date are not the same but it is more accurate, if Allah would so will. He died in Tus in the town called Sanabad, that is within the reach of human voice from Nawqan. He was buried there. Al-Ma’mun had summoned him from Madina to Marw via Basra to Persia. When al-Ma’mun left for Baghdad he took The Imam (a.s.) he passed away in this town. His mother was ’Umm Walad called ’Umm al-Banin."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (73/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1292,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَمَّنْ ذَكَرَهُ عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ لَمَّا مَضَى أَبُو إِبْرَاهِيمَ ( عليه السلام ) وَ تَكَلَّمَ أَبُو الْحَسَنِ ( عليه السلام ) خِفْنَا عَلَيْهِ مِنْ ذَلِكَ فَقِيلَ لَهُ إِنَّكَ قَدْ أَظْهَرْتَ أَمْراً عَظِيماً وَ إِنَّا نَخَافُ عَلَيْكَ هَذِهِ الطَّاغِيَةَ قَالَ فَقَالَ لِيَجْهَدْ جَهْدَهُ فَلَا سَبِيلَ لَهُ عَلَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from the one who mentioned it, from Safwan Bin Yahya who said, ",
            "‘When Abu Ibrahim<sup>asws</sup> passed away and Abu Al-Hassan<sup>asws</sup> spoke fearfully upon it (the Imamate) from that, so it was said to him<sup>asws</sup>, ‘You<sup>asws</sup> have manifested a great matter, and we fear upon you<sup>asws</sup> of this tyrant’. So he<sup>asws</sup> said: ‘Let him strive his striving, but there would not be a way for him upon me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Hisham ibn Ahmar who has said the following. “Once abu al-Hassan, the second asked me, “Do you know if anyone from Morocco (or the west) has arrived?” I replied, “No, no one has come.” He said, “Yes, a man has come. Come with us.” He rode and also rode and went until we reached the man. He was a man from Madina who had a few slaves with him for sale. I asked him to show the slaves for sale and he showed me seven slave-girls. Abu al-Hassan (a.s.) said, “I do not need any of these.” Then he asked, “Show us more.” The man said, “There is no more except one who is ill.” The Imam (a.s.) said, “Why do you not show her to us?” The man refused and the Imam (a.s.) returned. The next day he sent me and said to ask him for how much is the girl who is ill and if he said for so and so amount say, “I pay.” I went to him and he said, “I will not accept less than so and so amount for her.” I said, “I take her.” He said, “She is yours but tell me who was the man with you yesterday?” I said, “A man from the clan of banu Hashim.” He asked from which family is he?” I said, “That is all I have.” He said, “I like to tell you about this girl. I bought her in the far corner of the west (or Morocco). A woman from the followers of the Bible came and said, “What is she doing with you?” I said, “I have purchased her for my self.” She said, “This girl should not be with one like you. This girl should be with the best of the people on earth. With such a one she will not live very long before giving birth to a boy whose like will not be born in the west or east of the earth.” The narrator has said, “I brought her to the Imam (a.s.) and shortly afterwards she became the mother of Imam al-Rida (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (74/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1293,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:3",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ رَحِمَهُ اللَّهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ الْحَسَنِ بْنِ مَنْصُورٍ عَنْ أَخِيهِ قَالَ دَخَلْتُ عَلَى الرِّضَا ( عليه السلام ) فِي بَيْتٍ دَاخِلٍ فِي جَوْفِ بَيْتٍ لَيْلًا فَرَفَعَ يَدَهُ فَكَانَتْ كَأَنَّ فِي الْبَيْتِ عَشَرَةَ مَصَابِيحَ وَ اسْتَأْذَنَ عَلَيْهِ رَجُلٌ فَخَلَّى يَدَهُ ثُمَّ أَذِنَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhamamd Bin Ali, from Al Hassan Bin Mansour, from his brother who said, ",
            "‘I went over to Al-Reza<sup>asws</sup> in an inside room in the middle of the house one night, so he<sup>asws</sup> raised his<sup>asws</sup> hand, and it was as if there were ten lanterns in the house, and I sought permission for a man to see him<sup>asws</sup>, so he<sup>asws</sup> freed his<sup>asws</sup> hand, then permitted for him’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from those he mentioned from Safwan ibnyh who has said the following. “when abu Ibrahim (a.s.) passed away abu al-Hassan (al-Rida) (a.s.) spoke (about his Imamat) and we became afraid for him because of it. It was said to him, “You have declared a very great issue and we are afraid for you from this rebel.” The Imam (a.s.) said, “Let him strive his best but he will find way against me.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (75/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1294,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:4",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنِ ابْنِ جُمْهُورٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ عَنْ أَحْمَدَ بْنِ عَبْدِ اللَّهِ عَنِ الْغِفَارِيِّ قَالَ كَانَ لِرَجُلٍ مِنْ آلِ أَبِي رَافِعٍ مَوْلَى النَّبِيِّ ( صلى الله عليه وآله ) يُقَالُ لَهُ طَيْسٌ عَلَيَّ حَقٌّ فَتَقَاضَانِي وَ أَلَحَّ عَلَيَّ وَ أَعَانَهُ النَّاسُ فَلَمَّا رَأَيْتُ ذَلِكَ صَلَّيْتُ الصُّبْحَ فِي مَسْجِدِ الرَّسُولِ ( عليه السلام ) ثُمَّ تَوَجَّهْتُ نَحْوَ الرِّضَا ( عليه السلام ) وَ هُوَ يَوْمَئِذٍ بِالْعُرَيْضِ",
          "فَلَمَّا قَرُبْتُ مِنْ بَابِهِ إِذَا هُوَ قَدْ طَلَعَ عَلَى حِمَارٍ وَ عَلَيْهِ قَمِيصٌ وَ رِدَاءٌ فَلَمَّا نَظَرْتُ إِلَيْهِ اسْتَحْيَيْتُ مِنْهُ فَلَمَّا لَحِقَنِي وَقَفَ وَ نَظَرَ إِلَيَّ فَسَلَّمْتُ عَلَيْهِ وَ كَانَ شَهْرُ رَمَضَانَ فَقُلْتُ جَعَلَنِيَ اللَّهُ فِدَاكَ إِنَّ لِمَوْلَاكَ طَيْسٍ عَلَيَّ حَقّاً وَ قَدْ وَ اللَّهِ شَهَرَنِي وَ أَنَا أَظُنُّ فِي نَفْسِي أَنَّهُ يَأْمُرُهُ بِالْكَفِّ عَنِّي وَ وَ اللَّهِ مَا قُلْتُ لَهُ كَمْ لَهُ عَلَيَّ وَ لَا سَمَّيْتُ لَهُ شَيْئاً",
          "فَأَمَرَنِي بِالْجُلُوسِ إِلَى رُجُوعِهِ فَلَمْ أَزَلْ حَتَّى صَلَّيْتُ الْمَغْرِبَ وَ أَنَا صَائِمٌ فَضَاقَ صَدْرِي وَ أَرَدْتُ أَنْ أَنْصَرِفَ فَإِذَا هُوَ قَدْ طَلَعَ عَلَيَّ وَ حَوْلَهُ النَّاسُ وَ قَدْ قَعَدَ لَهُ السُّؤَّالُ وَ هُوَ يَتَصَدَّقُ عَلَيْهِمْ فَمَضَى وَ دَخَلَ بَيْتَهُ ثُمَّ خَرَجَ وَ دَعَانِي فَقُمْتُ إِلَيْهِ وَ دَخَلْتُ مَعَهُ فَجَلَسَ وَ جَلَسْتُ",
          "فَقُلْتُ جُعِلْتُ فِدَاكَ إِنَّ طَائِفَ بْنَ الْمُسَيَّبِ يَدُورُ وَ أَكْرَهُ أَنْ يَلْقَانِي وَ مَعِي عَبِيدُكَ فَقَالَ لِي أَصَبْتَ أَصَابَ اللَّهُ بِكَ الرَّشَادَ وَ أَمَرَهُمْ أَنْ يَنْصَرِفُوا إِذَا رَدَدْتُهُمْ فَلَمَّا قَرُبْتُ مِنْ مَنْزِلِي وَ آنَسْتُ رَدَدْتُهُمْ فَصِرْتُ إِلَى مَنْزِلِي وَ دَعَوْتُ بِالسِّرَاجِ وَ نَظَرْتُ إِلَى الدَّنَانِيرِ وَ إِذَا هِيَ ثَمَانِيَةٌ وَ أَرْبَعُونَ دِينَاراً وَ كَانَ حَقُّ الرَّجُلِ عَلَيَّ ثَمَانِيَةً وَ عِشْرِينَ دِينَاراً ",
          "وَ كَانَ فِيهَا دِينَارٌ يَلُوحُ فَأَعْجَبَنِي حُسْنُهُ فَأَخَذْتُهُ وَ قَرَّبْتُهُ مِنَ السِّرَاجِ فَإِذَا عَلَيْهِ نَقْشٌ وَاضِحٌ حَقُّ الرَّجُلِ ثَمَانِيَةٌ وَ عِشْرُونَ دِينَاراً وَ مَا بَقِيَ فَهُوَ لَكَ وَ لَا وَ اللَّهِ مَا عَرَفْتُ مَا لَهُ عَلَيَّ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ الَّذِي أَعَزَّ وَلِيَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ibn Jamhour, from Ibrahim Bin Abdullah, from Ahmad Bin Abdullah, from Al Ghafary who said, ",
            "‘It was so that for a man from the family of Abu Raf’a, a slave of the Prophet<sup>saww</sup> (Imam Al-Reza<sup>asws</sup> called Tays, there was a right upon me (debt). So he pressured me and insisted upon me and the people assisted him. So when I saw that, I prayed the morning <span class=\"iTxt\">Salat</span> in the Masjid of Rasool<sup>saww</sup>, then I diverted to go towards Al-Reza<sup>asws</sup>, and in those days he<sup>asws</sup> was at Al-Ureyz. ",
            "So when I went near to his<sup>asws</sup> door when he<sup>asws</sup> emerged upon a donkey, and upon him<sup>asws</sup> what a shirt and a cloak. So when I looked at him<sup>asws</sup>, I was embarrassed form him<sup>asws</sup>. So when he<sup>asws</sup> met me, paused and looked at me. So I greeted to him<sup>asws</sup>, and it was a Month of Ramazan. So I said, ‘May I be sacrificed for you<sup>asws</sup>! For your<sup>asws</sup> slave, there is a right upon me, and By Allah<sup>azwj</sup>, he has publicized me’, and I thought within myself that he<sup>asws</sup> would order him with the restraint from me, and by Allah<sup>azwj</sup>, I did not say to him<sup>asws</sup> how much was for him upon me, nor did I specify anything to him<sup>asws</sup>. ",
            "So he<sup>asws</sup> ordered me with the sitting up to his<sup>asws</sup> return. So I did not cease (to be seated) until I had prayed Al-Maghrib <span class=\"iTxt\">Salat</span>, and I was Fasting. So my chest got constricted and I wanted to leave. So he<sup>asws</sup> emerged to me and the people were around him<sup>asws</sup> and the beggars were asking him<sup>asws</sup> and he<sup>asws</sup> was giving charity to them. So he<sup>asws</sup> went and entered his<sup>asws</sup> house, then came out and called me over. So I arose to go to him<sup>asws</sup> and entered (the house) with him<sup>asws</sup>, So he<sup>asws</sup> sat down and I sat.  ",
            "فَجَعَلْتُ أُحَدِّثُهُ عَنِ ابْنِ الْمُسَيَّبِ وَ كَانَ أَمِيرَ الْمَدِينَةِ وَ كَانَ كَثِيراً مَا أُحَدِّثُهُ عَنْهُ فَلَمَّا فَرَغْتُ قَالَ لَا أَظُنُّكَ أَفْطَرْتَ بَعْدُ فَقُلْتُ لَا فَدَعَا لِي بِطَعَامٍ فَوُضِعَ بَيْنَ يَدَيَّ وَ أَمَرَ الْغُلَامَ أَنْ يَأْكُلَ مَعِي فَأَصَبْتُ وَ الْغُلَامَ مِنَ الطَّعَامِ فَلَمَّا فَرَغْنَا قَالَ لِيَ ارْفَعِ الْوِسَادَةَ وَ خُذْ مَا تَحْتَهَا فَرَفَعْتُهَا وَ إِذَا دَنَانِيرُ فَأَخَذْتُهَا وَ وَضَعْتُهَا فِي كُمِّي وَ أَمَرَ أَرْبَعَةً مِنْ عَبِيدِهِ أَنْ يَكُونُوا مَعِي حَتَّى يُبْلِغُونِي مَنْزِلِي",
            "So I went on to narrate to him<sup>asws</sup> about Ibn Al-Musayyab, and he was the Emir of Al-Medina, and it was so that I used to frequently narrate to him<sup>asws</sup> about him. So when I was free, he<sup>asws</sup> said: ‘I<sup>asws</sup> don’t think you have broken the Fast yet’. So I said, ‘No’. So he<sup>asws</sup> called for the meal for me, and it was placed it front of me, and he<sup>asws</sup> ordered the boy (servant) that he eats with me. So I and the boy attained from the meal. So when we were free, he<sup>asws</sup> said to me: ‘Raised the pillow and take whatever is beneath it’. So I raised it and there were some Dinars. So I took these and placed them in my sleeve, and he<sup>asws</sup> ordered four of his<sup>asws</sup> slaves that they should happen to be with me until they reach with me to my house.",
            "So I said, ‘May I be sacrificed for you<sup>asws</sup>! The wanderers (spies) of Ibn Musayyab are going around, and I dislike it that they should meet me and with me are your<sup>asws</sup> slaves. So he<sup>asws</sup> said to me: ‘You are right. May Allah<sup>azwj</sup> Guide you’. And he<sup>asws</sup> ordered them that they should leave whenever I return them. So when I was near to my house and was comforted, I returned them. So I came to be in my house and called for the lantern and looked at the Dinars, and there were forty-eight Dinars, and it was so that the right of the man upon me was twenty-eight Dinars.  ",
            "And it was so that therein was a shiny Dinar, so its beauty astounded me. So I took it and brought it near the lantern, and upon it was a clear engraving: ‘The right of the man is twenty eight Dinars and whatever remains, so it is for you’. And no, by Allah<sup>azwj</sup>, I had not told him<sup>asws</sup> what was for him upon me. And the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the world Who Honoured His<sup>azwj</sup> Guardian<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Mihran, Allah grant him blessings, from Muhammad ibn Ali from al-Hassan ibn al-Mansur from his brother who has said the following. “Once I went to see al-Rida (a.s.) in a house inside his house in the middle of the night. He raised his hand and it was as if there were ten lamps inside the house and a man asked permission for a meeting. He lowered his hand and then gave him permission.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (75/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1295,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) أَنَّهُ خَرَجَ مِنَ الْمَدِينَةِ فِي السَّنَةِ الَّتِي حَجَّ فِيهَا هَارُونُ يُرِيدُ الْحَجَّ فَانْتَهَى إِلَى جَبَلٍ عَنْ يَسَارِ الطَّرِيقِ وَ أَنْتَ ذَاهِبٌ إِلَى مَكَّةَ يُقَالُ لَهُ فَارِعٌ فَنَظَرَ إِلَيْهِ أَبُو الْحَسَنِ ثُمَّ قَالَ بَانِي فَارِعٍ وَ هَادِمُهُ يُقَطَّعُ إِرْباً إِرْباً ",
          "فَلَمْ نَدْرِ مَا مَعْنَى ذَلِكَ فَلَمَّا وَلَّى وَافَى هَارُونُ وَ نَزَلَ بِذَلِكَ الْمَوْضِعِ صَعِدَ جَعْفَرُ بْنُ يَحْيَى ذَلِكَ الْجَبَلَ وَ أَمَرَ أَنْ يُبْنَى لَهُ ثَمَّ مَجْلِسٌ فَلَمَّا رَجَعَ مِنْ مَكَّةَ صَعِدَ إِلَيْهِ فَأَمَرَ بِهَدْمِهِ فَلَمَّا انْصَرَفَ إِلَى الْعِرَاقِ قُطِّعَ إِرْباً إِرْباً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from some of his companions, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> that he<sup>asws</sup> went out from Al-Medina intending the Hajj in the year in which Haroun (Al-Rashid the Caliph) performed Hajj. So he<sup>asws</sup> ended up to a mountain on the left of the road when you are going to Makkah, called Fari’u. So Abu Al-Hassan<sup>asws</sup> looked at it, then said: ‘The builder of Fari’u and its demolished would be cut into pieces (and) pieces’. ",
            "So we did not know what the meaning of that was. So when he returned, Haroun (Al-Rashid) arrived and encamped at that place. Ja’far Bin Yahya ascended that mountain and ordered that (a building) be built for him. Then they would gather. So when he returned from Makkah, he ascended to it, and ordered for it to be demolished. So when he left to (go to) Al-Iraq, he was cut into pieces (and) pieces’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad has narrated from ibn Jumhur from Ibrahim ibn ‘Abdallah from Ahmad ibn ‘Abdallah from al-Ghifari who has said the following. “I owed money to a man from the family of abu Rafi‘, slave of the Holy Prophet (s.a), called Tays. He demanded payment and pressed me hard and people also assisted him. When I found myself in such condition I prayed the morning prayer in the Mosque of the Messenger of Allah and then headed to al-Rida (a.s.) who was in al-‘Arid those days. When I almost reached his door he appeared on his donkey wearing a shirt and a gown. When I looked at him I felt shy. When he approached me he looked at me and I offered him the greeting of peace. It was the month of Ramadan. I said, “May Allah take my soul in service for your cause, I owe money to your slave, Tays and he has defamed me. I thought he will order him to stop pressuring me and by Allah, I did not tell him how much I owed nor I mentioned any amount. He ordered me to sit until he will return. I remained there until said my sun set prayer and I was fasting. I became depressed and I thought of returning home. At that time he appeared before me with people around him. He was surrounded by the beggars and would give them charity. He passed by and entered his house. Then he came out and called me inside. We both sat down and I began to speak to him about ibn al-Musayyib, the governor of Madina as I would speak to him about the governor often. When I finished he said, “I do not think you had any break fast yet. I said, “No, I did not break fast yet.” He asked for food and ordered the boy to join me at the table. I and the boy had our meal and when we finished he said to me, “Lift up the furnishing and pick up whatever is underneath.” I lifted it up and found Dinars therein. I picked them up and place in my pocket. He ordered four of his slaves to escort me to my house. I said, “May Allah take my soul in service for your cause, the spies of ibn al-Musayyib check around all the time and I do not like them to see me with your slaves. He said, “You are right, may Allah keep you rightly guided.” He ordered them to return whenever I wanted them to do so.” When almost reached my house and felt safe I asked them to go back I went home and asked for a lamp. I looked at the Dinars and there were forty-eight of them, I owed twenty eight to the man. Among them one Dinar caught my sight and picked it up and brought near the lamp. I found a clear mark on it that said, “Payment to the man twenty-eight Dinars and the rest for your self.” By Allah, I did not know how much I owed him. All praise belong to Allah Who has granted honor to those who He has give authority.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (76/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1296,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:6",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ حَمْزَةَ بْنِ الْقَاسِمِ عَنْ إِبْرَاهِيمَ بْنِ مُوسَى قَالَ أَلْحَحْتُ عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فِي شَيْ‏ءٍ أَطْلُبُهُ مِنْهُ فَكَانَ يَعِدُنِي فَخَرَجَ ذَاتَ يَوْمٍ لِيَسْتَقْبِلَ وَالِيَ الْمَدِينَةِ وَ كُنْتُ مَعَهُ فَجَاءَ إِلَى قُرْبِ قَصْرِ فُلَانٍ فَنَزَلَ تَحْتَ شَجَرَاتٍ وَ نَزَلْتُ مَعَهُ أَنَا وَ لَيْسَ مَعَنَا ثَالِثٌ فَقُلْتُ جُعِلْتُ فِدَاكَ هَذَا الْعِيدُ قَدْ أَظَلَّنَا وَ لَا وَ اللَّهِ مَا أَمْلِكُ دِرْهَماً فَمَا سِوَاهُ فَحَكَّ بِسَوْطِهِ الْأَرْضَ حَكّاً شَدِيداً ثُمَّ ضَرَبَ بِيَدِهِ فَتَنَاوَلَ مِنْهُ سَبِيكَةَ ذَهَبٍ ثُمَّ قَالَ انْتَفِعْ بِهَا وَ اكْتُمْ مَا رَأَيْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Al Hassan, from Muhammad Bin Isa, from Muhammad Bin Hamza Bin Al Qasim, from Ibrahim Bin Musa who said, ",
            "‘I urged upon Abu Al-Hassan Al-Reza<sup>asws</sup> regarding something I sought from him<sup>asws</sup>. So he<sup>asws</sup> used to promise me. So, one day he<sup>asws</sup> went out to welcome the governor of Al-Medina, and I was with him<sup>asws</sup>. So he<sup>asws</sup> went near the castle of so and so, and encamped beneath some trees, and I encamped with him<sup>asws</sup>, and there was no third (person) with us. So I said, ‘May I be sacrificed for you<sup>asws</sup>. This is the Eid (festival day), and no, by Allah<sup>azwj</sup>, I do not own (even) a Dirham, nor (anything else) besides it’. So he<sup>asws</sup> rubbed with his<sup>asws</sup> whip on the ground with an intense whipping, then struck his<sup>asws</sup> hand and grabbed a gold ingot from it, then said: ‘Benefit by it and conceal what you saw’."
          ],
          "en.sarwar": [
            " 5. Ali ibn Ibrahim has narrated from his father from certain person of our people who has said the following. “ Abu al-Hassan al-Rida came out of Madina in the year that Harun wanted to performed Hajj. When he arrived near the mountain called Fari‘ on the left going to Makka, abu al-Hassan looked at it and then said, “The builder at Fari‘ and he who would demolish will be cut in pieces.” We had no idea what it meant. When he returned Harun arrived and camped at that place. Ja‘far ibn Yahya climbed the mountain and ordered to build a resting place for him. When he returned from Makka he climbed there and ordered to demolish what was built there. When he returned to Iraq he was cut in pieces.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (82/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1297,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ يَاسِرٍ الْخَادِمِ وَ الرَّيَّانِ بْنِ الصَّلْتِ جَمِيعاً قَالَ لَمَّا انْقَضَى أَمْرُ الْمَخْلُوعِ وَ اسْتَوَى الْأَمْرُ لِلْمَأْمُونِ كَتَبَ إِلَى الرِّضَا ( عليه السلام ) يَسْتَقْدِمُهُ إِلَى خُرَاسَانَ فَاعْتَلَّ عَلَيْهِ أَبُو الْحَسَنِ ( عليه السلام ) بِعِلَلٍ فَلَمْ يَزَلِ الْمَأْمُونُ يُكَاتِبُهُ فِي ذَلِكَ حَتَّى عَلِمَ أَنَّهُ لَا مَحِيصَ لَهُ وَ أَنَّهُ لَا يَكُفُّ عَنْهُ",
          "فَخَرَجَ ( عليه السلام ) وَ لِأَبِي جَعْفَرٍ ( عليه السلام ) سَبْعُ سِنِينَ فَكَتَبَ إِلَيْهِ الْمَأْمُونُ لَا تَأْخُذْ عَلَى طَرِيقِ الْجَبَلِ وَ قُمْ وَ خُذْ عَلَى طَرِيقِ الْبَصْرَةِ وَ الْأَهْوَازِ وَ فَارِسَ حَتَّى وَافَى مَرْوَ فَعَرَضَ عَلَيْهِ الْمَأْمُونُ أَنْ يَتَقَلَّدَ الْأَمْرَ وَ الْخِلَافَةَ فَأَبَى أَبُو الْحَسَنِ ( عليه السلام ) قَالَ فَوِلَايَةَ الْعَهْدِ فَقَالَ عَلَى شُرُوطٍ أَسْأَلُكَهَا قَالَ الْمَأْمُونُ لَهُ سَلْ مَا شِئْتَ ",
          "فَكَتَبَ الرِّضَا ( عليه السلام ) إِنِّي دَاخِلٌ فِي وِلَايَةِ الْعَهْدِ عَلَى أَنْ لَا آمُرَ وَ لَا أَنْهَى وَ لَا أُفْتِيَ وَ لَا أَقْضِيَ وَ لَا أُوَلِّيَ وَ لَا أَعْزِلَ وَ لَا أُغَيِّرَ شَيْئاً مِمَّا هُوَ قَائِمٌ وَ تُعْفِيَنِي مِنْ ذَلِكَ كُلِّهِ فَأَجَابَهُ الْمَأْمُونُ إِلَى ذَلِكَ كُلِّهِ",
          "قَالَ فَحَدَّثَنِي يَاسِرٌ قَالَ فَلَمَّا حَضَرَ الْعِيدُ بَعَثَ الْمَأْمُونُ إِلَى الرِّضَا ( عليه السلام ) يَسْأَلُهُ أَنْ يَرْكَبَ وَ يَحْضُرَ الْعِيدَ وَ يُصَلِّيَ وَ يَخْطُبَ فَبَعَثَ إِلَيْهِ الرِّضَا ( عليه السلام ) قَدْ عَلِمْتَ مَا كَانَ بَيْنِي وَ بَيْنَكَ مِنَ الشُّرُوطِ فِي دُخُولِ هَذَا الْأَمْرِ فَبَعَثَ إِلَيْهِ الْمَأْمُونُ إِنَّمَا أُرِيدُ بِذَلِكَ أَنْ تَطْمَئِنَّ قُلُوبُ النَّاسِ وَ يَعْرِفُوا فَضْلَكَ فَلَمْ يَزَلْ ( عليه السلام ) يُرَادُّهُ الْكَلَامَ فِي ذَلِكَ فَأَلَحَّ عَلَيْهِ",
          "فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنْ أَعْفَيْتَنِي مِنْ ذَلِكَ فَهُوَ أَحَبُّ إِلَيَّ وَ إِنْ لَمْ تُعْفِنِي خَرَجْتُ كَمَا خَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ الْمَأْمُونُ اخْرُجْ كَيْفَ شِئْتَ وَ أَمَرَ الْمَأْمُونُ الْقُوَّادَ وَ النَّاسَ أَنْ يُبَكِّرُوا إِلَى بَابِ أَبِي الْحَسَنِ",
          "قَالَ فَحَدَّثَنِي يَاسِرٌ الْخَادِمُ أَنَّهُ قَعَدَ النَّاسُ لِأَبِي الْحَسَنِ ( عليه السلام ) فِي الطُّرُقَاتِ وَ السُّطُوحِ الرِّجَالُ وَ النِّسَاءُ وَ الصِّبْيَانُ وَ اجْتَمَعَ الْقُوَّادُ وَ الْجُنْدُ عَلَى بَابِ أَبِي الْحَسَنِ ( عليه السلام ) فَلَمَّا طَلَعَتِ الشَّمْسُ قَامَ ( عليه السلام ) فَاغْتَسَلَ وَ تَعَمَّمَ بِعِمَامَةٍ بَيْضَاءَ مِنْ قُطْنٍ أَلْقَى طَرَفاً مِنْهَا عَلَى صَدْرِهِ وَ طَرَفاً بَيْنَ كَتِفَيْهِ وَ تَشَمَّرَ ثُمَّ قَالَ لِجَمِيعِ مَوَالِيهِ افْعَلُوا مِثْلَ مَا فَعَلْتُ",
          "ثُمَّ أَخَذَ بِيَدِهِ عُكَّازاً ثُمَّ خَرَجَ وَ نَحْنُ بَيْنَ يَدَيْهِ وَ هُوَ حَافٍ قَدْ شَمَّرَ سَرَاوِيلَهُ إِلَى نِصْفِ السَّاقِ وَ عَلَيْهِ ثِيَابٌ مُشَمَّرَةٌ فَلَمَّا مَشَى وَ مَشَيْنَا بَيْنَ يَدَيْهِ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ وَ كَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ فَخُيِّلَ إِلَيْنَا أَنَّ السَّمَاءَ وَ الْحِيطَانَ تُجَاوِبُهُ وَ الْقُوَّادُ وَ النَّاسُ عَلَى الْبَابِ قَدْ تَهَيَّئُوا وَ لَبِسُوا السِّلَاحَ وَ تَزَيَّنُوا بِأَحْسَنِ الزِّينَةِ",
          "فَلَمَّا طَلَعْنَا عَلَيْهِمْ بِهَذِهِ الصُّورَةِ وَ طَلَعَ الرِّضَا ( عليه السلام ) وَقَفَ عَلَى الْبَابِ وَقْفَةً ثُمَّ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ عَلَى مَا هَدَانَا اللَّهُ أَكْبَرُ عَلَى مَا رَزَقَنَا مِنْ بَهِيمَةِ الْأَنْعَامِ وَ الْحَمْدُ لِلَّهِ عَلَى مَا أَبْلَانَا نَرْفَعُ بِهَا أَصْوَاتَنَا",
          "قَالَ يَاسِرٌ فَتَزَعْزَعَتْ مَرْوُ بِالْبُكَاءِ وَ الضَّجِيجِ وَ الصِّيَاحِ لَمَّا نَظَرُوا إِلَى أَبِي الْحَسَنِ ( عليه السلام ) وَ سَقَطَ الْقُوَّادُ عَنْ دَوَابِّهِمْ وَ رَمَوْا بِخِفَافِهِمْ لَمَّا رَأَوْا أَبَا الْحَسَنِ ( عليه السلام ) حَافِياً وَ كَانَ يَمْشِي وَ يَقِفُ فِي كُلِّ عَشْرِ خُطُوَاتٍ وَ يُكَبِّرُ ثَلَاثَ مَرَّاتٍ",
          "قَالَ يَاسِرٌ فَتُخُيِّلَ إِلَيْنَا أَنَّ السَّمَاءَ وَ الْأَرْضَ وَ الْجِبَالَ تُجَاوِبُهُ وَ صَارَتْ مَرْوُ ضَجَّةً وَاحِدَةً مِنَ الْبُكَاءِ وَ بَلَغَ الْمَأْمُونَ ذَلِكَ فَقَالَ لَهُ الْفَضْلُ بْنُ سَهْلٍ ذُو الرِّئَاسَتَيْنِ يَا أَمِيرَ الْمُؤْمِنِينَ إِنْ بَلَغَ الرِّضَا الْمُصَلَّى عَلَى هَذَا السَّبِيلِ افْتَتَنَ بِهِ النَّاسُ وَ الرَّأْيُ أَنْ تَسْأَلَهُ أَنْ يَرْجِعَ فَبَعَثَ إِلَيْهِ الْمَأْمُونُ فَسَأَلَهُ الرُّجُوعَ فَدَعَا أَبُو الْحَسَنِ ( عليه السلام ) بِخُفِّهِ فَلَبِسَهُ وَ رَكِبَ وَ رَجَعَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Yasser Al Khadim and Al Rayyan Bin Al Salt, altogether said, ",
            "‘When the command of the deposed (Caliph) expired and the command of Al-Mamoun was established, he wrote to Al-Reza<sup>asws</sup> proceeding him<sup>asws</sup> to Khurasan. So Abu Al-Hassan<sup>asws</sup> staved it off by (reason of) illness. But Al-Mamoun did not cease to write to him<sup>asws</sup> regarding that until he<sup>asws</sup> knew that there would be no avoidance for it, and that he would not refrain from him<sup>asws</sup>.  ",
            "So he<sup>asws</sup> went out, and for Abu Ja’far<sup>asws</sup> were seven years. So Al-Mamoun wrote to him<sup>asws</sup> that he<sup>asws</sup> should not take the mountain road and Qum, and take upon the road of Al-Basra and Al-Ahvaz and Persia, until he<sup>asws</sup> arrived at Merv. So Al-Mamoun requested upon him<sup>asws</sup> that he<sup>asws</sup> should collar (upon himself<sup>asws</sup> the command and the Caliphate. But Abu Al-Hassan<sup>asws</sup> refused. He<sup>asws</sup> said, ‘So the crown prince’. So he<sup>asws</sup> said: ‘Upon condition I<sup>asws</sup> shall ask you’. Al-Mamoun said to him<sup>asws</sup>, ‘Ask whatever you<sup>asws</sup> so desire to’. ",
            "So Al-Reza<sup>asws</sup> wrote: ‘I<sup>asws</sup> shall entered into the (office of) the crown prince upon (the stipulations) that I<sup>asws</sup> will neither order, nor forbid, nor issue verdicts, nor judge, nor appoint, nor dismiss, nor change anything from whatever is established, and you will fulfil for me<sup>asws</sup>, all of it from that’. So Al-Mamoun answered him<sup>asws</sup> to that, all of it’. ",
            "He (the narrator) said, ‘Yasir narrated to me saying, ‘So when Eid presented itself, Al-Mamoun sent a message to Al-Reza<sup>asws</sup> asking him<sup>asws</sup> he<sup>asws</sup> should attend the Eid and (lead) the <span class=\"iTxt\">Salat </span>and address (the people). So Al-Reza<sup>asws</sup> sent a message to him: ‘You have known what was between me<sup>asws</sup> and you from the stipulation regarding the entry into this matter’. So Al-Mamoun sent a message to him: ‘But rather I intended with that the slamming of the hearts of the people and their recognising your<sup>asws</sup> merit’. So he did not cease refuting the speech regarding that and (kept on) urging upon it.",
            "So he<sup>asws</sup> said: ‘O commander of the faithful! If you were to excuse me from that, so it would be more beloved to me, and if you do not excuse me, I<sup>asws</sup> shall come out just as Rasool-Allah<sup>saww</sup> and Amir Al-Momineen<sup>asws</sup> came out’. So Al-Mamoun said, ‘Come out however you<sup>asws</sup> so desire to’. And Al-Mamoun ordered the leaders and the people that they should be exclaiming Takbeers to the door of Abu Al-Hassan<sup>asws</sup>’. ",
            "He (the narrator) said, ‘Yasir the servant narrated to me that the people sat for Abu Al-Hassan<sup>asws</sup> in the streets and the rooftops, the men and the women and the children, and the leaders, and the army, at the door of Abu Al-Hassan<sup>asws</sup>. So when the sun emerged, he<sup>asws</sup> arose, so he<sup>asws</sup> washed and turbaned with a white turban of cotton, cast one end upon his<sup>asws</sup> chest and one end between his<sup>asws</sup> shoulders and pulled up, then said to the entirety of the ones in his<sup>asws</sup> Wilayah: ‘Do the like of what I<sup>asws</sup> did’. ",
            "Then he<sup>asws</sup> grabbed a staff by his<sup>asws</sup> hand, then went out, and we were in front of him<sup>asws</sup>, and he<sup>asws</sup> was barefoot and had pulled his<sup>asws</sup> trouser to half the leg, and upon him<sup>asws</sup> was a cloth pulled over. So when he<sup>asws</sup> walked, and we walked in front of him<sup>asws</sup>, he<sup>asws</sup> raised his<sup>asws</sup> head towards the sky and exclaimed four Takbeers. So it seemed to us that the sky and the walls responded to him<sup>asws</sup>, and the leaders and the people were upon the door were ready, and they had put on their weapons and they had adorned with the best of the adornments. ",
            "So when we emerged to them in this image, and Al-Reza<sup>asws</sup> emerged, paused by the door with a pausing, then said: ‘Allah<sup>azwj</sup> is the Greatest! Allah<sup>azwj</sup> is the Greatest! Allah<sup>azwj</sup> is the Greatest ! Allah<sup>azwj</sup> is the Greatest upon what Allah<sup>azwj</sup> had Guided us! Allah<sup>azwj</sup> is the Greatest upon what He<sup>azwj</sup> has Graced us from beasts, the cattle, and the Praise is for Allah<sup>azwj</sup> upon what He<sup>azwj</sup> has Blessed us!’. We raised our voices with it. ",
            "Yasir said, ‘So Al-Merv shaken with the wailing and the racket and the shouting. So when they looked at Abu Al-Hassan<sup>asws</sup>, and the leaders fell off from their animals and threw off their shoes due to what the had seen that Abu Al-Hassan<sup>asws</sup> was barefooted; and he<sup>asws</sup> was walking and pausing during every ten steps, and he<sup>asws</sup> was exclaiming Takbeers three times. ",
            "Yasir said, ‘So it seemed to us that the sky, and the earth, and the mountains are responding to him<sup>asws</sup>, and Merv became one sensation from the wailing. And (the news of) that reached Al-Mamoun, so Al-Fazl Bin Sahl, the one with two governorships said to him, ‘O commander of the faithful! If Al-Reza<sup>asws</sup> reaches the Praying Place upon this way, the people would be fascinated with him<sup>asws</sup>, and the opinion is that you should ask him<sup>asws</sup> that he<sup>asws</sup> returns’. So Al-Mamoun sent a message to him<sup>asws</sup>, asking him<sup>asws</sup> to return. So Abu Al-Hassan<sup>asws</sup> called for his<sup>asws</sup> slippers and he<sup>asws</sup> wore them, and rode, and returned’."
          ],
          "en.sarwar": [
            " 6. Ahmad ibn Muhammad has narrated from from Muhammad ibn al-Hassan from Muhammad ibn ‘Isa from Muhammad ibn Hamza ibn al-Qasim from Ibrahim ibn Musa who has said the following. “I would urge abu al-Hassan al-Rida in a matter that I would demand from him and he would ask to give him time. One day he went out to receive the governor of Madina and I was with him. He came near the castle of so and so and stopped for rest among a few trees. Just the two of us and not a third was there. I said, “May Allah take my soul in service for your cause, this holy is upon us, by Allah, all I have is one Dirham only and nothing else.” He scratched the earth with his whip firmly and with his hand picked up a mold of gold and said, “Use it and keep secret what you just saw.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (83/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1298,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ يَاسِرٍ قَالَ لَمَّا خَرَجَ الْمَأْمُونُ مِنْ خُرَاسَانَ يُرِيدُ بَغْدَادَ وَ خَرَجَ الْفَضْلُ ذُو الرِّئَاسَتَيْنِ وَ خَرَجْنَا مَعَ أَبِي الْحَسَنِ ( عليه السلام ) وَرَدَ عَلَى الْفَضْلِ بْنِ سَهْلٍ ذِي الرِّئَاسَتَيْنِ كِتَابٌ مِنْ أَخِيهِ الْحَسَنِ بْنِ سَهْلٍ وَ نَحْنُ فِي بَعْضِ الْمَنَازِلِ إِنِّي نَظَرْتُ فِي تَحْوِيلِ السَّنَةِ فِي حِسَابِ النُّجُومِ فَوَجَدْتُ فِيهِ أَنَّكَ تَذُوقُ فِي شَهْرِ كَذَا وَ كَذَا يَوْمَ الْأَرْبِعَاءِ حَرَّ الْحَدِيدِ وَ حَرَّ النَّارِ وَ أَرَى أَنْ تَدْخُلَ أَنْتَ وَ أَمِيرُ الْمُؤْمِنِينَ وَ الرِّضَا الْحَمَّامَ فِي هَذَا الْيَوْمِ وَ تَحْتَجِمَ فِيهِ وَ تَصُبَّ عَلَى يَدَيْكَ الدَّمَ لِيَزُولَ عَنْكَ نَحْسُهُ",
          "فَكَتَبَ ذُو الرِّئَاسَتَيْنِ إِلَى الْمَأْمُونِ بِذَلِكَ وَ سَأَلَهُ أَنْ يَسْأَلَ أَبَا الْحَسَنِ ذَلِكَ فَكَتَبَ الْمَأْمُونُ إِلَى أَبِي الْحَسَنِ يَسْأَلُهُ ذَلِكَ فَكَتَبَ إِلَيْهِ أَبُو الْحَسَنِ لَسْتُ بِدَاخِلٍ الْحَمَّامَ غَداً وَ لَا أَرَى لَكَ وَ لَا لِلْفَضْلِ أَنْ تَدْخُلَا الْحَمَّامَ غَداً فَأَعَادَ عَلَيْهِ الرُّقْعَةَ مَرَّتَيْنِ ",
          "فَكَتَبَ إِلَيْهِ أَبُو الْحَسَنِ يَا أَمِيرَ الْمُؤْمِنِينَ لَسْتُ بِدَاخِلٍ غَداً الْحَمَّامَ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فِي هَذِهِ اللَّيْلَةِ فِي النَّوْمِ فَقَالَ لِي يَا عَلِيُّ لَا تَدْخُلِ الْحَمَّامَ غَداً وَ لَا أَرَى لَكَ وَ لَا لِلْفَضْلِ أَنْ تَدْخُلَا الْحَمَّامَ غَداً فَكَتَبَ إِلَيْهِ الْمَأْمُونُ صَدَقْتَ يَا سَيِّدِي وَ صَدَقَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَسْتُ بِدَاخِلٍ الْحَمَّامَ غَداً وَ الْفَضْلُ أَعْلَمُ",
          "قَالَ فَقَالَ يَاسِرٌ فَلَمَّا أَمْسَيْنَا وَ غَابَتِ الشَّمْسُ قَالَ لَنَا الرِّضَا ( عليه السلام ) قُولُوا نَعُوذُ بِاللَّهِ مِنْ شَرِّ مَا يَنْزِلُ فِي هَذِهِ اللَّيْلَةِ فَلَمْ نَزَلْ نَقُولُ ذَلِكَ فَلَمَّا صَلَّى الرِّضَا ( عليه السلام ) الصُّبْحَ قَالَ لِيَ اصْعَدْ عَلَى السَّطْحِ فَاسْتَمِعْ هَلْ تَسْمَعُ شَيْئاً",
          "فَلَمَّا صَعِدْتُ سَمِعْتُ الضَّجَّةَ وَ الْتَحَمَتْ وَ كَثُرَتْ فَإِذَا نَحْنُ بِالْمَأْمُونِ قَدْ دَخَلَ مِنَ الْبَابِ الَّذِي كَانَ إِلَى دَارِهِ مِنْ دَارِ أَبِي الْحَسَنِ وَ هُوَ يَقُولُ يَا سَيِّدِي يَا أَبَا الْحَسَنِ آجَرَكَ اللَّهُ فِي الْفَضْلِ فَإِنَّهُ قَدْ أَبَى وَ كَانَ دَخَلَ الْحَمَّامَ فَدَخَلَ عَلَيْهِ قَوْمٌ بِالسُّيُوفِ فَقَتَلُوهُ وَ أُخِذَ مِمَّنْ دَخَلَ عَلَيْهِ ثَلَاثُ نَفَرٍ كَانَ أَحَدُهُمْ ابْنَ خَالِهِ الْفَضْلَ ابْنَ ذِي الْقَلَمَيْنِ",
          "قَالَ فَاجْتَمَعَ الْجُنْدُ وَ الْقُوَّادُ وَ مَنْ كَانَ مِنْ رِجَالِ الْفَضْلِ عَلَى بَابِ الْمَأْمُونِ فَقَالُوا هَذَا اغْتَالَهُ وَ قَتَلَهُ يَعْنُونَ الْمَأْمُونَ وَ لَنَطْلُبَنَّ بِدَمِهِ وَ جَاءُوا بِالنِّيرَانِ لِيُحْرِقُوا الْبَابَ فَقَالَ الْمَأْمُونُ لِأَبِي الْحَسَنِ ( عليه السلام ) يَا سَيِّدِي تَرَى أَنْ تَخْرُجَ إِلَيْهِمْ وَ تُفَرِّقَهُمْ ",
          "قَالَ فَقَالَ يَاسِرٌ فَرَكِبَ أَبُو الْحَسَنِ وَ قَالَ لِيَ ارْكَبْ فَرَكِبْتُ فَلَمَّا خَرَجْنَا مِنْ بَابِ الدَّارِ نَظَرَ إِلَى النَّاسِ وَ قَدْ تَزَاحَمُوا فَقَالَ لَهُمْ بِيَدِهِ تَفَرَّقُوا تَفَرَّقُوا ",
          "قَالَ يَاسِرٌ فَأَقْبَلَ النَّاسُ وَ اللَّهِ يَقَعُ بَعْضُهُمْ عَلَى بَعْضٍ وَ مَا أَشَارَ إِلَى أَحَدٍ إِلَّا رَكَضَ وَ مَرَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Yasir who said, ",
            "‘When Al-Mamoun went out from Khurasan intending Baghdad, and Al-Fazal, the one with two governorships, went out, and we went out with Abu Al-Hassan<sup>asws</sup>, Al-Fazl, the one with the two governorships received a letter from his brother Al-Hassan Bin Sahl, and we were in one of the lodgings, ‘I looked at the changes of the year in the calculations of the stars, and I found therein that you, in such and such a month on the day of Wednesday, would taste the heat of the iron and heat of the fire, and I view that you and Amir Al-Momineen and Al-Reza<sup>asws</sup> should enter the bathhouse and perform cupping therein, and splash the blood upon your hands in order to decline its inauspiciousness from you’.  ",
            "So the one with the two governorships wrote to Al-Mamoun with that and asked him that he should ask Abu Al-Hassan<sup>asws</sup> (to do) that. So Al-Mamoun wrote to Abu Al-Hassan<sup>asws</sup> asking him<sup>asws</sup> (to do) that. So Abu Al-Hassan<sup>asws</sup> wrote to him: ‘I<sup>asws</sup> wouldn’t be entering the bathhouse tomorrow, nor do I<sup>asws</sup> view for you nor for Al-Fazl that you both should be entering the bathhouse tomorrow’, So he reiterated upon the plan, twice.",
            "Al-Abu Al-Hassan<sup>asws</sup> wrote to him: ‘O commander of the faithful! I wouldn’t be entering the bathhouse tomorrow, for I<sup>asws</sup> saw Rasool-Allah<sup>saww</sup> in this night in the sleep, and he<sup>saww</sup> said to me: ‘O Ali<sup>asws</sup>! Do not enter the bathhouse tomorrow’, nor do I<sup>asws</sup> view for you nor for Al-Fazl that you should both enter the bathhouse tomorrow’. So Al-Mamoun wrote to him<sup>asws</sup>, ‘You<sup>asws</sup> speak the truth, O my Chief, and Rasool-Allah<sup>saww</sup> spoke the truth. I won’t be entering the bathhouse tomorrow, and I shall let Al-Fazl know’. ",
            "He (the narrator) said, ‘So Yasir said, ‘So when we were in the evening and the sun set, Al-Reza<sup>asws</sup> said to us: ‘Say, ‘We seek Refuge with Allah<sup>azwj</sup> from the evil of what would be descending during this night’’. So we did not cease to be saying that. So when Al-Reza prayed the morning <span class=\"iTxt\">Salat</span>, he<sup>asws</sup> said to me: ‘Ascend upon the roof and listen intently, can you hear anything?’ ",
            "So when I had ascended, I heard the commotion, and the struggling, and it was increasing. So there we were with Al-Mamoun who had entered from the door which was to his house from the door of Abu Al-Hassan<sup>asws</sup>, and he was saying, ‘O my Chief! O Abu Al-Hassan<sup>asws</sup>! May Allah<sup>azwj</sup> Recompense you<sup>asws</sup>! With regards to Al-Fazl, so he had refused and had entered the bathhouse, and a group of people came over upon him with the swords, so they killed him; and three of the ones who had come upon him were seized. It was so that one of them was a son of his maternal uncle Al-Fazl Ibn Zul Qalamayn’. ",
            "He (the narrator) said, ‘So the army, and the leaders, and the ones who were from the men of Al-Fazl gathered at the door of Al-Mamoun and they said, ‘He assassinated him and killed him!’, meaning Al-Mamoun, ‘We are seeking his blood’, and they came with the fire in order to burn the door. So Al-Mamoun said to Abu Al-Hassan<sup>asws</sup>, ‘O my Chief! Can you<sup>asws</sup> come out to them and disperse them?’ ",
            "He (the narrator) said, ‘So Yasir said, ‘So Abu Al-Hassan<sup>asws</sup> rode and said to me: ‘Ride’. So I rode. So when we went out from the door of the house, he<sup>asws</sup> looked at the people and they had crowded, so he<sup>asws</sup> said to them by his<sup>asws</sup> hand (gestures): ‘Disperse!’. So they dispersed’. ",
            "Yasir said, ‘So the people turned back. By Allah<sup>azwj</sup>! Some of them were falling upon the others, and he<sup>asws</sup> did not gesture to anyone except he ran and passed by’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Ibrahim has narrated from from Yasir al-Khadim and al-Rayyan ibn al-Salt all have said the following. “When the matter of the deposed Caliph (Amin) ended and it was established for al-Ma’mun he wrote to al-Rida asking to come to Khurasan. Abu al-Hassan (a.s.) in reply presented certain reason to justify his disagreement to the proposal but al-Ma’mun continued writing until The Imam (a.s.) found it out to be unavoidable and that will not leave him alone. He (a.s.) then left for Khurasan when abu Ja‘far was only seven years old. Al-Ma’mun wrote to him, “do not travel through the mountains and Qum. Take the road through Basra, al-Ahwaz and Persia. The Imam (a.s.) arrived at Marw. Al-Ma’mun offered him to command and lead the task of Khilafat (Leadership) but abu al-Hassan (a.s.) declined. He then offered the Imam (a.s.) to accept the post of the crown prince The Imam (a.s.) said that he may accept it under certain conditions. Al-Ma’mun said, “Say whatever conditions you like.” The Imam (a.s.) wrote, “I will assume this post with the conditions that I will nor issue any order or prohibitions nor issue any fatwa or judgment nor any appointment or dismissal of officers or change anything in the current system. You must excuse me in all such matters. Al-Ma’mun agreed to all such conditions. The narrator has said that Yasir narrated to me saying, “When it was ‘Id (the holiday) al-Ma’mun asked al-Rida to attend the program, lead the prayer and deliver the sermon. Al-Rida (a.s.) replied him saying, “You know the conditions between us. They did not consist of any such matters. Al-Ma’mun sent the message, “I only want there by to build confidence in the people and they would know your distinction.” He continued insisting until the Imam (a.s.) said, “O Amir al-Mu’minin, I would appreciate much if you would excuse me from such task and if you would still insist then I will out for this task in the manner that the Messenger of Allah and Amir al-Mu’minin Ali (a.s.) would do.” Al-Ma’mun then said, “You may do as you would chose. Al-Ma’mun ordered the servants guides to lead a procession to the door of abu al-Hassan (a.s.) saying ‘Allahu Akbar’ Allah is great. The narrator has said that Yasir al-Khadim narrated to me this. “People lined up waiting for the Imam (a.s.) on the roads and roof tops, men women and children. The guides and people from the army gathered at the door of abu al-Hassan (a.s.). At sun rise the Imam (a.s.) took a shower, wore a white turban made of cotton. He let one end of the turban hang over his chest and the other end between his shoulder on his back. He tied his belt and asked his followers, “Do as I have done.” He picked up an arrow shaped staff and came out and we were along with him. He was bare foot and his gown was raised half way between his feet and knees and so were his other (long) clothes. When he walked and we walked along with him he raised his head towards the sky and Allahu Akbar (Allah is great) four times. It seemed to us as if the sky and the walls responded to him. the guides and the people at the door were ready and armed and decorated with the best dresses. When we appeared before them in such fashion and al-Rida (a.s.) appeared to them he stood at the door shortly and then said, “Allahu Akbar (Allah is great). Allahu Akbar (Allah is great). Allahu Akbar (Allah is great). Allahu Akbar (Allah is great) for guidance that He has granted us. Allahu Akbar (Allah is great) that has granted us the cattle. All praise belongs to Allah that He has granted us blessings. We all would raise our voices. Yasir al-Khadim has said that the whole Maw shock with the weeping, cries and shouts when they looked at abu al-Hassan (a.s.). Many of the guides fell from their horses who would kick and throw their boots when they saw abu al-Hassan barefoot. He would walk about ten steps and pause and say Allahu Akbar three times. Yasir al-Khadim has said that to us it seemed as if the sky, earth and mountains would respond to him. The whole Marw had become one voice loud and tearful. Information of this was reported to al-Ma’mun and Sahl ibn al-Fadl, who had two official posts, said to him, “Amir al-Mu’minin, if al-Rida would reach the place of prayer in this manner people will into his devotees. Ask him to return home.” Al-Ma’mun sent his people to ask abu al-Hassan to return home. He asked to bring his shoes and wore them and rode back home.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/87)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1299,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:9",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُسَافِرٍ وَ عَنِ الْوَشَّاءِ عَنْ مُسَافِرٍ قَالَ لَمَّا أَرَادَ هَارُونُ بْنُ الْمُسَيَّبِ أَنْ يُوَاقِعَ مُحَمَّدَ بْنَ جَعْفَرٍ قَالَ لِي أَبُو الْحَسَنِ الرِّضَا ( عليه السلام ) اذْهَبْ إِلَيْهِ وَ قُلْ لَهُ لَا تَخْرُجْ غَداً فَإِنَّكَ إِنْ خَرَجْتَ غَداً هُزِمْتَ وَ قُتِلَ أَصْحَابُكَ فَإِنْ سَأَلَكَ مِنْ أَيْنَ عَلِمْتَ هَذَا فَقُلْ رَأَيْتُ فِي الْمَنَامِ ",
          "قَالَ فَأَتَيْتُهُ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ لَا تَخْرُجْ غَداً فَإِنَّكَ إِنْ خَرَجْتَ هُزِمْتَ وَ قُتِلَ أَصْحَابُكَ فَقَالَ لِي مِنْ أَيْنَ عَلِمْتَ هَذَا فَقُلْتُ رَأَيْتُ فِي الْمَنَامِ فَقَالَ نَامَ الْعَبْدُ وَ لَمْ يَغْسِلِ اسْتَهُ ثُمَّ خَرَجَ فَانْهَزَمَ وَ قُتِلَ أَصْحَابُهُ ",
          "قَالَ وَ حَدَّثَنِي مُسَافِرٌ قَالَ كُنْتُ مَعَ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) بِمِنًى فَمَرَّ يَحْيَى بْنُ خَالِدٍ فَغَطَّى رَأْسَهُ مِنَ الْغُبَارِ فَقَالَ مَسَاكِينُ لَا يَدْرُونَ مَا يَحُلُّ بِهِمْ فِي هَذِهِ السَّنَةِ ثُمَّ قَالَ وَ أَعْجَبُ مِنْ هَذَا هَارُونُ وَ أَنَا كَهَاتَيْنِ وَ ضَمَّ إِصْبَعَيْهِ ",
          "قَالَ مُسَافِرٌ فَوَ اللَّهِ مَا عَرَفْتُ مَعْنَى حَدِيثِهِ حَتَّى دَفَنَّاهُ مَعَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Musafir, and from Al Washha, from Musafir who said, ",
            "‘When Al-Haroun Ibn Al-Musayyab intended to fight Muhammad Bin Ja’far, Abu Al-Hassan Al-Reza<sup>asws</sup> said to me: ‘Go to him and say to him, ‘Do not go out tomorrow, for you, if you do go out tomorrow, would be overcome and your companions would be killed’. So if he asks you from where you have come to know this, so say, ‘I saw it in the dream’. ",
            "He (the narrator) said, ‘So I went over to him and said to him, ‘May I be sacrificed for you! Do not go out tomorrow, for if you do go out, you would be overcome and your companions would be killed’. So he said to me, ‘From where did you come to know this?’ So I said, ‘I saw it in the dream’. So he said, ‘The slave sleeps and does not (even) wash his behind?’ Then he did go out, and he was overcome and his companions were killed’. ",
            "He (the narrator) said, ‘And Musafir narrated to me saying, ‘I was with Abu Al-Hassan Al-Reza<sup>asws</sup> at Mina, and Yahya Bin Khalid passed by, and he had covered his head from the dust. So he<sup>asws</sup> said: ‘The poor are not knowing what would be happening with then during this year’. Then he<sup>asws</sup> said: ‘And even more strange than this is that Haroun and I<sup>asws</sup> would be like this’, and he<sup>asws</sup> pressed his two fingers together’. ",
            "Musafir said, ‘So, by Allah<sup>azwj</sup>, I did not know the meaning of his<sup>asws</sup> Hadeeth until he<sup>asws</sup> was buried with (near to) him’."
          ],
          "en.sarwar": [
            " 8. Ali ibn Ibrahim has narrated from Yasir al-Khadim who has said the following. “When al-Ma’mun left Khurasan for Baghdad along with him came Fadl, Dhu al-Al-Ri’asatayn and we came out with abu al-Hassan (a.s.) Fadl ibn Sahl had received a letter from his brother Hassan, while we were on our journey. Hassan had said in the letter, “I studied the Zodiac changes this year according to the astrological calculations. I found out in the month of so and so on a Wednesday you will feel the test of iron and fire. I urged you to go to a Turkish bath with al-Ma’mun and Imam Ridha (a.s) and perform phlebotomies and stain your hands with blood which, will help remove this misfortune from you. Fadl ibn Sahl wrote about it to al-Ma’mun requesting him to request His Holiness Imam Ali ibn Musar-Redha (a.s) to also join them on the appointed day. Al-Ma’mun informed the Holy Imam of the contents of that letter and demanded the consent of His Holiness. In reply to the caliph’s letter Imam al-Ridha (a.s) wrote, “I will not go to the Turkish bath tomorrow. You and Fadl also must not go there tomorrow.” He sent that letter to the Imam (a.s.) twice. Abu al-Hassan (a.s.) wrote to him, “O Amir al-Mu’minin, “I will not go to the Turkish bath. I have seen in a dream the Holy Prophet (a.s) enjoining me not to go to that Turkish bath. You and Fadl also must not go to the Turkish bath.” Al-Ma’mun replied the letter saying, “You have spoken the truth and so has the Messenger of Allah. I will not go to the Turkish bath tomorrow and Fadl knows best.” The narrator has said that Yasir said, “When the night fell al-Rida (a.s.) told us to say, “We seek refuge in Allah against the misfortune in this night. We continued saying the expression. When al-Rida (a.s.) prayed the Morning Prayer he asked me to climb at the roof and to listen if there is anything. When I climbed I heard a great deal of commotion and crying and it was increasing. We saw al-Ma’mun enter from the door that opened to his quarter from the quarter of abu al-Hassan (a.s.) and he said, “My master, abu al-Hassan, may Allah grant you good reward for the death of Fadl. He refused to cancel his decision for the bath and he went to the Turkish bath. A group of people attacked him with swords and killed him. Three of the attackers were arrested and one of them was the son of his maternal uncle, the son of Dhul al-Qalamayn. He then said that the police and the guides and the people of Fadl present at the door of al-Ma’mun said, “He has murdered him.” They killed him. They meant al-Ma’mun thereby.” “We revenge him.” They set the door on fire.” Al-Ma’mun said to abu al-Hassan (a.s.), “My master, please come out to them to calm them down and ask them to disperse.” The narrator has said that Yasir said, “Abu al-Hassan (a.s.) rode and asked me to ride also. When we were out of the door of the house he looked at the people who were crowded. He made hand gestures to asked them to disperse.” Yasir has said, “People began to fall one on the other and to whoever, that he would make a hand gesture he would run and pass by.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور أو حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/89)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1300,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:10",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ قَالَ أَخْبَرَنِي بَعْضُ أَصْحَابِنَا أَنَّهُ حَمَلَ إِلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) مَالًا لَهُ خَطَرٌ فَلَمْ أَرَهُ سُرَّ بِهِ قَالَ فَاغْتَمَمْتُ لِذَلِكَ وَ قُلْتُ فِي نَفْسِي قَدْ حَمَلْتُ هَذَا الْمَالَ وَ لَمْ يُسَرَّ بِهِ فَقَالَ يَا غُلَامُ الطَّسْتَ وَ الْمَاءَ قَالَ فَقَعَدَ عَلَى كُرْسِيٍّ وَ قَالَ بِيَدِهِ وَ قَالَ لِلْغُلَامِ صُبَّ عَلَيَّ الْمَاءَ قَالَ فَجَعَلَ يَسِيلُ مِنْ بَيْنِ أَصَابِعِهِ فِي الطَّسْتِ ذَهَبٌ ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ لِي مَنْ كَانَ هَكَذَا لَا يُبَالِي بِالَّذِي حَمَلْتَهُ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ali Bin Muhammad Al Qasany who said, ",
            "‘One of our companions informed me that he carried over a lot of wealth to Abu Al-Hassan Al-Reza<sup>asws</sup>, but did not see any happiness with him<sup>asws</sup>. He said, ‘So I was gloomy due to that and I said within myself, ‘I have carried (all) this wealth and he<sup>asws</sup> is not happy with it?’ So he<sup>asws</sup> said: ‘O boy! The washbasin and the water!’ So he<sup>asws</sup> sat upon a chair and gestured by his<sup>asws</sup> hand and said to the boy: ‘Pour the water upon me’. So gold flowed from in front of his<sup>asws</sup> fingers in the washbasin. Then he<sup>asws</sup> turned towards me and he<sup>asws</sup> said to me: ‘The one who was like this does not care of that which is carried over to him’."
          ],
          "en.sarwar": [
            " 9. al-Husayn ibnmmd has narrated from Mu‘alla ibnmd from Musafir and from al-Washsha’ from Musafir who has said the following. “When Harun ibn al-Musayyib decided to fight Muhammad ibn Ja‘far, abu al-Hassan (a.s.) told me to go to him and say, “Do not go our tomorrow. If would do so you will be defeated and your people will be killed.” If he would ask, “How do youknow that?” Say, “I saw it in my dream.” The narrator has said that he went to him and said, “May Allah make of service to you, do not go out tomorrow to fight. If would do so you will be defeated and your people will be killed.” He asked, “How do you know this?” I said, “I saw it in my dream.” He said, “A slave goes to sleep (to dream) and his behind is not even washed.” He went out to fight. He was defeated and his people were killed.” The narrator has said that Musafir narrated, “I was in the presenceof al-Rida (a.s.) in Mina, Makka that Yahya ibn Khalid passed by and he covered his head from the dust. The Imam (a.s.) said, “Poor people do not know what will happen to them this year.” I, by Allah, could not understand themeaning of his statement until we buried him (Yahya ibn Khalid).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (93/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1301,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:121:11",
        "text": [
          "سَعْدُ بْنُ عَبْدِ اللَّهِ وَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ قَالَ قُبِضَ عَلِيُّ بْنُ مُوسَى ( عليه السلام ) وَ هُوَ ابْنُ تِسْعٍ وَ أَرْبَعِينَ سَنَةً وَ أَشْهُرٍ فِي عَامِ اثْنَيْنِ وَ مِائَتَيْنِ عَاشَ بَعْدَ مُوسَى بْنِ جَعْفَرٍ عِشْرِينَ سَنَةً إِلَّا شَهْرَيْنِ أَوْ ثَلَاثَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Sa’d Bin Abdullah and Abdullah Bin Ja’far, altogether from Ibrahim Bin Mahziyar, from his brother Ali Bin Mahziyar, from Al Husayn Bin Saeed, from Muhammad Bin Sinan who said, ",
            "‘Ali<sup>asws</sup> Bin Musa<sup>asws</sup> passed away and he<sup>asws</sup> was forty-nine years and one month old, in the year two hundred and two, and he<sup>asws</sup> lived after Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> for twenty years except two months or three’."
          ],
          "en.sarwar": [
            " 10. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ali ibnmd al-Qasani who has said the following. “A Certain person of our people has said that he wanted to deliver an amount of propertyto al-Rida (a.s.). It was a large amount. When he saw it he did not become happy. I became depressed and said to myself, “I delivered this property to him but he did not become happy.” The Imam (a.s.) called, “O boy, bring water and the receptacle.” The narrator has said that the Imam thensat on the chair and made a hand gesture to the boy to pure water on his hand.” The narrator has said that from his hand gold began to fall in the receptacle. He then turned to me and said, “One who would be as this he does not become happy for what you would deliver to him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (94/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "part_type": "Hadith",
        "text": [
          " 11ـ سَعْدُ بْنُ عَبْدِ الله وَعَبْدُ الله بْنُ جَعْفَرٍ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ عَنْ أَخِيهِ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ قَالَ قُبِضَ عَلِيُّ بْنُ مُوسَى (عَلَيْهِ السَّلام) وَهُوَ ابْنُ تِسْعٍ وَأَرْبَعِينَ سَنَةً وَأَشْهُرٍ فِي عَامِ اثْنَيْنِ وَمِائَتَيْنِ عَاشَ بَعْدَ مُوسَى بْنِ جَعْفَرٍ عِشْرِينَ سَنَةً إِلا شَهْرَيْنِ أَوْ ثَلاثَةً."
        ],
        "translations": {
          "en.sarwar": [
            " 11. Sa‘d ibn ‘Abdallah and ‘Abdallah ibn Ja‘far all have narrated from Ibrahim ibn Mahziyar from his brother Ali ibn Mahziyar from al-Hassan al-Husayn ibn Sa‘idfm Muhammad ibn Sinan who has said the following. “Ali ibn Musa (a.s.) died at the age of forty nine and few months in the year two hundred and two AH. He lived for nineteen years and two or three month after the death of Musa ibn Ja‘far (a.s.).”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:121",
  "kind": "verse_list"
}