{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 123"
        },
        "path": "/books/al-kafi:1:4:123",
        "titles": {
          "ar": "باب مَوْلِدِ أَبِي الْحَسَنِ عَلِيِّ بْنِ مُحَمَّدٍ عَلَيْهِمَا السَّلَامُ وَ الرِّضْوَانُ",
          "en": "Chapter 123 – Arrival of Abu Al-Hassan Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>), upon them<sup>asws</sup> both be the greetings and the (Divine) Pleasure"
        }
      }
    ],
    "index": 181,
    "local_index": 123,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:123",
    "titles": {
      "ar": "باب مَوْلِدِ أَبِي الْحَسَنِ عَلِيِّ بْنِ مُحَمَّدٍ عَلَيْهِمَا السَّلَامُ وَ الرِّضْوَانُ",
      "en": "Chapter 123 – Arrival of Abu Al-Hassan Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>), upon them<sup>asws</sup> both be the greetings and the (Divine) Pleasure"
    },
    "verse_count": 9,
    "verse_start_index": 1313,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1314,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:123:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ خَيْرَانَ الْأَسْبَاطِيِّ قَالَ قَدِمْتُ عَلَى أَبِي الْحَسَنِ ( عليه السلام ) الْمَدِينَةَ فَقَالَ لِي مَا خَبَرُ الْوَاثِقِ عِنْدَكَ قُلْتُ جُعِلْتُ فِدَاكَ خَلَّفْتُهُ فِي عَافِيَةٍ أَنَا مِنْ أَقْرَبِ النَّاسِ عَهْداً بِهِ عَهْدِي بِهِ مُنْذُ عَشَرَةِ أَيَّامٍ قَالَ فَقَالَ لِي إِنَّ أَهْلَ الْمَدِينَةِ يَقُولُونَ إِنَّهُ مَاتَ فَلَمَّا أَنْ قَالَ لِيَ النَّاسَ عَلِمْتُ أَنَّهُ هُوَ ",
          "ثُمَّ قَالَ لِي مَا فَعَلَ جَعْفَرٌ قُلْتُ تَرَكْتُهُ أَسْوَأَ النَّاسِ حَالًا فِي السِّجْنِ قَالَ فَقَالَ أَمَا إِنَّهُ صَاحِبُ الْأَمْرِ مَا فَعَلَ ابْنُ الزَّيَّاتِ قُلْتُ جُعِلْتُ فِدَاكَ النَّاسُ مَعَهُ وَ الْأَمْرُ أَمْرُهُ قَالَ فَقَالَ أَمَا إِنَّهُ شُؤْمٌ عَلَيْهِ ",
          "قَالَ ثُمَّ سَكَتَ وَ قَالَ لِي لَا بُدَّ أَنْ تَجْرِيَ مَقَادِيرُ اللَّهِ تَعَالَى وَ أَحْكَامُهُ يَا خَيْرَانُ مَاتَ الْوَاثِقُ وَ قَدْ قَعَدَ الْمُتَوَكِّلُ جَعْفَرٌ وَ قَدْ قُتِلَ ابْنُ الزَّيَّاتِ فَقُلْتُ مَتَى جُعِلْتُ فِدَاكَ قَالَ بَعْدَ خُرُوجِكَ بِسِتَّةِ أَيَّامٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Khayran Al Asbaty who said, ",
            "‘I proceeded to Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> imam<sup>asws</sup>) to Al-Medina, so he<sup>asws</sup> said to me: ‘What is the news of Al-Wasiq (the Caliph) with you?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! I left him in good health. I am from the closest of the people to have met him. I met him ten days ago’. So he<sup>asws</sup> said to me: ‘The people of Al-Medina are saying that he died’. So when he<sup>asws</sup> said to me, ‘the people’, I knew it was him<sup>asws</sup>’. ",
            "Then he<sup>asws</sup> said to me: ‘What happened to Ja’far (Al-Mutawakkil)?’ I said, ‘I left him in the worst state of the people, in the prison’. So he<sup>asws</sup> said: ‘But he is the master of the command (ruler). What happened with Ibn Zayyat (the Vizier of Wasiq)?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! The people are with him, and the command is in his hands’. So he<sup>asws</sup> said, ‘But it has been inauspicious upon him’. ",
            "He (the narrator) said, ‘Then he<sup>asws</sup> was silent, and said to me: ‘It is inevitable that the Pre-determinations of Allah<sup>azwj</sup> the Exalted and His<sup>azwj</sup> Judgments take place. O Khayran! Al-Wasiq has died and Al-Mutawakkil Ja’far has sat (on the throne), and Ibn Zayyat has been killed’. So I said, ‘When? May I be sacrificed for you<sup>asws</sup>!’. He<sup>asws</sup> said: ‘After your exit by six days’."
          ],
          "en.sarwar": [
            " He was born on Dhil Hajj fifteen in the year two hundred twelve. It is said that he was born in the month of Rajab in the year two hundred and fourteen AH. He passed away on twenty sixth of Jamadi al-Akhir in the year two hundred fifty two. It is narrated that he passed away in the month of Rajab in the year two hundred fifty four AH. He lived for forty one years and six months. According to the previously mentioned date he lived for forty years. Ali-Mutawakkil had summond him from al-Madina with Yahya ibn Harthama ibn ’Ayan to Surra man Ra‘Abdallah. He left this world therefrom and he was buried in his house. His mother was ’Umm Walad, called Samana."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (111/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1315,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:123:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ صَالِحِ بْنِ سَعِيدٍ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ ( عليه السلام ) فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ فِي كُلِّ الْأُمُورِ أَرَادُوا إِطْفَاءَ نُورِكَ وَ التَّقْصِيرَ بِكَ حَتَّى أَنْزَلُوكَ هَذَا الْخَانَ الْأَشْنَعَ خَانَ الصَّعَالِيكِ فَقَالَ هَاهُنَا أَنْتَ يَا ابْنَ سَعِيدٍ ثُمَّ أَوْمَأَ بِيَدِهِ وَ قَالَ انْظُرْ فَنَظَرْتُ فَإِذَا أَنَا بِرَوْضَاتٍ آنِقَاتٍ وَ رَوْضَاتٍ بَاسِرَاتٍ فِيهِنَّ خَيْرَاتٌ عَطِرَاتٌ وَ وِلْدَانٌ كَأَنَّهُنَّ اللُّؤْلُؤُ الْمَكْنُونُ وَ أَطْيَارٌ وَ ظِبَاءٌ وَ أَنْهَارٌ تَفُورُ فَحَارَ بَصَرِي وَ حَسَرَتْ عَيْنِي فَقَالَ حَيْثُ كُنَّا فَهَذَا لَنَا عَتِيدٌ لَسْنَا فِي خَانِ الصَّعَالِيكِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from ahmad Bin Muhammad Bin Abdullah, from Muhammad Bin Yahya, from Salih Bin Saeed who said, ",
            "‘I went over to Abu Al-Hassan<sup>asws</sup>, so I said, ‘May I be sacrificed for you<sup>asws</sup>! In every affair they are intending to extinguish your<sup>asws</sup> Light and be deficient with you<sup>asws</sup>, to the extent that they have lodged you<sup>asws</sup> in this repulsive inn, and inn for the tramps!’. So he<sup>asws</sup> said: ‘Over here, you (look), O Ibn Saeed!. Then he<sup>asws</sup> gestured by his<sup>asws</sup> hand and said: ‘Look!’ So I looked, and there I was in delightful gardens, captivating gardens, wherein were Bounties, female and male servants, as if they were hidden pearls, and birds, and deers, and rivers gushing forth. So my sight was bewildered and my eyes were dulled. So he<sup>asws</sup> said: ‘Wherever we<sup>asws</sup> may be, so this is prepared for us<sup>asws</sup>. We<sup>asws</sup> aren’t in the inn of the tramps’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from Khayrana Ali-Asbati who has said the following. “Once I went to al-Madina to see abu al-Hassan (a.s.). He asked me, “What is the news from Ali-Wathiq (Abbassid ruler)?” I said, may Allah take my soul in service for your cause, I left him in good health and I am of all people the latest who met him. I met him just ten days ago.” The narrator has said that the Imam (a.s.) then said, “People of al-Madina say that he has died.” When he said, “people say’ I understood that it is he himself. He then said, “What has Ja‘far (Mutawakkil Abbassid) done?” I said, “I left him in the worst condition of all people. He was in prison.” The narrator has said that he then said, “He has become the ruler. What has ibn Ali-Zayyat (the vizir of Wathiq) has done?” I said, may Allah take my soul in service for your cause, people are with him and whatever he says it goes.” The narrator has said that he then said, “His progress has proved to become a misfortune for him.” The narrator has said that he then paused for a while and said to me, “The measures of Allah, the Most High and His decrees must go on. O Khayaran, al-Wathiq has died and Ali-Mutawakkil , Ja‘far has replaced him and ibn al-Zayyat is killed.” I then asked, “May Allah take my soul in service for your cause, when this has happened?” He said, “After six days from the time you left.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/114)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1316,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:123:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ عَنْ إِسْحَاقَ الْجَلَّابِ قَالَ اشْتَرَيْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) غَنَماً كَثِيرَةً فَدَعَانِي فَأَدْخَلَنِي مِنْ إِصْطَبْلِ دَارِهِ إِلَى مَوْضِعٍ وَاسِعٍ لَا أَعْرِفُهُ فَجَعَلْتُ أُفَرِّقُ تِلْكَ الْغَنَمَ فِيمَنْ أَمَرَنِي بِهِ فَبَعَثَ إِلَى أَبِي جَعْفَرٍ وَ إِلَى وَالِدَتِهِ وَ غَيْرِهِمَا مِمَّنْ أَمَرَنِي ثُمَّ اسْتَأْذَنْتُهُ فِي الِانْصِرَافِ إِلَى بَغْدَادَ إِلَى وَالِدِي وَ كَانَ ذَلِكَ يَوْمَ التَّرْوِيَةِ فَكَتَبَ إِلَيَّ تُقِيمُ غَداً عِنْدَنَا ثُمَّ تَنْصَرِفُ ",
          "قَالَ فَأَقَمْتُ فَلَمَّا كَانَ يَوْمُ عَرَفَةَ أَقَمْتُ عِنْدَهُ وَ بِتُّ لَيْلَةَ الْأَضْحَى فِي رِوَاقٍ لَهُ فَلَمَّا كَانَ فِي السَّحَرِ أَتَانِي فَقَالَ يَا إِسْحَاقُ قُمْ قَالَ فَقُمْتُ فَفَتَحْتُ عَيْنِي فَإِذَا أَنَا عَلَى بَابِي بِبَغْدَادَ قَالَ فَدَخَلْتُ عَلَى وَالِدِي وَ أَنَا فِي أَصْحَابِي فَقُلْتُ لَهُمْ عَرَّفْتُ بِالْعَسْكَرِ وَ خَرَجْتُ بِبَغْدَادَ إِلَى الْعِيدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah, from Ali Bin Muhammad, from Is’haq Al Jallab who said, ",
            "‘I bought a lot of sheep for Abu Al-Hassan<sup>asws</sup>, so he<sup>asws</sup> called me and made me enter into the stables of his<sup>asws</sup> house to a capacious place I did not recognise. So I went on to separate those sheep among the ones he<sup>asws</sup> instructed me with. So I sent to Abu Ja’far<sup>asws</sup> and his<sup>asws</sup> mother, and others from the ones he<sup>asws</sup> instructed me with. Then I sought his<sup>asws</sup> permission regarding leaving to go to Baghdad to my parents, and that was the day of Al-Tarwiyya (8<sup>th</sup> Zilhajj). So he<sup>asws</sup> wrote to me: ‘You should stay tomorrow with us<sup>asws</sup>, then leave’. ",
            "He (the narrator) said, ‘So I stayed. When it was the day of Arafat, I stayed with him<sup>asws</sup> and spent the night of Al-Az’ha in a gallery of his<sup>asws</sup>. When it was the pre-dawn, he<sup>asws</sup> came over to me and he<sup>asws</sup> said: ‘O Is’haq! Arise!’ So I arose and opened my eyes, and there I was upon my door in Baghdad. Therefore, I went over to my parents and I was among my companions. So I said to them, ‘I spent the day of Arafat (9<sup>th</sup> Zilhajj) in Al-Askar and I came out to be in Baghdad to the Eid (10<sup>th</sup> Zilhajj)’."
          ],
          "en.sarwar": [
            " 2. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad ibn ‘Abdallah from Muhammad ibn Yahya from Salih ibn Sa‘id who has said the following. “Once I went to see abu al-Hassan (a.s.) and I said, “May Allah take my soul in service for your cause, in all matters they wanted to extinguish your light and be unjust towards you. So much so that they have lodged you in this disgraceful place for the homeless.” He said, “O ibn Sa‘id, here. He pointed out with his hand and said, “Look there.” When looked I saw gardens. I saw very delightful gardens. There lived lovely boys and girls as if they well protected and secure pearls. There lived birds and beautiful deer. It have fountains and rivers that pur out and gush forth. My sight bewildered and my eyes turned dull. He then said, “Wherever we may live these are for us. We are in the lodging for the homeless.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (117/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1317,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:123:4",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الطَّاهِرِيِّ قَالَ مَرِضَ الْمُتَوَكِّلُ مِنْ خُرَاجٍ خَرَجَ بِهِ وَ أَشْرَفَ مِنْهُ عَلَى الْهَلَاكِ فَلَمْ يَجْسُرْ أَحَدٌ أَنْ يَمَسَّهُ بِحَدِيدَةٍ فَنَذَرَتْ أُمُّهُ إِنْ عُوفِيَ أَنْ تَحْمِلَ إِلَى أَبِي الْحَسَنِ عَلِيِّ بْنِ مُحَمَّدٍ مَالًا جَلِيلًا مِنْ مَالِهَا وَ قَالَ لَهُ الْفَتْحُ بْنُ خَاقَانَ لَوْ بَعَثْتَ إِلَى هَذَا الرَّجُلِ فَسَأَلْتَهُ فَإِنَّهُ لَا يَخْلُو أَنْ يَكُونَ عِنْدَهُ صِفَةٌ يُفَرِّجُ بِهَا عَنْكَ",
          "فَبَعَثَ إِلَيْهِ وَ وَصَفَ لَهُ عِلَّتَهُ فَرَدَّ إِلَيْهِ الرَّسُولُ بِأَنْ يُؤْخَذَ كُسْبُ الشَّاةِ فَيُدَافَ بِمَاءِ وَرْدٍ فَيُوضَعَ عَلَيْهِ فَلَمَّا رَجَعَ الرَّسُولُ وَ أَخْبَرَهُمْ أَقْبَلُوا يَهْزَءُونَ مِنْ قَوْلِهِ فَقَالَ لَهُ الْفَتْحُ هُوَ وَ اللَّهِ أَعْلَمُ بِمَا قَالَ وَ أَحْضَرَ الْكُسْبَ وَ عَمِلَ كَمَا قَالَ وَ وَضَعَ عَلَيْهِ فَغَلَبَهُ النَّوْمُ وَ سَكَنَ ثُمَّ انْفَتَحَ وَ خَرَجَ مِنْهُ مَا كَانَ فِيهِ وَ بُشِّرَتْ أُمُّهُ بِعَافِيَتِهِ",
          "فَحَمَلَتْ إِلَيْهِ عَشَرَةَ آلَافِ دِينَارٍ تَحْتَ خَاتَمِهَا ثُمَّ اسْتَقَلَّ مِنْ عِلَّتِهِ فَسَعَى إِلَيْهِ الْبَطْحَائِيُّ الْعَلَوِيُّ بِأَنَّ أَمْوَالًا تُحْمَلُ إِلَيْهِ وَ سِلَاحاً فَقَالَ لِسَعِيدٍ الْحَاجِبِ اهْجُمْ عَلَيْهِ بِاللَّيْلِ وَ خُذْ مَا تَجِدُ عِنْدَهُ مِنَ الْأَمْوَالِ وَ السِّلَاحِ وَ احْمِلْهُ إِلَيَّ",
          "قَالَ إِبْرَاهِيمُ بْنُ مُحَمَّدٍ فَقَالَ لِي سَعِيدٌ الْحَاجِبُ صِرْتُ إِلَى دَارِهِ بِاللَّيْلِ وَ مَعِي سُلَّمٌ فَصَعِدْتُ السَّطْحَ فَلَمَّا نَزَلْتُ عَلَى بَعْضِ الدَّرَجِ فِي الظُّلْمَةِ لَمْ أَدْرِ كَيْفَ أَصِلُ إِلَى الدَّارِ فَنَادَانِي يَا سَعِيدُ مَكَانَكَ حَتَّى يَأْتُوكَ بِشَمْعَةٍ فَلَمْ أَلْبَثْ أَنْ أَتَوْنِي بِشَمْعَةٍ فَنَزَلْتُ فَوَجَدْتُهُ عَلَيْهِ جُبَّةُ صُوفٍ وَ قَلَنْسُوَةٌ مِنْهَا وَ سَجَّادَةٌ عَلَى حَصِيرٍ بَيْنَ يَدَيْهِ فَلَمْ أَشُكَّ أَنَّهُ كَانَ يُصَلِّي",
          "فَقَالَ لِي دُونَكَ الْبُيُوتَ فَدَخَلْتُهَا وَ فَتَّشْتُهَا فَلَمْ أَجِدْ فِيهَا شَيْئاً وَ وَجَدْتُ الْبَدْرَةَ فِي بَيْتِهِ مَخْتُومَةً بِخَاتَمِ أُمِّ الْمُتَوَكِّلِ وَ كِيساً مَخْتُوماً وَ قَالَ لِي دُونَكَ الْمُصَلَّى فَرَفَعْتُهُ فَوَجَدْتُ سَيْفاً فِي جَفْنٍ غَيْرِ مُلَبَّسٍ فَأَخَذْتُ ذَلِكَ وَ صِرْتُ إِلَيْهِ فَلَمَّا نَظَرَ إِلَى خَاتَمِ أُمِّهِ عَلَى الْبَدْرَةِ بَعَثَ إِلَيْهَا فَخَرَجَتْ إِلَيْهِ",
          "فَأَخْبَرَنِي بَعْضُ خَدَمِ الْخَاصَّةِ أَنَّهَا قَالَتْ لَهُ كُنْتُ قَدْ نَذَرْتُ فِي عِلَّتِكَ لَمَّا أَيِسْتُ مِنْكَ إِنْ عُوفِيتَ حَمَلْتُ إِلَيْهِ مِنْ مَالِي عَشَرَةَ آلَافِ دِينَارٍ فَحَمَلْتُهَا إِلَيْهِ وَ هَذَا خَاتَمِي عَلَى الْكِيسِ وَ فَتَحَ الْكِيسَ الْآخَرَ فَإِذَا فِيهِ أَرْبَعُمِائَةِ دِينَارٍ فَضَمَّ إِلَى الْبَدْرَةِ بَدْرَةً أُخْرَى وَ أَمَرَنِي بِحَمْلِ ذَلِكَ إِلَيْهِ فَحَمَلْتُهُ وَ رَدَدْتُ السَّيْفَ وَ الْكِيسَيْنِ وَ قُلْتُ لَهُ يَا سَيِّدِي عَزَّ عَلَيَّ فَقَالَ لِي سَيَعْلَمُ الَّذِينَ ظَلَمُوا أَيَّ مُنْقَلَبٍ يَنْقَلِبُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ibrahim Bin Muhammad Al Tahiry who said, ",
            "‘Al-Mutawakkil (the Caliph) fell sick from an abscess than came out with him, and faced the death due to it. No one had the boldness that he touches him with an iron (to perform surgery). So his mother vowed if he is cured, she would carry over to Abu Al-Hassan Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup>, a stately portion from her wealth, and Al-Fat’h Bin Khaqan said to him, ‘If only you would send to this man (10<sup>th</sup> Imam<sup>asws</sup>) and ask him<sup>asws</sup>, for he<sup>asws</sup> would not be devoid that there would happen to be in his<sup>asws</sup> possession a remedy for you to be relieved by it’. ",
            "Therefore, he sent a message to him<sup>asws</sup> and described his illness to him<sup>asws</sup>. A messenger returned to him with: ‘Take an oil extracted from a sheep’s fat mixed with rose extracts and warm it with water and place it upon it (the boil)’. So when the messenger returned and informed them, they turned around mocking at his<sup>asws</sup> words. So Al-Fat’h said to him (Al-Mutawakkil), ‘By Allah<sup>azwj</sup>! He<sup>asws</sup> is more knowing with what he<sup>asws</sup> said’, and he brought the oil extracts and prepared it just as he<sup>asws</sup> has said, and placed upon it. So the sleep overcame him and he settled. Then it (the boil) split, and whatever was in it came out, and his mother was given the glad tidings of his recovery. ",
            "So she carried over ten thousand Dinars to him<sup>asws</sup> sealed with her insignia. Then he fully recovered from his illness, so Al-Bat’hai Al-Alawy informed him that (large amounts of) wealth is being carried over to him along with weapons. So he said to Saeed the guard, ‘Raid upon him<sup>asws</sup> at night and seize whatever you find with him<sup>asws</sup> from the wealth and the weapons, and carry it over to me’. ",
            "He (the narrator) said, ‘Ibrahim Bin Muhammad said, ‘So Saeed the guard said to me, ‘I went to his<sup>asws</sup> house at night and with me was a ladder. So I ascended to the rood. So when I descended upon one of the level in the darkness, I did not know how I could arrive to the house. So he<sup>asws</sup> called out to me: ‘O Saeed! (Stay) in your place until they bring you the candle’. So it was not long before I was given a candle. So I descended and I found him<sup>asws</sup> to have a woollen coat upon him<sup>asws</sup>, and a woollen cap of it, and there was a prayer mat upon a carpet in front of him<sup>asws</sup>. So I did not doubt that he<sup>asws</sup> was Praying <span class=\"iTxt\">Salat</span>. ",
            "So he<sup>asws</sup> said to me: ‘Besides you there are rooms’. So I entered these and investigated them but I could not find anything therein, and I found the bag in his<sup>asws</sup> house sealed by a seal of the mother of Al-Mutawakkil, and a (another) sealed bag. And he<sup>asws</sup> said to me: ‘Beside you is the prayer mat. So I raised it and I found a sheathed sword without a covering. So I seized that and went over to him (Al-Mutawakkil). So when he looked at the seal of his mother upon the bag, he sent a message to her. So she came out to him. ",
            "So, one of the specials servants informed me that she said to him, ‘It was so that I had vowed regarding your illness due to what you lived from it, and if you recover, I would carry over to him from my own wealth, ten thousand Dinars. So I carried it over to him, and this is my seal upon the bag’. And he opened the other bag, and there were four hundred Dinars. So he merged these with the bag, another bag, and instructed me to carry that over to him<sup>asws</sup>. So I carried it and returned the sword and the two bags, and I said to him, ‘O my Master<sup>asws</sup>! (This is) hurtful upon me’. So he<sup>asws</sup> said to me: <span class=\"ibTxt\">[26:227] and they who act unjustly shall come to know the turning they shall be Overturned with</span>’."
          ],
          "en.sarwar": [
            " 3. Al-Husayn ibn Muhammad has narrated from from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad ibn ‘Abdallah from Ali ibn Muhammad from Ishaq al-Jallab who has said the following. “Once I bought a large number of sheeps for abu al-Hassan (a.s.). He called and admitted me into the barn area of his house into a vast location that I could not recognize. He ordered me to distribute the sheep among certain people and of such people were abu Ja‘far and his mother and others. Thereafter I requested permission to leave for Baghdad to see my father. It was the day of Tarwiya (eighth of the month of Dhi al-Hajj). He wrote to me, “Stay with us tomorrow thereafter leave.” I stayed that day and then it was the day of ‘Arafa (ninth of Dhi al-Hajj but I stayed with them that day as well as the tenth night in the balcony of his house. At dawn he came to me and said, “O Ishaq, wake up.” I then got up.” The narrator has said that I then opened my eyes and found myself at my own door in Baghdad. I went inside and met my father and I was among my people and I told them I spent the day of ‘Arafa (ninth of Dhi al-Hajj) in the army camp (Samarra) and for ‘Id (tenth of Dhi al-Hajj) I am in Baghdad.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/118)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1318,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:123:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ الْمُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ النَّوْفَلِيِّ قَالَ قَالَ لِي مُحَمَّدُ بْنُ الْفَرَجِ إِنَّ أَبَا الْحَسَنِ كَتَبَ إِلَيْهِ يَا مُحَمَّدُ أَجْمِعْ أَمْرَكَ وَ خُذْ حِذْرَكَ قَالَ فَأَنَا فِي جَمْعِ أَمْرِي وَ لَيْسَ أَدْرِي مَا كَتَبَ إِلَيَّ حَتَّى وَرَدَ عَلَيَّ رَسُولٌ حَمَلَنِي مِنْ مِصْرَ مُقَيَّداً وَ ضَرَبَ عَلَى كُلِّ مَا أَمْلِكُ وَ كُنْتُ فِي السِّجْنِ ثَمَانَ سِنِينَ ",
          "ثُمَّ وَرَدَ عَلَيَّ مِنْهُ فِي السِّجْنِ كِتَابٌ فِيهِ يَا مُحَمَّدُ لَا تَنْزِلْ فِي نَاحِيَةِ الْجَانِبِ الْغَرْبِيِّ فَقَرَأْتُ الْكِتَابَ فَقُلْتُ يَكْتُبُ إِلَيَّ بِهَذَا وَ أَنَا فِي السِّجْنِ إِنَّ هَذَا لَعَجَبٌ فَمَا مَكَثْتُ أَنْ خُلِّيَ عَنِّي وَ الْحَمْدُ لِلَّهِ",
          "قَالَ وَ كَتَبَ إِلَيْهِ مُحَمَّدُ بْنُ الْفَرَجِ يَسْأَلُهُ عَنْ ضِيَاعِهِ فَكَتَبَ إِلَيْهِ سَوْفَ تُرَدُّ عَلَيْكَ وَ مَا يَضُرُّكَ أَنْ لَا تُرَدَّ عَلَيْكَ فَلَمَّا شَخَصَ مُحَمَّدُ بْنُ الْفَرَجِ إِلَى الْعَسْكَرِ كُتِبَ إِلَيْهِ بِرَدِّ ضِيَاعِهِ وَ مَاتَ قَبْلَ ذَلِكَ ",
          "قَالَ وَ كَتَبَ أَحْمَدُ بْنُ الْخَضِيبِ إِلَى مُحَمَّدِ بْنِ الْفَرَجِ يَسْأَلُهُ الْخُرُوجَ إِلَى الْعَسْكَرِ فَكَتَبَ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) يُشَاوِرُهُ فَكَتَبَ إِلَيْهِ اخْرُجْ فَإِنَّ فِيهِ فَرَجَكَ إِنْ شَاءَ اللَّهُ تَعَالَى فَخَرَجَ فَلَمْ يَلْبَثْ إِلَّا يَسِيراً حَتَّى مَاتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Al Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah, from Ali Bin Muhammad Al Nowfaly who said, ",
            "‘Muhammad Bin Al-Faraj said to me that Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) wrote to him: ‘O Muhammad! Gather your affairs and take your caution’. He said, ‘So I was gathering my affairs and I didn’t know what he<sup>asws</sup> wrote to me (its meaning) until a messenger came over to me and carried me away from Egypt, and struck upon (confiscated) everything that I owned, and I was in prison for eight years. ",
            "Then a letter arrived to me from him<sup>asws</sup> in prison in which he<sup>asws</sup> wrote: ‘O Muhammad! Do not lodge in the western side’. So I wrote the letter and I said (to myself), ‘He<sup>asws</sup> write to me with this and I am in prison. This is strange!’. So it wasn’t long before they released me, and the Praise is for Allah<sup>azwj</sup>.",
            "He (the narrator) said, ‘And Muhammad Bin Al-Faraj wrote to him<sup>asws</sup> asking him<sup>asws</sup> about his estate. So he<sup>asws</sup> wrote to him: ‘Soon they would be returned to you, and it would not harm you if there are not returned to you’. When Muhammad Bin Al-Faraj went to Al-Askar, it was written to him for the return of his estate, and he died before that’. ",
            "He (the narrator) said, ‘And Ahmad Bin Al-Khazeyb wrote to Muhammad Bin Al-Faraj asking him of the going out to Al-Askar. So he wrote to Abu Al-Hassan<sup>asws</sup> consulting him<sup>asws</sup>. So he<sup>asws</sup> wrote to him: ‘Go out, for therein is your relief, if Allah<sup>azwj</sup> the Exalted so Desires’. So he went out, and he did not remain except for a little until he died’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad has narrated from Ibrahim ibn Muhammad al-Tahiri who has said the following. “ Al-Mutawakkil became ill because of a boil so seriously that he was about to die and no one would have the courage to touch to operate him. His mother vowed to sent a large sum of money to abu al-Hassan (a.s.) from her own property if her son would recover. Fath ibn Khaqan had advised him to ask him (the Imam (a.s.) about it. He might know something that would help relieve you. He sent the message to him and explained his illness. The messenger returned with a message that said, “Warm up oil from sheep mixed with water and place it on the boil.” When the messenger explained it to them they laughed at his words. However, al-Fath said, “He, by Allah, knows best about what he has said.” They brought the oil and prepared it as explained and placed it on the boil. The patience soon after was fast asleep and his acting pain had calmed down. Afterwards it opened up and the substance in it was discharged and his mother was given the glad news of his recovery. She sent ten thousand Dinars to him (abu al-Hassan (a.s.) marked with her own seal. He had fully recovered from his illness, al-Batha’i al-‘Alawi acting as a spy said to him, “Large sums of money and weapons are delivered to him (abu al-Hassan (a.s.).” He (Al-Mutawakkil) ordered Sa‘id the police chief to search his house during the night and confiscate whatever money and weapons you would find therein and bring hem to him (Al-Mutawakkil).” Ibrahim ibn Muhammad has said, “Sa‘id, the chief of police told me that when I went to his house during the night and I had a ladder to climb over the wall and when I climbed on the roof and then climbed down few steps in the dark I did not know how to reach the house. He (abu al-Hassan (a.s.) called me, “O Sa‘id, hold on until they bring you candles. In a little while they brought me a candle and I climbed down and found him with woolen gown on him and woolen cap and before him there was prayer rug with a mat on it. I then had no doubt that he was praying. He said to me, “There are the rooms.” I then searched them and did not find anything there but I found the bag of money in his house that was sealed with the seal of the mother of Al-Mutawakkil on it and another sealed bag of money. He said to me, “There is the prayer rug.” I lifted it up and there was a sword underneath in a sheath. I took them to Al-Mutawakkil. When saw the seal of his mother on it he called her for inquiry and she came to him. Private servants informed me that she said to him, “When you were very ill, I had vowed out of frustration that if you would recover I will pay him ten thousand Dinars from my own properties. I paid him and this is my own seal. He opened the other bag and there was a four hundred Dinars in it. He added an other bag of money to it and asked me to deliver them to him (abu al-Hassan (a.s.) I returned the sword and the bags of money to him saying, “My master, (I wish you knew) how much this assignment has depressed me.” He said, “The unjust ones will find out very soon to what kind of destination they will end up.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/121)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1319,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:123:6",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ رَجُلٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ قَالَ أَخْبَرَنِي أَبُو يَعْقُوبَ قَالَ رَأَيْتُهُ يَعْنِي مُحَمَّداً قَبْلَ مَوْتِهِ بِالْعَسْكَرِ فِي عَشِيَّةٍ وَ قَدِ اسْتَقْبَلَ أَبَا الْحَسَنِ ( عليه السلام ) فَنَظَرَ إِلَيْهِ وَ اعْتَلَّ مِنْ غَدٍ فَدَخَلْتُ إِلَيْهِ عَائِداً بَعْدَ أَيَّامٍ مِنْ عِلَّتِهِ وَ قَدْ ثَقُلَ فَأَخْبَرَنِي أَنَّهُ بَعَثَ إِلَيْهِ بِثَوْبٍ فَأَخَذَهُ وَ أَدْرَجَهُ وَ وَضَعَهُ تَحْتَ رَأْسِهِ قَالَ فَكُفِّنَ فِيهِ",
          "قَالَ أَحْمَدُ قَالَ أَبُو يَعْقُوبَ رَأَيْتُ أَبَا الْحَسَنِ ( عليه السلام ) مَعَ ابْنِ الْخَضِيبِ فَقَالَ لَهُ ابْنُ الْخَضِيبِ سِرْ جُعِلْتُ فِدَاكَ فَقَالَ لَهُ أَنْتَ الْمُقَدَّمُ فَمَا لَبِثَ إِلَّا أَرْبَعَةَ أَيَّامٍ حَتَّى وُضِعَ الدَّهَقُ عَلَى سَاقِ ابْنِ الْخَضِيبِ ثُمَّ نُعِيَ ",
          "قَالَ رُوِيَ عَنْهُ حِينَ أَلَحَّ عَلَيْهِ ابْنُ الْخَضِيبِ فِي الدَّارِ الَّتِي يَطْلُبُهَا مِنْهُ بَعَثَ إِلَيْهِ لَأَقْعُدَنَّ بِكَ مِنَ اللَّهِ عَزَّ وَ جَلَّ مَقْعَداً لَا يَبْقَى لَكَ بَاقِيَةٌ فَأَخَذَهُ اللَّهُ عَزَّ وَ جَلَّ فِي تِلْكَ الْأَيَّامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from a man, from Ahmad Bin Muhammad who said, ‘Abu Yaqoub Informed me saying, ",
            "‘I saw him, meaning Muhammad (Ibn Al-Faraj), before his death at Al-Askar in the evening, and Abu Al-Hassan<sup>asws</sup> had received him, and he<sup>asws</sup> looked after him, and he became ill the next morning, and I went to console him after a few days from his illness and it has become worse. So he informed me that he<sup>asws</sup> had sent a cloth to him, so he took it and layered it and placed it under his head. He (the narrator) said, ‘So he was enshrouded in it. ",
            "Ahmad said, ‘Abu Yaqoub said, ‘I saw Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) with Ibn Al-Khazeyb, so Ibn Al-Khazeyb said to him<sup>asws</sup>, ‘(You<sup>asws</sup> will) go (first), May I be sacrificed for you<sup>asws</sup>’. So he<sup>asws</sup> said to him: ‘You would be the preceding one’. So it was not long except for four days until shackles were placed upon the leg of Ibn Al-Khazeyb, then news of his death was released’. ",
            "He (the narrator) said, ‘It is reported from him when Ibn Al-Kahzeyb insisted upon him<sup>asws</sup> regarding the house which he was seeking from him<sup>asws</sup>, he<sup>asws</sup> sent a message to him: ‘I<sup>asws</sup> shall sit with you from Allah<sup>azwj</sup> Mighty and Majestic with such a sitting that there will not remain for you a remaining (trace)’. So Allah<sup>azwj</sup> Mighty and Majestic Seized him during that year’."
          ],
          "en.sarwar": [
            " 5. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad ibn ‘Abdallah from Ali ibn Muhammad al-Nawfali who has said the following. “Muhammad ibn al-Faraj told me that abu al-Hassan (a.s.) has written to him this. “O Muhammad, organize you affairs and be careful.” He said that he began to organize his affairs and did not know what the Imam (a.s.) meant thereby until police came to me and took me out of Egypt as a captive. All of my belongings were confiscated and I remained in prison for eight years. In the prison I received a letter from him that said, “O Muhammad, do not reside in the western location.” I read the letter and said to my self, “He writes me this and I am in prison. This is strange.” Shortly afterwards, I was released, thanks to Allah. The narrator has said that Muhammad ibn al-Faraj wrote to him about his properties. The Imam (a.s.) wrote to him in response, “Your properties will soon be returned to you and even if they are not returned to you it will not harm you.” When Muhammad al-Faraj left to the army camp (Samarra) an order was issued to release his properties but he died before receiving them. The narrator has said that Ahmad ibn al-Khadib wrote to Muhammad ibn al-Faraj asking him to come to the army camp. He wrote to the Imam (a.s.) for his advise in the matter and the response was this. “ Go out. In it there will be happiness and relief for you, by the will of Allah, the Most High..” He left for the journey but very shortly afterwards he died.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/122)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1320,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:123:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ بَعْضِ أَصْحَابِنَا قَالَ أَخَذْتُ نُسْخَةَ كِتَابِ الْمُتَوَكِّلِ إِلَى أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام ) مِنْ يَحْيَى بْنِ هَرْثَمَةَ فِي سَنَةِ ثَلَاثٍ وَ أَرْبَعِينَ وَ مِائَتَيْنِ وَ هَذِهِ نُسْخَتُهُ",
          "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ أَمَّا بَعْدُ فَإِنَّ أَمِيرَ الْمُؤْمِنِينَ عَارِفٌ بِقَدْرِكَ رَاعٍ لِقَرَابَتِكَ مُوجِبٌ لِحَقِّكَ يُقَدِّرُ مِنَ الْأُمُورِ فِيكَ وَ فِي أَهْلِ بَيْتِكَ مَا أَصْلَحَ اللَّهُ بِهِ حَالَكَ وَ حَالَهُمْ وَ ثَبَّتَ بِهِ عِزَّكَ وَ عِزَّهُمْ وَ أَدْخَلَ الْيُمْنَ وَ الْأَمْنَ عَلَيْكَ وَ عَلَيْهِمْ يَبْتَغِي بِذَلِكَ رِضَاءَ رَبِّهِ وَ أَدَاءَ مَا افْتُرِضَ عَلَيْهِ فِيكَ وَ فِيهِمْ",
          "وَ قَدْ رَأَى أَمِيرُ الْمُؤْمِنِينَ صَرْفَ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَمَّا كَانَ يَتَوَلَّاهُ مِنَ الْحَرْبِ وَ الصَّلَاةِ بِمَدِينَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِذْ كَانَ عَلَى مَا ذَكَرْتَ مِنْ جَهَالَتِهِ بِحَقِّكَ وَ اسْتِخْفَافِهِ بِقَدْرِكَ وَ عِنْدَ مَا قَرَفَكَ بِهِ وَ نَسَبَكَ إِلَيْهِ مِنَ الْأَمْرِ الَّذِي قَدْ عَلِمَ أَمِيرُ الْمُؤْمِنِينَ بَرَاءَتَكَ مِنْهُ وَ صِدْقَ نِيَّتِكَ فِي تَرْكِ مُحَاوَلَتِهِ وَ أَنَّكَ لَمْ تُؤَهِّلْ نَفْسَكَ لَهُ",
          "وَ قَدْ وَلَّى أَمِيرُ الْمُؤْمِنِينَ مَا كَانَ يَلِي مِنْ ذَلِكَ مُحَمَّدَ بْنَ الْفَضْلِ وَ أَمَرَهُ بِإِكْرَامِكَ وَ تَبْجِيلِكَ وَ الِانْتِهَاءِ إِلَى أَمْرِكَ وَ رَأْيِكَ وَ التَّقَرُّبِ إِلَى اللَّهِ وَ إِلَى أَمِيرِ الْمُؤْمِنِينَ بِذَلِكَ وَ أَمِيرُ الْمُؤْمِنِينَ مُشْتَاقٌ إِلَيْكَ يُحِبُّ إِحْدَاثَ الْعَهْدِ بِكَ وَ النَّظَرَ إِلَيْكَ فَإِنْ نَشِطْتَ لِزِيَارَتِهِ وَ الْمُقَامِ قِبَلَهُ مَا رَأَيْتَ شَخَصْتَ وَ مَنْ أَحْبَبْتَ مِنْ أَهْلِ بَيْتِكَ وَ مَوَالِيكَ وَ حَشَمِكَ عَلَى مُهْلَةٍ وَ طُمَأْنِينَةٍ تَرْحَلُ إِذَا شِئْتَ وَ تَنْزِلُ إِذَا شِئْتَ وَ تَسِيرُ كَيْفَ شِئْتَ",
          "وَ إِنْ أَحْبَبْتَ أَنْ يَكُونَ يَحْيَى بْنُ هَرْثَمَةَ مَوْلَى أَمِيرِ الْمُؤْمِنِينَ وَ مَنْ مَعَهُ مِنَ الْجُنْدِ مُشَيِّعِينَ لَكَ يَرْحَلُونَ بِرَحِيلِكَ وَ يَسِيرُونَ بِسَيْرِكَ وَ الْأَمْرُ فِي ذَلِكَ إِلَيْكَ حَتَّى تُوَافِيَ أَمِيرَ الْمُؤْمِنِينَ ",
          "فَمَا أَحَدٌ مِنْ إِخْوَتِهِ وَ وُلْدِهِ وَ أَهْلِ بَيْتِهِ وَ خَاصَّتِهِ أَلْطَفَ مِنْهُ مَنْزِلَةً وَ لَا أَحْمَدَ لَهُ أُثْرَةً وَ لَا هُوَ لَهُمْ أَنْظَرَ وَ عَلَيْهِمْ أَشْفَقَ وَ بِهِمْ أَبَرَّ وَ إِلَيْهِمْ أَسْكَنَ مِنْهُ إِلَيْكَ إِنْ شَاءَ اللَّهُ تَعَالَى وَ السَّلَامُ عَلَيْكَ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ ",
          "وَ كَتَبَ إِبْرَاهِيمُ بْنُ الْعَبَّاسِ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ وَ سَلَّمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from one of our companions who said, ",
            "‘I took a copy of the letter of Al-Mutawakkil to Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup> (10<sup>th</sup> Imam<sup>asws</sup>), from Yahya Bin Harsama, in the year two hundred and forty three, and this here is its copy: -",
            "In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. As for afterwards – It is so that the commander of the faithful (the Caliph himself), recognises your<sup>asws</sup> worth, looking after you<sup>asws</sup> due to your<sup>asws</sup> near relationship Obligated for your<sup>asws</sup> right. He is able from the affairs regarding you<sup>asws</sup> and regarding the people of your<sup>asws</sup> household, what Allah<sup>azwj</sup> would Correct your<sup>asws</sup> state with and their state, and affirms your<sup>asws</sup> honour by it and their honour, and the security upon you<sup>asws</sup> and upon them. He (the Caliph himself) is seeking the Pleasure of his Lord<sup>azwj</sup> by that, and fulfil whatever He<sup>azwj</sup> Necessitated upon him regarding you<sup>asws</sup> and regarding them. ",
            "And the commander of the faithful views that he should change Abdullah Bin Muhammad from what he had made him the commander of the forces and the (leader) of the <span class=\"iTxt\">Salat</span> at the city of Rasool-Allah<sup>saww</sup>, when it was upon what you<sup>asws</sup> mentioned from his ignorance of your<sup>asws</sup> rights and his belittling your<sup>asws</sup> worth, and during what he accused with and linked to you<sup>asws</sup> from the matters which the commander of the faithful knows of your<sup>asws</sup> disavowing from it, and ratifies your<sup>asws</sup> intentions regarding the neglect of his attempts, and you<sup>asws</sup> yourself<sup>asws</sup> were not rightful for it. ",
            "And the commander of the faithful has hereby had made to rule, what he had ruled from that, Muhammad Bin Al-Fazl and ordered him with honouring you<sup>asws</sup> and revering you<sup>asws</sup> and the ending up to your<sup>asws</sup> orders and your<sup>asws</sup> view, and to get closer to Allah<sup>azwj</sup> and to the commander of the faithful by that. And the commander of the faithful is desirous to you<sup>asws</sup>. He<sup>asws</sup> would love to renew the covenant with you<sup>asws</sup> and look at you<sup>asws</sup>. So if you<sup>asws</sup> were to activate for visiting him and the staying before him for as long as you<sup>asws</sup> see fit, yourself and the ones you<sup>asws</sup> love from your<sup>asws</sup> family, and your<sup>asws</sup> friends, and your<sup>asws</sup> attendants upon a deadlines and suitability of riding whenever you<sup>asws</sup> so desire to, and lodge whenever you<sup>asws</sup> so desire to, and travel however you<sup>asws</sup> so desire to.",
            "And if you<sup>asws</sup> so like that there should happen to be Yahya Bin Harsama, a slave of the commander of the faithful, and the ones with him from the forces to be walking for you<sup>asws</sup>, riding with your<sup>asws</sup> rides and travelling with your<sup>asws</sup> travels, the command regarding that is to you<sup>asws</sup> until you arrive to the commander of the faithful. ",
            "So there is no one from his brethren, and his children, and his family members, and his special ones he would be kinder to in status, nor praiseworthy to of effects, nor is he more considerate to them and more merciful upon them and more righteous with them, or peaceful to him than he would be to you<sup>asws</sup>, if Allah<sup>azwj</sup> the Exalted so Desires. And the greetings be upon you<sup>asws</sup> and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings. ",
            "And written by Ibrahim Bin Al-Abbas (a scribe), and may Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawat</span> upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, and greetings’."
          ],
          "en.sarwar": [
            " 6. Al-Husayn ibn Muhammad has narrated from a man from Ahmad ibn Muhammad who has said the following. “Abu ya‘qub informed me saying, ‘ I saw him (Muhammad) before his death in the army camp in an evening. Abu al-Hassan received him and looked at him and he became ill the next day. After several days I went to visit him during his illness and his illness was worsening. He informed me that he (abu al-Hassan (a.s.) has sent him cloths which he had folded to use as a pillow. The narrator has said that he was shrouded in that cloth.” Ahmad has said that abu ya‘qub said, “I saw abu al-Hassan (a.s.) with ibn al-Khadib who said to him, “May Allah take my soul in service for your cause, go ahead.” The Imam (a.s.) said, “You go first.” Only after four days he was put in shackles and the news of his death was given out. The narrator has said that it is narrated that when ibn al-Khadib insisted in his demand from him the house he sent him this messages. “I will ask Allah, the Most Majestic, the Most gracious, to place as such that not even your traces would be found.” Allah, the Most Majestic, the Most gracious, took him away in those days.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (124/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1321,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:123:8",
        "text": [
          "الْحُسَيْنُ بْنُ الْحَسَنِ الْحَسَنِيُّ قَالَ حَدَّثَنِي أَبُو الطَّيِّبِ الْمُثَنَّى يَعْقُوبُ بْنُ يَاسِرٍ قَالَ كَانَ الْمُتَوَكِّلُ يَقُولُ وَيْحَكُمْ قَدْ أَعْيَانِي أَمْرُ ابْنِ الرِّضَا أَبَى أَنْ يَشْرَبَ مَعِي أَوْ يُنَادِمَنِي أَوْ أَجِدَ مِنْهُ فُرْصَةً فِي هَذَا فَقَالُوا لَهُ فَإِنْ لَمْ تَجِدْ مِنْهُ فَهَذَا أَخُوهُ مُوسَى قَصَّافٌ عَزَّافٌ يَأْكُلُ وَ يَشْرَبُ وَ يَتَعَشَّقُ قَالَ ابْعَثُوا إِلَيْهِ فَجِيئُوا بِهِ حَتَّى نُمَوِّهَ بِهِ عَلَى النَّاسِ وَ نَقُولَ ابْنُ الرِّضَا ",
          "فَكَتَبَ إِلَيْهِ وَ أُشْخِصَ مُكَرَّماً وَ تَلَقَّاهُ جَمِيعُ بَنِي هَاشِمٍ وَ الْقُوَّادُ وَ النَّاسُ عَلَى أَنَّهُ إِذَا وَافَى أَقْطَعَهُ قَطِيعَةً وَ بَنَى لَهُ فِيهَا وَ حَوَّلَ الْخَمَّارِينَ وَ الْقِيَانَ إِلَيْهِ وَ وَصَلَهُ وَ بَرَّهُ وَ جَعَلَ لَهُ مَنْزِلًا سَرِيّاً حَتَّى يَزُورَهُ هُوَ فِيهِ",
          "فَلَمَّا وَافَى مُوسَى تَلَقَّاهُ أَبُو الْحَسَنِ فِي قَنْطَرَةِ وَصِيفٍ وَ هُوَ مَوْضِعٌ تُتَلَقَّى فِيهِ الْقَادِمُونَ فَسَلَّمَ عَلَيْهِ وَ وَفَّاهُ حَقَّهُ ثُمَّ قَالَ لَهُ إِنَّ هَذَا الرَّجُلَ قَدْ أَحْضَرَكَ لِيَهْتِكَكَ وَ يَضَعَ مِنْكَ فَلَا تُقِرَّ لَهُ أَنَّكَ شَرِبْتَ نَبِيذاً قَطُّ فَقَالَ لَهُ مُوسَى فَإِذَا كَانَ دَعَانِي لِهَذَا فَمَا حِيلَتِي قَالَ فَلَا تَضَعْ مِنْ قَدْرِكَ وَ لَا تَفْعَلْ فَإِنَّمَا أَرَادَ هَتْكَكَ",
          "فَأَبَى عَلَيْهِ فَكَرَّرَ عَلَيْهِ فَلَمَّا رَأَى أَنَّهُ لَا يُجِيبُ قَالَ أَمَا إِنَّ هَذَا مَجْلِسٌ لَا تُجْمَعُ أَنْتَ وَ هُوَ عَلَيْهِ أَبَداً فَأَقَامَ ثَلَاثَ سِنِينَ يُبَكِّرُ كُلَّ يَوْمٍ فَيُقَالُ لَهُ قَدْ تَشَاغَلَ الْيَوْمَ فَرُحْ فَيَرُوحُ فَيُقَالُ قَدْ سَكِرَ فَبَكِّرْ فَيُبَكِّرُ فَيُقَالُ شَرِبَ دَوَاءً فَمَا زَالَ عَلَى هَذَا ثَلَاثَ سِنِينَ حَتَّى قُتِلَ الْمُتَوَكِّلُ وَ لَمْ يَجْتَمِعْ مَعَهُ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Al Hassan Al Husayni said, ‘Abu Al Tayyib Al Musanna Yaqoub Bin Yasir narrated to me saying, ",
            "‘Al-Mutawakkil was saying, ‘Wo be unto you all! The matter of the son<sup>asws</sup> of Al Reza<sup>asws</sup> has exhausted me. He<sup>asws</sup> refuses to drink with me, or to socialise with me, or find an opportunity with regards to this!’ So they said to him, ‘So if you cannot find (a way) from him<sup>asws</sup>, so this here is his<sup>asws</sup> brother Musa, a singer, a musician. He eats and drinks and mates’. He said, ‘Send a message to him and bring him to me until I gossip with him upon the people and we will be saying, ‘He is the son of Al-Reza<sup>asws</sup>’. ",
            "So he wrote to him and invited him honourably, and to be met by the entirety of the Clan of Hashim, and the leaders, and the people upon a stipulation that when he keeps to the appointment, a piece of land would be cut out for him and a building would be built for him therein, and the drunkards and the singers would be transported to it. And he maintained goodly relations with him and was righteous with him and quickly made a dwelling for him where he would visit him therein when he would be in it.",
            "So when Musa kept to the appointment, Abu Al-Hassan<sup>asws</sup> met him in the reception arcade, and it was a place in which the guests were (normally) welcomed. So he<sup>asws</sup> greeted upon him and reminded him of his rights, then said to him: ‘This man (Al-Mutawakkil) has got you here in order to disgrace you place insults on you, therefore do not acknowledge to him that you tend to drink Nabeez (an intoxicating drink), at all’. So Musa said to him<sup>asws</sup>, ‘So when he has invited me for this, so what is my way out?’ He<sup>asws</sup> said: ‘Do not drop yourself from your worth and do not do it, for rather he intends to disgrace you’. ",
            "But he refused over it, and he<sup>asws</sup> re-iterated upon it. So when he<sup>asws</sup> saw that he is not responding, he<sup>asws</sup> said: ‘As for this gathering, so you and him would not be gathering upon it, ever!’ So he stayed for three years trying to go to him in the morning every day, but it was said to him, ‘He is busy today, so go away’. So he would go. And it was said to him, ‘He is intoxicated, so come tomorrow morning’. So he would come in the morning, and it was said to him, ‘He has drunk the medication’. Thus, it did not cease to be upon this for three years until Al-Mutawakkil was killed and he did not gather with him over it’."
          ],
          "en.sarwar": [
            " 7. Muhammad ibn Yahya has narrated from a number of our people the following. “I took a copy of the letter of Al-Mutawakkil to abu al-Hassan (a.s.), the third from Yahya ibn Harthama in the year two hundred forty three that read as follows. “In the name of Allah, the Beneficent, the Merciful. Thereafter, Amir al-Mu’minin acknowledges your positions, takes good care of you as a relative, deems it obligatory to observe your rights. He pays attentions towards your well fare and the well being of your family through the means with which Allah will grant well being to you and to them and establish your honor and honor to them, grant blessing and security to you and to them. He seeks thereby the pleasure of his Lord and to fulfill his obligations towards you and to them. Amir al-Mu’minin, believes that it is best to remove ‘Abdallah ibn Muhammad as commander of the army and prayer leader in al-Madina of the Messenger of Allah since you have mentioned his ignorance and his disregard of your rights. That he has not respected you properly. Also it is because of his accusing you of matters that Amir al-Mu’minin has learned is unfounded and he acquits of such charges. It is because of your sincere intentions in not leading a attempt to achieve what you consider yourself unfit for. Amir al-Mu’minin has replace him (‘Abdallah ibn Muhammad) with Muhammad ibn al-Fadl and has ordered him to honor and revere you and abide by your orders and opinions. He must seek nearness to Allah and to Amir al-Mu’minin in this way. Amir al-Mu’minin looks forwards to see you and loves to see you soon to look at you. If you would like to visit him and stay with him as long as you would like along with whoever of the members of your family and friends and servants you may do so whenever convenient for you and desirable. You may start your journey whenever you would like, stop on the way whenever and wherever you would like. If you would like, Yahya ibn Harthama, the slave of Amir al-Mu’minin and the elements of the army will escort you. They will travel as you would like them to do so. All the matters will be up to you to decide until you would arrive at Amir al-Mu’minin’s place. No one of his brothers, sons, family members and persons special to him would be deserving more kindness, respected position, more praise worthy and preferable to him than you do. He will not be more caring, compassionate and helpful to them and more happy with any of them than he will be with you. If Allah would so will. May peace be with you and the kindness and blessings of Allah. Written by Ibrahim ibn al-‘Abbass. May Allah grant blessing up on Muhammad and his family."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (127/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1322,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:123:9",
        "text": [
          "بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ أَخْبَرَنِي زَيْدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ زَيْدٍ قَالَ مَرِضْتُ فَدَخَلَ الطَّبِيبُ عَلَيَّ لَيْلًا فَوَصَفَ لِي دَوَاءً بِلَيْلٍ آخُذُهُ كَذَا وَ كَذَا يَوْماً فَلَمْ يُمَكِّنِّي فَلَمْ يَخْرُجِ الطَّبِيبُ مِنَ الْبَابِ حَتَّى وَرَدَ عَلَيَّ نَصْرٌ بِقَارُورَةٍ فِيهَا ذَلِكَ الدَّوَاءُ بِعَيْنِهِ فَقَالَ لِي أَبُو الْحَسَنِ يُقْرِئُكَ السَّلَامَ وَ يَقُولُ لَكَ خُذْ هَذَا الدَّوَاءَ كَذَا وَ كَذَا يَوْماً فَأَخَذْتُهُ فَشَرِبْتُهُ فَبَرَأْتُ ",
          "قَالَ مُحَمَّدُ بْنُ عَلِيٍّ قَالَ لِي زَيْدُ بْنُ عَلِيٍّ يَأْبَى الطَّاعِنُ أَيْنَ الْغُلَاةُ عَنْ هَذَا الْحَدِيثِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Some of our companions, from Muhammad Bin Ali who said, ‘Zayd Bin Ali Bin Al Husayn Bin Zayd informed me saying, ",
            "‘I fell sick, so the physician came over to me one night, and he prescribed a medication for me that I should be taking at night for such and such (number of) days. But I was not able (to find it). So the physician had not gone out from the door until Nasr came over to me with a bottle wherein was that very medicine, and he said to me, ‘Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) conveys the greetings and is saying to you: ‘Take this medicine for such and such (number of) days’. So I took it and drank it, and I was cured’. ",
            "Muhammad Bin Ali (the 2<sup>nd</sup> narrator) said, ‘Zayd Bin Ali (the first narrator) said to me, ‘The critics are refusing, ‘From where are the exaggerators (bringing) this Hadeeth?’."
          ],
          "en.sarwar": [
            " 8. al-Husayn ibn al-Hassan al-Hassani has said that narrated to me abu al-Tayb al-Muthanna ya‘qub ibn Yasir the following. “Al-Mutawakkil would say, “Woe is you, the ibn (the son of) al-Rida, (Ali al-Hadi (a.s.)) has frustrated me. He refuses to share a drink (liquor) with me and associate with me and I never get a chance in it.” They (his associates) told him, “If he does not give you a chance his brother, Musa plays music, sings, eats, drinks and seeks carnal love.” He asked them to call him so that we may confuse people with ibn al-Rida (Musa considered as Ali al-Hadi) has become an associate of Al-Mutawakkil. He wrote to Musa and invited him with honorably. All the people from the clan of Hashim present, the officials and people received him with the condition that on his arrival a piece of land will be given to him on which proper accommodations will be build for him. People who love to drink liquor and the singers will come to meet him there. He (Al-Mutawakkil) maintained good relations with him, cared for him and prepared a gorgeous lodging for him where he would visit him therein. When Musa arrived abu al-Hassan (a.s.) met him at al-Qantra Wasif, the place where the visitors were being received. He met him, offered him the greeting of peace and observed his rights. Then he said to him, “This mman has invited you to insult and humiliate you. Do not confess to him that you have ever drank any liquor.” Musa said, “If he has invited me for this purpose then what should I do?” The Imam (a.s.) said, “Do not humiliate yourself and do not drink any liquor because he wants to insult you.” He (Musa) refused and he (abu al-Hassan (a.s.)) repeated his advise. When he found out that he (Musa) does not agree he said, “Remember, this is a place where you will never be able to meet him (Al-Mutawakkil).” He (Musa) lived there for three years. Everyday he would wake up and his people would tell that Al-Mutawakkil is busy today you can meet him next time. He would go and they would tell him that he (Al-Mutawakkil) is drunk. He would go again and they would say he (Al-Mutawakkil) has just had medicine. It continued this way for three years until Al-Mutawakkil was killed and Musa had never had a chance to meet him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/130)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "part_type": "Hadith",
        "text": [
          " 9ـ بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ أَخْبَرَنِي زَيْدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ زَيْدٍ قَالَ مَرِضْتُ فَدَخَلَ الطَّبِيبُ عَلَيَّ لَيْلاً فَوَصَفَ لِي دَوَاءً بِلَيْلٍ آخُذُهُ كَذَا وَكَذَا يَوْماً فَلَمْ يُمَكِّنِّي فَلَمْ يَخْرُجِ الطَّبِيبُ مِنَ الْبَابِ حَتَّى وَرَدَ عَلَيَّ نَصْرٌ بِقَارُورَةٍ فِيهَا ذَلِكَ الدَّوَاءُ بِعَيْنِهِ فَقَالَ لِي أَبُو الْحَسَنِ يُقْرِئُكَ السَّلامَ وَيَقُولُ لَكَ خُذْ هَذَا الدَّوَاءَ كَذَا وَكَذَا يَوْماً فَأَخَذْتُهُ فَشَرِبْتُهُ فَبَرَأْتُ قَالَ مُحَمَّدُ بْنُ عَلِيٍّ قَالَ لِي زَيْدُ بْنُ عَلِيٍّ يَأْبَى الطَّاعِنُ أَيْنَ الْغُلاةُ عَنْ هَذَا الْحَدِيثِ."
        ],
        "translations": {
          "en.sarwar": [
            " 9. Certain persons of our people have narrated from Muhammad ibn Ali who has said the following. “Zayd ibn Ali ibn al-Husayn ibn Zayd narrated to me as follows. “I became ill and a doctor came to see me at night. He prescribed a medicine for me to be taken at night for so and so many days. I could not find the medicine that night. The physician was still there that Nasr came in with a bottle that contained the medicine that the physician had prescribed for me and said, “Abu al-Hassan (a.s.) sends you the greeting of peace and has asked you to take this medicine for so and so many days.” I took the medicine and recovered from my illness.” Muhammad ibn Ali has said that Zayd ibn ail told me, “The critics would refuse to accept this hadith saying, “Wherefrom the extremist have brought this hadith?”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:123",
  "kind": "verse_list"
}