{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 124"
        },
        "path": "/books/al-kafi:1:4:124",
        "titles": {
          "ar": "باب مَوْلِدِ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيٍّ ( عليه السلام )",
          "en": "Chapter 124 –Arrival of Abu Muhammad Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>)"
        }
      }
    ],
    "index": 182,
    "local_index": 124,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 125"
        },
        "path": "/books/al-kafi:1:4:125",
        "titles": {
          "ar": "باب مَوْلِدِ الصَّاحِبِ ( عليه السلام )",
          "en": "Chapter 125 –Arrival of the Master<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 123"
        },
        "path": "/books/al-kafi:1:4:123",
        "titles": {
          "ar": "باب مَوْلِدِ أَبِي الْحَسَنِ عَلِيِّ بْنِ مُحَمَّدٍ عَلَيْهِمَا السَّلَامُ وَ الرِّضْوَانُ",
          "en": "Chapter 123 – Arrival of Abu Al-Hassan Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>), upon them<sup>asws</sup> both be the greetings and the (Divine) Pleasure"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:124",
    "titles": {
      "ar": "باب مَوْلِدِ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيٍّ ( عليه السلام )",
      "en": "Chapter 124 –Arrival of Abu Muhammad Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>)"
    },
    "verse_count": 27,
    "verse_start_index": 1322,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1323,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> الْأَشْعَرِيُّ وَ مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُمَا قَالُوا كَانَ أَحْمَدُ بْنُ عُبَيْدِ اللَّهِ بْنِ خَاقَانَ عَلَى الضِّيَاعَ وَ الْخَرَاجِ بِقُمَّ فَجَرَى فِي مَجْلِسِهِ يَوْماً ذِكْرُ الْعَلَوِيَّةِ وَ مَذَاهِبِهِمْ وَ كَانَ شَدِيدَ النَّصْبِ فَقَالَ مَا رَأَيْتُ وَ لَا عَرَفْتُ بِسُرَّ مَنْ رَأَى رَجُلًا مِنَ الْعَلَوِيَّةِ مِثْلَ الْحَسَنِ بْنِ عَلِيِّ بْنِ مُحَمَّدِ بْنِ الرِّضَا فِي هَدْيِهِ وَ سُكُونِهِ وَ عَفَافِهِ وَ نُبْلِهِ وَ كَرَمِهِ عِنْدَ أَهْلِ بَيْتِهِ وَ بَنِي هَاشِمٍ وَ تَقْدِيمِهِمْ إِيَّاهُ عَلَى ذَوِي السِّنِّ مِنْهُمْ وَ الْخَطَرِ وَ كَذَلِكَ الْقُوَّادِ وَ الْوُزَرَاءِ وَ عَامَّةِ النَّاسِ ",
          "فَإِنِّي كُنْتُ يَوْماً قَائِماً عَلَى رَأْسِ أَبِي وَ هُوَ يَوْمُ مَجْلِسِهِ لِلنَّاسِ إِذْ دَخَلَ عَلَيْهِ حُجَّابُهُ فَقَالُوا أَبُو مُحَمَّدِ بْنُ الرِّضَا بِالْبَابِ فَقَالَ بِصَوْتٍ عَالٍ ائْذَنُوا لَهُ فَتَعَجَّبْتُ مِمَّا سَمِعْتُ مِنْهُمْ أَنَّهُمْ جَسَرُوا يُكَنُّونَ رَجُلًا عَلَى أَبِي بِحَضْرَتِهِ وَ لَمْ يُكَنَّ عِنْدَهُ إِلَّا خَلِيفَةٌ أَوْ وَلِيُّ عَهْدٍ أَوْ مَنْ أَمَرَ السُّلْطَانُ أَنْ يُكَنَّى ",
          "فَدَخَلَ رَجُلٌ أَسْمَرُ حَسَنُ الْقَامَةِ جَمِيلُ الْوَجْهِ جَيِّدُ الْبَدَنِ حَدَثُ السِّنِّ لَهُ جَلَالَةٌ وَ هَيْبَةٌ فَلَمَّا نَظَرَ إِلَيْهِ أَبِي قَامَ يَمْشِي إِلَيْهِ خُطًى وَ لَا أَعْلَمُهُ فَعَلَ هَذَا بِأَحَدٍ مِنْ بَنِي هَاشِمٍ وَ الْقُوَّادِ فَلَمَّا دَنَا مِنْهُ عَانَقَهُ وَ قَبَّلَ وَجْهَهُ وَ صَدْرَهُ وَ أَخَذَ بِيَدِهِ وَ أَجْلَسَهُ عَلَى مُصَلَّاهُ الَّذِي كَانَ عَلَيْهِ وَ جَلَسَ إِلَى جَنْبِهِ مُقْبِلًا عَلَيْهِ بِوَجْهِهِ وَ جَعَلَ يُكَلِّمُهُ وَ يَفْدِيهِ بِنَفْسِهِ",
          "وَ أَنَا مُتَعَجِّبٌ مِمَّا أَرَى مِنْهُ إِذْ دَخَلَ عَلَيْهِ الْحَاجِبُ فَقَالَ الْمُوَفَّقُ قَدْ جَاءَ وَ كَانَ الْمُوَفَّقُ إِذَا دَخَلَ عَلَى أَبِي تَقَدَّمَ حُجَّابُهُ وَ خَاصَّةُ قُوَّادِهِ فَقَامُوا بَيْنَ مَجْلِسِ أَبِي وَ بَيْنَ بَابِ الدَّارِ سِمَاطَيْنِ إِلَى أَنْ يَدْخُلَ وَ يَخْرُجَ فَلَمْ يَزَلْ أَبِي مُقْبِلًا عَلَى أَبِي مُحَمَّدٍ يُحَدِّثُهُ حَتَّى نَظَرَ إِلَى غِلْمَانِ الْخَاصَّةِ فَقَالَ حِينَئِذٍ إِذَا شِئْتَ جَعَلَنِيَ اللَّهُ فِدَاكَ",
          "ثُمَّ قَالَ لِحُجَّابِهِ خُذُوا بِهِ خَلْفَ السِّمَاطَيْنِ حَتَّى لَا يَرَاهُ هَذَا يَعْنِي الْمُوَفَّقَ فَقَامَ وَ قَامَ أَبِي وَ عَانَقَهُ وَ مَضَى فَقُلْتُ لِحُجَّابِ أَبِي وَ غِلْمَانِهِ وَيْلَكُمْ مَنْ هَذَا الَّذِي كَنَّيْتُمُوهُ عَلَى أَبِي وَ فَعَلَ بِهِ أَبِي هَذَا الْفِعْلَ فَقَالُوا هَذَا عَلَوِيٌّ يُقَالُ لَهُ الْحَسَنُ بْنُ عَلِيٍّ يُعْرَفُ بِابْنِ الرِّضَا فَازْدَدْتُ تَعَجُّباً وَ لَمْ أَزَلْ يَوْمِي ذَلِكَ قَلِقاً مُتَفَكِّراً فِي أَمْرِهِ وَ أَمْرِ أَبِي وَ مَا رَأَيْتُ فِيهِ حَتَّى كَانَ اللَّيْلُ وَ كَانَتْ عَادَتُهُ أَنْ يُصَلِّيَ الْعَتَمَةَ ثُمَّ يَجْلِسُ فَيَنْظُرُ فِيمَا يَحْتَاجُ إِلَيْهِ مِنَ الْمُؤَامَرَاتِ وَ مَا يَرْفَعُهُ إِلَى السُّلْطَانِ",
          "فَلَمَّا صَلَّى وَ جَلَسَ جِئْتُ فَجَلَسْتُ بَيْنَ يَدَيْهِ وَ لَيْسَ عِنْدَهُ أَحَدٌ فَقَالَ لِي يَا أَحْمَدُ لَكَ حَاجَةٌ قُلْتُ نَعَمْ يَا أَبَهْ فَإِنْ أَذِنْتَ لِي سَأَلْتُكَ عَنْهَا فَقَالَ قَدْ أَذِنْتُ لَكَ يَا بُنَيَّ فَقُلْ مَا أَحْبَبْتَ قُلْتُ يَا أَبَهْ مَنِ الرَّجُلُ الَّذِي رَأَيْتُكَ بِالْغَدَاةِ فَعَلْتَ بِهِ مَا فَعَلْتَ مِنَ الْإِجْلَالِ وَ الْكَرَامَةِ وَ التَّبْجِيلِ وَ فَدَيْتَهُ بِنَفْسِكَ وَ أَبَوَيْكَ",
          "فَقَالَ يَا بُنَيَّ ذَاكَ إِمَامُ الرَّافِضَةِ ذَاكَ الْحَسَنُ بْنُ عَلِيٍّ الْمَعْرُوفُ بِابْنِ الرِّضَا فَسَكَتَ سَاعَةً ثُمَّ قَالَ يَا بُنَيَّ لَوْ زَالَتِ الْإِمَامَةُ عَنْ خُلَفَاءِ بَنِي الْعَبَّاسِ مَا اسْتَحَقَّهَا أَحَدٌ مِنْ بَنِي هَاشِمٍ غَيْرُ هَذَا وَ إِنَّ هَذَا لَيَسْتَحِقُّهَا فِي فَضْلِهِ وَ عَفَافِهِ وَ هَدْيِهِ وَ صِيَانَتِهِ وَ زُهْدِهِ وَ عِبَادَتِهِ وَ جَمِيلِ أَخْلَاقِهِ وَ صَلَاحِهِ وَ لَوْ رَأَيْتَ أَبَاهُ رَأَيْتَ رَجُلًا جَزْلًا نَبِيلًا فَاضِلًا ",
          "فَازْدَدْتُ قَلَقاً وَ تَفَكُّراً وَ غَيْظاً عَلَى أَبِي وَ مَا سَمِعْتُ مِنْهُ وَ اسْتَزَدْتُهُ فِي فِعْلِهِ وَ قَوْلِهِ فِيهِ مَا قَالَ فَلَمْ يَكُنْ لِي هِمَّةٌ بَعْدَ ذَلِكَ إِلَّا السُّؤَالُ عَنْ خَبَرِهِ وَ الْبَحْثُ عَنْ أَمْرِهِ فَمَا سَأَلْتُ أَحَداً مِنْ بَنِي هَاشِمٍ وَ الْقُوَّادِ وَ الْكُتَّابِ وَ الْقُضَاةِ وَ الْفُقَهَاءِ وَ سَائِرِ النَّاسِ إِلَّا وَجَدْتُهُ عِنْدَهُ فِي غَايَةِ الْإِجْلَالِ وَ الْإِعْظَامِ وَ الْمَحَلِّ الرَّفِيعِ وَ الْقَوْلِ الْجَمِيلِ وَ التَّقْدِيمِ لَهُ عَلَى جَمِيعِ أَهْلِ بَيْتِهِ وَ مَشَايِخِهِ فَعَظُمَ قَدْرُهُ عِنْدِي إِذْ لَمْ أَرَ لَهُ وَلِيّاً وَ لَا عَدُوّاً إِلَّا وَ هُوَ يُحْسِنُ الْقَوْلَ فِيهِ وَ الثَّنَاءَ عَلَيْهِ ",
          "فَقَالَ لَهُ بَعْضُ مَنْ حَضَرَ مَجْلِسَهُ مِنَ الْأَشْعَرِيِّينَ يَا أَبَا بَكْرٍ فَمَا خَبَرُ أَخِيهِ جَعْفَرٍ فَقَالَ وَ مَنْ جَعْفَرٌ فَتَسْأَلَ عَنْ خَبَرِهِ أَوْ يُقْرَنَ بِالْحَسَنِ جَعْفَرٌ مُعْلِنُ الْفِسْقِ فَاجِرٌ مَاجِنٌ شِرِّيبٌ لِلْخُمُورِ أَقَلُّ مَنْ رَأَيْتُهُ مِنَ الرِّجَالِ وَ أَهْتَكُهُمْ لِنَفْسِهِ خَفِيفٌ قَلِيلٌ فِي نَفْسِهِ",
          "وَ لَقَدْ وَرَدَ عَلَى السُّلْطَانِ وَ أَصْحَابِهِ فِي وَقْتِ وَفَاةِ الْحَسَنِ بْنِ عَلِيٍّ مَا تَعَجَّبْتُ مِنْهُ وَ مَا ظَنَنْتُ أَنَّهُ يَكُونُ وَ ذَلِكَ أَنَّهُ لَمَّا اعْتَلَّ بَعَثَ إِلَى أَبِي أَنَّ ابْنَ الرِّضَا قَدِ اعْتَلَّ فَرَكِبَ مِنْ سَاعَتِهِ فَبَادَرَ إِلَى دَارِ الْخِلَافَةِ ثُمَّ رَجَعَ مُسْتَعْجِلًا وَ مَعَهُ خَمْسَةٌ مِنْ خَدَمِ أَمِيرِ الْمُؤْمِنِينَ كُلُّهُمْ مِنْ ثِقَاتِهِ وَ خَاصَّتِهِ فِيهِمْ نِحْرِيرٌ",
          "فَأَمَرَهُمْ بِلُزُومِ دَارِ الْحَسَنِ وَ تَعَرُّفِ خَبَرِهِ وَ حَالِهِ وَ بَعَثَ إِلَى نَفَرٍ مِنَ الْمُتَطَبِّبِينَ فَأَمَرَهُمْ بِالِاخْتِلَافِ إِلَيْهِ وَ تَعَاهُدِهِ صَبَاحاً وَ مَسَاءً فَلَمَّا كَانَ بَعْدَ ذَلِكَ بِيَوْمَيْنِ أَوْ ثَلَاثَةٍ أُخْبِرَ أَنَّهُ قَدْ ضَعُفَ فَأَمَرَ الْمُتَطَبِّبِينَ بِلُزُومِ دَارِهِ وَ بَعَثَ إِلَى قَاضِي الْقُضَاةِ فَأَحْضَرَهُ مَجْلِسَهُ وَ أَمَرَهُ أَنْ يَخْتَارَ مِنْ أَصْحَابِهِ عَشَرَةً مِمَّنْ يُوثَقُ بِهِ فِي دِينِهِ وَ أَمَانَتِهِ وَ وَرَعِهِ فَأَحْضَرَهُمْ فَبَعَثَ بِهِمْ إِلَى دَارِ الْحَسَنِ وَ أَمَرَهُمْ بِلُزُومِهِ لَيْلًا وَ نَهَاراً",
          "فَلَمْ يَزَالُوا هُنَاكَ حَتَّى تُوُفِّيَ ( عليه السلام ) فَصَارَتْ سُرَّ مَنْ رَأَى ضَجَّةً وَاحِدَةً وَ بَعَثَ السُّلْطَانُ إِلَى دَارِهِ مَنْ فَتَّشَهَا وَ فَتَّشَ حُجَرَهَا وَ خَتَمَ عَلَى جَمِيعِ مَا فِيهَا وَ طَلَبُوا أَثَرَ وَلَدِهِ وَ جَاءُوا بِنِسَاءٍ يَعْرِفْنَ الْحَمْلَ فَدَخَلْنَ إِلَى جَوَارِيهِ يَنْظُرْنَ إِلَيْهِنَّ فَذَكَرَ بَعْضُهُنَّ أَنَّ هُنَاكَ جَارِيَةً بِهَا حَمْلٌ فَجُعِلَتْ فِي حُجْرَةٍ وَ وُكِّلَ بِهَا نِحْرِيرٌ الْخَادِمُ وَ أَصْحَابُهُ وَ نِسْوَةٌ مَعَهُمْ ",
          "ثُمَّ أَخَذُوا بَعْدَ ذَلِكَ فِي تَهْيِئَتِهِ وَ عُطِّلَتِ الْأَسْوَاقُ وَ رَكِبَتْ بَنُو هَاشِمٍ وَ الْقُوَّادُ وَ أَبِي وَ سَائِرُ النَّاسِ إِلَى جَنَازَتِهِ فَكَانَتْ سُرَّ مَنْ رَأَى يَوْمَئِذٍ شَبِيهاً بِالْقِيَامَةِ فَلَمَّا فَرَغُوا مِنْ تَهْيِئَتِهِ بَعَثَ السُّلْطَانُ إِلَى أَبِي عِيسَى بْنِ الْمُتَوَكِّلِ فَأَمَرَهُ بِالصَّلَاةِ عَلَيْهِ ",
          "فَلَمَّا وُضِعَتِ الْجَنَازَةُ لِلصَّلَاةِ عَلَيْهِ دَنَا أَبُو عِيسَى مِنْهُ فَكَشَفَ عَنْ وَجْهِهِ فَعَرَضَهُ عَلَى بَنِي هَاشِمٍ مِنَ الْعَلَوِيَّةِ وَ الْعَبَّاسِيَّةِ وَ الْقُوَّادِ وَ الْكُتَّابِ وَ الْقُضَاةِ وَ الْمُعَدَّلِينَ وَ قَالَ هَذَا الْحَسَنُ بْنُ عَلِيِّ بْنِ مُحَمَّدِ بْنِ الرِّضَا مَاتَ حَتْفَ أَنْفِهِ عَلَى فِرَاشِهِ",
          "حَضَرَهُ مَنْ حَضَرَهُ مِنْ خَدَمِ أَمِيرِ الْمُؤْمِنِينَ وَ ثِقَاتِهِ فُلَانٌ وَ فُلَانٌ وَ مِنَ الْقُضَاةِ فُلَانٌ وَ فُلَانٌ وَ مِنَ الْمُتَطَبِّبِينَ فُلَانٌ وَ فُلَانٌ ثُمَّ غَطَّى وَجْهَهُ وَ أَمَرَ بِحَمْلِهِ فَحُمِلَ مِنْ وَسَطِ دَارِهِ وَ دُفِنَ فِي الْبَيْتِ الَّذِي دُفِنَ فِيهِ أَبُوهُ ",
          "فَلَمَّا دُفِنَ أَخَذَ السُّلْطَانُ وَ النَّاسُ فِي طَلَبِ وَلَدِهِ وَ كَثُرَ التَّفْتِيشُ فِي الْمَنَازِلِ وَ الدُّورِ وَ تَوَقَّفُوا عَنْ قِسْمَةِ مِيرَاثِهِ وَ لَمْ يَزَلِ الَّذِينَ وُكِّلُوا بِحِفْظِ الْجَارِيَةِ الَّتِي تُوُهِّمَ عَلَيْهَا الْحَمْلُ لَازِمِينَ حَتَّى تَبَيَّنَ بُطْلَانُ الْحَمْلِ فَلَمَّا بَطَلَ الْحَمْلُ عَنْهُنَّ قُسِمَ مِيرَاثُهُ بَيْنَ أُمِّهِ وَ أَخِيهِ جَعْفَرٍ وَ ادَّعَتْ أُمُّهُ وَصِيَّتَهُ وَ ثَبَتَ ذَلِكَ عِنْدَ الْقَاضِي وَ السُّلْطَانُ عَلَى ذَلِكَ يَطْلُبُ أَثَرَ وَلَدِهِ ",
          "فَجَاءَ جَعْفَرٌ بَعْدَ ذَلِكَ إِلَى أَبِي فَقَالَ اجْعَلْ لِي مَرْتَبَةَ أَخِي وَ أُوصِلَ إِلَيْكَ فِي كُلِّ سَنَةٍ عِشْرِينَ أَلْفَ دِينَارٍ فَزَبَرَهُ أَبِي وَ أَسْمَعَهُ وَ قَالَ لَهُ يَا أَحْمَقُ السُّلْطَانُ جَرَّدَ سَيْفَهُ فِي الَّذِينَ زَعَمُوا أَنَّ أَبَاكَ وَ أَخَاكَ أَئِمَّةٌ لِيَرُدَّهُمْ عَنْ ذَلِكَ فَلَمْ يَتَهَيَّأْ لَهُ ذَلِكَ فَإِنْ كُنْتَ عِنْدَ شِيعَةِ أَبِيكَ أَوْ أَخِيكَ إِمَاماً فَلَا حَاجَةَ بِكَ إِلَى السُّلْطَانِ أَنْ يُرَتِّبَكَ مَرَاتِبَهُمَا وَ لَا غَيْرِ السُّلْطَانِ وَ إِنْ لَمْ تَكُنْ عِنْدَهُمْ بِهَذِهِ الْمَنْزِلَةِ لَمْ تَنَلْهَا بِنَا",
          "وَ اسْتَقَلَّهُ أَبِي عِنْدَ ذَلِكَ وَ اسْتَضْعَفَهُ وَ أَمَرَ أَنْ يُحْجَبَ عَنْهُ فَلَمْ يَأْذَنْ لَهُ فِي الدُّخُولِ عَلَيْهِ حَتَّى مَاتَ أَبِي وَ خَرَجْنَا وَ هُوَ عَلَى تِلْكَ الْحَالِ وَ السُّلْطَانُ يَطْلُبُ أَثَرَ وَلَدِ الْحَسَنِ بْنِ عَلِيٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary and Muhammad Bin yahya and some others who said, ",
            "‘It was so that Ahmad Bin Ubeydullah Bin Khaqan was in charge of the estates and the taxes at Qumm, and one day the discussion flowed in this gathering of the Alawites and their doctrines, and he used to be intensely hostile (Nasibi). So he said, ‘I have not seen nor do I recognise in Surmanrayy (Samarrah) a man from the Alawites the like of Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup> Bin Al-Reza<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>, regarding his<sup>asws</sup> Guidance, and his<sup>asws</sup> tranquillity, and his<sup>asws</sup> piety, and his<sup>asws</sup> nobility, and his<sup>asws</sup> benevolence in the presence of his<sup>asws</sup> family and the Clan of Hashim<sup>as</sup>, and their preferring him<sup>asws</sup> upon the ones with age from them, and the officials, and similar to that, the leaders, and the ministers and the generality of the people’. ",
            "So, one day I was standing by the head of my father, and it was the day of his (Khaqan’s) gathering to the people, when his guards came over to him and they said, ‘Abu Muhammad<sup>asws</sup> Bin Al-Reza<sup>asws</sup> is at the door. So he said at the top of this voice, ‘There is permission for him<sup>asws</sup>!’ So I was astounded from what I had heard from them. They had been audacious to teknonym a man upon my father in his presence, and it did not happen in his presence except for a Caliph or a crown prince, or the one for whom the Sultan would have ordered that he be teknonymed. ",
            "So there entered a brown man of good stature, beautiful of face, good of the body (physically), young of age. For him<sup>asws</sup> was majesty and awe. So when my father looked at him, he stood up to walk towards him barefooted, and I had not known him do this with anyone from the Clan of Hashim<sup>as</sup> and the leaders. So when he went near him<sup>asws</sup>, he hugged him<sup>asws</sup> and kissed his<sup>asws</sup> face and his<sup>asws</sup> chest, and grabbed his<sup>asws</sup> hand and seated him<sup>asws</sup> upon his Prayer mat which he had been seated upon, and he sat by his side, facing towards him<sup>asws</sup>, and went on to speak to him<sup>asws</sup>, and ransoming himself. ",
            "And I was astonished from what I saw from him. When the guard entered and said, ‘Al-Mowaffaq has come’, and it was so that Al-Mowaffaq, whenever he came over to my father, his guards and his officials would precede him, and they would be sitting between my father’s seat and the door of the house of Simatayn until he would enter and exit. But my father did not cease to face Abu Muhammad<sup>asws</sup> discussing with him<sup>asws</sup> until he looked at the special attendants, so he said, ‘Then, whenever you<sup>asws</sup> so desire to (leave), may Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>!’",
            "Then he said to his guards, ‘Go with him<sup>asws</sup> behind Al-Simateyn until this one, meaning Al-Mowaffaq, does not see him<sup>asws</sup>. So he<sup>asws</sup> stood and my father stood and hugged him<sup>asws</sup>, and he<sup>asws</sup> went away. So I said to the guards of my father and his attendants, ‘Woe unto you all! Who is this one whom you teknonymed upon my father and my father did with him<sup>asws</sup> this deed?’ So they said, ‘This is an Alawite called Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>, well knowns as the son<sup>asws</sup> of Al-Reza<sup>asws</sup>. So it increased my astonishment and it did not cease during that day of mine being uneasy, thinking regarding his<sup>asws</sup> affair and the affair of my father and what I saw with regards to it until it was the night, and it was his habit that he used to pray the Isha <span class=\"iTxt\">Salat</span>, then he would sit looking into what would be needy to from the matter (of the state) and what (matters) he would be raising to the Sultan. ",
            "So when he had prayed <span class=\"iTxt\">Salat</span> and was seated, I went over and sat in front of him, and there wasn’t anyone (else) in his presence. So he said to me, ‘O Ahmad! For you there is a need?’ I said, ‘Yes, O father, so if you would allow me, I shall ask you about it’. So he said, ‘I have permitted to you, O my son, so say whatever you like’. I said, ‘O father! Who was that man whom I saw in the morning? You dealt with him<sup>asws</sup> what you dealt with from the majesty, and the prestige, and the reverence, and you were ransoming yourself and your parents’. ",
            "So he said, ‘O my son! That is the Imam<sup>asws</sup> of the Rafiziites (rejecters). That is Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>, well known as the son<sup>asws</sup> of Al-Reza<sup>asws</sup>’. So he was silent for a while, then he said, ‘O my son! If the leadership were to decline from the Caliphs of the Clan of Abbas, no one from the Clan of Hashim<sup>as</sup> would be rightful for it apart from this one, and that this one is rightful for it due to his<sup>asws</sup> merits, and his<sup>asws</sup> chastity, and his<sup>asws</sup> Guidance, and his<sup>asws</sup> infallibility, and his<sup>asws</sup> ascetism, and his<sup>asws</sup> worship, and the beauty of his<sup>asws</sup> morals, and his<sup>asws</sup> correctness. And had you seen his<sup>asws</sup> father<sup>asws</sup>, you would have seen a man intelligent, noble, meritorious’. ",
            "So it increased my uneasiness, and thinking, and rage upon my father and what I heard from him, and he had increased in his deed and his words with regards to him<sup>asws</sup>, what he said. So there did not happen to be any mettle for me after that except the asking about his<sup>asws</sup> news and the discussion about his<sup>asws</sup> matter. So I did not ask anyone from the Clan of Hashim<sup>as</sup>, and leaders, and the scribes, and the judges, and the jurists and the rest of the people except that I found him<sup>asws</sup> in his presence to be at the peak of the majesty and the magnificence, and the lofty position, and the beautiful words, and the preference for him unto the entirety of his<sup>asws</sup> family, and his<sup>asws</sup> elders. So that magnified his<sup>asws</sup> worth in my presence when I did not see a friend of his<sup>asws</sup> nor an enemy except he would good with the words regarding him<sup>asws</sup>, and the praises upon him<sup>asws</sup>.",
            "So one of those who were present in his (my father’s) gathering, from the Ashariites asked him, ‘O Abu Bakr! So what is the news of his<sup>asws</sup> brother Ja’far?’ So he said, ‘And who is Ja’far, that you are asking of his news? O are you supporting Al-Hassan<sup>asws</sup>, or Ja’far the accursed, the transgressor, the immoral, an addict of drinking the wine, the lowest of the ones I have seen from the men, and the disgraceful to himself, a light and less with regards to himself?",
            "And there had been referred upon the Sultan and his companions during the time of the passing away of Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> what I was astounded from, and I did not think it would be happening, and that is that when he<sup>asws</sup> fell ill, he sent a message to my father that the son<sup>asws</sup> of Al-Reza<sup>asws</sup> has fallen ill. So he rode immediately and went to the house of the Caliphate. Then he returned in a jury and with him were five from the attendants of the commander of the faithful, all of them being from his reliable ones and his special ones, among them being Niheyr. ",
            "So he (my father) ordered them with staying at the door of Al-Hassan<sup>asws</sup> and get to know his<sup>asws</sup> news and his<sup>asws</sup> state. And he sent a message to a number of the physicians and ordered them with the coming and going to him<sup>asws</sup>, and to see him<sup>asws</sup> morning and evening. So when it was after that by two days or three, he was informed that he<sup>asws</sup> had weakened. So he ordered the physicians with the staying at his<sup>asws</sup> house, and sent a message to the Chief Justice to be present in his gathering and ordered him that he chooses ten from his companions, from the one he could rely with regards to his religion, and his entrustments, and his piety. So he presented them and sent them to the door of Al-Hassan<sup>asws</sup> and instructed them of staying there day and night. ",
            "So they did not cease to be over these until he<sup>asws</sup> passed away. So Surmanrayy (Samarrah) became one sensation, and the Sultan sent to his<sup>asws</sup> house the one who would investigate him<sup>asws</sup> and investigate his<sup>asws</sup> chambers, and he<sup>asws</sup> sealed off upon the entirety of whatever was in it, and they sought the traces of his<sup>asws</sup> son<sup>asws</sup> (12<sup>th</sup> Imam<sup>asws</sup>), and they came with women for them to recognise any pregnancy (that may be). So these women went over to his<sup>asws</sup> maids looking at them, and one of them mentioned that over there is a maid who could be expecting. So she was made to be in a room and Niheyr the servant and his companions were allocated with her, and the women were with them.",
            "Then after that, they took to the preparation (for his<sup>asws</sup> funeral), and the markets were closed, and the Clan of Hashim<sup>as</sup>, and the officials, and my father, and the rest of the people rode to his<sup>asws</sup> funeral. So it was as if Surmanrayy (Samarrah) in that day resembled the day of Judgment. So when they were free from his<sup>asws</sup> preparation, the Sultan sent a message to Abu Isa Bin Al-Mutawakil and ordered him with the (leading of the) <span class=\"iTxt\">Salat</span> upon him<sup>asws</sup>. ",
            "So when the body was placed for the <span class=\"iTxt\">Salat</span> to be prayed upon him<sup>asws</sup>, Abu Isa approached it, and he uncovered from his<sup>asws</sup> face and he displayed it to the Clan of Hashim<sup>as</sup>, from the Alawites and the Abbasides, and the officials, and the scribes, and the judges, and the juries and said, ‘This is Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup> Bin Al-Reza<sup>asws</sup>! He<sup>asws</sup> passed away a natural death upon his<sup>asws</sup> bed’. ",
            "He attended it, the one who attended it, from the servants of the commander of the faithful, and his trusted ones were so and so, and so and so, and from the judges were so and so and so and so, and from the physicians were so and so and so and so. Then he covered his<sup>asws</sup> face and instructed with him<sup>asws</sup> to be carried from the middle of his<sup>asws</sup> house and to be buried in the room in which his<sup>asws</sup> father<sup>asws</sup> was buried in.",
            "So when he<sup>asws</sup> was buried, the Sultan and the people took to seeking his<sup>asws</sup> son<sup>asws</sup> (12<sup>th</sup> Imam<sup>asws</sup>), and there was a lot of investigation in the houses and the rooms, and there was a stop to the distribution of his<sup>asws</sup> inheritance, and those who had been allocated with the protection of the (pregnant) slave girl did not cease to be suspicious upon her of the pregnancy, staying with her until it became clear that the claim of the pregnancy was invalid about her. His<sup>asws</sup> inheritance was distributed between his<sup>asws</sup> mother, and his<sup>asws</sup> brother Ja’far<sup>asws</sup>. And his<sup>asws</sup> mother claimed to be his<sup>asws</sup> executor of the will, and that was affirmed in the presence of the judge, and the Sultan, on top of that, sought the traces of his<sup>asws</sup> son<sup>asws</sup> (12<sup>th</sup> Imam<sup>asws</sup>).",
            "So Ja’far came over after that to my father and he said, ‘Make for me the status of my brother<sup>asws</sup> to be for me, and I shall send to you twenty thousand Dinars every year. But my father rebuked him and made him hear (harsh words) and said to him, ‘O idiot! The Sultan has bared his sword regarding those who are claiming that your father<sup>asws</sup> and your brother<sup>asws</sup> are Imams<sup>asws</sup>, in order to return them from that, so why are you preparing that for him? So if you were an Imam<sup>asws</sup> in the presence of the Shias of your father<sup>asws</sup> and your brother<sup>asws</sup>, then there would be no need for you to the Sultan that he should give you their<sup>asws</sup> status, nor for anyone other than the Sultan (to do so), and if you do not happen to be an Imam<sup>asws</sup> in their<sup>asws</sup> presence with this status, why would you need it with us?’ ",
            "And my father belittled him during that and weakened him and ordered that he be blocked from him. So he was not allowed to come over to him until my father died, and we went out and he was upon that state, and the Sultan was (still) seeking the traces of the son<sup>asws</sup> of Al-Hassan Bin Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " Abu Muhammad al-Hassan ibn Ali (a.s.) was born in the month of Ramadan (in an other copy it is in ‘the month of Rabi‘ al-Awwal) in the year two hundred thirty two. He died on a Friday on the eighth of the month of Rabi‘ al-Awwal in the year two hundred sixty at the age of twenty eight. He was buried in the house where his father was buried in the city of Surra man Ra‘a (Samarra).her was ’Umm Walad, called Hudayth (or Sawsan)."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف بأحمد    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/138)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/57)"
        ],
        "index": 1324,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:2",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ بْنِ مُوسَى بْنِ جَعْفَرٍ قَالَ كَتَبَ أَبُو مُحَمَّدٍ ( عليه السلام ) إِلَى أَبِي الْقَاسِمِ إِسْحَاقَ بْنِ جَعْفَرٍ الزُّبَيْرِيِّ قَبْلَ مَوْتِ الْمُعْتَزِّ بِنَحْوِ عِشْرِينَ يَوْماً الْزَمْ بَيْتَكَ حَتَّى يَحْدُثَ الْحَادِثُ فَلَمَّا قُتِلَ بُرَيْحَةُ كَتَبَ إِلَيْهِ قَدْ حَدَثَ الْحَادِثُ فَمَا تَأْمُرُنِي فَكَتَبَ لَيْسَ هَذَا الْحَادِثَ هُوَ الْحَادِثُ الْآخَرُ فَكَانَ مِنْ أَمْرِ الْمُعْتَزِّ مَا كَانَ ",
          "وَ عَنْهُ قَالَ كَتَبَ إِلَى رَجُلٍ آخَرَ يُقْتَلُ ابْنُ مُحَمَّدِ بْنِ دَاوُدَ عَبْدُ اللَّهِ قَبْلَ قَتْلِهِ بِعَشَرَةِ أَيَّامٍ فَلَمَّا كَانَ فِي الْيَوْمِ الْعَاشِرِ قُتِلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Ismail Bin Ibrahim Bin Musa Bin Ja’far who said, ",
            "Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) wrote to my father Al-Qasim Is’haq Bin Ja’far Al-Zubeyri before the death of Al-Mu’taz (the Caliph) by approximately twenty days: ‘Stay in your house until the event occurs’. So when Bureyha was killed, he wrote to him<sup>asws</sup>: ‘The event has occurred, so what are you<sup>asws</sup> ordering me with?’ So he<sup>asws</sup> wrote: ‘This is not the event. It is another event’. So when it was from the matter of Al-Mu’taz what was’.",
            "And from him who said, ‘He<sup>asws</sup> wrote to another man: ‘He would be killed, Ibn Muhammad Bin Dawood Abdullah’, ten days before he was killed. So when it was the tenth day, he was killed’."
          ],
          "en.sarwar": [
            " Thereafter, there was nothing more important to me than to ask more about him and investigate his affairs. Whoever of the members of Hashite clan or the guards, the clerks, the judges, the scholars of the law (Fuqha’) and other people that I would ask I would find him being glorified, mentioned with greatness and high position. I would hear very beautiful words about him and see him given preference over all members of Hashimite clan, their elders. The feeling of greatness for him increased in my heart because I would not find anyone of his friends or foe that would not speak good of him and praise him.” A certain person from the al-Asha‘ari beliefs present asked him, “What is the news about his brother, Ja‘far, O abu Bakr?” He said, “Who is Ja‘far that you would ask about him or compare him with al-Hassan (a.s.). Ja‘far was an evil doer in public, polluted with sins, an addict drukered, the lowest of all man and the most humiliating of his own self among men. He was worthless and little to his own self. What happened durinng the time of the death of al-Hassan ibn Ali to the Sultan and his people astonished me and I did not think such thing can happen. When became ill. My father was informed that ibn al-Rida has become ill. He immediately rode to reach the capital of the Caliphate. He came back in hurry with five people of the servants of the Amir al-Mu’minin. They all were of his confidants and trustworthy ones among whom one was Nihriyr. He (my father) commanded them to stay close to the house of al-Hassan (a.s.) to learn about him and his conditions. He called a few physicians and commanded them to maintain contact with him and be around him mornings and evenings. After two or three days he was informed that he (the patient) is weakening. He commanded the physicians to remain around his house and sent for the chief judge who came in his presence. He then commanded the him (judge) to select ten persons from his most trust worthy in the matters of their religion, trust and restraint. They were called in his presence and he sent them to house of al-Hassan (a.s.). He commanded them to be there day and night and they were there until he (a.s.) passed away. The city of Surra man Ra‘a turned into one huge voice of weeping and lamentation. The Sultan sent people to search his house and search all the rooms therein and seal the contents thereof.. They searched for his son and called certain women with knowledge to deal with pregnancy. They examined his ladies. A certain woman had said that one of the ladies is pregnant. She was accommodated in a certain quarter and Nihrir, al-Khadim and his people and the women with him were ordered to stay guard around her. Thereafter they began to prepare for the burial. The markets were to remain closed. Members of the clan al-Hashim, the guards, my father and other people formed the burial procession. The city of Surra man Ra’a on that day had turned into a day similar to the Day of resurrection. When the body was readied for burial the Sultan sent message to abu ‘Isa ibn al-Mutawakkil and commanded him to lead the prayer. When the body was placed at the prayer area abu ‘Isa went close and uncovered his face. He then asked all members of al-Hashim clan of the ‘Aliwid and ‘Abbassid branch, the guards, the clerks, the judges and juries to bear witness that al-Hassan ibn Ali ibn Muhammad ibn al-Rida (a.s.) his died a natural death in his own bed. That this has taken place in the presence of the servants of Amir al-Mu’minin, his confidants, so and so persons of the judges and so and persons of the physicians. He (abu ‘Isa) then covered his face and ordered to pick up the body. The body was then picked up from the central area of the house and was buried in the room where his father was buried. After his burial the Sultan and people began to search for his son. The search was carried out extensively. All the houses and rooms were searched. The distribution of his legacy was suspended. The people appointed to guard one the ladies who was thought of as pregnant continued their task until it was found out that such thought was invalid. When pregnancy was proved invalid they distributed his legacy between his mother and brother, Ja‘far. His mother claimed to be the executor of his will and her claim was confirmed before the judge. The Sultan, even after searching so much for his son continued his search to find traces of his son. Thereafter, Ja‘far came to my father and asked, “Assign the position of my brother to me. I will pay you twenty thousand Dinars every year.” My father treated him harshly and rebuked him saying, “You are a fool. The Sultan puts to the sword whoever he just thinks is a Shi‘a, follower and supporter of your father and brother to stop them from holding such belief but he fails to achieve such goal. Had you been considered an Imam among the Shi‘a of your father and brother you would not need any help from the Sultan or others to give you such position as that of your father and brother. If you are not considered an Imam among the Shi‘a of your father and brother you will not have such position from us.” My father belittled him considered him weak and ordered his people to keep him away from his office. My father did not give him permission for a meeting as long as he lived. We left and he remained in the same condition. The Sultan still would search for the traces of the son of al-Hassan ibn Ali (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/148)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1325,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:3",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْمَعْرُوفِ بِابْنِ الْكُرْدِيِّ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ إِبْرَاهِيمَ بْنِ مُوسَى بْنِ جَعْفَرٍ قَالَ ضَاقَ بِنَا الْأَمْرُ فَقَالَ لِي أَبِي امْضِ بِنَا حَتَّى نَصِيرَ إِلَى هَذَا الرَّجُلِ يَعْنِي أَبَا مُحَمَّدٍ فَإِنَّهُ قَدْ وُصِفَ عَنْهُ سَمَاحَةٌ فَقُلْتُ تَعْرِفُهُ فَقَالَ مَا أَعْرِفُهُ وَ لَا رَأَيْتُهُ قَطُّ ",
          "قَالَ فَقَصَدْنَاهُ فَقَالَ لِي أَبِي وَ هُوَ فِي طَرِيقِهِ مَا أَحْوَجَنَا إِلَى أَنْ يَأْمُرَ لَنَا بِخَمْسِمِائَةِ دِرْهَمٍ مِائَتَا دِرْهَمٍ لِلْكِسْوَةِ وَ مِائَتَا دِرْهَمٍ لِلدَّيْنِ وَ مِائَةٌ لِلنَّفَقَةِ فَقُلْتُ فِي نَفْسِي لَيْتَهُ أَمَرَ لِي بِثَلَاثِمِائَةِ دِرْهَمٍ مِائَةٌ أَشْتَرِي بِهَا حِمَاراً وَ مِائَةٌ لِلنَّفَقَةِ وَ مِائَةٌ لِلْكِسْوَةِ وَ أَخْرُجَ إِلَى الْجَبَلِ",
          "قَالَ فَلَمَّا وَافَيْنَا الْبَابَ خَرَجَ إِلَيْنَا غُلَامُهُ فَقَالَ يَدْخُلُ عَلِيُّ بْنُ إِبْرَاهِيمَ وَ مُحَمَّدٌ ابْنُهُ فَلَمَّا دَخَلْنَا عَلَيْهِ وَ سَلَّمْنَا قَالَ لِأَبِي يَا عَلِيُّ مَا خَلَّفَكَ عَنَّا إِلَى هَذَا الْوَقْتِ فَقَالَ يَا سَيِّدِي اسْتَحْيَيْتُ أَنْ أَلْقَاكَ عَلَى هَذِهِ الْحَالِ ",
          "فَلَمَّا خَرَجْنَا مِنْ عِنْدِهِ جَاءَنَا غُلَامُهُ فَنَاوَلَ أَبِي صُرَّةً فَقَالَ هَذِهِ خَمْسُمِائَةِ دِرْهَمٍ مِائَتَانِ لِلْكِسْوَةِ وَ مِائَتَانِ لِلدَّيْنِ وَ مِائَةٌ لِلنَّفَقَةِ وَ أَعْطَانِي صُرَّةً فَقَالَ هَذِهِ ثَلَاثُمِائَةِ دِرْهَمٍ اجْعَلْ مِائَةً فِي ثَمَنِ حِمَارٍ وَ مِائَةً لِلْكِسْوَةِ وَ مِائَةً لِلنَّفَقَةِ وَ لَا تَخْرُجْ إِلَى الْجَبَلِ وَ صِرْ إِلَى سُورَاءَ ",
          "فَصَارَ إِلَى سُورَاءَ وَ تَزَوَّجَ بِامْرَأَةٍ فَدَخْلُهُ الْيَوْمَ أَلْفُ دِينَارٍ وَ مَعَ هَذَا يَقُولُ بِالْوَقْفِ فَقَالَ مُحَمَّدُ بْنُ إِبْرَاهِيمَ فَقُلْتُ لَهُ وَيْحَكَ أَ تُرِيدُ أَمْراً أَبْيَنَ مِنْ هَذَا قَالَ فَقَالَ هَذَا أَمْرٌ قَدْ جَرَيْنَا عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Ibrahim well known as Ibn Kurdy, from Muhammad Bin Ali Bin Ibrahim Bin Musa Bin Ja’far who said, ",
            "‘The matter was constricted with us (financially), so my father said to me, ‘Come with us until we come to be to this man, meanin Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) for he<sup>asws</sup> has been described to have leniency for him<sup>asws</sup>’. So I said, ‘Do you know him<sup>asws</sup>?’ So he said, ‘I do not know him<sup>asws</sup> nor have I seen him<sup>asws</sup> at all!’. ",
            "He (the narrator) said, ‘So we went out intending him<sup>asws</sup>, and my father said to me, and he was in his road, ‘How needy we are to that he<sup>asws</sup> would instruct for us with five hundred Dirham, two hundred for the clothes and two hundred for the debts, and a hundred for the expenses’. So I said within myself, ‘If only he<sup>asws</sup> would order for me with three hundred Dirham, one hundred to buy a donkey with, and one hundred for the expenses, and one hundred for the clothes, and I shall go out to the mountain’. ",
            "He (the narrator) said, ‘So when we arrived at the door, his<sup>asws</sup> slave came out to us and he said, ‘Enter, Ali Bin Ibrahim and Muhammad his son!’. So when entered to see him<sup>asws</sup> and we had greeted, he<sup>asws</sup> said to my father, ‘O Ali! What made you remain behind from us<sup>asws</sup> until this time?’ So he said, ‘My Master<sup>asws</sup>! I was too embarrassed to meet you<sup>asws</sup> while being upon this state’. ",
            "So when we exited from his<sup>asws</sup> presence, his<sup>asws</sup> slave came over to us and gave my father a package, and he said, ‘These are five hundred Dirhams, two hundred being for the clothing, and two hundred being for the debts, and one hundred being for the expenses’. And he gave me a package and he said, ‘These are three hundred Dirhams. Make a hundred to be regarding the price of a donkey, and one hundred for the clothes, and one hundred for the expenses. And do not go out to the mountain, and go to Sowra’a’. ",
            "So he went to Sowra’a and married a woman. So today his income is a thousand Dinars, and despite this he is saying with the pausing (holding Waqifiite beliefs). Muhammad Bin Ibrahim says: ‘So I said to him, ‘Woe be unto you! Are you wanting a matter clearer than this?’ He said, ‘To this matter (Waqifite beliefs) we have got used to (and are unable to revert due to being well settle therein)’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Muhammad has narrated from Muhammad ibn ’Isma‘il ibn Ibrahim ibn Musa ibn Ja‘far (a.s.) who has said the following. “Once abu Muhammad (a.s.) wrote to abu al-Qasim Ishaq ibn Ja‘far al-Zubayri before the death of al-Mu‘tazz by about twenty days as herein below. ‘Stay home until what is to happen will happen.’ When Burayha was killed he wrote to him, “A happening has happened. What would you command me to do?” He wrote back, “This is not the happening. It is another happening.” Then there was the case of al-Mu‘tazz the way it was.” It is narrated from the same narrator that the Imam (a.s.) wrote to another person. “Muhammad ibn Dawud ibn ‘Abdallah will be killed.” It was ten days before his murder. On the tenth day he was killed.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (149/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1326,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:4",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَبِي عَلِيٍّ مُحَمَّدِ بْنِ عَلِيِّ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنِي أَحْمَدُ بْنُ الْحَارِثِ الْقَزْوِينِيُّ قَالَ كُنْتُ مَعَ أَبِي بِسُرَّ مَنْ رَأَى وَ كَانَ أَبِي يَتَعَاطَى الْبَيْطَرَةَ فِي مَرْبِطِ أَبِي مُحَمَّدٍ قَالَ وَ كَانَ عِنْدَ الْمُسْتَعِينِ بَغْلٌ لَمْ يُرَ مِثْلُهُ حُسْناً وَ كِبْراً وَ كَانَ يَمْنَعُ ظَهْرَهُ وَ اللِّجَامَ وَ السَّرْجَ وَ قَدْ كَانَ جَمَعَ عَلَيْهِ الرَّاضَةَ فَلَمْ يُمَكِّنْ لَهُمْ حِيلَةً فِي رُكُوبِهِ ",
          "قَالَ فَقَالَ لَهُ بَعْضُ نُدَمَائِهِ يَا أَمِيرَ الْمُؤْمِنِينَ أَ لَا تَبْعَثُ إِلَى الْحَسَنِ ابْنِ الرِّضَا حَتَّى يَجِي‏ءَ فَإِمَّا أَنْ يَرْكَبَهُ وَ إِمَّا أَنْ يَقْتُلَهُ فَتَسْتَرِيحَ مِنْهُ",
          "قَالَ فَبَعَثَ إِلَى أَبِي مُحَمَّدٍ وَ مَضَى مَعَهُ أَبِي فَقَالَ أَبِي لَمَّا دَخَلَ أَبُو مُحَمَّدٍ الدَّارَ كُنْتُ مَعَهُ فَنَظَرَ أَبُو مُحَمَّدٍ إِلَى الْبَغْلِ وَاقِفاً فِي صَحْنِ الدَّارِ فَعَدَلَ إِلَيْهِ فَوَضَعَ بِيَدِهِ عَلَى كَفَلِهِ قَالَ فَنَظَرْتُ إِلَى الْبَغْلِ وَ قَدْ عَرِقَ حَتَّى سَالَ الْعَرَقُ مِنْهُ ثُمَّ صَارَ إِلَى الْمُسْتَعِينِ فَسَلَّمَ عَلَيْهِ فَرَحَّبَ بِهِ وَ قَرَّبَ فَقَالَ يَا أَبَا مُحَمَّدٍ أَلْجِمْ هَذَا الْبَغْلَ فَقَالَ أَبُو مُحَمَّدٍ لِأَبِي أَلْجِمْهُ يَا غُلَامُ فَقَالَ الْمُسْتَعِينُ أَلْجِمْهُ أَنْتَ فَوَضَعَ طَيْلَسَانَهُ ثُمَّ قَامَ فَأَلْجَمَهُ ثُمَّ رَجَعَ إِلَى مَجْلِسِهِ وَ قَعَدَ",
          "فَقَالَ لَهُ يَا أَبَا مُحَمَّدٍ أَسْرِجْهُ فَقَالَ لِأَبِي يَا غُلَامُ أَسْرِجْهُ فَقَالَ أَسْرِجْهُ أَنْتَ فَقَامَ ثَانِيَةً فَأَسْرَجَهُ وَ رَجَعَ فَقَالَ لَهُ تَرَى أَنْ تَرْكَبَهُ فَقَالَ نَعَمْ فَرَكِبَهُ مِنْ غَيْرِ أَنْ يَمْتَنِعَ عَلَيْهِ ثُمَّ رَكَضَهُ فِي الدَّارِ ثُمَّ حَمَلَهُ عَلَى الْهَمْلَجَةِ فَمَشَى أَحْسَنَ مَشْيٍ يَكُونُ ثُمَّ رَجَعَ وَ نَزَلَ ",
          "فَقَالَ لَهُ الْمُسْتَعِينُ يَا أَبَا مُحَمَّدٍ كَيْفَ رَأَيْتَهُ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ مَا رَأَيْتُ مِثْلَهُ حُسْناً وَ فَرَاهَةً وَ مَا يَصْلُحُ أَنْ يَكُونَ مِثْلُهُ إِلَّا لِأَمِيرِ الْمُؤْمِنِينَ قَالَ فَقَالَ يَا أَبَا مُحَمَّدٍ فَإِنَّ أَمِيرَ الْمُؤْمِنِينَ قَدْ حَمَلَكَ عَلَيْهِ فَقَالَ أَبُو مُحَمَّدٍ لِأَبِي يَا غُلَامُ خُذْهُ فَأَخَذَهُ أَبِي فَقَادَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abu Ali Muhammad Bin Ali Bin Ibrahim who said, ‘Ahmad Bin Al Haris Al Qazwiny narrated to me saying, ",
            "‘I was with my father at Surmanrayy (Samarrah), and my father was a vet in the stables of Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>). And it was so that with Al-Mustain (Caliph) was a mule the likes of which has not been seen regarding beauty, and age, and it used to forbid its back (for riding), and the reining, and the saddling. And the trainers had gathered upon it but it did not enable a way to them with regards to riding it.",
            "He (the narrator) said, ‘So one of his close aides said to him, ‘O commander of the faithful! Why don’t you send for Al-Hassan<sup>asws</sup>, the son<sup>asws</sup> of Al-Reza<sup>asws</sup> until he<sup>asws</sup> comes over, so either he<sup>asws</sup> would (be able to) ride it or it would kill him<sup>asws</sup>, so you would be at rest from him<sup>asws</sup>’. ",
            "He (the narrator) said, ‘So he sent for Abu Muhammad<sup>asws</sup>, and my father went with him<sup>asws</sup>. So my father said, ‘When Abu Muhammad<sup>asws</sup> entered the house, I was with him<sup>asws</sup>, and Abu Muhammad<sup>asws</sup> looked at the mule paused in the courtyard of the house, and he<sup>asws</sup> went to it and placed his<sup>asws</sup> hand upon its back. So I looked at the mule and it had perspired, to the extent that its perspiration was flowing from it. Then he<sup>asws</sup> came to Al-Mu’tasim, so he greeted upon him<sup>asws</sup> and welcomed him<sup>asws</sup> and sat him<sup>asws</sup> close by, and he said, ‘O Abu Muhammad<sup>asws</sup>! Harness this mule’. So Abu Muhammad<sup>asws</sup> said to my father, ‘Harness it, O boy!’. So Al-Mu’tasim said, ‘You<sup>asws</sup> harness it’. So he<sup>asws</sup> dropped his<sup>asws</sup> pallium, then he<sup>asws</sup> stood up and harnessed, then returned to his<sup>asws</sup> seat and sat down.",
            "So he said to him<sup>asws</sup>, ‘O Abu Muhammad<sup>asws</sup>! Saddle it’. So he<sup>asws</sup> said to my father: ‘O boy, saddle it!’ So he said, ‘You<sup>asws</sup> saddle it’. So he<sup>asws</sup> stood up for the second time and saddle it, and returned. So he said, ‘Do you<sup>asws</sup> view that you<sup>asws</sup> can ride it?’ So he<sup>asws</sup> said: ‘Yes’. So he<sup>asws</sup> rode it from without it preventing upon him<sup>asws</sup>. Then he<sup>asws</sup> ran it in the house, then he<sup>asws</sup> spurred it upon encouragement, so it walked with as excellently as could happen to be. Then he<sup>asws</sup> returned and desended.",
            "So Al-Mu’tasim said to him<sup>asws</sup>, ‘O Abu Muhammad<sup>asws</sup>! How did you<sup>asws</sup> see it?’ He<sup>asws</sup> said, ‘O commander of the faithful! I<sup>asws</sup> have not seen as excellent as it in beauty and agility, and it is not correct that the like of it should be with anyone except for the commander of the faithful’. So he said, ‘O Abu Muhammad<sup>asws</sup>! Supposing the commander of the faithful has burdens you<sup>asws</sup> upon it?’ So Abu Muhammad<sup>asws</sup> said to my father: ‘O boy! Take it’. So my father took it and led it away’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Muhammad has narrated from Muhammad ibn Ibrahim, known as ibn al-Kurdiy, from Muhammad ibn Ali ibn Ibrahim ibn Musa ibn Ja‘far (a.s.) who has said the following. “We were under pressure and constraint. My father said, “Let us go to abu Muhammad (a.s.). People describe him as very generous and considerate.” I asked, “Do you know him?” He said, “No, I do not know him and I have not seen him before.” We decided to go and meet him. My father said on the way, “I wish he would grant us five hundred Dirhams. Two hundred for clothes, two hundred for to pay the debts and two hundred for expenses. We need this much very badly.” I then said to myself, “I wish he will grant me three hundred Dirhams, one hundred to buy a donkey, one hundred for expenses and one hundred for clothes to go to the mountains.” The narrator has said that when we arrived at the door a slave came out and said, “Ali ibn Ibrahim and his son Muhammad come inside.” When we were in his (the Imam’s (a.s.) presence we offered the greeting of peace and said to my father. “O Ali, what held you back from coming to us until now?” He said, “My master, I felt shy to come to you in this condition.” When we left him his slave came to us and gave a bag of money to my father saying, “This is five hundred Dirhams, two hundred for clothes, two hundred to pay debts and two hundred for expenses.” He gave me a bag and said, “This is three hundred Dirhams, one hundred for the donkey, one hundred for clothes and one hundred for expenses. Do not go to the mountains. Go to Sawra’. He then went to Sawra’ and marriage a woman and now his income from properties is a thousand Dinar despite this he belongs to the waqifi sect in matters of beliefs. Muhammad ibn Ibrahim has said that I said to him, “Woe is you! What more clear proof do you want to believe in him as your Imam?” He said, “This (belief in Waqifi sect) is habit that has been with us (and it ddoes not go away).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/150)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1327,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:5",
        "text": [
          "عَلِيٌّ عَنْ أَبِي أَحْمَدَ بْنِ رَاشِدٍ عَنْ أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ شَكَوْتُ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) الْحَاجَةَ فَحَكَّ بِسَوْطِهِ الْأَرْضَ قَالَ وَ أَحْسَبُهُ غَطَّاهُ بِمِنْدِيلٍ وَ أَخْرَجَ خَمْسَمِائَةِ دِينَارٍ فَقَالَ يَا أَبَا هَاشِمٍ خُذْ وَ أَعْذِرْنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from Abu Ahmad Bin Rashid, from Abu Hashim Al Ja’fary who said, ",
            "‘I complained to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) of the need, so he<sup>asws</sup> struck the ground with his<sup>asws</sup> whip. And I reckon he<sup>asws</sup> covered it with a towel and extracted five hundred Dinars, and he<sup>asws</sup> said: ‘O Abu Hashim! Take, and excuse us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad has narrated from abu Ali Muhammad ibn Ali ibn Ibrahim who has said that narrated to me Ahmad ibn al-Harith al-Qazwini who has said the following. “I was with my father in the city of Surra man Ra‘a. My father was a veterinarian at the animal farm of abu Muhammad (a.s.). Al-Musta‘in had a mule the like of which in beauty and size has not been seen. No one could touch that mule to ride, saddle or harness. He had called all the trainers and they had faild to ready the mule for riding. Certain people close to him had said, “O Amir al-Mu’minin, “Why do you not ask al-Hassan, ibn al-Rida who would either ready it for riding or get killed in which case it will be a great relief for you?” The narrator has said that he sent for abu Muhammad, al-Hassan (a.s.) and my father went with him (a.s.) My father has said, “When abu Muhammad entered the room I was with him. Abu Muhammad looked at the mule that was standing in the compound of the facility. He went towards the mule and placed his hand over the rear of the mule. The narrator has said that I saw the mule perspire so much that it began to flow. Then he went to al-Musta‘in. He offered him greeting of peace and he well come him and asked him to sit just next to him and said, “O abu Muhammad, harness mule (that has become obstinate).” Abu Muhammad (a.s.) said to my father, “Young man harness the mule.” Al-Musta‘in said, “You must harness the mule. The Imam (a.s.) took off his gown and harnessed the mule and returned back to his place. Al-Musta‘in asked him to saddle the mule but he said to my father, “Young man, saddle the mule.” Al-Musta‘in asked him to himself saddle the mule. He stood again, saddled the mule and returned back to his place and said do you want that I ride it also?” He said, “Yes, please do so.” He rode the mule without any resistance. The mule ran in the facility and then he took the mule for a amble which the mule performed in the best way that can be. He came back and dismounted. Al-Musta‘in said to him, “O abu Muhammad, how was the mule?” he said, “O Amir al-Mu’minin, I had not seen like it before in beauty and skill. Only Amir al-Mu’minin deserves to have such a mule.” The narrator has said that Al-Musta‘in then said, “O abu Muhammad, Amir al-Mu’minin wants you to ride it” Abu Muhammad (a.s.) then said to my father, “O young man take the mule with you and he lead the mule away.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/152)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1328,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:6",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ بْنِ صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي عَلِيٍّ الْمُطَهَّرِ أَنَّهُ كَتَبَ إِلَيْهِ سَنَةَ الْقَادِسِيَّةِ يُعْلِمُهُ انْصِرَافَ النَّاسِ وَ أَنَّهُ يَخَافُ الْعَطَشَ فَكَتَبَ ( عليه السلام ) امْضُوا فَلَا خَوْفٌ عَلَيْكُمْ إِنْ شَاءَ اللَّهُ فَمَضَوْا سَالِمِينَ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abu Abdullah Bin Salih, from his father, from Abu Ali Al Mutahhir, ",
            "‘He wrote to him<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) in the year of Al-Qadisiyya to let him<sup>asws</sup> know of the leaving (not performing Hajj) of the people and that he feared the thirst (due to the drought). So he<sup>asws</sup> wrote: ‘Continue, and there would be no fear upon you, if Allah<sup>azwj</sup> so Desires’. So Suleyman continued (to Hajj), and the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’."
          ],
          "en.sarwar": [
            " 5. Ali has narrated from abu Ahmad ibn Rashid from abu Hashim al-Ja‘fari who has said the following. “I requested abu Muhammad for something that I needed. He scratched the earth with his whip. The narrator has said that I think he then covered it with a handkerchief and then took out five hundred Dinars. He then said, “O abu Hashim take it and grants us pardon.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (152/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1329,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:7",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ الْفَضْلِ الْيَمَانِيِّ قَالَ نَزَلَ بِالْجَعْفَرِيِّ مِنْ آلِ جَعْفَرٍ خَلْقٌ لَا قِبَلَ لَهُ بِهِمْ فَكَتَبَ إِلَى أَبِي مُحَمَّدٍ يَشْكُو ذَلِكَ فَكَتَبَ إِلَيْهِ تُكْفَوْنَ ذَلِكَ إِنْ شَاءَ اللَّهُ تَعَالَى فَخَرَجَ إِلَيْهِمْ فِي نَفَرٍ يَسِيرٍ وَ الْقَوْمُ يَزِيدُونَ عَلَى عِشْرِينَ أَلْفاً وَ هُوَ فِي أَقَلَّ مِنْ أَلْفٍ فَاسْتَبَاحَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ali Bin Al Hassan Bin Al Fazl Al Yamani who said, ",
            "‘A strong force of people came down upon Al-Ja’fary from the family of Ja’far, there being no (ability of) facing for him with them. So he wrote to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) complaining of that. So he<sup>asws</sup> wrote to him: ‘You would be sufficing (for) that, if Allah<sup>azwj</sup> so Desires’. So he went out against them among a small number (of defenders), and the people were (a force) more than twenty thousand strong, and he was among less than a thousand, and they destroyed them’."
          ],
          "en.sarwar": [
            " 6. Ali ibn Muhammad has narrated from abu ‘Abdallah ibn Salih from his father from abu Ali al-Mutahhar the following. “He wrote to him (abu Muhammad (a.s.) in the year of Qadisiyya, the year of draught that forced people to returned home without performing Hajj for fear of thirst. He wrote back in reply, “continue your journey and you will have no fear by the will of Allah.” They continued their journey to Hajj safely and thanks to Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/153)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1330,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:8",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ الْعَلَوِيِّ قَالَ حُبِسَ أَبُو مُحَمَّدٍ عِنْدَ عَلِيِّ بْنِ نَارْمَشَ وَ هُوَ أَنْصَبُ النَّاسِ وَ أَشَدُّهُمْ عَلَى آلِ أَبِي طَالِبٍ وَ قِيلَ لَهُ افْعَلْ بِهِ وَ افْعَلْ فَمَا أَقَامَ عِنْدَهُ إِلَّا يَوْماً حَتَّى وَضَعَ خَدَّيْهِ لَهُ وَ كَانَ لَا يَرْفَعُ بَصَرَهُ إِلَيْهِ إِجْلَالًا وَ إِعْظَاماً فَخَرَجَ مِنْ عِنْدِهِ وَ هُوَ أَحْسَنُ النَّاسِ بَصِيرَةً وَ أَحْسَنُهُمْ فِيهِ قَوْلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Ismail Al Alawy who said, ",
            "‘Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) was imprisoned with (the warden) Ali Bin Narmash, and he was the most hostile (Nasibi) of the people and the harshest of them upon the Progeny<sup>asws</sup> of Abu Talib<sup>as</sup><sup>ws</sup>, and it was said to him, ‘Deal with him<sup>asws</sup>, and he dealt with him<sup>asws</sup>. So he<sup>asws</sup> did not stay with him except for a day until he placed his cheek for him<sup>asws</sup> (in submission), and he did not used to raise his eyes to him<sup>asws</sup> out of respect and reverence. So he<sup>asws</sup> came out from him, and he was the best of the people of insight, and the best of them in speech regarding him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Muhammad has narrated from Ali ibn al-Hassan ibn al-Fadl al-Yamani who has said the following. “ Al-Ja‘fari from the family of Ja‘far was attacked by such a large number of people that seemed impossible for them to defend themselves. He wrote to abu Muhammad (a.s.) about his dangerous condition. He wrote back to him in reply, “You will be adequately defended by the will of Allah, the Most High. He came out with just a few people to defend themselves against the attackers who were in excess of twenty thousand while on his side there were fewer than a thousand but the attackers were all vanished.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/153)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1331,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:9",
        "relations": {
          "Mentions": [
            "/books/quran:9:16"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ النَّخَعِيِّ قَالَ حَدَّثَنِي سُفْيَانُ بْنُ مُحَمَّدٍ الضُّبَعِيُّ قَالَ كَتَبْتُ إِلَى أَبِي مُحَمَّدٍ أَسْأَلُهُ عَنِ الْوَلِيجَةِ وَ هُوَ قَوْلُ اللَّهِ تَعَالَى وَ لَمْ يَتَّخِذُوا مِنْ دُونِ اللَّهِ وَ لا رَسُولِهِ وَ لَا الْمُؤْمِنِينَ وَلِيجَةً قُلْتُ فِي نَفْسِي لَا فِي الْكِتَابِ مَنْ تَرَى الْمُؤْمِنِينَ هَاهُنَا فَرَجَعَ الْجَوَابُ الْوَلِيجَةُ الَّذِي يُقَامُ دُونَ وَلِيِّ الْأَمْرِ وَ حَدَّثَتْكَ نَفْسُكَ عَنِ الْمُؤْمِنِينَ مَنْ هُمْ فِي هَذَا الْمَوْضِعِ فَهُمُ الْأَئِمَّةُ الَّذِينَ يُؤْمِنُونَ عَلَى اللَّهِ فَيُجِيزُ أَمَانَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and Muhammad Bin Abu Abdullah, from Is’haq Bin Muhammad Al Makhai’e who said, ‘Sufyan Bin Muhammad Al Zubayyi narrated to me saying, ",
            "‘I wrote to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) asking him<sup>asws</sup> about the confidant, and these are the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h16\">[9:16]</a> and do not take to any one besides Allah and His Rasool and the Believers as a confidant</span>, and I said to myself, ‘It is not in the Book. Where can you see a Believer over here?’ So the answer came back: ‘The confidant – is the one who is in the place of a Guardian<sup>asws</sup>. And I<sup>asws</sup> narrate to you about the Believers who are in this position, so they<sup>asws</sup> are the Imams<sup>asws</sup> who are believing in Allah<sup>azwj</sup>, so He<sup>azwj</sup> Authorises their<sup>asws</sup> safety’."
          ],
          "en.sarwar": [
            " 8. Ali ibn Muhammad has narrated from Muhammad ibn ’Isma‘il al-‘Alawi who has said the following. “Abu Muhammad (a.s.) was imprisoned under the supervision of Ali ibn Narmasha who was extremely hostile towards the descendants of abu Talib. He was told to treat him (abu Muhammad (a.s.) as he (the guard) wished. He stayed with him only for day and the guard who was hostile towards him became so submissive before him that he would not even dare to look up into his face out of glorification and reverence. He (abu Muhammad (a.s.) came out from his prison and he (the guard) had turned into having the highest degree of understanding of him and would speak the best words about him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (154/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1332,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:10",
        "relations": {
          "Mentions": [
            "/books/quran:9:16"
          ]
        },
        "text": [
          "إِسْحَاقُ قَالَ حَدَّثَنِي أَبُو هَاشِمٍ الْجَعْفَرِيُّ قَالَ شَكَوْتُ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) ضِيقَ الْحَبْسِ وَ كَتَلَ الْقَيْدِ فَكَتَبَ إِلَيَّ أَنْتَ تُصَلِّي الْيَوْمَ الظُّهْرَ فِي مَنْزِلِكَ فَأُخْرِجْتُ فِي وَقْتِ الظُّهْرِ فَصَلَّيْتُ فِي مَنْزِلِي كَمَا قَالَ ( عليه السلام ) ",
          "وَ كُنْتُ مُضَيَّقاً فَأَرَدْتُ أَنْ أَطْلُبَ مِنْهُ دَنَانِيرَ فِي الْكِتَابِ فَاسْتَحْيَيْتُ فَلَمَّا صِرْتُ إِلَى مَنْزِلِي وَجَّهَ إِلَيَّ بِمِائَةِ دِينَارٍ وَ كَتَبَ إِلَيَّ إِذَا كَانَتْ لَكَ حَاجَةٌ فَلَا تَسْتَحْيِ وَ لَا تَحْتَشِمْ وَ اطْلُبْهَا فَإِنَّكَ تَرَى مَا تُحِبُّ إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq said, ‘Abu Hashim Al Ja’fary narrated to me saying, ",
            "‘I complained to Abu Muhammad of the constraint of the prison and the restraining blocks (shackles). So he<sup>asws</sup> wrote to me: ‘You will be praying Al-Zohr <span class=\"iTxt\">Salat</span> in your own home today’. So I came out (from the prison) during the time of Al-Zohr <span class=\"iTxt\">Salat</span>, and I prayed it in my own house just as he<sup>asws</sup> had said. ",
            "And I was (financially) constrained, so I wanted to seek Dinars from him<sup>asws</sup> in the letter, but I was too embarrassed. So when I went to my house, he<sup>asws</sup> diverted to me with one hundred Dinars and wrote to me: ‘Whenever there was a need for you, so neither be shy nor reserved, and seek it, for you will see what you love, if Allah<sup>azwj</sup> so Desires’."
          ],
          "en.sarwar": [
            " 9. Ali ibn Muhammad and Muhammad ibn abu ‘Abdallah have narrated from Ishaq ibn Muhammad al-Nakha‘i who has said that narrated to me Sufyan ibn Muhammad al-Duba‘i who has said the following. “I wrote to abu Muhammad and asked him about the meaning of the word al-Walija (relied) in the words of Allah, the Most High. “Do you think that God will not make any distinction between those of you who have fought for His cause and have relied on no one other than God, His Messenger, and the faithful ones, and other people?. .” <a href=\"/#/books/quran:9#h16\">[9:16]</a> I said to myself, not in the letter, “To who does the believers refer in this verse “? The answer came as this. The Walija refers to a person who would be appointed in place of the Leader with Divine Authority. You have said to yourself “To who the believers refers in this verse”? They are the Imams who ask Allah to grant security to the people and He grants their request.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/154)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1333,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:11",
        "text": [
          "إِسْحَاقُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ الْأَقْرَعِ قَالَ حَدَّثَنِي أَبُو حَمْزَةَ نُصَيْرٌ الْخَادِمُ قَالَ سَمِعْتُ أَبَا مُحَمَّدٍ غَيْرَ مَرَّةٍ يُكَلِّمُ غِلْمَانَهُ بِلُغَاتِهِمْ تُرْكٍ وَ رُومٍ وَ صَقَالِبَةَ فَتَعَجَّبْتُ مِنْ ذَلِكَ وَ قُلْتُ هَذَا وُلِدَ بِالْمَدِينَةِ وَ لَمْ يَظْهَرْ لِأَحَدٍ حَتَّى مَضَى أَبُو الْحَسَنِ ( عليه السلام ) وَ لَا رَآهُ أَحَدٌ فَكَيْفَ هَذَا أُحَدِّثُ نَفْسِي بِذَلِكَ فَأَقْبَلَ عَلَيَّ فَقَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى بَيَّنَ حُجَّتَهُ مِنْ سَائِرِ خَلْقِهِ بِكُلِّ شَيْ‏ءٍ وَ يُعْطِيهِ اللُّغَاتِ وَ مَعْرِفَةَ الْأَنْسَابِ وَ الْآجَالِ وَ الْحَوَادِثِ وَ لَوْ لَا ذَلِكَ لَمْ يَكُنْ بَيْنَ الْحُجَّةِ وَ الْمَحْجُوجِ فَرْقٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq, from Ahmad Bin Muhammad Bin Al Aqra’a who said, ‘Abu Hamza Nuseyr al Khadim narrated to me saying, ",
            "‘I heard Abu Muhammad<sup>asws</sup> more than once speaking to his<sup>asws</sup> servants in their own language, Turkish, or Roman, and Saqaliba. So I was astonished from that and I said, ‘This (Imam<sup>asws</sup>) is born in Al-Medina and he<sup>asws</sup> did not appear to anyone until Abu Al-Hassan<sup>asws</sup> passed away, and no one saw him<sup>asws</sup>, so how can this be?’ I was discussing that with myself and he<sup>asws</sup> turned towards me, so he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High Clarified His<sup>azwj</sup> Divine Authority from the rest of the people with everything, and He<sup>azwj</sup> Gave him the languages and the recognition of the lineages, and the terms (of death), and the occurrences, and had it not been for that, there would not have been a difference between the Divine Authority and others (entities)’."
          ],
          "en.sarwar": [
            " 10. Ishaq has said that abu Hashim al-Ja‘fari has said the following. “I complained to abu Muhammad (a.s.) about the constraining cell of the prison and the weight of the shackles on me. He wrote back in reply to me. “Today you will pray your noontime prayer in your own home.” I then was released that day and prayed the noontime prayer in my own home as he had said.” I was under financial constrains and I decided to ask him for a certain amount of Dinars in writing but I felt shy. When was going to my home he sent me a hundred Dinars and had written to me this. “If you need anything do not feel shy or embarrassed. Ask and you will find it as you wanted, by the will of Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (156/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1334,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:12",
        "text": [
          "إِسْحَاقُ عَنِ الْأَقْرَعِ قَالَ كَتَبْتُ إِلَى أَبِي مُحَمَّدٍ أَسْأَلُهُ عَنِ الْإِمَامِ هَلْ يَحْتَلِمُ وَ قُلْتُ فِي نَفْسِي بَعْدَ مَا فَصَلَ الْكِتَابُ الِاحْتِلَامُ شَيْطَنَةٌ وَ قَدْ أَعَاذَ اللَّهُ تَبَارَكَ وَ تَعَالَى أَوْلِيَاءَهُ مِنْ ذَلِكَ فَوَرَدَ الْجَوَابُ حَالُ الْأَئِمَّةِ فِي الْمَنَامِ حَالُهُمْ فِي الْيَقَظَةِ لَا يُغَيِّرُ النَّوْمُ مِنْهُمْ شَيْئاً وَ قَدْ أَعَاذَ اللَّهُ أَوْلِيَاءَهُ مِنْ لَمَّةِ الشَّيْطَانِ كَمَا حَدَّثَتْكَ نَفْسُكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq, from Al Aqra’a who said, ",
            "‘I wrote to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) asking him<sup>asws</sup> about the Imam<sup>asws</sup> whether he<sup>asws</sup> would experience wet dreams, and I said within myself after sending the letter, ‘The wet dreams are Satanic and Allah<sup>azwj</sup> Blessed and High has Sheltered His<sup>azwj</sup> Guardians<sup>asws</sup> from that’. So the answer came, ‘The state of the Imams<sup>asws</sup> during the sleep is their<sup>asws</sup> state during the wakefulness. The sleep does not change anything from them<sup>asws</sup>, and Allah<sup>azwj</sup> has Sheltered His<sup>azwj</sup> Guardians<sup>asws</sup> from the ordeal of the Satan<sup>la</sup> just as you discussed with yourself’."
          ],
          "en.sarwar": [
            " 11. Ishaq has narrated from Ahmad ibn Muhammad al-Aqra‘ who has said that narrated to me abuhz Nasir al-Khadim the following. “I had heard many times that abu Muhammad (a.s.) to each of his Roman, Turkish and Saqaliba slaves in their own languages. It was astonishing to me and I would think that he is born in al-Madina and has not exposed to anyone until abu al-Hassan passed away and no one saw him. How is this that he speaks such languages? I talking to myself that he came to me and said, “Allah, the Most High, the Most Holy, grants distinction to Leader with Divine Authority over the other creatures in all matters. He give them distinction in the matters of languages, knowledge of the genealogical issues, of the duration of lives and events. Without such distinctions there will be no difference between Leader with Divine Authority and others.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (156/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1335,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:13",
        "relations": {
          "Mentions": [
            "/books/quran:21:69"
          ]
        },
        "text": [
          "إِسْحَاقُ قَالَ حَدَّثَنِي الْحَسَنُ بْنُ ظَرِيفٍ قَالَ اخْتَلَجَ فِي صَدْرِي مَسْأَلَتَانِ أَرَدْتُ الْكِتَابَ فِيهِمَا إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) فَكَتَبْتُ أَسْأَلُهُ عَنِ الْقَائِمِ ( عليه السلام ) إِذَا قَامَ بِمَا يَقْضِي وَ أَيْنَ مَجْلِسُهُ الَّذِي يَقْضِي فِيهِ بَيْنَ النَّاسِ وَ أَرَدْتُ أَنْ أَسْأَلَهُ عَنْ شَيْ‏ءٍ لِحُمَّى الرِّبْعِ فَأَغْفَلْتُ خَبَرَ الْحُمَّى ",
          "فَجَاءَ الْجَوَابُ سَأَلْتَ عَنِ الْقَائِمِ فَإِذَا قَامَ قَضَى بَيْنَ النَّاسِ بِعِلْمِهِ كَقَضَاءِ دَاوُدَ ( عليه السلام ) لَا يَسْأَلُ الْبَيِّنَةَ وَ كُنْتَ أَرَدْتَ أَنْ تَسْأَلَ لِحُمَّى الرِّبْعِ فَأُنْسِيتَ فَاكْتُبْ فِي وَرَقَةٍ وَ عَلِّقْهُ عَلَى الْمَحْمُومِ فَإِنَّهُ يَبْرَأُ بِإِذْنِ اللَّهِ إِنْ شَاءَ اللَّهُ يا نارُ كُونِي بَرْداً وَ سَلاماً عَلى إِبْراهِيمَ فَعَلَّقْنَا عَلَيْهِ مَا ذَكَرَ أَبُو مُحَمَّدٍ ( عليه السلام ) فَأَفَاقَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq said, ",
            "‘Al-Hassan Bin Zareyf narrated to me saying, ‘Two questions disturbed my chest. I wanted (to write) a letter regarding these two to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>). So I wrote asking him<sup>asws</sup> about Al-Qaim<sup>asws</sup> when he<sup>asws</sup> rises with what would he<sup>asws</sup> be judging and where would his gathering be in which he<sup>asws</sup> would be judging between the people. And I wanted to ask him<sup>asws</sup> about something (medication) for my alternating fever, but I neglected (writing) the news of the fever. ",
            "So the answer came: ‘You asked about Al-Qaims<sup style=\"font-weight: normal\">asws</sup>. So when he<sup style=\"font-weight: normal\">asws</sup> does rise, he<sup style=\"font-weight: normal\">asws</sup> would judge between the people by his<sup style=\"font-weight: normal\">asws</sup> knowledge like the judgment of Dawood<sup style=\"font-weight: normal\">as</sup>. He<sup style=\"font-weight: normal\">asws</sup> will not be asking for the proof. And you wanted to ask for (a cure) for the alternating fever but you forgot. So write in a paper and hang it upon the feverish person, so he would cool down by the Permission of Allah<sup style=\"font-weight: normal\">azwj</sup>, if Allah<sup style=\"font-weight: normal\">azwj</sup> so Desires <span class=\"ibTxt\"><a href=\"/#/books/quran:21#h69\">[21:69]</a> O fire! Be cool and a safety to Ibrahim</span>. So we hung it upon him what Abu Muhammad<sup style=\"font-weight: normal\">asws</sup> had mentioned, so he would be cured’."
          ],
          "en.sarwar": [
            " 12. Ishaq has narrated from al-Aqra‘ who has said the following. “I wrote to abu Muhammad (a.s.) asking him if Imams experience wet dreams? I said to myself after the letter had gone, “Wet dream is something Satanic, and Allah, the Most Holy, the Most High, has protected those whom He has given authority against such things.” The answer came. “The conditions of the Imams when asleep is the same as when they are awake. Sleep does not change anything in them. Allah has given protection to those whom He has given authority from Satanic encounters as you spoke to yourself.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (157/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1336,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:14",
        "relations": {
          "Mentions": [
            "/books/quran:21:69"
          ]
        },
        "text": [
          "إِسْحَاقُ قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ مُحَمَّدِ بْنِ عَلِيِّ بْنِ إِسْمَاعِيلَ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ قَالَ قَعَدْتُ لِأَبِي مُحَمَّدٍ ( عليه السلام ) عَلَى ظَهْرِ الطَّرِيقِ فَلَمَّا مَرَّ بِي شَكَوْتُ إِلَيْهِ الْحَاجَةَ وَ حَلَفْتُ لَهُ أَنَّهُ لَيْسَ عِنْدِي دِرْهَمٌ فَمَا فَوْقَهَا وَ لَا غَدَاءٌ وَ لَا عَشَاءٌ ",
          "قَالَ فَقَالَ تَحْلِفُ بِاللَّهِ كَاذِباً وَ قَدْ دَفَنْتَ مِائَتَيْ دِينَارٍ وَ لَيْسَ قَوْلِي هَذَا دَفْعاً لَكَ عَنِ الْعَطِيَّةِ أَعْطِهِ يَا غُلَامُ مَا مَعَكَ فَأَعْطَانِي غُلَامُهُ مِائَةَ دِينَارٍ ثُمَّ أَقْبَلَ عَلَيَّ فَقَالَ لِي إِنَّكَ تُحْرَمُهَا أَحْوَجَ مَا تَكُونُ إِلَيْهَا يَعْنِي الدَّنَانِيرَ الَّتِي دَفَنْتُ",
          "وَ صَدَقَ ( عليه السلام ) وَ كَانَ كَمَا قَالَ دَفَنْتُ مِائَتَيْ دِينَارٍ وَ قُلْتُ يَكُونُ ظَهْراً وَ كَهْفاً لَنَا فَاضْطُرِرْتُ ضَرُورَةً شَدِيدَةً إِلَى شَيْ‏ءٍ أُنْفِقُهُ وَ انْغَلَقَتْ عَلَيَّ أَبْوَابُ الرِّزْقِ فَنَبَّشْتُ عَنْهَا فَإِذَا ابْنٌ لِي قَدْ عَرَفَ مَوْضِعَهَا فَأَخَذَهَا وَ هَرَبَ فَمَا قَدَرْتُ مِنْهَا عَلَى شَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq said, ‘Ismail Bin Muhammad Bin Ali Bin Ismail Bin Ali Bin Abdullah Bin Abbas Bin Abdul Muttalib narrated to me saying, ",
            "‘I saw (awaiting) for Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) upon the back of the road. So when he<sup>asws</sup> passed by me, I complained to him<sup>asws</sup> of the need and I swore on oath to him<sup>asws</sup> that there wasn’t a (single) Dirham with me and what was above it, nor any lunch nor a dinner’. ",
            "He (the narrator) said, ‘So he<sup>asws</sup> said: ‘You swore on oath with Allah<sup>azwj</sup>, a lie, and you have buried two hundred Dinars, and this word of mine<sup>asws</sup> isn’t to repel you from the granting. O boy! Give him what is with you!’ So his<sup>asws</sup> servant gave me two hundred Dinars’. Then he<sup>asws</sup> turned towards me, and he<sup>asws</sup> said to me: ‘You will be deprived of it when you are as needy to it as can happen to be, meaning the Dinars which you have buried’. ",
            "And he<sup style=\"font-weight: normal\">asws</sup> spoke the truth, and it happenned just as he<sup style=\"font-weight: normal\">asws</sup> said. I had buried two hundred Dinars and I said, ‘It will happen to be a backing and a cave for us’. Then I was desperate with an intense necessity to something (I needed) to spend, and the doors of the sustenance were closed upon me. So I went to exhume it, and it was so that a son of mine had recognised its place, so he had taken it and fled, and I was not able upon anything from it’."
          ],
          "en.sarwar": [
            " 13. Ishaq has said that al-Hassan ibn al-Zarif narrated to me the following. “Two issues would poke in my chest which made me to write to abu Muhammad (a.s.). I wrote about Al-Qa’im (the one who will rise with Divine Authority). “When he rise by what means he will judge among the people and where will be his court house?” I also wanted to ask him about alternating fever but I had missed to mention it in writing. The answer came. “You had asked about Al-Qa’im. When he will rise he judge among people through his own knowledge just the way David would judge. He would not call any witness to testify. You also wanted to ask about alternating fever but you forgot to do so. Write this on a sheet (of material) “We said to the fire, ‘Be cool and peaceful (with Abraham)’” <a href=\"/#/books/quran:21#h69\">[21:69]</a>.The narrator has said that we did just as he had said and the suffering person was relieved.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (158/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1337,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:15",
        "text": [
          "إِسْحَاقُ قَالَ حَدَّثَنِي عَلِيُّ بْنُ زَيْدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيٍّ قَالَ كَانَ لِي فَرَسٌ وَ كُنْتُ بِهِ مُعْجَباً أُكْثِرُ ذِكْرَهُ فِي الْمَحَالِّ فَدَخَلْتُ عَلَى أَبِي مُحَمَّدٍ يَوْماً فَقَالَ لِي مَا فَعَلَ فَرَسُكَ فَقُلْتُ هُوَ عِنْدِي وَ هُوَ ذَا هُوَ عَلَى بَابِكَ وَ عَنْهُ نَزَلْتُ فَقَالَ لِيَ اسْتَبْدِلْ بِهِ قَبْلَ الْمَسَاءِ إِنْ قَدَرْتَ عَلَى مُشْتَرِي وَ لَا تُؤَخِّرْ ذَلِكَ وَ دَخَلَ عَلَيْنَا دَاخِلٌ وَ انْقَطَعَ الْكَلَامُ ",
          "فَقُمْتُ مُتَفَكِّراً وَ مَضَيْتُ إِلَى مَنْزِلِي فَأَخْبَرْتُ أَخِي الْخَبَرَ فَقَالَ مَا أَدْرِي مَا أَقُولُ فِي هَذَا وَ شَحَحْتُ بِهِ وَ نَفِسْتُ عَلَى النَّاسِ بِبَيْعِهِ وَ أَمْسَيْنَا فَأَتَانَا السَّائِسُ وَ قَدْ صَلَّيْنَا الْعَتَمَةَ فَقَالَ يَا مَوْلَايَ نَفَقَ فَرَسُكَ فَاغْتَمَمْتُ وَ عَلِمْتُ أَنَّهُ عَنَى هَذَا بِذَلِكَ الْقَوْلِ ",
          "قَالَ ثُمَّ دَخَلْتُ عَلَى أَبِي مُحَمَّدٍ بَعْدَ أَيَّامٍ وَ أَنَا أَقُولُ فِي نَفْسِي لَيْتَهُ أَخْلَفَ عَلَيَّ دَابَّةً إِذْ كُنْتُ اغْتَمَمْتُ بِقَوْلِهِ فَلَمَّا جَلَسْتُ قَالَ نَعَمْ نُخْلِفُ دَابَّةً عَلَيْكَ يَا غُلَامُ أَعْطِهِ بِرْذَوْنِيَ الْكُمَيْتَ هَذَا خَيْرٌ مِنْ فَرَسِكَ وَ أَوْطَأُ وَ أَطْوَلُ عُمُراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq said, ",
            "‘Ali Bin Zayd son of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> narrated to me saying, ‘There was a horse for me, and I was fascinated by it and would frequently mention it in the gatherings. So I went over to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) one day, and he<sup>asws</sup> said to me: ‘What happened to your horse?’ So I said, ‘It is with me, and it is that which is at your<sup>asws</sup> door, and I descended from it’. So he<sup>asws</sup> said to me: ‘Change it before the evening if you are able upon (finding a) buyer, and do not delay that’; and a comer entered and the speech was cut off.",
            "So I stood up worried and I went to my house and I informed my brother of the news. So he said, ‘I do not know what I should be saying regarding this’. And I hesitated with it and I was unwilling upon the people with selling it, and evening came. So there came to us a (horse) groomer came over and we prayed the evening <span class=\"iTxt\">Salat</span>, and he said, ‘O my master! Your horse died’. So I was gloomy and knew that this is what he<sup>asws</sup> had meant with that word.",
            "He (the narrator) said, ‘Then I went over to Abu Muhammad<sup>asws</sup> after a few days, and I was saying within myself, ‘If only he<sup>asws</sup> would replace the animal upon me when I was gloomy due to his<sup>asws</sup> words’. So when I was seated, he<sup>asws</sup> said: ‘Yes, we<sup>asws</sup> will replace the animal upon you. O boy! Give him my<sup>asws</sup> dark brown horse. This one is better than your horse, and more rideable, and of a longer life-span’."
          ],
          "en.sarwar": [
            " 14. Ishaq has said that narrated to him ’Isma‘il ibn Muhammad ibn Ali ibn ’Isma‘il ibn Ali ibn ‘Abdallah ibn ‘Abbass ibn ‘Abd al-Muttalib who has said the following. “Once I sat on the side of the road waiting for abu Muhammad (a.s.) to pass by so that I can present before him my complain against a need. When he was passing by I presented my complain before him and swore that I did not have even a Dirham, nothing for lunch or dinner.” The narrator has said that the Imam (a.s.) said, “You falsely swore by Allah. You have buried two hundred Dinars. These my words are not to deny you any grants. Young man, give him whatever is with you. His servant, give me one hundred Dinars. He then turned to me and said, “You will be deprived of it in your worst days.” He meant those Dinars that I had buried for a difficult day. What he said was true. I had buried two hundred Dinars thinking that they would only be used in a very difficult day. When I faced such a difficult day and all the ways to find a living was closed I went to take out the two hundred Dinars but soon I found that there was not even a single Dinar. In fact, my son had learned about where the Dinars were buried and he had taken them and had ran away. I could not benefit from any of those Dinars.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (159/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1338,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:16",
        "text": [
          "إِسْحَاقُ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الْحَسَنِ بْنِ شَمُّونٍ قَالَ حَدَّثَنِي أَحْمَدُ بْنُ مُحَمَّدٍ قَالَ كَتَبْتُ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) حِينَ أَخَذَ الْمُهْتَدِي فِي قَتْلِ الْمَوَالِي يَا سَيِّدِي الْحَمْدُ لِلَّهِ الَّذِي شَغَلَهُ عَنَّا فَقَدْ بَلَغَنِي أَنَّهُ يَتَهَدَّدُكَ وَ يَقُولُ وَ اللَّهِ لَأُجْلِيَنَّهُمْ عَنْ جَدِيدِ الْأَرْضِ ",
          "فَوَقَّعَ أَبُو مُحَمَّدٍ ( عليه السلام ) بِخَطِّهِ ذَاكَ أَقْصَرُ لِعُمُرِهِ عُدَّ مِنْ يَوْمِكَ هَذَا خَمْسَةَ أَيَّامٍ وَ يُقْتَلُ فِي الْيَوْمِ السَّادِسِ بَعْدَ هَوَانٍ وَ اسْتِخْفَافٍ يَمُرُّ بِهِ فَكَانَ كَمَا قَالَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq said, ‘Muhammad Bin Al Hassan Bin Shamoun narrated to me saying, ‘Ahmad Bin Muhammad narrated to me saying, ",
            "‘I wrote to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) when Al-Muhtady (the Caliph) took to the killing of the Slaves, ‘O my Master<sup>asws</sup>” The Praise is for Allah<sup>azwj</sup> Who Pre-occupied him from us<sup>asws</sup>, for it has reached me that he had threatened you<sup>asws</sup> and he was saying, ‘By Allah<sup>azwj</sup>! I shall remove them from the new land’. ",
            "So Abu Muhammad<sup>asws</sup> signed by his<sup>asws</sup> own handwriting: ‘That would be a shortening for his life-span. Count five days from this day of yours, and he would be killed during the sixth day after humiliation and being belittled passing by’. So it happened just as he<sup>asws</sup> had said’."
          ],
          "en.sarwar": [
            " 15. Ishaq has said that narrated to me Ali ibn Zayd ibn Ali ibn al-Husayn ibn Ali (a.s.) the following. “I had a horse that I liked very much and I would admire it often in gatherings. One day I went to see abu Muhammad (a.s.) and he said, “What has your horse done?” I said, “I still have it and it is in front of your. I just dismounted it.” He said, “Change it before this evening if you can if you would find a buyer and do not delay.” Someone came in and our conversation discontinued. I then left anxiously for home and informed my brother about it and he said, “I do not know what to say about it.” I felt covetous about it procrastinated in offering for sale until it was evening we had just prayed the late evening prayer that the horse trainer came in saying, “My master your horse has died.” I became sad and realized that this was abu Muhammad (a.s.) meant. After several day I went to see abu Muhammad (a.s.) and I was saying to myself, “I wish he would replace my horse with another one. It was his words that made me so sad.” When I sat down he said, “Yes, we will replace your horse. Young man, give to him my dark brown nag which better than your horse to ride and will live longer.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/160)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1339,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:17",
        "text": [
          "إِسْحَاقُ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الْحَسَنِ بْنِ شَمُّونٍ قَالَ كَتَبْتُ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) أَسْأَلُهُ أَنْ يَدْعُوَ اللَّهَ لِي مِنْ وَجَعِ عَيْنِي وَ كَانَتْ إِحْدَى عَيْنَيَّ ذَاهِبَةً وَ الْأُخْرَى عَلَى شَرَفِ ذَهَابٍ فَكَتَبَ إِلَيَّ حَبَسَ اللَّهُ عَلَيْكَ عَيْنَكَ فَأَفَاقَتِ الصَّحِيحَةُ وَ وَقَّعَ فِي آخِرِ الْكِتَابِ آجَرَكَ اللَّهُ وَ أَحْسَنَ ثَوَابَكَ فَاغْتَمَمْتُ لِذَلِكَ وَ لَمْ أَعْرِفْ فِي أَهْلِي أَحَداً مَاتَ فَلَمَّا كَانَ بَعْدَ أَيَّامٍ جَاءَتْنِي وَفَاةُ ابْنِي طَيِّبٍ فَعَلِمْتُ أَنَّ التَّعْزِيَةَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq said, ‘Muhammad Bin Al Hassan Bin Shamoun narrated to me saying, ",
            "‘I wrote to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) asking him<sup>asws</sup> that he<sup>asws</sup> supplicates to Allah<sup>azwj</sup> for me for the pain of my eyes, and it was so the one of my eyes had gone (blinded) and the other one was upon the verge of going. So he<sup>asws</sup> wrote to me: ‘Allah<sup>azwj</sup> will Preserve your eyes upon you’. So it opened healthy, and he<sup>asws</sup> had signed at the end of the letter: ‘May Allah<sup>azwj</sup> Recompense you and Grant you good Rewards’. So I was gloomy due to that and I did not know it (the condolence) was with regards to which of my family member who had died. So when it was after a few days, there came to me (news) of the death of my son Taiib, then I knew that the condolence was for him’."
          ],
          "en.sarwar": [
            " 16. Ishaq has said that Muhammad ibn al-Hassan Shammun has said that Ahmad ibn Muhammad narrated to me the following. “I wrote to abu Muhammad (a.s.) when al-Muhtadi had began to kill the Turkish Mawali (slave or supporters). My master, we thank Allah for diverting his (al-Muhtadi’s) attention from us. I have heard that he had threatened you and has said, By Allah, I will wipe them out from the face of the earth.” Abu Muhammad (a.s.) sent in response with his own signature. “This will be much shortening to his life. Count five days from today. On the sixth day he will be killed with humiliation and insults that he will go through.” It then happned exactly as he had said.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (161/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1340,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:18",
        "text": [
          "إِسْحَاقُ قَالَ حَدَّثَنِي عُمَرُ بْنُ أَبِي مُسْلِمٍ قَالَ قَدِمَ عَلَيْنَا بِسُرَّ مَنْ رَأَى رَجُلٌ مِنْ أَهْلِ مِصْرَ يُقَالُ لَهُ سَيْفُ بْنُ اللَّيْثِ يَتَظَلَّمُ إِلَى الْمُهْتَدِي فِي ضَيْعَةٍ لَهُ قَدْ غَصَبَهَا إِيَّاهُ شَفِيعٌ الْخَادِمُ وَ أَخْرَجَهُ مِنْهَا فَأَشَرْنَا عَلَيْهِ أَنْ يَكْتُبَ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) يَسْأَلُهُ تَسْهِيلَ أَمْرِهَا ",
          "فَكَتَبَ إِلَيْهِ أَبُو مُحَمَّدٍ ( عليه السلام ) لَا بَأْسَ عَلَيْكَ ضَيْعَتُكَ تُرَدُّ عَلَيْكَ فَلَا تَتَقَدَّمْ إِلَى السُّلْطَانِ وَ الْقَ الْوَكِيلَ الَّذِي فِي يَدِهِ الضَّيْعَةُ وَ خَوِّفْهُ بِالسُّلْطَانِ الْأَعْظَمِ اللَّهِ رَبِّ الْعَالَمِينَ ",
          "فَلَقِيَهُ فَقَالَ لَهُ الْوَكِيلُ الَّذِي فِي يَدِهِ الضَّيْعَةُ قَدْ كُتِبَ إِلَيَّ عِنْدَ خُرُوجِكَ مِنْ مِصْرَ أَنْ أَطْلُبَكَ وَ أَرُدَّ الضَّيْعَةَ عَلَيْكَ فَرَدَّهَا عَلَيْهِ بِحُكْمِ الْقَاضِي ابْنِ أَبِي الشَّوَارِبِ وَ شَهَادَةِ الشُّهُودِ وَ لَمْ يَحْتَجْ إِلَى أَنْ يَتَقَدَّمَ إِلَى الْمُهْتَدِي فَصَارَتِ الضَّيْعَةُ لَهُ وَ فِي يَدِهِ وَ لَمْ يَكُنْ لَهَا خَبَرٌ بَعْدَ ذَلِكَ",
          "قَالَ وَ حَدَّثَنِي سَيْفُ بْنُ اللَّيْثِ هَذَا قَالَ خَلَّفْتُ ابْناً لِي عَلِيلًا بِمِصْرَ عِنْدَ خُرُوجِي عَنْهَا وَ ابْناً لِي آخَرَ أَسَنَّ مِنْهُ كَانَ وَصِيِّي وَ قَيِّمِي عَلَى عِيَالِي وَ فِي ضِيَاعِي فَكَتَبْتُ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) أَسْأَلُهُ الدُّعَاءَ لِابْنِيَ الْعَلِيلِ فَكَتَبَ إِلَيَّ قَدْ عُوفِيَ ابْنُكَ الْمُعْتَلُّ وَ مَاتَ الْكَبِيرُ وَصِيُّكَ وَ قَيِّمُكَ فَاحْمَدِ اللَّهَ وَ لَا تَجْزَعْ فَيَحْبَطَ أَجْرُكَ فَوَرَدَ عَلَيَّ الْخَبَرُ أَنَّ ابْنِي قَدْ عُوفِيَ مِنْ عِلَّتِهِ وَ مَاتَ الْكَبِيرُ يَوْمَ وَرَدَ عَلَيَّ جَوَابُ أَبِي مُحَمَّدٍ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq said, ‘Umar Bin Abu Muslim narrated to me saying, ",
            "‘A man from the people of Egypt called Sayf Al-Lays came over to us at Surmanrayy (Samarrah), to complain of an injustice go Al-Mohtady (the Caliph) regarding an estate of his which had been usurped from him by Shafi’e Al-Khadim and he had thrown him out from it. So we indicated to him that he should write to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) asking him<sup>asws</sup> to ease its matter. ",
            "So Abu Muhammad<sup>asws</sup> wrote to him: ‘There would be no problem upon you. Your estate would be returned to you, therefore do not proceed to the Sultan and meet up with the agent in whose hand is the estate and scare him with the greatest Sultan Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’. ",
            "So he met up with him and the agent in whose hand was the estate said to him, ‘He (Shafi’e Al-Khadim) had written to me during your exit from Egypt that you would be seeking it and that I should return the estate to you’. So he returned it to him by the judgment of the judge Ibn Abu So Shawarib, and the witnesses witnessed, and he had not need to proceed to Al-Mohtady (the Caliph). Thus, the estate came to be for him and into his hands, and there is no news of it after that’. ",
            "He (the narrator) said, ‘And Sayf Bin Al-Lays narrate this to me saying, ‘I left behind a son of mine in illness in Egypt during my going out from it, and another son of mine who was older than him was my trustee and the caretaker of my dependants and regarding my estate. So I wrote to Abu Muhammad<sup>asws</sup> asking him<sup>asws</sup> to supplicate for my sick son. So he<sup>asws</sup> wrote to me: ‘Your son has (already) recovered from his illness’, and the elder one died on the day the answer came from Abu Muhammad<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 17. Ishaq has said that Muhammad ibn al-Hassan Shammun narrated to me the following. “I wrote to abu Muhammad (a.s.) requesting him to pray for because of the pain that I suffered in my eyes. One of my eye had gone and the other was about to go. He wrote back to me in reply, “Allah has kept your eye for you.” My painful eye then recovered. He had signed at the end with these words, “May Allah, grant you good rewards and best recompense.” I became sad and I did not know anyone just passed away from my family. After a few days I received information of the death of my son, Tayyib. I then realized what for his condolences to me were.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/161)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1341,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:19",
        "text": [
          "إِسْحَاقُ قَالَ حَدَّثَنِي يَحْيَى بْنُ الْقُشَيْرِيِّ مِنْ قَرْيَةٍ تُسَمَّى قِيرَ قَالَ كَانَ لِأَبِي مُحَمَّدٍ وَكِيلٌ قَدِ اتَّخَذَ مَعَهُ فِي الدَّارِ حُجْرَةً يَكُونُ فِيهَا مَعَهُ خَادِمٌ أَبْيَضُ فَأَرَادَ الْوَكِيلُ الْخَادِمَ عَلَى نَفْسِهِ فَأَبَى إِلَّا أَنْ يَأْتِيَهُ بِنَبِيذٍ فَاحْتَالَ لَهُ بِنَبِيذٍ ثُمَّ أَدْخَلَهُ عَلَيْهِ وَ بَيْنَهُ وَ بَيْنَ أَبِي مُحَمَّدٍ ثَلَاثَةُ أَبْوَابٍ مُغْلَقَةٍ ",
          "قَالَ فَحَدَّثَنِي الْوَكِيلُ قَالَ إِنِّي لَمُنْتَبِهٌ إِذْ أَنَا بِالْأَبْوَابِ تُفْتَحُ حَتَّى جَاءَ بِنَفْسِهِ فَوَقَفَ عَلَى بَابِ الْحُجْرَةِ ثُمَّ قَالَ يَا هَؤُلَاءِ اتَّقُوا اللَّهَ خَافُوا اللَّهَ فَلَمَّا أَصْبَحْنَا أَمَرَ بِبَيْعِ الْخَادِمِ وَ إِخْرَاجِي مِنَ الدَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq said, ‘Yahya Bin Al Qusheyri narrated to me from a town named as Qeyr saying, ",
            "‘There was an agent for Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) whom he<sup>asws</sup> had taken to be in a room of the house. There happened to be a white servant with him. So the agent intended the servant to himself, but he refused except if he comes to him with Nabeez (an intoxicating drink). So he brought the Nabeez for him and went over to him; and between him and Abu Muhammad<sup>asws</sup> there were three locked doors.",
            "He (the narrator) said, ‘So the agent narrated to me saying, ‘I was paying attention to him when the doors opened up until he<sup>asws</sup> came in himself<sup>asws</sup> and paused at the door of the room, then said: ‘O you! Be pious to Allah<sup>azwj</sup> and fear Allah<sup>azwj</sup>!’. So when we were in the morning, he<sup>asws</sup> ordered to sell the servant and threw me out from the house’."
          ],
          "en.sarwar": [
            " 18. Ishaq has said that narrated to me ‘Umar ibn Muslim the following. “We were in the city of Surra man Ra’a that a man, called Sayf ibn al-Layth, from Egypt came with a complain to al-Muhtadi against Shafi‘ al-Khadim who had usurped his property and expelled him from the city. We gave a hint to write to abu Muhammad (a.s.) and request him to facilitate this affairs. Abu Muhammad (a.s.) wrote back to him, “You will be all right. Your property will given back to you. Do not forward your complains to Sultan. Go and meet the agent (of Shafi‘ al-Khadim) who has your property and frighten him with the power of the Greatest Sultan, Allah, Lord of the worlds.” He met the agent. The agent who had the property with him said, “It was written to me at the time of your leaving Egypt to find you and return your property to you. He returned the property by the order of the judge, ibn abu al-Shawwarib in the presence of witnesses and he did not have to present his complains to al-Muhtadi. He procured his property and nothing was heard about him thereafter. The narrator has said that this is Layth who has said the following also. “When left Egypt one of my sons was ill and my elder son was the executor of my will and the supervisor over my family in case I would die. I wrote to abu Muhammad (a.s.) requesting him to pray my son who was ill. He wrote back to me in reply, “Your son has recovered but your elder son, the executor of your will and the supervisor over your family has died. Pay thanks to Allah, do not be impatient lest your rewards will be withheld.” The news came to me that my son who was ill has recovered and my elder son died on the day I received the reply letter from abu Muhammad (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/162)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1342,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:20",
        "text": [
          "إِسْحَاقُ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ الرَّبِيعِ الشَّائِيُّ قَالَ نَاظَرْتُ رَجُلًا مِنَ الثَّنَوِيَّةِ بِالْأَهْوَازِ ثُمَّ قَدِمْتُ سُرَّ مَنْ رَأَى وَ قَدْ عَلِقَ بِقَلْبِي شَيْ‏ءٌ مِنْ مَقَالَتِهِ فَإِنِّي لَجَالِسٌ عَلَى بَابِ أَحْمَدَ بْنِ الْخَضِيبِ إِذْ أَقْبَلَ أَبُو مُحَمَّدٍ ( عليه السلام ) مِنْ دَارِ الْعَامَّةِ يَؤُمُّ الْمَوْكِبَ فَنَظَرَ إِلَيَّ وَ أَشَارَ بِسَبَّاحَتِهِ أَحَدٌ أَحَدٌ فَرْدٌ فَسَقَطْتُ مَغْشِيّاً عَلَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq said, ‘Muhammad Bin Al Rbi’e Al Shai’e informed me saying, ",
            "‘I looked at a man from the Dualists (believers in two gods) in Al-Ahvaz, then I proceeded to Surmanrayy (Samarrah), and something from his speech was hanging upon my heart. So I sat at the door of Ahmad Bin Al-Khazeyb when Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) came over from the Public house on the day of the (Sultan’s) procession. So he<sup>asws</sup> looked towards me and gestured by his<sup>asws</sup> forefinger: ‘One! One! Individual! (There is only one God)’. So I fell down, there being unconsciousness upon me’."
          ],
          "en.sarwar": [
            " 19. Ishaq has said that narrated to me Yahya ibn al-Qushayri from the town called Qir the following. “Abu Muhammad (a.s.) had an agent who lived in a room in the house with white servant of the Imam (a.s.). the agent invited the servant to have evil activities with him and the servant refused to do so unless he brought him wine. The agent managed to find wine and take it to him. There were three closed doors between them and the quarters of the Imam (a.s.). The narrator has said that the agent narrated to me that was awake and I saw the doors open until I saw the Imam (a.s.) in person standing at the door. He then said, “O you have fear of Allah and be pious before Him. In the morning he ordered to sell the servant and discharge me from the job.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (162/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1343,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:21",
        "text": [
          "إِسْحَاقُ عَنْ أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ دَخَلْتُ عَلَى أَبِي مُحَمَّدٍ يَوْماً وَ أَنَا أُرِيدُ أَنْ أَسْأَلَهُ مَا أَصُوغُ بِهِ خَاتَماً أَتَبَرَّكُ بِهِ فَجَلَسْتُ وَ أُنْسِيتُ مَا جِئْتُ لَهُ فَلَمَّا وَدَّعْتُ وَ نَهَضْتُ رَمَى إِلَيَّ بِالْخَاتَمِ فَقَالَ أَرَدْتَ فِضَّةً فَأَعْطَيْنَاكَ خَاتَماً رَبِحْتَ الْفَصَّ وَ الْكِرَاءَ هَنَأَكَ اللَّهُ يَا أَبَا هَاشِمٍ فَقُلْتُ يَا سَيِّدِي أَشْهَدُ أَنَّكَ وَلِيُّ اللَّهِ وَ إِمَامِيَ الَّذِي أَدِينُ اللَّهَ بِطَاعَتِهِ فَقَالَ غَفَرَ اللَّهُ لَكَ يَا أَبَا هَاشِمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq, from Abu Hashim Al Ja’fary who said, ",
            "‘I went over to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) one day and I wanted to ask him<sup>asws</sup> what I could forge a ring with in order to be Blessed by it. So I sat down and I forgot what I had come to him<sup>asws</sup> for. So when I bade farewell and got up, he flicked over a ring to me, and he<sup>asws</sup> said: ‘You wanted silver, so we<sup>asws</sup> give you a (ready made) ring. You profited the silver and the forging (of the ring). May Allah<sup>azwj</sup> Bless you, O Abu Hashim!’. So I said, ‘O my Master<sup>asws</sup>! I hereby testify that you<sup>asws</sup> are the Guardian of Allah<sup>azwj</sup> and my Imam<sup>asws</sup> who Allah<sup>azwj</sup> Made a Religion by his<sup>asws</sup> obedience’. So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Forgive you, O Abu Hashim!’’."
          ],
          "en.sarwar": [
            " 20. Ishaq has said that narrated to me Muhammad ibn al-Rabi‘ al-Sa’i has said the following. “I debated a man who believed in dualism in Ahwaz them went to Surra man Ra‘a. However, his words were stuck to my heart. I was sitting in front of the door of Ahmad al-Khadib that I saw abu Muhammad (a.s.) coming from the house for public gathering. It was the house wherein on a certain day the Sultan would allow the common people to visit him. The Imam (a.s.) looked at me and made a gesture with his forefinger say One, single and only One. I fainted and fell on my face.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/163)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1344,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:22",
        "text": [
          "إِسْحَاقُ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الْقَاسِمِ أَبُو الْعَيْنَاءِ الْهَاشِمِيُّ مَوْلَى عَبْدِ الصَّمَدِ بْنِ عَلِيٍّ عَتَاقَةً قَالَ كُنْتُ أَدْخُلُ عَلَى أَبِي مُحَمَّدٍ ( عليه السلام ) فَأَعْطَشُ وَ أَنَا عِنْدَهُ فَأُجِلُّهُ أَنْ أَدْعُوَ بِالْمَاءِ فَيَقُولُ يَا غُلَامُ اسْقِهِ وَ رُبَّمَا حَدَّثْتُ نَفْسِي بِالنُّهُوضِ فَأُفَكِّرُ فِي ذَلِكَ فَيَقُولُ يَا غُلَامُ دَابَّتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Is’haq said, ‘Muhammad Bin Al Qasim Abu Al Ayana Al Hashimy, a slave of Abul Samad Bin Ali Ataqa narrated to me saying, ",
            "‘I used to go over to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>). So I would get thirsty while I was in his<sup>asws</sup> presence, and I would defer calling for the water, and he<sup>asws</sup> would be saying: ‘O boy! Quench him’. And sometimes I would discuss with myself for the leaving and be thinking with regards to that, so he<sup>asws</sup> would be saying: ‘O boy! (Get) His animal’."
          ],
          "en.sarwar": [
            " 21. Ishaq has narrated from abu Hashim al-Ja‘fari who has said the following. “One day I went to see abu Muhammad (a.s.) and I wanted him to give me a certain amount of silver so I can make a ring out of it and keep for blessing. I sat down but forgot to ask what I had come for. When was leaving and said farewell to him he threw a ring to me and said, “You wanted silver and we gave you and profited the gems and the cost of the goldsmith works. May Allah grant you blessings O abu Hashim.” I then said, “I testify that you are the Wali of Allah, (one who possesses Divine Authority) and my Imam through my obedience whom I follow the religion of Allah.” He then said, “May Allah grant you forgiveness, O abu Hashim.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/164)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1345,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:23",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ بْنِ مُوسَى بْنِ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ عَبْدِ الْغَفَّارِ قَالَ دَخَلَ الْعَبَّاسِيُّونَ عَلَى صَالِحِ بْنِ وَصِيفٍ وَ دَخَلَ صَالِحُ بْنُ عَلِيٍّ وَ غَيْرُهُ مِنَ الْمُنْحَرِفِينَ عَنْ هَذِهِ النَّاحِيَةِ عَلَى صَالِحِ بْنِ وَصِيفٍ عِنْدَ مَا حَبَسَ أَبَا مُحَمَّدٍ ( عليه السلام ) فَقَالَ لَهُمْ صَالِحٌ وَ مَا أَصْنَعُ قَدْ وَكَّلْتُ بِهِ رَجُلَيْنِ مِنْ أَشَرِّ مَنْ قَدَرْتُ عَلَيْهِ فَقَدْ صَارَا مِنَ الْعِبَادَةِ وَ الصَّلَاةِ وَ الصِّيَامِ إِلَى أَمْرٍ عَظِيمٍ فَقُلْتُ لَهُمَا مَا فِيهِ فَقَالَا مَا تَقُولُ فِي رَجُلٍ يَصُومُ النَّهَارَ وَ يَقُومُ اللَّيْلَ كُلَّهُ لَا يَتَكَلَّمُ وَ لَا يَتَشَاغَلُ وَ إِذَا نَظَرْنَا إِلَيْهِ ارْتَعَدَتْ فَرَائِصُنَا وَ يُدَاخِلُنَا مَا لَا نَمْلِكُهُ مِنْ أَنْفُسِنَا فَلَمَّا سَمِعُوا ذَلِكَ انْصَرَفُوا خَائِبِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Ismail Bin Ibrahim Bin Musa Bin Ja’far Bin Muhammad, from Ali Bin Abdul Ghaffar who said, ",
            "‘The Abbasides came over to Salih Bin Waseyf (the prison warden), and (also) Salih Bin Ali and others from the deviants from these areas came over to Salih Bin Waseyf, during the imprisonment of Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>). So Salih said to them, ‘And what can I do, and I had allocated two men from the evillest as I was able upon finding upon him<sup>asws</sup>, but they came to a great matter from the worship and the <span class=\"iTxt\">Salat</span> and the Fasting. So I said to these two, ‘What is it regarding him<sup>asws</sup>?’ So they both said, ‘What can we say about a man who is Fasting during the day and is standing (for <span class=\"iTxt\">Salat</span>) during the night, all of it, not speaking nor pre-occupying (with anything else)? And whenever we look at him<sup>asws</sup>, our bodies tremble and (something) enters into us what we have no control over ourselves’. So when they heard that, they left disappointed’."
          ],
          "en.sarwar": [
            " 22. Ishaq has said that narrated to Muhammad ibn al-Qasim abu al-‘Ayna’ al-Hashimi, the slave of ‘Abd al-Samad ibn Ali ‘Ataqa the following. “Often time I would go to see abu Muhammad (a.s.). When in his presence I would feel thirsty but I would feel shy, out of respect for him, to ask for water but he would call the people of his household to bring water for me. Often times I would think to myself of leaving and he would say, “Young man, bring his horse.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/165)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1346,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:24",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ الْحُسَيْنِ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الْحَسَنِ الْمَكْفُوفُ قَالَ حَدَّثَنِي بَعْضُ أَصْحَابِنَا عَنْ بَعْضِ فَصَّادِي الْعَسْكَرِ مِنَ النَّصَارَى أَنَّ أَبَا مُحَمَّدٍ ( عليه السلام ) بَعَثَ إِلَيَّ يَوْماً فِي وَقْتِ صَلَاةِ الظُّهْرِ فَقَالَ لِي افْصِدْ هَذَا الْعِرْقَ قَالَ وَ نَاوَلَنِي عِرْقاً لَمْ أَفْهَمْهُ مِنَ الْعُرُوقِ الَّتِي تُفْصَدُ فَقُلْتُ فِي نَفْسِي مَا رَأَيْتُ أَمْراً أَعْجَبَ مِنْ هَذَا يَأْمُرُنِي أَنْ أَفْصِدَ فِي وَقْتِ الظُّهْرِ وَ لَيْسَ بِوَقْتِ فَصْدٍ وَ الثَّانِيَةُ عِرْقٌ لَا أَفْهَمُهُ ثُمَّ",
          "قَالَ لِيَ انْتَظِرْ وَ كُنْ فِي الدَّارِ فَلَمَّا أَمْسَى دَعَانِي وَ قَالَ لِي سَرِّحِ الدَّمَ فَسَرَّحْتُ ثُمَّ قَالَ لِي أَمْسِكْ فَأَمْسَكْتُ ثُمَّ قَالَ لِي كُنْ فِي الدَّارِ فَلَمَّا كَانَ نِصْفُ اللَّيْلِ أَرْسَلَ إِلَيَّ وَ قَالَ لِي سَرِّحِ الدَّمَ قَالَ فَتَعَجَّبْتُ أَكْثَرَ مِنْ عَجَبِيَ الْأَوَّلِ وَ كَرِهْتُ أَنْ أَسْأَلَهُ قَالَ فَسَرَّحْتُ فَخَرَجَ دَمٌ أَبْيَضُ كَأَنَّهُ الْمِلْحُ قَالَ ثُمَّ قَالَ لِيَ احْبِسْ قَالَ فَحَبَسْتُ قَالَ ثُمَّ قَالَ كُنْ فِي الدَّارِ ",
          "فَلَمَّا أَصْبَحْتُ أَمَرَ قَهْرَمَانَهُ أَنْ يُعْطِيَنِي ثَلَاثَةَ دَنَانِيرَ فَأَخَذْتُهَا وَ خَرَجْتُ حَتَّى أَتَيْتُ ابْنَ بَخْتِيشُوعَ النَّصْرَانِيَّ فَقَصَصْتُ عَلَيْهِ الْقِصَّةَ قَالَ فَقَالَ لِي وَ اللَّهِ مَا أَفْهَمُ مَا تَقُولُ وَ لَا أَعْرِفُهُ فِي شَيْ‏ءٍ مِنَ الطِّبِّ وَ لَا قَرَأْتُهُ فِي كِتَابٍ وَ لَا أَعْلَمُ فِي دَهْرِنَا أَعْلَمَ بِكُتُبِ النَّصْرَانِيَّةِ مِنْ فُلَانٍ الْفَارِسِيِّ فَاخْرُجْ إِلَيْهِ",
          "قَالَ فَاكْتَرَيْتُ زَوْرَقاً إِلَى الْبَصْرَةِ وَ أَتَيْتُ الْأَهْوَازَ ثُمَّ صِرْتُ إِلَى فَارِسَ إِلَى صَاحِبِي فَأَخْبَرْتُهُ الْخَبَرَ قَالَ وَ قَالَ أَنْظِرْنِي أَيَّاماً فَأَنْظَرْتُهُ ثُمَّ أَتَيْتُهُ مُتَقَاضِياً قَالَ فَقَالَ لِي إِنَّ هَذَا الَّذِي تَحْكِيهِ عَنْ هَذَا الرَّجُلِ فَعَلَهُ الْمَسِيحُ فِي دَهْرِهِ مَرَّةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Al Hassan Bin Al Husayn who said, ‘Muhammad Bin Al Hassan Al Makfouf who said, ",
            "‘Some of our companions narrated to me from some cuppers of Al-Askar (who were) from the Christians and that Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) sent for me one day during the time of Al-Zahor <span class=\"iTxt\">Salat</span> and he said to me, ‘Get cupping done of this vein’, and he<sup>asws</sup> pointed out a vein which I did not understand from the veins which do get cupped. So I said, within myself, ‘I have not seen a matter stranger than this. He<sup>asws</sup> is ordering me that I should get cupping done during this time of Al-Zohr and it isn’t a time for cupping, and secondly it is a vein which I do not recognise’. ",
            "He<sup>asws</sup> said to me: ‘Await and stay in the house’. So when it was evening, he<sup>asws</sup> called me over and said to me: ‘Release the blood’. So I (cut the vein and) released it. Then he<sup>asws</sup> said to me: ‘Withhold!’ So I withheld. Then he<sup>asws</sup> said to me: ‘Stay in the house. So when it was half the night, he<sup>asws</sup> sent for me and said to me: ‘Release the blood’. So I was astounded even more than my first astonishment, and I disliked to ask him<sup>asws</sup>. So I released (the blood) and the blood came out white as if it was salt. Then he<sup>asws</sup> said to me: ‘Withhold!’ So I withheld. Then he<sup>asws</sup> said: ‘Stay in the house’. ",
            "So when we were in the morning, he<sup>asws</sup> ordered his<sup>asws</sup> clerk to give me three Dinars. So I took these and went out until I came to Ibn Bakhtayshou the Christian, and I related to him the story. So he said to me, ‘By Allah<sup>azwj</sup>! I don’t understand what you are saying nor do I recognise it regarding anything from the medicine (treatments), nor have I read it in a book, nor do I know in our times anyone more knowledgeable with the books of the Christians than so and so, the Persian. Therefore, go out to him’.  ",
            "He (the narrator) said, ‘So I hired a boat to Al-Basra, and I went over to Ahvaz, then I came to Persia to my companion and I informed him of the news. He said, ‘Respite me for some days’. So I waited for him, then went over to him requesting. So he said to me, ‘This which you are relating from this man, the Messiah<sup>as</sup> had done it once during his<sup>as</sup> time’."
          ],
          "en.sarwar": [
            " 23. Ali ibn Muhammad has narrated from Muhammad ibn ’Isma‘il ibn Ibrahim ibn Musa ibn Ja‘far ibn Muhammad (a.s.) from Ali ibn ‘Abd al-Ghaffar who has said the following. “When abu Muhammad (a.s.) was imprisoned, the ‘Abbassids, Salih ibn Wasif, Salih ibn Ali and others who were not Shi‘as all came to Salih ibn Wasif asking him to exert more pressure on abu Muhammad (a.s.).Salih told them, “What should I do? I managed to find two people who were of the harshest manners and appointed them to guard him they both turned into most assiduous worshippers in prayers and fasting. When I asked them about their behaviors they replied, “What would you say about a man who fasts every day, worships the whole night and does not speak or busy himself with anything? When we look at him a feeling of trembling and shivering over takes us and we lose control over our own selves.” When they heard this they returned in despair.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/165)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1347,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:25",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا قَالَ كَتَبَ مُحَمَّدُ بْنُ حُجْرٍ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) يَشْكُو عَبْدَ الْعَزِيزِ بْنَ دُلَفَ وَ يَزِيدَ بْنَ عَبْدِ اللَّهِ فَكَتَبَ إِلَيْهِ أَمَّا عَبْدُ الْعَزِيزِ فَقَدْ كُفِيتَهُ وَ أَمَّا يَزِيدُ فَإِنَّ لَكَ وَ لَهُ مَقَاماً بَيْنَ يَدَيِ اللَّهِ فَمَاتَ عَبْدُ الْعَزِيزِ وَ قَتَلَ يَزِيدُ مُحَمَّدَ بْنَ حُجْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from some of our companions who said, ",
            "‘Muhammad Bin Hujr wrote to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) complaining of Abdul Aziz Bin Dulf and Yazeed Bin Abdullah. So he<sup>asws</sup> wrote to him: ‘As for Abdul Aziz, So I shall suffice him<sup>asws</sup>, and as for Yazeed, so for you and for him there is a status in front of Allah<sup>azwj</sup>. So Abdul Aziz died and Yazeed killed Muhammad Bin Hujr’."
          ],
          "en.sarwar": [
            " 24. Ali ibn Muhammad has narrated from al-Hassan ibn al-Husayn who both have said that narrated to us Muhammad ibn al-Hassan al-Makfuf that Certain persons of our people have narrated from a Christian cupping expert who served in the army the following. “One day at noontime abu Muhammad (a.s.) sent for me at the time of noon prayer and told me to perform cupping on this vein. He showed me a vein that was not know to me as one of the veins used for cupping. I thought to myself, “I have not seen anything more strange than this. To perform cupping at noon time which is not the time for it and on a vein that I do not know.” He then told me, “Wait in the house. When it was evening he called me and said, “Open the vein.” I opened the vein. He said, “Hold it” I held the vein and stopped the blood.” He then told me to remain in the house. At might night he called me and said to open the vein. He has said that it increased my astonishment, but I did not like to ask him. I opened the vein and white blood like salt came out. He has said that he told me to stop it and I stopped it. He has said that he told me to remain in the house. In the morning he ordered his clerk to pay me three Dinars. I took the Dinars and left. I then went to see Bakhtishu‘ who was a Christian and told him the whole story. The narrator has said that he said, “By Allah, I do not understand what you say and I do not know anything about medicine. I have not read any such thing in the books. I do not know anyone more knowledgeable in Christianity than so and so, a Persian man. Go to him” He has said that I then hire a boat and went to Basra then to Ahwaz and to Persia to the man I was looking for. I explained to him the story. He has said that he asked me to give him time. I waited for few days and then went to him for an answer. He said, “What you say this man did is something that Jesus had done only once in his life.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/168)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1348,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:26",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا قَالَ سُلِّمَ أَبُو مُحَمَّدٍ ( عليه السلام ) إِلَى نِحْرِيرٍ فَكَانَ يُضَيِّقُ عَلَيْهِ وَ يُؤْذِيهِ قَالَ فَقَالَتْ لَهُ امْرَأَتُهُ وَيْلَكَ اتَّقِ اللَّهَ لَا تَدْرِي مَنْ فِي مَنْزِلِكَ وَ عَرَّفَتْهُ صَلَاحَهُ وَ قَالَتْ إِنِّي أَخَافُ عَلَيْكَ مِنْهُ فَقَالَ لَأَرْمِيَنَّهُ بَيْنَ السِّبَاعِ ثُمَّ فَعَلَ ذَلِكَ بِهِ فَرُئِيَ ( عليه السلام ) قَائِماً يُصَلِّي وَ هِيَ حَوْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from some of our companions who said, ",
            "‘Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) was submitted (for custody) to an animal keeper, and he<sup>asws</sup> was constricting upon him<sup>asws</sup> and was hurting him<sup>asws</sup>. So his wife said to him, ‘Woe be unto you! Fear Allah<sup>azwj</sup>! Do you not know who is in your house?’ And she introduced him<sup>asws</sup> of his<sup>asws</sup> righteousness and she said, ‘I fear upon you from him<sup>asws</sup>’. So he said, ‘I shall throw him<sup>asws</sup> between the predatory animals’. Then he did that with him<sup>asws</sup>, and he<sup>asws</sup> was seen standing praying <span class=\"iTxt\">Salat</span> and they were around him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 25. Ali ibn Muhammad has narrated from certain persons of our people who have narrated the following. “mmd ibn al-Hujr once wrote to abu Muhammad (a.s.) complaining against ‘Abd al-‘Aziz ibn Dulf and Yazid ibn ‘Abdallah. He wrote back in reply, “As far as ‘Abd al-‘Aziz is concerned I have relieved you from his troubles. As far as Yazid is concerned for each of you there is position before Allah.” ‘Abd al-‘Aziz died and Yazid killed Muhammad ibn Hujr.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/168)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1349,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:124:27",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ إِسْحَاقَ قَالَ دَخَلْتُ عَلَى أَبِي مُحَمَّدٍ ( عليه السلام ) فَسَأَلْتُهُ أَنْ يَكْتُبَ لِأَنْظُرَ إِلَى خَطِّهِ فَأَعْرِفَهُ إِذَا وَرَدَ فَقَالَ نَعَمْ ثُمَّ قَالَ يَا أَحْمَدُ إِنَّ الْخَطَّ سَيَخْتَلِفُ عَلَيْكَ مِنْ بَيْنِ الْقَلَمِ الْغَلِيظِ إِلَى الْقَلَمِ الدَّقِيقِ فَلَا تَشُكَّنَّ",
          "ثُمَّ دَعَا بِالدَّوَاةِ فَكَتَبَ وَ جَعَلَ يَسْتَمِدُّ إِلَى مَجْرَى الدَّوَاةِ فَقُلْتُ فِي نَفْسِي وَ هُوَ يَكْتُبُ أَسْتَوْهِبُهُ الْقَلَمَ الَّذِي كَتَبَ بِهِ فَلَمَّا فَرَغَ مِنَ الْكِتَابَةِ أَقْبَلَ يُحَدِّثُنِي وَ هُوَ يَمْسَحُ الْقَلَمَ بِمِنْدِيلِ الدَّوَاةِ سَاعَةً ثُمَّ قَالَ هَاكَ يَا أَحْمَدُ فَنَاوَلَنِيهِ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنِّي مُغْتَمٌّ لِشَيْ‏ءٍ يُصِيبُنِي فِي نَفْسِي وَ قَدْ أَرَدْتُ أَنْ أَسْأَلَ أَبَاكَ فَلَمْ يُقْضَ لِي ذَلِكَ فَقَالَ وَ مَا هُوَ يَا أَحْمَدُ ",
          "فَقُلْتُ يَا سَيِّدِي رُوِيَ لَنَا عَنْ آبَائِكَ أَنَّ نَوْمَ الْأَنْبِيَاءِ عَلَى أَقْفِيَتِهِمْ وَ نَوْمَ الْمُؤْمِنِينَ عَلَى أَيْمَانِهِمْ وَ نَوْمَ الْمُنَافِقِينَ عَلَى شَمَائِلِهِمْ وَ نَوْمَ الشَّيَاطِينِ عَلَى وُجُوهِهِمْ فَقَالَ ( عليه السلام ) كَذَلِكَ هُوَ",
          "فَقُلْتُ يَا سَيِّدِي فَإِنِّي أَجْهَدُ أَنْ أَنَامَ عَلَى يَمِينِي فَمَا يُمْكِنُنِي وَ لَا يَأْخُذُنِي النَّوْمُ عَلَيْهَا فَسَكَتَ سَاعَةً ثُمَّ قَالَ يَا أَحْمَدُ ادْنُ مِنِّي فَدَنَوْتُ مِنْهُ فَقَالَ أَدْخِلْ يَدَكَ تَحْتَ ثِيَابِكَ فَأَدْخَلْتُهَا فَأَخْرَجَ يَدَهُ مِنْ تَحْتِ ثِيَابِهِ وَ أَدْخَلَهَا تَحْتَ ثِيَابِي فَمَسَحَ بِيَدِهِ الْيُمْنَى عَلَى جَانِبِي الْأَيْسَرِ وَ بِيَدِهِ الْيُسْرَى عَلَى جَانِبِي الْأَيْمَنِ ثَلَاثَ مَرَّاتٍ ",
          "فَقَالَ أَحْمَدُ فَمَا أَقْدِرُ أَنْ أَنَامَ عَلَى يَسَارِي مُنْذُ فَعَلَ ذَلِكَ بِي ( عليه السلام ) وَ مَا يَأْخُذُنِي نَوْمٌ عَلَيْهَا أَصْلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Is’haq who said, ",
            "‘I went over to Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) and I asked him<sup>asws</sup> to write (something) in order to me to look at his<sup>asws</sup> handwriting so that I would recognise it when I come across it. So he<sup>asws</sup> said: ‘Yes’. Then he<sup>asws</sup> said: ‘O Ahmad! The handwriting would be different upon you from between the thin pen and the thick pen, therefore do not be doubting’. ",
            "Then he<sup>asws</sup> called for the ink, and he<sup>asws</sup> wrote, and went on taking it to flow the ink. So I said within myself, ‘And he<sup>asws</sup> is writing, I shall ask him<sup>asws</sup> to gift me the pen which he<sup>asws</sup> is writing with’. So when he<sup>asws</sup> was free from the writing, he<sup>asws</sup> turned to discuss with me and he<sup>asws</sup> was wiped the ink from the pen with a towel for a while, then said: ‘Here, O Ahmad!’ And he<sup>asws</sup> gave it to me. So I said, ‘May I be sacrificed for you<sup>asws</sup>! I am gloomy due to something which has hit me within myself and I had intended to ask your<sup>asws</sup> father<sup>asws</sup>, but that did not happen for me’. So he<sup>asws</sup> said: ‘And what is it, O Ahmad?’.",
            "So I said, ‘O my Master<sup>asws</sup>! It is reported to us from your<sup>asws</sup> forefathers<sup>asws</sup> that the sleep of the Prophets<sup>as</sup> is upon their<sup>as</sup> backs, and the sleep of the Momineen is upon their right, and the sleep of the hypocrites is upon their left, and the sleep of the Satans<sup>la</sup> is upon their faces’. So he<sup>asws</sup> said: ‘It is like that’. ",
            "I said, ‘O my Master<sup>asws</sup>! But I try to sleep upon my right, but I am not able to and the sleep does not seize me upon it’. So he<sup>asws</sup> remained silent for a while, then said: ‘O Ahmad! Come near me<sup>asws</sup>’. So I went near him<sup>asws</sup>, and he<sup>asws</sup> said: ‘Insert your hand beneath your clothes’. So I inserted it, and he<sup>asws</sup> extracted his<sup>asws</sup> hand from beneath his<sup>asws</sup> clothes and inserted it beneath my Clothes. So he<sup>asws</sup> wipes his<sup>asws</sup> right hand upon my left side and his<sup>asws</sup> left hand upon my right side, three times. ",
            "Ahmad said, ‘So I have not been able upon sleeping upon my left since he<sup>asws</sup> did that with me, and the sleep does not seize me upon it at all’."
          ],
          "en.sarwar": [
            " 26. Ail Muhammad has narrated from certain persons of our people saying as follows. “Abu Muhammad (a.s.) was placed under the supervision of a zoo-keeper who would cause constraints suffering to him. He has said that his wife told him, “woe is you, be pious before Allah. Do you not know who is in your house?” She then explained to him the good manners of the Imam (a.s.) and said, “I am afraid for you from him.” He then said, “I can throw him to the beasts.” He inf act, did so and the Imam (a.s.) was seeing standing among them for prayer and the beast circled around him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/169)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "part_type": "Hadith",
        "text": [
          " 27ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ إِسْحَاقَ قَالَ دَخَلْتُ عَلَى أَبِي مُحَمَّدٍ (عَلَيْهِ السَّلام) فَسَأَلْتُهُ أَنْ يَكْتُبَ لانْظُرَ إِلَى خَطِّهِ فَأَعْرِفَهُ إِذَا وَرَدَ فَقَالَ نَعَمْ ثُمَّ قَالَ يَا أَحْمَدُ إِنَّ الْخَطَّ سَيَخْتَلِفُ عَلَيْكَ مِنْ بَيْنِ الْقَلَمِ الْغَلِيظِ إِلَى الْقَلَمِ الدَّقِيقِ فَلا تَشُكَّنَّ ثُمَّ دَعَا بِالدَّوَاةِ فَكَتَبَ وَجَعَلَ يَسْتَمِدُّ إِلَى مَجْرَى الدَّوَاةِ فَقُلْتُ فِي نَفْسِي وَهُوَ يَكْتُبُ أَسْتَوْهِبُهُ الْقَلَمَ الَّذِي كَتَبَ بِهِ فَلَمَّا فَرَغَ مِنَ الْكِتَابَةِ أَقْبَلَ يُحَدِّثُنِي وَهُوَ يَمْسَحُ الْقَلَمَ بِمِنْدِيلِ الدَّوَاةِ سَاعَةً ثُمَّ قَالَ هَاكَ يَا أَحْمَدُ فَنَاوَلَنِيهِ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنِّي مُغْتَمٌّ لِشَيْ‏ءٍ يُصِيبُنِي فِي نَفْسِي وَقَدْ أَرَدْتُ أَنْ أَسْأَلَ أَبَاكَ فَلَمْ يُقْضَ لِي ذَلِكَ فَقَالَ وَمَا هُوَ يَا أَحْمَدُ فَقُلْتُ يَا سَيِّدِي رُوِيَ لَنَا عَنْ آبَائِكَ أَنَّ نَوْمَ الانْبِيَاءِ عَلَى أَقْفِيَتِهِمْ وَنَوْمَ الْمُؤْمِنِينَ عَلَى أَيْمَانِهِمْ وَنَوْمَ الْمُنَافِقِينَ عَلَى شَمَائِلِهِمْ وَنَوْمَ الشَّيَاطِينِ عَلَى وُجُوهِهِمْ فَقَالَ (عَلَيْهِ السَّلام) كَذَلِكَ هُوَ فَقُلْتُ يَا سَيِّدِي فَإِنِّي أَجْهَدُ أَنْ أَنَامَ عَلَى يَمِينِي فَمَا يُمْكِنُنِي وَلا يَأْخُذُنِي النَّوْمُ عَلَيْهَا فَسَكَتَ سَاعَةً ثُمَّ قَالَ يَا أَحْمَدُ ادْنُ مِنِّي فَدَنَوْتُ مِنْهُ فَقَالَ أَدْخِلْ يَدَكَ تَحْتَ ثِيَابِكَ فَأَدْخَلْتُهَا فَأَخْرَجَ يَدَهُ مِنْ تَحْتِ ثِيَابِهِ وَأَدْخَلَهَا تَحْتَ ثِيَابِي فَمَسَحَ بِيَدِهِ الْيُمْنَى عَلَى جَانِبِي الايْسَرِ وَبِيَدِهِ الْيُسْرَى عَلَى جَانِبِي الايْمَنِ ثَلاثَ مَرَّاتٍ فَقَالَ أَحْمَدُ فَمَا أَقْدِرُ أَنْ أَنَامَ عَلَى يَسَارِي مُنْذُ فَعَلَ ذَلِكَ بِي (عَلَيْهِ السَّلام) وَمَا يَأْخُذُنِي نَوْمٌ عَلَيْهَا أَصْلاً."
        ],
        "translations": {
          "en.sarwar": [
            " 27. Muhammad ibn Yahya has narrated from Ahmad ibn Ishaq who has said the following. “Once I went to see abu Muhammad (a.s.) and asked him to write for me few lines so that whenever I would see his hand writing I would recognize it. The Imam (a.s.) said, “Yes, and then said, “O Ahmad the writing with a fine pen and with thick pen will look different to you. Do not have doubts He then asked for a pen and ink pot and began writing. He would make the pen to have ink from the bottom of the ink pot. I thought to myself when he was writing, “I will request him to gift me the pen with which he is writing.” When he finished writing he turned to me and began speaking while he was wiping the pen with the handkerchief of the ink pot for a while and then said, “Here, O Ahmad it is for you.” He gave it to me. I then said, may Allah take my soul in service for your cause, I am sad about something that is in my soul. I wanted to ask your father about it but I did not have the chance. He asked, “What is it, O Ahmad?” I said, “My master, it is narrated to us from your holy ancestors that the prophet sleep on their backs, the true believers sleep on their right side, the hypocrites sleep on their left side and Satans sleep on their belly.” He (a.s.) said, “That is how it is.” I then said, “My master I struggle to sleep on my right side abut I can not do so and I do not go to sleep on my right side.” He remained quite for a while and then said, “O Ahmad, come close to me.” I went close to him and he said, “put your hand hand under your clothes.” I did so. He then took his hand from under his clothes and place under my clothes. He wiped with his right hand my left side and with his left hand my right side three times. Ahmad has said that ever since I have not been able to sleep on my left side and can not go to sleep on my left side.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:124",
  "kind": "verse_list"
}