{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 125"
        },
        "path": "/books/al-kafi:1:4:125",
        "titles": {
          "ar": "باب مَوْلِدِ الصَّاحِبِ ( عليه السلام )",
          "en": "Chapter 125 –Arrival of the Master<sup>asws</sup>"
        }
      }
    ],
    "index": 183,
    "local_index": 125,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 126"
        },
        "path": "/books/al-kafi:1:4:126",
        "titles": {
          "ar": "باب مَا جَاءَ فِي الِاثْنَيْ عَشَرَ وَ النَّصِّ عَلَيْهِمْ ( عليهم السلام )",
          "en": "Chapter 126 – What has come regarding the twelve and the text upon them<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 124"
        },
        "path": "/books/al-kafi:1:4:124",
        "titles": {
          "ar": "باب مَوْلِدِ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيٍّ ( عليه السلام )",
          "en": "Chapter 124 –Arrival of Abu Muhammad Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:125",
    "titles": {
      "ar": "باب مَوْلِدِ الصَّاحِبِ ( عليه السلام )",
      "en": "Chapter 125 –Arrival of the Master<sup>asws</sup>"
    },
    "verse_count": 31,
    "verse_start_index": 1349,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1350,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/146",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/64",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:1",
        "text": [
          " خَرَجَ عَنْ أَبِي مُحَمَّدٍ ( عليه السلام ) حِينَ قُتِلَ الزُّبَيْرِيُّ هَذَا جَزَاءُ مَنِ افْتَرَى عَلَى اللَّهِ فِي أَوْلِيَائِهِ زَعَمَ أَنَّهُ يَقْتُلُنِي وَ لَيْسَ لِي عَقِبٌ فَكَيْفَ رَأَى قُدْرَةَ اللَّهِ وَ وُلِدَ لَهُ وَلَدٌ سَمَّاهُ م‏ح‏م‏د سَنَةَ سِتٍّ وَ خَمْسِينَ وَ مِائَتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Ahmad Bin Muhammad who said, ",
            "‘There came out (a letter) from Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) when Al-Zubeyri was killed: ‘This is the Recompense of the one who forges (a lie) upon Allah<sup>azwj</sup> regarding His<sup>azwj</sup> Guardians<sup>asws</sup>. He<sup>asws</sup> claimed that he would be killing me<sup>asws</sup> and that there isn’t a posterity for me<sup>asws</sup>. So how does he see the Power of Allah<sup>azwj</sup>?’ And there he<sup>asws</sup> was Blessed with a son<sup>asws</sup>. He<sup>asws</sup> named him<sup>asws</sup> As M H M D, in the year two hundred and fifty six (256 A.H.)’."
          ],
          "en.sarwar": [
            " He was born on fifteenth of the month of Sha‘ban in the year two hundred fifty five AH."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (171/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1351,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/262",
              "text": "مُحَمَّدٌ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1480",
              "text": "الْحَسَنُ ابْنَا عَلِيِّ بْنِ إِبْرَاهِيمَ فِي سَنَةِ تِسْعٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1481",
              "text": "سَبْعِينَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1482",
              "text": "مِائَتَيْنِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي مُحَمَّدٌ وَ الْحَسَنُ ابْنَا عَلِيِّ بْنِ إِبْرَاهِيمَ فِي سَنَةِ تِسْعٍ وَ سَبْعِينَ وَ مِائَتَيْنِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:2",
        "text": [
          "ا حَدَّثَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ عَبْدِ الرَّحْمَنِ الْعَبْدِيُّ مِنْ عَبْدِ قَيْسٍ عَنْ ضَوْءِ بْنِ عَلِيٍّ الْعِجْلِيِّ عَنْ رَجُلٍ مِنْ أَهْلِ فَارِسَ سَمَّاهُ قَالَ أَتَيْتُ سُرَّ مَنْ رَأَى وَ لَزِمْتُ بَابَ أَبِي مُحَمَّدٍ ( عليه السلام ) فَدَعَانِي مِنْ غَيْرِ أَنْ أَسْتَأْذِنَ فَلَمَّا دَخَلْتُ وَ سَلَّمْتُ قَالَ لِي يَا أَبَا فُلَانٍ كَيْفَ حَالُكَ ثُمَّ قَالَ لِي اقْعُدْ يَا فُلَانُ ثُمَّ سَأَلَنِي عَنْ جَمَاعَةٍ مِنْ رِجَالٍ وَ نِسَاءٍ مِنْ أَهْلِي ",
          "ثُمَّ قَالَ لِي مَا الَّذِي أَقْدَمَكَ قُلْتُ رَغْبَةٌ فِي خِدْمَتِكَ قَالَ فَقَالَ فَالْزَمِ الدَّارَ قَالَ فَكُنْتُ فِي الدَّارِ مَعَ الْخَدَمِ ثُمَّ صِرْتُ أَشْتَرِي لَهُمُ الْحَوَائِجَ مِنَ السُّوقِ وَ كُنْتُ أَدْخُلُ عَلَيْهِ مِنْ غَيْرِ إِذْنٍ إِذَا كَانَ فِي دَارِ الرِّجَالِ",
          "فَدَخَلْتُ عَلَيْهِ يَوْماً وَ هُوَ فِي دَارِ الرِّجَالِ فَسَمِعْتُ حَرَكَةً فِي الْبَيْتِ فَنَادَانِي مَكَانَكَ لَا تَبْرَحْ فَلَمْ أَجْسُرْ أَنْ أَخْرُجَ وَ لَا أَدْخُلَ فَخَرَجَتْ عَلَيَّ جَارِيَةٌ مَعَهَا شَيْ‏ءٌ مُغَطًّى ثُمَّ نَادَانِيَ ادْخُلْ فَدَخَلْتُ وَ نَادَى الْجَارِيَةَ فَرَجَعَتْ فَقَالَ لَهَا اكْشِفِي عَمَّا مَعَكِ فَكَشَفَتْ عَنْ غُلَامٍ أَبْيَضَ حَسَنِ الْوَجْهِ وَ كَشَفَتْ عَنْ بَطْنِهِ فَإِذَا شَعْرٌ نَابِتٌ مِنْ لَبَّتِهِ إِلَى سُرَّتِهِ أَخْضَرُ لَيْسَ بِأَسْوَدَ فَقَالَ هَذَا صَاحِبُكُمْ",
          "ثُمَّ أَمَرَهَا فَحَمَلَتْهُ فَمَا رَأَيْتُهُ بَعْدَ ذَلِكَ حَتَّى مَضَى أَبُو مُحَمَّدٍ ( عليه السلام ) ",
          "فَقَالَ ضَوْءُ بْنُ عَلِيٍّ فَقُلْتُ لِلْفَارِسِيِّ كَمْ كُنْتَ تُقَدِّرُ لَهُ مِنَ السِّنِينَ قَالَ سَنَتَيْنِ قَالَ الْعَبْدِيُّ فَقُلْتُ لِضَوْءٍ كَمْ تُقَدِّرُ لَهُ أَنْتَ قَالَ أَرْبَعَ عَشْرَةَ سَنَةً قَالَ أَبُو عَلِيٍّ وَ أَبُو عَبْدِ اللَّهِ وَ نَحْنُ نُقَدِّرُ لَهُ إِحْدَى وَ عِشْرِينَ سَنَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad said, ‘Muhammad and Al Hassan, the two sons of Ali Bin Ibrahim narrated to me in the year two hundred and seventy nine, saying, ‘Muhammad Bin Ali Bin Abdul Rahman Al Abady narrated to us from Abd Qays, from Zou Bin Ali Al Ijaly, from a man from the peope of Persia he named, saying, ",
            "‘I came to Surmanrayy (Samarrah) and I necessitated the door of Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>). So he<sup>asws</sup> called me over without my seeking permission. So when I entered and greeted, he<sup>asws</sup> said to me, ‘O Abu so and so! How are you?’ Then he<sup>asws</sup> said to me: ‘Be seated, O so and so!’. Then he<sup>asws</sup> asked me about a group of men and women from my family members.",
            "Then he<sup>asws</sup> said to me: ‘What is that which made you come?’ I said, ‘A desire to be in your<sup>asws</sup> service’. So he<sup>asws</sup> said: ‘Necessitate the house (be a doorman)’. So I necessitated to be at the door, and I used to be in the house along with the servant. Then I would go to buy the necessaries for them from the market, and I used to go over to him<sup>asws</sup> from without (seeking) a permission when he<sup>asws</sup> was in the chamber for the men. ",
            "One day, I went to him<sup>asws</sup> and he<sup>asws</sup> was in the chamber for the men, and I heard movement in the house, and he<sup>asws</sup> called out: ‘Be in your place, do not depart!’ So I did not have the audacity to exit nor enter. Then a maid came out to me, and there was something covered with her. Then he<sup>asws</sup> called me: ‘Enter!’. So I entered, and he<sup>asws</sup> called the maid, so she returned, and he<sup>asws</sup> said to her: ‘Uncover from what is with you’. So she uncovered from a white boy<sup>asws</sup>, beautiful of face, and uncovered from his<sup>asws</sup> belly, and there was a growth of green hair from his chest to his<sup>asws</sup> navel, not black, and he<sup>asws</sup> said: ‘This is your Master<sup>asws</sup>’. ",
            "Then he<sup>asws</sup> ordered her, so she carried him<sup>asws</sup>, and I did not see him<sup>asws</sup> after that until Abu Muhammad<sup>asws</sup> passed away. ",
            "Zou Bin Ali said, ‘I said to the Persian, ‘How much did you serve for him<sup>asws</sup> from the years?’ He said, ‘Two years’. Al-Abdy said, ‘I said to Zou, ‘How much did you serve him<sup>asws</sup>?’ He said, ‘Fourteen years’. Abu Ali and Abu Abdullah said, ‘And we served him<sup>asws</sup> for twenty-one years’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad al-Ash‘ari has narrated from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad who has said the following. “When al-Zabayri was killed this letter came from abu Muhammad (a.s.). ‘Such as this is the retribution for those who lie against Allah in the matters of those who possess authority from Him. He thought that he will kill me and I will leave no children behind. How then he has experienced the power of Allah? “ A child was born to him -that he named M.H.M.D- in the year two hundred fifty six AH.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/172)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1352,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1483",
              "text": "عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا الْقُمِّيِّينَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1484",
              "text": "مُحَمَّدِ بْنِ مُحَمَّدٍ الْعَامِرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1485",
              "text": "أَبِي سَعِيدٍ غَانِمٍ الْهِنْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ وَ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا الْقُمِّيِّينَ عَنْ مُحَمَّدِ بْنِ مُحَمَّدٍ الْعَامِرِيِّ عَنْ أَبِي سَعِيدٍ غَانِمٍ الْهِنْدِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:3",
        "text": [
          " كُنْتُ بِمَدِينَةِ الْهِنْدِ الْمَعْرُوفَةِ بِقِشْمِيرَ الدَّاخِلَةِ وَ أَصْحَابٌ لِي يَقْعُدُونَ عَلَى كَرَاسِيَّ عَنْ يَمِينِ الْمَلِكِ أَرْبَعُونَ رَجُلًا كُلُّهُمْ يَقْرَأُ الْكُتُبَ الْأَرْبَعَةَ التَّوْرَاةَ وَ الْإِنْجِيلَ وَ الزَّبُورَ وَ صُحُفَ إِبْرَاهِيمَ نَقْضِي بَيْنَ النَّاسِ وَ نُفَقِّهُهُمْ فِي دِينِهِمْ وَ نُفْتِيهِمْ فِي حَلَالِهِمْ وَ حَرَامِهِمْ يَفْزَعُ النَّاسُ إِلَيْنَا الْمَلِكُ فَمَنْ دُونَهُ",
          "فَتَجَارَيْنَا ذِكْرَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقُلْنَا هَذَا النَّبِيُّ الْمَذْكُورُ فِي الْكُتُبِ قَدْ خَفِيَ عَلَيْنَا أَمْرُهُ وَ يَجِبُ عَلَيْنَا الْفَحْصُ عَنْهُ وَ طَلَبُ أَثَرِهِ وَ اتَّفَقَ رَأْيُنَا وَ تَوَافَقْنَا عَلَى أَنْ أَخْرُجَ فَأَرْتَادَ لَهُمْ فَخَرَجْتُ وَ مَعِي مَالٌ جَلِيلٌ فَسِرْتُ اثْنَيْ عَشَرَ شَهْراً حَتَّى قَرُبْتُ مِنْ كَابُلَ فَعَرَضَ لِي قَوْمٌ مِنَ التُّرْكِ فَقَطَعُوا عَلَيَّ وَ أَخَذُوا مَالِي وَ جُرِحْتُ جِرَاحَاتٍ شَدِيدَةً وَ دُفِعْتُ إِلَى مَدِينَةِ كَابُلَ فَأَنْفَذَنِي مَلِكُهَا",
          "لَمَّا وَقَفَ عَلَى خَبَرِي إِلَى مَدِينَةِ بَلْخَ وَ عَلَيْهَا إِذْ ذَاكَ دَاوُدُ بْنُ الْعَبَّاسِ بْنِ أَبِي الْأَسْوَدِ فَبَلَغَهُ خَبَرِي وَ أَنِّي خَرَجْتُ مُرْتَاداً مِنَ الْهِنْدِ وَ تَعَلَّمْتُ الْفَارِسِيَّةَ وَ نَاظَرْتُ الْفُقَهَاءَ وَ أَصْحَابَ الْكَلَامِ فَأَرْسَلَ إِلَيَّ دَاوُدُ بْنُ الْعَبَّاسِ فَأَحْضَرَنِي مَجْلِسَهُ وَ جَمَعَ عَلَيَّ الْفُقَهَاءَ فَنَاظَرُونِي فَأَعْلَمْتُهُمْ أَنِّي خَرَجْتُ مِنْ بَلَدِي أَطْلُبُ هَذَا النَّبِيَّ الَّذِي وَجَدْتُهُ فِي الْكُتُبِ",
          "فَقَالَ لِي مَنْ هُوَ وَ مَا اسْمُهُ فَقُلْتُ مُحَمَّدٌ فَقَالُوا هُوَ نَبِيُّنَا الَّذِي تَطْلُبُ فَسَأَلْتُهُمْ عَنْ شَرَائِعِهِ فَأَعْلَمُونِي فَقُلْتُ لَهُمْ أَنَا أَعْلَمُ أَنَّ مُحَمَّداً نَبِيٌّ وَ لَا أَعْلَمُهُ هَذَا الَّذِي تَصِفُونَ أَمْ لَا فَأَعْلِمُونِي مَوْضِعَهُ لِأَقْصِدَهُ فَأُسَائِلَهُ عَنْ عَلَامَاتٍ عِنْدِي وَ دَلَالَاتٍ فَإِنْ كَانَ صَاحِبِيَ الَّذِي طَلَبْتُ آمَنْتُ بِهِ",
          "فَقَالُوا قَدْ مَضَى ( صلى الله عليه وآله ) فَقُلْتُ فَمَنْ وَصِيُّهُ وَ خَلِيفَتُهُ فَقَالُوا أَبُو بَكْرٍ قُلْتُ فَسَمُّوهُ لِي فَإِنَّ هَذِهِ كُنْيَتُهُ قَالُوا عَبْدُ اللَّهِ بْنُ عُثْمَانَ وَ نَسَبُوهُ إِلَى قُرَيْشٍ قُلْتُ فَانْسُبُوا لِي مُحَمَّداً نَبِيَّكُمْ فَنَسَبُوهُ لِي فَقُلْتُ لَيْسَ هَذَا صَاحِبِيَ الَّذِي طَلَبْتُ صَاحِبِيَ الَّذِي أَطْلُبُهُ خَلِيفَتُهُ أَخُوهُ فِي الدِّينِ وَ ابْنُ عَمِّهِ فِي النَّسَبِ وَ زَوْجُ ابْنَتِهِ وَ أَبُو وُلْدِهِ لَيْسَ لِهَذَا النَّبِيِّ ذُرِّيَّةٌ عَلَى الْأَرْضِ غَيْرُ وُلْدِ هَذَا الرَّجُلِ الَّذِي هُوَ خَلِيفَتُهُ",
          "قَالَ فَوَثَبُوا بِي وَ قَالُوا أَيُّهَا الْأَمِيرُ إِنَّ هَذَا قَدْ خَرَجَ مِنَ الشِّرْكِ إِلَى الْكُفْرِ هَذَا حَلَالُ الدَّمِ فَقُلْتُ لَهُمْ يَا قَوْمُ أَنَا رَجُلٌ مَعِي دِينٌ مُتَمَسِّكٌ بِهِ لَا أُفَارِقُهُ حَتَّى أَرَى مَا هُوَ أَقْوَى مِنْهُ إِنِّي وَجَدْتُ صِفَةَ هَذَا الرَّجُلِ فِي الْكُتُبِ الَّتِي أَنْزَلَهَا اللَّهُ عَلَى أَنْبِيَائِهِ وَ إِنَّمَا خَرَجْتُ مِنْ بِلَادِ الْهِنْدِ وَ مِنَ الْعِزِّ الَّذِي كُنْتُ فِيهِ طَلَباً لَهُ فَلَمَّا فَحَصْتُ عَنْ أَمْرِ صَاحِبِكُمُ الَّذِي ذَكَرْتُمْ لَمْ يَكُنِ النَّبِيَّ الْمَوْصُوفَ فِي الْكُتُبِ فَكَفُّوا عَنِّي",
          "وَ بَعَثَ الْعَامِلُ إِلَى رَجُلٍ يُقَالُ لَهُ الْحُسَيْنُ بْنُ إِشْكِيبَ فَدَعَاهُ فَقَالَ لَهُ نَاظِرْ هَذَا الرَّجُلَ الْهِنْدِيَّ فَقَالَ لَهُ الْحُسَيْنُ أَصْلَحَكَ اللَّهُ عِنْدَكَ الْفُقَهَاءُ وَ الْعُلَمَاءُ وَ هُمْ أَعْلَمُ وَ أَبْصَرُ بِمُنَاظَرَتِهِ فَقَالَ لَهُ نَاظِرْهُ كَمَا أَقُولُ لَكَ وَ اخْلُ بِهِ وَ الْطُفْ لَهُ",
          "فَقَالَ لِيَ الْحُسَيْنُ بْنُ إِشْكِيبَ بَعْدَ مَا فَاوَضْتُهُ إِنَّ صَاحِبَكَ الَّذِي تَطْلُبُهُ هُوَ النَّبِيُّ الَّذِي وَصَفَهُ هَؤُلَاءِ وَ لَيْسَ الْأَمْرُ فِي خَلِيفَتِهِ كَمَا قَالُوا هَذَا النَّبِيُّ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْمُطَّلِبِ وَ وَصِيُّهُ عَلِيُّ بْنُ أَبِي طَالِبِ بْنِ عَبْدِ الْمُطَّلِبِ وَ هُوَ زَوْجُ فَاطِمَةَ بِنْتِ مُحَمَّدٍ وَ أَبُو الْحَسَنِ وَ الْحُسَيْنِ سِبْطَيْ مُحَمَّدٍ ( صلى الله عليه وآله )",
          "قَالَ غَانِمٌ أَبُو سَعِيدٍ فَقُلْتُ اللَّهُ أَكْبَرُ هَذَا الَّذِي طَلَبْتُ فَانْصَرَفْتُ إِلَى دَاوُدَ بْنِ الْعَبَّاسِ فَقُلْتُ لَهُ أَيُّهَا الْأَمِيرُ وَجَدْتُ مَا طَلَبْتُ وَ أَنَا أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ قَالَ فَبَرَّنِي وَ وَصَلَنِي وَ قَالَ لِلْحُسَيْنِ تَفَقَّدْهُ قَالَ فَمَضَيْتُ إِلَيْهِ حَتَّى آنَسْتُ بِهِ وَ فَقَّهَنِي فِيمَا احْتَجْتُ إِلَيْهِ مِنَ الصَّلَاةِ وَ الصِّيَامِ وَ الْفَرَائِضِ",
          "قَالَ فَقُلْتُ لَهُ إِنَّا نَقْرَأُ فِي كُتُبِنَا أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) خَاتَمُ النَّبِيِّينَ لَا نَبِيَّ بَعْدَهُ وَ أَنَّ الْأَمْرَ مِنْ بَعْدِهِ إِلَى وَصِيِّهِ وَ وَارِثِهِ وَ خَلِيفَتِهِ مِنْ بَعْدِهِ ثُمَّ إِلَى الْوَصِيِّ بَعْدَ الْوَصِيِّ لَا يَزَالُ أَمْرُ اللَّهِ جَارِياً فِي أَعْقَابِهِمْ حَتَّى تَنْقَضِيَ الدُّنْيَا فَمَنْ وَصِيُّ وَصِيِّ مُحَمَّدٍ قَالَ الْحَسَنُ ثُمَّ الْحُسَيْنُ ابْنَا مُحَمَّدٍ ( صلى الله عليه وآله ) ثُمَّ سَاقَ الْأَمْرَ فِي الْوَصِيَّةِ حَتَّى انْتَهَى إِلَى صَاحِبِ الزَّمَانِ ( عليه السلام ) ",
          "أَعْلَمَنِي مَا حَدَثَ فَلَمْ يَكُنْ لِي هِمَّةٌ إِلَّا طَلَبُ النَّاحِيَةِ فَوَافَى قُمَّ وَ قَعَدَ مَعَ أَصْحَابِنَا فِي سَنَةِ أَرْبَعٍ وَ سِتِّينَ وَ مِائَتَيْنِ وَ خَرَجَ مَعَهُمْ حَتَّى وَافَى بَغْدَادَ وَ مَعَهُ رَفِيقٌ لَهُ مِنْ أَهْلِ السِّنْدِ كَانَ صَحِبَهُ عَلَى الْمَذْهَبِ",
          "ثُمَّ قَالَ فَحَدَّثَنِي غَانِمٌ قَالَ وَ أَنْكَرْتُ مِنْ رَفِيقِي بَعْضَ أَخْلَاقِهِ فَهَجَرْتُهُ وَ خَرَجْتُ حَتَّى سِرْتُ إِلَى الْعَبَّاسِيَّةِ أَتَهَيَّأُ لِلصَّلَاةِ وَ أُصَلِّي وَ إِنِّي لَوَاقِفٌ مُتَفَكِّرٌ فِيمَا قَصَدْتُ لِطَلَبِهِ إِذَا أَنَا بِآتٍ قَدْ أَتَانِي فَقَالَ أَنْتَ فُلَانٌ اسْمُهُ بِالْهِنْدِ فَقُلْتُ نَعَمْ فَقَالَ أَجِبْ مَوْلَاكَ فَمَضَيْتُ مَعَهُ فَلَمْ يَزَلْ يَتَخَلَّلُ بِيَ الطُّرُقَ حَتَّى أَتَى دَاراً وَ بُسْتَاناً فَإِذَا أَنَا بِهِ ( عليه السلام ) جَالِسٌ",
          "فَقَالَ مَرْحَباً يَا فُلَانُ بِكَلَامِ الْهِنْدِ كَيْفَ حَالُكَ وَ كَيْفَ خَلَّفْتَ فُلَاناً وَ فُلَاناً حَتَّى عَدَّ الْأَرْبَعِينَ كُلَّهُمْ فَسَأَلَنِي عَنْهُمْ وَاحِداً وَاحِداً ثُمَّ أَخْبَرَنِي بِمَا تَجَارَيْنَا كُلُّ ذَلِكَ بِكَلَامِ الْهِنْدِ ثُمَّ قَالَ أَرَدْتَ أَنْ تَحُجَّ مَعَ أَهْلِ قُمَّ قُلْتُ نَعَمْ يَا سَيِّدِي فَقَالَ لَا تَحُجَّ مَعَهُمْ وَ انْصَرِفْ سَنَتَكَ هَذِهِ وَ حُجَّ فِي قَابِلٍ",
          "ثُمَّ أَلْقَى إِلَيَّ صُرَّةً كَانَتْ بَيْنَ يَدَيْهِ فَقَالَ لِيَ اجْعَلْهَا نَفَقَتَكَ وَ لَا تَدْخُلْ إِلَى بَغْدَادَ إِلَى فُلَانٍ سَمَّاهُ وَ لَا تُطْلِعْهُ عَلَى شَيْ‏ءٍ وَ انْصَرِفْ إِلَيْنَا إِلَى الْبَلَدِ ",
          "ثُمَّ وَافَانَا بَعْضُ الْفُيُوجِ فَأَعْلَمُونَا أَنَّ أَصْحَابَنَا انْصَرَفُوا مِنَ الْعَقَبَةِ وَ مَضَى نَحْوَ خُرَاسَانَ فَلَمَّا كَانَ فِي قَابِلٍ حَجَّ وَ أَرْسَلَ إِلَيْنَا بِهَدِيَّةٍ مِنْ طُرَفِ خُرَاسَانَ فَأَقَامَ بِهَا مُدَّةً ثُمَّ مَاتَ رَحِمَهُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and from someone else from our companions of Qumm, from Muhammad Bin Muhammad Al Aamiry, from Abu Saeed Ghanim the Indian who said, ",
            "‘I was (living) in the city of India well known as Kashmeer, in the interior, and companions of mine used to sit upon chairs on the right of the king. These were forty men, all of them having read the four Books, the Torah, and the Evangel, and the Psalms, and the Parchment of Ibrahim<sup>as</sup>. We would judge between the people and we would give them understanding in their religion, and give them the understanding of their permissible and their prohibitions. The people would come to us, then king and the ones besides him.  ",
            "So we flowed the mention of Rasool-Allah<sup>saww</sup> and we said, ‘This Prophet<sup>saww</sup> who is mentioned in the Books, he<sup>saww</sup> has been hidden upon us, and it Obligates upon us the enquiring about him<sup>saww</sup> and seeking his<sup>asws</sup> Ahadeeth’, and we harmonised our opinions and we formed a consensus upon that I should go out and find out for them. So I went out, and with me was a princely wealth, and I travelled for twelve months until I was near to Kabul, and a group of Turks presented to me and they came over to me and seized my wealth and I was injured with intense injuries, and handed me over to Kabul city, and its king saved me. ",
            "When he was acquainted upon my news, (he sent me) to Balkh city, and upon it (as a ruler) was Dawood Bin Al-Abbas Bin Abu Al-Aswad. So my news reached him that I had come out to find out (all the way) from India and I had learnt Persian and had debated the jurists and the people of theology. So Dawood Bin Al-Abbas sent for me, and made me attend his gathering, and the jurists gathered against me and debated me. So I let them know that I had come out from my city seeking this Prophet<sup>saww</sup> whom I found in the Books.",
            "So he said to me, ‘Who is he<sup>saww</sup> and what is his<sup>saww</sup> name?’ I said, ‘Muhammad<sup>saww</sup>!’. So they said, ‘He<sup>saww</sup> is our Prophet<sup>saww</sup> whom you are seeking’. So I asked them about his<sup>saww</sup> Law, and they let me know. So I said, ‘I know that Muhammad<sup>saww</sup> is a Prophet<sup>saww</sup>, but I do not know this one whom you are describing (whether he is) or not, therefore let me know of his<sup>saww</sup> place so that I can go to it and ask him about the signs which are with me and the evidences. So if he<sup>saww</sup> was my companion who I am seeking, I will believe in him<sup>saww</sup>’. ",
            "So they said, ‘He<sup>saww</sup> has passed away’. I said, ‘So who is his<sup>saww</sup> successor?’ They said, ‘Abu Bakr’. I said, ‘Name him for me, for this is his teknonym’. They said, ‘Abdullah Bin Usman’, and they lineage him to Qureysh. I said, ‘So lineage Muhammad<sup>saww</sup> your Prophet<sup>saww</sup> for me’. So they lineage him<sup>saww</sup>, and I said, ‘This isn’t my companion whom I seek. My companions who I seek is his<sup>saww</sup> Caliph, his<sup>saww</sup> brother in the Religion and his<sup>saww</sup> cousin in the lineage, and he<sup>asws</sup> would have married his<sup>saww</sup> daughter<sup>asws</sup>, and he<sup>asws</sup> would be the father of his<sup>saww</sup> children, there being no offspring for this Prophet<sup>saww</sup> upon the earth other than the children of this man who is his<sup>saww</sup> Caliph’. ",
            "He (the narrator said), ‘So they leapt upon me and they said, ‘O you Emir! This one has come out from Polytheism to (go to) disbelief. This one is of permissible blood (to be killed)’. So I said to them, ‘O people! I am a man. With me is a religion which I am attached with. I will not separate from it until I see what is stronger than it. I found the description of this man in the Book which Allah<sup>azwj</sup> Revealed upon His<sup>azwj</sup> Prophet<sup>saww</sup>, and rather I came out from a city of India and am from the most honourable one whom I was among, seeking for him. Therefore, when I have examined about the matter of your companions whom you mentioned, he cannot happen to be the Prophet<sup>saww</sup> described in the Books’. So they refrained from me.",
            "And the office bearer sent a message to man called Al-Husayn Bin Ishkeyb and called him over, and he said to him, ‘Keep an eye on this Indian man’. So Al-Husayn said to him, ‘May Allah<sup>azwj</sup> Keep you well! In your presence are jurists, and the scholars, and they are more knowledgeable and are of more insight to debate with him. He said to him, ‘Debate him just as I am saying to you, and isolate with him and be kind to him’. ",
            "So Al-Husayn Bin Ishkeyb said to me afterwards after my having won against him, ‘Your companions whom you are seeking, he is the Prophet<sup>saww</sup> whom they have described, and the matter of his<sup>saww</sup> Caliph is not as they are saying it to be. This Prophet<sup>saww</sup>, is Muhammad<sup>saww</sup> Bin Abdullah<sup>asws</sup> Bin Abdul Muttalib<sup>asws</sup>, and his<sup>saww</sup> successor<sup>asws</sup> is Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> Bin Abdul Muttalib<sup>asws</sup>, and he<sup>asws</sup> is the husband of (Syeda) Fatima<sup>asws</sup> daughter<sup>asws</sup> of Muhammad<sup>saww</sup>, and father of Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>, two grandsons<sup>asws</sup> of Muhammad<sup>saww</sup>’. ",
            "Ghanim Abu Saeed said, ‘So I said, ‘Allah<sup>azwj</sup> is the Greatest! This is the one whom I seek!’. So I went over to Dawood Bin Al-Abbas and I said to him, ‘O you Emir! I have found what I am seeking, and I testify that there is no god except for Allah<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup>’. So he was good to me and helped me (financially), and said to Al-Husayn, ‘Visit him (regularly)’. So I went to him until I was comfortable with him and he made me understand regarding what I was needy to, from the <span class=\"iTxt\">Salat</span> and the Sawm and the Obligations.",
            "He (the narrator) said, ‘I said to him, ‘We read in our Books that Muhammad<sup>saww</sup> is the last of the Prophets<sup>as</sup>, there would be no Prophet<sup>saww</sup> after him<sup>saww</sup>, and that the command from after him<sup>saww</sup> is to his<sup>saww</sup> successor<sup>asws</sup> and his<sup>saww</sup> inheritor, and his<sup>saww</sup> Caliph from after him<sup>saww</sup>. Then it would be to the successor<sup>asws</sup> after the successor<sup>asws</sup> not declining. The Command of Allah<sup>azwj</sup> would be in their<sup>asws</sup> posterity until the world expires. So who is the successor<sup>asws</sup> of the successor<sup>asws</sup> of Muhammad<sup>saww</sup>?’ He said, ‘Al-Hassan<sup>asws</sup>, then Al-Husayn<sup>asws</sup>, two sons<sup>asws</sup> of Muhammad<sup>saww</sup>. Then the command carried on among the succesors<sup>asws</sup> until it ended up to the Master<sup>asws</sup> of the time.",
            "Then he taught me what happened, so there did not happen to be an endeavour for me except to seek the area. So I arrived at Qum and sat with our companions in the year Two hundred and sixty-four, and went out with them until I arrived at Baghdad, and with him was a friend of his from the people of Al-Sind, who was his companion upon the doctrine. ",
            "Then he said, ‘Ghanim narrated to me saying, ‘And I disliked from my friend, some of his mannerisms, so I departed from him and went out until I came to Al-Abbasiya. I prepared for the <span class=\"iTxt\">Salat</span> and I prayed, and I paused thinking regarding what I had aimed to seek, when I fell asleep. A comer came to me and he said, ‘You are so and so’, this (is your) name in India’. So I said, ‘Yes’. And he said, ‘Respond to your Master<sup>asws</sup>’. So I went with him, and he did not cease to change the streets with me until I came to a house and an orchard, and there I was with him<sup>asws</sup> (12<sup>th</sup> Imam<sup>asws</sup>), seated.",
            "So he<sup>asws</sup> said: ‘Welcome, O so and so!’, in the Indian language, ‘How are you, and how are the ones you left behind, so and so, and so and so’, to the extent that he<sup>asws</sup> counted all forty of them, and he<sup>asws</sup> asked me about them, one by one. Then he<sup>asws</sup> informed me with what we had discussed, all of that being in the Indian language. Then he<sup>asws</sup> said: ‘You intend to perform Hajj along with the people of Qumm?’ I said, ‘Yes, O my Master<sup>asws</sup>!’. So he<sup>asws</sup> said: ‘Do not perform Hajj with them, and leave during this year of yours, and perform Hajj in the coming year’.  ",
            "Then he<sup>asws</sup> chucked a bag at me which was in front of him<sup>asws</sup>, and he<sup>asws</sup> said to me: ‘Make it to be for your expenses and do not enter into Baghdad to go to So and so (naming him), and do not ask him for anything and leave to come to us<sup>asws</sup> to the city’. ",
            "Then some of the people arrived to us and they let us know that our companions had left from Al-Aqaba and went to around Khurasan. So when it was during the next Hajj, he sent us a gift from the side of Khurasan. So he stayed in it for a time, then died. May Allah<sup>azwj</sup> have Mercy on him’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Muhammad has said that narrated to me Muhammad and al-Hassan sons of Ali ibn Ibrahim in the year two hundred seventy nine saying that narrated to them Muhammad ibn Ali ibn ‘Abd al-Rahman al-‘Abdi of ‘Abd Qays from Daw’ ibn Ali al-‘Ijli from a man from Persia, whose name he mentioned, who has said the following. “I went to the city of Surra man Ra‘a and kept myself at the door of abu Muhammad (a.s.). He called me inside without any request from me. When I went inside and offered greeting of peace he said to me, “How are you, O father of so and so?” Then he told me, “Sit down O so and so.” He then asked me about a group of men and ladies from my family. He then said to me, “What brings you here?” I said, “The desire to serve you.” The narrator has said that he said, “All right, be around the house.” I then remained in the house with the servants. Then I would do the purchases for them from the market. I would go in his presence without first requesting permission when he would haven been present in the man’s quarters One day I went to him when he was in the men’s quarters. I heard the sound of movement in the house and he said, “Do not move from your place.” I could not dare to go out or inside. Then a female servant came out to me who had something with her which was covered. He then called me inside and I went inside. He called the female servant and she came back. He told her to uncover what she had with her. She uncovered the very good looking face of a white baby boy. And she uncovered his chest. A line of hairs had grown from his neck down to his bellybutton which seemed to be greenish color and not totally black. He said, “This is your Leader with Divine Authority.” He then ordered her to take the baby inside and ever since I could not see him until abu Muhammad (a.s.) passed away.” Daw’ ibn Ali has said, “I asked the man from Persia, ‘How old do you think he was?” He said, “Two years old.” Al-‘Abdi has said, “I asked Daw’, “How old do you think he was?” He said, “Fourteen years old.” Abu Ali and abu ‘Abdallah have said that we think he is twenty one years old.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/173)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1353,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1035",
              "text": "سَعْدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَعْدِ بْنِ عَبْدِ اللَّهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:4",
        "text": [
          " إِنَّ الْحَسَنَ بْنَ النَّضْرِ وَ أَبَا صِدَامٍ وَ جَمَاعَةً تَكَلَّمُوا بَعْدَ مُضِيِّ أَبِي مُحَمَّدٍ ( عليه السلام ) فِيمَا فِي أَيْدِي الْوُكَلَاءِ وَ أَرَادُوا الْفَحْصَ فَجَاءَ الْحَسَنُ بْنُ النَّضْرِ إِلَى أَبِي الصِّدَامِ فَقَالَ إِنِّي أُرِيدُ الْحَجَّ فَقَالَ لَهُ أَبُو صِدَامٍ أَخِّرْهُ هَذِهِ السَّنَةَ فَقَالَ لَهُ الْحَسَنُ بْنُ النَّضْرِ إِنِّي أَفْزَعُ فِي الْمَنَامِ وَ لَا بُدَّ مِنَ الْخُرُوجِ وَ أَوْصَى إِلَى أَحْمَدَ بْنِ يَعْلَى بْنِ حَمَّادٍ وَ أَوْصَى لِلنَّاحِيَةِ بِمَالٍ وَ أَمَرَهُ أَنْ لَا يُخْرِجَ شَيْئاً إِلَّا مِنْ يَدِهِ إِلَى يَدِهِ بَعْدَ ظُهُورِهِ",
          "قَالَ فَقَالَ الْحَسَنُ لَمَّا وَافَيْتُ بَغْدَادَ اكْتَرَيْتُ دَاراً فَنَزَلْتُهَا فَجَاءَنِي بَعْضُ الْوُكَلَاءِ بِثِيَابٍ وَ دَنَانِيرَ وَ خَلَّفَهَا عِنْدِي فَقُلْتُ لَهُ مَا هَذَا قَالَ هُوَ مَا تَرَى ثُمَّ جَاءَنِي آخَرُ بِمِثْلِهَا وَ آخَرُ حَتَّى كَبَسُوا الدَّارَ ثُمَّ جَاءَنِي أَحْمَدُ بْنُ إِسْحَاقَ بِجَمِيعِ مَا كَانَ مَعَهُ فَتَعَجَّبْتُ وَ بَقِيتُ مُتَفَكِّراً فَوَرَدَتْ عَلَيَّ رُقْعَةُ الرَّجُلِ ( عليه السلام ) إِذَا مَضَى مِنَ النَّهَارِ كَذَا وَ كَذَا فَاحْمِلْ مَا مَعَكَ",
          "فَرَحَلْتُ وَ حَمَلْتُ مَا مَعِي وَ فِي الطَّرِيقِ صُعْلُوكٌ يَقْطَعُ الطَّرِيقَ فِي سِتِّينَ رَجُلًا فَاجْتَزْتُ عَلَيْهِ وَ سَلَّمَنِي اللَّهُ مِنْهُ فَوَافَيْتُ الْعَسْكَرَ وَ نَزَلْتُ فَوَرَدَتْ عَلَيَّ رُقْعَةٌ أَنِ احْمِلْ مَا مَعَكَ فَعَبَّيْتُهُ فِي صِنَانِ الْحَمَّالِينَ فَلَمَّا بَلَغْتُ الدِّهْلِيزَ إِذَا فِيهِ أَسْوَدُ قَائِمٌ فَقَالَ أَنْتَ الْحَسَنُ بْنُ النَّضْرِ قُلْتُ نَعَمْ قَالَ ادْخُلْ ",
          "فَدَخَلْتُ الدَّارَ وَ دَخَلْتُ بَيْتاً وَ فَرَّغْتُ صِنَانَ الْحَمَّالِينَ وَ إِذَا فِي زَاوِيَةِ الْبَيْتِ خُبْزٌ كَثِيرٌ فَأَعْطَى كُلَّ وَاحِدٍ مِنَ الْحَمَّالِينَ رَغِيفَيْنِ وَ أُخْرِجُوا وَ إِذَا بَيْتٌ عَلَيْهِ سِتْرٌ فَنُودِيتُ مِنْهُ يَا حَسَنَ بْنَ النَّضْرِ احْمَدِ اللَّهَ عَلَى مَا مَنَّ بِهِ عَلَيْكَ وَ لَا تَشُكَّنَّ فَوَدَّ الشَّيْطَانُ أَنَّكَ شَكَكْتَ وَ أَخْرَجَ إِلَيَّ ثَوْبَيْنِ وَ قِيلَ خُذْهَا فَسَتَحْتَاجُ إِلَيْهِمَا فَأَخَذْتُهُمَا وَ خَرَجْتُ ",
          "قَالَ سَعْدٌ فَانْصَرَفَ الْحَسَنُ بْنُ النَّضْرِ وَ مَاتَ فِي شَهْرِ رَمَضَانَ وَ كُفِّنَ فِي الثَّوْبَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Saeed Bin Abdullah who said, ",
            "‘Al-Hassan Bin Al-Nazar and Abu Sidam and a group were talking after the passing away of Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) regarding what was in the hands of the agents and intended the inquiry (distribution of his<sup>asws</sup> inheritance). So Al-Husayn Bin Al-Nazar came over to Abu Al-Sidam and he said, ‘I intend performing the Hajj’. Abu Al-Sidam said, ‘Delay it this year’. So Al-Hassan Bin Al-Nazar said to him, ‘I panicked during the sleep and it is inevitable that I go out’, and he bequeathed to Ahmad Bin Ya’la Bin Hammad, and bequeathed to the supervisor with some wealth and instructed him that he should not take out anything except from his hand to go to his<sup>asws</sup> hand after his<sup>asws</sup> appearance’. ",
            "He (the narrator) said, ‘So Al-Hassan said, ‘When I arrived at Baghdad, I rented a house and I lodge in it. Then one of the agents came over to me with some clothes and Dinars and left it behind with me. So I said to him, ‘What is this?’ He said, ‘It is what you see’. Then another one came over to me with the likes of it, and another, to the extended that the house was filled up. Then Ahmad Bin Is’haq came over to me with the entire of what was with him. So I was astonished and remained pondering, and a note of the man<sup>asws</sup> (12<sup>th</sup> Imam<sup>asws</sup>) arrived to me: ‘When you go from such and such a day, so carry what is with you’. ",
            "So I departed, and I carried whatever was with me and in the road there was a vile person cutting off the road with sixty men. But I was brave upon him and Allah<sup>azwj</sup> Secured me from him. Then I arrived at Al-Askar and lodged, and a (another) note arrived to me: ‘Carry whatever is with you’. So I loaded it in the carriages of the porters. So when I reached the corridor, there was a black (man) standing in it, and he said, ‘Are you Al-Hassan Bin Al-Nazar?’ I said, ‘Yes’. He said, ‘Enter!’. ",
            "So I entered the house and I entered the room and freed the carriage of the porters. And in the corner of the house there was a lot of bread, and he gave every one of the porters two loaves of bread and exited them. And there was a room having a curtain upon it, so there was a call from it: ‘O Hassan Bin Al-Nazar! Praise Allah<sup>azwj</sup> upon what He<sup>azwj</sup> has Favoured with upon you, and do not doubt, for the Satan<sup>la</sup> loves it that you should be doubting; and he<sup>asws</sup> brought out to me two clothes and said: ‘Take these, for you would be needy to these two’. So I took them and went out’. ",
            "Sa’d said, ‘Al-Hassan Bin Al-Nazar left, and died in the Month of Ramazan, and he was enshrouded in the two clothes’."
          ],
          "en.sarwar": [
            " Ghanim abu Sa‘id has said, “I then said, “Allahu Akbar.” (Allah is great). This is the one I have been looking for.” I then returned to Dawud ibn al-‘Abbass and said to him, “O commander, I have found what I was searching for. I testify that there is no lord besides Allah and I testify that Muhammad is the Messenger of Allah.” The narrator has said that he treated and helped me with kindness and asked al-Husayn to look after me.” The narrator has said that thereafter I went to him until we were acquainted properly and he taught me understanding of the law of the matters that I needed such as prayer, fasting and the obligations.” The narrator has said that I said to him, “We read in our books that Muhammad (s.a) is the last of the prophets and there will be no other prophets after him. The task of leadership after him will be with the executor of his will, his successors and heirs and thereafter it will be with the executor of the will of the previous one and so on in their descendants until the end of the world. Who is the executor of the will of the executor of the will of Muhammad (s.a) ?” He said, “They are al-Hassan then al-Husayn the grandsons of Muhammad (s.a).” He then continued speaking of the executors of the will of the Holy Prophet (s.a) until the Sahib al-Zaman (the one who possesses Divine Authority today). Then he explained to me what had happened (with the Imams). Thereafter I hand no other goal but to search for the holy location. He (‘Amiri) has said that he came to us in Qumm. He sat with our people in the year two hundred sixty four AH. He then left with them and arrived in Baghdad with his friend from al-Sind who had accompanied him in religion. ‘Amiri has said that Ghanim said to me, “I disliked certain things about my companion and I departed him and went out to al-‘Abbassia and prepared my self for prayer. I began the prayer but I was anxious and thoughtful about my goal. At this time someone came to me and called me with my Indian name. I replied, “Yes, it is I.” He said, “Your master is calling you.” I went with him and he would walk from this to that street until he came to house and a garden and I saw him (a.s.) sitting.” He said, “Well come, O so and so, in Inddian language. How are you? How was so and so until he mentioned all the forty people. He then asked me about every and each of them. Then he told all that had happened among us all in Indian language. Then he asked, “Did you want to perform Hajj with people of Qumm?” I said, “Yes, my master.” He then said, “Do not go to Hajj with them this year. Go back and perform Hajj in future.” He then gave me a bag of money that was in front of him and said to me, “Spend it for your needs and do not go to Baghdad to so and so.” He mentioned his name and said, “Do not tell him anything.” ‘Amiri has said that he came to us at Qumm. He then informed us of the triumph and that our people had returned from al-‘Aqaba. Ghanim went ‘Uthman Khurasan. Next year he went for Hajj and sent us souvenirs from Khurasan. He lived there for sometimes and then he died. May Allah grant him blessings.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/178)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1354,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1486",
              "text": "مُحَمَّدِ بْنِ حَمَّوَيْهِ السُّوَيْدَاوِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1487",
              "text": "مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ حَمَّوَيْهِ السُّوَيْدَاوِيِّ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:5",
        "text": [
          " شَكَكْتُ عِنْدَ مُضِيِّ أَبِي مُحَمَّدٍ ( عليه السلام ) وَ اجْتَمَعَ عِنْدَ أَبِي مَالٌ جَلِيلٌ فَحَمَلَهُ وَ رَكِبَ السَّفِينَةَ وَ خَرَجْتُ مَعَهُ مُشَيِّعاً فَوُعِكَ وَعْكاً شَدِيداً فَقَالَ يَا بُنَيَّ رُدَّنِي فَهُوَ الْمَوْتُ وَ قَالَ لِيَ اتَّقِ اللَّهَ فِي هَذَا الْمَالِ وَ أَوْصَى إِلَيَّ فَمَاتَ ",
          "فَقُلْتُ فِي نَفْسِي لَمْ يَكُنْ أَبِي لِيُوصِيَ بِشَيْ‏ءٍ غَيْرِ صَحِيحٍ أَحْمِلُ هَذَا الْمَالَ إِلَى الْعِرَاقِ وَ أَكْتَرِي دَاراً عَلَى الشَّطِّ وَ لَا أُخْبِرُ أَحَداً بِشَيْ‏ءٍ وَ إِنْ وَضَحَ لِي شَيْ‏ءٌ كَوُضُوحِهِ فِي أَيَّامِ أَبِي مُحَمَّدٍ ( عليه السلام ) أَنْفَذْتُهُ وَ إِلَّا قَصَفْتُ بِهِ",
          "فَقَدِمْتُ الْعِرَاقَ وَ اكْتَرَيْتُ دَاراً عَلَى الشَّطِّ وَ بَقِيتُ أَيَّاماً فَإِذَا أَنَا بِرُقْعَةٍ مَعَ رَسُولٍ فِيهَا يَا مُحَمَّدُ مَعَكَ كَذَا وَ كَذَا فِي جَوْفِ كَذَا وَ كَذَا حَتَّى قَصَّ عَلَيَّ جَمِيعَ مَا مَعِي مِمَّا لَمْ أُحِطْ بِهِ عِلْماً فَسَلَّمْتُهُ إِلَى الرَّسُولِ وَ بَقِيتُ أَيَّاماً لَا يُرْفَعُ لِي رَأْسٌ وَ اغْتَمَمْتُ فَخَرَجَ إِلَيَّ قَدْ أَقَمْنَاكَ مَكَانَ أَبِيكَ فَاحْمَدِ اللَّهَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Hamawiyya Al Sawdiyya, from Muhammad Bin Ibrahim Bin Mahziyar who said, ",
            "‘I doubted during the passing away of Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) and a lot of wealth had been gathered with my father. So he carried it and sailed the ship and I went out with him walking, but he was afflicted with intense fever, and he said, ‘O my son! Return me, for it is the death’, and said to me, ‘Fear Allah<sup>azwj</sup> with regards to this wealth and he bequeathed to me. Then he died.",
            "So I said within myself, ‘It cannot happen that my father would bequeath with something without correctness. I shall carry this wealth to Al-Iraq and rent a house upon the river bank and not inform anyone with anything, and if something is clear to me like it was clear during the days of Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>), I shall enforce it, or else I shall dump it’. ",
            "So I proceeded to Al-Iraq and rented a house upon the riverbank and remained there for some days, and there I received a note (from the 12<sup>th</sup> Imam<sup>asws</sup>) with a messenger wherein was: ‘O Muhammad! With you is such and such in the middle of such and such’, to the extent that he<sup>asws</sup> related upon me the entirety of whatever was with me, from what even my knowledge did not encompass with. So I submitted (everything) to the messenger and remained there for some days. Not a single head was raised for me, and I was gloomy, so there came out to me (another note): ‘We<sup>asws</sup> have appointed you in the place of your father, therefore Praise Allah<sup>azwj</sup>’’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad has narrated from Sa‘id ibn ‘Abdallah who has said the following. “Al-Hassan ibn al-Nadr and abu Sidam and a group of people, after abu Muhammad (a.s.) had passed away would discuss about the property (of religious dues) in their possession and how to find out (as to who should they give it). Al-Hassan ibn al-Nadr came to abu Sidam and said, “I want to go for Hajj this year.” Abu Sidam said, “Postpone it this year.” Al-Hassan ibn al-Nadr said, “I experience nightmare in my sleep. I must go this year for Hajj.” He prepared his will and appointed Ahmad ibn Ya‘li ibn Hammad as the executor of his will. He said in his to pay a certain amount of money to the holy location with his own hand into his (the Imam’s) own hand after he would appear in public. The narrator has said that al-Hassan has said, “When I arrived in Baghdad I rented a house and certain persons of the representatives came to me with cloths and Dinars and left them with me. I asked them, “What is it?” He said, “It is as you know what it is.” Others also came to me with such properties until the house was filled up. Then Ahmad ibn Ishaq came with all that was with him. I was astonished and remained thinking. A letter came to me from the man (a.s.) that said, “When it will be come such and such hours of the day then take all (money/ property) is with you.” I then left with that was with me and on the way there was a robber that looted the travelers with his sixty men thieves. I passed him safely by the help of Allah. I arrived at the army camp and stopped there. A letter came that told me to take everything along with me. I loaded every thing in the carriages of the porters and when I reach the corridor a black man standing there. He asked, “Are you al-Hassan ibn al-Nadr?” I said, “Yes, I am he.” He then said, “Enter.” I then entered the house and then a room and unloaded the goods from the carriages of the porters therein. In a corner of the room there was a large quantity of bread. He gave two loaves to each of the porters and told them to leave. Then I found out that there was a room behind the curtain and someone called me therefrom. “O al-Hassan ibn al-Nadr, thank Allah for the favor that He has done to you and do not complain. Satan loves that you would doubt. He gave me two pieces of cloths and said, “Take these because you will soon need them.” I took them and left.” Sa‘d has said, “Al-Hassan ibn Nadr came back, died in the month of Ramadan and was shrouded in the pieces of cloths.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (180/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1355,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/358",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1488",
              "text": "أَبِي عَبْدِ اللَّهِ النَّسَائِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ النَّسَائِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:6",
        "text": [
          " أَوْصَلْتُ أَشْيَاءَ لِلْمَرْزُبَانِيِّ الْحَارِثِيِّ فِيهَا سِوَارُ ذَهَبٍ فَقُبِلَتْ وَ رُدَّ عَلَيَّ السِّوَارُ فَأُمِرْتُ بِكَسْرِهِ فَكَسَرْتُهُ فَإِذَا فِي وَسَطِهِ مَثَاقِيلُ حَدِيدٍ وَ نُحَاسٍ أَوْ صُفْرٍ فَأَخْرَجْتُهُ وَ أَنْفَذْتُ الذَّهَبَ فَقُبِلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Abu Abdullah Al Nasai’e who said, ",
            "‘I delivered certain things to Al-Mirzubany Al-Harisy, among these was a gold bracelet, and these were accepted and the gold bracelet was returned upon me. So I instructed to break it, and there was in the inside of it, fragments of iron, and brass or zinc. So I extracted these and re-sent it, and it was accepted’."
          ],
          "en.sarwar": [
            " 5. Ali ibn Muhammad has narrated from Muhammad ibn Hamawayh al-Suwaydawiy from Muhammad ibn Ibrahim ibn Mahziyar who has said the following. “At the time abu Muhammad (a.s.) passed away I had doubts. Large quantities of commodities (of religious dues) were accumulated with my father. He loaded them in a boat and himself also embarked. I was with him to say farewell to him. He began to feel severe fever and asked me to take him back home because he said, “It is death.” He then said to me, “Be pious before Allah about these commodities.” In his will he appointed me over see the commodities. He then died. I then said to my self, “My father was not such a person to make a will for an incorrect cause. I must take these commodities to Iraq and rent an accommodation on the bank of the river and I will not tell anyone of anything with me. If the matter will become clear to me as it was at the time of abu Muhammad (a.s.) I will deal accordingly otherwise throw them into the river.” I then went to Iraq, rented a place on the bank of the river and stayed there for a several days. Then I received a letter with a messenger. The letter said, “O Muhammad, there is so and so thing inside so and so thing with you. It explained to me every thing in details even about the things of which I hand no knowledge. I then submitted everything to the messenger and remained there for several more days. No one would ask who I was. I became depressed and sad. Then a letter came that said, “We have appointed you in the place of your father. Therefore give thanks to Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (181/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1356,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1489",
              "text": "الْفَضْلِ الْخَزَّازِ الْمَدَائِنِيِّ مَوْلَى خَدِيجَةَ بِنْتِ مُحَمَّدٍ أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنِ الْفَضْلِ الْخَزَّازِ الْمَدَائِنِيِّ مَوْلَى خَدِيجَةَ بِنْتِ مُحَمَّدٍ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:7",
        "text": [
          " إِنَّ قَوْماً مِنْ أَهْلِ الْمَدِينَةِ مِنَ الطَّالِبِيِّينَ كَانُوا يَقُولُونَ بِالْحَقِّ وَ كَانَتِ الْوَظَائِفُ تَرِدُ عَلَيْهِمْ فِي وَقْتٍ مَعْلُومٍ فَلَمَّا مَضَى أَبُو مُحَمَّدٍ ( عليه السلام ) رَجَعَ قَوْمٌ مِنْهُمْ عَنِ الْقَوْلِ بِالْوَلَدِ فَوَرَدَتِ الْوَظَائِفُ عَلَى مَنْ ثَبَتَ مِنْهُمْ عَلَى الْقَوْلِ بِالْوَلَدِ وَ قُطِعَ عَنِ الْبَاقِينَ فَلَا يُذْكَرُونَ فِي الذَّاكِرِينَ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Al Fazl Al Khazzaz Al Madainy, ",
            "‘A slave of Khadeeja, daughter of Muhammad Abu Ja’far<sup>asws</sup> said, ‘There was a group from the people of Al-Medina from the Talibiyyin. They were saying (believing) in the truth, and it was so that the stipends used to arrive to them during a known time. So when Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) passed away, a group from them retracted from the words (beliefs) with the arrival (of Al-Qaim<sup>asws</sup>). So the stipends continued arriving upon the ones who were steadfast from them upon the word (belief), and it was cut off from the remainder, so they are no longer among the remembered ones, and the Praise is for the Lord<sup>azwj</sup> of the worlds’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn abu ‘Abdallah has narrated from abu ‘Abdallah al-Nisa’iy who has said the following. “I delivered certain items from al-Marzabani al-Harithi to the holy location. One item was a gold bracelet. Other items were accepted but the bracelet was returned. I was ordered to break it. When I did so inside there were certain amounts of iron, brass and zinc. I took them out and sent the gold back. It was accepted.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/181)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1357,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:8",
        "text": [
          " أَوْصَلَ رَجُلٌ مِنْ أَهْلِ السَّوَادِ مَالًا فَرُدَّ عَلَيْهِ وَ قِيلَ لَهُ أَخْرِجْ حَقَّ وُلْدِ عَمِّكَ مِنْهُ وَ هُوَ أَرْبَعُمِائَةِ دِرْهَمٍ وَ كَانَ الرَّجُلُ فِي يَدِهِ ضَيْعَةٌ لِوُلْدِ عَمِّهِ فِيهَا شِرْكَةٌ قَدْ حَبَسَهَا عَلَيْهِمْ فَنَظَرَ فَإِذَا الَّذِي لِوُلْدِ عَمِّهِ مِنْ ذَلِكَ الْمَالِ أَرْبَعُمِائَةِ دِرْهَمٍ فَأَخْرَجَهَا وَ أَنْفَذَ الْبَاقِيَ فَقُبِلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad said, ",
            "‘A man from the people of the desert (Bedouins) delivered some wealth, but it was returned to him, and it was said to him: ‘Take out the right of the children of your uncle from it, and it is four hundred Dirhams’; and it was so that the man had an estate in his hand belonging to the children of his uncle, wherein he was a partner, and he had withheld it from them. So he looked, and that which was for the children of his uncle from that wealth was four hundred Dirhams. So he extracted it and sent over the remainder, and it was accepted’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Muhammad has narrated from al-Fadl al-Khazzaz al-Mada-’ini, the slave of Khadija daughter of Muhammad abu Ja‘far (a.s.)who has said the following “Certain people of the city of al-Madina that belonged to al-Talibiyin group believed in the truth (about Ahl al-Bayt). They would receive their financial grants regularly on time. When abu Muhammad (a.s.) passed away a few of them disregarded the belief that abu Muhammad (a.s.) has behind a son. The financial grants thereafter would come only to those who still believed in son of abu Muhammad (a.s.) and stopped coming to the others. They no more are mentioned along with those who are mentioned. All praise belongs to Allah, Lord of the worlds.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/181)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1358,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1490",
              "text": "الْقَاسِمُ بْنُ الْعَلَاءِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْقَاسِمُ بْنُ الْعَلَاءِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:9",
        "text": [
          " وُلِدَ لِي عِدَّةُ بَنِينَ فَكُنْتُ أَكْتُبُ وَ أَسْأَلُ الدُّعَاءَ فَلَا يُكْتَبُ إِلَيَّ لَهُمْ بِشَيْ‏ءٍ فَمَاتُوا كُلُّهُمْ فَلَمَّا وُلِدَ لِيَ الْحَسَنُ ابْنِي كَتَبْتُ أَسْأَلُ الدُّعَاءَ فَأُجِبْتُ يَبْقَى وَ الْحَمْدُ لِلَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Qasim Bin Al A’ala said, ",
            "‘A number of sons were born unto me, and I used to write and ask for the supplication, be he<sup>asws</sup> did not write with anything to me for them. So all of them died. Then when Al-Hassan, my son was born unto me, I wrote asking for the supplication, so he<sup>asws</sup> (12<sup>th</sup> Imam<sup>asws</sup>) answered. He remained (alive), and the Praise is for Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 8. Ali ibn Muhammad has said that a man from Bedouins sent a certain quantity of commoditiy (as religious dues) but it was returned to him and he was told, “Pay first the rights of the children of your uncle. It is four hundred Dirhams.” The property of the children of his uncle was in his possession in sharing manner and he had withheld their property. When he did the accounting their rights in that shared property was four hundred Dirhams. He paid that amount and sent the rest (to the Imam (a.s.) and it was accepted.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (182/ 6)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (60/ 1)"
        ],
        "index": 1359,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1001",
              "text": "أَبِي عَبْدِ اللَّهِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ بْنِ صَالِحٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:10",
        "text": [
          " كُنْتُ خَرَجْتُ سَنَةً مِنَ السِّنِينَ بِبَغْدَادَ فَاسْتَأْذَنْتُ فِي الْخُرُوجِ فَلَمْ يُؤْذَنْ لِي فَأَقَمْتُ اثْنَيْنِ وَ عِشْرِينَ يَوْماً وَ قَدْ خَرَجَتِ الْقَافِلَةُ إِلَى النَّهْرَوَانِ فَأُذِنَ فِي الْخُرُوجِ لِي يَوْمَ الْأَرْبِعَاءِ وَ قِيلَ لِيَ اخْرُجْ فِيهِ فَخَرَجْتُ وَ أَنَا آيِسٌ مِنَ الْقَافِلَةِ أَنْ أَلْحَقَهَا فَوَافَيْتُ النَّهْرَوَانَ وَ الْقَافِلَةُ مُقِيمَةٌ فَمَا كَانَ إِلَّا أَنْ أَعْلَفْتُ جِمَالِي شَيْئاً حَتَّى رَحَلَتِ الْقَافِلَةُ فَرَحَلْتُ وَ قَدْ دَعَا لِي بِالسَّلَامَةِ فَلَمْ أَلْقَ سُوءاً وَ الْحَمْدُ لِلَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abu Abdullah Bin Salih who said, ",
            "‘I had gone out for a year from the years at Baghdad. So I sought permission (of the 12<sup>th</sup> Imam<sup>asws</sup>) regarding the exiting, but he<sup>asws</sup> did not permit for me. So I stayed for twenty-two days and the caravan had gone out to Al-Nahrwan. Then he<sup>asws</sup> permitted for me regarding the going out on the day of Wednesday, and said to me: ‘Go out during it’. So I went out and I had despaired from the caravan that I would meet up with it. I arrived at Al-Nharwan and the caravan was still there. Then it was not so except that I could feed something to my camels until the caravan departed. So I departed, and he<sup>asws</sup> had supplicated for me with the safety, and I did not come across any evil. And the Praise is for Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 9. Al-Qasim ibn al-‘Ala’ has said the following. “Several boys were born to me and each time I would write and request for prayer. Nothing would have been written to me about them. They all died. When my son al-Hassan was born I wrote and requested for prayer. The answer came, “He lives and all praise belongs to Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (182/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1360,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/57",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1491",
              "text": "النَّضْرِ بْنِ صَبَّاحٍ الْبَجَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1492",
              "text": "مُحَمَّدِ بْنِ يُوسُفَ الشَّاشِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنِ النَّضْرِ بْنِ صَبَّاحٍ الْبَجَلِيِّ عَنْ مُحَمَّدِ بْنِ يُوسُفَ الشَّاشِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:11",
        "text": [
          " خَرَجَ بِي نَاصُورٌ عَلَى مَقْعَدَتِي فَأَرَيْتُهُ الْأَطِبَّاءَ وَ أَنْفَقْتُ عَلَيْهِ مَالًا فَقَالُوا لَا نَعْرِفُ لَهُ دَوَاءً فَكَتَبْتُ رُقْعَةً أَسْأَلُ الدُّعَاءَ فَوَقَّعَ ( عليه السلام ) إِلَيَّ أَلْبَسَكَ اللَّهُ الْعَافِيَةَ وَ جَعَلَكَ مَعَنَا فِي الدُّنْيَا وَ الْآخِرَةِ ",
          "قَالَ فَمَا أَتَتْ عَلَيَّ جُمْعَةٌ حَتَّى عُوفِيتُ وَ صَارَ مِثْلَ رَاحَتِي فَدَعَوْتُ طَبِيباً مِنْ أَصْحَابِنَا وَ أَرَيْتُهُ إِيَّاهُ فَقَالَ مَا عَرَفْنَا لِهَذَا دَوَاءً."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from Al Nazar Bin Sabbah Al Bajaly, from Muhammad Bin Yusuf Al Shahsy who said, ",
            "‘A boil came out with me upon my backside, and I showed it to the physicians, and spent wealth upon it, so they said, ‘We do not know of any cure for it. So I wrote a note (to the 12<sup>th</sup> Imam<sup>asws</sup>) asking for the cure, and he<sup>asws</sup> signed (a letter) to me: ‘May Allah<sup>azwj</sup> Clothe you in good health and Make you to be with us<sup>asws</sup> in the world and the Hereafter’. ",
            "He (the narrator) said, ‘So there did not come a Friday upon me until I recovered and it came to be like my palm (no swelling left therein). So I called a physician from our companions and showed it to him, and he said, ‘We did not recognise a cure for this’."
          ],
          "en.sarwar": [
            " 10. Ali ibn Muhammad has narrated ‘Abdallah ibn Salih who has said the following “I lived in Baghdad and one year I requested permission (from the twelfth Imam (a.s.) to travel out but permission was not granted. I waited for twenty two days and the caravan had already left for al-Nahrawan then I was granted permission. It was a Wednesday and I was told to leave. I then left but I did not have any hope of reaching the caravan. I arrived at al-Nahrawan and the caravan was still there. I then had enough time to only feed my camels and then the caravan left. I journeyed with the caravan and he had prayed for my safety. I did not face any difficulties. All praise belongs to Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (182/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1361,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/57",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1493",
              "text": "عَلِيِّ بْنِ الْحُسَيْنِ الْيَمَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ الْيَمَانِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:12",
        "text": [
          " كُنْتُ بِبَغْدَادَ فَتَهَيَّأَتْ قَافِلَةٌ لِلْيَمَانِيِّينَ فَأَرَدْتُ الْخُرُوجَ مَعَهَا فَكَتَبْتُ أَلْتَمِسُ الْإِذْنَ فِي ذَلِكَ فَخَرَجَ لَا تَخْرُجْ مَعَهُمْ فَلَيْسَ لَكَ فِي الْخُرُوجِ مَعَهُمْ خِيَرَةٌ وَ أَقِمْ بِالْكُوفَةِ ",
          "قَالَ وَ أَقَمْتُ وَ خَرَجَتِ الْقَافِلَةُ فَخَرَجَتْ عَلَيْهِمْ حَنْظَلَةُ فَاجْتَاحَتْهُمْ وَ كَتَبْتُ أَسْتَأْذِنُ فِي رُكُوبِ الْمَاءِ فَلَمْ يَأْذَنْ لِي فَسَأَلْتُ عَنِ الْمَرَاكِبِ الَّتِي خَرَجَتْ فِي تِلْكَ السَّنَةِ فِي الْبَحْرِ فَمَا سَلِمَ مِنْهَا مَرْكَبٌ خَرَجَ عَلَيْهَا قَوْمٌ مِنَ الْهِنْدِ يُقَالُ لَهُمُ الْبَوَارِجُ فَقَطَعُوا عَلَيْهَا ",
          "قَالَ وَ زُرْتُ الْعَسْكَرَ فَأَتَيْتُ الدَّرْبَ مَعَ الْمَغِيبِ وَ لَمْ أُكَلِّمْ أَحَداً وَ لَمْ أَتَعَرَّفْ إِلَى أَحَدٍ وَ أَنَا أُصَلِّي فِي الْمَسْجِدِ بَعْدَ فَرَاغِي مِنَ الزِّيَارَةِ إِذَا بِخَادِمٍ قَدْ جَاءَنِي فَقَالَ لِي قُمْ فَقُلْتُ لَهُ إِذَنْ إِلَى أَيْنَ فَقَالَ لِي إِلَى الْمَنْزِلِ قُلْتُ وَ مَنْ أَنَا لَعَلَّكَ أَرْسَلْتَ إِلَى غَيْرِي فَقَالَ لَا مَا أَرْسَلْتُ إِلَّا إِلَيْكَ أَنْتَ عَلِيُّ بْنُ الْحُسَيْنِ رَسُولُ جَعْفَرِ بْنِ إِبْرَاهِيمَ ",
          "فَمَرَّ بِي حَتَّى أَنْزَلَنِي فِي بَيْتِ الْحُسَيْنِ بْنِ أَحْمَدَ ثُمَّ سَارَّهُ فَلَمْ أَدْرِ مَا قَالَ لَهُ حَتَّى آتَانِي جَمِيعَ مَا أَحْتَاجُ إِلَيْهِ وَ جَلَسْتُ عِنْدَهُ ثَلَاثَةَ أَيَّامٍ وَ اسْتَأْذَنْتُهُ فِي الزِّيَارَةِ مِنْ دَاخِلٍ فَأَذِنَ لِي فَزُرْتُ لَيْلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from Ali Bin Al Husayn Al Yamani who said, ",
            "‘I was at Baghdad and a caravan got prepared for the Yemenis, and I intended the going out with it. So I wrote (to the 12<sup>th</sup> Imam<sup>asws</sup>) seeking the permission regarding that, and there came out (a note): ‘Do not go out with them, for there isn’t any goodness for you in going out along with them, and stay in Al-Kufa’. ",
            "He (the narrator) said, ‘And I stayed and the caravan went, and (the tribe of) Hanzala invaded them. And I wrote seeking permission regarding sailing the waters, but he<sup>asws</sup> did not permit for me. So I asked about the sailor who went out in the sea during that year, and not one sailor from them was safe. A group from India called Al-Bawarij came out upon them (as pirates) and they cut off upon them (plundered)’. ",
            "He (the narrator) said, ‘And I visited Al-Askar and went over to the (Holy) Shrine in a concealed manner, and I did not speak to anyone and did not introduce (myself) to anyone, and I prayed <span class=\"iTxt\">Salat</span> in the Masjid after my being freed from my Ziyarat, and There was a servant who came over to me, and he said to me, ‘Arise!’. So I said to him, ‘Then to where?’ He said to me, ‘To the house’. I said, ‘And who am I? Perhaps you have been sent to someone else’. He said, ‘No. I have not been sent except to you. You are Ali Bin Al-Husayn, a messenger of Ja’far Bin Ibrahim. ",
            "So he went with me until he lodged me in the house of Al-Husayn Bin Ahmad. Then he held a private conversation with him, and I do not know what he said, until he gave me the entirety of whatever I was needy to, and I was seated with him for three days. And I sought his permission regarding the visitation from inside, and he permitted to me, so I visited at night’."
          ],
          "en.sarwar": [
            " 11. Ali has narrated from al-Nadr al-Bajali from md ibn Yusuf al-Shashi who has said the following “A boil had grown on my heaps. I sought treament from several physicians and spent money but they said that they knew of no medicine for it. I then wrote a letter to him (the twelfth Imam (a.s.) requesting him to pray. He wrote back to me with his signature, “May Allah grant you good health and place you with us in this life and in the life hereafter.” The narrator has said that before the coming of the Friday the boil was gone and it became like the palm of my hand. I then called one of the physicians and showed him the place of the boil and he said, “We had no knowledge of any medicine to cure it.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/183)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1362,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1494",
              "text": "الْحَسَنُ بْنُ الْفَضْلِ بْنِ زَيْدٍ الْيَمَانِيُّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحَسَنُ بْنُ الْفَضْلِ بْنِ زَيْدٍ الْيَمَانِيُّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:13",
        "text": [
          " كَتَبَ أَبِي بِخَطِّهِ كِتَاباً فَوَرَدَ جَوَابُهُ ثُمَّ كَتَبْتُ بِخَطِّي فَوَرَدَ جَوَابُهُ ثُمَّ كَتَبَ بِخَطِّهِ رَجُلٌ مِنْ فُقَهَاءِ أَصْحَابِنَا فَلَمْ يَرِدْ جَوَابُهُ فَنَظَرْنَا فَكَانَتِ الْعِلَّةُ أَنَّ الرَّجُلَ تَحَوَّلَ قَرْمَطِيّاً",
          "قَالَ الْحَسَنُ بْنُ الْفَضْلِ فَزُرْتُ الْعِرَاقَ وَ وَرَدْتُ طُوسَ وَ عَزَمْتُ أَنْ لَا أَخْرُجَ إِلَّا عَنْ بَيِّنَةٍ مِنْ أَمْرِي وَ نَجَاحٍ مِنْ حَوَائِجِي وَ لَوِ احْتَجْتُ أَنْ أُقِيمَ بِهَا حَتَّى أُتَصَدَّقَ قَالَ وَ فِي خِلَالِ ذَلِكَ يَضِيقُ صَدْرِي بِالْمَقَامِ وَ أَخَافُ أَنْ يَفُوتَنِيَ الْحَجُّ قَالَ فَجِئْتُ يَوْماً إِلَى مُحَمَّدِ بْنِ أَحْمَدَ أَتَقَاضَاهُ فَقَالَ لِي صِرْ إِلَى مَسْجِدِ كَذَا وَ كَذَا وَ إِنَّهُ يَلْقَاكَ رَجُلٌ",
          "قَالَ فَصِرْتُ إِلَيْهِ فَدَخَلَ عَلَيَّ رَجُلٌ فَلَمَّا نَظَرَ إِلَيَّ ضَحِكَ وَ قَالَ لَا تَغْتَمَّ فَإِنَّكَ سَتَحُجُّ فِي هَذِهِ السَّنَةِ وَ تَنْصَرِفُ إِلَى أَهْلِكَ وَ وُلْدِكَ سَالِماً قَالَ فَاطْمَأْنَنْتُ وَ سَكَنَ قَلْبِي وَ أَقُولُ ذَا مِصْدَاقُ ذَلِكَ وَ الْحَمْدُ لِلَّهِ",
          "قَالَ ثُمَّ وَرَدْتُ الْعَسْكَرَ فَخَرَجَتْ إِلَيَّ صُرَّةٌ فِيهَا دَنَانِيرُ وَ ثَوْبٌ فَاغْتَمَمْتُ وَ قُلْتُ فِي نَفْسِي جَزَائِي عِنْدَ الْقَوْمِ هَذَا وَ اسْتَعْمَلْتُ الْجَهْلَ فَرَدَدْتُهَا وَ كَتَبْتُ رُقْعَةً وَ لَمْ يُشِرِ الَّذِي قَبَضَهَا مِنِّي عَلَيَّ بِشَيْ‏ءٍ وَ لَمْ يَتَكَلَّمْ فِيهَا بِحَرْفٍ ثُمَّ نَدِمْتُ بَعْدَ ذَلِكَ نَدَامَةً شَدِيدَةً وَ قُلْتُ فِي نَفْسِي كَفَرْتُ بِرَدِّي عَلَى مَوْلَايَ وَ كَتَبْتُ رُقْعَةً أَعْتَذِرُ مِنْ فِعْلِي وَ أَبُوءُ بِالْإِثْمِ وَ أَسْتَغْفِرُ مِنْ ذَلِكَ وَ أَنْفَذْتُهَا وَ قُمْتُ أَتَمَسَّحُ",
          "فَأَنَا فِي ذَلِكَ أُفَكِّرُ فِي نَفْسِي وَ أَقُولُ إِنْ رُدَّتْ عَلَيَّ الدَّنَانِيرُ لَمْ أَحْلُلْ صِرَارَهَا وَ لَمْ أُحْدِثْ فِيهَا حَتَّى أَحْمِلَهَا إِلَى أَبِي فَإِنَّهُ أَعْلَمُ مِنِّي لِيَعْمَلَ فِيهَا بِمَا شَاءَ فَخَرَجَ إِلَى الرَّسُولِ الَّذِي حَمَلَ إِلَيَّ الصُّرَّةَ أَسَأْتَ إِذْ لَمْ تُعْلِمِ الرَّجُلَ إِنَّا رُبَّمَا فَعَلْنَا ذَلِكَ بِمَوَالِينَا وَ رُبَّمَا سَأَلُونَا ذَلِكَ يَتَبَرَّكُونَ بِهِ",
          "وَ خَرَجَ إِلَيَّ أَخْطَأْتَ فِي رَدِّكَ بِرَّنَا فَإِذَا اسْتَغْفَرْتَ اللَّهَ فَاللَّهُ يَغْفِرُ لَكَ فَأَمَّا إِذَا كَانَتْ عَزِيمَتُكَ وَ عَقْدُ نِيَّتِكَ أَلَّا تُحْدِثَ فِيهَا حَدَثاً وَ لَا تُنْفِقَهَا فِي طَرِيقِكَ فَقَدْ صَرَفْنَاهَا عَنْكَ فَأَمَّا الثَّوْبُ فَلَا بُدَّ مِنْهُ لِتُحْرِمَ فِيهِ",
          "قَالَ وَ كَتَبْتُ فِي مَعْنَيَيْنِ وَ أَرَدْتُ أَنْ أَكْتُبَ فِي الثَّالِثِ وَ امْتَنَعْتُ مِنْهُ مَخَافَةَ أَنْ يَكْرَهَ ذَلِكَ فَوَرَدَ جَوَابُ الْمَعْنَيَيْنِ وَ الثَّالِثِ الَّذِي طَوَيْتُ مُفَسَّراً وَ الْحَمْدُ لِلَّهِ ",
          "قَالَ وَ كُنْتُ وَافَقْتُ جَعْفَرَ بْنَ إِبْرَاهِيمَ النَّيْسَابُورِيَّ بِنَيْسَابُورَ عَلَى أَنْ أَرْكَبَ مَعَهُ وَ أُزَامِلَهُ فَلَمَّا وَافَيْتُ بَغْدَادَ بَدَا لِي فَاسْتَقَلْتُهُ وَ ذَهَبْتُ أَطْلُبُ عَدِيلًا فَلَقِيَنِي ابْنُ الْوَجْنَاءِ بَعْدَ أَنْ كُنْتُ صِرْتُ إِلَيْهِ وَ سَأَلْتُهُ أَنْ يَكْتَرِيَ لِي فَوَجَدْتُهُ كَارِهاً فَقَالَ لِي أَنَا فِي طَلَبِكَ وَ قَدْ قِيلَ لِي إِنَّهُ يَصْحَبُكَ فَأَحْسِنْ مُعَاشَرَتَهُ وَ اطْلُبْ لَهُ عَدِيلًا وَ اكْتَرِ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Hassan Bin Al Fazl Bin Zayd Al Yamani who said, ",
            "‘My father wrote a letter (to the 12<sup>th</sup> Imam<sup>asws</sup>) in his handwriting, and its answer came. Then I wrote by my own handwriting, and its answer came. Then a man from the jurists from our companions wrote in his handwriting, but its answer did not come. So we looked into it, and the reason was that the man has changed to (the beliefs of) Qarmatiyya’. ",
            "Al-Hassan Bin Al-Fazl said, ‘I visited Al-Iraq and arrived at Toos, and I was determined that I will not go out except from a proof of my matter (beliefs) and a salvation from my needs, and even if I had complaints, I shall stay in it until ratified. And during that my chest got constricted due to the staying and I feared that I might lose performance of the Hajj. So, one day I went over to Muhammad Bin Ahmad requesting him, and he said to me, ‘Go to Masjid so and so, and a man would meet you there’.  ",
            "He (the narrator) said, ‘So I went to it and a man came over to me. So when he looked at me, he laughed and said, ‘Do not be gloomy, for you would be performing Hajj during this year, and you would be joining to your wife and children safely’. So that gave tranquillity and calmness to my heart and I was saying, that is a confirmation of that, and the Praise is for Allah<sup>azwj</sup>’. ",
            "He (the narrator) said, ‘Then I arrived at Al-Askar, and a bag came to me (from the 12<sup>th</sup> Imam<sup>asws</sup>) wherein were Dinars and a cloth. So I was gloomy and said within myself, ‘My recompense with the people is this?’, and I utilised the ignorance, so I returned it and wrote a note, and he, the one who took it from me, did not indicate anything upon me and did not speak with regards to it by a word. Then I regretted after that with an intense regret and I said within myself, ‘I disbelieve by returning upon my Master<sup>asws</sup>’, and I wrote a note seeking a pardon of my deed and I acknowledged my guild and sought Forgiveness from that, and I sent it and remained rubbing my hands. ",
            "So while I was during that, I thought within myself that if he<sup>asws</sup> were to return the Dinars to me, I will not open its pouch and will not discuss with regards to it until I carry it over to my father, for he is more knowing than I am to do regarding it with whatever he so desires to. So there came to me the messenger who had brought the pouch to me (in the first place): ‘I<sup>asws</sup> am offended when the man does not know that sometimes we<sup>asws</sup> tend to do that with the ones in our<sup>asws</sup> Wilayah and sometimes they ask us that in order to be Blessed by it’. ",
            "And there also came out to me (a letter from the 12<sup>th</sup> Imam<sup>asws</sup>): ‘You erred in rejecting our<sup>asws</sup> righteousness. So when you sought Forgiveness of Allah<sup>azwj</sup>, Allah<sup>azwj</sup> Forgave you, and as for when you were determined and tightened your intention that you will not discuss with regards to it with a discussion nor will you be spending it in your way, so we<sup>asws</sup> have exchanged it away from you. And as for the cloth, so there is no escape from you to be deprived from it’. ",
            "He (the narrator) said, ‘And I wrote regarding two meanings (to be explained) and I wanted to write regarding the third and I was prevented from it out of fear that he<sup>asws</sup> would dislike that. So an answer arrived for the two meanings, and the third which was folded, (was also) explained, and the Praise is for Allah<sup>azwj</sup>’. ",
            "He (the narrator) said, ‘And I agreed with Ja’far Bin Ibrahim Al-Neyshapouri at Meyshapour upon a stipulation that I shall ride with him and accompany him. So when I arrived at Baghdad there was a change of mind for me, and I resigned it and went seeking a replacement. So Ibn Al-Wajna met me afterwards and I had gone to him to ask him that if he could hire for me, but I found him disliking it, and he said to me, ‘I have been seeking you and he<sup>asws</sup> said to me: ‘He would be your companion, therefore go out with him and seek a replacement for him and hire for him’."
          ],
          "en.sarwar": [
            " 12. Ali has narrated from Ali ibn al-Husayn al-Yamani who has said the following “I lived in Baghdad. Once the caravan for the people of Yemen was about to live. I also decided to leave with them. I then wrote to him (the twelfth Imam (a.s.) requesting his permission. The response came, “Do not leave with them. There is nothing good for you in leaving with them. Stay in al-Kufa.” The narrator has said, “ I stayed in al-Kufa and the caravan left but the tribe of Hanzala attacked and looted them. I then wrote for permission to leave by ships on water. Permission was denied. I then found out that of the ships that had traveled that year none reached the destination safely. Indian groups called al-Bawarij had pirated. I then visited the army camp. Near sun set I went to the door (of the shrine of the Imams) quitely. I did speak to anyone and nor introduced myself to anyone. I was praying in the mosque after offering my greeting of peace (to the Imams) that a servant came and said, “Rise up and come with me.” I told him, “Where should we go?” He said, “We will go home.” I then asked, “Do you know who am I? Perhaps you are sent for someone else.” He said, “I have been sent onlyy for you. You are Ali ibn al-Husayn, the messenger of Ja‘far ibn Ibrahim.” He took to the house of al-Husayn ibn Ahmad. He then spoke to him secretly that I did hear what the spoke about. Every thing that I needed was brought for me. I stayed with him for three days. I asked his permission to offer my greetings of peace from inside the house. He granted me permission and I offered my greeting of peace dduring the night.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/184)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1363,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1495",
              "text": "الْحَسَنِ بْنِ عَبْدِ الْحَمِيدِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَبْدِ الْحَمِيدِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:14",
        "text": [
          " شَكَكْتُ فِي أَمْرِ حَاجِزٍ فَجَمَعْتُ شَيْئاً ثُمَّ صِرْتُ إِلَى الْعَسْكَرِ فَخَرَجَ إِلَيَّ لَيْسَ فِينَا شَكٌّ وَ لَا فِيمَنْ يَقُومُ مَقَامَنَا بِأَمْرِنَا رُدَّ مَا مَعَكَ إِلَى حَاجِزِ بْنِ يَزِيدَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Al Hassan Bin Abdul Hameed who said, ",
            "‘I doubted regarding the matter of Hajiz, so I gathered a few things, then went to Al-Askar, and there came out (a letter from the 12<sup>th</sup> Imam<sup>asws</sup>) to me: ‘There isn’t any doubt regarding us<sup>asws</sup> nor regarding the one who are standing in our<sup>asws</sup> place with our<sup>asws</sup> command. Return whatever is with you to Hajiz Bin Yazeed’."
          ],
          "en.sarwar": [
            " 13. Al-Hassan ibn al-Fadl ibn Yazid al-Yamani has said the following. “My father wrote in his own had writing he received back a response. I then wrote in my own hand writing I also received back a response. One of our Fuqaha’ (scholar of law) wrote in his own hand writing but he did not receive any response. We then began to think about it and we found out that the man had changed his belief into that of the Qirmati sect. Al-Hassan ibn al-Fadl has said, “I visited (the holy places in ) and arrived at Tus. I decided not to leave until I will experience evidence in support of my belief and success in achieving my needs even if it would take me to stay until I will receive confirmation.” He has said, “In the mean time I felt depressed because of fear that I might lose the opportunity to perform Hajj.” He has said, “One day I went to see Muhammad ibn Ahmad for help.” He said to me, “Go to so and so mosque. A man will meet you there.” I then went to the mosque and a man came to me. He looked at me and laughed and said, “do not be sad and depressed. You will perform Hajj this year and will return back to your wife and children safely.” The narrator has said, “I gained confidence and my heart felt at peace and I say that is how my wish came true.” The narrator has said, “I then went to the army camp (city of Surra man Ra’a ) and a bag of money with few Dinars and a piece of clothes were sent to me (from the Imam’s office). I felt depressed and said to my self, “Is this how these people treat me and this is how much my reward is with them?” I used ignorance and returned the gift and wrote a letter. The person who brought them to me did not explain or say any thing. I then felt regretful; very strongly and said to myself, “I have turned ungrateful to my master in rejecting his gift. I wrote a letter and begged for forgiveness of my misbehavior. I confessed to my sins and begged for pardon. I sent the letter and remained rubbing my hands against each other. In such condition I was thinking and say to myself, “If the money will be sent to me I will not open the bag and will not say anything about it. I will take it to my father. He knows more than me and will do whatever he would like. At that time a letter had come to the messenger who had brought the bag of money. He was told, “What you did was wrong. You did not inform the man that we sent gifts to our friends and followers and sometimes they ask us for such gift for blessings.” A letter came to me also and it said, “You made a mistake in rejecting the gift but when you asked Allah to forgive you Allah will forgive you. Since your intention was not to open the gift or spent it we have spent it on your behalf. However, you must take the cloth so you can use it for Ehram (during performing certain acts of Hajj).” The narrator has said, “I wrote him about two issue and I wanted to write about a third issue but I did not do so for fear that it might not like it.” The answer for the two issues came back and the meaning of the third one was also explained. All praise belongs to Allah. The narrator has said, “I made a contract with Ja‘far ibn Ibrahim al-Naysaburi in Naysabur to ride share on our journey to Makka. When we arrived in Baghdad I decided to change our agreement. I then went around to find another person for ride sharing. Ibn al-Wajna’.came to see me after that I had already proposed to him ride sharing and hiring a ride and he had expressed his dislike to my my proposal. He said, “I am looking for you and I am told, “He will accompany you. Treat him kindly, find for him ride sharing and hire for him a ride.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/189)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1364,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1496",
              "text": "مُحَمَّدِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ صَالِحٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:15",
        "text": [
          " لَمَّا مَاتَ أَبِي وَ صَارَ الْأَمْرُ لِي كَانَ لِأَبِي عَلَى النَّاسِ سَفَاتِجُ مِنْ مَالِ الْغَرِيمِ فَكَتَبْتُ إِلَيْهِ أُعْلِمُهُ فَكَتَبَ طَالِبْهُمْ وَ اسْتَقْضِ عَلَيْهِمْ ",
          "فَقَضَّانِيَ النَّاسُ إِلَّا رَجُلٌ وَاحِدٌ كَانَتْ عَلَيْهِ سَفْتَجَةٌ بِأَرْبَعِمِائَةِ دِينَارٍ فَجِئْتُ إِلَيْهِ أُطَالِبُهُ فَمَاطَلَنِي وَ اسْتَخَفَّ بِيَ ابْنُهُ وَ سَفِهَ عَلَيَّ فَشَكَوْتُ إِلَى أَبِيهِ فَقَالَ وَ كَانَ مَا ذَا فَقَبَضْتُ عَلَى لِحْيَتِهِ وَ أَخَذْتُ بِرِجْلِهِ وَ سَحَبْتُهُ إِلَى وَسَطِ الدَّارِ وَ رَكَلْتُهُ رَكْلًا كَثِيراً ",
          "فَخَرَجَ ابْنُهُ يَسْتَغِيثُ بِأَهْلِ بَغْدَادَ وَ يَقُولُ قُمِّيٌّ رَافِضِيٌّ قَدْ قَتَلَ وَالِدِي فَاجْتَمَعَ عَلَيَّ مِنْهُمُ الْخَلْقُ فَرَكِبْتُ دَابَّتِي وَ قُلْتُ أَحْسَنْتُمْ يَا أَهْلَ بَغْدَادَ تَمِيلُونَ مَعَ الظَّالِمِ عَلَى الْغَرِيبِ الْمَظْلُومِ أَنَا رَجُلٌ مِنْ أَهْلِ هَمَدَانَ مِنْ أَهْلِ السُّنَّةِ وَ هَذَا يَنْسُبُنِي إِلَى أَهْلِ قُمَّ وَ الرَّفْضِ لِيَذْهَبَ بِحَقِّي وَ مَالِي ",
          "قَالَ فَمَالُوا عَلَيْهِ وَ أَرَادُوا أَنْ يَدْخُلُوا عَلَى حَانُوتِهِ حَتَّى سَكَّنْتُهُمْ وَ طَلَبَ إِلَيَّ صَاحِبُ السَّفْتَجَةِ وَ حَلَفَ بِالطَّلَاقِ أَنْ يُوَفِّيَنِي مَالِي حَتَّى أَخْرَجْتُهُمْ عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Salih who said, ",
            "‘When my father died and the matter (of collecting dues on behalf of the 12<sup>th</sup> Imam<sup>asws</sup>) came upon me, there were promissory notes upon the people from the adversaries. So I wrote to him<sup>asws</sup> letting him<sup>asws</sup> know. So he<sup>asws</sup> wrote: ‘Demand from them and enforce upon them’. ",
            "So the people fulfilled (their debts) except for one man who had a promissory note upon him of four hundred Dinars. So I went over to him seeking it, but he stalled me and his son belittled with me and behaved foolishly. So I complained to his father, and he said, ‘So what was that anyway!’ So I grabbed his beard and seized him by his leg and dragged him to the middle of the house, and kicked him with a lot of kicks.",
            "So his son went out yelling (for help) with the people of Baghdad and he was saying, ‘A Qummy, a Rafizi has killed my father!’ So some people from the gathered upon me, and I rode upon my animal and said, ‘Well done, O people of Baghdad (sarcastically)! You are inclining with the oppressor against the oppressed stranger? I am a man from the people of Hamdan from the Sunnis and this one is linking me to the people of Qumm and the Rafizis in order to go away with my right and my wealth’. ",
            "He (the narrator) said, ‘So they inclined against him and they intended to enter into his shop until I calmed them down, and the owner of the promissory note requested to me and asked for an oath with the divorce that he would be paying me my wealth if I take them (the people) out from him’."
          ],
          "en.sarwar": [
            " 14. Ali ibn Muhammad has narrated from al-Hassan ibn ‘Abd al-Hamid who has said the following. “ I had doubts in the case of Hajiz (as whether the had authorized him or not). I then collected a few items and left for the army camp (the city of Surra man Ra’a The notification that came to said, “There is no doubtfulness in us nor in those who has said the following. who represent us in our affairs. Whatever is with you take them to Hajiz ibn Yazid.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/189)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1365,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/57",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1497",
              "text": "عِدَّةٍ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1036",
              "text": "أَحْمَدَ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1498",
              "text": "الْعَلَاءِ بْنِ رِزْقِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1499",
              "text": "بَدْرٍ غُلَامِ أَحْمَدَ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ الْحَسَنِ وَ الْعَلَاءِ بْنِ رِزْقِ اللَّهِ عَنْ بَدْرٍ غُلَامِ أَحْمَدَ بْنِ الْحَسَنِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:16",
        "text": [
          " وَرَدْتُ الْجَبَلَ وَ أَنَا لَا أَقُولُ بِالْإِمَامَةِ أُحِبُّهُمْ جُمْلَةً إِلَى أَنْ مَاتَ يَزِيدُ بْنُ عَبْدِ اللَّهِ فَأَوْصَى فِي عِلَّتِهِ أَنْ يُدْفَعَ الشِّهْرِيُّ السَّمَنْدُ وَ سَيْفُهُ وَ مِنْطَقَتُهُ إِلَى مَوْلَاهُ ",
          "فَخِفْتُ إِنْ أَنَا لَمْ أَدْفَعِ الشِّهْرِيَّ إِلَى إِذْكُوتَكِينَ نَالَنِي مِنْهُ اسْتِخْفَافٌ فَقَوَّمْتُ الدَّابَّةَ وَ السَّيْفَ وَ الْمِنْطَقَةَ بِسَبْعِمِائَةِ دِينَارٍ فِي نَفْسِي وَ لَمْ أُطْلِعْ عَلَيْهِ أَحَداً فَإِذَا الْكِتَابُ قَدْ وَرَدَ عَلَيَّ مِنَ الْعِرَاقِ وَجِّهِ السَّبْعَ مِائَةِ دِينَارٍ الَّتِي لَنَا قِبَلَكَ مِنْ ثَمَنِ الشِّهْرِيِّ وَ السَّيْفِ وَ الْمِنْطَقَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from a number of our companions, from Ahmad Bin Al Hassan and Al A’ala Bin Rizqillah, from Badr Ghulam Ahmad Bn Al Hassan who said, ",
            "‘I went to Al-Jabal and I was not saying (believing) in the Imamate. I loved them<sup>asws</sup> summarily until when Yazeed Bin Abdullah died, and he bequeathed to me during his illness that Shahry Al-Samand (his horse), and his sword, and his belt to be handed over to his Master<sup>asws</sup>. ",
            "But, I feared that if I do not hand over Al-Shahry (the horse) to Izkowtakeyn (a Turkish official of the Abbaside Caliph), I would be harmed from him frightfully. So I evaluated the animal, and the sword, and the belt for seven hundred Dinars within myself and did not notify anyone upon it, but the letter (from the 12<sup>th</sup> Imam<sup>asws</sup>) had arrived to me from Al-Iraq: ‘Divert (to me<sup>asws</sup>) the seven hundred Dinars which is for us<sup>asws</sup> with you from the price of Al-Shahry (the horse), and the sword, and the belt’."
          ],
          "en.sarwar": [
            " 15. Ali ibn Muhammad has narrated from Muhammad ibn Salih who has said the following. “When my father died and the task (of working is representative of the Imams) was left to me with my father there were promissory notes from those who has said the following. owed (religious dues). I wrote to him (the Imam (a.s.) about the case. He wrote back to me, “Demand from them and make them pay.” People paid what they owed except one man who had signed a promissory note for four hundred Dinars. I went to demand from him what he owed but he procrastinated and took it lightly and his behaved foolishly. I complained to his father and he said, “So what!” I then hold him by his beard and leg and pulled him towards the center of the house and kicked him many times. His son went out and cried for help from the people of Baghdad saying, “He is a Qummi, Rafidi (derogatory name for Shi‘a) he has killed my father.” From the people of Baghdad many gathered around me. I rode my equine animal and said, “Very nice of you people of Baghdad. You support the unjust against a lonely stranger. I am a man from the sunni sect and he calls me a man from Qumm and a Rafidi so that he can destroy my rights.” The narrator has said that people then turned against him and they wanted to enter his store. I then calmed them down. The signatory in the promissory note called me and set upon himself a stipulation with an oath that said, “His wife will be divorced if he did not pay his dues.” My part of the stipulation was to ask the people to leave his place.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/191)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1366,
        "local_index": 17,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/57",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/114",
              "text": "حَدَّثَهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَمَّنْ حَدَّثَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:17",
        "text": [
          " وُلِدَ لِي وَلَدٌ فَكَتَبْتُ أَسْتَأْذِنُ فِي طُهْرِهِ يَوْمَ السَّابِعِ فَوَرَدَ لَا تَفْعَلْ فَمَاتَ يَوْمَ السَّابِعِ أَوِ الثَّامِنِ ثُمَّ كَتَبْتُ بِمَوْتِهِ فَوَرَدَ سَتُخْلَفُ غَيْرَهُ وَ غَيْرَهُ تُسَمِّيهِ أَحْمَدَ وَ مِنْ بَعْدِ أَحْمَدَ جَعْفَراً فَجَاءَ كَمَا قَالَ",
          "قَالَ وَ تَهَيَّأْتُ لِلْحَجِّ وَ وَدَّعْتُ النَّاسَ وَ كُنْتُ عَلَى الْخُرُوجِ فَوَرَدَ نَحْنُ لِذَلِكَ كَارِهُونَ وَ الْأَمْرُ إِلَيْكَ قَالَ فَضَاقَ صَدْرِي وَ اغْتَمَمْتُ وَ كَتَبْتُ أَنَا مُقِيمٌ عَلَى السَّمْعِ وَ الطَّاعَةِ غَيْرَ أَنِّي مُغْتَمٌّ بِتَخَلُّفِي عَنِ الْحَجِّ فَوَقَّعَ لَا يَضِيقَنَّ صَدْرُكَ فَإِنَّكَ سَتَحُجُّ مِنْ قَابِلٍ إِنْ شَاءَ اللَّهُ قَالَ",
          "وَ لَمَّا كَانَ مِنْ قَابِلٍ كَتَبْتُ أَسْتَأْذِنُ فَوَرَدَ الْإِذْنُ فَكَتَبْتُ أَنِّي عَادَلْتُ مُحَمَّدَ بْنَ الْعَبَّاسِ وَ أَنَا وَاثِقٌ بِدِيَانَتِهِ وَ صِيَانَتِهِ فَوَرَدَ الْأَسَدِيُّ نِعْمَ الْعَدِيلُ فَإِنْ قَدِمَ فَلَا تَخْتَرْ عَلَيْهِ فَقَدِمَ الْأَسَدِيُّ وَ عَادَلْتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from the one who narrated it who said, ",
            "‘A son was born for me, and I wrote (to the 12<sup>th</sup> Imam<sup>asws</sup>) seeking permission to clean him on the seventh day and the reply came: ‘Do not do so, for he would die on the seventh day or the eighth’. Then I wrote of his death, and the reply came: ‘You will be replaced with other than him and other than him. You should name him Ahmad, and from after Ahmad, Ja’far’. So they came just as he<sup>asws</sup> had said.",
            "He (the narrator) said, ‘And I prepared for the Hajj and bade farewell to the people, and I was on the verge of going out, and the reply came: ‘We<sup>asws</sup> are abhorrent to that, and the matter is up to you’. So that constricted my chest and I was gloomy and I wrote, ‘I am staying upon the hearing and the obeying, apart from that I am gloomy due to staying behind from the Hajj’. So he<sup>asws</sup> signed: ‘Do not constrict your chest, for you will be performing Hajj the coming year, if Allah<sup>azwj</sup> so Desires’.’",
            "And when it was the next year, I wrote seeking permission, and the reply came, ‘The permission (is granted)’. So I wrote, ‘I want Muhammad Bin Al-Abbas to accompany me and I trust his Religion and his conduct’, and the reply came: ‘Al-Asady is the best of the travel companions, so if he was to (agree to) proceed, then do not choose (anyone else) over him’. So Al-Asady proceeded (agreed to come with me), so I took him as a travel companion’."
          ],
          "en.sarwar": [
            " 16. Ali has narrated from a number of our people from Ahmad ibn al-Hassan and al-‘Ala’ ibn Rizq Allah from Badr Ghulam Ahmad ibn al-Hassan who has said the following. “I began to live in al-Jabal (a town between Baghdad and Azarbayjan) and I did not believe in Imam (the Divine authority of al-Mahddi (a.s.) but I loved them (descendants of Amir al-Mu’minin Ali (a.s.). When Yazid ibn ‘Abdallah (a representative of al-Mahdi (a.s.) died he said in his will that I must give his Shahri Samand (famous Persian) horse, sword and belt to his master (al-Mahdi (a.s.). I was afraid that if I would not give the horse to Edhkutakin (a Turkish official of ‘Abbassid rulers) he will harm me. I by myself then evaluated the items for a seven hundred Dinars and no one knew about it. A letter then came from Iraq that said, “Send us our seven hundred Dinars that are with you for the Shahri (famous Persian horse), the sword and the belt.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/192)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1367,
        "local_index": 18,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1500",
              "text": "الْحَسَنُ بْنُ عَلِيٍّ الْعَلَوِيُّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحَسَنُ بْنُ عَلِيٍّ الْعَلَوِيُّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:18",
        "text": [
          " أَوْدَعَ الْمَجْرُوحُ مِرْدَاسَ بْنَ عَلِيٍّ مَالًا لِلنَّاحِيَةِ وَ كَانَ عِنْدَ مِرْدَاسٍ مَالٌ لِتَمِيمِ بْنِ حَنْظَلَةَ فَوَرَدَ عَلَى مِرْدَاسٍ أَنْفِذْ مَالَ تَمِيمٍ مَعَ مَا أَوْدَعَكَ الشِّيرَازِيُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Hassan Bin Ali Al Alawy said, ",
            "‘Al-Majrouh deposited wealth with Mirdas Bin Ali for the hand (of Imam Al-Mahdi<sup>asws</sup>), and it was so that in the presence of Mirdas was some wealth of Tameem Bin Hanzala (already deposited). So there came (a letter from the 12<sup>th</sup> Imam<sup>asws</sup>) to Mirdas: ‘Send across the wealth of Tameem along with what Al-Shirazy deposited’."
          ],
          "en.sarwar": [
            " 17. Ali has narrated from the one who narrated to him the following. “A boy was born to me. I wrote to him (al-Mahdi (a.s.) for his permission to give the baby a special bath for the ceremony on the seventh day of his birth. The answer came back and it said, “Do not do so.” The boy died on the seventh or the eighth day. I then wrote to him about the death of the boy. He wrote back to me, “He will be succeeded by another and an other. Let his name be ‘Ahmad’ and the name for the one after Ahmad will be Ja‘far.” It came to be as he had said.” The narrator has said, “I made preparation for the journey to Hajj, said farewell to the people and I was about to leave. The message came to me that said, “We do not like it but it is up to you.” I felt depressed and sad and I wrote, “I am steadfast to obey you commands and listen your words except that I feel for missing Hajj.” He then had signed (a note to me) that said, “Do be depressed. You will soon perform Hajj by the will of Allah.” The next year I wrote to ask his permission and the permission came. I then wrote that I have chosen Muhammad ibn al-‘Abbass as a ride sharing partner and that I trusted him for his religion and safety. The message that then came said, “Al-Asadi is a good ride sharing partner. If will come do not chose anyone else besides him. Al-Asadi came and I chose him as the ride sharing partner.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (192/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1368,
        "local_index": 19,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1501",
              "text": "الْحَسَنِ بْنِ عِيسَى الْعُرَيْضِيِّ أَبِي مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عِيسَى الْعُرَيْضِيِّ أَبِي مُحَمَّدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:19",
        "text": [
          " لَمَّا مَضَى أَبُو مُحَمَّدٍ ( عليه السلام ) وَرَدَ رَجُلٌ مِنْ أَهْلِ مِصْرَ بِمَالٍ إِلَى مَكَّةَ لِلنَّاحِيَةِ فَاخْتُلِفَ عَلَيْهِ فَقَالَ بَعْضُ النَّاسِ إِنَّ أَبَا مُحَمَّدٍ ( عليه السلام ) مَضَى مِنْ غَيْرِ خَلَفٍ وَ الْخَلَفُ جَعْفَرٌ وَ قَالَ بَعْضُهُمْ مَضَى أَبُو مُحَمَّدٍ عَنْ خَلَفٍ ",
          "فَبَعَثَ رَجُلًا يُكَنَّى بِأَبِي طَالِبٍ فَوَرَدَ الْعَسْكَرَ وَ مَعَهُ كِتَابٌ فَصَارَ إِلَى جَعْفَرٍ وَ سَأَلَهُ عَنْ بُرْهَانٍ فَقَالَ لَا يَتَهَيَّأُ فِي هَذَا الْوَقْتِ فَصَارَ إِلَى الْبَابِ وَ أَنْفَذَ الْكِتَابَ إِلَى أَصْحَابِنَا فَخَرَجَ إِلَيْهِ آجَرَكَ اللَّهُ فِي صَاحِبِكَ فَقَدْ مَاتَ وَ أَوْصَى بِالْمَالِ الَّذِي كَانَ مَعَهُ إِلَى ثِقَةٍ لِيَعْمَلَ فِيهِ بِمَا يَجِبُ وَ أُجِيبَ عَنْ كِتَابِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Al Hassan Bin Isa Al Ureyz Abu Muhammad who said, ",
            "‘When Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) passed away, a man from the people of Egypt came over with some wealth to Makkah for the hand (of the 12<sup>th</sup> Imam<sup>asws</sup>), and there was a differing over it. So some of the people said, ‘Abu Muhammad<sup>asws</sup> has passed away from without a replacement (successor<sup>asws</sup>), and the replacement is Ja’far’; and some of them said, ‘Abu Muhammad<sup>asws</sup> passed away and he<sup>asws</sup> does have a successor<sup>asws</sup>’. ",
            "So a man teknonymed as Abu Talib was sent, and he arrived at Al Askar, and with him was a letter. So he came to Ja’far and asked him of the proof, and he said, ‘I am not available for this time’. So he came to the door and gave the letter to its owner. So there came out to him (a note): ‘May Allah<sup>azwj</sup> Recompense you regarding your companion, for he has died, and he bequeathed with the wealth which was with him to a reliable one to work with regards to it with what he deems proper, and I<sup>asws</sup> have (already) answered his letter’."
          ],
          "en.sarwar": [
            " 18. Al-Hassan ibn Ali al-‘Alawi has said the following. “Al-Majruh left a certain amount of commodities that was of the dues to the holy location with Mirdas ibn Ali. With Mirdas there was already such commodities that Yatim ibn Hanzala had left. Amessage came to Mirdas and it said, “Send (to us) the commodities of Yatim and whatever al-Shirazi (Majruh) has left with you.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (193/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1369,
        "local_index": 20,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:20",
        "text": [
          " حَمَلَ رَجُلٌ مِنْ أَهْلِ آبَةَ شَيْئاً يُوصِلُهُ وَ نَسِيَ سَيْفاً بِآبَةَ فَأَنْفَذَ مَا كَانَ مَعَهُ فَكَتَبَ إِلَيْهِ مَا خَبَرُ السَّيْفِ الَّذِي نَسِيتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad said, ",
            "‘A man from the people of Abat carried something over to him<sup>asws</sup> and he forgot a sword at Abat. So he (only) gave what was with him. So he<sup>asws</sup> (12<sup>th</sup> Imam<sup>asws</sup>) wrote to him: ‘What is the news of the sword which you forgot?’."
          ],
          "en.sarwar": [
            " 19. Ali ibn Muhammad has narrated from al-Hassan ibn ‘Isa al-‘Uraydi abu Muhammad who has said the following. “When abu Muhammad (a.s.) passed away a man from Egypt came to Makk with a certain amount of commodities that were due to the holy location (office of the Imam (a.s.) People expressed different opinions on the issue. Certain persons said, “Abu Muhammad (a.s.) has passed away and has left no one behind as his successor. Ja‘far is his successor. Others said, “Abu Muhammad (a.s.) passed away and he left his successor behind.. A man called abu Talib was sent to the army camp (the city of Surra man Ra’a) with a letter. He went to see Ja‘far and ask him for the evidence to prove that he is the successor of abu Muhammad (a.s.), Ja‘far said, “It is not available at this time.” He then went to the door and gave the letter to our people and the response that came said, “We present our condolences to you for the death of your friend (the man from Egypt). He has died and he has a will in which he said that the commodities must be given to the trust worthy person to deal with in a proper manner. His letter was answered. When came back to Makka it was just the way he was informed by the holy location (the office of the Imam (a.s.) “"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (193/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1370,
        "local_index": 21,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1502",
              "text": "الْحَسَنُ بْنُ خَفِيفٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحَسَنُ بْنُ خَفِيفٍ عَنْ أَبِيهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:21",
        "text": [
          " بَعَثَ بِخَدَمٍ إِلَى مَدِينَةِ الرَّسُولِ ( صلى الله عليه وآله ) وَ مَعَهُمْ خَادِمَانِ وَ كَتَبَ إِلَى خَفِيفٍ أَنْ يَخْرُجَ مَعَهُمْ فَخَرَجَ مَعَهُمْ فَلَمَّا وَصَلُوا إِلَى الْكُوفَةِ شَرِبَ أَحَدُ الْخَادِمَيْنِ مُسْكِراً فَمَا خَرَجُوا مِنَ الْكُوفَةِ حَتَّى وَرَدَ كِتَابٌ مِنَ الْعَسْكَرِ بِرَدِّ الْخَادِمِ الَّذِي شَرِبَ الْمُسْكِرَ وَ عُزِلَ عَنِ الْخِدْمَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Hassan Bin Khafeef, from his father who said, ",
            "‘He<sup>asws</sup> sent servants to the city of the Rasool<sup>saww</sup> and with them were two servants, and he<sup>asws</sup> wrote to Khafeef that he goes out with them. So he went out with them, and when they arrived at Al-Kufa, one of the two servants drank an intoxicant, and they had not gone out from Al-Kufa until there came a letter (from the 12<sup>th</sup> Imam<sup>asws</sup>) from Al-Askar: ‘Return the servant who drank the intoxicant and remove him from the service’."
          ],
          "en.sarwar": [
            " 20. Ali ibn Muhammad has said the following. “From A’ba (name of a town) certain items of property that belonged to the holy location (office of the Imam (a.s.) were to deliver to him ((the Imam (a.s.) but a sword that was part of such property was forgotten and remained in A’ba. When the delivery was made a letter came to him that said, “What about the sword that you forgot and left in A’ba?”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/194)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1371,
        "local_index": 22,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1503",
              "text": "أَحْمَدَ بْنِ أَبِي عَلِيِّ بْنِ غِيَاثٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1036",
              "text": "أَحْمَدَ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ أَبِي عَلِيِّ بْنِ غِيَاثٍ عَنْ أَحْمَدَ بْنِ الْحَسَنِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:22",
        "text": [
          " أَوْصَى يَزِيدُ بْنُ عَبْدِ اللَّهِ بِدَابَّةٍ وَ سَيْفٍ وَ مَالٍ وَ أُنْفِذَ ثَمَنُ الدَّابَّةِ وَ غَيْرُ ذَلِكَ وَ لَمْ يُبْعَثِ السَّيْفُ فَوَرَدَ كَانَ مَعَ مَا بَعَثْتُمْ سَيْفٌ فَلَمْ يَصِلْ أَوْ كَمَا قَالَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ahmad Bin Abu Ali Bin Giyas, from Ahmad Bin Al Hassan who said, ",
            "‘Yazeed Bin Abdullah bequeathed with an animal, and a sword and some wealth. The price of the animal and other than that was sent across, and the sword was not sent. So there came (a letter from the 12<sup>th</sup> Imam<sup>asws</sup>): ‘It was so that along with whatever you sent, there was a sword, and it has not arrived’, or said like that’."
          ],
          "en.sarwar": [
            " 21. Al-Hassan ibn Khafif has narrated from his father who has said the following. “Imam al-Mahdi (a.s.) had sent certain servants to al-Madina of the Messenger of Allah and among them were two servants. He had written to Khafif to leave with them. He then left with them and they reached al-Kufa where one of the two servants had consumed alcohol. Before the would al-Kufa a letter came to them from the army camp (city of Surra man Ra’a) that said, “Send back the servant who has consumed alcohol and remove him from the service.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/194)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1372,
        "local_index": 23,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1504",
              "text": "مُحَمَّدِ بْنِ عَلِيِّ بْنِ شَاذَانَ النَّيْسَابُورِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ شَاذَانَ النَّيْسَابُورِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:23",
        "text": [
          " اجْتَمَعَ عِنْدِي خَمْسُمِائَةِ دِرْهَمٍ تَنْقُصُ عِشْرِينَ دِرْهَماً فَأَنِفْتُ أَنْ أَبْعَثَ بِخَمْسِمِائَةٍ تَنْقُصُ عِشْرِينَ دِرْهَماً فَوَزَنْتُ مِنْ عِنْدِي عِشْرِينَ دِرْهَماً وَ بَعَثْتُهَا إِلَى الْأَسَدِيِّ وَ لَمْ أَكْتُبْ مَا لِي فِيهَا فَوَرَدَ وَصَلَتْ خَمْسُمِائَةِ دِرْهَمٍ لَكَ مِنْهَا عِشْرُونَ دِرْهَماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Ali Bin Shazan Al Neyshapouri who said, ",
            "‘Five hundred Dirhams less twenty Dirhams (480) were gathered in my presence, so I resented sending five hundred Dirhams less twenty Dirhams, so I added twenty Dirhams from myself and sent these across to Al-Asady, and I did not write what was for me in it, and there came (a letter from the 12<sup>th</sup> Imam<sup>asws</sup>): ‘There have arrived five hundred Dirhams, for you from it were twenty Dirhams’."
          ],
          "en.sarwar": [
            " 22. Ali ibn Muhammad has narrated from Ahmad ibn abu Ali ibn Ghiyath from Ahmad ibn al-Hassan who has said the following. “ Yazid ibn ‘Abdallah has said in his will to sent a horse, a sword and certain other properties to holy location (office of the Imam (a.s.). The money from the sale of the horse and other properties were delivered to the holy location but the sword was forgotten. A message then came that said, “With the items that you sent there was a sword that has not reached us.” Or the message was in similar words.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (197/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1373,
        "local_index": 24,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/146",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:24",
        "text": [
          " كَانَ يَرِدُ كِتَابُ أَبِي مُحَمَّدٍ ( عليه السلام ) فِي الْإِجْرَاءِ عَلَى الْجُنَيْدِ قَاتِلِ فَارِسَ وَ أَبِي الْحَسَنِ وَ آخَرَ فَلَمَّا مَضَى أَبُو مُحَمَّدٍ ( عليه السلام ) وَرَدَ اسْتِئْنَافٌ مِنَ الصَّاحِبِ لِإِجْرَاءِ أَبِي الْحَسَنِ وَ صَاحِبِهِ وَ لَمْ يَرِدْ فِي أَمْرِ الْجُنَيْدِ بِشَيْ‏ءٍ قَالَ فَاغْتَمَمْتُ لِذَلِكَ فَوَرَدَ نَعْيُ الْجُنَيْدِ بَعْدَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary who said, ",
            "‘It was so that the letter of Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) came regarding the procedure upon Al-Junayd, killer of Faris, and Abu Al-Hassan and others. So when Abu Muhammad<sup>asws</sup> passed away, the coming of the letters resumed of the procedure of Abu Al-Hassan and his companions, and there was no referral of the matter of Al-Junayd with anything. So I was gloomy due to that, and there came the news of death of Al-Juneyd after that’."
          ],
          "en.sarwar": [
            " 23. Ali ibn Muhammad has narrated from Muhammad ibn Ali ibn Shadhan al-Naysaburi who has said the following. “Five hundred Dirhams less twenty was collected with me. I decided to sent them but I did not like to send five hundred less twenty. I then added twenty Dirhams to it from my own money and sent them to al-Asadi without any mention of what was therein. The message that came to me said, “Five hundred Dirhams of which twenty were yours have reached (us).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (198/ 6)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (60/ 1)"
        ],
        "index": 1374,
        "local_index": 25,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1496",
              "text": "مُحَمَّدِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ صَالِحٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:25",
        "text": [
          " كَانَتْ لِي جَارِيَةٌ كُنْتُ مُعْجَباً بِهَا فَكَتَبْتُ أَسْتَأْمِرُ فِي اسْتِيلَادِهَا فَوَرَدَ اسْتَوْلِدْهَا وَ يَفْعَلُ اللَّهُ مَا يَشَاءُ فَوَطِئْتُهَا فَحَبِلَتْ ثُمَّ أَسْقَطَتْ فَمَاتَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Salih who said, ",
            "‘There was a maid of mine whom I was fascinated with, and I wrote for the orders with regards to procreating with her. So there arrived (a letter from the 12<sup>th</sup> Imam<sup>asws</sup>): ‘Procreate with her and Allah<sup>azwj</sup> Does whatever He<sup>azwj</sup> so Desires to’. So I copulated with her and she became pregnant, then she miscarried and she died’."
          ],
          "en.sarwar": [
            " 24. It is narrated from al-Husayn ibn Muhammad al-Ash‘ari who has said the following. “The letters of abu Muhammad (a.s.) would come about the matters related to al-Junayd, who killed Fars, abu al-Hassan and others. When he passed away letters about the issues related to abu al-Hassan and his friend continued coming from (Imam al-Mahdi (a.s.) but there was no mention of al-Junayd. I became depressed about it. Thereafter, the news of the death of al-Junayd reached us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/199)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1375,
        "local_index": 26,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:26",
        "text": [
          " كَانَ ابْنُ الْعَجَمِيِّ جَعَلَ ثُلُثَهُ لِلنَّاحِيَةِ وَ كَتَبَ بِذَلِكَ وَ قَدْ كَانَ قَبْلَ إِخْرَاجِهِ الثُّلُثَ دَفَعَ مَالًا لِابْنِهِ أَبِي الْمِقْدَامِ لَمْ يَطَّلِعْ عَلَيْهِ أَحَدٌ فَكَتَبَ إِلَيْهِ فَأَيْنَ الْمَالُ الَّذِي عَزَلْتَهُ لِأَبِي الْمِقْدَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad said, ",
            "‘It was so that Ibn Al-Ajamy had made his third (of the estate) to be for the hand (of the 12<sup>th</sup> Imam<sup>asws</sup>) and wrote with that, and before his extraction of the third he had handed over some wealth to his son Abu Al-Miqdam, not having notified anyone upon it. So he<sup>asws</sup> wrote to him: ‘Where is the wealth which you isolated for Abu Al-Miqdam?’."
          ],
          "en.sarwar": [
            " 25. Ali ibn Muhammad has narrated from Muhammad ibn Salih who has said the following. “I had a female slave that had attracted my attention. I wrote to him (Imam al-Mahdi (a.s.) requesting permission to have a child from her. The answer came, “You may do so but Allah does whatever He wants.” I went to bed with her and she became pregnant. The fetus fell off prematurely and she died.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/199)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1376,
        "local_index": 27,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1505",
              "text": "أَبِي عَقِيلٍ عِيسَى بْنِ نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَبِي عَقِيلٍ عِيسَى بْنِ نَصْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:27",
        "text": [
          " كَتَبَ عَلِيُّ بْنُ زِيَادٍ الصَّيْمَرِيُّ يَسْأَلُ كَفَناً فَكَتَبَ إِلَيْهِ إِنَّكَ تَحْتَاجُ إِلَيْهِ فِي سَنَةِ ثَمَانِينَ فَمَاتَ فِي سَنَةِ ثَمَانِينَ وَ بَعَثَ إِلَيْهِ بِالْكَفَنِ قَبْلَ مَوْتِهِ بِأَيَّامٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abu Aqeel Isa Bin Nasr who said, ",
            "‘Ali Bin Ziyad Al-Saymari wrote asking for a shroud. So he wrote to him<sup>asws</sup> (the 12<sup>th</sup> Imam<sup>asws</sup>) in the year (two hundred and) eighty, and he did die in the year (two hundred and) eighty, and he<sup>asws</sup> sent the shroud to him before his death by two days’."
          ],
          "en.sarwar": [
            " 26. Ali ibn Muhammad has said the following. “Ibn al-‘Ajami in his will had set aside one third of his properties for the holy location (office of the Imam (a.s.) and had written the deed for it. Before he would take the one third out of his properties he gave a certain amount to his son, abu al-Miqdam, of which no one had any knowledge. He (Imam al-Mahdi (a.s.) wrote to him, “Where is the property that you set aside for abu al-Miqdam?”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/199)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1377,
        "local_index": 28,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1506",
              "text": "مُحَمَّدِ بْنِ هَارُونَ بْنِ عِمْرَانَ الْهَمَذَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ هَارُونَ بْنِ عِمْرَانَ الْهَمَذَانِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:28",
        "text": [
          " كَانَ لِلنَّاحِيَةِ عَلَيَّ خَمْسُمِائَةِ دِينَارٍ فَضِقْتُ بِهَا ذَرْعاً ثُمَّ قُلْتُ فِي نَفْسِي لِي حَوَانِيتُ اشْتَرَيْتُهَا بِخَمْسِمِائَةٍ وَ ثَلَاثِينَ دِينَاراً قَدْ جَعَلْتُهَا لِلنَّاحِيَةِ بِخَمْسِمِائَةِ دِينَارٍ وَ لَمْ أَنْطِقْ بِهَا فَكَتَبَ إِلَى مُحَمَّدِ بْنِ جَعْفَرٍ اقْبِضِ الْحَوَانِيتَ مِنْ مُحَمَّدِ بْنِ هَارُونَ بِالْخَمْسِمِائَةِ دِينَارٍ الَّتِي لَنَا عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Haroun Bin Imran Al Hamdany who said, ",
            "‘There was (a debt) upon me of five hundred Dinars for the hand (of the 12<sup>th</sup> Imam<sup>asws</sup>), and I was constricted due to it and fed up. Then I said within myself, ‘The shops which I have acquired with five hundred and thirty Dinars, I have made these to be for the hand (of the 12<sup>th</sup> Imam<sup>asws</sup>) for five hundred Dinars’, and I did not speak with it. So he<sup>asws</sup> wrote to Muhammad Bin Ja’far: ‘Seize the shops from Muhammad Bin Haroun due to the five hundred Dinars which are for us<sup>asws</sup> upon him’."
          ],
          "en.sarwar": [
            " 27. Ali ibn Muhammad has narrated from abu ‘Aqil ‘Isa ibn Nasr who has said the following. “Ali ibn Ziyad al-Saynari wrote a letter to request for a shroud. He (al-Mahdi (a.s.) wrote back to him, “You will need it in the year eighty.” He died in the year eighty and the shroud was sent to him a few days before his death.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/199)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1378,
        "local_index": 29,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:29",
        "text": [
          " بَاعَ جَعْفَرٌ فِيمَنْ بَاعَ صَبِيَّةً جَعْفَرِيَّةً كَانَتْ فِي الدَّارِ يُرَبُّونَهَا فَبَعَثَ بَعْضَ الْعَلَوِيِّينَ وَ أَعْلَمَ الْمُشْتَرِيَ خَبَرَهَا فَقَالَ الْمُشْتَرِي قَدْ طَابَتْ نَفْسِي بِرَدِّهَا وَ أَنْ لَا أُرْزَأَ مِنْ ثَمَنِهَا شَيْئاً فَخُذْهَا فَذَهَبَ الْعَلَوِيُّ فَأَعْلَمَ أَهْلَ النَّاحِيَةِ الْخَبَرَ فَبَعَثُوا إِلَى الْمُشْتَرِي بِأَحَدٍ وَ أَرْبَعِينَ دِينَاراً وَ أَمَرُوهُ بِدَفْعِهَا إِلَى صَاحِبِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad said, ",
            "‘Ja’far (brother of the 12<sup>th</sup> Imam<sup>asws</sup>) sold a Ja’farite female child among what he sold, who was in the house being nourished (by the 12<sup>th</sup> Imam<sup>asws</sup>). So one of the Alawites went to the buyer informing of her news, and the buyer said, ‘I have made good with myself to return her, if I could get something from her price’. So the Alawite went and informed the people of the hand (of the 12<sup>th</sup> Imam<sup>asws</sup> of the news, and they sent to the buyer one hundred and forty Dinars and instructed him with handing her over to her guardian’."
          ],
          "en.sarwar": [
            " 28. Ali ibn Muhammad has narrated from Muhammad ibn Harun ibn ‘Imran al-Hamadani who has said the following. “I owed five hundred Dinars to the holy location (office of Imam al-Mahdi (a.s.). I felt extremely depressed about it. I said to myself, “The stores that have bought was for five hundred thirty Dinars. I will set them aside for the holy location (office of Imam al-Mahdi (a.s.).” However I had not said anything in words. He wrote to Muhammad ibn Ja‘far, “Take possession of the stores from Muhammad ibn Harun as payment for the five hundred Dinars that he owed us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (200/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1379,
        "local_index": 30,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1507",
              "text": "الْحُسَيْنُ بْنُ الْحَسَنِ الْعَلَوِيُّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ الْحَسَنِ الْعَلَوِيُّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:30",
        "text": [
          " كَانَ رَجُلٌ مِنْ نُدَمَاءِ روزحسنى وَ آخَرُ مَعَهُ فَقَالَ لَهُ هُوَ ذَا يَجْبِي الْأَمْوَالَ وَ لَهُ وُكَلَاءُ وَ سَمَّوْا جَمِيعَ الْوُكَلَاءِ فِي النَّوَاحِي وَ أُنْهِيَ ذَلِكَ إِلَى عُبَيْدِ اللَّهِ بْنِ سُلَيْمَانَ الْوَزِيرِ فَهَمَّ الْوَزِيرُ بِالْقَبْضِ عَلَيْهِمْ فَقَالَ السُّلْطَانُ اطْلُبُوا أَيْنَ هَذَا الرَّجُلُ فَإِنَّ هَذَا أَمْرٌ غَلِيظٌ ",
          "فَقَالَ عُبَيْدُ اللَّهِ بْنُ سُلَيْمَانَ نَقْبِضُ عَلَى الْوُكَلَاءِ فَقَالَ السُّلْطَانُ لَا وَ لَكِنْ دُسُّوا لَهُمْ قَوْماً لَا يُعْرَفُونَ بِالْأَمْوَالِ فَمَنْ قَبَضَ مِنْهُمْ شَيْئاً قُبِضَ عَلَيْهِ ",
          "قَالَ فَخَرَجَ بِأَنْ يَتَقَدَّمَ إِلَى جَمِيعِ الْوُكَلَاءِ أَنْ لَا يَأْخُذُوا مِنْ أَحَدٍ شَيْئاً وَ أَنْ يَمْتَنِعُوا مِنْ ذَلِكَ وَ يَتَجَاهَلُوا الْأَمْرَ فَانْدَسَّ لِمُحَمَّدِ بْنِ أَحْمَدَ رَجُلٌ لَا يَعْرِفُهُ وَ خَلَا بِهِ فَقَالَ مَعِي مَالٌ أُرِيدُ أَنْ أُوصِلَهُ فَقَالَ لَهُ مُحَمَّدٌ غَلِطْتَ أَنَا لَا أَعْرِفُ مِنْ هَذَا شَيْئاً فَلَمْ يَزَلْ يَتَلَطَّفُهُ وَ مُحَمَّدٌ يَتَجَاهَلُ عَلَيْهِ وَ بَثُّوا الْجَوَاسِيسَ وَ امْتَنَعَ الْوُكَلَاءُ كُلُّهُمْ لِمَا كَانَ تَقَدَّمَ إِلَيْهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Al Hassan Al Alawy said, ",
            "‘There was a man from the informants of Rouz Hasany, and another one was with him, and he said to him, ‘He<sup>asws</sup> is that (Imam<sup>asws</sup>). The wealth comes to him<sup>asws</sup>, and for him<sup>asws</sup> are agents’, and he named the entirety of the agents in the surrounding areas, and that ended up to Ubeydullah Bin Suleyman, the Vizier. So the Vizier thought of capturing them, but the Sultan said, ‘Seek where this man<sup>asws</sup> is, for this is a serious matter’. ",
            "So Ubeydullah Bin Suleyman said, ‘We should capture the agents’, but the Sultan said, ‘No, but send a group of people with some wealth to them whom they do not recognise, and the one from them who takes possession of anything, capture him’.  ",
            "He (the narrator) said, ‘So there came out (a letter) to the entirety of the agents that they should not be taking anything from anyone, and that they should be preventing from that and be ignorant of the matter. So a man came over to Muhammad Bin Ahmad whom he did not recognise, and isolated with him, then said to him, ‘There is some wealth with me I am intending to deliver to him<sup>asws</sup>’. So Muhammad said to him, ‘You are mistaken. I do not know anything from this’. But he did not cease to be nice to him, and Muhammad kept on being ignorant over it, and they sent spies across and the agents, all of them refused (to take anything) due to what (message) had proceeded to them’."
          ],
          "en.sarwar": [
            " 29. Ali ibn Muhammad has said the following. “Ja‘far (the impostor) sold of the items that he sold a Ja‘fari (descendants of Ja‘far ibn abu Talib) female child that they (family of abu Muhammad (a.s.) had brought up. A certain ‘Alawi person informed the buyer about the female child. The buyer said, “I will be glad to return if someone will pay me what I have paid.” He then informed the people of the holy location (office of Imam al-Mahdi (a.s.). They sent forty one Dinars to the slave trader and asked him to return her back to her people.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (200/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1380,
        "local_index": 31,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:125:31",
        "text": [
          " خَرَجَ نَهْيٌ عَنْ زِيَارَةِ مَقَابِرِ قُرَيْشٍ وَ الْحَيْرِ فَلَمَّا كَانَ بَعْدَ أَشْهُرٍ دَعَا الْوَزِيرُ الْبَاقَطَائِيَّ فَقَالَ لَهُ الْقَ بَنِي الْفُرَاتِ وَ الْبُرْسِيِّينَ وَ قُلْ لَهُمْ لَا يَزُورُوا مَقَابِرَ قُرَيْشٍ فَقَدْ أَمَرَ الْخَلِيفَةُ أَنْ يُتَفَقَّدَ كُلُّ مَنْ زَارَ فَيُقْبَضَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad said, ",
            "‘A prohibition order came out (from the 12<sup>th</sup> Imam<sup>asws</sup>) from visiting the graves of the Qureysh and Al-Ha’ir. So when it was after a few months, the Vizier called Al-Baqtai’y and said to him, ‘Meet up with the Clan of Al-Furat and Al-Bursiyyeen and say to them, ‘You should not be visiting the graves of the Qureysh for it is the order of the Caliph that he would inspect everyone who visits and be arrested over it’."
          ],
          "en.sarwar": [
            " 30. Al-Husayn ibn al-Hassan al-‘Alawi has said the following. “A man who was an informer for Ruz Hassani with another man with him once said to Ruz, “This man (al-Mahdi (a.s.) is out there. Money is collected for him. He has representatives in many places. They mentioned his representatives by their names in different areas. This news reached ‘Ubaydallah ibn Sulayman, the vizier. The Vizier decided to arrest these representatives. The Sultan said, “Find out. Where is this man? This is a serious matter.” ‘Ubaydallah ibn Sulayman then said, “We will arrest the representatives, the agent.” The Sultan said, “No, you must send your undercover agents who would pose to them as devotees ready to pay their dues to their Imam. If they accepted the funds then arrest them.” The narrator has said that message came out from the holy location (office of Imam al-Mahdi (a.s.) to inform all the representatives not to accept any dues from anyone, deny knowing anything about the Imam (a.s.) and say that they have no information. A man who was an undercover agent came to Muhammad ibn Ahmad whom he did not know. The undercover agent spoke to him privately and said, “I have certain funds with me and I want it to be delivered to the holy location (office of Imam al-Mahdi (a.s.).” Muhammad said to him, “You have made a mistake. I do not know anything about it. He would insist and try to show kindness and Muhammad would deny having any knowledge of it. The spies spread to all places but the representatives refuse to accept any funds because of the message that was dilivered to them before hand.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (201/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": " "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1508",
              "text": "31ـ عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": " 31ـ عَلِيُّ بْنُ مُحَمَّدٍ قَالَ"
        },
        "part_type": "Hadith",
        "text": [
          " خَرَجَ نَهْيٌ عَنْ زِيَارَةِ مَقَابِرِ قُرَيْشٍ وَالْحَيْرِ فَلَمَّا كَانَ بَعْدَ أَشْهُرٍ دَعَا الْوَزِيرُ الْبَاقَطَائِيَّ فَقَالَ لَهُ الْقَ بَنِي الْفُرَاتِ وَالْبُرْسِيِّينَ وَقُلْ لَهُمْ لا يَزُورُوا مَقَابِرَ قُرَيْشٍ فَقَدْ أَمَرَ الْخَلِيفَةُ أَنْ يُتَفَقَّدَ كُلُّ مَنْ زَارَ فَيُقْبَضَ عَلَيْهِ."
        ],
        "translations": {
          "en.sarwar": [
            " 31. Ali ibn Muhammad has said the following. “A prohibition to visit the Quryash cemetery and al-Hira (Karbala) came out of the holy location (office of Imam al-Mahdi (a.s.). After a few months the Vizier (abu al-Fath Ja‘far ibn Furat) summoned al-Baqtia, and said to him, “Meet the clan of bnu Furat and al-Bursiyin and tell them not to visit Quraysh cemetery because the Caliph has decide to see all those who would visit these places be arrested.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:125",
  "kind": "verse_list"
}