{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 126"
        },
        "path": "/books/al-kafi:1:4:126",
        "titles": {
          "ar": "باب مَا جَاءَ فِي الِاثْنَيْ عَشَرَ وَ النَّصِّ عَلَيْهِمْ ( عليهم السلام )",
          "en": "Chapter 126 – What has come regarding the twelve and the text upon them<sup>asws</sup>"
        }
      }
    ],
    "index": 184,
    "local_index": 126,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:126",
    "titles": {
      "ar": "باب مَا جَاءَ فِي الِاثْنَيْ عَشَرَ وَ النَّصِّ عَلَيْهِمْ ( عليهم السلام )",
      "en": "Chapter 126 – What has come regarding the twelve and the text upon them<sup>asws</sup>"
    },
    "verse_count": 20,
    "verse_start_index": 1380,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/203)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1381,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ أَبِي هَاشِمٍ دَاوُدَ بْنِ الْقَاسِمِ الْجَعْفَرِيِّ عَنْ أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) قَالَ أَقْبَلَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ مَعَهُ الْحَسَنُ بْنُ عَلِيٍّ ( عليه السلام ) وَ هُوَ مُتَّكِئٌ عَلَى يَدِ سَلْمَانَ فَدَخَلَ الْمَسْجِدَ الْحَرَامَ فَجَلَسَ إِذْ أَقْبَلَ رَجُلٌ حَسَنُ الْهَيْئَةِ وَ اللِّبَاسِ فَسَلَّمَ عَلَى أَمِيرِ الْمُؤْمِنِينَ فَرَدَّ عَلَيْهِ السَّلَامَ فَجَلَسَ ثُمَّ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَسْأَلُكَ عَنْ ثَلَاثِ مَسَائِلَ إِنْ أَخْبَرْتَنِي بِهِنَّ عَلِمْتُ أَنَّ الْقَوْمَ رَكِبُوا مِنْ أَمْرِكَ مَا قُضِيَ عَلَيْهِمْ وَ أَنْ لَيْسُوا بِمَأْمُونِينَ فِي دُنْيَاهُمْ وَ آخِرَتِهِمْ وَ إِنْ تَكُنِ الْأُخْرَى عَلِمْتُ أَنَّكَ وَ هُمْ شَرَعٌ سَوَاءٌ ",
          "فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) سَلْنِي عَمَّا بَدَا لَكَ قَالَ أَخْبِرْنِي عَنِ الرَّجُلِ إِذَا نَامَ أَيْنَ تَذْهَبُ رُوحُهُ وَ عَنِ الرَّجُلِ كَيْفَ يَذْكُرُ وَ يَنْسَى وَ عَنِ الرَّجُلِ كَيْفَ يُشْبِهُ وَلَدُهُ الْأَعْمَامَ وَ الْأَخْوَالَ فَالْتَفَتَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِلَى الْحَسَنِ فَقَالَ يَا أَبَا مُحَمَّدٍ أَجِبْهُ",
          "قَالَ فَأَجَابَهُ الْحَسَنُ ( عليه السلام ) فَقَالَ الرَّجُلُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ لَمْ أَزَلْ أَشْهَدُ بِهَا وَ أَشْهَدُ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ وَ لَمْ أَزَلْ أَشْهَدُ بِذَلِكَ وَ أَشْهَدُ أَنَّكَ وَصِيُّ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ الْقَائِمُ بِحُجَّتِهِ وَ أَشَارَ إِلَى أَمِيرِ الْمُؤْمِنِينَ وَ لَمْ أَزَلْ أَشْهَدُ بِهَا وَ أَشْهَدُ أَنَّكَ وَصِيُّهُ وَ الْقَائِمُ بِحُجَّتِهِ وَ أَشَارَ إِلَى الْحَسَنِ ( عليه السلام ) وَ أَشْهَدُ أَنَّ الْحُسَيْنَ بْنَ عَلِيٍّ وَصِيُّ أَخِيهِ وَ الْقَائِمُ بِحُجَّتِهِ بَعْدَهُ",
          "وَ أَشْهَدُ عَلَى عَلِيِّ بْنِ الْحُسَيْنِ أَنَّهُ الْقَائِمُ بِأَمْرِ الْحُسَيْنِ بَعْدَهُ وَ أَشْهَدُ عَلَى مُحَمَّدِ بْنِ عَلِيٍّ أَنَّهُ الْقَائِمُ بِأَمْرِ عَلِيِّ بْنِ الْحُسَيْنِ وَ أَشْهَدُ عَلَى جَعْفَرِ بْنِ مُحَمَّدٍ بِأَنَّهُ الْقَائِمُ بِأَمْرِ مُحَمَّدٍ وَ أَشْهَدُ عَلَى مُوسَى أَنَّهُ الْقَائِمُ بِأَمْرِ جَعْفَرِ بْنِ مُحَمَّدٍ وَ أَشْهَدُ عَلَى عَلِيِّ بْنِ مُوسَى أَنَّهُ الْقَائِمُ بِأَمْرِ مُوسَى بْنِ جَعْفَرٍ وَ أَشْهَدُ عَلَى مُحَمَّدِ بْنِ عَلِيٍّ أَنَّهُ الْقَائِمُ بِأَمْرِ عَلِيِّ بْنِ مُوسَى وَ أَشْهَدُ عَلَى عَلِيِّ بْنِ مُحَمَّدٍ بِأَنَّهُ الْقَائِمُ بِأَمْرِ مُحَمَّدِ بْنِ عَلِيٍّ",
          "وَ أَشْهَدُ عَلَى الْحَسَنِ بْنِ عَلِيٍّ بِأَنَّهُ الْقَائِمُ بِأَمْرِ عَلِيِّ بْنِ مُحَمَّدٍ وَ أَشْهَدُ عَلَى رَجُلٍ مِنْ وُلْدِ الْحَسَنِ لَا يُكَنَّى وَ لَا يُسَمَّى حَتَّى يَظْهَرَ أَمْرُهُ فَيَمْلَأَهَا عَدْلًا كَمَا مُلِئَتْ جَوْراً وَ السَّلَامُ عَلَيْكَ يَا أَمِيرَ الْمُؤْمِنِينَ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ",
          "ثُمَّ قَامَ فَمَضَى فَقَالَ أَمِيرُ الْمُؤْمِنِينَ يَا أَبَا مُحَمَّدٍ اتْبَعْهُ فَانْظُرْ أَيْنَ يَقْصِدُ فَخَرَجَ الْحَسَنُ بْنُ عَلِيٍّ ( عليه السلام ) فَقَالَ مَا كَانَ إِلَّا أَنْ وَضَعَ رِجْلَهُ خَارِجاً مِنَ الْمَسْجِدِ فَمَا دَرَيْتُ أَيْنَ أَخَذَ مِنْ أَرْضِ اللَّهِ فَرَجَعْتُ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَأَعْلَمْتُهُ فَقَالَ يَا أَبَا مُحَمَّدٍ أَ تَعْرِفُهُ قُلْتُ اللَّهُ وَ رَسُولُهُ وَ أَمِيرُ الْمُؤْمِنِينَ أَعْلَمُ قَالَ هُوَ الْخَضِرُ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from Abu Hashim Dawood Bin al Qasim Al Ja’fary, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> came over and with him<sup>asws</sup> was Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>, and he<sup>asws</sup> was leaning upon the hand of Salman<sup>as</sup>. So he<sup>asws</sup> entered the Sacred Masjid and sat down, and a man of good personality and clothing came and greeted upon Amir Al-Momineen<sup>asws</sup>. So he<sup>asws</sup> returned the greetings, and he sat down, then said, ‘O Amir Al-Momineen<sup>asws</sup>! I shall ask you<sup>asws</sup> three questions. If you<sup>asws</sup> were to inform me with these, I shall know that the people who are going against your<sup>asws</sup> command, it is what would be Judged against them and that they are not with safety in their world and in their Hereafter; and if it happens to be other, I shall know that you<sup>asws</sup> and they are equal in Law’. ",
            "So Amir Al-Momineen<sup>asws</sup> said to him: ‘Ask me<sup>asws</sup> about whatever comes to you’. He said, ‘Inform me about the man when he sleeps, where does his spirit go? And about the man, how does he remember and forget? And about the man, how do his children resemble the paternal uncles and the maternal uncles?’ So Amir Al-Momineen<sup>asws</sup> turned towards Al-Hassan<sup>asws</sup>, and he<sup>asws</sup> said: ‘O Abu Muhammad<sup>asws</sup>! Answer him’. ",
            "He (Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>) said: ‘So Al-Hassan<sup>asws</sup> answered him, and the man said, ‘I testify that there is no god except for Allah<sup>azwj</sup>, and I shall not cease testifying with it, and I testify that Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup> and I shall not cease testifying with it, and I testify that you<sup>asws</sup> are a successor<sup>asws</sup> of Rasool-Allah<sup>saww</sup> and establisher with his<sup>saww</sup> Divine Authority’, and he indicated towards Amir Al-Momineen<sup>asws</sup>, ‘And I shall not cease testifying with it, and I testify that you<sup>asws</sup> are his<sup>saww</sup> successor<sup>asws</sup>’, and he indicated towards Al-Hassan<sup>asws</sup> , ‘And I testify that Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> is a successor<sup>asws</sup> of his<sup>asws</sup> brother<sup>asws</sup> and the establisher with his<sup>asws</sup> Divine Authority after him<sup>asws</sup>.",
            "And I testify upon Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> that he<sup>asws</sup> is the establisher with the command of Al-Husayn<sup>asws</sup> after him<sup>asws</sup>, and I testify upon Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> that he<sup>asws</sup> is the establisher with the command of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and I testify upon Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> and he<sup>asws</sup> is the establisher with the command of Muhammad<sup>asws</sup>, and I testify upon Musa<sup>asws</sup> that he<sup>asws</sup> is the establisher with the command of Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>, and I testify upon Ali<sup>asws</sup> Bin Musa<sup>asws</sup> that he<sup>asws</sup> is the establisher with the command of Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>, and I testify upon Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> that he<sup>asws</sup> is the establisher with the command of Ali<sup>asws</sup> Bin Musa<sup>asws</sup>, and I testify upon Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup> that he<sup>asws</sup> is the established with the command of Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>.",
            "And I testify upon Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> that he<sup>asws</sup> is the establisher with the command of Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup>, and I testify upon a man from the sons<sup>asws</sup> of Al-Hassan<sup>asws</sup>, who shall neither be teknonymed nor named until his<sup>asws</sup> command appears, so he<sup>asws</sup> would be filling it (the earth) with justice just as it had been filled with tyranny (beforehand), and the greetings be upon you<sup>asws</sup>, O Amir Al-Momineen<sup>asws</sup>, and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings’. ",
            "Then he arose and went away. So Amir Al-Momineen<sup>asws</sup> said: ‘O Abu Muhammad<sup>asws</sup>! Follow him and look where he is headed to’. So Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> went out and he<sup>asws</sup> said: ‘It was not so except that he places his left (foot) outside from the Masjid, and it was not known where he was taken from the earth of Allah<sup>azwj</sup>’, and he<sup>asws</sup> returned to Amir Al-Momineen<sup>asws</sup> and let him<sup>asws</sup> know. So he<sup>asws</sup> said: ‘O Abu Muhammad! Do you<sup>asws</sup> recognise him?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> and Amir Al-Momineen<sup>asws</sup> are more knowing’. He<sup>asws</sup> said: ‘He was Al-Khizr<sup>as</sup>’’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated Ahmad ibn Muhammad al-Barqi from abu Hashim Dawud ibn al-Qasim al-Ja‘fari from abu Ja‘far al-Thani who has said the following. “Once Amir al-Mu’minin Ali (a.s.) came with al-Hassan and al-Husayn and he was holding the hand of Salman for support. He entered the sacred Mosque in Makka and sat down. Then a good looking and well dressed man came. He offered the greeting of peace to Amir al-Mu’minin Ali (a.s.) who answered his greetings likewise and he sat down. He then said, “I will ask you three questions. If you would answer them I will acknowledge that the people who have acted against you in the matters of leadership after the Holy Prophet (s.a) they have acted against their own selves. Their actions have taken away peace from them in this world as well in the next life. If it would be otherwise, (you can answer) then you and those people will be the same.” Amir al-Mu’minin Ali (a.s.) said, “Ask whatever you would like.” He said, “Tell about the man who sleeps. Where does his spirit go?” Tell about the man, how he remembers and forgets? Tell me about the man how do his children become similar to the aunts and uncles.?” Amir al-Mu’minin Ali (a.s.) turned to al-Hassan and said, “O abu Muhammad, answer him.” The narrator has said that al-Hassan answered his questions. The man then said, “I testify that there is no lord besides Allah and I continue to testify to this fact. I testify that Muhammad is the Messenger of Allah and I continue to testify to this fact I testify that you are the executor of the will of the Messenger of Allah and that you are the in charge of this task ((Leadership with Divine Authority) with His authorization.” He pointed out to Amir al-Mu’minin (a.s.) with his hand. He then said, “I continue to testify to this fact.” “I testify that you are the executor of his (Amir al-Mu’minin’s (a.s.) will and the in charge of this task ((Leadership with Divine Authority) by His authorization after him (Amir al-Mu’minin (a.s.) “ He pointed out with his hand to al-Hassan (a.s.). Then He then said, “I continue to testify to this fact.” “I testify that al-Husayn ibn Ali (a.s.) will be the executor of the will of his brother and the in charge of this task ((Leadership with Divine Authority) with His authorization after him. “I testify in support of Ali ibn al-Husayn (a.s.) that he will be the in charge of the task of al-Husayn after him. “I testify that Muhammad ibn Ali will be the in charge of the task of Ali ibn al-Husayn (a.s.) after him. “I testify that Ja‘far ibn Muhammad (a.s.) will be the in charge of the task of Muhammad ibn Ali (a.s.). “I testify that Musa will be the in charge of the task of Ja‘far ibn Muhammad after him. “I testify that Ali ibn Musa will be the in charge of the task of Musa ibn Ja‘far (a.s.). “I testify that Muhammad ibn Ali (a.s.) will be the in charge of the task of Ali ibn Musa (a.s.) after him. “I testify that Ali ibn Muhammad will be the in charge of the task of Muhammad ibn Ali (a.s.) after him. “I testify that al-Hassan ibn Ali (a.s.) will be the in charge of the task of Ali ibn Muhammad (a.s.) after him. “I testify in support of a man from the children of al-Hassan who will not be mentioned by his Kunya (father or son of so and so) or his name until he will rise with Divine authority to fill the earth with justice after being filled with injustice. “I offer you my greeting of peace O Amir al-Mu’minin (a.s.) and praay to Allah to grant you blessings and holiness.” He then stood up and left. Amir al-Mu’minin (a.s.) said, “O abu Muhammad follow him and see where went.” Al-Hassan ibn Ali (a.s.) went out to find out (and came back) and said, “As soon as he stepped out of the Mosque I could not figure out in which direction of the earth of Allah ddid he disappear. I returned to Amir al-Mu’minin (a.s.) and informed him.” He said, “O abu Muhammad, do you know him?” I said, Allah, the Messenger of Allah and Amir al-Mu’minin (a.s.) know best.” He said, “He was al-Khidr (a.s.) “"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (207/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1382,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:2",
        "text": [
          "وَ حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ الصَّفَّارِ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي هَاشِمٍ مِثْلَهُ سَوَاءً قَالَ مُحَمَّدُ بْنُ يَحْيَى فَقُلْتُ لِمُحَمَّدِ بْنِ الْحَسَنِ يَا أَبَا جَعْفَرٍ وَدِدْتُ أَنَّ هَذَا الْخَبَرَ جَاءَ مِنْ غَيْرِ جِهَةِ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ فَقَالَ لَقَدْ حَدَّثَنِي قَبْلَ الْحَيْرَةِ بِعَشْرِ سِنِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And Muhammad Bin Yahya narrated to me, from Muhammad Bin Al Hassan Al Saffar, from Ahgmad Bin Abu Abdullah, ",
            "(It has been narrated) from Abu Hashim - similar to it, except that Muhammad Bin Yahya said, ‘So I said to Muhammad Bin Al-Hassan, ‘O Abu Ja’far! This news (Hadeeth) has come from a direction other than Ahmad Bin Abu Abdullah’. So he said, ‘He had narrated to me before the confusion by ten years’."
          ],
          "en.sarwar": [
            " 2. Also Muhammad ibn Yahya has narrated from Muhammad ibn al-Hassan al-Saffar from Ahmad ibn abu ‘Abdallah from abu Hashim a similar hadith. Muhammad ibn Yahya has said, “I said to Muhammad ibn al-Hassan, “O abu Ja‘far I wish this would have been narrated through a chain of narrators other then Ahmad ibn ‘Abdallah .” He said, “He Ahmad ibn ‘Abdallah had narrated this to me ten years before the confusion.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (208/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1383,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى وَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنِ الْحَسَنِ بْنِ ظَرِيفٍ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَالِمٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَبِي لِجَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ إِنَّ لِي إِلَيْكَ حَاجَةً فَمَتَى يَخِفُّ عَلَيْكَ أَنْ أَخْلُوَ بِكَ فَأَسْأَلَكَ عَنْهَا فَقَالَ لَهُ جَابِرٌ أَيَّ الْأَوْقَاتِ أَحْبَبْتَهُ فَخَلَا بِهِ فِي بَعْضِ الْأَيَّامِ فَقَالَ لَهُ يَا جَابِرُ أَخْبِرْنِي عَنِ اللَّوْحِ الَّذِي رَأَيْتَهُ فِي يَدِ أُمِّي فَاطِمَةَ ( عليها السلام ) بِنْتِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مَا أَخْبَرَتْكَ بِهِ أُمِّي أَنَّهُ فِي ذَلِكَ اللَّوْحِ مَكْتُوبٌ",
          "فَقَالَ جَابِرٌ أَشْهَدُ بِاللَّهِ أَنِّي دَخَلْتُ عَلَى أُمِّكَ فَاطِمَةَ ( عليها السلام ) فِي حَيَاةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَهَنَّيْتُهَا بِوِلَادَةِ الْحُسَيْنِ وَ رَأَيْتُ فِي يَدَيْهَا لَوْحاً أَخْضَرَ ظَنَنْتُ أَنَّهُ مِنْ زُمُرُّدٍ وَ رَأَيْتُ فِيهِ كِتَاباً أَبْيَضَ شِبْهَ لَوْنِ الشَّمْسِ فَقُلْتُ لَهَا بِأَبِي وَ أُمِّي يَا بِنْتَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مَا هَذَا اللَّوْحُ فَقَالَتْ هَذَا لَوْحٌ أَهْدَاهُ اللَّهُ إِلَى رَسُولِهِ ( صلى الله عليه وآله ) فِيهِ اسْمُ أَبِي وَ اسْمُ بَعْلِي وَ اسْمُ ابْنَيَّ وَ اسْمُ الْأَوْصِيَاءِ مِنْ وُلْدِي وَ أَعْطَانِيهِ أَبِي لِيُبَشِّرَنِي بِذَلِكَ",
          "قَالَ جَابِرٌ فَأَعْطَتْنِيهِ أُمُّكَ فَاطِمَةُ ( عليها السلام ) فَقَرَأْتُهُ وَ اسْتَنْسَخْتُهُ فَقَالَ لَهُ أَبِي فَهَلْ لَكَ يَا جَابِرُ أَنْ تَعْرِضَهُ عَلَيَّ قَالَ نَعَمْ فَمَشَى مَعَهُ أَبِي إِلَى مَنْزِلِ جَابِرٍ فَأَخْرَجَ صَحِيفَةً مِنْ رَقٍّ فَقَالَ يَا جَابِرُ انْظُرْ فِي كِتَابِكَ لِأَقْرَأَ أَنَا عَلَيْكَ فَنَظَرَ جَابِرٌ فِي نُسْخَةٍ فَقَرَأَهُ أَبِي فَمَا خَالَفَ حَرْفٌ حَرْفاً",
          "فَقَالَ جَابِرٌ فَأَشْهَدُ بِاللَّهِ أَنِّي هَكَذَا رَأَيْتُهُ فِي اللَّوْحِ مَكْتُوباً بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ هَذَا كِتَابٌ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ لِمُحَمَّدٍ نَبِيِّهِ وَ نُورِهِ وَ سَفِيرِهِ وَ حِجَابِهِ وَ دَلِيلِهِ نَزَلَ بِهِ الرُّوحُ الْأَمِينُ مِنْ عِنْدِ رَبِّ الْعَالَمِينَ",
          "عَظِّمْ يَا مُحَمَّدُ أَسْمَائِي وَ اشْكُرْ نَعْمَائِي وَ لَا تَجْحَدْ آلَائِي إِنِّي أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا قَاصِمُ الْجَبَّارِينَ وَ مُدِيلُ الْمَظْلُومِينَ وَ دَيَّانُ الدِّينِ",
          "إِنِّي أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا فَمَنْ رَجَا غَيْرَ فَضْلِي أَوْ خَافَ غَيْرَ عَدْلِي عَذَّبْتُهُ عَذَاباً لَا أُعَذِّبُهُ أَحَداً مِنَ الْعَالَمِينَ فَإِيَّايَ فَاعْبُدْ وَ عَلَيَّ فَتَوَكَّلْ إِنِّي لَمْ أَبْعَثْ نَبِيّاً فَأُكْمِلَتْ أَيَّامُهُ وَ انْقَضَتْ مُدَّتُهُ إِلَّا جَعَلْتُ لَهُ وَصِيّاً وَ إِنِّي فَضَّلْتُكَ عَلَى الْأَنْبِيَاءِ وَ فَضَّلْتُ وَصِيَّكَ عَلَى الْأَوْصِيَاءِ وَ أَكْرَمْتُكَ بِشِبْلَيْكَ وَ سِبْطَيْكَ حَسَنٍ وَ حُسَيْنٍ",
          "فَجَعَلْتُ حَسَناً مَعْدِنَ عِلْمِي بَعْدَ انْقِضَاءِ مُدَّةِ أَبِيهِ وَ جَعَلْتُ حُسَيْناً خَازِنَ وَحْيِي وَ أَكْرَمْتُهُ بِالشَّهَادَةِ وَ خَتَمْتُ لَهُ بِالسَّعَادَةِ فَهُوَ أَفْضَلُ مَنِ اسْتُشْهِدَ وَ أَرْفَعُ الشُّهَدَاءِ دَرَجَةً جَعَلْتُ كَلِمَتِيَ التَّامَّةَ مَعَهُ وَ حُجَّتِيَ الْبَالِغَةَ عِنْدَهُ",
          "بِعِتْرَتِهِ أُثِيبُ وَ أُعَاقِبُ أَوَّلُهُمْ عَلِيٌّ سَيِّدُ الْعَابِدِينَ وَ زَيْنُ أَوْلِيَائِيَ الْمَاضِينَ وَ ابْنُهُ شِبْهُ جَدِّهِ الْمَحْمُودِ مُحَمَّدٌ الْبَاقِرُ عِلْمِي وَ الْمَعْدِنُ لِحِكْمَتِي",
          "سَيَهْلِكُ الْمُرْتَابُونَ فِي جَعْفَرٍ الرَّادُّ عَلَيْهِ كَالرَّادِّ عَلَيَّ حَقَّ الْقَوْلُ مِنِّي لَأُكْرِمَنَّ مَثْوَى جَعْفَرٍ وَ لَأَسُرَّنَّهُ فِي أَشْيَاعِهِ وَ أَنْصَارِهِ وَ أَوْلِيَائِهِ أُتِيحَتْ بَعْدَهُ مُوسَى فِتْنَةٌ عَمْيَاءُ حِنْدِسٌ لِأَنَّ خَيْطَ فَرْضِي لَا يَنْقَطِعُ وَ حُجَّتِي لَا تَخْفَى",
          "وَ أَنَّ أَوْلِيَائِي يُسْقَوْنَ بِالْكَأْسِ الْأَوْفَى مَنْ جَحَدَ وَاحِداً مِنْهُمْ فَقَدْ جَحَدَ نِعْمَتِي وَ مَنْ غَيَّرَ آيَةً مِنْ كِتَابِي فَقَدِ افْتَرَى عَلَيَّ وَيْلٌ لِلْمُفْتَرِينَ الْجَاحِدِينَ عِنْدَ انْقِضَاءِ مُدَّةِ مُوسَى عَبْدِي وَ حَبِيبِي وَ خِيَرَتِي فِي عَلِيٍّ وَلِيِّي وَ نَاصِرِي وَ مَنْ أَضَعُ عَلَيْهِ أَعْبَاءَ النُّبُوَّةِ وَ أَمْتَحِنُهُ بِالِاضْطِلَاعِ بِهَا يَقْتُلُهُ عِفْرِيتٌ مُسْتَكْبِرٌ يُدْفَنُ فِي الْمَدِينَةِ الَّتِي بَنَاهَا الْعَبْدُ الصَّالِحُ إِلَى جَنْبِ شَرِّ خَلْقِي",
          "حَقَّ الْقَوْلُ مِنِّي لَأَسُرَّنَّهُ بِمُحَمَّدٍ ابْنِهِ وَ خَلِيفَتِهِ مِنْ بَعْدِهِ وَ وَارِثِ عِلْمِهِ فَهُوَ مَعْدِنُ عِلْمِي وَ مَوْضِعُ سِرِّي وَ حُجَّتِي عَلَى خَلْقِي لَا يُؤْمِنُ عَبْدٌ بِهِ إِلَّا جَعَلْتُ الْجَنَّةَ مَثْوَاهُ وَ شَفَّعْتُهُ فِي سَبْعِينَ مِنْ أَهْلِ بَيْتِهِ كُلُّهُمْ قَدِ اسْتَوْجَبُوا النَّارَ",
          "وَ أَخْتِمُ بِالسَّعَادَةِ لِابْنِهِ عَلِيٍّ وَلِيِّي وَ نَاصِرِي وَ الشَّاهِدِ فِي خَلْقِي وَ أَمِينِي عَلَى وَحْيِي أُخْرِجُ مِنْهُ الدَّاعِيَ إِلَى سَبِيلِي وَ الْخَازِنَ لِعِلْمِيَ الْحَسَنَ وَ أُكْمِلُ ذَلِكَ بِابْنِهِ م‏ح‏م‏د رَحْمَةً لِلْعَالَمِينَ عَلَيْهِ كَمَالُ مُوسَى وَ بَهَاءُ عِيسَى وَ صَبْرُ أَيُّوبَ",
          "فَيُذَلُّ أَوْلِيَائِي فِي زَمَانِهِ وَ تُتَهَادَى رُءُوسُهُمْ كَمَا تُتَهَادَى رُءُوسُ التُّرْكِ وَ الدَّيْلَمِ فَيُقْتَلُونَ وَ يُحْرَقُونَ وَ يَكُونُونَ خَائِفِينَ مَرْعُوبِينَ وَجِلِينَ تُصْبَغُ الْأَرْضُ بِدِمَائِهِمْ وَ يَفْشُو الْوَيْلُ وَ الرَّنَّةُ فِي نِسَائِهِمْ أُولَئِكَ أَوْلِيَائِي حَقّاً بِهِمْ أَدْفَعُ كُلَّ فِتْنَةٍ عَمْيَاءَ حِنْدِسٍ وَ بِهِمْ أَكْشِفُ الزَّلَازِلَ وَ أَدْفَعُ الْآصَارَ وَ الْأَغْلَالَ أُولَئِكَ عَلَيْهِمْ صَلَوَاتٌ مِنْ رَبِّهِمْ وَ رَحْمَةٌ وَ أُولَئِكَ هُمُ الْمُهْتَدُونَ ",
          "قَالَ عَبْدُ الرَّحْمَنِ بْنُ سَالِمٍ قَالَ أَبُو بَصِيرٍ لَوْ لَمْ تَسْمَعْ فِي دَهْرِكَ إِلَّا هَذَا الْحَدِيثَ لَكَفَاكَ فَصُنْهُ إِلَّا عَنْ أَهْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and Muhammad Bin Abdullah, from Abdullah Bin Ja’far, from Al Hassan Bin Zareyf and Ali Bin Muhammad, from Salih Bin Abu Hammad, from Bakr Bin Salih, from Abdul Rahman Bin Salim, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘My<sup>asws</sup> father<sup>asws</sup> said to Jabir Bin Abdullah Al-Ansary: ‘For me<sup>asws</sup> there is a need to you, therefore whenever there is ease upon you, I shall be alone with you and ask you about it’. Jabir said to him<sup>asws</sup>, ‘Whichever timings are suitable to you<sup>asws</sup>’. So he<sup>asws</sup> isolated with him during one of the days, and he<sup>asws</sup> said to Jabir: ‘Inform me<sup>asws</sup> about the Tablet which you saw in the hand of my<sup>asws</sup> mother<sup>asws</sup> (Syeda) Fatima<sup>asws</sup> Bint Rasool-Allah<sup>saww</sup> and what my<sup>asws</sup> mother<sup>asws</sup> informed you with what was written in that Tablet’. ",
            "Jabir said, ‘I testify with Allah<sup>azwj</sup> that I went over to your<sup>asws</sup> mother<sup>asws</sup> (Syeda) Fatima<sup>asws</sup> during the lifetime of Rasool-Allah<sup>saww</sup> and congratulated her<sup>asws</sup> of the arrival of Al-Husayn<sup>asws</sup>, and I saw a green Tablet in her<sup>asws</sup> hand which I thought was made of emerald, and I saw a white writing therein resembling the colour of the sun. So I said to her<sup>asws</sup>, ‘By my father and my mother, O daughter of Rasool-Allah<sup>saww</sup>! What is this Tablet?’ She<sup>asws</sup> said: ‘This is a Tablet which Allah<sup>azwj</sup> Gifted to His<sup>azwj</sup> Rasool<sup>saww</sup>. There is the name of my<sup>asws</sup> father<sup>saww</sup>, and name of my<sup>asws</sup> husband<sup>asws</sup>, and name of my<sup>asws</sup> two sons<sup>asws</sup>, and names of the successors<sup>asws</sup> from my<sup>asws</sup> children, and my father<sup>saww</sup> gave it to me<sup>asws</sup> in order to give me<sup>asws</sup> the glad tidings with that’. ",
            "Jabir said, ‘Your<sup>asws</sup> mother<sup>asws</sup> gave it to me, so I read it and copied it’. So my<sup>asws</sup> father<sup>asws</sup> said to him: ‘So is it for you, O Jabir, that you display it to me<sup>asws</sup>?’ He said, ‘Yes’. So my<sup>asws</sup> father<sup>asws</sup> went with him to the house of Jabir, and he brought out a parchment of paper. So he<sup>asws</sup> said: ‘O Jabir! Look into your handwriting and I<sup>asws</sup> shall read upon you’. Jabir look into the copy and my<sup>asws</sup> father<sup>asws</sup> read, and no letter differed from a letter. ",
            "Jabir said, ‘I testify with Allah<sup>azwj</sup> that I saw it written like this in the Tablet: -“In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful! This is a Letter from Allah<sup>azwj</sup> the Mighty, the Wise, to Muhammad<sup>saww</sup> His<sup>azwj</sup> Prophet<sup>saww</sup>, and His<sup>azwj</sup> Light, and His<sup>azwj</sup> Ambassador, and His<sup>azwj</sup> Veil, and His<sup>azwj</sup> Proof. The Trustworthy Spirit descended with it from the Lord<sup>azwj</sup> of the worlds. ",
            "O Muhammad<sup>saww</sup>! Magnify My<sup>azwj</sup> Names and thank for My<sup>azwj</sup> Bounties and do not deny My<sup>azwj</sup> Signs. Me<sup>azwj</sup>, I<sup>azwj</sup> am Allah<sup>azwj</sup>! There is no god except for I<sup>azwj</sup> and the Crusher of the tyrants and the Helper of the oppressed and Maker of the Religion. ",
            "Me<sup>azwj</sup>, I<sup>azwj</sup> am Allah<sup>azwj</sup>! There is no god except for I<sup>azwj</sup>, so the one who wishes for other than My<sup>azwj</sup> Grace or fears other than My<sup>azwj</sup> Justice, I<sup>azwj</sup> shall Punish him with a Punishment I<sup>azwj</sup> have not Punished anyone from the worlds. So I<sup>asws</sup> am the One<sup>azwj</sup> you<sup>saww</sup> should worship and upon Me<sup>azwj</sup> should you<sup>saww</sup> rely. I<sup>azwj</sup> did not Send a Prophet<sup>saww</sup> and Completed his<sup>as</sup> days and Expired his<sup>as</sup> term except that I<sup>azwj</sup> Made a successor<sup>as</sup> to be for him<sup>as</sup>, and I<sup>azwj</sup> Preferred you<sup>saww</sup> upon the (rest of the) Prophets<sup>as</sup>, and Preferred your<sup>saww</sup> successor<sup>asws</sup> over the (rest of the) succesors<sup>as</sup>, and Honoured you<sup>saww</sup> with your<sup>saww</sup> two young ones<sup>asws</sup> and two grandsons Hassan<sup>asws</sup> and Husayn<sup>asws</sup>.",
            "So I<sup>azwj</sup> Made Hassan<sup>asws</sup> as a mine of My<sup>azwj</sup> Knowledge after the expiry of the term of his<sup>asws</sup> father<sup>asws</sup>, and I<sup>azwj</sup> Made Husayn<sup>asws</sup> as a treasurer of My<sup>azwj</sup> Revelation and Honoured him<sup>asws</sup> with the martyrdom and Ended for him<sup>asws</sup> with the happiness. Thus, he<sup>asws</sup> is the most superior of the ones martyred and the loftiest of the levels of the martyrs. I<sup>azwj</sup> Made the complete Speech of Mine<sup>azwj</sup> to be with him<sup>asws</sup> and My<sup>azwj</sup> clear Proof to be with him<sup>asws</sup>. ",
            "By his<sup>asws</sup> family I<sup>azwj</sup> Shall Reward and Punish. The first of them<sup>asws</sup> is Ali<sup>asws</sup> Chief of the worshippers and adornment of My<sup>azwj</sup> friends, the past ones; and his<sup>asws</sup> son would resemble his<sup>asws</sup> grandfather<sup>saww</sup>, the praised one, Muhammad<sup>saww</sup>, the expounder (Al-Baqir) of My<sup>azwj</sup> Knowledge and the Mine of My<sup>azwj</sup> Wisdom. ",
            "The doubters in Ja’far<sup>asws</sup> would be destroyed. The rejection upon him<sup>asws</sup> is like the rejection upon Me<sup>azwj</sup>, being a rightful Word from Me<sup>azwj</sup>. I<sup>azwj</sup> shall Honour the dwelling of Ja’far<sup>asws</sup> and I<sup>azwj</sup> shall Cheer him<sup>asws</sup> with regards to his<sup>asws</sup> Shias and his<sup>asws</sup> helpers and his<sup>asws</sup> friends. After him<sup>asws</sup> Musa<sup>asws</sup> shall live during a blinding strife of darkness because the thread of My<sup>azwj</sup> Obligation does not get cut-off and My<sup>azwj</sup> Divine Authority does not get concealed.",
            "And My<sup>azwj</sup> friends would be quenching with the full cups. The one who rejects one of them<sup>asws</sup>, so he has rejected My<sup>azwj</sup> Bounty, and the one who changes a Verse from My<sup>azwj</sup> Book, so he has forged (a lie) upon Me<sup>azwj</sup>. Woe be unto the forgers, the rejecters, at the expiry of the term of Musa<sup>asws</sup>, My<sup>azwj</sup> servant and My<sup>azwj</sup> Beloved and My<sup>azwj</sup> Choice is Ali<sup>azwj</sup>, My<sup>azwj</sup> Guardian<sup>asws</sup> and My<sup>azwj</sup> helper, and the one upon whom I<sup>azwj</sup> shall Place the task of the Prophet-hood and Test him<sup>asws</sup> with the performance with it. And arrogant demon would murder him<sup>asws</sup>. He<sup>asws</sup> would be buried in a city being built by the righteous servant of (Mine<sup>azwj</sup>), to the side of the most evil of My<sup>azwj</sup> creatures (Harun Rashid). ",
            "A Truthful Word from Me<sup>azwj</sup>. I<sup>azwj</sup> shall cheer him<sup>asws</sup> with Muhammad<sup>asws</sup>, his<sup>asws</sup> son<sup>asws</sup> and his<sup>asws</sup> Caliph from after him<sup>asws</sup>, and an inheritor of his<sup>asws</sup> knowledge. So he<sup>asws</sup> would be the Mine of My<sup>azwj</sup> Knowledge and the Place of My<sup>azwj</sup> Secrets and My<sup>azwj</sup> Divine Authority upon My<sup>azwj</sup> creatures. No servant would believe in him<sup>asws</sup> except that I<sup>azwj</sup> shall Make the Paradise as being his Reward and he would intercede among seventy from his family members, all of them being such that the Fire would have been Obligated upon them. ",
            "And I<sup>azwj</sup> shall Seal with the happiness for his<sup>asws</sup> son Ali<sup>asws</sup>, My<sup>azwj</sup> Guardian and My<sup>azwj</sup> helper and the witness among My<sup>azwj</sup> creatures and My<sup>azwj</sup> Trustee upon My<sup>azwj</sup> Revelation. I<sup>azwj</sup> shall Bring out from him<sup>asws</sup>, the caller to My<sup>azwj</sup> Way and the treasurer of My<sup>azwj</sup> Knowledge, Al-Hassan<sup>asws</sup>, and Complete that with his<sup>asws</sup> son<sup>asws</sup> ‘M H M D’, being a mercy to the worlds. Upon him<sup>asws</sup> would be the perfection of Musa<sup>as</sup>, and the gloriousness of Isa<sup>as</sup> and patience of Ayoub<sup>as</sup>. ",
            "During his<sup>asws</sup> time My<sup>azwj</sup> friends would be humiliated and their heads would be gifted just as the gifting of the heads of the Turks and the Daylam. So they would be killed and burned and they would happen to be fearful, terrified, exiled. The land - would be dyed with their blood and the wailing and lamentations would be widespread among their womenfolk. Those are My<sup>azwj</sup> friends, truly. By them I<sup>azwj</sup> shall Repel every dark blinding strife, and by them I<sup>azwj</sup> shall Remove the earthquakes and Push away the sufferings and the shackles. Those are the ones<sup>asws</sup> upon whom are the <span class=\"iTxt\">Salawat</span> from their Lord<sup>azwj</sup> and Mercy, and they are the ones who are Guided!”. ",
            "Abdul Rahman Bin Salim said, ‘Abu Baseer said, ‘If you did not hear during your time except for this Hadeeth, it would suffice you. Therefore, protect it except from its deserving ones’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya and Muhammad ibn ‘Abdallah have narrated from ‘Abdallah ibn Ja‘far from al-Hassan ibn Zarif and Ali ibn Muhammad from Salih ibn abu Hammad from Bakr ibn Salih from ‘Abd al-Rahman ibn Salim from abu Basir from abu ‘Abdallah (a.s.) who has said the following “Once my father said to Jabir ibn ‘Abdallah al-Ansari, ‘I need your help in certain issue. When do you think it will be convenient for you we meet privately and I will ask you about it.?” He said, “Whenever you would like will be all right for me.” One day when they met each other he said, “O Jabir, tell me about the tablet that you saw in the hand of my great-grandmother, Fatima (a.s.), daughter of the Messenger of Allah. Tell me of what she said toyou about the tablet and the writing on it?” Jabir then said, “I ask Allah to testify (to the truth of what I experienced that day). Once I went to see your great grandmother Fatime (a.s.) in the life time of the Messenger of Allah. I congratulated for the birth of al-Husayn (a.s.). I saw in her hand a green tablet that I think was made of Emerald (precious gems). I saw on it a white writing that was shining like the color of sun. I then said to her, “May Allah take my soul and the souls of my parents in service for your cause, O daughter of the Messenger of Allah, what is this tablet?” She said, “This is a tablet that Allah has given as a gift to His Messenger. In it there is the name of my father, the name of my husband, the names of my two sons and the names of the executors of the wills of my (special) descendants. My father gave it to me as a gift and glad news.” Jabir then said, “Your great grandmother (a.s.) then gave the tablet to me. I read it and made a copy of it.” My father then said, “O Jabir can you show that copy (that made from the tablet) to me?” He said, “Yes, I can show it to you.” My father went with him to his house and he brought to light a tablet of parchment. He then said, “O Jabir, look carefully at your writing to see how read it for you.” Jabir then kept looking at his handwriting while my father read and his reading was exactly letter by letter the same as what Jabir had in his copy. Jabir theen said, “I ask Allah to testify to the truth of my words that this is what I saw was written on the tablet.” In the name of Allah, the Beneficent, the merciful This a document from Allah, the Most Majestic, the Most Wise, for Muhammad, His Prophet (s.a), His light, His embassador, His barrier and His guide (for people). Jibril, the trusted spirit has brought from the Lord of the worlds. “O Muhammad acknowledge the greatness of My names and pay thanks for My bounties. Do not hide My favors. I am the Allah and there is no lord besides Me. I break down the transgressors and grant wealth to the oppressed. I am the One Who has established the religion. I am Allah. There is no lord besides I. Whoever would expect to receive any distinction from someone other than Me or have fear of the justice of someone other Me I will cause him to suffer a torment the like of which I would cause no one else of the creatures of the world to suffer. I must be worshipped and in Me you must trust. I have not sent any prophet without, up on the completion of his days, appointing the executor of his will. I have given preference to you over the prophets and I have given preference to the executor of your will over the executors of the wills of the other prophets. I have granted you honor through your two brave grandsons, al-Hassan and al-Husayn. I have made al-Hassan to be the treasure of my knowledge after the completion of the time of his father. I have made al-Husayn to be the keeper of My revelation. I have granted him nobility through martyrdom and made his end triumphant. He will be the best of the martyrs and of the highest degree in the rank of the martyrs. I have kept My perfect word with him and My extremely clear authority and proof available for him. Through his descendant I will give good rewards or cause people to suffer torments. The first of them will Ali ibn al-Husayn, master of the worshippers, and the beauty of My friends of the past then his son who will be very similar to his grand father, the praised one, Muhammad al-Baqir, the one who will be very deeply founded in My knowledge and the source of wisdom from Me. Those who will have doubts about Ja‘far will soon be destroyed. Whoever would reject him would be like one who would reject Me. The true words have already come from Me that I will dignify the position of Ja‘far and will grant him joy and happiness for his followers, supporters and friends. After him Musa will live at the time of a blind, confusing and dark mischief. (He will live among the people) because the system of obedience to Me does not break down and my authority (proof of My existence) does not remain obscure. The thirst (for knowledge and guidance) of my friends will be quenched with sufficient measure. Whoever would reject any of them he has rejected my favors. Whoever would change my signs and verses of my book he has excused with lies. Woe is to those who would fabricate lies and reject (the truth) after the completion of the time of Musa, My servant, My beloved, My chosen one about Ali (al-Rida ). (Ali al-Rida) who is My wali (the one who possesses Divine Authority) My supporter, the one on whom I will place the task of prophet-hood and examine how he would deal with it. An arrogant devil will murder him. He will be buried in the city build by the virtuous servant (of Allah) next to the worst of My creature. The words of truth have already been established that I will grant him joy and happiness with the birth of his son, Muhammad, his successor and the heir of his knowledge. He is the the mine of My knowledge, the right place for My secrets and My authority over My creature. Whoever would believe in him I will make paradise his dwelling and will grant him the ability to intercede for seventy people from his family of whom everyone would have become subject to Hellfire. I will make the end for his son, Ali, to arrive at salvation. Ali, is My wali (the one who possesses Divine Authority), My supporter, the testimony in My creatures and My trustee in My revelation. From him I will make to come out a preacher to My way and a treasure of My Knowledge, al-Hassan. I will complete it with his son (M.H.M.D.) a blessing for the worlds. In him will be found the perfection of Musa (Moses) the beauty of Jesus and the patience of Ayyub. My friends in his time will become weak. Their heads will be sent as gifts like the heads of the Turks and Daylam. They will be murdered and burned. They will live in fear, frightened and fearful. The earth will be stained with their blood and wailing and lamentations will become wide spread in their women. These will possess My authority and through them I will remove the blind and dark mischief. Through them I will remove uncertainties, sufferings and shackles. These are the ones upon whom the blessings and forgiveness of their Lord descend and they are the ones who provide guidance. ‘Abd al-Rahman ibn Salim has said that abu Basir said, “Even if you would hear no other Hadith expect this it will be enough for you. Protect it against everyone except the deserving people.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف في ه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/216)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1384,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ أَبَانِ بْنِ أَبِي عَيَّاشٍ عَنْ سُلَيْمِ بْنِ قَيْسٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ هِلَالٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ أَبَانِ بْنِ أَبِي عَيَّاشٍ عَنْ سُلَيْمِ بْنِ قَيْسٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ جَعْفَرٍ الطَّيَّارِ يَقُولُ كُنَّا عِنْدَ مُعَاوِيَةَ أَنَا وَ الْحَسَنُ وَ الْحُسَيْنُ وَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ وَ عُمَرُ ابْنُ أُمِّ سَلَمَةَ وَ أُسَامَةُ بْنُ زَيْدٍ فَجَرَى بَيْنِي وَ بَيْنَ مُعَاوِيَةَ كَلَامٌ ",
          "فَقُلْتُ لِمُعَاوِيَةَ سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ ثُمَّ أَخِي عَلِيُّ بْنُ أَبِي طَالِبٍ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ فَإِذَا اسْتُشْهِدَ عَلِيٌّ فَالْحَسَنُ بْنُ عَلِيٍّ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ ثُمَّ ابْنِيَ الْحُسَيْنُ مِنْ بَعْدِهِ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ فَإِذَا اسْتُشْهِدَ فَابْنُهُ عَلِيُّ بْنُ الْحُسَيْنِ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ وَ سَتُدْرِكُهُ يَا عَلِيُّ ثُمَّ ابْنُهُ مُحَمَّدُ بْنُ عَلِيٍّ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ وَ سَتُدْرِكُهُ يَا حُسَيْنُ ثُمَّ يُكَمِّلُهُ اثْنَيْ عَشَرَ إِمَاماً تِسْعَةً مِنْ وُلْدِ الْحُسَيْنِ ",
          "قَالَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ وَ اسْتَشْهَدْتُ الْحَسَنَ وَ الْحُسَيْنَ وَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ وَ عُمَرَ ابْنَ أُمِّ سَلَمَةَ وَ أُسَامَةَ بْنَ زَيْدٍ فَشَهِدُوا لِي عِنْدَ مُعَاوِيَةَ ",
          "قَالَ سُلَيْمٌ وَ قَدْ سَمِعْتُ ذَلِكَ مِنْ سَلْمَانَ وَ أَبِي ذَرٍّ وَ الْمِقْدَادِ وَ ذَكَرُوا أَنَّهُمْ سَمِعُوا ذَلِكَ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar Al Yamani, from Aban Bin Abu Ayyash, from Suleymn Bin Qays and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Umar Bin Azina and Ali Bin Muhammad, from Ahmad Bin Hilal, from Ibn Abu Umeyr, from Umar Bin Azina, from Aban Bin Abu Ayyash, from Suleym Bin Qays who said, ",
            "‘I heard Abdullah Bin Ja’far Al-Tayyar saying, ‘We were in the presence of Muawiya, I, and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>, and Abdullah Bin Abbas, and Umar son of Umm Salma<sup>as</sup>, and Asama Bin Zayd, and there flowed (heated) speech between me and Muawiya.",
            "I said to Muawiya, ‘I heard Rasool-Allah<sup>saww</sup> saying: ‘I<sup>saww</sup> am closer with the Momineen than their own selves, then my<sup>saww</sup> brother<sup>asws</sup> Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> is closer with the Momineen than their own selves. So when Ali<sup>asws</sup> is martyred, then Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> would be closer with the Momineen than their own selves, then my<sup>saww</sup> son<sup>asws</sup> Al Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> from after him<sup>asws</sup> would be closer to the Momineen than their own selves. So when he<sup>asws</sup> is martyred, so it would be his<sup>asws</sup> son<sup>asws</sup> Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> who would be closer with the Momineen than their own selves, and you<sup>asws</sup> will be seeing him<sup>asws</sup>, O Ali<sup>asws</sup>! Then it would be his<sup>asws</sup> son<sup>asws</sup> Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> who would be closer with the Momineen than their own selves, and you<sup>asws</sup> will be seeing him<sup>asws</sup>, O Husayn<sup>asws</sup>! Then ten Imams<sup>asws</sup> would be completed, nine being from the sons<sup>asws</sup> of Al-Husayn<sup>asws</sup>’’. ",
            "Abdullah Bin Ja’far said, ‘And I made witnesses of Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and Abdullah Bin Abbas, and Umar son of Umm Salma<sup>as</sup>, and Asama Bin Zayd, so they bore witness for me in the presence of Muawiya’. ",
            "Suleym said, ‘And I had heard that from Salman<sup>as</sup>, and Abu Zarr<sup>as</sup>, and Al-Miqdad<sup>as</sup>, and they<sup>as</sup> mentioned that they<sup>as</sup> had heard that from Rasool-Allah<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Ibrahim ibn ‘Umar al-Yamani from Aban ibn abu ‘Ayyash from Sulaym ibn Qays and Muhammad ibn Yahya from Ahmad ibn Muhammad from ibn abu ‘Umayr from ‘Umar ibn ’Udhayna and Ali ibn Muhammad from Ahmad ibn Hilal from ibn abu ‘Umayr from ‘Umar ibn ’Udhayna from Aban ibn abu ‘Ayyash from Sulaym ibn Qays who has said the following. “ I heard ‘Abdallah ibn Ja‘far al-Tayyar say, ‘we were in the court of Mu‘awiya I al-Hassan, al-Husayn, ‘Abdallah ibn ‘Abbass, ‘Umar ibn ’Umm Salama and ’Usama ibn Zayd. A conversation started between me and Mu‘awiya, and I said to Mu‘awiya’, ’I heard the Messenger of Allah say, ‘I have more authority over the believers’ souls than they themselves do. Then my brother Ali ibn abu Talib (a.s.) will have more authority over the believers’ souls than they themselves will have. When Ali (a.s.), will become a martyr al-Hassan ibn Ali will have more authority over the believers’ souls than they themselves will have. Thereafter my son al-Husayn after him (al-Hassan) will have more authority over the believers’ souls than they themselves will have. When he will become a martyr, his son Ali ibn al-Husayn after him (al-Husayn) will have more authority over the believers’ souls than they themselves will have. O Ali, you will see him. Thereafter his son Muhammad ibn Ali will have more authority over the believers’ souls than they themselves will have. O al-Husayn, you will see him. Then the twelve will complete the number of Imams. Nine will be of the descendants of al-Husayn.” ‘Abdallah ibn Ja‘far said, “I asked al-Hassan, al-Husayn, ‘Abdallah, ibn ‘Abbass, Umar ibn ’Umm Salama and ’Usama ibn Zayd to bear witness. They all bore witness for me before Mu‘awiya.” Sulaym ibn Qays has said, “I heard such Hadith from Salman, abu Dharr and al- Miqdad who said that they heard such Hadith from the Messenger of Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/217)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1385,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ حَنَانِ بْنِ السَّرَّاجِ عَنْ دَاوُدَ بْنِ سُلَيْمَانَ الْكِسَائِيِّ عَنْ أَبِي الطُّفَيْلِ قَالَ شَهِدْتُ جِنَازَةَ أَبِي بَكْرٍ يَوْمَ مَاتَ وَ شَهِدْتُ عُمَرَ حِينَ بُويِعَ وَ عَلِيٌّ ( عليه السلام ) جَالِسٌ نَاحِيَةً فَأَقْبَلَ غُلَامٌ يَهُودِيٌّ جَمِيلُ الْوَجْهِ بَهِيٌّ عَلَيْهِ ثِيَابُ حِسَانٌ وَ هُوَ مِنْ وُلْدِ هَارُونَ حَتَّى قَامَ عَلَى رَأْسِ عُمَرَ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَنْتَ أَعْلَمُ هَذِهِ الْأُمَّةِ بِكِتَابِهِمْ وَ أَمْرِ نَبِيِّهِمْ",
          "قَالَ فَطَأْطَأَ عُمَرُ رَأْسَهُ فَقَالَ إِيَّاكَ أَعْنِي وَ أَعَادَ عَلَيْهِ الْقَوْلَ فَقَالَ لَهُ عُمَرُ لِمَ ذَاكَ قَالَ إِنِّي جِئْتُكَ مُرْتَاداً لِنَفْسِي شَاكّاً فِي دِينِي فَقَالَ دُونَكَ هَذَا الشَّابَّ قَالَ وَ مَنْ هَذَا الشَّابُّ قَالَ هَذَا عَلِيُّ بْنُ أَبِي طَالِبٍ ابْنُ عَمِّ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ هَذَا أَبُو الْحَسَنِ وَ الْحُسَيْنِ ابْنَيْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ هَذَا زَوْجُ فَاطِمَةَ بِنْتِ رَسُولِ اللَّهِ ( صلى الله عليه وآله )",
          "فَأَقْبَلَ الْيَهُودِيُّ عَلَى عَلِيٍّ ( عليه السلام ) فَقَالَ أَ كَذَاكَ أَنْتَ قَالَ نَعَمْ قَالَ إِنِّي أُرِيدُ أَنْ أَسْأَلَكَ عَنْ ثَلَاثٍ وَ ثَلَاثٍ وَ وَاحِدَةٍ قَالَ فَتَبَسَّمَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مِنْ غَيْرِ تَبَسُّمٍ وَ قَالَ يَا هَارُونِيُّ مَا مَنَعَكَ أَنْ تَقُولَ سَبْعاً قَالَ أَسْأَلُكَ عَنْ ثَلَاثٍ فَإِنْ أَجَبْتَنِي سَأَلْتُ عَمَّا بَعْدَهُنَّ وَ إِنْ لَمْ تَعْلَمْهُنَّ عَلِمْتُ أَنَّهُ لَيْسَ فِيكُمْ عَالِمٌ",
          "قَالَ عَلِيٌّ ( عليه السلام ) فَإِنِّي أَسْأَلُكَ بِالْإِلَهِ الَّذِي تَعْبُدُهُ لَئِنْ أَنَا أَجَبْتُكَ فِي كُلِّ مَا تُرِيدُ لَتَدَعَنَّ دِينَكَ وَ لَتَدْخُلَنَّ فِي دِينِي قَالَ مَا جِئْتُ إِلَّا لِذَاكَ قَالَ فَسَلْ قَالَ أَخْبِرْنِي عَنْ أَوَّلِ قَطْرَةِ دَمٍ قَطَرَتْ عَلَى وَجْهِ الْأَرْضِ أَيُّ قَطْرَةٍ هِيَ وَ أَوَّلِ عَيْنٍ فَاضَتْ عَلَى وَجْهِ الْأَرْضِ أَيُّ عَيْنٍ هِيَ وَ أَوَّلِ شَيْ‏ءٍ اهْتَزَّ عَلَى وَجْهِ الْأَرْضِ أَيُّ شَيْ‏ءٍ هُوَ",
          "فَأَجَابَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ لَهُ أَخْبِرْنِي عَنِ الثَّلَاثِ الْأُخَرِ أَخْبِرْنِي عَنْ مُحَمَّدٍ كَمْ لَهُ مِنْ إِمَامٍ عَدْلٍ وَ فِي أَيِّ جَنَّةٍ يَكُونُ وَ مَنْ سَاكَنَهُ مَعَهُ فِي جَنَّتِهِ فَقَالَ يَا هَارُونِيُّ إِنَّ لِمُحَمَّدٍ اثْنَيْ عَشَرَ إِمَامَ عَدْلٍ لَا يَضُرُّهُمْ خِذْلَانُ مَنْ خَذَلَهُمْ وَ لَا يَسْتَوْحِشُونَ بِخِلَافِ مَنْ خَالَفَهُمْ وَ إِنَّهُمْ فِي الدِّينِ أَرْسَبُ مِنَ الْجِبَالِ الرَّوَاسِي فِي الْأَرْضِ وَ مَسْكَنُ مُحَمَّدٍ فِي جَنَّتِهِ مَعَهُ أُولَئِكَ الِاثْنَيْ عَشَرَ الْإِمَامَ الْعَدْلَ ",
          "فَقَالَ صَدَقْتَ وَ اللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ إِنِّي لَأَجِدُهَا فِي كُتُبِ أَبِي هَارُونَ كَتَبَهُ بِيَدِهِ وَ أَمْلَاهُ مُوسَى عَمِّي ( عليه السلام ) قَالَ فَأَخْبِرْنِي عَنِ الْوَاحِدَةِ أَخْبِرْنِي عَنْ وَصِيِّ مُحَمَّدٍ كَمْ يَعِيشُ مِنْ بَعْدِهِ وَ هَلْ يَمُوتُ أَوْ يُقْتَلُ قَالَ يَا هَارُونِيُّ يَعِيشُ بَعْدَهُ ثَلَاثِينَ سَنَةً لَا يَزِيدُ يَوْماً وَ لَا يَنْقُصُ يَوْماً ثُمَّ يُضْرَبُ ضَرْبَةً هَاهُنَا يَعْنِي عَلَى قَرْنِهِ فَتُخْضَبُ هَذِهِ مِنْ هَذَا ",
          "قَالَ فَصَاحَ الْهَارُونِيُّ وَ قَطَعَ كُسْتِيجَهُ وَ هُوَ يَقُولُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ وَ أَنَّكَ وَصِيُّهُ يَنْبَغِي أَنْ تَفُوقَ وَ لَا تُفَاقَ وَ أَنْ تُعَظَّمَ وَ لَا تُسْتَضْعَفَ ",
          "قَالَ ثُمَّ مَضَى بِهِ عَلِيٌّ ( عليه السلام ) إِلَى مَنْزِلِهِ فَعَلَّمَهُ مَعَالِمَ الدِّينِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Abdullah Bin Al Qasim, from Hanan Bin Al Sarraj, fromDawood Bin Suleyman Al Kisai’e, from Abu Al Tafeyl who said,",
            "‘I attended the funeral of Abu Bakr on the day he died, and I attended When Umar was pledged allegiance to and Ali<sup>asws</sup> was seated on the side. There came over a Jewish boy of a beautiful face, good looking. Upon him were excellent clothes and he was from the children of Haroun<sup>as</sup>, until he stood by the head of Umar and he said, ‘O commander of the faithful! Are you the most knowledgeable one of this community of their Books and the matters of their Prophet<sup>saww</sup>?’ ",
            "He (the narrator) said, ‘Umar lowered his head, so he said, ‘Is it you I mean’, and he reiterated the words upon him. So, Umar said to him, ‘Why is that?’ He said, ‘I have come to you investigating for myself as I am doubting in my religion’. He said, ‘Besides you there is this youth’. He said, ‘And who is this youth?’ He said, ‘This is Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, a cousin of Rasool-Allah<sup>saww</sup>, and this is the father of Al-Hassan<sup>asws</sup> and Al-Hassan<sup>asws</sup>, two (grand) sons<sup>asws</sup> of Rasool-Allah<sup>saww</sup>, and this is the husband of (Syeda) Fatima<sup>asws</sup> daughter<sup>asws</sup> of Rasool-Allah<sup>saww</sup>’.",
            "The Jew turned towards Ali<sup>asws</sup> and he said, ‘Are you<sup>asws</sup> like that?’ He<sup>asws</sup> said: ‘Yes’. He said, ‘I want to ask you<sup>asws</sup> about three and three and one’. So Amir Al-Momineen<sup>asws</sup> smiled from without a smile (half-smile) and said: ‘O Harouny! What is preventing you from saying ‘seven’?’ He said, ‘I shall ask you<sup>asws</sup> about three, and if you<sup>asws</sup> answer me, I shall ask about what is after these, and if you<sup>asws</sup> do not know these, I shall know that there isn’t a knowledgeable one among you all’. ",
            "Ali<sup>asws</sup> said: ‘I<sup>asws</sup> ask you by the god which you worship. If I<sup>asws</sup> were to answer you regarding everything what you want, will you leave your religion and enter into my<sup>asws</sup> Religion?’ He said, ‘I have not come here except for that’. He<sup>asws</sup> said: ‘So Ask’. He said, ‘Inform me about the first drop of blood which dripped upon the surface of the earth, which drop was it? And the first spring which gushed upon the surface of the earth, which spring was it? And the first thing which vibrated upon the surface of the earth, which was it?’ ",
            "So Amir Al-Momineen<sup>asws</sup> answered him, saying to him: ‘Inform me about the other three’. (He said), ‘Inform me about Muhammad<sup>saww</sup>, how many just Imams<sup>asws</sup> are there for him<sup>saww</sup>, and in which Garden is he<sup>saww</sup> existing, and who is settled with him<sup>saww</sup> in his<sup>saww</sup> Garden?’ He<sup>asws</sup> said: ‘O Harouny! For Muhammad<sup>saww</sup> there are twelve just Imams<sup>asws</sup>. Neither does the abandonment of the abandoners harm them<sup>asws</sup> nor would they<sup>asws</sup> be feeling terrified by the opposition of the ones who oppose them<sup>asws</sup>, and they<sup>asws</sup> are firmer in the Religion than the tall mountains in the earth; and Muhammad<sup>saww</sup> would be dwelling in his<sup>saww</sup> Garden and with him<sup>saww</sup> would be those twelve just Imams<sup>asws</sup>’. ",
            "So he said, ‘You<sup>asws</sup> speak the truth. By Allah<sup>azwj</sup> Who, there is no god except for Him<sup>azwj</sup>, I have found it in the Book of my father Haroun. He<sup>as</sup> wrote it by his<sup>as</sup> own hand and Musa<sup>as</sup> my<sup>as</sup> uncle dictated it. Inform me about the one (last question). Inform me about the successor<sup>asws</sup> of Muhammad<sup>saww</sup>, how long would he<sup>asws</sup> live from after him<sup>saww</sup>, and would he<sup>asws</sup> be dying or would he<sup>asws</sup> be murdered?’ He<sup>asws</sup> said: ‘O Harouny! He<sup>asws</sup> would live from after him<sup>saww</sup> for thirty years, not increasing by a day nor reducing by a day’. Then he<sup>asws</sup> would be struck (by the sword) over here, meaning upon his<sup>asws</sup> forehead (and said): ‘This (beard) would be dyed from this (head)’. ",
            "He (the narrator) said, ‘The Harouny shrieked and cut off his religious pendant and he was saying, ‘I testify that there is no god except Allah<sup>azwj</sup> Alone, there being no associates for Him<sup>azwj</sup>, and I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, and you<sup>asws</sup> are his<sup>saww</sup> successor<sup>asws</sup>, and you<sup>asws</sup> should be above and not have anyone above you<sup>asws</sup>, and that you<sup>asws</sup> should be revered and not be weakened’. ",
            "He (the narrator) said, ‘Then Ali<sup>asws</sup> (went away) with him to his<sup>asws</sup> house and taught him the knowledge of the Religion’."
          ],
          "en.sarwar": [
            " 5. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid his father from ‘Abdallah ibn al-Qasim from Hanan ibn al-Sarraj from Dawud ibn Sulayman al-Kisa‘i from abu al-Tufayl who has said the following. “I was present in the funeral procession of abu Bakr the day ittook place. I was also present when ‘Umar took oath of allegiance and Ali (a.s.) was sitting on the side. A young, good looking, well dressed Jewish boy came. He was a descendant of Harun and he stood (on a place that was) above ’Umar and asked, “O Amir al-Mu’minin, are you the most knowledgeable person in this nation in their book and the commands of their prophet?” The narrator has said that ’Umar kept his head down. He then said, “I meant you.” He repeated his words. ’Umar said, “Why is that?” He said, “I have doubts about my relgion and I have come to you for guidance.” He (‘Umar said, “Go to this young man.” He said, “Who is this young man?” He said, “He is Ali ibn abu Talib (a.s.), the cousin of the Messenger of Allah and he is the father of al-Hassan and al-Husayn the grandsons of the Messenger of Allah and he is the husband of Fatima daughter of the Messenger of Allah.” The young Jewish man then went to Ali (a.s.) and said, “Are you such a person?” He said, “Yes, I am such a person.” He said, “I want to ask you about three and three and one.” The narrator has said that Amir al-Mu’minin Ali (a.s.) then smiled a different smile and said, “O Haruni, what prevents you from saying ‘seven’?” He said, “I ask about three. If you answered me then I will ask you about the rest. If you could not answer then will assume that there is no scholars among you.” Ali (a.s.) said, “I swear you to the Lord in whom you believe, if will answer whatever you will ask, will then leave your religion and accept our religion?” He said, “I have come for no other reason but that.” Ali (a.s.) said, “Ask your questions.” He said, “Tell me about the first drop of blood that was spilled on earth what drop was that? Tell me about the first fountain that gushed out of earth which one was it?” Amir al-Mu’minin Ali (a.s.) answered him. He then said, “Tell me about the other three. Tell me about Muhammad. How many Imams who possess the quality of justice will be there as his successors? In which paradise he will be? Who will be with him in paradise?” He said, “O Haruni, there will twelve just Imams as successors of Muhammad. No one’s betrayal will harm them and they will not feel frightened because of people’s opposition to them. In the matters of religion they will be stronger than the firm mountains on earth. In Paradise Muhammad will dwell with the twelve Imams who possess the noble quality of justice.” He then said, “You have spoken the truth by Allah, besides whom there is no lord. I find them in the book of my father Harun. He has written it in his own hand writing. My uncle Moses had dictated to him.” He then said, “Tell me about the ‘one’. Tell me about the executor of the will of Muhammad. For how long he will live after him? Will he die or will he be killed?” He Ali (a.s.), “O Haruni, he will live after him thirty years, not one day less and not one day more. Then he will be hit with an strike here –meaning over his head- and then this will be stained with this.” The jJewish man screamed loudly and broke his Kustija (a Jewish religious object) and he would say, “I testify that there is no lord besides Allah Who is One and has no partner and I testify the Muhammad is His servant and His Messenger and that you are the executor of his will. You must be above all and no one must be above you. Your greatness must be acknowledged and you must not be weakened.” The narrator has said that Ali (a.s.) then took him to his house and taught him the Divine guidance.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/222)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1386,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَبِي سَعِيدٍ الْعُصْفُورِيِّ عَنْ عَمْرِو بْنِ ثَابِتٍ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ خَلَقَ مُحَمَّداً وَ عَلِيّاً وَ أَحَدَ عَشَرَ مِنْ وُلْدِهِ مِنْ نُورِ عَظَمَتِهِ فَأَقَامَهُمْ أَشْبَاحاً فِي ضِيَاءِ نُورِهِ يَعْبُدُونَهُ قَبْلَ خَلْقِ الْخَلْقِ يُسَبِّحُونَ اللَّهَ وَ يُقَدِّسُونَهُ وَ هُمُ الْأَئِمَّةُ مِنْ وُلْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Al Husayn, from Abu Saeed Al Usfoury, from Amro Bin Sabit, from Abu Hamza who said, ",
            "‘I heard Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Created Muhammad<sup>saww</sup> and Ali<sup>asws</sup> and eleven from his<sup>asws</sup> sons<sup>asws</sup> from the Light of His<sup>azwj</sup> Magnificence. Then He<sup>azwj</sup> Stood them<sup>asws</sup> as being resemblances in the illumination of His<sup>azwj</sup> Light, worshipping Him<sup>azwj</sup> before the creation of the creatures. They<sup>asws</sup> were Glorifying Allah<sup>azwj</sup> and they<sup>asws</sup> were Extolling His<sup>azwj</sup> Holiness, and they<sup>asws</sup> are the Imams<sup>asws</sup> from the children of Rasool-Allah<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Muhammad ibn al-Husayn from abu Sa‘id al-‘Usfuriy from ‘Amr aaand ibn Thabit from abu Hamza who has said the following. “I heard Ali ibn al-Husayn say, ‘Allah created Muhammad , Ali and the eleven Imams from his descendants out of the light of His greatness. He then placed them as figures in the brightness of His light where they worshipped Him before the creation of the creatures. They would speak of the Glory of Allah and of His Holiness. They are the Imams from descendants of the Messenger of Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/222)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1387,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْخَشَّابِ عَنِ ابْنِ سَمَاعَةَ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ رِبَاطٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ الِاثْنَا عَشَرَ الْإِمَامَ مِنْ آلِ مُحَمَّدٍ ( عليه السلام ) كُلُّهُمْ مُحَدَّثٌ مِنْ وُلْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مِنْ وُلْدِ عَلِيٍّ وَ رَسُولُ اللَّهِ وَ عَلِيٌّ ( عليه السلام ) هُمَا الْوَالِدَانِ ",
          "فَقَالَ عَلِيُّ بْنُ رَاشِدٍ كَانَ أَخَا عَلِيِّ بْنِ الْحُسَيْنِ لِأُمِّهِ وَ أَنْكَرَ ذَلِكَ فَصَرَّرَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ قَالَ أَمَا إِنَّ ابْنَ أُمِّكَ كَانَ أَحَدَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Abdullah Bin Muhammad Al Khashhab, from Ibn Sama’at, from Ali Bin Al Hassan Bin Ribat, from Ibn Azina, from Zurara who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘The twelve Imams<sup>asws</sup> are from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, all of them being Muhaddath (whom the Angels discuss with), from the children of Rasool-Allah<sup>saww</sup>, and from the children of Ali<sup>asws</sup>; and Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup>, they are the two fathers<sup>asws</sup>’. ",
            "Ali Bin Rashid said, ‘There was a brother of Ali Bin Al Husayn<sup>asws</sup> to his<sup>asws</sup> mother’s side, and he denied that, so Abu Ja’far<sup>asws</sup> was furious and said: ‘But the son<sup>asws</sup> of your mother is one of them<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 7. Muhammad ibn Yahya has narrated from ‘Abdallah ibn Muhammad al-Khashshab from ibn Sama‘a from Ali ibn al-Hassan ibn Ribat from ibn ’Udhayna from Zurara who has said the following. “I heard abu Ja‘far say, ‘The twelve Imams all from the family of Muhammad (s.a) are the ones to whom (the angles) speak. They all are from the descendants of the Messenger of Allah and the descendants of Ali the Messenger of Allah and Ali (a.s.) are their ancestors.” Ali ibn Rashid has said that Ali ibn al-Husayn (a.s.) had a brother from his (foster mother’s / not his real mother the Persian princes) side who did not believe in the Hadith expressed denial. The Imam (a.s.) said to him loudly, “The son of your mother is one of them..”"
          ]
        }
      },
      {
        "index": 1388,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مَسْعَدَةَ بْنِ زِيَادٍ عَنْ أَبِي عَبْدِ اللَّهِ وَ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ إِبْرَاهِيمَ عَنْ أَبِي يَحْيَى الْمَدَائِنِيِّ عَنْ أَبِي هَارُونَ الْعَبْدِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كُنْتُ حَاضِراً لَمَّا هَلَكَ أَبُو بَكْرٍ وَ اسْتَخْلَفَ عُمَرَ أَقْبَلَ يَهُودِيٌّ مِنْ عُظَمَاءِ يَهُودِ يَثْرِبَ وَ تَزْعُمُ يَهُودُ الْمَدِينَةِ أَنَّهُ أَعْلَمُ أَهْلِ زَمَانِهِ حَتَّى رُفِعَ إِلَى عُمَرَ فَقَالَ لَهُ يَا عُمَرُ إِنِّي جِئْتُكَ أُرِيدُ الْإِسْلَامَ فَإِنْ أَخْبَرْتَنِي عَمَّا أَسْأَلُكَ عَنْهُ فَأَنْتَ أَعْلَمُ أَصْحَابِ مُحَمَّدٍ بِالْكِتَابِ وَ السُّنَّةِ وَ جَمِيعِ مَا أُرِيدُ أَنْ أَسْأَلَ عَنْهُ",
          "قَالَ فَقَالَ لَهُ عُمَرُ إِنِّي لَسْتُ هُنَاكَ لَكِنِّي أُرْشِدُكَ إِلَى مَنْ هُوَ أَعْلَمُ أُمَّتِنَا بِالْكِتَابِ وَ السُّنَّةِ وَ جَمِيعِ مَا قَدْ تَسْأَلُ عَنْهُ وَ هُوَ ذَاكَ فَأَوْمَأَ إِلَى عَلِيٍّ ( عليه السلام ) فَقَالَ لَهُ الْيَهُودِيُّ يَا عُمَرُ إِنْ كَانَ هَذَا كَمَا تَقُولُ فَمَا لَكَ وَ لِبَيْعَةِ النَّاسِ وَ إِنَّمَا ذَاكَ أَعْلَمُكُمْ فَزَبَرَهُ عُمَرُ",
          "ثُمَّ إِنَّ الْيَهُودِيَّ قَامَ إِلَى عَلِيٍّ ( عليه السلام ) فَقَالَ لَهُ أَنْتَ كَمَا ذَكَرَ عُمَرُ فَقَالَ وَ مَا قَالَ عُمَرُ فَأَخْبَرَهُ قَالَ فَإِنْ كُنْتَ كَمَا قَالَ سَأَلْتُكَ عَنْ أَشْيَاءَ أُرِيدُ أَنْ أَعْلَمَ هَلْ يَعْلَمُهُ أَحَدٌ مِنْكُمْ فَأَعْلَمَ أَنَّكُمْ فِي دَعْوَاكُمْ خَيْرُ الْأُمَمِ وَ أَعْلَمُهَا صَادِقِينَ وَ مَعَ ذَلِكَ أَدْخُلُ فِي دِينِكُمُ الْإِسْلَامِ",
          "فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) نَعَمْ أَنَا كَمَا ذَكَرَ لَكَ عُمَرُ سَلْ عَمَّا بَدَا لَكَ أُخْبِرْكَ بِهِ إِنْ شَاءَ اللَّهُ قَالَ أَخْبِرْنِي عَنْ ثَلَاثٍ وَ ثَلَاثٍ وَ وَاحِدَةٍ فَقَالَ لَهُ عَلِيٌّ ( عليه السلام ) يَا يَهُودِيُّ وَ لِمَ لَمْ تَقُلْ أَخْبِرْنِي عَنْ سَبْعٍ فَقَالَ لَهُ الْيَهُودِيُّ إِنَّكَ إِنْ أَخْبَرْتَنِي بِالثَّلَاثِ سَأَلْتُكَ عَنِ الْبَقِيَّةِ وَ إِلَّا كَفَفْتُ فَإِنْ أَنْتَ أَجَبْتَنِي فِي هَذِهِ السَّبْعِ فَأَنْتَ أَعْلَمُ أَهْلِ الْأَرْضِ وَ أَفْضَلُهُمْ وَ أَوْلَى النَّاسِ بِالنَّاسِ",
          "فَقَالَ لَهُ سَلْ عَمَّا بَدَا لَكَ يَا يَهُودِيُّ قَالَ أَخْبِرْنِي عَنْ أَوَّلِ حَجَرٍ وُضِعَ عَلَى وَجْهِ الْأَرْضِ وَ أَوَّلِ شَجَرَةٍ غُرِسَتْ عَلَى وَجْهِ الْأَرْضِ وَ أَوَّلِ عَيْنٍ نَبَعَتْ عَلَى وَجْهِ الْأَرْضِ فَأَخْبَرَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) ثُمَّ قَالَ لَهُ الْيَهُودِيُّ أَخْبِرْنِي عَنْ هَذِهِ الْأُمَّةِ كَمْ لَهَا مِنْ إِمَامٍ هُدًى وَ أَخْبِرْنِي عَنْ نَبِيِّكُمْ مُحَمَّدٍ أَيْنَ مَنْزِلُهُ فِي الْجَنَّةِ وَ أَخْبِرْنِي مَنْ مَعَهُ فِي الْجَنَّةِ",
          "فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ لِهَذِهِ الْأُمَّةِ اثْنَيْ عَشَرَ إِمَاماً هُدًى مِنْ ذُرِّيَّةِ نَبِيِّهَا وَ هُمْ مِنِّي وَ أَمَّا مَنْزِلُ نَبِيِّنَا فِي الْجَنَّةِ فَفِي أَفْضَلِهَا وَ أَشْرَفِهَا جَنَّةِ عَدْنٍ وَ أَمَّا مَنْ مَعَهُ فِي مَنْزِلِهِ فِيهَا فَهَؤُلَاءِ الِاثْنَا عَشَرَ مِنْ ذُرِّيَّتِهِ وَ أُمُّهُمْ وَ جَدَّتُهُمْ وَ أُمُّ أُمِّهِمْ وَ ذَرَارِيُّهُمْ لَا يَشْرَكُهُمْ فِيهَا أَحَدٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Mas’ada Bin Ziyad, from Abu Abdullah and Muhammad Bin Al Husayn, from Ibrahim, from Abu Ibrahim, from Abu Yahya Al Madainy, from Abu Haroun Al Abdy, from Abu Saeed Al Khudry who said, ",
            "‘I was present when Abu Bakr died and chose Umar as a Caliph. A Jew from the great ones of the Jews of Yasrib came over, and the Jews of Al-Medina thought that he (Umar) was the most knowledgeable of the people of his time, until he was brought to Umar, and he said to him, ‘O Umar! I come to you intending Al-Islam, so if you were to inform me about what I ask you then you are the most knowledgeable of the companions of Muhammad<sup>azwj</sup> with the Book and the Sunnah and the entirety of what I ask you about’. ",
            "He (the narrator) said, ‘Umar said to him, ‘I am not in that position, but I shall guide you to the one<sup>asws</sup> who is the most knowledgeable of our community with the Book and the Sunnah and the entirety of what you have to ask about, and he<sup>asws</sup> is that one’, and he gestured towards Ali<sup>asws</sup>. The Jew said to him, ‘O Umar! If this one is as you are saying, then what is the matter with you taking pledges of allegiances of the people, and rather that one is the most knowledgeable one of you all?’ So Umar scolded him. ",
            "Then the Jew stood up (and came) to Ali<sup>asws</sup> and said to him<sup>asws</sup>, ‘Are you like what Umar mentioned?’ He<sup>asws</sup> said: ‘And what did Umar say?’ So he informed him<sup>asws</sup>. He<sup>asws</sup> said: ‘Supposing I<sup>asws</sup> am just as what he said?’ He said, ‘I shall ask you<sup>asws</sup> about certain things I want to know. If anyone from you all know, then I shall know that you all are a good community in your calling and know that you are truthful, and along with that, I shall enter into your Religion Al-Islam’. ",
            "So Amir Al-Momineen<sup>asws</sup> said: ‘Yes, I<sup>asws</sup> am just as what Umar mentioned to you. Ask about whatever come to you.  I<sup>asws</sup> shall inform you with it, if Allah<sup>azwj</sup> so Desires’. He said, ‘Inform me about three and three and one’. Ali<sup>asws</sup> said to him: ‘O Jew! And why do you not say, ‘Inform me about seven?’’. The Jew said to him<sup>asws</sup>, ‘if you<sup>asws</sup> were to inform me with the three, I shall ask you<sup>asws</sup> about the remainder, or else I shall stop. So if you were to answer me regarding these seven, then you are the most knowledgeable of the people of the earth and their most superior, and the closest of the people with the people’. ",
            "So he<sup>asws</sup> said: ‘Ask about whatever comes to you, O Jew!’ He said, ‘Inform me about the first rock placed upon the surface of the earth, and the first tree planted upon the surface of the earth, and the first spring originated upon the surface of the earth’. So Amir Al-Momineen<sup>asws</sup> informed him. Then the Jew said to him<sup>asws</sup>, ‘Inform me about this community, how many Imams<sup>asws</sup> of Guidance are there for it, and inform me about your Prophet Muhammad<sup>saww</sup>, where is his<sup>asws</sup> house in the Paradise, and inform me who would be with him<sup>saww</sup> in the Paradise’.",
            "So Amir Al-Momineen<sup>asws</sup> said to him: ‘For this community there are twelve Imam<sup>asws</sup> of Guidance from the children of His<sup>azwj</sup> Prophet<sup>saww</sup>, and they<sup>asws</sup> are from me<sup>asws</sup>; and as for the house of our Prophet<sup>saww</sup> in the Paradise, so it is in its most superior and noblest, the Garden of Eden; and as for the ones who would be with him<sup>saww</sup> in his<sup>saww</sup> house therein, so it would be these twelve Imams<sup>asws</sup> from his<sup>asws</sup> offspring, and their<sup>asws</sup> mothers and their<sup>asws</sup> grandmothers, and the mothers of their<sup>asws</sup> grandmothers, and their<sup>asws</sup> children. No one (from the general public) would participate with them<sup>asws</sup> in it’."
          ],
          "en.sarwar": [
            " 8. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Mas‘ada ibn Ziyad from abu ‘Abdallah and Muhammad ibn al-Husayn from Ibrahim from ibn abu Yahya al-Madyani from abu Harun al-‘Abdi from abu Sa‘id al-Khudriy who has said the following. “I was (in the city of al-Madina) when abu Bakr was no more and he appointed ‘Umar as his successor. Once one of the great Jewish men of Yathrib came to ‘Umar. The Jewish people of the city of al-Madina thought that he (‘Umar) was the most knowledgeable person of his time.He came to ‘Umar and said, “O ‘Umar, I have come to accept Islam if you would answer what I will ask. Are you the most knowledgeable person among the companions of Muhammad in the matters of the book, the Sunnah (his traditions) and all that I like to ask from you.” The narrator has said that ‘Umar than said to him, “I am not the one you are looking for. However, I can guide you to the one who is the most knowledgeable person in our nation in the matters of the book, the Sunnah (traditions of the Holy Prophet (s.a.) and all that you like to ask.” He pointed out to Ali (a.s.). the Jewish man then said, “If what you say is true then why have you taken the oath of allegiance from people? The most knowledge among you is that man.” ‘Umar then treated him harshly. The Jewish man went to Ali (a.s.) and said, “Are you as such as ‘Umar has said?” He (Ali (a.s.) then asked, “What has ‘Umar said?” He then informed him of what ‘Umar had said. The Jewish man said, “If are as has said you are, I like to ask you certain questions toknow if anyone of you knows the answer so I would know that your claim is true that you are the best, the best and the truth among the nations. In such case I will accept your religion, Islam.” Amir al-Mu’minin (a.s.) said, “Yes, I am as ‘Umar has I am. Ask whatever you would like to ask. I will give the answer by the will of Allah.” He said, “Tell me about three and three and one.” Ali (a.s.) said, “O Jewish man, why do not say, “Tell me about seven?” The Jewish man then said, “If you would tell me the answer to the three then I will ask you other questions, otherwise, I will abstain. If you would provide me the answer to these seven you then you are the most knowledgeable person on earth, the best of them and have more authority over the people than they themselves do” he then said, “Ask your questions O Jewish man.” .He said, “Tell me about the first stone that was placed on the face of earth, the first tree that was planted on earth and the first water fountain that gushed out of earth.” Amir al-Mu’minin (a.s.) answered his questions. The Jewish man then said to him, “Tell me how many Imams (Leaders with Divine Authority) will this nation have? Tell me about your Prophet as to where will be his place in paradise and who will be with him therein?” Amir al-Mu’minin (a.s.) said, “This nation will have twelve Imams ((Leaders with Divine Authority).All of them will be from the descendants of the the Holy Prophet (s.a.) of this nation. They will be from my descendants. The place of out the Holy Prophet (s.a.) in paradise will be the best and holiest of them in Eden. Those who will be with him therein in his dwelling will be these twelve people from his descendants. Their mother and grand mother and the mother of their mother and their descendants will live with them therein. No one else will live therein as their partner.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/227)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1389,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ قَالَ دَخَلْتُ عَلَى فَاطِمَةَ ( عليها السلام ) وَ بَيْنَ يَدَيْهَا لَوْحٌ فِيهِ أَسْمَاءُ الْأَوْصِيَاءِ مِنْ وُلْدِهَا فَعَدَدْتُ اثْنَيْ عَشَرَ آخِرُهُمُ الْقَائِمُ ( عليه السلام ) ثَلَاثَةٌ مِنْهُمْ مُحَمَّدٌ وَ ثَلَاثَةٌ مِنْهُمْ عَلِيٌّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ibn Mahboub, from Abu Al Jaroud, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, from Jabir Bin Abdullah Al-Ansary who said, ‘I went over to (Syeda) Fatima<sup>asws</sup> and in front of her<sup>asws</sup> was a Tablet wherein were the names of the successors<sup>asws</sup> from her<sup>asws</sup> children. So, I counted twelve, the last of these being Al-Qaim<sup>asws</sup>. There from these were ‘Muhammad’ and thee from these were ‘Ali’’."
          ],
          "en.sarwar": [
            " 9. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from ibn Muhbub from abu al-Jarud from abu Ja‘far from Jabir ibn ‘Abdallah al-Ansari who has said the following “Once I went to see Fatima (a.s.) (daughter of the Holy Prophet (s.a.) and I saw with her a tablet in which the names of the executors of the wills of (Leaders with Divine Authority) were written. I then counted them to twelve. The last one’s name was al-Qa’im (the one who will rise with Divine authority). The names of three of them was Muhammad and the names of another three was Ali.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/228)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1390,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ اللَّهَ أَرْسَلَ مُحَمَّداً ( صلى الله عليه وآله ) إِلَى الْجِنِّ وَ الْإِنْسِ وَ جَعَلَ مِنْ بَعْدِهِ اثْنَيْ عَشَرَ وَصِيّاً مِنْهُمْ مَنْ سَبَقَ وَ مِنْهُمْ مَنْ بَقِيَ وَ كُلُّ وَصِيٍّ جَرَتْ بِهِ سُنَّةٌ وَ الْأَوْصِيَاءُ الَّذِينَ مِنْ بَعْدِ مُحَمَّدٍ ( صلى الله عليه وآله ) عَلَى سُنَّةِ أَوْصِيَاءِ عِيسَى وَ كَانُوا اثْنَيْ عَشَرَ وَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَلَى سُنَّةِ الْمَسِيحِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeydullah, from Muhammad Bin Al Fuzayl, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having: ‘Allah<sup>azwj</sup> Sent Muhammad<sup>saww</sup> to the Jinn and the human and after him<sup>saww</sup> Made twelve succesors<sup>asws</sup>. From them<sup>asws</sup> are some who have preceded, and from them<sup>asws</sup> are some who remain; and every successor<sup>asws</sup>, a Sunnah flowed with him<sup>asws</sup>; and the successors<sup>asws</sup>, those from after Muhammad<sup>saww</sup> are upon the Sunnah of the successors<sup>as</sup> of Isa<sup>as</sup>, they were twelve, and it was so that Amir Al-Momineen<sup>asws</sup> was upon the Sunnah of Isa<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 10. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from Muhammad ibn al-Fadl from abu Hamza from abu Ja‘far (a.s.) who has said the following “Allah sent Muhammad (s.a.) to all Jinn and manand appointed twelve executors of the will Of these people are those who have left this world and there are those who will have to complete their task. All the executors of the wills (of the prophets) experience certain traditions, Sunnah. The executors of the will after Muhammad (s.a.) experienced the traditions, Sunnah of the executor of the will of Jesus who were twelve in number. Amir al-Mu’minin (a.s.) experienced the tradition of Jesus.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/229)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1391,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ الْعَبَّاسِ بْنِ الْحَرِيشِ عَنْ أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ لِابْنِ عَبَّاسٍ إِنَّ لَيْلَةَ الْقَدْرِ فِي كُلِّ سَنَةٍ وَ إِنَّهُ يَنْزِلُ فِي تِلْكَ اللَّيْلَةِ أَمْرُ السَّنَةِ وَ لِذَلِكَ الْأَمْرِ وُلَاةٌ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ ابْنُ عَبَّاسٍ مَنْ هُمْ قَالَ أَنَا وَ أَحَدَ عَشَرَ مِنْ صُلْبِي أَئِمَّةٌ مُحَدَّثُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa and Muhammad Bin Abu Abdullah and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, altogether from Al Hassan Bin Al Abbas Bin Al Hareysh, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> that Amir Al-Momineen<sup>asws</sup> said to Ibn Abbas: ‘The Night of Pre-determination (لَيْلَةَ الْقَدْرِ) is during every years, and during that night descends the Commands for the year, and for that has to be a Master<sup>asws</sup> of the Command after Rasool-Allah<sup>saww</sup>’. So Ibn Abbas said, ‘Who are they<sup>asws</sup>?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> and eleven from my<sup>asws</sup> lineage, Imams<sup>asws</sup> who are <span class=\"iTxt\">Muhaddith</span> (Whom Angels discuss with)’."
          ],
          "en.sarwar": [
            " 11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and mdd ibn abu ‘Abdallah and Muhammad ibn al-Husayn from Sahl ibn Ziyad all from al-Hassan ibn al-‘Abbass ibn al-Jarish from abu Ja‘far al-Thani (a.s.) who has said the following. “Amir al-Mu’minin Ali (a.s.) said to ibn ‘Abbass, “Layla al-Qadr (the night of destiny) comes every year and that night the command for the whole year descend down. To receive that command are the Leaders with Divine Authority after the Messenger of Allah.” Ibn ‘Abbass then asked, “Who are they?” He said, “I and the eleven persons from my descendant who all are Imams, (Muhaddathun) such persons to whom angles speak.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (229/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1392,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:12",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِأَصْحَابِهِ آمِنُوا بِلَيْلَةِ الْقَدْرِ إِنَّهَا تَكُونُ لِعَلِيِّ بْنِ أَبِي طَالِبٍ وَ لِوُلْدِهِ الْأَحَدَ عَشَرَ مِنْ بَعْدِي ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "‘He (Abu Ja’far<sup>asws</sup>) said: ‘Rasool-Allah<sup>saww</sup> to his<sup>saww</sup> companions: ‘Believe in the Night of Pre-determination (لَيْلَةَ الْقَدْرِ), it would occur for Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> and for his<sup>asws</sup> sons<sup>asws</sup>, the eleven from after me<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 12. Through same chain of narrators the following is narrated. “the Messenger of Allah once said to his companions, ‘You must believ in the Layla al-Qadr (night of destiny). It is Ali ibn abu Talib (a.s.) and his eleven descendants after me.”"
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1393,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:13",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ لِأَبِي بَكْرٍ يَوْماً لا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْواتاً بَلْ أَحْياءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ وَ أَشْهَدُ أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) رَسُولُ اللَّهِ مَاتَ شَهِيداً وَ اللَّهِ لَيَأْتِيَنَّكَ فَأَيْقِنْ إِذَا جَاءَكَ فَإِنَّ الشَّيْطَانَ غَيْرُ مُتَخَيِّلٍ بِهِ ",
          "فَأَخَذَ عَلِيٌّ بِيَدِ أَبِي بَكْرٍ فَأَرَاهُ النَّبِيَّ ( صلى الله عليه وآله ) فَقَالَ لَهُ يَا أَبَا بَكْرٍ آمِنْ بِعَلِيٍّ وَ بِأَحَدَ عَشَرَ مِنْ وُلْدِهِ إِنَّهُمْ مِثْلِي إِلَّا النُّبُوَّةَ وَ تُبْ إِلَى اللَّهِ مِمَّا فِي يَدِكَ فَإِنَّهُ لَا حَقَّ لَكَ فِيهِ ",
          "قَالَ ثُمَّ ذَهَبَ فَلَمْ يُرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "‘Amir Al-Momineen<sup>asws</sup> said to Abu Bakr one day: ‘<span class=\"ibTxt\">[3:169] And reckon not those who are killed in Allah's Way as dead; but, they are alive (and) are being provided sustenance from their Lord</span>. And I<sup>asws</sup> testify that Muhammad<sup>saww</sup> Rasool<sup>saww</sup> of Allah<sup>azwj</sup> died as a martyr. By Allah<sup>azwj</sup>! He<sup>saww</sup> would be coming to you, therefore be convinced when he<sup>saww</sup> does come to you for the Satan<sup>la</sup> cannot be dreamt as being him<sup>saww</sup>’. ",
            "Ali<sup>asws</sup> grabbed Abu Bakr by the hand and showed him the Prophet<sup>saww</sup>, and he<sup>saww</sup> said to him: ‘O Abu Bakr! Believe in Ali<sup>asws</sup> and in eleven from his<sup>asws</sup> sons<sup>asws</sup>. They<sup>asws</sup> are like me<sup>saww</sup> except for the Prophet-hood, and repent to Allah<sup>azwj</sup> from what is in your hands, for there isn’t a right for you in it’. ",
            "He (the narrator) said, ‘Then he<sup>saww</sup> went as was not seen (again)’."
          ],
          "en.sarwar": [
            " 13. Through the same chain of narrators the following is narrated. “Amir al-Mu’minin Ali (a.s.) one day said to abu Bakr, “Do not think of those slain for the cause of God as dead. They are alive with their Lord and receive sustenance from Him.” (3:169).I testify that Muhammad, the Messenger of Allah died as a martyr. He by Allah, comes to you and do have any doubts when he will come to you. Satan can not appear in his disguise.” Ali (a.s.) took the hand of abu Bakr and showed the Holy Prophet (s.a) to him who said to him, “O abu Bakr, believe in Ali and in the eleven Imams from his descendants. They are all like me except prophet-hood. Repent before Allah because of what you involvement in what you are involved. You have no right in it.” The narrator has said that then he went and was not seen around.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/230)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1394,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:14",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ عَنِ الْحَسَنِ بْنِ مُوسَى الْخَشَّابِ عَنْ عَلِيِّ بْنِ سَمَاعَةَ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ رِبَاطٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ الِاثْنَا عَشَرَ الْإِمَامَ مِنْ آلِ مُحَمَّدٍ كُلُّهُمْ مُحَدَّثٌ مِنْ وُلْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ وُلْدِ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) فَرَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٌّ ( عليه السلام ) هُمَا الْوَالِدَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ubeydullah, from Al Hassan Bin Musa Al Khashhab, from Ali Bin Sama’at, from Ali Bin Al Hassan Bin Rabat, from Ibn Azina, from Zurara who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘The twelve Imams<sup>asws</sup> from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, all of them<sup>asws</sup> are <span class=\"iTxt\">Muhaddath</span> (Whom the Angels discuss with) from the children of Rasool-Allah<sup>saww</sup> and children of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>. Thus, Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup>, they<sup>asws</sup> are the two parents<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 14. Abu Ali al-Ash‘ari has narrated from ‘Ubaydallah from al-Hassan ibn Musa al-Khashshab from Ali ibn Sam‘Abdallah from Ali ibn al-Husayn ibn Ribat from ’Udhayna from Zurara who has said the following. “I heard abu Ja‘far say, ‘There will be twelve Imams from the family of Muhammad and they all will be (Muhaddathun), persons to whom angles speak. They will of the descendants of the Messenger of Allah and Ali ibn abu Talib (a.s.). The Messenger of Allah and Ali are their anscesters.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/231)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1395,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:15",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَعِيدِ بْنِ غَزْوَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يَكُونُ تِسْعَةُ أَئِمَّةٍ بَعْدَ الْحُسَيْنِ بْنِ عَلِيٍّ تَاسِعُهُمْ قَائِمُهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Saeed Bin Gazwan, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘There would happen to be nine Imams<sup>asws</sup> after Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup>, the ninth of them<sup>asws</sup> being their<sup>asws</sup> Qaim<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 15. Ali ibn Ibrahim has narrated from ibn abu ‘Umayr from Sa‘id ibn Ghazwan from abu Basir who has said the following. “I heard abu Ja‘far say, ‘after al-Husayn ibn Ali (a.s.) there will be nine Imams. The ninth of them will be Al-Qa’im (the one who will with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (231/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1396,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:16",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ نَحْنُ اثْنَا عَشَرَ إِمَاماً مِنْهُمْ حَسَنٌ وَ حُسَيْنٌ ثُمَّ الْأَئِمَّةُ مِنْ وُلْدِ الْحُسَيْنِ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Aban, from Zurara who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘We<sup>asws</sup> are twelve Imams<sup>asws</sup>. From them<sup>asws</sup> are Hassan<sup>asws</sup>, and Husayn<sup>asws</sup>, then the Imams<sup>asws</sup> are from the sons<sup>asws</sup> of Al-Husayn<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 16. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn mmd from al-Washsha’ from Aban from Zurara who has said the following. “I heard abu Ja‘far (a.s.) say, ‘We are twelve Imams. Al-Hassan and al-Husayn are of them then are the Imams from the descendants of al-Husayn (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/232)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1397,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:17",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَبِي سَعِيدٍ الْعُصْفُورِيِّ عَنْ عَمْرِو بْنِ ثَابِتٍ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنِّي وَ اثْنَيْ عَشَرَ مِنْ وُلْدِي وَ أَنْتَ يَا عَلِيُّ زِرُّ الْأَرْضِ يَعْنِي أَوْتَادَهَا وَ جِبَالَهَا بِنَا أَوْتَدَ اللَّهُ الْأَرْضَ أَنْ تَسِيخَ بِأَهْلِهَا فَإِذَا ذَهَبَ الِاثْنَا عَشَرَ مِنْ وُلْدِي سَاخَتِ الْأَرْضُ بِأَهْلِهَا وَ لَمْ يُنْظَرُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhamad Bin Al Husayn, from Abu Saeed Al Asoufy, from Amro Bin Sabit, from Abu Al Jaroud, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said:’ Rasool-Allah<sup>saww</sup> said: ‘I<sup>saww</sup> and twelve from my<sup>saww</sup> children<sup>asws</sup>, and you<sup>asws</sup> O Ali<sup>asws</sup> are the anchors of the earth, meaning its pegs and its ropes. By us<sup>asws</sup> Allah<sup>azwj</sup> Stabilises the earth from subsiding with its inhabitants. So when the twelve from my<sup>saww</sup> sons<sup>asws</sup> go away, the earth would submerge its inhabitants and they would not be Given a Respite’."
          ],
          "en.sarwar": [
            " 17ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَبِي سَعِيدٍ الْعُصْفُورِيِّ عَنْ عَمْرِو بْنِ ثَابِتٍ عَنْ أَبِي الْجَارُودِ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) إِنِّي وَاثْنَيْ عَشَرَ مِنْ وُلْدِي وَأَنْتَ يَا عَلِيُّ زِرُّ الارْضِ يَعْنِي أَوْتَادَهَا وَجِبَالَهَا بِنَا أَوْتَدَ الله الارْضَ أَنْ تَسِيخَ بِأَهْلِهَا فَإِذَا ذَهَبَ الاثْنَا عَشَرَ مِنْ وُلْدِي سَاخَتِ الارْضُ بِأَهْلِهَا وَلَمْ يُنْظَرُوا 17. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Muhammad ibn al-Hassan from Sa‘id al-‘Usfuriy from ‘Amran ibn Thabit from abu al-Jarud from abu Ja‘far (a.s.) who has said the following. “the Messenger of Allah has said, ‘ I and twelve persons from my descendants and you O Ali, are the securing anchor of the earth, that is, the pillars thereof and its ropes. Through us Allah has secured the earth from devouring the inhabitants. If all the twelve persons from my family will no longer be there, the earth will devour her inhabitants without delay.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (233/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1398,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:18",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبِي سَعِيدٍ رَفَعَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ وُلْدِيَ اثْنَا عَشَرَ نَقِيباً نُجَبَاءُ مُحَدَّثُونَ مُفَهَّمُونَ آخِرُهُمُ الْقَائِمُ بِالْحَقِّ يَمْلَأُهَا عَدْلًا كَمَا مُلِئَتْ جَوْراً ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Abu Saeed, raising it, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘From my<sup>saww</sup> children there would be twelve excellent captains, <span class=\"iTxt\">Muhaddisoun</span> (Whom the Angels discuss with), understanding ones. Their<sup>asws</sup> last one, the Rising one with the Truth (الْقَائِمُ بِالْحَقِّ) would fill it (the earth) with justice just as it had been filled with tyranny’."
          ],
          "en.sarwar": [
            " 18. Through the same chain of narrators it is narrated from abu Sa‘id in a marfu‘ manner from abu Ja‘far (a.s.) who has said the following. “The Messenger of Allah has said, “From my descendants there will be twelve noble supervisors, who are (Muhaddathun) persons to whom angles speak and very intelligent. The last of them will be Al-Qa’im (the one who will rise with Divine Authority) and with truth who will fill the earth with justice after being filled with injustice.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/234)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1399,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:19",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ كَرَّامٍ قَالَ حَلَفْتُ فِيمَا بَيْنِي وَ بَيْنَ نَفْسِي أَلَّا آكُلَ طَعَاماً بِنَهَارٍ أَبَداً حَتَّى يَقُومَ قَائِمُ آلِ مُحَمَّدٍ فَدَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فَقُلْتُ لَهُ رَجُلٌ مِنْ شِيعَتِكُمْ جَعَلَ لِلَّهِ عَلَيْهِ أَلَّا يَأْكُلَ طَعَاماً بِنَهَارٍ أَبَداً حَتَّى يَقُومَ قَائِمُ آلِ مُحَمَّدٍ ",
          "قَالَ فَصُمْ إِذاً يَا كَرَّامُ وَ لَا تَصُمِ الْعِيدَيْنِ وَ لَا ثَلَاثَةَ التَّشْرِيقِ وَ لَا إِذَا كُنْتَ مُسَافِراً وَ لَا مَرِيضاً فَإِنَّ الْحُسَيْنَ ( عليه السلام ) لَمَّا قُتِلَ عَجَّتِ السَّمَاوَاتُ وَ الْأَرْضُ وَ مَنْ عَلَيْهِمَا وَ الْمَلَائِكَةُ فَقَالُوا يَا رَبَّنَا ائْذَنْ لَنَا فِي هَلَاكِ الْخَلْقِ حَتَّى نَجُدَّهُمْ عَنْ جَدِيدِ الْأَرْضِ بِمَا اسْتَحَلُّوا حُرْمَتَكَ وَ قَتَلُوا صَفْوَتَكَ ",
          "فَأَوْحَى اللَّهُ إِلَيْهِمْ يَا مَلَائِكَتِي وَ يَا سَمَاوَاتِي وَ يَا أَرْضِيَ اسْكُنُوا ثُمَّ كَشَفَ حِجَاباً مِنَ الْحُجُبِ فَإِذَا خَلْفَهُ مُحَمَّدٌ ( صلى الله عليه وآله ) وَ اثْنَا عَشَرَ وَصِيّاً لَهُ ( عليهم السلام ) وَ أَخَذَ بِيَدِ فُلَانٍ الْقَائِمِ مِنْ بَيْنِهِمْ فَقَالَ يَا مَلَائِكَتِي وَ يَا سَمَاوَاتِي وَ يَا أَرْضِي بِهَذَا أَنْتَصِرُ لِهَذَا قَالَهَا ثَلَاثَ مَرَّاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Muhamad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman Al Asamma, from Karram who said, ",
            "‘I took an oath regarding what is between me and myself that I will not eat food during the day, ever, until the ‘Qaim<sup>asws</sup> of the Progeny of Muhammad<sup>saww</sup> rises. Then I went over to Abu Abdullah<sup>asws</sup> and I said to him<sup>asws</sup>, ‘A man from your<sup>asws</sup> Shias has Made it for Allah<sup>azwj</sup> upon him that he will not eat food by the day, ever, until the Qaim<sup>asws</sup> of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> rises’. ",
            "He<sup>asws</sup> said: ‘So Fast then O Karram, but do not Fast the two Eids, nor the three days of Al-Tashreek, nor when you are travelling, nor when sick, for Al-Husayn<sup>asws</sup>, when he<sup>asws</sup> was murdered, the skies and the earth and the ones upon them and the Angels raised a clamour and they said, ‘O our Lord<sup>azwj</sup>! Permit for us to destroy the people until we renew them with a new people on the earth due to that they have permitted Your<sup>azwj</sup> Sanctity (to be violated) and they murdered Your<sup>azwj</sup> elite’. ",
            "So Allah<sup>azwj</sup> Revealed unto them: “O My<sup>azwj</sup> Angels, and O My<sup>azwj</sup> skies, and O My<sup>azwj</sup> earth! Calm down!” Then He<sup>azwj</sup> Uncovered a Veil from the Veils, and there were behind it, Muhammad<sup>saww</sup> and twelve successors<sup>asws</sup> of his<sup>saww</sup>, and Grabbed the hand of Al-Qaim<sup>asws</sup> from between them<sup>asws</sup> and He<sup>azwj</sup> Said: “O My<sup>azwj</sup> Angels, and O My<sup>azwj</sup> skies, and O My<sup>azwj</sup> earth! By this one<sup>asws</sup> I<sup>azwj</sup> shall Triumph for this one<sup>asws</sup>”. He<sup>azwj</sup> Said it three times’."
          ],
          "en.sarwar": [
            " 19. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from mmd ibn al-Hassan ibn Shammun from ‘Abdallah ibn ‘Abd al-Rahman al-Asamm from Karram who has said the following. “I took an oath with my self that I will not any food during the day until the rise of Al-Qa’im (the rise of al-Mahdi with Divine Authority). I then went to see abu ‘Abdallah (a.s.).” The narrator has said, “A man from you Shi‘a (followers) has imposed on himself on oath not to eat any food during the day until the rise of Al-Qa’im from the family of Muhammad (s.a) (the rise of al-Mahdi with Divine Authority).” The Imam (a.s.) said, “Fast, then O Karram. Do not fast on the two ‘Id days and the three days of Tashriq (11,12,13) of the month of Dhil Hajj. Also do not fast when you are on a journey or when you will have an illness. It is because when al-Husayn was murdered the heavens and the earth and all the angles in them mourned and lamented before the Lord. They said, “Lord, grant us permission to destroy the creature and purge the earth from them because of their disregard of you reverence and their murdering your chosen people. Allah then inspired them, “My angels, My heavens and My earth be patient and relieved.. He then removed a barrier of the barriers and there appeared Muhammad and the twelve executors of his will. He then held the hand of so and so, Al-Qa’im (the one who will rise with Divine Authority) from among them and said, ‘O My angels, My heavens and My earth through this I will grant support for this.” He said it three times.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (235/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1400,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:126:20",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَبِي طَالِبٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ بْنِ مِهْرَانَ قَالَ كُنْتُ أَنَا وَ أَبُو بَصِيرٍ وَ مُحَمَّدُ بْنُ عِمْرَانَ مَوْلَى أَبِي جَعْفَرٍ ( عليه السلام ) فِي مَنْزِلِهِ بِمَكَّةَ فَقَالَ مُحَمَّدُ بْنُ عِمْرَانَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ نَحْنُ اثْنَا عَشَرَ مُحَدَّثاً فَقَالَ لَهُ أَبُو بَصِيرٍ سَمِعْتَ مِنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَحَلَّفَهُ مَرَّةً أَوْ مَرَّتَيْنِ أَنَّهُ سَمِعَهُ فَقَالَ أَبُو بَصِيرٍ لَكِنِّي سَمِعْتُهُ مِنْ أَبِي جَعْفَرٍ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahyaa and Ahmad Bin Muhammad, from Muhammad Bin Al Husayn, from Abu Talib, from Usman Bin Isa, from Sama’at Bin Mihran who said, ",
            "‘I, and Abu Baseer, and Mihran a slave of Abu Ja’far<sup>asws</sup> were in his<sup>asws</sup> house in Makkah. Muhammad Bin Imran said, ‘I heard Abu Abdullah<sup>asws</sup> saying: ‘We<sup>asws</sup> are twelve <span class=\"iTxt\">Muhaddith</span> (Whom the Angels discuss with)’. So Abu Baseer said to him, ‘You heard from Abu Abdullah<sup>asws</sup>?’ So he oathed to him once or twice that he did hear it. Then Abu Baseer said, ‘But I heard it from Abu Ja’far<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 20. Muhammad ibn Yahya and Ahmad ibn Muhammad have narrated from Muhammad ibn al-Husayn from abu Talib from ‘Uthman ibn ‘Isa from Sama‘Abdallah ibn Mihran who has said the following. “Once I, abu Basir and Muhammad ibn ‘Imran the slave of abu Ja‘far (a.s.) were in his house in Makka. Muhammad ibn ‘Imran said, “I have heard abu ‘Abdallah (a.s.) say, ‘We all twelve of us are Muhaddath (the ones to whom angels speak).” Abu Basir then said, “Did you hear abu ‘Abdallah (a.s.) say so? He made him to swear one or twice that he has heard so. Abu Basir then said, “However, I have heard it from abu Ja‘far (a.s.).”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:126",
  "kind": "verse_list"
}