{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 128"
        },
        "path": "/books/al-kafi:1:4:128",
        "titles": {
          "ar": "باب أَنَّ الْأَئِمَّةَ ( عليهم السلام ) كُلَّهُمْ قَائِمُونَ بِأَمْرِ اللَّهِ تَعَالَى هَادُونَ إِلَيْهِ",
          "en": "Chapter 128 – The Imams<sup>asws</sup>, all of them<sup>asws</sup> are establishing the Command of Allah<sup>azwj</sup> the Exalted, guiding to Him<sup>azwj</sup>"
        }
      }
    ],
    "index": 186,
    "local_index": 128,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 129"
        },
        "path": "/books/al-kafi:1:4:129",
        "titles": {
          "ar": "باب صِلَةِ الْإِمَامِ ( عليه السلام )",
          "en": "Chapter 129 – Helping the Imam<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 127"
        },
        "path": "/books/al-kafi:1:4:127",
        "titles": {
          "ar": "باب فِي أَنَّهُ إِذَا قِيلَ فِي الرَّجُلِ شَيْ‏ءٌ فَلَمْ يَكُنْ فِيهِ وَ كَانَ فِي وَلَدِهِ أَوْ وَلَدِ وَلَدِهِ فَإِنَّهُ هُوَ الَّذِي قِيلَ فِيهِ",
          "en": "Chapter 127 – Regarding that when something is said regarding the man and does not happen to be in him, and it happens to be in his son, or a son of his son, so it is that which was said regarding him"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:128",
    "titles": {
      "ar": "باب أَنَّ الْأَئِمَّةَ ( عليهم السلام ) كُلَّهُمْ قَائِمُونَ بِأَمْرِ اللَّهِ تَعَالَى هَادُونَ إِلَيْهِ",
      "en": "Chapter 128 – The Imams<sup>asws</sup>, all of them<sup>asws</sup> are establishing the Command of Allah<sup>azwj</sup> the Exalted, guiding to Him<sup>azwj</sup>"
    },
    "verse_count": 3,
    "verse_start_index": 1403,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (239/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1404,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1532",
              "text": "زَيْدٍ أَبِي الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1533",
              "text": "الْحَكَمِ بْنِ أَبِي نُعَيْمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ زَيْدٍ أَبِي الْحَسَنِ عَنِ الْحَكَمِ بْنِ أَبِي نُعَيْمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:128:1",
        "text": [
          " أَتَيْتُ أَبَا جَعْفَرٍ ( عليه السلام ) وَ هُوَ بِالْمَدِينَةِ فَقُلْتُ لَهُ عَلَيَّ نَذْرٌ بَيْنَ الرُّكْنِ وَ الْمَقَامِ إِنْ أَنَا لَقِيتُكَ أَنْ لَا أَخْرُجَ مِنَ الْمَدِينَةِ حَتَّى أَعْلَمَ أَنَّكَ قَائِمُ آلِ مُحَمَّدٍ أَمْ لَا فَلَمْ يُجِبْنِي بِشَيْ‏ءٍ ",
          "فَأَقَمْتُ ثَلَاثِينَ يَوْماً ثُمَّ اسْتَقْبَلَنِي فِي طَرِيقٍ فَقَالَ يَا حَكَمُ وَ إِنَّكَ لَهَاهُنَا بَعْدُ فَقُلْتُ نَعَمْ إِنِّي أَخْبَرْتُكَ بِمَا جَعَلْتُ لِلَّهِ عَلَيَّ فَلَمْ تَأْمُرْنِي وَ لَمْ تَنْهَنِي عَنْ شَيْ‏ءٍ وَ لَمْ تُجِبْنِي بِشَيْ‏ءٍ فَقَالَ بَكِّرْ عَلَيَّ غُدْوَةً الْمَنْزِلَ فَغَدَوْتُ عَلَيْهِ فَقَالَ ( عليه السلام ) سَلْ عَنْ حَاجَتِكَ",
          "فَقُلْتُ إِنِّي جَعَلْتُ لِلَّهِ عَلَيَّ نَذْراً وَ صِيَاماً وَ صَدَقَةً بَيْنَ الرُّكْنِ وَ الْمَقَامِ إِنْ أَنَا لَقِيتُكَ أَنْ لَا أَخْرُجَ مِنَ الْمَدِينَةِ حَتَّى أَعْلَمَ أَنَّكَ قَائِمُ آلِ مُحَمَّدٍ أَمْ لَا فَإِنْ كُنْتَ أَنْتَ رَابَطْتُكَ وَ إِنْ لَمْ تَكُنْ أَنْتَ سِرْتُ فِي الْأَرْضِ فَطَلَبْتُ الْمَعَاشَ",
          "فَقَالَ يَا حَكَمُ كُلُّنَا قَائِمٌ بِأَمْرِ اللَّهِ قُلْتُ فَأَنْتَ الْمَهْدِيُّ قَالَ كُلُّنَا نَهْدِي إِلَى اللَّهِ قُلْتُ فَأَنْتَ صَاحِبُ السَّيْفِ قَالَ كُلُّنَا صَاحِبُ السَّيْفِ وَ وَارِثُ السَّيْفِ قُلْتُ فَأَنْتَ الَّذِي تَقْتُلُ أَعْدَاءَ اللَّهِ وَ يَعِزُّ بِكَ أَوْلِيَاءُ اللَّهِ وَ يَظْهَرُ بِكَ دِينُ اللَّهِ ",
          "فَقَالَ يَا حَكَمُ كَيْفَ أَكُونُ أَنَا وَ قَدْ بَلَغْتُ خَمْساً وَ أَرْبَعِينَ سَنَةً وَ إِنَّ صَاحِبَ هَذَا الْأَمْرِ أَقْرَبُ عَهْداً بِاللَّبَنِ مِنِّي وَ أَخَفُّ عَلَى ظَهْرِ الدَّابَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Zayd Abu Al Hassan, from Al Hakam Bin Abu Nuaym who said, ",
            "‘I went over to Abu Ja’far<sup>asws</sup> and he<sup>asws</sup> was in Al-Medina, and I said to him<sup>asws</sup>, ‘Upon me there is a vow between <span class=\"iTxt\">Al-Rukn</span> (a corner of the Kaaba) and <span class=\"iTxt\">Al-Maqam</span> (of Ibrahim<sup>as</sup>) that if I were to meet you<sup>asws</sup>, I will not exit from Al-Medina until I know (for certain) whether you<sup>asws</sup> are the Qaim<sup>asws</sup> of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> or not’. But, he<sup>asws</sup> did not answer me with anything.",
            "So I stayed for thirty days, then he<sup>asws</sup> met me in a street and he<sup>asws</sup> said: ‘O Hakeym, and you are still over here?’ So I said, ‘Yes. I did inform you<sup>asws</sup> with what I had Made for (the Sake of) Allah<sup>azwj</sup> upon me, but you<sup>asws</sup> did not instruct me nor did you<sup>asws</sup> forbid me about anything, and you<sup>asws</sup> did not answer me with anything’. He<sup>asws</sup> said: ‘Come tomorrow early in the morning to the house’. So I went the next morning to him<sup>asws</sup>, and he<sup>asws</sup> said to me: ‘Ask your need’. ",
            "So I said, ‘I made it (for the Sake of) Allah<sup>azwj</sup>, a vow upon me and some Fasts and charity between <span class=\"iTxt\">Al-Rukn</span> and <span class=\"iTxt\">Al-Maqam</span> that if I were to meet you<sup>asws</sup>, I will not exit from Al-Medina until I know (for certain) whether you<sup>asws</sup> are Qaim<sup>asws</sup> of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> or not. Therefore, if you<sup>asws</sup> were as such, I shall maintain links with you<sup>asws</sup>, and if you<sup>asws</sup> do not happen to be, I shall travel in the land and seek the livelihood’. ",
            "So he<sup>asws</sup> said: ‘O Hakam! All of us (Imams<sup>asws</sup>) are Qaim (Standing) with the Command of Allah<sup>azwj</sup>’. I said, ‘So are you<sup>asws</sup> Al-Mahdi<sup>asws</sup> (the Guiding one)?’ He<sup>asws</sup> said: ‘All of us<sup>asws</sup> Guide to Allah<sup>azwj</sup>’. I said, ‘So are you<sup>asws</sup> the owner of the sword?’ He<sup>asws</sup> said: ‘All of us (Imams<sup>asws</sup>) are owners of the sword and the inheritors of the sword’. I said, ‘So are you<sup>asws</sup> the one who will be killing the enemies of Allah<sup>azwj</sup> and the friends of Allah<sup>azwj</sup> would be strengthen with you<sup>asws</sup> and the Religion of Allah<sup>azwj</sup> would overcome (all the other religions)?’ ",
            "He<sup>asws</sup> said: ‘O Hakam! How can I<sup>asws</sup> happen to be (him<sup>asws</sup>), and I<sup>asws</sup> have already reached fifty-four years of age, and the Master<sup>asws</sup> of this Command would be closer to the ere of the milk (younger) than me<sup>asws</sup>, and lighter upon the back of the animal’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Zayd ibn abu al-Hassan from al-Hakam ibn abu Nu‘aym’ who has said the following. “I went to see abu Ja‘far (a.s.) when he was in the city of al-Madina and I said to him, “I decided to make a vow and a covenant, while I was between the corner of the Ka‘ba and the place where Abraham had prayed, that when I would meet you I would not leave al-Madina until I would know with certainty that you are Al-Qa’im (the one who will rise with Divine Authority). The Imam (a.s.) did not say anything. I then stayed in the city of al-Madina for thirty days. One day he came face to face on a road. He said, “O al-Hakam, are you still here?” I said, “Yes, I am still here. I had explained to you about my vow and commitment and you did not command me anything or prohibited from anything nor did you answer me with anything.” The Imam (a.s.) then said, “Early tomorrow come to my house.” Next morning I went to see him and he said to me, “Ask what you need.” I said, “I have a commitment of vow, of fasting and paying charity. I had decided to fulfill it, while I was between the corner of the Ka‘ba and the station of Abraham. Its object was that when I would meet you I would not leave until I would know with certainty that you are Al-Qa’im (the one who will rise with Divine Authority) or not. If you would be him I would then maintain relations with you, otherwise, I would go in the land to find how to make a living.” The Imam (a.s.) said, “O Hakam, we all are Al-Qa’im (the one who will rise with Divine Authority) for the commands of Allah.” I then said, “Are you al-Mahdi?” He said, “We all guide to Allah.” I said, “Are you the owner of the sword?” He said, “We all are owners of the sword the heir of the sword.” I said, “Are the one who would do away with enemies of Allah, through whom honor will come to the friends of Allah and with whom the religion of Allah would stand supreme?” The Imam (a.s.) said, “O Hakam how could I be him. I have already become forty five years old while the master of this task would be much younger than me and much light for saddle of the horse.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/242)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1405,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:128:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنْ أَبِي خَدِيجَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنِ الْقَائِمِ فَقَالَ كُلُّنَا قَائِمٌ بِأَمْرِ اللَّهِ وَاحِدٌ بَعْدَ وَاحِدٍ حَتَّى يَجِي‏ءَ صَاحِبُ السَّيْفِ فَإِذَا جَاءَ صَاحِبُ السَّيْفِ جَاءَ بِأَمْرٍ غَيْرِ الَّذِي كَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Al Washha, from Ahmad Bin Aiz, from Abu Khadeeja, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that he<sup>asws</sup> was asked about Al-Qaim<sup>asws</sup>, so he<sup>asws</sup> said: ‘All of us<sup>asws</sup> are Qaim (standing) with the Command of Allah<sup>azwj</sup>, one after one, until there would come the Owner of the sword. So when the owner of the sword comes, he<sup>asws</sup> would come with a matter other than which was’."
          ],
          "en.sarwar": [
            " 2. Al-Husayn ibn Muhammad al-Ash‘ari has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from Ahmad ibn ‘A’idh from abu Khadija from abu ‘Abdallah who has said the following. “He said, when he was asked about Al-Qa’im, “We all Al-Qa’im ((the one who will rise with Divine Authority) with the command of Allah one after the other until the time when the owner of the sword will rise. When the owner of the sword will rise he will rise with the command other than what it was.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (242/ 6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1406,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/659",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/611",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/823",
              "text": "عَبْدِ اللَّهِ بْنِ الْقَاسِمِ الْبَطَلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ الْبَطَلِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:128:3",
        "relations": {
          "Mentions": [
            "/books/quran:17:71"
          ]
        },
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَوْمَ نَدْعُوا كُلَّ أُناسٍ بِإِمامِهِمْ قَالَ إِمَامِهِمُ الَّذِي بَيْنَ أَظْهُرِهِمْ وَ هُوَ قَائِمُ أَهْلِ زَمَانِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Abdullah Bin Al Qasim Al Batal, from Abdullah Bin Sinan who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:17#h71\">[17:71]</a> The Day when We will Call every human being with their Imam</span>’. He<sup>asws</sup> said: ‘Their Imam<sup>asws</sup> would be that who will be in appearance before them, and he<sup>asws</sup> is Al-Qaim<sup>asws</sup> of the people of his<sup>asws</sup> era’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan ibn Shammun from ‘Abdallah ibn ‘Abd al-Rahman from ‘Abdallah ibn al-Qasim al-Batal from ‘Abdallah ibn Sinan who has said the following. “I asked abu ‘Abdallah (a.s.) about the meaning of , ‘On the day when We will call every nation with her Imam (leader) . .” <a href=\"/#/books/quran:17#h71\">[17:71]</a> The Imam (a.s.) said, “It refers to the Imam who is with them and he is al-Qa’im of the people of that time.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:128",
  "kind": "verse_list"
}