{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:1:4:13",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) نُورُ اللَّهِ عَزَّ وَ جَلَّ",
          "en": "Chapter 13  The Imams<sup>asws</sup> are the Light (نُورُ ) of Allah<sup>azwj</sup> Mighty and Majestic"
        }
      }
    ],
    "index": 71,
    "local_index": 13,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:1:4:14",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ هُمْ أَرْكَانُ الْأَرْضِ",
          "en": "Chapter 14 – The Imams<sup>asws</sup>, they<sup>asws</sup> are the Stabiliers of the earth"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:1:4:12",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) خُلَفَاءُ اللَّهِ عَزَّ وَ جَلَّ فِي أَرْضِهِ وَ أَبْوَابُهُ الَّتِي مِنْهَا يُؤْتَى",
          "en": "Chapter 12 – The Imams<sup>asws</sup> are the Caliphs of Allah<sup>azwj</sup> Mighty and Majestic in His<sup>azwj</sup> earth and His<sup>azwj</sup> Doors from which He<sup>azwj</sup> is accessed"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:13",
    "titles": {
      "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) نُورُ اللَّهِ عَزَّ وَ جَلَّ",
      "en": "Chapter 13  The Imams<sup>asws</sup> are the Light (نُورُ ) of Allah<sup>azwj</sup> Mighty and Majestic"
    },
    "verse_count": 6,
    "verse_start_index": 512,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (352/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 513,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:13:1",
        "refs": {
          "Mentions": [
            "/books/quran:7:157",
            "/books/quran:64:8"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مِرْدَاسٍ قَالَ حَدَّثَنَا صَفْوَانُ بْنُ يَحْيَى وَ الْحَسَنُ بْنُ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي خَالِدٍ الْكَابُلِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَآمِنُوا بِاللَّهِ وَ رَسُولِهِ وَ النُّورِ الَّذِي أَنْزَلْنا فَقَالَ يَا أَبَا خَالِدٍ النُّورُ وَ اللَّهِ الْأَئِمَّةُ مِنْ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) إِلَى يَوْمِ الْقِيَامَةِ وَ هُمْ وَ اللَّهِ نُورُ اللَّهِ الَّذِي أَنْزَلَ وَ هُمْ وَ اللَّهِ نُورُ اللَّهِ فِي السَّمَاوَاتِ وَ فِي الْأَرْضِ وَ اللَّهِ ",
          "يَا أَبَا خَالِدٍ لَنُورُ الْإِمَامِ فِي قُلُوبِ الْمُؤْمِنِينَ أَنْوَرُ مِنَ الشَّمْسِ الْمُضِيئَةِ بِالنَّهَارِ وَ هُمْ وَ اللَّهِ يُنَوِّرُونَ قُلُوبَ الْمُؤْمِنِينَ وَ يَحْجُبُ اللَّهُ عَزَّ وَ جَلَّ نُورَهُمْ عَمَّنْ يَشَاءُ فَتُظْلَمُ قُلُوبُهُمْ ",
          "وَ اللَّهِ يَا أَبَا خَالِدٍ لَا يُحِبُّنَا عَبْدٌ وَ يَتَوَلَّانَا حَتَّى يُطَهِّرَ اللَّهُ قَلْبَهُ وَ لَا يُطَهِّرُ اللَّهُ قَلْبَ عَبْدٍ حَتَّى يُسَلِّمَ لَنَا وَ يَكُونَ سِلْماً لَنَا فَإِذَا كَانَ سِلْماً لَنَا سَلَّمَهُ اللَّهُ مِنْ شَدِيدِ الْحِسَابِ وَ آمَنَهُ مِنْ فَزَعِ يَوْمِ الْقِيَامَةِ الْأَكْبَرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Mirdas who said, ‘Safwan Bin Yahya and Al Hassan Bin Mahboub narrated to us, from Abu Ayoub, from Abu Khalid Al Kabuly who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:64#h8\">[64:8]</a> Therefore believe in Allah and His Rasool and the Light which We have Sent down</span>. So he<sup>asws</sup> said: ‘O Abu Khalid! The Light (النُّور), by Allah<sup>azwj</sup>, are the Imams<sup>asws</sup> from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> up to the Day of Judgment, and they<sup>asws</sup>, by Allah<sup>azwj</sup>, are the Light (النُّور) of Allah<sup>azwj</sup> which descended, and they<sup>asws</sup>, by Allah<sup>azwj</sup>, are the Light (النُّور) of Allah<sup>azwj</sup> in the skies and in the earth, by Allah<sup>azwj</sup>!’. ",
            "O Abu Khalid! The Light (النُّور) of the Imam<sup>asws</sup> in the hearts of the Momineen is more radiant than the bright sun by the day. By Allah<sup>azwj</sup>! They<sup>asws</sup> are radiating the hearts of the Momineen and He<sup>azwj</sup> Allah<sup>azwj</sup> Mighty and Majestic Blocks their<sup>asws</sup> Light (النُّور) from the ones He<sup>azwj</sup> so Desires to, so it darkens their hearts.",
            "By Allah<sup>azwj</sup>, O Abu Khalid! No servant would respond to us<sup>asws</sup> and be in our<sup>asws</sup> Wilayah until Allah<sup>azwj</sup> Cleans his heart, and Allah<sup>azwj</sup> does not Clean a heart of a servant until he submits to us<sup>asws</sup> and becomes submissive to us<sup>asws</sup>. So when he was submissive to us<sup>asws</sup>. Allah<sup>azwj</sup> would Secure him from the difficulties of the Reckoning, and Secure him from the great horrors of the Day of Judgment’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ali ibn Mirdas who has said that Saffron ibn Yahya and al-Hassan ibn Mahbub have narrated from abu Ayyub from abu Khalid al-Kabuli who has said that he asked Imam abu Ja‘far (a.s.) about the meaning of the words of Allah e following. “Those who believe in him, honor and help him, and follow the light which is sent down to him, will have everlasting happiness.” <a href=\"/#/books/quran:7#h157\">[7:157]</a> The Imams (a.s.) said, “O abu Khalid, I swear by Allah that it is the Imams from the family of the Holy Prophet (s.a.) up to the Day of judgment who are called light in the above verse. They, I swear by Allah, are the light of Allah whom He sent down. It is they, I swear by Allah, who are the light of Allah in the heavens and in the earth. O abu Khalid, I swear by Allah, that the light of the Imams (a.s.) in the hearts of the true believers is more bright than the light of the sun in the midday. They, I swear by Allah, give light to the hearts of the true believers and Allah, the Most Holy, the Most High, may block such light from reaching the hearts of whoever He may will, thus their hearts remain dark. O abu Khalid, no one would believe in our Divine authority except that Allah will cleanse his heart. Allah will not cleanse the heart of a person until he or she will acknowledge our Divine authority and live in peace with us. When one lives in peace with us Allah will safe guard him against the severity of the day of recockning and grant him security against the great terror on the Day of Judgment”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/354)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 514,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:13:2",
        "refs": {
          "Mentions": [
            "/books/quran:7:157"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ بِإِسْنَادِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ تَعَالَى الَّذِينَ يَتَّبِعُونَ الرَّسُولَ النَّبِيَّ الْأُمِّيَّ الَّذِي يَجِدُونَهُ مَكْتُوباً عِنْدَهُمْ فِي التَّوْراةِ وَ الْإِنْجِيلِ يَأْمُرُهُمْ بِالْمَعْرُوفِ وَ يَنْهاهُمْ عَنِ الْمُنْكَرِ وَ يُحِلُّ لَهُمُ الطَّيِّباتِ وَ يُحَرِّمُ عَلَيْهِمُ الْخَبائِثَ إِلَى قَوْلِهِ وَ اتَّبَعُوا النُّورَ الَّذِي أُنْزِلَ مَعَهُ أُولئِكَ هُمُ الْمُفْلِحُونَ قَالَ النُّورُ فِي هَذَا الْمَوْضِعِ عَلِيٌّ أَمِيرُ الْمُؤْمِنِينَ وَ الْأَئِمَّةُ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, by his chain, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h157\">[7:157]</a> Those who follow the Rasool, the Prophet, the Ummi, whom they find written down with them in the Torah and the Evangel (who) enjoins them good and forbids them from the evil, and makes lawful to them the good things and makes unlawful to them bad things</span> up to His<sup>azwj</sup> Words <span class=\"ibTxt\">and follow the Light which has been Sent down with him, these are the successful ones</span><span class=\"iTxt\">’.</span> He<sup>asws</sup> said: ‘The Light (النُّور) (Mentioned) in this place, is Ali Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Ibrahim has narrated through his chain of narrators from abu ‘Abdallah (a.s.) about the words of Allah that say, There are those who follow the Messengers, the illiterate Prophet (not conventionally educated), whose description they find written in the Torah and the Gospel. [He (the Messengers) enjoins them to do good and forbids them to do all that is unlawful, makes lawful for them all that is pure and unlawful all that is filthy, removes their burdens and the entanglements in which they are involved]. Those who believe in him, honor and help him, and follow the light which is sent down to him, will have everlasting happiness.” <a href=\"/#/books/quran:7#h157\">[7:157]</a> The Imams (a.s.) said, “It is Amir al-Mu’minin Ali (a.s.) and the Imams (a.s.) after him who are called ‘light’ in the above verse of the Holy Quran.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (356/ 2)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (28/ 1)"
        ],
        "index": 515,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:13:3",
        "refs": {
          "Mentions": [
            "/books/quran:28:52",
            "/books/quran:57:28",
            "/books/quran:28:51",
            "/books/quran:28:53",
            "/books/quran:28:54"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ أَبِي الْجَارُودِ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) لَقَدْ آتَى اللَّهُ أَهْلَ الْكِتَابِ خَيْراً كَثِيراً قَالَ وَ مَا ذَاكَ قُلْتُ قَوْلُ اللَّهِ تَعَالَى الَّذِينَ آتَيْناهُمُ الْكِتابَ مِنْ قَبْلِهِ هُمْ بِهِ يُؤْمِنُونَ إِلَى قَوْلِهِ أُولئِكَ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ بِما صَبَرُوا قَالَ فَقَالَ قَدْ آتَاكُمُ اللَّهُ كَمَا آتَاهُمْ ثُمَّ تَلَا يا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَ آمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ وَ يَجْعَلْ لَكُمْ نُوراً تَمْشُونَ بِهِ يَعْنِي إِمَاماً تَأْتَمُّونَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from Sa’alba Bin Maymoun, from Abu Al Jaroud who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘Allah<sup>azwj</sup> has Given the People of the Book, a lot of good’. He<sup>asws</sup> said: ‘And what is that?’ I said, ‘The Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:28#h52\">[28:52]</a> The ones to whom We Gave the Book before it, they are believers in it</span> - up to His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:28#h54\">[28:54]</a> These shall be Granted their reward twice, because they were patient</span>’. He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> has Given you all just as He<sup>azwj</sup> has Given them’. Then he<sup>asws</sup> recited <span class=\"ibTxt\"><a href=\"/#/books/quran:57#h28\">[57:28]</a> O you who believe! Fear Allah and believe in His Rasool: He will give you two portions of His Mercy, and Make for you a Light with which you will walk by </span>– Meaning an Imam<sup>asws</sup> you are following with’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn Fudala from Tha‘laba ibn Maymun from abu al-Jarud who has said that he said the following to Imam abu Ja‘far (a.s.). “Allah has given a great deal of good to the people of the heavenly books.” The Imam (a.s.) then asked, “What is it?” I then said it said in Holy Quran, “We sent Our guidance to them so that perhaps they might take heed. <a href=\"/#/books/quran:28#h51\">[28:51]</a> (Some of) the followers of the Bible believe in the Quran <a href=\"/#/books/quran:28#h52\">[28:52]</a>. When it is recited to them, they say, “We believe in it. It is the Truth from our Lord. We were Muslims before it was revealed” <a href=\"/#/books/quran:28#h53\">[28:53]</a>. These will receive double reward for their forbearance, replacing evil by virtue, and for their spending for the cause of God.” <a href=\"/#/books/quran:28#h54\">[28:54]</a> The Imam (a.s.) said, “Allah has given you also a great deal of good as He has given to them and he recited, ‘Believers, have fear of God and believe in His Messenger. God will grant you a double share of mercy, a light by which you can walk, and forgive your sins. God is All-forgiving and All-merciful.’ <a href=\"/#/books/quran:57#h28\">[57:28]</a> The light mentioned in this verse mean the Imam (a.s.) who you follow.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (357/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 516,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:13:4",
        "refs": {
          "Mentions": [
            "/books/quran:7:157",
            "/books/quran:64:8"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ الْحَسَنِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ وَ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي خَالِدٍ الْكَابُلِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ تَعَالَى فَآمِنُوا بِاللَّهِ وَ رَسُولِهِ وَ النُّورِ الَّذِي أَنْزَلْنا فَقَالَ يَا أَبَا خَالِدٍ النُّورُ وَ اللَّهِ الْأَئِمَّةُ ( عليهم السلام ) يَا أَبَا خَالِدٍ لَنُورُ الْإِمَامِ فِي قُلُوبِ الْمُؤْمِنِينَ أَنْوَرُ مِنَ الشَّمْسِ الْمُضِيئَةِ بِالنَّهَارِ وَ هُمُ الَّذِينَ يُنَوِّرُونَ قُلُوبَ الْمُؤْمِنِينَ وَ يَحْجُبُ اللَّهُ نُورَهُمْ عَمَّنْ يَشَاءُ فَتُظْلَمُ قُلُوبُهُمْ وَ يَغْشَاهُمْ بِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Abdul Azeem Bin Abdullah Al Hasanna, from Ali Bin Asbat, and Al Hassan Bin Mahboub, from Abu Ayoub, from Abu Khalid Al Kabuly who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:64#h8\">[64:8]</a> Therefore believe in Allah and His Rasool and the Light which We have Sent down</span>. So he<sup>asws</sup> said: ‘O Abu Khalid! The Light (النُّور), by Allah<sup>azwj</sup>, are the Imams<sup>asws</sup>. O Abu Khalid! The Light (النُّور) of the Imam<sup>asws</sup> in the hearts of the <span class=\"iTxt\">Momineen</span> is more radiant than the bright sun by the day, and they<sup>asws</sup> are those who are radiating the hearts of the <span class=\"iTxt\">Momineen</span>, and Allah<sup>azwj</sup> Blocks their<sup>asws</sup> Light from the ones who He<sup>azwj</sup> so Desires to, to darken their hearts and they are covered by it’."
          ],
          "en.sarwar": [
            " 4. Ahmad ibn Mahran has narrated from ‘Abd al-‘Azim ibn ‘Abdallah al-Hassani from Ali ibn Asbat and al-Hassan ibn Mahbub from abu Ayyub from abu Khalid al-kabuli who has said that he asked Imam abu ‘Abdallah (a.s.) about the meaning of the words of Allah, the Most Holy, the Most High, in the following verse of the Holy Quran. “Those who believe in him, honor and help him, and follow the light which is sent down to him, will have everlasting happiness.” <a href=\"/#/books/quran:7#h157\">[7:157]</a> The Imams (a.s.) said, “O abu Khalid, the light in this verse, I swear by Allah, means the Imams. O abu Khalid the light of the Imam (a.s.) in the hearts of the true believers is more bright than the light of the sun in midday. It is they who brighten the hearts of the true believers and Allah withholds their light from reaching whomever He would will, thus, their hearts become dark and Allah covers them with the darknesss.”"
          ]
        }
      },
      {
        "index": 517,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:13:5",
        "refs": {
          "Mentions": [
            "/books/quran:24:35",
            "/books/quran:24:40",
            "/books/quran:57:12"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ صَالِحِ بْنِ سَهْلٍ الْهَمْدَانِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ تَعَالَى اللَّهُ نُورُ السَّماواتِ وَ الْأَرْضِ مَثَلُ نُورِهِ كَمِشْكاةٍ فَاطِمَةُ ( عليها السلام ) فِيها مِصْباحٌ الْحَسَنُ الْمِصْباحُ فِي زُجاجَةٍ الْحُسَيْنُ الزُّجاجَةُ كَأَنَّها كَوْكَبٌ دُرِّيٌّ فَاطِمَةُ كَوْكَبٌ دُرِّيٌّ بَيْنَ نِسَاءِ أَهْلِ الدُّنْيَا يُوقَدُ مِنْ شَجَرَةٍ مُبارَكَةٍ إِبْرَاهِيمُ ( عليه السلام ) زَيْتُونَةٍ لا شَرْقِيَّةٍ وَ لا غَرْبِيَّةٍ لَا يَهُودِيَّةٍ وَ لَا نَصْرَانِيَّةٍ يَكادُ زَيْتُها يُضِي‏ءُ يَكَادُ الْعِلْمُ يَنْفَجِرُ بِهَا وَ لَوْ لَمْ تَمْسَسْهُ نارٌ نُورٌ عَلى نُورٍ إِمَامٌ مِنْهَا بَعْدَ إِمَامٍ يَهْدِي اللَّهُ لِنُورِهِ مَنْ يَشاءُ يَهْدِي اللَّهُ لِلْأَئِمَّةِ مَنْ يَشَاءُ وَ يَضْرِبُ اللَّهُ الْأَمْثالَ لِلنَّاسِ ",
          "قُلْتُ أَوْ كَظُلُماتٍ قَالَ الْأَوَّلُ وَ صَاحِبُهُ يَغْشاهُ مَوْجٌ الثَّالِثُ مِنْ فَوْقِهِ مَوْجٌ ظُلُمَاتٌ الثَّانِي بَعْضُها فَوْقَ بَعْضٍ مُعَاوِيَةُ وَ فِتَنُ بَنِي أُمَيَّةَ إِذا أَخْرَجَ يَدَهُ الْمُؤْمِنُ فِي ظُلْمَةِ فِتْنَتِهِمْ لَمْ يَكَدْ يَراها وَ مَنْ لَمْ يَجْعَلِ اللَّهُ لَهُ نُوراً إِمَاماً مِنْ وُلْدِ فَاطِمَةَ ( عليها السلام ) فَما لَهُ مِنْ نُورٍ إِمَامٍ يَوْمَ الْقِيَامَةِ ",
          "وَ قَالَ فِي قَوْلِهِ يَسْعى نُورُهُمْ بَيْنَ أَيْدِيهِمْ وَ بِأَيْمانِهِمْ أَئِمَّةُ الْمُؤْمِنِينَ يَوْمَ الْقِيَامَةِ تَسْعَى بَيْنَ يَدَيِ الْمُؤْمِنِينَ وَ بِأَيْمَانِهِمْ حَتَّى يُنْزِلُوهُمْ مَنَازِلَ أَهْلِ الْجَنَّةِ .",
          "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُوسَى بْنِ الْقَاسِمِ الْبَجَلِيِّ وَ مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ جَمِيعاً عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ مُوسَى ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman Al Asammi, from Abdullah Bin Al Qasim, from Salih Bin Sahl Al Hamdany who said, ",
            "‘Abu Abdullah<sup>asws</sup> said regarding the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h35\">[24:35]</a> Allah is Light of the skies and the earth</span>, <span class=\"ibTxt\">a likeness of His Light is as a niche </span>(which is Syeda) <span style=\"text-decoration: underline\">Fatima</span><sup>asws</sup>, <span class=\"ibTxt\">in which is a lamp </span><span style=\"text-decoration: underline\">Al-Hassan</span><sup>asws</sup>,<span class=\"ibTxt\"> the lamp is enclosed in a glass</span>, <span style=\"text-decoration: underline\">Al-Husayn</span><sup>asws</sup>,<span class=\"ibTxt\"> (and) the glass is as if it were a brightly shining star </span><span style=\"text-decoration: underline\">Fatima</span><sup>asws</sup> is the brightly shining star between the women of the world,<span class=\"ibTxt\"> lit from a blessed olive-tree </span>of Ibrahim<sup>as</sup><span class=\"ibTxt\"> neither eastern nor western </span>neither Jewish nor Christian<span class=\"ibTxt\"> the oil of which is almost luminous</span> illumination of the knowledge which almost explodes from her<sup>asws</sup> <span class=\"ibTxt\"> although fire does not touch it - Light upon Light –</span> and Imam<sup>asws</sup> after an Imam<sup>asws</sup><span class=\"ibTxt\"> Allah Guides to His Light whomsoever He Desires to </span><span style=\"text-decoration: underline\">Allah</span><sup style=\"text-decoration: underline\">azwj</sup><span style=\"text-decoration: underline\"> Guides to the Imam</span><sup>asws</sup> whomsoever He<sup>azwj</sup> so Desires to<span class=\"ibTxt\"> and Allah Strikes Examples for the people</span>’.",
            "I said, ‘(What about) <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h40\">[24:40]</a> Or like utter darkness</span>?’ He<sup>asws</sup> said: ‘<span style=\"text-decoration: underline\">The first one (Abu Bakr) and his companion (Umar) </span><span class=\"ibTxt\">there covers it a wave</span> of <span style=\"text-decoration: underline\">the third one (Usman)</span><span class=\"ibTxt\"> above which is another wave, above which is a cloud, (layers of) utter darkness </span>of <span style=\"text-decoration: underline\">the second one (Umar) </span><span class=\"ibTxt\">one above another </span><span style=\"text-decoration: underline\">Muawiya and the strife of the Clan of Umayya</span><span class=\"ibTxt\"> when he holds out his hand </span>the Believer, in the darkness of their strife<span class=\"ibTxt\"> he is almost unable to see it; and to whomsoever Allah does not Give Light </span>of <span style=\"text-decoration: underline\">the Imams</span><sup style=\"text-decoration: underline\">asws</sup><span style=\"text-decoration: underline\"> from the sons</span><sup style=\"text-decoration: underline\">asws</sup><span style=\"text-decoration: underline\"> of Syeda Fatima</span><sup>asws</sup><span class=\"ibTxt\"> so he has no Light </span>for himself on the Day of Judgement’.",
            "And he<sup style=\"font-weight: normal\">asws</sup> said regarding His<sup style=\"font-weight: normal\">azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:57#h12\">[57:12]</a> their light would be running before them and on their right hand</span>: ‘The Imams<sup style=\"font-weight: normal\">asws</sup> of the Momineen, one the Day of Judgment, would be running in front of the Momineen, and one their right until they lodge them in the houses of the inhabitants of the Paradise’.",
            "Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, fromMusa Bin Al Qasim Al Bajaly and Muhammad Bin Yahya, from Al Amraky Bin Ali, altogether, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Musa<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            " 5. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan ibn sham?? From ‘Abdallah ibn ‘Abd al-Rahmanal-Asamm from ‘Abdallah ibn al-Qasim from salih ibn Sahl al-Hamadani who has said that abu ‘Abdallah (a.s.) has said the following about the verse of the Holy Quran below. “God is the light of the heavens and the earth. A metaphor for His light is a lantern in which there is a lamp placed in a glass. The glass is like a shining star which is lit from a blessed olive tree that is neither eastern nor western. Its oil almost lights up even though it has not been touched by the fire. It is light upon light. God guides to His light whomever He wants. God uses various metaphors. He has the knowledge of all things.” <a href=\"/#/books/quran:24#h35\">[24:35]</a> The Imam (a.s.) said that the lantern metaphorically stands for the Holy lady, Fatima (a.s.), the lamp stands for Imam al-Hassan (a.s.) and the glass stands for Imam al-Husayn (a.s.). The shining star stands for the Holy lady Fatima (a.s.) who shines among the ladies of the world. The blessed olive tree stands for Prophet Abraham. Neither eastern nor western means not Jewish nor Christian. ‘Its oil almost lights up’ means that it almost bursts up with knowledge. ‘Light up on light’ means that there will one Imam after the other Imam (a.s.) ‘God guides to His light who ever He wants’ means that Allah guides through the Imams whomever He wants.” About ‘God uses various metaphors’ I said, “Or it (the deeds of the unbelievers) are like the darkness of a deep, stormy sea with layers of giant waves, covered by dark clouds. It is darkness upon darkness whereby even if one stretches out his hands he can not see them. One can have no light unless God gives him light. <a href=\"/#/books/quran:24#h40\">[24:40]</a> The Imam (a.s.) said, “ ‘darkness’ refers to the first and his friend, ‘with layers of giant waves’ refers to the third, ‘covered with darkness’ refers to the second. ‘it is darkness up on darkness’ refers to Mu‘awiya and the disasters caused by the Amavides. ‘even if one stretches out his hands’ means that even if a true believer would stretch his hands in such disastrous condition ‘he can not see them’. ‘One can have no light unless God gives him light, means the light from the children of the Holy Lady, Fatima (a.s.) ‘Can have no light’ means an Imam on the Day of Judgment.” The Imam (a.s.) said that, “On the Day of Judgment you will see the believers with their light shining in front of them and to their right. They will be told, “Paradise wherein streams flow is the glad news for you today. You will live therein forever. This is the greatest triumph.” <a href=\"/#/books/quran:57#h12\">[57:12]</a>, the shining light in front . .’ is a reference to the Imams (a.s.) whom would walk in front and on the right of the true believers until they all enter paradise.” Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from Musa ibn al-Qasim al-Bajali and Muhammad ibn yahya from al-‘Amrakiy ibn Ali altogether from Ali ibn Ja‘far (a.s.) from his brother a similar Hadith."
          ]
        }
      },
      {
        "index": 518,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:13:6",
        "refs": {
          "Mentions": [
            "/books/quran:7:157",
            "/books/quran:64:8",
            "/books/quran:61:8"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنِ الْحُسَيْنِ بْنِ عُبَيْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ وَ مُوسَى بْنِ عُمَرَ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى يُرِيدُونَ لِيُطْفِؤُا نُورَ اللَّهِ بِأَفْواهِهِمْ قَالَ يُرِيدُونَ لِيُطْفِئُوا وَلَايَةَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) بِأَفْوَاهِهِمْ ",
          "قُلْتُ قَوْلُهُ تَعَالَى وَ اللَّهُ مُتِمُّ نُورِهِ قَالَ يَقُولُ وَ اللَّهُ مُتِمُّ الْإِمَامَةِ وَ الْإِمَامَةُ هِيَ النُّورُ وَ ذَلِكَ قَوْلُهُ عَزَّ وَ جَلَّ فَآمِنُوا بِاللَّهِ وَ رَسُولِهِ وَ النُّورِ الَّذِي أَنْزَلْنا قَالَ النُّورُ هُوَ الْإِمَامُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Al Husayn Bin Ubeydullah, from Muhammad Bin Al Husayn and Musa Bin Umar, from Al Hassan Bin Mahboub, from Muhammad Bin Al Fuzayl, ",
            "(It has been narrated) from Abu Al Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\"><a href=\"/#/books/quran:61#h8\">[61:8]</a> They are intending to extinguish the Light of Allah with their mouths</span>. He<sup>asws</sup> said: ‘They are intending to extinguishing the Wilayah of Amir Al-Momineen<sup>asws</sup> by their mouths (by talking against it)’. ",
            "I said, ‘The Words of the Exalted <span class=\"ibTxt\">but Allah will Complete His light</span>’. He<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> will Complete the Imamate; and the Imamate, it is the Light (النُّور), and these are the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:64#h8\">[64:8]</a> Therefore believe in Allah and His Rasool and the Light which We have Sent down</span>’. He<sup>asws</sup> said: ‘The Light (النُّور), it is the Imam<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 7. Ahmad ibn Idris has narrated from al-husayn ibn ‘Ubadallah from Muhammad ibn al-Hassan and Musa ibn ‘umar from al-hassan ibn Mahbub from Muhammad ibn al-Fudayl who has said that he asked abu al-Hassan (a.s.) about the meaning of the words of Allah, the Most Holy, the Most High, in the following verse of the Holy Quran. “They want to put out the light of God with their mouths, but God will certainly make His light shine forever - even though the unbelievers may dislike this.” <a href=\"/#/books/quran:61#h8\">[61:8]</a> The Imam (a.s.) said, “They want to put out the divine authority of Amir al-Mu’minin (a.s.) with their mouths. ‘but Allah completes His light’ means the Imams (a.s.) as mentioned in, “Those who believe in him, honor and help him, and follow the light which is sent down to him, will have everlasting happiness.” <a href=\"/#/books/quran:7#h157\">[7:157]</a> The light stands for Imam (a.s.).”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:13",
  "kind": "verse_list"
}