{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:1:4:14",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ هُمْ أَرْكَانُ الْأَرْضِ",
          "en": "Chapter 14 – The Imams<sup>asws</sup>, they<sup>asws</sup> are the Stabiliers of the earth"
        }
      }
    ],
    "index": 72,
    "local_index": 14,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:14",
    "titles": {
      "ar": "بَابُ أَنَّ الْأَئِمَّةَ هُمْ أَرْكَانُ الْأَرْضِ",
      "en": "Chapter 14 – The Imams<sup>asws</sup>, they<sup>asws</sup> are the Stabiliers of the earth"
    },
    "verse_count": 3,
    "verse_start_index": 518,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف بسنديه على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (366/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 519,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:14:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ مِهْرَانَ</span> عَنْ مُحَمَّدِ بْنِ عَلِيٍّ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا جَاءَ بِهِ عَلِيٌّ ( عليه السلام ) آخُذُ بِهِ وَ مَا نَهَى عَنْهُ أَنْتَهِي عَنْهُ جَرَى لَهُ مِنَ الْفَضْلِ مِثْلُ مَا جَرَى لِمُحَمَّدٍ ( صلى الله عليه وآله ) وَ لِمُحَمَّدٍ ( صلى الله عليه وآله ) الْفَضْلُ عَلَى جَمِيعِ مَنْ خَلَقَ اللَّهُ عَزَّ وَ جَلَّ الْمُتَعَقِّبُ عَلَيْهِ فِي شَيْ‏ءٍ مِنْ أَحْكَامِهِ كَالْمُتَعَقِّبِ عَلَى اللَّهِ وَ عَلَى رَسُولِهِ وَ الرَّادُّ عَلَيْهِ فِي صَغِيرَةٍ أَوْ كَبِيرَةٍ عَلَى حَدِّ الشِّرْكِ بِاللَّهِ ",
          "كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بَابَ اللَّهِ الَّذِي لَا يُؤْتَى إِلَّا مِنْهُ وَ سَبِيلَهُ الَّذِي مَنْ سَلَكَ بِغَيْرِهِ هَلَكَ وَ كَذَلِكَ يَجْرِي الْأَئِمَّةُ الْهُدَى وَاحِداً بَعْدَ وَاحِدٍ جَعَلَهُمُ اللَّهُ أَرْكَانَ الْأَرْضِ أَنْ تَمِيدَ بِأَهْلِهَا وَ حُجَّتَهُ الْبَالِغَةَ عَلَى مَنْ فَوْقَ الْأَرْضِ وَ مَنْ تَحْتَ الثَّرَى",
          "وَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) كَثِيراً مَا يَقُولُ ",
          "أَنَا قَسِيمُ اللَّهِ بَيْنَ الْجَنَّةِ وَ النَّارِ وَ أَنَا الْفَارُوقُ الْأَكْبَرُ وَ أَنَا صَاحِبُ الْعَصَا وَ الْمِيسَمِ وَ لَقَدْ أَقَرَّتْ لِي جَمِيعُ الْمَلَائِكَةِ وَ الرُّوحُ وَ الرُّسُلُ بِمِثْلِ مَا أَقَرُّوا بِهِ لِمُحَمَّدٍ ( صلى الله عليه وآله ) وَ لَقَدْ حُمِلْتُ عَلَى مِثْلِ حَمُولَتِهِ وَ هِيَ حَمُولَةُ الرَّبِّ",
          "وَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يُدْعَى فَيُكْسَى وَ أُدْعَى فَأُكْسَى وَ يُسْتَنْطَقُ وَ أُسْتَنْطَقُ فَأَنْطِقُ عَلَى حَدِّ مَنْطِقِهِ وَ لَقَدْ أُعْطِيتُ خِصَالًا مَا سَبَقَنِي إِلَيْهَا أَحَدٌ قَبْلِي عُلِّمْتُ الْمَنَايَا وَ الْبَلَايَا وَ الْأَنْسَابَ وَ فَصْلَ الْخِطَابِ فَلَمْ يَفُتْنِي مَا سَبَقَنِي وَ لَمْ يَعْزُبْ عَنِّي مَا غَابَ عَنِّي أُبَشِّرُ بِإِذْنِ اللَّهِ وَ أُؤَدِّي عَنْهُ كُلُّ ذَلِكَ مِنَ اللَّهِ مَكَّنَنِي فِيهِ بِعِلْمِهِ .",
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ الْعَمِّيِّ عَنْ مُحَمَّدِ بْنِ سِنَانٍ قَالَ حَدَّثَنَا الْمُفَضَّلُ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ ثُمَّ ذَكَرَ الْحَدِيثَ الْأَوَّلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether, from Muhammad Bin Sinan, from Al Mufazzal Bin Umar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whatever Ali<sup>asws</sup> came with, take with it, and whatever he<sup>asws</sup> forbade from, refrain from it. It flows for him<sup>asws</sup> from the merits like what flowed for Muhammad<sup>azwj</sup>, and for Muhammad<sup>saww</sup> is the merit upon the entirety of the creatures of Allah<sup>azwj</sup> Mighty and Majestic. The pursuer upon him<sup>asws</sup> regarding something from his<sup>asws</sup> decisions is like the pursuer upon Allah<sup>azwj</sup> and upon His<sup>azwj</sup> Rasool<sup>saww</sup>, and the rejecter upon him<sup>asws</sup> regarding a small (matter) or a big (matter), would be within the limits of <span class=\"iTxt\">Shirk</span> (Association) with Allah<sup>azwj</sup>. ",
            "It was so that Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> was a Door of Allah<sup>azwj</sup> which one cannot approach except through him<sup>asws</sup>, and His<sup>azwj</sup> Way which, if one was to travel with other than it, he would perish; and similar to that, it flows for the Imams<sup>asws</sup> of the Guidance, the one after the other. Allah<sup>azwj</sup> Made them<sup>asws</sup> as the stabilisers of the earth, lest it shakes with its inhabitants, and His<sup>azwj</sup> eloquent Divine Authorities upon the ones above the earth and the ones beneath the soil. ",
            "And Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> was frequently saying, ",
            "‘I<sup>asws</sup> am the ‘Allah<sup>azwj</sup>’s Distributor’ between the Paradise and the Fire, and I<sup>asws</sup> am the Great Differentiator, and I<sup>asws</sup> am the owner of the Staff and the Branding Iron. And they have acknowledged to me<sup>asws</sup>, the entirety of the Angels and the Spirit, and the Rasools<sup>as</sup>, with similar to what they acknowledged to Muhammad<sup>saww</sup> with, and I<sup>asws</sup> am loaded upon like his<sup>saww</sup> load, and it is the load of the Lord<sup>azwj</sup>.",
            "And that (on the Day of Judgment), Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> would be Called, so he<sup style=\"font-weight: normal\">saww</sup> would be clothed, and I<sup style=\"font-weight: normal\">asws</sup> would be Called, so I<sup style=\"font-weight: normal\">asws</sup> would be clothed; and he<sup style=\"font-weight: normal\">saww</sup> would be Interrogated and I<sup style=\"font-weight: normal\">asws</sup> would be Interrogated (about our<sup style=\"font-weight: normal\">asws</sup> followers). So I<sup style=\"font-weight: normal\">asws</sup> shall speak upon a limit of his<sup style=\"font-weight: normal\">saww</sup> speaking. And I<sup style=\"font-weight: normal\">asws</sup> have been Given qualities to that no one has preceded me<sup style=\"font-weight: normal\">asws</sup> to these by anyone with before me<sup style=\"font-weight: normal\">asws</sup>. I<sup style=\"font-weight: normal\">asws</sup> know the deaths, and the tribulations, and the decisive sermons. Thus, nothing was missed out from me<sup style=\"font-weight: normal\">asws</sup>, that which preceded me<sup style=\"font-weight: normal\">asws</sup>, and nothing escapes from me<sup style=\"font-weight: normal\">asws</sup>, that which is hidden from me<sup style=\"font-weight: normal\">asws</sup>. I<sup style=\"font-weight: normal\">asws</sup> give Glad Tidings by the Permission of Allah<sup style=\"font-weight: normal\">azwj</sup>, and I<sup style=\"font-weight: normal\">asws</sup> will fulfill from it, all of that, from Allah<sup style=\"font-weight: normal\">azwj</sup> Who Enabled me<sup style=\"font-weight: normal\">asws</sup> with regards to it by His<sup style=\"font-weight: normal\">azwj</sup> Knowledge’.",
            "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Muhammad Bin Jamhour the blind, from Muhammad Bin Sinan who said, ‘Al Mufazzal narrated to us saying, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying’, ... then he mentioned the former Hadeeth’."
          ],
          "en.sarwar": [
            " 1. Ahmad ibn Mahran from Muhammad ibn Ali and Muhammad ibn Yahya from Ahmad ibn Muhammad altogether from Muhammad ibn Sinan from al-Mufaddal ibn ‘Umar from abu ‘Abdallah (a.s.) who has said the following. “Whatever Imam Ali (a.s.) has brought I follow them entirely and whatever he has forbidden I desist from them altogether. Whatever virtue that were found in the Holy Prophet (s.a.) were found in Imam Ali (a.s.) also. The Holy Prophet was more virtuous than all of the creatures of Allah, the Most Holy, the Most High. Those turning away from any item of his (Imam Ali) guidance would be like one turning away from the guidance of Allah and His Prophet. Rejecting him in small or a great one matters would like considering things like Allah (shirk). Amir al-Mu’minin Ali (a.s.) was the gate to Allah through which only, people could go closer to Him. Imam Ali (a.s.) was the path that if one would ignore it he would have been destroyed. This is also true of all the Imams of guidance one after the other. Allah has made them as the cornerstones of the earth so that people on it would not be destroyed. They possess the doubtless Divine authority over the inhabitants of earth and those below the earth. Amir al-Mu’minin Ali (a.s.) would very often say, “I am the supervisor for Allah to see who should go to Paradise and who should go to Hell. I am the greatest criterion, the possessor of the staff and the (marking) seal Miysam All the angels and the spirit have acknowledged the existence in me of all the matters that they had acknowledge in Prophet Muhammad (s.a.). I am held responsible for all such matters that Prophet Muhammad (s.a.) was held responsible. Such responsibilities are the duties to Allah, the Lord. The Holy Prophet will be called upon and his call will be accepted. I will be called up on and my call will be accepted. The Holy Prophet will be made to speak and I will be made to speak and I will speak just the way he would speak. I have been given certain distinctions which are given to no one before me. I was taught all about the deaths, the sufferings, the genealogy of people and clear speeCh I have not missed any of the knowledge that have passed me by and nothing of the future is unseen or unknown to me. I give good news by the permission of Allah and do my duty towards Allah. All of these is from Allah Who has made it possible for me through His knowledge.” Al-Husayn ibn Muhammad al-Ash‘ari has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur al-‘Ammi from Muhammad ibn Sinan who has said that al-Mufaddal narrated to us from abu ‘Abdallah (a.s.). He then narrated the above Hadith."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (372/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 520,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:14:2",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ شَبَابٍ الصَّيْرَفِيِّ قَالَ حَدَّثَنَا سَعِيدٌ الْأَعْرَجُ قَالَ دَخَلْتُ أَنَا وَ سُلَيْمَانُ بْنُ خَالِدٍ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَابْتَدَأَنَا فَقَالَ يَا سُلَيْمَانُ مَا جَاءَ عَنْ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) يُؤْخَذُ بِهِ وَ مَا نَهَى عَنْهُ يُنْتَهَى عَنْهُ جَرَى لَهُ مِنَ الْفَضْلِ مَا جَرَى لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) الْفَضْلُ عَلَى جَمِيعِ مَنْ خَلَقَ اللَّهُ الْمُعَيِّبُ عَلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فِي شَيْ‏ءٍ مِنْ أَحْكَامِهِ كَالْمُعَيِّبِ عَلَى اللَّهِ عَزَّ وَ جَلَّ وَ عَلَى رَسُولِهِ ( صلى الله عليه وآله ) وَ الرَّادُّ عَلَيْهِ فِي صَغِيرَةٍ أَوْ كَبِيرَةٍ عَلَى حَدِّ الشِّرْكِ بِاللَّهِ",
          "كَانَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) بَابَ اللَّهِ الَّذِي لَا يُؤْتَى إِلَّا مِنْهُ وَ سَبِيلَهُ الَّذِي مَنْ سَلَكَ بِغَيْرِهِ هَلَكَ وَ بِذَلِكَ جَرَتِ الْأَئِمَّةُ ( عليهم السلام ) وَاحِدٌ بَعْدَ وَاحِدٍ جَعَلَهُمُ اللَّهُ أَرْكَانَ الْأَرْضِ أَنْ تَمِيدَ بِهِمْ وَ الْحُجَّةَ الْبَالِغَةَ عَلَى مَنْ فَوْقَ الْأَرْضِ وَ مَنْ تَحْتَ الثَّرَى ",
          "وَ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَنَا قَسِيمُ اللَّهِ بَيْنَ الْجَنَّةِ وَ النَّارِ وَ أَنَا الْفَارُوقُ الْأَكْبَرُ وَ أَنَا صَاحِبُ الْعَصَا وَ الْمِيسَمِ وَ لَقَدْ أَقَرَّتْ لِي جَمِيعُ الْمَلَائِكَةِ وَ الرُّوحُ بِمِثْلِ مَا أَقَرَّتْ لِمُحَمَّدٍ ( صلى الله عليه وآله ) وَ لَقَدْ حُمِلْتُ عَلَى مِثْلِ حَمُولَةِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ هِيَ حَمُولَةُ الرَّبِّ ",
          "وَ إِنَّ مُحَمَّداً ( صلى الله عليه وآله ) يُدْعَى فَيُكْسَى وَ يُسْتَنْطَقُ وَ أُدْعَى فَأُكْسَى وَ أُسْتَنْطَقُ فَأَنْطِقُ عَلَى حَدِّ مَنْطِقِهِ وَ لَقَدْ أُعْطِيتُ خِصَالًا لَمْ يُعْطَهُنَّ أَحَدٌ قَبْلِي عُلِّمْتُ عِلْمَ الْمَنَايَا وَ الْبَلَايَا وَ الْأَنْسَابَ وَ فَصْلَ الْخِطَابِ فَلَمْ يَفُتْنِي مَا سَبَقَنِي وَ لَمْ يَعْزُبْ عَنِّي مَا غَابَ عَنِّي أُبَشِّرُ بِإِذْنِ اللَّهِ وَ أُؤَدِّي عَنِ اللَّهِ عَزَّ وَ جَلَّ كُلُّ ذَلِكَ مَكَّنَنِيَ اللَّهُ فِيهِ بِإِذْنِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Muhammad Bin Al Waleed Shabab Al Sayrafi who said, ‘Saeed Al A’raj narrated to us saying, ",
            "‘I and Suleyman Bin Khalid went over to Abu Abdullah<sup>asws</sup>. So he<sup>asws</sup> initiated us both by saying: ‘O Suleyman! Whatever has come from Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup>, take with it, and whatever he<sup>asws</sup> forbade from, refrain from it. It flows for him<sup>asws</sup> from the merit what flowed for Rasool-Allah<sup>saww</sup>, and for Rasool-Allah<sup>saww</sup> is the merit upon the entirety of the creatures of Allah<sup>azwj</sup>. The fault-finder upon Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> regarding anything from his<sup>asws</sup> decisions is like the faultfinder upon Allah<sup>azwj</sup> Mighty and Majestic and upon His<sup>azwj</sup> Rasool<sup>saw</sup>, and the rejecter upon him<sup>asws</sup> in a small (matter) or big would be within the limits of <span class=\"iTxt\">Shirk</span> (Association) with Allah<sup>azwj</sup>.",
            "It was so that Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> was ‘Allah<sup>azwj</sup>’s Door’ no one can access it but through it, and His<sup>azwj</sup> Way which the one who travels with other than it, perishes, with that flowed the Imams<sup>asws</sup>, one after one. Allah<sup>azwj</sup> Made them<sup>asws</sup> to be the Pivot of the earth, lest it shakes with its inhabitants, and His<sup>azwj</sup> eloquent Divine Authorities upon the ones above the earth and the ones beneath the soil’.",
            "And he<sup>asws</sup> said: ‘Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> said: ‘I<sup>asws</sup> am ‘Allah<sup>azwj</sup>‘s Distributor’ of the Paradise and the Fire, and I<sup>asws</sup> the Great Differentiator, and I<sup>asws</sup> am the owner of the Staff and the Branding Iron; and they have acknowledged to me<sup>asws</sup> the entirety of the Angels and the Spirit with the likes of what they acknowledged to Muhammad<sup>saww</sup>. and I<sup>asws</sup> am loaded upon like his<sup>saww</sup> load, and it is the load of the Lord<sup>azwj</sup>.",
            "And that (on the Day of Judgment) Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> would be Called, so he<sup style=\"font-weight: normal\">saww</sup> would be clothed, and I<sup style=\"font-weight: normal\">asws</sup> would be Called, so I<sup style=\"font-weight: normal\">asws</sup> would be clothed; and I<sup style=\"font-weight: normal\">asws</sup> shall be speaking upon a limit of his<sup style=\"font-weight: normal\">saww</sup> speaking. And I<sup style=\"font-weight: normal\">asws</sup> have been Given qualities what no one has preceded me<sup style=\"font-weight: normal\">asws</sup> to these by anyone before me<sup style=\"font-weight: normal\">asws</sup>. I<sup style=\"font-weight: normal\">asws</sup> know the deaths, and the tribulations, and the decisive sermons. Thus, nothing was missed out from me<sup style=\"font-weight: normal\">asws</sup>, that which preceded me<sup style=\"font-weight: normal\">asws</sup>, and nothing escapes from me<sup style=\"font-weight: normal\">asws</sup>, that which is hidden from me<sup style=\"font-weight: normal\">asws</sup>. I<sup style=\"font-weight: normal\">asws</sup> give Glad Tidings by the Permission of Allah<sup style=\"font-weight: normal\">azwj</sup>, and I<sup style=\"font-weight: normal\">asws</sup> will fulfill from it, all of that, from Allah<sup style=\"font-weight: normal\">azwj</sup> Who Enabled me<sup style=\"font-weight: normal\">asws</sup> with regards to it by His<sup style=\"font-weight: normal\">azwj</sup> Permission’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from Muhammad ibn al-Walid Shabab al-Sayrafi who has said that Sa‘id’ al-A‘raj has said that he and Sulayman ibn Khalid once went to abu ‘Abdallah (a.s.) and al-A‘raj began the conversation as follows. “Whatever Imam Ali (a.s.) has brought is followed entirely and whatever he has forbidden is desisted from altogether. Whatever virtue that were found in the Holy Prophet (s.a.) were found in Imam Ali (a.s.) also. The Holy Prophet was more virtuous than all of the creatures of Allah, the Most Holy, the Most High. Those who would find faults any item of his (Imam Ali) guidance would be like one finding faults in the guidance of Allah, the Most Holy, the Most High and His Prophet. Rejecting him in small or a great matters would be like considering things similar to Allah (shirk). Amir al-Mu’minin Ali (a.s.) was the gate to Allah through which only, people can get closer to Him. Imam Ali (a.s.) was the path that if one would ignore it he would have been destroyed. This is also true of all the Imams of guidance one after the other. Allah has made them as the cornerstones of the earth so that people on it would not be destroyed. They possess the doubtless Divine authority over the inhabitants of earth and those below the earth. Amir al-Mu’minin Ali (a.s.) has said, “I am the supervisor for Allah to see who should go to Paradise and who should go to Hell. I am the greatest criterion, the possessor of the staff and the (marking) seal Miysam All the angels and the spirit have acknowledged the existence in me of all the matters that they had acknowledge in Prophet Muhammad (s.a.). I am held responsible for all such matters that Prophet Muhammad (s.a.) was held responsible. Such responsibilities are the duties to Allah, the Lord. The Holy Prophet will be called upon and his call will be accepted. I will be called up on and I my call will be accepted. The Holy Prophet will be made to speak, and I will be made to speak and I will speak just the way he would speak. I have been given certain distinctions which, are given to no one before me. I was taught all about the deaths, the sufferings, the genealogy of people and clear speeCh I have not missed any of the knowledge that have passed me by and nothing of the future is unseen or unknown to me. I give good news by the permission of Allah and do my duty towards Allah. All of these is from Allah Who has made it possible for me through His knowledge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/373)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 521,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:14:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ مُحَمَّدٍ جَمِيعاً عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ عَلِيِّ بْنِ حَسَّانَ قَالَ حَدَّثَنِي أَبُو عَبْدِ اللَّهِ الرِّيَاحِيُّ عَنْ أَبِي الصَّامِتِ الْحُلْوَانِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ فَضْلُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) مَا جَاءَ بِهِ آخُذُ بِهِ وَ مَا نَهَى عَنْهُ أَنْتَهِي عَنْهُ جَرَى لَهُ مِنَ الطَّاعَةِ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مَا لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ الْفَضْلُ لِمُحَمَّدٍ ( صلى الله عليه وآله ) الْمُتَقَدِّمُ بَيْنَ يَدَيْهِ كَالْمُتَقَدِّمِ بَيْنَ يَدَيِ اللَّهِ وَ رَسُولِهِ وَ الْمُتَفَضِّلُ عَلَيْهِ كَالْمُتَفَضِّلِ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ الرَّادُّ عَلَيْهِ فِي صَغِيرَةٍ أَوْ كَبِيرَةٍ عَلَى حَدِّ الشِّرْكِ بِاللَّهِ ",
          "فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) بَابُ اللَّهِ الَّذِي لَا يُؤْتَى إِلَّا مِنْهُ وَ سَبِيلُهُ الَّذِي مَنْ سَلَكَهُ وَصَلَ إِلَى اللَّهِ عَزَّ وَ جَلَّ وَ كَذَلِكَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مِنْ بَعْدِهِ وَ جَرَى لِلْأَئِمَّةِ ( عليهم السلام ) وَاحِداً بَعْدَ وَاحِدٍ جَعَلَهُمُ اللَّهُ عَزَّ وَ جَلَّ أَرْكَانَ الْأَرْضِ أَنْ تَمِيدَ بِأَهْلِهَا وَ عُمُدَ الْإِسْلَامِ وَ رَابِطَةً عَلَى سَبِيلِ هُدَاهُ لَا يَهْتَدِي هَادٍ إِلَّا بِهُدَاهُمْ وَ لَا يَضِلُّ خَارِجٌ مِنَ الْهُدَى إِلَّا بِتَقْصِيرٍ عَنْ حَقِّهِمْ",
          "أُمَنَاءُ اللَّهِ عَلَى مَا أَهْبَطَ مِنْ عِلْمٍ أَوْ عُذُرٍ أَوْ نُذُرٍ وَ الْحُجَّةُ الْبَالِغَةُ عَلَى مَنْ فِي الْأَرْضِ يَجْرِي لآِخِرِهِمْ مِنَ اللَّهِ مِثْلُ الَّذِي جَرَى لِأَوَّلِهِمْ وَ لَا يَصِلُ أَحَدٌ إِلَى ذَلِكَ إِلَّا بِعَوْنِ اللَّهِ",
          "وَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَنَا قَسِيمُ اللَّهِ بَيْنَ الْجَنَّةِ وَ النَّارِ لَا يَدْخُلُهَا دَاخِلٌ إِلَّا عَلَى حَدِّ قَسْمِي وَ أَنَا الْفَارُوقُ الْأَكْبَرُ وَ أَنَا الْإِمَامُ لِمَنْ بَعْدِي وَ الْمُؤَدِّي عَمَّنْ كَانَ قَبْلِي لَا يَتَقَدَّمُنِي أَحَدٌ إِلَّا أَحْمَدُ ( صلى الله عليه وآله ) وَ إِنِّي وَ إِيَّاهُ لَعَلَى سَبِيلٍ وَاحِدٍ إِلَّا أَنَّهُ هُوَ الْمَدْعُوُّ بِاسْمِهِ ",
          "وَ لَقَدْ أُعْطِيتُ السِّتَّ عِلْمَ الْمَنَايَا وَ الْبَلَايَا وَ الْوَصَايَا وَ فَصْلَ الْخِطَابِ وَ إِنِّي لَصَاحِبُ الْكَرَّاتِ وَ دَوْلَةِ الدُّوَلِ وَ إِنِّي لَصَاحِبُ الْعَصَا وَ الْمِيسَمِ وَ الدَّابَّةُ الَّتِي تُكَلِّمُ النَّاسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and Ahmad Bin Muhammad altogether, from Muhammad Bin Al Hassan, from Ali Bin Hassan who said, ‘Abu Abdullah Al Riyyahi narrated to me, from Abu Al Samit Al Hulwany, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A merit of Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> is that whatever he<sup>asws</sup> came with, (you) take by it, and whatever he<sup>asws</sup> forbade from, refrain from it. It flows for him<sup>asws</sup> from the obedience after Rasool-Allah<sup>saww</sup>, what flowed for Rasool-Allah<sup>saww</sup>. And the merit is for Muhammad<sup>saww</sup>. The one (trying to be) in front of him<sup>asws</sup> is like the one (trying to be) in front of Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>; and the one (trying to be more) meritorious (take a lead) over him<sup>asws</sup> is like the one (trying to be more) meritorious upon Rasool-Allah<sup>saww</sup>, and the rejecter upon him<sup>asws</sup> regarding a small (matter) or big, would be within the limits of the <span class=\"iTxt\">Shirk</span> (Association) with Allah<sup>azwj</sup>.",
            "So if Rasool-Allah<sup>saww</sup> is a Door of Allah<sup>azwj</sup> Which one cannot come to Him<sup>azwj</sup> except from it, and His<sup>azwj</sup> Way which the one who travels it arrives to Allah<sup>azwj</sup> Mighty and Majestic. It was like for Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> from after him<sup>saww</sup>, and it flowed for the Imams<sup>asws</sup>, one after one. Allah<sup>azwj</sup> Mighty and Majestic Made them<sup>asws</sup> to be Pivot of the earth lest is shakes with its inhabitants, and pillars of Al-Islam, and the connection to the Way of His<sup>azwj</sup> Guidance. No guide can guide except by their<sup>asws</sup> guidance, nor would one stray outside from the guidance except by being deficient in their<sup>asws</sup> rights. ",
            "They are the Trustees of Allah<sup>azwj</sup> upon what came down from a Knowledge, or an excuse, or a warning, and are the Eloquent Divine Authority upon the ones in the earth. It flows for the last of them<sup>asws</sup> from Allah<sup>azwj</sup> similar to which flowed for their<sup>asws</sup> first one, and no one would arrive to that except by the Assistance of Allah<sup>azwj</sup>. ",
            "And Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> said: ‘I<sup>asws</sup> am ‘Allah<sup>azwj</sup>‘s Distributor’ of Paradise and the Fire. None can enter it except upon a limit of my<sup>asws</sup> distribution, and I<sup>asws</sup> am the Great Differentiator, and I<sup>asws</sup> am the Imam<sup>asws</sup> of the ones after me and the communicator on behalf of the ones who were before me<sup>asws</sup>. No one precedes me except Ahmad<sup>saww</sup>, and I<sup>asws</sup> and him<sup>saww</sup> are upon one way, except that he<sup>saww</sup> is the one called by his<sup>saww</sup> name. ",
            "And I<sup>asws</sup> have been Given six – Knowledge of the deaths, and the tribulations, and the successorship, and decisive sermons, and I<sup>asws</sup> am the owner of the spheres and a state of the states, and I<sup>asws</sup> am the owner of the Staff and the Branding iron, ‘الدَّابَّةُ’ and the Walker (27:82) who would be speaking to the people’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya and Ahmad ibn Muhammad both have narrated from Muhammad ibn al-Hassan from Ali ibn Hassa’n who has said that abu ‘Abdallah al-Riyahi narrated to him from abu al-Samit al-Hulwani from abu Ja‘far (a.s.) about the virtue of Amir al-Mu’minin Ali (a.s.) the following Hadith. “Whatever Imam Ali (a.s.) has brought I follow them entirely and whatever he has forbidden I desist from them altogether. All that is true of the obedience to the Holy Prophet (s.a.) is true of the obedience to Imam Ali (a.s.) after the Holy Prophet (s.a.) but virtue belongs to Prophet Muhammad (s.a.). Those who would try to be ahead of Imam Ali (a.s.) would be considered as trying to be ahead of Prophet (s.a.). Those who would to show themselves as more virtuous than Imam Ali (a.s.) would be considered as trying to show themselves as more virtuous than the Holy Prophet (s.a.). Whoever would reject any of the small or great items of the guidance of Imam Ali (a.s.) he would be like considering things as similar (shirk) to Allah. The Holy Prophet (s.a.) is the gate through which people can go to Allah. He is the path that if chosen would lead to Allah, the Most Holy, the Most High. The same was true of Imam Ali (a.s.) after the Holy Prophet (s.a.). All such matters were true of the Imams (a.s.) one after the other. Allah, the Most Holy, the Most High, has made them the cornerstone of the earth so that its inhabitants would not be destroyed. They were the pillars of Islam and the connection in the path of guidance. No guide can be a guide without their guidance and one would go astray unless he would ignore the rights of these Imams (a.s.). They are the trustees of Allah over whatever knowledge, warning and excuses that have been revealed to them (from the heavens). They possess the doubtless Divine authority over those on earth. Whatever, (virtue and authority) is found in one of them is true of all of them and no one can reach such a stage without support from Allah. Amir al-Mu’minin Ali (a.s.) has said, “I am the supervisor for Allah over Paradise and Hell. No one would go either one without my supervision. I am the greatest criterion and the Imam for those after me the provider of relief for those before me. No one is permitted to be ahead of me except Ahmad (s.a.). I and he are on the same path except that he is called Ahmed (the most praiseworthy). I have been given six things. I have been the knowledge of deaths, that of the sufferings, that of the wills and the clear speeCh That I have been give the power to attack the enemy, the power subdue the adversary, that I am the owner of the staff and Maysam and the being that would speak to people.” (a reference to verse 82 of chapter 27 of Quran) “When the word about them comes true We shall make a creature appear to them on earth who will tell them that people had no faith in Our revelations.” (27:82)"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:14",
  "kind": "verse_list"
}