{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 16"}, "path": "/books/al-kafi:1:4:16", "titles": {"ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) وُلَاةُ الْأَمْرِ وَ هُمُ النَّاسُ الْمَحْسُودُونَ الَّذِينَ ذَكَرَهُمُ اللَّهُ عَزَّ وَ جَلَّ", "en": "Chapter 16 – The Imams<sup>asws</sup> are the Masters of the Command (Wali Al-Amr), and they<sup>asws</sup> are the envied people whom Allah<sup>azwj</sup> Mighty and Majestic has Mentioned"}}], "index": 74, "local_index": 16, "part_type": "Chapter", "path": "/books/al-kafi:1:4:16", "titles": {"ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) وُلَاةُ الْأَمْرِ وَ هُمُ النَّاسُ الْمَحْسُودُونَ الَّذِينَ ذَكَرَهُمُ اللَّهُ عَزَّ وَ جَلَّ", "en": "Chapter 16 – The Imams<sup>asws</sup> are the Masters of the Command (Wali Al-Amr), and they<sup>asws</sup> are the envied people whom Allah<sup>azwj</sup> Mighty and Majestic has Mentioned"}, "verse_count": 5, "verse_start_index": 523, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 524, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:16:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدِ</span> بْنِ عَامِرٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ قَالَ حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْوَشَّاءُ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ بُرَيْدٍ الْعِجْلِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ فَكَانَ جَوَابُهُ أَ لَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيباً مِنَ الْكِتابِ يُؤْمِنُونَ بِالْجِبْتِ وَ الطَّاغُوتِ وَ يَقُولُونَ لِلَّذِينَ كَفَرُوا هؤُلاءِ أَهْدى مِنَ الَّذِينَ آمَنُوا سَبِيلًا يَقُولُونَ لِأَئِمَّةِ الضَّلَالَةِ وَ الدُّعَاةِ إِلَى النَّارِ هؤُلاءِ أَهْدى مِنْ آلِ مُحَمَّدٍ سَبِيلًا", "أُولئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ وَ مَنْ يَلْعَنِ اللَّهُ فَلَنْ تَجِدَ لَهُ نَصِيراً أَمْ لَهُمْ نَصِيبٌ مِنَ الْمُلْكِ يَعْنِي الْإِمَامَةَ وَ الْخِلَافَةَ فَإِذاً لا يُؤْتُونَ النَّاسَ نَقِيراً نَحْنُ النَّاسُ الَّذِينَ عَنَى اللَّهُ وَ النَّقِيرُ النُّقْطَةُ الَّتِي فِي وَسَطِ النَّوَاةِ", "أَمْ يَحْسُدُونَ النَّاسَ عَلى ما آتاهُمُ اللَّهُ مِنْ فَضْلِهِ نَحْنُ النَّاسُ الْمَحْسُودُونَ عَلَى مَا آتَانَا اللَّهُ مِنَ الْإِمَامَةِ دُونَ خَلْقِ اللَّهِ أَجْمَعِينَ فَقَدْ آتَيْنا آلَ إِبْراهِيمَ الْكِتابَ وَ الْحِكْمَةَ وَ آتَيْناهُمْ مُلْكاً عَظِيماً يَقُولُ جَعَلْنَا مِنْهُمُ الرُّسُلَ وَ الْأَنْبِيَاءَ وَ الْأَئِمَّةَ", "فَكَيْفَ يُقِرُّونَ بِهِ فِي آلِ إِبْرَاهِيمَ ( عليه السلام ) وَ يُنْكِرُونَهُ فِي آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) ", "فَمِنْهُمْ مَنْ آمَنَ بِهِ وَ مِنْهُمْ مَنْ صَدَّ عَنْهُ وَ كَفى بِجَهَنَّمَ سَعِيراً إِنَّ الَّذِينَ كَفَرُوا بِآياتِنا سَوْفَ نُصْلِيهِمْ ناراً كُلَّما نَضِجَتْ جُلُودُهُمْ بَدَّلْناهُمْ جُلُوداً غَيْرَها لِيَذُوقُوا الْعَذابَ إِنَّ اللَّهَ كانَ عَزِيزاً حَكِيماً ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad Bin Aamir Al Ashary, from Moalla Bin Muhammad who said, ‘Al Hassan Bin Al Al Washha narrated to me, from Ahmad Bin Aiz, from Ibn Azina, from Bureyd Al Ijaly who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:59] O you who believe! Obey Allah and obey the Rasool and those in authority from among you</span>. So his<sup>asws</sup> answer was: ‘<span class=\"ibTxt\">[4:51] Have you not seen those to whom a portion of the Book has been given? They believe in idols and false deities and say of those who disbelieve: These are better guided in the path than those who believe</span>. They are saying for the imams of the misguidance and the inviters to the Fire that they are more guiding than the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> in the path. ", "<span class=\"ibTxt\">[4:52] Those are they whom Allah has Cursed, and whomever Allah Curses you shall not find any helper for him [4:53] Or have they a share in the kingdom? </span> Meaning the Imamate and the Caliphte, <span class=\"ibTxt\">But then they would not give to people even the speck in the date stone</span>. We<sup>asws</sup> are the people whom Allah<sup>azwj</sup> has Meant, and the ‘speck’, it is the seed which is found in the middle of the date. ", "<span class=\"ibTxt\">[4:54] Or do they envy the people for what Allah has Given them of His Grace?</span> So we<sup>asws</sup> are the envied people upon what Allah<sup>azwj</sup> Gave us<sup>asws</sup> from the Imamate besides the whole of the creatures of Allah<sup>azwj</sup>.<span class=\"ibTxt\"> But indeed We have given to the Progeny of Ibrahim, the Book and the Wisdom, and We have Given them a Grand Kingdom</span>. He<sup>azwj</sup> is Saying: “We<sup>azwj</sup> Made to be from them, the Rasools<sup>as</sup>, and the Prophets<sup>as</sup>, and the Imams<sup>asws</sup>. ", "So how come they are acknowledging with it regarding the Progeny of Ibrahim<sup>as</sup>, and they are denying it regarding the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>? ", "<span class=\"ibTxt\">[4:55] So of them is he who believes in him, and of them is he who turns away from him, and Hell is sufficient as a Blazing Fire [4:56] (As for) those who disbelieve in Our Signs, We shall Make them enter the Fire; Every time their skins are thoroughly burned, We will Change them for other skins, that they may taste the Punishment; surely Allah is Mighty, Wise</span>’."]}}, {"index": 525, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:16:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى أَمْ يَحْسُدُونَ النَّاسَ عَلى ما آتاهُمُ اللَّهُ مِنْ فَضْلِهِ قَالَ نَحْنُ الْمَحْسُودُونَ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Muhammad Bin Al Fuzayl, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\">[4:54] Or do they envy the people for what Allah has Given them of His Grace?</span> He<sup>asws</sup> said: ‘We<sup>asws</sup> are the envied people’."]}}, {"index": 526, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:16:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ مُحَمَّدٍ الْأَحْوَلِ عَنْ حُمْرَانَ بْنِ أَعْيَنَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْلُ اللَّهِ عَزَّ وَ جَلَّ فَقَدْ آتَيْنا آلَ إِبْراهِيمَ الْكِتابَ فَقَالَ النُّبُوَّةَ قُلْتُ الْحِكْمَةَ قَالَ الْفَهْمَ وَ الْقَضَاءَ قُلْتُ وَ آتَيْناهُمْ مُلْكاً عَظِيماً فَقَالَ الطَّاعَةَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Muhammad Al Ahowl, from Humran Bin Ayn who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘The Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:54] But indeed We have given to the Progeny of Ibrahim, the Book</span>’. So he<sup>asws</sup> said: ‘The Prophet-hood’. I said, ‘<span class=\"ibTxt\">and the Wisdom</span>?’ He<sup>asws</sup> said: ‘The understanding and the (giving) judgment’. I said, ‘<span class=\"ibTxt\">and We have Given them a Grand Kingdom</span>?’ So he<sup>asws</sup> said: ‘The obedience (of the people)’."]}}, {"index": 527, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:16:4", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي الصَّبَّاحِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَمْ يَحْسُدُونَ النَّاسَ عَلى ما آتاهُمُ اللَّهُ مِنْ فَضْلِهِ فَقَالَ يَا أَبَا الصَّبَّاحِ نَحْنُ وَ اللَّهِ النَّاسُ الْمَحْسُودُونَ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Hammad Bin Usman, from Abu Al Sabbah who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:54] Or do they envy the people for what Allah has Given them of His Grace?</span> So he<sup>asws</sup> said: ‘O Abu Al-Sabbah! We<sup>asws</sup>, by Allah<sup>azwj</sup>, are the envied people’."]}}, {"index": 528, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:16:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ بُرَيْدٍ الْعِجْلِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى فَقَدْ آتَيْنا آلَ إِبْراهِيمَ الْكِتابَ وَ الْحِكْمَةَ وَ آتَيْناهُمْ مُلْكاً عَظِيماً قَالَ جَعَلَ مِنْهُمُ الرُّسُلَ وَ الْأَنْبِيَاءَ وَ الْأَئِمَّةَ فَكَيْفَ يُقِرُّونَ فِي آلِ إِبْرَاهِيمَ ( عليه السلام ) وَ يُنْكِرُونَهُ فِي آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) ", "قَالَ قُلْتُ وَ آتَيْناهُمْ مُلْكاً عَظِيماً قَالَ الْمُلْكُ الْعَظِيمُ أَنْ جَعَلَ فِيهِمْ أَئِمَّةً مَنْ أَطَاعَهُمْ أَطَاعَ اللَّهَ وَ مَنْ عَصَاهُمْ عَصَى اللَّهَ فَهُوَ الْمُلْكُ الْعَظِيمُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Muhammad Bin Abu Umeyr, from Umar Bin Azina, from Bureyd Al Ijaly, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\">[4:54] But indeed We have given to the Progeny of Ibrahim, the Book and the Wisdom, and We have Given them a Grand Kingdom</span>. He<sup>asws</sup> said: ‘He<sup>azwj</sup> Made to be from them, the Rasools<sup>as</sup>, and the Prophets<sup>as</sup>, and the Imams<sup>asws</sup>. So, how come they (people) are acknowledging regarding the Progeny of Ibrahim<sup>as</sup> and they are denying regarding the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>?’ ", "He (the narrator) said, ‘I said, ‘<span class=\"ibTxt\">[4:54] and We have Given them a Grand Kingdom</span>?’ He<sup>asws</sup> said: ‘The Grand Kingdom is that He<sup>azwj</sup> Made the Imams<sup>asws</sup> to be among them. The one who obeys them<sup>asws</sup> obeys Allah<sup>azwj</sup>, and the one who disobeys them<sup>asws</sup> disobeys Allah<sup>azwj</sup>. Thus it is the Grand Kingdom’."]}}]}, "index": "al-kafi:1:4:16", "kind": "verse_list"}