{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:1:4:2",
        "titles": {
          "ar": "بَابُ طَبَقَاتِ الْأَنْبِيَاءِ وَ الرُّسُلِ وَ الْأَئِمَّةِ ( عليهم السلام )",
          "en": "Chapter 2 – The categories of the Prophets<sup>asws</sup>, and the Rasools<sup>as</sup>, and the Imams<sup>asws</sup>"
        }
      }
    ],
    "index": 60,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:1:4:3",
        "titles": {
          "ar": "بَابُ الْفَرْقِ بَيْنَ الرَّسُولِ وَ النَّبِيِّ وَ الْمُحَدَّثِ",
          "en": "Chapter 3 – The difference between the Rasool<sup>as</sup>, and the Prophet<sup>as</sup>, and the Muhaddith"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:1:4:1",
        "titles": {
          "ar": "بَابُ الِاضْطِرَارِ إِلَى الْحُجَّةِ",
          "en": "Chapter 1 – The desperate need to the Divine Authority"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:2",
    "titles": {
      "ar": "بَابُ طَبَقَاتِ الْأَنْبِيَاءِ وَ الرُّسُلِ وَ الْأَئِمَّةِ ( عليهم السلام )",
      "en": "Chapter 2 – The categories of the Prophets<sup>asws</sup>, and the Rasools<sup>as</sup>, and the Imams<sup>asws</sup>"
    },
    "verse_count": 4,
    "verse_start_index": 432,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (280/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 433,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:2:1",
        "relations": {
          "Mentions": [
            "/books/quran:37:147",
            "/books/quran:2:124"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِي يَحْيَى الْوَاسِطِيِّ عَنْ هِشَامِ بْنِ سَالِمٍ وَ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْأَنْبِيَاءُ وَ الْمُرْسَلُونَ عَلَى أَرْبَعِ طَبَقَاتٍ فَنَبِيٌّ مُنَبَّأٌ فِي نَفْسِهِ لَا يَعْدُو غَيْرَهَا وَ نَبِيٌّ يَرَى فِي النَّوْمِ وَ يَسْمَعُ الصَّوْتَ وَ لَا يُعَايِنُهُ فِي الْيَقَظَةِ وَ لَمْ يُبْعَثْ إِلَى أَحَدٍ وَ عَلَيْهِ إِمَامٌ مِثْلُ مَا كَانَ إِبْرَاهِيمُ عَلَى لُوطٍ ( عليه السلام ) ",
          "وَ نَبِيٌّ يَرَى فِي مَنَامِهِ وَ يَسْمَعُ الصَّوْتَ وَ يُعَايِنُ الْمَلَكَ وَ قَدْ أُرْسِلَ إِلَى طَائِفَةٍ قَلُّوا أَوْ كَثُرُوا كَيُونُسَ قَالَ اللَّهُ لِيُونُسَ وَ أَرْسَلْناهُ إِلى مِائَةِ أَلْفٍ أَوْ يَزِيدُونَ قَالَ يَزِيدُونَ ثَلَاثِينَ أَلْفاً وَ عَلَيْهِ إِمَامٌ وَ الَّذِي يَرَى فِي نَوْمِهِ وَ يَسْمَعُ الصَّوْتَ وَ يُعَايِنُ فِي الْيَقَظَةِ وَ هُوَ إِمَامٌ مِثْلُ أُولِي الْعَزْمِ وَ قَدْ كَانَ إِبْرَاهِيمُ ( عليه السلام ) نَبِيّاً وَ لَيْسَ بِإِمَامٍ حَتَّى قَالَ اللَّهُ إِنِّي جاعِلُكَ لِلنَّاسِ إِماماً قالَ وَ مِنْ ذُرِّيَّتِي فَقَالَ اللَّهُ لا يَنالُ عَهْدِي الظَّالِمِينَ مَنْ عَبَدَ صَنَماً أَوْ وَثَناً لَا يَكُونُ إِمَاماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Abu Yahya Al Wasity, from Hisham Bin Salim and Dorost Bin Abu Mansour, from him who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The Prophets<sup>as</sup> and the Rasools<sup>as</sup> are upon four categories. So there is a Prophet<sup>as</sup> Who is Given the News within himself<sup>as</sup>, without (responsibility of) inviting the others; and there is a Prophet<sup>as</sup> who sees (dream) in the sleep and he hears the voice, and does not see him (Jibraeel<sup>as</sup>) while awake, and is not Sent to any one, and upon him is an Imam similar to what Ibrahim<sup>as</sup> was upon Lot<sup>as</sup>. ",
            "And there is a Prophet<sup>as</sup> who sees (a dream) in his<sup>as</sup> sleep, and hears the voice, and sees the Angel, and he<sup>asws</sup> has been Sent to a (particular) group, be they little or more, like Yunus<sup>as</sup> was. Allah<sup>azwj</sup> Said to Yunus<sup>as</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:37#h147\">[37:147]</a> And We sent him to a hundred thousand, or more</span>’. He<sup>asws</sup> said: ‘(The words) ‘Or more’ refers to thirty thousand, and upon him<sup>as</sup> would be an Imam, and he<sup>as</sup> sees in his<sup>as</sup> sleep, and hears the voice, and sees while awake, and he would be an Imam like the Determined Ones (<span class=\"iTxt\">Ul Al-Azam</span>), and Ibrahim<sup>as</sup> was a Prophet<sup>saww</sup>, and was not an Imam until Allah<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h124\">[2:124]</a> I Make you to be an Imam of the people. Ibrahim said: And from my offspring? He Said: My Covenant cannot be attained by the unjust</span>’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from abu Yahya al-Wasiti from Hisham ibn Salim and Durust ibn abu Mansur from him the following. “Abu ‘Abdallah (a.s.) has said that the prophets and the messengers are of four categories. There were prophets who were given Divine news in their souls just for their own-selves and for no one else. There were also prophets who were given Divine news in their dreams and would hear the voice but would not see anyone when awake and they were not sent to other people with such news. They had to follow and Imam just as it happened with Lot who followed Abraham.. There were prophets who would experience in their dreams, hear the voice and see the angel and were sent to a group of people small or large like Jonas (we sent him to a hundred thousand people or a few more). The Imam said that there were thirty thousand more people lead by an Imam. Those who saw in their dreams heard the voice and saw the angel when awake and were also Imams like ’Ulul ‘Azm ones, such as Abraham were prophets but not Imams until Allah said, “I want to appoint you as the Imam for people.” He said, “Also please from my descendents, to which He said, ‘My covenant does not go to the unjust ones, those who have worshipped idols or statues will not become Imams.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/285)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 434,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:2:2",
        "relations": {
          "Mentions": [
            "/books/quran:2:124"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ الْحَسَنِ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ زَيْدٍ الشَّحَّامِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى اتَّخَذَ إِبْرَاهِيمَ عَبْداً قَبْلَ أَنْ يَتَّخِذَهُ نَبِيّاً وَ إِنَّ اللَّهَ اتَّخَذَهُ نَبِيّاً قَبْلَ أَنْ يَتَّخِذَهُ رَسُولًا وَ إِنَّ اللَّهَ اتَّخَذَهُ رَسُولًا قَبْلَ أَنْ يَتَّخِذَهُ خَلِيلًا وَ إِنَّ اللَّهَ اتَّخَذَهُ خَلِيلًا قَبْلَ أَنْ يَجْعَلَهُ إِمَاماً ",
          "فَلَمَّا جَمَعَ لَهُ الْأَشْيَاءَ قَالَ إِنِّي جاعِلُكَ لِلنَّاسِ إِماماً قَالَ فَمِنْ عِظَمِهَا فِي عَيْنِ إِبْرَاهِيمَ قَالَ وَ مِنْ ذُرِّيَّتِي قالَ لا يَنالُ عَهْدِي الظَّالِمِينَ قَالَ لَا يَكُونُ السَّفِيهُ إِمَامَ التَّقِيِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from the one who mentioned it, from Muhammad Bin Khalid, from Muhammad Bin Sinan, from Zayd Al Shahham who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Blessed and High Took Ibrahim<sup>as</sup> as a servant before He<sup>azwj</sup> Took him<sup>as</sup> as a Prophet<sup>as</sup>, and that Allah<sup>azwj</sup> Took him<sup>as</sup> as a Prophet before He<sup>azwj</sup> Took him<sup>as</sup> as a Rasool<sup>as</sup>, and that Allah<sup>azwj</sup> Took him<sup>as</sup> as a Rasool<sup>as</sup> before He<sup>azwj</sup> Took him<sup>as</sup> as a friend, and that Allah<sup>azwj</sup> Took him<sup>as</sup> as a friend before He<sup>azwj</sup> Took him<sup>as</sup> as an Imam. ",
            "So when the things were gathered for him<sup>as</sup>, He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h124\">[2:124]</a> I Make you to be an Imam of the people</span>. So it was a great matter in the eyes of Ibrahim<sup>as</sup>, so he<sup>as</sup> said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h124\">[2:124]</a> Ibrahim said: And from my offspring? He Said: My Covenant cannot be attained by the unjust</span>’. He<sup>asws</sup> said: ‘The foolish cannot happen to be an Imam of the pious’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn al-Hassan has narrated those whom he mentioned from Muhammad ibn Khalid from Muhammad ibn Sinan from Zayd al-Shahham who has said the following. “I heard Imam abu ‘Abdallah saying, ‘Allah chose Abraham as a servant before choosing him as a prophet. Allah chose him as a prophet before choosing him as a messenger. Allah chose him as a messenger before choosing him as a friend of His. Allah chose him as a friend of His before choosing him as an Imam. When all of the above things were gathered in Abraham, Allah said, “I have certainly appointed you as the Imam for the people.” Because to Abraham it was so great he asked, “Can this (Imamat, leadership) be in my descendents also?” Allah said, “The feeble-minded can become the leaders of the pious ones.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/286)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/24)"
        ],
        "index": 435,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:2:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَثْعَمِيِّ عَنْ هِشَامٍ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ سَادَةُ النَّبِيِّينَ وَ الْمُرْسَلِينَ خَمْسَةٌ وَ هُمْ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَ عَلَيْهِمْ دَارَتِ الرَّحَى نُوحٌ وَ إِبْرَاهِيمُ وَ مُوسَى وَ عِيسَى وَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ عَلَى جَمِيعِ الْأَنْبِيَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Yahya Al Kash’amy, from Hisham, from Ibn Abu Yafour who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying, ‘The chiefs of the Prophets<sup>as</sup> and the Mursils<sup>as</sup> are five, and they<sup>as</sup> are the Determined Ones (<span class=\"iTxt\">Ul Al-Azm</span>) from the Rasools<sup>as</sup>, and upon them<sup>asws</sup> is the pole of the grind-mill (the central role) – Noah<sup>as</sup>, and Ibrahim<sup>as</sup>, and Musa<sup>as</sup>, and Isa<sup>as</sup>, and Muhammad<sup>saww</sup>, may Salawat be upon them<sup>as</sup> and upon the entirety of the Prophets<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 3. A number of our people has narrated from Ahmad ibn Muhammad ibn Muhammad ibn Yahya al-Khath‘ami from Hisham from abu Ya‘qub who has said the following “I heard abu ‘Abdallah saying, ‘The leaders and masters of the prophets and the messengers are five who are called ’ulul ‘Azm (people with determination) among the messengers who have the central role. They are Noah, Abraham, Moses, Jesus and Muhammad (s.a.).”"
          ]
        }
      },
      {
        "index": 436,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:2:4",
        "relations": {
          "Mentions": [
            "/books/quran:2:124"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ إِسْحَاقَ بْنِ عَبْدِ الْعَزِيزِ أَبِي السَّفَاتِجِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ اللَّهَ اتَّخَذَ إِبْرَاهِيمَ عَبْداً قَبْلَ أَنْ يَتَّخِذَهُ نَبِيّاً وَ اتَّخَذَهُ نَبِيّاً قَبْلَ أَنْ يَتَّخِذَهُ رَسُولًا وَ اتَّخَذَهُ رَسُولًا قَبْلَ أَنْ يَتَّخِذَهُ خَلِيلًا وَ اتَّخَذَهُ خَلِيلًا قَبْلَ أَنْ يَتَّخِذَهُ إِمَاماً ",
          "فَلَمَّا جَمَعَ لَهُ هَذِهِ الْأَشْيَاءَ وَ قَبَضَ يَدَهُ قَالَ لَهُ يَا إِبْرَاهِيمُ إِنِّي جاعِلُكَ لِلنَّاسِ إِماماً فَمِنْ عِظَمِهَا فِي عَيْنِ إِبْرَاهِيمَ ( عليه السلام ) قَالَ يَا رَبِّ وَ مِنْ ذُرِّيَّتِي قالَ لا يَنالُ عَهْدِي الظَّالِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Al Husayn, from Is’haq Bin Abdul Aziz Abu Saffatij, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Took Ibrahim<sup>as</sup> as a servant before He<sup>azwj</sup> Took him<sup>as</sup> as a Prophet<sup>as</sup>, and Took him<sup>as</sup> as a Prophet<sup>as</sup> before He<sup>azwj</sup> Took him<sup>as</sup> as a Rasool<sup>as</sup>, and Took him<sup>as</sup> as a Rasool<sup>as</sup> before He<sup>azwj</sup> Took him<sup>as</sup> as a friend, and Took him<sup>as</sup> as a friend, before He<sup>azwj</sup> Took him<sup>as</sup> as an Imam. ",
            "So when these things were gathered for him<sup>as</sup> and were in his<sup>as</sup> hand, He<sup>azwj</sup> Said to him<sup>as</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h124\">[2:124]</a> I Make you to be an Imam of the people</span>. So it was a great matter in the eyes of Ibrahim<sup>as</sup>, so he<sup>as</sup> said: ‘O Lord<sup>azwj</sup>!  <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h124\">[2:124]</a> And from my offspring? He Said: My Covenant cannot be attained by the unjust</span>’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan from Ishaq ibn ‘Abd al-‘Aziz from abu al-Saffah from Jabir from abu Ja‘far (a.s.) has said the following. “I heard the Imam saying, ‘Allah chose Abraham as a servant before He chose him as a prophet. He chose him as a prophet before He chose him as a messenger. He chose him as a messenger before He chose him as a friend of His. He chose him as a friend of His before He chose him as an Imam. When all of these things gathered in him (the Imam holding his hands said, “Allah said, ‘O Ibrahim I have appointed you as the Imam (leader) of the people.” Because of the greatness of the position Abraham them asked, “O Lord, can it be in my descendants also?” The Lord said, ‘My covenant does not go to the unjust ones.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:2",
  "kind": "verse_list"
}