{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 21"}, "path": "/books/al-kafi:1:4:21", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ مَنْ وَصَفَهُ</span> اللَّهُ تَعَالَى فِي كِتَابِهِ بِالْعِلْمِ هُمُ الْأَئِمَّةُ ( عليهم السلام )", "en": "Chapter 21 – The ones whom Allah<sup>azwj</sup> has Described as being with the knowledge, they<sup>asws</sup> are the Imams<sup>asws</sup>"}}], "index": 79, "local_index": 21, "part_type": "Chapter", "path": "/books/al-kafi:1:4:21", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ مَنْ وَصَفَهُ</span> اللَّهُ تَعَالَى فِي كِتَابِهِ بِالْعِلْمِ هُمُ الْأَئِمَّةُ ( عليهم السلام )", "en": "Chapter 21 – The ones whom Allah<sup>azwj</sup> has Described as being with the knowledge, they<sup>asws</sup> are the Imams<sup>asws</sup>"}, "verse_count": 2, "verse_start_index": 550, "verses": [{"index": 551, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:21:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ الْمُؤْمِنِ بْنِ الْقَاسِمِ الْأَنْصَارِيِّ عَنْ سَعْدٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَ الَّذِينَ لا يَعْلَمُونَ إِنَّما يَتَذَكَّرُ أُولُوا الْأَلْبابِ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّمَا نَحْنُ الَّذِينَ يَعْلَمُونَ وَ الَّذِينَ لَا يَعْلَمُونَ عَدُوُّنَا وَ شِيعَتُنَا أُولُو الْأَلْبَابِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Abdul Momin Bin Al Qasim Al Ansary, from Sa’ad, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[39:9] Are those who are knowing and those who are not knowing alike? But rather, it is the ones of understanding who are mindful</span>. Abu Ja’far<sup>asws</sup> said: ‘But rather we<sup>asws</sup> are those who are knowing, and those who are not knowing are our<sup>asws</sup> enemies, and our Shias are the ones of understanding."}]}, {"index": 552, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:21:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ عَزَّ وَ جَلَّ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَ الَّذِينَ لا يَعْلَمُونَ إِنَّما يَتَذَكَّرُ أُولُوا الْأَلْبابِ قَالَ نَحْنُ الَّذِينَ يَعْلَمُونَ وَ عَدُوُّنَا الَّذِينَ لَا يَعْلَمُونَ وَ شِيعَتُنَا أُولُو الْأَلْبَابِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of the Mighty and Majestic <span class=\"ibTxt\">[39:9] Are those who ae knowing and those who are not knowing alike? But rather, it is the ones of understanding who are mindful</span>. He<sup>asws</sup> said: ‘We<sup>asws</sup> are those who are knowing, and our<sup>asws</sup> enemies are those who are not knowing, and our<sup>asws</sup> Shias are the ones of understanding’."}]}]}, "index": "al-kafi:1:4:21", "kind": "verse_list"}