{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:1:4:22",
        "titles": {
          "ar": "بَابُ أَنَّ الرَّاسِخِينَ فِي الْعِلْمِ هُمُ الْأَئِمَّةُ ( عليهم السلام )",
          "en": "Chapter 22 – The Ones firmly rooted in knowledge, they<sup>asws</sup> are The Imams<sup>asws</sup>"
        }
      }
    ],
    "index": 80,
    "local_index": 22,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:1:4:23",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ قَدْ أُوتُوا الْعِلْمَ وَ أُثْبِتَ فِي صُدُورِهِمْ",
          "en": "Chapter 23 – The Imams<sup>asws</sup> have been Given the Knowledge and Affirmed into their<sup>asws</sup> chests"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:1:4:21",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ مَنْ وَصَفَهُ</span> اللَّهُ تَعَالَى فِي كِتَابِهِ بِالْعِلْمِ هُمُ الْأَئِمَّةُ ( عليهم السلام )",
          "en": "Chapter 21 – The ones whom Allah<sup>azwj</sup> has Described as being with the knowledge, they<sup>asws</sup> are the Imams<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:22",
    "titles": {
      "ar": "بَابُ أَنَّ الرَّاسِخِينَ فِي الْعِلْمِ هُمُ الْأَئِمَّةُ ( عليهم السلام )",
      "en": "Chapter 22 – The Ones firmly rooted in knowledge, they<sup>asws</sup> are The Imams<sup>asws</sup>"
    },
    "verse_count": 3,
    "verse_start_index": 552,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> لم يحقق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (433/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 553,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:22:1",
        "refs": {
          "Mentions": [
            "/books/quran:3:7"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ أَيُّوبَ بْنِ الْحُرِّ وَ عِمْرَانَ بْنِ عَلِيٍّ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ نَحْنُ الرَّاسِخُونَ فِي الْعِلْمِ وَ نَحْنُ نَعْلَمُ تَأْوِيلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Ayoub Bin Al Hurr and Imran Bin Ali, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘We<sup>asws</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h7\">[3:7]</a> those who are firmly rooted in knowledge</span> and we<sup>asws</sup> know Its (Quran’s) interpretation’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from an-Nadr ibn Suwayd from Ayyub ibn Hurr and ‘Imran ibn Ali from abu Basir from abu ‘Abdallah (a.s.) who has said the following. “We are the people well-grounded in knowledge and we are the ones who know how to interpret it.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (435/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 554,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:22:2",
        "refs": {
          "Mentions": [
            "/books/quran:3:7"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَلِيٍّ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ ما يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ وَ الرَّاسِخُونَ فِي الْعِلْمِ فَرَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَفْضَلُ الرَّاسِخِينَ فِي الْعِلْمِ قَدْ عَلَّمَهُ اللَّهُ عَزَّ وَ جَلَّ جَمِيعَ مَا أَنْزَلَ عَلَيْهِ مِنَ التَّنْزِيلِ وَ التَّأْوِيلِ وَ مَا كَانَ اللَّهُ لِيُنْزِلَ عَلَيْهِ شَيْئاً لَمْ يُعَلِّمْهُ تَأْوِيلَهُ ",
          "وَ أَوْصِيَاؤُهُ مِنْ بَعْدِهِ يَعْلَمُونَهُ كُلَّهُ وَ الَّذِينَ لَا يَعْلَمُونَ تَأْوِيلَهُ إِذَا قَالَ الْعَالِمُ فِيهِمْ بِعِلْمٍ فَأَجَابَهُمُ اللَّهُ بِقَوْلِهِ يَقُولُونَ آمَنَّا بِهِ كُلٌّ مِنْ عِنْدِ رَبِّنا وَ الْقُرْآنُ خَاصٌّ وَ عَامٌّ وَ مُحْكَمٌ وَ مُتَشَابِهٌ وَ نَاسِخٌ وَ مَنْسُوخٌ فَالرَّاسِخُونُ فِي الْعِلْمِ يَعْلَمُونَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abdullah Bin Ali, from Ibrahim Bin Is’haq, from Abdullah Bin Hammad, from Bureyd Bin Muawiya, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h7\">[3:7]</a> but none knows its interpretation except Allah, and those who are firmly rooted in knowledge</span>: ‘So Rasool-Allah<sup>saww</sup> is the most superior of the ones firmly rooted in the knowledge. Allah<sup>azwj</sup> Mighty and Majestic had Taught him<sup>saww</sup> the entirety of what had been Sent down upon him<sup>saww</sup> from the Revelation, and it was not so that Allah<sup>azwj</sup> would Revealed something unto him<sup>saww</sup> and not Teach him<sup>saww</sup> its interpretation. ",
            "And his<sup>saww</sup> succesors<sup>asws</sup> from after him<sup>saww</sup> knew all of it, and those that are not knowing its interpretation, when the scholar said regarding them with knowledge, so Allah<sup>azwj</sup> Answered them with His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h7\">[3:7]</a> We believe in it, it is all from our Lord; and none do mind except those having understanding</span>. And the Quran (has Verses which are) Particular, and General, and Decisive, and Allegorical, and Abrogating, and Abrogated. So the ones<sup>asws</sup> firmly rooted in the knowledge are knowing it’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Muhammad has narrated from ‘Abdallah ibn Ali from Ibrahim ibn Ishaq from ‘Adallah ibn Hammad from Burayd ibn Mu‘awiya who has narrated the following from either one of the Imams (a.s.) about the words of Allah, Allah, the Most Majestic, the Most gracious. “No one knows its true interpretations except God and those who have a firm grounding in knowledge . .” <a href=\"/#/books/quran:3#h7\">[3:7]</a>. The Holy Prophet is the best among the people well-grounded in knowledge. Allah, the Most Majestic, the Most gracious, taught him all that He had revealed to him in the form of original text and in the form of interpretations. Allah, the Most Majestic, the Most gracious, would not reveal anything to him that he would not know the meaning thereof. The successors of the Holy Prophet (s.a.) after him knew all revelations. As for those who do not know the interpretations thereof, when the scholar speaks to them with knowledge, they say, “We believe in it, for all of this is from our Lord.” The Holy Quran consists of specific, general, clear, not so clear, abrogating and abrogated statements. The people who are well-grounded in knowledge know all of the Holy Quran.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (436/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 555,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:22:3",
        "refs": {
          "Mentions": [
            "/books/quran:3:7"
          ]
        },
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الرَّاسِخُونَ فِي الْعِلْمِ أَمِيرُ الْمُؤْمِنِينَ وَ الْأَئِمَّةُ مِنْ بَعْدِهِ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad Bin Awrama, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:3#h7\">[3:7]</a> and those who are firmly rooted in knowledge</span> are Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> and the Imams<sup>asws</sup> from after him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. Al-Husayn ibn Muhammad has narrated from MuAlia ibn Muhammad from Muhammad ibn ’Uwarma from Ali ibn Hassan from ‘Abd al-Rahman ibn Kathir from abu ‘bdallah (a.s.) who has said the following. “People well-grounded in Knowledge stands for Amir al-Mu’minin Ali (a.s.) and the Imams after him.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:22",
  "kind": "verse_list"
}