{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:1:4:24",
        "titles": {
          "ar": "باب  فِي أَنَّ مَنِ اصْطَفَاهُ اللَّهُ مِنْ عِبَادِهِ وَ أَوْرَثَهُمْ كِتَابَهُ هُمُ الْأَئِمَّةُ ( عليهم السلام )",
          "en": "Chapter 24 – Regarding that the ones whom Allah<sup>azwj</sup> Chose from His<sup>azwj</sup> servants and Made them to inherit His<sup>azwj</sup> Book, they<sup>asws</sup> are the Imams<sup>asws</sup>"
        }
      }
    ],
    "index": 82,
    "local_index": 24,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:1:4:25",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ فِي كِتَابِ اللَّهِ إِمَامَانِ إِمَامٌ يَدْعُو إِلَى اللَّهِ وَ إِمَامٌ يَدْعُو إِلَى النَّارِ",
          "en": "Chapter 25 – The Imams in the Book of Allah<sup>asws</sup> are two (types of) Imams – an Imam<sup>asws</sup> calling to Allah<sup>azwj</sup> and an imam calling to the Fire"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:1:4:23",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ قَدْ أُوتُوا الْعِلْمَ وَ أُثْبِتَ فِي صُدُورِهِمْ",
          "en": "Chapter 23 – The Imams<sup>asws</sup> have been Given the Knowledge and Affirmed into their<sup>asws</sup> chests"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:24",
    "titles": {
      "ar": "باب  فِي أَنَّ مَنِ اصْطَفَاهُ اللَّهُ مِنْ عِبَادِهِ وَ أَوْرَثَهُمْ كِتَابَهُ هُمُ الْأَئِمَّةُ ( عليهم السلام )",
      "en": "Chapter 24 – Regarding that the ones whom Allah<sup>azwj</sup> Chose from His<sup>azwj</sup> servants and Made them to inherit His<sup>azwj</sup> Book, they<sup>asws</sup> are the Imams<sup>asws</sup>"
    },
    "verse_count": 4,
    "verse_start_index": 560,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> (   )  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/438)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 561,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:24:1",
        "refs": {
          "Quran": [
            "/books/quran:35:31",
            "/books/quran:35:32"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عَبْدِ الْمُؤْمِنِ عَنْ سَالِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ ثُمَّ أَوْرَثْنَا الْكِتابَ الَّذِينَ اصْطَفَيْنا مِنْ عِبادِنا فَمِنْهُمْ ظالِمٌ لِنَفْسِهِ وَ مِنْهُمْ مُقْتَصِدٌ وَ مِنْهُمْ سابِقٌ بِالْخَيْراتِ بِإِذْنِ اللَّهِ قَالَ السَّابِقُ بِالْخَيْرَاتِ الْإِمَامُ وَ الْمُقْتَصِدُ الْعَارِفُ لِلْإِمَامِ وَ الظَّالِمُ لِنَفْسِهِ الَّذِي لَا يَعْرِفُ الْإِمَامَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Hammad Bin Isa, from Abdul Momin, from Salim who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:35#h32\">[35:32]</a> Then We Gave the Book as an inheritance to those whom We Chose from among Our servants; but from them is he who unjust to his own self, and of them is he who is moderate, and of them is he who is foremost in deeds of goodness</span>. He<sup>asws</sup> said: ‘The one <span class=\"ibTxt\">who is foremost in deeds of goodness</span> is the Imam<sup>asws</sup>, and the <span class=\"ibTxt\">who is moderate</span> is the recogniser of the Imam<sup>asws</sup>, and the one <span class=\"ibTxt\">unjust to his own self</span> is the one who does not recognise the Imam<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from Hammad ibn ’Isa from ’Abd al-Mu’min from Salim who has said that he asked abu Ja‘far (a.s.) about the meaning of the words of Allah, the Most Holy, the Most High. “We gave the Book as an inheritance to Our chosen servants, among whom some are unjust against their souls, some are moderate, and some are exceedingly virtuous by the permission of God. . .” <a href=\"/#/books/quran:35#h31\">[35:31]</a> The exceedingly virtuous is the Imam (a.s.), the moderateones are those who know the Imams (a.s.) and the unjust ones are those who do not know the Imams (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (439/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 562,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:24:2",
        "refs": {
          "Quran": [
            "/books/quran:35:31",
            "/books/quran:35:32"
          ]
        },
        "text": [
          "الْحُسَيْنُ عَنْ مُعَلًّى عَنِ الْوَشَّاءِ عَنْ عَبْدِ الْكَرِيمِ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِهِ تَعَالَى ثُمَّ أَوْرَثْنَا الْكِتابَ الَّذِينَ اصْطَفَيْنا مِنْ عِبادِنا فَقَالَ أَيَّ شَيْ‏ءٍ تَقُولُونَ أَنْتُمْ قُلْتُ نَقُولُ إِنَّهَا فِي الْفَاطِمِيِّينَ قَالَ لَيْسَ حَيْثُ تَذْهَبُ لَيْسَ يَدْخُلُ فِي هَذَا مَنْ أَشَارَ بِسَيْفِهِ وَ دَعَا النَّاسَ إِلَى خِلَافٍ فَقُلْتُ ",
          "فَأَيُّ شَيْ‏ءٍ الظَّالِمُ لِنَفْسِهِ قَالَ الْجَالِسُ فِي بَيْتِهِ لَا يَعْرِفُ حَقَّ الْإِمَامِ وَ الْمُقْتَصِدُ الْعَارِفُ بِحَقِّ الْإِمَامِ وَ السَّابِقُ بِالْخَيْرَاتِ الْإِمَامُ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn, from Moalla, from Al Washha, from Abdul Kareem, from Suleyman Bin Khalid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:35#h32\">[35:32]</a> Then We Gave the Book as an inheritance to those whom We Chose from among Our servants</span>. So he<sup>asws</sup> said: ‘Which thing are you saying?’ I said, ‘We are saying it is regarding the Fatimids (Descendants of Fatima<sup>asws</sup>)’. He<sup>asws</sup> said: ‘It isn’t where you are going. He isn’t included in this, the one who points by his sword and calls the people to opposition’. ",
            "So I said, ‘Which one is the <span class=\"ibTxt\">he who unjust to his own self</span>?’ He<sup>asws</sup> said: ‘The one seated in his house, not recognising a right of the Imam<sup>asws</sup>. And <span class=\"ibTxt\">he who is moderate </span>is the one who recognises a right of the Imam<sup>asws</sup>, and the one <span class=\"ibTxt\">who is foremost in deeds of goodness</span> is the Imam<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Al-Husayn has narrated from Mu‘alla from al-Washsha’ from ‘Abd al-Karim from Sulayman who has said that he asked abu ‘Abdallah (a.s.) about the meaning of the following verse of the Holy Quran. “We gave the book as an inheritance to Our chosen servants,.. .” <a href=\"/#/books/quran:35#h31\">[35:31]</a> The Imam (a.s.) asked, “What do you say about it?” I said, “We say that they are the Fatimid (descendents of Fatima, Daughter of the Holy Prophet (s.a.)” The Imam (a.s.) said, “It is not as you say. No one who would point out his sword and call people into schism and misguidance comes in this (category of people exceeding in virtue).” I then asked, “Who then are the ones doing wrong to themselves?” The Imam (a.s.) replied, “It is those who sit in their homes and do not know the rights of his Imam (a.s.). The moderate ones are those who know the rights of their Imam and the ones exceeding in virtue are the Imams (a.s.)”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (440/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 563,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:24:3",
        "refs": {
          "Quran": [
            "/books/quran:35:31",
            "/books/quran:35:32"
          ]
        },
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ عَنْ أَحْمَدَ بْنِ عُمَرَ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ ثُمَّ أَوْرَثْنَا الْكِتابَ الَّذِينَ اصْطَفَيْنا مِنْ عِبادِنا الْآيَةَ قَالَ فَقَالَ وُلْدُ فَاطِمَةَ ( عليها السلام ) وَ السَّابِقُ بِالْخَيْرَاتِ الْإِمَامُ وَ الْمُقْتَصِدُ الْعَارِفُ بِالْإِمَامِ وَ الظَّالِمُ لِنَفْسِهِ الَّذِي لَا يَعْرِفُ الْإِمَامَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan, from Ahmad Bin Umar who said, ",
            "‘I asked Abu Al-Hassan Al-Reza<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:35#h32\">[35:32]</a> Then We Gave the Book as an inheritance to those whom We Chose from among Our servants</span> – the Verse. So he<sup>asws</sup> said: ‘Children of Fatima<sup>asws</sup>. And the one <span class=\"ibTxt\">who is foremost in deeds of goodness</span> is the Imam<sup>asws</sup>, and <span class=\"ibTxt\">he who is moderate </span>is the one who recognises a right of the Imam<sup>asws</sup>, and the one <span class=\"ibTxt\">unjust to his own self</span> is the one who does not recognise the Imam<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Hassan from Ahmad ibn ‘Umar who has said that he asked abu al-Hassan al-Rida (a.s.) about the meaning of the words of Allah, the Most Holy, the Most High. “We gave the book as an inheritance to Our chosen servants. .” <a href=\"/#/books/quran:35#h31\">[35:31]</a>. The Imam (a.s.) said such people are the children of Fatima (a.s.), those exceeding in virtue are the Imams (a.s.), the moderate ones are those who know the Imam (a.s.) and those who do injustice to themselves are the ones who do not know their Imam (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/440)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 564,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:24:4",
        "refs": {
          "Quran": [
            "/books/quran:2:121"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ آتَيْناهُمُ الْكِتابَ يَتْلُونَهُ حَقَّ تِلاوَتِهِ أُولئِكَ يُؤْمِنُونَ بِهِ قَالَ هُمُ الْأَئِمَّةُ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Wallad who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h121\">[2:121]</a> Those to whom We have Given the Book recite it as it ought to be recited. They believe in it</span>. He<sup>asws</sup> said: ‘They<sup>asws</sup> are the Imams<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from abu Wallad who has said that he asked abu ‘Abdallah (a.s.) about the meaning of the words of Allah, the Most Holy, the Most High. “The people who have received Our Book (Quran), and read it thoroughly, believe in it. Those who disbelieve the Book are certainly losers.” <a href=\"/#/books/quran:2#h121\">[2:121]</a> The Imams (a.s.) said that such people are the Imams (a.s.).”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:24",
  "kind": "verse_list"
}