{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:1:4:25",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ فِي كِتَابِ اللَّهِ إِمَامَانِ إِمَامٌ يَدْعُو إِلَى اللَّهِ وَ إِمَامٌ يَدْعُو إِلَى النَّارِ",
          "en": "Chapter 25 – The Imams in the Book of Allah<sup>asws</sup> are two (types of) Imams – an Imam<sup>asws</sup> calling to Allah<sup>azwj</sup> and an imam calling to the Fire"
        }
      }
    ],
    "index": 83,
    "local_index": 25,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 26"
        },
        "path": "/books/al-kafi:1:4:26",
        "titles": {
          "ar": "بَابُ أَنَّ الْقُرْآنَ يَهْدِي لِلْإِمَامِ",
          "en": "Chapter 26 – The Quran Guides to the Imams<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:1:4:24",
        "titles": {
          "ar": "باب  فِي أَنَّ مَنِ اصْطَفَاهُ اللَّهُ مِنْ عِبَادِهِ وَ أَوْرَثَهُمْ كِتَابَهُ هُمُ الْأَئِمَّةُ ( عليهم السلام )",
          "en": "Chapter 24 – Regarding that the ones whom Allah<sup>azwj</sup> Chose from His<sup>azwj</sup> servants and Made them to inherit His<sup>azwj</sup> Book, they<sup>asws</sup> are the Imams<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:25",
    "titles": {
      "ar": "بَابُ أَنَّ الْأَئِمَّةَ فِي كِتَابِ اللَّهِ إِمَامَانِ إِمَامٌ يَدْعُو إِلَى اللَّهِ وَ إِمَامٌ يَدْعُو إِلَى النَّارِ",
      "en": "Chapter 25 – The Imams in the Book of Allah<sup>asws</sup> are two (types of) Imams – an Imam<sup>asws</sup> calling to Allah<sup>azwj</sup> and an imam calling to the Fire"
    },
    "verse_count": 2,
    "verse_start_index": 564,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (442/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 565,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:25:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ يَوْمَ نَدْعُوا كُلَّ أُناسٍ بِإِمامِهِمْ قَالَ الْمُسْلِمُونَ يَا رَسُولَ اللَّهِ أَ لَسْتَ إِمَامَ النَّاسِ كُلِّهِمْ أَجْمَعِينَ قَالَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنَا رَسُولُ اللَّهِ إِلَى النَّاسِ أَجْمَعِينَ وَ لَكِنْ سَيَكُونُ مِنْ بَعْدِي أَئِمَّةٌ عَلَى النَّاسِ مِنَ اللَّهِ مِنْ أَهْلِ بَيْتِي يَقُومُونَ فِي النَّاسِ فَيُكَذَّبُونَ وَ يَظْلِمُهُمْ أَئِمَّةُ الْكُفْرِ وَ الضَّلَالِ وَ أَشْيَاعُهُمْ ",
          "فَمَنْ وَالَاهُمْ وَ اتَّبَعَهُمْ وَ صَدَّقَهُمْ فَهُوَ مِنِّي وَ مَعِي وَ سَيَلْقَانِي أَلَا وَ مَنْ ظَلَمَهُمْ وَ كَذَّبَهُمْ فَلَيْسَ مِنِّي وَ لَا مَعِي وَ أَنَا مِنْهُ بَرِي‏ءٌ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Abdullah Bin Ghalib, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When this Verse was Revealed <span class=\"ibTxt\">[17:71] The Day when We will Call every human being with their Imam</span>, the Muslims said, ‘O Rasool-Allah<sup>saww</sup>! Aren’t you<sup>saww</sup> the Imam of the people, all of them in their entirety?’ So Rasool-Allah<sup>saww</sup> said: ‘I<sup>saww</sup> am a Rasool<sup>saww</sup> of Allah<sup>azwj</sup> to the people in their entirety, but there shall be coming from after me<sup>saww</sup>, Imams<sup>asws</sup> upon the people from Allah<sup>azwj</sup>, from the People<sup>asws</sup> of my<sup>saww</sup> Household, who would be standing among the people. So they would be belying them<sup>asws</sup> and oppressing them<sup>asws</sup>, the imams of the disbelief and the straying, and their adherents. ",
            "So the one who befriends them<sup>asws</sup>, and follows them<sup>asws</sup>, and ratifies them<sup>asws</sup>, so he is from me<sup>saww</sup>, and with me<sup>saww</sup>, and would be meeting me<sup>saww</sup>. Indeed! The one who oppresses them<sup>asws</sup> and belies them<sup>asws</sup>, so he is neither from me<sup>saww</sup>, nor with me<sup>saww</sup>, and I<sup>saww</sup> disavow from him’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from ‘Abdallah ibn Ghalib from Jabir from abu Ja‘far (a.s.) who has said the following. “When the following verse of the Holy Quran was revealed, “On the day when We call every nation with their leaders, (Imams) . .” (17:71), people asked the Holy Prophet (s.a.), ‘Are you not the Imam of all the people altogether?’ The Holy Prophet (s.a.) said, “I am the Messenger of Allah to all the people but after me there will the Imams for the people from my family. They will rise among the people but they will be rejected. The leaders of the unbelievers and misguidance and their followers will do injustice to them. Those who support, love, follow and acknowledge their authority they are from me, with me and will meet me. Let it be known that those who would do injustice to the Imams (a.s) and reject them they are not from me and with me. I denounce them and all associations with them.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/443)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 566,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:25:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ إِنَّ الْأَئِمَّةَ فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ إِمَامَانِ قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى وَ جَعَلْناهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنا لَا بِأَمْرِ النَّاسِ يُقَدِّمُونَ أَمْرَ اللَّهِ قَبْلَ أَمْرِهِمْ وَ حُكْمَ اللَّهِ قَبْلَ حُكْمِهِمْ ",
          "قَالَ وَ جَعَلْناهُمْ أَئِمَّةً يَدْعُونَ إِلَى النَّارِ يُقَدِّمُونَ أَمْرَهُمْ قَبْلَ أَمْرِ اللَّهِ وَ حُكْمَهُمْ قَبْلَ حُكْمِ اللَّهِ وَ يَأْخُذُونَ بِأَهْوَائِهِمْ خِلَافَ مَا فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad and Muhammad Bin Al Husayn, from Muhammad Bin Yahya, from Talha Bin Zayd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Imams in the Book of Allah<sup>azwj</sup> Mighty and Majestic are two Imams. Allah<sup>azwj</sup> Blessed and High Said <span class=\"ibTxt\">[21:73] And We made them Imams who are guiding by Our Command</span>, not by the orders of the people. They are placing forward the Commands of Allah<sup>azwj</sup> before their<sup>asws</sup> own orders, and the Decision of Allah<sup>azwj</sup> before their<sup>asws</sup> own decisions. ",
            "He<sup>azwj</sup> Said <span class=\"ibTxt\">[28:41] And We Made them Imams who call to the Fire</span>. They are placing forwards their own orders before the Commands of Allah<sup>azwj</sup>, and their own decisions before the Decision of Allah<sup>azwj</sup>, and they are taking to their own desires in opposition to what is in the Book of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Muhammad ibn al-Husayn from Muhammad ibn Yahya from Talha ibn Zayd from abu ‘Abdallah (a.s.) who has said the following. “The Imams mentioned in the book of Allah, the Most Holy, the Most High, are of two kinds. Allah, the Most Holy, the Most High has said, ‘We appointed them as leaders (Imams) to guide the people through Our command . .” (21:73) They do so but not because of the commads of the people. They allow our command to come first and before their own orders, and our laws before their own laws and judgment. “We made them the kinds of leaders (Imams) who would invite people to the fire . .” (28:41) ‘They let their own commands to come before the commands of Allah and their laws before the laws of Allah. They follow their desires against what the book of Allah, the Most Holy, the Most High requires.’”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:25",
  "kind": "verse_list"
}