{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:1:4:27",
        "titles": {
          "ar": "بَابُ أَنَّ النِّعْمَةَ الَّتِي ذَكَرَهَا اللَّهُ عَزَّ وَ جَلَّ فِي كِتَابِهِ الْأَئِمَّةُ ( عليهم السلام )",
          "en": "Chapter 27 – The Favour (النِّعْمَةَ) which Allah<sup>azwj</sup> Mighty and Majestic Mentioned in His<sup>azwj</sup> Book, are the Imams<sup>asws</sup>"
        }
      }
    ],
    "index": 85,
    "local_index": 27,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:27",
    "titles": {
      "ar": "بَابُ أَنَّ النِّعْمَةَ الَّتِي ذَكَرَهَا اللَّهُ عَزَّ وَ جَلَّ فِي كِتَابِهِ الْأَئِمَّةُ ( عليهم السلام )",
      "en": "Chapter 27 – The Favour (النِّعْمَةَ) which Allah<sup>azwj</sup> Mighty and Majestic Mentioned in His<sup>azwj</sup> Book, are the Imams<sup>asws</sup>"
    },
    "verse_count": 4,
    "verse_start_index": 568,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (446/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 569,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:27:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنِ الْمُعَلَّى بْنِ مُحَمَّدٍ عَنْ بِسْطَامَ بْنِ مُرَّةَ عَنْ إِسْحَاقَ بْنِ حَسَّانَ عَنِ الْهَيْثَمِ بْنِ وَاقِدٍ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ الْعَبْدِيِّ عَنْ سَعْدٍ الْإِسْكَافِ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَا بَالُ أَقْوَامٍ غَيَّرُوا سُنَّةَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَدَلُوا عَنْ وَصِيِّهِ لَا يَتَخَوَّفُونَ أَنْ يَنْزِلَ بِهِمُ الْعَذَابُ ",
          "ثُمَّ تَلَا هَذِهِ الْآيَةَ أَ لَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا نِعْمَتَ اللَّهِ كُفْراً وَ أَحَلُّوا قَوْمَهُمْ دارَ الْبَوارِ جَهَنَّمَ ",
          "ثُمَّ قَالَ نَحْنُ النِّعْمَةُ الَّتِي أَنْعَمَ اللَّهُ بِهَا عَلَى عِبَادِهِ وَ بِنَا يَفُوزُ مَنْ فَازَ يَوْمَ الْقِيَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Al Moalla Bin Muhammad, from Bastam Bin Murra, from Is’haq Bin Hassan, from Al Haysam Bin Waqid, from Ali Bin Al Husayn Al Abdy, from Sa’d Al Askaf, from Al Asbagh Bin Nubata who said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘What is the matter with a people who are changing the <span class=\"iTxt\">Sunnah</span> of Rasool-Allah<sup>saww</sup> and are turning away from his<sup>saww</sup> bequest? Are they not fearing that the Punishment might descend upon them?’",
            "Then he<sup>asws</sup> recited the Verse <span class=\"ibTxt\">[14:28] Have you not seen those who have changed Allah's Favour for ungratefulness and made their people to alight into the abode of perdition [14:29] into Hell</span>?’",
            "Then he<sup>asws</sup> said: ‘We<sup>asws</sup> are the Favour which Allah<sup>azwj</sup> has Favoured with upon His<sup>azwj</sup> servants, and with us<sup>asws</sup> will be the successful ones, who would succeed on the Day of Judgment’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Bistam ibn Murrah from Ishaq ibn Hassa’n from al-Haytham ibn Waqid from Ali ibn al-Husayn al-‘Abdi from Sa‘d al-’Iskaf from al-Asbagh ibn Nubatah from Amir al-Mu’minin Ali (a.s.) who has said the following. “What isd wrong with people who changed the Sunnah (traditions) of the Messenger of Allah and deviated from his will? Do they not fear that sever suffering may befall them? He then recited the following verse of the Holy Quran. “Have you not seen (considered) those who changed the blessings (Word) of God through disbelief and led their people to destruction? (14:28). They will suffer in Hell. What a terrible place to stay! (14:29). He then said, “We are the blessings of Allah which He has granted to people. Through us will succede those will be successful on the Day of Judgment.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (447/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 570,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:27:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ رَفَعَهُ فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ أَ بِالنَّبِيِّ أَمْ بِالْوَصِيِّ تُكَذِّبَانِ نَزَلَتْ فِي الرَّحْمَنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad raising, ",
            "(He<sup>asws</sup> said): ‘With regards to the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[55:13] Which then of the Favours of your Lord will you two deny?</span> Is it with the Prophet<sup>saww</sup> or with the successor<sup>asws</sup> will you two deny?’ It was Revealed in (Surah) Al-Rahman."
          ],
          "en.sarwar": [
            " 2. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad, in a mafu‘ manner, (rafa’ahu) about the words of Allah, the Most Holy, the Most High. “(Jinn and mankind) - which of the favors of your Lord do you deny?” (55:13) Will you deny and refuse the Holy Prophet or his successor.” (This verse has come down in Ch 55 al-Rahman.)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (448/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 571,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:27:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنِ الْهَيْثَمِ بْنِ وَاقِدٍ عَنْ أَبِي يُوسُفَ الْبَزَّازِ قَالَ تَلَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَذِهِ الْآيَةَ فَاذْكُرُوا آلاءَ اللَّهِ قَالَ أَ تَدْرِي مَا آلَاءُ اللَّهِ قُلْتُ لَا قَالَ هِيَ أَعْظَمُ نِعَمِ اللَّهِ عَلَى خَلْقِهِ وَ هِيَ وَلَايَتُنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moallad Bin Muhammad, from Muhammad Bin Jamhour, from Abdullah Bin Abdul Rahman, from Al Haysam Bin Waqid, from Abu Yusuf Al Bazzal who said, ",
            "‘Abu Abdullah<sup>asws</sup> recited this Verse <span class=\"ibTxt\">[7:69] therefore remember the Favours of Allah, that you may be successful</span>. He<sup>asws</sup> said: ‘Do you know what is the Favour of Allah<sup>azwj</sup>?’ I said, ‘No’. He<sup>asws</sup> said: ‘It is the most Magnificent Bounty upon His<sup>azwj</sup> creatures, and it is our<sup>asws</sup> <span class=\"iTxt\">Wilayah</span>’."
          ],
          "en.sarwar": [
            " 3. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from ‘Adallah ibn ’Abd al-Rahman from al-Haytham ibn Waqid from abu Yusuf al-Bazzaz who has said that abu ‘Abdallah (a.s.) recited the following verse, “Keep in mind the bounties of Allah. .” (7:69) The Imams (a.s.) said, “Do you know what the bounties of Allah are?” I said, “No, I do not know.” He said, “It is the greatest of the bounties of Allah. It is to acknowledge the Divine authority that we possess.”"
          ]
        }
      },
      {
        "index": 572,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:27:4",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَ لَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا نِعْمَتَ اللَّهِ كُفْراً الْآيَةَ قَالَ عَنَى بِهَا قُرَيْشاً قَاطِبَةً الَّذِينَ عَادَوْا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ نَصَبُوا لَهُ الْحَرْبَ وَ جَحَدُوا وَصِيَّةَ وَصِيِّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Awrama, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[14:28] Have you not seen those who have changed Allah's Favour for ungratefulness </span>– the Verse. He<sup>asws</sup> said: ‘It Means by it the (tribe of) Qureysh as a whole who were inimical to Rasool-Allah<sup>saww</sup>, and they establish the war against him<sup>saww</sup>, and they rejected the bequest regarding his<sup>saww</sup> successor<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 4. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn ’Uwarma from Ali ibn Hassa’n from ‘Abd al-Rahman ibn Kathir who has said that he asked abu ‘Abdallah (a.s.) about the meaning of the following verse. “Have you not seen (considered) those who changed the blessings (Word) of God through disbelief and led their people to destruction?” (14:28) The Imam (a.s.) said it is a reference to all of Quraysh who exercised animosity towards the Holy Prophet (s.a.), created wars against him and rejected his will about his successor.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:27",
  "kind": "verse_list"
}