{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:1:4:28",
        "titles": {
          "ar": "بَابُ أَنَّ الْمُتَوَسِّمِينَ الَّذِينَ ذَكَرَهُمُ اللَّهُ تَعَالَى فِي كِتَابِهِ هُمُ الْأَئِمَّةُ ( عليهم السلام ) وَ السَّبِيلُ فِيهِمْ مُقِيمٌ",
          "en": "Chapter 28 – The Distinguishers whom Allah<sup>azwj</sup> the Exalted Mentioned in His<sup>azwj</sup> Book are the Imams<sup>asws</sup> and the straight way among them"
        }
      }
    ],
    "index": 86,
    "local_index": 28,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:1:4:29",
        "titles": {
          "ar": "بَابُ عَرْضِ الْأَعْمَالِ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ الْأَئِمَّةِ ( عليهم السلام )",
          "en": "Chapter 29 – The deeds are presented to the Prophet<sup>saww</sup> and the Imams<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:1:4:27",
        "titles": {
          "ar": "بَابُ أَنَّ النِّعْمَةَ الَّتِي ذَكَرَهَا اللَّهُ عَزَّ وَ جَلَّ فِي كِتَابِهِ الْأَئِمَّةُ ( عليهم السلام )",
          "en": "Chapter 27 – The Favour (النِّعْمَةَ) which Allah<sup>azwj</sup> Mighty and Majestic Mentioned in His<sup>azwj</sup> Book, are the Imams<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:28",
    "titles": {
      "ar": "بَابُ أَنَّ الْمُتَوَسِّمِينَ الَّذِينَ ذَكَرَهُمُ اللَّهُ تَعَالَى فِي كِتَابِهِ هُمُ الْأَئِمَّةُ ( عليهم السلام ) وَ السَّبِيلُ فِيهِمْ مُقِيمٌ",
      "en": "Chapter 28 – The Distinguishers whom Allah<sup>azwj</sup> the Exalted Mentioned in His<sup>azwj</sup> Book are the Imams<sup>asws</sup> and the straight way among them"
    },
    "verse_count": 5,
    "verse_start_index": 572,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 573,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:28:1",
        "refs": {
          "Mentions": [
            "/books/quran:15:76",
            "/books/quran:15:75"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ مِهْرَانَ</span> عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ الْحَسَنِيِّ عَنِ ابْنِ أَبِي عُمَيْرٍ قَالَ أَخْبَرَنِي أَسْبَاطٌ بَيَّاعُ الزُّطِّيِّ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلَهُ رَجُلٌ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ فِي ذلِكَ لَآياتٍ لِلْمُتَوَسِّمِينَ وَ إِنَّها لَبِسَبِيلٍ مُقِيمٍ قَالَ فَقَالَ نَحْنُ الْمُتَوَسِّمُونَ وَ السَّبِيلُ فِينَا مُقِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Abdul Azeem Bin Abdullah Al Hasany, from Ibn Abu Umeyr who said, ‘Asbat Baya’a Al Zatty informed me saying, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup> and a man asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h75\">[15:75]</a> Surely, in this are Signs for the distinguishers (of the marks) <a href=\"/#/books/quran:15#h76\">[15:76]</a> And surely it is on a road that still abides</span>. So he<sup>asws</sup> said: ‘We<sup>asws</sup> are the distinguishers, and the way abides in us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 1. Ahmad ibn Mahran has narrated from ‘Abd al-‘Azim ibn ‘Abdallah al-Hasani from ibn abu‘Umayr who has said the following. “Asbat Bayya‘ al-Zattiyy has said that once he was in the presence of abu ‘Abdallah (a.s.) when a man asked him about the meaning of the following words of Allah, the Most Holy, the Most High. “In this there is evidence (of the Truth) for the distinguished ones. <a href=\"/#/books/quran:15#h75\">[15:75]</a> That town lies on a road which still exists <a href=\"/#/books/quran:15#h76\">[15:76]</a> The Imam (a.s.) said, “We are the distiguished people and the (right) path is with us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 574,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:28:2",
        "refs": {
          "Mentions": [
            "/books/quran:15:75"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ يَحْيَى بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنِي أَسْبَاطُ بْنُ سَالِمٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَدَخَلَ عَلَيْهِ رَجُلٌ مِنْ أَهْلِ هِيتٍ فَقَالَ لَهُ أَصْلَحَكَ اللَّهُ مَا تَقُولُ فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ فِي ذلِكَ لَآياتٍ لِلْمُتَوَسِّمِينَ قَالَ نَحْنُ الْمُتَوَسِّمُونَ وَ السَّبِيلُ فِينَا مُقِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Yahya Bin Ibrahim who said, ‘Asbat Bin Salim narrated to me saying, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, and a man from the people of Hayt came over to him<sup>asws</sup>, and he said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! What are you<sup>asws</sup> saying regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h75\">[15:75]</a> Surely, in this are Signs for the distinguishers (of the marks)</span>?’ He<sup>asws</sup> said: ‘We<sup>asws</sup> are the distinguishers, and the way, it abides in us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Salamah ibn al-Khattab that Yahya ibn Ibrahim who has said the following. “Asbat ibn Salim has said that once he was in the presence of abu ‘Abdallah (a.s.) when a man from the people of Hiyt came and said, ‘May grant yopu well-being, what is the meaning of the words of Allah, the Most Holy, “In this there is evidence (of the Truth) for the distinguished ones.”? <a href=\"/#/books/quran:15#h75\">[15:75]</a> The Imam (a.s.) said, “We are the distiguished people and the (right) path is with us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 575,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:28:3",
        "refs": {
          "Mentions": [
            "/books/quran:15:75"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ فِي ذلِكَ لَآياتٍ لِلْمُتَوَسِّمِينَ قَالَ هُمُ الْأَئِمَّةُ ( عليهم السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) اتَّقُوا فِرَاسَةَ الْمُؤْمِنِ فَإِنَّهُ يَنْظُرُ بِنُورِ اللَّهِ عَزَّ وَ جَلَّ فِي قَوْلِ اللَّهِ تَعَالَى إِنَّ فِي ذلِكَ لَآياتٍ لِلْمُتَوَسِّمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazan, from Hammad Bin Isa, from Rabie Bin Abdullah, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h75\">[15:75]</a> Surely, in this are Signs for the distinguishers (of the marks)</span>. He<sup>asws</sup> said: ‘They<sup>asws</sup> are the Imams<sup>asws</sup>. Rasool-Allah<sup>saww</sup> said: ‘Fear the discernment of the Momin, for he looks by a Light of Allah<sup>azwj</sup> Mighty and Majestic in the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h75\">[15:75]</a> Surely, in this are Signs for the distinguishers (of the marks)</span>’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Hammad ibn ’Isa from Rib’i ibn ‘Abdallah from Muhammad ibn Muslim from abu Ja‘far (a.s.) who has said the following about the words of Allah, the Most Holy, the Most High. “In this there is evidence (of the Truth) for the distinguished ones.” <a href=\"/#/books/quran:15#h75\">[15:75]</a> “The Imam (a.s.) said, “The distinguished people are the Imams (a.s.) the Holy Prophet has said, “Be on your guard from the intelligence of the believers. He lookss through the light of Allah, the Most Holy, the Most High as mentioned in, “In this there is evidence (of the Truth) for the distinguished ones.” <a href=\"/#/books/quran:15#h75\">[15:75]</a>"
          ]
        }
      },
      {
        "index": 576,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:28:4",
        "refs": {
          "Mentions": [
            "/books/quran:15:76",
            "/books/quran:15:75"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُبَيْسِ بْنِ هِشَامٍ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ فِي ذلِكَ لَآياتٍ لِلْمُتَوَسِّمِينَ فَقَالَ هُمُ الْأَئِمَّةُ ( عليهم السلام ) وَ إِنَّها لَبِسَبِيلٍ مُقِيمٍ قَالَ لَا يَخْرُجُ مِنَّا أَبَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Hassan Bin Ali Al Kufy, from Ubeys Bin Hisham, from Abdullah Bin Suleyman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h75\">[15:75]</a> Surely, in this are Signs for the distinguishers (of the marks)</span>. So he<sup>asws</sup> said: ‘They<sup>asws</sup> are the Imams<sup>asws</sup>’. (And for) <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h76\">[15:76]</a> And surely it is on a road that still abides</span>, he<sup>asws</sup> said: ‘It will not exit from us<sup>asws</sup>, ever!’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from al-Hasan ibn Ali al-Kufi from ‘Ubays ibn Hisham from ‘Adallah ibn Sulayman from abu ‘Abdallah (a.s.) who has said the following about the words of Allah, the Most Holy, the Most High. “In this there is evidence (of the Truth) for the distinguished ones.” <a href=\"/#/books/quran:15#h75\">[15:75]</a> The Imams (a.s.) said, “These people are the Imams (a.s.) and the evidence will never depart us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> لم يذكر عنده شي ء  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 577,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:28:5",
        "refs": {
          "Mentions": [
            "/books/quran:15:75"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ إِبْرَاهِيمَ بْنِ أَيُّوبَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى إِنَّ فِي ذلِكَ لَآياتٍ لِلْمُتَوَسِّمِينَ قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمُتَوَسِّمَ وَ أَنَا مِنْ بَعْدِهِ وَ الْأَئِمَّةُ مِنْ ذُرِّيَّتِي الْمُتَوَسِّمُونَ .",
          "وَ فِي نُسْخَةٍ أُخْرَى عَنْ أَحْمَدَ بْنِ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ إِبْرَاهِيمَ بْنِ أَيُّوبَ بِإِسْنَادِهِ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Aslam, from Ibrahim Bin Ayoub, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momineen</span><sup style=\"font-weight: normal\">asws</sup> said: ‘Regarding the Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h75\">[15:75]</a> Surely, in this are Signs for the distinguishers (of the marks)</span>. He<sup style=\"font-weight: normal\">asws</sup> said: ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> is the distinguisher, and I<sup style=\"font-weight: normal\">asws</sup> from after him<sup style=\"font-weight: normal\">saww</sup>, and the Imams<sup style=\"font-weight: normal\">asws</sup> from my<sup style=\"font-weight: normal\">asws</sup> offspring are the distinguishers’.",
            "<span style=\"font-size: small\">And in another copy, from Ahmad Bin Mihran, from Muhammad Bin Ali, from Muhammad Bin Aslam, from Ibrahim Bin Ayoub, by his chain </span>– similar to it."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Aslam from Ibrahim ibn Ayyub from ‘Amr ibn Shamir from Jabir from abu Ja‘far (a.s.) who has said the following. “Amir al-Mu’minin Ali (a.s.) has the following about the words of Allah, the Most Holy, the Most High. ““In this there is evidence (of the Truth) for the distinguished ones.” <a href=\"/#/books/quran:15#h75\">[15:75]</a> The Holy Prophet (s.a.) was the distinguieshed one and I was as such after him and the Imams from my children are the distinguieshed ones.” In a different copy it is narrated from Ahmad ibn Mahran from Muhammad ibn Ali from Muhammad ibn Aslam from Ibrahim ibn Ayyub through the chain of his nnarrators a similar Hadith."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:28",
  "kind": "verse_list"
}