{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 29"}, "path": "/books/al-kafi:1:4:29", "titles": {"ar": "بَابُ عَرْضِ الْأَعْمَالِ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ الْأَئِمَّةِ ( عليهم السلام )", "en": "Chapter 29 – The deeds are presented to the Prophet<sup>saww</sup> and the Imams<sup>asws</sup>"}}], "index": 87, "local_index": 29, "part_type": "Chapter", "path": "/books/al-kafi:1:4:29", "titles": {"ar": "بَابُ عَرْضِ الْأَعْمَالِ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ الْأَئِمَّةِ ( عليهم السلام )", "en": "Chapter 29 – The deeds are presented to the Prophet<sup>saww</sup> and the Imams<sup>asws</sup>"}, "verse_count": 6, "verse_start_index": 577, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 578, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:29:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تُعْرَضُ الْأَعْمَالُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَعْمَالُ الْعِبَادِ كُلَّ صَبَاحٍ أَبْرَارُهَا وَ فُجَّارُهَا فَاحْذَرُوهَا وَ هُوَ قَوْلُ اللَّهِ تَعَالَى اعْمَلُوا فَسَيَرَى اللَّهُ عَمَلَكُمْ وَ رَسُولُهُ وَ سَكَتَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The deeds are presented to Rasool-Allah<sup>saww</sup>, the deeds of the servants, every morning, of their righteous ones and their immoral ones. Therefore, be cautious of it, and these are the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\">[9:105] And say: Work; so Allah will See your work and (so will) His Rasool</span>’, and was silent’."]}}, {"index": 579, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:29:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ عَبْدِ الْحَمِيدِ الطَّائِيِّ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ اعْمَلُوا فَسَيَرَى اللَّهُ عَمَلَكُمْ وَ رَسُولُهُ وَ الْمُؤْمِنُونَ قَالَ هُمُ الْأَئِمَّةُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Abdul Al Hameed Al Tai’y, from Yaqoub Bin Shuayb who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[9:105] And say: Work; so Allah will See your work and (so will) His Rasool and the Believers</span>. He<sup>asws</sup> said: ‘They (the Believers) are the Imams<sup>asws</sup>’."]}}, {"index": 580, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:29:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ مَا لَكُمْ تَسُوءُونَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ رَجُلٌ كَيْفَ نَسُوؤُهُ فَقَالَ أَ مَا تَعْلَمُونَ أَنَّ أَعْمَالَكُمْ تُعْرَضُ عَلَيْهِ فَإِذَا رَأَى فِيهَا مَعْصِيَةً سَاءَهُ ذَلِكَ فَلَا تَسُوءُوا رَسُولَ اللَّهِ وَ سُرُّوهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Usman Bin Isa, from Sama’at, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘What is the matter with you all, upsetting Rasool-Allah<sup>saww</sup>?’ So the man said, ‘How are we upsetting him<sup>saww</sup>?’ So he<sup>asws</sup> said: ‘But, are you not knowing that your deeds are presented to him<sup>saww</sup>? So when he<sup>saww</sup> sees your deeds wherein is disobedience, that upsets him<sup>saww</sup>. So do not upset Rasool-Allah<sup>saww</sup> and (instead) cheer him<sup>saww</sup> up’."]}}, {"index": 581, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:29:4", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الزَّيَّاتِ عَنْ عَبْدِ اللَّهِ بْنِ أَبَانٍ الزَّيَّاتِ وَ كَانَ مَكِيناً عِنْدَ الرِّضَا ( عليه السلام ) قَالَ قُلْتُ لِلرِّضَا ( عليه السلام ) ادْعُ اللَّهَ لِي وَ لِأَهْلِ بَيْتِي فَقَالَ أَ وَ لَسْتُ أَفْعَلُ وَ اللَّهِ إِنَّ أَعْمَالَكُمْ لَتُعْرَضُ عَلَيَّ فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ ", "قَالَ فَاسْتَعْظَمْتُ ذَلِكَ فَقَالَ لِي أَ مَا تَقْرَأُ كِتَابَ اللَّهِ عَزَّ وَ جَلَّ وَ قُلِ اعْمَلُوا فَسَيَرَى اللَّهُ عَمَلَكُمْ وَ رَسُولُهُ وَ الْمُؤْمِنُونَ قَالَ هُوَ وَ اللَّهِ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) ."], "translations": {"en.hubeali": ["Ali, from his father, from Al Qasim Bin Muhammad, from Al Zayyat, ", "(It has been narrated) from Abdullah Bin Aban Al-Zayat, and he was staying with Al-Reza<sup>asws</sup> (as a guest), said, ‘I said to Al-Reza<sup>asws</sup>, ‘Supplicate to Allah<sup>azwj</sup> for me and for the people of my household’. So he<sup>asws</sup> said: ‘Aren’t I<sup>asws</sup> doing so already? By Allah<sup>azwj</sup>! Your deeds get presented to me<sup>asws</sup> during every day and night’. ", "He (the narrator) said, ‘So that was grievous upon me, so he<sup>asws</sup> said to me: ‘But, have you not read the Book of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[9:105] And say: Work; so Allah will See your work and (so will) His Rasool and the Believers</span>? He<sup>asws</sup>, by Allah<sup>azwj</sup>, (the Believer) is Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>’."]}}, {"index": 582, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:29:5", "text": ["أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِي عَبْدِ اللَّهِ الصَّامِتِ عَنْ يَحْيَى بْنِ مُسَاوِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ ذَكَرَ هَذِهِ الْآيَةَ فَسَيَرَى اللَّهُ عَمَلَكُمْ وَ رَسُولُهُ وَ الْمُؤْمِنُونَ قَالَ هُوَ وَ اللَّهِ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) ."], "translations": {"en.hubeali": ["Ahmad Bin Mihran, from Muhammad Bin Ali, from Abu Abdullah Al Sammat, from Yahya Bin Masawir, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>. This Verse was mentioned <span class=\"ibTxt\">[9:105] And say: Work; so Allah will See your work and (so will) His Rasool and the Believers</span>. He<sup>asws</sup> said: ‘He<sup>asws</sup>, by Allah<sup>azwj</sup>, is Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>’."]}}, {"index": 583, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:29:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ قَالَ سَمِعْتُ الرِّضَا ( عليه السلام ) يَقُولُ إِنَّ الْأَعْمَالَ تُعْرَضُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَبْرَارَهَا وَ فُجَّارَهَا ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Washha who said, ", "‘I heard Al-Reza<sup>asws</sup> saying: ‘The deeds get presented to Rasool-Allah<sup>saww</sup>, its righteous ones and its immoral ones’."]}}]}, "index": "al-kafi:1:4:29", "kind": "verse_list"}