{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:1:4:3",
        "titles": {
          "ar": "بَابُ الْفَرْقِ بَيْنَ الرَّسُولِ وَ النَّبِيِّ وَ الْمُحَدَّثِ",
          "en": "Chapter 3 – The difference between the Rasool<sup>as</sup>, and the Prophet<sup>as</sup>, and the Muhaddith"
        }
      }
    ],
    "index": 61,
    "local_index": 3,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:1:4:4",
        "titles": {
          "ar": "بَابُ أَنَّ الْحُجَّةَ لَا تَقُومُ لِلَّهِ عَلَى خَلْقِهِ إِلَّا بِإِمَامٍ",
          "en": "Chapter 4 – The Divine Authority cannot be established for Allah<sup>azwj</sup> upon His<sup>azwj</sup> creatures except by an Imam<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:1:4:2",
        "titles": {
          "ar": "بَابُ طَبَقَاتِ الْأَنْبِيَاءِ وَ الرُّسُلِ وَ الْأَئِمَّةِ ( عليهم السلام )",
          "en": "Chapter 2 – The categories of the Prophets<sup>asws</sup>, and the Rasools<sup>as</sup>, and the Imams<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:3",
    "titles": {
      "ar": "بَابُ الْفَرْقِ بَيْنَ الرَّسُولِ وَ النَّبِيِّ وَ الْمُحَدَّثِ",
      "en": "Chapter 3 – The difference between the Rasool<sup>as</sup>, and the Prophet<sup>as</sup>, and the Muhaddith"
    },
    "verse_count": 5,
    "verse_start_index": 436,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (287/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 437,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:3:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ كانَ رَسُولًا نَبِيًّا مَا الرَّسُولُ وَ مَا النَّبِيُّ قَالَ النَّبِيُّ الَّذِي يَرَى فِي مَنَامِهِ وَ يَسْمَعُ الصَّوْتَ وَ لَا يُعَايِنُ الْمَلَكَ وَ الرَّسُولُ الَّذِي يَسْمَعُ الصَّوْتَ وَ يَرَى فِي الْمَنَامِ وَ يُعَايِنُ الْمَلَكَ ",
          "قُلْتُ الْإِمَامُ مَا مَنْزِلَتُهُ قَالَ يَسْمَعُ الصَّوْتَ وَ لَا يَرَى وَ لَا يُعَايِنُ الْمَلَكَ ثُمَّ تَلَا هَذِهِ الْآيَةَ وَ ما أَرْسَلْنا مِنْ قَبْلِكَ مِنْ رَسُولٍ وَ لا نَبِيٍّ وَ لَا مُحَدَّثٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ahmad Bin Muhammad Bin Abu Nasr, from Sa’alba Bin Maymoun, from Zurara who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[19:51] and he was a Rasool, a Prophet</span>, ‘What is the Rasool<sup>as</sup>, and what is the Prophet<sup>as</sup>?’ He<sup>asws</sup> said: ‘The Prophet<sup>as</sup> is the one who sees in his<sup>as</sup> dream, and hears the voice and does not see the Angel; and the Rasool<sup>as</sup> is the one who hears the voice, and sees in the dream, and see the Angel’.",
            "I said, ‘The Imam<sup>asws</sup>, what is his<sup>asws</sup> status?’ He<sup>asws</sup> said: ‘He<sup>asws</sup> hears the voice, and does not see (in the dream) and does not see the Angel (while awake)’. Then he<sup>asws</sup> recited this Verse <span class=\"ibTxt\">[22:52] And We did not Send any Rasool or Prophet, or a Muhaddith before you</span>’ (Please note that the word ‘Muhaddith’ is missing from this Verse in the current version of the Quran)."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad ibn from Ahmad ibn Muhammad ibn abu Nasr from Tha‘laba ibn Maymun from Zurara who has said the following “I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most Holy, the Most High, ‘He was a messenger, a prophet’. What is a messenger and what is a prophet?’” The Imam said, “A prophet is one who sees things in his dream and hears the voice but does not see the angel. The messenger is one who hears the voice, in his dreams and sees the angel.” I then said, “What is the position of the Imam?” The Imam (a.s.) said, “He hears the voice but does not see and observe the angel” Then he recited the following verse of the Holy Quran. ‘Satan would try to tamper with the desires of every Prophet or Messenger or Muhaddith (Muhaddith is a commentary of Imam (a.s.), whom We sent . .’” (22:52)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (288/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 438,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:3:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ قَالَ كَتَبَ الْحَسَنُ بْنُ الْعَبَّاسِ الْمَعْرُوفِيُّ إِلَى الرِّضَا ( عليه السلام ) جُعِلْتُ فِدَاكَ أَخْبِرْنِي مَا الْفَرْقُ بَيْنَ الرَّسُولِ وَ النَّبِيِّ وَ الْإِمَامِ قَالَ فَكَتَبَ أَوْ قَالَ الْفَرْقُ بَيْنَ الرَّسُولِ وَ النَّبِيِّ وَ الْإِمَامِ أَنَّ الرَّسُولَ الَّذِي يُنْزَلُ عَلَيْهِ جَبْرَئِيلُ فَيَرَاهُ وَ يَسْمَعُ كَلَامَهُ وَ يُنْزَلُ عَلَيْهِ الْوَحْيُ وَ رُبَّمَا رَأَى فِي مَنَامِهِ نَحْوَ رُؤْيَا إِبْرَاهِيمَ ( عليه السلام ) وَ النَّبِيُّ رُبَّمَا سَمِعَ الْكَلَامَ وَ رُبَّمَا رَأَى الشَّخْصَ وَ لَمْ يَسْمَعْ وَ الْإِمَامُ هُوَ الَّذِي يَسْمَعُ الْكَلَامَ وَ لَا يَرَى الشَّخْصَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marra who said, ",
            "‘Abu Al-Hassan Bin Al-Abbas Al-Maroufi wrote to Al-Reza<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Inform me, what is the difference between the Rasool<sup>as</sup>, and the Prophet<sup>as</sup>, and the Imam<sup>asws</sup>?’ He said, ‘So he<sup>asws</sup> wrote, or said: ‘The difference between the Rasool<sup>as</sup>, and the Prophet<sup>as</sup>, and the Imam<sup>asws</sup> is that the Rasool<sup>as</sup> is one Jibraeel<sup>as</sup> descends unto. So he<sup>as</sup> sees him<sup>as</sup> and hears his<sup>as</sup> speech, and the Revelation descends unto him<sup>as</sup>, and sometimes he<sup>as</sup> sees in his<sup>as</sup> dream approximately a dream of Ibrahim<sup>as</sup>; and the Prophet<sup>as</sup> sometimes hears the speech, and sometimes sees the person and does not hear; and the Imam<sup>asws</sup>, he<sup>asws</sup> is one who hears the speech and does not see the person’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Ibrahim has narrated from his father from Isma‘il ibn Marrar who has said the following “Al-Hassan ibn al-‘Abbass al-Ma‘rufi wrote to Imam al-Rida (a.s.). “May Allah take my soul in service for your cause, explain to me the difference between the messengers, the prophets and the Imams.” The Imam said or wrote, “ The difference between the messengers, the prophets and the Imams is that a messenger is one to whom Jibril (Gabriel) comes. He sees Jibril and hears his speech and Jibril (the angel) brings him (Divine) revelation and sometimes he may see in his dream like the dream of Abraham (a.s.). A prophet is one who may hear the speech and may see the person or may not hear. The Imam is the one who hears the speech but does not see the person.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/289)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (24/ 1)"
        ],
        "index": 439,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:3:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ الْأَحْوَلِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الرَّسُولِ وَ النَّبِيِّ وَ الْمُحَدَّثِ قَالَ الرَّسُولُ الَّذِي يَأْتِيهِ جَبْرَئِيلُ قُبُلًا فَيَرَاهُ وَ يُكَلِّمُهُ فَهَذَا الرَّسُولُ وَ أَمَّا النَّبِيُّ فَهُوَ الَّذِي يَرَى فِي مَنَامِهِ نَحْوَ رُؤْيَا إِبْرَاهِيمَ وَ نَحْوَ مَا كَانَ رَأَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ أَسْبَابِ النُّبُوَّةِ قَبْلَ الْوَحْيِ حَتَّى أَتَاهُ جَبْرَئِيلُ ( عليه السلام ) مِنْ عِنْدِ اللَّهِ بِالرِّسَالَةِ ",
          "وَ كَانَ مُحَمَّدٌ ( صلى الله عليه وآله ) حِينَ جُمِعَ لَهُ النُّبُوَّةُ وَ جَاءَتْهُ الرِّسَالَةُ مِنْ عِنْدِ اللَّهِ يَجِيئُهُ بِهَا جَبْرَئِيلُ وَ يُكَلِّمُهُ بِهَا قُبُلًا وَ مِنَ الْأَنْبِيَاءِ مَنْ جُمِعَ لَهُ النُّبُوَّةُ وَ يَرَى فِي مَنَامِهِ وَ يَأْتِيهِ الرُّوحُ وَ يُكَلِّمُهُ وَ يُحَدِّثُهُ مِنْ غَيْرِ أَنْ يَكُونَ يَرَى فِي الْيَقَظَةِ وَ أَمَّا الْمُحَدَّثُ فَهُوَ الَّذِي يُحَدَّثُ فَيَسْمَعُ وَ لَا يُعَايِنُ وَ لَا يَرَى فِي مَنَامِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Al Ahowl who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Rasool<sup>as</sup>, and the Prophet<sup>as</sup>, and the <span class=\"iTxt\">Muhaddath</span>’. He<sup>asws</sup> said: ‘The Rasool<sup>as</sup> is one to who Jibraeel<sup>as</sup> comes to face to face. So he<sup>as</sup> sees him<sup>as</sup> and speaks to him<sup>as</sup>. So this is the Rasool<sup>as</sup>. And as for the Nabi, so he<sup>as</sup> is the one who sees in his<sup>as</sup> dream approximate to a dream of Ibrahim<sup>as</sup> and approximately what Rasool-Allah<sup>saww</sup> saw from the reasons of the Prophet-hood before the Revelation, until he<sup>saww</sup> did see Jibraeel<sup>as</sup> from the Presence of Allah<sup>azwj</sup> with the Message. ",
            "And it was so that Muhammad<sup>saww</sup>, when the Prophet-hood and the Message was gathered for him<sup>saww</sup> from the Presence of Allah<sup>azwj</sup>, Jibraeel<sup>as</sup> came over to him<sup>as</sup>, and spoke to him<sup>saww</sup> face to face; and from the Prophets<sup>as</sup> is one for whom the Prophet-hood is gathered to, and he<sup>as</sup> sees in his<sup>as</sup> dream, and the Spirit comes over to him<sup>as</sup>, and speaks to him<sup>as</sup>, and discusses with him<sup>as</sup> from without him<sup>as</sup> happening to see it while awake; and as for the <span class=\"iTxt\">Muhaddath</span>, so he<sup>asws</sup> is the one who is narrated to, so he<sup>asws</sup> hears, and does not see (while awake) nor does he<sup>asws</sup> see during his<sup>asws</sup> dream’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from al-Ahwal who has said the following. “I Asked abu Ja‘far (a.s.) about the messenger, the prophet and al-Muhaddith (one who reports Divine guidance).” The Imam (a.s.) said, “A messenger is one to whom Jibril (angel) comes openly he sees him (the angel) and speaks to him. Such person is a messenger. A prophet is one who sees in his dream something like the dream of Abraham (a.s.) or the dream of our Prophet (s.a.) about reasons for prophethood before the coming of revelation until Jibril came from Allah with to inform him that he was to be a messenger. In the case of Prophet Muhammad (s.a.) when prophethood was established in him then Jibril brought him the message that he was to be a messenger. Jibril would come and speak to him openly. Some of the prophets in whom prophethood is established they see in their dreams, the spirit comes to them, speaks and reports to them but they do not see the spirit when awake. Al-Muhaddith is one to who is reported to and he hears the reporting but does not see openly or in his dream.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (292/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 440,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:3:4",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ يَعْقُوبَ الْهَاشِمِيِّ عَنْ مَرْوَانَ بْنِ مُسْلِمٍ عَنْ بُرَيْدٍ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ عَزَّ وَ جَلَّ وَ ما أَرْسَلْنا مِنْ قَبْلِكَ مِنْ رَسُولٍ وَ لا نَبِيٍّ وَ لَا مُحَدَّثٍ "
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad and Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ali Bin Hassan, from Ibn Fazzal, from Ali Bin Yaqoub Al Hashimy, from Marwan Bin Muslim, from Bureyd, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> regarding His<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[22:52] And We did not Send any Rasool or Prophet, or a Muhaddith before you </span>(Please note that the word ‘Muhaddith’ is missing from this Verse in the current version of the Quran)."
          ],
          "en.sarwar": [
            " 4. Ahmad ibn Muhammad and Muhammad ibn Yahya have narrated from Muhammad ibn al-Husayn from Ali ibn Hassan from Faddal from Ali ibn Ya’qub al-Hashimi from Marwan ibn Muslim from Burayd who has said the following. “I asked abu Ja‘far (a.s.) about the words of Allah, the Most Holy, the Most High, “Satan would try to tamper with the desires of every Prophet or Messenger or Muhaddith (Muhaddith is a commentary of Imam (a.s.), whom We sent . .’” (22:52). I said, ““May Allah take my soul in service for your cause, the word Muhaddith does not exist in our reading. What then is the meaning of The Messenger, Prophet and Muhaddith?” The Imam (a.s.) said, “A messenger is one to whom the angel comes openly and speaks to him. A prophet is one who sees in his dream. Sometimes prophethood and messengership may exist in one person. Al-Muhaddith is one who hears the voice but does not see the person (of the angel).” I then asked, may Allah keep you well, “How would one know that what one sees in his dream is true and that it is from the angel?” The Imam (a.s.) said, “He receives help for success to know the angel. Allah has your book the last book and your Prophet the last of prophets.”"
          ]
        }
      },
      {
        "index": 441,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:3:5",
        "text": [
          "قُلْتُ جُعِلْتُ فِدَاكَ لَيْسَتْ هَذِهِ قِرَاءَتَنَا فَمَا الرَّسُولُ وَ النَّبِيُّ وَ الْمُحَدَّثُ قَالَ الرَّسُولُ الَّذِي يَظْهَرُ لَهُ الْمَلَكُ فَيُكَلِّمُهُ وَ النَّبِيُّ هُوَ الَّذِي يَرَى فِي مَنَامِهِ وَ رُبَّمَا اجْتَمَعَتِ النُّبُوَّةُ وَ الرِّسَالَةُ لِوَاحِدٍ وَ الْمُحَدَّثُ الَّذِي يَسْمَعُ الصَّوْتَ وَ لَا يَرَى الصُّورَةَ ",
          "قَالَ قُلْتُ أَصْلَحَكَ اللَّهُ كَيْفَ يَعْلَمُ أَنَّ الَّذِي رَأَى فِي النَّوْمِ حَقٌّ وَ أَنَّهُ مِنَ الْمَلَكِ قَالَ يُوَفَّقُ لِذَلِكَ حَتَّى يَعْرِفَهُ لَقَدْ خَتَمَ اللَّهُ بِكِتَابِكُمُ الْكُتُبَ وَ خَتَمَ بِنَبِيِّكُمُ الْأَنْبِيَاءَ ."
        ],
        "translations": {
          "en.hubeali": [
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! This is not our recitation. So what is the Rasool<sup>as</sup>, and the Prophet<sup>as</sup>, and the Muhaddath?’ He<sup>asws</sup> said: ‘The Rasool<sup>as</sup> is one to whom the Angel appears, so he<sup>as</sup> speaks to him<sup>as</sup>. And the Prophet<sup>as</sup>, he<sup>as</sup> is the one who sees in his<sup>as</sup> dream, and sometimes the Prophet-hood and the Message is gathered for him<sup>as</sup> to one; and the <span class=\"iTxt\">Muhaddath</span> is one<sup>asws</sup> who hears the voice, and does not see the image’. ",
            "He (the narrator) said, ‘I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! How does he<sup>as</sup> (a Prophet<sup>as</sup>) know that the one whom he<sup>as</sup> saw in his<sup>as</sup> dream, is true, and that he is from the Angels?’ He<sup>asws</sup> said: ‘He<sup>as</sup> reconciles to that until he<sup>as</sup> recognises him. Allah<sup>azwj</sup> has Ended the Books by your Book (Quran), and Ended the Prophets<sup>as</sup> by your Prophet<sup>saww</sup>’<a id=\"_ftnref442\"></a><sup>[442]</sup>. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:3",
  "kind": "verse_list"
}