{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:1:4:30",
        "titles": {
          "ar": "بَابُ أَنَّ الطَّرِيقَةَ الَّتِي حُثَّ عَلَى الِاسْتِقَامَةِ عَلَيْهَا وَلَايَةُ عَلِيٍّ ( عليه السلام ) .",
          "en": "Chapter 30 – The doctrine which it is urged to be steadfast upon is Wilayah of Ali<sup>asws</sup>"
        }
      }
    ],
    "index": 88,
    "local_index": 30,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:1:4:31",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) مَعْدِنُ الْعِلْمِ وَ شَجَرَةُ النُّبُوَّةِ وَ مُخْتَلَفُ الْمَلَائِكَةِ",
          "en": "Chapter 31 – The Imams<sup>asws</sup> are a Mine of Knowledge, and a tree of the Prophet-hood, and interchage of the Angels (where Angels come and go)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:1:4:29",
        "titles": {
          "ar": "بَابُ عَرْضِ الْأَعْمَالِ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ الْأَئِمَّةِ ( عليهم السلام )",
          "en": "Chapter 29 – The deeds are presented to the Prophet<sup>saww</sup> and the Imams<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:30",
    "titles": {
      "ar": "بَابُ أَنَّ الطَّرِيقَةَ الَّتِي حُثَّ عَلَى الِاسْتِقَامَةِ عَلَيْهَا وَلَايَةُ عَلِيٍّ ( عليه السلام ) .",
      "en": "Chapter 30 – The doctrine which it is urged to be steadfast upon is Wilayah of Ali<sup>asws</sup>"
    },
    "verse_count": 2,
    "verse_start_index": 583,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/6)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 584,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:30:1",
        "relations": {
          "Mentions": [
            "/books/quran:72:16"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ مِهْرَانَ</span> عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ الْحَسَنِيِّ عَنْ مُوسَى بْنِ مُحَمَّدٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى وَ أَنْ لَوِ اسْتَقامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْناهُمْ ماءً غَدَقاً قَالَ يَعْنِي لَوِ اسْتَقَامُوا عَلَى وَلَايَةِ عَلِيِّ بْنِ أَبِي طَالِبٍ أَمِيرِ الْمُؤْمِنِينَ وَ الْأَوْصِيَاءِ مِنْ وُلْدِهِ ( عليهم السلام ) وَ قَبِلُوا طَاعَتَهُمْ فِي أَمْرِهِمْ وَ نَهْيِهِمْ لَأَسْقَيْنَاهُمْ مَاءً غَدَقاً يَقُولُ لَأَشْرَبْنَا قُلُوبَهُمُ الْإِيمَانَ وَ الطَّرِيقَةُ هِيَ الْإِيمَانُ بِوَلَايَةِ عَلِيٍّ وَ الْأَوْصِيَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Abdul Azeem Bin Abdullah Al Hasany, from Musa Bin Muhammad, from Yunus Bin Yaqoub, from the one who mentioned it, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:72#h16\">[72:16]</a> And that if they should keep to the (right) way, We would certainly give them to drink of abundant water</span>. He<sup>asws</sup> said: ‘It Means if they (people) were to be steadfast upon the <span class=\"iTxt\">Wilayah</span> of Ali<sup>asws</sup> Bin Abu Talib Amir Al-Momineen<sup>asws</sup>, and the successors<sup>asws</sup> from his<sup>asws</sup> sons<sup>asws</sup>, and accept to be in their<sup>asws</sup> obdeince regarding their<sup>asws</sup> orders and their prohibitions, <span class=\"ibTxt\">We would certainly give them to drink of abundant water</span>, He<sup>azwj</sup> is Saying: “We<sup>azwj</sup> would Make their hearts to drink the <span class=\"iTxt\">Eman</span>”, and the doctrine, it is the belief in the <span class=\"iTxt\">Wilayah</span> of Ali<sup>asws</sup> and the successors<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 1. Ahmad ibn Mahran has narrated from ‘Abd al-‘Azim ibn ‘Abdallah al-Hassani from Musa ibn Muhammad from Yunus ibn Ya‘qub from the person whom he mentioned, from abu Ja‘far (a.s.). The Imam (a.s.) said the following about the words of Allah, the Most Holy, the Most High. “Had they (jinn and mankind) remained steadfast in their path (religion, Islam), We would certainly have given them abundant water to drink.” <a href=\"/#/books/quran:72#h16\">[72:16]</a> It means, “Had people maintained steadfastness in respecting the Divine authority of Amir al-Mu’minin Ali ibn abu Talib (a.s.), and the Divine authority of his successors from his children and agreed to obey their orders and prohibitions He would have given them abundant water. He says, We would drench their hearts with faith. The path (al-Triqa) means to have faith in the Divine authority of Amir al-Mu’minin Ali (a.s.) and his successors from his children.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 585,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:30:2",
        "relations": {
          "Mentions": [
            "/books/quran:41:30"
          ]
        },
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْحُسَيْنِ بْنِ عُثْمَانَ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ قالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقامُوا فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) اسْتَقَامُوا عَلَى الْأَئِمَّةِ وَاحِدٍ بَعْدَ وَاحِدٍ تَتَنَزَّلُ عَلَيْهِمُ الْمَلائِكَةُ أَلَّا تَخافُوا وَ لا تَحْزَنُوا وَ أَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Fazalat Bin Ayoub, from Al Husayn Bin Usman, from Abu Ayoub, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:41#h30\">[41:30]</a> (As for) those who say: Our Lord is Allah, then are steadfast</span>. So Abu Abdullah<sup>asws</sup> said: ‘They are steadfast upon the Imams<sup>asws</sup>, one after one <span class=\"ibTxt\">the Angels descend upon them, saying: Fear not, nor be grieved, and receive good news of the Paradise which you were Promised</span>’."
          ],
          "en.sarwar": [
            " 2. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from Fudala ibn Ayyub from al-Husayn ibn ‘Uthman from abu Ayyub from Muhammad ibn Muslim. He has said that he asked abu ‘Abdallah (a.s.) about the meaning of the following words of Allah, the Most Holy, the Most High. “To those who have said, ‘God is our Lord,’ and who have remained steadfast to their belief. .” The Imams (a.s.) said, “Those who remain steadfast in respecting the Divine authority of Amir al-Mu’minin Ali (a.s.) and his successors, the Imams (a.s.) one after the other then, ‘ the angels will descend saying, “Do not be afraid or grieved. Receive the glad news of the Paradise which was promised to you.’” <a href=\"/#/books/quran:41#h30\">[41:30]</a>"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:30",
  "kind": "verse_list"
}