{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:1:4:32",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) وَرَثَةُ الْعِلْمِ يَرِثُ بَعْضُهُمْ بَعْضاً الْعِلْمَ",
          "en": "Chapter 32 – The Imams<sup>asws</sup> are the inheritors of the Knowledge, inheriting the Knowledge from each other"
        }
      }
    ],
    "index": 90,
    "local_index": 32,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:32",
    "titles": {
      "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) وَرَثَةُ الْعِلْمِ يَرِثُ بَعْضُهُمْ بَعْضاً الْعِلْمَ",
      "en": "Chapter 32 – The Imams<sup>asws</sup> are the inheritors of the Knowledge, inheriting the Knowledge from each other"
    },
    "verse_count": 8,
    "verse_start_index": 588,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/11)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 589,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:32:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ عَلِيّاً ( عليه السلام ) كَانَ عَالِماً وَ الْعِلْمُ يُتَوَارَثُ وَ لَنْ يَهْلِكَ عَالِمٌ إِلَّا بَقِيَ مِنْ بَعْدِهِ مَنْ يَعْلَمُ عِلْمَهُ أَوْ مَا شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Bureyd Bin Muawiya, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Surely, Ali<sup>asws</sup> was a Knowledgeable one, and the Knowledge is inherited and the knowledgeable one will never pass away except that there would remain from after him<sup>asws</sup> the one<sup>asws</sup> who knows his<sup>asws</sup> knowledge, or whatever Allah<sup>azwj</sup> so Desires’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya al-Halabi from Burayd ibn Mu‘awiya from Muhammad ibn Muslim from abu ‘Abdallah (a.s.) who has said the following. “Ali (a.s.) was a man of knowledge and knowledge is inherited. Whenever a man of knowledge dies he leave another man of knowledge behind who possess his knowledge or whatever Allah wants.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/12)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 590,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:32:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَ الْفُضَيْلِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الْعِلْمَ الَّذِي نَزَلَ مَعَ آدَمَ ( عليه السلام ) لَمْ يُرْفَعْ وَ الْعِلْمُ يُتَوَارَثُ وَ كَانَ عَلِيٌّ ( عليه السلام ) عَالِمَ هَذِهِ الْأُمَّةِ وَ إِنَّهُ لَمْ يَهْلِكْ مِنَّا عَالِمٌ قَطُّ إِلَّا خَلَفَهُ مِنْ أَهْلِهِ مَنْ عَلِمَ مِثْلَ عِلْمِهِ أَوْ مَا شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Zurara and Al Fuzayl, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Knowledge is that which descended with Adam<sup>as</sup>. It has not been Raised (ever since). And the Knowledge is inherited, and It was so that Ali<sup>asws</sup> was a knowledgeable one of this community, and a knowledgeable one<sup>asws</sup> from us<sup>asws</sup> does not pass away at all except he<sup>asws</sup> is replaced from his<sup>asws</sup> family, one<sup>asws</sup> who knows the like his knowledge, or whatever Allah<sup>azwj</sup> so Desires’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Ibrahim has narrated from his father from Hammad ibn ’Isa from Hariz from Zurarah and al-Fudayl from abu Ja‘far (a.s.) who has said the following. “The knowledge that came with Adam was not taken away. Knowledge is inherited. Ali (a.s.) was the knowledgeable person of this nation (Muslims). No one from us have ever left this world without leaving behind one like him in knowledge or what Allah wanted.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 591,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:32:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْبَرْقِيِّ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ عَبْدِ الْحَمِيدِ الطَّائِيِّ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ الْعِلْمَ يُتَوَارَثُ وَ لَا يَمُوتُ عَالِمٌ إِلَّا وَ تَرَكَ مَنْ يَعْلَمُ مِثْلَ عِلْمِهِ أَوْ مَا شَاءَ اللَّهُ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Barqy, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Abdul Hameed Al Taiy, from Muhammad Bin Muslim who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘The knowledge is inherited, and a knowledgeable one<sup>asws</sup> does not pass away except he<sup>asws</sup> leaves one<sup>asws</sup> who knows the like of his<sup>asws</sup> knowledge, or whatever Allah<sup>azwj</sup> so Desires’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Barqi from al-Nadr ibn Suwayd from Yahya al-Halabi from ‘Abd al-Hamid al-Ta’i from Muhammad ibn Muslim from abu Ja‘far (a.s.) who has said the following. “Knowledge is inherited. No man of knowledge dies without leaving behind one who is as knowledgeable as his predecessor or what Allah wants.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف كالموثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/12)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 592,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:32:4",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ مُوسَى بْنِ بَكْرٍ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ فِي عَلِيٍّ ( عليه السلام ) سُنَّةَ أَلْفِ نَبِيٍّ مِنَ الْأَنْبِيَاءِ وَ إِنَّ الْعِلْمَ الَّذِي نَزَلَ مَعَ آدَمَ ( عليه السلام ) لَمْ يُرْفَعْ وَ مَا مَاتَ عَالِمٌ فَذَهَبَ عِلْمُهُ وَ الْعِلْمُ يُتَوَارَثُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Musa Bin Bakr, from Al Fuzayl Bin Yasaar who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘In Ali<sup>asws</sup> there are <span class=\"iTxt\">Sunnah</span>s of a thousand Prophets<sup>as</sup>, and the Knowledge which descended with Adam<sup>as</sup> was not Raised; and a knowledgeable one<sup>asws</sup> does not pass away, so his<sup>asws</sup> knowledge goes away, and the Knowledge is inherited’."
          ],
          "en.sarwar": [
            " 4. Abu Ali al-Ash‘ari has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Musa ibn Bakr from al-Fudayl ibn Yasar who has said that he heard abu ‘Abdallah (a.s.) say the following. “In Imam Ali (a.s.) there was the Sunnah (traditions) of a thousand prophet. The knowledge that came with Adam was not taken away. No man of knowledge ever died along with knowledge. Knowledge is inherited.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/13)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 593,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:32:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عُمَرَ بْنِ أَبَانٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ الْعِلْمَ الَّذِي نَزَلَ مَعَ آدَمَ ( عليه السلام ) لَمْ يُرْفَعْ وَ مَا مَاتَ عَالِمٌ فَذَهَبَ عِلْمُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed from Fazalat Bin Ayoub, from Umar Bin Aban who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘The Knowledge is that which descended with Adam<sup>as</sup>, and was not Raised (back), and a knowledgeable one<sup>asws</sup> does not pass away, so his<sup>asws</sup> knowledge would go away’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fudalah ibn Ayyub from ‘Umar ibn Aban who has said that he heard abu Ja‘far (a.s.) say the following. “The knowledge that came with Adam was not taken away. No man of knowledge has ever died along with his knowledge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/13)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 594,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:32:6",
        "text": [
          "مُحَمَّدٌ عَنْ أَحْمَدَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ رَفَعَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَمُصُّونَ الثِّمَادَ وَ يَدَعُونَ النَّهَرَ الْعَظِيمَ قِيلَ لَهُ وَ مَا النَّهَرُ الْعَظِيمُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ الْعِلْمُ الَّذِي أَعْطَاهُ اللَّهُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ جَمَعَ لِمُحَمَّدٍ ( صلى الله عليه وآله ) سُنَنَ النَّبِيِّينَ مِنْ آدَمَ وَ هَلُمَّ جَرّاً إِلَى مُحَمَّدٍ ( صلى الله عليه وآله )",
          "قِيلَ لَهُ وَ مَا تِلْكَ السُّنَنُ قَالَ عِلْمُ النَّبِيِّينَ بِأَسْرِهِ وَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) صَيَّرَ ذَلِكَ كُلَّهُ عِنْدَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ",
          "فَقَالَ لَهُ رَجُلٌ يَا ابْنَ رَسُولِ اللَّهِ فَأَمِيرُ الْمُؤْمِنِينَ أَعْلَمُ أَمْ بَعْضُ النَّبِيِّينَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) اسْمَعُوا مَا يَقُولُ إِنَّ اللَّهَ يَفْتَحُ مَسَامِعَ مَنْ يَشَاءُ إِنِّي حَدَّثْتُهُ أَنَّ اللَّهَ جَمَعَ لِمُحَمَّدٍ ( صلى الله عليه وآله ) عِلْمَ النَّبِيِّينَ وَ أَنَّهُ جَمَعَ ذَلِكَ كُلَّهُ عِنْدَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ هُوَ يَسْأَلُنِي أَ هُوَ أَعْلَمُ أَمْ بَعْضُ النَّبِيِّينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad Bin Ali Bin Al Numan, ",
            "raising it from Abu Ja’far<sup>asws</sup>, said: ‘Abu Ja’far<sup>asws</sup> said: ‘They (people) are sucking the moisture and are leaving the magnificent river’. It was said to him<sup>asws</sup>, ‘And what is the magnificent river?’ He<sup>saww</sup> said: ‘Rasool-Allah<sup>saww</sup> and the Knowledge which Allah<sup>azwj</sup> Granted him<sup>saww</sup>. Allah<sup>azwj</sup> Mighty and Majestic Gathered for Muhammad<sup>saww</sup>, the <span class=\"iTxt\">Sunnah</span> of the Prophets<sup>as</sup>, from Adam<sup>as</sup> and brought forwards flowing up to Muhammad<sup>saww</sup>’. ",
            "It was said to him<sup>asws</sup>, ‘And what is that <span class=\"iTxt\">Sunnah</span>?’ He<sup>asws</sup> said: ‘Knowledge of the Prophets<sup>as</sup> in its entirety, and that Rasool-Allah<sup>saww</sup> rendered that, all of it with Amir Al-Momineen<sup>asws</sup>’. ",
            "So a man said to him<sup>asws</sup>, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! So, is Amir Al-Momineen<sup>asws</sup> more knowledgeable or some of the Prophets<sup>as</sup>?’ So Abu Ja’far<sup>asws</sup> said to him: ‘Listen to what he is saying! Allah<sup>azwj</sup> Opens the hearing of the ones He<sup>azwj</sup> so Desires to. I<sup>asws</sup> narrated to him that Allah<sup>azwj</sup> Gathered to Muhammad<sup>saww</sup> the Knowledge of the Prophets<sup>as</sup>, and that he<sup>saww</sup> gathered that, all of it, to be with Amir Al-Momineen<sup>asws</sup>, and he is asking me<sup>asws</sup>, is he<sup>asws</sup> more knowledgeable or some of the Prophets<sup>as</sup>?’."
          ],
          "en.sarwar": [
            " 6. Muhammad has narrated from Ahmad from Ali ibn Nu‘man, in a marfu’ manner (rafa’ahu) from abu Ja‘far (a.s.) who has said the following. “They try to absorb the little moisture but ignore the huge river.” Someone asked him, “What is (this) huge river?” The Imams (a.s.)said, “It is the Messenger of Allah (s.a.) and the Knowledge that Allah gave to him. Allah, the Most Holy, the Most High, combined in Muhammad (s.a.) the Sunnah (traditions) of the all the prophets from Adam onwards to Muhammad (s.a.).” Someone asked him, “What are those sunnah (traditions)?” The Imams (a.s.) said, “They are all the knowledge of the prophets (s.a.). The Messenger of Allah transferred all of them to Amir al-Mu’minin Ali (a.s.).” The man then said, “O son of the Messenger of Allah, is Amir al-Mu’minin Ali (a.s.) more knowledgeable or some of the prophets?” Abu Ja‘far (a.s.) replied, “Listen, everyone to what he just said. Allah opens the ears of whoever He wants. I said to him that Allah combined for Muhammad (s.a.) the knowledge of the prophets and he combined all of it with Amir al-Mu’minin Ali (a.s.). He now asks me, “Was he (Ali (a.s.) more knowledgeable or some of the prophets?”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح مكرر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/14)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 595,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:32:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْبَرْقِيِّ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ عَبْدِ الْحَمِيدِ الطَّائِيِّ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ الْعِلْمَ يُتَوَارَثُ فَلَا يَمُوتُ عَالِمٌ إِلَّا تَرَكَ مَنْ يَعْلَمُ مِثْلَ عِلْمِهِ أَوْ مَا شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Barqy, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Abdul Hameed Al Tai’y, from Muhammad Bin Muslim who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘The Knowledge is inherited, so there does not die a knowledgeable one<sup>asws</sup> except that he<sup>asws</sup> leaves one<sup>asws</sup> who knows the like of his<sup>asws</sup> knowledge, or whatever Allah<sup>azwj</sup> so Desires’."
          ],
          "en.sarwar": [
            " 7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Barqi from al-Nadr ibn Suwayd from Yahya al-Halabi from ‘Abd al-Hamid at.-Ta’i from Muhammad ibn Muslim from abu Ja‘far (a.s.) who has said the following. “Knowledge is inherited. No man of knowledge ever leaves this world without leaving behind one who would have as much knowledge as he had or what Allah wants.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> (  )  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 596,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:32:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الْعِلْمَ الَّذِي نَزَلَ مَعَ آدَمَ ( عليه السلام ) لَمْ يُرْفَعْ وَ مَا مَاتَ عَالِمٌ إِلَّا وَ قَدْ وَرَّثَ عِلْمَهُ إِنَّ الْأَرْضَ لَا تَبْقَى بِغَيْرِ عَالِمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Al Haris Bin Al Mugheira who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The Knowledge is that which descended with Adam<sup>as</sup>, and was never Raised; and a knowledgeable One<sup>asws</sup> does not die except his<sup>asws</sup> knowledge gets inherited. The earth cannot remain without a knowledgeable one<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 8. Ali ibn Ibrahim has narrated from Muhammad ibn ’Isa from Yunus from al-Harith ibn al-Mughirah from abu ‘Abdallah (a.s.) who has said the following. “The Knowledge that came with Adam was not taken away. No man of knowledge has ever died without his knowledge being inherited. The earth does not remain without a man of knowledge.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:32",
  "kind": "verse_list"
}