{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:1:4:33",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ وَرِثُوا عِلْمَ النَّبِيِّ وَ جَمِيعِ الْأَنْبِيَاءِ وَ الْأَوْصِيَاءِ الَّذِينَ مِنْ قَبْلِهِمْ",
          "en": "Chapter 33 – The Imams<sup>asws</sup> inherited the Knowledge of the Prophet<sup>saww</sup> and of the entirety of the Prophets<sup>as</sup> and the successors<sup>as</sup> who were from before them<sup>asws</sup>"
        }
      }
    ],
    "index": 91,
    "local_index": 33,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:1:4:34",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) عِنْدَهُمْ جَمِيعُ الْكُتُبِ الَّتِي نَزَلَتْ مِنْ عِنْدِ اللَّهِ عَزَّ وَ جَلَّ وَ أَنَّهُمْ يَعْرِفُونَهَا عَلَى اخْتِلَافِ أَلْسِنَتِهَا",
          "en": "Chapter 34 – The Imams<sup>asws</sup>, with them<sup>asws</sup> are the entirety of the Books which were Revealed from Allah<sup>azwj</sup> Mighty and Majestic, and they<sup>asws</sup> recognise these upon their different languages"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:1:4:32",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) وَرَثَةُ الْعِلْمِ يَرِثُ بَعْضُهُمْ بَعْضاً الْعِلْمَ",
          "en": "Chapter 32 – The Imams<sup>asws</sup> are the inheritors of the Knowledge, inheriting the Knowledge from each other"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:33",
    "titles": {
      "ar": "بَابُ أَنَّ الْأَئِمَّةَ وَرِثُوا عِلْمَ النَّبِيِّ وَ جَمِيعِ الْأَنْبِيَاءِ وَ الْأَوْصِيَاءِ الَّذِينَ مِنْ قَبْلِهِمْ",
      "en": "Chapter 33 – The Imams<sup>asws</sup> inherited the Knowledge of the Prophet<sup>saww</sup> and of the entirety of the Prophets<sup>as</sup> and the successors<sup>as</sup> who were from before them<sup>asws</sup>"
    },
    "verse_count": 7,
    "verse_start_index": 596,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/14)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 597,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/364",
              "text": "عَبْدِ الْعَزِيزِ بْنِ الْمُهْتَدِي"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/694",
              "text": "عَبْدِ اللَّهِ بْنِ جُنْدَبٍ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ الْعَزِيزِ بْنِ الْمُهْتَدِي عَنْ عَبْدِ اللَّهِ بْنِ جُنْدَبٍ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:33:1",
        "relations": {
          "Mentions": [
            "/books/quran:42:13"
          ]
        },
        "text": [
          "هُ كَتَبَ إِلَيْهِ الرِّضَا ( عليه السلام ) أَمَّا بَعْدُ فَإِنَّ مُحَمَّداً ( صلى الله عليه وآله ) كَانَ أَمِينَ اللَّهِ فِي خَلْقِهِ فَلَمَّا قُبِضَ ( صلى الله عليه وآله ) كُنَّا أَهْلَ الْبَيْتِ وَرَثَتَهُ فَنَحْنُ أُمَنَاءُ اللَّهِ فِي أَرْضِهِ ",
          "عِنْدَنَا عِلْمُ الْبَلَايَا وَ الْمَنَايَا وَ أَنْسَابُ الْعَرَبِ وَ مَوْلِدُ الْإِسْلَامِ وَ إِنَّا لَنَعْرِفُ الرَّجُلَ إِذَا رَأَيْنَاهُ بِحَقِيقَةِ الْإِيمَانِ وَ حَقِيقَةِ النِّفَاقِ وَ إِنَّ شِيعَتَنَا لَمَكْتُوبُونَ بِأَسْمَائِهِمْ وَ أَسْمَاءِ آبَائِهِمْ أَخَذَ اللَّهُ عَلَيْنَا وَ عَلَيْهِمُ الْمِيثَاقَ يَرِدُونَ مَوْرِدَنَا وَ يَدْخُلُونَ مَدْخَلَنَا لَيْسَ عَلَى مِلَّةِ الْإِسْلَامِ غَيْرُنَا وَ غَيْرُهُمْ",
          "نَحْنُ النُّجَبَاءُ النُّجَاةُ وَ نَحْنُ أَفْرَاطُ الْأَنْبِيَاءِ وَ نَحْنُ أَبْنَاءُ الْأَوْصِيَاءِ وَ نَحْنُ الْمَخْصُوصُونَ فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ وَ نَحْنُ أَوْلَى النَّاسِ بِكِتَابِ اللَّهِ وَ نَحْنُ أَوْلَى النَّاسِ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) ",
          "وَ نَحْنُ الَّذِينَ شَرَعَ اللَّهُ لَنَا دِينَهُ فَقَالَ فِي كِتَابِهِ شَرَعَ لَكُمْ يَا آلَ مُحَمَّدٍ مِنَ الدِّينِ ما وَصَّى بِهِ نُوحاً قَدْ وَصَّانَا بِمَا وَصَّى بِهِ نُوحاً وَ الَّذِي أَوْحَيْنا إِلَيْكَ يَا مُحَمَّدُ وَ ما وَصَّيْنا بِهِ إِبْراهِيمَ وَ مُوسى وَ عِيسى ",
          "فَقَدْ عَلَّمَنَا وَ بَلَّغَنَا عِلْمَ مَا عَلِمْنَا وَ اسْتَوْدَعَنَا عِلْمَهُمْ نَحْنُ وَرَثَةُ أُولِي الْعَزْمِ مِنَ الرُّسُلِ أَنْ أَقِيمُوا الدِّينَ يَا آلَ مُحَمَّدٍ وَ لا تَتَفَرَّقُوا فِيهِ وَ كُونُوا عَلَى جَمَاعَةٍ كَبُرَ عَلَى الْمُشْرِكِينَ مَنْ أَشْرَكَ بِوَلَايَةِ عَلِيٍّ ما تَدْعُوهُمْ إِلَيْهِ مِنْ وَلَايَةِ عَلِيٍّ إِنَّ اللَّهَ يَا مُحَمَّدُ يَهْدِي إِلَيْهِ مَنْ يُنِيبُ مَنْ يُجِيبُكَ إِلَى وَلَايَةِ عَلِيٍّ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdul Aziz Bin Al Muhtady, ",
            "(It has been narrated) from Abdullah Bin Jundab that Al-Reza<sup>asws</sup> wrote to him: ‘As for after this, so Muhammad<sup>saww</sup> was a trustee of Allah<sup>azwj</sup> among His<sup>azwj</sup> creatures. So when he<sup>saww</sup> passed away, it was us<sup>asws</sup>, the People<sup>asws</sup> of the Household who inherited him<sup>saww</sup>. Thus, we<sup>asws</sup> are the trustees of Allah<sup>azwj</sup> in His<sup>azwj</sup> earth. ",
            "With us<sup>asws</sup> is the knowledge of the calamities and the deaths, and the lineages of the Arabs, and the birth of Al-Islam. And we<sup>asws</sup> tend to recognise the man when we<sup>asws</sup> see him, by the reality of the <span class=\"iTxt\">Eman</span> and the reality of the hypocrisy, and that our<sup>asws</sup> Shias are recorded with their names and the names of their fathers. Allah<sup>azwj</sup> Took the Covenant upon us<sup>asws</sup> and upon them. They are intending our<sup>asws</sup> intentions and are entering our entries. There isn’t upon the nation of Al-Islam apart from us<sup>asws</sup> and them. ",
            "We<sup>asws</sup> are the saviours for the salvation, and we<sup>asws</sup> are the amplified of the Prophets<sup>as</sup>, and we<sup>asws</sup> are the sons<sup>asws</sup> of the successors<sup>as</sup>, and we<sup>asws</sup> the ones particularised in the Book of Allah<sup>azwj</sup> Mighty and Majestic, and we<sup>asws</sup> are the closest of the people with the Book of Allah<sup>azwj</sup>, and we<sup>asws</sup> are the closest of the people with Rasool-Allah<sup>saww</sup>.",
            "And we<sup>asws</sup> are those for whom Allah<sup>azwj</sup> Legislated His<sup>azwj</sup> Religion for us<sup>asws</sup>, so He<sup>azwj</sup> Said in His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:42#h13\">[42:13]</a> He has Legislated to you </span>O Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> <span class=\"ibTxt\">from the Religion what He Enjoined upon Nuh and that which We have Revealed to you </span>O Muhammad<sup>saww</sup>, <span class=\"ibTxt\">and that which We Enjoined upon Ibrahim and Musa and Isa</span>. ",
            "So He<sup>azwj</sup> has Taught us<sup>asws</sup>, and Delivered to Us<sup>asws</sup> the Knowledge what we<sup>asws</sup> know, and Entrusted us<sup>asws</sup> their<sup>as</sup> knowledge. We<sup>asws</sup> are the inheritors of the Determined Ones (Ul Al-Azam) from the Rasools<sup>as</sup> that you<sup>asws</sup> would <span class=\"ibTxt\">be steadfast upon the Religion </span>O Progeny<sup>asws</sup> Muhammad<sup>saww</sup> <span class=\"ibTxt\">and be not divided therein</span>, and become one group, <span class=\"ibTxt\">hard it is to the Polytheists </span>the ones who associate others with the <span class=\"iTxt\">Wilayah</span> of Ali<sup>asws</sup> <span class=\"ibTxt\">that which you call them to</span> from the <span class=\"iTxt\">Wilayah</span> of Ali<sup>asws</sup>. <span class=\"ibTxt\">Allah</span>, O Muhammad<sup>saww</sup>, <span class=\"ibTxt\">Guides to Himself him who turns</span>, the one who answers you to the <span class=\"iTxt\">Wilayah</span> of Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Ibrahim has narrated from his father from ‘Abd al-‘Aziz ibn al-Muhtadi from ‘Adallah ibn Jundab to who Imam al-Rida (a.s.) wrote the following. “Thereafter, (thanking Allah) Muhammad (s.a.) was the trustee of Allah for His creatures. When he was taken away from this world we, Ahl al-Bayt inherited him, thus, we are the trustees of Allah over His earth. With us is the knowledge of the sufferings, the death, the genealogy of the Arabs and the birth of Islam. We know the man when we see him in the truth of faith or hypocrisy. Our followers (Shi‘a) are listed (with us) by their names and the names of their fathers. Allah has established a covenant with them and with us. They land wherever we would do so and enter wherever we would enter. There is no besides us and our followers as living the Islamic culture. We are the noble saviors and the descendents of the prophets and of the children of the successors of the prophets. We the ones to whom the book of Allah, the Most Holy, the Most High, has come exclusively. We, of all people, have the first priority (closeness) to the book of Allah. We, of all people, have the first priority (closeness) to the Messenger of Allah. For us He formed His religion. “He has established for you (family of Muhammad) a form of religion which is of the commands to Noah {we are commanded with whatever Noah was commanded}. It is of the mattes that We have revealed to you (Muhammad) and of the commands to Noah, Abraham, Moses, and Jesus to follow.{We have taught and preached the knowledge that was taught to us. We were given the knowledge of these prophets. We are the heirs of the commissioned Messengers}. (He has explained it) so that you (family of Muhammad) would be steadfast and united (all in a united group) in your religion. What you call the polytheists {polytheists in the acknowledgement of the Divine authority of Imam Ali (a.s.} to{the acknowledgement of the Divine authority of Imam Ali (a.s.}is extremely grave for them. God {O Muhammad} attracts to (the religion) whomever He wants and guides to it whoever turns to Him in repentance.” <a href=\"/#/books/quran:42#h13\">[42:13]</a>"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/17)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 598,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:33:2",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ أَوَّلَ وَصِيٍّ كَانَ عَلَى وَجْهِ الْأَرْضِ هِبَةُ اللَّهِ بْنُ آدَمَ وَ مَا مِنْ نَبِيٍّ مَضَى إِلَّا وَ لَهُ وَصِيٌّ وَ كَانَ جَمِيعُ الْأَنْبِيَاءِ مِائَةَ أَلْفِ نَبِيٍّ وَ عِشْرِينَ أَلْفَ نَبِيٍّ مِنْهُمْ خَمْسَةٌ أُولُو الْعَزْمِ نُوحٌ وَ إِبْرَاهِيمُ وَ مُوسَى وَ عِيسَى وَ مُحَمَّدٌ ( عليهم السلام ) وَ إِنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ كَانَ هِبَةَ اللَّهِ لِمُحَمَّدٍ وَ وَرِثَ عِلْمَ الْأَوْصِيَاءِ وَ عِلْمَ مَنْ كَانَ قَبْلَهُ ",
          "أَمَا إِنَّ مُحَمَّداً وَرِثَ عِلْمَ مَنْ كَانَ قَبْلَهُ مِنَ الْأَنْبِيَاءِ وَ الْمُرْسَلِينَ عَلَى قَائِمَةِ الْعَرْشِ مَكْتُوبٌ حَمْزَةُ أَسَدُ اللَّهِ وَ أَسَدُ رَسُولِهِ وَ سَيِّدُ الشُّهَدَاءِ وَ فِي ذُؤَابَةِ الْعَرْشِ عَلِيٌّ أَمِيرُ الْمُؤْمِنِينَ فَهَذِهِ حُجَّتُنَا عَلَى مَنْ أَنْكَرَ حَقَّنَا وَ جَحَدَ مِيرَاثَنَا وَ مَا مَنَعَنَا مِنَ الْكَلَامِ وَ أَمَامَنَا الْيَقِينُ فَأَيُّ حُجَّةٍ تَكُونُ أَبْلَغَ مِنْ هَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The first successor<sup>as</sup> upon the face of the earth was Hibtullah Bin Adam<sup>as</sup>, and there is none from a Prophet<sup>as</sup> of the past except that for him<sup>as</sup> was a successor<sup>as</sup>, and the entirety of the Prophets were one hundred and twenty thousand Prophets. From them<sup>as</sup>, five were Determined Ones (<span class=\"iTxt\">Ul Al-Azam</span>) – Noah<sup>as</sup>, and Ibrahim<sup>as</sup>, and Musa<sup>as</sup>, and Isa<sup>as</sup> and Muhammad<sup>saww</sup>, and that Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> was the Hibtullah<sup>as</sup> of Muhammad<sup>saww</sup>, and an inheritor of the Knowledge of the successors<sup>as</sup>, and the knowledge of the ones who were before him<sup>as</sup>’. ",
            "As for Muhammad<sup>saww</sup>, he<sup>saww</sup> inherited the knowledge of the ones<sup>as</sup> who were before him<sup>saww</sup> from the Prophets<sup>as</sup> and the Rasools<sup>as</sup>. It is inscribed upon the Register of the Throne: “Hamza<sup>as</sup> is a lion of Allah<sup>azwj</sup> and a lion of His<sup>azwj</sup> Rasool<sup>as</sup> and the chief of the martyrs”; and in the central facet of the Throne: “Ali<sup>asws</sup> Amir Al-Momineen<sup>asws</sup>”. So these are our<sup>asws</sup> proofs upon the ones who deny our<sup>asws</sup> rights and fight against our<sup>asws</sup> inheritances. And what prevents us<sup>asws</sup> from the speaking and in front of us<sup>asws</sup> is the conviction? So which proof can happen to be more eloquent than this?’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Abd al-Rahman ibn Kathir from abu Ja‘far (a.s.) who has said the following. “The Messenger of Allah has said, ‘The first successor and executor of the will on earth was Hibbatullah, the son of Adam. No prophet has ever left this world without first leaving behind one who would execute his will. The prophets were one hundred twenty thousand persons. Five of them were commissioned Messengers, like Noah, Abraham, Moses, Jesus and Muhammad (s.a.) Ali ibn abu Talib (a.s.) was the Hibbatullah for Muhammad (s.a.).He inherited the knowledge of the executors of the wills of the prophets and the knowledge of those who were before him. (Is not it true) that Muhammad (s.a.) inherited the knowledge of the prophets and the Messengers who lived before him? It is written on the columns of the throne, “Hamza is the loin of Allah and the loin of His Messenger. He (Hamza) is the master of the martyrs. On top of the throne is Amir al-Mu’minin Ali (a.s.). This evidence against those who deny our rights and refuse to yield to us our right of inheritance. We are not forbidden to speak. Before us is all certainty. What supporting evidence could be more clear than this.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> (   ) </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 599,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/325",
              "text": "سَلَمَةَ بْنِ الْخَطَّابِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/148",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/617",
              "text": "عَبْدِ اللَّهِ بْنِ الْقَاسِمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/695",
              "text": "زُرْعَةَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "الْمُفَضَّلِ بْنِ عُمَرَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ زُرْعَةَ بْنِ مُحَمَّدٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:33:3",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ سُلَيْمَانَ وَرِثَ دَاوُدَ وَ إِنَّ مُحَمَّداً وَرِثَ سُلَيْمَانَ وَ إِنَّا وَرِثْنَا مُحَمَّداً وَ إِنَّ عِنْدَنَا عِلْمَ التَّوْرَاةِ وَ الْإِنْجِيلِ وَ الزَّبُورِ وَ تِبْيَانَ مَا فِي الْأَلْوَاحِ ",
          "قَالَ قُلْتُ إِنَّ هَذَا لَهُوَ الْعِلْمُ قَالَ لَيْسَ هَذَا هُوَ الْعِلْمَ إِنَّ الْعِلْمَ الَّذِي يَحْدُثُ يَوْماً بَعْدَ يَوْمٍ وَ سَاعَةً بَعْدَ سَاعَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Abdullah Bin Muhammad, from Abdullah Bin Al Qasim, from Zur’a Bin Muhammad, from Al Mufazzal Bin Umar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Suleyman<sup>as</sup> inherited Dawood<sup>as</sup>, and that Muhammad<sup>saww</sup> inherited Suleyman<sup>as</sup>, and we<sup>asws</sup> are the inheritors of Muhammad<sup>saww</sup>, and that in our<sup>asws</sup> presence is the Knowledge of the Torah, and the Evangel, and the Psalms, and the explanation of what is in the Tablets’. ",
            "He (the narrator) said, ‘I said, ‘This Tablet, is the Knowledge?’ He<sup>asws</sup> said: ‘This is not the Knowledge. The Knowledge is that which occurs day after day, and moment after moment’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Salama ibn al-Khattab from ‘Adallah ibn Muhammad from ‘Adallah ibn al-Qasim from Zur‘a ibn Muhammad from al-Mufaddal ibn ‘Umar from who has said the following. “Solomon inherited David. Muhammad (s.a.) inherited Solomon and we inherited Muhammad (s.a.). We have the knowledge of Torah and the Gospel (Injil), the Psalms, (al-Zabur) and the explanation of what the tablets contained.” I (the narrator) said, “This certainly is the knowledge.” The Imams (a.s.) said, “This is not knowledge. Knowledge is what happens day after day and hour after hour.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 600,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/696",
              "text": "شُعَيْبٍ الْحَدَّادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/697",
              "text": "ضُرَيْسٍ الْكُنَاسِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ شُعَيْبٍ الْحَدَّادِ عَنْ ضُرَيْسٍ الْكُنَاسِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:33:4",
        "text": [
          " كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ عِنْدَهُ أَبُو بَصِيرٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ دَاوُدَ وَرِثَ عِلْمَ الْأَنْبِيَاءِ وَ إِنَّ سُلَيْمَانَ وَرِثَ دَاوُدَ وَ إِنَّ مُحَمَّداً ( صلى الله عليه وآله ) وَرِثَ سُلَيْمَانَ وَ إِنَّا وَرِثْنَا مُحَمَّداً ( صلى الله عليه وآله ) وَ إِنَّ عِنْدَنَا صُحُفَ إِبْرَاهِيمَ وَ أَلْوَاحَ مُوسَى ",
          "فَقَالَ أَبُو بَصِيرٍ إِنَّ هَذَا لَهُوَ الْعِلْمُ فَقَالَ يَا أَبَا مُحَمَّدٍ لَيْسَ هَذَا هُوَ الْعِلْمَ إِنَّمَا الْعِلْمُ مَا يَحْدُثُ بِاللَّيْلِ وَ النَّهَارِ يَوْماً بِيَوْمٍ وَ سَاعَةً بِسَاعَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Shuayb Al Haddad, from Zureys Al Kunasy who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup> and with him<sup>asws</sup> was Abu Baseer. So Abu Abdullah<sup>asws</sup> said: ‘Dawood<sup>as</sup> inherited the Knowledge of the Prophets<sup>as</sup>, and that Suleyman<sup>as</sup> inherited Dawood<sup>as</sup>, and that Muhammad<sup>saww</sup> inherited Suleyman<sup>as</sup>, and we<sup>asws</sup> inherited Muhammad<sup>saww</sup>, and that with us<sup>asws</sup> are the Parchments of Ibrahim<sup>as</sup>, and the Tablets of Musa<sup>as</sup>’. ",
            "So Abu Baseer said, ‘This Tablet, is the Knowledge?’ So he<sup>asws</sup> said: ‘O Abu Baseer! This is not the Knowledge. But rather, the Knowledge is what occurs by the night and the day, day by day, and moment by moment’."
          ],
          "en.sarwar": [
            " 4. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Shu‘ayb al-Haddad from Durays al-Kunasi who has said the following. “I was in the presence of abu ‘Abdallah (a.s.) and abu Basir also was there. The Imams (a.s.) said, “David inherited the knowledge of the prophets. Solomon inherited David. Prophet Muhammad (s.a.) inherited Solomon and we inherited Muhammad (s.a.). With us are the pages of Abraham and the tablets of Moses.” Abu Basir then said, “This is the knowledge.” The Imams (a.s.) said, “O abu Muhammad, this is not the knowledge. The knowledge is what happens in the nights and in the days, day after day and hour after hour.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/20)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 601,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/245",
              "text": "عَلِيِّ بْنِ النُّعْمَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:33:5",
        "relations": {
          "Mentions": [
            "/books/quran:87:19"
          ]
        },
        "text": [
          " قَالَ لِي يَا أَبَا مُحَمَّدٍ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمْ يُعْطِ الْأَنْبِيَاءَ شَيْئاً إِلَّا وَ قَدْ أَعْطَاهُ مُحَمَّداً ( صلى الله عليه وآله ) قَالَ وَ قَدْ أَعْطَى مُحَمَّداً جَمِيعَ مَا أَعْطَى الْأَنْبِيَاءَ وَ عِنْدَنَا الصُّحُفُ الَّتِي قَالَ اللَّهُ عَزَّ وَ جَلَّ صُحُفِ إِبْراهِيمَ وَ مُوسى قُلْتُ جُعِلْتُ فِدَاكَ هِيَ الْأَلْوَاحُ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Abdul Jabbar, from Muhammad Bin Ismail, from Ali Bin Al Numan, from Ibn Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> said to me: ‘O Abu Muhammad! Allah<sup>azwj</sup> Mighty and Majestic did not Give anything to the Prophets<sup>as</sup> except and He<sup>azwj</sup> Gave it to Muhammad<sup>saww</sup> (as well). And He<sup>azwj</sup> Gave Muhammad<sup>saww</sup> the entirety of what He<sup>azwj</sup> Gave to the Prophets<sup>as</sup>, and with us<sup>asws</sup> are the Parchments which Allah<sup>azwj</sup> Mighty and Majestic Said are <span class=\"ibTxt\"><a href=\"/#/books/quran:87#h19\">[87:19]</a> The scriptures of Ibrahim and Musa</span>’. I said, ‘May I be sacrificed for you<sup>asws</sup>! These are the Tablets?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from Muhammad ibn ‘Abd al-Jabbar from Muhammad ibn Isma‘il from Ali ibn an-Nu‘man from ibn Muskan from abu Basir who has said the following. “Imam abu ‘Abdallah (a.s.) said to me, “O abu Muhammad, Allah, the Most Holy, the Most High, has not given anything to the prophets that He has not given to Prophet Muhammad (s.a.). The Imams (a.s.) further said, “Allah gave to Prophet Muhammad (s.a.) all that He had given to the prophets. With us is the book about which Allah, the Most Holy, the Most High, “The books of Abraham and Moses.” I then said, “May Allah take my soul in service for your cause, are they the tablets?” The Imams (a.s.) said, “Yes, they are the tablets.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/21)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 602,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/248",
              "text": "مُحَمَّدٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:33:6",
        "relations": {
          "Mentions": [
            "/books/quran:21:105"
          ]
        },
        "text": [
          "هُ سَأَلَهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لَقَدْ كَتَبْنا فِي الزَّبُورِ مِنْ بَعْدِ الذِّكْرِ مَا الزَّبُورُ وَ مَا الذِّكْرُ قَالَ الذِّكْرُ عِنْدَ اللَّهِ وَ الزَّبُورُ الَّذِي أُنْزِلَ عَلَى دَاوُدَ وَ كُلُّ كِتَابٍ نَزَلَ فَهُوَ عِنْدَ أَهْلِ الْعِلْمِ وَ نَحْنُ هُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, that he asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:21#h105\">[21:105]</a> And We have Written in the Psalms after the Reminder</span>, ‘What is the Psalms and what is the Reminder (<span class=\"iTxt\">Al-Zikr</span>)?’ He<sup>asws</sup> said: ‘The Reminder (<span class=\"iTxt\">Al-Zikr</span>) is with Allah<sup>azwj</sup>, and the Psalms is what which was Revealed unto Dawood; and every Book which was Revealed, so it is with the People of the Knowledge, and we<sup>asws</sup> are they’."
          ],
          "en.sarwar": [
            " 6. Muhammad has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from ‘Adallah ibn Sinan who has said that he asked abu ‘Abdallah (a.s.) the following about the meaning of the words of Allah, the Most Holy, the Most High. “We have written in the psalms which We had revealed after the Torah. .” <a href=\"/#/books/quran:21#h105\">[21:105]</a>. What is al-Zabur and what is al-Dhikr?” The Imams (a.s.) said, “Al-Dhikr is with Allah and al-Zabur is what He gave to David.” Every book that was revealed is with the people of knowledge and we are the people of knowledge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 603,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/698",
              "text": "أَحْمَدَ بْنِ أَبِي زَاهِرٍ أَوْ غَيْرِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/699",
              "text": "مُحَمَّدِ بْنِ حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/700",
              "text": "أَخِيهِ أَحْمَدَ بْنِ حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/381",
              "text": "إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/701",
              "text": "أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ أَبِي زَاهِرٍ أَوْ غَيْرِهِ عَنْ مُحَمَّدِ بْنِ حَمَّادٍ عَنْ أَخِيهِ أَحْمَدَ بْنِ حَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:33:7",
        "relations": {
          "Mentions": [
            "/books/quran:35:32",
            "/books/quran:27:21",
            "/books/quran:27:20",
            "/books/quran:27:75",
            "/books/quran:13:31"
          ]
        },
        "text": [
          " قُلْتُ لَهُ جُعِلْتُ فِدَاكَ أَخْبِرْنِي عَنِ النَّبِيِّ ( صلى الله عليه وآله ) وَرِثَ النَّبِيِّينَ كُلَّهُمْ قَالَ نَعَمْ قُلْتُ مِنْ لَدُنْ آدَمَ حَتَّى انْتَهَى إِلَى نَفْسِهِ قَالَ مَا بَعَثَ اللَّهُ نَبِيّاً إِلَّا وَ مُحَمَّدٌ ( صلى الله عليه وآله ) أَعْلَمُ مِنْهُ",
          "قَالَ قُلْتُ إِنَّ عِيسَى ابْنَ مَرْيَمَ كَانَ يُحْيِي الْمَوْتَى بِإِذْنِ اللَّهِ قَالَ صَدَقْتَ وَ سُلَيْمَانَ بْنَ دَاوُدَ كَانَ يَفْهَمُ مَنْطِقَ الطَّيْرِ وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَقْدِرُ عَلَى هَذِهِ الْمَنَازِلِ",
          "قَالَ فَقَالَ إِنَّ سُلَيْمَانَ بْنَ دَاوُدَ قَالَ لِلْهُدْهُدِ حِينَ فَقَدَهُ وَ شَكَّ فِي أَمْرِهِ فَقالَ ما لِيَ لا أَرَى الْهُدْهُدَ أَمْ كانَ مِنَ الْغائِبِينَ حِينَ فَقَدَهُ فَغَضِبَ عَلَيْهِ فَقَالَ لَأُعَذِّبَنَّهُ عَذاباً شَدِيداً أَوْ لَأَذْبَحَنَّهُ أَوْ لَيَأْتِيَنِّي بِسُلْطانٍ مُبِينٍ",
          "وَ إِنَّمَا غَضِبَ لِأَنَّهُ كَانَ يَدُلُّهُ عَلَى الْمَاءِ فَهَذَا وَ هُوَ طَائِرٌ قَدْ أُعْطِيَ مَا لَمْ يُعْطَ سُلَيْمَانُ وَ قَدْ كَانَتِ الرِّيحُ وَ النَّمْلُ وَ الْإِنْسُ وَ الْجِنُّ وَ الشَّيَاطِينُ وَ الْمَرَدَةُ لَهُ طَائِعِينَ وَ لَمْ يَكُنْ يَعْرِفُ الْمَاءَ تَحْتَ الْهَوَاءِ وَ كَانَ الطَّيْرُ يَعْرِفُهُ ",
          "وَ إِنَّ اللَّهَ يَقُولُ فِي كِتَابِهِ وَ لَوْ أَنَّ قُرْآناً سُيِّرَتْ بِهِ الْجِبالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ أَوْ كُلِّمَ بِهِ الْمَوْتى وَ قَدْ وَرِثْنَا نَحْنُ هَذَا الْقُرْآنَ الَّذِي فِيهِ مَا تُسَيَّرُ بِهِ الْجِبَالُ وَ تُقَطَّعُ بِهِ الْبُلْدَانُ وَ تُحْيَا بِهِ الْمَوْتَى وَ نَحْنُ نَعْرِفُ الْمَاءَ تَحْتَ الْهَوَاءِ ",
          "وَ إِنَّ فِي كِتَابِ اللَّهِ لآَيَاتٍ مَا يُرَادُ بِهَا أَمْرٌ إِلَّا أَنْ يَأْذَنَ اللَّهُ بِهِ مَعَ مَا قَدْ يَأْذَنُ اللَّهُ مِمَّا كَتَبَهُ الْمَاضُونَ جَعَلَهُ اللَّهُ لَنَا فِي أُمِّ الْكِتَابِ إِنَّ اللَّهَ يَقُولُ وَ ما مِنْ غائِبَةٍ فِي السَّماءِ وَ الْأَرْضِ إِلَّا فِي كِتابٍ مُبِينٍ ",
          "ثُمَّ قَالَ ثُمَّ أَوْرَثْنَا الْكِتابَ الَّذِينَ اصْطَفَيْنا مِنْ عِبادِنا فَنَحْنُ الَّذِينَ اصْطَفَانَا اللَّهُ عَزَّ وَ جَلَّ وَ أَوْرَثَنَا هَذَا الَّذِي فِيهِ تِبْيَانُ كُلِّ شَيْ‏ءٍ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Abu Zahir, or someone else, from Muhammad Bin Hammad, from his father Ahmad Bin Hammad, from Ibrahim, from his father, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, said, ‘I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Inform me about the Prophet<sup>saww</sup>. Did he<sup>saww</sup> inherit the Prophets<sup>as</sup>, all of them<sup>as</sup>?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘From Adam<sup>as</sup> until it ended to himself<sup>saww</sup>?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> did not Send a Prophet<sup>saww</sup> except that Muhammad<sup>saww</sup> was more knowledgeable than him<sup>as</sup>’. ",
            "He (the narrator) said, ‘I said, ‘Isa<sup>as</sup> Ibn Maryam<sup>as</sup> used to revive the dead by the Permission of Allah<sup>azwj</sup>’. He<sup>asws</sup> said: ‘You speak the truth’. (I said), ‘And Suleyman<sup>as</sup> Bin Dawood<sup>as</sup> used to understand the speech of the bird, and was Rasool-Allah<sup>saww</sup> able to be upon this status?’ ",
            "He (the narrator) said, ‘Suleyman<sup>as</sup> Bin Dawood<sup>as</sup> said to the Hoopoe (bird) when he<sup>as</sup> missed it and doubted regarding its matter, so he<sup>as</sup> said <span class=\"ibTxt\"><a href=\"/#/books/quran:27#h20\">[27:20]</a> What is the matter that I cannot see the hoopoe or is it from the absentees?</span>, when he<sup>as</sup> missed it. So he<sup>as</sup> was angry upon it, so he<sup>as</sup> said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:27#h21\">[27:21]</a> I will punish it with a severe punishment, or slaughter it, or it brings to me a clear authorisation (for its absence)</span>’.",
            "And rather, he<sup>as</sup> was angry because it used to navigate for him upon the waters. So this one, and it was a bird, and it had been Given what Suleyman<sup>as</sup> had not been Given. And it was so that the wind, and the ant, and the humans, and the jinn, and the Satans<sup>la</sup> were chained to him<sup>asws</sup> in obedience, and he<sup>as</sup> did not happen to recognise the water beneath the atmosphere, and the bird used to recognise it. ",
            "And Allah<sup>azwj</sup> is Saying in His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:13#h31\">[13:31]</a> And even if there were a Quran by which the mountains were made to pass away, or the earth were travelled over by it, or the dead were made to speak thereby</span>, and we<sup>asws</sup> have inherited this Quran wherein is what the mountains can be made to passed with, and the cities be made to travel with, and the dead to be revived with, and we<sup>asws</sup> know the water beneath the atmosphere. ",
            "And in the Book of Allah<sup>azwj</sup> there are Verses what a matter can be intended with except that Allah<sup>azwj</sup> has Permitted with it, along with what Allah<sup>azwj</sup> had Permitted from what He<sup>azwj</sup> had Prescribed the past ones with. Allah<sup>azwj</sup> has Made it to be for us in the Mother of the Book (Umm Al-Kitab). Allah<sup>azwj</sup> is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:27#h75\">[27:75]</a> And there is nothing concealed in the sky and the earth but it is in a Clarifying Book</span>.",
            "Then He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:35#h32\">[35:32]</a> Then We Gave the Book as an inheritance to those whom We Chose from among Our servants</span>. So we<sup>asws</sup> are those whom Allah<sup>azwj</sup> Mighty and Majestic has Chosen and Made us<sup>asws</sup> to inherit this (Quran) wherein is an explanation of everything’."
          ],
          "en.sarwar": [
            " 7. Muhammad ibn Yahya has narrated from Ahmad ibn abu Zahir or another man from Muhammad ibn Hammad from his brother Ahmad ibn Hammad from Ibrahim from his father who has said the following. “I said to abu al-Hassan al-Thani (a.s.), ““May Allah take my soul in service for your cause, “Would you tell me about the Prophet who inherited all the prophets.” The Imams (a.s.) said, “Yes, I may do so. I asked, “Did he inherit from Adam up to his-self?” The Imams (a.s.) said, “Of prophet that Allah sent Prophet Muhammad (s.a.) was more knowledgeable.” I then said, “Jesus son of Mary would bring the dead to life by the permission of Allah.” The Imams (a.s.) said, “You spoke the truth. Solomon son of David could understand the language of the birds. The Holy Prophet (s.a.) was also capable of doing such things.” The narrator has said that The Imams (a.s.) then said, “Solomon son of David said to the (Hoopoe) Hud Hud when he found him missing and had doubts about the bird. “(Solomon) inspected the birds and said, “How is it that I cannot see the hoopoe {when he did not find him present and became angry}. Is he absent? <a href=\"/#/books/quran:27#h20\">[27:20]</a>. I shall certainly punish him severely or slaughter him unless he has a good reason for his absence.” <a href=\"/#/books/quran:27#h21\">[27:21]</a> He became angry because the bird would show him how to find water. This is only a bird but is given something that is not given to Solomon. The wind, ants, man, Jinn, devils and the rebbles obey him in submission but he did not know about the water in the space but the bird knew it as Allah says iin His book. “Even if the Quran would make mountains move, cut the earth into pieces and make the dead able to speak,. .” <a href=\"/#/books/quran:13#h31\">[13:31]</a> We have inherited this Quran which contains such things that can make the mountains move, cross the lands and make the dead to come to life. We know there is water in space. In the book of Aallah there are verses that are indecative of certain issues only if Allah would give permission. This is along with fact that Allah sometime grants permission to make use of the things that people of the past had written. Allah has set them for us in the origin of the book as Allah says, “All the secrets in heavens and earth are recorded in the illustrious Book. <a href=\"/#/books/quran:27#h75\">[27:75]</a> Then Allah has said, “We gave the Book as an inheritance to Our chosen servants,. .” <a href=\"/#/books/quran:35#h32\">[35:32]</a> We are the ones whom Allah, the Most Holy, the Most High, has chosen and has given this which contain the explanation of all things.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:33",
  "kind": "verse_list"
}