{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:1:4:35",
        "titles": {
          "ar": "بَابُ أَنَّهُ لَمْ يَجْمَعِ الْقُرْآنَ كُلَّهُ إِلَّا الْأَئِمَّةُ ( عليهم السلام ) وَ أَنَّهُمْ يَعْلَمُونَ عِلْمَهُ كُلَّهُ",
          "en": "Chapter 35 – No one collected the Quran, all of it, except for the Imams<sup>asws</sup>, and they<sup>asws</sup> are knowing its Knowledge, all of it"
        }
      }
    ],
    "index": 93,
    "local_index": 35,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:1:4:36",
        "titles": {
          "ar": "بَابُ مَا أُعْطِيَ الْأَئِمَّةُ ( عليهم السلام ) مِنِ اسْمِ اللَّهِ الْأَعْظَمِ",
          "en": "Chapter 36 – What has been Given to the Imams<sup>asws</sup> from the Magnificent Name of Allah<sup>azwj</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:1:4:34",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) عِنْدَهُمْ جَمِيعُ الْكُتُبِ الَّتِي نَزَلَتْ مِنْ عِنْدِ اللَّهِ عَزَّ وَ جَلَّ وَ أَنَّهُمْ يَعْرِفُونَهَا عَلَى اخْتِلَافِ أَلْسِنَتِهَا",
          "en": "Chapter 34 – The Imams<sup>asws</sup>, with them<sup>asws</sup> are the entirety of the Books which were Revealed from Allah<sup>azwj</sup> Mighty and Majestic, and they<sup>asws</sup> recognise these upon their different languages"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:35",
    "titles": {
      "ar": "بَابُ أَنَّهُ لَمْ يَجْمَعِ الْقُرْآنَ كُلَّهُ إِلَّا الْأَئِمَّةُ ( عليهم السلام ) وَ أَنَّهُمْ يَعْلَمُونَ عِلْمَهُ كُلَّهُ",
      "en": "Chapter 35 – No one collected the Quran, all of it, except for the Imams<sup>asws</sup>, and they<sup>asws</sup> are knowing its Knowledge, all of it"
    },
    "verse_count": 6,
    "verse_start_index": 605,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (30/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 606,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:35:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ عَنْ جَابِرٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ مَا ادَّعَى أَحَدٌ مِنَ النَّاسِ أَنَّهُ جَمَعَ الْقُرْآنَ كُلَّهُ كَمَا أُنْزِلَ إِلَّا كَذَّابٌ وَ مَا جَمَعَهُ وَ حَفِظَهُ كَمَا نَزَّلَهُ اللَّهُ تَعَالَى إِلَّا عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) وَ الْأَئِمَّةُ مِنْ بَعْدِهِ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Amro Bin Abu Al Miqdam, from Jabir who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘No one from the people would claim that he has collected the Quran, all of it, just as it was Revealed, except he would be a liar, and not one collected it and memorised it just as Allah<sup>azwj</sup> the Exalted Revealed it except for Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> and the Imams<sup>asws</sup> from after him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ‘Amr ibn abu al-Miqdam from Jabir who has said that he heard abu Ja‘far (a.s.) say the following. “No one from the people has claimed to have collected the whole of the Holy Quran (in a book form) as it was revealed. If anyone would come up with such a claim, he is liar. No one collected this Holy Book and memorized as Allah, the Most Holy, the Most High revealed it except Ali ibn abu Talib (a.s.) and the Imams after him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/32)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 607,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:35:2",
        "text": [
          "مُحَمَّدُ بْنُ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنِ الْمُنَخَّلِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ قَالَ مَا يَسْتَطِيعُ أَحَدٌ أَنْ يَدَّعِيَ أَنَّ عِنْدَهُ جَمِيعَ الْقُرْآنِ كُلِّهِ ظَاهِرِهِ وَ بَاطِنِهِ غَيْرُ الْأَوْصِيَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Husayn, from Muhammad Bin Al Hassan, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Al Mankhal, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘No one is able to claim that with him is the entirety of the Quran, all of it, it’s apparent, and its hidden, apart from the succesors<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn al-Husayn has narrated from Muhammad ibn al-Hassan from Muhammad ibn Sinan from ‘Ammar ibn Marwan from al-Munakhkhal from Jabir from abu Ja‘far (a.s.) who has said the following. “No one is able to claim that with him is the whole of the Holy Quran; its apparent and hidden essence, except the executors of the will of the Holy Prophet (s.a.)."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (32/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 608,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:35:3",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْقَاسِمِ بْنِ الرَّبِيعِ عَنْ عُبَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي هَاشِمٍ الصَّيْرَفِيِّ عَنْ عَمْرِو بْنِ مُصْعَبٍ عَنْ سَلَمَةَ بْنِ مُحْرِزٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ مِنْ عِلْمِ مَا أُوتِينَا تَفْسِيرَ الْقُرْآنِ وَ أَحْكَامَهُ وَ عِلْمَ تَغْيِيرِ الزَّمَانِ وَ حَدَثَانِهِ إِذَا أَرَادَ اللَّهُ بِقَوْمٍ خَيْراً أَسْمَعَهُمْ وَ لَوْ أَسْمَعَ مَنْ لَمْ يَسْمَعْ لَوَلَّى مُعْرِضاً كَأَنْ لَمْ يَسْمَعْ ثُمَّ أَمْسَكَ هُنَيْئَةً ",
          "ثُمَّ قَالَ وَ لَوْ وَجَدْنَا أَوْعِيَةً أَوْ مُسْتَرَاحاً لَقُلْنَا وَ اللَّهُ الْمُسْتَعَانُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Al Qasim Bin Al Rabie, from Ubeyd Bin Abdullah Bin Abu Hashim Al Sayrafi, from Amro Bin Mus’ab, from Salma Bin Muhriz who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘From the Knowledge which we<sup>asws</sup> have been Given is the interpretation of the Quran, and its Judgments, and knowledge of the changing of times and its new occurrences. Whenever Allah<sup>azwj</sup> Intends good with a people, He<sup>azwj</sup> Causes them to listen, and if someone hears whom He<sup>azwj</sup> Does not Want him to hear, he would turn around as if he had not heard’.",
            "Then he<sup>asws</sup> waited for a while, then said: ‘If we<sup>asws</sup> were to find a retaining ear or a receptacle, we<sup>asws</sup> would say (tell all), and Allah<sup>azwj</sup> is the Aider’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from al-Qasim ibn al-Rabi‘ from ‘Ubayd ibn ‘Abdallah ibn abu Hashim al-Sayrafi from ‘Amr ibn Mus‘ab from Salma ibn Muhriz who has said that he heard abu Ja‘far (a.s.) say the following. “Of the knowledge that we have received is the interpretation of the Holy Quran and its laws, the knowledge of the changes of time and the happenings therein. When Allah wants good for a people, He makes them to understand. If He would make to understand one who does not want to understand such a person turns away as if he has heard nothing. The Imams (a.s.) paused, briefly, then said, “Had we found keepers and trusted people for our knowledge, we would have said it (all to him). Allah is the best supporter.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (33/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 609,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:35:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ الْمُؤْمِنِ عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَ اللَّهِ إِنِّي لَأَعْلَمُ كِتَابَ اللَّهِ مِنْ أَوَّلِهِ إِلَى آخِرِهِ كَأَنَّهُ فِي كَفِّي فِيهِ خَبَرُ السَّمَاءِ وَ خَبَرُ الْأَرْضِ وَ خَبَرُ مَا كَانَ وَ خَبَرُ مَا هُوَ كَائِنٌ قَالَ اللَّهُ عَزَّ وَ جَلَّ فِيهِ تِبْيَانُ كُلِّ شَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Isa, from Abu Abdullah Al Momin, from Abdul A’ala, a slave of the family of Saam who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> am more knowing of the Book of Allah<sup>azwj</sup>, from its beginning to its end, as if it was in my<sup>asws</sup> palm. Therein is news of the sky and news of the earth, and news of what has occurred, and news of what is going to occur. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[16:89] and in it is clarification of everything</span>’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ’Isa from abu ‘Abdallah al-Mu‘min from ‘Abd al-A‘la Mawla ’Ala Sam who has said that he heard abu ‘Abdallah (a.s.) say the following. “I swear by Allah that I know the Holy Quran from the beginning to end as if it is in the palm of my hand. In it there is the news of the heavens and the earth, the news of what has been and the new of what will come into being. Allah, the Most Holy, the Most High, has said, “In it there is the explanation of all things.” (16:89)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/33)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 610,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:35:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ أَبِي زَاهِرٍ عَنِ الْخَشَّابِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قالَ الَّذِي عِنْدَهُ عِلْمٌ مِنَ الْكِتابِ أَنَا آتِيكَ بِهِ قَبْلَ أَنْ يَرْتَدَّ إِلَيْكَ طَرْفُكَ ",
          "قَالَ فَفَرَّجَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بَيْنَ أَصَابِعِهِ فَوَضَعَهَا فِي صَدْرِهِ ثُمَّ قَالَ وَ عِنْدَنَا وَ اللَّهِ عِلْمُ الْكِتَابِ كُلُّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Abu Zahir, from Al Khashaab, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘<span class=\"ibTxt\">[27:40] The one who had the knowledge from the Book said</span> – I<sup>asws</sup> can come with it (Throne of Bilquis) before your eyelid blinks’.",
            "He (the narrator) said, ‘So Abu Abdullah<sup>asws</sup> parted between his<sup>asws</sup> fingers and placed them upon his<sup>asws</sup> chest, then said: ‘And with us<sup>asws</sup>, by Allah<sup>azwj</sup>, is the Knowledge of the Book, all of it’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from Ahmad ibn abu Zahir from al-Khashshab from Ali ibn Hass’an from ‘Abd al-Rahman ibn Kathir from abu ‘Abdallah (a.s.) who recited the following verse. “The one who had knowledge from the Book said, “I can bring it to you before you even blink your eye. . .” (27:40). The narrator has said that the Imams (a.s.) opend his two fingers and placed them on his chest and then said, “With us, I swear by Allah, is the knowledge of the whole of the Book.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (34/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 611,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:35:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَمَّنْ ذَكَرَهُ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) قُلْ كَفى بِاللَّهِ شَهِيداً بَيْنِي وَ بَيْنَكُمْ وَ مَنْ عِنْدَهُ عِلْمُ الْكِتابِ قَالَ إِيَّانَا عَنَى وَ عَلِيٌّ أَوَّلُنَا وَ أَفْضَلُنَا وَ خَيْرُنَا بَعْدَ النَّبِيِّ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Yahya, from Muhammad Bin Al Hassan, from the one who metioned it, altogether from Ibn Abu Umeyr, from Ibn Azina, from Bureyd Bin Muawiya who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘<span class=\"ibTxt\">[13:43] Say: Allah is Sufficient as a Witness between me and you and the one who has Knowledge of the Book</span>. He<sup>asws</sup> said: ‘It Means us<sup>asws</sup>, and Ali<sup>asws</sup> is our<sup>asws</sup> first one, and the most superior of us<sup>asws</sup>, and the best of us<sup>asws</sup> after the Prophet<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 6. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Yahya from Muhammad ibn al-Hassan from those he mentioned, both of them from ibn abu ‘Umayr from ibn ’Udhayna from Burayd ibn Mu‘awiya who has said that he asked abu Ja‘far (a.s.) about the meaning of the following verse. “. . Say, ‘God and those who have the knowledge of the Book are sufficient witness (to my prophet-hood).’” (13:43) The Imam (a.s.) said, “It is a reference to us. Ali (a.s.) is the first among us and the most virtuous and the best among us after the Holy Prophet (s.a.)”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:35",
  "kind": "verse_list"
}