{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 37"}, "path": "/books/al-kafi:1:4:37", "titles": {"ar": "بَابُ مَا عِنْدَ الْأَئِمَّةِ مِنْ آيَاتِ الْأَنْبِيَاءِ ( عليهم السلام )", "en": "Chapter 37 – What is with the Imams<sup>asws</sup> from the Signs of the Prophets<sup>as</sup>"}}], "index": 95, "local_index": 37, "part_type": "Chapter", "path": "/books/al-kafi:1:4:37", "titles": {"ar": "بَابُ مَا عِنْدَ الْأَئِمَّةِ مِنْ آيَاتِ الْأَنْبِيَاءِ ( عليهم السلام )", "en": "Chapter 37 – What is with the Imams<sup>asws</sup> from the Signs of the Prophets<sup>as</sup>"}, "verse_count": 5, "verse_start_index": 614, "verses": [{"index": 615, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:37:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ مَنِيعِ بْنِ الْحَجَّاجِ الْبَصْرِيِّ عَنْ مُجَاشِعٍ عَنْ مُعَلًّى عَنْ مُحَمَّدِ بْنِ الْفَيْضِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَتْ عَصَا مُوسَى لآِدَمَ ( عليه السلام ) فَصَارَتْ إِلَى شُعَيْبٍ ثُمَّ صَارَتْ إِلَى مُوسَى بْنِ عِمْرَانَ وَ إِنَّهَا لَعِنْدَنَا وَ إِنَّ عَهْدِي بِهَا آنِفاً وَ هِيَ خَضْرَاءُ كَهَيْئَتِهَا حِينَ انْتُزِعَتْ مِنْ شَجَرَتِهَا وَ إِنَّهَا لَتَنْطِقُ إِذَا اسْتُنْطِقَتْ أُعِدَّتْ لِقَائِمِنَا ( عليه السلام ) يَصْنَعُ بِهَا مَا كَانَ يَصْنَعُ مُوسَى وَ إِنَّهَا لَتَرُوعُ وَ تَلْقَفُ مَا يَأْفِكُونَ وَ تَصْنَعُ مَا تُؤْمَرُ بِهِ إِنَّهَا حَيْثُ أَقْبَلَتْ تَلْقَفُ مَا يَأْفِكُونَ يُفْتَحُ لَهَا شُعْبَتَانِ إِحْدَاهُمَا فِي الْأَرْضِ وَ الْأُخْرَى فِي السَّقْفِ وَ بَيْنَهُمَا أَرْبَعُونَ ذِرَاعاً تَلْقَفُ مَا يَأْفِكُونَ بِلِسَانِهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Abdullah Bin Muhammad, from Munie Al Haaj Al Basry, from Mujashie, from Moalla, from Muhammad Bin Al Fayz, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Staff of Musa<sup>as</sup> was (actually) for Adam<sup>as</sup> (beforehand). So it came to be to Shuayb<sup>as</sup>, then it came to be to Musa<sup>as</sup> Bin Imran<sup>as</sup>, and it is with us<sup>asws</sup>, and that I<sup>asws</sup> looked at it just now, and it is green as if it has been just snatched from its tree, and it tends to speak when spoken to. It is prepared for our<sup>asws</sup> Qaim<sup>asws</sup>. He<sup>asws</sup> would do with it what Musa<sup>as</sup> did with it. And it would intimidate and devour whatever they would be falsifying, and it does whatever it is ordered with. It, when faced, would devour whatever they would be falsifying, by two branches opening out for it, one of them in the ground, and the other in the ceiling, and between the two would be (a distance of) forty cubits, devouring whatever they would be falsifying, with its tongue’."}]}, {"index": 616, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:37:2", "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ عِمْرَانَ بْنِ مُوسَى عَنْ مُوسَى بْنِ جَعْفَرٍ الْبَغْدَادِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ أَلْوَاحُ مُوسَى ( عليه السلام ) عِنْدَنَا وَ عَصَا مُوسَى عِنْدَنَا وَ نَحْنُ وَرَثَةُ النَّبِيِّينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Idrees, from Imran Bin Musa, from Musa Bin Ja’far Al Baghdady, from Ali Bin Asbat, from Muhammad Bin Al Fuzayl, from Abu Hamza Al Sumaly, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘The Tablets of Musa<sup>as</sup> are with us<sup>asws</sup>, and the Staff of Musa<sup>as</sup> is with us<sup>asws</sup>, and we<sup>asws</sup> are the inheritors of the Prophets<sup>as</sup>’."}]}, {"index": 617, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:37:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُوسَى بْنِ سَعْدَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ أَبِي سَعِيدٍ الْخُرَاسَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ الْقَائِمَ إِذَا قَامَ بِمَكَّةَ وَ أَرَادَ أَنْ يَتَوَجَّهَ إِلَى الْكُوفَةِ نَادَى مُنَادِيهِ أَلَا لَا يَحْمِلْ أَحَدٌ مِنْكُمْ طَعَاماً وَ لَا شَرَاباً وَ يَحْمِلُ حَجَرَ مُوسَى بْنِ عِمْرَانَ وَ هُوَ وِقْرُ بَعِيرٍ فَلَا يَنْزِلُ مَنْزِلًا إِلَّا انْبَعَثَ عَيْنٌ مِنْهُ فَمَنْ كَانَ جَائِعاً شَبِعَ وَ مَنْ كَانَ ظَامِئاً رَوِيَ فَهُوَ زَادُهُمْ حَتَّى يَنْزِلُوا النَّجَفَ مِنْ ظَهْرِ الْكُوفَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Musa Bin Sa’dan, from Abdullah Bin Al Qasim, from Abu Saeed Al Khurasany, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abu Ja’far<sup>asws</sup> said: ‘The Qaim<sup>asws</sup>, when he<sup>asws</sup> arises at Makkah and intends to divert towards Al-Kufa, a Caller would Call out: ‘Indeed! Not one of you should carry the food nor any drink, and he should carry a rock of Musa<sup>as</sup> Bin Imran<sup>as</sup>, and it would be the load of a camel!’ So they would not descend at an encampment except a spring would burst out from it. So whoever would be hungry, would be satiated, and the one who was thirsty would be quenched. Thus, it would be their provision until they encamp at Al-Najaf, which is behind Al-Kufa’."}]}, {"index": 618, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:37:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُوسَى بْنِ سَعْدَانَ عَنْ أَبِي الْحَسَنِ الْأَسَدِيِّ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ خَرَجَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) ذَاتَ لَيْلَةٍ بَعْدَ عَتَمَةٍ وَ هُوَ يَقُولُ هَمْهَمَةً هَمْهَمَةً وَ لَيْلَةً مُظْلِمَةً خَرَجَ عَلَيْكُمُ الْإِمَامُ عَلَيْهِ قَمِيصُ آدَمَ وَ فِي يَدِهِ خَاتَمُ سُلَيْمَانَ وَ عَصَا مُوسَى ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin yahya, from Muhammad Bin Al Husayn, from Musa Bin Sa’dan, from Abu Al Hassan Al Asady, from Abu Baseer, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> went out one night after dark, and he<sup>asws</sup> was saying, muttering, murmuring: ‘And the night is dark, the Imam<sup>asws</sup> has come out to you all! Upon him<sup>asws</sup> is the shirt of Adam<sup>as</sup>, and in his<sup>asws</sup> hand is a ring of Suleyman and a Staff of Musa<sup>as</sup>’."}]}, {"index": 619, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:37:5", "text": "مُحَمَّدٌ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنْ بِشْرِ بْنِ جَعْفَرٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ أَ تَدْرِي مَا كَانَ قَمِيصُ يُوسُفَ ( عليه السلام ) قَالَ قُلْتُ لَا قَالَ إِنَّ إِبْرَاهِيمَ ( عليه السلام ) لَمَّا أُوقِدَتْ لَهُ النَّارُ أَتَاهُ جَبْرَئِيلُ ( عليه السلام ) بِثَوْبٍ مِنْ ثِيَابِ الْجَنَّةِ فَأَلْبَسَهُ إِيَّاهُ فَلَمْ يَضُرَّهُ مَعَهُ حَرٌّ وَ لَا بَرْدٌ \nفَلَمَّا حَضَرَ إِبْرَاهِيمَ الْمَوْتُ جَعَلَهُ فِي تَمِيمَةٍ وَ عَلَّقَهُ عَلَى إِسْحَاقَ وَ عَلَّقَهُ إِسْحَاقُ عَلَى يَعْقُوبَ فَلَمَّا وُلِدَ يُوسُفُ ( عليه السلام ) عَلَّقَهُ عَلَيْهِ فَكَانَ فِي عَضُدِهِ حَتَّى كَانَ مِنْ أَمْرِهِ مَا كَانَ فَلَمَّا أَخْرَجَهُ يُوسُفُ بِمِصْرَ مِنَ التَّمِيمَةِ وَجَدَ يَعْقُوبُ رِيحَهُ وَ هُوَ قَوْلُهُ إِنِّي لَأَجِدُ رِيحَ يُوسُفَ لَوْ لا أَنْ تُفَنِّدُونِ. فَهُوَ ذَلِكَ الْقَمِيصُ الَّذِي أَنْزَلَهُ اللَّهُ مِنَ الْجَنَّةِ\nقُلْتُ جُعِلْتُ فِدَاكَ فَإِلَى مَنْ صَارَ ذَلِكَ الْقَمِيصُ قَالَ إِلَى أَهْلِهِ ثُمَّ قَالَ كُلُّ نَبِيٍّ وَرِثَ عِلْماً أَوْ غَيْرَهُ فَقَدِ انْتَهَى إِلَى آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad, from Muhammad Bin Al Husay, from Muhammad Bin Ismail, from Abu Ismail Al Sarraj, from Bishr Bin Ja’far, from Mufazzal Bin Umar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Do you know what was the shirt of Yusuf<sup>as</sup>?’ I said, ‘No’. He<sup>asws</sup> said: ‘Ibrahim<sup>as</sup>, when the fire was inflamed for him<sup>as</sup>, Jibraeel<sup>as</sup> came over to him<sup>as</sup> with a cloth from the clothes of the Paradise. So he<sup>as</sup> wore it, and with it, the heat and the cold did not harm him<sup>as</sup>. \nSo when the death presented itself to Ibrahim<sup>as</sup>, he<sup>as</sup> made it to be in an amulet and hung it upon Is’haq<sup>as</sup>, and Is’haq<sup>as</sup> hung it upon Yaqoub. So when Yusuf<sup>as</sup> was born, he<sup>as</sup> hung it upon him<sup>as</sup>. Thus, it was on his<sup>as</sup> shoulder until it was from his<sup>as</sup> affair which was. So when Yusuf<sup>as</sup> took it out from the amulet in Egypt, Yaqoub<sup>as</sup> found its smell, and these are his<sup>as</sup> words <span class=\"ibTxt\">[12:94] Surely I find the aroma of Yusuf, unless you pronounce me to be weak minded</span>. So it was that shirt which Allah<sup>azwj</sup> Sent down from the Paradise’\nI said, ‘May I be sacrificed for you<sup>asws</sup>! So to whom has that shirt come to be?’ He<sup>asws</sup> said: ‘To its rightful ones’. Then he<sup>asws</sup> said: ‘Every Prophet<sup>as</sup> inherited knowledge or something else, so it has ended up to the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’."}]}]}, "index": "al-kafi:1:4:37", "kind": "verse_list"}