{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 38"
        },
        "path": "/books/al-kafi:1:4:38",
        "titles": {
          "ar": "بَابُ مَا عِنْدَ الْأَئِمَّةِ مِنْ سِلَاحِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مَتَاعِهِ",
          "en": "Chapter 38 – What is with the Imams<sup>asws</sup> from the weapons of Rasool-Allah<sup>saww</sup> and his<sup>saww</sup> chattels"
        }
      }
    ],
    "index": 96,
    "local_index": 38,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 39"
        },
        "path": "/books/al-kafi:1:4:39",
        "titles": {
          "ar": "بَابُ أَنَّ مَثَلَ سِلَاحِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مَثَلُ التَّابُوتِ فِي بَنِي إِسْرَائِيلَ",
          "en": "Chapter 39 – An example of the weapons of Rasool-Allah<sup>saww</sup> is an example of the Ark among the Children of Israel"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 37"
        },
        "path": "/books/al-kafi:1:4:37",
        "titles": {
          "ar": "بَابُ مَا عِنْدَ الْأَئِمَّةِ مِنْ آيَاتِ الْأَنْبِيَاءِ ( عليهم السلام )",
          "en": "Chapter 37 – What is with the Imams<sup>asws</sup> from the Signs of the Prophets<sup>as</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:38",
    "titles": {
      "ar": "بَابُ مَا عِنْدَ الْأَئِمَّةِ مِنْ سِلَاحِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مَتَاعِهِ",
      "en": "Chapter 38 – What is with the Imams<sup>asws</sup> from the weapons of Rasool-Allah<sup>saww</sup> and his<sup>saww</sup> chattels"
    },
    "verse_count": 9,
    "verse_start_index": 619,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/41)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 620,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/165",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/722",
              "text": "سَعِيدٍ السَّمَّانِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ سَعِيدٍ السَّمَّانِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:38:1",
        "relations": {
          "Mentions": [
            "/books/quran:2:248"
          ]
        },
        "text": [
          " كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذْ دَخَلَ عَلَيْهِ رَجُلَانِ مِنَ الزَّيْدِيَّةِ فَقَالَا لَهُ أَ فِيكُمْ إِمَامٌ مُفْتَرَضُ الطَّاعَةِ قَالَ فَقَالَ لَا قَالَ فَقَالَا لَهُ قَدْ أَخْبَرَنَا عَنْكَ الثِّقَاتُ أَنَّكَ تُفْتِي وَ تُقِرُّ وَ تَقُولُ بِهِ وَ نُسَمِّيهِمْ لَكَ فُلَانٌ وَ فُلَانٌ وَ هُمْ أَصْحَابُ وَرَعٍ وَ تَشْمِيرٍ وَ هُمْ مِمَّنْ لَا يَكْذِبُ ",
          "فَغَضِبَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ مَا أَمَرْتُهُمْ بِهَذَا فَلَمَّا رَأَيَا الْغَضَبَ فِي وَجْهِهِ خَرَجَا فَقَالَ لِي أَ تَعْرِفُ هَذَيْنِ قُلْتُ نَعَمْ هُمَا مِنْ أَهْلِ سُوقِنَا وَ هُمَا مِنَ الزَّيْدِيَّةِ وَ هُمَا يَزْعُمَانِ أَنَّ سَيْفَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عِنْدَ عَبْدِ اللَّهِ بْنِ الْحَسَنِ",
          "فَقَالَ كَذَبَا لَعَنَهُمَا اللَّهُ وَ اللَّهِ مَا رَآهُ عَبْدُ اللَّهِ بْنُ الْحَسَنِ بِعَيْنَيْهِ وَ لَا بِوَاحِدَةٍ مِنْ عَيْنَيْهِ وَ لَا رَآهُ أَبُوهُ اللَّهُمَّ إِلَّا أَنْ يَكُونَ رَآهُ عِنْدَ عَلِيِّ بْنِ الْحُسَيْنِ فَإِنْ كَانَا صَادِقَيْنِ فَمَا عَلَامَةٌ فِي مَقْبِضِهِ وَ مَا أَثَرٌ فِي مَوْضِعِ مَضْرَبِهِ وَ إِنَّ عِنْدِي لَسَيْفَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِنَّ عِنْدِي لَرَايَةَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ دِرْعَهُ وَ لَامَتَهُ وَ مِغْفَرَهُ",
          "فَإِنْ كَانَا صَادِقَيْنِ فَمَا عَلَامَةٌ فِي دِرْعِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِنَّ عِنْدِي لَرَايَةَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الْمِغْلَبَةَ وَ إِنَّ عِنْدِي أَلْوَاحَ مُوسَى وَ عَصَاهُ وَ إِنَّ عِنْدِي لَخَاتَمَ سُلَيْمَانَ بْنِ دَاوُدَ وَ إِنَّ عِنْدِي الطَّسْتَ الَّذِي كَانَ مُوسَى يُقَرِّبُ بِهِ الْقُرْبَانَ ",
          "وَ إِنَّ عِنْدِي الِاسْمَ الَّذِي كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا وَضَعَهُ بَيْنَ الْمُسْلِمِينَ وَ الْمُشْرِكِينَ لَمْ يَصِلْ مِنَ الْمُشْرِكِينَ إِلَى الْمُسْلِمِينَ نُشَّابَةٌ وَ إِنَّ عِنْدِي لَمِثْلَ الَّذِي جَاءَتْ بِهِ الْمَلَائِكَةُ وَ مَثَلُ السِّلَاحِ فِينَا كَمَثَلِ التَّابُوتِ فِي بَنِي إِسْرَائِيلَ ",
          "كَانَتْ بَنُو إِسْرَائِيلَ فِي أَيِّ أَهْلِ بَيْتٍ وُجِدَ التَّابُوتُ عَلَى أَبْوَابِهِمْ أُوتُوا النُّبُوَّةَ وَ مَنْ صَارَ إِلَيْهِ السِّلَاحُ مِنَّا أُوتِيَ الْإِمَامَةَ وَ لَقَدْ لَبِسَ أَبِي دِرْعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَخَطَّتْ عَلَى الْأَرْضِ خَطِيطاً وَ لَبِسْتُهَا أَنَا فَكَانَتْ وَ كَانَتْ وَ قَائِمُنَا مَنْ إِذَا لَبِسَهَا مَلَأَهَا إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Muawiya Bin Wahab, from Saeed Al Samman who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup> when two men from the Zaydiites came over to him<sup>asws</sup>. So they said to him<sup>asws</sup>, ‘Is there an Imam<sup>asws</sup> among you the obedience to whom is Obligatory?’ So he<sup>asws</sup> said: ‘No’. So they said to him<sup>asws</sup>, ‘The reliable ones have informed us from you<sup>asws</sup> that you<sup>asws</sup> tend to issue Fatwas, and are acknowledging as such and are saying with it, and we can name them to you, so and so, and so and so, and they are companions of piety and alertness, and they are from the ones who cannot be belied’. ",
            "So Abu Abdullah<sup>asws</sup> got angered and he<sup>asws</sup> said: ‘I<sup>asws</sup> did not order them with this!’. So when they saw the anger in his<sup>asws</sup> face, they went out. So he<sup>asws</sup> said to me: ‘Do you know these two?’ I said, ‘Yes, they are both from the people of our market, and they are both from the Zaydiites, and they both allege that the sword of Rasool-Allah<sup>saww</sup> is with Abdullah Bin Al-Hassan’. ",
            "So he<sup>asws</sup> said: ‘They are both lying! May Allah<sup>azwj</sup> Curse them! Abdullah Bin Al-Hassan has not seen it with his two eyes, nor with one of his eyes, nor has his father seen it , O Allah<sup>azwj</sup>, except if he happened to have seen it with Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>. So if these two were truthful, so what is the mark in its sheath? And what is trace in its blade? And with me<sup>asws</sup> is the sword of Rasool-Allah<sup>saww</sup>, and with me<sup>asws</sup> is the flag of Rasool-Allah<sup>saww</sup>, and his<sup>saww</sup> armour, and his<sup>saww</sup> insignia, and his<sup>saww</sup> helmet.  ",
            "So if they were truthful, so what is the mark in the armour of Rasool-Allah<sup>saww</sup>, and with me<sup>asws</sup> is the flag of Rasool-Allah<sup>saww</sup>, the victorious, and with me<sup>asws</sup> are the Tablets of Musa<sup>as</sup> and his<sup>as</sup> Staff, and with me<sup>asws</sup> is the ring of Suleyman<sup>as</sup> Bin Dawood<sup>as</sup>, and with me<sup>asws</sup> is the tray in which Musa<sup>as</sup> used to offer the sacrificial offering with it.",
            "And with me<sup>asws</sup> is the Name which Rasool-Allah<sup>saww</sup>, whenever he<sup>saww</sup> placed it between the Muslims and the Polytheists, no arrow arrived from the Polytheists to the Muslims, and with me<sup>asws</sup> are the remnants which the Angels came with, and the examples of the weapons with us<sup>asws</sup> is like an example of the Ark among the Children of Israel. ",
            "The Children of Israel were such that whichever family the Ark was found to be upon their door, were Given the Prophet-hood, and the ones from us<sup>asws</sup> to whom the weapons come to be, is Given the Imamate. My<sup>asws</sup> father<sup>asws</sup> had worn the armour of Rasool-Allah<sup>saww</sup>, so it made lines upon the ground, and I<sup>asws</sup> wore it, so it was and it was (big), and our<sup>asws</sup> Qaim<sup>asws</sup> is the one when he<sup>asws</sup> wears it, it would fit (perfectly), if Allah<sup>azwj</sup> so Desires it’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Mu’awiya ibn Wahab from Sa‘id al-Samman who has said the following. “I was in the presence of abu ‘Abdallah (a.s.) when two people from the Zaydia sect came to him. They asked, “Is there with you an Imam obedience to whom is obligatory?” The narrator has said that the Imams (a.s.) said, “No, there no one as suCh” They then said, “Reliable people have informed us about you that you issue fatwas and that you affirm and speak of it. We can point out what their names are. They are very pious alert people. They are such that can not be rejected. The Imams (a.s.) became angry and said, “I have not ordered them to say so.” When the two men notice anger from the face of The Imams (a.s.) they left.” The Imams (a.s.) then asked me, “Do you know these two?” I said, “Yes, I know them. They are from our Suq (shopping center). They belong to the Zaydia sect and they think that the sword of the Holy Prophet (s.a.) is with ‘Abdallah ibn al-Hassan.” The Imams (a.s.) said, “They have lied, may Allah condemn them. I swear by Allah, ‘Abdallah ibn al-Hassan has not seen it with his own eyes, not even of his eyes has seen it. Even his father had seen it except if he might have seen it with Imam Ali ibn al-Husayn (a.s.). If they are truthful let them say what kind of mark does its hilt have and what is the mark on its blade? With me is the sword of the Messenger of Allah, with me is the flag of the Messenger, his coat of arms, his Lamam (pennon) and his helmet. If they are truthful let them say what kind of mark does the coat of arms of the Messenger of Allah has? With me is the flag of the Messenger of Allah, the victorious. With me is the Staff of Moses. With me is the ring of Solomon son of David. With me is tray on Moses used to offer offerings. With me is the name that whenever the Messenger of Allah would place it between the Muslims and pagans no arrow from the pagans would reach the Muslims. With me is the similar object that angels brought.” Perhaps The Imams (a.s.) has hinted to the following verse. ‘Their Prophet further told them, “As the evidence of his authority, he will bring to you the Ark which will be a comfort to you from your Lord and a legacy of the household of Moses and Aaron. It will be carried by the angels. This is the evidence for you if you have faith.’ <a href=\"/#/books/quran:2#h248\">[2:248]</a> The case of the Arms with us is like the case of the Ark in the Israelites. Whichever family would have had the Ark at their door-front that family would receive prophet-hood. To whoever of us the Arms are transferred he receives Imamat (leadership with Divine authority). My father wore the coats of arms of the Messenger of Allah. It would reach the earth and leave marks. I wore it also and it reached the earth and sometimes it would not. When the one from us who, will rise to establish the authority of Allah on earth, will come it will fit him perfectly, if Allah would so will.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (44/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 621,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/145",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/131",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/73",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/303",
              "text": "عَبْدِ الْأَعْلَى بْنِ أَعْيَنَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَبْدِ الْأَعْلَى بْنِ أَعْيَنَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:38:2",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ عِنْدِي سِلَاحُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَا أُنَازَعُ فِيهِ ",
          "ثُمَّ قَالَ إِنَّ السِّلَاحَ مَدْفُوعٌ عَنْهُ لَوْ وُضِعَ عِنْدَ شَرِّ خَلْقِ اللَّهِ لَكَانَ خَيْرَهُمْ",
          "ثُمَّ قَالَ إِنَّ هَذَا الْأَمْرَ يَصِيرُ إِلَى مَنْ يُلْوَى لَهُ الْحَنَكُ فَإِذَا كَانَتْ مِنَ اللَّهِ فِيهِ الْمَشِيئَةُ خَرَجَ فَيَقُولُ النَّاسُ مَا هَذَا الَّذِي كَانَ وَ يَضَعُ اللَّهُ لَهُ يَداً عَلَى رَأْسِ رَعِيَّتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Hammad Bin Usman, from Abdul A’ala Bin Ayn who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘With me<sup>asws</sup> are the weapons of Rasool-Allah<sup>saww</sup>, there is no dispute with regards to it’.",
            "Then he<sup>asws</sup> said: ‘The weapons are defended from. If these were placed with the most evil creature of Allah<sup>azwj</sup>, he would be the best of them’. ",
            "Then he<sup>asws</sup> said: ‘This matter (Divine Authority) comes to be to the one for whom the jaws would drop, so when it would be the Desire from Allah<sup>azwj</sup> with regards to it, so the people would be saying, ‘What is this which has happened?’ And Allah<sup>azwj</sup> would Place for him<sup>asws</sup>, and Hand upon the heads of his<sup>asws</sup> citizens’."
          ],
          "en.sarwar": [
            " 2. Al-Husayn ibn Muhammad al-Asha‘ari has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Hammad ibn ‘Uthman from ‘Abdallah ‘Ala’ ibn A‘yan who has said that he heard abu ‘Abdallah (a.s.) say the following. “With me is the arms of the Messenger of Allah. It is not disputable.” The Imam (a.s.) then said, “The Arms are well defended. If they would be place with the worst creature of Allah he will be very good among them.” The Imam (a.s.) then said, “This matter (leadership with Divine authority) will proceed to the one who will enjoy total obedience. When Allah’s will grant permission he will appear in public and people will say, “What is this happening?” Allah will make his hand to protect his followers and subjects.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (45/ 3)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/30)"
        ],
        "index": 622,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/233",
              "text": "يَحْيَى الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:38:3",
        "text": [
          " قَالَ تَرَكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي الْمَتَاعِ سَيْفاً وَ دِرْعاً وَ عَنَزَةً وَ رَحْلًا وَ بَغْلَتَهُ الشَّهْبَاءَ فَوَرِثَ ذَلِكَ كُلَّهُ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Ibn Muskan, from Abu baser, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> left behind among the chattels, a sword, and a shield, and a spear, and a saddle, and a grey mule. So all of that was inherited by Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya al-Halabi from ibn Muskan from abu Basir from abu ‘Abdallah (a.s.) who has said the following. “Of the legacy that the Messenger of Allah left was a sword, a coat of arms, a spears, a saddle and a gray mule. Ali ibn abu Talib (a.s.) inherited all of them.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/45)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 623,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/63",
              "text": "الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/516",
              "text": "فُضَيْلِ بْنِ يَسَارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:38:4",
        "text": [
          " لَبِسَ أَبِي دِرْعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ذَاتَ الْفُضُولِ فَخَطَّتْ وَ لَبِسْتُهَا أَنَا فَفَضَلَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Aban Bin Usman, from Fuzayl Bin Yasar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘My<sup>asws</sup> father<sup>asws</sup> wore the armour of Rasool-Allah<sup>saww</sup>, <span class=\"iTxt\">Zat Al-Fuzoul</span>, so it made lines (dragging on the ground), and I<sup>asws</sup> wore it, so it was surplus (bigger)’."
          ],
          "en.sarwar": [
            " 4. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from Aban ibn ‘Uthman from Fudayl ibn Yasar from abu ‘Abdallah (a.s.) who has said the following. “ My father wore the Dhat al-Fdul, coat of arms of the Messenger of Allah and being taller for him it left marks on the ground. I wore it and it was taller for me also.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح ظاهرا ولكن في السند غرابه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/45)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 624,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/563",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/434",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/90",
              "text": "أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:38:5",
        "text": [
          " سَأَلْتُهُ عَنْ ذِي الْفَقَارِ سَيْفِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنْ أَيْنَ هُوَ قَالَ هَبَطَ بِهِ جَبْرَئِيلُ ( عليه السلام ) مِنَ السَّمَاءِ وَ كَانَتْ حِلْيَتُهُ مِنْ فِضَّةٍ وَ هُوَ عِنْدِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, and Muhgammad Bin Yahya, from Muhammad Bin Al Hassan, from Muhammad Bin Isa, from Ahmad Bin Abu Abdullah, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about <span class=\"iTxt\">Zi Al-Faqar</span>, the sword of Rasool-Allah<sup>saww</sup>, from where is it?’ He<sup>asws</sup> said: ‘Jibraeel<sup>as</sup> descended with it from the sky, and its sheath was of silver, and it is with me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 5. hmad ibn Muhammad and Muhammad ibn Yahya have narrated from Muhammad ibn al-Hassan from Muhammad ibn ‘Isa from Ahmad ibn abu ‘Abdallah who has said that he asked abu al-Hassan al-Rida (a.s.) about al-Dhulfaqar, the sword of the Messenger of Allah as to wherefrom it was. The Imam (a.s.) said, “Jibril came down with it from the heavens. It was decorated with gold and it is with me now.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (46/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 625,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/282",
              "text": "مُحَمَّدِ بْنِ حَكِيمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/441",
              "text": "أَبِي إِبْرَاهِيمَ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:38:6",
        "text": [
          " السِّلَاحُ مَوْضُوعٌ عِنْدَنَا مَدْفُوعٌ عَنْهُ لَوْ وُضِعَ عِنْدَ شَرِّ خَلْقِ اللَّهِ كَانَ خَيْرَهُمْ ",
          "لَقَدْ حَدَّثَنِي أَبِي أَنَّهُ حَيْثُ بَنَى بِالثَّقَفِيَّةِ وَ كَانَ قَدْ شُقَّ لَهُ فِي الْجِدَارِ فَنُجِّدَ الْبَيْتُ فَلَمَّا كَانَتْ صَبِيحَةُ عُرْسِهِ رَمَى بِبَصَرِهِ فَرَأَى حَذْوَهُ خَمْسَةَ عَشَرَ مِسْمَاراً فَفَزِعَ لِذَلِكَ وَ قَالَ لَهَا تَحَوَّلِي فَإِنِّي أُرِيدُ أَنْ أَدْعُوَ مَوَالِيَّ فِي حَاجَةٍ فَكَشَطَهُ فَمَا مِنْهَا مِسْمَارٌ إِلَّا وَجَدَهُ مُصْرِفاً طَرَفَهُ عَنِ السَّيْفِ وَ مَا وَصَلَ إِلَيْهِ مِنْهَا شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Muhammad Bin Hakeem, ",
            "(It has been narrated) from Abu Ibrahim<sup>as</sup> (7<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The weapons are placed with us<sup>asws</sup>, defended from. Had these been placed with the most evil creature of Allah<sup>azwj</sup>, he would have been the best of them. ",
            "My<sup>asws</sup> father<sup>asws</sup> has narrated to me<sup>asws</sup> that he<sup>asws</sup>, when he built at Al-Sawafiyya, and it was so that for him<sup>asws</sup> there was a wall which had splits in it, so he<sup>asws</sup> renewed the room. So when it was the morning of his<sup>asws</sup> marriage, he<sup>asws</sup> looked around with his<sup>asws</sup> eyesight, and he<sup>asws</sup> saw fifteen nails sticking out. So he<sup>asws</sup> was anxious at that and said to her (the bride): ‘Transfer, for I<sup>asws</sup> want to invite my<sup>asws</sup> friends regarding a need’. So he<sup>asws</sup> scraped it, and there was no nail from these except that its end was bent from the sword, and nothing from these had arrived to it’."
          ],
          "en.sarwar": [
            " 6. Ali ibn Ibrahim has narrated from his father from Muhammad ibn ‘Isa from Yunus ibn ‘Abd al-Raman from Muhammad ibn al-Hakim from abu Ibrahim (a.s.) who has said the following. “ The arms are kept with us. They are well protected. Even if they would placed with the worst of the creatures he would a good one of them. My father stated to me that when he married a lady from al-Thaqif the house was decorated for the wedding. Next morning he found fifteen nails drawn into that wall. He became very anxious about it and asked hid bridegroom to leave the house because he needed the handyman to do some work therein. When he examined the wall he found that all the nails had turned back from the sword and none of them had reached it.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (47/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 626,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/723",
              "text": "حُجْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/98",
              "text": "حُمْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ حُجْرٍ عَنْ حُمْرَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:38:7",
        "text": [
          " سَأَلْتُهُ عَمَّا يَتَحَدَّثُ النَّاسُ أَنَّهُ دُفِعَتْ إِلَى أُمِّ سَلَمَةَ صَحِيفَةٌ مَخْتُومَةٌ فَقَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَمَّا قُبِضَ وَرِثَ عَلِيٌّ ( عليه السلام ) عِلْمَهُ وَ سِلَاحَهُ وَ مَا هُنَاكَ ثُمَّ صَارَ إِلَى الْحَسَنِ ثُمَّ صَارَ إِلَى الْحُسَيْنِ ( عليه السلام ) فَلَمَّا خَشِينَا أَنْ نُغْشَى اسْتَوْدَعَهَا أُمَّ سَلَمَةَ ثُمَّ قَبَضَهَا بَعْدَ ذَلِكَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) ",
          "قَالَ فَقُلْتُ نَعَمْ ثُمَّ صَارَ إِلَى أَبِيكَ ثُمَّ انْتَهَى إِلَيْكَ وَ صَارَ بَعْدَ ذَلِكَ إِلَيْكَ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Ibn Muskan, from Hujr, from Humran, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about what the people narrating that a sealed Parchment had been handed over to Umm Salma<sup>as</sup>. So he<sup>asws</sup> said: ‘When (the soul of) Rasool-Allah<sup>saww</sup> was Captured, Ali<sup>asws</sup> inherited his<sup>saww</sup> Knowledge, and his<sup>saww</sup> weapons, and whatever was there. Then these came to be to Al-Hassan<sup>asws</sup>. Then these came to be to Al-Husayn<sup>asws</sup>. So when we<sup>asws</sup> feared losing them (in the plunder at Kerbala), these were entrusted to Umm Salma<sup>as</sup>. Then Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> took possession of these after that’. ",
            "He (the narrator) said, ‘So I said, ‘Yes, then these came to be to your<sup>asws</sup> father<sup>asws</sup>, then ended up to you<sup>asws</sup>, and they came to be to you after that?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            " 7. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan ibn Yahya from ibn Muskan from Hujr from Humran who has said the following. “ I asked abu Ja‘far (a.s.) about the truth in the matter which people relate that a sealed page (or pages) was given to ’Umm Salama.” The Imam (a.s.) then said, “When the Messenger of Allah passed away, Ali (a.s.) inherited his (Holy Prophet’s ) arms and whatever was therein, then it was transferred to Imam al-Hassan then to Imam al-Husayn (a.s.). However, then we became anxious about loosing them we then decided to leave them in trust of ’Umm Salama. Afterwards Imam Ali ibn al-Husayn (a.s.) took custody of the arms.” I then said, “Then it is true that it was transferred to your father and then they ended up to you.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/48)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 627,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/248",
              "text": "مُحَمَّدٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/724",
              "text": "فَضَالَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/197",
              "text": "عُمَرَ بْنِ أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ عَنْ عُمَرَ بْنِ أَبَانٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:38:8",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَمَّا يَتَحَدَّثُ النَّاسُ أَنَّهُ دُفِعَ إِلَى أُمِّ سَلَمَةَ صَحِيفَةٌ مَخْتُومَةٌ فَقَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَمَّا قُبِضَ وَرِثَ عَلِيٌّ ( عليه السلام ) عِلْمَهُ وَ سِلَاحَهُ وَ مَا هُنَاكَ ثُمَّ صَارَ إِلَى الْحَسَنِ ثُمَّ صَارَ إِلَى الْحُسَيْنِ ( عليه السلام ) ",
          "قَالَ قُلْتُ ثُمَّ صَارَ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ثُمَّ صَارَ إِلَى ابْنِهِ ثُمَّ انْتَهَى إِلَيْكَ فَقَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat, from Umar Bin Aban who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about what the people are narrating that a sealed Parchment was handed over to Umm Salma<sup>as</sup>. So he<sup>asws</sup> said: ‘When (the soul of) Rasool-Allah<sup>saww</sup> was Captured, Ali<sup>asws</sup> inherited his<sup>saww</sup> knowledge, and his<sup>saww</sup> weapons, and whatever was there. Then these came to be to Al-Hassan<sup>asws</sup>, then came to be to Al-Husayn<sup>asws</sup>’.",
            "He (the narrator) said, ‘I said, ‘Then these came to be to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, then came to be to his<sup>asws</sup> son<sup>asws</sup>, then ended up to you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            " 8. Muhammad has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fudala from ‘Umar ibn Aban who has said the following. “I asked abu ‘Abdallah (a.s.), ‘People say that a sealed page (or pages) was given to ’Umm Salama. Is it true?’” The Imam (a.s.) said, “When the Messenger of Allah passed away, Ali (a.s.) inherited his knowledge, his Armaments and whatever was with it. Then it was transferred to al-Hassan then to al-Husayn.” The narrator has said that then said to the Imam (a.s.), “Then it was transferred to Ali ibn al-Husayn (a.s.) then to his son then it ended up to you.” The Imam (a.s.) said, “That is true.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف وآخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (48/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 628,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/702",
              "text": "مُحَمَّدُ بْنُ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/625",
              "text": "مُحَمَّدِ بْنِ الْوَلِيدِ شَبَابٍ الصَّيْرَفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ الْحُسَيْنِ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ شَبَابٍ الصَّيْرَفِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:38:9",
        "text": [
          " لَمَّا حَضَرَتْ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) الْوَفَاةُ دَعَا الْعَبَّاسَ بْنَ عَبْدِ الْمُطَّلِبِ وَ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ لِلْعَبَّاسِ يَا عَمَّ مُحَمَّدٍ تَأْخُذُ تُرَاثَ مُحَمَّدٍ وَ تَقْضِي دَيْنَهُ وَ تُنْجِزُ عِدَاتِهِ فَرَدَّ عَلَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَ أُمِّي إِنِّي شَيْخٌ كَثِيرُ الْعِيَالِ قَلِيلُ الْمَالِ مَنْ يُطِيقُكَ وَ أَنْتَ تُبَارِي الرِّيحَ",
          "قَالَ فَأَطْرَقَ ( صلى الله عليه وآله ) هُنَيْئَةً ثُمَّ قَالَ يَا عَبَّاسُ أَ تَأْخُذُ تُرَاثَ مُحَمَّدٍ وَ تُنْجِزُ عِدَاتِهِ وَ تَقْضِي دَيْنَهُ فَقَالَ بِأَبِي أَنْتَ وَ أُمِّي شَيْخٌ كَثِيرُ الْعِيَالِ قَلِيلُ الْمَالِ وَ أَنْتَ تُبَارِي الرِّيحَ قَالَ أَمَا إِنِّي سَأُعْطِيهَا مَنْ يَأْخُذُهَا بِحَقِّهَا",
          "ثُمَّ قَالَ يَا عَلِيُّ يَا أَخَا مُحَمَّدٍ أَ تُنْجِزُ عِدَاتِ مُحَمَّدٍ وَ تَقْضِي دَيْنَهُ وَ تَقْبِضُ تُرَاثَهُ فَقَالَ نَعَمْ بِأَبِي أَنْتَ وَ أُمِّي ذَاكَ عَلَيَّ وَ لِي قَالَ فَنَظَرْتُ إِلَيْهِ حَتَّى نَزَعَ خَاتَمَهُ مِنْ إِصْبَعِهِ فَقَالَ تَخَتَّمْ بِهَذَا فِي حَيَاتِي",
          "قَالَ فَنَظَرْتُ إِلَى الْخَاتَمِ حِينَ وَضَعْتُهُ فِي إِصْبَعِي فَتَمَنَّيْتُ مِنْ جَمِيعِ مَا تَرَكَ الْخَاتَمَ ثُمَّ صَاحَ يَا بِلَالُ عَلَيَّ بِالْمِغْفَرِ وَ الدِّرْعِ وَ الرَّايَةِ وَ الْقَمِيصِ وَ ذِي الْفَقَارِ وَ السَّحَابِ وَ الْبُرْدِ وَ الْأَبْرَقَةِ وَ الْقَضِيبِ قَالَ فَوَ اللَّهِ مَا رَأَيْتُهَا غَيْرَ سَاعَتِي تِلْكَ يَعْنِي الْأَبْرَقَةَ فَجِي‏ءَ بِشِقَّةٍ كَادَتْ تَخْطَفُ الْأَبْصَارَ فَإِذَا هِيَ مِنْ أَبْرُقِ الْجَنَّةِ ",
          "فَقَالَ يَا عَلِيُّ إِنَّ جَبْرَئِيلَ أَتَانِي بِهَا وَ قَالَ يَا مُحَمَّدُ اجْعَلْهَا فِي حَلْقَةِ الدِّرْعِ وَ اسْتَذْفِرْ بِهَا مَكَانَ الْمِنْطَقَةِ ",
          "ثُمَّ دَعَا بِزَوْجَيْ نِعَالٍ عَرَبِيَّيْنِ جَمِيعاً أَحَدُهُمَا مَخْصُوفٌ وَ الْآخَرُ غَيْرُ مَخْصُوفٍ وَ الْقَمِيصَيْنِ الْقَمِيصِ الَّذِي أُسْرِيَ بِهِ فِيهِ وَ الْقَمِيصِ الَّذِي خَرَجَ فِيهِ يَوْمَ أُحُدٍ وَ الْقَلَانِسِ الثَّلَاثِ قَلَنْسُوَةِ السَّفَرِ وَ قَلَنْسُوَةِ الْعِيدَيْنِ وَ الْجُمَعِ وَ قَلَنْسُوَةٍ كَانَ يَلْبَسُهَا وَ يَقْعُدُ مَعَ أَصْحَابِهِ ",
          "ثُمَّ قَالَ يَا بِلَالُ عَلَيَّ بِالْبَغْلَتَيْنِ الشَّهْبَاءِ وَ الدُّلْدُلِ وَ النَّاقَتَيْنِ الْعَضْبَاءِ وَ الْقَصْوَاءِ وَ الْفَرَسَيْنِ الْجَنَاحِ كَانَتْ تُوقَفُ بِبَابِ الْمَسْجِدِ لِحَوَائِجِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) يَبْعَثُ الرَّجُلَ فِي حَاجَتِهِ فَيَرْكَبُهُ فَيَرْكُضُهُ فِي حَاجَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ حَيْزُومٍ وَ هُوَ الَّذِي كَانَ يَقُولُ أَقْدِمْ حَيْزُومُ وَ الْحِمَارِ عُفَيْرٍ ",
          "فَقَالَ اقْبِضْهَا فِي حَيَاتِي فَذَكَرَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَنَّ أَوَّلَ شَيْ‏ءٍ مِنَ الدَّوَابِّ تُوُفِّيَ عُفَيْرٌ سَاعَةَ قُبِضَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَطَعَ خِطَامَهُ ثُمَّ مَرَّ يَرْكُضُ حَتَّى أَتَى بِئْرَ بَنِي خَطْمَةَ بِقُبَا فَرَمَى بِنَفْسِهِ فِيهَا فَكَانَتْ قَبْرَهُ",
          "وَ رُوِيَ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ إِنَّ ذَلِكَ الْحِمَارَ كَلَّمَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ بِأَبِي أَنْتَ وَ أُمِّي إِنَّ أَبِي حَدَّثَنِي عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ أَبِيهِ أَنَّهُ كَانَ مَعَ نُوحٍ فِي السَّفِينَةِ فَقَامَ إِلَيْهِ نُوحٌ فَمَسَحَ عَلَى كَفَلِهِ ثُمَّ قَالَ يَخْرُجُ مِنْ صُلْبِ هَذَا الْحِمَارِ حِمَارٌ يَرْكَبُهُ سَيِّدُ النَّبِيِّينَ وَ خَاتَمُهُمْ فَالْحَمْدُ لِلَّهِ الَّذِي جَعَلَنِي ذَلِكَ الْحِمَارَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Husayn and Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Al Waleed, the young money-changer, from Aban Bin Usman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the death presented itself to Rasool-Allah<sup>saww</sup>, he<sup>saww</sup> called Al-Abbas Bin Abdul Muttalib and Amir Al-Momineen<sup>asws</sup>. So he<sup>saww</sup> said to Al-Abbas: ‘O uncle of Muhammad<sup>saww</sup>! Will you take the inheritance of Muhammad<sup>saww</sup> and fulfill his<sup>saww</sup> debts, and accomplish his<sup>saww</sup> promises made?’ So he responded to him<sup>saww</sup>, and he said, ‘O Rasool-Allah<sup>saww</sup>! May my father and my mother be (sacrificed) for you<sup>asws</sup>! I am an old man with a lot of dependants, of little wealth. Who can endure you<sup>asws</sup> and you<sup>saww</sup> compete with the winds (extremely generous)?’",
            "He<sup>asws</sup> said: ‘So he<sup>saww</sup> left it for a while, then said: ‘O Abbas! Will you take the inheritance of Muhammad, and accomplish his<sup>saww</sup> promises made, and fulfil his<sup>saww</sup> debts?’ So he said, ‘May my father and my mother be (sacrificed) for you<sup>saww</sup>! I am an old man with a lot of dependants, of little wealth, and you<sup>saww</sup> compete with the winds (extremely generous)’. He<sup>saww</sup> said: ‘However, I<sup>saww</sup> shall be giving it to the one who will take it by its right’. ",
            "Then he<sup>saww</sup> said: ‘O Ali<sup>asws</sup>, brother of Muhammad<sup>saww</sup>! Will you<sup>asws</sup> accomplish the Promises of Muhammad<sup>saww</sup>, and will you<sup>asws</sup> fulfil his<sup>saww</sup> debts, and will you<sup>asws</sup> take possession of his<sup>saww</sup> inheritance?’ So he<sup>asws</sup> said: ‘Yes may my<sup>asws</sup> father<sup>as</sup> and my<sup>as</sup> mother be (sacrificed) for you<sup>saww</sup>! That is upon me<sup>asws</sup>, and for me<sup>asws</sup>’. He<sup>asws</sup> said ‘So he<sup>saww</sup> looked at him<sup>asws</sup> until he<sup>saww</sup> removed his<sup>saww</sup> ring from his<sup>saww</sup> finger, and he<sup>saww</sup> said: ‘Wear this ring during my<sup>saww</sup> lifetime’. ",
            "He (Amir Al-Momineen<sup>asws</sup>) said: ‘So I<sup>asws</sup> looked at the ring when he<sup>saww</sup> placed it in my<sup>asws</sup> finger, and I<sup>asws</sup> desired it from the entirety of what he<sup>saww</sup> had left’. Then he<sup>saww</sup> shouted: ‘O Bilal! (Come) to me<sup>asws</sup> with the helmet, and the armour, and the flag, and the shirt, and <span class=\"iTxt\">Zil Faqar</span>, and the turban, and the cloak, and the belt and the staff!’ He (Amir Al-Momineen<sup>asws</sup>) said: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> had not seen it, apart from that very moment of mine (meaning the belt)’. It had a shine which almost took away the sight’. ",
            "So he<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! Jibraeel<sup>as</sup> came to me<sup>saww</sup> with it and said: ‘O Muhammad<sup>saww</sup>! Make it to be a circle around the armour, and use it as a belt with it at the place of your<sup>asws</sup> waist’. ",
            "Then he<sup>saww</sup> called for a pair of Arabian slippers together, one of the two being stitched and the other one without stitches, and two shirts, the shirt with which he ascended with (Mi’raj), and the shirt in which he<sup>saww</sup> came out on the Day of Ohad, and three turbans (caps), a cap for the journey, and a cap for the two Eids and the Friday, and a cap which he<sup>saww</sup> used to wear and sit along with his<sup>saww</sup> companions.",
            "Then he<sup>saww</sup> said: ‘O Bilal! (Come) to me<sup>saww</sup> with the two mules, Al-Shahba’a and Al-Duldul, and the two she-camels, Al-Azba’a and Al-Qaswa, and the two horses, Al-Janah which used to be paused by the door of the Masjid for the needs of Rasool-Allah<sup>saww</sup> which he<sup>saww</sup> used to send the man regarding his<sup>saww</sup> need, so he would ride it, so he would race it regarding a need of Rasool-Allah<sup>saww</sup>, and Hayzoum, and it is that which used to be called Aqdim Hayzoum, and the donkey (called) Ufeyr.",
            "So he<sup>saww</sup> said: ‘Take possession of these during my<sup>saww</sup> lifetime’. So Amir Al-Momineen<sup>asws</sup> mentioned that the first thing from the animal which died was Ufeyr, at the time of the passing away of Rasool-Allah<sup>saww</sup>, it broke its rein then passed by racing until it came to a well of the Clan of Khatma at Quba. So it threw itself into it. Thus, it Became its grave’. ",
            "And it is reported that Amir Al-Momineen<sup>asws</sup> said: ‘That donkey spoke to Rasool-Allah<sup>saww</sup>, so it said, ‘May my father and my mother be sacrificed for you<sup>saww</sup>! My father narrated to me, from his father, from his grandfather that he was with Noah<sup>as</sup> in the ship. So Noah<sup>as</sup> stood up to him and Noah<sup>as</sup> wiped upon his back, then said: ‘There will come out from the loins of this donkey which would be ridden upon by the Chief of the Prophets<sup>saww</sup> and their<sup>as</sup> seal’. So the Praise be to Allah<sup>azwj</sup> Who Made me to be that donkey’’."
          ],
          "en.sarwar": [
            " 9. Muhammad ibn al-Husayn has narrated from Ali ibn Muhammad from Sahl ibn Ziyad from Muhammad ibn al-Walid Shabab al-Sayrafi from Aban ibn ‘Uthman from abu ‘Abdallah (a.s.) who has said the following “When the Messenger of Allah was about to dies, he called to him al-‘Abbass ibn ‘Ad al-Muttalib and Amir al-Mu’mini (a.s.) He said to al-‘Abbass, “O auncle of Muhammad, will you inherit the legacy of Muhammad , pay his debts and fulfill his promises and commitments?” He responded, “O the Messenger of Allah, May Allah take my soul and the souls of my parents in service for your cause, I am an old man with a large number of dependents, with very little belongings while in generosity compete the winds.” He (the Messenger of Allah) said, “I will give them away to whoever would want them along with its rights and responsibilities.” Then the Holy Prophet (s.a.) said, “O Ali, brother of Muhammad, will you pay off the liabilities of Muhammad, pay off his debt and take possession of his legacy?” He said, “Yes, May Allah take my soul and the soul of my parents in service for your cause, it is my responsibility and in my favor” Ali (a.s.) has said, “I looked at him and saw take off even his ring from his finger and said to me wear on this ring in my lifeee time.” He (Ali) (a.s.) has said, “I lookked to the ring when wearing on my finger and wished to have it out of all his properties.” He then called upon Bilal loudly, “Bring me my helmet, the coat of arms, the flag, the Shirt, the Dhulfaqar, (famous sword), al-Sahab, (the Turban) al-Burd, ( the clothe) al-Abraqa, (the belt)and the Staff.” Ali (a.s.) has said, “I had never before seen that belt. When it was brought its shine would almost take away one’s sight. It was of the belts of paradise.” He (the Messenger of Allah) thensaid, “O Ali, Jibril brought this for me and said, “O Muhammad, place it in the ring of the coat of arms and use it as a belt around your midsection. Then he asked that the two pairs of Arabian shoves be brought to him along with the shirt. One of them was already stitched and the other was not yet stitched. It was the Shirt with which he take for the ’Isra’ (the night journey), the Shirt while wearing it he came out on the day of ’Uhud. Three caps were brought, the cap used while on a journey, the cap used on the ‘Id days and the cap used on Frindays. Also the cap that was used during his meeting with his companions was brought to him.” Then he (the Messenger of Allah ) said, “O Bilala, bring to us the two mules, the gray one and Dul dul and the two camels, al_Ghadba’ and al-Qaswa’ and the two horses.” Al-Janah wopuld been kept near the door of the Mosque in case the Messenger of Allah needed. Whenever he would need any thing he would let a man to ride on it to go for the task and the horse wound run for the needs of the Messenger of Allah. Also Hayzum was brought to him, the donkey called ‘Ufayr were brought to him. He then said, “Take possession of these in my life time.” Amir al-Mu’mini (a.s.) has said, “The first one of the animals died was ‘Ufayr who died at within the same hour that the Messenger of Allah died. He brook off his bound until and began to run until he came to the well of bnu Khatma in Quba and threw himself into it and it became his grave.” It is narrated that Amir al-Mu’mini (a.s.) has said, “That donkey spoke to the Messenger of Allah say, May Allah take my soul and the soul of my parents in service for your cause, my father related to me from his father from his grand father from his father who lived with Noah in the Ark. Once Noah came to him and whipped his on his back and said, “From the descendents of this donkey there will a donkey on whose back the master and the last of the prophets will ride. I thank Allah who has made me that donkey.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:38",
  "kind": "verse_list"
}