{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 40"
        },
        "path": "/books/al-kafi:1:4:40",
        "titles": {
          "ar": "باب فِيهِ ذِكْرُ الصَّحِيفَةِ وَ الْجَفْرِ وَ الْجَامِعَةِ وَ مُصْحَفِ فَاطِمَةَ ( عليها السلام )",
          "en": "Chapter 40 – In it is the mention of the Parchment, and the Jaf’r, and the Jami’e, and Parchments of Fatima<sup>asws</sup>"
        }
      }
    ],
    "index": 98,
    "local_index": 40,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 41"
        },
        "path": "/books/al-kafi:1:4:41",
        "titles": {
          "ar": "باب فِي شَأْنِ إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ وَ تَفْسِيرِهَا",
          "en": "Chapter 41 – Regarding the glory of [97:1] We have indeed revealed this in the Night of Predestination (Chapter 97) and its interpretation"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 39"
        },
        "path": "/books/al-kafi:1:4:39",
        "titles": {
          "ar": "بَابُ أَنَّ مَثَلَ سِلَاحِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مَثَلُ التَّابُوتِ فِي بَنِي إِسْرَائِيلَ",
          "en": "Chapter 39 – An example of the weapons of Rasool-Allah<sup>saww</sup> is an example of the Ark among the Children of Israel"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:40",
    "titles": {
      "ar": "باب فِيهِ ذِكْرُ الصَّحِيفَةِ وَ الْجَفْرِ وَ الْجَامِعَةِ وَ مُصْحَفِ فَاطِمَةَ ( عليها السلام )",
      "en": "Chapter 40 – In it is the mention of the Parchment, and the Jaf’r, and the Jami’e, and Parchments of Fatima<sup>asws</sup>"
    },
    "verse_count": 8,
    "verse_start_index": 632,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/54)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 633,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/790",
              "text": "عَبْدِ اللَّهِ بْنِ الْحَجَّالِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/94",
              "text": "أَحْمَدَ بْنِ عُمَرَ الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَجَّالِ عَنْ أَحْمَدَ بْنِ عُمَرَ الْحَلَبِيِّ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:40:1",
        "text": [
          " دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنِّي أَسْأَلُكَ عَنْ مَسْأَلَةٍ هَاهُنَا أَحَدٌ يَسْمَعُ كَلَامِي قَالَ فَرَفَعَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) سِتْراً بَيْنَهُ وَ بَيْنَ بَيْتٍ آخَرَ فَاطَّلَعَ فِيهِ ثُمَّ قَالَ يَا أَبَا مُحَمَّدٍ سَلْ عَمَّا بَدَا لَكَ",
          "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّ شِيعَتَكَ يَتَحَدَّثُونَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) عَلَّمَ عَلِيّاً ( عليه السلام ) بَاباً يُفْتَحُ لَهُ مِنْهُ أَلْفُ بَابٍ قَالَ فَقَالَ يَا أَبَا مُحَمَّدٍ عَلَّمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلِيّاً ( عليه السلام ) أَلْفَ بَابٍ يُفْتَحُ مِنْ كُلِّ بَابٍ أَلْفُ بَابٍ قَالَ قُلْتُ هَذَا وَ اللَّهِ الْعِلْمُ قَالَ فَنَكَتَ سَاعَةً فِي الْأَرْضِ ثُمَّ قَالَ إِنَّهُ لَعِلْمٌ وَ مَا هُوَ بِذَاكَ ",
          "قَالَ ثُمَّ قَالَ يَا أَبَا مُحَمَّدٍ وَ إِنَّ عِنْدَنَا الْجَامِعَةَ وَ مَا يُدْرِيهِمْ مَا الْجَامِعَةُ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ وَ مَا الْجَامِعَةُ",
          "قَالَ صَحِيفَةٌ طُولُهَا سَبْعُونَ ذِرَاعاً بِذِرَاعِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِمْلَائِهِ مِنْ فَلْقِ فِيهِ وَ خَطِّ عَلِيٍّ بِيَمِينِهِ فِيهَا كُلُّ حَلَالٍ وَ حَرَامٍ وَ كُلُّ شَيْ‏ءٍ يَحْتَاجُ النَّاسُ إِلَيْهِ حَتَّى الْأَرْشُ فِي الْخَدْشِ وَ ضَرَبَ بِيَدِهِ إِلَيَّ فَقَالَ تَأْذَنُ لِي يَا أَبَا مُحَمَّدٍ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّمَا أَنَا لَكَ فَاصْنَعْ مَا شِئْتَ قَالَ فَغَمَزَنِي بِيَدِهِ وَ قَالَ حَتَّى أَرْشُ هَذَا كَأَنَّهُ مُغْضَبٌ قَالَ قُلْتُ هَذَا وَ اللَّهِ الْعِلْمُ قَالَ إِنَّهُ لَعِلْمٌ وَ لَيْسَ بِذَاكَ ",
          "ثُمَّ سَكَتَ سَاعَةً ثُمَّ قَالَ وَ إِنَّ عِنْدَنَا الْجَفْرَ وَ مَا يُدْرِيهِمْ مَا الْجَفْرُ قَالَ قُلْتُ وَ مَا الْجَفْرُ قَالَ وِعَاءٌ مِنْ أَدَمٍ فِيهِ عِلْمُ النَّبِيِّينَ وَ الْوَصِيِّينَ وَ عِلْمُ الْعُلَمَاءِ الَّذِينَ مَضَوْا مِنْ بَنِي إِسْرَائِيلَ قَالَ قُلْتُ إِنَّ هَذَا هُوَ الْعِلْمُ قَالَ إِنَّهُ لَعِلْمٌ وَ لَيْسَ بِذَاكَ",
          "ثُمَّ سَكَتَ سَاعَةً ثُمَّ قَالَ وَ إِنَّ عِنْدَنَا لَمُصْحَفَ فَاطِمَةَ ( عليها السلام ) وَ مَا يُدْرِيهِمْ مَا مُصْحَفُ فَاطِمَةَ ( عليها السلام ) قَالَ قُلْتُ وَ مَا مُصْحَفُ فَاطِمَةَ ( عليها السلام ) قَالَ مُصْحَفٌ فِيهِ مِثْلُ قُرْآنِكُمْ هَذَا ثَلَاثَ مَرَّاتٍ وَ اللَّهِ مَا فِيهِ مِنْ قُرْآنِكُمْ حَرْفٌ وَاحِدٌ قَالَ قُلْتُ هَذَا وَ اللَّهِ الْعِلْمُ قَالَ إِنَّهُ لَعِلْمٌ وَ مَا هُوَ بِذَاكَ",
          "ثُمَّ سَكَتَ سَاعَةً ثُمَّ قَالَ إِنَّ عِنْدَنَا عِلْمَ مَا كَانَ وَ عِلْمَ مَا هُوَ كَائِنٌ إِلَى أَنْ تَقُومَ السَّاعَةُ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ هَذَا وَ اللَّهِ هُوَ الْعِلْمُ قَالَ إِنَّهُ لَعِلْمٌ وَ لَيْسَ بِذَاكَ ",
          "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَأَيُّ شَيْ‏ءٍ الْعِلْمُ قَالَ مَا يَحْدُثُ بِاللَّيْلِ وَ النَّهَارِ الْأَمْرُ مِنْ بَعْدِ الْأَمْرِ وَ الشَّيْ‏ءُ بَعْدَ الشَّيْ‏ءِ إِلَى يَوْمِ الْقِيَامَ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Abdullah Bin Al Hajjal, from Ahmad Bin Umar Al Halby, from Abu Baseer who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup> and I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I want to ask you<sup>asws</sup> a question. Is there anyone over here who would hear my speech?’ So Abu Abdullah<sup>asws</sup> raised a curtain between him<sup>asws</sup> and another room, and looked into it, then said: ‘O Abu Muhammad! Ask about whatever comes to you’. ",
            "He (Abu Baseer) said, ‘May I be sacrificed for you<sup>asws</sup>! Your<sup>asws</sup> Shias are narrating that Rasool-Allah<sup>saww</sup> taught Ali<sup>asws</sup> such a door (of knowledge) that a thousand (other) doors (of knowledge) opened from it’. So he<sup>asws</sup> said: ‘O Abu Muhammad! Rasool-Allah<sup>saww</sup> taught Ali<sup>asws</sup> a thousand doors (of knowledge), there opening from each of the doors, a thousand (other) doors (of knowledge)’. I said, ‘This, by Allah<sup>azwj</sup>, is the knowledge!’. So he<sup>asws</sup> made marks in the ground for a while, then said: ‘It is a knowledge, but it is not that (knowledge)’. ",
            "He (Abu Baseer) said, ‘Then he<sup>asws</sup> said: ‘O Abu Muhammad! And with us<sup>asws</sup> is the <span class=\"iTxt\">Jami’e</span>, and what do they (people) know what the <span class=\"iTxt\">Jami’e</span> is?’ I said, ‘May be sacrificed for you<sup>asws</sup>! And what is the <span class=\"iTxt\">Jami’e</span>? ",
            "He<sup>asws</sup> said: ‘A Parchment of the length of seventy cubits by the cubit (measurement) of Rasool-Allah<sup>saww</sup> and his<sup>saww</sup> dictation from his<sup>saww</sup> own mouth, and handwritten by Ali<sup>asws</sup> by his<sup>asws</sup> right hand. Therein are the Permissible and the Prohibitions, and everything that the people would be needy to, to the extent of the compensation regarding the scratch’, and he<sup>asws</sup> struck with his<sup>asws</sup> hand towards me, and he<sup>asws</sup> said: ‘Will you permit me<sup>asws</sup>, O Abu Muhammad? I said, ‘May I be sacrificed for you<sup>asws</sup>! But rather, I am for you<sup>asws</sup>, therefore do whatever you so desire to’. So he<sup>asws</sup> pressed me by his<sup>asws</sup> hand and said: ‘To the extent of this’, as if he<sup>asws</sup> was angry. I said, ‘This, by Allah<sup>azwj</sup>, is the knowledge!’. He<sup>asws</sup> said: ‘It is a knowledge, but it is not that (knowledge)!’ ",
            "Then he<sup>asws</sup> was silent for a while, then said: ‘And with us<sup>asws</sup> is the <span class=\"iTxt\">Jaf’r</span>, and what do they (people) know what the <span class=\"iTxt\">Jaf’r</span> is?’ I said, ‘And what is the <span class=\"iTxt\">Jaf’r</span>?’ He<sup>asws</sup> said: ‘A receptacle from Adam<sup>as</sup> wherein is knowledge of the Prophets<sup>as</sup>, and the successors<sup>as</sup>, and knowledge of the scholars of the past from the Children of Israel’. I said, ‘This, is the knowledge!’ He<sup>asws</sup> said: ‘It is knowledge, and it isn’t that (knowledge)!’.",
            "Then he<sup>asws</sup> was silent for a while, then said: ‘And with us<sup>asws</sup> is the Parchment of Syeda Fatima<sup>asws</sup>, and what do they (people) know what the Parchment of Fatima<sup>asws</sup> is?’ I said, ‘And what is the Parchment of Fatima<sup>asws</sup>?’ He<sup>asws</sup> said: ‘A Parchment where is the likes of this Quran of yours three times over. By Allah<sup>azwj</sup>! And there is not a single letter from your Quran therein’. I said, ‘This, by Allah<sup>azwj</sup>, is the knowledge!’ He<sup>asws</sup> said: ‘It is a knowledge, but it is not that (knowledge)!’. ",
            "Then he<sup>asws</sup> was silent for a while, then said: ‘With us<sup>asws</sup> is knowledge of whatever has happened, and what would be happening up to the establishment of the Hour’. I said, ‘May I be sacrificed for you<sup>asws</sup>! This, by Allah<sup>azwj</sup>, it is the knowledge!’. He<sup>asws</sup> said: ‘It is a knowledge, and it isn’t that (knowledge)!’. ",
            "He (Abu Baseer) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>! So which thing is the knowledge?’ He<sup>asws</sup> said: ‘Whatever newly occurs by the night and the day, the matter after the matter, and the thing after the thing, up to the Day of Judgment’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad from ‘Abdallah ibn al-Hajjal from Ahmad ibn ‘Umar al-Halabi from abu Basir who has said the following. “I went to abu ‘Abdallah (a.s.) and said, “May Allah take my soul in service for your cause, I like to ask you a question. Is there anyone else in this house who may hear my words?” The Imams (a.s.) then folded the curtain between his room and the other room next to it and looked into it. Then the Imams (a.s.) said, “O abu Muhammad, ask whatever you wish.” I said, “May Allah take my soul in service for your cause, your followers say that the Messenger of Allah taught Ali (a.s.) a thousand chapter of knowledge and from each chapter there opens a thousand chapter. I then said, ‘This, I swear by Allah, is knowledge.’” He would mark the ground with his staff (a sign of thinking in normal people) for a while and said, “That is knowledge but it is not that.” The narrators has said that The Imam (a.s.) then said, “O abu Muhammad, with us there is al-Jami‘a. What do they know what al-Jami‘ is?” I then asked, “May Allah take my soul in service for your cause, what is al-Jami‘a? The Imam (a.s.) said, it is a parchment seventy yards by the yards of the Messenger of Allah long that contains his dictations that is in graved in to with the right hand writing of Ali (a.s.). It contains all the lawful and unlawful and all matters that people need, even the law to of compensation for A number of our people has narrated from scratch caused to a person. He then stretched his hand to me and asked, ‘May I, O abu Muhammad?’ I then replied, “May Allah take my soul in service for your cause, I am all at your disposal.” He pinched me with his hand and said, “Even there is the law of compensation for this.” He seemed angry. The narrator has said, “I then said, “This, I swear by Allah is knowledge.” The Imams (a.s.) said, “It certainly is knowledge but not that one.” The Imams (a.s.) remained silent for a while and then said, “With us there is al-Jafr (the parchment). What do they know what al-Jafr is? I then asked, “What is al-Jafr (the parchment or a container) ?” The Imams (a.s.) said, “It is a container made of skin that contains the knowledge of the prophets and the executors of their wills and the knowledge of the scholars in the past from the Israelites.” The narrator has said that he then said, “This certainly, is the knowledge.” The Imam (a.s.) said, “It certainly is knowledge but not that knowledge.” The Imams (a.s.) remained silent for a while and then said, “With us there is the book (Mushaf) of Fatima, (a.s.). What do they know what Mushaf of Fatima is? The Imam (a.s.) said, “Mushaf of Fatima is three times bigger than your Quran. There is not even a single letter therein from your Quran.” The narrator has said, “I then said, “This, I swear by Allah, is the knowledge.” The Imam (a.s.) said, “This certainly is knowledge, but it is not that.” The Imam (a.s.) remained silent for a while and then said, “With us there is the knowledge of whatever has been and the knowledge of whatever will come into being to the Day of Judgment.” The narrator has said that he then said, “May Allah take my soul in service for your cause, this, I swear by Allah is, certainly, knowledge.” The Imam (a.s.) said, “It certainly is knowledge but not that.” The narrator has said that he then asked, “May Allah take my soul in service for your cause, What then is knowledge?” The Imam (a.s.) said, “Whatever takes place during the night and during the day, one matter after the other matter and one thing after the other thing to the Day of Judgment.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (56/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 634,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/791",
              "text": "عُمَرَ بْنِ عَبْدِ الْعَزِيزِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:40:2",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ تَظْهَرُ الزَّنَادِقَةُ فِي سَنَةِ ثَمَانٍ وَ عِشْرِينَ وَ مِائَةٍ وَ ذَلِكَ أَنِّي نَظَرْتُ فِي مُصْحَفِ فَاطِمَةَ ( عليها السلام ) قَالَ قُلْتُ وَ مَا مُصْحَفُ فَاطِمَةَ ",
          "قَالَ إِنَّ اللَّهَ تَعَالَى لَمَّا قَبَضَ نَبِيَّهُ ( صلى الله عليه وآله ) دَخَلَ عَلَى فَاطِمَةَ ( عليها السلام ) مِنْ وَفَاتِهِ مِنَ الْحُزْنِ مَا لَا يَعْلَمُهُ إِلَّا اللَّهُ عَزَّ وَ جَلَّ فَأَرْسَلَ اللَّهُ إِلَيْهَا مَلَكاً يُسَلِّي غَمَّهَا وَ يُحَدِّثُهَا فَشَكَتْ ذَلِكَ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ إِذَا أَحْسَسْتِ بِذَلِكِ وَ سَمِعْتِ الصَّوْتَ قُولِي لِي ",
          "فَأَعْلَمَتْهُ بِذَلِكَ فَجَعَلَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَكْتُبُ كُلَّ مَا سَمِعَ حَتَّى أَثْبَتَ مِنْ ذَلِكَ مُصْحَفاً ",
          "قَالَ ثُمَّ قَالَ أَمَا إِنَّهُ لَيْسَ فِيهِ شَيْ‏ءٌ مِنَ الْحَلَالَ وَ الْحَرَامِ وَ لَكِنْ فِيهِ عِلْمُ مَا يَكُونُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Umar Bin Abdul Aziz, from Hammad Bin Usman who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘الزَّنَادِقَةُ’’ The Atheists will appear in the year one hundred and twenty-eight, and that is what I<sup>asws</sup> (found when I<sup>asws</sup>) looked into the Parchment of (Syeda) Fatima<sup>asws</sup>’. I said, ‘And what is the Parchment of Syeda Fatima<sup>asws</sup>?’ ",
            "He<sup>asws</sup> said: ‘When Allah<sup>azwj</sup> - The Exalted Captured (the soul of) His<sup>azwj</sup> Prophet<sup>saww</sup>, the grief entered into (Syeda) Fatima<sup>asws</sup> due to his<sup>saww</sup> passing away, (such grief) which none knows it except for Allah<sup>azwj</sup> Mighty and Majestic. So Allah<sup>azwj</sup> Sent an Angel to her<sup>asws</sup> to console her<sup>asws</sup> sadness and to narrate to her<sup>asws</sup>. So she<sup>asws</sup> described that to Amir Al-Momineen<sup>asws</sup>. So he<sup>asws</sup> said: ‘When you<sup>asws</sup> feel that and hear the voice, tell me<sup>asws</sup>’. ",
            "So she<sup>asws</sup> let him<sup>asws</sup> know of that, and Amir Al-Momineen<sup>asws</sup> went on to write down everything what he<sup>asws</sup> heard until a Parchment was affirmed from that’. ",
            "He (the narrator) said, ‘Then he<sup>asws</sup> said: ‘But, there isn’t anything in it from the Permissible and the Prohibitions, but therein is the knowledge what is going to happen’."
          ],
          "en.sarwar": [
            " 2. A number of our people has narrated from Ahmad ibn Muhammad from ‘Umar ibn ‘Abd al-‘Aziz from ibn ‘Uthman who has said that he heard abu ‘Abdallah (a.s.) say the following. “The heretics will appear in the year one hundred twenty eight (745/746AD) because I have found it in the Mushaf of Fatima (a.s.).” The narrator has said that he asked the Imams (a.s.), “What is Mushaf of Fatime?” The Imams (a.s.) said, “When Allah took the Holy Prophet (s.a.) from this world, it caused such a degree of grief to Fatima (a.s.) that only Allah, the Most Holy, the Most High, knows its extent. Allah then sent an angel to her to offer solace and speak to her. She complained about it to Amir al-Mu’minin Ali (a.s.) who asked her to inform him whenever she would find the angel speak to her. She then informed him when the angel came to speak. Amir al-Mu’minin Ali (a.s.) then would write down all that he would hear of the conversations of the angel so much so that his notes took the shape of a whole book.” The Imam (a.s.) then said, “There was nothing in it of the knowledge of the lawful and unlawful matters but it had the knowledge of things that had happened and things to happen in future.” :"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/57)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 635,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/594",
              "text": "الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:40:3",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ عِنْدِي الْجَفْرَ الْأَبْيَضَ قَالَ قُلْتُ فَأَيُّ شَيْ‏ءٍ فِيهِ قَالَ زَبُورُ دَاوُدَ وَ تَوْرَاةُ مُوسَى وَ إِنْجِيلُ عِيسَى وَ صُحُفُ إِبْرَاهِيمَ ( عليه السلام ) وَ الْحَلَالُ وَ الْحَرَامُ وَ مُصْحَفُ فَاطِمَةَ مَا أَزْعُمُ أَنَّ فِيهِ قُرْآناً وَ فِيهِ مَا يَحْتَاجُ النَّاسُ إِلَيْنَا وَ لَا نَحْتَاجُ إِلَى أَحَدٍ حَتَّى فِيهِ الْجَلْدَةُ وَ نِصْفُ الْجَلْدَةِ وَ رُبُعُ الْجَلْدَةِ وَ أَرْشُ الْخَدْشِ ",
          "وَ عِنْدِي الْجَفْرَ الْأَحْمَرَ قَالَ قُلْتُ وَ أَيُّ شَيْ‏ءٍ فِي الْجَفْرِ الْأَحْمَرِ قَالَ السِّلَاحُ وَ ذَلِكَ إِنَّمَا يُفْتَحُ لِلدَّمِ يَفْتَحُهُ صَاحِبُ السَّيْفِ لِلْقَتْلِ ",
          "فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ أَبِي يَعْفُورٍ أَصْلَحَكَ اللَّهُ أَ يَعْرِفُ هَذَا بَنُو الْحَسَنِ فَقَالَ إِي وَ اللَّهِ كَمَا يَعْرِفُونَ اللَّيْلَ أَنَّهُ لَيْلٌ وَ النَّهَارَ أَنَّهُ نَهَارٌ وَ لَكِنَّهُمْ يَحْمِلُهُمُ الْحَسَدُ وَ طَلَبُ الدُّنْيَا عَلَى الْجُحُودِ وَ الْإِنْكَارِ وَ لَوْ طَلَبُوا الْحَقَّ بِالْحَقِّ لَكَانَ خَيْراً لَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al Husayn Bin Abu Al A’ala who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘With me<sup>asws</sup> is the white <span class=\"iTxt\">Jaf’r</span>’. I said, ‘So which thing is in it?’ He<sup>asws</sup> said: ‘The Psalms of Dawood<sup>as</sup>, and Torah of Musa<sup>as</sup>, and Evangel of Isa<sup>as</sup>, and Parchment of Ibrahim<sup>as</sup>, and the Permissible and the Prohibitions, and Parchment of (Syeda) Fatima<sup>asws</sup>. I<sup>asws</sup> am not claiming that the Quran is in it, and therein is what the people would be needy to us<sup>asws</sup>, and we<sup>asws</sup> are not needy to anyone, to the extent that in it is the lashing, and half a lashing, and a quarter of the lashing, and compensation of the scratch. ",
            "And with me<sup>asws</sup> is the red <span class=\"iTxt\">Jaf’r</span>’. I said, ‘And which thing is in the red <span class=\"iTxt\">Jaf’r</span>?’ He<sup>asws</sup> said: ‘The weapons, and that rather is opened for the blood (cases of bloodshed). The owner of the sword opens it for the murder (cases)’. ",
            "So Abdullah Bin Abu Yafour said to him<sup style=\"font-weight: normal\">asws</sup>, ‘May Allah<sup style=\"font-weight: normal\">azwj</sup> Keep you<sup style=\"font-weight: normal\">asws</sup> well! Do the sons of Al-Hassan<sup style=\"font-weight: normal\">asws</sup> recognise this?’ Yes, by Allah<sup style=\"font-weight: normal\">azwj</sup>! Just as they are recognising the night that it is a night and the day that it is a day, but they were carried away by the envy and the seeking of the world upon the rejection and the denial, and had they sought the Truth by the Truth, it would have been better for them’."
          ],
          "en.sarwar": [
            " 3. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-Husayn ibn abu ‘Ala’who has said that he heard abu ‘Abdallah (a.s.) say the following. “With me is the white Jafr.” The narrator has said that he asked the Imams (a.s.) “What is in it?” The Imams (a.s.) said, “In it there is the psalms of David, the Torah of Moses, the Gospel of Jesus, the Books of Abraham, the laws that explain the lawful and unlawful matters and Mushaf of Fatima (a.s.) in which, I do not think there is nay thing from the Holy Quran. In it there is all that people need us to do for them and so that we would not need any one else. In it there is information even about a lash, half of a lash and one forth of a lash and about the amount of compensation for A number of our people has narrated from scratch caused to someone. “With me there is the red Jafr.” The narrator has said that he asked the Imams (a.s.), “What is in the red Jafr?” The Imams (a.s.) said, “In it there is the Armaments. It is because it only is opened for bloodshed. The owner of the sword opens it to kill.” The narrator has said that ‘Abdallah ibn abu Ya‘fur asked the Imams (a.s.), “May Allah keep you well, do the descendents of al-Hassan (a.s.) know this? The Imam (a.s.) said, “Yes, I swear by Allah, they know it just as they know the night that it is night and the day that it is the day but jealousy and worldly gains cause them to act in denial and rejection. Had they sought the truth with the truth it would have been better for them.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (58/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 636,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/180",
              "text": "سُلَيْمَانَ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَمَّنْ ذَكَرَهُ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:40:4",
        "relations": {
          "Mentions": [
            "/books/quran:46:4"
          ]
        },
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ فِي الْجَفْرِ الَّذِي يَذْكُرُونَهُ لَمَا يَسُوؤُهُمْ لِأَنَّهُمْ لَا يَقُولُونَ الْحَقَّ وَ الْحَقُّ فِيهِ فَلْيُخْرِجُوا قَضَايَا عَلِيٍّ وَ فَرَائِضَهُ إِنْ كَانُوا صَادِقِينَ وَ سَلُوهُمْ عَنِ الْخَالَاتِ وَ الْعَمَّاتِ وَ لْيُخْرِجُوا مُصْحَفَ فَاطِمَةَ ( عليها السلام ) فَإِنَّ فِيهِ وَصِيَّةَ فَاطِمَةَ ( عليها السلام ) وَ مَعَهُ سِلَاحُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فَأْتُوا بِكِتابٍ مِنْ قَبْلِ هذا أَوْ أَثارَةٍ مِنْ عِلْمٍ إِنْ كُنْتُمْ صادِقِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from the one who mentioned it, from Suleyman Bin Khalid who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘With regards to the <span class=\"iTxt\">Jaf’r</span> which they (Zaydiites) are mentioning is due to what is disturbing them. They are not saying the truth, and the Truth is in it. So let them be extracting the judgments of Ali<sup>asws</sup> and his<sup>asws</sup> Obligation if they were truthful. And ask them about the maternal aunts and the paternal aunts, and let them bring out the Parchment of Syeda Fatima<sup>asws</sup>, for therein is a bequest of Syeda Fatima<sup>asws</sup>, and with it are the weapons of Rasool-Allah<sup>saww</sup>. Allah Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:46#h4\">[46:4]</a> Bring me a Book before this or traces of the Knowledge, if you are truthful</span>’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from the person that he mentioned from Sulayman ibn Khalid from abu ‘Abdallah (a.s.) who has said the following. “The Jafr of which they speak certainly disappoints them because they (the Zaydis) do not speak the truth while Jafr does contain the truth. Let them bring to light therefrom the judgments of Ali (a.s.) and his rulles of inheritance if they are truthful. Ask them about (the inheritance) of paternal and maternal aunts. Let them show the Mushaf of Fatima (a.s.). In it certainly there is the will of Fatima (a.s.). With it there is the Armaments the Messenger of Allah. Allah, the Most Holy, the Most High, has said, “Bring me a Book, revealed before this Quran, or any other proof based on knowledge to support your belief, if indeed you are truthful” <a href=\"/#/books/quran:46#h4\">[46:4]</a>."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/59)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 637,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/376",
              "text": "ابْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/326",
              "text": "أَبِي عُبَيْدَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:40:5",
        "text": [
          " سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) بَعْضُ أَصْحَابِنَا عَنِ الْجَفْرِ فَقَالَ هُوَ جِلْدُ ثَوْرٍ مَمْلُوءٌ عِلْماً ",
          "قَالَ لَهُ فَالْجَامِعَةُ قَالَ تِلْكَ صَحِيفَةٌ طُولُهَا سَبْعُونَ ذِرَاعاً فِي عَرْضِ الْأَدِيمِ مِثْلُ فَخِذِ الْفَالِجِ فِيهَا كُلُّ مَا يَحْتَاجُ النَّاسُ إِلَيْهِ وَ لَيْسَ مِنْ قَضِيَّةٍ إِلَّا وَ هِيَ فِيهَا حَتَّى أَرْشُ الْخَدْشِ",
          "قَالَ فَمُصْحَفُ فَاطِمَةَ ( عليها السلام ) قَالَ فَسَكَتَ طَوِيلًا ثُمَّ قَالَ إِنَّكُمْ لَتَبْحَثُونَ عَمَّا تُرِيدُونَ وَ عَمَّا لَا تُرِيدُونَ إِنَّ فَاطِمَةَ مَكَثَتْ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) خَمْسَةً وَ سَبْعِينَ يَوْماً وَ كَانَ دَخَلَهَا حُزْنٌ شَدِيدٌ عَلَى أَبِيهَا وَ كَانَ جَبْرَئِيلُ ( عليه السلام ) يَأْتِيهَا فَيُحْسِنُ عَزَاءَهَا عَلَى أَبِيهَا وَ يُطَيِّبُ نَفْسَهَا وَ يُخْبِرُهَا عَنْ أَبِيهَا وَ مَكَانِهِ وَ يُخْبِرُهَا بِمَا يَكُونُ بَعْدَهَا فِي ذُرِّيَّتِهَا وَ كَانَ عَلِيٌّ ( عليه السلام ) يَكْتُبُ ذَلِكَ فَهَذَا مُصْحَفُ فَاطِمَةَ ( عليها السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Abu Ubeyda who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked by one of our companions about the <span class=\"iTxt\">Jaf’r</span>. So he<sup>asws</sup> said: ‘It is an ox hide filled with knowledge’. ",
            "He said to him<sup>asws</sup>, ‘So the <span class=\"iTxt\">Jami’e</span>?’ He<sup>asws</sup> said: ‘That is a lengthy Parchment of seventy cubits in width of the leather, like a thigh of the camel. Therein is everything what the people would be needy to, and there isn’t anything from a judgment except and it is therein, to the extent of the compensation for a scratch’. ",
            "He said, ‘So the Parchment of Syeda Fatima<sup>asws</sup>?’ So he<sup>asws</sup> was silent for a long while, then said: ‘You all are exploring about what you need and about that which you do not need! Fatima<sup>asws</sup> remained after Rasool-Allah<sup>saww</sup> for <span style=\"text-decoration: underline\">seventy-five (75)</span> days, and intense grief entered into her<sup>asws</sup> for her<sup>asws</sup> father<sup>saww</sup>, and it was so that Jibraeel<sup>as</sup> would come to her<sup>asws</sup> and would give condolences upon her<sup>asws</sup> father<sup>saww</sup>, and that would better her<sup>asws</sup> self, and he<sup>as</sup> informed her<sup>asws</sup> about her<sup>asws</sup> father<sup>saww</sup>, and his<sup>saww</sup> place, and he<sup>as</sup> informed her<sup>asws</sup> with what would be happening after her<sup>asws</sup> in her<sup>asws</sup> children, and Ali<sup>asws</sup> would write that down. So this is the Parchment of Syeda Fatima<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from abu ‘Ubaydah who has said that the people from our group asked abu ‘Abdallah (a.s.) about Jafr and the Imam (a.s.) said the following. “It is the skin of a bull which is full of knowledge.” Then they asked the Imam (a.s.) about al-Jami‘a. The Imam (a.s.) replied, “It is a parchment that is seventy yards long with a width of hide like that of the leg of a huge camel. It contains all that people may need. There is no case for there is a rule in it. In it there is the law to settle the compensation for a scratch caused to a person.” The narrator has said that he asked the Imams (a.s.), “What is Mushaf of Fatima?” The Imam (a.s.) waited for quite a while. Then he said, “You ask about what you really mean and what you do not mean. Fatima (a.s.) lived after the Messenger of Allah for seventy-five days. She was severely depressed because of the death of her father. Jibril (a.s.) would come to provide her solace because of the death of her father. Jibril would comfort her soul. Jibril would inform her about her father and his place and of the future events and about what will happen to her children. At the same time Ali (a.s.) would write all of them down and thus is Mushaf of Fatima (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (60/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 638,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/338",
              "text": "صَالِحِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/792",
              "text": "أَحْمَدَ بْنِ أَبِي بِشْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/793",
              "text": "بَكْرِ بْنِ كَرِبٍ الصَّيْرَفِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ صَالِحِ بْنِ سَعِيدٍ عَنْ أَحْمَدَ بْنِ أَبِي بِشْرٍ عَنْ بَكْرِ بْنِ كَرِبٍ الصَّيْرَفِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:40:6",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ عِنْدَنَا مَا لَا نَحْتَاجُ مَعَهُ إِلَى النَّاسِ وَ إِنَّ النَّاسَ لَيَحْتَاجُونَ إِلَيْنَا وَ إِنَّ عِنْدَنَا كِتَاباً إِمْلَاءُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ خَطُّ عَلِيٍّ ( عليه السلام ) صَحِيفَةً فِيهَا كُلُّ حَلَالٍ وَ حَرَامٍ وَ إِنَّكُمْ لَتَأْتُونَّا بِالْأَمْرِ فَنَعْرِفُ إِذَا أَخَذْتُمْ بِهِ وَ نَعْرِفُ إِذَا تَرَكْتُمُوهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Salih Bin Saeed, from Ahmad Bin Abu Bishr, from Bakr Bin Karb Al Sayrafi who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘With us<sup>asws</sup> is that so with it we<sup>asws</sup> would not be needy to the people, and the people would be becoming needy to us (what is therein), and that with us<sup>asws</sup> is a book dictated by Rasool-Allah<sup>saww</sup> and written by Ali<sup>asws</sup>. A Parchment wherein is every Permissible and Prohibition, and you all are coming to us<sup>asws</sup> with the matter, so we<sup>asws</sup> recognise when you take with it and we<sup>asws</sup> recognise when you are leaving it’."
          ],
          "en.sarwar": [
            " 6. A number of our people has narrated from Ahmad ibn Muhammad from Salih ibn Sa‘id from Ahmad ibn abu Bishr from Bakr ibn Karib al-Sayrafi who has said that he heard abu ‘Abdallah (a.s.) say the following. “With us there are such things that because of which we do not become need to people instead people need us. With us there is a book that the Messenger of Allah had dictated and Ali (a.s.) had written it down. It is a book. In it there are all laws of lawful and unlawful matters. You come to us with A number of our people has narrated from issue and we know when you follow the guidance and when you disregard it.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/60)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 639,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/227",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/544",
              "text": "فُضَيْلِ بْنِ يَسَارٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/571",
              "text": "بُرَيْدِ بْنِ مُعَاوِيَةَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/794",
              "text": "زُرَارَةَ أَنَّ عَبْدَ الْمَلِكِ بْنَ أَعْيَنَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ فُضَيْلِ بْنِ يَسَارٍ وَ بُرَيْدِ بْنِ مُعَاوِيَةَ وَ زُرَارَةَ أَنَّ عَبْدَ الْمَلِكِ بْنَ أَعْيَنَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:40:7",
        "text": [
          " لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الزَّيْدِيَّةَ وَ الْمُعْتَزِلَةَ قَدْ أَطَافُوا بِمُحَمَّدِ بْنِ عَبْدِ اللَّهِ فَهَلْ لَهُ سُلْطَانٌ فَقَالَ وَ اللَّهِ إِنَّ عِنْدِي لَكِتَابَيْنِ فِيهِمَا تَسْمِيَةُ كُلِّ نَبِيٍّ وَ كُلِّ مَلِكٍ يَمْلِكُ الْأَرْضَ لَا وَ اللَّهِ مَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ فِي وَاحِدٍ مِنْهُمَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his fathr, from Ibn Abu Umeyr, from Umar Bin Azina, from Fuzayl Bin Yasaar and Bureyd Bin Muawiya and Zurara that, ",
            "‘Abdulah Malik Bin Ayn said to Abu Abdullah<sup>asws</sup>, ‘The Zaydiites and the Mu’tazilites are circling around Muhammad Bin Abdullah, so it there an authority for him?’ So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! With me<sup>asws</sup> are two Books wherein is named every Prophet<sup>as</sup>, and every king who would be a king of the earth. No, by Allah<sup>azwj</sup>! Muhammad Bin Abdullah is not in any one of these two’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn Udhayna from Fudayl ibn Yasar, Burayd ibn Mu‘wiya and Zurarah who have said that ‘Abdallah ibn ‘Abd al-Malik said the following to abu ‘Abdallah (a.s.), “The Zaydi sect and al-Mu‘tazali group circle around Muhammad ibn ‘Abdallah. Does he have any authority?” The Imam (a.s.) said, “I swear by Allah that with me there are two books in which there is the name of every prophet and the name of every king that would rule on earth. No, I swear by Allah, the name of Muhammad ibn ‘Abdallah is not in the list as one of them.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span>  ( )   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/61)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 640,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/163",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/424",
              "text": "عَبْدِ الصَّمَدِ بْنِ بَشِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/425",
              "text": "فُضَيْلِ بْنِ سُكَّرَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الصَّمَدِ بْنِ بَشِيرٍ عَنْ فُضَيْلِ بْنِ سُكَّرَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:40:8",
        "text": [
          " دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ يَا فُضَيْلُ أَ تَدْرِي فِي أَيِّ شَيْ‏ءٍ كُنْتُ أَنْظُرُ قُبَيْلُ قَالَ قُلْتُ لَا قَالَ كُنْتُ أَنْظُرُ فِي كِتَابِ فَاطِمَةَ ( عليها السلام ) لَيْسَ مِنْ مَلِكٍ يَمْلِكُ الْأَرْضَ إِلَّا وَ هُوَ مَكْتُوبٌ فِيهِ بِاسْمِهِ وَ اسْمِ أَبِيهِ وَ مَا وَجَدْتُ لِوُلْدِ الْحَسَنِ فِيهِ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Abdul Samad Bin Bashir, from Fuzayl Bin Sakkara who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said: ‘O Fuzayl! Do you know in which thing I<sup>asws</sup> was looking into just before?’ I said, ‘No’. He<sup>asws</sup> said: ‘I<sup>asws</sup> was looking into the Book of Syeda Fatima<sup>asws</sup>. There isn’t from a king who would be a king of the earth except it is written therein by his name and the name of his father, and I<sup>asws</sup> did not find for the sons of Al-Hassan<sup>asws</sup>, anything in it’."
          ],
          "en.sarwar": [
            " 8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from ‘Abd al-Samad ibn Bashir from Fudayl ibn Sukra who has said that once I went to abu ‘Abdallah (a.s.) and he said the following to me. “O Fudayl, do you know what at did I look just awhile before?” The narrator has said that he said to the Imams (a.s.), “No, I do not know.” The Imam (a.s.) said, “I was looking at the book of Fatima (a.s.). There is no king who would rule on earth with being listed therein by his name and the name of his father but I did not find the name of any of the descendent of al-Hassan therein.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:40",
  "kind": "verse_list"
}