{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 41"
        },
        "path": "/books/al-kafi:1:4:41",
        "titles": {
          "ar": "باب فِي شَأْنِ إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ وَ تَفْسِيرِهَا",
          "en": "Chapter 41 – Regarding the glory of [97:1] We have indeed revealed this in the Night of Predestination (Chapter 97) and its interpretation"
        }
      }
    ],
    "index": 99,
    "local_index": 41,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 42"
        },
        "path": "/books/al-kafi:1:4:42",
        "titles": {
          "ar": "باب فِي أَنَّ الْأَئِمَّةَ ( عليهم السلام ) يَزْدَادُونَ فِي لَيْلَةِ الْجُمُعَةِ",
          "en": "Chapter 42 – Regarding that the Imams<sup>asws</sup> are being increased (with knowledge) during the night of Friday"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 40"
        },
        "path": "/books/al-kafi:1:4:40",
        "titles": {
          "ar": "باب فِيهِ ذِكْرُ الصَّحِيفَةِ وَ الْجَفْرِ وَ الْجَامِعَةِ وَ مُصْحَفِ فَاطِمَةَ ( عليها السلام )",
          "en": "Chapter 40 – In it is the mention of the Parchment, and the Jaf’r, and the Jami’e, and Parchments of Fatima<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:41",
    "titles": {
      "ar": "باب فِي شَأْنِ إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ وَ تَفْسِيرِهَا",
      "en": "Chapter 41 – Regarding the glory of [97:1] We have indeed revealed this in the Night of Predestination (Chapter 97) and its interpretation"
    },
    "verse_count": 9,
    "verse_start_index": 640,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 641,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/283",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/730",
              "text": "الْحَسَنِ بْنِ الْعَبَّاسِ بْنِ الْحَرِيشِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/731",
              "text": "أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ الْعَبَّاسِ بْنِ الْحَرِيشِ عَنْ أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:41:1",
        "relations": {
          "Mentions": [
            "/books/quran:44:2",
            "/books/quran:15:94",
            "/books/quran:2:257",
            "/books/quran:97:2",
            "/books/quran:97:3",
            "/books/quran:44:1",
            "/books/quran:3:7",
            "/books/quran:97:4",
            "/books/quran:97:5",
            "/books/quran:97:1",
            "/books/quran:57:23",
            "/books/quran:44:3",
            "/books/quran:44:5"
          ]
        },
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بَيْنَا أَبِي ( عليه السلام ) يَطُوفُ بِالْكَعْبَةِ إِذَا رَجُلٌ مُعْتَجِرٌ قَدْ قُيِّضَ لَهُ فَقَطَعَ عَلَيْهِ أُسْبُوعَهُ حَتَّى أَدْخَلَهُ إِلَى دَارٍ جَنْبَ الصَّفَا فَأَرْسَلَ إِلَيَّ فَكُنَّا ثَلَاثَةً",
          "فَقَالَ مَرْحَباً يَا ابْنَ رَسُولِ اللَّهِ ثُمَّ وَضَعَ يَدَهُ عَلَى رَأْسِي وَ قَالَ بَارَكَ اللَّهُ فِيكَ يَا أَمِينَ اللَّهِ بَعْدَ آبَائِهِ يَا أَبَا جَعْفَرٍ إِنْ شِئْتَ فَأَخْبِرْنِي وَ إِنْ شِئْتَ فَأَخْبَرْتُكَ وَ إِنْ شِئْتَ سَلْنِي وَ إِنْ شِئْتَ سَأَلْتُكَ وَ إِنْ شِئْتَ فَاصْدُقْنِي وَ إِنْ شِئْتَ صَدَقْتُكَ",
          "قَالَ كُلَّ ذَلِكَ أَشَاءُ قَالَ فَإِيَّاكَ أَنْ يَنْطِقَ لِسَانُكَ عِنْدَ مَسْأَلَتِي بِأَمْرٍ تُضْمِرُ لِي غَيْرَهُ قَالَ إِنَّمَا يَفْعَلُ ذَلِكَ مَنْ فِي قَلْبِهِ عِلْمَانِ يُخَالِفُ أَحَدُهُمَا صَاحِبَهُ وَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَبَى أَنْ يَكُونَ لَهُ عِلْمٌ فِيهِ اخْتِلَافٌ",
          "قَالَ هَذِهِ مَسْأَلَتِي وَ قَدْ فَسَّرْتَ طَرَفاً مِنْهَا أَخْبِرْنِي عَنْ هَذَا الْعِلْمِ الَّذِي لَيْسَ فِيهِ اخْتِلَافٌ مَنْ يَعْلَمُهُ قَالَ أَمَّا جُمْلَةُ الْعِلْمِ فَعِنْدَ اللَّهِ جَلَّ ذِكْرُهُ وَ أَمَّا مَا لَا بُدَّ لِلْعِبَادِ مِنْهُ فَعِنْدَ الْأَوْصِيَاءِ",
          "قَالَ فَفَتَحَ الرَّجُلُ عَجِيرَتَهُ وَ اسْتَوَى جَالِساً وَ تَهَلَّلَ وَجْهُهُ وَ قَالَ هَذِهِ أَرَدْتُ وَ لَهَا أَتَيْتُ زَعَمْتَ أَنَّ عِلْمَ مَا لَا اخْتِلَافَ فِيهِ مِنَ الْعِلْمِ عِنْدَ الْأَوْصِيَاءِ فَكَيْفَ يَعْلَمُونَهُ قَالَ كَمَا كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَعْلَمُهُ إِلَّا أَنَّهُمْ لَا يَرَوْنَ مَا كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَرَى لِأَنَّهُ كَانَ نَبِيّاً وَ هُمْ مُحَدَّثُونَ وَ أَنَّهُ كَانَ يَفِدُ إِلَى اللَّهِ عَزَّ وَ جَلَّ فَيَسْمَعُ الْوَحْيَ وَ هُمْ لَا يَسْمَعُونَ",
          "فَقَالَ صَدَقْتَ يَا ابْنَ رَسُولِ اللَّهِ سَآتِيكَ بِمَسْأَلَةٍ صَعْبَةٍ أَخْبِرْنِي عَنْ هَذَا الْعِلْمِ مَا لَهُ لَا يَظْهَرُ كَمَا كَانَ يَظْهَرُ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ فَضَحِكَ أَبِي ( عليه السلام ) وَ قَالَ أَبَى اللَّهُ عَزَّ وَ جَلَّ أَنْ يُطْلِعَ عَلَى عِلْمِهِ إِلَّا مُمْتَحَناً لِلْإِيمَانِ بِهِ كَمَا قَضَى عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَنْ يَصْبِرَ عَلَى أَذَى قَوْمِهِ وَ لَا يُجَاهِدَهُمْ إِلَّا بِأَمْرِهِ",
          "فَكَمْ مِنِ اكْتِتَامٍ قَدِ اكْتَتَمَ بِهِ حَتَّى قِيلَ لَهُ فَاصْدَعْ بِما تُؤْمَرُ وَ أَعْرِضْ عَنِ الْمُشْرِكِينَ وَ ايْمُ اللَّهِ أَنْ لَوْ صَدَعَ قَبْلَ ذَلِكَ لَكَانَ آمِناً وَ لَكِنَّهُ إِنَّمَا نَظَرَ فِي الطَّاعَةِ وَ خَافَ الْخِلَافَ فَلِذَلِكَ كَفَّ ",
          "فَوَدِدْتُ أَنَّ عَيْنَكَ تَكُونُ مَعَ مَهْدِيِّ هَذِهِ الْأُمَّةِ وَ الْمَلَائِكَةُ بِسُيُوفِ آلِ دَاوُدَ بَيْنَ السَّمَاءِ وَ الْأَرْضِ تُعَذِّبُ أَرْوَاحَ الْكَفَرَةِ مِنَ الْأَمْوَاتِ وَ تُلْحِقُ بِهِمْ أَرْوَاحَ أَشْبَاهِهِمْ مِنَ الْأَحْيَاءِ ثُمَّ أَخْرَجَ سَيْفاً ثُمَّ قَالَ هَا إِنَّ هَذَا مِنْهَا",
          "قَالَ فَقَالَ أَبِي إِي وَ الَّذِي اصْطَفَى مُحَمَّداً عَلَى الْبَشَرِ قَالَ فَرَدَّ الرَّجُلُ اعْتِجَارَهُ وَ قَالَ أَنَا إِلْيَاسُ مَا سَأَلْتُكَ عَنْ أَمْرِكَ وَ بِي مِنْهُ جَهَالَةٌ غَيْرَ أَنِّي أَحْبَبْتُ أَنْ يَكُونَ هَذَا الْحَدِيثُ قُوَّةً لِأَصْحَابِكَ وَ سَأُخْبِرُكَ بِآيَةٍ أَنْتَ تَعْرِفُهَا إِنْ خَاصَمُوا بِهَا فَلَجُوا قَالَ فَقَالَ لَهُ أَبِي إِنْ شِئْتَ أَخْبَرْتُكَ بِهَا قَالَ قَدْ شِئْتُ",
          "قَالَ إِنَّ شِيعَتَنَا إِنْ قَالُوا لِأَهْلِ الْخِلَافِ لَنَا إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ لِرَسُولِهِ ( صلى الله عليه وآله ) إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ إِلَى آخِرِهَا فَهَلْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَعْلَمُ مِنَ الْعِلْمِ شَيْئاً لَا يَعْلَمُهُ فِي تِلْكَ اللَّيْلَةِ أَوْ يَأْتِيهِ بِهِ جَبْرَئِيلُ ( عليه السلام ) فِي غَيْرِهَا فَإِنَّهُمْ سَيَقُولُونَ لَا فَقُلْ لَهُمْ فَهَلْ كَانَ لِمَا عَلِمَ بُدٌّ مِنْ أَنْ يُظْهِرَ فَيَقُولُونَ لَا ",
          "فَقُلْ لَهُمْ فَهَلْ كَانَ فِيمَا أَظْهَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ عِلْمِ اللَّهِ عَزَّ ذِكْرُهُ اخْتِلَافٌ فَإِنْ قَالُوا لَا فَقُلْ لَهُمْ فَمَنْ حَكَمَ بِحُكْمِ اللَّهِ فِيهِ اخْتِلَافٌ فَهَلْ خَالَفَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَيَقُولُونَ نَعَمْ فَإِنْ قَالُوا لَا فَقَدْ نَقَضُوا أَوَّلَ كَلَامِهِمْ",
          "فَقُلْ لَهُمْ مَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ وَ الرَّاسِخُونَ فِي الْعِلْمِ فَإِنْ قَالُوا مَنِ الرَّاسِخُونَ فِي الْعِلْمِ فَقُلْ مَنْ لَا يَخْتَلِفُ فِي عِلْمِهِ فَإِنْ قَالُوا فَمَنْ هُوَ ذَاكَ فَقُلْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) صَاحِبَ ذَلِكَ فَهَلْ بَلَّغَ أَوْ لَا فَإِنْ قَالُوا قَدْ بَلَّغَ فَقُلْ فَهَلْ مَاتَ ( صلى الله عليه وآله ) وَ الْخَلِيفَةُ مِنْ بَعْدِهِ يَعْلَمُ عِلْماً لَيْسَ فِيهِ اخْتِلَافٌ",
          "فَإِنْ قَالُوا لَا فَقُلْ إِنَّ خَلِيفَةَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مُؤَيَّدٌ وَ لَا يَسْتَخْلِفُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَّا مَنْ يَحْكُمُ بِحُكْمِهِ وَ إِلَّا مَنْ يَكُونُ مِثْلَهُ إِلَّا النُّبُوَّةَ وَ إِنْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَمْ يَسْتَخْلِفْ فِي عِلْمِهِ أَحَداً فَقَدْ ضَيَّعَ مَنْ فِي أَصْلَابِ الرِّجَالِ مِمَّنْ يَكُونُ بَعْدَهُ",
          "فَإِنْ قَالُوا لَكَ فَإِنَّ عِلْمَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) كَانَ مِنَ الْقُرْآنِ فَقُلْ حم. وَ الْكِتابِ الْمُبِينِ. إِنَّا أَنْزَلْناهُ فِي لَيْلَةٍ مُبارَكَةٍ إِنَّا كُنَّا مُنْذِرِينَ فِيها إِلَى قَوْلِهِ إِنَّا كُنَّا مُرْسِلِينَ",
          "فَإِنْ قَالُوا لَكَ لَا يُرْسِلُ اللَّهُ عَزَّ وَ جَلَّ إِلَّا إِلَى نَبِيٍّ فَقُلْ هَذَا الْأَمْرُ الْحَكِيمُ الَّذِي يُفْرَقُ فِيهِ هُوَ مِنَ الْمَلَائِكَةِ وَ الرُّوحِ الَّتِي تَنْزِلُ مِنْ سَمَاءٍ إِلَى سَمَاءٍ أَوْ مِنْ سَمَاءٍ إِلَى أَرْضٍ فَإِنْ قَالُوا مِنْ سَمَاءٍ إِلَى سَمَاءٍ فَلَيْسَ فِي السَّمَاءِ أَحَدٌ يَرْجِعُ مِنْ طَاعَةٍ إِلَى مَعْصِيَةٍ فَإِنْ قَالُوا مِنْ سَمَاءٍ إِلَى أَرْضٍ وَ أَهْلُ الْأَرْضِ أَحْوَجُ الْخَلْقِ إِلَى ذَلِكَ",
          "فَقُلْ فَهَلْ لَهُمْ بُدٌّ مِنْ سَيِّدٍ يَتَحَاكَمُونَ إِلَيْهِ فَإِنْ قَالُوا فَإِنَّ الْخَلِيفَةَ هُوَ حَكَمُهُمْ فَقُلْ اللَّهُ وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ مِنَ الظُّلُماتِ إِلَى النُّورِ إِلَى قَوْلِهِ خالِدُونَ لَعَمْرِي مَا فِي الْأَرْضِ وَ لَا فِي السَّمَاءِ وَلِيٌّ لِلَّهِ عَزَّ ذِكْرُهُ إِلَّا وَ هُوَ مُؤَيَّدٌ وَ مَنْ أُيِّدَ لَمْ يُخْطِ وَ مَا فِي الْأَرْضِ عَدُوٌّ لِلَّهِ عَزَّ ذِكْرُهُ إِلَّا وَ هُوَ مَخْذُولٌ وَ مَنْ خُذِلَ لَمْ يُصِبْ كَمَا أَنَّ الْأَمْرَ لَا بُدَّ مِنْ تَنْزِيلِهِ مِنَ السَّمَاءِ يَحْكُمُ بِهِ أَهْلُ الْأَرْضِ كَذَلِكَ لَا بُدَّ مِنْ وَالٍ ",
          "فَإِنْ قَالُوا لَا نَعْرِفُ هَذَا فَقُلْ لَهُمْ قُولُوا مَا أَحْبَبْتُمْ أَبَى اللَّهُ عَزَّ وَ جَلَّ بَعْدَ مُحَمَّدٍ ( صلى الله عليه وآله ) أَنْ يَتْرُكَ الْعِبَادَ وَ لَا حُجَّةَ عَلَيْهِمْ ",
          "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثُمَّ وَقَفَ فَقَالَ هَاهُنَا يَا ابْنَ رَسُولِ اللَّهِ بَابٌ غَامِضٌ أَ رَأَيْتَ إِنْ قَالُوا حُجَّةُ اللَّهِ الْقُرْآنُ قَالَ إِذَنْ أَقُولَ لَهُمْ إِنَّ الْقُرْآنَ لَيْسَ بِنَاطِقٍ يَأْمُرُ وَ يَنْهَى وَ لَكِنْ لِلْقُرْآنِ أَهْلٌ يَأْمُرُونَ وَ يَنْهَوْنَ وَ أَقُولَ قَدْ عَرَضَتْ لِبَعْضِ أَهْلِ الْأَرْضِ مُصِيبَةٌ مَا هِيَ فِي السُّنَّةِ وَ الْحُكْمِ الَّذِي لَيْسَ فِيهِ اخْتِلَافٌ وَ لَيْسَتْ فِي الْقُرْآنِ أَبَى اللَّهُ لِعِلْمِهِ بِتِلْكَ الْفِتْنَةِ أَنْ تَظْهَرَ فِي الْأَرْضِ وَ لَيْسَ فِي حُكْمِهِ رَادٌّ لَهَا وَ مُفَرِّجٌ عَنْ أَهْلِهَا ",
          "فَقَالَ هَاهُنَا تَفْلُجُونَ يَا ابْنَ رَسُولِ اللَّهِ أَشْهَدُ أَنَّ اللَّهَ عَزَّ ذِكْرُهُ قَدْ عَلِمَ بِمَا يُصِيبُ الْخَلْقَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ أَوْ فِي أَنْفُسِهِمْ مِنَ الدِّينِ أَوْ غَيْرِهِ فَوَضَعَ الْقُرْآنَ دَلِيلًا",
          "قَالَ فَقَالَ الرَّجُلُ هَلْ تَدْرِي يَا ابْنَ رَسُولِ اللَّهِ دَلِيلَ مَا هُوَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) نَعَمْ فِيهِ جُمَلُ الْحُدُودِ وَ تَفْسِيرُهَا عِنْدَ الْحُكْمِ فَقَالَ أَبَى اللَّهُ أَنْ يُصِيبَ عَبْداً بِمُصِيبَةٍ فِي دِينِهِ أَوْ فِي نَفْسِهِ أَوْ فِي مَالِهِ لَيْسَ فِي أَرْضِهِ مِنْ حُكْمِهِ قَاضٍ بِالصَّوَابِ فِي تِلْكَ الْمُصِيبَةِ ",
          "قَالَ فَقَالَ الرَّجُلُ أَمَّا فِي هَذَا الْبَابِ فَقَدْ فَلَجْتَهُمْ بِحُجَّةٍ إِلَّا أَنْ يَفْتَرِيَ خَصْمُكُمْ عَلَى اللَّهِ فَيَقُولَ لَيْسَ لِلَّهِ جَلَّ ذِكْرُهُ حُجَّةٌ وَ لَكِنْ أَخْبِرْنِي عَنْ تَفْسِيرِ لِكَيْلا تَأْسَوْا عَلى ما فاتَكُمْ مِمَّا خُصَّ بِهِ عَلِيٌّ ( عليه السلام ) وَ لا تَفْرَحُوا بِما آتاكُمْ ",
          "قَالَ فِي أَبِي فُلَانٍ وَ أَصْحَابِهِ وَاحِدَةٌ مُقَدِّمَةٌ وَ وَاحِدَةٌ مُؤَخِّرَةٌ لِكَيْلا تَأْسَوْا عَلى ما فاتَكُمْ مِمَّا خُصَّ بِهِ عَلِيٌّ ( عليه السلام ) وَ لا تَفْرَحُوا بِما آتاكُمْ مِنَ الْفِتْنَةِ الَّتِي عَرَضَتْ لَكُمْ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ",
          "فَقَالَ الرَّجُلُ أَشْهَدُ أَنَّكُمْ أَصْحَابُ الْحُكْمِ الَّذِي لَا اخْتِلَافَ فِيهِ ثُمَّ قَامَ الرَّجُلُ وَ ذَهَبَ فَلَمْ أَرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abdu Abdullah and Muhammad Bin Al Hassan, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Al Hassan Bin Al Abbas Bin Al Harysh, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> who said, ‘Abu Abdullah<sup>asws</sup> said: ‘While my<sup>asws</sup> father<sup>asws</sup> was performing <span class=\"iTxt\">Tawaaf</span> of the Kabah, when a man covered by a turban of his like an egg-shell, cut off his<sup>asws</sup> seven (circuits) until he made him<sup>asws</sup> enter into a house by the side of Al-Safa. So he<sup>asws</sup> sent for me<sup>asws</sup>, and we became three.",
            "So he said, ‘Welcome, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>!’ Then he placed his hand upon my<sup>asws</sup> head and said, ‘May Allah<sup>azwj</sup> Bless you<sup>asws</sup>, O trustees of Allah<sup>azwj</sup> after his<sup>asws</sup> forefathers<sup>asws</sup>! O Abu Ja’far<sup>asws</sup>! If you<sup>asws</sup> so desire, so inform me and if you<sup>asws</sup> so desire, so I shall inform you<sup>asws</sup>, and if you<sup>asws</sup> so desire, ask me, and if you<sup>asws</sup> so desire, I shall ask you<sup>asws</sup>, and if you<sup>asws</sup> so desire, ratify me, and if you<sup>asws</sup> so desire, I shall ratify you<sup>asws</sup>’. ",
            "He<sup>asws</sup> said: ‘All of that I<sup>asws</sup> like’. He said, ‘So beware of speaking by your tongue during my questioning by a matter with something else in your<sup>asws</sup> consciousness’. He<sup>asws</sup> said: ‘But rather that is the one in whose heart are two knowledges, one of it opposing its counterpart, and that Allah<sup>azwj</sup> Mighty and Majestic Refused that there should be a Knowledge for Him<sup>azwj</sup> wherein is a differing’. ",
            "He said, ‘This is my question, and you have explained part of it. Inform me about this knowledge which there is no differing in it. Who knows it?’ He<sup>asws</sup> said: ‘But, the totality of the knowledge, so it is with Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention, and as for what is a must for the servants from it, so it is with the successors<sup>asws</sup>’.",
            "He<sup>asws</sup> said: ‘So the man opened up his turban and sat evenly (relaxed manner), and his face was cheerful, and he said, ‘This is what I wanted, and for it I came over. You<sup>asws</sup> claim that knowledge is what there is no differing therein, from the knowledge with the succesors<sup>asws</sup>, so how do they know it?’ He<sup>asws</sup> said: ‘Just as how Rasool-Allah<sup>saww</sup> used to know it except that they<sup>asws</sup> are not seeing what Rasool-Allah<sup>saww</sup> used to see, because he<sup>saww</sup> was a Prophet<sup>saww</sup>, and they<sup>asws</sup> are <span class=\"iTxt\">Muhaddisoun</span>, and it was so that he<sup>asws</sup> would be a delegate to Allah<sup>azwj</sup> Mighty and Majestic and he<sup>saww</sup> would hear the Revelation, and they<sup>asws</sup> are not hearing’. ",
            "You speak the truth, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! I shall come to you with a difficult question. Inform me about this knowledge. What is the matter with it that it is not apparent (now) just as it was apparent with Rasool-Allah<sup>saww</sup>?’ So my<sup>asws</sup> father<sup>asws</sup> smiled and said: ‘Allah<sup>azwj</sup> Mighty and Majestic Refuses that anyone should have notification of His<sup>azwj</sup> Knowledg except for the one examined for the <span class=\"iTxt\">Eman</span> with it, just as He<sup>azwj</sup> Ordained upon Rasool-Allah<sup>saww</sup> that he<sup>saww</sup> be patient upon the harm of his<sup>saww</sup> people, and he<sup>saww</sup> should not fight against them except by His<sup>azwj</sup> Command. ",
            "So how much from the secrets he<sup>saww</sup> was secretive with until it was said to him<sup>saww</sup>, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:15#h94\">[15:94]</a> Therefore declare openly what you are Commanded with and turn aside from the polytheists</span>. And I swear by Allah<sup>azwj</sup> that had he<sup>saww</sup> proclaimed openly before that, he<sup>saww</sup> would (still) have been safe, but he<sup>saww</sup>, rather, considered to be in the obedience and feared the differing (of people). Therefore, due to that, he<sup>saww</sup> restrained.",
            "So, I<sup>asws</sup> would love it if your eyes happen to be with the Mahdi<sup>asws</sup> of this community, and the Angels with the swords of the family of Dawood<sup>as</sup>, between the sky and the earth, Punishing the souls of the disbelievers from the deceased and join with them the souls of their likes from the living ones’. Then he<sup>asws</sup> brought out a sword, then said: ‘Here, this is from those’. ",
            "He<sup>asws</sup> said: ‘So my<sup>asws</sup> father<sup>asws</sup> said: ‘Yes. By the One<sup>azwj</sup> Who Chose Muhammad<sup>saww</sup> over (all) the human beings!’. So the man returned his turban and said, ‘I am Ilyas<sup>as</sup>. I<sup>as</sup> did not ask you<sup>asws</sup> about your<sup>asws</sup> matter and there was ignorance with me from it, apart from that I<sup>as</sup> loved it that this Hadeeth takes place, as a strengthening for your<sup>asws</sup> companions, and I<sup>as</sup> shall inform you with a Verse you<sup>asws</sup> recognise it, if they were to debate with it, they would win’. So my<sup>asws</sup> father<sup>asws</sup> said to him: ‘If you<sup>as</sup> so desire, I<sup>asws</sup> shall inform you<sup>as</sup> with it’. He said, ‘I do desire it’. ",
            "He<sup>asws</sup> said: ‘Our<sup>asws</sup> Shias, if they were to be saying to the people is opposition to us<sup>asws</sup> that Allah<sup>azwj</sup> Mighty and Majestic is Saying to His<sup>azwj</sup> Rasool<sup>saww</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h1\">[97:1]</a> We have indeed revealed this in the Night of Predestination</span> – up to its end. So, did Rasool-Allah<sup>saww</sup> know anything from the knowledge which he<sup>saww</sup> did not know during that night, or Jibraeel<sup>as</sup> came with it during other than it? So if they would be saying, ‘No’, so say to them, ‘So was it inevitable from what he<sup>saww</sup> knew that he<sup>saww</sup> should manifest it?’ So they would be saying, ‘No’. ",
            "So say to them, ‘So what there, regarding what Rasool-Allah<sup>saww</sup> did manifest, from the Knowledge of Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, any differing?’ So if they say, ‘No’, so say to them, ‘Therefore the one who judges by a Judgment of Allah<sup>azwj</sup> wherein is a differing, so has he opposed Rasool-Allah<sup>saww</sup>?’ So they would be saying, ‘Yes’. So if they say, ‘No’, so they have broken their first speech. ",
            "So say to them, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:3#h7\">[3:7]</a> but none knows its interpretation except Allah, and those who are firmly rooted in the Knowledge</span>’. So if they say, ‘Who are the ones firmly rooted in the Knowledge?’ So say, ‘The ones in whose knowledge there is no differing’. So if they say, ‘So who is that?’ So say, ‘Rasool-Allah<sup>saww</sup> was an owner of that. So did he<sup>saww</sup> deliver or not?’ So if they say, ‘He<sup>saww</sup> did deliver’, so say, ‘He<sup>saww</sup> passed away and the Caliph from after him<sup>saww</sup> had knowledge wherein there was no differing?’ ",
            "So if they say, ‘No’, so say, ‘A Caliph of Rasool-Allah<sup>saww</sup> is Assisted, and Rasool-Allah<sup>saww</sup> would not leave behind anyone except the one who judged by his<sup>saww</sup> judgment, and except one who would happen to be similar to him<sup>saww</sup> except for the Prophet-hood, and if it was so that Rasool-Allah<sup>azwj</sup> did not leave anyone behind regarding his<sup>saww</sup> knowledge, so he<sup>saww</sup> would have wasted the ones who are in the loins of the men, from the ones who would be coming (to the world) after him<sup>saww</sup>’. ",
            "So if they say to you, ‘The knowledge of Rasool-Allah<sup>saww</sup> was from the Quran’, so say, <span class=\"ibTxt\"><a href=\"/#/books/quran:44#h1\">[44:1]</a> Ha Mim! <a href=\"/#/books/quran:44#h2\">[44:2]</a> I swear by the Clarifying Book <a href=\"/#/books/quran:44#h3\">[44:3]</a> Surely We Revealed it on a Blessed Night surely We are ever Warning</span> – up to His<sup>azwj</sup> Words<span class=\"ibTxt\"> <a href=\"/#/books/quran:44#h5\">[44:5]</a> surely We are the Senders (of Messages)</span>’. ",
            "So if they say to you, ‘Allah<sup>azwj</sup> Mighty and Majestic does not Send a Message except to a Prophet<sup>as</sup>, so say, ‘This <span class=\"ibTxt\">44:4] Therein every wise affair is made distinct</span>, it is from the Angels and the Spirit who descend from a sky to a sky or from a sky to the earth?’ So if they say, ‘From a sky to a sky’, so there isn’t anyone in the sky who returns from obedience to disobedience. So if they say, ‘From sky to the earth’, and the people of the earth are more needy of the creatures to that. ",
            "So say, ‘So is there a must for them to have a chief they would be going to for the judgments?’ So if they say, ‘So the Caliph, he is their judge’. So say, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:2#h257\">[2:257]</a> Allah is the Guardian of those who believe. He Extracts them from the darkness into the Light </span>– up to His<sup>azwj</sup> Words<span class=\"ibTxt\"> in it they shall be abiding</span>. By my<sup>asws</sup> life! There is neither in the sky nor in the earth, a Guardian of Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, except that he<sup>asws</sup> is Assisted, and the one who is Assisted would not err, and there is neither in the sky nor in the earth, an enemy of Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention except that he is Abandoned, and the one who is Abandoned would not be correct (in his judgments). Just as it is inevitable for there to be a Revelation which descends from the sky for the people of the earth to be judged with, like that, it is inevitable for there to be a Guardian<sup>asws</sup>.",
            "So if they say, ‘We do not recognise this’. So say to them, ‘Say whatever you so like to. Allah<sup>azwj</sup> Mighty and Majestic Refused that after Muhammad<sup>saww</sup> He<sup>azwj</sup> should leave the servants and there is no Divine Authority upon them’. ",
            "Abu Abdullah<sup>asws</sup> said: ‘Then he<sup>asws</sup> paused, so he (Ilyas<sup>as</sup>) said: ‘Over here, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>, is a vague door. What is your<sup>asws</sup> view if they were to say, ‘The Divine Authority is the Quran’?’ He<sup>asws</sup> said: ‘Then I<sup>asws</sup> would be saying to them: ‘The Quran is not with a speech, Ordering and Prohibiting, but for the Quran there are people<sup>asws</sup> who are ordering and prohibiting,’ and I<sup>asws</sup> would be saying: ‘There would get presented to some people of the earth, a difficulty which is not in the Sunnah, and the judgment wherein there is no differing, and it isn’t in the Quran, Allah<sup>azwj</sup> refused that (situation to occur) for His<sup>azwj</sup> Knowledge, for that strife to appear in the earth and there is no refutation for it in His<sup>azwj</sup> Judgment, and a relief for its people’. ",
            "So he (Ilyas<sup>as</sup>) said: ‘Over here you<sup>asws</sup> are winning, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! I<sup>as</sup> testify that Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention had Known of what would be hitting the creatures from difficulties in the earth, or regarding themselves from the Religion, or something else, so He<sup>azwj</sup> Placed the Quran as Evidence’. ",
            "He<sup>asws</sup> said: ‘So the man (Ilyas<sup>as</sup>) said: ‘Do you<sup>asws</sup> know, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup> the Evidence, what it is?’ Abu Ja’far<sup>asws</sup> said: ‘Yes, therein is the totality of the Legal Punishments, and its interpretation during the judgment’. So he<sup>as</sup> said: ‘Allah<sup>azwj</sup> Refuses that a servant be hit by a difficulty in his Religion, or regarding himself, or in his wealth, and there isn’t in His<sup>azwj</sup> earth from His<sup>azwj</sup> Judgment which can be judged with the correctness with regards to that very difficulty’. ",
            "He<sup>asws</sup> said: ‘So the man (Ilyas<sup>as</sup>) said: ‘But, in this door (subject matter), you<sup>asws</sup> would be winning with an argument except if they were to forge against Allah<sup>azwj</sup> in disputing you<sup>asws</sup>, so they would be saying, ‘There isn’t a Divine Authority for Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention’. But, inform me<sup>as</sup> about the interpretation of <span class=\"ibTxt\"><a href=\"/#/books/quran:57#h23\">[57:23]</a> So that you may not despair over what has escaped you from what Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\"> has been Specialised with, nor be happy at what He has Given you</span>’. ",
            "He<sup>asws</sup> said: ‘(It is) regarding Abu so and so, and his companion. One who was foremost and one who was delayed (later one) <span class=\"ibTxt\"><a href=\"/#/books/quran:57#h23\">[57:23]</a> So that you may not despair over what has escaped you from what Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\"> has been Specialised with, nor be happy at what He has Given you</span>, from the strife which appeared for you after Rasool-Allah<sup>saww</sup>’. ",
            "So the man (Ilyas<sup>as</sup>) said: ‘I<sup>as</sup> testify that you Imams<sup>asws</sup> are the owners of the wisdom wherein there is no differing’. Then the man stood up and went, and I<sup>asws</sup> did not see him (again)’."
          ],
          "en.sarwar": [
            " al-Qadr, Destiny 97 In the Name of God, the Beneficent, the Merciful We revealed the Quran on the Night of Destiny (<a href=\"/#/books/quran:97#h1\">[97:1]</a>. Would that you knew what the Night of Destiny is! <a href=\"/#/books/quran:97#h2\">[97:2]</a>. (Worship) on the Night of Destiny is better than (worship) for a thousand months <a href=\"/#/books/quran:97#h3\">[97:3]</a>. On this Night, the angels and the spirit descend by the permission of their Lord with His decree (to determine everyone’s destiny) <a href=\"/#/books/quran:97#h4\">[97:4]</a>. This Night is all peace until the break of dawn <a href=\"/#/books/quran:97#h5\">[97:5]</a>."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/61)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 642,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/732",
              "text": "عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:41:2",
        "relations": {
          "Mentions": [
            "/books/quran:41:30",
            "/books/quran:44:2",
            "/books/quran:15:94",
            "/books/quran:2:257",
            "/books/quran:97:2",
            "/books/quran:44:4",
            "/books/quran:97:3",
            "/books/quran:97:4",
            "/books/quran:97:5",
            "/books/quran:49:10",
            "/books/quran:97:1",
            "/books/quran:57:23",
            "/books/quran:44:3",
            "/books/quran:44:5",
            "/books/quran:44:6"
          ]
        },
        "text": [
          " بَيْنَا أَبِي جَالِسٌ وَ عِنْدَهُ نَفَرٌ إِذَا اسْتَضْحَكَ حَتَّى اغْرَوْرَقَتْ عَيْنَاهُ دُمُوعاً ثُمَّ قَالَ هَلْ تَدْرُونَ مَا أَضْحَكَنِي قَالَ فَقَالُوا لَا قَالَ زَعَمَ ابْنُ عَبَّاسٍ أَنَّهُ مِنَ الَّذِينَ قالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقامُوا",
          "فَقُلْتُ لَهُ هَلْ رَأَيْتَ الْمَلَائِكَةَ يَا ابْنَ عَبَّاسٍ تُخْبِرُكَ بِوَلَايَتِهَا لَكَ فِي الدُّنْيَا وَ الْآخِرَةِ مَعَ الْأَمْنِ مِنَ الْخَوْفِ وَ الْحُزْنِ قَالَ فَقَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ وَ قَدْ دَخَلَ فِي هَذَا جَمِيعُ الْأُمَّةِ فَاسْتَضْحَكْتُ ثُمَّ قُلْتُ صَدَقْتَ يَا ابْنَ عَبَّاسٍ أَنْشُدُكَ اللَّهَ هَلْ فِي حُكْمِ اللَّهِ جَلَّ ذِكْرُهُ اخْتِلَافٌ قَالَ فَقَالَ لَا",
          "فَقُلْتُ مَا تَرَى فِي رَجُلٍ ضَرَبَ رَجُلًا أَصَابِعَهُ بِالسَّيْفِ حَتَّى سَقَطَتْ ثُمَّ ذَهَبَ وَ أَتَى رَجُلٌ آخَرُ فَأَطَارَ كَفَّهُ فَأُتِيَ بِهِ إِلَيْكَ وَ أَنْتَ قَاضٍ كَيْفَ أَنْتَ صَانِعٌ قَالَ أَقُولُ لِهَذَا الْقَاطِعِ أَعْطِهِ دِيَةَ كَفِّهِ وَ أَقُولُ لِهَذَا الْمَقْطُوعِ صَالِحْهُ عَلَى مَا شِئْتَ وَ ابْعَثْ بِهِ إِلَى ذَوِي عَدْلٍ",
          "قُلْتُ جَاءَ الِاخْتِلَافُ فِي حُكْمِ اللَّهِ عَزَّ ذِكْرُهُ وَ نَقَضْتَ الْقَوْلَ الْأَوَّلَ أَبَى اللَّهُ عَزَّ ذِكْرُهُ أَنْ يُحْدِثَ فِي خَلْقِهِ شَيْئاً مِنَ الْحُدُودِ وَ لَيْسَ تَفْسِيرُهُ فِي الْأَرْضِ اقْطَعْ قَاطِعَ الْكَفِّ أَصْلًا ثُمَّ أَعْطِهِ دِيَةَ الْأَصَابِعِ هَكَذَا حُكْمُ اللَّهِ لَيْلَةً يَنْزِلُ فِيهَا أَمْرُهُ إِنْ جَحَدْتَهَا بَعْدَ مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَأَدْخَلَكَ اللَّهُ النَّارَ كَمَا أَعْمَى بَصَرَكَ يَوْمَ جَحَدْتَهَا عَلَى ابْنِ أَبِي طَالِبٍ",
          "قَالَ فَلِذَلِكَ عَمِيَ بَصَرِي قَالَ وَ مَا عِلْمُكَ بِذَلِكَ فَوَ اللَّهِ إِنْ عَمِيَ بَصَرِي إِلَّا مِنْ صَفْقَةِ جَنَاحِ الْمَلَكِ قَالَ فَاسْتَضْحَكْتُ ثُمَّ تَرَكْتُهُ يَوْمَهُ ذَلِكَ لِسَخَافَةِ عَقْلِهِ",
          "ثُمَّ لَقِيتُهُ فَقُلْتُ يَا ابْنَ عَبَّاسٍ مَا تَكَلَّمْتَ بِصِدْقٍ مِثْلِ أَمْسِ قَالَ لَكَ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) إِنَّ لَيْلَةَ الْقَدْرِ فِي كُلِّ سَنَةٍ وَ إِنَّهُ يَنْزِلُ فِي تِلْكَ اللَّيْلَةِ أَمْرُ السَّنَةِ وَ إِنَّ لِذَلِكَ الْأَمْرِ وُلَاةً بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقُلْتَ مَنْ هُمْ فَقَالَ أَنَا وَ أَحَدَ عَشَرَ مِنْ صُلْبِي أَئِمَّةٌ مُحَدَّثُونَ",
          "فَقُلْتَ لَا أَرَاهَا كَانَتْ إِلَّا مَعَ رَسُولِ اللَّهِ فَتَبَدَّى لَكَ الْمَلَكُ الَّذِي يُحَدِّثُهُ فَقَالَ كَذَبْتَ يَا عَبْدَ اللَّهِ رَأَتْ عَيْنَايَ الَّذِي حَدَّثَكَ بِهِ عَلِيٌّ وَ لَمْ تَرَهُ عَيْنَاهُ وَ لَكِنْ وَعَى قَلْبُهُ وَ وُقِرَ فِي سَمْعِهِ ثُمَّ صَفَقَكَ بِجَنَاحِهِ فَعَمِيتَ ",
          "قَالَ فَقَالَ ابْنُ عَبَّاسٍ مَا اخْتَلَفْنَا فِي شَيْ‏ءٍ فَحُكْمُهُ إِلَى اللَّهِ فَقُلْتُ لَهُ فَهَلْ حَكَمَ اللَّهُ فِي حُكْمٍ مِنْ حُكْمِهِ بِأَمْرَيْنِ قَالَ لَا فَقُلْتُ هَاهُنَا هَلَكْتَ وَ أَهْلَكْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘While my<sup>asws</sup> father<sup>asws</sup> was seated, and in his<sup>asws</sup> presence were a number (of people), when (suddenly) he<sup>asws</sup> laughed until his<sup>asws</sup> eyes filled up with tears. Then he<sup>asws</sup> said: ‘Do you know what made me<sup>asws</sup> laugh?’ So they said, ‘No’. He<sup>asws</sup> said: ‘Ibn Abbas is alleging that he is from <span class=\"ibTxt\"><a href=\"/#/books/quran:41#h30\">[41:30]</a> (As for) those who say: Our Lord is Allah, then are steadfast</span>’.",
            "So I<sup>asws</sup> said to him: ‘Have you (ever) seen the Angels, O Ibn Abbas, informing you of their Wilayah for you in the world and the Hereafter, along with the security from the fear and the grief?’ So he said, ‘Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:49#h10\">[49:10]</a> But rather, the Believers are brothers</span>, and the entirety of the community is included in this’. So I smiled, then I said, ‘You speak the truth, O Ibn Abbas! I<sup>asws</sup> hereby adjure you to Allah<sup>azwj</sup>, is there any differing in the Judgments of Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention? So he said, ‘No’. ",
            "So I<sup>asws</sup> said: ‘What is your view regarding a man who strikes a man’s fingers with the sword until they drop off, then he goes and another man comes over, so he cuts off his palm, so he comes with it to you, and you are a judge, how would you deal with it?’ He said, ‘I would say to this cutter to give him the wergild of his palm, and I would be saying to this cut one to reconcile with him upon whatever he so desires to, and send him to a just one (for arbitration)’. ",
            "I<sup>asws</sup> said, ‘(Then) there would have come a differing in the Judgments of Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mentioned, and you have broken the first words (of yours). Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, Refuses that something should occur among His<sup>azwj</sup> creatures, from the Legal Penalties and there isn’t its interpretation in the earth. Cut the palm of the cutter from its roots, then give him the wergild of the fingers. This is how Allah<sup>azwj</sup> Judged, the night in which His<sup>azwj</sup> Command descended. If you were to reject it after what you heard from Rasool-Allah<sup>saww</sup>, so Allah<sup>azwj</sup> would Enter you into the Fires just as He<sup>azwj</sup> Blinded your vision on the day you denied upon Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>’. ",
            "He said, ‘So it was due to that my vision was blinded? And what made you<sup>asws</sup> know that, for by Allah<sup>azwj</sup>, my vision was not blinded except from a flap of a wing of an Angel’. He<sup>asws</sup> said: ‘So I<sup>asws</sup> smiled, then left him on that day of his due to the absurdity of his intellect. ",
            "Then I<sup>asws</sup> met him, so I<sup>asws</sup> said: ‘O Ibn Abbas! You did not speak with truthfulness like what you did yesterday. Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> said to you: ‘The Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) is in every year, and it descends during that night with the Commands of the year, and for that Command are Master (Wali Al-Amr) after Rasool-Allah<sup>saww</sup>’. So you said: ‘Who are they?’ So he<sup>asws</sup> said: ‘I<sup>asws</sup> and eleven from my<sup>asws</sup> descendants, Imams<sup>asws</sup>, Muhaddisun’. ",
            "So you said, ‘I have not seen it as such except with Rasool-Allah<sup>saww</sup>’. So the Angel who used to narrate to him<sup>asws</sup>, appeared to you, and he said: ‘You lie, O Ibn Abbas! I saw with my eyes that which Ali<sup>asws</sup> narrated to you with’, and his (Ibn Abbas’s eyes did not see him, but his heart felt it, and it occurred in his hearing. Then he flapped you with his wing, so you were blinded’. ",
            "He<sup>asws</sup> said: ‘So Ibn Abbas said, ‘We are differing with regards to something, so its Judgment is to Allah<sup>azwj</sup>’. So I<sup>asws</sup> said to him: ‘So would Allah<sup>azwj</sup> Judge regarding a Judgment from His<sup>azwj</sup> Judgments with two Commands?’ He said, ‘No’. So I<sup>asws</sup> said: ‘Over here you perish and cause others to perish’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn abu ‘Abdallah and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad, both of them from al-Hassan ibn al-‘Abbas ibn al-Harish from abu Ja‘far al-Thani (a.s.) who has said the following. “Abu ‘Abdallah (a.s.) has said, ‘Once while my father was walking around the Ka‘ba for Tawaf a man who had covered his face partially with his turban suddenly came by. He caused discontinuation in the Tawaf of the Imam (a.s.) and took him (a.s.) to a house adjacent to al-Safa. He sent for me also and then we were there three of us. He said, “Welcome, the child of the Messenger of Allah. He then placed his hand over my head and said, ‘May Allah place blessings in you, the trustworthy one before Allah after his ancestors. O abu Ja‘far (a.s.), if you like you may tell me, and if you like I can tell you. If you like you may ask me and if you want I will ask you. If you would like affirm what I will say and if you would want I will affirm what you will say. The Imam (a.s.) said, “I like all of it.” He then said, “You must never let your tongue answer me with something that is otherwise in your conscious.” The Imam (a.s.) said, “Such would do one in whose heart there would exist two kinds of knowledge, one opposing the other. Allah, the Most Holy, the Most High, disdains to have a knowledge that is not harmonious.” He then said, “This is my question. You just explained one part of it. “Tell me about this knowledge that is so harmonious and without difference. Who has (knows) it?” The Imam (a.s.) said, “The whole of knowledge is before Allah, Majestic is Whose Name. The knowledge that people need is with the executor of the will of (prophets). The narrator has said that he then removed the covering from his face, set down straight, his face looked more cheerful and he said, “This is what I wanted and for this I have come. You think that the knowledge that is free of differences is with the executors of the wills of the prophets. How do they know it?” The Imam (a.s.) said, “Just as the Messenger of Allah knew it except that they do not see what the Messenger of Allah would see. It is because that he was a prophet and they are the Muhaddithun, spokesmen of the Divine message. The Messenger of Allah, when as a delegate before Allah, the Most Holy, the Most High, would hear whatever would have been communicated to him as (Wahy) but they do not hear such communications.” He then said, “You have spoken the truth, O child of the Messenger of Allah. I now ask you a more difficult question. Tell me, why does this knowledge not appear as was it with the Messenger of Allah?” The narrator has said that my father then smiled and said, “Allah, the Most Holy, the Most High, disdains to let those people have information about His knowledge whom He has not yet tested with faith. (Such test) was carried out on the Messenger of Allah in the form of his enduring the suffering caused to him from his people so much so that he would struggle against them with His permission. Many times he would withhold matters that would disappoint his people until he was commanded sternly to convey to them the commandments that he had received and disregard the pagans. “Preach what you have been commanded to and stay away from the pagans.” <a href=\"/#/books/quran:15#h94\">[15:94]</a> “I swear by Allah, had he conveyed the commandments he would have been perfectly safe. He, in fact, considered the obedience and feared differences. For this reason he would withhold. I would love that you would keep your eye upon the advent of al-Mahdi (the guide) of this nation. (A time) when the angels with the sword of the family of David would make the dead spirits of the unbelievers between the heavens and the earth test the results of their evil deeds and force the spirits of the living ones like them to join the unbelievers. “He then drew a sword and said, “Here it is. This is one of them.” The narrator has said, “Then my father said, “Yes, that is very true, I swear by the One Who chose Muhammad from among the mankind.” The narrator has said that then the man drew the cover over his face and said, “I am Ilyas. I did not ask you those questions about that because I did not know them. I only loved that this conversation and narration strengthen your followers. I will tell you about a sign and evidence that you know if they (your followers) would debate others, your friends will win. The narrator has said that my father then said to him, “If you would like I can tell you about it (the sign and evidence).” He then said, “I would wish to hear it from you.” The Imam (a.s.) said, “If our followers would say to those who differ from us, “Allah, the Most Holy, the Most High says to His Messenger, “We revealed the Quran on the Night of Destiny (<a href=\"/#/books/quran:97#h1\">[97:1]</a>. Would that you knew what the Night of Destiny is! <a href=\"/#/books/quran:97#h2\">[97:2]</a>. (Worship) on the Night of Destiny is better than (worship) for a thousand months <a href=\"/#/books/quran:97#h3\">[97:3]</a>. On this Night, the angels and the spirit descend by the permission of their Lord with His decree (to determine everyone’s destiny) <a href=\"/#/books/quran:97#h4\">[97:4]</a>. This Night is all peace until the break of dawn” <a href=\"/#/books/quran:97#h5\">[97:5]</a>. “Did the Messenger of Allah know of the knowledge of things that he did not know at that night or what Jibril would bring to him at other times? The opposition will say, “No, there was nothing the Messenger of Allah did not know.” Say to the opposition, “Was it necessary for the Messenger of Allah to express such knowledge?” The opposition will say, “No, it was not necessary.” Say to them, “Was there any difference and disharmony in the knowledge that the Messenger of Allah had received from Allah?” If the opposition would say, “No, there was no disharmony, “ ask them, “If one would judge by the laws of Allah with disharmony, has he opposed the Messenger of Allah?” They will say, “Yes, he has opposed the Messenger of Allah.” However, if they say, “No, he has not opposed the Messenger of Allah, they have invalidated their starting point”. Say to them, “No one knows its interpretation except Allah and those who are well-grounded in knowledge.” If they would ask, “Who are the ones well-grounded in knowledge?” Say, “They are those in whose knowledge there is no disharmony.” If they would ask, “Who is he?” Say, “the Messenger of Allah was such a person. Did he convey such knowledge to the first one (Khalifa)?” If they say, “Yes, the Messenger of Allah did convey.” Ask, “Did the Messenger of Allah die and the Khalifa after him had the knowledge free of disharmony ?” If they would say, “No, there was no such Khalifa with the knowledge free of disharmony.” Say, “(This is not logical.) The successor of the Messenger of Allah is supported (has the Divine support) and the Messenger of Allah does not appoint a Khalifa who would not judge by the laws of Allah. The Messenger of Allah will not appoint a Khalifa except one who is just like him, excluding prophet-hood. If the Messenger of Allah did not appoint a Khalifa in his knowledge anyone, he ( Allah forbid) caused to go astray the people of coming generations.” “If the opposition would say, “The knowledge of the Messenger of Allah was from the Holy Quran.” Say, “What about the following verses of the holy Quran that speak about the matters after the death of the Holy Prophet (s.a.), ‘I swear by the illustrious Book <a href=\"/#/books/quran:44#h2\">[44:2]</a> that We have revealed the Quran on a blessed night to warn mankind <a href=\"/#/books/quran:44#h3\">[44:3]</a>. On this night, every absolute command coming from Us becomes distinguishable <a href=\"/#/books/quran:44#h4\">[44:4]</a>. The command that We have been sending <a href=\"/#/books/quran:44#h5\">[44:5]</a> as a mercy (for the human being) from your Lord. . .’” <a href=\"/#/books/quran:44#h6\">[44:6]</a>. “If the opposition would say, “Allah, the Most Holy, the Most High, sends only prophets.” Say, “These distinguishable commands that come is from the angels and the spirit. They come from one heaven to the other. In the heavens there is no one to whom obedience and disobedience would apply.” “If the opposition would say, “They come from the heavens to earth and the people of earth are in dire need of such commands.” Say to them, “Is it necessary for them to have a leader who would judge among them?” If they say, “The Khalifa will judge for them.” Ask them about the meaning of the following verse of the Holy Quran. “God is the Guardian of the believers and it is He who takes them out of darkness into light. The Devil is the guardian of those who deny the Truth and he leads them from light to darkness. These are the dwellers of hell wherein they will live forever.” <a href=\"/#/books/quran:2#h257\">[2:257]</a> “I swear by my life that all those in the heavens and on earth who are under the guardian-ship of Allah, the Most Holy, the Most High, are supported (Divinely) and protected. Those who are supported and protected do not make mistakes. All the enemies of Allah, the Most Holy, the Most High, in the heavens and on earth suffer defeat. Those who are defeated they do not deal in a rightful way. Just as it is necessary that the command must come from the heavens for the people of earth in the same way it is necessary to have a Wali (one who possesses Divine authority).” “If the opposition would say, “We do not know such a person.” Say to them, “Say whatever you may like. Allah, the Most Holy, the Most High, disdains to leave, after Muhammad (s.a.) the servants without one who would possess Dinvine authority.” The narrator has said that he then stopped and said, “This, O child of the Messenger of Allah, is a delicate point. Consider if they would say, “The Holy Quran is the Divine authority.” The Imam (a.s.) said, “Then I will say, ‘The Holy Quran does not speak, issue commands and prohibitions. The people of Quran issue commands and prohibitions. I would further say, “Allah would disdain to see a certain affliction (difficult issue) would befall to the people of the earth, and there is no law about it in the Sunnah or a ruling free of differences and it is not in the Quran. He would disdain to have such thing in His knowledge to take place on earth and there would be nothing in His judgment to stop it from happening or the means to provide relief.” He then said, “Here you gain victory, O child of the Messenger of Allah. I testify that Allah, the Most Holy, the Most High, certainly knows what kinds of afflictions and sufferings may befall people of the earth in their lives and in their religion etc. He then set the Holy Quran as a guide.” The narrator has said that the man then said, “Do you, O child of the Messenger of Allah, know what kind of guide it is ?” Abu Ja‘far (a.s.) said said, “Yes, in it there are the general principles of laws and its interpretation when judgment would be issued. He said that Allah disdains to see His servant is afflicted with hardships in his religion, his life or his property and there would be no one on His earth whose judgment would decide truthfully and in the right way to remove the suffering.” The narrator has said that the man then said, “In this matter you have gained victory unless your enemies would falsely ascribe lies to Allah and say, ‘Allah, the Most Holy, the Most High, does not have anyone who would possess Divine authority.’ However, tell me about the interpretation of: “. . so that you would not grieve over what you have lost nor become extremely happy about what God has granted to you. . .” <a href=\"/#/books/quran:57#h23\">[57:23]</a> The Imam (a.s.) said, “It refers to abu so and so and his people. One of the verses is placed before and the other is placed afterwards (in two different places).” Grief over the loss applies to Amir al-Mu’minin Ali (a.s.) only’. “. . nor become extremely happy about what God has granted to you. .” refers to the mischief that you faced after the death of the Messenger of Allah. The man then said, “I testify that you are the Divine authorities in whose judgment there is no disharmony.” The man then stood up and went and I did not see him any more.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> سنده كما تقدم  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (74/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 643,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:41:3",
        "relations": {
          "Mentions": [
            "/books/quran:41:30",
            "/books/quran:44:4",
            "/books/quran:31:27",
            "/books/quran:49:10"
          ]
        },
        "text": [
          " قَالَ اللَّهُ عَزَّ وَ جَلَّ فِي لَيْلَةِ الْقَدْرِ فِيها يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ يَقُولُ يَنْزِلُ فِيهَا كُلُّ أَمْرٍ حَكِيمٍ وَ الْمُحْكَمُ لَيْسَ بِشَيْئَيْنِ إِنَّمَا هُوَ شَيْ‏ءٌ وَاحِدٌ فَمَنْ حَكَمَ بِمَا لَيْسَ فِيهِ اخْتِلَافٌ فَحُكْمُهُ مِنْ حُكْمِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ حَكَمَ بِأَمْرٍ فِيهِ اخْتِلَافٌ فَرَأَى أَنَّهُ مُصِيبٌ فَقَدْ حَكَمَ بِحُكْمِ الطَّاغُوتِ ",
          "إِنَّهُ لَيَنْزِلُ فِي لَيْلَةِ الْقَدْرِ إِلَى وَلِيِّ الْأَمْرِ تَفْسِيرُ الْأُمُورِ سَنَةً سَنَةً يُؤْمَرُ فِيهَا فِي أَمْرِ نَفْسِهِ بِكَذَا وَ كَذَا وَ فِي أَمْرِ النَّاسِ بِكَذَا وَ كَذَا وَ إِنَّهُ لَيَحْدُثُ لِوَلِيِّ الْأَمْرِ سِوَى ذَلِكَ كُلَّ يَوْمٍ عِلْمُ اللَّهِ عَزَّ وَ جَلَّ الْخَاصُّ وَ الْمَكْنُونُ الْعَجِيبُ الْمَخْزُونُ مِثْلُ مَا يَنْزِلُ فِي تِلْكَ اللَّيْلَةِ مِنَ الْأَمْرِ",
          "ثُمَّ قَرَأَ وَ لَوْ أَنَّ ما فِي الْأَرْضِ مِنْ شَجَرَةٍ أَقْلامٌ وَ الْبَحْرُ يَمُدُّهُ مِنْ بَعْدِهِ سَبْعَةُ أَبْحُرٍ ما نَفِدَتْ كَلِماتُ اللَّهِ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Said regarding the Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) <span class=\"ibTxt\"><a href=\"/#/books/quran:44#h4\">[44:4]</a> Therein every wise affair is made distinct</span>. He<sup>azwj</sup> is Saying that He<sup>azwj</sup> Sends down every wise affair during it, and the Decisive, it isn’t with two things, but rather it is one thing. So the one who judge with what there isn’t any differing, so his judgment is from the Judgments of Allah<sup>azwj</sup> Mighty and Majestic, and the one who judges by a matter wherein is a differing, and he views that it is correct, so he had judged with a judgment of the false god (Taghout)’. ",
            "It descends during the Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) to a Master of the Command<sup>asws</sup>, the explanation of the affairs of the year, (every) year. He<sup>asws</sup> is Commanded during it regarding the matter of his<sup>asws</sup> own self with such and such, and regarding the affairs of the people with such and such, and it comes anew for the Master of the Command<sup>asws</sup>, besides that every day, Knowledge of Allah<sup>azwj</sup> Mighty and Majestic, the Special, and the Concealed, the Wonderful, the Treasured similar to what descended during that Night, from the Commands’. ",
            "Then he<sup>asws</sup> recited <span class=\"ibTxt\"><a href=\"/#/books/quran:31#h27\">[31:27]</a> And were every tree that is in the earth pens and the sea (to supply it with ink), with seven more seas to increase it, the Words of Allah would not come to an end; surely Allah is Mighty, Wise</span>’."
          ],
          "en.sarwar": [
            " 2. (Through the same chain of narrators) it has been narrated from abu ‘Abdallah (a.s.) who has said the following. “Once, in a meeting in the presence of my father with a group of people also present my father smiled and (the feeling was quite intense it caused) tears flooded his eyes. He then asked, “Do you know what made me laugh?” The narrator has said that they said, “No, we do not know the reason.” The Imam (a.s.) said, “Ibn ‘Abbass thinks he is of the people mention in the following verse of the Holy Quran. “To those who have said, “God is our Lord, “ and who have remained steadfast to their belief, the angels will descend saying, “Do not be afraid or grieved. Receive the glad news of the Paradise which was promised to you.” <a href=\"/#/books/quran:41#h30\">[41:30]</a>. I asked him, “Have you seen the angels, O ibn ‘Abbass, telling you of the fact that they guard and protect you in this and the next world and provide you complete protection and security from fear and sadness?” The Imam (a.s.) then said that ibn ‘Abbass said, “Believers are each other’s brothers. . .” <a href=\"/#/books/quran:49#h10\">[49:10]</a> the whole community is included in this verse.” I then laughed.” Then I said, “O ibn ‘Abbass, you (perhaps) are right. However, I ask you to swear to Allah and answer me truthfully. Is there any disharmony in the judgment of Allah, Majestic is Whose mention?” He said, “No, there is no disharmony in His judgment.” “I then asked him, “How would judge the case in which a man strikes the fingers of another man with a sword until they fall. Then another man comes and cuts off his palm. He is brought to you and you are the judge. How would you then judge?” He said, “I will order the one who cut off the palm to pay compensation for the whole hand. I will ask the affected party to reach a settlement with the defendant and for this purpose I send them to the people of justice (arbitrator).” I said, “(In your judgment) disharmony has come in the laws of Allah, Majestic is Whose mention, thus, you invalidated what you said before (that there is no disharmony in the laws and judgment of Allah). Allah, Majestic is Whose mention, disdains to let a judicial case remain on earth without a clarified rule. You must order, as a judge, to cut the palm of the defendant totally and pay compensation for the fingers. Thus, is the judgment of Allah at the night wherein His orders descend. If you would reject after hearing from the Messenger of Allah then Allah will send you to fire just as He blinded you on the day you hid the (truth) in favor of Ali ibn abu Talib (a.s.).” Ibn ‘Abbass then said, “Is that why my eyes have become blind?” He further said, “How would you know that? I swear by Allah that my eyes turned blind only because of the flapping of the wing of the angel.” The Imam (a.s.) said, “That made me laugh. I left him that day because of the silliness (dark and dullness) in his intellect and reason. I then met him latter and said to him, “O ibn ‘Abbass, you have not spoken as true as you did yesterday. Ali ibn abu Talib (a.s.) told you that the Night of Determination comes every year. On that night the command for the whole year comes down. For that matter and command is the people with Divine authority after the Messenger of Allah. You then asked, “Who are these people?” He (Ali (a.s.) said, “I myself and the eleven men from my descendents will be the Imams (leaders with divine authority) and the (people to whom angels speak) Muhaddathun.” You then said, “I do not see it (Night of Determination) except with the Messenger of Allah. Then the angel appeared to you; the angels that was speaking to him and said, “O ‘Abdallah, you have lied. My eyes see it (the Night of Determination).of which Ali (a.s.) spoke to you. His (Ali’s ) eyes did not see him (the angel) but his heart understood (the presence of the angel) and he impacted his ears. Then he (angel) flapped you with his wing and you turned blind.” Ibn ‘Abbass then said, “In the matters that we dispute it is up to Allah to judge.” I then said to him, “Has Allah judged one case with two judgments?” He replied, “No, Allah has not done so.” I then said, “Here you perish and cause others to perish.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> السند كما مر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (78/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 644,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:41:4",
        "relations": {
          "Mentions": [
            "/books/quran:8:25",
            "/books/quran:44:4",
            "/books/quran:31:27",
            "/books/quran:97:3",
            "/books/quran:3:144",
            "/books/quran:97:4",
            "/books/quran:97:5",
            "/books/quran:97:1"
          ]
        },
        "text": [
          " كَانَ عَلِيُّ بْنُ الْحُسَيْنِ صَلَوَاتُ اللَّهِ عَلَيْهِ يَقُولُ إِنَّا أَنْزَلْناهُ فِي لَيْلَةِ الْقَدْرِ صَدَقَ اللَّهُ عَزَّ وَ جَلَّ أَنْزَلَ اللَّهُ الْقُرْآنَ فِي لَيْلَةِ الْقَدْرِ وَ ما أَدْراكَ ما لَيْلَةُ الْقَدْرِ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا أَدْرِي قَالَ اللَّهُ عَزَّ وَ جَلَّ لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ لَيْسَ فِيهَا لَيْلَةُ الْقَدْرِ ",
          "قَالَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ هَلْ تَدْرِي لِمَ هِيَ خَيْرٌ مِنْ أَلْفِ شَهْرٍ قَالَ لَا قَالَ لِأَنَّهَا تَنَزَّلُ فِيهَا الْمَلائِكَةُ وَ الرُّوحُ بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ وَ إِذَا أَذِنَ اللَّهُ عَزَّ وَ جَلَّ بِشَيْ‏ءٍ فَقَدْ رَضِيَهُ سَلامٌ هِيَ حَتَّى مَطْلَعِ الْفَجْرِ يَقُولُ تُسَلِّمُ عَلَيْكَ يَا مُحَمَّدُ مَلَائِكَتِي وَ رُوحِي بِسَلَامِي مِنْ أَوَّلِ مَا يَهْبِطُونَ إِلَى مَطْلَعِ الْفَجْرِ ",
          "ثُمَّ قَالَ فِي بَعْضِ كِتَابِهِ وَ اتَّقُوا فِتْنَةً لا تُصِيبَنَّ الَّذِينَ ظَلَمُوا مِنْكُمْ خَاصَّةً فِي إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ",
          "وَ قَالَ فِي بَعْضِ كِتَابِهِ وَ ما مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَ فَإِنْ ماتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلى أَعْقابِكُمْ وَ مَنْ يَنْقَلِبْ عَلى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئاً وَ سَيَجْزِي اللَّهُ الشَّاكِرِينَ",
          "يَقُولُ فِي الْآيَةِ الْأُولَى إِنَّ مُحَمَّداً حِينَ يَمُوتُ يَقُولُ أَهْلُ الْخِلَافِ لِأَمْرِ اللَّهِ عَزَّ وَ جَلَّ مَضَتْ لَيْلَةُ الْقَدْرِ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَهَذِهِ فِتْنَةٌ أَصَابَتْهُمْ خَاصَّةً وَ بِهَا ارْتَدُّوا عَلَى أَعْقَابِهِمْ لِأَنَّهُمْ إِنْ قَالُوا لَمْ تَذْهَبْ فَلَا بُدَّ أَنْ يَكُونَ لِلَّهِ عَزَّ وَ جَلَّ فِيهَا أَمْرٌ وَ إِذَا أَقَرُّوا بِالْأَمْرِ لَمْ يَكُنْ لَهُ مِنْ صَاحِبٍ بُدٌّ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "(It has been narrated) ‘from Abu Abdullah<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was saying <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h1\">[97:1]</a> We have indeed revealed this in the Night of Pre-determination</span>. Allah<sup>azwj</sup> Mighty and Majestic Spoke the Truth. Allah<sup>azwj</sup> Revealed the Quran during the Night of the Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h3\">[97:3]</a> The Night of Pre-determination is better than a thousand months</span> wherein there is no Night of Pre-determination.",
            "He<sup>azwj</sup> asked Rasool-Allah<sup>saww</sup>: “Do you<sup>saww</sup> know why it is better than a thousand months?” He<sup>saww</sup> said: ‘Because <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h4\">[97:4]</a> Therein come down the angels and the Spirit by Allah's Permission from every affair</span>; and when Allah<sup>azwj</sup> Mighty and Majestic Permits for something, so it has Pleased Him<sup>azwj</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h5\">[97:5]</a> Peace! Such it is till the break of the morning</span>. He<sup>azwj</sup> is Saying: “They are submitting upon you<sup>saww</sup>, O Muhammad<sup>saww</sup>, My<sup>azwj</sup> Angels and My<sup>azwj</sup> Spirit with My<sup>azwj</sup> Greetings, from the beginning of what they are descending up to the emergence of the dawn’. ",
            "Then He<sup>azwj</sup> Said in (another) part of His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:8#h25\">[8:25]</a> And fear a strife which may not smite (only) those of you in particular who are unjust</span>, in particular regarding <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h1\">[97:1]</a> We have indeed revealed this in the Night of Predestination</span>.",
            "And He<sup>azwj</sup> Said in (another) part of His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h144\">[3:144]</a> And what is Muhammad except for a Rasool; the Rasools have already passed away before him; if then he dies or is killed will you turn back upon your heels? And whoever turns back upon his heels, he will by no means do harm to Allah in the least and Allah will Reward the grateful</span>.",
            "He<sup>azwj</sup> is Saying in the first Verse that Muhammad<sup>saww</sup>, when he<sup>saww</sup> passes away, the people of the opposition to the Command of Allah<sup>azwj</sup> Mighty and Majestic would be saying, ‘The Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) expired along with Rasool-Allah<sup>saww</sup>’. So this is a strife hitting them in particular, and by it they are turning back upon their heels because they, if they were to say, ‘It (<span class=\"iTxt\">Laylat Al-Qadr</span>) did not go away, so it would be inevitable that there would happen to be for Allah<sup>azwj</sup> Mighty and Majestic a Command during it, and when they acknowledge with the Command, there cannot happen to be an escape from there being a Master<sup>asws</sup> for it’."
          ],
          "en.sarwar": [
            " 3. Through the same chain of narrators it is narrated from abu Ja‘far (a.s.) who has said the following. “Allah, the Most Holy, the Most High, has said about the Night of Determination, “. . every absolute command coming from Us becomes distinguishable.” <a href=\"/#/books/quran:44#h4\">[44:4]</a> He has said that absolute and strong command. Absolute and strong command is not two things. It is only one thing. One who judges without disharmony and differences his judgment is of the judgment of Allah, the Most Holy, the Most High. Whoever would judge in disharmonious manner with differences and considers it as the rightful way of judging he has judged with the judgment of the devil. It is certain that on the Night of Determination the explanation and clarification of all issues of the year comes to the man who possesses Divine authority. On that Night the Wali al-’Amr (the man who possesses Divine authority) receives commands about his self for so and so, and about the affairs of the people in so and so. It also is certain that for the man with Divine authority, besides this, every year, there comes the knowledge of Allah, the Most Holy, the Most High. (There comes to him) the exclusive knowledge, the hidden, the wonderful and the treasured knowledge of Allah. It comes just in the Night of Determination comes the command. Then he recited. “If all the trees in the earth were pens and the ocean, with seven more oceans, were ink still these could not suffice to record all the Words of God. God is Majestic and All-wise.” <a href=\"/#/books/quran:31#h27\">[31:27]</a>."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> (  3  )  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/80)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 645,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/732",
              "text": "عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:41:5",
        "relations": {
          "Mentions": [
            "/books/quran:8:25",
            "/books/quran:97:2",
            "/books/quran:97:3",
            "/books/quran:3:144",
            "/books/quran:97:4",
            "/books/quran:97:5",
            "/books/quran:97:1"
          ]
        },
        "text": [
          " كَانَ عَلِيٌّ ( عليه السلام ) كَثِيراً مَا يَقُولُ مَا اجْتَمَعَ التَّيْمِيُّ وَ الْعَدَوِيُّ عِنْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ يَقْرَأُ إِنَّا أَنْزَلْنَاهُ بِتَخَشُّعٍ وَ بُكَاءٍ فَيَقُولَانِ مَا أَشَدَّ رِقَّتَكَ لِهَذِهِ السُّورَةِ ",
          "فَيَقُولُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِمَا رَأَتْ عَيْنِي وَ وَعَى قَلْبِي وَ لِمَا يَرَى قَلْبُ هَذَا مِنْ بَعْدِي فَيَقُولَانِ وَ مَا الَّذِي رَأَيْتَ وَ مَا الَّذِي يَرَى قَالَ فَيَكْتُبُ لَهُمَا فِي التُّرَابِ تَنَزَّلُ الْمَلائِكَةُ وَ الرُّوحُ فِيها بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ ",
          "قَالَ ثُمَّ يَقُولُ هَلْ بَقِيَ شَيْ‏ءٌ بَعْدَ قَوْلِهِ عَزَّ وَ جَلَّ كُلِّ أَمْرٍ فَيَقُولَانِ لَا فَيَقُولُ هَلْ تَعْلَمَانِ مَنِ الْمُنْزَلُ إِلَيْهِ بِذَلِكَ فَيَقُولَانِ أَنْتَ يَا رَسُولَ اللَّهِ فَيَقُولُ نَعَمْ ",
          "فَيَقُولُ هَلْ تَكُونُ لَيْلَةُ الْقَدْرِ مِنْ بَعْدِي فَيَقُولَانِ نَعَمْ قَالَ فَيَقُولُ فَهَلْ يَنْزِلُ ذَلِكَ الْأَمْرُ فِيهَا فَيَقُولَانِ نَعَمْ قَالَ فَيَقُولُ إِلَى مَنْ فَيَقُولَانِ لَا نَدْرِي فَيَأْخُذُ بِرَأْسِي وَ يَقُولُ إِنْ لَمْ تَدْرِيَا فَادْرِيَا هُوَ هَذَا مِنْ بَعْدِي ",
          "قَالَ فَإِنْ كَانَا لَيَعْرِفَانِ تِلْكَ اللَّيْلَةَ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنْ شِدَّةِ مَا يُدَاخِلُهُمَا مِنَ الرُّعْبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was so that Ali<sup>asws</sup> was frequently saying: ‘There would not gather (from the Clan of) Al-Taymi (Abu Bakr) and (from the Clan of) Al-Adwy (Umar) in the presence of Rasool-Allah<sup>saww</sup> and he<sup>saww</sup> recited <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h1\">[97:1]</a> We have indeed revealed this</span> Chapter 97) with humbleness and crying, so they would both be saying: ‘How intense is your<sup>as</sup> soft-heartedness for this Chapter!’",
            "So Rasool-Allah<sup>saww</sup> was saying: ‘(It is) due to what my eyes see, and my<sup>saww</sup> heart feels, and due to what the heart of this one<sup>asws</sup> would see from after me<sup>saww</sup>’. So they were both saying, ‘What is that which your<sup>saww</sup> heart is seeing, and what is that which his<sup>asws</sup> heart would see?’ He<sup>asws</sup> said: ‘So he<sup>saww</sup> wrote for them both in the sand <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h4\">[97:4]</a> Therein come down the angels and the Spirit by Allah's permission, on every affair</span>’.",
            "He<sup>asws</sup> said: ‘Then he<sup>saww</sup> was saying: ‘Does there remain anything after His<sup>azwj</sup> Words <span class=\"ibTxt\">every affair</span>?’ So they were both saying, ‘No’. So he<sup>saww</sup> was saying: ‘Do you two know who they descend upon with that?’ So they were saying, ‘You<sup>saww</sup>, O Rasool-Allah<sup>saww</sup>!’. So he<sup>saww</sup> was saying: ‘Yes’. ",
            "So he<sup>saww</sup> was saying: ‘Would there happen to be a Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) (to come) after me<sup>saww</sup>?’ So they both were saying, ‘Yes’. So he<sup>saww</sup> was saying: ‘So would that affair be descending during it?’ So they were saying, ‘Yes’. So he<sup>saww</sup> was saying: ‘Unto whom?’ So they were saying, ‘We don’t know’. So he<sup>saww</sup> grabbed my<sup>asws</sup> head and he<sup>saww</sup> was saying: ‘If you don’t know, so know, it is this one<sup>asws</sup>, from after me<sup>saww</sup>’. ",
            "He<sup>asws</sup> said: ‘So it was such that they both (the two from the Clans of Taymi and Adwy) recognised that night (<span class=\"iTxt\">Laylat Al-Qadr</span>) from the intensity of what entered into them from the awe’."
          ],
          "en.sarwar": [
            " 4. Through the same chain of narrators it is narrated from abu ‘Abdallah (a.s.) who has said the following. “Imam Ali ibn al-Husayn (a.s.) would say, “We revealed the Quran on the Night of Destiny (<a href=\"/#/books/quran:97#h1\">[97:1]</a> Allah, the Most Holy, the Most High, has certainly said the truth has reveal the Holy Quran on the Night of Determination. “Would that you knew what the Night of Destiny is! <a href=\"/#/books/quran:97#h2\">[97:2]</a>” the Messenger of Allah said, “I do not know.” Allah, the Most Holy, the Most High, said, “(Worship) on the Night of Destiny is better than (worship) for a thousand months (that are other than the Night of Determinatio).” <a href=\"/#/books/quran:97#h3\">[97:3]</a> He asked the Messenger of Allah, “Do you know why it is better than a thousand nights?” the Messenger of Allah said, “No, I do not know.” He said, “It is because on that Night the angels and the Spirit come down by the permission of their Lord for all matters. When Allah, the Most Holy, the Most High, would grant permission for a matter it means that He has agreed.” “This Night is all peace until the break of dawn.” <a href=\"/#/books/quran:97#h5\">[97:5]</a> He says, “O Muhammad, My angels salute you and My spirit with peaceful greetings from beginning of the time they come down until dawn of that night. Then He has said in another part of His book, “Guard yourselves against discord among yourselves so that it will not mislead anyone of you, especially the unjust, and know that God’s retribution is most severe.” <a href=\"/#/books/quran:8#h25\">[8:25]</a> It is about the Night of Determination. He has also said in His book, “Muhammad is only a Messenger. There lived other Messengers before him. Should (Muhammad) die or be slain, would you then turn back to your pre-Islamic behavior? Whoever does so can cause no harm to God. God will reward those who give thanks.” <a href=\"/#/books/quran:3#h144\">[3:144]</a> In the verse He has said that when Muhammad will die the opposition to the command of Allah, the Most Holy, the Most High, will say , “The Night of Determination has gone along with the Messenger of Allah.” This is the first clamity that has befallen them exclusively. With this they returned back to their old ways. Had they not said so, it would have been necessary to believe that Allah, the Most Holy, the Most High, has His commands on that Night. Once they would affirm and acknowledge the command (delegation of Divine authority) it would have become necessary to believe in the existence of the man who possesses Divine authority.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مثل السند السابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/86)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 646,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/733",
              "text": "عَنْ أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:41:6",
        "relations": {
          "Mentions": [
            "/books/quran:44:2",
            "/books/quran:35:24",
            "/books/quran:44:1",
            "/books/quran:97:4",
            "/books/quran:97:1",
            "/books/quran:44:3"
          ]
        },
        "text": [
          " يَا مَعْشَرَ الشِّيعَةِ خَاصِمُوا بِسُورَةِ إِنَّا أَنْزَلْنَاهُ تَفْلُجُوا فَوَ اللَّهِ إِنَّهَا لَحُجَّةُ اللَّهِ تَبَارَكَ وَ تَعَالَى عَلَى الْخَلْقِ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِنَّهَا لَسَيِّدَةُ دِينِكُمْ وَ إِنَّهَا لَغَايَةُ عِلْمِنَا",
          "يَا مَعْشَرَ الشِّيعَةِ خَاصِمُوا بِ حم وَ الْكِتابِ الْمُبِينِ إِنَّا أَنْزَلْناهُ فِي لَيْلَةٍ مُبارَكَةٍ إِنَّا كُنَّا مُنْذِرِينَ فَإِنَّهَا لِوُلَاةِ الْأَمْرِ خَاصَّةً بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله )",
          "يَا مَعْشَرَ الشِّيعَةِ يَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى وَ إِنْ مِنْ أُمَّةٍ إِلَّا خَلا فِيها نَذِيرٌ قِيلَ يَا أَبَا جَعْفَرٍ نَذِيرُهَا مُحَمَّدٌ ( صلى الله عليه وآله ) قَالَ صَدَقْتَ فَهَلْ كَانَ نَذِيرٌ وَ هُوَ حَيٌّ مِنَ الْبِعْثَةِ فِي أَقْطَارِ الْأَرْضِ فَقَالَ السَّائِلُ لَا قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) أَ رَأَيْتَ بَعِيثَهُ أَ لَيْسَ نَذِيرَهُ كَمَا أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فِي بِعْثَتِهِ مِنَ اللَّهِ عَزَّ وَ جَلَّ نَذِيرٌ فَقَالَ بَلَى قَالَ فَكَذَلِكَ لَمْ يَمُتْ مُحَمَّدٌ إِلَّا وَ لَهُ بَعِيثٌ نَذِيرٌ ",
          "قَالَ فَإِنْ قُلْتُ لَا فَقَدْ ضَيَّعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ فِي أَصْلَابِ الرِّجَالِ مِنْ أُمَّتِهِ قَالَ وَ مَا يَكْفِيهِمُ الْقُرْآنُ قَالَ بَلَى إِنْ وَجَدُوا لَهُ مُفَسِّراً قَالَ وَ مَا فَسَّرَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ بَلَى قَدْ فَسَّرَهُ لِرَجُلٍ وَاحِدٍ وَ فَسَّرَ لِلْأُمَّةِ شَأْنَ ذَلِكَ الرَّجُلِ وَ هُوَ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) ",
          "قَالَ السَّائِلُ يَا أَبَا جَعْفَرٍ كَانَ هَذَا أَمْرٌ خَاصٌّ لَا يَحْتَمِلُهُ الْعَامَّةُ قَالَ أَبَى اللَّهُ أَنْ يُعْبَدَ إِلَّا سِرّاً حَتَّى يَأْتِيَ إِبَّانُ أَجَلِهِ الَّذِي يَظْهَرُ فِيهِ دِينُهُ كَمَا أَنَّهُ كَانَ رَسُولُ اللَّهِ مَعَ خَدِيجَةَ مُسْتَتِراً حَتَّى أُمِرَ بِالْإِعْلَانِ ",
          "قَالَ السَّائِلُ يَنْبَغِي لِصَاحِبِ هَذَا الدِّينِ أَنْ يَكْتُمَ قَالَ أَ وَ مَا كَتَمَ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) يَوْمَ أَسْلَمَ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) حَتَّى ظَهَرَ أَمْرُهُ قَالَ بَلَى قَالَ فَكَذَلِكَ أَمْرُنَا حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from Abu Ja’far<sup>asws</sup> having said: ‘O group of the Shias! Argue by (utilising) the Chapter <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h1\">[97:1]</a> We have indeed revealed this</span>, you would be winning, for by Allah<sup>azwj</sup>, it is a Proof of Allah<sup>azwj</sup> Blessed and High upon the creatures, after Rasool-Allah<sup>saww</sup>, and it is a Chief of your Religion, and it is a peak of our<sup>asws</sup> teachings. ",
            "O group of the Shias! Argue by (utilizing) <span class=\"ibTxt\"><a href=\"/#/books/quran:44#h1\">[44:1]</a> Ha Mim! <a href=\"/#/books/quran:44#h2\">[44:2]</a> I swear by the Clarifying Book <a href=\"/#/books/quran:44#h3\">[44:3]</a> Surely We Revealed it on a Blessed Night surely We are ever Warning</span>, for these are for the Masters<sup>asws</sup> of the Command (Wali Al-Amr) in particular after Rasool-Allah<sup>saww</sup>.",
            "O group of the Shias! Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:35#h24\">[35:24]</a> and there is not a community but a warner has gone among them</span>’. It was said, ‘O Abu Ja’far<sup>asws</sup>! It – the warner is Muhammad<sup>saww</sup>’. He<sup>asws</sup> said: ‘You speak the truth. So was there a warner from the Sent ones in the horizons of the earth while he<sup>saww</sup> was alive?’ So the questioner said, ‘No’. Abu Ja’far<sup>asws</sup> said: ‘What is your view, had He<sup>azwj</sup> Sent him, wouldn’t he be His<sup>azwj</sup> warner just as Rasool-Allah<sup>saww</sup> was during His<sup>azwj</sup> Sending from Allah<sup>azwj</sup> Mighty and Majestic as a warner?’ So he said, ‘Yes’. He<sup>asws</sup> said: ‘Similar to that, Muhammad<sup>saww</sup> did not pass away except that there was for him<sup>saww</sup>, a Sent warner’. ",
            "He<sup>asws</sup> said: ‘Supposing I<sup>asws</sup> were to say ‘no’, so Rasool-Allah<sup>saww</sup> would have wasted the ones in the loins of the men from his<sup>saww</sup> community’ (Muslims to be born until the Hereafter). He said, ‘And the Quran does not suffice them?’ He<sup>asws</sup> said: ‘Yes (it would), if they were to find an interpreter for it’. He said, ‘And didn’t Rasool-Allah<sup>saww</sup> interpret it?’ He<sup>asws</sup> said: ‘Yes, he<sup>saww</sup> had interpreted it to one man, and he<sup>saww</sup> explained the glory of that man to the community, and he is Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>’. ",
            "The questioner said, ‘O Abu Ja’far<sup>asws</sup>! This was a special matter, the generality (of the people) do not carry it’. He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Refused that He<sup>azwj</sup> be worshipped except for secretly until there came the period during which His<sup>azwj</sup> Religion could be Manifested, just as it as concealed when Rasool-Allah<sup>saww</sup> was with Syeda Khadeeja<sup>as</sup> until he<sup>saww</sup> was Commanded with the proclamation’. ",
            "The questioner said, ‘Is it befitting for the Master of this Religion that he<sup>asws</sup> conceals?’. He<sup>asws</sup> said: ‘Or did not Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> conceal the day he<sup>asws</sup> professed Islam along with Rasool-Allah<sup>saww</sup> until his<sup>saww</sup> matter was manifested?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘Similar to that is our<sup>asws</sup> matter, until the prescribed term comes up’."
          ],
          "en.sarwar": [
            " 5. Through the same chain of narrators it is narrated from abu Ja‘far (a.s.) who has said the following. “Ali (a.s.) would say very often, “(What for) al-Taymies and al-‘Adawies have gathered around the Messenger of Allah (s.a.). He, the Messenger of Allah, would read, “We have revealed it on the Night of Determination” very humbly and tearfully. They (al-Taymi and al-‘Adwi) would say, “How intense is the tenderness that this chapter causes to your heart.” The Messenger of Allah would say, “It is because what my eyes see and my heart has stored and for what the heart of this (Ali (a.s.) will experience after me.” They would ask, “What is it that you have seen and what is it that he will experience?” The narrator has said that he would write for the two on the soil, “On this Night, the angels and the spirit descend by the permission of their Lord with His decree (to determine everyone’s destiny).” <a href=\"/#/books/quran:97#h4\">[97:4]</a> The narrator has said that he, the Messenger of Allah would say, “Has anything else left (untold) after of Allah, the Most Holy, the Most High, All matters?” The two would say, “No, nothing is left untold.” He then would ask them, “Do you know to who it will be revealed?” The two would say, “To you, O the Messenger of Allah.” He then would say, “Will there be the Night of Determination after me?” The two would say, “Yes, there will be that night.” He then would ask, “To who (the angels and the Spirit will come)?” The two would say, “We do not know.” He then would hold my head and say, “If the two of you do not know now you must know, he is this after me.” The narrator has said that it is certain that the two would know that night, after the Messenger of Allah, because of the sever apprehension that they would go through.”"
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 647,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/733",
              "text": "عَنْ أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:41:7",
        "relations": {
          "Mentions": [
            "/books/quran:44:2",
            "/books/quran:35:24",
            "/books/quran:24:55",
            "/books/quran:97:1",
            "/books/quran:44:3"
          ]
        },
        "text": [
          " لَقَدْ خَلَقَ اللَّهُ جَلَّ ذِكْرُهُ لَيْلَةَ الْقَدْرِ أَوَّلَ مَا خَلَقَ الدُّنْيَا وَ لَقَدْ خَلَقَ فِيهَا أَوَّلَ نَبِيٍّ يَكُونُ وَ أَوَّلَ وَصِيٍّ يَكُونُ وَ لَقَدْ قَضَى أَنْ يَكُونَ فِي كُلِّ سَنَةٍ لَيْلَةٌ يَهْبِطُ فِيهَا بِتَفْسِيرِ الْأُمُورِ إِلَى مِثْلِهَا مِنَ السَّنَةِ الْمُقْبِلَةِ",
          "مَنْ جَحَدَ ذَلِكَ فَقَدْ رَدَّ عَلَى اللَّهِ عَزَّ وَ جَلَّ عِلْمَهُ لِأَنَّهُ لَا يَقُومُ الْأَنْبِيَاءُ وَ الرُّسُلُ وَ الْمُحَدَّثُونَ إِلَّا أَنْ تَكُونَ عَلَيْهِمْ حُجَّةٌ بِمَا يَأْتِيهِمْ فِي تِلْكَ اللَّيْلَةِ مَعَ الْحُجَّةِ الَّتِي يَأْتِيهِمْ بِهَا جَبْرَئِيلُ ( عليه السلام ) ",
          "قُلْتُ وَ الْمُحَدَّثُونَ أَيْضاً يَأْتِيهِمْ جَبْرَئِيلُ أَوْ غَيْرُهُ مِنَ الْمَلَائِكَةِ ( عليه السلام ) قَالَ أَمَّا الْأَنْبِيَاءُ وَ الرُّسُلُ صَلَّى اللَّهُ عَلَيْهِمْ فَلَا شَكَّ وَ لَا بُدَّ لِمَنْ سِوَاهُمْ مِنْ أَوَّلِ يَوْمٍ خُلِقَتْ فِيهِ الْأَرْضُ إِلَى آخِرِ فَنَاءِ الدُّنْيَا أَنْ تَكُونَ عَلَى أَهْلِ الْأَرْضِ حُجَّةٌ يَنْزِلُ ذَلِكَ فِي تِلْكَ اللَّيْلَةِ إِلَى مَنْ أَحَبَّ مِنْ عِبَادِهِ",
          "وَ ايْمُ اللَّهِ لَقَدْ نَزَلَ الرُّوحُ وَ الْمَلَائِكَةُ بِالْأَمْرِ فِي لَيْلَةِ الْقَدْرِ عَلَى آدَمَ وَ ايْمُ اللَّهِ مَا مَاتَ آدَمُ إِلَّا وَ لَهُ وَصِيٌّ وَ كُلُّ مَنْ بَعْدَ آدَمَ مِنَ الْأَنْبِيَاءِ قَدْ أَتَاهُ الْأَمْرُ فِيهَا وَ وَضَعَ لِوَصِيِّهِ مِنْ بَعْدِهِ وَ ايْمُ اللَّهِ إِنْ كَانَ النَّبِيُّ لَيُؤْمَرُ فِيمَا يَأْتِيهِ مِنَ الْأَمْرِ فِي تِلْكَ اللَّيْلَةِ مِنْ آدَمَ إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) أَنْ أَوْصِ إِلَى فُلَانٍ",
          "وَ لَقَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ فِي كِتَابِهِ لِوُلَاةِ الْأَمْرِ مِنْ بَعْدِ مُحَمَّدٍ ( صلى الله عليه وآله ) خَاصَّةً وَعَدَ اللَّهُ الَّذِينَ آمَنُوا مِنْكُمْ وَ عَمِلُوا الصَّالِحاتِ لَيَسْتَخْلِفَنَّهُمْ فِي الْأَرْضِ كَمَا اسْتَخْلَفَ الَّذِينَ مِنْ قَبْلِهِمْ إِلَى قَوْلِهِ فَأُولئِكَ هُمُ الْفاسِقُونَ",
          "يَقُولُ أَسْتَخْلِفُكُمْ لِعِلْمِي وَ دِينِي وَ عِبَادَتِي بَعْدَ نَبِيِّكُمْ كَمَا اسْتَخْلَفَ وُصَاةَ آدَمَ مِنْ بَعْدِهِ حَتَّى يَبْعَثَ النَّبِيَّ الَّذِي يَلِيهِ يَعْبُدُونَنِي لا يُشْرِكُونَ بِي شَيْئاً يَقُولُ يَعْبُدُونَنِي بِإِيمَانٍ لَا نَبِيَّ بَعْدَ مُحَمَّدٍ ( صلى الله عليه وآله ) فَمَنْ قَالَ غَيْرَ ذَلِكَ فَأُولئِكَ هُمُ الْفاسِقُونَ",
          "فَقَدْ مَكَّنَ وُلَاةَ الْأَمْرِ بَعْدَ مُحَمَّدٍ بِالْعِلْمِ وَ نَحْنُ هُمْ فَاسْأَلُونَا فَإِنْ صَدَقْنَاكُمْ فَأَقِرُّوا وَ مَا أَنْتُمْ بِفَاعِلِينَ أَمَّا عِلْمُنَا فَظَاهِرٌ وَ أَمَّا إِبَّانُ أَجَلِنَا الَّذِي يَظْهَرُ فِيهِ الدِّينُ مِنَّا حَتَّى لَا يَكُونَ بَيْنَ النَّاسِ اخْتِلَافٌ فَإِنَّ لَهُ أَجَلًا مِنْ مَمَرِّ اللَّيَالِي وَ الْأَيَّامِ إِذَا أَتَى ظَهَرَ وَ كَانَ الْأَمْرُ وَاحِداً",
          "وَ ايْمُ اللَّهِ لَقَدْ قُضِيَ الْأَمْرُ أَنْ لَا يَكُونَ بَيْنَ الْمُؤْمِنِينَ اخْتِلَافٌ وَ لِذَلِكَ جَعَلَهُمْ شُهَدَاءَ عَلَى النَّاسِ لِيَشْهَدَ مُحَمَّدٌ ( صلى الله عليه وآله ) عَلَيْنَا وَ لِنَشْهَدَ عَلَى شِيعَتِنَا وَ لِتَشْهَدَ شِيعَتُنَا عَلَى النَّاسِ أَبَى اللَّهُ عَزَّ وَ جَلَّ أَنْ يَكُونَ فِي حُكْمِهِ اخْتِلَافٌ أَوْ بَيْنَ أَهْلِ عِلْمِهِ تَنَاقُضٌ",
          "ثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَضْلُ إِيمَانِ الْمُؤْمِنِ بِجُمْلَةِ إِنَّا أَنْزَلْنَاهُ وَ بِتَفْسِيرِهَا عَلَى مَنْ لَيْسَ مِثْلَهُ فِي الْإِيمَانِ بِهَا كَفَضْلِ الْإِنْسَانِ عَلَى الْبَهَائِمِ وَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَيَدْفَعُ بِالْمُؤْمِنِينَ بِهَا عَنِ الْجَاحِدِينَ لَهَا فِي الدُّنْيَا لِكَمَالِ عَذَابِ الْآخِرَةِ لِمَنْ عَلِمَ أَنَّهُ لَا يَتُوبُ مِنْهُمْ مَا يَدْفَعُ بِالْمُجَاهِدِينَ عَنِ الْقَاعِدِينَ وَ لَا أَعْلَمُ أَنَّ فِي هَذَا الزَّمَانِ جِهَاداً إِلَّا الْحَجَّ وَ الْعُمْرَةَ وَ الْجِوَارَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> had Created the Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) before having Created the world, and Had Created regarding it the first Prophet<sup>as</sup> and the first successor<sup>as</sup> who would happen to be, and had Ordained that there would happen to be a night during every year in which would descend the interpretation of the affairs up to its like from the next year. ",
            "The one who rejects that so he has rebutted against Allah<sup>azwj</sup> Mighty and Majestic of His<sup>azwj</sup> Knowledge, because the Prophets<sup>as</sup> and the Rasools<sup>as</sup> and the <span class=\"iTxt\">Muhaddisoun</span><sup>asws</sup> cannot be standing except if there happens to be an argument upon them<sup>asws</sup> with what is Given to them<sup>asws</sup> during that Night along with the Authority which Jibraeel<sup>as</sup> comes with to them<sup>asws</sup>’.",
            "I said, ‘And the <span class=\"iTxt\">Muhaddisoun</span> as well, Does Jibraeel<sup>as</sup> comes to them or someone else from the Angels?’ He<sup>asws</sup> said: ‘As for the Prophets<sup>as</sup> and the Rasools<sup>as</sup>, so there is no doubt, and it is inevitable for the ones besides them<sup>as</sup>, from the first day in which the earth was Created up to the last annihilation of the world, that there would happen to be a Divine Authority upon the people of the earth, that would descend during that very Night unto the most beloved of His<sup>azwj</sup> servants.",
            "And I<sup>asws</sup> swear by Allah<sup>azwj</sup>! The Spirit and the Angels had descended during the Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) unto Adam<sup>as</sup>. And I<sup>asws</sup> swear by Allah<sup>azwj</sup>! Adam<sup>as</sup> did not die except there was a successor<sup>as</sup> for him<sup>as</sup>, and (for) everyone from the Prophets<sup>as</sup> after Adam<sup>as</sup>, that Command had come to him<sup>as</sup> during it, and was placed for his<sup>as</sup> successor<sup>as</sup> from after him<sup>as</sup>. And I<sup>asws</sup> swear by Allah<sup>azwj</sup>! It was always so that the Prophet<sup>as</sup> was Commanded among what came to Him<sup>as</sup> from the Commands during that Night, from Adam<sup>as</sup> to Muhammad<sup>saww</sup>, that he<sup>as</sup> bequeaths to so and so.",
            "And Allah<sup>azwj</sup> Mighty and Majestic has Said in His<sup>azwj</sup> Book to the Masters<sup>asws</sup> of the Command after Muhammad<sup>saww</sup> in particular <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h55\">[24:55]</a> Allah has Promised to those of you who believe and do righteous deeds that He will Make them to be Caliphs in the earth as He Made Caliphs those who were before them </span>– up to His<sup>azwj</sup> Words<span class=\"ibTxt\"> these it is who are the transgressors</span>.",
            "He<sup>azwj</sup> is Saying: “I<sup>azwj</sup> will be Making Caliphs for My<sup>azwj</sup> Knowledge, and My<sup>azwj</sup> Religion, and My<sup>azwj</sup> servants after your Prophet<sup>as</sup> just as I<sup>azwj</sup> had Made Caliphs of the successors<sup>as</sup> of Adam<sup>as</sup> from after him<sup>as</sup> until the Prophet<sup>saww</sup> was Sent, those that followed him<sup>azwj</sup> that <span class=\"ibTxt\">they shall worship Me, not associating anything with Me</span>”. He<sup>azwj</sup> is Saying: “Worship Me<sup>azwj</sup> with the belief that there will be no Prophet<sup>saww</sup> after Muhammad<sup>saww</sup>, so the one who says other than that, <span class=\"ibTxt\">these are the ones who are the transgressors</span>”.",
            "So He<sup>azwj</sup> has Enabled the Masters<sup>asws</sup> of the Command (Wali Al-Amr) after Muhammad<sup>saww</sup> with the Knowledge, and we<sup>asws</sup> are they, therefore ask us<sup>asws</sup>, so if we<sup>asws</sup> ratify you, be acknowledging, and you will not be doing so. As for our<sup>asws</sup> knowledge, so it is apparent, and as for the appearance of our<sup>asws</sup> era in which the Religion would be manifested from us<sup>asws</sup> until there does not happen to be any differing between the people, so there is a term for it from the passing of the nights and the days. When it comes, it would be manifested, and it would be one command. ",
            "And I<sup>asws</sup> swear by Allah<sup>azwj</sup>! The matter has been Ordained that there will not be any differing between the Momineen, and due to that, Allah<sup>azwj</sup> Made them to be the witnesses upon the people, for Muhammad<sup>saww</sup> to be a witness upon us<sup>asws</sup> and for us<sup>asws</sup> to be a witness upon our<sup>asws</sup> Shias, and for our<sup>asws</sup> Shias to be a witness upon the (generality of the) people. Allah<sup>azwj</sup> Mighty and Majestic Refuses that there should happen to be a differing in His<sup>azwj</sup> Judgment, or between the people<sup>asws</sup> of His<sup>azwj</sup> Knowledge, there be a contradiction’. ",
            "Then Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> said: ‘The merit of the <span class=\"iTxt\">Eman</span> of the Momin in total is <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h1\">[97:1]</a> We have indeed revealed this </span>(Chapter 97) and in its interpretation, upon the one who is not like him in the <span class=\"iTxt\">Eman</span> with it, is like the merit of the human being upon the beasts. And Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Defends with the believers in it from the rejecters of it in the world, in order to perfect the Punishment of the Hereafter for the ones He<sup style=\"font-weight: normal\">azwj</sup> Knows there is no repentance from them, as He<sup style=\"font-weight: normal\">azwj</sup> Defends by the fighters from the sitters. And I<sup style=\"font-weight: normal\">asws</sup> do not know that in this era if there is a Jihad other than the (performance) of the Hajj, and the Umra, and the (good) neighbourliness’."
          ],
          "en.sarwar": [
            " 6. Through the same chain of narrators it is narrated from abu Ja‘far (a.s.) who has said the following. “O the community of of our followers, debate the opposition by means of chapter ninety seven of th Holy Quran. We have revealed on the Night of Determination, you will gain victory. I swear by Allah, the Most Holy, the Most High, that this is the authoritative evidence from Allah, the Most Holy, the Most High, against the creatures after the Messenger of Allah. This is the lead evidence in your religion. It certainly, is the goal of our knowledge. “O community of our followers, (the Shi‘a) debate the opposition by means of, “I swear by the illustrious Book <a href=\"/#/books/quran:44#h2\">[44:2]</a> that We have revealed the Quran on a blessed night to warn mankind.” <a href=\"/#/books/quran:44#h3\">[44:3]</a> This verse is exclusively about the people who possess Divine authority after the Messenger of Allah .” “O cmmunity of our followers, Allah, the Most Holy, the Most High, has said, “. . No nation who lived before was left without a Warner.. .”<a href=\"/#/books/quran:35#h24\">[35:24]</a> A person then said, “O abu Ja‘far, the Warner is Muhammad (s.a)” The Imam (a.s.) said, “What you just said is true.Was there a Warner for the differennt parts of the land from those he had commissioned, while he (the Messenger of Allah ) was living?” The person questioning said, “No, there was no Warner.” Abu Ja‘far (a.s.) then said, “Consider the person he comissioned. Was he not his Warner, just as the Messenger of Allah, in being comissioned from Allah, the Most Holy, the Most High, was a Warner?” The person said, “Yes, it is true.” The Imam (a.s.) said, “In the same way Muhammad (s.a) did not die without having someone as his delegate and Warner.” The Imam (a.s.) said, “If you would say, “No, it would mean that the Messenger of Allah has lost his followers who are stil to be born.” The person then said, “Is the Holy Quran not enough for them?” The Imam (a.s.) said, “It is enough only if they find A number of our people has narrated from interpreter for it.” The person then assked, “Has the Messenger of Allah not interpreted it?” The Imam (a.s.) said, “Yes, he has done so just for one man and he has interpreted the conditionns of that man for his followers. That man is Ali ibn abu Talib (a.s.).” The man asking the question then said, “O abu Ja‘far (a.s.), this was a special matter. Common people are not able to bear it. The Imam (a.s.) ssaid, “Allah, disdains not being worshipped in secrecy until the time comes to when His religion becomes public. It is just as the Messenger of Allah and Khadija would not make their religion public until they were commanded to do so.” The man asking question then said, “Is it proper for the author of this religion to to hide?” The Imam (a.s.) said, “Did Ali ibn abu Talib not hide his religion on the day he became a Muslim with the Messenger of Allah until his matter became public?” He said, “Yes, that was the case.” The Imam (a.s.) then said, “So also is our case (the publicity of Divine authotrity) until the appointed time will come.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> السند مشترك   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/90)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 648,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/734",
              "text": "قَالَ وَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "قَالَ وَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:41:8",
        "relations": {
          "Mentions": [
            "/books/quran:24:55"
          ]
        },
        "text": [
          " رَجُلٌ لِأَبِي جَعْفَرٍ ( عليه السلام ) يَا ابْنَ رَسُولِ اللَّهِ لَا تَغْضَبْ عَلَيَّ قَالَ لِمَا ذَا قَالَ لِمَا أُرِيدُ أَنْ أَسْأَلَكَ عَنْهُ قَالَ قُلْ قَالَ وَ لَا تَغْضَبُ قَالَ وَ لَا أَغْضَبُ قَالَ أَ رَأَيْتَ قَوْلَكَ فِي لَيْلَةِ الْقَدْرِ وَ تَنَزُّلِ الْمَلَائِكَةِ وَ الرُّوحِ فِيهَا إِلَى الْأَوْصِيَاءِ يَأْتُونَهُمْ بِأَمْرٍ لَمْ يَكُنْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَدْ عَلِمَهُ أَوْ يَأْتُونَهُمْ بِأَمْرٍ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَعْلَمُهُ وَ قَدْ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مَاتَ وَ لَيْسَ مِنْ عِلْمِهِ شَيْ‏ءٌ إِلَّا وَ عَلِيٌّ ( عليه السلام ) لَهُ وَاعٍ ",
          "قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَا لِي وَ لَكَ أَيُّهَا الرَّجُلُ وَ مَنْ أَدْخَلَكَ عَلَيَّ قَالَ أَدْخَلَنِي عَلَيْكَ الْقَضَاءُ لِطَلَبِ الدِّينِ قَالَ فَافْهَمْ مَا أَقُولُ لَكَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَمَّا أُسْرِيَ بِهِ لَمْ يَهْبِطْ حَتَّى أَعْلَمَهُ اللَّهُ جَلَّ ذِكْرُهُ عِلْمَ مَا قَدْ كَانَ وَ مَا سَيَكُونُ وَ كَانَ كَثِيرٌ مِنْ عِلْمِهِ ذَلِكَ جُمَلًا يَأْتِي تَفْسِيرُهَا فِي لَيْلَةِ الْقَدْرِ وَ كَذَلِكَ كَانَ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) قَدْ عَلِمَ جُمَلَ الْعِلْمِ وَ يَأْتِي تَفْسِيرُهُ فِي لَيَالِي الْقَدْرِ كَمَا كَانَ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ",
          "قَالَ السَّائِلُ أَ وَ مَا كَانَ فِي الْجُمَّلِ تَفْسِيرٌ قَالَ بَلَى وَ لَكِنَّهُ إِنَّمَا يَأْتِي بِالْأَمْرِ مِنَ اللَّهِ تَعَالَى فِي لَيَالِي الْقَدْرِ إِلَى النَّبِيِّ وَ إِلَى الْأَوْصِيَاءِ افْعَلْ كَذَا وَ كَذَا لِأَمْرٍ قَدْ كَانُوا عَلِمُوهُ أُمِرُوا كَيْفَ يَعْمَلُونَ فِيهِ قُلْتُ فَسِّرْ لِي هَذَا قَالَ لَمْ يَمُتْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَّا حَافِظاً لِجُمْلَةِ الْعِلْمِ وَ تَفْسِيرِهِ",
          "قُلْتُ فَالَّذِي كَانَ يَأْتِيهِ فِي لَيَالِي الْقَدْرِ عِلْمُ مَا هُوَ قَالَ الْأَمْرُ وَ الْيُسْرُ فِيمَا كَانَ قَدْ عَلِمَ قَالَ السَّائِلُ فَمَا يَحْدُثُ لَهُمْ فِي لَيَالِي الْقَدْرِ عِلْمٌ سِوَى مَا عَلِمُوا قَالَ هَذَا مِمَّا أُمِرُوا بِكِتْمَانِهِ وَ لَا يَعْلَمُ تَفْسِيرَ مَا سَأَلْتَ عَنْهُ إِلَّا اللَّهُ عَزَّ وَ جَلَّ",
          "قَالَ السَّائِلُ فَهَلْ يَعْلَمُ الْأَوْصِيَاءُ مَا لَا يَعْلَمُ الْأَنْبِيَاءُ قَالَ لَا وَ كَيْفَ يَعْلَمُ وَصِيٌّ غَيْرَ عِلْمِ مَا أُوصِيَ إِلَيْهِ",
          "قَالَ السَّائِلُ فَهَلْ يَسَعُنَا أَنْ نَقُولَ إِنَّ أَحَداً مِنَ الْوُصَاةِ يَعْلَمُ مَا لَا يَعْلَمُ الْآخَرُ قَالَ لَا لَمْ يَمُتْ نَبِيٌّ إِلَّا وَ عِلْمُهُ فِي جَوْفِ وَصِيِّهِ وَ إِنَّمَا تَنَزَّلُ الْمَلَائِكَةُ وَ الرُّوحُ فِي لَيْلَةِ الْقَدْرِ بِالْحُكْمِ الَّذِي يَحْكُمُ بِهِ بَيْنَ الْعِبَادِ",
          "قَالَ السَّائِلُ وَ مَا كَانُوا عَلِمُوا ذَلِكَ الْحُكْمَ قَالَ بَلَى قَدْ عَلِمُوهُ وَ لَكِنَّهُمْ لَا يَسْتَطِيعُونَ إِمْضَاءَ شَيْ‏ءٍ مِنْهُ حَتَّى يُؤْمَرُوا فِي لَيَالِي الْقَدْرِ كَيْفَ يَصْنَعُونَ إِلَى السَّنَةِ الْمُقْبِلَةِ ",
          "قَالَ السَّائِلُ يَا أَبَا جَعْفَرٍ لَا أَسْتَطِيعُ إِنْكَارَ هَذَا قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَنْ أَنْكَرَهُ فَلَيْسَ مِنَّا",
          "قَالَ السَّائِلُ يَا أَبَا جَعْفَرٍ أَ رَأَيْتَ النَّبِيَّ ( صلى الله عليه وآله ) هَلْ كَانَ يَأْتِيهِ فِي لَيَالِي الْقَدْرِ شَيْ‏ءٌ لَمْ يَكُنْ عَلِمَهُ قَالَ لَا يَحِلُّ لَكَ أَنْ تَسْأَلَ عَنْ هَذَا أَمَّا عِلْمُ مَا كَانَ وَ مَا سَيَكُونُ فَلَيْسَ يَمُوتُ نَبِيٌّ وَ لَا وَصِيٌّ إِلَّا وَ الْوَصِيُّ الَّذِي بَعْدَهُ يَعْلَمُهُ أَمَّا هَذَا الْعِلْمُ الَّذِي تَسْأَلُ عَنْهُ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ أَبَى أَنْ يُطْلِعَ الْأَوْصِيَاءَ عَلَيْهِ إِلَّا أَنْفُسَهُمْ ",
          "قَالَ السَّائِلُ يَا ابْنَ رَسُولِ اللَّهِ كَيْفَ أَعْرِفُ أَنَّ لَيْلَةَ الْقَدْرِ تَكُونُ فِي كُلِّ سَنَةٍ قَالَ إِذَا أَتَى شَهْرُ رَمَضَانَ فَاقْرَأْ سُورَةَ الدُّخَانِ فِي كُلِّ لَيْلَةٍ مِائَةَ مَرَّةٍ فَإِذَا أَتَتْ لَيْلَةُ ثَلَاثٍ وَ عِشْرِينَ فَإِنَّكَ نَاظِرٌ إِلَى تَصْدِيقِ الَّذِي سَأَلْتَ عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "He (the narrator) said, ",
            "‘And a man said to Abu Ja’far<sup>asws</sup>, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! Do not be angry upon me’. He<sup>asws</sup> said: ‘Due to what?’ He said, ‘Due to what I intend to ask you<sup>asws</sup>’. He<sup>asws</sup> said: ‘Say (it)’. He said, ‘And you will not be angry?’ He<sup>asws</sup> said: ‘And I<sup>asws</sup> will not be angry’. He said, ‘Will you<sup>asws</sup> consider your<sup>asws</sup> words regarding The Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>), that the Angels and the Spirit descend during it unto the successors<sup>asws</sup>. Are they coming to them<sup>asws</sup> with the matters which Rasool-Allah<sup>saww</sup> did not happen to have its knowledge, or are they coming to them<sup>asws</sup> with matters which Rasool-Allah<sup>saww</sup> did have the knowledge of it? And I know that Rasool-Allah<sup>saww</sup> passed away and there wasn’t anything from his<sup>saww</sup> knowledge except that Ali<sup>asws</sup> was a retainer of it’. ",
            "Abu Ja’far<sup>asws</sup> said: ‘What is it to me<sup>asws</sup> and to you, O man! And who made you come over to me<sup>asws</sup>?’ He Said, ‘The Ordainment made me come over to you seeking the Religion’. He<sup>asws</sup> said: ‘Then understand what I<sup>asws</sup> am saying to you. When Rasool-Allah<sup>saww</sup> was ascended with, he<sup>saww</sup> did not come back down until Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention Taught him<sup>saww</sup> whatever had happened, and what will be happening, and a lot of his<sup>saww</sup> knowledge of that in total, its interpretation came to him<sup>saww</sup> during the Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>). And similar to that was Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> had known the totality of the knowledge, and its interpretation came during a Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>), just as was the case with Rasool-Allah<sup>saww</sup>.",
            "The questioner said, ‘Or was there no interpretation for the whole of it?’ He<sup>asws</sup> said: ‘Yes, but, rather it came with the Commands from Allah<sup>azwj</sup> the Exalted during the Nights of the Pre-determination unto the Prophet<sup>saww</sup> and unto the successors<sup>asws</sup>: “Do such and such for a matter”. They<sup>asws</sup> did have its knowledge. Its Command was how they<sup>asws</sup> should be doing it’. He said, ‘Explain this to me’. He<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> did not pass away except having preserved the totality of the knowledge and its interpretation’. ",
            "I said, ‘So the knowledge which he<sup>saww</sup> was Given during the Nights of Pre-determination, what was it?’ He<sup>asws</sup> said: ‘The Command and the ease regarding what he<sup>saww</sup> had already known’. The questioner said, ‘So whatever newly occurred for them<sup>asws</sup> during the Nights of Pre-determination was knowledge besides what they already knew of?’ He<sup>asws</sup> said: ‘This is from what they<sup>asws</sup> have been Commanded with its concealment, and none know the interpretation of what you asked about except for Allah<sup>azwj</sup> Mighty and Majestic’. ",
            "The questioner asked, ‘So do the successors<sup>asws</sup> know what the Prophets<sup>as</sup> did not know?’ He<sup>asws</sup> said: ‘No. And how can a successor<sup>asws</sup> know other than a knowledge which had been bequeathed to him<sup>asws</sup>?’ ",
            "The questioner asked, ‘So do we have the leeway that we should be saying that one of the successors<sup>asws</sup> knows what the other one does not?’ He<sup>asws</sup> said: ‘No. A Prophet<sup>as</sup> does not pass away except his<sup>as</sup> knowledge would be in the inside of his<sup>as</sup> successor<sup>as</sup>, and rather, the Angels and the Spirit descend during a Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) with the Judgment he<sup>asws</sup> would be judging with between the servants’.",
            "The questioner said, ‘And was it so that they<sup>asws</sup> knew of that Judgment?’ He<sup>asws</sup> said: ‘They<sup>asws</sup> had known it, but they<sup>asws</sup> cannot implement anything from it until they<sup>asws</sup> are Commanded for it during the Nights of Pre-determination how they<sup>asws</sup> should be dealing with it up to the next year’.  ",
            "The questioner said, ‘O Abu Ja’far<sup>asws</sup>, ‘I am not able to deny this’. Abu Ja’far<sup>asws</sup> said: ‘The one who denies it, so he isn’t from us<sup>asws</sup>’. ",
            "The questioner said, ‘O Abu Ja’far<sup>asws</sup>! What is your<sup>asws</sup> view of the Prophet<sup>saww</sup>, did anything come to him<sup>saww</sup> during the Nights of Pre-determination which he<sup>saww</sup> did not know of?’ He<sup>asws</sup> said: ‘It is not permissible for you that you should be asking about this. As for the knowledge of what had happened and what was going to happen, so neither does a Prophet<sup>as</sup> pass away nor a successor<sup>as</sup>, except that the successor<sup>as</sup> to be after him<sup>as</sup> would know it. As for this knowledge which you asked about, so Allah<sup>azwj</sup> Mighty and Majestic Refuses that the succesors<sup>as</sup> should notify it except upon themselves<sup>as</sup>’. ",
            "The questioner said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! How can I recognise a Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) occurring during every year?’ He<sup>asws</sup> said: ‘When a Month of Ramazan comes, so recite Surah Al-Dukhhan (Chapter 44) every night one hundred times. So when the night of the twenty third comes, so you shall see the ratification of that which you questioned about’."
          ],
          "en.sarwar": [
            " 7. Through the same chain of narrators it is narrated from abu Ja‘far (a.s.) who has said the following. “Allah, Majestic is Whose mention, created the Night of Determination when He first created the world and created in it the first prophet that would come and the first executor of the will (of prophet) that would come. He decreed that in every year there must be one night in which the interpretation and the clarification of would be sent until another such night in the coming year. Whoever would deny it has certainly rejected the knowledge of Allah, Majestic is Whose mention. It is because the prophets, the Messengers and Muhadditun (spokesmen for Allah) without receiving Divine authority through what comes to them on that night along with the authority that Jibril brings for them (a.s.).” The narrator has said that he asked the Imams (a.s.), “Do the Muhaddithun also experience the coming of Jibril and other angels?” The Imam (a.s.) said, “The prophets and the Messenger (s.a.) certainly, experience it. For the others besides the prophets and the Messenger (s.a.) it is necessary that from the first day the eart h was created to the last of the perishing of world there must the Divine authority for the people of the earth that would come down on that night to the one who would be te most beloved among His servants. I swear by Allah, the spirit and the angels came with the command on the Night of Determination to Adam. I swear by Allah, that Adam did not die until he had the executor of his will. To every prophet after Adam the command came to them on that night and it was assigned to the executor of his will after him. I swear by Allah, if the prophet had to be commanded through that which that came to them on that night from Adam to Muhammad (s.a) to make a will in favor of so and so and that Allah, the Most Holy, the Most High, has said in His book to the people who possess Divine after Muhammad (s.a.). “God has promised the righteously striving believers to appoint them as His deputies on earth, as He had appointed those who lived before. He will make the religion that He has chosen for them to stand supreme. He will replace their fear with peace and security so that they will worship God alone and consider no one equal to Him. Whoever becomes an unbeliever after this will be a sinful person.” <a href=\"/#/books/quran:24#h55\">[24:55]</a> He says that He has made you His deputies in the matter of His knowledge, religion and worship after His Prophet just as Adam made a will to appoint the executor of his will after him until the time Allah sent another prophet. He has said, “so that they will worship God alone and consider no one equal to Him” He has said that you must worship Him with faith in the fact that after Muhammad (s.a.) there is no other prophet. Those who would say otherwise are sinful persons. He has enabled the people who possess Divine authority with knowledge. We are such people. Ask us. If we will acknowledge you then be steadfast but you will not do so. Our knowledge is clear. The appearance of the appointed time for us in which religion will stand supreme through us so much so that there will remain no differences among people for such time there is A number of our people has narrated from appointed time that pass through the nights and days. When that time will come, the command of Allah will be only one. “I swear by Allah, it is already decreed that there will beno differences among the believers and for this reason they are made to witness the deeds of the people so that Muhammad (s.a) will be witness over us and we will be the witness over our followers and our followers will be witness over the people. Allah, the Most Holy, the Most High, disdained to let differences take place in His judgment or contradictions to take place among those who possess His knowledge.” Abu Ja‘far (a.s.) then said the following. “The excellence of the faith of a believer because of his accepting, “We have revealed it in the Night of Determination,” and its interpretation, over those who are not like him in the matters of faith in that Night is like the excellence of man over the animals. Allah, the Most Holy, the Most High, defends through those who believe in it from those who disbelieve it in this world-- it is to complete the punishment for it in the next life for those whom He knows would not repent from rejecting the same--, just as He defends through those who strive (Jihad) for His cause those who sit comfortably. I do not know if there is any Jihad striving for His cause, these days, other than Hajj, ‘Umra and to be good neighbors”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> السند مشترك    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/96)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 649,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/735",
              "text": "وَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:41:9",
        "text": [
          " قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) لَمَا تَرَوْنَ مَنْ بَعَثَهُ اللَّهُ عَزَّ وَ جَلَّ لِلشَّقَاءِ عَلَى أَهْلِ الضَّلَالَةِ مِنْ أَجْنَادِ الشَّيَاطِينِ وَ أَزْوَاجِهِمْ أَكْثَرُ مِمَّا تَرَوْنَ خَلِيفَةَ اللَّهِ الَّذِي بَعَثَهُ لِلْعَدْلِ وَ الصَّوَابِ مِنَ الْمَلَائِكَةِ قِيلَ يَا أَبَا جَعْفَرٍ وَ كَيْفَ يَكُونُ شَيْ‏ءٌ أَكْثَرَ مِنَ الْمَلَائِكَةِ قَالَ كَمَا شَاءَ اللَّهُ عَزَّ وَ جَلَّ ",
          "قَالَ السَّائِلُ يَا أَبَا جَعْفَرٍ إِنِّي لَوْ حَدَّثْتُ بَعْضَ الشِّيعَةِ بِهَذَا الْحَدِيثِ لَأَنْكَرُوهُ قَالَ كَيْفَ يُنْكِرُونَهُ قَالَ يَقُولُونَ إِنَّ الْمَلَائِكَةَ ( عليهم السلام ) أَكْثَرُ مِنَ الشَّيَاطِينِ قَالَ صَدَقْتَ افْهَمْ عَنِّي مَا أَقُولُ إِنَّهُ لَيْسَ مِنْ يَوْمٍ وَ لَا لَيْلَةٍ إِلَّا وَ جَمِيعُ الْجِنِّ وَ الشَّيَاطِينِ تَزُورُ أَئِمَّةَ الضَّلَالَةِ وَ يَزُورُ إِمَامَ الْهُدَى عَدَدُهُمْ مِنَ الْمَلَائِكَةِ حَتَّى إِذَا أَتَتْ لَيْلَةُ الْقَدْرِ فَيَهْبِطُ فِيهَا مِنَ الْمَلَائِكَةِ إِلَى وَلِيِّ الْأَمْرِ خَلَقَ اللَّهُ أَوْ قَالَ قَيَّضَ اللَّهُ عَزَّ وَ جَلَّ مِنَ الشَّيَاطِينِ بِعَدَدِهِمْ",
          "ثُمَّ زَارُوا وَلِيَّ الضَّلَالَةِ فَأَتَوْهُ بِالْإِفْكِ وَ الْكَذِبِ حَتَّى لَعَلَّهُ يُصْبِحُ فَيَقُولُ رَأَيْتُ كَذَا وَ كَذَا فَلَوْ سَأَلَ وَلِيَّ الْأَمْرِ عَنْ ذَلِكَ لَقَالَ رَأَيْتَ شَيْطَاناً أَخْبَرَكَ بِكَذَا وَ كَذَا حَتَّى يُفَسِّرَ لَهُ تَفْسِيراً وَ يُعْلِمَهُ الضَّلَالَةَ الَّتِي هُوَ عَلَيْهَا",
          "وَ ايْمُ اللَّهِ إِنَّ مَنْ صَدَّقَ بِلَيْلَةِ الْقَدْرِ لَيَعْلَمُ أَنَّهَا لَنَا خَاصَّةً لِقَوْلِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لِعَلِيٍّ ( عليه السلام ) حِينَ دَنَا مَوْتُهُ هَذَا وَلِيُّكُمْ مِنْ بَعْدِي فَإِنْ أَطَعْتُمُوهُ رَشَدْتُمْ وَ لَكِنْ مَنْ لَا يُؤْمِنُ بِمَا فِي لَيْلَةِ الْقَدْرِ مُنْكِرٌ وَ مَنْ آمَنَ بِلَيْلَةِ الْقَدْرِ مِمَّنْ عَلَى غَيْرِ رَأْيِنَا فَإِنَّهُ لَا يَسَعُهُ فِي الصِّدْقِ إِلَّا أَنْ يَقُولَ إِنَّهَا لَنَا وَ مَنْ لَمْ يَقُلْ فَإِنَّهُ كَاذِبٌ",
          "إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَعْظَمُ مِنْ أَنْ يُنَزِّلَ الْأَمْرَ مَعَ الرُّوحِ وَ الْمَلَائِكَةِ إِلَى كَافِرٍ فَاسِقٍ فَإِنْ قَالَ إِنَّهُ يُنَزِّلُ إِلَى الْخَلِيفَةِ الَّذِي هُوَ عَلَيْهَا فَلَيْسَ قَوْلُهُمْ ذَلِكَ بِشَيْ‏ءٍ وَ إِنْ قَالُوا إِنَّهُ لَيْسَ يُنَزِّلُ إِلَى أَحَدٍ فَلَا يَكُونُ أَنْ يُنَزَّلَ شَيْ‏ءٌ إِلَى غَيْرِ شَيْ‏ءٍ وَ إِنْ قَالُوا وَ سَيَقُولُونَ لَيْسَ هَذَا بِشَيْ‏ءٍ فَقَدْ ضَلُّوا ضَلَالًا بَعِيداً ."
        ],
        "translations": {
          "en.hubeali": [
            "And Abu Ja’far<sup>asws</sup> said: ‘For what (reason) are you seeing the ones whom Allah<sup>azwj</sup> Mighty Send for the wretched ones upon the people of the straying from the armies of the Satans<sup>la</sup> and their pairs to be more than what you are seeing the Caliphs of Allah<sup>azwj</sup> whom Allah<sup>azwj</sup> Sent for the justice and the correctness from the Angels?’ O Abu Ja’far<sup>asws</sup>! And how can anything be more numerous than the Angels are?’ He<sup>asws</sup> said: ‘(It is) what Allah<sup>azwj</sup> Mighty and Majestic has Desired it to be’. ",
            "The questioner said, ‘O Abu Ja’far<sup>asws</sup>! If I were to narrate to some of the Shias with this Hadeed, they would be denying it’. He<sup>asws</sup> said: ‘How would they be denying it?’ He said, ‘They would be saying that the Angels are more numerous than the Satans<sup>la</sup> are’. He<sup>asws</sup> said: ‘You speak the truth. Understand from me<sup>asws</sup> what I<sup>asws</sup> am saying. There isn’t from a day, nor a night except that the entirety of the Jinn and the Satans<sup>la</sup> are visiting the imams of misguidance, and (the like of) their number from the Angels would be visiting the Imam<sup>asws</sup> of the Guidance, to the extent that when the Night of Predetermination (<span class=\"iTxt\">Laylat Al-Qadr</span>) comes, so there descend during it, unto a Master<sup>asws</sup> of the Command, the Angels whom Allah<sup>azwj</sup> Mighty and Majestic Created’, or said: ‘Ordained from the Satans<sup>la</sup> of their number.",
            "Then they<sup>la</sup> are visiting a master of the straying, so they come to him<sup>la</sup> with the fabrications and the lies until it is perhaps morning. So he<sup>la</sup> is saying, ‘I<sup>la</sup> saw such and such’. But, if a Master<sup>asws</sup> of the Command were to be asked about that, he<sup>asws</sup> would say: ‘I<sup>asws</sup> saw Satan<sup>la</sup> inform you with such and such’, until he<sup>asws</sup> would interpret for him an interpretation, and he would come to know the straying which he was upon. ",
            "And I<sup>asws</sup> swear by Allah<sup>azwj</sup> than the one who ratifies by a Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) he would know that it is for us<sup>asws</sup> in particular due to the words of Rasool-Allah<sup>saww</sup> for Ali<sup>asws</sup> when his<sup>asws</sup> death approached him<sup>saww</sup>: ‘This is your Guardian<sup>asws</sup> after me<sup>saww</sup>. So if you were to obey him, you would be rightly guided’. But, the one who does not believe in what is regarding the Night of Pre-determination (<span class=\"iTxt\">Laylat Al-Qadr</span>) is a denier, and the one who believes in The Night of Pre-determination would be from the one from other than our<sup>asws</sup> viewpoint, so he would not have the leeway regarding the ratification except that he should be saying that it is for us<sup>asws</sup>, and the one who does not says so, so he is a liar.",
            "Surely Allah<sup>azwj</sup> Mighty and Majestic is more Magnificent that He<sup>azwj</sup> would Send the Command with the Spirit and the Angels unto a disbeliever, a transgressor. So if they were to say that it descends unto the Caliph, the one who is upon it (the Caliphate), so that speech of theirs is not with anything (meaningful), and if they were to say that it doesn’t descend unto anyone, so it cannot happen that something would descend upon nothing, and if they were to say and they will be saying, that this isn’t anything, so they would have strayed a far straying’."
          ],
          "en.sarwar": [
            " 8. The narrator has said that a man said to abu Ja‘far (a.s.), “O child of the Messenger of Allah, “Please do not be angry with m.” The Imam (a.s.) said, “Why should I be angry?” The man said, “It is because of the question that like to ask you.” The Imam (a.s.) said, “Ask your question.” He said, “Please do not be angry.” The Imam (a.s.) said, “I will not be angry.” The man said, “Consider your words about the ‘Night of Determination’ in which the Spirit and the angels descent to the executors of the will (of Prophet). Do they bring them the command of which the Messenger of Allah had no knowledge or bring them the commands that the Messenger of Allah knew? As you know that the Messenger of Allah died and there was nothing of his knowledge that Ali (a.s.) had not heard it (and preserved).” Abu Ja‘far (a.s.) said, “Why should I bother with you and why someone let you come in?” He said, “Fate has let me come in, seeking religion.” The Imam (a.s.) said, “Try to understand what I will say.” “When the Messenger of Allah was taken for a trip (by the angels) he did not come back before Allah, Majestic is Whose mention, taught him the knowledge of the things of the past and the things in future. A great deal of such knowledge was in a whole form the interpretation of which would have to come in the ‘Night of Determination’. In the same Ali ibn abu Talib (a.s.) had learned the knowledge in a whole form, the interpretation of which would have had to come in the ‘Night of Determination’ as was the case with the Messenger of Allah.” The man said, “Was there no interpretation of the whole available?” The Imam (a.s.) said, “It was available but it comes through the commands of Allah in the ‘Night of Determination’ to the Prophet the executor of his will telling them to do so and so. It is for the matters of which they already had knowledge, but they receive the command as how to act in it.” The man said, “Explain it to me.” The Imam (a.s.) said, “The Messenger of Allah, before his death had a whole of knowledge with its interpretation.” You said, “What was that which that would come to him in the ‘Night of Determination’?” The Imam (a.s.) said, “It was the command and ease in what he already knew.” The man questioning said, “What then happens to them in the ‘Night of Determination’ is a knowledge other than what they knew before.” The Imam (a.s.) said, “This is what they are commanded not to tell to anyone. No one knows the interpretation of what you just asked except Allah, the Most Holy, the Most High. The man questioning asked, “Do the executors of the know what the prophets know?” The Imam (a.s.) said, “No, because how would the executor of the will would know what is other than what is willed for.” The man asked, “Can we say that what one executor of the will may know may not be known another executor of the will?” The Imam (a.s.) said, “No, because no prophet dies before his knowledge is transferred into the executor of his will. The angels and the Spirit descend in the ‘Night of Determination’ with the judgment with which to judge among the people.” The man asked, “Is it that they did not know that judgment?” The Imam (a.s.) said, “Yes, they knew it but they could not approve anything of it until they were commanded in the ‘Night of Determination’ how to accomplish them until the next year.” The man said, “O abu Ja‘far (a.s.) I can not deny this.” The Imam (a.s.) said, “Those who deny it is not from us.” The man asked, “O abu Ja‘far (a.s.), do you think in the ‘Night of Determination’ there would come things to the Holy Prophet (s.a.) that he did not know?” The Imam (a.s.) said, “It is not lawful for you to ask this. However, the knowledge of things in past and the knowledge of the things in future is as such that no prophet or the executor of the dies before the executor of will after him would know it. However, this know about which you ask is as such that Allah, the Most Holy, the Most High, withholds and does not allow the executors of the will to know it by themselves.” The man asked, “O child of the Messenger of Allah, how would I know that the ‘Night of Determination’ take place every year?” The Imam (a.s.) said, “When the month of Ramadan comes read chapter 44 of the Holy Quran once every night. In the twenty third night you will see the confirmation of what you have asked for.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> بالسند السابق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (100/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": " "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/736",
              "text": "9ـ وَقَالَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": " 9ـ وَقَالَ قَالَ"
        },
        "part_type": "Hadith",
        "text": [
          " أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) لَمَا تَرَوْنَ مَنْ بَعَثَهُ الله عَزَّ وَجَلَّ لِلشَّقَاءِ عَلَى أَهْلِ الضَّلالَةِ مِنْ أَجْنَادِ الشَّيَاطِينِ وَأَزْوَاجِهِمْ أَكْثَرُ مِمَّا تَرَوْنَ خَلِيفَةَ الله الَّذِي بَعَثَهُ لِلْعَدْلِ وَالصَّوَابِ مِنَ الْمَلائِكَةِ قِيلَ يَا أَبَا جَعْفَرٍ وَكَيْفَ يَكُونُ شَيْ‏ءٌ أَكْثَرَ مِنَ الْمَلائِكَةِ قَالَ كَمَا شَاءَ الله عَزَّ وَجَلَّ قَالَ السَّائِلُ يَا أَبَا جَعْفَرٍ إِنِّي لَوْ حَدَّثْتُ بَعْضَ الشِّيعَةِ بِهَذَا الْحَدِيثِ لانْكَرُوهُ قَالَ كَيْفَ يُنْكِرُونَهُ قَالَ يَقُولُونَ إِنَّ الْمَلائِكَةَ (عَلَيْهم السَّلام) أَكْثَرُ مِنَ الشَّيَاطِينِ قَالَ صَدَقْتَ افْهَمْ عَنِّي مَا أَقُولُ إِنَّهُ لَيْسَ مِنْ يَوْمٍ وَلا لَيْلَةٍ إِلا وَجَمِيعُ الْجِنِّ وَالشَّيَاطِينِ تَزُورُ أَئِمَّةَ الضَّلالَةِ وَيَزُورُ إِمَامَ الْهُدَى عَدَدُهُمْ مِنَ الْمَلائِكَةِ حَتَّى إِذَا أَتَتْ لَيْلَةُ الْقَدْرِ فَيَهْبِطُ فِيهَا مِنَ الْمَلائِكَةِ إِلَى وَلِيِّ الامْرِ خَلَقَ الله أَوْ قَالَ قَيَّضَ الله عَزَّ وَجَلَّ مِنَ الشَّيَاطِينِ بِعَدَدِهِمْ ثُمَّ زَارُوا وَلِيَّ الضَّلالَةِ فَأَتَوْهُ بِالافْكِ وَالْكَذِبِ حَتَّى لَعَلَّهُ يُصْبِحُ فَيَقُولُ رَأَيْتُ كَذَا وَكَذَا فَلَوْ سَأَلَ وَلِيَّ الامْرِ عَنْ ذَلِكَ لَقَالَ رَأَيْتَ شَيْطَاناً أَخْبَرَكَ بِكَذَا وَكَذَا حَتَّى يُفَسِّرَ لَهُ تَفْسِيراً وَيُعْلِمَهُ الضَّلالَةَ الَّتِي هُوَ عَلَيْهَا وَايْمُ الله إِنَّ مَنْ صَدَّقَ بِلَيْلَةِ الْقَدْرِ لَيَعْلَمُ أَنَّهَا لَنَا خَاصَّةً لِقَوْلِ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) لِعلي (عَلَيْهِ السَّلام) حِينَ دَنَا مَوْتُهُ هَذَا وَلِيُّكُمْ مِنْ بَعْدِي فَإِنْ أَطَعْتُمُوهُ رَشَدْتُمْ وَلَكِنْ مَنْ لا يُؤْمِنُ بِمَا فِي لَيْلَةِ الْقَدْرِ مُنْكِرٌ وَمَنْ آمَنَ بِلَيْلَةِ الْقَدْرِ مِمَّنْ عَلَى غَيْرِ رَأْيِنَا فَإِنَّهُ لا يَسَعُهُ فِي الصِّدْقِ إِلا أَنْ يَقُولَ إِنَّهَا لَنَا وَمَنْ لَمْ يَقُلْ فَإِنَّهُ كَاذِبٌ إِنَّ الله عَزَّ وَجَلَّ أَعْظَمُ مِنْ أَنْ يُنَزِّلَ الامْرَ مَعَ الرُّوحِ وَالْمَلائِكَةِ إِلَى كَافِرٍ فَاسِقٍ فَإِنْ قَالَ إِنَّهُ يُنَزِّلُ إِلَى الْخَلِيفَةِ الَّذِي هُوَ عَلَيْهَا فَلَيْسَ قَوْلُهُمْ ذَلِكَ بِشَيْ‏ءٍ وَإِنْ قَالُوا إِنَّهُ لَيْسَ يُنَزِّلُ إِلَى أَحَدٍ فَلا يَكُونُ أَنْ يُنَزَّلَ شَيْ‏ءٌ إِلَى غَيْرِ شَيْ‏ءٍ وَإِنْ قَالُوا وَسَيَقُولُونَ لَيْسَ هَذَا بِشَيْ‏ءٍ فَقَدْ ضَلُّوا ضَلالاً بَعِيداً."
        ],
        "translations": {
          "en.sarwar": [
            " 9. The narrator has said that abu Ja‘far (a.s.) said the following. “You, certainly, find those whom Allah, the Most Holy, the Most High, has sent to induce misfortune into the heretics and misleading people of the army (followers) of Satan and their companions in greater numbers than those sent to the deputy of Allah, sent for justice and truth from among the angels.” (In other words, the devils sent to induce bad luck into the heretics are in greater number than the angels sent with guidance to the people of Divine authority). It was said to him, “O abu Ja‘far (a.s.), “How can there be anything in greater number than the angels?” The Imam (a.s.) said, “It is just as Allah, the Most Holy, the Most High, has wished.” The man asked, “O abu Ja‘far (a.s.), “If I will narrate this Hadith to a few of your followers they will reject it.” The Imam (a.s.) asked, “Why they will do so?” The man said, “They will say that the angels are of greater number than the Devils.” The Imam (a.s.) said, “What say is true. However, try to understand what I will say.” There is no day or night in which all the Devils and all Satans would not visit the heretic and misleading leaders and of the same number the angels visit the Imam of true guidance (leaders who possess Divine authority) until it is the ‘Night of Determination’. On that night of the angels descend to those who possess Divine authority in a number equal to the number of the Devils and Satan that Allah has created- or he said, has determined. The Devils and Satans will come to the corrupt misleading authorities with fabrications and lies until the perhaps dawn and say, “I saw, this night, such and suCh” However, if he would ask about it the one who possesses Divine authority, he would say, “You have seen a Satan who has informed of you such and suCh (It is the Devil’s thing) until he provides him with one or the other interpretation and teach him the ways how to mislead people. The misleading conditions in which he lives. I swear by Allah, those who acknowledge the ‘Night of Determination’ they will certainly know that it (the ‘Night of Determination’ is exclusively for us. It is because of th words of the Messenger of Allah to Ali (a.s.) when the time of his death was about to approach, “This is you guardian who possess Divine authority after me. If you will obey him, you will enjoy a well guided way of life. However, those who would not acknowledge what is in the ‘Night of Determination’ they would be unbelievers in it. Those who would have faith in the ‘Night of Determination’ but do not hold the opinion that we do, for them to verify it, there is no other way but to say that it the ‘Night of Determination’ is for us and those would not acknowledge it they would be only liars. Allah, the Most Holy, the Most High, is by far exalted than to send the angles with the Spirit to a sinful unbeliever. If such people would say that they (angels with the Spirit) come to the Khalifa in whom believes, this would be of no ground. If they would say, “No one descends at that night to anyone.” The fact is that something does come to nothing. If they say or will say, “This is nothing.” They have, certainly, strayed far away from the truth.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:41",
  "kind": "verse_list"
}