{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 42"
        },
        "path": "/books/al-kafi:1:4:42",
        "titles": {
          "ar": "باب فِي أَنَّ الْأَئِمَّةَ ( عليهم السلام ) يَزْدَادُونَ فِي لَيْلَةِ الْجُمُعَةِ",
          "en": "Chapter 42 – Regarding that the Imams<sup>asws</sup> are being increased (with knowledge) during the night of Friday"
        }
      }
    ],
    "index": 100,
    "local_index": 42,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:1:4:43",
        "titles": {
          "ar": "بَابُ لَوْ لَا أَنَّ الْأَئِمَّةَ ( عليهم السلام ) يَزْدَادُونَ لَنَفِدَ مَا عِنْدَهُمْ",
          "en": "Chapter 43 – If the Imams<sup>asws</sup> were not to be increased, it would deplete what is with them<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 41"
        },
        "path": "/books/al-kafi:1:4:41",
        "titles": {
          "ar": "باب فِي شَأْنِ إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ وَ تَفْسِيرِهَا",
          "en": "Chapter 41 – Regarding the glory of [97:1] We have indeed revealed this in the Night of Predestination (Chapter 97) and its interpretation"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:42",
    "titles": {
      "ar": "باب فِي أَنَّ الْأَئِمَّةَ ( عليهم السلام ) يَزْدَادُونَ فِي لَيْلَةِ الْجُمُعَةِ",
      "en": "Chapter 42 – Regarding that the Imams<sup>asws</sup> are being increased (with knowledge) during the night of Friday"
    },
    "verse_count": 3,
    "verse_start_index": 649,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/104)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 650,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/737",
              "text": "حَدَّثَنِي أَحْمَدُ بْنُ إِدْرِيسَ الْقُمِّيُّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/678",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/644",
              "text": "مُوسَى بْنِ سَعْدَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/738",
              "text": "عَبْدِ اللَّهِ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/739",
              "text": "أَبِي يَحْيَى الصَّنْعَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حَدَّثَنِي أَحْمَدُ بْنُ إِدْرِيسَ الْقُمِّيُّ وَ مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ مُوسَى بْنِ سَعْدَانَ عَنْ عَبْدِ اللَّهِ بْنِ أَيُّوبَ عَنْ أَبِي يَحْيَى الصَّنْعَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:42:1",
        "text": [
          " قَالَ لِي يَا أَبَا يَحْيَى إِنَّ لَنَا فِي لَيَالِي الْجُمُعَةِ لَشَأْناً مِنَ الشَّأْنِ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ وَ مَا ذَاكَ الشَّأْنُ قَالَ يُؤْذَنُ لِأَرْوَاحِ الْأَنْبِيَاءِ الْمَوْتَى ( عليهم السلام ) وَ أَرْوَاحِ الْأَوْصِيَاءِ الْمَوْتَى وَ رُوحِ الْوَصِيِّ الَّذِي بَيْنَ ظَهْرَانَيْكُمْ يُعْرَجُ بِهَا إِلَى السَّمَاءِ حَتَّى تُوَافِيَ عَرْشَ رَبِّهَا فَتَطُوفَ بِهِ أُسْبُوعاً وَ تُصَلِّيَ عِنْدَ كُلِّ قَائِمَةٍ مِنْ قَوَائِمِ الْعَرْشِ رَكْعَتَيْنِ ثُمَّ تُرَدُّ إِلَى الْأَبْدَانِ الَّتِي كَانَتْ فِيهَا ",
          "فَتُصْبِحُ الْأَنْبِيَاءُ وَ الْأَوْصِيَاءُ قَدْ مُلِئُوا سُرُوراً وَ يُصْبِحُ الْوَصِيُّ الَّذِي بَيْنَ ظَهْرَانَيْكُمْ وَ قَدْ زِيدَ فِي عِلْمِهِ مِثْلُ جَمِّ الْغَفِيرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees Al Qummy and Muhammad Bin Yahya narrated to me, from Al Hassan Bin Al Al Kufy, from Musa Bin Sa’dan, from Abdullah Bin Ayoub, from Abu Yahya Al Sana’any, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said to me: ‘O Abu Yahya! For us<sup>asws</sup> during the nights of Friday is a special issue from the issues (to be dealt with)’. I said, ‘May I be sacrificed for you<sup>asws</sup>! And what is that special issue?’ He<sup>asws</sup> said: ‘It is Permitted for the soul of the deceased Prophets<sup>as</sup> and the souls of the deceased successors<sup>as</sup>, and soul of the successor<sup>asws</sup> who is apparent between you, that they<sup>as</sup> are ascended to the sky until they perform <span class=\"iTxt\">Tawaf</span> of the Throne of their<sup>as</sup> Lord<sup>azwj</sup>. So they perform <span class=\"iTxt\">Tawaf</span> of seven circuits of it and pray Salat of two cycles during every pillar from the pillars of the Throne. Then they are returned to their<sup>as</sup> respective bodies which they<sup>as</sup> used to be in. ",
            "So the Prophets<sup>as</sup> and the succesors<sup>as</sup> become filled with joy, and the successor<sup>asws</sup> who is apparent between you all become such that he<sup>asws</sup> is increased in his<sup>asws</sup> knowledge similar to abundant swarms (immensely)’."
          ],
          "en.sarwar": [
            " 1. Ahmad ibn Idris al-Qummi and Muhammad ibn Yahya have narrated from al-Hassan ibn Ali al-Kufi from Musa ibn Sa‘dan from ‘Abdallah ibn Ayyub from abu Yahya al-San‘ani from abu ‘Abdallah (a.s.) who has said the following. “O abu Yahya, on every Friday night there is a special task for us to pursue.” The narrator has said that he asked the Imams (a.s.), ““May Allah take my soul in service for your cause, of what nature is this special task?” The Imam (a.s.) said, “The spirits of the deceased prophets and the spirits of the deceased executors of the will of the prophets and the spirit of the executor of the will of the Holy Prophet living with you now are all taken to heavens until they arrive to the throne of their Lord and then walk around it seven times. They perform prayers near every column of the columns of the throne, in a two Rak‘at form after which they are returned to their bodies in which they were before. The prophets and the executors of the will of the prophets become full of joy and the executor of the will of the Holy Prophet living with you receives a huge increase I n his knowledge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/105)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 651,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/605",
              "text": "أَحْمَدَ بْنِ أَبِي زَاهِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/740",
              "text": "جَعْفَرِ بْنِ مُحَمَّدٍ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/741",
              "text": "يُوسُفَ الْأَبْزَارِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/384",
              "text": "الْمُفَضَّلِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ أَبِي زَاهِرٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْكُوفِيِّ عَنْ يُوسُفَ الْأَبْزَارِيِّ عَنِ الْمُفَضَّلِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:42:2",
        "text": [
          " قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ذَاتَ يَوْمٍ وَ كَانَ لَا يُكَنِّينِي قَبْلَ ذَلِكَ يَا أَبَا عَبْدِ اللَّهِ قَالَ قُلْتُ لَبَّيْكَ قَالَ إِنَّ لَنَا فِي كُلِّ لَيْلَةِ جُمُعَةٍ سُرُوراً قُلْتُ زَادَكَ اللَّهُ وَ مَا ذَاكَ قَالَ إِذَا كَانَ لَيْلَةُ الْجُمُعَةِ وَافَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْعَرْشَ وَ وَافَى الْأَئِمَّةُ ( عليهم السلام ) مَعَهُ وَ وَافَيْنَا مَعَهُمْ فَلَا تُرَدُّ أَرْوَاحُنَا إِلَى أَبْدَانِنَا إِلَّا بِعِلْمٍ مُسْتَفَادٍ وَ لَوْ لَا ذَلِكَ لَأَنْفَدْنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Abu Zahir, from Ja’far Bin Muhammad Al kufy, from Yusuf Al Abzary, from Al Mufazzal who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me one day, and he<sup>asws</sup> had not teknonymed me before that: ‘O Abu Abdullah!’ I said, ‘At your<sup>asws</sup> service!’. He<sup>asws</sup> said: ‘For us<sup>asws</sup>, during every night of Friday, there is joyfulness’. I said, ‘May Allah<sup>azwj</sup> Increase that for you<sup>asws</sup>! And what is that (joy)?’ He<sup>asws</sup> said: ‘Whenever it is a night of Friday, Rasool-Allah<sup>saww</sup> performs <span class=\"iTxt\">Tawaf</span> of the Throne and the Imams<sup>asws</sup> perform <span class=\"iTxt\">Tawaf</span> of the Throne along with him<sup>saww</sup>, and we<sup>asws</sup> perform <span class=\"iTxt\">Tawaf</span> along with them<sup>asws</sup>. So we<sup>asws</sup> do not return back to our<sup>asws</sup> bodies except with beneficial knowledge, and had it not been for that, it would deplete from us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Ahmad ibn abu Zahir from Ja‘far ibn Muhammad al-Kufi from Yusuf al-Abzari from al-Mufaddal who has said the following. “One day abu ‘Abdallah (a.s.) addressed me with a surname, “O abu ‘Abdallah, –he would address me this way before- and I responded, “Yes, O Imam, here I am.” He said, “Every Friday night it’s a time of happiness for us.” I said, “May Allah increase such a happiness for you. Of what nature is this happiness?” The Imam (a.s.) said, “When Friday night comes the Messenger of Allah arrives to the throne of Allah and the Imams (the leaders who has said the following. possess Divine authority) also arrive there with him and we also arrive with them. Our souls are returned back to our bodies only after receiving very new useful knowledge without which we would already be left without of knowledge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (106/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 652,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/325",
              "text": "سَلَمَةَ بْنِ الْخَطَّابِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/148",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/742",
              "text": "الْحُسَيْنِ بْنِ أَحْمَدَ الْمِنْقَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/743",
              "text": "يُونُسَ أَوِ الْمُفَضَّلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ أَحْمَدَ الْمِنْقَرِيِّ عَنْ يُونُسَ أَوِ الْمُفَضَّلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:42:3",
        "text": [
          " مَا مِنْ لَيْلَةِ جُمُعَةٍ إِلَّا وَ لِأَوْلِيَاءِ اللَّهِ فِيهَا سُرُورٌ قُلْتُ كَيْفَ ذَلِكَ جُعِلْتُ فِدَاكَ قَالَ إِذَا كَانَ لَيْلَةُ الْجُمُعَةِ وَافَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْعَرْشَ وَ وَافَى الْأَئِمَّةُ ( عليهم السلام ) وَ وَافَيْتُ مَعَهُمْ فَمَا أَرْجِعُ إِلَّا بِعِلْمٍ مُسْتَفَادٍ وَ لَوْ لَا ذَلِكَ لَنَفِدَ مَا عِنْدِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Kattab, from Abdullah Bin Muhammad, from Al Husayn Bin Ahmad Al Minqary, from Yunus, or Al Mufazzal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from a Friday night except that the Guardians<sup>asws</sup> of Allah<sup>azwj</sup> are joyful in it’. I said, ‘And how is that so, may I be sacrificed for you<sup>asws</sup>?’ He<sup>asws</sup> said:’ Whenever it is a Friday night, Rasool-Allah<sup>saww</sup> performs <span class=\"iTxt\">Tawaf</span> of the Throne, and the Imams<sup>asws</sup> perform <span class=\"iTxt\">Tawaf</span> of the Throne, and I<sup>asws</sup> perform <span class=\"iTxt\">Tawaf</span> along with them<sup>asws</sup>. So I<sup>asws</sup> do not return except with beneficial knowledge, and had it not been for that, it would deplete what is with me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Salama ibn al-Khattab from ‘Abdallah ibn Muhammad from al-Husayn ibn Ahmad al-Minqari from Yunus or al-Mufaddal from abu ‘Abdallah (a.s.) who has said the following. “There is no Friday night in which except that in it there is joy and happiness for those who possess Divine authority.” I asked, “How is it, “May Allah take my soul in service for your cause?” The Imam (a.s.) said, “When Frinday night comes the Messenger of Allah arrives to the throne with the Imams (a.s.) and I also arrive there with them. I do not return before receiving new knowledge without which I would have already be left without out of knowledge.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:42",
  "kind": "verse_list"
}