{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:1:4:45",
        "titles": {
          "ar": "باب نَادِرٌ فِيهِ ذِكْرُ الْغَيْبِ",
          "en": "Chapter 45 – In it is the Mention of the Unseen"
        }
      }
    ],
    "index": 103,
    "local_index": 45,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/al-kafi:1:4:46",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) إِذَا شَاءُوا أَنْ يَعْلَمُوا عُلِّمُوا",
          "en": "Chapter 46 – The Imams<sup>asws</sup>, whenever they<sup>asws</sup> desire to know (something), they<sup>asws</sup> know (it)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:1:4:44",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ الْأَئِمَّةَ</span> ( عليهم السلام ) يَعْلَمُونَ جَمِيعَ الْعُلُومِ الَّتِي خَرَجَتْ إِلَى الْمَلَائِكَةِ وَ الْأَنْبِيَاءِ وَ الرُّسُلِ ( عليهم السلام )",
          "en": "Chapter 44 – The Imams<sup>asws</sup> are knowing the entirety of the knowledges which came out to the Angels, and the Prophets<sup>as</sup> and the Rasools<sup>as</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:45",
    "titles": {
      "ar": "باب نَادِرٌ فِيهِ ذِكْرُ الْغَيْبِ",
      "en": "Chapter 45 – In it is the Mention of the Unseen"
    },
    "verse_count": 4,
    "verse_start_index": 660,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/110)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/30)"
        ],
        "index": 661,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:45:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُعَمَّرِ بْنِ خَلَّادٍ قَالَ سَأَلَ أَبَا الْحَسَنِ ( عليه السلام ) رَجُلٌ مِنْ أَهْلِ فَارِسَ فَقَالَ لَهُ أَ تَعْلَمُونَ الْغَيْبَ فَقَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يُبْسَطُ لَنَا الْعِلْمُ فَنَعْلَمُ وَ يُقْبَضُ عَنَّا فَلَا نَعْلَمُ ",
          "وَ قَالَ سِرُّ اللَّهِ عَزَّ وَ جَلَّ أَسَرَّهُ إِلَى جَبْرَئِيلَ ( عليه السلام ) وَ أَسَرَّهُ جَبْرَئِيلُ إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) وَ أَسَرَّهُ مُحَمَّدٌ إِلَى مَنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Moammar Bin Khallad who said, ",
            "‘A man from the people of Persia asked Abu Al-Hassan<sup>asws</sup> saying to him<sup>asws</sup>, ‘Are you knowing the knowledge of the unseen?’ So Abu Ja’far<sup>asws</sup> said: ‘The Knowledge is extended to us<sup>asws</sup>, so we<sup>asws</sup> know it, and it is Withheld from us<sup>asws</sup>, so we<sup>asws</sup> do not know it’. ",
            "And he<sup>asws</sup> said: ‘Secrets of Allah<sup>azwj</sup> Mighty and Majestic, He<sup>azwj</sup> Confided to JIbraeel<sup>as</sup>, and Jibraeel<sup>as</sup> confided to Muhammad<sup>saww</sup>, and Muhammad<sup>saww</sup> confided to the one whom Allah<sup>azwj</sup> so Desired’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from Mu’ammar ibn Khallad who has said that a man from Persia asked abu al-Hassan (a.s.) the following. “Do you know al-Ghayb (the hidden facts)?” The Imam (a.s.) said, “abu Ja‘far (a.s.) has said, ‘It opens to us then we know it and it is withheld from us then we do not know.” The Imam (a.s.) then said, “It is the secret of Allah, the Most Holy, the Most High, who has secretly given to Jibril and Jibril has secretly given to Muhammad (s.a.) and Muhammad (s.a.) has secretly given to whoever Allah wished.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/111)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 662,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:45:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ سَدِيرٍ الصَّيْرَفِيِّ قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَعْيَنَ يَسْأَلُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ بَدِيعُ السَّماواتِ وَ الْأَرْضِ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ ابْتَدَعَ الْأَشْيَاءَ كُلَّهَا بِعِلْمِهِ عَلَى غَيْرِ مِثَالٍ كَانَ قَبْلَهُ فَابْتَدَعَ السَّمَاوَاتِ وَ الْأَرَضِينَ وَ لَمْ يَكُنْ قَبْلَهُنَّ سَمَاوَاتٌ وَ لَا أَرَضُونَ أَ مَا تَسْمَعُ لِقَوْلِهِ تَعَالَى وَ كانَ عَرْشُهُ عَلَى الْماءِ ",
          "فَقَالَ لَهُ حُمْرَانُ أَ رَأَيْتَ قَوْلَهُ جَلَّ ذِكْرُهُ عالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى غَيْبِهِ أَحَداً فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِلَّا مَنِ ارْتَضى مِنْ رَسُولٍ وَ كَانَ وَ اللَّهِ مُحَمَّدٌ مِمَّنِ ارْتَضَاهُ وَ أَمَّا قَوْلُهُ عالِمُ الْغَيْبِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ عَالِمٌ بِمَا غَابَ عَنْ خَلْقِهِ فِيمَا يَقْدِرُ مِنْ شَيْ‏ءٍ وَ يَقْضِيهِ فِي عِلْمِهِ قَبْلَ أَنْ يَخْلُقَهُ وَ قَبْلَ أَنْ يُفْضِيَهُ إِلَى الْمَلَائِكَةِ ",
          "فَذَلِكَ يَا حُمْرَانُ عِلْمٌ مَوْقُوفٌ عِنْدَهُ إِلَيْهِ فِيهِ الْمَشِيئَةُ فَيَقْضِيهِ إِذَا أَرَادَ وَ يَبْدُو لَهُ فِيهِ فَلَا يُمْضِيهِ فَأَمَّا الْعِلْمُ الَّذِي يُقَدِّرُهُ اللَّهُ عَزَّ وَ جَلَّ فَيَقْضِيهِ وَ يُمْضِيهِ فَهُوَ الْعِلْمُ الَّذِي انْتَهَى إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ إِلَيْنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Abdullah Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Sadeyr Al Sayrafi who said, ",
            "‘I heard Humran Bin Ayn asking Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[2:117] Originator of the skies and the earth</span>. Abu Ja’far<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Begins the things, all of them, in His<sup>azwj</sup> Knowledge, upon without there being an example (for it) which there was before it. So He<sup>azwj</sup> Originated the skies and the firmaments, and there neither happened to be skies nor earths before it. Have you not listened to the Words of the Exalted <span class=\"ibTxt\">[11:7] and His Throne was upon the water</span>?’",
            "So Humran said to him<sup>asws</sup>, ‘What is your<sup>asws</sup> view of the Words of the Mighty and Majestic <span class=\"ibTxt\">[72:26] The Knower of the unseen! So He does not Reveal His secrets to any</span>?’ So Abu Ja’far<sup>asws</sup> said: ‘<span class=\"ibTxt\">[72:27] Except to him whom He chooses from the Messenger</span>. And it was so, by Allah<sup>azwj</sup>, Muhammad<sup>saww</sup> was from the ones He<sup>azwj</sup> Chose. And as for His<sup>azwj</sup> Words <span class=\"ibTxt\">[72:26] The Knower of the unseen! </span>So Allah<sup>azwj</sup> Mighty and Majestic is A Knower of whatever is unseen from His<sup>azwj</sup> creatures with regards to whatever He<sup>azwj</sup> Determines from something and Ordains it in His<sup>azwj</sup> Knowledge before He<sup>azwj</sup> Creates it, and before He<sup>azwj</sup> Exposed it to the Angels.",
            "So that, O Humran, is a Knowledge Paused in His<sup>azwj</sup> Presence. To it, with regards to it, is the Desire. So He<sup>azwj</sup> Ordains it whenever He<sup>azwj</sup> Intends and Originates for it regarding it, and He<sup>azwj</sup> Changes His<sup>azwj</sup> Decision for it with regards to it, so it is not Ordained. So, as for the knowledge which Allah<sup>azwj</sup> Mighty and Majestic Determines, so He<sup>azwj</sup> Ordains it, and Accomplishes it. So it is the Knowledge which ended up to Rasool-Allah<sup>saww</sup>, then to us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from ‘Abdallah ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Ali ibn Ri’ab from Sadir al-Sayrafi who has said that he heard Humran ibn A‘yan ask abu Ja‘far (a.s.) about the words of Allah, the Most Holy, the Most High Allah, “. . One Who is the Originator of the heavens and the earth. .” (6:101) Abu Ja‘far (a.s.) said, “Allah, the Most Holy, the Most High, originated all things through His knowledge in unprecedentedly. He Invented the heavens and eath and there was heavens and earths before. Have you not considered the words of Allah, “. .His Throne existed on water. .” (11:7) Humran then said, “Have you considered His words, Majestic is Whose mention, ‘He knows the unseen and He does not allow anyone to know His secrets. .” (72:26). Abu Ja‘far (a.s.) then said, “ except those of His Messengers whom He chooses. (72:26) Muhammad (s.a.), I swear by Allah, was one of those whom Allah had chosen. However, there are His words “He knows the hidden facts.” The fact that Allah, the Most Holy, the Most High, through what is hidden from His creatures of the things that He measures and determines and decrees in His knowledge before creating it and before assigning to the angels it is because of the following. O Humran, there is the knowledge withheld before Him in which He has a wish. He then decrees it when He wills. Bada’ may take place in it and He then will not decree it. The knowledge that, however, Allah, the Most Holy, the Most High, measures and determines and approves is the knowledge that reaches the Messenger of Allah and then it reaches us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (112/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 663,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:45:3",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ عَبَّادِ بْنِ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ سَدِيرٍ ",
          "قَالَ سَدِيرٌ فَلَمَّا أَنْ قَامَ مِنْ مَجْلِسِهِ وَ صَارَ فِي مَنْزِلِهِ دَخَلْتُ أَنَا وَ أَبُو بَصِيرٍ وَ مُيَسِّرٌ وَ قُلْنَا لَهُ جُعِلْنَا فِدَاكَ سَمِعْنَاكَ وَ أَنْتَ تَقُولُ كَذَا وَ كَذَا فِي أَمْرِ جَارِيَتِكَ وَ نَحْنُ نَعْلَمُ أَنَّكَ تَعْلَمُ عِلْماً كَثِيراً وَ لَا نَنْسُبُكَ إِلَى عِلْمِ الْغَيْبِ قَالَ فَقَالَ يَا سَدِيرُ أَ لَمْ تَقْرَأِ الْقُرْآنَ قُلْتُ بَلَى قَالَ فَهَلْ وَجَدْتَ فِيمَا قَرَأْتَ مِنْ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ قالَ الَّذِي عِنْدَهُ عِلْمٌ مِنَ الْكِتابِ أَنَا آتِيكَ بِهِ قَبْلَ أَنْ يَرْتَدَّ إِلَيْكَ طَرْفُكَ ",
          "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ قَدْ قَرَأْتُهُ قَالَ فَهَلْ عَرَفْتَ الرَّجُلَ وَ هَلْ عَلِمْتَ مَا كَانَ عِنْدَهُ مِنْ عِلْمِ الْكِتَابِ قَالَ قُلْتُ أَخْبِرْنِي بِهِ قَالَ قَدْرُ قَطْرَةٍ مِنَ الْمَاءِ فِي الْبَحْرِ الْأَخْضَرِ فَمَا يَكُونُ ذَلِكَ مِنْ عِلْمِ الْكِتَابِ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ مَا أَقَلَّ هَذَا فَقَالَ يَا سَدِيرُ مَا أَكْثَرَ هَذَا أَنْ يَنْسِبَهُ اللَّهُ عَزَّ وَ جَلَّ إِلَى الْعِلْمِ الَّذِي أُخْبِرُكَ بِهِ ",
          "يَا سَدِيرُ فَهَلْ وَجَدْتَ فِيمَا قَرَأْتَ مِنْ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ أَيْضاً قُلْ كَفى بِاللَّهِ شَهِيداً بَيْنِي وَ بَيْنَكُمْ وَ مَنْ عِنْدَهُ عِلْمُ الْكِتابِ قَالَ قُلْتُ قَدْ قَرَأْتُهُ جُعِلْتُ فِدَاكَ قَالَ أَ فَمَنْ عِنْدَهُ عِلْمُ الْكِتَابِ كُلُّهُ أَفْهَمُ أَمْ مَنْ عِنْدَهُ عِلْمُ الْكِتَابِ بَعْضُهُ قُلْتُ لَا بَلْ مَنْ عِنْدَهُ عِلْمُ الْكِتَابِ كُلُّهُ ",
          "قَالَ فَأَوْمَأَ بِيَدِهِ إِلَى صَدْرِهِ وَ قَالَ عِلْمُ الْكِتَابِ وَ اللَّهِ كُلُّهُ عِنْدَنَا عِلْمُ الْكِتَابِ وَ اللَّهِ كُلُّهُ عِنْدَنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Al Hassan, from Abbad Bin Suleyman, from Muhammad Bin Suleyman, from his father, from Sadeyr who said, ",
            "Sadeyr (the narrator) said, ‘So when he<sup>asws</sup> arose from his<sup>asws</sup> gathering and went to his<sup>asws</sup> house, I and Abu Baseer, and Muyassar went over and said to him<sup>asws</sup>, ‘May we be sacrificed for you<sup>asws</sup>! We heard you<sup>asws</sup> and you<sup>asws</sup> were saying such and such regarding the matter of your<sup>asws</sup> maid, and we know that you<sup>asws</sup> have a lot of knowledge, and we are not linking you<sup>asws</sup> to the knowledge of the unseen’. So he<sup>asws</sup> said: ‘O Sadeyr! Do you not read the Quran?’ I said, ‘Yes (I do)’. He<sup>asws</sup> said: ‘So did you find in what you read from the Book of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[27:40] The one who had the knowledge from the Book said: I will bring it to you in the blink of an eye</span>?",
            "He (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>! I have read it’. He<sup>asws</sup> said: ‘So do you recognise the man, and do you know what was with him from the knowledge of the Book?’ I said, ‘Inform me of it’. He<sup>asws</sup> said: ‘A measurement of a drop of water from the green ocean, so that is what happened to be from the knowledge of the Book’. I said, ‘May I be sacrificed for you<sup>asws</sup>! What little this is’ So he<sup>asws</sup> said: ‘O Sadeyr! What a lot this is if you were to link it to Allah<sup>azwj</sup> Mighty and Majestic to the Knowledge which I am about to inform you with it.",
            "O Sadeyr! So, did you find in what you read from the Book of Allah<sup>azwj</sup> Mighty and Majestic as well, <span class=\"ibTxt\">[13:43] Say: Allah is Sufficient as a Witness between me and you and the one who has Knowledge of the Book</span>?’ I said, ‘I have read it, may I be sacrificed for you<sup>asws</sup>!’ He<sup>asws</sup> said: ‘So, is the one with whom is the knowledge of the Book, all of it, more understanding, or the one with whom is knowledge of the Book, part of it?’ I said, ‘No, but the one with whom is the knowledge of the Book, all of it’. ",
            "He (the narrator) said, ‘So he<sup>asws</sup> gestured by his<sup>asws</sup> hand towards his<sup>asws</sup> chest and said: ‘The knowledge of the Book, by Allah<sup>azwj</sup>, all of it is with us<sup>asws</sup>! The knowledge of the Book, by Allah<sup>azwj</sup>, all of it is with us<sup>asws</sup>!’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Muhammad has narrated from Muhammad ibn al-Hassan from ‘Abbad ibn Sulayman from Muhammad ibn Sulayman from his father from Sadir who has said that he, abu Basir, Yahya al-Bazzaz and Dawud ibn Kathir were in the presence of abu ‘Abdallah (a.s.). The Imam (a.s.) came to us while he was angry. When he settled in his seat he then said, “How strange is it that certain people think we know the hidden facts. No one knows the hidden things except Allah, the Most Holy, the Most High. I thought to discipline our house maid, so and so, and could not find in which quarter she was.” Sadir has said, “When the meeting was over and the Imam (a.s.) went home, I, abu Basir and Muyassir went to his house. We said to him, “May Allah take our souls in service for your cause, we heard you say so and so about the matter of your house maid but we know that you have a great deal of knowledge. We do not say that you possess the knowledge of (al-Ghayb) hidden facts.” The narrator has said that the Imam (a.s.) said, “O Sadir, Do you not read the Holy Quran?” I said, “Yes, I do read the Holy Quran.” The Imam (a.s.) then asked, “In your reading have you found the following words of Allah, the Most Holy, the Most High? “The one who had knowledge from the Book said, “I can bring it to you before you even blink your eye. . .” (27:40) The narrator has said that he said that he has read those words. The Imam (a.s.) asked, “Do you know who the man is? Do you know how much knowledge of the Book he had?” The narrator has said that he asked the Imams (a.s.) “Please tell me about his knowledge.” The Imam (a.s.) said, “His knowledge of the Book was like one drop compared to the green ocean (Atlantic). The narrator has said that he said, “May Allah take my soul in service for your cause, that is very little..” The Imam (a.s.) then said, “O Sadir, say, “What a great knowledge is that when Allah, the Most Holy, the Most High, would ascribe to a knowledge that I am about to speak of to you. Have you found in the book of Allah, the Most Holy, the Most High, the following. “Say, “God and those who have the knowledge of the Book are sufficient witness (to my prophethood).” (13:43) The narrator has said that he said to the Imams (a.s.), “Yes. “May Allah take my soul in service for your cause, I have read it.” The Imam (a.s.) then said, “Is the knowledge of one who possesses the knowledge of the whole book greater or that of the one who possesses some knowledge of the Book?” I said, “The knowledge of one who possesses the knolwedge of the whole book is greater.” The narrator has said that the Imam (a.s.) pointing to his chest said, “The knowledge of the whole Book, I swear by Allah, is with us. The knowledge of the whole Book, I swear by Allah, is with us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (115/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 664,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:45:4",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ أَحْمَدَ بْنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارٍ السَّابَاطِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْإِمَامِ يَعْلَمُ الْغَيْبَ فَقَالَ لَا وَ لَكِنْ إِذَا أَرَادَ أَنْ يَعْلَمَ الشَّيْ‏ءَ أَعْلَمَهُ اللَّهُ ذَلِكَ "
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Al Hassan, from Ahmad Bin Al hassan Bin Ali, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, from Ammar Al Sabaty who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Imam<sup>asws</sup>, does he<sup>asws</sup> know the unseen?’ So he<sup>asws</sup> said: ‘No, but whenever he<sup>asws</sup> intends to know something, Allah<sup>azwj</sup> would let him<sup>asws</sup> know that’."
          ],
          "en.sarwar": [
            " 4. Ahmad ibn Muhammad has narrated from Muhammad ibn al-Hassan from Ahmad ibn a1-Hassan ibn Ali from ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqa from ‘Ammar al-Sabati who has said that he asked abu ‘Abdallah (a.s.) the following. “Dose the Imam have the knowledge of the hidden facts?” The Imam (a.s.) said, “No, he does not have such knowledge but if he would like to know about a thing Allah grants him such knowledge.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:45",
  "kind": "verse_list"
}