{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 48"
        },
        "path": "/books/al-kafi:1:4:48",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) يَعْلَمُونَ عِلْمَ مَا كَانَ وَ مَا يَكُونُ وَ أَنَّهُ لَا يَخْفَى عَلَيْهِمُ الشَّيْ‏ءُ صَلَوَاتُ اللَّهِ عَلَيْهِمْ",
          "en": "Chapter 48 – The Imams<sup>asws</sup> know the knowledge of whatever has happened, and whatever will be happening, and it is so that nothing is hidden from them<sup>asws</sup>, may the Salawat of Allah<sup>azwj</sup> be upon them<sup>asws</sup>"
        }
      }
    ],
    "index": 106,
    "local_index": 48,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 49"
        },
        "path": "/books/al-kafi:1:4:49",
        "titles": {
          "ar": "بَابُ أَنَّ اللَّهَ عَزَّ وَ جَلَّ لَمْ يُعَلِّمْ نَبِيَّهُ عِلْماً إِلَّا أَمَرَهُ أَنْ يُعَلِّمَهُ أَمِيرَ الْمُؤْمِنِينَ وَ أَنَّهُ كَانَ شَرِيكَهُ فِي الْعِلْمِ",
          "en": "Chapter 49 – Allah<sup>azwj</sup> Mighty and Majestic did not Teach His<sup>azwj</sup> Prophet<sup>saww</sup> a knowledge except that He<sup>azwj</sup> Commanded him<sup>asws</sup> that he<sup>saww</sup> teach it to Amir Al-Momineen<sup>asws</sup>, and he<sup>asws</sup> was his<sup>saww</sup> associate in the knowledge"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 47"
        },
        "path": "/books/al-kafi:1:4:47",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) يَعْلَمُونَ مَتَى يَمُوتُونَ وَ أَنَّهُمْ لَا يَمُوتُونَ إِلَّا بِاخْتِيَارٍ مِنْهُمْ",
          "en": "Chapter 47 – The Imams<sup>asws</sup> are knowing when they<sup>asws</sup> would be passing away, and they<sup>asws</sup> are not passing away except by a choice from them<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:48",
    "titles": {
      "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) يَعْلَمُونَ عِلْمَ مَا كَانَ وَ مَا يَكُونُ وَ أَنَّهُ لَا يَخْفَى عَلَيْهِمُ الشَّيْ‏ءُ صَلَوَاتُ اللَّهِ عَلَيْهِمْ",
      "en": "Chapter 48 – The Imams<sup>asws</sup> know the knowledge of whatever has happened, and whatever will be happening, and it is so that nothing is hidden from them<sup>asws</sup>, may the Salawat of Allah<sup>azwj</sup> be upon them<sup>asws</sup>"
    },
    "verse_count": 6,
    "verse_start_index": 675,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/129)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 676,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:48:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ مُحَمَّدٍ</span> وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ عَنْ سَيْفٍ التَّمَّارِ قَالَ كُنَّا مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَمَاعَةً مِنَ الشِّيعَةِ فِي الْحِجْرِ فَقَالَ عَلَيْنَا عَيْنٌ فَالْتَفَتْنَا يَمْنَةً وَ يَسْرَةً فَلَمْ نَرَ أَحَداً فَقُلْنَا لَيْسَ عَلَيْنَا عَيْنٌ فَقَالَ وَ رَبِّ الْكَعْبَةِ وَ رَبِّ الْبَنِيَّةِ ثَلَاثَ مَرَّاتٍ لَوْ كُنْتُ بَيْنَ مُوسَى وَ الْخَضِرِ لَأَخْبَرْتُهُمَا أَنِّي أَعْلَمُ مِنْهُمَا وَ لَأَنْبَأْتُهُمَا بِمَا لَيْسَ فِي أَيْدِيهِمَا لِأَنَّ مُوسَى وَ الْخَضِرَ ( عليه السلام ) أُعْطِيَا عِلْمَ مَا كَانَ وَ لَمْ يُعْطَيَا عِلْمَ مَا يَكُونُ وَ مَا هُوَ كَائِنٌ حَتَّى تَقُومَ السَّاعَةُ وَ قَدْ وَرِثْنَاهُ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وِرَاثَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad and Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ibrahim Bin Is’haq Al Ahmar, from Abdullah Bin Hammad, from Sayf Al Tammar who said, ",
            "‘We were with Abu Abdullah<sup>asws</sup> as a group of Shias in Al-Hijr, so he<sup>asws</sup> said to us: ‘Is there any (spying) eye upon us?’ So we turned right and left, but we did not see anyone, so we said, ‘There is no eye upon us’. So he<sup>asws</sup> said: ‘By the Lord<sup>azwj</sup> of the Kabah! By the Lord<sup>azwj</sup> of the Kabah!’ – three times, ‘Had I<sup>asws</sup> been between Musa<sup>as</sup> and Al-Khizr<sup>as</sup>, I<sup>asws</sup> would have informed them<sup>as</sup> both that I<sup>asws</sup> am more knowledgeable than the two of them<sup>as</sup>, and would have given them<sup>as</sup> the news of what wasn’t in their hands (knowledge), because Musa<sup>as</sup> and Al-Khizr<sup>as</sup> were both Given Knowledge of what had happened, and they<sup>as</sup> were not Given knowledge of what was happening and what was going to happen up to the Establishment of the Hour, and we<sup>asws</sup> have inherited it from Rasool-Allah<sup>saww</sup> as an inheritance’."
          ],
          "en.sarwar": [
            " 1. Ahmad ibn Muhammad and Muhammad ibn Yahya have narrated from Muhammad ibn al-Husayn from Ibrahim ibn Ishaq al-Ahmar from ‘Abdallah ibn Hammad from Sayf al-Tammar who has said that he with a group of Shi‘a were in the presence of abu ‘Abdallah (a.s.) in Hijr and the Imam (a.s.) said the following. “An eye is watching over us.” We then looked right and left and did not see anyone. We said, “No eye is watching over us.” The Imam (a.s.) said, “I swear by the Lord of the Ka‘ba. I swear by the Lord of the House.” He said so three times. “Had I been with Moses and al-Khidr I would have told them that I had more than they did and would have informed them of what they had no knowledge. This is because Moses and al-Khidr were given the knowledge of what was in the past and they were given the knowledge what will be in future or what will exist up to the Day of Judgment while we have inherited all of them from the Messenger of Allah as heirs.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (130/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 677,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:48:2",
        "refs": {
          "Mentions": [
            "/books/quran:16:89"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ وَ عِدَّةٍ مِنْ أَصْحَابِنَا مِنْهُمْ عَبْدُ الْأَعْلَى وَ أَبُو عُبَيْدَةَ وَ عَبْدُ اللَّهِ بْنُ بِشْرٍ الْخَثْعَمِيُّ سَمِعُوا أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنِّي لَأَعْلَمُ مَا فِي السَّمَاوَاتِ وَ مَا فِي الْأَرْضِ وَ أَعْلَمُ مَا فِي الْجَنَّةِ وَ أَعْلَمُ مَا فِي النَّارِ وَ أَعْلَمُ مَا كَانَ وَ مَا يَكُونُ ",
          "قَالَ ثُمَّ مَكَثَ هُنَيْئَةً فَرَأَى أَنَّ ذَلِكَ كَبُرَ عَلَى مَنْ سَمِعَهُ مِنْهُ فَقَالَ عَلِمْتُ ذَلِكَ مِنْ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فِيهِ تِبْيَانُ كُلِّ شَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Yunus Bin Yaqoub, from Al Haris Bin Al Mugheira and a number of our companions, from whom was Abdul A’ala and Abu Ubeyda and Abdullah Bin Bishr Al Khash’amy, ",
            "(All of them) having heard Abu Abdullah<sup>asws</sup> saying: ‘I<sup>asws</sup> am more knowing of what is in the skies and what is in the earth, and am more knowing of what is in the Paradise, and more knowing of what is in the Fire, and more knowing of what has already happened and what is going to happen’. ",
            "They (the narrators) said, ‘Then he<sup>asws</sup> waited for a while, and he<sup>asws</sup> saw that, that was grievous upon the ones who had heard it from him<sup>asws</sup>, so he<sup>asws</sup> said: ‘That is from the Book of Allah<sup>azwj</sup> Mighty and Majestic. Allah<sup>azwj</sup> Mighty and Majestic is Saying in it is a <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h89\">[16:89]</a> Clarification of everything</span>’."
          ],
          "en.sarwar": [
            " 2. A number of our people has narrated from Ahmad ibn Muhammad ibn Sinan from Yunus ibn Ya‘qub from al-Harith ibn al-Mughirah and a group of our people, among whom were ‘Abd al-A‘la’, abu ‘Ubaydah and ‘Abdallah ibn Bishr al-Khath‘ami, who have said that they heard abu ‘Abdallah (a.s.) say the following. “I certainly know what is the heavens and what is in the earth. I know what is in paradise and what is the fire. I know what was there and what will be there.” The narrator has said that the Imam (a.s.) paused for a while and found that what he had just said was much heavy for the audience then he (a.s.) said, “I learned all of it from the book of Allah, the Most Holy, the Most High. Allah, the Most Holy, the Most High, has said, “In it there is the clarification of all things.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعفه ابن النضايري   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/130)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 678,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:48:3",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ عَنْ جَمَاعَةَ بْنِ سَعْدٍ الْخَثْعَمِيِّ أَنَّهُ قَالَ كَانَ الْمُفَضَّلُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ الْمُفَضَّلُ جُعِلْتُ فِدَاكَ يَفْرِضُ اللَّهُ طَاعَةَ عَبْدٍ عَلَى الْعِبَادِ وَ يَحْجُبُ عَنْهُ خَبَرَ السَّمَاءِ قَالَ لَا اللَّهُ أَكْرَمُ وَ أَرْحَمُ وَ أَرْأَفُ بِعِبَادِهِ مِنْ أَنْ يَفْرِضَ طَاعَةَ عَبْدٍ عَلَى الْعِبَادِ ثُمَّ يَحْجُبَ عَنْهُ خَبَرَ السَّمَاءِ صَبَاحاً وَ مَسَاءً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl, from Ahmad Bin Muhammad Bin Abu Nasr, from Abdul Kareem, from Jam’a Bin Sa’ad Al Khashamy who said, ",
            "‘Al-Mufazzal was in the presence of Abu Abdullah<sup>asws</sup>, so Al-Mufazzal said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Does Allah<sup>azwj</sup> Necessitate the obedience of a servant upon the servants and Veils the news of the sky from him<sup>asws</sup>?’ He<sup>asws</sup> said: ‘No. Allah<sup>azwj</sup> is more Benevolent, and more Merciful, and more Kind than that He<sup>azwj</sup> would Necessitate the obedience of a servant upon the servants, then He<sup>azwj</sup> would Veil the news of the sky from him, morning and evening’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Muhammad has narrated from Sahl from Ahmad ibn Muhammad ibn Aabu Nasr from ‘Abd al-Karim from Jama‘a ibn Sa‘d al-Khath‘ami who has said that al-Mufaddal was in the presence of abu ‘Abdallah (a.s.). Al-Mufaddal asked the Imam (a.s.) the following. “May Allah, take my soul in service for your cause, does Allah command (his) servants to obey a servant and hide the news of the heavens from him?” The Imam (a.s.) said, Allah is by far much honorable, kind and caring towards His servants than to command them to obey a servant (of His) and then hide form him the news of the heavens mornings and evenings.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/131)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 679,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:48:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ ضُرَيْسٍ الْكُنَاسِيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ وَ عِنْدَهُ أُنَاسٌ مِنْ أَصْحَابِهِ عَجِبْتُ مِنْ قَوْمٍ يَتَوَلَّوْنَا وَ يَجْعَلُونَا أَئِمَّةً وَ يَصِفُونَ أَنَّ طَاعَتَنَا مُفْتَرَضَةٌ عَلَيْهِمْ كَطَاعَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ يَكْسِرُونَ حُجَّتَهُمْ وَ يَخْصِمُونَ أَنْفُسَهُمْ بِضَعْفِ قُلُوبِهِمْ فَيَنْقُصُونَا حَقَّنَا وَ يَعِيبُونَ ذَلِكَ عَلَى مَنْ أَعْطَاهُ اللَّهُ بُرْهَانَ حَقِّ مَعْرِفَتِنَا وَ التَّسْلِيمَ لِأَمْرِنَا",
          "أَ تَرَوْنَ أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى افْتَرَضَ طَاعَةَ أَوْلِيَائِهِ عَلَى عِبَادِهِ ثُمَّ يُخْفِي عَنْهُمْ أَخْبَارَ السَّمَاوَاتِ وَ الْأَرْضِ وَ يَقْطَعُ عَنْهُمْ مَوَادَّ الْعِلْمِ فِيمَا يَرِدُ عَلَيْهِمْ مِمَّا فِيهِ قِوَامُ دِينِهِمْ",
          "فَقَالَ لَهُ حُمْرَانُ جُعِلْتُ فِدَاكَ أَ رَأَيْتَ مَا كَانَ مِنْ أَمْرِ قِيَامِ عَلِيِّ بْنِ أَبِي طَالِبٍ وَ الْحَسَنِ وَ الْحُسَيْنِ ( عليهم السلام ) وَ خُرُوجِهِمْ وَ قِيَامِهِمْ بِدِينِ اللَّهِ عَزَّ ذِكْرُهُ وَ مَا أُصِيبُوا مِنْ قَتْلِ الطَّوَاغِيتِ إِيَّاهُمْ وَ الظَّفَرِ بِهِمْ حَتَّى قُتِلُوا وَ غُلِبُوا",
          "فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَا حُمْرَانُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَدْ كَانَ قَدَّرَ ذَلِكَ عَلَيْهِمْ وَ قَضَاهُ وَ أَمْضَاهُ وَ حَتَمَهُ عَلَى سَبِيلِ الِاخْتِيَارِ ثُمَّ أَجْرَاهُ فَبِتَقَدُّمِ عِلْمٍ إِلَيْهِمْ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَامَ عَلِيٌّ وَ الْحَسَنُ وَ الْحُسَيْنُ ( عليهم السلام ) وَ بِعِلْمٍ صَمَتَ مَنْ صَمَتَ مِنَّا",
          "وَ لَوْ أَنَّهُمْ يَا حُمْرَانُ حَيْثُ نَزَلَ بِهِمْ مَا نَزَلَ مِنْ أَمْرِ اللَّهِ عَزَّ وَ جَلَّ وَ إِظْهَارِ الطَّوَاغِيتِ عَلَيْهِمْ سَأَلُوا اللَّهَ عَزَّ وَ جَلَّ أَنْ يَدْفَعَ عَنْهُمْ ذَلِكَ وَ أَلَحُّوا عَلَيْهِ فِي طَلَبِ إِزَالَةِ مُلْكِ الطَّوَاغِيتِ وَ ذَهَابِ مُلْكِهِمْ إِذاً لَأَجَابَهُمْ وَ دَفَعَ ذَلِكَ عَنْهُمْ ثُمَّ كَانَ انْقِضَاءُ مُدَّةِ الطَّوَاغِيتِ وَ ذَهَابُ مُلْكِهِمْ أَسْرَعَ مِنْ سِلْكٍ مَنْظُومٍ انْقَطَعَ فَتَبَدَّدَ",
          "وَ مَا كَانَ ذَلِكَ الَّذِي أَصَابَهُمْ يَا حُمْرَانُ لِذَنْبٍ اقْتَرَفُوهُ وَ لَا لِعُقُوبَةِ مَعْصِيَةٍ خَالَفُوا اللَّهَ فِيهَا وَ لَكِنْ لِمَنَازِلَ وَ كَرَامَةٍ مِنَ اللَّهِ أَرَادَ أَنْ يَبْلُغُوهَا فَلَا تَذْهَبَنَّ بِكَ الْمَذَاهِبُ فِيهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Zurey Al Kunasy who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying, and in his<sup>asws</sup> presence were people from his<sup>asws</sup> companions: ‘I<sup>asws</sup> am astounded from a group of people who are befriending us<sup>asws</sup> and making us<sup>asws</sup> to be their Imams<sup>asws</sup>, and are describing that obedience to us<sup>asws</sup> is a necessity upon them just like the obedience to Rasool-Allah<sup>saww</sup>, then they are breaking their own arguments and are debating against themselves due to their weak hearts, so they are being deficient in our<sup>asws</sup> rights, and they are (then) faulting that upon the ones whom Allah<sup>azwj</sup> has Granted the substantiation of the right of our<sup>asws</sup> recognition, and the submission to our<sup>asws</sup> orders. ",
            "Are you viewing that Allah<sup>azwj</sup> Blessed and High would Necessitate the obedience to His<sup>azwj</sup> Guardians<sup>asws</sup> upon His<sup>azwj</sup> servants, then He<sup>azwj</sup> would Hide the news of the skies and the earth and cut-off the Mine of the Knowledge from them<sup>asws</sup>, regarding what is referred to them<sup>asws</sup> from what wherein is the straightness of their Religion?’ ",
            "So Humran said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! What is your<sup>asws</sup> view of what was from the matter of the risings of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and their<sup>asws</sup> coming out and their<sup>asws</sup> rising with the Religion of Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, and what hit them<sup>asws</sup> from the tyrants murdering them<sup>asws</sup> and being victorious with them<sup>asws</sup> until they murdered and overcame?’ ",
            "So Abu Ja’far<sup>asws</sup> said: ‘O Humran! Allah<sup>azwj</sup> Blessed and High had already Determined that upon them<sup>asws</sup>, and Ordained it, and Accomplished it, and Made it to be inevitable upon the way of the choice (by them<sup>asws</sup>). Then He<sup>azwj</sup> Caused it to flow. Thus, it was by the preceding of knowledge to them<sup>asws</sup> from Rasool-Allah<sup>saww</sup> that Ali<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup> arose, but (on the other hand) it was due to (that) knowledge remains silent, the one<sup>asws</sup> from us<sup>asws</sup> who is silent.",
            "And had they<sup>asws</sup>, O Humran, when it descended with them what descended from Allah<sup>azwj</sup> Mighty and Majestic, and the victories of the tyrants upon them<sup>asws</sup>, asked Allah<sup>azwj</sup> Mighty and Majestic that He<sup>azwj</sup> Defends them<sup>asws</sup> from that, and insisted upon it with regards to the decline of the kingdoms of the tyrants and the annihilation of their kingdoms, then He<sup>azwj</sup> would have Answered them<sup>asws</sup> and Defended them<sup>asws</sup> from that, then it would have been so that the expiry of the duration of the tyrants and the annihilation of their kingdoms would have been quicker than the dispersal of the beads when their string is cut off, so it would have dispersed.  ",
            "And it was not so, that, that which hit them<sup>asws</sup>, O Humran, was neither due to sins they<sup>asws</sup> had committed nor was it a Punishment due to disobedience opposing Allah<sup>azwj</sup> therein, but it was due to the status and Benevolence from Allah<sup>azwj</sup> Intending that they<sup>asws</sup> reach it. Therefore, do not let the (false) principles take you to be among them’ (who oppose the truth)."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from Durays al-Kunasi who has said that he heard abu Ja‘far (a.s.) the following to an audience of his companions. “What an strange case is the case with a group of followers! They acknowledge us as the Divine authority over themselves, accept us as their Imam and say that obedience to us is obligatory just as is the case with the Messenger of Allah. They then destroy the veracity of their belief as such and dispute against their own selves due to weakness of their hearts. They then diminish our right and blame those whom Allah has granted evidence to know us as it should be and the (abulity) to submit themselves to our Divine authority. Do you not consider that how would Allah, the Most Holy, the Most High, make it obligatory to obey those who possess Divine authority over his servants and then hide from them (people who possess Divine authority) `the new of the heaves and the earth? How would He cut them off of the sources of knowledge that might come to them to maintain their religion?” Humran then said to the Imam (a.s.), “May Allah, take my soul in service for your cause, how would you explain the case of the uprising of Ali ibn abu Talib, al-Hassan and al-Husayn (a.s.)? They came out and rose up for the cause of Allah, Whose mention is so Majestic. How much they suffered and how mercilessly were they murdered at the hands of the rebels? They were defeated, murdered and over powered.” Abu Ja‘far (a.s.) then said, “O Humran, Allah, the Most Holy, the Most High, had determined it on them. He had decreed, approved and made it unavoidable though the voluntary manner. He then allowed to take place. It, thus, happened with a pre-existing knowledge that had come to them from the Messenger of Allah. Ali al-Hassan and al-Husayn (a.s.) rose up for the cause of Allah with full knowledge of the consequences and remained silent from us those who remained silent. Had they, O Humran, when facing what Allah, the Most Holy, the Most High, made them to face and suffer defeat at the hands of the rebels, asked Allah, the Most Holy, the Most High, to remove their suffering and would implore Him to destroy the government and kingdom of the rebels He would have answered their prayers and would grant them relief. In such case the destruction of the governments of the rebels and the ending of their time would take place quicker than the dispersal under a great pressure, of beads threaded together. The suffering, O Humran, that befell them, because of the sins that they might have committed or the punishment for their opposition to Allah. It was because of the high marvelous position that Allah had prepared and wanted them to reaCh Do not let people’s opinions take you away from the right path.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/133)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 680,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:48:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) بِمِنًى عَنْ خَمْسِمِائَةِ حَرْفٍ مِنَ الْكَلَامِ فَأَقْبَلْتُ أَقُولُ يَقُولُونَ كَذَا وَ كَذَا قَالَ فَيَقُولُ قُلْ كَذَا وَ كَذَا قُلْتُ جُعِلْتُ فِدَاكَ هَذَا الْحَلَالُ وَ هَذَا الْحَرَامُ أَعْلَمُ أَنَّكَ صَاحِبُهُ وَ أَنَّكَ أَعْلَمُ النَّاسِ بِهِ وَ هَذَا هُوَ الْكَلَامُ فَقَالَ لِي وَيْكَ يَا هِشَامُ لَا يَحْتَجُّ اللَّهُ تَبَارَكَ وَ تَعَالَى عَلَى خَلْقِهِ بِحُجَّةٍ لَا يَكُونُ عِنْدَهُ كُلُّ مَا يَحْتَاجُونَ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from Hisham Bin Al Hakam who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> at Mina about the five hundred letters (sentences/questions) from the theology. So I turned saying, ‘They are saying such and such’. He<sup>asws</sup> said: ‘So they are saying, ‘Say such and such?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! This is Permissible, and this is Prohibited. I know that you<sup>asws</sup> are its master and that you<sup>asws</sup> are more knowledgeable of the people with it, and this, it is the theology’. So he<sup>asws</sup> said to me: ‘Woe be unto you, O Hisham! Allah<sup>azwj</sup> Blessed and High does not Impose any duty upon His<sup>azwj</sup> creatures without first providing them all that which they need to comply with those (very) Commands’."
          ],
          "en.sarwar": [
            " 5. Ali ibn Ibrahim has narrated from his father from Ali ibn Ma‘bad from Hisham ibn al-Hakam who has said the following. “I asked abu ‘Abdallah (a.s.) at Mina five hundred letters from al-Kalam (theology). I asked the Imam (a.s.), “They say that he has said so and so.” Then he says, “You say so and so.” I then said to the Imam (a.s.), “May Allah, take my soul in service for your cause, “This is lawful and that is not lawful. I know that you are the authority in this and you are the most knowledgeable person in it and this is al-Kalam.” The Imam (a.s.) said to me, “O poor, Hisham, Allah, the Most Holy, the Most High, does not require any duty from His creatures without first availing them all that they need to comply with the command.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (134/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 681,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:48:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ لَا وَ اللَّهِ لَا يَكُونُ عَالِمٌ جَاهِلًا أَبَداً عَالِماً بِشَيْ‏ءٍ جَاهِلًا بِشَيْ‏ءٍ ",
          "ثُمَّ قَالَ اللَّهُ أَجَلُّ وَ أَعَزُّ وَ أَكْرَمُ مِنْ أَنْ يَفْرِضَ طَاعَةَ عَبْدٍ يَحْجُبُ عَنْهُ عِلْمَ سَمَائِهِ وَ أَرْضِهِ ثُمَّ قَالَ لَا يَحْجُبُ ذَلِكَ عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Umar Bin Abdul Aziz, from Muhammad Bin Al Fuzayl, from Abu Hamza who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘No, by Allah<sup>azwj</sup>! A knowledgeable one<sup>asws</sup> cannot happen to be ignorant, ever, that he<sup>asws</sup> would be a knower of something and be ignorant of something’.",
            "Then he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is more Majestic, and more Mighty, and more Benevolent than that He<sup>azwj</sup> would Necessitate the obedience of a servant, and then Veil from him<sup>asws</sup> the knowledge of His<sup>azwj</sup> sky and His<sup>azwj</sup> earth’. Then he<sup>asws</sup> said: (Indeed) ‘Nothing is Hidden from him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Umar ibn ‘Abd al-‘Aziz from Muhammad ibn al-Fudayl from abu Hamzah who has that he heard abu Ja‘far (a.s.) say the following. “No, I swear by Allah, the scholar (who possesses Divine authority) is never ignorant or knowledgeable in something and ignorant of other things. The Imam (a.s.) then said, “Allah, the Most Holy, Most High and Most Gracious, is far exalted and above imposing the obedience of a servant (of His) on the others and then hide the knowledge of things in the heavens and on earth from him and then say, “Do not hide that from him.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:48",
  "kind": "verse_list"
}