{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 52"}, "path": "/books/al-kafi:1:4:52", "titles": {"ar": "بَابُ التَّفْوِيضِ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِلَى الْأَئِمَّةِ ( عليهم السلام ) فِي أَمْرِ الدِّينِ", "en": "Chapter 52 – The Authorising to Rasool-Allah<sup>saww</sup> and to the Imams<sup>asws</sup> regarding the command of the Religion"}}], "index": 110, "local_index": 52, "part_type": "Chapter", "path": "/books/al-kafi:1:4:52", "titles": {"ar": "بَابُ التَّفْوِيضِ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِلَى الْأَئِمَّةِ ( عليهم السلام ) فِي أَمْرِ الدِّينِ", "en": "Chapter 52 – The Authorising to Rasool-Allah<sup>saww</sup> and to the Imams<sup>asws</sup> regarding the command of the Religion"}, "verse_count": 10, "verse_start_index": 689, "verses": [{"index": 690, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:52:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ أَبِي زَاهِرٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي إِسْحَاقَ النَّحْوِيِّ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَمِعْتُهُ يَقُولُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَدَّبَ نَبِيَّهُ عَلَى مَحَبَّتِهِ فَقَالَ وَ إِنَّكَ لَعَلى خُلُقٍ عَظِيمٍ ثُمَّ فَوَّضَ إِلَيْهِ فَقَالَ عَزَّ وَ جَلَّ وَ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا وَ قَالَ عَزَّ وَ جَلَّ مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ اللَّهَ \nقَالَ ثُمَّ قَالَ وَ إِنَّ نَبِيَّ اللَّهِ فَوَّضَ إِلَى عَلِيٍّ وَ ائْتَمَنَهُ فَسَلَّمْتُمْ وَ جَحَدَ النَّاسُ فَوَ اللَّهِ لَنُحِبُّكُمْ أَنْ تَقُولُوا إِذَا قُلْنَا وَ أَنْ تَصْمُتُوا إِذَا صَمَتْنَا وَ نَحْنُ فِيمَا بَيْنَكُمْ وَ بَيْنَ اللَّهِ عَزَّ وَ جَلَّ مَا جَعَلَ اللَّهُ لِأَحَدٍ خَيْراً فِي خِلَافِ أَمْرِنَا .\nعِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي إِسْحَاقَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ ثُمَّ ذَكَرَ نَحْوَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Abu Zahir, from Ali Bin Ismail, from Safwan Bin Yahya, from Aaim Bin Humeyd, from Abu Is’haq Al Nahwy who said, \n‘I went over to Abu Abdullah<sup>asws</sup>, and I heard him<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic Educated His<sup>azwj</sup> Prophet<sup>saww</sup> upon His<sup>azwj</sup> Love, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[68:4] And you are upon magnificent morals</span>. Then He<sup>azwj</sup> Authorised to him<sup>saww</sup>, so the Mighty and Majestic Said <span class=\"ibTxt\">[59:7] and whatever the Rasool gives you, accept it, and from whatever he forbids you, keep back</span>.  And the Mighty and Majestic Said <span class=\"ibTxt\">[4:80] Whoever obeys the Rasool, so he has obeyed Allah</span>’.\nHe (the narrator) said, ‘Then he<sup>asws</sup> said: ‘And the Prophet<sup>saww</sup> of Allah<sup>azwj</sup> authorised it to Ali<sup>asws</sup> and entrusted him<sup>asws</sup>. So you (Shias) submitted and the people rejected. So, by Allah<sup>azwj</sup>, we<sup>asws</sup> would love it if you all would be saying when we<sup>asws</sup> say, and that you should be silent when we<sup>asws</sup> are silent, and we<sup>asws</sup> are in what is between you all and Allah<sup>azwj</sup> Mighty and Majestic. Allah<sup>azwj</sup> had not Made goodness to be for anyone in opposition to our<sup>asws</sup> orders’. \nA number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Najran, from Aasim Bin Humeyd, from Abu Is’haq who said, \n‘I heard Abu Ja’far<sup>asws</sup> saying’, then he mentioned similar to it’."}]}, {"index": 691, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:52:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ يَحْيَى بْنِ أَبِي عِمْرَانَ عَنْ يُونُسَ عَنْ بَكَّارِ بْنِ بَكْرٍ عَنْ مُوسَى بْنِ أَشْيَمَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلَهُ رَجُلٌ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ فَأَخْبَرَهُ بِهَا ثُمَّ دَخَلَ عَلَيْهِ دَاخِلٌ فَسَأَلَهُ عَنْ تِلْكَ الْآيَةِ فَأَخْبَرَهُ بِخِلَافِ مَا أَخْبَرَ بِهِ الْأَوَّلَ فَدَخَلَنِي مِنْ ذَلِكَ مَا شَاءَ اللَّهُ حَتَّى كَأَنَّ قَلْبِي يُشْرَحُ بِالسَّكَاكِينِ \nفَقُلْتُ فِي نَفْسِي تَرَكْتُ أَبَا قَتَادَةَ بِالشَّامِ لَا يُخْطِئُ فِي الْوَاوِ وَ شِبْهِهِ وَ جِئْتُ إِلَى هَذَا يُخْطِئُ هَذَا الْخَطَأَ كُلَّهُ فَبَيْنَا أَنَا كَذَلِكَ إِذْ دَخَلَ عَلَيْهِ آخَرُ فَسَأَلَهُ عَنْ تِلْكَ الْآيَةِ فَأَخْبَرَهُ بِخِلَافِ مَا أَخْبَرَنِي وَ أَخْبَرَ صَاحِبَيَّ فَسَكَنَتْ نَفْسِي فَعَلِمْتُ أَنَّ ذَلِكَ مِنْهُ تَقِيَّةٌ \nقَالَ ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ لِي يَا ابْنَ أَشْيَمَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَوَّضَ إِلَى سُلَيْمَانَ بْنِ دَاوُدَ فَقَالَ هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ وَ فَوَّضَ إِلَى نَبِيِّهِ ( صلى الله عليه وآله ) فَقَالَ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا فَمَا فَوَّضَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَدْ فَوَّضَهُ إِلَيْنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Yahya Bin Abu Imran, from Yunus, from Bakkar Bin Bakr, from Musa Bin Asheym who said, \n‘I was in the presence of Abu Abdullah<sup>asws</sup>, and a man asked him<sup>asws</sup> about a Verse from the Book of Allah<sup>azwj</sup> Mighty and Majestic. So he<sup>asws</sup> informed him about it. Then an entering one entered and asked him<sup>asws</sup> about that very Verse. So he<sup>asws</sup> informed him differently with what he<sup>asws</sup> had informed the first one with. So there entered into me due to that, whatever Allah<sup>azwj</sup> so Desired, until it was as if my heart was being shredded with the knives. \nSo I said within myself, ‘I neglected Abu Qatada in Syria who did not even err regarding the (letter) <span class=\"iTxt\">Waaw</span> and the likes of it, and I came over to this one<sup>asws</sup>, who errs with all these mistakes?’ So while I was like that when another one entered and asked him<sup>asws</sup> about that very Verse. So he<sup>asws</sup> informed him differently to what he<sup>asws</sup> had informed me and informed my companion with. So myself calmed down, and I knew that, that was from him<sup>asws</sup> in ‘تَقِيَّةٌ’ dissimulation. \nHe said, ‘Then he<sup>asws</sup> turned towards me, so he<sup>asws</sup> said to me: ‘O Ibn Asheym! Allah<sup>azwj</sup> Mighty and Majestic Authorised to Suleyman<sup>as</sup> Bin Dawood<sup>as</sup>, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[38:39] This is Our Gift, therefore give out freely without measure</span>, <span class=\"ibTxt\">or withhold</span><span class=\"iTxt\">.</span> And He<sup>azwj</sup> Authorised to His<sup>azwj</sup> Prophet<sup>saww</sup>, so He<sup>azwj</sup> Said: ‘<span class=\"ibTxt\">[59:7] and whatever the Rasool gives you, accept it, and from whatever he forbids you, keep back</span>. Thus, whatever was Authorised to Rasool-Allah<sup>saww</sup>, so it has been Authorised to us<sup>asws</sup>’."}]}, {"index": 692, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:52:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ ثَعْلَبَةَ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ وَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولَانِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَوَّضَ إِلَى نَبِيِّهِ ( صلى الله عليه وآله ) أَمْرَ خَلْقِهِ لِيَنْظُرَ كَيْفَ طَاعَتُهُمْ ثُمَّ تَلَا هَذِهِ الْآيَةَ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Hajjal, from Sa’alba, from Zurara who said, \n‘I heard Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both saying: ‘Allah<sup>azwj</sup> Mighty and Majestic Authorised to His<sup>azwj</sup> Prophet<sup>saww</sup> and the affairs of His<sup>azwj</sup> creatures in order to See how their obedience would be’. Then he<sup>asws</sup> recited this Verse <span class=\"ibTxt\">[59:7] and whatever the Rasool gives you, accept it, and from whatever he forbids you, keep back</span>’."}]}, {"index": 693, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:52:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ فُضَيْلِ بْنِ يَسَارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لِبَعْضِ أَصْحَابِ قَيْسٍ الْمَاصِرِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَدَّبَ نَبِيَّهُ فَأَحْسَنَ أَدَبَهُ فَلَمَّا أَكْمَلَ لَهُ الْأَدَبَ قَالَ إِنَّكَ لَعَلى خُلُقٍ عَظِيمٍ ثُمَّ فَوَّضَ إِلَيْهِ أَمْرَ الدِّينِ وَ الْأُمَّةِ لِيَسُوسَ عِبَادَهُ فَقَالَ عَزَّ وَ جَلَّ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا \nوَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ مُسَدَّداً مُوَفَّقاً مُؤَيَّداً بِرُوحِ الْقُدُسِ لَا يَزِلُّ وَ لَا يُخْطِئُ فِي شَيْ‏ءٍ مِمَّا يَسُوسُ بِهِ الْخَلْقَ فَتَأَدَّبَ بِآدَابِ اللَّهِ\nثُمَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ الصَّلَاةَ رَكْعَتَيْنِ رَكْعَتَيْنِ عَشْرَ رَكَعَاتٍ فَأَضَافَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَى الرَّكْعَتَيْنِ رَكْعَتَيْنِ وَ إِلَى الْمَغْرِبِ رَكْعَةً فَصَارَتْ عَدِيلَ الْفَرِيضَةِ لَا يَجُوزُ تَرْكُهُنَّ إِلَّا فِي سَفَرٍ وَ أَفْرَدَ الرَّكْعَةَ فِي الْمَغْرِبِ فَتَرَكَهَا قَائِمَةً فِي السَّفَرِ وَ الْحَضَرِ فَأَجَازَ اللَّهُ عَزَّ وَ جَلَّ لَهُ ذَلِكَ كُلَّهُ فَصَارَتِ الْفَرِيضَةُ سَبْعَ عَشْرَةَ رَكْعَةً\nثُمَّ سَنَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) النَّوَافِلَ أَرْبَعاً وَ ثَلَاثِينَ رَكْعَةً مِثْلَيِ الْفَرِيضَةِ فَأَجَازَ اللَّهُ عَزَّ وَ جَلَّ لَهُ ذَلِكَ وَ الْفَرِيضَةُ وَ النَّافِلَةُ إِحْدَى وَ خَمْسُونَ رَكْعَةً مِنْهَا رَكْعَتَانِ بَعْدَ الْعَتَمَةِ جَالِساً تُعَدُّ بِرَكْعَةٍ مَكَانَ الْوَتْرِ\nوَ فَرَضَ اللَّهُ فِي السَّنَةِ صَوْمَ شَهْرِ رَمَضَانَ وَ سَنَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) صَوْمَ شَعْبَانَ وَ ثَلَاثَةَ أَيَّامٍ فِي كُلِّ شَهْرٍ مِثْلَيِ الْفَرِيضَةِ فَأَجَازَ اللَّهُ عَزَّ وَ جَلَّ لَهُ ذَلِكَ\nوَ حَرَّمَ اللَّهُ عَزَّ وَ جَلَّ الْخَمْرَ بِعَيْنِهَا وَ حَرَّمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمُسْكِرَ مِنْ كُلِّ شَرَابٍ فَأَجَازَ اللَّهُ لَهُ ذَلِكَ كُلَّهُ\nوَ عَافَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَشْيَاءَ وَ كَرِهَهَا وَ لَمْ يَنْهَ عَنْهَا نَهْيَ حَرَامٍ إِنَّمَا نَهَى عَنْهَا نَهْيَ إِعَافَةٍ وَ كَرَاهَةٍ ثُمَّ رَخَّصَ فِيهَا فَصَارَ الْأَخْذُ بِرُخَصِهِ وَاجِباً عَلَى الْعِبَادِ كَوُجُوبِ مَا يَأْخُذُونَ بِنَهْيِهِ وَ عَزَائِمِهِ وَ لَمْ يُرَخِّصْ لَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِيمَا نَهَاهُمْ عَنْهُ نَهْيَ حَرَامٍ وَ لَا فِيمَا أَمَرَ بِهِ أَمْرَ فَرْضٍ لَازِمٍ \nفَكَثِيرُ الْمُسْكِرِ مِنَ الْأَشْرِبَةِ نَهَاهُمْ عَنْهُ نَهْيَ حَرَامٍ لَمْ يُرَخِّصْ فِيهِ لِأَحَدٍ وَ لَمْ يُرَخِّصْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِأَحَدٍ تَقْصِيرَ الرَّكْعَتَيْنِ اللَّتَيْنِ ضَمَّهُمَا إِلَى مَا فَرَضَ اللَّهُ عَزَّ وَ جَلَّ بَلْ أَلْزَمَهُمْ ذَلِكَ إِلْزَاماً وَاجِباً لَمْ يُرَخِّصْ لِأَحَدٍ فِي شَيْ‏ءٍ مِنْ ذَلِكَ إِلَّا لِلْمُسَافِرِ وَ لَيْسَ لِأَحَدٍ أَنْ يُرَخِّصَ شَيْئاً مَا لَمْ يُرَخِّصْهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) \nفَوَافَقَ أَمْرُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَمْرَ اللَّهِ عَزَّ وَ جَلَّ وَ نَهْيُهُ نَهْيَ اللَّهِ عَزَّ وَ جَلَّ وَ وَجَبَ عَلَى الْعِبَادِ التَّسْلِيمُ لَهُ كَالتَّسْلِيمِ لِلَّهِ تَبَارَكَ وَ تَعَالَى .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Fuzayl Bin Yasar who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying to one of his<sup>asws</sup> companions Qays Al-Masir: ‘Allah<sup>azwj</sup> Mighty and Majestic Educated His<sup>azwj</sup> Prophet<sup>saww</sup>, so excellent was his<sup>saww</sup> education. So when He<sup>azwj</sup> Completed the education for him<sup>saww</sup>, He<sup>azwj</sup> Said <span class=\"ibTxt\">[68:4] And you are upon magnificent morals</span>. Then He<sup>azwj</sup> Authorised to him<sup>saww</sup> the matters of the Religion and the nation in order for him<sup>saww</sup> to deal with the social affairs of His<sup>azwj</sup> servants, so He<sup>azwj</sup> the Mighty and Majestic Said <span class=\"ibTxt\">[59:7] and whatever the Rasool gives you, accept it, and from whatever he forbids you, keep back</span>.\nAnd that Rasool-Allah<sup>saww</sup> was Protected, Made to be successful, Assisted by the Holy Spirit. He<sup>saww</sup> neither made a slip nor a mistake with regards to anything from what he<sup>saww</sup> dealt with the social affairs of the creatures. Thus, was he<sup>saww</sup> Educated by the Education of Allah<sup>azwj</sup>.\nThen Allah<sup>azwj</sup> Mighty and Majestic Necessitated the <span class=\"iTxt\">Salāt</span>, two Cycles, two Cycles, being ten Cycles (per day). So Rasool-Allah<sup>saww</sup> doubled it by two Cycles, two Cycles, and to Al-Maghrib, added one Cycle. So these became equal to the Obligatory ones. It is not allowed to neglect these except during a journey, and the individual Cycle regarding Al-Maghrib, so it is left standing during the journey and staying as such. So Allah<sup>azwj</sup> Mighty and Majestic Allowed that for him<sup>saww</sup>, all of it, so the Obligatory came to be seventeen Cycles.\nThen Rasool-Allah<sup>saww</sup> made a Sunnah of the optional (<span class=\"iTxt\">Salāt</span>) of thirty four Cycles, twice the like of the Obligatory. So Allah<sup>azwj</sup> Mighty and Majestic Allowed that for him<sup>saww</sup>. And the Obligatory and the optional are fifty-one (51) Cycles – from these are two Cycles after the (fall of) darkness, seated, counted as one Cycle in place of Al-Witr. \nAnd Allah<sup>azwj</sup> Necessitated regarding the Fasts of the Month of Ramazan, and Rasool-Allah<sup>saww</sup> made Fasts of (the month of) Shaban, and three days during every month being like of twice the Obligatory ones. So Allah<sup>azwj</sup> Mighty and Majestic Authorise Authorised that for him<sup>saww</sup>. \nAnd Allah<sup>azwj</sup> Mighty and Majestic Prohibited the wine exactly, and Rasool-Allah<sup>saww</sup> Prohibited the intoxicants from every drink. So Allah<sup>azwj</sup> Allowed that for him<sup>saww</sup>, all of it. \nAnd Rasool-Allah<sup>saww</sup> annulled certain things and made these to be disliked, and he<sup>saww</sup> did not forbid from it the forbiddance of a Prohibition. But rather, he<sup>saww</sup> forbade from these as a forbiddance of annulment and a dislike. Then he<sup>saww</sup> allowed with regards to these. So the taking by his<sup>asws</sup> allowance came to be Obligatory upon the servant like the Obligation of what they were taking by his<sup>saww</sup> forbiddance and his<sup>saww</sup> determination. And Rasool-Allah<sup>saww</sup> did not allow for them regarding what he<sup>saww</sup> had forbidden them from as a forbiddance of a Prohibition, nor regarding what he<sup>saww</sup> had ordered with an order of an obligated necessity. \nThus, more of the intoxicants from the drinks, he<sup>saww</sup> forbade from it with a forbiddance of a Prohibition. He<sup>saww</sup> did not allow anyone with regards to it. And Rasool-Allah<sup>saww</sup> did not allow anyone for the shortening of the two Cycles which he<sup>saww</sup> had incorporated to what Allah<sup>azwj</sup> Mighty and Majestic had Obligated. But, he<sup>saww</sup> necessitated that with a necessitation of an Obligation. He<sup>saww</sup> did not allow anyone regarding something from that, except for the traveller, and it is not for anyone that he is allowed something what Rasool-Allah<sup>saww</sup> did not allow. \nThus, the orders of Rasool-Allah<sup>saww</sup> were harmonized with the Commands of Allah<sup>azwj</sup> Mighty and Majestic, and his<sup>as</sup> forbiddances with the Forbiddances of Allah<sup>azwj</sup> Mighty and Majestic, and it is an Obligation upon the servants, the submission to him<sup>saww</sup> like the submission to Allah<sup>azwj</sup> Blessed and High’."}]}, {"index": 694, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:52:5", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ زُرَارَةَ أَنَّهُ سَمِعَ أَبَا جَعْفَرٍ وَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولَانِ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى فَوَّضَ إِلَى نَبِيِّهِ ( صلى الله عليه وآله ) أَمْرَ خَلْقِهِ لِيَنْظُرَ كَيْفَ طَاعَتُهُمْ ثُمَّ تَلَا هَذِهِ الْآيَةَ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا .\nمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ زُرَارَةَ مِثْلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazal, from Sa’alba Bin Maymoun, from Zurara, \n‘He heard Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> and Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> both saying that Allah<sup style=\"font-weight: normal\">azwj</sup> Blessed and High Authorised to His<sup style=\"font-weight: normal\">azwj</sup> Prophet<sup style=\"font-weight: normal\">saww</sup> the matters of His<sup style=\"font-weight: normal\">azwj</sup> creatures in order to See how their obedience would be’. Then he<sup style=\"font-weight: normal\">asws</sup> recited this Verse <span class=\"ibTxt\">[59:7] and whatever the Rasool gives you, accept it, and from whatever he forbids you, keep back</span>’.\n<span style=\"font-size: small\">Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hajjal, from Sa’alba Bin Maymoun, from Zurara </span>– similar to it."}]}, {"index": 695, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:52:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَدَّبَ نَبِيَّهُ ( صلى الله عليه وآله ) فَلَمَّا انْتَهَى بِهِ إِلَى مَا أَرَادَ قَالَ لَهُ إِنَّكَ لَعَلى خُلُقٍ عَظِيمٍ فَفَوَّضَ إِلَيْهِ دِينَهُ فَقَالَ وَ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا \nوَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ الْفَرَائِضَ وَ لَمْ يَقْسِمْ لِلْجَدِّ شَيْئاً وَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَطْعَمَهُ السُّدُسَ فَأَجَازَ اللَّهُ جَلَّ ذِكْرُهُ لَهُ ذَلِكَ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Is’haq Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Blessed and High Educated His<sup>azwj</sup> Prophet<sup>saww</sup>. So when He<sup>azwj</sup> Ended up with him<sup>saww</sup> to what He<sup>azwj</sup> Wanted, Said to him<sup>saww</sup> <span class=\"ibTxt\">[68:4] And you are upon magnificent morals</span>. So He<sup>azwj</sup> Authorised to him<sup>saww</sup> His<sup>azwj</sup> Religion, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[59:7] and whatever the Rasool gives you, accept it, and from whatever he forbids you, keep back</span>.\nAnd that Allah<sup>azwj</sup> Mighty and Majestic Necessitated the necessities (of the inheritances) and did not apportion anything for the grandfather, and that Rasool-Allah<sup>saww</sup> fed (apportioned to) him, the sixth. So Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention, Allowed that for him<sup>saww</sup>, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic  <span class=\"ibTxt\">[38:39] This is Our Gift, therefore give out freely or withhold, without accountability</span>’."}]}, {"index": 696, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:52:7", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ وَضَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) دِيَةَ الْعَيْنِ وَ دِيَةَ النَّفْسِ وَ حَرَّمَ النَّبِيذَ وَ كُلَّ مُسْكِرٍ \nفَقَالَ لَهُ رَجُلٌ وَضَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ غَيْرِ أَنْ يَكُونَ جَاءَ فِيهِ شَيْ‏ءٌ قَالَ نَعَمْ لِيَعْلَمَ مَنْ يُطِيعُ الرَّسُولَ مِمَّنْ يَعْصِيهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Hammad Bin Usman, from Zurara, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> placed the wergild of the eye and wergild of the self, and prohibited the <span class=\"iTxt\">Nabeez</span> (an intoxicating drink), and every intoxicant’. \nSo a man said to him<sup>asws</sup>, ‘Rasool-Allah<sup>saww</sup> placed (it) from without there happening to be something coming (from Allah<sup>azwj</sup>)?’ He<sup>asws</sup> said: ‘Yes, in order for Him<sup>azwj</sup> to know the one who obeys the Rasool<sup>saww</sup> from the ones who disobey him<sup>saww</sup>’."}]}, {"index": 697, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:52:8", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ قَالَ وَجَدْتُ فِي نَوَادِرِ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا وَ اللَّهِ مَا فَوَّضَ اللَّهُ إِلَى أَحَدٍ مِنْ خَلْقِهِ إِلَّا إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِلَى الْأَئِمَّةِ قَالَ عَزَّ وَ جَلَّ إِنَّا أَنْزَلْنا إِلَيْكَ الْكِتابَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِما أَراكَ اللَّهُ وَ هِيَ جَارِيَةٌ فِي الْأَوْصِيَاءِ ( عليهم السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Hassan who said, ‘I found in the miscellaneous (Ahadeeth reported by) Muhammad Bin Sinan, from Abdullah Bin Sinan who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>! Allah<sup>azwj</sup> did not Authorised to anyone from His<sup>azwj</sup> creatures except to Rasool-Allah<sup>saww</sup> and to the Imams<sup>asws</sup>. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[4:105] Surely We have Revealed the Book to you with the Truth that you may judge between people by means of that which Allah has Shown you</span>, and it flows among the successors<sup>asws</sup>’."}]}, {"index": 698, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:1:4:52:9", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ الْحَسَنِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَدَّبَ رَسُولَهُ حَتَّى قَوَّمَهُ عَلَى مَا أَرَادَ ثُمَّ فَوَّضَ إِلَيْهِ فَقَالَ عَزَّ ذِكْرُهُ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا فَمَا فَوَّضَ اللَّهُ إِلَى رَسُولِهِ ( صلى الله عليه وآله ) فَقَدْ فَوَّضَهُ إِلَيْنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Hassan, from Yaqoub Bin Yazeed, from Al Hassan Bin Ziyad, from Muhammad Bin Al Hassan Al Maysami, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying that Allah<sup>azwj</sup> Mighty and Majestic Educated His<sup>azwj</sup> Rasool<sup>saww</sup> until He<sup>azwj</sup> Made him<sup>saww</sup> to be a custodian upon whatever He<sup>azwj</sup> Wanted. Then He<sup>azwj</sup> Authorised to him<sup>saww</sup>, so He<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, Said <span class=\"ibTxt\">[59:7] and whatever the Rasool gives you, accept it, and from whatever he forbids you, keep back</span>. So whatever Allah<sup>azwj</sup> Authorised to His<sup>azwj</sup> Rasool<sup>saww</sup>, so He<sup>azwj</sup> has Authorised it to us<sup>asws</sup>’."}]}, {"index": 699, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:1:4:52:10", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنِ الْحُسَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ صَنْدَلٍ الْخَيَّاطِ عَنْ زَيْدٍ الشَّحَّامِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ قَالَ أَعْطَى سُلَيْمَانَ مُلْكاً عَظِيماً ثُمَّ جَرَتْ هَذِهِ الْآيَةُ فِي رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَكَانَ لَهُ أَنْ يُعْطِيَ مَا شَاءَ مَنْ شَاءَ وَ يَمْنَعَ مَنْ شَاءَ وَ أَعْطَاهُ اللَّهُ أَفْضَلَ مِمَّا أَعْطَى سُلَيْمَانَ لِقَوْلِهِ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from one of our companiosn, from Al Husayn Bin Abdul Rahman, from Sandal Al Khayyat, from Zayd Al Shahham who said, \n‘I asked Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[38:39] This is Our Gift, therefore give out freely or withhold, without accountability</span>. He<sup>asws</sup> said: ‘He<sup>azwj</sup> Gave Suleyman<sup>as</sup> a magnificent kingdom. Then this Verse flowed regarding Rasool-Allah<sup>saww</sup>. Thus, it was for him<sup>saww</sup> that he<sup>saww</sup> could give whatever he<sup>saww</sup> so desired to whoever he<sup>saww</sup> so desired, and prevent it from the one who he<sup>saww</sup> so desires to. And, Allah<sup>azwj</sup> Gave him<sup>saww</sup> was what He<sup>azwj</sup> Gave Suleyman<sup>as</sup> due to His<sup>azwj</sup> Words <span class=\"ibTxt\">[59:7] and whatever the Rasool gives you, accept it, and from whatever he forbids you, keep back</span>’."}]}]}, "index": "al-kafi:1:4:52", "kind": "verse_list"}