{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 53"
        },
        "path": "/books/al-kafi:1:4:53",
        "titles": {
          "ar": "باب فِي أَنَّ الْأَئِمَّةَ بِمَنْ يُشْبِهُونَ مِمَّنْ مَضَى وَ كَرَاهِيَةِ الْقَوْلِ فِيهِمْ بِالنُّبُوَّةِ",
          "en": "Chapter 53 – Regarding that the Imams<sup>asws</sup> are resembling with the ones from the past and the abhorrence of the speech regarding them<sup>asws</sup> being with the Prophet-hood"
        }
      }
    ],
    "index": 111,
    "local_index": 53,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 54"
        },
        "path": "/books/al-kafi:1:4:54",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) مُحَدَّثُونَ مُفَهَّمُونَ",
          "en": "Chapter 54 – The Imams<sup>asws</sup> are Muhaddisoun (ones discussing with the Angels), understaning ones"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 52"
        },
        "path": "/books/al-kafi:1:4:52",
        "titles": {
          "ar": "بَابُ التَّفْوِيضِ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِلَى الْأَئِمَّةِ ( عليهم السلام ) فِي أَمْرِ الدِّينِ",
          "en": "Chapter 52 – The Authorising to Rasool-Allah<sup>saww</sup> and to the Imams<sup>asws</sup> regarding the command of the Religion"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:53",
    "titles": {
      "ar": "باب فِي أَنَّ الْأَئِمَّةَ بِمَنْ يُشْبِهُونَ مِمَّنْ مَضَى وَ كَرَاهِيَةِ الْقَوْلِ فِيهِمْ بِالنُّبُوَّةِ",
      "en": "Chapter 53 – Regarding that the Imams<sup>asws</sup> are resembling with the ones from the past and the abhorrence of the speech regarding them<sup>asws</sup> being with the Prophet-hood"
    },
    "verse_count": 7,
    "verse_start_index": 699,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/156)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 700,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:53:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ حُمْرَانَ بْنِ أَعْيَنَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) مَا مَوْضِعُ الْعُلَمَاءِ قَالَ مِثْلُ ذِي الْقَرْنَيْنِ وَ صَاحِبِ سُلَيْمَانَ وَ صَاحِبِ مُوسَى ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya,f rom Humran Bin Ayn who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘What is the place of the scholars<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Similar to Zil Qarnayn, and companion of Suleyman<sup>as</sup> and companion of Musa<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 1. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Humran ibn A‘yan who has said that he asked abu Ja‘far (a.s.) the following. “What is the position of the scholars?” The Imam (a.s.) said, “ It is like Dhul Qarnayn, (see 18:83 – 99 Holy Quran),the companion of Solomon (see 27:40),and the companion of Moses (a.s.) (See 18:65)”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/157)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 701,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:53:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّمَا الْوُقُوفُ عَلَيْنَا فِي الْحَلَالِ وَ الْحَرَامِ فَأَمَّا النُّبُوَّةُ فَلَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Husayn Bin Abu Al A’ala who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘But rather, the inquiring is to us<sup>asws</sup> regarding the Permissible and the Prohibition, but, as for the Prophet-hood (being for us<sup>asws</sup>), so no (it is not)’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayrfrom al-Husayn ibn abu al-‘Ala’ from abu ‘Abdallah (a.s.) who has said the following. “To refer to us (as the Divine authorities) is valid only in finding the lawful and unlawful matters. To refer to us as prophet-hood is not valid.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (157/ 3)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/31)"
        ],
        "index": 702,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:53:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى الْأَشْعَرِيُّ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْبَرْقِيِّ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ أَيُّوبَ بْنِ الْحُرِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ عَزَّ ذِكْرُهُ خَتَمَ بِنَبِيِّكُمُ النَّبِيِّينَ فَلَا نَبِيَّ بَعْدَهُ أَبَداً وَ خَتَمَ بِكِتَابِكُمُ الْكُتُبَ فَلَا كِتَابَ بَعْدَهُ أَبَداً وَ أَنْزَلَ فِيهِ تِبْيَانَ كُلِّ شَيْ‏ءٍ وَ خَلْقَكُمْ وَ خَلْقَ السَّمَاوَاتِ وَ الْأَرْضِ وَ نَبَأَ مَا قَبْلَكُمْ وَ فَصْلَ مَا بَيْنَكُمْ وَ خَبَرَ مَا بَعْدَكُمْ وَ أَمْرَ الْجَنَّةِ وَ النَّارِ وَ مَا أَنْتُمْ صَائِرُونَ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya Al Ashary, from Ahmad Bin Muhammad, from Al Barqy, from Al Nazar Bin Suweyd, from Yahya Bin Imran Al Halby, from Ayoub Bin Al Hurr who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, Ended the Prophets<sup>as</sup> by your Prophet<sup>saww</sup>, therefore there will not be a Prophet<sup>saww</sup> after him<sup>saww</sup>, ever! And He<sup>azwj</sup> Ended the Books by your Book (Quran), therefore there will not be a Book after it, ever! And He<sup>azwj</sup> Revealed in it the clarification of everything, and Created you all and Created the skied and the earth, and Gave you news of what (transpired) before you, and Decisions of what is between you, and news of what is to be after you, and the matter of the Paradise and the Fire, and what you are going towards’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya al-Ash’ari has narrated from Ahmad ibn Muhammad from al-Barqi from al-Nadr ibn Suwayd from Yahya ibn ‘Imran al-Halabi from Ayyub ibn al-Hurr who has said that he heard abu ‘Abdallah (a.s.) say the following. “Allah, Majestic is Whose mention, ended with your prophet the (coming of) the prophets. Thus, there will never come any prophet after him. With your book He ended sending of (heavenly) books. Thus, there will never come other heavenly books. In it (your book) He has placed clarifications for all things, such as your creation and the creation of the heavens and the earth. Therein is the news of the beings before you, the laws that help settle your disputes and the news of the beings that come into being after you, the news of the issues of Paradise and Fire and that to which you proceed.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/157)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 703,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:53:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ عَلِيّاً ( عليه السلام ) كَانَ مُحَدَّثاً فَقُلْتُ فَتَقُولُ نَبِيٌّ قَالَ فَحَرَّكَ بِيَدِهِ هَكَذَا ثُمَّ قَالَ أَوْ كَصَاحِبِ سُلَيْمَانَ أَوْ كَصَاحِبِ مُوسَى أَوْ كَذِي الْقَرْنَيْنِ أَ وَ مَا بَلَغَكُمْ أَنَّهُ قَالَ وَ فِيكُمْ مِثْلُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed,f rom Hammad Bin Isa, from Al Husayn Bin Al Mukhtar, from Al Haris Bin Al Mugheira who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘Ali<sup>asws</sup> was a Muhaddis’. So I said, ‘So you<sup>asws</sup> are saying, (he<sup>asws</sup> was) a Prophet<sup>as</sup>?’ So he<sup>asws</sup> moved his<sup>asws</sup> hand like this, then said: ‘Or like the companion of Suleyman<sup>as</sup>, or like the companion of Musa<sup>as</sup>, or like Zil Qarnayn, or has it not reached you all that he<sup>asws</sup> said: ‘And among you is one<sup>asws</sup> similar to him (Zil Qarnayn)’?’"
          ],
          "en.sarwar": [
            " 4. A number of our people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Hammad ibn ‘Isa from al-Husayn ibn al-Mukhtar from al-Harith ibn al-Mughirah who has said that abu Ja‘far (a.s.) has said the following. “Ali (a.s.) was a Muhaddith (a Divine spokesman).” The narrator has said that he then asked the Imam (a.s.), “What is mmeans, O Imam? Do you say he was a prophet?” The narrator has said that the Imam (a.s.) rose his hand like this, (meaning thereby, no, I did not say that).” The Imam (a.s.) then said, “Or he is like the companion of Solomon, or the companion of Moses or like Dhul Qarnayn. Have you not heard that he said, “Among you is one similar to him (Dhul Qarnayn).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/158)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 704,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:53:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ مَا مَنْزِلَتُكُمْ وَ مَنْ تُشْبِهُونَ مِمَّنْ مَضَى قَالَ صَاحِبُ مُوسَى وَ ذُو الْقَرْنَيْنِ كَانَا عَالِمَيْنِ وَ لَمْ يَكُونَا نَبِيَّيْنِ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Bureyd Bin Muawiya, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘What are your (Imams<sup>asws</sup>) positions, and who resembles you from the ones of the past?’ He<sup>asws</sup> said: ‘Companion of Musa<sup>as</sup>, and Zul Qarnayn were both knowledgeable ones, and they did not happen to be Prophets<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ’Udhayna from Burayd ibn Mu‘awiya who has said that he asked abu Ja‘far and abu ‘Abdallah (a.s.) the following. “What is your position? To who of the people of the past do you resemble?” the Imam (a.s.) said, “I resemble the companion of Moses and Dhul Qarnayn who were two scholars but not two prophets.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/158)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 705,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:53:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْبَرْقِيِّ عَنْ أَبِي طَالِبٍ عَنْ سَدِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ قَوْماً يَزْعُمُونَ أَنَّكُمْ آلِهَةٌ يَتْلُونَ بِذَلِكَ عَلَيْنَا قُرْآناً وَ هُوَ الَّذِي فِي السَّماءِ إِلهٌ وَ فِي الْأَرْضِ إِلهٌ ",
          "فَقَالَ يَا سَدِيرُ سَمْعِي وَ بَصَرِي وَ بَشَرِي وَ لَحْمِي وَ دَمِي وَ شَعْرِي مِنْ هَؤُلَاءِ بَرَاءٌ وَ بَرِئَ اللَّهُ مِنْهُمْ مَا هَؤُلَاءِ عَلَى دِينِي وَ لَا عَلَى دِينِ آبَائِي وَ اللَّهِ لَا يَجْمَعُنِي اللَّهُ وَ إِيَّاهُمْ يَوْمَ الْقِيَامَةِ إِلَّا وَ هُوَ سَاخِطٌ عَلَيْهِمْ ",
          "قَالَ قُلْتُ وَ عِنْدَنَا قَوْمٌ يَزْعُمُونَ أَنَّكُمْ رُسُلٌ يَقْرَءُونَ عَلَيْنَا بِذَلِكَ قُرْآناً يا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّباتِ وَ اعْمَلُوا صالِحاً إِنِّي بِما تَعْمَلُونَ عَلِيمٌ ",
          "فَقَالَ يَا سَدِيرُ سَمْعِي وَ بَصَرِي وَ شَعْرِي وَ بَشَرِي وَ لَحْمِي وَ دَمِي مِنْ هَؤُلَاءِ بَرَاءٌ وَ بَرِئَ اللَّهُ مِنْهُمْ وَ رَسُولُهُ مَا هَؤُلَاءِ عَلَى دِينِي وَ لَا عَلَى دِينِ آبَائِي وَ اللَّهِ لَا يَجْمَعُنِي اللَّهُ وَ إِيَّاهُمْ يَوْمَ الْقِيَامَةِ إِلَّا وَ هُوَ سَاخِطٌ عَلَيْهِمْ ",
          "قَالَ قُلْتُ فَمَا أَنْتُمْ قَالَ نَحْنُ خُزَّانُ عِلْمِ اللَّهِ نَحْنُ تَرَاجِمَةُ أَمْرِ اللَّهِ نَحْنُ قَوْمٌ مَعْصُومُونَ أَمَرَ اللَّهُ تَبَارَكَ وَ تَعَالَى بِطَاعَتِنَا وَ نَهَى عَنْ مَعْصِيَتِنَا نَحْنُ الْحُجَّةُ الْبَالِغَةُ عَلَى مَنْ دُونَ السَّمَاءِ وَ فَوْقَ الْأَرْضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Barqy, from Abu Talib, from Sadeyr who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘There is a group or people who are claiming that you (Imams<sup>asws</sup>) are gods by reciting that (from) the Quran upon us <span class=\"ibTxt\">[43:84] And He is That Who is God in the skies and God in the earth</span>’. ",
            "So he<sup>asws</sup> said: ‘O Sadeyr! My<sup>asws</sup> hearing, and my<sup>asws</sup> vision, and my<sup>asws</sup> skin, and my<sup>asws</sup> flesh, and my<sup>asws</sup> blood, and my<sup>asws</sup> hair are disavowed from those, and Allah<sup>azwj</sup> Disavows from them. They are not upon my<sup>asws</sup> Religion, nor upon the Religion of my<sup>asws</sup> forefathers<sup>asws</sup>, and Allah<sup>azwj</sup> will not Gather me<sup>asws</sup> and them on the Day of Judgment except that He<sup>azwj</sup> would be Wrathful upon them’. ",
            "He (the narrator) said, ‘I said, ‘And with us there is a group of people who are claiming that you (Imams<sup>asws</sup>) are Rasools<sup>as</sup>, reciting that (from) the Quran upon us <span class=\"ibTxt\">[23:51] O you Rasools! Eat from the good things and do righteous deeds; surely I Know what you are doing</span>’.",
            "So he<sup>asws</sup> said: ‘O Sadeyr! My<sup>asws</sup> hearing, and my<sup>asws</sup> vision, and my<sup>asws</sup> hair, and my<sup>asws</sup> skin, and my<sup>asws</sup> flesh, and my<sup>asws</sup> blood are disavowed from those ones, and Allah<sup>azwj</sup> Disavows from them, and (as well as) His<sup>azwj</sup> Rasool<sup>saww</sup>. They are neither upon my<sup>asws</sup> Religion nor upon the Religion of my<sup>asws</sup> forefathers<sup>asws</sup>, and Allah<sup>azwj</sup> will not Gather me<sup>asws</sup> and them on the Day of Judgment except that He<sup>azwj</sup> would be Wrathful upon them’. ",
            "He (the narrator) said, ‘I said, ‘So what are you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘We<sup>asws</sup> are the treasurers of the Knowledge of Allah<sup>azwj</sup>. We<sup>asws</sup> are translators of the Commands of Allah<sup>azwj</sup>. We<sup>asws</sup> are a group of infallibles. Allah<sup>azwj</sup> Blessed and High has Commanded with obedience to us<sup>asws</sup> and Forbade from disobeying us<sup>asws</sup>. We are the eloquent Divine Authorities upon the ones below the sky and above the earth’."
          ],
          "en.sarwar": [
            " 6.Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Barqi from abu Talib from Sadir who has said that he asked abu ‘Abdallah (a.s.) the following. “A certain group of people believe that you are gods. They read to us from the Quran about it. And it is He Who in heaven is God and in earth is God.” (43:84). The Imam (a.s.) said, “O Sadir, my hearing, my sight, my skin, my flesh, my blood and my hair are (all) disdain such people, and Allah also disdains them. They do not follow my religion and the religion of my forefathers. I swear by Allah, Allah will not place me with them on the Day of Resurrection. The only thing from Allah to them will be His anger.” The narrator has said that he said, “Among us there is a group of people who believe that you are messenger and read to from the Holy Quran. “O Messengers, eat of the good things and do righteousness; surely I know the things you do (23:51). The Imam (a.s.) said, “O Sadir, my hearing, my sight, my skin, my flesh, my blood and my hair are (all) disdain such people, and Allah and Hid Messenger also disdains them. They do not follow my religion and the religion of my forefathers. Allah will not place me with them on the Day of Judgment. The only thing from Allah towards them will be His anger.” The narrator has said that he then asked, “What are you then?” the Imam (a.s.) said, “We are the treasuries of the knowledge of Allah. We are the translators of the commands of Allah. We are infallible people. Allah, the Most Holy, the Most High, has commanded people to obey us and prohibited them to disobey us. We are the complete Divine authority over all that is below the heavens and above the earth.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/161)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 706,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:53:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ بَحْرٍ عَنِ ابْنِ مُسْكَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ الْأَئِمَّةُ بِمَنْزِلَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِلَّا أَنَّهُمْ لَيْسُوا بِأَنْبِيَاءَ وَ لَا يَحِلُّ لَهُمْ مِنَ النِّسَاءِ مَا يَحِلُّ لِلنَّبِيِّ ( صلى الله عليه وآله ) فَأَمَّا مَا خَلَا ذَلِكَ فَهُمْ فِيهِ بِمَنْزِلَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Abdullah Bin Bahr, from Ibn Muskan, from Abdul Rahman Bin Abu Abdullah, from Muhammad Bin Muslim who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The Imams<sup>asws</sup> are at the status of Rasool-Allah<sup>as</sup> except that they<sup>asws</sup> aren’t with the Prophet-hood, nor is it Permissible for them<sup>asws</sup> from the women what was Permissible for the Prophet<sup>saww</sup>. So, as for whatever is besides that, so they<sup>asws</sup> with regards to it are at the status of Rasool-Allah<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 7. A number of our people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from ‘Abdallah ibn Bahr from ibn Muskan from ‘Abd al-Rahman ibn abu ‘Abdallah from Muhammad ibn Muslim who has said that he heard abu ‘Abdallah (a.s.) say the following. “The Imams (a.s.) possess the position of the Messenger of Allah except that they are not prophets and the number of wives permissible for the Holy Prophet is not permissible for them. In the aspects other than these they possess the same positions as the Messenger of Allah did.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:53",
  "kind": "verse_list"
}