{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 54"
        },
        "path": "/books/al-kafi:1:4:54",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) مُحَدَّثُونَ مُفَهَّمُونَ",
          "en": "Chapter 54 – The Imams<sup>asws</sup> are Muhaddisoun (ones discussing with the Angels), understaning ones"
        }
      }
    ],
    "index": 112,
    "local_index": 54,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 55"
        },
        "path": "/books/al-kafi:1:4:55",
        "titles": {
          "ar": "باب فِيهِ ذِكْرُ الْأَرْوَاحِ الَّتِي فِي الْأَئِمَّةِ ( عليهم السلام )",
          "en": "Chapter 55 – Regarding the mention of the spirits within the Imams<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 53"
        },
        "path": "/books/al-kafi:1:4:53",
        "titles": {
          "ar": "باب فِي أَنَّ الْأَئِمَّةَ بِمَنْ يُشْبِهُونَ مِمَّنْ مَضَى وَ كَرَاهِيَةِ الْقَوْلِ فِيهِمْ بِالنُّبُوَّةِ",
          "en": "Chapter 53 – Regarding that the Imams<sup>asws</sup> are resembling with the ones from the past and the abhorrence of the speech regarding them<sup>asws</sup> being with the Prophet-hood"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:54",
    "titles": {
      "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) مُحَدَّثُونَ مُفَهَّمُونَ",
      "en": "Chapter 54 – The Imams<sup>asws</sup> are Muhaddisoun (ones discussing with the Angels), understaning ones"
    },
    "verse_count": 5,
    "verse_start_index": 706,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (161/ 3)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (31/ 1)"
        ],
        "index": 707,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:54:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ أَرْسَلَ أَبُو جَعْفَرٍ ( عليه السلام ) إِلَى زُرَارَةَ أَنْ يُعْلِمَ الْحَكَمَ بْنَ عُتَيْبَةَ أَنَّ أَوْصِيَاءَ مُحَمَّدٍ عَلَيْهِ وَ عَلَيْهِمُ السَّلَامُ مُحَدَّثُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hajjal, from Al Qasim Bin Muhammad, from Ubeyd Bin Zurara who said, ",
            "‘Abu Ja’far<sup>asws</sup> sent Zurara that he should let Al-Hakam Bin Uteyba (The famous philosopher Al-Kindy) know that the successors<sup>asws</sup> of Muhammad<sup>saww</sup>, upon him<sup>saww</sup> and upon them<sup>asws</sup> be the greetings, are <span class=\"iTxt\">Muhaddisoun</span> (to whom the Angels discuss)’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hajjal from al-Qasim ibn Muhammad from ‘Ubayd ibn Zurarah who has said the following. “Abu Ja‘far (a.s.) sent (message) to Zurara to inform al-Hakam ibn ‘Utayba that the executors of the will of Muhammad (s.a.) (are Muhaddathun) hear from the angels.” al-Hakam ibn ’Utaybah (al-Kindi al-Kufi [50/670 - 115/ 733], one of the tab‘un [those who knew the companions of the Holy Prophet and famous narrators of hadith)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (162/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 708,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:54:2",
        "refs": {
          "Quran": [
            "/books/quran:22:52"
          ]
        },
        "text": [
          "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ زِيَادِ بْنِ سُوقَةَ عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ قَالَ دَخَلْتُ عَلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) يَوْماً فَقَالَ يَا حَكَمُ هَلْ تَدْرِي الْآيَةَ الَّتِي كَانَ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) يَعْرِفُ قَاتِلَهُ بِهَا وَ يَعْرِفُ بِهَا الْأُمُورَ الْعِظَامَ الَّتِي كَانَ يُحَدِّثُ بِهَا النَّاسَ قَالَ الْحَكَمُ فَقُلْتُ فِي نَفْسِي قَدْ وَقَعْتُ عَلَى عِلْمٍ مِنْ عِلْمِ عَلِيِّ بْنِ الْحُسَيْنِ أَعْلَمُ بِذَلِكَ تِلْكَ الْأُمُورَ الْعِظَامَ قَالَ فَقُلْتُ لَا وَ اللَّهِ لَا أَعْلَمُ قَالَ ثُمَّ قُلْتُ الْآيَةُ تُخْبِرُنِي بِهَا يَا ابْنَ رَسُولِ اللَّهِ",
          "قَالَ هُوَ وَ اللَّهِ قَوْلُ اللَّهِ عَزَّ ذِكْرُهُ وَ مَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ وَ لَا نَبِيٍّ وَ لَا مُحَدَّثٍ وَ كَانَ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) مُحَدَّثاً ",
          "فَقَالَ لَهُ رَجُلٌ يُقَالُ لَهُ عَبْدُ اللَّهِ بْنُ زَيْدٍ كَانَ أَخَا عَلِيٍّ لِأُمِّهِ سُبْحَانَ اللَّهِ مُحَدَّثاً كَأَنَّهُ يُنْكِرُ ذَلِكَ فَأَقْبَلَ عَلَيْنَا أَبُو جَعْفَرٍ ( عليه السلام ) فَقَالَ أَمَا وَ اللَّهِ إِنَّ ابْنَ أُمِّكَ بَعْدُ قَدْ كَانَ يَعْرِفُ ذَلِكَ قَالَ فَلَمَّا قَالَ ذَلِكَ سَكَتَ الرَّجُلُ فَقَالَ هِيَ الَّتِي هَلَكَ فِيهَا أَبُو الْخَطَّابِ فَلَمْ يَدْرِ مَا تَأْوِيلُ الْمُحَدَّثِ وَ النَّبِيِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad Bin Muhammad, from Ibn Mahboub, from Jameel Bin Salih, from Ziyad Bin Sowqat, from Al Hakam Bin Uteyba who said, ",
            "‘I went over to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> one day, so he<sup>asws</sup> said: ‘O Hakam! Do you know the Verse which Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> had recognised his<sup>asws</sup> murderer with, and he<sup>asws</sup> recognised the great matters which he<sup>asws</sup> used to narrate to the people with?’ Hisham said, ‘So I said within myself, ‘I have fallen upon a knowledge from the knowledge of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, by that I will know those great matters’. So I said, ‘No, by Allah<sup>azwj</sup>, I don’t know’. Then I said, ‘The Verse, (please) inform me with it, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>!’. ",
            "He<sup>asws</sup> said: ‘It is, by Allah<sup>azwj</sup>, the Words of Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention <span class=\"ibTxt\"><a href=\"/#/books/quran:22#h52\">[22:52]</a> And We did not Send any Rasool or Prophet, or a Muhaddith before you</span>?’ (Please note that the word ‘<span class=\"iTxt\">Muhaddith</span>’ is missing from this Verse in the current version of the Quran). And it was so that Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> was a <span class=\"iTxt\">Muhaddith</span>’.",
            "So a man called Abdullah Bin Zayd, and he was a brother of Ali<sup>asws</sup> to his mother (maternal side) said to him<sup>asws</sup>, ‘Glory be to Allah<sup>azwj</sup>! A <span class=\"iTxt\">Muhaddith</span>?’ As if he was denying that. So Abu Ja’far<sup>asws</sup> turned towards us and he<sup>asws</sup> said: ‘But, by Allah<sup>azwj</sup>, the son<sup>asws</sup> of your mother used to recognise that, after all’. So when he<sup>asws</sup> said that, the man was silent. So he<sup>asws</sup> said: ‘It is regarding which Abu Al-Khattab was destroyed, so he did not know what is the explanation of the <span class=\"iTxt\">Muhaddith</span> and the Prophet<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 2. Muhammad from Ahmad ibn Muhammad from ibn Mahbub from Jamil ibn Salih from Ziyad ibn Suqah from al-Hakam ibn ‘Utaybah who has said the following. “One day I went to see Ali ibn al-Husayn (a.s.).” He said, “O Hakam do you know the verse (of the Holy Quran) from which Ali ibn abu Talib had learned who his assassin was and the extremely great matters of which he would speak to people? “ Al-Hakam has said that I said to myself in my mind, “ I have now a chance to learn of the knowledge of Ali ibn al-Husayn (a.s.) with which I will learn of those extremely great matters.” The narrator has said that he replied the Imam (a.s.), “No, O son of the Messenger of Allah, I do not know.” He has said that he then said, “Please tell me, O son of the Messenger of Allah, which verse is it?” the Imam (a.s.) said, “It, I swear by Allah, is the words of Allah, Majestic is Whose mention, “We have not sent any messenger or prophet before you (or a Muhahhdath) one who hears from the angels. <a href=\"/#/books/quran:22#h52\">[22:52]</a> Ali ibn abu Talib (a.s.) was a Muhaddath. At this point a man called ‘Abdallah ibn Zayd who was a brother of Ali from his mother’s side said, “Glory belongs to Allah. A Muhaddath1!” It seemed as if he did not believe it. Abu Ja‘far (a.s.) then turned to us and said, “Do not have any doubts, I swear by Allah, that the son of your mother after all did have knowledge of this fact.” The narrator has said that when the Imam (a.s.) said so the man kept silent. The Imam (a.s.) then said, “This is the issue in which abu al-Khattab perished. He never learned what was the explanation of the prophet and a Muhaddath.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (164/ 3)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (31/ 1)"
        ],
        "index": 709,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:54:3",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ الْأَئِمَّةُ عُلَمَاءُ صَادِقُونَ مُفَهَّمُونَ مُحَدَّثُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad and Muhammad Bin Yahya, from Muhammad Bin Al Hassan, from Yaqoub Bin Yazeed, from Muhammad Bin Ismail who said, ",
            "‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘The Imam<sup>asws</sup> are scholars, truthful, understanding, <span class=\"iTxt\">Muhaddisoun</span> (whom the Angels discuss with)’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Muhammad and Muhammad ibn Yahya have narrated from Muhammad ibn al-Hassan from Ya‘qub ibn Yazid from Muhammad ibn Isma‘il who has said that I heard abu al-Hassan (a.s.) say the following. “The Imams (a.s.) are scholar, truthful people, have perfect understanding and Muhaddathum hear from the angels.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/164)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 710,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:54:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ رَجُلٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ ذُكِرَ الْمُحَدَّثُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ إِنَّهُ يَسْمَعُ الصَّوْتَ وَ لَا يَرَى الشَّخْصَ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ كَيْفَ يَعْلَمُ أَنَّهُ كَلَامُ الْمَلَكِ قَالَ إِنَّهُ يُعْطَى السَّكِينَةَ وَ الْوَقَارَ حَتَّى يَعْلَمَ أَنَّهُ كَلَامُ مَلَكٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, fromYunus, from a man, from Muhammad Bin Muslim who said, ",
            "‘The <span class=\"iTxt\">Muhaddith</span> was mentioned in the presence of Abu Abdullah<sup>asws</sup>. So he<sup>asws</sup> said: ‘He<sup>asws</sup> would hear the voice, nor does he<sup>asws</sup> see the person’. So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! How does he<sup>asws</sup> know that it is a speech of the Angel?’ He<sup>asws</sup> said: ‘He<sup>asws</sup> would be Given the tranquillity and the dignity until he<sup>asws</sup> would know that it is a speech of the Angel’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from a man that Muhammad ibn Muslim who has said the following. “Once Muhaddath was mentioned in the presence of abu ‘Abdallah (a.s.) and he said, “He, Muhaddath, hears the voice but does not see the persons of the angels.” I then said to him, “May Allah take my soul in service for your cause, how he would come to know that the voice and words are from the angels?” The Imam (a.s.) said, “He is given the serenity and dignity to the level that he learns about its being the speech of the angels.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (164/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 711,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:54:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ عَنْ حُمْرَانَ بْنِ أَعْيَنَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ عَلِيّاً ( عليه السلام ) كَانَ مُحَدَّثاً فَخَرَجْتُ إِلَى أَصْحَابِي فَقُلْتُ جِئْتُكُمْ بِعَجِيبَةٍ فَقَالُوا وَ مَا هِيَ فَقُلْتُ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ كَانَ عَلِيٌّ ( عليه السلام ) مُحَدَّثاً فَقَالُوا مَا صَنَعْتَ شَيْئاً إِلَّا سَأَلْتَهُ مَنْ كَانَ يُحَدِّثُهُ فَرَجَعْتُ إِلَيْهِ فَقُلْتُ إِنِّي حَدَّثْتُ أَصْحَابِي بِمَا حَدَّثْتَنِي فَقَالُوا مَا صَنَعْتَ شَيْئاً إِلَّا سَأَلْتَهُ مَنْ كَانَ يُحَدِّثُهُ ",
          "فَقَالَ لِي يُحَدِّثُهُ مَلَكٌ قُلْتُ تَقُولُ إِنَّهُ نَبِيٌّ قَالَ فَحَرَّكَ يَدَهُ هَكَذَا أَوْ كَصَاحِبِ سُلَيْمَانَ أَوْ كَصَاحِبِ مُوسَى أَوْ كَذِي الْقَرْنَيْنِ أَ وَ مَا بَلَغَكُمْ أَنَّهُ قَالَ وَ فِيكُمْ مِثْلُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Hammad Bin Isa, from Al Husayn Bin Al Mukhtar, from Al Haris Bin Al Mugheira, from Humran Bin Ayn who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘Ali<sup>asws</sup> was a <span class=\"iTxt\">Muhaddith</span>’. So I went out to my companions and I said, ‘I have come to you all with a strange thing’. So they said, ‘And what is it?’ So I said, ‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Ali<sup>asws</sup> was a <span class=\"iTxt\">Muhaddith</span>’. So they said, ‘You have not done anything unless you ask him<sup>asws</sup> who it was that was discussing with him<sup>asws</sup>’. So I returned to him<sup>asws</sup> and I said, ‘I narrated to my companions with what you<sup>asws</sup> had narrated to me, so they said, ‘You have not done anything until you ask him<sup>asws</sup> who it was that was discussing with him<sup>asws</sup>’. ",
            "So he<sup>asws</sup> said to me: ‘An Angel used to discuss with him<sup>asws</sup>’. I said, ‘Are you<sup>asws</sup> saying that he<sup>asws</sup> was a Prophet<sup>as</sup>?’ So he<sup>asws</sup> moved his<sup>asws</sup> hand like this (and said): ‘Or like the companion of Suleyman<sup>as</sup> or like the companion of Musa<sup>as</sup>, or like Zul Qarnayn, or has it not reached you all that he<sup>asws</sup> said: ‘And among you is his example?’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Hammad ibn ‘Isa from al-Husayn ibn al-Mukhtar from al-Harith ibn al-Mughirah from Humran ibn A‘yan who has said that abu Ja‘far (a.s.) has said the following. “Ali (a.s.) was a Muhaddath.” I then returned to my associates and said, “I have brought you a very strange news.” They asked, “What is it?” I then said that I heard abu Ja‘far (a.s.) say that Ali (a.s.) was a Muhaddath. They then said, “What did you do?” Would that you had asked him as to who would speak to him (Ali (a.s.) I then went back to abu Ja‘far (a.s.) and said to him, “I went to my associates and told them about what you had told me and they said, “What did you do? Would that you had asked him as to who would speak to him (Ali (a.s.)” The Imam (a.s.) said to me, “The angel would speak to him.” I then asked, “Do you say that he was a prophet?” He has said, “He moved his hand like this. Or like the companion of Solomon, or the companion of Moses or like Dhul Qarnayn. Have not heard that he has said, “Among there one like him.” (A hadith of the Holy Prophet (s.a.) says that Ali (a.s.) is the Dhul Qarnay of this Umma)"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:54",
  "kind": "verse_list"
}