{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 56"
        },
        "path": "/books/al-kafi:1:4:56",
        "titles": {
          "ar": "بَابُ الرُّوحِ الَّتِي يُسَدِّدُ اللَّهُ بِهَا الْأَئِمَّةَ ( عليهم السلام )",
          "en": "Chapter 56 – The spirit by which Allah<sup>azwj</sup> Protects the Imams<sup>asws</sup>"
        }
      }
    ],
    "index": 114,
    "local_index": 56,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 57"
        },
        "path": "/books/al-kafi:1:4:57",
        "titles": {
          "ar": "بَابُ وَقْتِ مَا يَعْلَمُ الْإِمَامُ جَمِيعَ عِلْمِ الْإِمَامِ الَّذِي كَانَ قَبْلَهُ ( عليه السلام )",
          "en": "Chapter 57 – The time when the Imam<sup>asws</sup> learns the entirety of the knowledge of the Imam<sup>asws</sup> who was before him<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 55"
        },
        "path": "/books/al-kafi:1:4:55",
        "titles": {
          "ar": "باب فِيهِ ذِكْرُ الْأَرْوَاحِ الَّتِي فِي الْأَئِمَّةِ ( عليهم السلام )",
          "en": "Chapter 55 – Regarding the mention of the spirits within the Imams<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:56",
    "titles": {
      "ar": "بَابُ الرُّوحِ الَّتِي يُسَدِّدُ اللَّهُ بِهَا الْأَئِمَّةَ ( عليهم السلام )",
      "en": "Chapter 56 – The spirit by which Allah<sup>azwj</sup> Protects the Imams<sup>asws</sup>"
    },
    "verse_count": 6,
    "verse_start_index": 714,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/169)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 715,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:56:1",
        "refs": {
          "Mentions": [
            "/books/quran:42:52"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ كَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً مِنْ أَمْرِنا ما كُنْتَ تَدْرِي مَا الْكِتابُ وَ لَا الْإِيمانُ قَالَ خَلْقٌ مِنْ خَلْقِ اللَّهِ عَزَّ وَ جَلَّ أَعْظَمُ مِنْ جَبْرَئِيلَ وَ مِيكَائِيلَ كَانَ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) يُخْبِرُهُ وَ يُسَدِّدُهُ وَ هُوَ مَعَ الْأَئِمَّةِ مِنْ بَعْدِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Abu Al Sabbah Al Kinany, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\"><a href=\"/#/books/quran:42#h52\">[42:52]</a> And thus We Revealed to you a Spirit from Our Command. You did not know what the Book was, nor the Eman</span>. He<sup>asws</sup> said: ‘A creature from the creatures of Allah<sup>azwj</sup> Mighty and Majestic, more magnificent than Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup>. It was with Rasool-Allah<sup>saww</sup>, informing him<sup>saww</sup>, protecting him<sup>saww</sup>, and it is with the Imams<sup>asws</sup> from after him<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya al-Halabi from abu ’al-Sabah al-Kinani from abu Basir who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most Holy, the Most High. “Thus, We have revealed a Spirit to you, (Muhammad), by Our command. Before, you did not even know what a Book or Faith was, . .” <a href=\"/#/books/quran:42#h52\">[42:52]</a> The Imam (a.s.) said, “He is a creature of the creatures of Allah, the Most Holy, the Most High greater than Jibril and Mika’il. He was with the Messenger of Allah to give him news and protected him and he is with the Imams after the Messenger of Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/171)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 716,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:56:2",
        "refs": {
          "Mentions": [
            "/books/quran:42:52"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ أَسْبَاطِ بْنِ سَالِمٍ قَالَ سَأَلَهُ رَجُلٌ مِنْ أَهْلِ هِيتَ وَ أَنَا حَاضِرٌ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ كَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً مِنْ أَمْرِنا فَقَالَ مُنْذُ أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ ذَلِكَ الرُّوحَ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) مَا صَعِدَ إِلَى السَّمَاءِ وَ إِنَّهُ لَفِينَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ali Bin Asbat, from Asbat Bin Salim who said, ",
            "‘A man from the people of Hayt asked him<sup>asws</sup> and I was present, about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:42#h52\">[42:52]</a> And thus We Revealed to you a Spirit from Our Command</span>. So he<sup>asws</sup> said: ‘Since Allah<sup>azwj</sup> Mighty and Majestic Sent down the Spirit unto Muhammad<sup>saww</sup>, it has not ascended to the sky, and it is within us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ali ibn Asbat from Asbat ibn Salim who has said the following. “Once a man from Hayt (a town in Iraq) asked abu ‘Abdallah (a.s.), -when I was present also-, about the words of Allah, the Most Holy, the Most High. “Thus, We have revealed a Spirit to you, (Muhammad), by Our command. Before, you did not even know what a Book or Faith was, . .” <a href=\"/#/books/quran:42#h52\">[42:52]</a> The Imam (a.s.) said, “From the day Allah, the Most Holy, the Most High, sent that Spirit to Muhammad (s.a.) he did not ever since ascent and he is present with us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (171/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 717,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:56:3",
        "refs": {
          "Mentions": [
            "/books/quran:17:85"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يَسْئَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي قَالَ خَلْقٌ أَعْظَمُ مِنْ جَبْرَئِيلَ وَ مِيكَائِيلَ كَانَ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ مَعَ الْأَئِمَّةِ وَ هُوَ مِنَ الْمَلَكُوتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibn Muskan, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h85\">[17:85]</a> And they are asking you about the Spirit. Say: The Spirit is from the Commands of my Lord, and you are not Given from the knowledge (of it) except for a little</span>. He<sup>asws</sup> said: ‘A creature more magnificent than Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup>. It was with Rasool-Allah<sup>saww</sup> and it is with the Imams<sup>asws</sup>, and it is from the Dominion (of Allah<sup>azwj</sup>)’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ibn Muskan from abu Basir who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most Holy, the Most High. “They ask you about the Spirit. Say, “The Spirit comes by the command of my Lord. . .” <a href=\"/#/books/quran:17#h85\">[17:85]</a>. The Imam (a.s.) said, “He is a creature greater than Jibril and Mika’il. He was with the Messenger of Allah and he is present with the Imams. He is from the realm of the angels.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/172)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 718,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:56:4",
        "refs": {
          "Mentions": [
            "/books/quran:17:85"
          ]
        },
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ يَسْئَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي قَالَ خَلْقٌ أَعْظَمُ مِنْ جَبْرَئِيلَ وَ مِيكَائِيلَ لَمْ يَكُنْ مَعَ أَحَدٍ مِمَّنْ مَضَى غَيْرِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ هُوَ مَعَ الْأَئِمَّةِ يُسَدِّدُهُمْ وَ لَيْسَ كُلُّ مَا طُلِبَ وُجِدَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Abu Ayoub Al Khazzaz, from Abu Baseer who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:17#h85\">[17:85]</a> And they are asking you about the Spirit. Say: The Spirit is from the Commands of my Lord</span>. He<sup>asws</sup> said: ‘A creature more magnificent than Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup>. It did not happen to be with anyone from the past apart from Muhammad<sup>saww</sup>, and it is with the Imams<sup>asws</sup>, protecting them<sup>asws</sup>, and it isn’t so that everything what is sought, it found’."
          ],
          "en.sarwar": [
            " 4. Ali has narrated from his father from ibn abu ‘Umayr from abu Ayyub al-Khazzaz from abu Basir who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘“They ask you about the Spirit. Say, “The Spirit comes by the command of my Lord. . .” <a href=\"/#/books/quran:17#h85\">[17:85]</a>. The Imam (a.s.) said, “He is a creature greater than Jibril and Mika’il. He was present with anyone before except Muhammad (s.a.). He is present with the Imams (a.s.). He protects them. It is not that whatever is desired is found.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (173/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 719,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:56:5",
        "refs": {
          "Mentions": [
            "/books/quran:42:52"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عِمْرَانَ بْنِ مُوسَى عَنْ مُوسَى بْنِ جَعْفَرٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْعِلْمِ أَ هُوَ عِلْمٌ يَتَعَلَّمُهُ الْعَالِمُ مِنْ أَفْوَاهِ الرِّجَالِ أَمْ فِي الْكِتَابِ عِنْدَكُمْ تَقْرَءُونَهُ فَتَعْلَمُونَ مِنْهُ قَالَ الْأَمْرُ أَعْظَمُ مِنْ ذَلِكَ وَ أَوْجَبُ أَ مَا سَمِعْتَ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ وَ كَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً مِنْ أَمْرِنا ما كُنْتَ تَدْرِي مَا الْكِتابُ وَ لَا الْإِيمانُ ",
          "ثُمَّ قَالَ أَيَّ شَيْ‏ءٍ يَقُولُ أَصْحَابُكُمْ فِي هَذِهِ الْآيَةِ أَ يُقِرُّونَ أَنَّهُ كَانَ فِي حَالٍ لَا يَدْرِي مَا الْكِتَابُ وَ لَا الْإِيمَانُ فَقُلْتُ لَا أَدْرِي جُعِلْتُ فِدَاكَ مَا يَقُولُونَ فَقَالَ لِي بَلَى قَدْ كَانَ فِي حَالٍ لَا يَدْرِي مَا الْكِتَابُ وَ لَا الْإِيمَانُ حَتَّى بَعَثَ اللَّهُ تَعَالَى الرُّوحَ الَّتِي ذُكِرَ فِي الْكِتَابِ فَلَمَّا أَوْحَاهَا إِلَيْهِ عَلَّمَ بِهَا الْعِلْمَ وَ الْفَهْمَ وَ هِيَ الرُّوحُ الَّتِي يُعْطِيهَا اللَّهُ تَعَالَى مَنْ شَاءَ فَإِذَا أَعْطَاهَا عَبْداً عَلَّمَهُ الْفَهْمَ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Imran Bin Musa, from Musa Bin Ja’far, from Ali Bin Asbat, from Muhammad Bin Al Fuzayl, from Abu Hamza who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the knowledge, ‘Is it a knowledge which the knowledgeable one<sup>asws</sup> learns from the mouths of the men, or is it in the Book with you (Imams<sup>asws</sup>) which you<sup>asws</sup> are reading from, so you<sup>asws</sup> are learning from it?’ He<sup>asws</sup> said: ‘The matter is greater than that and more necessary. Have you not heard the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:42#h52\">[42:52]</a> And thus We Revealed to you a Spirit from Our Command. You did not know what the Book was, nor the Eman</span>’.",
            "Then he<sup>asws</sup> said: ‘Which thing are your companions saying regarding this Verse? Are they reading it that he<sup>saww</sup> was in a state of not knowing what the Book (Quran) nor the <span class=\"iTxt\">Eman</span> was?’ So I said, ‘I don’t know, may I be sacrificed for you<sup>asws</sup>, what they are saying’. So he<sup>asws</sup> said to me: ‘Yes. He<sup>saww</sup> was in a state where he<sup>saww</sup> did not know what the Book was nor the <span class=\"iTxt\">Eman</span> until Allah<sup>azwj</sup> the Exalted Sent the Spirit Mentioned in the Book. So when He<sup>azwj</sup> Revealed to Him<sup>azwj</sup>, he<sup>saww</sup> knew by it the knowledge and the understanding, and it is the Spirit which Allah<sup>azwj</sup> the Exalted Gives to the one whom He<sup>azwj</sup> so Desires to. So when He<sup>azwj</sup> does Give it to a servant, He<sup>azwj</sup> Teaches him the understanding’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from ‘Imran ibn Musa from Musa ibn Ja‘far from Ali ibn Asbat from Muhammad ibn Fudayl from abu Hamzah who has said the following. “I asked abu ‘Abdallah (a.s.) about the knowledge. Is it a knowledge that the scholar learns from the mouths of the people or it is in the with you from which you read and then learn therefrom.” The Imam (a.s.) said, “The issue is greater and more urgently needed. Have you not heard the words of Allah, the Most Holy, the Most High, “Thus, We have revealed a Spirit to you, (Muhammad), by Our command. Before, you did not even know what a Book or Faith was, . .” <a href=\"/#/books/quran:42#h52\">[42:52]</a>?” The The Imam (a.s.) said, “What does your people say about this verse? Do they read that he was as such that he did not know what the or the was?” I said, “I do not know, “May Allah take my soul in service for your cause, what they say.” The Imam (a.s.) then said, “Yes, he lived in a condition wherein he did not know the book and the faith untill Allah, the Most High, sent the Spirit who is mentioned in the book. When the Spirit was inspired (sent) to him he learned through him the knowledge and understanding. He is the Spirit whom Allah, the Most High grants to whoever He wants. When He grants him to a servant he teaches him understanding.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/174)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 720,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:56:6",
        "refs": {
          "Mentions": [
            "/books/quran:16:1",
            "/books/quran:16:2"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ سَعْدٍ الْإِسْكَافِ قَالَ أَتَى رَجُلٌ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) يَسْأَلُهُ عَنِ الرُّوحِ أَ لَيْسَ هُوَ جَبْرَئِيلَ فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) جَبْرَئِيلُ ( عليه السلام ) مِنَ الْمَلَائِكَةِ وَ الرُّوحُ غَيْرُ جَبْرَئِيلَ فَكَرَّرَ ذَلِكَ عَلَى الرَّجُلِ فَقَالَ لَهُ لَقَدْ قُلْتَ عَظِيماً مِنَ الْقَوْلِ مَا أَحَدٌ يَزْعُمُ أَنَّ الرُّوحَ غَيْرُ جَبْرَئِيلَ ",
          "فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّكَ ضَالٌّ تَرْوِي عَنْ أَهْلِ الضَّلَالِ يَقُولُ اللَّهُ تَعَالَى لِنَبِيِّهِ ( صلى الله عليه وآله ) أَتى أَمْرُ اللَّهِ فَلا تَسْتَعْجِلُوهُ سُبْحانَهُ وَ تَعالى عَمَّا يُشْرِكُونَ يُنَزِّلُ الْمَلائِكَةَ بِالرُّوحِ وَ الرُّوحُ غَيْرُ الْمَلَائِكَةِ صَلَوَاتُ اللَّهِ عَلَيْهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ali Bin Asbat, from Al Husayn Bin Abu Al A’ala, from Sa’ad Al Askaf who said, ",
            "‘A man came over to Amir Al-Momineen<sup>asws</sup> asking him<sup>asws</sup> about the Spirit, ‘Isn’t it Jibraeel<sup>as</sup>?’. So Amir Al-Momineen<sup>asws</sup> said to him: ‘Jibraeel<sup>as</sup> is from the Angels, and the Spirit is other than Jibraeel<sup>as</sup>’, and he<sup>asws</sup> reiterated that upon the man. So he said to him<sup>asws</sup>, ‘You<sup>asws</sup> have spoken a great thing from the speech. There is no one claiming that the Spirit is other than Jibraeel<sup>as</sup>’. ",
            "So Amir Al-Momineen<sup>asws</sup> said to him: ‘You have strayed and are reporting from the strayed people. Allah<sup>azwj</sup> the Exalted is Saying to His<sup>azwj</sup> Prophet<sup>saww</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h1\">[16:1]</a> Allah's Command will come, therefore do not hasten it; Glory be to Him, and Exalted is He above what they are describing <a href=\"/#/books/quran:16#h2\">[16:2]</a> He Sends down the Angels with the Spirit</span>, and the Spirit is other than the Angels, may the <span class=\"iTxt\">Salawat</span> of Allah<sup>azwj</sup> be upon them’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ali ibn Asbat from al-Husayn ibn abu al-‘Ala’ from Sa‘d al-Iskaf who has said the following. “Once a man came to Amir al-Mu’minin Ali (a.s.) asking him about the Spirit. “Is he not Jibril?” Amir al-Mu’minin Ali (a.s.) then said, “Jibril is of the angels. The Spirit is not Jibril. He repeated it to the man. The man said, “You have said something very much extraordinary. No one other than you thinks that the Spirit is somme one other than Jibril.” Amir al-Mu’minin Ali (a.s.) said to him, “You are mislead and narrate from the mislead people. Allah, the Most High has said to His Prophet (s.a.), ‘Allah’s help will certainly support (the believers), so pagans do not (seek) to hasten it. Allah is far Glorious and Exalted than to be considered equal to idols.” <a href=\"/#/books/quran:16#h1\">[16:1]</a> He sends the angels with the Spirit. The Spirit is (a creature) other than the angels (a.s.).” and say He said:"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:56",
  "kind": "verse_list"
}