{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 59"
        },
        "path": "/books/al-kafi:1:4:59",
        "titles": {
          "ar": "بَابُ أَنَّ الْإِمَامَ ( عليه السلام ) يَعْرِفُ الْإِمَامَ الَّذِي يَكُونُ مِنْ بَعْدِهِ وَ أَنَّ قَوْلَ اللَّهِ تَعَالَى إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى أَهْلِها فِيهِمْ ( عليهم السلام ) نَزَلَتْ",
          "en": "Chapter 59 – The Imams<sup>asws</sup> recognises the Imams<sup>as</sup> who would happen to be from after him<sup>asws</sup>, and that the Words of Allah<sup>azwj</sup> the Exalted [4:58] Surely Allah Commands you to make over trusts to their owners, it was Revealed regarding them<sup>asws</sup>"
        }
      }
    ],
    "index": 117,
    "local_index": 59,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:59",
    "titles": {
      "ar": "بَابُ أَنَّ الْإِمَامَ ( عليه السلام ) يَعْرِفُ الْإِمَامَ الَّذِي يَكُونُ مِنْ بَعْدِهِ وَ أَنَّ قَوْلَ اللَّهِ تَعَالَى إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى أَهْلِها فِيهِمْ ( عليهم السلام ) نَزَلَتْ",
      "en": "Chapter 59 – The Imams<sup>asws</sup> recognises the Imams<sup>as</sup> who would happen to be from after him<sup>asws</sup>, and that the Words of Allah<sup>azwj</sup> the Exalted [4:58] Surely Allah Commands you to make over trusts to their owners, it was Revealed regarding them<sup>asws</sup>"
    },
    "verse_count": 7,
    "verse_start_index": 726,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (179/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 727,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:59:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ بُرَيْدٍ الْعِجْلِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى أَهْلِها وَ إِذا حَكَمْتُمْ بَيْنَ النَّاسِ أَنْ تَحْكُمُوا بِالْعَدْلِ قَالَ إِيَّانَا عَنَى أَنْ يُؤَدِّيَ الْأَوَّلُ إِلَى الْإِمَامِ الَّذِي بَعْدَهُ الْكُتُبَ وَ الْعِلْمَ وَ السِّلَاحَ وَ إِذا حَكَمْتُمْ بَيْنَ النَّاسِ أَنْ تَحْكُمُوا بِالْعَدْلِ الَّذِي فِي أَيْدِيكُمْ ",
          "ثُمَّ قَالَ لِلنَّاسِ يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ إِيَّانَا عَنَى خَاصَّةً أَمَرَ جَمِيعَ الْمُؤْمِنِينَ إِلَى يَوْمِ الْقِيَامَةِ بِطَاعَتِنَا فَإِنْ خِفْتُمْ تَنَازُعاً فِي أَمْرٍ فَرُدُّوهُ إِلَى اللَّهِ وَ إِلَى الرَّسُولِ وَ إِلَى أُولِي الْأَمْرِ مِنْكُمْ كَذَا نَزَلَتْ وَ كَيْفَ يَأْمُرُهُمُ اللَّهُ عَزَّ وَ جَلَّ بِطَاعَةِ وُلَاةِ الْأَمْرِ وَ يُرَخِّصُ فِي مُنَازَعَتِهِمْ إِنَّمَا قِيلَ ذَلِكَ لِلْمَأْمُورِينَ الَّذِينَ قِيلَ لَهُمْ أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washha, from Ahmad Bin Aiz, from Ibn Azina, from Bureyd Al Ijaly who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:58] Surely Allah Commands you to make over trusts to their owners and that when you judge between people you judge with justice</span>. He<sup>asws</sup> said: ‘It Means us<sup>asws</sup>, that the first one<sup>asws</sup> should hand over to the Imam<sup>asws</sup> who is to be after him<sup>asws</sup>, the knowledge and the weapons <span class=\"ibTxt\">and that when you judge between people you judge with justice</span> which is in your<sup>asws</sup> hands’. ",
            "Then He<sup>azwj</sup> Said to the people <span class=\"ibTxt\">[4:59] O you who believe! Obey Allah and obey the Rasool and those in authority from among you</span>. It Means us<sup>asws</sup> in particular, the affairs of the entirety of the Momineen up to the Day of Judgment, by them being obedient to us<sup>asws</sup>,<span class=\"ibTxt\"> then if you quarrel about anything, refer it to Allah and the Rasool and to those in authority from among you</span>, <span style=\"text-decoration: underline\">like this is how it was Revealed</span>. And how can Allah<sup>azwj</sup> Mighty and Majestic with obedience to the Master<sup>asws</sup> of the Command and Allow them to quarrel with them<sup>asws</sup>. But rather, that was Said to the Commanded ones for whom<sup>asws</sup> He<sup>azwj</sup> Said to them <span class=\"ibTxt\">[4:59] O you who believe! Obey Allah and obey the Rasool and those in authority from among you</span>’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Ahmad ibn ‘A’idh from ibn ’Udhayna from Burayd al-‘Ijli who has said that I asked abu Ja‘far (a.s.) about the following verse of the Holy Quran. “Allah (God) commands you to return that which had been entrusted to you to the rightful owners. Be just when passing judgment among people. . .” (4:58) The Imam (a.s.) said, “ We are intended thereby. The preceding Imam must transfer to the succeeding Imam the books, the knowledge and the armaments. ‘Be just when passing judgment among people’ means what is in your possession. Then Allah has said to people, “Believers, obey God, His Messenger, and your leaders (who possess Divine authority). . .” (4:59) This is how it was revealed. How Allah, the Most Holy, the Most High, would command them to obey the people who possess authority and then allow people to dispute them? This is said to those who are commanded by the command of, “Believers, obey God, His Messenger, and your leaders (who possess Divine authority). . .” (4:59)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/181)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 728,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:59:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عُمَرَ قَالَ سَأَلْتُ الرِّضَا ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى أَهْلِها قَالَ هُمُ الْأَئِمَّةُ مِنْ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) أَنْ يُؤَدِّيَ الْإِمَامُ الْأَمَانَةَ إِلَى مَنْ بَعْدَهُ وَ لَا يَخُصَّ بِهَا غَيْرَهُ وَ لَا يَزْوِيَهَا عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washha, from Ahmad Bin Umar who said, ",
            "‘I asked Al-Reza<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:58] Surely Allah Commands you to make over trusts to their owners</span>. He<sup>asws</sup> said: ‘They<sup>asws</sup> are the Imams<sup>asws</sup> from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> that they<sup>asws</sup> had over the entrustment from after him<sup>saww</sup>, and He<sup>azwj</sup> did not Particularise other than him<sup>asws</sup> with it, nor impeded it from him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Ahmad ibn ‘Umar who has said that I asked abu al-Hassan al-Rida (a.s.) about the words of Allah, the Most Holy, the Most High. “Allah (God) commands you to return that which had been entrusted to you to the rightful owners. Be just when passing judgment among people. . .” (4:58) The Imam (a.s.) said, “They are the Imams (a.s.) from the family of Muhammad (s.a.) who are commanded to deliver the trust to the succeeding Imam (a.s.) exclusively and to no one else and that the succeeding Imams must not be deprived of this trust.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (183/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 729,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:59:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى أَهْلِها قَالَ هُمُ الْأَئِمَّةُ يُؤَدِّي الْإِمَامُ إِلَى الْإِمَامِ مِنْ بَعْدِهِ وَ لَا يَخُصُّ بِهَا غَيْرَهُ وَ لَا يَزْوِيهَا عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Muhammad Bin Al Fuzayl, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:58] Surely Allah Commands you to make over trusts to their owners</span>. He<sup>asws</sup> said: ‘They<sup>asws</sup> are the Imams<sup>asws</sup>. The Imam<sup>asws</sup> hands over the entrustments to the Imam<sup>asws</sup> to be from after him<sup>asws</sup>, and no one else is particularised with it apart from him<sup>asws</sup>, nor is it impeded from him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Muhammad ibn Fudayl from abu al-Hassan al-Rida (a.s.) about the following words of Allah, the Most Holy, the Most High. “Allah (God) commands you to return that which had been entrusted to you to the rightful owners. Be just when passing judgment among people. . .” (4:58) The Imam (a.s.) said, “They are the Imams (a.s.). The Imam (a.s.) must deliver the trust to the succeeding Imam (a.s.) exclusively and to no one else and that the succeeding Imams must not be deprived of this trust.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (182/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 730,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:59:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى أَهْلِها قَالَ أَمَرَ اللَّهُ الْإِمَامَ الْأَوَّلَ أَنْ يَدْفَعَ إِلَى الْإِمَامِ الَّذِي بَعْدَهُ كُلَّ شَيْ‏ءٍ عِنْدَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Is’haq Bin Ammar, from Ibn Abu Yafour, from Al Moalla Bin Khunays who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:58] Surely Allah Commands you to make over trusts to their owners</span>. Allah<sup>azwj</sup> Commanded the former Imam<sup>asws</sup> that he<sup>asws</sup> should hand over to the Imam<sup>asws</sup> who is to be from after him<sup>asws</sup>, everything which is with him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from Ishaq ibn ‘Ammar from ibn abu Ya‘fur from Mu‘alla ibn al-Khunays who has said that I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most Holy, the Most High. “Allah (God) commands you to return that which had been entrusted to you to the rightful owners.. .” (4:58) The Imam (a.s.) said, “it is the command of Allah that the preceding Imam (a.s.) transfer to the succeeding Imam (a.s.) every thing that is with him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (182/ 3)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (31/ 1)"
        ],
        "index": 731,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:59:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَمُوتُ الْإِمَامُ حَتَّى يَعْلَمَ مَنْ يَكُونُ مِنْ بَعْدِهِ فَيُوصِيَ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ibn Mahboub, from Al A’ala Bin Razeyn, from Abdullah Bin Ab Yafour, ",
            "(It has been narrated) from Abu Abdyllah<sup>asws</sup> having said: ‘An Imam<sup>asws</sup> does not pass away until he<sup>asws</sup> knows one would happen to be (an Imam<sup>asws</sup>) after him<sup>asws</sup>, so he<sup>asws</sup> bequeaths to him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from ibn Mahbub from al-‘Ala’ ibn Razin from ‘Abdallah ibn abu Ya‘fur from abu ‘Abdallah (a.s.) who has said the following. “The does not die until he learns who the succeeding Imams is so he would deliver his will to him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/182)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 732,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:59:6",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ أَبِي عُثْمَانَ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْإِمَامَ يَعْرِفُ الْإِمَامَ الَّذِي مِنْ بَعْدِهِ فَيُوصِي إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ibn Abu Usman, from Al Moalla Bin Khunays, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Imam<sup>asws</sup> recognises the one who is to be (the Imam<sup>asws</sup>) after him<sup>asws</sup>, so he<sup>asws</sup> bequeaths to him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 6. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from (ibn) abu ‘Uthman from al-Mu‘alla ibn Khunays from abu ‘Abdallah (a.s.) who has said the following “The Imam (a.s.) knows the succeeding Imam and delivers his will to him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (182/ 3)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (32/ 1)"
        ],
        "index": 733,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:59:7",
        "text": [
          "أَحْمَدُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ أَبِي عَبْدِ اللَّهِ الْبَرْقِيِّ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مَاتَ عَالِمٌ حَتَّى يُعْلِمَهُ اللَّهُ عَزَّ وَ جَلَّ إِلَى مَنْ يُوصِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Muhammad Bin Abdul Jabbar, from Abu Abdullah Al Barqy, from Fazalat Bin Ayoub, from Suleyman Bin Khalid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A scholar (Imam<sup>asws</sup>) does not pass away until Allah<sup>azwj</sup> Mighty and Majestic Lets him<sup>asws</sup> know to whom he<sup>asws</sup> should be bequeathing to’."
          ],
          "en.sarwar": [
            " 7. Ahmad has narrated from Muhammad ibn ‘Abd al-Jabbar from abu ‘Abdallah al-Barqi from Fudalah ibn Ayyub from Sulayman ibn Khalid from abu ‘Abdallah (a.s.) who has said the following. “No scholar (Imam) has ever died before Allah, the Most Holy, the Most High, would grant him the knowledge of to who must he deliver his will.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:59",
  "kind": "verse_list"
}