{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 60"
        },
        "path": "/books/al-kafi:1:4:60",
        "titles": {
          "ar": "بَابُ أَنَّ الْإِمَامَةَ عَهْدٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ مَعْهُودٌ مِنْ وَاحِدٍ إِلَى وَاحِدٍ ( عليهم السلام )",
          "en": "Chapter 60 – The Imamate is a Covenant from Allah<sup>azwj</sup> Mighty and Majestic, Covenanted from one<sup>asws</sup> to one<sup>asws</sup>"
        }
      }
    ],
    "index": 118,
    "local_index": 60,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 61"
        },
        "path": "/books/al-kafi:1:4:61",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) لَمْ يَفْعَلُوا شَيْئاً وَ لَا يَفْعَلُونَ إِلَّا بِعَهْدٍ مِنَ اللَّهِ عَزَّ وَ جَلَّ وَ أَمْرٍ مِنْهُ لَا يَتَجَاوَزُونَهُ",
          "en": "Chapter 61 – The Imams<sup>asws</sup> are not doing anything nor will they<sup>asws</sup> be doing (anything) except by a Covenant from Allah<sup>azwj</sup> Mighty and Majestic and a Command from Him<sup>azwj</sup>, not exceeding it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 59"
        },
        "path": "/books/al-kafi:1:4:59",
        "titles": {
          "ar": "بَابُ أَنَّ الْإِمَامَ ( عليه السلام ) يَعْرِفُ الْإِمَامَ الَّذِي يَكُونُ مِنْ بَعْدِهِ وَ أَنَّ قَوْلَ اللَّهِ تَعَالَى إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى أَهْلِها فِيهِمْ ( عليهم السلام ) نَزَلَتْ",
          "en": "Chapter 59 – The Imams<sup>asws</sup> recognises the Imams<sup>as</sup> who would happen to be from after him<sup>asws</sup>, and that the Words of Allah<sup>azwj</sup> the Exalted [4:58] Surely Allah Commands you to make over trusts to their owners, it was Revealed regarding them<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:60",
    "titles": {
      "ar": "بَابُ أَنَّ الْإِمَامَةَ عَهْدٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ مَعْهُودٌ مِنْ وَاحِدٍ إِلَى وَاحِدٍ ( عليهم السلام )",
      "en": "Chapter 60 – The Imamate is a Covenant from Allah<sup>azwj</sup> Mighty and Majestic, Covenanted from one<sup>asws</sup> to one<sup>asws</sup>"
    },
    "verse_count": 4,
    "verse_start_index": 733,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/183)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 734,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:60:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ قَالَ حَدَّثَنِي عُمَرُ بْنُ أَبَانٍ عَنْ أَبِي بَصِيرٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَذَكَرُوا الْأَوْصِيَاءَ وَ ذَكَرْتُ إِسْمَاعِيلَ فَقَالَ لَا وَ اللَّهِ يَا أَبَا مُحَمَّدٍ مَا ذَاكَ إِلَيْنَا وَ مَا هُوَ إِلَّا إِلَى اللَّهِ عَزَّ وَ جَلَّ يُنْزِلُ وَاحِداً بَعْدَ وَاحِدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washha who said, ‘Umar Bin Aban narrated to me, from Abu Baseer who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, so they (people) mentioned the successors<sup>asws</sup>, and mentioned Ismail (The eldest son of Abu Abdullah<sup>asws</sup>). So he<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>, O Abu Muhammad! That is not up to us<sup>asws</sup>, and it is not except up to Allah<sup>azwj</sup> Mighty and Majestic. He<sup>azwj</sup> Sends down one<sup>asws</sup> after one<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’who has said that ‘Umar ibn Aban has narrated to me from abu Basir who has said the following. “Once I was in the presence of abu ‘Abdallah (a.s.). People mentioned the executors of the will and I mentioned Isma‘il. The Imam (a.s.) said, “No, I swear by Allah. O abu Muhammad, it is not up to us. It is up to no one except Allah, the Most Holy, the Most High. He makes them descend one after the other.”"
          ]
        }
      },
      {
        "index": 735,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:60:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَمْرِو بْنِ الْأَشْعَثِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ أَ تَرَوْنَ الْمُوصِيَ مِنَّا يُوصِي إِلَى مَنْ يُرِيدُ لَا وَ اللَّهِ وَ لَكِنْ عَهْدٌ مِنَ اللَّهِ وَ رَسُولِهِ ( صلى الله عليه وآله ) لِرَجُلٍ فَرَجُلٍ حَتَّى يَنْتَهِيَ الْأَمْرُ إِلَى صَاحِبِهِ .",
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ مِنْهَالٍ عَنْ عَمْرِو بْنِ الْأَشْعَثِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Ibn Abu Umeyr, from Hammad Bin Usman, from Amro Bin Al Ash’as who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Are you viewing that the bequeathed one<sup>asws</sup> from us<sup>asws</sup> would be bequeathing to the one<sup>asws</sup> he<sup>asws</sup> so wants to? No, by Allah<sup>azwj</sup>! But, it (Imamate) is a Covenant from Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> to a man, then to a man until the command ends up to its owner’. ",
            "<span style=\"font-size: small\">Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Hammad Bin Isa, from Minhal, from Amro Bin Al Ash’as, </span>from Abu Abdullah<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from ibn abu ‘Umayr from Hammad ibn ‘Uthman from ‘Amr ibn al-Ash‘ath who has said that I heard abu ‘Abdallah (a.s.) say the following. “Do you think that a testator of us chooses whoever he wants as the executor of his will? No, I swear by Allah, it is not so. It is a covenant from Allah and His Messenger to a man and then to next man until the matter is delivered to its rightful owner.” Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from Hammad ibn ‘Isa from Minhal from ‘Amr ibn al-Ash‘ath from abu ‘Abdallah (a.s.) a similar hadith."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/184)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 736,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:60:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ عَيْثَمِ بْنِ أَسْلَمَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْإِمَامَةَ عَهْدٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ مَعْهُودٌ لِرِجَالٍ مُسَمَّيْنَ لَيْسَ لِلْإِمَامِ أَنْ يَزْوِيَهَا عَنِ الَّذِي يَكُونُ مِنْ بَعْدِهِ",
          "إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَوْحَى إِلَى دَاوُدَ ( عليه السلام ) أَنِ اتَّخِذْ وَصِيّاً مِنْ أَهْلِكَ فَإِنَّهُ قَدْ سَبَقَ فِي عِلْمِي أَنْ لَا أَبْعَثَ نَبِيّاً إِلَّا وَ لَهُ وَصِيٌّ مِنْ أَهْلِهِ وَ كَانَ لِدَاوُدَ ( عليه السلام ) أَوْلَادٌ عِدَّةٌ وَ فِيهِمْ غُلَامٌ كَانَتْ أُمُّهُ عِنْدَ دَاوُدَ وَ كَانَ لَهَا مُحِبّاً",
          "فَدَخَلَ دَاوُدُ ( عليه السلام ) عَلَيْهَا حِينَ أَتَاهُ الْوَحْيُ فَقَالَ لَهَا إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَوْحَى إِلَيَّ يَأْمُرُنِي أَنِ أَتَّخِذَ وَصِيّاً مِنْ أَهْلِي فَقَالَتْ لَهُ امْرَأَتُهُ فَلْيَكُنِ ابْنِي قَالَ ذَلِكَ أُرِيدُ وَ كَانَ السَّابِقُ فِي عِلْمِ اللَّهِ الْمَحْتُومِ عِنْدَهُ أَنَّهُ سُلَيْمَانُ",
          "فَأَوْحَى اللَّهُ تَبَارَكَ وَ تَعَالَى إِلَى دَاوُدَ أَنْ لَا تَعْجَلْ دُونَ أَنْ يَأْتِيَكَ أَمْرِي فَلَمْ يَلْبَثْ دَاوُدُ ( عليه السلام ) أَنْ وَرَدَ عَلَيْهِ رَجُلَانِ يَخْتَصِمَانِ فِي الْغَنَمِ وَ الْكَرْمِ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى دَاوُدَ أَنِ اجْمَعْ وُلْدَكَ فَمَنْ قَضَى بِهَذِهِ الْقَضِيَّةِ فَأَصَابَ فَهُوَ وَصِيُّكَ مِنْ بَعْدِكَ",
          "فَجَمَعَ دَاوُدُ ( عليه السلام ) وُلْدَهُ فَلَمَّا أَنْ قَصَّ الْخَصْمَانِ قَالَ سُلَيْمَانُ ( عليه السلام ) يَا صَاحِبَ الْكَرْمِ مَتَى دَخَلَتْ غَنَمُ هَذَا الرَّجُلِ كَرْمَكَ قَالَ دَخَلَتْهُ لَيْلًا قَالَ قَضَيْتُ عَلَيْكَ يَا صَاحِبَ الْغَنَمِ بِأَوْلَادِ غَنَمِكَ وَ أَصْوَافِهَا فِي عَامِكَ هَذَا",
          "ثُمَّ قَالَ لَهُ دَاوُدُ فَكَيْفَ لَمْ تَقْضِ بِرِقَابِ الْغَنَمِ وَ قَدْ قَوَّمَ ذَلِكَ عُلَمَاءُ بَنِي إِسْرَائِيلَ وَ كَانَ ثَمَنُ الْكَرْمِ قِيمَةَ الْغَنَمِ فَقَالَ سُلَيْمَانُ إِنَّ الْكَرْمَ لَمْ يُجْتَثَّ مِنْ أَصْلِهِ وَ إِنَّمَا أُكِلَ حِمْلُهُ وَ هُوَ عَائِدٌ فِي قَابِلٍ",
          "فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى دَاوُدَ إِنَّ الْقَضَاءَ فِي هَذِهِ الْقَضِيَّةِ مَا قَضَى سُلَيْمَانُ بِهِ يَا دَاوُدُ أَرَدْتَ أَمْراً وَ أَرَدْنَا أَمْراً غَيْرَهُ فَدَخَلَ دَاوُدُ عَلَى امْرَأَتِهِ فَقَالَ أَرَدْنَا أَمْراً وَ أَرَادَ اللَّهُ عَزَّ وَ جَلَّ أَمْراً غَيْرَهُ وَ لَمْ يَكُنْ إِلَّا مَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ فَقَدْ رَضِينَا بِأَمْرِ اللَّهِ عَزَّ وَ جَلَّ وَ سَلَّمْنَا ",
          "وَ كَذَلِكَ الْأَوْصِيَاءُ ( عليهم السلام ) لَيْسَ لَهُمْ أَنْ يَتَعَدَّوْا بِهَذَا الْأَمْرِ فَيُجَاوِزُونَ صَاحِبَهُ إِلَى غَيْرِهِ .",
          "قَالَ الْكُلَيْنِيُّ مَعْنَى الْحَدِيثِ الْأَوَّلِ أَنَّ الْغَنَمَ لَوْ دَخَلَتِ الْكَرْمَ نَهَاراً لَمْ يَكُنْ عَلَى صَاحِبِ الْغَنَمِ شَيْ‏ءٌ لِأَنَّ لِصَاحِبِ الْغَنَمِ أَنْ يُسَرِّحَ غَنَمَهُ بِالنَّهَارِ تَرْعَى وَ عَلَى صَاحِبِ الْكَرْمِ حِفْظُهُ وَ عَلَى صَاحِبِ الْغَنَمِ أَنْ يَرْبِطَ غَنَمَهُ لَيْلًا وَ لِصَاحِبِ الْكَرْمِ أَنْ يَنَامَ فِي بَيْتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Muhammad, from Bakr Bin Salih, from Muhammad Bin Suleyman, from Aysam Bin Aslam, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Imamate is a Covenant from Allah<sup>azwj</sup> Mighty and Majestic, Covenanted to a specifically named one. It isn’t for the Imam<sup>asws</sup> that he<sup>asws</sup> impedes it (holds back) from the one<sup>asws</sup> who would happen to be from after him<sup>asws</sup>. ",
            "Allah<sup>azwj</sup> Blessed and High Revealed unto Dawood<sup>as</sup>: “Take a successor<sup>as</sup> from your<sup>asws</sup> family, for it has preceded in My<sup>azwj</sup> Knowledge that I<sup>azwj</sup> shall not Send a Prophet<sup>as</sup> except that for him<sup>as</sup> would be a successor<sup>as</sup> from his<sup>as</sup> family<sup>as</sup>”. And it was so that for Dawood<sup>as</sup> were a number of children, and among them was a boy whose mother was with Dawood<sup>as</sup>, and he<sup>as</sup> loved her. ",
            "So Dawood<sup>as</sup> went over to her when he<sup>as</sup> was Given the Revelation, and he<sup>as</sup> said to her: ‘Allah<sup>azwj</sup> Mighty and Majestic Revealed unto me<sup>as</sup> Commanding me<sup>as</sup> that I<sup>as</sup> should take a successor<sup>as</sup> from my<sup>as</sup> family’. So she said to him<sup>as</sup>, ‘So let it happen to be my son’. He<sup>as</sup> said: ‘I<sup>as</sup> want that, and it has preceded in the Inevitable Knowledge of Allah<sup>azwj</sup> that he<sup>as</sup> is Suleyman<sup>as</sup>.",
            "So Allah<sup>azwj</sup> Blessed and High Revealed unto Dawood<sup>as</sup>: “Do not be hasty beside My<sup>azwj</sup> Command coming to you<sup>as</sup>”. So it was not long for Dawood<sup>as</sup> before two men came over to him<sup>as</sup> disputing with each other regarding the sheep and the vineyard. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Dawood<sup>as</sup>: “Gather your<sup>as</sup> sons, so the one who judges this judgment and is correct, so he would be your<sup>as</sup> successor<sup>as</sup> after you<sup>as</sup>”. ",
            "So Dawood<sup>as</sup> gathered his<sup>as</sup> sons. So when the two disputants related their cases, Suleyman<sup>as</sup> said: ‘O owner of the vineyard! When did these sheep of the man enter your vineyard?’ He said, ‘They entered at night’. He<sup>as</sup> said: ‘I<sup>as</sup> hereby judge against you, O owner of the sheep, with the children of your sheep and their wool during this year of yours (to be given to him as compensation)’. ",
            "Then Dawood<sup>as</sup> said to him<sup>as</sup>: ‘So how come you<sup>as</sup> did not judge with the necks of the sheep (which ate from the vineyard), and the scholars of the Children of Israel had evaluated that and the price of the vineyard as being the price of the sheep?’ So Suleyman<sup>as</sup> said: ‘The vineyard was not uprooted from its roots, and rather its load (fruits) were eaten, and these would be returning (growing again) next year’. ",
            "So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Dawood<sup>as</sup>: “The judgment regarding this is the judgement what Suleyman<sup>as</sup> judged with. O Dawood<sup>as</sup>! You<sup>as</sup> intended a matter and I<sup>azwj</sup> Intended a matter other than it”. So Dawood<sup>as</sup> went over to his<sup>as</sup> wife and he<sup>as</sup> said: ‘We wanted a matter and Allah<sup>azwj</sup> Mighty and Majestic Wanted a matter other than it, and it will not come into being except what Allah<sup>azwj</sup> Mighty and Majestic Wants. Thus, we are pleased with the Command of Allah<sup>azwj</sup> Mighty and Majestic and we submit’. ",
            "(He<sup>asws</sup> said): ‘And similar to that are the successors<sup>asws</sup>. It isn’t for them<sup>asws</sup> that they<sup>asws</sup> should be advancing with this matter, so they would be over-stepping its (rightful) owner to someone else’. ",
            "Al-Kulayni said, ‘The meaning of the First Hadeeth is that the sheep, had they entered the vineyard at daytime, there would not have been anything upon the owner of the sheep, because it is for the owner of the sheep that he releases his sheep by the day for pasture and upon the owner of the vineyard to protect it, and it is upon the owner of the sheep that he fastens (enclose in a pen) his sheep at night and for the owner of the vineyard that he sleep in his house’."
          ],
          "en.sarwar": [
            "3. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ali ibn Muhammad from Bakr ibn Salih from Muhammad ibn Sulayman from ‘Aytham ibn Aslam from Mu‘awiya ibn ‘Ammar from abu ‘Abdallah (a.s.) who has said the following. “Imamat (leadership with Divine authority) is a covenant from Allah, the Most Holy, the Most High, pledged to particularly known man. The Imam does not have the right to divert it from the succeeding Imam. Allah, the Most Holy, the Most High, sent inspiration to David to appoint the executor of his will from among your family. It is has occurred in My knowledge that shall not sent any prophet except that he will have the executor of his will from among the members of his family. David had several children. Among the members of the family members of David there was a son whose mother lived with David and he loved her very muCh David came to her when the Divine inspiration came to him and he said to her, Allah, the Most Holy, the Most High, has sent me inspirations and He wants me to appoint the executor of my will from among the members of my family. His wife asked him to appoint her son for this task. He said, “I also want what you said. “ In the foregone knowledge of Allah it was already decisively existed that executor of the will of David is Solomon. Allah, the Most Holy, the Most High, sent inspiration to David commanding him not to made hasty decisions before the coming of His order. It was not long after that two man came to David to settle a dispute over the sheep and grapes among them. Allah, the Most Holy, the Most High, sent inspiration to David to gather all of his sons together and let them judge the case. Whoever of your sons then would judge the case rightly he will be the executor of your will. David gathered all his sons. When the case was stated Solomon said, “O owner of grapes, when did the sheep of this man enter your vinyard?” He replied, “They entered at night.” Solomon said, “O owner of sheep, I have judged against you. You must give the young and the wool of your sheep to him this year.” David then said, “Why did you not judge giving away of the very sheep as the because the Israelite scholars have already evaluated them and the price of sheep is the value of grapes?” Solomon answered, “The vines are not consumed from their roots but only the fruit is consumed that will come back in future.” Allah, the Most Holy, the Most High, sent inspiration to David that the judgment in this case is the judgment of Solomon. O David, “You wanted one thing and We had wanted other than that. David came to his wife and said, “We wanted one thing but Allah, the Most Holy, the Most High, wanted a thing other than that. Nothing happened other than what Allah, the Most Holy, the Most High, had wanted. We accept the command of Allah, the Most Holy, the Most High, and submit (to His will).” The Imam (a.s.) then said, “And so are the executors of the wills. They have no right to go beyond the limit to avail it to the other people.”\n\nAl-Kulayni has said, “The meaning of the first hadith is that had the sheep have entered the vineyard during the day the owner of the sheep did not have to pay anything. The sheep owner must let them graze during the day and vineyard owner must guard his vineyard. The owner of sheep must guard his sheep at night and the owner of vineyard can rest at home.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/183)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 737,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:60:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ بُكَيْرٍ وَ جَمِيلٍ عَنْ عَمْرِو بْنِ مُصْعَبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ أَ تَرَوْنَ أَنَّ الْمُوصِيَ مِنَّا يُوصِي إِلَى مَنْ يُرِيدُ لَا وَ اللَّهِ وَ لَكِنَّهُ عَهْدٌ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِلَى رَجُلٍ فَرَجُلٍ حَتَّى انْتَهَى إِلَى نَفْسِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Ibn Bukeyr and Jameel, from Amro Bin Mus’ab who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Are you viewing that the bequeather from us<sup>asws</sup> can bequeath to the one he<sup>asws</sup> so wants to? No, by Allah<sup>azwj</sup>! But, it (Imamate) is a Covenant from Rasool-Allah<sup>saww</sup> to a man, then a man’ – until he<sup>asws</sup> ended up (naming) to himself<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from ibn Bukayr and Jamil from ‘Amr ibn Mu‘ab who has said that I heard abu ‘Abdallah (a.s.) say the following. “Do you think that a testator of us chooses whoever he wants as the executor of his will? No, I swear by Allah, it is not so. It is a covenant from the Messenger of Allah to a man and then to next man. Until the Imam (abu ‘Abdallah (a.s.) ended up to his self.” The Imam (a.s.) six times said, “To the next man.” 1. The case with David and Solomon (a.s.) is referred to in the Holy Quran (21:78 – 79) ."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:60",
  "kind": "verse_list"
}