{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 61"
        },
        "path": "/books/al-kafi:1:4:61",
        "titles": {
          "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) لَمْ يَفْعَلُوا شَيْئاً وَ لَا يَفْعَلُونَ إِلَّا بِعَهْدٍ مِنَ اللَّهِ عَزَّ وَ جَلَّ وَ أَمْرٍ مِنْهُ لَا يَتَجَاوَزُونَهُ",
          "en": "Chapter 61 – The Imams<sup>asws</sup> are not doing anything nor will they<sup>asws</sup> be doing (anything) except by a Covenant from Allah<sup>azwj</sup> Mighty and Majestic and a Command from Him<sup>azwj</sup>, not exceeding it"
        }
      }
    ],
    "index": 119,
    "local_index": 61,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/al-kafi:1:4:62",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْأُمُورِ الَّتِي</span> تُوجِبُ حُجَّةَ الْإِمَامِ ( عليه السلام )",
          "en": "Chapter 62 – The matters which are inevitable for the Divine Authority of the Imam<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 60"
        },
        "path": "/books/al-kafi:1:4:60",
        "titles": {
          "ar": "بَابُ أَنَّ الْإِمَامَةَ عَهْدٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ مَعْهُودٌ مِنْ وَاحِدٍ إِلَى وَاحِدٍ ( عليهم السلام )",
          "en": "Chapter 60 – The Imamate is a Covenant from Allah<sup>azwj</sup> Mighty and Majestic, Covenanted from one<sup>asws</sup> to one<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:61",
    "titles": {
      "ar": "بَابُ أَنَّ الْأَئِمَّةَ ( عليهم السلام ) لَمْ يَفْعَلُوا شَيْئاً وَ لَا يَفْعَلُونَ إِلَّا بِعَهْدٍ مِنَ اللَّهِ عَزَّ وَ جَلَّ وَ أَمْرٍ مِنْهُ لَا يَتَجَاوَزُونَهُ",
      "en": "Chapter 61 – The Imams<sup>asws</sup> are not doing anything nor will they<sup>asws</sup> be doing (anything) except by a Covenant from Allah<sup>azwj</sup> Mighty and Majestic and a Command from Him<sup>azwj</sup>, not exceeding it"
    },
    "verse_count": 4,
    "verse_start_index": 737,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/188)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 738,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:61:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> وَ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيٍّ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ أَبِي جَمِيلَةَ عَنْ مُعَاذِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْوَصِيَّةَ نَزَلَتْ مِنَ السَّمَاءِ عَلَى مُحَمَّدٍ كِتَاباً لَمْ يُنْزَلْ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) كِتَابٌ مَخْتُومٌ إِلَّا الْوَصِيَّةُ ",
          "فَقَالَ جَبْرَئِيلُ ( عليه السلام ) يَا مُحَمَّدُ هَذِهِ وَصِيَّتُكَ فِي أُمَّتِكَ عِنْدَ أَهْلِ بَيْتِكَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَيُّ أَهْلِ بَيْتِي يَا جَبْرَئِيلُ قَالَ نَجِيبُ اللَّهِ مِنْهُمْ وَ ذُرِّيَّتُهُ لِيَرِثَكَ عِلْمَ النُّبُوَّةِ كَمَا وَرَّثَهُ إِبْرَاهِيمُ ( عليه السلام ) وَ مِيرَاثُهُ لِعَلِيٍّ ( عليه السلام ) وَ ذُرِّيَّتِكَ مِنْ صُلْبِهِ ",
          "قَالَ وَ كَانَ عَلَيْهَا خَوَاتِيمُ قَالَ فَفَتَحَ عَلِيٌّ ( عليه السلام ) الْخَاتَمَ الْأَوَّلَ وَ مَضَى لِمَا فِيهَا ثُمَّ فَتَحَ الْحَسَنُ ( عليه السلام ) الْخَاتَمَ الثَّانِيَ وَ مَضَى لِمَا أُمِرَ بِهِ فِيهَا فَلَمَّا تُوُفِّيَ الْحَسَنُ وَ مَضَى فَتَحَ الْحُسَيْنُ ( عليه السلام ) الْخَاتَمَ الثَّالِثَ فَوَجَدَ فِيهَا أَنْ قَاتِلْ فَاقْتُلْ وَ تُقْتَلُ وَ اخْرُجْ بِأَقْوَامٍ لِلشَّهَادَةِ لَا شَهَادَةَ لَهُمْ إِلَّا مَعَكَ",
          "قَالَ فَفَعَلَ ( عليه السلام ) فَلَمَّا مَضَى دَفَعَهَا إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَبْلَ ذَلِكَ فَفَتَحَ الْخَاتَمَ الرَّابِعَ فَوَجَدَ فِيهَا أَنِ اصْمُتْ وَ أَطْرِقْ لِمَا حُجِبَ الْعِلْمُ ",
          "فَلَمَّا تُوُفِّيَ وَ مَضَى دَفَعَهَا إِلَى مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام ) فَفَتَحَ الْخَاتَمَ الْخَامِسَ فَوَجَدَ فِيهَا أَنْ فَسِّرْ كِتَابَ اللَّهِ تَعَالَى وَ صَدِّقْ أَبَاكَ وَ وَرِّثِ ابْنَكَ وَ اصْطَنِعِ الْأُمَّةَ وَ قُمْ بِحَقِّ اللَّهِ عَزَّ وَ جَلَّ وَ قُلِ الْحَقَّ فِي الْخَوْفِ وَ الْأَمْنِ وَ لَا تَخْشَ إِلَّا اللَّهَ",
          "فَفَعَلَ ثُمَّ دَفَعَهَا إِلَى الَّذِي يَلِيهِ قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ فَأَنْتَ هُوَ قَالَ فَقَالَ مَا بِي إِلَّا أَنْ تَذْهَبَ يَا مُعَاذُ فَتَرْوِيَ عَلَيَّ قَالَ فَقُلْتُ أَسْأَلُ اللَّهَ الَّذِي رَزَقَكَ مِنْ آبَائِكَ هَذِهِ الْمَنْزِلَةَ أَنْ يَرْزُقَكَ مِنْ عَقِبِكَ مِثْلَهَا قَبْلَ الْمَمَاتِ قَالَ قَدْ فَعَلَ اللَّهُ ذَلِكَ يَا مُعَاذُ قَالَ فَقُلْتُ فَمَنْ هُوَ جُعِلْتُ فِدَاكَ قَالَ هَذَا الرَّاقِدُ وَ أَشَارَ بِيَدِهِ إِلَى الْعَبْدِ الصَّالِحِ وَ هُوَ رَاقِدٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and Al Husayn Bin Muhammad, from Ja’far Bin Muhammad, from Ali Bin Al Husayn Bin Ali, from Ismail Bin Mihran, from Abu Jameela, from Muaz Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Testament descended from the sky unto Muhammad<sup>saww</sup> as an Ordinance. There did not descend unto Muhammad<sup>saww</sup> a sealed Ordinance except for the Testament.",
            "So Jibraeel<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! This here is your<sup>saww</sup> testament regarding your<sup>saww</sup> community about the People<sup>asws</sup> of your<sup>saww</sup> Household’. So Rasool-Allah<sup>saww</sup> said: ‘Which are the People<sup>asws</sup> of my<sup>saww</sup> Household, O Jibraeel<sup>as</sup>?’ He<sup>as</sup> said: ‘The noble one of Allah<sup>azwj</sup> from them and his<sup>asws</sup> offspring in order to inherit from you<sup>saww</sup> the knowledge of the Prophet-hood just as Ibrahim<sup>as</sup> made to inherit and his<sup>as</sup> inheritance is for Ali<sup>asws</sup> and your<sup>saww</sup> offspring from his<sup>asws</sup> lineage’. ",
            "He<sup>asws</sup> said: ‘And it was so that there were seals upon these. So Ali<sup>asws</sup> opened the first seal and accomplished whatever was therein. Then Al-Hassan<sup>asws</sup> opened the second seal and accomplished whatever he<sup>asws</sup> had been Commanded with therein. So when Al-Hassan<sup>asws</sup> passed away and accomplished, Al-Husayn<sup>asws</sup> opened the third seal, and he<sup>asws</sup> found therein: “Fight! So kill and be killed and go out with a group of people for the martyrdom, there being no martyrdom for them except with you<sup>asws</sup>”. ",
            "He<sup>asws</sup> said: ‘So he<sup>asws</sup> did it. So when he<sup>asws</sup> accomplished, he<sup>asws</sup> handed these (the remaining sealed Ordinances) over to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> before that. So he<sup>asws</sup> opened the fourth seal and found therein: ‘Be silent and withhold due to the blockade of the knowledge”. ",
            "So when he<sup>asws</sup> passed away and accomplished, he<sup>asws</sup> handed these over to Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>. So he<sup>asws</sup> opened the fifth seal and found therein: “Interpret the Book of Allah<sup>azwj</sup> the Exalted and ratify your<sup>asws</sup> father<sup>asws</sup>, and make your<sup>asws</sup> son to inherit, and synthesize the community, and rise by the Right of Allah<sup>azwj</sup> Mighty and Majestic, and speak the Truth during the fear and the security, and do not fear except Allah<sup>azwj</sup>”. ",
            "So he<sup>asws</sup> did it. Then he<sup>asws</sup> handed these over to the one<sup>asws</sup> who followed him<sup>asws</sup>. I said, ‘So you<sup>asws</sup> are him<sup>asws</sup>’. So he<sup>asws</sup> said: ‘What is with me<sup>asws</sup>, O Muazz, except that you will go, so you will be reporting against me<sup>asws</sup>’. So I said, ‘I ask Allah<sup>azwj</sup> Who Graced your<sup>asws</sup> forefathers<sup>asws</sup> of this status, that He<sup>azwj</sup> should Grace you<sup>asws</sup> from your<sup>asws</sup> offspring, similar to it, before the passing away’. He<sup>asws</sup> said: ‘He<sup>azwj</sup> has already Done so, O Muaz!’. So I said, ‘So who is that, may I be sacrificed for you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘This one lying (over there)’, and he<sup>asws</sup> gestured by his<sup>asws</sup> hand towards Al-Abd Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), and he<sup>asws</sup> was lying (sleeping)’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya and al-Husayn ibn Muhammad have narrated from Ja‘far ibn Muhammad from Ali ibn al-Husayn ibn Ali from Isma‘il ibn Mihran from abu Jamilah from Mu‘adh ibn Kathir from abu ‘Abdallah (a.s.) who has said the following. “The will came from the heavens to Muhammad (s.a) in a book (written) Nothing came to Muhammad (s.a) from heavens in a written sealed document form except the will. Jibril (a.s.) said, “O Muhammad (s.a) this is your will about your followers with your family. The Messenger of Allah asked, “Which family of mine O Jibril.” Jibril replied, “The noble of Allah among them (your family) and his descendents so they inherit your knowledge as Abraham left it (knowledge) as his legacy. This legacy of Abraham is for Ali (a.s.) and your descendents from his lineage.” The Imam (a.s.) has said, “The document had several seals on it.” The Imam (a.s.) has further said, “Ali (a.s.) opened the first seal and followed what the instructions therein. Then al-Hassan (a.s.) opened the second seal and followed the commandments and instructions therein. When al-Hassan (a.s.) passed away then al-Husayn (a.s.) opened the third seal and found therein instruction to fight to do away with the enemy and be murdered and rise up (against the enemy) with a group of people for martyrdom. There will be martyrdom for them without you.” The Imam (a.s.) has said, “Al-Husayn (a.s.) followed the instructions (entirely) and when he left this world he delivered it to Ali ibn al-Husayn (a.s.) just before his martyrdom. Ali ibn al-Husayn (a.s.) opened the fourth seal and found in it instruction to remain silent and gaze in your front because of the concealment of knowledge. Just before his passing away he delivered it to Muhammad ibn Ali (a.s.). He opened the fifth seal and found therein instructions to interpret the book of Allah, the Most High, affirm veracity of your father and leave it as your legacy for your son. Do good to the ’Umma (nation), stand up for right of Allah, the Most Holy, the Most High, say the truth in fear and in peace and do not be afraid of anyone except Allah. He did as he was instructed and delivered it to the succeeding Imam.” The narrator has said that he said to the Imams (a.s.), “May Allah take my soul in service for your cause, are you then the succeeding Imam?” The narrator has said that the Imams (a.s.) then said, “There is nothing wrong in a positive answer to your question except if then you would go, O Mu‘adh, and narrate to people thing that would harm me.” The narrator has said that he then said to the Imams (a.s.), “I pray to Allah who has granted you this through your noble ancestors this high position to grant to your successor the same high position before you will die.” The Imam (a.s.) said, “Allah has already done so, O Mu‘adh.” The narrator has said that he then asked the Imams (a.s.), “Who then he is, “May Allah take my soul in service for your cause?” The Imam (a.s.) replied, “This sleeping one. He pointed with his hand to the righteous servant of Allah who was asleep (Musa ibn Ja‘far (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/191)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 739,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:61:2",
        "relations": {
          "Mentions": [
            "/books/quran:15:99"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِي الْحَسَنِ الْكِنَانِيِّ عَنْ جَعْفَرِ بْنِ نَجِيحٍ الْكِنْدِيِّ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ بْنِ عُبَيْدِ اللَّهِ الْعُمَرِيِّ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَنْزَلَ عَلَى نَبِيِّهِ ( صلى الله عليه وآله ) كِتَاباً قَبْلَ وَفَاتِهِ فَقَالَ يَا مُحَمَّدُ هَذِهِ وَصِيَّتُكَ إِلَى النُّجَبَةِ مِنْ أَهْلِكَ قَالَ وَ مَا النُّجَبَةُ يَا جَبْرَئِيلُ فَقَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ وَ وُلْدُهُ ( عليهم السلام )",
          "وَ كَانَ عَلَى الْكِتَابِ خَوَاتِيمُ مِنْ ذَهَبٍ فَدَفَعَهُ النَّبِيُّ ( صلى الله عليه وآله ) إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ أَمَرَهُ أَنْ يَفُكَّ خَاتَماً مِنْهُ وَ يَعْمَلَ بِمَا فِيهِ فَفَكَّ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) خَاتَماً وَ عَمِلَ بِمَا فِيهِ ثُمَّ دَفَعَهُ إِلَى ابْنِهِ الْحَسَنِ ( عليه السلام ) فَفَكَّ خَاتَماً وَ عَمِلَ بِمَا فِيهِ",
          "ثُمَّ دَفَعَهُ إِلَى الْحُسَيْنِ ( عليه السلام ) فَفَكَّ خَاتَماً فَوَجَدَ فِيهِ أَنِ اخْرُجْ بِقَوْمٍ إِلَى الشَّهَادَةِ فَلَا شَهَادَةَ لَهُمْ إِلَّا مَعَكَ وَ اشْرِ نَفْسَكَ لِلَّهِ عَزَّ وَ جَلَّ فَفَعَلَ ثُمَّ دَفَعَهُ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) فَفَكَّ خَاتَماً فَوَجَدَ فِيهِ أَنْ أَطْرِقْ وَ اصْمُتْ وَ الْزَمْ مَنْزِلَكَ وَ اعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ ",
          "فَفَعَلَ ثُمَّ دَفَعَهُ إِلَى ابْنِهِ مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام ) فَفَكَّ خَاتَماً فَوَجَدَ فِيهِ حَدِّثِ النَّاسَ وَ أَفْتِهِمْ وَ لَا تَخَافَنَّ إِلَّا اللَّهَ عَزَّ وَ جَلَّ فَإِنَّهُ لَا سَبِيلَ لِأَحَدٍ عَلَيْكَ فَفَعَلَ ثُمَّ دَفَعَهُ إِلَى ابْنِهِ جَعْفَرٍ فَفَكَّ خَاتَماً فَوَجَدَ فِيهِ حَدِّثِ النَّاسَ وَ أَفْتِهِمْ وَ انْشُرْ عُلُومَ أَهْلِ بَيْتِكَ وَ صَدِّقْ آبَاءَكَ الصَّالِحِينَ وَ لَا تَخَافَنَّ إِلَّا اللَّهَ عَزَّ وَ جَلَّ وَ أَنْتَ فِي حِرْزٍ وَ أَمَانٍ فَفَعَلَ ",
          "ثُمَّ دَفَعَهُ إِلَى ابْنِهِ مُوسَى ( عليه السلام ) وَ كَذَلِكَ يَدْفَعُهُ مُوسَى إِلَى الَّذِي بَعْدَهُ ثُمَّ كَذَلِكَ إِلَى قِيَامِ الْمَهْدِيِّ صَلَّى اللَّهُ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad and Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ahmad Bin Muhammad, from Abu Al Hassan Al Kinany, from Ja’far Bin Najeeh Al Kindy, from Muhammad Bin Ahmad Bin Ubeydullah Al Umary, from his father, from his grandfather, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic sent an Ordinance upon His<sup>azwj</sup> Prophet<sup>saww</sup> before his<sup>saww</sup> passing away. So he (Jibraeel<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! This is your<sup>asws</sup> testament to the nobles from your<sup>saww</sup> family’. He<sup>saww</sup> said: ‘And what nobles O Jibraeel<sup>as</sup>?’ So he<sup>as</sup> said: ‘Ali<sup>asws</sup> Bin Abu Talib<sup>as</sup> and his<sup>asws</sup> sons<sup>asws</sup>’. ",
            "And it was so that there were seals of gold upon the Ordinances. So the Prophet<sup>as</sup> handed it over to Amir Al-Momineen<sup>asws</sup> and instructed him<sup>asws</sup> that he<sup>asws</sup> should untie a seal from it and act in accordance with whatever is in it. So Amir Al-Momineen<sup>asws</sup> untied a seal and acted in accordance with whatever was in it. Then he<sup>asws</sup> handed it over to Al-Hassan<sup>asws</sup>. So he<sup>asws</sup> untied a seal and acted in accordance with whatever was in it. ",
            "Then he<sup>asws</sup> handed it over to Al-Husayn<sup>asws</sup>. So he<sup>asws</sup> untied a seal, and he<sup>asws</sup> found therein: “Go out with a group of people to the martyrdom, and there is no martyrdom for them except with you<sup>asws</sup>, and give glad tidings to yourself<sup>asws</sup> for the Sake of Allah<sup>azwj</sup> Mighty and Majestic”. Then he<sup>asws</sup> handed it over to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>. So he<sup>asws</sup> untied a seal and he<sup>asws</sup> found therein: “Withhold and be silent and necessitate (staying in) your<sup>asws</sup> house <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h99\">[15:99]</a> And worship your Lord until there comes to you certainty</span>’. ",
            "So he<sup>asws</sup> did it. Then he<sup>asws</sup> handed it over to his<sup>asws</sup> son<sup>asws</sup> Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>. So he<sup>asws</sup> untied a seal and he<sup>asws</sup> found therein: “Narrate to the people and issue Verdicts to them, and do not fear anyone except Allah<sup>azwj</sup> Mighty and Majestic, for there is no way for anyone against you<sup>asws</sup>”. So he<sup>asws</sup> did it. Then he<sup>asws</sup> handed it over to his<sup>asws</sup> son<sup>asws</sup> Ja’far<sup>asws</sup>. So he<sup>asws</sup> untied a seal and he<sup>asws</sup> found therein: “Narrate to the people and issue Verdicts to them and publicise the knowledge to the People<sup>asws</sup> of your<sup>asws</sup> Household, and ratify your<sup>asws</sup> forefathers<sup>asws</sup>, the righteous ones<sup>asws</sup>, and do not fear anyone except Allah<sup>azwj</sup> Mighty and Majestic, and you<sup>asws</sup> are in Protection and Security”.",
            "Then he<sup>asws</sup> handed it over to his<sup>asws</sup> son<sup>asws</sup> Musa<sup>asws</sup>, and similar to that, Musa<sup>asws</sup> would be handing it over to the one<sup>asws</sup> who would be after him<sup>asws</sup>, up to the rising of Al-Mahdi<sup>asws</sup>, may the <span class=\"iTxt\">Salawat</span> of Allah<sup>azwj</sup> be upon him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Ahmad ibn Muhammad and Muhammad ibn Yahya have narrated from Muhammad ibn al-Husayn from Ahmad ibn Muhammad from abu al-Hassan al-Kinani from Ja‘far ibn Najih al-Kindi from Muhammad ibn Ahmad ibn ‘Ubaydallah al-‘Umari from his father from his grandfather from abu ‘Abdallah (a.s.) who has said the following. “Allah, the Most Holy, the Most High sent a document to His prophet (s.a) before his death. He then said, “O Muhammad, this is your will to the noble ones in your family.” He asked, “Who are the noble ones in my family, O Jibril?” He then said, “They are Ali ibn abu Talib and his sons (a.s.).” On the document there were several seals of gold. The Prophet (s.a) delivered it to Amir al-Mu’minin Ali (a.s.) and commanded him to open one seal and follow the instructions for him therein. Amir al-Mu’minin Ali (a.s.) then opened one seal and followed the instruction in it. Then he delivered it to his son al-Hassan (a.s.). He opened a seal and followed that which was therein. He then delivered it to al-Husayn (a.s.). He opened one seal and found therein instruction that asked him to rise for martyrdom with a group of people. That there will be no martyrdom for them except along with and sale yourself to Allah, the Most Holy, the Most High. He followed all the instructions. Then he delivered it to Ali ibn al-Husayn (a.s.). He opened one seal and found therein instructions therein that asked him to fix his gaze just before him and remain silent, secluded in your house and worship your Lord until your death will arrive. He did as he was instructed and then delivered it to his son Muhammad ibn Ali (a.s.). He opened one seal and found therein instructions that asked him to speak to people and make them learn. Do not fear anyone except Allah, the Most Holy, the Most High because no one can harm you. He followed the instructions and then delivered it to his son Ja‘far (a.s.). He opened one seal and found therein instructions that asked him to speak to people, make them learn, propagate the knowledge of your family (Ahl al-Bayt) and affirm the veracity of your righteous ancestors. Do not be afraid of anyone except Allah, the Most Holy, the Most High because you are secure and safe. He did as was instructed and then delivered it to his son Musa (a.s.).In the same Musa (a.s.) will deliver it to the succeeding Imam and so on up to the appearance of al-Mahdi (s.a) “"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/192)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 740,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:61:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ ضُرَيْسٍ الْكُنَاسِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ لَهُ حُمْرَانُ جُعِلْتُ فِدَاكَ أَ رَأَيْتَ مَا كَانَ مِنْ أَمْرِ عَلِيٍّ وَ الْحَسَنِ وَ الْحُسَيْنِ ( عليهم السلام ) وَ خُرُوجِهِمْ وَ قِيَامِهِمْ بِدِينِ اللَّهِ عَزَّ وَ جَلَّ وَ مَا أُصِيبُوا مِنْ قَتْلِ الطَّوَاغِيتِ إِيَّاهُمْ وَ الظَّفَرِ بِهِمْ حَتَّى قُتِلُوا وَ غُلِبُوا ",
          "فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَا حُمْرَانُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَدْ كَانَ قَدَّرَ ذَلِكَ عَلَيْهِمْ وَ قَضَاهُ وَ أَمْضَاهُ وَ حَتَمَهُ ثُمَّ أَجْرَاهُ فَبِتَقَدُّمِ عِلْمِ ذَلِكَ إِلَيْهِمْ مِنْ رَسُولِ اللَّهِ قَامَ عَلِيٌّ وَ الْحَسَنُ وَ الْحُسَيْنُ وَ بِعِلْمٍ صَمَتَ مَنْ صَمَتَ مِنَّا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Zureys Al Kunasy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘Humran said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! What is your<sup>asws</sup> view of what was from the matter of Ali<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and their<sup>asws</sup> going out and their<sup>asws</sup> making a stand with the Religion of Allah<sup>azwj</sup> Mighty and Majestic, and what they<sup>asws</sup> were hit with from the tyrants killing them<sup>asws</sup>, and being victorious with them<sup>asws</sup> until they<sup>asws</sup> were killed and overcome?’ ",
            "So Abu Ja’far<sup>asws</sup> said: ‘O Humran! Allah<sup>azwj</sup> Blessed and High had Determined that upon them<sup>asws</sup>, and Ordained it, and Accomplished it, and Made it to be inevitable, then Flowed it. Thus, it was by the preceding knowledge of that upon them<sup>asws</sup> from Rasool-Allah<sup>saww</sup> did Ali<sup>asws</sup> and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup> make a stand, and by (preceding) knowledge is silent, the one who is silent from us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from Durays al-Kunasi from Humran who has said that once Humran asked abu Ja‘far (a.s.) the following. “May Allah take my soul in service for your cause, ‘Why the cases of Ali al-Hassan and al-Husayn (a.s.) come about the way they did? Their rising and coming out for the religion of Allah, the Most Holy, the Most High their suffering and being murdered at the hands of the rebellious devils and their defeat until they all were murdered and defeated.’” Abu Ja‘far (a.s.) then said, “O Humran, Allah, the Most Holy, the Most High had destined it for them. So it was decreed, approved and was made unavoidable. Then He executed it but it all happened with the prior knowledge of the same through the Messenger of Allah. Ali al-Hassan and al-Husayn (a.s.) all rose for the cause of Allah with knowledge of the consequences remained silent whoever of us that remained silent.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/193)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 741,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:61:4",
        "relations": {
          "Mentions": [
            "/books/quran:36:12"
          ]
        },
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَارِثِ بْنِ جَعْفَرٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ بْنِ يَقْطِينٍ عَنْ عِيسَى بْنِ الْمُسْتَفَادِ أَبِي مُوسَى الضَّرِيرِ قَالَ حَدَّثَنِي مُوسَى بْنُ جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ أَ لَيْسَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) كَاتِبَ الْوَصِيَّةِ وَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمُمْلِي عَلَيْهِ وَ جَبْرَئِيلُ وَ الْمَلَائِكَةُ الْمُقَرَّبُونَ ( عليهم السلام ) شُهُودٌ",
          "قَالَ فَأَطْرَقَ طَوِيلًا ثُمَّ قَالَ يَا أَبَا الْحَسَنِ قَدْ كَانَ مَا قُلْتَ وَ لَكِنْ حِينَ نَزَلَ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) الْأَمْرُ نَزَلَتِ الْوَصِيَّةُ مِنْ عِنْدِ اللَّهِ كِتَاباً مُسَجَّلًا نَزَلَ بِهِ جَبْرَئِيلُ مَعَ أُمَنَاءِ اللَّهِ تَبَارَكَ وَ تَعَالَى مِنَ الْمَلَائِكَةِ فَقَالَ جَبْرَئِيلُ يَا مُحَمَّدُ مُرْ بِإِخْرَاجِ مَنْ عِنْدَكَ إِلَّا وَصِيَّكَ لِيَقْبِضَهَا مِنَّا وَ تُشْهِدَنَا بِدَفْعِكَ إِيَّاهَا إِلَيْهِ ضَامِناً لَهَا يَعْنِي عَلِيّاً ( عليه السلام ) ",
          "فَأَمَرَ النَّبِيُّ ( صلى الله عليه وآله ) بِإِخْرَاجِ مَنْ كَانَ فِي الْبَيْتِ مَا خَلَا عَلِيّاً ( عليه السلام ) وَ فَاطِمَةُ فِيمَا بَيْنَ السِّتْرِ وَ الْبَابِ فَقَالَ جَبْرَئِيلُ يَا مُحَمَّدُ رَبُّكَ يُقْرِئُكَ السَّلَامَ وَ يَقُولُ هَذَا كِتَابُ مَا كُنْتُ عَهِدْتُ إِلَيْكَ وَ شَرَطْتُ عَلَيْكَ وَ شَهِدْتُ بِهِ عَلَيْكَ وَ أَشْهَدْتُ بِهِ عَلَيْكَ مَلَائِكَتِي وَ كَفَى بِي يَا مُحَمَّدُ شَهِيداً ",
          "قَالَ فَارْتَعَدَتْ مَفَاصِلُ النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ يَا جَبْرَئِيلُ رَبِّي هُوَ السَّلَامُ وَ مِنْهُ السَّلَامُ وَ إِلَيْهِ يَعُودُ السَّلَامُ صَدَقَ عَزَّ وَ جَلَّ وَ بَرَّ هَاتِ الْكِتَابَ فَدَفَعَهُ إِلَيْهِ وَ أَمَرَهُ بِدَفْعِهِ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ لَهُ اقْرَأْهُ فَقَرَأَهُ حَرْفاً حَرْفاً فَقَالَ يَا عَلِيُّ هَذَا عَهْدُ رَبِّي تَبَارَكَ وَ تَعَالَى إِلَيَّ وَ شَرْطُهُ عَلَيَّ وَ أَمَانَتُهُ وَ قَدْ بَلَّغْتُ وَ نَصَحْتُ وَ أَدَّيْتُ",
          "فَقَالَ عَلِيٌّ ( عليه السلام ) وَ أَنَا أَشْهَدُ لَكَ بِأَبِي وَ أُمِّي أَنْتَ بِالْبَلَاغِ وَ النَّصِيحَةِ وَ التَّصْدِيقِ عَلَى مَا قُلْتَ وَ يَشْهَدُ لَكَ بِهِ سَمْعِي وَ بَصَرِي وَ لَحْمِي وَ دَمِي فَقَالَ جَبْرَئِيلُ ( عليه السلام ) وَ أَنَا لَكُمَا عَلَى ذَلِكَ مِنَ الشَّاهِدِينَ",
          "فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا عَلِيُّ أَخَذْتَ وَصِيَّتِي وَ عَرَفْتَهَا وَ ضَمِنْتَ لِلَّهِ وَ لِيَ الْوَفَاءَ بِمَا فِيهَا فَقَالَ عَلِيٌّ ( عليه السلام ) نَعَمْ بِأَبِي أَنْتَ وَ أُمِّي عَلَيَّ ضَمَانُهَا وَ عَلَى اللَّهِ عَوْنِي وَ تَوْفِيقِي عَلَى أَدَائِهَا",
          "فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا عَلِيُّ إِنِّي أُرِيدُ أَنْ أُشْهِدَ عَلَيْكَ بِمُوَافَاتِي بِهَا يَوْمَ الْقِيَامَةِ فَقَالَ عَلِيٌّ ( عليه السلام ) نَعَمْ أَشْهِدْ فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) إِنَّ جَبْرَئِيلَ وَ مِيكَائِيلَ فِيمَا بَيْنِي وَ بَيْنَكَ الْآنَ وَ هُمَا حَاضِرَانِ مَعَهُمَا الْمَلَائِكَةُ الْمُقَرَّبُونَ لِأُشْهِدَهُمْ عَلَيْكَ فَقَالَ نَعَمْ لِيَشْهَدُوا وَ أَنَا بِأَبِي أَنْتَ وَ أُمِّي أُشْهِدُهُمْ",
          "فَأَشْهَدَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ كَانَ فِيمَا اشْتَرَطَ عَلَيْهِ النَّبِيُّ بِأَمْرِ جَبْرَئِيلَ ( عليه السلام ) فِيمَا أَمَرَ اللَّهُ عَزَّ وَ جَلَّ أَنْ قَالَ لَهُ يَا عَلِيُّ تَفِي بِمَا فِيهَا مِنْ مُوَالَاةِ مَنْ وَالَى اللَّهَ وَ رَسُولَهُ وَ الْبَرَاءَةِ وَ الْعَدَاوَةِ لِمَنْ عَادَى اللَّهَ وَ رَسُولَهُ وَ الْبَرَاءَةِ مِنْهُمْ عَلَى الصَّبْرِ مِنْكَ وَ عَلَى كَظْمِ الْغَيْظِ وَ عَلَى ذَهَابِ حَقِّي وَ غَصْبِ خُمُسِكَ وَ انْتِهَاكِ حُرْمَتِكَ فَقَالَ نَعَمْ يَا رَسُولَ اللَّهِ",
          "فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ الَّذِي فَلَقَ الْحَبَّةَ وَ بَرَأَ النَّسَمَةَ لَقَدْ سَمِعْتُ جَبْرَئِيلَ ( عليه السلام ) يَقُولُ لِلنَّبِيِّ يَا مُحَمَّدُ عَرِّفْهُ أَنَّهُ يُنْتَهَكُ الْحُرْمَةُ وَ هِيَ حُرْمَةُ اللَّهِ وَ حُرْمَةُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَلَى أَنْ تُخْضَبَ لِحْيَتُهُ مِنْ رَأْسِهِ بِدَمٍ عَبِيطٍ",
          "قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَصَعِقْتُ حِينَ فَهِمْتُ الْكَلِمَةَ مِنَ الْأَمِينِ جَبْرَئِيلَ حَتَّى سَقَطْتُ عَلَى وَجْهِي وَ قُلْتُ نَعَمْ قَبِلْتُ وَ رَضِيتُ وَ إِنِ انْتَهَكَتِ الْحُرْمَةُ وَ عُطِّلَتِ السُّنَنُ وَ مُزِّقَ الْكِتَابُ وَ هُدِّمَتِ الْكَعْبَةُ وَ خُضِبَتْ لِحْيَتِي مِنْ رَأْسِي بِدَمٍ عَبِيطٍ صَابِراً مُحْتَسِباً أَبَداً حَتَّى أَقْدَمَ عَلَيْكَ ",
          "ثُمَّ دَعَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَاطِمَةَ وَ الْحَسَنَ وَ الْحُسَيْنَ وَ أَعْلَمَهُمْ مِثْلَ مَا أَعْلَمَ أَمِيرَ الْمُؤْمِنِينَ فَقَالُوا مِثْلَ قَوْلِهِ فَخُتِمَتِ الْوَصِيَّةُ بِخَوَاتِيمَ مِنْ ذَهَبٍ لَمْ تَمَسَّهُ النَّارُ وَ دُفِعَتْ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "فَقُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) بِأَبِي أَنْتَ وَ أُمِّي أَ لَا تَذْكُرُ مَا كَانَ فِي الْوَصِيَّةِ فَقَالَ سُنَنُ اللَّهِ وَ سُنَنُ رَسُولِهِ فَقُلْتُ أَ كَانَ فِي الْوَصِيَّةِ تَوَثُّبُهُمْ وَ خِلَافُهُمْ عَلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ نَعَمْ وَ اللَّهِ شَيْئاً شَيْئاً وَ حَرْفاً حَرْفاً أَ مَا سَمِعْتَ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ إِنَّا نَحْنُ نُحْيِ الْمَوْتى وَ نَكْتُبُ ما قَدَّمُوا وَ آثارَهُمْ وَ كُلَّ شَيْ‏ءٍ أَحْصَيْناهُ فِي إِمامٍ مُبِينٍ",
          "وَ اللَّهِ لَقَدْ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِأَمِيرِ الْمُؤْمِنِينَ وَ فَاطِمَةَ ( عليهما السلام ) أَ لَيْسَ قَدْ فَهِمْتُمَا مَا تَقَدَّمْتُ بِهِ إِلَيْكُمَا وَ قَبِلْتُمَاهُ فَقَالَا بَلَى وَ صَبَرْنَا عَلَى مَا سَاءَنَا وَ غَاظَنَا .",
          "وَ فِي نُسْخَةِ الصَّفْوَانِيِّ زِيَادَةٌ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ أَبِي عَبْدِ اللَّهِ الْبَزَّازِ عَنْ حَرِيزٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ مَا أَقَلَّ بَقَاءَكُمْ أَهْلَ الْبَيْتِ وَ أَقْرَبَ آجَالَكُمْ بَعْضَهَا مِنْ بَعْضٍ مَعَ حَاجَةِ النَّاسِ إِلَيْكُمْ",
          "فَقَالَ إِنَّ لِكُلِّ وَاحِدٍ مِنَّا صَحِيفَةً فِيهَا مَا يَحْتَاجُ إِلَيْهِ أَنْ يَعْمَلَ بِهِ فِي مُدَّتِهِ فَإِذَا انْقَضَى مَا فِيهَا مِمَّا أُمِرَ بِهِ عَرَفَ أَنَّ أَجَلَهُ قَدْ حَضَرَ فَأَتَاهُ النَّبِيُّ ( صلى الله عليه وآله ) يَنْعَى إِلَيْهِ نَفْسَهُ وَ أَخْبَرَهُ بِمَا لَهُ عِنْدَ اللَّهِ وَ أَنَّ الْحُسَيْنَ ( عليه السلام ) قَرَأَ صَحِيفَتَهُ الَّتِي أُعْطِيَهَا وَ فُسِّرَ لَهُ مَا يَأْتِي بِنَعْيٍ وَ بَقِيَ فِيهَا أَشْيَاءُ لَمْ تُقْضَ فَخَرَجَ لِلْقِتَالِ ",
          "وَ كَانَتْ تِلْكَ الْأُمُورُ الَّتِي بَقِيَتْ أَنَّ الْمَلَائِكَةَ سَأَلَتِ اللَّهَ فِي نُصْرَتِهِ فَأَذِنَ لَهَا وَ مَكَثَتْ تَسْتَعِدُّ لِلْقِتَالِ وَ تَتَأَهَّبُ لِذَلِكَ حَتَّى قُتِلَ فَنَزَلَتْ وَ قَدِ انْقَطَعَتْ مُدَّتُهُ وَ قُتِلَ ( عليه السلام ) فَقَالَتِ الْمَلَائِكَةُ يَا رَبِّ أَذِنْتَ لَنَا فِي الِانْحِدَارِ وَ أَذِنْتَ لَنَا فِي نُصْرَتِهِ فَانْحَدَرْنَا وَ قَدْ قَبَضْتَهُ ",
          "فَأَوْحَى اللَّهُ إِلَيْهِمْ أَنِ الْزَمُوا قَبْرَهُ حَتَّى تَرَوْهُ وَ قَدْ خَرَجَ فَانْصُرُوهُ وَ ابْكُوا عَلَيْهِ وَ عَلَى مَا فَاتَكُمْ مِنْ نُصْرَتِهِ فَإِنَّكُمْ قَدْ خُصِّصْتُمْ بِنُصْرَتِهِ وَ بِالْبُكَاءِ عَلَيْهِ فَبَكَتِ الْمَلَائِكَةُ تَعَزِّياً وَ حُزْناً عَلَى مَا فَاتَهُمْ مِنْ نُصْرَتِهِ فَإِذَا خَرَجَ يَكُونُونَ أَنْصَارَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Ahmad Bin Muhammad, from Al Haris Bin Ja’far</span><sup>asws</sup><span style=\"font-size: small\">, from Ali Bin Ismail Bin Yaqteen, from Isa Bin Al Mustafad Abu Musa Al Zareyr who said, </span>",
            "‘Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> narrated to me saying: ‘I<sup>asws</sup> said to Abu Abdullah<sup>asws</sup>: 'Wasn’t it so that Amir Al-Momineen<sup>asws</sup> was the writer of the bequest and Rasool-Allah<sup>saww</sup> dictated upon it, and Jibraeel<sup>as</sup> and the Angels of the Proximity were the witnesses?’ ",
            "He<sup>asws</sup> said: ‘So he (Abu Abdullah<sup>asws</sup>) withheld for a long while, then said: ‘O Abu Al-Hassan<sup>asws</sup>! It was so, what you<sup>asws</sup> said, but when the Command came down to Rasool-Allah<sup>saww</sup>, the bequest came down from the Presence of Allah<sup>azwj</sup> as an inscribed Ordinance. Jibraeel<sup>as</sup> descended with it with the trustworthy ones of Allah<sup>azwj</sup> Blessed and High from the Angels. So Jibraeel<sup>as</sup> said: ‘Instruct the ones in your<sup>saww</sup> presence with the exiting except for your<sup>asws</sup> successor<sup>asws</sup> in order for him<sup>asws</sup> to take charge from us<sup>as</sup>, and we<sup>as</sup> should witness your<sup>saww</sup> handing it over to him<sup>asws</sup>, as our responsibility for it’, meaning Ali<sup>asws</sup>. ",
            "So the Prophet<sup>saww</sup> instructed with the exiting of the ones who were in the room apart from Ali<sup>asws</sup>, and Fatima<sup>asws</sup> was in what is between the curtain and the door. So Jibraeel<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! Your<sup>saww</sup> Lord<sup>azwj</sup> Conveys the greetings to you<sup>saww</sup> and is Saying: “This is an Ordinance what was Covenanted to you<sup>saww</sup>, and Stipulated upon you<sup>saww</sup>, and Witnessed with upon you<sup>saww</sup>, and My<sup>azwj</sup> Angels witnessed with it upon you<sup>saww</sup>, and Suffice with Me<sup>azwj</sup>, O Muhammad<sup>saww</sup>, as a Witness”. ",
            "He<sup>asws</sup> said: ‘So the joints of the Prophet<sup>saww</sup> trembled and he<sup>saww</sup> said: ‘O Jibraeel<sup>as</sup>! He<sup>azwj</sup> is the Grantor of safety, and from Him<sup>azwj</sup> is the safety, and to Him<sup>azwj</sup> depends the safety return. The Mighty and Majestic Speaks the Truth and is Right. Give the Ordinance!’ So he<sup>as</sup> handed it over to him<sup>saww</sup> and instructed him<sup>saww</sup> for it to be handed over to Amir Al-Momineen<sup>asws</sup>, and he<sup>saww</sup> said to him<sup>asws</sup>: ‘Read it!’. So he<sup>asws</sup> read it, letter by letter. So he<sup>saww</sup> said: ‘O Ali<sup>asws</sup>!! This is a Covenant of my<sup>saww</sup> Lord<sup>azwj</sup>, Blessed and High, to me<sup>saww</sup>, and He<sup>azwj</sup> Stipulated upon me<sup>saww</sup>, and it is His<sup>azwj</sup> entrustment. And I<sup>saww</sup> have delivered, and advised, and fulfilled it’. ",
            "So Ali<sup>asws</sup> said: ‘And I<sup>asws</sup> testify for you<sup>saww</sup>, by my<sup>asws</sup> father<sup>as</sup> and my<sup>asws</sup> mother<sup>as</sup> for you<sup>saww</sup>! You<sup>saww</sup> are with the delivery and the advice and the ratification upon what you<sup>saww</sup> said, and there testify for you<sup>saww</sup> with it, my<sup>asws</sup> hearing, and my<sup>asws</sup> vision, and my<sup>asws</sup> flesh, and my<sup>asws</sup> blood’. So Jibraeel<sup>as</sup> said: ‘And I<sup>as</sup> am from the witness for the both of you<sup>asws</sup>, upon that’.",
            "So Rasool-Allah<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! Do you<sup>asws</sup> take my<sup>saww</sup> bequest and recognise it and take responsibility to Allah<sup>azwj</sup> and to me<sup>saww</sup> of the fulfilment with whatever is in it?’ So Ali<sup>asws</sup> said: ‘Yes, by my<sup>asws</sup> father<sup>as</sup> and my<sup>asws</sup> mother<sup>as</sup> for you<sup>saww</sup>! Upon me<sup>asws</sup> is its responsibility, and upon Allah<sup>azwj</sup> is His<sup>azwj</sup> Assisting me<sup>asws</sup> and Inclining me<sup>asws</sup> upon its fulfilment’. ",
            "So Rasool-Allah<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! I<sup>saww</sup> want to testify upon you<sup>asws</sup> with having been loyal to me<sup>saww</sup> with it on the Day of Judgment’. So Ali<sup>asws</sup> said: ‘Yes I<sup>asws</sup> do testify’. So the Prophet<sup>saww</sup> said: ‘Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup> are between me<sup>saww</sup> and you<sup>asws</sup> now, and they<sup>as</sup> are both present, and with them<sup>as</sup> are the Angels of Proximity to bear witness upon you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘Yes, let them bear witness, and I<sup>asws</sup>, by my<sup>asws</sup> father<sup>as</sup> and my<sup>asws</sup> mother<sup>as</sup> being for you<sup>saww</sup>, (accept them as) witnesses’. ",
            "So Rasool-Allah<sup>saww</sup> made them witnesses, and it was among what the Prophet<sup>saww</sup> stipulated upon him<sup>asws</sup>, by the instructions of Jibraeel<sup>as</sup> regarding what Allah<sup>azwj</sup> Mighty and Majestic has Commanded, that he<sup>saww</sup> said to him: ‘O Ali<sup>asws</sup>! You<sup>asws</sup> be loyal with whatever is therein from the befriending the one who befriends Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and the disavowment and the enmity to the one who is an enemy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> and the disavowment from them, upon the observance of patience from you<sup>asws</sup> and upon the swallowing of the anger, and upon the removal of my<sup>saww</sup> rights, and the usurpation of your<sup>saww</sup> <span class=\"iTxt\">Khums</span>, and the violation of your<sup>asws</sup> sanctity’. So he<sup>asws</sup> said: ‘Yes, O Rasool-Allah<sup>saww</sup>!’",
            "So Amir Al-Momineen<sup>asws</sup> said: ‘By the One<sup>azwj</sup> Who Split the seed and formed the person (in the womb), I<sup>asws</sup> have heard Jibraeel<sup>as</sup> saying to the Prophet<sup>saww</sup>: ‘O Muhammad<sup>saww</sup>! Make him<sup>asws</sup> understand: ‘Your<sup>asws</sup> sanctity will be violated, and it is a Sanctity of Allah<sup>azwj</sup> and Sanctity of Rasool-Allah<sup>saww</sup>, and upon that his<sup>asws</sup> beard would be dyed from the fresh blood of his<sup>asws</sup> head’. ",
            "Amir Al-Momineen<sup>asws</sup> said: ‘So I<sup>asws</sup> cried when I<sup>asws</sup> understood the speech from the trustworthy Jibraeel<sup>as</sup> until I<sup>asws</sup> fell down upon my<sup>asws</sup> face, and I<sup>asws</sup> said: ‘Yes, I<sup>asws</sup> accept, and am pleased, and even if the sanctity is violated, and the Sunnah is deactivated, and the Book (Quran) is shred, and the Kabah is demolished, and my<sup>asws</sup> beard is dyed from the fresh blood of my<sup>asws</sup> head. I<sup>asws</sup> shall be patient waiting Reckoning, forever, until I<sup>asws</sup> proceed to you<sup>saww</sup>’. ",
            "Then Rasool-Allah<sup>saww</sup> called over Syeda Fatima<sup>asws</sup>, and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>, and he<sup>saww</sup> let them<sup>asws</sup> know similar to what he<sup>saww</sup> had let known Amir Al-Momineen<sup>asws</sup>. So they<sup>asws</sup> said similar to his<sup>asws</sup> words. So he<sup>saww</sup> sealed the bequest with seals of gold, the fire not having touched it, and handed it over to Amir Al-Momineen<sup>asws</sup>’.",
            "So I (the narrator) said to Abu Al-Hassan<sup>asws</sup>, ‘By my father and my mother being for you<sup>asws</sup>! You<sup>asws</sup> did not mention what was in the bequest’. So he<sup>asws</sup> said: ‘Sunnah of Allah<sup>azwj</sup> and Sunnah of His<sup>azwj</sup> Rasool<sup>saww</sup>’. So I said, ‘Was there in the bequest their (enemies) attacking and their opposition to Amir Al-Momineen<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘Yes, by Allah<sup>azwj</sup>, thing by thing, and letter by letter. Have you not heard the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:36#h12\">[36:12]</a> Surely, We Revive the dead, and We Write down what they have sent before and its effects, and We have Numbered everything in a Manifest Imam</span>? ",
            "By Allah<sup>azwj</sup>! Rasool-Allah<sup>saww</sup> had said to Amir Al-Momineen<sup>asws</sup> and Fatima<sup>asws</sup>: ‘Have I<sup>saww</sup> not made you<sup>asws</sup> both understand what would be preceding to you<sup>asws</sup> both, and you<sup>asws</sup> accepted it?’ So they<sup>asws</sup> said: ‘Yes, and we<sup>asws</sup> would be patient upon what would dismay us<sup>asws</sup> and anger us<sup>asws</sup>’’.",
            "And in a copy of Al Safwany there is an increase – Ali Bin Ibrahim, from his father, from Abdullah Bin Abdul Rahman Al Asammi, from Abu Abdullah Al Bazzaz, from Hareyz who said, ",
            "‘I said to Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>! May I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>! How less is your<sup style=\"font-weight: normal\">asws</sup> remaining (life-times), People<sup style=\"font-weight: normal\">asws</sup> of the Household, and how near is your<sup style=\"font-weight: normal\">asws</sup> term from each other, along with the need of the people to you<sup style=\"font-weight: normal\">asws</sup> all’. ",
            "So he<sup style=\"font-weight: normal\">asws</sup> said: ‘For every one<sup style=\"font-weight: normal\">asws</sup> from us<sup style=\"font-weight: normal\">asws</sup> there is a Parchment wherein is what would be needed to him<sup style=\"font-weight: normal\">asws</sup> if he<sup style=\"font-weight: normal\">asws</sup> acts by it during his<sup style=\"font-weight: normal\">asws</sup> period. So when it is accomplished whatever is therein from what he<sup style=\"font-weight: normal\">asws</sup> had been Commanded with, he<sup style=\"font-weight: normal\">asws</sup> recognises that his<sup style=\"font-weight: normal\">asws</sup> term (death) has presented itself. So the Prophet<sup style=\"font-weight: normal\">saww</sup> comes over to him<sup style=\"font-weight: normal\">asws</sup>, himself<sup style=\"font-weight: normal\">saww</sup>, and informs him<sup style=\"font-weight: normal\">asws</sup> with what is for him<sup style=\"font-weight: normal\">asws</sup> in the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup>, and that Al-Husayn<sup style=\"font-weight: normal\">asws</sup> read his<sup style=\"font-weight: normal\">asws</sup> Parchment which he<sup style=\"font-weight: normal\">asws</sup> had been Given, and it was interpreted for him<sup style=\"font-weight: normal\">asws</sup> what would be coming with his<sup style=\"font-weight: normal\">asws</sup> obituary, and there remained certain things therein which were yet to be accomplished. So he<sup style=\"font-weight: normal\">asws</sup> went out for the killing (to fulfil which was remaining).",
            "And it was so, those very matters which remained (unaccomplished), the Angels asked Allah<sup>azwj</sup> with regards to helping him<sup>asws</sup>. So they were Permitted for it, and they remained preparing for the fighting and were poised for that until he<sup>asws</sup> was marytred. So they descended and his<sup>asws</sup> term had expired, and he<sup>asws</sup> had been marytered. So the Angels said: ‘O Lord<sup>azwj</sup>! You<sup>azwj</sup> Permitted for us regarding the descent, and You<sup>azwj</sup> Permitted for us regarding helping him<sup>asws</sup>. So we descended and You<sup>azwj</sup> had Captured his<sup>asws</sup> soul’. ",
            "So Allah<sup>azwj</sup> Revealed to them: “Necessitate yourselves to his<sup>asws</sup> grave until you see him<sup>asws</sup> and he<sup>asws</sup> has come out, so help him<sup>asws</sup>, and weep upon him<sup>asws</sup> and upon what was lost by you from helping him<sup>asws</sup>, for you all had been particularised with helping him<sup>asws</sup> and with the weeping upon him<sup>asws</sup>”. So the Angels wept in condolence and grief upon what had been lost by them from helping him<sup>asws</sup>. Thus, when he<sup>asws</sup> does come out (during <span class=\"iTxt\">Raj’at</span>), they would be his<sup>asws</sup> helpers’."
          ],
          "en.sarwar": [
            " 4. Al-Husayn ibn Muhammad al-Ash‘ari has narrated from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad from al-Harith ibn Ja’far from Ali ibn Isma‘il ibn Yaqtin from ‘Isa ibn al-Mustafad, abu Musa al-Darir who has said that Musa ibn Ja‘far (a.s.) narrated to me the following. “I said to abu ‘Abdallah (a.s.), ‘Was Amir al-Mu’minin Ali (a.s.) not the writer of the will, the Messenger of Allah dictating, Jibril and the prominent angels as witness?” The Imam (a.s.) has said that he remained silent for quite a while and then said, “O abu al-Hassan what you said was true, however, when the command descended up on the Messenger of Allah, the will also came in the form of a sealed document. Jibril brought it along with the trustees of Allah, the Most Holy, the Most High, from among the angels. Jibril then said, “O Muhammad (s.a) order every one to leave you except the executor of your will so he can take possession of the same and make us to bear witness that you delivered it to him and he (Ali (a.s.), take charge of the same in our presence. The Holy Prophet (s.a) ordered everyone else, except Ali (a.s.). Fatima was present between the door and the curtain. Jibril then said, “O Muhammad, your Lord declares peace and safety to you and says, “This is the documentation of My covenant that I had made with you, the conditions that I had set up and I had made My angels to bear witness to it. In fact, O Muhammad, I Myself am sufficient as a witness.” The Imam (a.s.) has said, “At that time all the joints in the body of Muhammad began to shake and shiver. He then said, “O Jibril my lord Himself is peace, from Him comes peace and to Him returns peace. He, Allah, the Most Holy, the Most High, has spoken the truth and has granted favors. Please allow me to have the document.” Jibril then delivered it to him and commanded him to deliver it to Amir al-Mu’minin Ali (a.s.). He asked Ali (a.s.) to read it. He then read it word by word. The Prophet (s.a) then said, “O Ali (a.s.), this is the covenant of my Lord, the Most Holy, the Most High, to me and His conditions upon me and His trust with me. I have now delivered it, given good-advise and fulfilled my responsibility.” Ali (a.s.) then said, “I testify in your favor, may Allah take my soul and the souls of my parents in service for your cause, for delivering the trust, granting good advise and affirmation of your speaking the truth. My ears, my eyes, my flesh and my blood all bear witness to this.” Jibril then said, “I also am of the witnesses to this fact for both of you.” The Messenger of Allah (s.a) then said, “O Ali, have you taken possession of my will, learned its contents and offered a guarantee to Allah and to me to follow the instructions therein?” Ali (a.s.) then said, “Yes, ‘may Allah take my soul and the souls of my parents in service for your cause, it is my responsibility to follow the instructions therein and from Allah comes support for me and my success in the fulfillment of my responsibility.” The Messenger of Allah then said, “O Ali, I would like to ask you to bear testimony to my promise of rewarding for it (your executing my will) on the Day of Judgment.” Ali (a.s.) said, “Yes, I do bear such testimony.” The Prophet (s.a) then said, “Jibril and Mika’il are between us now and with them present are the prominent angels. Would you agree if I would ask them to bear testimony to this fact?” He then said, “Yes, they may bear testimony and I, may Allah take my soul and the souls of my parents in service for your cause, also ask them to bear testimony.” Then the Messenger of Allah made them to bear testimony. Of the matters that the Messenger of Allah set as condition up on Ali (a.s.) on orders from Jibril of the commands of Allah, the Most Holy, the Most High, were the following. He said, “O Ali, you must follow the instruction in the will about loving those who love Allah and His Messenger and to disdain and maintain unfriendly attitude towards those who are enemies of Allah and His Messenger. It requires patience on your part and control over your anger for the usurpation of my right and the usurpation of one fifth that belongs to you and for the disregard of your respect and honor.” Ali (a.s.) then said, “Yes, O the Messenger of Allah, I accept it (this condition). Ali (a.s.) has said, “I swear by the One Who helps the seed to burst open and shapes the fetuses that I heard Jibril say to the Prophet (s.a) this. “O Muhammad, explain to him that people will disregard his respect and honor which is the respect and honor of Allah and His Messenger and that his beard will be tainted with fresh blood (from his head).” Amir al-Mu’minin Ali (a.s.) has said, “A loud sigh came out of my mouth when I understood the very words of Jibril, the trustworthy one. I fell up on my face to the ground and I said, “Yes, I accept and agree even if it will end up to the disregard of respect and honor. (I agree) even if (people) will disregard the noble traditions, insult the Book, destroy the Ka‘ba and taint my beard with fresh blood from my head. (I accept it) with patience and leave to Allah for judgement for all times until I will arrive to meet you.” The Messenger of Allah then called Fatima, al-Hassan and al-Husayn to his presence and informed them of what he had explained to Amir al-Mu’minin Ali (a.s.). They all said just like what Ali (a.s.) had said. The will was then sealed with the seals of gold that fire had not touched. It was delivered to Amir al-Mu’minin Ali (a.s.).” The narrator has said that he asked the Imam abu al-Hassan (a.s.), “May Allah take my soul and the souls of my parents in service for your cause, would you please describe what was there in the will?” The Imam (a.s.) said, “ It contained the traditions of Allah and the traditions of His Messenger.” I then asked, “Was there anything about their attacking and opposition to Amir al-Mu’minin Ali (a.s.)?” The Imam (a.s.) said, “ Yes, I swear by Allah, all and every thing was there letter by letter. Have you not heard the words of Allah, the Most Holy, the Most High, “It is We who bring the dead to life and record the deeds of human beings and their consequences (of continual effects). We keep everything recorded in an illustrious Imam (Book).” <a href=\"/#/books/quran:36#h12\">[36:12]</a> I swear by Allah that the Messenger of Allah said to Amir al-Mu’minin Ali (a.s.) and Fatima, “Did you understand well my presentation of the matter to you and did you agree to and accept it? They replied, “Yes, we did so. We will exercise patience to face what will disappoint us and cause us anger.” In the script of al-Safwan there is the following addition."
          ]
        }
      },
      {
        "part_type": "Hadith",
        "text": [
          " 5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ الله بْنِ عَبْدِ الرَّحْمَنِ الاصَمِّ عَنْ أَبِي عَبْدِ الله الْبَزَّازِ عَنْ حَرِيزٍ قَالَ قُلْتُ لابِي عَبْدِ الله (عَلَيْهِ السَّلام) جُعِلْتُ فِدَاكَ مَا أَقَلَّ بَقَاءَكُمْ أَهْلَ الْبَيْتِ وَأَقْرَبَ آجَالَكُمْ بَعْضَهَا مِنْ بَعْضٍ مَعَ حَاجَةِ النَّاسِ إِلَيْكُمْ فَقَالَ إِنَّ لِكُلِّ وَاحِدٍ مِنَّا صَحِيفَةً فِيهَا مَا يَحْتَاجُ إِلَيْهِ أَنْ يَعْمَلَ بِهِ فِي مُدَّتِهِ فَإِذَا انْقَضَى مَا فِيهَا مِمَّا أُمِرَ بِهِ عَرَفَ أَنَّ أَجَلَهُ قَدْ حَضَرَ فَأَتَاهُ النَّبِيُّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) يَنْعَى إِلَيْهِ نَفْسَهُ وَأَخْبَرَهُ بِمَا لَهُ عِنْدَ الله وَأَنَّ الْحُسَيْنَ (عَلَيْهِ السَّلام) قَرَأَ صَحِيفَتَهُ الَّتِي أُعْطِيَهَا وَفُسِّرَ لَهُ مَا يَأْتِي بِنَعْيٍ وَبَقِيَ فِيهَا أَشْيَاءُ لَمْ تُقْضَ فَخَرَجَ لِلْقِتَالِ وَكَانَتْ تِلْكَ الامُورُ الَّتِي بَقِيَتْ أَنَّ الْمَلائِكَةَ سَأَلَتِ الله فِي نُصْرَتِهِ فَأَذِنَ لَهَا وَمَكَثَتْ تَسْتَعِدُّ لِلْقِتَالِ وَتَتَأَهَّبُ لِذَلِكَ حَتَّى قُتِلَ فَنَزَلَتْ وَقَدِ انْقَطَعَتْ مُدَّتُهُ وَقُتِلَ (عَلَيْهِ السَّلام) فَقَالَتِ الْمَلائِكَةُ يَا رَبِّ أَذِنْتَ لَنَا فِي الانْحِدَارِ وَأَذِنْتَ لَنَا فِي نُصْرَتِهِ فَانْحَدَرْنَا وَقَدْ قَبَضْتَهُ فَأَوْحَى الله إِلَيْهِمْ أَنِ الْزَمُوا قَبْرَهُ حَتَّى تَرَوْهُ وَقَدْ خَرَجَ فَانْصُرُوهُ وَابْكُوا عَلَيْهِ وَعَلَى مَا فَاتَكُمْ مِنْ نُصْرَتِهِ فَإِنَّكُمْ قَدْ خُصِّصْتُمْ بِنُصْرَتِهِ وَبِالْبُكَاءِ عَلَيْهِ فَبَكَتِ الْمَلائِكَةُ تَعَزِّياً وَحُزْناً عَلَى مَا فَاتَهُمْ مِنْ نُصْرَتِهِ فَإِذَا خَرَجَ يَكُونُونَ أَنْصَارَهُ."
        ],
        "translations": {
          "en.sarwar": [
            " 5. Ali in Ibrahim has narrated from his father from ‘Abdallah ibn ‘Abd al-Rahman al-’Assam from abu ‘Abdallah al-Bazzaz from Hariz who has said the following. “I said to abu ‘Abdallah (a.s.), “May Allah take my soul in service for your cause, why is it that you members of the family of the Prophet (s.a) live such a short lives? Your deaths are so close and soon after the other Imam even though people need you so much?” The Imam (a.s.) said, “For everyone of us there is a document that contains what he needs to do within his time. When his assignment according to the commandments therein is complete he learns that his time of death has arrived. The Prophet (s.a) comes to him to give the news of his death and informs him of all that is for him with Allah. Al-Husayn (a.s.) read the document that was given to him and the news of his death was explained to him, however, certain things were not yet complete. He came out to face the enemy and of the matters that were not yet complete was that the angels had asked Allah to grant them permission to support al-Husayn (a.s.) against his enemies which He granted them. They delayed to ready themselves and prepare to fight until he was murdered. They descended but his time was over and was killed already. The angels said, “Lord, You granted us permission to descend and to help him. We descended but You have already taken his soul away. Allah then sent them inspiration that said, “Remain on his grave until you see him come out then help him. Weep for him and for your loss of the opportunity to provide him help and support. You were certainly assigned for his support and help and to weep for him. The angels then wept in mourning and sadness for their loss of the opportunity to help and support to him. When he will come out they will be of his helpers.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:61",
  "kind": "verse_list"
}