{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 64"
        },
        "path": "/books/al-kafi:1:4:64",
        "titles": {
          "ar": "بَابُ مَا نَصَّ اللَّهُ عَزَّ وَ جَلَّ وَ رَسُولُهُ عَلَى الْأَئِمَّةِ ( عليهم السلام ) وَاحِداً فَوَاحِداً",
          "en": "Chapter 64 – What was Stipulated by Allah<sup>azwj</sup> Mighty and Majestic and His<sup>azwj</sup> Rasool<sup>saww</sup> upon the Imams<sup>asws</sup>, one then one"
        }
      }
    ],
    "index": 122,
    "local_index": 64,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:64",
    "titles": {
      "ar": "بَابُ مَا نَصَّ اللَّهُ عَزَّ وَ جَلَّ وَ رَسُولُهُ عَلَى الْأَئِمَّةِ ( عليهم السلام ) وَاحِداً فَوَاحِداً",
      "en": "Chapter 64 – What was Stipulated by Allah<sup>azwj</sup> Mighty and Majestic and His<sup>azwj</sup> Rasool<sup>saww</sup> upon the Imams<sup>asws</sup>, one then one"
    },
    "verse_count": 7,
    "verse_start_index": 753,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح بسنديه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (213/ 3)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/33)"
        ],
        "index": 754,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:64:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ أَبِي سَعِيدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ فَقَالَ نَزَلَتْ فِي عَلِيِّ بْنِ أَبِي طَالِبٍ وَ الْحَسَنِ وَ الْحُسَيْنِ ( عليهم السلام )",
          "فَقُلْتُ لَهُ إِنَّ النَّاسَ يَقُولُونَ فَمَا لَهُ لَمْ يُسَمِّ عَلِيّاً وَ أَهْلَ بَيْتِهِ ( عليهم السلام ) فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ",
          "قَالَ فَقَالَ قُولُوا لَهُمْ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) نَزَلَتْ عَلَيْهِ الصَّلَاةُ وَ لَمْ يُسَمِّ اللَّهُ لَهُمْ ثَلَاثاً وَ لَا أَرْبَعاً حَتَّى كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) هُوَ الَّذِي فَسَّرَ ذَلِكَ لَهُمْ وَ نَزَلَتْ عَلَيْهِ الزَّكَاةُ وَ لَمْ يُسَمِّ لَهُمْ مِنْ كُلِّ أَرْبَعِينَ دِرْهَماً دِرْهَمٌ حَتَّى كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) هُوَ الَّذِي فَسَّرَ ذَلِكَ لَهُمْ وَ نَزَلَ الْحَجُّ فَلَمْ يَقُلْ لَهُمْ طُوفُوا أُسْبُوعاً حَتَّى كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) هُوَ الَّذِي فَسَّرَ ذَلِكَ لَهُمْ",
          "وَ نَزَلَتْ أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ وَ نَزَلَتْ فِي عَلِيٍّ وَ الْحَسَنِ وَ الْحُسَيْنِ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي عَلِيٍّ مَنْ كُنْتُ مَوْلَاهُ فَعَلِيٌّ مَوْلَاهُ وَ قَالَ ( صلى الله عليه وآله ) أُوصِيكُمْ بِكِتَابِ اللَّهِ وَ أَهْلِ بَيْتِي فَإِنِّي سَأَلْتُ اللَّهَ عَزَّ وَ جَلَّ أَنْ لَا يُفَرِّقَ بَيْنَهُمَا حَتَّى يُورِدَهُمَا عَلَيَّ الْحَوْضَ فَأَعْطَانِي ذَلِكَ وَ قَالَ لَا تُعَلِّمُوهُمْ فَهُمْ أَعْلَمُ مِنْكُمْ وَ قَالَ إِنَّهُمْ لَنْ يُخْرِجُوكُمْ مِنْ بَابِ هُدًى وَ لَنْ يُدْخِلُوكُمْ فِي بَابِ ضَلَالَةٍ",
          "فَلَوْ سَكَتَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَلَمْ يُبَيِّنْ مَنْ أَهْلُ بَيْتِهِ لَادَّعَاهَا آلُ فُلَانٍ وَ آلُ فُلَانٍ وَ لَكِنَّ اللَّهَ عَزَّ وَ جَلَّ أَنْزَلَهُ فِي كِتَابِهِ تَصْدِيقاً لِنَبِيِّهِ ( صلى الله عليه وآله ) إِنَّما يُرِيدُ اللَّهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَ يُطَهِّرَكُمْ تَطْهِيراً فَكَانَ عَلِيٌّ وَ الْحَسَنُ وَ الْحُسَيْنُ وَ فَاطِمَةُ ( عليهم السلام ) فَأَدْخَلَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَحْتَ الْكِسَاءِ فِي بَيْتِ أُمِّ سَلَمَةَ ثُمَّ قَالَ اللَّهُمَّ إِنَّ لِكُلِّ نَبِيٍّ أَهْلًا وَ ثَقَلًا وَ هَؤُلَاءِ أَهْلُ بَيْتِي وَ ثَقَلِي فَقَالَتْ أُمُّ سَلَمَةَ أَ لَسْتُ مِنْ أَهْلِكَ فَقَالَ إِنَّكِ إِلَى خَيْرٍ وَ لَكِنَّ هَؤُلَاءِ أَهْلِي وَ ثِقْلِي ",
          "فَلَمَّا قُبِضَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَانَ عَلِيٌّ أَوْلَى النَّاسِ بِالنَّاسِ لِكَثْرَةِ مَا بَلَّغَ فِيهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ إِقَامَتِهِ لِلنَّاسِ وَ أَخْذِهِ بِيَدِهِ فَلَمَّا مَضَى عَلِيٌّ لَمْ يَكُنْ يَسْتَطِيعُ عَلِيٌّ وَ لَمْ يَكُنْ لِيَفْعَلَ أَنْ يُدْخِلَ مُحَمَّدَ بْنَ عَلِيٍّ وَ لَا الْعَبَّاسَ بْنَ عَلِيٍّ وَ لَا وَاحِداً مِنْ وُلْدِهِ إِذاً لَقَالَ الْحَسَنُ وَ الْحُسَيْنُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَنْزَلَ فِينَا كَمَا أَنْزَلَ فِيكَ فَأَمَرَ بِطَاعَتِنَا كَمَا أَمَرَ بِطَاعَتِكَ وَ بَلَّغَ فِينَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَمَا بَلَّغَ فِيكَ وَ أَذْهَبَ عَنَّا الرِّجْسَ كَمَا أَذْهَبَهُ عَنْكَ ",
          "فَلَمَّا مَضَى عَلِيٌّ ( عليه السلام ) كَانَ الْحَسَنُ ( عليه السلام ) أَوْلَى بِهَا لِكِبَرِهِ فَلَمَّا تُوُفِّيَ لَمْ يَسْتَطِعْ أَنْ يُدْخِلَ وُلْدَهُ وَ لَمْ يَكُنْ لِيَفْعَلَ ذَلِكَ وَ اللَّهُ عَزَّ وَ جَلَّ يَقُولُ وَ أُولُوا الْأَرْحامِ بَعْضُهُمْ أَوْلى بِبَعْضٍ فِي كِتابِ اللَّهِ فَيَجْعَلَهَا فِي وُلْدِهِ إِذاً لَقَالَ الْحُسَيْنُ أَمَرَ اللَّهُ بِطَاعَتِي كَمَا أَمَرَ بِطَاعَتِكَ وَ طَاعَةِ أَبِيكَ وَ بَلَّغَ فِيَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَمَا بَلَّغَ فِيكَ وَ فِي أَبِيكَ وَ أَذْهَبَ اللَّهُ عَنِّي الرِّجْسَ كَمَا أَذْهَبَ عَنْكَ وَ عَنْ أَبِيكَ",
          "فَلَمَّا صَارَتْ إِلَى الْحُسَيْنِ ( عليه السلام ) لَمْ يَكُنْ أَحَدٌ مِنْ أَهْلِ بَيْتِهِ يَسْتَطِيعُ أَنْ يَدَّعِيَ عَلَيْهِ كَمَا كَانَ هُوَ يَدَّعِي عَلَى أَخِيهِ وَ عَلَى أَبِيهِ لَوْ أَرَادَا أَنْ يَصْرِفَا الْأَمْرَ عَنْهُ وَ لَمْ يَكُونَا لِيَفْعَلَا ثُمَّ صَارَتْ حِينَ أَفْضَتْ إِلَى الْحُسَيْنِ ( عليه السلام ) فَجَرَى تَأْوِيلُ هَذِهِ الْآيَةِ وَ أُولُوا الْأَرْحامِ بَعْضُهُمْ أَوْلى بِبَعْضٍ فِي كِتابِ اللَّهِ ",
          "ثُمَّ صَارَتْ مِنْ بَعْدِ الْحُسَيْنِ لِعَلِيِّ بْنِ الْحُسَيْنِ ثُمَّ صَارَتْ مِنْ بَعْدِ عَلِيِّ بْنِ الْحُسَيْنِ إِلَى مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام ) ",
          "وَ قَالَ الرِّجْسُ هُوَ الشَّكُّ وَ اللَّهِ لَا نَشُكُّ فِي رَبِّنَا أَبَداً .",
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنُ بْنُ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ أَيُّوبَ بْنِ الْحُرِّ وَ عِمْرَانَ بْنِ عَلِيٍّ الْحَلَبِيِّ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus and Ali Bin Muhammad, from Sahl Bin Ziyad Abu Saeed, from Muhammad Bin Isa, from Yunus, from Ibn Muskan, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:59] O you who believe! Obey Allah and obey the Rasool and those in authority from among you</span>. So he<sup>asws</sup> said: ‘It was Revealed regarding Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>’. ",
            "So I said to him<sup>asws</sup>, ‘The people are saying, ‘So what was the matter with Him<sup>azwj</sup> that He<sup>azwj</sup> did not Name Ali<sup>asws</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household in the Book of Allah<sup>azwj</sup> Mighty and Majestic?’ ",
            "He (the narrator) said, ‘So he<sup>asws</sup> said: ‘Say to them that Rasool-Allah<sup>azwj</sup>, the <span class=\"iTxt\">Sal</span>ā<span class=\"iTxt\">t</span> was Revealed unto him<sup>saww</sup> and Allah<sup>azwj</sup> did not Specify to them, neither three nor four until it was Rasool-Allah<sup>saww</sup>, he<sup>saww</sup> was the one who explained that to them. And the <span class=\"iTxt\">Zakāt</span> was Revealed unto him<sup>saww</sup>, and He<sup>azwj</sup> did not Specify to them it would be one Dirham from every forty Dirhams until it was Rasool-Allah<sup>saww</sup>, he<sup>saww</sup> was the one who explained that to them. And the Hajj was Revealed, but He<sup>azwj</sup> did not Say to them that they should be performing <span class=\"iTxt\">Taw</span>ā<span class=\"iTxt\">f</span> of seven circuits until it was Rasool-Allah<sup>saww</sup>, he<sup>saww</sup> was the one<sup>saww</sup> who explained that to them.",
            "And it was Revealed <span class=\"ibTxt\">[4:59] O you who believe! Obey Allah and obey the Rasool and those in authority from among you</span>, and it was Revealed regarding Ali<sup>asws</sup> and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>. So Rasool-Allah<sup>saww</sup> said regarding Ali<sup>asws</sup>: ‘The one whose Master I<sup>saww</sup> was, so Ali<sup>asws</sup> is his Master<sup>asws</sup>’. And he<sup>saww</sup> said: ‘I<sup>saww</sup> bequeath you with the Book of Allah<sup>azwj</sup> and the People<sup>asws</sup> of my<sup>saww</sup> Household, for I<sup>saww</sup> asked Allah<sup>azwj</sup> Mighty and Majestic that there should be no separation between the two until they both return to me<sup>saww</sup> at the Fountain. So He<sup>azwj</sup> Granted me<sup>saww</sup> that’. And he<sup>saww</sup> said: ‘Do not (try to) teach them<sup>asws</sup>, for they<sup>asws</sup> are more learned than you all’. And said: ‘They<sup>asws</sup> will never exit you from a door of Guidance and will never enter you into a door of straying’. ",
            "So, had Rasool-Allah<sup>saww</sup> remained silent and did not clarify who the People<sup>asws</sup> of his<sup>saww</sup> Household were, they would have claimed it, the family of so and so, and family of so and so, but Allah<sup>azwj</sup> Mighty and Majestic Revealed it in His<sup>azwj</sup> Book in Ratification of His<sup>azwj</sup> Prophet<sup>saww</sup><span class=\"ibTxt\"> [33:33] But rather, Allah Desires to Keep away the uncleanness from you, O people of the House! And to Purify you a with a Purification</span>. So it was Ali<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and Syeda Fatima<sup>asws</sup>. So Rasool-Allah<sup>saww</sup> included them<sup>asws</sup> underneath the cloak in the room of Umm Salma<sup>as</sup>, then said: ‘O Allah<sup>azwj</sup>! For every Prophet<sup>saww</sup> are family members, and reliable ones, they<sup>asws</sup> are the People<sup>asws</sup> of my<sup>saww</sup> Household and my<sup>saww</sup> reliable ones’. So Umm Salma<sup>as</sup> said: ‘Aren’t I<sup>as</sup> from your<sup>as</sup> family?’ So he<sup>saww</sup> said: ‘You<sup>asws</sup> are towards goodness, but they<sup>asws</sup> are my<sup>asws</sup> family<sup>asws</sup> and my reliable ones’. ",
            "So when Rasool-Allah<sup>saww</sup> passed away, it was Ali<sup>asws</sup> who was the closest of the people (of Holy family<sup>asws</sup>) than the (other) people due to the abundance of what Rasool-Allah<sup>saww</sup> had delivered with regards to him<sup>asws</sup>, and his<sup>saww</sup> standing him<sup>asws</sup> for the people and grabbing him<sup>asws</sup> by the hand. So when Ali<sup>asws</sup> passed away, Ali<sup>asws</sup> did not have the leeway and would not do so that he<sup>asws</sup> should include Muhammad Bin Ali<sup>asws</sup> nor Al-Abbas<sup>asws</sup> Bin Ali<sup>asws</sup>, nor anyone from his<sup>asws</sup> sons, when Al-Hassan<sup>asws</sup> and Al-Husayn Could have said: ‘Allah<sup>azwj</sup> Blessed and High Revealed regarding us<sup>asws</sup> just as He<sup>azwj</sup> Revealed regarding you<sup>asws</sup>, so He<sup>azwj</sup> Commanded with obedience for us<sup>asws</sup> just as He<sup>azwj</sup> Commanded with obedience for you<sup>asws</sup>, and Rasool-Allah<sup>saww</sup> delivered regarding us<sup>asws</sup> just as he<sup>saww</sup> delivered regarding you<sup>asws</sup>, and He<sup>azwj</sup> Removed the uncleanness from us<sup>asws</sup> just as He<sup>azwj</sup> Removed it from you<sup>asws</sup>’. ",
            "So when Ali<sup>asws</sup> passed away, it was Al-Hassan<sup>asws</sup> who was closest with it due to his being elder. So when he<sup>asws</sup> passed away, he<sup>asws</sup> did not have the leeway that he<sup>asws</sup> should include his<sup>asws</sup> son, and he<sup>asws</sup> would not have done that and Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[33:6] and the possessors of relationships are nearer to each other in the Ordinance of Allah</span>, so he<sup>asws</sup> would make it to be in his<sup>asws</sup> son, when Al-Husayn<sup>asws</sup> could have said: ‘Allah<sup>azwj</sup> has Commanded with obedience to me<sup>asws</sup> just as He<sup>azwj</sup> had Commanded with obedience to you<sup>asws</sup> and obedience to your<sup>asws</sup> father<sup>asws</sup>, and Rasool-Allah<sup>saww</sup> delivered regarding me<sup>asws</sup> just as he<sup>saww</sup> delivered regarding you<sup>asws</sup> and regarding your<sup>asws</sup> father<sup>asws</sup>, and Allah<sup>azwj</sup> Removed the uncleanness from me<sup>asws</sup> just as He<sup>azwj</sup> had Removed it from you<sup>asws</sup> and from your<sup>asws</sup> father<sup>asws</sup>’. ",
            "So when it (Imamate) came to be to Al-Husayn<sup>asws</sup>, there did not happen to be a leeway from any one from his<sup>asws</sup> family that he should claim upon it just as he<sup>asws</sup> had a claim upon his<sup>asws</sup> brother<sup>asws</sup>, and upon his<sup>asws</sup> father<sup>asws</sup>. Had he<sup>asws</sup> intended to divert the matter from him<sup>asws</sup>, he<sup>asws</sup> could not have done so. Then, it came to be, as a result, to Al-Husayn<sup>asws</sup>. And so flowed the explanation of this Verse <span class=\"ibTxt\">[33:6] and the possessors of relationships are nearer to each other in the Ordinance of Allah</span>. ",
            "Then it came to be, from after Al-Husayn<sup>asws</sup>, to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>. Then it came to be, from after Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, to Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>’. ",
            "And he<sup>asws</sup> said: ‘The ‘الرِّجْسُ’ uncleanness, it is the doubt. By Allah<sup>azwj</sup>! We<sup>asws</sup> do not doubt in our<sup>asws</sup> Lord<sup>azwj</sup>, ever!’ ",
            "<span style=\"font-size: small\">Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid and Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Bin Imran Al Halby, from Ayoub Bin Al Hurr and Imran Bin Ali Al Halby, from Abu Baseer, </span>from Abu Abdullah<sup>asws</sup>, similar to that."
          ],
          "en.sarwar": [
            " 1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus and Ali ibn Muhammad from Sahl ibn Ziyad, abu Sa‘id from Muhammad ibn ‘Isa from Yunus from ibn Muskan from abu Basir who has said that he asked abu ‘Abdallah (a.s.) about the following words of Allah, the Most Holy, the Most High. “Believers, obey God, His Messenger, and your leaders (who possess Divine authority). . .” (4:59) The Imam (a.s.) said, “This was sent from heavens about Ali ibn abu talib al-Hassan and al-Husayn (a.s.).” I then said, “People say, “Why did He not specify Ali and his family by their names in the book of Allah, the Most Holy, the Most High?’” The Imam (a.s.) said, “Say to them, ‘The command for prayer came to the Messenger of Allah but He has not specified (the number of the Rak‘ats) for them three nor four. It, in fact, was the Messenger of Allah who explained to them this matter. The command for Zakat (a form of income tax) came to the Messenger of Allah and there was no specific taxable number such as one Dirham on every forty Dirham. It was the Messenger of Allah who explained it for them. The command for Hajj came to the Messenger of Allah. It did not say walk senven times around the Ka‘ba It was the Messenger of Allah who explained it for them. The verse about obedience came “Believers, obey God, His Messenger, and your leaders (who possess Divine authority). . .” (4:59) It came to declare that Ali, al-Hassan and al-Husayn (a.s.) were the leards who possessed Divine authority. The Messenger of Allah then said about Ali (a.s.), “On whoever I have Divine Authority, then Ali (a.s.) has Divne Authority over him also.” He also has said, “I enjoin you to follow the book of Allah and my family because have prayed to Allah, the Most Holy, the Most High not to separate these two from eachother until He will make them arrive al-Kawthar (at the pool of Paradise) to meet me. He has granted my prayer as suCh” The Holy Prophet (s.a.) has said, “Do not try to teach them (The Imam (a.s.) becaue they are far more knowledgeable than you.” The Holy Prophet (s.a.) has said, “The Imam (a.s.) will never take you out of the gate of guidance and they never make you enter the gate of misguidance.” Had the Messenger of Allah remained silent and would not explain anything about his Ahl al-Bayt (family) the family of so and so would have advanced their claim for Imamat (Leadership with Divine Authority). However, Allah, the Most Holy, the Most High, has revealed it in His book to confirm the explanantions of His Prophet about Ahl al-Bayt (in the following verse), “People of the house, God wants to remove all kinds of uncleanliness from you and to purify you thoroughly.” (33:33) Ali, Fatima, al-Hassan andlhy (a.s.) were there and the Holy Prophet (s.a.) made them to enter under al-Kisa’ (the Cloack) in the house of ’Umm salama and then said, “O Lord, every prophet has a family and a gravity, and these are my family and gravity.” ’Umm Salama at this point said, “Am I not of your family?” The Holy Prophet (s.a.) said, “You are in goodness but these are my family and my gravity.” Whe the Messenger of Allah passed away Ali (a.s.) had the utmost priority and guardianship of the people all because of what the Messenger of Allah had preached about him. It was because of raising him up for the people and holding his hand in his hand. When Ali (a.s.) (was about to) passed away he could not (and would not) enter Muhammad ibn Ali or al-‘Abbass ibn Ali or anyone of his other sons in the position of Imamt. Otherewise, al-Hassan and al-Husayn (a.s.) would have said, “Allah, the Most Holy, the Most High, has revealed about us jus as He has done so about you, and He has commaned people to obey us just as He has commanded people to obey you. The Messenger of Allah has preached to people about us just as he has done so about you. Allah has removed al-Rijs uncleanliness from us just as He has done so to you. When Ali (a.s.) left this world, al-Hassan had the utmost priority for Imamat (Leadership with Divine Authority) because he was the eldest. When was about to die he could not, and would not, enter his sons in the position of Imamat.It is because ;Allah, the Most Holy, the Most High, says, “. . The relatives are closer to each other, according to the Book of God, than the believers and the emigrants. .” (33:6) He then places Imamat (Leadership with Divine Authority) in his sons. If so, al-Husayn (a.s.) would have said, “Allah has commanded people to obey me just as He has commanded people to obey you and to obey your father. The Messenger of Allah has preached to people about me just as he has preached to people about you and your father. Allah has removed al-Rijs (unleanliness) from me just as He has removed from you and your father. When the Imamat (Leadership with Divine Authority) was infull force with al-Husayn (a.s.) there was no one in his family to who could claim against him as he could calim against his brother and father, had they wanted to diver it from him and they would not do so. After them it found its place with al-Husayn (a.s.) and the interpretation of this verse continued, “. . The relatives are closer to each other, according to the Book of God, than the believers and the emigrants. . .” (33:6) After al-Husayn (a.s.) Imamat (Leadership with Divine Authority) found its place with Ali ibn al-Husayn (a.s.). After Ali ibn al-Husayn (a.s.) it (Leadership with Divine Authority) found its place with Muhammad ibn Ali (a.s.).” The Imam (a.s.) said, “Al-Rijs means doubts, I swear by Allah that we never doubt in our Lord.” Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Khalid and al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya ibn ‘Imran al-Halabi from Ayyub ibn al-Hurr and ‘Imran ibn Ali al-Halabi from abu ‘Abdallah (a.s.) a similar hadith."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (249/ 3)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/35)"
        ],
        "index": 755,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:64:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنِ ابْنِ مُسْكَانَ عَنْ عَبْدِ الرَّحِيمِ بْنِ رَوْحٍ الْقَصِيرِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ النَّبِيُّ أَوْلى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ وَ أَزْواجُهُ أُمَّهاتُهُمْ وَ أُولُوا الْأَرْحامِ بَعْضُهُمْ أَوْلى بِبَعْضٍ فِي كِتابِ اللَّهِ فِيمَنْ نَزَلَتْ فَقَالَ نَزَلَتْ فِي الْإِمْرَةِ إِنَّ هَذِهِ الْآيَةَ جَرَتْ فِي وُلْدِ الْحُسَيْنِ ( عليه السلام ) مِنْ بَعْدِهِ فَنَحْنُ أَوْلَى بِالْأَمْرِ وَ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنَ الْمُؤْمِنِينَ وَ الْمُهَاجِرِينَ وَ الْأَنْصَارِ ",
          "قُلْتُ فَوُلْدُ جَعْفَرٍ لَهُمْ فِيهَا نَصِيبٌ قَالَ لَا قُلْتُ فَلِوُلْدِ الْعَبَّاسِ فِيهَا نَصِيبٌ فَقَالَ لَا فَعَدَدْتُ عَلَيْهِ بُطُونَ بَنِي عَبْدِ الْمُطَّلِبِ كُلَّ ذَلِكَ يَقُولُ لَا قَالَ وَ نَسِيتُ وُلْدَ الْحَسَنِ ( عليه السلام ) فَدَخَلْتُ بَعْدَ ذَلِكَ عَلَيْهِ فَقُلْتُ لَهُ هَلْ لِوُلْدِ الْحَسَنِ ( عليه السلام ) فِيهَا نَصِيبٌ فَقَالَ لَا وَ اللَّهِ يَا عَبْدَ الرَّحِيمِ مَا لِمُحَمَّدِيٍّ فِيهَا نَصِيبٌ غَيْرَنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from his father, from Abdullah Bin Al Mugheira, from Ibn Muskan, from Abdul Raheem Bin Rawh Al Qaseyr, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[33:6] The Prophet is closer to the Believers than their own selves, and his wives are their mothers; and the possessors of relationships some of them are closer to others in the Book of Allah</span>, ‘Regarding whom was it Revealed?’ So he<sup>asws</sup> said: ‘It was Revealed regarding (Divine) Authority. This Verse flowed among the sons of Al-Husayn<sup>asws</sup> from after him<sup>asws</sup>. Thus we<sup>asws</sup> are the closest with the Authority and with Rasool-Allah<sup>saww</sup> from the Momineen and the Emigrants and the Helpers’. ",
            "I said, ‘So the sons of Ja’far<sup>as</sup> (Al-Tayyar), is there a share for them in it?’ He<sup>asws</sup> said: ‘No’. I said, ‘So the son of Al-Abbas, is there a share in it?’ So he<sup>asws</sup> said No’. So I number upon him<sup>asws</sup> the bellies (womb relationships) of the sons of Abdul Muttalib<sup>as</sup>. For each of that he<sup>asws</sup> was saying: ‘No’. And I forgot the sons of Al-Hassan<sup>as</sup>, so I went over to him<sup>asws</sup> after that and I said to him<sup>asws</sup>, ‘Is there for the sons of Al-Hassan<sup>asws</sup> a share in it?’ So he<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>, O Abdul Rahman! There is not for a Muhammady a share in it apart from us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isi from his father from ‘Abdallah ibn al-Mughirah from ibn Muskan from ‘Abd al-Rahim ibn Ruh al-Qasir from abu Ja‘far (a.s.) who has said the following about the words of Allah, the Most Holy, the Most High. “The Prophet has more authority over the believers than themselves. His wives are their mothers. The relatives are closer to each other, according to the Book of God, than the believers and the emigrants. However, you may show kindness to your guardians. This also is written in the Book.” (33:6) About who this verse has come? He then said, “It came about the governance (Leadership with Divine Authority). This verse continued to apply to the lineage of al-Husayn (a.s.) after him. We, thus, are of a proirity to governance (Leadership with Divine Authority) and to the Messenger of Allah than the beleivers of immigrants and the Ansar.” The narrator has said that then he asked the Imam (a.s.), “Do the sons of Ja‘far have any share in it?” The Imam (a.s.) said,”No, they do not have any share in it.” I asked, “Do the sons of al-‘Abbass have any hsare in it?” He said , “No, they do not have any share in it.” I counted for him the folks from the descendents of ‘Abd al-Muttalib and in answer to all he would say, “No.” The narrator has said that then he forgot the sons of al-Hassan (a.s.). I went to see at another time andasked him, “Do the sons of al-Hassan (a.s.) have any share in it?” He replied, “No, I sweatr by Allah, O ‘Abd al-Rahim, no one related to Muhammad has any share in it except us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/249)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 756,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:64:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْهَاشِمِيِّ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّما وَلِيُّكُمُ اللَّهُ وَ رَسُولُهُ وَ الَّذِينَ آمَنُوا قَالَ إِنَّمَا يَعْنِي أَوْلَى بِكُمْ أَيْ أَحَقُّ بِكُمْ وَ بِأُمُورِكُمْ وَ أَنْفُسِكُمْ وَ أَمْوَالِكُمُ اللَّهُ وَ رَسُولُهُ وَ الَّذِينَ آمَنُوا يَعْنِي عَلِيّاً وَ أَوْلَادَهُ الْأَئِمَّةَ ( عليهم السلام ) إِلَى يَوْمِ الْقِيَامَةِ ",
          "ثُمَّ وَصَفَهُمُ اللَّهُ عَزَّ وَ جَلَّ فَقَالَ الَّذِينَ يُقِيمُونَ الصَّلاةَ وَ يُؤْتُونَ الزَّكاةَ وَ هُمْ راكِعُونَ وَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي صَلَاةِ الظُّهْرِ وَ قَدْ صَلَّى رَكْعَتَيْنِ وَ هُوَ رَاكِعٌ وَ عَلَيْهِ حُلَّةٌ قِيمَتُهَا أَلْفُ دِينَارٍ وَ كَانَ النَّبِيُّ ( صلى الله عليه وآله ) كَسَاهُ إِيَّاهَا وَ كَانَ النَّجَاشِيُّ أَهْدَاهَا لَهُ ",
          "فَجَاءَ سَائِلٌ فَقَالَ السَّلَامُ عَلَيْكَ يَا وَلِيَّ اللَّهِ وَ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ تَصَدَّقْ عَلَى مِسْكِينٍ فَطَرَحَ الْحُلَّةَ إِلَيْهِ وَ أَوْمَأَ بِيَدِهِ إِلَيْهِ أَنِ احْمِلْهَا فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ فِيهِ هَذِهِ الْآيَةَ وَ صَيَّرَ نِعْمَةَ أَوْلَادِهِ بِنِعْمَتِهِ فَكُلُّ مَنْ بَلَغَ مِنْ أَوْلَادِهِ مَبْلَغَ الْإِمَامَةِ يَكُونُ بِهَذِهِ الصِّفَةِ مِثْلَهُ فَيَتَصَدَّقُونَ وَ هُمْ رَاكِعُونَ وَ السَّائِلُ الَّذِي سَأَلَ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) مِنَ الْمَلَائِكَةِ وَ الَّذِينَ يَسْأَلُونَ الْأَئِمَّةَ مِنْ أَوْلَادِهِ يَكُونُونَ مِنَ الْمَلَائِكَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad, from Al Hassan Bin Muhammad Al Hashimy, from his father, from Ahmad Bin Isa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[5:55] But rather, only Allah is your Guardian and His Rasool and those who believe</span>. He<sup>asws</sup> said: ‘But rather it Means, ‘Closest with you’, i.e., ‘more rightful with you and with your affairs and your own selves and your wealth’, Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> and those who believe, Meaning Ali<sup>asws</sup> and his<sup>asws</sup> children, the Imams<sup>asws</sup> up to the Day of Judgment. ",
            "Then Allah<sup>azwj</sup> Mighty and Majestic Described them, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[5:55] those who are establishing the Prayers and are paying the Zakāt while bowing</span>, and it was Amir Al-Momineen<sup>asws</sup> during the Zohr <span class=\"iTxt\">Salāt</span>, and he<sup>asws</sup> had already prayed two Cycles (of it) and he<sup>asws</sup> was bowing (performing <span class=\"iTxt\">Ruku</span>’) and upon him<sup>asws</sup> was an apparel the price of which was a thousand Dinars, and it was the Prophet<sup>saww</sup> who had clothed him<sup>asws</sup> with it, and it was (the Ethiopian king) Al-Najjashy who had gifted it to him<sup>saww</sup>. ",
            "So a beggar came over and said, ‘The greeting be upon you<sup>asws</sup>, O Guardian<sup>asws</sup> of Allah<sup>azwj</sup>, and the one closest with the Momineen than their own selves, give charity to upon a poor one’. So he<sup>asws</sup> dropped the apparel to him and gestured with his<sup>asws</sup> hand towards it that he should carry it away. So Allah<sup>azwj</sup> Mighty and Majestic Revealed this Verse with regards to it, and the Bounty of his<sup>asws</sup> children can to be with his<sup>asws</sup> Bounty. So everyone from his<sup>asws</sup> children to whom reached the Imamate, happened to be with this characteristic similar to him<sup>asws</sup>, so they<sup>asws</sup> (also) were giving charity while they were bowing (performing <span class=\"iTxt\">Ruku</span>’); and the beggar who begged from Amir Al-Momineen<sup>asws</sup> was from the Angels, and those who are begging the Imams<sup>asws</sup> from his<sup>asws</sup> children are (all) happening to be from the Angels’."
          ],
          "en.sarwar": [
            " 3. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad from al-Hassan ibn Muhammad al-Hashimi from his father from Ahmad ibn ‘Isa from abu ‘Abdallah (a.s.). The Imam (a.s.) has said the following about the words of Allah, the Most Holy, the Most High. “Only God, His Messenger, and the true believers who are steadfast in prayer and pay alms, while they kneel during prayer, are your guardians.” (5:55) It means to have greater priority and authority to deal with your affairs, your souls and your property. Such priority and authority belong to Allah His Messenger and the believers, Ali and his descendents who are the Imams until the Day of Judgment. Allah, the Most Holy, the Most High, has then described them saying, “. . the true believers who are steadfast in prayer and pay alms, while they kneel during prayer,. .” Amir al-Mu’minin Ali (a.s.) was praying Zuhr (early afternoon) he was in the second Ruku‘ (bowing ddown). He was wearing a gown that vallued a thousand Dinar (unit of money). The Holy Prophet (s.a) had made him t wear it. King Najashi had sent it as present to him. A begger came and said the Islamic greeting words, “Be in peace O Allah’s authority and the aauthority over the believers who possesses greater priority over them than their onw selves. Give some charity to a destitute. He threw the gown to the begger and pointed with his hand to pick up and take it. At such time Allah, the Most Holy, the Most High, sent this verse of the Holy Quran. He combined His blessings with hiis belessing in the form of his children. Whoever of his children with whom Imamat found place was due to this blessing was like him (in giving charity). They would give charity while bowed down in Ruku‘ of prayer. The begger that asked Amir al-Mu’minin Ali (a.s.) for chaarity was from the angels. Those who ask the Imams from his children will also be from the angels.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (250/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 757,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:64:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ وَ الْفُضَيْلِ بْنِ يَسَارٍ وَ بُكَيْرِ بْنِ أَعْيَنَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ وَ بُرَيْدِ بْنِ مُعَاوِيَةَ وَ أَبِي الْجَارُودِ جَمِيعاً عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَمَرَ اللَّهُ عَزَّ وَ جَلَّ رَسُولَهُ بِوَلَايَةِ عَلِيٍّ وَ أَنْزَلَ عَلَيْهِ إِنَّما وَلِيُّكُمُ اللَّهُ وَ رَسُولُهُ وَ الَّذِينَ آمَنُوا الَّذِينَ يُقِيمُونَ الصَّلاةَ وَ يُؤْتُونَ الزَّكاةَ وَ فَرَضَ وَلَايَةَ أُولِي الْأَمْرِ ",
          "فَلَمْ يَدْرُوا مَا هِيَ فَأَمَرَ اللَّهُ مُحَمَّداً ( صلى الله عليه وآله ) أَنْ يُفَسِّرَ لَهُمُ الْوَلَايَةَ كَمَا فَسَّرَ لَهُمُ الصَّلَاةَ وَ الزَّكَاةَ وَ الصَّوْمَ وَ الْحَجَّ فَلَمَّا أَتَاهُ ذَلِكَ مِنَ اللَّهِ ضَاقَ بِذَلِكَ صَدْرُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ تَخَوَّفَ أَنْ يَرْتَدُّوا عَنْ دِينِهِمْ وَ أَنْ يُكَذِّبُوهُ",
          "فَضَاقَ صَدْرُهُ وَ رَاجَعَ رَبَّهُ عَزَّ وَ جَلَّ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ وَ إِنْ لَمْ تَفْعَلْ فَما بَلَّغْتَ رِسالَتَهُ وَ اللَّهُ يَعْصِمُكَ مِنَ النَّاسِ",
          "فَصَدَعَ بِأَمْرِ اللَّهِ تَعَالَى ذِكْرُهُ فَقَامَ بِوَلَايَةِ عَلِيٍّ ( عليه السلام ) يَوْمَ غَدِيرِ خُمٍّ فَنَادَى الصَّلَاةَ جَامِعَةً وَ أَمَرَ النَّاسَ أَنْ يُبَلِّغَ الشَّاهِدُ الْغَائِبَ ",
          "قَالَ عُمَرُ بْنُ أُذَيْنَةَ قَالُوا جَمِيعاً غَيْرَ أَبِي الْجَارُودِ وَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ كَانَتِ الْفَرِيضَةُ تَنْزِلُ بَعْدَ الْفَرِيضَةِ الْأُخْرَى وَ كَانَتِ الْوَلَايَةُ آخِرَ الْفَرَائِضِ فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَ أَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَقُولُ اللَّهُ عَزَّ وَ جَلَّ لَا أُنْزِلُ عَلَيْكُمْ بَعْدَ هَذِهِ فَرِيضَةً قَدْ أَكْمَلْتُ لَكُمُ الْفَرَائِضَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara and Al Fuzayl Bin Yasar and Bukeyr Bin Ayn and Muhammad Bin Muslim and Bureyd Bin Muawiya and Abu Al Jaroud, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Commanded His<sup>azwj</sup> Rasool<sup>saww</sup> with the Wilayah of Ali<sup>asws</sup> and Revealed unto him<sup>saww</sup> <span class=\"ibTxt\">[5:55] But rather, only Allah is your Guardian and His Rasool and those who believe, those who are establishing the Prayers and are paying the Zakāt</span>, and He<sup>azwj</sup> Necessitated the Wilayah of the Master<sup>asws</sup> of the Command (<span class=\"iTxt\">Ul Al-Amr</span>).",
            "But they (people) did not know what it was, so Allah<sup>azwj</sup> Commanded Muhammad<sup>saww</sup> that he<sup>saww</sup> should interpret the Wilayah for them just as he<sup>saww</sup> had interpreted for them the <span class=\"iTxt\">Salāt</span>, and the <span class=\"iTxt\">Zakāt</span>, and the Fasts, and the Hajj. So when he<sup>saww</sup> gave them that, the chest of Rasool-Allah<sup>saww</sup> was constricted by that and he<sup>saww</sup> was fearing that they would be reneging from their Religion, and that they would be belying him<sup>asws</sup>. ",
            "So his<sup>saww</sup> chest was constricted and he<sup>asws</sup> referred to his<sup>saww</sup> Lord<sup>azwj</sup> Mighty and Majestic, so Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup> <span class=\"ibTxt\">[5:67] O Rasool! Deliver what has been Revealed unto you from your Lord; and if you do it not, then you have not delivered His Message, and Allah will Protect you from the people</span>. ",
            "So he<sup>saww</sup> implemented the Command of Allah<sup>azwj</sup>, Exalted is His<sup>azwj</sup> Mention, so he<sup>asws</sup> established the Wilayah of Ali<sup>asws</sup> on the Day of Ghadeer Khumm, so he<sup>saww</sup> called for the congregational <span class=\"iTxt\">Salāt</span> and ordered the people that the ones present should deliver it to the absentees’. ",
            "Umar Bin Azina (a narrator) said, ‘All (the above mentioned reporters) said altogether, apart from Abu Al-Jaroud, ‘And Abu Ja’far<sup>asws</sup> said: ‘And it was so that the Obligatory act was Revealed after the other Obligatory act, and it was so that the Wilayah was the last of the Obligations. So Allah<sup>azwj</sup> Mighty and Majestic Revealed <span class=\"ibTxt\">[5:3] This day have I Perfected for you your Religion and Completed My Favour on you</span>’. Abu Ja’far<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic is Saying: “I<sup>asws</sup> will not be Revealing upon you, after this Obligation, and I<sup>asws</sup> have already Completed the Obligations for you all”’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Ibrahim from his father from Ibn Abu ’Umayr from ’Umar ibn Udhaynah from Zurarah and Fudayl ibn Yasar and Bukayr ibn A’yan and Muhammad ibn Muslim and Burayd ibn Muiawiyah and Abu ’1- Jarud, together, that Abu Ja’far (p.b.u.h.) said: “Allah, to Whom belong Might and Majesty, charged His Messenger with the Mastership of Ali, and sent down to him: Your Master is only Alldh, and His Messenger and those who believe who perform the prayer and pay zakat. He decreed the Mastership of those in authority, although they (the people) did not understand what it was. Allah command Muhammad (p.b.u.h.a.h.p.) to interpret (and explain) Mastership for them as he had interpreted (and explained) prayer, zakat, fasting and hajj. When this came to him from Allah, the mind of the Messenger of Allah (p.b.u.h.ah.p.) became straitened by it and he became afraid lest they (the people) abandon their religion and come to deny it. So his mind was staitened and he consulted with his Lord, to Whom belong Might and Majesty; and Allah to Whom belong Might and Majesty revealed to him: O Messenger, deliver that which has been sent down to thee from thy Lord; for if thou cost not, thou wig not have delivered His Message. Allah will protect thee from men (al-Ma’idah, 5:67). He complied with the command of Allah, may remembrance of Him be exlated, and endorsed the Mastership of Ali on the day of Ghadir Khumm. He convened the communal prayer, and he commanded the people that those who were witnesses should inform those who were absent.”—’Umar ibn Udhaynah said: `Ali but Abu’l-Jarudsaid: ’Abu Ja’far (p.b.uh.) said: “One divine precept came down after another, and the Mastership was the last divine ordinance. And Allah, to Whom belong Might and Majesty, sent down: Today I have completed your religion for you, and I have perfected My blessing upon you ( al-Matidah, 5 :3 ).” Abu Ja’ far (p.b.uh. ) said: “Allah, to Whom belong Might and Majesty, said: ’I shall not send down (any ordinance) to you after this ordinance: I have completed the divine ordinances for you.’ “ ’ “"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (259/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 758,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:64:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كُنْتُ عِنْدَهُ جَالِساً فَقَالَ لَهُ رَجُلٌ حَدِّثْنِي عَنْ وَلَايَةِ عَلِيٍّ أَ مِنَ اللَّهِ أَوْ مِنْ رَسُولِهِ فَغَضِبَ ثُمَّ قَالَ وَيْحَكَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَخْوَفَ لِلَّهِ مِنْ أَنْ يَقُولَ مَا لَمْ يَأْمُرْهُ بِهِ اللَّهُ بَلِ افْتَرَضَهُ كَمَا افْتَرَضَ اللَّهُ الصَّلَاةَ وَ الزَّكَاةَ وَ الصَّوْمَ وَ الْحَجَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sindy, from Ja’far Bin Bashir, from Haroun Bin Kharjat, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I was seated in his<sup>asws</sup> presence, so a man said to him<sup>asws</sup>, ‘Narrate to me about the Wilayah of Ali<sup>asws</sup>, is it from Allah<sup>azwj</sup> from His<sup>azwj</sup> Rasool<sup>saww</sup>?’ So he<sup>asws</sup> got angry then said: ‘Woe be unto you! Rasool-Allah<sup>saww</sup> was the most fearing of Allah<sup>azwj</sup> than for him<sup>saww</sup> to be saying what Allah<sup>azwj</sup> had not Commanded him<sup>saww</sup> with. But, it is a necessity just as Allah<sup>azwj</sup> Necessitated the <span class=\"iTxt\">Salāt</span>, and the <span class=\"iTxt\">Zakāt</span>, and the Fasts, and the Hajj’."
          ],
          "en.sarwar": [
            " 5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي بَصِيرٍ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ كُنْتُ عِنْدَهُ جَالِساً فَقَالَ لَهُ رَجُلٌ حَدِّثْنِي عَنْ وَلايَةِ عَلِيٍّ أَ مِنَ الله أَوْ مِنْ رَسُولِهِ فَغَضِبَ ثُمَّ قَالَ وَيْحَكَ كَانَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) أَخْوَفَ لله مِنْ أَنْ يَقُولَ مَا لَمْ يَأْمُرْهُ بِهِ الله بَلِ افْتَرَضَهُ كَمَا افْتَرَضَ الله الصَّلاةَ وَالزَّكَاةَ وَالصَّوْمَ وَالْحَجَّ 5. Ali ibn Ibrahim from ibn as-Sinai from Ja’ far ibn Bashir from Harun ibn Kharijah that Abu Basir said: “I was with Abu Ja’far (p.b.uh.) at a session, when a man said to him: ’Tell me about the Mastership (wilaych) of Ali, whether it is from Allah or from His Messenger?’ He became angry, and said: ’Woe betide you! The Messenger of Allah (p.b.uh.a.h.p.) was too fearing of Allah that he should say what he was not commanded by Allah. Indeed, He decreed it (the M.u,,’’rship of Ali—p.b.u.h.)- just as Allah decreed prayer, zakat, fasting and hap. ’ “"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف بسنديه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (259/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 759,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:64:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ مُحَمَّدِ بْنِ الْحُسَيْنِ جَمِيعاً عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ فَرَضَ اللَّهُ عَزَّ وَ جَلَّ عَلَى الْعِبَادِ خَمْساً أَخَذُوا أَرْبَعاً وَ تَرَكُوا وَاحِداً قُلْتُ أَ تُسَمِّيهِنَّ لِي جُعِلْتُ فِدَاكَ",
          "فَقَالَ الصَّلَاةُ وَ كَانَ النَّاسُ لَا يَدْرُونَ كَيْفَ يُصَلُّونَ فَنَزَلَ جَبْرَئِيلُ ( عليه السلام ) فَقَالَ يَا مُحَمَّدُ أَخْبِرْهُمْ بِمَوَاقِيتِ صَلَاتِهِمْ ثُمَّ نَزَلَتِ الزَّكَاةُ فَقَالَ يَا مُحَمَّدُ أَخْبِرْهُمْ مِنْ زَكَاتِهِمْ مَا أَخْبَرْتَهُمْ مِنْ صَلَاتِهِمْ ثُمَّ نَزَلَ الصَّوْمُ فَكَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا كَانَ يَوْمُ عَاشُورَاءَ بَعَثَ إِلَى مَا حَوْلَهُ مِنَ الْقُرَى فَصَامُوا ذَلِكَ الْيَوْمَ فَنَزَلَ شَهْرُ رَمَضَانَ بَيْنَ شَعْبَانَ وَ شَوَّالٍ ثُمَّ نَزَلَ الْحَجُّ فَنَزَلَ جَبْرَئِيلُ ( عليه السلام ) فَقَالَ أَخْبِرْهُمْ مِنْ حَجِّهِمْ مَا أَخْبَرْتَهُمْ مِنْ صَلَاتِهِمْ وَ زَكَاتِهِمْ وَ صَوْمِهِمْ ",
          "ثُمَّ نَزَلَتِ الْوَلَايَةُ وَ إِنَّمَا أَتَاهُ ذَلِكَ فِي يَوْمِ الْجُمُعَةِ بِعَرَفَةَ أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَ أَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَ كَانَ كَمَالُ الدِّينِ بِوَلَايَةِ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) فَقَالَ عِنْدَ ذَلِكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أُمَّتِي حَدِيثُو عَهْدٍ بِالْجَاهِلِيَّةِ وَ مَتَى أَخْبَرْتُهُمْ بِهَذَا فِي ابْنِ عَمِّي يَقُولُ قَائِلٌ وَ يَقُولُ قَائِلٌ فَقُلْتُ فِي نَفْسِي مِنْ غَيْرِ أَنْ يَنْطِقَ بِهِ لِسَانِي",
          "فَأَتَتْنِي عَزِيمَةٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ بَتْلَةً أَوْعَدَنِي إِنْ لَمْ أُبَلِّغْ أَنْ يُعَذِّبَنِي فَنَزَلَتْ يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ وَ إِنْ لَمْ تَفْعَلْ فَما بَلَّغْتَ رِسالَتَهُ وَ اللَّهُ يَعْصِمُكَ مِنَ النَّاسِ إِنَّ اللَّهَ لا يَهْدِي الْقَوْمَ الْكافِرِينَ ",
          "فَأَخَذَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِيَدِ عَلِيٍّ ( عليه السلام ) فَقَالَ أَيُّهَا النَّاسُ إِنَّهُ لَمْ يَكُنْ نَبِيٌّ مِنَ الْأَنْبِيَاءِ مِمَّنْ كَانَ قَبْلِي إِلَّا وَ قَدْ عَمَّرَهُ اللَّهُ ثُمَّ دَعَاهُ فَأَجَابَهُ فَأَوْشَكَ أَنْ أُدْعَى فَأُجِيبَ وَ أَنَا مَسْئُولٌ وَ أَنْتُمْ مَسْئُولُونَ فَمَا ذَا أَنْتُمْ قَائِلُونَ فَقَالُوا نَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ وَ نَصَحْتَ وَ أَدَّيْتَ مَا عَلَيْكَ فَجَزَاكَ اللَّهُ أَفْضَلَ جَزَاءِ الْمُرْسَلِينَ",
          "فَقَالَ اللَّهُمَّ اشْهَدْ ثَلَاثَ مَرَّاتٍ ثُمَّ قَالَ يَا مَعْشَرَ الْمُسْلِمِينَ هَذَا وَلِيُّكُمْ مِنْ بَعْدِي فَلْيُبَلِّغِ الشَّاهِدُ مِنْكُمُ الْغَائِبَ ",
          "قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) كَانَ وَ اللَّهِ عَلِيٌّ ( عليه السلام ) أَمِينَ اللَّهِ عَلَى خَلْقِهِ وَ غَيْبِهِ وَ دِينِهِ الَّذِي ارْتَضَاهُ لِنَفْسِهِ ثُمَّ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حَضَرَهُ الَّذِي حَضَرَ فَدَعَا عَلِيّاً فَقَالَ يَا عَلِيُّ إِنِّي أُرِيدُ أَنْ أَئْتَمِنَكَ عَلَى مَا ائْتَمَنَنِيَ اللَّهُ عَلَيْهِ مِنْ غَيْبِهِ وَ عِلْمِهِ وَ مِنْ خَلْقِهِ وَ مِنْ دِينِهِ الَّذِي ارْتَضَاهُ لِنَفْسِهِ ",
          "فَلَمْ يُشْرِكْ وَ اللَّهِ فِيهَا يَا زِيَادُ أَحَداً مِنَ الْخَلْقِ ثُمَّ إِنَّ عَلِيّاً ( عليه السلام ) حَضَرَهُ الَّذِي حَضَرَهُ فَدَعَا وُلْدَهُ وَ كَانُوا اثْنَيْ عَشَرَ ذَكَراً فَقَالَ لَهُمْ يَا بَنِيَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ أَبَى إِلَّا أَنْ يَجْعَلَ فِيَّ سُنَّةً مِنْ يَعْقُوبَ وَ إِنَّ يَعْقُوبَ دَعَا وُلْدَهُ وَ كَانُوا اثْنَيْ عَشَرَ ذَكَراً فَأَخْبَرَهُمْ بِصَاحِبِهِمْ أَلَا وَ إِنِّي أُخْبِرُكُمْ بِصَاحِبِكُمْ",
          "أَلَا إِنَّ هَذَيْنِ ابْنَا رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الْحَسَنَ وَ الْحُسَيْنَ ( عليه السلام ) فَاسْمَعُوا لَهُمَا وَ أَطِيعُوا وَ وَازِرُوهُمَا فَإِنِّي قَدِ ائْتَمَنْتُهُمَا عَلَى مَا ائْتَمَنَنِي عَلَيْهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِمَّا ائْتَمَنَهُ اللَّهُ عَلَيْهِ مِنْ خَلْقِهِ وَ مِنْ غَيْبِهِ وَ مِنْ دِينِهِ الَّذِي ارْتَضَاهُ لِنَفْسِهِ ",
          "فَأَوْجَبَ اللَّهُ لَهُمَا مِنْ عَلِيٍّ ( عليه السلام ) مَا أَوْجَبَ لِعَلِيٍّ ( عليه السلام ) مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَلَمْ يَكُنْ لِأَحَدٍ مِنْهُمَا فَضْلٌ عَلَى صَاحِبِهِ إِلَّا بِكِبَرِهِ وَ إِنَّ الْحُسَيْنَ كَانَ إِذَا حَضَرَ الْحَسَنُ لَمْ يَنْطِقْ فِي ذَلِكَ الْمَجْلِسِ حَتَّى يَقُومَ ",
          "ثُمَّ إِنَّ الْحَسَنَ ( عليه السلام ) حَضَرَهُ الَّذِي حَضَرَهُ فَسَلَّمَ ذَلِكَ إِلَى الْحُسَيْنِ ( عليه السلام ) ثُمَّ إِنَّ حُسَيْناً حَضَرَهُ الَّذِي حَضَرَهُ فَدَعَا ابْنَتَهُ الْكُبْرَى فَاطِمَةَ بِنْتَ الْحُسَيْنِ ( عليه السلام ) فَدَفَعَ إِلَيْهَا كِتَاباً مَلْفُوفاً وَ وَصِيَّةً ظَاهِرَةً وَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) مَبْطُوناً لَا يَرَوْنَ إِلَّا أَنَّهُ لِمَا بِهِ فَدَفَعَتْ فَاطِمَةُ الْكِتَابَ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ثُمَّ صَارَ وَ اللَّهِ ذَلِكَ الْكِتَابُ إِلَيْنَا .",
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad and Muhammad Bin Al Husayn, altogether from Muhammad Bin Ismail Bin Bazie, from Mansour Bin Yunus, from Abu Al Jaroud, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic Necessitated five things upon the servants. They took four and neglected one’. I said, ‘Can you name these for me, may I be sacrificed for you<sup>asws</sup>?’ ",
            "So he<sup>asws</sup> said: ‘The <span class=\"iTxt\">Salāt</span>, and it was so that the people were not knowing how they should be praying. So Jibraeel<sup>as</sup> descended and he<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! Inform them with the timing of their <span class=\"iTxt\">Salāts</span>’. Then <span class=\"iTxt\">Zakāt</span> was Revealed, so he<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! Inform them of their <span class=\"iTxt\">Zakāt</span>, what you<sup>saww</sup> informed them of their <span class=\"iTxt\">Salāt</span>s’. Then the Fasts were Revealed, and it was so that whenever it was the day of Ashoura, he<sup>saww</sup> used to send a message to the ones in town, so they would Fast that day. So the Month of Ramazan was Revealed between Shaban and Shawwal. Then the Hajj was Revealed. So Jibraeel<sup>as</sup> descended and he<sup>as</sup> said: ‘Inform them of their Hajj what you<sup>saww</sup> informed them of their <span class=\"iTxt\">Salāt</span>, and their <span class=\"iTxt\">Zakāt</span>, and their Fasts’. ",
            "The Wilayah was Revealed, and rather that was Given during the day of Friday at Arafat. Allah<sup>azwj</sup> Mighty and Majestic Revealed <span class=\"ibTxt\">5:3] This day have I Perfected for you your Religion and Completed My Favour on you</span> by the Wilayah of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>. So Rasool-Allah<sup>saww</sup> said during that, ‘My<sup>saww</sup> community have just recently come out from the era of the ignorance, and when I<sup>saww</sup> inform them with this regarding my<sup>asws</sup> cousin, a sayer would be saying this, and a sayer would be saying this. So I<sup>saww</sup> shall say it within myself<sup>saww</sup> from without speaking with it by my<sup>saww</sup> tongue. ",
            "Then came to me<sup>saww</sup> the Determination of Allah<sup>azwj</sup> Mighty and Majestic with the Notification threatening me<sup>saww</sup> that He<sup>azwj</sup> would Punish me<sup>saww</sup> if I<sup>saww</sup> did not deliver (the Message), <span class=\"ibTxt\">[5:67] O Rasool! Deliver what has been Revealed unto you from your Lord; and if you do it not, then you have not delivered His Message, and Allah will Protect you from the people; surely Allah will not Guide the unbelieving people</span>.",
            "So Rasool-Allah<sup>saww</sup> grabbed the hand of Ali<sup>asws</sup> and he<sup>saww</sup> said: ‘O you people! There has not been a Prophet<sup>as</sup> from the Prophets<sup>as</sup>, from the one who were before me<sup>saww</sup> except that Allah<sup>azwj</sup> had Commanded him<sup>as</sup>, then Called him<sup>as</sup>, so he<sup>as</sup> answered Him<sup>azwj</sup>. So there is no doubt that I<sup>saww</sup> would be Called so I<sup>saww</sup> would answer, and I<sup>asws</sup> would be questioned and you would be questioned. So what is that which you are saying?’ So they said, ‘We testify that you<sup>asws</sup> have delivered, and advised, and fulfilled whatever was upon you<sup>saww</sup>. So, may Allah<sup>azwj</sup> Recompense you<sup>asws</sup> with the most superior of the Recompenses of the Mursil Prophets<sup>as</sup>’. ",
            "So he<sup>saww</sup> said: ‘O Allah<sup>azwj</sup>! Bear Witness!’ – three times. Then he<sup>saww</sup> said: ‘O group of Muslims! This is your Guardian after me<sup>saww</sup>, so let those present from you deliver it to the absentees’. ",
            "Abu Ja’far<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! It was so that Ali<sup>asws</sup> was a trustee of Allah<sup>azwj</sup> upon His<sup>azwj</sup> creatures, and His<sup>azwj</sup> Unseen (Authority), and His<sup>azwj</sup> Religion which He<sup>azwj</sup> was Pleased with for Himself<sup>azwj</sup>. Then Rasool-Allah<sup>saww</sup>, it presented to him<sup>asws</sup> that which presented (death), so he<sup>saww</sup> called Ali<sup>asws</sup> over and he<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! I want to entrust you<sup>asws</sup> upon what Allah<sup>azwj</sup> Entrusted me<sup>saww</sup> upon, from His<sup>azwj</sup> unseen, and His<sup>azwj</sup> Knowledge, and from His<sup>azwj</sup> creatures, and from His<sup>azwj</sup> Religion which He<sup>azwj</sup> was Pleased with for Himself<sup>azwj</sup>. ",
            "So he<sup>saww</sup> did not participate anyone from His<sup>azwj</sup> creatures, O Ziyad! Then Ali<sup>asws</sup>, it presented to him<sup>asws</sup> that which presented (death), so he<sup>asws</sup> called his<sup>asws</sup> children, and they were twelve males, so he<sup>asws</sup> said to them: ‘O my<sup>asws</sup> sons! Allah<sup>azwj</sup> Mighty and Majestic has Refused except that He<sup>azwj</sup> Makes to be within me<sup>asws</sup> Sunnah from Yaqoub<sup>as</sup>, and that Yaqoub<sup>as</sup> had called his<sup>as</sup> children, and they were twelve males, so he<sup>as</sup> informed them with their master. ",
            "Indeed! And I<sup>asws</sup> am informing you all with your master. These here are two sons<sup>asws</sup> of Rasool-Allah<sup>saww</sup>, Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>. Therefore, listen to both of them<sup>asws</sup>, and obey them<sup>asws</sup>, and make them<sup>asws</sup> as Viziers, for I<sup>asws</sup> have entrusted them<sup>asws</sup> both upon whatever Rasool-Allah<sup>saww</sup> had entrusted me<sup>asws</sup> upon it - from whatever Allah<sup>azwj</sup> had Entrusted him<sup>saww</sup> upon from His<sup>azwj</sup> creatures, and from His<sup>azwj</sup> unseen, and from His<sup>azwj</sup> Religion which He<sup>azwj</sup> is Pleased with Himself<sup>azwj</sup>. ",
            "Thus, Allah<sup>azwj</sup> Obligated for both of them<sup>asws</sup> from Ali<sup>asws</sup>, whatever was Obligated for Ali<sup>asws</sup> from Rasool-Allah<sup>saww</sup>. So there does not happen to be for any one of the two a merit upon his<sup>asws</sup> companion except by his<sup>asws</sup> age, and Al-Husayn<sup>asws</sup> was such that whenever Al-Hassan<sup>asws</sup> was present, would not speak in that gathering until he (Al-Hassan<sup>asws</sup>) arose. ",
            "Then Al-Hassan<sup style=\"font-weight: normal\">asws</sup>, it presented to him<sup style=\"font-weight: normal\">asws</sup> which presented (death). So he<sup style=\"font-weight: normal\">asws</sup> submitted that to Al-Husayn<sup style=\"font-weight: normal\">asws</sup>. Then Husayn<sup style=\"font-weight: normal\">asws</sup> was such that when it presented to him<sup style=\"font-weight: normal\">asws</sup> which presented (death), so he<sup style=\"font-weight: normal\">asws</sup> called over his<sup style=\"font-weight: normal\">asws</sup> eldest daughter Syeda Fatima Bint Al-Husayn<sup style=\"font-weight: normal\">asws</sup>, so he<sup style=\"font-weight: normal\">asws</sup> handed over to her a wrapped Book and an apparent bequest, and it was so that Ali<sup style=\"font-weight: normal\">asws</sup> Bin Al-Husayn<sup style=\"font-weight: normal\">asws</sup> was experiencing stomach problems, not seeing except it was due to what he<sup style=\"font-weight: normal\">asws</sup> was with. So Syeda Fatima<sup style=\"font-weight: normal\">as</sup> handed over the Book to Ali<sup style=\"font-weight: normal\">asws</sup> Bin Al-Husayn<sup style=\"font-weight: normal\">asws</sup>. Then that came to be, by Allah<sup style=\"font-weight: normal\">azwj</sup>, to us<sup style=\"font-weight: normal\">asws</sup>’. ",
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Muhammad Bin Ismail Bin Bazie, from Mansour Bin Yunus, from Abu Al Jaroud, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, similar to it."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Yahya from Ahmad ibn Muhammad and Muh. ammad ibn al-Husayn, the two together from Muhammad ibn Isma’il ibn Bazi’ from Mansur ibn Yunus that Abu ’I-Jarud said: “I heard Abu Ja’far (p.b.u.h.) say: Aliah, to Whom belong Might and Majesty, made five things incumbent on (his) servants: they accepted four and rejected one.’ I said: ’May I be made your ransom, name them for me.’ He said: ’Prayer; but the people did not understand how to pray, then Jibril (pb.uh.) came down and said: “O Muhammad, inform them of the timings of their prayers.” Then zakat was sent down, and He said: “O Muhammad, inform them of their zakit as you have informed them of their prayer.” Then fasting was sent down, and, when the day of ’Ashura came, the Messenger of Allah (pb.uh.ah.p.) sent a message to the villages around it (Medina), and they fasted on that day. Then (the fasting) of the month of Ramadan, between (the months of ) Sha’ban and Shawwal, was sent down. Then hajj was sent down, and Jibril (p.b.uh.) came down and said:”Inform them of their hajj as you informed them of their prayer, their Rabat and their fasting.” Then the Mastership was sent down, and when this came to him on Friday at ’Arafah (or ’Arafat, the gathering place for the pilgrims on the 9th of Dhu ’l-Hijjah, near Mecca), Allah, to Whom belong Might and Majesty, sent down: Today I have completed your religion for you, and I have perfected My blessing upon you (al-Ma’idah,5:3). The completion of the religion was through the Mastership of Ali ibn Abu Talib (p.b.uh.). Then the Messenger of Allah (pb.uh.ah.p.) said together with this (verse): “My community has recently experienced the jahiliyyah (the period of ignorance before Islam), and whenever I inform them of this concerning my cousin, one speaker will say this and another will say that. I say (this) to myself without my tongue speaking out: a decisive obligation came to me from Allah, to Whom belong Might and Majesty, with finality; He threatened me that if I did not make (this) reach (the people), He would punish me.” Then was sent down: O Messenger, deliver that which has been sent down to thee from thy Lord; for if thou cost not, thou wilt not have delivered His Message. Allah will protect thee from men. Allah guides not the people of the unbelievers (al-Matidah, S :67). Then the Messenger of Allah (p.b.uh.a.h.p.) took the hand of Ali (pb.uh.) and said: “O people, there was no prophet among the prophets who were before me to whom Allah did not grant a span of life, then tie called him and he answered Him. The time is now near when I shall be called and I will answer. I shall be questioned and you will be questioned, and what will you say?” They said: “We bear witness that you have delivered (what you had to deliver) and advised sincerely, and conveyed what you had. May Allah reward you with the best of the rewards of those who were messengers.” He said: “O Allah, I call you to witness”—three times —then he said: “O assembly of believers, that this man is your Master (wall) after me. Let the one among you who witnesses this convey (what he has seen) to the one who is absent.” ’ Abu Ja’far (p.b.u.h.) said: ’By Allah, (Ali—p.b.u.h.) was the one trusted by Allah over His creation, His unseen (commands), and His religion which He Himself accepted (for His creatures). Then came to the Messenger of Allah (p.b.uh.ah.p.) that which came (his death), and he called Ali and said: “O Ali, I wish to entrust you with what Allah has entrusted me both of His unseen (commands) and of knowledge of llim, and of His creation and His religion which He Himself accepted (for ITis creatures).”’ (Abu Ja’far—p.b.u.h.—said:) ’By Allah, O Ziyad, (ibn Mundhir Abu ’I-Jarud), he (the Prophet—p.b.u.h.a.h.p.) has not given any share in this to anyone. Then came to Ali (p.b.u.h.) that which came, and he called his sons, and they were twelve males. lie said to them: “O my sons,Allah, to whom belong Might and Majesty, willed that He bring about in me one of the particularities (He established) with Ya’qub (see al-Baqarah, 2:132 - 133): and Ya’qub called his sons, and they were twelve males. He informed them of the one in authority among them. Indeed, I shall inform you of the one in authority among you. They are these two sons of the Messenger of Allah ( p.b.u.h.a.h.p. ), al-Hassan and al-Husayn (pb.u.t.). Listen to them, and obey and support them. I entrust them with what the Messenger of Allah (p.b.u.h. a.h.p.) entrusted me of what Allah entrusted him of His creation and His unseen (commands) and His religion, which He Himself accepted (for Ills creatures).” Allah made obligatory for them through Ali (p.b. u h.) what he made obligatory for Ali through the Messenger of Allah (pb.uh.ah.p.). Neither of them had any excellence over the one in authority over him except on account of his age. When al-Hassan (p.b. u.h.) was present, al-Husayn (pb.u.h.) said nothing in a session, until (al-Hassan—pb.uh.) rose (to leave).Then came to al-Hassan (p.b.u.h.) what came to him, and he handed it (the Imamite) to al-Husayn. Then came to al-I.lusayn (pb.uh.) what came to him, and he called his eldest daughter, Fatimah hint al-Husayn (pb.uh.) and handed over to her a rolled up writing and an open testament (for Ali ibn al-Husayn—p.b.u.h.). Ali ibn al-Husayn (pb.uh.) was ill with a gastric complaint which (everyone) thought he would die of, so Fatimah handed the writing to Ali ibn al-Husayn (p.b.uh.). Thereafter, by Allah, this writing has come down to us.’ “ *al-Husayn ibn Muhammad from MuAliah ibn Muhammad from Muhammad ibn Jumhur from Muhammad ibn Isma’il ibn Bazi’ from Mansur ibn Yunus from Abu ’I-Jarud from Abu Ja’far (pb.u.h.), the same tradition."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح بسنديه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (213/ 3)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/33)"
        ],
        "index": 760,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:64:7",
        "text": [
          "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ صَبَّاحٍ الْأَزْرَقِ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) إِنَّ رَجُلًا مِنَ الْمُخْتَارِيَّةِ لَقِيَنِي فَزَعَمَ أَنَّ مُحَمَّدَ بْنَ الْحَنَفِيَّةِ إِمَامٌ فَغَضِبَ أَبُو جَعْفَرٍ ( عليه السلام ) ثُمَّ قَالَ أَ فَلَا قُلْتَ لَهُ قَالَ قُلْتُ لَا وَ اللَّهِ مَا دَرَيْتُ مَا أَقُولُ ",
          "قَالَ أَ فَلَا قُلْتَ لَهُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَوْصَى إِلَى عَلِيٍّ وَ الْحَسَنِ وَ الْحُسَيْنِ فَلَمَّا مَضَى عَلِيٌّ ( عليه السلام ) أَوْصَى إِلَى الْحَسَنِ وَ الْحُسَيْنِ وَ لَوْ ذَهَبَ يَزْوِيهَا عَنْهُمَا لَقَالَا لَهُ نَحْنُ وَصِيَّانِ مِثْلُكَ وَ لَمْ يَكُنْ لِيَفْعَلَ ذَلِكَ ",
          "وَ أَوْصَى الْحَسَنُ إِلَى الْحُسَيْنِ وَ لَوْ ذَهَبَ يَزْوِيهَا عَنْهُ لَقَالَ أَنَا وَصِيٌّ مِثْلُكَ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مِنْ أَبِي وَ لَمْ يَكُنْ لِيَفْعَلَ ذَلِكَ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ أُولُوا الْأَرْحامِ بَعْضُهُمْ أَوْلى بِبَعْضٍ هِيَ فِينَا وَ فِي أَبْنَائِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Muhammad Bin Isa, from Safwan Bin Yahya, from Sabbah Al Azraq, from Abu Baseer who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘A man from the followers of Al-Mukhtar met me, so he alleged that Muhammad Bin Al-Hanafiyya is an Imam’. So Abu Ja’far<sup>asws</sup> got angry, then said: ‘Did you not say (anything) to him?’ I said to him<sup>asws</sup>, ‘No, by Allah<sup>azwj</sup>! I did not know what I should be saying’. ",
            "He<sup>asws</sup> said: ‘So why did you not say to him that Rasool-Allah<sup>saww</sup> bequeathed to Ali<sup>asws</sup>, and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>. So when Ali<sup>asws</sup> passed away bequeathed to Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>, and had he<sup>asws</sup> gone to impede it from them<sup>asws</sup> both, they<sup>asws</sup> would have said to him<sup>asws</sup>: ‘We<sup>asws</sup> are both succesors<sup>asws</sup> like you<sup>asws</sup> were’, and he<sup>asws</sup> would not have done that. ",
            "And Al-Hassan<sup>asws</sup> bequeathed to Al-Husayn<sup>asws</sup>, and had he<sup>asws</sup> gone to impeded it from him<sup>asws</sup>, he<sup>asws</sup> would have said: ‘I<sup>asws</sup> am a successor<sup>asws</sup> like you<sup>asws</sup> from Rasool-Allah<sup>saww</sup> and from my<sup>asws</sup> father<sup>asws</sup>, and he<sup>asws</sup> would not have done that. Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[33:6] and the possessors of relationships are nearer to each other in the Ordinance of Allah</span> – it is regarding us<sup>asws</sup> and regarding our<sup>asws</sup> sons<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 7. Muhammad ibn al-Hassan from Sahl ibn Ziyad from Muhammad ibn ’Isa from Safwan ibn Yahya from Sabbah al-Azraq that Abu Basir said: “I said to Abu Ja’far (p.b.uh.): ’A man from the Mukhtariyyah1 met me and claimed that Muhammad ibn al-Hanafiyyah (one of the sons of Ali ibn Abu Talib—p.b.u.h.) was an Imam.’ Abu Ja’far (pb.uh.) became angry, then he said: ’Did you not say any 1. i.e. the Kaysaniyyah —Nlukhtar ibn Abu ’Ubayd ath-Thaqafi (1/622 — 67/687) was the leader of the uprising to avenge the slaying of al-Husayn (p.b.u.h.) at Karbala’ and Kaysan Abu ’Amra was then his leading supporter among the rnaw~li thing to him?’ “ He said: “I said: ’No, by Allah! I did not know what to say.’ He said: ’Did you not say to him: “The Messenger of Allah (p.b.uh.ah.p.) appointed Ali, al-Hassan and al-Husayn as his successors. When Ali (p.b.uh.) passed away, he appointed al-Hassan and al-Husayn as his successors, and if he (Ali) had tried to withhold it from them, they would have said to him: ’We are successors like you.’ But he would never have done this. al-I.lasan appointed al-l.lusayn as his successor, and if he had tried to withhold it from him, he would have said: ’I am a successor like you of the Messenger of Allah (p.b.u.h. ah.p.) and of my father.’ But he would not have done this. Allah, to Whom belong Might and Majesty, said: Some of those bound by blood are nearer (to each other) than others (al-Anfal,8:75; al-Ahzab, 33 :6).” This is about us and about our sons.’ “"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:64",
  "kind": "verse_list"
}