{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 65"
        },
        "path": "/books/al-kafi:1:4:65",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "Chapter 65 – The Indication and the wordings upon Amir Al Momineen<sup>asws</sup>"
        }
      }
    ],
    "index": 123,
    "local_index": 65,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 66"
        },
        "path": "/books/al-kafi:1:4:66",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى الْحَسَنِ بْنِ عَلِيٍّ ( عليه السلام )",
          "en": "Chapter 66 – The Indication and the wordings upon Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 64"
        },
        "path": "/books/al-kafi:1:4:64",
        "titles": {
          "ar": "بَابُ مَا نَصَّ اللَّهُ عَزَّ وَ جَلَّ وَ رَسُولُهُ عَلَى الْأَئِمَّةِ ( عليهم السلام ) وَاحِداً فَوَاحِداً",
          "en": "Chapter 64 – What was Stipulated by Allah<sup>azwj</sup> Mighty and Majestic and His<sup>azwj</sup> Rasool<sup>saww</sup> upon the Imams<sup>asws</sup>, one then one"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:65",
    "titles": {
      "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
      "en": "Chapter 65 – The Indication and the wordings upon Amir Al Momineen<sup>asws</sup>"
    },
    "verse_count": 9,
    "verse_start_index": 760,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (265/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 761,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:65:1",
        "refs": {
          "Quran": [
            "/books/quran:16:94",
            "/books/quran:16:93",
            "/books/quran:16:92",
            "/books/quran:16:91"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ زَيْدِ بْنِ الْجَهْمِ الْهِلَالِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ لَمَّا نَزَلَتْ وَلَايَةُ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) وَ كَانَ مِنْ قَوْلِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) سَلِّمُوا عَلَى عَلِيٍّ بِإِمْرَةِ الْمُؤْمِنِينَ فَكَانَ مِمَّا أَكَّدَ اللَّهُ عَلَيْهِمَا فِي ذَلِكَ الْيَوْمِ يَا زَيْدُ قَوْلُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَهُمَا قُومَا فَسَلِّمَا عَلَيْهِ بِإِمْرَةِ الْمُؤْمِنِينَ فَقَالَا أَ مِنَ اللَّهِ أَوْ مِنْ رَسُولِهِ يَا رَسُولَ اللَّهِ فَقَالَ لَهُمَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنَ اللَّهِ وَ مِنْ رَسُولِهِ ",
          "فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ وَ لا تَنْقُضُوا الْأَيْمانَ بَعْدَ تَوْكِيدِها وَ قَدْ جَعَلْتُمُ اللَّهَ عَلَيْكُمْ كَفِيلًا إِنَّ اللَّهَ يَعْلَمُ ما تَفْعَلُونَ يَعْنِي بِهِ قَوْلَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَهُمَا وَ قَوْلَهُمَا أَ مِنَ اللَّهِ أَوْ مِنْ رَسُولِهِ وَ لا تَكُونُوا كَالَّتِي نَقَضَتْ غَزْلَها مِنْ بَعْدِ قُوَّةٍ أَنْكاثاً تَتَّخِذُونَ أَيْمانَكُمْ دَخَلًا بَيْنَكُمْ أَنْ تَكُونَ أَئِمَّةٌ هِيَ أَزْكَى مِنْ أَئِمَّتِكُمْ ",
          "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ أَئِمَّةٌ قَالَ إِي وَ اللَّهِ أَئِمَّةٌ قُلْتُ فَإِنَّا نَقْرَأُ أَرْبى فَقَالَ مَا أَرْبَى وَ أَوْمَأَ بِيَدِهِ فَطَرَحَهَا إِنَّما يَبْلُوكُمُ اللَّهُ بِهِ يَعْنِي بِعَلِيٍّ ( عليه السلام ) وَ لَيُبَيِّنَنَّ لَكُمْ يَوْمَ الْقِيامَةِ ما كُنْتُمْ فِيهِ تَخْتَلِفُونَ. وَ لَوْ شاءَ اللَّهُ لَجَعَلَكُمْ أُمَّةً واحِدَةً وَ لكِنْ يُضِلُّ مَنْ يَشاءُ وَ يَهْدِي مَنْ يَشاءُ وَ لَتُسْئَلُنَّ يَوْمَ الْقِيَامَةِ عَمَّا كُنْتُمْ تَعْمَلُونَ. وَ لا تَتَّخِذُوا أَيْمانَكُمْ دَخَلًا بَيْنَكُمْ فَتَزِلَّ قَدَمٌ بَعْدَ ثُبُوتِها يَعْنِي بَعْدَ مَقَالَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي عَلِيٍّ ( عليه السلام ) وَ تَذُوقُوا السُّوءَ بِما صَدَدْتُمْ عَنْ سَبِيلِ اللَّهِ يَعْنِي بِهِ عَلِيّاً ( عليه السلام ) وَ لَكُمْ عَذابٌ عَظِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Mansour Bin Yunus, from Zayd Bin Al Jahm Al Hilaly, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘When the Wilayah of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> was Revealed, and it was from the words of Rasool-Allah<sup>saww</sup>: ‘Greet upon Ali<sup>asws</sup> as Amir Al-Momineen (The Commander of the Believers)’. So it was from what Allah<sup>azwj</sup> Allah<sup>azwj</sup> had Affirmed upon them both during that day, O Zayd, the words of Rasool-Allah<sup>saww</sup> to them both (Abu Bakr and Umar) were: ‘Arise you both and greet upon him<sup>asws</sup> as Amir Al-Momineen<sup>asws</sup>’. So they said, ‘Is it from Allah<sup>azwj</sup> or from His<sup>azwj</sup> Rasool<sup>saww</sup>, O Rasool-Allah<sup>saww</sup>?’ So Rasool-Allah<sup>saww</sup> said to them: ‘(It is) from Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>’. ",
            "So Allah<sup>azwj</sup> Mighty and Majestic Revealed <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h91\">[16:91]</a> and do not break the oaths after affirming them, and you have indeed made Allah a surety for you; surely Allah Knows what you are doing</span>, Meaning by it the words of Rasool-Allah<sup>saww</sup> to the two of them, and their words, ‘It is from Allah<sup>azwj</sup> or from His<sup>azwj</sup> Rasool<sup>saww</sup>?’ <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h92\">[16:92]</a> And be not like her who unravels her yarn, disintegrating it into pieces after having spun it strongly. You make your oaths to be means of deceit between you so that the Imams would happen to be more virtuous than your own leaders</span>’. (Note – The words in red are different in the current Version of the Holy Quran).",
            "He (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>! Imams<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Yes, by Allah<sup>azwj</sup>, Imams<sup>asws</sup>’. I said, ‘But we are reciting ‘More beneficial’ (أَرْبى)!’ So he<sup>asws</sup> said: ‘What is (this word) ‘أَرْبى’?’ And he<sup>asws</sup> gestured by his<sup>asws</sup> hand, so he<sup>asws</sup> discarded them (indicatively) <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h92\">[16:92]</a> But rather, Allah is Testing you by this</span>, Meaning by Ali<sup>asws</sup><span class=\"ibTxt\"> and He will Clarify to you on the Day of Judgement that which you were differing in <a href=\"/#/books/quran:16#h93\">[16:93]</a> And had Allah so Desired it He would Make you a single nation, but He Lets err whomsoever He Desires to and Guides whomsoever He Desires to; and you will be Questioned about what you had been doing <a href=\"/#/books/quran:16#h94\">[16:94]</a> And do not make your oaths a means of deceit between you, lest a foot should slip after its stability </span>Meaning after the words of Rasool-Allah<sup>saww</sup> regarding Ali<sup>asws</sup> <span class=\"ibTxt\">and you would taste evil because you turned away from Allah's Way </span>Meaning by it ‘Ali<sup>asws</sup>’, <span class=\"ibTxt\">and a grievous Punishment would be for you</span>’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya from Muhammad ibn al-Husayn from Muhammad ibn Isma’il from Mansur ibn Yunus from Zayd ibn al-Jahm al-Hilali who has said that heard abu ‘Abdallah (a.s.) say the following. “When Wilaya of (the declaration that ) Ali ibn abu Talib has (Divine Authority over the people) descended and it was in the words of the Messenger of Allah they all greeted and congratulated Ali (a.s.) as the commander of the believers. Of the matters that Allah had stressed up on the two of them on that day, O Zayd was what came through the words of the Messenger of Allah for the two of them. “The two of you stand up and congratulate him (Ali ) as the commander of the believers. The two of them asked, “Is it from Allah or from the Messenger of Allah, O the Messenger of Allah ?” The Messenger of Allah then said to the two of them, “It is from Allah and from His Messenger.” Allah, the Most Holy, the Most High, then sent the following. “. . (He commands people) to keep their established covenants with God not to disregard their firm oaths; they have already appointed God as their Guarantor. God certainly knows what you do.” <a href=\"/#/books/quran:16#h91\">[16:91]</a> The Imam (a.s.) said , “It refers to the words of the Messenger of Allah to the two of them and thier words to the the Messenger of Allah saying, “Is it from Allah or from the Messenger of Allah, O the Messenger of Allah ?” The point to note in this matter in the following words of Allah is Imams. “Do not be like the lady behind the spinning wheel who has broken the yarn by pulling it with unnecessary force. You must not consider your oaths as means of deceit to benefit one party and incur loss upon the other. . .” <a href=\"/#/books/quran:16#h92\">[16:92]</a>, just because they are the Imams who possess highier spiritual standard.” The narrator has said that he then asked the Imam (a.s.), ‘May Allah take my soul in service for your cause, is the word ’A’imma (Imams)? However, we read it Arba’? The Imam (a.s.) then said, “What Arba’ is it that you mention? He made a gesture with his hand as an indication of throwing away something and said, “Allah tests you through him (Ali (a.s.) “. . He will make clear to you who was right and who was wrong on the Day of Judgment. <a href=\"/#/books/quran:16#h92\">[16:92]</a> Had God wanted, He would have made you one single nation but He guides or causes to go astray whomever He wants. You will certainly be questioned about what you have done. <a href=\"/#/books/quran:16#h93\">[16:93]</a> Do not consider your oaths as a means of deceit lest you damage the firmness of your faith, (after what you have heard from the Messenger of Allah about Ali (a.s.) ) suffer from evil by creating obstacles in the way that leads to God, (a reference to Ali (a.s.) ) and incur a great torment upon yourselves <a href=\"/#/books/quran:16#h94\">[16:94]</a>.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (269/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 762,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:65:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ وَ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ لَمَّا أَنْ قَضَى مُحَمَّدٌ نُبُوَّتَهُ وَ اسْتَكْمَلَ أَيَّامَهُ أَوْحَى اللَّهُ تَعَالَى إِلَيْهِ أَنْ يَا مُحَمَّدُ قَدْ قَضَيْتَ نُبُوَّتَكَ وَ اسْتَكْمَلْتَ أَيَّامَكَ فَاجْعَلِ الْعِلْمَ الَّذِي عِنْدَكَ وَ الْإِيْمَانَ وَ الِاسْمَ الْأَكْبَرَ وَ مِيرَاثَ الْعِلْمِ وَ آثَارَ عِلْمِ النُّبُوَّةِ فِي أَهْلِ بَيْتِكَ عِنْدَ عَلِيِّ بْنِ أَبِي طَالِبٍ فَإِنِّي لَنْ أَقْطَعَ الْعِلْمَ وَ الْإِيمَانَ وَ الِاسْمَ الْأَكْبَرَ وَ مِيرَاثَ الْعِلْمِ وَ آثَارَ عِلْمِ النُّبُوَّةِ مِنَ الْعَقِبِ مِنْ ذُرِّيَّتِكَ كَمَا لَمْ أَقْطَعْهَا مِنْ ذُرِّيَّاتِ الْأَنْبِيَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn and Ahmad Bin Muhammad, from Ibn Mahboub, from Muhammad Bin Al Fuzayl, from Abu Hamza Al Sumaly, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘When the Prophet-hood of Muhammad<sup>saww</sup> expired and his<sup>saww</sup> days were completed, Allah<sup>azwj</sup> the Exalted Revealed unto him<sup>saww</sup>: “O Muhammad<sup>saww</sup>! Your<sup>saww</sup> Prophet-hood has expired and your<sup>saww</sup> days are completed, therefore make the Knowledge which is with you<sup>saww</sup>, and the <span class=\"iTxt\">Eman</span>, and the Great Name, and inheritance of the Knowledge, and the traces (Ahadeeth) of Knowledge of the Prophet-hood to be in the People<sup>asws</sup> of your<sup>saww</sup> Household with Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, for I<sup>azwj</sup> Never Cut-off the Knowledge, and the <span class=\"iTxt\">Eman</span>, and the Great Name, and inheritance of the Knowledge, and traces of the Knowledge (Ahadeeth) of the Prophet-hood, from the descendants of your<sup>saww</sup> offspring, just as I<sup>azwj</sup> did not Cut it off from the offspring of the Prophets<sup>as</sup> (before)’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn and Ahmad ibn Muhammad from ibn Mahbub from Muhammad ibn Fudayl from abu Hamza al-Thumali who has said that he heard abu Ja‘far (a.s.) say the following. “When Muhammad (s.a.) completed his task of prophet-hood and the duration of his life was about to end Allah, the Most High sent him wahy information through the angels. It said, “O Muhammad, your task of prophet-hood has come to an end and the duration of your life is about to reach a close. Therefore, you must place the knowledge with you, the faith, the great name, the legacy of knowledge and the symbols of the knowledge of the prophet-hood in your family with Ali ibn abu Talib (a.s.). It is because I do not want to discontinue the knowledge, the faith, the great name, the legacy of the of knowledge and the symbols of knowledge of the prophet-hood from your posterior descendents as I had not done so with descendents of the prophets.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/270)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 763,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:65:3",
        "refs": {
          "Quran": [
            "/books/quran:6:33",
            "/books/quran:42:23",
            "/books/quran:94:8",
            "/books/quran:81:8",
            "/books/quran:94:7",
            "/books/quran:16:127",
            "/books/quran:43:89",
            "/books/quran:5:67",
            "/books/quran:43:44",
            "/books/quran:33:33",
            "/books/quran:16:43",
            "/books/quran:87:19",
            "/books/quran:16:44",
            "/books/quran:17:26",
            "/books/quran:4:83",
            "/books/quran:81:9",
            "/books/quran:8:41",
            "/books/quran:57:25",
            "/books/quran:87:18",
            "/books/quran:4:59"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ الْحُسَيْنِ وَ غَيْرُهُ عَنْ سَهْلٍ عَنْ مُحَمَّدِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ يَحْيَى وَ مُحَمَّدُ بْنُ الْحُسَيْنِ جَمِيعاً عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ وَ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو عَنْ عَبْدِ الْحَمِيدِ بْنِ أَبِي الدَّيْلَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَوْصَى مُوسَى ( عليه السلام ) إِلَى يُوشَعَ بْنِ نُونٍ وَ أَوْصَى يُوشَعُ بْنُ نُونٍ إِلَى وَلَدِ هَارُونَ وَ لَمْ يُوصِ إِلَى وَلَدِهِ وَ لَا إِلَى وَلَدِ مُوسَى إِنَّ اللَّهَ تَعَالَى لَهُ الْخِيَرَةُ يَخْتَارُ مَنْ يَشَاءُ مِمَّنْ يَشَاءُ",
          "وَ بَشَّرَ مُوسَى وَ يُوشَعُ بِالْمَسِيحِ ( عليه السلام ) فَلَمَّا أَنْ بَعَثَ اللَّهُ عَزَّ وَ جَلَّ الْمَسِيحَ ( عليه السلام ) قَالَ الْمَسِيحُ لَهُمْ إِنَّهُ سَوْفَ يَأْتِي مِنْ بَعْدِي نَبِيٌّ اسْمُهُ أَحْمَدُ مِنْ وُلْدِ إِسْمَاعِيلَ ( عليه السلام ) يَجِي‏ءُ بِتَصْدِيقِي وَ تَصْدِيقِكُمْ وَ عُذْرِي وَ عُذْرِكُمْ وَ جَرَتْ مِنْ بَعْدِهِ فِي الْحَوَارِيِّينَ فِي الْمُسْتَحْفَظِينَ وَ إِنَّمَا سَمَّاهُمُ اللَّهُ تَعَالَى الْمُسْتَحْفَظِينَ لِأَنَّهُمُ اسْتُحْفِظُوا الِاسْمَ الْأَكْبَرَ وَ هُوَ الْكِتَابُ الَّذِي يُعْلَمُ بِهِ عِلْمُ كُلِّ شَيْ‏ءٍ الَّذِي كَانَ مَعَ الْأَنْبِيَاءِ ( صلوات الله عليهم )",
          "يَقُولُ اللَّهُ تَعَالَى وَ لَقَدْ أَرْسَلْنَا رُسُلًا مِنْ قَبْلِكَ وَ أَنْزَلْنا مَعَهُمُ الْكِتابَ وَ الْمِيزانَ الْكِتَابُ الِاسْمُ الْأَكْبَرُ وَ إِنَّمَا عُرِفَ مِمَّا يُدْعَى الْكِتَابَ التَّوْرَاةُ وَ الْإِنْجِيلُ وَ الْفُرْقَانُ فِيهَا كِتَابُ نُوحٍ وَ فِيهَا كِتَابُ صَالِحٍ وَ شُعَيْبٍ وَ إِبْرَاهِيمَ ( عليه السلام ) فَأَخْبَرَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ هذا لَفِي الصُّحُفِ الْأُولى صُحُفِ إِبْراهِيمَ وَ مُوسى فَأَيْنَ صُحُفُ إِبْرَاهِيمَ إِنَّمَا صُحُفُ إِبْرَاهِيمَ الِاسْمُ الْأَكْبَرُ وَ صُحُفُ مُوسَى الِاسْمُ الْأَكْبَرُ",
          "فَلَمْ تَزَلِ الْوَصِيَّةُ فِي عَالِمٍ بَعْدَ عَالِمٍ حَتَّى دَفَعُوهَا إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) فَلَمَّا بَعَثَ اللَّهُ عَزَّ وَ جَلَّ مُحَمَّداً ( صلى الله عليه وآله ) أَسْلَمَ لَهُ الْعَقِبُ مِنَ الْمُسْتَحْفِظِينَ وَ كَذَّبَهُ بَنُو إِسْرَائِيلَ وَ دَعَا إِلَى اللَّهِ عَزَّ وَ جَلَّ وَ جَاهَدَ فِي سَبِيلِه",
          "ثُمَّ أَنْزَلَ اللَّهُ جَلَّ ذِكْرُهُ عَلَيْهِ أَنْ أَعْلِنْ فَضْلَ وَصِيِّكَ فَقَالَ رَبِّ إِنَّ الْعَرَبَ قَوْمٌ جُفَاةٌ لَمْ يَكُنْ فِيهِمْ كِتَابٌ وَ لَمْ يُبْعَثْ إِلَيْهِمْ نَبِيٌّ وَ لَا يَعْرِفُونَ فَضْلَ نُبُوَّاتِ الْأَنْبِيَاءِ ( عليهم السلام ) وَ لَا شَرَفَهُمْ وَ لَا يُؤْمِنُونَ بِي إِنْ أَنَا أَخْبَرْتُهُمْ بِفَضْلِ أَهْلِ بَيْتِي فَقَالَ اللَّهُ جَلَّ ذِكْرُهُ وَ لا تَحْزَنْ عَلَيْهِمْ وَ قُلْ سَلامٌ فَسَوْفَ يَعْلَمُونَ ",
          "فَذَكَرَ مِنْ فَضْلِ وَصِيِّهِ ذِكْراً فَوَقَعَ النِّفَاقُ فِي قُلُوبِهِمْ فَعَلِمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ذَلِكَ وَ مَا يَقُولُونَ فَقَالَ اللَّهُ جَلَّ ذِكْرُهُ يَا مُحَمَّدُ وَ لَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِما يَقُولُونَ فَإِنَّهُمْ لا يُكَذِّبُونَكَ وَ لكِنَّ الظَّالِمِينَ بِآياتِ اللَّهِ يَجْحَدُونَ وَ لَكِنَّهُمْ يَجْحَدُونَ بِغَيْرِ حُجَّةٍ لَهُمْ",
          "وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَتَأَلَّفُهُمْ وَ يَسْتَعِينُ بِبَعْضِهِمْ عَلَى بَعْضٍ وَ لَا يَزَالُ يُخْرِجُ لَهُمْ شَيْئاً فِي فَضْلِ وَصِيِّهِ حَتَّى نَزَلَتْ هَذِهِ السُّورَةُ فَاحْتَجَّ عَلَيْهِمْ حِينَ أُعْلِمَ بِمَوْتِهِ وَ نُعِيَتْ إِلَيْهِ نَفْسُهُ فَقَالَ اللَّهُ جَلَّ ذِكْرُهُ فَإِذا فَرَغْتَ فَانْصَبْ وَ إِلى رَبِّكَ فَارْغَبْ يَقُولُ إِذَا فَرَغْتَ فَانْصَبْ عَلَمَكَ وَ أَعْلِنْ وَصِيَّكَ فَأَعْلِمْهُمْ فَضْلَهُ عَلَانِيَةً",
          "فَقَالَ ( صلى الله عليه وآله ) مَنْ كُنْتُ مَوْلَاهُ فَعَلِيٌّ مَوْلَاهُ اللَّهُمَّ وَالِ مَنْ وَالَاهُ وَ عَادِ مَنْ عَادَاهُ ثَلَاثَ مَرَّاتٍ ثُمَّ قَالَ لَأَبْعَثَنَّ رَجُلًا يُحِبُّ اللَّهَ وَ رَسُولَهُ وَ يُحِبُّهُ اللَّهُ وَ رَسُولُهُ لَيْسَ بِفَرَّارٍ يُعَرِّضُ بِمَنْ رَجَعَ يُجَبِّنُ أَصْحَابَهُ وَ يُجَبِّنُونَهُ",
          "وَ قَالَ ( صلى الله عليه وآله ) عَلِيٌّ سَيِّدُ الْمُؤْمِنِينَ وَ قَالَ عَلِيٌّ عَمُودُ الدِّينِ وَ قَالَ هَذَا هُوَ الَّذِي يَضْرِبُ النَّاسَ بِالسَّيْفِ عَلَى الْحَقِّ بَعْدِي وَ قَالَ الْحَقُّ مَعَ عَلِيٍّ أَيْنَمَا مَالَ وَ قَالَ إِنِّي تَارِكٌ فِيكُمْ أَمْرَيْنِ إِنْ أَخَذْتُمْ بِهِمَا لَنْ تَضِلُّوا كِتَابَ اللَّهِ عَزَّ وَ جَلَّ وَ أَهْلَ بَيْتِي عِتْرَتِي أَيُّهَا النَّاسُ اسْمَعُوا وَ قَدْ بَلَّغْتُ إِنَّكُمْ سَتَرِدُونَ عَلَيَّ الْحَوْضَ فَأَسْأَلُكُمْ عَمَّا فَعَلْتُمْ فِي الثَّقَلَيْنِ وَ الثَّقَلَانِ كِتَابُ اللَّهِ جَلَّ ذِكْرُهُ وَ أَهْلُ بَيْتِي فَلَا تَسْبِقُوهُمْ فَتَهْلِكُوا وَ لَا تُعَلِّمُوهُمْ فَإِنَّهُمْ أَعْلَمُ مِنْكُمْ ",
          "فَوَقَعَتِ الْحُجَّةُ بِقَوْلِ النَّبِيِّ ( صلى الله عليه وآله ) وَ بِالْكِتَابِ الَّذِي يَقْرَأُهُ النَّاسُ فَلَمْ يَزَلْ يُلْقِي فَضْلَ أَهْلِ بَيْتِهِ بِالْكَلَامِ وَ يُبَيِّنُ لَهُمْ بِالْقُرْآنِ إِنَّما يُرِيدُ اللَّهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَ يُطَهِّرَكُمْ تَطْهِيراً وَ قَالَ عَزَّ ذِكْرُهُ وَ اعْلَمُوا أَنَّما غَنِمْتُمْ مِنْ شَيْ‏ءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَ لِلرَّسُولِ وَ لِذِي الْقُرْبى ثُمَّ قَالَ وَ آتِ ذَا الْقُرْبى حَقَّهُ ",
          "فَكَانَ عَلِيٌّ ( عليه السلام ) وَ كَانَ حَقُّهُ الْوَصِيَّةَ الَّتِي جُعِلَتْ لَهُ وَ الِاسْمَ الْأَكْبَرَ وَ مِيرَاثَ الْعِلْمِ وَ آثَارَ عِلْمِ النُّبُوَّةِ فَقَالَ قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ فِي الْقُرْبى ثُمَّ قَالَ وَ إِذَا الْمَوْؤُدَةُ سُئِلَتْ بِأَيِّ ذَنْبٍ قُتِلَتْ يَقُولُ أَسْأَلُكُمْ عَنِ الْمَوَدَّةِ الَّتِي أَنْزَلْتُ عَلَيْكُمْ فَضْلَهَا مَوَدَّةِ الْقُرْبَى بِأَيِّ ذَنْبٍ قَتَلْتُمُوهُمْ",
          "وَ قَالَ جَلَّ ذِكْرُهُ فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ قَالَ الْكِتَابُ هُوَ الذِّكْرُ وَ أَهْلُهُ آلُ مُحَمَّدٍ ( عليه السلام ) أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِسُؤَالِهِمْ وَ لَمْ يُؤْمَرُوا بِسُؤَالِ الْجُهَّالِ وَ سَمَّى اللَّهُ عَزَّ وَ جَلَّ الْقُرْآنَ ذِكْراً فَقَالَ تَبَارَكَ وَ تَعَالَى وَ أَنْزَلْنا إِلَيْكَ الذِّكْرَ لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ وَ لَعَلَّهُمْ يَتَفَكَّرُونَ وَ قَالَ عَزَّ وَ جَلَّ وَ إِنَّهُ لَذِكْرٌ لَكَ وَ لِقَوْمِكَ وَ سَوْفَ تُسْئَلُونَ ",
          "وَ قَالَ عَزَّ وَ جَلَّ أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ وَ قَالَ عَزَّ وَ جَلَّ وَ لَوْ رَدُّوهُ إِلَى اللَّهِ وَ إِلَى الرَّسُولِ وَ إِلى أُولِي الْأَمْرِ مِنْهُمْ لَعَلِمَهُ الَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ فَرَدَّ الْأَمْرَ أَمْرَ النَّاسِ إِلَى أُولِي الْأَمْرِ مِنْهُمُ الَّذِينَ أَمَرَ بِطَاعَتِهِمْ وَ بِالرَّدِّ إِلَيْهِمْ",
          "فَلَمَّا رَجَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ حَجَّةِ الْوَدَاعِ نَزَلَ عَلَيْهِ جَبْرَئِيلُ ( عليه السلام ) فَقَالَ يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ وَ إِنْ لَمْ تَفْعَلْ فَما بَلَّغْتَ رِسالَتَهُ وَ اللَّهُ يَعْصِمُكَ مِنَ النَّاسِ إِنَّ اللَّهَ لا يَهْدِي الْقَوْمَ الْكافِرِينَ فَنَادَى النَّاسَ فَاجْتَمَعُوا وَ أَمَرَ بِسَمُرَاتٍ فَقُمَّ شَوْكُهُنَّ ثُمَّ قَالَ ( صلى الله عليه وآله ) يَا أَيُّهَا النَّاسُ مَنْ وَلِيُّكُمْ وَ أَوْلَى بِكُمْ مِنْ أَنْفُسِكُمْ فَقَالُوا اللَّهُ وَ رَسُولُهُ فَقَالَ مَنْ كُنْتُ مَوْلَاهُ فَعَلِيٌّ مَوْلَاهُ اللَّهُمَّ وَالِ مَنْ وَالَاهُ وَ عَادِ مَنْ عَادَاهُ ثَلَاثَ مَرَّاتٍ ",
          "فَوَقَعَتْ حَسَكَةُ النِّفَاقِ فِي قُلُوبِ الْقَوْمِ وَ قَالُوا مَا أَنْزَلَ اللَّهُ جَلَّ ذِكْرُهُ هَذَا عَلَى مُحَمَّدٍ قَطُّ وَ مَا يُرِيدُ إِلَّا أَنْ يَرْفَعَ بِضَبْعِ ابْنِ عَمِّهِ",
          "فَلَمَّا قَدِمَ الْمَدِينَةَ أَتَتْهُ الْأَنْصَارُ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ جَلَّ ذِكْرُهُ قَدْ أَحْسَنَ إِلَيْنَا وَ شَرَّفَنَا بِكَ وَ بِنُزُولِكَ بَيْنَ ظَهْرَانَيْنَا فَقَدْ فَرَّحَ اللَّهُ صَدِيقَنَا وَ كَبَّتَ عَدُوَّنَا وَ قَدْ يَأْتِيكَ وُفُودٌ فَلَا تَجِدُ مَا تُعْطِيهِمْ فَيَشْمَتُ بِكَ الْعَدُوُّ فَنُحِبُّ أَنْ تَأْخُذَ ثُلُثَ أَمْوَالِنَا حَتَّى إِذَا قَدِمَ عَلَيْكَ وَفْدُ مَكَّةَ وَجَدْتَ مَا تُعْطِيهِمْ ",
          "فَلَمْ يَرُدَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَيْهِمْ شَيْئاً وَ كَانَ يَنْتَظِرُ مَا يَأْتِيهِ مِنْ رَبِّهِ فَنَزَلَ جَبْرَئِيلُ ( عليه السلام ) وَ قَالَ قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ فِي الْقُرْبى وَ لَمْ يَقْبَلْ أَمْوَالَهُمْ",
          "فَقَالَ الْمُنَافِقُونَ مَا أَنْزَلَ اللَّهُ هَذَا عَلَى مُحَمَّدٍ وَ مَا يُرِيدُ إِلَّا أَنْ يَرْفَعَ بِضَبْعِ ابْنِ عَمِّهِ وَ يَحْمِلَ عَلَيْنَا أَهْلَ بَيْتِهِ يَقُولُ أَمْسِ مَنْ كُنْتُ مَوْلَاهُ فَعَلِيٌّ مَوْلَاهُ وَ الْيَوْمَ قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ فِي الْقُرْبى ثُمَّ نَزَلَ عَلَيْهِ آيَةُ الْخُمُسِ فَقَالُوا يُرِيدُ أَنْ يُعْطِيَهُمْ أَمْوَالَنَا وَ فَيْئَنَا",
          "ثُمَّ أَتَاهُ جَبْرَئِيلُ فَقَالَ يَا مُحَمَّدُ إِنَّكَ قَدْ قَضَيْتَ نُبُوَّتَكَ وَ اسْتَكْمَلْتَ أَيَّامَكَ فَاجْعَلِ الِاسْمَ الْأَكْبَرَ وَ مِيرَاثَ الْعِلْمِ وَ آثَارَ عِلْمِ النُّبُوَّةِ عِنْدَ عَلِيٍّ ( عليه السلام ) فَإِنِّي لَمْ أَتْرُكِ الْأَرْضَ إِلَّا وَ لِيَ فِيهَا عَالِمٌ تُعْرَفُ بِهِ طَاعَتِي وَ تُعْرَفُ بِهِ وَلَايَتِي وَ يَكُونُ حُجَّةً لِمَنْ يُولَدُ بَيْنَ قَبْضِ النَّبِيِّ إِلَى خُرُوجِ النَّبِيِّ الْآخَرِ ",
          "قَالَ فَأَوْصَى إِلَيْهِ بِالِاسْمِ الْأَكْبَرِ وَ مِيرَاثِ الْعِلْمِ وَ آثَارِ عِلْمِ النُّبُوَّةِ وَ أَوْصَى إِلَيْهِ بِأَلْفِ كَلِمَةٍ وَ أَلْفِ بَابٍ يَفْتَحُ كُلُّ كَلِمَةٍ وَ كُلُّ بَابٍ أَلْفَ كَلِمَةٍ وَ أَلْفَ بَابٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Husayn and someone else, from Sahl, from Muhammad Bin Isa and Muhammad Bin Yahya and Muhammad Bin Al Husayn, altogether from Muhammad Bin Sinan, from Ismail Bin Jabir and Abdul Kareem Bin Amro, from Abdul Hameed Bin Abu Al Daylam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Musa<sup>as</sup> bequeathed to Yoshua<sup>as</sup> Bin Noon<sup>as</sup>, and Yoshua<sup>as</sup> Bin Noon<sup>as</sup> bequeathed to a son of Haroun<sup>as</sup> and did not bequeath to his<sup>as</sup> own son, nor to a son of Musa<sup>as</sup>. Allah<sup>azwj</sup> the Exalted Gave him<sup>as</sup> the choice that he<sup>as</sup> can choose the one whom he<sup>as</sup> so desires to, from the ones he<sup>as</sup> so desires to. ",
            "And Musa<sup>as</sup> and Yoshua<sup>as</sup> gave glad tidings of the Messiah<sup>as</sup>. So when Allah<sup>azwj</sup> Mighty and Majestic Sent the Messiah<sup>as</sup>, the Messiah<sup>as</sup> said to them: ‘There would be soon coming a Prophet<sup>saww</sup> after me<sup>as</sup> whose name is Ahmad<sup>saww</sup>, from the children of Ismail<sup>as</sup>. He<sup>saww</sup> would come ratifying me<sup>as</sup> and ratifying you, and my<sup>as</sup> justifications and your justifications’. And there flowed from after him<sup>as</sup> among the disciples, among the preservers, and rather Allah<sup>azwj</sup> Named them as ‘preservers’ because they preserved the Great Name, and it is the ‘Book’ through which one can find out the knowledge of everything which was with the Prophets<sup>as</sup>. ",
            "Allah<sup>azwj</sup> the Exalted is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:57#h25\">[57:25]</a> Certainly We sent Our Rasools with clear arguments, and sent down with them the Book and the Scale</span>. The Book is the Great Name, and rather it is recognised from what He<sup>azwj</sup> is Called in the Books, the Torah and the Evangel and the Criterion (Quran). Therein is the Book of Noah<sup>as</sup>, and therein is the Book of Salih<sup>as</sup> and Shuayb<sup>as</sup> and Ibrahim<sup>as</sup>. So Allah<sup>azwj</sup> Mighty and Majestic Informed <span class=\"ibTxt\"><a href=\"/#/books/quran:87#h18\">[87:18]</a> Most surely this is in the earlier Scriptures, <a href=\"/#/books/quran:87#h19\">[87:19]</a> The scriptures of Ibrahim and Musa</span>. So where is the Scripture of Ibrahim<sup>as</sup>? But rather, the Scripture of Ibrahim<sup>as</sup> is ‘الِاسْمُ الْأَكْبَرُ’ the Great Name, and the Scripture of Musa<sup>as</sup> is ‘الِاسْمُ الْأَكْبَرُ’ the Great Name. ",
            "So the bequest did not cease to be in a scholar after a scholar until it was handed over to Muhammad<sup>saww</sup>. So when Allah<sup>azwj</sup> Mighty and Majestic Sent Muhammad<sup>saww</sup>, the descendants from the ‘preservers’ submitted to him<sup>saww</sup> and the Children of Israel belied him<sup>saww</sup>, ‘وَ دَعَا إِلَى اللَّهِ عَزَّ وَ جَلَّ وَ جَاهَدَ فِي سَبِيلِه’ and they (the descendants of the preservers) called to Allah<sup>azwj</sup> and fought in His<sup>azwj</sup> Way. ",
            "Then Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention, Revealed unto him<sup>saww</sup>: “Proclaim the merits of your<sup>saww</sup> successor<sup>asws</sup>!” So he<sup>saww</sup> said: ‘Lord<sup>azwj</sup>! The Arabs are a disloyal people. There has not happened to be a Book among them nor a Prophet<sup>as</sup> was Sent to them, but they are neither recognising the merits of the Prophet-hoods of the Prophets<sup>as</sup>, nor their<sup>as</sup> nobilities, nor would they be believing in me<sup>saww</sup> if I<sup>saww</sup> were to inform them with the merits of the People<sup>asws</sup> of my<sup>saww</sup> Household’. So Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention Said: “And do not grieve upon them and say <span class=\"ibTxt\"><a href=\"/#/books/quran:43#h89\">[43:89]</a> Peace, for they shall soon come to know</span>’.",
            "So he<sup>saww</sup> mentioned the merits of his<sup>saww</sup> successor<sup>asws</sup> with a mention, and the hypocrisy occurred in their hearts. So Rasool-Allah<sup>saww</sup> knew that and what they were saying, so Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention, Said: “O Muhammad<sup>saww</sup>! <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h33\">[6:33]</a> We know indeed that what they say certainly grieves you, but surely they cannot call you a liar; but the unjust deny the Signs of Allah</span>”. But they were denying without there being any proof/argument for them. ",
            "And it was so that Rasool-Allah<sup>saww</sup> used to harmonise with them and assist with some of them upon the others, and he<sup>saww</sup> did not cease to bring out for them something regarding the merits of his<sup>saww</sup> successor<sup>asws</sup> until this Chapter was Revealed. So he<sup>saww</sup> argued against them when he<sup>saww</sup> knew of (nearness of) his<sup>saww</sup> own death, and gave the news of it to himself<sup>saww</sup>. So Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention Said <span class=\"ibTxt\"><a href=\"/#/books/quran:94#h7\">[94:7]</a> So when you are free, nominate. <a href=\"/#/books/quran:94#h8\">[94:8]</a> And to your Lord turn (all) your attention</span>. He<sup>saww</sup> is Saying: “When you<sup>saww</sup> are free, so nominate your<sup>saww</sup> flag and proclaim your<sup>saww</sup> successor<sup>asws</sup>, so let them (people) know his<sup>asws</sup> merits publicly”. ",
            "So he<sup>saww</sup> said: ‘The one whose Master I<sup>saww</sup> was, so Ali<sup>asws</sup> is his Master! O Allah<sup>azwj</sup>! Befriend the one who befriends him<sup>asws</sup> and be Inimical to the one who is inimical to him<sup>asws</sup>’ – three times. Then he<sup>saww</sup> said (on the Day of Khyber): ‘I<sup>saww</sup> shall be sending a man who loves Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> love him<sup>asws</sup>. He<sup>asws</sup> isn’t with fleeing’ thus exposing the cowards from his<sup>saww</sup> companions and their cowardice.  ",
            "And he<sup>saww</sup> said: ‘Ali<sup>asws</sup> is the chief of the <span class=\"iTxt\">Momineen</span>’, and said: ‘Ali<sup>asws</sup> is the pillar of the Religion’, and said: ‘This is the one who would be striking the people with the sword upon the Truth after me<sup>saww</sup>’, and said: ‘The Truth is with Ali<sup>asws</sup> wherever he<sup>asws</sup> so inclines’. Amd said: ‘I<sup>saww</sup> leave behind among you all two matters. If you were to take to these two, you will never stray – the Book of Allah<sup>azwj</sup> Mighty and Majestic and the People<sup>asws</sup> of my<sup>saww</sup> Household, my<sup>saww</sup> family. O you people! Listen, and I<sup>saww</sup> have delivered (the Message). You will soon be returning to me<sup>saww</sup> at the Fountain, and I<sup>saww</sup> will be asking you all about what you had done with the two weighty things, and the two weighty things are the Book of Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention and the People<sup>asws</sup> of my<sup>saww</sup> Household. Therefore, do not precede them<sup>asws</sup> for you will be destroyed, and not do (try to) teach them<sup>asws</sup>, for they<sup>asws</sup> are more knowledgeable than you are’. ",
            "So the proof occurred by the words of the Prophet<sup>saww</sup> and by the Book which people recited. So he<sup>saww</sup> did not cease to cast the merits of the People<sup>asws</sup> of his<sup>saww</sup> Household with the speech and clarifying to them with the Quran <span class=\"ibTxt\"><a href=\"/#/books/quran:33#h33\">[33:33]</a> But rather, Allah Desires to Keep away the uncleanness from you, O people of the House! And to Purify you with a Purification</span>. And Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention <span class=\"ibTxt\"><a href=\"/#/books/quran:8#h41\">[8:41]</a> And know that whatever war booty you gain, a fifth of it is for Allah and for the Rasool and for the near of kin</span>. Then He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h26\">[17:26]</a> And give to the near of kin his due</span>.",
            "So it was Ali<sup>asws</sup>, and it was his<sup>asws</sup> right, the successorship which was Made to be for him<sup>asws</sup>, and the Great Name, and the inherited Knowledge, and traces (Ahadeeth) of the Knowledge of the Prophet-hood, so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:42#h23\">[42:23]</a> Say: I do not ask of you any Recompense for it except for the cordiality for my near relatives</span>. Then He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:81#h8\">[81:8]</a> And when the cordiality (Mawaddat) is asked about <a href=\"/#/books/quran:81#h9\">[81:9]</a> For what sin was it killed</span>. He<sup>azwj</sup> is Saying: “I<sup>azwj</sup> shall Ask all of you about the cordiality which I<sup>azwj</sup> Revealed upon you of its merits, the cordiality for the near-relative (of Rasool-Allah<sup>saww</sup>), for which did you kill them<sup>asws</sup>?”",
            "And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h43\">[16:43]</a> so ask the People of the Reminder if you do not know</span>. The Book, it is the Reminder (<span class=\"iTxt\">Al-Zikr</span>), and its people are the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. Allah<sup>azwj</sup> Mighty and Majestic Commanded with asking them<sup>asws</sup> and did not Command with asking the ignoramuses, and Allah<sup>azwj</sup> Mighty and Majestic Named the Quran as The Reminder (<span class=\"iTxt\">Al-Zikr</span>), so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h44\">[16:44]</a> and We Revealed unto you the Reminder that you may clarify to the people what has been Revealed to them, perhaps they would ponder</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:43#h44\">[43:44]</a> And it is a Reminder for you and your people, and you shall soon be questioned</span>.",
            "And the Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h59\">[4:59]</a> O you who believe! Obey Allah and obey the Rasool and those in authority from among you</span>. And the Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h83\">[4:83]</a> and if they had referred it to the Rasool and to those in authority among them, those among them who can search out the Knowledge of it would have known it</span>. Thus, the referring of the matter is the referring of the people of their affairs to the one with Divine Authority (<span class=\"iTxt\">Ul Al-Amr</span>) from them, those they had been Commanded to obey them<sup>asws</sup>, and with the referring to them<sup>asws</sup>.",
            "So when Rasool-Allah<sup>saww</sup> returned from the Farewell Hajj, Jibraeel<sup>as</sup> descended unto him<sup>saww</sup> and said <span class=\"ibTxt\"><a href=\"/#/books/quran:5#h67\">[5:67]</a> O Rasool! Deliver what has been Revealed unto you from your Lord; and if you do it not, then you have not delivered His Message, and Allah will Protect you from the people; surely Allah will not Guide the unbelieving people</span>. So he<sup>saww</sup> called the people, and they gathered, and he<sup>saww</sup> ordered with the clearing (of the ground), so the thorns were removed. Then he<sup>saww</sup> said: ‘O you people! Who is your guardian and closer with you all than your own selves?’ So they (people) said, ‘Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>!’ So he<sup>saww</sup> said: ‘The one whose Master I<sup>saww</sup> am, so Ali<sup>asws</sup> is his Master. O Allah<sup>azwj</sup>! Befriend the one who befriends him<sup>asws</sup> and be Inimical to the one who is inimical to him<sup>asws</sup>’ – three times. ",
            "So the thorns of hypocrisy occurred in the hearts of the people and they said, ‘Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention has not Revealed this unto Muhammad<sup>saww</sup> at all, and he<sup>saww</sup> does not intend except to raise the shoulder of his<sup>asws</sup> cousin<sup>asws</sup>’. ",
            "So when he<sup>as</sup> proceeded to Al Medina, the Helpers came to him<sup>saww</sup> and they said, ‘O Rasool-Allah<sup>saww</sup>! Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention has Favoured upon us and has Ennobled us with you<sup>saww</sup> and by your<sup>saww</sup> dwelling between our midst. So Allah<sup>azwj</sup> has Made our friends happy and and our enemies are suppressed, and there come to you delegations, so you<sup>saww</sup> do not find what to give them, and the enemies gloat upon you<sup>saww</sup>. So we would love it if you<sup>saww</sup> were to take a third of our wealth so that when a delegation of Makkah comes over to you<sup>saww</sup>, you<sup>saww</sup> would find what to give them’. ",
            "But Rasool-Allah<sup>saww</sup> did not respond upon them with anything, and he<sup>saww</sup> was awaiting what would be coming from his<sup>saww</sup> Lord<sup>azwj</sup>. So Jibraeel<sup>as</sup> descended and said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:42#h23\">[42:23]</a> Say: I do not ask of you any Recompense for it except for the cordiality for my near relatives</span>’, and he<sup>saww</sup> did not accept their wealth. ",
            "So the hypocrites said, ‘This has not been Revealed upon Muhammad<sup>saww</sup>, and he<sup>saww</sup> does not intend except to raise the shoulders of his<sup>saww</sup> cousin and load upon us the People<sup>asws</sup> of his<sup>saww</sup> Household. Yesterday he<sup>saww</sup> was saying: ‘The one whose Master I<sup>saww</sup> am, so Ali<sup>asws</sup> is his Master’, and today: ‘‘<span class=\"ibTxt\"><a href=\"/#/books/quran:42#h23\">[42:23]</a> Say: I do not ask of you any Recompense for it except for the cordiality for my near relatives</span>’. Then the Verse of <span class=\"iTxt\">Khums</span> was Revealed, so they said, ‘He<sup>saww</sup> intends that we give him<sup>saww</sup> our wealth, and our war booties’. ",
            "Then Jibraeel<sup>as</sup> came over to him<sup>saww</sup> and he<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! (Allah<sup>azwj</sup> is Saying): “You<sup>saww</sup> have spent your<sup>saww</sup> Prophet-hood and completed your<sup>saww</sup> days, therefore make the Great Name, and the inherited Knowledge, and the traces (Ahadeeth) of the Knowledge of the Prophet-hood to be with Ali<sup>asws</sup>, for I<sup>azwj</sup> do not Leave the earth except there is a scholar for Me<sup>azwj</sup> in it, by whom My<sup>azwj</sup> obedience can be recognised, and by him<sup>asws</sup> My<sup>azwj</sup> Wilayah can be recognised, and he<sup>asws</sup> can happen to be My<sup>azwj</sup> Divine Authority to the ones who would be born from the passing away of a Prophet<sup>as</sup> to the coming out of another Prophet<sup>as</sup>”’. ",
            "He<sup>asws</sup> said: ‘So he<sup>saww</sup> bequeathed to him<sup>asws</sup> with the Great Name, and the inherited Knowledge, and traces (Ahadeeth) of the Knowledge of the Prophet-hood, and bequeathed to him<sup>asws</sup> with a thousand words and a thousand topics, with each word and each topic opening a thousand words and a thousand topics’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn al-Husayn and others have narrated from Sahl from Muhammad ibn ‘Isa and Muhammad ibn Yahya and Muhammad ibn al-Husayn all of them from Muhammad ibn Sinan from Isma‘il ibn Jabur and ‘Abd Al-Karim ibn ‘Amr from ‘Abd Al-Hamid ibn abu al--Daylam from abu ‘Abdallah (a.s.) who has said the following. “Moses prepared his will and be given to Yusha‘ ibn Nun. Yusha‘ ibn Nun made his will to be given to the sons of Harun. He did not made a will to be given to his own sons nor to be given to the sons of Moses. To Allah, the Most High belong all the good choice. He chooses whoever He wants from whomever He wants. He gave the glad news about Jesus to Moses and Yusha‘. When Allah, the Most Holy, the Most High, raised Jesus as His Messenger Jesus said to them, “After there will come a prophet whose name will be Ahmad from the descendents of Isma‘il (a.s.). He will come and affirm my message and your message, my excuses and your excuses. (The will) will continued after him in the disciples the conservative ones. Allah, the Most High, has called them as conservative ones because they preserved the greatest name and it is the book through which such knowledge of all things is learned that existed with the prophets (s.a.) as Allah, the Most High, has said the following. “We sent Our Messengers (before you ) with clear evidence (to support their truthfulness), and sent with them the Book and the Balance . .” <a href=\"/#/books/quran:57#h25\">[57:25]</a>. The book is the greatest name. Of what is known as the books are Torah, Gospel and al-Furqan (the Holy Quran ) of which also is the book of Noah, the book of Salih, shu‘ayb and Abraham. Allah, the Most Holy, the Most High, has said, “This is what is written in the ancient heavenly Books,<a href=\"/#/books/quran:87#h18\">[87:18]</a> the Scriptures of Abraham and Moses <a href=\"/#/books/quran:87#h19\">[87:19]</a>. Where then is the book of Abraham? In fact, the book of Abraham is the greatest name. The book of Moses is thegreatest name. Thus, the will continues through one scholar to the next scholar until they delivered it to Muhammad (s.a.) “When Allah, the Most Holy, the Most High, sent Muhammad (s.a.) the descendents of the conservative disciples accepted his faith but the lyinng of the Israelites refused to believe in him. He prayed to Allah, the Most Holy, the Most High, and worked hard for His cause. Thereafter Allah, Most High is Whose mention, commanded him to declare the excellence of the executor of your will and he said, “My Lord, the Arabs are the most rude and unjust ones. They did not have anybooks with them, no prophet had come to them and they do not know the virtues of the prophcy of the prophets (s.a.) and their honor. They will not believe me if I would declare to them the excellence and virtues of my family. Allah, Most Holy the mention of Whose name is, said, “Do not be grieved about them . .” <a href=\"/#/books/quran:16#h127\">[16:127]</a> “. .We have told him, “Ignore them and say to them ’farewell’. They will soon know the consequences of their deeds <a href=\"/#/books/quran:43#h89\">[43:89]</a> He has made a mention of the name of the executor of his will and hypocrisy fell into their hearts. The Messenger of Allah noticed it and whatever they would say. Allah, the Most Holy, the Most High, sais, “O Muhammad (s.a.) We know that what they say causes tension to your heart. They, in fact, do not reject what you say, but they refuse to accept the signs of Allah. However, they refuse to accept them without any good reason and authority. The the Messenger of Allah would associate with them and would seek the support of some of them against the other ones among them. He would continue to express the excepllence of the executor of his will to them fromtime to time until the following cchapter of the Holy Quran was revealed. He presented justifications against them when he was informed of death to approach and the news leaving this world. Allah, Most Holy, is the mention of Whose name, said, “When you are free from (your obligations), strive hard (to worship God) <a href=\"/#/books/quran:94#h7\">[94:7]</a> and be devoted to your Lord’s service.” <a href=\"/#/books/quran:94#h8\">[94:8]</a>. Allah says, “When your duty is fulfilled then establish your mark and symbol and declare who the executor of will, will be and speak to them of his excellence and virtues. Thus, Muhammad (s.a.) declared, “Over whoever I have Divine Authority this Ali also has Divine Authority over them. O Lord, support those who would support him and be the enemy of those who are hostile to him three time.” He has further said, “I will commision and send the man who loves Allah and His Messenger and Allah and His Messenger love him. He is not the one who would run away from the battle field. In this he points out to the one who returned from the gates of the castle frightening and disheartening his people. He has also said, “Ali is the leader of the believers. Ali is the pillar of religion.” He has further said, “This is the one who strikes people with his sword to defend the truth after me.” The Holy Prophet has said, “The truth is with Ali wherever he would incline.” The Holy Prophet has said, “I leave among two facts, would you hold to them firmly, you will never be mislead, the book of Allah, the Most Holy, the Most High, and my family, my descendents. O people, listen. I have certainly preached the message to you. You will arrive at the pool of al-kawthar, and will ask you about your dealings towards the two graviticious matters. The two graviticious matters are the book of Allah, the Most Holy, the Most High, and my family. Do not proceed ahead othem lest you will be destroyed. Do not try to treach them because they by far are more knowledgeable than you. Even though al-Hujja (solid proof of Ali’s Wilaya his Divine Authority over the people after the Holy Prophet) was established through the words of the the Messenger of Allah and those of the Book that people read, however, he continued to express the excellence and spiritual virtues of his family in words and explain with verses of the Holy Quran. “People of the house, God wants to remove all kinds of uncleanliness from you and to purify you thoroughly. <a href=\"/#/books/quran:33#h33\">[33:33]</a> “Know that whatever property you may gain, one fifth belongs to God, the Messenger, the kindred,. .” <a href=\"/#/books/quran:8#h41\">[8:41]</a> “Give the relatives, the destitute and those who when on a journey have become needy, their dues. “ <a href=\"/#/books/quran:17#h26\">[17:26]</a> It was Ali (a.s.) and his right was the chance to execute the will of the Holy Prophet (s.a.) that gave him the Leadership with Divine Authority which was created for him, the greatest name, the legacy of knowledge and the symbols of knowledge of the prophet-hood. He also has said, “(Muhammad), say, “I do not ask you for any payment for my preaching to you except (your) love of(my near) relatives.. .” <a href=\"/#/books/quran:42#h23\">[42:23]</a>. “questions are asked about the baby girls buried alive,” <a href=\"/#/books/quran:81#h8\">[81:8]</a> He says, “I ask you about the love that I had told you about its great virtue. It was the love of the relatives (family of the Holy Prophet) but for what reason did you murder them. He, Most Exalted Whose mention is, has said, “Ask those who know about the heavenly Books if you do not know about this.” <a href=\"/#/books/quran:16#h43\">[16:43]</a> He has said that the Book is the reminder and people of this reminder (the book) are the Ahl –al-Bayt of Muhammad (s.a.). Allah, the Most Holy, the Most High, has commanded them to ask from but theyare not commanded to ask the ignorant people. Allah, the Most Holy, the Most High, has called the Holy Quran Dhikr (reminder), thus, He has said, “We have revealed the Quran to you so that you could tell the people what has been revealed to them and so that perhaps they will think.” <a href=\"/#/books/quran:16#h44\">[16:44]</a> Allah, the Most Holy, the Most High, “The Quran is a reminder to you and to your people and you will soon be questioned about it.” <a href=\"/#/books/quran:43#h44\">[43:44]</a> Allah, the Most Holy, the Most High, has alsosaid, “Believers, obey God, His Messenger, and your leaders (who possess Divine authority). .” <a href=\"/#/books/quran:4#h59\">[4:59]</a> He has said, “Had they referred it to the Messenger or to their leaders (who possess Divine,Authority) they could have used that information more properly. Were it not for the favor and mercy of God, all but a few of them would have followed Satan. <a href=\"/#/books/quran:4#h83\">[4:83]</a> The referring of the matter and the task mentioned in the above verse is reffering in the task and the affairs of the people. People must referred in such tasks to the people who possess Ddivine Authority from among them. The people that Allah has commanded to be obeyed and referred to. When the Messenger of Allah returned from the his farewell piligrimage to the sacred House in Makka Jibril descended to him and said, “Messenger, preach what is revealed to you from your Lord. If you will not preach, it would be as though you have not conveyed My message. God protects you from men. He does not guide the unbelieving people.” <a href=\"/#/books/quran:5#h67\">[5:67]</a> He called the people to come together at one place and they did. He ordered that the spiky bushes be removed from the ground to make room. He (s.a.) then said, “O people, who is your guardian with divine Authority who has greater priority to your souls than yourselves?” They said, Allah and His Messenger have such authority.” The Holy Prophet (s.a.) then said, “Over whoever I have Divine Authority this Ali also has the same degree of authority. O Lord support those who support him (Ali) and be the enemy of those who are his (Ali’s) enemies. He said this three times. This made the thorn of hyposcrisy to deep itself into the hearts of certain group of people who said, “Allah, Most Great is His to mention, has never sent any such thing to Muhammad (s.a.). He only wants to left up the shoulder of His nephew to promote him. when he arrived at madina, the Ansar, Muslims of Madina came to see him for a certain issue. They said, “O the Messenger of Allah, Allah, Most great the mention of Whose name is, has granted usa great deal of favors. He has granted us honor in bringing you to this town among us. In so doing He has brought joy to the hearts of our friend and sorrow to our enemies. We know that many delegates come to see you and there is not enough to give them and the enemies call it degrading. We would like very much if you would accept one third of our properties so that when a delegate from Makka 2would come to see you, you would find enough means to accommodate them. The Messenger of Allah did not reply them with anything and he was waiting for Jibril to come from his Lord. Jibril descended and said, “. .(Muhammad), say, “I do not ask you for any payment for my preaching to you except (your) love of(my near) relatives. .” <a href=\"/#/books/quran:42#h23\">[42:23]</a> He did not accept their property. The hypocrites said, “Allah has not sent this to Muhammad. He only wants to left up the shoulder of his nephew to promote him. He is imposing his family up on us. Yesterday he said, “Over whoever I have Divine authority, this Ali also has the same degree of Divine authority over them and today he says, “.(Muhammad), say, “I do not ask you for any payment for my preaching to you except (your) love of(my near) relatives. . .” <a href=\"/#/books/quran:42#h23\">[42:23]</a> Thereafter the verse of the Holy Quran about Khums (paying one fifth of net income as tax came (see 8:41) They said, “He only wants to take away our properties and interests.” Then Jibril came and said, “O Muhammad (s.a.) you have completed the task of prophet-hood and the duration of your life is coming to a close. You, now, must place the greatest name, the legacy of the knowledge and the symbols of knowledge of prophet-hood with Ali (a.s.). It is because I do not want to live the earth without having a scholar theirin so that people would learn from him how to obey Me and know through him My guardianship and aauthority. The scholar would be the Divine authority for those who come to be born at a time between the passing away of aone prophet to the appearance of the next prophet. The Imam (a.s.) said, “He (Muhammad (s.a.) bequeathed to him the greatest name, the legacy of the knowledge and the symbols of knowledge of the prophet-hood. He also bequeathed to him a thousand word and a thousand chapter whereby there would open a thousnd chapter and a thousand word from each chapter and each word.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (285/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 764,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:65:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ يَحْيَى بْنِ مُعَمَّرٍ الْعَطَّارِ عَنْ بَشِيرٍ الدَّهَّانِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي مَرَضِهِ الَّذِي تُوُفِّيَ فِيهِ ادْعُوا لِي خَلِيلِي فَأَرْسَلَتَا إِلَى أَبَوَيْهِمَا فَلَمَّا نَظَرَ إِلَيْهِمَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَعْرَضَ عَنْهُمَا ثُمَّ قَالَ ادْعُوا لِي خَلِيلِي فَأُرْسِلَ إِلَى عَلِيٍّ فَلَمَّا نَظَرَ إِلَيْهِ أَكَبَّ عَلَيْهِ يُحَدِّثُهُ ",
          "فَلَمَّا خَرَجَ لَقِيَاهُ فَقَالَا لَهُ مَا حَدَّثَكَ خَلِيلُكَ فَقَالَ حَدَّثَنِي أَلْفَ بَابٍ يَفْتَحُ كُلُّ بَابٍ أَلْفَ بَابٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Salih Bin Al Sindy, from Ja’far Bin Bashir, from Yahya Bin Moammar Al Attar, from Bashir Al Dahhan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said during his<sup>saww</sup> illness in which he<sup>saww</sup> passed away: ‘Call my<sup>saww</sup> friend for me<sup>saww</sup>’. So they both (Ayesha and Hafsa) sent a message to their fathers (Abu Bakr and Umar). So when Rasool-Allah<sup>saww</sup> looked at them, turned away from them. Then he<sup>saww</sup> said: ‘Call my<sup>saww</sup> friend for me<sup>saww</sup>’. So a message was sent to Ali<sup>asws</sup>. So when he<sup>saww</sup> looked at him<sup>asws</sup>, he<sup>saww</sup> got engrossed (engaged) upon it narrating to him<sup>asws</sup>.",
            "So when he<sup>asws</sup> came out, they (Abu Bakr and Umar) met him<sup>asws</sup> and they both said to him<sup>asws</sup>, ‘What did your<sup>asws</sup> friend narrate to you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘He<sup>saww</sup> narrated to me<sup>asws</sup> a thousand topics, with each topic opening a thousand topics’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Ibrahim has narrated from his father and Salih ibn al-Sindi from Ja‘far ibn Bashir from Yahya ibn Ma‘mar al-‘Attar from Bashir al-Dahhan from abu ‘Abdallah (a.s.) who has said the following. “the Messenger of Allah during the illness from which died said, ‘Call my beloved one to come to me.” We sent to call the fathers of the two of them (‘A’isha and hafsa’s fathers). When the Messenger of Allah looked at them he turned away from them. He them said again, “Call my beloved one to come to me.” Ali was then called. When the Messenger of Allah looked at him, he became engrossed talking to him. When Ali left the two met him and asked, “What did your beloved say to you?” He (Ali) replied, “He narrated to me a thousand chapter from each of which a thousand chapter opens.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/287)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 765,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:65:5",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ عَلَّمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلِيّاً ( صلوات الله عليه ) أَلْفَ حَرْفٍ كُلُّ حَرْفٍ يَفْتَحُ أَلْفَ حَرْفٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Muhammad Bin Ismail, from Mansour Bin Yunus, from Abu Bakr Al Hazaramy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> taught Ali<sup>asws</sup> a thousand letters, each letter opening a thousand letters’."
          ],
          "en.sarwar": [
            " 5. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Muhammad ibn Isma’il from Mansur ibn Yunus from abu Bakr al-Hadrami from abu Ja‘far (a.s.) who has said the following. “the Messenger of Allah made Ali (a.s.) learn a thousand letters of which each one opens a thousand letters.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (287/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 766,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:65:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ فِي ذُؤَابَةِ سَيْفِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) صَحِيفَةٌ صَغِيرَةٌ فَقُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَيُّ شَيْ‏ءٍ كَانَ فِي تِلْكَ الصَّحِيفَةِ قَالَ هِيَ الْأَحْرُفُ الَّتِي يَفْتَحُ كُلُّ حَرْفٍ أَلْفَ حَرْفٍ ",
          "قَالَ أَبُو بَصِيرٍ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَمَا خَرَجَ مِنْهَا حَرْفَانِ حَتَّى السَّاعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘In the hilt of the sword of Rasool-Allah<sup>saww</sup> was a small parchment’. So I said to Abu Abdullah<sup>asws</sup>, ‘Which thing was in that Parchment?’ He<sup>asws</sup> said: ‘These were the letters, each letter opening a thousand letters’. ",
            "Abu Baseer said, ‘Abu Abdullah<sup>asws</sup> said: ‘So, no two letters from these would come out until the Hour (Day of Judgment)’."
          ],
          "en.sarwar": [
            " 6. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Ali ibn abu Hamza from abu Basir from au ‘Abdallah (a.s.) who has said the following. “In the hilt of the sword of the the Messenger of Allah there was a small booklet.” The narrator has said that then he asked the Imam (a.s.), “What did that booklet contain?” The Imam (a.s.) said, “It contained the few letters of which each letter opened a thousand letters. Abu Basir has said that abu ‘Abdallah (a.s.) then said, “Until this hour not even two letters have come out (their meanings understood, utilized and practiced).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (287/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 767,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:65:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ فُضَيْلِ بْنِ سُكَّرَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ هَلْ لِلْمَاءِ الَّذِي يُغَسَّلُ بِهِ الْمَيِّتُ حَدٌّ مَحْدُودٌ قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ لِعَلِيٍّ ( عليه السلام ) إِذَا مِتُّ فَاسْتَقِ سِتَّ قِرَبٍ مِنْ مَاءِ بِئْرِ غَرْسٍ فَغَسِّلْنِي وَ كَفِّنِّي وَ حَنِّطْنِي فَإِذَا فَرَغْتَ مِنْ غُسْلِي وَ كَفْنِي فَخُذْ بِجَوَامِعِ كَفَنِي وَ أَجْلِسْنِي ثُمَّ سَلْنِي عَمَّا شِئْتَ فَوَ اللَّهِ لَا تَسْأَلُنِي عَنْ شَيْ‏ءٍ إِلَّا أَجَبْتُكَ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Nasr, from Fuzayl Bin Sukrat who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Is there a restrictive limit for the water which the deceased is washed with?’ He<sup>saww</sup> said: ‘Rasool-Allah<sup>saww</sup> said to Ali<sup>asws</sup>: ‘When I<sup>saww</sup> pass away, so draw six pitchers of water of a well of Ghars, so wash me<sup>saww</sup>, and enshroud me<sup>saww</sup>, and embalm me<sup>saww</sup>. So when you<sup>asws</sup> are free from washing me<sup>saww</sup> and enshrouding me<sup>asws</sup>, so grab me<sup>saww</sup> with the entirety of my<sup>saww</sup> shroud and sit me<sup>saww</sup> up, then ask me<sup>saww</sup> about whatever you<sup>asws</sup> so desire to, for by Allah<sup>azwj</sup>, you<sup>asws</sup> will not ask me<sup>saww</sup> about anything except that I<sup>saww</sup> would answer you<sup>asws</sup> with regards to it’."
          ],
          "en.sarwar": [
            " 7. A number of our people has narrated from Ahmad ibn Muhammad from ibn abu Nasr from Fudayl (ibn) Sukkarah who has said that he said to abu ‘Abdallah (a.s.) the following. “‘May Allah take my soul in service for your cause, is there a certain quantitiyof water required to give Ghusl (bath) a dead person?” The Imam (a.s.) said, “The Messenger of Allah said to Ali (a.s.), ‘When I will die draw six sacks of water from the well Ghars (name of the well). Then wash my body, shroud it and rub camphor on my forehead, palms, knees and toes. When you finish washing my body and shrouding hold by the ends of the shroud and set my body in a sitting posture then ask me whatever you would like. I swear by Allah, you would not ask me anything but that I will give you an answer in it.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/289)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 768,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:65:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنِ ابْنِ أَبِي سَعِيدٍ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا حَضَرَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) الْمَوْتُ دَخَلَ عَلَيْهِ عَلِيٌّ ( عليه السلام ) فَأَدْخَلَ رَأْسَهُ ثُمَّ قَالَ يَا عَلِيُّ إِذَا أَنَا مِتُّ فَغَسِّلْنِي وَ كَفِّنِّي ثُمَّ أَقْعِدْنِي وَ سَلْنِي وَ اكْتُبْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Ibn Abu Saeed, from Aban Bin Taghlub, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the death presented itself to Rasool-Allah<sup>saww</sup>, Ali<sup>asws</sup> came over to him<sup>asws</sup>, so he<sup>saww</sup> entered his<sup>saww</sup> head (to be near to his<sup>asws</sup> head), then said: ‘O Ali<sup>asws</sup>! When I<sup>saww</sup> pass away, so wash me<sup>saww</sup> and enshroud me<sup>saww</sup>, then sit me<sup>saww</sup> up and ask me<sup>saww</sup>, and write down (the answers)’."
          ],
          "en.sarwar": [
            " 8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamza from ibn abu Sa‘id from Aban ibn Taghlib from abu ‘Abdallah (a.s.) who has said the following. “When the Messenger of Allah was about to leave this world Ali (a.s.) came in to see him he (the Messenger of Allah) placed his (Ali’s) head under the blanket and said, “O Ali, when I will die, wash my body and shroud it then place me in a sitting posture then ask me and write down.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (289/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 769,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:65:9",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ شَبَابٍ الصَّيْرَفِيِّ عَنْ يُونُسَ بْنِ رِبَاطٍ قَالَ دَخَلْتُ أَنَا وَ كَامِلٌ التَّمَّارُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ كَامِلٌ جُعِلْتُ فِدَاكَ حَدِيثٌ رَوَاهُ فُلَانٌ فَقَالَ اذْكُرْهُ فَقَالَ حَدَّثَنِي أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) حَدَّثَ عَلِيّاً ( عليه السلام ) بِأَلْفِ بَابٍ يَوْمَ تُوُفِّيَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ بَابٍ يَفْتَحُ أَلْفَ بَابٍ فَذَلِكَ أَلْفُ أَلْفِ بَابٍ ",
          "فَقَالَ لَقَدْ كَانَ ذَلِكَ قُلْتُ جُعِلْتُ فِدَاكَ فَظَهَرَ ذَلِكَ لِشِيعَتِكُمْ وَ مَوَالِيكُمْ فَقَالَ يَا كَامِلُ بَابٌ أَوْ بَابَانِ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ فَمَا يُرْوَى مِنْ فَضْلِكُمْ مِنْ أَلْفِ أَلْفِ بَابٍ إِلَّا بَابٌ أَوْ بَابَانِ ",
          "قَالَ فَقَالَ وَ مَا عَسَيْتُمْ أَنْ تَرْوُوا مِنْ فَضْلِنَا مَا تَرْوُونَ مِنْ فَضْلِنَا إِلَّا أَلْفاً غَيْرَ مَعْطُوفَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, fom Muhammad Bin Al Waleed Shaban Al Sayrafi, from Yunus Bin Rabat who said, ",
            "‘I and Kamil Al-Tammar went over to Abu Abdullah<sup>asws</sup>. So Kamil said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! There is a Hadeeth which so and so reported’. He<sup>asws</sup> said: ‘Mention it’. So he said, ‘It was narrated to me that the Prophet<sup>saww</sup> narrated to Ali<sup>asws</sup> with a thousand topics on the day Rasool-Allah<sup>saww</sup> passed away, each topic opening a thousand topics. So that would be a thousand thousand (a million) topics’. ",
            "So he<sup>asws</sup> said: ‘It had been that’. I said, ‘May I be sacrificed for you<sup>asws</sup>! So, has that been manifested to your<sup>asws</sup> Shias and your<sup>asws</sup> friends?’ So he<sup>asws</sup> said: ‘O Kamil! (Maybe) a topic or two topics’.  So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! So it has not been reported from your<sup>asws</sup> merits from a thousand thousand (a million) topics except for a topic or two topics?’ ",
            "He (the narrator) said, ‘So he<sup>asws</sup> said: ‘And perhaps your reports from our<sup>asws</sup> merits, you have not reported from our merits except for a thousand without being read together’."
          ],
          "en.sarwar": [
            " 9. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn al-Walid, Shabab al-Sayrafi fromYunus ibn Ribat who has said that once he and Kamil al-Tammar went to see abu ‘Abdallah (a.s.). Kamil said to the Imam (a.s.), “‘May Allah take my soul in service for your cause, there is a hadith which so and so son of so and so has narrated.” The Imam (a.s.) said, “Say and read it.” He (Kamil) then said, “He so and so narrated to me that the Holy Prophet narrated a thousand chapter to Ali on the day the Messenger of Allah died. Each of those chapters open a thousand chapter. The total becomes a Million chapter.” The Imam (a.s.) said, “That is how it happened.” I then said, “‘May Allah take my soul in service for your cause, has this become manifest to your followers and those who love you?” The Imam (a.s.) said, “O Kamil, only one or two chapters may have become so.” Kamil has said that the Imam (a.s.) then said, “You perhaps may not be able to narrate all our excellence and virtues. You do not narrate from our excellence and virtue but only a scattered thousand.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:65",
  "kind": "verse_list"
}