{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 66"}, "path": "/books/al-kafi:1:4:66", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى الْحَسَنِ بْنِ عَلِيٍّ ( عليه السلام )", "en": "Chapter 66 – The Indication and the wordings upon Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>"}}], "index": 124, "local_index": 66, "part_type": "Chapter", "path": "/books/al-kafi:1:4:66", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى الْحَسَنِ بْنِ عَلِيٍّ ( عليه السلام )", "en": "Chapter 66 – The Indication and the wordings upon Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>"}, "verse_count": 7, "verse_start_index": 769, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 770, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:66:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ وَ عُمَرَ بْنِ أُذَيْنَةَ عَنْ أَبَانٍ عَنْ سُلَيْمِ بْنِ قَيْسٍ قَالَ شَهِدْتُ وَصِيَّةَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) حِينَ أَوْصَى إِلَى ابْنِهِ الْحَسَنِ ( عليه السلام ) وَ أَشْهَدَ عَلَى وَصِيَّتِهِ الْحُسَيْنَ ( عليه السلام ) وَ مُحَمَّداً وَ جَمِيعَ وُلْدِهِ وَ رُؤَسَاءَ شِيعَتِهِ وَ أَهْلَ بَيْتِهِ ", "ثُمَّ دَفَعَ إِلَيْهِ الْكِتَابَ وَ السِّلَاحَ وَ قَالَ لِابْنِهِ الْحَسَنِ ( عليه السلام ) يَا بُنَيَّ أَمَرَنِي رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ أُوصِيَ إِلَيْكَ وَ أَنْ أَدْفَعَ إِلَيْكَ كُتُبِي وَ سِلَاحِي كَمَا أَوْصَى إِلَيَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ دَفَعَ إِلَيَّ كُتُبَهُ وَ سِلَاحَهُ وَ أَمَرَنِي أَنْ آمُرَكَ إِذَا حَضَرَكَ الْمَوْتُ أَنْ تَدْفَعَهَا إِلَى أَخِيكَ الْحُسَيْنِ ( عليه السلام ) ", "ثُمَّ أَقْبَلَ عَلَى ابْنِهِ الْحُسَيْنِ ( عليه السلام ) فَقَالَ وَ أَمَرَكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ تَدْفَعَهَا إِلَى ابْنِكَ هَذَا ثُمَّ أَخَذَ بِيَدِ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) ثُمَّ قَالَ لِعَلِيِّ بْنِ الْحُسَيْنِ وَ أَمَرَكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ تَدْفَعَهَا إِلَى ابْنِكَ مُحَمَّدِ بْنِ عَلِيٍّ وَ أَقْرِئْهُ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مِنِّي السَّلَامَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar Al Yamani and Umar Bin Azina, from Aban, from Suleym Bin Qays who said, ", "‘I witnessed the bequest of Amir Al-Momineen<sup>asws</sup> when he<sup>asws</sup> bequeathed to his<sup>asws</sup> son<sup>asws</sup> Al-Hassan<sup>asws</sup>, and there bore witness upon his<sup>asws</sup> bequest, Al-Husayn<sup>asws</sup>, and Muhammad, and the entirety of his children, and the chiefs of his<sup>asws</sup> Shias and his<sup>asws</sup> family members. ", "Then he<sup>asws</sup> handed over the Book and the weapons and said to his<sup>asws</sup> son<sup>asws</sup> Al-Hassan<sup>asws</sup>: ‘O my<sup>asws</sup> son! Rasool-Allah<sup>saww</sup> instructed me<sup>asws</sup> that I<sup>asws</sup> bequeath to you<sup>asws</sup>, and that I<sup>asws</sup> hand over to you<sup>asws</sup> my<sup>asws</sup> Books and my<sup>asws</sup> weapons just as Rasool-Allah<sup>saww</sup> had bequeathed to me<sup>asws</sup> and handed over to me<sup>asws</sup> his<sup>saww</sup> Book and his<sup>saww</sup> weapons, and instructed me<sup>asws</sup> that I<sup>asws</sup> instruct you<sup>asws</sup> that when death presents itself, you<sup>asws</sup> should hand over these to your<sup>asws</sup> brother<sup>asws</sup> Al-Husayn<sup>asws</sup>’. ", "Then he<sup>asws</sup> turned towards his<sup>asws</sup> son<sup>asws</sup> Al-Husayn<sup>asws</sup> and he<sup>asws</sup> said: ‘And Rasool-Allah<sup>saww</sup> instructed me<sup>asws</sup> that you<sup>asws</sup> should hand these over to this son<sup>asws</sup> of yours<sup>asws</sup>’, and he<sup>asws</sup> grabbed the hand of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>. Then he<sup>asws</sup> said to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>: ‘And Rasool-Allah<sup>saww</sup> instructed that you<sup>asws</sup> should hand these over to your<sup>asws</sup> son<sup>asws</sup> Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>, and convey to him<sup>asws</sup> the greetings, from Rasool-Allah<sup>saww</sup> and myself<sup>asws</sup>’."]}}, {"index": 771, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:66:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الصَّمَدِ بْنِ بَشِيرٍ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( صلوات الله عليه ) لَمَّا حَضَرَهُ الَّذِي حَضَرَهُ قَالَ لِابْنِهِ الْحَسَنِ ادْنُ مِنِّي حَتَّى أُسِرَّ إِلَيْكَ مَا أَسَرَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَيَّ وَ أَئْتَمِنَكَ عَلَى مَا ائْتَمَنَنِي عَلَيْهِ فَفَعَلَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Samad Bin Bashir, from Abu Al Jaroud, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup>, when there presented to him<sup>asws</sup> that which presented (death), said to his<sup>asws</sup> son<sup>asws</sup> Al-Hassan<sup>asws</sup>: ‘Approach me<sup>asws</sup> until I<sup>asws</sup> divulge a secret to you<sup>asws</sup> what Rasool-Allah<sup>saww</sup> had divulged to me<sup>asws</sup>, and entrust you<sup>asws</sup> upon what he<sup>saww</sup> entrusted me<sup>saww</sup> upon’. So he<sup>asws</sup> did’."]}}, {"index": 772, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:66:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ حَدَّثَنِي الْأَجْلَحُ وَ سَلَمَةُ بْنُ كُهَيْلٍ وَ دَاوُدُ بْنُ أَبِي يَزِيدَ وَ زَيْدٌ الْيَمَامِيُّ قَالُوا حَدَّثَنَا شَهْرُ بْنُ حَوْشَبٍ أَنَّ عَلِيّاً ( عليه السلام ) حِينَ سَارَ إِلَى الْكُوفَةِ اسْتَوْدَعَ أُمَّ سَلَمَةَ كُتُبَهُ وَ الْوَصِيَّةَ فَلَمَّا رَجَعَ الْحَسَنُ ( عليه السلام ) دَفَعَتْهَا إِلَيْهِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Abu Bakr Al Hazamy who said, ‘It was narrated to me by Al Ajlah, and Salma Bin Kuhayl, and Dawood Bin Abu Yazeed Al Yamami who (all) said: ", "‘Shahr Bin Howshab narrated to us that Ali<sup>asws</sup>, when he<sup>asws</sup> went to Al-Kufa, deposited with Umm Salma<sup>as</sup> his<sup>asws</sup> Books and the bequest. So when Al-Hassan<sup>asws</sup> returned (to Al-Medina), she<sup>as</sup> handed over these to him<sup>asws</sup>’."]}}, {"index": 773, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:66:4", "text": ["وَ فِي نُسْخَةِ الصَّفْوَانِيِّ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفٍ عَنْ أَبِي بَكْرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ عَلِيّاً صَلَوَاتُ اللَّهِ عَلَيْهِ حِينَ سَارَ إِلَى الْكُوفَةِ اسْتَوْدَعَ أُمَّ سَلَمَةَ كُتُبَهُ وَ الْوَصِيَّةَ فَلَمَّا رَجَعَ الْحَسَنُ دَفَعَتْهَا إِلَيْهِ ."], "translations": {"en.hubeali": ["And in a copy of Al Safwany – Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf, from Abu Bakr, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Ali<sup>asws</sup>, when he<sup>asws</sup> went to Al-Kufa, deposited with Umm Salma<sup>as</sup>, his<sup>asws</sup> Books and the bequest. So when Al-Hassan<sup>asws</sup> returned (to Al-Medina), she<sup>as</sup> handed these over to him<sup>asws</sup>’."]}}, {"index": 774, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:66:5", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَوْصَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِلَى الْحَسَنِ وَ أَشْهَدَ عَلَى وَصِيَّتِهِ الْحُسَيْنَ ( عليه السلام ) وَ مُحَمَّداً وَ جَمِيعَ وُلْدِهِ وَ رُؤَسَاءَ شِيعَتِهِ وَ أَهْلَ بَيْتِهِ ثُمَّ دَفَعَ إِلَيْهِ الْكِتَابَ وَ السِّلَاحَ ", "ثُمَّ قَالَ لِابْنِهِ الْحَسَنِ يَا بُنَيَّ أَمَرَنِي رَسُولُ اللَّهِ أَنْ أُوصِيَ إِلَيْكَ وَ أَنْ أَدْفَعَ إِلَيْكَ كُتُبِي وَ سِلَاحِي كَمَا أَوْصَى إِلَيَّ رَسُولُ اللَّهِ وَ دَفَعَ إِلَيَّ كُتُبَهُ وَ سِلَاحَهُ وَ أَمَرَنِي أَنْ آمُرَكَ إِذَا حَضَرَكَ الْمَوْتُ أَنْ تَدْفَعَهُ إِلَى أَخِيكَ الْحُسَيْنِ ", "ثُمَّ أَقْبَلَ عَلَى ابْنِهِ الْحُسَيْنِ وَ قَالَ أَمَرَكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ تَدْفَعَهُ إِلَى ابْنِكَ هَذَا ثُمَّ أَخَذَ بِيَدِ ابْنِ ابْنِهِ عَلِيِّ بْنِ الْحُسَيْنِ ", "ثُمَّ قَالَ لِعَلِيِّ بْنِ الْحُسَيْنِ يَا بُنَيَّ وَ أَمَرَكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ تَدْفَعَهُ إِلَى ابْنِكَ مُحَمَّدِ بْنِ عَلِيٍّ وَ أَقْرِئْهُ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مِنِّي السَّلَامَ ", "ثُمَّ أَقْبَلَ عَلَى ابْنِهِ الْحَسَنِ فَقَالَ يَا بُنَيَّ أَنْتَ وَلِيُّ الْأَمْرِ وَ وَلِيُّ الدَّمِ فَإِنْ عَفَوْتَ فَلَكَ وَ إِنْ قَتَلْتَ فَضَرْبَةٌ مَكَانَ ضَرْبَةٍ وَ لَا تَأْثَمْ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Hammad Bin Isa, from Amro Bin Shimr, from Jabir, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> bequeathed to Al-Hassan<sup>asws</sup>, and there bore witness upon his<sup>asws</sup> bequest, Al-Husayn<sup>asws</sup>, and Muhammad, and the entirety of his<sup>asws</sup> children, and the chiefs of his<sup>asws</sup> Shias, and his<sup>asws</sup> family members. ", "Then he<sup>asws</sup> handed over to him<sup>asws</sup> the Book and the weapons, then said to his<sup>asws</sup> son<sup>asws</sup> Al-Hassan<sup>asws</sup>: ‘O my<sup>asws</sup> son<sup>asws</sup>! Rasool-Allah<sup>saww</sup> instructed me<sup>asws</sup> that I<sup>asws</sup> should instruct you<sup>asws</sup> when the death presents itself, that you<sup>asws</sup> should hand it over to your<sup>asws</sup> brother<sup>asws</sup> Al-Husayn<sup>asws</sup>’. ", "Then he<sup style=\"font-weight: normal\">asws</sup> turned towards his<sup style=\"font-weight: normal\">asws</sup> son<sup style=\"font-weight: normal\">asws</sup> Al-Husayn<sup style=\"font-weight: normal\">asws</sup> and said: ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> instructed you<sup style=\"font-weight: normal\">asws</sup> that you<sup style=\"font-weight: normal\">asws</sup> should hand it over to this son<sup style=\"font-weight: normal\">asws</sup> of yours<sup style=\"font-weight: normal\">asws</sup> Ali<sup style=\"font-weight: normal\">asws</sup> Bin Al-Husayn<sup style=\"font-weight: normal\">asws</sup>’. ", "Then he<sup style=\"font-weight: normal\">asws</sup> said to Ali<sup style=\"font-weight: normal\">asws</sup> Bin Al-Husayn<sup style=\"font-weight: normal\">asws</sup>: ‘O my<sup style=\"font-weight: normal\">asws</sup> son<sup style=\"font-weight: normal\">asws</sup>! And Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> instructed you<sup style=\"font-weight: normal\">asws</sup> that you<sup style=\"font-weight: normal\">asws</sup> should hand it over to your<sup style=\"font-weight: normal\">asws</sup> son<sup style=\"font-weight: normal\">asws</sup> Muhammad<sup style=\"font-weight: normal\">asws</sup> Bin Ali<sup style=\"font-weight: normal\">asws</sup>, and convey from Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> and from me<sup style=\"font-weight: normal\">asws</sup>, the greetings’. ", "Then he<sup style=\"font-weight: normal\">asws</sup> turned towards his<sup style=\"font-weight: normal\">asws</sup> son Al-Hassan<sup style=\"font-weight: normal\">asws</sup>, so he<sup style=\"font-weight: normal\">asws</sup> said: ‘O my<sup style=\"font-weight: normal\">asws</sup> son<sup style=\"font-weight: normal\">asws</sup>! You<sup style=\"font-weight: normal\">asws</sup> are the Master of the Command (<span class=\"iTxt\">Wali Al-Amr</span>) and Guardian of the blood (avenging me<sup style=\"font-weight: normal\">asws</sup>). So if you<sup style=\"font-weight: normal\">asws</sup> were to forgive, so it is for you<sup style=\"font-weight: normal\">asws</sup>, and if you<sup style=\"font-weight: normal\">asws</sup> were to kill (Ibn Al-Muljim), so a strike in place of a strike, and you<sup style=\"font-weight: normal\">asws</sup> would not be overdoing’."]}}, {"index": 775, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:66:6", "text": ["الْحُسَيْنُ بْنُ الْحَسَنِ الْحَسَنِيُّ رَفَعَهُ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِيِّ رَفَعَهُ قَالَ لَمَّا ضُرِبَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) حَفَّ بِهِ الْعُوَّادُ وَ قِيلَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ أَوْصِ فَقَالَ اثْنُوا لِي وِسَادَةً ثُمَّ قَالَ الْحَمْدُ لِلَّهِ حَقَّ قَدْرِهِ مُتَّبِعِينَ أَمْرَهُ وَ أَحْمَدُهُ كَمَا أَحَبَّ وَ لَا إِلَهَ إِلَّا اللَّهُ الْوَاحِدُ الْأَحَدُ الصَّمَدُ كَمَا انْتَسَبَ", "أَيُّهَا النَّاسُ كُلُّ امْرِئٍ لَاقٍ فِي فِرَارِهِ مَا مِنْهُ يَفِرُّ وَ الْأَجَلُ مَسَاقُ النَّفْسِ إِلَيْهِ وَ الْهَرَبَ مِنْهُ مُوَافَاتُهُ كَمْ أَطْرَدْتُ الْأَيَّامَ أَبْحَثُهَا عَنْ مَكْنُونِ هَذَا الْأَمْرِ فَأَبَى اللَّهُ عَزَّ ذِكْرُهُ إِلَّا إِخْفَاءَهُ هَيْهَاتَ عِلْمٌ مَكْنُونٌ", "أَمَّا وَصِيَّتِي فَأَنْ لَا تُشْرِكُوا بِاللَّهِ جَلَّ ثَنَاؤُهُ شَيْئاً وَ مُحَمَّداً ( صلى الله عليه وآله ) فَلَا تُضَيِّعُوا سُنَّتَهُ أَقِيمُوا هَذَيْنِ الْعَمُودَيْنِ وَ أَوْقِدُوا هَذَيْنِ الْمِصْبَاحَيْنِ وَ خَلَاكُمْ ذَمٌّ مَا لَمْ تَشْرُدُوا حُمِّلَ كُلُّ امْرِئٍ مَجْهُودَهُ وَ خُفِّفَ عَنِ الْجَهَلَةِ رَبٌّ رَحِيمٌ وَ إِمَامٌ عَلِيمٌ وَ دِينٌ قَوِيمٌ", "أَنَا بِالْأَمْسِ صَاحِبُكُمْ وَ أَنَا الْيَوْمَ عِبْرَةٌ لَكُمْ وَ غَداً مُفَارِقُكُمْ إِنْ تَثْبُتِ الْوَطْأَةُ فِي هَذِهِ الْمَزَلَّةِ فَذَاكَ الْمُرَادُ وَ إِنْ تَدْحَضِ الْقَدَمُ فَإِنَّا كُنَّا فِي أَفْيَاءِ أَغْصَانٍ وَ ذَرَى رِيَاحٍ وَ تَحْتَ ظِلِّ غَمَامَةٍ اضْمَحَلَّ فِي الْجَوِّ مُتَلَفِّقُهَا وَ عَفَا فِي الْأَرْضِ مَحَطُّهَا ", "وَ إِنَّمَا كُنْتُ جَاراً جَاوَرَكُمْ بَدَنِي أَيَّاماً وَ سَتُعْقَبُونَ مِنِّي جُثَّةً خَلَاءً سَاكِنَةً بَعْدَ حَرَكَةٍ وَ كَاظِمَةً بَعْدَ نُطْقٍ لِيَعِظَكُمْ هُدُوِّي وَ خُفُوتُ إِطْرَاقِي وَ سُكُونُ أَطْرَافِي فَإِنَّهُ أَوْعَظُ لَكُمْ مِنَ النَّاطِقِ الْبَلِيغِ وَدَّعْتُكُمْ وَدَاعَ مُرْصِدٍ لِلتَّلَاقِي غَداً تَرَوْنَ أَيَّامِي وَ يَكْشِفُ اللَّهُ عَزَّ وَ جَلَّ عَنْ سَرَائِرِي وَ تَعْرِفُونِّي بَعْدَ خُلُوِّ مَكَانِي وَ قِيَامِ غَيْرِي مَقَامِي", "إِنْ أَبْقَ فَأَنَا وَلِيُّ دَمِي وَ إِنْ أَفْنَ فَالْفَنَاءُ مِيعَادِي وَ إِنْ أَعْفُ فَالْعَفْوُ لِي قُرْبَةٌ وَ لَكُمْ حَسَنَةٌ فَاعْفُوا وَ اصْفَحُوا أَ لَا تُحِبُّونَ أَنْ يَغْفِرَ اللَّهُ لَكُمْ فَيَا لَهَا حَسْرَةً عَلَى كُلِّ ذِي غَفْلَةٍ أَنْ يَكُونَ عُمُرُهُ عَلَيْهِ حُجَّةً أَوْ تُؤَدِّيَهُ أَيَّامُهُ إِلَى شِقْوَةٍ ", "جَعَلَنَا اللَّهُ وَ إِيَّاكُمْ مِمَّنْ لَا يَقْصُرُ بِهِ عَنْ طَاعَةِ اللَّهِ رَغْبَةٌ أَوْ تَحُلُّ بِهِ بَعْدَ الْمَوْتِ نَقِمَةٌ فَإِنَّمَا نَحْنُ لَهُ وَ بِهِ ", "ثُمَّ أَقْبَلَ عَلَى الْحَسَنِ ( عليه السلام ) فَقَالَ يَا بُنَيَّ ضَرْبَةً مَكَانَ ضَرْبَةٍ وَ لَا تَأْثَمْ ."], "translations": {"en.hubeali": ["Al Husayn Bin Al Hassan, raising it, and Muhammad Bin Al Hassan, from Ibrahim Bin Is’haq Al Ahmary, raising it, said, ", "‘When Amir Al-Momineen<sup>asws</sup> was struck, the visitors encircled him<sup>asws</sup> and it was said to him<sup>asws</sup>, ‘O Amir Al-Momineen<sup>asws</sup>! Bequeath!’ So he<sup>asws</sup> said: ‘Double the pillow for me<sup>asws</sup>’. Then he<sup>asws</sup> said: ‘The Praise is for Allah<sup>azwj</sup> as He<sup>azwj</sup> is rightful of. I<sup>asws</sup> was obedient to His<sup>azwj</sup> Commands, and I<sup>asws</sup> Praise Him<sup>azwj</sup> just as He<sup>azwj</sup> Loves, and there is no god except for Allah<sup>azwj</sup>, the One, the First, the Samad, just as He<sup>azwj</sup> has Lineaged Himself<sup>azwj</sup>. ", "O you people! Every person would meet during his fleeing, what he is fleeing from (i.e., death). The death is an usher of the soul towards it, and the escaping from it is to (actually) find it. How many days have come and gone in researching about the hidden of this matter, but Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, Refused except to Keep it hidden. Far be it, for the hidden to be known! ", "As for my<sup>asws</sup> bequest, so it is that you shall not associate anything with Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Laudation. And Muhammad<sup>saww</sup>, so you must not waste his<sup>saww</sup> Sunnah. Establish these two pillars and inflame these two lanterns, and you will be free of blame for as long as you are not displaced. Every person would bear his effort, and it is lightened from the ignorant ones. The Lord<sup>azwj</sup> is Merciful, and the Imam<sup>asws</sup> is the most knowledgeable, and the Religion is straight. ", "Yesterday I<sup>asws</sup> was your companion, and today I<sup>asws</sup> am a lesson for you all, and tomorrow I<sup>asws</sup> shall part from you. If the treading is steadfast during these stumbles, so that is the objective, and if the feet waver, so we are living in the shade of the branches and shelter of the winds, and beneath the shade of the clouds dissipating in the atmosphere and the disappearing resources in the central ground.", "And rather, I<sup>asws</sup> was a neighbour. My<sup>asws</sup> body was your neighbour for (some) days, and as a consequence from me<sup>asws</sup> it would be an empty body, motionless after its movement, and silent after speaking. Let it be an admonishment, my<sup>asws</sup> silence, and the dimming of my<sup>asws</sup> eyes, and the stillness of my<sup>asws</sup> limbs. So it is more of a preacher for you all than the eloquent speaker. And my<sup>asws</sup> bidding farewell to you all is a farewell of one expecting the reunion. Tomorrow you shall be seeing (the reality of) my<sup>asws</sup> days, and Allah<sup>azwj</sup> Mighty and Majestic will Uncover my<sup>asws</sup> secrets from me<sup>asws</sup>, and you will be recognising me<sup>asws</sup> after the emptiness of my<sup>asws</sup> place, and the standing of someone else in my<sup>asws</sup> place.", "If I<sup style=\"font-weight: normal\">asws</sup> were to remain (alive), I<sup style=\"font-weight: normal\">asws</sup> would be the Guardian of my<sup style=\"font-weight: normal\">asws</sup> own blood, and if I<sup style=\"font-weight: normal\">asws</sup> perish, so the perishing is my<sup style=\"font-weight: normal\">asws</sup> destiny, and if I<sup style=\"font-weight: normal\">asws</sup> were to forgive, so the forgiving, for me<sup style=\"font-weight: normal\">asws</sup> it is a nearness (to Allah<sup style=\"font-weight: normal\">azwj</sup>, and for you it is a good deed, therefore be forgiving and overlooking. Would you not like it Allah<sup style=\"font-weight: normal\">azwj</sup> should be Forigivng you all? What a regret it would be upon every neglectful one! His own life-time would become an argument against him, or his days would lead him to misery.", "May Allah<sup style=\"font-weight: normal\">azwj</sup> Make us<sup style=\"font-weight: normal\">asws</sup> and you all from the ones who are not deficient with it from obeying Allah<sup style=\"font-weight: normal\">azwj</sup> out of desire or being terrified of the Punishment after the death. So rather, we are for Him<sup style=\"font-weight: normal\">azwj</sup> and with Him<sup style=\"font-weight: normal\">azwj</sup>’. ", "Then he<sup style=\"font-weight: normal\">asws</sup> turned towards Al-Hassan<sup style=\"font-weight: normal\">asws</sup>, and he<sup style=\"font-weight: normal\">asws</sup> said: ‘O my<sup style=\"font-weight: normal\">asws</sup> son<sup style=\"font-weight: normal\">asws</sup>! A strike in place of a strike, and you<sup style=\"font-weight: normal\">asws</sup> will not be overdoing it’."]}}, {"index": 776, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:66:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ عَلِيِّ بْنِ إِبْرَاهِيمَ الْعَقِيلِيِّ يَرْفَعُهُ قَالَ قَالَ لَمَّا ضَرَبَ ابْنُ مُلْجَمٍ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ لِلْحَسَنِ يَا بُنَيَّ إِذَا أَنَا مِتُّ فَاقْتُلِ ابْنَ مُلْجَمٍ وَ احْفِرْ لَهُ فِي الْكُنَاسَةِ وَ وَصَفَ الْعَقِيلِيُّ الْمَوْضِعَ عَلَى بَابِ طَاقِ الْمَحَامِلِ مَوْضِعُ الشُّوَّاءِ وَ الرُّؤَّاسِ ثُمَّ ارْمِ بِهِ فِيهِ فَإِنَّهُ وَادٍ مِنْ أَوْدِيَةِ جَهَنَّمَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ali Bin Al Hassan, from Ali Bin Ibrahim Al Aqeyli, raising it, said, ", "‘When Ibn Muljim<sup>la</sup> struck Amir Al-Momineen<sup>asws</sup>, he<sup>asws</sup> said to Al-Hassan<sup>asws</sup>: ‘O my<sup>asws</sup> son<sup>asws</sup>! When I<sup>asws</sup> pass away, so kill Ibn Muljim<sup>la</sup> and dig a grave for him<sup>la</sup> among the sweepings (rubbish dump)’, and Aqeyli (the narrator) described the place as being at the gate of Taaq Al-Mahamil, a place of barbequing the heads (of animals), ‘then throw him<sup>la</sup> into it, for it is a valley from the valleys of Hell’."]}}]}, "index": "al-kafi:1:4:66", "kind": "verse_list"}