{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 67"}, "path": "/books/al-kafi:1:4:67", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام )", "en": "Chapter 67 – The Indication and the wordings upon Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup>"}}], "index": 125, "local_index": 67, "part_type": "Chapter", "path": "/books/al-kafi:1:4:67", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام )", "en": "Chapter 67 – The Indication and the wordings upon Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup>"}, "verse_count": 3, "verse_start_index": 776, "verses": [{"index": 777, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:67:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ بَكْرِ بْنِ صَالِحٍ قَالَ الْكُلَيْنِيُّ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنِ ابْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ عَنْ هَارُونَ بْنِ الْجَهْمِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ لَمَّا حَضَرَ الْحَسَنَ بْنَ عَلِيٍّ ( عليه السلام ) الْوَفَاةُ قَالَ لِلْحُسَيْنِ ( عليه السلام ) يَا أَخِي إِنِّي أُوصِيكَ بِوَصِيَّةٍ فَاحْفَظْهَا إِذَا أَنَا مِتُّ فَهَيِّئْنِي ثُمَّ وَجِّهْنِي إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لِأُحْدِثَ بِهِ عَهْداً ثُمَّ اصْرِفْنِي إِلَى أُمِّي ( عليها السلام ) ثُمَّ رُدَّنِي فَادْفِنِّي بِالْبَقِيعِ وَ اعْلَمْ أَنَّهُ سَيُصِيبُنِي مِنْ عَائِشَةَ مَا يَعْلَمُ اللَّهُ وَ النَّاسُ صَنِيعُهَا وَ عَدَاوَتُهَا لِلَّهِ وَ لِرَسُولِهِ وَ عَدَاوَتُهَا لَنَا أَهْلَ الْبَيْتِ \nفَلَمَّا قُبِضَ الْحَسَنُ ( عليه السلام ) وَ وُضِعَ عَلَى السَّرِيرِ ثُمَّ انْطَلَقُوا بِهِ إِلَى مُصَلَّى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الَّذِي كَانَ يُصَلِّي فِيهِ عَلَى الْجَنَائِزِ فَصَلَّى عَلَيْهِ الْحُسَيْنُ ( عليه السلام ) وَ حُمِلَ وَ أُدْخِلَ إِلَى الْمَسْجِدِ فَلَمَّا أُوقِفَ عَلَى قَبْرِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ذَهَبَ ذُو الْعُوَيْنَيْنِ إِلَى عَائِشَةَ فَقَالَ لَهَا إِنَّهُمْ قَدْ أَقْبَلُوا بِالْحَسَنِ لِيَدْفِنُوا مَعَ النَّبِيِّ ( صلى الله عليه وآله )\nفَخَرَجَتْ مُبَادِرَةً عَلَى بَغْلٍ بِسَرْجٍ فَكَانَتْ أَوَّلَ امْرَأَةٍ رَكِبَتْ فِي الْإِسْلَامِ سَرْجاً فَقَالَتْ نَحُّوا ابْنَكُمْ عَنْ بَيْتِي فَإِنَّهُ لَا يُدْفَنُ فِي بَيْتِي وَ يُهْتَكُ عَلَى رَسُولِ اللَّهِ حِجَابُهُ فَقَالَ لَهَا الْحُسَيْنُ ( عليه السلام ) قَدِيماً هَتَكْتِ أَنْتِ وَ أَبُوكِ حِجَابَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَدْخَلْتِ عَلَيْهِ بَيْتَهُ مَنْ لَا يُحِبُّ قُرْبَهُ وَ إِنَّ اللَّهَ سَائِلُكِ عَنْ ذَلِكِ يَا عَائِشَةُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Bakr Bin Salih who said, ‘Al Kulayni and a number of our companions, from Ibn Ziyad, from Muhammad Bin Suleyman Al Dalaymi, from Haroun Bin Al Jahm, from Muhammad Bin Muslim who said, \n‘I heard Abu Ja’far<sup>asws</sup> saying: ‘When the death presented itself to Al-Hassan Bin Ali<sup>asws</sup>, he<sup>asws</sup> said to Al-Husayn<sup>asws</sup>: ‘O my<sup>asws</sup> brother<sup>asws</sup>! I<sup>asws</sup> am bequeathing to you<sup>asws</sup> with a bequest, therefore preserve. When I<sup>asws</sup> pass away, so prepare me<sup>asws</sup>, then divert me<sup>asws</sup> towards Rasool-Allah<sup>saww</sup> so I<sup>asws</sup> renew my<sup>asws</sup> Covenant with him<sup>saww</sup>. Then divert me<sup>asws</sup> towards my<sup>asws</sup> mother<sup>asws</sup>, then return me<sup>asws</sup> and bury me at Al-Baqi’e (Cemetery), and know that there would be difficulties for me<sup>asws</sup> from Ayesha what Allah<sup>azwj</sup> and the people know of her enmity to Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and her enmity towards us<sup>asws</sup>, the People<sup>asws</sup> of the Household’. \nSo when Al-Hassan<sup>asws</sup> passed away and was placed upon the bed, then they went with him<sup>asws</sup> to the Praying place of Rasool-Allah<sup>saww</sup> where he<sup>saww</sup> used to Pray <span class=\"iTxt\">Salat</span> in, so Al-Husayn<sup>asws</sup> prayed <span class=\"iTxt\">Salat</span> over him<sup>asws</sup>, and he<sup>asws</sup> was carried and entered into the Masjid. So when he<sup>asws</sup> was brought to the grave of Rasool-Allah<sup>saww</sup>, the two-eyed one (spy) went to Ayesha and he said to her, ‘They have come with Al-Hassan<sup>asws</sup> in order to bury him<sup>asws</sup> along with the Prophet<sup>saww</sup>’. \nSo she came out in a rush upon a mule with a saddle. Thus, she was the first woman to have ridden a saddle in Al-Islam. So she said, ‘Move your son away from my house, for he will not be buried in my house and be a violation upon Rasool-Allah<sup>saww</sup> of his<sup>saww</sup> privacy!’ So Al-Husayn<sup>asws</sup> said to her: ‘From a long time you and your father have violated the privacy of Rasool-Allah<sup>saww</sup>, and you entered upon him<sup>saww</sup> in his<sup>saww</sup> house the ones he<sup>saww</sup> did not like, and Allah<sup>azwj</sup> will Ask you about that, O Ayesha!’."}]}, {"index": 778, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:67:2", "text": "مُحَمَّدُ بْنُ الْحَسَنِ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ عَنْ بَعْضِ أَصْحَابِنَا عَنِ الْمُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا حَضَرَتِ الْحَسَنَ بْنَ عَلِيٍّ ( عليه السلام ) الْوَفَاةُ قَالَ يَا قَنْبَرُ انْظُرْ هَلْ تَرَى مِنْ وَرَاءِ بَابِكَ مُؤْمِناً مِنْ غَيْرِ آلِ مُحَمَّدٍ ( عليه السلام ) فَقَالَ اللَّهُ تَعَالَى وَ رَسُولُهُ وَ ابْنُ رَسُولِهِ أَعْلَمُ بِهِ مِنِّي قَالَ ادْعُ لِي مُحَمَّدَ بْنَ عَلِيٍّ \nفَأَتَيْتُهُ فَلَمَّا دَخَلْتُ عَلَيْهِ قَالَ هَلْ حَدَثَ إِلَّا خَيْرٌ قُلْتُ أَجِبْ أَبَا مُحَمَّدٍ فَعَجَّلَ عَلَى شِسْعِ نَعْلِهِ فَلَمْ يُسَوِّهِ وَ خَرَجَ مَعِي يَعْدُو فَلَمَّا قَامَ بَيْنَ يَدَيْهِ سَلَّمَ فَقَالَ لَهُ الْحَسَنُ بْنُ عَلِيٍّ ( عليه السلام ) اجْلِسْ فَإِنَّهُ لَيْسَ مِثْلُكَ يَغِيبُ عَنْ سَمَاعِ كَلَامٍ يَحْيَا بِهِ الْأَمْوَاتُ وَ يَمُوتُ بِهِ الْأَحْيَاءُ كُونُوا أَوْعِيَةَ الْعِلْمِ وَ مَصَابِيحَ الْهُدَى فَإِنَّ ضَوْءَ النَّهَارِ بَعْضُهُ أَضْوَأُ مِنْ بَعْضٍ\nأَ مَا عَلِمْتَ أَنَّ اللَّهَ جَعَلَ وُلْدَ إِبْرَاهِيمَ ( عليه السلام ) أَئِمَّةً وَ فَضَّلَ بَعْضَهُمْ عَلَى بَعْضٍ وَ آتَى دَاوُدَ ( عليه السلام ) زَبُوراً وَ قَدْ عَلِمْتَ بِمَا اسْتَأْثَرَ بِهِ مُحَمَّداً ( صلى الله عليه وآله ) يَا مُحَمَّدَ بْنَ عَلِيٍّ إِنِّي أَخَافُ عَلَيْكَ الْحَسَدَ وَ إِنَّمَا وَصَفَ اللَّهُ بِهِ الْكَافِرِينَ فَقَالَ اللَّهُ عَزَّ وَ جَلَّ كُفَّاراً حَسَداً مِنْ عِنْدِ أَنْفُسِهِمْ مِنْ بَعْدِ ما تَبَيَّنَ لَهُمُ الْحَقُّ وَ لَمْ يَجْعَلِ اللَّهُ عَزَّ وَ جَلَّ لِلشَّيْطَانِ عَلَيْكَ سُلْطَاناً \nيَا مُحَمَّدَ بْنَ عَلِيٍّ أَ لَا أُخْبِرُكَ بِمَا سَمِعْتُ مِنْ أَبِيكَ فِيكَ قَالَ بَلَى قَالَ سَمِعْتُ أَبَاكَ ( عليه السلام ) يَقُولُ يَوْمَ الْبَصْرَةِ مَنْ أَحَبَّ أَنْ يَبَرَّنِي فِي الدُّنْيَا وَ الْآخِرَةِ فَلْيَبَرَّ مُحَمَّداً وَلَدِي\nيَا مُحَمَّدَ بْنَ عَلِيٍّ لَوْ شِئْتُ أَنْ أُخْبِرَكَ وَ أَنْتَ نُطْفَةٌ فِي ظَهْرِ أَبِيكَ لَأَخْبَرْتُكَ\nيَا مُحَمَّدَ بْنَ عَلِيٍّ أَ مَا عَلِمْتَ أَنَّ الْحُسَيْنَ بْنَ عَلِيٍّ ( عليه السلام ) بَعْدَ وَفَاةِ نَفْسِي وَ مُفَارَقَةِ رُوحِي جِسْمِي إِمَامٌ مِنْ بَعْدِي وَ عِنْدَ اللَّهِ جَلَّ اسْمُهُ فِي الْكِتَابِ وِرَاثَةً مِنَ النَّبِيِّ ( صلى الله عليه وآله ) أَضَافَهَا اللَّهُ عَزَّ وَ جَلَّ لَهُ فِي وِرَاثَةِ أَبِيهِ وَ أُمِّهِ فَعَلِمَ اللَّهُ أَنَّكُمْ خِيَرَةُ خَلْقِهِ فَاصْطَفَى مِنْكُمْ مُحَمَّداً ( صلى الله عليه وآله ) وَ اخْتَارَ مُحَمَّدٌ عَلِيّاً ( عليه السلام ) وَ اخْتَارَنِي عَلِيٌّ ( عليه السلام ) بِالْإِمَامَةِ وَ اخْتَرْتُ أَنَا الْحُسَيْنَ ( عليه السلام ) \nفَقَالَ لَهُ مُحَمَّدُ بْنُ عَلِيٍّ أَنْتَ إِمَامٌ وَ أَنْتَ وَسِيلَتِي إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) وَ اللَّهِ لَوَدِدْتُ أَنَّ نَفْسِي ذَهَبَتْ قَبْلَ أَنْ أَسْمَعَ مِنْكَ هَذَا الْكَلَامَ أَلَا وَ إِنَّ فِي رَأْسِي كَلَاماً لَا تَنْزِفُهُ الدِّلَاءُ وَ لَا تُغَيِّرُهُ نَغْمَةُ الرِّيَاحِ كَالْكِتَابِ الْمُعْجَمِ فِي الرَّقِّ الْمُنَمْنَمِ أَهُمُّ بِإِبْدَائِهِ فَأَجِدُنِي سُبِقْتُ إِلَيْهِ سَبَقَ الْكِتَابُ الْمُنْزَلُ أَوْ مَا جَاءَتْ بِهِ الرُّسُلُ وَ إِنَّهُ لَكَلَامٌ يَكِلُّ بِهِ لِسَانُ النَّاطِقِ وَ يَدُ الْكَاتِبِ حَتَّى لَا يَجِدَ قَلَماً وَ يُؤْتَوْا بِالْقِرْطَاسِ حُمَماً فَلَا يَبْلُغُ إِلَى فَضْلِكَ وَ كَذَلِكَ يَجْزِي اللَّهُ الْمُحْسِنِينَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ \nالْحُسَيْنُ أَعْلَمُنَا عِلْماً وَ أَثْقَلُنَا حِلْماً وَ أَقْرَبُنَا مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) رَحِماً كَانَ فَقِيهاً قَبْلَ أَنْ يُخْلَقَ وَ قَرَأَ الْوَحْيَ قَبْلَ أَنْ يَنْطِقَ وَ لَوْ عَلِمَ اللَّهُ فِي أَحَدٍ خَيْراً مَا اصْطَفَى مُحَمَّداً ( صلى الله عليه وآله ) فَلَمَّا اخْتَارَ اللَّهُ مُحَمَّداً وَ اخْتَارَ مُحَمَّدٌ عَلِيّاً وَ اخْتَارَكَ عَلِيٌّ إِمَاماً وَ اخْتَرْتَ الْحُسَيْنَ سَلَّمْنَا وَ رَضِينَا مَنْ هُوَ بِغَيْرِهِ يَرْضَى وَ مَنْ غَيْرُهُ كُنَّا نَسْلَمُ بِهِ مِنْ مُشْكِلَاتِ أَمْرِنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Al Hassan and Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Suleyman Al Dalaymi, from some of our companions, from Al Mufazzal Bin Umar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the death presented itself to Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>, he<sup>asws</sup> said: ‘O Qanbar! Look around. Can you see from behind your door a Momin from other than the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>?’ So he said, ‘Allah<sup>azwj</sup> the Exalted, and His<sup>azwj</sup> Rasool<sup>saww</sup> are more knowing with it than I am’. He<sup>asws</sup> said: ‘Muhammad son of Ali<sup>asws</sup> for me’. \nSo I (Qanbar) went over to him. So when I entered upon him, he said, ‘Has anything happened except good?’ I said, ‘Respond to (the call of) Abu Muhammad<sup>asws</sup> (Al-Hassan<sup>asws</sup>!’ So he hastened upon wearing his shoes, and he did not even bother to even them, and went out with me running. So when he stood in front of him<sup>asws</sup>, he greeted. So Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> said to him: ‘Be seated, for it isn’t for the likes of you to be absent from hearing a speech the dead can be revived with and the living can be caused to die with. Become a retaining listener of the Knowledge and lanterns of Guidance, for the illumination of the day, part of it is more illuminating than (its other) part. \nDo you not know that Allah<sup>azwj</sup> Made the children of Ibrahim<sup>as</sup> to be Imams and Merited some of them over the others, and Gave the Psalms to Dawood<sup>as</sup>? And you know what He<sup>azwj</sup> Preferred Muhammad<sup>saww</sup> with. O Muhammad son of Ali<sup>asws</sup>! I<sup>asws</sup> fear upon you of the envy, and rather Allah<sup>azwj</sup> has Described the Infidels with it, so Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[2:109] unbelievers after your faith, out of envy from themselves, (even) after the truth has become Manifest to them</span>, and Allah<sup>azwj</sup> Mighty and Majestic will not Make for the Satan<sup>la</sup> an authority upon you.\nO Muhammad son of Ali<sup>asws</sup>! Shall I<sup>asws</sup> inform you with what I<sup>asws</sup> heard from your father<sup>asws</sup> with regards to you?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘I<sup>asws</sup> heard your father<sup>asws</sup> saying on the day of Basra (Battle of the Camel): ‘The one who loved to be good to me<sup>asws</sup> in the world and the Hereafter, so let him be good to Muhammad, my<sup>asws</sup> son’. \nO Muhammad son of Ali<sup>asws</sup>! If you so desire, I<sup>asws</sup> can inform you (about yourself) while you were (a seed) in the forehead of your father!\nO Muhammad son of Ali<sup>asws</sup>! Do you not know that Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup>, after my<sup>asws</sup> passing away and the departure of my<sup>asws</sup> soul from my<sup>asws</sup> body, would be the Imam<sup>asws</sup> from after me<sup>asws</sup>, and in the Presence of Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Name in the Book, as an inheritance from the Prophet<sup>saww</sup>? Allah<sup>azwj</sup> Mighty and Majestic Chose it to be for him<sup>asws</sup> in the inheritance of his<sup>asws</sup> father<sup>asws</sup> and his<sup>asws</sup> mother<sup>asws</sup>. So Allah<sup>azwj</sup> Knew that he<sup>asws</sup> is the best of His<sup>azwj</sup> creatures, there He<sup>azwj</sup> Chose Muhammad<sup>saww</sup> from you all, and Muhammad<sup>saww</sup> chose Ali<sup>asws</sup>, and Ali<sup>asws</sup> chose me<sup>asws</sup> with the Imamate, and I<sup>asws</sup> hereby choose Al-Husayn<sup>asws</sup>’. \nSo Muhammad son of Ali<sup>asws</sup> said to him<sup>asws</sup>, ‘You<sup>asws</sup> are an Imam<sup>asws</sup>, and you<sup>asws</sup> are my Means to Muhammad<sup>saww</sup>. By Allah<sup>azwj</sup>! I would have loved myself to have gone (died) before I heard this speech from you<sup>asws</sup>. Indeed, and in my head there are (so many) words that neither can the buckets drain them nor can the songs of winds change them. These are like the book, the lexicon, in the decorated pages. I am thinking of initiating it, so I find that I have been preceded to it by the preceding Revealed Books or what the Rasools<sup>as</sup> came with. And it is a speech which exhausts the tongues from speaking with it and the hands to write these. I cannot find pens and these would turn the papers to ashes. Thus, one cannot reach to your<sup>asws</sup> merits, and that is how Allah<sup>azwj</sup> Recompenses the good doers, and there is no Strength except with Allah<sup>azwj</sup>. \nAl-Husayn<sup>asws</sup> is our most knowledgeable one<sup>asws</sup>, and our heaviest one<sup>asws</sup> in forbearance, and our closest one<sup>asws</sup> from Rasool-Allah<sup>saww</sup> in mercy. He<sup>asws</sup> was an understanding one before he<sup>asws</sup> was Created, and read the Revelation before he<sup>asws</sup> spoke, and had Allah<sup>azwj</sup> Known goodness in anyone (else) He<sup>azwj</sup> would not have Chosen Muhammad<sup>saww</sup>. So when Allah<sup>azwj</sup> Chose Muhammad<sup>saww</sup>, and Muhammad<sup>saww</sup> chose Ali<sup>asws</sup> as an Imam<sup>asws</sup>, and you<sup>asws</sup> chose Al-Husayn<sup>asws</sup>. We submit and we are pleased. Who is he who would be please with other than him<sup>asws</sup>? And who, apart from him<sup>asws</sup>, can we be safe with from the difficulties of our affairs?’"}]}, {"index": 779, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:67:3", "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ سَهْلٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ هَارُونَ بْنِ الْجَهْمِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ لَمَّا احْتُضِرَ الْحَسَنُ بْنُ عَلِيٍّ ( عليه السلام ) قَالَ لِلْحُسَيْنِ يَا أَخِي إِنِّي أُوصِيكَ بِوَصِيَّةٍ فَاحْفَظْهَا فَإِذَا أَنَا مِتُّ فَهَيِّئْنِي ثُمَّ وَجِّهْنِي إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لِأُحْدِثَ بِهِ عَهْداً ثُمَّ اصْرِفْنِي إِلَى أُمِّي فَاطِمَةَ ( عليها السلام )ثُمَّ رُدَّنِي فَادْفِنِّي بِالْبَقِيعِ وَ اعْلَمْ أَنَّهُ سَيُصِيبُنِي مِنَ الْحُمَيْرَاءِ مَا يَعْلَمُ النَّاسُ مِنْ صَنِيعِهَا وَ عَدَاوَتِهَا لِلَّهِ وَ لِرَسُولِهِ ( صلى الله عليه وآله ) وَ عَدَاوَتِهَا لَنَا أَهْلَ الْبَيْتِ\nفَلَمَّا قُبِضَ الْحَسَنُ ( عليه السلام ) وَ وُضِعَ عَلَى سَرِيرِهِ فَانْطَلَقُوا بِهِ إِلَى مُصَلَّى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الَّذِي كَانَ يُصَلِّي فِيهِ عَلَى الْجَنَائِزِ فَصَلَّى عَلَى الْحَسَنِ ( عليه السلام ) فَلَمَّا أَنْ صَلَّى عَلَيْهِ حُمِلَ فَأُدْخِلَ الْمَسْجِدَ فَلَمَّا أُوقِفَ عَلَى قَبْرِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بَلَغَ عَائِشَةَ الْخَبَرُ وَ قِيلَ لَهَا إِنَّهُمْ قَدْ أَقْبَلُوا بِالْحَسَنِ بْنِ عَلِيٍّ لِيُدْفَنَ مَعَ رَسُولِ اللَّهِ\nفَخَرَجَتْ مُبَادِرَةً عَلَى بَغْلٍ بِسَرْجٍ فَكَانَتْ أَوَّلَ امْرَأَةٍ رَكِبَتْ فِي الْإِسْلَامِ سَرْجاً فَوَقَفَتْ وَ قَالَتْ نَحُّوا ابْنَكُمْ عَنْ بَيْتِي فَإِنَّهُ لَا يُدْفَنُ فِيهِ شَيْ‏ءٌ وَ لَا يُهْتَكُ عَلَى رَسُولِ اللَّهِ حِجَابُهُ فَقَالَ لَهَا الْحُسَيْنُ بْنُ عَلِيٍّ صَلَوَاتُ اللَّهِ عَلَيْهِمَا قَدِيماً هَتَكْتِ أَنْتِ وَ أَبُوكِ حِجَابَ رَسُولِ اللَّهِ وَ أَدْخَلْتِ بَيْتَهُ مَنْ لَا يُحِبُّ رَسُولُ اللَّهِ قُرْبَهُ وَ إِنَّ اللَّهَ سَائِلُكِ عَنْ ذَلِكِ يَا عَائِشَةُ\nإِنَّ أَخِي أَمَرَنِي أَنْ أُقَرِّبَهُ مِنْ أَبِيهِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لِيُحْدِثَ بِهِ عَهْداً وَ اعْلَمِي أَنَّ أَخِي أَعْلَمُ النَّاسِ بِاللَّهِ وَ رَسُولِهِ وَ أَعْلَمُ بِتَأْوِيلِ كِتَابِهِ مِنْ أَنْ يَهْتِكَ عَلَى رَسُولِ اللَّهِ سِتْرَهُ لِأَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ يا أَيُّهَا الَّذِينَ آمَنُوا لا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ وَ قَدْ أَدْخَلْتِ أَنْتِ بَيْتَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الرِّجَالَ بِغَيْرِ إِذْنِهِ\nوَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ يا أَيُّهَا الَّذِينَ آمَنُوا لا تَرْفَعُوا أَصْواتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَ لَعَمْرِي لَقَدْ ضَرَبْتِ أَنْتِ لِأَبِيكِ وَ فَارُوقِهِ عِنْدَ أُذُنِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الْمَعَاوِلَ\nوَ قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ الَّذِينَ يَغُضُّونَ أَصْواتَهُمْ عِنْدَ رَسُولِ اللَّهِ أُولئِكَ الَّذِينَ امْتَحَنَ اللَّهُ قُلُوبَهُمْ لِلتَّقْوى وَ لَعَمْرِي لَقَدْ أَدْخَلَ أَبُوكِ وَ فَارُوقُهُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بِقُرْبِهِمَا مِنْهُ الْأَذَى وَ مَا رَعَيَا مِنْ حَقِّهِ مَا أَمَرَهُمَا اللَّهُ بِهِ عَلَى لِسَانِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِنَّ اللَّهَ حَرَّمَ مِنَ الْمُؤْمِنِينَ أَمْوَاتاً مَا حَرَّمَ مِنْهُمْ أَحْيَاءً \nوَ تَاللَّهِ يَا عَائِشَةُ لَوْ كَانَ هَذَا الَّذِي كَرِهْتِيهِ مِنْ دَفْنِ الْحَسَنِ عِنْدَ أَبِيهِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) جَائِزاً فِيمَا بَيْنَنَا وَ بَيْنَ اللَّهِ لَعَلِمْتِ أَنَّهُ سَيُدْفَنُ وَ إِنْ رَغِمَ مَعْطِسُكِ \nقَالَ ثُمَّ تَكَلَّمَ مُحَمَّدُ بْنُ الْحَنَفِيَّةِ وَ قَالَ يَا عَائِشَةُ يَوْماً عَلَى بَغْلٍ وَ يَوْماً عَلَى جَمَلٍ فَمَا تَمْلِكِينَ نَفْسَكِ وَ لَا تَمْلِكِينَ الْأَرْضَ عَدَاوَةً لِبَنِي هَاشِمٍ قَالَ فَأَقْبَلَتْ عَلَيْهِ فَقَالَتْ يَا ابْنَ الْحَنَفِيَّةِ هَؤُلَاءِ الْفَوَاطِمُ يَتَكَلَّمُونَ فَمَا كَلَامُكَ\nفَقَالَ لَهَا الْحُسَيْنُ ( عليه السلام ) وَ أَنَّى تُبْعِدِينَ مُحَمَّداً مِنَ الْفَوَاطِمِ فَوَ اللَّهِ لَقَدْ وَلَدَتْهُ ثَلَاثُ فَوَاطِمَ فَاطِمَةُ بِنْتُ عِمْرَانَ بْنِ عَائِذِ بْنِ عَمْرِو بْنِ مَخْزُومٍ وَ فَاطِمَةُ بِنْتُ أَسَدِ بْنِ هَاشِمٍ وَ فَاطِمَةُ بِنْتُ زَائِدَةَ بْنِ الْأَصَمِّ ابْنِ رَوَاحَةَ بْنِ حِجْرِ بْنِ عَبْدِ مَعِيصِ بْنِ عَامِرٍ\nقَالَ فَقَالَتْ عَائِشَةُ لِلْحُسَيْنِ ( عليه السلام ) نَحُّوا ابْنَكُمْ وَ اذْهَبُوا بِهِ فَإِنَّكُمْ قَوْمٌ خَصِمُونَ قَالَ فَمَضَى الْحُسَيْنُ ( عليه السلام ) إِلَى قَبْرِ أُمِّهِ ثُمَّ أَخْرَجَهُ فَدَفَنَهُ بِالْبَقِيعِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by the chain from Sahl, from Muhammad Bin Suleyman, from Haroun Bin Al Jahm, from Muhammad Bin Muslim who said, \n‘I heard Abu Ja’far<sup>asws</sup> saying: ‘When death presented itself to Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>, he<sup>asws</sup> said to Al-Husayn<sup>asws</sup>: ‘O my<sup>asws</sup> brother<sup>asws</sup>! I<sup>asws</sup> am bequeathing to you<sup>asws</sup> with a bequest, therefore preserve it. So when I<sup>asws</sup> pass away, prepare me<sup>asws</sup>, then divert me<sup>asws</sup> towards Rasool-Allah<sup>saww</sup> in order to renew a Covenant with him<sup>saww</sup>. Then divert me<sup>asws</sup> towards my<sup>asws</sup> mother<sup>asws</sup> Syeda Fatima<sup>asws</sup>. Then return me<sup>asws</sup>, and bury me<sup>asws</sup> at Al-Baqi’e (Cemetery), and know that there would be difficulties for me<sup>asws</sup> from Al-Humeyra (Ayesha), what the people know from her actions and her enmity to Allah<sup>azwj</sup> and to His<sup>azwj</sup> Rasool<sup>saww</sup> and her animosity towards us<sup>asws</sup>, the People<sup>asws</sup> of the Household’. \nSo when Al-Hassan<sup>asws</sup> passed away and was placed upon his<sup>asws</sup> bed, so they went with him<sup>asws</sup> to the praying place of Rasool-Allah<sup>saww</sup> which he<sup>saww</sup> used to pray <span class=\"iTxt\">Salat</span> in, upon the deceased. So he<sup>asws</sup> prayed <span class=\"iTxt\">Salat</span> upon Al-Hassan<sup>asws</sup>. So when he<sup>asws</sup> had been Prayed <span class=\"iTxt\">Salat</span> upon, he<sup>asws</sup> was carried and entered into the Masjid. So when he<sup>asws</sup> came to be upon the grave of Rasool-Allah<sup>saww</sup>, the news reached Al-Ayesah, and it was said to her, ‘They have come with Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> in order to bury him<sup>asws</sup> along with Rasool-Allah<sup>saww</sup>’.  \nSo she came out rushing upon a saddled mule. Thus, she was the first woman in Al-Islam to have ridden a saddle. So she paused and said, ‘Move away your son from my house, for nothing would be buried in it, nor will the privacy be violated upon Rasool-Allah<sup>saww</sup>!’ So Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> said to her: ‘For a long time, you and your father violated the privacy of Rasool-Allah<sup>saww</sup> and entered into his<sup>saww</sup> house the one whose nearness Rasool-Allah<sup>saww</sup> did not like, and Allah<sup>azwj</sup> will be Asking you about that, O Ayesha! \nMy<sup>asws</sup> brother<sup>asws</sup> instructed me<sup>asws</sup> that I<sup>asws</sup> bring him<sup>asws</sup> to be closer to his<sup>asws</sup> (grand) father Rasool-Allah<sup>saww</sup>, in order to renew a Covenant with him<sup>saww</sup>, and I<sup>asws</sup> know that my<sup>asws</sup> brother<sup>asws</sup> is the most knowledgeable of the people with Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and is most knowledgeable with the explanation of His<sup>azwj</sup> Book, that for him<sup>asws</sup> to violate upon Rasool-Allah<sup>saww</sup> of his<sup>saww</sup> privacy, because Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\">[33:53] O you who believe! Do not enter the houses of the Prophet unless permission is given to you</span>, and you entered certain men into the house of Rasool-Allah<sup>saww</sup> without his<sup>saww</sup> permission. \nAnd Allah<sup>azwj</sup> Mighty and Majestic had Said <span class=\"ibTxt\">[49:2] O you who believe! Do not raise your voices above the voice of the Prophet</span>. By my<sup>asws</sup> life! You and your father (Abu Bakr) and his Farouq (Umar) had struck a pickaxe near to the ears of Rasool-Allah<sup>saww</sup>. \nAnd Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[49:3] Surely those who lower their voices in the presence Rasool-Allah, they are the ones whose hearts Allah has Tested for piety</span>. By my<sup>asws</sup> life! Your father (Abu Bakr) and his Farouq (Umar), due to their being buried nearby, is harming to Rasool-Allah<sup>azwj</sup>, and they never respected his<sup>saww</sup> rights whatever Allah<sup>azwj</sup> had Commanded them both with, upon the tongue of Rasool-Allah<sup>saww</sup>, that Allah<sup>azwj</sup> has Prohibited the living <span class=\"iTxt\">Momineen</span> from the same as what Allah<sup>azwj</sup> has Prohibited from those who have passed away.\nAnd I<sup>asws</sup> swear by Allah<sup>azwj</sup>, O Ayesha! If it was such that this which you are disliking, from the burial of Al-Hassan<sup>asws</sup> by his<sup>asws</sup> (grand) father Rasool-Allah<sup>saww</sup>, was allowed, in what is between us<sup>asws</sup> and Allah<sup>azwj</sup>, you would have known that he<sup>asws</sup> would be buried, and even if it would rub your nose (break your pride)’. \nHe (Abu Ja’far<sup>asws</sup>) said: ‘Then Muhammad Bin Al-Hanafiyya spoke and he said, ‘O Ayesha! One day you are upon a mule, and one day you were upon a camel (Battle of Al-Basra), so you are not in control of yourself, nor do you own the earth out of enmity to the Clan of Hashim<sup>as</sup>’. So she turned towards him and she said, ‘O ibn Hanafiyya! They<sup>asws</sup> are Fatimids (sons of Fatima<sup>asws</sup>), so what is your speech for?’ \nSo Al-Husayn<sup>asws</sup> said to her: ‘And in what way are you distancing Muhammad from the Fatimids? By Allah<sup>azwj</sup>! Three Fatimas have given birth to him – Fatima Bint Imran Bin Aiz Bin Amro Bin Makhzum; and Fatima Bint Asad Bin Hashim<sup>as</sup>; and Fatima Bint Zaida Bin Al Asammi Ibn Rawahat Bin Hijr Bin Abdul Maees Bin Aamir’.  \nHe (Abu Ja’far<sup>asws</sup>) said: ‘So Ayesha said to Al-Husayn<sup>asws</sup>, ‘Move away your son and go away with him<sup>asws</sup>, for you all are a disputing people’. So Al-Husayn<sup>asws</sup> went to the grave of his<sup>asws</sup> mother<sup>asws</sup>, then brought him<sup>asws</sup> out, and buried him<sup>asws</sup> at Al-Baqi’e’."}]}]}, "index": "al-kafi:1:4:67", "kind": "verse_list"}