{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 68"}, "path": "/books/al-kafi:1:4:68", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْإِشَارَةِ</span> وَ النَّصِّ عَلَى عَلِيِّ بْنِ الْحُسَيْنِ صَلَوَاتُ اللَّهِ عَلَيْهِمَا", "en": "Chapter 68 – The Indication and the wordings upon Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>"}}], "index": 126, "local_index": 68, "part_type": "Chapter", "path": "/books/al-kafi:1:4:68", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْإِشَارَةِ</span> وَ النَّصِّ عَلَى عَلِيِّ بْنِ الْحُسَيْنِ صَلَوَاتُ اللَّهِ عَلَيْهِمَا", "en": "Chapter 68 – The Indication and the wordings upon Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>"}, "verse_count": 4, "verse_start_index": 779, "verses": [{"index": 780, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:68:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ وَ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الْحُسَيْنَ بْنَ عَلِيٍّ ( عليه السلام ) لَمَّا حَضَرَهُ الَّذِي حَضَرَهُ دَعَا ابْنَتَهُ الْكُبْرَى فَاطِمَةَ بِنْتَ الْحُسَيْنِ ( عليه السلام ) فَدَفَعَ إِلَيْهَا كِتَاباً مَلْفُوفاً وَ وَصِيَّةً ظَاهِرَةً وَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) مَبْطُوناً مَعَهُمْ لَا يَرَوْنَ إِلَّا أَنَّهُ لِمَا بِهِ فَدَفَعَتْ فَاطِمَةُ الْكِتَابَ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) ثُمَّ صَارَ وَ اللَّهِ ذَلِكَ الْكِتَابُ إِلَيْنَا يَا زِيَادُ \nقَالَ قُلْتُ مَا فِي ذَلِكَ الْكِتَابِ جَعَلَنِيَ اللَّهُ فِدَاكَ قَالَ فِيهِ وَ اللَّهِ مَا يَحْتَاجُ إِلَيْهِ وُلْدُ آدَمَ مُنْذُ خَلَقَ اللَّهُ آدَمَ إِلَى أَنْ تَفْنَى الدُّنْيَا وَ اللَّهِ إِنَّ فِيهِ الْحُدُودَ حَتَّى أَنَّ فِيهِ أَرْشَ الْخَدْشِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn and Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Mansour Bin Yunus, from Abu Al Jaroud, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup>, when it presented to him<sup>asws</sup> what which presented (death), called his<sup>asws</sup> eldest daughter Syeda Fatima<sup>asws</sup> Bint Al-Husayn<sup>asws</sup>, and he<sup>asws</sup> handed over the wrapped Book and the apparent bequest. And it was so that Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was with a stomach illness. The ones with him<sup>asws</sup> were not seeing except that he<sup>asws</sup> was with it. So Syeda Fatima<sup>as</sup> handed over the Book to Ali<sup>asws</sup> Bin Al Husayn<sup>asws</sup>, then, by Allah<sup>azwj</sup>, that Book came to be to us<sup>asws</sup>, O Zayd’. \nHe (the narrator) said, ‘I said, ‘What is in that Book? May I be sacrificed for you<sup>asws</sup>’. He<sup>asws</sup> said: ‘Therein, by Allah<sup>azwj</sup>, is whatever the Children of Adam<sup>as</sup> would be needy to, since Allah<sup>azwj</sup> Created Adam<sup>as</sup> up to the annihilation of the world. By Allah<sup>azwj</sup>! In it are the legal punishments, to the extent that in it is the compensation of the scratch’."}]}, {"index": 781, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:68:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا حَضَرَ الْحُسَيْنَ ( عليه السلام ) مَا حَضَرَهُ دَفَعَ وَصِيَّتَهُ إِلَى ابْنَتِهِ فَاطِمَةَ ظَاهِرَةً فِي كِتَابٍ مُدْرَجٍ فَلَمَّا أَنْ كَانَ مِنْ أَمْرِ الْحُسَيْنِ ( عليه السلام ) مَا كَانَ دَفَعَتْ ذَلِكَ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) \nقُلْتُ لَهُ فَمَا فِيهِ يَرْحَمُكَ اللَّهُ فَقَالَ مَا يَحْتَاجُ إِلَيْهِ وُلْدُ آدَمَ مُنْذُ كَانَتِ الدُّنْيَا إِلَى أَنْ تَفْنَى .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Ibn Sinan, from Abu Al Jaroud, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When it presented to Al-Husayn<sup>asws</sup> what presents (death), he<sup>asws</sup> handed over his<sup>asws</sup> bequest to his<sup>asws</sup> daughter Syeda Fatima<sup>as</sup> apparently, in a sealed Book. So when it was from the matter of Al-Husayn<sup>asws</sup> what was (martyrdom at Karbala 61 AH), he<sup>asws</sup> handed that over to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>’. \nI said to him<sup style=\"font-weight: normal\">asws</sup>, ‘So what is in it? May Allah<sup style=\"font-weight: normal\">azwj</sup> have Mercy on you<sup style=\"font-weight: normal\">asws</sup>!’. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Whatever the children of Adam<sup style=\"font-weight: normal\">saww</sup> would be needy to, since the world existed up to its annihilation’."}]}, {"index": 782, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:68:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْحُسَيْنَ صَلَوَاتُ اللَّهِ عَلَيْهِ لَمَّا صَارَ إِلَى الْعِرَاقِ اسْتَوْدَعَ أُمَّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا الْكُتُبَ وَ الْوَصِيَّةَ فَلَمَّا رَجَعَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) دَفَعَتْهَا إِلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Abu Bakr Al Hazramy, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Al-Husayn<sup>asws</sup>, when he<sup>asws</sup> went to Al-Iraq, deposited with Umm Salma<sup>as</sup>, the Book and the bequest. So when Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> returned (to Al-Medina), she<sup>as</sup> handed it over to him<sup>asws</sup>’."}]}, {"index": 783, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:68:4", "text": "وَ فِي نُسْخَةِ الصَّفْوَانِيِّ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ فُلَيْحِ بْنِ أَبِي بَكْرٍ الشَّيْبَانِيِّ قَالَ وَ اللَّهِ إِنِّي لَجَالِسٌ عِنْدَ عَلِيِّ بْنِ الْحُسَيْنِ وَ عِنْدَهُ وُلْدُهُ إِذْ جَاءَهُ جَابِرُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ فَسَلَّمَ عَلَيْهِ ثُمَّ أَخَذَ بِيَدِ أَبِي جَعْفَرٍ ( عليه السلام ) فَخَلَا بِهِ فَقَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَخْبَرَنِي أَنِّي سَأُدْرِكُ رَجُلًا مِنْ أَهْلِ بَيْتِهِ يُقَالُ لَهُ مُحَمَّدُ بْنُ عَلِيٍّ يُكَنَّى أَبَا جَعْفَرٍ فَإِذَا أَدْرَكْتَهُ فَأَقْرِئْهُ مِنِّي السَّلَامَ\nقَالَ وَ مَضَى جَابِرٌ وَ رَجَعَ أَبُو جَعْفَرٍ ( عليه السلام ) فَجَلَسَ مَعَ أَبِيهِ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَ إِخْوَتِهِ فَلَمَّا صَلَّى الْمَغْرِبَ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَيَّ شَيْ‏ءٍ قَالَ لَكَ جَابِرُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ فَقَالَ قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ إِنَّكَ سَتُدْرِكُ رَجُلًا مِنْ أَهْلِ بَيْتِيَ اسْمُهُ مُحَمَّدُ بْنُ عَلِيٍّ يُكَنَّى أَبَا جَعْفَرٍ فَأَقْرِئْهُ مِنِّي السَّلَامَ \nفَقَالَ لَهُ أَبُوهُ هَنِيئاً لَكَ يَا بُنَيَّ مَا خَصَّكَ اللَّهُ بِهِ مِنْ رَسُولِهِ مِنْ بَيْنِ أَهْلِ بَيْتِكَ لَا تُطْلِعْ إِخْوَتَكَ عَلَى هَذَا فَيَكِيدُوا لَكَ كَيْداً كَمَا كَادُوا إِخْوَةُ يُوسُفَ لِيُوسُفَ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "And in a copy of Al Safwany – Ali Bin Ibrahim, from his father, from Hanan Bin Sadeyr, from Fuleyh Bin Abu Bakr Al Shaybani who said, \n‘By Allah<sup>azwj</sup>! I was seated in the presence of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and in his<sup>asws</sup> presence were his<sup>asws</sup> children, when Jabir Bin Abdullah Al-Ansary came over. So he Greeted upon him<sup>asws</sup>, then he grabbed the hand of Abu Ja’far<sup>asws</sup> and isolated himself with him<sup>asws</sup>, and he said, ‘Rasool-Allah<sup>saww</sup> informed me that I will be coming across a man from the People<sup>asws</sup> of his<sup>saww</sup> Household called Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>. His<sup>asws</sup> teknonym would be Abu Ja’far<sup>asws</sup>. (He<sup>saww</sup> said): ‘So when you come across him<sup>asws</sup>, so convey the greetings from me<sup>saww</sup>’. \nHe (the narrator) said, ‘And Jabir went away and Abu Ja’far<sup>asws</sup> returned. So he<sup>asws</sup> sat with his<sup>asws</sup> father<sup>asws</sup> Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> and his<sup>asws</sup> brothers. So when he<sup>asws</sup> prayed the Maghrib <span class=\"iTxt\">Salat</span>, Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to Abu Ja’far<sup>asws</sup>: ‘Which thing did Jabir Bin Abdullah Al-Ansay say to you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘He said that Rasool-Allah<sup>saww</sup> said: ‘You will be coming across a man from the People<sup>asws</sup> of my<sup>saww</sup> Household. His<sup>asws</sup> name is Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>. His<sup>asws</sup> teknonym is Abu Ja’far<sup>asws</sup>. Therefore, convey the greetings from me<sup>saww</sup>’. \nSo his<sup>asws</sup> father<sup>asws</sup> said to him<sup>asws</sup>: ‘Congratulations to you<sup>asws</sup>, O my<sup>asws</sup> son<sup>asws</sup>! What Allah<sup>azwj</sup> has Specialised you<sup>asws</sup> with from His<sup>azwj</sup> Rasool<sup>saww</sup>, from between your<sup>asws</sup> family members, do not notify your<sup>asws</sup> brothers upon this, for they would plot against you<sup>asws</sup> with a plotting just as the brothers of Yusuf<sup>as</sup> plotted against Yusuf<sup>as</sup>’."}]}]}, "index": "al-kafi:1:4:68", "kind": "verse_list"}