{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 69"}, "path": "/books/al-kafi:1:4:69", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي جَعْفَرٍ ( عليه السلام )", "en": "Chapter 69 – The Indication and the wordings upon Abu Ja’far<sup>asws</sup>"}}], "index": 127, "local_index": 69, "part_type": "Chapter", "path": "/books/al-kafi:1:4:69", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي جَعْفَرٍ ( عليه السلام )", "en": "Chapter 69 – The Indication and the wordings upon Abu Ja’far<sup>asws</sup>"}, "verse_count": 4, "verse_start_index": 783, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 784, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:69:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ إِدْرِيسَ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ أَبِي الْقَاسِمِ الْكُوفِيِّ عَنْ مُحَمَّدِ بْنِ سَهْلٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا حَضَرَ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) الْوَفَاةُ قَبْلَ ذَلِكَ أَخْرَجَ سَفَطاً أَوْ صُنْدُوقاً عِنْدَهُ فَقَالَ يَا مُحَمَّدُ احْمِلْ هَذَا الصُّنْدُوقَ ", "قَالَ فَحَمَلَ بَيْنَ أَرْبَعَةٍ فَلَمَّا تُوُفِّيَ جَاءَ إِخْوَتُهُ يَدَّعُونَ مَا فِي الصُّنْدُوقِ فَقَالُوا أَعْطِنَا نَصِيبَنَا فِي الصُّنْدُوقِ فَقَالَ وَ اللَّهِ مَا لَكُمْ فِيهِ شَيْ‏ءٌ وَ لَوْ كَانَ لَكُمْ فِيهِ شَيْ‏ءٌ مَا دَفَعَهُ إِلَيَّ وَ كَانَ فِي الصُّنْدُوقِ سِلَاحُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ كُتُبُهُ ."], "translations": {"en.hubeali": ["Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Abu Al Qasim Al Kufy, from Muhammad Bin Sahl, from Ibrahim Bin Abu Al Balad, ", "(It has been narrated) from Ismail Bin Muhammad Bin Abdullah, son of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, from Abu Ja’far<sup>asws</sup> having said: ‘When the death presented itself to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, before that, he<sup>asws</sup> brought out a basket or a box which was with him<sup>asws</sup>, and he<sup>asws</sup> said: ‘O Muhammad<sup>asws</sup>! Carry away this box!’ ", "He (the narrator) said: ‘So he<sup>asws</sup> carried it between four (help of four people). So when he (Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>) passed away, his<sup>asws</sup> brothers came over claiming whatever was in the box, and they said, ‘Give us our share in the box’. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! There is no share for you all in it, and had there been a share for you all in it, it would not have been handed over to me<sup>asws</sup>’. And in the box were the weapons of Rasool-Allah<sup>saww</sup> and his<sup>saww</sup> Books’."]}}, {"index": 785, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:69:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ عِمْرَانَ بْنِ مُوسَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ الْتَفَتَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) إِلَى وُلْدِهِ وَ هُوَ فِي الْمَوْتِ وَ هُمْ مُجْتَمِعُونَ عِنْدَهُ ثُمَّ الْتَفَتَ إِلَى مُحَمَّدِ بْنِ عَلِيٍّ فَقَالَ يَا مُحَمَّدُ هَذَا الصُّنْدُوقُ اذْهَبْ بِهِ إِلَى بَيْتِكَ", "قَالَ أَمَا إِنَّهُ لَمْ يَكُنْ فِيهِ دِينَارٌ وَ لَا دِرْهَمٌ وَ لَكِنْ كَانَ مَمْلُوءاً عِلْماً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Imran Bin Musa, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah, from Isa Bin Abdullah, from his father, from his grandfather who said, ", "‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> turned around to his<sup>asws</sup> children, and he<sup>asws</sup> was during the (pangs of) death, and they had gathered in his<sup>asws</sup> presence. Then he<sup>asws</sup> turned towards Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> and he<sup>asws</sup> said: ‘O Muhammad<sup>asws</sup>! This box, go with it to your<sup>asws</sup> house’. ", "He (the narrator) said, ‘But there neither happened to be any Dinars in it nor Dirhams, but it was filled with knowledge’."]}}, {"index": 786, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:69:3", "text": ["مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ كَتَبَ إِلَى ابْنِ حَزْمٍ أَنْ يُرْسِلَ إِلَيْهِ بِصَدَقَةِ عَلِيٍّ وَ عُمَرَ وَ عُثْمَانَ وَ إِنَّ ابْنَ حَزْمٍ بَعَثَ إِلَى زَيْدِ بْنِ الْحَسَنِ وَ كَانَ أَكْبَرَهُمْ فَسَأَلَهُ الصَّدَقَةَ فَقَالَ زَيْدٌ إِنَّ الْوَالِيَ كَانَ بَعْدَ عَلِيٍّ الْحَسَنَ وَ بَعْدَ الْحَسَنِ الْحُسَيْنَ وَ بَعْدَ الْحُسَيْنِ عَلِيَّ بْنَ الْحُسَيْنِ وَ بَعْدَ عَلِيِّ بْنِ الْحُسَيْنِ مُحَمَّدَ بْنَ عَلِيٍّ فَابْعَثْ إِلَيْهِ ", "فَبَعَثَ ابْنُ حَزْمٍ إِلَى أَبِي فَأَرْسَلَنِي أَبِي بِالْكِتَابِ إِلَيْهِ حَتَّى دَفَعْتُهُ إِلَى ابْنِ حَزْمٍ فَقَالَ لَهُ بَعْضُنَا يَعْرِفُ هَذَا وُلْدُ الْحَسَنِ قَالَ نَعَمْ كَمَا يَعْرِفُونَ أَنَّ هَذَا لَيْلٌ وَ لَكِنَّهُمْ يَحْمِلُهُمُ الْحَسَدُ وَ لَوْ طَلَبُوا الْحَقَّ بِالْحَقِّ لَكَانَ خَيْراً لَهُمْ وَ لَكِنَّهُمْ يَطْلُبُونَ الدُّنْيَا ."], "translations": {"en.hubeali": ["Muhammad Bin Al Hassan, from Sahl, from Muhammad Bin Isa, from Fazalat Bin Ayoub, from Al Husayn Bin Abu Al A’ala, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Umar Bin Abdul Aziz (the governor) wrote to Ibn Hazim (the judge) that he should send to him the charity donations record of Ali<sup>asws</sup>, and Umar and Usman. And Ibn Hazim (the judge) sent for Zayd son of Al-Hassan<sup>asws</sup>, and he was their eldest, and he asked him of the charity. So Zayd said, ‘The Guardian after Ali<sup>asws</sup> was Al-Hassan<sup>asws</sup>, and after Al-Hassan<sup>asws</sup>, it was Al-Husayn<sup>asws</sup>, and after Al-Husayn<sup>asws</sup> it was Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and after Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> it was Muhammad<sup>asws</sup> Bin Ali<sup>azwj</sup>. Therefore, send (a messenger) to him<sup>asws</sup>. ", "So Ibn Hazim (the judge) sent (a messenger) to my<sup>asws</sup> father<sup>asws</sup>. So my<sup>asws</sup> father<sup>asws</sup> sent me<sup>asws</sup> with the Book to him until I<sup>asws</sup> handed it over to him’. So one of us said to him<sup>asws</sup>, ‘Did the sons of Al-Hassan<sup>asws</sup> know this?’ He<sup>asws</sup> said: ‘Yes, just as they were knowing that this is a night, but, the envy carried them, and had they sought the Truth with the Truth, it would have been better for them, but they are seeking the world’."]}}, {"index": 787, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:69:4", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ كَتَبَ إِلَى ابْنِ حَزْمٍ ثُمَّ ذَكَرَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ بَعَثَ ابْنُ حَزْمٍ إِلَى زَيْدِ بْنِ الْحَسَنِ وَ كَانَ أَكْبَرَ مِنْ أَبِي ( عليه السلام ) .", "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ مِثْلَهُ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin uhammad, from Al Hassan Bin Ali Al Washa, from Abdul Kareem Bin Amro, from Ibn Abu Yafour who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Umar Bin Abdul Aziz (the governor) wrote to Ibn Hazim (the judge)’, then he mentioned similar to it, except that he<sup>asws</sup> said, ‘Ibn Hazim sent for Zayd son of Al-Hassan<sup>asws</sup>, and he was older than my<sup>asws</sup> father<sup>asws</sup>’’. ", "<span style=\"font-size: small\">A number of our companions, from Ahmad Bin Muhammad, from Al Washha </span>- similar to it."]}}]}, "index": "al-kafi:1:4:69", "kind": "verse_list"}