{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 69"
        },
        "path": "/books/al-kafi:1:4:69",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي جَعْفَرٍ ( عليه السلام )",
          "en": "Chapter 69 – The Indication and the wordings upon Abu Ja’far<sup>asws</sup>"
        }
      }
    ],
    "index": 127,
    "local_index": 69,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 70"
        },
        "path": "/books/al-kafi:1:4:70",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي عَبْدِ اللَّهِ جَعْفَرِ بْنِ مُحَمَّدٍ الصَّادِقِ صَلَوَاتُ اللَّهِ عَلَيْهِمَا",
          "en": "Chapter 70 – The Indication and the wordings upon Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad Al-Sadiq<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 68"
        },
        "path": "/books/al-kafi:1:4:68",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْإِشَارَةِ</span> وَ النَّصِّ عَلَى عَلِيِّ بْنِ الْحُسَيْنِ صَلَوَاتُ اللَّهِ عَلَيْهِمَا",
          "en": "Chapter 68 – The Indication and the wordings upon Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:69",
    "titles": {
      "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي جَعْفَرٍ ( عليه السلام )",
      "en": "Chapter 69 – The Indication and the wordings upon Abu Ja’far<sup>asws</sup>"
    },
    "verse_count": 4,
    "verse_start_index": 783,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (322/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 784,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/834",
              "text": "أَبِي الْقَاسِمِ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/835",
              "text": "مُحَمَّدِ بْنِ سَهْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/836",
              "text": "إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/837",
              "text": "إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ أَبِي الْقَاسِمِ الْكُوفِيِّ عَنْ مُحَمَّدِ بْنِ سَهْلٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:69:1",
        "text": [
          " لَمَّا حَضَرَ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) الْوَفَاةُ قَبْلَ ذَلِكَ أَخْرَجَ سَفَطاً أَوْ صُنْدُوقاً عِنْدَهُ فَقَالَ يَا مُحَمَّدُ احْمِلْ هَذَا الصُّنْدُوقَ ",
          "قَالَ فَحَمَلَ بَيْنَ أَرْبَعَةٍ فَلَمَّا تُوُفِّيَ جَاءَ إِخْوَتُهُ يَدَّعُونَ مَا فِي الصُّنْدُوقِ فَقَالُوا أَعْطِنَا نَصِيبَنَا فِي الصُّنْدُوقِ فَقَالَ وَ اللَّهِ مَا لَكُمْ فِيهِ شَيْ‏ءٌ وَ لَوْ كَانَ لَكُمْ فِيهِ شَيْ‏ءٌ مَا دَفَعَهُ إِلَيَّ وَ كَانَ فِي الصُّنْدُوقِ سِلَاحُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ كُتُبُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Abu Al Qasim Al Kufy, from Muhammad Bin Sahl, from Ibrahim Bin Abu Al Balad, ",
            "(It has been narrated) from Ismail Bin Muhammad Bin Abdullah, son of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, from Abu Ja’far<sup>asws</sup> having said: ‘When the death presented itself to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, before that, he<sup>asws</sup> brought out a basket or a box which was with him<sup>asws</sup>, and he<sup>asws</sup> said: ‘O Muhammad<sup>asws</sup>! Carry away this box!’ ",
            "He (the narrator) said: ‘So he<sup>asws</sup> carried it between four (help of four people). So when he (Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>) passed away, his<sup>asws</sup> brothers came over claiming whatever was in the box, and they said, ‘Give us our share in the box’. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! There is no share for you all in it, and had there been a share for you all in it, it would not have been handed over to me<sup>asws</sup>’. And in the box were the weapons of Rasool-Allah<sup>saww</sup> and his<sup>saww</sup> Books’."
          ],
          "en.sarwar": [
            " 1. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from abu al-Qasim al-Kufi from Muhammad ibn Sahl from Ibrahim ibn abu al-Bilad from Isma’il ibn Muhammad ibn ‘Abdallah ibn Ali ibn al-Husayn from abu Ja‘far (a.s.) who has said the following. “When Ali ibn al-Husayn (a.s.) was about to leave this world he took out a basket or a box that was with him. He then said, “O Muhammad take this box. “ The narrator has said that then he (Muhammad) took the box with four people. When The Imam (a.s.) died his sons came asking for the box and said, “Give us our share from the box.” He (Muhammad) then said to them, “By Allah, there is nothing for you in it. Had there been anything for you he would not have given it to me.” In the box there were the Armament of the Messenger of Allah and his books.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (323/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 785,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/716",
              "text": "عِمْرَانَ بْنِ مُوسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/105",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/838",
              "text": "عِيسَى بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/803",
              "text": "جَدِّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عِمْرَانَ بْنِ مُوسَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:69:2",
        "text": [
          " الْتَفَتَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) إِلَى وُلْدِهِ وَ هُوَ فِي الْمَوْتِ وَ هُمْ مُجْتَمِعُونَ عِنْدَهُ ثُمَّ الْتَفَتَ إِلَى مُحَمَّدِ بْنِ عَلِيٍّ فَقَالَ يَا مُحَمَّدُ هَذَا الصُّنْدُوقُ اذْهَبْ بِهِ إِلَى بَيْتِكَ",
          "قَالَ أَمَا إِنَّهُ لَمْ يَكُنْ فِيهِ دِينَارٌ وَ لَا دِرْهَمٌ وَ لَكِنْ كَانَ مَمْلُوءاً عِلْماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Imran Bin Musa, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah, from Isa Bin Abdullah, from his father, from his grandfather who said, ",
            "‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> turned around to his<sup>asws</sup> children, and he<sup>asws</sup> was during the (pangs of) death, and they had gathered in his<sup>asws</sup> presence. Then he<sup>asws</sup> turned towards Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> and he<sup>asws</sup> said: ‘O Muhammad<sup>asws</sup>! This box, go with it to your<sup>asws</sup> house’. ",
            "He (the narrator) said, ‘But there neither happened to be any Dinars in it nor Dirhams, but it was filled with knowledge’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from ‘Imran ibn Musa from Muhammad ibn al-Husayn from Muhammad ibn ‘Abdallah from ‘Isa ibn ‘Abdallah from his father that his grandfather who has said the following. “Ali ibn al-Husayn looked at his sons when he was about to leave this world and they had all gathered around him. He then looked at his son, Muhammad ibn Ali and said, “O Muhammad, take this box to your house.” He said, “It was not full of Dirhams and Dinars (valuable properties), it, however, was full of knowledge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (323/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 786,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/450",
              "text": "سَهْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "فَضَالَةَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/567",
              "text": "الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:69:3",
        "text": [
          " سَمِعْتُهُ يَقُولُ إِنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ كَتَبَ إِلَى ابْنِ حَزْمٍ أَنْ يُرْسِلَ إِلَيْهِ بِصَدَقَةِ عَلِيٍّ وَ عُمَرَ وَ عُثْمَانَ وَ إِنَّ ابْنَ حَزْمٍ بَعَثَ إِلَى زَيْدِ بْنِ الْحَسَنِ وَ كَانَ أَكْبَرَهُمْ فَسَأَلَهُ الصَّدَقَةَ فَقَالَ زَيْدٌ إِنَّ الْوَالِيَ كَانَ بَعْدَ عَلِيٍّ الْحَسَنَ وَ بَعْدَ الْحَسَنِ الْحُسَيْنَ وَ بَعْدَ الْحُسَيْنِ عَلِيَّ بْنَ الْحُسَيْنِ وَ بَعْدَ عَلِيِّ بْنِ الْحُسَيْنِ مُحَمَّدَ بْنَ عَلِيٍّ فَابْعَثْ إِلَيْهِ ",
          "فَبَعَثَ ابْنُ حَزْمٍ إِلَى أَبِي فَأَرْسَلَنِي أَبِي بِالْكِتَابِ إِلَيْهِ حَتَّى دَفَعْتُهُ إِلَى ابْنِ حَزْمٍ فَقَالَ لَهُ بَعْضُنَا يَعْرِفُ هَذَا وُلْدُ الْحَسَنِ قَالَ نَعَمْ كَمَا يَعْرِفُونَ أَنَّ هَذَا لَيْلٌ وَ لَكِنَّهُمْ يَحْمِلُهُمُ الْحَسَدُ وَ لَوْ طَلَبُوا الْحَقَّ بِالْحَقِّ لَكَانَ خَيْراً لَهُمْ وَ لَكِنَّهُمْ يَطْلُبُونَ الدُّنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from Sahl, from Muhammad Bin Isa, from Fazalat Bin Ayoub, from Al Husayn Bin Abu Al A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Umar Bin Abdul Aziz (the governor) wrote to Ibn Hazim (the judge) that he should send to him the charity donations record of Ali<sup>asws</sup>, and Umar and Usman. And Ibn Hazim (the judge) sent for Zayd son of Al-Hassan<sup>asws</sup>, and he was their eldest, and he asked him of the charity. So Zayd said, ‘The Guardian after Ali<sup>asws</sup> was Al-Hassan<sup>asws</sup>, and after Al-Hassan<sup>asws</sup>, it was Al-Husayn<sup>asws</sup>, and after Al-Husayn<sup>asws</sup> it was Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and after Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> it was Muhammad<sup>asws</sup> Bin Ali<sup>azwj</sup>. Therefore, send (a messenger) to him<sup>asws</sup>. ",
            "So Ibn Hazim (the judge) sent (a messenger) to my<sup>asws</sup> father<sup>asws</sup>. So my<sup>asws</sup> father<sup>asws</sup> sent me<sup>asws</sup> with the Book to him until I<sup>asws</sup> handed it over to him’. So one of us said to him<sup>asws</sup>, ‘Did the sons of Al-Hassan<sup>asws</sup> know this?’ He<sup>asws</sup> said: ‘Yes, just as they were knowing that this is a night, but, the envy carried them, and had they sought the Truth with the Truth, it would have been better for them, but they are seeking the world’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn al-Hasan has narrated from Sahl from Muhammad ibn ‘Isa from Fadala ibn Ayyub from al-Husayn ibn abu al-‘ala’ who has said that he heard abu ‘Abdallah (a.s.) say the following. “’Umar ibn ‘ad al-‘Aziz wrote ibn Hazm to send him the endowment documents of Ali, ‘Umar and ‘Uthman. Inb Hazm sent a person to Zayd ibn al-Hassan (a.s.) who was the eldest among them and asked him about the documents. Zayd said, “The high authority after Ali was al-Hassan and after him al-Husayn and Ali ibn al-Husayn was after al-Husayn and after Ali ibn al-Husayn Muhammad ibn Ali was the high authority. Send to him. Ibn Hazm then sent to my father and my father sent me with document to him and I went and delivered it to ibn Hazm.” The narrator has said that some of our people asked The Imam (a.s.), “did the sons of al-Hassan (a.s.) know this.” The Imam (a.s.) said, “They knew it just as they know that this is night but envy influences them. Had they sought truth with truth it would have been better for them but they seek the worldly things. * Abu Baker ibn Muhammad ibn ’Amr ibn Hazm al-Ansari (37/657 -120/738), the judge of Madina from 87/706 appointed by ‘Umar ibn ‘Abdi al-‘Aziz when he was governor of Madina. When ‘Umar became the Caliph he also appointed ibn Hazm governor of Madina. (al-Tabari, vol.2, pp.ll91, 1255, 1305, 1346, 1372 - 1375, 1437, 1452; vol.3, p.2460; ibn al-Athir, vol.5, pp.55,67; Tahdhib al-Takdhib, vol.l2, pp.38 -40."
          ]
        }
      },
      {
        "index": 787,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/131",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/821",
              "text": "عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/66",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:69:4",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ كَتَبَ إِلَى ابْنِ حَزْمٍ ثُمَّ ذَكَرَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ بَعَثَ ابْنُ حَزْمٍ إِلَى زَيْدِ بْنِ الْحَسَنِ وَ كَانَ أَكْبَرَ مِنْ أَبِي ( عليه السلام ) .",
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin uhammad, from Al Hassan Bin Ali Al Washa, from Abdul Kareem Bin Amro, from Ibn Abu Yafour who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Umar Bin Abdul Aziz (the governor) wrote to Ibn Hazim (the judge)’, then he mentioned similar to it, except that he<sup>asws</sup> said, ‘Ibn Hazim sent for Zayd son of Al-Hassan<sup>asws</sup>, and he was older than my<sup>asws</sup> father<sup>asws</sup>’’. ",
            "<span style=\"font-size: small\">A number of our companions, from Ahmad Bin Muhammad, from Al Washha </span>- similar to it."
          ],
          "en.sarwar": [
            " عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ مِثْلَهُ 4. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from ‘Abd al-Karim ibn ‘Amr from ibn abu Ya‘fur who has said that he heard abu ‘Abdallah (a.s.) say the following. “ ‘Umar ibn ‘Abd al-‘Aziz wrote ibn Hazm. He then have narrated a hadith similar to the above one except that he has said, “Ibn Hazm sent to Zayd ibn al-Hassan who was older than my father.” A number of our people has narrated from Ahmad ibn Muhammad from al-Washsha’ a similar hadith."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:69",
  "kind": "verse_list"
}