{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 7"
        },
        "path": "/books/al-kafi:1:4:7",
        "titles": {
          "ar": "بَابُ مَعْرِفَةِ الْإِمَامِ وَ الرَّدِّ إِلَيْهِ",
          "en": "Chapter 7 – Recognition of the Imam<sup>asws</sup> and the referring (of the matters) to him<sup>asws</sup>"
        }
      }
    ],
    "index": 65,
    "local_index": 7,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 8"
        },
        "path": "/books/al-kafi:1:4:8",
        "titles": {
          "ar": "بَابُ فَرْضِ طَاعَةِ الْأَئِمَّةِ ( عليهم السلام )",
          "en": "Chapter 8 – Necessity of obeying the Imams<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:1:4:6",
        "titles": {
          "ar": "بَابُ أَنَّهُ لَوْ لَمْ يَبْقَ فِي الْأَرْضِ إِلَّا رَجُلَانِ لَكَانَ أَحَدُهُمَا الْحُجَّةَ",
          "en": "Chapter 6 – If it was that there did not remain in the earth except for two men, one of the two would be the Divine Aurhority"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:7",
    "titles": {
      "ar": "بَابُ مَعْرِفَةِ الْإِمَامِ وَ الرَّدِّ إِلَيْهِ",
      "en": "Chapter 7 – Recognition of the Imam<sup>asws</sup> and the referring (of the matters) to him<sup>asws</sup>"
    },
    "verse_count": 14,
    "verse_start_index": 463,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/300)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 464,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/131",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:1",
        "text": [
          " حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ قَالَ لِي أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّمَا يَعْبُدُ اللَّهَ مَنْ يَعْرِفُ اللَّهَ فَأَمَّا مَنْ لَا يَعْرِفُ اللَّهَ فَإِنَّمَا يَعْبُدُهُ هَكَذَا ضَلَالًا ",
          "قُلْتُ جُعِلْتُ فِدَاكَ فَمَا مَعْرِفَةُ اللَّهِ قَالَ تَصْدِيقُ اللَّهِ عَزَّ وَ جَلَّ وَ تَصْدِيقُ رَسُولِهِ ( صلى الله عليه وآله ) وَ مُوَالَاةُ عَلِيٍّ ( عليه السلام ) وَ الِائْتِمَامُ بِهِ وَ بِأَئِمَّةِ الْهُدَى ( عليهم السلام ) وَ الْبَرَاءَةُ إِلَى اللَّهِ عَزَّ وَ جَلَّ مِنْ عَدُوِّهِمْ هَكَذَا يُعْرَفُ اللَّهُ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washa who said, ‘Muhammad Bin Al Fuzayl narrated to us, from Abu Hamza who said, ",
            "‘Abu Ja’far<sup>asws</sup> said to me: ‘But rather, he worships Allah<sup>azwj</sup>, the one who recognises Allah<sup>azwj</sup>. So, as for the one who does not recognise Allah<sup>azwj</sup>, so rather he is worshipping Him<sup>azwj</sup> like this, ‘ضَلَالًا’ (under dark covers of kufr) erroneously’.",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! So what is the recognition of Allah<sup>azwj</sup>?’ He<sup>asws</sup> said: ‘Ratification of Allah<sup>azwj</sup> Mighty and Majestic, and ratification of His Rasool<sup>saww</sup>, and the Master of the Command Ali<sup>asws</sup>, and the following with him<sup>asws</sup> and the Imams<sup>asws</sup> of the Guidance, and the disavowing to Allah<sup>azwj</sup> from their enemies. Like this, Allah<sup>azwj</sup> Mighty and Majestic is recognised’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ who has said that Muhammad ibn al-Fudayl narrated to me from abu Hamza from abu Ja’far (a.s.) who has said the following. “Only those who know Allah worship Him. Those who do not know Allah they worship Him just like that in misguidance.” I then asked, may Allah take my soul in service for your cause, what the knowledge about Allah?” The Imam (a.s.) said, “Knowledge about Allah means is to acknowledge the existence of Allah, the Most Holy, the Most High, to acknowledge His messenger and to love Imam Ali (a.s.). Of such knowledge is to follow him and the Imams of guidance and to denounce before Allah, the Most Holy, the Most High, their (Imams’) enemies. This is how the knowledge about Allah is.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (301/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 465,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/578",
              "text": "الْحُسَيْنُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/579",
              "text": "مُعَلًّى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/146",
              "text": "أَحْمَدَ بْنِ عَائِذٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/260",
              "text": "ابْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ عَنْ مُعَلًّى عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنْ أَبِيهِ عَنِ ابْنِ أُذَيْنَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:2",
        "text": [
          " حَدَّثَنَا غَيْرُ وَاحِدٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) أَنَّهُ قَالَ لَا يَكُونُ الْعَبْدُ مُؤْمِناً حَتَّى يَعْرِفَ اللَّهَ وَ رَسُولَهُ وَ الْأَئِمَّةَ كُلَّهُمْ وَ إِمَامَ زَمَانِهِ وَ يَرُدَّ إِلَيْهِ وَ يُسَلِّمَ لَهُ ",
          "ثُمَّ قَالَ كَيْفَ يَعْرِفُ الْآخِرَ وَ هُوَ يَجْهَلُ الْأَوَّلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn, from Moalla, from Al Hassan Bin Ali, from Ahmad Bin Aiz, from his father, from Ibn Azina who said, ‘Someone else narrated, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The servant cannot happen to be a <span class=\"iTxt\">Momin</span> until he recognises Allah<sup>azwj</sup>, and His<sup>azwj</sup> Rasool<sup>saww</sup>, and the Imams<sup>asws</sup>, all of them<sup>asws</sup>, and the Imam<sup>asws</sup> of his time period, and he refers (all his matters) to him<sup>asws</sup>, and submits to him<sup>asws</sup>’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘How can he recognise the last one<sup style=\"font-weight: normal\">asws</sup> while he is ignorant of the first one<sup style=\"font-weight: normal\">asws</sup>?’."
          ],
          "en.sarwar": [
            " 2. Al-Husayn has narrated from Mu‘alla al-Hassan ibn Ali from Ahmad ibn ‘A’idh from his father from ’Udhayna who has said that more than one person has narrated to us from one the two Imams (a.s.) who has said the following. “One will not be considered a Mu‘min until he knows Allah, His Messenger and all of the Imams and the Imam of ones time, acknowledges his Divine authority and submits his affairs to the Imam (a.s.).” He then said, “How would one know the last one when one is ignorant of the first one.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/302)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (25/ 1)"
        ],
        "index": 466,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:3",
        "text": [
          " قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَخْبِرْنِي عَنْ مَعْرِفَةِ الْإِمَامِ مِنْكُمْ وَاجِبَةٌ عَلَى جَمِيعِ الْخَلْقِ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ بَعَثَ مُحَمَّداً ( صلى الله عليه وآله ) إِلَى النَّاسِ أَجْمَعِينَ رَسُولًا وَ حُجَّةً لِلَّهِ عَلَى جَمِيعِ خَلْقِهِ فِي أَرْضِهِ ",
          "فَمَنْ آمَنَ بِاللَّهِ وَ بِمُحَمَّدٍ رَسُولِ اللَّهِ وَ اتَّبَعَهُ وَ صَدَّقَهُ فَإِنَّ مَعْرِفَةَ الْإِمَامِ مِنَّا وَاجِبَةٌ عَلَيْهِ وَ مَنْ لَمْ يُؤْمِنْ بِاللَّهِ وَ بِرَسُولِهِ وَ لَمْ يَتَّبِعْهُ وَ لَمْ يُصَدِّقْهُ وَ يَعْرِفْ حَقَّهُمَا فَكَيْفَ يَجِبُ عَلَيْهِ مَعْرِفَةُ الْإِمَامِ وَ هُوَ لَا يُؤْمِنُ بِاللَّهِ وَ رَسُولِهِ وَ يَعْرِفُ حَقَّهُمَا ",
          "قَالَ قُلْتُ فَمَا تَقُولُ فِيمَنْ يُؤْمِنُ بِاللَّهِ وَ رَسُولِهِ وَ يُصَدِّقُ رَسُولَهُ فِي جَمِيعِ مَا أَنْزَلَ اللَّهُ يَجِبُ عَلَى أُولَئِكَ حَقُّ مَعْرِفَتِكُمْ قَالَ نَعَمْ أَ لَيْسَ هَؤُلَاءِ يَعْرِفُونَ فُلَاناً وَ فُلَاناً قُلْتُ بَلَى قَالَ أَ تَرَى أَنَّ اللَّهَ هُوَ الَّذِي أَوْقَعَ فِي قُلُوبِهِمْ مَعْرِفَةَ هَؤُلَاءِ وَ اللَّهِ مَا أَوْقَعَ ذَلِكَ فِي قُلُوبِهِمْ إِلَّا الشَّيْطَانُ لَا وَ اللَّهِ مَا أَلْهَمَ الْمُؤْمِنِينَ حَقَّنَا إِلَّا اللَّهُ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Hisham Bin Salim, from Zurara who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘Inform me about recognition of the Imam<sup>asws</sup> from you (Imams<sup>asws</sup>). Is it an Obligation upon the entirety of the creatures?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Sent Muhammad<sup>asws</sup> to the people altogether as a Rasool<sup>saww</sup> and a Divine Authority of Allah<sup>azwj</sup> upon the entirety of His<sup>azwj</sup> creatures in His<sup>azwj</sup> earth.",
            "So the one who believes in Allah<sup>azwj</sup>, and in Muhammad<sup>saww</sup> as a Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, and follows him<sup>asws</sup> and ratifies him<sup>saww</sup>, so the recognition of the Imam<sup>asws</sup> from us<sup>asws</sup> is an Obligation upon him; and the one who does not believe in Allah<sup>azwj</sup> and in His<sup>azwj</sup> Rasool<sup>saww</sup>, and does not follow him<sup>saww</sup> and does not ratify him<sup>saww</sup> and recognise both their rights, so how can the recognition of the Imam<sup>asws</sup> Obligate upon him while he does not believe in Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> and recognise both their rights?’",
            "He (the narrator) said, ‘I said, ‘So what are you saying regarding the one who believes in Allah<sup style=\"font-weight: normal\">azwj</sup> and His<sup style=\"font-weight: normal\">azwj</sup> Rasool<sup style=\"font-weight: normal\">saww</sup> with regards to the entirety of what Allah<sup style=\"font-weight: normal\">azwj</sup> has Revealed, would it Obligate upon those ones the right of your<sup style=\"font-weight: normal\">asws</sup> recognition?’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes. Aren’t they reognising so and so, and so and so?’ I said, ‘Yes’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘Is it your view that Allah<sup style=\"font-weight: normal\">azwj</sup> is the One<sup style=\"font-weight: normal\">azwj</sup> Who Caused the recognition of those (two) to occur into their hearts? By Allah<sup style=\"font-weight: normal\">azwj</sup>! Allah<sup style=\"font-weight: normal\">azwj</sup> did not Cause the occurrence of that into their hearts, except (it was) the Satan<sup style=\"font-weight: normal\">la</sup>. No, by Allah<sup style=\"font-weight: normal\">azwj</sup>! None inspires the Momineen of our<sup style=\"font-weight: normal\">asws</sup> rights except for Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from Hisham ibn Salim from Zurara who has said the following. “I said to abu Ja’far (a.s.), ‘Is knowing the Imam from among you obligatory on all creatures?’” The Imam (a.s.) said, “Allah, the Most Holy, the Most High, sent Muhammad to all people as His Messenger and as His authority over all creatures on earth. Those who have faith in Allah and that Muhammad is His Messenger and have followed him and have acknowledged his message on such people it is obligatory to the Imam from us. Those who do not have faith in Allah and in His messenger and who do not follow him and do not acknowledge him and do not acknowledge the rights of Allah and His messenger then knowing the Imam (a.s.) would be obligatory on them? They do not have faith in Allah and in His messenger, do not follow him and do not acknowledge their rights.” I then asked, “What would you say about those who have faith in Allah and His messenger who acknowledge His messenger in all the matters that have come from Allah, is it obligatory for them to know the Imam (a.s.) from you?” The Imam (a.s.) said, “Yes, it is obligatory. Do they not know so and so?” I said, “yes, they do.” The Imam (a.s.) then said, “Do you think Allah is the one who has placed such knowledge in their hearts? No, I swear to Allah that no one other than Satan has placed such knowledge in their hearts. I swear to Allah that no one other than Allah, the Most Holy, the Most High, has inspired our rights in hearts of the believers.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (303/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 467,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/580",
              "text": "عَمْرِو بْنِ أَبِي الْمِقْدَامِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/181",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ عَنْ جَابِرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:4",
        "text": [
          " سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّمَا يَعْرِفُ اللَّهَ عَزَّ وَ جَلَّ وَ يَعْبُدُهُ مَنْ عَرَفَ اللَّهَ وَ عَرَفَ إِمَامَهُ مِنَّا أَهْلَ الْبَيْتِ وَ مَنْ لَا يَعْرِفِ اللَّهَ عَزَّ وَ جَلَّ وَ لَا يَعْرِفِ الْإِمَامَ مِنَّا أَهْلَ الْبَيْتِ فَإِنَّمَا يَعْرِفُ وَ يَعْبُدُ غَيْرَ اللَّهِ هَكَذَا وَ اللَّهِ ضَلَالًا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Amro Bin Abu Al Miqdam, from Jabir who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘But rather, he recognises Allah<sup>azwj</sup> Mighty and Majestic and worships Him<sup>azwj</sup>, the one who recognises Allah<sup>azwj</sup> and recognises his Imam<sup>asws</sup> from us<sup>asws</sup> the People<sup>asws</sup> of the Household; and the one who does not recognise Allah<sup>azwj</sup> Mighty and Majestic and does not recognise his Imam<sup>asws</sup> from us<sup>asws</sup> the People<sup>asws</sup> of the Household, so rather he is recognising and worshipping other than Allah<sup>azwj</sup>. Like this, by Allah<sup>azwj</sup>, is the straying!’."
          ],
          "en.sarwar": [
            " 4. From the narrator of the previous Hadith from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from ‘Amr ibn abu al-Miqdam from Jabir who has said the following. “I heard imam abu Ja’far (a.s.) saying, ‘Only those who know Allah, the Most Holy, the Most High, and worship Him. It is such people who know Him and know the Imam from the family of the Holy Prophet (s.a). Those who do not know Allah, the Most Holy, the Most High, and do not know the Imam from us, Ahlul Bayt, such people only know and worship something other than Allah just like that in error.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/204)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 468,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/242",
              "text": "مُحَمَّدِ بْنِ جُمْهُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "فَضَالَةَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/165",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/581",
              "text": "ذَرِيحٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ ذَرِيحٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:5",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْأَئِمَّةِ بَعْدَ النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِمَاماً ثُمَّ كَانَ الْحَسَنُ ( عليه السلام ) إِمَاماً ثُمَّ كَانَ الْحُسَيْنُ ( عليه السلام ) إِمَاماً ثُمَّ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ إِمَاماً ثُمَّ كَانَ مُحَمَّدُ بْنُ عَلِيٍّ إِمَاماً ",
          "مَنْ أَنْكَرَ ذَلِكَ كَانَ كَمَنْ أَنْكَرَ مَعْرِفَةَ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ مَعْرِفَةَ رَسُولِهِ ( صلى الله عليه وآله ) ",
          "ثُمَّ قَالَ قُلْتُ ثُمَّ أَنْتَ جُعِلْتُ فِدَاكَ فَأَعَدْتُهَا عَلَيْهِ ثَلَاثَ مَرَّاتٍ فَقَالَ لِي إِنِّي إِنَّمَا حَدَّثْتُكَ لِتَكُونَ مِنْ شُهَدَاءِ اللَّهِ تَبَارَكَ وَ تَعَالَى فِي أَرْضِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Muhammad Bin Jamhour, from Fazalat Bin Ayoub, from Muawiya Bin Wahab, from Zareeh who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Imams<sup>asws</sup> after the Prophet<sup>saww</sup>. So he<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> was an Imam<sup>asws</sup>, then Al-Hassan<sup>asws</sup> was an Imam<sup>asws</sup>, and Al-Husayn<sup>asws</sup> was an Imam<sup>asws</sup>, and Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was an Imam<sup>asws</sup>, and Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> was an Imam<sup>asws</sup>. ",
            "The one who denies that, he would be like the one who denies the recognition of Allah<sup>azwj</sup> Blessed and High, and recognition of His<sup>azwj</sup> Rasool<sup>saww</sup>’. ",
            "Then he (the narrator) said, ‘I said, ‘Then you<sup style=\"font-weight: normal\">asws</sup>, may I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>!’ So I reiterated it upon him<sup style=\"font-weight: normal\">asws</sup> three times. So he<sup style=\"font-weight: normal\">asws</sup> said to me: ‘I<sup style=\"font-weight: normal\">asws</sup> rather, narrated to you in order for you to become from the witnesses of Allah<sup style=\"font-weight: normal\">azwj</sup> Blessed and High in His<sup style=\"font-weight: normal\">azwj</sup> earth’."
          ],
          "en.sarwar": [
            " 5. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jaumhur from Faddala ibn Ayyub from Mu‘awiya ibn Wahab from Dhurayh who has said the following. “I asked abu ‘Abdallah (a.s.) about the Imams after the Holy Prophet (s.a.).” The Imam (a.s.) said, “Amir al-Mu’minin (Ali) (a.s.) was the Imam. Then al-Hassan (a.s.) was the Imam. Then al-Husayn (a.s.) was the Imam. Then Ali ibn Al-Husayn (a.s.) was the Imam. Then Muhammad ibn Ali (a.s.) was the Imam. One who would deny this would be as if he has denied the existence of Allah, the Most Holy, the Most High, and the truthfulness of Prophet Muhammad (s.a).” I asked, “may Allah take my soul in service for your cause, are you then the Imam? I repeated it three times.” The Imam said, “I only said it to you so that you will be of the witnesses before Allah, the Most Holy, the Most High, on His earth.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/305)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 469,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/227",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:6",
        "relations": {
          "Mentions": [
            "/books/quran:24:36",
            "/books/quran:5:27",
            "/books/quran:35:24",
            "/books/quran:35:25",
            "/books/quran:22:46",
            "/books/quran:20:82",
            "/books/quran:7:31",
            "/books/quran:24:37"
          ]
        },
        "text": [
          " إِنَّكُمْ لَا تَكُونُونَ صَالِحِينَ حَتَّى تَعْرِفُوا وَ لَا تَعْرِفُوا حَتَّى تُصَدِّقُوا وَ لَا تُصَدِّقُوا حَتَّى تُسَلِّمُوا أَبْوَاباً أَرْبَعَةً لَا يَصْلُحُ أَوَّلُهَا إِلَّا بِآخِرِهَا ضَلَّ أَصْحَابُ الثَّلَاثَةِ وَ تَاهُوا تَيْهاً بَعِيداً ",
          "إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَا يَقْبَلُ إِلَّا الْعَمَلَ الصَّالِحَ وَ لَا يَقْبَلُ اللَّهُ إِلَّا الْوَفَاءَ بِالشُّرُوطِ وَ الْعُهُودِ فَمَنْ وَفَى لِلَّهِ عَزَّ وَ جَلَّ بِشَرْطِهِ وَ اسْتَعْمَلَ مَا وَصَفَ فِي عَهْدِهِ نَالَ مَا عِنْدَهُ وَ اسْتَكْمَلَ مَا وَعَدَهُ ",
          "إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَخْبَرَ الْعِبَادَ بِطُرُقِ الْهُدَى وَ شَرَعَ لَهُمْ فِيهَا الْمَنَارَ وَ أَخْبَرَهُمْ كَيْفَ يَسْلُكُونَ فَقَالَ وَ إِنِّي لَغَفَّارٌ لِمَنْ تابَ وَ آمَنَ وَ عَمِلَ صالِحاً ثُمَّ اهْتَدى ",
          "وَ قَالَ إِنَّما يَتَقَبَّلُ اللَّهُ مِنَ الْمُتَّقِينَ فَمَنِ اتَّقَى اللَّهَ فِيمَا أَمَرَهُ لَقِيَ اللَّهَ مُؤْمِناً بِمَا جَاءَ بِهِ مُحَمَّدٌ ( صلى الله عليه وآله )",
          "هَيْهَاتَ هَيْهَاتَ فَاتَ قَوْمٌ وَ مَاتُوا قَبْلَ أَنْ يَهْتَدُوا وَ ظَنُّوا أَنَّهُمْ آمَنُوا وَ أَشْرَكُوا مِنْ حَيْثُ لَا يَعْلَمُونَ إِنَّهُ مَنْ أَتَى الْبُيُوتَ مِنْ أَبْوَابِهَا اهْتَدَى وَ مَنْ أَخَذَ فِي غَيْرِهَا سَلَكَ طَرِيقَ الرَّدَى",
          "وَصَلَ اللَّهُ طَاعَةَ وَلِيِّ أَمْرِهِ بِطَاعَةِ رَسُولِهِ وَ طَاعَةَ رَسُولِهِ بِطَاعَتِهِ فَمَنْ تَرَكَ طَاعَةَ وُلَاةِ الْأَمْرِ لَمْ يُطِعِ اللَّهَ وَ لَا رَسُولَهُ وَ هُوَ الْإِقْرَارُ بِمَا أُنْزِلَ مِنْ عِنْدِ اللَّهِ عَزَّ وَ جَلَّ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَ الْتَمِسُوا الْبُيُوتَ الَّتِي أَذِنَ اللَّهُ أَنْ تُرْفَعَ وَ يُذْكَرَ فِيهَا اسْمُهُ",
          "فَإِنَّهُ أَخْبَرَكُمْ أَنَّهُمْ رِجَالٌ لَا تُلْهِيهِمْ تِجَارَةٌ وَ لَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ وَ إِقَامِ الصَّلَاةِ وَ إِيتَاءِ الزَّكَاةِ يَخَافُونَ يَوْماً تَتَقَلَّبُ فِيهِ الْقُلُوبُ وَ الْأَبْصَارُ ",
          "إِنَّ اللَّهَ قَدِ اسْتَخْلَصَ الرُّسُلَ لِأَمْرِهِ ثُمَّ اسْتَخْلَصَهُمْ مُصَدِّقِينَ بِذَلِكَ فِي نُذُرِهِ فَقَالَ وَ إِنْ مِنْ أُمَّةٍ إِلَّا خَلا فِيها نَذِيرٌ تَاهَ مَنْ جَهِلَ وَ اهْتَدَى مَنْ أَبْصَرَ وَ عَقَلَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فَإِنَّها لا تَعْمَى الْأَبْصارُ وَ لكِنْ تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُور وَ كَيْفَ يَهْتَدِي مَنْ لَمْ يُبْصِرْ وَ كَيْفَ يُبْصِرُ مَنْ لَمْ يَتَدَبَّرْ ِ",
          "اتَّبِعُوا رَسُولَ اللَّهِ وَ أَهْلَ بَيْتِهِ وَ أَقِرُّوا بِمَا نَزَلَ مِنْ عِنْدِ اللَّهِ وَ اتَّبِعُوا آثَارَ الْهُدَى فَإِنَّهُمْ عَلَامَاتُ الْأَمَانَةِ وَ التُّقَى وَ اعْلَمُوا أَنَّهُ لَوْ أَنْكَرَ رَجُلٌ عِيسَى ابْنَ مَرْيَمَ ( عليها السلام ) وَ أَقَرَّ بِمَنْ سِوَاهُ مِنَ الرُّسُلِ لَمْ يُؤْمِنْ ",
          "اقْتَصُّوا الطَّرِيقَ بِالْتِمَاسِ الْمَنَارِ وَ الْتَمِسُوا مِنْ وَرَاءِ الْحُجُبِ الْآثَارَ تَسْتَكْمِلُوا أَمْرَ دِينِكُمْ وَ تُؤْمِنُوا بِاللَّهِ رَبِّكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from the one who mentioned it, from Muhammad Bin Abdul Rahman Bin Abu Layli, from his father, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You all will not be becoming righteous until you are recognising, nor will you be recognising until you are ratifying, nor will you be ratifying until you are submitting to four doors, the first not being correct except with its last one. They strayed, the companions of the three, wandering with a far wandering.",
            "Allah<sup>azwj</sup> Blessed and High does not Accept except for the righteous deeds nor does Allah<sup>azwj</sup> Accept except for the loyalty with the stipulation and the Covenants. So the one who is loyal to Allah<sup>azwj</sup> Mighty and Majestic with His<sup>azwj</sup> Stipulation and works upon what is described in his Covenant, would attain what is in His<sup>azwj</sup> Presence, and He<sup>azwj</sup> would Complete whatever He<sup>azwj</sup> Promised him. ",
            "Allah<sup>azwj</sup> Blessed and High Informed the servant with the ways of the Guidance and Legislated for them the beacons in these, and Informed them how they should be travelling, so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h82\">[20:82]</a> And I am Forgiving to him who repents and believes and does righteous deeds, then follows the right Guidance</span>’. ",
            "And he<sup>asws</sup> said: ‘But rather, Allah<sup>azwj</sup> Accepts from the pious. So the one who fears Allah<sup>azwj</sup> with regards to what He<sup>azwj</sup> Commanded him, would meet Allah<sup>azwj</sup> as a believer in whatever Muhammad<sup>saww</sup> came with.",
            "Alas! Alas! Lost were a people and they died before they were guided, and they were thinking that they had believed, and (but) they had associated (committed Shirk) from (an aspect) they were not knowing. It is so, that the one who comes to the houses by their doors is guided, and the one who takes to something else has travelled the road of annihilation. ",
            "Allah<sup>azwj</sup> Linked the obedience to a Master of His<sup>azwj</sup> Command with the obedience to His<sup>azwj</sup> Rasool<sup>saww</sup>, and the obedience to His<sup>azwj</sup> Rasool<sup>saww</sup> with obedience to Him<sup>azwj</sup>. So the one who neglects the obedience to a Master of the Command would have neither obeyed Allah<sup>azwj</sup> nor His<sup>azwj</sup> Rasool<sup>saww</sup>, and it is the acknowledgement with whatever was Revealed from the Presence of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h31\">[7:31]</a> O Children of Adam! Take to your adornments at every Masjid</span>. And seek out <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h36\">[24:36]</a> houses which Allah has Allowed to be Exalted and that His Name may be Mentioned in them</span>. ",
            "So He<sup>azwj</sup> informed you that these are <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h37\">[24:37]</a> Men whom neither merchandise nor selling diverts from the Remembrance of Allah and the keeping up of Prayer and the giving of Zakat; they fear a Day in which the hearts and eyes shall be overturned</span>.",
            "Allah<sup>azwj</sup> had Selected the Rasools<sup>as</sup> for His<sup>azwj</sup> Command. Then He<sup>azwj</sup> Selected them<sup>as</sup> Ratifying with that in His<sup>azwj</sup> Warning, so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:35#h24\">[35:24]</a> and there is not a people but a warner has gone among them</span>. He strayed, the one who was ignorant; and he was guided, the one who had insight and intellect. <span class=\"ibTxt\"><a href=\"/#/books/quran:22#h46\">[22:46]</a> For surely it is not the eyes that are blind, but blind are the hearts which are in the chests</span><span class=\"bTxt\">.</span> And how can he be guided, the one who does not have insight, and how can he have insight, the one who does not ponder? ",
            "Follow Rasool-Allah<sup>saww</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household, and be acknowledging with whatever has been Revealed from the Presence of Allah<sup>azwj</sup>, and follow the Ahadeeth of the Guidance, for they<sup>asws</sup> are the signs of honesty and piety, and know that if a man was to deny Isa<sup>as</sup> Bin Maryam<sup>as</sup> and accepts the ones besides him<sup>as</sup> from the Rasools<sup>as</sup> has not believed. ",
            "Navigate the road by seeking the beacons, and seek it from behind the veil of the ‘الْآثَارَ’ Signs (Ahadeeth), you would be completing the matter of your Religion and you would be believers in Allah<sup>azwj</sup>, your Lord<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 6. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from his father from those whom he mentioned from Muhammad ibn ‘Abd al-Rahman ibn abu Layla from his father from abu ‘Abdallah (a.s.) who has said the following. “You will not be of the people of good deeds until you will know. You will not know until you acknowledge. You will not acknowledge until you safeguard the four doors and the first of these doors will not do any good without the last. The people of the three strayed far away from the (right) path. Allah, the Most Holy, the Most High, accepts only the righteous deeds. Allah does not accept with one’s fulfilling the conditions of the covenant. Those who remain faithful to Allah, the Most Holy, the Most High, about His condition and follow what is prescribed in the covenant he will receive blessings from Him and He will keep His promise. Allah, the Most Holy, the Most High, has informed the people of the path of guidance and has sanctioned for them the laws of Shari‘a as beacons. He has informed them how to follow the laws. He has said, “I am All-forgiving to the righteously striving believers who repent and follow the right guidance.” <a href=\"/#/books/quran:20#h82\">[20:82]</a> “Allah (God) only accepts the offerings of the pious ones.” <a href=\"/#/books/quran:5#h27\">[5:27]</a> Those who are pious before Allah about His commandments they meet Allah as believers in in whatever Prophet has brought to them from Allah. It is unfortunate that people died before finding guidance. They thought that they were believers but they became polytheist without realizing it. Those who enter the house through the door they are rightly guided. Those who go other ways they are on the path to destruction. Allah has connected the obedience to the people of Divine authority with the obedience to His Messenger and the obedience to His messenger with obedience to His Own-self. Those who would disregard obedience to the people of Divine authority they have not obeyed Allah and His Messenger. This obedience is the acknowledgment of what Allah, the Most Holy, the Most High, has sent. (That you) be well dressed with means of beauty near every mosque; that you should enter the doors of the houses that Allah has given permission to be uplifted wherein His names be mentioned. Allah has certainly informed you that there are certain man whose attentions and mind do not deviate from speaking about Allah, prayer and paying charity because of business and trade attractions. They only fear the Day in which the hearts and eyes turn upside down. Allah has appointed the messengers for commands. He then chose them to acknowledge in His Warning and said, “No nation who lived before was left without a Warner . .” <a href=\"/#/books/quran:35#h25\">[35:25]</a> Stray those who are ignorant and find the right guidance those who think and understand. Allah, the Most Holy, the Most High, has said, “It is their hearts in the center which are blind, not their ears.” <a href=\"/#/books/quran:22#h46\">[22:46]</a> How can one does not see find guidance and how would one understand without thinking? Follow the Messenger of Allah and his Ahlul Bayt (family) and acknowledge what Allah has sent and follow the traces of guidance. They (Ahlul Bayt) are the signs of trust and piety. Know that if a person would deny Jesus, the son of Mary (a.s.) and acknowledge all the other prophets such person will not be considered a believer. Follow the path by the help of the lighthouses and follow the signs from behind the barriers. Try to perfect the matters of your religion and have faith in Allah, your Lord.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (312/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 470,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/582",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ بْنِ صَغِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/113",
              "text": "حَدَّثَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "رِبْعِيِّ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ بْنِ صَغِيرٍ عَمَّنْ حَدَّثَهُ عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:7",
        "text": [
          "هُ قَالَ أَبَى اللَّهُ أَنْ يُجْرِيَ الْأَشْيَاءَ إِلَّا بِأَسْبَابٍ فَجَعَلَ لِكُلِّ شَيْ‏ءٍ سَبَباً وَ جَعَلَ لِكُلِّ سَبَبٍ شَرْحاً وَ جَعَلَ لِكُلِّ شَرْحٍ عِلْماً وَ جَعَلَ لِكُلِّ عِلْمٍ بَاباً نَاطِقاً عَرَفَهُ مَنْ عَرَفَهُ وَ جَهِلَهُ مَنْ جَهِلَهُ ذَاكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ نَحْنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Muhammad Bin Al Husayn Bin Sagheer, from the one who narrated it, from Rabie Bin Abdullah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Refused to Flow the things except by causes. Thus, He<sup>azwj</sup> Made a cause to be for everything, and Made an explanation to be for every cause, and Made a knowledge to be for every explanation, and Made a speaking door to be for every knowledge. He recognised him<sup>asws</sup> the one who recognised it, and he was ignorant of him<sup>asws</sup> the one who was ignorant of it. That, is Rasool-Allah<sup>saww</sup> and us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 7. A number of our people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Muhammad ibn al-Husayn ibn Saghir from whom he has narrated from Rib‘i ibn ‘Abdallah from abu ‘Abdallah (a.s.) who has said the following. “Allah did not want to let things work except through their means and reasons. For everything He made a cause, for every cause an explanation, for every explanation a science, for every science a speaking chapter. Some people know it and some do not know. It is the messengers of Allah and we.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/313)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (25/ 1)"
        ],
        "index": 471,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:8",
        "text": [
          " سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ كُلُّ مَنْ دَانَ اللَّهَ عَزَّ وَ جَلَّ بِعِبَادَةٍ يُجْهِدُ فِيهَا نَفْسَهُ وَ لَا إِمَامَ لَهُ مِنَ اللَّهِ فَسَعْيُهُ غَيْرُ مَقْبُولٍ وَ هُوَ ضَالٌّ مُتَحَيِّرٌ وَ اللَّهُ شَانِئٌ لِأَعْمَالِهِ",
          "وَ مَثَلُهُ كَمَثَلِ شَاةٍ ضَلَّتْ عَنْ رَاعِيهَا وَ قَطِيعِهَا فَهَجَمَتْ ذَاهِبَةً وَ جَائِيَةً يَوْمَهَا فَلَمَّا جَنَّهَا اللَّيْلُ بَصُرَتْ بِقَطِيعِ غَنَمٍ مَعَ رَاعِيهَا فَحَنَّتْ إِلَيْهَا وَ اغْتَرَّتْ بِهَا فَبَاتَتْ مَعَهَا فِي مَرْبِضِهَا فَلَمَّا أَنْ سَاقَ الرَّاعِي قَطِيعَهُ أَنْكَرَتْ رَاعِيَهَا وَ قَطِيعَهَا فَهَجَمَتْ مُتَحَيِّرَةً تَطْلُبُ رَاعِيَهَا وَ قَطِيعَهَا فَبَصُرَتْ بِغَنَمٍ مَعَ رَاعِيهَا فَحَنَّتْ إِلَيْهَا وَ اغْتَرَّتْ بِهَا فَصَاحَ بِهَا الرَّاعِي الْحَقِي بِرَاعِيكِ وَ قَطِيعِكِ فَأَنْتِ تَائِهَةٌ مُتَحَيِّرَةٌ عَنْ رَاعِيكَ وَ قَطِيعِكَ",
          "فَهَجَمَتْ ذَعِرَةً مُتَحَيِّرَةً تَائِهَةً لَا رَاعِيَ لَهَا يُرْشِدُهَا إِلَى مَرْعَاهَا أَوْ يَرُدُّهَا فَبَيْنَا هِيَ كَذَلِكَ إِذَا اغْتَنَمَ الذِّئْبُ ضَيْعَتَهَا فَأَكَلَهَا ",
          "وَ كَذَلِكَ وَ اللَّهِ يَا مُحَمَّدُ مَنْ أَصْبَحَ مِنْ هَذِهِ الْأُمَّةِ لَا إِمَامَ لَهُ مِنَ اللَّهِ عَزَّ وَ جَلَّ ظَاهِرٌ عَادِلٌ أَصْبَحَ ضَالًّا تَائِهاً وَ إِنْ مَاتَ عَلَى هَذِهِ الْحَالَةِ مَاتَ مِيتَةَ كُفْرٍ وَ نِفَاقٍ وَ اعْلَمْ يَا مُحَمَّدُ أَنَّ أَئِمَّةَ الْجَوْرِ وَ أَتْبَاعَهُمْ لَمَعْزُولُونَ عَنْ دِينِ اللَّهِ قَدْ ضَلُّوا وَ أَضَلُّوا فَأَعْمَالُهُمُ الَّتِي يَعْمَلُونَهَا كَرَمَادٍ اشْتَدَّتْ بِهِ الرِّيحُ فِي يَوْمٍ عَاصِفٍ لَا يَقْدِرُونَ مِمَّا كَسَبُوا عَلَى شَيْ‏ءٍ ذَلِكَ هُوَ الضَّلَالُ الْبَعِيدُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Al A’ala Bin Razeyn,f rom Muhammad Bin Muslim who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Everyone who makes it a Religion of Allah<sup>azwj</sup> Mighty and Majestic by worship, fighting against his own self, and there is no Imam<sup>asws</sup> for him from Allah<sup>azwj</sup>, so his striving would be without Acceptance and he would stray confused and Allah<sup>azwj</sup> would Hate his deeds. ",
            "And his example is like the example of a sheep who has strayed from its shepherd and its herd. So it wanders going and coming during its day. So when the night shields it, it sees a herd of sheep with their shepherd. So it goes over to them and departs with them and spends the night along with them in their pens. So the shepherd shouts at it, ‘Go and join your own shepherd and your herd, for you are wandering confused from your shepherd and your herd!’",
            "So it runs wandering confusedly, there being no shepherd for it to guide it to its pastures or to return it. So while it is like that, the wolf attacks it, wasting it, and devours it.",
            "And similar to that, by Allah<sup>azwj</sup> O Muhammad, is the one from this community who wakes up in the morning with no Imam<sup>asws</sup> for him from Allah<sup>azwj</sup> Mighty and Majestic, manifest, just. He wakes up in the morning straying, wandering, and if he was to die upon this state, would die the death of disbelief and hypocrisy. And know, O Muhammad, that the tyrannous imams and their followers are isolated from the Religion of Allah<sup>azwj</sup>. They have strayed and are straying (others). Thus, the deeds which they are performing are like the dust which the wind scatters with during a stormy day. They are not able upon anything from that what they are earning. It is the far straying’."
          ],
          "en.sarwar": [
            " 8. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan ibn Yahya from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following. “I heard abu Ja’far (a.s.) saying, ‘Whoever would worship Allah in the expectation for reward and work hard but without having an Imam for himself his efforts would not be received acceptance. Such person is last and straying and Allah would dislike his deeds. The example of such person is like that of a lost sheep who would stray away from her herd. She would wonder around during the day and at nightfall she would see a different flock of sheep with a shepherd and she would glad and affectionately join it thinking it to be like her own flock. She would pass the night in their barn but in the morning when the shepherd let the flock out she could not recognize her flock and shepherd and begin to wonder in search for her own flock and shepherd and saw a flock and a shepherd. She then would rush to the flock with great interest but the shepherd shouted, ‘Go to your own flock and shepherd because you are lost and wondering.’ She then would run back and forth lost and wondering without a shepherd to show her the grazing areas and the barn. At such time a wolf would seize the opportunity and would kill her to eat. Just the same is the case, O Muhammad, those people of this ’Ummah (nation) who has no Imam from Allah, the Most Holy, the Most High, who is in public and possessing the noble quality of justice. Such people are lost and straying. If such people would in such a condition their death would be like that of an unbeliever and hypocrite. O Muhammad, take notice that the unjust Imams and their followers are far away from the religion of Allah. They have lost the right path and have mislead the others. The deeds that they are like dust blown away by the winds in a stormy day. They would remain helpless and unable to benefit from their deeds. Such is straying far away from the right path.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/316)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 472,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/242",
              "text": "مُحَمَّدِ بْنِ جُمْهُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/583",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/584",
              "text": "الْهَيْثَمِ بْنِ وَاقِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/585",
              "text": "مُقَرِّنٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنِ الْهَيْثَمِ بْنِ وَاقِدٍ عَنْ مُقَرِّنٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:9",
        "relations": {
          "Mentions": [
            "/books/quran:7:46"
          ]
        },
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ جَاءَ ابْنُ الْكَوَّاءِ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ وَ عَلَى الْأَعْرافِ رِجالٌ يَعْرِفُونَ كُلًّا بِسِيماهُمْ فَقَالَ نَحْنُ عَلَى الْأَعْرَافِ نَعْرِفُ أَنْصَارَنَا بِسِيمَاهُمْ وَ نَحْنُ الْأَعْرَافُ الَّذِي لَا يُعْرَفُ اللَّهُ عَزَّ وَ جَلَّ إِلَّا بِسَبِيلِ مَعْرِفَتِنَا وَ نَحْنُ الْأَعْرَافُ يُعَرِّفُنَا اللَّهُ عَزَّ وَ جَلَّ يَوْمَ الْقِيَامَةِ عَلَى الصِّرَاطِ فَلَا يَدْخُلُ الْجَنَّةَ إِلَّا مَنْ عَرَفَنَا وَ عَرَفْنَاهُ وَ لَا يَدْخُلُ النَّارَ إِلَّا مَنْ أَنْكَرَنَا وَ أَنْكَرْنَاهُ ",
          "إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَوْ شَاءَ لَعَرَّفَ الْعِبَادَ نَفْسَهُ وَ لَكِنْ جَعَلَنَا أَبْوَابَهُ وَ صِرَاطَهُ وَ سَبِيلَهُ وَ الْوَجْهَ الَّذِي يُؤْتَى مِنْهُ فَمَنْ عَدَلَ عَنْ وَلَايَتِنَا أَوْ فَضَّلَ عَلَيْنَا غَيْرَنَا فَإِنَّهُمْ عَنِ الصِّرَاطِ لَنَاكِبُونَ ",
          "فَلَا سَوَاءٌ مَنِ اعْتَصَمَ النَّاسُ بِهِ وَ لَا سَوَاءٌ حَيْثُ ذَهَبَ النَّاسُ إِلَى عُيُونٍ كَدِرَةٍ يَفْرَغُ بَعْضُهَا فِي بَعْضٍ وَ ذَهَبَ مَنْ ذَهَبَ إِلَيْنَا إِلَى عُيُونٍ صَافِيَةٍ تَجْرِي بِأَمْرِ رَبِّهَا لَا نَفَادَ لَهَا وَ لَا انْقِطَاعَ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Abdullah Bin Abdul Rahman, from Al Haysam Bin Waqid, from Muqarrin who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Ibn Al-Kawwa came over to Amir Al-Momineen<sup>asws</sup> and he said, ‘O Amir Al-Momineen<sup>asws</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h46\">[7:46]</a> and upon the heights there shall be men recognising all by their marks</span>. So he<sup>asws</sup> said: ‘We<sup>asws</sup> would be upon the Heights. We<sup>asws</sup> would recognise our<sup>asws</sup> helpers by their marks, and we<sup>asws</sup> are the recognisers who, Allah<sup>azwj</sup> Mighty and Majestic cannot be recognised except by the way of our<sup>asws</sup> recognition, and we<sup>asws</sup> are the recognisers whom Allah<sup>azwj</sup> Mighty and Majestic would Introduce on the Day of Judgment upon the Bridge. Thus, none shall enter the Paradise except the one who recognises us and we<sup>asws</sup> recognise him, and none shall enter the Fire except the one who denies us<sup>asws</sup> and we<sup>asws</sup> deny him.",
            "Surely, if Allah<sup>azwj</sup> Blessed and High had Desired to, would have Introduce Himself<sup>azwj</sup> to the servant. But, He<sup>azwj</sup> Made us<sup>asws</sup> to be His<sup>azwj</sup> Door, and His<sup>azwj</sup> Bridge, and His<sup>azwj</sup> Way, and the Face which comes from Him<sup>azwj</sup>. So the one who turns away from our<sup>asws</sup> Wilayah, or prefers others over us<sup>asws</sup>, so they would be falling off from the Bridge. ",
            "So they are not equal, the one who clings to the people with it, nor is it the same where the people are going to the turbid springs, draining into each other, and the going of the one who comes over to us<sup>asws</sup>, to clear springs flowing by the Command of its Lord<sup>azwj</sup>, neither there being a depletion for it nor a termination’."
          ],
          "en.sarwar": [
            " 9. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from ‘Abdallah ibn ‘Abd al-Rahman from al-Haytham ibn Waqid from Muqrin who has said the following. “I heard abu ‘Abdallah (a.s.) saying, ‘Ibn al-Kawwa came to Amir al-Mu’minin (a.s.) and asked, “O Amir al-Mu’minin,(what do you say about; “There will be people on the Heights who know everyone by their faces . .” <a href=\"/#/books/quran:7#h46\">[7:46]</a>. The Imam said, “we will be on the Heights. We will recognize our supporters from their faces. We are the Heights without whose knowing there is no other way to know Allah, the Most Holy, the Most High. We are the Heights that Allah on the Day of Judgment will make known to everyone on the bridge. No one will enter paradise without knowing us and our knowing them. No one will enter hell except those would not know us and we will ignore them. If Allah, the Most Holy, the Most High, would want to let people know Him He may do so but He has made us the door to knowing Him, the bridge, the path and the aspect to Him. Whoever would deviate from our authority and guardianship or would consider others more excellent than us such people will down off the bridge. People are the same in following guidance. They are not equal with those who have found the sparkling fountains with those who have gathered around polluted waters that fall over other such waters. Such are not equal with those who have found the sparkling fountains that flow by the order of the Lord without ceasing and reduction.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/320)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 473,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/586",
              "text": "عَلِيِّ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/341",
              "text": "بَكْرِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/587",
              "text": "الرَّيَّانِ بْنِ شَبِيبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/175",
              "text": "أَبِي أَيُّوبَ الْخَزَّازِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الرَّيَّانِ بْنِ شَبِيبٍ عَنْ يُونُسَ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:10",
        "text": [
          " قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَا أَبَا حَمْزَةَ يَخْرُجُ أَحَدُكُمْ فَرَاسِخَ فَيَطْلُبُ لِنَفْسِهِ دَلِيلًا وَ أَنْتَ بِطُرُقِ السَّمَاءِ أَجْهَلُ مِنْكَ بِطُرُقِ الْأَرْضِ فَاطْلُبْ لِنَفْسِكَ دَلِيلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Muhammad, from Bakr Bin Salih, from Al Rayyan Bin Shabeeb, from Yunus, from Abu Ayoub Al Khazzaz, from Abu Hamza who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘O Abu Hamza! (When) one of you goes out for one <span class=\"iTxt\">Farsakh</span>, so he is seeking a navigator for himself, and you are more ignorant of the ways of the sky than the ways of the earth, therefore seek a navigator for yourself’."
          ],
          "en.sarwar": [
            " 10. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ali ibn muhammad from Bakr ibn Salih from al-Rayyan ibn Shabib from yunus from abu Ayyub al-Khazziz from abu Hamza who has narrated from Imam abu Ja’far‘far (a.s.) the following. “O abu Hamza, when one of decide to travel for just a few miles he first finds a guide and direction for himself. Your knowledge of the paths of heavens is much less than your knowledge of the paths of earth. You must find a guide for yourself.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/321)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 474,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/317",
              "text": "أَيُّوبَ بْنِ الْحُرِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي قَوْلِ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَيُّوبَ بْنِ الْحُرِّ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:11",
        "relations": {
          "Mentions": [
            "/books/quran:2:269",
            "/books/quran:2:273"
          ]
        },
        "text": [
          " اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً فَقَالَ طَاعَةُ اللَّهِ وَ مَعْرِفَةُ الْإِمَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ayoub Bin Al Hurr, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h269\">[2:269]</a> and whoever is Give the Wisdom, he indeed is Given a lot of good</span>. So he<sup>asws</sup> said: ‘Obedience to Allah<sup>azwj</sup> and the recognition of the Imam<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 11. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Ayyub al-Hurr from abu Basir from Imam abu ‘Abdallah (a.s.) who has said the following about the words of Allah ‘Whoever is given wisdom he has received a great deal of goodness’ <a href=\"/#/books/quran:2#h273\">[2:273]</a> “It means obedience to Allah and knowin who one’s Imam is.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (321/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 475,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/148",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/213",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:12",
        "text": [
          " قَالَ لِي أَبُو جَعْفَرٍ ( عليه السلام ) هَلْ عَرَفْتَ إِمَامَكَ قَالَ قُلْتُ إِي وَ اللَّهِ قَبْلَ أَنْ أَخْرُجَ مِنَ الْكُوفَةِ فَقَالَ حَسْبُكَ إِذاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Abdullah Bin Muhammad, from Ali Bin Al Hakam, from Aban, from Abu Baseer who said, ",
            "‘Abu Ja’far<sup>asws</sup> said to me: ‘Do you recognise your Imam<sup>asws</sup>?’ I said, ‘Yes, by Allah<sup>azwj</sup>, before I came out from Al-Kufa’. So he<sup>asws</sup> said: ‘Then it is sufficient for you’."
          ],
          "en.sarwar": [
            " 12. Muhammad ibn Yahya has narrated from ‘Abdallah ibn Muhammad from Ali ibn al-Hakam from aban from abu Basir saying that Imam abu Ja’far‘far (a.s.) said to him the following. “Have you found out who your Imam is?” I said, “Yes, I swear by Allah, I did so before I left Kufa.” The Imam (a.s.) said, “Then it is sufficient for you.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (321/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 476,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/259",
              "text": "مَنْصُورِ بْنِ يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/558",
              "text": "بُرَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ بُرَيْدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:13",
        "relations": {
          "Mentions": [
            "/books/quran:6:122"
          ]
        },
        "text": [
          " سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى أَ وَ مَنْ كانَ مَيْتاً فَأَحْيَيْناهُ وَ جَعَلْنا لَهُ نُوراً يَمْشِي بِهِ فِي النَّاسِ فَقَالَ مَيْتٌ لَا يَعْرِفُ شَيْئاً وَ نُوراً يَمْشِي بِهِ فِي النَّاسِ إِمَاماً يُؤْتَمُّ بِهِ ",
          "كَمَنْ مَثَلُهُ فِي الظُّلُماتِ لَيْسَ بِخارِجٍ مِنْها قَالَ الَّذِي لَا يَعْرِفُ الْإِمَامَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Mansour Bin Yunus, from Bureyd who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying regarding the Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h122\">[6:122]</a> Is he who was dead then We Raised him to life and Made for him a Light by which he walks among the people</span>. So he<sup>asws</sup> said: ‘The dead do not recognise anything, and <span class=\"ibTxt\">a Light by which he walks among the people</span> is an Imam<sup>asws</sup> he follows with’. ",
            "(And for) <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h122\">[6:122]</a> like him whose likeness is that of one in utter darkness whence he cannot come forth</span>, he<sup>asws</sup> said: ‘The one who does not recognise the Imam<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 13. Muhammad ibn Yahya has narrated from ahmad ibn Muhammad from Muhammad ibn Isma‘il from Mansur ibn Yunus from Burayd who has said that he heard Imam abu Ja’far (a.s.) said the following about the words of Allah, “Can the dead to whom We have given life and light so that they may walk among the people, be considered equal to those who can never come out of darkness?” <a href=\"/#/books/quran:6#h122\">[6:122]</a> The dead do not understand anything ‘The light by the help of which they walk’ is the Imam that they follow.’ “be considered equal to those who can never come out of darkness” applies to those who do not know who their Imam is.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/322)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 477,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/588",
              "text": "مُحَمَّدِ بْنِ أُورَمَةَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/105",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/324",
              "text": "عَلِيِّ بْنِ حَسَّانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ وَ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:7:14",
        "relations": {
          "Mentions": [
            "/books/quran:27:90",
            "/books/quran:27:89"
          ]
        },
        "text": [
          " قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) دَخَلَ أَبُو عَبْدِ اللَّهِ الْجَدَلِيُّ عَلَى أَمِيرِ الْمُؤْمِنِينَ فَقَالَ ( عليه السلام ) يَا أَبَا عَبْدِ اللَّهِ أَ لَا أُخْبِرُكَ بِقَوْلِ اللَّهِ عَزَّ وَ جَلَّ مَنْ جاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِنْها وَ هُمْ مِنْ فَزَعٍ يَوْمَئِذٍ آمِنُونَ. وَ مَنْ جاءَ بِالسَّيِّئَةِ فَكُبَّتْ وُجُوهُهُمْ فِي النَّارِ هَلْ تُجْزَوْنَ إِلَّا ما كُنْتُمْ تَعْمَلُونَ ",
          "قَالَ بَلَى يَا أَمِيرَ الْمُؤْمِنِينَ جُعِلْتُ فِدَاكَ فَقَالَ الْحَسَنَةُ مَعْرِفَةُ الْوَلَايَةِ وَ حُبُّنَا أَهْلَ الْبَيْتِ وَ السَّيِّئَةُ إِنْكَارُ الْوَلَايَةِ وَ بُغْضُنَا أَهْلَ الْبَيْتِ ثُمَّ قَرَأَ عَلَيْهِ هَذِهِ الْآيَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Awrama and Muhammad Bin Abdullah, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> said: ‘Abu Abdullah Al-Jadly came over to Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup>, so he<sup style=\"font-weight: normal\">asws</sup> said: ‘O Abu Abdullah! Shall I<sup style=\"font-weight: normal\">asws</sup> inform you with the Words of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:27#h89\">[27:89]</a> Whoever brings good, he shall have better than it; and they shall be secure from terror on the Day <a href=\"/#/books/quran:27#h90\">[27:90]</a> And whoever brings evil, these shall be thrown down on their faces into the Fire; will you be Recompensed except for what you had been doing?</span>",
            "He said, ‘Yes, O Amir Al-Momineen<sup>asws</sup>, may I be sacrificed for you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘The good is the recognition of the Wilayah and our<sup>asws</sup> love of the People<sup>asws</sup> of the Household, and the evil is the denial of the Wilayah and us<sup>asws</sup>, hatred of the People<sup>asws</sup> of the Household’. Then he<sup>asws</sup> recited these Verses’."
          ],
          "en.sarwar": [
            " 14. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn ’warma and Muhammad ibn ‘Abdallah from Ali ibn Hassan from ‘Abd al-Rahman ibn Kathir from Imam abu ‘Abdallah (a.s.) who has said the following. “Imam abu Ja’far (a.s.) has said, ‘Abu ‘Abdallah al-Jadali once came to Amir al-Mu’minin (a.s.). Amir al-mu’minin said to him, “O abu ‘Abdallah may I say something to you about the words of Allah, ‘Whoever does a good deed will receive a better reward than what he has done. He will be secure from the terror of the Day of Judgment <a href=\"/#/books/quran:27#h89\">[27:89]</a>. Those who commit evil will be thrown headlong into hell fire. (It will be said to them) can you expect any recompense other than what you deserve for your deeds?’ <a href=\"/#/books/quran:27#h90\">[27:90]</a> The man said, “yes, O Amir al-Mu’minin, please tell me, may Allah take my soul in service for your cause.” Amir al-Mu’mini said, “A good deed means is to acknowledge our Divine authority and have our love in one’s heart. Evil means denying our Divine authority and harboring in one’s heart hatered towards us.” Amir al-Mu’minin (a.s.) then read the verses to him."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:7",
  "kind": "verse_list"
}