{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 70"
        },
        "path": "/books/al-kafi:1:4:70",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي عَبْدِ اللَّهِ جَعْفَرِ بْنِ مُحَمَّدٍ الصَّادِقِ صَلَوَاتُ اللَّهِ عَلَيْهِمَا",
          "en": "Chapter 70 – The Indication and the wordings upon Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad Al-Sadiq<sup>asws</sup>"
        }
      }
    ],
    "index": 128,
    "local_index": 70,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 71"
        },
        "path": "/books/al-kafi:1:4:71",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي الْحَسَنِ مُوسَى ( عليه السلام )",
          "en": "Chapter 71 – The Indication and the wordings upon Abu Al-Hassan Musa<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 69"
        },
        "path": "/books/al-kafi:1:4:69",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي جَعْفَرٍ ( عليه السلام )",
          "en": "Chapter 69 – The Indication and the wordings upon Abu Ja’far<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:70",
    "titles": {
      "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي عَبْدِ اللَّهِ جَعْفَرِ بْنِ مُحَمَّدٍ الصَّادِقِ صَلَوَاتُ اللَّهِ عَلَيْهِمَا",
      "en": "Chapter 70 – The Indication and the wordings upon Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad Al-Sadiq<sup>asws</sup>"
    },
    "verse_count": 8,
    "verse_start_index": 787,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/325)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 788,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:70:1",
        "refs": {
          "Quran": [
            "/books/quran:28:5"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ نَظَرَ أَبُو جَعْفَرٍ ( عليه السلام ) إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَمْشِي فَقَالَ تَرَى هَذَا هَذَا مِنَ الَّذِينَ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ نُرِيدُ أَنْ نَمُنَّ عَلَى الَّذِينَ اسْتُضْعِفُوا فِي الْأَرْضِ وَ نَجْعَلَهُمْ أَئِمَّةً وَ نَجْعَلَهُمُ الْوارِثِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Usayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Aban Bin usman, from Abu Al Sabbah Al Kinany who said, ",
            "‘Abu Ja’far<sup>asws</sup> looked at Abu Abdullah<sup>asws</sup> walking, so he<sup>asws</sup> said: ‘Do you Know this one<sup>asws</sup>? This one<sup>asws</sup> is from those for whom Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:28#h5\">[28:5]</a> And We Wanted to Bestow a Favour upon those who were deemed weak in the land, and to make them the Imams, and to make them the heirs</span>’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from Aban ibn ‘Uthman from abu al-Sabbah al-Kinani who has said the following. “Abu Ja‘far (a.s.) looked at abu ‘Abdallah (a.s.) who was walking. The Imam (a.s.) said, ‘Do you see this (person)? This is of those about whom Allah, the Most Holy, the Most High, has said, “However, We have decided to grant a favor to the suppressed ones by appointing them leaders and heirs of the land,” <a href=\"/#/books/quran:28#h5\">[28:5]</a>:"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/326)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (35/ 1)"
        ],
        "index": 789,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:70:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا حَضَرَتْ أَبِي ( عليه السلام ) الْوَفَاةُ قَالَ يَا جَعْفَرُ أُوصِيكَ بِأَصْحَابِي خَيْراً قُلْتُ جُعِلْتُ فِدَاكَ وَ اللَّهِ لَأَدَعَنَّهُمْ وَ الرَّجُلُ مِنْهُمْ يَكُونُ فِي الْمِصْرِ فَلَا يَسْأَلُ أَحَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the death presented itself to my<sup>asws</sup> father<sup>asws</sup>, he<sup>asws</sup> said: ‘O Ja’far<sup>asws</sup>! I<sup>asws</sup> bequeath you<sup>asws</sup> to be good with my<sup>asws</sup> companions’. I said, ‘May I<sup>asws</sup> be sacrificed for you<sup>asws</sup>! By Allah<sup>azwj</sup>! I<sup>asws</sup> shall educate them (to the extent that), and the man from them would happen to be in the city, so he would not (need to) ask anyone (to know anything)’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from Hisham ibn Salim from abu ‘Abdallah (a.s.) who has said the following. “When myfather was about to leave this world he said, “O Ja‘far, I recommend you to be good to my companions.” I then said, “May Allah take my soul in service for your cause, by Allah, I will educated them as such that in any city where any of them would live he would not need to ask others for knowledge (of religion).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن على الظاهر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/326)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/36)"
        ],
        "index": 790,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:70:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْمُثَنَّى عَنْ سَدِيرٍ الصَّيْرَفِيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ مِنْ سَعَادَةِ الرَّجُلِ أَنْ يَكُونَ لَهُ الْوَلَدُ يَعْرِفُ فِيهِ شِبْهَ خَلْقِهِ وَ خُلُقِهِ وَ شَمَائِلِهِ وَ إِنِّي لَأَعْرِفُ مِنِ ابْنِي هَذَا شِبْهَ خَلْقِي وَ خُلُقِي وَ شَمَائِلِي يَعْنِي أَبَا عَبْدِ اللَّهِ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Al Musna, from Sadeyr Al Sayrafi who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘It is from the happiness of the man that there happens to be the son for him in whom he can recognise the resemblance of his own physical appearance in him and his mannerisms and his merits, and I<sup>asws</sup> recognise it from this son<sup>asws</sup> of mine<sup>asws</sup>, my<sup>asws</sup> physical appearance, and my<sup>asws</sup> mannerisms, and my<sup>asws</sup> merits’, meaning Abu Abdullah<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn al-Muthanna from Sadir al-Sayrafi who has said that he heard abu Ja‘far (a.s.) say the following. “It is part of the success of a man to have a child who is similar to his father physically, ethically and in good characters. I do not know anyone more similar to me physically, ethically and in good characters than this son of mine, (meaning thereby abu ‘Abdallah (a.s.)."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/327)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 791,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:70:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ طَاهِرٍ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) فَأَقْبَلَ جَعْفَرٌ ( عليه السلام ) فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) هَذَا خَيْرُ الْبَرِيَّةِ أَوْ أَخْيَرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, fom Tahir who said, ",
            "‘I was in the presence of Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> kissed Ja’far<sup>asws</sup>, and Abu Ja’far<sup>asws</sup> said: ‘This one<sup>asws</sup> is the best of the Created beings, or (even) better’."
          ],
          "en.sarwar": [
            " 4. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Tahir who has said the following. “Once I was in the presence of abu Ja‘far (a.s.) when Ja‘far (a.s.) came. Abu Ja‘far (a.s.) said, “This (Ja‘far ) is the best of the people or the best of best among them.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (327/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 792,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:70:5",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ طَاهِرٍ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) فَأَقْبَلَ جَعْفَرٌ ( عليه السلام ) فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) هَذَا خَيْرُ الْبَرِيَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Khalid, from one of our companions, from Yunus Bin Yaqoub, from Tahir who said, ",
            "‘I was in the presence of Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> kissed Ja’far<sup>asws</sup>, and Abu Ja’far<sup>asws</sup> said: ‘This one<sup>asws</sup> is the best of the Created beings’."
          ],
          "en.sarwar": [
            " 5.Ahmad ibn Muhammad has narrated from Muhammad ibn Khalid from some of our people from Yunus ibn Ya‘qub from Tahir who has said the following. “Once I was in the presence of abu Ja‘far (a.s.) when Ja‘far (a.s.) came. Abu Ja‘far (a.s.) said, “This (Ja‘far ) is the best of the people.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (327/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 793,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:70:6",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ فُضَيْلِ بْنِ عُثْمَانَ عَنْ طَاهِرٍ قَالَ كُنْتُ قَاعِداً عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) فَأَقْبَلَ جَعْفَرٌ ( عليه السلام ) فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) هَذَا خَيْرُ الْبَرِيَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Fuzayl Bin Usman, from Tahir who said, ",
            "‘I was seated in the presence of Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> kissed Ja’far<sup>asws</sup> and Abu Ja’far<sup>asws</sup> said: ‘This one<sup>asws</sup> is the best of the Created beings’."
          ],
          "en.sarwar": [
            " 6. Ahmad ibn Mihran has narrated from Muhammad ibn Ali from Fudayl ibn ‘Uthman from who has said the following. “Once I was in the presence of abu Ja‘far (a.s.) that Ja‘far (a.s.) came. Abu Ja‘far (a.s.) said, “This (Ja‘far) is the best of the people.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/328)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 794,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:70:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ جَابِرِ بْنِ يَزِيدَ الْجُعْفِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سُئِلَ عَنِ الْقَائِمِ ( عليه السلام ) فَضَرَبَ بِيَدِهِ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ هَذَا وَ اللَّهِ قَائِمُ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) ",
          "قَالَ عَنْبَسَةُ فَلَمَّا قُبِضَ أَبُو جَعْفَرٍ ( عليه السلام ) دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَأَخْبَرْتُهُ بِذَلِكَ فَقَالَ صَدَقَ جَابِرٌ ",
          "ثُمَّ قَالَ لَعَلَّكُمْ تَرَوْنَ أَنْ لَيْسَ كُلُّ إِمَامٍ هُوَ الْقَائِمَ بَعْدَ الْإِمَامِ الَّذِي كَانَ قَبْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Hisham Bin Salim, from Jabir Bin Yazeed Al Ju’fy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about Al-Qaim<sup>asws</sup>. So he<sup>asws</sup> struck his<sup>asws</sup> hand upon Abu Abdullah<sup>asws</sup> and he<sup>asws</sup> said: ‘This one<sup>asws</sup>, by Allah<sup>azwj</sup>, is a Qaim<sup>asws</sup> of the Progeny of Muhammad<sup>saww</sup>’. ",
            "Anbasa (a narrator) said, ‘So when Abu Ja’far<sup>asws</sup> passed away, I went over to Abu Abdullah<sup>asws</sup> and I informed him<sup>asws</sup> with that. So he<sup>asws</sup> said: ‘Jabir (the narrator) spoke the truth’. ",
            "Then he<sup>asws</sup> said: ‘Perhaps you all are viewing that it isn’t so. Every Imam<sup>asws</sup>, he<sup>asws</sup> is Al-Qaim<sup>asws</sup> after the Imam<sup>asws</sup> who was before him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Hisham ibn Salim from Jabur ibn Yazid al-Ju‘fiy who has said the following. “A question was asked (from abu Ja‘far (a.s.) about al-Qa’im (the twelfth Imam (a.s.). He (abu Ja‘far) tapped (at the shoulder of) abu ‘Abdallah (a.s.) and said, “This, by Allah, is the Qa’im (one who will establish the kingdom of Allah) of the family of Muhammad (s.a.).” ‘Anbasa has said, “when abu Ja‘far passed away, went to see abu ‘Abdallah (a.s.) and told him of what I had heard (from Jabur). The Imam (a.s.) said, “Jabur has spoken the truth.” He then said, “You perhaps think that the every succeeding Imam after a preceding Imam is not al-Qa’im (also meaning the one who obeys and serves Allah).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (328/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 795,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:70:8",
        "refs": {
          "Quran": [
            "/books/quran:2:132"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الْأَعْلَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أَبِي ( عليه السلام ) اسْتَوْدَعَنِي مَا هُنَاكَ فَلَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ ادْعُ لِي شُهُوداً فَدَعَوْتُ لَهُ أَرْبَعَةً مِنْ قُرَيْشٍ فِيهِمْ نَافِعٌ مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ ",
          "فَقَالَ اكْتُبْ هَذَا مَا أَوْصَى بِهِ يَعْقُوبُ بَنِيهِ يا بَنِيَّ إِنَّ اللَّهَ اصْطَفى لَكُمُ الدِّينَ فَلا تَمُوتُنَّ إِلَّا وَ أَنْتُمْ مُسْلِمُونَ وَ أَوْصَى مُحَمَّدُ بْنُ عَلِيٍّ إِلَى جَعْفَرِ بْنِ مُحَمَّدٍ وَ أَمَرَهُ أَنْ يُكَفِّنَهُ فِي بُرْدِهِ الَّذِي كَانَ يُصَلِّي فِيهِ الْجُمُعَةَ وَ أَنْ يُعَمِّمَهُ بِعِمَامَتِهِ وَ أَنْ يُرَبِّعَ قَبْرَهُ وَ يَرْفَعَهُ أَرْبَعَ أَصَابِعَ وَ أَنْ يَحُلَّ عَنْهُ أَطْمَارَهُ عِنْدَ دَفْنِهِ ",
          "ثُمَّ قَالَ لِلشُّهُودِ انْصَرِفُوا رَحِمَكُمُ اللَّهُ فَقُلْتُ لَهُ يَا أَبَتِ بَعْدَ مَا انْصَرَفُوا مَا كَانَ فِي هَذَا بِأَنْ تُشْهِدَ عَلَيْهِ فَقَالَ يَا بُنَيَّ كَرِهْتُ أَنْ تُغْلَبَ وَ أَنْ يُقَالَ إِنَّهُ لَمْ يُوصَ إِلَيْهِ فَأَرَدْتُ أَنْ تَكُونَ لَكَ الْحُجَّةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Abdul A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘My<sup>asws</sup> father<sup>asws</sup> entrusted me<sup>asws</sup> with whatever was there. So when the death presented itself to him<sup>asws</sup>, he<sup>asws</sup> said: ‘Call witnesses for me<sup>asws</sup>’. So I<sup>asws</sup> called four (people) from the Qureysh for him<sup>asws</sup>, among them was Nafi’u a slave of Abdullah Bin Umar. ",
            "So he<sup>asws</sup> said: ‘Write! This is what Yaqoub<sup>as</sup> bequeathed with to his<sup>as</sup> sons <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h132\">[2:132]</a> O my sons! Surely Allah has Chosen for you the Religion, therefore die not unless you are Muslims (submitters)</span>. And Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> is bequeathing to Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> and instructing him<sup>asws</sup> that he<sup>asws</sup> should enshroud him<sup>asws</sup> in his<sup>asws</sup> cloak which he<sup>asws</sup> used to pray the Friday <span class=\"iTxt\">Salat</span> in it, and that he<sup>asws</sup> should turban him<sup>asws</sup> with a turban, and that he<sup>asws</sup> should square his<sup>asws</sup> grave raising it to four fingers, and that he<sup>asws</sup> should loosen his<sup>asws</sup> shroud during his<sup>asws</sup> burial’. ",
            "Then he<sup>asws</sup> said to the witnesses: ‘You can leave, may Allah<sup>azwj</sup> have Mercy on you all’. So I said to him<sup>asws</sup> after they had left: ‘O father<sup>asws</sup>! It wasn’t regarding this that you<sup>asws</sup> got them to witness upon’. So he<sup>asws</sup> said: ‘O my<sup>asws</sup> son<sup>asws</sup>! I<sup>asws</sup> disliked you<sup>asws</sup> to be overcome, and that it should be said, ‘He<sup>asws</sup> did not bequeath to him<sup>asws</sup>’. So I<sup>asws</sup> wanted it to become a proof for you<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 8. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus ibn ‘Abd al-Rahman from ‘Abd al-A‘la from abu ‘Abdallah (a.s.) who has said the following. “My father entrusted me with all that is there (the sacred objects inherited from the prophets such as directive wills etc.). When he was about to leave this world, he asked me to call for him a few people to bear testimony. I then called for him four people from Quraysh among them was Nafi‘ Mawla ‘Abdallah ibn ‘Umar. He then said, “Write down: This is (like) what was the directive will of Jacob to his sons, “My sons, God has chosen this religion for you. You must not leave this world unless you are a Muslim (submitted to the will of the Lord of the Universe).” <a href=\"/#/books/quran:2#h132\">[2:132]</a>. Muhammad ibn Ali has recommended Ja‘far ibn Muhammad in his directive will and commands him to shroud him with his gown with which he would [erform his prayers on Fridays and prepare a turban for him out of his own turban. That he should shape his grave squirely and raise it four inches from the ground and open the knots of from all ends of his shroud when it is to bury him. Then he said to the testimony bearers, “You may go now, may Allah bless you.” I then asked him after they had left, “O father, you did not need to make a will for such matters.” He said, “My son, I did not like when you will be over come they would say, “No directive will was made in his favor.” I just wanted to establish a defence authority in your favor.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:70",
  "kind": "verse_list"
}