{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 72"
        },
        "path": "/books/al-kafi:1:4:72",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْإِشَارَةِ</span> وَ النَّصِّ عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )",
          "en": "Chapter 72 – The Indication and the wordings upon Abu Al-Hassan Al-Reza<sup>asws</sup>"
        }
      }
    ],
    "index": 130,
    "local_index": 72,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 73"
        },
        "path": "/books/al-kafi:1:4:73",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام )",
          "en": "Chapter 73 – The Indication and the wordings upon Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> (9<sup>th</sup> Imam<sup>asws</sup>)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 71"
        },
        "path": "/books/al-kafi:1:4:71",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي الْحَسَنِ مُوسَى ( عليه السلام )",
          "en": "Chapter 71 – The Indication and the wordings upon Abu Al-Hassan Musa<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:72",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْإِشَارَةِ</span> وَ النَّصِّ عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )",
      "en": "Chapter 72 – The Indication and the wordings upon Abu Al-Hassan Al-Reza<sup>asws</sup>"
    },
    "verse_count": 16,
    "verse_start_index": 811,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 812,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْحُسَيْنِ بْنِ نُعَيْمٍ الصَّحَّافِ قَالَ كُنْتُ أَنَا وَ هِشَامُ بْنُ الْحَكَمِ وَ عَلِيُّ بْنُ يَقْطِينٍ بِبَغْدَادَ فَقَالَ عَلِيُّ بْنُ يَقْطِينٍ كُنْتُ عِنْدَ الْعَبْدِ الصَّالِحِ جَالِساً فَدَخَلَ عَلَيْهِ ابْنُهُ عَلِيٌّ فَقَالَ لِي يَا عَلِيَّ بْنَ يَقْطِينٍ هَذَا عَلِيٌّ سَيِّدُ وُلْدِي أَمَا إِنِّي قَدْ نَحَلْتُهُ كُنْيَتِي فَضَرَبَ هِشَامُ بْنُ الْحَكَمِ بِرَاحَتِهِ جَبْهَتَهُ ثُمَّ قَالَ وَيْحَكَ كَيْفَ قُلْتَ فَقَالَ عَلِيُّ بْنُ يَقْطِينٍ سَمِعْتُ وَ اللَّهِ مِنْهُ كَمَا قُلْتُ فَقَالَ هِشَامٌ أَخْبَرَكَ أَنَّ الْأَمْرَ فِيهِ مِنْ بَعْدِهِ .",
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ الْحُسَيْنِ بْنِ نُعَيْمٍ الصَّحَّافِ قَالَ كُنْتُ عِنْدَ الْعَبْدِ الصَّالِحِ وَ فِي نُسْخَةِ الصَّفْوَانِيِّ قَالَ كُنْتُ أَنَا ثُمَّ ذَكَرَ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al Husayn Bin Nuaym Al Sahhaf who said, ",
            "‘I, and Hisham Bin Al-Hakam, and Ali Bin Yaqteen were at Baghdad, so Ali Bin Yaqteen said, ‘I was seated in the presence of Abd Al-Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), and his<sup>asws</sup> son<sup>asws</sup> Ali<sup>asws</sup> came over to him<sup>asws</sup>. So he<sup>asws</sup> said to me: ‘O Ali Bin Yaqteen! This Ali<sup>asws</sup>, is the chief of my<sup>asws</sup> children. As for I<sup>asws</sup>, I<sup>asws</sup> have gifted him<sup>asws</sup> my<sup>asws</sup> teknonym’. So Hisham Bin Al-Hakam touched his forehead by his palm, then said, ‘Woe be unto you! How?’ I said, ‘Ali Bin Yaqteen said he heard it, by Allah<sup>azwj</sup>, from him<sup>asws</sup> just as he said’. So Hisham said, ‘Did he inform you that the command (Imamate) is in him<sup>asws</sup> from after him<sup>asws</sup>?’ ",
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Al-Husayn Bin Nuaym Al-Sahhaf who said, ‘I was in the presence of Al-Abd Al-Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>)’. And in a copy of Al-Safwany, he said, ‘I was’, then mentioned similar to it."
          ],
          "en.sarwar": [
            " Ahmad ibn Mihran has narrated from Muhammad ibn Ali from al-Husayn ibn Nu‘aym al-Sahhaf who has said the following. “Once I was in the presence of the pious servant (of Allah).In al-Safwani manuscript it says, “I was then he relates the rest of the above hadith.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/342)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 813,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنْ نُعَيْمٍ الْقَابُوسِيِّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) أَنَّهُ قَالَ إِنَّ ابْنِي عَلِيّاً أَكْبَرُ وُلْدِي وَ أَبَرُّهُمْ عِنْدِي وَ أَحَبُّهُمْ إِلَيَّ وَ هُوَ يَنْظُرُ مَعِي فِي الْجَفْرِ وَ لَمْ يَنْظُرْ فِيهِ إِلَّا نَبِيٌّ أَوْ وَصِيُّ نَبِيٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muawiya Bin Hukeym, from Nuaym Al Qabousy, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> that he<sup>asws</sup> said: ‘My<sup>asws</sup> son<sup>asws</sup> Ali<sup>asws</sup> is the eldest of my<sup>asws</sup> children, and the more righteous of them in my<sup>asws</sup> presence, and the most beloved of them to me<sup>asws</sup>, and he<sup>asws</sup> looks into Al-Jaf’r with me<sup>asws</sup>, and none looks into it except for a Prophet<sup>as</sup> or a successor<sup>as</sup> of a Prophet<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 2. A number of our people has narrated from Ahmad ibn Muhammad from Mu‘awiya ibn Hakim from Nu‘aym al-Qabusi from abu al-Hassan (a.s.) who has said the following. “My son, Ali is the eldest of my sons and the most virtuous among them to me and the most beloved of them to me. He looks into the Jafr (a secret source of knowledge) with me. No one looks into it except a prophet or the executor of the will of a prophet.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/342)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 814,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:3",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ سِنَانٍ وَ إِسْمَاعِيلَ بْنِ عَبَّادٍ الْقَصْرِيِّ جَمِيعاً عَنْ دَاوُدَ الرَّقِّيِّ قَالَ قُلْتُ لِأَبِي إِبْرَاهِيمَ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنِّي قَدْ كَبِرَ سِنِّي فَخُذْ بِيَدِي مِنَ النَّارِ قَالَ فَأَشَارَ إِلَى ابْنِهِ أَبِي الْحَسَنِ ( عليه السلام ) فَقَالَ هَذَا صَاحِبُكُمْ مِنْ بَعْدِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Muhammad Bin Sinan and Ismail Bin Abbad Al Qasary, altogether from Dawood Al Raqqy who said, ",
            "‘I said to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I have aged a lot, so take my hand out from the fire’. So he<sup>asws</sup> gestured towards his<sup>asws</sup> son<sup>asws</sup> Abu Al-Hassan<sup>asws</sup>, and he<sup>asws</sup> said: ‘This one<sup>asws</sup> is your Master<sup>asws</sup> after me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Mihran has narrated from Muhammad ibn Ali from Muhammad ibn Sinan and Isma‘il ibn ‘Abbad al-Qasri, all from Dawud al-Raqqi who has said the following. “I said to abu Ibrahim (a.s.), ‘May Allah take my soul in service for your cause, I have become old, take my hand out of fire.” The narrator has said that the Imam (a.s.) pointed to his son, abu al-Hassan (a.s.) and then said, “This is your guardian after me.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/343)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 815,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:4",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنِ الْحَسَنِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) أَ لَا تَدُلُّنِي إِلَى مَنْ آخُذُ عَنْهُ دِينِي فَقَالَ هَذَا ابْنِي عَلِيٌّ إِنَّ أَبِي أَخَذَ بِيَدِي فَأَدْخَلَنِي إِلَى قَبْرِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا بُنَيَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ قَالَ إِنِّي جاعِلٌ فِي الْأَرْضِ خَلِيفَةً وَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ إِذَا قَالَ قَوْلًا وَفَى بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah, from Al Hassan, from Ibn Abu Umeyr, from Muhammad Bin Is’haq Bin Ammar, said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, ‘Will you<sup>asws</sup> not point me to the one<sup>asws</sup> from whom I should be taking my Religion?’ So he<sup>asws</sup> said: ‘This son<sup>asws</sup> of mine<sup>asws</sup>, Ali<sup>asws</sup>. My<sup>asws</sup> father<sup>asws</sup> grabbed me<sup>asws</sup> by my<sup>asws</sup> hand and took me<sup>asws</sup> to the grave of Rasool-Allah<sup>saww</sup> and he<sup>asws</sup> said: ‘O my<sup>asws</sup> son<sup>asws</sup>! Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[2:30] And when your Lord said to the Angels, I am going to Make a Caliph in the earth</span>, and surely when Allah<sup>azwj</sup> Mighty and Majestic Says (some) Words, He<sup>azwj</sup> Fulfils it’."
          ],
          "en.sarwar": [
            " 4. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad ibn ‘Abdallah from al-Hassan from ibn abu ‘Umayr from Muhammad ibn Ishaq ibn ‘Ammar who has said the following. “I said to abu al-Hassan the 1st (a.s.) Would you guide me to a person from whom would learn my religion.” He said, “This is my son Ali. My father took my hand until we were in the shrine of the Messenger of Allah and said, “My son, Allah, the Most Holy, the Most High, has said, “. . I am appointing someone as my deputy on earth,. .” (2:30) When Allah, the Most Holy, the Most High, says a word He keeps His word.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/343)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 816,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:5",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَسَنِ بْنِ الْحُسَيْنِ اللُّؤْلُؤِيِّ عَنْ يَحْيَى بْنِ عَمْرٍو عَنْ دَاوُدَ الرَّقِّيِّ قَالَ قُلْتُ لِأَبِي الْحَسَنِ مُوسَى ( عليه السلام ) إِنِّي قَدْ كَبِرَتْ سِنِّي وَ دَقَّ عَظْمِي وَ إِنِّي سَأَلْتُ أَبَاكَ ( عليه السلام ) فَأَخْبَرَنِي بِكَ فَأَخْبِرْنِي مَنْ بَعْدَكَ فَقَالَ هَذَا أَبُو الْحَسَنِ الرِّضَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Al Hassan Bin Al Husayn Al Luluie, frm Yahya Bin Amro, from Dawood Al Raqqy who said, ",
            "‘I said to Abu Al-Hassan Musa<sup>asws</sup>, ‘I have aged a lot and my bones are knocking, and I asked your<sup>asws</sup> father<sup>asws</sup>, so he<sup>asws</sup> informed me of you<sup>asws</sup>, therefore inform me of the one<sup>asws</sup> after you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘This, Abu Al-Hassan Al-Reza<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 5. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from al-Hassan ibn al-Husayn al-Lu’lu’i from Yahya ibn ‘Amr from Dawud al-Raqqi who has said the following. “I said to abu al-Hassan aMusa (a.s.), ‘I have grown old and my bones are weakening. I asked your father (a.s.) and he informed me about you. Would you also inform me (about the Imam after you).” The Imam (a.s.) said, “This abu al-Hassan al-Rida.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (343/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 817,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:6",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ زِيَادِ بْنِ مَرْوَانَ الْقَنْدِيِّ وَ كَانَ مِنَ الْوَاقِفَةِ قَالَ دَخَلْتُ عَلَى أَبِي إِبْرَاهِيمَ وَ عِنْدَهُ ابْنُهُ أَبُو الْحَسَنِ ( عليه السلام ) فَقَالَ لِي يَا زِيَادُ هَذَا ابْنِي فُلَانٌ كِتَابُهُ كِتَابِي وَ كَلَامُهُ كَلَامِي وَ رَسُولُهُ رَسُولِي وَ مَا قَالَ فَالْقَوْلُ قَوْلُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Ziyad Bin Marwan Al Qandy, and he was from the Waqifites, said, ",
            "‘I went over to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), and in his<sup>asws</sup> presence was his<sup>asws</sup> son<sup>asws</sup> Abu Al-Hassan<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘O Ziyad! This is my<sup>asws</sup> son<sup>asws</sup> so and so. His<sup>asws</sup> letters are my<sup>asws</sup> letters and his<sup>asws</sup> speech is my<sup>asws</sup> speech, and his<sup>asws</sup> messenger is my<sup>asws</sup> messenger, and whatever he<sup>asws</sup> says, so the (final) words are his<sup>asws</sup> words’."
          ],
          "en.sarwar": [
            " 6. Ahmad ibn Mihran has narrated from Muhammad ibn Ali from Ziyad ibn Marwan al-Qandi, from the Waqifa sect who has said the following. “Once I went to see abu Ibrahim at that time his son abu al-Hassan al-Rida was with him. The Imam (a.s.) said to me, “O Ziyad, this is my son so and so. His writing is my writing, his words are my words, his messenger is my messenger and the true words are his words.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/344)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 818,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:7",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ قَالَ حَدَّثَنِي الْمَخْزُومِيُّ وَ كَانَتْ أُمُّهُ مِنْ وُلْدِ جَعْفَرِ بْنِ أَبِي طَالِبٍ ( عليه السلام ) قَالَ بَعَثَ إِلَيْنَا أَبُو الْحَسَنِ مُوسَى ( عليه السلام ) فَجَمَعَنَا ثُمَّ قَالَ لَنَا أَ تَدْرُونَ لِمَ دَعَوْتُكُمْ فَقُلْنَا لَا فَقَالَ اشْهَدُوا أَنَّ ابْنِي هَذَا وَصِيِّي وَ الْقَيِّمُ بِأَمْرِي وَ خَلِيفَتِي مِنْ بَعْدِي مَنْ كَانَ لَهُ عِنْدِي دَيْنٌ فَلْيَأْخُذْهُ مِنِ ابْنِي هَذَا وَ مَنْ كَانَتْ لَهُ عِنْدِي عِدَةٌ فَلْيُنْجِزْهَا مِنْهُ وَ مَنْ لَمْ يَكُنْ لَهُ بُدٌّ مِنْ لِقَائِي فَلَا يَلْقَنِي إِلَّا بِكِتَابِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Muhammad Bin Al Fuzayl who said, ",
            "‘Al-Makhzoumy narrated to me, and it was so that his paternal uncle was from the children of Ja’far<sup>asws</sup> Bin Abu Talib<sup>asws</sup>. He said, ‘Abu Al-Hassan Musa<sup>asws</sup> sent for me. So we gathered ourselves, then said to us: ‘Do you know why I<sup>asws</sup> invited you all?’ So we said, ‘No’. So he<sup>asws</sup> said: ‘Bear witness that this son<sup>asws</sup> of mine<sup>asws</sup> is my<sup>asws</sup> successor<sup>asws</sup>, and the establisher of my<sup>asws</sup> commands, and my<sup>asws</sup> Caliph after me<sup>asws</sup>. The one who has a debt for him with me<sup>asws</sup>, so let him take it from this son<sup>asws</sup> of mine<sup>asws</sup>, and the one who had a promise for him with me<sup>asws</sup>, so let him have it fulfilled from him<sup>asws</sup>, and the one for whom it is inevitable that he must meet me<sup>asws</sup>, so he should not come to meet me<sup>asws</sup> except by his<sup>asws</sup> letter (Written authorisation)’."
          ],
          "en.sarwar": [
            " 7. Ahmad ibn Mihran has narrated from Muhammad ibn Ali from Muhammad ibn Fudayl who has said that al-Makhdhumi whose mother was one of the children of Ja‘far ibn abu Talib has narrated the following. “Abu al-Hassan Musa (a.s.) once called all of us to see him. We all gathered and then he said to us, “Do you know why have I called you?” We said, “We do not know.” He then said, “Bear testimony that this my son is the executor of my will, the director of my affairs and the succeeding Imam (a.s.). Whoever has a loan due on me should demand from my son, this one. To whoever I may have promised anything should also acquire from him. Whoever must see me must not come to see me with writing from him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (345/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 819,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:8",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ سِنَانٍ وَ عَلِيِّ بْنِ الْحَكَمِ جَمِيعاً عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ قَالَ خَرَجَتْ إِلَيْنَا أَلْوَاحٌ مِنْ أَبِي الْحَسَنِ ( عليه السلام ) وَ هُوَ فِي الْحَبْسِ عَهْدِي إِلَى أَكْبَرِ وُلْدِي أَنْ يَفْعَلَ كَذَا وَ أَنْ يَفْعَلَ كَذَا وَ فُلَانٌ لَا تُنِلْهُ شَيْئاً حَتَّى أَلْقَاكَ أَوْ يَقْضِيَ اللَّهُ عَلَيَّ الْمَوْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Muhammad Bin Sinan and Ali Bin Al Hakam, altogether from Al Husayn Bin Al Mukhtar who said, ",
            "‘The tablets (written parchments) from Abu Al-Hassan<sup>asws</sup> came out to us, and he<sup>asws</sup> was in the prison: ‘My<sup>asws</sup> Covenant it to the eldest of my<sup>asws</sup> sons, that he<sup>asws</sup> should do such and he<sup>asws</sup> should do such, and so and so will not attain anything until I<sup>asws</sup> meet up with you, or Allah<sup>azwj</sup> Ordains the death upon me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 8. Ahmad ibn Mihran has narrated from Muhammad ibn Ali from Muhammad ibn Sinan and Ali ibn al-Hakam all from al-Husayn ibn al-Mukhtar who has said the following. “Certain tablets came out to us from abu al-Hassan (a.s.), when he was in jail, that said, “My instructions and directives to my eldest son to do so and so. As far so and so is concerned, do not give him anything until I will meet you or Allah will decree otherwise.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/345)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 820,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ قَالَ خَرَجَ إِلَيْنَا مِنْ أَبِي الْحَسَنِ ( عليه السلام ) بِالْبَصْرَةِ أَلْوَاحٌ مَكْتُوبٌ فِيهَا بِالْعَرْضِ عَهْدِي إِلَى أَكْبَرِ وُلْدِي يُعْطَى فُلَانٌ كَذَا وَ فُلَانٌ كَذَا وَ فُلَانٌ كَذَا وَ فُلَانٌ لَا يُعْطَى حَتَّى أَجِي‏ءَ أَوْ يَقْضِيَ اللَّهُ عَزَّ وَ جَلَّ عَلَيَّ الْمَوْتَ إِنَّ اللَّهَ يَفْعَلُ مَا يَشَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdullah Bin Al Mugheira, from Al Husayn Bin Al Mukhtar who said, ",
            "‘The tablets (written parchments) came out to us from Abu Al-Hassan<sup>asws</sup> at Al-Basra wherein it was written width-wise: ‘My<sup>asws</sup> Covenant is to my<sup>asws</sup> eldest son<sup>asws</sup> that he<sup>asws</sup> should give to so and so, such, and to so and so, such, and to so and so he<sup>asws</sup> should not give until I<sup>asws</sup> come or Allah<sup>azwj</sup> Mighty and Majestic Ordains the death upon me<sup>asws</sup>. Surely, Allah<sup>azwj</sup> Does whatever He<sup>azwj</sup> so Desires to’."
          ],
          "en.sarwar": [
            " 9. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Abdallah ibn al-Mughirah from al-Husayn ibn al-Mukhtar who has said the following. “In Basra (wherein the Imam (a.s.) was imprisoned) certain tablets came out to us from abu al-Hassan (a.s.) on which, it was written horizontally, ‘My instructions and directives to the my eldest son (Ali ibn Musa al-Rida (a.s.) who should give such and such to so and so. As far so and so is concerned do not give him anything until I will come or Allah, the Most Holy, the Most High, will decree that I must die, Allah certainly does what He wills.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/346)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 821,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:10",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ ابْنِ مُحْرِزٍ عَنْ عَلِيِّ بْنِ يَقْطِينٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ كَتَبَ إِلَيَّ مِنَ الْحَبْسِ أَنَّ فُلَاناً ابْنِي سَيِّدُ وُلْدِي وَ قَدْ نَحَلْتُهُ كُنْيَتِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali , from Ibn Muhriz, from Ali Bin Yaqteen, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘He<sup>asws</sup> wrote to me from the prison: ‘So and so son<sup>asws</sup> of mine<sup>asws</sup> is the chief of my<sup>asws</sup> children, and<sup>asws</sup> have gifted my<sup>asws</sup> teknonym to him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 10. Ahmad ibn Mihran has narrated from Muhammad ibn Ali from ibn Muhriz from Ali ibn Yaqtin who has said the following. “Abu al-Hassan (a.s.) wrote to me from prison that so and so my son is the master and guardian of my children and I have gifted my own (Kunya, Arabic) surname.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/346)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 822,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:11",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِي عَلِيٍّ الْخَزَّازِ عَنْ دَاوُدَ بْنِ سُلَيْمَانَ قَالَ قُلْتُ لِأَبِي إِبْرَاهِيمَ ( عليه السلام ) إِنِّي أَخَافُ أَنْ يَحْدُثَ حَدَثٌ وَ لَا أَلْقَاكَ فَأَخْبِرْنِي مَنِ الْإِمَامُ بَعْدَكَ فَقَالَ ابْنِي فُلَانٌ يَعْنِي أَبَا الْحَسَنِ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Abu Al Al Khazzaz, from Dawood Bin Suleyman who said, ",
            "‘I said to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), ‘I fear that an occurrence (death) would occur and I shall not meet you<sup>asws</sup>, therefore inform me<sup>asws</sup>, who is the Imam<sup>asws</sup> after you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘My<sup>asws</sup> son<sup>asws</sup> so and so’, meaning Abu Al-Hassan<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 11. Ahmad ibn Mihran has narrated from Muhammad ibn Ali from Abu Ali al-Khazzaz from Dawud ibn Sulay who has said the following. “I said to abu Ibrahim (a.s.), “I am afraid that an incident may take place and I will not be able to see you, inform me who will be the Imam after you?” The Imam (a.s.) said, “My son, so and so, meaning thereby abu al-Hassan (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/346)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 823,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:12",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ سَعِيدِ بْنِ أَبِي الْجَهْمِ عَنِ النَّصْرِ بْنِ قَابُوسَ قَالَ قُلْتُ لِأَبِي إِبْرَاهِيمَ ( عليه السلام ) إِنِّي سَأَلْتُ أَبَاكَ ( عليه السلام ) مَنِ الَّذِي يَكُونُ مِنْ بَعْدِكَ فَأَخْبَرَنِي أَنَّكَ أَنْتَ هُوَ فَلَمَّا تُوُفِّيَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ذَهَبَ النَّاسُ يَمِيناً وَ شِمَالًا وَ قُلْتُ فِيكَ أَنَا وَ أَصْحَابِي فَأَخْبِرْنِي مَنِ الَّذِي يَكُونُ مِنْ بَعْدِكَ مِنْ وُلْدِكَ فَقَالَ ابْنِي فُلَانٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Saeed Bin Abu Al Jahm, from Al Nasr Bin Qabous who said, ",
            "‘I said to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), ‘I asked your<sup>asws</sup> father<sup>asws</sup> who is that who would happen to be from after you<sup>asws</sup>. So he<sup>asws</sup> informed me that you<sup>asws</sup> are him<sup>asws</sup>. So when Abu Abdullah<sup>asws</sup> passed away, the people went right and left, and I said regarding you<sup>asws</sup>, I and my companions. Therefore, inform me, who is the one who would happen to be from after you<sup>asws</sup> from your<sup>asws</sup> sons?’ So he<sup>asws</sup> said: ‘My<sup>asws</sup> son, so and so’."
          ],
          "en.sarwar": [
            " 12. Ahmad ibn Mihran has narrated from Muhammad ibn Ali from Sa‘id ibn abu al-Jahm from al-Nasr ibn Qabus who has said the following. “I said to abu Ibrahim (a.s.), ‘I asked your father, “Who will be (the Imam) after you? He informed me that you will be (the Imam after him). When abu ‘Abdallah (a.s.) left this world people went let and right and I said that I with my people are with you. Inform me who will be (the Imam) after you from your sons.” He (the Imam (a.s.) said, “My son so and so.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/346)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 824,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:13",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ الضَّحَّاكِ بْنِ الْأَشْعَثِ عَنْ دَاوُدَ بْنِ زُرْبِيٍّ قَالَ جِئْتُ إِلَى أَبِي إِبْرَاهِيمَ ( عليه السلام ) بِمَالٍ فَأَخَذَ بَعْضَهُ وَ تَرَكَ بَعْضَهُ فَقُلْتُ أَصْلَحَكَ اللَّهُ لِأَيِّ شَيْ‏ءٍ تَرَكْتَهُ عِنْدِي قَالَ إِنَّ صَاحِبَ هَذَا الْأَمْرِ يَطْلُبُهُ مِنْكَ فَلَمَّا جَاءَنَا نَعْيُهُ بَعَثَ إِلَيَّ أَبُو الْحَسَنِ ( عليه السلام ) ابْنُهُ فَسَأَلَنِي ذَلِكَ الْمَالَ فَدَفَعْتُهُ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Al Zahhak Bin Al Ash’as Bin Al Ash’ab, from Dawood Bin Zurby who said, ",
            "‘I went over to Abu Ibrahim<sup>asws</sup> with some wealth, so he<sup>asws</sup> took part of it and left part. So I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! For which thing (reason) did you<sup>asws</sup> leave it to be with me?’ He<sup>asws</sup> said: ‘The Master of this command (Imamate), would seek it from you<sup>asws</sup>’. So when his<sup>asws</sup> Obituary came to us, Abu Al-Hassan<sup>asws</sup>, his<sup>asws</sup> son<sup>asws</sup> sent a message to me, asking me for that wealth. So I handed it over to him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 13. Ahmad ibn Mihran has narrated from Muhammad ibn Ali from ad-Dahhak ibn al-Ash‘ath from Dawud ibn Zurbi who has said the following. “Once I went to deliver some property to abu Ibrahim (a.s.). He accepted some of it and left the others. I asked him, “May Allah keep you well, why have you left it with me?” He said, “The in charge of this task (Leadership with Divine Authority) will demand it from you.” When we heard the news of his (abu Ibrahim’s) death, abu al-Hassan sent his son to me asking for that property and I delivered it to him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق أيض ا   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/346)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 825,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:14",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِي الْحَكَمِ الْأَرْمَنِيِّ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرِ بْنِ أَبِي طَالِبٍ عَنْ يَزِيدَ بْنِ سَلِيطٍ الزَّيْدِيِّ قَالَ أَبُو الْحَكَمِ وَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عُمَارَةَ الْجَرْمِيُّ عَنْ يَزِيدَ بْنِ سَلِيطٍ قَالَ لَقِيتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) وَ نَحْنُ نُرِيدُ الْعُمْرَةَ فِي بَعْضِ الطَّرِيقِ فَقُلْتُ جُعِلْتُ فِدَاكَ هَلْ تُثْبِتُ هَذَا الْمَوْضِعَ الَّذِي نَحْنُ فِيهِ قَالَ نَعَمْ فَهَلْ تُثْبِتُهُ أَنْتَ قُلْتُ نَعَمْ إِنِّي أَنَا وَ أَبِي لَقِينَاكَ هَاهُنَا وَ أَنْتَ مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ مَعَهُ إِخْوَتُكَ فَقَالَ لَهُ أَبِي بِأَبِي أَنْتَ وَ أُمِّي أَنْتُمْ كُلُّكُمْ أَئِمَّةٌ مُطَهَّرُونَ وَ الْمَوْتُ لَا يَعْرَى مِنْهُ أَحَدٌ فَأَحْدِثْ إِلَيَّ شَيْئاً أُحَدِّثْ بِهِ مَنْ يَخْلُفُنِي مِنْ بَعْدِي فَلَا يَضِلَّ",
          "قَالَ نَعَمْ يَا أَبَا عَبْدِ اللَّهِ هَؤُلَاءِ وُلْدِي وَ هَذَا سَيِّدُهُمْ وَ أَشَارَ إِلَيْكَ وَ قَدْ عُلِّمَ الْحُكْمَ وَ الْفَهْمَ وَ السَّخَاءَ وَ الْمَعْرِفَةَ بِمَا يَحْتَاجُ إِلَيْهِ النَّاسُ وَ مَا اخْتَلَفُوا فِيهِ مِنْ أَمْرِ دِينِهِمْ وَ دُنْيَاهُمْ وَ فِيهِ حُسْنُ الْخُلُقِ وَ حُسْنُ الْجَوَابِ وَ هُوَ بَابٌ مِنْ أَبْوَابِ اللَّهِ عَزَّ وَ جَلَّ وَ فِيهِ أُخْرَى خَيْرٌ مِنْ هَذَا كُلِّهِ",
          "فَقَالَ لَهُ أَبِي وَ مَا هِيَ بِأَبِي أَنْتَ وَ أُمِّي قَالَ ( عليه السلام ) يُخْرِجُ اللَّهُ عَزَّ وَ جَلَّ مِنْهُ غَوْثَ هَذِهِ الْأُمَّةِ وَ غِيَاثَهَا وَ عَلَمَهَا وَ نُورَهَا وَ فَضْلَهَا وَ حِكْمَتَهَا خَيْرُ مَوْلُودٍ وَ خَيْرُ نَاشِئٍ يَحْقُنُ اللَّهُ عَزَّ وَ جَلَّ بِهِ الدِّمَاءَ وَ يُصْلِحُ بِهِ ذَاتَ الْبَيْنِ وَ يَلُمُّ بِهِ الشَّعْثَ وَ يَشْعَبُ بِهِ الصَّدْعَ وَ يَكْسُو بِهِ الْعَارِيَ وَ يُشْبِعُ بِهِ الْجَائِعَ وَ يُؤْمِنُ بِهِ الْخَائِفَ وَ يُنْزِلُ اللَّهُ بِهِ الْقَطْرَ وَ يَرْحَمُ بِهِ الْعِبَادَ",
          "خَيْرُ كَهْلٍ وَ خَيْرُ نَاشِئٍ قَوْلُهُ حُكْمٌ وَ صَمْتُهُ عِلْمٌ يُبَيِّنُ لِلنَّاسِ مَا يَخْتَلِفُونَ فِيهِ وَ يَسُودُ عَشِيرَتَهُ مِنْ قَبْلِ أَوَانِ حُلُمِهِ ",
          "فَقَالَ لَهُ أَبِي بِأَبِي أَنْتَ وَ أُمِّي وَ هَلْ وُلِدَ قَالَ نَعَمْ وَ مَرَّتْ بِهِ سِنُونَ ",
          "قَالَ يَزِيدُ فَجَاءَنَا مَنْ لَمْ نَسْتَطِعْ مَعَهُ كَلَاماً قَالَ يَزِيدُ فَقُلْتُ لِأَبِي إِبْرَاهِيمَ ( عليه السلام ) فَأَخْبِرْنِي أَنْتَ بِمِثْلِ مَا أَخْبَرَنِي بِهِ أَبُوكَ ( عليه السلام ) فَقَالَ لِي نَعَمْ إِنَّ أَبِي ( عليه السلام ) كَانَ فِي زَمَانٍ لَيْسَ هَذَا زَمَانَهُ فَقُلْتُ لَهُ فَمَنْ يَرْضَى مِنْكَ بِهَذَا فَعَلَيْهِ لَعْنَةُ اللَّهِ قَالَ فَضَحِكَ أَبُو إِبْرَاهِيمَ ضَحِكاً شَدِيداً ثُمَّ قَالَ أُخْبِرُكَ يَا أَبَا عُمَارَةَ",
          "إِنِّي خَرَجْتُ مِنْ مَنْزِلِي فَأَوْصَيْتُ إِلَى ابْنِي فُلَانٍ وَ أَشْرَكْتُ مَعَهُ بَنِيَّ فِي الظَّاهِرِ وَ أَوْصَيْتُهُ فِي الْبَاطِنِ فَأَفْرَدْتُهُ وَحْدَهُ وَ لَوْ كَانَ الْأَمْرُ إِلَيَّ لَجَعَلْتُهُ فِي الْقَاسِمِ ابْنِي لِحُبِّي إِيَّاهُ وَ رَأْفَتِي عَلَيْهِ وَ لَكِنْ ذَلِكَ إِلَى اللَّهِ عَزَّ وَ جَلَّ يَجْعَلُهُ حَيْثُ يَشَاءُ",
          "وَ لَقَدْ جَاءَنِي بِخَبَرِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ أَرَانِيهِ وَ أَرَانِي مَنْ يَكُونُ مَعَهُ وَ كَذَلِكَ لَا يُوصَى إِلَى أَحَدٍ مِنَّا حَتَّى يَأْتِيَ بِخَبَرِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ جَدِّي عَلِيٌّ صَلَوَاتُ اللَّهِ عَلَيْهِ وَ رَأَيْتُ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) خَاتَماً وَ سَيْفاً وَ عَصًا وَ كِتَاباً وَ عِمَامَةً",
          "فَقُلْتُ مَا هَذَا يَا رَسُولَ اللَّهِ فَقَالَ لِي أَمَّا الْعِمَامَةُ فَسُلْطَانُ اللَّهِ عَزَّ وَ جَلَّ وَ أَمَّا السَّيْفُ فَعِزُّ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ أَمَّا الْكِتَابُ فَنُورُ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ أَمَّا الْعَصَا فَقُوَّةُ اللَّهِ وَ أَمَّا الْخَاتَمُ فَجَامِعُ هَذِهِ الْأُمُورِ",
          "ثُمَّ قَالَ لِي وَ الْأَمْرُ قَدْ خَرَجَ مِنْكَ إِلَى غَيْرِكَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَرِنِيهِ أَيُّهُمْ هُوَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا رَأَيْتُ مِنَ الْأَئِمَّةِ أَحَداً أَجْزَعَ عَلَى فِرَاقِ هَذَا الْأَمْرِ مِنْكَ وَ لَوْ كَانَتِ الْإِمَامَةُ بِالْمَحَبَّةِ لَكَانَ إِسْمَاعِيلُ أَحَبَّ إِلَى أَبِيكَ مِنْكَ وَ لَكِنْ ذَلِكَ مِنَ اللَّهِ عَزَّ وَ جَلَّ",
          "ثُمَّ قَالَ أَبُو إِبْرَاهِيمَ وَ رَأَيْتُ وُلْدِي جَمِيعاً الْأَحْيَاءَ مِنْهُمْ وَ الْأَمْوَاتَ فَقَالَ لِي أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) هَذَا سَيِّدُهُمْ وَ أَشَارَ إِلَى ابْنِي عَلِيٍّ فَهُوَ مِنِّي وَ أَنَا مِنْهُ وَ اللَّهُ مَعَ الْمُحْسِنِينَ",
          "قَالَ يَزِيدُ ثُمَّ قَالَ أَبُو إِبْرَاهِيمَ ( عليه السلام ) يَا يَزِيدُ إِنَّهَا وَدِيعَةٌ عِنْدَكَ فَلَا تُخْبِرْ بِهَا إِلَّا عَاقِلًا أَوْ عَبْداً تَعْرِفُهُ صَادِقاً وَ إِنْ سُئِلْتَ عَنِ الشَّهَادَةِ فَاشْهَدْ بِهَا وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى أَهْلِها وَ قَالَ لَنَا أَيْضاً وَ مَنْ أَظْلَمُ مِمَّنْ كَتَمَ شَهادَةً عِنْدَهُ مِنَ اللَّهِ",
          "قَالَ فَقَالَ أَبُو إِبْرَاهِيمَ ( عليه السلام ) فَأَقْبَلْتُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقُلْتُ قَدْ جَمَعْتَهُمْ لِي بِأَبِي وَ أُمِّي فَأَيُّهُمْ هُوَ فَقَالَ هُوَ الَّذِي يَنْظُرُ بِنُورِ اللَّهِ عَزَّ وَ جَلَّ وَ يَسْمَعُ بِفَهْمِهِ وَ يَنْطِقُ بِحِكْمَتِهِ يُصِيبُ فَلَا يُخْطِئُ وَ يَعْلَمُ فَلَا يَجْهَلُ مُعَلَّماً حُكْماً وَ عِلْماً هُوَ هَذَا وَ أَخَذَ بِيَدِ عَلِيٍّ ابْنِي",
          "ثُمَّ قَالَ مَا أَقَلَّ مُقَامَكَ مَعَهُ فَإِذَا رَجَعْتَ مِنْ سَفَرِكَ فَأَوْصِ وَ أَصْلِحْ أَمْرَكَ وَ افْرُغْ مِمَّا أَرَدْتَ فَإِنَّكَ مُنْتَقِلٌ عَنْهُمْ وَ مُجَاوِرٌ غَيْرَهُمْ فَإِذَا أَرَدْتَ فَادْعُ عَلِيّاً فَلْيُغَسِّلْكَ وَ لْيُكَفِّنْكَ فَإِنَّهُ طُهْرٌ لَكَ وَ لَا يَسْتَقِيمُ إِلَّا ذَلِكَ وَ ذَلِكَ سُنَّةٌ قَدْ مَضَتْ فَاضْطَجِعْ بَيْنَ يَدَيْهِ وَ صُفَّ إِخْوَتَهُ خَلْفَهُ وَ عُمُومَتَهُ وَ مُرْهُ فَلْيُكَبِّرْ عَلَيْكَ تِسْعاً فَإِنَّهُ قَدِ اسْتَقَامَتْ وَصِيَّتُهُ وَ وَلِيَكَ وَ أَنْتَ حَيٌّ ثُمَّ اجْمَعْ لَهُ وُلْدَكَ مِنْ بَعْدِهِمْ فَأَشْهِدْ عَلَيْهِمْ وَ أَشْهِدِ اللَّهَ عَزَّ وَ جَلَّ وَ كَفَى بِاللَّهِ شَهِيداً ",
          "قَالَ يَزِيدُ ثُمَّ قَالَ لِي أَبُو إِبْرَاهِيمَ ( عليه السلام ) إِنِّي أُؤْخَذُ فِي هَذِهِ السَّنَةِ وَ الْأَمْرُ هُوَ إِلَى ابْنِي عَلِيٍّ سَمِيِّ عَلِيٍّ وَ عَلِيٍّ فَأَمَّا عَلِيٌّ الْأَوَّلُ فَعَلِيُّ بْنُ أَبِي طَالِبٍ وَ أَمَّا الْآخِرُ فَعَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) أُعْطِيَ فَهْمَ الْأَوَّلِ وَ حِلْمَهُ وَ نَصْرَهُ وَ وُدَّهُ وَ دِينَهُ وَ مِحْنَتَهُ وَ مِحْنَةَ الْآخِرِ وَ صَبْرَهُ عَلَى مَا يَكْرَهُ وَ لَيْسَ لَهُ أَنْ يَتَكَلَّمَ إِلَّا بَعْدَ مَوْتِ هَارُونَ بِأَرْبَعِ سِنِينَ",
          "ثُمَّ قَالَ لِي يَا يَزِيدُ وَ إِذَا مَرَرْتَ بِهَذَا الْمَوْضِعِ وَ لَقِيتَهُ وَ سَتَلْقَاهُ فَبَشِّرْهُ أَنَّهُ سَيُولَدُ لَهُ غُلَامٌ أَمِينٌ مَأْمُونٌ مُبَارَكٌ وَ سَيُعْلِمُكَ أَنَّكَ قَدْ لَقِيتَنِي فَأَخْبِرْهُ عِنْدَ ذَلِكَ أَنَّ الْجَارِيَةَ الَّتِي يَكُونُ مِنْهَا هَذَا الْغُلَامُ جَارِيَةٌ مِنْ أَهْلِ بَيْتِ مَارِيَةَ جَارِيَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أُمِّ إِبْرَاهِيمَ فَإِنْ قَدَرْتَ أَنْ تُبَلِّغَهَا مِنِّي السَّلَامَ فَافْعَلْ ",
          "قَالَ يَزِيدُ فَلَقِيتُ بَعْدَ مُضِيِّ أَبِي إِبْرَاهِيمَ ( عليه السلام ) عَلِيّاً ( عليه السلام ) فَبَدَأَنِي فَقَالَ لِي يَا يَزِيدُ مَا تَقُولُ فِي الْعُمْرَةِ فَقُلْتُ بِأَبِي أَنْتَ وَ أُمِّي ذَلِكَ إِلَيْكَ وَ مَا عِنْدِي نَفَقَةٌ فَقَالَ سُبْحَانَ اللَّهِ مَا كُنَّا نُكَلِّفُكَ وَ لَا نَكْفِيكَ فَخَرَجْنَا حَتَّى انْتَهَيْنَا إِلَى ذَلِكَ الْمَوْضِعِ فَابْتَدَأَنِي فَقَالَ يَا يَزِيدُ إِنَّ هَذَا الْمَوْضِعَ كَثِيراً مَا لَقِيتَ فِيهِ جِيرَتَكَ وَ عُمُومَتَكَ قُلْتُ نَعَمْ ",
          "ثُمَّ قَصَصْتُ عَلَيْهِ الْخَبَرَ فَقَالَ لِي أَمَّا الْجَارِيَةُ فَلَمْ تَجِئْ بَعْدُ فَإِذَا جَاءَتْ بَلَّغْتُهَا مِنْهُ السَّلَامَ فَانْطَلَقْنَا إِلَى مَكَّةَ فَاشْتَرَاهَا فِي تِلْكَ السَّنَةِ فَلَمْ تَلْبَثْ إِلَّا قَلِيلًا حَتَّى حَمَلَتْ فَوَلَدَتْ ذَلِكَ الْغُلَامَ",
          "قَالَ يَزِيدُ وَ كَانَ إِخْوَةُ عَلِيٍّ يَرْجُونَ أَنْ يَرِثُوهُ فَعَادُونِي إِخْوَتُهُ مِنْ غَيْرِ ذَنْبٍ فَقَالَ لَهُمْ إِسْحَاقُ بْنُ جَعْفَرٍ وَ اللَّهِ لَقَدْ رَأَيْتُهُ وَ إِنَّهُ لَيَقْعُدُ مِنْ أَبِي إِبْرَاهِيمَ بِالْمَجْلِسِ الَّذِي لَا أَجْلِسُ فِيهِ أَنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Abu Al Hakam Al Armany who said, ‘Abdullah Bin Ibrahim Bin Ali Bin Abdullah Bin Ja’far Bin Abu Talib, from Yazeed Bin Saley Al Zaydi who said, ‘Abu Al Hakam said and Abdullah Bin Muhammad Bin Umara Al Jarmy informed me, from Yazeed Bin Saleyt who said, ",
            "‘I met Abu Ibrahim<sup>asws</sup> in one of the roads and we intended (performance of) Umrah. So I said, ‘May I be sacrificed for you<sup>asws</sup>! Do you realise this place which we are in?’ He<sup>asws</sup> said: ‘Yes, so do you realise it (as well)?’ I said, ‘Yes, because I and my father, we met you<sup>asws</sup>, we met you<sup>asws</sup> over here and you<sup>asws</sup> were with Abu Abdullah<sup>asws</sup>, and with him<sup>asws</sup> were your<sup>asws</sup> brothers. So my father said to him<sup>asws</sup>, ‘May my father and my mother die for you! You<sup>asws</sup> are all Purified Imams<sup>asws</sup>, and the death, no one is immune from it. So if there occurs an occurrence (of death) to me, whom would my descendants refer to after me so that they do not stray?’ ",
            "He<sup>asws</sup> said: ‘Yes, O Abdullah! These are my<sup>asws</sup> children and this one<sup>asws</sup> is their chief’, and he<sup>asws</sup> gestured towards you<sup>asws</sup>, and he<sup>asws</sup> is known for the judgements, and the understanding, and the generosity, and the recognition of what the people would be needy to him<sup>asws</sup> for, and what they are differing in from the matters of their Religion and their world, and in him<sup>asws</sup> are the good morals, and the good answers, and he<sup>asws</sup> is a door from the doors of Allah<sup>azwj</sup> Mighty and Majestic, and in him<sup>asws</sup> is other, better than all of this’. ",
            "So my father said to him<sup>asws</sup>, ‘And what is it? May my father and my mother be (sacrificed) for you<sup>asws</sup>!’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic would Bring about from him<sup>asws</sup>, the relief of this community, and its blossoms, and its banners, and its light, and its merits, and its wisdom. He<sup>azwj</sup> would have the best of ‘مَوْلُودٍ’ (coming to world) and the best of the growths. Allah<sup>azwj</sup> Mighty and Majestic would Save the blood by him<sup>asws</sup> and Reconcile by him<sup>asws</sup> between two parties, and Gather by him<sup>asws</sup> the diversities, and Bridge by him<sup>asws</sup> the rifts, and Clothe by him<sup>asws</sup> the bare, and Feed by him<sup>asws</sup> the hungry, and Secure by him<sup>asws</sup> the fearful, and Allah<sup>azwj</sup> would Send down the drops (rain) due to him<sup>asws</sup>, and have Mercy on the servants due to him<sup>asws</sup>.",
            "He<sup>asws</sup> would be the best of the elderly and the best of the budding (youths). His<sup>asws</sup> words would be wisdom and his<sup>asws</sup> silence - the knowledge. He<sup>asws</sup> would clarify to the people whatever they would be differing in, and he<sup>asws</sup> would be assisting his<sup>asws</sup> claim from before his<sup>asws</sup> attainment of the adulthood’. ",
            "So my father said to him<sup>asws</sup>, ‘May my father and my mother be (sacrificed) for you<sup>asws</sup>! And has he<sup>asws</sup> been born yet?’ He<sup>asws</sup> said: ‘Yes, and years have passed’. ",
            "Yazeed said, ‘So there came to us one who we did not have the leeway of speaking (in his presence)’. Yazeed said, ‘Then I said to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), ‘So (now) you<sup>asws</sup> inform me with similar to what your<sup>asws</sup> father<sup>asws</sup> informed me with’. So he<sup>asws</sup> said to me: ‘Yes. My<sup>asws</sup> father<sup>asws</sup> was in an era, (but) this isn’t his<sup>asws</sup> era’. So I said to him<sup>asws</sup>, ‘So whoever is pleased from you<sup>asws</sup> with this (much only), so upon him is the Curse of Allah<sup>azwj</sup>’. So Abu Ibrahim<sup>asws</sup> laughed intensely, then said: ‘I<sup>asws</sup> shall inform you, O Abu Umara! ",
            "I<sup>asws</sup> came out from my<sup>asws</sup> house, so I<sup>asws</sup> bequeathed to my<sup>asws</sup> son<sup>asws</sup> so and so, and I<sup>asws</sup> participated with him<sup>asws</sup> my<sup>asws</sup> (other) sons regarding the apparent, and I<sup>asws</sup> bequeathed to him<sup>asws</sup> in the hidden, alone, and had the matter been to me<sup>asws</sup>, I<sup>asws</sup> would have made it to be in Al-Qasim, my<sup>asws</sup> son, due to my<sup>asws</sup> love for him and my<sup>asws</sup> kindness upon him. But, that is up to Allah<sup>azwj</sup> Mighty and Majestic. He<sup>azwj</sup> Makes it to be wherever He<sup>azwj</sup> so Desires to. ",
            "And Rasool-Allah<sup>saww</sup> had come to me<sup>asws</sup> with his<sup>asws</sup> news, then he<sup>saww</sup> showed him<sup>asws</sup> to me<sup>asws</sup>, and I<sup>asws</sup> saw the ones who would be with him<sup>asws</sup>. And like that it is. Not one of us<sup>asws</sup> can be bequeath until Rasool-Allah<sup>saww</sup> comes with his<sup>asws</sup> news, and my<sup>asws</sup> grandfather<sup>asws</sup> Ali<sup>asws</sup>. And I<sup>asws</sup> saw with Rasool-Allah<sup>saww</sup>, his<sup>saww</sup> ring, and his<sup>saww</sup> sword, and his<sup>saww</sup> staff, and his<sup>saww</sup> Book, and his<sup>saww</sup> turban. ",
            "So I<sup>asws</sup> said: ‘What is this, O Rasool-Allah<sup>saww</sup>?’ So he<sup>saww</sup> said to me: ‘As for the turban, so it is the Authority of Allah<sup>azwj</sup> Mighty and Majestic, and as for the sword, so it is the Might of Allah<sup>azwj</sup> Blessed and High, and as for the Book, so it is the Light of Allah<sup>azwj</sup> Blessed and High, and as for the Staff, so it is the Strength of Allah<sup>azwj</sup>, and as for the ring, so it is the entirety of these matters’. ",
            "Then he<sup>saww</sup> said to me: ‘And the command (Imamate) has come out from you<sup>asws</sup> to other than you<sup>asws</sup>’. So I<sup>asws</sup> said, ‘O Rasool-Allah<sup>saww</sup>! Show me<sup>asws</sup>, which of them is he<sup>asws</sup>?’ So Rasool-Allah<sup>saww</sup> said: ‘I<sup>saww</sup> have not seen anyone from the Imams<sup>asws</sup> anyone more apprehensive upon the separation of this command than you<sup>asws</sup>, and had the Imamate been with the love, it was so that Ismail was more beloved to your<sup>asws</sup> father<sup>asws</sup> than you<sup>asws</sup> were, but that is from Allah<sup>azwj</sup> Mighty and Majestic’. ",
            "Then Abu Ibrahim<sup>asws</sup> said: ‘And I<sup>asws</sup> saw my<sup>asws</sup> children altogether, the living ones from them and the deceased. So Amir Al-Momineen<sup>asws</sup> said to me: ‘This one is their chief’, and he<sup>asws</sup> gestured towards my<sup>asws</sup> son<sup>asws</sup> Ali<sup>asws</sup>, ‘So he<sup>asws</sup> is from me<sup>asws</sup> and I<sup>asws</sup> am from him<sup>asws</sup>, and Allah<sup>asws</sup> is with the good doers’.",
            "Yazeed said, ‘Then Abu Ibrahim<sup>asws</sup> said: ‘O Yazeed! It is a deposit with you, therefore do not inform with it to anyone except an intellectual, or a servants whose sincerity you recognise, and if you are asked about the witnessing, so testify with it, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:58] Surely Allah Commands you to make over trusts to their owners</span>. And He<sup>azwj</sup> Said to us as well <span class=\"ibTxt\">[2:140] And who is more unjust than he who conceals a testimony that he has from Allah?</span>’",
            "He (the narrator) said, ‘So Abu Ibrahim<sup>asws</sup> said: ‘So I<sup>asws</sup> turned towards Rasool-Allah<sup>azwj</sup>, and I<sup>asws</sup> said: ‘You<sup>saww</sup> have gathered them for me<sup>asws</sup>. By my<sup>asws</sup> father<sup>asws</sup> and my<sup>asws</sup> mother, so which of them is he<sup>asws</sup>?’ So he<sup>saww</sup> said: ‘He<sup>asws</sup> is the one who looks by the Light of Allah<sup>azwj</sup> Mighty and Majestic, and he<sup>asws</sup> hears by His<sup>azwj</sup> Understanding, and he<sup>asws</sup> speaks by His<sup>azwj</sup> Wisdom. He<sup>asws</sup> gets its right and he<sup>asws</sup> does not err, and he<sup>asws</sup> knows and he<sup>asws</sup> is not ignorant. He<sup>asws</sup> is Taught the Wisdom and the Knowledge. He<sup>asws</sup> is this one’, and he<sup>saww</sup> grabbed the hand of Ali<sup>asws</sup>, my<sup>asws</sup> son<sup>asws</sup>’. ",
            "Then he<sup>saww</sup> said: ‘How little is your<sup>asws</sup> remaining with him<sup>asws</sup>. So when you<sup>asws</sup> return from your<sup>asws</sup> journey, so bequeath, and correct your<sup>asws</sup> affairs, and be free from whatever you want, so you<sup>asws</sup> would be transferring from them and be in the vicinity of other than them. So whenever you<sup>asws</sup> want, so call Ali<sup>asws</sup>, so let him<sup>asws</sup> wash you<sup>asws</sup>, and let him<sup>asws</sup> enshroud you<sup>asws</sup>, for it would be cleaner for you<sup>asws</sup>, and nothing is straight except for that, and that is a Sunnah of the past. Then recline in front of him<sup>asws</sup>, and form rows of his<sup>asws</sup> brothers behind him, and his<sup>asws</sup> being a prayer leader, and instruct him<sup>asws</sup>, so let him exclaim <span class=\"iTxt\">Takbeer</span> upon you<sup>asws</sup>, nine (exclamations), so it would he established your<sup>asws</sup> bequest and your<sup>asws</sup> Guardian, while you<sup>asws</sup> are alive. Then gather your<sup>asws</sup> sons for him<sup>asws</sup>, from after him<sup>asws</sup>, so get them to bear witness, and keep Allah<sup>azwj</sup> Mighty and Majestic as a Witness, and Allah<sup>azwj</sup> Suffices as a Witness’. ",
            "Yazeed said, ‘Then Abu Ibrahim<sup>asws</sup> said to me: ‘I<sup>asws</sup> would be Taken during this year and the command (Imamate), it would be with my<sup>asws</sup> son<sup>asws</sup> Ali<sup>asws</sup>. He<sup>asws</sup> was named by Ali<sup>asws</sup> and Ali<sup>asws</sup>. So as for the first Ali<sup>asws</sup>, so it is Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and as for the other Ali<sup>asws</sup>, so it is Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>. He<sup>asws</sup> has been Given the understanding of the first one, and his<sup>asws</sup> forbearance, and his<sup>asws</sup> victory, and his<sup>asws</sup> cordiality, and his<sup>asws</sup> Religion, and his<sup>asws</sup> loved, and his<sup>asws</sup> ordeals and the ordeals of the other, and his<sup>asws</sup> patience upon what he<sup>asws</sup> dislikes, and it isn’t for him<sup>asws</sup> that he<sup>asws</sup> speaks except after the death of Haroun (Al-Rashid the Caliph) by four years’. ",
            "Then, he<sup>asws</sup> said to me: ‘O Yazeed! And when you pass by this place and meet him<sup>asws</sup>, and you shall be meeting him<sup>asws</sup>, so give him<sup>asws</sup> the glad tidings that a boy would be born unto him<sup>asws</sup> trustworthy, secure, Blessed, and he<sup>asws</sup> would be letting you know that you had met me<sup>asws</sup>. So inform him<sup>asws</sup> during that, that the slave girl which this boy would happen to be from, is a slave girl from the Household of Maria (the Coptic), the slave girl of Rasool-Allah<sup>saww</sup>, the mother of Ibrahim<sup>as</sup> (son<sup>as</sup> of Rasool-Allah<sup>saww</sup>). So if you are able to deliver the greetings from me<sup>asws</sup>, then do so’. ",
            "Yazeed said, ‘So I saw Ali<sup>asws</sup> after the passing away of Abu Ibrahim<sup>asws</sup>, so he<sup>asws</sup> initiated me by saying to me: ‘O Yazeed! What are you saying regarding (performing) the Umra?’ So I said, ‘By my father and my mother being for you<sup>asws</sup>! That is up to you<sup>asws</sup>, and there is no expenditure money with me’. So he<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>!  We<sup>asws</sup> would not encumber you and not suffice you’. So we went out until we ended up to that very place. So he<sup>asws</sup> initiated me saying, ‘O Yaeed!  This place is where you frequently meet your neighbours and your uncles in’. I said, ‘Yes’. ",
            "Then I related the news upon him<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘As for the slave girl, so she has not come yet. So when she does come, deliver to her the greetings from him<sup>asws</sup>’. So we went to Makkah and acquired her during that year. So she did not remain except for a little before she started expecting and gave birth to that boy.",
            "Yazeed said, ‘And it was so that the brothers of Ali<sup>asws</sup> were hoping to inherit him<sup>asws</sup>, so his<sup>asws</sup> brothers were hostile to me with any sin (wrongdoing from me). So Is’haq Bin Ja’far said to them, ‘By Allah<sup>azwj</sup>! I have seen him and he used to (make) him (sit) near to Abu Ibrahim<sup>asws</sup> in the gathering which I could not sit it’."
          ],
          "en.sarwar": [
            " “The the Imam (a.s.) said, “O Yazid, when ever you will pass through this place and meet and you will soon meet himgive him the glad news of the birth of trust worthy son to him, a protected and holy one. He will inform you of your meeting with me. You then inform him that the girl from whom this boy will be born is a girl from the family of Mary (Maria), the maiden girl of the Messenger of Allah, mother of Ibrahim. If will be able to convey my greetings to her you may do so.” Yazid has said, “After the death of abu Ibrahim I met Ali (al-Rida) (a.s.) and he began to speak to me.” He said, “O Yazid, “What do you say about performing ‘Umra (visit to Makka out of Hajj season)?” I said, “May Allah take my soul and the souls of my parents in service for your cause, it is up to you. I do not have the means to journey.” The Imam (a.s.) said, “Glory belongs to Allah, We would not have asked you without first taking the rsponsibility for your exoenses.” We then left for ‘Umra until we reached that place. The Imam (a.s.) began to speak and he said, “This is the place wherein you would meet your neighbors and uncles very often.” I said, “Yes, it is true and then I related to him the story.” He then said to me, “The girl has not come as yet. When she will come I will convey his greetings to her.” Then we left for Makka and he bought her that year. Shortly afterwards she give borth to the that boy.” Yazid has said, “Brothers of Ali (al-Rida) wanted to have a part in the leadership and they became my enemies for no good reason. Ishaq ibn Ja‘far told them, by Allah, I have seen him sit so near to abu Ibrahim that even I could sit so close.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (358/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 826,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:15",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِي الْحَكَمِ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ الْجَعْفَرِيُّ وَ عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عُمَارَةَ عَنْ يَزِيدَ بْنِ سَلِيطٍ قَالَ لَمَّا أَوْصَى أَبُو إِبْرَاهِيمَ ( عليه السلام ) أَشْهَدَ إِبْرَاهِيمَ بْنَ مُحَمَّدٍ الْجَعْفَرِيَّ وَ إِسْحَاقَ بْنَ مُحَمَّدٍ الْجَعْفَرِيَّ وَ إِسْحَاقَ بْنَ جَعْفَرِ بْنِ مُحَمَّدٍ وَ جَعْفَرَ بْنَ صَالِحٍ وَ مُعَاوِيَةَ الْجَعْفَرِيَّ وَ يَحْيَى بْنَ الْحُسَيْنِ بْنِ زَيْدِ بْنِ عَلِيٍّ وَ سَعْدَ بْنَ عِمْرَانَ الْأَنْصَارِيَّ وَ مُحَمَّدَ بْنَ الْحَارِثِ الْأَنْصَارِيَّ وَ يَزِيدَ بْنَ سَلِيطٍ الْأَنْصَارِيَّ وَ مُحَمَّدَ بْنَ جَعْفَرِ بْنِ سَعْدٍ الْأَسْلَمِيَّ وَ هُوَ كَاتِبُ الْوَصِيَّةِ ",
          "الْأُولَى أَشْهَدَهُمْ أَنَّهُ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ وَ أَنَّ السَّاعَةَ آتِيَةٌ لَا رَيْبَ فِيهَا وَ أَنَّ اللَّهَ يَبْعَثُ مَنْ فِي الْقُبُورِ وَ أَنَّ الْبَعْثَ بَعْدَ الْمَوْتِ حَقٌّ وَ أَنَّ الْوَعْدَ حَقٌّ وَ أَنَّ الْحِسَابَ حَقٌّ وَ الْقَضَاءَ حَقٌّ وَ أَنَّ الْوُقُوفَ بَيْنَ يَدَيِ اللَّهِ حَقٌّ وَ أَنَّ مَا جَاءَ بِهِ مُحَمَّدٌ ( صلى الله عليه وآله ) حَقٌّ وَ أَنَّ مَا نَزَلَ بِهِ الرُّوحُ الْأَمِينُ حَقٌّ عَلَى ذَلِكَ أَحْيَا وَ عَلَيْهِ أَمُوتُ وَ عَلَيْهِ أُبْعَثُ إِنْ شَاءَ اللَّهُ",
          "وَ أَشْهَدَهُمْ أَنَّ هَذِهِ وَصِيَّتِي بِخَطِّي وَ قَدْ نَسَخْتُ وَصِيَّةَ جَدِّي أَمِيرِ الْمُؤْمِنِينَ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) وَ وَصِيَّةَ مُحَمَّدِ بْنِ عَلِيٍّ قَبْلَ ذَلِكَ نَسَخْتُهَا حَرْفاً بِحَرْفٍ وَ وَصِيَّةَ جَعْفَرِ بْنِ مُحَمَّدٍ عَلَى مِثْلِ ذَلِكَ وَ إِنِّي قَدْ أَوْصَيْتُ إِلَى عَلِيٍّ وَ بَنِيَّ بَعْدُ مَعَهُ إِنْ شَاءَ وَ آنَسَ مِنْهُمْ رُشْداً وَ أَحَبَّ أَنْ يُقِرَّهُمْ فَذَاكَ لَهُ وَ إِنْ كَرِهَهُمْ وَ أَحَبَّ أَنْ يُخْرِجَهُمْ فَذَاكَ لَهُ وَ لَا أَمْرَ لَهُمْ مَعَهُ",
          "وَ أَوْصَيْتُ إِلَيْهِ بِصَدَقَاتِي وَ أَمْوَالِي وَ مَوَالِيَّ وَ صِبْيَانِيَ الَّذِينَ خَلَّفْتُ وَ وُلْدِي إِلَى إِبْرَاهِيمَ وَ الْعَبَّاسِ وَ قَاسِمٍ وَ إِسْمَاعِيلَ وَ أَحْمَدَ وَ أُمِّ أَحْمَدَ وَ إِلَى عَلِيٍّ أَمْرُ نِسَائِي دُونَهُمْ وَ ثُلُثُ صَدَقَةِ أَبِي وَ ثُلُثِي يَضَعُهُ حَيْثُ يَرَى وَ يَجْعَلُ فِيهِ مَا يَجْعَلُ ذُو الْمَالِ فِي مَالِهِ فَإِنْ أَحَبَّ أَنْ يَبِيعَ أَوْ يَهَبَ أَوْ يَنْحَلَ أَوْ يَتَصَدَّقَ بِهَا عَلَى مَنْ سَمَّيْتُ لَهُ وَ عَلَى غَيْرِ مَنْ سَمَّيْتُ",
          "فَذَاكَ لَهُ وَ هُوَ أَنَا فِي وَصِيَّتِي فِي مَالِي وَ فِي أَهْلِي وَ وُلْدِي وَ إِنْ يَرَى أَنْ يُقِرَّ إِخْوَتَهُ الَّذِينَ سَمَّيْتُهُمْ فِي كِتَابِي هَذَا أَقَرَّهُمْ وَ إِنْ كَرِهَ فَلَهُ أَنْ يُخْرِجَهُمْ غَيْرَ مُثَرَّبٍ عَلَيْهِ وَ لَا مَرْدُودٍ فَإِنْ آنَسَ مِنْهُمْ غَيْرَ الَّذِي فَارَقْتُهُمْ عَلَيْهِ فَأَحَبَّ أَنْ يَرُدَّهُمْ فِي وَلَايَةٍ فَذَاكَ لَهُ وَ إِنْ أَرَادَ رَجُلٌ مِنْهُمْ أَنْ يُزَوِّجَ أُخْتَهُ فَلَيْسَ لَهُ أَنْ يُزَوِّجَهَا إِلَّا بِإِذْنِهِ وَ أَمْرِهِ فَإِنَّهُ أَعْرَفُ بِمَنَاكِحِ قَوْمِهِ",
          "وَ أَيُّ سُلْطَانٍ أَوْ أَحَدٌ مِنَ النَّاسِ كَفَّهُ عَنْ شَيْ‏ءٍ أَوْ حَالَ بَيْنَهُ وَ بَيْنَ شَيْ‏ءٍ مِمَّا ذَكَرْتُ فِي كِتَابِي هَذَا أَوْ أَحَدٍ مِمَّنْ ذَكَرْتُ فَهُوَ مِنَ اللَّهِ وَ مِنْ رَسُولِهِ بَرِي‏ءٌ وَ اللَّهُ وَ رَسُولُهُ مِنْهُ بُرَآءُ وَ عَلَيْهِ لَعْنَةُ اللَّهِ وَ غَضَبُهُ وَ لَعْنَةُ اللَّاعِنِينَ وَ الْمَلَائِكَةِ الْمُقَرَّبِينَ وَ النَّبِيِّينَ وَ الْمُرْسَلِينَ وَ جَمَاعَةِ الْمُؤْمِنِينَ",
          "وَ لَيْسَ لِأَحَدٍ مِنَ السَّلَاطِينِ أَنْ يَكُفَّهُ عَنْ شَيْ‏ءٍ وَ لَيْسَ لِي عِنْدَهُ تَبِعَةٌ وَ لَا تِبَاعَةٌ وَ لَا لِأَحَدٍ مِنْ وُلْدِي لَهُ قِبَلِي مَالٌ فَهُوَ مُصَدَّقٌ فِيمَا ذَكَرَ فَإِنْ أَقَلَّ فَهُوَ أَعْلَمُ وَ إِنْ أَكْثَرَ فَهُوَ الصَّادِقُ كَذَلِكَ وَ إِنَّمَا أَرَدْتُ بِإِدْخَالِ الَّذِينَ أَدْخَلْتُهُمْ مَعَهُ مِنْ وُلْدِي التَّنْوِيهَ بِأَسْمَائِهِمْ وَ التَّشْرِيفَ لَهُمْ",
          "وَ أُمَّهَاتُ أَوْلَادِي مَنْ أَقَامَتْ مِنْهُنَّ فِي مَنْزِلِهَا وَ حِجَابِهَا فَلَهَا مَا كَانَ يَجْرِي عَلَيْهَا فِي حَيَاتِي إِنْ رَأَى ذَلِكَ وَ مَنْ خَرَجَتْ مِنْهُنَّ إِلَى زَوْجٍ فَلَيْسَ لَهَا أَنْ تَرْجِعَ إِلَى مَحْوَايَ إِلَّا أَنْ يَرَى عَلِيٌّ غَيْرَ ذَلِكَ وَ بَنَاتِي بِمِثْلِ ذَلِكَ وَ لَا يُزَوِّجُ بَنَاتِي أَحَدٌ مِنْ إِخْوَتِهِنَّ مِنْ أُمَّهَاتِهِنَّ وَ لَا سُلْطَانٌ وَ لَا عَمٌّ إِلَّا بِرَأْيِهِ وَ مَشُورَتِهِ",
          "فَإِنْ فَعَلُوا غَيْرَ ذَلِكَ فَقَدْ خَالَفُوا اللَّهَ وَ رَسُولَهُ وَ جَاهَدُوهُ فِي مُلْكِهِ وَ هُوَ أَعْرَفُ بِمَنَاكِحِ قَوْمِهِ فَإِنْ أَرَادَ أَنْ يُزَوِّجَ زَوَّجَ وَ إِنْ أَرَادَ أَنْ يَتْرُكَ تَرَكَ وَ قَدْ أَوْصَيْتُهُنَّ بِمِثْلِ مَا ذَكَرْتُ فِي كِتَابِي هَذَا وَ جَعَلْتُ اللَّهَ عَزَّ وَ جَلَّ عَلَيْهِنَّ شَهِيداً وَ هُوَ وَ أُمُّ أَحْمَدَ شَاهِدَانِ وَ لَيْسَ لِأَحَدٍ أَنْ يَكْشِفَ وَصِيَّتِي وَ لَا يَنْشُرَهَا وَ هُوَ مِنْهَا عَلَى غَيْرِ مَا ذَكَرْتُ وَ سَمَّيْتُ",
          "فَمَنْ أَسَاءَ فَعَلَيْهِ وَ مَنْ أَحْسَنَ فَلِنَفْسِهِ وَ مَا رَبُّكَ بِظَلَّامٍ لِلْعَبِيدِ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ عَلَى آلِهِ وَ لَيْسَ لِأَحَدٍ مِنْ سُلْطَانٍ وَ لَا غَيْرِهِ أَنْ يَفُضَّ كِتَابِي هَذَا الَّذِي خَتَمْتُ عَلَيْهِ الْأَسْفَلَ فَمَنْ فَعَلَ ذَلِكَ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَ غَضَبُهُ وَ لَعْنَةُ اللَّاعِنِينَ وَ الْمَلَائِكَةِ الْمُقَرَّبِينَ وَ جَمَاعَةِ الْمُرْسَلِينَ وَ الْمُؤْمِنِينَ مِنَ الْمُسْلِمِينَ وَ عَلَى مَنْ فَضَّ كِتَابِي هَذَا",
          "وَ كَتَبَ وَ خَتَمَ أَبُو إِبْرَاهِيمَ وَ الشُّهُودُ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ عَلَى آلِهِ ",
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ق</span>َالَ أَبُو الْحَكَمِ</span> فَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ آدَمَ الْجَعْفَرِيُّ عَنْ يَزِيدَ بْنِ سَلِيطٍ قَالَ كَانَ أَبُو عِمْرَانَ الطَّلْحِيُّ قَاضِيَ الْمَدِينَةِ فَلَمَّا مَضَى مُوسَى قَدَّمَهُ إِخْوَتُهُ إِلَى الطَّلْحِيِّ الْقَاضِي فَقَالَ الْعَبَّاسُ بْنُ مُوسَى أَصْلَحَكَ اللَّهُ وَ أَمْتَعَ بِكَ إِنَّ فِي أَسْفَلِ هَذَا الْكِتَابِ كَنْزاً وَ جَوْهَراً وَ يُرِيدُ أَنْ يَحْتَجِبَهُ وَ يَأْخُذَهُ دُونَنَا وَ لَمْ يَدَعْ أَبُونَا رَحِمَهُ اللَّهُ شَيْئاً إِلَّا أَلْجَأَهُ إِلَيْهِ وَ تَرَكَنَا عَالَةً وَ لَوْ لَا أَنِّي أَكُفُّ نَفْسِي لَأَخْبَرْتُكَ بِشَيْ‏ءٍ عَلَى رُءُوسِ الْمَلَإِ",
          "فَوَثَبَ إِلَيْهِ إِبْرَاهِيمُ بْنُ مُحَمَّدٍ فَقَالَ إِذاً وَ اللَّهِ تُخْبِرُ بِمَا لَا نَقْبَلُهُ مِنْكَ وَ لَا نُصَدِّقُكَ عَلَيْهِ ثُمَّ تَكُونُ عِنْدَنَا مَلُوماً مَدْحُوراً نَعْرِفُكَ بِالْكَذِبِ صَغِيراً وَ كَبِيراً وَ كَانَ أَبُوكَ أَعْرَفَ بِكَ لَوْ كَانَ فِيكَ خَيْراً وَ إِنْ كَانَ أَبُوكَ لَعَارِفاً بِكَ فِي الظَّاهِرِ وَ الْبَاطِنِ وَ مَا كَانَ لِيَأْمَنَكَ عَلَى تَمْرَتَيْنِ ",
          "ثُمَّ وَثَبَ إِلَيْهِ إِسْحَاقُ بْنُ جَعْفَرٍ عَمُّهُ فَأَخَذَ بِتَلْبِيبِهِ فَقَالَ لَهُ إِنَّكَ لَسَفِيهٌ ضَعِيفٌ أَحْمَقُ اجْمَعْ هَذَا مَعَ مَا كَانَ بِالْأَمْسِ مِنْكَ وَ أَعَانَهُ الْقَوْمُ أَجْمَعُونَ فَقَالَ أَبُو عِمْرَانَ الْقَاضِي لِعَلِيٍّ قُمْ يَا أَبَا الْحَسَنِ حَسْبِي مَا لَعَنَنِي أَبُوكَ الْيَوْمَ وَ قَدْ وَسَّعَ لَكَ أَبُوكَ وَ لَا وَ اللَّهِ مَا أَحَدٌ أَعْرَفَ بِالْوَلَدِ مِنْ وَالِدِهِ وَ لَا وَ اللَّهِ مَا كَانَ أَبُوكَ عِنْدَنَا بِمُسْتَخَفٍّ فِي عَقْلِهِ وَ لَا ضَعِيفٍ فِي رَأْيِهِ",
          "فَقَالَ الْعَبَّاسُ لِلْقَاضِي أَصْلَحَكَ اللَّهُ فُضَّ الْخَاتَمَ وَ اقْرَأْ مَا تَحْتَهُ فَقَالَ أَبُو عِمْرَانَ لَا أَفُضُّهُ حَسْبِي مَا لَعَنَنِي أَبُوكَ الْيَوْمَ فَقَالَ الْعَبَّاسُ فَأَنَا أَفُضُّهُ فَقَالَ ذَاكَ إِلَيْكَ فَفَضَّ الْعَبَّاسُ الْخَاتَمَ فَإِذَا فِيهِ إِخْرَاجُهُمْ وَ إِقْرَارُ عَلِيٍّ لَهَا وَحْدَهُ وَ إِدْخَالُهُ إِيَّاهُمْ فِي وَلَايَةِ عَلِيٍّ إِنْ أَحَبُّوا أَوْ كَرِهُوا وَ إِخْرَاجُهُمْ مِنْ حَدِّ الصَّدَقَةِ وَ غَيْرِهَا وَ كَانَ فَتْحُهُ عَلَيْهِمْ بَلَاءً وَ فَضِيحَةً وَ ذِلَّةً وَ لِعَلِيٍّ ( عليه السلام ) خِيَرَةً",
          "وَ كَانَ فِي الْوَصِيَّةِ الَّتِي فَضَّ الْعَبَّاسُ تَحْتَ الْخَاتَمِ هَؤُلَاءِ الشُّهُودُ إِبْرَاهِيمُ بْنُ مُحَمَّدٍ وَ إِسْحَاقُ بْنُ جَعْفَرٍ وَ جَعْفَرُ بْنُ صَالِحٍ وَ سَعِيدُ بْنُ عِمْرَانَ وَ أَبْرَزُوا وَجْهَ أُمِّ أَحْمَدَ فِي مَجْلِسِ الْقَاضِي وَ ادَّعَوْا أَنَّهَا لَيْسَتْ إِيَّاهَا حَتَّى كَشَفُوا عَنْهَا وَ عَرَفُوهَا فَقَالَتْ عِنْدَ ذَلِكَ قَدْ وَ اللَّهِ قَالَ سَيِّدِي هَذَا إِنَّكِ سَتُؤْخَذِينَ جَبْراً وَ تُخْرَجِينَ إِلَى الْمَجَالِسِ فَزَجَرَهَا إِسْحَاقُ بْنُ جَعْفَرٍ وَ قَالَ اسْكُتِي فَإِنَّ النِّسَاءَ إِلَى الضَّعْفِ مَا أَظُنُّهُ قَالَ مِنْ هَذَا شَيْئاً ",
          "ثُمَّ إِنَّ عَلِيّاً ( عليه السلام ) الْتَفَتَ إِلَى الْعَبَّاسِ فَقَالَ يَا أَخِي إِنِّي أَعْلَمُ أَنَّهُ إِنَّمَا حَمَلَكُمْ عَلَى هَذِهِ الْغَرَائِمُ وَ الدُّيُونُ الَّتِي عَلَيْكُمْ فَانْطَلِقْ يَا سَعِيدُ فَتَعَيَّنْ لِي مَا عَلَيْهِمْ ثُمَّ اقْضِ عَنْهُمْ وَ لَا وَ اللَّهِ لَا أَدَعُ مُوَاسَاتَكُمْ وَ بِرَّكُمْ مَا مَشَيْتُ عَلَى الْأَرْضِ فَقُولُوا مَا شِئْتُمْ",
          "فَقَالَ الْعَبَّاسُ مَا تُعْطِينَا إِلَّا مِنْ فُضُولِ أَمْوَالِنَا و مَا لَنَا عِنْدَكَ أَكْثَرُ فَقَالَ قُولُوا مَا شِئْتُمْ فَالْعِرْضُ عِرْضُكُمْ فَإِنْ تُحْسِنُوا فَذَاكَ لَكُمْ عِنْدَ اللَّهِ وَ إِنْ تُسِيئُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ وَ اللَّهِ إِنَّكُمْ لَتَعْرِفُونَ أَنَّهُ مَا لِي يَوْمِي هَذَا وَلَدٌ وَ لَا وَارِثٌ غَيْرُكُمْ وَ لَئِنْ حَبَسْتُ شَيْئاً مِمَّا تَظُنُّونَ أَوِ ادَّخَرْتُهُ فَإِنَّمَا هُوَ لَكُمْ وَ مَرْجِعُهُ إِلَيْكُمْ وَ اللَّهِ مَا مَلَكْتُ مُنْذُ مَضَى أَبُوكُمْ رَضِيَ اللَّهُ عَنْهُ شَيْئاً إِلَّا وَ قَدْ سَيَّبْتُهُ حَيْثُ رَأَيْتُمْ ",
          "فَوَثَبَ الْعَبَّاسُ فَقَالَ وَ اللَّهِ مَا هُوَ كَذَلِكَ وَ مَا جَعَلَ اللَّهُ لَكَ مِنْ رَأْيٍ عَلَيْنَا وَ لَكِنْ حَسَدُ أَبِينَا لَنَا وَ إِرَادَتُهُ مَا أَرَادَ مِمَّا لَا يُسَوِّغُهُ اللَّهُ إِيَّاهُ وَ لَا إِيَّاكَ وَ إِنَّكَ لَتَعْرِفُ أَنِّي أَعْرِفُ صَفْوَانَ بْنَ يَحْيَى بَيَّاعَ السَّابِرِيِّ بِالْكُوفَةِ وَ لَئِنْ سَلِمْتُ لَأُغْصِصَنَّهُ بِرِيقِهِ وَ أَنْتَ مَعَهُ ",
          "فَقَالَ عَلِيٌّ ( عليه السلام ) لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ أَمَّا إِنِّي يَا إِخْوَتِي فَحَرِيصٌ عَلَى مَسَرَّتِكُمْ اللَّهُ يَعْلَمُ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنِّي أُحِبُّ صَلَاحَهُمْ وَ أَنِّي بَارٌّ بِهِمْ وَاصِلٌ لَهُمْ رَفِيقٌ عَلَيْهِمْ أُعْنَى بِأُمُورِهِمْ لَيْلًا وَ نَهَاراً فَاجْزِنِي بِهِ خَيْراً وَ إِنْ كُنْتُ عَلَى غَيْرِ ذَلِكَ فَأَنْتَ عَلَّامُ الْغُيُوبِ فَاجْزِنِي بِهِ مَا أَنَا أَهْلُهُ إِنْ كَانَ شَرّاً فَشَرّاً وَ إِنْ كَانَ خَيْراً فَخَيْراً ",
          "اللَّهُمَّ أَصْلِحْهُمْ وَ أَصْلِحْ لَهُمْ وَ اخْسَأْ عَنَّا وَ عَنْهُمُ الشَّيْطَانَ وَ أَعِنْهُمْ عَلَى طَاعَتِكَ وَ وَفِّقْهُمْ لِرُشْدِكَ أَمَّا أَنَا يَا أَخِي فَحَرِيصٌ عَلَى مَسَرَّتِكُمْ جَاهِدٌ عَلَى صَلَاحِكُمْ وَ اللَّهُ عَلَى مَا نَقُولُ وَكِيلٌ ",
          "فَقَالَ الْعَبَّاسُ مَا أَعْرَفَنِي بِلِسَانِكَ وَ لَيْسَ لِمِسْحَاتِكَ عِنْدِي طِينٌ ",
          "فَافْتَرَقَ الْقَوْمُ عَلَى هَذَا وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Abu Al Hakam who said, ‘Abdullah Bin Ibrahim Al Ja’fary and Abdullah Bin Muhammad Bin Umara narrated to me from Yazeed Bin Saleyt who said, ",
            "‘When Abu Ibrahim<sup>asws</sup> bequeathed, it was witnessed by Ibrahim Bin Muhammad Al-Ja’fary, and Is’haq Bin Muhammad Al Ja’fary, and Is’haq Bin Ja’far Bin Muhammad, and Ja’far Bin Salih and Muawiya Al Ja’fary, and Yahya Bin Al Husayn Bin Zyad Bin Ali, and Sa’ad Bin Imran Al Ansary, and Muhammad Bin Al Haris Al Ansary, and Muhammad Bin Ja’far Bin Sa’d Al Aslamy, and he was the writer of the bequest.",
            "The first of what they witnessed what that he<sup>asws</sup> testified: ‘There is no god except Allah<sup>azwj</sup>, Alone, there being no associates for Him<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, and that the Hour is coming, there being no doubt in it, and that Allah<sup>azwj</sup> would be Resurrecting the ones in the graves, and that the Resurrection after the death is true, and that the Promise is true, and that the Reckoning is true, and the Judgment is true, and that the pausing in front of Allah<sup>azwj</sup> is true, and that whatever the Trustworthy Sprit descended with is true. Upon that I<sup>asws</sup> live and upon it I<sup>asws</sup> pass away, and upon it I<sup>asws</sup> shall be Resurrected, if Allah<sup>azwj</sup> so Desires.",
            "And I keep them as witnesses that this here is my<sup>asws</sup> bequest in my<sup>asws</sup> own handwriting, and I<sup>asws</sup> have copied the bequest of my<sup>asws</sup> grandfather<sup>asws</sup> Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> and the Bequest of Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> before that, copying it letter by letter, and the Bequest of Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> was upon similar to that, and I<sup>asws</sup> hereby bequeath to my<sup>asws</sup> son<sup>asws</sup> Ali<sup>asws</sup>, and my<sup>asws</sup> son after with him<sup>asws</sup>. If he<sup>asws</sup> so desires he<sup>asws</sup> can be amiable with them rightfully, and I<sup>asws</sup> would love it for them to acknowledge him<sup>asws</sup>. So that is for him<sup>asws</sup>, and if he<sup>asws</sup> dislikes them and loves to take them out, so that is for him<sup>asws</sup>, and there is no command for them along with him<sup>asws</sup>.",
            "And I<sup>asws</sup> am bequeathing to him<sup>asws</sup> with my charities, and my<sup>asws</sup> wealth, and my<sup>asws</sup> slaves, and the children which I<sup>asws</sup> am leaving behind, and my<sup>asws</sup> sons to Ibrahim, and Al-Abbas, and Qasim, and Ismail, and Ahmad, and the uncle of Ahmad, and to Ali<sup>asws</sup> is the matter of my<sup>asws</sup> womenfolk, besides them, and a third of the charity of my<sup>asws</sup> father<sup>asws</sup>, and two thirds he<sup>asws</sup> can place wherever he<sup>asws</sup> so sees fit, and he<sup>asws</sup> can make to be in it whatever he<sup>asws</sup> so makes to be in it with the wealth in his<sup>asws</sup> wealth. So if he<sup>asws</sup> so loves, he<sup>asws</sup> can sell, or gift, or confer, or give charity with it upon the ones I<sup>asws</sup> have named for him, and upon other than the ones I<sup>asws</sup> have named for him<sup>asws</sup>. ",
            "So that is for him<sup>asws</sup>, and he<sup>asws</sup> is me<sup>asws</sup> in my<sup>asws</sup> bequest with regards to my<sup>asws</sup> wealth and regarding my<sup>asws</sup> family, and my<sup>asws</sup> children. And if he<sup>asws</sup> sees fit to accept his<sup>asws</sup> brothers whom I<sup>asws</sup> have named in this letter of mine, he<sup>asws</sup> accepts them, and if he dislikes it, so it is for him<sup>asws</sup> that he<sup>asws</sup> takes them out without being blamed over it nor returned. So if he<sup>asws</sup> is amiable from them with other than which I<sup>asws</sup> have separated from them upon, so if he<sup>asws</sup> loves to repel them regarding the Wiyalah, so that is for him, and if a man from them intends to get his sister married, so it would not be for him if he gets her married except by his<sup>asws</sup> permission and his<sup>asws</sup> orders, for he<sup>asws</sup> recognises the marriages of his<sup>asws</sup> people. ",
            "And whichever ruler, or anyone from the people stops him<sup>asws</sup> from something, or obstruct between him and something from what I<sup>asws</sup> mentioned in this letter of mine<sup>asws</sup>, or anyone from whom I<sup>asws</sup> mentioned, so he would be disavowed from Allah<sup>azwj</sup> and from His<sup>asws</sup> Rasool<sup>saww</sup>, and Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> would be disavowed from him, and upon him would be the Curse of Allah<sup>azwj</sup> and His<sup>azwj</sup> Wrath, and the Curses of the Cursers, and the Angels of Proximity, and the Prophets<sup>as</sup>, and the <span class=\"iTxt\">Mursil</span> Prophets<sup>as</sup>, and the group of Momineen.",
            "And it isn’t for anyone from the ruling authorities that they stop him<sup>asws</sup> from anything, and it isn’t for me<sup>asws</sup> with him<sup>asws</sup> any demand nor a complaint, nor is there for any one of my<sup>asws</sup> children to him<sup>asws</sup> before me<sup>asws</sup> regarding wealth. So he<sup>asws</sup> is the ratifier regarding what I<sup>asws</sup> mentioned. So if it is less, so he<sup>asws</sup> would be knowing, and if it is more, so he<sup>asws</sup> is the truthful with that. And rather, I<sup>asws</sup> intended by the inclusion of those whom I<sup>asws</sup> included with him<sup>asws</sup> from my<sup>asws</sup> children, for the noting of their names and the nobility for them. ",
            "And the mothers of my<sup>asws</sup> children, the one from them who stays in her house and her veil, so it would be for her, whatever (expenditure monies) flowed upon her during my<sup>asws</sup> lifetime, if he<sup>asws</sup> sees that, and the one from them who goes out to marry, so there wouldn’t be for her that she returns to my<sup>asws</sup> house except if Ali<sup>asws</sup> views other than that. And my<sup>asws</sup> daughter are with the likes of that. And none shall my<sup>asws</sup> daughters get married off by anyone from their brothers from their mothers, nor one with authority, nor a paternal uncle except by his<sup>asws</sup> view and his<sup>asws</sup> consultation. ",
            "So if they were to do other than that, so they would have opposed Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and they would have fought against Him<sup>azwj</sup> in His<sup>azwj</sup> Kingdom, and he<sup>asws</sup> is more knowing of the marriages of his<sup>asws</sup> people. So if he<sup>asws</sup> wants to get them married, so they get married, and if he<sup>asws</sup> wants them to leave it, so they should leave it, and I<sup>asws</sup> have already bequeathed to them with the likes of what I<sup>asws</sup> mentioned in this letter of mine<sup>asws</sup>. And I<sup>asws</sup> made Allah<sup>azwj</sup> Mighty and Majestic as a Witness upon them, and He<sup>azwj</sup> and Umm Ahmad are two witnesses, and there isn’t for anyone that he uncovers my<sup>asws</sup> bequest, nor publicise it, and it is from it upon other than what I<sup>asws</sup> mentioned and specified. ",
            "So the one who offends, so it would be against himself, and the one who does good, so it would be for himself, and your Lord<sup>azwj</sup> is not the least unjust to the servants. And may Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawat</span> upon Muhammad<sup>saww</sup> and upon his<sup>saww</sup> Progeny<sup>asws</sup>. And it isn’t for anyone from a ruler, or anyone else that he<sup>asws</sup> open this letter of mine which I<sup>asws</sup> am sealing upon at the bottom. So the one who does that, so upon would be the Curse of Allah<sup>azwj</sup> and His<sup>azwj</sup> Wrath, and the curses of the cursing ones and the Angels of Proximity, and the group of the Mursil Prophets<sup>as</sup>, and the Momineen from the Muslims, and upon the one who opens this letter of mine’. ",
            "And Abu Ibrahim<sup>asws</sup> wrote and sealed, and (so did the witnesses), and may Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawat</span> upon Muhammad<sup>saww</sup> and upon his<sup>saww</sup> Progeny<sup>asws</sup>.’",
            "Abu Al-Hakam said, ‘Abdullah Bin Adam Al-Ja’fary narrated to me, from Yazeed Bin Saleyt who said, ‘Abu Imran Al-Talhy was a judge of Al-Medina. So when Musa<sup>asws</sup> passed away, his<sup>asws</sup> brothers went over to Al-Talhy the judge. So Al-Abbas (one of his<sup>asws</sup> brothers) said, ‘May Allah<sup>azwj</sup> Keep you well and be Happy with you. At the bottom of this letter there is a treasure and jewels (mentioned) and he<sup>asws</sup> intends to conceal it, and he<sup>asws</sup> wants to take these besides us, and our father<sup>asws</sup>, may Allah<sup>azwj</sup> have Mercy on him<sup>asws</sup>, did not leave us anything except wealth for him<sup>asws</sup>, and left us a burden. And had I not controlled myself, I would have informed you with something against the heads of the council’. ",
            "So Ibrahim Bin Muhammad leapt upon him and he said, ‘Then by Allah<sup>azwj</sup>, you would be informing with what we will neither accept from you nor ratify you upon it, then you would become blameworthy, defeated in our presence. We know you with the lying when you were young and old, and it was so that your father<sup>asws</sup> knew (the lying) with you. Had there been goodness in you, and even if your father<sup>asws</sup> knew of you in the apparent and the hidden, and he<sup>asws</sup> had never trusted you upon (even) two dates’. ",
            "Then Ishaq Bin Ja’far, his uncle, leapt upon him (Al Abbas) and grabbed his two collars, so he said to him, ‘You are foolish, weak, stupid. This is gathered with whatever was from you yesterday’, and the people altogether supported him. So Abu Imran the judge said to Ali<sup>asws</sup>, ‘Stand, O Abu Al-Hassan<sup>asws</sup>! It suffices me what your<sup>asws</sup> father<sup>asws</sup> cursed me with today, and your<sup>asws</sup> father<sup>asws</sup> has been extensive to you, and no, by Allah<sup>azwj</sup>, and no one is more knowing of his child than his parent. And no, by Allah<sup>azwj</sup>, your<sup>asws</sup> father<sup>asws</sup>, in our presence, wasn’t light-minded with regard to his<sup>asws</sup> intellect, nor was he<sup>asws</sup> weak in his<sup>asws</sup> opinions’. ",
            "So Al-Abbas said to the judge, ‘May Allah<sup>azwj</sup> Keep you well! Open the seal and read what is beneath it!’ So Abu Imran said, ‘I will not open it. It suffices me what your father<sup>asws</sup> has cursed me with today’. So Al-Abbas said, ‘So I will open it’. So he said, ‘That is up to you’. So Al-Abbas opened the seal, and therein was their exit and the acceptance of Ali<sup>asws</sup> to it, alone, and their inclusion in the authority of Ali<sup>asws</sup>, whether they like it or dislike it, and their exit from the limit of the charities and others such matters. And it was so that the opening (of the bequest) was a calamity upon them and a scandal and a disgrace, and for Ali<sup>asws</sup> it was good. ",
            "And it was in the bequest which Al-Abbas opened, beneath the seal – ‘These are the witnesses – Ibrahim Bin Muhammad, and Is’haq Bin Ja’far, and Ja’far Bin Salih, and Saeed Bin Imran. And they unveiled the face of Umm Ahmad in the gathering of the judge and they claimed that she isn’t her (who she claims to be) until they uncover it from her and recognised her. So she said during that, ‘By Allah<sup>azwj</sup>! My Master<sup>asws</sup> (husband) had said this that you would be taking this forcefully and you would be going to the gathering’. So Is’haq Bin Ja’far rebuked her and said: ‘Be silent, for the women are Subject to weakness. I don’t think he<sup>asws</sup> said anything from this!’ ",
            "Then Ali<sup>asws</sup> turned towards Al-Abbas and he<sup>asws</sup> said: ‘O my<sup>asws</sup> brother! I<sup>asws</sup> know well that rather it was the liabilities and the debts upon you all which carried you upon this. So go, O Saeed, and look into it for me<sup>asws</sup>, what (debt/labilities) are upon them, and fulfil it from them. And no, by Allah<sup>azwj</sup>, I<sup>asws</sup> will not leave being considerate with you all and be good to you for as long as I<sup>asws</sup> walk upon the earth, therefore you can be saying whatever you so desire to’. ",
            "So Al-Abbas said, ‘What you<sup>asws</sup> are giving us is from the remnants of our own wealth, and what there is for us with you<sup>asws</sup> is more’. So he<sup>asws</sup> said: ‘Say whatever you like, so the presentation is your presentation. So if you were to be good, so that would be for you in the Presence of Allah<sup>azwj</sup>, and if you are offensive, so Allah<sup>azwj</sup> is Forgiving, Merciful. By Allah<sup>azwj</sup>! You are knowing that on this day of mine<sup>asws</sup>, there is neither a son for me<sup>asws</sup> nor an inheritor apart from you all, and if<sup>asws</sup> have withheld anything from what you are thinking, or I<sup>asws</sup> have hoarded, so rather it is for you all, and would be returning to you. By Allah<sup>azwj</sup>! I<sup>asws</sup> have not owned anything since your father<sup>asws</sup> passed away, may Allah<sup>azwj</sup> be Pleased with him<sup>asws</sup>, except that I<sup>asws</sup> have disposed it where you have seen it’. ",
            "So Al-Abbas jumped and he said, ‘By Allah<sup>azwj</sup>! It is not like that, and Allah<sup>azwj</sup> has not Made to be for you<sup>asws</sup> any of your<sup>asws</sup> opinions (binding) upon us, but our father<sup>asws</sup> wan envious to us, and his<sup>asws</sup> intentions from what he<sup>asws</sup> wanted are from what cannot be justified with Allah<sup>azwj</sup> nor are yours<sup>asws</sup>, and you<sup>asws</sup> know that I know Safwan Bin Yahya the seller of Al-Sabiry (fabrics) in Al-Kufa, and although you<sup>asws</sup> submit, I will drown him in his own saliva, and you<sup>asws</sup> along with him’. ",
            "So Ali<sup>asws</sup> said: ‘There is neither Might nor Strength except with Allah<sup>azwj</sup> the Exalted, the Magnificent! As for myself<sup>asws</sup>, O my<sup>asws</sup> brothers, So I<sup>asws</sup> am desiring your happiness. Allah<sup>azwj</sup> Knows. O Allah<sup>azwj</sup>! If You<sup>azwj</sup> Know that I<sup>asws</sup> love reconciling with them and I<sup>asws</sup> am righteous with them, helping to them, kind upon them, assisting with their affairs night and day, so Recompense me<sup>asws</sup> goodly for it, and if it was other than that, so You<sup>asws</sup> are the Knower of the unseen, so Recompense me<sup>asws</sup> with what I<sup>asws</sup> are deserving of, if it was evil, so evil, and if it was good, so good’. ",
            "O Allah<sup>azwj</sup>! Correct them and Correct for them, and Keep away the Satan<sup>la</sup> from us<sup>asws</sup> and from them, and Assist them upon obeying You<sup>azwj</sup>, and Harmonise them to Your<sup>azwj</sup> Guidance! As for I<sup>asws</sup>, O my<sup>asws</sup> brother, so I am desirous upon your happiness, striving upon reconciling you, and Allah<sup>azwj</sup> is the Defender upon what we are saying’.  ",
            "So Al-Abbas said, ‘What I know of your<sup>asws</sup> tongue, and there isn’t any clay with me to swab you<sup>asws</sup> with’. ",
            "And the people dispersed upon this. And may Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawat</span> upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " Abu al-Hakam has said that abu ‘Abdallah ibn Adam al-Ja‘fari narrated to me from Yazid ibn Salit the following. “Abu ‘Imran al-Talhi was a judge in Madina. When Musa (a.s.) His brothers summoned him before the judge, Abu ‘Imran al-Talhi. Al-‘Abbass ibn Musa said, “May Allah keep you well and allow people to benefit from you. At the bottom of this document there is (mentioned) treasures and pearls and he wants to hide and keep them for himself without us.My father, may Allah grant him blessings, have left nothing that is free from being referred to him. He has left us all poor. Had I not controlled my self I would told you something in public. At such time Ibrahim ibn Muhammad rushed towards him saying, “Will you speak up about a thing that no one of us will accept it or believe you? You will then be blamed and defeated among us. We know that you have been lying when still young and when you grew up. Your father knew you very well. If there was any thing good in you even though he knew you inside and outside. He would trust you even with two pieces of date.” At this time Ishaq ibn Ja‘far, his uncle rushed towards him and grabbed both sides of his collar saying, “:You are a fool and feeble minded. Pick up this all and what you did the day before and all others also helped him.” Abu ‘Imran, the judge then said to Ali (a.s.), “Stand up O abu al-Hassan (a.s.). The condemnation of your father is enough for me today. He has certainly given you a wide range of authority. By Allah, no one knows a person better than his father does. By Allah, abu ‘Abdallah to us was not a light minded person or weak in his opinions.” Al-‘Abbass then said to the judge, “Open the document and read what is below therein. “ Abu ‘Imran said, “I will not open it. The condemnation of your father is enough for me today.” Al-‘Abbass said, “I will tear it down.” He said, “That is up to you.” Al-‘Abbass then removed the seal and therein they found themselves all removed from their being executors of the will and the confirmation of Ali as the sole executor of the will. They found out therein the appointment of Ali as their guardian (with Divine authority) whether they would like or dislike it. They also found out therein that they were all removed from the list of the recipients of charities and other benefits. Opening the document turned to become a misfortune, disgrace and humiliation to them. It proved very good for Ali (a.s.). In the directive will that al-‘Abbass removed its seal the following names were the signatories. Ibrahim ibn Muhammad, Ishaq ibn Ja‘far, Ja’far ibn Salih and Sa‘id (Sa’d) ibn ‘Imran were the ones who uncovered the face of the mother of Ahmad (who was brought) in the presence the judge, qadi, excusing that it was not mother of Ahmad, until they had uncovered her face and recognized. She where up on said, “By Allah, my master (husband) said, “You will be coerced to go before a judge.” Ishaq ibn Ja‘far admonished her saying,, “Be quite, women suffer from weakness. I do not think he has said any such thing.” Ali (a.s.) then turned to al-‘Abbass and said, “My brother, I understand that debts and liabilities up on you have forced you to this. O Sa‘id come with me so we can help them pay for them. By Allah, I will ignore to help you and cooperate with you as long as will walk on earth. You may say whatever you like.” Al-‘Abbass then said, “You are not giving us anything other than the extra of our own properties which are with you. In fact, our properties with are more than.” He (The Imam (a.s.) said, say whatever you want. Honor is your own honor. If you do good it will for your own selves before Allah and if you do evil Allah is forgiving. By Allah, you know, that today I have no son and heir other than you. If I will keep anything think I might away from you or store it in hiding it will be for you and will return to you. By Allah, from the day your father, may Allah be pleased with him, left this world I have not owned anything but that I have disposed of it as have seen.” Al-‘Abbass moved forwards and said, “By Allah, it is not so. Allah has not imposed any of your opinions on us. Only our father was jealous against us. His decisions are not justifiable before Allah and nor is your decisions. You know that I know Safwan ibn Yahya who sells al-Sabiry (fine fabrics) in Kufa. If you admit I can make it very difficult for both of you to swallow your Saliva.” Ali (a.s.) then said, “There is no means and no power except with Allah, the Most Holy, the Most Great. My brothers I am very keen to see you happy. Allah knows it. O Lord, if you know that I love to see them prosper, do good to them, maintain good relations with them, show kindness to them then help me day and night and reward me for my efforts. Otherwise, you are the One who know the hidden facts, then reward me for what i deserve, good for good and evil for evil. O Lord, grant them well being and grant well being through them. Make Stan to despair about us. Help them to obey you and grant them the opportunity to learn your guidance. My brothers, I wish and work to make you happy and strive for your well being. Allah guards whatever we say.” Al-‘Abbass then said, “I know your language very well. Your shovel can not find any soil with me to pick up.” The people dispersed at this point. May Allah send blessing up on Muhammad and his family."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (371/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 827,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:72:16",
        "text": [
          "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ وَ عُبَيْدِ اللَّهِ بْنِ الْمَرْزُبَانِ عَنِ ابْنِ سِنَانٍ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) مِنْ قَبْلِ أَنْ يَقْدَمَ الْعِرَاقَ بِسَنَةٍ وَ عَلِيٌّ ابْنُهُ جَالِسٌ بَيْنَ يَدَيْهِ فَنَظَرَ إِلَيَّ فَقَالَ يَا مُحَمَّدُ أَمَا إِنَّهُ سَيَكُونُ فِي هَذِهِ السَّنَةِ حَرَكَةٌ فَلَا تَجْزَعْ لِذَلِكَ قَالَ قُلْتُ وَ مَا يَكُونُ جُعِلْتُ فِدَاكَ فَقَدْ أَقْلَقَنِي مَا ذَكَرْتَ",
          "فَقَالَ أَصِيرُ إِلَى الطَّاغِيَةِ أَمَا إِنَّهُ لَا يَبْدَأُنِي مِنْهُ سُوءٌ وَ مِنَ الَّذِي يَكُونُ بَعْدَهُ قَالَ قُلْتُ وَ مَا يَكُونُ جُعِلْتُ فِدَاكَ قَالَ يُضِلُّ اللَّهُ الظَّالِمِينَ وَ يَفْعَلُ اللَّهُ مَا يَشَاءُ قَالَ قُلْتُ وَ مَا ذَاكَ جُعِلْتُ فِدَاكَ ",
          "قَالَ مَنْ ظَلَمَ ابْنِي هَذَا حَقَّهُ وَ جَحَدَ إِمَامَتَهُ مِنْ بَعْدِي كَانَ كَمَنْ ظَلَمَ عَلِيَّ بْنَ أَبِي طَالِبٍ حَقَّهُ وَ جَحَدَهُ إِمَامَتَهُ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ قُلْتُ وَ اللَّهِ لَئِنْ مَدَّ اللَّهُ لِي فِي الْعُمُرِ لَأُسَلِّمَنَّ لَهُ حَقَّهُ وَ لَأُقِرَّنَّ لَهُ بِإِمَامَتِهِ ",
          "قَالَ صَدَقْتَ يَا مُحَمَّدُ يَمُدُّ اللَّهُ فِي عُمُرِكَ وَ تُسَلِّمُ لَهُ حَقَّهُ وَ تُقِرُّ لَهُ بِإِمَامَتِهِ وَ إِمَامَةِ مَنْ يَكُونُ مِنْ بَعْدِهِ قَالَ قُلْتُ وَ مَنْ ذَاكَ قَالَ مُحَمَّدٌ ابْنُهُ قَالَ قُلْتُ لَهُ الرِّضَا وَ التَّسْلِيمُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Muhammad Bin Ali and Ubeydullah Bin Al Marzuban, from Ibn Sinan who said, ",
            "‘I went over to Abu Al-Hassan Musa<sup>asws</sup> from before he<sup>asws</sup> had proceeded to Al-Iraq by a year, and Ali<sup>asws</sup>, his<sup>asws</sup> son<sup>asws</sup> was seated in front of him<sup>asws</sup>. So he<sup>asws</sup> looked at me and he<sup>asws</sup> said: ‘O Muhammad! There would be happening, during this year, a disturbance, therefore do not panic due to that’. I said, ‘And what would happen? May I be sacrificed for you<sup>asws</sup>, as it has worried me, what you<sup>asws</sup> have mentioned’. ",
            "So he<sup>asws</sup> said: ‘I<sup>asws</sup> shall be going to the tyrant, it would begin for me<sup>asws</sup> evil from him and from the one who would happen to be after him’. I said, ‘And what would happen? May I be sacrificed for you<sup>asws</sup>!’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Lets to stray the unjust ones and He<sup>azwj</sup> Does whatever He<sup>azwj</sup> so Desires to’. I said, ‘And what is that? May I be sacrificed for you<sup>asws</sup>!",
            "He<sup>asws</sup> said: ‘The one who oppresses this son<sup>asws</sup> of mine<sup>asws</sup> of his<sup>asws</sup> rights and rejects his<sup>asws</sup> Imamate after me<sup>asws</sup>, would be like the one who oppressed Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> of his<sup>asws</sup> right and rejected his<sup>asws</sup> Imamate after Rasool-Allah<sup>saww</sup>’. I said, ‘By Allah<sup>azwj</sup>! If Allah<sup>azwj</sup> was to Extend for me regarding the life-span, I will submit to him<sup>asws</sup> his<sup>asws</sup> right and I will acknowledge to him<sup>asws</sup> with his<sup>asws</sup> Imamate’. ",
            "He<sup>asws</sup> said: ‘You speak the truth, O Muhammad! Allah<sup>azwj</sup> will Extend in your life-span and you will submit to him<sup>asws</sup> his<sup>asws</sup> right and accept to him<sup>asws</sup> with his<sup>asws</sup> Imamate, and the Imamate of the one<sup>asws</sup> who would happen to be after him<sup>asws</sup>’. I said, ‘And who is that?’ He<sup>asws</sup> said: ‘Muhammad<sup>asws</sup>, his<sup>asws</sup> son<sup>asws</sup>’. I said to him, ‘The agreement and the submission (from me)’."
          ],
          "en.sarwar": [
            " 16. Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Muhammad ibn Ali and ‘Abdallah ibn al-Marzuban from (Muhammad) ibn Sinan who has said the following. “Once I went to see abu al-Hassan Musa (a.s.) one year before he would leave for Iraq. His son Ali (a.s.) was also in the meeting. He looked at me and said, “O Muhammad, during this year a movement will take place do not be disturbed in it.” The narrator has said that he then asked the Imam (a.s.), “‘May Allah take my soul in service for your cause, what that will be? What you said has made me very anxious.” The Imam (a.s.) said, “I will journey to the tyrant. From his and one after him I will not suffer any serious harm.” The narrator has said that he then asked The Imam (a.s.), “‘May Allah take my soul in service for your cause, what then will happen?” The Imam (a.s.) said, “ Allah causes the unjust to go astray and He does whatever He wills.” The narrator has said that he then asked the Imam (a.s.), “‘May Allah take my soul in service for your cause, what is that will happen?” The Imam (a.s.) said, “Whoever will do injustice to my son this one, reject his Imamat (Leadership with Divine Authority) after me it would like doing injustice to Ali ibn abu Talib (a.s.) and reject his Imamat (Leadership with Divine Authority) after the Messenger of Allah.” The narrator has said that he then asked The Imam (a.s.), “By Allah, if Allah will grant me long life I will acknowledge his right and will affirm his Imamat (Leadership with Divine Authority).” The Imam (a.s.) said, “You have spoken the truth, O Muhammad. Allah will grant you long life.You will acknowledge his right and affirm his Imamat (Leadership with Divine Authority) and the Imamat of the one after him.” The narrator has said that he then asked The Imam (a.s.), “Who will he be?” The Imam (a.s.) said, “Muhammad, his son.” The narrator has said that he then asked The Imam (a.s.), “From me it is agreed and accepted.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:72",
  "kind": "verse_list"
}