{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 73"}, "path": "/books/al-kafi:1:4:73", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام )", "en": "Chapter 73 – The Indication and the wordings upon Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> (9<sup>th</sup> Imam<sup>asws</sup>)"}}], "index": 131, "local_index": 73, "part_type": "Chapter", "path": "/books/al-kafi:1:4:73", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام )", "en": "Chapter 73 – The Indication and the wordings upon Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> (9<sup>th</sup> Imam<sup>asws</sup>)"}, "verse_count": 14, "verse_start_index": 827, "verses": [{"index": 828, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ يَحْيَى بْنِ حَبِيبٍ الزَّيَّاتِ قَالَ أَخْبَرَنِي مَنْ كَانَ عِنْدَ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) جَالِساً فَلَمَّا نَهَضُوا قَالَ لَهُمُ الْقَوْا أَبَا جَعْفَرٍ فَسَلِّمُوا عَلَيْهِ وَ أَحْدِثُوا بِهِ عَهْداً فَلَمَّا نَهَضَ الْقَوْمُ الْتَفَتَ إِلَيَّ فَقَالَ يَرْحَمُ اللَّهُ الْمُفَضَّلَ إِنَّهُ كَانَ لَيَقْنَعُ بِدُونِ هَذَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Al Waleed, from Yahya Bin Habeeb Al Zayyat who said, \n‘He informed me, the one who was seated in the presence of Abu Al-Hassan Al-Reza<sup>asws</sup>, that when they (people) arose (to leave the gathering), he<sup>asws</sup> said to them: ‘Meet Abu Ja’far<sup>asws</sup>, so greet upon him<sup>asws</sup> and renew the Covenant with him<sup>asws</sup>’. So when the people left, he<sup>asws</sup> turned towards me and he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> be Merciful to Al-Mufazzal, he was content without this’."}]}, {"index": 829, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُعَمَّرِ بْنِ خَلَّادٍ قَالَ سَمِعْتُ الرِّضَا ( عليه السلام ) وَ ذَكَرَ شَيْئاً فَقَالَ مَا حَاجَتُكُمْ إِلَى ذَلِكَ هَذَا أَبُو جَعْفَرٍ قَدْ أَجْلَسْتُهُ مَجْلِسِي وَ صَيَّرْتُهُ مَكَانِي \nوَ قَالَ إِنَّا أَهْلُ بَيْتٍ يَتَوَارَثُ أَصَاغِرُنَا عَنْ أَكَابِرِنَا الْقُذَّةَ بِالْقُذَّةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Moammar Bin Khallad who said, \n‘I heard Al-Reza<sup>asws</sup> and something was mentioned, so he<sup>asws</sup> said: ‘What is your need to that? This here is Abu Ja’far<sup>asws</sup> whom I<sup>asws</sup> have seated in my<sup>asws</sup> seat and he<sup>asws</sup> has come to be in my<sup>asws</sup> place’. \nAnd he<sup style=\"font-weight: normal\">asws</sup> said: ‘We<sup style=\"font-weight: normal\">asws</sup>, the People<sup style=\"font-weight: normal\">asws</sup> of the Household, our<sup style=\"font-weight: normal\">asws</sup> young ones inherit from our<sup style=\"font-weight: normal\">asws</sup> older ones, the exactness with the exactness’."}]}, {"index": 830, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِيهِ مُحَمَّدِ بْنِ عِيسَى قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) فَنَاظَرَنِي فِي أَشْيَاءَ ثُمَّ قَالَ لِي يَا أَبَا عَلِيٍّ ارْتَفَعَ الشَّكُّ مَا لِأَبِي غَيْرِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from his father Muhammad Bin Isa who said, \n‘I went over to Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, so he<sup>asws</sup> debated with me regarding the things, then said to me: ‘O Abu Ali! Raise your doubts! There is none for my<sup>asws</sup> father<sup>asws</sup> apart from me<sup>asws</sup>’."}]}, {"index": 831, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ يَحْيَى عَنْ مَالِكِ بْنِ أَشْيَمَ عَنِ الْحُسَيْنِ بْنِ بَشَّارٍ قَالَ كَتَبَ ابْنُ قِيَامَا إِلَى أَبِي الْحَسَنِ ( عليه السلام ) كِتَاباً يَقُولُ فِيهِ كَيْفَ تَكُونُ إِمَاماً وَ لَيْسَ لَكَ وَلَدٌ فَأَجَابَهُ أَبُو الْحَسَنِ الرِّضَا ( عليه السلام ) شِبْهَ الْمُغْضَبِ وَ مَا عَلَّمَكَ أَنَّهُ لَا يَكُونُ لِي وَلَدٌ وَ اللَّهِ لَا تَمْضِي الْأَيَّامُ وَ اللَّيَالِي حَتَّى يَرْزُقَنِيَ اللَّهُ وَلَداً ذَكَراً يَفْرُقُ بِهِ بَيْنَ الْحَقِّ وَ الْبَاطِلِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Ja’far Bin Yahya, from Malik Bin Asheym, from Al Husayn Bin Bashhar who said, \n‘Abu Qiyama wrote a letter to Abu Al-Hassan<sup>asws</sup> saying in it, ‘How can you<sup>asws</sup> happen to be the Imam<sup>asws</sup> and there isn’t a son for you<sup>asws</sup>’. So Abu Al-Hassan Al-Reza<sup>asws</sup> answered, resembling the angry one: ‘And what would make you know that there would not happen to be a son for me<sup>asws</sup>? By Allah<sup>azwj</sup>! The days and the nights will not pass by until Allah<sup>azwj</sup> Graces me<sup>asws</sup> a male child, differentiating between the Truth and the falsehood’."}]}, {"index": 832, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:5", "text": "بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنِ ابْنِ أَبِي نَصْرٍ قَالَ قَالَ لِيَ ابْنُ النَّجَاشِيِّ مَنِ الْإِمَامُ بَعْدَ صَاحِبِكَ فَأَشْتَهِي أَنْ تَسْأَلَهُ حَتَّى أَعْلَمَ فَدَخَلْتُ عَلَى الرِّضَا ( عليه السلام ) فَأَخْبَرْتُهُ قَالَ فَقَالَ لِي الْإِمَامُ ابْنِي \nثُمَّ قَالَ هَلْ يَتَجَرَّأُ أَحَدٌ أَنْ يَقُولَ ابْنِي وَ لَيْسَ لَهُ وَلَدٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Some of our companions, from Muhammad Bin Ali, from Muawiya Bin Hukey, from Ibn Abu Nasr who said, \n‘Ibn Al-Najjashy said to me, ‘Who is the Imam<sup>asws</sup> after your Master<sup>asws</sup>?’ So I desire to ask him<sup>asws</sup> until I do know. So I went over to Al-Reza<sup>asws</sup> and informed him<sup>asws</sup>. So he<sup>asws</sup> said to me: ‘The (next) Imam<sup>asws</sup> is my<sup>asws</sup> son<sup>asws</sup>’. \nThen he<sup style=\"font-weight: normal\">asws</sup> said: ‘Would anyone has the audacity (courage) to say, ‘My son’, but there isn’t a son for him?’."}]}, {"index": 833, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:6", "text": "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُعَمَّرِ بْنِ خَلَّادٍ قَالَ ذَكَرْنَا عِنْدَ أَبِي الْحَسَنِ ( عليه السلام ) شَيْئاً بَعْدَ مَا وُلِدَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) فَقَالَ مَا حَاجَتُكُمْ إِلَى ذَلِكَ هَذَا أَبُو جَعْفَرٍ قَدْ أَجْلَسْتُهُ مَجْلِسِي وَ صَيَّرْتُهُ فِي مَكَانِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Mihran, from Muhammad Bin Ali, from Moammar Bin Khallad who said, \n‘We mentioned something in the presence of Abu Al-Hassan<sup>asws</sup> after (he<sup>asws</sup> was) blessed with Abu Ja’far<sup>asws</sup> (9<sup>th</sup> Imam<sup>asws</sup>), so he<sup>asws</sup> said: ‘What is your need to that? This here is Abu Ja’far<sup>asws</sup>. I<sup>asws</sup> have seated him<sup>asws</sup> in my<sup>asws</sup> seat, and he<sup>asws</sup> has come to be in my<sup>asws</sup> place’."}]}, {"index": 834, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:7", "text": "أَحْمَدُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ ابْنِ قِيَامَا الْوَاسِطِيِّ قَالَ دَخَلْتُ عَلَى عَلِيِّ بْنِ مُوسَى ( عليه السلام ) فَقُلْتُ لَهُ أَ يَكُونُ إِمَامَانِ قَالَ لَا إِلَّا وَ أَحَدُهُمَا صَامِتٌ فَقُلْتُ لَهُ هُوَ ذَا أَنْتَ لَيْسَ لَكَ صَامِتٌ وَ لَمْ يَكُنْ وُلِدَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) بَعْدُ فَقَالَ لِي وَ اللَّهِ لَيَجْعَلَنَّ اللَّهُ مِنِّي مَا يُثْبِتُ بِهِ الْحَقَّ وَ أَهْلَهُ وَ يَمْحَقُ بِهِ الْبَاطِلَ وَ أَهْلَهُ فَوُلِدَ لَهُ بَعْدَ سَنَةٍ أَبُو جَعْفَرٍ ( عليه السلام ) وَ كَانَ ابْنُ قِيَامَا وَاقِفِيّاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad, from Muhammad Bin Ali, from Ibn Qiyama Al Wasity who said, \n‘I went over to Ali<sup>asws</sup> Bin Musa<sup>asws</sup> and I said to him<sup>asws</sup>, ‘Can there happen to be two Imams<sup>asws</sup>?’ He<sup>asws</sup> said: ‘No, except one of the two would be silent’. So I said to him<sup>asws</sup>, ‘It is that. You<sup>asws</sup> are such that there isn’t a silent one for you<sup>asws</sup>’, and he<sup>asws</sup> had not (yet) been blessed with Abu Ja’far<sup>asws</sup>. So he<sup>asws</sup> said to me: ‘By Allah<sup>azwj</sup>! Allah<sup>azwj</sup> would be Making from me<sup>asws</sup> what the Truth will be established with and its people, and the Falsehood would be Obliterated with and its people’. So, after a year, he<sup>asws</sup> was blessed with Abu Ja’far<sup>asws</sup>. And it was so that Qiyama (the narrator) was a Waqifite (a sect)’."}]}, {"index": 835, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:8", "text": "أَحْمَدُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ الْحَسَنِ بْنِ الْجَهْمِ قَالَ كُنْتُ مَعَ أَبِي الْحَسَنِ ( عليه السلام ) جَالِساً فَدَعَا بِابْنِهِ وَ هُوَ صَغِيرٌ فَأَجْلَسَهُ فِي حَجْرِي فَقَالَ لِي جَرِّدْهُ وَ انْزِعْ قَمِيصَهُ فَنَزَعْتُهُ فَقَالَ لِيَ انْظُرْ بَيْنَ كَتِفَيْهِ فَنَظَرْتُ فَإِذَا فِي أَحَدِ كَتِفَيْهِ شَبِيهٌ بِالْخَاتَمِ دَاخِلٌ فِي اللَّحْمِ ثُمَّ قَالَ أَ تَرَى هَذَا كَانَ مِثْلُهُ فِي هَذَا الْمَوْضِعِ مِنْ أَبِي ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad, from Muhammad Bin Ali, from Al Hassan Bin Al Jahm who said, \n‘I was seated with Abu Al-Hassan<sup>asws</sup>, so he<sup>asws</sup> called for his<sup>asws</sup> son<sup>asws</sup>, and he<sup>asws</sup> was small, so he<sup>asws</sup> seated him<sup>asws</sup> in his<sup>asws</sup> lap, and he<sup>asws</sup> said to me: ‘Disrobe him<sup>asws</sup> by removing his<sup>asws</sup> shirt’. So I removed it, and he<sup>asws</sup> said: ‘Look between his<sup>asws</sup> two shoulders’. So I looked and there was in one of his<sup>asws</sup> shoulder, resembling a seal entered into the flesh. Then he<sup>asws</sup> said: ‘Do you see this?’ The like of it was in this place from my<sup>asws</sup> father<sup>asws</sup>’."}]}, {"index": 836, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:9", "text": "عَنْهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِي يَحْيَى الصَّنْعَانِيِّ قَالَ كُنْتُ عِنْدَ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فَجِي‏ءَ بِابْنِهِ أَبِي جَعْفَرٍ ( عليه السلام ) وَ هُوَ صَغِيرٌ فَقَالَ هَذَا الْمَوْلُودُ الَّذِي لَمْ يُولَدْ مَوْلُودٌ أَعْظَمُ بَرَكَةً عَلَى شِيعَتِنَا مِنْهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Muhammad Bin Ali, from Abu Yahya Al Sana’ny who said, \n‘I was in the presence of Abu Al-Hassan Al-Reza<sup>asws</sup>, so they came with his<sup>asws</sup> son<sup>asws</sup> Abu Ja’far<sup>asws</sup> and he<sup>asws</sup> was small. So he<sup>asws</sup> said: ‘This is the Blessed event which none has been begotten as being of greater Blessings upon our<sup>asws</sup> Shias than him<sup>asws</sup>’."}]}, {"index": 837, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:10", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ قُلْتُ لِلرِّضَا ( عليه السلام ) قَدْ كُنَّا نَسْأَلُكَ قَبْلَ أَنْ يَهَبَ اللَّهُ لَكَ أَبَا جَعْفَرٍ ( عليه السلام ) فَكُنْتَ تَقُولُ يَهَبُ اللَّهُ لِي غُلَاماً فَقَدْ وَهَبَهُ اللَّهُ لَكَ فَأَقَرَّ عُيُونَنَا فَلَا أَرَانَا اللَّهُ يَوْمَكَ فَإِنْ كَانَ كَوْنٌ فَإِلَى مَنْ فَأَشَارَ بِيَدِهِ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) وَ هُوَ قَائِمٌ بَيْنَ يَدَيْهِ فَقُلْتُ جُعِلْتُ فِدَاكَ هَذَا ابْنُ ثَلَاثِ سِنِينَ فَقَالَ وَ مَا يَضُرُّهُ مِنْ ذَلِكَ فَقَدْ قَامَ عِيسَى ( عليه السلام ) بِالْحُجَّةِ وَ هُوَ ابْنُ ثَلَاثِ سِنِينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Safwan Bin Yahya who said, \n‘I said to Al-Reza<sup>asws</sup>, ‘We had asked you<sup>asws</sup> before Allah<sup>azwj</sup> had Endowed Abu Ja’far<sup>asws</sup> to you<sup>asws</sup>, so you<sup>asws</sup> had said: ‘Allah<sup>azwj</sup> would Endown unto me<sup>asws</sup> a boy’. So Allah<sup>azwj</sup> has Endowed him<sup>asws</sup> to you<sup>asws</sup> and our eyes are delighted. So, may Allah<sup>azwj</sup> not Show us your<sup>asws</sup> day (of passing away). So if it does happen, so to whom?’ So he<sup>asws</sup> gestured to Abu Ja’far<sup>asws</sup>, and he<sup>asws</sup> was standing in front of him<sup>asws</sup>. So I said, ‘May I be sacrificed for you<sup>asws</sup>! This is a boy of three years!’. So he<sup>asws</sup> said: ‘And what would harm him<sup>asws</sup> from that? Isa<sup>as</sup> had stood with the Divine Authority and he<sup>as</sup> was a boy of three years’."}]}, {"index": 838, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:11", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ مُعَمَّرِ بْنِ خَلَّادٍ قَالَ سَمِعْتُ إِسْمَاعِيلَ بْنَ إِبْرَاهِيمَ يَقُولُ لِلرِّضَا ( عليه السلام ) إِنَّ ابْنِي فِي لِسَانِهِ ثِقْلٌ فَأَنَا أَبْعَثُ بِهِ إِلَيْكَ غَداً تَمْسَحُ عَلَى رَأْسِهِ وَ تَدْعُو لَهُ فَإِنَّهُ مَوْلَاكَ فَقَالَ هُوَ مَوْلَى أَبِي جَعْفَرٍ فَابْعَثْ بِهِ غَداً إِلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Moammar Bin Khallad who said, \n‘I heard Ismail Bin Ibrahim saying to Al-Reza<sup>asws</sup>, ‘My son has heaviness in his tongue, so I would be sending him to you<sup>asws</sup> tomorrow for you<sup>asws</sup> to wipe upon his head and supplicate for him, for he is in your<sup>asws</sup> Wilayah’. So he<sup>asws</sup> said: ‘He is in the Wilayah of Abu Ja’far<sup>asws</sup> (9<sup>th</sup> Imam<sup>asws</sup>) therefore send him to him<sup>asws</sup> tomorrow’."}]}, {"index": 839, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:12", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ مُحَمَّدِ بْنِ خَلَّادٍ الصَّيْقَلِ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ عَمَّارٍ قَالَ كُنْتُ عِنْدَ عَلِيِّ بْنِ جَعْفَرِ بْنِ مُحَمَّدٍ جَالِساً بِالْمَدِينَةِ وَ كُنْتُ أَقَمْتُ عِنْدَهُ سَنَتَيْنِ أَكْتُبُ عَنْهُ مَا يَسْمَعُ مِنْ أَخِيهِ يَعْنِي أَبَا الْحَسَنِ ( عليه السلام ) إِذْ دَخَلَ عَلَيْهِ أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيٍّ الرِّضَا ( عليه السلام ) الْمَسْجِدَ مَسْجِدَ الرَّسُولِ ( صلى الله عليه وآله ) فَوَثَبَ عَلِيُّ بْنُ جَعْفَرٍ بِلَا حِذَاءٍ وَ لَا رِدَاءٍ فَقَبَّلَ يَدَهُ وَ عَظَّمَهُ فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) يَا عَمِّ اجْلِسْ رَحِمَكَ اللَّهُ فَقَالَ يَا سَيِّدِي كَيْفَ أَجْلِسُ وَ أَنْتَ قَائِمٌ \nفَلَمَّا رَجَعَ عَلِيُّ بْنُ جَعْفَرٍ إِلَى مَجْلِسِهِ جَعَلَ أَصْحَابُهُ يُوَبِّخُونَهُ وَ يَقُولُونَ أَنْتَ عَمُّ أَبِيهِ وَ أَنْتَ تَفْعَلُ بِهِ هَذَا الْفِعْلَ فَقَالَ اسْكُتُوا إِذَا كَانَ اللَّهُ عَزَّ وَ جَلَّ وَ قَبَضَ عَلَى لِحْيَتِهِ لَمْ يُؤَهِّلْ هَذِهِ الشَّيْبَةَ وَ أَهَّلَ هَذَا الْفَتَى وَ وَضَعَهُ حَيْثُ وَضَعَهُ أُنْكِرُ فَضْلَهُ نَعُوذُ بِاللَّهِ مِمَّا تَقُولُونَ بَلْ أَنَا لَهُ عَبْدٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Muhammad Bin Ahmad Al Nahdy, from Muhammad Bin Khallad Al Sayqal, from Muhammad Bin Al Hassan Bin Ammar who said, \n‘I was seated in the presence of Ali son of Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> at Al-Medina, and I was staying with him for two years, writing from him what he had heard from his brother<sup>asws</sup>, meaning Abu Al-Hassan<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) when Abu Ja’far Muhammad<sup>asws</sup> Bin Ali Al-Reza<sup>asws</sup> entered the Masjid, the Masjid of Rasool-Allah<sup>saww</sup>. So Ali Bin Ja’far<sup>asws</sup> leapt up without any shoes nor a robe, and he kissed his<sup>asws</sup> hand and revered him<sup>asws</sup>. So Abu Ja’far<sup>asws</sup> said to him, ‘O Uncle, be seated, may Allah<sup>azwj</sup> have Mercy on you’. So he said, ‘O my Chief<sup>asws</sup>! How can I sit while you<sup>asws</sup> are standing?’ \nSo when Ali son of Ja’far<sup>asws</sup> returned to his gathering, his companions went on rebuking him and they were saying, ‘You are an uncle of his<sup>asws</sup> father<sup>asws</sup>, and you are doing this deed with him<sup>asws</sup>?’ So he said, ‘Be silent! When it was so that Allah<sup>azwj</sup> Mighty and Majestic’, and he grabbed his own beard, ‘has not Sanctified this old man and has Sanctified this youth, and Placed him<sup>asws</sup> where He<sup>azwj</sup> Placed him<sup>asws</sup>, (how can I) deny his<sup>asws</sup> merits? I seek Refuge with Allah<sup>azwj</sup> from what you are saying. But, I am a slave of his<sup>asws</sup>’."}]}, {"index": 840, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:13", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ الْخَيْرَانِيِّ عَنْ أَبِيهِ قَالَ كُنْتُ وَاقِفاً بَيْنَ يَدَيْ أَبِي الْحَسَنِ ( عليه السلام ) بِخُرَاسَانَ فَقَالَ لَهُ قَائِلٌ يَا سَيِّدِي إِنْ كَانَ كَوْنٌ فَإِلَى مَنْ قَالَ إِلَى أَبِي جَعْفَرٍ ابْنِي فَكَأَنَّ الْقَائِلَ اسْتَصْغَرَ سِنَّ أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ أَبُو الْحَسَنِ  ( عليه السلام ) إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى بَعَثَ عِيسَى ابْنَ مَرْيَمَ رَسُولًا نَبِيّاً صَاحِبَ شَرِيعَةٍ مُبْتَدَأَةٍ فِي أَصْغَرَ مِنَ السِّنِّ الَّذِي فِيهِ أَبُو جَعْفَرٍ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Al Khayrani, from his father who said, \n‘I had paused in front of Abu Al-Hassan<sup>asws</sup> at Khurasan, so a speaker said to him<sup>asws</sup>, ‘O my Chief! If there was an occurrence (death), so to whom?’ He<sup>asws</sup> said: ‘To Abu Ja’far<sup>asws</sup>, my<sup>asws</sup> son<sup>asws</sup>’. So it was as if the speaker was belittling the (young) age of Abu Ja’far<sup>asws</sup>. So Abu Al-Hassan<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High Sent Isa<sup>as</sup> Ibn Maryam<sup>as</sup> as a Rasool<sup>as</sup>, a Prophet<sup>as</sup>, an owner of a Law, commencing during an age smaller than that which is in Abu Ja’far<sup>asws</sup>’."}]}, {"index": 841, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:1:4:73:14", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنْ زَكَرِيَّا بْنِ يَحْيَى بْنِ النُّعْمَانِ الصَّيْرَفِيِّ قَالَ سَمِعْتُ عَلِيَّ بْنَ جَعْفَرٍ يُحَدِّثُ الْحَسَنَ بْنَ الْحُسَيْنِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ فَقَالَ وَ اللَّهِ لَقَدْ نَصَرَ اللَّهُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) فَقَالَ لَهُ الْحَسَنُ إِي وَ اللَّهِ جُعِلْتُ فِدَاكَ لَقَدْ بَغَى عَلَيْهِ إِخْوَتُهُ فَقَالَ عَلِيُّ بْنُ جَعْفَرٍ إِي وَ اللَّهِ وَ نَحْنُ عُمُومَتُهُ بَغَيْنَا عَلَيْهِ\nفَقَالَ لَهُ الْحَسَنُ جُعِلْتُ فِدَاكَ كَيْفَ صَنَعْتُمْ فَإِنِّي لَمْ أَحْضُرْكُمْ قَالَ قَالَ لَهُ إِخْوَتُهُ وَ نَحْنُ أَيْضاً مَا كَانَ فِينَا إِمَامٌ قَطُّ حَائِلَ اللَّوْنِ فَقَالَ لَهُمُ الرِّضَا ( عليه السلام ) هُوَ ابْنِي قَالُوا فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَدْ قَضَى بِالْقَافَةِ فَبَيْنَنَا وَ بَيْنَكَ الْقَافَةُ قَالَ ابْعَثُوا أَنْتُمْ إِلَيْهِمْ فَأَمَّا أَنَا فَلَا وَ لَا تُعْلِمُوهُمْ لِمَا دَعَوْتُمُوهُمْ وَ لْتَكُونُوا فِي بُيُوتِكُمْ \nفَلَمَّا جَاءُوا أَقْعَدُونَا فِي الْبُسْتَانِ وَ اصْطَفَّ عُمُومَتُهُ وَ إِخْوَتُهُ وَ أَخَوَاتُهُ وَ أَخَذُوا الرِّضَا ( عليه السلام ) وَ أَلْبَسُوهُ جُبَّةَ صُوفٍ وَ قَلَنْسُوَةً مِنْهَا وَ وَضَعُوا عَلَى عُنُقِهِ مِسْحَاةً وَ قَالُوا لَهُ ادْخُلِ الْبُسْتَانَ كَأَنَّكَ تَعْمَلُ فِيهِ ثُمَّ جَاءُوا بِأَبِي جَعْفَرٍ ( عليه السلام ) فَقَالُوا أَلْحِقُوا هَذَا الْغُلَامَ بِأَبِيهِ فَقَالُوا لَيْسَ لَهُ هَاهُنَا أَبٌ وَ لَكِنَّ هَذَا عَمُّ أَبِيهِ وَ هَذَا عَمُّ أَبِيهِ وَ هَذَا عَمُّهُ وَ هَذِهِ عَمَّتُهُ وَ إِنْ يَكُنْ لَهُ هَاهُنَا أَبٌ فَهُوَ صَاحِبُ الْبُسْتَانِ فَإِنَّ قَدَمَيْهِ وَ قَدَمَيْهِ وَاحِدَةٌ فَلَمَّا رَجَعَ أَبُو الْحَسَنِ ( عليه السلام ) قَالُوا هَذَا أَبُوهُ\nقَالَ عَلِيُّ بْنُ جَعْفَرٍ فَقُمْتُ فَمَصَصْتُ رِيقَ أَبِي جَعْفَرٍ ( عليه السلام ) ثُمَّ قُلْتُ لَهُ أَشْهَدُ أَنَّكَ إِمَامِي عِنْدَ اللَّهِ فَبَكَى الرِّضَا ( عليه السلام ) ثُمَّ قَالَ يَا عَمِّ أَ لَمْ تَسْمَعْ أَبِي وَ هُوَ يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِأَبِي ابْنُ خِيَرَةِ الْإِمَاءِ ابْنُ النُّوبِيَّةِ الطَّيِّبَةِ الْفَمِ الْمُنْتَجَبَةِ الرَّحِمِ \nوَيْلَهُمْ لَعَنَ اللَّهُ الْأُعَيْبِسَ وَ ذُرِّيَّتَهُ صَاحِبَ الْفِتْنَةِ وَ يَقْتُلُهُمْ سِنِينَ وَ شُهُوراً وَ أَيَّاماً يَسُومُهُمْ خَسْفاً وَ يَسْقِيهِمْ كَأْساً مُصْبِرَةً وَ هُوَ الطَّرِيدُ الشَّرِيدُ الْمَوْتُورُ بِأَبِيهِ وَ جَدِّهِ صَاحِبُ \nالْغَيْبَةِ يُقَالُ مَاتَ أَوْ هَلَكَ أَيَّ وَادٍ سَلَكَ أَ فَيَكُونُ هَذَا يَا عَمِّ إِلَّا مِنِّي فَقُلْتُ صَدَقْتَ جُعِلْتُ فِدَاكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father and Ali Bin Muhammad Al Qasany, altogether from Zakariyya Bin Yahya Bin Al Nu’man Al Sayrafi who said, \n‘I heard Ali son of Ja’far<sup>asws</sup> narrating to Al-Hassan Bin Al-Husayn Bin Ali Bin Al-Husayn, so he said, ‘By Allah<sup>azwj</sup>! Allah<sup>azwj</sup> has Granted victory to Abu Al-Hassan Al-Reza<sup>asws</sup>’. So Al-Hassan said to him, ‘Yes, by Allah<sup>azwj</sup>, may I be sacrificed for you! His<sup>asws</sup> brothers had rebelled against him<sup>asws</sup>’. So Ali son of Ja’far<sup>asws</sup> said, ‘Yes, by Allah<sup>azwj</sup>, we, his<sup>asws</sup> uncles, had (also) rebelled against him<sup>asws</sup>’. \nSo Al-Hassan said to him, ‘May I be sacrificed for you! How did you behave, for I was not present with you all’. He said, ‘His<sup>asws</sup> brothers said to him<sup>asws</sup>, and us as well, ‘There has not been among us an Imam<sup>asws</sup> at all of a dark complexion’. So Al-Reza<sup>asws</sup> said to them: ‘He<sup>asws</sup> is my<sup>asws</sup> son<sup>asws</sup>!’. So they said, ‘Rasool-Allah<sup>saww</sup> had judged (characters) based on appearance, therefore between us and you<sup>asws</sup> is the appearance’. He<sup>asws</sup> said: ‘You can send for them (experts in physiology), but as for I<sup>asws</sup>, so no, and do not let them know what you are inviting them for, and let them happen to be in your houses’. \nSo when they came, we got them to be seated in the orchard, and chose his<sup>asws</sup> uncles, and his<sup>asws</sup> brothers, and his<sup>asws</sup> sisters, and they took Al-Reza<sup>asws</sup> and clothed him<sup>asws</sup> in a woollen robe and a skull cap and placed a spade upon his neck, and they said to him<sup>asws</sup>, ‘Enter the orchard as if you<sup>asws</sup> are working in it’. Then they came with Abu Ja’far<sup>asws</sup> and they said (to the experts in physiology), ‘Link this boy to his<sup>asws</sup> father<sup>asws</sup>’. So they said, ‘There isn’t a father for him<sup>asws</sup> over here, but, this here is an uncle of his<sup>asws</sup> father<sup>asws</sup>, and this one is an uncle of his<sup>asws</sup> father<sup>asws</sup>, and this is his<sup>asws</sup> uncle, and this here is his<sup>asws</sup> paternal aunt, and if there was a father of his<sup>asws</sup> over here, so he<sup>asws</sup> is the one in the orchard, for his<sup>asws</sup> feet and his<sup>asws</sup> feet are one’. So when Abu Al-Hassan<sup>asws</sup> returned, they said, ‘This is his<sup>asws</sup> father<sup>asws</sup>!’ \nAli Bin Ja’far said, ‘So I stood and I extracted the saliva of Abu Ja’far<sup>asws</sup>, then I said to him<sup>asws</sup>, ‘I testify that you<sup>asws</sup> are my Imam<sup>asws</sup> in the Presence of Allah<sup>azwj</sup>’. So Al-Reza<sup>asws</sup> wept, then said: ‘O Uncle! Why did you not listen to my<sup>asws</sup> father<sup>asws</sup> and he<sup>asws</sup> was saying: ‘Rasool-Allah<sup>saww</sup> said: ‘May my<sup>saww</sup> father<sup>as</sup> be for the son of the best of the slave girls of the sons of Nubia (Sudan), the aromatic of the mouth, the excellent of the womb!’. \nWoe be unto them! May Allah<sup>azwj</sup> Curse the Abbasides and their offspring, the owners of the strife who have killed them (Imams<sup>asws</sup>) for years and months and days. They poisoned them<sup>asws</sup> and made them<sup>asws</sup> sick by sealed goblets, and he<sup>asws</sup> would be in exile, homeless, suffering the pain of his<sup>asws</sup> father<sup>asws</sup> and his<sup>asws</sup> grandfather. \n(as for) the Occultation, it would be said, ‘He<sup>asws</sup> died, or perished’. (No one will know) which valley he<sup>asws</sup> would be travelling in. O Uncle! Can this happen to be except from me<sup>asws</sup>?’ So I said, ‘You<sup>asws</sup> speak the truth, may I be sacrificed for you<sup>asws</sup>!’."}]}]}, "index": "al-kafi:1:4:73", "kind": "verse_list"}