{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 74"}, "path": "/books/al-kafi:1:4:74", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام )", "en": "Chapter 74 – The Indication and the wordings upon Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup>. (10<sup>th</sup> Imam<sup>asws</sup>)"}}], "index": 132, "local_index": 74, "part_type": "Chapter", "path": "/books/al-kafi:1:4:74", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام )", "en": "Chapter 74 – The Indication and the wordings upon Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup>. (10<sup>th</sup> Imam<sup>asws</sup>)"}, "verse_count": 3, "verse_start_index": 841, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 842, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:74:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ قَالَ لَمَّا خَرَجَ أَبُو جَعْفَرٍ ( عليه السلام ) مِنَ الْمَدِينَةِ إِلَى بَغْدَادَ فِي الدَّفْعَةِ الْأُولَى مِنْ خَرْجَتَيْهِ قُلْتُ لَهُ عِنْدَ خُرُوجِهِ جُعِلْتُ فِدَاكَ إِنِّي أَخَافُ عَلَيْكَ فِي هَذَا الْوَجْهِ فَإِلَى مَنِ الْأَمْرُ بَعْدَكَ فَكَرَّ بِوَجْهِهِ إِلَيَّ ضَاحِكاً وَ قَالَ لَيْسَ الْغَيْبَةُ حَيْثُ ظَنَنْتَ فِي هَذِهِ السَّنَةِ ", "فَلَمَّا أُخْرِجَ بِهِ الثَّانِيَةَ إِلَى الْمُعْتَصِمِ صِرْتُ إِلَيْهِ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ أَنْتَ خَارِجٌ فَإِلَى مَنْ هَذَا الْأَمْرُ مِنْ بَعْدِكَ فَبَكَى حَتَّى اخْضَلَّتْ لِحْيَتُهُ ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ عِنْدَ هَذِهِ يُخَافُ عَلَيَّ الْأَمْرُ مِنْ بَعْدِي إِلَى ابْنِي عَلِيٍّ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ismail Bin Mihran who said, ", "‘When Abu Ja’far<sup>asws</sup> went out from Al-Medina to Baghdad during the first time from his<sup>asws</sup> two such exits, I said to him<sup>asws</sup> during his<sup>asws</sup> exiting, ‘May I be sacrificed for you<sup>asws</sup>! I fear upon you during this direction, so to whom would be the command (Imamate) after you<sup>asws</sup>?’ So he<sup>asws</sup> turned his<sup>asws</sup> face towards me smiling and said: ‘The Occultation isn’t to be during this year, where your thoughts are’. ", "So when they went out with him<sup>asws</sup> for the second time to Al-Mu’tasim (the Caliph), I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! You<sup>asws</sup> are going out, so to whom would this command (Imamate) be from after you<sup>asws</sup>?’ So he<sup>asws</sup> wept until his<sup>asws</sup> beard was soaked. Then he<sup>asws</sup> turned towards me and he<sup>asws</sup> said: ‘This is what you had feared upon me<sup>asws</sup>. The command (Imamate) from after me<sup>asws</sup> is to my<sup>asws</sup> son<sup>asws</sup> Ali<sup>asws</sup>’ (10<sup>th</sup> Imam<sup>asws</sup>)."]}}, {"index": 843, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:74:2", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ الْخَيْرَانِيِّ عَنْ أَبِيهِ أَنَّهُ قَالَ كَانَ يَلْزَمُ بَابَ أَبِي جَعْفَرٍ ( عليه السلام ) لِلْخِدْمَةِ الَّتِي كَانَ وُكِّلَ بِهَا وَ كَانَ أَحْمَدُ بْنُ مُحَمَّدِ بْنِ عِيسَى يَجِي‏ءُ فِي السَّحَرِ فِي كُلِّ لَيْلَةٍ لِيَعْرِفَ خَبَرَ عِلَّةِ أَبِي جَعْفَرٍ ( عليه السلام ) وَ كَانَ الرَّسُولُ الَّذِي يَخْتَلِفُ بَيْنَ أَبِي جَعْفَرٍ ( عليه السلام ) وَ بَيْنَ أَبِي إِذَا حَضَرَ قَامَ أَحْمَدُ وَ خَلَا بِهِ أَبِي", "فَخَرَجْتُ ذَاتَ لَيْلَةٍ وَ قَامَ أَحْمَدُ عَنِ الْمَجْلِسِ وَ خَلَا أَبِي بِالرَّسُولِ وَ اسْتَدَارَ أَحْمَدُ فَوَقَفَ حَيْثُ يَسْمَعُ الْكَلَامَ فَقَالَ الرَّسُولُ لِأَبِي إِنَّ مَوْلَاكَ يَقْرَأُ عَلَيْكَ السَّلَامَ وَ يَقُولُ لَكَ إِنِّي مَاضٍ وَ الْأَمْرُ صَائِرٌ إِلَى ابْنِي عَلِيٍّ وَ لَهُ عَلَيْكُمْ بَعْدِي مَا كَانَ لِي عَلَيْكُمْ بَعْدَ أَبِي", "ثُمَّ مَضَى الرَّسُولُ وَ رَجَعَ أَحْمَدُ إِلَى مَوْضِعِهِ وَ قَالَ لِأَبِي مَا الَّذِي قَدْ قَالَ لَكَ قَالَ خَيْراً قَالَ قَدْ سَمِعْتُ مَا قَالَ فَلِمَ تَكْتُمُهُ وَ أَعَادَ مَا سَمِعَ فَقَالَ لَهُ أَبِي قَدْ حَرَّمَ اللَّهُ عَلَيْكَ مَا فَعَلْتَ لِأَنَّ اللَّهَ تَعَالَى يَقُولُ وَ لا تَجَسَّسُوا فَاحْفَظِ الشَّهَادَةَ لَعَلَّنَا نَحْتَاجُ إِلَيْهَا يَوْماً مَا وَ إِيَّاكَ أَنْ تُظْهِرَهَا إِلَى وَقْتِهَا", "فَلَمَّا أَصْبَحَ أَبِي كَتَبَ نُسْخَةَ الرِّسَالَةِ فِي عَشْرِ رِقَاعٍ وَ خَتَمَهَا وَ دَفَعَهَا إِلَى عَشْرَةٍ مِنْ وُجُوهِ الْعِصَابَةِ وَ قَالَ إِنْ حَدَثَ بِي حَدَثُ الْمَوْتِ قَبْلَ أَنْ أُطَالِبَكُمْ بِهَا فَافْتَحُوهَا وَ أَعْلِمُوا بِمَا فِيهَا", "فَلَمَّا مَضَى أَبُو جَعْفَرٍ ( عليه السلام ) ذَكَرَ أَبِي أَنَّهُ لَمْ يَخْرُجْ مِنْ مَنْزِلِهِ حَتَّى قَطَعَ عَلَى يَدَيْهِ نَحْوٌ مِنْ أَرْبَعِمِائَةِ إِنْسَانٍ وَ اجْتَمَعَ رُؤَسَاءُ الْعِصَابَةِ عِنْدَ مُحَمَّدِ بْنِ الْفَرَجِ يَتَفَاوَضُونَ هَذَا الْأَمْرَ فَكَتَبَ مُحَمَّدُ بْنُ الْفَرَجِ إِلَى أَبِي يُعْلِمُهُ بِاجْتِمَاعِهِمْ عِنْدَهُ وَ أَنَّهُ لَوْ لَا مَخَافَةُ الشُّهْرَةِ لَصَارَ مَعَهُمْ إِلَيْهِ وَ يَسْأَلُهُ أَنْ يَأْتِيَهُ", "فَرَكِبَ أَبِي وَ صَارَ إِلَيْهِ فَوَجَدَ الْقَوْمَ مُجْتَمِعِينَ عِنْدَهُ فَقَالُوا لِأَبِي مَا تَقُولُ فِي هَذَا الْأَمْرِ فَقَالَ أَبِي لِمَنْ عِنْدَهُ الرِّقَاعُ أَحْضِرُوا الرِّقَاعَ فَأَحْضَرُوهَا فَقَالَ لَهُمْ هَذَا مَا أُمِرْتُ بِهِ فَقَالَ بَعْضُهُمْ قَدْ كُنَّا نُحِبُّ أَنْ يَكُونَ مَعَكَ فِي هَذَا الْأَمْرِ شَاهِدٌ آخَرُ", "فَقَالَ لَهُمْ قَدْ أَتَاكُمُ اللَّهُ عَزَّ وَ جَلَّ بِهِ هَذَا أَبُو جَعْفَرٍ الْأَشْعَرِيُّ يَشْهَدُ لِي بِسَمَاعِ هَذِهِ الرِّسَالَةِ وَ سَأَلَهُ أَنْ يَشْهَدَ بِمَا عِنْدَهُ فَأَنْكَرَ أَحْمَدُ أَنْ يَكُونَ سَمِعَ مِنْ هَذَا شَيْئاً فَدَعَاهُ أَبِي إِلَى الْمُبَاهَلَةِ ", "فَقَالَ لَمَّا حَقَّقَ عَلَيْهِ قَالَ قَدْ سَمِعْتُ ذَلِكَ وَ هَذَا مَكْرُمَةٌ كُنْتُ أُحِبُّ أَنْ تَكُونَ لِرَجُلٍ مِنَ الْعَرَبُ لَا لِرَجُلٍ مِنَ الْعَجَمِ فَلَمْ يَبْرَحِ الْقَوْمُ حَتَّى قَالُوا بِالْحَقِّ جَمِيعاً ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Al Kahyrani, from his father, said, ", "‘He (my father) had necessitated the door of Abu Ja’far<sup>asws</sup> for the service (as a doorman) which he<sup>asws</sup> had allocated with, and it was so that Ahmad Bin Muhammad Bin Isa used to come during the dawn of every night in order to know the news of the illness of Abu Ja’far<sup>asws</sup> (9<sup>th</sup> Imam<sup>asws</sup>) and there was the messenger who used to come and go between Abu Ja’far<sup>asws</sup> and my father. Whenever he (the messenger) was present, Ahmad would arise and my father would be alone with him (the messenger). ", "So I went out one night and Ahmad stood from the gathering and my father was alone with the messenger, and Ahmad was circling around. So he paused, when he heard the speech, and the messenger said to my father, ‘Your Master<sup>asws</sup> conveys the greetings upon you and is saying to you: ‘I<sup>asws</sup> am going to pass away and the command (Imamate) is going to (be with) my<sup>asws</sup> son<sup>asws</sup> Ali<sup>asws</sup>, and for him<sup>asws</sup> upon you all, after me<sup>asws</sup> would be what is for me<sup>asws</sup> upon you after my<sup>asws</sup> father<sup>asws</sup>’. ", "Then the messenger went away and Ahmad returned to his place and said to my father, ‘What is that which he had said to you?’ He said, ‘Good’. He said, ‘I have heard what he said, therefore do not conceal it’, and he repeated what he had heard. So my father said to him, ‘Allah<sup>azwj</sup> has Prohibited upon you what you did because Allah<sup>azwj</sup> the Exalted is Saying <span class=\"ibTxt\">[49:12] and do not spy</span>, therefore preserve the testimony for perhaps we would be needy to it one day and beware of manifesting it before its time’. ", "So when it was morning, my father copied the message in ten papers and sealed these and handed these over to ten from the clan and said, ‘If there occurs with me an occurrence of death before I seek these from you all, so open these and get to know with whatever is in it’. ", "So when Abu Ja’far<sup>asws</sup> passed away, my father mentioned that he would not come out from his house until about four hundred persons had cut off (from others) upon his hands, and he gathered the chiefs of the community in the presence of Muhammad Bin Al-Faraj negotiating this matter. So Muhammad Bin Al-Faraj wrote to my father letting him know of their gathering in his presence, and that he, if he does not fear the publicity, should come to be with them, and he asked him to come over.", "So my father rode and went over to him and he found the people have had gathered with him. So they said to my father, ‘What are you saying regarding this matter?’ So my father said, ‘To the one with whom there is a parchment, should display the parchment’. So they displayed these, and he said to them, ‘This is what I had been ordered with’. So some of them said, ‘We would have loved it if there had been other witnesses with you regarding this matter’. ", "So he said to them, ‘Allah<sup>azwj</sup> Mighty and Majestic has Already Come with it. This is Abu Ja’far Al-Ashary. He would testify for me that he heard this message, and ask him that he should testify with whatever is with him’. But, Ahmad denied that he had been hearing anything from this. So my father called him to the imprecation (Mubahila). ", "So he (the narrator) said, ‘When it was proven against him, he said, ‘I had heard that and this is a prestige. I had liked it that it would happen to be from a man from the Arabs, not to a man from the non-Arabs’. (Al-Khayrani was a non-Arab). So the people did not depart until they had spoken with the truth, altogether’."]}}, {"index": 844, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:74:3", "text": ["وَ فِي نُسْخَةِ الصَّفْوَانِيِّ مُحَمَّدُ بْنُ جَعْفَرٍ الْكُوفِيُّ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ الْوَاسِطِيِّ أَنَّهُ سَمِعَ أَحْمَدَ بْنَ أَبِي خَالِدٍ مَوْلَى أَبِي جَعْفَرٍ يَحْكِي أَنَّهُ أَشْهَدَهُ عَلَى هَذِهِ الْوَصِيَّةِ الْمَنْسُوخَةِ شَهِدَ أَحْمَدُ بْنُ أَبِي خَالِدٍ مَوْلَى أَبِي جَعْفَرٍ أَنَّ أَبَا جَعْفَرٍ مُحَمَّدَ بْنَ عَلِيِّ بْنِ مُوسَى بْنِ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) أَشْهَدَهُ أَنَّهُ أَوْصَى إِلَى عَلِيٍّ ابْنِهِ بِنَفْسِهِ وَ أَخَوَاتِهِ وَ جَعَلَ أَمْرَ مُوسَى إِذَا بَلَغَ إِلَيْهِ ", "وَ جَعَلَ عَبْدَ اللَّهِ بْنَ الْمُسَاوِرِ قَائِماً عَلَى تَرِكَتِهِ مِنَ الضِّيَاعِ وَ الْأَمْوَالِ وَ النَّفَقَاتِ وَ الرَّقِيقِ وَ غَيْرِ ذَلِكَ إِلَى أَنْ يَبْلُغَ عَلِيُّ بْنُ مُحَمَّدٍ صَيَّرَ عَبْدُ اللَّهِ بْنُ الْمُسَاوِرِ ذَلِكَ الْيَوْمَ إِلَيْهِ يَقُومُ بِأَمْرِ نَفْسِهِ وَ أَخَوَاتِهِ وَ يُصَيِّرُ أَمْرَ مُوسَى إِلَيْهِ يَقُومُ لِنَفْسِهِ بَعْدَهُمَا عَلَى شَرْطِ أَبِيهِمَا فِي صَدَقَاتِهِ الَّتِي تَصَدَّقَ بِهَا وَ ذَلِكَ يَوْمُ الْأَحَدِ لِثَلَاثِ لَيَالٍ خَلَوْنَ مِنْ ذِي الْحِجَّةِ سَنَةَ عِشْرِينَ وَ مِائَتَيْنِ ", "وَ كَتَبَ أَحْمَدُ بْنُ أَبِي خَالِدٍ شَهَادَتَهُ بِخَطِّهِ وَ شَهِدَ الْحَسَنُ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) وَ هُوَ الْجَوَّانِيُّ عَلَى مِثْلِ شَهَادَةِ أَحْمَدَ بْنِ أَبِي خَالِدٍ فِي صَدْرِ هَذَا الْكِتَابِ وَ كَتَبَ شَهَادَتَهُ بِيَدِهِ وَ شَهِدَ نَصْرٌ الْخَادِمُ وَ كَتَبَ شَهَادَتَهُ بِيَدِهِ ."], "translations": {"en.hubeali": ["And in a copy of Al Safwany – Muhammad Bin Ja’far Al Kufy, from Muhammad Bin Isa Bin Ubeyd, from Muhammad Bin Al Husayn Al Wasity that he heard Ahmad Bin Abu Khalid a slave of Abu Ja’far, ", "‘He witnessed upon this copied bequest – ‘Ahmad Bin Abu Khalid, a slave of Abu Ja’far<sup>asws</sup> Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> testifies, ‘I hereby testify that he<sup>asws</sup> bequeathed to Ali<sup>asws</sup> his<sup>asws</sup> son<sup>asws</sup> with himself<sup>asws</sup> and his<sup>asws</sup> sisters, and made the matter of Musa, when he reaches adulthood, to him<sup>asws</sup>.", "And he<sup>asws</sup> made Abdullah Bin Al-Musawir to him on that day to be custodian upon his<sup>asws</sup> legacy from the properties, and wealth, and the expenditure monies, and the slaves, and other than that, until Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) reaches adulthood. Abdullah Bin Al-Musawir, on that day, came to be standing with the matter of his<sup>asws</sup> own self, and his<sup>asws</sup> sisters, and the matter of Musa came to be with him, standing for himself after the two of them, upon the stipulation of their father<sup>asws</sup> regarding his<sup>asws</sup> charities which he<sup>asws</sup> gave with, and that is the day of Sunday the third night of Zil Hijjah, the year two hundred and twenty.", "And Ahmad Bin Abu Khalid wrote his testimony by his own handwriting it was witnessed by Al-Hassan Bin Muhammad Bin Abdullah Bin Al-Hassan Bin Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and he is Al-Jawwany, upon the like of the testimony of Ahmad Bin Abu Khalid in the beginning of this letter, and he wrote his testimony by his own hand, Nasr the servant testified and wrote his testimony by his own hand’."]}}]}, "index": "al-kafi:1:4:74", "kind": "verse_list"}