{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 75"
        },
        "path": "/books/al-kafi:1:4:75",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي مُحَمَّدٍ ( عليه السلام )",
          "en": "Chapter 75 – The Indication and the wordings upon Abu Muhammad<sup>asws </sup>(11th Imam<sup>asws</sup>)"
        }
      }
    ],
    "index": 133,
    "local_index": 75,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 76"
        },
        "path": "/books/al-kafi:1:4:76",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ إِلَى صَاحِبِ الدَّارِ ( عليه السلام )",
          "en": "Chapter 76 – The Indication and the wordings upon the Master<sup>asws</sup> of the world (12<sup>th</sup> Imam<sup>asws</sup>)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 74"
        },
        "path": "/books/al-kafi:1:4:74",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام )",
          "en": "Chapter 74 – The Indication and the wordings upon Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup>. (10<sup>th</sup> Imam<sup>asws</sup>)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:75",
    "titles": {
      "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي مُحَمَّدٍ ( عليه السلام )",
      "en": "Chapter 75 – The Indication and the wordings upon Abu Muhammad<sup>asws </sup>(11th Imam<sup>asws</sup>)"
    },
    "verse_count": 13,
    "verse_start_index": 844,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/387)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 845,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ يَحْيَى بْنِ يَسَارٍ الْقَنْبَرِيِّ قَالَ أَوْصَى أَبُو الْحَسَنِ ( عليه السلام ) إِلَى ابْنِهِ الْحَسَنِ قَبْلَ مُضِيِّهِ بِأَرْبَعَةِ أَشْهُرٍ وَ أَشْهَدَنِي عَلَى ذَلِكَ وَ جَمَاعَةً مِنَ الْمَوَالِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Ahmad Al Nahdy, from Yahya Bin Yasaar Al Qanbary who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> (10th Imam<sup>asws</sup>) bequeathed to his<sup>asws</sup> son<sup>asws</sup> Al-Hassan<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) before his<sup>asws</sup> passing away by four months and kept me as a witness upon that, and a group of friends’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Muhammad has narrated from Muhammad ibn Ahmad al-Nahdi from Yahya ibn Yasar al-Qanbar who has said the following. “Abu al-Hassan (a.s.) prepared his directive will to his son, al-Hassan four months before his leaving this world. He appointed me to bear testimony to his will as well as a group of the follower friends.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (387/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 846,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:2",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْكُوفِيِّ عَنْ بَشَّارِ بْنِ أَحْمَدَ الْبَصْرِيِّ عَنْ عَلِيِّ بْنِ عُمَرَ النَّوْفَلِيِّ قَالَ كُنْتُ مَعَ أَبِي الْحَسَنِ ( عليه السلام ) فِي صَحْنِ دَارِهِ فَمَرَّ بِنَا مُحَمَّدٌ ابْنُهُ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ هَذَا صَاحِبُنَا بَعْدَكَ فَقَالَ لَا صَاحِبُكُمْ بَعْدِيَ الْحَسَنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ja’far Bin Muhammad Al Kufy, from Bashhar Bin Ahmad Al Basry, from Ali Bin Umar Al Nowfaly who said, ",
            "‘I was with Abu Al-Hassan<sup>asws</sup> in the courtyard of his<sup>asws</sup> house, so Muhammad his<sup>asws</sup> son passed by us. So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! This one would be our Master after you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘No. Your Master<sup>asws</sup> after me<sup>asws</sup> is Al-Hassan<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Muhammad has narrated from Ja‘far ibn Muhammad al-Kufi from Bashshar ibn Ahmad al-Basri from Ali ibn ‘Umar al-Nawfali who has said the following. “Once I was with abu al-Hassan in the compound of his house and at that time his son, Muhammad passed by. I said to him, “may Allah take my souls in service for your cause, will he be our master, Imam, after you?” The Imam (a.s.) said, “ No, your master, Imam, after me will be al-Hassan (a.s.).” * This abu Ja‘far Muhammad ibn Ali, is the eldest son of the Imam al-Hadi (a.s.).He died before his father (230/845 - 252/866). His shrine is near Balad which is near Baghdad, and the place is now known as al-Sayyid Muhammad. In the following ahadith his name is frequently mentioned."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (388/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 847,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:3",
        "text": [
          "عَنْهُ عَنْ بَشَّارِ بْنِ أَحْمَدَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْأَصْفَهَانِيِّ قَالَ قَالَ أَبُو الْحَسَنِ ( عليه السلام ) صَاحِبُكُمْ بَعْدِيَ الَّذِي يُصَلِّي عَلَيَّ قَالَ وَ لَمْ نَعْرِفْ أَبَا مُحَمَّدٍ قَبْلَ ذَلِكَ قَالَ فَخَرَجَ أَبُو مُحَمَّدٍ فَصَلَّى عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Bashhar Bin Ahmad, from Abdullah Bin Muhammad Al Isfahany who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> said: ‘Your Master<sup>asws</sup> after me<sup>asws</sup> is the one who would pray <span class=\"iTxt\">Salat</span> over me<sup>asws</sup>’, and we did not know Abu Muhammad<sup>asws</sup> before that. So Abu Muhammad<sup>asws</sup> came out and prayed <span class=\"iTxt\">Salat</span> over him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 3. From him has narrated from Bashshar ibn Ahmad from ‘Abdallah ibn Muhammad al-Isfahani who has said the following. “Abu al-Hassan (a.s.) said, “Your master (Imam) after me will be the one who will perform prayer for me (prayer for burial).” The narrator has said that we did not know abu Muhammad (a.s.) before this. Abu Muhammad came out and prayed (for his burial).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/388)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 848,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:4",
        "text": [
          "وَ عَنْهُ عَنْ مُوسَى بْنِ جَعْفَرِ بْنِ وَهْبٍ عَنْ عَلِيِّ بْنِ جَعْفَرٍ قَالَ كُنْتُ حَاضِراً أَبَا الْحَسَنِ ( عليه السلام ) لَمَّا تُوُفِّيَ ابْنُهُ مُحَمَّدٌ فَقَالَ لِلْحَسَنِ يَا بُنَيَّ أَحْدِثْ لِلَّهِ شُكْراً فَقَدْ أَحْدَثَ فِيكَ أَمْراً ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Musa Bin Ja’far Bin Wahab, from Ali Bin Ja’far Who said, ",
            "‘I was presence with Abu Al Hassan<sup>asws</sup> when his<sup>asws</sup> son Muhammad died. So he<sup>asws</sup> said to Al-Hassan<sup>asws</sup>: ‘O my<sup>asws</sup> son<sup>asws</sup>! Renew the thanks to Allah<sup>azwj</sup> for the command (Imamate) has come to be in you<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 4. From him who has narrated from Musa ibn Ja‘far ibn Wahab from Ali ibn Ja‘far who has said the following. “I was present with abu al-Hassan (a.s.) when his son Muhammad died. The Imam (a.s.) said this to (his son) al-Hassan (a.s.), “Son renew your thanks to Allah because He has just granted you the matter (Leadership with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (388/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 849,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مَرْوَانَ الْأَنْبَارِيِّ قَالَ كُنْتُ حَاضِراً عِنْدَ مُضِيِّ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام ) فَجَاءَ أَبُو الْحَسَنِ ( عليه السلام ) فَوُضِعَ لَهُ كُرْسِيٌّ فَجَلَسَ عَلَيْهِ وَ حَوْلَهُ أَهْلُ بَيْتِهِ وَ أَبُو مُحَمَّدٍ قَائِمٌ فِي نَاحِيَةٍ فَلَمَّا فَرَغَ مِنْ أَمْرِ أَبِي جَعْفَرٍ الْتَفَتَ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) فَقَالَ يَا بُنَيَّ أَحْدِثْ لِلَّهِ تَبَارَكَ وَ تَعَالَى شُكْراً فَقَدْ أَحْدَثَ فِيكَ أَمْراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah Bin Marwan Al Anbary who said, ",
            "‘I was present during the passing away of Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> (9<sup>th</sup> Imam<sup>asws</sup>). So Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam) came over, and a chair was placed for him<sup>asws</sup>, so he<sup>asws</sup> sat upon it, and around him<sup>asws</sup> were his<sup>asws</sup> family members, and Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) was standing in a corner. So when he<sup>asws</sup> was free from the matter of Abu Ja’far<sup>asws</sup>, he<sup>asws</sup> turned towards Abu Muhammad<sup>asws</sup> and he<sup>asws</sup> said: ‘O my<sup>asws</sup> son<sup>asws</sup>! Renew thanks to Allah<sup>azwj</sup> Blessed and High for the command has come to be in you<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 5. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad, from Ahmad ibn Muhammad ibn ‘Abdallah ibn Marwan al-Anbari who has said the following. “I was present at the time of abu Ja‘far Muhammad ibn Ali’s (leaving this world). Abu al-Hassan (a.s.) came and a chair was set for him. He sat on it and his family around him. Abu Muhammad was standing on one side. When he was free from the matters about abu Ja‘far he then turned to abu Muhammad (a.s.) and said, “My son, renew thanks to Allah, the Most Holy, the Most High, because He has just granted you a task (Leadership with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول وقيل ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (389/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 850,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:6",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ الْقَلَانِسِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَمْرٍو عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) إِنْ كَانَ كَوْنٌ وَ أَعُوذُ بِاللَّهِ فَإِلَى مَنْ قَالَ عَهْدِي إِلَى الْأَكْبَرِ مِنْ وَلَدَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Ahmad Al Qalanasy, from Ali Bin Al Husayn Bin Amro, from Ali Bin Mahziyar who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘If there was an occurrence (of death), and I seek Refuge with Allah<sup>azwj</sup>, so to whom?’ He<sup>asws</sup> said: ‘My<sup>asws</sup> Covenant is to the eldest of my<sup>asws</sup> sons’."
          ],
          "en.sarwar": [
            " 6. Ali ibn Muhammad has narrated from Muhammad ibn Ahmad al-Qalanisi from Ali ibn al-Husayn ibn ‘Amr from Ali ibn Mahziyar who has said the following. “Once I said abu al-Hassan (a.s.), “If something will happen-I seek refuge before Allah – to who then will go (Leadership with Divine Authority)?” He said, “My covenant (directive will) is for the eldest of my sons.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/389)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 851,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:7",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَبِي مُحَمَّدٍ الْإِسْبَارِقِينِيِّ عَنْ عَلِيِّ بْنِ عَمْرٍو الْعَطَّارِ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ الْعَسْكَرِيِّ ( عليه السلام ) وَ أَبُو جَعْفَرٍ ابْنُهُ فِي الْأَحْيَاءِ وَ أَنَا أَظُنُّ أَنَّهُ هُوَ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ مَنْ أَخُصُّ مِنْ وُلْدِكَ فَقَالَ لَا تَخُصُّوا أَحَداً حَتَّى يَخْرُجَ إِلَيْكُمْ أَمْرِي قَالَ فَكَتَبْتُ إِلَيْهِ بَعْدُ فِيمَنْ يَكُونُ هَذَا الْأَمْرُ قَالَ فَكَتَبَ إِلَيَّ فِي الْكَبِيرِ مِنْ وَلَدَيَّ قَالَ وَ كَانَ أَبُو مُحَمَّدٍ أَكْبَرَ مِنْ أَبِي جَعْفَرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abu Muhammad Al Isbariqeyni, from Ali Bin Amro Al Attar who said, ",
            "‘I went over to Abu Al-Hassan Al-Askary<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) and Abu Ja’far, his<sup>asws</sup> son during his life-time, and I thought that he would be him (the Imam<sup>asws</sup>). So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Whom from your<sup>asws</sup> sons should I choose?’ So he<sup>asws</sup> said: ‘Do not choose anyone until my<sup>asws</sup> order comes out to you all’. So I wrote to him<sup>asws</sup> afterwards, ‘In whom would this command (Imamate) come to be?’ So he<sup>asws</sup> wrote to me: ‘In the eldest of my<sup>asws</sup> sons’. And it was so that Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) was older than Abu Ja’far’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Muhammad has narrated from abu Muhammad al-Asbarqiniy from Ali ibn ‘Amr al-‘Attar who has said the following. “Once I went to see al-Hassan al-‘Askari (a.s.) when his son abu Ja‘far (Muhammad ) was still alive and I thought he will be the Imam after his father. I then asked the Imam (a.s.), “May Allah take my souls in service for your cause, which of your sons I will consider (my Imam)?” The Imam (a.s.) said, “do not consider any of them (your Imam) until my command will come to you.” The narrator has said, “I wrote to him afterwards asking, ‘To who will go this task (Leadership with Divine Authority)” The narrator has said, “He wrote to me, “(It will go) to my eldest son.” The narrator has said, “Abu Muhammad (a.s.) was older then abu Ja‘far.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/389)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/38)"
        ],
        "index": 852,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ سَعْدِ بْنِ عَبْدِ اللَّهِ عَنْ جَمَاعَةٍ مِنْ بَنِي هَاشِمٍ مِنْهُمُ الْحَسَنُ بْنُ الْحَسَنِ الْأَفْطَسُ أَنَّهُمْ حَضَرُوا يَوْمَ تُوُفِّيَ مُحَمَّدُ بْنُ عَلِيِّ بْنِ مُحَمَّدٍ بَابَ أَبِي الْحَسَنِ يُعَزُّونَهُ وَ قَدْ بُسِطَ لَهُ فِي صَحْنِ دَارِهِ وَ النَّاسُ جُلُوسٌ حَوْلَهُ ",
          "فَقَالُوا قَدَّرْنَا أَنْ يَكُونَ حَوْلَهُ مِنْ آلِ أَبِي طَالِبٍ وَ بَنِي هَاشِمٍ وَ قُرَيْشٍ مِائَةٌ وَ خَمْسُونَ رَجُلًا سِوَى مَوَالِيهِ وَ سَائِرِ النَّاسِ إِذْ نَظَرَ إِلَى الْحَسَنِ بْنِ عَلِيٍّ قَدْ جَاءَ مَشْقُوقَ الْجَيْبِ حَتَّى قَامَ عَنْ يَمِينِهِ وَ نَحْنُ لَا نَعْرِفُهُ فَنَظَرَ إِلَيْهِ أَبُو الْحَسَنِ ( عليه السلام ) بَعْدَ سَاعَةٍ فَقَالَ يَا بُنَيَّ أَحْدِثْ لِلَّهِ عَزَّ وَ جَلَّ شُكْراً فَقَدْ أَحْدَثَ فِيكَ أَمْراً ",
          "فَبَكَى الْفَتَى وَ حَمِدَ اللَّهَ وَ اسْتَرْجَعَ وَ قَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَ أَنَا أَسْأَلُ اللَّهَ تَمَامَ نِعَمِهِ لَنَا فِيكَ وَ إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ ",
          "فَسَأَلْنَا عَنْهُ فَقِيلَ هَذَا الْحَسَنُ ابْنُهُ وَ قَدَّرْنَا لَهُ فِي ذَلِكَ الْوَقْتِ عِشْرِينَ سَنَةً أَوْ أَرْجَحَ فَيَوْمَئِذٍ عَرَفْنَاهُ وَ عَلِمْنَا أَنَّهُ قَدْ أَشَارَ إِلَيْهِ بِالْإِمَامَةِ وَ أَقَامَهُ مَقَامَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and someone else, from Sa’ad Bin Abdullah, ",
            "(It has been narrated) from a group of the Clan of Hashim<sup>as</sup>, from them being Al-Hassan Bin Al-Hassan Al-Aftas, that they were present, on the day Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup> (9<sup>th</sup> Imam<sup>asws</sup>) passed away, at the door of Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) consoling him<sup>asws</sup>, and there had been extended for him<sup>asws</sup> in the courtyard of his<sup>asws</sup> house, and the people were seated around him<sup>asws</sup>. ",
            "So they said, ‘We estimated that there would happen to be around him<sup>asws</sup> from the progeny of Abu Talib<sup>asws</sup> and the Clan of Hashim<sup>as</sup>, and Qureysh, one hundred and fifty men, besides his<sup>asws</sup> friends and the rest of the people. We looked at Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> who had come with a torn shirt until he<sup>asws</sup> stood on his<sup>asws</sup> right, and we did not know him<sup>asws</sup>. So Abu Al-Hassan<sup>asws</sup> looked at him<sup>asws</sup> after a while and he<sup>asws</sup> said: ‘O my<sup>asws</sup> son<sup>asws</sup>! Renew thanks for Allah<sup>azwj</sup> Mighty and Majestic for the command (Imamate) has occurred in you<sup>asws</sup>’. ",
            "So the youth wept and Praised Allah<sup>azwj</sup> and said: ‘We are for Allah<sup>azwj</sup> and to Him<sup>azwj</sup> are we returning’, and said: ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the words, and I<sup>asws</sup> ask Allah<sup>azwj</sup> for the completion of His<sup>azwj</sup> Bounties for us in you<sup>asws</sup>, and we are for Allah<sup>azwj</sup> and we are returning to Him<sup>azwj</sup>’. ",
            "So we asked about him<sup>asws</sup>, and it was said, ‘This is Al-Hassan<sup>asws</sup>, his<sup>asws</sup> son<sup>asws</sup>’, and we estimated for him<sup>asws</sup> at that time to be of twenty years or more. So it was in those days that we recognised him<sup>asws</sup> and we knew that he<sup>asws</sup> had indicated to him<sup>asws</sup> as being with the Imamate, and (had made) him<sup>asws</sup> stood in his<sup>asws</sup> own place’."
          ],
          "en.sarwar": [
            " 8. Muhammad ibn Yahya and others have narrated from Sa‘id ibn ‘Abdallah from a group of banu Hashim, among whom was al-Hassan ibn al-Hassan al-Aftas, the following. “They were present on the day Muhammad ibn Ali ibn Muhammad, at the door of abu al-Hassan to offer condolences. A place in the compound of his house was prepared for him and people were sitting around him. They said, “We estimated that at that time from the descendents of abu Talib, Hashim and Quraysh there were about fifty men besides his slaves and other people. At such time he look at al-Hassan ibn Ali coming and the front of his shirt was torn. He stood at the right of his father and we did not know him. Abu al-Hassan (a.s.) looked at him after a while and said, “My son, renew your thanks to Allah, the Most Majestic, the Most gracious, because He has granted you a new task (Leadership with Divine Authority).” The young man wept, praised Allah, and said, “We are for Allah and to Him we shall return. He then said, “All praise belongs to Allah, Lord of the worlds. I pray to Allah for completion the blessings for us in you. “We are for Allah and to Him we shall return.” We asked about him and it was said that he was al-Hassan, the son of the Imam. We estimated his age at that time around twenty years or more. On that day we learned and came to know that he had tacitly made a statement about the succeeding Imam and (the Leader with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (390/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 853,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:9",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ دَرْيَابَ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ ( عليه السلام ) بَعْدَ مُضِيِّ أَبِي جَعْفَرٍ فَعَزَّيْتُهُ عَنْهُ وَ أَبُو مُحَمَّدٍ ( عليه السلام ) جَالِسٌ فَبَكَى أَبُو مُحَمَّدٍ ( عليه السلام ) فَأَقْبَلَ عَلَيْهِ أَبُو الْحَسَنِ ( عليه السلام ) فَقَالَ لَهُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَدْ جَعَلَ فِيكَ خَلَفاً مِنْهُ فَاحْمَدِ اللَّهَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Is’haq Bin Muhammad, from Muhammad Bin Yahya Bin Daryaab who said, ",
            "‘I went over to Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) after the passing away of Abu Ja’far<sup>asws</sup> (9<sup>th</sup> Imam<sup>asws</sup>) So I consoled him<sup>asws</sup> about him<sup>asws</sup> and Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) was seated. So Abu Muhammad<sup>asws</sup> wept and Abu Al-Hassan<sup>asws</sup> faced him<sup>asws</sup> and said to him<sup>asws</sup>: ‘Allah<sup>azwj</sup> Blessed and High has Made you<sup>asws</sup> to be a replacement from him<sup>asws</sup>, therefore Praise Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 9. Ali ibn Muhammad has narrated from Ishaq ibn Muhammad from Muhammad ibn Yahya ibn Daryab who has said the following. “I went to see abu al-Hassan (a.s.) after the death of abu Ja‘far and offered condolences for this reason. Abu Muhammad (a.s.) was also present. He wept and abu al-Hassan (a.s.) turned to him and said, “Allah, the Most Holy, the Most High, has made you to succeed (the Imam) instead of him. You must thanks Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (391/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 854,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:10",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ عَنْ أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ كُنْتُ عِنْدَ أَبِي الْحَسَنِ ( عليه السلام ) بَعْدَ مَا مَضَى ابْنُهُ أَبُو جَعْفَرٍ وَ إِنِّي لَأُفَكِّرُ فِي نَفْسِي أُرِيدُ أَنْ أَقُولَ كَأَنَّهُمَا أَعْنِي أَبَا جَعْفَرٍ وَ أَبَا مُحَمَّدٍ فِي هَذَا الْوَقْتِ كَأَبِي الْحَسَنِ مُوسَى وَ إِسْمَاعِيلَ ابْنَيْ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام ) وَ إِنَّ قِصَّتَهُمَا كَقِصَّتِهِمَا إِذْ كَانَ أَبُو مُحَمَّدٍ الْمُرْجَى بَعْدَ أَبِي جَعْفَرٍ ( عليه السلام ) ",
          "فَأَقْبَلَ عَلَيَّ أَبُو الْحَسَنِ قَبْلَ أَنْ أَنْطِقَ فَقَالَ نَعَمْ يَا أَبَا هَاشِمٍ بَدَا لِلَّهِ فِي أَبِي مُحَمَّدٍ بَعْدَ أَبِي جَعْفَرٍ ( عليه السلام ) مَا لَمْ يَكُنْ يُعْرَفُ لَهُ كَمَا بَدَا لَهُ فِي مُوسَى بَعْدَ مُضِيِّ إِسْمَاعِيلَ مَا كَشَفَ بِهِ عَنْ حَالِهِ وَ هُوَ كَمَا حَدَّثَتْكَ نَفْسُكَ وَ إِنْ كَرِهَ الْمُبْطِلُونَ وَ أَبُو مُحَمَّدٍ ابْنِي الْخَلَفُ مِنْ بَعْدِي عِنْدَهُ عِلْمُ مَا يُحْتَاجُ إِلَيْهِ وَ مَعَهُ آلَةُ الْإِمَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Is’haq Bin Muhammad, from Abu Hashim Al Ja’fary who said, ",
            "‘I was in the presence of Abu Al-Hassan<sup>asws</sup> after the passing away of his<sup>asws</sup> son Abu Ja’far, and I was thinking within myself intending that I should be saying, ‘It is as if these two, meaning Abu Ja’far and Abu Muhammad<sup>asws</sup>, at this time, are like Abu Al-Hassan Musa<sup>asws</sup> and Ismail, the two sons of Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> and that both their stories are like both their stories, whether it would be Abu Muhammad as the appointee after Abu Ja’far<sup>asws</sup>.",
            "So Abu Al-Hassan<sup>asws</sup> turned towards me before I could speak, and he<sup>asws</sup> said: ‘Yes, O Abu Hashim! There is a Change in Allah<sup>azwj</sup>’s Decision regarding Abu Muhammad being after Abu Ja’far<sup>asws</sup> what did not happen to be a recognition for him, just as there was a Change in Allah<sup>azwj</sup>’s Decision for Him<sup>azwj</sup> regarding Musa<sup>as</sup> after the passing away of Ismail, what was uncovered with it from his state, and it is just as you narrated to yourself, and even though the falsifiers may dislike it. And it would be Abu Muhammad<sup>asws</sup>, my<sup>asws</sup> son<sup>asws</sup>, as the Caliph after me<sup>asws</sup>. With him<sup>asws</sup> is the knowledge of whatever is needed to, and with him<sup>asws</sup> are the Signs of the Imamate’."
          ],
          "en.sarwar": [
            " 10. Ali ibn Muhammad has narrated from Ishaq ibn Muhammad from abu Hashim al-Ja‘fari who has said the following. “I was in the presence of abu al-Hassan (a.s.) after the death of his son, abu Ja‘far. I thought to my self like wanting to say, “The two; abu Ja‘far and abu Muhammad at this time are like abu al-Hassan Musa and ’Isma‘il, the sons of Ja‘far ibn Muhammad (a.s.).” At such time abu al-Hassan turned to me before I would say anything and said, “Yes, O abu Hashim, Allah applied Bada’ (a change in the current natural conditions) in the case of abu Muhammad after abu Ja‘far, a fact that was not known for him. In the same He applied Bada’ in the case of Musa after the death of ’Isma‘il as an issue that through which his condition came to light. That is what you thought to yourself. Even though people of falsehood may dislike, abu Muhammad, my son will be the succeeding Imam after me. With him is the knowledge that he will need and with him is the means of Imamat (Leadership with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/391)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 855,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:11",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ دَرْيَابَ عَنْ أَبِي بَكْرٍ الْفَهْفَكِيِّ قَالَ كَتَبَ إِلَيَّ أَبُو الْحَسَنِ ( عليه السلام ) أَبُو مُحَمَّدٍ ابْنِي أَنْصَحُ آلِ مُحَمَّدٍ غَرِيزَةً وَ أَوْثَقُهُمْ حُجَّةً وَ هُوَ الْأَكْبَرُ مِنْ وَلَدَيَّ وَ هُوَ الْخَلَفُ وَ إِلَيْهِ يَنْتَهِي عُرَى الْإِمَامَةِ وَ أَحْكَامُهَا فَمَا كُنْتَ سَائِلِي فَسَلْهُ عَنْهُ فَعِنْدَهُ مَا يُحْتَاجُ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Is’haq Bin Muhammad, from Muhammad Bin Yahya Bin Daryab, from Abu Bakr Al Fahfaky who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) wrote to me: ‘Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) my<sup>asws</sup> son<sup>asws</sup> is the most of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, distinguished, and strongest of proofs, and he<sup>asws</sup> is the eldest of my<sup>asws</sup> sons<sup>asws</sup>, and he<sup>asws</sup> is replacement, and to him<sup>asws</sup> ends up the handle of the Imamate and its decisions. So whatever you ask me<sup>asws</sup>, so ask him<sup>asws</sup> about it, for with him<sup>asws</sup> is whatever you are needy to’."
          ],
          "en.sarwar": [
            " 11. Ali ibn Muhammad has narrated from Ishaq ibn Muhammad from Muhammad ibn Yahya ibn Daryab from abu Bakr al-Fahfaki who has said the following. “He wrote to me as herein below. “My son, abu Muhammad instinctively is the most considerate in the family of Muhammad (s.a). He possesses the strongest authoritative supporting evidence above them and he is the eldest of my sons. He is the succeeding Imam and to him go the rings of Imamat (Leadership with Divine Authority) and its rules. Whatever you wanted to ask me ask it from him. With him is whatever he may need.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول أيض ا  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (392/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 856,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:12",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ عَنْ شَاهَوَيْهِ بْنِ عَبْدِ اللَّهِ الْجَلَّابِ قَالَ كَتَبَ إِلَيَّ أَبُو الْحَسَنِ فِي كِتَابٍ أَرَدْتَ أَنْ تَسْأَلَ عَنِ الْخَلَفِ بَعْدَ أَبِي جَعْفَرٍ وَ قَلِقْتَ لِذَلِكَ فَلَا تَغْتَمَّ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يُضِلُّ قَوْماً بَعْدَ إِذْ هَدَاهُمْ حَتَّى يُبَيِّنَ لَهُمْ مَا يَتَّقُونَ وَ صَاحِبُكَ بَعْدِي أَبُو مُحَمَّدٍ ابْنِي وَ عِنْدَهُ مَا تَحْتَاجُونَ إِلَيْهِ يُقَدِّمُ مَا يَشَاءُ اللَّهُ وَ يُؤَخِّرُ مَا يَشَاءُ اللَّهُ ما نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِها نَأْتِ بِخَيْرٍ مِنْها أَوْ مِثْلِها ",
          "قَدْ كَتَبْتُ بِمَا فِيهِ بَيَانٌ وَ قِنَاعٌ لِذِي عَقْلٍ يَقْظَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Is’haq Bin Muhammad, from Shahawiya Bin Abdullah Al Khallab who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) wrote to me: ‘You wanted to ask about the Caliph after Abu Ja’far<sup>asws</sup> and you were anxious for that. So do not be gloomy, for Allah<sup>azwj</sup> Mighty and Majestic does not <span class=\"ibTxt\">[9:115] Let a people stray after He has Guided them; until He Clarifies to them what they should guard against</span>. And your Master<sup>asws</sup> after me<sup>asws</sup> is Abu Muhammad<sup>asws</sup>, (11<sup>th</sup> Imam<sup>asws</sup>) my<sup>asws</sup> son<sup>asws</sup>, and with him<sup>asws</sup> is whatever they (people) would be needy to. Allah<sup>azwj</sup> Brings forward whatever He<sup>azwj</sup> so Desires to and Allah<sup>azwj</sup> Delays whatever He<sup>azwj</sup> so Desires to <span class=\"ibTxt\">[2:106] Whatever from a Verse We Abrogate or cause it to be forgotten, We Come with one better than it or the like of it</span>. ",
            "I<sup style=\"font-weight: normal\">asws</sup> have written with what is a clarification therein and a contentment for the one with an alert intellect’."
          ],
          "en.sarwar": [
            " 12. Ali ibn Muhammad has narrated from Ishaq ibn Muhammad from Shahwayh ibn ‘Abdallah al-Jallab who has said the following. “Abu al-Hassan wrote to me in a letter as herein below. “You wanted to ask about the succeeding Imam after (the death) of abu Ja‘far and you were anxious about it. Do not feel sad; “God does not misguide a nation after having given them guidance until the means of piety are made known to them. . .” (9:115) Allah, the Most Majestic, the Most gracious, does not neglect the people whom He has granted guidance to go astray until He clarifies for them the means with which they can maintain piety. You master (Imam) after me will be, my son, abu Muhammad (a.s.). With there is whatever you would need. Allah allows to precede whatever He wants and Allah allows to succeed whatever He wants. “For whatever sign We change or eliminate or cause to recede into oblivion, We bring forth a better sign, one that is identical.. .” (2:106). I have written enough convincing facts for the people of reason with awareness.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول أيضا   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (393/ 3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 857,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:75:13",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ الْعَلَوِيِّ عَنْ دَاوُدَ بْنِ الْقَاسِمِ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ الْخَلَفُ مِنْ بَعْدِيَ الْحَسَنُ فَكَيْفَ لَكُمْ بِالْخَلَفِ مِنْ بَعْدِ الْخَلَفِ فَقُلْتُ وَ لِمَ جَعَلَنِيَ اللَّهُ فِدَاكَ فَقَالَ إِنَّكُمْ لَا تَرَوْنَ شَخْصَهُ وَ لَا يَحِلُّ لَكُمْ ذِكْرُهُ بِاسْمِهِ فَقُلْتُ فَكَيْفَ نَذْكُرُهُ فَقَالَ قُولُوا الْحُجَّةُ مِنْ آلِ مُحَمَّدٍ عَلَيْهِمُ السَّلَامُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from the one who mentioned it, from Muhammad Bin Ahmad Al Alawy, from Dawood Bin Al Qasim who said, ",
            "‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘The replacement (Imam<sup>asws</sup>) from after me<sup>asws</sup> is Al-Hassan<sup>asws</sup>. So how would it be for you all with the replacement (Imam<sup>asws</sup>) from after the replacement (Imam<sup>asws</sup>)?’ So I said, ‘And why (would it be so)? May Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>!’ So he<sup>asws</sup> said: ‘You all would not be seeing his<sup>asws</sup> person (physically), nor would it be Permissible for you all to mention him<sup>asws</sup> by his<sup>asws</sup> name’. So I said, ‘So how should be mention him<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘You should be saying, ‘الْحُجَّةُ مِنْ آلِ مُحَمَّدٍ عَلَيْهِمُ السَّلَامُ’ ‘The Divine Authority (Al-Hujjat) from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 13. Ali ibn Muhammad has narrated from the person he mentioned from Muhammad ibn Ahmad al-‘Alawi from Dawud ibn al-Qasim who has said the following. “I heard abu al-Hassan (a.s.) saying, ‘The succeeding (Imam) after me will be al-Hassan. How will your dealing be with the succeeding (Imam) of the succeeding (Imam)?” I then said, “Why will that be so, may Allah take my souls in service for your cause?” He said, “You will not see him in person. It will not lawful for you to pronounce his name.” I then asked, “How then will we speak of him?” He said, “Say, ‘The Divine Authority from the family of Muhammad (s.a).”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:75",
  "kind": "verse_list"
}