{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 75"}, "path": "/books/al-kafi:1:4:75", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي مُحَمَّدٍ ( عليه السلام )", "en": "Chapter 75 – The Indication and the wordings upon Abu Muhammad<sup>asws </sup>(11th Imam<sup>asws</sup>)"}}], "index": 133, "local_index": 75, "part_type": "Chapter", "path": "/books/al-kafi:1:4:75", "titles": {"ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ عَلَى أَبِي مُحَمَّدٍ ( عليه السلام )", "en": "Chapter 75 – The Indication and the wordings upon Abu Muhammad<sup>asws </sup>(11th Imam<sup>asws</sup>)"}, "verse_count": 13, "verse_start_index": 844, "verses": [{"index": 845, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ يَحْيَى بْنِ يَسَارٍ الْقَنْبَرِيِّ قَالَ أَوْصَى أَبُو الْحَسَنِ ( عليه السلام ) إِلَى ابْنِهِ الْحَسَنِ قَبْلَ مُضِيِّهِ بِأَرْبَعَةِ أَشْهُرٍ وَ أَشْهَدَنِي عَلَى ذَلِكَ وَ جَمَاعَةً مِنَ الْمَوَالِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Muhammad Bin Ahmad Al Nahdy, from Yahya Bin Yasaar Al Qanbary who said, \n‘Abu Al-Hassan<sup>asws</sup> (10th Imam<sup>asws</sup>) bequeathed to his<sup>asws</sup> son<sup>asws</sup> Al-Hassan<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) before his<sup>asws</sup> passing away by four months and kept me as a witness upon that, and a group of friends’."}]}, {"index": 846, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:2", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْكُوفِيِّ عَنْ بَشَّارِ بْنِ أَحْمَدَ الْبَصْرِيِّ عَنْ عَلِيِّ بْنِ عُمَرَ النَّوْفَلِيِّ قَالَ كُنْتُ مَعَ أَبِي الْحَسَنِ ( عليه السلام ) فِي صَحْنِ دَارِهِ فَمَرَّ بِنَا مُحَمَّدٌ ابْنُهُ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ هَذَا صَاحِبُنَا بَعْدَكَ فَقَالَ لَا صَاحِبُكُمْ بَعْدِيَ الْحَسَنُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Ja’far Bin Muhammad Al Kufy, from Bashhar Bin Ahmad Al Basry, from Ali Bin Umar Al Nowfaly who said, \n‘I was with Abu Al-Hassan<sup>asws</sup> in the courtyard of his<sup>asws</sup> house, so Muhammad his<sup>asws</sup> son passed by us. So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! This one would be our Master after you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘No. Your Master<sup>asws</sup> after me<sup>asws</sup> is Al-Hassan<sup>asws</sup>’."}]}, {"index": 847, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:3", "text": "عَنْهُ عَنْ بَشَّارِ بْنِ أَحْمَدَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْأَصْفَهَانِيِّ قَالَ قَالَ أَبُو الْحَسَنِ ( عليه السلام ) صَاحِبُكُمْ بَعْدِيَ الَّذِي يُصَلِّي عَلَيَّ قَالَ وَ لَمْ نَعْرِفْ أَبَا مُحَمَّدٍ قَبْلَ ذَلِكَ قَالَ فَخَرَجَ أَبُو مُحَمَّدٍ فَصَلَّى عَلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Bashhar Bin Ahmad, from Abdullah Bin Muhammad Al Isfahany who said, \n‘Abu Al-Hassan<sup>asws</sup> said: ‘Your Master<sup>asws</sup> after me<sup>asws</sup> is the one who would pray <span class=\"iTxt\">Salat</span> over me<sup>asws</sup>’, and we did not know Abu Muhammad<sup>asws</sup> before that. So Abu Muhammad<sup>asws</sup> came out and prayed <span class=\"iTxt\">Salat</span> over him<sup>asws</sup>’."}]}, {"index": 848, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:4", "text": "وَ عَنْهُ عَنْ مُوسَى بْنِ جَعْفَرِ بْنِ وَهْبٍ عَنْ عَلِيِّ بْنِ جَعْفَرٍ قَالَ كُنْتُ حَاضِراً أَبَا الْحَسَنِ ( عليه السلام ) لَمَّا تُوُفِّيَ ابْنُهُ مُحَمَّدٌ فَقَالَ لِلْحَسَنِ يَا بُنَيَّ أَحْدِثْ لِلَّهِ شُكْراً فَقَدْ أَحْدَثَ فِيكَ أَمْراً .", "translations": [{"lang": "en", "name": "hubeali", "text": "And from him, from Musa Bin Ja’far Bin Wahab, from Ali Bin Ja’far Who said, \n‘I was presence with Abu Al Hassan<sup>asws</sup> when his<sup>asws</sup> son Muhammad died. So he<sup>asws</sup> said to Al-Hassan<sup>asws</sup>: ‘O my<sup>asws</sup> son<sup>asws</sup>! Renew the thanks to Allah<sup>azwj</sup> for the command (Imamate) has come to be in you<sup>asws</sup>’."}]}, {"index": 849, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:5", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مَرْوَانَ الْأَنْبَارِيِّ قَالَ كُنْتُ حَاضِراً عِنْدَ مُضِيِّ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام ) فَجَاءَ أَبُو الْحَسَنِ ( عليه السلام ) فَوُضِعَ لَهُ كُرْسِيٌّ فَجَلَسَ عَلَيْهِ وَ حَوْلَهُ أَهْلُ بَيْتِهِ وَ أَبُو مُحَمَّدٍ قَائِمٌ فِي نَاحِيَةٍ فَلَمَّا فَرَغَ مِنْ أَمْرِ أَبِي جَعْفَرٍ الْتَفَتَ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) فَقَالَ يَا بُنَيَّ أَحْدِثْ لِلَّهِ تَبَارَكَ وَ تَعَالَى شُكْراً فَقَدْ أَحْدَثَ فِيكَ أَمْراً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah Bin Marwan Al Anbary who said, \n‘I was present during the passing away of Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> (9<sup>th</sup> Imam<sup>asws</sup>). So Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam) came over, and a chair was placed for him<sup>asws</sup>, so he<sup>asws</sup> sat upon it, and around him<sup>asws</sup> were his<sup>asws</sup> family members, and Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) was standing in a corner. So when he<sup>asws</sup> was free from the matter of Abu Ja’far<sup>asws</sup>, he<sup>asws</sup> turned towards Abu Muhammad<sup>asws</sup> and he<sup>asws</sup> said: ‘O my<sup>asws</sup> son<sup>asws</sup>! Renew thanks to Allah<sup>azwj</sup> Blessed and High for the command has come to be in you<sup>asws</sup>’."}]}, {"index": 850, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:6", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ الْقَلَانِسِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَمْرٍو عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) إِنْ كَانَ كَوْنٌ وَ أَعُوذُ بِاللَّهِ فَإِلَى مَنْ قَالَ عَهْدِي إِلَى الْأَكْبَرِ مِنْ وَلَدَيَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Muhammad Bin Ahmad Al Qalanasy, from Ali Bin Al Husayn Bin Amro, from Ali Bin Mahziyar who said, \n‘I said to Abu Al-Hassan<sup>asws</sup>, ‘If there was an occurrence (of death), and I seek Refuge with Allah<sup>azwj</sup>, so to whom?’ He<sup>asws</sup> said: ‘My<sup>asws</sup> Covenant is to the eldest of my<sup>asws</sup> sons’."}]}, {"index": 851, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:7", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَبِي مُحَمَّدٍ الْإِسْبَارِقِينِيِّ عَنْ عَلِيِّ بْنِ عَمْرٍو الْعَطَّارِ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ الْعَسْكَرِيِّ ( عليه السلام ) وَ أَبُو جَعْفَرٍ ابْنُهُ فِي الْأَحْيَاءِ وَ أَنَا أَظُنُّ أَنَّهُ هُوَ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ مَنْ أَخُصُّ مِنْ وُلْدِكَ فَقَالَ لَا تَخُصُّوا أَحَداً حَتَّى يَخْرُجَ إِلَيْكُمْ أَمْرِي قَالَ فَكَتَبْتُ إِلَيْهِ بَعْدُ فِيمَنْ يَكُونُ هَذَا الْأَمْرُ قَالَ فَكَتَبَ إِلَيَّ فِي الْكَبِيرِ مِنْ وَلَدَيَّ قَالَ وَ كَانَ أَبُو مُحَمَّدٍ أَكْبَرَ مِنْ أَبِي جَعْفَرٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Abu Muhammad Al Isbariqeyni, from Ali Bin Amro Al Attar who said, \n‘I went over to Abu Al-Hassan Al-Askary<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) and Abu Ja’far, his<sup>asws</sup> son during his life-time, and I thought that he would be him (the Imam<sup>asws</sup>). So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Whom from your<sup>asws</sup> sons should I choose?’ So he<sup>asws</sup> said: ‘Do not choose anyone until my<sup>asws</sup> order comes out to you all’. So I wrote to him<sup>asws</sup> afterwards, ‘In whom would this command (Imamate) come to be?’ So he<sup>asws</sup> wrote to me: ‘In the eldest of my<sup>asws</sup> sons’. And it was so that Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) was older than Abu Ja’far’."}]}, {"index": 852, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:8", "text": "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ سَعْدِ بْنِ عَبْدِ اللَّهِ عَنْ جَمَاعَةٍ مِنْ بَنِي هَاشِمٍ مِنْهُمُ الْحَسَنُ بْنُ الْحَسَنِ الْأَفْطَسُ أَنَّهُمْ حَضَرُوا يَوْمَ تُوُفِّيَ مُحَمَّدُ بْنُ عَلِيِّ بْنِ مُحَمَّدٍ بَابَ أَبِي الْحَسَنِ يُعَزُّونَهُ وَ قَدْ بُسِطَ لَهُ فِي صَحْنِ دَارِهِ وَ النَّاسُ جُلُوسٌ حَوْلَهُ \nفَقَالُوا قَدَّرْنَا أَنْ يَكُونَ حَوْلَهُ مِنْ آلِ أَبِي طَالِبٍ وَ بَنِي هَاشِمٍ وَ قُرَيْشٍ مِائَةٌ وَ خَمْسُونَ رَجُلًا سِوَى مَوَالِيهِ وَ سَائِرِ النَّاسِ إِذْ نَظَرَ إِلَى الْحَسَنِ بْنِ عَلِيٍّ قَدْ جَاءَ مَشْقُوقَ الْجَيْبِ حَتَّى قَامَ عَنْ يَمِينِهِ وَ نَحْنُ لَا نَعْرِفُهُ فَنَظَرَ إِلَيْهِ أَبُو الْحَسَنِ ( عليه السلام ) بَعْدَ سَاعَةٍ فَقَالَ يَا بُنَيَّ أَحْدِثْ لِلَّهِ عَزَّ وَ جَلَّ شُكْراً فَقَدْ أَحْدَثَ فِيكَ أَمْراً \nفَبَكَى الْفَتَى وَ حَمِدَ اللَّهَ وَ اسْتَرْجَعَ وَ قَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَ أَنَا أَسْأَلُ اللَّهَ تَمَامَ نِعَمِهِ لَنَا فِيكَ وَ إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ \nفَسَأَلْنَا عَنْهُ فَقِيلَ هَذَا الْحَسَنُ ابْنُهُ وَ قَدَّرْنَا لَهُ فِي ذَلِكَ الْوَقْتِ عِشْرِينَ سَنَةً أَوْ أَرْجَحَ فَيَوْمَئِذٍ عَرَفْنَاهُ وَ عَلِمْنَا أَنَّهُ قَدْ أَشَارَ إِلَيْهِ بِالْإِمَامَةِ وَ أَقَامَهُ مَقَامَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya and someone else, from Sa’ad Bin Abdullah, \n(It has been narrated) from a group of the Clan of Hashim<sup>as</sup>, from them being Al-Hassan Bin Al-Hassan Al-Aftas, that they were present, on the day Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup> (9<sup>th</sup> Imam<sup>asws</sup>) passed away, at the door of Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) consoling him<sup>asws</sup>, and there had been extended for him<sup>asws</sup> in the courtyard of his<sup>asws</sup> house, and the people were seated around him<sup>asws</sup>. \nSo they said, ‘We estimated that there would happen to be around him<sup>asws</sup> from the progeny of Abu Talib<sup>asws</sup> and the Clan of Hashim<sup>as</sup>, and Qureysh, one hundred and fifty men, besides his<sup>asws</sup> friends and the rest of the people. We looked at Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> who had come with a torn shirt until he<sup>asws</sup> stood on his<sup>asws</sup> right, and we did not know him<sup>asws</sup>. So Abu Al-Hassan<sup>asws</sup> looked at him<sup>asws</sup> after a while and he<sup>asws</sup> said: ‘O my<sup>asws</sup> son<sup>asws</sup>! Renew thanks for Allah<sup>azwj</sup> Mighty and Majestic for the command (Imamate) has occurred in you<sup>asws</sup>’. \nSo the youth wept and Praised Allah<sup>azwj</sup> and said: ‘We are for Allah<sup>azwj</sup> and to Him<sup>azwj</sup> are we returning’, and said: ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the words, and I<sup>asws</sup> ask Allah<sup>azwj</sup> for the completion of His<sup>azwj</sup> Bounties for us in you<sup>asws</sup>, and we are for Allah<sup>azwj</sup> and we are returning to Him<sup>azwj</sup>’. \nSo we asked about him<sup>asws</sup>, and it was said, ‘This is Al-Hassan<sup>asws</sup>, his<sup>asws</sup> son<sup>asws</sup>’, and we estimated for him<sup>asws</sup> at that time to be of twenty years or more. So it was in those days that we recognised him<sup>asws</sup> and we knew that he<sup>asws</sup> had indicated to him<sup>asws</sup> as being with the Imamate, and (had made) him<sup>asws</sup> stood in his<sup>asws</sup> own place’."}]}, {"index": 853, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:9", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ دَرْيَابَ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ ( عليه السلام ) بَعْدَ مُضِيِّ أَبِي جَعْفَرٍ فَعَزَّيْتُهُ عَنْهُ وَ أَبُو مُحَمَّدٍ ( عليه السلام ) جَالِسٌ فَبَكَى أَبُو مُحَمَّدٍ ( عليه السلام ) فَأَقْبَلَ عَلَيْهِ أَبُو الْحَسَنِ ( عليه السلام ) فَقَالَ لَهُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَدْ جَعَلَ فِيكَ خَلَفاً مِنْهُ فَاحْمَدِ اللَّهَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Is’haq Bin Muhammad, from Muhammad Bin Yahya Bin Daryaab who said, \n‘I went over to Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) after the passing away of Abu Ja’far<sup>asws</sup> (9<sup>th</sup> Imam<sup>asws</sup>) So I consoled him<sup>asws</sup> about him<sup>asws</sup> and Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) was seated. So Abu Muhammad<sup>asws</sup> wept and Abu Al-Hassan<sup>asws</sup> faced him<sup>asws</sup> and said to him<sup>asws</sup>: ‘Allah<sup>azwj</sup> Blessed and High has Made you<sup>asws</sup> to be a replacement from him<sup>asws</sup>, therefore Praise Allah<sup>azwj</sup>’."}]}, {"index": 854, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:10", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ عَنْ أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ كُنْتُ عِنْدَ أَبِي الْحَسَنِ ( عليه السلام ) بَعْدَ مَا مَضَى ابْنُهُ أَبُو جَعْفَرٍ وَ إِنِّي لَأُفَكِّرُ فِي نَفْسِي أُرِيدُ أَنْ أَقُولَ كَأَنَّهُمَا أَعْنِي أَبَا جَعْفَرٍ وَ أَبَا مُحَمَّدٍ فِي هَذَا الْوَقْتِ كَأَبِي الْحَسَنِ مُوسَى وَ إِسْمَاعِيلَ ابْنَيْ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام ) وَ إِنَّ قِصَّتَهُمَا كَقِصَّتِهِمَا إِذْ كَانَ أَبُو مُحَمَّدٍ الْمُرْجَى بَعْدَ أَبِي جَعْفَرٍ ( عليه السلام ) \nفَأَقْبَلَ عَلَيَّ أَبُو الْحَسَنِ قَبْلَ أَنْ أَنْطِقَ فَقَالَ نَعَمْ يَا أَبَا هَاشِمٍ بَدَا لِلَّهِ فِي أَبِي مُحَمَّدٍ بَعْدَ أَبِي جَعْفَرٍ ( عليه السلام ) مَا لَمْ يَكُنْ يُعْرَفُ لَهُ كَمَا بَدَا لَهُ فِي مُوسَى بَعْدَ مُضِيِّ إِسْمَاعِيلَ مَا كَشَفَ بِهِ عَنْ حَالِهِ وَ هُوَ كَمَا حَدَّثَتْكَ نَفْسُكَ وَ إِنْ كَرِهَ الْمُبْطِلُونَ وَ أَبُو مُحَمَّدٍ ابْنِي الْخَلَفُ مِنْ بَعْدِي عِنْدَهُ عِلْمُ مَا يُحْتَاجُ إِلَيْهِ وَ مَعَهُ آلَةُ الْإِمَامَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Is’haq Bin Muhammad, from Abu Hashim Al Ja’fary who said, \n‘I was in the presence of Abu Al-Hassan<sup>asws</sup> after the passing away of his<sup>asws</sup> son Abu Ja’far, and I was thinking within myself intending that I should be saying, ‘It is as if these two, meaning Abu Ja’far and Abu Muhammad<sup>asws</sup>, at this time, are like Abu Al-Hassan Musa<sup>asws</sup> and Ismail, the two sons of Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> and that both their stories are like both their stories, whether it would be Abu Muhammad as the appointee after Abu Ja’far<sup>asws</sup>.\nSo Abu Al-Hassan<sup>asws</sup> turned towards me before I could speak, and he<sup>asws</sup> said: ‘Yes, O Abu Hashim! There is a Change in Allah<sup>azwj</sup>’s Decision regarding Abu Muhammad being after Abu Ja’far<sup>asws</sup> what did not happen to be a recognition for him, just as there was a Change in Allah<sup>azwj</sup>’s Decision for Him<sup>azwj</sup> regarding Musa<sup>as</sup> after the passing away of Ismail, what was uncovered with it from his state, and it is just as you narrated to yourself, and even though the falsifiers may dislike it. And it would be Abu Muhammad<sup>asws</sup>, my<sup>asws</sup> son<sup>asws</sup>, as the Caliph after me<sup>asws</sup>. With him<sup>asws</sup> is the knowledge of whatever is needed to, and with him<sup>asws</sup> are the Signs of the Imamate’."}]}, {"index": 855, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:11", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ دَرْيَابَ عَنْ أَبِي بَكْرٍ الْفَهْفَكِيِّ قَالَ كَتَبَ إِلَيَّ أَبُو الْحَسَنِ ( عليه السلام ) أَبُو مُحَمَّدٍ ابْنِي أَنْصَحُ آلِ مُحَمَّدٍ غَرِيزَةً وَ أَوْثَقُهُمْ حُجَّةً وَ هُوَ الْأَكْبَرُ مِنْ وَلَدَيَّ وَ هُوَ الْخَلَفُ وَ إِلَيْهِ يَنْتَهِي عُرَى الْإِمَامَةِ وَ أَحْكَامُهَا فَمَا كُنْتَ سَائِلِي فَسَلْهُ عَنْهُ فَعِنْدَهُ مَا يُحْتَاجُ إِلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Is’haq Bin Muhammad, from Muhammad Bin Yahya Bin Daryab, from Abu Bakr Al Fahfaky who said, \n‘Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) wrote to me: ‘Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) my<sup>asws</sup> son<sup>asws</sup> is the most of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, distinguished, and strongest of proofs, and he<sup>asws</sup> is the eldest of my<sup>asws</sup> sons<sup>asws</sup>, and he<sup>asws</sup> is replacement, and to him<sup>asws</sup> ends up the handle of the Imamate and its decisions. So whatever you ask me<sup>asws</sup>, so ask him<sup>asws</sup> about it, for with him<sup>asws</sup> is whatever you are needy to’."}]}, {"index": 856, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:12", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ عَنْ شَاهَوَيْهِ بْنِ عَبْدِ اللَّهِ الْجَلَّابِ قَالَ كَتَبَ إِلَيَّ أَبُو الْحَسَنِ فِي كِتَابٍ أَرَدْتَ أَنْ تَسْأَلَ عَنِ الْخَلَفِ بَعْدَ أَبِي جَعْفَرٍ وَ قَلِقْتَ لِذَلِكَ فَلَا تَغْتَمَّ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يُضِلُّ قَوْماً بَعْدَ إِذْ هَدَاهُمْ حَتَّى يُبَيِّنَ لَهُمْ مَا يَتَّقُونَ وَ صَاحِبُكَ بَعْدِي أَبُو مُحَمَّدٍ ابْنِي وَ عِنْدَهُ مَا تَحْتَاجُونَ إِلَيْهِ يُقَدِّمُ مَا يَشَاءُ اللَّهُ وَ يُؤَخِّرُ مَا يَشَاءُ اللَّهُ ما نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِها نَأْتِ بِخَيْرٍ مِنْها أَوْ مِثْلِها \nقَدْ كَتَبْتُ بِمَا فِيهِ بَيَانٌ وَ قِنَاعٌ لِذِي عَقْلٍ يَقْظَانَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Is’haq Bin Muhammad, from Shahawiya Bin Abdullah Al Khallab who said, \n‘Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) wrote to me: ‘You wanted to ask about the Caliph after Abu Ja’far<sup>asws</sup> and you were anxious for that. So do not be gloomy, for Allah<sup>azwj</sup> Mighty and Majestic does not <span class=\"ibTxt\">[9:115] Let a people stray after He has Guided them; until He Clarifies to them what they should guard against</span>. And your Master<sup>asws</sup> after me<sup>asws</sup> is Abu Muhammad<sup>asws</sup>, (11<sup>th</sup> Imam<sup>asws</sup>) my<sup>asws</sup> son<sup>asws</sup>, and with him<sup>asws</sup> is whatever they (people) would be needy to. Allah<sup>azwj</sup> Brings forward whatever He<sup>azwj</sup> so Desires to and Allah<sup>azwj</sup> Delays whatever He<sup>azwj</sup> so Desires to <span class=\"ibTxt\">[2:106] Whatever from a Verse We Abrogate or cause it to be forgotten, We Come with one better than it or the like of it</span>. \nI<sup style=\"font-weight: normal\">asws</sup> have written with what is a clarification therein and a contentment for the one with an alert intellect’."}]}, {"index": 857, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:1:4:75:13", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ الْعَلَوِيِّ عَنْ دَاوُدَ بْنِ الْقَاسِمِ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ الْخَلَفُ مِنْ بَعْدِيَ الْحَسَنُ فَكَيْفَ لَكُمْ بِالْخَلَفِ مِنْ بَعْدِ الْخَلَفِ فَقُلْتُ وَ لِمَ جَعَلَنِيَ اللَّهُ فِدَاكَ فَقَالَ إِنَّكُمْ لَا تَرَوْنَ شَخْصَهُ وَ لَا يَحِلُّ لَكُمْ ذِكْرُهُ بِاسْمِهِ فَقُلْتُ فَكَيْفَ نَذْكُرُهُ فَقَالَ قُولُوا الْحُجَّةُ مِنْ آلِ مُحَمَّدٍ عَلَيْهِمُ السَّلَامُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from the one who mentioned it, from Muhammad Bin Ahmad Al Alawy, from Dawood Bin Al Qasim who said, \n‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘The replacement (Imam<sup>asws</sup>) from after me<sup>asws</sup> is Al-Hassan<sup>asws</sup>. So how would it be for you all with the replacement (Imam<sup>asws</sup>) from after the replacement (Imam<sup>asws</sup>)?’ So I said, ‘And why (would it be so)? May Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>!’ So he<sup>asws</sup> said: ‘You all would not be seeing his<sup>asws</sup> person (physically), nor would it be Permissible for you all to mention him<sup>asws</sup> by his<sup>asws</sup> name’. So I said, ‘So how should be mention him<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘You should be saying, ‘الْحُجَّةُ مِنْ آلِ مُحَمَّدٍ عَلَيْهِمُ السَّلَامُ’ ‘The Divine Authority (Al-Hujjat) from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’."}]}]}, "index": "al-kafi:1:4:75", "kind": "verse_list"}