{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 77"
        },
        "path": "/books/al-kafi:1:4:77",
        "titles": {
          "ar": "باب فِي تَسْمِيَةِ مَنْ رَآهُ ( عليه السلام )",
          "en": "Chapter 77 – Regarding the naming of the ones who saw him<sup>asws</sup>"
        }
      }
    ],
    "index": 135,
    "local_index": 77,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 78"
        },
        "path": "/books/al-kafi:1:4:78",
        "titles": {
          "ar": "باب فِي النَّهْيِ عَنِ الِاسْمِ",
          "en": "Chapter 78 – Regaring the forbiddance from the name"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 76"
        },
        "path": "/books/al-kafi:1:4:76",
        "titles": {
          "ar": "بَابُ الْإِشَارَةِ وَ النَّصِّ إِلَى صَاحِبِ الدَّارِ ( عليه السلام )",
          "en": "Chapter 76 – The Indication and the wordings upon the Master<sup>asws</sup> of the world (12<sup>th</sup> Imam<sup>asws</sup>)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:77",
    "titles": {
      "ar": "باب فِي تَسْمِيَةِ مَنْ رَآهُ ( عليه السلام )",
      "en": "Chapter 77 – Regarding the naming of the ones who saw him<sup>asws</sup>"
    },
    "verse_count": 15,
    "verse_start_index": 863,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح وسنده التي مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/ 4)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/38)"
        ],
        "index": 864,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/922",
              "text": "مُحَمَّدُ بْنُ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/923",
              "text": "عَبْدِ اللَّهِ بْنِ جَعْفَرٍ الْحِمْيَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ عَبْدِ اللَّهِ وَ مُحَمَّدُ بْنُ يَحْيَى جَمِيعاً عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ الْحِمْيَرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:1",
        "relations": {
          "Mentions": [
            "/books/quran:2:260",
            "/books/quran:6:158"
          ]
        },
        "text": [
          " اجْتَمَعْتُ أَنَا وَ الشَّيْخُ أَبُو عَمْرٍو رَحِمَهُ اللَّهُ عِنْدَ أَحْمَدَ بْنِ إِسْحَاقَ فَغَمَزَنِي أَحْمَدُ بْنُ إِسْحَاقَ أَنْ أَسْأَلَهُ عَنِ الْخَلَفِ فَقُلْتُ لَهُ يَا أَبَا عَمْرٍو إِنِّي أُرِيدُ أَنْ أَسْأَلَكَ عَنْ شَيْ‏ءٍ وَ مَا أَنَا بِشَاكٍّ فِيمَا أُرِيدُ أَنْ أَسْأَلَكَ عَنْهُ فَإِنَّ اعْتِقَادِي وَ دِينِي أَنَّ الْأَرْضَ لَا تَخْلُو مِنْ حُجَّةٍ إِلَّا إِذَا كَانَ قَبْلَ يَوْمِ الْقِيَامَةِ بِأَرْبَعِينَ يَوْماً فَإِذَا كَانَ ذَلِكَ رُفِعَتِ الْحُجَّةُ وَ أُغْلِقَ بَابُ التَّوْبَةِ فَلَمْ يَكُ يَنْفَعُ نَفْساً إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْراً ",
          "فَأُولَئِكَ أَشْرَارٌ مِنْ خَلْقِ اللَّهِ عَزَّ وَ جَلَّ وَ هُمُ الَّذِينَ تَقُومُ عَلَيْهِمُ الْقِيَامَةُ وَ لَكِنِّي أَحْبَبْتُ أَنْ أَزْدَادَ يَقِيناً وَ إِنَّ إِبْرَاهِيمَ ( عليه السلام ) سَأَلَ رَبَّهُ عَزَّ وَ جَلَّ أَنْ يُرِيَهُ كَيْفَ يُحْيِي الْمَوْتَى قَالَ أَ وَ لَمْ تُؤْمِنْ قَالَ بَلَى وَ لَكِنْ لِيَطْمَئِنَّ قَلْبِي",
          "وَ قَدْ أَخْبَرَنِي أَبُو عَلِيٍّ أَحْمَدُ بْنُ إِسْحَاقَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ وَ قُلْتُ مَنْ أُعَامِلُ أَوْ عَمَّنْ آخُذُ وَ قَوْلَ مَنْ أَقْبَلُ فَقَالَ لَهُ الْعَمْرِيُّ ثِقَتِي فَمَا أَدَّى إِلَيْكَ عَنِّي فَعَنِّي يُؤَدِّي وَ مَا قَالَ لَكَ عَنِّي فَعَنِّي يَقُولُ فَاسْمَعْ لَهُ وَ أَطِعْ فَإِنَّهُ الثِّقَةُ الْمَأْمُونُ",
          "وَ أَخْبَرَنِي أَبُو عَلِيٍّ أَنَّهُ سَأَلَ أَبَا مُحَمَّدٍ ( عليه السلام ) عَنْ مِثْلِ ذَلِكَ فَقَالَ لَهُ الْعَمْرِيُّ وَ ابْنُهُ ثِقَتَانِ فَمَا أَدَّيَا إِلَيْكَ عَنِّي فَعَنِّي يُؤَدِّيَانِ وَ مَا قَالَا لَكَ فَعَنِّي يَقُولَانِ فَاسْمَعْ لَهُمَا وَ أَطِعْهُمَا فَإِنَّهُمَا الثِّقَتَانِ الْمَأْمُونَانِ فَهَذَا قَوْلُ إِمَامَيْنِ قَدْ مَضَيَا فِيكَ",
          "قَالَ فَخَرَّ أَبُو عَمْرٍو سَاجِداً وَ بَكَى ثُمَّ قَالَ سَلْ حَاجَتَكَ فَقُلْتُ لَهُ أَنْتَ رَأَيْتَ الْخَلَفَ مِنْ بَعْدِ أَبِي مُحَمَّدٍ ( عليه السلام ) فَقَالَ إِي وَ اللَّهِ وَ رَقَبَتُهُ مِثْلُ ذَا وَ أَوْمَأَ بِيَدِهِ",
          "فَقُلْتُ لَهُ فَبَقِيَتْ وَاحِدَةٌ فَقَالَ لِي هَاتِ قُلْتُ فَالِاسْمُ قَالَ مُحَرَّمٌ عَلَيْكُمْ أَنْ تَسْأَلُوا عَنْ ذَلِكَ وَ لَا أَقُولُ هَذَا مِنْ عِنْدِي فَلَيْسَ لِي أَنْ أُحَلِّلَ وَ لَا أُحَرِّمَ وَ لَكِنْ عَنْهُ ( عليه السلام ) فَإِنَّ الْأَمْرَ عِنْدَ السُّلْطَانِ أَنَّ أَبَا مُحَمَّدٍ مَضَى وَ لَمْ يُخَلِّفْ وَلَداً وَ قَسَّمَ مِيرَاثَهُ وَ أَخَذَهُ مَنْ لَا حَقَّ لَهُ فِيهِ وَ هُوَ ذَا عِيَالُهُ يَجُولُونَ لَيْسَ أَحَدٌ يَجْسُرُ أَنْ يَتَعَرَّفَ إِلَيْهِمْ أَوْ يُنِيلَهُمْ شَيْئاً وَ إِذَا وَقَعَ الِاسْمُ وَقَعَ الطَّلَبُ فَاتَّقُوا اللَّهَ وَ أَمْسِكُوا عَنْ ذَلِكَ .",
          "قَالَ الْكُلَيْنِيُّ رَحِمَهُ اللَّهُ وَ حَدَّثَنِي شَيْخٌ مِنْ أَصْحَابِنَا ذَهَبَ عَنِّي اسْمُهُ أَنَّ أَبَا عَمْرٍو سَأَلَ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ مِثْلِ هَذَا فَأَجَابَ بِمِثْلِ هَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abdullah and Muhammad Bin Yahya, altogether from Abdullah Bin Ja’far Al Humeyri who said, ",
            "‘I and Sheykh Abu Amro, may Allah<sup>azwj</sup> be Pleased with him, gathered in the presence of Ahmad Bin Is’haq. So Ahmad Bin Is’haq winked at me that I should ask him about the replacement (Imam<sup>asws</sup>). So I said to him, ‘O Abu Amro! I want to ask you about something, and I am not with a doubt regarding what I intend to ask you about. So my belief and my Religion is that the earth cannot be empty from a Divine Authority except when it would be just before the Day of Judgment by forty days. So when it would be that, the Divine Authority would be Raised and the door of repentance would be shut. Thus, no soul shall benefit by its <span class=\"iTxt\">Eman</span> which it did not belief from before, or goodness having been earned by its <span class=\"iTxt\">Eman </span><span class=\"ibTxt\"><a href=\"/#/books/quran:6#h158\">[6:158]</a> its faith shall not profit a soul, which did not believe before, or earn good through its faith</span>. ",
            "So they would be the most evil of the creatures of Allah<sup>azwj</sup> Mighty and Majestic, and they are those against whom the Day of Judgment would be Established. But, I would like to increase conviction and that Ibrahim<sup>as</sup> asked his<sup>as</sup> Lord<sup>azwj</sup> Mighty and Majestic how He<sup>azwj</sup> Revives the dead <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h260\">[2:260]</a> He said: Or you do not believe? He said: Yes, but to reassure my heart</span>.",
            "And Abu Ali Ahmad Bin Is’haq informed me from Abu Al-Hassan<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) saying, ‘I asked him<sup>asws</sup> and said, ‘So who is the office bearer, or from whom should I take, and whose word should I accept?’ So he<sup>asws</sup> said to him: ‘Al-Amiry is my<sup>asws</sup> reliable one, therefore whatever he brings to you from me<sup>asws</sup>, so I<sup>asws</sup> have put it across, and whatever he says to you from me<sup>asws</sup>, so I<sup>asws</sup> have said it. Therefore, listen to him and obey, for he is the reliable, the trustworthy’. ",
            "And Abu Ali informed me that he asked Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) about similar to that, so he<sup>asws</sup> said to him: ‘Al-Amiry and his son are two reliable ones. So whatever they both bring to you from me<sup>asws</sup>, so I<sup>asws</sup> have put it across to them, and whatever they both say to you, so I<sup>asws</sup> have said it to them. Therefore, listen to them both and obey them, for they are both reliable ones, trustworthy ones. So these are the words of two Imams<sup>asws</sup> proceeding with regards to you’. ",
            "He said, ‘So Abu Amro fell prostrating and wept. Then he said, ‘Ask your need’. So I said to him, ‘You have seen the replacement (Imam<sup>asws</sup>) from after Abu Muhammad<sup>asws</sup>?’. So he said, ‘Yes, by Allah<sup>azwj</sup>, and his<sup>asws</sup> neck was similar to that’, and he gestured by his hand. ",
            "So I said to him, ‘So there remains one (question)’. So he said to me, ‘Give’. I said, ‘So (what is) the name?’ He said, ‘It is Prohibited upon you that you should be asking about that nor will I be saying this from myself. Thus, there isn’t for me that I should permit nor that I should prohibit, but it is from him<sup>asws</sup>, for the matter with the ruling authority (Caliph Mu’tasim) is that Abu Muhammad<sup>asws</sup> passed away and did not leave behind a son, and he<sup>asws</sup> distributed his<sup>asws</sup> inheritance, and it was taken by the ones who had no right to it with regards to it, and he<sup>asws</sup> is with dependents who are roaming around. There isn’t anyone bold enough that he should introduce himself to them nor give them anything. And when the name will occur, the seeking (from the ruling authorities) would occur, therefore fear Allah<sup>azwj</sup> and withhold from that’. ",
            "Al-Kulayni, may Allah<sup>azwj</sup> have Mercy on him, said, ‘It was narrated to me by a companions whose name escapes me, that Amro asked from Ahmad Bin Is’haq, about similar to this, so he answered with similar to this’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn ‘Abdallah and Muhammad ibn Yahya, all have narrated from ‘Abdallah ibn Ja‘far al-Himyari who has said the following. “I and shaykh abu ‘Amr, may Allah grant him blessings met each other before Ahmad ibn Ishaq. Ahmad ibn Ishaq made an eye gesture to me to ask him about the succeeding Imam. I said to him, “O abu ‘Amr, I like to ask you a question about a matter, although, I do not any doubts in the question I am about to ask. It is my belief and religion that the earth is not left without a Leadership with Divine Authority except if would be just before the coming of the Day of Judgment by forty days because in such a period Leadership with Divine Authority will take away. The door to repentance will be closed. No soul will benefit from the faith with which it has not achieved any good deeds. “. . the belief of any soul will be of no avail to it unless some good deeds have been done with it, or it has been formed before the coming of such a day. .” <a href=\"/#/books/quran:6#h158\">[6:158]</a> Such people would be of the evil creatures of Allah, the Most Majestic, the Most gracious, and it is these people on whom the Day of Judgment will be established. However, I wanted to strengthen my faith further just as Abrahm (a.s.) asked his Lord, the Most Majestic, the Most gracious, to show him how would He will bring the dead to life again. He said, “When Abraham prayed, “Lord, show me how you bring the dead back to life,” the Lord said, “Do you not yet believe?” Abraham replied, “I believe but want more confidence for my heart.. .” <a href=\"/#/books/quran:2#h260\">[2:260]</a> Abu Ali Ahmad ibn Ishaq has inarrated to me from abu al-Hassan (a.s.) who has said that he asked the Imam (a.s.), “With who should I deal and ask questions about my faith and religion and whose words should I accept (after you)?” The Imam (a.s.) said to him, “Al-‘Amri is trustworthy to me. Whatever he will deliver to you is from me. From me he delivers. Whatever he would say is from me, from me he saays it. Listen to him and obey him because he is reliable and trustworthy. Abu Ali has said to me that he asked abu Muhammad (a.s.) a similar question and he said to him, “Al-‘Amri and his son are trustworthy people. Whatever they would deliver to you is from me from they deliover. Whatevet they say to you from they say it. Listen to them and obey them because they are trustworthy and reliable people. These are the words of the Imams spoken about you. Abu ‘Amr fell down on his face in prostration and wept. Then he said, “Ask what you need to ask.” I said, “Did you see the succeeding Imam (Leader with Divine Authority) after abu Muhammad (a.s.) ?” He said, “Yes, by Allah , his neck was like that-making a gesture with his hand.” I then said, “Onne more question is left.” He said, “Say, whaever is is it.” I said, “What is his (succeding Imam) name?” He said, “It is unlawful for you to ask about it. I do not say this because abu left this world without a surviving son. His legacy is distributed and is taken away by one who has no right in it. He is (that prson). His family is despersed and no one has the courage to learn about them or recieve any thing from them. When the name is mentioned search for him will take place. Have fear of Allah and abstain from it.” Al-Kulayni, may Allah grant his soul blessings, has said, “:A shaykh from our people narrated this to me – his name I have forgotten- that abu’Amr asked Ahmad ibn Ishaq a similar question and received a similar answer.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/8)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 865,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/924",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ مُوسَى بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/925",
              "text": "كَانَ أَسَنَّ شَيْخٍ مِنْ وُلْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بِالْعِرَاقِ"
            },
            {
              "kind": "plain",
              "text": " فَقَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ مُوسَى بْنِ جَعْفَرٍ وَ كَانَ أَسَنَّ شَيْخٍ مِنْ وُلْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بِالْعِرَاقِ فَقَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:2",
        "text": [
          " رَأَيْتُهُ بَيْنَ الْمَسْجِدَيْنِ وَ هُوَ غُلَامٌ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, ",
            "(It has been narrated) from Muhammad Bin Ismail Bin Musa Bin Ja’far, and he was the most aged Sheykhs from the children of Rasool-Allah<sup>saww</sup> in Al-Iraq. So he said, ‘I saw him<sup>asws</sup> between the two Masjids and he<sup>asws</sup> was a boy’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Muhammad has narrated from Muhammad ibn ’Isma‘il ibn Musa ibn Ja‘far, the most senior (in his time) of the descendants of the Messenger of Allah, in Iraq has said the following. “I saw him (the twelfth Imam (a.s.)) between the two mosque while he was a boy.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 866,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/926",
              "text": "الْحُسَيْنِ بْنِ رِزْقِ اللَّهِ أَبُو عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/927",
              "text": "مُوسَى بْنُ مُحَمَّدِ بْنِ الْقَاسِمِ بْنِ حَمْزَةَ بْنِ مُوسَى بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحُسَيْنِ بْنِ رِزْقِ اللَّهِ أَبُو عَبْدِ اللَّهِ قَالَ حَدَّثَنِي مُوسَى بْنُ مُحَمَّدِ بْنِ الْقَاسِمِ بْنِ حَمْزَةَ بْنِ مُوسَى بْنِ جَعْفَرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:3",
        "text": [
          " حَدَّثَتْنِي حَكِيمَةُ ابْنَةُ مُحَمَّدِ بْنِ عَلِيٍّ وَ هِيَ عَمَّةُ أَبِيهِ أَنَّهَا رَأَتْهُ لَيْلَةَ مَوْلِدِهِ وَ بَعْدَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Al Husayn Bin Rizqallah Abu Abdullah who said, ‘Musa Bin Muhammad Bin Al Qasim Bin Hamza Bin Musa Bin Ja’far narrated to me saying, ",
            "‘It was narrated to me by Hakeema, daughter of Muhammad Bin Ali<sup>asws</sup>, and she is the paternal aunt of his<sup>asws</sup> father<sup>asws</sup>, that she saw him<sup>asws</sup> on the night of his<sup>asws</sup> Blessed birth and after that’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from al-Husayn ibn Rizqillah abu ‘Abdallah ‘Abdallah who has said the following. “Musa ibn Muhammad ibn al-Qasim ibn Hamzah ibn Musa ibn Ja‘far narrated to me that Hakima, the daughter of Muhammad ibn Ali (a.s.) and the paternal aunt of his (the twelfth’s) father, said to me that she had seen him on the night of his birth and afterwards.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/10)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 867,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/916",
              "text": "حَمْدَانَ الْقَلَانِسِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ حَمْدَانَ الْقَلَانِسِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:4",
        "text": [
          " قُلْتُ لِلْعَمْرِيِّ قَدْ مَضَى أَبُو مُحَمَّدٍ ( عليه السلام ) فَقَالَ قَدْ مَضَى وَ لَكِنْ قَدْ خَلَّفَ فِيكُمْ مَنْ رَقَبَتُهُ مِثْلُ هَذَا وَ أَشَارَ بِيَدِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Hamdan Al Qalansy who said, ",
            "‘I said to Al-Amry, ‘Had Abu Muhammad<sup>asws</sup> passed away?’ So he said: ‘He<sup>asws</sup> has passed away, but he<sup>asws</sup> has left behind among you the one<sup>asws</sup> whose neck is like this’, and he indicated by his hand’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad has narrated from Hamdan al-Qalanisi who has said the following. “I asked al-‘Amri, “Has abu Muhammad (a.s.) passed away?” He said, “Yes, he has passed away but has left behind among you a person (the succeeding Imam) whose neck is like this. He made a sign with his hand (meaning thereby good health and beauty).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/10)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 868,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/928",
              "text": "فَتْحٍ مَوْلَى الزُّرَارِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ فَتْحٍ مَوْلَى الزُّرَارِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:5",
        "text": [
          " سَمِعْتُ أَبَا عَلِيِّ بْنَ مُطَهَّرٍ يَذْكُرُ أَنَّهُ قَدْ رَآهُ وَ وَصَفَ لَهُ قَدَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Fat’h, a slave of Al Zarary who said, ",
            "‘I heard Abu Ali Bin Mut’har mention that he had seen him<sup>asws</sup>, and described his<sup>asws</sup> tallness to him’."
          ],
          "en.sarwar": [
            " 5. Ali ibn Muhammad has narrated from Fath, Mawla (slave) of al-Zurari who has said the following. “I heard abu Ali ibn Mutahhar saying that has seen him (the twelfth Imam) and would describe his (Imam’s) figure.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/10)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 869,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/929",
              "text": "مُحَمَّدِ بْنِ شَاذَانَ بْنِ نُعَيْمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/930",
              "text": "خَادِمٍ لِإِبْرَاهِيمَ بْنِ عَبْدَةَ النَّيْسَابُورِيِّ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ شَاذَانَ بْنِ نُعَيْمٍ عَنْ خَادِمٍ لِإِبْرَاهِيمَ بْنِ عَبْدَةَ النَّيْسَابُورِيِّ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:6",
        "text": [
          "هَا قَالَتْ كُنْتُ وَاقِفَةً مَعَ إِبْرَاهِيمَ عَلَى الصَّفَا فَجَاءَ ( عليه السلام ) حَتَّى وَقَفَ عَلَى إِبْرَاهِيمَ وَ قَبَضَ عَلَى كِتَابِ مَنَاسِكِهِ وَ حَدَّثَهُ بِأَشْيَاءَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Shazan Bin Nuaym, from Khadim Al Ibrahim Bin Abda Al Neyshapouri that she said, ",
            "‘I was staying with Ibrahim at Al-Safa, so he<sup>asws</sup> came until he<sup>asws</sup> paused by Ibrahim and grabbed the book of his rituals and discussed some things with him’."
          ],
          "en.sarwar": [
            " 6. Ali ibn Muhammad has narrated from Muhammad ibn Shadhan ibn Nu‘aym from Ibrahim ibn ‘Abdahu al-Naysaburi’s house maid who has said the following. “I was standing with Ibrahim on al-Safa’ that he (the twelfth Imam) came and stood higher than Ibrahim, took his Hajj guide book and spoke to him about a number of things.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 870,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/931",
              "text": "مُحَمَّدِ بْنِ عَلِيِّ بْنِ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/932",
              "text": "أَبِي عَبْدِ اللَّهِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ بْنِ صَالِحٍ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:7",
        "text": [
          "هُ رَآهُ عِنْدَ الْحَجَرِ الْأَسْوَدِ وَ النَّاسُ يَتَجَاذَبُونَ عَلَيْهِ وَ هُوَ يَقُولُ مَا بِهَذَا أُمِرُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Ali Bin Ibrahim, from Abu Abdullah Bin Salih that, ",
            "‘He saw him<sup>asws</sup> by the Black Stone (Al-Hajr Al-Aswad), and the people were flocking upon it, and he<sup>asws</sup> was saying: ‘This is no what they have been Commanded with’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Muhammad has narrated from Muhammad ibn Ali ibn Ibrahim from abu ‘Abdallah ibn Salih who has said the following. “I saw him (the twelfth Imam) near the Black Stone while people were clinging over it. The Imam (a.s.) would say, “They are not commanded in this condition ( to kiss the Black Stone.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/11)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 871,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/55",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/933",
              "text": "أَبِي عَلِيٍّ أَحْمَدَ بْنِ إِبْرَاهِيمَ بْنِ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِي عَلِيٍّ أَحْمَدَ بْنِ إِبْرَاهِيمَ بْنِ إِدْرِيسَ عَنْ أَبِيهِ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:8",
        "text": [
          "هُ قَالَ رَأَيْتُهُ ( عليه السلام ) بَعْدَ مُضِيِّ أَبِي مُحَمَّدٍ حِينَ أَيْفَعَ وَ قَبَّلْتُ يَدَيْهِ وَ رَأْسَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from Abu Al Ahmad Bin Ibrahim Bin Idrees, from his father that he said, ",
            "‘I saw him<sup>asws</sup> after the passing away of Abu Muhammad<sup>asws</sup> when he<sup>asws</sup> had reached adolescence and I kissed his<sup>asws</sup> hand and his<sup>asws</sup> head’."
          ],
          "en.sarwar": [
            " 8. Ali has narrated from abu Ali Ahmad ibn Ibrahim ibn Idris from his father who has said the following. “I saw him (the twelfth Imam) after the death of abu Muhammad (a.s.) when he had reached adolescence. I kissed his hand and head.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/11)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 872,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/55",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/932",
              "text": "أَبِي عَبْدِ اللَّهِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/202",
              "text": "أَحْمَدَ بْنِ النَّضْرِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/934",
              "text": "الْقَنْبَرِيِّ رَجُلٌ مِنْ وُلْدِ قَنْبَرٍ الْكَبِيرِ مَوْلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِي عَبْدِ اللَّهِ بْنِ صَالِحٍ وَ أَحْمَدَ بْنِ النَّضْرِ عَنِ الْقَنْبَرِيِّ رَجُلٌ مِنْ وُلْدِ قَنْبَرٍ الْكَبِيرِ مَوْلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:9",
        "text": [
          " جَرَى حَدِيثُ جَعْفَرِ بْنِ عَلِيٍّ فَذَمَّهُ فَقُلْتُ لَهُ فَلَيْسَ غَيْرُهُ فَهَلْ رَأَيْتَهُ فَقَالَ لَمْ أَرَهُ وَ لَكِنْ رَآهُ غَيْرِي قُلْتُ وَ مَنْ رَآهُ قَالَ قَدْ رَآهُ جَعْفَرٌ مَرَّتَيْنِ وَ لَهُ حَدِيثٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from Abu Abdullah Bin Salih and Ahmad Bin Al Nazar, from Al Qanbary, a man from the children of Qanbar the great, ",
            "(It has been narrated) a slave of Abu Al-Hassan Al-Reza<sup>asws</sup> said, ‘There flowed a discussion about Ja’far Bin Ali and he was condemned, so I said to him, ‘But there isn’t anyone apart from him, so have you seen him<sup>asws</sup>?’ So he said, ‘I have not seen him<sup>asws</sup>, but somebody else has seen him<sup>asws</sup>’. I said, ‘And who has seen him<sup>asws</sup>, ‘He said, ‘Ja’far has seen him twice and for him there is a Hadeeth’."
          ],
          "en.sarwar": [
            " 9. Ali has narrated from abu ‘Abdallah ibn Salih and Ahmad ibn al-Nadr from al-Qanbari, one of the descendants of Qanbar al-Kabir (great), the slave of abuu al-Hassan al-Rida (a.s.) who has said the following. “Once Ja‘far ibn Ali was mentioned and he reproached him. I said to him, “Well, there is no one (in his family) besides him. Have you seen him?” He said, “I have not seen him (the twelfth Imam) but other people have seen him.” I then asked, “Who has seen him?” He said, “Ja‘far has seen him twice and he has quite a story about it to tell.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 873,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/935",
              "text": "أَبِي مُحَمَّدٍ الْوَجْنَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَبِي مُحَمَّدٍ الْوَجْنَانِيِّ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:10",
        "text": [
          "هُ أَخْبَرَنِي عَمَّنْ رَآهُ أَنَّهُ خَرَجَ مِنَ الدَّارِ قَبْلَ الْحَادِثِ بِعَشَرَةِ أَيَّامٍ وَ هُوَ يَقُولُ اللَّهُمَّ إِنَّكَ تَعْلَمُ أَنَّهَا مِنْ أَحَبِّ الْبِقَاعِ لَوْ لَا الطَّرْدُ أَوْ كَلَامٌ هَذَا نَحْوُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, ",
            "(It has been narrated) from Abu Muhammad Al-Wajnany who informed me about the one who saw him<sup>asws</sup> that he<sup>asws</sup> came out from the house before the occurrence (of the death of his<sup>asws</sup> father<sup>asws</sup>) by ten days, and he<sup>asws</sup> was saying: ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> Know that it is from the most beloved of the spots had I<sup>asws</sup> not been expelled’, or words approximate to this’."
          ],
          "en.sarwar": [
            " 10. Ali ibn Muhammad has narrated from abu Muhammad al-Wajnani who has said the following. “He narrated to me from a person who had seen him (The Imam (a.s) in the words below. ‘He (the twelfth Imam) came out the house ten days before his father would leave this world and said, “O Lord, You know that this is the most lovely place to me, had there been no expulsion.” Or that he spoke a similar expression.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول أيض ا   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/14)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 874,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/936",
              "text": "عَلِيِّ بْنِ قَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/937",
              "text": "بَعْضِ جَلَاوِزَةِ السَّوَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ قَيْسٍ عَنْ بَعْضِ جَلَاوِزَةِ السَّوَادِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:11",
        "text": [
          " شَاهَدْتُ سِيمَاءَ آنِفاً بِسُرَّ مَنْ رَأَى وَ قَدْ كَسَرَ بَابَ الدَّارِ فَخَرَجَ عَلَيْهِ وَ بِيَدِهِ طَبَرْزِينٌ فَقَالَ لَهُ مَا تَصْنَعُ فِي دَارِي فَقَالَ سِيمَاءُ إِنَّ جَعْفَراً زَعَمَ أَنَّ أَبَاكَ مَضَى وَ لَا وَلَدَ لَهُ فَإِنْ كَانَتْ دَارَكَ فَقَدِ انْصَرَفْتُ عَنْكَ فَخَرَجَ عَنِ الدَّارِ ",
          "قَالَ عَلِيُّ بْنُ قَيْسٍ فَخَرَجَ عَلَيْنَا خَادِمٌ مِنْ خَدَمِ الدَّارِ فَسَأَلْتُهُ عَنْ هَذَا الْخَبَرِ فَقَالَ لِي مَنْ حَدَّثَكَ بِهَذَا فَقُلْتُ لَهُ حَدَّثَنِي بَعْضُ جَلَاوِزَةِ السَّوَادِ فَقَالَ لِي لَا يَكَادُ يَخْفَى عَلَى النَّاسِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ali Bin Qays, from one of the black henchman who said, ",
            "‘I saw Sayma’a only a while ago in ‘<span class=\"iTxt\">Sur Man Rayy’</span> and he had broken the door of the house. So he<sup>asws</sup> came out to him and in his<sup>asws</sup> hand was an axe, and he<sup>asws</sup> said to him: ‘What are you doing in my<sup>asws</sup> house?’ So Syema’a said, ‘Ja’far claimed that your<sup>asws</sup> father<sup>asws</sup> passed away and there was no son<sup>asws</sup> for him<sup>asws</sup>. So, if it was your<sup>asws</sup> house, I shall leave from you<sup>asws</sup>’. And he exited from the house. ",
            "Ali Bin Qays said, ‘So a servant from the servants of the house came out to us, and we asked him about this news. So he said to me, ‘Who narrated to you with this?’ So I said to him, ‘One of the black henchmen narrated to me’. So he said to me, ‘It is almost impossible to conceal anything from the people’."
          ],
          "en.sarwar": [
            " 11. Ali ibn Muhammad has narrated from Ali ibn Qays from one of the security men jalawiza, plural of jilwaz, from the (al-Sawad) rural area of Iraq who has said the following. “I saw Sima’(a man) soon after the death of abu Muhammad (a.s) in Surra man ra’a (a city in Iraq) who had just broken the door (of the tenth Imam (a.s.). He (the twelfth Imam) came out to him with an ax in his hand and said, “What are you doing to my house?” Sima said, “Ja‘far thinks that your father has passed away with leaving any son behind. If it is your house, I then get out.” He went out of the house. Ali ibn al-Qays has said, “A servant of the servants of the house came out to us and I asked about this new. He asked me, “Who has told you a such thing.?” I said, “A security man of rural area has told me.” He then said, “Almost nothing remains hidden from people.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/14)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 875,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/740",
              "text": "جَعْفَرِ بْنِ مُحَمَّدٍ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/914",
              "text": "جَعْفَرِ بْنِ مُحَمَّدٍ الْمَكْفُوفِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/915",
              "text": "عَمْرٍو الْأَهْوَازِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْكُوفِيِّ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْمَكْفُوفِ عَنْ عَمْرٍو الْأَهْوَازِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:12",
        "text": [
          " أَرَانِيهِ أَبُو مُحَمَّدٍ ( عليه السلام ) وَ قَالَ هَذَا صَاحِبُكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ja’far Bin Muhammad Al Kufy, from Ja’far Bin Muhammad Al Makfouf, from Amro Al Ahwazy who said, ",
            "‘Abu Muhammad<sup>asws</sup> (11<sup>th</sup> Imam<sup>asws</sup>) showed him<sup>asws</sup> to me and said: ‘This is your Master<sup>asws</sup>’’."
          ],
          "en.sarwar": [
            " 12. Ali ibn Muhammad has narrated from Ja‘far ibn Muhammad al-Kufi from Ja‘far ibn Muhammad al-Makfuf from ‘Amr al-Ahwazi who has said the following. “Abu Muhammad (a.s.) showed him (the twelfth Imam (a.s.) to me and said, “This will be your master (Leader with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 876,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/938",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ النَّيْسَابُورِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/939",
              "text": "إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مُوسَى بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/940",
              "text": "أَبِي نَصْرٍ ظَرِيفٍ الْخَادِمِ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ النَّيْسَابُورِيِّ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مُوسَى بْنِ جَعْفَرٍ عَنْ أَبِي نَصْرٍ ظَرِيفٍ الْخَادِمِ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:13",
        "text": [
          "هُ رَآهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Al Hassan Bin Al Al Neyshapouri, from Ibrahim Bin Muhammad Bin Abdullah Bin Musa Bin Ja’far, ",
            "(It has been narrated) from Abu Nasr Zareyf, the servant that he had seen him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 13. Muhammad ibn Yahya has narrated from al-Hassan ibn Ali al-Naysaburi from Ibrahim ibn Muhammad ibn ‘Abdallah ibn Musa ibn Ja’far from abu Nasr Zarif, the servant (of abu Muhammad (a.s.) who has said that he saw him (the twelfth Imam (a.s.) ."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/15)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 877,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/288",
              "text": "مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/941",
              "text": "الْحَسَنِ ابْنَيْ عَلِيِّ بْنِ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدٍ وَ الْحَسَنِ ابْنَيْ عَلِيِّ بْنِ إِبْرَاهِيمَ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:14",
        "text": [
          "هُمَا حَدَّثَاهُ فِي سَنَةِ تِسْعٍ وَ سَبْعِينَ وَ مِائَتَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الْعَبْدِيِّ عَنْ ضَوْءِ بْنِ عَلِيٍّ الْعِجْلِيِّ عَنْ رَجُلٍ مِنْ أَهْلِ فَارِسَ سَمَّاهُ أَنَّ أَبَا مُحَمَّدٍ أَرَاهُ إِيَّاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad and Al Hassan the two sons of Ali Bin Ibrahim, that they had both been narrated to in the year two hundred and ninety three, from Muhammad Bin Abdul Rahman Al Abady, from Zou Bin Ali Al Ijaly, ",
            "(It has been narrated) from a man from the people of Persia whom he named that Abu Muhammad<sup>asws</sup> had shown him<sup>asws</sup> to him’."
          ],
          "en.sarwar": [
            " 14. Ali ibn Muhammad has narrated from Muhammad and al-Hassan, two sons of Ali ibn Ibrahim narrated to him in the year two hundred seventy nine from Muhammad ibn ‘Abd al-Rahman al-‘Abdi from Daw’ ibn Ali al-‘Ijli from a man from the people of Fars whose name he mentioned has that abu Muhammad (a.s.) him (the twelfth Imam (a.s.) ) to him."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 878,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/942",
              "text": "أَبِي أَحْمَدَ بْنِ رَاشِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/943",
              "text": "بَعْضِ أَهْلِ الْمَدَائِنِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَبِي أَحْمَدَ بْنِ رَاشِدٍ عَنْ بَعْضِ أَهْلِ الْمَدَائِنِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:77:15",
        "text": [
          " كُنْتُ حَاجّاً مَعَ رَفِيقٍ لِي فَوَافَيْنَا إِلَى الْمَوْقِفِ فَإِذَا شَابٌّ قَاعِدٌ عَلَيْهِ إِزَارٌ وَ رِدَاءٌ وَ فِي رِجْلَيْهِ نَعْلٌ صَفْرَاءُ قَوَّمْتُ الْإِزَارَ وَ الرِّدَاءَ بِمِائَةٍ وَ خَمْسِينَ دِينَاراً وَ لَيْسَ عَلَيْهِ أَثَرُ السَّفَرِ فَدَنَا مِنَّا سَائِلٌ فَرَدَدْنَاهُ فَدَنَا مِنَ الشَّابِّ فَسَأَلَهُ فَحَمَلَ شَيْئاً مِنَ الْأَرْضِ وَ نَاوَلَهُ فَدَعَا لَهُ السَّائِلُ وَ اجْتَهَدَ فِي الدُّعَاءِ وَ أَطَالَ ",
          "فَقَامَ الشَّابُّ وَ غَابَ عَنَّا فَدَنَوْنَا مِنَ السَّائِلِ فَقُلْنَا لَهُ وَيْحَكَ مَا أَعْطَاكَ فَأَرَانَا حَصَاةَ ذَهَبٍ مُضَرَّسَةً قَدَّرْنَاهَا عِشْرِينَ مِثْقَالًا فَقُلْتُ لِصَاحِبِي مَوْلَانَا عِنْدَنَا وَ نَحْنُ لَا نَدْرِي ثُمَّ ذَهَبْنَا فِي طَلَبِهِ فَدُرْنَا الْمَوْقِفَ كُلَّهُ فَلَمْ نَقْدِرْ عَلَيْهِ فَسَأَلْنَا كُلَّ مَنْ كَانَ حَوْلَهُ مِنْ أَهْلِ مَكَّةَ وَ الْمَدِينَةِ فَقَالُوا شَابٌّ عَلَوِيٌّ يَحُجُّ فِي كُلِّ سَنَةٍ مَاشِياً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abu Ahmad Bin Rashid, from one of the people of Al Mada’in who said, ",
            "‘I was a Pilgrim (of Hajj) along with a friend of mine. So we reached to the Pausing Station (Arafat), and there was a youth seated, and upon him was a trouser and a robe, and in his feet there were yellow slippers. We evaluated the trouser and the robe to be worth two hundred and fifty Dinars, and there weren’t any effects of the journey upon him. So a beggar approached us, but we repelled him. So he went near to the youth and begged from him. So he picked up something from the ground, and gave it to him. So the beggar supplicated for him and strived in the supplication and prolonged it. ",
            "So the youth arose and disappeared (went away) from us. So we both approached the beggar and we said to him, ‘Woe be unto you! What did he give you?’ So he showed us pebbles of gold which were marked. We estimated these two to be twenty <span class=\"iTxt\">Misqal</span> (unit of weight). So I said to my companion, ‘Our Master<sup>asws</sup> is in our presence and we do not know!’ Then we went to seek him<sup>asws</sup>, and we circled around the whole of the Pausing Station (Arafat), but we were not able upon it. So we asked everyone who was around him<sup>asws</sup>, from the people of Makkah and Al-Medina, so they (all) said: ‘He is an Alawite youth who performs Hajj during every year, walking’."
          ],
          "en.sarwar": [
            " 15. Ali ibn Muhammad has narrated from abu Ahmad ibn Rashid from one of the people of al-Mada’in who has said the following. “I and a friend of mine were in Makka to perform Hajj. When we arrived in ‘Arafat (a famous place) we found a young man sitting on the ground. He had a piece of clothe on him for the lower part of the body called ’Izar and another piece for the upper part of the body called Rida’ wearing on his feet a yellow footwear. I estimated the ’Izar and Rida’ for about a hundred and fifty Dinars. No sign of journey was visible on him. A beggar approached us and we turned him down. He then approached the young man and asked him for help. He picked up something from the ground and gave it to him. The beggar prayed for him. He assiduously prayed and prolonged it. The young man stood up and disappeared from our eyes. We went closer to the beggar and said, “Fie up on you! What did he gave you?” He showed us pebbles of gold with marks on them. We estimated them to value about twenty Mithqal (a certain unit of weight). I then said to my companion, “Our master was with us and we did not know.” We then went to searched him in the whole of station but we could not find him. We then asked every one around the area where we had seen him earlier, of the people of Makka and Madina and they said, “He is a ‘Alawi (descendent of Ali (a.s.) young man and he performs Hajj every year on foot.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:77",
  "kind": "verse_list"
}