{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 79"}, "path": "/books/al-kafi:1:4:79", "titles": {"ar": "باب نَادِرٌ فِي حَالِ الْغَيْبَةِ", "en": "Chapter 79 – Miscellaneous regarding the state of the Occultation"}}], "index": 137, "local_index": 79, "part_type": "Chapter", "path": "/books/al-kafi:1:4:79", "titles": {"ar": "باب نَادِرٌ فِي حَالِ الْغَيْبَةِ", "en": "Chapter 79 – Miscellaneous regarding the state of the Occultation"}, "verse_count": 3, "verse_start_index": 882, "verses": [{"index": 883, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:79:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَمَّنْ حَدَّثَهُ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَقْرَبُ مَا يَكُونُ الْعِبَادُ مِنَ اللَّهِ جَلَّ ذِكْرُهُ وَ أَرْضَى مَا يَكُونُ عَنْهُمْ إِذَا افْتَقَدُوا حُجَّةَ اللَّهِ جَلَّ وَ عَزَّ وَ لَمْ يَظْهَرْ لَهُمْ وَ لَمْ يَعْلَمُوا مَكَانَهُ وَ هُمْ فِي ذَلِكَ يَعْلَمُونَ أَنَّهُ لَمْ تَبْطُلْ حُجَّةُ اللَّهِ جَلَّ ذِكْرُهُ وَ لَا مِيثَاقُهُ فَعِنْدَهَا فَتَوَقَّعُوا الْفَرَجَ صَبَاحاً وَ مَسَاءً\nفَإِنَّ أَشَدَّ مَا يَكُونُ غَضَبُ اللَّهِ عَلَى أَعْدَائِهِ إِذَا افْتَقَدُوا حُجَّتَهُ وَ لَمْ يَظْهَرْ لَهُمْ وَ قَدْ عَلِمَ أَنَّ أَوْلِيَاءَهُ لَا يَرْتَابُونَ وَ لَوْ عَلِمَ أَنَّهُمْ يَرْتَابُونَ مَا غَيَّبَ حُجَّتَهُ عَنْهُمْ طَرْفَةَ عَيْنٍ وَ لَا يَكُونُ ذَلِكَ إِلَّا عَلَى رَأْسِ شِرَارِ النَّاسِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Muhammad Bin Khalid, from the one who narrated it, from Al Mufazzal Bin Umar and Muhammad Bin Yahya, from Abdullah Bin Muhammad Bin Isa, from his father, from one of his companions, from Al Mufazzal Bin Umar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The closest of what the servants can be to Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention, and the Happiest what He<sup>azwj</sup> can be from them is when they would be missing the Divine Authority of Allah<sup>azwj</sup> Majestic and Mighty and he<sup>asws</sup> would not be apparent to them and they would not be knowing his<sup>asws</sup> place, and they, during that, would be knowing that it neither invalidates the Divine Authority of Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention, nor His<sup>azwj</sup> Covenant. Thus, during that, they would be anticipating the relief morning and evening. \nSo the most intensely Wrathful what Allah<sup>azwj</sup> can be upon His<sup>azwj</sup> enemies is when they are missing His<sup>azwj</sup> Divine Authority and he<sup>asws</sup> is not apparent to them, and He<sup>azwj</sup> has Known that His<sup>azwj</sup> friends would not be suspicious, and had He<sup>azwj</sup> Known that they would be suspicious, He<sup>azwj</sup> would not have Caused His<sup>azwj</sup> Divine Authority to be absent from them for the blink of an eye, and that (Wrath) does not happen to be except upon the heads of the most evil of the people’."}]}, {"index": 884, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:79:2", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مِرْدَاسٍ عَنْ صَفْوَانَ بْنِ يَحْيَى وَ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ عَمَّارٍ السَّابَاطِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَيُّمَا أَفْضَلُ الْعِبَادَةُ فِي السِّرِّ مَعَ الْإِمَامِ مِنْكُمُ الْمُسْتَتِرِ فِي دَوْلَةِ الْبَاطِلِ أَوِ الْعِبَادَةُ فِي ظُهُورِ الْحَقِّ وَ دَوْلَتِهِ مَعَ الْإِمَامِ مِنْكُمُ الظَّاهِرِ\nفَقَالَ يَا عَمَّارُ الصَّدَقَةُ فِي السِّرِّ وَ اللَّهِ أَفْضَلُ مِنَ الصَّدَقَةِ فِي الْعَلَانِيَةِ وَ كَذَلِكَ وَ اللَّهِ عِبَادَتُكُمْ فِي السِّرِّ مَعَ إِمَامِكُمُ الْمُسْتَتِرِ فِي دَوْلَةِ الْبَاطِلِ وَ تَخَوُّفُكُمْ مِنْ عَدُوِّكُمْ فِي دَوْلَةِ الْبَاطِلِ وَ حَالِ الْهُدْنَةِ أَفْضَلُ مِمَّنْ يَعْبُدُ اللَّهَ عَزَّ وَ جَلَّ ذِكْرُهُ فِي ظُهُورِ الْحَقِّ مَعَ إِمَامِ الْحَقِّ الظَّاهِرِ فِي دَوْلَةِ الْحَقِّ وَ لَيْسَتِ الْعِبَادَةُ مَعَ الْخَوْفِ فِي دَوْلَةِ الْبَاطِلِ مِثْلَ الْعِبَادَةِ وَ الْأَمْنِ فِي دَوْلَةِ الْحَقِّ\nوَ اعْلَمُوا أَنَّ مَنْ صَلَّى مِنْكُمُ الْيَوْمَ صَلَاةً فَرِيضَةً فِي جَمَاعَةٍ مُسْتَتِرٍ بِهَا مِنْ عَدُوِّهِ فِي وَقْتِهَا فَأَتَمَّهَا كَتَبَ اللَّهُ لَهُ خَمْسِينَ صَلَاةً فَرِيضَةً فِي جَمَاعَةٍ وَ مَنْ صَلَّى مِنْكُمْ صَلَاةً فَرِيضَةً وَحْدَهُ مُسْتَتِراً بِهَا مِنْ عَدُوِّهِ فِي وَقْتِهَا فَأَتَمَّهَا كَتَبَ اللَّهُ عَزَّ وَ جَلَّ بِهَا لَهُ خَمْساً وَ عِشْرِينَ صَلَاةً فَرِيضَةً وَحْدَانِيَّةً\nوَ مَنْ صَلَّى مِنْكُمْ صَلَاةً نَافِلَةً لِوَقْتِهَا فَأَتَمَّهَا كَتَبَ اللَّهُ لَهُ بِهَا عَشْرَ صَلَوَاتٍ نَوَافِلَ وَ مَنْ عَمِلَ مِنْكُمْ حَسَنَةً كَتَبَ اللَّهُ عَزَّ وَ جَلَّ لَهُ بِهَا عِشْرِينَ حَسَنَةً وَ يُضَاعِفُ اللَّهُ عَزَّ وَ جَلَّ حَسَنَاتِ الْمُؤْمِنِ مِنْكُمْ إِذَا أَحْسَنَ أَعْمَالَهُ وَ دَانَ بِالتَّقِيَّةِ عَلَى دِينِهِ وَ إِمَامِهِ وَ نَفْسِهِ وَ أَمْسَكَ مِنْ لِسَانِهِ أَضْعَافاً مُضَاعَفَةً إِنَّ اللَّهَ عَزَّ وَ جَلَّ كَرِيمٌ\nقُلْتُ جُعِلْتُ فِدَاكَ قَدْ وَ اللَّهِ رَغَّبْتَنِي فِي الْعَمَلِ وَ حَثَثْتَنِي عَلَيْهِ وَ لَكِنْ أُحِبُّ أَنْ أَعْلَمَ كَيْفَ صِرْنَا نَحْنُ الْيَوْمَ أَفْضَلَ أَعْمَالًا مِنْ أَصْحَابِ الْإِمَامِ الظَّاهِرِ مِنْكُمْ فِي دَوْلَةِ الْحَقِّ وَ نَحْنُ عَلَى دِينٍ وَاحِدٍ\nفَقَالَ إِنَّكُمْ سَبَقْتُمُوهُمْ إِلَى الدُّخُولِ فِي دِينِ اللَّهِ عَزَّ وَ جَلَّ وَ إِلَى الصَّلَاةِ وَ الصَّوْمِ وَ الْحَجِّ وَ إِلَى كُلِّ خَيْرٍ وَ فِقْهٍ وَ إِلَى عِبَادَةِ اللَّهِ عَزَّ ذِكْرُهُ سِرّاً مِنْ عَدُوِّكُمْ مَعَ إِمَامِكُمُ الْمُسْتَتِرِ مُطِيعِينَ لَهُ صَابِرِينَ مَعَهُ مُنْتَظِرِينَ لِدَوْلَةِ الْحَقِّ خَائِفِينَ عَلَى إِمَامِكُمْ وَ أَنْفُسِكُمْ مِنَ الْمُلُوكِ الظَّلَمَةِ\nتَنْتَظِرُونَ إِلَى حَقِّ إِمَامِكُمْ وَ حُقُوقِكُمْ فِي أَيْدِي الظَّلَمَةِ قَدْ مَنَعُوكُمْ ذَلِكَ وَ اضْطَرُّوكُمْ إِلَى حَرْثِ الدُّنْيَا وَ طَلَبِ الْمَعَاشِ مَعَ الصَّبْرِ عَلَى دِينِكُمْ وَ عِبَادَتِكُمْ وَ طَاعَةِ إِمَامِكُمْ وَ الْخَوْفِ مَعَ عَدُوِّكُمْ فَبِذَلِكَ ضَاعَفَ اللَّهُ عَزَّ وَ جَلَّ لَكُمُ الْأَعْمَالَ فَهَنِيئاً لَكُمْ\nقُلْتُ جُعِلْتُ فِدَاكَ فَمَا تَرَى إِذاً أَنْ نَكُونَ مِنْ أَصْحَابِ الْقَائِمِ وَ يَظْهَرَ الْحَقُّ وَ نَحْنُ الْيَوْمَ فِي إِمَامَتِكَ وَ طَاعَتِكَ أَفْضَلُ أَعْمَالًا مِنْ أَصْحَابِ دَوْلَةِ الْحَقِّ وَ الْعَدْلِ\nفَقَالَ سُبْحَانَ اللَّهِ أَ مَا تُحِبُّونَ أَنْ يُظْهِرَ اللَّهُ تَبَارَكَ وَ تَعَالَى الْحَقَّ وَ الْعَدْلَ فِي الْبِلَادِ وَ يَجْمَعَ اللَّهُ الْكَلِمَةَ وَ يُؤَلِّفَ اللَّهُ بَيْنَ قُلُوبٍ مُخْتَلِفَةٍ وَ لَا يَعْصُونَ اللَّهَ عَزَّ وَ جَلَّ فِي أَرْضِهِ وَ تُقَامَ حُدُودُهُ فِي خَلْقِهِ وَ يَرُدَّ اللَّهُ الْحَقَّ إِلَى أَهْلِهِ فَيَظْهَرَ حَتَّى لَا يُسْتَخْفَى بِشَيْ‏ءٍ مِنَ الْحَقِّ مَخَافَةَ أَحَدٍ مِنَ الْخَلْقِ\nأَمَا وَ اللَّهِ يَا عَمَّارُ لَا يَمُوتُ مِنْكُمْ مَيِّتٌ عَلَى الْحَالِ الَّتِي أَنْتُمْ عَلَيْهَا إِلَّا كَانَ أَفْضَلَ عِنْدَ اللَّهِ مِنْ كَثِيرٍ مِنْ شُهَدَاءِ بَدْرٍ وَ أُحُدٍ فَأَبْشِرُوا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Ali Bin Mirdas, from Safwan Bin Yahya and Al Hassan Bin Mahboub, from Hisham Bin Salim, from Ammar Al Sabaty who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘Which is more superior, the worship (performed) in secret along with the Imam<sup>asws</sup> from you all (Imams<sup>asws</sup>) covertly in the government of the falsehood, or the worship (performed) during the appearance of the Truth and its government along with the Imam<sup>asws</sup> from you all (Imams<sup>asws</sup>) overtly?’ \nSo he<sup>asws</sup> said: ‘O Ammar! The charity (donated) in the secret, by Allah<sup>azwj</sup>, is superior than the charity (donated) publicly, and similar to that, by Allah<sup>azwj</sup>, is your worship in the secret along with your Imam<sup>asws</sup>, performed covertly in the government of the falsehood, and your fearing from your enemies in the government of the falsehood, and the state of truce, is more superior than the one who worships Allah<sup>azwj</sup> Mighty and Majestic, and his <span class=\"iTxt\">Zikr</span> (Remembrance) during the appearance of the Truth along with the Imam<sup>asws</sup> of the Truth openly in the government of the Truth. And it isn’t so that the worship with the fear in the government of the falsehood is similar to the worship with the security in the government of the Truth.\nAnd Know that the one from you who prays <span class=\"iTxt\">Salat</span> today, the Obligatory <span class=\"iTxt\">Salat</span> in a congregation during its (Prescribed) timings, concealing by it from his enemies, so he completes this, Allah<sup>azwj</sup> would Write for him fifty Obligatory <span class=\"iTxt\">Salat</span>s in a congregation. And the one from you who prays the Obligatory <span class=\"iTxt\">Salat</span> alone during its (Prescribed) timings, concealing by it from his enemies, so he completes these, Allah<sup>azwj</sup> Mighty and Majestic would Write for him due to it, twenty five Obligatory <span class=\"iTxt\">Salat</span>s performed alone. \nAnd the one from you who prays the Optional <span class=\"iTxt\">Salat</span> to its timings, Allah<sup>asws</sup> would Write ten Optional <span class=\"iTxt\">Salat</span>s for him due to it; and the one from you who performed a good deed, Allah<sup>azwj</sup> Mighty and Majestic would Write for him, twenty Good deeds due to it. And Allah<sup>azwj</sup> Multiplies the good deeds of the Momin from you when he performs a good deed and makes a Religion with the dissimulation upon his Religion, and his Imam<sup>asws</sup>, and himself, and withholds his tongue, Multiplying it exponentially. Surely, Allah<sup>azwj</sup> Mighty and Majestic is Benevolent’. \nI said, ‘May I be sacrificed for you<sup>asws</sup>! By Allah<sup>azwj</sup>! You<sup>asws</sup> have made me desirous regarding the performance of the deeds and encouraged me upon it, but I would love to know how, today, we can come to be of more superior deeds than the companions of the Imam<sup>asws</sup>, the apparent one from you<sup>asws</sup> in the government of the Truth, and we are (all) upon one Religion’. \nSo he<sup>asws</sup> said: ‘You all are preceding them to the entry into the Religion of Allah<sup>azwj</sup> Mighty and Majestic and to the <span class=\"iTxt\">Salat</span>, and the Soam (Fast), and the Hajj, and to every goodness, and understanding, and to the worship of Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention secretly from your enemies along with your Imam<sup>asws</sup>, the concealed, being obedient to him<sup>asws</sup>, observing patience with him<sup>asws</sup>, awaiting the government of the Truth, being fearful upon your Imam<sup>asws</sup> and yourselves from the unjust kings. \nYou are awaiting to the rights of your Imams<sup>asws</sup> and their rights are in the hands of the oppressors who have prevent that from them<sup>asws</sup>, compelling you all to covet the world and you are seeking the livelihood with the patience upon your Religion, and your (acts of) worship, and obedience to your Imam<sup>asws</sup>, and the fear from your enemies. So, due to that, Allah<sup>azwj</sup> Mighty and Majestic would Multiply the deeds for you all. Therefore, congratulations be to you all!’. \nI said, ‘May I be sacrificed for you<sup>asws</sup>! So what is your<sup>asws</sup> view, when, if we were to become from the companions of Al-Qaim<sup>asws</sup> and the Truth is manifested, and today we are in your<sup>asws</sup> Imamate and your<sup>asws</sup> obedience, are our deeds superior than the companions of the government of the Truth and the justice?’ \nSo he<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! Are you not loving that Allah<sup>azwj</sup> Blessed and High should Manifest the Truth and the justice in the country, and Allah<sup>azwj</sup> should Gather the ideologies, and Allah<sup>azwj</sup> Joins between the differing hearts and no one would be disobeying Allah<sup>azwj</sup> Mighty and Majestic in His<sup>azwj</sup> earth, and His<sup>azwj</sup> Legal Punishments be established among His<sup>azwj</sup> creatures, and Allah<sup>azwj</sup> should Return the Truth to its people, so it overcome until nothing from the Truth would be concealed out of fear of anyone from the creatures?.\nBut, by Allah<sup>azwj</sup>, O Ammar! A dying one from you all is not dying upon the state which you are upon except that he would be superior in the Presence of Allah<sup>azwj</sup> than most of the martyrs of Badr and Ohad. Therefore receive glad tidings!’."}]}, {"index": 885, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:79:3", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أُسَامَةَ عَنْ هِشَامٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي إِسْحَاقَ قَالَ حَدَّثَنِي الثِّقَةُ مِنْ أَصْحَابِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) أَنَّهُمْ سَمِعُوا أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ فِي خُطْبَةٍ لَهُ اللَّهُمَّ وَ إِنِّي لَأَعْلَمُ أَنَّ الْعِلْمَ لَا يَأْرِزُ كُلُّهُ وَ لَا يَنْقَطِعُ مَوَادُّهُ وَ أَنَّكَ لَا تُخْلِي أَرْضَكَ مِنْ حُجَّةٍ لَكَ عَلَى خَلْقِكَ ظَاهِرٍ لَيْسَ بِالْمُطَاعِ أَوْ خَائِفٍ مَغْمُورٍ كَيْلَا تَبْطُلَ حُجَجُكَ وَ لَا يَضِلَّ أَوْلِيَاؤُكَ بَعْدَ إِذْ هَدَيْتَهُمْ بَلْ أَيْنَ هُمْ وَ كَمْ أُولَئِكَ الْأَقَلُّونَ عَدَداً وَ الْأَعْظَمُونَ عِنْدَ اللَّهِ جَلَّ ذِكْرُهُ قَدْراً\nالْمُتَّبِعُونَ لِقَادَةِ الدِّينِ الْأَئِمَّةِ الْهَادِينَ الَّذِينَ يَتَأَدَّبُونَ بِآدَابِهِمْ وَ يَنْهَجُونَ نَهْجَهُمْ فَعِنْدَ ذَلِكَ يَهْجُمُ بِهِمُ الْعِلْمُ عَلَى حَقِيقَةِ الْإِيمَانِ فَتَسْتَجِيبُ أَرْوَاحُهُمْ لِقَادَةِ الْعِلْمِ وَ يَسْتَلِينُونَ مِنْ حَدِيثِهِمْ مَا اسْتَوْعَرَ عَلَى غَيْرِهِمْ وَ يَأْنَسُونَ بِمَا اسْتَوْحَشَ مِنْهُ الْمُكَذِّبُونَ وَ أَبَاهُ الْمُسْرِفُونَ\nأُولَئِكَ أَتْبَاعُ الْعُلَمَاءِ صَحِبُوا أَهْلَ الدُّنْيَا بِطَاعَةِ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ أَوْلِيَائِهِ وَ دَانُوا بِالتَّقِيَّةِ عَنْ دِينِهِمْ وَ الْخَوْفِ مِنْ عَدُوِّهِمْ فَأَرْوَاحُهُمْ مُعَلَّقَةٌ بِالْمَحَلِّ الْأَعْلَى فَعُلَمَاؤُهُمْ وَ أَتْبَاعُهُمْ خُرْسٌ صُمْتٌ فِي دَوْلَةِ الْبَاطِلِ مُنْتَظِرُونَ لِدَوْلَةِ الْحَقِّ وَ سَيُحِقُّ اللَّهُ الْحَقَّ بِكَلِمَاتِهِ وَ يَمْحَقُ الْبَاطِلَ\nهَا هَا طُوبَى لَهُمْ عَلَى صَبْرِهِمْ عَلَى دِينِهِمْ فِي حَالِ هُدْنَتِهِمْ وَ يَا شَوْقَاهْ إِلَى رُؤْيَتِهِمْ فِي حَالِ ظُهُورِ دَوْلَتِهِمْ وَ سَيَجْمَعُنَا اللَّهُ وَ إِيَّاهُمْ فِي جَنَّاتِ عَدْنٍ وَ مَنْ صَلَحَ مِنْ آبَائِهِمْ وَ أَزْوَاجِهِمْ وَ ذُرِّيَّاتِهِمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhgammad, from Sahl Bin Ziyad, from Ibn Mahboub, from Abu Asama, from Hisham and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Hisham bin Salim, from Abu Hamza, from Abu Is’haq who said, \n‘It was narrated to me by the reliable ones of the companions of Amir Al-Momineen<sup>asws</sup> that they heard Amir Al-Momineen<sup>asws</sup> saying in a sermon of his<sup>asws</sup>: ‘O Allah<sup>azwj</sup>! And I<sup>asws</sup> know that the knowledge, all of it cannot be erased, nor would its items be cut off, and You<sup>asws</sup> do not Leave your<sup>asws</sup> earth empty from a Divine Authority of Yours<sup>azwj</sup> to be upon Your<sup>azwj</sup> creatures, who is apparent but isn’t with the obedience, or is fearful, obscure, nor do You<sup>azwj</sup> Let Your<sup>azwj</sup> friends to stray after having Guided them. But, where are they? And how many are Your<sup>azwj</sup> friends? They are few in numbers and are of great worth in the Presence of Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention.\n(They are) the followers of the leaders of the Religion, the Imams<sup>asws</sup>, the Guides who are educating them with their<sup>asws</sup> education are programming them upon their<sup>asws</sup> program. Thus, during that, the knowledge leads with them upon the realities of the <span class=\"iTxt\">Eman</span>, and their souls answer to the leadership of the knowledge and they are finding it easy from the Ahadeed what is difficult upon others, and they are being comforted with what the beliers are terrified upon and the extravagant are indifferent of.  \nThey are the followers of the knowledgeable ones<sup>asws</sup>, accompanying the people of the word in obedience to Allah<sup>azwj</sup> Blessed and High and His<sup>azwj</sup> Guardians<sup>asws</sup>, and they are making a Religion with the dissimulation about their Religion, and the fear from their enemies. So their souls are clinging with the lofty places. Their scholars<sup>asws</sup> and their<sup>asws</sup> follower are mute, silent, in the government of the falsehood, awaiting the government of the Truth, and very soon Allah<sup>azwj</sup> would Bring about the reality of the Truth by His<sup>azwj</sup> Word and Delete the falsehood.\nHaa! Haa! Beatitude is for them upon their observant of patience upon their Religion in a state of truce. And O my<sup>asws</sup> longing to see them in a state of the manifestation of their government! And Allah<sup>azwj</sup> will soon be Gathering us<sup>asws</sup> and them in the Gardens of Eden, and the righteous ones from their forefathers, and their wives, and their offspring’."}]}]}, "index": "al-kafi:1:4:79", "kind": "verse_list"}