{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 80"}, "path": "/books/al-kafi:1:4:80", "titles": {"ar": "باب فِي الْغَيْبَةِ", "en": "Chapter 80 – Regarding the Occulation"}}], "index": 138, "local_index": 80, "part_type": "Chapter", "path": "/books/al-kafi:1:4:80", "titles": {"ar": "باب فِي الْغَيْبَةِ", "en": "Chapter 80 – Regarding the Occulation"}, "verse_count": 31, "verse_start_index": 885, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 886, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> وَ الْحَسَنُ بْنُ مُحَمَّدٍ جَمِيعاً عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْكُوفِيِّ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الصَّيْرَفِيِّ عَنْ صَالِحِ بْنِ خَالِدٍ عَنْ يَمَانٍ التَّمَّارِ قَالَ كُنَّا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُلُوساً فَقَالَ لَنَا إِنَّ لِصَاحِبِ هَذَا الْأَمْرِ غَيْبَةً الْمُتَمَسِّكُ فِيهَا بِدِينِهِ كَالْخَارِطِ لِلْقَتَادِ ثُمَّ قَالَ هَكَذَا بِيَدِهِ فَأَيُّكُمْ يُمْسِكُ شَوْكَ الْقَتَادِ بِيَدِهِ ثُمَّ أَطْرَقَ مَلِيّاً ثُمَّ قَالَ إِنَّ لِصَاحِبِ هَذَا الْأَمْرِ غَيْبَةً فَلْيَتَّقِ اللَّهَ عَبْدٌ وَ لْيَتَمَسَّكْ بِدِينِهِ ."], "translations": {"en.hubeali": ["Muhammad Bin yahya and Al Hassan Bin Muhammad, altogether from Ja’far Bin Muhammad Al Kufy, from Al Hassan Bin Muhammad Al Sayrafi, from Salih Bin Khalid, from Yaman Al Tammar who said, ", "‘We were seated in the presence of Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said to us: ‘For the Master<sup>asws</sup> of this command there would be an Occultation. Being attached to his<sup>asws</sup> Religion would be like entering into the thorny bush’. Then he<sup>asws</sup> said: ‘Like this!’ – by his<sup>asws</sup> hand. So, which one of you would like to touch a branch of thorns?’ Then he<sup>asws</sup> was silent for a while, then said: ‘For the Master<sup>asws</sup> of this command there would be an Occultation, so let a servant fear Allah<sup>azwj</sup> and let him attach with his<sup>asws</sup> Religion’."]}}, {"index": 887, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:2", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عِيسَى بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا فُقِدَ الْخَامِسُ مِنْ وُلْدِ السَّابِعِ فَاللَّهَ اللَّهَ فِي أَدْيَانِكُمْ لَا يُزِيلُكُمْ عَنْهَا أَحَدٌ يَا بُنَيَّ إِنَّهُ لَا بُدَّ لِصَاحِبِ هَذَا الْأَمْرِ مِنْ غَيْبَةٍ حَتَّى يَرْجِعَ عَنْ هَذَا الْأَمْرِ مَنْ كَانَ يَقُولُ بِهِ إِنَّمَا هِيَ مِحْنَةٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ امْتَحَنَ بِهَا خَلْقَهُ لَوْ عَلِمَ آبَاؤُكُمْ وَ أَجْدَادُكُمْ دِيناً أَصَحَّ مِنْ هَذَا لَاتَّبَعُوهُ ", "قَالَ فَقُلْتُ يَا سَيِّدِي مَنِ الْخَامِسُ مِنْ وُلْدِ السَّابِعِ فَقَالَ يَا بُنَيَّ عُقُولُكُمْ تَصْغُرُ عَنْ هَذَا وَ أَحْلَامُكُمْ تَضِيقُ عَنْ حَمْلِهِ وَ لَكِنْ إِنْ تَعِيشُوا فَسَوْفَ تُدْرِكُونَهُ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Al Hassan Bin Isa Bin Muhammad Bin Ali Bin Ja’far, from his father, from his grandfather, ", "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> having said: ‘When the fifth one from the sons<sup>asws</sup> of the seventh is missing (in Occultation), so Allah<sup>azwj</sup>, Allah<sup>azwj</sup>, with regards to your Religion. Do not let anyone remove you from it, O my<sup>asws</sup> children. An Occultation is inevitable for the Master<sup>asws</sup> of this command, to the extent that he would retract from this matter, the one who used to be saying with it. But rather, it would be an ordeal from Allah<sup>azwj</sup> Mighty and Majestic to Test His<sup>azwj</sup> creatures by it. Had your fathers and your grandfathers known of a Religion more correct that this, they would have followed it’. ", "He (the narrator) said, ‘So I said, ‘O my Chief<sup style=\"font-weight: normal\">asws</sup>! Who is the fifth from the sons<sup style=\"font-weight: normal\">asws</sup> of the seventh?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘O my<sup style=\"font-weight: normal\">asws</sup> son<sup style=\"font-weight: normal\">asws</sup>! Your intellects are too little from this, and your forbearances are too narrow from bearing it, but if you live, so soon you would be realising it’."]}}, {"index": 888, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ مُحَمَّدِ بْنِ الْمُسَاوِرِ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِيَّاكُمْ وَ التَّنْوِيهَ أَمَا وَ اللَّهِ لَيَغِيبَنَّ إِمَامُكُمْ سِنِيناً مِنْ دَهْرِكُمْ وَ لَتُمَحَّصُنَّ حَتَّى يُقَالَ مَاتَ قُتِلَ هَلَكَ بِأَيِّ وَادٍ سَلَكَ وَ لَتَدْمَعَنَّ عَلَيْهِ عُيُونُ الْمُؤْمِنِينَ وَ لَتُكْفَؤُنَّ كَمَا تُكْفَأُ السُّفُنُ فِي أَمْوَاجِ الْبَحْرِ ", "فَلَا يَنْجُو إِلَّا مَنْ أَخَذَ اللَّهُ مِيثَاقَهُ وَ كَتَبَ فِي قَلْبِهِ الْإِيمَانَ وَ أَيَّدَهُ بِرُوحٍ مِنْهُ وَ لَتُرْفَعَنَّ اثْنَتَا عَشْرَةَ رَايَةً مُشْتَبِهَةً لَا يُدْرَى أَيٌّ مِنْ أَيٍّ ", "قَالَ فَبَكَيْتُ ثُمَّ قُلْتُ فَكَيْفَ نَصْنَعُ قَالَ فَنَظَرَ إِلَى شَمْسٍ دَاخِلَةٍ فِي الصُّفَّةِ فَقَالَ يَا أَبَا عَبْدِ اللَّهِ تَرَى هَذِهِ الشَّمْسَ قُلْتُ نَعَمْ فَقَالَ وَ اللَّهِ لَأَمْرُنَا أَبْيَنُ مِنْ هَذِهِ الشَّمْسِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Najran, from Muhammad Bin Al Musawir, from Al Mufazzal Bin Umar who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Beware of the allusions! But, by Allah<sup>azwj</sup>! Your Imam<sup>asws</sup> would be absent (in Occultation) for years from your time. You will be Sifted until it would be said, ‘He<sup>asws</sup> died, killed, perished, (Don’t know) by which valley he<sup>asws</sup> travelled’, and the eyes of the Momineen would shed tears upon him<sup>asws</sup>, and you would be tossed around like the tossing of the ships in the waves of the sea. ", "Thus, he would not attain salvation except the one whose Covenant Allah<sup>azwj</sup> has Taken, and Written the <span class=\"iTxt\">Eman</span> in his heart, and Aided him by a Spirit from Him<sup>azwj</sup>. And you would be separating into twelve resembling banners, not known which one is from which’. ", "He (the narrator) said, ‘So I wept, then I said, ‘So how should we deal with it?’ So he<sup>asws</sup> looked at the sunshine entering the pavilion and he<sup>asws</sup> said: ‘O Abu Abdullah! Do you see this sunshine?’ I said, ‘Yes’. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! Our<sup>asws</sup> matter would be clearer that this sunshine’."]}}, {"index": 889, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ سَدِيرٍ الصَّيْرَفِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ فِي صَاحِبِ هَذَا الْأَمْرِ شَبَهاً مِنْ يُوسُفَ ( عليه السلام ) قَالَ قُلْتُ لَهُ كَأَنَّكَ تَذْكُرُهُ حَيَاتَهُ أَوْ غَيْبَتَهُ ", "قَالَ فَقَالَ لِي وَ مَا يُنْكَرُ مِنْ ذَلِكَ هَذِهِ الْأُمَّةُ أَشْبَاهُ الْخَنَازِيرِ إِنَّ إِخْوَةَ يُوسُفَ ( عليه السلام ) كَانُوا أَسْبَاطاً أَوْلَادَ الْأَنْبِيَاءِ تَاجَرُوا يُوسُفَ وَ بَايَعُوهُ وَ خَاطَبُوهُ وَ هُمْ إِخْوَتُهُ وَ هُوَ أَخُوهُمْ فَلَمْ يَعْرِفُوهُ حَتَّى قَالَ أَنَا يُوسُفُ وَ هَذَا أَخِي فَمَا تُنْكِرُ هَذِهِ الْأُمَّةُ الْمَلْعُونَةُ أَنْ يَفْعَلَ اللَّهُ عَزَّ وَ جَلَّ بِحُجَّتِهِ فِي وَقْتٍ مِنَ الْأَوْقَاتِ كَمَا فَعَلَ بِيُوسُفَ ", "إِنَّ يُوسُفَ ( عليه السلام ) كَانَ إِلَيْهِ مُلْكُ مِصْرَ وَ كَانَ بَيْنَهُ وَ بَيْنَ وَالِدِهِ مَسِيرَةُ ثَمَانِيَةَ عَشَرَ يَوْماً فَلَوْ أَرَادَ أَنْ يُعْلِمَهُ لَقَدَرَ عَلَى ذَلِكَ لَقَدْ سَارَ يَعْقُوبُ ( عليه السلام ) وَ وُلْدُهُ عِنْدَ الْبِشَارَةِ تِسْعَةَ أَيَّامٍ مِنْ بَدْوِهِمْ إِلَى مِصْرَ ", "فَمَا تُنْكِرُ هَذِهِ الْأُمَّةُ أَنْ يَفْعَلَ اللَّهُ جَلَّ وَ عَزَّ بِحُجَّتِهِ كَمَا فَعَلَ بِيُوسُفَ أَنْ يَمْشِيَ فِي أَسْوَاقِهِمْ وَ يَطَأَ بُسُطَهُمْ حَتَّى يَأْذَنَ اللَّهُ فِي ذَلِكَ لَهُ كَمَا أَذِنَ لِيُوسُفَ قَالُوا أَ إِنَّكَ لَأَنْتَ يُوسُفُ قالَ أَنَا يُوسُفُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Al Husayn, from Ibn Abu Najran, from Fazalat Bin Ayoub, from Sadeyr Al Sayrafi who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘In the Master<sup>asws</sup> of this command, there is a resemblance from Yusuf<sup>as</sup>’. I said to him<sup>asws</sup>, ‘It is as if you<sup>asws</sup> are mentioning his<sup>asws</sup> lifetime or his<sup>asws</sup> absence (Occultation)’. ", "He (the narrator) said, ‘So he<sup>asws</sup> said to me: ‘And what can they deny from that, this community resembling the pigs. The brothers of Yusuf<sup>as</sup> were a tribe of the children of the Prophets<sup>as</sup>. They traded with Yusuf<sup>as</sup> and they sold to him<sup>as</sup> and they addressed him<sup>as</sup>, and they were his<sup>as</sup> brothers, and he<sup>as</sup> was their brother. But they did not recognise him<sup>as</sup> until he<sup>as</sup> said: ‘<span class=\"ibTxt\">[12:90] I am Yusuf and this is my brother</span>’. So what this Accursed community deny if Allah<sup>azwj</sup> Mighty and Majestic were to Deal with His<sup>azwj</sup> Divine Authority during a time from the times just as He<sup>azwj</sup> Dealt with Yusuf<sup>as</sup>?", "Surely, it was so that Yusuf<sup>as</sup> had kingship of Egypt, and there was between him<sup>as</sup> and his<sup>as</sup> father<sup>as</sup> a travel distance of eighteen days. So, had he<sup>as</sup> wanted to let him<sup>as</sup> know, he<sup>as</sup> would have been able upon that. Yaqoub<sup>as</sup> and his<sup>as</sup> children, during the receipt of good news, travelled for nine days from the Bedouin home to Egypt. ", "So what can this community deny if Allah<sup>azwj</sup> Majestic and Mighty was to Deal with His<sup>azwj</sup> Divine Authority just as He<sup>azwj</sup> Dealt with Yusuf<sup>as</sup>, if he<sup>asws</sup> was to walk in their markets and tread upon their carpets until Allah<sup>azwj</sup> Permits that for him<sup>as</sup> just as He<sup>azwj</sup> Permitted for Yusuf<sup>as</sup> <span class=\"ibTxt\">[12:90] They said: Are you indeed Yusuf? He said: I am Yusuf</span>’."]}}, {"index": 890, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْحَسَنِ بْنِ مُوسَى الْخَشَّابِ عَنْ عَبْدِ اللَّهِ بْنِ مُوسَى عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ لِلْغُلَامِ غَيْبَةً قَبْلَ أَنْ يَقُومَ قَالَ قُلْتُ وَ لِمَ قَالَ يَخَافُ وَ أَوْمَأَ بِيَدِهِ إِلَى بَطْنِهِ ", "ثُمَّ قَالَ يَا زُرَارَةُ وَ هُوَ الْمُنْتَظَرُ وَ هُوَ الَّذِي يُشَكُّ فِي وِلَادَتِهِ مِنْهُمْ مَنْ يَقُولُ مَاتَ أَبُوهُ بِلَا خَلَفٍ وَ مِنْهُمْ مَنْ يَقُولُ حَمْلٌ وَ مِنْهُمْ مَنْ يَقُولُ إِنَّهُ وُلِدَ قَبْلَ مَوْتِ أَبِيهِ بِسَنَتَيْنِ وَ هُوَ الْمُنْتَظَرُ غَيْرَ أَنَّ اللَّهَ عَزَّ وَ جَلَّ يُحِبُّ أَنْ يَمْتَحِنَ الشِّيعَةَ فَعِنْدَ ذَلِكَ يَرْتَابُ الْمُبْطِلُونَ يَا زُرَارَةُ ", "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ إِنْ أَدْرَكْتُ ذَلِكَ الزَّمَانَ أَيَّ شَيْ‏ءٍ أَعْمَلُ قَالَ يَا زُرَارَةُ إِذَا أَدْرَكْتَ هَذَا الزَّمَانَ فَادْعُ بِهَذَا الدُّعَاءِ اللَّهُمَّ عَرِّفْنِي نَفْسَكَ فَإِنَّكَ إِنْ لَمْ تُعَرِّفْنِي نَفْسَكَ لَمْ أَعْرِفْ نَبِيَّكَ اللَّهُمَّ عَرِّفْنِي رَسُولَكَ فَإِنَّكَ إِنْ لَمْ تُعَرِّفْنِي رَسُولَكَ لَمْ أَعْرِفْ حُجَّتَكَ اللَّهُمَّ عَرِّفْنِي حُجَّتَكَ فَإِنَّكَ إِنْ لَمْ تُعَرِّفْنِي حُجَّتَكَ ضَلَلْتُ عَنْ دِينِي ", "ثُمَّ قَالَ يَا زُرَارَةُ لَا بُدَّ مِنْ قَتْلِ غُلَامٍ بِالْمَدِينَةِ قُلْتُ جُعِلْتُ فِدَاكَ أَ لَيْسَ يَقْتُلُهُ جَيْشُ السُّفْيَانِيِّ قَالَ لَا وَ لَكِنْ يَقْتُلُهُ جَيْشُ آلِ بَنِي فُلَانٍ يَجِي‏ءُ حَتَّى يَدْخُلَ الْمَدِينَةَ فَيَأْخُذُ الْغُلَامَ فَيَقْتُلُهُ فَإِذَا قَتَلَهُ بَغْياً وَ عُدْوَاناً وَ ظُلْماً لَا يُمْهَلُونَ فَعِنْدَ ذَلِكَ تَوَقُّعُ الْفَرَجِ إِنْ شَاءَ اللَّهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Al Hassan Bin Musa Al Khashab, from Abdullah Bin Musa, from Abdullah Bin Bukeyr, from Zurara who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘For the boy there would be an Occultation before he<sup>asws</sup> arises’. I said, ‘And why (would that be so)?’ He<sup>asws</sup> said: ‘He<sup>asws</sup> would fear’, and he<sup>asws</sup> gestured by his<sup>asws</sup> to his<sup>asws</sup> belly. ", "Then he<sup>asws</sup> said: ‘O Zurara, and he<sup>asws</sup> is awaiting, and he<sup>asws</sup> is the one<sup>asws</sup> for whom they will doubt regarding his<sup>asws</sup> birth. From them would be one who would be saying, ‘His<sup>asws</sup> father<sup>asws</sup> died without a replacement (Imam<sup>asws</sup>)’, and from them would be one who would be saying, ‘He<sup>asws</sup> was borne (i.e. his<sup>asws</sup> mother<sup>as</sup> was expecting when his<sup>as</sup> father<sup>as</sup> passed away)’; and from them would be one who would be saying, ‘He<sup>asws</sup> was born before the death of his<sup>asws</sup> father<sup>asws</sup> by two years, and he<sup>asws</sup> is awaited, apart from that Allah<sup>azwj</sup> Mighty and Majetic Loved to Test the Shias’. Thus, during that, the false ones would be raising doubts, O Zurara!’. ", "He (the narrator) said, ‘May I be sacrificed for you<sup>asws</sup>! If I were to come across that time period, which thing should I do?’ He<sup>asws</sup> said: ‘O Zurara! If you come across this time period, so supplicate with this supplication, ‘O Allah<sup>azwj</sup>! Acquaint Yourself<sup>azwj</sup> to me, for if You<sup>azwj</sup> do not Acquaint Yourself<sup>saww</sup> to me, I will not (be able to) recognise Your<sup>azwj</sup> Prophet<sup>saww</sup>. O Allah<sup>azwj</sup>! Acquaint me with Your<sup>azwj</sup> Rasool<sup>saww</sup>, for if You<sup>azwj</sup> do not Acquaint me with Your<sup>azwj</sup> Rasool<sup>saww</sup>, I would not recognise Your<sup>azwj</sup> Divine Authority. O Allah<sup>azwj</sup>! Acquaint me with Your<sup>azwj</sup> Divine Authority, for it You<sup>azwj</sup> do not Acquaint me with Your<sup>azwj</sup> Divine Authority, I would stray from my Religion’’. ", "Then he<sup>asws</sup> said: ‘O Zurara! It is inevitable that a boy be murdered in Al-Medina’. I said, ‘May I be sacrificed for you<sup>asws</sup>! Wouldn’t he be killed by the army of Al-Sufyani?’ He<sup>asws</sup> said: ‘No, but it would be the army of the Clan of so and so which would kill him. It would come until it enters Al-Medina, so they would seize the boy. So when they kill him by transgression, and animosity, and injustice, they would not be given a respite. So, during that, anticipate the relief (Rising of Al-Qaim<sup>asws</sup>), if Allah<sup>azwj</sup> so Desires’."]}}, {"index": 891, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:6", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ عَنْ يَحْيَى بْنِ الْمُثَنَّى عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ يَفْقِدُ النَّاسُ إِمَامَهُمْ يَشْهَدُ الْمَوْسِمَ فَيَرَاهُمْ وَ لَا يَرَوْنَهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ja’far Bin Muhammad, from Is’haq Bin Muhammad, from Yahya Bin Al Musna, from Abdullah Bin Bukeyr, from Ubeyd Bin Zurara who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The people would miss their Imam<sup>asws</sup>. He<sup>asws</sup> would be attending the season (Hajj), so he<sup>asws</sup> would see them and they would not see him<sup>asws</sup>’."]}}, {"index": 892, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:7", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ خَالِدٍ قَالَ حَدَّثَنِي مُنْذِرُ بْنُ مُحَمَّدِ بْنِ قَابُوسَ عَنْ مَنْصُورِ بْنِ السِّنْدِيِّ عَنْ أَبِي دَاوُدَ الْمُسْتَرِقِّ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ مَالِكٍ الْجُهَنِيِّ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ قَالَ أَتَيْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَوَجَدْتُهُ مُتَفَكِّراً يَنْكُتُ فِي الْأَرْضِ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَا لِي أَرَاكَ مُتَفَكِّراً تَنْكُتُ فِي الْأَرْضِ أَ رَغْبَةً مِنْكَ فِيهَا ", "فَقَالَ لَا وَ اللَّهِ مَا رَغِبْتُ فِيهَا وَ لَا فِي الدُّنْيَا يَوْماً قَطُّ وَ لَكِنِّي فَكَّرْتُ فِي مَوْلُودٍ يَكُونُ مِنْ ظَهْرِي الْحَادِيَ عَشَرَ مِنْ وُلْدِي هُوَ الْمَهْدِيُّ الَّذِي يَمْلَأُ الْأَرْضَ عَدْلًا وَ قِسْطاً كَمَا مُلِئَتْ جَوْراً وَ ظُلْماً تَكُونُ لَهُ غَيْبَةٌ وَ حَيْرَةٌ يَضِلُّ فِيهَا أَقْوَامٌ وَ يَهْتَدِي فِيهَا آخَرُونَ ", "فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ وَ كَمْ تَكُونُ الْحَيْرَةُ وَ الْغَيْبَةُ قَالَ سِتَّةَ أَيَّامٍ أَوْ سِتَّةَ أَشْهُرٍ أَوْ سِتَّ سِنِينَ ", "فَقُلْتُ وَ إِنَّ هَذَا لَكَائِنٌ فَقَالَ نَعَمْ كَمَا أَنَّهُ مَخْلُوقٌ وَ أَنَّى لَكَ بِهَذَا الْأَمْرِ يَا أَصْبَغُ أُولَئِكَ خِيَارُ هَذِهِ الْأُمَّةِ مَعَ خِيَارِ أَبْرَارِ هَذِهِ الْعِتْرَةِ ", "فَقُلْتُ ثُمَّ مَا يَكُونُ بَعْدَ ذَلِكَ فَقَالَ ثُمَّ يَفْعَلُ اللَّهُ مَا يَشَاءُ فَإِنَّ لَهُ بَدَاءَاتٍ وَ إِرَادَاتٍ وَ غَايَاتٍ وَ نِهَايَاتِ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Abdullah Bin Muhammad Bin Khalid who said, ‘Munzir Bin Muhammad Bin Qabous narrated to me, from Mansour Bin Al Sindy, from Abu Dawood Al Mustariq, from Sa’alba Bin Maymoun, from Malik Al Juhny, from Al Haris Bin Al Mugheira, from Al Asbagh Bin Nubata who said, ", "‘I went over to Amir Al-Momineen<sup>asws</sup>, and I found him<sup>asws</sup> pondering, making markings in the ground. So I said, ‘O Amir Al Momineen<sup>asws</sup>! What is the matter I see you<sup>asws</sup> pondering, making markings in the ground? Is there a desire from you<sup>asws</sup> with regards to it?’ ", "So he<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>! I<sup>asws</sup> have not desired with regards to it nor regarding the world even for a day, at all! But, I<sup>asws</sup> am thinking regarding the birth. which would occur from my<sup>asws</sup> back, the eleventh from my<sup>asws</sup> sons<sup>asws</sup>. He<sup>asws</sup> is the Mahdi who would fill the earth with justice and equity just as it was filled with tyranny and injustice. An absence (Occultation) would occur for him<sup>asws</sup> and confusion wherein groups of people would stray, and others would be Guided during it’. ", "So I said, ‘O Amir Al-Momineen<sup>asws</sup>! And how much would the confusion and the Occultation happen to be?’ He<sup>asws</sup> said: ‘(It could be) six days, or six months, or six years’. ", "So I said, ‘And this would be happening?’ So he<sup>asws</sup> said: ‘Yes, just as he<sup>asws</sup> would be Created, and in what way is for you with this matter? O Asbagh! They (The Momineen of that time) would be the best of this community along with the best of the righteous ones of this family<sup>asws</sup>’. ", "So I said, ‘The what would happen after that?’ So he<sup>asws</sup> said: ‘Then Allah<sup>azwj</sup> would do whatever He<sup>azwj</sup> so Desires, for there are Changes of Decisions for Him<sup>azwj</sup>, and the Intentions, and purposes and end results’."]}}, {"index": 893, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:8", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ مَعْرُوفِ بْنِ خَرَّبُوذَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّمَا نَحْنُ كَنُجُومِ السَّمَاءِ كُلَّمَا غَابَ نَجْمٌ طَلَعَ نَجْمٌ حَتَّى إِذَا أَشَرْتُمْ بِأَصَابِعِكُمْ وَ مِلْتُمْ بِأَعْنَاقِكُمْ غَيَّبَ اللَّهُ عَنْكُمْ نَجْمَكُمْ فَاسْتَوَتْ بَنُو عَبْدِ الْمُطَّلِبِ فَلَمْ يُعْرَفْ أَيٌّ مِنْ أَيٍّ فَإِذَا طَلَعَ نَجْمُكُمْ فَاحْمَدُوا رَبَّكُمْ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hanan Bin Sadeyr, from Marouf Bin Mharrabouz, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘But rather, we<sup>asws</sup> are like the stars of the sky. Every time one star disappears, one emerges, to the extent when you indicate with your fingers and tilt with your necks. Allah<sup>azwj</sup> would Hide your star from you all. So the Clan of Abdul Muttalib<sup>as</sup> would be evenly established and it would not be recognised which one is from which. So when your star does emerge, then Praise your Lord<sup>azwj</sup>’."]}}, {"index": 894, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:9", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مُعَاوِيَةَ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ لِلْقَائِمِ ( عليه السلام ) غَيْبَةً قَبْلَ أَنْ يَقُومَ قُلْتُ وَ لِمَ قَالَ إِنَّهُ يَخَافُ وَ أَوْمَأَ بِيَدِهِ إِلَى بَطْنِهِ يَعْنِي الْقَتْلَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ja’far Bin Muhammad, from Al Hassan Bin Muawiya, from Abdullah Bin Jabala, from Abdullah Bin Bukeyr, from Zurara who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘For Al-Qaim<sup>asws</sup> there would be an absence (Occultation) before his<sup>asws</sup> rising’. I said, ‘And why (would that be so)?’ He<sup>asws</sup> he<sup>asws</sup> would fear’, and he<sup>asws</sup> gestured by his<sup>asws</sup> hand towards his<sup>asws</sup> belly, meaning the murder’."]}}, {"index": 895, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:10", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنْ بَلَغَكُمْ عَنْ صَاحِبِ هَذَا الْأَمْرِ غَيْبَةٌ فَلَا تُنْكِرُوهَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘If an Occultation reaches you all regarding the Master<sup>asws</sup> of this command, so do not be denying it’."]}}, {"index": 896, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:11", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مُعَاوِيَةَ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِبْرَاهِيمَ بْنِ خَلَفِ بْنِ عَبَّادٍ الْأَنْمَاطِيِّ عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ عِنْدَهُ فِي الْبَيْتِ أُنَاسٌ فَظَنَنْتُ أَنَّهُ إِنَّمَا أَرَادَ بِذَلِكَ غَيْرِي فَقَالَ أَمَا وَ اللَّهِ لَيَغِيبَنَّ عَنْكُمْ صَاحِبُ هَذَا الْأَمْرِ وَ لَيَخْمِلَنَّ هَذَا حَتَّى يُقَالَ مَاتَ هَلَكَ فِي أَيِّ وَادٍ سَلَكَ وَ لَتُكْفَؤُنَّ كَمَا تُكْفَأُ السَّفِينَةُ فِي أَمْوَاجِ الْبَحْرِ لَا يَنْجُو إِلَّا مَنْ أَخَذَ اللَّهُ مِيثَاقَهُ وَ كَتَبَ الْإِيمَانَ فِي قَلْبِهِ وَ أَيَّدَهُ بِرُوحٍ مِنْهُ وَ لَتُرْفَعَنَّ اثْنَتَا عَشْرَةَ رَايَةً مُشْتَبِهَةً لَا يُدْرَى أَيٌّ مِنْ أَيٍّ", "قَالَ فَبَكَيْتُ فَقَالَ مَا يُبْكِيكَ يَا أَبَا عَبْدِ اللَّهِ فَقُلْتُ جُعِلْتُ فِدَاكَ كَيْفَ لَا أَبْكِي وَ أَنْتَ تَقُولُ اثْنَتَا عَشْرَةَ رَايَةً مُشْتَبِهَةً لَا يُدْرَى أَيٌّ مِنْ أَيٍّ قَالَ وَ فِي مَجْلِسِهِ كَوَّةٌ تَدْخُلُ فِيهَا الشَّمْسُ فَقَالَ أَ بَيِّنَةٌ هَذِهِ فَقُلْتُ نَعَمْ قَالَ أَمْرُنَا أَبْيَنُ مِنْ هَذِهِ الشَّمْسِ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad and Muhammad Bin Yahya, from Ja’far Bin Muhammad, from Al Hassan Bin Muawiya, from Abdullah Bin Jabala, from Ibrahim Bin Khalaf Bin Abbad Al Anmaty, from Mufazzal Bin Umar who said, ", "‘I was in the presence of Abu Abdullah<sup>asws</sup>, and with him<sup>asws</sup> were some people in the room. So I thought that he<sup>asws</sup> intended by that, others than me (when) he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! He<sup>asws</sup> would be absent from you all, the Master<sup>asws</sup> of this command, and this (matter) would become so obscure to the extent that it would be said, ‘He<sup>asws</sup> died, perished in whichever valley he<sup>asws</sup> travelled’, and you all would be tossed about just as the ship gets tossed in the waves of the sea. None will be save except for the one whose Covenant Allah<sup>azwj</sup> has Taken, and Written the <span class=\"iTxt\">Eman</span> to be in his heart, and Aided him with a Spirit from Him<sup>azwj</sup>. And there would be raised twelve resembling flags. It would not be known which is from which’. ", "He (the narrator) said, ‘So I wept’, and he<sup>asws</sup> said: ‘What makes you weep, O Abu Abdullah?’ So I said, ‘May I be sacrificed for you<sup>asws</sup>! How can I not weep and you<sup>asws</sup> are saying there would be twelve resembling flags, not being know which one is from which?’ And in his<sup>asws</sup> gathering there was a skylight through which the sunshine entered. So he<sup>asws</sup> said: ‘It this clear (enough)?’ So I said, ‘Yes’. He<sup>asws</sup> said: ‘Our<sup>asws</sup> matter would be clearer than this sunshine’."]}}, {"index": 897, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:12", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ إِسْمَاعِيلَ الْأَنْبَارِيِّ عَنْ يَحْيَى بْنِ الْمُثَنَّى عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لِلْقَائِمِ غَيْبَتَانِ يَشْهَدُ فِي إِحْدَاهُمَا الْمَوَاسِمَ يَرَى النَّاسَ وَ لَا يَرَوْنَهُ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Ja’far Bin Muhammad, from Al Qasim Bin Ismail Al Anbary, from Yahya Bin Al Musna, from Abdullah Bin Bukeyr, from Ubeyd Bin Zurara, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘For Al-Qaim<sup>asws</sup> there would be two Occultations. In one of these, he<sup>asws</sup> would be attending the seasons (of Hajj). He<sup>asws</sup> would see the people but they would not be seeing him<sup>asws</sup>’."]}}, {"index": 898, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:13", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي إِسْحَاقَ السَّبِيعِيِّ عَنْ بَعْضِ أَصْحَابِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) مِمَّنْ يُوثَقُ بِهِ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) تَكَلَّمَ بِهَذَا الْكَلَامِ وَ حُفِظَ عَنْهُ وَ خَطَبَ بِهِ عَلَى مِنْبَرِ الْكُوفَةِ اللَّهُمَّ إِنَّهُ لَا بُدَّ لَكَ مِنْ حُجَجٍ فِي أَرْضِكَ حُجَّةٍ بَعْدَ حُجَّةٍ عَلَى خَلْقِكَ يَهْدُونَهُمْ إِلَى دِينِكَ وَ يُعَلِّمُونَهُمْ عِلْمَكَ كَيْلَا يَتَفَرَّقَ ", "أَتْبَاعُ أَوْلِيَائِكَ ظَاهِرٍ غَيْرِ مُطَاعٍ أَوْ مُكْتَتَمٍ يُتَرَقَّبُ إِنْ غَابَ عَنِ النَّاسِ شَخْصُهُمْ فِي حَالِ هُدْنَتِهِمْ فَلَمْ يَغِبْ عَنْهُمْ قَدِيمُ مَبْثُوثِ عِلْمِهِمْ وَ آدَابُهُمْ فِي قُلُوبِ الْمُؤْمِنِينَ مُثْبَتَةٌ فَهُمْ بِهَا عَامِلُونَ", "وَ يَقُولُ ( عليه السلام ) فِي هَذِهِ الْخُطْبَةِ فِي مَوْضِعٍ آخَرَ فِيمَنْ هَذَا وَ لِهَذَا يَأْرِزُ الْعِلْمُ إِذَا لَمْ يُوجَدْ لَهُ حَمَلَةٌ يَحْفَظُونَهُ وَ يَرْوُونَهُ كَمَا سَمِعُوهُ مِنَ الْعُلَمَاءِ وَ يَصْدُقُونَ عَلَيْهِمْ فِيهِ ", "اللَّهُمَّ فَإِنِّي لَأَعْلَمُ أَنَّ الْعِلْمَ لَا يَأْرِزُ كُلُّهُ وَ لَا يَنْقَطِعُ مَوَادُّهُ وَ إِنَّكَ لَا تُخْلِي أَرْضَكَ مِنْ حُجَّةٍ لَكَ عَلَى خَلْقِكَ ظَاهِرٍ لَيْسَ بِالْمُطَاعِ أَوْ خَائِفٍ مَغْمُورٍ كَيْلَا تَبْطُلَ حُجَّتُكَ وَ لَا يَضِلَّ أَوْلِيَاؤُكَ بَعْدَ إِذْ هَدَيْتَهُمْ بَلْ أَيْنَ هُمْ وَ كَمْ هُمْ أُولَئِكَ الْأَقَلُّونَ عَدَداً الْأَعْظَمُونَ عِنْدَ اللَّهِ قَدْراً ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Sahl Bin Ziyad and Muhammad Bin Yahya and someone else, from Ahmad Bin Muhammad and Ali Bin Ibrahim, from his father altogether, from Ibn Mahboub, from Hisham Bin Salim, from Abu Hamza, from Abu Is’haq Al Sabai’e, ", "(It has been narrated) from one of the companions of Amir Al-Momineen<sup>asws</sup>, from the one who was reliable with it that Amir Al-Momineen<sup>asws</sup> spoke with this speech, and he Memorised it from him<sup>asws</sup>, and he<sup>asws</sup> addressed with it upon the Pulpit of Al-Kufa: ‘O Allah<sup>azwj</sup>! It is Inevitable for You<sup>azwj</sup> that there be a Divine Authority for You<sup>azwj</sup> in Your<sup>azwj</sup> earth, a Divine Authority after a Divine Authority upon Your<sup>azwj</sup> creatures, guiding them towards Your<sup>azwj</sup> Religion and teaching them Your<sup>azwj</sup> Knowledge lest they scatter. ", "The followers of Your<sup>azwj</sup> Guardians<sup>asws</sup> in the apparent are without obedience, or in concealment, and they<sup>asws</sup> would be awaited. If their<sup>asws</sup> persons are absent from the people during a state of their<sup>asws</sup> truce, but their<sup>asws</sup> ancient knowledge and their<sup>asws</sup> education would be spread out in the hearts of the Momineen, affirmed. Thus, they would be acting with it’. ", "And he<sup>asws</sup> said during this sermon in another place: ‘So in who would this be? And due to this the knowledge is obscured when a bearer cannot be found for it who would be preserving it and reporting it just as he had heard it from the knowledgeable ones<sup>asws</sup>, and he would be truthful upon them with regards to it.  ", "O Allah<sup>azwj</sup>! So I<sup>asws</sup> know that the knowledge, all of it cannot be obscured, nor would its items be cut-off, and You<sup>azwj</sup> do not Leave Your<sup>azwj</sup> earth empty from a Divine Authority of Yours<sup>saww</sup> upon Your<sup>azwj</sup> creatures. He<sup>asws</sup> would either be apparent and wouldn’t be with a following or fearful obscured, lest Your<sup>azwj</sup> Divine Authority be invalidated, and You<sup>azwj</sup> do not Let Your<sup>azwj</sup> friends to stray after having Guided them. But where are they, and how many are Your<sup>azwj</sup> friends. There are few in number, magnified in the Presence of Allah<sup>azwj</sup> in worth’."]}}, {"index": 899, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:14", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُوسَى بْنِ الْقَاسِمِ بْنِ مُعَاوِيَةَ الْبَجَلِيِّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ قُلْ أَ رَأَيْتُمْ إِنْ أَصْبَحَ ماؤُكُمْ غَوْراً فَمَنْ يَأْتِيكُمْ بِماءٍ مَعِينٍ قَالَ إِذَا غَابَ عَنْكُمْ إِمَامُكُمْ فَمَنْ يَأْتِيكُمْ بِإِمَامٍ جَدِيدٍ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Sahl Bin Ziyad, from Musa Bin Al Qasim Bin Muawiya Al Bajaly, ", "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"> [67:30] Say: Have you considered if your water should recede, who is it then that will bring you flowing water?</span>. He<sup>asws</sup> said: ‘When your Imam<sup>asws</sup> is absent from you all, so who would come to you with a new Imam<sup>asws</sup>?’."]}}, {"index": 900, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:15", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنْ بَلَغَكُمْ عَنْ صَاحِبِكُمْ غَيْبَةٌ فَلَا تُنْكِرُوهَا ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When an Occultation reaches you all from your Master<sup>asws</sup>, so do not be denying it’."]}}, {"index": 901, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:16", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا بُدَّ لِصَاحِبِ هَذَا الْأَمْرِ مِنْ غَيْبَةٍ وَ لَا بُدَّ لَهُ فِي غَيْبَتِهِ مِنْ عُزْلَةٍ وَ نِعْمَ الْمَنْزِلُ طَيْبَةُ وَ مَا بِثَلَاثِينَ مِنْ وَحْشَةٍ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al hassan Bin Ali Al Washha, from Ali Bin Abu Hamza, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is inevitable for an Occultation to be for the Master<sup>asws</sup> of this command, and an isolation is inevitable for him<sup>asws</sup> during his<sup>asws</sup> Occultation, and the best of the dwellings is Tayba (Al-Medina), and there is no loneliness with thirty (people)’."]}}, {"index": 902, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:17", "text": ["وَ بِهَذَا الْإِسْنَادِ عَنِ الْوَشَّاءِ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَيْفَ أَنْتَ إِذَا وَقَعَتِ الْبَطْشَةُ بَيْنَ الْمَسْجِدَيْنِ فَيَأْرِزُ الْعِلْمُ كَمَا تَأْرِزُ الْحَيَّةُ فِي جُحْرِهَا وَ اخْتَلَفَتِ الشِّيعَةُ وَ سَمَّى بَعْضُهُمْ بَعْضاً كَذَّابِينَ وَ تَفَلَ بَعْضُهُمْ فِي وُجُوهِ بَعْضٍ ", "قُلْتُ جُعِلْتُ فِدَاكَ مَا عِنْدَ ذَلِكَ مِنْ خَيْرٍ فَقَالَ لِي الْخَيْرُ كُلُّهُ عِنْدَ ذَلِكَ ثَلَاثاً ."], "translations": {"en.hubeali": ["And by this chain, from Al Washa’a, from Ali Bin Al Hassan, from Aban Bin Taghlub who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘How would you be when the seizure occurs between the two Masjids, so the knowledge would be obscured just as the obscurity of the snake into its hole, and the Shias would differ, and some of them would be calling the others to be liars, and some of them would be spitting in the faces of others’. ", "I said, ‘May I be sacrificed for you<sup>asws</sup>! There would not be any goodness during that’. So he<sup>asws</sup> said to me: ‘The goodness, all of it, would be during that’ – three (times)’."]}}, {"index": 903, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:18", "text": ["وَ بِهَذَا الْإِسْنَادِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ لِلْقَائِمِ غَيْبَةً قَبْلَ أَنْ يَقُومَ إِنَّهُ يَخَافُ وَ أَوْمَأَ بِيَدِهِ إِلَى بَطْنِهِ يَعْنِي الْقَتْلَ ."], "translations": {"en.hubeali": ["And by this chain, from Ahmad Bin Muhammad, from his father Muhammad Bin Isa, from Ibn Bukeyr, from Zurara who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘For Al-Qaim<sup>asws</sup>, there would be an Occultation before he<sup>asws</sup> arises. He<sup>asws</sup> would fear’, and he<sup>asws</sup> gestured by his<sup>asws</sup> hand towards his<sup>asws</sup> belly, meaning the murder’."]}}, {"index": 904, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:19", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ مَحْبُوبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِلْقَائِمِ غَيْبَتَانِ إِحْدَاهُمَا قَصِيرَةٌ وَ الْأُخْرَى طَوِيلَةٌ الْغَيْبَةُ الْأُولَى لَا يَعْلَمُ بِمَكَانِهِ فِيهَا إِلَّا خَاصَّةُ شِيعَتِهِ وَ الْأُخْرَى لَا يَعْلَمُ بِمَكَانِهِ فِيهَا إِلَّا خَاصَّةُ مَوَالِيهِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ibn Mahboub, from Is’haq Bin Ammar who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘For Al-Qaim<sup>asws</sup>, there would be two Occultations, one of them short and the other one long. During the first Occultation, it would not be known which place he<sup>asws</sup> is in except for special ones of his<sup>asws</sup> Shias; and the other (Occultation), it would not be known which place he<sup>asws</sup> is in except for special ones of the ones in his<sup>asws</sup> Wilayah’."]}}, {"index": 905, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:20", "text": ["مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ إِدْرِيسَ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَمِّهِ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لِصَاحِبِ هَذَا الْأَمْرِ غَيْبَتَانِ إِحْدَاهُمَا يَرْجِعُ مِنْهَا إِلَى أَهْلِهِ وَ الْأُخْرَى يُقَالُ هَلَكَ فِي أَيِّ وَادٍ سَلَكَ قُلْتُ كَيْفَ نَصْنَعُ إِذَا كَانَ كَذَلِكَ قَالَ إِذَا ادَّعَاهَا مُدَّعٍ فَاسْأَلُوهُ عَنْ أَشْيَاءَ يُجِيبُ فِيهَا مِثْلَهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya and Ahmad Bin Idrees, from Al Hassan Bin Ali Al Kufy, from Ali Bin Hassan, from his uncle Abdul Rahman Bin Kaseer, from Mufazzal Bin Umar who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘For the Master<sup>asws</sup> of this command, there would be two Occultation – (During) one of the two, he<sup>asws</sup> would return from it to his<sup>asws</sup> family, and (during) the other, it would be said, ‘He<sup>asws</sup> perished in whichever valley he<sup>asws</sup> travelled in’. I said, ‘How should one to deal with it, when it would be like that’. He<sup>asws</sup> said: ‘When a claimant claims it, so ask him about things. He would answer with regards to these, similar to him<sup>asws</sup>’."]}}, {"index": 906, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:21", "text": ["أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ جَعْفَرِ بْنِ الْقَاسِمِ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ الْخَزَّازِ عَنِ الْوَلِيدِ بْنِ عُقْبَةَ عَنِ الْحَارِثِ بْنِ زِيَادٍ عَنْ شُعَيْبٍ عَنْ أَبِي حَمْزَةَ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقُلْتُ لَهُ أَنْتَ صَاحِبُ هَذَا الْأَمْرِ فَقَالَ لَا فَقُلْتُ فَوَلَدُكَ فَقَالَ لَا فَقُلْتُ فَوَلَدُ وَلَدِكَ هُوَ قَالَ لَا فَقُلْتُ فَوَلَدُ وَلَدِ وَلَدِكَ فَقَالَ لَا قُلْتُ مَنْ هُوَ قَالَ الَّذِي يَمْلَأُهَا عَدْلًا كَمَا مُلِئَتْ ظُلْماً وَ جَوْراً عَلَى فَتْرَةٍ مِنَ الْأَئِمَّةِ كَمَا أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) بُعِثَ عَلَى فَتْرَةٍ مِنَ الرُّسُلِ ."], "translations": {"en.hubeali": ["Ahmad Bin Idrees, from Muhammad Bin Ahmad, from Ja’far Bin Al Qasim, from Muhammad Bin Al Waleed Al Khazzaz, from Al Waleed Bin Uqba, from Al Haris Bin Ziyad, from Shuayb, from Abu Hamza who said, ", "‘I went over to Abu Abdullah<sup>asws</sup> and I said to him<sup>asws</sup>, ‘Are you<sup>asws</sup> the Master<sup>asws</sup> of this command (i.e. Al-Mahdi<sup>asws</sup>)?’ So he<sup>asws</sup> said: ‘No’. So I said, ‘So, your<sup>asws</sup> son<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘No’. So I said, ‘So, a son<sup>asws</sup> of your<sup>asws</sup> son<sup>asws</sup>, is him<sup>asws</sup>?’ He<sup>asws</sup> said: ‘No’. So I said, ‘So, a son<sup>asws</sup>, for a son<sup>asws</sup> of your<sup>asws</sup> son<sup>asws</sup>?’ So he<sup>asws</sup> said: No’. I said, ‘Who is he<sup>asws</sup>?’ He<sup>asws</sup> said: ‘The one who would be filling it (the earth) with justice just as it had been filled with injustice and tyranny upon an interval from the Imams<sup>asws</sup>, just as Rasool-Allah<sup>saww</sup> was Sent upon an interval from the Rasools<sup>as</sup>’."]}}, {"index": 907, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:22", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ مُوسَى بْنِ جَعْفَرٍ الْبَغْدَادِيِّ عَنْ وَهْبِ بْنِ شَاذَانَ عَنِ الْحَسَنِ بْنِ أَبِي الرَّبِيعِ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ أُمِّ هَانِئٍ قَالَتْ سَأَلْتُ أَبَا جَعْفَرٍ مُحَمَّدَ بْنَ عَلِيٍّ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ تَعَالَى فَلا أُقْسِمُ بِالْخُنَّسِ الْجَوارِ الْكُنَّسِ قَالَتْ فَقَالَ إِمَامٌ يَخْنِسُ سَنَةَ سِتِّينَ وَ مِائَتَيْنِ ثُمَّ يَظْهَرُ كَالشِّهَابِ يَتَوَقَّدُ فِي اللَّيْلَةِ الظَّلْمَاءِ فَإِنْ أَدْرَكْتِ زَمَانَهُ قَرَّتْ عَيْنُكِ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Ja’far Bin Muhammad, from Musa Bin Ja’far Al Naghdady, from Wahab Bin Shazan, from Al Hassan Bin Abu Al Rabie, from Muhammad Bin Is’haq, from Umm Hany who said, ", "‘I asked Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> about the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\">[81:15] But nay! I swear by the Concealment, [81:16] (The stars) that run their course (and) hide</span>. So he<sup>asws</sup> said: ‘The Imam<sup>asws</sup> would be in concealment in the year <span style=\"text-decoration: underline\">two hundred and sixty,</span> then he<sup>asws</sup> would appear like the meteor shooting in the dark night. So, if you were to come across his<sup>asws</sup> time, it would delight your eyes’."]}}, {"index": 908, "local_index": 23, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:23", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَعْدِ بْنِ عَبْدِ اللَّهِ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عُمَرَ بْنِ يَزِيدَ عَنِ الْحَسَنِ بْنِ الرَّبِيعِ الْهَمْدَانِيِّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ أُسَيْدِ بْنِ ثَعْلَبَةَ عَنْ أُمِّ هَانِئٍ قَالَتْ لَقِيتُ أَبَا جَعْفَرٍ مُحَمَّدَ بْنَ عَلِيٍّ ( عليه السلام ) فَسَأَلْتُهُ عَنْ هَذِهِ الْآيَةِ فَلا أُقْسِمُ بِالْخُنَّسِ الْجَوارِ الْكُنَّسِ قَالَ الْخُنَّسُ إِمَامٌ يَخْنِسُ فِي زَمَانِهِ عِنْدَ انْقِطَاعٍ مِنْ عِلْمِهِ عِنْدَ النَّاسِ سَنَةَ سِتِّينَ وَ مِائَتَيْنِ ثُمَّ يَبْدُو كَالشِّهَابِ الْوَاقِدِ فِي ظُلْمَةِ اللَّيْلِ فَإِنْ أَدْرَكْتِ ذَلِكِ قَرَّتْ عَيْنُكِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sa’ad Bin Abdullah, from Ahmad Bin Al Hassan, from Umar Bin Yazeed, from Al Hassan Bin Al Rabie Al Hamdany who said, ‘Muhammad Bin Is’haq narrated to us, from Aseyd Bin Sa’alba, from Umm Hany who said,", "‘I met Abu Ja’far Muhammad Bin Ali<sup>asws</sup>, so I asked him<sup>asws</sup> about this Verse <span class=\"ibTxt\">[81:15] But nay! I swear by the Concealment, [81:16] (The stars) that run their course (and) hide</span>. He<sup>asws</sup> said: ‘The concealment is the Imam<sup>asws</sup> who would be in concealment during his<sup>asws</sup> time during the cutting off from his<sup>asws</sup> knowledge with the people <span style=\"text-decoration: underline\">in the year two hundred and sixty.</span> Then he<sup>asws</sup> would appear like the shooting meteor during a dark night. So, if you come across that, it would delight your eyes’."]}}, {"index": 909, "local_index": 24, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:24", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَيُّوبَ بْنِ نُوحٍ عَنْ أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام ) قَالَ إِذَا رُفِعَ عِلْمُكُمْ مِنْ بَيْنِ أَظْهُرِكُمْ فَتَوَقَّعُوا الْفَرَجَ مِنْ تَحْتِ أَقْدَامِكُمْ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from one of our companions, from Ayoub Bin Nuh, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup> having said: ‘When your knowledge would be raised from between your apparent, so anticipate the relief from beneath your feet’."]}}, {"index": 910, "local_index": 25, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:25", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَعْدِ بْنِ عَبْدِ اللَّهِ عَنْ أَيُّوبَ بْنِ نُوحٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) إِنِّي أَرْجُو أَنْ تَكُونَ صَاحِبَ هَذَا الْأَمْرِ وَ أَنْ يَسُوقَهُ اللَّهُ إِلَيْكَ بِغَيْرِ سَيْفٍ فَقَدْ بُويِعَ لَكَ وَ ضُرِبَتِ الدَّرَاهِمُ بِاسْمِكَ ", "فَقَالَ مَا مِنَّا أَحَدٌ اخْتَلَفَتْ إِلَيْهِ الْكُتُبُ وَ أُشِيرَ إِلَيْهِ بِالْأَصَابِعِ وَ سُئِلَ عَنِ الْمَسَائِلِ وَ حُمِلَتْ إِلَيْهِ الْأَمْوَالُ إِلَّا اغْتِيلَ أَوْ مَاتَ عَلَى فِرَاشِهِ حَتَّى يَبْعَثَ اللَّهُ لِهَذَا الْأَمْرِ غُلَاماً مِنَّا خَفِيَّ الْوِلَادَةِ وَ الْمَنْشَإِ غَيْرَ خَفِيٍّ فِي نَسَبِهِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sa’ad Bin Abdullah, from Ayoub Bin Nuh who said, ", "‘I said to Abu Al-Hassan Al-Reza<sup>asws</sup>, ‘I am hoping that you<sup>asws</sup> would happen to be the Master<sup>asws</sup> of this command and that Allah<sup>azwj</sup> would Usher it to You<sup>asws</sup> without (having raised) a sword, for allegiance has been pledged to you<sup>asws</sup> and the Dirham has been struck with your<sup>asws</sup> name (on it)’. ", "So he<sup>asws</sup> said: ‘There is none from us<sup>asws</sup> with whom letters have been exchanged and he<sup>asws</sup> has been pointed to with the fingers, and asked about the questioned, and the wealth has been carried over to him<sup>asws</sup>, except that he<sup>asws</sup> has been assassinated or passed away upon his<sup>asws</sup> bed, until Allah<sup>azwj</sup> Would Send for this command, a boy from us<sup>asws</sup>, concealed of the birth and the growth, without there being a concealment with regards to his<sup>asws</sup> lineage’."]}}, {"index": 911, "local_index": 26, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:26", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ وَ غَيْرُهُ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ مُوسَى بْنِ هِلَالٍ الْكِنْدِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَطَاءٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنَّ شِيعَتَكَ بِالْعِرَاقِ كَثِيرَةٌ وَ اللَّهِ مَا فِي أَهْلِ بَيْتِكَ مِثْلُكَ فَكَيْفَ لَا تَخْرُجُ قَالَ فَقَالَ يَا عَبْدَ اللَّهِ بْنَ عَطَاءٍ قَدْ أَخَذْتَ تَفْرُشُ أُذُنَيْكَ لِلنَّوْكَى إِي وَ اللَّهِ مَا أَنَا بِصَاحِبِكُمْ قَالَ قُلْتُ لَهُ فَمَنْ صَاحِبُنَا قَالَ انْظُرُوا مَنْ عَمِيَ عَلَى النَّاسِ وِلَادَتُهُ فَذَاكَ صَاحِبُكُمْ إِنَّهُ لَيْسَ مِنَّا أَحَدٌ يُشَارُ إِلَيْهِ بِالْإِصْبَعِ وَ يُمْضَغُ بِالْأَلْسُنِ إِلَّا مَاتَ غَيْظاً أَوْ رَغِمَ أَنْفُهُ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad and someone else, from Ja’far Bin Muhammad, from Ali Bin Al Abbas Bin Aamir, from Musa Bin Hilal Al Kindy, from Abdullah Bin Ata’a, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Your<sup>asws</sup> Shias in Al-Iraq are a lot. By Allah<sup>azwj</sup>, there is none like you<sup>asws</sup> among your<sup>asws</sup> family members. So how come you<sup>asws</sup> are not coming out (rising against the ruling authorities)?’ So he<sup>asws</sup> said: ‘O Abdullah Bin Ata’a! You have taken the lining of your two ears for the silliness. Yes, by Allah<sup>azwj</sup>, I<sup>asws</sup> am not your Master (Al-Qaim<sup>asws</sup>)’. I said, ‘So who is our Master (Al-Qaim<sup>asws</sup>)?’ He<sup>asws</sup> said: ‘Await the one whose birth the people would be blinded from, so that one would be your Master (Al-Qaim<sup>asws</sup>). There isn’t anyone from us<sup>asws</sup> who is pointed to by the fingers and chewed by the tongues except he<sup>asws</sup> has passed away in indignation or his<sup>asws</sup> nose was rubbed (pride was hurt)’."]}}, {"index": 912, "local_index": 27, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:27", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يَقُومُ الْقَائِمُ وَ لَيْسَ لِأَحَدٍ فِي عُنُقِهِ عَهْدٌ وَ لَا عَقْدٌ وَ لَا بَيْعَةٌ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Ibn Abu Umeyr, from Hisham Bin Salim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Al-Qaim<sup>asws</sup> would be rising and there would not be a pact for anyone upon his<sup>asws</sup> neck, nor an agreement, nor an allegiance’."]}}, {"index": 913, "local_index": 28, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:28", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْعَطَّارِ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ مَنْصُورٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ إِذَا أَصْبَحْتُ وَ أَمْسَيْتُ لَا أَرَى إِمَاماً أَئْتَمُّ بِهِ مَا أَصْنَعُ قَالَ فَأَحِبَّ مَنْ كُنْتَ تُحِبُّ وَ أَبْغِضْ مَنْ كُنْتَ تُبْغِضُ حَتَّى يُظْهِرَهُ اللَّهُ عَزَّ وَ جَلَّ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Al Hassan Bin Ali Al Attar, from Ja’far Bin Muhammad, from Mansour, from the one who mentioned it, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘Whenever in the morning and evening I do not see an Imam<sup>asws</sup> I can follow as an Imam<sup>asws</sup> with, what should I do?’ He<sup>asws</sup> said: ‘So love the one whom you used to love and hate the one whom you used to hate until Allah<sup>azwj</sup> Mighty and Majestic Manifests him<sup>asws</sup>’."]}}, {"index": 914, "local_index": 29, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:29", "text": ["الْحُسَيْنُ بْنُ أَحْمَدَ عَنْ أَحْمَدَ بْنِ هِلَالٍ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عِيسَى عَنْ خَالِدِ بْنِ نَجِيحٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا بُدَّ لِلْغُلَامِ مِنْ غَيْبَةٍ قُلْتُ وَ لِمَ قَالَ يَخَافُ وَ أَوْمَأَ بِيَدِهِ إِلَى بَطْنِهِ وَ هُوَ الْمُنْتَظَرُ وَ هُوَ الَّذِي يَشُكُّ النَّاسُ فِي وِلَادَتِهِ فَمِنْهُمْ مَنْ يَقُولُ حَمْلٌ وَ مِنْهُمْ مَنْ يَقُولُ مَاتَ أَبُوهُ وَ لَمْ يُخَلِّفْ وَ مِنْهُمْ مَنْ يَقُولُ وُلِدَ قَبْلَ مَوْتِ أَبِيهِ بِسَنَتَيْنِ ", "قَالَ زُرَارَةُ فَقُلْتُ وَ مَا تَأْمُرُنِي لَوْ أَدْرَكْتُ ذَلِكَ الزَّمَانَ قَالَ ادْعُ اللَّهَ بِهَذَا الدُّعَاءِ اللَّهُمَّ عَرِّفْنِي نَفْسَكَ فَإِنَّكَ إِنْ لَمْ تُعَرِّفْنِي نَفْسَكَ لَمْ أَعْرِفْكَ اللَّهُمَّ عَرِّفْنِي نَبِيَّكَ فَإِنَّكَ إِنْ لَمْ تُعَرِّفْنِي نَبِيَّكَ لَمْ أَعْرِفْهُ قَطُّ اللَّهُمَّ عَرِّفْنِي حُجَّتَكَ فَإِنَّكَ إِنْ لَمْ تُعَرِّفْنِي حُجَّتَكَ ضَلَلْتُ عَنْ دِينِي ", "قَالَ أَحْمَدُ بْنُ الْهِلَالِ سَمِعْتُ هَذَا الْحَدِيثَ مُنْذُ سِتٍّ وَ خَمْسِينَ سَنَةً ."], "translations": {"en.hubeali": ["Al Husayn Bin Ahmad, from Ahmad Bin Hilal who said, ‘Usman Bin Isa narrated to us, from Khalid Bin Najeeh, from Zurara Bin Ayn who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘An Occultation is inevitable for the boy’. I said, ‘And why (is that so)?’ He<sup>asws</sup> said: ‘He<sup>asws</sup> would fear’, and he<sup>asws</sup> gestured by his<sup>asws</sup> hand towards his<sup>asws</sup> belly, ‘and he<sup>asws</sup> is the awaited, and he<sup>asws</sup> is the one the people would doubt regarding his<sup>asws</sup> birth. So, from them would be one who would be saying, ‘He<sup>asws</sup> was borne’; and from them would be one who would be saying, ‘His<sup>asws</sup> father<sup>asws</sup> passed away and did not leave a replacement (Imam<sup>asws</sup>)’; and from them would be one who would be saying, ‘He<sup>asws</sup> was born two years before his<sup>asws</sup> father<sup>asws</sup> passed away’’. ", "Zurara said, ‘So I said, ‘And what would you<sup>asws</sup> instruct me with if I were to come across that time period?’ He<sup>asws</sup> said: ‘Supplicate to Allah<sup>azwj</sup> with this supplication, ‘O Allah<sup>azwj</sup>! Acquaint Yourself<sup>azwj</sup> to me, for if You<sup>azwj</sup> do not Acquaint Yourself<sup>saww</sup> to me, I will not (be able to) recognise You<sup>azwj</sup>. O Allah<sup>azwj</sup>! Acquaint me with Your<sup>azwj</sup> Rasool<sup>saww</sup>, for if You<sup>azwj</sup> do not Acquaint me with Your<sup>azwj</sup> Rasool<sup>saww</sup>, I would not recognise Your<sup>azwj</sup> Divine Authority. O Allah<sup>azwj</sup>! Acquaint me with Your<sup>azwj</sup> Divine Authority, for it You<sup>azwj</sup> do not Acquaint me with Your<sup>azwj</sup> Divine Authority, I would stray from my Religion’’.", "Ahmad Bin Hilal (the narrator) said, ‘I heard this Hadeeth fifty six years ago’."]}}, {"index": 915, "local_index": 30, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:30", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَإِذا نُقِرَ فِي النَّاقُورِ قَالَ إِنَّ مِنَّا إِمَاماً مُظَفَّراً مُسْتَتِراً فَإِذَا أَرَادَ اللَّهُ عَزَّ ذِكْرُهُ إِظْهَارَ أَمْرِهِ نَكَتَ فِي قَلْبِهِ نُكْتَةً فَظَهَرَ فَقَامَ بِأَمْرِ اللَّهِ تَبَارَكَ وَ تَعَالَى ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Hassan, from Muhammad Bin Ali, from Abdullah Bin Al Qasim, from Al Mufazzal Bin Umar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[74:8] For when the Trumpet is sounded</span>. He<sup>asws</sup> said: ‘From us<sup>asws</sup> is an Imam<sup>asws</sup>, who is victorious, hidden. So when Allah<sup>azwj</sup> Mighty is His<sup>azwj</sup> Mention,  Intends to Manifest His<sup>azwj</sup> Command, would Imprint in his<sup>asws</sup> heart with an imprint, so he<sup>asws</sup> would appear, and stand by the Command of Allah<sup>azwj</sup> the Blessed and High’."]}}, {"index": 916, "local_index": 31, "part_type": "Hadith", "path": "/books/al-kafi:1:4:80:31", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ الْفَرَجِ قَالَ كَتَبَ إِلَيَّ أَبُو جَعْفَرٍ ( عليه السلام ) إِذَا غَضِبَ اللَّهُ تَبَارَكَ وَ تَعَالَى عَلَى خَلْقِهِ نَحَّانَا عَنْ جِوَارِهِمْ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ja’far Bin Muhammad, from Ahmad Bin Al Husayn, from Muhammad Bin Abdullah, from Muhammad Bin Al Faraj who said, ", "‘Abu Ja’far<sup>asws</sup> wrote to me: ‘Whenever Allah<sup>azwj</sup> Blessed and High is Wrathful upon His<sup>azwj</sup> creatures, He<sup>azwj</sup> Forbids us<sup>asws</sup> from being in their vicinity’."]}}]}, "index": "al-kafi:1:4:80", "kind": "verse_list"}