{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 81"}, "path": "/books/al-kafi:1:4:81", "titles": {"ar": "بَابُ مَا يُفْصَلُ بِهِ بَيْنَ دَعْوَى الْمُحِقِّ وَ الْمُبْطِلِ فِي أَمْرِ الْإِمَامَةِ", "en": "Chapter 81 – What can be decided with between the truthful and the false claimant regarding the matter of the Imamate"}}], "index": 139, "local_index": 81, "part_type": "Chapter", "path": "/books/al-kafi:1:4:81", "titles": {"ar": "بَابُ مَا يُفْصَلُ بِهِ بَيْنَ دَعْوَى الْمُحِقِّ وَ الْمُبْطِلِ فِي أَمْرِ الْإِمَامَةِ", "en": "Chapter 81 – What can be decided with between the truthful and the false claimant regarding the matter of the Imamate"}, "verse_count": 19, "verse_start_index": 916, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 917, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ سَلَامِ بْنِ عَبْدِ اللَّهِ وَ مُحَمَّدُ بْنُ الْحَسَنِ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ حَسَّانَ جَمِيعاً عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ سَلَامِ بْنِ عَبْدِ اللَّهِ الْهَاشِمِيِّ قَالَ مُحَمَّدُ بْنُ عَلِيٍّ وَ قَدْ سَمِعْتُهُ مِنْهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ بَعَثَ طَلْحَةُ وَ الزُّبَيْرُ رَجُلًا مِنْ عَبْدِ الْقَيْسِ يُقَالُ لَهُ خِدَاشٌ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( صلوات الله عليه ) وَ قَالَا لَهُ إِنَّا نَبْعَثُكَ إِلَى رَجُلٍ طَالَ مَا كُنَّا نَعْرِفُهُ وَ أَهْلَ بَيْتِهِ بِالسِّحْرِ وَ الْكِهَانَةِ وَ أَنْتَ أَوْثَقُ مَنْ بِحَضْرَتِنَا مِنْ أَنْفُسِنَا مِنْ أَنْ تَمْتَنِعَ مِنْ ذَلِكَ وَ أَنْ تُحَاجَّهُ لَنَا حَتَّى تَقِفَهُ عَلَى أَمْرٍ مَعْلُومٍ", "وَ اعْلَمْ أَنَّهُ أَعْظَمُ النَّاسِ دَعْوًى فَلَا يَكْسِرَنَّكَ ذَلِكَ عَنْهُ وَ مِنَ الْأَبْوَابِ الَّتِي يَخْدَعُ النَّاسَ بِهَا الطَّعَامُ وَ الشَّرَابُ وَ الْعَسَلُ وَ الدُّهْنُ وَ أَنْ يُخَالِيَ الرَّجُلَ فَلَا تَأْكُلْ لَهُ طَعَاماً وَ لَا تَشْرَبْ لَهُ شَرَاباً وَ لَا تَمَسَّ لَهُ عَسَلًا وَ لَا دُهْناً وَ لَا تَخْلُ مَعَهُ وَ احْذَرْ هَذَا كُلَّهُ مِنْهُ وَ انْطَلِقْ عَلَى بَرَكَةِ اللَّهِ", "فَإِذَا رَأَيْتَهُ فَاقْرَأْ آيَةَ السُّخْرَةِ وَ تَعَوَّذْ بِاللَّهِ مِنْ كَيْدِهِ وَ كَيْدِ الشَّيْطَانِ فَإِذَا جَلَسْتَ إِلَيْهِ فَلَا تُمَكِّنْهُ مِنْ بَصَرِكَ كُلِّهِ وَ لَا تَسْتَأْنِسْ بِهِ ثُمَّ قُلْ لَهُ إِنَّ أَخَوَيْكَ فِي الدِّينِ وَ ابْنَيْ عَمِّكَ فِي الْقَرَابَةِ يُنَاشِدَانِكَ الْقَطِيعَةَ وَ يَقُولَانِ لَكَ أَ مَا تَعْلَمُ أَنَّا تَرَكْنَا النَّاسَ لَكَ وَ خَالَفْنَا عَشَائِرَنَا فِيكَ مُنْذُ قَبَضَ اللَّهُ عَزَّ وَ جَلَّ مُحَمَّداً ( صلى الله عليه وآله ) فَلَمَّا نِلْتَ أَدْنَى مَنَالٍ ضَيَّعْتَ حُرْمَتَنَا وَ قَطَعْتَ رَجَاءَنَا", "ثُمَّ قَدْ رَأَيْتَ أَفْعَالَنَا فِيكَ وَ قُدْرَتَنَا عَلَى النَّأْيِ عَنْكَ وَ سَعَةِ الْبِلَادِ دُونَكَ وَ أَنَّ مَنْ كَانَ يَصْرِفُكَ عَنَّا وَ عَنْ صِلَتِنَا كَانَ أَقَلَّ لَكَ نَفْعاً وَ أَضْعَفَ عَنْكَ دَفْعاً مِنَّا وَ قَدْ وَضَحَ الصُّبْحُ لِذِي عَيْنَيْنِ وَ قَدْ بَلَغَنَا عَنْكَ انْتِهَاكٌ لَنَا وَ دُعَاءٌ عَلَيْنَا فَمَا الَّذِي يَحْمِلُكَ عَلَى ذَلِكَ فَقَدْ كُنَّا نَرَى أَنَّكَ أَشْجَعُ فُرْسَانِ الْعَرَبِ أَ تَتَّخِذُ اللَّعْنَ لَنَا دِيناً وَ تَرَى أَنَّ ذَلِكَ يَكْسِرُنَا عَنْكَ ", "فَلَمَّا أَتَى خِدَاشٌ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) صَنَعَ مَا أَمَرَاهُ فَلَمَّا نَظَرَ إِلَيْهِ عَلِيٌّ ( عليه السلام ) وَ هُوَ يُنَاجِي نَفْسَهُ ضَحِكَ وَ قَالَ هَاهُنَا يَا أَخَا عَبْدِ قَيْسٍ وَ أَشَارَ لَهُ إِلَى مَجْلِسٍ قَرِيبٍ مِنْهُ فَقَالَ مَا أَوْسَعَ الْمَكَانَ أُرِيدُ أَنْ أُؤَدِّيَ إِلَيْكَ رِسَالَةً قَالَ بَلْ تَطْعَمُ وَ تَشْرَبُ وَ تَحُلُّ ثِيَابَكَ وَ تَدَّهِنُ ثُمَّ تُؤَدِّي رِسَالَتَكَ قُمْ يَا قَنْبَرُ فَأَنْزِلْهُ قَالَ مَا بِي إِلَى شَيْ‏ءٍ مِمَّا ذَكَرْتَ حَاجَةٌ قَالَ فَأَخْلُو بِكَ قَالَ كُلُّ سِرٍّ لِي عَلَانِيَةٌ ", "قَالَ فَأَنْشُدُكَ بِاللَّهِ الَّذِي هُوَ أَقْرَبُ إِلَيْكَ مِنْ نَفْسِكَ الْحَائِلِ بَيْنَكَ وَ بَيْنَ قَلْبِكَ الَّذِي يَعْلَمُ خَائِنَةَ الْأَعْيُنِ وَ مَا تُخْفِي الصُّدُورُ أَ تَقَدَّمَ إِلَيْكَ الزُّبَيْرُ بِمَا عَرَضْتُ عَلَيْكَ قَالَ اللَّهُمَّ نَعَمْ قَالَ لَوْ كَتَمْتَ بَعْدَ مَا سَأَلْتُكَ مَا ارْتَدَّ إِلَيْكَ طَرْفُكَ فَأَنْشُدُكَ اللَّهَ هَلْ عَلَّمَكَ كَلَاماً تَقُولُهُ إِذَا أَتَيْتَنِي قَالَ اللَّهُمَّ نَعَمْ قَالَ عَلِيٌّ ( عليه السلام ) آيَةَ السُّخْرَةِ قَالَ نَعَمْ قَالَ فَاقْرَأْهَا فَقَرَأَهَا وَ جَعَلَ عَلِيٌّ ( عليه السلام ) يُكَرِّرُهَا وَ يُرَدِّدُهَا وَ يَفْتَحُ عَلَيْهِ إِذَا أَخْطَأَ حَتَّى إِذَا قَرَأَهَا سَبْعِينَ مَرَّةً قَالَ الرَّجُلُ مَا يَرَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَمْرَهُ بِتَرَدُّدِهَا سَبْعِينَ مَرَّةً", "ثُمَّ قَالَ لَهُ أَ تَجِدُ قَلْبَكَ اطْمَأَنَّ قَالَ إِي وَ الَّذِي نَفْسِي بِيَدِهِ قَالَ فَمَا قَالَا لَكَ فَأَخْبَرَهُ فَقَالَ قُلْ لَهُمَا كَفَى بِمَنْطِقِكُمَا حُجَّةً عَلَيْكُمَا وَ لَكِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ زَعَمْتُمَا أَنَّكُمَا أَخَوَايَ فِي الدِّينِ وَ ابْنَا عَمِّي فِي النَّسَبِ فَأَمَّا النَّسَبُ فَلَا أُنْكِرُهُ وَ إِنْ كَانَ النَّسَبُ مَقْطُوعاً إِلَّا مَا وَصَلَهُ اللَّهُ بِالْإِسْلَامِ", "وَ أَمَّا قَوْلُكُمَا إِنَّكُمَا أَخَوَايَ فِي الدِّينِ فَإِنْ كُنْتُمَا صَادِقَيْنِ فَقَدْ فَارَقْتُمَا كِتَابَ اللَّهِ عَزَّ وَ جَلَّ وَ عَصَيْتُمَا أَمْرَهُ بِأَفْعَالِكُمَا فِي أَخِيكُمَا فِي الدِّينِ وَ إِلَّا فَقَدْ كَذَبْتُمَا وَ افْتَرَيْتُمَا بِادِّعَائِكُمَا أَنَّكُمَا أَخَوَايَ فِي الدِّينِ", "وَ أَمَّا مُفَارَقَتُكُمَا النَّاسَ مُنْذُ قَبَضَ اللَّهُ مُحَمَّداً ( صلى الله عليه وآله ) فَإِنْ كُنْتُمَا فَارَقْتُمَاهُمْ بِحَقٍّ فَقَدْ نَقَضْتُمَا ذَلِكَ الْحَقَّ بِفِرَاقِكُمَا إِيَّايَ أَخِيراً وَ إِنْ فَارَقْتُمَاهُمْ بِبَاطِلٍ فَقَدْ وَقَعَ إِثْمُ ذَلِكَ الْبَاطِلِ عَلَيْكُمَا مَعَ الْحَدَثِ الَّذِي أَحْدَثْتُمَا مَعَ أَنَّ صَفْقَتَكُمَا بِمُفَارَقَتِكُمَا النَّاسَ لَمْ تَكُنْ إِلَّا لِطَمَعِ الدُّنْيَا زَعَمْتُمَا وَ ذَلِكَ قَوْلُكُمَا فَقَطَعْتَ رَجَاءَنَا لَا تَعِيبَانِ بِحَمْدِ اللَّهِ مِنْ دِينِي شَيْئاً ", "وَ أَمَّا الَّذِي صَرَفَنِي عَنْ صِلَتِكُمَا فَالَّذِي صَرَفَكُمَا عَنِ الْحَقِّ وَ حَمَلَكُمَا عَلَى خَلْعِهِ مِنْ رِقَابِكُمَا كَمَا يَخْلَعُ الْحَرُونُ لِجَامَهُ وَ هُوَ اللَّهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئاً فَلَا تَقُولَا أَقَلَّ نَفْعاً وَ أَضْعَفَ دَفْعاً فَتَسْتَحِقَّا اسْمَ الشِّرْكِ مَعَ النِّفَاقِ ", "وَ أَمَّا قَوْلُكُمَا إِنِّي أَشْجَعُ فُرْسَانِ الْعَرَبِ وَ هَرْبُكُمَا مِنْ لَعْنِي وَ دُعَائِي فَإِنَّ لِكُلِّ مَوْقِفٍ عَمَلًا إِذَا اخْتَلَفَتِ الْأَسِنَّةُ وَ مَاجَتْ لُبُودُ الْخَيْلِ وَ مَلَأَ سَحَرَاكُمَا أَجْوَافَكُمَا فَثَمَّ يَكْفِينِيَ اللَّهُ بِكَمَالِ الْقَلْبِ ", "وَ أَمَّا إِذَا أَبَيْتُمَا بِأَنِّي أَدْعُو اللَّهَ فَلَا تَجْزَعَا مِنْ أَنْ يَدْعُوَ عَلَيْكُمَا رَجُلٌ سَاحِرٌ مِنْ قَوْمٍ سَحَرَةٍ زَعَمْتُمَا اللَّهُمَّ أَقْعِصِ الزُّبَيْرَ بِشَرِّ قِتْلَةٍ وَ اسْفِكْ دَمَهُ عَلَى ضَلَالَةٍ وَ عَرِّفْ طَلْحَةَ الْمَذَلَّةَ وَ ادَّخِرْ لَهُمَا فِي الْآخِرَةِ شَرّاً مِنْ ذَلِكَ إِنْ كَانَا ظَلَمَانِي وَ افْتَرَيَا عَلَيَّ وَ كَتَمَا شَهَادَتَهُمَا وَ عَصَيَاكَ وَ عَصَيَا رَسُولَكَ فِيَّ قُلْ آمِينَ قَالَ خِدَاشٌ آمِينَ ", "ثُمَّ قَالَ خِدَاشٌ لِنَفْسِهِ وَ اللَّهِ مَا رَأَيْتُ لِحْيَةً قَطُّ أَبْيَنَ خَطَأً مِنْكَ حَامِلَ حُجَّةٍ يَنْقُضُ بَعْضُهَا بَعْضاً لَمْ يَجْعَلِ اللَّهُ لَهَا مِسَاكاً أَنَا أَبْرَأُ إِلَى اللَّهِ مِنْهُمَا قَالَ عَلِيٌّ ( عليه السلام ) ارْجِعْ إِلَيْهِمَا وَ أَعْلِمْهُمَا مَا قُلْتُ قَالَ لَا وَ اللَّهِ حَتَّى تَسْأَلَ اللَّهَ أَنْ يَرُدَّنِي إِلَيْكَ عَاجِلًا وَ أَنْ يُوَفِّقَنِي لِرِضَاهُ فِيكَ فَفَعَلَ فَلَمْ يَلْبَثْ أَنِ انْصَرَفَ وَ قُتِلَ مَعَهُ يَوْمَ الْجَمَلِ رَحِمَهُ اللَّهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim Bin Hashim, from his father, from Ibn Mahboub, from Salam Bin Abdullah and Muhammad Bin Al Hassan and Ali Bin Muhammad, from Sahl bin Ziyad and Abu Ali Al Ashary, from Muhammad Bin Hassan, altogether from Muhammad Bin Ali, from Ali Bin Asbat, from Salam Bin Abdullah Al Hashimy who said, ‘Muhammad Bin Ali Said, and he had heard it from him, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Talha and Al-Zubeyr sent a man from (the Clan of) Abdul Qays, called Khidash, to Amir Al-Momineen<sup>asws</sup>, and they both said to him, ‘We are sending you to a <span style=\"text-decoration: underline\">tall</span> man whom we recognise him<sup>asws</sup> and his<sup>asws</sup> family with the sorcery and the soothsaying, and you are the most reliable of the ones in our presence from ourselves to refrain from that, and that you should argue (against) him<sup>asws</sup> from us until you pause upon a known matter.", "And know, he<sup>asws</sup> is the greatest of the people in claims, therefore that should not break you from him<sup>asws</sup>; and from the doors (ways) with which he<sup>asws</sup> deceives the people with, are the food and the drinks, and the honey, and the oils, and that he<sup>asws</sup> isolates with the man. Therefore you should neither eat any food of his<sup>asws</sup> nor drink any drink of his<sup>asws</sup>, and do not touch any honey of his<sup>asws</sup>, nor oil, nor be alone with him<sup>asws</sup>, and be cautious of all of this from him<sup>asws</sup>, and go upon the Blessings of Allah<sup>azwj</sup>. ", "Therefore when you see him<sup>asws</sup>, so recite <span class=\"iTxt\">Ayat Al-Sakhra</span> (7:54) and you should seek Refuge with Allah<sup>azwj</sup> from his<sup>asws</sup> plots and the plots of the Satan<sup>la</sup>. So when you sit with him<sup>asws</sup>, so do not enable him<sup>asws</sup> from your vision, all of it, (make eye contact), nor be comfortable with him<sup>asws</sup>, then say to him<sup>asws</sup> that your brothers in the Religion and the two sons of your uncle among the relatives are both adjuring you<sup>asws</sup> of the cutting-off and are both saying to you<sup>asws</sup>, ‘Do you<sup>asws</sup> not know that we have both left the people for you<sup>asws</sup> and we opposed our clans regarding you<sup>asws</sup> since Allah<sup>azwj</sup> Mighty and Majestic Captured (the soul of) Muhammad<sup>saww</sup>? So when you<sup>asws</sup> attained the lowest of the achievements you<sup>asws</sup> wasted our sanctities and cut off our hopes. ", "Then you<sup>asws</sup> have seen our deeds regarding you<sup>asws</sup>, and our abilities upon the distancing from you<sup>asws</sup> and capacity of the land (acquiring vast land) without you<sup>asws</sup>, and that the one who has taken you<sup>asws</sup> away from us and from our help is less for you<sup>asws</sup> in benefit and weaker in defending you<sup>asws</sup> than we are, and the morning has clarified to the two eyes. And there has reached us from you<sup>asws</sup>, your<sup>asws</sup> violations to us and your<sup>asws</sup> supplicating against us. So what is that which carried you<sup>asws</sup> upon that, for we have seen that you<sup>asws</sup> are the bravest of the horsemen of the Arabs. Are you taking cursing us as a Religion, and are you<sup>asws</sup> viewing that, that would break us from you<sup>asws</sup>?’ ", "So when Khidash came over to Amir Al-Momineen<sup>asws</sup>, he did what the two had instructed him with. So when Ali<sup>asws</sup> looked at him, and he was whispering to himself, he<sup>asws</sup> laughed and said: ‘Over here, O brother (of the Clan of) Abd Qays!’, and he<sup>asws</sup> gestured to him to a seat near to him<sup>asws</sup>. He said, ‘The place is wide enough, I want to deliver a message to you<sup>asws</sup>’. He<sup>asws</sup> said: But, eat and drink and loosen your clothes and apply oil, then deliver your message. Stand, O Qanbar, and lodge him!’ He said, ‘And there is no need with me to anything from what you<sup>asws</sup> mentioned’. He<sup>asws</sup> said: ‘So I<sup>asws</sup> shall be alone with you’. He said, ‘Every secret is public to me’. ", "He<sup>asws</sup> said: ‘So I adjure you with Allah<sup>azwj</sup> Who is closer to you than yourself as a barrier between you and your heart. The One<sup>azwj</sup> Who Knows the deception of the eyes and what the chests conceal. Did Al-Zubeyr come to you with what you I<sup>asws</sup> presented to you?’ He said, ‘O Allah<sup>azwj</sup>, yes’. He<sup>asws</sup> said: ‘If you had concealed after my<sup>asws</sup> asking you, your eyesight would not have returned to you. So I<sup>asws</sup> adjure you with Allah<sup>azwj</sup>! Did he teach you word you should be saying when you end up to me<sup>asws</sup>?’ He said, ‘O Allah<sup>azwj</sup>, yes’. Ali<sup>asws</sup> said: ‘<span class=\"iTxt\">Ayat Al-Sakhra</span> (7:54)?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘So recite it’. So he recited it and Ali<sup>asws</sup> went on repeating it, and making him repeating it, and correcting upon him when he erred, until when he had recited it seventy times, the man said, ‘What is the reason of Amir Al-Momineen<sup>asws</sup> instructing him with repeating it seventy times?’ ", "Then he<sup>asws</sup> said to him: ‘Does your heart find the comfort?’ He said, ‘Yes, by the One<sup>azwj</sup> in Whose Hand is my soul’. He<sup>asws</sup> said: ‘So what did they both say to you?’ So he informed him<sup>asws</sup>. So he<sup>asws</sup> said to him: ‘Say to both of them, ‘Both your speeches suffice as a proof against you, but Allah<sup>azwj</sup> does not Guide the unjust people. You are both claiming that you are my<sup>asws</sup> brethren in the Religion and sons of my<sup>asws</sup> uncle regarding the lineage. So as for the lineage, so I<sup>asws</sup> cannot deny it and even though the lineage was cut-off, except what Allah<sup>azwj</sup> has Linked it with Al-Islam. ", "And as for your words that you are my<sup>asws</sup> brothers in Religion, so if you are truthful, so it was the Book of Allah<sup>azwj</sup> Mighty and Majestic which the two of you separated from and you disobeyed His<sup>azwj</sup> Command by your deeds regarding your brother<sup>asws</sup> in the Religion or else so you have both lied and forged by your claims that you are my<sup>asws</sup> brothers in the Religion.  ", "And as for your separating from the people since Allah<sup>azwj</sup> Captured (the soul of ) Muhammad<sup>saww</sup>, so if your separation was with Truth, so you have both broken that Truth by separating from me<sup>asws</sup> later one, and if your separation from them was with falsehood, so the sin of that falsehood has occurred upon you both, along with the new events which you two invented, along with that your dealing with your separation from the people did not happen except due to the greed of the world which you both desired, and these are your words, ‘You<sup>asws</sup> cut-off our hopes’, not faulting me of anything from my<sup>asws</sup> Religion, by the Praise of Allah<sup>azwj</sup>. ", "And as for that which turned me<sup>asws</sup> from maintaining relationships with you two, so it is that which turned you from the Truth and carried you upon loosening from your reins just as the stubborn animal loosens its reins. And He<sup>azwj</sup> is my<sup>asws</sup> Lord<sup>azwj</sup>. I<sup>asws</sup> do not associate anything with Him<sup>asws</sup>, therefore do not be saying, ‘He<sup>asws</sup> is of less benefits and weaker in defence’, for you would be deserving of the label of <span class=\"iTxt\">Shirk</span> (Association with Allah<sup>azwj</sup>) and along with the (label of) hypocrisy. ", "And as for your words that I<sup>asws</sup> am the bravest of the horsemen of the Arabs and your fleeing from my<sup>asws</sup> curse and my<sup>asws</sup> supplication, so for every stance there is a deed.  When the spears clash and the manes of the cavalry horses toss about and your chests fill up with your fears, so that is when Allah<sup>azwj</sup> Suffices me<sup>asws</sup> with the perfection of the heart. ", "And as for when you two disdained me<sup>asws</sup> from supplicating to Allah<sup>azwj</sup>, so you should not be panicking if a sorcerer man were to supplicate against you from the people of the sorcery which you two are claiming as. O Allah<sup>azwj</sup>! Chastise Al-Zubeyr with the most evil of killings and Shed his blood upon straying, and Make Talha to know the disgrace, and Hoard for the two of them in the Hereafter more evil than that, if they have both oppressed me and forged upon me, and concealed their testimonies, and disobeyed You<sup>azwj</sup> and disobeyed Your<sup>azwj</sup> Rasool<sup>saww</sup> regarding me<sup>asws</sup>!. Say Ameen!’ Khidash said, ‘Ameen!’. ", "The Khidash said to himself, ‘By Allah<sup>azwj</sup>! I have not seen a beard (bearded man) at all with clearer censures than you<sup>asws</sup>, bearing arguments, parts of which break the other parts. Allah<sup>azwj</sup> has not Made greed to be in it. By Allah<sup>azwj</sup> , I hereby disavow from both of them’. Ali<sup>asws</sup> said: ‘Return to them and let them know of what you said’. He said, ‘No, by Allah<sup>azwj</sup>, not until you<sup>asws</sup> ask Allah<sup>azwj</sup> that he return me back to you<sup>asws</sup> quickly and that He<sup>azwj</sup> should Incline me to His<sup>azwj</sup> Pleasure regarding you<sup>asws</sup>’. So he<sup>asws</sup> did, and it was not long before he left and was killed with him<sup>asws</sup> (fighting against his<sup>asws</sup> enemies) on the Day of the Camel (the battle of Al-Basra). May Allah<sup>azwj</sup> have Mercy on him’."]}}, {"index": 918, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:2", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ حَسَّانَ جَمِيعاً عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ نَصْرِ بْنِ مُزَاحِمٍ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ جَرَّاحِ بْنِ عَبْدِ اللَّهِ عَنْ رَافِعِ بْنِ سَلَمَةَ قَالَ كُنْتُ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ صَلَوَاتُ اللَّهِ عَلَيْهِ يَوْمَ النَّهْرَوَانِ فَبَيْنَا عَلِيٌّ ( عليه السلام ) جَالِسٌ إِذْ جَاءَ فَارِسٌ فَقَالَ السَّلَامُ عَلَيْكَ يَا عَلِيُّ فَقَالَ لَهُ عَلِيٌّ ( عليه السلام ) وَ عَلَيْكَ السَّلَامُ مَا لَكَ ثَكِلَتْكَ أُمُّكَ لَمْ تُسَلِّمْ عَلَيَّ بِإِمْرَةِ الْمُؤْمِنِينَ ", "قَالَ بَلَى سَأُخْبِرُكَ عَنْ ذَلِكَ كُنْتُ إِذْ كُنْتَ عَلَى الْحَقِّ بِصِفِّينَ فَلَمَّا حَكَّمْتَ الْحَكَمَيْنِ بَرِئْتُ مِنْكَ وَ سَمَّيْتُكَ مُشْرِكاً فَأَصْبَحْتُ لَا أَدْرِي إِلَى أَيْنَ أَصْرِفُ وَلَايَتِي وَ اللَّهِ لَأَنْ أَعْرِفَ هُدَاكَ مِنْ ضَلَالَتِكَ أَحَبُّ إِلَيَّ مِنَ الدُّنْيَا وَ مَا فِيهَا فَقَالَ لَهُ عَلِيٌّ ( عليه السلام ) ثَكِلَتْكَ أُمُّكَ قِفْ مِنِّي قَرِيباً أُرِيكَ عَلَامَاتِ الْهُدَى مِنْ عَلَامَاتِ الضَّلَالَةِ فَوَقَفَ الرَّجُلُ قَرِيباً مِنْهُ ", "فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ أَقْبَلَ فَارِسٌ يَرْكُضُ حَتَّى أَتَى عَلِيّاً ( عليه السلام ) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَبْشِرْ بِالْفَتْحِ أَقَرَّ اللَّهُ عَيْنَكَ قَدْ وَ اللَّهِ قُتِلَ الْقَوْمُ أَجْمَعُونَ فَقَالَ لَهُ مِنْ دُونِ النَّهَرِ أَوْ مِنْ خَلْفِهِ قَالَ بَلْ مِنْ دُونِهِ فَقَالَ كَذَبْتَ وَ الَّذِي فَلَقَ الْحَبَّةَ وَ بَرَأَ النَّسَمَةَ لَا يَعْبُرُونَ أَبَداً حَتَّى يُقْتَلُوا فَقَالَ الرَّجُلُ فَازْدَدْتُ فِيهِ بَصِيرَةً", "فَجَاءَ آخَرُ يَرْكُضُ عَلَى فَرَسٍ لَهُ فَقَالَ لَهُ مِثْلَ ذَلِكَ فَرَدَّ عَلَيْهِ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مِثْلَ الَّذِي رَدَّ عَلَى صَاحِبِهِ قَالَ الرَّجُلُ الشَّاكُّ وَ هَمَمْتُ أَنْ أَحْمِلَ عَلَى عَلِيٍّ ( عليه السلام ) فَأَفْلَقَ هَامَتَهُ بِالسَّيْفِ ", "ثُمَّ جَاءَ فَارِسَانِ يَرْكُضَانِ قَدْ أَعْرَقَا فَرَسَيْهِمَا فَقَالَا أَقَرَّ اللَّهُ عَيْنَكَ يَا أَمِيرَ الْمُؤْمِنِينَ أَبْشِرْ بِالْفَتْحِ قَدْ وَ اللَّهِ قُتِلَ الْقَوْمُ أَجْمَعُونَ فَقَالَ عَلِيٌّ ( عليه السلام ) أَ مِنْ خَلْفِ النَّهَرِ أَوْ مِنْ دُونِهِ قَالَا لَا بَلْ مِنْ خَلْفِهِ إِنَّهُمْ لَمَّا اقْتَحَمُوا خَيْلَهُمُ النَّهْرَوَانَ وَ ضَرَبَ الْمَاءُ لَبَّاتِ خُيُولِهِمْ رَجَعُوا فَأُصِيبُوا فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) صَدَقْتُمَا فَنَزَلَ الرَّجُلُ عَنْ فَرَسِهِ فَأَخَذَ بِيَدِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ بِرِجْلِهِ فَقَبَّلَهُمَا فَقَالَ عَلِيٌّ ( عليه السلام ) هَذِهِ لَكَ آيَةٌ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad and Abu Ali Al Ashary, from Muhammad Bin Hassan, altogether from Muhammad Bin Ali, from Nasr Bin Muzahim, from Amro Bin Saeed, from Jarrah Bin Abdullah, from Rafie Bin Salama who said, ", "‘I was with Ali<sup>asws </sup>Bin Abu Talib<sup>asws</sup> on the Day of (the battle of) Al-Nahrawan. So while we were seated with Ali<sup>azwj</sup>, a horseman came over and he said, ‘Greetings be upon you<sup>asws</sup>, O Ali<sup>asws</sup>!’ So Ali<sup>asws</sup> said to him: ‘And upon you be the greetings! What is the matter with you, may your mother be bereft of you, you are not greeting upon me<sup>asws</sup> as Amir Al-Momineen?’ ", "He said, ‘Yes, I shall inform you<sup>asws</sup> about that. I was, when you<sup>asws</sup> were upon the Truth at (the battle of) Siffeen. So when you<sup>asws</sup> made two judges to judge, I disavowed from you<sup>asws</sup> and called you<sup>asws</sup> a Polytheist. So I have become such that I do not know to where I should expend my guardianship. By Allah<sup>azwj</sup>! If I could recognise your<sup>asws</sup> Guidance from your<sup>asws</sup> straying, it would be more beloved to me than the world and whatever is in it’. So Ali<sup>asws</sup> said to him: ‘May your mother be bereft of you! Pause closer to me<sup>asws</sup> and I<sup>asws</sup> shall show you signs of the Guidance from the signs of the straying’. So the man paused near to him<sup>asws</sup>’. ", "So while he was like that when a horseman came running until he came over to Ali<sup>asws</sup> and he said, ‘O Amir Al-Momineen<sup>asws</sup>! Receive the good news of the victory. Allah<sup>azwj</sup> had Delighted your<sup>asws</sup> eyes. By Allah<sup>azwj</sup>! The group of people have been killed, altogether!’ So he<sup>asws</sup> said to him: ‘From besides the river or from behind it?’ He said, ‘But, from besides it’. So he<sup>asws</sup> said: ‘You are lying! By the One<sup>azwj</sup> Whom Splits the seed and Forms the person (in the womb)! They will not be crossing the river ever, until they are killed’. So the man (first horseman) said, ‘So my insight has increased in it’. ", "So another one came to him<sup>asws</sup> galloping upon a horse, similar to that. So Amir Al-Momineen<sup>asws</sup> responded to him similar to that which he<sup>asws</sup> had responded to his companions. The man (first horseman) said, ‘(At that point) I doubted and thought of attacking upon Ali<sup>asws</sup> and split his<sup>asws</sup> head with the sword’.", "Then two horse-men came galloping, their two horses perspiring, and they both said, ‘Allah<sup>azwj</sup> has Delighted your<sup>asws</sup> eyes, O Amir Al-Momineen<sup>asws</sup>! Receive good news of the victory. By Allah<sup>azwj</sup>! The group of the people have been killed, altogether’. So Ali<sup>asws</sup> said: ‘Was it from behind the river or from besides it?’ They said, ‘No, but from behind it. They, when they stormed their horses into the Nahrwan and the water struck the manes of their cavalry horses, they returned, so they were hit’. So Amir Al-Momineen<sup>asws</sup> said: ‘You two are speaking the truth’. So the man descended from his horse and grabbed the hand of Amir Al Momineen<sup>asws</sup> and his<sup>asws</sup> leg and kissed them. So Ali<sup>asws</sup> said: ‘This is a sign for you!’"]}}, {"index": 919, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:3", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَبِي عَلِيٍّ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ مُوسَى بْنِ جَعْفَرٍ عَنْ أَحْمَدَ بْنِ الْقَاسِمِ الْعِجْلِيِّ عَنْ أَحْمَدَ بْنِ يَحْيَى الْمَعْرُوفِ بِكُرْدٍ عَنْ مُحَمَّدِ بْنِ خُدَاهِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ هَاشِمٍ عَنْ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو الْخَثْعَمِيِّ عَنْ حَبَابَةَ الْوَالِبِيَّةِ قَالَتْ رَأَيْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فِي شُرْطَةِ الْخَمِيسِ وَ مَعَهُ دِرَّةٌ لَهَا سَبَابَتَانِ يَضْرِبُ بِهَا بَيَّاعِي الْجِرِّيِّ وَ الْمَارْمَاهِي وَ الزِّمَّارِ وَ يَقُولُ لَهُمْ يَا بَيَّاعِي مُسُوخِ بَنِي إِسْرَائِيلَ وَ جُنْدِ بَنِي مَرْوَانَ فَقَامَ إِلَيْهِ فُرَاتُ بْنُ أَحْنَفَ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ وَ مَا جُنْدُ بَنِي مَرْوَانَ قَالَ فَقَالَ لَهُ أَقْوَامٌ حَلَقُوا اللِّحَى وَ فَتَلُوا الشَّوَارِبَ فَمُسِخُوا", "فَلَمْ أَرَ نَاطِقاً أَحْسَنَ نُطْقاً مِنْهُ ثُمَّ اتَّبَعْتُهُ فَلَمْ أَزَلْ أَقْفُو أَثَرَهُ حَتَّى قَعَدَ فِي رَحَبَةِ الْمَسْجِدِ فَقُلْتُ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ مَا دَلَالَةُ الْإِمَامَةِ يَرْحَمُكَ اللَّهُ قَالَتْ فَقَالَ ائْتِينِي بِتِلْكِ الْحَصَاةِ وَ أَشَارَ بِيَدِهِ إِلَى حَصَاةٍ فَأَتَيْتُهُ بِهَا فَطَبَعَ لِي فِيهَا بِخَاتَمِهِ ثُمَّ قَالَ لِي يَا حَبَابَةُ إِذَا ادَّعَى مُدَّعٍ الْإِمَامَةَ فَقَدَرَ أَنْ يَطْبَعَ كَمَا رَأَيْتِ فَاعْلَمِي أَنَّهُ إِمَامٌ مُفْتَرَضُ الطَّاعَةِ وَ الْإِمَامُ لَا يَعْزُبُ عَنْهُ شَيْ‏ءٌ يُرِيدُهُ ", "قَالَتْ ثُمَّ انْصَرَفْتُ حَتَّى قُبِضَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَجِئْتُ إِلَى الْحَسَنِ ( عليه السلام ) وَ هُوَ فِي مَجْلِسِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ النَّاسُ يَسْأَلُونَهُ فَقَالَ يَا حَبَابَةُ الْوَالِبِيَّةُ فَقُلْتُ نَعَمْ يَا مَوْلَايَ فَقَالَ هَاتِي مَا مَعَكِ قَالَ فَأَعْطَيْتُهُ فَطَبَعَ فِيهَا كَمَا طَبَعَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام )", "قَالَتْ ثُمَّ أَتَيْتُ الْحُسَيْنَ ( عليه السلام ) وَ هُوَ فِي مَسْجِدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَرَّبَ وَ رَحَّبَ ثُمَّ قَالَ لِي إِنَّ فِي الدَّلَالَةِ دَلِيلًا عَلَى مَا تُرِيدِينَ أَ فَتُرِيدِينَ دَلَالَةَ الْإِمَامَةِ فَقُلْتُ نَعَمْ يَا سَيِّدِي فَقَالَ هَاتِي مَا مَعَكِ فَنَاوَلْتُهُ الْحَصَاةَ فَطَبَعَ لِي فِيهَا", "قَالَتْ ثُمَّ أَتَيْتُ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) وَ قَدْ بَلَغَ بِيَ الْكِبَرُ إِلَى أَنْ أُرْعِشْتُ وَ أَنَا أَعُدُّ يَوْمَئِذٍ مِائَةً وَ ثَلَاثَ عَشْرَةَ سَنَةً فَرَأَيْتُهُ رَاكِعاً وَ سَاجِداً وَ مَشْغُولًا بِالْعِبَادَةِ فَيَئِسْتُ مِنَ الدَّلَالَةِ فَأَوْمَأَ إِلَيَّ بِالسَّبَّابَةِ فَعَادَ إِلَيَّ شَبَابِي قَالَتْ فَقُلْتُ يَا سَيِّدِي كَمْ مَضَى مِنَ الدُّنْيَا وَ كَمْ بَقِيَ فَقَالَ أَمَّا مَا مَضَى فَنَعَمْ وَ أَمَّا مَا بَقِيَ فَلَا قَالَتْ ثُمَّ قَالَ لِي هَاتِي مَا مَعَكِ فَأَعْطَيْتُهُ الْحَصَاةَ فَطَبَعَ لِي فِيهَا ", "ثُمَّ أَتَيْتُ أَبَا جَعْفَرٍ ( عليه السلام ) فَطَبَعَ لِي فِيهَا ثُمَّ أَتَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَطَبَعَ لِي فِيهَا ثُمَّ أَتَيْتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) فَطَبَعَ لِي فِيهَا ثُمَّ أَتَيْتُ الرِّضَا ( عليه السلام ) فَطَبَعَ لِي فِيهَا ", "وَ عَاشَتْ حَبَابَةُ بَعْدَ ذَلِكَ تِسْعَةَ أَشْهُرٍ عَلَى مَا ذَكَرَ مُحَمَّدُ بْنُ هِشَامٍ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Abu Ali Muhammad Bin Isnail Bin Musa Bin Ja’far, from Ahmad Bin Al Qasim Al Ijaly, from Ahmad Bin Yahya know as Kurdi, from Muhammad Bin Khudahy, from Abdullah Bin Ayoub, from Abdullah Bin Hashim, from Abdul Kareem Bin Amro Al Khash’amy, from Hababat Al Wailibiya who said, ", "‘I saw Amir Al-Momineen<sup>asws</sup> among the elite police and with him was a whip of his<sup>asws</sup> having two branches to it. He<sup>asws</sup> was striking with it upon the sellers of the eels, and the moray and the angles (Prohibited fishes), and he<sup>asws</sup> was saying to them: ‘O sellers of the metamorphosed Children of Israel and the armies of the Clan of Marwan!’ So Furat Bin Akhnaf stood up to him<sup>asws</sup> and said, ‘O Amir Al-Momineen<sup>asws</sup>! What is the army of the Clan of Marwan?’ So he<sup>asws</sup> said to him: ‘People who (used to) shave off the beards and twiddle the moustaches, so they were metamorphosed’. ", "So I had not seen a speaker speaking better than him<sup>asws</sup>. Then I followed him<sup>asws</sup> and did not cease missing his<sup>asws</sup> footsteps until he<sup>asws</sup> sat in an open space of the Masjid. So I said to him<sup>asws</sup>, ‘O Amir Al-Momineen<sup>asws</sup>! What is the evidence of the Imamate? May Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>!’ So he<sup>asws</sup> said: ‘Bring to me<sup>asws</sup> that pebble’, and he<sup>asws</sup> gestured by his<sup>asws</sup> hand to a pebble. So I came over to him<sup>asws</sup> with it, and he<sup>asws</sup> imprinted in it with his<sup>asws</sup> ring for me, then said to me: ‘O Hababa! Whenever a claimant claims the Imamate and he<sup>asws</sup> is able to imprint just as you saw, so know that he<sup>asws</sup> is an Imam of Obligatory obedience, and the Imam<sup>asws</sup> is such that nothing escapes from him<sup>asws</sup> which he<sup>asws</sup> wants’. ", "She said, ‘Then I left, until such times as Amir Al-Momineen<sup>asws</sup> passed away. So I went over to Al-Hassan<sup>asws</sup>, and he<sup>asws</sup> was in the seat of Amir Al-Momineen<sup>asws</sup> and the people were asking him<sup>asws</sup>. So he<sup>asws</sup> said: ‘O Hababa Al-Wailibiya!’ So I said, ‘Yes, my Master<sup>asws</sup>!’ So he<sup>asws</sup> said: ‘Give me what is with you’. So I gave it (the imprinted) pebble, and he<sup>asws</sup> imprinted in it just as Amir Al-Momineen<sup>asws</sup> had imprinted (beforehand). ", "She said, ‘Then I went over to Al-Husayn<sup>asws</sup> and he<sup>asws</sup> was in the Masjid of Rasool-Allah<sup>saww</sup>. So he<sup>asws</sup> told me to come near and welcomed me, then said to me: ‘Regarding the evidence upon what you want, are you (still) wanting the evidence of the Imamate?’ So I said, ‘Yes, O my Chief!’ So he<sup>asws</sup> said: ‘Give me what is with you’. So I gave the pebble to him<sup>asws</sup>, and he<sup>asws</sup> imprinted in it.", "She said, ‘Then I went over to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and there had reached with me the age that I was shaking, and I had counted that in those days I was one hundred and thirteen years old. So I saw him<sup>asws</sup> performing Ruk’u and Sajda, and was pre-occupied with the worship, so I despaired from the evidence. So he<sup>asws</sup> gestures towards me with the index finger, so my youth returned to me. So I said, ‘My Chief! How much from the world has passed and how much remains?’ So he<sup>asws</sup> said: ‘As for what has passed, so yes, and as for what remains, so no’. Then he<sup>asws</sup> said to me: ‘Give me what is with you’. So I gave the pebble to him, and he<sup>asws</sup> imprinted in it for me.", "Then I went over to Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> imprinted in it for me. Then I went over to Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> imprinted in it for me. Then I went over to Abu Al-Hassan Musa<sup>asws</sup>, so he<sup>asws</sup> printed in it for me. Then I went over to Al-Reza<sup>asws</sup>, so he<sup>asws</sup> imprinted in it for me’. ", "And Hababa lived after that for nine months upon what Muhammad Bin Hisham mentioned."]}}, {"index": 920, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:4", "text": ["مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ النَّخَعِيِّ عَنْ أَبِي هَاشِمٍ دَاوُدَ بْنِ الْقَاسِمِ الْجَعْفَرِيِّ قَالَ كُنْتُ عِنْدَ أَبِي مُحَمَّدٍ ( عليه السلام ) فَاسْتُؤْذِنَ لِرَجُلٍ مِنْ أَهْلِ الْيَمَنِ عَلَيْهِ فَدَخَلَ رَجُلٌ عَبْلٌ طَوِيلٌ جَسِيمٌ فَسَلَّمَ عَلَيْهِ بِالْوَلَايَةِ فَرَدَّ عَلَيْهِ بِالْقَبُولِ وَ أَمَرَهُ بِالْجُلُوسِ فَجَلَسَ مُلَاصِقاً لِي فَقُلْتُ فِي نَفْسِي لَيْتَ شِعْرِي مَنْ هَذَا ", "قَالَ أَبُو مُحَمَّدٍ ( عليه السلام ) هَذَا مِنْ وُلْدِ الْأَعْرَابِيَّةِ صَاحِبَةِ الْحَصَاةِ الَّتِي طَبَعَ آبَائِي ( عليهم السلام ) فِيهَا بِخَوَاتِيمِهِمْ فَانْطَبَعَتْ وَ قَدْ جَاءَ بِهَا مَعَهُ يُرِيدُ أَنْ أَطْبَعَ فِيهَا ثُمَّ قَالَ هَاتِهَا فَأَخْرَجَ حَصَاةً وَ فِي جَانِبٍ مِنْهَا مَوْضِعٌ أَمْلَسُ فَأَخَذَهَا أَبُو مُحَمَّدٍ ( عليه السلام ) ثُمَّ أَخْرَجَ خَاتَمَهُ فَطَبَعَ فِيهَا فَانْطَبَعَ فَكَأَنِّي أَرَى نَقْشَ خَاتَمِهِ السَّاعَةَ الْحَسَنُ بْنُ عَلِيٍّ فَقُلْتُ لِلْيَمَانِيِّ رَأَيْتَهُ قَبْلَ هَذَا قَطُّ", "فقَالَ لَا وَ اللَّهِ وَ إِنِّي لَمُنْذُ دَهْرٍ حَرِيصٌ عَلَى رُؤْيَتِهِ حَتَّى كَانَ السَّاعَةَ أَتَانِي شَابٌّ لَسْتُ أَرَاهُ فَقَالَ لِي قُمْ فَادْخُلْ فَدَخَلْتُ ثُمَّ نَهَضَ الْيَمَانِيُّ وَ هُوَ يَقُولُ ", "رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ عَلَيْكُمْ أَهْلَ الْبَيْتِ ذُرِّيَّةً بَعْضُهَا مِنْ بَعْضٍ أَشْهَدُ بِاللَّهِ إِنَّ حَقَّكَ لَوَاجِبٌ كَوُجُوبِ حَقِّ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ الْأَئِمَّةِ مِنْ بَعْدِهِ صَلَوَاتُ اللَّهِ عَلَيْهِمْ أَجْمَعِينَ ثُمَّ مَضَى فَلَمْ أَرَهُ بَعْدَ ذَلِكَ", "قَالَ إِسْحَاقُ قَالَ أَبُو هَاشِمٍ الْجَعْفَرِيُّ وَ سَأَلْتُهُ عَنِ اسْمِهِ فَقَالَ اسْمِي مِهْجَعُ بْنُ الصَّلْتِ بْنِ عُقْبَةَ بْنِ سِمْعَانَ بْنِ غَانِمِ ابْنِ أُمِّ غَانِمٍ وَ هِيَ الْأَعْرَابِيَّةُ الْيَمَانِيَّةُ صَاحِبَةُ الْحَصَاةِ الَّتِي طَبَعَ فِيهَا أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ السِّبْطُ إِلَى وَقْتِ أَبِي الْحَسَنِ ( عليه السلام ) ."], "translations": {"en.hubeali": ["Muhammad Bin Abu Abdullah and Ali Bin Muhammad, from Is’haq Bin Muhammad Al Nakhaie, from Abu Hashim Dawood Bin Al Qasim Al Ja’fary who said, ", "‘I was in the presence of Abu Muhammad<sup>asws</sup> and permission was given for a man from the people of Al-Yemen to see him<sup>asws</sup>. So there entered a man of plump and tall figure. He greeted upon him<sup>asws</sup> with ‘بِالْوَلَايَةِ’ the Wilayah, so he<sup>asws</sup> returned upon him with the acceptance and instructed him with being seated. So he sat down adjacent to me. So I said within myself, ‘I wish I was aware of who this one is’.", "So Abu Muhammad<sup>asws</sup> said: ‘This is from the children of the Bedouin woman, the owner of the pebble which my<sup>asws</sup> forefathers<sup>asws</sup> had imprinted therein with their<sup>asws</sup> insignias, so it is engraved, and he has come with it intending that I<sup>asws</sup> should imprint (my<sup>asws</sup> insignia) in it’. Then he<sup>asws</sup> said: ‘Give it!’ So he brought out a pebble and in one side of it was a smooth place. Abu Muhammad<sup>asws</sup> took it, then brought out his<sup>asws</sup> seal and imprinted in it, and it was engraved, and it was as if I could see the engraving at the moment of the seal of Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>. So I said to the Yemeni, ‘Had you seen him (Abu Muhammad<sup>asws</sup>) before this, at all?’ ", "So he said, ‘No, by Allah<sup>azwj</sup>, and I have been coveting for a long time upon seeing him<sup>asws</sup>, until it was the time when a youth came to me whom I had not seen, so he said to me, ‘Arise, and come in’. So I entered here’. Then the Yameni got up and he was saying, ", "‘May Allah<sup>azwj</sup> have Mercy upon you<sup>asws</sup> all, the People<sup>asws</sup> of the Household, <span class=\"ibTxt\">[3:34] Offspring of one from the other</span>. I testify with Allah<sup>azwj</sup> that your<sup>asws</sup> right is an Obligatory like the Obligation of the right of Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup> from after him<sup>asws</sup>, may the <span class=\"iTxt\">Salawat</span> of Allah<sup>azwj</sup> be upon them<sup>asws</sup> altogether’. Then he left and I did not see him after that. ", "Is’haq said, ‘Abu Hisham Al-Ja’fary said, ‘And I asked him about his name, so he said, ‘My name is Mijam Bin Al-Salt Bin Uqba Bin Sim’an Bin Ghanim Ibn Umm Ghanim, and she was the Yemenite Bedouin woman, the owner of the pebble in which Amir Al-Momineen<sup>asws</sup> and his<sup>asws</sup> descendants<sup>asws</sup> had imprinted, up to the time of Abu Al-Hassan<sup>asws</sup> (8<sup>th</sup> Imam<sup>asws</sup>)’."]}}, {"index": 921, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ وَ زُرَارَةَ جَمِيعاً عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا قُتِلَ الْحُسَيْنُ  ( عليه السلام ) أَرْسَلَ مُحَمَّدُ بْنُ الْحَنَفِيَّةِ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) فَخَلَا بِهِ فَقَالَ لَهُ يَا ابْنَ أَخِي قَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) دَفَعَ الْوَصِيَّةَ وَ الْإِمَامَةَ مِنْ بَعْدِهِ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ثُمَّ إِلَى الْحَسَنِ ( عليه السلام ) ثُمَّ إِلَى الْحُسَيْنِ ( عليه السلام ) وَ قَدْ قُتِلَ أَبُوكَ رَضِيَ اللَّهُ عَنْهُ وَ صَلَّى عَلَى رُوحِهِ وَ لَمْ يُوصِ وَ أَنَا عَمُّكَ وَ صِنْوُ أَبِيكَ وَ وِلَادَتِي مِنْ عَلِيٍّ ( عليه السلام ) فِي سِنِّي وَ قَدِيمِي أَحَقُّ بِهَا مِنْكَ فِي حَدَاثَتِكَ فَلَا تُنَازِعْنِي فِي الْوَصِيَّةِ وَ الْإِمَامَةِ وَ لَا تُحَاجَّنِي", "فَقَالَ لَهُ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَا عَمِّ اتَّقِ اللَّهَ وَ لَا تَدَّعِ مَا لَيْسَ لَكَ بِحَقٍّ إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجَاهِلِينَ إِنَّ أَبِي يَا عَمِّ صَلَوَاتُ اللَّهِ عَلَيْهِ أَوْصَى إِلَيَّ قَبْلَ أَنْ يَتَوَجَّهَ إِلَى الْعِرَاقِ وَ عَهِدَ إِلَيَّ فِي ذَلِكَ قَبْلَ أَنْ يُسْتَشْهَدَ بِسَاعَةٍ وَ هَذَا سِلَاحُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عِنْدِي فَلَا تَتَعَرَّضْ لِهَذَا فَإِنِّي أَخَافُ عَلَيْكَ نَقْصَ الْعُمُرِ وَ تَشَتُّتَ الْحَالِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ جَعَلَ الْوَصِيَّةَ وَ الْإِمَامَةَ فِي عَقِبِ الْحُسَيْنِ ( عليه السلام ) فَإِذَا أَرَدْتَ أَنْ تَعْلَمَ ذَلِكَ فَانْطَلِقْ بِنَا إِلَى الْحَجَرِ الْأَسْوَدِ حَتَّى نَتَحَاكَمَ إِلَيْهِ وَ نَسْأَلَهُ عَنْ ذَلِكَ ", "قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ كَانَ الْكَلَامُ بَيْنَهُمَا بِمَكَّةَ فَانْطَلَقَا حَتَّى أَتَيَا الْحَجَرَ الْأَسْوَدَ فَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ لِمُحَمَّدِ بْنِ الْحَنَفِيَّةِ ابْدَأْ أَنْتَ فَابْتَهِلْ إِلَى اللَّهِ عَزَّ وَ جَلَّ وَ سَلْهُ أَنْ يُنْطِقَ لَكَ الْحَجَرَ ثُمَّ سَلْ فَابْتَهَلَ مُحَمَّدٌ فِي الدُّعَاءِ وَ سَأَلَ اللَّهَ ثُمَّ دَعَا الْحَجَرَ فَلَمْ يُجِبْهُ فَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَا عَمِّ لَوْ كُنْتَ وَصِيّاً وَ إِمَاماً لَأَجَابَكَ", "قَالَ لَهُ مُحَمَّدٌ فَادْعُ اللَّهَ أَنْتَ يَا ابْنَ أَخِي وَ سَلْهُ فَدَعَا اللَّهَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) بِمَا أَرَادَ ثُمَّ قَالَ أَسْأَلُكَ بِالَّذِي جَعَلَ فِيكَ مِيثَاقَ الْأَنْبِيَاءِ وَ مِيثَاقَ الْأَوْصِيَاءِ وَ مِيثَاقَ النَّاسِ أَجْمَعِينَ لَمَّا أَخْبَرْتَنَا مَنِ الْوَصِيُّ وَ الْإِمَامُ بَعْدَ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام )", "قَالَ فَتَحَرَّكَ الْحَجَرُ حَتَّى كَادَ أَنْ يَزُولَ عَنْ مَوْضِعِهِ ثُمَّ أَنْطَقَهُ اللَّهُ عَزَّ وَ جَلَّ بِلِسَانٍ عَرَبِيٍّ مُبِينٍ فَقَالَ اللَّهُمَّ إِنَّ الْوَصِيَّةَ وَ الْإِمَامَةَ بَعْدَ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام ) إِلَى عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ وَ ابْنِ فَاطِمَةَ بِنْتِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ", "قَالَ فَانْصَرَفَ مُحَمَّدُ بْنُ عَلِيٍّ وَ هُوَ يَتَوَلَّى عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) .", "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ali Bin Raib, from Abu Ubeyda and Zurara altogether, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When Al-Husayn<sup>asws</sup> was killed, Muhammad Bin Hanafiyya sent a message to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>. So he<sup>asws</sup> isolated himself<sup>asws</sup> with him, and he said to him<sup>asws</sup>, ‘يَا ابْنَ أَخِي’ ‘O my nephew<sup>as</sup><sup>ws</sup>! You<sup>asws</sup> have known that Rasool-Allah<sup>saww</sup> handed over the successorship and the Imamate from after him<sup>saww</sup> to Amir Al-Momineen<sup>asws</sup>, then to Al-Hassan<sup>asws</sup>, then to Al-Husayn<sup>asws</sup>, and your<sup>asws</sup> father<sup>asws</sup> was killed, may Allah<sup>azwj</sup> be Pleased with him<sup>asws</sup> and Send <span class=\"iTxt\">Salawat</span> upon his<sup>asws</sup> soul, and he<sup>asws</sup> did not bequeath; and I am your<sup>asws</sup> uncle and equivalent to your<sup>asws</sup> father<sup>asws</sup>, and my birth is from Ali<sup>asws</sup>. With regards to my age and my precedence, I am more rightful with it than you<sup>asws</sup> are regarding your<sup>asws</sup> young age. Therefore, do not dispute with me regarding the successorship and the Imamate, nor argue with me’. ", "So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘O uncle! Fear Allah<sup>azwj</sup> and do not claim what isn’t for you by right. I<sup>asws</sup> hereby advise you not to become from the ignorant ones. O uncle! My<sup>asws</sup> father<sup>asws</sup>, may the <span class=\"iTxt\">Salawat</span> of Allah<sup>azwj</sup> be upon him<sup>asws</sup>, bequeathed to me<sup>asws</sup> before he<sup>asws</sup> headed towards Al-Iraq and covenanted to me<sup>asws</sup> regarding that before he<sup>asws</sup> was martyred, by some time, and these here are the weapons of Rasool-Allah<sup>saww</sup> with me<sup>asws</sup>. Therefore do not expose yourself to this matter, for I<sup>asws</sup> fear of a reduction of the life-span upon you and the difficult conditions. Allah<sup>azwj</sup> Mighty and Majestic Made the successorship and the Imamate to be in the posterity of Al-Husayn<sup>asws</sup>. Thus, if you intend to know that (to be a fact), so let us go to the Black Stone (Al-Hajr Al-Aswad) until it judges for us and we ask it about that’. ", "Abu Ja’far<sup>asws</sup> said: ‘And it was so that the speech between the two of them was at Makkah, and they both went until they came over to the Black Stone (Al-Hajr Al-Aswad). So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to Muhammad Bin Al-Hanafiyya: ‘You begin and beseech to Allah<sup>azwj</sup> Mighty and Majestic and ask Him<sup>azwj</sup> to Cause the Stone to Speak to you, then ask’. So Muhammad beseeched in the supplication and asked Allah<sup>azwj</sup>, then called out to the Stone. But it did not answer him. So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘O uncle! Had you been a successor<sup>asws</sup> and an Imam<sup>asws</sup>, it would have answered you’. ", "So Muhammad said to him<sup>asws</sup>, ‘So you<sup>asws</sup> supplicate to Allah<sup>azwj</sup>, O my ‘يَا ابْنَ أَخِي’ nephew<sup>asws</sup>, and ask Him<sup>azwj</sup>’. So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> supplicated to Allah<sup>azwj</sup> with what he<sup>asws</sup> intended, then said: ‘I<sup>asws</sup> ask you (Al-Hajr Al-Aswad), by the One<sup>azwj</sup> Who Made to be inside you the Covenant of the Prophets<sup>as</sup> and the Covenant of the succesors<sup>as</sup> and the Covenant of the people altogether, to inform us, who is the successor<sup>asws</sup> and the Imam<sup>asws</sup> after Al-Husayn Bin Ali<sup>asws</sup>?’ ", "He (Imam Baqir<sup>asws</sup>) said: ‘So the Stone moved until it almost fell from its place. Then Allah<sup>azwj</sup> Mighty and Majestic Caused it to speak in clear Arabic language, and it said: ‘O Allah<sup>azwj</sup>! The successorship and the Imamate after Al-Husayn Bin Ali<sup>asws</sup> it to Ali<sup>asws</sup> Bin Ali Husayn Bin Ali Bin Abu Talib<sup>asws</sup> and a son<sup>asws</sup> of the daughter<sup>asws</sup> of Rasool-Allah<sup>saww</sup>!’ ", "He (Imam Baqir<sup style=\"font-weight: normal\">asws</sup>) said: ‘So Muhammad Bin Ali (Al-Hanafiyya) left and he was acknowledging the Master-ship of Ali<sup style=\"font-weight: normal\">asws</sup> Bin Al-Husayn<sup style=\"font-weight: normal\">asws</sup>’. ", "<span style=\"font-size: small\">Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Zurara, </span>from Abu Ja’far<sup>asws</sup>, similar to it."]}}, {"index": 922, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:6", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ الْمُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ أَخْبَرَنِي سَمَاعَةُ بْنُ مِهْرَانَ قَالَ أَخْبَرَنِي الْكَلْبِيُّ النَّسَّابَةُ قَالَ دَخَلْتُ الْمَدِينَةَ وَ لَسْتُ أَعْرِفُ شَيْئاً مِنْ هَذَا الْأَمْرِ فَأَتَيْتُ الْمَسْجِدَ فَإِذَا جَمَاعَةٌ مِنْ قُرَيْشٍ فَقُلْتُ أَخْبِرُونِي عَنْ عَالِمِ أَهْلِ هَذَا الْبَيْتِ فَقَالُوا عَبْدُ اللَّهِ بْنُ الْحَسَنِ", "فَأَتَيْتُ مَنْزِلَهُ فَاسْتَأْذَنْتُ فَخَرَجَ إِلَيَّ رَجُلٌ ظَنَنْتُ أَنَّهُ غُلَامٌ لَهُ فَقُلْتُ لَهُ اسْتَأْذِنْ لِي عَلَى مَوْلَاكَ فَدَخَلَ ثُمَّ خَرَجَ فَقَالَ لِيَ ادْخُلْ فَدَخَلْتُ فَإِذَا أَنَا بِشَيْخٍ مُعْتَكِفٍ شَدِيدِ الِاجْتِهَادِ فَسَلَّمْتُ عَلَيْهِ فَقَالَ لِي مَنْ أَنْتَ فَقُلْتُ أَنَا الْكَلْبِيُّ النَّسَّابَةُ فَقَالَ مَا حَاجَتُكَ فَقُلْتُ جِئْتُ أَسْأَلُكَ فَقَالَ أَ مَرَرْتَ بِابْنِي مُحَمَّدٍ قُلْتُ بَدَأْتُ بِكَ فَقَالَ سَلْ", "فَقُلْتُ أَخْبِرْنِي عَنْ رَجُلٍ قَالَ لِامْرَأَتِهِ أَنْتِ طَالِقٌ عَدَدَ نُجُومِ السَّمَاءِ فَقَالَ تَبِينُ بِرَأْسِ الْجَوْزَاءِ وَ الْبَاقِي وِزْرٌ عَلَيْهِ وَ عُقُوبَةٌ فَقُلْتُ فِي نَفْسِي وَاحِدَةٌ", "فَقُلْتُ مَا يَقُولُ الشَّيْخُ فِي الْمَسْحِ عَلَى الْخُفَّيْنِ فَقَالَ قَدْ مَسَحَ قَوْمٌ صَالِحُونَ وَ نَحْنُ أَهْلَ الْبَيْتِ لَا نَمْسَحُ فَقُلْتُ فِي نَفْسِي ثِنْتَانِ", "فَقُلْتُ مَا تَقُولُ فِي أَكْلِ الْجِرِّيِّ أَ حَلَالٌ هُوَ أَمْ حَرَامٌ فَقَالَ حَلَالٌ إِلَّا أَنَّا أَهْلَ الْبَيْتِ نَعَافُهُ فَقُلْتُ فِي نَفْسِي ثَلَاثٌ", "فَقُلْتُ فَمَا تَقُولُ فِي شُرْبِ النَّبِيذِ فَقَالَ حَلَالٌ إِلَّا أَنَّا أَهْلَ الْبَيْتِ لَا نَشْرَبُهُ فَقُمْتُ فَخَرَجْتُ مِنْ عِنْدِهِ وَ أَنَا أَقُولُ هَذِهِ الْعِصَابَةُ تَكْذِبُ عَلَى أَهْلِ هَذَا الْبَيْتِ", "فَدَخَلْتُ الْمَسْجِدَ فَنَظَرْتُ إِلَى جَمَاعَةٍ مِنْ قُرَيْشٍ وَ غَيْرِهِمْ مِنَ النَّاسِ فَسَلَّمْتُ عَلَيْهِمْ ثُمَّ قُلْتُ لَهُمْ مَنْ أَعْلَمُ أَهْلِ هَذَا الْبَيْتِ فَقَالُوا عَبْدُ اللَّهِ بْنُ الْحَسَنِ فَقُلْتُ قَدْ أَتَيْتُهُ فَلَمْ أَجِدْ عِنْدَهُ شَيْئاً فَرَفَعَ رَجُلٌ مِنَ الْقَوْمِ رَأْسَهُ فَقَالَ ائْتِ جَعْفَرَ بْنَ مُحَمَّدٍ ( عليه السلام ) فَهُوَ أَعْلَمُ أَهْلِ هَذَا الْبَيْتِ فَلَامَهُ بَعْضُ مَنْ كَانَ بِالْحَضْرَةِ فَقُلْتُ إِنَّ الْقَوْمَ إِنَّمَا مَنَعَهُمْ مِنْ إِرْشَادِي إِلَيْهِ أَوَّلَ مَرَّةٍ الْحَسَدُ فَقُلْتُ لَهُ وَيْحَكَ إِيَّاهُ أَرَدْتُ", "فَمَضَيْتُ حَتَّى صِرْتُ إِلَى مَنْزِلِهِ فَقَرَعْتُ الْبَابَ فَخَرَجَ غُلَامٌ لَهُ فَقَالَ ادْخُلْ يَا أَخَا كَلْبٍ فَوَ اللَّهِ لَقَدْ أَدْهَشَنِي فَدَخَلْتُ وَ أَنَا مُضْطَرِبٌ وَ نَظَرْتُ فَإِذَا شَيْخٌ عَلَى مُصَلًّى بِلَا مِرْفَقَةٍ وَ لَا بَرْدَعَةٍ فَابْتَدَأَنِي بَعْدَ أَنْ سَلَّمْتُ عَلَيْهِ فَقَالَ لِي مَنْ أَنْتَ فَقُلْتُ فِي نَفْسِي يَا سُبْحَانَ اللَّهِ غُلَامُهُ يَقُولُ لِي بِالْبَابِ ادْخُلْ يَا أَخَا كَلْبٍ وَ يَسْأَلُنِي الْمَوْلَى مَنْ أَنْتَ", "فَقُلْتُ لَهُ أَنَا الْكَلْبِيُّ النَّسَّابَةُ فَضَرَبَ بِيَدِهِ عَلَى جَبْهَتِهِ وَ قَالَ كَذَبَ الْعَادِلُونَ بِاللَّهِ وَ ضَلُّوا ضَلَالًا بَعِيداً وَ خَسِرُوا خُسْرَاناً مُبِيناً يَا أَخَا كَلْبٍ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ عاداً وَ ثَمُودَ وَ أَصْحابَ الرَّسِّ وَ قُرُوناً بَيْنَ ذلِكَ كَثِيراً أَ فَتَنْسِبُهَا أَنْتَ فَقُلْتُ لَا جُعِلْتُ فِدَاكَ فَقَالَ لِي أَ فَتَنْسِبُ نَفْسَكَ قُلْتُ نَعَمْ أَنَا فُلَانُ بْنُ فُلَانِ بْنِ فُلَانٍ حَتَّى ارْتَفَعْتُ فَقَالَ لِي قِفْ لَيْسَ حَيْثُ تَذْهَبُ وَيْحَكَ أَ تَدْرِي مَنْ فُلَانُ بْنُ فُلَانٍ قُلْتُ نَعَمْ فُلَانُ بْنُ فُلَانٍ", "قَالَ إِنَّ فُلَانَ بْنَ فُلَانٍ ابْنُ فُلَانٍ الرَّاعِي الْكُرْدِيِّ إِنَّمَا كَانَ فُلَانٌ الرَّاعِي الْكُرْدِيُّ عَلَى جَبَلِ آلِ فُلَانٍ فَنَزَلَ إِلَى فُلَانَةَ امْرَأَةِ فُلَانٍ مِنْ جَبَلِهِ الَّذِي كَانَ يَرْعَى غَنَمَهُ عَلَيْهِ فَأَطْعَمَهَا شَيْئاً وَ غَشِيَهَا فَوَلَدَتْ فُلَاناً وَ فُلَانُ بْنُ فُلَانٍ مِنْ فُلَانَةَ وَ فُلَانِ بْنِ فُلَانٍ ثُمَّ قَالَ أَ تَعْرِفُ هَذِهِ الْأَسَامِيَ قُلْتُ لَا وَ اللَّهِ جُعِلْتُ فِدَاكَ فَإِنْ رَأَيْتَ أَنْ تَكُفَّ عَنْ هَذَا فَعَلْتَ فَقَالَ إِنَّمَا قُلْتَ فَقُلْتُ فَقُلْتُ إِنِّي لَا أَعُودُ قَالَ لَا نَعُودُ إِذاً وَ اسْأَلْ عَمَّا جِئْتَ لَهُ", "فَقُلْتُ لَهُ أَخْبِرْنِي عَنْ رَجُلٍ قَالَ لِامْرَأَتِهِ أَنْتِ طَالِقٌ عَدَدَ نُجُومِ السَّمَاءِ فَقَالَ وَيْحَكَ أَ مَا تَقْرَأُ سُورَةَ الطَّلَاقِ قُلْتُ بَلَى قَالَ فَاقْرَأْ فَقَرَأْتُ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَ أَحْصُوا الْعِدَّةَ قَالَ أَ تَرَى هَاهُنَا نُجُومَ السَّمَاءِ قُلْتُ لَا", "قُلْتُ فَرَجُلٌ قَالَ لِامْرَأَتِهِ أَنْتِ طَالِقٌ ثَلَاثاً قَالَ تُرَدُّ إِلَى كِتَابِ اللَّهِ وَ سُنَّةِ نَبِيِّهِ ( صلى الله عليه وآله ) ثُمَّ قَالَ لَا طَلَاقَ إِلَّا عَلَى طُهْرٍ مِنْ غَيْرِ جِمَاعٍ بِشَاهِدَيْنِ مَقْبُولَيْنِ فَقُلْتُ فِي نَفْسِي وَاحِدَةٌ", "ثُمَّ قَالَ سَلْ قُلْتُ مَا تَقُولُ فِي الْمَسْحِ عَلَى الْخُفَّيْنِ فَتَبَسَّمَ ثُمَّ قَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ وَ رَدَّ اللَّهُ كُلَّ شَيْ‏ءٍ إِلَى شَيْئِهِ وَ رَدَّ الْجِلْدَ إِلَى الْغَنَمِ فَتَرَى أَصْحَابَ الْمَسْحِ أَيْنَ يَذْهَبُ وُضُوؤُهُمْ فَقُلْتُ فِي نَفْسِي ثِنْتَانِ", "ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ سَلْ فَقُلْتُ أَخْبِرْنِي عَنْ أَكْلِ الْجِرِّيِّ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ مَسَخَ طَائِفَةً مِنْ بَنِي إِسْرَائِيلَ فَمَا أَخَذَ مِنْهُمْ بَحْراً فَهُوَ الْجِرِّيُّ وَ الْمَارْمَاهِي وَ الزِّمَّارُ وَ مَا سِوَى ذَلِكَ وَ مَا أَخَذَ مِنْهُمْ بَرّاً فَالْقِرَدَةُ وَ الْخَنَازِيرُ وَ الْوَبْرُ وَ الْوَرَكُ وَ مَا سِوَى ذَلِكَ فَقُلْتُ فِي نَفْسِي ثَلَاثٌ", "ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ سَلْ وَ قُمْ فَقُلْتُ مَا تَقُولُ فِي النَّبِيذِ فَقَالَ حَلَالٌ فَقُلْتُ إِنَّا نَنْبِذُ فَنَطْرَحُ فِيهِ الْعَكَرَ وَ مَا سِوَى ذَلِكَ وَ نَشْرَبُهُ فَقَالَ شَهْ شَهْ تِلْكَ الْخَمْرَةُ الْمُنْتِنَةُ فَقُلْتُ جُعِلْتُ فِدَاكَ فَأَيَّ نَبِيذٍ تَعْنِي فَقَالَ إِنَّ أَهْلَ الْمَدِينَةِ شَكَوْا إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) تَغْيِيرَ الْمَاءِ وَ فَسَادَ طَبَائِعِهِمْ فَأَمَرَهُمْ أَنْ يَنْبِذُوا فَكَانَ الرَّجُلُ يَأْمُرُ خَادِمَهُ أَنْ يَنْبِذَ لَهُ فَيَعْمِدُ إِلَى كَفٍّ مِنَ التَّمْرِ فَيَقْذِفُ بِهِ فِي الشَّنِّ فَمِنْهُ شُرْبُهُ وَ مِنْهُ طَهُورُهُ", "فَقُلْتُ وَ كَمْ كَانَ عَدَدُ التَّمْرِ الَّذِي كَانَ فِي الْكَفِّ فَقَالَ مَا حَمَلَ الْكَفُّ فَقُلْتُ وَاحِدَةٌ وَ ثِنْتَانِ فَقَالَ رُبَّمَا كَانَتْ وَاحِدَةً وَ رُبَّمَا كَانَتْ ثِنْتَيْنِ فَقُلْتُ وَ كَمْ كَانَ يَسَعُ الشَّنُّ فَقَالَ مَا بَيْنَ الْأَرْبَعِينَ إِلَى الثَّمَانِينَ إِلَى مَا فَوْقَ ذَلِكَ فَقُلْتُ بِالْأَرْطَالِ فَقَالَ نَعَمْ أَرْطَالٌ بِمِكْيَالِ الْعِرَاقِ", "قَالَ سَمَاعَةُ قَالَ الْكَلْبِيُّ ثُمَّ نَهَضَ ( عليه السلام ) وَ قُمْتُ فَخَرَجْتُ وَ أَنَا أَضْرِبُ بِيَدِي عَلَى الْأُخْرَى وَ أَنَا أَقُولُ إِنْ كَانَ شَيْ‏ءٌ فَهَذَا فَلَمْ يَزَلِ الْكَلْبِيُّ يَدِينُ اللَّهَ بِحُبِّ آلِ هَذَا الْبَيْتِ حَتَّى مَاتَ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Al Moalla Bin Muhammad, from Muhammad Bin Ali who said, ‘Sama’at Bin Mihran informed me saying, Al Kalby the genealogist informed me saying, ", "‘I entered Al-Medina and I did not recognise anything from this matter (Al-Wilayah). So I went over to the Masjid, and there was a group of Qureysh there. So I said, ‘Inform me about the knowledgeable one of this Household (of Rasool-Allah<sup>saww</sup>)’. So they said, ‘Abd Allah son of Al-Hassan<sup>asws</sup>’. ", "So I went over to his house and sought permission. So a man came out to me, and I thought he was a slave of his, so I said to him, ‘Get permission for me to see your master’. So he entered (the house), then came out, and he said to me, ‘Enter!’ So I entered, and there I was with an old man who had secluded (himself) for intense striving. So I greeted upon him, and he said to me, ‘Who are you?’ So I said, ‘I am Al-Kalby the genealogist’. So he said to me, ‘What is your need?’ So I said, ‘I came over to question you’. So he said, ‘Did you pass by my son Muhammad?’ I said, ‘I began with you’. So he said, ‘Ask’. ", "So I said, ‘Inform me about a man who says to his wife, ‘You are divorced (as many times as) the number of the stars in the sky’. So he said, ‘It is clear as the head of the Gemini (irrevocable divorce), and there remains a burden (sin) upon him, and a Punishment’. So I said to myself, ‘One’. ", "So I said, ‘What is the sheikh saying regarding the wiping upon the two shoes (during ablution)?’ So he said, ‘The righteous people have wiped (as such), and we the people of the Household (of Rasool-Allah<sup>saww</sup>) do not wipe (as such)’. So I said within myself, ‘Two’. ", "So I said, ‘What are you saying regarding eating the eel, is it Permissible or it is Prohibited?’ So he said, ‘Permissible, except that we, the People of the Household detest it’. So I said within myself, ‘Three’. ", "So I said, ‘So what are you saying regarding drinking Al-Nabeez?’ So he said, ‘Permissible, except that we the People of the Houshold do not drink it’. So I arose from his presence and I was saying, ‘This gang is lying upon the People<sup>asws</sup> of this Household’. ", "So I entered the Masjid and looked at the group of Qureysh and others from the people. So I greeted upon them, then I said to them, ‘Who is the most knowledgeable of this Household (of Rasool-Allah<sup>saww</sup>)?’ So they said, ‘Abd Allah son of Al-Hassan<sup>asws</sup>’. So I said, ‘I have been to him but I did not find anything to be with him’. So a man from the group raised his head and he said, ‘Did you go to Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>, for he<sup>asws</sup> is the most knowledgeable one of this Household’. So, some of those in his presence blamed him (for saying that). So I said, ‘The people, rather, what prevented them to guide me towards him<sup>asws</sup>, was the envy’. So I said to him, ‘Woe be unto you! He<sup>asws</sup> is the one I want’.  ", "So I went until I came to his<sup>asws</sup> house, and I knocked the door, and a slave of his<sup>asws</sup> came out and he said, ‘Enter, O brother of (the clan of) Kalb!’ So, by Allah<sup>azwj</sup>, he had amazed me. So I entered and I was shaken, and I looked around, so there was an old man upon a Prayer mat without a pillow and no blanket, and he<sup>asws</sup> initiated me after I had greeted upon him<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘Who are you?’ So I said within myself, ‘O Glory be to Allah<sup>azwj</sup>! His<sup>asws</sup> slave said to me at the door, ‘Enter, O borhter of (the clan of) Kalb’, and the master is asking me: ‘Who are you’?’ ", "So I said to him<sup>asws</sup>, ‘I am Al-Kalby, the genealogist’. So he<sup>asws</sup> struck his<sup>asws</sup> hand upon his<sup>asws</sup> forehead and said: ‘The equalisers with Allah<sup>azwj</sup> are lying and straying with a far straying, and are losing with evident losses. O brother of (the clan of) Kalb! Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[25:38] And Aad, and Samood, and the dwellers of the Al-Rass and many generations between them</span>. So can you lineage these?’ So I said, ‘No, may I be sacrificed for you<sup>asws</sup>’. So he<sup>asws</sup> said to me: ‘So can you lineage yourself?’ I said, ‘Yes. I am so and so, son of so and so, son of so and so’, until I raised it. So he<sup>asws</sup> said to me: ‘Stop! It isn’t where you are going with. Woe be unto you! Do you know who was so and so, son of so and so?’ I said, ‘Yes, so and so, son of so and so’. ", "He<sup>asws</sup> said: ‘So and so, was the son of so and so the Kurdish shepherd. But rather, so and so the Kurdish shepherd was upon a mountain of the family of so and so. So he descended unto so and so woman from his mountain which he was pasturing his sheep upon. So he fed her something and overwhelmed her. So she gave birth to so and so, and so and so, son of so and so from so and so woman, and so and so, son of so and so’. Then he<sup>asws</sup> said: ‘Do you know these names?’ I said, ‘No, by Allah<sup>azwj</sup>! May I be sacrificed for you<sup>asws</sup>! So if you<sup>asws</sup> see fit, you<sup>asws</sup> could refrain from this, do so’. So he<sup>asws</sup> said: ‘But rather, I<sup>asws</sup> (due to what) you said’. So I said, ‘I shall not repeat’. He<sup>asws</sup> said: ‘We<sup>asws</sup> shall not repeat then, and ask about what you came for’. ", "So I said to him<sup>asws</sup>, ‘Inform me about a man who says to his wife, ‘You are divorced (as many times as) the number of the stars of the sky’. So he<sup>asws</sup> said: ‘Woe be unto you! Have you not read Surah Al-Talaq (Chapter 65)?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So read’. So I read, ‘<span class=\"ibTxt\">[65:1] When you divorce women, divorce them for their prescribed time, and calculate the number of the days prescribed</span>’. He<sup>asws</sup> said: ‘Do you see over here the start of the sky?’ I said, ‘No’. ", "I said, ‘So a man says to his wife, ‘You are divorced’, three times’. He<sup>asws</sup> said: ‘You should refer it to the Book of Allah<sup>azwj</sup> and the Sunnah of His<sup>azwj</sup> Prophet<sup>saww</sup>’. Then he<sup>asws</sup> said: ‘There is no divorce except upon cleanliness (menses-free period) from without a copulation, with two witnesses, both acceptable’. So I said within myself, ‘One’. ", "Then he<sup>asws</sup> said: ‘Ask’. I said, ‘What are you<sup>asws</sup> saying regarding the wiping upon the two shoes (during ablution)?’ So he<sup>asws</sup> smiled, then said: ‘When it will be the Day of Judgment, and Allah<sup>azwj</sup> Return everything to its matter, and Returns the skin to the sheep, so you will see the performers of (such) wiping would see where their ablutions would have gone’. So I said within myself, ‘Two’. ", "Then he<sup>asws</sup> turned towards me and he<sup>asws</sup> said: ‘Ask’. So I said, ‘Inform me about eating the eel’. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Metamorphosed a group from the Children of Israel. So whatever the sea seized of them, so these are the eel, and the catfish, and the moray, and whatever is besides that. And whatever the land seized of them, so (these are the) monkeys, and the pigs, and the guinea pig, and the lizard and whatever is besides that’. So I said within myself, ‘Three’. ", "Then he<sup>asws</sup> turned towards me and he<sup>asws</sup> said: ‘Ask and arise’. So I said, ‘What are you<sup>asws</sup> saying regarding <span class=\"iTxt\">Al</span>-<span class=\"iTxt\">Nabeez</span>’. So he<sup>asws</sup> said: ‘Permissible’. So I said, ‘When we prepare <span class=\"iTxt\">Nabeez</span>, we tend to toss the sediment into it and what is besides that, and we drink it’. So he<sup>asws</sup> said: ‘Shh! Shh! That is the stinking wine’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! So which <span class=\"iTxt\">Nabeez</span> do you<sup>asws</sup> mean?’ So he<sup>asws</sup> said: ‘The people of Al-Medina complained to Rasool-Allah<sup>saww</sup> of the change of the water and the spoiling of their health, so he<sup>saww</sup> instructed them that they should rotate it (stir it). So the man used to order his servant that he stirs it for him, and he would extend a handful of dates and throw it into the container. Thus from it, it would be drunk, and from it, it would be (used for) cleaning. ", "So I said, ‘And how many were the dates which were in the palm?’ So he<sup>asws</sup> said: ‘Whatever the palm could hold’. So I said, ‘One and two?’ So he<sup>asws</sup> said: ‘Sometimes it was one, and sometimes there were two’. So I said, ‘And how much was the capacity of the container?’ So he<sup>asws</sup> said: ‘What is between the forty, up to the eighty, to what is above that’. So I said, ‘By the <span class=\"iTxt\">Ratls</span> (Unit of weight)?’ So he<sup>asws</sup> said: ‘Yes. <span class=\"iTxt\">Ratls</span> by the weight of ‘الْعِرَاقِ’ ‘Al-Iraq’. ", "Sama’at (the narrator) said, ‘Al-Kalby said, ‘Then he<sup>asws</sup> got up, and I arose and exited, and I was striking my hand upon the other and I was saying, ‘If there was anything, so this is it’. So Al-Kalby did not cease to make a Religion of Allah<sup>azwj</sup> by loving the Progeny<sup>asws</sup> of this Household until he died’."]}}, {"index": 923, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي يَحْيَى الْوَاسِطِيِّ عَنْ هِشَامِ بْنِ سَالِمٍ قَالَ كُنَّا بِالْمَدِينَةِ بَعْدَ وَفَاةِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَا وَ صَاحِبُ الطَّاقِ وَ النَّاسُ مُجْتَمِعُونَ عَلَى عَبْدِ اللَّهِ بْنِ جَعْفَرٍ أَنَّهُ صَاحِبُ الْأَمْرِ بَعْدَ أَبِيهِ فَدَخَلْنَا عَلَيْهِ أَنَا وَ صَاحِبُ الطَّاقِ وَ النَّاسُ عِنْدَهُ وَ ذَلِكَ أَنَّهُمْ رَوَوْا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ إِنَّ الْأَمْرَ فِي الْكَبِيرِ مَا لَمْ تَكُنْ بِهِ عَاهَة", "فَدَخَلْنَا عَلَيْهِ نَسْأَلُهُ عَمَّا كُنَّا نَسْأَلُ عَنْهُ أَبَاهُ فَسَأَلْنَاهُ عَنِ الزَّكَاةِ فِي كَمْ تَجِبُ فَقَالَ فِي مِائَتَيْنِ خَمْسَةٌ فَقُلْنَا فَفِي مِائَةٍ فَقَالَ دِرْهَمَانِ وَ نِصْفٌ فَقُلْنَا وَ اللَّهِ مَا تَقُولُ الْمُرْجِئَةُ هَذَا قَالَ فَرَفَعَ يَدَهُ إِلَى السَّمَاءِ فَقَالَ وَ اللَّهِ مَا أَدْرِي مَا تَقُولُ الْمُرْجِئَةُ", "قَالَ فَخَرَجْنَا مِنْ عِنْدِهِ ضُلَّالًا لَا نَدْرِي إِلَى أَيْنَ نَتَوَجَّهُ أَنَا وَ أَبُو جَعْفَرٍ الْأَحْوَلُ فَقَعَدْنَا فِي بَعْضِ أَزِقَّةِ الْمَدِينَةِ بَاكِينَ حَيَارَى لَا نَدْرِي إِلَى أَيْنَ نَتَوَجَّهُ وَ لَا مَنْ نَقْصِدُ وَ نَقُولُ إِلَى الْمُرْجِئَةِ إِلَى الْقَدَرِيَّةِ إِلَى الزَّيْدِيَّةِ إِلَى الْمُعْتَزِلَةِ إِلَى الْخَوَارِجِ فَنَحْنُ كَذَلِكَ إِذْ رَأَيْتُ رَجُلًا شَيْخاً لَا أَعْرِفُهُ يُومِئُ إِلَيَّ بِيَدِهِ فَخِفْتُ أَنْ يَكُونَ عَيْناً مِنْ عُيُونِ أَبِي جَعْفَرٍ الْمَنْصُورِ وَ ذَلِكَ أَنَّهُ كَانَ لَهُ بِالْمَدِينَةِ جَوَاسِيسُ يَنْظُرُونَ إِلَى مَنِ اتَّفَقَتْ شِيعَةُ جَعْفَرٍ ( عليه السلام ) عَلَيْهِ فَيَضْرِبُونَ عُنُقَهُ فَخِفْتُ أَنْ يَكُونَ مِنْهُمْ", "فَقُلْتُ لِلْأَحْوَلِ تَنَحَّ فَإِنِّي خَائِفٌ عَلَى نَفْسِي وَ عَلَيْكَ وَ إِنَّمَا يُرِيدُنِي لَا يُرِيدُكَ فَتَنَحَّ عَنِّي لَا تَهْلِكْ وَ تُعِينَ عَلَى نَفْسِكَ فَتَنَحَّى غَيْرَ بَعِيدٍ وَ تَبِعْتُ الشَّيْخَ وَ ذَلِكَ أَنِّي ظَنَنْتُ أَنِّي لَا أَقْدِرُ عَلَى التَّخَلُّصِ مِنْهُ فَمَا زِلْتُ أَتْبَعُهُ وَ قَدْ عَزَمْتُ عَلَى الْمَوْتِ حَتَّى وَرَدَ بِي عَلَى بَابِ أَبِي الْحَسَنِ ( عليه السلام ) ثُمَّ خَلَّانِي وَ مَضَى فَإِذَا خَادِمٌ بِالْبَابِ فَقَالَ لِيَ ادْخُلْ رَحِمَكَ اللَّهُ", "فَدَخَلْتُ فَإِذَا أَبُو الْحَسَنِ مُوسَى ( عليه السلام ) فَقَالَ لِيَ ابْتِدَاءً مِنْهُ لَا إِلَى الْمُرْجِئَةِ وَ لَا إِلَى الْقَدَرِيَّةِ وَ لَا إِلَى الزَّيْدِيَّةِ وَ لَا إِلَى الْمُعْتَزِلَةِ وَ لَا إِلَى الْخَوَارِجِ إِلَيَّ إِلَيَّ فَقُلْتُ جُعِلْتُ فِدَاكَ مَضَى أَبُوكَ قَالَ نَعَمْ قُلْتُ مَضَى مَوْتاً قَالَ نَعَمْ قُلْتُ فَمَنْ لَنَا مِنْ بَعْدِهِ فَقَالَ إِنْ شَاءَ اللَّهُ أَنْ يَهْدِيَكَ هَدَاكَ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّ عَبْدَ اللَّهِ يَزْعُمُ أَنَّهُ مِنْ بَعْدِ أَبِيهِ قَالَ يُرِيدُ عَبْدُ اللَّهِ أَنْ لَا يُعْبَدَ اللَّهُ", "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَمَنْ لَنَا مِنْ بَعْدِهِ قَالَ إِنْ شَاءَ اللَّهُ أَنْ يَهْدِيَكَ هَدَاكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَأَنْتَ هُوَ قَالَ لَا مَا أَقُولُ ذَلِكَ قَالَ فَقُلْتُ فِي نَفْسِي لَمْ أُصِبْ طَرِيقَ الْمَسْأَلَةِ ثُمَّ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ عَلَيْكَ إِمَامٌ قَالَ لَا", "فَدَاخَلَنِي شَيْ‏ءٌ لَا يَعْلَمُ إِلَّا اللَّهُ عَزَّ وَ جَلَّ إِعْظَاماً لَهُ وَ هَيْبَةً أَكْثَرَ مِمَّا كَانَ يَحُلُّ بِي مِنْ أَبِيهِ إِذَا دَخَلْتُ عَلَيْهِ ثُمَّ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ أَسْأَلُكَ عَمَّا كُنْتُ أَسْأَلُ أَبَاكَ فَقَالَ سَلْ تُخْبَرْ وَ لَا تُذِعْ فَإِنْ أَذَعْتَ فَهُوَ الذَّبْحُ فَسَأَلْتُهُ فَإِذَا هُوَ بَحْرٌ لَا يُنْزَفُ", "قُلْتُ جُعِلْتُ فِدَاكَ شِيعَتُكَ وَ شِيعَةُ أَبِيكَ ضُلَّالٌ فَأُلْقِي إِلَيْهِمْ وَ أَدْعُوهُمْ إِلَيْكَ وَ قَدْ أَخَذْتَ عَلَيَّ الْكِتْمَانَ قَالَ مَنْ آنَسْتَ مِنْهُ رُشْداً فَأَلْقِ إِلَيْهِ وَ خُذْ عَلَيْهِ الْكِتْمَانَ فَإِنْ أَذَاعُوا فَهُوَ الذَّبْحُ وَ أَشَارَ بِيَدِهِ إِلَى حَلْقِهِ", "قَالَ فَخَرَجْتُ مِنْ عِنْدِهِ فَلَقِيتُ أَبَا جَعْفَرٍ الْأَحْوَلَ فَقَالَ لِي مَا وَرَاءَكَ قُلْتُ الْهُدَى فَحَدَّثْتُهُ بِالْقِصَّةِ قَالَ ثُمَّ لَقِينَا الْفُضَيْلَ وَ أَبَا بَصِيرٍ فَدَخَلَا عَلَيْهِ وَ سَمِعَا كَلَامَهُ وَ سَاءَلَاهُ وَ قَطَعَا عَلَيْهِ بِالْإِمَامَةِ ثُمَّ لَقِينَا النَّاسَ أَفْوَاجاً فَكُلُّ مَنْ دَخَلَ عَلَيْهِ قَطَعَ إِلَّا طَائِفَةَ عَمَّارٍ وَ أَصْحَابَهُ وَ بَقِيَ عَبْدُ اللَّهِ لَا يَدْخُلُ إِلَيْهِ إِلَّا قَلِيلٌ مِنَ النَّاسِ فَلَمَّا رَأَى ذَلِكَ قَالَ مَا حَالَ النَّاسَ فَأُخْبِرَ أَنَّ هِشَاماً صَدَّ عَنْكَ النَّاسَ قَالَ هِشَامٌ فَأَقْعَدَ لِي بِالْمَدِينَةِ غَيْرَ وَاحِدٍ لِيَضْرِبُونِي ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Abu Yahya Al Wasity, from Hisham Bin Salim who said, ", "‘We were at Al-Medina after the passing away of Abu Abdullah<sup>asws</sup>. I and Sahib Al-Taaq and the people had gathered at Abdullah son of Ja’far<sup>asws</sup>, as being the master of the command after his father<sup>asws</sup>. So, I and Sahib Al-Taaq went over to him, and the people were in his presence, and that they had been reporting from Abu Abdullah<sup>asws</sup> that he<sup>asws</sup> had said that the command is to be in the eldest (son) for as long as there does not happen to be any disability with him. ", "So we went over to him to ask him about what we had asked his father<sup>asws</sup> about. So we asked him about the Zakat, in how much is it Obligated. So he said, ‘In two hundred and fifty’. So we said, ‘So (what about) in one hundred?’ So he said, ‘Two Dirhams and a half’. So we said, ‘By Allah<sup>azwj</sup>, the Murjiites are not saying this!’ So he raised his hands towards the sky and he said, ‘By Allah<sup>azwj</sup>! I do not know what the Murjiites are saying’. ", "He (the narrator) said, ‘So we went out from his presence straying, not knowing to where we should be heading, I and Abu Ja’far Al-Ahowl. So we sat in one of the alleyways of Al-Medina, crying, confused, not knowing to where we should be heading nor whom we should be seeking, and we were saying, ‘(Shall we go) to the Murjiites, to the Qadiriites, to the Zaydiites, to the Mu’tazilites, to the Khawarijites?’. So we were like that when we saw an old man whom I did not recognise gestured to me by his hand. So we feared that he might happen to be a spy from the spies of Abu Ja’far Al-Mansour (the Caliph), and that he used to have spies for him at Al-Medina who were looking at whom the Shias of Ja’far<sup>asws</sup> had united upon, so they could strike off their necks. So I feared he might happen be from them.", "So I said to Al-Ahowl, ‘Leave me alone, for I fear upon myself and upon you, and rather, he is intending me and is not intending you. Therefore leave me and do not perish and look after yourself’. So he moved away, nor far, and I followed the old man, and that is because I thought that I would not be able to free myself from him. So I did not cease to follow him, and I had been determined upon the death until he came with me to the door of Abu Al-Hassan<sup>asws</sup>. Then he left me alone and left, and there was a servant at the door who said to me, ‘لِيَ ادْخُلْ رَحِمَكَ اللَّهُ’ ‘Enter, may Allah<sup>azwj</sup> have Mercy on you!’", "So I entered, and there was Abu Al-Hassan Musa<sup>asws</sup>, and he<sup>asws</sup> said to me initiating from him<sup>asws</sup>: ‘Neither to the Murjiites, not to the Qadiriites, not to the Zaydiites, not to the Mu’tazilites, nor to the Khawarifites. To me<sup>asws</sup>, to me<sup>asws</sup>!’ So I said, ‘May I be sacrificed for you<sup>asws</sup>! Your<sup>asws</sup> father<sup>asws</sup> has expired’. He<sup>asws</sup> said: ‘Yes’. I said, ‘An expiry of death?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘So who is for us from after him<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘If Allah<sup>azwj</sup> so Desires to Guide you, He<sup>azwj</sup> will Guide you’. I said, ‘May I be sacrificed for you<sup>asws</sup>! Abdullah is alleging that he is the one from after his father<sup>asws</sup>’. He<sup>asws</sup> said: ‘Abdullah intends that Allah<sup>azwj</sup> is not worshipped’. ", "He (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>! So who is for us from after him<sup>asws</sup>?’ He<sup>asws</sup> said: ‘If Allah<sup>azwj</sup> so Desires to Guide you, He<sup>azwj</sup> will Guide you’. I said, ‘May I be sacrificed for you<sup>asws</sup>! So you<sup>asws</sup> are him<sup>asws</sup> (the Imam<sup>asws</sup> of the time)?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> am not saying that’. So I said within myself, ‘I have not been correct in the way of my questioning’. Then I said, ‘May I be sacrificed for you<sup>asws</sup>! Is there an Imam over you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘No’. ", "So there entered something into me none knows except for Allah<sup>azwj</sup> Mighty and Majestic, a reverence for him<sup>asws</sup> and awe more than what I used to be overwhelmed with from his<sup>asws</sup> father<sup>asws</sup> whenever I went over to him<sup>asws</sup>. Then I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I (want to) ask you<sup>asws</sup> about what I<sup>asws</sup> had asked your<sup>asws</sup> father<sup>asws</sup>’. So he<sup>asws</sup> said: ‘Ask. I<sup>asws</sup> shall inform you and do not broadcast, for if you were to broadcast, so there would be the slaughter’. So I asked him<sup>asws</sup>, and he<sup>asws</sup> was an ocean, not depleting. ", "I said, ‘May I be sacrificed for you<sup>asws</sup>! Your<sup>asws</sup> Shias and the Shias of your<sup>asws</sup> father<sup>asws</sup> are straying, so can I deliver to them and call them to you<sup>asws</sup>, and I would take it upon me for the concealment?’ He<sup>asws</sup> said: ‘The one whom you are friendly from and is rational, so deliver to him and take the (promise of) concealment upon him, for if you were to broadcast, then there would be the slaughter’, and he<sup>asws</sup> gestured by his<sup>asws</sup> hand to his<sup>asws</sup> throat.", "He (the narrator) said, ‘So I went out from his<sup>asws</sup> presence and met up with Abu Ja’far Al-Ahowl. So he said to me, ‘What is behind you?’ I said, ‘The Guidance’. And I narrated to him with the story. Then we met Al-Fuzayl and Abu Baseer, so they both went over to him<sup>asws</sup> and heard his<sup>asws</sup> speech, and they both asked him<sup>asws</sup>, and cut-off to him<sup>asws</sup> (from the others) with the Imamate. Then we met the people in droves. So everyone who went over to him<sup>asws</sup>, cut-off (from others) except for the group of Ammar and his companions. And there remained Abdullah, none were going to him except for a few from the people. So when he saw that, he said, ‘What is the matter with the people?’ So he was informed, ‘Hisham is blocking the people from you’. Hisham said, ‘So they laid waiting to ambush me at Al-Medina, more than once, in order to strike me’."]}}, {"index": 924, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:8", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ فُلَانٍ الْوَاقِفِيِّ قَالَ كَانَ لِيَ ابْنُ عَمٍّ يُقَالُ لَهُ الْحَسَنُ بْنُ عَبْدِ اللَّهِ كَانَ زَاهِداً وَ كَانَ مِنْ أَعْبَدِ أَهْلِ زَمَانِهِ وَ كَانَ يَتَّقِيهِ السُّلْطَانُ لِجِدِّهِ فِي الدِّينِ وَ اجْتِهَادِهِ وَ رُبَّمَا اسْتَقْبَلَ السُّلْطَانَ بِكَلَامٍ صَعْبٍ يَعِظُهُ وَ يَأْمُرُهُ بِالْمَعْرُوفِ وَ يَنْهَاهُ عَنِ الْمُنْكَرِ وَ كَانَ السُّلْطَانُ يَحْتَمِلُهُ لِصَلَاحِهِ وَ لَمْ تَزَلْ هَذِهِ حَالَتَهُ حَتَّى كَانَ يَوْمٌ مِنَ الْأَيَّامِ إِذْ دَخَلَ عَلَيْهِ أَبُو الْحَسَنِ مُوسَى ( عليه السلام ) وَ هُوَ فِي الْمَسْجِدِ", "فَرَآهُ فَأَوْمَأَ إِلَيْهِ فَأَتَاهُ فَقَالَ لَهُ يَا أَبَا عَلِيٍّ مَا أَحَبَّ إِلَيَّ مَا أَنْتَ فِيهِ وَ أَسَرَّنِي إِلَّا أَنَّهُ لَيْسَتْ لَكَ مَعْرِفَةٌ فَاطْلُبِ الْمَعْرِفَةَ قَالَ جُعِلْتُ فِدَاكَ وَ مَا الْمَعْرِفَةُ قَالَ اذْهَبْ فَتَفَقَّهْ وَ اطْلُبِ الْحَدِيثَ قَالَ عَمَّنْ قَالَ عَنْ فُقَهَاءِ أَهْلِ الْمَدِينَةِ ثُمَّ اعْرِضْ عَلَيَّ الْحَدِيثَ", "قَالَ فَذَهَبَ فَكَتَبَ ثُمَّ جَاءَهُ فَقَرَأَهُ عَلَيْهِ فَأَسْقَطَهُ كُلَّهُ ثُمَّ قَالَ لَهُ اذْهَبْ فَاعْرِفِ الْمَعْرِفَةَ وَ كَانَ الرَّجُلُ مَعْنِيّاً بِدِينِهِ فَلَمْ يَزَلْ يَتَرَصَّدُ أَبَا الْحَسَنِ ( عليه السلام ) حَتَّى خَرَجَ إِلَى ضَيْعَةٍ لَهُ فَلَقِيَهُ فِي الطَّرِيقِ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ إِنِّي أَحْتَجُّ عَلَيْكَ بَيْنَ يَدَيِ اللَّهِ فَدُلَّنِي عَلَى الْمَعْرِفَةِ", "قَالَ فَأَخْبَرَهُ بِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ مَا كَانَ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَخْبَرَهُ بِأَمْرِ الرَّجُلَيْنِ فَقَبِلَ مِنْهُ ثُمَّ قَالَ لَهُ فَمَنْ كَانَ بَعْدَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ الْحَسَنُ ( عليه السلام ) ثُمَّ الْحُسَيْنُ ( عليه السلام ) حَتَّى انْتَهَى إِلَى نَفْسِهِ ثُمَّ سَكَتَ قَالَ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ فَمَنْ هُوَ الْيَوْمَ قَالَ إِنْ أَخْبَرْتُكَ تَقْبَلُ قَالَ بَلَى جُعِلْتُ فِدَاكَ قَالَ أَنَا هُوَ", "قَالَ فَشَيْ‏ءٌ أَسْتَدِلُّ بِهِ قَالَ اذْهَبْ إِلَى تِلْكَ الشَّجَرَةِ وَ أَشَارَ بِيَدِهِ إِلَى أُمِّ غَيْلَانَ فَقُلْ لَهَا يَقُولُ لَكِ مُوسَى بْنُ جَعْفَرٍ أَقْبِلِي قَالَ فَأَتَيْتُهَا فَرَأَيْتُهَا وَ اللَّهِ تَخُدُّ الْأَرْضَ خَدّاً حَتَّى وَقَفَتْ بَيْنَ يَدَيْهِ ثُمَّ أَشَارَ إِلَيْهَا فَرَجَعَتْ قَالَ فَأَقَرَّ بِهِ ثُمَّ لَزِمَ الصَّمْتَ وَ الْعِبَادَةَ فَكَانَ لَا يَرَاهُ أَحَدٌ يَتَكَلَّمُ بَعْدَ ذَلِكَ .", "مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ إِبْرَاهِيمَ بْنِ هَاشِمٍ مِثْلَهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Muhammad, from Muhammad Bin Fulan the Waqifiite who said, ", "‘There was a cousin of mine called Al-Hassan Bin Abdullah who was ascetic, and he was from the most devout worshippers of his time, and the ruler used to fear him due to his devoutness in the Religion and his striving, and sometimes he used to face the ruler with harsh speech advising him and instructing him with the goodness and forbidding him from the evil, and it was so that the ruler used to endure him due to his righteousness. And this did not cease to be his state until it was from the days when he went over to Abu Al-Hassan Musa<sup>asws</sup>, and he<sup>asws</sup> was in the Masjid. ", "So he<sup>asws</sup> saw him and gestured towards him and said to him: ‘O Abu Ali! How beloved it is to me<sup>asws</sup> what you are in and it cheers me<sup>asws</sup> except that there isn’t any ‘مَعْرِفَة’ understanding for you. Therefore, seek the understanding’. He said, ‘May I be sacrificed for you<sup>asws</sup>! And what is the understanding?’ He<sup>asws</sup> said: ‘Go and ponder and seek the Hadeeth’. He said, ‘From whom?’ He<sup>asws</sup> said: ‘عَنْ فُقَهَاءِ أَهْلِ الْمَدِينَةِ’ ‘From the jurists of the people of Al Medina, then present the Hadeeth unto me<sup>asws</sup>’. ", "He (the narrator) said, ‘So he went, and wrote down (the Ahadeeth), then came over with it and recited it to him<sup>asws</sup>. So he<sup>asws</sup> rejected all of it, then said to him: ‘Go and recognise the understanding’. And he was the man serious with his Religion, so he did not cease to hang around Abu Al-Hassan<sup>asws</sup> until he<sup>asws</sup> went out to a property of his<sup>asws</sup>, so he met him<sup>asws</sup> in the road. So he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I want to argue against you<sup>asws</sup> in front of Allah<sup>azwj</sup>, so indicate me upon ‘الْمَعْرِفَةِ’ the recognition’. ", "He (the narrator) said, ‘So he<sup>asws</sup> informed him of Amir Al-Momineen<sup>asws</sup> and what had occurred after Rasool-Allah<sup>saww</sup>, and informed him of the matter of the two men (Abu Bakr and Umar). So he accepted from him<sup>asws</sup>, then said to him<sup>asws</sup>, ‘So who was after Amir Al-Momineen<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Al-Hassan<sup>asws</sup>, then Al-Husayn<sup>asws</sup>’, until he<sup>asws</sup> ended up to himself<sup>asws</sup>. Then he<sup>asws</sup> was silent. So he said, ‘So who is he (the Imam<sup>asws</sup>) today?’ He<sup>asws</sup> said: ‘If I<sup>asws</sup> inform you, will you accept?’ He Said, ‘Yes, may I be sacrificed for you<sup>asws</sup>!’ He<sup>asws</sup> said: ‘I<sup>asws</sup> am he<sup>asws</sup>’. ", "He said: ‘So is there anything to evidence with it?’ He<sup>asws</sup> said: ‘Go to that tree’, and he<sup>asws</sup> gestured towards Umm Gaylan (a type of tree), ‘and say to it, ‘Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> is telling you, ‘come to me’. He said, ‘So I went over to it and said it. By Allah<sup>azwj</sup>, it furrowed the ground with a furrowing until it stopped in front of him<sup>asws</sup>. Then he<sup>asws</sup> gestured towards it, so it returned. So he acknowledged with it, the necessitated the silence and the worship (upon himself), and it was so that no one saw him speak after that’. ", "<span style=\"font-size: small\">Muhammad Bin Yahya, and Ahmad Bin Muhammad, from Muhammad Bin Al Hassan, from Ibrahim Bin Hashim </span>– similar to it."]}}, {"index": 925, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:9", "text": ["مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ أَحْمَدَ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ الطَّيِّبِ عَنْ عَبْدِ الْوَهَّابِ بْنِ مَنْصُورٍ عَنْ مُحَمَّدِ بْنِ أَبِي الْعَلَاءِ قَالَ سَمِعْتُ يَحْيَى بْنَ أَكْثَمَ قَاضِيَ سَامَرَّاءَ بَعْدَ مَا جَهَدْتُ بِهِ وَ نَاظَرْتُهُ وَ حَاوَرْتُهُ وَ وَاصَلْتُهُ وَ سَأَلْتُهُ عَنْ عُلُومِ آلِ مُحَمَّدٍ فَقَالَ بَيْنَا أَنَا ذَاتَ يَوْمٍ دَخَلْتُ أَطُوفُ بِقَبْرِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَرَأَيْتُ مُحَمَّدَ بْنَ عَلِيٍّ الرِّضَا ( عليه السلام ) يَطُوفُ بِهِ", "فَنَاظَرْتُهُ فِي مَسَائِلَ عِنْدِي فَأَخْرَجَهَا إِلَيَّ فَقُلْتُ لَهُ وَ اللَّهِ إِنِّي أُرِيدُ أَنْ أَسْأَلَكَ مَسْأَلَةً وَ إِنِّي وَ اللَّهِ لَأَسْتَحْيِي مِنْ ذَلِكَ فَقَالَ لِي أَنَا أُخْبِرُكَ قَبْلَ أَنْ تَسْأَلَنِي تَسْأَلُنِي عَنِ الْإِمَامِ فَقُلْتُ هُوَ وَ اللَّهِ هَذَا فَقَالَ أَنَا هُوَ فَقُلْتُ عَلَامَةً فَكَانَ فِي يَدِهِ عَصًا فَنَطَقَتْ وَ قَالَتْ إِنَّ مَوْلَايَ إِمَامُ هَذَا الزَّمَانِ وَ هُوَ الْحُجَّةُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, and Ahmad Bin Muhammad, from Muhammad Bin Al Hassan, from Ahmad Bin Al Husayn, from Muhammad Bin Al Tayyib, from Abdul Wahhab Bin Mansour, from Muhammad Bin Abu Al A’ala who said, ", "‘I heard Yahya Bin Aksam, the judge of Samarra, after having tested him, and debated him, and interviewed him, and maintaining good relations with him, and I asked him about the knowledge of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. So he said, ‘One day when I entered to perform Tawaaf of the grave of Rasol-Allah<sup>saww</sup>, so I saw Muhammad<sup>asws</sup> Bin Ali Al-Reza<sup>asws</sup> performing Tawaaf of it. ", "So I debated with him<sup>asws</sup> regarding the questions which were with me, so he extracted (the answers) to me. So I said to him<sup>asws</sup>, ‘By Allah<sup>azwj</sup>! I want to ask you<sup>asws</sup> a question and I, by Allah<sup>azwj</sup>, am too embarrassed from that’. So he<sup>asws</sup> said to me: ‘I<sup>asws</sup> shall inform you before you even ask me<sup>asws</sup>. You want to ask me<sup>asws</sup> about the Imam<sup>asws</sup>’. So I said, ‘By Allah<sup>azwj</sup>! This is it’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> am he<sup>asws</sup>’. So I said, ‘It’s sign?’ So there was a staff in his<sup>asws</sup> hand, and it spoke and said, ‘My owner is the Imam<sup>asws</sup> of this time, and he<sup>asws</sup> is the Divine Authority’."]}}, {"index": 926, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:10", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ أَوْ غَيْرِهِ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحُسَيْنِ بْنِ عُمَرَ بْنِ يَزِيدَ قَالَ دَخَلْتُ عَلَى الرِّضَا ( عليه السلام ) وَ أَنَا يَوْمَئِذٍ وَاقِفٌ وَ قَدْ كَانَ أَبِي سَأَلَ أَبَاهُ عَنْ سَبْعِ مَسَائِلَ فَأَجَابَهُ فِي سِتٍّ وَ أَمْسَكَ عَنِ السَّابِعَةِ فَقُلْتُ وَ اللَّهِ لَأَسْأَلَنَّهُ عَمَّا سَأَلَ أَبِي أَبَاهُ فَإِنْ أَجَابَ بِمِثْلِ جَوَابِ أَبِيهِ كَانَتْ دَلَالَةً فَسَأَلْتُهُ فَأَجَابَ بِمِثْلِ جَوَابِ أَبِيهِ أَبِي فِي الْمَسَائِلِ السِّتِّ فَلَمْ يَزِدْ فِي الْجَوَابِ وَاواً وَ لَا يَاءً وَ أَمْسَكَ عَنِ السَّابِعَةِ", "وَ قَدْ كَانَ أَبِي قَالَ لِأَبِيهِ إِنِّي أَحْتَجُّ عَلَيْكَ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ أَنَّكَ زَعَمْتَ أَنَّ عَبْدَ اللَّهِ لَمْ يَكُنْ إِمَاماً فَوَضَعَ يَدَهُ عَلَى عُنُقِهِ ثُمَّ قَالَ لَهُ نَعَمْ احْتَجَّ عَلَيَّ بِذَلِكَ عِنْدَ اللَّهِ عَزَّ وَ جَلَّ فَمَا كَانَ فِيهِ مِنْ إِثْمٍ فَهُوَ فِي رَقَبَتِي", "فَلَمَّا وَدَّعْتُهُ قَالَ إِنَّهُ لَيْسَ أَحَدٌ مِنْ شِيعَتِنَا يُبْتَلَى بِبَلِيَّةٍ أَوْ يَشْتَكِي فَيَصْبِرُ عَلَى ذَلِكَ إِلَّا كَتَبَ اللَّهُ لَهُ أَجْرَ أَلْفِ شَهِيدٍ فَقُلْتُ فِي نَفْسِي وَ اللَّهِ مَا كَانَ لِهَذَا ذِكْرٌ ", "فَلَمَّا مَضَيْتُ وَ كُنْتُ فِي بَعْضِ الطَّرِيقِ خَرَجَ بِي عِرْقُ الْمَدِينِيِّ فَلَقِيتُ مِنْهُ شِدَّةً فَلَمَّا كَانَ مِنْ قَابِلٍ حَجَجْتُ فَدَخَلْتُ عَلَيْهِ وَ قَدْ بَقِيَ مِنْ وَجَعِي بَقِيَّةٌ فَشَكَوْتُ إِلَيْهِ وَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ عَوِّذْ رِجْلِي وَ بَسَطْتُهَا بَيْنَ يَدَيْهِ فَقَالَ لِي لَيْسَ عَلَى رِجْلِكَ هَذِهِ بَأْسٌ وَ لَكِنْ أَرِنِي رِجْلَكَ الصَّحِيحَةَ فَبَسَطْتُهَا بَيْنَ يَدَيْهِ فَعَوَّذَهَا فَلَمَّا خَرَجْتُ لَمْ أَلْبَثْ إِلَّا يَسِيراً حَتَّى خَرَجَ بِيَ الْعِرْقُ وَ كَانَ وَجَعُهُ يَسِيراً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, or someone else, from Ali Bin Al Hakam, from Al Husayn Bin Umar Bin Yazeed who said, ", "‘I went over to Al-Reza<sup>asws</sup>, and I, in those days, was a Waqifiite, and it was so that my father had asked his<sup>asws</sup> father<sup>asws</sup> about seven questions and he<sup>asws</sup> hand answered six and withheld from the seventh. So I said (to myself), ‘By Allah<sup>azwj</sup>! I shall ask him<sup>asws</sup> about what my father asked his<sup>asws</sup> father<sup>asws</sup>. So if he<sup>asws</sup> were to answer with the like of the answer of his<sup>asws</sup> father, it would be proof’. So I asked him<sup>asws</sup>, and he<sup>asws</sup> answered with like the answer of his<sup>asws</sup> father<sup>asws</sup> to my father regarding the six questions, and he<sup>asws</sup> did not increase in the answer with neither a (letter) ‘Waw’ nor a (letter) ‘Ya’, and he<sup>asws</sup> withheld from the seventh. ", "And my father had said to his<sup>asws</sup> father<sup>asws</sup>, ‘I shall argue against you<sup>asws</sup> in the Presence of Allah<sup>azwj</sup> on the Day of Judgment. You<sup>asws</sup> are claiming that Abdullah does not happen to be the Imam’. So he<sup>asws</sup> had placed his<sup>asws</sup> hand upon his neck, then said to him: ‘Yes, argue against me<sup>asws</sup> with that on the Day of Judgment in the Presence of Allah<sup>azwj</sup> Mighty and Majestic. So whatever was in it from a sin, so it would be upon my<sup>asws</sup> neck. ", "So when I bade him<sup>asws</sup> farewell, he<sup>asws</sup> said: ‘There isn’t anyone from our<sup>asws</sup> Shias who is afflicted with an affliction or a complaint, so he is patient upon that, except that Allah<sup>azwj</sup> would Write to him the Recompense of a thousand martyrs’. So I said within myself, ‘By Allah<sup>azwj</sup>! There was no mention of this’. ", "So when I went and was in one of the streets, a leg vein came out with me (swelled) and I faced intense (pain) from it. So when it was from the next year, I performed Hajj, and I went over to him<sup>asws</sup>, and there had (still) remained some pain from my pains. So I complained to him<sup>asws</sup>, and I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! My leg is hurting’ and I extended it in front of him<sup>asws</sup>. So he<sup>asws</sup> said to me: ‘There is nothing wrong upon this leg of yours, but show me<sup>asws</sup> your correct leg’. So I extended it in front of him<sup>asws</sup> and he<sup>asws</sup> sought Refuge (with Allah<sup>azwj</sup>) for it. So when I left, I did not wait except for a little while until the vein swelled with me, and it was of a little pain’."]}}, {"index": 927, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:11", "text": ["أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ ابْنِ قِيَامَا الْوَاسِطِيِّ وَ كَانَ مِنَ الْوَاقِفَةِ قَالَ دَخَلْتُ عَلَى عَلِيِّ بْنِ مُوسَى الرِّضَا ( عليه السلام ) فَقُلْتُ لَهُ يَكُونُ إِمَامَانِ قَالَ لَا إِلَّا وَ أَحَدُهُمَا صَامِتٌ فَقُلْتُ لَهُ هُوَ ذَا أَنْتَ لَيْسَ لَكَ صَامِتٌ وَ لَمْ يَكُنْ وُلِدَ لَهُ أَبُو جَعْفَرٍ بَعْدُ فَقَالَ لِي وَ اللَّهِ لَيَجْعَلَنَّ اللَّهُ مِنِّي مَا يُثْبِتُ بِهِ الْحَقَّ وَ أَهْلَهُ وَ يَمْحَقُ بِهِ الْبَاطِلَ وَ أَهْلَهُ ", "فَوُلِدَ لَهُ بَعْدَ سَنَةٍ أَبُو جَعْفَرٍ ( عليه السلام ) فَقِيلَ لِابْنِ قِيَامَا أَ لَا تُقْنِعُكَ هَذِهِ الْآيَةُ فَقَالَ أَمَا وَ اللَّهِ إِنَّهَا لآَيَةٌ عَظِيمَةٌ وَ لَكِنْ كَيْفَ أَصْنَعُ بِمَا قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فِي ابْنِهِ ."], "translations": {"en.hubeali": ["Ahmad Bin Mihran, from Muhammad Bin Ali, from Ibn Qiyama Al Wasity, and he was from the Waqifiites who said, ", "‘I went over to Ali<sup>asws</sup> Bin Musa Al-Reza<sup>asws</sup>, and I said to him<sup>asws</sup>, ‘Can there happen to be two Imams<sup>asws</sup>?’ He<sup>asws</sup> said: ‘No, except that one of the two would be silent’. So I said to him<sup>asws</sup>, ‘It is that. You<sup>asws</sup> are such that there isn’t a silent one for you<sup>asws</sup>’. And there had not happened the birth of Abu Ja’far<sup>asws</sup> for him<sup>asws</sup> yet. So he<sup>asws</sup> said to me: ‘By Allah<sup>azwj</sup>! Allah<sup>azwj</sup> would be Making from me<sup>asws</sup> what the Truth and its people would be affirmed by and the falsehood and its people would be obliterated by’. ", "So there came for him<sup>asws</sup>, after a year, Abu Ja’far<sup>asws</sup>. So it was said to Ibn Qiyama (the narrator), ‘Does this sign not suffice for you?’ So he said, ‘But, by Allah<sup>azwj</sup>, it is a great sign, but how shall I deal with what Abu Abdullah<sup>asws</sup> said regarding his<sup>asws</sup> son?’"]}}, {"index": 928, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:12", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ قَالَ أَتَيْتُ خُرَاسَانَ وَ أَنَا وَاقِفٌ فَحَمَلْتُ مَعِي مَتَاعاً وَ كَانَ مَعِي ثَوْبٌ وَشِيٌّ فِي بَعْضِ الرِّزَمِ وَ لَمْ أَشْعُرْ بِهِ وَ لَمْ أَعْرِفْ مَكَانَهُ فَلَمَّا قَدِمْتُ مَرْوَ وَ نَزَلْتُ فِي بَعْضِ مَنَازِلِهَا لَمْ أَشْعُرْ إِلَّا وَ رَجُلٌ مَدَنِيٌّ مِنْ بَعْضِ مُوَلَّدِيهَا فَقَالَ لِي إِنَّ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) يَقُولُ لَكَ ابْعَثْ إِلَيَّ الثَّوْبَ الْوَشِيَّ الَّذِي عِنْدَكَ قَالَ فَقُلْتُ وَ مَنْ أَخْبَرَ أَبَا الْحَسَنِ بِقُدُومِي وَ أَنَا قَدِمْتُ آنِفاً وَ مَا عِنْدِي ثَوْبٌ وَشِيٌّ", "فَرَجَعَ إِلَيْهِ وَ عَادَ إِلَيَّ فَقَالَ يَقُولُ لَكَ بَلَى هُوَ فِي مَوْضِعِ كَذَا وَ كَذَا وَ رِزْمَتُهُ كَذَا وَ كَذَا فَطَلَبْتُهُ حَيْثُ قَالَ فَوَجَدْتُهُ فِي أَسْفَلِ الرِّزْمَةِ فَبَعَثْتُ بِهِ إِلَيْهِ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa who said, ", "‘I went to Khurasan and I was a Waqifiite. So I carried provisions and there were clothes for me and something in one of the packets, and I was not aware of it and did not know of its place. So when I proceeded to Merv and lodged in one of its lodgings and did not publicise except that a Medinite man from one of its tribes came over and said to me, ‘Abu Al-Hassan Al-Reza<sup style=\"font-weight: normal\">asws</sup> is saying to you: ‘Send over to me<sup style=\"font-weight: normal\">asws</sup> the <span class=\"iTxt\">Washy</span> cloth which is with you’. So I said, ‘And who informed Abu Al-Hassan<sup style=\"font-weight: normal\">asws</sup> of my coming over here and I have just come, and there is not <span class=\"iTxt\">Washy</span> cloth with me’.", "So he returned to him<sup>asws</sup> and came back to me and said, ‘He<sup>asws</sup> is saying to you: ‘Yes (you do), and it is in such and such a place, and in such and such a packet’. So I looked for it where he<sup>asws</sup> said it to be, and I found it in the lowest of the packets. So I sent it over to him<sup>asws</sup>’."]}}, {"index": 929, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:13", "text": ["ابْنُ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ قَالَ كُنْتُ وَاقِفاً وَ حَجَجْتُ عَلَى تِلْكَ الْحَالِ فَلَمَّا صِرْتُ بِمَكَّةَ خَلَجَ فِي صَدْرِي شَيْ‏ءٌ فَتَعَلَّقْتُ بِالْمُلْتَزَمِ ثُمَّ قُلْتُ اللَّهُمَّ قَدْ عَلِمْتَ طَلِبَتِي وَ إِرَادَتِي فَأَرْشِدْنِي إِلَى خَيْرِ الْأَدْيَانِ فَوَقَعَ فِي نَفْسِي أَنْ آتِيَ الرِّضَا ( عليه السلام ) ", "فَأَتَيْتُ الْمَدِينَةَ فَوَقَفْتُ بِبَابِهِ وَ قُلْتُ لِلْغُلَامِ قُلْ لِمَوْلَاكَ رَجُلٌ مِنْ أَهْلِ الْعِرَاقِ بِالْبَابِ قَالَ فَسَمِعْتُ نِدَاءَهُ وَ هُوَ يَقُولُ ادْخُلْ يَا عَبْدَ اللَّهِ بْنَ الْمُغِيرَةِ ادْخُلْ يَا عَبْدَ اللَّهِ بْنَ الْمُغِيرَةِ فَدَخَلْتُ فَلَمَّا نَظَرَ إِلَيَّ قَالَ لِي قَدْ أَجَابَ اللَّهُ دُعَاءَكَ وَ هَدَاكَ لِدِينِهِ فَقُلْتُ أَشْهَدُ أَنَّكَ حُجَّةُ اللَّهِ وَ أَمِينُهُ عَلَى خَلْقِهِ ."], "translations": {"en.hubeali": ["Ibn Fazzal, from Abdullah Bin Al Mugheira who said, ", "‘I was Waqifiite and I performed Hajj being upon that state. So when I came to Makkah, something disturbed me in my chest, so I attached with Al-Multazim (a wall of the Kaaba), then I said, ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> have Known of my seeking and my intention, therefore Guide me to the best of the Religions’. So there occurred within myself that I should go to Al-Reza<sup>asws</sup>. ", "So I went over to Al-Medina and paused at his<sup>asws</sup> door and said to the slave, ‘Tell your Master<sup>asws</sup> that a man from the people of Al-Iraq is at the door’. So I heard his<sup>asws</sup> call and he<sup>asws</sup> was saying: ‘Enter, O Abdullah Bin Al-Mugheira! Enter, O Abdullah Bin Al Mugheira!’ So I entered. So when he<sup>asws</sup> looked at me, he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> has Answered your supplication and Guided you to His<sup>azwj</sup> Religion’. So I said, ‘I testify that you<sup>asws</sup> are the Divine Authority of Allah<sup>azwj</sup> and His<sup>azwj</sup> Trustee upon His<sup>azwj</sup> creatures’."]}}, {"index": 930, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:14", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ قَالَ كَانَ عَبْدُ اللَّهِ بْنُ هُلَيْلٍ يَقُولُ بِعَبْدِ اللَّهِ فَصَارَ إِلَى الْعَسْكَرِ فَرَجَعَ عَنْ ذَلِكَ فَسَأَلْتُهُ عَنْ سَبَبِ رُجُوعِهِ فَقَالَ إِنِّي عَرَضْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) أَنْ أَسْأَلَهُ عَنْ ذَلِكَ فَوَافَقَنِي فِي طَرِيقٍ ضَيِّقٍ فَمَالَ نَحْوِي حَتَّى إِذَا حَاذَانِي أَقْبَلَ نَحْوِي بِشَيْ‏ءٍ مِنْ فِيهِ فَوَقَعَ عَلَى صَدْرِي فَأَخَذْتُهُ فَإِذَا هُوَ رَقٌّ فِيهِ مَكْتُوبٌ مَا كَانَ هُنَالِكَ وَ لَا كَذَلِكَ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah who said, ", "‘It was so that Abdullah Bin Huleyl was saying that Abdullah (son of Ja’far<sup>asws</sup> as being the Imam). So he went to Al-Askar and retracted from that. So I asked him about the reason for his retraction. So he said, ‘I went to Abu Al-Hassan<sup>asws</sup> to ask him<sup>asws</sup> about that, and he<sup>asws</sup> was with me in one of the narrow streets. So when he<sup>asws</sup> was besides me, when he<sup>asws</sup> threw something towards me from his<sup>asws</sup> mouth. So it landed upon my chest, and I grabbed it, and it was a parchment in which was written: ‘It (Imamate) was not there nor was it like that’."]}}, {"index": 931, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:15", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا ذَكَرَ اسْمَهُ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنَا مُوسَى بْنُ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ عُبَيْدِ اللَّهِ بْنِ الْعَبَّاسِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ حَدَّثَنِي جَعْفَرُ بْنُ زَيْدِ بْنِ مُوسَى عَنْ أَبِيهِ عَنْ آبَائِهِ ( عليهم السلام ) قَالُوا جَاءَتْ أُمُّ أَسْلَمَ يَوْماً إِلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ هُوَ فِي مَنْزِلِ أُمِّ سَلَمَةَ فَسَأَلَتْهَا عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَتْ خَرَجَ فِي بَعْضِ الْحَوَائِجِ وَ السَّاعَةَ يَجِي‏ءُ", "فَانْتَظَرَتْهُ عِنْدَ أُمِّ سَلَمَةَ حَتَّى جَاءَ ( صلى الله عليه وآله ) فَقَالَتْ أُمُّ أَسْلَمَ بِأَبِي أَنْتَ وَ أُمِّي يَا رَسُولَ اللَّهِ إِنِّي قَدْ قَرَأْتُ الْكُتُبَ وَ عَلِمْتُ كُلَّ نَبِيٍّ وَ وَصِيٍّ فَمُوسَى كَانَ لَهُ وَصِيٌّ فِي حَيَاتِهِ وَ وَصِيٌّ بَعْدَ مَوْتِهِ وَ كَذَلِكَ عِيسَى فَمَنْ وَصِيُّكَ يَا رَسُولَ اللَّهِ فَقَالَ لَهَا يَا أُمَّ أَسْلَمَ وَصِيِّي فِي حَيَاتِي وَ بَعْدَ مَمَاتِي وَاحِدٌ", "ثُمَّ قَالَ لَهَا يَا أُمَّ أَسْلَمَ مَنْ فَعَلَ فِعْلِي هَذَا فَهُوَ وَصِيِّي ثُمَّ ضَرَبَ بِيَدِهِ إِلَى حَصَاةٍ مِنَ الْأَرْضِ فَفَرَكَهَا بِإِصْبَعِهِ فَجَعَلَهَا شِبْهَ الدَّقِيقِ ثُمَّ عَجَنَهَا ثُمَّ طَبَعَهَا بِخَاتَمِهِ ثُمَّ قَالَ مَنْ فَعَلَ فِعْلِي هَذَا فَهُوَ وَصِيِّي فِي حَيَاتِي وَ بَعْدَ مَمَاتِي", "فَخَرَجْتُ مِنْ عِنْدِهِ فَأَتَيْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقُلْتُ بِأَبِي أَنْتَ وَ أُمِّي أَنْتَ وَصِيُّ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ نَعَمْ يَا أُمَّ أَسْلَمَ ثُمَّ ضَرَبَ بِيَدِهِ إِلَى حَصَاةٍ فَفَرَكَهَا فَجَعَلَهَا كَهَيْئَةِ الدَّقِيقِ ثُمَّ عَجَنَهَا وَ خَتَمَهَا بِخَاتَمِهِ ثُمَّ قَالَ يَا أُمَّ أَسْلَمَ مَنْ فَعَلَ فِعْلِي هَذَا فَهُوَ وَصِيِّي فَخَرَجْتُ مِنْ عِنْدِهِ فَأَتَيْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقُلْتُ بِأَبِي أَنْتَ وَ أُمِّي أَنْتَ وَصِيُّ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ نَعَمْ يَا أُمَّ أَسْلَمَ ثُمَّ ضَرَبَ بِيَدِهِ إِلَى حَصَاةٍ فَفَرَكَهَا فَجَعَلَهَا كَهَيْئَةِ الدَّقِيقِ ثُمَّ عَجَنَهَا وَ خَتَمَهَا بِخَاتَمِهِ ثُمَّ قَالَ يَا أُمَّ أَسْلَمَ مَنْ فَعَلَ فِعْلِي هَذَا فَهُوَ وَصِيِّي", "فَأَتَيْتُ الْحَسَنَ ( عليه السلام ) وَ هُوَ غُلَامٌ فَقُلْتُ لَهُ يَا سَيِّدِي أَنْتَ وَصِيُّ أَبِيكَ فَقَالَ نَعَمْ يَا أُمَّ أَسْلَمَ وَ ضَرَبَ بِيَدِهِ وَ أَخَذَ حَصَاةً فَفَعَلَ بِهَا كَفِعْلِهِمَا", "فَخَرَجْتُ مِنْ عِنْدِهِ فَأَتَيْتُ الْحُسَيْنَ ( عليه السلام ) وَ إِنِّي لَمُسْتَصْغِرَةٌ لِسِنِّهِ فَقُلْتُ لَهُ بِأَبِي أَنْتَ وَ أُمِّي أَنْتَ وَصِيُّ أَخِيكَ فَقَالَ نَعَمْ يَا أُمَّ أَسْلَمَ ائْتِينِي بِحَصَاةٍ ثُمَّ فَعَلَ كَفِعْلِهِمْ", "فَعَمَرَتْ أُمُّ أَسْلَمَ حَتَّى لَحِقَتْ بِعَلِيِّ بْنِ الْحُسَيْنِ بَعْدَ قَتْلِ الْحُسَيْنِ ( عليه السلام ) فِي مُنْصَرَفِهِ فَسَأَلَتْهُ أَنْتَ وَصِيُّ أَبِيكَ فَقَالَ نَعَمْ ثُمَّ فَعَلَ كَفِعْلِهِمْ صَلَوَاتُ اللَّهِ عَلَيْهِمْ أَجْمَعِينَ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from one of our companions whose name he mentioned, said, ‘Muhammad Bin Ibrahim narrated to us saying, ", "‘Musa Bin Muhammad Bin Ismail Bin Ubeydullah son of Al-Abbas<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> informed us saying, Ja’far Bin Zayd son of Musa<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> having said: ‘One day Umm Aslam came over to the Prophet<sup>saww</sup>, and he<sup>asws</sup> was in the house of Umm Salma<sup>as</sup>. So she asked her<sup>as</sup> about Rasool-Allah<sup>saww</sup>. So she<sup>as</sup> said: ‘He<sup>saww</sup> went out regarding some need and he<sup>saww</sup> would be coming back after a while’.  ", "So she waited in the presence of Umm Salma<sup>as</sup> until he<sup>saww</sup> came over. So Umm Aslam said, ‘May my father and my mother be (sacrificed) for you<sup>saww</sup>, O Rasool-Allah<sup>saww</sup>! I have read in books and I know every Prophet<sup>as</sup> and successor<sup>as</sup>. So Musa<sup>as</sup>, there was a successor<sup>as</sup> for him<sup>as</sup> during his<sup>as</sup> lifetime and after his<sup>as</sup> death. And similar to that was Isa<sup>as</sup>. So who is your<sup>saww</sup> successor<sup>asws</sup>, O Rasool-Allah<sup>saww</sup>?’ So he<sup>saww</sup> said to her: ‘O Umm Aslam! My<sup>saww</sup> successor<sup>asws</sup> during my<sup>saww</sup> lifetime and after my<sup>saww</sup> passing away is one’. ", "Then he<sup>saww</sup> said to her: ‘O Umm Aslam! The one who does this deed of mine<sup>saww</sup>, so he<sup>asws</sup> is my<sup>saww</sup> successor<sup>asws</sup>’. Then he<sup>saww</sup> struck his<sup>saww</sup> hand upon a pebble from the ground and crushed it by his<sup>saww</sup> fingers and made it be like flour, then kneaded it, then imprinted by his<sup>saww</sup> seal, then said: ‘The one who does this deed of mine<sup>saww</sup>, so he<sup>asws</sup> is my<sup>saww</sup> successor<sup>asws</sup> during my<sup>saww</sup> lifetime and after my<sup>saww</sup> passing away’. ", "(So she said), ‘I exited from his<sup>saww</sup> presence and went over to Amir Al-Momineen<sup>asws</sup> and I said, ‘May my father and my mother be (sacrificed) for you<sup>asws</sup>! Are you<sup>asws</sup> the successor<sup>asws</sup> of Rasool-Allah<sup>saww</sup>?’ He<sup>asws</sup> said: ‘Yes, O Umm Aslam! Then he<sup>asws</sup> struck his<sup>asws</sup> hand upon a pebble, and he<sup>asws</sup> crushed as if it was flour, then kneaded it, and sealed it by his<sup>asws</sup> insignia, then said: ‘O Umm Aslam! The one who does this deed of mine<sup>asws</sup>, so he<sup>asws</sup> is my<sup>asws</sup> successor<sup>asws</sup>’. ", "So I went over to Al-Hassan<sup>asws</sup>, and he<sup>asws</sup> was a boy, and I said to him<sup>asws</sup>, ‘O my Master<sup>asws</sup>! Are you a successor<sup>asws</sup> of your<sup>asws</sup> father<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘Yes, O Umm Aslam!’ And he<sup>asws</sup> struck by his<sup>asws</sup> hand and grabbed a pebble and did with the like of both their<sup>asws</sup> deeds. ", "So I exited from his<sup>asws</sup> presence and I went over to Al-Husayn<sup>asws</sup>, and I considered him<sup>asws</sup> of a small age, so I said to him<sup>asws</sup>, ‘May my father and my mother be (sacrificed) for you<sup>asws</sup>! Are you a successor<sup>asws</sup> of your<sup>asws</sup> brother<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘Yes, O Umm Aslam! Bring me a pebble’. Then he<sup>asws</sup> did the like of their<sup>asws</sup> deeds’. ", "So Umm Aslam lived until she met up with Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> after the martyrdom of Al-Husayn<sup>asws</sup>, upon his<sup>asws</sup> return (from Al-Iraq). So she asked him<sup>asws</sup>, ‘Are you<sup>asws</sup> a successor<sup>asws</sup> of your<sup>asws</sup> father<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘Yes’. Then he<sup>asws</sup> did the like of their<sup>asws</sup> deeds. May the <span class=\"iTxt\">Salawat</span> of Allah<sup>azwj</sup> be upon all of them<sup>asws</sup>’."]}}, {"index": 932, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:16", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْحُسَيْنِ بْنِ الْجَارُودِ عَنْ مُوسَى بْنِ بَكْرِ بْنِ دَابٍ عَمَّنْ حَدَّثَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّ زَيْدَ بْنَ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) دَخَلَ عَلَى أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ عَلِيٍّ وَ مَعَهُ كُتُبٌ مِنْ أَهْلِ الْكُوفَةِ يَدْعُونَهُ فِيهَا إِلَى أَنْفُسِهِمْ وَ يُخْبِرُونَهُ بِاجْتِمَاعِهِمْ وَ يَأْمُرُونَهُ بِالْخُرُوجِ فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) هَذِهِ الْكُتُبُ ابْتِدَاءٌ مِنْهُمْ أَوْ جَوَابُ مَا كَتَبْتَ بِهِ إِلَيْهِمْ وَ دَعَوْتَهُمْ إِلَيْهِ فَقَالَ بَلِ ابْتِدَاءٌ مِنَ الْقَوْمِ لِمَعْرِفَتِهِمْ بِحَقِّنَا وَ بِقَرَابَتِنَا مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ لِمَا يَجِدُونَ فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ مِنْ وُجُوبِ مَوَدَّتِنَا وَ فَرْضِ طَاعَتِنَا وَ لِمَا نَحْنُ فِيهِ مِنَ الضِّيقِ وَ الضَّنْكِ وَ الْبَلَاءِ ", "فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ الطَّاعَةَ مَفْرُوضَةٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ وَ سُنَّةٌ أَمْضَاهَا فِي الْأَوَّلِينَ وَ كَذَلِكَ يُجْرِيهَا فِي الْآخِرِينَ وَ الطَّاعَةُ لِوَاحِدٍ مِنَّا وَ الْمَوَدَّةُ لِلْجَمِيعِ وَ أَمْرُ اللَّهِ يَجْرِي لِأَوْلِيَائِهِ بِحُكْمٍ مَوْصُولٍ وَ قَضَاءٍ مَفْصُولٍ وَ حَتْمٍ مَقْضِيٍّ وَ قَدَرٍ مَقْدُورٍ وَ أَجَلٍ مُسَمًّى لِوَقْتٍ مَعْلُومٍ فَلَا يَسْتَخِفَّنَّكَ الَّذِينَ لَا يُوقِنُونَ إِنَّهُمْ لَنْ يُغْنُوا عَنْكَ مِنَ اللَّهِ شَيْئاً فَلَا تَعْجَلْ فَإِنَّ اللَّهَ لَا يَعْجَلُ لِعَجَلَةِ الْعِبَادِ وَ لَا تَسْبِقَنَّ اللَّهَ فَتُعْجِزَكَ الْبَلِيَّةُ فَتَصْرَعَكَ ", "قَالَ فَغَضِبَ زَيْدٌ عِنْدَ ذَلِكَ ثُمَّ قَالَ لَيْسَ الْإِمَامُ مِنَّا مَنْ جَلَسَ فِي بَيْتِهِ وَ أَرْخَى سِتْرَهُ وَ ثَبَّطَ عَنِ الْجِهَادِ وَ لَكِنَّ الْإِمَامَ مِنَّا مَنْ مَنَعَ حَوْزَتَهُ وَ جَاهَدَ فِي سَبِيلِ اللَّهِ حَقَّ جِهَادِهِ وَ دَفَعَ عَنْ رَعِيَّتِهِ وَ ذَبَّ عَنْ حَرِيمِهِ", "قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) هَلْ تَعْرِفُ يَا أَخِي مِنْ نَفْسِكَ شَيْئاً مِمَّا نَسَبْتَهَا إِلَيْهِ فَتَجِي‏ءَ عَلَيْهِ بِشَاهِدٍ مِنْ كِتَابِ اللَّهِ أَوْ حُجَّةٍ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَوْ تَضْرِبَ بِهِ مَثَلًا فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ أَحَلَّ حَلَالًا وَ حَرَّمَ حَرَاماً وَ فَرَضَ فَرَائِضَ وَ ضَرَبَ أَمْثَالًا وَ سَنَّ سُنَناً وَ لَمْ يَجْعَلِ الْإِمَامَ الْقَائِمَ بِأَمْرِهِ شُبْهَةً فِيمَا فَرَضَ لَهُ مِنَ الطَّاعَةِ أَنْ يَسْبِقَهُ بِأَمْرٍ قَبْلَ مَحَلِّهِ أَوْ يُجَاهِدَ فِيهِ قَبْلَ حُلُولِهِ", "وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ فِي الصَّيْدِ لا تَقْتُلُوا الصَّيْدَ وَ أَنْتُمْ حُرُمٌ أَ فَقَتْلُ الصَّيْدِ أَعْظَمُ أَمْ قَتْلُ النَّفْسِ الَّتِي حَرَّمَ اللَّهُ وَ جَعَلَ لِكُلِّ شَيْ‏ءٍ مَحَلًّا وَ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ إِذا حَلَلْتُمْ فَاصْطادُوا وَ قَالَ عَزَّ وَ جَلَّ لا تُحِلُّوا شَعائِرَ اللَّهِ وَ لَا الشَّهْرَ الْحَرامَ فَجَعَلَ الشُّهُورَ عِدَّةً مَعْلُومَةً فَجَعَلَ مِنْهَا أَرْبَعَةً حُرُماً وَ قَالَ فَسِيحُوا فِي الْأَرْضِ أَرْبَعَةَ أَشْهُرٍ وَ اعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ", "ثُمَّ قَالَ تَبَارَكَ وَ تَعَالَى فَإِذَا انْسَلَخَ الْأَشْهُرُ الْحُرُمُ فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدْتُمُوهُمْ فَجَعَلَ لِذَلِكَ مَحَلًّا وَ قَالَ وَ لا تَعْزِمُوا عُقْدَةَ النِّكاحِ حَتَّى يَبْلُغَ الْكِتابُ أَجَلَهُ فَجَعَلَ لِكُلِّ شَيْ‏ءٍ أَجَلًا وَ لِكُلِّ أَجَلٍ كِتَاباً", "فَإِنْ كُنْتَ عَلَى بَيِّنَةٍ مِنْ رَبِّكَ وَ يَقِينٍ مِنْ أَمْرِكَ وَ تِبْيَانٍ مِنْ شَأْنِكَ فَشَأْنَكَ وَ إِلَّا فَلَا تَرُومَنَّ أَمْراً أَنْتَ مِنْهُ فِي شَكٍّ وَ شُبْهَةٍ وَ لَا تَتَعَاطَ زَوَالَ مُلْكٍ لَمْ تَنْقَضِ أُكُلُهُ وَ لَمْ يَنْقَطِعْ مَدَاهُ وَ لَمْ يَبْلُغِ الْكِتَابُ أَجَلَهُ فَلَوْ قَدْ بَلَغَ مَدَاهُ وَ انْقَطَعَ أُكُلُهُ وَ بَلَغَ الْكِتَابُ أَجَلَهُ لَانْقَطَعَ الْفَصْلُ وَ تَتَابَعَ النِّظَامُ وَ لَأَعْقَبَ اللَّهُ فِي التَّابِعِ وَ الْمَتْبُوعِ الذُّلَّ وَ الصَّغَارَ ", "أَعُوذُ بِاللَّهِ مِنْ إِمَامٍ ضَلَّ عَنْ وَقْتِهِ فَكَانَ التَّابِعُ فِيهِ أَعْلَمَ مِنَ الْمَتْبُوعِ أَ تُرِيدُ يَا أَخِي أَنْ تُحْيِيَ مِلَّةَ قَوْمٍ قَدْ كَفَرُوا بِآيَاتِ اللَّهِ وَ عَصَوْا رَسُولَهُ وَ اتَّبَعُوا أَهْوَاءَهُمْ بِغَيْرِ هُدًى مِنَ اللَّهِ وَ ادَّعَوُا الْخِلَافَةَ بِلَا بُرْهَانٍ مِنَ اللَّهِ وَ لَا عَهْدٍ مِنْ رَسُولِهِ", "أُعِيذُكَ بِاللَّهِ يَا أَخِي أَنْ تَكُونَ غَداً الْمَصْلُوبَ بِالْكُنَاسَةِ ثُمَّ ارْفَضَّتْ عَيْنَاهُ وَ سَالَتْ دُمُوعُهُ ثُمَّ قَالَ اللَّهُ بَيْنَنَا وَ بَيْنَ مَنْ هَتَكَ سِتْرَنَا وَ جَحَدَنَا حَقَّنَا وَ أَفْشَى سِرَّنَا وَ نَسَبَنَا إِلَى غَيْرِ جَدِّنَا وَ قَالَ فِينَا مَا لَمْ نَقُلْهُ فِي أَنْفُسِنَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Husayn Bin Al Jaroud, from Musa Bin Bakr Bin Dab, from the one who narrated it, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>. Zayd son of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> went to Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>, and with him were letters from the people of Al-Kufa, inviting him in these to themselves and informing him of their groups, and instructing him with the rising (against the ruling authorities). So Abu Ja’far<sup>asws</sup> said to him: ‘These letter are an initiative from them or a response to what you had written with to them and inviting them to it?’ So he said, ‘But, it is an initiative from the people due to their recognition of our rights and due to their acknowledgment of our relationship from Rasool-Allah<sup>saww</sup>, and due to what they are finding in the Book of Allah<sup>azwj</sup> Mighty and Majestic from the Obligation of having our cordiality and the necessity of being obedient to us, and due to what we are in from the straightness, and the impediments, and the afflictions’. ", "So Abu Ja’far<sup>asws</sup> said to him: ‘The obedience is an Imposition from Allah<sup>azwj</sup> Mighty and Majestic and a Sunnah established among the former ones, and similar to that it flows among the later ones, and the obedience is to one of us<sup>asws</sup> and the cordiality is for the entirety (all of us<sup>asws</sup>), and the Command of Allah<sup>azwj</sup> Flows for His<sup>azwj</sup> friends by the Decisions Made and the decisive Judgment and Ordained Accomplishments, and Determinations Determined, and a specified term for a known time. Therefore do not let those who have no conviction belittle you, for they will never benefit you of anything from Allah<sup>azwj</sup>. So, do not be hasty, for Allah<sup>azwj</sup> does not Haste due to the hastiness of the servants, nor precede Allah<sup>azwj</sup>, for the afflictions would frustrate you and destroy you’. ", "He (the narrator) said, ‘So Zayd got angered during that, then said, ‘The Imam<sup>asws</sup> from us doesn’t sit in his<sup>asws</sup> house and draw his curtains and discourage from the Jihad, but the Imam<sup>asws</sup> from is the one who defends his<sup>asws</sup> possessions and does Jihad in the Way of Allah<sup>azwj</sup> as is rightful for the Jihad, and defends his<sup>asws</sup> citizens and protects his<sup>asws</sup> sanctity’. ", "Abu Ja’far<sup>asws</sup> said: ‘O brother, do you recognise anything from yourself from what you are linking it to, so you can come with a witness upon it from the Book of Allah<sup>azwj</sup>, or a proof from Rasool-Allah<sup>saww</sup>, or you can strike an example with? Allah<sup>azwj</sup> Mighty and Majestic Permitted the Permissible and Prohibited the Prohibition, and Necessitated the necessities, and Struck examples, and Established the Sunnahs and He<sup>azwj</sup> did not Make The rising Imam<sup>asws</sup> by His<sup>azwj</sup> Command as being doubtful with regards to what is Necessitated for him<sup>asws</sup> from the obedience, that he<sup>asws</sup> would precede a matter before its (rightful) time or he<sup>asws</sup> would struggle with regards to it before its resolution.", "And Allah<sup>azwj</sup> Mighty and Majestic has Said regarding the hunting: <span class=\"ibTxt\">[5:95] O you who believe! Do not kill game while you are in the Sanctuary</span>. Is the killing of the prey more grievous or killing the soul whom Allah<sup>azwj</sup> has Prohibited? And He<sup>azwj</sup> Made a place for everything, and Said: <span class=\"ibTxt\">[5:2] and when you are free from the Obligations of the Pilgrimage, then hunt</span>. And the Mighty and Majestic Said <span class=\"ibTxt\">[5:2] Do not violate the Signs Appointed by Allah nor the Sacred Month</span>. So He<sup>azwj</sup> Made the months to be of a known number, and He<sup>azwj</sup> Made four of these to be sanctimonious and Said: <span class=\"ibTxt\">[9:2] So go about in the land for four months and know that you cannot frustrate Allah and that Allah will Frustrate the unbelievers</span>.", "Then the Blessed and High Said: <span class=\"ibTxt\">[9:5] So when the Sacred Months have passed away, then fight the Polytheists wherever you find them</span>. Thus, He<sup>azwj</sup> Made a place for it. And He<sup>azwj</sup> Said: <span class=\"ibTxt\">[2:235] and do not confirm the marriage tie until the writing is fulfilled</span>. Thus, He<sup>azwj</sup> Made a term for everything and for every term a writing. ", "Therefore, if you were upon a proof from your Lord<sup>azwj</sup> and conviction of your affairs, and a clarification of your occupation, so (do) your occupation, or else do not indulge in a matter while you are in doubt with regards to it and confusion, nor try to decline a kingdom whose consumption has not expired yet and its term has yet to be cut off and its Ordained term has not reached. So had its term reached, and its consumption cut-off, and the Ordained term reached, the gap would be eradicated and the system would be followed, and Allah<sup>azwj</sup> would Punish the followers and the followed one to be humiliated and belittled.", "I<sup>asws</sup> seek Refuge with Allah<sup>azwj</sup> from a leader who strays from his time, and the follower in it being more knowledgeable than the followed one. O brother! Are you intending to revive a nation of people who have disbelieved in the Signs of Allah<sup>azwj</sup> and disobeyed His<sup>azwj</sup> Rasool<sup>saww</sup> and followed their own desires without a Guidance from Allah<sup>azwj</sup> and claimed the Caliphate without a proof from Allah<sup>azwj</sup>, nor any covenant from His<sup>azwj</sup> Rasool<sup>saww</sup>?", "I seek Refuge with Allah<sup>azwj</sup>, O bother that you would happen to be crucified tomorrow by the rubbish dump’. Then his<sup>asws</sup> eyes filled up and his<sup>asws</sup> tears flowed, then he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is between us<sup>asws</sup> and the ones who tore down our<sup>asws</sup> veils and fought against us<sup>asws</sup> of our<sup>asws</sup> rights, and publicised our<sup>asws</sup> secrets, and linked us to other than our<sup>asws</sup> grandfather<sup>saww</sup>, and said regarding us<sup>asws</sup> what we<sup>asws</sup> did not say regarding ourselves<sup>asws</sup>’."]}}, {"index": 933, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:17", "text": ["بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ رَنْجَوَيْهِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَكَمِ الْأَرْمَنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْجَعْفَرِيِّ قَالَ أَتَيْنَا خَدِيجَةَ بِنْتَ عُمَرَ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) نُعَزِّيهَا بِابْنِ بِنْتِهَا فَوَجَدْنَا عِنْدَهَا مُوسَى بْنَ عَبْدِ اللَّهِ بْنِ الْحَسَنِ فَإِذَا هِيَ فِي نَاحِيَةٍ قَرِيباً مِنَ النِّسَاءِ فَعَزَّيْنَاهُمْ ثُمَّ أَقْبَلْنَا عَلَيْهِ فَإِذَا هُوَ يَقُولُ لِابْنَةِ أَبِي يَشْكُرَ الرَّاثِيَةِ قُولِي ", "فَقَالَتْ : اعْدُدْ رَسُولَ اللَّهِ وَ اعْدُدْ بَعْدَهُ أَسَدَ الْإِلَهِ وَ ثَالِثاً عَبَّاسَاوَ اعْدُدْ عَلِيَّ الْخَيْرِ وَ اعْدُدْ جَعْفَراً وَ اعْدُدْ عَقِيلًا بَعْدَهُ الرُّوَّاسَا فَقَالَ أَحْسَنْتِ وَ أَطْرَبْتِنِي زِيدِينِي فَانْدَفَعَتْ تَقُولُ : وَ مِنَّا إِمَامُ الْمُتَّقِينَ مُحَمَّدٌ وَ حَمْزَةُ مِنَّا وَ الْمُهَذَّبُ جَعْفَرُوَ مِنَّا عَلِيٌّ صِهْرُهُ وَ ابْنُ عَمِّهِ وَ فَارِسُهُ ذَاكَ الْإِمَامُ الْمُطَهَّرُ", "فَأَقَمْنَا عِنْدَهَا حَتَّى كَادَ اللَّيْلُ أَنْ يَجِي‏ءَ ثُمَّ قَالَتْ خَدِيجَةُ سَمِعْتُ عَمِّي مُحَمَّدَ بْنَ عَلِيٍّ صَلَوَاتُ اللَّهِ عَلَيْهِ وَ هُوَ يَقُولُ إِنَّمَا تَحْتَاجُ الْمَرْأَةُ فِي الْمَأْتَمِ إِلَى النَّوْحِ لِتَسِيلَ دَمْعَتُهَا وَ لَا يَنْبَغِي لَهَا أَنْ تَقُولَ هُجْراً فَإِذَا جَاءَ اللَّيْلُ فَلَا تُؤْذِي الْمَلَائِكَةَ بِالنَّوْحِ", "ثُمَّ خَرَجْنَا فَغَدَوْنَا إِلَيْهَا غُدْوَةً فَتَذَاكَرْنَا عِنْدَهَا اخْتِزَالَ مَنْزِلِهَا مِنْ دَارِ أَبِي عَبْدِ اللَّهِ جَعْفَرِ بْنِ مُحَمَّدٍ فَقَالَ هَذِهِ دَارٌ تُسَمَّى دَارَ السَّرِقَةِ فَقَالَتْ هَذَا مَا اصْطَفَى مَهْدِيُّنَا تَعْنِي مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ الْحَسَنِ تُمَازِحُهُ بِذَلِكَ فَقَالَ مُوسَى بْنُ عَبْدِ اللَّهِ وَ اللَّهِ لَأُخْبِرَنَّكُمْ بِالْعَجَبِ رَأَيْتُ أَبِي رَحِمَهُ اللَّهُ", "لَمَّا أَخَذَ فِي أَمْرِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ وَ أَجْمَعَ عَلَى لِقَاءِ أَصْحَابِهِ فَقَالَ لَا أَجِدُ هَذَا الْأَمْرَ يَسْتَقِيمُ إِلَّا أَنْ أَلْقَى أَبَا عَبْدِ اللَّهِ جَعْفَرَ بْنَ مُحَمَّدٍ فَانْطَلَقَ وَ هُوَ مُتَّكٍ عَلَيَّ فَانْطَلَقْتُ مَعَهُ حَتَّى أَتَيْنَا أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَلَقِينَاهُ خَارِجاً يُرِيدُ الْمَسْجِدَ فَاسْتَوْقَفَهُ أَبِي وَ كَلَّمَهُ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَيْسَ هَذَا مَوْضِعَ ذَلِكَ نَلْتَقِي إِنْ شَاءَ اللَّهُ فَرَجَعَ أَبِي مَسْرُوراً", "ثُمَّ أَقَامَ حَتَّى إِذَا كَانَ الْغَدُ أَوْ بَعْدَهُ بِيَوْمٍ انْطَلَقْنَا حَتَّى أَتَيْنَاهُ فَدَخَلَ عَلَيْهِ أَبِي وَ أَنَا مَعَهُ فَابْتَدَأَ الْكَلَامَ ثُمَّ قَالَ لَهُ فِيمَا يَقُولُ قَدْ عَلِمْتَ جُعِلْتُ فِدَاكَ أَنَّ السِّنَّ لِي عَلَيْكَ وَ أَنَّ فِي قَوْمِكَ مَنْ هُوَ أَسَنُّ مِنْكَ وَ لَكِنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ قَدَّمَ لَكَ فَضْلًا لَيْسَ هُوَ لِأَحَدٍ مِنْ قَوْمِكَ وَ قَدْ جِئْتُكَ مُعْتَمِداً لِمَا أَعْلَمُ مِنْ بِرِّكَ وَ أَعْلَمُ فَدَيْتُكَ أَنَّكَ إِذَا أَجَبْتَنِي لَمْ يَتَخَلَّفْ عَنِّي أَحَدٌ مِنْ أَصْحَابِكَ وَ لَمْ يَخْتَلِفْ عَلَيَّ اثْنَانِ مِنْ قُرَيْشٍ وَ لَا غَيْرِهِمْ ", "فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّكَ تَجِدُ غَيْرِي أَطْوَعَ لَكَ مِنِّي وَ لَا حَاجَةَ لَكَ فِيَّ فَوَ اللَّهِ إِنَّكَ لَتَعْلَمُ أَنِّي أُرِيدُ الْبَادِيَةَ أَوْ أَهُمُّ بِهَا فَأَثْقُلُ عَنْهَا وَ أُرِيدُ الْحَجَّ فَمَا أُدْرِكُهُ إِلَّا بَعْدَ كَدٍّ وَ تَعَبٍ وَ مَشَقَّةٍ عَلَى نَفْسِي فَاطْلُبْ غَيْرِي وَ سَلْهُ ذَلِكَ وَ لَا تُعْلِمْهُمْ أَنَّكَ جِئْتَنِي", "فَقَالَ لَهُ النَّاسُ مَادُّونَ أَعْنَاقَهُمْ إِلَيْكَ وَ إِنْ أَجَبْتَنِي لَمْ يَتَخَلَّفْ عَنِّي أَحَدٌ وَ لَكَ أَنْ لَا تُكَلَّفَ قِتَالًا وَ لَا مَكْرُوهاً قَالَ وَ هَجَمَ عَلَيْنَا نَاسٌ فَدَخَلُوا وَ قَطَعُوا كَلَامَنَا فَقَالَ أَبِي جُعِلْتُ فِدَاكَ مَا تَقُولُ فَقَالَ نَلْتَقِي إِنْ شَاءَ اللَّهُ فَقَالَ أَ لَيْسَ عَلَى مَا أُحِبُّ فَقَالَ عَلَى مَا تُحِبُّ إِنْ شَاءَ اللَّهُ مِنْ إِصْلَاحِكَ ", "ثُمَّ انْصَرَفَ حَتَّى جَاءَ الْبَيْتَ فَبَعَثَ رَسُولًا إِلَى مُحَمَّدٍ فِي جَبَلٍ بِجُهَيْنَةَ يُقَالُ لَهُ الْأَشْقَرُ عَلَى لَيْلَتَيْنِ مِنَ الْمَدِينَةِ فَبَشَّرَهُ وَ أَعْلَمَهُ أَنَّهُ قَدْ ظَفِرَ لَهُ بِوَجْهِ حَاجَتِهِ وَ مَا طَلَبَ", "ثُمَّ عَادَ بَعْدَ ثَلَاثَةِ أَيَّامٍ فَوُقِّفْنَا بِالْبَابِ وَ لَمْ نَكُنْ نُحْجَبُ إِذَا جِئْنَا فَأَبْطَأَ الرَّسُولُ ثُمَّ أَذِنَ لَنَا فَدَخَلْنَا عَلَيْهِ فَجَلَسْتُ فِي نَاحِيَةِ الْحُجْرَةِ وَ دَنَا أَبِي إِلَيْهِ فَقَبَّلَ رَأْسَهُ ثُمَّ قَالَ جُعِلْتُ فِدَاكَ قَدْ عُدْتُ إِلَيْكَ رَاجِياً مُؤَمِّلًا قَدِ انْبَسَطَ رَجَائِي وَ أَمَلِي وَ رَجَوْتُ الدَّرْكَ لِحَاجَتِي", "فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا ابْنَ عَمِّ إِنِّي أُعِيذُكَ بِاللَّهِ مِنَ التَّعَرُّضِ لِهَذَا الْأَمْرِ الَّذِي أَمْسَيْتَ فِيهِ وَ إِنِّي لَخَائِفٌ عَلَيْكَ أَنْ يُكْسِبَكَ شَرّاً فَجَرَى الْكَلَامُ بَيْنَهُمَا حَتَّى أَفْضَى إِلَى مَا لَمْ يَكُنْ يُرِيدُ وَ كَانَ مِنْ قَوْلِهِ بِأَيِّ شَيْ‏ءٍ كَانَ الْحُسَيْنُ أَحَقَّ بِهَا مِنْ الْحَسَنِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) رَحِمَ اللَّهُ الْحَسَنَ وَ رَحِمَ الْحُسَيْنَ وَ كَيْفَ ذَكَرْتَ هَذَا قَالَ لِأَنَّ الْحُسَيْنَ ( عليه السلام ) كَانَ يَنْبَغِي لَهُ إِذَا عَدَلَ أَنْ يَجْعَلَهَا فِي الْأَسَنِّ مِنْ وُلْدِ الْحَسَنِ ", "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمَّا أَنْ أَوْحَى إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) أَوْحَى إِلَيْهِ بِمَا شَاءَ وَ لَمْ يُؤَامِرْ أَحَداً مِنْ خَلْقِهِ وَ أَمَرَ مُحَمَّدٌ ( صلى الله عليه وآله ) عَلِيّاً ( عليه السلام ) بِمَا شَاءَ فَفَعَلَ مَا أُمِرَ بِهِ وَ لَسْنَا نَقُولُ فِيهِ إِلَّا مَا قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ تَبْجِيلِهِ وَ تَصْدِيقِهِ", "كَانَ أَمَرَ الْحُسَيْنَ أَنْ يُصَيِّرَهَا فِي الْأَسَنِّ أَوْ يَنْقُلَهَا فِي وُلْدِهِمَا يَعْنِي الْوَصِيَّةَ لَفَعَلَ ذَلِكَ الْحُسَيْنُ وَ مَا هُوَ بِالْمُتَّهَمِ عِنْدَنَا فِي الذَّخِيرَةِ لِنَفْسِهِ وَ لَقَدْ وَلَّى وَ تَرَكَ ذَلِكَ وَ لَكِنَّهُ مَضَى لِمَا أُمِرَ بِهِ وَ هُوَ جَدُّكَ وَ عَمُّكَ فَإِنْ قُلْتَ خَيْراً فَمَا أَوْلَاكَ بِهِ وَ إِنْ قُلْتَ هُجْراً فَيَغْفِرُ اللَّهُ لَكَ", "فَلَوْ أَطِعْنِي يَا ابْنَ عَمِّ وَ اسْمَعْ كَلَامِي فَوَ اللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ لَا آلُوكَ نُصْحاً وَ حِرْصاً فَكَيْفَ وَ لَا أَرَاكَ تَفْعَلُ وَ مَا لِأَمْرِ اللَّهِ مِنْ مَرَدٍّ فَسُرَّ أَبِي عِنْدَ ذَلِكَ", "فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ وَ اللَّهِ إِنَّكَ لَتَعْلَمُ أَنَّهُ الْأَحْوَلُ الْأَكْشَفُ الْأَخْضَرُ الْمَقْتُولُ بِسُدَّةِ أَشْجَعَ عِنْدَ بَطْنِ مَسِيلِهَا فَقَالَ أَبِي لَيْسَ هُوَ ذَلِكَ وَ اللَّهِ لَيُحَارِبَنَّ بِالْيَوْمِ يَوْماً وَ بِالسَّاعَةِ سَاعَةً وَ بِالسَّنَةِ سَنَةً وَ لَيَقُومَنَّ بِثَأْرِ بَنِي أَبِي طَالِبٍ جَمِيعاً", "فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَغْفِرُ اللَّهُ لَكَ مَا أَخْوَفَنِي أَنْ يَكُونَ هَذَا الْبَيْتُ يَلْحَقُ صَاحِبَنَا مَنَّتْكَ نَفْسُكَ فِي الْخَلَاءِ ضَلَالًا لَا وَ اللَّهِ لَا يَمْلِكُ أَكْثَرَ مِنْ حِيطَانِ الْمَدِينَةِ وَ لَا يَبْلُغُ عَمَلُهُ الطَّائِفَ إِذَا أَحْفَلَ يَعْنِي إِذَا أَجْهَدَ نَفْسَهُ وَ مَا لِلْأَمْرِ مِنْ بُدٍّ أَنْ يَقَعَ فَاتَّقِ اللَّهَ وَ ارْحَمْ نَفْسَكَ وَ بَنِي أَبِيكَ فَوَ اللَّهِ إِنِّي لَأَرَاهُ أَشْأَمَ سَلْحَةٍ أَخْرَجَتْهَا أَصْلَابُ الرِّجَالِ إِلَى أَرْحَامِ النِّسَاءِ", "وَ اللَّهِ إِنَّهُ الْمَقْتُولُ بِسُدَّةِ أَشْجَعَ بَيْنَ دُورِهَا وَ اللَّهِ لَكَأَنِّي بِهِ صَرِيعاً مَسْلُوباً بِزَّتُهُ بَيْنَ رِجْلَيْهِ لَبِنَةٌ وَ لَا يَنْفَعُ هَذَا الْغُلَامَ مَا يَسْمَعُ قَالَ مُوسَى بْنُ عَبْدِ اللَّهِ يَعْنِينِي ", "وَ لَيَخْرُجَنَّ مَعَهُ فَيُهْزَمُ وَ يُقْتَلُ صَاحِبُهُ ثُمَّ يَمْضِي فَيَخْرُجُ مَعَهُ رَايَةٌ أُخْرَى فَيُقْتَلُ كَبْشُهَا وَ يَتَفَرَّقُ جَيْشُهَا فَإِنْ أَطَاعَنِي فَلْيَطْلُبِ الْأَمَانَ عِنْدَ ذَلِكَ مِنْ بَنِي الْعَبَّاسِ حَتَّى يَأْتِيَهُ اللَّهُ بِالْفَرَجِ وَ لَقَدْ عَلِمْتَ بِأَنَّ هَذَا الْأَمْرَ لَا يَتِمُّ وَ إِنَّكَ لَتَعْلَمُ وَ نَعْلَمُ أَنَّ ابْنَكَ الْأَحْوَلُ الْأَخْضَرُ الْأَكْشَفُ الْمَقْتُولُ بِسُدَّةِ أَشْجَعَ بَيْنَ دُورِهَا عِنْدَ بَطْنِ مَسِيلِهَا", "فَقَامَ أَبِي وَ هُوَ يَقُولُ بَلْ يُغْنِي اللَّهُ عَنْكَ وَ لَتَعُودَنَّ أَوْ لَيَقِي اللَّهُ بِكَ وَ بِغَيْرِكَ وَ مَا أَرَدْتَ بِهَذَا إِلَّا امْتِنَاعَ غَيْرِكَ وَ أَنْ تَكُونَ ذَرِيعَتَهُمْ إِلَى ذَلِكَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) اللَّهُ يَعْلَمُ مَا أُرِيدُ إِلَّا نُصْحَكَ وَ رُشْدَكَ وَ مَا عَلَيَّ إِلَّا الْجُهْدُ", "فَقَامَ أَبِي يَجُرُّ ثَوْبَهُ مُغْضَباً فَلَحِقَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ أُخْبِرُكَ أَنِّي سَمِعْتُ عَمَّكَ وَ هُوَ خَالُكَ يَذْكُرُ أَنَّكَ وَ بَنِي أَبِيكَ سَتُقْتَلُونَ فَإِنْ أَطَعْتَنِي وَ رَأَيْتَ أَنْ تَدْفَعَ بِالَّتِي هِيَ أَحْسَنُ فَافْعَلْ", "فَوَ اللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَ الشَّهَادَةِ الرَّحْمَنُ الرَّحِيمُ الْكَبِيرُ الْمُتَعَالِ عَلَى خَلْقِهِ لَوَدِدْتُ أَنِّي فَدَيْتُكَ بِوُلْدِي وَ بِأَحَبِّهِمْ إِلَيَّ وَ بِأَحَبِّ أَهْلِ بَيْتِي إِلَيَّ وَ مَا يَعْدِلُكَ عِنْدِي شَيْ‏ءٌ فَلَا تَرَى أَنِّي غَشَشْتُكَ فَخَرَجَ أَبِي مِنْ عِنْدِهِ مُغْضَباً أَسِفاً", "قَالَ فَمَا أَقَمْنَا بَعْدَ ذَلِكَ إِلَّا قَلِيلًا عِشْرِينَ لَيْلَةً أَوْ نَحْوَهَا حَتَّى قَدِمَتْ رُسُلُ أَبِي جَعْفَرٍ فَأَخَذُوا أَبِي وَ عُمُومَتِي سُلَيْمَانَ بْنَ حَسَنٍ وَ حَسَنَ بْنَ حَسَنٍ وَ إِبْرَاهِيمَ بْنَ حَسَنٍ وَ دَاوُدَ بْنَ حَسَنٍ وَ عَلِيَّ بْنَ حَسَنٍ وَ سُلَيْمَانَ بْنَ دَاوُدَ بْنِ حَسَنٍ وَ عَلِيَّ بْنَ إِبْرَاهِيمَ بْنِ حَسَنٍ وَ حَسَنَ بْنَ جَعْفَرِ بْنِ حَسَنٍ وَ طَبَاطَبَا إِبْرَاهِيمَ بْنَ إِسْمَاعِيلَ بْنِ حَسَنٍ وَ عَبْدَ اللَّهِ بْنَ دَاوُدَ", "قَالَ فَصُفِّدُوا فِي الْحَدِيدِ ثُمَّ حُمِلُوا فِي مَحَامِلَ أَعْرَاءً لَا وِطَاءَ فِيهَا وَ وُقِّفُوا بِالْمُصَلَّى لِكَيْ يُشْمِتَهُمُ النَّاسُ قَالَ فَكَفَّ النَّاسُ عَنْهُمْ وَ رَقُّوا لَهُمْ لِلْحَالِ الَّتِي هُمْ فِيهَا ثُمَّ انْطَلَقُوا بِهِمْ حَتَّى وُقِّفُوا عِنْدَ بَابِ مَسْجِدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله )", "قَالَ عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ الْجَعْفَرِيُّ فَحَدَّثَتْنَا خَدِيجَةُ بِنْتُ عُمَرَ بْنِ عَلِيٍّ أَنَّهُمْ لَمَّا أُوقِفُوا عِنْدَ بَابِ الْمَسْجِدِ الْبَابِ الَّذِي يُقَالُ لَهُ بَابُ جَبْرَئِيلَ اطَّلَعَ عَلَيْهِمْ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ عَامَّةُ رِدَائِهِ مَطْرُوحٌ بِالْأَرْضِ ثُمَّ اطَّلَعَ مِنْ بَابِ الْمَسْجِدِ فَقَالَ لَعَنَكُمُ اللَّهُ يَا مَعَاشِرَ الْأَنْصَارِ ثَلَاثاً مَا عَلَى هَذَا عَاهَدْتُمْ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ لَا بَايَعْتُمُوهُ أَمَا وَ اللَّهِ إِنْ كُنْتُ حَرِيصاً وَ لَكِنِّي غُلِبْتُ وَ لَيْسَ لِلْقَضَاءِ مَدْفَعٌ", "ثُمَّ قَامَ وَ أَخَذَ إِحْدَى نَعْلَيْهِ فَأَدْخَلَهَا رِجْلَهُ وَ الْأُخْرَى فِي يَدِهِ وَ عَامَّةُ رِدَائِهِ يَجُرُّهُ فِي الْأَرْضِ ثُمَّ دَخَلَ بَيْتَهُ فَحُمَّ عِشْرِينَ لَيْلَةً لَمْ يَزَلْ يَبْكِي فِيهِ اللَّيْلَ وَ النَّهَارَ حَتَّى خِفْنَا عَلَيْهِ فَهَذَا حَدِيثُ خَدِيجَةَ قَالَ الْجَعْفَرِيُّ", "وَ حَدَّثَنَا مُوسَى بْنُ عَبْدِ اللَّهِ بْنِ الْحَسَنِ أَنَّهُ لَمَّا طُلِعَ بِالْقَوْمِ فِي الْمَحَامِلِ قَامَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مِنَ الْمَسْجِدِ ثُمَّ أَهْوَى إِلَى الْمَحْمِلِ الَّذِي فِيهِ عَبْدُ اللَّهِ بْنُ الْحَسَنِ يُرِيدُ كَلَامَهُ فَمُنِعَ أَشَدَّ الْمَنْعِ وَ أَهْوَى إِلَيْهِ الْحَرَسِيُّ فَدَفَعَهُ وَ قَالَ تَنَحَّ عَنْ هَذَا فَإِنَّ اللَّهَ سَيَكْفِيكَ وَ يَكْفِي غَيْرَكَ ثُمَّ دَخَلَ بِهِمُ الزُّقَاقَ وَ رَجَعَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِلَى مَنْزِلِهِ", "فَلَمْ يَبْلُغْ بِهِمُ الْبَقِيعَ حَتَّى ابْتُلِيَ الْحَرَسِيُّ بَلَاءً شَدِيداً رَمَحَتْهُ نَاقَتُهُ فَدَقَّتْ وَرِكَهُ فَمَاتَ فِيهَا وَ مَضَى بِالْقَوْمِ فَأَقَمْنَا بَعْدَ ذَلِكَ حِيناً ثُمَّ أَتَى مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَسَنٍ فَأُخْبِرَ أَنَّ أَبَاهُ وَ عُمُومَتَهُ قُتِلُوا قَتَلَهُمْ أَبُو جَعْفَرٍ إِلَّا حَسَنَ بْنَ جَعْفَرٍ وَ طَبَاطَبَا وَ عَلِيَّ بْنَ إِبْرَاهِيمَ وَ سُلَيْمَانَ بْنَ دَاوُدَ وَ دَاوُدَ بْنَ حَسَنٍ وَ عَبْدَ اللَّهِ بْنَ دَاوُدَ", "قَالَ فَظَهَرَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ عِنْدَ ذَلِكَ وَ دَعَا النَّاسَ لِبَيْعَتِهِ قَالَ فَكُنْتُ ثَالِثَ ثَلَاثَةٍ بَايَعُوهُ وَ اسْتَوْسَقَ النَّاسَ لِبَيْعَتِهِ وَ لَمْ يَخْتَلِفْ عَلَيْهِ قُرَشِيٌّ وَ لَا أَنْصَارِيٌّ وَ لَا عَرَبِيٌّ قَالَ وَ شَاوَرَ عِيسَى بْنَ زَيْدٍ وَ كَانَ مِنْ ثِقَاتِهِ وَ كَانَ عَلَى شُرَطِهِ فَشَاوَرَهُ فِي الْبِعْثَةِ إِلَى وُجُوهِ قَوْمِهِ فَقَالَ لَهُ عِيسَى بْنُ زَيْدٍ إِنْ دَعَوْتَهُمْ دُعَاءً يَسِيراً لَمْ يُجِيبُوكَ أَوْ تَغْلُظَ عَلَيْهِمْ فَخَلِّنِي وَ إِيَّاهُمْ فَقَالَ لَهُ مُحَمَّدٌ امْضِ إِلَى مَنْ أَرَدْتَ مِنْهُمْ", "ابْعَثْ إِلَى رَئِيسِهِمْ وَ كَبِيرِهِمْ يَعْنِي أَبَا عَبْدِ اللَّهِ جَعْفَرَ بْنَ مُحَمَّدٍ ( عليه السلام ) فَإِنَّكَ إِذَا أَغْلَظْتَ عَلَيْهِ عَلِمُوا جَمِيعاً أَنَّكَ سَتُمِرُّهُمْ عَلَى الطَّرِيقِ الَّتِي أَمْرَرْتَ عَلَيْهَا أَبَا عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فَوَ اللَّهِ مَا لَبِثْنَا أَنْ أُتِيَ بِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) حَتَّى أُوقِفَ بَيْنَ يَدَيْهِ فَقَالَ لَهُ عِيسَى بْنُ زَيْدٍ أَسْلِمْ تَسْلَمْ ", "فَقَالَ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ حَدَثَتْ نُبُوَّةٌ بَعْدَ مُحَمَّدٍ ( صلى الله عليه وآله ) فَقَالَ لَهُ مُحَمَّدٌ لَا وَ لَكِنْ بَايِعْ تَأْمَنْ عَلَى نَفْسِكَ وَ مَالِكَ وَ وُلْدِكَ وَ لَا تُكَلَّفَنَّ حَرْباً فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا فِيَّ حَرْبٌ وَ لَا قِتَالٌ وَ لَقَدْ تَقَدَّمْتُ إِلَى أَبِيكَ وَ حَذَّرْتُهُ الَّذِي حَاقَ بِهِ وَ لَكِنْ لَا يَنْفَعُ حَذَرٌ مِنْ قَدَرٍ", "يَا ابْنَ أَخِي عَلَيْكَ بِالشَّبَابِ وَ دَعْ عَنْكَ الشُّيُوخَ فَقَالَ لَهُ مُحَمَّدٌ مَا أَقْرَبَ مَا بَيْنِي وَ بَيْنَكَ فِي السِّنِّ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي لَمْ أُعَازَّكَ وَ لَمْ أَجِئْ لِأَتَقَدَّمَ عَلَيْكَ فِي الَّذِي أَنْتَ فِيهِ فَقَالَ لَهُ مُحَمَّدٌ لَا وَ اللَّهِ لَا بُدَّ مِنْ أَنْ تُبَايِعَ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا فِيَّ يَا ابْنَ أَخِي طَلَبٌ وَ لَا حَرْبٌ وَ إِنِّي لَأُرِيدُ الْخُرُوجَ إِلَى الْبَادِيَةِ فَيَصُدُّنِي ذَلِكَ وَ يَثْقُلُ عَلَيَّ حَتَّى تُكَلِّمَنِي فِي ذَلِكَ الْأَهْلُ غَيْرَ مَرَّةٍ وَ لَا يَمْنَعُنِي مِنْهُ إِلَّا الضَّعْفُ وَ اللَّهِ وَ الرَّحِمِ أَنْ تُدْبِرَ عَنَّا وَ نَشْقَى بِكَ ", "فَقَالَ لَهُ يَا أَبَا عَبْدِ اللَّهِ قَدْ وَ اللَّهِ مَاتَ أَبُو الدَّوَانِيقِ يَعْنِي أَبَا جَعْفَرٍ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ مَا تَصْنَعُ بِي وَ قَدْ مَاتَ قَالَ أُرِيدُ الْجَمَالَ بِكَ قَالَ مَا إِلَى مَا تُرِيدُ سَبِيلٌ لَا وَ اللَّهِ مَا مَاتَ أَبُو الدَّوَانِيقِ إِلَّا أَنْ يَكُونَ مَاتَ مَوْتَ النَّوْمِ قَالَ وَ اللَّهِ لَتُبَايِعُنِي طَائِعاً أَوْ مُكْرَهاً وَ لَا تُحْمَدُ فِي بَيْعَتِكَ فَأَبَى عَلَيْهِ إِبَاءً شَدِيداً وَ أَمَرَ بِهِ إِلَى الْحَبْسِ ", "فَقَالَ لَهُ عِيسَى بْنُ زَيْدٍ أَمَا إِنْ طَرَحْنَاهُ فِي السِّجْنِ وَ قَدْ خَرِبَ السِّجْنُ وَ لَيْسَ عَلَيْهِ الْيَوْمَ غَلَقٌ خِفْنَا أَنْ يَهْرُبَ مِنْهُ فَضَحِكَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثُمَّ قَالَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ أَ وَ تُرَاكَ تُسْجِنُنِي قَالَ نَعَمْ وَ الَّذِي أَكْرَمَ مُحَمَّداً ( صلى الله عليه وآله ) بِالنُّبُوَّةِ لَأُسْجِنَنَّكَ وَ لَأُشَدِّدَنَّ عَلَيْكَ", "فَقَالَ عِيسَى بْنُ زَيْدٍ احْبِسُوهُ فِي الْمَخْبَإِ وَ ذَلِكَ دَارُ رَيْطَةَ الْيَوْمَ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَمَا وَ اللَّهِ إِنِّي سَأَقُولُ ثُمَّ أُصَدَّقُ فَقَالَ لَهُ عِيسَى بْنُ زَيْدٍ لَوْ تَكَلَّمْتَ لَكَسَرْتُ فَمَكَ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَمَا وَ اللَّهِ يَا أَكْشَفُ يَا أَزْرَقُ لَكَأَنِّي بِكَ تَطْلُبُ لِنَفْسِكَ جُحْراً تَدْخُلُ فِيهِ وَ مَا أَنْتَ فِي الْمَذْكُورِينَ عِنْدَ اللِّقَاءِ وَ إِنِّي لَأَظُنُّكَ إِذَا صُفِّقَ خَلْفَكَ طِرْتَ مِثْلَ الْهَيْقِ النَّافِرِ فَنَفَرَ عَلَيْهِ مُحَمَّدٌ بِانْتِهَارٍ احْبِسْهُ وَ شَدِّدْ عَلَيْهِ وَ اغْلُظْ عَلَيْهِ ", "فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَمَا وَ اللَّهِ لَكَأَنِّي بِكَ خَارِجاً مِنْ سُدَّةِ أَشْجَعَ إِلَى بَطْنِ الْوَادِي وَ قَدْ حَمَلَ عَلَيْكَ فَارِسٌ مُعْلَمٌ فِي يَدِهِ طِرَادَةٌ نِصْفُهَا أَبْيَضُ وَ نِصْفُهَا أَسْوَدُ عَلَى فَرَسٍ كُمَيْتٍ أَقْرَحَ فَطَعَنَكَ فَلَمْ يَصْنَعْ فِيكَ شَيْئاً وَ ضَرَبْتَ خَيْشُومَ فَرَسِهِ فَطَرَحْتَهُ وَ حَمَلَ عَلَيْكَ آخَرُ خَارِجٌ مِنْ زُقَاقِ آلِ أَبِي عَمَّارٍ الدُّؤَلِيِّينَ عَلَيْهِ غَدِيرَتَانِ مَضْفُورَتَانِ وَ قَدْ خَرَجَتَا مِنْ تَحْتِ بَيْضَةٍ كَثِيرُ شَعْرِ الشَّارِبَيْنِ فَهُوَ وَ اللَّهِ صَاحِبُكَ فَلَا رَحِمَ اللَّهُ رِمَّتَهُ", "فَقَالَ لَهُ مُحَمَّدٌ يَا أَبَا عَبْدِ اللَّهِ حَسِبْتَ فَأَخْطَأْتَ وَ قَامَ إِلَيْهِ السُّرَاقِيُّ بْنُ سَلْخِ الْحُوتِ فَدَفَعَ فِي ظَهْرِهِ حَتَّى أُدْخِلَ السِّجْنَ وَ اصْطُفِيَ مَا كَانَ لَهُ مِنْ مَالٍ وَ مَا كَانَ لِقَوْمِهِ مِمَّنْ لَمْ يَخْرُجْ مَعَ مُحَمَّدٍ", "قَالَ فَطُلِعَ بِإِسْمَاعِيلَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرِ بْنِ أَبِي طَالِبٍ وَ هُوَ شَيْخٌ كَبِيرٌ ضَعِيفٌ قَدْ ذَهَبَتْ إِحْدَى عَيْنَيْهِ وَ ذَهَبَتْ رِجْلَاهُ وَ هُوَ يُحْمَلُ حَمْلًا فَدَعَاهُ إِلَى الْبَيْعَةِ فَقَالَ لَهُ يَا ابْنَ أَخِي إِنِّي شَيْخٌ كَبِيرٌ ضَعِيفٌ وَ أَنَا إِلَى بِرِّكَ وَ عَوْنِكَ أَحْوَجُ فَقَالَ لَهُ لَا بُدَّ مِنْ أَنْ تُبَايِعَ فَقَالَ لَهُ وَ أَيَّ شَيْ‏ءٍ تَنْتَفِعُ بِبَيْعَتِي وَ اللَّهِ إِنِّي لَأُضَيِّقُ عَلَيْكَ مَكَانَ اسْمِ رَجُلٍ إِنْ كَتَبْتَهُ قَالَ لَا بُدَّ لَكَ أَنْ تَفْعَلَ وَ أَغْلَظَ لَهُ فِي الْقَوْلِ", "لَهُ إِسْمَاعِيلُ ادْعُ لِي جَعْفَرَ بْنَ مُحَمَّدٍ فَلَعَلَّنَا نُبَايِعُ جَمِيعاً قَالَ فَدَعَا جَعْفَراً ( عليه السلام ) فَقَالَ لَهُ إِسْمَاعِيلُ جُعِلْتُ فِدَاكَ إِنْ رَأَيْتَ أَنْ تُبَيِّنَ لَهُ فَافْعَلْ لَعَلَّ اللَّهَ يَكُفُّهُ عَنَّا قَالَ قَدْ أَجْمَعْتُ أَلَّا أُكَلِّمَهُ أَ فَلْيَرَ فِيَّ بِرَأْيِهِ", "فَقَالَ فَقَالَ إِسْمَاعِيلُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنْشُدُكَ اللَّهَ هَلْ تَذْكُرُ يَوْماً أَتَيْتُ أَبَاكَ مُحَمَّدَ بْنَ عَلِيٍّ ( عليه السلام ) وَ عَلَيَّ حُلَّتَانِ صَفْرَاوَانِ فَدَامَ النَّظَرَ إِلَيَّ فَبَكَى فَقُلْتُ لَهُ مَا يُبْكِيكَ فَقَالَ لِي يُبْكِينِي أَنَّكَ تُقْتَلُ عِنْدَ كِبَرِ سِنِّكَ ضَيَاعاً لَا يَنْتَطِحُ فِي دَمِكَ عَنْزَانِ قَالَ قُلْتُ فَمَتَى ذَاكَ قَالَ إِذَا دُعِيتَ إِلَى الْبَاطِلِ فَأَبَيْتَهُ وَ إِذَا نَظَرْتَ إِلَى الْأَحْوَلِ مَشُومِ قَوْمِهِ يَنْتَمِي مِنْ آلِ الْحَسَنِ عَلَى مِنْبَرِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) يَدْعُو إِلَى نَفْسِهِ قَدْ تَسَمَّى بِغَيْرِ اسْمِهِ فَأَحْدِثْ عَهْدَكَ وَ اكْتُبْ وَصِيَّتَكَ فَإِنَّكَ مَقْتُولٌ فِي يَوْمِكَ أَوْ مِنْ غَدٍ", "فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) نَعَمْ وَ هَذَا وَ رَبِّ الْكَعْبَةِ لَا يَصُومُ مِنْ شَهْرِ رَمَضَانَ إِلَّا أَقَلَّهُ فَأَسْتَوْدِعُكَ اللَّهَ يَا أَبَا الْحَسَنِ وَ أَعْظَمَ اللَّهُ أَجْرَنَا فِيكَ وَ أَحْسَنَ الْخِلَافَةَ عَلَى مَنْ خَلَّفْتَ وَ إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ", "قَالَ ثُمَّ احْتُمِلَ إِسْمَاعِيلُ وَ رُدَّ جَعْفَرٌ إِلَى الْحَبْسِ قَالَ فَوَ اللَّهِ مَا أَمْسَيْنَا حَتَّى دَخَلَ عَلَيْهِ بَنُو أَخِيهِ بَنُو مُعَاوِيَةَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ فَتَوَطَّئُوهُ حَتَّى قَتَلُوهُ وَ بَعَثَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ إِلَى جَعْفَرٍ فَخَلَّى سَبِيلَهُ", "قَالَ وَ أَقَمْنَا بَعْدَ ذَلِكَ حَتَّى اسْتَهْلَلْنَا شَهْرَ رَمَضَانَ فَبَلَغَنَا خُرُوجُ عِيسَى بْنِ مُوسَى يُرِيدُ الْمَدِينَةَ قَالَ فَتَقَدَّمَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ عَلَى مُقَدِّمَتِهِ يَزِيدُ بْنُ مُعَاوِيَةَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ وَ كَانَ عَلَى مُقَدِّمَةِ عِيسَى بْنِ مُوسَى وُلْدُ الْحَسَنِ بْنِ زَيْدِ بْنِ الْحَسَنِ بْنِ الْحَسَنِ وَ قَاسِمٌ وَ مُحَمَّدُ بْنُ زَيْدٍ وَ عَلِيٌّ وَ إِبْرَاهِيمُ بَنُو الْحَسَنِ بْنِ زَيْدٍ فَهُزِمَ يَزِيدُ بْنُ مُعَاوِيَةَ وَ قَدِمَ عِيسَى بْنُ مُوسَى الْمَدِينَةَ وَ صَارَ الْقِتَالُ بِالْمَدِينَةِ", "لَ بِذُبَابٍ وَ دَخَلَتْ عَلَيْنَا الْمُسَوِّدَةُ مِنْ خَلْفِنَا وَ خَرَجَ مُحَمَّدٌ فِي أَصْحَابِهِ حَتَّى بَلَغَ السُّوقَ فَأَوْصَلَهُمْ وَ مَضَى ثُمَّ تَبِعَهُمْ حَتَّى انْتَهَى إِلَى مَسْجِدِ الْخَوَّامِينَ فَنَظَرَ إِلَى مَا هُنَاكَ فَضَاءٍ لَيْسَ فِيهِ مُسَوِّدٌ وَ لَا مُبَيِّضٌ فَاسْتَقْدَمَ حَتَّى انْتَهَى إِلَى شِعْبِ فَزَارَةَ ثُمَّ دَخَلَ هُذَيْلَ ثُمَّ مَضَى إِلَى أَشْجَعَ فَخَرَجَ إِلَيْهِ الْفَارِسُ الَّذِي قَالَ أَبُو عَبْدِ اللَّهِ مِنْ خَلْفِهِ مِنْ سِكَّةِ هُذَيْلَ فَطَعَنَهُ فَلَمْ يَصْنَعْ فِيهِ شَيْئاً وَ حَمَلَ عَلَى الْفَارِسِ فَضَرَبَ خَيْشُومَ فَرَسِهِ بِالسَّيْفِ فَطَعَنَهُ الْفَارِسُ فَأَنْفَذَهُ فِي الدِّرْعِ وَ انْثَنَى عَلَيْهِ مُحَمَّدٌ فَضَرَبَهُ فَأَثْخَنَهُ فَنَزَ", "وَ خَرَجَ عَلَيْهِ حُمَيْدُ بْنُ قَحْطَبَةَ وَ هُوَ مُدْبِرٌ عَلَى الْفَارِسِ يَضْرِبُهُ مِنْ زُقَاقِ الْعَمَّارِيِّينَ فَطَعَنَهُ طَعْنَةً أَنْفَذَ السِّنَانَ فِيهِ فَكُسِرَ الرُّمْحُ وَ حَمَلَ عَلَى حُمَيْدٍ فَطَعَنَهُ حُمَيْدٌ بِزُجِّ الرُّمْحِ فَصَرَعَهُ ثُمَّ نَزَلَ إِلَيْهِ فَضَرَبَهُ حَتَّى أَثْخَنَهُ وَ قَتَلَهُ وَ أَخَذَ رَأْسَهُ وَ دَخَلَ الْجُنْدُ مِنْ كُلِّ جَانِبٍ وَ أُخِذَتِ الْمَدِينَةُ وَ أُجْلِينَا هَرَباً فِي الْبِلَادِ", "قَالَ مُوسَى بْنُ عَبْدِ اللَّهِ فَانْطَلَقْتُ حَتَّى لَحِقْتُ بِإِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ فَوَجَدْتُ عِيسَى بْنَ زَيْدٍ مُكْمَناً عِنْدَهُ فَأَخْبَرْتُهُ بِسُوءِ تَدْبِيرِهِ وَ خَرَجْنَا مَعَهُ حَتَّى أُصِيبَ رَحِمَهُ اللَّهُ ثُمَّ مَضَيْتُ مَعَ ابْنِ أَخِي الْأَشْتَرِ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ حَسَنٍ حَتَّى أُصِيبَ بِالسِّنْدِ ثُمَّ رَجَعْتُ شَرِيداً طَرِيداً تُضَيَّقُ عَلَيَّ الْبِلَادُ", "فَلَمَّا ضَاقَتْ عَلَيَّ الْأَرْضُ وَ اشْتَدَّ بِيَ الْخَوْفُ ذَكَرْتُ مَا قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَجِئْتُ إِلَى الْمَهْدِيِّ وَ قَدْ حَجَّ وَ هُوَ يَخْطُبُ النَّاسَ فِي ظِلِّ الْكَعْبَةِ فَمَا شَعَرَ إِلَّا وَ أَنِّي قَدْ قُمْتُ مِنْ تَحْتِ الْمِنْبَرِ فَقُلْتُ لِيَ الْأَمَانُ يَا أَمِيرَ الْمُؤْمِنِينَ وَ أَدُلُّكَ عَلَى نَصِيحَةٍ لَكَ عِنْدِي فَقَالَ نَعَمْ مَا هِيَ قُلْتُ أَدُلُّكَ عَلَى مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ حَسَنٍ فَقَالَ لِي نَعَمْ لَكَ الْأَمَانُ", "فَقُلْتُ لَهُ أَعْطِنِي مَا أَثِقُ بِهِ فَأَخَذْتُ مِنْهُ عُهُوداً وَ مَوَاثِيقَ وَ وَثَّقْتُ لِنَفْسِي ثُمَّ قُلْتُ أَنَا مُوسَى بْنُ عَبْدِ اللَّهِ فَقَالَ لِي إِذاً تُكْرَمَ وَ تُحْبَى فَقُلْتُ لَهُ أَقْطِعْنِي إِلَى بَعْضِ أَهْلِ بَيْتِكَ يَقُومُ بِأَمْرِي عِنْدَكَ فَقَالَ لِيَ انْظُرْ إِلَى مَنْ أَرَدْتَ فَقُلْتُ عَمَّكَ الْعَبَّاسَ بْنَ مُحَمَّدٍ فَقَالَ الْعَبَّاسُ لَا حَاجَةَ لِي فِيكَ فَقُلْتُ وَ لَكِنْ لِي فِيكَ الْحَاجَةُ أَسْأَلُكَ بِحَقِّ أَمِيرِ الْمُؤْمِنِينَ إِلَّا قَبِلْتَنِي فَقَبِلَنِي شَاءَ أَوْ أَبَى", "وَ قَالَ لِيَ الْمَهْدِيُّ مَنْ يَعْرِفُكَ وَ حَوْلَهُ أَصْحَابُنَا أَوْ أَكْثَرُهُمْ فَقُلْتُ هَذَا الْحَسَنُ بْنُ زَيْدٍ يَعْرِفُنِي وَ هَذَا مُوسَى بْنُ جَعْفَرٍ يَعْرِفُنِي وَ هَذَا الْحَسَنُ بْنُ عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ يَعْرِفُنِي فَقَالُوا نَعَمْ يَا أَمِيرَ الْمُؤْمِنِينَ كَأَنَّهُ لَمْ يَغِبْ عَنَّا", "قُلْتُ لِلْمَهْدِيِّ يَا أَمِيرَ الْمُؤْمِنِينَ لَقَدْ أَخْبَرَنِي بِهَذَا الْمَقَامِ أَبُو هَذَا الرَّجُلِ وَ أَشَرْتُ إِلَى مُوسَى بْنِ جَعْفَرٍ قَالَ مُوسَى بْنُ عَبْدِ اللَّهِ وَ كَذَبْتُ عَلَى جَعْفَرٍ كَذِبَةً فَقُلْتُ لَهُ وَ أَمَرَنِي أَنْ أُقْرِئَكَ السَّلَامَ وَ قَالَ إِنَّهُ إِمَامُ عَدْلٍ وَ سَخَاءٍ", "ثُمَّ قَالَ فَأَمَرَ لِمُوسَى بْنِ جَعْفَرٍ بِخَمْسَةِ آلَافِ دِينَارٍ فَأَمَرَ لِي مِنْهَا مُوسَى بِأَلْفَيْ دِينَارٍ وَ وَصَلَ عَامَّةَ أَصْحَابِهِ وَ وَصَلَنِي فَأَحْسَنَ صِلَتِي فَحَيْثُ مَا ذُكِرَ وُلْدُ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ فَقُولُوا صَلَّى اللَّهُ عَلَيْهِمْ وَ مَلَائِكَتُهُ وَ حَمَلَةُ عَرْشِهِ وَ الْكِرَامُ الْكَاتِبُونَ وَ خُصُّوا أَبَا عَبْدِ اللَّهِ بِأَطْيَبِ ذَلِكَ وَ جَزَى مُوسَى بْنَ جَعْفَرٍ عَنِّي خَيْراً فَأَنَا وَ اللَّهِ مَوْلَاهُمْ بَعْدَ اللَّهِ ."], "translations": {"en.hubeali": ["One of our companions, from Muhammad Bin Hassan, from Muhammad Bin Ranjawiya, from Abdullah Bin Al Hakam Al Armany, from Abdullah Bin Ibrahim Bin Muhammad Al Ja’far who said, ", "‘Wen went over to Khadija daughter of Umar son of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> to console her for a son of her daughter. So we found her in the presence of Musa Bin Abdullah son of Al-Hassan<sup>asws</sup>, and she was in a corner close to the women. So we consoled them then we turned to face him, and he was saying to a daughter of Abu Yashkur Al-Rasiya, ‘Say (some words)’. ", "So she said, ‘(Of our) number (family) is Rasool-Allah<sup>saww</sup> and of our number after him<sup>saww</sup> the Lion of God, and thirdly Abbas. And (of our) number is Ali<sup>asws</sup> the best, and (of our) number is Ja’far and (of our) number is Aqeel, after him the chiefs’. So he said, ‘Excellent! It moved me. Increase it for me’. So she rushed saying, ‘And from us is the Imam of the Pious ones Muhammad<sup>saww</sup>, and Hamza<sup>as</sup> is from us<sup>asws</sup>, and the polite ones Ja’far<sup>asws</sup>, and from us<sup>asws</sup> is Ali<sup>asws</sup> his<sup>saww</sup> son-in-law and his<sup>saww</sup> cousin, and his<sup>saww</sup> horseman. That is the Purified Imam<sup>asws</sup>’. ", "So we stayed in her presence until the night almost came. Then Khadeeja said, ‘I heard my uncle Muhammad Bin Ali<sup>asws</sup> and he<sup>asws</sup> was saying: ‘But rather you need the woman regarding the mourning for the lamentations in order for the tears to flow, and it is not befitting for her that she should be saying wild exaggerations. So when the night comes, do not hurt the Angels with the lamentations’. ", "Then we went out, and we came back to her the next day, and we mentioned in her presence the isolation of her dwelling from the house of Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>. So he (Musa) said, ‘This is the house which is named as the stolen house’. So she said, ‘This is what was chosen by our Mahdi (Guide)’, meaning Muhammad Bin Abdullah Bin Al-Hassan, to tease him with that. So Musa Bin Abdullah said, ‘By Allah<sup>azwj</sup>! I shall inform you all with the strangeness I saw with my father, may Allah<sup>azwj</sup> be Pleased with him.", "When he took with the matter of Muhammad Bin Abdullah and gathered to meet his companions, so he said, ‘I do not find this matter to be straight except if I meet Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>’. So he went, and he was leaning upon me. So I went with him until we came over to Abu Abdullah<sup>asws</sup>, and we met him<sup>asws</sup> coming out intending to go to the Masjid. So my father paused him<sup>asws</sup> and spoke to him<sup>asws</sup>. So Abu Abdullah<sup>asws</sup> said to him: ‘This is not the place for this. We shall meet up, if Allah<sup>azwj</sup> so Desires it’. So my father returned joyful. ", "Then we stayed until it was the next day or after it by a day, we went until we came over to him<sup>asws</sup>. So my father entered to see him<sup>asws</sup> and I was with him, and he initiated the speech. Then he said to him<sup>asws</sup>, ‘With regards to what you<sup>asws</sup> are saying, I know, may I be sacrificed for you<sup>asws</sup>, that the age is for me over you<sup>asws</sup>, and that among your<sup>asws</sup> people there are ones who are older than you<sup>asws</sup> are, but Allah<sup>azwj</sup> Mighty and Majestic has Preceded merits for you<sup>asws</sup> which are not for anyone from your<sup>asws</sup> people, and has Made you<sup>asws</sup> to be reliable due to what is known from your<sup>asws</sup> righteousness, and what is known of your<sup>asws</sup> status, if you<sup>asws</sup> respond to me, no one from your<sup>asws</sup> companions would oppose me, and not two from the Qureysh would oppose me, nor any others’. ", "So Abu Abdullah<sup>asws</sup> said to him: ‘You will find others to be more obedient to you than me<sup>asws</sup>, and there is no need for you with regards to me<sup>asws</sup>. You should know that I<sup>asws</sup> intended (to live) in the wilderness or was thinking of it, but I<sup>asws</sup> found it too heavy of it, and I<sup>asws</sup> intended the Hajj, but I<sup>asws</sup> could not realise it except after exertion and exhaustion and difficulties upon myself<sup>asws</sup>. Therefore you should seek someone else and ask him of that, and do not let him know that you came over to me<sup>asws</sup>’. ", "So he said to him<sup>asws</sup>, ‘The people are extending their necks towards you<sup>asws</sup> and if you<sup>asws</sup> were to respond to me, no one would oppose me, and for you<sup>asws</sup> would be that you<sup>asws</sup> will neither be encumbered with the fighting nor any abhorrence’. And the people crowded upon us and they came over and cut off our speech. So my father said, ‘May I be sacrificed for you<sup>asws</sup>! What are you<sup>asws</sup> saying?’ So he<sup>asws</sup> said: ‘We shall meet up, Allah<sup>azwj</sup> Willing’. So he said, ‘Would it be upon what I like?’ So he<sup>asws</sup> said: ‘Upon what you like, Allah<sup>azwj</sup> Willing, from your correction’.", "Then he left until he came to his house, and he sent a messenger to Muhammad (living) in a mountain at Juhayna called Al-Ashqar, which was two nights (journey) from Al-Medina. So he gave him glad tidings and let him know that there was success for him with respect to his need and what he sought (help of Abu Abdullah<sup>asws</sup> for the uprising against the ruling authorities). ", "Then he returned after three days and paused at the door, and we were not barred from the door when we came, as the messenger was delayed. Then we had permission for us, so we entered to see him<sup>asws</sup>. So we were seated in a corner of the room and my father went near to him<sup>asws</sup> and kissed his<sup>asws</sup> head, then said, ‘May I be sacrificed for you<sup>asws</sup>! I have returned to you<sup>asws</sup> hoping, expecting, and I have unrolled my hopes and my expectation and begging for the realisation of my need’. ", "So Abu Abdullah<sup>asws</sup> said to him: ‘O son of my<sup>asws</sup> uncle! I<sup>asws</sup> seek Refuge with Allah<sup>azwj</sup> from the exposure to this matter which you are indulging in, and I<sup>asws</sup> am afraid over you that you might amass evil’. So there flowed the speech between them until it led to what he had not wanted from his speech, ‘By which thing was Al-Husayn<sup>asws</sup> more rightful with it than Al-Hassan<sup>asws</sup>?’ So Abu Abdullah<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> have Mercy on Al-Hassan<sup>asws</sup> and have Mercy on Al-Husayn<sup>asws</sup>. And how could you mention this?’ He said, ‘Because Al-Husayn<sup>asws</sup>, it was befitting for him<sup>asws</sup> when he<sup>asws</sup> was just that he<sup>asws</sup> should have made it (Imamate) to be in the eldest one from the sons of Al-Hassan<sup>asws</sup>’. ", "So Abu Abdullah<sup>asws</sup> said: ‘Alllah<sup>azwj</sup> Blessed and Hish, when He<sup>azwj</sup> Revealed unto Muhammad<sup>saww</sup>, Revealed unto him<sup>saww</sup> with whatever He<sup>azwj</sup> so Desired to and did not Command anyone from His<sup>azwj</sup> creatures, and Muhammad<sup>saww</sup> instructed Ali<sup>asws</sup> with whatever he<sup>saww</sup> so desired to, so he<sup>asws</sup> did whatever he<sup>asws</sup> was instructed with, and we<sup>asws</sup> are not saying with regards to it except what Rasool-Allah<sup>saww</sup> said from his (Al-Husayn<sup>asws</sup>’s) veneration and his<sup>asws</sup> ratification. ", "So, had he<sup>saww</sup> instructed Al-Husayn<sup>asws</sup> that he<sup>asws</sup> should make it to be in the eldest one or transfer it to be in their<sup>asws</sup> sons, meaning the successorship, he<sup>asws</sup> would have done that, and he<sup>asws</sup> is not with an accusation in our<sup>asws</sup> presence with regards to hoarding it for himself<sup>asws</sup>, and he<sup>asws</sup> was a Guardian (<span class=\"iTxt\">Wali</span>) and he could have neglected that, but he<sup>asws</sup> accomplished whatever he<sup>asws</sup> had been instructed with, and he<sup>asws</sup> is your grandfather and your uncle. Thus, if you were to speak good then you would be closer with it, and if you were to speak vanities, then may Allah<sup>azwj</sup> Forgive you.", "So if you were to obey me<sup>asws</sup>, O son of my<sup>asws</sup> uncle, and listen to my speech, by Allah<sup>azwj</sup> the One<sup>azwj</sup> there is no god except for Him<sup>azwj</sup>, I<sup>asws</sup> have advised you and ordered you, so how come I<sup>asws</sup> do not see you doing what is the Command of Allah<sup>azwj</sup> from what is due?’ So my father was joyful during that. ", "So Abu Abdullah<sup>asws</sup> said to him: ‘By Allah<sup>azwj</sup>! You know that the squint-eyed one with few hairs would be killed by the door of Ashja’a at the bottom of its (water) flow’. So my father said, ‘It is not like that. By Allah<sup>azwj</sup>! He would be battling them with a day for a day, and with an hour for an hour, and with a year for a year, and he would straighten (avenge) for the rest of the clan of Abu Talib<sup>asws</sup> altogether’.  ", "So Abu Abdullah<sup>asws</sup> said to him: ‘What I<sup>asws</sup> fear is that this couplet would happen to be attached to our companion, ‘You clothed yourself with straying in private’. No, by Alah<sup>azwj</sup>! He will not control any more that the walls of Al-Medina nor would his word reach Al-Taef when he tries, meaning when he strives himself, and what is inevitable to happen will occur. Therefore, fear Allah<sup>azwj</sup> and have mercy on yourself and the sons of your father, for by Allah<sup>azwj</sup>, I<sup>asws</sup> see him as the most ill-fated of the weapons which the loins of men have brought out to the wombs of the women. ", "By Allah<sup>azwj</sup>! He would be killed by the doorway of Ashja’a between its houses. By Allah<sup>azwj</sup>! It is as if I<sup>asws</sup> am (seeing) him in bits, crucified, with a brick in between his legs, and it is not befitting this boy what he is hearing’. Musa Bin Abdullah said, ‘He<sup>asws</sup> meant me’. ", "‘And he would be going out with him, so he would be defeated and his companion would be killed. So he would be going out with another banner, and its commander would be killed and his army would disperse. But, if he were to obey me<sup>asws</sup>, so let him seek the security during that from the Clan of Al-Abbas until Allah<sup>azwj</sup> Brings him the relief. And you know that this matter would not be completed and you know and we<sup>asws</sup> know that your son, the squint-eyed of few hairs will be killed by the doorway of Ashja’a between its houses by the bottom of its (water) flows’. ", "So my father stood up and he was saying, But Allah<sup>azwj</sup> would Make us to be needless of you<sup>asws</sup> and He<sup>azwj</sup> would Return you<sup>asws</sup> or Join you<sup>asws</sup> up with the others, and you<sup>asws</sup> are not intending with this except to prevent others, and that you<sup>asws</sup> would become their reason to that (for not helping us)’. So Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Knows what I<sup>asws</sup> do not intend except to advise you and guide you, and there isn’t upon me<sup>asws</sup> except for the trying’. ", "So my father arose, dragging his clothes in anger. So Abu Abdullah<sup>asws</sup> reached out to him And said to him: ‘I<sup>asws</sup> am informing you that I<sup>asws</sup> heard your uncle and he is your maternal uncle, mentioning that you and the sons of our father would soon be getting killed, so if you were to obey me<sup>asws</sup> and if you view that you should defend with that which is better, so do it. ", "By Allah<sup>azwj</sup>, Who, there is no god except for Him<sup>azwj</sup>, the Knower of the unseen and the seen, the Beneficent, the Merciful, the Greatest, the Exalted over His<sup>azwj</sup> creatures, you are beloved and I<sup>asws</sup> would ransom you with my<sup>asws</sup> children, and by the most beloved ones to me, and by the most beloved ones of my<sup>asws</sup> family to me, and nothing equates with you in my<sup>asws</sup> presence. Therefore do not view that I<sup>asws</sup> have deceived you’. So my father exited from his<sup>asws</sup> presence, angry, aggrieved. ", "He (the narrator) said, ‘So we did not stay after that except for a little, maybe twenty nights or so until messengers of (the Caliph) Abu Ja’far (Al-Mansour) came over and seized my father, and my uncles Suleyman Bin Hassan, and Hassan Bin Hassan, and Ibrahim Bin Hassan, and Dawood Bin Hassan, and Ali Bin Hassan, and Suleyman Bin Dawood Bin Hassan, and Ali Bin Ibrahim Bin Hassan, and Hassan Bin Ja’far Bin Hassan, and Tabataba Ibrahim Bin Ismail Bin Hassan, and Abdullah Bin Dawood. ", "He (the narrator) said, ‘So they were shackled in the iron (shackles), then they were carried in bare carriages. There being no covering therein and they were paused at the praying place so that perhaps the people might insult them. But the people refrained from them and were kind to them due to the state which they were in. Then they went with them until they were paused by the door of the Masjid of Rasool-Allah<sup>saww</sup>’.", "Abdullah Bin Ibrahim Al-Ja’fary said, ‘Khadeeja Bint Umar Bin Ali narrated to us that whey they were paused by the door of the Masjid which was called Jibraeel<sup>as</sup> door, Abu Abdullah<sup>asws</sup> emerged unto them and the generality of his<sup>asws</sup> robe was dragging in the ground. Then he<sup>asws</sup> emerged from the door of the Masjid and he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Curse you all, O group of the Helpers!’ - three times. (Then said): ‘It was not upon this that Rasool-Allah<sup>saww</sup> Covenanted with you nor did you all pledge allegiance to him<sup>saww</sup> (upon this). But, by Allah<sup>azwj</sup>, I was careful, but it is as if I<sup>asws</sup> have been overcome, and there is no repelling the Ordainment’. ", "Then he<sup>asws</sup> arose and grabbed one of his<sup>asws</sup> slippers and inserted his<sup>asws</sup> leg, and the other one was in his<sup>asws</sup> hand, and the generality of his<sup>asws</sup> robe was flowing in the ground. Then he<sup>asws</sup> entered into his<sup>asws</sup> house, and was feverish for twenty nights. He<sup>asws</sup> did not cease to weep during it day and night until we<sup>asws</sup> feared upon him<sup>asws</sup>. So this is the Hadeeth of Khadeeja.", "And Musa Bin Abdullah Bin Al-Hassan narrated to us that when they emerged with the group in the carriages, Abu Abdullah<sup>asws</sup> stood up from the Masjid, then went towards the carriage in which was Abdullah Bin Al-Hassan, intending to speak to him<sup>asws</sup>, but he<sup>asws</sup> was prevented with the most intense of the preventions, and guard pushed him<sup>asws</sup> away and said, ‘Stay away from this, may Allah<sup>azwj</sup> Stop you<sup>asws</sup> and others’. Then they entered them into an alleyway, and Abu Abdullah<sup>asws</sup> returned to his<sup>asws</sup> house. ", "So he had not reached with them to Al-Baqi’e (the cemetery) until the guard was afflicted with an intense difficulty. His she-camel threw him off and his hip was pulverized and he died during it, and they went with the group. So we stayed after that for a while, then Muhammad Bin Abdullah Bin Hassan came over and informed that his father and his uncles had been killed. Abu Ja’far (Al-Mansour the Caliph) had killed them, except for Hassan Bin Ja’far, and Tabataba, and Ali Bin Ibrahim, and Suleyman Bin Dawood, and Dawood Bin Hassan, and Abdullah Bin Dawood.", "He (the narrator) said, ‘So Muhammad Bin Abdullah appeared during that and called the people to his allegiance. So we were three who pledged allegiance to him and urged the people to pledge allegiance to him, and neither the Qureysh opposed him, nor the Helpers, nor the Bedouins. And he consulted Isa Bin Zayd, and he was from his trustworthy ones, and he was (a commander) upon his police force. So he consulted him regarding the sending to face his people. So Isa Bin Zayd said to him, ‘If you call them with an easy calling, they will not answer you, or you should be harsh upon them. Therefore leave me and them’. So Muhammad said to him, ‘Go to whoever you intend from them’.", "So he said, ‘Go to their chiefs and their elders, meaning Abu Abdullah Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>, for if you are harsh upon him<sup>asws</sup>, they would all know that you will make them pass upon the path which you passed Abu Abdullah<sup>asws</sup> upon’. So it was not long before they came with Abu Abdullah<sup>asws</sup> until they paused him<sup>asws</sup> in front of him. So Isa Bin Zayd said to him<sup>asws</sup>, ‘Submit, you<sup>asws</sup> will be safe’. ", "So he (the narrator) said, ‘So Abu Abdullah<sup>asws</sup> said to him: ‘Are you initiating a new Prophet-hood after Muhammad<sup>saww</sup>?’ So Muhammad said to him<sup>asws</sup>, ‘No, but pledge allegiance and be secure upon yourself<sup>asws</sup>, and your<sup>asws</sup> wealth, and your<sup>asws</sup> children and you will not be encumbered with war’. So Abu Abdullah<sup>asws</sup> said to him: ‘I<sup>asws</sup> am neither indulging in war nor fighting, and I<sup>asws</sup> had preceded to your father and cautioned him what he would be caught up with, but a caution cannot benefit from the pre-determination.", "O son of my<sup>asws</sup> brother! Upon you is with the youth, and leave off from the elderly’. So Muhammad said to him<sup>asws</sup>, ‘How near it is what is between me and you<sup>asws</sup> in age’. So Abu Abdullah<sup>asws</sup> said to him: ‘I<sup>asws</sup> have not harmed you and did not come to proceed against you with regards to what you are in’. So Muhammad said to him, ‘No, by Allah<sup>azwj</sup>! It is inevitable that you<sup>asws</sup> must pledge allegiance’. So Abu Abdullah<sup>asws</sup> said to him: ‘O son of my<sup>asws</sup> brother! I<sup>asws</sup> did not come seeking (worldly gains), nor a war, and I<sup>asws</sup> wanted to go out to the wilderness, but that was difficult upon me<sup>asws</sup> and heavy upon me<sup>asws</sup>, to the extent that the family spoke to me<sup>asws</sup> regarding that more than once, and nothing prevented me<sup>asws</sup> from it except for (physical) weakness. By Allah<sup>azwj</sup> and the womb relationship, turn away from us<sup>asws</sup> and our<sup>asws</sup> misfortune with you’. ", "So he said to him<sup>asws</sup>, ‘O Abu Abdullah<sup>asws</sup>! Abu Al-Dawaneeq, meaning Abu Ja’far (Al-Mansour the Caliph) has died!’ So Abu Abdullah<sup>asws</sup> said: ‘And what are you doing with me<sup>asws</sup> and he has died?’ He<sup>asws</sup> said: ‘I want the majesty with you<sup>asws</sup>’. He<sup>asws</sup> said: ‘There is no way to what you are intending. By Allah<sup>azwj</sup>! Abu Ja’far (Al Mansour) has not died except if he has happened to have died the death of sleep’. He said, ‘By Allah<sup>azwj</sup>! You<sup>asws</sup> will either pledge allegiance to me willingly or unwillingly, and there is no praise in your<sup>asws</sup> pledging allegiance’. But he<sup>asws</sup> refused upon him with intense refusal, and he ordered with him<sup>asws</sup> to the prison.", "So Isa Bin Zayd said to him, ‘But, if you were to throw him<sup>asws</sup> in the prison, and the prison has been ruined, and there is no lock upon it today. We fear that he<sup>asws</sup> might flee from it’. So Abu Abdullah<sup>asws</sup> smiled, then said: ‘There is neither a Might nor Strength except with Allah<sup>azwj</sup>, the Exalted, the Magnificent! Or do you think you will be imprisoning me<sup>asws</sup>?’ He said, ‘Yes, by the One<sup>azwj</sup> Who Honoured Muhammad<sup>saww</sup> with the Prophet-hood, I will be imprisoning you<sup>asws</sup> and will be intensely harsh upon you<sup>asws</sup>’. ", "So Isa Bin Zayd said, ‘Withhold him<sup>asws</sup> in the hide-out, and that is the house of Rayta today’. So Abu Abdullah<sup>asws</sup> said: ‘But, by Allah<sup>azwj</sup>, I<sup>asws</sup> shall be saying (something) and I<sup>asws</sup> will be ratified’. So Isa Bin Zayd said, ‘If you speak, I shall break your<sup>asws</sup> mouth’. So Abu Abdullah<sup>asws</sup> said to him: ‘But, by Allah<sup>azwj</sup>, O bald one, O blue-eyed one! It is as if I<sup>asws</sup> see you looking for a hole for yourself to enter into, and you will not be among the mentioned ones during the meeting (the enemy during battles), and I<sup>asws</sup> think that when (someone) claps behind you, you will flee like the fleeing ostrich. So Muhammad rushed upon it with the rebuke, ‘Withhold him<sup>asws</sup>, and be severe upon him<sup>asws</sup>, and be harsh upon him<sup>asws</sup>’. ", "So Abu Abdullah<sup>asws</sup> said to him: ‘But, by Allah<sup>azwj</sup>, it is as if I<sup>asws</sup> am with you (seeing you) coming out from the doorway of Ashja’a to the base of the valley and an informant horseman has attacked you, there being a lance in his hand, half of it white and half of it black, upon a Kumeyt horse (brown with white forehead), so he stabs you, but it does not do anything to you, and you strike the nose of his horse, so it throws him. And another one attacks upon you, outside from the alleyway of the family of Abu Ammar Al-Dowliyayn. Upon him are two braids of hair and they are coming out from his helmet, being of a lot of hair of the moustache. So he, by Allah<sup>azwj</sup>, is your companion (who will kill you). May Allah<sup>azwj</sup> not have Mercy on his bones’. ", "So Muhammad said to him<sup>asws</sup>, ‘O Abu Abdullah<sup>asws</sup>! You<sup>asws</sup> counted, but erred’, and Al-Surraqy Bin Sulkh Al-Howt stood up to him<sup>asws</sup> and pushed him<sup>asws</sup> in his<sup>asws</sup> back until he<sup>asws</sup> entered into the prison, and they chose (plundered) whatever was for him<sup>asws</sup> from the wealth and whatever was for his<sup>asws</sup> group from the ones who did not come out along with Muhammad. ", "He (the narrator) said, ‘So they emerged with Ismail Bin Abdullah Bin Ja’far<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and he was an aged old man, weak, and one of his eyes (sight) had gone, and both his legs had gone, and he was carried by a carrier. So he called him to his allegiance. So he said to him, ‘O son of my brother! I am an aged old man, weak, and I am (at the mercy of) your righteousness, and needy to your forgiveness’. So he said to him, ‘It is inevitable that you pledge allegiance’. So he said to him, ‘And which thing would you benefit by the pledge of my allegiance? By Allah<sup>azwj</sup>! I would be restricting upon you the place of the name of (another) man, if you were to write him’. He said, ‘It is inevitable that you do so’, and he was harsh upon him with the words. ", "So Ismail said to him, ‘Call Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> for me, so we can pledge allegiance together’. So he called Ja’far<sup>asws</sup>. So Ismail said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! If you<sup>asws</sup> see it fit, you<sup>asws</sup> could clarify to him, then do so, perhaps Allah<sup>azwj</sup> would Refrain him from us’. He<sup>asws</sup> said: ‘I<sup>asws</sup> have decided that I<sup>asws</sup> shall not speak to him, so let him view with regards to me<sup>asws</sup> by his opinion’. ", "So Ismail said to Abu Abdullah<sup>asws</sup>, ‘I adjure you<sup>asws</sup> with Allah<sup>azwj</sup>! Do You<sup>asws</sup> remember the day I came over to your<sup>asws</sup> father<sup>asws</sup> Muhammad Bin Ali<sup>asws</sup>, and upon me were two yellow garments. So he<sup>asws</sup> looked at me for long, ane he<sup>asws</sup> wept. So I said to him<sup>asws</sup>, ‘What makes you<sup>asws</sup> weep?’ So he<sup>asws</sup> said to me: ‘It makes me weep that you would be killed during old age wastefully, no two goats would butt their heads regarding your blood’. I said, ‘So when would that be?’ He<sup>asws</sup> said: ‘When you will be called to the falsehood and you would refuse, and you will look at the squint-eyed one of his people belonging to the progeny of Al-Hassan<sup>asws</sup>, being upon the Pulpit of Rasool-Allah<sup>saww</sup>, calling (the people) to himself, having being named with other than his name. So renew your oath and write out your will for you would be killed during your day or the next’.", "So Abu Abdullah<sup>asws</sup> said to him: ‘Yes, and this one (Muhammad), by the Lord<sup>azwj</sup> of the Kabah, does not Fast from the Month of Ramazan except for a few (days). Therefore trust Allah<sup>azwj</sup>, O Abu Al-Hassan, and may Allah<sup>azwj</sup> Magnify our<sup>asws</sup> Recompense regarding you, and Keep well the ones whom you leave behind, and we are for Allah<sup>azwj</sup> and to Him<sup>azwj</sup> we are returning’. ", "He (the narrator) said, ‘The Ismail was carried away and Ja’far<sup>asws</sup> was returned to the detention. So, by Allah<sup>azwj</sup>, we had not even seen the evening before the sons of his brother, the clan of Mauawiya Bin Abdullah Bin Ja’far, so they trampled him (Ismail) until they killed him, and Muhammad Bin Abdullah sent a messenger to Ja’far<sup>asws</sup> and freed his<sup>asws</sup> way.", "He (the narrator) said, ‘And we stayed after that until we saw the crescent of the Month of Ramazan, and we came across the rising of Isa Bin Musa, intending Al-Medina. So Muhammad Bin Abdullah proceeded upon the leading (of the army) by Yazeed Bin Muawiya Bin Abdullah Bin Ja’far, and it was so that upon the front of (the army of) Isa Bin Musa were the sons of Al-Hassan Bin Zayd Bin Al-Hassan Bin Al-Hassan, and Qasim, and muhammad Bin Zayd and Ali Bin Ibrahim, sons of Al-Hassan Bin Zayd. So Yazeed Bin Muawiya was defeated and Isa Bin Musa proceeded to Al-Medina, and the fighting was at Al-Medina.", "So he (Isa) encamped at Zubab, and the blacks (black banners of the Abbasides) came upon us from behind us, and Muhammad went out among his companions until he reached the marketplace. So he arrived to them and went, then pursued them until he ended up to the Masjid Al-Khawameen. So he looked around to what was placed over there. There weren’t any blacks (Abbasides) nor any whites. So he proceeded until he ended up to the cave of Fazarat. Then he entered Huzayl, then went to Ashja’a. So there came out to him the horsemen whom Abu Abdullah<sup>asws</sup> had spoken of, from behind him, from the doorway of Huzayl and stabbed him. But it did not waste anything in him, and he attacked upon the horseman and struck the nose of his horse with the sword. So the horseman stabbed him and penetrated his armour and Muhammad retaliated upon him and struck him, and killed him.", "And there came out upon him, Humeyd Bin Qahtaba, and his back was turned upon the horse, and he struck him from the alleyway of Ammariyeen. So he stabbed him with a stabbing, and the spearhead got stuck and the spear broke during it. And he attacked upon Humeyd, and Humeyd stabbed him with the head of the spear and wounded him. Then he descended unto him, and he struck him until he ripped him and killed him, and took his head and the army entered from every side, and took Al-Medina, and we were exiled fleeing in the land.", "Musa Bin Abdullah said, ‘So I went until I met up with Ibrahim Bin Abdullah, and I found Isa Bin Zayd hiding with him. So I informed him of the evil of his plan and we went out with him until he died, may Allah<sup>azwj</sup> have Mercy on him. Then I went with the son of my brother Al-Ashtar Abdullah Bin Muhammad Bin Abdullah Bin Hassan until he died at Al-Sind. Then I returned, fearfully, a fugitive, the land being constricted upon me. ", "So when the land was constricted upon me and the fear intensified with me, I remembered what Abu Abdullah<sup>asws</sup> had said. So I went over to Al-Mahdi (the Abbaside Caliph), and he had performed Hajj and he was addressing the people in the shade of the Kabah. So he was not aware except that I had been standing beneath the pulpit. So I said, ‘(Grant) the security for me, O commander of the faithful, and I shall point you upon an advice for you which is with me’. So he said, ‘Yes, and what is it?’ I said, ‘I shall point you upon Musa Bin Abdullah Bin Hassan’. So he said to me, ‘Yes, for you is the security’. ", "So I said to him, ‘Give me what I can rely with’. So I took an oath from him and a covenant and what I could trust for myself, then I said, ‘I am Musa Bin Abdullah’. So he said to me, ‘Then you shall be honoured and respected’. So I said to him, ‘Cut me off (for support) to someone from your family who would stand with my affairs in your presence’. So he said to me, ‘Look at the one whom you intend’. So I said, ‘Your uncle Al-Abbas Bin Muhammad’. So Al-Abbas said, ‘There is no need for me with regards to you’. So I said, ‘But, there is a need for me regarding you. I ask you by the right of until you accept me’. So accept me willingly or refuse’. ", "And Al-Mahdy said to me, ‘Who recognises you?’ And around him were our companions, or most of them. So I said, ‘This one, Al-Hassan Bin Zayd knows me, and this one Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> knows me, and this Al-Hassan Bin Abullah Bin Al-Abbas knows me’. So they said, ‘Yes, O commander of the faithful, it is as if he was never absent from us’.  ", "Then I said to Al-Mahdy, ‘O Amir Al-Momineen! He<sup>asws</sup> informed me of this place, the father<sup>asws</sup> of this man<sup>asws</sup>’, and I gestured towards Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>. Musa Bin Abdullah said, ‘And I lied upon Ja’far<sup>asws</sup> with a lied, so I said to him (the Caliph), ‘And he<sup>asws</sup> instructed me that I should convey the greetings to you, and he<sup>asws</sup> said that he (the Caliph) is a just leader and generous’. ", "Then he (the narrator) said, ‘So he (the Caliph) ordered for five thousand Dinar to be given to Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>, and from it Musa<sup>asws</sup> ordered with two thousand Dinars to be given to me, and he<sup>asws</sup> helped the generality of his<sup>asws</sup> companions and helped me, so excellent was his<sup>asws</sup> helping me. So wherever the sons of Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> are mentioned, so you should be saying, ‘May Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawat</span> upon them, (as well as) His<sup>azwj</sup> Angels, and the bearers of His<sup>azwj</sup> Throne, and the Honourable Recorders, in particular Abu Abdullah<sup>asws</sup> with the best of that, and Recompense Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> with goodness from me, for I, by Allah<sup>azwj</sup>, am their slave, after Allah<sup>azwj</sup>’."]}}, {"index": 934, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:18", "text": ["وَ بِهَذَا الْإِسْنَادِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرِ بْنِ إِبْرَاهِيمَ الْجَعْفَرِيِّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُفَضَّلِ مَوْلَى عَبْدِ اللَّهِ بْنِ جَعْفَرِ بْنِ أَبِي طَالِبٍ قَالَ لَمَّا خَرَجَ الْحُسَيْنُ بْنُ عَلِيٍّ الْمَقْتُولُ بِفَخٍّ وَ احْتَوَى عَلَى الْمَدِينَةِ دَعَا مُوسَى بْنَ جَعْفَرٍ إِلَى الْبَيْعَةِ فَأَتَاهُ فَقَالَ لَهُ يَا ابْنَ عَمِّ لَا تُكَلِّفْنِي مَا كَلَّفَ ابْنُ عَمِّكَ عَمَّكَ أَبَا عَبْدِ اللَّهِ فَيَخْرُجَ مِنِّي مَا لَا أُرِيدُ كَمَا خَرَجَ مِنْ أَبِي عَبْدِ اللَّهِ مَا لَمْ يَكُنْ يُرِيدُ ", "فَقَالَ لَهُ الْحُسَيْنُ إِنَّمَا عَرَضْتُ عَلَيْكَ أَمْراً فَإِنْ أَرَدْتَهُ دَخَلْتَ فِيهِ وَ إِنْ كَرِهْتَهُ لَمْ أَحْمِلْكَ عَلَيْهِ وَ اللَّهُ الْمُسْتَعَانُ ثُمَّ وَدَّعَهُ فَقَالَ لَهُ أَبُو الْحَسَنِ مُوسَى بْنُ جَعْفَرٍ حِينَ وَدَّعَهُ يَا ابْنَ عَمِّ إِنَّكَ مَقْتُولٌ فَأَجِدَّ الضِّرَابَ فَإِنَّ الْقَوْمَ فُسَّاقٌ يُظْهِرُونَ إِيمَاناً وَ يَسْتُرُونَ شِرْكاً وَ إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ أَحْتَسِبُكُمْ عِنْدَ اللَّهِ مِنْ عُصْبَةٍ ", "ثُمَّ خَرَجَ الْحُسَيْنُ وَ كَانَ مِنْ أَمْرِهِ مَا كَانَ قُتِلُوا كُلُّهُمْ كَمَا قَالَ ( عليه السلام ) ."], "translations": {"en.hubeali": ["And by this chain, from Abdullah Bin Ja’far Bin Ibrahim Al Ja’fary who said, ‘Abdullah Bin Al Mufazzal, a slave of Abdullah Bin Ja’far Bin Abu Talib narrated to us saying, ", "‘When Al-Husayn Bin Ali, the one killed at Fajhha went out (against the ruling authorities) and established upon Al-Medina, Musa<sup style=\"font-weight: normal\">asws</sup> Bin Ja’far<sup style=\"font-weight: normal\">asws</sup> called to the allegiance. So he went to him<sup style=\"font-weight: normal\">asws</sup>. So he<sup style=\"font-weight: normal\">asws</sup> said to him: ‘O son of my<sup style=\"font-weight: normal\">asws</sup> uncle! Do not encumber me<sup style=\"font-weight: normal\">asws</sup> what the son of your uncle encumbered upon Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, so there would come out from me<sup style=\"font-weight: normal\">asws</sup> what I<sup style=\"font-weight: normal\">asws</sup> do not want, just as it came out from my<sup style=\"font-weight: normal\">asws</sup> father<sup style=\"font-weight: normal\">asws</sup> Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, and what you do not want would happen’. ", "So Al-Husayn said, ‘But rather, I shall present a matter to you<sup style=\"font-weight: normal\">asws</sup>, so if you<sup style=\"font-weight: normal\">asws</sup> want, enter into it, and if you<sup style=\"font-weight: normal\">asws</sup> dislike, I shall not burden it upon you<sup style=\"font-weight: normal\">asws</sup>, and Allah<sup style=\"font-weight: normal\">azwj</sup> is the Aider’. Then he bade him<sup style=\"font-weight: normal\">asws</sup> farewell. So Abu Al-Hassan Musa<sup style=\"font-weight: normal\">asws</sup> Bin Ja’far<sup style=\"font-weight: normal\">asws</sup> said to him when he bade him<sup style=\"font-weight: normal\">asws</sup> farewell: ‘O son of my<sup style=\"font-weight: normal\">asws</sup> uncle! You will be killed, therefore fight forcefully, for the people are transgressors. They are displaying Eman and they are veiling <span class=\"iTxt\">Shirk</span>, and we are for Allah<sup style=\"font-weight: normal\">azwj</sup> and to Him<sup style=\"font-weight: normal\">azwj</sup> we are returning. Your Reckoning is in the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup>, from the disobedient ones’. ", "Then Al-Husayn went out, and it was from his affair what was, and all of them were killed just as he<sup style=\"font-weight: normal\">asws</sup> had said’."]}}, {"index": 935, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:1:4:81:19", "text": ["وَ بِهَذَا الْإِسْنَادِ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ الْجَعْفَرِيِّ قَالَ كَتَبَ يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ الْحَسَنِ إِلَى مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) أَمَّا بَعْدُ فَإِنِّي أُوصِي نَفْسِي بِتَقْوَى اللَّهِ وَ بِهَا أُوصِيكَ فَإِنَّهَا وَصِيَّةُ اللَّهِ فِي الْأَوَّلِينَ وَ وَصِيَّتُهُ فِي الْآخِرِينَ خَبَّرَنِي مَنْ وَرَدَ عَلَيَّ مِنْ أَعْوَانِ اللَّهِ عَلَى دِينِهِ وَ نَشْرِ طَاعَتِهِ بِمَا كَانَ مِنْ تَحَنُّنِكَ مَعَ خِذْلَانِكَ وَ قَدْ شَاوَرْتُ فِي الدَّعْوَةِ لِلرِّضَا مِنْ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ قَدِ احْتَجَبْتَهَا وَ احْتَجَبَهَا أَبُوكَ مِنْ قَبْلِكَ وَ قَدِيماً ادَّعَيْتُمْ مَا لَيْسَ لَكُمْ وَ بَسَطْتُمْ آمَالَكُمْ إِلَى مَا لَمْ يُعْطِكُمُ اللَّهُ فَاسْتَهْوَيْتُمْ وَ أَضْلَلْتُمْ وَ أَنَا مُحَذِّرُكَ مَا حَذَّرَكَ اللَّهُ مِنْ نَفْسِهِ ", "فَكَتَبَ إِلَيْهِ أَبُو الْحَسَنِ مُوسَى بْنُ جَعْفَرٍ ( عليه السلام ) مِنْ مُوسَى بْنِ أَبِي عَبْدِ اللَّهِ جَعْفَرٍ وَ عَلِيٍّ مُشْتَرِكَيْنِ فِي التَّذَلُّلِ لِلَّهِ وَ طَاعَتِهِ إِلَى يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ حَسَنٍ أَمَّا بَعْدُ فَإِنِّي أُحَذِّرُكَ اللَّهَ وَ نَفْسِي وَ أُعْلِمُكَ أَلِيمَ عَذَابِهِ وَ شَدِيدَ عِقَابِهِ وَ تَكَامُلَ نَقِمَاتِهِ وَ أُوصِيكَ وَ نَفْسِي بِتَقْوَى اللَّهِ فَإِنَّهَا زَيْنُ الْكَلَامِ وَ تَثْبِيتُ النِّعَمِ", "أَتَانِي كِتَابُكَ تَذْكُرُ فِيهِ أَنِّي مُدَّعٍ وَ أَبِي مِنْ قَبْلُ وَ مَا سَمِعْتَ ذَلِكَ مِنِّي وَ سَتُكْتَبُ شَهَادَتُهُمْ وَ يُسْأَلُونَ وَ لَمْ يَدَعْ حِرْصُ الدُّنْيَا وَ مَطَالِبُهَا لِأَهْلِهَا مَطْلَباً لآِخِرَتِهِمْ حَتَّى يُفْسِدَ عَلَيْهِمْ مَطْلَبَ آخِرَتِهِمْ فِي دُنْيَاهُمْ ", "وَ ذَكَرْتَ أَنِّي ثَبَّطْتُ النَّاسَ عَنْكَ لِرَغْبَتِي فِيمَا فِي يَدَيْكَ وَ مَا مَنَعَنِي مِنْ مَدْخَلِكَ الَّذِي أَنْتَ فِيهِ لَوْ كُنْتُ رَاغِباً ضَعْفٌ عَنْ سُنَّةٍ وَ لَا قِلَّةُ بَصِيرَةٍ بِحُجَّةٍ وَ لَكِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى خَلَقَ النَّاسَ أَمْشَاجاً وَ غَرَائِبَ وَ غَرَائِزَ فَأَخْبِرْنِي عَنْ حَرْفَيْنِ أَسْأَلُكَ عَنْهُمَا مَا الْعَتْرَفُ فِي بَدَنِكَ وَ مَا الصَّهْلَجُ فِي الْإِنْسَانِ ", "ثُمَّ اكْتُبْ إِلَيَّ بِخَبَرِ ذَلِكَ وَ أَنَا مُتَقَدِّمٌ إِلَيْكَ أُحَذِّرُكَ مَعْصِيَةَ الْخَلِيفَةِ وَ أَحُثُّكَ عَلَى بِرِّهِ وَ طَاعَتِهِ وَ أَنْ تَطْلُبَ لِنَفْسِكَ أَمَاناً قَبْلَ أَنْ تَأْخُذَكَ الْأَظْفَارُ وَ يَلْزَمَكَ الْخِنَاقُ مِنْ كُلِّ مَكَانٍ فَتَرَوَّحَ إِلَى النَّفَسِ مِنْ كُلِّ مَكَانٍ وَ لَا تَجِدُهُ حَتَّى يَمُنَّ اللَّهُ عَلَيْكَ بِمَنِّهِ وَ فَضْلِهِ وَ رِقَّةِ الْخَلِيفَةِ أَبْقَاهُ اللَّهُ فَيُؤْمِنَكَ وَ يَرْحَمَكَ وَ يَحْفَظَ فِيكَ أَرْحَامَ رَسُولِ اللَّهِ وَ السَّلَامُ عَلَى مَنِ اتَّبَعَ الْهُدَى إِنَّا قَدْ أُوحِيَ إِلَيْنَا أَنَّ الْعَذَابَ عَلَى مَنْ كَذَّبَ وَ تَوَلَّى", "قَالَ الْجَعْفَرِيُّ فَبَلَغَنِي أَنَّ كِتَابَ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) وَقَعَ فِي يَدَيْ هَارُونَ فَلَمَّا قَرَأَهُ قَالَ النَّاسُ يَحْمِلُونِّي عَلَى مُوسَى بْنِ جَعْفَرٍ وَ هُوَ بَرِي‏ءٌ مِمَّا يُرْمَى بِهِ ."], "translations": {"en.hubeali": ["And by this chain, from Abdullah Bin Ibrahim Al Ja’fary who said, ", "‘Yahya Bin Abdullah Bin Al-Hassan wrote to Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>, ‘As for afterwards, So I hereby bequeath myself to fear Allah<sup>azwj</sup>, and by it I bequeath you<sup>asws</sup>, for it is a Bequest of Allah<sup>azwj</sup> among the former ones and His<sup>azwj</sup> Bequest among the later ones. They have informed me, the ones who came to me, from the supporters of Allah<sup>azwj</sup> upon His<sup>azwj</sup> Religion and (those who) spread His<sup>azwj</sup> obedience, with what has been from your<sup>asws</sup> sympathy and your<sup>asws</sup> abandonment (of us), and I had consulted regarding the claiming to the agreeable one from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and you<sup>asws</sup> had blocked it and your<sup>asws</sup> father<sup>asws</sup> had blocked it from before you<sup>asws</sup>, and for long you<sup>asws</sup> have been claiming what is not for you<sup>asws</sup>, and you<sup>asws</sup> all extended your<sup>asws</sup> hoped to what Allah<sup>azwj</sup> did not Give you. Thus, you<sup>asws</sup> followed desires and strayed, and I am cautioning you<sup>asws</sup> of what Allah<sup>azwj</sup> Cautioned You<sup>asws</sup> from Himself<sup>azwj</sup> of’. ", "So Abu Al-Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> wrote to him: ‘(This letter is) from Musa<sup>asws</sup> Bin Abu Abdullah Ja’far<sup>asws</sup> and Ali<sup>asws</sup>, both participants in the humbleness to Allah<sup>azwj</sup> and His<sup>azwj</sup> obedience, to Yahya Bin Abdullah Bin Hassan – As for afterwards, so I<sup>asws</sup> caution you of Allah<sup>azwj</sup> and myself<sup>asws</sup> and let you know of the pain of His<sup>azwj</sup> Punishment and the intensity of His<sup>azwj</sup> Retribution, and completion of His<sup>azwj</sup> Curse, and I<sup>asws</sup> bequeath you and myself<sup>asws</sup> with the fear of Allah<sup>azwj</sup> for it is the beautiful speech and the affirmation of the Bounties. ", "Your letter came to me<sup>asws</sup> mentioning therein that I<sup>asws</sup> am claiming, and so did my<sup>asws</sup> father<sup>asws</sup> from before, and you have not heard that from me<sup>asws</sup>, and <span class=\"ibTxt\">[43:19] Their evidence shall be written down and they shall be questioned</span>, and the greed of the world and its seeking does not leave for its owners the seeking of the Hereafter until it spoils it upon them the seeking of their Hereafter in their world.", "And you mentioned that I<sup>asws</sup> am blocking the people from you for my<sup>asws</sup> desire regarding what is in your hands. And If I<sup>asws</sup> was desirous (as such), it would not be the weakness from the Sunnah, nor the scarcity of insight with proof what would prevent me from entering into that which you are in, but Allah<sup>azwj</sup> Blessed and High Created the people with variations, of different instincts. So inform me about two words I<sup>asws</sup> am asking you about. What is <span class=\"iTxt\">Al-Atr</span>af in your body and what is <span class=\"iTxt\">Al-Sahlaj</span> in the human being?", "Then write to me with the information of that and I<sup>asws</sup> shall proceed to you. I<sup>asws</sup> caution you from disobeying the Caliph and urge you upon being good to him and obey him, and you should seek security for yourself before the claws seize you and the pressures choke you from every place, so you would look for rest for yourself from every place but will not find it until Allah<sup>azwj</sup> Favours upon you with a Favour and His<sup>azwj</sup> Grace, the kindness of the Caliph, may Allah<sup>azwj</sup> Cause him to remain, so he would grant you security and preserve regarding you the relationship of Rasool-Allah<sup>saww</sup>. And the greetings be upon the follower of the Guidance. It has been Revealed unto us<sup>asws</sup> that the Punishment is to be upon the one who lies and turns away’. ", "Al-Ja’far said, ‘(News) reached me that the letter of Musa<sup style=\"font-weight: normal\">asws</sup> Bin Ja’far<sup style=\"font-weight: normal\">asws</sup> fell into the hands of Haroun (Al-Rashid the Caliph), So when he read it, said: ‘The people are carrying me to go against Musa<sup style=\"font-weight: normal\">asws</sup> Bin Ja’far<sup style=\"font-weight: normal\">asws</sup> and he<sup style=\"font-weight: normal\">asws</sup> is away from what he<sup style=\"font-weight: normal\">asws</sup> is being accused with’."]}}]}, "index": "al-kafi:1:4:81", "kind": "verse_list"}