{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 82"
        },
        "path": "/books/al-kafi:1:4:82",
        "titles": {
          "ar": "بَابُ كَرَاهِيَةِ التَّوْقِيتِ",
          "en": "Chapter 82 – The abhorrence of the timing (of the re-appearance of Imam Al Mahdi<sup>asws</sup>)"
        }
      }
    ],
    "index": 140,
    "local_index": 82,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 83"
        },
        "path": "/books/al-kafi:1:4:83",
        "titles": {
          "ar": "بَابُ التَّمْحِيصِ وَ الِامْتِحَانِ",
          "en": "Chapter 83 – The vetting and the examination"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 81"
        },
        "path": "/books/al-kafi:1:4:81",
        "titles": {
          "ar": "بَابُ مَا يُفْصَلُ بِهِ بَيْنَ دَعْوَى الْمُحِقِّ وَ الْمُبْطِلِ فِي أَمْرِ الْإِمَامَةِ",
          "en": "Chapter 81 – What can be decided with between the truthful and the false claimant regarding the matter of the Imamate"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:82",
    "titles": {
      "ar": "بَابُ كَرَاهِيَةِ التَّوْقِيتِ",
      "en": "Chapter 82 – The abhorrence of the timing (of the re-appearance of Imam Al Mahdi<sup>asws</sup>)"
    },
    "verse_count": 6,
    "verse_start_index": 935,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/170)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 936,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:82:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ يَا ثَابِتُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَدْ كَانَ وَقَّتَ هَذَا الْأَمْرَ فِي السَّبْعِينَ فَلَمَّا أَنْ قُتِلَ الْحُسَيْنُ صَلَوَاتُ اللَّهِ عَلَيْهِ اشْتَدَّ غَضَبُ اللَّهِ تَعَالَى عَلَى أَهْلِ الْأَرْضِ فَأَخَّرَهُ إِلَى أَرْبَعِينَ وَ مِائَةٍ فَحَدَّثْنَاكُمْ فَأَذَعْتُمُ الْحَدِيثَ فَكَشَفْتُمْ قِنَاعَ السَّتْرِ وَ لَمْ يَجْعَلِ اللَّهُ لَهُ بَعْدَ ذَلِكَ وَقْتاً عِنْدَنَا وَ يَمْحُو اللَّهُ مَا يَشَاءُ وَ يُثْبِتُ وَ عِنْدَهُ أُمُّ الْكِتَابِ ",
          "قَالَ أَبُو حَمْزَةَ فَحَدَّثْتُ بِذَلِكَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ قَدْ كَانَ كَذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, altogether, from Al Hassan Bin Mahboub, from Abu Hamza Al Sumaly who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘O Sabit! Allah<sup>asws</sup> Blessed and High has (Fixed) a time for this matter in (the year) seventy (A.H.). So when Al-Husayn<sup>asws</sup> was killed, the Wrath of Allah<sup>azwj</sup> Intensified upon the people of the earth, therefore He<sup>azwj</sup> Delayed it to (the year) one hundred and forty (A.H.). So we<sup>asws</sup> narrated it to you all, but you broadcast the Hadeeth, and so you uncovered the covering of the veil; and Allah<sup>azwj</sup> did not Make a (specific) time for it after that with us<sup>asws</sup>. <span class=\"ibTxt\">[13:39] Allah Obliterates whatever He so Desires to and Establishes, and with Him is the Mother of the Book</span>’.",
            "Abu Hamza said, ‘So I narrated with that to Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said: ‘It has been like that’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa all from al-Hassan ibn Mahbub from abu Hamza al-Thumali who has said the following. “I heard abu Ja’far (a.s.) say, “O Thabit, Allah, the Most Holy, the Most High, had set up a time limit for it in the year seventy but when al-Husayn (a.s.) was murdered Allah’s anger became more intense on the people on earth. He delayed it until one hundred forty. When then spoke to you about it and you publicized this hadith and disclosed the secret. Allah thereafter has not set up a time limit for it available with us. Allah deletes whatever He wants and establishes whatever He wants, with Him is the original book. Abu Hamza has said, “I narrated the above Hadith to abu ‘Abdallah (a.s.) and he said, “It was as you said.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/172)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 937,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:82:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذْ دَخَلَ عَلَيْهِ مِهْزَمٌ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ أَخْبِرْنِي عَنْ هَذَا الْأَمْرِ الَّذِي نَنْتَظِرُ مَتَى هُوَ فَقَالَ يَا مِهْزَمُ كَذَبَ الْوَقَّاتُونَ وَ هَلَكَ الْمُسْتَعْجِلُونَ وَ نَجَا الْمُسَلِّمُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup> when Mihzam came over to him<sup>asws</sup> and said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Inform me about this matter which we are awaiting, when would it be?’ So he<sup>asws</sup> said: ‘O Mihzam! The timers would be lying, and the hasteners would be destroyed, and the submitters would be saved’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Salma ibn al-Khattab from Ali ibn Hassa’n from ‘Abd al-Rahman ibn al-Kathir who has said the following. “Once I was in the presence of abu ‘Abdallah (a.s.) that Mihzam came in and to The Imam (a.s.), ‘May Allah take my soul in service for your cause, enlighten me about this matter that we wait for (the rise of al-Mahdi with Divine authoriiity). When it will take place?” The Imam (a.s.) said, “O Mihzam, those who give it d definite time have lied, the expediting ones perish and salvation is for those who are submissive.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (174/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 938,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:82:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْقَائِمِ ( عليه السلام ) فَقَالَ كَذَبَ الْوَقَّاتُونَ إِنَّا أَهْلُ بَيْتٍ لَا نُوَقِّتُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about Al-Qaim<sup>asws</sup>, so he<sup>asws</sup> said: ‘The timers are lying! We<sup>asws</sup>, the People<sup>asws</sup> of the Household are not timing it’."
          ],
          "en.sarwar": [
            " 3. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from his father form al-Qasim ibn Muhammad from Ali ibn abu Hamza from abu Basir who has said the following. “I asked abu ‘Abdallah (a.s.) , ‘I asked abu ‘Abdallah (a.s.) about al-Qa’im ((the one who will rise with Divine Authority) with divine power).’ He said, “Those who give it a definite time have spoken lies. We, Ahl al-Bayt, do not set a definite time.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/175)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 939,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:82:4",
        "text": [
          "أَحْمَدُ بِإِسْنَادِهِ قَالَ قَالَ أَبَى اللَّهُ إِلَّا أَنْ يُخَالِفَ وَقْتَ الْمُوَقِّتِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, by his chain, said, ",
            "‘He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Refused except that He<sup>azwj</sup> would be Opposing the timing of the timers’."
          ],
          "en.sarwar": [
            " 4. Ahmad has narrated through his chain of narrators from the Imam (a.s.) the following. “Allah disdains to make the people’s time set for it (reappearance of the one who will rise with Divine Authority) to come true.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/175)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 940,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:82:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْخَزَّازِ عَنْ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو الْخَثْعَمِيِّ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لِهَذَا الْأَمْرِ وَقْتٌ فَقَالَ كَذَبَ الْوَقَّاتُونَ كَذَبَ الْوَقَّاتُونَ كَذَبَ الْوَقَّاتُونَ إِنَّ مُوسَى ( عليه السلام ) لَمَّا خَرَجَ وَافِداً إِلَى رَبِّهِ وَاعَدَهُمْ ثَلَاثِينَ يَوْماً فَلَمَّا زَادَهُ اللَّهُ عَلَى الثَّلَاثِينَ عَشْراً قَالَ قَوْمُهُ قَدْ أَخْلَفَنَا مُوسَى فَصَنَعُوا مَا صَنَعُوا فَإِذَا حَدَّثْنَاكُمُ الْحَدِيثَ فَجَاءَ عَلَى مَا حَدَّثْنَاكُمْ بِهِ فَقُولُوا صَدَقَ اللَّهُ وَ إِذَا حَدَّثْنَاكُمُ الْحَدِيثَ فَجَاءَ عَلَى خِلَافِ مَا حَدَّثْنَاكُمْ بِهِ فَقُولُوا صَدَقَ اللَّهُ تُؤْجَرُوا مَرَّتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Khazzaz, from Abdul Kareem Bin Amro Al Khash’amy, from Al Fuzayl Bin Yasaar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said, ‘Is there a (specific) time for this matter?’ So he<sup>asws</sup> said: ‘The timers would be lying! The timers would be lying! The timers would be lying! When (Prophet) Musa<sup>as</sup> went as a delegate to his<sup>as</sup> Lord<sup>azwj</sup>, his<sup>as</sup> appointment was for thirty days. So when Allah<sup>azwj</sup> Increased ten upon the thirty, his<sup>as</sup> people said, ‘Musa<sup>as</sup> has broken his<sup>as</sup> promise’. Thus, they did what they did. So when we<sup>asws</sup> narrate to you all with the Hadeeth and there comes what we<sup>asws</sup> had narrated with, so you should be saying, ‘Allah<sup>azwj</sup> Spoke the truth’. And when we<sup>asws</sup> narrated to you all with the Hadeeth, so there comes different to what we<sup>asws</sup> had narrated to you with, so you should be saying, ‘Allah<sup>azwj</sup> Spoke the truth’. You would be Recompensed twice’."
          ],
          "en.sarwar": [
            " 5. Al-Husayn ibn mmd has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Khazzaz from ‘Abd al-Karim ibn ‘Umar al-Khath‘ami from al-Fadl ibn Yasar who has said the following. “I asked abu Ja’far (a.s.), ‘Is there a definite time for this matter (the rise of al-Mahdi with Divine Authority)?” He said, “Those who set a definite time have lied, those who set a definite time have lied, those who set a definite time have lied. When Musa (Moses) came out to delegate before his lord and gave the people a definite time for his return and Allah added an other ten days his people said, ‘He has broken his promise.’” They then did what they did. When we say a hadith (make a statement to you) and if our hadith comes true you should say, “Allah has spoken the truth.” If we say a hadith to you ( make a statement) and if doe not come true, you should say, “Allah has spoken the truth.” You will be rewarded twice.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (174/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 941,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:82:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ السَّيَّارِيِّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ يَقْطِينٍ عَنْ أَخِيهِ الْحُسَيْنِ عَنْ أَبِيهِ عَلِيِّ بْنِ يَقْطِينٍ قَالَ قَالَ لِي أَبُو الْحَسَنِ ( عليه السلام ) الشِّيعَةُ تُرَبَّى بِالْأَمَانِيِّ مُنْذُ مِائَتَيْ سَنَةٍ ",
          "قَالَ وَ قَالَ يَقْطِينٌ لِابْنِهِ عَلِيِّ بْنِ يَقْطِينٍ مَا بَالُنَا قِيلَ لَنَا فَكَانَ وَ قِيلَ لَكُمْ فَلَمْ يَكُنْ قَالَ فَقَالَ لَهُ عَلِيٌّ إِنَّ الَّذِي قِيلَ لَنَا وَ لَكُمْ كَانَ مِنْ مَخْرَجٍ وَاحِدٍ غَيْرَ أَنَّ أَمْرَكُمْ حَضَرَ فَأُعْطِيتُمْ مَحْضَهُ فَكَانَ كَمَا قِيلَ لَكُمْ وَ إِنَّ أَمْرَنَا لَمْ يَحْضُرْ فَعُلِّلْنَا بِالْأَمَانِيِّ فَلَوْ قِيلَ لَنَا إِنَّ هَذَا الْأَمْرَ لَا يَكُونُ إِلَّا إِلَى مِائَتَيْ سَنَةٍ أَوْ ثَلَاثِمِائَةِ سَنَةٍ لَقَسَتِ الْقُلُوبُ وَ لَرَجَعَ عَامَّةُ النَّاسِ عَنِ الْإِسْلَامِ وَ لَكِنْ قَالُوا مَا أَسْرَعَهُ وَ مَا أَقْرَبَهُ تَأَلُّفاً لِقُلُوبِ النَّاسِ وَ تَقْرِيباً لِلْفَرَجِ .",
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ إِسْمَاعِيلَ الْأَنْبَارِيِّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ إِبْرَاهِيمَ بْنِ مِهْزَمٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ ذَكَرْنَا عِنْدَهُ مُلُوكَ آلِ فُلَانٍ فَقَالَ إِنَّمَا هَلَكَ النَّاسُ مِنِ اسْتِعْجَالِهِمْ لِهَذَا الْأَمْرِ إِنَّ اللَّهَ لَا يَعْجَلُ لِعَجَلَةِ الْعِبَادِ إِنَّ لِهَذَا الْأَمْرِ غَايَةً يَنْتَهِي إِلَيْهَا فَلَوْ قَدْ بَلَغُوهَا لَمْ يَسْتَقْدِمُوا سَاعَةً وَ لَمْ يَسْتَأْخِرُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, and Ahmad Bin Idrees from Muhammad Bin Ahmad, from Al Sayyari, from Al Hassan Bin Ali Bin Yaqteen, from his brother Al Husayn, from his father Ali Bin Yaqteen who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> said to me: ‘The Shias have been nourished with the belief since two hundred years’. ",
            "He (the narrator) said, ‘And Yaqteen said to his son Ali Bin Yaqteen, ‘What is the matter that what was said to us, happened, and (what) was said to you all, so it did not happen?’ So Ali said to him, ‘That which was said to us and to you was from one exit, apart from that your matter was present, so it was given to you purely. So if happened just as it had been said to you. And our matter is not present (i.e., it is for the future), so we have aspirations, and if it had been said to us that this matter would not be happening except after two hundred years or three hundred years, the hearts would have hardened and the generality of the people would return from Al-Islam. But, they<sup>asws</sup> were saying: ‘How fast it would be and how close’, in order to harmonise the hearts of the people and the imminence of the relief.<a id=\"_ftnref942\"></a><sup>[942]</sup>  (This is not a Hadith)",
            "Al Husayn Bin Muhammad, from Ja’far Bin Muhammad, from Al Qasim Bin Ismail Al Anbary, from Al Hassan Bin Ali, from Ibrahim Bin Mihzam, from his father, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘We mentioned the kinship of the family of so and so in his<sup>asws</sup> presence, so he<sup>asws</sup> said: ‘But rather, the people perished due to their haste for this matter. Allah<sup>azwj</sup> does not Make Haste due to the haste of the servants. For this matter there is a goal it would be ending up to. So if it has reached it, it would neither be brought forward by a moment nor would it be delayed’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Yahya and Ahmad ibn Muhammad ibn ’Idris have narrated from Muhammad ibn Ahmad from al-Sayyari from al-Hassan ibn Ali ibn Yaqtin from his brother from his father Ali ibn Yaqtin who has said the following. “Abu al-Hassan (a.s.) said to me, ‘The Shi‘a have live on hopes for two hundred years.’” The narrator has said that Yaqtin said to his son, Ali ibn Yaqtin, “We did not have to worry. What was said to us came true. What is said to you has not come true yet” Ali then said to him, “What was said to you and what is said to us all come from one source except that good news for you have come true and you received it pure. It was just as was said to be. The good news for us has not yet come true. We thus, entertain ourselves with hopes. If we would be told that it will take place after two or three hundred years our hearts will harden and the masses will turn back from Islam. However, they have said that it will come very soon and in near future to encourage people about the coming of the relief.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (179/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "part_type": "Hadith",
        "text": [
          " 7ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ إِسْمَاعِيلَ الانْبَارِيِّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ إِبْرَاهِيمَ بْنِ مِهْزَمٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ ذَكَرْنَا عِنْدَهُ مُلُوكَ آلِ فُلانٍ فَقَالَ إِنَّمَا هَلَكَ النَّاسُ مِنِ اسْتِعْجَالِهِمْ لِهَذَا الامْرِ إِنَّ الله لا يَعْجَلُ لِعَجَلَةِ الْعِبَادِ إِنَّ لِهَذَا الامْرِ غَايَةً يَنْتَهِي إِلَيْهَا فَلَوْ قَدْ بَلَغُوهَا لَمْ يَسْتَقْدِمُوا سَاعَةً وَلَمْ يَسْتَأْخِرُوا."
        ],
        "translations": {
          "en.sarwar": [
            " 7. Al-Husayn ibn Muhammad has narrated from Ja’far ibn Muhammad from al-Qasim ibn ’Isma‘il al-Anbari from al-Hassan ibn Ali from Ibrahim ibn Mihzam from his father who has said the following. “We mention before abu ‘Abdallah (a.s.) the Kings from the descendants of so and so. The Imam (a.s.) said, “People have perished due to their haste for this matter ((the rise of al-Mahdi with Divine Authority). Allah does not expedite it because of the haste of people. For this matter (the rise of al-Mahdi with Divine Authority) there is a goal towards which it proceeds, Once they will reach that goal they then will not be able to move it forwards or backwards even by one hour.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:82",
  "kind": "verse_list"
}