{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 83"}, "path": "/books/al-kafi:1:4:83", "titles": {"ar": "بَابُ التَّمْحِيصِ وَ الِامْتِحَانِ", "en": "Chapter 83 – The vetting and the examination"}}], "index": 141, "local_index": 83, "part_type": "Chapter", "path": "/books/al-kafi:1:4:83", "titles": {"ar": "بَابُ التَّمْحِيصِ وَ الِامْتِحَانِ", "en": "Chapter 83 – The vetting and the examination"}, "verse_count": 6, "verse_start_index": 941, "verses": [{"index": 942, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:83:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ يَعْقُوبَ السَّرَّاجِ وَ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) لَمَّا بُويِعَ بَعْدَ مَقْتَلِ عُثْمَانَ صَعِدَ الْمِنْبَرَ وَ خَطَبَ بِخُطْبَةٍ ذَكَرَهَا يَقُولُ فِيهَا أَلَا إِنَّ بَلِيَّتَكُمْ قَدْ عَادَتْ كَهَيْئَتِهَا يَوْمَ بَعَثَ اللَّهُ نَبِيَّهُ ( صلى الله عليه وآله ) وَ الَّذِي بَعَثَهُ بِالْحَقِّ لَتُبَلْبَلُنَّ بَلْبَلَةً وَ لَتُغَرْبَلُنَّ غَرْبَلَةً حَتَّى يَعُودَ أَسْفَلُكُمْ أَعْلَاكُمْ وَ أَعْلَاكُمْ أَسْفَلَكُمْ وَ لَيَسْبِقَنَّ سَبَّاقُونَ كَانُوا قَصَّرُوا وَ لَيُقَصِّرَنَّ سَبَّاقُونَ كَانُوا سَبَقُوا وَ اللَّهِ مَا كَتَمْتُ وَسْمَةً وَ لَا كَذَبْتُ كَذِبَةً وَ لَقَدْ نُبِّئْتُ بِهَذَا الْمَقَامِ وَ هَذَا الْيَوْمِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Hassan Bin Mahboub, from Yaqoub Al Sarraj and Ali Bin Raib, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>: ‘When Amir Al-Momineen<sup>asws</sup> was pledged allegiance to after the killing of Usman, he<sup>asws</sup> ascended the Pulpit and addressed with a sermon, he (Abu Abdullah<sup>asws</sup>) mentioned, saying therein: ‘Indeed! Your trials have returned as if these were on the day Allah<sup>azwj</sup> Sent His<sup>azwj</sup> Prophet<sup>saww</sup>. By the One<sup>azwj</sup> Who Sent him<sup>saww</sup> with the Truth, you will be tried with trials and you would be sifted with a sifting until your lower ones would turn to be your higher ones and your higher ones, your lower ones, and your forwards ones who were ahead would be left behind, and those who were left behind would precede. By Allah<sup>azwj</sup>! I<sup>asws</sup> have not concealed and (have) specified, and I<sup>asws</sup> did not lie with a lie, and I<sup>asws</sup> had been Informed with this place and this day’."}]}, {"index": 943, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:83:2", "text": "مُحَمَّدُ بْنُ يَحْيَى وَ الْحَسَنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ إِسْمَاعِيلَ الْأَنْبَارِيِّ عَنِ الْحُسَيْنِ بْنِ عَلِيٍّ عَنْ أَبِي الْمَغْرَاءِ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَيْلٌ لِطُغَاةِ الْعَرَبِ مِنْ أَمْرٍ قَدِ اقْتَرَبَ قُلْتُ جُعِلْتُ فِدَاكَ كَمْ مَعَ الْقَائِمِ مِنَ الْعَرَبِ قَالَ نَفَرٌ يَسِيرٌ قُلْتُ وَ اللَّهِ إِنَّ مَنْ يَصِفُ هَذَا الْأَمْرَ مِنْهُمْ لَكَثِيرٌ قَالَ لَا بُدَّ لِلنَّاسِ مِنْ أَنْ يُمَحَّصُوا وَ يُمَيَّزُوا وَ يُغَرْبَلُوا وَ يُسْتَخْرَجُ فِي الْغِرْبَالِ خَلْقٌ كَثِيرٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, and Al Hassan Bin Muhammad, from Ja’far Bin Muhammad, from Al Qasim Bin Ismail Al Anbary, from Al Husayn Bin Ali, from Abu Al Magra’a, from Ibn Abu Yafour who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Woe be unto the tyrants of the Arabs from a matter which has drawn closer!’ I said, ‘May I be sacrificed for you<sup>asws</sup>! How many from the Arabs would be with Al-Qaim<sup>asws</sup>?’ He<sup>asws</sup> said: ‘A small number’. I said, ‘By Allah<sup>azwj</sup>! Surely the ones who describe this matter are most of them’. He<sup>asws</sup> said: ‘It is inevitable for the people from being vetted, and differentiated, and sifted, and there would be exited during the sifting, a lot of people’."}]}, {"index": 944, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:83:3", "text": "مُحَمَّدُ بْنُ يَحْيَى وَ الْحَسَنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الصَّيْرَفِيِّ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الصَّيْقَلِ عَنْ أَبِيهِ عَنْ مَنْصُورٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا مَنْصُورُ إِنَّ هَذَا الْأَمْرَ لَا يَأْتِيكُمْ إِلَّا بَعْدَ إِيَاسٍ وَ لَا وَ اللَّهِ حَتَّى تُمَيَّزُوا وَ لَا وَ اللَّهِ حَتَّى تُمَحَّصُوا وَ لَا وَ اللَّهِ حَتَّى يَشْقَى مَنْ يَشْقَى وَ يَسْعَدَ مَنْ يَسْعَدُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, and Al Hassan Bin Muhammad, from Ja’far Bin Muhammad, from Al Hassan Bin Muhammad Al Sayrafi, from Ja’far Bin Muhammad Al Sayqal, from his father, from Mansour who said, \n‘Abu Abdullah<sup>asws</sup> said to me: ‘O Mansour! This matter would not be coming to you all except after despair, and no, by Allah<sup>azwj</sup>, until you are differentiated, and no, by Allah<sup>azwj</sup>, until you are vetted, and no, by Allah<sup>azwj</sup>, until he becomes wretched, the one who is wretched, and he becomes fortunate, the one who is fortunate’."}]}, {"index": 945, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:83:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُعَمَّرِ بْنِ خَلَّادٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ الم أَ حَسِبَ النَّاسُ أَنْ يُتْرَكُوا أَنْ يَقُولُوا آمَنَّا وَ هُمْ لا يُفْتَنُونَ ثُمَّ قَالَ لِي مَا الْفِتْنَةُ قُلْتُ جُعِلْتُ فِدَاكَ الَّذِي عِنْدَنَا الْفِتْنَةُ فِي الدِّينِ فَقَالَ يُفْتَنُونَ كَمَا يُفْتَنُ الذَّهَبُ ثُمَّ قَالَ يُخْلَصُونَ كَمَا يُخْلَصُ الذَّهَبُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Moammar Bn Khallad who said, \n‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘<span class=\"ibTxt\">[29:2] Do the people reckon that they will be left alone on saying, We believe, and they will not be Tested?</span>’ Then he<sup>asws</sup> said to me: ‘What is ‘الْفِتْنَةُ’ the strife?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! That which is with us is the strife regarding the Religion’. So he<sup>asws</sup> said: ‘They would be refined as gold is refined’. Then he<sup>asws</sup> said: ‘They would be purified just as gold is purified’."}]}, {"index": 946, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:83:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ سُلَيْمَانَ بْنِ صَالِحٍ رَفَعَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ إِنَّ حَدِيثَكُمْ هَذَا لَتَشْمَئِزُّ مِنْهُ قُلُوبُ الرِّجَالِ فَمَنْ أَقَرَّ بِهِ فَزِيدُوهُ وَ مَنْ أَنْكَرَهُ فَذَرُوهُ إِنَّهُ لَا بُدَّ مِنْ أَنْ يَكُونَ فِتْنَةٌ يَسْقُطُ فِيهَا كُلُّ بِطَانَةٍ وَ وَلِيجَةٍ حَتَّى يَسْقُطَ فِيهَا مَنْ يَشُقُّ الشَّعْرَ بِشَعْرَتَيْنِ حَتَّى لَا يَبْقَى إِلَّا نَحْنُ وَ شِيعَتُنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Suleyman Bin Salih, raising it, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘This Hadeeth of yours (of the rising of Al-Qaim<sup>asws</sup>) tends to abominate (detest) the hearts of the men. So the one who acknowledges with it, so it would increase him, and the one who denies it, so leave him. It is inevitable that strife takes place during which every hidden matter and confidant would fall, to the extent that there would fall during it, the one who split one hair with two hairs, until there does not remain anyone except for us<sup>asws</sup> and our<sup>asws</sup> Shias’."}]}, {"index": 947, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:83:6", "text": "مُحَمَّدُ بْنُ الْحَسَنِ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ الصَّيْقَلِ عَنْ أَبِيهِ قَالَ كُنْتُ أَنَا وَ الْحَارِثُ بْنُ الْمُغِيرَةِ وَ جَمَاعَةٌ مِنْ أَصْحَابِنَا جُلُوساً وَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَسْمَعُ كَلَامَنَا فَقَالَ لَنَا فِي أَيِّ شَيْ‏ءٍ أَنْتُمْ هَيْهَاتَ هَيْهَاتَ لَا وَ اللَّهِ لَا يَكُونُ مَا تَمُدُّونَ إِلَيْهِ أَعْيُنَكُمْ حَتَّى تُغَرْبَلُوا لَا وَ اللَّهِ لَا يَكُونُ مَا تَمُدُّونَ إِلَيْهِ أَعْيُنَكُمْ حَتَّى تُمَحَّصُوا لَا وَ اللَّهِ لَا يَكُونُ مَا تَمُدُّونَ إِلَيْهِ أَعْيُنَكُمْ حَتَّى تُمَيَّزُوا لَا وَ اللَّهِ مَا يَكُونُ مَا تَمُدُّونَ إِلَيْهِ أَعْيُنَكُمْ إِلَّا بَعْدَ إِيَاسٍ لَا وَ اللَّهِ لَا يَكُونُ مَا تَمُدُّونَ إِلَيْهِ أَعْيُنَكُمْ حَتَّى يَشْقَى مَنْ يَشْقَى وَ يَسْعَدَ مَنْ يَسْعَدُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Al Hassan, and Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Sinan, from Muhammad Bin Mansour Al Sayqal, from his father who said, \n‘I and Haris Bin Al-Mugheira, and a group of our companions were seated, and Abu Abdullah<sup>asws</sup> heard our speech. So he<sup>asws</sup> said to us: ‘In which thing (discussion) are you in? Far be it! Far be it! No, by Allah<sup>azwj</sup>! What you all are extending your eyes towards will not be happening until you are scrutinised! No, by Allah<sup>azwj</sup>! What you are extending your eyes towards will not be happening until you are differentiated! No, by Allah<sup>azwj</sup>! What you are extending your eyes towards will not be happening until after despair! No, by Allah<sup>azwj</sup>! What you are extending your eyes towards will not be happening until the one who is a wretch becomes a wretch, and the one who is ‘يَسْعَدَ’ auspicious becomes auspicious’."}]}]}, "index": "al-kafi:1:4:83", "kind": "verse_list"}