{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 86"
        },
        "path": "/books/al-kafi:1:4:86",
        "titles": {
          "ar": "باب فِيمَنْ دَانَ اللَّهَ عَزَّ وَ جَلَّ بِغَيْرِ إِمَامٍ مِنَ اللَّهِ جَلَّ جَلَالُهُ",
          "en": "Chapter 86 – Regading the one who makes it a Religion of Allah<sup>azwj</sup> Mighty and Majestic without an Imam<sup>asws</sup> from Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Majesty"
        }
      }
    ],
    "index": 144,
    "local_index": 86,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 87"
        },
        "path": "/books/al-kafi:1:4:87",
        "titles": {
          "ar": "بَابُ مَنْ مَاتَ وَ لَيْسَ لَهُ إِمَامٌ مِنْ أَئِمَّةِ الْهُدَى وَ هُوَ مِنَ الْبَابِ الْأَوَّلِ",
          "en": "Chapter 87 – The one who dies and there isn’t an Imam<sup>asws</sup> for him from the Imams<sup>asws</sup> of Guidance – and it is from the first chapter (above)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 85"
        },
        "path": "/books/al-kafi:1:4:85",
        "titles": {
          "ar": "بَابُ مَنِ ادَّعَى الْإِمَامَةَ وَ لَيْسَ لَهَا بِأَهْلٍ وَ مَنْ جَحَدَ الْأَئِمَّةَ أَوْ بَعْضَهُمْ وَ مَنْ أَثْبَتَ الْإِمَامَةَ لِمَنْ لَيْسَ لَهَا بِأَهْلٍ",
          "en": "Chapter 85 – The one who claims the Imamate and he is not rightful for it, and the one who denies the Imams<sup>asws</sup>, or some of them<sup>asws</sup>, and the one who affirms the Imamate for the one who is not rightful for it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:86",
    "titles": {
      "ar": "باب فِيمَنْ دَانَ اللَّهَ عَزَّ وَ جَلَّ بِغَيْرِ إِمَامٍ مِنَ اللَّهِ جَلَّ جَلَالُهُ",
      "en": "Chapter 86 – Regading the one who makes it a Religion of Allah<sup>azwj</sup> Mighty and Majestic without an Imam<sup>asws</sup> from Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Majesty"
    },
    "verse_count": 5,
    "verse_start_index": 966,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (213/ 4)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (43/ 1)"
        ],
        "index": 967,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/361",
              "text": "ابْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/351",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي قَوْلِ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي قَوْلِ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:86:1",
        "relations": {
          "Mentions": [
            "/books/quran:28:50"
          ]
        },
        "text": [
          " اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَواهُ بِغَيْرِ هُدىً مِنَ اللَّهِ قَالَ يَعْنِي مَنِ اتَّخَذَ دِينَهُ رَأْيَهُ بِغَيْرِ إِمَامٍ مِنْ أَئِمَّةِ الْهُدَى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Nasr, ",
            "(It has been narrated) from Abu Al Hassan<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:28#h50\">[28:50]</a> and who is more erring than he who follows his own desires without any Guidance from Allah?</span><span class=\"iTxt\">. </span>He<sup>asws</sup> said: ‘It means the one who takes his opinion as his Religion without an Imam<sup>asws</sup> from the Imams<sup>asws</sup> of the Guidance’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad (from) ibn abu Nasr from abu al-Hassan (a.s.) who has said the following. “The words of Allah, the Most Majestic, the Most gracious, “Who strays more than one who follows his desires without guidance from God?. . “<a href=\"/#/books/quran:28#h50\">[28:50]</a> The Imam (a.s.), “It refers to those who take their own opinions as their religion without an Imam from the Imams of guidance (Leadership with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/213)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (43/ 1)"
        ],
        "index": 968,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:86:2",
        "text": [
          " سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ كُلُّ مَنْ دَانَ اللَّهَ بِعِبَادَةٍ يُجْهِدُ فِيهَا نَفْسَهُ وَ لَا إِمَامَ لَهُ مِنَ اللَّهِ فَسَعْيُهُ غَيْرُ مَقْبُولٍ وَ هُوَ ضَالٌّ مُتَحَيِّرٌ وَ اللَّهُ شَانِئٌ لِأَعْمَالِهِ وَ مَثَلُهُ كَمَثَلِ شَاةٍ ضَلَّتْ عَنْ رَاعِيهَا وَ قَطِيعِهَا ",
          "فَهَجَمَتْ ذَاهِبَةً وَ جَائِيَةً يَوْمَهَا فَلَمَّا جَنَّهَا اللَّيْلُ بَصُرَتْ بِقَطِيعٍ مَعَ غَيْرِ رَاعِيهَا فَحَنَّتْ إِلَيْهَا وَ اغْتَرَّتْ بِهَا فَبَاتَتْ مَعَهَا فِي رَبَضَتِهَا فَلَمَّا أَنْ سَاقَ الرَّاعِي قَطِيعَهُ أَنْكَرَتْ رَاعِيَهَا وَ قَطِيعَهَا فَهَجَمَتْ مُتَحَيِّرَةً تَطْلُبُ رَاعِيَهَا وَ قَطِيعَهَا فَبَصُرَتْ بِغَنَمٍ مَعَ رَاعِيهَا فَحَنَّتْ إِلَيْهَا وَ اغْتَرَّتْ بِهَا فَصَاحَ بِهَا الرَّاعِي الْحَقِي بِرَاعِيكِ وَ قَطِيعِكِ فَإِنَّكِ تَائِهَةٌ مُتَحَيِّرَةٌ عَنْ رَاعِيكِ وَ قَطِيعِكِ",
          "فَهَجَمَتْ ذَعِرَةً مُتَحَيِّرَةً نَادَّةً لَا رَاعِيَ لَهَا يُرْشِدُهَا إِلَى مَرْعَاهَا أَوْ يَرُدُّهَا فَبَيْنَا هِيَ كَذَلِكَ إِذَا اغْتَنَمَ الذِّئْبُ ضَيْعَتَهَا فَأَكَلَهَا وَ كَذَلِكَ وَ اللَّهِ يَا مُحَمَّدُ مَنْ أَصْبَحَ مِنْ هَذِهِ الْأُمَّةِ لَا إِمَامَ لَهُ مِنَ اللَّهِ جَلَّ وَ عَزَّ ظَاهِراً عَادِلًا أَصْبَحَ ضَالًّا تَائِهاً وَ إِنْ مَاتَ عَلَى هَذِهِ الْحَالِ مَاتَ مِيتَةَ كُفْرٍ وَ نِفَاقٍ ",
          "وَ اعْلَمْ يَا مُحَمَّدُ إِنَّ أَئِمَّةَ الْجَوْرِ وَ أَتْبَاعَهُمْ لَمَعْزُولُونَ عَنْ دِينِ اللَّهِ قَدْ ضَلُّوا وَ أَضَلُّوا فَأَعْمَالُهُمُ الَّتِي يَعْمَلُونَهَا كَرَمَادٍ اشْتَدَّتْ بِهِ الرِّيحُ فِي يَوْمٍ عَاصِفٍ لَا يَقْدِرُونَ مِمَّا كَسَبُوا عَلَى شَيْ‏ءٍ ذَلِكَ هُوَ الضَّلَالُ الْبَعِيدُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Every one who makes it a Religion of Allah<sup>azwj</sup> with worship, striving in it himself, and there is no Imam<sup>asws</sup> from Allah<sup>azwj</sup> for him, so his efforts would be without Acceptance, and he would be straying in confusion, and Allah<sup>azwj</sup> would Disdain his deeds, and his example is like the example of a sheep, straying from her shepherd and her flock.",
            "So she wanders around going and coming during its day. So when the night shields her, she sees a flock with another shepherd. So she arrives to them and joins up with them. So she spends the night along with them in their pen. So when the shepherd ushers his flock, she denies her shepherd and her flock. So she wanders around in confusion seeking her shepherd and her flock. So she sees some sheep with their shepherd. So she arrives to them and joins up with them. But the shepherd shouts at her, ‘Join up with your own shepherd and your flock, for you are wandering in confusion from your shepherd and your flock!’",
            "So she wanders around on rough terrain fearfully, in confusion, there being no shepherd for her to guide her to her pasture or return her (from straying). So while she is like that, the wolf attacks her place and devours her. And similar to that, by Allah<sup>azwj</sup>, O Muhammad, is the one from this community who wakes up in the morning, there being no Imam<sup>asws</sup> for him, from Allah<sup>azwj</sup> Majestic and Mighty, apparent, Just. He wakes up in the morning straying, wandering, and if he were to die upon this state, he would die a death of disbelief and hypocrisy.  ",
            "And know, O Muhammad, that the tyrannical imams (leaders) and their followers are isolated from the Religion of Allah<sup>azwj</sup>, having had strayed and causing others to stray. So their deeds which they are performing are like dust blown away by the winds during a stormy day, they are not being able upon anything from what they are earning. That is the far straying’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan ibn Yahya from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following. “I heard abu Ja‘far (a.s.) say, ‘Whoever follows the religion of Allah worshipping assiduously without an Imam, Leader with Divine Authority his toil will not be acceptable. In fact, he is lost and confused and Allah disdains his deeds. Such person’s case and example is like a sheep that has lost the shepherd and the flock that runs back and forth the whole day. As the night would fall that sheep would see a flock of sheep with a shepherd. The (lost) sheep would then join the flock affectionately that in fact is only a deception. The sheep would pass the night in their shelter but when the shepherd would lead the flock to the pasture the lost sheep would feel lost and away from the flock and the shepherd,. thus, run back and forth in search of the flock and the shepherd. Then it would find a flock of sheep with a shepherd and affectionately join them but, in fact, suffer a deception. This shepherd would shout at the lost sheep saying, “Go and find your own flock and shepherd you are lost, confused and without a flock and shepherd. The lost sheep then would run back and forth in confusion, fear and frustration without a shepherd to guide to the pasture and to the shelter. While the lost sheep is in such confusion a wolf would seize the opportunity and would kill the lost sheep for food. Thus, by Allah, O Muhammad is the case of a person from this ’Umma (nation) who would live without an Imam (Leader with Divine Authority) from Allah, the Most Majestic, the Most gracious, who is clearly supported with evidence and is just in his dealings. A person without such Imam is lost and confused and if he would die in such condition his death would be like dying in disbelief and hypocrisy. O Muhammad, bear in mind properly that the unjust Imams and their followers are far away from the religion of Allah. They are lost and misleading. Their deeds that they do are like the dust blown by the winds away in a windy day which, would go out of hand without benefits. Thus is straying far away from the truth.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/215)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 969,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/657",
              "text": "عَبْدِ الْعَزِيزِ الْعَبْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/316",
              "text": "عَبْدِ اللَّهِ بْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الْعَزِيزِ الْعَبْدِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي يَعْفُورٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:86:3",
        "relations": {
          "Mentions": [
            "/books/quran:2:257"
          ]
        },
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي أُخَالِطُ النَّاسَ فَيَكْثُرُ عَجَبِي مِنْ أَقْوَامٍ لَا يَتَوَلَّوْنَكُمْ وَ يَتَوَلَّوْنَ فُلَاناً وَ فُلَاناً لَهُمْ أَمَانَةٌ وَ صِدْقٌ وَ وَفَاءٌ وَ أَقْوَامٌ يَتَوَلَّوْنَكُمْ لَيْسَ لَهُمْ تِلْكَ الْأَمَانَةُ وَ لَا الْوَفَاءُ وَ الصِّدْقُ ",
          "قَالَ فَاسْتَوَى أَبُو عَبْدِ اللَّهِ ( عليه السلام ) جَالِساً فَأَقْبَلَ عَلَيَّ كَالْغَضْبَانِ ثُمَّ قَالَ لَا دِينَ لِمَنْ دَانَ اللَّهَ بِوَلَايَةِ إِمَامٍ جَائِرٍ لَيْسَ مِنَ اللَّهِ وَ لَا عَتْبَ عَلَى مَنْ دَانَ بِوَلَايَةِ إِمَامٍ عَادِلٍ مِنَ اللَّهِ ",
          "قُلْتُ لَا دِينَ لِأُولَئِكَ وَ لَا عَتْبَ عَلَى هَؤُلَاءِ قَالَ نَعَمْ لَا دِينَ لِأُولَئِكَ وَ لَا عَتْبَ عَلَى هَؤُلَاءِ ",
          "ثُمَّ قَالَ أَ لَا تَسْمَعُ لِقَوْلِ اللَّهِ عَزَّ وَ جَلَّ اللَّهُ وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ مِنَ الظُّلُماتِ إِلَى النُّورِ يَعْنِي مِنْ ظُلُمَاتِ الذُّنُوبِ إِلَى نُورِ التَّوْبَةِ وَ الْمَغْفِرَةِ لِوَلَايَتِهِمْ كُلَّ إِمَامٍ عَادِلٍ مِنَ اللَّهِ وَ قَالَ وَ الَّذِينَ كَفَرُوا أَوْلِياؤُهُمُ الطَّاغُوتُ يُخْرِجُونَهُمْ مِنَ النُّورِ إِلَى الظُّلُماتِ إِنَّمَا عَنَى بِهَذَا أَنَّهُمْ كَانُوا عَلَى نُورِ الْإِسْلَامِ فَلَمَّا أَنْ تَوَلَّوْا كُلَّ إِمَامٍ جَائِرٍ لَيْسَ مِنَ اللَّهِ عَزَّ وَ جَلَّ خَرَجُوا بِوَلَايَتِهِمْ إِيَّاهُ مِنْ نُورِ الْإِسْلَامِ إِلَى ظُلُمَاتِ الْكُفْرِ فَأَوْجَبَ اللَّهُ لَهُمُ النَّارَ مَعَ الْكُفَّارِ فَ أُولئِكَ أَصْحابُ النَّارِ هُمْ فِيها خالِدُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Abdul Aziz Al Abady, from Abdullah Bin Abu Yafour who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I tend to mingle with the people, and I am frequently astounded from the people who are not in the guardianship (Wilayah) of you<sup>asws</sup> all (Imams<sup>asws</sup>) and are in the guardianship of so and so, and so and so. For them is trustworthiness, and truthfulness, and loyalty. And there are a people who are in your<sup>asws</sup> guardianship (Wilayah), there isn’t that trustworthiness for them, nor the loyalty and the truthfulness’. ",
            "He (the narrator) said, ‘Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> sat upright and turned towards me as if angered, then said: ‘There is no Religion for the one who makes it a Religion by the guardianship of a tyrannous imam (leader) who isn’t from Allah<sup style=\"font-weight: normal\">azwj</sup>, nor is there any blame upon the one who makes it a Religion by the Wilayah of a Just Imam<sup style=\"font-weight: normal\">asws</sup> from Allah<sup style=\"font-weight: normal\">azwj</sup>’. ",
            "I said, ‘There is no Religion for those ones and there is no blame upon these ones?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes! There is no Religion for those ones and there is no blame upon these ones’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘Have you not listened to the Words of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h257\">[2:257]</a> Allah is the Guardian of those who believe. He Extracts them from the darkness into the Light</span>? It Means, from the darkness of the sins to the light of the repentance and the Forgiveness, due to their Wilayah for every just Imam<sup style=\"font-weight: normal\">asws</sup> from Allah<sup style=\"font-weight: normal\">azwj</sup>. ",
            "And He<sup style=\"font-weight: normal\">azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h257\">[2:257]</a> and (as to) those who disbelieve, their guardians are tyrants who extract them from the Light into the darkness</span>. But rather it Means by this that they were upon the light of Al-Islam. So when they took as guardians every tyrannical imam (leader) who wasn’t from Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic, they exited from the light of Al-Islam due to their befriending them, to the darkness of the disbelief. Thus, Allah<sup style=\"font-weight: normal\">azwj</sup> Obligated the Fire for them along with the disbelievers <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h257\">[2:257]</a> these are the inmates of the Fire, in it they shall be abiding</span>’."
          ],
          "en.sarwar": [
            " 3. A number of our people has narrated from Ahmad Muhammad ibn ‘Isa from ibn Mahbub from ‘Abd ‘Aziz al-‘Abdi from ‘Abdallah ibn abu Ya‘fur who has said the following. “I said to abu ‘Abdallah (a.s.). ’Isma‘il meet people and it increases my wonders when I find people who do not consider you as their guardians and Imams but they consider so and so as their Imam. However, they are trustworthy, truthful and loyal. I also find people who consider you as their guardian and Imam but are not that trustworthy, loyal and truthful.” The narrator has said that abu ‘Abdallah (a.s.) then sat in an upright position and turned to me as if with anger and then said, “One follows the religion of Allah under the guardianship of an unjust Imam who possesses no Divine authority, he has no religion. One who follows the religion of Allah under the guardianship of an Imam who just in his dealings (possesses Divine authority).” I then said, “These have no religion and these will face no destruction.” The Imam (a.s.) said, “That is correct “these have no religion and these will face no destruction.” Then the Imam (a.s.) said, “Have y0ou not heard the words of Allah, the Most Majestic, the Most gracious, “God is the Guardian of the believers and it is He who takes them out of darkness into light. .” <a href=\"/#/books/quran:2#h257\">[2:257]</a> It means that He takes them out of the darkness of sins to the light of repentance and forgiveness because of their love for and their being under the guardianship of the just Imams who possess Divine authority. He has also said, “The Devil is the guardian of those who deny the Truth and he leads them from light to darkness.. .” <a href=\"/#/books/quran:2#h257\">[2:257]</a> It means that they were in the light of Islam but when they accepted the guardianship and the leadership of every unjust Imam who possessed no authority from Allah, the Most Majestic, the Most gracious, their guardianship took them out of the light of Islam to the darkness of disbelief. Allah then made it necessary for them to suffer in fire along with the unbelievers. “These are the dwellers of hell wherein they will live forever.” <a href=\"/#/books/quran:2#h257\">[2:257]</a>"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/218)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 970,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1037",
              "text": "حَبِيبٍ السِّجِسْتَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ حَبِيبٍ السِّجِسْتَانِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:86:4",
        "text": [
          " قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى لَأُعَذِّبَنَّ كُلَّ رَعِيَّةٍ فِي الْإِسْلَامِ دَانَتْ بِوَلَايَةِ كُلِّ إِمَامٍ جَائِرٍ لَيْسَ مِنَ اللَّهِ وَ إِنْ كَانَتِ الرَّعِيَّةُ فِي أَعْمَالِهَا بَرَّةً تَقِيَّةً وَ لَأَعْفُوَنَّ عَنْ كُلِّ رَعِيَّةٍ فِي الْإِسْلَامِ دَانَتْ بِوَلَايَةِ كُلِّ إِمَامٍ عَادِلٍ مِنَ اللَّهِ وَ إِنْ كَانَتِ الرَّعِيَّةُ فِي أَنْفُسِهَا ظَالِمَةً مُسِيئَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Hisham Bin Salim, from Habeeb Al Sijistany, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Blessed and High Said: “I<sup>azwj</sup> shall Punish every citizen in Al-Islam who makes it a Religion with the guardianship of every tyrannous imam (leader) who isn’t from Allah<sup>azwj</sup> and even if the citizen was righteous in his deeds, pious; and I<sup>azwj</sup> shall Forgive every citizen in Al-Islam who makes it a Religion by the Wilayah of every Just Imam<sup>asws</sup> from Allah<sup>azwj</sup>, and even if the citizen was unjust within himself, a sinner’."
          ],
          "en.sarwar": [
            " 4. He has narrated from Hisham ibn Salim from Habib al-Sajistani from abu Ja‘far (a.s.) who has said the following. “Allah, the Most Holy, the Most High, has said, ’I will cause to suffer punishment all those who live a religious life in Islam under the guardianship of unjust Imams who possesses no authority from Allah even though such followers would be virtuous and pious in their deeds. I will forgive all those who live a religious life in Islamunder the guardianship of an Imam who is just in his dealings and possess authority from Allah even though such followers in their dealings would be unjust sinners.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (218/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 971,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1038",
              "text": "ابْنِ جُمْهُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنِ ابْنِ جُمْهُورٍ عَنْ أَبِيهِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:86:5",
        "text": [
          " قَالَ إِنَّ اللَّهَ لَا يَسْتَحْيِي أَنْ يُعَذِّبَ أُمَّةً دَانَتْ بِإِمَامٍ لَيْسَ مِنَ اللَّهِ وَ إِنْ كَانَتْ فِي أَعْمَالِهَا بَرَّةً تَقِيَّةً وَ إِنَّ اللَّهَ لَيَسْتَحْيِي أَنْ يُعَذِّبَ أُمَّةً دَانَتْ بِإِمَامٍ مِنَ اللَّهِ وَ إِنْ كَانَتْ فِي أَعْمَالِهَا ظَالِمَةً مُسِيئَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ibn Jamhour, from his father, from Safwan, from Ibn Muskan, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> is not Embarrassed from Punishing a community which makes it a Religion with an imam (leader) who is not from Allah<sup>azwj</sup> and even if they were righteous in their deeds; and Allah<sup>azwj</sup> is too Embarrassed to Punish a community which makes it a Religion with an Imam<sup>asws</sup> from Allah<sup>azwj</sup>, and even if they were unjust, sinful, in their deeds’."
          ],
          "en.sarwar": [
            " 5. Ali ibn Muhammad has narrated from ibn Jumhur from his father from Safwan from ibn Maskan from ‘Abdallah ibn Sinan from abu ‘Abdallah (a.s.) who has said the following. “Allah will not be ashamed to punish an ’Umma (nation) who has lived a religious lile under the guardianship of an unjust Imam who has said the following.would possess no authority form Allah even though such people would be virtuous and pious in their deeds. However, Allah will be ashamed to punish a people who lived a religious life under the guardianship of an Imam who is just in his dealings and possesses authority from Allah even though they would be unjust in their dealings and have committed sins.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:86",
  "kind": "verse_list"
}