{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 90"}, "path": "/books/al-kafi:1:4:90", "titles": {"ar": "باب فِي أَنَّ الْإِمَامَ مَتَى يَعْلَمُ أَنَّ الْأَمْرَ قَدْ صَارَ إِلَيْهِ", "en": "Chapter 90 – Regarding the Imam<sup>asws</sup>, when does he<sup>asws</sup> know that the command has come to him<sup>asws</sup>"}}], "index": 148, "local_index": 90, "part_type": "Chapter", "path": "/books/al-kafi:1:4:90", "titles": {"ar": "باب فِي أَنَّ الْإِمَامَ مَتَى يَعْلَمُ أَنَّ الْأَمْرَ قَدْ صَارَ إِلَيْهِ", "en": "Chapter 90 – Regarding the Imam<sup>asws</sup>, when does he<sup>asws</sup> know that the command has come to him<sup>asws</sup>"}, "verse_count": 6, "verse_start_index": 982, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 983, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:90:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ إِدْرِيسَ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي جَرِيرٍ الْقُمِّيِّ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) جُعِلْتُ فِدَاكَ قَدْ عَرَفْتَ انْقِطَاعِي إِلَى أَبِيكَ ثُمَّ إِلَيْكَ ثُمَّ حَلَفْتُ لَهُ وَ حَقِّ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ حَقِّ فُلَانٍ وَ فُلَانٍ حَتَّى انْتَهَيْتُ إِلَيْهِ بِأَنَّهُ لَا يَخْرُجُ مِنِّي مَا تُخْبِرُنِي بِهِ إِلَى أَحَدٍ مِنَ النَّاسِ ", "وَ سَأَلْتُهُ عَنْ أَبِيهِ أَ حَيٌّ هُوَ أَوْ مَيِّتٌ فَقَالَ قَدْ وَ اللَّهِ مَاتَ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنَّ شِيعَتَكَ يَرْوُونَ أَنَّ فِيهِ سُنَّةَ أَرْبَعَةِ أَنْبِيَاءَ قَالَ قَدْ وَ اللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ هَلَكَ قُلْتُ هَلَاكَ غَيْبَةٍ أَوْ هَلَاكَ مَوْتٍ قَالَ هَلَاكَ مَوْتٍ ", "فَقُلْتُ لَعَلَّكَ مِنِّي فِي تَقِيَّةٍ فَقَالَ سُبْحَانَ اللَّهِ قُلْتُ فَأَوْصَى إِلَيْكَ قَالَ نَعَمْ قُلْتُ فَأَشْرَكَ مَعَكَ فِيهَا أَحَداً قَالَ لَا قُلْتُ فَعَلَيْكَ مِنْ إِخْوَتِكَ إِمَامٌ قَالَ لَا قُلْتُ فَأَنْتَ الْإِمَامُ قَالَ نَعَمْ ."], "translations": {"en.hubeali": ["Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abu Jareer Al Qummy who said, ", "‘I said to Abu Al-Hassan<sup>asws</sup>, (8<sup>th</sup> Imam) <sup>asws</sup>‘May I be sacrificed for you<sup>asws</sup>! You<sup>asws</sup> have known of my cutting-off (from others) to your<sup>asws</sup> father<sup>asws</sup>, then to you<sup>asws</sup>. Then I took an oath to him<sup>asws</sup> by the right of Rasool-Allah<sup>saww</sup>, and the right of so and so, and so and so, until I ended up to him<sup>asws</sup>, with that, ‘Whatever you<sup>asws</sup> inform me with would not be coming out from me to anyone from the people’. ", "And I asked him<sup>asws</sup> about his<sup>asws</sup> father<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), ‘Is he<sup>asws</sup> alive or has he<sup>asws</sup> passed away?’ So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! He<sup>asws</sup> has passed away’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! Your<sup>asws</sup> Shias are reporting that in him<sup>asws</sup> were the Sunnahs of four Prophets<sup>as</sup>’. He<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, there being no god except Him<sup>azwj</sup>, he<sup>asws</sup> has passed away!’. I said, ‘Passing away of absence (Occultation) or passing away of death?’ He<sup>asws</sup> said: ‘Passing away of death’.", "So I said, ‘Perhaps you are observing dissimulation from me’. So he<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>!’ I said, ‘So he<sup>asws</sup> bequeathed to you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘So did he<sup>asws</sup> participate anyone else in it with you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘No’. I said, ‘So is there an Imam<sup>asws</sup> over you<sup>asws</sup> from your<sup>asws</sup> brethren?’ He<sup>asws</sup> said: ‘No’. I said, ‘So you<sup>asws</sup> are the Imam<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Yes’."]}}, {"index": 984, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:90:2", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ قَالَ قُلْتُ لِلرِّضَا ( عليه السلام ) إِنَّ رَجُلًا عَنَى أَخَاكَ إِبْرَاهِيمَ فَذَكَرَ لَهُ أَنَّ أَبَاكَ فِي الْحَيَاةِ وَ أَنَّكَ تَعْلَمُ مِنْ ذَلِكَ مَا يَعْلَمُ فَقَالَ سُبْحَانَ اللَّهِ يَمُوتُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ لَا يَمُوتُ مُوسَى ( عليه السلام ) قَدْ وَ اللَّهِ مَضَى كَمَا مَضَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ لَكِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمْ يَزَلْ مُنْذُ قَبَضَ نَبِيَّهُ ( صلى الله عليه وآله ) هَلُمَّ جَرّاً يَمُنُّ بِهَذَا الدِّينِ عَلَى أَوْلَادِ الْأَعَاجِمِ وَ يَصْرِفُهُ عَنْ قَرَابَةِ نَبِيِّهِ ( صلى الله عليه وآله ) هَلُمَّ جَرّاً فَيُعْطِي هَؤُلَاءِ وَ يَمْنَعُ هَؤُلَاءِ ", "لَقَدْ قَضَيْتُ عَنْهُ فِي هِلَالِ ذِي الْحِجَّةِ أَلْفَ دِينَارٍ بَعْدَ أَنْ أَشْفَى عَلَى طَلَاقِ نِسَائِهِ وَ عِتْقِ مَمَالِيكِهِ وَ لَكِنْ قَدْ سَمِعْتُ مَا لَقِيَ يُوسُفُ مِنْ إِخْوَتِهِ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Asbaat who said, ", "‘I said to Al-Reza<sup>asws</sup>, ‘A man implied to your<sup>asws</sup> brother Ibrahim and mentioned to him that your<sup>asws</sup> father<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) is alive and you<sup>asws</sup> know of that what he knows’. He<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! Rasool-Allah<sup>saww</sup> passes away and Musa<sup>asws</sup> does not pass away? By Allah<sup>azwj</sup>! He<sup>asws</sup> has passed away just as Rasool-Allah<sup>saww</sup> has passed away, but Allah<sup>azwj</sup> Blessed and High, since He<sup>azwj</sup> Captured (the soul of) His<sup>azwj</sup> Prophet<sup>saww</sup>, did not cease to Come forward with this Religion upon the children of the non-Arabs, and Exchanging it away from the relatives of His<sup>azwj</sup> Prophet<sup>saww</sup> and so on. So He<sup>azwj</sup> Gave these ones and Prevented those ones. ", "I<sup>asws</sup> have paid off on his (Ibrahim’s) behalf during the crescent of Zilhajj, a thousand Dinars after he had decided to divorce his wife and free his slaves, but you have heard what Yusuf<sup>as</sup> faced from his<sup>as</sup> brothers’."]}}, {"index": 985, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:90:3", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) إِنَّهُمْ رَوَوْا عَنْكَ فِي مَوْتِ أَبِي الْحَسَنِ ( عليه السلام ) أَنَّ رَجُلًا قَالَ لَكَ عَلِمْتَ ذَلِكَ بِقَوْلِ سَعِيدٍ فَقَالَ جَاءَ سَعِيدٌ بَعْدَ مَا عَلِمْتُ بِهِ قَبْلَ مَجِيئِهِ ", "قَالَ وَ سَمِعْتُهُ يَقُولُ طَلَّقْتُ أُمَّ فَرْوَةَ بِنْتَ إِسْحَاقَ فِي رَجَبٍ بَعْدَ مَوْتِ أَبِي الْحَسَنِ بِيَوْمٍ قُلْتُ طَلَّقْتَهَا وَ قَدْ عَلِمْتَ بِمَوْتِ أَبِي الْحَسَنِ قَالَ نَعَمْ قُلْتُ قَبْلَ أَنْ يَقْدَمَ عَلَيْكَ سَعِيدٌ قَالَ نَعَمْ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha who said, ", "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘They (people) are reporting from you<sup>asws</sup> regarding the passing away of Abu Al-Hassan<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), that a man said to you, ‘You knew of that (passing away of the 7<sup>th</sup> Imam<sup>asws</sup> in prison) by the words of Saeed’. So he<sup>asws</sup> said: ‘Saeed came after I<sup>asws</sup> had known of it, before his coming’. ", "He (the narrator) said, ‘And I heard him<sup>asws</sup> saying: ‘I<sup>asws</sup> divorced Umm Farwa, daughter of Is’haq, after the passing away of Abu Al-Hassan<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), by one day’. I said, ‘You<sup>asws</sup> divorced her and you<sup>asws</sup> had known of the passing away of Abu Al-Hassan<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>)?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘Before the proceeding of Saeed to you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Yes’."]}}, {"index": 986, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:90:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ قَالَ قُلْتُ لِلرِّضَا ( عليه السلام ) أَخْبِرْنِي عَنِ الْإِمَامِ مَتَى يَعْلَمُ أَنَّهُ إِمَامٌ حِينَ يَبْلُغُهُ أَنَّ صَاحِبَهُ قَدْ مَضَى أَوْ حِينَ يَمْضِي مِثْلَ أَبِي الْحَسَنِ قُبِضَ بِبَغْدَادَ وَ أَنْتَ هَاهُنَا قَالَ يَعْلَمُ ذَلِكَ حِينَ يَمْضِي صَاحِبُهُ قُلْتُ بِأَيِّ شَيْ‏ءٍ قَالَ يُلْهِمُهُ اللَّهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan who said, ", "‘I said to Al-Reza<sup>asws</sup>, ‘Inform me about the Imam<sup>asws</sup>, when does he<sup>asws</sup> know that he<sup>asws</sup> is the Imam<sup>asws</sup>, when it (news) reaches him<sup>asws</sup> that his<sup>asws</sup> companion (the previous Imam<sup>asws</sup>) has passed away, or when he<sup>asws</sup> (actually) did pass away? For example, Abu Al-Hassan<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) passed away at Baghdad and you<sup>asws</sup> are over here’. He<sup>asws</sup> said: ‘He<sup>asws</sup> knows that when his<sup>asws</sup> companion (the previous Imam<sup>asws</sup>) (actually) does pass away’. I said, ‘By which thing?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Inspires him<sup>asws</sup>’."]}}, {"index": 987, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:90:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي الْفَضْلِ الشَّهْبَانِيِّ عَنْ هَارُونَ بْنِ الْفَضْلِ قَالَ رَأَيْتُ أَبَا الْحَسَنِ عَلِيَّ بْنَ مُحَمَّدٍ فِي الْيَوْمِ الَّذِي تُوُفِّيَ فِيهِ أَبُو جَعْفَرٍ ( عليه السلام ) فَقَالَ إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ مَضَى أَبُو جَعْفَرٍ ( عليه السلام ) فَقِيلَ لَهُ وَ كَيْفَ عَرَفْتَ قَالَ لِأَنَّهُ تُدَاخِلُنِي ذِلَّةٌ لِلَّهِ لَمْ أَكُنْ أَعْرِفُهَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Abu Al Fazal Al Shahbany, from Haroun Bin Al Fazl who said, ", "‘I saw Abu Al-Hassan Ali Bin Muhammad<sup>asws</sup> (10<sup>th</sup> Imam<sup>asws</sup>) during the day in which Abu Ja’far<sup>asws</sup> (9<sup>th</sup> Imam<sup>asws</sup>) passed away, and he<sup>asws</sup> said: ‘We are for Allah<sup>azwj</sup> and to Him<sup>azwj</sup> we are returning’. Abu Ja’far<sup>asws</sup> has passed away’. So it was said to him<sup>asws</sup>, ‘And how did you<sup>asws</sup> know that?’ He<sup>asws</sup> said: ‘Because such humbleness to Allah<sup>azwj</sup> entered into me<sup>asws</sup> which I<sup>asws</sup> had not recognised it (beforehand)’."]}}, {"index": 988, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:90:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُسَافِرٍ قَالَ أَمَرَ أَبُو إِبْرَاهِيمَ ( عليه السلام ) حِينَ أُخْرِجَ بِهِ أَبَا الْحَسَنِ ( عليه السلام ) أَنْ يَنَامَ عَلَى بَابِهِ فِي كُلِّ لَيْلَةٍ أَبَداً مَا كَانَ حَيّاً إِلَى أَنْ يَأْتِيَهُ خَبَرُهُ ", "قَالَ فَكُنَّا فِي كُلِّ لَيْلَةٍ نَفْرُشُ لِأَبِي الْحَسَنِ فِي الدِّهْلِيزِ ثُمَّ يَأْتِي بَعْدَ الْعِشَاءِ فَيَنَامُ فَإِذَا أَصْبَحَ انْصَرَفَ إِلَى مَنْزِلِهِ قَالَ فَمَكَثَ عَلَى هَذِهِ الْحَالِ أَرْبَعَ سِنِينَ", "فَلَمَّا كَانَ لَيْلَةٌ مِنَ اللَّيَالِي أَبْطَأَ عَنَّا وَ فُرِشَ لَهُ فَلَمْ يَأْتِ كَمَا كَانَ يَأْتِي فَاسْتَوْحَشَ الْعِيَالُ وَ ذُعِرُوا وَ دَخَلَنَا أَمْرٌ عَظِيمٌ مِنْ إِبْطَائِهِ فَلَمَّا كَانَ مِنَ الْغَدِ أَتَى الدَّارَ وَ دَخَلَ إِلَى الْعِيَالِ وَ قَصَدَ إِلَى أُمِّ أَحْمَدَ فَقَالَ لَهَا هَاتِ الَّتِي أَوْدَعَكِ أَبِي فَصَرَخَتْ وَ لَطَمَتْ وَجْهَهَا وَ شَقَّتْ جَيْبَهَا وَ قَالَتْ مَاتَ وَ اللَّهِ سَيِّدِي", "فَكَفَّهَا وَ قَالَ لَهَا لَا تَكَلَّمِي بِشَيْ‏ءٍ وَ لَا تُظْهِرِيهِ حَتَّى يَجِي‏ءَ الْخَبَرُ إِلَى الْوَالِي فَأَخْرَجَتْ إِلَيْهِ سَفَطاً وَ أَلْفَيْ دِينَارٍ أَوْ أَرْبَعَةَ آلَافِ دِينَارٍ فَدَفَعَتْ ذَلِكَ أَجْمَعَ إِلَيْهِ دُونَ غَيْرِهِ وَ قَالَتْ إِنَّهُ قَالَ لِي فِيمَا بَيْنِي وَ بَيْنَهُ وَ كَانَتْ أَثِيرَةً عِنْدَهُ احْتَفِظِي بِهَذِهِ الْوَدِيعَةِ عِنْدَكِ لَا تُطْلِعِي عَلَيْهَا أَحَداً حَتَّى أَمُوتَ فَإِذَا مَضَيْتُ فَمَنْ أَتَاكِ مِنْ وُلْدِي فَطَلَبَهَا مِنْكِ فَادْفَعِيهَا إِلَيْهِ وَ اعْلَمِي أَنِّي قَدْ مِتُّ وَ قَدْ جَاءَنِي وَ اللَّهِ عَلَامَةُ سَيِّدِي", "فَقَبَضَ ذَلِكَ مِنْهَا وَ أَمَرَهُمْ بِالْإِمْسَاكِ جَمِيعاً إِلَى أَنْ وَرَدَ الْخَبَرُ وَ انْصَرَفَ فَلَمْ يَعُدْ لِشَيْ‏ءٍ مِنَ الْمَبِيتِ كَمَا كَانَ يَفْعَلُ فَمَا لَبِثْنَا إِلَّا أَيَّاماً يَسِيرَةً حَتَّى جَاءَتِ الْخَرِيطَةُ بِنَعْيِهِ فَعَدَدْنَا الْأَيَّامَ وَ تَفَقَّدْنَا الْوَقْتَ فَإِذَا هُوَ قَدْ مَاتَ فِي الْوَقْتِ الَّذِي فَعَلَ أَبُو الْحَسَنِ ( عليه السلام ) مَا فَعَلَ مِنْ تَخَلُّفِهِ عَنِ الْمَبِيتِ وَ قَبْضِهِ لِمَا قَبَضَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Musafir who said, ", "‘Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) instructed Abu Al-Hassan<sup>asws</sup> (8<sup>th</sup> Imam<sup>asws</sup>), when he<sup>asws</sup> was brought out with (to be imprisoned), that he<sup>asws</sup> (8<sup>th</sup> Imam<sup>asws</sup>) should sleep at his<sup>asws</sup> door during every night for ever for as long as he (7<sup>th</sup> Imam<sup>asws</sup>) was alive, up to the time when his<sup>asws</sup> news (of passing away) comes to him<sup>asws</sup> (8<sup>th</sup> Imam<sup>asws</sup>)’. ", "He (the narrator) said, ‘So every night we used to prepared the bed for Abu Al-Hassan<sup>asws</sup> at the corridor. Then he<sup>asws</sup> would come after Al-Isha and he<sup>asws</sup> would sleep. So when it would be the morning, he<sup>asws</sup> would leave to go to his<sup>asws</sup> house. So it was upon this state for four years.", "So when it was a night from the nights, he<sup>asws</sup> was delayed from us and we had prepared the bed for him<sup>asws</sup>, and he<sup>asws</sup> did not come as he<sup>asws</sup> used to come. So the dependants were apprehensive and a grievous matter entered into us due to his<sup>asws</sup> delay. So when it was the morning, he<sup>asws</sup> came to the house and entered to the dependants and went to Umm Ahmad and said to her: ‘Bring that which my<sup>asws</sup> father<sup>asws</sup> had entrusted to you’. So she shrieked and slapped her face and tore her garment and said, ‘By Allah<sup>azwj</sup>, my Master<sup>asws</sup> has passed away’. ", "So he<sup>asws</sup> stopped her and said to her: ‘Do not speak with anything nor make it apparent until the news comes to the governor’. So she brought out to him<sup>asws</sup> a package and two thousand Dinars, or four thousand Dinars, and handed over the entirety of these to him<sup>asws</sup>, besides others, and she said, ‘He<sup>asws</sup> had said to me, regarding what is between me and him<sup>asws</sup>, and she was affectionate in his<sup>asws</sup> presence: ‘Protect these entrustment with you and do not notify anyone upon it until I<sup>asws</sup> pass away. So when I<sup>asws</sup> do pass away, so whoever from my<sup>asws</sup> sons comes to you seeking it from you, hand it over to him, and know that I<sup>asws</sup> have passed away’. And, by Allah<sup>azwj</sup>, the sign of my Master<sup>asws</sup> has come to me’. ", "So he<sup>asws</sup> took possession of that from her and instructed all of them to withhold until the news comes to them, and he<sup>asws</sup> left. So he<sup>asws</sup> did not repeat anything from the sleeping just as he<sup>asws</sup> used to do beforehand. And it was not long, except a few days, until there came the news of his<sup>asws</sup> passing away. So we numbered the days and the lost time, and it was so that he (7<sup>th</sup> Imam<sup>asws</sup>) had passed away during the time in which Abu Al-Hassan<sup>asws</sup> did what he<sup>asws</sup> did from staying behind from the sleeping (in the corridor) and taking possession of what he<sup>asws</sup> took possession of’."]}}]}, "index": "al-kafi:1:4:90", "kind": "verse_list"}