{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 91"}, "path": "/books/al-kafi:1:4:91", "titles": {"ar": "باب حَالَاتِ الْأَئِمَّةِ ( عليهم السلام ) فِي السِّنِّ", "en": "Chapter 91 – States of the Imams<sup>asws</sup> regarding the age"}}], "index": 149, "local_index": 91, "part_type": "Chapter", "path": "/books/al-kafi:1:4:91", "titles": {"ar": "باب حَالَاتِ الْأَئِمَّةِ ( عليهم السلام ) فِي السِّنِّ", "en": "Chapter 91 – States of the Imams<sup>asws</sup> regarding the age"}, "verse_count": 8, "verse_start_index": 988, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 989, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:91:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ يَزِيدَ الْكُنَاسِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) أَ كَانَ عِيسَى ابْنُ مَرْيَمَ ( عليه السلام ) حِينَ تَكَلَّمَ فِي الْمَهْدِ حُجَّةَ اللَّهِ عَلَى أَهْلِ زَمَانِهِ فَقَالَ كَانَ يَوْمَئِذٍ نَبِيّاً حُجَّةَ اللَّهِ غَيْرَ مُرْسَلٍ أَ مَا تَسْمَعُ لِقَوْلِهِ حِينَ قَالَ إِنِّي عَبْدُ اللَّهِ آتانِيَ الْكِتابَ وَ جَعَلَنِي نَبِيًّا. وَ جَعَلَنِي مُبارَكاً أَيْنَ ما كُنْتُ وَ أَوْصانِي بِالصَّلاةِ وَ الزَّكاةِ ما دُمْتُ حَيًّا", "قُلْتُ فَكَانَ يَوْمَئِذٍ حُجَّةً لِلَّهِ عَلَى زَكَرِيَّا فِي تِلْكَ الْحَالِ وَ هُوَ فِي الْمَهْدِ فَقَالَ كَانَ عِيسَى فِي تِلْكَ الْحَالِ آيَةً لِلنَّاسِ وَ رَحْمَةً مِنَ اللَّهِ لِمَرْيَمَ حِينَ تَكَلَّمَ فَعَبَّرَ عَنْهَا وَ كَانَ نَبِيّاً حُجَّةً عَلَى مَنْ سَمِعَ كَلَامَهُ فِي تِلْكَ الْحَالِ ثُمَّ صَمَتَ فَلَمْ يَتَكَلَّمْ حَتَّى مَضَتْ لَهُ سَنَتَانِ وَ كَانَ زَكَرِيَّا الْحُجَّةَ لِلَّهِ عَزَّ وَ جَلَّ عَلَى النَّاسِ بَعْدَ صَمْتِ عِيسَى بِسَنَتَيْنِ", "ثُمَّ مَاتَ زَكَرِيَّا فَوَرِثَهُ ابْنُهُ يَحْيَى الْكِتَابَ وَ الْحِكْمَةَ وَ هُوَ صَبِيٌّ صَغِيرٌ أَ مَا تَسْمَعُ لِقَوْلِهِ عَزَّ وَ جَلَّ يا يَحْيى خُذِ الْكِتابَ بِقُوَّةٍ وَ آتَيْناهُ الْحُكْمَ صَبِيًّا", "فَلَمَّا بَلَغَ عِيسَى ( عليه السلام ) سَبْعَ سِنِينَ تَكَلَّمَ بِالنُّبُوَّةِ وَ الرِّسَالَةِ حِينَ أَوْحَى اللَّهُ تَعَالَى إِلَيْهِ فَكَانَ عِيسَى الْحُجَّةَ عَلَى يَحْيَى وَ عَلَى النَّاسِ أَجْمَعِينَ وَ لَيْسَ تَبْقَى الْأَرْضُ يَا أَبَا خَالِدٍ يَوْماً وَاحِداً بِغَيْرِ حُجَّةٍ لِلَّهِ عَلَى النَّاسِ مُنْذُ يَوْمَ خَلَقَ اللَّهُ آدَمَ ( عليه السلام ) وَ أَسْكَنَهُ الْأَرْضَ", "فَقُلْتُ جُعِلْتُ فِدَاكَ أَ كَانَ عَلِيٌّ ( عليه السلام ) حُجَّةً مِنَ اللَّهِ وَ رَسُولِهِ عَلَى هَذِهِ الْأُمَّةِ فِي حَيَاةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ نَعَمْ يَوْمَ أَقَامَهُ لِلنَّاسِ وَ نَصَبَهُ عَلَماً وَ دَعَاهُمْ إِلَى وَلَايَتِهِ وَ أَمَرَهُمْ بِطَاعَتِهِ", "قُلْتُ وَ كَانَتْ طَاعَةُ عَلِيٍّ ( عليه السلام ) وَاجِبَةً عَلَى النَّاسِ فِي حَيَاةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ بَعْدَ وَفَاتِهِ فَقَالَ نَعَمْ وَ لَكِنَّهُ صَمَتَ فَلَمْ يَتَكَلَّمْ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ كَانَتِ الطَّاعَةُ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) عَلَى أُمَّتِهِ وَ عَلَى عَلِيٍّ ( عليه السلام ) فِي حَيَاةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ كَانَتِ الطَّاعَةُ مِنَ اللَّهِ وَ مِنْ رَسُولِهِ عَلَى النَّاسِ كُلِّهِمْ لِعَلِيٍّ ( عليه السلام ) بَعْدَ وَفَاةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ كَانَ عَلِيٌّ ( عليه السلام ) حَكِيماً عَالِماً ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Hisham Bin Salim, from Yazeed Al Kunasy who said, ", "‘I asked Abu Ja’far<sup>asws</sup>, ‘Was Isa<sup>as</sup> Ibn Maryam<sup>as</sup>, when he<sup>as</sup> spoke in the cradle, a Divine Authority of Allah<sup>azwj</sup> upon the people of his<sup>asws</sup> era?’ So he<sup>asws</sup> said: ‘He<sup>as</sup> was a Prophet<sup>as</sup> in those days, a Divine Authority of Allah<sup>azwj</sup> without being a <span class=\"iTxt\">Mursil</span>. Have you not listened to his<sup>as</sup> words when he<sup>as</sup> said <span class=\"ibTxt\">[19:30] He said: I am a servant of Allah; He has Given me the Book and Made me a Prophet [19:31] And He has Made me Blessed wherever I may be, and He has Enjoined upon me with the Prayer and the Zakat for as long as I live</span>?’.", "I said, ‘In those days he<sup>as</sup> was a Divine Authority upon Zakariyya<sup>as</sup> in that state, and he<sup>as</sup> (Isa<sup>as</sup>) was in the cradle?’ So he<sup>asws</sup> said: ‘Isa<sup>as</sup>, in that state, was a Sign for the people and a Mercy from Allah<sup>azwj</sup> to Maryam<sup>as</sup> when he<sup>as</sup> spoke, so he<sup>as</sup> expressed on her<sup>as</sup> behalf, and he<sup>as</sup> was a Prophet<sup>as</sup>, a Divine Authority upon the ones who heard his<sup>as</sup> speech in that state. Then he<sup>as</sup> was silent, so he<sup>as</sup> did not speak until two years passed by for him<sup>as</sup>, and it was so that Zakariyya<sup>as</sup> was the Divine Authority of Allah<sup>azwj</sup> Mighty and Majestic upon the people after the silence of Isa<sup>as</sup> by two years. ", "Then Zakariyya<sup>as</sup> passed away, so his<sup>as</sup> son<sup>as</sup> Yahya<sup>as</sup> inherited him<sup>as</sup>, the Book and the Wisdom, and he<sup>as</sup> was a young child. Have you not listened to the Words of the Mighty and Majestic <span class=\"ibTxt\">[19:12] O Yahya! Grab hold of the Book with strength; and We Granted him the Wisdom whilst he was a child</span>?", "So when Isa<sup>as</sup> reached the age of seven years, he<sup>as</sup> spoke with the Prophet-hood and the Messenger-ship when Allah<sup>azwj</sup> the Exalted Revealed unto him<sup>as</sup>. So Isa<sup>as</sup> was the Divine Authority upon Yahya<sup>as</sup> and upon the people altogether, and the earth doesn’t remain, O Abu Khalid, even for one day without a Divine Authority of Allah<sup>azwj</sup> upon the people since the day Allah<sup>azwj</sup> Created Adam<sup>as</sup> and Settled him<sup>as</sup> in the earth’. ", "So I said, ‘May I be sacrificed for you<sup>asws</sup>! Was Ali<sup>asws</sup> a Divine Authority of Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> upon this community during the lifetime of Rasool-Allah<sup>saww</sup>?’ So he<sup>asws</sup> said: ‘Yes, the day he<sup>saww</sup> nominated him<sup>asws</sup> to the people and established him<sup>asws</sup> as a flag and called them to his<sup>as</sup> Wilayah and ordered them with his<sup>asws</sup> obedience’. ", "I said, ‘And was it so that the obedience to Ali<sup>asws</sup> was an Obligation upon the people during the lifetime of Rasool-Allah<sup>saww</sup> and after his<sup>saww</sup> passing away?’ So he<sup>asws</sup> said: ‘Yes, but he<sup>asws</sup> was silent, so he<sup>asws</sup> did not speak along with Rasool-Allah<sup>saww</sup>, and it was so that the obedience to Rasool-Allah<sup>saww</sup> was upon his<sup>saww</sup> community and upon Ali<sup>asws</sup> during the lifetime of Rasool-Allah<sup>saww</sup>, and it was so that the obedience for Ali<sup>asws</sup> was from Allah<sup>azwj</sup> and from His<sup>azwj</sup> Rasool<sup>saww</sup> upon the people, all of them, after the passing away of Rasool-Allah<sup>saww</sup>, and it was so that Ali<sup>asws</sup> was wise, knowledgeable’."]}}, {"index": 990, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:91:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ قُلْتُ لِلرِّضَا ( عليه السلام ) قَدْ كُنَّا نَسْأَلُكَ قَبْلَ أَنْ يَهَبَ اللَّهُ لَكَ أَبَا جَعْفَرٍ ( عليه السلام ) فَكُنْتَ تَقُولُ يَهَبُ اللَّهُ لِي غُلَاماً فَقَدْ وَهَبَ اللَّهُ لَكَ فَقَرَّ عُيُونُنَا فَلَا أَرَانَا اللَّهُ يَوْمَكَ فَإِنْ كَانَ كَوْنٌ فَإِلَى مَنْ ", "فَأَشَارَ بِيَدِهِ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) وَ هُوَ قَائِمٌ بَيْنَ يَدَيْهِ فَقُلْتُ جُعِلْتُ فِدَاكَ هَذَا ابْنُ ثَلَاثِ سِنِينَ قَالَ وَ مَا يَضُرُّهُ مِنْ ذَلِكَ شَيْ‏ءٌ قَدْ قَامَ عِيسَى ( عليه السلام ) بِالْحُجَّةِ وَ هُوَ ابْنُ ثَلَاثِ سِنِينَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Safwan Bin Yahya who said, ", "‘I said to Al-Reza<sup style=\"font-weight: normal\">asws</sup>, ‘We had asked you<sup style=\"font-weight: normal\">asws</sup> before Allah<sup style=\"font-weight: normal\">azwj</sup> Endowed Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> (9<sup style=\"font-weight: normal\">th</sup> Imam<sup style=\"font-weight: normal\">asws</sup>) to you<sup style=\"font-weight: normal\">asws</sup>. So you<sup style=\"font-weight: normal\">asws</sup> were saying: ‘Allah<sup style=\"font-weight: normal\">azwj</sup> will Endow a boy unto me<sup style=\"font-weight: normal\">asws</sup>’. So Allah<sup style=\"font-weight: normal\">azwj</sup> has (now) Endowed him<sup style=\"font-weight: normal\">as</sup> to you<sup style=\"font-weight: normal\">asws</sup> and our eyes are delighted. May Allah<sup style=\"font-weight: normal\">azwj</sup> not Show us your<sup style=\"font-weight: normal\">asws</sup> day (of passing away). So if it does happen, to whom (should we look to)?’ ", "So he<sup style=\"font-weight: normal\">asws</sup> gestured by his<sup style=\"font-weight: normal\">asws</sup> hand towards Abu Ja’far<sup style=\"font-weight: normal\">asws</sup>, and he<sup style=\"font-weight: normal\">asws</sup> was standing in front of him<sup style=\"font-weight: normal\">asws</sup>’. So I said, ‘May I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>! This is a boy of three years old?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘And nothing affects him<sup style=\"font-weight: normal\">asws</sup> from that. Isa<sup style=\"font-weight: normal\">as</sup> had stood with the Divine Authority and he<sup style=\"font-weight: normal\">as</sup> was a boy of three years old’."]}}, {"index": 991, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:91:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنَّهُمْ يَقُولُونَ فِي حَدَاثَةِ سِنِّكَ فَقَالَ إِنَّ اللَّهَ تَعَالَى أَوْحَى إِلَى دَاوُدَ أَنْ يَسْتَخْلِفَ سُلَيْمَانَ وَ هُوَ صَبِيٌّ يَرْعَى الْغَنَمَ فَأَنْكَرَ ذَلِكَ عُبَّادُ بَنِي إِسْرَائِيلَ وَ عُلَمَاؤُهُمْ فَأَوْحَى اللَّهُ إِلَى دَاوُدَ ( عليه السلام ) أَنْ خُذْ عَصَا الْمُتَكَلِّمِينَ وَ عَصَا سُلَيْمَانَ وَ اجْعَلْهَا فِي بَيْتٍ وَ اخْتِمْ عَلَيْهَا بِخَوَاتِيمِ الْقَوْمِ فَإِذَا كَانَ مِنَ الْغَدِ فَمَنْ كَانَتْ عَصَاهُ قَدْ أَوْرَقَتْ وَ أَثْمَرَتْ فَهُوَ الْخَلِيفَةُ فَأَخْبَرَهُمْ دَاوُدُ فَقَالُوا قَدْ رَضِينَا وَ سَلَّمْنَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Sayf, from one of our companions, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, said, ‘I said to him<sup>asws</sup>, ‘They (people) are talking regarding the infancy of your<sup>asws</sup> age’. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> the Exalted Revealed unto Dawood<sup>as</sup> that he<sup>as</sup> choose Suleyman<sup>as</sup> as the Caliph, and he<sup>as</sup> was a child pasturing sheep. So the worshippers of the Children of Israel and their scholars denied that. So Allah<sup>azwj</sup> Revealed unto Dawood<sup>as</sup>: “Take the staffs of the speakers and the staff of Suleyman<sup>as</sup> and make these to be in a house, and seal upon these with the seals of the people. So when it would be the morning, the one whose staff would have sprouted leaves and fruit, so he<sup>asws</sup> would be the Caliph”. So Dawood<sup>as</sup> informed them, and they said, ‘We agree and submit’’."]}}, {"index": 992, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:91:4", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ وَ غَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ مُصْعَبٍ عَنْ مَسْعَدَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَبُو بَصِيرٍ دَخَلْتُ إِلَيْهِ وَ مَعِي غُلَامٌ يَقُودُنِي خُمَاسِيٌّ لَمْ يَبْلُغْ فَقَالَ لِي كَيْفَ أَنْتُمْ إِذَا احْتَجَّ عَلَيْكُمْ بِمِثْلِ سِنِّهِ أَوْ قَالَ سَيَلِي عَلَيْكُمْ بِمِثْلِ سِنِّهِ "], "translations": {"en.hubeali": ["Ali Bin Muhammad, and someone else, from Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from Mus’ab, from Mas’ada, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>. Abu Baseer said, ‘I went over to him<sup>asws</sup> and with me was a boy, guiding me, being of five years old, not having attained adulthood. So he<sup>asws</sup> said to me: ‘How would you be (reacting) when it is argued against you with the likes of his age?’ Or he<sup>asws</sup> said: ‘Or a successor<sup>asws</sup> upon you with the likes of his<sup>asws</sup> age?’."]}}, {"index": 993, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:91:5", "text": ["سَهْلُ بْنُ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ قَالَ سَأَلْتُهُ يَعْنِي أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ شَيْ‏ءٍ مِنْ أَمْرِ الْإِمَامِ فَقُلْتُ يَكُونُ الْإِمَامُ ابْنَ أَقَلَّ مِنْ سَبْعِ سِنِينَ فَقَالَ نَعَمْ وَ أَقَلَّ مِنْ خَمْسِ سِنِينَ ", "فَقَالَ سَهْلٌ فَحَدَّثَنِي عَلِيُّ بْنُ مَهْزِيَارَ بِهَذَا فِي سَنَةِ إِحْدَى وَ عِشْرِينَ وَ مِائَتَيْنِ ."], "translations": {"en.hubeali": ["Sahl Bin Ziyad, from Ali Bin Mahziyar, from Muhammad Bin Ismail Bin Bazie who said, ", "‘I asked him<sup>asws</sup>, meaning Abu Ja’far<sup>asws</sup> about something from the matters of the Imam<sup>asws</sup>, and I said, ‘Can the Imam<sup>asws</sup> happen to be a boy of less than seven years old?’ So he<sup>asws</sup> said: ‘Yes, and even less than five years old’. ", "So Sahl said, ‘Ali Bin Mahziyar narrated to me with this during the year two hundred and twenty one (A.H.)’."]}}, {"index": 994, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:91:6", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ الْخَيْرَانِيِّ عَنْ أَبِيهِ قَالَ كُنْتُ وَاقِفاً بَيْنَ يَدَيْ أَبِي الْحَسَنِ ( عليه السلام ) بِخُرَاسَانَ فَقَالَ لَهُ قَائِلٌ يَا سَيِّدِي إِنْ كَانَ كَوْنٌ فَإِلَى مَنْ قَالَ إِلَى أَبِي جَعْفَرٍ ابْنِي فَكَأَنَّ الْقَائِلَ اسْتَصْغَرَ سِنَّ أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى بَعَثَ عِيسَى ابْنَ مَرْيَمَ ( عليه السلام ) رَسُولًا نَبِيّاً صَاحِبَ شَرِيعَةٍ مُبْتَدَأَةٍ فِي أَصْغَرَ مِنَ السِّنِّ الَّذِي فِيهِ أَبُو جَعْفَرٍ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Al Kahyrani, from his father who said, ", "‘I was standing in front of Abu Al-Hassan<sup>asws</sup> (8<sup>th</sup> Imam<sup>asws</sup> at Khurasan, and a speaker said to him, ‘O my Master<sup>asws</sup>! If there occurs the event (of your<sup>asws</sup> passing away), so to whom (show we look to)?’ He<sup>asws</sup> said: ‘To Abu Ja’far<sup>asws</sup> my<sup>asws</sup> son<sup>asws</sup>’. So it was as if the speaker was belittling the age of Abu Ja’far<sup>asws</sup>. So Abu Al-Hassan<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High Sent Isa<sup>as</sup> Ibn Maryam<sup>as</sup> as a Rasool<sup>as</sup>, a Prophet<sup>as</sup>, as a owner of a Law, beginning at an age younger than that of Abu Ja’far<sup>asws</sup>’."]}}, {"index": 995, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:91:7", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ قَالَ رَأَيْتُ أَبَا جَعْفَرٍ ( عليه السلام ) وَ قَدْ خَرَجَ عَلَيَّ فَأَخَذْتُ النَّظَرَ إِلَيْهِ وَ جَعَلْتُ أَنْظُرُ إِلَى رَأْسِهِ وَ رِجْلَيْهِ لِأَصِفَ قَامَتَهُ لِأَصْحَابِنَا بِمِصْرَ فَبَيْنَا أَنَا كَذَلِكَ حَتَّى قَعَدَ فَقَالَ يَا عَلِيُّ إِنَّ اللَّهَ احْتَجَّ فِي الْإِمَامَةِ بِمِثْلِ مَا احْتَجَّ بِهِ فِي النُّبُوَّةِ فَقَالَ وَ آتَيْناهُ الْحُكْمَ صَبِيًّا وَ لَمَّا بَلَغَ أَشُدَّهُ وَ بَلَغَ أَرْبَعِينَ سَنَةً فَقَدْ يَجُوزُ أَنْ يُؤْتَى الْحِكْمَةَ وَ هُوَ صَبِيٌّ وَ يَجُوزُ أَنْ يُؤْتَاهَا وَ هُوَ ابْنُ أَرْبَعِينَ سَنَةً ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Ali Bin Asbat who said, ", "‘I saw Abu Ja’far<sup>asws</sup> and he<sup>asws</sup> had come out to me. So I took to looking at him<sup>asws</sup> and went on looking at him<sup>asws</sup> to his<sup>asws</sup> head and his<sup>asws</sup> legs in order to be able to describe him<sup>asws</sup> to our companions in Egypt. While I was during that, he<sup>asws</sup> sat down and said: ‘O Ali! Allah<sup>azwj</sup> has Argued regarding the Imamate similar to what He<sup>azwj</sup> Argued with regarding the Prophet-hood, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[19:12] and We Granted him the Wisdom whilst he was a child</span>. <span class=\"ibTxt\">[46:15] until when he attains his maturity and reaches forty years</span>. Thus, it is allowed that he<sup>as</sup> be Given the Wisdom and he<sup>as</sup> was a child, and it is allowed that He<sup>azwj</sup> be Given it and he<sup>as</sup> was a man of forty years of age’."]}}, {"index": 996, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:91:8", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ قَالَ قَالَ عَلِيُّ بْنُ حَسَّانَ لِأَبِي جَعْفَرٍ ( عليه السلام ) يَا سَيِّدِي إِنَّ النَّاسَ يُنْكِرُونَ عَلَيْكَ حَدَاثَةَ سِنِّكَ فَقَالَ وَ مَا يُنْكِرُونَ مِنْ ذَلِكَ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ لَقَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ لِنَبِيِّهِ ( صلى الله عليه وآله ) قُلْ هذِهِ سَبِيلِي أَدْعُوا إِلَى اللَّهِ عَلى بَصِيرَةٍ أَنَا وَ مَنِ اتَّبَعَنِي فَوَ اللَّهِ مَا تَبِعَهُ إِلَّا عَلِيٌّ ( عليه السلام ) وَ لَهُ تِسْعُ سِنِينَ وَ أَنَا ابْنُ تِسْعِ سِنِينَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father who said, ", "‘Ali Bin Hassan said to Abu Ja’far<sup>asws</sup>, ‘O my Master<sup>asws</sup>! The people are denying upon you<sup>asws</sup> because of your young age’. So he<sup>asws</sup> said: ‘And what are they denying from that, the Words of Allah<sup>azwj</sup> Mighty and Majestic? Allah<sup>azwj</sup> Mighty and Majestic Said to His<sup>azwj</sup> Prophet<sup>saww</sup> <span class=\"ibTxt\">[12:108] Say: This is my way: I call to Allah, I and the one who follows me having insight</span>. So, by Allah<sup>azwj</sup>, none followed him<sup>saww</sup> except for Ali<sup>asws</sup>, and for him<sup>asws</sup> were nine years, and I<sup>asws</sup> am a boy of nine years old’."]}}]}, "index": "al-kafi:1:4:91", "kind": "verse_list"}