{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 93"
        },
        "path": "/books/al-kafi:1:4:93",
        "titles": {
          "ar": "باب مَوَالِيدِ الْأَئِمَّةِ ( عليهم السلام )",
          "en": "Chapter 93 – The Coming (to the World) of the Imams<sup>asws</sup>"
        }
      }
    ],
    "index": 151,
    "local_index": 93,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 94"
        },
        "path": "/books/al-kafi:1:4:94",
        "titles": {
          "ar": "باب خَلْقِ أَبْدَانِ الْأَئِمَّةِ وَ أَرْوَاحِهِمْ وَ قُلُوبِهِمْ ( عليهم السلام )",
          "en": "Chapter 94 – The Creation of the Imams<sup>asws</sup>, and their spirits and their<sup>asws</sup> hearts"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 92"
        },
        "path": "/books/al-kafi:1:4:92",
        "titles": {
          "ar": "باب أَنَّ الْإِمَامَ لَا يَغْسِلُهُ إِلَّا إِمَامٌ مِنَ الْأَئِمَّةِ ( عليهم السلام )",
          "en": "Chapter 92 – The Imam<sup>asws</sup> is such that none can wash him<sup>asws</sup> (funeral wash) except an Imam<sup>asws</sup> from the Imams<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:93",
    "titles": {
      "ar": "باب مَوَالِيدِ الْأَئِمَّةِ ( عليهم السلام )",
      "en": "Chapter 93 – The Coming (to the World) of the Imams<sup>asws</sup>"
    },
    "verse_count": 8,
    "verse_start_index": 999,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف بسندي ه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/259)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1000,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:93:1",
        "relations": {
          "Mentions": [
            "/books/quran:3:18",
            "/books/quran:6:115",
            "/books/quran:97:4"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> عَنْ عَبْدِ اللَّهِ بْنِ إِسْحَاقَ الْعَلَوِيِّ عَنْ مُحَمَّدِ بْنِ زَيْدٍ الرِّزَامِيِّ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ حَجَجْنَا مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي السَّنَةِ الَّتِي وُلِدَ فِيهَا ابْنُهُ مُوسَى ( عليه السلام ) فَلَمَّا نَزَلْنَا الْأَبْوَاءَ وَضَعَ لَنَا الْغَدَاءَ وَ كَانَ إِذَا وَضَعَ الطَّعَامَ لِأَصْحَابِهِ أَكْثَرَ وَ أَطَابَ",
          "قَالَ فَبَيْنَا نَحْنُ نَأْكُلُ إِذْ أَتَاهُ رَسُولُ حَمِيدَةَ فَقَالَ لَهُ إِنَّ حَمِيدَةَ تَقُولُ قَدْ أَنْكَرْتُ نَفْسِي وَ قَدْ وَجَدْتُ مَا كُنْتُ أَجِدُ إِذَا حَضَرَتْ وِلَادَتِي وَ قَدْ أَمَرْتَنِي أَنْ لَا أَسْتَبِقَكَ بِابْنِكَ هَذَا فَقَامَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَانْطَلَقَ مَعَ الرَّسُولِ",
          "فَلَمَّا انْصَرَفَ قَالَ لَهُ أَصْحَابُهُ سَرَّكَ اللَّهُ وَ جَعَلَنَا فِدَاكَ فَمَا أَنْتَ صَنَعْتَ مِنْ حَمِيدَةَ قَالَ سَلَّمَهَا اللَّهُ وَ قَدْ وَهَبَ لِي غُلَاماً وَ هُوَ خَيْرُ مَنْ بَرَأَ اللَّهُ فِي خَلْقِهِ وَ لَقَدْ أَخْبَرَتْنِي حَمِيدَةُ عَنْهُ بِأَمْرٍ ظَنَّتْ أَنِّي لَا أَعْرِفُهُ وَ لَقَدْ كُنْتُ أَعْلَمَ بِهِ مِنْهَا",
          "فَقُلْتُ جُعِلْتُ فِدَاكَ وَ مَا الَّذِي أَخْبَرَتْكَ بِهِ حَمِيدَةُ عَنْهُ قَالَ ذَكَرَتْ أَنَّهُ سَقَطَ مِنْ بَطْنِهَا حِينَ سَقَطَ وَاضِعاً يَدَيْهِ عَلَى الْأَرْضِ رَافِعاً رَأْسَهُ إِلَى السَّمَاءِ فَأَخْبَرْتُهَا أَنَّ ذَلِكَ أَمَارَةُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَمَارَةُ الْوَصِيِّ مِنْ بَعْدِهِ",
          "فَقُلْتُ جُعِلْتُ فِدَاكَ وَ مَا هَذَا مِنْ أَمَارَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَمَارَةِ الْوَصِيِّ مِنْ بَعْدِهِ فَقَالَ لِي إِنَّهُ لَمَّا كَانَتِ اللَّيْلَةُ الَّتِي عُلِقَ فِيهَا بِجَدِّي أَتَى آتٍ جَدَّ أَبِي بِكَأْسٍ فِيهِ شَرْبَةٌ أَرَقُّ مِنَ الْمَاءِ وَ أَلْيَنُ مِنَ الزُّبْدِ وَ أَحْلَى مِنَ الشَّهْدِ وَ أَبْرَدُ مِنَ الثَّلْجِ وَ أَبْيَضُ مِنَ اللَّبَنِ فَسَقَاهُ إِيَّاهُ وَ أَمَرَهُ بِالْجِمَاعِ فَقَامَ فَجَامَعَ فَعُلِقَ بِجَدِّي",
          "وَ لَمَّا أَنْ كَانَتِ اللَّيْلَةُ الَّتِي عُلِقَ فِيهَا بِأَبِي أَتَى آتٍ جَدِّي فَسَقَاهُ كَمَا سَقَى جَدَّ أَبِي وَ أَمَرَهُ بِمِثْلِ الَّذِي أَمَرَهُ فَقَامَ فَجَامَعَ فَعُلِقَ بِأَبِي",
          "وَ لَمَّا أَنْ كَانَتِ اللَّيْلَةُ الَّتِي عُلِقَ فِيهَا بِي أَتَى آتٍ أَبِي فَسَقَاهُ بِمَا سَقَاهُمْ وَ أَمَرَهُ بِالَّذِي أَمَرَهُمْ بِهِ فَقَامَ فَجَامَعَ فَعُلِقَ بِي",
          "َ لَمَّا أَنْ كَانَتِ اللَّيْلَةُ الَّتِي عُلِقَ فِيهَا بِابْنِي أَتَانِي آتٍ كَمَا أَتَاهُمْ فَفَعَلَ بِي كَمَا فَعَلَ بِهِمْ فَقُمْتُ بِعِلْمِ اللَّهِ وَ إِنِّي مَسْرُورٌ بِمَا يَهَبُ اللَّهُ لِي فَجَامَعْتُ فَعُلِقَ بِابْنِي هَذَا الْمَوْلُودِ فَدُونَكُمْ فَهُوَ وَ اللَّهِ صَاحِبُكُمْ مِنْ بَعْدِي",
          "و إِنَّ نُطْفَةَ الْإِمَامِ مِمَّا أَخْبَرْتُكَ وَ إِذَا سَكَنَتِ النُّطْفَةُ فِي الرَّحِمِ أَرْبَعَةَ أَشْهُرٍ وَ أُنْشِئَ فِيهَا الرُّوحُ بَعَثَ اللَّهُ تَبَارَكَ وَ تَعَالَى مَلَكاً يُقَالُ لَهُ حَيَوَانُ فَكَتَبَ عَلَى عَضُدِهِ الْأَيْمَنِ وَ تَمَّتْ كَلِمَةُ رَبِّكَ صِدْقاً وَ عَدْلًا لا مُبَدِّلَ لِكَلِماتِهِ وَ هُوَ السَّمِيعُ الْعَلِيمُ",
          "وَ إِذَا وَقَعَ مِنْ بَطْنِ أُمِّهِ وَقَعَ وَاضِعاً يَدَيْهِ عَلَى الْأَرْضِ رَافِعاً رَأْسَهُ إِلَى السَّمَاءِ فَأَمَّا وَضْعُهُ يَدَيْهِ عَلَى الْأَرْضِ فَإِنَّهُ يَقْبِضُ كُلَّ عِلْمٍ لِلَّهِ أَنْزَلَهُ مِنَ السَّمَاءِ إِلَى الْأَرْضِ وَ أَمَّا رَفْعُهُ رَأْسَهُ إِلَى السَّمَاءِ فَإِنَّ مُنَادِياً يُنَادِي بِهِ مِنْ بُطْنَانِ الْعَرْشِ مِنْ قِبَلِ رَبِّ الْعِزَّةِ مِنَ الْأُفُقِ الْأَعْلَى بِاسْمِهِ وَ اسْمِ أَبِيهِ",
          "يَقُولُ يَا فُلَانَ بْنَ فُلَانٍ اثْبُتْ تُثْبَتْ فَلِعَظِيمٍ مَا خَلَقْتُكَ أَنْتَ صَفْوَتِي مِنْ خَلْقِي وَ مَوْضِعُ سِرِّي وَ عَيْبَةُ عِلْمِي وَ أَمِينِي عَلَى وَحْيِي وَ خَلِيفَتِي فِي أَرْضِي لَكَ وَ لِمَنْ تَوَلَّاكَ أَوْجَبْتُ رَحْمَتِي وَ مَنَحْتُ جِنَانِي وَ أَحْلَلْتُ جِوَارِي ثُمَّ وَ عِزَّتِي وَ جَلَالِي لَأَصْلِيَنَّ مَنْ عَادَاكَ أَشَدَّ عَذَابِي وَ إِنْ وَسَّعْتُ عَلَيْهِ فِي دُنْيَايَ مِنْ سَعَةِ رِزْقِي",
          "فَإِذَا انْقَضَى الصَّوْتُ صَوْتُ الْمُنَادِي أَجَابَهُ هُوَ وَاضِعاً يَدَيْهِ رَافِعاً رَأْسَهُ إِلَى السَّمَاءِ يَقُولُ شَهِدَ اللَّهُ أَنَّهُ لا إِلهَ إِلَّا هُوَ وَ الْمَلائِكَةُ وَ أُولُوا الْعِلْمِ قائِماً بِالْقِسْطِ لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ",
          "قَالَ فَإِذَا قَالَ ذَلِكَ أَعْطَاهُ اللَّهُ الْعِلْمَ الْأَوَّلَ وَ الْعِلْمَ الْآخِرَ وَ اسْتَحَقَّ زِيَارَةَ الرُّوحِ فِي لَيْلَةِ الْقَدْرِ",
          "قُلْتُ جُعِلْتُ فِدَاكَ الرُّوحُ لَيْسَ هُوَ جَبْرَئِيلَ قَالَ الرُّوحُ هُوَ أَعْظَمُ مِنْ جَبْرَئِيلَ إِنَّ جَبْرَئِيلَ مِنَ الْمَلَائِكَةِ وَ إِنَّ الرُّوحَ هُوَ خَلْقٌ أَعْظَمُ مِنَ الْمَلَائِكَةِ أَ لَيْسَ يَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى تَنَزَّلُ الْمَلائِكَةُ وَ الرُّوحُ .",
          "مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنِ الْمُخْتَارِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ أَبِي بَصِيرٍ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abdullah Bin Is’haq Al Alawy, from Muhammad Bin Zayd Al Rizamy, from Muhammad Bin Suleyman Al Dalaymi, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘We performed Hajj along with Abu Abdullah<sup>asws</sup> during the year in which he<sup>asws</sup> was Blessed with his<sup>asws</sup> son<sup>asws</sup> Musa<sup>asws</sup>. So when we encamped at Abwa, the lunch was placed for us, and it was so that whenever the meal was placed for his<sup>asws</sup> companions, it would be abundant and pleasant.",
            "He (the narrator) said, ‘So while we were eating when a messenger of (Lady) Hameeda came over and he said to him<sup>asws</sup>, ‘(Lady) Hameeda is saying, ‘I have denied myself and have found what I found when it presented itself, and you<sup>asws</sup> had instructed me that I should not preceded you<sup>asws</sup> with this son<sup>asws</sup> of yours<sup>asws</sup>’. So Abu Abdullah<sup>asws</sup> arose and went along with the messenger. ",
            "So when he<sup>asws</sup> returned, his<sup>asws</sup> companions said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Make us to be sacrificed for you<sup>asws</sup>! So what did you<sup>asws</sup> do from (Lady) Hameeda?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> has Kept her safe and has Endowed a son unto me<sup>asws</sup>, and he<sup>asws</sup> is the best one whom Allah<sup>azwj</sup> Created among His<sup>azwj</sup> creatures, and Hameeda informed me<sup>asws</sup> about him<sup>asws</sup> with a matter, thinking that I<sup>asws</sup> do not know of it, and I<sup>asws</sup> was more knowing with it than her’. ",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! And what is that which (Lady) Hameeda informed you<sup>asws</sup> about?’ He<sup>asws</sup> said: She<sup>asws</sup> informed him<sup>asws</sup> about the baby’s actions as soon as his<sup>asws</sup> body touched the ground. The baby<sup>asws</sup> placed his<sup>asws</sup> hands on the ground and raised his<sup>asws</sup> head to the sky. So I<sup>asws</sup> informed her that, that was a gesture of Rasool-Allah<sup>saww</sup> and a gesture of the successor<sup>asws</sup> from after him<sup>saww</sup>’. ",
            "So I said, ‘May I be sacrificed for you<sup>asws</sup>! And what is this from a gesture of Rasool-Allah<sup>saww</sup> and a gesture of the successor<sup>asws</sup> from after him<sup>saww</sup>?’ So he<sup>asws</sup> said to me: ‘It is, whenever it was the night in which my<sup>asws</sup> grandfather<sup>asws</sup> was conceived, a comer came to the grandfather of my father with a cup in which was a drink finer than water, and softer than the butter, and sweeter than the honey, and colder than the ice, and whiter than the milk. So he quenched him<sup>asws</sup> with it and asked him<sup>asws</sup> to goto his<sup>asws</sup> wife. So he<sup>asws</sup> did that, and my<sup>asws</sup> grandfather<sup>asws</sup> was conceived. ",
            "And when it was the night in which my<sup>asws</sup> father<sup>asws</sup> was conceived, a comer came to my<sup>asws</sup> grandfather and quenched him<sup>asws</sup> just as he had quenched my<sup>asws</sup> father’s<sup>asws</sup> grandfather, and instructed him<sup>asws</sup> with the like of that which he had instructed him<sup>asws</sup> with. So he<sup>asws</sup> did that, and my<sup>asws</sup> father<sup>asws</sup> was conceived. ",
            "And when it was the night in which I<sup>asws</sup> was conceived, a comer came to my<sup>asws</sup> father<sup>asws</sup> and quenched him with what he had quenched them<sup>asws</sup>, and instructed him<sup>asws</sup> with that which he had instructed them<sup>asws</sup> with. So he<sup>asws</sup> did that and I<sup>asws</sup> was conceived. ",
            "And when it was the night in which my<sup>asws</sup> son<sup>asws</sup> was conceived, a comer came to me<sup>asws</sup> just as he had come to them<sup>asws</sup> and did with me<sup>asws</sup> just as he had done with them<sup>asws</sup>. So I<sup>asws</sup> stood with the Knowledge of Allah<sup>azwj</sup> and I<sup>asws</sup> was joyful with what Allah<sup>azwj</sup> had Endowed to me<sup>asws</sup>. So I<sup>asws</sup> went (near my wife) and my<sup>asws</sup> son<sup>asws</sup> was conceived. This new arrival, facing you all, so he<sup>asws</sup>, by Allah<sup>azwj</sup>, is your Master<sup>asws</sup> from after me<sup>asws</sup>. ",
            "And the seed of the Imam<sup>asws</sup>, is from what I<sup>asws</sup> am informing you, and when the seed settles in the womb for four months and the spirit is established therein, Allah<sup>azwj</sup> Blessed and High Sends an Angel call Haywaan. So it write upon his<sup>asws</sup> right upper arm: <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h115\">[6:115]</a> And the Word of your Lord has been accomplished truly and justly; there is none who can change His Words, and He is the Hearing, the Knowing</span>. ",
            "And as soon as he<sup>asws</sup> appears (and his<sup>asws</sup> body touched the ground) he<sup>asws</sup> places his<sup>asws</sup> hands on the floor and raises his<sup>asws</sup> head to the sky. Placing his hands on earth is an indication of his taking possession of all the knowledge of Allah<sup>azwj</sup> that is sent from the heavens to earth. So a Caller Calls him<sup>asws</sup> from the middle of the Throne, from the Lord<sup>azwj</sup> of Mighty, from the high horizons, by his<sup>asws</sup> name and the name of his<sup>asws</sup> father<sup>asws</sup>. ",
            "He (the Caller) is saying: “O so and so! Be affirmed, established, for a great matter have I<sup>azwj</sup> Created you<sup>asws</sup>! You<sup>asws</sup> are my elite from My<sup>azwj</sup> creatures, and the place of My<sup>azwj</sup> secrets, and repository of My<sup>azwj</sup> Knowledge, and My<sup>azwj</sup> Trustee upon My<sup>azwj</sup> Revelation, and My<sup>azwj</sup> Caliph in My<sup>azwj</sup> earth. For you<sup>asws</sup> and for the one who befriends you<sup>asws</sup>, I<sup>azwj</sup> Obligate My<sup>azwj</sup> Mercy, and Grant My<sup>azwj</sup> gardens, and Permit My<sup>azwj</sup> vicinity. Then, by My<sup>azwj</sup> Might and My<sup>azwj</sup> Majesty! The one who is inimical to you<sup>asws</sup>, I<sup>asws</sup> shall Inflict the most intense of My<sup>azwj</sup> Punishments, and even if I<sup>asws</sup> were to Expand upon him in My<sup>azwj</sup> world from the expansion of My<sup>azwj</sup> sustenance!”",
            "So when the voice terminates, the voice of the Caller, he<sup>asws</sup> answers Him<sup>azwj</sup> placing his<sup>asws</sup> hand, raising his<sup>asws</sup> hands towards the sky, saying: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:3#h18\">[3:18]</a> Allah bears witness that there is no god but He, and (so do) the Angels and those possessed of knowledge, Maintaining His creation with justice; there is no god but He, the Mighty, the Wise</span>’.",
            "He<sup>asws</sup> said: ‘So when he<sup>asws</sup> says that, Allah<sup>azwj</sup> Gives him<sup>asws</sup> the first knowledge and the last knowledge and the right of the visitation of the (Holy) Spirit during the Night of the Pre-determination (Laylat Al-Qadr)’. ",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! The Spirit, is he not Jibraeel<sup>as</sup>?’ He<sup>asws</sup> said: ‘The Spirit, he is greater than Jibraeel<sup>as</sup>. Jibraeel<sup>as</sup> is from the Angels, and the Spirit, he is a creature greater than the Angels. Isn’t Allah<sup>azwj</sup> Blessed and High Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h4\">[97:4]</a> Therein come down the angels and the Spirit</span>?’",
            "<span style=\"font-size: small\">Muhammad Bin Yahya, and Ahmad Bin Muhammad, from Muhammad Bin Al Husayn, from Ahmad Bin Al Hassan, from Al Mukhtar Bin Ziyad, from Muhammad Bin Suleyman, from his father, from Abu Baseer, </span>similar to it’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Muhammad has narrated from ‘Abdallah ibn Ishaq al-‘Alawi from Muhammad ibn Zayd al-Rizami from Muhammad ibn Sulayman al-Daylami from Ali ibn Hamza from abu Basir who has said the following. “Once we went for Hajj with abu ‘Abdallah (a.s.) in the year that his son Musa (a.s.) was born. When we arrived at al-Abwa lunch was served When he would serve food to his people he would serve good and plentiful food. At such time the messenger of Hamida, (his wife), came saying, “Hamida says, “I have almost lost my self and I have found what I was to find, I am about to give birth. You had commanded me not to do anything to this child without you.” Abu ‘Abdallah (a.s.) left with the messenger. When he came back his companions congratulated him and said, “May Allah take our souls in service for your cause, what did you do to Hamida?” He said, “Allah granted her good health and gifted me with a boy whom He has formed as the best in His creatures. Hamida informed me of a matter about him that she thought I did not know. I, however, knew it better than her.” I then asked him, May Allah take my soul in service for your cause, what was it that Hamida told you about the child?” He said that she informed him about the baby’s actions as soon as he fell on the ground. “The baby placed his hands on the ground and raised his head to the sky.” I explained to her that it was a sign like that of the Messenger of Allah and a sign of the executor of his will after him.” I then said, “May Allah take my soul in service for your cause, what sign is the sign of the Messenger of Allah and the sign of the executor of his will after him?” He said to me, “In the night that the mother of my grandfather conceived him someone came to my great grandfather with a drink finer than water, softer than butter, sweeter than honey, cooler than ice and whiter than milk. He was asked to drink it and then go to bed with his wife. He went to bed with his wife and she conceived with the baby. In the night that the mother of my father conceived him someone came to my grandfather with the same kind of drink as that brought to my great-grandfather. He was asked to drink it as my great-grandfather had done. He was commanded to do as my great grandfather had done. He then went to bed with his wife and she conceived with my father. In the night that my mother would conceive with me someone came to my father with the same kind of drink as that brought for my great-grandfather and grandfather and made him to drink as they had done and commanded him as he had commanded them before him. He then went to bed with his wife and my mother conceived with me. In the night that my wife was to conceive with my son someone came to me with the same kind of drink as that for my great grandfather, my grandfather and my father. He did to me as he done to them. I then went with the knowledge of Allah and with joy for what Allah had granted to me to bed with my wife and she conceived with the baby that is just born. The newborn is with you and he, by Allah, will be your companion after me. The seed of the Imam is from what I just explained to you. When the seed is accommodated in the womb for four months and the spirit is established therein Allah, the Most Holy, the Most High, then send an angel. This angel is called Haywan (animal or living). He then writes on his right shoulder “. .in all truth and justice, your Lord’s Word has been completed. No one can change His Words. He is All-hearing and All-knowing.”. <a href=\"/#/books/quran:6#h115\">[6:115]</a> When he comes out of his mothers womb he places his hands on the floor and raises his head to the sky. Placing his hands on earth is an indication of his taking possession of all the knowledge of Allah that is sent from the heavens to earth. Raising his head to the sky is that because a caller from inside the Throne calls him from the high horizon with his name and the name of his father. It is for (on behalf of) the Lord, the Most Majestic, the Most gracious, saying, “O so and so, son of so and so. Be firm so that you would be established. For the great purpose that I have created you, you are my chosen one in my creatures. You are the keeper of My secrets, the container of My knowledge, the trustee of My inspiration and My deputy and representative on earth. I have made it necessary for My blessings and mercy to reach you and those who would love you (and acknowledge your Divine Authority). I have gifted My paradise and given a place near Myself to you and to them. Also, by My Majesty and Grace, I will make your enemies to feel the heat of My punishment even though I may have given them expanded prosperity in My world such as prosperity in their livelihood. When the call of caller ends he responds to it by placing his hands on the ground and raising his head to the sky and says the following. “God Himself testifies that He is the only Lord. The angels and the men of knowledge and justice testify that God is the only Lord, the Majestic, and All-wise.” <a href=\"/#/books/quran:3#h18\">[3:18]</a> The Imam (a.s.) said, “When he says this, Allah grants him the knowledge of the fist and the knowledge of the last the qualification to be visited by the spirit in the nights of destiny.” I then said, may Allah take my soul in service for your cause, is the Spirit different from Jibril?” He said, “The Spirit is a creature greater than Jibril. Jibril is of the angels. The Spirit is a creature greater than the angels. Is it not true that Allah, the Most Holy, the Most High, has said, “On this Night, the angels and the Spirit descend .” .<a href=\"/#/books/quran:97#h4\">[97:4]</a> Muhammad ibn Yahya and Ahmad ibn Muhammad have narrated from Muhammad ibn al-Husayn from Ahmad ibn al-Hassan from al-Mukhtar ibn Ziyad from Muhammad ibn Sulayman from his father from abu Basir a similar hadith."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/263)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1001,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:93:2",
        "relations": {
          "Mentions": [
            "/books/quran:6:115"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُوسَى بْنِ سَعْدَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنِ الْحَسَنِ بْنِ رَاشِدٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى إِذَا أَحَبَّ أَنْ يَخْلُقَ الْإِمَامَ أَمَرَ مَلَكاً فَأَخَذَ شَرْبَةً مِنْ مَاءٍ تَحْتَ الْعَرْشِ فَيَسْقِيهَا أَبَاهُ فَمِنْ ذَلِكَ يَخْلُقُ الْإِمَامَ فَيَمْكُثُ أَرْبَعِينَ يَوْماً وَ لَيْلَةً فِي بَطْنِ أُمِّهِ لَا يَسْمَعُ الصَّوْتَ ثُمَّ يَسْمَعُ بَعْدَ ذَلِكَ الْكَلَامَ فَإِذَا وُلِدَ بَعَثَ ذَلِكَ الْمَلَكَ فَيَكْتُبُ بَيْنَ عَيْنَيْهِ وَ تَمَّتْ كَلِمَةُ رَبِّكَ صِدْقاً وَ عَدْلًا لا مُبَدِّلَ لِكَلِماتِهِ وَ هُوَ السَّمِيعُ الْعَلِيمُ ",
          "فَإِذَا مَضَى الْإِمَامُ الَّذِي كَانَ قَبْلَهُ رُفِعَ لِهَذَا مَنَارٌ مِنْ نُورٍ يَنْظُرُ بِهِ إِلَى أَعْمَالِ الْخَلَائِقِ فَبِهَذَا يَحْتَجُّ اللَّهُ عَلَى خَلْقِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Musa Bin Sa’dan, from Abdullah Bin Al Qasim, from Al Hassan Bin Rashid who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Blessed and High, when He<sup>azwj</sup> Loves to Create the Imam<sup>asws</sup>, Commands the Angel. So he takes a drink from the water beneath the Throne and quenches him<sup>asws</sup> with it. So, from that, the Imam<sup>asws</sup> is Created, and he<sup>asws</sup> remains for forty days and nights in the belly of his<sup>asws</sup> mother, not hearing the sounds. Then he<sup>asws</sup> hears the speech after that. So when the time comes (of his<sup>asws</sup> appearance), that Angel is Sent, so he write between his<sup>asws</sup> eyes <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h115\">[6:115]</a> And the Word of your Lord has been accomplished truly and justly; there is none who can change His Words, and He is the Hearing, the Knowing</span>.",
            "So when the Imam<sup>asws</sup> who was before him<sup>asws</sup> passes away, a beacon of light is raised for him<sup>asws</sup>. He<sup>asws</sup> can look by it to the deeds of the creatures. Thus, it is by this that Allah<sup>azwj</sup> would Argue against His<sup>azwj</sup> creatures’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from mmd ibn al-Husayn from Musa ibn Sa‘dan from ‘Abdallah ibn al-Qasim from al-Hassan ibn Rashid who has said the following. “I Heard abu ‘Abdallah (a.s.) say, ‘When Allah, the Most Holy, the Most High, would love to create the Imam He would command an angel to take a drink of water from under the Throne and his father to drink it and from this He creates the Imam. for the first forty days and nights in his mothers womb he would hear anything. After that he would hear the words. When he is born that angel comes and writes between his eyes, “. .in all truth and justice, your Lord’s Word has been completed. No one can change His Words. He is All-hearing and All-knowing.” <a href=\"/#/books/quran:6#h115\">[6:115]</a> When the preceding Imam passes away a light house made from light is prepared for him and this light house he examines the deeds of the creatures. By this means Allah establishes His authority over the creatures.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (263/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1002,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:93:3",
        "relations": {
          "Mentions": [
            "/books/quran:6:115"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ يُونُسَ بْنِ ظَبْيَانَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ إِذَا أَرَادَ أَنْ يَخْلُقَ الْإِمَامَ مِنَ الْإِمَامِ بَعَثَ مَلَكاً فَأَخَذَ شَرْبَةً مِنْ مَاءٍ تَحْتَ الْعَرْشِ ثُمَّ أَوْقَعَهَا أَوْ دَفَعَهَا إِلَى الْإِمَامِ فَشَرِبَهَا فَيَمْكُثُ فِي الرَّحِمِ أَرْبَعِينَ يَوْماً لَا يَسْمَعُ الْكَلَامَ ثُمَّ يَسْمَعُ الْكَلَامَ بَعْدَ ذَلِكَ فَإِذَا وَضَعَتْهُ أُمُّهُ بَعَثَ اللَّهُ إِلَيْهِ ذَلِكَ الْمَلَكَ الَّذِي أَخَذَ الشَّرْبَةَ فَكَتَبَ عَلَى عَضُدِهِ الْأَيْمَنِ وَ تَمَّتْ كَلِمَةُ رَبِّكَ صِدْقاً وَ عَدْلًا لا مُبَدِّلَ لِكَلِماتِهِ",
          "فَإِذَا قَامَ بِهَذَا الْأَمْرِ رَفَعَ اللَّهُ لَهُ فِي كُلِّ بَلْدَةٍ مَنَاراً يَنْظُرُ بِهِ إِلَى أَعْمَالِ الْعِبَادِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Mansour Bin Yunus, from Yunus Bin Zabyan who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic, whenever He<sup>azwj</sup> Intends to Create the Imam<sup>asws</sup> from the Imams<sup>asws</sup>, Sends an Angel. So he takes a drink from the water beneath the Throne, then casts it, or hands it over to the Imam<sup>asws</sup>. So he<sup>asws</sup> drinks it, and he<sup>asws</sup> stays in the womb for forty days, not hearing the speech. Then he<sup>asws</sup> hears the speech after that. So when his<sup>asws</sup> mother places him<sup>asws</sup>, Allah<sup>azwj</sup> Sends that Angel to him, the one who took the drink, and he writes upon his right arm: <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h115\">[6:115]</a> And the Word of your Lord has been accomplished truly and justly; there is none who can change His Words</span>’. ",
            "So when he<sup>asws</sup> does stand with this command, Allah<sup>azwj</sup> Raises for him<sup>asws</sup> a beacon in every city. He<sup>asws</sup> can look with this to the deeds of the servants’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Hadidfrom Mansur ibn Yunus from Yunus ibn Zabyan who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘When Allah, the Most Majestic, the Most gracious, decides to create the Imam from another Imam He sends an angel with a drink of water from under the Throne. Then the angel would make the Imam to drink it and would give it to him to drink. For the first forty days he would not hear any words and thereafter he would hear words. When his mogthor would give birth Aallah would send the same angel who had brought the water. The angels would on his right should, “. .in all truth and justice, your Lord’s Word has been completed. No one can change His Words. He is All-hearing and All-knowing.”. <a href=\"/#/books/quran:6#h115\">[6:115]</a> When he would rise to execute the task of an Imam Allah would raise a light house for him in every town through which he would examine the deeds of the servants of Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/264)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1003,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:93:4",
        "relations": {
          "Mentions": [
            "/books/quran:6:115"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الرَّبِيعِ بْنِ مُحَمَّدٍ الْمُسْلِيِّ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الْإِمَامَ لَيَسْمَعُ فِي بَطْنِ أُمِّهِ فَإِذَا وُلِدَ خُطَّ بَيْنَ كَتِفَيْهِ وَ تَمَّتْ كَلِمَةُ رَبِّكَ صِدْقاً وَ عَدْلًا لا مُبَدِّلَ لِكَلِماتِهِ وَ هُوَ السَّمِيعُ الْعَلِيمُ ",
          "فَإِذَا صَارَ الْأَمْرُ إِلَيْهِ جَعَلَ اللَّهُ لَهُ عَمُوداً مِنْ نُورٍ يُبْصِرُ بِهِ مَا يَعْمَلُ أَهْلُ كُلِّ بَلْدَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al Rabie Bin Muhammad Al Musly, from Muhammad Bin Marwan who said, ",
            "‘I heard Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> saying: ‘The Imam<sup style=\"font-weight: normal\">asws</sup> hears in the belly of his<sup style=\"font-weight: normal\">asws</sup> mother. So when he<sup style=\"font-weight: normal\">asws</sup> comes (to the world), it is inscribed between his<sup style=\"font-weight: normal\">asws</sup> shoulders <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h115\">[6:115]</a> And the Word of your Lord has been accomplished truly and justly; there is none who can change His Words, and He is the Hearing, the Knowing</span><span class=\"bTxt\">. </span>",
            "So when the command comes to him<sup>asws</sup>, Allah<sup>azwj</sup> Makes a pillar of light to be for him<sup>asws</sup>. He<sup>asws</sup> visualizes with it what is being done by the inhabitants of every city’."
          ],
          "en.sarwar": [
            " 4. A number of our people has narrated Ahmad ibn Muhammad from ibn Mahbub from al-Rabi‘ ibn Muhammad al-Musalli from Muhammad ibn Marwan who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘The Imam hears in the womb of his mother and when he is born these words of Allah will be written between his shoulders, “. .in all truth and justice, your Lord’s Word has been completed. No one can change His Words. He is All-hearing and All-knowing.”. <a href=\"/#/books/quran:6#h115\">[6:115]</a> When the matter (Leadership with Divine Authority) is delivered to him Allah establishes a pillar of light for him through which he can see the deeds of the people of every town.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/265)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1004,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:93:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ مَسْعُودٍ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ الْجَعْفَرِيِّ قَالَ سَمِعْتُ إِسْحَاقَ بْنَ جَعْفَرٍ يَقُولُ سَمِعْتُ أَبِي يَقُولُ الْأَوْصِيَاءُ إِذَا حَمَلَتْ بِهِمْ أُمَّهَاتُهُمْ أَصَابَهَا فَتْرَةٌ شِبْهُ الْغَشْيَةِ فَأَقَامَتْ فِي ذَلِكَ يَوْمَهَا ذَلِكَ إِنْ كَانَ نَهَاراً أَوْ لَيْلَتَهَا إِنْ كَانَ لَيْلًا ثُمَّ تَرَى فِي مَنَامِهَا رَجُلًا يُبَشِّرُهَا بِغُلَامٍ عَلِيمٍ حَلِيمٍ فَتَفْرَحُ لِذَلِكَ ",
          "تَنْتَبِهُ مِنْ نَوْمِهَا فَتَسْمَعُ مِنْ جَانِبِهَا الْأَيْمَنِ فِي جَانِبِ الْبَيْتِ صَوْتاً يَقُولُ حَمَلْتِ بِخَيْرٍ وَ تَصِيرِينَ إِلَى خَيْرٍ وَ جِئْتِ بِخَيْرٍ أَبْشِرِي بِغُلَامٍ حَلِيمٍ عَلِيمٍ وَ تَجِدُ خِفَّةً فِي بَدَنِهَا ثُمَّ لَمْ تَجِدْ بَعْدَ ذَلِكَ امْتِنَاعاً مِنْ جَنْبَيْهَا وَ بَطْنِهَا فَإِذَا كَانَ لِتِسْعٍ مِنْ شَهْرِهَا سَمِعَتْ فِي الْبَيْتِ حِسّاً شَدِيداً فَإِذَا كَانَتِ اللَّيْلَةُ الَّتِي تَلِدُ فِيهَا ظَهَرَ لَهَا فِي الْبَيْتِ نُورٌ تَرَاهُ لَا يَرَاهُ غَيْرُهَا إِلَّا أَبُوهُ",
          "ثُمَّ فَإِذَا وَلَدَتْهُ وَلَدَتْهُ قَاعِداً وَ تَفَتَّحَتْ لَهُ حَتَّى يَخْرُجَ مُتَرَبِّعاً يَسْتَدِيرُ بَعْدَ وُقُوعِهِ إِلَى الْأَرْضِ فَلَا يُخْطِئُ الْقِبْلَةَ حَيْثُ كَانَتْ بِوَجْهِهِ ثُمَّ يَعْطِسُ ثَلَاثاً يُشِيرُ بِإِصْبَعِهِ بِالتَّحْمِيدِ وَ يَقَعُ مَسْرُوراً مَخْتُوناً وَ رَبَاعِيَتَاهُ مِنْ فَوْقٍ وَ أَسْفَلَ وَ نَابَاهُ وَ ضَاحِكَاهُ وَ مِنْ بَيْنِ يَدَيْهِ مِثْلُ سَبِيكَةِ الذَّهَبِ نُورٌ وَ يُقِيمُ يَوْمَهُ وَ لَيْلَتَهُ تَسِيلُ يَدَاهُ ذَهَباً وَ كَذَلِكَ الْأَنْبِيَاءُ إِذَا وُلِدُوا وَ إِنَّمَا الْأَوْصِيَاءُ أَعْلَاقٌ مِنَ الْأَنْبِيَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah, from Ibn Masoud, from Abdullah Bin Ibrahim Al Ja’fary who said, ",
            "‘I heard Is’haq son of Ja’far<sup>asws</sup> saying: ‘I<sup>asws</sup> heard my<sup>asws</sup> father<sup>asws</sup> saying: ‘The successors<sup>asws</sup> are such that when their<sup>asws</sup> mothers bear them, she would be hit by a phase resembling a fainting. So she would stay in that for her day, if it was during the day, or her night if it was during the night. Then she would see a man in her dream giving her glad tidings of a boy, knowledgeable, forbearing. So she would be happy due to that. ",
            "Then she wakes up from her sleep, and she would hear a voice from her right side in the side of the house saying: ‘You bore with goodness, and you have come to be with goodness, and have come with goodness. Receive glad tidings of a boy, forbearing, knowledgeable!’ And she finds lightness in her body, then she does not find any difficulty from her sides and her belly. So when she would be in her ninth month, she hears an intense hissing in the house. So when it is the night in which she would be Blessed (with a boy), a light appears to her in the house. She sees it and others do not see it except for his<sup>asws</sup> father<sup>asws</sup>. ",
            "Then, when he<sup>asws</sup> comes to the (world), he<sup>asws</sup> is in the seated (state), and after his<sup>asws</sup> falling to the ground. So he<sup>asws</sup> does not miss the Qiblah by his<sup>asws</sup> face wherever he<sup>asws</sup> might be facing. Then he<sup>asws</sup> sneezes three (times), gesturing by his fingers with the Praise, and his<sup>asws</sup> (unbilical cord), being cut, being circumcised, and (with) his four upper teeth and lower teeth, and his<sup>asws</sup> canines and his<sup>asws</sup> bi-cuspids. And in front of him<sup>asws</sup> would be like a shining light of gold, and he<sup>asws</sup> would remain for his<sup>asws</sup> day and his<sup>asws</sup> night, with golden light flowing from his hands. And like that are the Prophets<sup>as</sup> when they<sup>as</sup> are born, and rather, the successors<sup>as</sup> are an attachment from the Prophets<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 5. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad ibn ‘Abdallah from ibn Mas‘ud from ‘Abdallah ibn Ibrahim al-Ja‘fari who has said the following. “I heard Ishaq ibn Ja‘far say that he heard his father say as herein below. “When the mothers of the executors of the will conceive them she will go through a condition as if she has fainted for the rest of day if it would take place during the day or for the rest of the night if it would take place at night. She then would see in her dream a man congratulating her with the birth of a son, very knowledgeable and very forbearing. The condition then goes away annnd she wakes up and from her right side in the house she hears a voice. It says, “You have conceived with good, you are changing into good and you have come up with good. Congratulations to you for a son who is very forbearing and very knowledgeable. She then would feel light and thereafter she would feel no discomfort from her sides or from her belly. After nine months she would hear (something) intensely in the house On the night of the birth of the child a light would appear to her in the house that only she and the father of the child can see. When the child would born he would be found in a sitting position. There would be enough opening for the child to come out with both thighs and legs folded. The child would turn on the ground so as not to miss facing the direction of Makka. He will sneeze three time and would point with his fingers for the words of blessings said up on sneezing. He would be born his umbilical cord already cut off and circumcised. Both of his Ruba‘ia (molar) teeth from the upper and lower jaws, both of his (Na‘b) canine teeth and both of his Dahika (bicuspids) would have already grown. In front of him there would a light shine like flowing gold. For the next day and night a golden light would flow from his hands. This is how the prophets are when they are born. The executors of their will are the only ones who are the attachments of the prophets.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (267/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1005,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:93:6",
        "relations": {
          "Mentions": [
            "/books/quran:6:115"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ قَالَ رَوَى غَيْرُ وَاحِدٍ مِنْ أَصْحَابِنَا أَنَّهُ قَالَ لَا تَتَكَلَّمُوا فِي الْإِمَامِ فَإِنَّ الْإِمَامَ يَسْمَعُ الْكَلَامَ وَ هُوَ فِي بَطْنِ أُمِّهِ فَإِذَا وَضَعَتْهُ كَتَبَ الْمَلَكُ بَيْنَ عَيْنَيْهِ وَ تَمَّتْ كَلِمَةُ رَبِّكَ صِدْقاً وَ عَدْلًا لا مُبَدِّلَ لِكَلِماتِهِ وَ هُوَ السَّمِيعُ الْعَلِيمُ فَإِذَا قَامَ بِالْأَمْرِ رُفِعَ لَهُ فِي كُلِّ بَلْدَةٍ مَنَارٌ يَنْظُرُ مِنْهُ إِلَى أَعْمَالِ الْعِبَادِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Jameel Bin Darraj who said, ",
            "‘More than one of our companions reported that he<sup>asws</sup> said: ‘Do not be speaking regarding the Imam<sup>asws</sup>, for the Imam<sup>asws</sup> hears the speech while he<sup>asws</sup> is in the belly of his<sup>asws</sup> mother. So when she places him<sup>asws</sup>, the Angel writes between his<sup>asws</sup> eyes: <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h115\">[6:115]</a> And the Word of your Lord has been accomplished truly and justly; there is none who can change His Words, and He is the Hearing, the Knowing</span>. So when he<sup>asws</sup> does stand with the command, a beacon is raised for him<sup>asws</sup> in every city. He<sup>asws</sup> looks from it to the deeds of the servants’."
          ],
          "en.sarwar": [
            " 6. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn Hadid from Jamil ibn Darraj who has said the following. “Several persons of our people have narrated that The Imam (a.s.) has said, “Do not speak about the Imam. The Imam (a.s.) hears the words while he still is in the womb of his mother. When she would give birth the angel write between his eyes, “. .in all truth and justice, your Lord’s Word has been completed. No one can change His Words. He is All-hearing and All-knowing.”. <a href=\"/#/books/quran:6#h115\">[6:115]</a> When takes charge of the matter (Leadership with Divine Authority) in every a light house will be established for him through which he would examine the deeds of the servants (of Allah).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/268)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1006,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:93:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ قَالَ كُنْتُ أَنَا وَ ابْنُ فَضَّالٍ جُلُوساً إِذْ أَقْبَلَ يُونُسُ فَقَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ قَدْ أَكْثَرَ النَّاسُ فِي الْعَمُودِ قَالَ فَقَالَ لِي يَا يُونُسُ مَا تَرَاهُ أَ تَرَاهُ عَمُوداً مِنْ حَدِيدٍ يُرْفَعُ لِصَاحِبِكَ قَالَ قُلْتُ مَا أَدْرِي قَالَ لَكِنَّهُ مَلَكٌ مُوَكَّلٌ بِكُلِّ بَلْدَةٍ يَرْفَعُ اللَّهُ بِهِ أَعْمَالَ تِلْكَ الْبَلْدَةِ ",
          "قَالَ فَقَامَ ابْنُ فَضَّالٍ فَقَبَّلَ رَأْسَهُ وَ قَالَ رَحِمَكَ اللَّهُ يَا أَبَا مُحَمَّدٍ لَا تَزَالُ تَجِي‏ءُ بِالْحَدِيثِ الْحَقِّ الَّذِي يُفَرِّجُ اللَّهُ بِهِ عَنَّا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd who said, ‘It was so that I and Ibn Fazzal were seated when Yunus came over and he said, ",
            "‘I went over to Abu Al-Hassan Al-Reza<sup>asws</sup> and I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The people are frequently (speaking) regarding the pillar (of light)’. So he<sup>asws</sup> said to me: ‘O Yunus! What do you see it as? Do you see it as a pillar of iron raised for your companions?’ I said, ‘I do not know’. He<sup>asws</sup> said: ‘But, it is an Angel allocated with every city. Allah<sup>azwj</sup> Raises the deeds of that city with him’. ",
            "He (the narrator) said, ‘So Ibn Fazzal stood up and kissed his head and said, ‘May Allah<sup>azwj</sup> have Mercy on you, O Abu Muhammad<sup>asws</sup>! You<sup>asws</sup> do not cease to come with the true Hadeeth by which Allah<sup>azwj</sup> Relieves from us’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd who has said the following. “I and ibn Faddal were sitting tha Yunus came and said, ‘I went to see abu al-Hassan al-Rida (a.s.) and said to him, “May Allah take my soul in service for your cause, “People speak so much about pillar.” He said to me, “O Yunus, what do you see? Do you see it as a pillar of iron that you would raise for your friend?” The narrator has said that he said, “I do not know.” The Imam (a.s.) said, “In fact, it is an appointed angel in every town. Through him Allah raises the deeds of that town.” The narrator has said that ibn Faddal then stood up and kissed his head and said, “May allah grant you blessings, O abu Muhammad, you continue to bring us true hadith with which Allah grants us relief and comfort.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/268)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1007,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:93:8",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لِلْإِمَامِ عَشْرُ عَلَامَاتٍ يُولَدُ مُطَهَّراً مَخْتُوناً وَ إِذَا وَقَعَ عَلَى الْأَرْضِ وَقَعَ عَلَى رَاحَتِهِ رَافِعاً صَوْتَهُ بِالشَّهَادَتَيْنِ وَ لَا يُجْنِبُ وَ تَنَامُ عَيْنَاهُ وَ لَا يَنَامُ قَلْبُهُ وَ لَا يَتَثَاءَبُ وَ لَا يَتَمَطَّى وَ يَرَى مِنْ خَلْفِهِ كَمَا يَرَى مِنْ أَمَامِهِ وَ نَجْوُهُ كَرَائِحَةِ الْمِسْكِ وَ الْأَرْضُ مُوَكَّلَةٌ بِسَتْرِهِ وَ ابْتِلَاعِهِ وَ إِذَا لَبِسَ دِرْعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) كَانَتْ عَلَيْهِ وَفْقاً وَ إِذَا لَبِسَهَا غَيْرُهُ مِنَ النَّاسِ طَوِيلِهِمْ وَ قَصِيرِهِمْ زَادَتْ عَلَيْهِ شِبْراً وَ هُوَ مُحَدَّثٌ إِلَى أَنْ تَنْقَضِيَ أَيَّامُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from one of our companions, from Ibn Abu Umeyr, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘For the Imam<sup>asws</sup> there are ten signs – He<sup>asws</sup> would be Blessed clean; circumcised; and when he<sup>asws</sup> falls upon the ground, would fall upon his<sup>asws</sup> palms, raising his<sup>asws</sup> voice with the two testimonies; and he<sup>asws</sup> would not be with impurity; and his<sup>asws</sup> eyes would sleep but his<sup>asws</sup> heart would not sleep; and he<sup>asws</sup> neither yawns nor stretch (his<sup>asws</sup> limbs; and he<sup>asws</sup> sees from his<sup>asws</sup> behind just as he<sup>asws</sup> sees from his<sup>asws</sup> front; and his<sup>asws</sup> secretion (sweat, etc.) is the aroma of musk and the earth has been allocated with devouring it by concealing it and swallowing it; and when he<sup>asws</sup> wears the armour of Rasool-Allah<sup>saww</sup>, it would be upon him<sup>asws</sup> harmoniously (fit exactly), and when others from the people wear it, it would be either too long with them or too short with them, increasing upon them by a palm’s width; and he<sup>asws</sup> would be a <span class=\"iTxt\">Muhaddath</span> (the one whom the Angels discuss with), until the expiry of his<sup>asws</sup> days’."
          ],
          "en.sarwar": [
            " 8. Ali ibn Muhammad has narrated from some of our people from ibn abu ‘umayr from Hariz from Zurara from abu Ja‘far (a.s.) who has said the following. “Imam has ten signs. He is born clean and circumcised. When falls on the earth his palms reach the ground first while he raises his head to the sky and loudly says the two testimonies. He does not experience wit dream. His eyes sleep but not his heart. He does not yawn and stretCh He sees behind just as he sees in front. His excretion would smell like musk. The earth is made to conceal and devour it. When he would dress up with coat of arms of the Messenger of Allah it would perfectly fit him. However, when other people, taller or shorter would try it would be taller on them by a hand stretch of thump and pinkeye. He is a Muhaddath (the one spoken to by angels) up to the time of his passing away.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:93",
  "kind": "verse_list"
}