{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 95"}, "path": "/books/al-kafi:1:4:95", "titles": {"ar": "باب التَّسْلِيمِ وَ فَضْلِ الْمُسَلِّمِينَ", "en": "Chapter 95 – The The submission and the merits of the submitters"}}], "index": 153, "local_index": 95, "part_type": "Chapter", "path": "/books/al-kafi:1:4:95", "titles": {"ar": "باب التَّسْلِيمِ وَ فَضْلِ الْمُسَلِّمِينَ", "en": "Chapter 95 – The The submission and the merits of the submitters"}, "verse_count": 8, "verse_start_index": 1011, "verses": [{"index": 1012, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:95:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ سَدِيرٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) إِنِّي تَرَكْتُ مَوَالِيَكَ مُخْتَلِفِينَ يَتَبَرَّأُ بَعْضُهُمْ مِنْ بَعْضٍ قَالَ فَقَالَ وَ مَا أَنْتَ وَ ذَاكَ إِنَّمَا كُلِّفَ النَّاسُ ثَلَاثَةً مَعْرِفَةَ الْأَئِمَّةِ وَ التَّسْلِيمَ لَهُمْ فِيمَا وَرَدَ عَلَيْهِمْ وَ الرَّدَّ إِلَيْهِمْ فِيمَا اخْتَلَفُوا فِيهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Sinan, from Ibn Muskan, from Sadeyr who said, \n‘I said to Abu Ja’far<sup>asws</sup>, ‘I left the ones in your<sup>asws</sup> Wilayah differing, some of them disavowing from the others’. So he<sup>asws</sup> said: ‘And what have you to do with that? But rather, the people have been encumbered with three (matters) – recognising the Imams<sup>asws</sup>, and the submission to them<sup>asws</sup> with regards to whatever is referred to them, and the referring to them<sup>asws</sup> in whatever they are differing in’."}]}, {"index": 1013, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:95:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَبْدِ اللَّهِ الْكَاهِلِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَوْ أَنَّ قَوْماً عَبَدُوا اللَّهَ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَقَامُوا الصَّلَاةَ وَ آتَوُا الزَّكَاةَ وَ حَجُّوا الْبَيْتَ وَ صَامُوا شَهْرَ رَمَضَانَ ثُمَّ قَالُوا لِشَيْ‏ءٍ صَنَعَهُ اللَّهُ أَوْ صَنَعَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَلَّا صَنَعَ خِلَافَ الَّذِي صَنَعَ أَوْ وَجَدُوا ذَلِكَ فِي قُلُوبِهِمْ لَكَانُوا بِذَلِكَ مُشْرِكِينَ \nثُمَّ تَلَا هَذِهِ الْآيَةَ فَلا وَ رَبِّكَ لا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيما شَجَرَ بَيْنَهُمْ ثُمَّ لا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجاً مِمَّا قَضَيْتَ وَ يُسَلِّمُوا تَسْلِيماً ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَلَيْكُمْ بِالتَّسْلِيمِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammad Bin Usman, from Abdullah Al Kahily who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘If a people were to worship Allah<sup>azwj</sup> as One, there being no associates for Him<sup>azwj</sup>, and establish the Salat, and give the Zakat, and perform the Hajj of the House (Kabah), and Fast the Month of Ramazan, they then say for something which Allah<sup>azwj</sup> has Done or Rasool-Allah<sup>saww</sup> has done, ‘Why did they not do differently to what they did?’, or find that to be in their hearts, they would happen to be Polytheists due to that’. \nThen he<sup>asws</sup> recites this Verse <span class=\"ibTxt\">[4:65] But no! By your Lord! They do not believe (in reality) until they make you a judge of that which has become a matter of disagreement among them, and then do not find any straitness in their hearts as to what you have decided and submit with entire submission</span>. Then, Abu Abdullah<sup>asws</sup> said: ‘It is upon you with the submission’."}]}, {"index": 1014, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:95:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ زَيْدٍ الشَّحَّامِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنَّ عِنْدَنَا رَجُلًا يُقَالُ لَهُ كُلَيْبٌ فَلَا يَجِي‏ءُ عَنْكُمْ شَيْ‏ءٌ إِلَّا قَالَ أَنَا أُسَلِّمُ فَسَمَّيْنَاهُ كُلَيْبَ تَسْلِيمٍ قَالَ فَتَرَحَّمَ عَلَيْهِ ثُمَّ قَالَ أَ تَدْرُونَ مَا التَّسْلِيمُ فَسَكَتْنَا فَقَالَ هُوَ وَ اللَّهِ الْإِخْبَاتُ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ آمَنُوا وَ عَمِلُوا الصَّالِحاتِ وَ أَخْبَتُوا إِلى رَبِّهِمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Hammad Bin Isa, from Al Husayn Bin Al Mukhtar, from Zayd Al Shahham, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Among us there is a man called Kuleyb. So there does not come anything from you<sup>asws</sup> except that he says, ‘I submit’. So we named him as ‘Kuleyb the submitter’. So (the Imam<sup>asws</sup>) paid tribute to him, then said: ‘Do you know what the submission is?’ So we were silent. So he<sup>asws</sup> said: ‘It, by Allah<sup>azwj</sup>, is the humbleness in the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[11:23] Surely, the ones who believe and do righteous deeds and humble themselves to their Lord</span>’."}]}, {"index": 1015, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:95:4", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ مَنْ يَقْتَرِفْ حَسَنَةً نَزِدْ لَهُ فِيها حُسْناً قَالَ الِاقْتِرَافُ التَّسْلِيمُ لَنَا وَ الصِّدْقُ عَلَيْنَا وَ أَلَّا يَكْذِبَ عَلَيْنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa, from Aban, from Muhammad Bin Muslim, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\">[42:23] and whoever earns good, We Give him more of good therein</span>. He<sup>asws</sup> said: ‘The earning, is the submission to us<sup>asws</sup>, and the truthfulness upon us<sup>asws</sup>, and that he would not be lying upon us<sup>asws</sup>’."}]}, {"index": 1016, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:95:5", "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ بَشِيرٍ الدَّهَّانِ عَنْ كَامِلٍ التَّمَّارِ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) قَدْ أَفْلَحَ الْمُؤْمِنُونَ أَ تَدْرِي مَنْ هُمْ قُلْتُ أَنْتَ أَعْلَمُ قَالَ قَدْ أَفْلَحَ الْمُؤْمِنُونَ الْمُسَلِّمُونَ إِنَّ الْمُسَلِّمِينَ هُمُ النُّجَبَاءُ فَالْمُؤْمِنُ غَرِيبٌ فَطُوبَى لِلْغُرَبَاءِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad Bin Abdullah, from Ahmad Bin Muhammad Al Barqy, from his father, from Muhammad Bin Abdul Hameed, from Mansour Bin Yunus, from Bashir Al Dahhan, from Kamil Al Tammar who said, \n‘Abu Ja’far<sup>asws</sup> said: ‘<span class=\"ibTxt\">[23:1] Successful indeed are the Believers</span>. ‘Abu Ja’far<sup>asws</sup> said: ‘<span class=\"ibTxt\">[23:1] Successful indeed are the Believers</span>. Do you know who they are?’ I said, ‘You<sup>asws</sup> are more knowing’. He<sup>asws</sup> said: ‘Successful indeed are the <span class=\"iTxt\">Momineen</span> - the submitters. Surely, the submitters are the excellent ones, but a <span class=\"iTxt\">Momin</span> is a ‘غَرِيبٌ’ stranger/foreigner (wherever he lives) and foreigners are successful (in the Hereafter)’."}]}, {"index": 1017, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:95:6", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنِ الْخَشَّابِ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ رَبِيعٍ الْمُسْلِيِّ عَنْ يَحْيَى بْنِ زَكَرِيَّا الْأَنْصَارِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ مَنْ سَرَّهُ أَنْ يَسْتَكْمِلَ الْإِيمَانَ كُلَّهُ فَلْيَقُلِ الْقَوْلُ مِنِّي فِي جَمِيعِ الْأَشْيَاءِ قَوْلُ آلِ مُحَمَّدٍ فِيمَا أَسَرُّوا وَ مَا أَعْلَنُوا وَ فِيمَا بَلَغَنِي عَنْهُمْ وَ فِيمَا لَمْ يَبْلُغْنِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from one of our companions, from Al Khashab, from Al Abbas Bin Aamir, from Rabie Al Musly, from Yahya Bin Zakariyya Al Ansary, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, (the narrator says) ‘I heard him<sup>asws</sup> saying: ‘The one who wants that his <span class=\"iTxt\">Eman to </span>be completed, so let him say, ‘The words from me in the entirety of the matters are the words of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> regarding whatever was kept secretive and whatever was announced, and regarding whatever reached me from them<sup>asws</sup> and regarding whatever did not reach me’."}]}, {"index": 1018, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:95:7", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ أَوْ بُرَيْدٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ لَقَدْ خَاطَبَ اللَّهُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فِي كِتَابِهِ قَالَ قُلْتُ فِي أَيِّ مَوْضِعٍ قَالَ فِي قَوْلِهِ وَ لَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ فَاسْتَغْفَرُوا اللَّهَ وَ اسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللَّهَ تَوَّاباً رَحِيماً. فَلا وَ رَبِّكَ لا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيما شَجَرَ بَيْنَهُمْ فِيمَا تَعَاقَدُوا عَلَيْهِ لَئِنْ أَمَاتَ اللَّهُ مُحَمَّداً أَلَّا يَرُدُّوا هَذَا الْأَمْرَ فِي بَنِي هَاشِمٍ ثُمَّ لا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجاً مِمَّا قَضَيْتَ عَلَيْهِمْ مِنَ الْقَتْلِ أَوِ الْعَفْوِ وَ يُسَلِّمُوا تَسْلِيماً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Zurara or Bureyd, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> has Addressed Amir Al-Momineen<sup>asws</sup> in His<sup>azwj</sup> Book’. I said, ‘In which place?’ He<sup>asws</sup> said: ‘In His<sup>azwj</sup> Words <span class=\"ibTxt\">[4:64] and had they, when they were unjust to themselves, come to you and asked Forgiveness from Allah and the Rasool had (also) asked Forgiveness for them, they would have found Allah Oft-returning (to Mercy), Merciful</span>. <span class=\"ibTxt\">[4:65] But no! By your Lord! They do not believe (in reality) until they make you a judge of that which has become a matter of disagreement among them, and then do not find any straitness in their hearts as to what you have decided and submit with entire submission</span>’."}]}, {"index": 1019, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:95:8", "text": "أَحْمَدُ بْنُ مِهْرَانَ رَحِمَهُ اللَّهُ عَنْ عَبْدِ الْعَظِيمِ الْحَسَنِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنِ الْحَكَمِ بْنِ أَيْمَنَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ إِلَى آخِرِ الْآيَةِ قَالَ هُمُ الْمُسَلِّمُونَ لآِلِ مُحَمَّدٍ الَّذِينَ إِذَا سَمِعُوا الْحَدِيثَ لَمْ يَزِيدُوا فِيهِ وَ لَمْ يَنْقُصُوا مِنْهُ جَاءُوا بِهِ كَمَا سَمِعُوهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Mihran, from Abdul Azeem Al Hassany, from Ali Bin Asbat, from Ali Bin Uqba, from Al Hakam Bin Ayman, from Abu Baseer whom said, \n‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[39:18] Those who listen intently to the Word, then follow the best of it</span> – up to the end of the Verse. He<sup>asws</sup> said: ‘They are the submitters to the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, those who, when they hear the Hadeeth, they neither increase in it nor do they reduce from it. They come with it just as they had heard it’."}]}]}, "index": "al-kafi:1:4:95", "kind": "verse_list"}