{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 96"
        },
        "path": "/books/al-kafi:1:4:96",
        "titles": {
          "ar": "باب أَنَّ الْوَاجِبَ عَلَى النَّاسِ بَعْدَ مَا يَقْضُونَ مَنَاسِكَهُمْ أَنْ يَأْتُوا الْإِمَامَ فَيَسْأَلُونَهُ عَنْ مَعَالِمِ دِينِهِمْ وَ يُعْلِمُونَهُمْ وَلَايَتَهُمْ وَ مَوَدَّتَهُمْ لَهُ",
          "en": "Chapter 96 – The Obligation upon the people, after having fulfilled their rituals (of Hajj), that they should come to the Imam<sup>asws</sup>, so they should be asking him<sup>asws</sup> about the information about their Religion, and they should be letting him<sup>asws</sup> know of their Wilayah and their cordiality for him<sup>asws</sup>"
        }
      }
    ],
    "index": 154,
    "local_index": 96,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 97"
        },
        "path": "/books/al-kafi:1:4:97",
        "titles": {
          "ar": "باب أَنَّ الْأَئِمَّةَ تَدْخُلُ الْمَلَائِكَةُ بُيُوتَهُمْ وَ تَطَأُ بُسُطَهُمْ وَ تَأْتِيهِمْ بِالْأَخْبَارِ ( عليهم السلام )",
          "en": "Chapter 97 – The Imams<sup>asws</sup> are such that the Angels come over to them and tread their furnishings and come to them<sup>asws</sup> with the news"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 95"
        },
        "path": "/books/al-kafi:1:4:95",
        "titles": {
          "ar": "باب التَّسْلِيمِ وَ فَضْلِ الْمُسَلِّمِينَ",
          "en": "Chapter 95 – The The submission and the merits of the submitters"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:96",
    "titles": {
      "ar": "باب أَنَّ الْوَاجِبَ عَلَى النَّاسِ بَعْدَ مَا يَقْضُونَ مَنَاسِكَهُمْ أَنْ يَأْتُوا الْإِمَامَ فَيَسْأَلُونَهُ عَنْ مَعَالِمِ دِينِهِمْ وَ يُعْلِمُونَهُمْ وَلَايَتَهُمْ وَ مَوَدَّتَهُمْ لَهُ",
      "en": "Chapter 96 – The Obligation upon the people, after having fulfilled their rituals (of Hajj), that they should come to the Imam<sup>asws</sup>, so they should be asking him<sup>asws</sup> about the information about their Religion, and they should be letting him<sup>asws</sup> know of their Wilayah and their cordiality for him<sup>asws</sup>"
    },
    "verse_count": 3,
    "verse_start_index": 1019,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/285)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/47)"
        ],
        "index": 1020,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:96:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنِ الْفُضَيْلِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ نَظَرَ إِلَى النَّاسِ يَطُوفُونَ حَوْلَ الْكَعْبَةِ فَقَالَ هَكَذَا كَانُوا يَطُوفُونَ فِي الْجَاهِلِيَّةِ إِنَّمَا أُمِرُوا أَنْ يَطُوفُوا بِهَا ثُمَّ يَنْفِرُوا إِلَيْنَا فَيُعْلِمُونَا وَلَايَتَهُمْ وَ مَوَدَّتَهُمْ وَ يَعْرِضُوا عَلَيْنَا نُصْرَتَهُمْ ثُمَّ قَرَأَ هَذِهِ الْآيَةَ فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Al Fuzayl, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘He<sup>asws</sup> looked at the people performing <span class=\"iTxt\">Tawaaf</span> around the Kabah, so he<sup>asws</sup> said: ‘This is how they used to circle around during the Pre-Islamic period. But rather, they have been Commanded that they should circle with it, then they should hasten towards us<sup>asws</sup> so they should let us<sup>asws</sup> know of their Wilayah and their cordiality, and they should present their help for us<sup>asws</sup>’. Then he<sup>asws</sup> recited this Verse <span class=\"ibTxt\">[14:37] therefore make the hearts of some people yearn towards them</span>’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ’Udhayna from Fudayl who has said the following. “abu Ja‘far (a.s.) looked at the people perform Tawaf (walking around the Ka‘ba seven times) and said, “This is how they used to perform Tawaf in the times ignorance (pre-Islamic era). What they are required to do is to perform Tawaf and come to us, declare their support and love for us and express their help for us. The Imam (a.s.) then recited this verse of the Holy Quran. “Lord, fill the hearts of the people with love for them . .” (14:37)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/286)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1021,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:96:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ دَاوُدَ بْنِ النُّعْمَانِ عَنْ أَبِي عُبَيْدَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) وَ رَأَى النَّاسَ بِمَكَّةَ وَ مَا يَعْمَلُونَ قَالَ فَقَالَ فِعَالٌ كَفِعَالِ الْجَاهِلِيَّةِ أَمَا وَ اللَّهِ مَا أُمِرُوا بِهَذَا وَ مَا أُمِرُوا إِلَّا أَنْ يَقْضُوا تَفَثَهُمْ وَ لْيُوفُوا نُذُورَهُمْ فَيَمُرُّوا بِنَا فَيُخْبِرُونَا بِوَلَايَتِهِمْ وَ يَعْرِضُوا عَلَيْنَا نُصْرَتَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Asbat, from Dawood Bin Al Na’man, from Abu Ubeyda who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup>, and he<sup>asws</sup> saw the people at Makkah and what they were doing. So he<sup>asws</sup> said: ‘Their deeds are like the deeds of the Pre-Islamic period. But, by Allah<sup>azwj</sup>, they have not been Commanded with this, and they have not been Commanded with except that they should complete their Hajj, and let them fulfil their vows. Then they should pass by us<sup>asws</sup> and they should inform us<sup>asws</sup> of their Wilayah and present their help to us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ali ibn Asbat from Dawud ibn al-Ni‘man from abu ‘Ubayda who has said the following. “I heard abu Ja‘far say, (a.s.) when he saw people in Makka and what they were doing, “Activities like those in the days of ignorance. By Allah, they are not commanded to do as suCh What they are commanded to do is to complete their Hajj, relieve themselves of the obligations of vows and visit us to inform us of their support and express their help before us.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/287)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1022,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:96:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ جَمِيعاً عَنْ أَبِي جَمِيلَةَ عَنْ خَالِدِ بْنِ عَمَّارٍ عَنْ سَدِيرٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) وَ هُوَ دَاخِلٌ وَ أَنَا خَارِجٌ وَ أَخَذَ بِيَدِي ثُمَّ اسْتَقْبَلَ الْبَيْتَ فَقَالَ يَا سَدِيرُ إِنَّمَا أُمِرَ النَّاسُ أَنْ يَأْتُوا هَذِهِ الْأَحْجَارَ فَيَطُوفُوا بِهَا ثُمَّ يَأْتُونَا فَيُعْلِمُونَا وَلَايَتَهُمْ لَنَا وَ هُوَ قَوْلُ اللَّهِ وَ إِنِّي لَغَفَّارٌ لِمَنْ تابَ وَ آمَنَ وَ عَمِلَ صالِحاً ثُمَّ اهْتَدى ثُمَّ أَوْمَأَ بِيَدِهِ إِلَى صَدْرِهِ إِلَى وَلَايَتِنَا ",
          "ثُمَّ قَالَ يَا سَدِيرُ فَأُرِيكَ الصَّادِّينَ عَنْ دِينِ اللَّهِ ثُمَّ نَظَرَ إِلَى أَبِي حَنِيفَةَ وَ سُفْيَانَ الثَّوْرِيِّ فِي ذَلِكَ الزَّمَانِ وَ هُمْ حَلَقٌ فِي الْمَسْجِدِ فَقَالَ هَؤُلَاءِ الصَّادُّونَ عَنْ دِينِ اللَّهِ بِلَا هُدًى مِنَ اللَّهِ وَ لَا كِتَابٍ مُبِينٍ إِنَّ هَؤُلَاءِ الْأَخَابِثَ لَوْ جَلَسُوا فِي بُيُوتِهِمْ فَجَالَ النَّاسُ فَلَمْ يَجِدُوا أَحَداً يُخْبِرُهُمْ عَنِ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ عَنْ رَسُولِهِ ( صلى الله عليه وآله ) حَتَّى يَأْتُونَا فَنُخْبِرَهُمْ عَنِ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ عَنْ رَسُولِهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sindy, from Ja’far Bin Bashir and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzal, altogether, from Abu Jameela, from Khalid Bin Ammar, from Sadeyr who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> and he<sup>asws</sup> was entering and I was exiting, and he<sup>asws</sup> grabbed me by my hand, then faced the House (Kabah), so he<sup>asws</sup> said: ‘Sadeyr! But rather, the people have been Commanded that they should be coming to these rocks, so they should circle with these, then they should come to us<sup>asws</sup>, and they should let us<sup>asws</sup> know of their Wilayah for us<sup>asws</sup>, and these are the Words of Allah<sup>azwj</sup> <span class=\"ibTxt\">[20:82] And I am Forgiving to him who repents and believes and does righteous deeds, then follows the right Guidance</span>’. Then he<sup>asws</sup> gestured by his<sup>asws</sup> hand to his<sup>asws</sup> chest (and said): ‘To our<sup>asws</sup> Wilayah’. ",
            "Then he<sup>asws</sup> said: ‘O Sadeyr! Shall I<sup>asws</sup> show you the blockers from the Religion of Allah<sup>asws</sup>?’ Then he<sup>asws</sup> looked towards Abu Haneefa and Sufyan Al-Sowry at that time, and they had a circle (of people) in the Masjid, so he<sup>asws</sup> said: ‘They are the blockers from the Religion of Allah<sup>azwj</sup>, without any Guidance from Allah<sup>azwj</sup> nor any evident Book. They are the malignant ones. If they were to sit in their houses, so the people would go around, and they would not find anyone who would be informing them about Allah<sup>azwj</sup> Blessed and High and about His<sup>azwj</sup> Rasool<sup>saww</sup> until they would come to us<sup>asws</sup>. So we<sup>asws</sup> would inform them about Allah<sup>azwj</sup> Blessed and High and about His<sup>azwj</sup> Rasool<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim has narrated from Salih ibn al-Sindi from Ja‘far ibn Bashir and Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa from ibn al-Faddal all from abu Jamila from Khalid ibn ‘Ammar from Sadir who has said the following. “I heard abu Ja‘far (a.s.) when he was coming in and I was going out and he held my hand and then said, “Turn to the al-Bayt (house). O Sadir, what people are, in fact, commanded to do is to come to these stones, perform Tawaf around them (walk seven times around) then come to us declare their support to us. That is what Allah has said, “. .I am All-forgiving to the righteously striving believers who repent and follow the right guidance.” (20:82) Then he pointed his hand to his chest –to our Leadership with Divine Authority. Then he said, “O Sadi, would you like me to show you who create obstacles on the way of Allah.” Then he looked at abu Hanifa and Sufyan al-Thuri of that time. They a circle of people around them. He then said, “These are the ones who create obstacles on the way of Allah without guidance from Allah and a clear book. Would that these malignant ones sit in their homes. When people search around and would not find anyone to inform them of the guidance of Allah, the Most Holy, the Most High, and His messenger they would come to us and we would inform them of the guidance of Allah, the Most Holy, the Most High, and His Messenger.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:96",
  "kind": "verse_list"
}