{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 97"
        },
        "path": "/books/al-kafi:1:4:97",
        "titles": {
          "ar": "باب أَنَّ الْأَئِمَّةَ تَدْخُلُ الْمَلَائِكَةُ بُيُوتَهُمْ وَ تَطَأُ بُسُطَهُمْ وَ تَأْتِيهِمْ بِالْأَخْبَارِ ( عليهم السلام )",
          "en": "Chapter 97 – The Imams<sup>asws</sup> are such that the Angels come over to them and tread their furnishings and come to them<sup>asws</sup> with the news"
        }
      }
    ],
    "index": 155,
    "local_index": 97,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 98"
        },
        "path": "/books/al-kafi:1:4:98",
        "titles": {
          "ar": "باب أَنَّ الْجِنَّ يَأْتِيهِمْ فَيَسْأَلُونَهُمْ عَنْ مَعَالِمِ دِينِهِمْ وَ يَتَوَجَّهُونَ فِي أُمُورِهِمْ",
          "en": "Chapter 98 – The Jinn come to them (Imams<sup>asws</sup>), so they are asking them<sup>asws</sup> about the information of their Religion, and they are betaking to their orders"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 96"
        },
        "path": "/books/al-kafi:1:4:96",
        "titles": {
          "ar": "باب أَنَّ الْوَاجِبَ عَلَى النَّاسِ بَعْدَ مَا يَقْضُونَ مَنَاسِكَهُمْ أَنْ يَأْتُوا الْإِمَامَ فَيَسْأَلُونَهُ عَنْ مَعَالِمِ دِينِهِمْ وَ يُعْلِمُونَهُمْ وَلَايَتَهُمْ وَ مَوَدَّتَهُمْ لَهُ",
          "en": "Chapter 96 – The Obligation upon the people, after having fulfilled their rituals (of Hajj), that they should come to the Imam<sup>asws</sup>, so they should be asking him<sup>asws</sup> about the information about their Religion, and they should be letting him<sup>asws</sup> know of their Wilayah and their cordiality for him<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:97",
    "titles": {
      "ar": "باب أَنَّ الْأَئِمَّةَ تَدْخُلُ الْمَلَائِكَةُ بُيُوتَهُمْ وَ تَطَأُ بُسُطَهُمْ وَ تَأْتِيهِمْ بِالْأَخْبَارِ ( عليهم السلام )",
      "en": "Chapter 97 – The Imams<sup>asws</sup> are such that the Angels come over to them and tread their furnishings and come to them<sup>asws</sup> with the news"
    },
    "verse_count": 4,
    "verse_start_index": 1022,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/288)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1023,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/265",
              "text": "ابْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1144",
              "text": "مِسْمَعٍ كِرْدِينٍ الْبَصْرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ سِنَانٍ عَنْ مِسْمَعٍ كِرْدِينٍ الْبَصْرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:97:1",
        "text": [
          " كُنْتُ لَا أَزِيدُ عَلَى أَكْلَةٍ بِاللَّيْلِ وَ النَّهَارِ فَرُبَّمَا اسْتَأْذَنْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ أَجِدُ الْمَائِدَةَ قَدْ رُفِعَتْ لَعَلِّي لَا أَرَاهَا بَيْنَ يَدَيْهِ فَإِذَا دَخَلْتُ دَعَا بِهَا فَأُصِيبَ مَعَهُ مِنَ الطَّعَامِ وَ لَا أَتَأَذَّى بِذَلِكَ وَ إِذَا عَقَّبْتُ بِالطَّعَامِ عِنْدَ غَيْرِهِ لَمْ أَقْدِرْ عَلَى أَنْ أَقِرَّ وَ لَمْ أَنَمْ مِنَ النَّفْخَةِ ",
          "فَشَكَوْتُ ذَلِكَ إِلَيْهِ وَ أَخْبَرْتُهُ بِأَنِّي إِذَا أَكَلْتُ عِنْدَهُ لَمْ أَتَأَذَّ بِهِ فَقَالَ يَا أَبَا سَيَّارٍ إِنَّكَ تَأْكُلُ طَعَامَ قَوْمٍ صَالِحِينَ تُصَافِحُهُمُ الْمَلَائِكَةُ عَلَى فُرُشِهِمْ قَالَ قُلْتُ وَ يَظْهَرُونَ لَكُمْ قَالَ فَمَسَحَ يَدَهُ عَلَى بَعْضِ صِبْيَانِهِ فَقَالَ هُمْ أَلْطَفُ بِصِبْيَانِنَا مِنَّا بِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Sinan, from Misma’a Kirdeyn Al Basry who said, ",
            "‘I did not used to increase upon eating once by the night and the day. So, sometimes I would ask permission upon vising Abu Abdullah<sup>asws</sup>, and find that perhaps the meal would have been raised and I would not see it in front of him<sup>asws</sup>. So when I would enter, he<sup>asws</sup> would call for it, so I would attain with him<sup>asws</sup> from the food, and I would not be harmed by that (the food at all). However, whenever I ate the food with others (people), I was not able upon settling and could not sleep due to gasses (indigestion). ",
            "So I complained of what to him<sup>asws</sup> and I informed him that whenever I ate with him<sup>asws</sup> I am not harmed by it. So he<sup>asws</sup> said: ‘O Abu Sayyar! You are eating the food of the righteous people<sup>asws</sup>. Then Angels shake their hands upon their<sup>asws</sup> furnishings’. I said, ‘And they appear to you<sup>asws</sup> all (Imams<sup>asws</sup>)?’ So he<sup>asws</sup> wiped his<sup>asws</sup> hands upon one of his<sup>asws</sup> children and he<sup>asws</sup> said: ‘They are kinder with our<sup>asws</sup> children than we<sup>asws</sup> are with them’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated has narrated from Ahmad ibn Muhammad from ibn Sinan from Masma‘ Kirdin al-Basri who has said the following. “I used to eat one meal in twenty four hours. I would ask permission to see abu ‘Abdallah (a.s.) at such time that I would expect that their table cloth is collected and they have fished their meal. When I would arrive he would ask to return the table cloth. I would find food in it but it would not harm me while if I would eat with others again I could not do so and it would become very difficult for me to sleep because of gases. I complained about it before the Imam (a.s.) and said that if I would eat from your table it does not harm me. He said, “O abu Sayyar, it is because you eat from the table of the virtuous people. Angels shake hands with them on their furnishings.” The narrator has said that I then asked, “Do they (angels) appear to you?” He has said, “The Imam (a.s.) wiped his hand over one of his children and said, ‘They are more kind to our children than we ourselves are.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/289)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1024,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/130",
              "text": "مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1145",
              "text": "مُحَمَّدِ بْنِ الْقَاسِمِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/594",
              "text": "الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ الْقَاسِمِ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:97:2",
        "text": [
          " قَالَ يَا حُسَيْنُ وَ ضَرَبَ بِيَدِهِ إِلَى مَسَاوِرَ فِي الْبَيْتِ مَسَاوِرُ طَالَ مَا اتَّكَتْ عَلَيْهَا الْمَلَائِكَةُ وَ رُبَّمَا الْتَقَطْنَا مِنْ زَغَبِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Muhammad Bin Al Qasim, from Al Husayn Bin Abu Al A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘O Husayn!’ and he<sup>asws</sup> struck his<sup>asws</sup> hand to a cushion in the house, (then said): ‘A cushion, the Angels having had leaned upon it for long and sometimes we<sup>asws</sup> tend to find their fluff (from their wings)’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from Muhammad ibn al-Qasim from al-Husayn ibn abu al-‘Ala’ who has said the following. “Once Abu ‘Abdallah (a.s.) said, ‘O Husayn, tapping his hand on a cushion in the house, saying, ‘Cushions on which for a long time angels have been leaning and perhaps we pick up some of their fluff around.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (290/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1025,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/262",
              "text": "مُحَمَّدٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1146",
              "text": "مَالِكُ بْنُ عَطِيَّةَ الْأَحْمَسِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "أَبِي حَمْزَةَ الثُّمَالِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ قَالَ حَدَّثَنِي مَالِكُ بْنُ عَطِيَّةَ الْأَحْمَسِيُّ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:97:3",
        "text": [
          " دَخَلْتُ عَلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) فَاحْتُبِسْتُ فِي الدَّارِ سَاعَةً ثُمَّ دَخَلْتُ الْبَيْتَ وَ هُوَ يَلْتَقِطُ شَيْئاً وَ أَدْخَلَ يَدَهُ مِنْ وَرَاءِ السِّتْرِ فَنَاوَلَهُ مَنْ كَانَ فِي الْبَيْتِ فَقُلْتُ جُعِلْتُ فِدَاكَ هَذَا الَّذِي أَرَاكَ تَلْتَقِطُهُ أَيُّ شَيْ‏ءٍ هُوَ فَقَالَ فَضْلَةٌ مِنْ زَغَبِ الْمَلَائِكَةِ نَجْمَعُهُ إِذَا خَلَّوْنَا نَجْعَلُهُ سَيْحاً لِأَوْلَادِنَا فَقُلْتُ جُعِلْتُ فِدَاكَ وَ إِنَّهُمْ لَيَأْتُونَكُمْ فَقَالَ يَا أَبَا حَمْزَةَ إِنَّهُمْ لَيُزَاحِمُونَّا عَلَى تُكَأَتِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad Bin Muhammad, from Ali Bin Al Hakam who said, ‘Malik Bin Atiyya Al Ahmasy narrated to me, from Abu Hamza Al Sumaly who said, ",
            "‘I went over to Ali<sup>asws</sup> Bn Al-Husayn<sup>asws</sup>, and I was withheld in the room for a while. Then I entered the room and he<sup>asws</sup> was picking up something and he<sup>asws</sup> inserted his<sup>asws</sup> hand from behind the curtain, and the one who was in the room took it’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! This which I saw you<sup>asws</sup> pick up, which things was it?’ So he<sup>asws</sup> said: ‘Remnant from the fluff of the Angels. We<sup>asws</sup> gather it when they are around us<sup>asws</sup> to make it to amuse our<sup>asws</sup> children’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! And they (Angels) tend to come to you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘O Abu Hamza! They tend to crowd upon our<sup>asws</sup> cushions’."
          ],
          "en.sarwar": [
            " 3. Muhammad has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam who hassaaid that Malik ibn ‘Atiyya al-Ahmasi narrated to him from abu Hamza al-Thumali who has said the following. “Once I went to see Ali ibn al-Husayn (a.s.) and I became confounded in the room for an hour then I went inside the house while he was picking up things and would give to someone behind the curtain. I then said, may Allah take my soul in service for your cause, What was that thing that I saw you picking up?” The Imam (a.s.) said, “The fuzz from the angels when they come to meet us and we use it amuse our children.” I then said, may Allah take my soul in service for your cause, do they they come to you?” The Imam (a.s.) said, “O abu Hamza, they become crowded over our furnishings.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/291)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1026,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/262",
              "text": "مُحَمَّدٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/590",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/731",
              "text": "مُحَمَّدِ بْنِ أَسْلَمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/119",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/373",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدٌ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:97:4",
        "text": [
          " سَمِعْتُهُ يَقُولُ مَا مِنْ مَلَكٍ يُهْبِطُهُ اللَّهُ فِي أَمْرٍ مَا يُهْبِطُهُ إِلَّا بَدَأَ بِالْإِمَامِ فَعَرَضَ ذَلِكَ عَلَيْهِ وَ إِنَّ مُخْتَلَفَ الْمَلَائِكَةِ مِنْ عِنْدِ اللَّهِ تَبَارَكَ وَ تَعَالَى إِلَى صَاحِبِ هَذَا الْأَمْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Muhammad Bin Al Hassan, from Muhammad Bin Aslam, from Ali Bin Abu Hamza, ",
            "from Abu Al-Hassan<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘There is none from an Angel whom Allah<sup>azwj</sup> Causes to descend regarding a matter what he descends for, except that he begins with the Imam<sup>asws</sup>. So he displays that upon him<sup>asws</sup>, and the interchange of the Angels (their coming and going), is from the Presence of Allah<sup>azwj</sup> Blessed and High, to the Master<sup>asws</sup> of this Command’."
          ],
          "en.sarwar": [
            " 4. Muhammad has narrated from Muhammad ibn al-Hassan from Muhammad ibn Aslam from Ali ibn abu Hamza who has said the following. “I heard abu al-Hassan (a.s.) say, ‘Every angels that Allah sends down for a task that angel first begins with meeting the Imam to present the task to him. The presence of Imam, Leader with Divine Authority is the scene of great mix of the angels from Allah, the Most Holy, the Most High.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:97",
  "kind": "verse_list"
}