{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 98"
        },
        "path": "/books/al-kafi:1:4:98",
        "titles": {
          "ar": "باب أَنَّ الْجِنَّ يَأْتِيهِمْ فَيَسْأَلُونَهُمْ عَنْ مَعَالِمِ دِينِهِمْ وَ يَتَوَجَّهُونَ فِي أُمُورِهِمْ",
          "en": "Chapter 98 – The Jinn come to them (Imams<sup>asws</sup>), so they are asking them<sup>asws</sup> about the information of their Religion, and they are betaking to their orders"
        }
      }
    ],
    "index": 156,
    "local_index": 98,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 99"
        },
        "path": "/books/al-kafi:1:4:99",
        "titles": {
          "ar": "باب فِي الْأَئِمَّةِ ( عليهم السلام ) أَنَّهُمْ إِذَا ظَهَرَ أَمْرُهُمْ حَكَمُوا بِحُكْمِ دَاوُدَ وَ آلِ دَاوُدَ وَ لَا يَسْأَلُونَ الْبَيِّنَةَ عَلَيْهِمُ السَّلَامُ وَ الرَّحْمَةُ وَ الرِّضْوَانُ",
          "en": "Chapter 99 – Regarding the Imams<sup>asws</sup> that they<sup>asws</sup>, when their<sup>asws</sup> command appears, they<sup>asws</sup> would be judging by the judgment of Dawood<sup>as</sup> and the Progeny of Dawood<sup>as</sup>, and they<sup>asws</sup> would not be asking for the proof, upon them<sup>asws</sup> be the greetings, and the Mercy, and the (Divine) Pleasure."
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 97"
        },
        "path": "/books/al-kafi:1:4:97",
        "titles": {
          "ar": "باب أَنَّ الْأَئِمَّةَ تَدْخُلُ الْمَلَائِكَةُ بُيُوتَهُمْ وَ تَطَأُ بُسُطَهُمْ وَ تَأْتِيهِمْ بِالْأَخْبَارِ ( عليهم السلام )",
          "en": "Chapter 97 – The Imams<sup>asws</sup> are such that the Angels come over to them and tread their furnishings and come to them<sup>asws</sup> with the news"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:98",
    "titles": {
      "ar": "باب أَنَّ الْجِنَّ يَأْتِيهِمْ فَيَسْأَلُونَهُمْ عَنْ مَعَالِمِ دِينِهِمْ وَ يَتَوَجَّهُونَ فِي أُمُورِهِمْ",
      "en": "Chapter 98 – The Jinn come to them (Imams<sup>asws</sup>), so they are asking them<sup>asws</sup> about the information of their Religion, and they are betaking to their orders"
    },
    "verse_count": 7,
    "verse_start_index": 1026,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/291)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1027,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/80",
              "text": "بَعْضُ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/180",
              "text": "مُحَمَّدِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/687",
              "text": "يَحْيَى بْنِ مُسَاوِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/673",
              "text": "سَعْدٍ الْإِسْكَافِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ يَحْيَى بْنِ مُسَاوِرٍ عَنْ سَعْدٍ الْإِسْكَافِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:98:1",
        "text": [
          " أَتَيْتُ أَبَا جَعْفَرٍ ( عليه السلام ) فِي بَعْضِ مَا أَتَيْتُهُ فَجَعَلَ يَقُولُ لَا تَعْجَلْ حَتَّى حَمِيَتِ الشَّمْسُ عَلَيَّ وَ جَعَلْتُ أَتَتَبَّعُ الْأَفْيَاءَ فَمَا لَبِثَ أَنْ خَرَجَ عَلَيَّ قَوْمٌ كَأَنَّهُمُ الْجَرَادُ الصُّفْرُ عَلَيْهِمُ الْبُتُوتُ قَدِ انْتَهَكَتْهُمُ الْعِبَادَةُ قَالَ فَوَ اللَّهِ لَأَنْسَانِي مَا كُنْتُ فِيهِ مِنْ حُسْنِ هَيْئَةِ الْقَوْمِ ",
          "فَلَمَّا دَخَلْتُ عَلَيْهِ قَالَ لِي أَرَانِي قَدْ شَقَقْتُ عَلَيْكَ قُلْتُ أَجَلْ وَ اللَّهِ لَقَدْ أَنْسَانِي مَا كُنْتُ فِيهِ قَوْمٌ مَرُّوا بِي لَمْ أَرَ قَوْماً أَحْسَنَ هَيْئَةً مِنْهُمْ فِي زِيِّ رَجُلٍ وَاحِدٍ كَأَنَّ أَلْوَانَهُمُ الْجَرَادُ الصُّفْرُ قَدِ انْتَهَكَتْهُمُ الْعِبَادَةُ فَقَالَ يَا سَعْدُ رَأَيْتَهُمْ قُلْتُ نَعَمْ قَالَ أُولَئِكَ إِخْوَانُكَ مِنَ الْجِنِّ قَالَ فَقُلْتُ يَأْتُونَكَ قَالَ نَعَمْ يَأْتُونَّا يَسْأَلُونَّا عَنْ مَعَالِمِ دِينِهِمْ وَ حَلَالِهِمْ وَ حَرَامِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Some of our companions, from Muhammad Bin Ali, from Yahya Bin Musawir, from Sa’ad Al Iskaf who said, ",
            "‘I went over to Abu Ja’far<sup>asws</sup> regarding some of what I used to go to him<sup>asws</sup> for, so he<sup>asws</sup> went on to say: ‘Not now’, until the sun was very hot upon me, and I went to follow the shades. So, it was not long before there came out to me a group, as if they were locusts, there being paleness upon them, slim, the worship having affected them. So, by Allah<sup>azwj</sup>, I had never been so awed by the beauty of the group. ",
            "So when I went over to him<sup>asws</sup>, he<sup>asws</sup> said to me: ‘I<sup>asws</sup> see that I<sup>asws</sup> have been difficult upon you’. I said, ‘Yes, by Allah<sup>azwj</sup>! It had comforted me what I was in, by a group which passed by me. I have never seen a people more beautiful in awe than them in uniform like one man, as if their colours were like the locusts, the paleness due to the worship having had affected them’. So he<sup>asws</sup> said: ‘O Sa’d! You saw them?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘They are your brethren from the Jinn’. So I said, ‘They come to you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘They do come to us<sup>asws</sup>, asking us<sup>asws</sup> about the information of their Religion, and their Permissible and their Prohibitions’."
          ],
          "en.sarwar": [
            " 1. Certain persons of our people have narrated from Muhammad ibn Ali from Yahya ibn Musawir from Sa‘d al-Askaf who has said the following. “On one of the occasion of my meeting with abu Ja‘far (a.s.) when I went tosee him he asked me to wait until the sun became very hot on me. I tried to follow the shadow from the sun. No very long thereafter a people came out of his presence that looked like locusts dressed in large gowns and very oale and slim due to extensive worshipping. Their beautiful scene made me to forget other things. When I went in the presence of the Imam (a.s.) he said, “I am afraid I caused you hardships.” I said, “Yes, it was difficult but, by Allah, I forgot other things when I saw them. A people passed by the like of whose beauty I had not seen before. They looked like locusts and pale and slim due to worshipping a great deal.” The Imam (a.s.) said, “O Sa‘d , did you see them?” I said, “Yes, I saw them.” The Imam (a.s.) said, “They are your brethren from Jinns.” The narrator has said that he asked The Imam (a.s.), “Do they come to you?” He said, “Yes, they come to us for religious instructions and to learn the lawful and unlawful matters.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/292)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1028,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/324",
              "text": "عَلِيِّ بْنِ حَسَّانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1078",
              "text": "إِبْرَاهِيمَ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1079",
              "text": "ابْنِ جَبَلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ إِبْرَاهِيمَ بْنِ إِسْمَاعِيلَ عَنِ ابْنِ جَبَلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:98:2",
        "text": [
          " كُنَّا بِبَابِهِ فَخَرَجَ عَلَيْنَا قَوْمٌ أَشْبَاهُ الزُّطِّ عَلَيْهِمْ أُزُرٌ وَ أَكْسِيَةٌ فَسَأَلْنَا أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْهُمْ فَقَالَ هَؤُلَاءِ إِخْوَانُكُمْ مِنَ الْجِنِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ali Bn Hassan, from Ibrahim Bin Ismail, from bn Jabal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘We were at his<sup>asws</sup> door, so a group came out to us resembling the gypsies. Upon them were loincloths and a covering. So we asked Abu Abdullah<sup>asws</sup> about them, and he<sup>asws</sup> said: ‘They are your brethren from the Jinn’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ali ibn Hassa’n from Ibrahim ibn ’Isma‘il from ibn Jabal who has said the following. “Once we were in front of the door of the house of abu ‘Abdallah (a.s.) that a people who looked Indian gypsies came out with loin clothe and covering on them. We asked abu ‘‘Abdallah (a.s.) about them and he said, “They were your brethren from Jinns.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (293/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1029,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/678",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/673",
              "text": "سَعْدٍ الْإِسْكَافِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ وَ مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنِ ابْنِ فَضَّالٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ سَعْدٍ الْإِسْكَافِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:98:3",
        "text": [
          " أَتَيْتُ أَبَا جَعْفَرٍ ( عليه السلام ) أُرِيدُ الْإِذْنَ عَلَيْهِ فَإِذَا رِحَالُ إِبِلٍ عَلَى الْبَابِ مَصْفُوفَةٌ وَ إِذَا الْأَصْوَاتُ قَدِ ارْتَفَعَتْ ثُمَّ خَرَجَ قَوْمٌ مُعْتَمِّينَ بِالْعَمَائِمِ يُشْبِهُونَ الزُّطَّ ",
          "قَالَ فَدَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقُلْتُ جُعِلْتُ فِدَاكَ أَبْطَأَ إِذْنُكَ عَلَيَّ الْيَوْمَ وَ رَأَيْتُ قَوْماً خَرَجُوا عَلَيَّ مُعْتَمِّينَ بِالْعَمَائِمِ فَأَنْكَرْتُهُمْ فَقَالَ أَ وَ تَدْرِي مَنْ أُولَئِكَ يَا سَعْدُ قَالَ قُلْتُ لَا قَالَ فَقَالَ أُولَئِكَ إِخْوَانُكُمْ مِنَ الْجِنِّ يَأْتُونَّا فَيَسْأَلُونَّا عَنْ حَلَالِهِمْ وَ حَرَامِهِمْ وَ مَعَالِمِ دِينِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees and Muhammad Bn Yahya, from Al Hassan Bin Ali Al Kufy, from Ibn Fazzal, from one of our comanions, from Sa’d Al Askaf who said, ",
            "‘I went over to Abu Ja’far<sup>asws</sup> wanting the permission to see him<sup>asws</sup>, so there were riding camels upon the door in a row, and their voices were raised. Then there came out a group turbaned with the turbans resembling the gypsies. ",
            "He (the narrator) said, ‘So I went over to Abu Ja’far<sup>asws</sup>, and I said, ‘May I be sacrificed for you<sup>asws</sup>! Your<sup>asws</sup> permission was delayed upon me today, and I saw a group coming out to me turbaned with the turbans, but I could not recognise them’. So he<sup>asws</sup> said: ‘And do you know who they are, O Sa’ad?’ I said, ‘No’. So he<sup>asws</sup> said: ‘They are your brethren from the Jinn. They come to us<sup>asws</sup>, and they ask us about their Permissible and their Prohibitions and the information of their Religion’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Idris and Muhammad ibn Yahya have narrated from al-Hassan ibn Ali al-Kufiy from ibn al-Faddal from certain person of our people from Sa‘d al-Askaf who has said the following. “Once I to ask permission to meet abu Ja‘far (a.s.). I found saddles of camels lined up in front of the door and noises coming very loud and then a people came out with turbans like those of the Indian gypsies. I asked abu Ja‘far (a.s.) about them and said, may Allah take my soul in service for your cause. Today it took a long time to receive permission to meet you. I saw a people coming out with turbans whom I could not recognize.” He said, “Do you know, O Sa‘d, who they are?” I said, “No, I do not know.” The Imam (a.s.) said, “They were your brethren in religion from Jinns. They come to us for religious instructions, to learn the lawful and unlawful matters and the principles of their religion.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن وآخره مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (294/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1030,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/836",
              "text": "إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/747",
              "text": "سَدِيرٍ الصَّيْرَفِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ سَدِيرٍ الصَّيْرَفِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:98:4",
        "text": [
          " أَوْصَانِي أَبُو جَعْفَرٍ ( عليه السلام ) بِحَوَائِجَ لَهُ بِالْمَدِينَةِ فَخَرَجْتُ فَبَيْنَا أَنَا بَيْنَ فَجِّ الرَّوْحَاءِ عَلَى رَاحِلَتِي إِذَا إِنْسَانٌ يَلْوِي ثَوْبَهُ قَالَ فَمِلْتُ إِلَيْهِ وَ ظَنَنْتُ أَنَّهُ عَطْشَانُ فَنَاوَلْتُهُ الْإِدَاوَةَ فَقَالَ لِي لَا حَاجَةَ لِي بِهَا وَ نَاوَلَنِي كِتَاباً طِينُهُ رَطْبٌ",
          "قَالَ فَلَمَّا نَظَرْتُ إِلَى الْخَاتَمِ إِذَا خَاتَمُ أَبِي جَعْفَرٍ ( عليه السلام ) فَقُلْتُ مَتَى عَهْدُكَ بِصَاحِبِ الْكِتَابِ قَالَ السَّاعَةَ وَ إِذَا فِي الْكِتَابِ أَشْيَاءُ يَأْمُرُنِي بِهَا ثُمَّ الْتَفَتُّ فَإِذَا لَيْسَ عِنْدِي أَحَدٌ قَالَ ",
          "ثُمَّ قَدِمَ أَبُو جَعْفَرٍ ( عليه السلام ) فَلَقِيتُهُ فَقُلْتُ جُعِلْتُ فِدَاكَ رَجُلٌ أَتَانِي بِكِتَابِكَ وَ طِينُهُ رَطْبٌ فَقَالَ يَا سَدِيرُ إِنَّ لَنَا خَدَماً مِنَ الْجِنِّ فَإِذَا أَرَدْنَا السُّرْعَةَ بَعَثْنَاهُمْ .",
          "وَ فِي رِوَايَةٍ أُخْرَى قَالَ إِنَّ لَنَا أَتْبَاعاً مِنَ الْجِنِّ كَمَا أَنَّ لَنَا أَتْبَاعاً مِنَ الْإِنْسِ فَإِذَا أَرَدْنَا أَمْراً بَعَثْنَاهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ibrahim Bin Abu Al Balad, from Sadeyr Al Sayrafi who said, ",
            "‘Abu Ja’far<sup>asws</sup> ordered me to deal with a need of his<sup>asws</sup> at Al-Medina, so I went out. So while I was between Fajj Al-Raeha upon my ride, when a person waved his cloth at me. So I inclined towards him and thought that he is thirsty. So I gave him the drinking cup, but he said to me, ‘There is no need for me with it’, and he gave me a letters, the ink of which was still wet. ",
            "He (the narrator) said, ‘So when I looked at the seal, it was the seal of Abu Ja’far<sup>asws</sup>’. So I said, ‘When did he<sup>asws</sup>, the owner of the letter pact with you?’  He said, ‘Just now’. And there were things in the letter instructing me with these. Then I turned around, but there was no one in my presence. ",
            "Then I proceeded to Abu Ja’far<sup>asws</sup> and met up with him<sup>asws</sup>, and I said to him<sup>asws</sup>, ‘A man came over to me with your<sup>asws</sup> letter and its ink was still wet’. So he<sup>asws</sup> said: ‘O Sadeyr! For us there are servants from the Jinn. So whenever we<sup>asws</sup> intend the quickness, we<sup>asws</sup> send them’. ",
            "And in another report, he<sup>asws</sup> said: ‘For us<sup>asws</sup> there are followers from the Jinn just as there are followers from the human beings. So, whenever we<sup>asws</sup> intend a matter, we<sup>asws</sup> send them’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ibrahim ibn abu al-Balad from Sadir al-Sayrafi who has said the following. “Abu Ja‘far (a.s.) asked me to help him in a few things in Maina. I left and when reached fajj al-Rawha’ a man waved to me with his cloths. The narrator has said that I turned to him and I though he was thirsty. I offered the cup but he declined saying, “I do not need it.” He gave a letter with its ink still not dried up. The narrator has said that when looked at it, it had the seal of abu Ja‘far (a.s.) on. I asked him when were you in the presence of abu Ja‘far (a.s.)?” He said, “Just now I was in his presence.” In the letter there were few things that he had commanded me to do. When looked around there was no one with me.” The narrator has said that then I went to meet abu Ja‘far (a.s.) and said, may Allah take my soul in service for your cause, a man came to me with your letter the ink of which was not yet dried up.” He said, “O Sadir, we servants from Jinns. When we would need a thing to happen quickly we send them to do it.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/295)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1031,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1080",
              "text": "مُحَمَّدِ بْنِ جَحْرَشٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ جَحْرَشٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:98:5",
        "text": [
          " حَدَّثَتْنِي حَكِيمَةُ بِنْتُ مُوسَى قَالَتْ رَأَيْتُ الرِّضَا ( عليه السلام ) وَاقِفاً عَلَى بَابِ بَيْتِ الْحَطَبِ وَ هُوَ يُنَاجِي وَ لَسْتُ أَرَى أَحَداً فَقُلْتُ يَا سَيِّدِي لِمَنْ تُنَاجِي فَقَالَ هَذَا عَامِرٌ الزَّهْرَائِيُّ أَتَانِي يَسْأَلُنِي وَ يَشْكُو إِلَيَّ فَقُلْتُ يَا سَيِّدِي أُحِبُّ أَنْ أَسْمَعَ كَلَامَهُ فَقَالَ لِي إِنَّكِ إِنْ سَمِعْتِ بِهِ حُمِمْتِ سَنَةً فَقُلْتُ يَا سَيِّدِي أُحِبُّ أَنْ أَسْمَعَهُ فَقَالَ لِيَ اسْمَعِي فَاسْتَمَعْتُ فَسَمِعْتُ شِبْهَ الصَّفِيرِ وَ رَكِبَتْنِيَ الْحُمَّى فَحُمِمْتُ سَنَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, and Muhammad Bin Al Hassan from Sahl Bin Ziyad, from the one who mentioned it, from Muhammad Bin Jahrash who said, ‘Hakeema Bint Musa narrated to me saying, ",
            "‘I saw Al-Reza<sup>asws</sup> pausing upon the door of Al-Hatab and he<sup>asws</sup> was whispering and I couldn’t see anyone (else). So I said, ‘O my Master<sup>asws</sup>! Whom are you<sup>asws</sup> whispering to?’ So he<sup>asws</sup> said: ‘This is Aamir Al-Zahraby (a Jinn). He has come to me<sup>asws</sup> to ask me<sup>asws</sup> and complain to me’. So I said, ‘My Master<sup>asws</sup>! I would love to hear his speech’. So he<sup>asws</sup> said to me: ‘You, if you were to listen to it, would have fever for a year’. So I said, ‘O my Master<sup>asws</sup>! I would love to hear him’. So he<sup>asws</sup> said to me: ‘Listen’. So I listened intently, and I heard (a sound) resembling the whistle, and the fever overcame me, and I was feverish for a year’."
          ],
          "en.sarwar": [
            " 5. Alki ibn Muhammad aand Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from the person who he mentioned from Muhammad ibn Jahrash who has said that Halima daughter of Musa has said the following. “Once I saw al-Rida (a.s.) standing at the door of the firewood room and he was whispering but I would not see any9ne ellse around. I then asked him, “My. master, who are you talking to?” He said, “This is ‘Amir al-Zahra’i. He has come to ask a few questions and he has certain complains.” I then asked, “My master, I like to hear his words.” He said, “If you would hear his words you will have fever for one year.” I said, “My master, I like to hear him.” He said, “All right, then listen.” I listened and I heard something like a whistle. I then felt fever for one year.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (295/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1032,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/563",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1081",
              "text": "إِبْرَاهِيمَ بْنِ هَاشِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/11",
              "text": "عَمْرِو بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/681",
              "text": "إِبْرَاهِيمَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/203",
              "text": "عَمْرِو بْنِ شِمْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/181",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ إِبْرَاهِيمَ بْنِ أَيُّوبَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:98:6",
        "text": [
          " بَيْنَا أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَلَى الْمِنْبَرِ إِذْ أَقْبَلَ ثُعْبَانٌ مِنْ نَاحِيَةِ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ فَهَمَّ النَّاسُ أَنْ يَقْتُلُوهُ فَأَرْسَلَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَنْ كُفُّوا فَكَفُّوا وَ أَقْبَلَ الثُّعْبَانُ يَنْسَابُ حَتَّى انْتَهَى إِلَى الْمِنْبَرِ فَتَطَاوَلَ فَسَلَّمَ عَلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَأَشَارَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِلَيْهِ أَنْ يَقِفَ حَتَّى يَفْرُغَ مِنْ خُطْبَتِهِ ",
          "وَ لَمَّا فَرَغَ مِنْ خُطْبَتِهِ أَقْبَلَ عَلَيْهِ فَقَالَ مَنْ أَنْتَ فَقَالَ عَمْرُو بْنُ عُثْمَانَ خَلِيفَتِكَ عَلَى الْجِنِّ وَ إِنَّ أَبِي مَاتَ وَ أَوْصَانِي أَنْ آتِيَكَ فَأَسْتَطْلِعَ رَأْيَكَ وَ قَدْ أَتَيْتُكَ يَا أَمِيرَ الْمُؤْمِنِينَ فَمَا تَأْمُرُنِي بِهِ وَ مَا تَرَى ",
          "فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أُوصِيكَ بِتَقْوَى اللَّهِ وَ أَنْ تَنْصَرِفَ فَتَقُومَ مَقَامَ أَبِيكَ فِي الْجِنِّ فَإِنَّكَ خَلِيفَتِي عَلَيْهِمْ قَالَ فَوَدَّعَ عَمْرٌو أَمِيرَ الْمُؤْمِنِينَ وَ انْصَرَفَ فَهُوَ خَلِيفَتُهُ عَلَى الْجِنِّ ",
          "فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ فَيَأْتِيكَ عَمْرٌو وَ ذَاكَ الْوَاجِبُ عَلَيْهِ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and Ahmad Bin Muhammad, from Muhammad Bin Al Hassan, from Ibrahim Bin Hashim, from Amro Bin Usman, from Ibrahim Bin Ayoub, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘While Amir Al-Momineen<sup>asws</sup> was upon the Pulpit, a snake came over from the direction of a door from the doors of the Masjid. So the people thought of killing it, but Amir Al-Momineen<sup>asws</sup> sent a message that they should refrain. So they refrained, and the snake glided until it ended up to the Pulpit, and stood elongated and greeted upon Amir Al-Momineen<sup>asws</sup>. But, Amir Al-Momineen<sup>asws</sup> gestured towards it that it should pause until he<sup>asws</sup> is free from his<sup>asws</sup> sermon. ",
            "And when he<sup>asws</sup> was free from his<sup>asws</sup> sermon, he<sup>asws</sup> turned towards it and he<sup>asws</sup> said: ‘Who are you?’ So it said, ‘Amro Bin Usman, your Caliph upon the Jinn, and that my father died and bequeathed me that I should come over to you and find out your<sup>asws</sup> view, and so I have come to you, O Amir Al-Momineen<sup>asws</sup>! So what are you<sup>asws</sup> ordering me with, and what is your<sup>asws</sup> view?’ ",
            "So Amir Al-Momineen<sup>asws</sup> said to it: ‘I<sup>asws</sup> command you with the fear of Allah<sup>azwj</sup>, and when you leave, so you should stand in the place of your father among the Jinn, for you are (now) my<sup>asws</sup> Caliph upon them’. So Amro bade farewell to Amir Al-Momineen<sup>asws</sup> and left, and he was his<sup>asws</sup> Caliph upon the Jinn’. ",
            "So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! So does Amro come to you, and is that An Obligation upon him?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Yahya and Ahmad ibn Muhammad have narrated from Muhammad ibn al-Hassan from Ibrahim ibn Hashim from ‘Amr ibn ‘Uthman from Ibrahim ibn Ayyub from ‘Amr ibn Shimr from Jabir from abu Ja‘far (a.s.) who has said the following. “Once when Amir al-Mu’minin (a.s.) was on the pulpit a serpent entered from one of the doors of the mosque. People wanted to kill him. Amir al-Mu’minin (a.s.) asked them to leave him alone. They left him alone. The serpent began to crawl to the pulpit. He stretched and saluted to Amir al-Mu’minin (a.s.). Amir al-Mu’minin (a.s.) made a gesture to him to wait until the sermon is completed. When the sermon was completed he came to him and said, “Who are you?” He said, “I am ‘Amr ibn ‘Uthman, your deputy among the Jinns. My father has died and he has asked me in his will to come to you and find out your instructions and that is why I am here. What do you command me to do and what do you see.” Amir al-Mu’minin (a.s.) said, “I ask you to be pious before Allah and go back and act as the successor of your father among the Jinns. I appoint you as my deputy over them.” The narrator has said that ‘Amr then said farewell to Amir al-Mu’minin (a.s.) and left as his deputy over the Jinns. I asked The Imam (a.s.), may Allah take my soul in service for your cause, does ‘Amr fulfill that obligation on him?” He said, “Yes, he does so.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف أو مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (296/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1033,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/407",
              "text": "صَالِحِ بْنِ أَبِي حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/588",
              "text": "مُحَمَّدِ بْنِ أُورَمَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/202",
              "text": "أَحْمَدَ بْنِ النَّضْرِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1082",
              "text": "النُّعْمَانِ بْنِ بَشِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:98:7",
        "text": [
          " كُنْتُ مُزَامِلًا لِجَابِرِ بْنِ يَزِيدَ الْجُعْفِيِّ فَلَمَّا أَنْ كُنَّا بِالْمَدِينَةِ دَخَلَ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَوَدَّعَهُ وَ خَرَجَ مِنْ عِنْدِهِ وَ هُوَ مَسْرُورٌ حَتَّى وَرَدْنَا الْأُخَيْرِجَةَ أَوَّلَ مَنْزِلٍ نَعْدِلُ مِنْ فَيْدَ إِلَى الْمَدِينَةِ يَوْمَ جُمُعَةٍ فَصَلَّيْنَا الزَّوَالَ فَلَمَّا نَهَضَ بِنَا الْبَعِيرُ إِذَا أَنَا بِرَجُلٍ طُوَالٍ آدَمَ مَعَهُ كِتَابٌ فَنَاوَلَهُ جَابِراً فَتَنَاوَلَهُ فَقَبَّلَهُ وَ وَضَعَهُ عَلَى عَيْنَيْهِ وَ إِذَا هُو مِنْ مُحَمَّدِ بْنِ عَلِيٍّ إِلَى جَابِرِ بْنِ يَزِيدَ وَ عَلَيْهِ طِينٌ أَسْوَدُ رَطْبٌ َ",
          "فَقَالَ لَهُ مَتَى عَهْدُكَ بِسَيِّدِي فَقَالَ السَّاعَةَ فَقَالَ لَهُ قَبْلَ الصَّلَاةِ أَوْ بَعْدَ الصَّلَاةِ فَقَالَ بَعْدَ الصَّلَاةِ فَفَكَّ الْخَاتَمَ وَ أَقْبَلَ يَقْرَؤُهُ وَ يَقْبِضُ وَجْهَهُ حَتَّى أَتَى عَلَى آخِرِهِ ثُمَّ أَمْسَكَ الْكِتَابَ فَمَا رَأَيْتُهُ ضَاحِكاً وَ لَا مَسْرُوراً حَتَّى وَافَى الْكُوفَةَ فَلَمَّا وَافَيْنَا الْكُوفَةَ لَيْلًا بِتُّ لَيْلَتِي فَلَمَّا أَصْبَحْتُ أَتَيْتُهُ إِعْظَاماً لَهُ فَوَجَدْتُهُ قَدْ خَرَجَ عَلَيَّ وَ فِي عُنُقِهِ كِعَابٌ قَدْ عَلَّقَهَا وَ قَدْ رَكِبَ قَصَبَةً وَ هُوَ يَقُولُ أَجِدُ مَنْصُورَ بْنَ جُمْهُورٍ أَمِيراً غَيْرَ مَأْمُورٍ وَ أَبْيَاتاً مِنْ نَحْوِ هَذَا",
          "فَنَظَرَ فِي وَجْهِي وَ نَظَرْتُ فِي وَجْهِهِ فَلَمْ يَقُلْ لِي شَيْئاً وَ لَمْ أَقُلْ لَهُ وَ أَقْبَلْتُ أَبْكِي لِمَا رَأَيْتُهُ وَ اجْتَمَعَ عَلَيَّ وَ عَلَيْهِ الصِّبْيَانُ وَ النَّاسُ وَ جَاءَ حَتَّى دَخَلَ الرَّحَبَةَ وَ أَقْبَلَ يَدُورُ مَعَ الصِّبْيَانِ وَ النَّاسُ يَقُولُونَ جُنَّ جَابِرُ بْنُ يَزِيدَ جُنَّ",
          "فَوَ اللَّهِ مَا مَضَتِ الْأَيَّامُ حَتَّى وَرَدَ كِتَابُ هِشَامِ بْنِ عَبْدِ الْمَلِكِ إِلَى وَالِيهِ أَنِ انْظُرْ رَجُلًا يُقَالُ لَهُ جَابِرُ بْنُ يَزِيدَ الْجُعْفِيُّ فَاضْرِبْ عُنُقَهُ وَ ابْعَثْ إِلَيَّ بِرَأْسِهِ فَالْتَفَتَ إِلَى جُلَسَائِهِ فَقَالَ لَهُمْ مَنْ جَابِرُ بْنُ يَزِيدَ الْجُعْفِيُّ قَالُوا أَصْلَحَكَ اللَّهُ كَانَ رَجُلًا لَهُ عِلْمٌ وَ فَضْلٌ وَ حَدِيثٌ وَ حَجَّ فَجُنَّ وَ هُوَ ذَا فِي الرَّحَبَةِ مَعَ الصِّبْيَانِ عَلَى الْقَصَبِ يَلْعَبُ مَعَهُمْ",
          "قَالَ فَأَشْرَفَ عَلَيْهِ فَإِذَا هُوَ مَعَ الصِّبْيَانِ يَلْعَبُ عَلَى الْقَصَبِ فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِنْ قَتْلِهِ ",
          "قَالَ وَ لَمْ تَمْضِ الْأَيَّامُ حَتَّى دَخَلَ مَنْصُورُ بْنُ جُمْهُورٍ الْكُوفَةَ وَ صَنَعَ مَا كَانَ يَقُولُ جَابِرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Salih Bin Abu Hammad, from Muhammad Bin Awrama, from Ahmad Bin Al Nazar, from Al Noman Bin Bashir who said, ",
            "‘I was a travel companion of Jabir Bin Yazeed Al-Ju’fy. So when we were in Al-Medina, we went over to Abu Ja’far<sup>asws</sup>. Then we bade him<sup>asws</sup> farewell and went out from him<sup>asws</sup>, and he was cheerful until we came to Al-Akhirjat, it being the first stop we encamped at, from Fayd to Al-Medina, on the day of Friday. So we prayed the midday Salat.  So when the camel rose with us, I found that I was with a tall brown man, with him was a letter. So, he gave it to Jabir and Jabir took it, and kissed it and place it upon his eyes, and it was from Muhammad Bin Ali<sup>asws</sup> to Jabir Bin Yazeed, and its black ink was still wet. ",
            "So he said to him, ‘When did my Master<sup>asws</sup> pact with you?’ So he said, ‘Just now’. So he said to him, ‘Before the Salat or after the Salat?’ So he said, ‘After the Salat’. So he broke the seal and started reading it and his face strained until he came to the end of it. Then he withheld the letter, and I did not see him laugh nor cheerful until we came to Al-Kufa. So when we arrived at Al-Kufa, it was night. So I slept my night, and when it was the morning I went over to him, determined for it, but I found him to have come out to me, and in his neck were ankle bones handing upon it, and he was riding upon reeds and he was saying, ‘I find Mansour Bin Jamhour as an Emir without followers’, and couplets approximate to these. ",
            "So I looked at his face and kept on looking at his face, but he did not say anything to me, and I did not speak to him, and I turned around crying due to what I saw him in, and the children and people gathered around me and around him. And he went until he entered Al-Rahba, and he went on in circles along with the children, and the people were saying, ‘Jabir Bin Yazeed has gone mad’. ",
            "So, by Allah<sup>azwj</sup>, not many days had passed by until there came a letter of Hisham Bin Abdul Malik (the Caliph) to his governor, ‘Look for a man call Jabir Bin Yazeed Al-Ju’fy, and strike off his neck, and send his neck to me’. So he (the governor) turned around to his gatherers and said to them, ‘Who is Jabir Bin Yazeed Al-Ju’fy?’ They said, ‘May Allah<sup>azwj</sup> Keep you well! He used to be a man who had knowledge for him and merits, and Ahadeeth, and (performance of) Hajj. But he went mad, and he is that one in Al-Rahba along with the children, upon the reeds, playing with them’. ",
            "He (the narrator) said, ‘So he (the governor) looked at him, and there he was, playing along with the children upon the reeds. So he said, ‘The Praise is for Allah<sup>azwj</sup> Who Excused me from killing him’. ",
            "He (the narrator) said, ‘And not many days had passed by until Mansour Bin Jamhour (the governor) entered Al-Kufa and did what Jabir was saying’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Muhammad has narrated from Salih ibn abu Hammad from Muhammad ibn ’Urma from Ahmad ibn al-Nadr from al-Ni‘man ibn Bashir who has said the following. “Once I was a companion of Jabir ibn Yazid al-Ja‘far‘fi on a journey. When reached he went to meet abu Ja‘far (a.s.). He said farewell to him and came out very happy until we arrived in al-’Ukhayraja, the first length of journey from Fayd to Madina. It was a Friday. We said our prayers at noon. When the camel rose to leave I saw a tall man brownish with a letter. He give it to Jabir who kissed it and placed over his eyes. It was from Muhammad ibn Ali to Jabir ibn Yazid. It had a black ink that was still wet. He asked him, “When were you in the presence of my master?” He said, “Just now.” He asked, “Were you in his presence before or after the prayer?” He said, “I was there after the prayer.” He then opened the seal and began to read the letter and his face began to look strained until he read it to the end. He held the letter and I did not see him laughing or happy until we arrived in Kufa. In Kufa I spent my night and in the morning I went to see him out of respect for him and I found him coming out to me with a large ring made of anklebones around his neck riding on a twig of reeds saying. “I see Mansur ibn Jumhur a ruler but no one obeys him” and such other rhymes. He looked at me and I looked at him and he did not say anything to me and did not say anything to him. I began to weep when I saw him. Children and people gathered around us. He came in al-Rahba and would go in circles with the children and people say, “Jabir has gone mad, Jabir has gone insane. By Allah, only a few days had passed that a letter from Hisham ibn ‘Abd al-Malik came to the governor to look for a man called Jabir ibn Yazid al-Ja‘far‘fi. It said, “Kill him and send his head to me.” The governor turned to the people in his court and asked, “Who is this Jabir ibn Yazid al-Ja‘far‘fi?” they replied, “May Allah grand well being to the governor, he was a man of knowledge, excellence, hadith and Hajj but now he has become insane. He is there with the children riding on a twig of reeds plays with them.” He went to see him and found him playing with the children while riding a twig of reeds. He said, “Thanks to Allah for saving me from killing him.” The narrator has said that just within few days Mansur ibn Jumhur entered Kufa and did what Jabir was speaking of before.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:98",
  "kind": "verse_list"
}