{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 99"}, "path": "/books/al-kafi:1:4:99", "titles": {"ar": "باب فِي الْأَئِمَّةِ ( عليهم السلام ) أَنَّهُمْ إِذَا ظَهَرَ أَمْرُهُمْ حَكَمُوا بِحُكْمِ دَاوُدَ وَ آلِ دَاوُدَ وَ لَا يَسْأَلُونَ الْبَيِّنَةَ عَلَيْهِمُ السَّلَامُ وَ الرَّحْمَةُ وَ الرِّضْوَانُ", "en": "Chapter 99 – Regarding the Imams<sup>asws</sup> that they<sup>asws</sup>, when their<sup>asws</sup> command appears, they<sup>asws</sup> would be judging by the judgment of Dawood<sup>as</sup> and the Progeny of Dawood<sup>as</sup>, and they<sup>asws</sup> would not be asking for the proof, upon them<sup>asws</sup> be the greetings, and the Mercy, and the (Divine) Pleasure."}}], "index": 157, "local_index": 99, "part_type": "Chapter", "path": "/books/al-kafi:1:4:99", "titles": {"ar": "باب فِي الْأَئِمَّةِ ( عليهم السلام ) أَنَّهُمْ إِذَا ظَهَرَ أَمْرُهُمْ حَكَمُوا بِحُكْمِ دَاوُدَ وَ آلِ دَاوُدَ وَ لَا يَسْأَلُونَ الْبَيِّنَةَ عَلَيْهِمُ السَّلَامُ وَ الرَّحْمَةُ وَ الرِّضْوَانُ", "en": "Chapter 99 – Regarding the Imams<sup>asws</sup> that they<sup>asws</sup>, when their<sup>asws</sup> command appears, they<sup>asws</sup> would be judging by the judgment of Dawood<sup>as</sup> and the Progeny of Dawood<sup>as</sup>, and they<sup>asws</sup> would not be asking for the proof, upon them<sup>asws</sup> be the greetings, and the Mercy, and the (Divine) Pleasure."}, "verse_count": 5, "verse_start_index": 1033, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 1034, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:99:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مَنْصُورٍ عَنْ فَضْلٍ الْأَعْوَرِ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ كُنَّا زَمَانَ أَبِي جَعْفَرٍ ( عليه السلام ) حِينَ قُبِضَ نَتَرَدَّدُ كَالْغَنَمِ لَا رَاعِيَ لَهَا فَلَقِينَا سَالِمَ بْنَ أَبِي حَفْصَةَ فَقَالَ لِي يَا أَبَا عُبَيْدَةَ مَنْ إِمَامُكَ فَقُلْتُ أَئِمَّتِي آلُ مُحَمَّدٍ فَقَالَ هَلَكْتَ وَ أَهْلَكْتَ أَ مَا سَمِعْتُ أَنَا وَ أَنْتَ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ مَنْ مَاتَ وَ لَيْسَ عَلَيْهِ إِمَامٌ مَاتَ مِيتَةً جَاهِلِيَّةً فَقُلْتُ بَلَى لَعَمْرِي ", "وَ لَقَدْ كَانَ قَبْلَ ذَلِكَ بِثَلَاثٍ أَوْ نَحْوِهَا دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَرَزَقَ اللَّهُ الْمَعْرِفَةَ فَقُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ سَالِماً قَالَ لِي كَذَا وَ كَذَا قَالَ فَقَالَ يَا أَبَا عُبَيْدَةَ إِنَّهُ لَا يَمُوتُ مِنَّا مَيِّتٌ حَتَّى يُخَلِّفَ مِنْ بَعْدِهِ مَنْ يَعْمَلُ بِمِثْلِ عَمَلِهِ وَ يَسِيرُ بِسِيرَتِهِ وَ يَدْعُو إِلَى مَا دَعَا إِلَيْهِ ", "يَا أَبَا عُبَيْدَةَ إِنَّهُ لَمْ يُمْنَعْ مَا أُعْطِيَ دَاوُدَ أَنْ أُعْطِيَ سُلَيْمَانَ ثُمَّ قَالَ يَا أَبَا عُبَيْدَةَ إِذَا قَامَ قَائِمُ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) حَكَمَ بِحُكْمِ دَاوُدَ وَ سُلَيْمَانَ لَا يَسْأَلُ بَيِّنَةً ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Mansour, from Fazl Al Awry, from Abu Ubeyda Al Haza’a who said, ", "‘We were in the time period when Abu Ja’far<sup>asws</sup> passed away. We were wavering like the sheep with no shepherd for them. So we met Salim Bin Abu Hafsa, and he said to me, ‘O Abu Ubeyda! Who is your Imam<sup>asws</sup>?’ So I said, ‘My Imams<sup>asws</sup> are the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’. So he said, ‘You are destroyed and will cause others to be destroyed. Did I and you not hear Abu Ja’far<sup>asws</sup> saying: ‘The one who dies and there isn’t an Imam<sup>asws</sup> over him, died the death of the Pre-Islamic period?’ So I said, ‘Yes, by my life’. ", "And that had been three days before I went over to Abu Abdullah<sup>asws</sup>, and Allah<sup>azwj</sup> Graced me with the recognition. So I said to Abu Abdullah<sup>asws</sup>, ‘Salim said to me, such and such’. So he<sup>asws</sup> said: ‘O Abu Ubeyda! It is such that he<sup>asws</sup> does not die from us<sup>asws</sup>, and dying one, until there replaces him<sup>asws</sup> from after him<sup>asws</sup>, the one<sup>asws</sup> who does similar to his<sup>asws</sup> deeds, and by a way of his<sup>asws</sup> ways, and calls to what he<sup>asws</sup> used to call to. ", "O Abu Ubeyda! It was not prevented, what was Given to Dawood<sup>as</sup> that it be Given to Suleyman<sup>as</sup>’. Then he<sup>asws</sup> said: ‘When the Qaim<sup>asws</sup> of the Progeny<sup>asws</sup> Muhammad<sup>saww</sup> rises, he<sup>asws</sup> would judge by the judgment of Dawood<sup>as</sup> and Suleyman<sup>asws</sup>, not asking for proof’."]}}, {"index": 1035, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:99:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَا تَذْهَبُ الدُّنْيَا حَتَّى يَخْرُجَ رَجُلٌ مِنِّي يَحْكُمُ بِحُكُومَةِ آلِ دَاوُدَ وَ لَا يَسْأَلُ بَيِّنَةً يُعْطِي كُلَّ نَفْسٍ حَقَّهَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Aban who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The world will not go away until there comes out a man from me<sup>asws</sup>, judging by the judgment of the Progeny of Dawood<sup>as</sup>, and not asking for proof, giving every soul its right’."]}}, {"index": 1036, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:99:3", "text": ["مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ عَمَّارٍ السَّابَاطِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) بِمَا تَحْكُمُونَ إِذَا حَكَمْتُمْ قَالَ بِحُكْمِ اللَّهِ وَ حُكْمِ دَاوُدَ فَإِذَا وَرَدَ عَلَيْنَا الشَّيْ‏ءُ الَّذِي لَيْسَ عِنْدَنَا تَلَقَّانَا بِهِ رُوحُ الْقُدُسِ ."], "translations": {"en.hubeali": ["Muhammad, from Ahmad Bin Muhammad, from Ibn Mahboub, from Hisham Bin Salim, from Ammar Al Sabbaty who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘With what are you<sup>asws</sup> judging with when you<sup>asws</sup> are judging?’ He<sup>asws</sup> said: ‘By the Judgment of Dawood<sup>as</sup>. So when the thing is referred to us<sup>asws</sup> which isn’t with us<sup>asws</sup>, we<sup>asws</sup> receive it by the Holy Spirit’."]}}, {"index": 1037, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:99:4", "text": ["مُحَمَّدُ بْنُ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ عِمْرَانَ بْنِ أَعْيَنَ عَنْ جُعَيْدٍ الْهَمْدَانِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ سَأَلْتُهُ بِأَيِّ حُكْمٍ تَحْكُمُونَ قَالَ حُكْمِ آلِ دَاوُدَ فَإِنْ أَعْيَانَا شَيْ‏ءٌ تَلَقَّانَا بِهِ رُوحُ الْقُدُسِ ."], "translations": {"en.hubeali": ["Muhammad Bin Ahmad, from Muhammad Bin Khalid, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Imran Bin Ayn, from Jueyd Al Hamdany, ", "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, said, ‘I asked him<sup>asws</sup>, ‘With which Judgment are you<sup>asws</sup> judging?’ He<sup>asws</sup> said: ‘Judgment of the Progeny of Dawood<sup>as</sup>. So if something isn’t with us<sup>asws</sup>, we<sup>asws</sup> receive it by the Holy Spirit’."]}}, {"index": 1038, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:99:5", "text": ["أَحْمَدُ بْنُ مِهْرَانَ رَحِمَهُ اللَّهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ عَمَّارٍ السَّابَاطِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا مَنْزِلَةُ الْأَئِمَّةِ قَالَ كَمَنْزِلَةِ ذِي الْقَرْنَيْنِ وَ كَمَنْزِلَةِ يُوشَعَ وَ كَمَنْزِلَةِ آصَفَ صَاحِبِ سُلَيْمَانَ ", "قَالَ فَبِمَا تَحْكُمُونَ قَالَ بِحُكْمِ اللَّهِ وَ حُكْمِ آلِ دَاوُدَ وَ حُكْمِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ يَتَلَقَّانَا بِهِ رُوحُ الْقُدُسِ ."], "translations": {"en.hubeali": ["Ahmad Bin Mihran, from Muhammad Bin Ali, from Ibn Mahboub, from Hisham Bin Salim, from Ammar Al Sabaty who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is the status of the Imams<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Like the status of Zulqarnayn<sup>as</sup>, and like the status of Yoshua<sup>as</sup>, and like the status of Asif<sup>as</sup>, companion of Suleymen<sup>as</sup>’. ", "He (the narrator) said, ‘So with what are you<sup>asws</sup> all (Imams<sup>asws</sup>) judging?’ He<sup>asws</sup> said: ‘By the Judgment of Allah<sup>azwj</sup>, and judgment of the Progeny of Dawood<sup>as</sup>, and judgment of Muhammad<sup>saww</sup>, and we<sup>asws</sup> receive it by the Holy Spirit’."]}}]}, "index": "al-kafi:1:4:99", "kind": "verse_list"}