{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 5"}, "path": "/books/al-kafi:6:5", "titles": {"ar": "كتاب الذَّبَائِحِ", "en": "THE BOOK OF SLAUGHTERED (ANIMALS)"}}, {"indexed_titles": {"en": "Chapter 15"}, "path": "/books/al-kafi:6:5:15", "titles": {"ar": "باب ذَبَائِحِ أَهْلِ الْكِتَابِ", "en": "Chapter 15 – Slaughters by of the People of the Book"}}], "index": 1726, "local_index": 15, "part_type": "Chapter", "path": "/books/al-kafi:6:5:15", "titles": {"ar": "باب ذَبَائِحِ أَهْلِ الْكِتَابِ", "en": "Chapter 15 – Slaughters by of the People of the Book"}, "verse_count": 17, "verse_start_index": 11302, "verses": [{"index": 11303, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ مُفَضَّلِ بْنِ صَالِحٍ عَنْ زَيْدٍ الشَّحَّامِ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَبِيحَةِ الذِّمِّيِّ فَقَالَ لَا تَأْكُلْهُ إِنْ سَمَّى وَ إِنْ لَمْ يُسَمِّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Mufazzal Bin Salih, from Zayd Al Shahham who said, \n‘Abu Abdullah<sup>asws</sup> was asked about a slaughter by the <span class=\"iTxt\">Zimmy</span> (people under the responsibility). So he<sup>asws</sup> said: ‘Do not eat it, whether he has Named (<span class=\"iTxt\">Bismillah</span>) or if he has not Named (<span class=\"iTxt\">Bismillah</span>)’."}]}, {"index": 11304, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنِ الْحُسَيْنِ بْنِ الْمُنْذِرِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّا قَوْمٌ نَخْتَلِفُ إِلَى الْجَبَلِ وَ الطَّرِيقُ بَعِيدٌ بَيْنَنَا وَ بَيْنَ الْجَبَلِ فَرَاسِخُ فَنَشْتَرِي الْقَطِيعَ وَ الِاثْنَيْنِ وَ الثَّلَاثَةَ وَ يَكُونُ فِي الْقَطِيعِ أَلْفٌ وَ خَمْسُمِائَةِ شَاةٍ وَ أَلْفٌ وَ سِتُّمِائَةِ شَاةٍ وَ أَلْفٌ وَ سَبْعُمِائَةِ شَاةٍ فَتَقَعُ الشَّاةُ وَ الِاثْنَتَانِ وَ الثَّلَاثَةُ فَنَسْأَلُ الرُّعَاةَ الَّذِينَ يَجِيئُونَ بِهَا عَنْ أَدْيَانِهِمْ فَيَقُولُونَ نَصَارَى \nقَالَ فَقُلْتُ أَيُّ شَيْ‏ءٍ قَوْلُكَ فِي ذَبِيحَةِ الْيَهُودِ وَ النَّصَارَى فَقَالَ يَا حُسَيْنُ الذَّبِيحَةُ بِالِاسْمِ وَ لَا يُؤْمَنُ عَلَيْهَا إِلَّا أَهْلُ التَّوْحِيدِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Hanan Bin Sudeyr, from Al Husayn Bin Al Munzar who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘We are a people interchanging to the mountains, and the road is remote between us and the mountain, (many) <span class=\"iTxt\">Farsakhs</span> (units of distance). So we buy the flock, and the two (flocks) and the three (flocks), and there happen to be in the flock one thousand five hundred sheep, and one thousand six hundred sheep, and one thousand seven hundred sheep. So one sheep, or two, or three are cut. So we ask the shepherds who come with these about their religion, so they are saying, ‘(They are) Christians’. \nHe (the narrator) said, ‘So I said, ‘What would your<sup>asws</sup> say regarding a slaughter by the Jews and the Christians?’ So he<sup>asws</sup> said: ‘O Husayn! The slaughtered animal by the Naming (<span class=\"iTxt\">Bismillah</span>), and there is no reliability over it except for the People of the Oneness (<span class=\"iTxt\">Twaheed</span>)’."}]}, {"index": 11305, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:3", "text": "وَ عَنْهُ عَنْ حَنَانٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الْحُسَيْنَ بْنَ الْمُنْذِرِ رَوَى عَنْكَ أَنَّكَ قُلْتَ إِنَّ الذَّبِيحَةَ بِالِاسْمِ وَ لَا يُؤْمَنُ عَلَيْهَا إِلَّا أَهْلُهَا فَقَالَ إِنَّهُمْ أَحْدَثُوا فِيهَا شَيْئاً لَا أَشْتَهِيهِ \nقَالَ حَنَانٌ فَسَأَلْتُ نَصْرَانِيّاً فَقُلْتُ لَهُ أَيُّ شَيْ‏ءٍ تَقُولُونَ إِذَا ذَبَحْتُمْ فَقَالَ نَقُولُ بِاسْمِ الْمَسِيحِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And from him, from Hanan who said, \n‘I said to Abu Abdullah<sup>asws</sup> that Al-Husayn Bin Al-Munzar reported from you<sup>asws</sup> that you<sup>asws</sup> said that the slaughter is by the Naming (<span class=\"iTxt\">Bismillah</span>), and there is no reliability over it except for its rightful ones’. So he<sup>asws</sup> said; ‘They are narrating something in it I<sup>asws</sup> did not desire it’. \nHanan (the narrator) said, ‘So I asked a Christian, so I said to him, ‘Which thing are you saying when you slaughter?’ So he said, ‘We are saying, ‘In the name of the Messiah<sup>as</sup>’."}]}, {"index": 11306, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ نَصَارَى الْعَرَبِ أَ تُؤْكَلُ ذَبِيحَتُهُمْ فَقَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَنْهَى عَنْ ذَبَائِحِهِمْ وَ صَيْدِهِمْ وَ مُنَاكَحَتِهِمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, \n(The narrator) says, ‘I asked Abu Ja’far<sup>asws</sup> about a Christian Arabs, can I eat their slaughters?’ So he<sup>asws</sup> said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> had forbidden from their slaughters, and their hunted preys, and inter-marrying with them’."}]}, {"index": 11307, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي الْمَغْرَاءِ عَنْ سَمَاعَةَ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ ذَبِيحَةِ الْيَهُودِيِّ وَ النَّصْرَانِيِّ فَقَالَ لَا تَقْرَبُوهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abu Al Magra, from Sama’at, \n(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> a slaughter by the Jews and the Christians. So he<sup>asws</sup> said: ‘Do not go near it’."}]}, {"index": 11308, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّا نَكُونُ بِالْجَبَلِ فَنَبْعَثُ الرُّعَاةَ فِي الْغَنَمِ فَرُبَّمَا عَطِبَتِ الشَّاةُ أَوْ أَصَابَهَا الشَّيْ‏ءُ فَيَذْبَحُونَهَا فَنَأْكُلُهَا فَقَالَ ( عليه السلام ) هِيَ الذَّبِيحَةُ وَ لَا يُؤْمَنُ عَلَيْهَا إِلَّا مُسْلِمٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Hammad Bin Isa, from Al Husayn Bin Al Mukhtar, from Al Husayn Bin Abdullah who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘We happen to be at the mountain, so we send shepherds regarding the sheep. So, sometimes the sheep is injured, or something hits it, so they are slaughtering it, so we eat it’. So he<sup>asws</sup> said: ‘It is the slaughter, and do not rely upon it except for a Muslim’."}]}, {"index": 11309, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:7", "text": "وَ عَنْهُ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ قَالَ اصْطَحَبَ الْمُعَلَّى بْنُ خُنَيْسٍ وَ ابْنُ أَبِي يَعْفُورٍ فِي سَفَرٍ فَأَكَلَ أَحَدُهُمَا ذَبِيحَةَ الْيَهُودِ وَ النَّصَارَى وَ أَبَى الْآخَرُ عَنْ أَكْلِهَا فَاجْتَمَعَا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَأَخْبَرَاهُ فَقَالَ أَيُّكُمَا الَّذِي أَبَى قَالَ أَنَا قَالَ أَحْسَنْتَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And from him, from Hammad Bin Isa, from Al Husayn Bin Al Mukhtar, from Al Husayn Bin Abdullah who said, \n‘Al-Moala Bin Khunays and Ibn Abu Yafour accompanied each other in a journey. So one of them ate a slaughter by the Jew and the Christian, and the other one refused from eating it. So they both gathered in the presence of Abu Abdullah<sup>asws</sup> and informed him<sup>asws</sup>. So he<sup>asws</sup> said: ‘Which one of you two refused?’ He said, ‘I did’. He<sup>asws</sup>: ‘Well done’."}]}, {"index": 11310, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:8", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ الْأَحْمَسِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لَهُ رَجُلٌ أَصْلَحَكَ اللَّهُ إِنَّ لَنَا جَاراً قَصَّاباً فَيَجِي‏ءُ بِيَهُودِيٍّ فَيَذْبَحُ لَهُ حَتَّى يَشْتَرِيَ مِنْهُ الْيَهُودُ فَقَالَ لَا تَأْكُلْ مِنْ ذَبِيحَتِهِ وَ لَا تَشْتَرِ مِنْهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Husayn Al Ahmasy, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! There is a neighbour of ours, a butcher, so a Jew comes over to him and slaughters for him so that the Jews buy from him’. So he<sup>asws</sup> said: ‘Do not eat from his slaughter, and do not buy from him’."}]}, {"index": 11311, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:9", "text": "ابْنُ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ الْأَحْمَسِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ هُوَ الِاسْمُ فَلَا يُؤْمَنُ عَلَيْهِ إِلَّا مُسْلِمٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ibn Abu Umeyr, from Al Husayn Al Ahmasy, \n(It has been narrated) from Ibn Abu Abdullah<sup>asws</sup> having said: ‘It (slaughtering is upon) the Naming (<span class=\"iTxt\">Bismillah</span>), therefore none can be relied upon except for a Muslim’."}]}, {"index": 11312, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:10", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ قُتَيْبَةَ الْأَعْشَى قَالَ سَأَلَ رَجُلٌ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا عِنْدَهُ فَقَالَ لَهُ الْغَنَمُ يُرْسَلُ فِيهَا الْيَهُودِيُّ وَ النَّصْرَانِيُّ فَتَعْرِضُ فِيهَا الْعَارِضَةُ فَيَذْبَحُ أَ نَأْكُلُ ذَبِيحَتَهُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا تُدْخِلْ ثَمَنَهَا مَالَكَ وَ لَا تَأْكُلْهَا فَإِنَّمَا هُوَ الِاسْمُ وَ لَا يُؤْمَنُ عَلَيْهِ إِلَّا مُسْلِمٌ \nفَقَالَ لَهُ الرَّجُلُ قَالَ اللَّهُ تَعَالَى الْيَوْمَ أُحِلَّ لَكُمُ الطَّيِّباتُ وَ طَعامُ الَّذِينَ أُوتُوا الْكِتابَ حِلٌّ لَكُمْ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ أَبِي ( عليه السلام ) يَقُولُ إِنَّمَا هُوَ الْحُبُوبُ وَ أَشْبَاهُهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar,f rom Muhammad Bin Ismail, from Ali Bin Al Noman, from Ibn Muskan, from Quteyba Al A’asha who said, \n‘A man asked Abu Abdullah<sup>asws</sup> and I was in his<sup>asws</sup> presence, so he said to him<sup>asws</sup>, ‘The flock in which the Jews and the Christians are sent, so the exhibitors present therein, so he slaughters, can we eat his slaughter?’ So Abu Abdullah<sup>asws</sup> said: ‘Do not include its price in your wealth and do not eat it, for rather, it is the Naming (<span class=\"iTxt\">Bismillah</span>), and none can be relied over it except for a Muslim’. \nSo the man said to him<sup>asws</sup>, ‘Allah<sup>azwj</sup> the High Says <span class=\"ibTxt\">[5:5] This day (all) the good things are Permissible for you; and the food of those who have been Given the Book is lawful for you and your food is lawful for them</span>’. So, Abu Abdullah<sup>asws</sup> said to him: ‘My<sup>asws</sup> father<sup>asws</sup> was saying: ‘But rather, it is the grains and its like’."}]}, {"index": 11313, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:11", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ وَ عَبْدِ اللَّهِ بْنِ طَلْحَةَ قَالَ ابْنُ سِنَانٍ قَالَ إِسْمَاعِيلُ بْنُ جَابِرٍ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا تَأْكُلْ مِنْ ذَبَائِحِ الْيَهُودِ وَ النَّصَارَى وَ لَا تَأْكُلْ فِي آنِيَتِهِمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from yaqoub Bin Yazeed, from Muhammad Bin Sinan, from Ismail Bin Jabir, and Abdullah Bin Talha, from Ibn Sinan, from Ismail Bin Jabir who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘Do not eat from the slaughter of the Jews and the Christians, and do not eat in their vessels’."}]}, {"index": 11314, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:12", "text": "عَنْهُ عَنِ ابْنِ سِنَانٍ عَنْ قُتَيْبَةَ الْأَعْشَى قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَبَائِحِ الْيَهُودِ وَ النَّصَارَى فَقَالَ الذَّبِيحَةُ اسْمٌ وَ لَا يُؤْمَنُ عَلَى الِاسْمِ إِلَّا مُسْلِمٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ibn Sinan, from Quteyba Al A’asha who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the slaughters of the Jews and the Christians. So he<sup>asws</sup> said: ‘The slaughter is Naming (<span class=\"iTxt\">Bismillah</span>), and none can be relied upon for the Naming (<span class=\"iTxt\">Bismillah</span>) except a Muslim’."}]}, {"index": 11315, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:13", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا تَأْكُلْ ذَبَائِحَهُمْ وَ لَا تَأْكُلْ فِي آنِيَتِهِمْ يَعْنِي أَهْلَ الْكِتَابِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ismail Bin Jabir who said, \n‘Abu Abdullah<sup>asws</sup> said to me: ‘Do not eat their slaughters, nor eat in their vessels, meaning the People of the Book’."}]}, {"index": 11316, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:14", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَبَائِحِ أَهْلِ الْكِتَابِ فَقَالَ لَا بَأْسَ إِذَا ذَكَرُوا اسْمَ اللَّهِ عَزَّ وَ جَلَّ وَ لَكِنِّي أَعْنِي مِنْهُمْ مَنْ يَكُونُ عَلَى أَمْرِ مُوسَى وَ عِيسَى ( عليهما السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, fromYunus, from Muawiya Bin Wahab who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the slaughters of the People of the Book. So he<sup>asws</sup> said: ‘There is no problem when they mentioned the Name of Allah<sup>azwj</sup> Mighty and Majestic, but I<sup>asws</sup> mean from them the ones who happen to be upon the commands of Musa<sup>as</sup> and Isa<sup>as</sup>’."}]}, {"index": 11317, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:15", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَنَانِ بْنِ سَدِيرٍ قَالَ دَخَلْنَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَا وَ أَبِي فَقُلْنَا لَهُ جَعَلَنَا اللَّهُ فِدَاكَ إِنَّ لَنَا خُلَطَاءَ مِنَ النَّصَارَى وَ إِنَّا نَأْتِيهِمْ فَيَذْبَحُونَ لَنَا الدَّجَاجَ وَ الْفِرَاخَ وَ الْجِدَاءَ أَ فَنَأْكُلُهَا قَالَ فَقَالَ لَا تَأْكُلُوهَا وَ لَا تَقْرَبُوهَا فَإِنَّهُمْ يَقُولُونَ عَلَى ذَبَائِحِهِمْ مَا لَا أُحِبُّ لَكُمْ أَكْلَهَا \nقَالَ فَلَمَّا قَدِمْنَا الْكُوفَةَ دَعَانَا بَعْضُهُمْ فَأَبَيْنَا أَنْ نَذْهَبَ فَقَالَ مَا بَالُكُمْ كُنْتُمْ تَأْتُونَّا ثُمَّ تَرَكْتُمُوهُ الْيَوْمَ قَالَ فَقُلْنَا إِنَّ عَالِماً لَنَا ( عليه السلام ) نَهَانَا وَ زَعَمَ أَنَّكُمْ تَقُولُونَ عَلَى ذَبَائِحِكُمْ شَيْئاً لَا يُحِبُّ لَنَا أَكْلَهَا فَقَالَ مَنْ هَذَا الْعَالِمُ هَذَا وَ اللَّهِ أَعْلَمُ النَّاسِ وَ أَعْلَمُ مَنْ خَلَقَ اللَّهُ صَدَقَ وَ اللَّهِ إِنَّا لَنَقُولُ بِسْمِ الْمَسِيحِ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hanan Bin Sudeyr who said, \n‘We went over to Abu Abdullah<sup>asws</sup>, my father and myself. So we said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Make us to be sacrificed for you<sup>asws</sup>! For us are a mixture of Christians, and we go to them, so they are slaughtering for us the poultry, and the chicken and the goats. Can we eat these?’ So he<sup>asws</sup> said: ‘Do not eat these, and do not go near these, for they are saying upon their slaughters what I<sup>asws</sup> do not like for you all to eat it’. \nHe (the narrator) said, ‘So when we proceeded to Al-Kufa, one of them invited us over, so we refused. So he said, ‘What is the matter with you? You used to come to us then you are leaving it today?’ So we said, ‘A knowledgeable one<sup>asws</sup> of ours has forbidden us, and he<sup>asws</sup> claims that you are saying upon your slaughters something that he<sup>asws</sup> does not like for us to eat it’. So he said, ‘Who is this knowledgeable one<sup>asws</sup>? By Allah<sup>azwj</sup>! He<sup>asws</sup> is the most knowledgeable of the people, and the most knowledgeable one whom Allah<sup>azwj</sup> Created. By Allah<sup>azwj</sup>! He<sup>asws</sup> spoke the truth, we are saying ‘In the name of the Messiah<sup>as</sup>’."}]}, {"index": 11318, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:16", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِهِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَبِيحَةِ أَهْلِ الْكِتَابِ قَالَ فَقَالَ وَ اللَّهِ مَا يَأْكُلُونَ ذَبَائِحَكُمْ فَكَيْفَ تَسْتَحِلُّونَ أَنْ تَأْكُلُوا ذَبَائِحَهُمْ إِنَّمَا هُوَ الِاسْمُ وَ لَا يُؤْمَنُ عَلَيْهَا إِلَّا مُسْلِمٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of our companions who said, \n‘I asked Abu Abdullah<sup>asws</sup> about a slaughter by the People of the Book. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! They are not eating from your slaughters, so how are you permitting yourselves that you eat their slaughters? But rather, it is the naming (<span class=\"iTxt\">Bismillah</span>), and none can be relied over it except for a Muslim’."}]}, {"index": 11319, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:6:5:15:17", "text": "بَعْضُ أَصْحَابِنَا عَنْ مَنْصُورِ بْنِ الْعَبَّاسِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ قُتَيْبَةَ الْأَعْشَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رَأَيْتُ عِنْدَهُ رَجُلًا يَسْأَلُهُ فَقَالَ إِنَّ لِي أَخاً فَيُسْلِفُ فِي الْغَنَمِ فِي الْجِبَالِ فَيُعْطِي السِّنَّ مَكَانَ السِّنِّ فَقَالَ أَ لَيْسَ بِطِيبَةِ نَفْسٍ مِنْ أَصْحَابِهِ قَالَ بَلَى قَالَ فَلَا بَأْسَ \nقَالَ فَإِنَّهُ يَكُونُ لَهُ فِيهَا الْوَكِيلُ فَيَكُونُ يَهُودِيّاً أَوْ نَصْرَانِيّاً فَتَقَعُ فِيهَا الْعَارِضَةُ فَيَبِيعُهَا مَذْبُوحَةً وَ يَأْتِيهِ بِثَمَنِهَا وَ رُبَّمَا مَلَّحَهَا فَيَأْتِيهِ بِهَا مَمْلُوحَةً قَالَ فَقَالَ إِنْ أَتَاهُ بِثَمَنِهَا فَلَا يُخَالِطْهُ بِمَالِهِ وَ لَا يُحَرِّكْهُ وَ إِنْ أَتَاهُ بِهَا مَمْلُوحَةً فَلَا يَأْكُلْهَا فَإِنَّمَا هُوَ الِاسْمُ وَ لَيْسَ يُؤْمَنُ عَلَى الِاسْمِ إِلَّا مُسْلِمٌ \nفَقَالَ لَهُ بَعْضُ مَنْ فِي الْبَيْتِ فَأَيْنَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ طَعامُ الَّذِينَ أُوتُوا الْكِتابَ حِلٌّ لَكُمْ وَ طَعامُكُمْ حِلٌّ لَهُمْ فَقَالَ إِنَّ أَبِي ( عليه السلام ) كَانَ يَقُولُ ذَلِكَ الْحُبُوبُ وَ مَا أَشْبَهَهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "One of our companions, from Mansour Bin Al Abbas, from Amro Bin Usman, from Quteyba Al A’asha, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I saw a man in his<sup>asws</sup> presence asking him<sup>asws</sup> that, ‘For me is a brother, so he stays behind among the flock in the mountain, so he gives the tooth in place of the tooth (barter)’. So he<sup>asws</sup> said: ‘Is it not in good faith from his companions?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘So there is no problem with it’. \nHe said, ‘So there happens to be a representative of his in it, and it happens to be a Jew or a Christian. So regarding the flock is an exhibition, so he sells a slaughtered (sheep), and is given its price, and sometimes it is meat, so he is given meat with it’. So he<sup>asws</sup> said: ‘If he is given its price, so he should not mix it with his wealth and he should not move it (in business), and if he is given meat with it, so he should not eat it, for rather it (slaughter) is the Naming (<span class=\"iTxt\">Bismillah</span>), and there is none reliable over the Naming (<span class=\"iTxt\">Bismillah</span>) except for a Muslim’. \nSo, someone in the room said to him<sup>asws</sup>, ‘So where are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[5:5] and the food of those who have been Given the Book is lawful for you and your food is lawful for them</span>?’ So he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> was saying: ‘That is for the grains and what resembles it’."}]}]}, "index": "al-kafi:6:5:15", "kind": "verse_list"}