{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 8"}, "path": "/books/al-kafi:6:8", "titles": {"ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ", "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "}}, {"indexed_titles": {"en": "Chapter 13"}, "path": "/books/al-kafi:6:8:13", "titles": {"ar": "باب الْقَوْلِ عِنْدَ لِبَاسِ الْجَدِيدِ", "en": "Chapter 13 – The words (to be spoken) when wearing new clothes"}}], "index": 1909, "local_index": 13, "part_type": "Chapter", "path": "/books/al-kafi:6:8:13", "titles": {"ar": "باب الْقَوْلِ عِنْدَ لِبَاسِ الْجَدِيدِ", "en": "Chapter 13 – The words (to be spoken) when wearing new clothes"}, "verse_count": 6, "verse_start_index": 12394, "verses": [{"index": 12395, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:8:13:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الرَّجُلِ يَلْبَسُ الثَّوْبَ الْجَدِيدَ قَالَ يَقُولُ اللَّهُمَّ اجْعَلْهُ ثَوْبَ يُمْنٍ وَ تُقًى وَ بَرَكَةٍ اللَّهُمَّ ارْزُقْنِي فِيهِ حُسْنَ عِبَادَتِكَ وَ عَمَلًا بِطَاعَتِكَ وَ أَدَاءَ شُكْرِ نِعْمَتِكَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَ أَتَجَمَّلُ بِهِ فِي النَّاسِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim who said, \n‘I asked Abu Ja’far<sup>asws</sup> about the man who wore the new clothes. He<sup>asws</sup> said: ‘He should be saying, ‘O Allah<sup>azwj</sup>! Make it to be a Bountiful cloth and of piety and of Blessings. O Allah<sup>azwj</sup>! Grant me in it the goodness of worshipping You<sup>azwj</sup>, and working in obedience to You<sup>asws</sup>, and being thankful for You<sup>azwj</sup> Bounties. The Praise is for Allah<sup>azwj</sup> Whom Clothed me what I cover my nakedness with and beautify with among the people’."}]}, {"index": 12396, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:8:13:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَلَّمَنِي رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا لَبِسْتُ ثَوْباً جَدِيداً أَنْ أَقُولَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مِنَ اللِّبَاسِ مَا أَتَجَمَّلُ بِهِ فِي النَّاسِ اللَّهُمَّ اجْعَلْهَا ثِيَابَ بَرَكَةٍ أَسْعَى فِيهَا لِمَرْضَاتِكَ وَ أَعْمُرُ فِيهَا مَسَاجِدَكَ \nفَقَالَ يَا عَلِيُّ مَنْ قَالَ ذَلِكَ لَمْ يَتَقَمَّصْهُ حَتَّى يَغْفِرَ اللَّهُ لَهُ وَ فِي نُسْخَةٍ أُخْرَى لَمْ يُصِبْهُ شَيْ‏ءٌ يَكْرَهُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> let me<sup>asws</sup> know: ‘Whenever you<sup>asws</sup> wear new clothes, you<sup>asws</sup> should be saying: ‘The Praise is for Allah<sup>azwj</sup> Who Clothed me<sup>asws</sup> from the clothes what I<sup>asws</sup> beautify with among the people. O Allah<sup>azwj</sup>! Make these to be clothes of Blessings, working in these according to Your<sup>azwj</sup> Pleasure and build Your<sup>azwj</sup> Masjids in these’. \nHe<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! The one who says that would not have worn his shirt but Allah<sup>azwj</sup> would have Forgiven him’. And in another copy: ‘He would not be hit by anything he dislikes’."}]}, {"index": 12397, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:8:13:3", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْهَمَذَانِيِّ عَنِ الْحُسَيْنِ بْنِ أَبِي عُثْمَانَ عَنْ خَالِدٍ الْجَوَّانِ قَالَ سَمِعْتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) يَقُولُ قَدْ يَنْبَغِي لِأَحَدِكُمْ إِذَا لَبِسَ الثَّوْبَ الْجَدِيدَ أَنْ يُمِرَّ يَدَهُ عَلَيْهِ وَ يَقُولَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَ أَتَجَمَّلُ بِهِ فِي النَّاسِ وَ أَتَزَيَّنُ بِهِ بَيْنَهُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Muhammad Bin Ali Al Hamdany, from Al Husayn Bin Abu Usman, from Khalid Al Jawwad who said, \n‘I heard Abu Al-Hassan Musa<sup>asws</sup> saying: ‘It would have been more befitting for one of you whenever he wore new clothes, that he should pass his hand over it and he should be saying, ‘The Praise is for Allah<sup>azwj</sup> Who Clothed me what I cover my nakedness with, and beautify with among the people, and adorn with between them’."}]}, {"index": 12398, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:8:13:4", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ قَرَأَ إِنَّا أَنْزَلْنَاهُ ثِنْتَيْنِ وَ ثَلَاثِينَ مَرَّةً فِي إِنَاءٍ جَدِيدٍ وَ رَشَّ بِهِ ثَوْبَهُ الْجَدِيدَ إِذَا لَبِسَهُ لَمْ يَزَلْ يَأْكُلُ فِي سَعَةٍ مَا بَقِيَ مِنْهُ سِلْكٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Salih Bin Abu Hammad, from someone else, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who recites <span class=\"ibTxt\">[97:1] We have indeed revealed this </span>thirty two times in a new utensil, and sprinkle his new clothes with it when he wears it, he would be eating in ease (plentifully) for as long as a thread from it remains’."}]}, {"index": 12399, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:8:13:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا كَسَا اللَّهُ تَعَالَى الْمُؤْمِنَ ثَوْباً جَدِيداً فَلْيَتَوَضَّأْ وَ لْيُصَلِّ رَكْعَتَيْنِ يَقْرَأُ فِيهِمَا أُمَّ الْكِتَابِ وَ آيَةَ الْكُرْسِيِّ وَ قُلْ هُوَ اللَّهُ أَحَدٌ وَ إِنَّا أَنْزَلْنَاهُ ثُمَّ لْيَحْمَدِ اللَّهَ الَّذِي سَتَرَ عَوْرَتَهُ وَ زَيَّنَهُ فِي النَّاسِ وَ لْيُكْثِرْ مِنْ قَوْلِ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ فَإِنَّهُ لَا يَعْصِي اللَّهَ فِيهِ وَ لَهُ بِكُلِّ سِلْكٍ فِيهِ مَلَكٌ يُقَدِّسُ لَهُ وَ يَسْتَغْفِرُ لَهُ وَ يَتَرَحَّمُ عَلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, from Muhammad Bin Muslim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Whenever Allah<sup>azwj</sup> Clothes a Believer with new clothes, so let him perform ablution, and let him Pray two cycles reciting in both of these the Mother of the Book (Chapter 1 – <span class=\"iTxt\">Surah Al-Fatiha</span>), and The Verse of the Chair (Chapter 2:255 <span class=\"iTxt\">Ayat Al-Kursy</span>), and <span class=\"ibTxt\">[112:1] Say: He Allah is One</span> (<span class=\"iTxt\">Surah Al-Ikhlaas</span>), and <span class=\"ibTxt\">[97:1] We have indeed revealed this</span> (Chapter 97). Then let him Praise Allah<sup>azwj</sup> Who Veiled his nakedness, and Adorned him among the people, and let him frequently say, ‘There is no Might or power except with Allah<sup>azwj</sup>’, so he would not disobey Allah<sup>azwj</sup> in it, and for him would be an Angel for every thread in it, Sanctifying Allah<sup>azwj</sup> for him, and seeking Forgiveness for him, and beseeching for Mercy to be upon him’."}]}, {"index": 12400, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:8:13:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ الْحُسَيْنِ النَّيْسَابُورِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الرَّيَّانِ عَنْ يُونُسَ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ أَرَدْتُ الدُّخُولَ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَلَبِسْتُ ثِيَابِي وَ نَشَرْتُ طَيْلَسَاناً جَدِيداً كُنْتُ مُعْجَباً بِهِ فَزَحَمَنِي جَمَلٌ فِي بَعْضِ الطَّرِيقِ فَتَمَزَّقَ مِنْ كُلِّ وَجْهٍ فَاغْتَمَمْتُ لِذَلِكَ \nفَدَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَنَظَرَ إِلَى الطَّيْلَسَانِ فَقَالَ لِي مَا لِي أَرَاكَ مُنْهَتِكاً فَأَخْبَرْتُهُ بِالْقِصَّةِ فَقَالَ يَا عُمَرُ إِذَا لَبِسْتَ ثَوْباً جَدِيداً فَقُلْ لَا إِلَهَ إِلَّا اللَّهُ مُحَمَّدٌ رَسُولُ اللَّهِ تَبْرَأْ مِنَ الْآفَةِ وَ إِذَا أَحْبَبْتَ شَيْئاً فَلَا تُكْثِرْ مِنْ ذِكْرِهِ فَإِنَّ ذَلِكَ مِمَّا يَهُدُّكَ وَ إِذَا كَانَتْ لَكَ إِلَى رَجُلٍ حَاجَةٌ فَلَا تَشْتِمْهُ مِنْ خَلْفِهِ فَإِنَّ اللَّهَ يُوقِعُ ذَلِكَ فِي قَلْبِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ali Bin Al Husayn Al Neyshapouri, form Abdullah Bin Muhammad, from Ali Bin Al Rayyan, from Yunus, from Umar Bin Yazeed who said, \n‘I wanted to go over to Abu Abdullah<sup>asws</sup>, so I wore my clothes and displayed my new pallium which I was fascinated with. So a camel squeezed me in one of the streets, so it ruptured from every direction. Thus I was gloomy due to that.\nSo I came over to Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> looked at my pallium, so he<sup>asws</sup> said to me: ‘What is the matter I<sup>asws</sup> see you with torn clothes?’ So I informed him with the story. So he<sup>asws</sup> said: ‘O Umar! Whenever you wear new clothes, so say, ‘There is no god except for Allah<sup>azwj</sup>, Muhammad<sup>saww</sup> is His<sup>azwj</sup> Rasool<sup>saww</sup>’, you would be free from the misfortunes; and whenever you love something so do not mention it frequently, for that is from what crushes you; and whenever there is a need for you to a man, so do not insult him from his behind, for Allah<sup>azwj</sup> would Make that to occur in his heart’."}]}]}, "index": "al-kafi:6:8:13", "kind": "verse_list"}