{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:6:8:18",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب أَلْوَانِ النِّعَالِ</span>",
          "en": "Chapter 18 – The colour of the sandals"
        }
      }
    ],
    "index": 1923,
    "local_index": 18,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:6:8:19",
        "titles": {
          "ar": "باب الْخُفِّ",
          "en": "Chapter 19 – The Socks"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:6:8:17",
        "titles": {
          "ar": "باب الِاحْتِذَاءِ",
          "en": "Chapter 17 – The Footwear"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:8:18",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب أَلْوَانِ النِّعَالِ</span>",
      "en": "Chapter 18 – The colour of the sandals"
    },
    "verse_count": 7,
    "verse_start_index": 12440,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/349)"
        ],
        "index": 12441,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:18:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ نَظَرَ إِلَى بَعْضِ أَصْحَابِهِ وَ عَلَيْهِ نَعْلٌ سَوْدَاءُ فَقَالَ مَا لَكَ وَ لِلنَّعْلِ السَّوْدَاءِ أَ مَا عَلِمْتَ أَنَّهَا تُضِرُّ بِالْبَصَرِ وَ تُرْخِي الذَّكَرَ وَ هِيَ بِأَغْلَى الثَّمَنِ مِنْ غَيْرِهَا وَ مَا لَبِسَهَا أَحَدٌ إِلَّا اخْتَالَ فِيهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having looked at one of his<sup>asws</sup> companions, and upon him was a black sandal, so he<sup>asws</sup> said: ‘What have you to do with the black sandals. Do you not know that it is harmful for the vision, and it slackens the manhood, and it is of a more expensive price than others, and none wear it except he swaggers (pompously) in it’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ibn Mahbub from those whom he has mentioned who has said the following: “Once abu ‘ Abd Allah, ‘Alayhi al-Salam, looked at one of his people who wore a black shoe. He (the Imam) said, ‘What have you to do with a black shoe, did you not know that it is harmful to the eyes, it slackens the penis, besides it is more expensive than others and whoever wears it, he shows arrogance in it?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/349)"
        ],
        "index": 12442,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:18:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْهَمَذَانِيِّ عَنْ حَنَانِ بْنِ سَدِيرٍ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ فِي رِجْلِي نَعْلٌ سَوْدَاءُ فَقَالَ يَا حَنَانُ مَا لَكَ وَ لِلسَّوْدَاءِ أَ مَا عَلِمْتَ أَنَّ فِيهَا ثَلَاثَ خِصَالٍ تُضْعِفُ الْبَصَرَ وَ تُرْخِي الذَّكَرَ وَ تُورِثُ الْهَمَّ وَ مَعَ ذَلِكَ مِنْ لِبَاسِ الْجَبَّارِينَ قَالَ فَقُلْتُ فَمَا أَلْبَسُ مِنَ النِّعَالِ قَالَ عَلَيْكَ بِالصَّفْرَاءِ فَإِنَّ فِيهَا ثَلَاثَ خِصَالٍ تَجْلُو الْبَصَرَ وَ تَشُدُّ الذَّكَرَ وَ تَدْرَأُ الْهَمَّ وَ هِيَ مَعَ ذَلِكَ مِنْ لِبَاسِ النَّبِيِّينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Isa, from Muhammad Bin Ali Al Hamdany, from Hanan Bin Sudeyr who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup> and in my leg was a black sandal, so he<sup>asws</sup> said: ‘O Hanaan! What is it to you and the black. Do you not know that in it are three characteristics? It weakens the vision, and slackens the manhood, and inherits the worries, and along with that, it is an apparel of the tyrants’. So I said, ‘So what shall I wear from the sandals?’ He<sup>asws</sup> said: ‘It is upon you with the yellow, for therein are three qualities – It polishes the vision, and intensifies the manhood, and wards off the worries, and along with that, it is from the apparels of the Prophets<sup>as</sup>’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa from Muhammad ibn Ali al-Hamadaniy from Hanan ibn Sadir who has said the following: “I once visited abu ‘Abd Allah, ‘Alayhi al-Salam, and I wore a black shoe. He (the Imam) said, ‘O Hanan, what do you have to do with black (color)? Did you not know that it has three disadvantages ? It weakens the eye sight, slackens the penis and causes anxieties [and besides it is of footgear of tyrants]?’ I then asked, ‘What kind of shoe must I wear?’ He (the Imam) said, ‘You must wear yellow because it has three qualities. It brightens eyesight, hardens the penis, dispels anxieties and besides it is of the footgear of the Prophets.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/350)"
        ],
        "index": 12443,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:18:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ السَّيَّارِيِّ عَنْ أَبِي سُلَيْمَانَ الْخَوَّاصِ عَنِ الْفَضْلِ بْنِ دُكَيْنٍ عَنْ سَدِيرٍ الصَّيْرَفِيِّ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ عَلَيَّ نَعْلٌ بَيْضَاءُ فَقَالَ يَا سَدِيرُ مَا هَذِهِ النَّعْلُ احْتَذَيْتَهَا عَلَى عِلْمٍ قُلْتُ لَا وَ اللَّهِ جُعِلْتُ فِدَاكَ فَقَالَ مَنْ دَخَلَ السُّوقَ قَاصِداً لِنَعْلٍ بَيْضَاءَ لَمْ يُبْلِهَا حَتَّى يَكْتَسِبَ مَالًا مِنْ حَيْثُ لَا يَحْتَسِبُ قَالَ أَبُو نُعَيْمٍ أَخْبَرَنِي سَدِيرٌ أَنَّهُ لَمْ يُبْلِ تِلْكَ النَّعْلَ حَتَّى اكْتَسَبَ مِائَةَ دِينَارٍ مِنْ حَيْثُ لَا يَحْتَسِبُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Sayyari, from Abu Suleyman Al Khawwas, from Al Fazl Bin Dukeyn, from Sadeyr Al Sayrafi who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup> and upon me were white sandals. So he<sup>asws</sup> said: ‘O Sadeyr! What is this sandal? Did you wear this knowingly?’ I said, ‘No, by Allah<sup>azwj</sup>, may I be sacrificed for you<sup>asws</sup>!’ So he<sup>asws</sup> said: ‘The one who enters the market intending the white shoes, would not renew it (buy another new pair) until he attains wealth from where he did not expect’. Abu Nuaym said, ‘Sadeyr (the narrator) informed me that he did not renew that sandal until he had attained one hundred Dinars from where he did not expect’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Sayyariy from abu Sulayman al-Khawwas from al-Fadl ibn Dukin from Sadir al-Sayrafiy who has said the following: “I once visited abu ‘Abd Allah, ‘Alayhi al-Salam, and I was wearing a white shoe. He (the Imam) asked, ‘O Sadir, are you wearing this shoe intentionally?’ I replied, ‘No, by Allah, I pray to Allah to keep my soul in service for your cause.’ He (the Imam) said, ‘Whoever goes to the market place to buy a white shoe, it will not become old before he earns an asset from a source that he never expected to earn.’ Abu al-Nu’aym has narrated to me that Sadir said, ‘That shoe did not become old until I earned one hundred dinar from an unexpected source.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/350)"
        ],
        "index": 12444,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:18:4",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ بُرَيْدِ بْنِ مُحَمَّدٍ الْغَاضِرِيِّ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ رَآنِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ عَلَيَّ نَعْلٌ سَوْدَاءُ فَقَالَ يَا عُبَيْدُ مَا لَكَ وَ لِلنَّعْلِ السَّوْدَاءِ أَ مَا عَلِمْتَ أَنَّ فِيهَا ثَلَاثَ خِصَالٍ تُرْخِي الذَّكَرَ وَ تُضْعِفُ الْبَصَرَ وَ هِيَ أَغْلَى ثَمَناً مِنْ غَيْرِهَا وَ إِنَّ الرَّجُلَ لَيَلْبَسُهَا وَ مَا يَمْلِكُ إِلَّا أَهْلَهُ وَ وَلَدَهُ فَيَبْعَثُهُ اللَّهُ جَبَّاراً."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from bureyd Bin Muhammad Al Ghaziry, from Ubeyd Bin Zurara who said, ",
            "‘Abu Abdullah<sup>asws</sup> saw me, and upon me were black sandals. So he<sup>asws</sup> said: ‘O Ubeyd! What is it with you and the black sandals. Do you not know that therein are three characteristics – it slackens the manhood, and weakens the vision, and it is more expensive in price than others, and if the man wears it and he does not possess except for his family and his children, so Allah<sup>azwj</sup> would Resurrect him as a tyrant’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn Faddal from Burayd ibn Muhammad al-Ghadiriy from ‘Ubayd ibn Zurarah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, saw me with a black shoe and said, ‘O ‘Ubayd, what have you to do with a black shoe? Did you not know that it has three negative qualities? It slackens the penis, weakens the eyesight and it is more expensive than other shoes. If a man, who does not have anything except his wife and children, wears it and Allah raises him an oppressor.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/350)"
        ],
        "index": 12445,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:18:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِي الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ لَبِسَ نَعْلًا صَفْرَاءَ كَانَ فِي سُرُورٍ حَتَّى يُبْلِيَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companons, from Ahmad Bin Abu Abdullah, from Muhammad Bin Ali, from Abu Al Bakhtary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who wears yellow sandals would be in delight until he renews them’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Muhammad ibn Ali from abu al-Bakhtariy who has said the following: “If one wears yellow shoes he continues with happiness until that shoe becomes old.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/350)"
        ],
        "index": 12446,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:18:6",
        "text": [
          "عَنْهُ عَنْ بَعْضِ أَصْحَابِنَا بَلَغَ بِهِ جَابِرَ الْجُعْفِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ لَبِسَ نَعْلًا صَفْرَاءَ لَمْ يَزَلْ يَنْظُرُ فِي سُرُورٍ مَا دَامَتْ عَلَيْهِ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ صَفْراءُ فاقِعٌ لَوْنُها تَسُرُّ النَّاظِرِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, form one of our cmpanions, delivered to him by Jabir Al Ju’fy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The one who wears yellow sandals, would not cease to be in delight for as long as they are upon him, because Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[2:69] its colour is yellow, giving delight to the beholders</span>’."
          ],
          "en.sarwar": [
            "6. It is narrated from the narrator of the previous Hadith from certain persons of our people who received from Jabir al-Juhfiy who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If one wears yellow shoes he continues in happiness as long as he wears that shoes; Allah, most Majestic, most Glorious, says, “It is yellow which is delightful to the on-lookers.” (2:69)*’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/351)"
        ],
        "index": 12447,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:18:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ سُلَيْمَانَ بْنِ سَمَاعَةَ عَنْ دَاوُدَ الْحَذَّاءِ عَنْ عَبْدِ الْمَلِكِ بْنِ بَحْرٍ صَاحِبِ اللُّؤْلُؤِ قَالَ مَنْ أَرَادَ لُبْسَ النَّعْلِ فَوَقَعَتْ لَهُ صَفْرَاءُ إِلَى الْبَيَاضِ لَمْ يَعْدَمْ مَالًا وَ وَلَداً وَ مَنْ وَقَعَتْ لَهُ سَوْدَاءُ لَمْ يَعْدَمْ غَمّاً وَ هَمّاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Suleyman Bin Sama’at, from Dawood Al Haza’a, from Abdul Malik Bin Bahr, a companions of Al Lului who said, ",
            "‘(He<sup>asws</sup> said): ‘The one who intends wearing the sandals, so he takes to yellow going on towards whiteness, would not be reduced to poverty, nor be without children, and the one who goes for the black, would not be short of grief and stress’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isa from Sulayman ibn Sama‘ah from Dawud al-Hadhdha’ from ‘Abd al-Malik ibn Bahr Sahib al-Lu’Lu who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘If one wants to wear shoes and he finds yellow toward whiteness shoes, he will not live without property or children; but if one finds black shoes he will not live without sadness and anxieties.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:8:18",
  "kind": "verse_list"
}