{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:6:8:24",
        "titles": {
          "ar": "باب الْفَيْرُوزَجِ",
          "en": "Chapter 24 – The Turquoise"
        }
      }
    ],
    "index": 1929,
    "local_index": 24,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:8:24",
    "titles": {
      "ar": "باب الْفَيْرُوزَجِ",
      "en": "Chapter 24 – The Turquoise"
    },
    "verse_count": 2,
    "verse_start_index": 12489,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/360)"
        ],
        "index": 12490,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:24:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ تَخَتَّمَ بِالْفَيْرُوزَجِ لَمْ يَفْتَقِرْ كَفُّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup> having said: ‘The one who wears a ring with the turquoise, would not impoverish his palm’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad in a marfu‘ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ’If one uses a ring of turquoise his palm does not become poor.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/360)"
        ],
        "index": 12491,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:24:2",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ عَنِ الْحَسَنِ بْنِ سَهْلٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ مِهْرَانَ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) وَ فِي إِصْبَعِهِ خَاتَمٌ فَصُّهُ فَيْرُوزَجٌ نَقْشُهُ اللَّهُ الْمَلِكُ فَأَدَمْتُ النَّظَرَ إِلَيْهِ فَقَالَ مَا لَكَ تُدِيمُ النَّظَرَ إِلَيْهِ فَقُلْتُ بَلَغَنِي أَنَّهُ كَانَ لِعَلِيٍّ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) خَاتَمٌ فَصُّهُ فَيْرُوزَجٌ نَقْشُهُ اللَّهُ الْمَلِكُ ",
          "فَقَالَ أَ تَعْرِفُهُ قُلْتُ لَا فَقَالَ هَذَا هُوَ تَدْرِي مَا سَبَبُهُ قُلْتُ لَا قَالَ هَذَا حَجَرٌ أَهْدَاهُ جَبْرَئِيلُ ( عليه السلام ) إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَوَهَبَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) أَ تَدْرِي مَا اسْمُهُ قُلْتُ فَيْرُوزَجٌ قَالَ هَذَا بِالْفَارِسِيَّةِ فَمَا اسْمُهُ بِالْعَرَبِيَّةِ قُلْتُ لَا أَدْرِي قَالَ اسْمُهُ الظَّفَرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar, from Ibrahim Bin Is’haq Al Ahmar, from Al Hassan Bin Sahl, from Al Hassan Bin Ali Bin Mihran who said, ",
            "‘I went over to Abu Al-Hassan Musa<sup>asws</sup> and in his<sup>asws</sup> finger was a ring with a stone of turquoise with an engraving: ‘اللَّهُ الْمَلِكُ’ “Allah<sup>azwj</sup> the King”. So I deliberated looking at it, so he<sup>asws</sup> said: ‘What is the matter with you, deliberately looking at it?’ So I said, ‘It has reached me that there was for Amir Al-Momineen<sup>asws</sup> a ring with a stone of turquoise with an engraving: “Allah<sup>azwj</sup> the King”’. ",
            "So he<sup>asws</sup> said: ‘Do you recognise it?’ I said, ‘No’. So he<sup>asws</sup> said: ‘This is it. Do you know what is the reason for it?’ I said, ‘No’. He<sup>asws</sup> said: ‘This is a stone gifted by Jibraeel<sup>as</sup> to Rasool-Allah<sup>saww</sup>, so Rasool-Allah<sup>saww</sup> gifted it to Amir Al-Momineen<sup>asws</sup>. Do you know what it’s name is?’ I said, ‘Turquoise’. He<sup>asws</sup> said: ‘This is in Persian. So what is its name in Arabic?’ I said, ‘I do not know’. He<sup>asws</sup> said: ‘Its name is Al-Zafar’."
          ],
          "en.sarwar": [
            "2. Ali ibn Muhammad ibn Bandar has narrated from Ibrahim ibn Ishaq al-Ahmar from al-Hassan ibn Sahl from al-Hassan ibn Ali ibn Mehran who has said the following: “I once visited abu al-Hassan, Musa, ‘Alayhi al-Salam, and on his finger was a ring with a stone which was turquoise with an engraving that said, ’Allah is the owner’. I continued looking on it and he (the Imam) asked, ’Why do you continue looking at it?’ I replied, ‘I have received information that Ali, ’Amir al-Mu’minin had a ring which had a stone of turquoise and its engraving said, “Allah is the owner”.’ He (the Imam) asked, ‘Do you recognize it?’ I replied, ‘No, I do not recognize it.’ He (the Imam) said, ‘This is that ring; do you know what is the reason?’ I replied, ‘No, I do not know.’ He (the Imam) said, ‘This is a stone which Jibril gave as a gift to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and the Messenger of Allah gave it as a gift to ’Amir al-Mu’minin, ‘Alayhi al-Salam. Do you know what its name is?’ I replied, ‘It is Firozaj (turquoise).’ He (the Imam) said, ‘That is in al-Farsiyah. What is its name in Arabic?’ I replied, ‘I do not know.’ He (the Imam) said, ‘Its name is al-Zafar (victory).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:8:24",
  "kind": "verse_list"
}