{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:6:8:28",
        "titles": {
          "ar": "باب الْفَرْشِ",
          "en": "Chapter 28 – The Furnishing"
        }
      }
    ],
    "index": 1933,
    "local_index": 28,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:6:8:29",
        "titles": {
          "ar": "باب النَّوَادِرِ",
          "en": "Chapter 29 – The Miscellaneous"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:6:8:27",
        "titles": {
          "ar": "باب الْحُلِيِّ",
          "en": "Chapter 27 – The Ornaments"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:8:28",
    "titles": {
      "ar": "باب الْفَرْشِ",
      "en": "Chapter 28 – The Furnishing"
    },
    "verse_count": 8,
    "verse_start_index": 12511,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/366)"
        ],
        "index": 12512,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:28:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مَنْصُورِ بْنِ الْعَبَّاسِ عَنْ سَعِيدِ بْنِ جَنَاحٍ عَنْ أَبِي خَالِدٍ الزَّيْدِيِّ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ دَخَلَ قَوْمٌ عَلَى الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام ) فَقَالُوا يَا ابْنَ رَسُولِ اللَّهِ نَرَى فِي مَنْزِلِكَ أَشْيَاءَ نَكْرَهُهَا وَ إِذَا فِي مَنْزِلِهِ بُسُطٌ وَ نَمَارِقُ فَقَالَ ( عليه السلام ) إِنَّا نَتَزَوَّجُ النِّسَاءَ فَنُعْطِيهِنَّ مُهُورَهُنَّ فَيَشْتَرِينَ مَا شِئْنَ لَيْسَ لَنَا مِنْهُ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Mansour Bin Al Abbas, from saeed Bin Janaah, from Abu Khalid Al Zaydi, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A group of people came over to Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup>, so they said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! We see such things in your<sup>asws</sup> dwelling which we dislike’, and in his<sup>asws</sup> house were rugs and cushions. So he<sup>asws</sup> said: ‘We<sup>asws</sup> marry women, so we<sup>asws</sup> give them their dowries, and they buy whatever they so desire to. There is nothing for us<sup>asws</sup> from it’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Mansur ibn al-‘Abbas from Sa‘id ibn Junah from ibn Khalid al- Zaydiy from Jabir who has said the following: “Once a group of people visited al-Husayn ibn Ali, ‘Alayhim al-Salam, and said, ‘O child of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, in your house we see such things that we dislike/ In his home there were pleasing spreading and cushions. He (the Imam), ‘Alayhi al-Salam, said, ‘We marry women and give them their mahr (dower). They buy whatever they want and we do not have anything to say about it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/367)"
        ],
        "index": 12513,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:28:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ أَبِي مَالِكٍ الْجُهَنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَطَاءٍ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَرَأَيْتُ فِي مَنْزِلِهِ بُسُطاً وَ وَسَائِدَ وَ أَنْمَاطاً وَ مَرَافِقَ فَقُلْتُ مَا هَذَا فَقَالَ مَتَاعُ الْمَرْأَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Abdullah Bin Al Mugheira, from Abu Malik Al Juhuny, from Abdullah Bin Ata’a who said, ",
            "‘I went over to Abu Ja’far<sup>asws</sup>, so I saw in his<sup>asws</sup> house, rugs, and pillows, and patterns, and amenities’. So I said, ‘What is this?’ So he<sup>asws</sup> said: ‘Belongings of the wife’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from ‘ Abd Allah ibn al-Mughirah from abu Malik al-Juhaniy from ‘Abd Allah ibn ‘Ata’ who has said the following: “I once visited abu Ja‘far, ‘Alayhi al-Salam, and in his house I saw spreading, cushions, furnishings and pillows and I asked, ‘What are these?’ He (the Imam) said, ‘These are the belongings of the woman (wife the Imam).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/367)"
        ],
        "index": 12514,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:28:3",
        "refs": {
          "Mentions": [
            "/books/quran:34:13"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنِ الْفَضْلِ أَبِي الْعَبَّاسِ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) قَوْلُ اللَّهِ عَزَّ وَ جَلَّ يَعْمَلُونَ لَهُ ما يَشاءُ مِنْ مَحارِيبَ وَ تَماثِيلَ وَ جِفانٍ كَالْجَوابِ قَالَ مَا هِيَ تَمَاثِيلَ الرِّجَالِ وَ النِّسَاءِ وَ لَكِنَّهَا تَمَاثِيلُ الشَّجَرِ وَ شِبْهِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Dawood Bin Al Husayn, from Al Fazl Abu Al Abbas who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘The Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:34#h13\">[34:13]</a> They made for him whatsoever he desired of Prayer Niches, and images, and wells like watering troughs</span>’. He<sup>asws</sup> said: ‘These were not images of the men and the women, but these were images of the trees and the likes of it’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from Dawud ibn al- Haseen from al-Fadl abu al-‘Abbas who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the meaning of the words of Allah, most Majestic, most Glorious, ‘They made for him whatever he wanted, such as Salat (prayer) niche, statues, basins like wells. . . .’ <a href=\"/#/books/quran:34#h13\">[34:13]</a> He (the Imam) said, ‘They were not statues of men and women but they were the figures of trees and similar objects.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/368)"
        ],
        "index": 12515,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:28:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَتْ لِعَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَسَائِدُ وَ أَنْمَاطٌ فِيهَا تَمَاثِيلُ يَجْلِسُ عَلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, form Salih Bin Al Sandy, from Ja’far Bin Bashir, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There used to be for Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, cushions and patterns with images therein. He<sup>asws</sup> used to sit upon these’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from Salih al-Sindiy from Ja‘far ibn Bashir from those whom he has mentioned who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ali ibn al-Husayn, ‘Alayhim al-Salam, (in his house) had pillows and floor furnishings which had pictures (of sceneries) on which he (the Imam) sat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/368)"
        ],
        "index": 12516,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:28:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنِ الْحَسَنِ الزَّيَّاتِ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فِي بَيْتٍ مُنَجَّدٍ ثُمَّ عُدْتُ إِلَيْهِ مِنَ الْغَدِ وَ هُوَ فِي بَيْتٍ لَيْسَ فِيهِ إِلَّا حَصِيرٌ وَ عَلَيْهِ قَمِيصٌ غَلِيظٌ فَقَالَ الْبَيْتُ الَّذِي رَأَيْتَهُ لَيْسَ بَيْتِي إِنَّمَا هُوَ بَيْتُ الْمَرْأَةِ وَ كَانَ أَمْسِ يَوْمُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Abdullah Bin Muskan, from Al Hassan Al Zayyat who said, ",
            "‘I went over to Abu Ja’far<sup>asws</sup> in a refurbished room. Then I went again to him<sup>asws</sup> in the morning and he<sup>asws</sup> was in a room in which there was nothing except for a mat, and upon him<sup>asws</sup> was a coarse shirt. So he<sup>asws</sup> said: ‘This room which you saw was not my<sup>asws</sup> room. But rather is was a room of the wife, and yesterday was her day’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from ‘Uthman ibn ‘Isa from ‘Abd Allah ibn Muskan from al- Hassan al-Zayyat who has said the following: “I once visited abu Ja‘far, ‘Alayhi al-Salam, in a well-furnished house; and the next day I visited him in a house where there was nothing except a mat. He (the Imam) wore a thick and rough-textured shirt. He (the Imam) said, ‘The house that you saw was not my house. It was the house of the woman and yesterday was her day.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/368)"
        ],
        "index": 12517,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:28:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ الْمِيثَمِيِّ عَنْ أَبِي الْجَارُودِ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) وَ هُوَ جَالِسٌ عَلَى مَتَاعٍ فَجَعَلْتُ أَلْمِسُ الْمَتَاعَ بِيَدِي فَقَالَ هَذَا الَّذِي تَلْمِسُهُ بِيَدِكَ أَرْمَنِيٌّ فَقُلْتُ لَهُ وَ مَا أَنْتَ وَ الْأَرْمَنِيَّ فَقَالَ هَذَا مَتَاعٌ جَاءَتْ بِهِ أُمُّ عَلِيٍّ امْرَأَةٌ لَهُ ",
          "فَلَمَّا كَانَ مِنْ قَابِلٍ دَخَلْتُ عَلَيْهِ فَجَعَلْتُ أَلْمِسُ مَا تَحْتِي فَقَالَ كَأَنَّكَ تُرِيدُ أَنْ تَنْظُرَ مَا تَحْتَكَ فَقُلْتُ لَا وَ لَكِنَّ الْأَعْمَى يَعْبَثُ فَقَالَ لِي إِنَّ ذَلِكَ الْمَتَاعَ كَانَ لِأُمِّ عَلِيٍّ وَ كَانَتْ تَرَى رَأْيَ الْخَوَارِجِ فَأَدَرْتُهَا لَيْلَةً إِلَى الصُّبْحِ أَنْ تَرْجِعَ عَنْ رَأْيِهَا وَ تَتَوَلَّى أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَامْتَنَعَتْ عَلَيَّ فَلَمَّا أَصْبَحْتُ طَلَّقْتُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from one of his companions, from Ali Bin Ismail Al Maysami, from Abu Al Jaroud who said, ",
            "‘I went over to Abu Ja’far<sup>asws</sup> and he<sup>asws</sup> was seated upon a chattel, so I went on to touch the chattel with my hand, so he<sup>asws</sup> said: ‘This which you are touching with your hand, is <span class=\"iTxt\">Armany</span> (Armenian)’. So I said to him<sup>asws</sup>, ‘And what have you<sup>asws</sup> to do with <span class=\"iTxt\">Al-Armany</span>?’. So he<sup>asws</sup> said: ‘This is a chattel which the mother of Ali came with’, a wife of his<sup>asws</sup>’. ",
            "So when it was another time, I went over to him<sup>asws</sup>, so I went on to touch what was beneath me, so he<sup>asws</sup> said: ‘It is as if you want to see what is beneath you’. So I said, ‘No, but the blind tend to tamper’. So he<sup>asws</sup> said to me: ‘That chattel was for the mother of Ali, and she used to view by the opinions of the Khawarijites, so I<sup>asws</sup> respited her for a night up to the morning that she might retract from her opinion, and accept the Wilayah of Amir Al-Momineen<sup>asws</sup>, but she refrained to me<sup>asws</sup>. So when it was the morning, I<sup>asws</sup> divorced her’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from certain persons of his people from Ali ibn ’Isma‘il al- Maythamiy from abu al-Jarud who have said the following: “I once visited abu Ja‘far, ‘Alayhi al-Salam. He was sitting on a certain furnishing. I kept touching it with my hand. He (the Imam) said, ‘What you are touching is from Armenia.’ I then asked, ‘What do you have to do with Armenia?’ He (the Imam) said, ‘This is what mother of Ali (wife of the Imam) has brought.’ I then visited him at another time and kept touching what I was sitting on. He (the Imam) said, ‘It seems you like to see what is underneath you.’ I replied, ‘No, but a blind only plays.’ He (the Imam) said, to me, ‘That item of belonging was owned by mother of Ali. She was of the opinion of al-Khawarij and I wanted that she can return from her opinion until the morning and accept the divine authority of Ali, ‘Alayhi al-Salam, but she refused; then in the morning I divorced her.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/368)"
        ],
        "index": 12518,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:28:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ قَالَ سَمِعْتُ الرِّضَا ( عليه السلام ) يَقُولُ قَالَ قَائِلٌ لِأَبِي جَعْفَرٍ ( عليه السلام ) يَجْلِسُ الرَّجُلُ عَلَى بِسَاطٍ فِيهِ تَمَاثِيلُ فَقَالَ الْأَعَاجِمُ تُعَظِّمُهُ وَ إِنَّا لَنَمْتَهِنُهُ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ismail Bin Mihran, from Abdullah Bin Al Mugheira who said, ",
            "‘I heard Al-Reza<sup>asws</sup> saying: ‘A speaker said to Abu Ja’far<sup>asws</sup>, ‘You<sup>asws</sup> make the man sit upon a rug in which are images’. So he<sup>asws</sup> said: ‘The non-Arabs venerate it and we<sup>asws</sup> belittle it’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ’Isma‘il ibn Mehran from ‘Abd Allah ibn al- Mughirah who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘Once a man asked abu Ja‘far, ‘Alayhi al- Salam, if a man can sit on a furnishing which has pictures of things on it. He (the Imam) said, ‘Al-’A‘ajim (non- Arab) respect it, but we do not consider it important.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/369)"
        ],
        "index": 12519,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:28:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( صلوات الله عليه ) عَنِ الْفِرَاشِ الْحَرِيرِ وَ مِثْلِهِ مِنَ الدِّيبَاجِ وَ الْمُصَلَّى الْحَرِيرِ وَ مِثْلِهِ مِنَ الدِّيبَاجِ هَلْ يَصْلُحُ لِلرَّجُلِ النَّوْمُ عَلَيْهِ وَ التُّكَأَةُ وَ الصَّلَاةُ فَقَالَ يَفْرِشُهُ وَ يَقُومُ عَلَيْهِ وَ لَا يَسْجُدُ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Amraky Bin Ali, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup> who said, ‘I asked Abu Al-Hassan<sup>asws</sup> about the silk mattresses, and the likes of it from the brocade, and the silk Prayer mat and the likes of it from the brocade, is it correct for the man to sleep over it, and recline upon, and the Prayer?’ So he<sup>asws</sup> said: ‘Furnish it, and stand upon it, but do not Prostrate upon it’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from al-‘Amrakiy ibn Ali from Ali ibn Ja‘far who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about silk furnishings and similarly about brocaded items, prayer rugs of silk and of brocaded ones; if it is proper for a man to sleep on it, perform Salat (prayer) or lean against it. He (the Imam) said, ‘He can spread it and stand on it but he cannot perform Sajdah (prostration) on it.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:8:28",
  "kind": "verse_list"
}