{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:6:8:43",
        "titles": {
          "ar": "باب الْحَمَّامِ",
          "en": "Chapter 43 – The Bathhouse"
        }
      }
    ],
    "index": 1948,
    "local_index": 43,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:8:43",
    "titles": {
      "ar": "باب الْحَمَّامِ",
      "en": "Chapter 43 – The Bathhouse"
    },
    "verse_count": 36,
    "verse_start_index": 12639,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/396)"
        ],
        "index": 12640,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ أَوْ غَيْرِهِ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ الْجَبَلِيِّ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) نِعْمَ الْبَيْتُ الْحَمَّامُ يُذَكِّرُ النَّارَ وَ يَذْهَبُ بِالدَّرَنِ وَ قَالَ عُمَرُ بِئْسَ الْبَيْتُ الْحَمَّامُ يُبْدِي الْعَوْرَةَ وَ يَهْتِكُ السِّتْرَ قَالَ وَ نَسَبَ النَّاسُ قَوْلَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) إِلَى عُمَرَ وَ قَوْلَ عُمَرَ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, or someone else from Muhammad Bin Aslam Al Jably, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The best of the houses is the bathhouse. It reminds of the Fire and removes the filth’; and Umar said, ‘The worst of the houses is the bathhouse, it exposes the genitals and the tears down the veil’. He<sup>asws</sup> said: ‘And the people ascribed the words of Amir Al-Momineen<sup>asws</sup> to Umar and the words of Umar to Amir Al-Momineen<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father or others from Muhammad ibn Aslam al-Jabaliy in a marfu‘ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ‘The bathhouse is a very good house; it reminds of fire and banishes dirt.’ ‘Umar has said, ‘A bathhouse is the worst house; it exposes private parts and violates secrets.’ He (the Imam) said, ‘People have ascribed the words of ’Amir al-Mu’minin to ‘Umar and vice versa.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/397)"
        ],
        "index": 12641,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:2",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ وَ عَلِيِّ بْنِ حَسَّانَ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ الْحَمَّامُ يَوْمٌ وَ يَوْمٌ لَا يُكْثِرُ اللَّحْمَ وَ إِدْمَانُهُ فِي كُلِّ يَوْمٍ يُذِيبُ شَحْمَ الْكُلْيَتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Al Hakam and Ali Bin Hassan, from Suleyman Al Ja’fary, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘Bathing a day, and not a day (alternatively) does not increase the flesh, and being habitual of it during every day removes the fat of the kidneys’."
          ],
          "en.sarwar": [
            "2. It is narrated from the narrator of the previous Hadith from Ali ibn al-Hakam from and Ali ibn Hassan from Sulayman ibn al-Ja‘fariy who has said the following: “Abu al-Hassan, ‘Alayhi al-Salam, has said, ‘Taking a bath one day and the day after does not increase flesh. Continuously taking a bath every day melts the fat of the kidneys.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/397)"
        ],
        "index": 12642,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِفَاعَةَ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ فَلَا يَدْخُلِ الْحَمَّامَ إِلَّا بِمِئْزَرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Rafa’at Bin Musa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who was a believer in Allah<sup>azwj</sup> and the Last Day, so he should not enter the bathhouse except with a loincloth’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Rifa‘ah ibn Musa who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘If one believes in Allah and in the life hereafter, he must not enter a bathhouse without a loincloth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/397)"
        ],
        "index": 12643,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْحَجَّالِ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ قَالَ مَرِضْتُ حَتَّى ذَهَبَ لَحْمِي فَدَخَلْتُ عَلَى الرِّضَا ( صلوات الله عليه ) فَقَالَ أَ يَسُرُّكَ أَنْ يَعُودَ إِلَيْكَ لَحْمُكَ قُلْتُ بَلَى قَالَ الْزَمِ الْحَمَّامَ غِبّاً فَإِنَّهُ يَعُودُ إِلَيْكَ لَحْمُكَ وَ إِيَّاكَ أَنْ تُدْمِنَهُ فَإِنَّ إِدْمَانَهُ يُورِثُ السِّلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Abdullah Bin Muhammad Al Hajjal, from Suleyman Al Ja’fary who said, ",
            "‘I was sick to the extent that my flesh went away. So I went over to Al-Reza<sup>asws</sup>, so he<sup>asws</sup> said: ‘Would you be joyful if I<sup>asws</sup> were to return your flesh to you?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘Necessitate the bathing intermittently so it would return back to you your flesh, and beware of being habitual of it, for being habitual in it inherits the tuberculosis’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Abd Allah ibn Muhammad al-Hajj al from Sulayman al- Ja’fariy who has said the following: “Once I became ill until I lost all of my flesh. I visited al-Rida’, ‘Alayhi al-Salam, who asked, ‘Will you like to see your flesh come back?’ I replied, ‘Yes, I like to see my flesh come back.’ He (the Imam) said, ‘You must continue taking a bath one day and on the day after the next day, your flesh will come back. You must not take a bath every day because it causes tuberculosis.’” (Perhaps if it is a public bathhouse) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/397)"
        ],
        "index": 12644,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:5",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْمُثَنَّى بْنِ الْوَلِيدِ الْحَنَّاطِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا تَدْخُلِ الْحَمَّامَ إِلَّا وَ فِي جَوْفِكَ شَيْ‏ءٌ يُطْفَأُ بِهِ عَنْكَ وَهَجُ الْمَعِدَةِ وَ هُوَ أَقْوَى لِلْبَدَنِ وَ لَا تَدْخُلْهُ وَ أَنْتَ مُمْتَلِئٌ مِنَ الطَّعَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al Musna Bin Al Waleed Al Hannat, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Do not enter the bathhouse except in your inside is something to cool down the heat of your stomach with, and it is more strengthening for your body, and do not enter it and you are filled up from the food’."
          ],
          "en.sarwar": [
            "5. Ahmad ibn Muhammad has narrated from Ali ibn al-Hakam from al-Muthanna’ al-Hannat from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Do not enter a bathhouse until there is something in your belly to calm down the excitement of your stomach and it is more energizing for the body. Do not enter it with your stomach full of food.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/397)"
        ],
        "index": 12645,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:6",
        "text": [
          "عَلِيُّ بْنُ الْحَكَمِ عَنْ رِفَاعَةَ بْنِ مُوسَى عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ كَانَ إِذَا أَرَادَ دُخُولَ الْحَمَّامِ تَنَاوَلَ شَيْئاً فَأَكَلَهُ قَالَ قُلْتُ لَهُ إِنَّ النَّاسَ عِنْدَنَا يَقُولُونَ إِنَّهُ عَلَى الرِّيقِ أَجْوَدُ مَا يَكُونُ قَالَ لَا بَلْ يُؤْكَلُ شَيْ‏ءٌ قَبْلَهُ يُطْفِئُ الْمَرَارَةَ وَ يُسَكِّنُ حَرَارَةَ الْجَوْفِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Al Hakam, from Rafa’at Bin Musa, from the one who informed it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that whenever he<sup>asws</sup> wanted to enter the bathhouse, he<sup>asws</sup> took something, so he<sup>asws</sup> ate it. I said to him<sup>asws</sup>, ‘The people with us are saying that it is much better upon the empty stomach as can be’. He<sup>asws</sup> said: ‘No, but eating something before it cools the gallbladder and settles the heat of the interior’."
          ],
          "en.sarwar": [
            "6. Ali ibn al-Hakam from has narrated from Rifa‘ah ibn Musa from those who narrated to him who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, when about to take a bath would eat something. I once asked, ‘People around us say that before eating anything is the best time for taking a bath.’ He (the Imam) said, ‘No, one must eat something before taking bath; it banished bitterness (acidity) and calms down the temperature in the belly.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/398)"
        ],
        "index": 12646,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ جَمِيعاً عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ أَبِيهِ قَالَ دَخَلْتُ أَنَا وَ أَبِي وَ جَدِّي وَ عَمِّي حَمَّاماً بِالْمَدِينَةِ فَإِذَا رَجُلٌ فِي بَيْتِ الْمَسْلَخِ فَقَالَ لَنَا مِمَّنِ الْقَوْمُ فَقُلْنَا مِنْ أَهْلِ الْعِرَاقِ فَقَالَ وَ أَيُّ الْعِرَاقِ قُلْنَا كُوفِيُّونَ فَقَالَ مَرْحَباً بِكُمْ يَا أَهْلَ الْكُوفَةِ أَنْتُمُ الشِّعَارُ دُونَ الدِّثَارِ ثُمَّ قَالَ مَا يَمْنَعُكُمْ مِنَ الْأُزُرِ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ عَوْرَةُ الْمُؤْمِنِ عَلَى الْمُؤْمِنِ حَرَامٌ",
          "قَالَ فَبَعَثَ إِلَى أَبِي كِرْبَاسَةً فَشَقَّهَا بِأَرْبَعَةٍ ثُمَّ أَخَذَ كُلُّ وَاحِدٍ مِنَّا وَاحِداً ثُمَّ دَخَلْنَا فِيهَا فَلَمَّا كُنَّا فِي الْبَيْتِ الْحَارِّ صَمَدَ لِجَدِّي فَقَالَ يَا كَهْلُ مَا يَمْنَعُكَ مِنَ الْخِضَابِ فَقَالَ لَهُ جَدِّي أَدْرَكْتُ مَنْ هُوَ خَيْرٌ مِنِّي وَ مِنْكَ لَا يَخْتَضِبُ قَالَ فَغَضِبَ لِذَلِكَ حَتَّى عَرَفْنَا غَضَبَهُ فِي الْحَمَّامِ قَالَ وَ مَنْ ذَلِكَ الَّذِي هُوَ خَيْرٌ مِنِّي فَقَالَ أَدْرَكْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) وَ هُوَ لَا يَخْتَضِبُ قَالَ فَنَكَسَ رَأْسَهُ وَ تَصَابَّ عَرَقاً فَقَالَ صَدَقْتَ وَ بَرِرْتَ",
          "ثُمَّ قَالَ يَا كَهْلُ إِنْ تَخْتَضِبْ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَدْ خَضَبَ وَ هُوَ خَيْرٌ مِنْ عَلِيٍّ ( عليه السلام ) وَ إِنْ تَتْرُكْ فَلَكَ بِعَلِيٍّ سُنَّةٌ قَالَ فَلَمَّا خَرَجْنَا مِنَ الْحَمَّامِ سَأَلْنَا عَنِ الرَّجُلِ فَإِذَا هُوَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) وَ مَعَهُ ابْنُهُ مُحَمَّدُ بْنُ عَلِيٍّ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazie, altogether from Hanan Bin sadeyr, from his father who said, ",
            "‘I and my father, and my grandfather, and my uncle went over to a bathhouse at Al-Medina, so there was a man<sup>asws</sup> in the dressing room. So he said to us, ‘From whom are the people?’ So we said, ‘From the people of Al-Iraq’. So he<sup>asws</sup> said, ‘And from where in Al-Iraq?’ We said, ‘Kufians (from Kufa)’. So he<sup>asws</sup> said, ‘Welcome to you all, of people of Al-Kufa. You all are wearing clothes and are without a towel’. Then he<sup>asws</sup> said, ‘What is preventing you from the loincloth, for Rasool-Allah<sup>saww</sup> said: ‘The nakedness of the Believer upon the Believer is Prohibited’. ",
            "He (the narrator) said, ‘He<sup>asws</sup> sent a cloth to my father, so he tore it into four pieces, and each one of us took one from it. Then we entered into it. So when we were in the hot house, he<sup>asws</sup> turned towards my grandfather, so he<sup>asws</sup> said, ‘O elderly, what prevents you from the dyeing?’ So my grandfather said to him, ‘I was with someone who was better than me and you<sup>asws</sup>, who did not dye’. So he<sup>asws</sup> got so angered due to that to the extent that we recognised his<sup>asws</sup> anger in the bathhouse. He<sup>asws</sup> said, ‘And who is that who is better than me<sup>asws</sup>?’ So he said, ‘I was with Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> and he<sup>asws</sup> did not dye’. He (the narrator) said, ‘So he<sup>asws</sup> bowed his head and perspired, so he<sup>asws</sup> said, ‘You speak the truth, and are justified’.",
            "Then he said, ‘O elderly, you should dye, for Rasool-Allah<sup>saww</sup> had dyed, and he<sup>saww</sup> was better than Ali<sup>asws</sup>, and if you leave it, so for you is a Sunnah with Ali<sup>asws</sup>’. So when we went out from the bathhouse, we asked about the man, so it was Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> and with him<sup>asws</sup> was his<sup>asws</sup> son<sup>asws</sup> Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Sahl ibn Ziyad from Mansur ibn al-‘Abbas from Hamzah ibn ‘Abd Allah from Rib‘iy from ‘Ubayd Allah al-Dabiqiy who has said the following: “I once in al-Madinah entered a bathhouse and an old man was the manager of the bathhouse. I asked, ‘O Shaykh to whom does this bathhouse belong?’ He replied, ‘It belongs to abu Ja‘far, Muhammad ibn Ali ibn al-Husayn, ‘Alayhim al-Salam.’ I then asked, ‘Did he use it?’ He replied, ‘Yes, he did.’ I then asked, ’How would he use it?’ He said, ’First he applied lime to his pubic region and the surrounding area and to his urethra then he would call me to apply to the other parts of his body.’ I then asked, ‘Did you ever see what you do not like to see ? 5 He replied, ‘It never happened because lime is a cover.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/398)"
        ],
        "index": 12647,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ دَخَلْتُ مَعَ أَبِي بَصِيرٍ الْحَمَّامَ فَنَظَرْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَدِ اطَّلَى وَ اطَّلَى إِبْطَيْهِ بِالنُّورَةِ قَالَ فَخَبَّرْتُ أَبَا بَصِيرٍ فَقَالَ أَرْشِدْنِي إِلَيْهِ لِأَسْأَلَهُ عَنْهُ فَقُلْتُ قَدْ رَأَيْتُهُ أَنَا فَقَالَ أَنْتَ قَدْ رَأَيْتَهُ وَ أَنَا لَمْ أَرَهُ أَرْشِدْنِي إِلَيْهِ قَالَ فَأَرْشَدْتُهُ إِلَيْهِ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ أَخْبَرَنِي قَائِدِي أَنَّكَ قَدِ اطَّلَيْتَ وَ طَلَيْتَ إِبْطَيْكَ بِالنُّورَةِ قَالَ نَعَمْ يَا أَبَا مُحَمَّدٍ إِنَّ نَتْفَ الْإِبْطَيْنِ يُضْعِفُ الْبَصَرَ اطَّلِ يَا أَبَا مُحَمَّدٍ قَالَ فَقَالَ اطَّلَيْتُ مُنْذُ أَيَّامٍ فَقَالَ اطَّلِ فَإِنَّهُ طَهُورٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Ali Bin Abu Hamza who said, ",
            "‘I entered the bathhouse along with Abu Baseer, so we looked at Abu Abdullah<sup>asws</sup> had waxed, and he<sup>asws</sup> had waxed his<sup>asws</sup> underarms with <span class=\"iTxt\">Al-Noura</span>. So I informed Abu Baseer, so he said, ‘Guide me to him<sup>asws</sup> to ask him<sup>asws</sup> about it’. So I said, ‘I have seen him<sup>asws</sup>’. So he said, ‘You have seen him<sup>asws</sup>, and I cannot see him<sup>asws</sup>’, (as he was blind). Guide me to him<sup>asws</sup>’. So I guided him to him<sup>asws</sup>, so he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! My guide informed me that you<sup>asws</sup> have waxed, and waxed your<sup>asws</sup> underarms with <span class=\"iTxt\">Al-Noura</span>’. He<sup>asws</sup> said: ‘Yes, O Abu Muhammad! Plucking the underarms weakens the vision. Wax, O Abu Muhammad’. So he said, ‘I have waxed a few days beforehand’. So he<sup>asws</sup> said: ‘Wax, for it is cleaner’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad from Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il ibn Bazi‘ all from Hanan ibn Sadir from his father who has said the following: “My father, grandfather, uncle and I once entered a bathhouse in al-Madinah and there was a man in the room for undressing. He asked, ‘From where are you people ?’ We replied, ‘We are from Iraq.’ He then asked, ‘From which part of Iraq are you?’ We replied that we are from al-Kufah.’ He said, ‘Welcome, O people of al-Kufah, but you wear only one layer of clothes and why do you not have loincloths? The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “Private parts of believing people are unlawful for the believing people.’” He then sent a piece of cotton fabric for my father and made it in four parts. Then each one of us took one piece. When we were in the hot room, he turned to my grandfather and said, ‘Old man, what prevents you from using dyes?’ My grandfather said, ‘I lived with one who was better than me and you, and who did not use dyes.’ He became angry so much so that we noticed it in the bathhouse. He asked, ‘Who is that person better than you and me?’ He replied, ‘I lived with Ali ibn abu Talib, ‘Alayhi al-Salam, and he did not use dyes.’ He looked down and perspired. He said, ‘You have spoken the truth and proved your point.’ ‘O old man, if the Messenger of Allah used dyes, you should also use dyes because he is better than Ali ibn abu Talib, but if you will not use it you have followed the Sunnah of Ali ibn abu Talib.’ He (the narrator) has said, ‘When we left the bathhouse we asked about the man and found out that he was Ali ibn al-Husayn, along with his son, Muhammad ibn Ali, ‘Alayhim al-Salam.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/399)"
        ],
        "index": 12648,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:9",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ رَجُلٍ مِنْ بَنِي هَاشِمٍ قَالَ دَخَلْتُ عَلَى جَمَاعَةٍ مِنْ بَنِي هَاشِمٍ فَسَلَّمْتُ عَلَيْهِمْ فِي بَيْتٍ مُظْلِمٍ فَقَالَ بَعْضُهُمْ سَلِّمْ عَلَى أَبِي الْحَسَنِ ( عليه السلام ) فَإِنَّهُ فِي الصَّدْرِ قَالَ فَسَلَّمْتُ عَلَيْهِ وَ جَلَسْتُ بَيْنَ يَدَيْهِ فَقُلْتُ لَهُ قَدْ أَحْبَبْتُ أَنْ أَلْقَاكَ مُنْذُ حِينٍ لِأَسْأَلَكَ عَنْ أَشْيَاءَ فَقَالَ سَلْ مَا بَدَا لَكَ قُلْتُ مَا تَقُولُ فِي الْحَمَّامِ قَالَ لَا تَدْخُلِ الْحَمَّامَ إِلَّا بِمِئْزَرٍ وَ غُضَّ بَصَرَكَ وَ لَا تَغْتَسِلْ مِنْ غُسَالَةِ مَاءِ الْحَمَّامِ فَإِنَّهُ يُغْتَسَلُ فِيهِ مِنَ الزِّنَا وَ يَغْتَسِلُ فِيهِ وَلَدُ الزِّنَا وَ النَّاصِبُ لَنَا أَهْلَ الْبَيْتِ وَ هُوَ شَرُّهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hakam, ",
            "(It has been narrated) from a man from the Clan of Hashim<sup>as</sup> who said, ‘I went over to a group from the Clan of Hashim<sup>as</sup>, so I greeted them in a dark room. So one of them said, ‘Greet Abu Al Hassan<sup>asws</sup>, for he<sup>asws</sup> is in the centre’. So I greeted him<sup>asws</sup> and sat in front of him<sup>asws</sup>, and I said to him<sup>asws</sup>, ‘I desired to meet you<sup>asws</sup> for a while to ask you<sup>asws</sup> about certain things’. So he<sup>asws</sup> said: ‘Ask, whatever comes to you’. I said, ‘What are you<sup>asws</sup> saying regarding the bathhouse’. He<sup>asws</sup> said: ‘Do not enter the bathhouse except with a loincloth, and lowering your eyes, and do not wash from the used water of the bathhouse for there has washed in it the adulterer, and the son of the adulterer, and the Hostile one (<span class=\"iTxt\">Nasibi</span>) towards us<sup>asws</sup>, the People<sup>asws</sup> of the Household, and he is the most evil of them’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Ali ibn abu Hamzah who has said the following: “I once entered a bathhouse with abu Basir and saw abu ‘Abd Allah, ‘Alayhi al-Salam, who had applied (lime) and on his underarms. I then informed abu Basir and he asked me to lead him so he can ask him about it. I said, ‘I saw him.’ He said, ‘You saw him (the Imam) but I cannot see him (the Imam)? Lead me to where he is.’ I then led him and he said, ‘I pray to Allah to keep my soul in service for your cause, my lead has said that you have applied lime and on your underarms.’ He (the Imam) said, ‘Yes, O abu Muhammad, pulling up hairs of underarms weakens eyesight, so you must apply lime, O abu Muhammad.’ He (the narrator) has said, ‘I applied since that time and he (the Imam) said, ‘Apply; it is cleansing.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/400)"
        ],
        "index": 12649,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:10",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ قَالَ مَنْ أَرَادَ أَنْ يَحْمِلَ لَحْماً فَلْيَدْخُلِ الْحَمَّامَ يَوْماً وَ يَغِبُّ يَوْماً وَ مَنْ أَرَادَ أَنْ يَضْمُرَ وَ كَانَ كَثِيرَ اللَّحْمِ فَلْيَدْخُلِ الْحَمَّامَ كُلَّ يَوْمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Ahmad Bin Asheym, from Suleyman Al Ja’fary, ",
            "(He<sup>asws</sup>) having said: ‘The one who wants to carry flesh (to gain weight) so let him enter the bathhouse one day, and be absent from it one day, and the one who intends slimming and he was of a lot of flesh, so let him enter the bathhouse every day’."
          ],
          "en.sarwar": [
            "10. Ahmad ibn Muhammad has narrated from Ali ibn al-Hakam from a man of banu Hashim who has said the following: “I once entered in dark house where a group of banu Hashim were and I offered them greeting of peace with the phrase of offering greeting. A certain one among them said, ‘Offer greeting of peace to abu al-Hassan, ‘Alayhi al-Salam, he is in the center.’ He (the narrator) has said, ‘I offered him (the Imam) greeting of peace and sat in front of him and said, “Since a long time I loved to visit you to ask about certain things.’” He (the Imam) said, ‘Ask whatever you like.’ I then asked, ‘What do you say about using a bathhouse?’ He (the Imam) said, ‘Do not enter a bathhouse without a loincloth, keep your eyes cast down, do not wash with used water because fornicators take a bath with it as well as those bom out of wedlock, and enemies of Ah/ al-Bayt, ‘Alayhim al-Salam, who are the worst of them. 5 ” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/400)"
        ],
        "index": 12650,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَطَّلِي بِالنُّورَةِ فَيَجْعَلُ لَهُ الدَّقِيقَ بِالزَّيْتِ يَلُتُّ بِهِ فَيَمْسَحُ بِهِ بَعْدَ النُّورَةِ لِيَقْطَعَ رِيحَهَا عَنْهُ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who waxes with <span class=\"iTxt\">Al-Noura</span>, so he makes a container for himself of the flour with the oil to paste with it, so he touches with it upon himself after <span class=\"iTxt\">Al-Noura</span> in order to cut-off its smell from himself’. He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "11. Ahmad ibn Muhammad has narrated from Ali ibn Ahmad ibn ‘Ushaym from Sufayman af-Ja‘fariy who has said the foifowing: “He (the Imam) has said, ‘If one wants to gain weight he should use a bathhouse one day and the day after the next day but if one is heavy and wants to lose weight he should use a bathhouse every day.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن وآخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/400)"
        ],
        "index": 12651,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:12",
        "text": [
          "وَ فِي حَدِيثٍ آخَرَ لِعَبْدِ الرَّحْمَنِ قَالَ رَأَيْتُ أَبَا الْحَسَنِ ( عليه السلام ) وَ قَدْ تَدَلَّكَ بِدَقِيقٍ مَلْتُوتٍ بِالزَّيْتِ فَقُلْتُ لَهُ إِنَّ النَّاسَ يَكْرَهُونَ ذَلِكَ قَالَ لَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And in another Hadeeth of Abdul Rahman, he said, ",
            "‘I saw Abu Al-Hassan<sup>asws</sup> and he had massaged with flour mixed with oil. So I said to him<sup>asws</sup>, ‘The people are disliking that’. He<sup>asws</sup> said: ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "12. Afi ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘ Abd al-Rahman ibn al-Hajj aj who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who applies lime, then mixes flour with oil then rubs it on him after lime to remove its smell. He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "index": 12652,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:13",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ إِسْحَاقَ بْنِ عَبْدِ الْعَزِيزِ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنِ التَّدَلُّكِ بِالدَّقِيقِ بَعْدَ النُّورَةِ فَقَالَ لَا بَأْسَ قُلْتُ يَزْعُمُونَ أَنَّهُ إِسْرَافٌ فَقَالَ لَيْسَ فِيمَا أَصْلَحَ الْبَدَنَ إِسْرَافٌ إِنِّي رُبَّمَا أَمَرْتُ بِالنَّقِيِّ فَيُلَتُّ لِي بِالزَّيْتِ فَأَتَدَلَّكُ بِهِ إِنَّمَا الْإِسْرَافُ فِيمَا أَتْلَفَ الْمَالَ وَ أَضَرَّ بِالْبَدَنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Is’haq Bin Abdul Aziz who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about the massaging with the flour (mixed with oil) after <span class=\"iTxt\">Al-Noura</span>, so he<sup>asws</sup> said: ‘There is no problem’. I said, ‘They (people) are alleging that it is an extravagance’. So he<sup>asws</sup> said: ‘There is no extravagance in the correction (well-being) of the body. Sometimes I order with the pure (flour), so it is mixed for me<sup>asws</sup> with the oil, so I massage with it. But rather, the extravagance is in what is destruction of the wealth and harmful for the body’."
          ],
          "en.sarwar": [
            "13. In another Hadith it is narrated from ‘Abd al-Rahman who has said the following: “I once saw abu al-Hassan, ‘Alayhi al-Salam, rubbing with flour mixed with oil and I said that people dislike it. He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/401)"
        ],
        "index": 12653,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:14",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي الْحَسَنِ ( صلوات الله عليه ) فِي الرَّجُلِ يَطَّلِي وَ يَتَدَلَّكُ بِالزَّيْتِ وَ الدَّقِيقِ قَالَ لَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al fazl Bin Shazaan, altogether from Abu Abu Umeyr, from Hisham Bin Al Hakam, ",
            "(It has been narrated) from Abu Al Hassan<sup>asws</sup> regarding the man who waxes and massages with the oil and the flour. He<sup>asws</sup> said: ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "14. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from Ishaq ibn ‘Abd al-’Aziz who has said the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about rubbing with flour after lime. He (the Imam) said, ‘It is not harmful.’ I then said, ‘They think it is misuse of flour.’ He (the Imam) said, ‘Use of things for the benefit of body is not a misuse. I sometimes ask for bleached flour mixed with oil and rub. Misuse is when one’s belongings are destroyed and the body is harmed.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/401)"
        ],
        "index": 12654,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:15",
        "text": [
          "عَلِيٌّ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ الْجَبَلِيِّ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّا لَنُسَافِرُ وَ لَا يَكُونُ مَعَنَا نُخَالَةٌ فَنَتَدَلَّكُ بِالدَّقِيقِ فَقَالَ لَا بَأْسَ إِنَّمَا الْفَسَادُ فِيمَا أَضَرَّ بِالْبَدَنِ وَ أَتْلَفَ الْمَالَ فَأَمَّا مَا أَصْلَحَ الْبَدَنَ فَإِنَّهُ لَيْسَ بِفَسَادٍ إِنِّي رُبَّمَا أَمَرْتُ غُلَامِي فَلَتَّ لِيَ النَّقِيَّ بِالزَّيْتِ فَأَتَدَلَّكُ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ahmad, from Muhammad Bin Aslam Al Jabaly, from Ali Bin Abu Hamza, from Aban Bin Taglub who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘We tend to travel and there does not happen to be any bran with us, so we massage with the flour’. So he<sup>asws</sup> said: ‘There is no problem. But rather, the spoiling is in what is harmful for the body, and the destruction of the wealth. So as for what is corrective for the body, so it is no with spoiling. Sometimes I<sup>asws</sup> order my<sup>asws</sup> slave, ‘Prepare for me<sup>asws</sup> the pure flour with the oil, so I<sup>asws</sup> massage with it’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from his father from and Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from all from ibn abu ‘Umayr from Hisham ibn al-Hakam who has said the following: “About the case of a man who rubs his body with flour and oil after lime, abu al-Hassan, ‘Alayhi al- Salam, has said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/401)"
        ],
        "index": 12655,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:16",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ قَالَ خَرَجَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مِنَ الْحَمَّامِ فَتَلَبَّسَ وَ تَعَمَّمَ فَقَالَ لِي إِذَا خَرَجْتَ مِنَ الْحَمَّامِ فَتَعَمَّمْ قَالَ فَمَا تَرَكْتُ الْعِمَامَةَ عِنْدَ خُرُوجِي مِنَ الْحَمَّامِ فِي شِتَاءٍ وَ لَا صَيْفٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Sayf Bin Ameyra who said, ",
            "‘Abu Abdullah<sup>asws</sup> went out from the bathhouse, so he<sup>asws</sup> had worn clothes and a turban. He<sup>asws</sup> said to me: ‘Whenever you come out from the bathhouse, so wear a turban’. He (the narrator) said, ‘So I did not neglect the turban during my coming out from the bathhouse, during the winter and the summer’."
          ],
          "en.sarwar": [
            "16. Ali has narrated from Ahmad ibn Muhammad from Muhammad ibn Aslam al-Jabaliy from Ali ibn abu Hamzah from Aban ibn Taghlib who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Sometimes when on a journey we do not find bran; if we can rub with flour.’ He (the Imam) said, ‘It is not harmful. It is bad only when belongings are destroyed and the body is harmed. If body is benefited then it is not bad. I sometimes command my slave to prepare bleached flour with oil and I rub with it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/401)"
        ],
        "index": 12656,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:17",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَطَّلِي فَيَبُولُ وَ هُوَ قَائِمٌ قَالَ لَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who waxes, and he urinates while he is standing’. He<sup>asws</sup> said: ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "17. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Sayf ibn ‘Amirah who has said the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, came out of the bathhouse, dressed, wore his turban and said to me, ‘When you come out of bathhouse wear a turban.’ He (the narrator) has said, ‘I thereafter would always wear a turban after coming out of the bathhouse in winter and summer.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/402)"
        ],
        "index": 12657,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:18",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) يَقُولُ أَلَا لَا يَسْتَلْقِيَنَّ أَحَدُكُمْ فِي الْحَمَّامِ فَإِنَّهُ يُذِيبُ شَحْمَ الْكُلْيَتَيْنِ وَ لَا يَدْلُكَنَّ رِجْلَيْهِ بِالْخَزَفِ فَإِنَّهُ يُورِثُ الْجُذَامَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ali Bin Al Hassan Al Taymi, from Muhammad Bin Abu Hamza, from Umar Bin Yazeed, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> was saying: ‘Indeed! Not one of you should lie down in the bathhouse, for it melts the fat of the kidneys, and he should not massage his leg with the clay for it inherits the leprosy’."
          ],
          "en.sarwar": [
            "18. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from a man who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who applies lime and urinates standing. He (the Imam) said, ‘It is not harmful. 5 ” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/402)"
        ],
        "index": 12658,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:19",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ قَالَ كُنَّا جَمَاعَةً مِنْ أَصْحَابِنَا دَخَلْنَا الْحَمَّامَ فَلَمَّا خَرَجْنَا لَقِيَنَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَنَا مِنْ أَيْنَ أَقْبَلْتُمْ فَقُلْنَا لَهُ مِنَ الْحَمَّامِ فَقَالَ أَنْقَى اللَّهُ غَسْلَكُمْ فَقُلْنَا لَهُ جُعِلْنَا فِدَاكَ وَ إِنَّا جِئْنَا مَعَهُ حَتَّى دَخَلَ الْحَمَّامَ فَجَلَسْنَا لَهُ حَتَّى خَرَجَ فَقُلْنَا لَهُ أَنْقَى اللَّهُ غَسْلَكَ فَقَالَ طَهَّرَكُمُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, raising it, from Abdullah Bin Muskan who said, ",
            "‘We were a group of our companions, and we entered the bathhouse. So when we went out, we met Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said to us: ‘Where are you coming back from?’ So we said to him<sup>asws</sup>, ‘From the bathhouse’. So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Purify your bathing’. So we said to him<sup>asws</sup>, ‘May we be sacrificed for you<sup>asws</sup>’. And we went with him<sup>asws</sup> until he<sup>asws</sup> entered the bathhouse. So we sat around (waiting) for him<sup>asws</sup> until he<sup>asws</sup> came out. So we said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Purify your<sup>asws</sup> bathing’. So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Clean you all’."
          ],
          "en.sarwar": [
            "19. Muhammad ibn Yahya has narrated from Ali ibn al-Hassan al-Taymiy from Muhammad ibn abu Hamzah from ‘Umar ibn Yazid who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ‘You must not lie down on your back in the bathhouse; it melts the fat of kidneys and must not rub your feet with pottery because it may cause leprosy.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/402)"
        ],
        "index": 12659,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:20",
        "text": [
          "مُحَمَّدُ بْنُ الْحَسَنِ وَ عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ النَّهَاوَنْدِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَمَّادٍ عَنْ أَبِي مَرْيَمَ الْأَنْصَارِيِّ رَفَعَهُ قَالَ إِنَّ الْحَسَنَ بْنَ عَلِيٍّ ( عليه السلام ) خَرَجَ مِنَ الْحَمَّامِ فَلَقِيَهُ إِنْسَانٌ فَقَالَ طَابَ اسْتِحْمَامُكَ فَقَالَ يَا لُكَعُ وَ مَا تَصْنَعُ بِالِاسْتِ هَاهُنَا فَقَالَ طَابَ حَمِيمُكَ فَقَالَ أَ مَا تَعْلَمُ أَنَّ الْحَمِيمَ الْعَرَقُ قَالَ فَطَابَ حَمَّامُكَ قَالَ وَ إِذَا طَابَ حَمَّامِي فَأَيُّ شَيْ‏ءٍ لِي وَ لَكِنْ قُلْ طَهُرَ مَا طَابَ مِنْكَ وَ طَابَ مَا طَهُرَ مِنْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, and Ali Bin Muhammad Bin Bundar, from Ibrahim Bin Is’haq Al Nahawandy, from Abdul Rahman Bin Hammad, from Abu Maryam Al Ansary, raising it, said, ",
            "‘Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> went out from the bathhouse, a person came across him<sup>asws</sup>, so he said, ‘May your<sup>asws</sup> <span class=\"iTxt\">Istihmamuk</span> be good’. So he<sup>asws</sup> said: ‘O dimwit, and are you doing with utilising the ‘<span class=\"iTxt\">ist</span>’ over here (in the word)?’ So he said, ‘May your <span class=\"iTxt\">Hameemuk</span> be good’. So he<sup>asws</sup> said: ‘But do you not know that <span class=\"iTxt\">Al-Hameem</span> is the perspiration?’ He said, ‘May your <span class=\"iTxt\">Hamaamuk</span> be good’. He<sup>asws</sup> said: ‘And when my<sup>asws</sup> bathing is good, so which thing is for me<sup>asws</sup>, but say, ‘May it be purified what is good from you<sup>asws</sup>, and may it be good what is purified from you<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "20. Muhammad ibn Yahya in a marfu‘ manner has narrated the following from ‘Abd Allah ibn Muskan: “Once we in a group of our people entered a bathhouse and when coming out we met abu ‘Abd Allah, ‘Alayhi al-Salam, who asked us, ‘Wherefrom are you coming?’ We replied, ‘We are coming from the bathhouse.’ He (the Imam) said, ‘May Allah make your bathing pure and clean.’ We then said, ‘We pray to Allah to keep our souls in service for your cause.’ We then went with him (the Imam). He (the Imam) entered the bathhouse and we waited until he came out, then we said, ‘May Allah make your bathing pure and clean.’ He (the Imam) said, ‘May Allah cleanse you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/403)"
        ],
        "index": 12660,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:21",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ إِسْمَاعِيلَ بْنِ يَسَارٍ عَنْ عُثْمَانَ بْنِ عَفَّانَ السَّدُوسِيِّ عَنْ بَشِيرٍ النَّبَّالِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْحَمَّامِ فَقَالَ تُرِيدُ الْحَمَّامَ فَقُلْتُ نَعَمْ ",
          "قَالَ فَأَمَرَ بِإِسْخَانِ الْحَمَّامِ ثُمَّ دَخَلَ فَاتَّزَرَ بِإِزَارٍ وَ غَطَّى رُكْبَتَيْهِ وَ سُرَّتَهُ ثُمَّ أَمَرَ صَاحِبَ الْحَمَّامِ فَطَلَى مَا كَانَ خَارِجاً مِنَ الْإِزَارِ ثُمَّ قَالَ اخْرُجْ عَنِّي ثُمَّ طَلَى هُوَ مَا تَحْتَهُ بِيَدِهِ ثُمَّ قَالَ هَكَذَا فَافْعَلْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companons, from sahl Bin Ziyad, from Muhammad Bin Isa, from Ismail Bin Yasaar, from Usman Bin Affan Al Sadousy, from Basheer Al Nabaal who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> the bathhouse, so he<sup>asws</sup> said: ‘Do you want to bathing?’ So I said, ‘Yes’. ",
            "He (the narrator) said, ‘So he<sup>asws</sup> ordered with the warming of the bath, then he<sup>asws</sup> entered it, and he<sup>asws</sup> was wearing a trouser, and his<sup>asws</sup> knees were covered, as well as his<sup>asws</sup> navel. Then he<sup>asws</sup> ordered the one in charge of the bathhouse, so he<sup>asws</sup> anointed what was outside from the trouser. Then he<sup>asws</sup> said: ‘go away from me<sup>asws</sup>’. Then he<sup>asws</sup> anointed what was underneath it by his<sup>asws</sup> own hands, then said: ‘This is how, so do it’."
          ],
          "en.sarwar": [
            "21. Muhammad ibn al-Hassan and Ali ibn Muhammad ibn Bandar have narrated from Ibrahim ibn Ishaq al-Nahawandiy from ‘Abd al- Rahman ibn Hammad from abu Maryam al-Ansariy in a marfu‘ manner has said the following: “Once al-Hassan ibn Ali, ‘Alayhim al-Salam, came out of the bathhouse and someone met him and said, ‘I wish you a fine bathing Istihmam.’ He (the Imam) said, ‘You are poor in vocabulary, why does the word ‘’1st’ (meaning your seeking bath or the word’s other meaning which is ‘buttock’) need to be mentioned?’ He then said, ‘I wish you a good ‘Humaym’ . He (the Imam) said, ‘Did you not know that ‘Humaym’ means perspiration?’ He then said, ‘May your bathhouse be nice.’ He (the Imam) said, ‘If you wish a nice bathhouse then what is for me in it? You should instead say, ‘I wish purity for what is nice of you and nicety of what is pure of you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/403)"
        ],
        "index": 12661,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:22",
        "text": [
          "سَهْلٌ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا يَدْخُلِ الرَّجُلُ مَعَ ابْنِهِ الْحَمَّامَ فَيَنْظُرَ إِلَى عَوْرَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The man should not enter the bathhouse along with his son, so that he would look at his nakedness’."
          ],
          "en.sarwar": [
            "22. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa from ’Isma‘il ibn Yasar from ‘Uthman ibn ‘Affan al-Sadusiy from Bashir al-Nabbal who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about using a bathhouse. He (the Imam) asked, ‘Do you want to take a bath?’ I replied, ‘Yes, I like to take a bath.’ He (the Imam) commanded to warm up the bathhouse. He then entered in it and wore a loincloth, which covered from his belly button down to his knees. Then he commanded the owner of the bathhouse to apply on him (lime or oil) on what was not covered by the loincloth. Then he (the Imam) asked him to move away. He (the Imam) then applied with his hand on the area under the loincloth and said, ‘This is how you must take a bath.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/403)"
        ],
        "index": 12662,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:23",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ عَنْ يُوسُفَ بْنِ السُّخْتِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا تَتَّكِ فِي الْحَمَّامِ فَإِنَّهُ يُذِيبُ شَحْمَ الْكُلْيَتَيْنِ وَ لَا تُسَرِّحْ فِي الْحَمَّامِ فَإِنَّهُ يُرَقِّقُ الشَّعْرَ وَ لَا تَغْسِلْ رَأْسَكَ بِالطِّينِ فَإِنَّهُ يَذْهَبُ بِالْغَيْرَةِ وَ لَا تَتَدَلَّكْ بِالْخَزَفِ فَإِنَّهُ يُورِثُ الْبَرَصَ وَ لَا تَمْسَحْ وَجْهَكَ بِالْإِزَارِ فَإِنَّهُ يَذْهَبُ بِمَاءِ الْوَجْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar, from Ibrahim Bin Is’haq, from Yusuf Bin Al Sukht, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Do not lean (reclining posture) in the bathhouse, for it melts the fat of the kidneys; and do not comb in the bathhouse, for it thins the hair; and do not wash your head with the clay, for it removed the self-esteem; and do not massage with the clay for it inherits the vitiligo; and do not wipe your face with the trouser for it removes the water of the face’."
          ],
          "en.sarwar": [
            "23. Sahl in a marfu‘ manner has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A man must not enter a bathhouse with his son to allow him look at his private parts.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/403)"
        ],
        "index": 12663,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:24",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا تَغْسِلُوا رُءُوسَكُمْ بِطِينِ مِصْرَ فَإِنَّهُ يَذْهَبُ بِالْغَيْرَةِ وَ يُورِثُ الدِّيَاثَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ali Bin Asbaat, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Do not wash your heads with Egyptian clay, for it removes the self-esteem and in inherits the despicability’."
          ],
          "en.sarwar": [
            "24. Ali ibn Muhammad ibn Bandar has narrated from Ibrahim ibn Ishaq from Yusuf ibn al-Sukht in a marfu‘ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You must not lean in a bathhouse; it melts the fat of kidneys. You must not comb in it; it thins out the hairs, do not wash your head with clay; it destroys self-esteem, do not rub (your feet) with pottery; it may cause leprosy and do not wipe your face with loincloths; it destroys the beauty of the face.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/404)"
        ],
        "index": 12664,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:25",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي يَحْيَى الْوَاسِطِيِّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي الْحَسَنِ الْمَاضِي ( عليه السلام ) قَالَ الْعَوْرَةُ عَوْرَتَانِ الْقُبُلُ وَ الدُّبُرُ فَأَمَّا الدُّبُرُ مَسْتُورٌ بِالْأَلْيَتَيْنِ فَإِذَا سَتَرْتَ الْقَضِيبَ وَ الْبَيْضَتَيْنِ فَقَدْ سَتَرْتَ الْعَوْرَةَ ",
          "وَ قَالَ فِي رِوَايَةٍ أُخْرَى وَ أَمَّا الدُّبُرُ فَقَدْ سَتَرَتْهُ الْأَلْيَتَانِ وَ أَمَّا الْقُبُلُ فَاسْتُرْهُ بِيَدِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Abu Yahya Al Wasity, from one of our companions, ",
            "(It has been narrated) from Abu Al-Hassan Al-Maazy<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The private parts are of two types, the front and the back. So as for the back, it is veiled by the two buttocks. So when the manhood and the two organs (under it) are veiled, so the private parts have been veiled’. ",
            "And he<sup>asws</sup> said in another report: ‘And as for the back, so the two buttocks have veiled it, and as for the front, so veil it with your hands’."
          ],
          "en.sarwar": [
            "25. Ali ibn Ibrahim has narrated from his father from Afi ibn Asbat who has said the following: “Abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Do not wash your head with the clay of Misr (Egypt); it destroys self-esteem and may cause one to become a pimp.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/404)"
        ],
        "index": 12665,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:26",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ النَّظَرُ إِلَى عَوْرَةِ مَنْ لَيْسَ بِمُسْلِمٍ مِثْلُ نَظَرِكَ إِلَى عَوْرَةِ الْحِمَارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from someone else, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The looking at a private part of the one who is not a Muslim is like looking at the private parts of the donkey’."
          ],
          "en.sarwar": [
            "26. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from abu Yahya al-Wasitiy from certain persons of our people who has said the following: “Abu al-Hassan, al-Madiy, ‘Alayhi al-Salam, has said, ‘Private parts are two: the front and back. The back is covered with the rump. If you cover the penis and testicles you have covered your private parts.’” In another Hadith it is said, ‘The back is covered with the rump. You can cover the front with your hand.’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/404)"
        ],
        "index": 12666,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:27",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) أَ يَتَجَرَّدُ الرَّجُلُ عِنْدَ صَبِّ الْمَاءِ تُرَى عَوْرَتُهُ أَوْ يُصَبُّ عَلَيْهِ الْمَاءُ أَوْ يَرَى هُوَ عَوْرَةَ النَّاسِ فَقَالَ كَانَ أَبِي يَكْرَهُ ذَلِكَ مِنْ كُلِّ أَحَدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Aban Bin Usman, from Ibn Abu Yafour who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup>, ‘Can the man be bare during the pouring of the water to see his own private parts, or the water is poured over him, or he see the private parts of the people?’ So he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> disliked that from every one’."
          ],
          "en.sarwar": [
            "27. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from more than one person who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Looking at the private parts of non-Muslims is like looking at the private parts of donkeys.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/404)"
        ],
        "index": 12667,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:28",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِفَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ فَلَا يُدْخِلْ حَلِيلَتَهُ الْحَمَّامَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Rafa’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who was a believer in Allah<sup>azwj</sup> and the Last Day, so he should not let his wife go to the bathhouse’."
          ],
          "en.sarwar": [
            "28. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Aban ibn ‘Uthman from ibn abu Ya‘fur who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, if a nude person during pouring water on him can look at his own private parts, or water can be poured on him or he can look at the private parts of others. He (the Imam) said, ‘My father disliked all of it on the part of everyone.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/405)"
        ],
        "index": 12668,
        "local_index": 29,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:29",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ فَلَا يُرْسِلْ حَلِيلَتَهُ إِلَى الْحَمَّامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who was a believer in Allah<sup>azwj</sup> and the Last Day, so he should not send his wife to the bathhouse’."
          ],
          "en.sarwar": [
            "29. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Rifa‘ah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One who believes in Allah and in the Day of Judgment must not allow his wife to go to a bathhouse.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/405)"
        ],
        "index": 12669,
        "local_index": 30,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:30",
        "text": [
          "عَنْهُ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ عَلِيِّ بْنِ يَقْطِينٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) أَقْرَأُ الْقُرْآنَ فِي الْحَمَّامِ وَ أَنْكِحُ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ismail Bin Mihran, from Muhammad Bin Abu Hamza, from Ali Bin Yaqteen who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘Reciting the Quran in the bathhouse and the copulation?’ He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "30. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One who believes in Allah and in the Day of Judgment must not send his wife to a bathhouse.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/405)"
        ],
        "index": 12670,
        "local_index": 31,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:31",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) أَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَنْهَى عَنْ قِرَاءَةِ الْقُرْآنِ فِي الْحَمَّامِ قَالَ لَا إِنَّمَا نَهَى أَنْ يَقْرَأَ الرَّجُلُ وَ هُوَ عُرْيَانٌ فَأَمَّا إِذَا كَانَ عَلَيْهِ إِزَارٌ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, form his father, from Hammad Bin Isa, from Rabi’e Bin Abdullah, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup>, ‘Was Amir Al-Momineen<sup>asws</sup> forbidding from reciting the Quran in the bathhouse?’ He<sup>asws</sup> said: ‘No, but rather he<sup>asws</sup> had forbidden that the man should be reciting whilst he is naked. So when there was a trouser upon him, so there is no problem’."
          ],
          "en.sarwar": [
            "31. It is narrated from the narrator of the previous Hadith from ’Isma‘il ibn Mehran from Muhammad ibn abu Hamzah from Ali ibn Yaqtin who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, ‘Can I read Quran in a bathhouse or do sex?’ He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/405)"
        ],
        "index": 12671,
        "local_index": 32,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:32",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا بَأْسَ لِلرَّجُلِ أَنْ يَقْرَأَ الْقُرْآنَ فِي الْحَمَّامِ إِذَا كَانَ يُرِيدُ بِهِ وَجْهَ اللَّهِ وَ لَا يُرِيدُ يَنْظُرُ كَيْفَ صَوْتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahimm, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is no problem for the man that he should recite the Quran in the bathhouse, when he intends the Face of Allah<sup>azwj</sup> by it, and he does not want to look at how (good) his voice was’."
          ],
          "en.sarwar": [
            "32. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from ‘Rib‘iy ibn ‘ Abd Allah from Muhammad ibn Muslim who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, if ’Amir al-Mu’minin prohibited reading al-Quran in a bathhouse. He (the Imam) said, ’No, he did not prohibit. He however, prohibited reading while nude but if one has a loincloth on him, then it is not harmful. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/405)"
        ],
        "index": 12672,
        "local_index": 33,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:33",
        "text": [
          "بَعْضُ أَصْحَابِنَا عَنِ ابْنِ جُمْهُورٍ عَنْ مُحَمَّدِ بْنِ الْقَاسِمِ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لَا تَضْطَجِعْ فِي الْحَمَّامِ فَإِنَّهُ يُذِيبُ شَحْمَ الْكُلْيَتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "One of our companions, from Ibn Jamhour, from Muhammad Bin Al Qasim, from Ibn Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Do not lie down in the bathhouse, for it melts the fat of the kidneys’."
          ],
          "en.sarwar": [
            "33. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Hammad from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is not harmful if one reads al-Quran in a bathhouse if he does it for the sake of Allah, but not to find out how his voice is.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/405)"
        ],
        "index": 12673,
        "local_index": 34,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:34",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عُمَرَ بْنِ عَلِيِّ بْنِ عُمَرَ بْنِ يَزِيدَ عَنْ عَمِّهِ مُحَمَّدِ بْنِ عُمَرَ عَنْ بَعْضِ مَنْ حَدَّثَهُ أَنَّ أَبَا جَعْفَرٍ ( عليه السلام ) كَانَ يَقُولُ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ فَلَا يَدْخُلِ الْحَمَّامَ إِلَّا بِمِئْزَرٍ ",
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا يَدْخُلِ الرَّجُلُ مَعَ ابْنِهِ الْحَمَّامَ فَيَنْظُرَ إِلَى عَوْرَتِهِ ",
          "وَ قَالَ لَيْسَ لِلْوَالِدَيْنِ أَنْ يَنْظُرَا إِلَى عَوْرَةِ الْوَلَدِ وَ لَيْسَ لِلْوَلَدِ أَنْ يَنْظُرَ إِلَى عَوْرَةِ الْوَالِدِ وَ قَالَ لَعَنَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) النَّاظِرَ وَ الْمَنْظُورَ إِلَيْهِ فِي الْحَمَّامِ بِلَا مِئْزَرٍ .",
          "وَ قَالَ لَيْسَ لِلْوَالِدَيْنِ أَنْ يَنْظُرَا إِلَى عَوْرَةِ الْوَلَدِ وَ لَيْسَ لِلْوَلَدِ أَنْ يَنْظُرَ إِلَى عَوْرَةِ الْوَالِدِ وَ قَالَ لَعَنَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) النَّاظِرَ وَ الْمَنْظُورَ إِلَيْهِ فِي الْحَمَّامِ بِلَا مِئْزَرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Umar Bin Ali Bin Umar Bin Yazeed, from his uncle Muhammad Bin Umar, from one who narrated it that, ",
            "‘Abu Ja’far<sup>asws</sup> was saying: ‘The one who was a believer in Allah<sup>azwj</sup> and the Last Day, so he should not enter the bathhouse except with a loin cloth’. ",
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah, from Muhammad Bin Ja’far, from one of his men, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The man should not enter the bathhouse along with his son, so he would look at his nakedness’. ",
            "And he<sup>asws</sup> said: ‘It is not for the parent that they should look at the private part of the children, and it is not the children that they should look at the nakedness of the parents’. ",
            "And he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> cursed the onlooker and the one looked at in the bathhouse, without a trouser’."
          ],
          "en.sarwar": [
            "34. Certain persons of our people have narrated from ibn Jumhur from Muhammad ibn al-Qasim from ibn abu Ya‘fur who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Do not lie down in a bathhouse; it melts the fat of the kidneys.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/406)"
        ],
        "index": 12674,
        "local_index": 35,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:35",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ عَنْ أَبِي بَصِيرٍ قَالَ دَخَلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْحَمَّامَ فَقَالَ لَهُ صَاحِبُ الْحَمَّامِ أُخْلِيهِ لَكَ فَقَالَ لَا حَاجَةَ لِي فِي ذَلِكَ الْمُؤْمِنُ أَخَفُّ مِنْ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, form sa’adan, from Abu Baseer who said, ",
            "‘Abu Abdullah<sup>asws</sup> entered the bathhouse, so the one in charge of the bathhouse said to him, ‘I shall empty it for you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘There is no need for me<sup>asws</sup> with regards to that is hidden from that’."
          ],
          "en.sarwar": [
            "35. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Umar ibn Ali ibn ‘Umar ibn Yazid from his uncle Muhammad ibn ‘Umar from those who narrated to him who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, would say, ‘One who believes in Allah and in the Day of Judgment must not enter a bathhouse without a loincloth.’ One day he entered a bathhouse and applied lime that covered his body. He (the Imam) then dropped the loincloth and one of his slaves said, ‘I pray to Allah to keep my soul and the souls of my parents in service for your cause, you always instruct us about the necessity of loincloth but you have dropped it.’ He (the Imam) said, ‘Do you not know that lime has fully covered?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/406)"
        ],
        "index": 12675,
        "local_index": 36,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:43:36",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ سَعْدٍ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ مُوسَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ مَنْ أَخَذَ مِنَ الْحَمَّامِ خَزَفَةً فَحَكَّ بِهَا جَسَدَهُ فَأَصَابَهُ الْبَرَصُ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ وَ مَنِ اغْتَسَلَ مِنَ الْمَاءِ الَّذِي قَدِ اغْتُسِلَ فِيهِ فَأَصَابَهُ الْجُذَامُ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ ",
          "قَالَ مُحَمَّدُ بْنُ عَلِيٍّ فَقُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) إِنَّ أَهْلَ الْمَدِينَةِ يَقُولُونَ إِنَّ فِيهِ شِفَاءً مِنَ الْعَيْنِ فَقَالَ كَذَبُوا يَغْتَسِلُ فِيهِ الْجُنُبُ مِنَ الْحَرَامِ وَ الزَّانِي وَ النَّاصِبُ الَّذِي هُوَ شَرُّهُمَا وَ كُلُّ خَلْقٍ مِنْ خَلْقِ اللَّهِ ثُمَّ يَكُونُ فِيهِ شِفَاءٌ مِنَ الْعَيْنِ إِنَّمَا شِفَاءُ الْعَيْنِ قِرَاءَةُ الْحَمْدِ وَ الْمُعَوِّذَتَيْنِ وَ آيَةِ الْكُرْسِيِّ وَ الْبَخُورُ بِالْقُسْطِ وَ الْمُرِّ وَ اللُّبَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, and Muhammad Bin Yahya, from Ali Bin Muhammad Bin Sa’ad, from Muhammad Bin salim, from Musa Bin Abdullah Bin Musa, ",
            "‘Muhammad Bin Ali, son of Ja’far<sup>asws</sup> narrated to us from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘The one who takes clay from the bathhouse and he rubs his body with it, so the vitiligo hits him, so he should not blame anyone except for himself; and the one who washed from the water which had been bathed in, and the leprosy hits him, so he should not blame anyone except for himself’. ",
            "Muhammad Bin Ali (the narrator) said, ‘So I said to Abu Al-Hassan<sup>asws</sup> that the people of Al-Medina are saying that there is a healing in it from the (evil) eyes’. So he<sup>asws</sup> said: ‘They are lying! There bathe in it the ones who have sexual impurities from the Prohibition (adultery), and the adulterer, and the Hostile one (<span class=\"iTxt\">Nasibi</span>) who is the most evil of them, and every creature from the creatures of Allah<sup>azwj</sup>, then there would be a healing in it? But rather, a healing from the (evil) eye is recitation of <span class=\"iTxt\">Al-Hamd</span> (Chapter 1), and <span class=\"iTxt\">Al-Mawazatayn</span> (Chapter 113 & 114), and the Verse of the Chair (2:255), and the vapour of the incense with <span class=\"iTxt\">Al-Qust</span> (saussurea), and <span class=\"iTxt\">Al-Murr </span>(myrhh), and <span class=\"iTxt\">Al-Loban</span> (frankincense)’."
          ],
          "en.sarwar": [
            "36. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from Ahmad ibn Muhammad from ibn ‘Abd Allah from Muhammad ibn Ja‘far from certain persons of his people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘A man must not enter a bathhouse with his son where he can look at his private parts.’ He (the Imam) said, ‘Parents cannot look at the private parts of their children, and children cannot look at the private parts of their parents.’ He (the Imam) then said, ‘The Messenger of Allah has condemned the looking and the one being looked at in a bathhouse when one is without a loincloth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/406)"
        ],
        "part_type": "Hadith",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ عَنْ أَبِي بَصِيرٍ قَالَ دَخَلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْحَمَّامَ فَقَالَ لَهُ صَاحِبُ الْحَمَّامِ أُخْلِيهِ لَكَ فَقَالَ لَا حَاجَةَ لِي فِي ذَلِكَ الْمُؤْمِنُ أَخَفُّ مِنْ ذَلِكَ ."
        ],
        "translations": {
          "en.sarwar": [
            "37. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Sa‘dan from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once entered a bathhouse and the owner of the bathhouse asked him (the Imam), ‘Must I vacate it for you?’ He (the Imam) said, ‘That is not necessary. A believing person (his needs) is lighter than that.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/406)"
        ],
        "part_type": "Hadith",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ سَعْدٍ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ مُوسَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ مَنْ أَخَذَ مِنَ الْحَمَّامِ خَزَفَةً فَحَكَّ بِهَا جَسَدَهُ فَأَصَابَهُ الْبَرَصُ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ وَ مَنِ اغْتَسَلَ مِنَ الْمَاءِ الَّذِي قَدِ اغْتُسِلَ فِيهِ فَأَصَابَهُ الْجُذَامُ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُقَالَ مُحَمَّدُ بْنُ عَلِيٍّ فَقُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) إِنَّ أَهْلَ الْمَدِينَةِ يَقُولُونَ إِنَّ فِيهِ شِفَاءً مِنَ الْعَيْنِ فَقَالَ كَذَبُوا يَغْتَسِلُ فِيهِ الْجُنُبُ مِنَ الْحَرَامِ وَ الزَّانِي وَ النَّاصِبُ الَّذِي هُوَ شَرُّهُمَا وَ كُلُّ خَلْقٍ مِنْ خَلْقِ اللَّهِ ثُمَّ يَكُونُ فِيهِ شِفَاءٌ مِنَ الْعَيْنِ إِنَّمَا شِفَاءُ الْعَيْنِ قِرَاءَةُ الْحَمْدِ وَ الْمُعَوِّذَتَيْنِ وَ آيَةِ الْكُرْسِيِّ وَ الْبَخُورُ بِالْقُسْطِ وَ الْمُرِّ وَ اللُّبَانِ ."
        ],
        "translations": {
          "en.sarwar": [
            "38. Al-Husayn ibn Muhammad and Muhammad ibn Yahya has narrated from Ali ibn Muhammad from Sa‘d ibn Muhammad ibn Salim from Musa ibn ‘Abd Allah ibn Musa who has said that narrated to us Ali ibn Ja‘far the following: “Abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, has said, ‘If one picks up a piece of pottery from a bathhouse and rubs himself with it, then becomes ill with leprosy he must not blame anyone except himself. One who washes with the used water of a bathhouse and becomes ill with leprosy, he also must not blame anyone else except himself.’ Muhammad ibn Ali has said, ‘I said to abu al-Hassan, ‘Alayhi al-Salam, that people of al-Madinah say, “There is cure (and protection) in it against the evil effect of the eyes.’” He (the Imam) said, ‘They have spoken a lie. In it people after unlawful sexual acts bathe and fornicators bathe. In it, the worst of all creatures that Allah has created, the enemies of Ahl al-Bayt, bathe and then they say that there is cure (and protection) in it against the evil effects of the eyes. Cure for the eyes because of such effect is in reading al-Hamd (Chapter one) and al-Ma‘udhatayn (chapters One Hundred Thirteen and One Hundred Fourteen), Ayatu al-Kursi (2:255) and burning incense of al-Qust, (a certain Indian or Arabian wood), al-Murr (gum of a certain tree) and al-Luban (frankincense).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:8:43",
  "kind": "verse_list"
}