{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:6:8:45",
        "titles": {
          "ar": "باب النُّورَةِ",
          "en": "Chapter 45 – Al Noura (The lime paste)"
        }
      }
    ],
    "index": 1950,
    "local_index": 45,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:8:45",
    "titles": {
      "ar": "باب النُّورَةِ",
      "en": "Chapter 45 – Al Noura (The lime paste)"
    },
    "verse_count": 15,
    "verse_start_index": 12682,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/408)"
        ],
        "index": 12683,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سُلَيْمٍ الْفَرَّاءِ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) النُّورَةُ طَهُورٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, form Suleym Al Fara’a who said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘<span class=\"iTxt\">Al-Noura</span> is a cleanser’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Sulaym al-Farra’ who has said the following: “’Amir al-Mu’minin, ‘Alayhi al-Salam, has said, Time is a cleansing (agent).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/408)"
        ],
        "index": 12684,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ دَخَلْتُ مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْحَمَّامَ فَقَالَ لِي يَا عَبْدَ الرَّحْمَنِ اطَّلِ فَقُلْتُ إِنَّمَا اطَّلَيْتُ مُنْذُ أَيَّامٍ فَقَالَ اطَّلِ فَإِنَّهَا طَهُورٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, form Al Hajjal, from Hammad Bin Usman, ",
            "(It has been narrated) from Abdul Rahman Bin Abu Abdullah<sup>asws</sup> having said: ‘I entered the bathhouse along with Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘O Abdul Rahman! Get waxing done’. So I said, ‘But rather I waxed a few days ago’. So he<sup>asws</sup> said: ‘Get waxing done for it is a cleansing’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hajj al from Hammad ibn ‘Uthaman from ‘Abd al-Rahman ibn abu ‘Abd Allah who has said the following: “Once I went to a bathhouse with abu ‘Abd Allah, ‘Alayhi al-Salam. He (the Imam) said, ‘O ‘Abd al- Rahman, you should apply lime.’ I said, ‘I had applied sometimes ago.’ He (the Imam) said, ’Apply it again; it is cleansing.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/409)"
        ],
        "index": 12685,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:3",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِي كَهْمَسٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ قَالَ دَخَلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْحَمَّامَ وَ أَنَا أُرِيدُ أَنْ أَخْرُجَ مِنْهُ فَقَالَ يَا مُحَمَّدُ أَ لَا تَطَّلِي فَقُلْتُ عَهْدِي بِهِ مُنْذُ أَيَّامٍ فَقَالَ أَ مَا عَلِمْتَ أَنَّهَا طَهُورٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ibn Fazzal, from Ali Bin Uqba, from Abu Kahmas, from Muhammad Bin Abdullah Bin Ali Bin Al Husayn who said, ",
            "‘Abu Abdullah<sup>asws</sup> entered the bathhouse and I wanted to exit from it. So he<sup>asws</sup> said: ‘O Muhammad! Did you not get waxing done?’ So I said, ‘I did apply with it a few days ago’. So he<sup>asws</sup> said: ‘But do you not know that it is a cleansing?’"
          ],
          "en.sarwar": [
            "3. Ahmad ibn Muhammad has narrated from ibn Faddal from Ali ibn ‘Uqbah from abu Kahmas from Muhammad ibn ‘Abd Allah ibn Ali ibn al-Husayn who has said the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, entered a bathhouse when I was coming out. He (the Imam) said, ‘O Muhammad, do you like to apply (lime)?’ I replied, ‘Just a few days ago I had applied it.’ He (the Imam) said, ‘Do you know that it is purifying?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/409)"
        ],
        "index": 12686,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ خَلَفِ بْنِ حَمَّادٍ عَمَّنْ رَوَاهُ قَالَ بَعَثَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ابْنَ أَخِيهِ فِي حَاجَةٍ فَجَاءَ وَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَدِ اطَّلَى بِالنُّورَةِ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) اطَّلِ فَقَالَ إِنَّمَا عَهْدِي بِالنُّورَةِ مُنْذُ ثَلَاثٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ النُّورَةَ طَهُورٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, form Ahmad Bin Abu Abdullah, from his father, from Khalaf Bin Hammad, from the one who reported it who said, ",
            "‘Abu Abdullah<sup>asws</sup> send a son of his<sup>asws</sup> brother regarding a need, so he came and Abu Abdullah<sup>asws</sup> waxed with <span class=\"iTxt\">Al-Noura</span>. So Abu Abdullah<sup>asws</sup> said: ‘Get waxing done’. So he said, ‘But rather, I had waxing done three (days) ago’. So Abu Abdullah<sup>asws</sup> said: ‘<span class=\"iTxt\">Al-Noura</span> is a cleanser’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from his father from Khalaf ibn Hammad from those who narrated to him who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once sent the son of his brother for something he needed. He returned when abu ‘Abd Allah, ‘Alayhi al-Salam, had applied lime paste. He (the Imam) said, ‘Apply lime paste.’ He said, ‘Only three days ago I had applied it.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘Applying lime is purifying.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/409)"
        ],
        "index": 12687,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:5",
        "text": [
          "عَنْهُ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ النَّهِيكِيِّ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ أَلْقُوا عَنْكُمُ الشَّعْرَ فَإِنَّهُ يُحَسِّنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Abdullah Bin Muhammad Al Naheyki, from Ibrahim Bin Abdul Hameed who said, ",
            "‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘Cast off the hair from yourselves for it beautifies’."
          ],
          "en.sarwar": [
            "5. It is narrated from the narrator of the previous Hadith from ‘Abd Allah ibn Muhammad al-Nuhaykiy from Ibrahim ibn ‘Abd al-Hamid who has said the following: “I once heard abu al-Hassan, ‘Alayhi al-Salam, saying, ‘Remove hairs from yourselves; it beautifies.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/409)"
        ],
        "index": 12688,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ كُنْتُ مَعَهُ أَقُودُهُ فَأَدْخَلْتُهُ الْحَمَّامَ فَرَأَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَتَنَوَّرُ فَدَنَا مِنْهُ أَبُو بَصِيرٍ فَسَلَّمَ عَلَيْهِ فَقَالَ يَا أَبَا بَصِيرٍ تَنَوَّرْ فَقَالَ إِنَّمَا تَنَوَّرْتُ أَوَّلَ مِنْ أَمْسِ وَ الْيَوْمَ الثَّالِثَ فَقَالَ أَ مَا عَلِمْتَ أَنَّهَا طَهُورٌ فَتَنَوَّرْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from one of his companions, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘I (Abu Hamza) was with him (Abu Baseer) guiding him (as he was blind), so I entered the bathhouse, and I saw Abu Abdullah<sup>asws</sup> applying <span class=\"iTxt\">Noura</span>. So Abu Baseer went near him and greeted him<sup>asws</sup>, so he<sup>asws</sup> said: ‘O Abu Baseer! Apply <span class=\"iTxt\">Noura</span>’. So he said, ‘But rather, I had applied <span class=\"iTxt\">Noura</span> first thing yesterday, and the third day’. So he<sup>asws</sup> said: ‘But do you not know that is it a cleanser? Therefore you should apply <span class=\"iTxt\">Noura</span>’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from certain persons of his people from Ali ibn abu Hamzah from abu Basir who has said the following: “I once led abu Basir to a bathhouse and I saw abu ‘Abd Allah, ‘Alayhi al-Salam, apply lime. Abu Basir went close to him (the Imam) and offered greeting of peace. He (the Imam) asked, ‘O abu Basir, do you like to apply lime paste?’ He replied, ‘Only three days ago I had applied it.’ He (the Imam) said, ‘Do you know that it is purification? So you should apply it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/409)"
        ],
        "index": 12689,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:7",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) النُّورَةُ نُشْرَةٌ وَ طَهُورٌ لِلْجَسَدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘<span class=\"iTxt\">Al-Noura</span> is an advertisement (of beauty) and a cleanser for the body’."
          ],
          "en.sarwar": [
            "7. Ahmad ibn Muhammad has narrated from al-Qasim ibn Yahya from his grandfather al-Hassan ibn Rashid from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ‘Applying lime paste is a protective charm and purification (for the body).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/409)"
        ],
        "index": 12690,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:8",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أُحِبُّ لِلْمُؤْمِنِ أَنْ يَطَّلِيَ فِي كُلِّ خَمْسَةَ عَشَرَ يَوْماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘I<sup>asws</sup> would love it for the Believer if he were to wax (to remove unwanted hair) during every fifteen days’."
          ],
          "en.sarwar": [
            "8. Ahmad ibn Muhammad has narrated from al-Qasim ibn Yahya from his grandfather al-Hassan ibn Rashid from Muhammad ibn Muslim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ‘I like for the believers to apply (lime) paste after every fifteen days.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/410)"
        ],
        "index": 12691,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَحْمَدَ بْنِ الْمُبَارَكِ عَنِ الْحُسَيْنِ بْنِ أَحْمَدَ بْنِ الْمِنْقَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ السُّنَّةُ فِي النُّورَةِ فِي كُلِّ خَمْسَةَ عَشَرَ يَوْماً فَإِنْ أَتَتْ عَلَيْكَ عِشْرُونَ يَوْماً وَ لَيْسَ عِنْدَكَ فَاسْتَقْرِضْ عَلَى اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ali Bin Ibrahim, from his father, altogether from Ahmad Bin Muhammad Bin Abu Nasr, from Ahmad Bin Al Mubarak, from Al Husayn Bin Ahmad Bin Al Minqary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Sunnah regarding <span class=\"iTxt\">Al-Noura</span> is every fifteen days, so if twenty days were to come to you and it is not in your possession, so borrow upon Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Sahl ibn Ziyad and Ali ibn Ibrahim has narrated from his father from all Ahmad ibn Muhammad from ibn abu Nasr from Ahmad ibn al-Mubarak from al-Husayn ibn Ahmad al-Minqariy who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘The Sunnah about lime paste is to apply it after every fifteen days. If it becomes twenty days but you do not have it, you must borrow on the account of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/410)"
        ],
        "index": 12692,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قِيلَ لَهُ يَزْعُمُ بَعْضُ النَّاسِ أَنَّ النُّورَةَ يَوْمَ الْجُمُعَةِ مَكْرُوهَةٌ فَقَالَ لَيْسَ حَيْثُ ذَهَبْتَ أَيُّ طَهُورٍ أَطْهَرُ مِنَ النُّورَةِ يَوْمَ الْجُمُعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ahmad Bin Abu Abdullah, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup>, said, ‘It was said to him<sup>asws</sup>, ‘Some of the people are alleging that <span class=\"iTxt\">Al-Noura</span> is disliked on the day of Friday’. So he<sup>asws</sup> said: ‘It is not where you are going. Which cleanser is more purifying than <span class=\"iTxt\">Al-Noura</span> on the day of Friday?’"
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from Ahmad ibn abu ‘Abd Allah in a marfu ‘ has said the following: “Once it was said to abu ‘Abd Allah, ‘Alayhi al-Salam, that certain people think applying lime paste on Friday is detestable. He (the Imam) said, ‘It is not as they think. Which cleansing agent is more cleansing than lime on Friday?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/410)"
        ],
        "index": 12693,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ فَلَا يَتْرُكْ عَانَتَهُ فَوْقَ أَرْبَعِينَ يَوْماً وَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ أَنْ تَدَعَ ذَلِكَ مِنْهَا فَوْقَ عِشْرِينَ يَوْماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrhim, form his father, from Al Nowfaly, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who was a believer in Allah<sup>azwj</sup> and the Last Day, so he should not leave his pubic hair for more than forty days, nor is it Permissible for a woman who believes in Allah<sup>azwj</sup> and the Last Day that she should leave that from her for more than twenty days’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘One who believes in Allah and in the Day of Judgment, must not keep his pubic hairs for more than forty days. It is not lawful for a woman who believes in Allah and in the Day of Judgment to keep that in her case for more than twenty days.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/410)"
        ],
        "index": 12694,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:12",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ ثَعْلَبَةَ عَنْ عَمَّارٍ السَّابَاطِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) طَلْيَةٌ فِي الصَّيْفِ خَيْرٌ مِنْ عَشْرٍ فِي الشِّتَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hasan Bin Ali Al Washa, from Ahmad Bin Sa’aba, from Ammar Al Sabaty who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Waxing in the summer is better than ten in the winter’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Ali al-Washsha’ from Ahmad ibn Tha’labah from ‘Ammar al-Sabatiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Applying (lime paste) once in summer is better than applying it ten times in winter.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/410)"
        ],
        "index": 12695,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:13",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنِ السَّيَّارِيِّ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ أَرَادَ الِاطِّلَاءَ بِالنُّورَةِ فَأَخَذَ مِنَ النُّورَةِ بِإِصْبَعِهِ فَشَمَّهُ وَ جَعَلَ عَلَى طَرَفِ أَنْفِهِ وَ قَالَ صَلَّى اللَّهُ عَلَى سُلَيْمَانَ بْنِ دَاوُدَ كَمَا أَمَرَنَا بِالنُّورَةِ لَمْ تُحْرِقْهُ النُّورَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar, form Al Sayyari, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The one who wants the waxing with <span class=\"iTxt\">Al-Noura</span>n, so he should take from <span class=\"iTxt\">Al-Noura</span> with his fingers, and paste it upon the sides of his nose and say, ‘May Allah<sup>azwj</sup> Send Blessings upon Suleyman<sup>as</sup> Bin Dawood<sup>as</sup> just as he<sup>as</sup> ordered us with <span class=\"iTxt\">Al-Noura</span>’, would not be burnt by <span class=\"iTxt\">Al-Noura</span>’."
          ],
          "en.sarwar": [
            "13. Ali ibn Muhammad ibn Bandar has narrated from al-Sayyariy in a marfu‘ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one wants to apply lime paste, he must take from it with his finger, smell it, place it on the tip of his nose and say, ‘O Allah, grant favors to Sulayman ibn Dawud who taught us applying lime paste’ the lime will not burn him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/411)"
        ],
        "index": 12696,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:14",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ حُذَيْفَةَ بْنِ مَنْصُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَطْلِي الْعَانَةَ وَ مَا تَحْتَ الْأَلْيَتَيْنِ فِي كُلِّ جُمُعَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin sinan, from Huzyefa Bin Mansour who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> used to wax the unwanted hairs, and what is beneath the kidneys, during every Friday’."
          ],
          "en.sarwar": [
            "14. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn Sinan from Hudhayfah ibn Mansur who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would apply lime paste to the pubic region and under the rump every Friday.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/411)"
        ],
        "index": 12697,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:45:15",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ زُرَيْقِ بْنِ الزُّبَيْرِ عَنْ سَدِيرٍ أَنَّهُ سَمِعَ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) يَقُولُ مَنْ قَالَ إِذَا اطَّلَى بِالنُّورَةِ اللَّهُمَّ طَيِّبْ مَا طَهُرَ مِنِّي وَ طَهِّرْ مَا طَابَ مِنِّي وَ أَبْدِلْنِي شَعْراً طَاهِراً لَا يَعْصِيكَ",
          "اللَّهُمَّ إِنِّي تَطَهَّرْتُ ابْتِغَاءَ سُنَّةِ الْمُرْسَلِينَ وَ ابْتِغَاءَ رِضْوَانِكَ وَ مَغْفِرَتِكَ فَحَرِّمْ شَعْرِي وَ بَشَرِي عَلَى النَّارِ وَ طَهِّرْ خَلْقِي وَ طَيِّبْ خُلُقِي وَ زَكِّ عَمَلِي وَ اجْعَلْنِي مِمَّنْ يَلْقَاكَ عَلَى الْحَنِيفِيَّةِ السَّمْحَةِ مِلَّةِ إِبْرَاهِيمَ خَلِيلِكَ وَ دِينِ مُحَمَّدٍ ( صلى الله عليه وآله ) حَبِيبِكَ وَ رَسُولِكَ عَامِلًا بِشَرَائِعِكَ تَابِعاً لِسُنَّةِ نَبِيِّكَ ( صلى الله عليه وآله ) آخِذاً بِهِ مُتَأَدِّباً بِحُسْنِ تَأْدِيبِكَ وَ تَأْدِيبِ رَسُولِكَ وَ تَأْدِيبِ أَوْلِيَائِكَ الَّذِينَ غَذَوْتَهُمْ بِأَدَبِكَ وَ زَرَعْتَ الْحِكْمَةَ فِي صُدُورِهِمْ وَ جَعَلْتَهُمْ مَعَادِنَ لِعِلْمِكَ صَلَوَاتُكَ عَلَيْهِمْ ",
          "مَنْ قَالَ ذَلِكَ طَهَّرَهُ اللَّهُ مِنَ الْأَدْنَاسِ فِي الدُّنْيَا وَ مِنَ الذُّنُوبِ وَ أَبْدَلَهُ شَعْراً لَا يَعْصِي اللَّهَ وَ خَلَقَ اللَّهُ بِكُلِّ شَعْرَةٍ مِنْ جَسَدِهِ مَلَكاً يُسَبِّحُ لَهُ إِلَى أَنْ تَقُومَ السَّاعَةُ وَ إِنَّ تَسْبِيحَةً مِنْ تَسْبِيحِهِمْ تَعْدِلُ بِأَلْفِ تَسْبِيحَةٍ مِنْ تَسْبِيحِ أَهْلِ الْأَرْضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Zureyq Bin Al Zubeyr, ",
            "(It has been narrated) from Sadeyr who heard Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> saying: ‘The one who says, whenever he waxes with <span class=\"iTxt\">Al-Noura</span>, ‘O Allah<sup>azwj</sup>! Make good what is clean from me, and Purify what is good from me, and replace for me with clean hair which would not disobey You<sup>azwj</sup>. ",
            "O Allah<sup>azwj</sup>! I have cleaned seeking a Sunnah of the <span class=\"iTxt\">Mursil</span> Prophets<sup>as</sup>, and seeking You<sup>azwj</sup> Pleasure, and Your<sup>azwj</sup> Forgiveness, therefore Prohibit my hair and my person upon the Fire, and Purify my creation (body) and Make good my manners, and Purify my deeds, and Make me to be from the ones who would be meeting You<sup>azwj</sup> upon the upright, the tolerant Religion of Ibrahim<sup>as</sup>, Your<sup>azwj</sup> Friend, and the Religion of Muhammad<sup>saww</sup>, Your<sup>azwj</sup> Beloved, and Your<sup>azwj</sup> Rasool<sup>saww</sup>, having abided by Your<sup>azwj</sup> Laws, a follower of the Sunnah of Your<sup>azwj</sup> Prophet<sup>saww</sup>, having taken by it an education with the best of Your<sup>azwj</sup> Education, and education of Your<sup>azwj</sup> Rasool<sup>saww</sup>, and the education of Your<sup>azwj</sup> Guardians<sup>asws</sup> whom You<sup>azwj</sup> Sustained with Your<sup>azwj</sup> Education, and Cultivated the Wisdom in their<sup>asws</sup> chests, and Made them the educators of Your<sup>azwj</sup> Knowledge, may Blessing be upon them<sup>asws</sup>’. ",
            "The one who says that, Allah<sup>azwj</sup> would Purify him from the filth in the world, and from the sins, and Replace for him with hair which would not disobey Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> would Created for every hair from his body, an Angel who would Glorify for him up to the Establishment of the Hour, and that a Glorification from its Glorifications equates with one thousand Glorifications from the Glorifications of the people of the earth’."
          ],
          "en.sarwar": [
            "15. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from Zurayq ibn al-Zubayr from Sadir who has said the following: “I once heard Ali ibn al-Husayn, ‘Alayhim al-Salam, saying, ‘When applying lime paste one should say, “O Lord, make pleasant what it has cleansed of me and cleanse what it has made pleasant of me. Replace it with clean hairs, which will not disobey You. O Lord, I have cleansed and sought to follow the Sunnah of the messengers, Your pleasure and forgiveness so make my hairs unlawful to the fire as well as my skin. O Lord, cleanse my body, my moral feelings, purify my acts and make me of those who meet You as a follower of the magnanimous religion of Ibrahim Your friend. Make me to meet You as a follower of the religion of Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, your beloved one, Your messenger. (O Lord), make me to abide by Your laws, subordinate to the Sunnah of Your prophet, accept it to find discipline by its disciplines and the discipline of Your friends whom You have fed with Your discipline, planted wisdom in their chest and have made them the mines of Your knowledge. Please grant them favors.’” If one says the above Allah cleanses him from filth of the world and from sins and replaces his hairs with hairs, which will not disobey Allah. He will create with every hair of his body an angel who will say Tasbih (Allah is free of all defects) for him until the Day of Judgment. One Tasbih (Allah is free of all defects) of this angel is equal to one thousand Tasbih (Allah is free of all defects) of the inhabitants of earth.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:8:45",
  "kind": "verse_list"
}