{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 47"
        },
        "path": "/books/al-kafi:6:8:47",
        "titles": {
          "ar": "باب الْحِنَّاءِ بَعْدَ النُّورَةِ",
          "en": "Chapter 47 – The (Application of) the Henna after the Noura"
        }
      }
    ],
    "index": 1952,
    "local_index": 47,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 48"
        },
        "path": "/books/al-kafi:6:8:48",
        "titles": {
          "ar": "باب الطِّيبِ",
          "en": "Chapter 48 – The Perfume"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/al-kafi:6:8:46",
        "titles": {
          "ar": "باب الْإِبْطِ",
          "en": "Chapter 46 – The Armpit"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:8:47",
    "titles": {
      "ar": "باب الْحِنَّاءِ بَعْدَ النُّورَةِ",
      "en": "Chapter 47 – The (Application of) the Henna after the Noura"
    },
    "verse_count": 5,
    "verse_start_index": 12704,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/413)"
        ],
        "index": 12705,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:47:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدِ</span> بْنِ بُنْدَارَ وَ مُحَمَّدُ بْنُ الْحَسَنِ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ عَنِ الْحُسَيْنِ بْنِ مُوسَى قَالَ كَانَ أَبِي مُوسَى بْنُ جَعْفَرٍ ( عليه السلام ) إِذَا أَرَادَ دُخُولَ الْحَمَّامِ أَمَرَ أَنْ يُوقَدَ لَهُ عَلَيْهِ ثَلَاثاً وَ كَانَ لَا يُمْكِنُهُ دُخُولُهُ حَتَّى يَدْخُلَهُ السُّودَانُ فَيُلْقُونَ لَهُ اللُّبُودَ فَإِذَا دَخَلَهُ فَمَرَّةً قَاعِدٌ وَ مَرَّةً قَائِمٌ ",
          "فَخَرَجَ يَوْماً مِنَ الْحَمَّامِ فَاسْتَقْبَلَهُ رَجُلٌ مِنْ آلِ الزُّبَيْرِ يُقَالُ لَهُ كُنَيْدٌ وَ بِيَدِهِ أَثَرُ حِنَّاءٍ فَقَالَ مَا هَذَا الْأَثَرُ بِيَدِكَ فَقَالَ أَثَرُ حِنَّاءٍ فَقَالَ وَيْلَكَ يَا كُنَيْدُ حَدَّثَنِي أَبِي وَ كَانَ أَعْلَمَ أَهْلِ زَمَانِهِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ دَخَلَ الْحَمَّامَ فَاطَّلَى ثُمَّ أَتْبَعَهُ بِالْحِنَّاءِ مِنْ قَرْنِهِ إِلَى قَدَمِهِ كَانَ أَمَاناً لَهُ مِنَ الْجُنُونِ وَ الْجُذَامِ وَ الْبَرَصِ وَ الْآكِلَةِ إِلَى مِثْلِهِ مِنَ النُّورَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar and Muhammad Bin Al Hassan, altogether from Ibrahim Bin Is’haq Al Ahmar, ",
            "(It has been narrated) from Al-Husayn son of Musa<sup>asws</sup> who said, ‘My father<sup>asws</sup> Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>, whenever he<sup>asws</sup> wanted to enter the bathhouse, ordered that it should be ignited for him with three (people) being over it, and he<sup>asws</sup> would not enter it until the slaves enter it and they would be laying down the matting for him. So when he<sup>asws</sup> entered it, (into the bath) he<sup>asws</sup> would be seated for a while, and standing for a while.  ",
            "So one day he<sup>asws</sup> came out from the bathhouse, and a man from the progeny of Al-Zubeyr called Kuneyd met him<sup>asws</sup>, and in his<sup>asws</sup> hands were the traces of henna. So he said, ‘What are these traces in your<sup>asws</sup> hands?’ So he<sup>asws</sup> said: ‘Traces of henna. Woe be unto you O Kuneyd! My<sup>asws</sup> father<sup>asws</sup> narrated to me, and he<sup>asws</sup> was the most knowledgeable of the people of his<sup>asws</sup> time, from his<sup>asws</sup> father<sup>asws</sup>, from his<sup>asws</sup> grandfather<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who enters the bathhouse, so he waxes, then follows it up with the henna from his head to his feet, it would be a safety for him from the insanity, and the leprosy, and the vitiligo, and the corrosion to such like, from the <span class=\"iTxt\">Noura</span>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Muhammad ibn Bandar and Muhammad ibn al-Hassan all have narrated from Ibrahim ibn Ishaq al-Ahmar from al-Husayn ibn Musa who has said the following: “Al-Husayn ibn Musa has said, ‘When my father, Musa ibn Ja‘far, ‘Alayhim al-Salam, wanted to take a bath, he asked to fire the bathhouse for him by three (people). He could not enter the bathhouse until the servants spread for him the felt on the floor (because of heat). When he entered the bathhouse, he sat once, then stood up once. One day when he came out of the bathhouse, he met a man from the family of al-Zubayr called Kunayd who saw the marks of henna on his hand and asked about it. He (the Imam) said, ‘This is the mark of henna.’ He (the Imam) said, ‘Woe up on you, O Kunayd, (for not knowing). My father was the most knowledgeable person of his time. He narrated from his father from his grandfather who has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has stated this Hadith. “If one goes to the bathhouse, applies lime paste, then applies henna from top to his toes, it is immunity for him from insanity, leprosy, albinism and erosion caused by lime paste.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/413)"
        ],
        "index": 12706,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:47:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُعَاوِيَةَ بْنِ مَيْسَرَةَ عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ قَالَ رَأَيْتُ أَبَا جَعْفَرٍ ( عليه السلام ) وَ قَدْ أَخَذَ الْحِنَّاءَ وَ جَعَلَهُ عَلَى أَظَافِيرِهِ فَقَالَ يَا حَكَمُ مَا تَقُولُ فِي هَذَا فَقُلْتُ مَا عَسَيْتُ أَنْ أَقُولَ فِيهِ وَ أَنْتَ تَفْعَلُهُ وَ إِنَّ عِنْدَنَا يَفْعَلُهُ الشُّبَّانُ فَقَالَ يَا حَكَمُ إِنَّ الْأَظَافِيرَ إِذَا أَصَابَتْهَا النُّورَةُ غَيَّرَتْهَا حَتَّى تُشْبِهَ أَظَافِيرَ الْمَوْتَى فَغَيِّرْهَا بِالْحِنَّاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Muawiya Bin Maysara, from Al Hakam Bin Uteyba who said, ",
            "‘I saw Abu Ja’far<sup>asws</sup> and he<sup>asws</sup> had taken the henna and made it to be upon his<sup>asws</sup> nails, so he<sup>asws</sup> said: ‘O Hakam! What are you saying regarding this?’ So I said, ‘What can I say and you<sup>asws</sup> have done it, and among us it is the youth who do it’. So he<sup>asws</sup> said: ‘O Hakam! When the nails are hit by the <span class=\"iTxt\">Noura</span>, it changes them until they resemble the nails of the dead, therefore change it back by the henna’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Mu‘awiyah ibn Maysarah from al-Hakam ibn ‘Utaybah who has said the following: “Once I saw abu Ja‘far, ‘Alayhi al-Salam, who had placed henna on his finger nails and asked me, ‘O Hakam, what do you say about it? I replied, ‘I cannot say anything when you have done so. In our town young people do so.’ He (the Imam) said, ‘O Hakam, when fingers touch lime paste their color change and they look like fingers of dead people but you can change that kind of change of color with henna.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/414)"
        ],
        "index": 12707,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:47:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ قَالَ مَنِ اطَّلَى فَتَدَلَّكَ بِالْحِنَّاءِ مِنْ قَرْنِهِ إِلَى قَدَمِهِ نُفِيَ عَنْهُ الْفَقْرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from one of our companions, raising it, ",
            "‘He<sup>asws</sup> said: ‘The one who waxes and massages with the henna from his head to his feet, the poverty is negated from him’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from certain persons of our people in a marfu ‘ manner has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘If one applies lime paste then rubs henna from his top to his toes, his poverty goes away.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/414)"
        ],
        "index": 12708,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:47:4",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ عُبْدُوسِ بْنِ إِبْرَاهِيمَ قَالَ رَأَيْتُ أَبَا جَعْفَرٍ ( عليه السلام ) وَ قَدْ خَرَجَ مِنَ الْحَمَّامِ وَ هُوَ مِنْ قَرْنِهِ إِلَى قَدَمِهِ مِثْلُ الْوَرْدَةِ مِنْ أَثَرِ الْحِنَّاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Ubdous Bin Ibrahim who said, ",
            "‘I saw Abu Ja’far<sup>asws</sup> and he<sup>asws</sup> had come out from the bathhouse, and he<sup>asws</sup> was like the rose from his<sup>asws</sup> head to his<sup>asws</sup> feet, from the effects of the henna’."
          ],
          "en.sarwar": [
            "4. It is narrated from the narrator of the previous Hadith from Ahmad ibn ‘Ubdus ibn Ibrahim who has said the following: “I once saw abu Ja‘far, ‘Alayhi al-Salam, coming out of the bathhouse and he looked like a flower from his top to his toes because of applying henna.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/414)"
        ],
        "index": 12709,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:47:5",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنِ الْحُسَيْنِ بْنِ مُوسَى قَالَ كَانَ أَبُو الْحَسَنِ ( عليه السلام ) مَعَ رَجُلٍ عِنْدَ قَبْرِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَنَظَرَ إِلَيْهِ وَ قَدْ أَخَذَ الْحِنَّاءَ مِنْ يَدَيْهِ فَقَالَ بَعْضُ أَهْلِ الْمَدِينَةِ أَ مَا تَرَوْنَ إِلَى هَذَا كَيْفَ أَخَذَ الْحِنَّاءَ مِنْ يَدَيْهِ فَالْتَفَتَ إِلَيْهِ فَقَالَ لَهُ فِيهِ مَا تَخْبُرُهُ وَ مَا لَا تَخْبُرُهُ ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ إِنَّهُ مَنْ أَخَذَ مِنَ الْحِنَّاءِ بَعْدَ فَرَاغِهِ مِنِ اطِّلَاءِ النُّورَةِ مِنْ قَرْنِهِ إِلَى قَدَمِهِ أَمِنَ مِنَ الْأَدْوَاءِ الثَّلَاثَةِ الْجُنُونِ وَ الْجُذَامِ وَ الْبَرَصِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, form Salih Bin Abu Hammad, from Ibrahim Bin Uqba, from Al Husayn Bin Musa who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> was with a man in the presence of the grave of Rasool-Allah<sup>saww</sup>, so he looked at him<sup>asws</sup> and he<sup>asws</sup> had applied henna upon his<sup>asws</sup> hands. So one of the people of Al-Medina said, ‘Are you not looking at this one how he<sup>asws</sup> has applied the henna upon his<sup>asws</sup> hands?’ So he<sup>asws</sup> turned towards him and said to him: ‘In it is what you are informed of and what you are not informed of’. Then he<sup>asws</sup> turned towards me, so he<sup>asws</sup> said: ‘The one who takes from the henna after him having been freed from the waxing of the <span class=\"iTxt\">Noura</span>, from his head to his feet, is safe from three illnesses – the insanity, and the leprosy, and the vitiligo’."
          ],
          "en.sarwar": [
            "5. Ali ibn Muhammad has narrated from Salih ibn abu Hammad from Ibrahim ibn ‘Uqbah from Al-Husayn ibn Musa who has said the following: “Once abu al-Hassan, ‘Alayhi al-Salam, was with a man near the grave of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. He looked at him (the Imam) and found his hands had the color of henna on them. Certain ones of the people of al-Madinah said, ‘Look at him. His hands are colored with henna.’ He (the Imam) turned to him and said, ‘In henna there is what you know as well as what you do not know.’ He (the Imam) then said, ‘If one after applying lime paste rubs henna all over his body, he gains immunity from three things, namely, insanity, leprosy and albinism.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:8:47",
  "kind": "verse_list"
}