{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 51"
        },
        "path": "/books/al-kafi:6:8:51",
        "titles": {
          "ar": "باب أَصْلِ الطِّيبِ",
          "en": "Chapter 51 – The origination of the perfume"
        }
      }
    ],
    "index": 1956,
    "local_index": 51,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:8:51",
    "titles": {
      "ar": "باب أَصْلِ الطِّيبِ",
      "en": "Chapter 51 – The origination of the perfume"
    },
    "verse_count": 3,
    "verse_start_index": 12732,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/419)"
        ],
        "index": 12733,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:51:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا أُهْبِطَ آدَمُ ( عليه السلام ) مِنَ الْجَنَّةِ عَلَى الصَّفَا وَ حَوَّاءُ عَلَى الْمَرْوَةِ وَ قَدْ كَانَتِ امْتَشَطَتْ فِي الْجَنَّةِ بِطِيبٍ مِنْ طِيبِ الْجَنَّةِ فَلَمَّا صَارَتْ فِي الْأَرْضِ قَالَتْ مَا أَرْجُو مِنَ الْمَشْطِ وَ أَنَا مَسْخُوطٌ عَلَيَّ فَحَلَّتْ عَقِيصَتَهَا فَانْتَثَرَ مِنْ مُشْطَتِهَا الَّتِي كَانَتِ امْتَشَطَتْ بِهَا فِي الْجَنَّةِ فَطَارَتْ بِهِ الرِّيحُ فَأَلْقَتْ أَكْثَرَهُ بِالْهِنْدِ فَلِذَلِكَ صَارَ الْعِطْرُ بِالْهِنْدِ .",
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ حَسَّانَ مِثْلَهُ .",
          "قَالَ وَ فِي حَدِيثٍ آخَرَ فَحَلَّتْ عَقِيصَتَهَا فَأَرْسَلَ اللَّهُ عَلَى مَا كَانَ فِيهَا مِنْ ذَلِكَ الطِّيبِ رِيحاً فَهَبَّتْ فِي الْمَشْرِقِ وَ الْمَغْرِبِ فَأَصْلُ الطِّيبِ مِنْ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Hassan, from Musa Bin Bakr, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Adam<sup>as</sup> descended from the Paradise upon <span class=\"iTxt\">Al-Safa</span> and Hawwa<sup>as</sup> upon the <span class=\"iTxt\">Marwa</span>, and she<sup>as</sup> used to comb in the Paradise with a perfume from the perfumes of the Paradise. So when she<sup>as</sup> came to be in the earth, she<sup>as</sup> said: ‘How hopeful I<sup>as</sup> am from the combing and I<sup>as</sup> am loathsome of my<sup>as</sup> hair’. So she<sup>as</sup> loosened her<sup>as</sup> braids, so there scattered from her combing which she<sup>as</sup> used to comb with in the Paradise, and the wind carried it and cast most of it in India. Thus, it is due to that, came to be the perfume in India’. ",
            "<span style=\"font-size: small\">A number of our companions, from Ahmad Bin Abu Adullah, from Ali Bin Hassan</span> – similar to it.",
            "He (the narrator) said, ‘And in another Hadeeth - : ",
            "‘She<sup>as</sup> loosened her braids, so Allah<sup>azwj</sup> Sent upon what was therein, from that perfume, a wind, so it descended in the eat and the west. Thus, the origination of the perfume is from that’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Hassan from Musa ibn Bakr who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When Adam, ‘Alayhi al-Salam, came down from the garden (paradises) at al-Safa’ and Eve on al-Marwah, she wore a hairstyle from the garden (paradise) with the perfume of the garden (paradise). When she turned on earth she said, ‘I have no hope in this hairstyling while I am being angered at.’ She opened her braid. The perfume from her hairstyling that she had done in the garden (paradises) spread and the wind blew it away. The majority of it fell in India, thus perfume is in India.”’ A number of our people have narrated from Ahmad ibn abu ‘ Abd Allah from Ali ibn Hassan a similar Hadith. In another Hadith it is said that ‘. . . ‘her braid’ . . . ‘ Allah sent on what was there (in her braid) of perfumes a wind which blew to the east and west, thus the origin of perfume is thereof. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/420)"
        ],
        "index": 12734,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:51:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ يَحْيَى عَنْ عَلِيٍّ الْقَصِيرِ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ أَصْلِ الطِّيبِ مِنْ أَيِّ شَيْ‏ءٍ هُوَ فَقَالَ أَيُّ شَيْ‏ءٍ يَقُولُهُ النَّاسُ قُلْتُ يَزْعُمُونَ أَنَّ آدَمَ هَبَطَ مِنَ الْجَنَّةِ وَ عَلَى رَأْسِهِ إِكْلِيلٌ فَقَالَ قَدْ كَانَ وَ اللَّهِ أَشْغَلَ مِنْ أَنْ يَكُونَ عَلَى رَأْسِهِ إِكْلِيلٌ ",
          "ثُمَّ قَالَ إِنَّ حَوَّاءَ امْتَشَطَتْ فِي الْجَنَّةِ بِطِيبٍ مِنْ طِيبِ الْجَنَّةِ قَبْلَ أَنْ تُوَاقِعَهَا الْخَطِيئَةُ فَلَمَّا هَبَطَتْ إِلَى الْأَرْضِ حَلَّتْ عَقِيصَتَهَا فَأَرْسَلَ اللَّهُ تَعَالَى عَلَى مَا كَانَ فِيهَا رِيحاً فَهَبَّتْ بِهِ فِي الْمَشْرِقِ وَ الْمَغْرِبِ فَأَصْلُ الطِّيبِ مِنْ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ja’far Bin Yahya, from Ali Al Qaseyr, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked Him<sup>asws</sup> about the origination of the perfume, from which thing is it?’ So he<sup>asws</sup> said: ‘Which thing are the people saying?’ I said, ‘They are alleging that Adam<sup>as</sup> descended from the Paradise and upon his<sup>as</sup> head was a crown’. So he<sup>asws</sup> said: ‘He<sup>as</sup> was too pre-occupied that there would happen to be a crown upon his<sup>as</sup> head’. ",
            "Then he<sup>asws</sup> said: ‘Hawwa<sup>as</sup> used to comb in the Paradise with a perfume from the perfumes of the Paradise before the occurrence of her<sup>as</sup> error. So when she<sup>as</sup> descended to the earth, she<sup>as</sup> loosened her<sup>as</sup> hair, so Allah<sup>azwj</sup> the High Sent upon what was therein, a wind, so it descended with it in the east and the west. Thus, the origination of the perfume is from that’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from Ja‘far ibn Yahya from Ali al-Qasir from a man who has said the following: “I once asked abu ‘Abd Allah, Alayhi al-Salam, about the origin of perfumes and from where it has come. He (the Imam) asked, ‘What do people say about it?’ I replied, ‘They think that when Adam, Alayhi al-Salam, came down from the garden (paradises) he had a crown on his head.’ He (the Imam) said, ‘By Allah his preoccupation and trouble was beyond his condition to have a crown.’ He (the Imam) then said, ‘Eve wore a hairstyle in the garden (paradises) with perfumes before falling in the mistake and when she came down on earth she opened her braid and Allah, most High, sent a wind on what was in her braid. It blew the perfume to the east and west, thus, the origin of perfume is thereof.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/420)"
        ],
        "index": 12735,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:51:3",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ تَعَالَى لَمَّا أَهْبَطَ آدَمَ طَفِقَ يَخْصِفُ مِنْ وَرَقِ الْجَنَّةِ فَطَارَ عَنْهُ لِبَاسُهُ الَّذِي كَانَ عَلَيْهِ مِنْ حُلَلِ الْجَنَّةِ فَالْتَقَطَ وَرَقَةً فَسَتَرَ بِهَا عَوْرَتَهُ ",
          "فَلَمَّا هَبَطَ عَبِقَتْ رَائِحَةُ تِلْكَ الْوَرَقَةِ بِالْهِنْدِ بِالنَّبْتِ فَصَارَ الطِّيبُ فِي الْأَرْضِ مِنْ سَبَبِ تِلْكَ الْوَرَقَةِ الَّتِي عَبِقَتْ بِهَا رَائِحَةُ الْجَنَّةِ فَمِنْ هُنَاكَ الطِّيبُ بِالْهِنْدِ لِأَنَّ الْوَرَقَةَ هَبَّتْ عَلَيْهَا رِيحُ الْجَنُوبِ فَأَدَّتْ رَائِحَتَهَا إِلَى الْمَغْرِبِ لِأَنَّهَا احْتَمَلَتْ رَائِحَةَ الْوَرَقَةِ فِي الْجَوِّ فَلَمَّا رَكَدَتِ الرِّيحُ بِالْهِنْدِ عَبِقَ بِأَشْجَارِهِمْ وَ نَبْتِهِمْ فَكَانَ أَوَّلُ بَهِيمَةٍ رَتَعَتْ مِنْ تِلْكَ الْوَرَقَةِ ظَبْيَ الْمِسْكِ فَمِنْ هُنَاكَ صَارَ الْمِسْكُ فِي سُرَّةِ الظَّبْيِ لِأَنَّهُ جَرَى رَائِحَةُ النَّبْتِ فِي جَسَدِهِ وَ فِي دَمِهِ حَتَّى اجْتَمَعَتْ فِي سُرَّةِ الظَّبْيِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Salih Bin Abu Hammad, from Al Husayn Bin Yazeed, from Al Hassan Bin Ali Bin Abu Hamza, ",
            "(It has been narrated) from Ibrahim, from Abu Abdullah<sup>asws</sup> having said: ‘When Allah<sup>azwj</sup> the Exalted Caused Adam<sup>as</sup> to descend from the Paradise, he<sup>as</sup> started covering himself<sup>as</sup> from a leaf of the Paradise, and his<sup>as</sup> clothes flew away from him<sup>as</sup>, which used to be upon him<sup>as</sup> from the garments of the Paradise. So he<sup>as</sup> cut off a leaf and veiled his<sup>as</sup> nakedness with it.  ",
            "So when he<sup>as</sup> descended, the aroma of that leaf remained at India with the vegetation. So the perfume came to be in the earth from the cause of that leaf upon which remained the aroma of the Paradise. Thus, from here on the perfume is at India, because upon the leaf fell the south wind, so its aroma led to the west because it carried the aroma of the leaf in the atmosphere. So when the wind stagnated at India, it remained in its trees, and its vegetation. So the first animal which grazed the musk from that leaf was a deer. Thus, from over there the musk came to be in the navel of the deer flowing the aroma of the vegetation in its body, and in its blood, gathering in the navel of the deer’."
          ],
          "en.sarwar": [
            "3. Ali ibn Muhammad from Salih ibn abu Hammad from al-Husayn ibn Yazid from al-Hassan ibn Ali ibn abu Hamzah from Ibrahim who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said that when Allah sent Adam, Alayhi al-Salam, down, he began to hold the leaves of the garden (paradises) to himself, and his clothes which were of the dresses of the garden (paradises) that he wore flew away from him. He picked up a leaf to cover his private parts. When he came down the perfume of that leaf trapped in India; the wind from the south blew and its perfume reached to the west. It carried the perfume of the leaf in the air. When the wind became stagnant in India, it adhered to its trees and their plants. The first animal that grazed on such a plant was a deer of musk and from that is musk in the bellybutton of the deer; the fragrance of the plant moved in her body and blood until it gathered in the bellybutton of the deer.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:8:51",
  "kind": "verse_list"
}