{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 53"
        },
        "path": "/books/al-kafi:6:8:53",
        "titles": {
          "ar": "باب الْغَالِيَةِ",
          "en": "Chapter 53 – Al-Ghaliya (A type of perfume)"
        }
      }
    ],
    "index": 1958,
    "local_index": 53,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 54"
        },
        "path": "/books/al-kafi:6:8:54",
        "titles": {
          "ar": "باب الْخَلُوقِ",
          "en": "Chapter 54 – Al-Khalouq (A type of perfume)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 52"
        },
        "path": "/books/al-kafi:6:8:52",
        "titles": {
          "ar": "باب الْمِسْكِ",
          "en": "Chapter 52 – The Musk"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 8"
        },
        "path": "/books/al-kafi:6:8",
        "titles": {
          "ar": "كتاب الزِّيِّ وَ التَّجَمُّلِ وَ الْمُرُوءَةِ",
          "en": "<a id=\"_Toc452729965\"></a>The Book of Outfits and the Beautification and the Magnanimity "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:8:53",
    "titles": {
      "ar": "باب الْغَالِيَةِ",
      "en": "Chapter 53 – Al-Ghaliya (A type of perfume)"
    },
    "verse_count": 5,
    "verse_start_index": 12743,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/422)"
        ],
        "index": 12744,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:53:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي أُعَامِلُ التُّجَّارَ فَأَتَهَيَّأُ لِلنَّاسِ كَرَاهَةَ أَنْ يَرَوْا بِي خَصَاصَةً فَأَتَّخِذُ الْغَالِيَةَ فَقَالَ يَا إِسْحَاقُ إِنَّ الْقَلِيلَ مِنَ الْغَالِيَةِ يُجْزِئُ وَ كَثِيرَهَا سَوَاءً مَنِ اتَّخَذَ مِنَ الْغَالِيَةِ قَلِيلًا دَائِماً أَجْزَأَهُ ذَلِكَ قَالَ إِسْحَاقُ وَ أَنَا أَشْتَرِي مِنْهَا فِي السَّنَةِ بِعَشَرَةِ دَرَاهِمَ فَأَكْتَفِي بِهَا وَ رِيحُهَا ثَابِتٌ طُولَ الدَّهْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from Is’haq Bin Ammar, said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I work with the business people, so I make myself pleasant for the people not liking that they should see me as a destitute, so I take <span class=\"iTxt\">Al-Ghaliya</span>’. So he<sup>asws</sup> said: ‘O Is’haq! A little from <span class=\"iTxt\">Al-Ghaliya</span> suffices and a lot of it is the same. The one who takes a little <span class=\"iTxt\">Ghaliya</span> all the time, that would suffice for him’. I’shaq said, ‘And I bought from it during the year with ten Dirhams, so I sufficed myself with it, and its aroma was affirmed for a long duration’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Ishaq ibn ‘Ammar who has said the following: “I once said to abu ‘ Abd Allah, ‘Alayhi al-Salam, that I work with the merchants and prepare myself for people because of my dislike for their seeing me as a destitute person; if I can use al-Ghaliyah. He (the Imam) said, ‘O Ishaq, a small amount of it is enough just like a large amount. If one uses a small amount of al-Ghaliyah all the time it is sufficient.’ Ishaq has said, ‘I would buy for a whole year of al- Ghaliyah worth ten dirham and it was enough because its fragrance was constant all the time.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/423)"
        ],
        "index": 12745,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:53:2",
        "refs": {
          "Mentions": [
            "/books/quran:2:255"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُعَمَّرِ بْنِ خَلَّادٍ قَالَ أَمَرَنِي أَبُو الْحَسَنِ الرِّضَا ( عليه السلام ) فَعَمِلْتُ لَهُ دُهْناً فِيهِ مِسْكٌ وَ عَنْبَرٌ فَأَمَرَنِي أَنْ أَكْتُبَ فِي قِرْطَاسٍ آيَةَ الْكُرْسِيِّ وَ أُمَّ الْكِتَابِ وَ الْمُعَوِّذَتَيْنِ وَ قَوَارِعَ مِنَ الْقُرْآنِ وَ أَجْعَلَهُ بَيْنَ الْغِلَافِ وَ الْقَارُورَةِ فَفَعَلْتُ ثُمَّ أَتَيْتُهُ بِهِ فَتَغَلَّفَ بِهِ وَ أَنَا أَنْظُرُ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Moamar Bin Khallad who said, ",
            "‘Abu Al-Hassan Al-Reza<sup>asws</sup> ordered me, so I made a flask for him<sup>asws</sup> in which was musk, and Amber. So he<sup>asws</sup> ordered me that I should write down in a paper the Verse of the Chair <a href=\"/#/books/quran:2#h255\">[2:255]</a>, and the Mother of the Book (<span class=\"iTxt\">Surah Al-Fatiha</span>), and Al-<span class=\"iTxt\">Mawazatain</span> (Chapters 113 & 114), and certain Verses from the Quran, and make these to be in between the covering and the flask. So I did it, then I came over to him<sup>asws</sup> with it, and he<sup>asws</sup> placed it in a covering, and I was looking at him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Mu’ammar ibn Khallad who has said the following: “Abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, once commanded me to prepare for him oil mixed with musk and ambergris and write on paper verse 2:255, ’Umm al-Kitab, al-Ma‘udhatayn and al-Qawari’ (verse that crush Satan) from al-Quran; then place it in a cover in a bottle. I did as I was told to do. I then brought it to him (the Imam). He (the Imam) placed it in a cover and I was looking at him (the Imam).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/423)"
        ],
        "index": 12746,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:53:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مَوْلًى لِبَنِي هَاشِمٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ مُحَمَّدٍ قَالَ خَرَجَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) لَيْلَةً وَ عَلَيْهِ جُبَّةُ خَزٍّ وَ كِسَاءُ خَزٍّ قَدْ غَلَفَ لِحْيَتَهُ بِالْغَالِيَةِ فَقَالُوا فِي هَذِهِ السَّاعَةِ فِي هَذِهِ الْهَيْئَةِ فَقَالَ إِنِّي أُرِيدُ أَنْ أَخْطُبَ الْحُورَ الْعِينَ إِلَى اللَّهِ عَزَّ وَ جَلَّ فِي هَذِهِ اللَّيْلَةِ .",
          "سَهْلُ بْنُ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مَوْلًى لِبَنِي هَاشِمٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">A number of our companions, from Ahmad Bin Abu Abdullah, from Muhammad Bin Ali, from a slave of the Clan of hashim</span><sup>as</sup><span style=\"font-size: small\">, from Muhammad Bin Ja’far Bin Muhammad who said, </span>",
            "‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> came out one night and upon him<sup>asws</sup> was a robe of <span class=\"iTxt\">khazz</span> and a cloak of <span class=\"iTxt\">khazz</span>, and he<sup>asws</sup> had covered his<sup>asws</sup> beard with <span class=\"iTxt\">Al-Ghaliya</span>. So they (people) said, ‘At this time and in this beard?’ So he<sup>asws</sup> said: ‘I wanted to address the Maiden Hourie to Allah<sup>azwj</sup> Mighty and Majestic during this night’. ",
            "<span style=\"font-size: small\">Sahl Bin Ziyad, from Ali Bin Asbaat, from a slave of the Clan of Hashim</span><sup>as</sup><span style=\"font-size: small\">, from Muhammad Bin Ja’far</span> – similar to it."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Muhammad ibn Ali from Mawla’ of Banu Hashim from Muhammad ibn Ja‘far ibn Muhammad who has said the following: “One night Ali ibn al-Husayn, ‘Alayhim al-Salam, came out wearing a robe and gown of fur of al- Khazz (garments made of skin or fur of an animal that lives in water), and his beard covered with al- Ghaliyah. They said, ‘At this time and in this make-up!’ He said, ‘I like to propose to al-Hur al-Tn before Allah, most Majestic, most Glorious, in this night.’” Sahl ibn Ziyad has narrated from Ali ibn Asbat from Mawla of banu Hashim from Muhammad ibn Ja‘far a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/423)"
        ],
        "index": 12747,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:53:4",
        "text": [
          "عَنْهُ عَنْ أَبِي الْقَاسِمِ الْكُوفِيِّ عَمَّنْ حَدَّثَهُ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ الْكِرْمَانِيِّ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) مَا تَقُولُ فِي الْمِسْكِ فَقَالَ إِنَّ أَبِي أَمَرَ فَعُمِلَ لَهُ مِسْكٌ فِي بَانٍ بِسَبْعِمِائَةِ دِرْهَمٍ فَكَتَبَ إِلَيْهِ الْفَضْلُ بْنُ سَهْلٍ يُخْبِرُهُ أَنَّ النَّاسَ يَعِيبُونَ ذَلِكَ فَكَتَبَ إِلَيْهِ يَا فَضْلُ أَ مَا عَلِمْتَ أَنَّ يُوسُفَ ( عليه السلام ) وَ هُوَ نَبِيٌّ كَانَ يَلْبَسُ الدِّيبَاجَ مُزَرَّراً بِالذَّهَبِ وَ يَجْلِسُ عَلَى كَرَاسِيِّ الذَّهَبِ وَ لَمْ يَنْقُصْ ذَلِكَ مِنْ حِكْمَتِهِ شَيْئاً قَالَ ثُمَّ أَمَرَ فَعُمِلَتْ لَهُ غَالِيَةٌ بِأَرْبَعَةِ آلَافِ دِرْهَمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Abu Al Qasim Al Kufy, from the one who narrated it, from Muhammad Bin Al Waleed Al Kirmany who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, ‘What are you<sup>asws</sup> saying regarding the musk?’ So he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> ordered for musk to be made for him<sup>asws</sup> in a container, for seven hundred Dirhams. So Al-Fazl Bin Sahl wrote to him<sup>asws</sup>, informing him<sup>asws</sup> that the people are refusing that. So he<sup>asws</sup> wrote to him: ‘O Fazl! But do you not know that Yusuf<sup>as</sup>, and he<sup>as</sup> was a Prophet<sup>as</sup>, used to wear the brocade buttoned with the gold, and would sit upon a chair of gold, and that did not reduce anything from his<sup>as</sup> wisdom?’ He (the narrator) said, ‘So I made <span class=\"iTxt\">Ghaliya</span> for him<sup>as</sup> for four thousand Dirhams’."
          ],
          "en.sarwar": [
            "4. It is narrated from the narrator of the previous Hadith from abu al-Qasim al-Kufiy from those who narrated to him from Muhammad ibn al-Walid al-Kirmaniy who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about musk. He (the Imam) said, ‘My father once commanded to prepare for him musk in frankincense for seven hundred dirham. Fadl ibn Sahl then informed him (the Imam) that people scorn it. He (the Imam) wrote to him saying, ‘O Fadl, did you not know that Yusuf ‘Alayhi al-Salam, a Prophet wore brocades with buttons of gold and sat on the chair made of gold and it did not reduce of his wisdom anything?’ He (the Imam) said that he commanded to prepare for him al-Ghaliyah for four thousand dirham.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/424)"
        ],
        "index": 12748,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:8:53:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) اسْتَقْبَلَهُ مَوْلًى لَهُ فِي لَيْلَةٍ بَارِدَةٍ وَ عَلَيْهِ جُبَّةُ خَزٍّ وَ مِطْرَفُ خَزٍّ وَ عِمَامَةُ خَزٍّ وَ هُوَ مُتَغَلِّفٌ بِالْغَالِيَةِ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ فِي مِثْلِ هَذِهِ السَّاعَةِ عَلَى هَذِهِ الْهَيْئَةِ إِلَى أَيْنَ قَالَ فَقَالَ إِلَى مَسْجِدِ جَدِّي رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَخْطُبُ الْحُورَ الْعِينَ إِلَى اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Husayn Bin Yazeed, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> met a slave of his<sup>asws</sup> on a cold night and upon him<sup>asws</sup> was a rod of <span class=\"iTxt\">khazz</span>, a gown of <span class=\"iTxt\">khazz</span>, and a turban of <span class=\"iTxt\">khazz</span>, and he<sup>asws</sup> had applied <span class=\"iTxt\">Al-Ghaliya</span>. So he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! In a time like this, upon this beard, where to (are you<sup>asws</sup> going)?’ So he<sup>asws</sup> said: ‘To the Masjid of my<sup>asws</sup> grandfather<sup>saww</sup> Rasool-Allah<sup>saww</sup>, to address the Maiden Hourie to Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from al-Husayn ibn Yazid from certain persons of his people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ‘Ali ibn al-Husayn, ‘Alayhim al-Salam, came face to face with one of his Mawla’ in a cold night wearing a gown, a robe and a turban of al-Khazz (garments made of skin or fur of an animal that lives in water), covered with al-Ghaliyah. He said, ‘I pray to Allah to keep my soul in service for your cause, where are you going in such a night and in such a dress?’ He (the Imam) replied, ‘I am going to the Masjid of my grandfather, the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, to propose marriage with al-Hur al-‘In before Allah, most Majestic, most Glorious.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:8:53",
  "kind": "verse_list"
}