{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:1:3:10",
        "titles": {
          "ar": "بَابُ النَّهْيِ عَنِ الصِّفَةِ بِغَيْرِ مَا وَصَفَ بِهِ نَفْسَهُ تَعَالَى",
          "en": "Chapter 10 – The Forbiddance from describing with other than what He<sup>azwj</sup> has Described Himself<sup>azwj</sup> with"
        }
      }
    ],
    "index": 33,
    "local_index": 10,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:1:3:11",
        "titles": {
          "ar": "بَابُ النَّهْيِ عَنِ الْجِسْمِ وَ الصُّورَةِ",
          "en": "Chapter 11 – The Forbiddance from (describing Allah<sup>azwj</sup>) with the body and the image"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:1:3:9",
        "titles": {
          "ar": "باب فِي إِبْطَالِ الرُّؤْيَةِ",
          "en": "Chapter 9 – Regarding the invalidation of sighting"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:10",
    "titles": {
      "ar": "بَابُ النَّهْيِ عَنِ الصِّفَةِ بِغَيْرِ مَا وَصَفَ بِهِ نَفْسَهُ تَعَالَى",
      "en": "Chapter 10 – The Forbiddance from describing with other than what He<sup>azwj</sup> has Described Himself<sup>azwj</sup> with"
    },
    "verse_count": 12,
    "verse_start_index": 268,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (335/ 1)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/14)"
        ],
        "index": 269,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/381",
              "text": "الْعَبَّاسِ بْنِ مَعْرُوفٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/78",
              "text": "ابْنِ أَبِي نَجْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/401",
              "text": "عَبْدِ الرَّحِيمِ بْنِ عَتِيكٍ الْقَصِيرِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحِيمِ بْنِ عَتِيكٍ الْقَصِيرِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:1",
        "text": [
          " كَتَبْتُ عَلَى يَدَيْ عَبْدِ الْمَلِكِ بْنِ أَعْيَنَ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ قَوْماً بِالْعِرَاقِ يَصِفُونَ اللَّهَ بِالصُّورَةِ وَ بِالتَّخْطِيطِ فَإِنْ رَأَيْتَ جَعَلَنِيَ اللَّهُ فِدَاكَ أَنْ تَكْتُبَ إِلَيَّ بِالْمَذْهَبِ الصَّحِيحِ مِنَ التَّوْحِيدِ ",
          "فَكَتَبَ إِلَيَّ سَأَلْتَ رَحِمَكَ اللَّهُ عَنِ التَّوْحِيدِ وَ مَا ذَهَبَ إِلَيْهِ مَنْ قِبَلَكَ فَتَعَالَى اللَّهُ الَّذِي لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَ هُوَ السَّمِيعُ الْبَصِيرُ تَعَالَى عَمَّا يَصِفُهُ الْوَاصِفُونَ الْمُشَبِّهُونَ اللَّهَ بِخَلْقِهِ الْمُفْتَرُونَ عَلَى اللَّهِ ",
          "فَاعْلَمْ رَحِمَكَ اللَّهُ أَنَّ الْمَذْهَبَ الصَّحِيحَ فِي التَّوْحِيدِ مَا نَزَلَ بِهِ الْقُرْآنُ مِنْ صِفَاتِ اللَّهِ جَلَّ وَ عَزَّ فَانْفِ عَنِ اللَّهِ تَعَالَى الْبُطْلَانَ وَ التَّشْبِيهَ فَلَا نَفْيَ وَ لَا تَشْبِيهَ هُوَ اللَّهُ الثَّابِتُ الْمَوْجُودُ تَعَالَى اللَّهُ عَمَّا يَصِفُهُ الْوَاصِفُونَ وَ لَا تَعْدُوا الْقُرْآنَ فَتَضِلُّوا بَعْدَ الْبَيَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Al Abbas Bin Marouf, from Ibn Abu Najran, from Hammad Bin Usman, from Abdul Raheem Bin Ateyk Al Qaseyr who said, ",
            "‘I wrote (a letter) upon the hands of Abdul Malik Bin Ayn to Abu Abdullah<sup>asws</sup>, that a group of people in Al-Iraq are describing Allah<sup>azwj</sup> with the image and with the lines. So, what is your<sup>asws</sup> view, may Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>, write it to me with the correct doctrine of the <span class=\"iTxt\">Tawheed</span> (Oneness)’. ",
            "So he<sup>asws</sup> wrote to me: ‘You asked, may Allah<sup>azwj</sup> have Mercy on you, about the <span class=\"iTxt\">Tawheed</span> (Oneness) and it being indoctrinate in front of you about Him<sup>azwj</sup>. Exalted is Allah<sup>azwj</sup> Who, there is nothing like Him<sup>azwj</sup>, and He<sup>azwj</sup> is the Hearing, the Seeing, Exalted from what describers are describing, resembling Allah<sup>azwj</sup> with His<sup>azwj</sup> creatures, the forgers (of lies) upon Allah<sup>azwj</sup>. ",
            "So know, may Allah<sup>azwj</sup> have Mercy on you, that the correct doctrine regarding the <span class=\"iTxt\">Tawheed</span> (Oneness) what the Quran Revealed with from the Attributes of Allah<sup>azwj</sup> Majestic and Mighty. So turn away from the invalidations and the resemblances about Allah<sup>azwj</sup> the Exalted and neither negate nor give resemblance. He<sup>azwj</sup> is Allah<sup>azwj</sup>, the Proved, the Existing. Exalted is Allah<sup>azwj</sup> from what the describers are describing, and do not neglect the Quran, for you would be going astray after the clarification’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Ibrahim has narrated from al-‘Abbass ibn Ma‘ruf from ibn abu Najran from Hammad ibn ‘Uthman from Abd al-Rahim ibn ‘Utayk al-Qusayr who has said the following. “I wrote through ‘Abdal Malik ibn ’a‘yan to Imam abu ‘Abdallah (a.s.). “In Iraq there are people who attribute to Allah forms and lines. If you consider it proper, may Allah take my soul in your service, please write for me the correct belief in the issue of the Oneness of Allah.” The Imam wrote for me, “May Allah grant you blessings. You have asked about the Oneness of Allah and the belief of the group before you. Exalted is Allah, to Who nothing is similar. He is All-hearing and All-seeing. Allah is above what certain people attribute to Him and analogize Him with His creatures and the lies of those who speak lies about Him. Note that the true doctrine in the Oneness of Allah is what is revealed in the Quran in about the attributes of Allah, the Almighty, the Exalted. Keep away from the belief in Allah, the Most High, all ideas that amount to ignoring His existence altogether and those that amount to analogizing Him with the creatures. Neither should His existence be negated nor should He be considered similar to anything. He, Allah, the Most High exists. Exalted is He and far above what is falsely attributed to Him. Do not exceed the limits of the Quran lest you go astray after the clear presentation of Truth.”"
          ]
        }
      },
      {
        "index": 270,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/56",
              "text": "إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/112",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:2",
        "relations": {
          "Mentions": [
            "/books/quran:6:103"
          ]
        },
        "text": [
          " قَالَ لِي عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَا أَبَا حَمْزَةَ إِنَّ اللَّهَ لَا يُوصَفُ بِمَحْدُودِيَّةٍ عَظُمَ رَبُّنَا عَنِ الصِّفَةِ فَكَيْفَ يُوصَفُ بِمَحْدُودِيَّةٍ مَنْ لَا يُحَدُّ وَ لَا تُدْرِكُهُ الْأَبْصَارُ وَ هُوَ يُدْرِكُ الْأَبْصَارَ وَ هُوَ اللَّطِيفُ الْخَبِيرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazan, from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Abu Hamza who said, ",
            "‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to me: ‘O Abu Hamza! Allah<sup>azwj</sup> cannot be described by the limitations. Our Lord<sup>azwj</sup> is greater than the attributes, so how can one described by limitations the One<sup>azwj</sup> Who cannot be limited, and the <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h103\">[6:103]</a> Visions cannot comprehend Him, and He Comprehends (all) visions</span>, and He<sup>azwj</sup> is Aware of the subtleties, the All-Knowing?’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from ibn abu ‘Umayr from Ibrahim ibn ‘Abd al-Hamid from abu Hamzah who has said that Imam Ali ibn al-Husayn said to me, “O abu Hamzah, Allah cannot be defined by the created things. Our Lord is far above being described through the attributes. How can the infinite be defined by the finite? ‘ No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.’” <a href=\"/#/books/quran:6#h103\">[6:103]</a>"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (337/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 271,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/358",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/359",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/360",
              "text": "الْحُسَيْنِ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/361",
              "text": "بَكْرِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/402",
              "text": "الْحَسَنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/403",
              "text": "إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْخَزَّازِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/105",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْحَسَنِ بْنِ سَعِيدٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْخَزَّازِ وَ مُحَمَّدِ بْنِ الْحُسَيْنِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:3",
        "text": [
          "ا دَخَلْنَا عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فَحَكَيْنَا لَهُ أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) رَأَى رَبَّهُ فِي صُورَةِ الشَّابِّ الْمُوَفَّقِ فِي سِنِّ أَبْنَاءِ ثَلَاثِينَ سَنَةً وَ قُلْنَا إِنَّ هِشَامَ بْنَ سَالِمٍ وَ صَاحِبَ الطَّاقِ وَ الْمِيثَمِيَّ يَقُولُونَ إِنَّهُ أَجْوَفُ إِلَى السُّرَّةِ وَ الْبَقِيَّةُ صَمَدٌ ",
          "فَخَرَّ سَاجِداً لِلَّهِ ثُمَّ قَالَ سُبْحَانَكَ مَا عَرَفُوكَ وَ لَا وَحَّدُوكَ فَمِنْ أَجْلِ ذَلِكَ وَصَفُوكَ سُبْحَانَكَ لَوْ عَرَفُوكَ لَوَصَفُوكَ بِمَا وَصَفْتَ بِهِ نَفْسَكَ سُبْحَانَكَ كَيْفَ طَاوَعَتْهُمْ أَنْفُسُهُمْ أَنْ يُشَبِّهُوكَ بِغَيْرِكَ اللَّهُمَّ لَا أَصِفُكَ إِلَّا بِمَا وَصَفْتَ بِهِ نَفْسَكَ وَ لَا أُشَبِّهُكَ بِخَلْقِكَ أَنْتَ أَهْلٌ لِكُلِّ خَيْرٍ فَلَا تَجْعَلْنِي مِنَ الْقَوْمِ الظَّالِمِينَ ",
          "ثُمَّ الْتَفَتَ إِلَيْنَا فَقَالَ مَا تَوَهَّمْتُمْ مِنْ شَيْ‏ءٍ فَتَوَهَّمُوا اللَّهَ غَيْرَهُ",
          "ثُمَّ قَالَ نَحْنُ آلُ مُحَمَّدٍ النَّمَطُ الْأَوْسَطُ الَّذِي لَا يُدْرِكُنَا الْغَالِي وَ لَا يَسْبِقُنَا التَّالِي يَا مُحَمَّدُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حِينَ نَظَرَ إِلَى عَظَمَةِ رَبِّهِ كَانَ فِي هَيْئَةِ الشَّابِّ الْمُوَفَّقِ وَ سِنِّ أَبْنَاءِ ثَلَاثِينَ سَنَةً يَا مُحَمَّدُ عَظُمَ رَبِّي عَزَّ وَ جَلَّ أَنْ يَكُونَ فِي صِفَةِ الْمَخْلُوقِينَ",
          "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ مَنْ كَانَتْ رِجْلَاهُ فِي خُضْرَةٍ قَالَ ذَاكَ مُحَمَّدٌ كَانَ إِذَا نَظَرَ إِلَى رَبِّهِ بِقَلْبِهِ جَعَلَهُ فِي نُورٍ مِثْلِ نُورِ الْحُجُبِ حَتَّى يَسْتَبِينَ لَهُ مَا فِي الْحُجُبِ إِنَّ نُورَ اللَّهِ مِنْهُ أَخْضَرُ وَ مِنْهُ أَحْمَرُ وَ مِنْهُ أَبْيَضُ وَ مِنْهُ غَيْرُ ذَلِكَ يَا مُحَمَّدُ مَا شَهِدَ لَهُ الْكِتَابُ وَ السُّنَّةُ فَنَحْنُ الْقَائِلُونَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Muhammad Bin Ismail, from Al Husayn Bin Al Hassan, from Bakr Bin Salih, from Al Hassan Bin Saeed, from Ibrahim Bin Muhammad Al Khazzaz and Muhammad Bin Al Husayn both said, ",
            "‘We went over to Abu Al-Hassan Al-Reza<sup>asws</sup> and we both told him<sup>asws</sup> that Muhammad<sup>saww</sup> saw his<sup>saww</sup> Lord<sup>azwj</sup> in an image of a young man of approximately thirty years of age, and we said that Hisham Bin Alim and Sahib Al Taq and Al Maysami are saying that He<sup>azwj</sup> is hollow to the navel and the rest is ‘<span class=\"iTxt\">Samad</span>’ (Not hollow)’. ",
            "So he<sup>asws</sup> fell prostrating to Allah<sup>azwj</sup>, then said: ‘Glory be to You<sup>azwj</sup>! They do not recognise You<sup>azwj</sup>, nor are they (acknowledging) Your<sup>azwj</sup> Oneness, therefore due to that, they are describing You<sup>azwj</sup> (as such). Glory be to You<sup>azwj</sup>! Had they recognised You<sup>azwj</sup>, they would have described You<sup>azwj</sup> with what You<sup>azwj</sup> have Described Yourself<sup>azwj</sup> with. Glory be to You<sup>azwj</sup>! How are they obliging themselves that they are resembling You<sup>azwj</sup> with others. O Allah<sup>azwj</sup>! I<sup>asws</sup> do not describe You<sup>azwj</sup> except with what You<sup>azwj</sup> Described Yourself<sup>azwj</sup> with, nor do I<sup>asws</sup> resemble You<sup>azwj</sup> with Your<sup>azwj</sup> creatures. You<sup>azwj</sup> are the Rightful of every goodness, therefore do not Make me<sup>asws</sup> to be from the unjust people’. ",
            "Then he<sup>asws</sup> turned around towards us, and he<sup>asws</sup> said: ‘<span style=\"text-decoration: underline\">Whatever you are imagining from a thing, so imagine Allah</span><sup style=\"text-decoration: underline\">azwj</sup><span style=\"text-decoration: underline\"> to be other than it</span>’. ",
            "Then He<sup>azwj</sup> Said: ‘We<sup>asws</sup>, the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> are of the median classification which neither can the exaggerator catch-up with us<sup>asws</sup> nor do the followers precede us<sup>asws</sup>. O Muhammad! (You are saying that) Rasool-Allah<sup>saww</sup>, when he<sup>saww</sup> looked at the Magnificence of his<sup>saww</sup> Lord<sup>azwj</sup>, He<sup>azwj</sup> was in a body of a youth of approximately thirty years of age. O Muhammad!  My<sup>asws</sup> Lord<sup>azwj</sup> Mighty and Majestic is Greater than He<sup>azwj</sup> would happen to be in a description of the creatures’. ",
            "He (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>! Who was it, whose leg was in green?’ He<sup>asws</sup> said: ‘Muhammad<sup>saww</sup>, when he<sup>saww</sup> looked at his<sup>saww</sup> Lord<sup>azwj</sup> with his<sup>saww</sup> heart, He<sup>saww</sup> was Made to be in Light similar to the Light of the Veils, to the extent that is was clear to him<sup>asws</sup> what was in the Veils. The Light of Allah<sup>azwj</sup>, from it is green, and from it is red, and from it is white, and from it is other than that. O Muhammad! Whatever the Book (Quran) testifies for Him<sup>azwj</sup>, so we<sup>asws</sup> are the speakers with it’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn abu ‘Abdallah has narrated from Muhammad ibn Isma‘il from al-Husayn ibn al-Hassan from Bakr ibn Salih from al-Hassan ibn Sa‘id from Ibrahim ibn Muhammad al-Khazzaz and Muhammad ibn al-Husayn they both have said the following. “We met Imam abu abu al-Hassan al-Rida (a.s.) and stated to him that Prophet Muhammad (s.a.) saw His Lord in the fashion of a full grown young man of thirty years and added that Hisham ibn Salim and Sahib al-Taq and al-Maythami say that He is hallow down to His navel and the rest is solid. The Imam bowed down to a prostrating position and then said, ‘(O Lord), Glory belongs to you they have not recognized You nor have they acknowledged Your Oneness thus, they attribute to You such things. (O Lord, Glory belongs to You, had they recognized You they would have attributed to You what you yourself have attributed to Yourself and they would not have considered You similar to things other than You. O Lord, I do not attribute to You anything other than what You have attributed to Yourself and do not consider You similar to Your creatures. To You belongs all good. Do not place me among the unjust ones.’ The Imam (a.s.) then turned to us saying, “Whatever you may imagine (make Wahm of) consider Allah some thing other than it.” He continued, ‘We, people of the family of the Prophet (s.a.), are the middle type and the criteria. Those who exceed can not catch up with us and those who follow can not go ahead of us. O Muhammad, when the messenger of Allah looked at the greatness of his Lord he was of the type of people as fully grown up as thirty years old people. O Muhammad, my Lord, the Majestic, the Glorious, is far greater than to be of the qualities of the creatures.” The narrator has said that I said, “May the Lord take my soul for your service, who was the one with his feet in the green?” The Imam said, “He was Prophet Muhammad (s.a.) when looked at his Lord with his heart He placed him in the light like that of the Hujub so he can see what is inside the Hujub. Of the light of Allah some are green, red, white and others. O Muhammad whatever has confirmation in the book and the Sunnah we affirm it.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/350)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 272,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/77",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/404",
              "text": "أَحْمَدَ بْنِ بَشِيرٍ الْبَرْقِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/405",
              "text": "عَبَّاسُ بْنُ عَامِرٍ الْقَصَبَانِيُّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ بَشِيرٍ الْبَرْقِيِّ قَالَ حَدَّثَنِي عَبَّاسُ بْنُ عَامِرٍ الْقَصَبَانِيُّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:4",
        "text": [
          " أَخْبَرَنِي هَارُونُ بْنُ الْجَهْمِ عَنْ أَبِي حَمْزَةَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ قَالَ لَوِ اجْتَمَعَ أَهْلُ السَّمَاءِ وَ الْأَرْضِ أَنْ يَصِفُوا اللَّهَ بِعَظَمَتِهِ لَمْ يَقْدِرُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Ahmad Bin Bashir Al Barqy who said, ‘Abbas Bin Aamir Al Qasbany narrated to me saying, ‘Haroun Bin Al Jahm informed me, from Abu Hamza, ",
            "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘If the inhabitants of the sky and the earth were to gather together in describing Allah<sup>azwj</sup> by His<sup>azwj</sup> Magnificence, they would not be able to’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from Ahmad ibn Bashir al-Barqi who has said that ‘Abbass ibn ‘Amir al-Qasbani who has said that Harun ibn al-Juham from abu Hamza from Imam Ali ibn al-Husayn (a.s.) has reported the following. “Even if all those in heavens and earth would gather together to speak of the greatness of Allah they will not be able to do so.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/351)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 273,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/406",
              "text": "سَهْلٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/287",
              "text": "إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْهَمَذَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلٌ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْهَمَذَانِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:5",
        "text": [
          " كَتَبْتُ إِلَى الرَّجُلِ ( عليه السلام ) أَنَّ مَنْ قِبَلَنَا مِنْ مَوَالِيكَ قَدِ اخْتَلَفُوا فِي التَّوْحِيدِ فَمِنْهُمْ مَنْ يَقُولُ جِسْمٌ وَ مِنْهُمْ مَنْ يَقُولُ صُورَةٌ فَكَتَبَ ( عليه السلام ) بِخَطِّهِ سُبْحَانَ مَنْ لَا يُحَدُّ وَ لَا يُوصَفُ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَ هُوَ السَّمِيعُ الْعَلِيمُ أَوْ قَالَ الْبَصِيرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ibrahim Bin Muhammad Al Hamdany who said, ",
            "‘I wrote to the man<sup>asws</sup> that the ones before us from the ones in your<sup>asws</sup> Wilayah are differing regarding the <span class=\"iTxt\">Tawheed</span>. So, from them is one who is saying, ‘A body’, and from them is one who is saying, ‘An Image’’. So he<sup>asws</sup> wrote in his<sup>asws</sup> own handwriting: ‘Glorious is the One<sup>azwj</sup> Who cannot be limited, nor can He<sup>azwj</sup> be described. There is nothing like Him<sup>azwj</sup>, and He<sup>azwj</sup> is the Hearing, the All-Knowing’. Or he<sup>asws</sup> said: ‘All-Seeing’’."
          ],
          "en.sarwar": [
            " 5. Sahl has narrated from Ibrahim ibn Muhammad al-Hamdani who has said the following. “I wrote to the man (Imam abu al-Hassan the 3rd (a.s.) explaining, “Your followers in this city differ on the issue of the Oneness of Allah. Some of them say that Allah has a body, and others say that Allah has a form.” The Imam replied in his own handwriting, “Glory belongs to Allah, Who can not be defined nor described. There is nothing similar to Him. He is All-hearing, All-knowing, or the Imam said All-seeing.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (351/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 274,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/406",
              "text": "سَهْلٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/407",
              "text": "إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/298",
              "text": "مُحَمَّدِ بْنِ حَكِيمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلٌ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:6",
        "text": [
          " كَتَبَ أَبُو الْحَسَنِ مُوسَى بْنُ جَعْفَرٍ ( عليه السلام ) إِلَى أَبِي أَنَّ اللَّهَ أَعْلَى وَ أَجَلُّ وَ أَعْظَمُ مِنْ أَنْ يُبْلَغَ كُنْهُ صِفَتِهِ فَصِفُوهُ بِمَا وَصَفَ بِهِ نَفْسَهُ وَ كُفُّوا عَمَّا سِوَى ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl, from Muhammad Bin Isa, from Ibrahim, from Muhammad Bin Hakim who said, ",
            "‘Abu Al-Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> wrote to my father: ‘Allah<sup>azwj</sup> is more Exalted, and more Majestic, and more Magnificent than that His<sup>azwj</sup> Description be reached. Therefore, described Him<sup>azwj</sup> with what He<sup>azwj</sup> has Described Himself<sup>azwj</sup> with, and refrain from whatever is besides that’."
          ],
          "en.sarwar": [
            " 6. Sahl has narrated from Muhammad ibn ‘Isa from Ibrahim from Muhammad ibn Hakim who has said the following. “Imam abu al-Hassan Musa ibn Ja‘far (a.s.) wrote to my father, ‘Allah is far High, Glorious and Great than that one can reach the essence of His attribute. Speak of only those of His attributes of which He Himself has spoken and refrain from attributes other than those ones.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/351)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 275,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/406",
              "text": "سَهْلٌ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/408",
              "text": "السِّنْدِيِّ بْنِ الرَّبِيعِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/409",
              "text": "حَفْصٍ أَخِي مُرَازِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/410",
              "text": "الْمُفَضَّلِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلٌ عَنِ السِّنْدِيِّ بْنِ الرَّبِيعِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصٍ أَخِي مُرَازِمٍ عَنِ الْمُفَضَّلِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:7",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ شَيْ‏ءٍ مِنَ الصِّفَةِ فَقَالَ لَا تَجَاوَزْ مَا فِي الْقُرْآنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl, from Al Sindy Bin Al Rabi’e, from Ibn Abu Umeyr, from Hafs a brother of Marazim, from Al Mufazzal who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about something from the Attributes. So he<sup>asws</sup> said: ‘Do not exceed what is in the Quran’."
          ],
          "en.sarwar": [
            " 7. Sahl has narrated from al-Sindi ibn al-Rabi‘ from ibn abu ‘Umayr from Hafs, brother of Marazim from al-Mufaddal who has said the “I asked Imam abu al-Hassan (a.s.) about certain matters of the attributes (of Allah) and the Imam said, “Do not exceed what is in the holy Quran.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (351/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 276,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/406",
              "text": "سَهْلٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/411",
              "text": "مُحَمَّدِ بْنِ عَلِيٍّ الْقَاسَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلٌ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْقَاسَانِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:8",
        "text": [
          " كَتَبْتُ إِلَيْهِ ( عليه السلام ) أَنَّ مَنْ قِبَلَنَا قَدِ اخْتَلَفُوا فِي التَّوْحِيدِ قَالَ فَكَتَبَ ( عليه السلام ) سُبْحَانَ مَنْ لَا يُحَدُّ وَ لَا يُوصَفُ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَ هُوَ السَّمِيعُ الْبَصِيرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl, from Muhammad Bin Ali Al Qasany who said, ",
            "‘I wrote to him<sup>asws</sup> that the ones before us are differing regarding the <span class=\"iTxt\">Tawheed</span> (Oneness). So he<sup>asws</sup> wrote: ‘Glorious is the One<sup>azwj</sup> Who cannot be limited, nor can He<sup>azwj</sup> be described. There is nothing like Him<sup>azwj</sup>, and He<sup>azwj</sup> is the Hearing, the Seeing’."
          ],
          "en.sarwar": [
            " 8. Sahl has narrated from Muhammad ibn Ali al-Qasani (the right name is Ali ibn Muhammad, one of the companions of Imam abu al-Hassan al-Hadi, the tenth Imam (a.s.) who has said the following. “I wrote to the Imam explaining that people before us had differences on the issue of the Oneness of Allah.” The Imam wrote, “Glory belongs to Allah, Who can not be defined nor described. There is nothing similar to Him. He is All-hearing, All-seeing.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/352)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 277,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/406",
              "text": "سَهْلٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/412",
              "text": "بِشْرِ بْنِ بَشَّارٍ النَّيْسَابُورِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلٌ عَنْ بِشْرِ بْنِ بَشَّارٍ النَّيْسَابُورِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:9",
        "text": [
          " كَتَبْتُ إِلَى الرَّجُلِ ( عليه السلام ) أَنَّ مَنْ قِبَلَنَا قَدِ اخْتَلَفُوا فِي التَّوْحِيدِ فَمِنْهُمْ مَنْ يَقُولُ هُوَ جِسْمٌ وَ مِنْهُمْ مَنْ يَقُولُ هُوَ صُورَةٌ فَكَتَبَ إِلَيَّ سُبْحَانَ مَنْ لَا يُحَدُّ وَ لَا يُوصَفُ وَ لَا يُشْبِهُهُ شَيْ‏ءٌ وَ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَ هُوَ السَّمِيعُ الْبَصِيرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl, from Bishr Bin Bashhar Al Naeyshapouri who said, ",
            "‘I wrote to the man<sup>asws</sup> that the ones before us are differing regarding the <span class=\"iTxt\">Tawheed</span>. So, from them is one who is saying, ‘He<sup>azwj</sup> is a body’, and from them is one who is saying, ‘He<sup>azwj</sup> is an image’’. So he<sup>asws</sup> wrote to me: ‘Glorious is the One<sup>azwj</sup> Who can neither be limited, nor can He<sup>azwj</sup> be described, nor can He<sup>azwj</sup> be resembled with anything, and there is nothing Like Him<sup>azwj</sup>, and He<sup>azwj</sup> is the Hearing, the Seeing’."
          ],
          "en.sarwar": [
            " 9. Sahl has narrated from Bishr ibn Bashshar al-Nayshaburi who has said the following. “I wrote to the man (Imam) explaining that people before us had differences on the issue of the Oneness of Allah. There were people who said that Allah had a body, others said He had a form.” The Imam wrote for me, “Glory belongs to Allah, Who can not be defined nor described. There is nothing similar to Him. He is All-hearing, All-seeing.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/352)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 278,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/406",
              "text": "سَهْلٌ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلٌ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:10",
        "text": [
          " كَتَبْتُ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) سَنَةَ خَمْسٍ وَ خَمْسِينَ وَ مِائَتَيْنِ قَدِ اخْتَلَفَ يَا سَيِّدِي أَصْحَابُنَا فِي التَّوْحِيدِ مِنْهُمْ مَنْ يَقُولُ هُوَ جِسْمٌ وَ مِنْهُمْ مَنْ يَقُولُ هُوَ صُورَةٌ فَإِنْ رَأَيْتَ يَا سَيِّدِي أَنْ تُعَلِّمَنِي مِنْ ذَلِكَ مَا أَقِفُ عَلَيْهِ وَ لَا أَجُوزُهُ فَعَلْتَ مُتَطَوِّلًا عَلَى عَبْدِكَ ",
          "فَوَقَّعَ بِخَطِّهِ ( عليه السلام ) سَأَلْتَ عَنِ التَّوْحِيدِ وَ هَذَا عَنْكُمْ مَعْزُولٌ اللَّهُ وَاحِدٌ أَحَدٌ لَمْ يَلِدْ وَ لَمْ يُولَدْ وَ لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ خَالِقٌ وَ لَيْسَ بِمَخْلُوقٍ يَخْلُقُ تَبَارَكَ وَ تَعَالَى مَا يَشَاءُ مِنَ الْأَجْسَامِ وَ غَيْرِ ذَلِكَ وَ لَيْسَ بِجِسْمٍ وَ يُصَوِّرُ مَا يَشَاءُ وَ لَيْسَ بِصُورَةٍ جَلَّ ثَنَاؤُهُ وَ تَقَدَّسَتْ أَسْمَاؤُهُ أَنْ يَكُونَ لَهُ شِبْهٌ هُوَ لَا غَيْرُهُ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَ هُوَ السَّمِيعُ الْبَصِيرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl said, ",
            "‘I wrote to Abu Muhammad<sup>asws</sup> in the year two hundred and fifty five, ‘My Chief<sup>asws</sup>! Our companions have differed regarding the <span class=\"iTxt\">Tawheed</span> (Oneness). From them is one who is saying, ‘He<sup>azwj</sup> is a body’, and from them is one who is saying, ‘He<sup>azwj</sup> is an image’. So what is your<sup>asws</sup> view, O my Chief<sup>asws</sup>, if you<sup>asws</sup> could teach me from that, what I could pause upon and not exceed it. If you<sup>asws</sup> do it, it would be a prolonged favour upon your<sup>asws</sup> servant’. ",
            "So he<sup>asws</sup> signed in his<sup>asws</sup> own handwriting: ‘You asked about the <span class=\"iTxt\">Tawheed</span> (Oneness), and this is distant from you all. Allah<sup>azwj</sup> is One, First. He<sup>azwj</sup> neither begot nor is He<sup>azwj</sup> begotten and there does not happen to be a match for Him<sup>azwj</sup>. He<sup>azwj</sup> is the Creator and is not created. He<sup>azwj</sup>, Blessed and High, Creates whatever He<sup>azwj</sup> so Desires to from the bodies, and other than that, and He<sup>azwj</sup> is not with a body; and He<sup>azwj</sup> Makes images, whatever He<sup>azwj</sup> so Desires to and He<sup>azwj</sup> is not with an image. Majesic is His<sup>azwj</sup> Laudation, and Holy are His<sup>azwj</sup> Names. If there happens to be a resemblance of Him<sup>azwj</sup>, it would be for other than Him<sup>azwj</sup>. There is nothing like Him<sup>azwj</sup>, and He<sup>azwj</sup> is the Hearing, the Seeing’."
          ],
          "en.sarwar": [
            " 10. Sahl has said that I wrote to abu Muhammad al-Hassan al-‘Askari (a.s.) in 255 AH., “Our people (ashabuna) differ on the issue of the Oneness of Allah. There are those who say he has a body and others say He has a certain form. If you would consider to instruct me in this matter on which I would rely without excess it would be a great favor to your servant.” The Imam answered in his own handwriting, “You have asked about the Oneness of Allah. It is not your duty to find Allah’s self. Allah is One, the Only One. He has no children and is not anyone’s child. There nothing similar to Him. He is the Creator and is not created. He, the Most Holy, the Most High, creates whatever He wants of the bodies and non-bodies. He is not a body or a certain form. He gives form to whatever He wills but Himself is not a form, Majestic is His praise and Holy are His names and is far above being similar to other things. Only He, and not others, is the One to Who no one is similar and He is all-hearing and All-seeing.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/353)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/15)"
        ],
        "index": 279,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/134",
              "text": "رِبْعِيِّ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/413",
              "text": "الْفُضَيْلِ بْنِ يَسَارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:11",
        "relations": {
          "Mentions": [
            "/books/quran:6:91"
          ]
        },
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ لَا يُوصَفُ وَ كَيْفَ يُوصَفُ وَ قَدْ قَالَ فِي كِتَابِهِ وَ ما قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ فَلَا يُوصَفُ بِقَدَرٍ إِلَّا كَانَ أَعْظَمَ مِنْ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazan, from Hammad Bin Isa, from Rabi’e Bin Abdullah, from Al Fuzayl Bin Yasar who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying that Allah<sup>azwj</sup> cannot be described, and how can one describe and He<sup>azwj</sup> has Said in His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h91\">[6:91]</a> And they do not appreciate Allah with the appreciation that is due to Him</span>. Thus, He<sup>azwj</sup> would not be described with an appreciation except that He<sup>azwj</sup> would be greater than that’."
          ],
          "en.sarwar": [
            " 11. Muhammad ibn Isma’il has narrated from al-Fadl ibn Shadhan from Hammad ibn ‘Isa from Rabi‘i ibn ‘Abdallah from al-Fudayl ibn Yasar, who has said the following. “I heard Imam abu ‘Abdallah (a.s.) saying, ‘Allah cannot be defined. How can He be defined when He Himself has said in His book, “They have not respected Allah the way He truly should have been respected.” <a href=\"/#/books/quran:6#h91\">[6:91]</a> Therefore, He cannot be described in any way but that He is great and above that.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/353)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 280,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/414",
              "text": "عَنْ غَيْرِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/70",
              "text": "مُحَمَّدِ بْنِ سُلَيْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/71",
              "text": "عَلِيِّ بْنِ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَنْ غَيْرِهِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ عَلِيِّ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:10:12",
        "relations": {
          "Mentions": [
            "/books/quran:6:103"
          ]
        },
        "text": [
          " قَالَ إِنَّ اللَّهَ عَظِيمٌ رَفِيعٌ لَا يَقْدِرُ الْعِبَادُ عَلَى صِفَتِهِ وَ لَا يَبْلُغُونَ كُنْهَ عَظَمَتِهِ لَا تُدْرِكُهُ الْأَبْصَارُ وَ هُوَ يُدْرِكُ الْأَبْصَارَ وَ هُوَ اللَّطِيفُ الْخَبِيرُ وَ لَا يُوصَفُ بِكَيْفٍ وَ لَا أَيْنٍ وَ حَيْثٍ وَ كَيْفَ أَصِفُهُ بِالْكَيْفِ وَ هُوَ الَّذِي كَيَّفَ الْكَيْفَ حَتَّى صَارَ كَيْفاً فَعُرِفَتِ الْكَيْفُ بِمَا كَيَّفَ لَنَا مِنَ الْكَيْفِ ",
          "أَمْ كَيْفَ أَصِفُهُ بِأَيْنٍ وَ هُوَ الَّذِي أَيَّنَ الْأَيْنَ حَتَّى صَارَ أَيْناً فَعُرِفَتِ الْأَيْنُ بِمَا أَيَّنَ لَنَا مِنَ الْأَيْنِ ",
          "أَمْ كَيْفَ أَصِفُهُ بِحَيْثٍ وَ هُوَ الَّذِي حَيَّثَ الْحَيْثَ حَتَّى صَارَ حَيْثاً فَعُرِفَتِ الْحَيْثُ بِمَا حَيَّثَ لَنَا مِنَ الْحَيْثِ ",
          "فَاللَّهُ تَبَارَكَ وَ تَعَالَى دَاخِلٌ فِي كُلِّ مَكَانٍ وَ خَارِجٌ مِنْ كُلِّ شَيْ‏ءٍ لَا تُدْرِكُهُ الْأَبْصَارُ وَ هُوَ يُدْرِكُ الْأَبْصَارَ لَا إِلَهَ إِلَّا هُوَ الْعَلِيُّ الْعَظِيمُ وَ هُوَ اللَّطِيفُ الْخَبِيرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad and from someone else, from Muhammad Bin Suleyman, from Ali Bin Ibrahim, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> is Magnificent, Lofty. The servants have no ability upon describing Him<sup>azwj</sup>, nor would they reach His<sup>azwj</sup> Magnificence <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h103\">[6:103]</a> Visions cannot comprehend Him, and He Comprehends (all) visions</span>, and He<sup>azwj</sup> is Aware of the subtleties, the Aware; and He<sup>azwj</sup> can neither be described by the ‘how’, nor ‘where’; and ‘where’ and ‘how’ described Him<sup>azwj</sup> with the Qualitative State, and He<sup>azwj</sup> is the One<sup>azwj</sup> Who Originated the ‘how’ until ‘how’ came to be. So the ‘how’ was recognised by what it was Originated for us from the Qualitative State.  ",
            "Or, how can I<sup>azwj</sup> describe Him<sup>azwj</sup> with ‘where’, and He<sup>azwj</sup> is the One<sup>azwj</sup> Who Originated the ‘where’ until ‘where’ came to be. So the ‘where’ is recognised with what it was Originated for us from the ‘where’. ",
            "Of how can I<sup>asws</sup> describe Him<sup>asws</sup> with a position, and He<sup>azwj</sup> is the One<sup>azwj</sup> Who Originated the position, until ‘position’ came to be. So the ‘position’ is recognised with that it was Originated for us from the ‘position’. ",
            "So, Allah<sup>azwj</sup> Blessed and High is included in every place, and outside from everything. <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h103\">[6:103]</a> Visions cannot comprehend Him, and He Comprehends (all) visions</span>. There is no god except Allah<sup>azwj</sup>. He<sup>azwj</sup> is the Exalted, the Magnificent, and He<sup>azwj</sup> is Aware of the subtleties, the Aware’."
          ],
          "en.sarwar": [
            " 12. Ali ibn Muhammad has narrated from Sahl ibn Ziyad and others from Muhammad ibn Sulayman from Ali ibn Ibrahim from ‘Abdallah ibn Sinan from abu ‘Abdallah (a.s.) who has said the following. “Allah is Great and High. People cannot describe Him nor can they reach the depth of His Greatness. ‘ No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.’” <a href=\"/#/books/quran:6#h103\">[6:103]</a> He cannot be described by means of how and where. How can I describe Him by means of any condition? He Himself has created the conditions and how and so it came into being. We came to know conditions because of His designing them for us. How can I describe Him by means of space? It is He, Who spaced the space so it became space. I, thus, came to know space by means of what He has made it into space. How can I describe Him by means of positions when He Himself has given position to positions so it came into position. I, thus, came to know the position by means of what He has made to come into position. Allah, the Holy, the Most High, is in every place but is out of everything. ‘ No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.’” <a href=\"/#/books/quran:6#h103\">[6:103]</a>"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:10",
  "kind": "verse_list"
}