{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:1:3:11",
        "titles": {
          "ar": "بَابُ النَّهْيِ عَنِ الْجِسْمِ وَ الصُّورَةِ",
          "en": "Chapter 11 – The Forbiddance from (describing Allah<sup>azwj</sup>) with the body and the image"
        }
      }
    ],
    "index": 34,
    "local_index": 11,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:1:3:12",
        "titles": {
          "ar": "بَابُ صِفَاتِ الذَّاتِ",
          "en": "Chapter 12 – Attributes of the Self"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:1:3:10",
        "titles": {
          "ar": "بَابُ النَّهْيِ عَنِ الصِّفَةِ بِغَيْرِ مَا وَصَفَ بِهِ نَفْسَهُ تَعَالَى",
          "en": "Chapter 10 – The Forbiddance from describing with other than what He<sup>azwj</sup> has Described Himself<sup>azwj</sup> with"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:11",
    "titles": {
      "ar": "بَابُ النَّهْيِ عَنِ الْجِسْمِ وَ الصُّورَةِ",
      "en": "Chapter 11 – The Forbiddance from (describing Allah<sup>azwj</sup>) with the body and the image"
    },
    "verse_count": 8,
    "verse_start_index": 280,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 281,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/119",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:11:1",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) سَمِعْتُ هِشَامَ بْنَ الْحَكَمِ يَرْوِي عَنْكُمْ أَنَّ اللَّهَ جِسْمٌ صَمَدِيٌّ نُورِيٌّ مَعْرِفَتُهُ ضَرُورَةٌ يَمُنُّ بِهَا عَلَى مَنْ يَشَاءُ مِنْ خَلْقِهِ فَقَالَ ( عليه السلام ) سُبْحَانَ مَنْ لَا يَعْلَمُ أَحَدٌ كَيْفَ هُوَ إِلَّا هُوَ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَ هُوَ السَّمِيعُ الْبَصِيرُ لَا يُحَدُّ وَ لَا يُحَسُّ وَ لَا يُجَسُّ وَ لَا تُدْرِكُهُ الْأَبْصَارُ وَ لَا الْحَوَاسُّ وَ لَا يُحِيطُ بِهِ شَيْ‏ءٌ وَ لَا جِسْمٌ وَ لَا صُورَةٌ وَ لَا تَخْطِيطٌ وَ لَا تَحْدِيدٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ali Bin Abu Hamza who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I heard Hisham Bin Al-Hakam reporting from you<sup>asws</sup> that Allah<sup>azwj</sup> is (a physical) body, solid, (Made of) Light. His<sup>azwj</sup> recognition is a necessity. He<sup>azwj</sup> Endows with it upon the ones whom He<sup>azwj</sup> so Desires to from His<sup>azwj</sup> creatures’. So He<sup>asws</sup> said: ‘Glorious is the One<sup>azwj</sup> Whom no one knows how He<sup>azwj</sup> is except that nothing is like Him<sup>azwj</sup> and He<sup>azwj</sup> is the Hearing, the Seeing. He<sup>azwj</sup> can neither be limited, nor felt, nor touched, nor do the visions comprehend Him<sup>azwj</sup>, nor the senses, nor can He<sup>azwj</sup> be encompassed by anything, nor a body, nor an image, nor lines, nor boundaries’."
          ],
          "en.sarwar": [
            " 1. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Ali ibn abu Hamzah, who has said the following. “I stated before abu ‘Abdallah (a.s.) that I have heard Hisham ibn al-Hakam quoting you that Allah is a body of Self-subsisting nature and is from light. He can very clearly be recognized and He bestows such knowledge to whoever among His creatures He wills.” The Imam said, “Glorious is He, Whom no one knows how He is except He Himself. There is no one similar to Him and He is All-hearing, All-seeing. He cannot be limited, nor can He be felt or touched or moved. Eyes cannot see Him nor any of the senses can comprehend Him. He cannot be contained in anything, nor has He any body or form or figure or confine.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف وآخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 282,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/77",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/415",
              "text": "حَمْزَةَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ حَمْزَةَ بْنِ مُحَمَّدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:11:2",
        "text": [
          " كَتَبْتُ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) أَسْأَلُهُ عَنِ الْجِسْمِ وَ الصُّورَةِ فَكَتَبَ سُبْحَانَ مَنْ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ لَا جِسْمٌ وَ لَا صُورَةٌ .",
          "وَ رَوَاهُ مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ إِلَّا أَنَّهُ لَمْ يُسَمِّ الرَّجُلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from Sahld Bin Ziyad, from Hamza Bin Muhammad who said, ",
            "‘I wrote to Abu Al-Hassan<sup style=\"font-weight: normal\">asws</sup> asking him<sup style=\"font-weight: normal\">asws</sup> about the body and the image. So he<sup style=\"font-weight: normal\">asws</sup> wrote: ‘Glorious is the One<sup style=\"font-weight: normal\">azwj</sup>, there being nothing like Him<sup style=\"font-weight: normal\">azwj</sup>, neither a body nor an image’. ",
            "And it is reported by Muhammad Bin Abdu Abdullah, except that he did not name the man’."
          ],
          "en.sarwar": [
            " Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Hamzah ibn Muhammad who has said the following. “I wrote to Imam abu al-Hassan (al-Thalith 3rd (a.s.) asking about the body and form (of Allah). He wrote in reply, ‘Glorious is He similar to Who there is nothing. He is not a body nor has He any form.’” This Hadith has also been narrated by Muhammad ibn abu ‘Abdallah without giving the name of the person (from whom he has heard)."
          ]
        }
      },
      {
        "index": 283,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/77",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/204",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/416",
              "text": "مُحَمَّدِ بْنِ زَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مُحَمَّدِ بْنِ زَيْدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:11:3",
        "text": [
          " جِئْتُ إِلَى الرِّضَا ( عليه السلام ) أَسْأَلُهُ عَنِ التَّوْحِيدِ فَأَمْلَى عَلَيَّ الْحَمْدُ لِلَّهِ فَاطِرِ الْأَشْيَاءِ إِنْشَاءً وَ مُبْتَدِعِهَا ابْتِدَاعاً بِقُدْرَتِهِ وَ حِكْمَتِهِ لَا مِنْ شَيْ‏ءٍ فَيَبْطُلَ الِاخْتِرَاعُ وَ لَا لِعِلَّةٍ فَلَا يَصِحَّ الِابْتِدَاعُ خَلَقَ مَا شَاءَ كَيْفَ شَاءَ مُتَوَحِّداً بِذَلِكَ لِإِظْهَارِ حِكْمَتِهِ وَ حَقِيقَةِ رُبُوبِيَّتِهِ لَا تَضْبِطُهُ الْعُقُولُ وَ لَا تَبْلُغُهُ الْأَوْهَامُ وَ لَا تُدْرِكُهُ الْأَبْصَارُ وَ لَا يُحِيطُ بِهِ مِقْدَارٌ عَجَزَتْ دُونَهُ الْعِبَارَةُ وَ كَلَّتْ دُونَهُ الْأَبْصَارُ وَ ضَلَّ فِيهِ تَصَارِيفُ الصِّفَاتِ احْتَجَبَ بِغَيْرِ حِجَابٍ مَحْجُوبٍ وَ اسْتَتَرَ بِغَيْرِ سِتْرٍ مَسْتُورٍ عُرِفَ بِغَيْرِ رُؤْيَةٍ وَ وُصِفَ بِغَيْرِ صُورَةٍ وَ نُعِتَ بِغَيْرِ جِسْمٍ لَا إِلَهَ إِلَّا اللَّهُ الْكَبِيرُ الْمُتَعَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Muhammad Bin Ismail Bin Bazie, from Muhammad Bin Zayd who said, ",
            "‘I went over to Al-Reza<sup>asws</sup> asking him<sup>asws</sup> about the <span class=\"iTxt\">Tawheed</span> (Oneness). So he<sup>asws</sup> dictated unto me: ‘The Praise is for Allah<sup>azwj</sup>, Originator of the things, their Maker and their Initiator. He<sup>azwj</sup> Initiated these by His<sup>azwj</sup> Power and His<sup>azwj</sup> Wisdom."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Muhammad ibn Isma‘il ibn Bazi‘ from Muhammad ibn Zayd who has said the following. “I went to Imam al-Rida (a.s.) to ask about the Oneness of Allah (God). The Imam dictated to me thus, ‘All praise belongs to Allah, Who is the originator of all things. He is the inventor of all things, an invention that came from His power and wisdom but not from a thing so it would invalidate the invention and not from a cause so it would invalidate the novelty. He created whatever He wanted and howsoever He liked. He alone did all this to manifest His Wisdom and the truth of His Providence. Intelligence cannot comprehend Him, (Awham) imagination cannot reach Him, eyes cannot see Him and measurements cannot confine Him. The power of expression is unable to express Him in words. All sights are exhausted from reaching Him and the power of describing and defining have gone astray in its description and definition of His-self. He is hidden without any veil and is concealed without any covering. He is known without being seen; described without any form, and praised without any body. There is no god, except Allah, the Great, the Most High.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/3)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 284,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/358",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/417",
              "text": "عَلِيِّ بْنِ الْعَبَّاسِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/298",
              "text": "مُحَمَّدِ بْنِ حَكِيمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَمَّنْ ذَكَرَهُ عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:11:4",
        "text": [
          " وَصَفْتُ لِأَبِي إِبْرَاهِيمَ ( عليه السلام ) قَوْلَ هِشَامِ بْنِ سَالِمٍ الْجَوَالِيقِيِّ وَ حَكَيْتُ لَهُ قَوْلَ هِشَامِ بْنِ الْحَكَمِ أَنَّهُ جِسْمٌ فَقَالَ إِنَّ اللَّهَ تَعَالَى لَا يُشْبِهُهُ شَيْ‏ءٌ أَيُّ فُحْشٍ أَوْ خَناً أَعْظَمُ مِنْ قَوْلِ مَنْ يَصِفُ خَالِقَ الْأَشْيَاءِ بِجِسْمٍ أَوْ صُورَةٍ أَوْ بِخِلْقَةٍ أَوْ بِتَحْدِيدٍ وَ أَعْضَاءٍ تَعَالَى اللَّهُ عَنْ ذَلِكَ عُلُوّاً كَبِيراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bi nAbu Abdullah, from the one who mentioned it, from Ali Bin Al Abbas, from Ahmad Bin Muhammad Bin Abu Nasr, from Muhammad Bin Hakeym who said, ",
            "‘I described to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), the words of Hisham Bin Salim Al-Jawaliqy, and related to him<sup>asws</sup> the word of Hisham Bin Al-Hakam that He<sup>azwj</sup> is a body’. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> the Exalted cannot be resembled by anything. What can be a greater obscenity or betrayal than the words of the one who describes the Creator of the things as being with a body, or an image, or by a creature, or a limitation, or body parts? Exalted is Allah<sup>azwj</sup> from that, Loftier, Greater’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Abu ‘Abdallah has narrated from those he mentioned from Ali ibn al-‘Abbass from Ahmad ibn Muhammad ibn abu Nasr from Muhammad ibn Hakim. He has said that I explained to abu Ibrahim (Musa al-Kazim (a.s.), the words of Hisham ibn Salim al-Jawaliqi and the words of Hisham ibn al-Hakam that say Allah is a body. The Imam (a.s.) said, “Allah, the Most High, is not similar to any of the things. What can be more blasphemous and scandalous than to describe the Creator of all things by means of body, form, type of creation, limitations, limbs and organs. Allah, the Most High, the Great, is far above these things.”"
          ]
        }
      },
      {
        "index": 285,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/384",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/418",
              "text": "مُحَمَّدِ بْنِ الْفَرَجِ الرُّخَّجِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ عَنْ مُحَمَّدِ بْنِ الْفَرَجِ الرُّخَّجِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:11:5",
        "text": [
          " كَتَبْتُ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) أَسْأَلُهُ عَمَّا قَالَ هِشَامُ بْنُ الْحَكَمِ فِي الْجِسْمِ وَ هِشَامُ بْنُ سَالِمٍ فِي الصُّورَةِ فَكَتَبَ دَعْ عَنْكَ حَيْرَةَ الْحَيْرَانِ وَ اسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ لَيْسَ الْقَوْلُ مَا قَالَ الْهِشَامَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, raising it, from Muhammad Bin Al Faraj Al Rukhajiyin who said, ",
            "‘I wrote to Abu Al-Hassan<sup>asws</sup> asking him<sup>asws</sup> about what Hisham Bin Al Hakam said regarding the body, and Hisham Bin Salim (said) regarding the Image. So he<sup>asws</sup> wrote: ‘Leave from yourself the confusion of the confused ones and seek Refuge with Allah<sup>azwj</sup> from the Satan<sup>la</sup>. The words are not what the two Hishams have spoken’."
          ],
          "en.sarwar": [
            " 5. Ali ibn Muhammad, in a marfu‘ manner, has narrated from Muhammad ibn al-Faraj al-Rukhkhaji who has said the following. “I wrote to Imam abu al-Hassan (a.s.), about the words of Hisham ibn al-Hakam, about the body and the words of Hisham ibn Salim about the form (of Allah). He wrote in reply, ‘Remove from thyself the confusion of the confounded people and seek refuge from Allah against Shaytan (Satan). What the two Hishams have said is not correct.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 286,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/358",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/359",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/360",
              "text": "الْحُسَيْنِ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/361",
              "text": "بَكْرِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/402",
              "text": "الْحَسَنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/419",
              "text": "مُحَمَّدِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْحَسَنِ بْنِ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ مُحَمَّدِ بْنِ زِيَادٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:11:6",
        "text": [
          " سَمِعْتُ يُونُسَ بْنَ ظَبْيَانَ يَقُولُ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقُلْتُ لَهُ إِنَّ هِشَامَ بْنَ الْحَكَمِ يَقُولُ قَوْلًا عَظِيماً إِلَّا أَنِّي أَخْتَصِرُ لَكَ مِنْهُ أَحْرُفاً فَزَعَمَ أَنَّ اللَّهَ جِسْمٌ لِأَنَّ الْأَشْيَاءَ شَيْئَانِ جِسْمٌ وَ فِعْلُ الْجِسْمِ فَلَا يَجُوزُ أَنْ يَكُونَ الصَّانِعُ بِمَعْنَى الْفِعْلِ وَ يَجُوزُ أَنْ يَكُونَ بِمَعْنَى الْفَاعِلِ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَيْحَهُ أَ مَا عَلِمَ أَنَّ الْجِسْمَ مَحْدُودٌ مُتَنَاهٍ وَ الصُّورَةَ مَحْدُودَةٌ مُتَنَاهِيَةٌ فَإِذَا احْتَمَلَ الْحَدَّ احْتَمَلَ الزِّيَادَةَ وَ النُّقْصَانَ وَ إِذَا احْتَمَلَ الزِّيَادَةَ وَ النُّقْصَانَ كَانَ مَخْلُوقاً ",
          "قَالَ قُلْتُ فَمَا أَقُولُ قَالَ لَا جِسْمٌ وَ لَا صُورَةٌ وَ هُوَ مُجَسِّمُ الْأَجْسَامِ وَ مُصَوِّرُ الصُّوَرِ لَمْ يَتَجَزَّأْ وَ لَمْ يَتَنَاهَ وَ لَمْ يَتَزَايَدْ وَ لَمْ يَتَنَاقَصْ لَوْ كَانَ كَمَا يَقُولُونَ لَمْ يَكُنْ بَيْنَ الْخَالِقِ وَ الْمَخْلُوقِ فَرْقٌ وَ لَا بَيْنَ الْمُنْشِئِ وَ الْمُنْشَإِ لَكِنْ هُوَ الْمُنْشِئُ فَرْقٌ بَيْنَ مَنْ جَسَّمَهُ وَ صَوَّرَهُ وَ أَنْشَأَهُ إِذْ كَانَ لَا يُشْبِهُهُ شَيْ‏ءٌ وَ لَا يُشْبِهُ هُوَ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Muhammad Bin Ismail, from Al Husayn Bin Al Hassan, from Bakr Bin Salih, from Al Hassan Bin Saeed, from Abdullah Bin Al Mugheira, from Muhammad Bin Ziyad who said, ",
            "‘I heard Yunus Bin Zabyan saying, ‘I went over to Abu Abdullah<sup>asws</sup> and said to him<sup>asws</sup>, ‘Hisham Bin Al-Hakam is saying grievous words. Indeed, I shall summarise some from it. He is alleging that Allah<sup>azwj</sup> is a body, because the things are two things, body and deed of the body. Thus, it is not permissible that the Maker could happen to be in the meaning of the deed, and it is permissible that He<sup>azwj</sup> could happen to the in the meaning of the performer’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘Weo be unto him! Does he not know that the body is limited to its end-points, and the image is limited to its end-points? So when it carries the limitation, it would carry the increase and the decrease. And when it carries the increase and the decrease, it would be a creation’. ",
            "He (the narrator) said, ‘I said, ‘So what should I be saying?’ He<sup>asws</sup> said: ‘Neither a body, nor an image, and He<sup>azwj</sup> is the Sculptor of the bodies and the Artist of the images. He<sup>azwj</sup> cannot be divided, and cannot have boundaries, and cannot be increased, and cannot be decreased. Had it been as they are saying, there would not be any difference between the Creator and the created, nor between the Constructor and the constructed. But He<sup>azwj</sup> is the Constructor. There is a difference between the One<sup>azwj</sup> Who Sculpts it and Images it and Constructs it, when it was so than there is nothing resembling Him<sup>azwj</sup>, nor does He<sup>azwj</sup> resemble anything’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Abu ‘Abdallah has narrated from Muhammad ibn Isma‘il from al-Husayn ibn al-Hassan from Bakr ibn Salih from al-Hassan ibn Sa‘id from ‘Abdullah ibn al-Mughirah from Muhammad ibn Ziyad who has said the following. “I heard Yunus ibn Zabyan saying, ‘I went to meet abu ‘Abdallah (a.s.), and said, “Hisham ibn al-Hakam has uttered monstrous words. I will briefly mention a few words. He thinks Allah has a body because things are of two types; (a) body and (b) the acts. It is not possible for the Creator Himself to be just actions or functions. But it is possible to consider Him as the agent.” Abu ‘Abdallah (a.s.) then said, ‘That is not proper from him. Does he not know that the body has limits and the form has limits and an end? Whatever is subject to limitations is also subject to increase and reduction and such things are created.’ I then asked, “What then I should say?” He replied, ‘Allah is without body and form. He is the giver of body to all bodies and the giver of form to all forms. He can not be divided or limited. He does not grow or decrease. If it were as they say, then there would have been no difference between the Creator and the created, the inventor and the invented. But He is the Creator and the inventor. He has made the distinction and differentiation between that to which He has given body, form and that which He has invented. This is because nothing is similar to Him nor He resembles anything.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/7)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 287,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/358",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/359",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/417",
              "text": "عَلِيِّ بْنِ الْعَبَّاسِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/420",
              "text": "الْحَسَنِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمَّانِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنِ الْحَسَنِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمَّانِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:11:7",
        "text": [
          " قُلْتُ لِأَبِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) إِنَّ هِشَامَ بْنَ الْحَكَمِ زَعَمَ أَنَّ اللَّهَ جِسْمٌ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ عَالِمٌ سَمِيعٌ بَصِيرٌ قَادِرٌ مُتَكَلِّمٌ نَاطِقٌ وَ الْكَلَامُ وَ الْقُدْرَةُ وَ الْعِلْمُ يَجْرِي مَجْرَى وَاحِدٍ لَيْسَ شَيْ‏ءٌ مِنْهَا مَخْلُوقاً ",
          "فَقَالَ قَاتَلَهُ اللَّهُ أَ مَا عَلِمَ أَنَّ الْجِسْمَ مَحْدُودٌ وَ الْكَلَامَ غَيْرُ الْمُتَكَلِّمِ مَعَاذَ اللَّهِ وَ أَبْرَأُ إِلَى اللَّهِ مِنْ هَذَا الْقَوْلِ لَا جِسْمٌ وَ لَا صُورَةٌ وَ لَا تَحْدِيدٌ وَ كُلُّ شَيْ‏ءٍ سِوَاهُ مَخْلُوقٌ إِنَّمَا تُكَوَّنُ الْأَشْيَاءُ بِإِرَادَتِهِ وَ مَشِيئَتِهِ مِنْ غَيْرِ كَلَامٍ وَ لَا تَرَدُّدٍ فِي نَفَسٍ وَ لَا نُطْقٍ بِلِسَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Muhammad Bin Ismail, from Ali Bin Al Abbas, from Al Hassan Bin Abdul Rahman Al Himmany who said, ",
            "‘I said to Abu Al-Hassan Musa Bin Ja’far<sup>asws</sup> that Hisham Bin Al-Hakam is alleging that Allah<sup>azwj</sup> is a body. There is nothing resembling Him<sup>azwj</sup>. All-knowing, Hearing, Seeing, Powerful. A Speaker speaking, and the Speech, and the Power, and the Knowledge, (all) flowing as one flow, there being nothing from it being Created’. ",
            "So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Kill him! Does he not know that the body is limited, and the speech is other than the speaker? I<sup>asws</sup> seek Refuge of Allah<sup>azwj</sup> and for Allah<sup>azwj</sup> I keep away from this speech. There is neither a body, nor an image, nor a limitation, and everything Besides Him<sup>azwj</sup> is a creation. But rather, the things came to be by His<sup>azwj</sup> Will, and His<sup>azwj</sup> Desire from without a speech, or hesitation in Himself<sup>azwj</sup>, or speaking by a tongue’."
          ],
          "en.sarwar": [
            " 7. Muhammad ibn abu ‘Abdallah has narrated from Muhammad ibn Isma‘il from Ali ibn al-‘Abbass from al-Hassan ibn ‘Abd al-Rahman al-Hammani who has said the following. “I said to abu al-Hassan Musa ibn Ja‘far (a.s.), ‘Hisham ibn al-Hakam claims that Allah is a body like unto Whom there is no one. He is All-knowing, All-hearing, All-seeing, All-powerful. He speaks and reasons. His word, His power, His knowledge are all in one. No one of them is created.’” The Imam said, “May Allah be his foe. Does he not know that the body is limited, and that the speech is other than what the speaker is? I seek refuge from Allah and I disclaim such words. Allah does not have a body, form or any kind of limitations. Allah has created everything. He creates things as and when He wills without any word or planing in the mind or utterance of the tongue.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 288,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/298",
              "text": "مُحَمَّدِ بْنِ حَكِيمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:11:8",
        "text": [
          " وَصَفْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) قَوْلَ هِشَامٍ الْجَوَالِيقِيِّ وَ مَا يَقُولُ فِي الشَّابِّ الْمُوَفَّقِ وَ وَصَفْتُ لَهُ قَوْلَ هِشَامِ بْنِ الْحَكَمِ فَقَالَ إِنَّ اللَّهَ لَا يُشْبِهُهُ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Muhammad Bin Hakeym who said, ",
            "‘I described to Abu Al-Hassan<sup>asws</sup> the words of Hisham Al-Jawaliqy and what he is saying regarding the fully grown youth, and described to him<sup>asws</sup> the words of Hisham Bin Al-Hakam. So he<sup>asws</sup> said: ‘Surely Allah<sup>azwj</sup>, nothing resembles Him<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 8. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Iisa from Yunus from Muhammad ibn Hakim who has said the following. “I mentioned to abu al-Hassan al-Awwal (the first) (a.s.), the statements of Hisham al-Jawaliqi and what he says about fully grown up young man (see Hadith 3 Chapter on prohibited Attributes). I also mentioned the statements of Hisham ibn al-Hakam in this matter.” The Imam said, “Allah, certainly, is not similar to any thing.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:11",
  "kind": "verse_list"
}