{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:1:3:13",
        "titles": {
          "ar": "باب آخَرُ وَ هُوَ مِنَ الْبَابِ الْأَوَّلِ",
          "en": "Chapter 13 – Another (chapter), and it is from the first chapter"
        }
      }
    ],
    "index": 36,
    "local_index": 13,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:1:3:14",
        "titles": {
          "ar": "بَابُ الْإِرَادَةِ أَنَّهَا مِنْ صِفَاتِ الْفِعْلِ وَ سَائِرِ صِفَاتِ الْفِعْلِ",
          "en": "Chapter 14 – The Intention (Will), it is from the Attributes of the deed, and the rest of the Attributes of the deed"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:1:3:12",
        "titles": {
          "ar": "بَابُ صِفَاتِ الذَّاتِ",
          "en": "Chapter 12 – Attributes of the Self"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:13",
    "titles": {
      "ar": "باب آخَرُ وَ هُوَ مِنَ الْبَابِ الْأَوَّلِ",
      "en": "Chapter 13 – Another (chapter), and it is from the first chapter"
    },
    "verse_count": 2,
    "verse_start_index": 294,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/13)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 295,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/198",
              "text": "مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/317",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/195",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/426",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:13:1",
        "text": [
          " فِي صِفَةِ الْقَدِيمِ إِنَّهُ وَاحِدٌ صَمَدٌ أَحَدِيُّ الْمَعْنَى لَيْسَ بِمَعَانِي كَثِيرَةٍ مُخْتَلِفَةٍ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ يَزْعُمُ قَوْمٌ مِنْ أَهْلِ الْعِرَاقِ أَنَّهُ يَسْمَعُ بِغَيْرِ الَّذِي يُبْصِرُ وَ يُبْصِرُ بِغَيْرِ الَّذِي يَسْمَعُ ",
          "قَالَ فَقَالَ كَذَبُوا وَ أَلْحَدُوا وَ شَبَّهُوا تَعَالَى اللَّهُ عَنْ ذَلِكَ إِنَّهُ سَمِيعٌ بَصِيرٌ يَسْمَعُ بِمَا يُبْصِرُ وَ يُبْصِرُ بِمَا يَسْمَعُ",
          "قَالَ قُلْتُ يَزْعُمُونَ أَنَّهُ بَصِيرٌ عَلَى مَا يَعْقِلُونَهُ قَالَ فَقَالَ تَعَالَى اللَّهُ إِنَّمَا يَعْقِلُ مَا كَانَ بِصِفَةِ الْمَخْلُوقِ وَ لَيْسَ اللَّهُ كَذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Ubeyd, from Hammad, from Hareyz, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Regarding the Attribute of the eternality, He<sup>azwj</sup> is One, Solid (not hollow), is in one meaning. It is not with many different meanings’. I said, ‘May I be sacrificed for you<sup>asws</sup>! A group from the people of Al-Iraq are alleging that He<sup>azwj</sup> is Hearing with other than what He<sup>azwj</sup> is Seeing (with), and He<sup>azwj</sup> is Seeing with other than what He<sup>azwj</sup> is Hearing (with)?’ ",
            "So he<sup>asws</sup> said: ‘They are lying! They are limiting and resembling (with Allah<sup>azwj</sup>) Exalted is Allah<sup>azwj</sup> from that. He<sup>azwj</sup> is Hearing, Seeing. He<sup>azwj</sup> Hears with what He<sup>azwj</sup> Sees, and Sees with what He<sup>azwj</sup> Hears’. ",
            "He (the narrator) said, ‘I said, ‘They are alleging that He<sup>azwj</sup> is Seeing upon what they are comprehending (hearing and seeing to be)’. So he<sup>asws</sup> said: ‘Exalted is Allah<sup>azwj</sup>! But rather, they are (trying to) comprehend with that which is a quality of the creatures, and Allah<sup>azwj</sup> is not like that’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from Hammad from Hariz from Muhammad ibn Muslim from abu Ja‘far (a.s.) who has said the following about being eternal. “He, Allah, is One, the Self-sufficient. He is One and only One without any multiplicity in different meaning.” The narrator said that I further inquired, “May Allah take my soul in your service, certain people in Iraq think, that Allah hears with something different from what He sees with, and He sees with something different from what He hears with.” The Imam replied, “They have said a lie and have become atheists for considering Allah similar to other things. Allah, the Most High, indeed is above all things. He is All-hearing and All-seeing. He hears with what He sees, and sees with what He hears.” The narrator has said that he further asked, “Those people are also of the opinion that Allah is All-seeing in the same sense and in the same way as they perceive.” The Imam said, “Allah is High Exalted above all such things. Only such things are perceived, which has the attributes of created things. Allah is not created.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/13)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 296,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/427",
              "text": "الْعَبَّاسِ بْنِ عَمْرٍو"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/44",
              "text": "هِشَامِ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْعَبَّاسِ بْنِ عَمْرٍو عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:13:2",
        "text": [
          " فِي حَدِيثِ الزِّنْدِيقِ الَّذِي سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ لَهُ أَ تَقُولُ إِنَّهُ سَمِيعٌ بَصِيرٌ فَقَالَ أَبُو عَبْدِ اللَّهِ هُوَ سَمِيعٌ بَصِيرٌ سَمِيعٌ بِغَيْرِ جَارِحَةٍ وَ بَصِيرٌ بِغَيْرِ آلَةٍ بَلْ يَسْمَعُ بِنَفْسِهِ وَ يُبْصِرُ بِنَفْسِهِ وَ لَيْسَ قَوْلِي إِنَّهُ سَمِيعٌ بِنَفْسِهِ أَنَّهُ شَيْ‏ءٌ وَ النَّفْسُ شَيْ‏ءٌ آخَرُ وَ لَكِنِّي أَرَدْتُ عِبَارَةً عَنْ نَفْسِي إِذْ كُنْتُ مَسْئُولًا وَ إِفْهَاماً لَكَ إِذْ كُنْتَ سَائِلًا ",
          "فَأَقُولُ يَسْمَعُ بِكُلِّهِ لَا أَنَّ كُلَّهُ لَهُ بَعْضٌ لِأَنَّ الْكُلَّ لَنَا لَهُ بَعْضٌ وَ لَكِنْ أَرَدْتُ إِفْهَامَكَ وَ التَّعْبِيرُ عَنْ نَفْسِي وَ لَيْسَ مَرْجِعِي فِي ذَلِكَ كُلِّهِ إِلَّا أَنَّهُ السَّمِيعُ الْبَصِيرُ الْعَالِمُ الْخَبِيرُ بِلَا اخْتِلَافِ الذَّاتِ وَ لَا اخْتِلَافِ مَعْنًى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Abbas Bin Amro, ",
            "(It has been narrated) from Hisham Bin Al-Hakam who said in a Hadeeth of the atheist who asked Abu Abdullah<sup>asws</sup> that, ‘He said to him<sup>asws</sup>, ‘Are you<sup>asws</sup> saying that He<sup>azwj</sup> is Hearing, Seeing?’ So Abu Abdullah<sup>asws</sup> said: ‘He<sup>azwj</sup> is Hearing, Seeing, Hearing without a body part and seeing without an instrument. But, He<sup>azwj</sup> Hears by Himself<sup>azwj</sup> and Sees by Himself<sup>azwj</sup>; and it is not my<sup>asws</sup> saying that ‘He<sup>azwj</sup> Hears by Himself<sup>azwj</sup>’, that He<sup>azwj</sup> is one thing and His<sup>azwj</sup> Self is another thing. But I<sup>asws</sup> intend it as a lesson from myself<sup>asws</sup> when I<sup>asws</sup> was questioned and as an understanding for you when you are the questioner. ",
            "Thus, I<sup>asws</sup> am saying, He<sup>azwj</sup> Hears with All of Him<sup>azwj</sup>, not that ‘the whole of Him<sup>azwj</sup>’ are parts, because the ‘whole’ for us, there are parts to it. But I<sup>asws</sup> intend to make you understand and as the lesson from myself<sup>asws</sup>, and my<sup>asws</sup> reference regarding that ‘all of Him<sup>azwj</sup>’, is not, except that He<sup>azwj</sup> is the Hearing, the Seeing, the Knowing, the Aware, without there being any difference of the Self, nor difference of the meaning’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Ibrahim has narrated from his father from al-‘Abbass ibn ’Amr from Hisham ibn al-Hakam, who about the debate with an atheist (see Hadith No.225 - 6), has said the following. “He asked Imam abu ‘Abdallah (a.s.), ‘Do you say that He is All-hearing and All-seeing?’ Abu ‘Abdallah said, “Allah is All-hearing, All-seeing. He hears without any organ and sees without any instrument. He Himself hears and He Himself sees. When I say He Himself hears I do not mean thereby that He is One and His self is something different. I only try to express what I have in my mind to answer a question and help you understand the answer. So I say, “His whole self hears. This does not mean that His whole has parts. In our perception whole consists of parts. It is to make you understand and express my thoughts. It all amounts to saying that He is All-hearing, All-seeing, All-knowing and All-aware, without any multiplicity in the meaning.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:13",
  "kind": "verse_list"
}