{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:1:3:14",
        "titles": {
          "ar": "بَابُ الْإِرَادَةِ أَنَّهَا مِنْ صِفَاتِ الْفِعْلِ وَ سَائِرِ صِفَاتِ الْفِعْلِ",
          "en": "Chapter 14 – The Intention (Will), it is from the Attributes of the deed, and the rest of the Attributes of the deed"
        }
      }
    ],
    "index": 37,
    "local_index": 14,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:1:3:15",
        "titles": {
          "ar": "بَابُ حُدُوثِ الْأَسْمَاءِ",
          "en": "Chapter 15 – Occurrence (coming into being) of the Names"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:1:3:13",
        "titles": {
          "ar": "باب آخَرُ وَ هُوَ مِنَ الْبَابِ الْأَوَّلِ",
          "en": "Chapter 13 – Another (chapter), and it is from the first chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:14",
    "titles": {
      "ar": "بَابُ الْإِرَادَةِ أَنَّهَا مِنْ صِفَاتِ الْفِعْلِ وَ سَائِرِ صِفَاتِ الْفِعْلِ",
      "en": "Chapter 14 – The Intention (Will), it is from the Attributes of the deed, and the rest of the Attributes of the deed"
    },
    "verse_count": 7,
    "verse_start_index": 296,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/ 2)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (15/ 1)"
        ],
        "index": 297,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:14:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> الْعَطَّارُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى الْأَشْعَرِيِّ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ الْأَهْوَازِيِّ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَمْ يَزَلِ اللَّهُ مُرِيداً قَالَ إِنَّ الْمُرِيدَ لَا يَكُونُ إِلَّا لِمُرَادٍ مَعَهُ لَمْ يَزَلِ اللَّهُ عَالِماً قَادِراً ثُمَّ أَرَادَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya Al Attar, from Ahmad Bin Muhammad Bin Isa Al Ashary, from Al Husayn Bin Saeed Al Ahwazy, from Al Nazar Bin Suweyd, from Aasim Bin Humeyd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘Allah<sup>azwj</sup> never ceased to be an Intender?’ He<sup>asws</sup> said: ‘The Intender cannot happen to be except with an intention along with him. Allah<sup>azwj</sup> never ceased to be a Knower, Powerful, then Intended (Willed)’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya al-‘Attar has narrated from Ahmad ibn Muhammad ibn ‘Isa al-Ash‘ari from al-Husayn ibn Sa‘id al-Ahwazi from an-Nadr ibn Suwayd from ‘Asim ibn Hamiyd who has said the following. “I asked abu ‘Abdallah (a.s.), ‘Is Allah’s will eternal?’” He replied, Will is always with what is willed. Allah is eternally All-knowing and All-powerful and then He wills.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/16)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 298,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:14:2",
        "text": [
          "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنِ الْحَسَنِ بْنِ الْجَهْمِ عَنْ بُكَيْرِ بْنِ أَعْيَنَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) عِلْمُ اللَّهِ وَ مَشِيئَتُهُ هُمَا مُخْتَلِفَانِ أَوْ مُتَّفِقَانِ فَقَالَ الْعِلْمُ لَيْسَ هُوَ الْمَشِيئَةَ أَ لَا تَرَى أَنَّكَ تَقُولُ سَأَفْعَلُ كَذَا إِنْ شَاءَ اللَّهُ وَ لَا تَقُولُ سَأَفْعَلُ كَذَا إِنْ عَلِمَ اللَّهُ فَقَوْلُكَ إِنْ شَاءَ اللَّهُ دَلِيلٌ عَلَى أَنَّهُ لَمْ يَشَأْ فَإِذَا شَاءَ كَانَ الَّذِي شَاءَ كَمَا شَاءَ وَ عِلْمُ اللَّهِ السَّابِقُ لِلْمَشِيئَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Muhammad Bin Ismail, from Al Husayn Bin Al Hassan, from Bakr Bin Salih, from Ali Bin Asbaat, from Al Hassan Bin Al Jahm, from Bukeyr Bin Ayn who said, ",
            "‘I said to Abu Abu Abdullah<sup>asws</sup>, ‘The Knowledge of Allah<sup>azwj</sup> and His<sup>azwj</sup> Desire are both creations or co-incidental?’ So he<sup>asws</sup> said: ‘The Knowledge, it is not the Desire. Do you not see that you (yourself) are saying, ‘I shall do such if Allah<sup>azwj</sup> so Desires it’, and you are not saying, ‘I shall do such if Allah<sup>azwj</sup> Knows it’? So, your words, ‘If Allah<sup>azwj</sup> so Desires it’ is evidence upon that He<sup>azwj</sup> has not Desired it yet. So when He<sup>azwj</sup> does Desire it, that which He<sup>azwj</sup> so Desires, it would occur, that which He<sup>azwj</sup> so Desires, and Knowledge of Allah<sup>azwj</sup> is Precedes to the Desire’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn abu ‘Abdallah has narrated from Muhammad ibn Isma‘il from al-Husayn ibn al-Hassan from Bakr ibn Salih from Ali ibn Asbat from al-Hassan ibn al-Jahm from Bukayr ibn A‘yan who has said the following. “I asked abu ‘Abdallah (a.s.), ‘Are the knowledge and the will of Allah different or the same?’” He replied, “His knowledge is not the same as His will. Consider when you say, ‘If Allah wills, I will do this,’ and you do not say, “If Allah knows I will do this.” Your own words, if Allah wills are proof that Allah has not yet willed it. If He would will what He would do, it happens exactly as He wills. His knowledge is before His will.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/16)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/16)"
        ],
        "index": 299,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:14:3",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) أَخْبِرْنِي عَنِ الْإِرَادَةِ مِنَ اللَّهِ وَ مِنَ الْخَلْقِ قَالَ فَقَالَ الْإِرَادَةُ مِنَ الْخَلْقِ الضَّمِيرُ وَ مَا يَبْدُو لَهُمْ بَعْدَ ذَلِكَ مِنَ الْفِعْلِ وَ أَمَّا مِنَ اللَّهِ تَعَالَى فَإِرَادَتُهُ إِحْدَاثُهُ لَا غَيْرُ ذَلِكَ لِأَنَّهُ لَا يُرَوِّي وَ لَا يَهُمُّ وَ لَا يَتَفَكَّرُ وَ هَذِهِ الصِّفَاتُ مَنْفِيَّةٌ عَنْهُ وَ هِيَ صِفَاتُ الْخَلْقِ ",
          "فَإِرَادَةُ اللَّهِ الْفِعْلُ لَا غَيْرُ ذَلِكَ يَقُولُ لَهُ كُنْ فَيَكُونُ بِلَا لَفْظٍ وَ لَا نُطْقٍ بِلِسَانٍ وَ لَا هِمَّةٍ وَ لَا تَفَكُّرٍ وَ لَا كَيْفَ لِذَلِكَ كَمَا أَنَّهُ لَا كَيْفَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘Inform me about the Intention (Will) from Allah<sup>azwj</sup>, and from the creature’. So he<sup>asws</sup> said: ‘The Intention from the creature (people) is the conscience and begins for them after that from the deed, and as for (the Intention) from Allah<sup>azwj</sup> the Exalted, so His<sup>azwj</sup> Intention is His<sup>azwj</sup> Creation and not other than that, because He<sup>azwj</sup> neither narrates, nor whims, nor thinks, and these Attributes are negated from Him<sup>azwj</sup>, and these are the attributes of the creatures. ",
            "So the Intention of Allah<sup>azwj</sup> is the deed, not other than that. He<sup>azwj</sup> is Saying to it, ‘Be’, so it occurs (comes into being), without a letter spoken by a tongue, nor a whim, nor thinking, nor is there a ‘where’ for that just as there is no ‘where’ (qualitative state) for Him<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya who has said the following. “I asked abu al-Hassan (a.s.), ‘Enlighten me about the will of Allah and the will of His creatures.’” He said, “The will of His creatures comes from what goes in their minds and leads to action. Will of Allah, the Most High, is His inventing and nothing else because Allah does not need to reflect, deliberate or think. Such qualities do not exist with Him. They are the attributes of His creation. Allah’s will is His acts and nothing else. He says to it: Be, and it comes into existence, without any words or utterance of the tongue, any inclination and reflection. His will has no conditions just as His self has no conditions.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن ويحتمل وجوها من التأويل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/ 2)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/16)"
        ],
        "index": 300,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:14:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ خَلَقَ اللَّهُ الْمَشِيئَةَ بِنَفْسِهَا ثُمَّ خَلَقَ الْأَشْيَاءَ بِالْمَشِيئَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Axina, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Created the Desire by itself, then Created the things with the Desire’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from abu ‘Abdallah (a.s.) who has said the following. “Allah created His Will by Will itself. Then, He created all things by His Will.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/20)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 301,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:14:5",
        "relations": {
          "Mentions": [
            "/books/quran:20:81"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنِ الْمَشْرِقِيِّ حَمْزَةَ بْنِ الْمُرْتَفِعِ عَنْ بَعْضِ أَصْحَابِنَا قَالَ كُنْتُ فِي مَجْلِسِ أَبِي جَعْفَرٍ ( عليه السلام ) إِذْ دَخَلَ عَلَيْهِ عَمْرُو بْنُ عُبَيْدٍ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ قَوْلُ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ مَنْ يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوى مَا ذَلِكَ الْغَضَبُ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) هُوَ الْعِقَابُ يَا عَمْرُو إِنَّهُ مَنْ زَعَمَ أَنَّ اللَّهَ قَدْ زَالَ مِنْ شَيْ‏ءٍ إِلَى شَيْ‏ءٍ فَقَدْ وَصَفَهُ صِفَةَ مَخْلُوقٍ وَ إِنَّ اللَّهَ تَعَالَى لَا يَسْتَفِزُّهُ شَيْ‏ءٌ فَيُغَيِّرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from Muhammad Bin Isa, from Al Mashraqy Hamza Bin Al Mutafa’a, from one of our companions who said, ",
            "‘I was in a gathering of Abu Ja’far<sup>asws</sup> when Amro Bin Ubeyd came over to him<sup>asws</sup> and said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h81\">[20:81]</a>, and whomsoever My Anger is due upon so he has perished</span>. What is that Anger?’ So Abu Ja’far<sup>asws</sup> said: ‘It is the Punishment, O Amro, and he who alleges that Allah<sup>azwj</sup> has ceased to be from a thing to a thing, so he has described Him<sup>azwj</sup> with an attribute of a creature, and that Allah<sup>azwj</sup> the Exalted. Nothing stirs Him<sup>azwj</sup>, so He<sup>azwj</sup> would change’."
          ],
          "en.sarwar": [
            " 5. A group of our people has narrated from Ahmad ibn Muhammad al-Barqi from Muhammad ibn ‘Isa from al-Mashriqi Hamzah ibn al-Murtafi‘ from some of our people who has said the following. “I was in the presence of abu Ja‘far (a.s.) when ‘Amr ibn ‘Ubayd said, ‘May Allah take my soul in your service, what is the meaning of Allah’s words, “Whoever becomes subject to my anger he is destroyed.” 20:84 What is this anger?’ Abu Ja‘far (a.s.) replied, “O ‘Amr, His anger is His punishment. O ‘Amr, whoever thinks Allah changes from one state to another, has ascribed to Allah the attributes of His creatures. Nothing can provoke Allah, the Sublime, to change Him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/21)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 302,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:14:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْعَبَّاسِ بْنِ عَمْرٍو عَنْ هِشَامِ بْنِ الْحَكَمِ فِي حَدِيثِ الزِّنْدِيقِ الَّذِي سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَكَانَ مِنْ سُؤَالِهِ أَنْ قَالَ لَهُ فَلَهُ رِضًا وَ سَخَطٌ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) نَعَمْ وَ لَكِنْ لَيْسَ ذَلِكَ عَلَى مَا يُوجَدُ مِنَ الْمَخْلُوقِينَ وَ ذَلِكَ أَنَّ الرِّضَا حَالٌ تَدْخُلُ عَلَيْهِ فَتَنْقُلُهُ مِنْ حَالٍ إِلَى حَالٍ لِأَنَّ الْمَخْلُوقَ أَجْوَفُ مُعْتَمِلٌ مُرَكَّبٌ لِلْأَشْيَاءِ فِيهِ مَدْخَلٌ وَ خَالِقُنَا لَا مَدْخَلَ لِلْأَشْيَاءِ فِيهِ لِأَنَّهُ وَاحِدٌ وَاحِدِيُّ الذَّاتِ وَاحِدِيُّ الْمَعْنَى فَرِضَاهُ ثَوَابُهُ وَ سَخَطُهُ عِقَابُهُ مِنْ غَيْرِ شَيْ‏ءٍ يَتَدَاخَلُهُ فَيُهَيِّجُهُ وَ يَنْقُلُهُ مِنْ حَالٍ إِلَى حَالٍ لِأَنَّ ذَلِكَ مِنْ صِفَةِ الْمَخْلُوقِينَ الْعَاجِزِينَ الْمُحْتَاجِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Abbas Bin Amro, ",
            "(It has been narrated) from Hisham Bin Al-Hakam in a Hadeeth of the atheist who questioned Abu Abdullah<sup>asws</sup>. So, it was from his questions that he said to him<sup>asws</sup>, ‘So, for Him<sup>azwj</sup> is Pleasure and Anger?’ So Abu Abdullah<sup>asws</sup> said: ‘Yes, but that is not upon what is found from the creatures, and that is because the pleasure is a state entered upon, so you would be transferred from a state into a state, because the creature is hollow, active, compound of the things. In him is an entrance, and our Creator has no entrance for the things in Him<sup>azwj</sup>, because He<sup>azwj</sup> is the One<sup>azwj</sup>. The One<sup>azwj</sup> in the Self and One in the Meaning. Thus, His<sup>azwj</sup> Pleasure is His<sup>azwj</sup> Rewarding, and His<sup>azwj</sup> Anger is His<sup>azwj</sup> Punishment from without anything having entered Him<sup>azwj</sup>, so it would provoke Him<sup>azwj</sup> and He<sup>azwj</sup> would change from a state to a state, because that is from the attributes of the creatures, the frustrated, the needy’."
          ],
          "en.sarwar": [
            " 6. Ali ibn Ibrahim has narrated from his father from al-‘Abbass ibn ‘Amr from Hisham ibn al-Hakam who has narrated the following in the debate with the atheist who asked abu ‘Abdallah (a.s.) (See Hadith Nos.225 - 6 and 297 -2). “Does Allah become pleased and displeased?” Abu ‘Abdallah (a.s.) replied, “Yes, but not like that which is found in His creatures. In His creatures the pleasure is a state (hal), which enters into him and changes him from one state to another. The creatures are hollow, active and compound with entrance in them. Nothing can enter into our Creator. Because He is One, a single self, a single meaning. His pleasure is His reward and His anger is His punishment without anything entering in Him to motivate and change Him from one state to another because these are of the attributes of His creatures who are weak and needy.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/22)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/16)"
        ],
        "index": 303,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:14:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْمَشِيئَةُ مُحْدَثَةٌ "
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Desire is a creation’."
          ],
          "en.sarwar": [
            " 7. A group of our people has narrated from Ahmad ibn Muhammad ibn Khalid from his father from ibn abu ‘Umayr from ibn ’Udhaynah from Muhammad ibn Muslim from abu ‘Abdallah (a.s.) who has said, “The will is created.” Summery Statements on the Attributes of His self Sifat al-Dhat and the Attributes of His Actions Sifat al-Fi‘1 For every two attributes which you attribute to Allah (e.g. The Creator, The Sustainer), of which each has its own separate being, (i.e. The Creator achieves its being, as an attribute of Allah’ through something which Allah creates, and The Sustainer achieves its being, as an attribute of Allah, through a created being which He sustains), these attributes are attributes of (His) action. (Because if two attributes are separate in being, obviously each of them differs in their being with the thing with which they are attributed, and therefore both the attribute and the attributed have their own being. Therefore, in order to distinguish an attribute of action from an attribute of essence, it is always necessary to compare that attribute with another one. If we perceives these two to be independent of each other in being, then both of them are attributes of action). The explanation (and proof) of this sentence is that you prove (establish), in respect of His Being, what He intends to do and what He does not intend, what pleases Him and what displeases Him, what He likes and what He dislikes. If the intention had been the attribute of His essence like the attribute of knowledge and power, His not intending (for something) would have been its contradiction. Similarly, if His liking for something had been the attribute of His essence, His dislike (of something) would have been its contradiction. Do you not see, we do not find in His Being anything which He does not know and anything over which He has no power? Such are the attributes of His essence (Self), which are everlasting. We can never attribute to Allah power and (its opposite) weakness. (Similarly, we can neither attribute to Him knowledge and [its opposite] ignorance and stupidity, nor can we attribute to Him wisdom and 1 its opposite] error. Nor can we attribute to Him honor and [its opposite] disgrace). It is permissible to say, “He (Allah) loves him who obeys Him and hates him who disobeys Him. He favors him who obeys Him and is hostile to him who disobeys Him. And verily, He is pleased and He is also displeased. It is also permissible to say in the invocations: ‘O my Allah, be pleased with me and do not be angry at me. Favor me and do not be hostile to me.’” But it is not permissible to say, “Allah has power to know and has no power not to know. He has power to possess and has no power not to possess. He has power to be powerful and wise, and has no power to be otherwise, i.e. without power and wisdom. He has power to be generous and has no power to be not generous. He has power to be forgiving and has no power to be not forgiving.” It is also not permissible to say, “Allah intended to be the Nourishing, the Everlasting, the Mighty, the Wise, the Possessor, the all-knowing, the all-Powerful.” Since these are the attributes of His essence while intention is among His attributes of action. “Do you not see that it is said; “Allah intended this and did not intend that.” Every Attribute of His essence negates its opposite in respect of Him. He is called: “The Living, the All-knowing, the All-hearing, the All-seeing, the All-mighty, the All-wise, the Rich, the King, the Clement, the Just and the Generous.” The opposite of knowledge is ignorance. The opposite of power is inability. The opposite of life is death. The opposite of honor is humiliation. The opposite of wisdom is error. The opposite of clemency is haste and ignorance. The opposite of justice is oppression and tyranny. (So, by proving any of His essential attributes its opposite is negated.)"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:14",
  "kind": "verse_list"
}