{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:1:3", "titles": {"ar": "كِتَابُ التَّوْحِيدِ", "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"}}, {"indexed_titles": {"en": "Chapter 15"}, "path": "/books/al-kafi:1:3:15", "titles": {"ar": "بَابُ حُدُوثِ الْأَسْمَاءِ", "en": "Chapter 15 – Occurrence (coming into being) of the Names"}}], "index": 38, "local_index": 15, "part_type": "Chapter", "path": "/books/al-kafi:1:3:15", "titles": {"ar": "بَابُ حُدُوثِ الْأَسْمَاءِ", "en": "Chapter 15 – Occurrence (coming into being) of the Names"}, "verse_count": 4, "verse_start_index": 303, "verses": [{"index": 304, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:3:15:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى خَلَقَ اسْماً بِالْحُرُوفِ غَيْرَ مُتَصَوَّتٍ وَ بِاللَّفْظِ غَيْرَ مُنْطَقٍ وَ بِالشَّخْصِ غَيْرَ مُجَسَّدٍ وَ بِالتَّشْبِيهِ غَيْرَ مَوْصُوفٍ وَ بِاللَّوْنِ غَيْرَ مَصْبُوغٍ مَنْفِيٌّ عَنْهُ الْأَقْطَارُ مُبَعَّدٌ عَنْهُ الْحُدُودُ مَحْجُوبٌ عَنْهُ حِسُّ كُلِّ مُتَوَهِّمٍ مُسْتَتِرٌ غَيْرُ مَسْتُورٍ\nفَجَعَلَهُ كَلِمَةً تَامَّةً عَلَى أَرْبَعَةِ أَجْزَاءٍ مَعاً لَيْسَ مِنْهَا وَاحِدٌ قَبْلَ الْآخَرِ فَأَظْهَرَ مِنْهَا ثَلَاثَةَ أَسْمَاءٍ لِفَاقَةِ الْخَلْقِ إِلَيْهَا وَ حَجَبَ مِنْهَا وَاحِداً وَ هُوَ الِاسْمُ الْمَكْنُونُ الْمَخْزُونُ فَهَذِهِ الْأَسْمَاءُ الَّتِي ظَهَرَتْ فَالظَّاهِرُ هُوَ اللَّهُ تَبَارَكَ وَ تَعَالَى وَ سَخَّرَ سُبْحَانَهُ لِكُلِّ اسْمٍ مِنْ هَذِهِ الْأَسْمَاءِ أَرْبَعَةَ أَرْكَانٍ فَذَلِكَ اثْنَا عَشَرَ رُكْناً \nثُمَّ خَلَقَ لِكُلِّ رُكْنٍ مِنْهَا ثَلَاثِينَ اسْماً فِعْلًا مَنْسُوباً إِلَيْهَا فَهُوَ الرَّحْمَنُ الرَّحِيمُ الْمَلِكُ الْقُدُّوسُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَ لَا نَوْمٌ الْعَلِيمُ الْخَبِيرُ السَّمِيعُ الْبَصِيرُ الْحَكِيمُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ الْعَلِيُّ الْعَظِيمُ الْمُقْتَدِرُ الْقَادِرُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْبَارِئُ الْمُنْشِئُ الْبَدِيعُ الرَّفِيعُ الْجَلِيلُ الْكَرِيمُ الرَّازِقُ الْمُحْيِي الْمُمِيتُ الْبَاعِثُ الْوَارِثُ \nفَهَذِهِ الْأَسْمَاءُ وَ مَا كَانَ مِنَ الْأَسْمَاءِ الْحُسْنَى حَتَّى تَتِمَّ ثَلَاثَ مِائَةٍ وَ سِتِّينَ اسْماً فَهِيَ نِسْبَةٌ لِهَذِهِ الْأَسْمَاءِ الثَّلَاثَةِ وَ هَذِهِ الْأَسْمَاءُ الثَّلَاثَةُ أَرْكَانٌ وَ حَجَبَ الِاسْمَ الْوَاحِدَ الْمَكْنُونَ الْمَخْزُونَ بِهَذِهِ الْأَسْمَاءِ الثَّلَاثَةِ وَ ذَلِكَ قَوْلُهُ تَعَالَى قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Salih Bin Abu Hammad, from Al Husayn Bin Yazeed, from Al Hassan Bin Ali Bin Abu Hamza, from Ibrahim Bin Umar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Blessed and High Created the Names with the Letters without sounds, and with the words without speaking, and with the personality without a body, and with its resemblance without attributes, and with the colour without colouring. The lines are negated from Him<sup>azwj</sup>. Remote from Him<sup>azwj</sup> are the limitations, veiled from Him<sup>azwj</sup>. He<sup>azwj</sup> Senses every veiled whim without a veil.\nSo He<sup>azwj</sup> Made it to be a complete word upon four parts, along with that there is not one from these which is before the other. So He<sup>azwj</sup> Manifested three Names from these for the desperation of the creatures towards these, and Veiled one of these, and it is the Hidden Name, the Treasured. Thus, these are the Names which are Manifest. So the Manifested is Allah<sup>azwj</sup>, Blessed, and Exalted. And He<sup>azwj</sup> the Glorious, Subjected four elements to every Name from these Names. So that (makes it as) twelve elements. \nThen He<sup>azwj</sup> Created for every element from these, thirty Names, a deed linked to these. So He<sup>azwj</sup> is the Beneficent, the Merciful, the King, the Holy, the Creator, the Maker, the Fashioner, the Living, the Eternal. Neither does slumber seize Him<sup>azwj</sup> nor sleep. The Knower, the Aware, the Hearing, the Seeing, the Wise, the Mighty, the Compeller, the Supreme, the Exalted, the Magnificent, the Dominant, the Powerful, the Grantor of safety, the Securer, the Controller, the Maker, the Builder, the Initiator, the Lofty, the Majestic, the Benevolent, the Sustainer, the Life-Giver, the Causer of death, the Resurrector, the Inheritor. \nSo these are the Names, and whatever was from the Good Names until three hundred and sixty (360) Names are complete. So it is a link to these three Names, and these Names are (of) three elements, and One Name is Veiled, the Hidden, the Treasured by these three Names; and these are the Words of the Exalted <span class=\"ibTxt\">[17:110] Say: Call upon Allah or call upon the Beneficent; whichever (Name) you call upon, for Him are the best Names</span>’."}]}, {"index": 305, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:3:15:2", "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ وَ مُوسَى بْنِ عُمَرَ وَ الْحَسَنِ بْنِ عَلِيِّ بْنِ عُثْمَانَ عَنِ ابْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) هَلْ كَانَ اللَّهُ عَزَّ وَ جَلَّ عَارِفاً بِنَفْسِهِ قَبْلَ أَنْ يَخْلُقَ الْخَلْقَ قَالَ نَعَمْ \nقُلْتُ يَرَاهَا وَ يَسْمَعُهَا قَالَ مَا كَانَ مُحْتَاجاً إِلَى ذَلِكَ لِأَنَّهُ لَمْ يَكُنْ يَسْأَلُهَا وَ لَا يَطْلُبُ مِنْهَا هُوَ نَفْسُهُ وَ نَفْسُهُ هُوَ قُدْرَتُهُ نَافِذَةٌ فَلَيْسَ يَحْتَاجُ أَنْ يُسَمِّيَ نَفْسَهُ وَ لَكِنَّهُ اخْتَارَ لِنَفْسِهِ أَسْمَاءً لِغَيْرِهِ يَدْعُوهُ بِهَا لِأَنَّهُ إِذَا لَمْ يُدْعَ بِاسْمِهِ لَمْ يُعْرَفْ \nفَأَوَّلُ مَا اخْتَارَ لِنَفْسِهِ الْعَلِيُّ الْعَظِيمُ لِأَنَّهُ أَعْلَى الْأَشْيَاءِ كُلِّهَا فَمَعْنَاهُ اللَّهُ وَ اسْمُهُ الْعَلِيُّ الْعَظِيمُ هُوَ أَوَّلُ أَسْمَائِهِ عَلَا عَلَى كُلِّ شَيْ‏ءٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Idrees, from Al Husayn Bin Abdullah, from Muhammad Bin Abdullah, and Musa Bin Umar, and Al Hassan Bin Ali Bin Usman, from Ibn Sinan who said, \n‘I asked Abu Al-Hassan Al-Reza<sup>asws</sup>, ‘Was it that Allah<sup>azwj</sup> Mighty and Majestic Aware of Himself<sup>azwj</sup> before He<sup>azwj</sup> Created the creation?’ He<sup>asws</sup> said: ‘Yes’. \nI said, ‘He<sup style=\"font-weight: normal\">azwj</sup> Saw it (His<sup style=\"font-weight: normal\">azwj</sup> Self) and Heard (Himself<sup style=\"font-weight: normal\">azwj</sup>)?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘He<sup style=\"font-weight: normal\">azwj</sup> was not needy to that, because He<sup style=\"font-weight: normal\">azwj</sup> did not happen to ask it nor seek from it. He<sup style=\"font-weight: normal\">azwj</sup> is His<sup style=\"font-weight: normal\">azwj</sup> Self, and His<sup style=\"font-weight: normal\">azwj</sup> Self is He<sup style=\"font-weight: normal\">azwj</sup>. He<sup style=\"font-weight: normal\">azwj</sup> is His<sup style=\"font-weight: normal\">azwj</sup> Power Implemented. Thus, He<sup style=\"font-weight: normal\">azwj</sup> is not needy that He<sup style=\"font-weight: normal\">azwj</sup> Hears Himself<sup style=\"font-weight: normal\">azwj</sup>, but He<sup style=\"font-weight: normal\">azwj</sup> Chose Names for others to call Him<sup style=\"font-weight: normal\">azwj</sup> with these, because He<sup style=\"font-weight: normal\">azwj</sup>, when not called by His<sup style=\"font-weight: normal\">azwj</sup> Name, would not be recognised (by the creators). \nThus, the first of what He<sup style=\"font-weight: normal\">azwj</sup> Chose for Himself<sup style=\"font-weight: normal\">azwj</sup> was the Exalted, the Magnificent (الْعَلِيُّ الْعَظِيمُ) because He<sup style=\"font-weight: normal\">azwj</sup> is Loftier (than) the things, all of them. So its Meaning is Allah<sup style=\"font-weight: normal\">azwj</sup>, and His<sup style=\"font-weight: normal\">azwj</sup> Name is the Exalted, the Magnificent (الْعَلِيُّ الْعَظِيمُ). It is the first of His<sup style=\"font-weight: normal\">azwj</sup> Names, Loftier upon every thing’."}]}, {"index": 306, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:3:15:3", "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ قَالَ سَأَلْتُهُ عَنِ الِاسْمَ مَا هُوَ قَالَ صِفَةٌ لِمَوْصُوفٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by this chain, from Muhammad Bin Sinan who said, \n‘I asked him<sup>asws</sup> about the Name, ‘What is it?’ He<sup>asws</sup> said: ‘An attribute of the described’."}]}, {"index": 307, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:3:15:4", "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ عَلِيِّ بْنِ صَالِحٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ خَالِدِ بْنِ يَزِيدَ عَنْ عَبْدِ الْأَعْلَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اسْمُ اللَّهِ غَيْرُهُ وَ كُلُّ شَيْ‏ءٍ وَقَعَ عَلَيْهِ اسْمُ شَيْ‏ءٍ فَهُوَ مَخْلُوقٌ مَا خَلَا اللَّهَ \nفَأَمَّا مَا عَبَّرَتْهُ الْأَلْسُنُ أَوْ عَمِلَتِ الْأَيْدِي فَهُوَ مَخْلُوقٌ وَ اللَّهُ غَايَةٌ مِنْ غَايَاتِهِ وَ الْمُغَيَّا غَيْرُ الْغَايَةِ وَ الْغَايَةُ مَوْصُوفَةٌ وَ كُلُّ مَوْصُوفٍ مَصْنُوعٌ وَ صَانِعُ الْأَشْيَاءِ غَيْرُ مَوْصُوفٍ بِحَدٍّ مُسَمًّى لَمْ يَتَكَوَّنْ فَيُعْرَفَ كَيْنُونِيَّتُهُ بِصُنْعِ غَيْرِهِ وَ لَمْ يَتَنَاهَ إِلَى غَايَةٍ إِلَّا كَانَتْ غَيْرَهُ\nلَا يَزِلُّ مَنْ فَهِمَ هَذَا الْحُكْمَ أَبَداً وَ هُوَ التَّوْحِيدُ الْخَالِصُ فَارْعَوْهُ وَ صَدِّقُوهُ وَ تَفَهَّمُوهُ بِإِذْنِ اللَّهِ مَنْ زَعَمَ أَنَّهُ يَعْرِفُ اللَّهَ بِحِجَابٍ أَوْ بِصُورَةٍ أَوْ بِمِثَالٍ فَهُوَ مُشْرِكٌ لِأَنَّ حِجَابَهُ وَ مِثَالَهُ وَ صُورَتَهُ غَيْرُهُ وَ إِنَّمَا هُوَ وَاحِدٌ مُتَوَحِّدٌ فَكَيْفَ يُوَحِّدُهُ مَنْ زَعَمَ أَنَّهُ عَرَفَهُ بِغَيْرِهِ \nوَ إِنَّمَا عَرَفَ اللَّهَ مَنْ عَرَفَهُ بِاللَّهِ فَمَنْ لَمْ يَعْرِفْهُ بِهِ فَلَيْسَ يَعْرِفُهُ إِنَّمَا يَعْرِفُ غَيْرَهُ لَيْسَ بَيْنَ الْخَالِقِ وَ الْمَخْلُوقِ شَيْ‏ءٌ وَ اللَّهُ خَالِقُ الْأَشْيَاءِ لَا مِنْ شَيْ‏ءٍ كَانَ وَ اللَّهُ يُسَمَّى بِأَسْمَائِهِ وَ هُوَ غَيْرُ أَسْمَائِهِ وَ الْأَسْمَاءُ غَيْرُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Abu Abdullah, from Muhammad Bin Ismail, from one of his companions, from Bakr Bin Salih, from Ali Bin Salih, from Al Hassan Bin Muhammad Bin Khalid Bin Yazeed, from Abdul A’ala, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A Name of Allah<sup>azwj</sup> is other than Him<sup>azwj</sup>, and everything upon which a name occurs, is a thing, so it would be a creature, apart from Allah<sup>azwj</sup>. \nSo, as for what the tongues express, or the hands perform, so it is a creation, and Allah<sup>azwj</sup> is an end-point from His<sup>azwj</sup> (Created) end-points, and the end-point without the ending; and the end-point is an attribute, and every attribute is a creation, and the Creator of the things is other than the attribute by the limitation of the named. He<sup>azwj</sup> did not come into being so His<sup>azwj</sup> coming into being would be recognised by the creation of someone else, and one would not end up to an end-point except that it would be other than Him<sup>azwj</sup>.  \nDo not stumble from understanding this rule, and it is the pure <span class=\"iTxt\">Tawheed</span> (Oneness). Therefore, recognise it, and ratify it, and understand it by the Permission of Allah<sup>azwj</sup>. The one who claims that he recognises Allah<sup>azwj</sup> by veils, or by an image, or by a resemblance, so he is a Polytheists, because His<sup>azwj</sup> veil, and His<sup>azwj</sup> resemblance, and His<sup>azwj</sup> image, is other than Him<sup>azwj</sup>, and rather He<sup>azwj</sup> is One, with Oneness. So how can one consider Him<sup>azwj</sup> as One<sup>azwj</sup>, the one who claims that he is recognising Him<sup>azwj</sup> with something else?. \nAnd rather, he has recognised Allah<sup>azwj</sup>, the one who recognises him by Allah<sup>azwj</sup>. So the one who does not recognise Him<sup>azwj</sup> by Him<sup>azwj</sup>, so he has not recognised Him<sup>azwj</sup>, but he has recognised other than Him<sup>azwj</sup>. There isn’t between the Creator and the Created, a thing, and Allah<sup>azwj</sup> is the Creator of the things, not from a thing which was (beforehand). And Allah<sup>azwj</sup> is Named with His<sup>azwj</sup> Names, and He<sup>azwj</sup> is other than His<sup>azwj</sup> Names, and the Names are other than Him<sup>azwj</sup>’."}]}]}, "index": "al-kafi:1:3:15", "kind": "verse_list"}