{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:1:3", "titles": {"ar": "كِتَابُ التَّوْحِيدِ", "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"}}, {"indexed_titles": {"en": "Chapter 16"}, "path": "/books/al-kafi:1:3:16", "titles": {"ar": "بَابُ مَعَانِي الْأَسْمَاءِ وَ اشْتِقَاقِهَا", "en": "Chapter 16 – The Meaning of the Names and their derivatives"}}], "index": 39, "local_index": 16, "part_type": "Chapter", "path": "/books/al-kafi:1:3:16", "titles": {"ar": "بَابُ مَعَانِي الْأَسْمَاءِ وَ اشْتِقَاقِهَا", "en": "Chapter 16 – The Meaning of the Names and their derivatives"}, "verse_count": 12, "verse_start_index": 307, "verses": [{"index": 308, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ تَفْسِيرِ بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ قَالَ الْبَاءُ بَهَاءُ اللَّهِ وَ السِّينُ سَنَاءُ اللَّهِ وَ الْمِيمُ مَجْدُ اللَّهِ \nوَ رَوَى بَعْضُهُمْ الْمِيمُ مُلْكُ اللَّهِ وَ اللَّهُ إِلَهُ كُلِّ شَيْ‏ءٍ الرَّحْمَنُ بِجَمِيعِ خَلْقِهِ وَ الرَّحِيمُ بِالْمُؤْمِنِينَ خَاصَّةً .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, from Abdullah Bin Sinan who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the interpretation of ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful’. He<sup>asws</sup> said: ‘He<sup>asws</sup> said: ‘The ‘Ba’ is Beauty of Allah<sup>azwj</sup>, and the ‘Seen’ is the Sublimity of Allah<sup>azwj</sup>, and the ‘Meem’ is Glory of Allah<sup>azwj</sup>’.\nAnd some of them reported, ‘(He<sup>asws</sup> said): ‘The ‘Meem’ is Kingdom of Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> is God of everything, the Beneficent to the entirety of His<sup>azwj</sup> creatures, and being Merciful with the <span class=\"iTxt\">Momineen</span> in particular’."}]}, {"index": 309, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ هِشَامِ بْنِ الْحَكَمِ أَنَّهُ سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَسْمَاءِ اللَّهِ وَ اشْتِقَاقِهَا اللَّهُ مِمَّا هُوَ مُشْتَقٌّ فَقَالَ يَا هِشَامُ اللَّهُ مُشْتَقٌّ مِنْ إِلَهٍ وَ إِلَهٌ يَقْتَضِي مَأْلُوهاً وَ الِاسْمُ غَيْرُ الْمُسَمَّى فَمَنْ عَبَدَ الِاسْمَ دُونَ الْمَعْنَى فَقَدْ كَفَرَ وَ لَمْ يَعْبُدْ شَيْئاً وَ مَنْ عَبَدَ الِاسْمَ وَ الْمَعْنَى فَقَدْ أَشْرَكَ وَ عَبَدَ اثْنَيْنِ وَ مَنْ عَبَدَ الْمَعْنَى دُونَ الِاسْمِ فَذَاكَ التَّوْحِيدُ أَ فَهِمْتَ يَا هِشَامُ \nقَالَ قُلْتُ زِدْنِي قَالَ لِلَّهِ تِسْعَةٌ وَ تِسْعُونَ اسْماً فَلَوْ كَانَ الِاسْمُ هُوَ الْمُسَمَّى لَكَانَ كُلُّ اسْمٍ مِنْهَا إِلَهاً وَ لَكِنَّ اللَّهَ مَعْنًى يُدَلُّ عَلَيْهِ بِهَذِهِ الْأَسْمَاءِ وَ كُلُّهَا غَيْرُهُ يَا هِشَامُ الْخُبْزُ اسْمٌ لِلْمَأْكُولِ وَ الْمَاءُ اسْمٌ لِلْمَشْرُوبِ وَ الثَّوْبُ اسْمٌ لِلْمَلْبُوسِ وَ النَّارُ اسْمٌ لِلْمُحْرِقِ أَ فَهِمْتَ يَا هِشَامُ فَهْماً تَدْفَعُ بِهِ وَ تُنَاضِلُ بِهِ أَعْدَاءَنَا الْمُتَّخِذِينَ مَعَ اللَّهِ عَزَّ وَ جَلَّ غَيْرَهُ قُلْتُ نَعَمْ \nفَقَالَ نَفَعَكَ اللَّهُ بِهِ وَ ثَبَّتَكَ يَا هِشَامُ \nقَالَ فَوَ اللَّهِ مَا قَهَرَنِي أَحَدٌ فِي التَّوْحِيدِ حَتَّى قُمْتُ مَقَامِي هَذَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nazar Bin Suweyd, from Hisham Bin Al Hakam, that, \n‘He asked Abu Abdullah<sup>asws</sup> about the Names of Allah<sup>azwj</sup> and their derivatives of Allah<sup>azwj</sup> from what He<sup>azwj</sup> is derived. So he<sup>asws</sup> said: ‘O Hisham! ‘Allah’ is derived from ‘God’, and God requires its worshipper, and the name is other than the named. So the one who worships the Name besides the Meaning, so he has blasphemed and has not worshipped anything; and the one who worships the Name and the Meaning, so he has associated (committed Shirk) and worship two; and the one who worships the Meaning besides the Name, so that is the <span class=\"iTxt\">Tawheed</span>. Do you understand, O Hisham?’\nHe (Hisham) said, ‘I said, ‘Increase for me’. He<sup>asws</sup> said: ‘For Allah<sup>azwj</sup> there are ninety nine Names. So if it was such that the Name was the Named, then it would be so that every Name from these would be a God. But, Allah<sup>azwj</sup> is the Meaning, these Names indicate upon, and all of these are other than Him<sup>azwj</sup>. O Hisham! The bread is a name of the food, and the water is a name of the drink, and the cloth is a name of the garment, and the fire is a name of the incinerator. Do you understand, O Hisham? (It is) an understanding you can repulse and fight our<sup>asws</sup> enemies with and the ones who taking others along with Allah<sup>azwj</sup> Majestic and Mighty’.  I said, ‘Yes’. \nHe (Hisham) said, ‘So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Benefit you with it and Affirm you, O Hisham!’. \nHisham said, ‘So, by Allah<sup>azwj</sup>! No one was able to subdue me regarding the <span class=\"iTxt\">Tawheed</span> (Oneness) until I rose to this status of mine’."}]}, {"index": 310, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ أَبِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) قَالَ سُئِلَ عَنْ مَعْنَى اللَّهِ فَقَالَ اسْتَوْلَى عَلَى مَا دَقَّ وَ جَلَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, \n(It has been narrated) from Abu Al-Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about the Meaning of ‘Allah’. So he<sup>asws</sup> said: ‘The One Who Conquers upon whatever is slight and majestic’."}]}, {"index": 311, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:4", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ الْعَبَّاسِ بْنِ هِلَالٍ قَالَ سَأَلْتُ الرِّضَا ( عليه السلام ) عَنْ قَوْلِ اللَّهِ اللَّهُ نُورُ السَّماواتِ وَ الْأَرْضِ فَقَالَ هَادٍ لِأَهْلِ السَّمَاءِ وَ هَادٍ لِأَهْلِ الْأَرْضِ \nوَ فِي رِوَايَةِ الْبَرْقِيِّ هُدَى مَنْ فِي السَّمَاءِ وَ هُدَى مَنْ فِي الْأَرْضِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from Al Abbas Bin Hilal who said, \n‘I asked Al-Reza<sup>asws</sup> about the Words of Allah<sup>azwj</sup> <span class=\"ibTxt\">[24:35] Allah is Light of the skies and the earth</span>. So he<sup>asws</sup> said: ‘A Guide for the inhabitants of the sky and a Guide for the inhabitants of the earth’. \nAnd in a report of Al-Barqy, ‘(He<sup>asws</sup> said): ‘A Guidance for the ones in the sky and a Guidance for the ones in the earth’."}]}, {"index": 312, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:5", "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ فُضَيْلِ بْنِ عُثْمَانَ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ هُوَ الْأَوَّلُ وَ الْآخِرُ وَ قُلْتُ أَمَّا الْأَوَّلُ فَقَدْ عَرَفْنَاهُ وَ أَمَّا الْآخِرُ فَبَيِّنْ لَنَا تَفْسِيرَهُ \nفَقَالَ إِنَّهُ لَيْسَ شَيْ‏ءٌ إِلَّا يَبِيدُ أَوْ يَتَغَيَّرُ أَوْ يَدْخُلُهُ التَّغَيُّرُ وَ الزَّوَالُ أَوْ يَنْتَقِلُ مِنْ لَوْنٍ إِلَى لَوْنٍ وَ مِنْ هَيْئَةٍ إِلَى هَيْئَةٍ وَ مِنْ صِفَةٍ إِلَى صِفَةٍ وَ مِنْ زِيَادَةٍ إِلَى نُقْصَانٍ وَ مِنْ نُقْصَانٍ إِلَى زِيَادَةٍ إِلَّا رَبَّ الْعَالَمِينَ فَإِنَّهُ لَمْ يَزَلْ وَ لَا يَزَالُ بِحَالَةٍ وَاحِدَةٍ هُوَ الْأَوَّلُ قَبْلَ كُلِّ شَيْ‏ءٍ وَ هُوَ الْآخِرُ عَلَى مَا لَمْ يَزَلْ \nوَ لَا تَخْتَلِفُ عَلَيْهِ الصِّفَاتُ وَ الْأَسْمَاءُ كَمَا تَخْتَلِفُ عَلَى غَيْرِهِ مِثْلُ الْإِنْسَانِ الَّذِي يَكُونُ تُرَاباً مَرَّةً وَ مَرَّةً لَحْماً وَ دَماً وَ مَرَّةً رُفَاتاً وَ رَمِيماً وَ كَالْبُسْرِ الَّذِي يَكُونُ مَرَّةً بَلَحاً وَ مَرَّةً بُسْراً وَ مَرَّةً رُطَباً وَ مَرَّةً تَمْراً فَتَتَبَدَّلُ عَلَيْهِ الْأَسْمَاءُ وَ الصِّفَاتُ وَ اللَّهُ جَلَّ وَ عَزَّ بِخِلَافِ ذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Fuzayl Bin Usman, from Ibn Abu Yafour who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[57:3] He is the First and the Last</span>, and I said, ‘As for ‘the First’, so we recognise it, and as for ‘the Last’, so clarify its interpretation for us’. \nSo he<sup>asws</sup> said: ‘There is nothing except that it perishes, or changes, or there enters into it the change and the decline, or transfers from a colour to a colour, and from a form to a form, and from an attribute to an attribute, and from an increase to a decrease, and from a decrease to an increase, except for the Lord<sup>azwj</sup> of the worlds. So He<sup>azwj</sup> has never ceased to be or will cease to be in one state. He<sup>azwj</sup> was first before everything and He<sup>azwj</sup> would be Last for as long as eternity. \nThe attributes and the Names are not different upon Him<sup>azwj</sup> just as they would be upon others, like the human being who happened to be dust one time, and flesh and blood at one time, and one time would be decaying and bones, and like the date which happens to be raw, and one time ripe, and one time mature, and one time dried up. Thus, the names and the attributes change upon it and Allah<sup>azwj</sup> Majestic and Mighty is opposite to that’."}]}, {"index": 313, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ عَنْ مَيْمُونٍ الْبَانِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ قَدْ سُئِلَ عَنِ الْأَوَّلِ وَ الْآخِرِ فَقَالَ الْأَوَّلُ لَا عَنْ أَوَّلٍ قَبْلَهُ وَ لَا عَنْ بَدْءٍ سَبَقَهُ وَ الْآخِرُ لَا عَنْ نِهَايَةٍ كَمَا يُعْقَلُ مِنْ صِفَةِ الْمَخْلُوقِينَ وَ لَكِنْ قَدِيمٌ أَوَّلٌ آخِرٌ لَمْ يَزَلْ وَ لَا يَزُولُ بِلَا بَدْءٍ وَ لَا نِهَايَةٍ لَا يَقَعُ عَلَيْهِ الْحُدُوثُ وَ لَا يَحُولُ مِنْ حَالٍ إِلَى حَالٍ خَالِقُ كُلِّ شَيْ‏ءٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Muhammad Bin Hakeym, from Maymoun Alban who said, \n‘I heard Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> had been asked about the First and the Last. So he<sup>asws</sup> said: ‘The First is neither from a first before Him<sup>azwj</sup> nor from a beginning preceding Him<sup>azwj</sup>; and the Last is not from an end-point just as it is said of an attribute of the creatures, but, He<sup>azwj</sup> is eternally First, Last, not from a non-existence nor will be non-existent, without a beginning and without an end. The occurrences do not befall Him<sup>azwj</sup>, nor does He<sup>azwj</sup> Change from a state to a state. (He<sup>azwj</sup>) is the Creator of all things’."}]}, {"index": 314, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:7", "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ رَفَعَهُ إِلَى أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) فَسَأَلَهُ رَجُلٌ فَقَالَ أَخْبِرْنِي عَنِ الرَّبِّ تَبَارَكَ وَ تَعَالَى لَهُ أَسْمَاءٌ وَ صِفَاتٌ فِي كِتَابِهِ وَ أَسْمَاؤُهُ وَ صِفَاتُهُ هِيَ هُوَ\nفَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ لِهَذَا الْكَلَامِ وَجْهَيْنِ إِنْ كُنْتَ تَقُولُ هِيَ هُوَ أَيْ إِنَّهُ ذُو عَدَدٍ وَ كَثْرَةٍ فَتَعَالَى اللَّهُ عَنْ ذَلِكَ وَ إِنْ كُنْتَ تَقُولُ هَذِهِ الصِّفَاتُ وَ الْأَسْمَاءُ لَمْ تَزَلْ فَإِنَّ لَمْ تَزَلْ مُحْتَمِلٌ مَعْنَيَيْنِ فَإِنْ قُلْتَ لَمْ تَزَلْ عِنْدَهُ فِي عِلْمِهِ وَ هُوَ مُسْتَحِقُّهَا فَنَعَمْ وَ إِنْ كُنْتَ تَقُولُ لَمْ يَزَلْ تَصْوِيرُهَا وَ هِجَاؤُهَا وَ تَقْطِيعُ حُرُوفِهَا فَمَعَاذَ اللَّهِ أَنْ يَكُونَ مَعَهُ شَيْ‏ءٌ غَيْرُهُ  \nبَلْ كَانَ اللَّهُ وَ لَا خَلْقَ ثُمَّ خَلَقَهَا وَسِيلَةً بَيْنَهُ وَ بَيْنَ خَلْقِهِ يَتَضَرَّعُونَ بِهَا إِلَيْهِ وَ يَعْبُدُونَهُ وَ هِيَ ذِكْرُهُ وَ كَانَ اللَّهُ وَ لَا ذِكْرَ وَ الْمَذْكُورُ بِالذِّكْرِ هُوَ اللَّهُ الْقَدِيمُ الَّذِي لَمْ يَزَلْ وَ الْأَسْمَاءُ وَ الصِّفَاتُ مَخْلُوقَاتٌ وَ الْمَعَانِي وَ الْمَعْنِيُّ بِهَا هُوَ اللَّهُ الَّذِي لَا يَلِيقُ بِهِ الِاخْتِلَافُ وَ لَا الِائْتِلَافُ وَ إِنَّمَا يَخْتَلِفُ وَ يَأْتَلِفُ الْمُتَجَزِّئُ \nفَلَا يُقَالُ اللَّهُ مُؤْتَلِفٌ وَ لَا اللَّهُ قَلِيلٌ وَ لَا كَثِيرٌ وَ لَكِنَّهُ الْقَدِيمُ فِي ذَاتِهِ لِأَنَّ مَا سِوَى الْوَاحِدِ مُتَجَزِّئٌ وَ اللَّهُ وَاحِدٌ لَا مُتَجَزِّئٌ وَ لَا مُتَوَهَّمٌ بِالْقِلَّةِ وَ الْكَثْرَةِ وَ كُلُّ مُتَجَزِّئٍ أَوْ مُتَوَهَّمٍ بِالْقِلَّةِ وَ الْكَثْرَةِ فَهُوَ مَخْلُوقٌ دَالُّ عَلَى خَالِقٍ لَهُ\nفَقَوْلُكَ إِنَّ اللَّهَ قَدِيرٌ خَبَّرْتَ أَنَّهُ لَا يُعْجِزُهُ شَيْ‏ءٌ فَنَفَيْتَ بِالْكَلِمَةِ الْعَجْزَ وَ جَعَلْتَ الْعَجْزَ سِوَاهُ وَ كَذَلِكَ قَوْلُكَ عَالِمٌ إِنَّمَا نَفَيْتَ بِالْكَلِمَةِ الْجَهْلَ وَ جَعَلْتَ الْجَهْلَ سِوَاهُ وَ إِذَا أَفْنَى اللَّهُ الْأَشْيَاءَ أَفْنَى الصُّورَةَ وَ الْهِجَاءَ وَ التَّقْطِيعَ وَ لَا يَزَالُ مَنْ لَمْ يَزَلْ عَالِماً\nفَقَالَ الرَّجُلُ فَكَيْفَ سَمَّيْنَا رَبَّنَا سَمِيعاً فَقَالَ لِأَنَّهُ لَا يَخْفَى عَلَيْهِ مَا يُدْرَكُ بِالْأَسْمَاعِ وَ لَمْ نَصِفْهُ بِالسَّمْعِ الْمَعْقُولِ فِي الرَّأْسِ وَ كَذَلِكَ سَمَّيْنَاهُ بَصِيراً لِأَنَّهُ لَا يَخْفَى عَلَيْهِ مَا يُدْرَكُ بِالْأَبْصَارِ مِنْ لَوْنٍ أَوْ شَخْصٍ أَوْ غَيْرِ ذَلِكَ وَ لَمْ نَصِفْهُ بِبَصَرِ لَحْظَةِ الْعَيْنِ \nوَ كَذَلِكَ سَمَّيْنَاهُ لَطِيفاً لِعِلْمِهِ بِالشَّيْ‏ءِ اللَّطِيفِ مِثْلِ الْبَعُوضَةِ وَ أَخْفَى مِنْ ذَلِكَ\nوَ مَوْضِعِ النُّشُوءِ مِنْهَا وَ الْعَقْلِ وَ الشَّهْوَةِ لِلسَّفَادِ وَ الْحَدَبِ عَلَى نَسْلِهَا وَ إِقَامِ بَعْضِهَا عَلَى بَعْضٍ وَ نَقْلِهَا الطَّعَامَ وَ الشَّرَابَ إِلَى أَوْلَادِهَا فِي الْجِبَالِ وَ الْمَفَاوِزِ وَ الْأَوْدِيَةِ وَ الْقِفَارِ فَعَلِمْنَا أَنَّ خَالِقَهَا لَطِيفٌ بِلَا كَيْفٍ وَ إِنَّمَا الْكَيْفِيَّةُ لِلْمَخْلُوقِ الْمُكَيَّفِ \nوَ كَذَلِكَ سَمَّيْنَا رَبَّنَا قَوِيّاً لَا بِقُوَّةِ الْبَطْشِ الْمَعْرُوفِ مِنَ الْمَخْلُوقِ وَ لَوْ كَانَتْ قُوَّتُهُ قُوَّةَ الْبَطْشِ الْمَعْرُوفِ مِنَ الْمَخْلُوقِ لَوَقَعَ التَّشْبِيهُ وَ لَاحْتَمَلَ الزِّيَادَةَ وَ مَا احْتَمَلَ الزِّيَادَةَ احْتَمَلَ النُّقْصَانَ وَ مَا كَانَ نَاقِصاً كَانَ غَيْرَ قَدِيمٍ وَ مَا كَانَ غَيْرَ قَدِيمٍ كَانَ عَاجِزاً \nفَرَبُّنَا تَبَارَكَ وَ تَعَالَى لَا شِبْهَ لَهُ وَ لَا ضِدَّ وَ لَا نِدَّ وَ لَا كَيْفَ وَ لَا نِهَايَةَ وَ لَا تَبْصَارَ بَصَرٍ وَ مُحَرَّمٌ عَلَى الْقُلُوبِ أَنْ تُمَثِّلَهُ وَ عَلَى الْأَوْهَامِ أَنْ تَحُدَّهُ وَ عَلَى الضَّمَائِرِ أَنْ تُكَوِّنَهُ جَلَّ وَ عَزَّ عَنْ أَدَاةِ خَلْقِهِ وَ سِمَاتِ بَرِيَّتِهِ وَ تَعَالَى عَنْ ذَلِكَ عُلُوّاً كَبِيراً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Abu Abdullah, raising it to Abu Hashim Al Ja’fary who said, \n‘I was in the presence of Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, so a man asked him<sup>asws</sup> saying, ‘Inform me about the Lord<sup>azwj</sup>, Blessed and High. There are Names and Attributes for Him<sup>azwj</sup> in His<sup>azwj</sup> Book, and His<sup>azwj</sup> Names and His<sup>azwj</sup> Attributes, are these Him<sup>azwj</sup>?’\nSo Abu Ja’far<sup>asws</sup> said: ‘For this speech, there are two aspects. If you are saying, these (Names) are Him<sup>azwj</sup>, i.e., He<sup>azwj</sup> is with a number and multiplicity, so Exalted is Allah<sup>azwj</sup> from that; and if you are saying these are Attributes, and the Names would never cease to be, so ‘never cease to be’ carries two meaning. So if you say, ‘They will not cease to be in His<sup>azwj</sup> Presence in His<sup>azwj</sup> Knowledge and He<sup>azwj</sup> is Rightful, so yes; but if you are saying these will not cease to be, their images, and their spellings, and their syllables, and their letters, then we<sup>asws</sup> seek Refuge with Allah<sup>azwj</sup> that there happens to be with Him<sup>azwj</sup>, something other than Him<sup>azwj</sup>.\nBut, Allah<sup>azwj</sup> was and had not Created. Then He<sup>azwj</sup> Created these as a means between Him<sup>azwj</sup> and His<sup>azwj</sup> creatures - being desperately (dependant) upon Him<sup>azwj</sup>, and they are worshipping Him<sup>azwj</sup>, and these are His<sup>azwj</sup> Mention. And Allah<sup>azwj</sup> was and there was no Mention, and the Mentioned One<sup>azwj</sup> is with the Mention. He<sup>azwj</sup> is Allah<sup>azwj</sup>, the eternal Who does not cease to be; and the Names and the Attributes are creations, and the Meaning Meant by these, He<sup>azwj</sup> is Allah<sup>azwj</sup> with Whom neither befits the variances nor the combinations, and rather (that) variates and combines, (which is) fragmented.\nSo Allah<sup>azwj</sup> will not be said to be combined, nor Allah<sup>azwj</sup> as little nor more, but the eternality is regarding His<sup>azwj</sup> Self, because whatever is besides the One<sup>azwj</sup>, is a fragment, and Allah<sup>azwj</sup> is the One<sup>azwj</sup>, not fragmented, nor can He<sup>azwj</sup> be imagined with the less and the more, and everything which is fragmented or imagined with the less and the more, so it is a creation evidencing upon its Creator. \nSo, your words that ‘Allah<sup>azwj</sup> is Powerful’, informs you that He<sup>azwj</sup> is not frustrated by anything. Thus you, negate the frustration by the speech and make the frustration to be other than Him<sup>azwj</sup>. And similar to that are your words, ‘Knower’. But rather the ignorance is negated by the speech, and the ignorance is made to be besides Him<sup>azwj</sup>. And when Allah<sup>azwj</sup> Annihilates the things, the image, and the spelling, and the syllables get annihilated, and He<sup>azwj</sup> does not cease to be, the One<sup>azwj</sup> who will not cease to be a Knower’.\nSo the man said, ‘So how come we are Naming our Lord<sup>azwj</sup> as ‘All-Hearing’?’ So he<sup>asws</sup> said: ‘Because it is not Hidden upon Him<sup>azwj</sup> whatever is being comprehended by the ears, and we<sup>asws</sup> do not describe Him<sup>azwj</sup> with the Hearing situated in the head. Like that, we<sup>asws</sup> Name Him<sup>azwj</sup> as ‘All-Seeing’, because it is not Hidden upon Him<sup>azwj</sup> whatever is comprehended by the visions, from the colour or persons or other than that; and we<sup>asws</sup> do not describe Him<sup>azwj</sup> with the vision of the movement of the eye. \nAnd similar to that we<sup>asws</sup> Name Him<sup>azwj</sup> as the ‘Aware of subtleties’ due to His<sup>azwj</sup> Knowledge of the subtle things, like the mosquito, and (things) more concealed than that.\nAnd the subject of the growth is from these, and the intelligence, and the desires for the marital relations, and the leniency upon their offspring, and their watching out for each other, and their transference of the food and the drink to their children in the mountains, and wilderness, and the valleys, and the wastelands. Thus, we know that their Creator is Aware of the subtleties without a ‘how’, and rather the ‘how’ is for the creations, the ones subject to ‘how’. \nAnd similar to that, we Name our Lord<sup>azwj</sup> as Strong, not due to the strength of the violence well-known from the creatures. And if it was so that His<sup>azwj</sup> Strength was the strength of the well-known violence from the creatures, a resemblance would occur for Him<sup>azwj</sup> and an increase would be tolerated. And whatever tolerates the increase, would tolerate the decrease; and whatever was deficient would be without eternity; and whatever was without eternity would be frustrated. \nSo our Lord<sup>azwj</sup>, Blessed and High, there is neither a resemblance for Him<sup>azwj</sup>, nor an opposite, nor a match, nor a ‘how’, nor an end-point, nor can be envisaged by visions. And it is Prohibited unto the hearts to conceive His<sup>azwj</sup> resemblance, and upon the imaginations that they limit Him<sup>azwj</sup>, and upon the consciences that they form Him<sup>azwj</sup>. Majestic and Mighty is He<sup>azwj</sup> from the instruments of His<sup>azwj</sup> creatures, and features of His<sup>azwj</sup> Created beings; and Exalted is He<sup>azwj</sup> from that, Loftier, Greater’."}]}, {"index": 315, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:8", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَجُلٌ عِنْدَهُ اللَّهُ أَكْبَرُ فَقَالَ اللَّهُ أَكْبَرُ مِنْ أَيِّ شَيْ‏ءٍ فَقَالَ مِنْ كُلِّ شَيْ‏ءٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) حَدَّدْتَهُ فَقَالَ الرَّجُلُ كَيْفَ أَقُولُ قَالَ قُلْ اللَّهُ أَكْبَرُ مِنْ أَنْ يُوصَفَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ibn Mahboub, from the one who mentioned it, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man in his<sup>asws</sup> presence said, ‘Allah<sup>azwj</sup> is the Greatest!’. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is Greater than which thing?’ So he said, ‘From everything’. So Abu Abdullah<sup>asws</sup> said: ‘You have limited Him<sup>azwj</sup>’. So the man said, ‘How should I be saying it?’ He<sup>asws</sup> said: ‘Say, ‘Allah<sup>azwj</sup> is Greatest, beyond description’’."}]}, {"index": 316, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:9", "text": "وَ رَوَاهُ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مَرْوَكِ بْنِ عُبَيْدٍ عَنْ جُمَيْعِ بْنِ عُمَيْرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَيُّ شَيْ‏ءٍ اللَّهُ أَكْبَرُ فَقُلْتُ اللَّهُ أَكْبَرُ مِنْ كُلِّ شَيْ‏ءٍ فَقَالَ وَ كَانَ ثَمَّ شَيْ‏ءٌ فَيَكُونُ أَكْبَرَ مِنْهُ فَقُلْتُ وَ مَا هُوَ قَالَ اللَّهُ أَكْبَرُ مِنْ أَنْ يُوصَفَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And it is reported by Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Marwak Bin Ubeyd, from Jumie Bin Umeyr who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘Which thing is Allah<sup>azwj</sup> Greater than?’ So I said, ‘Allah<sup>azwj</sup> is Greater than everything’. So he<sup>asws</sup> said: ‘He<sup>azwj</sup> was, then there was a thing, so He<sup>azwj</sup> came to be Greater than it?’ So I said, ‘And what is it (which is correct to say)?’ He<sup>asws</sup>: ‘Allah<sup>azwj</sup> is Greatest, beyond description’."}]}, {"index": 317, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:10", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ سُبْحَانَ اللَّهِ فَقَالَ أَنَفَةٌ لِلَّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Yunus, from Hisham Bin Al Hakam who said, \n‘I asked Abu Abdullah<sup>asws</sup> about ‘Glorious is Allah<sup>azwj</sup>’’. So he<sup>asws</sup> said: ‘Respect of Allah<sup>azwj</sup>’."}]}, {"index": 318, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:11", "text": "أَحْمَدُ بْنُ مِهْرَانَ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ الْحَسَنِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ سُلَيْمَانَ مَوْلَى طِرْبَالٍ عَنْ هِشَامٍ الْجَوَالِيقِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ سُبْحانَ اللَّهِ مَا يُعْنَى بِهِ قَالَ تَنْزِيهُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Mihran, from Abdul Azeem Bin Abdullah Al Hasany, from Ali Bin Asbat, from Suleyman, a slave of Tirbal, from Hisham Al Jawaliqy who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[23:91] Glory be to Allah</span>, what is the Meaning of it?’ He<sup>asws</sup> said: ‘His<sup>azwj</sup> Transcendence’."}]}, {"index": 319, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:1:3:16:12", "text": "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنْ أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ الثَّانِيَ ( عليه السلام ) مَا مَعْنَى الْوَاحِدِ فَقَالَ إِجْمَاعُ الْأَلْسُنِ عَلَيْهِ بِالْوَحْدَانِيَّةِ كَقَوْلِهِ تَعَالَى وَ لَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, altogether from Abu Hashim Al Ja’fary who said, \n‘I asked Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, ‘What is the meaning of ‘The One’?’ So he<sup>asws</sup> said: ‘The consensus of the tongues upon Him<sup>azwj</sup> with the Oneness like His<sup>azwj</sup> Words, the Exalted <span class=\"ibTxt\">[43:87] And if you should ask them who Created them, they would certainly say: Allah</span>’."}]}]}, "index": "al-kafi:1:3:16", "kind": "verse_list"}