{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:1:3:17",
        "titles": {
          "ar": "باب آخَرُ وَ هُوَ مِنَ الْبَابِ الْأَوَّلِ إِلَّا أَنَّ فِيهِ زِيَادَةً وَ هُوَ الْفَرْقُ مَا بَيْنَ الْمَعَانِي الَّتِي تَحْتَ أَسْمَاءِ اللَّهِ وَ أَسْمَاءِ الْمَخْلُوقِينَ",
          "en": "Chapter 17 – Another Chapter and it is from the first, except that in it is an addition, and it is the difference between the meaning which is beneath the Names of Allah<sup>azwj</sup> and the names of the creatures"
        }
      }
    ],
    "index": 40,
    "local_index": 17,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:1:3:18",
        "titles": {
          "ar": "بَابُ تَأْوِيلِ الصَّمَدِ",
          "en": "Chapter 18 – Explanation of Al-Samad"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:1:3:16",
        "titles": {
          "ar": "بَابُ مَعَانِي الْأَسْمَاءِ وَ اشْتِقَاقِهَا",
          "en": "Chapter 16 – The Meaning of the Names and their derivatives"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:17",
    "titles": {
      "ar": "باب آخَرُ وَ هُوَ مِنَ الْبَابِ الْأَوَّلِ إِلَّا أَنَّ فِيهِ زِيَادَةً وَ هُوَ الْفَرْقُ مَا بَيْنَ الْمَعَانِي الَّتِي تَحْتَ أَسْمَاءِ اللَّهِ وَ أَسْمَاءِ الْمَخْلُوقِينَ",
      "en": "Chapter 17 – Another Chapter and it is from the first, except that in it is an addition, and it is the difference between the meaning which is beneath the Names of Allah<sup>azwj</sup> and the names of the creatures"
    },
    "verse_count": 2,
    "verse_start_index": 319,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 320,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/349",
              "text": "الْمُخْتَارِ بْنِ مُحَمَّدِ بْنِ الْمُخْتَارِ الْهَمْدَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/348",
              "text": "عَبْدِ اللَّهِ بْنِ الْحَسَنِ الْعَلَوِيِّ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/428",
              "text": "الْفَتْحِ بْنِ يَزِيدَ الْجُرْجَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/351",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْمُخْتَارِ بْنِ مُحَمَّدِ بْنِ الْمُخْتَارِ الْهَمْدَانِيِّ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ الْعَلَوِيِّ جَمِيعاً عَنِ الْفَتْحِ بْنِ يَزِيدَ الْجُرْجَانِيِّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:17:1",
        "text": [
          " سَمِعْتُهُ يَقُولُ وَ هُوَ اللَّطِيفُ الْخَبِيرُ السَّمِيعُ الْبَصِيرُ الْوَاحِدُ الْأَحَدُ الصَّمَدُ لَمْ يَلِدْ وَ لَمْ يُولَدْ وَ لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ لَوْ كَانَ كَمَا يَقُولُ الْمُشَبِّهَةُ لَمْ يُعْرَفِ الْخَالِقُ مِنَ الْمَخْلُوقِ وَ لَا الْمُنْشِئُ مِنَ الْمُنْشَإِ لَكِنَّهُ الْمُنْشِئُ فَرْقٌ بَيْنَ مَنْ جَسَّمَهُ وَ صَوَّرَهُ وَ أَنْشَأَهُ إِذْ كَانَ لَا يُشْبِهُهُ شَيْ‏ءٌ وَ لَا يُشْبِهُ هُوَ شَيْئاً",
          "قُلْتُ أَجَلْ جَعَلَنِيَ اللَّهُ فِدَاكَ لَكِنَّكَ قُلْتَ الْأَحَدُ الصَّمَدُ وَ قُلْتَ لَا يُشْبِهُهُ شَيْ‏ءٌ وَ اللَّهُ وَاحِدٌ وَ الْإِنْسَانُ وَاحِدٌ أَ لَيْسَ قَدْ تَشَابَهَتِ الْوَحْدَانِيَّةُ",
          "قَالَ يَا فَتْحُ أَحَلْتَ ثَبَّتَكَ اللَّهُ إِنَّمَا التَّشْبِيهُ فِي الْمَعَانِي فَأَمَّا فِي الْأَسْمَاءِ فَهِيَ وَاحِدَةٌ وَ هِيَ دَالَّةٌ عَلَى الْمُسَمَّى وَ ذَلِكَ أَنَّ الْإِنْسَانَ وَ إِنْ قِيلَ وَاحِدٌ فَإِنَّهُ يُخْبَرُ أَنَّهُ جُثَّةٌ وَاحِدَةٌ وَ لَيْسَ بِاثْنَيْنِ وَ الْإِنْسَانُ نَفْسُهُ لَيْسَ بِوَاحِدٍ لِأَنَّ أَعْضَاءَهُ مُخْتَلِفَةٌ وَ أَلْوَانَهُ مُخْتَلِفَةٌ وَ مَنْ أَلْوَانُهُ مُخْتَلِفَةٌ غَيْرُ وَاحِدٍ وَ هُوَ أَجْزَاءٌ مُجَزَّاةٌ لَيْسَتْ بِسَوَاءٍ دَمُهُ غَيْرُ لَحْمِهِ وَ لَحْمُهُ غَيْرُ دَمِهِ وَ عَصَبُهُ غَيْرُ عُرُوقِهِ وَ شَعْرُهُ غَيْرُ بَشَرِهِ وَ سَوَادُهُ غَيْرُ بَيَاضِهِ وَ كَذَلِكَ سَائِرُ جَمِيعِ الْخَلْقِ",
          "فَالْإِنْسَانُ وَاحِدٌ فِي الِاسْمِ وَ لَا وَاحِدٌ فِي الْمَعْنَى وَ اللَّهُ جَلَّ جَلَالُهُ هُوَ وَاحِدٌ لَا وَاحِدَ غَيْرُهُ لَا اخْتِلَافَ فِيهِ وَ لَا تَفَاوُتَ وَ لَا زِيَادَةَ وَ لَا نُقْصَانَ فَأَمَّا الْإِنْسَانُ الْمَخْلُوقُ الْمَصْنُوعُ الْمُؤَلَّفُ مِنْ أَجْزَاءٍ مُخْتَلِفَةٍ وَ جَوَاهِرَ شَتَّى غَيْرَ أَنَّهُ بِالِاجْتِمَاعِ شَيْ‏ءٌ وَاحِدٌ",
          "قُلْتُ جُعِلْتُ فِدَاكَ فَرَّجْتَ عَنِّي فَرَّجَ اللَّهُ عَنْكَ فَقَوْلَكَ اللَّطِيفُ الْخَبِيرُ فَسِّرْهُ لِي كَمَا فَسَّرْتَ الْوَاحِدَ فَإِنِّي أَعْلَمُ أَنَّ لُطْفَهُ عَلَى خِلَافِ لُطْفِ خَلْقِهِ لِلْفَصْلِ غَيْرَ أَنِّي أُحِبُّ أَنْ تَشْرَحَ ذَلِكَ لِي",
          "فَقَالَ يَا فَتْحُ إِنَّمَا قُلْنَا اللَّطِيفُ لِلْخَلْقِ اللَّطِيفِ وَ لِعِلْمِهِ بِالشَّيْ‏ءِ اللَّطِيفِ أَ وَ لَا تَرَى وَفَّقَكَ اللَّهُ وَ ثَبَّتَكَ إِلَى أَثَرِ صُنْعِهِ فِي النَّبَاتِ اللَّطِيفِ وَ غَيْرِ اللَّطِيفِ وَ مِنَ الْخَلْقِ اللَّطِيفِ وَ مِنَ الْحَيَوَانِ الصِّغَارِ وَ مِنَ الْبَعُوضِ وَ الْجِرْجِسِ وَ مَا هُوَ أَصْغَرُ مِنْهَا مَا لَا يَكَادُ تَسْتَبِينُهُ الْعُيُونُ بَلْ لَا يَكَادُ يُسْتَبَانُ لِصِغَرِهِ الذَّكَرُ مِنَ الْأُنْثَى وَ الْحَدَثُ الْمَوْلُودُ مِنَ الْقَدِيمِ",
          "فَلَمَّا رَأَيْنَا صِغَرَ ذَلِكَ فِي لُطْفِهِ وَ اهْتِدَاءَهُ لِلسَّفَادِ وَ الْهَرَبَ مِنَ الْمَوْتِ وَ الْجَمْعَ لِمَا يُصْلِحُهُ وَ مَا فِي لُجَجِ الْبِحَارِ وَ مَا فِي لِحَاءِ الْأَشْجَارِ وَ الْمَفَاوِزِ وَ الْقِفَارِ وَ إِفْهَامَ بَعْضِهَا عَنْ بَعْضٍ مَنْطِقَهَا وَ مَا يَفْهَمُ بِهِ أَوْلَادُهَا عَنْهَا وَ نَقْلَهَا الْغِذَاءَ إِلَيْهَا ",
          "ثُمَّ تَأْلِيفَ أَلْوَانِهَا حُمْرَةٍ مَعَ صُفْرَةٍ وَ بَيَاضٍ مَعَ حُمْرَةٍ وَ أَنَّهُ مَا لَا تَكَادُ عُيُونُنَا تَسْتَبِينُهُ لِدَمَامَةِ خَلْقِهَا لَا تَرَاهُ عُيُونُنَا وَ لَا تَلْمِسُهُ أَيْدِينَا عَلِمْنَا أَنَّ خَالِقَ هَذَا الْخَلْقِ لَطِيفٌ لَطُفَ بِخَلْقِ مَا سَمَّيْنَاهُ بِلَا عِلَاجٍ وَ لَا أَدَاةٍ وَ لَا آلَةٍ وَ أَنَّ كُلَّ صَانِعِ شَيْ‏ءٍ فَمِنْ شَيْ‏ءٍ صَنَعَ وَ اللَّهُ الْخَالِقُ اللَّطِيفُ الْجَلِيلُ خَلَقَ وَ صَنَعَ لَا مِنْ شَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Al Mukhtar Bin Muhammad Bin Al Mukhtar Al Hamdany and Muhammad Bin Al Hassan, from Abdullah Bin Al Hassan Al Alawy, altogether from Al Fatah Bin Yazeed Al Jurjany, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘And He<sup>azwj</sup> is Aware of the subtleties, the Aware, the Hearing, the Seeing, the One, the First, the Solid (not hollow), not begetting and not being begotten and there not being anyone a match for Him<sup>azwj</sup>. Had He<sup>azwj</sup> been just as the resemblers are saying, the Creator would not be recognised from the Created, nor the Builder from the Built. But He<sup>azwj</sup> is the Builder. There is (certainly) a difference between the One<sup>azwj</sup> Who Shapes it, and Images it, and Builds it, when it was so that nothing resembles Him<sup>azwj</sup>, nor does He<sup>azwj</sup> resemble anything’. ",
            "I said, ‘Certainly, may I be sacrificed for you<sup>asws</sup>! But, you<sup>asws</sup> said, ‘The First, the Solid (not hollow)’, and you<sup>asws</sup> said, ‘Nothing resembles Him<sup>azwj</sup>’; and Allah<sup>azwj</sup> is the One, and the human being is one. Isn’t there a resemblance of the oneness?’ ",
            "He<sup>asws</sup> said: ‘O Fatah! You (have spoken an) impossibility, may Allah<sup>azwj</sup> Affirm you! But rather, the resemblance is in the meaning. So, as for regarding the Names, so these are One, and they Indicate upon the Named, and that is because the human being, if he is said to be one, so he knows that he is one individual, and is not with two, and the human being himself is not with one, because his body parts are different, and his colours are difference, and the one whose colours are difference is without oneness, and he is a fragment of fragmentary bits. He isn’t with the equal-ness. His blood is other than his flesh, and his flesh is other than his blood, his nerves are other than his veins, and his hair is other than his skin, and his blackness is other than his whiteness. And similar to that are the entirety of the creatures. ",
            "So the human being is one in the name and is not one in the meaning; and Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Majesty, He<sup>azwj</sup> is One, not being one of theirs, neither there being any differentials in Him<sup>azwj</sup>, nor discrepancies, nor an increase, nor a decrease. But, as for the human being, the Created, the Made, the Composed from different parts, and of various body parts, apart from that he is with the gathering of things as one’. ",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! You have relieved me, may Allah<sup>azwj</sup> Relieve you<sup>asws</sup>! So, your<sup>asws</sup> words, ‘Aware of the subtleties, the Informed’, interpret it for me just as you<sup>asws</sup> interpreted the ‘One’, for I know that His<sup>azwj</sup> being Aware of the subtleties is difference from the awareness of His<sup>azwj</sup> creatures, apart from that I would love it if you<sup>asws</sup> could explain that for me’. ",
            "So he<sup>asws</sup> said: ‘O Fatah! But rather, we<sup>asws</sup> say: ‘The Aware of subtleties’, is for the subtleties of His<sup>azwj</sup> creation, and due to His<sup>azwj</sup> Knowledge of the subtle things. Or, do you not see, may Allah<sup>azwj</sup> Harmonise you and Affirm you, to the impacts of His<sup>azwj</sup> Making, regarding the vegetation, the delicate and non-delicate, and from the delicate creatures, and from the small beasts, and from the mosquito, and the bird, and what is smaller than these what is almost not clear to the eyes, and is almost not clear due to its smallness, the male from the female, and the new born from the old. ",
            "So when we see that smallness in His<sup>azwj</sup> Awareness of the subtleties, and their desire for the reproduction, and the fleeing from the death, and the gathering to what is correct for it, and what is in the tossing of the seas, and what is in the bark of the trees, and in the wilderness and the wastelands, and their understanding each other, their speaking (communicating) and what their children understand by it from them, and their transferring the meal to them. ",
            "Then the synthesis of their colours, red along with the yellow, and white along with red, and it is what the eyes can almost not clarify it due to the variance of its creation. Neither have our eyes seen it, nor have our hands touched it. We know that the Creator of these creatures is Aware of the subtleties, the Kind with the creatures what we<sup>asws</sup> specified, without (Using a) process, nor a tool, nor a machine; and that every maker of a thing, so (he makes it) from a thing, and Allah<sup>azwj</sup> is the Creator, the Aware of the subtleties, the Majestic Creates and Makes, not from anything’."
          ],
          "en.sarwar": [
            " Some additions concerning the different connotations of names (and attributes) used both for Allah, the Creator and the created."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (50/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 321,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/429",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ مُرْسَلًا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/90",
              "text": "أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ مُرْسَلًا عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:17:2",
        "text": [
          " قَالَ اعْلَمْ عَلَّمَكَ اللَّهُ الْخَيْرَ أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَدِيمٌ وَ الْقِدَمُ صِفَتُهُ الَّتِي دَلَّتِ الْعَاقِلَ عَلَى أَنَّهُ لَا شَيْ‏ءَ قَبْلَهُ وَ لَا شَيْ‏ءَ مَعَهُ فِي دَيْمُومِيَّتِهِ فَقَدْ بَانَ لَنَا بِإِقْرَارِ الْعَامَّةِ مُعْجِزَةُ الصِّفَةِ أَنَّهُ لَا شَيْ‏ءَ قَبْلَ اللَّهِ وَ لَا شَيْ‏ءَ مَعَ اللَّهِ فِي بَقَائِهِ وَ بَطَلَ قَوْلُ مَنْ زَعَمَ أَنَّهُ كَانَ قَبْلَهُ أَوْ كَانَ مَعَهُ شَيْ‏ءٌ",
          "وَ ذَلِكَ أَنَّهُ لَوْ كَانَ مَعَهُ شَيْ‏ءٌ فِي بَقَائِهِ لَمْ يَجُزْ أَنْ يَكُونَ خَالِقاً لَهُ لِأَنَّهُ لَمْ يَزَلْ مَعَهُ فَكَيْفَ يَكُونُ خَالِقاً لِمَنْ لَمْ يَزَلْ مَعَهُ وَ لَوْ كَانَ قَبْلَهُ شَيْ‏ءٌ كَانَ الْأَوَّلَ ذَلِكَ الشَّيْ‏ءُ لَا هَذَا وَ كَانَ الْأَوَّلُ أَوْلَى بِأَنْ يَكُونَ خَالِقاً لِلْأَوَّلِ ",
          "ثُمَّ وَصَفَ نَفْسَهُ تَبَارَكَ وَ تَعَالَى بِأَسْمَاءٍ دَعَا الْخَلْقَ إِذْ خَلَقَهُمْ وَ تَعَبَّدَهُمْ وَ ابْتَلَاهُمْ إِلَى أَنْ يَدْعُوهُ بِهَا فَسَمَّى نَفْسَهُ سَمِيعاً بَصِيراً قَادِراً قَائِماً نَاطِقاً ظَاهِراً بَاطِناً لَطِيفاً خَبِيراً قَوِيّاً عَزِيزاً حَكِيماً عَلِيماً وَ مَا أَشْبَهَ هَذِهِ الْأَسْمَاءَ",
          "فَلَمَّا رَأَى ذَلِكَ مِنْ أَسْمَائِهِ الْقَالُونَ الْمُكَذِّبُونَ وَ قَدْ سَمِعُونَا نُحَدِّثُ عَنِ اللَّهِ أَنَّهُ لَا شَيْ‏ءَ مِثْلُهُ وَ لَا شَيْ‏ءَ مِنَ الْخَلْقِ فِي حَالِهِ قَالُوا أَخْبِرُونَا إِذَا زَعَمْتُمْ أَنَّهُ لَا مِثْلَ لِلَّهِ وَ لَا شِبْهَ لَهُ كَيْفَ شَارَكْتُمُوهُ فِي أَسْمَائِهِ الْحُسْنَى فَتَسَمَّيْتُمْ بِجَمِيعِهَا فَإِنَّ فِي ذَلِكَ دَلِيلًا عَلَى أَنَّكُمْ مِثْلُهُ فِي حَالَاتِهِ كُلِّهَا أَوْ فِي بَعْضِهَا دُونَ بَعْضٍ إِذْ جَمَعْتُمُ الْأَسْمَاءَ الطَّيِّبَةَ",
          "قِيلَ لَهُمْ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَلْزَمَ الْعِبَادَ أَسْمَاءً مِنْ أَسْمَائِهِ عَلَى اخْتِلَافِ الْمَعَانِي وَ ذَلِكَ كَمَا يَجْمَعُ الِاسْمُ الْوَاحِدُ مَعْنَيَيْنِ مُخْتَلِفَيْنِ وَ الدَّلِيلُ عَلَى ذَلِكَ قَوْلُ النَّاسِ الْجَائِزُ عِنْدَهُمُ الشَّائِعُ وَ هُوَ الَّذِي خَاطَبَ اللَّهُ بِهِ الْخَلْقَ فَكَلَّمَهُمْ بِمَا يَعْقِلُونَ لِيَكُونَ عَلَيْهِمْ حُجَّةً فِي تَضْيِيعِ مَا ضَيَّعُوا",
          "فَقَدْ يُقَالُ لِلرَّجُلِ كَلْبٌ وَ حِمَارٌ وَ ثَوْرٌ وَ سُكَّرَةٌ وَ عَلْقَمَةٌ وَ أَسَدٌ كُلُّ ذَلِكَ عَلَى خِلَافِهِ وَ حَالَاتِهِ لَمْ تَقَعِ الْأَسَامِي عَلَى مَعَانِيهَا الَّتِي كَانَتْ بُنِيَتْ عَلَيْهِ لِأَنَّ الْإِنْسَانَ لَيْسَ بِأَسَدٍ وَ لَا كَلْبٍ فَافْهَمْ ذَلِكَ رَحِمَكَ اللَّهُ وَ إِنَّمَا سُمِّيَ اللَّهُ تَعَالَى بِالْعِلْمِ بِغَيْرِ عِلْمٍ حَادِثٍ عَلِمَ بِهِ الْأَشْيَاءَ اسْتَعَانَ بِهِ عَلَى حِفْظِ مَا يُسْتَقْبَلُ مِنْ أَمْرِهِ وَ الرَّوِيَّةِ فِيمَا يَخْلُقُ مِنْ خَلْقِهِ وَ يُفْسِدُ مَا مَضَى مِمَّا أَفْنَى مِنْ خَلْقِهِ مِمَّا لَوْ لَمْ يَحْضُرْهُ ذَلِكَ الْعِلْمُ وَ يَغِيبُهُ كَانَ جَاهِلًا ضَعِيفاً كَمَا أَنَّا لَوْ رَأَيْنَا عُلَمَاءَ الْخَلْقِ",
          "إِنَّمَا سُمُّوا بِالْعِلْمِ لِعِلْمٍ حَادِثٍ إِذْ كَانُوا فِيهِ جَهَلَةً وَ رُبَّمَا فَارَقَهُمُ الْعِلْمُ بِالْأَشْيَاءِ فَعَادُوا إِلَى الْجَهْلِ وَ إِنَّمَا سُمِّيَ اللَّهُ عَالِماً لِأَنَّهُ لَا يَجْهَلُ شَيْئاً فَقَدْ جَمَعَ الْخَالِقَ وَ الْمَخْلُوقَ اسْمُ الْعَالِمِ وَ اخْتَلَفَ الْمَعْنَى عَلَى مَا رَأَيْتَ",
          "وَ سُمِّيَ رَبُّنَا سَمِيعاً لَا بِخَرْتٍ فِيهِ يَسْمَعُ بِهِ الصَّوْتَ وَ لَا يُبْصِرُ بِهِ كَمَا أَنَّ خَرْتَنَا الَّذِي بِهِ نَسْمَعُ لَا نَقْوَى بِهِ عَلَى الْبَصَرِ وَ لَكِنَّهُ أَخْبَرَ أَنَّهُ لَا يَخْفَى عَلَيْهِ شَيْ‏ءٌ مِنَ الْأَصْوَاتِ لَيْسَ عَلَى حَدِّ مَا سُمِّينَا نَحْنُ فَقَدْ جَمَعْنَا الِاسْمَ بِالسَّمْعِ وَ اخْتَلَفَ الْمَعْنَى",
          "وَ هَكَذَا الْبَصَرُ لَا بِخَرْتٍ مِنْهُ أَبْصَرَ كَمَا أَنَّا نُبْصِرُ بِخَرْتٍ مِنَّا لَا نَنْتَفِعُ بِهِ فِي غَيْرِهِ وَ لَكِنَّ اللَّهَ بَصِيرٌ لَا يَحْتَمِلُ شَخْصاً مَنْظُوراً إِلَيْهِ فَقَدْ جَمَعْنَا الِاسْمَ وَ اخْتَلَفَ الْمَعْنَى",
          "وَ هُوَ قَائِمٌ لَيْسَ عَلَى مَعْنَى انْتِصَابٍ وَ قِيَامٍ عَلَى سَاقٍ فِي كَبَدٍ كَمَا قَامَتِ الْأَشْيَاءُ وَ لَكِنْ قَائِمٌ يُخْبِرُ أَنَّهُ حَافِظٌ كَقَوْلِ الرَّجُلِ الْقَائِمُ بِأَمْرِنَا فُلَانٌ وَ اللَّهُ هُوَ الْقَائِمُ عَلَى كُلِّ نَفْسٍ بِمَا كَسَبَتْ وَ الْقَائِمُ أَيْضاً فِي كَلَامِ النَّاسِ الْبَاقِي وَ الْقَائِمُ أَيْضاً يُخْبِرُ عَنِ الْكِفَايَةِ كَقَوْلِكَ لِلرَّجُلِ قُمْ بِأَمْرِ بَنِي فُلَانٍ أَيِ اكْفِهِمْ وَ الْقَائِمُ مِنَّا قَائِمٌ عَلَى سَاقٍ فَقَدْ جَمَعْنَا الِاسْمَ وَ لَمْ نَجْمَعِ الْمَعْنَى",
          "وَ أَمَّا اللَّطِيفُ فَلَيْسَ عَلَى قِلَّةٍ وَ قَضَافَةٍ وَ صِغَرٍ وَ لَكِنْ ذَلِكَ عَلَى النَّفَاذِ فِي الْأَشْيَاءِ وَ الِامْتِنَاعِ مِنْ أَنْ يُدْرَكَ كَقَوْلِكَ لِلرَّجُلِ لَطُفَ عَنِّي هَذَا الْأَمْرُ وَ لَطُفَ فُلَانٌ فِي مَذْهَبِهِ وَ قَوْلِهِ يُخْبِرُكَ أَنَّهُ غَمَضَ فِيهِ الْعَقْلُ وَ فَاتَ الطَّلَبُ وَ عَادَ مُتَعَمِّقاً مُتَلَطِّفاً لَا يُدْرِكُهُ الْوَهْمُ فَكَذَلِكَ لَطُفَ اللَّهُ تَبَارَكَ وَ تَعَالَى عَنْ أَنْ يُدْرَكَ بِحَدٍّ أَوْ يُحَدَّ بِوَصْفٍ وَ اللَّطَافَةُ مِنَّا الصِّغَرُ وَ الْقِلَّةُ فَقَدْ جَمَعْنَا الِاسْمَ وَ اخْتَلَفَ الْمَعْنَى ",
          "وَ أَمَّا الْخَبِيرُ فَالَّذِي لَا يَعْزُبُ عَنْهُ شَيْ‏ءٌ وَ لَا يَفُوتُهُ لَيْسَ لِلتَّجْرِبَةِ وَ لَا لِلِاعْتِبَارِ بِالْأَشْيَاءِ فَعِنْدَ التَّجْرِبَةِ وَ الِاعْتِبَارِ عِلْمَانِ وَ لَوْ لَا هُمَا مَا عُلِمَ لِأَنَّ مَنْ كَانَ كَذَلِكَ كَانَ جَاهِلًا وَ اللَّهُ لَمْ يَزَلْ خَبِيراً بِمَا يَخْلُقُ وَ الْخَبِيرُ مِنَ النَّاسِ الْمُسْتَخْبِرُ عَنْ جَهْلٍ الْمُتَعَلِّمُ فَقَدْ جَمَعْنَا الِاسْمَ وَ اخْتَلَفَ الْمَعْنَى ",
          "وَ أَمَّا الظَّاهِرُ فَلَيْسَ مِنْ أَجْلِ أَنَّهُ عَلَا الْأَشْيَاءَ بِرُكُوبٍ فَوْقَهَا وَ قُعُودٍ عَلَيْهَا وَ تَسَنُّمٍ لِذُرَاهَا وَ لَكِنْ ذَلِكَ لِقَهْرِهِ وَ لِغَلَبَتِهِ الْأَشْيَاءَ وَ قُدْرَتِهِ عَلَيْهَا كَقَوْلِ الرَّجُلِ ظَهَرْتُ عَلَى أَعْدَائِي وَ أَظْهَرَنِي اللَّهُ عَلَى خَصْمِي يُخْبِرُ عَنِ الْفَلْجِ وَ الْغَلَبَةِ فَهَكَذَا ظُهُورُ اللَّهِ عَلَى الْأَشْيَاءِ",
          "وَ وَجْهٌ آخَرُ أَنَّهُ الظَّاهِرُ لِمَنْ أَرَادَهُ وَ لَا يَخْفَى عَلَيْهِ شَيْ‏ءٌ وَ أَنَّهُ مُدَبِّرٌ لِكُلِّ مَا بَرَأَ فَأَيُّ ظَاهِرٍ أَظْهَرُ وَ أَوْضَحُ مِنَ اللَّهِ تَبَارَكَ وَ تَعَالَى لِأَنَّكَ لَا تَعْدَمُ صَنْعَتَهُ حَيْثُمَا تَوَجَّهَتْ وَ فِيكَ مِنْ آثَارِهِ مَا يُغْنِيكَ وَ الظَّاهِرُ مِنَّا الْبَارِزُ بِنَفْسِهِ وَ الْمَعْلُومُ بِحَدِّهِ فَقَدْ جَمَعَنَا الِاسْمُ وَ لَمْ يَجْمَعْنَا الْمَعْنَى ",
          "وَ أَمَّا الْبَاطِنُ فَلَيْسَ عَلَى مَعْنَى الِاسْتِبْطَانِ لِلْأَشْيَاءِ بِأَنْ يَغُورَ فِيهَا وَ لَكِنْ ذَلِكَ مِنْهُ عَلَى اسْتِبْطَانِهِ لِلْأَشْيَاءِ عِلْماً وَ حِفْظاً وَ تَدْبِيراً كَقَوْلِ الْقَائِلِ أَبْطَنْتُهُ يَعْنِي خَبَّرْتُهُ وَ عَلِمْتُ مَكْتُومَ سِرِّهِ وَ الْبَاطِنُ مِنَّا الْغَائِبُ فِي الشَّيْ‏ءِ الْمُسْتَتِرُ وَ قَدْ جَمَعْنَا الِاسْمَ وَ اخْتَلَفَ الْمَعْنَى ",
          "وَ أَمَّا الْقَاهِرُ فَلَيْسَ عَلَى مَعْنَى عِلَاجٍ وَ نَصَبٍ وَ احْتِيَالٍ وَ مُدَارَاةٍ وَ مَكْرٍ كَمَا يَقْهَرُ الْعِبَادُ بَعْضُهُمْ بَعْضاً وَ الْمَقْهُورُ مِنْهُمْ يَعُودُ قَاهِراً وَ الْقَاهِرُ يَعُودُ مَقْهُوراً وَ لَكِنْ ذَلِكَ مِنَ اللَّهِ تَبَارَكَ وَ تَعَالَى عَلَى أَنَّ جَمِيعَ مَا خَلَقَ مُلَبَّسٌ بِهِ الذُّلُّ لِفَاعِلِهِ وَ قِلَّةُ الِامْتِنَاعِ لِمَا أَرَادَ بِهِ لَمْ يَخْرُجْ مِنْهُ طَرْفَةَ عَيْنٍ أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ وَ الْقَاهِرُ مِنَّا عَلَى مَا ذَكَرْتُ وَ وَصَفْتُ فَقَدْ جَمَعْنَا الِاسْمَ وَ اخْتَلَفَ الْمَعْنَى ",
          "وَ هَكَذَا جَمِيعُ الْأَسْمَاءِ وَ إِنْ كُنَّا لَمْ نَسْتَجْمِعْهَا كُلَّهَا فَقَدْ يَكْتَفِي الِاعْتِبَارُ بِمَا أَلْقَيْنَا إِلَيْكَ وَ اللَّهُ عَوْنُكَ وَ عَوْنُنَا فِي إِرْشَادِنَا وَ تَوْفِيقِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, with an unbroken chain, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘Learn! May Allah<sup>azwj</sup> Teach you the good. Allah<sup>azwj</sup> Blessed and High is eternal, and the eternality is His<sup>azwj</sup> Attribute which Indicates the intellectual upon that there was nothing before Him<sup>azwj</sup>, nor was there a thing with Him<sup>azwj</sup> in His<sup>azwj</sup> eternality. So it is clear for us with the acknowledgement with the general Muslims of the miraculous-ness of the Attribute that there was nothing before Allah<sup>azwj</sup>, nor is there anything with Him<sup>azwj</sup> during His<sup>azwj</sup> remaining, and the invalidation of the words of the one who alleges that there was something before Him<sup>azwj</sup>, or there is something with Him<sup>azwj</sup>.",
            "And that is because, had there been something with Him<sup>azwj</sup> during His<sup>azwj</sup> remaining, it would not be allowed that He<sup>azwj</sup> would happen to be a Creator of it, because it would have been eternally with Him<sup>azwj</sup>. So how could He<sup>azwj</sup> be a Creator of the one who existed eternally with Him<sup>azwj</sup>. And had there been something before Him<sup>azwj</sup>, that thing would be first not this, and the first one would be closer of it being a Creator due to it being first.",
            "Then, He<sup>azwj</sup> the Blessed and High Described Himself<sup>azwj</sup> with Names the creatures could call with, and Enslaved them and Tried them that they should be supplicating to Him<sup>azwj</sup> with these. So He<sup>azwj</sup> Named Himself<sup>azwj</sup> as Hearing, Seeing, Powerful, Eternal, Speaking, Manifest, Hidden, Aware of subtleties, Informed, Wise, Knower, and what resembles these Names. ",
            "So when the speakers of the lies saw that from His<sup>azwj</sup> Names and that we were Naming Him<sup>azwj</sup> when discussing about Allah<sup>azwj</sup> that there is nothing like Him<sup>azwj</sup>, nor is there anything from the creatures in His<sup>azwj</sup> State, they said, ‘Inform us, when you are alleging that there is no likeness for Allah<sup>azwj</sup> and no resemblance for him, how come you all are participating Him<sup>azwj</sup> in His<sup>azwj</sup> Good Names so you are naming (yourselves) with the entirety of these, for in that is evidence upon that you all are like Him<sup>azwj</sup> regarding all of His<sup>azwj</sup> States, or in some of these besides the other when you gather the good names?’ ",
            "It would be said to them, ‘Allah<sup>azwj</sup> Blessed and High Necessitated the servants with names from His<sup>azwj</sup> Names upon a difference of the meaning, and that is just as the gathering of two different meanings upon the one name, and the evidence upon that are the words of the people commonly allowed in their presence, and it is which Allah<sup>azwj</sup> Addressed the creatures with. So He<sup>azwj</sup> Spoke to them with what they are speaking with in order for it to become an argument upon them regarding the wastage of what they are wasting.",
            "So it is said for the man, (he is) a dog, and a donkey, and a bull, and sweet, and bitter, and a lion. All of that is upon different to him and his state. The Name does not fall upon its meaning which it had been built upon, because the human being is neither a lion, nor a dog. Therefore understand that, may Allah<sup>azwj</sup> have Mercy on you, and rather Allah<sup>azwj</sup> the Exalted has been Named with the knowledge without any new knowledge He<sup>azwj</sup> learns being assisted by the things upon the preservation of what is to be in the future from His<sup>azwj</sup> Commands and the process regarding what He<sup>azwj</sup> Creates from His<sup>azwj</sup> creatures. And Spoils from what is past from what perishes from His<sup>azwj</sup> creatures, from what if that knowledge was not present and was absent, He<sup>azwj</sup> would have been ignorant, weak, just as us, when we see the knowledgeable ones of the people.",
            "But rather, they have been named with the knowledge due to the newly occurring knowledge, when they used to be ignorant beforehand. Sometimes the knowledge separates from them and they return back to be ignorance. But rather, Allah<sup>azwj</sup> is Named as a Knower because He<sup>azwj</sup> is not ignorant of anything. So the Creator and the Created are gathered upon the name ‘Knower’, and the meaning is difference upon what you can see. ",
            "And our Lord<sup>azwj</sup> is Hearing, not by a perforation in Him<sup>azwj</sup> Hearing the sounds with it, nor does He<sup>azwj</sup> See by it, just as we have perforations by which we hear not being strong upon seeing with it. But, He<sup>azwj</sup> is All-Informed, there being nothing hidden from Him<sup>azwj</sup> from the sound. He<sup>azwj</sup> is not bound by a limit of what we can hear. So we are gathered in name with the name, and the meaning is different. ",
            "And similar to this is the sight. He<sup>azwj</sup> does not see by a perforation from Him<sup>azwj</sup> just as we tend to see by a perforation from us, not benefitting by it with something else. But Allah<sup>azwj</sup> is Seeing, not by looking towards a person. So we are gathered in the name and the meaning is different. ",
            "And He<sup>azwj</sup> is Standing, not being upon the meaning of an uprightness and standing upon a leg in the middle just as the things stand. But He<sup>azwj</sup> Stands Informed, being a Preserver, unlike the words of the man, ‘Standing with our matters over so and so’. And Allah<sup>azwj</sup>, He<sup>azwj</sup> is the Stander upon every soul with what it has earned. And the standing as well in the speech of the people is the remaining. And the standing as well, informs about the responsibility, like your words to a man, ‘Stand with the matter of the Clan of so and so’, i.e., suffice them. And the standing one from us stands upon a leg. So we are gathered in the name, and we are not gathered in the meaning. ",
            "And as for the (Name) Subtle, so is not upon scarceness, and delicateness, and smallness, but that is upon the implementation regarding the things which are hard to perceive, like your words to the man, ‘This matter is delicate upon me, and so and so is subtle in his approach’. And his words inform you that intellect is shut with regards to it and the subtleness is lost, as it is so profound, so subtle, that the imagination cannot realise it. So, similar to that is the Subtleness of Allah<sup>azwj</sup> Blessed and High from being comprehended by a limit, or limited by an attribute. And the subtleness from us is the smallness, and scarcity. Thus, we are gathered in the name but different in the meaning. ",
            "And as for the Informed (All-Aware), so it is which the thing is recognised from, and nothing is missed out from Him<sup>azwj</sup>. It is not due to the experimentation, nor by learning of lessons with the things, for during the experimentation and the learning of lessons, are the two pieces of knowledge, and had it not been for the two, it would not be known, because the one who was like that, would have been ignorant, and Allah<sup>azwj</sup> has not ceased to be Informed with what He<sup>azwj</sup> Created, and the ‘informed’ from the people is the choice (chosen) by the ignorant to learn. So we are gathered in the name and the meaning is different. ",
            "And as for the Overcomer, so it is not from a reason that He<sup>azwj</sup> is upon the things by riding above them, and seated upon these, ascending to their peaks. But, that is due to His<sup>azwj</sup> Subduing and His<sup>azwj</sup> Overcoming the things and His<sup>azwj</sup> Power upon these, like the words of the man, ‘I overcame upon my enemy and Allah<sup>azwj</sup> Made me overcome upon my adversary’, inform about the cleaving and the overcoming. So this is how Allah<sup>azwj</sup> Overcomes upon the things. ",
            "And another aspect is that He<sup>azwj</sup> is the Manifest to the one who wants Him<sup>azwj</sup> and nothing is Hidden from Him<sup>azwj</sup>, and He<sup>azwj</sup> is the Designer of everything what He<sup>azwj</sup> Designed. So which manifestation is more apparent and clear than Allah<sup>azwj</sup> Blessed and High, because you cannot execute His<sup>azwj</sup> Making wherever you may divert your face to, and inside you are its effects what makes you independent. And the Manifestation is more than ours, transcendental by Himself<sup>azwj</sup>, and the known by His<sup>azwj</sup> Sharpness. So we have gathered in the name and we are not gathered in the meaning.",
            "And as for the Hidden (Esoteric), so it is not upon the meaning of the hidden-ness of the things, with being immersed into them, but that from Him<sup>azwj</sup> is upon the Knowledge of the hidden things, and Preserving these, and their regulation, like the words of the man, ‘I know his inside, meaning I am informed of him and know the concealed secrets of his’. And the hidden from us is the absent regarding the things, the veiled, and we are gathered in the name and differ in the meaning.",
            "And as for the Subduer, so it is not upon the meaning of a process, and establishing hostility, and fraud, and deceit, and plotting, just as the servants would do to subdue each other, and the subdued from them reverts to be the subdue, and the subduer reverts to be a subdued. But that, from Allah<sup>azwj</sup> Blessed and High is upon the entirety of what He<sup>azwj</sup> Created are clothed by the humility to its Performer, and scarcity of the obstacles to whatever He<sup>azwj</sup> intends with. It does not emerge in even the blink of an eye if He<sup>azwj</sup> is Saying to it: “Be”, so it comes into being, while the subdue from us is upon what we<sup>asws</sup> mentioned and described. So we are gathered in the name, and differ in the meaning’. ",
            "And like that are the entirety of the Names, and if even though we<sup>asws</sup> have not gathered all of these, so these would suffice as the lesson with what we<sup>asws</sup> have cast to you, and Allah<sup>azwj</sup> would Assist you, and Assist us<sup>asws</sup> in Guiding us and Harmonising us’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Ibrahim has narrated from al-Mukhtar ibn Muhammad ibn al-Mukhtar al-Hamadani and Muhammad ibn al-Hassan from ‘Abdallah ibn al-Hassan al-‘Alawi both of them from al-Fath ibn Yazid al-Jurjani from abu al-Hassan (a.s.) al-Thani or al-Thalith who has said the following. “I heard the Imam saying, ‘He (Allah) is the Subtle, All-aware, All-hearing, All-seeing, the One, the Self-sufficient, Who does not have any children, is not any one’s child and there is no one similar to Him. Had Allah been as those believing in similitude (al-Mushabbihah) say there would have been no distinction between the Creator and the created, the inventor and the invented but He is the Inventor. There would have been no distinction between Allah and what He has given body and form to bring into existence. In fact, nothing is similar to Him and He is not similar to anything.” I then said, “Yes, may Allah take my soul in your service, but you just said, The One the Self-sufficient, that no one is similar to Him. Allah is One and a man is one. Are the two not similar in oneness?” The Imam replied, “O Fath, you said something impossible. May Allah grant you steadfastness. Similarity is in meaning. In the case of names they are all the same. The names refer to the nominee. When it is said a man it, at the same time, is a report about one body and not two bodies. In fact, man is not one thing. His parts, colors and the color of his colors that consist of distinct parts, that are not equal. His blood is different from his flesh. His nerves are different from his vines, his hairs are different from his skin. The black things in him are different from the white things therein. The same is true of all other creatures. Human beings are one in name but not in meaning. Allah, Great Whose Majesty is, is only One and no one other than Him is one. There is no difference, imbalance, increase or decrease in Him. Human beings are created, designed, compounded of different parts and various substances. Only when combined becomes one.” I then said, “May Allah take my soul in service for your cause, and grant you happiness, would you explain to me the meaning of your words “Subtle and All-aware? Explain it as you just did with the One? I know that His Subtlety or kindness is different from those of His creatures but I like more clarity.” The Imam said, “O Fath, we said He is Subtle it is because of His knowledge of the delicate creatures, may Allah give you success and steadfastness, so you should consider His creation. Consider His design in delicate and not so delicate plants and other creatures like animals, small and large such as flies and cricket and smaller ones that even eyes can not. Because of their small size no one knows which is male and which is female, which is new born and which is old. We find tremendously delicate things with signs of His Subtlety, in their desire for reproduction, running away from death, collecting what is good for them and what is in the depth of the oceans and on the barks of trees, in the wilderness and desolate places. We find more fastidiousness in such animals and their ability to communicate with each other, and what their offspring understand from them, their transporting food to their young and their colors, red along with yellow, white along with red so fine that our eyes are not able to catch for their very exquisite shape. Our eyes are not able to see them and our hands are not able to touch them. All these show that the Creator of all such marvelous creatures are Subtle Who is kind to all the creatures we mentioned. He has done it without instruments and means. Every designer and manufacturer builds and manufactures some thing from something but Allah does it from nothing.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/54)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": " "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/430",
              "text": "2ـ عَلِيُّ بْنُ مُحَمَّدٍ مُرْسَلاً"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/431",
              "text": "أَبِي الْحَسَنِ الرِّضَا (عَلَيْهِ السَّلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": " 2ـ عَلِيُّ بْنُ مُحَمَّدٍ مُرْسَلاً عَنْ أَبِي الْحَسَنِ الرِّضَا (عَلَيْهِ السَّلام) قَالَ"
        },
        "part_type": "Hadith",
        "text": [
          " قَالَ اعْلَمْ عَلَّمَكَ الله الْخَيْرَ أَنَّ الله تَبَارَكَ وَتَعَالَى قَدِيمٌ وَالْقِدَمُ صِفَتُهُ الَّتِي دَلَّتِ الْعَاقِلَ عَلَى أَنَّهُ لا شَيْ‏ءَ قَبْلَهُ وَلا شَيْ‏ءَ مَعَهُ فِي دَيْمُومِيَّتِهِ فَقَدْ بَانَ لَنَا بِإِقْرَارِ الْعَامَّةِ مُعْجِزَةُ الصِّفَةِ أَنَّهُ لا شَيْ‏ءَ قَبْلَ الله وَلا شَيْ‏ءَ مَعَ الله فِي بَقَائِهِ وَبَطَلَ قَوْلُ مَنْ زَعَمَ أَنَّهُ كَانَ قَبْلَهُ أَوْ كَانَ مَعَهُ شَيْ‏ءٌ وَذَلِكَ أَنَّهُ لَوْ كَانَ مَعَهُ شَيْ‏ءٌ فِي بَقَائِهِ لَمْ يَجُزْ أَنْ يَكُونَ خَالِقاً لَهُ لانَّهُ لَمْ يَزَلْ مَعَهُ فَكَيْفَ يَكُونُ خَالِقاً لِمَنْ لَمْ يَزَلْ مَعَهُ وَلَوْ كَانَ قَبْلَهُ شَيْ‏ءٌ كَانَ الاوَّلَ ذَلِكَ الشَّيْ‏ءُ لا هَذَا وَكَانَ الاوَّلُ أَوْلَى بِأَنْ يَكُونَ خَالِقاً لِلاوَّلِ ثُمَّ وَصَفَ نَفْسَهُ تَبَارَكَ وَتَعَالَى بِأَسْمَاءٍ دَعَا الْخَلْقَ إِذْ خَلَقَهُمْ وَتَعَبَّدَهُمْ وَابْتَلاهُمْ إِلَى أَنْ يَدْعُوهُ بِهَا فَسَمَّى نَفْسَهُ سَمِيعاً بَصِيراً قَادِراً قَائِماً نَاطِقاً ظَاهِراً بَاطِناً لَطِيفاً خَبِيراً قَوِيّاً عَزِيزاً حَكِيماً عَلِيماً وَمَا أَشْبَهَ هَذِهِ الاسْمَاءَ فَلَمَّا رَأَى ذَلِكَ مِنْ أَسْمَائِهِ الْقَالُونَ الْمُكَذِّبُونَ وَقَدْ سَمِعُونَا نُحَدِّثُ عَنِ الله أَنَّهُ لا شَيْ‏ءَ مِثْلُهُ وَلا شَيْ‏ءَ مِنَ الْخَلْقِ فِي حَالِهِ قَالُوا أَخْبِرُونَا إِذَا زَعَمْتُمْ أَنَّهُ لا مِثْلَ لله وَلا شِبْهَ لَهُ كَيْفَ شَارَكْتُمُوهُ فِي أَسْمَائِهِ الْحُسْنَى فَتَسَمَّيْتُمْ بِجَمِيعِهَا فَإِنَّ فِي ذَلِكَ دَلِيلاً عَلَى أَنَّكُمْ مِثْلُهُ فِي حَالاتِهِ كُلِّهَا أَوْ فِي بَعْضِهَا دُونَ بَعْضٍ إِذْ جَمَعْتُمُ الاسْمَاءَ الطَّيِّبَةَ قِيلَ لَهُمْ إِنَّ الله تَبَارَكَ وَتَعَالَى أَلْزَمَ الْعِبَادَ أَسْمَاءً مِنْ أَسْمَائِهِ عَلَى اخْتِلافِ الْمَعَانِي وَذَلِكَ كَمَا يَجْمَعُ الاسْمُ الْوَاحِدُ مَعْنَيَيْنِ مُخْتَلِفَيْنِ وَالدَّلِيلُ عَلَى ذَلِكَ قَوْلُ النَّاسِ الْجَائِزُ عِنْدَهُمُ الشَّائِعُ وَهُوَ الَّذِي خَاطَبَ الله بِهِ الْخَلْقَ فَكَلَّمَهُمْ بِمَا يَعْقِلُونَ لِيَكُونَ عَلَيْهِمْ حُجَّةً فِي تَضْيِيعِ مَا ضَيَّعُوا فَقَدْ يُقَالُ لِلرَّجُلِ كَلْبٌ وَحِمَارٌ وَثَوْرٌ وَسُكَّرَةٌ وَعَلْقَمَةٌ وَأَسَدٌ كُلُّ ذَلِكَ عَلَى خِلافِهِ وَحَالاتِهِ لَمْ تَقَعِ الاسَامِي عَلَى مَعَانِيهَا الَّتِي كَانَتْ بُنِيَتْ عَلَيْهِ لانَّ الانْسَانَ لَيْسَ بِأَسَدٍ وَلا كَلْبٍ فَافْهَمْ ذَلِكَ رَحِمَكَ الله وَإِنَّمَا سُمِّيَ الله تَعَالَى بِالْعِلْمِ بِغَيْرِ عِلْمٍ حَادِثٍ عَلِمَ بِهِ الاشْيَاءَ اسْتَعَانَ بِهِ عَلَى حِفْظِ مَا يُسْتَقْبَلُ مِنْ أَمْرِهِ وَالرَّوِيَّةِ فِيمَا يَخْلُقُ مِنْ خَلْقِهِ وَيُفْسِدُ مَا مَضَى مِمَّا أَفْنَى مِنْ خَلْقِهِ مِمَّا لَوْ لَمْ يَحْضُرْهُ ذَلِكَ الْعِلْمُ وَيَغِيبُهُ كَانَ جَاهِلاً ضَعِيفاً كَمَا أَنَّا لَوْ رَأَيْنَا عُلَمَاءَ الْخَلْقِ إِنَّمَا سُمُّوا بِالْعِلْمِ لِعِلْمٍ حَادِثٍ إِذْ كَانُوا فِيهِ جَهَلَةً وَرُبَّمَا فَارَقَهُمُ الْعِلْمُ بِالاشْيَاءِ فَعَادُوا إِلَى الْجَهْلِ وَإِنَّمَا سُمِّيَ الله عَالِماً لانَّهُ لا يَجْهَلُ شَيْئاً فَقَدْ جَمَعَ الْخَالِقَ وَالْمَخْلُوقَ اسْمُ الْعَالِمِ وَاخْتَلَفَ الْمَعْنَى عَلَى مَا رَأَيْتَ وَسُمِّيَ رَبُّنَا سَمِيعاً لا بِخَرْتٍ فِيهِ يَسْمَعُ بِهِ الصَّوْتَ وَلا يُبْصِرُ بِهِ كَمَا أَنَّ خَرْتَنَا الَّذِي بِهِ نَسْمَعُ لا نَقْوَى بِهِ عَلَى الْبَصَرِ وَلَكِنَّهُ أَخْبَرَ أَنَّهُ لا يَخْفَى عَلَيْهِ شَيْ‏ءٌ مِنَ الاصْوَاتِ لَيْسَ عَلَى حَدِّ مَا سُمِّينَا نَحْنُ فَقَدْ جَمَعْنَا الاسْمَ بِالسَّمْعِ وَاخْتَلَفَ الْمَعْنَى وَهَكَذَا الْبَصَرُ لا بِخَرْتٍ مِنْهُ أَبْصَرَ كَمَا أَنَّا نُبْصِرُ بِخَرْتٍ مِنَّا لا نَنْتَفِعُ بِهِ فِي غَيْرِهِ وَلَكِنَّ الله بَصِيرٌ لا يَحْتَمِلُ شَخْصاً مَنْظُوراً إِلَيْهِ فَقَدْ جَمَعْنَا الاسْمَ وَاخْتَلَفَ الْمَعْنَى وَهُوَ قَائِمٌ لَيْسَ عَلَى مَعْنَى انْتِصَابٍ وَقِيَامٍ عَلَى سَاقٍ فِي كَبَدٍ كَمَا قَامَتِ الاشْيَاءُ وَلَكِنْ قَائِمٌ يُخْبِرُ أَنَّهُ حَافِظٌ كَقَوْلِ الرَّجُلِ الْقَائِمُ بِأَمْرِنَا فُلانٌ وَالله هُوَ الْقَائِمُ عَلَى كُلِّ نَفْسٍ بِمَا كَسَبَتْ وَالْقَائِمُ أَيْضاً فِي كَلامِ النَّاسِ الْبَاقِي وَالْقَائِمُ أَيْضاً يُخْبِرُ عَنِ.",
          " الْكِفَايَةِ كَقَوْلِكَ لِلرَّجُلِ قُمْ بِأَمْرِ بَنِي فُلانٍ أَيِ اكْفِهِمْ وَالْقَائِمُ مِنَّا قَائِمٌ عَلَى سَاقٍ فَقَدْ جَمَعْنَا الاسْمَ وَلَمْ نَجْمَعِ الْمَعْنَى وَأَمَّا اللَّطِيفُ فَلَيْسَ عَلَى قِلَّةٍ وَقَضَافَةٍ وَصِغَرٍ وَلَكِنْ ذَلِكَ عَلَى النَّفَاذِ فِي الاشْيَاءِ وَالامْتِنَاعِ مِنْ أَنْ يُدْرَكَ كَقَوْلِكَ لِلرَّجُلِ لَطُفَ عَنِّي هَذَا الامْرُ وَلَطُفَ فُلانٌ فِي مَذْهَبِهِ وَقَوْلِهِ يُخْبِرُكَ أَنَّهُ غَمَضَ فِيهِ الْعَقْلُ وَفَاتَ الطَّلَبُ وَعَادَ مُتَعَمِّقاً مُتَلَطِّفاً لا يُدْرِكُهُ الْوَهْمُ فَكَذَلِكَ لَطُفَ الله تَبَارَكَ وَتَعَالَى عَنْ أَنْ يُدْرَكَ بِحَدٍّ أَوْ يُحَدَّ بِوَصْفٍ وَاللَّطَافَةُ مِنَّا الصِّغَرُ وَالْقِلَّةُ فَقَدْ جَمَعْنَا الاسْمَ وَاخْتَلَفَ الْمَعْنَى وَأَمَّا الْخَبِيرُ فَالَّذِي لا يَعْزُبُ عَنْهُ شَيْ‏ءٌ وَلا يَفُوتُهُ لَيْسَ لِلتَّجْرِبَةِ وَلا لِلاعْتِبَارِ بِالاشْيَاءِ فَعِنْدَ التَّجْرِبَةِ وَالاعْتِبَارِ عِلْمَانِ وَلَوْ لا هُمَا مَا عُلِمَ لانَّ مَنْ كَانَ كَذَلِكَ كَانَ جَاهِلاً وَالله لَمْ يَزَلْ خَبِيراً بِمَا يَخْلُقُ وَالْخَبِيرُ مِنَ النَّاسِ الْمُسْتَخْبِرُ عَنْ جَهْلٍ الْمُتَعَلِّمُ فَقَدْ جَمَعْنَا الاسْمَ وَاخْتَلَفَ الْمَعْنَى وَأَمَّا الظَّاهِرُ فَلَيْسَ مِنْ أَجْلِ أَنَّهُ عَلا الاشْيَاءَ بِرُكُوبٍ فَوْقَهَا وَقُعُودٍ عَلَيْهَا وَتَسَنُّمٍ لِذُرَاهَا وَلَكِنْ ذَلِكَ لِقَهْرِهِ وَلِغَلَبَتِهِ الاشْيَاءَ وَقُدْرَتِهِ عَلَيْهَا كَقَوْلِ الرَّجُلِ ظَهَرْتُ عَلَى أَعْدَائِي وَأَظْهَرَنِي الله عَلَى خَصْمِي يُخْبِرُ عَنِ الْفَلْجِ وَالْغَلَبَةِ فَهَكَذَا ظُهُورُ الله عَلَى الاشْيَاءِ وَوَجْهٌ آخَرُ أَنَّهُ الظَّاهِرُ لِمَنْ أَرَادَهُ وَلا يَخْفَى عَلَيْهِ شَيْ‏ءٌ وَأَنَّهُ مُدَبِّرٌ لِكُلِّ مَا بَرَأَ فَأَيُّ ظَاهِرٍ أَظْهَرُ وَأَوْضَحُ مِنَ الله تَبَارَكَ وَتَعَالَى لانَّكَ لا تَعْدَمُ صَنْعَتَهُ حَيْثُمَا تَوَجَّهَتْ وَفِيكَ مِنْ آثَارِهِ مَا يُغْنِيكَ وَالظَّاهِرُ مِنَّا الْبَارِزُ بِنَفْسِهِ وَالْمَعْلُومُ بِحَدِّهِ فَقَدْ جَمَعَنَا الاسْمُ وَلَمْ يَجْمَعْنَا الْمَعْنَى وَأَمَّا الْبَاطِنُ فَلَيْسَ عَلَى مَعْنَى الاسْتِبْطَانِ لِلاشْيَاءِ بِأَنْ يَغُورَ فِيهَا وَلَكِنْ ذَلِكَ مِنْهُ عَلَى اسْتِبْطَانِهِ لِلاشْيَاءِ عِلْماً وَحِفْظاً وَتَدْبِيراً كَقَوْلِ الْقَائِلِ أَبْطَنْتُهُ يَعْنِي خَبَّرْتُهُ وَعَلِمْتُ مَكْتُومَ سِرِّهِ وَالْبَاطِنُ مِنَّا الْغَائِبُ فِي الشَّيْ‏ءِ الْمُسْتَتِرُ وَقَدْ جَمَعْنَا الاسْمَ وَاخْتَلَفَ الْمَعْنَى وَأَمَّا الْقَاهِرُ فَلَيْسَ عَلَى مَعْنَى عِلاجٍ وَنَصَبٍ وَاحْتِيَالٍ وَمُدَارَاةٍ وَمَكْرٍ كَمَا يَقْهَرُ الْعِبَادُ بَعْضُهُمْ بَعْضاً وَالْمَقْهُورُ مِنْهُمْ يَعُودُ قَاهِراً وَالْقَاهِرُ يَعُودُ مَقْهُوراً وَلَكِنْ ذَلِكَ مِنَ الله تَبَارَكَ وَتَعَالَى عَلَى أَنَّ جَمِيعَ مَا خَلَقَ مُلَبَّسٌ بِهِ الذُّلُّ لِفَاعِلِهِ وَقِلَّةُ الامْتِنَاعِ لِمَا أَرَادَ بِهِ لَمْ يَخْرُجْ مِنْهُ طَرْفَةَ عَيْنٍ أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ وَالْقَاهِرُ مِنَّا عَلَى مَا ذَكَرْتُ وَوَصَفْتُ فَقَدْ جَمَعْنَا الاسْمَ وَاخْتَلَفَ الْمَعْنَى وَهَكَذَا جَمِيعُ الاسْمَاءِ وَإِنْ كُنَّا لَمْ نَسْتَجْمِعْهَا كُلَّهَا فَقَدْ يَكْتَفِي الاعْتِبَارُ بِمَا أَلْقَيْنَا إِلَيْكَ وَالله عَوْنُكَ وَعَوْنُنَا فِي إِرْشَادِنَا وَتَوْفِيقِنَا."
        ],
        "translations": {
          "en.sarwar": [
            " 2. It is narrated from Ali ibn Muhammad, in a mursal manner, from abu al-Hassan al-Rida (a.s.) who has said the following to one of his followers. “May Allah, bestow up on you knowledge of the good, notice that Allah, the Most Holy, the Most High, is eternal. Eternity is that attribute which guides the wise that there was nothing before Him in eternity nor is there anything with Him eternal. That this attribute is a miraculous one has come to light from the acknowledgement of the ‘Ammah (common people) that there is nothing before Allah, with and after Him. At the same time, it invalidates the belief that there was something before or with Him. Had there been something with Him eternal He would not have been the Creator of that thing. If it was with Him how then He could have been its creator? Had there been something before Him then that thing might have been His creator because of its existing earlier. Allah, the Most Holy, the Exalted, has ascribed certain names to Himself. He told His creatures when He created them, give them the ability to worship Him and made them responsible, to call Him with those names. He called Himself All-hearing, All-seeing, All-powerful, Guarding, Rationalizing, Manifest, Hidden, Subtle, All-aware, Powerful, Majestic, Wise, All-knowing and with such other similar names. When the animosity-mongers, who speak lies heard us mention such names as that there is nothing similar to Him and nothing of the creatures is like Him they began to speak out. “When you (the Imams (a.s.) say that there is nothing like Him and no one is similar to Him then how is it that you also have those beautiful names for yourselves? This is proof that you are similar to Him or in certain conditions and not in other conditions because of having all those beautiful names.” It is said to them that Allah, the Most Holy, the Most High, made it necessary for His servants to have certain names from among His names with differences in their meanings. The difference is because one name may have two different meanings. One example is what people consider permissible and is widely used. This is the way Allah has addressed people. He has spoken to them by means of things that they understand so that they will have no excuse in their misdeeds. A man is sometimes called a dog, a bull, sweet, bitter and a loin. All these are different from him and his conditions. The names were not used in their original meaning because man is not a loin or a dog etc. Note this carefully, may Allah grant you blessings. Allah is called All-knowing. It is other than the created knowledge. With His knowledge of things He knows things and uses it to preserve His future commands and the process of whatever He creates of His creatures, destroys what He destroys of His creatures and without such knowledge He would have been weak and ignorant. We see that people of knowledge among people are called knowledgeable because of the created knowledge, which they did not have at one time. Perhaps such knowledge may go away from them and they become ignorant. Allah is called All-knowing because He is not ignorant of anything. Thus, the Creator and created are both called as having knowledge but the meaning is different as you may have noticed. Our Lord is called All-hearing but it is not through the perforated piece and with sound so He would hear with it but would not see with it, which is the case with us. We do not see with what we hear but Allah has told us that from Him nothing of the sounds is hidden. His hearing is not in the way we are called as hearing people. We are called as hearing but the meaning is different. In the same way is seeing not that He sees through a hole as we do and can not use it for other uses. Allah sees but not by looking to an object. We also are called as seeing but the meaning is different. Allah is called Standing but not in the sense of standing in an upright position on the legs as is the case with the things but that He has said He is preserving as in the saying of a man, “standing for our affairs.” Allah stands over every soul and what it gains. The word standing is also in the usage of people. Words like remaining and standing also mean to suffice as in the words as you may say to a man, “Stand up over the affairs of so and so” which means deal with them in a sufficient manner. We stand on our legs, thus, the name is similar but the meaning is different. The name, Subtle is not in the sense of fastidiousness or being infinitesimal but it is in the rarity and hard to perceive nature of things. As an example it may be said, “It has become very delicate for me and that so and so is very delicate in his manners and dealings.” This means that it is profound for intelligence and difficult to find. It has become bottomless and delicate so much that even imagination is not able to reach it. Allah, the Most Holy, the Most High, is far Subtle to be comprehended through definitions or be combined in an attribute or in the way we are subtle, small and delicate. Names are the same but different in meaning. The name al-Khabir, meaning All-aware, is for One Who knows all things completely but not by means of experience and learning lessons from the past. Experience and learning from mistakes are of the means of learning for people. Without them there would exist no knowledge. One without experience and learning lessons is an ignorant person. Allah is All-aware eternally of what He has created but well aware and expert among people are those who ask questions and learn. Our names are the same but they, again, are different in meaning. The name al-Zahir meaning clear and conspicuous is not because of being over and on top of all things or sitting on them at their peak but it is because of His domination and having power over all things. An example of this is when a person says, “I over came my enemies or that Allah gave me victory over my enemies.” In this there is report of the failure and victory. Also there is Allah’s domination over all things. Another example is that His existence is clear for those who want (to know) Him. Nothing is hidden from Him and that He is the guardian of all that He has curved and fashioned. In such case whose existence can be clearer than Allah, the Most Holy, the Most High? You will not live without His creatures, no matter wherever you may be. Only within your own self there is enough of His creation. His existence by far is clearer than ours. He manifest all by His Own-self and is Known by His own self. We are of the same name but the meaning is different. The name al-Batin, means hidden. This is not in the sense of being inside of things by means of diving or so but is in the sense of His dealing, having knowledge, preserving and regulating the inside of all things. As one may say, “I tried to find the inside to learn and discover the secrets.” Hidden for us is what is unseen and covered. In this case again our names are the same but different in meaning. The name al-Qahir, means subduing. It is not in the sense of plotting, using certain devices and speaking attractive words or cunning means. It is not the way people subdue each other. The victorious among people may become subdued and vice versa. For Allah, the Most Holy, the Most High all the creatures have the garment of weakness on them. Due to the absence of obstacles in what He wills about them, it only takes less than a blinking of the eye to say it Be and it is, comes into existence. Subduing in our case is how I mentioned and explained. Our names are alike but the meaning is different. Thus, is the case for all the names although we have not mentioned all of them. For learning a lesson what we have mentioned for you is sufficient. May Allah be your and our helper in the matters of guidance and success.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:17",
  "kind": "verse_list"
}