{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:1:3:18",
        "titles": {
          "ar": "بَابُ تَأْوِيلِ الصَّمَدِ",
          "en": "Chapter 18 – Explanation of Al-Samad"
        }
      }
    ],
    "index": 41,
    "local_index": 18,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:1:3:19",
        "titles": {
          "ar": "بَابُ الْحَرَكَةِ وَ الِانْتِقَالِ",
          "en": "Chapter 19 – The Motion and the Transformation (Change of state to a state)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:1:3:17",
        "titles": {
          "ar": "باب آخَرُ وَ هُوَ مِنَ الْبَابِ الْأَوَّلِ إِلَّا أَنَّ فِيهِ زِيَادَةً وَ هُوَ الْفَرْقُ مَا بَيْنَ الْمَعَانِي الَّتِي تَحْتَ أَسْمَاءِ اللَّهِ وَ أَسْمَاءِ الْمَخْلُوقِينَ",
          "en": "Chapter 17 – Another Chapter and it is from the first, except that in it is an addition, and it is the difference between the meaning which is beneath the Names of Allah<sup>azwj</sup> and the names of the creatures"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:18",
    "titles": {
      "ar": "بَابُ تَأْوِيلِ الصَّمَدِ",
      "en": "Chapter 18 – Explanation of Al-Samad"
    },
    "verse_count": 2,
    "verse_start_index": 321,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/60)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 322,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:18:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ وَ لَقَبُهُ شَبَابٌ الصَّيْرَفِيُّ عَنْ دَاوُدَ بْنِ الْقَاسِمِ الْجَعْفَرِيِّ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) جُعِلْتُ فِدَاكَ مَا الصَّمَدُ قَالَ السَّيِّدُ الْمَصْمُودُ إِلَيْهِ فِي الْقَلِيلِ وَ الْكَثِيرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Muhammad Bin Al Waleed, and his title is The Young exchanger, from Dawood Bin Al Qasim Al Ja’fary who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, ‘May I be sacrificed for you<sup>asws</sup>! What is <span class=\"iTxt\">Al-Samad</span>?’ He<sup>asws</sup> said: ‘The Master of the turners to Him<sup>azwj</sup> regarding the little and the more’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Muhammad and Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Muhammad ibn al-Walid, whose title was Shabab al-Sayrafi from Dawud ibn al-Qasim al-Ja‘fari who has said the following. “I asked Imam abu Ja‘far al-Thani (the 2nd (a.s.), ‘May Allah take my soul in your service, what is the meaning of the word al-Samad?’” The Imam replied, al-Samad means the Lord to Who one turns for help, big or small.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/61)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 323,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:18:2",
        "relations": {
          "Mentions": [
            "/books/quran:42:11"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنِ الْحَسَنِ بْنِ السَّرِيِّ عَنْ جَابِرِ بْنِ يَزِيدَ الْجُعْفِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ شَيْ‏ءٍ مِنَ التَّوْحِيدِ فَقَالَ إِنَّ اللَّهَ تَبَارَكَتْ أَسْمَاؤُهُ الَّتِي يُدْعَا بِهَا وَ تَعَالَى فِي عُلُوِّ كُنْهِهِ وَاحِدٌ تَوَحَّدَ بِالتَّوْحِيدِ فِي تَوَحُّدِهِ ثُمَّ أَجْرَاهُ عَلَى خَلْقِهِ فَهُوَ وَاحِدٌ صَمَدٌ قُدُّوسٌ يَعْبُدُهُ كُلُّ شَيْ‏ءٍ وَ يَصْمُدُ إِلَيْهِ كُلُّ شَيْ‏ءٍ وَ وَسِعَ كُلَّ شَيْ‏ءٍ عِلْماً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Al Hassan Bin Al Sarry, from Jabir Bin Yazeed Al Ju’fy who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about something from the <span class=\"iTxt\">Tawheed</span> (Oneness). So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup>, Blessed are His<sup>azwj</sup> Names which He<sup>azwj</sup> is called with, and Exalted is He<sup>azwj</sup>, Lofty is His<sup>azwj</sup> Being. He<sup>azwj</sup> is Unique by the Oneness in His<sup>azwj</sup> Uniqueness. Then Flowed it upon His<sup>azwj</sup> creatures. So He<sup>azwj</sup> is One, <span class=\"iTxt\">Samad</span>, Holy. Everything worships Him<sup>azwj</sup> and turns towards Him<sup>azwj</sup>, and He<sup>azwj</sup> has Capacious Knowledge of everything’."
          ],
          "en.sarwar": [
            " 2. A group of our people has narrated from Ahmad ibn abu ‘Abdallah from Muhammad ibn ‘Isa from Yunus ibn ‘Abd al-Rahman from al-Hassan ibn al-Sari from Jabir ibn Yazid al-Ju‘fi who has said the following. “I asked Imam abu Ja‘far (a.s.) a few things about the Oneness of Allah. The Imam replied, “Allah, Holy are Whose names, with which He is mentioned is Exalted and Most High in His Own-self. He is One. In Oneness He is the One and only in Oneness. He then made His creatures to know Him as the only One. He is One, Self-sufficient and the Holy. All things worship Him and He has the knowledge of all things.” Al-Kulayni has said that this is the correct meaning of al-Samad but not what al-Mushabbihah (people who consider Allah similar to certain things) believe. Al-Samad literally means solid as opposed to hallow which applies only to physical objects. Allah, the Most High, is far above such attributes. Had such attribute applied to Allah, the Most High, it would have contradicted with Allah’s statement that says, “There is nothing similar to Him.” In the Ahadith of the scholar, the Imam (a.s.) al-Samad refers to a master whom people consider a recourse or stronghold and such meaning is close to Allah’s words, “There is nothing similar to Him.” <a href=\"/#/books/quran:42#h11\">[42:11]</a> An example of such usage is what abu Talib had expressed in praise of the holy Prophet (s.a.) during his performing Hajj in throwing pebbles onto the pillars of stones that symbolically stand for Satan. He has used the word al-Samad to mean aiming. An other example is found in the expression of ibn Zabarqan, “Mr Rahibah is but a master and a (al-Samad) recourse.” One more example can be found in the expression of Shaddad ibn Mu‘awiyah about Kudhayfah ibn Badr, “Hold it O Hudhayfa, you are a master, ( al-Samad) recourse.” There are many such examples in normal usage. Allah, the Majestic, the Most High, the Master and the Recourse to Who all man and Jinn turn for help in their difficulties and from Him they expect relief."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:18",
  "kind": "verse_list"
}