{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:1:3", "titles": {"ar": "كِتَابُ التَّوْحِيدِ", "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"}}, {"indexed_titles": {"en": "Chapter 19"}, "path": "/books/al-kafi:1:3:19", "titles": {"ar": "بَابُ الْحَرَكَةِ وَ الِانْتِقَالِ", "en": "Chapter 19 – The Motion and the Transformation (Change of state to a state)"}}], "index": 42, "local_index": 19, "part_type": "Chapter", "path": "/books/al-kafi:1:3:19", "titles": {"ar": "بَابُ الْحَرَكَةِ وَ الِانْتِقَالِ", "en": "Chapter 19 – The Motion and the Transformation (Change of state to a state)"}, "verse_count": 10, "verse_start_index": 323, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 324, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:3:19:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ أَبِي</span> عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ الْبَرْمَكِيِّ عَنْ عَلِيِّ بْنِ عَبَّاسٍ الْخَرَاذِينِيِّ عَنِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ يَعْقُوبَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ ذُكِرَ عِنْدَهُ قَوْمٌ يَزْعُمُونَ أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَنْزِلُ إِلَى السَّمَاءِ الدُّنْيَا ", "فَقَالَ إِنَّ اللَّهَ لَا يَنْزِلُ وَ لَا يَحْتَاجُ إِلَى أَنْ يَنْزِلَ إِنَّمَا مَنْظَرُهُ فِي الْقُرْبِ وَ الْبُعْدِ سَوَاءٌ لَمْ يَبْعُدْ مِنْهُ قَرِيبٌ وَ لَمْ يَقْرُبْ مِنْهُ بَعِيدٌ وَ لَمْ يَحْتَجْ إِلَى شَيْ‏ءٍ بَلْ يُحْتَاجُ إِلَيْهِ وَ هُوَ ذُو الطَّوْلِ لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ", "أَمَّا قَوْلُ الْوَاصِفِينَ إِنَّهُ يَنْزِلُ تَبَارَكَ وَ تَعَالَى فَإِنَّمَا يَقُولُ ذَلِكَ مَنْ يَنْسُبُهُ إِلَى نَقْصٍ أَوْ زِيَادَةٍ وَ كُلُّ مُتَحَرِّكٍ مُحْتَاجٌ إِلَى مَنْ يُحَرِّكُهُ أَوْ يَتَحَرَّكُ بِهِ فَمَنْ ظَنَّ بِاللَّهِ الظُّنُونَ هَلَكَ ", "فَاحْذَرُوا فِي صِفَاتِهِ مِنْ أَنْ تَقِفُوا لَهُ عَلَى حَدٍّ تَحُدُّونَهُ بِنَقْصٍ أَوْ زِيَادَةٍ أَوْ تَحْرِيكٍ أَوْ تَحَرُّكٍ أَوْ زَوَالٍ أَوِ اسْتِنْزَالٍ أَوْ نُهُوضٍ أَوْ قُعُودٍ فَإِنَّ اللَّهَ جَلَّ وَ عَزَّ عَنْ صِفَةِ الْوَاصِفِينَ وَ نَعْتِ النَّاعِتِينَ وَ تَوَهُّمِ الْمُتَوَهِّمِينَ وَ تَوَكَّلْ عَلَى الْعَزِيزِ الرَّحِيمِ الَّذِي يَرَاكَ حِينَ تَقُومُ وَ تَقَلُّبَكَ فِي السَّاجِدِينَ ."], "translations": {"en.hubeali": ["Muhammad Bin Abu Abdullah, from Muhammad Bin Ismail Al Barmakky, from Ali Bin Abbas Al Kharaziny, from Al Hassan Bin Rashid, from Yaqoub Bin Ja’far Al Ja’fary, ", "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), said, ‘It was mentioned in his<sup>asws</sup> presence that a group of people are claiming that Allah<sup>azwj</sup> Blessed and High<sup>azwj</sup> Descends to the sky of the earth’. ", "So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> does not descend, nor is He<sup>azwj</sup> needy to that He<sup>azwj</sup> should descend. But rather His<sup>azwj</sup> Viewing regarding the near and the far is the same. A close by (thing) is not far from Him<sup>azwj</sup>, nor is a remote (thing) close to Him, and He<sup>azwj</sup> is not needy to anything, but He<sup>azwj</sup> is what (things) are needy to. He<sup>azwj</sup> is with the Power. There is no god except Him<sup>azwj</sup>, the Mighty, the Wise’. ", "As for the words of the describers, that He<sup>azwj</sup> the Blessed and High Descends, so rather they are saying that for the one who is linked to the decrease of increase, and every mover is needy to the one who moves it, or moves with it. So the one who thinks of Allah<sup>azwj</sup> with the conjectures is destroyed. ", "Therefore, be cautions with regards to His<sup>azwj</sup> Attributes from that you should be pausing to Him<sup>azwj</sup> upon a limitation, limiting Him<sup>azwj</sup> by a decrease or an increase, or moving or being moved, or decline, or descent, or advancement, or failure, for Allah<sup>azwj</sup> is more Majestic and Mightier than the description of the describers, and characteristics of the characterisers, and the imaginations of the imaginers; and rely upon the Mighty, the Wise who Sees you when you are standing (for the <span class=\"iTxt\">Salat</span>), and your turnings among the prostrators’."]}}, {"index": 325, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:3:19:2", "text": ["وَ عَنْهُ رَفَعَهُ عَنِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ يَعْقُوبَ بْنِ جَعْفَرٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) أَنَّهُ قَالَ لَا أَقُولُ إِنَّهُ قَائِمٌ فَأُزِيلُهُ عَنْ مَكَانِهِ وَ لَا أَحُدُّهُ بِمَكَانٍ يَكُونُ فِيهِ وَ لَا أَحُدُّهُ أَنْ يَتَحَرَّكَ فِي شَيْ‏ءٍ مِنَ الْأَرْكَانِ وَ الْجَوَارِحِ وَ لَا أَحُدُّهُ بِلَفْظِ شَقِّ فَمٍ وَ لَكِنْ كَمَا قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى كُنْ فَيَكُونُ بِمَشِيئَتِهِ مِنْ غَيْرِ تَرَدُّدٍ فِي نَفْسٍ صَمَداً فَرْداً لَمْ يَحْتَجْ إِلَى شَرِيكٍ يَذْكُرُ لَهُ مُلْكَهُ وَ لَا يَفْتَحُ لَهُ أَبْوَابَ عِلْمِهِ ."], "translations": {"en.hubeali": ["And from him, from Al Hassan Bin Rashid, from Yaqoub Bin Ja’far, ", "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup> that he<sup>asws</sup> said: ‘I<sup>asws</sup> am not saying that He<sup>azwj</sup> is Standing, So I<sup>asws</sup> decline Him<sup>azwj</sup> from His<sup>azwj</sup> place, nor am I<sup>asws</sup> limiting Him<sup>azwj</sup> by a place for Him<sup>azwj</sup> to be in, nor am I<sup>asws</sup> limiting Him<sup>azwj</sup> that He<sup>azwj</sup> moves into something from the elements and the body parts, nor am I limiting Him<sup>azwj</sup> by words piercing a mouth, but just as Allah<sup>azwj</sup> Blessed and High Says: “Be!”, so it comes into being by His<sup>azwj</sup> Desire, from without a hesitation from Himself<sup>azwj</sup>. He<sup>azwj</sup> is Samad, Individual, not needy to an associate to mention His<sup>azwj</sup> Kingdom to Him<sup>azwj</sup> not to open for Him<sup>azwj</sup> the doors of His<sup>azwj</sup> Knowledge’."]}}, {"index": 326, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:3:19:3", "text": ["وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ عَنْ عَمْرِو بْنِ مُحَمَّدٍ عَنْ عِيسَى بْنِ يُونُسَ قَالَ قَالَ ابْنُ أَبِي الْعَوْجَاءِ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي بَعْضِ مَا كَانَ يُحَاوِرُهُ ذَكَرْتَ اللَّهَ فَأَحَلْتَ عَلَى غَائِبٍ فَقَالَ أَبُو عَبْدِ اللَّهِ وَيْلَكَ كَيْفَ يَكُونُ غَائِباً مَنْ هُوَ مَعَ خَلْقِهِ شَاهِدٌ وَ إِلَيْهِمْ أَقْرَبُ مِنْ حَبْلِ الْوَرِيدِ يَسْمَعُ كَلَامَهُمْ وَ يَرَى أَشْخَاصَهُمْ وَ يَعْلَمُ أَسْرَارَهُمْ ", "فَقَالَ ابْنُ أَبِي الْعَوْجَاءِ أَ هُوَ فِي كُلِّ مَكَانٍ أَ لَيْسَ إِذَا كَانَ فِي السَّمَاءِ كَيْفَ يَكُونُ فِي الْأَرْضِ وَ إِذَا كَانَ فِي الْأَرْضِ كَيْفَ يَكُونُ فِي السَّمَاءِ ", "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّمَا وَصَفْتَ الْمَخْلُوقَ الَّذِي إِذَا انْتَقَلَ عَنْ مَكَانٍ اشْتَغَلَ بِهِ مَكَانٌ وَ خَلَا مِنْهُ مَكَانٌ فَلَا يَدْرِي فِي الْمَكَانِ الَّذِي صَارَ إِلَيْهِ مَا يَحْدُثُ فِي الْمَكَانِ الَّذِي كَانَ فِيهِ فَأَمَّا اللَّهُ الْعَظِيمُ الشَّأْنِ الْمَلِكُ الدَّيَّانُ فَلَا يَخْلُو مِنْهُ مَكَانٌ وَ لَا يَشْتَغِلُ بِهِ مَكَانٌ وَ لَا يَكُونُ إِلَى مَكَانٍ أَقْرَبَ مِنْهُ إِلَى مَكَانٍ ."], "translations": {"en.hubeali": ["And from him, from Muhammad Bin Abu Abdullah, from Muhammad Bin Ismail, from Dawood Bin Abdullah, from Amro Bin Muhammad, from Isa Bin Yunus who said, ", "‘Ibn Abu Al-Awja’a said to Abu Abdullah<sup>asws</sup> in what was one of his dialogues with him<sup>asws</sup>, ‘You<sup>asws</sup> mentioned Allah<sup>azwj</sup>, so you<sup>asws</sup> referred to a Hidden’. So Abu Abdullah<sup>asws</sup> said: ‘Woe be unto you<sup>asws</sup>! How can He<sup>azwj</sup> happen to be hidden, the One<sup>azwj</sup> Who is with His<sup>azwj</sup> creatures as a Witness, and is closer to them than the jugular vein? He<sup>azwj</sup> Hears their speech and Sees their persons, and Knows their secrets?’ ", "So Ibn Abu Al-Awja’a said, ‘Is He<sup>azwj</sup> is in every place? Is it not so that if He<sup>azwj</sup> was in the sky, how could He<sup>azwj</sup> happen to be in the earth, and when He<sup>azwj</sup> was in the earth, how could He<sup>azwj</sup> happen to be in the sky?’ ", "So Abu Abdullah<sup>asws</sup> said: ‘But rather, you are describing the created being who, when he transfers from a place, a place is occupied by him and a space is empty from him, so he does not know (when he) is in the place in which he came to be in, what occurs in the place which he was in. But, as for Allah<sup>azwj</sup>, the Magnificent of Glory, the King, the Judge. So, neither is a place empty from Him<sup>azwj</sup> nor is a space occupied by Him<sup>azwj</sup>, nor does He<sup>azwj</sup> happen to be nearer to a place than to a (another) place’."]}}, {"index": 327, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:3:19:4", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ عَلِيِّ بْنِ مُحَمَّدٍ ( عليه السلام ) جَعَلَنِيَ اللَّهُ فِدَاكَ يَا سَيِّدِي قَدْ رُوِيَ لَنَا أَنَّ اللَّهَ فِي مَوْضِعٍ دُونَ مَوْضِعٍ عَلَى الْعَرْشِ اسْتَوَى وَ أَنَّهُ يَنْزِلُ كُلَّ لَيْلَةٍ فِي النِّصْفِ الْأَخِيرِ مِنَ اللَّيْلِ إِلَى السَّمَاءِ الدُّنْيَا وَ رُوِيَ أَنَّهُ يَنْزِلُ عَشِيَّةَ عَرَفَةَ ثُمَّ يَرْجِعُ إِلَى مَوْضِعِهِ ", "فَقَالَ بَعْضُ مَوَالِيكَ فِي ذَلِكَ إِذَا كَانَ فِي مَوْضِعٍ دُونَ مَوْضِعٍ فَقَدْ يُلَاقِيهِ الْهَوَاءُ وَ يَتَكَنَّفُ عَلَيْهِ وَ الْهَوَاءُ جِسْمٌ رَقِيقٌ يَتَكَنَّفُ عَلَى كُلِّ شَيْ‏ءٍ بِقَدْرِهِ فَكَيْفَ يَتَكَنَّفُ عَلَيْهِ جَلَّ ثَنَاؤُهُ عَلَى هَذَا الْمِثَالِ ", "فَوَقَّعَ ( عليه السلام ) عِلْمُ ذَلِكَ عِنْدَهُ وَ هُوَ الْمُقَدِّرُ لَهُ بِمَا هُوَ أَحْسَنُ تَقْدِيراً وَ اعْلَمْ أَنَّهُ إِذَا كَانَ فِي السَّمَاءِ الدُّنْيَا فَهُوَ كَمَا هُوَ عَلَى الْعَرْشِ وَ الْأَشْيَاءُ كُلُّهَا لَهُ سَوَاءٌ عِلْماً وَ قُدْرَةً وَ مُلْكاً وَ إِحَاطَةً .", "وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ الْكُوفِيِّ عَنْ مُحَمَّدِ بْنِ عِيسَى مِثْلَهُ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Isa who said, ", "‘I wrote to Abu Al-Hassan Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! O my master<sup>asws</sup>! It has been reported to us that Allah<sup>azwj</sup> is in a place besides a (another) place, established upon the Throne, and He<sup>azwj</sup> Descends every night during the latter half from the night to the sky of the world, and it is reported that He<sup>azwj</sup> Descend on the evening of Arafaat, then He<sup>azwj</sup> Returns back to His<sup>azwj</sup> place’. ", "So, some of the ones in your<sup>asws</sup> Wilayah said with regards to that, ‘If it was so that He<sup>azwj</sup> was in a place besides a (another) place, so the atmosphere would have come across Him<sup>azwj</sup> and would surround upon him, and the atmosphere is a light body surrounding upon everything by its measurement. So how could it surround upon Him<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Laudation, upon this example?’", "So he<sup style=\"font-weight: normal\">asws</sup> signed: ‘The Knowledge of that is with Him<sup style=\"font-weight: normal\">azwj</sup>, and He<sup style=\"font-weight: normal\">azwj</sup> is the Evaluater for it with what is the best of the measurements, and know that when He<sup style=\"font-weight: normal\">azwj</sup> was in the sky of the world, so He<sup style=\"font-weight: normal\">azwj</sup> it just as He<sup style=\"font-weight: normal\">azwj</sup> is upon the Throne, and the thing, all of these are the same to Him<sup style=\"font-weight: normal\">azwj</sup> in Knowledge, and measurement, and domain, and control’. ", "<span style=\"font-size: small\">And from him, from Muhammad BinJa’far Al Kufy, from Muhammad Bin Isa</span> – similar to it."]}}, {"part_type": "Heading", "text": ["فِي قَوْلِهِ تَعَالَى ما يَكُونُ مِنْ نَجْوى ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ."], "translations": {"en.hubeali": ["Regarding the Words of the Exalted [58:7] Nowhere is there a secret counsel occurring between three persons but He is the fourth of them"]}}, {"index": 328, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:3:19:5", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َنْهُ عَنْ عِدَّةٍ</span> مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى ما يَكُونُ مِنْ نَجْوى ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ وَ لا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ ", "فَقَالَ هُوَ وَاحِدٌ وَاحِدِيُّ الذَّاتِ بَائِنٌ مِنْ خَلْقِهِ وَ بِذَاكَ وَصَفَ نَفْسَهُ وَ هُوَ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ بِالْإِشْرَافِ وَ الْإِحَاطَةِ وَ الْقُدْرَةِ لا يَعْزُبُ عَنْهُ مِثْقالُ ذَرَّةٍ فِي السَّماواتِ وَ لا فِي الْأَرْضِ وَ لا أَصْغَرُ مِنْ ذلِكَ وَ لا أَكْبَرُ بِالْإِحَاطَةِ وَ الْعِلْمِ لَا بِالذَّاتِ لِأَنَّ الْأَمَاكِنَ مَحْدُودَةٌ تَحْوِيهَا حُدُودٌ أَرْبَعَةٌ فَإِذَا كَانَ بِالذَّاتِ لَزِمَهَا الْحَوَايَةُ ."], "translations": {"en.hubeali": ["From him, from a number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Yaqoub Bin Yazeed, from Ibn Abu Umeyr, from Ibn Azina, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[58:7] Nowhere is there a secret counsel occurring between three persons but He is the fourth of them, nor (between) five but He is the sixth of them</span>.", "So he<sup>asws</sup> said: ‘He<sup>azwj</sup> is the One, One of the Self separate from His<sup>azwj</sup> creatures, and with that He<sup>azwj</sup> Described Himself<sup>azwj</sup>, and He<sup>azwj</sup> Encompasses everything by the Supervision, and the Control, and the Power. Nothing escapes from Him<sup>azwj</sup>, (even if it is) an atom’s weight in the skies nor in the earth, nor anything smaller than that, nor bigger, due to the Control. And the Knowledge is not with the Self because the places are limited by the extent of its four limits. So when that was with the Self, the calling would necessitate it’."]}}, {"part_type": "Heading", "text": ["فِي قَوْلِهِ الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى"], "translations": {"en.hubeali": ["Regarding the Words of the [20:5] The Beneficent is Even upon the Throne"]}}, {"index": 329, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:3:19:6", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُوسَى الْخَشَّابِ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى فَقَالَ اسْتَوَى عَلَى كُلِّ شَيْ‏ءٍ فَلَيْسَ شَيْ‏ءٌ أَقْرَبَ إِلَيْهِ مِنْ شَيْ‏ءٍ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Al Hassan Bin Musa Al Khashaab, from one of his men, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> that he<sup>asws</sup> was asked about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[20:5] The Beneficent is Even upon the Throne</span>. So he<sup>asws</sup> said: ‘Even upon everything. So there isn’t anything more closer to Him<sup>azwj</sup> than a (another) thing’."]}}, {"index": 330, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:3:19:7", "text": ["وَ بِهَذَا الْإِسْنَادِ عَنْ سَهْلٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ مَارِدٍ أَنَّ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) سُئِلَ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى فَقَالَ اسْتَوَى مِنْ كُلِّ شَيْ‏ءٍ فَلَيْسَ شَيْ‏ءٌ أَقْرَبَ إِلَيْهِ مِنْ شَيْ‏ءٍ ."], "translations": {"en.hubeali": ["And by this chain, from Sahl, from Al Hassan Bin Mahboub, from Muhamad Bin Marid, ", "‘Abu Abdullah<sup>asws</sup> was asked about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[20:5] The Beneficent is Even upon the Throne</span>. So he<sup>asws</sup> said: ‘Even from everything. So there isn’t anything closer to Him<sup>azwj</sup> than a (another) thing’."]}}, {"index": 331, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:3:19:8", "text": ["وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ تَعَالَى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى فَقَالَ اسْتَوَى فِي كُلِّ شَيْ‏ءٍ فَلَيْسَ شَيْ‏ءٌ أَقْرَبَ إِلَيْهِ مِنْ شَيْ‏ءٍ لَمْ يَبْعُدْ مِنْهُ بَعِيدٌ وَ لَمْ يَقْرُبْ مِنْهُ قَرِيبٌ اسْتَوَى فِي كُلِّ شَيْ‏ءٍ ."], "translations": {"en.hubeali": ["And from him, from Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Abdul Rahman Bin Al Hajjaj who said, ", "‘Abu Abdullah<sup>asws</sup> was asked about the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\">[20:5] The Beneficent is Even upon the Throne</span>. So he<sup>asws</sup> said: ‘Even with regards to everything. So there isn’t anything closer to Him<sup>azwj</sup> than a (another) thing. The remote is not far from Him<sup>azwj</sup>, and the close-by is not closer to Him<sup>azwj</sup>. He<sup>azwj</sup> is Even with regards to everything’."]}}, {"index": 332, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:1:3:19:9", "text": ["وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ زَعَمَ أَنَّ اللَّهَ مِنْ شَيْ‏ءٍ أَوْ فِي شَيْ‏ءٍ أَوْ عَلَى شَيْ‏ءٍ فَقَدْ كَفَرَ قُلْتُ فَسِّرْ لِي قَالَ أَعْنِي بِالْحَوَايَةِ مِنَ الشَّيْ‏ءِ لَهُ أَوْ بِإِمْسَاكٍ لَهُ أَوْ مِنْ شَيْ‏ءٍ سَبَقَهُ ", "وَ فِي رِوَايَةٍ أُخْرَى مَنْ زَعَمَ أَنَّ اللَّهَ مِنْ شَيْ‏ءٍ فَقَدْ جَعَلَهُ مُحْدَثاً وَ مَنْ زَعَمَ أَنَّهُ فِي شَيْ‏ءٍ فَقَدْ جَعَلَهُ مَحْصُوراً وَ مَنْ زَعَمَ أَنَّهُ عَلَى شَيْ‏ءٍ فَقَدْ جَعَلَهُ مَحْمُولًا ."], "translations": {"en.hubeali": ["And from him, from Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Aasim Bin Humeyd, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who claims that Allah<sup>azwj</sup> is from a thing, or in a thing, or upon a thing, so he has Blasphemed’. I said, ‘Explain it to me’. He<sup>asws</sup> said: ‘I<sup>asws</sup> mean by the emerging from the thing for Him<sup>azwj</sup>, of by the attachment to it, or from a thing preceding Him<sup>azwj</sup>’. ", "And in another report, ‘(He<sup>asws</sup> said): ‘The one who claims that Allah<sup>azwj</sup> is from a thing, so he has Made Him<sup>azwj</sup> as an occurrence; and the one who claims that He<sup>azwj</sup> is in a thing, so he has Made Him<sup>azwj</sup> as contained; and the one who claims that He<sup>azwj</sup> is upon a thing, so he has Made Him<sup>azwj</sup> to be a Carried One’."]}}, {"part_type": "Heading", "text": ["فِي قَوْلِهِ تَعَالَى وَ هُوَ الَّذِي فِي السَّماءِ إِلهٌ وَ فِي الْأَرْضِ إِلهٌ"], "translations": {"en.hubeali": ["Regarding the Words of the Exalted [43:84] And He is That Who is God in the skies and God in the earth"]}}, {"index": 333, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:1:3:19:10", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ قَالَ أَبُو شَاكِرٍ الدَّيَصَانِيُّ إِنَّ فِي الْقُرْآنِ آيَةً هِيَ قَوْلُنَا قُلْتُ مَا هِيَ فَقَالَ وَ هُوَ الَّذِي فِي السَّماءِ إِلهٌ وَ فِي الْأَرْضِ إِلهٌ فَلَمْ أَدْرِ بِمَا أُجِيبُهُ ", "فَحَجَجْتُ فَخَبَّرْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ هَذَا كَلَامُ زِنْدِيقٍ خَبِيثٍ إِذَا رَجَعْتَ إِلَيْهِ فَقُلْ لَهُ مَا اسْمُكَ بِالْكُوفَةِ فَإِنَّهُ يَقُولُ فُلَانٌ فَقُلْ لَهُ مَا اسْمُكَ بِالْبَصْرَةِ فَإِنَّهُ يَقُولُ فُلَانٌ فَقُلْ كَذَلِكَ اللَّهُ رَبُّنَا فِي السَّمَاءِ إِلَهٌ وَ فِي الْأَرْضِ إِلَهٌ وَ فِي الْبِحَارِ إِلَهٌ وَ فِي الْقِفَارِ إِلَهٌ وَ فِي كُلِّ مَكَانٍ إِلَهٌ ", "قَالَ فَقَدِمْتُ فَأَتَيْتُ أَبَا شَاكِرٍ فَأَخْبَرْتُهُ فَقَالَ هَذِهِ نُقِلَتْ مِنَ الْحِجَازِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Abu Umeyr, from Hisham Bin Al Hakam who said, ", "‘Abu Shakir Al-Daysani said, ‘In the Quran there is a Verse which is our speech’. I said, ‘And what is it?’ So he said, ‘<span class=\"ibTxt\">[43:84] And He is That Who is God in the skies and God in the earth</span>’. So I did not know what to answer him with.", "So I went for Hajj and informed Abu Abdullah<sup>asws</sup>. So he<sup>asws</sup> said: ‘This is a speech of a wicked atheist. When you return to him, so say to him, ‘What is your name in Al-Kufa?’ So he would be saying, ‘So and so’. So say to him, ‘What is your name in Al-Basra?’ So he would be saying, ‘So and so’. So say, ‘Similar to that is Allah<sup>azwj</sup>, our Lord<sup>azwj</sup>, God<sup>azwj</sup> in the sky and God<sup>azwj</sup> in the earth, and God<sup>azwj</sup> in the oceans, and God<sup>azwj</sup> in the wilderness, and in every place, God<sup>azwj</sup>’. ", "He (the narrator) said, ‘So I proceeded and went over to Abu Shakir and informed him. So he said, ‘This has been transmitted from Al-Hijaz’."]}}]}, "index": "al-kafi:1:3:19", "kind": "verse_list"}