{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:1:3:19",
        "titles": {
          "ar": "بَابُ الْحَرَكَةِ وَ الِانْتِقَالِ",
          "en": "Chapter 19 – The Motion and the Transformation (Change of state to a state)"
        }
      }
    ],
    "index": 42,
    "local_index": 19,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:1:3:20",
        "titles": {
          "ar": "بَابُ الْعَرْشِ وَ الْكُرْسِيِّ",
          "en": "Chapter 20 – The Throne (الْعَرْشِ ) and the Chair (الْكُرْسِيِّ)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:1:3:18",
        "titles": {
          "ar": "بَابُ تَأْوِيلِ الصَّمَدِ",
          "en": "Chapter 18 – Explanation of Al-Samad"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:19",
    "titles": {
      "ar": "بَابُ الْحَرَكَةِ وَ الِانْتِقَالِ",
      "en": "Chapter 19 – The Motion and the Transformation (Change of state to a state)"
    },
    "verse_count": 10,
    "verse_start_index": 323,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (63/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 324,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/283",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/437",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ الْبَرْمَكِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/438",
              "text": "عَلِيِّ بْنِ عَبَّاسٍ الْخَرَاذِينِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/439",
              "text": "الْحَسَنِ بْنِ رَاشِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/440",
              "text": "يَعْقُوبَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/441",
              "text": "أَبِي إِبْرَاهِيمَ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ الْبَرْمَكِيِّ عَنْ عَلِيِّ بْنِ عَبَّاسٍ الْخَرَاذِينِيِّ عَنِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ يَعْقُوبَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:19:1",
        "text": [
          " ذُكِرَ عِنْدَهُ قَوْمٌ يَزْعُمُونَ أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَنْزِلُ إِلَى السَّمَاءِ الدُّنْيَا ",
          "فَقَالَ إِنَّ اللَّهَ لَا يَنْزِلُ وَ لَا يَحْتَاجُ إِلَى أَنْ يَنْزِلَ إِنَّمَا مَنْظَرُهُ فِي الْقُرْبِ وَ الْبُعْدِ سَوَاءٌ لَمْ يَبْعُدْ مِنْهُ قَرِيبٌ وَ لَمْ يَقْرُبْ مِنْهُ بَعِيدٌ وَ لَمْ يَحْتَجْ إِلَى شَيْ‏ءٍ بَلْ يُحْتَاجُ إِلَيْهِ وَ هُوَ ذُو الطَّوْلِ لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ",
          "أَمَّا قَوْلُ الْوَاصِفِينَ إِنَّهُ يَنْزِلُ تَبَارَكَ وَ تَعَالَى فَإِنَّمَا يَقُولُ ذَلِكَ مَنْ يَنْسُبُهُ إِلَى نَقْصٍ أَوْ زِيَادَةٍ وَ كُلُّ مُتَحَرِّكٍ مُحْتَاجٌ إِلَى مَنْ يُحَرِّكُهُ أَوْ يَتَحَرَّكُ بِهِ فَمَنْ ظَنَّ بِاللَّهِ الظُّنُونَ هَلَكَ ",
          "فَاحْذَرُوا فِي صِفَاتِهِ مِنْ أَنْ تَقِفُوا لَهُ عَلَى حَدٍّ تَحُدُّونَهُ بِنَقْصٍ أَوْ زِيَادَةٍ أَوْ تَحْرِيكٍ أَوْ تَحَرُّكٍ أَوْ زَوَالٍ أَوِ اسْتِنْزَالٍ أَوْ نُهُوضٍ أَوْ قُعُودٍ فَإِنَّ اللَّهَ جَلَّ وَ عَزَّ عَنْ صِفَةِ الْوَاصِفِينَ وَ نَعْتِ النَّاعِتِينَ وَ تَوَهُّمِ الْمُتَوَهِّمِينَ وَ تَوَكَّلْ عَلَى الْعَزِيزِ الرَّحِيمِ الَّذِي يَرَاكَ حِينَ تَقُومُ وَ تَقَلُّبَكَ فِي السَّاجِدِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Muhammad Bin Ismail Al Barmakky, from Ali Bin Abbas Al Kharaziny, from Al Hassan Bin Rashid, from Yaqoub Bin Ja’far Al Ja’fary, ",
            "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), said, ‘It was mentioned in his<sup>asws</sup> presence that a group of people are claiming that Allah<sup>azwj</sup> Blessed and High<sup>azwj</sup> Descends to the sky of the earth’. ",
            "So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> does not descend, nor is He<sup>azwj</sup> needy to that He<sup>azwj</sup> should descend. But rather His<sup>azwj</sup> Viewing regarding the near and the far is the same. A close by (thing) is not far from Him<sup>azwj</sup>, nor is a remote (thing) close to Him, and He<sup>azwj</sup> is not needy to anything, but He<sup>azwj</sup> is what (things) are needy to. He<sup>azwj</sup> is with the Power. There is no god except Him<sup>azwj</sup>, the Mighty, the Wise’. ",
            "As for the words of the describers, that He<sup>azwj</sup> the Blessed and High Descends, so rather they are saying that for the one who is linked to the decrease of increase, and every mover is needy to the one who moves it, or moves with it. So the one who thinks of Allah<sup>azwj</sup> with the conjectures is destroyed. ",
            "Therefore, be cautions with regards to His<sup>azwj</sup> Attributes from that you should be pausing to Him<sup>azwj</sup> upon a limitation, limiting Him<sup>azwj</sup> by a decrease or an increase, or moving or being moved, or decline, or descent, or advancement, or failure, for Allah<sup>azwj</sup> is more Majestic and Mightier than the description of the describers, and characteristics of the characterisers, and the imaginations of the imaginers; and rely upon the Mighty, the Wise who Sees you when you are standing (for the <span class=\"iTxt\">Salat</span>), and your turnings among the prostrators’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn abu ‘Abdallah has narrated from Muhammad ibn Isma‘il al-Barmaki from Ali ibn ‘Abbass al-Kharazini from al-Hassan ibn Rashid from Ya‘qub ibn Ja‘far al-Ja‘fari, from abu Ibrahim (a.s.) Who has said the following. “A people was mentioned, before the Imam (a.s.), who believed that Allah, the Most Holy, the Most High, comes down to the sky above the earth.” The Imam (a.s.) said, “Allah does not come down and He does not need to come down. His sight for near and far is the same. Near does not become far for Him and far does not become near for Him. He does not become needy for any thing but all things need Him and He is generous. There is no Lord except Him. He is Most Majestic and All-wise. The statement that says Allah, the Most Holy, the Most High, comes down to the sky over the earth can only come from those who consider Him to decrease or increase (in size). Besides, all moving objects need something to move it or move because of it. Whoever thinks of Allah as such has caused his own destruction. Be very careful about the attributes of Allah to have a belief about them that would limit Him through increase or reduction, moving or being moved, removal or His coming down, standing up or sitting down. Allah, the Most Holy, the Most High, is far from being described by those who would like to describe Him or being characterized by those who do so or pictured in imagination. Have trust in Allah, the Most Majestic, the Most Merciful Who sees you when you get up and when you change positions during prostration.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/65)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 325,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/442",
              "text": "عَنِ الْحَسَنِ بْنِ رَاشِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/443",
              "text": "يَعْقُوبَ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/441",
              "text": "أَبِي إِبْرَاهِيمَ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "وَ عَنْهُ رَفَعَهُ عَنِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ يَعْقُوبَ بْنِ جَعْفَرٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:19:2",
        "text": [
          "هُ قَالَ لَا أَقُولُ إِنَّهُ قَائِمٌ فَأُزِيلُهُ عَنْ مَكَانِهِ وَ لَا أَحُدُّهُ بِمَكَانٍ يَكُونُ فِيهِ وَ لَا أَحُدُّهُ أَنْ يَتَحَرَّكَ فِي شَيْ‏ءٍ مِنَ الْأَرْكَانِ وَ الْجَوَارِحِ وَ لَا أَحُدُّهُ بِلَفْظِ شَقِّ فَمٍ وَ لَكِنْ كَمَا قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى كُنْ فَيَكُونُ بِمَشِيئَتِهِ مِنْ غَيْرِ تَرَدُّدٍ فِي نَفْسٍ صَمَداً فَرْداً لَمْ يَحْتَجْ إِلَى شَرِيكٍ يَذْكُرُ لَهُ مُلْكَهُ وَ لَا يَفْتَحُ لَهُ أَبْوَابَ عِلْمِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Al Hassan Bin Rashid, from Yaqoub Bin Ja’far, ",
            "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup> that he<sup>asws</sup> said: ‘I<sup>asws</sup> am not saying that He<sup>azwj</sup> is Standing, So I<sup>asws</sup> decline Him<sup>azwj</sup> from His<sup>azwj</sup> place, nor am I<sup>asws</sup> limiting Him<sup>azwj</sup> by a place for Him<sup>azwj</sup> to be in, nor am I<sup>asws</sup> limiting Him<sup>azwj</sup> that He<sup>azwj</sup> moves into something from the elements and the body parts, nor am I limiting Him<sup>azwj</sup> by words piercing a mouth, but just as Allah<sup>azwj</sup> Blessed and High Says: “Be!”, so it comes into being by His<sup>azwj</sup> Desire, from without a hesitation from Himself<sup>azwj</sup>. He<sup>azwj</sup> is Samad, Individual, not needy to an associate to mention His<sup>azwj</sup> Kingdom to Him<sup>azwj</sup> not to open for Him<sup>azwj</sup> the doors of His<sup>azwj</sup> Knowledge’."
          ],
          "en.sarwar": [
            " 2. It is narrated from him (the narrator of the above Hadith), in a marfu‘ manner, from al-Hassan ibn Rashid from Ya‘qub ibn Ja‘far from abu Ibrahim (a.s.) who has said the following. “I do not say that he is standing so I would remove Him from His place. I do not limit Him in a place. I do not limit Him by His moving in something with key elements of the body or body parts. I do not limit Him by ascribing the movements of mouth or tongue. The truth is what Allah, the Most Holy, the Most High, has said, Be and it comes into existence through His will without any planning in a soul. He is Self-sufficient and all alone. He does not need any partner who would speak of His kingdom or open the doors of His knowledge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/66)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 326,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/444",
              "text": "مُحَمَّدِ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/445",
              "text": "دَاوُدَ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/446",
              "text": "عَمْرِو بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/447",
              "text": "عِيسَى بْنِ يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ عَنْ عَمْرِو بْنِ مُحَمَّدٍ عَنْ عِيسَى بْنِ يُونُسَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:19:3",
        "text": [
          " قَالَ ابْنُ أَبِي الْعَوْجَاءِ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي بَعْضِ مَا كَانَ يُحَاوِرُهُ ذَكَرْتَ اللَّهَ فَأَحَلْتَ عَلَى غَائِبٍ فَقَالَ أَبُو عَبْدِ اللَّهِ وَيْلَكَ كَيْفَ يَكُونُ غَائِباً مَنْ هُوَ مَعَ خَلْقِهِ شَاهِدٌ وَ إِلَيْهِمْ أَقْرَبُ مِنْ حَبْلِ الْوَرِيدِ يَسْمَعُ كَلَامَهُمْ وَ يَرَى أَشْخَاصَهُمْ وَ يَعْلَمُ أَسْرَارَهُمْ ",
          "فَقَالَ ابْنُ أَبِي الْعَوْجَاءِ أَ هُوَ فِي كُلِّ مَكَانٍ أَ لَيْسَ إِذَا كَانَ فِي السَّمَاءِ كَيْفَ يَكُونُ فِي الْأَرْضِ وَ إِذَا كَانَ فِي الْأَرْضِ كَيْفَ يَكُونُ فِي السَّمَاءِ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّمَا وَصَفْتَ الْمَخْلُوقَ الَّذِي إِذَا انْتَقَلَ عَنْ مَكَانٍ اشْتَغَلَ بِهِ مَكَانٌ وَ خَلَا مِنْهُ مَكَانٌ فَلَا يَدْرِي فِي الْمَكَانِ الَّذِي صَارَ إِلَيْهِ مَا يَحْدُثُ فِي الْمَكَانِ الَّذِي كَانَ فِيهِ فَأَمَّا اللَّهُ الْعَظِيمُ الشَّأْنِ الْمَلِكُ الدَّيَّانُ فَلَا يَخْلُو مِنْهُ مَكَانٌ وَ لَا يَشْتَغِلُ بِهِ مَكَانٌ وَ لَا يَكُونُ إِلَى مَكَانٍ أَقْرَبَ مِنْهُ إِلَى مَكَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Muhammad Bin Abu Abdullah, from Muhammad Bin Ismail, from Dawood Bin Abdullah, from Amro Bin Muhammad, from Isa Bin Yunus who said, ",
            "‘Ibn Abu Al-Awja’a said to Abu Abdullah<sup>asws</sup> in what was one of his dialogues with him<sup>asws</sup>, ‘You<sup>asws</sup> mentioned Allah<sup>azwj</sup>, so you<sup>asws</sup> referred to a Hidden’. So Abu Abdullah<sup>asws</sup> said: ‘Woe be unto you<sup>asws</sup>! How can He<sup>azwj</sup> happen to be hidden, the One<sup>azwj</sup> Who is with His<sup>azwj</sup> creatures as a Witness, and is closer to them than the jugular vein? He<sup>azwj</sup> Hears their speech and Sees their persons, and Knows their secrets?’ ",
            "So Ibn Abu Al-Awja’a said, ‘Is He<sup>azwj</sup> is in every place? Is it not so that if He<sup>azwj</sup> was in the sky, how could He<sup>azwj</sup> happen to be in the earth, and when He<sup>azwj</sup> was in the earth, how could He<sup>azwj</sup> happen to be in the sky?’ ",
            "So Abu Abdullah<sup>asws</sup> said: ‘But rather, you are describing the created being who, when he transfers from a place, a place is occupied by him and a space is empty from him, so he does not know (when he) is in the place in which he came to be in, what occurs in the place which he was in. But, as for Allah<sup>azwj</sup>, the Magnificent of Glory, the King, the Judge. So, neither is a place empty from Him<sup>azwj</sup> nor is a space occupied by Him<sup>azwj</sup>, nor does He<sup>azwj</sup> happen to be nearer to a place than to a (another) place’."
          ],
          "en.sarwar": [
            " 3. It is narrated from him (the narrator of the above Hadith) from Muhammad ibn abu ‘Abdallah from Muhammad ibn Isma‘il from Dawud ibn ‘Abdallah from ‘Amr ibn Muhammad from ‘Isa ibn Yunus who has said the following. “Ibn abu al-‘Awja said to Imam abu ‘Abdallah (a.s.) in one of their conversations, ‘You spoke of Allah and referred to an unseen.’” The Imam (a.s.) said, “What you said is not proper. How would He be unseen when He is present with His creatures and is closer to them than their jugular vein. He hears their speeches, sees their persons and knows their secrets.” Ibn abu al-‘Awja then said, “Is He everywhere? If He is in the heavens, how can He, at the same time, be on earth and when He would be on earth then how can He be in the heavens at the same time.?” The Imam (a.s.) said, “You spoke only of a creature that with changing place any other place becomes occupied with it and another place is vacated from him and does not know what has happened to the place where he used to be. Allah’s position is great. He is the king Who has full account of all things. No place is without Him and He does not occupy any place. He is nearer to one place than the other place.”"
          ]
        }
      },
      {
        "index": 327,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:19:4",
        "relations": {
          "Mentions": [
            "/books/quran:58:7"
          ]
        },
        "text": [
          " كَتَبْتُ إِلَى أَبِي الْحَسَنِ عَلِيِّ بْنِ مُحَمَّدٍ ( عليه السلام ) جَعَلَنِيَ اللَّهُ فِدَاكَ يَا سَيِّدِي قَدْ رُوِيَ لَنَا أَنَّ اللَّهَ فِي مَوْضِعٍ دُونَ مَوْضِعٍ عَلَى الْعَرْشِ اسْتَوَى وَ أَنَّهُ يَنْزِلُ كُلَّ لَيْلَةٍ فِي النِّصْفِ الْأَخِيرِ مِنَ اللَّيْلِ إِلَى السَّمَاءِ الدُّنْيَا وَ رُوِيَ أَنَّهُ يَنْزِلُ عَشِيَّةَ عَرَفَةَ ثُمَّ يَرْجِعُ إِلَى مَوْضِعِهِ ",
          "فَقَالَ بَعْضُ مَوَالِيكَ فِي ذَلِكَ إِذَا كَانَ فِي مَوْضِعٍ دُونَ مَوْضِعٍ فَقَدْ يُلَاقِيهِ الْهَوَاءُ وَ يَتَكَنَّفُ عَلَيْهِ وَ الْهَوَاءُ جِسْمٌ رَقِيقٌ يَتَكَنَّفُ عَلَى كُلِّ شَيْ‏ءٍ بِقَدْرِهِ فَكَيْفَ يَتَكَنَّفُ عَلَيْهِ جَلَّ ثَنَاؤُهُ عَلَى هَذَا الْمِثَالِ ",
          "فَوَقَّعَ ( عليه السلام ) عِلْمُ ذَلِكَ عِنْدَهُ وَ هُوَ الْمُقَدِّرُ لَهُ بِمَا هُوَ أَحْسَنُ تَقْدِيراً وَ اعْلَمْ أَنَّهُ إِذَا كَانَ فِي السَّمَاءِ الدُّنْيَا فَهُوَ كَمَا هُوَ عَلَى الْعَرْشِ وَ الْأَشْيَاءُ كُلُّهَا لَهُ سَوَاءٌ عِلْماً وَ قُدْرَةً وَ مُلْكاً وَ إِحَاطَةً .",
          "وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ الْكُوفِيِّ عَنْ مُحَمَّدِ بْنِ عِيسَى مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Isa who said, ",
            "‘I wrote to Abu Al-Hassan Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! O my master<sup>asws</sup>! It has been reported to us that Allah<sup>azwj</sup> is in a place besides a (another) place, established upon the Throne, and He<sup>azwj</sup> Descends every night during the latter half from the night to the sky of the world, and it is reported that He<sup>azwj</sup> Descend on the evening of Arafaat, then He<sup>azwj</sup> Returns back to His<sup>azwj</sup> place’. ",
            "So, some of the ones in your<sup>asws</sup> Wilayah said with regards to that, ‘If it was so that He<sup>azwj</sup> was in a place besides a (another) place, so the atmosphere would have come across Him<sup>azwj</sup> and would surround upon him, and the atmosphere is a light body surrounding upon everything by its measurement. So how could it surround upon Him<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Laudation, upon this example?’",
            "So he<sup style=\"font-weight: normal\">asws</sup> signed: ‘The Knowledge of that is with Him<sup style=\"font-weight: normal\">azwj</sup>, and He<sup style=\"font-weight: normal\">azwj</sup> is the Evaluater for it with what is the best of the measurements, and know that when He<sup style=\"font-weight: normal\">azwj</sup> was in the sky of the world, so He<sup style=\"font-weight: normal\">azwj</sup> it just as He<sup style=\"font-weight: normal\">azwj</sup> is upon the Throne, and the thing, all of these are the same to Him<sup style=\"font-weight: normal\">azwj</sup> in Knowledge, and measurement, and domain, and control’. ",
            "<span style=\"font-size: small\">And from him, from Muhammad BinJa’far Al Kufy, from Muhammad Bin Isa</span> – similar to it."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa who has said the following. “I wrote to Imam abu al-Hassan, Ali ibn Muhammad (a.s.) to clarify a question. May Allah take my soul in your service, O my master, it is narrated to us that Allah is in one place and not in another place on ‘Arsh, (the Throne) resting. He comes down to the sky above the earth every night during the last half of the night. It is narrated that He comes down at the ninth evening of the month of Dhul Hajj and then He returns back to His place. Certain individuals among your friends have said that if He would be found in certain places and not in other places the air must have come in contact with Him and would surround Him because air is a thin form of body that surrounds everything proportionate to its size. How then the air would surround Allah, the Most Holy and the Most High, According to this assumption? The Imam replied in writing, “He has the knowledge of this. He is the best One in having the true measurements of all things. You must, However, note that His being in the sky over the earth is just as He on the Throne. All things to Him are the same in the matters of His knowledge and power, domination and control.” Muhammad ibn Ja‘far al-Kufi has narrated from Muhammad ibn ’Isa a similar Hadith About the words of Allah “There is not a single place wherein any secret counsel can take place between any three people without God being the fourth, . .” <a href=\"/#/books/quran:58#h7\">[58:7]</a>."
          ]
        }
      },
      {
        "part_type": "Heading",
        "relations": {
          "Mentions": [
            "/books/quran:58:7"
          ]
        },
        "text": [
          "فِي قَوْلِهِ تَعَالَى ما يَكُونُ مِنْ نَجْوى ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Regarding the Words of the Exalted <a href=\"/#/books/quran:58#h7\">[58:7]</a> Nowhere is there a secret counsel occurring between three persons but He is the fourth of them"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (67/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 328,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/448",
              "text": "عِدَّةٍ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/115",
              "text": "يَعْقُوبَ بْنِ يَزِيدَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/260",
              "text": "ابْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي قَوْلِ"
            }
          ],
          "text": "عَنْهُ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:19:5",
        "relations": {
          "Mentions": [
            "/books/quran:58:7",
            "/books/quran:20:5"
          ]
        },
        "text": [
          "هِ تَعَالَى ما يَكُونُ مِنْ نَجْوى ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ وَ لا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ ",
          "فَقَالَ هُوَ وَاحِدٌ وَاحِدِيُّ الذَّاتِ بَائِنٌ مِنْ خَلْقِهِ وَ بِذَاكَ وَصَفَ نَفْسَهُ وَ هُوَ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ بِالْإِشْرَافِ وَ الْإِحَاطَةِ وَ الْقُدْرَةِ لا يَعْزُبُ عَنْهُ مِثْقالُ ذَرَّةٍ فِي السَّماواتِ وَ لا فِي الْأَرْضِ وَ لا أَصْغَرُ مِنْ ذلِكَ وَ لا أَكْبَرُ بِالْإِحَاطَةِ وَ الْعِلْمِ لَا بِالذَّاتِ لِأَنَّ الْأَمَاكِنَ مَحْدُودَةٌ تَحْوِيهَا حُدُودٌ أَرْبَعَةٌ فَإِذَا كَانَ بِالذَّاتِ لَزِمَهَا الْحَوَايَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from a number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Yaqoub Bin Yazeed, from Ibn Abu Umeyr, from Ibn Azina, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:58#h7\">[58:7]</a> Nowhere is there a secret counsel occurring between three persons but He is the fourth of them, nor (between) five but He is the sixth of them</span>.",
            "So he<sup>asws</sup> said: ‘He<sup>azwj</sup> is the One, One of the Self separate from His<sup>azwj</sup> creatures, and with that He<sup>azwj</sup> Described Himself<sup>azwj</sup>, and He<sup>azwj</sup> Encompasses everything by the Supervision, and the Control, and the Power. Nothing escapes from Him<sup>azwj</sup>, (even if it is) an atom’s weight in the skies nor in the earth, nor anything smaller than that, nor bigger, due to the Control. And the Knowledge is not with the Self because the places are limited by the extent of its four limits. So when that was with the Self, the calling would necessitate it’."
          ],
          "en.sarwar": [
            " 5. It is narrated from him (the narrator of the above Haddith) from a group of our people from Ahmad ibn Muhammad ibn Khalid from ya‘qub ibn yazid from ibn abu ‘Umayr from ibn ’Udhaynah from Imam abu ‘Abdallah (a.s.) who has said the following. It is about the words of Allah “There is not a single place wherein any secret counsel can take place between any three people without God being the fourth, nor five people without His being the sixth. .” <a href=\"/#/books/quran:58#h7\">[58:7]</a>. “He is One, the One only in His Own-self. He is different from His creatures and as such He has said about His Own-Self. He has control over all things through His presence, control and power. Nothing as small as an atom in the heavens or earth is absent from Him, not even things smaller or bigger. It is all through His control and knowledge not by His-self. It is because the places are limited by the four boundaries. If it would be by His-self it would limit Him.” About the words of Allah The Beneficent God is dominant over the Throne (of the realm) <a href=\"/#/books/quran:20#h5\">[20:5]</a>"
          ]
        }
      },
      {
        "part_type": "Heading",
        "relations": {
          "Mentions": [
            "/books/quran:20:5"
          ]
        },
        "text": [
          "فِي قَوْلِهِ الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى"
        ],
        "translations": {
          "en.hubeali": [
            "Regarding the Words of the <a href=\"/#/books/quran:20#h5\">[20:5]</a> The Beneficent is Even upon the Throne"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (68/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 329,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/449",
              "text": "الْحَسَنِ بْنِ مُوسَى الْخَشَّابِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/72",
              "text": "بَعْضِ رِجَالِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُوسَى الْخَشَّابِ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:19:6",
        "relations": {
          "Mentions": [
            "/books/quran:20:5"
          ]
        },
        "text": [
          "هُ سُئِلَ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى فَقَالَ اسْتَوَى عَلَى كُلِّ شَيْ‏ءٍ فَلَيْسَ شَيْ‏ءٌ أَقْرَبَ إِلَيْهِ مِنْ شَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Al Hassan Bin Musa Al Khashaab, from one of his men, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that he<sup>asws</sup> was asked about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h5\">[20:5]</a> The Beneficent is Even upon the Throne</span>. So he<sup>asws</sup> said: ‘Even upon everything. So there isn’t anything more closer to Him<sup>azwj</sup> than a (another) thing’."
          ],
          "en.sarwar": [
            " 6. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from al-Hassan ibn Musa al-Khashshab from a few of his people from Imam abu ‘Abdallah (a.s.) who (the narrator) has said the following. “A person asked the Imam about the words of Allah, “The Beneficent God is dominant over the Throne (of the realm) <a href=\"/#/books/quran:20#h5\">[20:5]</a>” The Imam said, “Allah established His control over all things. No one thing is closer to Him than any other thing.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/71)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 330,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/450",
              "text": "سَهْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/451",
              "text": "مُحَمَّدِ بْنِ مَارِدٍ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ سَهْلٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ مَارِدٍ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:19:7",
        "relations": {
          "Mentions": [
            "/books/quran:20:5"
          ]
        },
        "text": [
          " أَبَا عَبْدِ اللَّهِ ( عليه السلام ) سُئِلَ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى فَقَالَ اسْتَوَى مِنْ كُلِّ شَيْ‏ءٍ فَلَيْسَ شَيْ‏ءٌ أَقْرَبَ إِلَيْهِ مِنْ شَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Sahl, from Al Hassan Bin Mahboub, from Muhamad Bin Marid, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h5\">[20:5]</a> The Beneficent is Even upon the Throne</span>. So he<sup>asws</sup> said: ‘Even from everything. So there isn’t anything closer to Him<sup>azwj</sup> than a (another) thing’."
          ],
          "en.sarwar": [
            " 7. Sahl through the same chain of narrators has narrated from al-Hassan ibn Mahbub from Maridin the following. “A person asked Imam abu ‘Abdallah about the words of Allah, “The Beneficent God is dominant over the Throne (of the realm) <a href=\"/#/books/quran:20#h5\">[20:5]</a>.” The Imam said, “He established His control in all things."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح وأخره مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/71)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 331,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "مُحَمَّدِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:19:8",
        "relations": {
          "Mentions": [
            "/books/quran:20:5"
          ]
        },
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ تَعَالَى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى فَقَالَ اسْتَوَى فِي كُلِّ شَيْ‏ءٍ فَلَيْسَ شَيْ‏ءٌ أَقْرَبَ إِلَيْهِ مِنْ شَيْ‏ءٍ لَمْ يَبْعُدْ مِنْهُ بَعِيدٌ وَ لَمْ يَقْرُبْ مِنْهُ قَرِيبٌ اسْتَوَى فِي كُلِّ شَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h5\">[20:5]</a> The Beneficent is Even upon the Throne</span>. So he<sup>asws</sup> said: ‘Even with regards to everything. So there isn’t anything closer to Him<sup>azwj</sup> than a (another) thing. The remote is not far from Him<sup>azwj</sup>, and the close-by is not closer to Him<sup>azwj</sup>. He<sup>azwj</sup> is Even with regards to everything’."
          ],
          "en.sarwar": [
            " 8. Ali ibn Muhammad has narrated from Muhammad ibn Yahya from Muhammad ibn al-Husayn from Safwan ibn Yahya from ‘Abd al-Rahman ibn al-Hajjaj from Imam abu ‘Abdallah (a.s.) the following about the words of Allah. “The Beneficent God is dominant over the Throne (of the realm).” <a href=\"/#/books/quran:20#h5\">[20:5]</a> “No single thing is closer to Him than any other thing. The far is not far for Him and the close is not closer to Him. All are the same to Him.”"
          ]
        }
      },
      {
        "index": 332,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "مُحَمَّدِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/266",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:19:9",
        "text": [
          " مَنْ زَعَمَ أَنَّ اللَّهَ مِنْ شَيْ‏ءٍ أَوْ فِي شَيْ‏ءٍ أَوْ عَلَى شَيْ‏ءٍ فَقَدْ كَفَرَ قُلْتُ فَسِّرْ لِي قَالَ أَعْنِي بِالْحَوَايَةِ مِنَ الشَّيْ‏ءِ لَهُ أَوْ بِإِمْسَاكٍ لَهُ أَوْ مِنْ شَيْ‏ءٍ سَبَقَهُ ",
          "وَ فِي رِوَايَةٍ أُخْرَى مَنْ زَعَمَ أَنَّ اللَّهَ مِنْ شَيْ‏ءٍ فَقَدْ جَعَلَهُ مُحْدَثاً وَ مَنْ زَعَمَ أَنَّهُ فِي شَيْ‏ءٍ فَقَدْ جَعَلَهُ مَحْصُوراً وَ مَنْ زَعَمَ أَنَّهُ عَلَى شَيْ‏ءٍ فَقَدْ جَعَلَهُ مَحْمُولًا ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Aasim Bin Humeyd, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who claims that Allah<sup>azwj</sup> is from a thing, or in a thing, or upon a thing, so he has Blasphemed’. I said, ‘Explain it to me’. He<sup>asws</sup> said: ‘I<sup>asws</sup> mean by the emerging from the thing for Him<sup>azwj</sup>, of by the attachment to it, or from a thing preceding Him<sup>azwj</sup>’. ",
            "And in another report, ‘(He<sup>asws</sup> said): ‘The one who claims that Allah<sup>azwj</sup> is from a thing, so he has Made Him<sup>azwj</sup> as an occurrence; and the one who claims that He<sup>azwj</sup> is in a thing, so he has Made Him<sup>azwj</sup> as contained; and the one who claims that He<sup>azwj</sup> is upon a thing, so he has Made Him<sup>azwj</sup> to be a Carried One’."
          ]
        }
      },
      {
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/452",
              "text": "فِي قَوْلِهِ تَعَالَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/453",
              "text": "هُوَ الَّذِي"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "فِي قَوْلِهِ تَعَالَى وَ هُوَ الَّذِي فِي"
        },
        "part_type": "Heading",
        "relations": {
          "Mentions": [
            "/books/quran:43:84"
          ]
        },
        "text": [
          " السَّماءِ إِلهٌ وَ فِي الْأَرْضِ إِلهٌ"
        ],
        "translations": {
          "en.hubeali": [
            "Regarding the Words of the Exalted <a href=\"/#/books/quran:43#h84\">[43:84]</a> And He is That Who is God in the skies and God in the earth"
          ]
        }
      },
      {
        "index": 333,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/44",
              "text": "هِشَامِ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:19:10",
        "relations": {
          "Mentions": [
            "/books/quran:43:84"
          ]
        },
        "text": [
          " قَالَ أَبُو شَاكِرٍ الدَّيَصَانِيُّ إِنَّ فِي الْقُرْآنِ آيَةً هِيَ قَوْلُنَا قُلْتُ مَا هِيَ فَقَالَ وَ هُوَ الَّذِي فِي السَّماءِ إِلهٌ وَ فِي الْأَرْضِ إِلهٌ فَلَمْ أَدْرِ بِمَا أُجِيبُهُ ",
          "فَحَجَجْتُ فَخَبَّرْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ هَذَا كَلَامُ زِنْدِيقٍ خَبِيثٍ إِذَا رَجَعْتَ إِلَيْهِ فَقُلْ لَهُ مَا اسْمُكَ بِالْكُوفَةِ فَإِنَّهُ يَقُولُ فُلَانٌ فَقُلْ لَهُ مَا اسْمُكَ بِالْبَصْرَةِ فَإِنَّهُ يَقُولُ فُلَانٌ فَقُلْ كَذَلِكَ اللَّهُ رَبُّنَا فِي السَّمَاءِ إِلَهٌ وَ فِي الْأَرْضِ إِلَهٌ وَ فِي الْبِحَارِ إِلَهٌ وَ فِي الْقِفَارِ إِلَهٌ وَ فِي كُلِّ مَكَانٍ إِلَهٌ ",
          "قَالَ فَقَدِمْتُ فَأَتَيْتُ أَبَا شَاكِرٍ فَأَخْبَرْتُهُ فَقَالَ هَذِهِ نُقِلَتْ مِنَ الْحِجَازِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abu Umeyr, from Hisham Bin Al Hakam who said, ",
            "‘Abu Shakir Al-Daysani said, ‘In the Quran there is a Verse which is our speech’. I said, ‘And what is it?’ So he said, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:43#h84\">[43:84]</a> And He is That Who is God in the skies and God in the earth</span>’. So I did not know what to answer him with.",
            "So I went for Hajj and informed Abu Abdullah<sup>asws</sup>. So he<sup>asws</sup> said: ‘This is a speech of a wicked atheist. When you return to him, so say to him, ‘What is your name in Al-Kufa?’ So he would be saying, ‘So and so’. So say to him, ‘What is your name in Al-Basra?’ So he would be saying, ‘So and so’. So say, ‘Similar to that is Allah<sup>azwj</sup>, our Lord<sup>azwj</sup>, God<sup>azwj</sup> in the sky and God<sup>azwj</sup> in the earth, and God<sup>azwj</sup> in the oceans, and God<sup>azwj</sup> in the wilderness, and in every place, God<sup>azwj</sup>’. ",
            "He (the narrator) said, ‘So I proceeded and went over to Abu Shakir and informed him. So he said, ‘This has been transmitted from Al-Hijaz’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/71)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": " "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/454",
              "text": "9ـ وَعَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "مُحَمَّدِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/266",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/455",
              "text": "أَبِي عَبْدِ الله (عَلَيْهِ السَّلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": " 9ـ وَعَنْهُ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ"
        },
        "part_type": "Hadith",
        "relations": {
          "Mentions": [
            "/books/quran:43:84"
          ]
        },
        "text": [
          " مَنْ زَعَمَ أَنَّ الله مِنْ شَيْ‏ءٍ أَوْ فِي شَيْ‏ءٍ أَوْ عَلَى شَيْ‏ءٍ فَقَدْ كَفَرَ قُلْتُ فَسِّرْ لِي قَالَ أَعْنِي بِالْحَوَايَةِ مِنَ الشَّيْ‏ءِ لَهُ أَوْ بِإِمْسَاكٍ لَهُ أَوْ مِنْ شَيْ‏ءٍ سَبَقَهُ وَفِي رِوَايَةٍ أُخْرَى مَنْ زَعَمَ أَنَّ الله مِنْ شَيْ‏ءٍ فَقَدْ جَعَلَهُ مُحْدَثاً وَمَنْ زَعَمَ أَنَّهُ فِي شَيْ‏ءٍ فَقَدْ جَعَلَهُ مَحْصُوراً وَمَنْ زَعَمَ أَنَّهُ عَلَى شَيْ‏ءٍ فَقَدْ جَعَلَهُ مَحْمُولاً.",
          " فِي قَوْلِهِ تَعَالَى وَهُوَ الَّذِي فِي السَّماءِ إِلهٌ وَفِي الارْضِ إِلهٌ."
        ],
        "translations": {
          "en.sarwar": [
            " 9. It is narrated from him (narrator of previous Hadith) from Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa’id from al-Nadr ibn Suwayd from ‘Asim ibn Humayd from abu Basir from Imam abu ‘Abdallah (a.s.) who has said the following. “Whoever may think that Allah is from things or in the things or on the things he has become an atheist.” I asked the Imam (a.s.), “Please explain to me.” The Imam said, “I intend thereby His being contained, held or being preceded.” In another Hadith it said, “Whoever would believe that Allah is from things he has considered Him as created. Whoever would think that He is in things he has considered Him as surrounded. Whoever thinks that He is on things he has considered Him as being carried.” About the words of Allah “It is God who is the Lord of the heavens and is the Lord on earth. He is All-wise and All-knowing.” <a href=\"/#/books/quran:43#h84\">[43:84]</a>"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (71/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": " "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/456",
              "text": "10ـ عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/44",
              "text": "هِشَامِ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": " 10ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ"
        },
        "part_type": "Hadith",
        "relations": {
          "Mentions": [
            "/books/quran:43:84"
          ]
        },
        "text": [
          " قَالَ أَبُو شَاكِرٍ الدَّيَصَانِيُّ إِنَّ فِي الْقُرْآنِ آيَةً هِيَ قَوْلُنَا قُلْتُ مَا هِيَ فَقَالَ وَهُوَ الَّذِي فِي السَّماءِ إِلهٌ وَفِي الارْضِ إِلهٌ فَلَمْ أَدْرِ بِمَا أُجِيبُهُ فَحَجَجْتُ فَخَبَّرْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) فَقَالَ هَذَا كَلامُ زِنْدِيقٍ خَبِيثٍ إِذَا رَجَعْتَ إِلَيْهِ فَقُلْ لَهُ مَا اسْمُكَ بِالْكُوفَةِ فَإِنَّهُ يَقُولُ فُلانٌ فَقُلْ لَهُ مَا اسْمُكَ بِالْبَصْرَةِ فَإِنَّهُ يَقُولُ فُلانٌ فَقُلْ كَذَلِكَ الله رَبُّنَا فِي السَّمَاءِ إِلَهٌ وَفِي الارْضِ إِلَهٌ وَفِي الْبِحَارِ إِلَهٌ وَفِي الْقِفَارِ إِلَهٌ وَفِي كُلِّ مَكَانٍ إِلَهٌ قَالَ فَقَدِمْتُ فَأَتَيْتُ أَبَا شَاكِرٍ فَأَخْبَرْتُهُ فَقَالَ هَذِهِ نُقِلَتْ مِنَ الْحِجَازِ."
        ],
        "translations": {
          "en.sarwar": [
            " 10. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn al-Hakam who has said the following. “Abu Shakir al-Daysani said, ‘In the Quran there is a verse that says what we say.’ I asked, “What is that?” He replied, “ It is God who is the Lord of the heavens and is the Lord on earth. He is All-wise and All-knowing <a href=\"/#/books/quran:43#h84\">[43:84]</a>.” I did not know the answer? During Hajj I mentioned it to Imam abu ‘Abdallah who said this. “This is the statement of a wicked atheist. When you go back say to him, ‘What is your name in Basra? He will say so and so. Ask, “What is your name in al-Kufah? He will say so and so. Say in the same way is our Lord in the heavens. He is the king in the heavens and the Lord on earth. He is the Lord in oceans and on land and in all places. “The narrator has said, “I came back, went to abu Shakir and explained to him the answer. He said, “This (answer) is brought from al- Hijaz.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:19",
  "kind": "verse_list"
}