{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:1:3:20",
        "titles": {
          "ar": "بَابُ الْعَرْشِ وَ الْكُرْسِيِّ",
          "en": "Chapter 20 – The Throne (الْعَرْشِ ) and the Chair (الْكُرْسِيِّ)"
        }
      }
    ],
    "index": 43,
    "local_index": 20,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:1:3:21",
        "titles": {
          "ar": "بَابُ الرُّوحِ",
          "en": "Chapter 21 – The Spirit"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:1:3:19",
        "titles": {
          "ar": "بَابُ الْحَرَكَةِ وَ الِانْتِقَالِ",
          "en": "Chapter 19 – The Motion and the Transformation (Change of state to a state)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:20",
    "titles": {
      "ar": "بَابُ الْعَرْشِ وَ الْكُرْسِيِّ",
      "en": "Chapter 20 – The Throne (الْعَرْشِ ) and the Chair (الْكُرْسِيِّ)"
    },
    "verse_count": 7,
    "verse_start_index": 333,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (72/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 334,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/114",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:20:1",
        "relations": {
          "Mentions": [
            "/books/quran:58:7",
            "/books/quran:69:17",
            "/books/quran:2:255",
            "/books/quran:35:41",
            "/books/quran:40:7",
            "/books/quran:6:75"
          ]
        },
        "text": [
          " سَأَلَ الْجَاثَلِيقُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ أَخْبِرْنِي عَنِ اللَّهِ عَزَّ وَ جَلَّ يَحْمِلُ الْعَرْشَ أَمِ الْعَرْشُ يَحْمِلُهُ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) اللَّهُ عَزَّ وَ جَلَّ حَامِلُ الْعَرْشِ وَ السَّمَاوَاتِ وَ الْأَرْضِ وَ مَا فِيهِمَا وَ مَا بَيْنَهُمَا وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ يُمْسِكُ السَّماواتِ وَ الْأَرْضَ أَنْ تَزُولا وَ لَئِنْ زالَتا إِنْ أَمْسَكَهُما مِنْ أَحَدٍ مِنْ بَعْدِهِ إِنَّهُ كانَ حَلِيماً غَفُوراً ",
          "قَالَ فَأَخْبِرْنِي عَنْ قَوْلِهِ وَ يَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمانِيَةٌ فَكَيْفَ قَالَ ذَلِكَ وَ قُلْتَ إِنَّهُ يَحْمِلُ الْعَرْشَ وَ السَّمَاوَاتِ وَ الْأَرْضَ",
          "فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ الْعَرْشَ خَلَقَهُ اللَّهُ تَعَالَى مِنْ أَنْوَارٍ أَرْبَعَةٍ نُورٍ أَحْمَرَ مِنْهُ احْمَرَّتِ الْحُمْرَةُ وَ نُورٍ أَخْضَرَ مِنْهُ اخْضَرَّتِ الْخُضْرَةُ وَ نُورٍ أَصْفَرَ مِنْهُ اصْفَرَّتِ الصُّفْرَةُ وَ نُورٍ أَبْيَضَ مِنْهُ ابْيَضَّ الْبَيَاضُ وَ هُوَ الْعِلْمُ الَّذِي حَمَّلَهُ اللَّهُ الْحَمَلَةَ وَ ذَلِكَ نُورٌ مِنْ عَظَمَتِهِ ",
          "فَبِعَظَمَتِهِ وَ نُورِهِ أَبْصَرَ قُلُوبُ الْمُؤْمِنِينَ وَ بِعَظَمَتِهِ وَ نُورِهِ عَادَاهُ الْجَاهِلُونَ وَ بِعَظَمَتِهِ وَ نُورِهِ ابْتَغَى مَنْ فِي السَّمَاوَاتِ وَ الْأَرْضِ مِنْ جَمِيعِ خَلَائِقِهِ إِلَيْهِ الْوَسِيلَةَ بِالْأَعْمَالِ الْمُخْتَلِفَةِ وَ الْأَدْيَانِ الْمُشْتَبِهَةِ ",
          "فَكُلُّ مَحْمُولٍ يَحْمِلُهُ اللَّهُ بِنُورِهِ وَ عَظَمَتِهِ وَ قُدْرَتِهِ لَا يَسْتَطِيعُ لِنَفْسِهِ ضَرّاً وَ لَا نَفْعاً وَ لَا مَوْتاً وَ لَا حَيَاةً وَ لَا نُشُوراً فَكُلُّ شَيْ‏ءٍ مَحْمُولٌ وَ اللَّهُ تَبَارَكَ وَ تَعَالَى الْمُمْسِكُ لَهُمَا أَنْ تَزُولَا وَ الْمُحِيطُ بِهِمَا مِنْ شَيْ‏ءٍ وَ هُوَ حَيَاةُ كُلِّ شَيْ‏ءٍ وَ نُورُ كُلِّ شَيْ‏ءٍ سُبْحَانَهُ وَ تَعَالَى عَمَّا يَقُولُونَ عُلُوّاً كَبِيراً",
          "قَالَ لَهُ فَأَخْبِرْنِي عَنِ اللَّهِ عَزَّ وَ جَلَّ أَيْنَ هُوَ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) هُوَ هَاهُنَا وَ هَاهُنَا وَ فَوْقُ وَ تَحْتُ وَ مُحِيطٌ بِنَا وَ مَعَنَا وَ هُوَ قَوْلُهُ ما يَكُونُ مِنْ نَجْوى ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ وَ لا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ وَ لا أَدْنى مِنْ ذلِكَ وَ لا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ ما كانُوا ",
          "فَالْكُرْسِيُّ مُحِيطٌ بِالسَّمَاوَاتِ وَ الْأَرْضِ وَ مَا بَيْنَهُمَا وَ مَا تَحْتَ الثَّرَى وَ إِنْ تَجْهَرْ بِالْقَوْلِ فَإِنَّهُ يَعْلَمُ السِّرَّ وَ أَخْفَى وَ ذَلِكَ قَوْلُهُ تَعَالَى وَسِعَ كُرْسِيُّهُ السَّماواتِ وَ الْأَرْضَ وَ لا يَؤُدُهُ حِفْظُهُما وَ هُوَ الْعَلِيُّ الْعَظِيمُ",
          "فَالَّذِينَ يَحْمِلُونَ الْعَرْشَ هُمُ الْعُلَمَاءُ الَّذِينَ حَمَّلَهُمُ اللَّهُ عِلْمَهُ وَ لَيْسَ يَخْرُجُ عَنْ هَذِهِ الْأَرْبَعَةِ شَيْ‏ءٌ خَلَقَ اللَّهُ فِي مَلَكُوتِهِ الَّذِي أَرَاهُ اللَّهُ أَصْفِيَاءَهُ وَ أَرَاهُ خَلِيلَهُ ( عليه السلام ) فَقَالَ وَ كَذلِكَ نُرِي إِبْراهِيمَ مَلَكُوتَ السَّماواتِ وَ الْأَرْضِ وَ لِيَكُونَ مِنَ الْمُوقِنِينَ",
          "وَ كَيْفَ يَحْمِلُ حَمَلَةُ الْعَرْشِ اللَّهَ وَ بِحَيَاتِهِ حَيِيَتْ قُلُوبُهُمْ وَ بِنُورِهِ اهْتَدَوْا إِلَى مَعْرِفَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqy, raising it, said, ",
            "‘Al-Jasaleyq (The Catholic) asked Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> saying, ‘Inform me about Allah<sup>azwj</sup> Mighty and Majestic, does He<sup>azwj</sup> carry the Throne (الْعَرْشَ) or does the Throne (الْعَرْشَ) carry Him<sup>azwj</sup>?’ So Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic is the Carrier of the Throne (الْعَرْشَ), and the skies and the earth and whatever is between the two, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:35#h41\">[35:41]</a> Surely Allah Upholds the skies and the earth lest they come to naught; and if they should come to naught, there Is none who can uphold them after Him; surely He is the Forbearing, the Forgiving</span>’.",
            "He said, ‘So inform me about His<sup>azwj</sup> (Words) <span class=\"ibTxt\"><a href=\"/#/books/quran:69#h17\">[69:17]</a> and above them eight shall bear on that Day the Throne of your Lord</span>. So how come He<sup>azwj</sup> Said that, and you<sup>asws</sup> said that He<sup>azwj</sup> Carries the Throne (الْعَرْشَ) and the skies and the earth?’ ",
            "So Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> said: ‘The Throne (الْعَرْشَ), Allah<sup>azwj</sup> the Exalted Created it from the four Lights – the red from it reddens the red, and the green Light from it greens the green, and the yellow from it yellows the yellow, and the white from it whitens the white; and it is the Knowledge which Allah<sup>azwj</sup> Loaded upon the carriers, and that is a Light from His<sup>azwj</sup> Magnificence. ",
            "Thus, it is due to His<sup>azwj</sup> Magnificence and His<sup>azwj</sup> Light do the hearts of the <span class=\"iTxt\">Momineen</span> see, and due to His<sup>azwj</sup> Magnificence and His<sup>azwj</sup> Light the ignorant ones are inimical to Him<sup>azwj</sup>, and due to His<sup>azwj</sup> Magnificence and His<sup>azwj</sup> Light do the ones in the skies and the earth seek the Means to Him<sup>azwj</sup>, with the different deeds and the mixed Religions. ",
            "Thus, every carried one, Allah<sup>azwj</sup> Carries it by His<sup>azwj</sup> Light and His<sup>azwj</sup> Magnificence and His<sup>azwj</sup> Power. These have neither a capacity to harm by itself, nor benefit, nor death, nor life, nor Resurrection. So everything is Carried, and Allah<sup>azwj</sup> Blessed and High is the Grasper of the two (skies and the earth) if they were to decline, and the Encompasser of the two from things, and He<sup>azwj</sup> is the Life of everything and Light of everything. Glorious is He<sup>azwj</sup> and Exalted from what they are saying, Loftier, Greater’. ",
            "He said to him<sup>asws</sup>, ‘So inform me about Allah<sup>azwj</sup> Mighty and Majestic, where is He<sup>azwj</sup>?’ So Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> said: ‘He<sup>azwj</sup> is over here and over there, and above, and beneath, and surround us, and with us, and <span class=\"ibTxt\"><a href=\"/#/books/quran:58#h7\">[58:7]</a> Nowhere is there a secret counsel between three persons but He is the fourth of them, nor (between) five but He is the sixth of them, nor less than that nor more but He is with them wherever they may be</span>.",
            "So the Chair (الْكُرْسِيُّ) encompasses the skies and the earth and what is between the two, and what is beneath the soil; and if you aloud with the speech, so He<sup>azwj</sup> Knows the secrets and the concealed, and these are the Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h255\">[2:255]</a> His Chair extends over the skies and the earth, and the preservation of them both does not tire Him, and He is the Exalted, the Magnificent, and the preservation of them both does not tire Him, and He is the Exalted, the Magnificent</span>.",
            "<span class=\"ibTxt\"><a href=\"/#/books/quran:40#h7\">[40:7]</a> So those who are bearing the Throne</span>, they are the knowledgeable ones<sup>asws</sup>, those upon whom<sup>asws</sup> Allah<sup>azwj</sup> Loaded His<sup>azwj</sup> Knowledge, and nothing comes out from these four which Allah<sup>azwj</sup> Created in His<sup>azwj</sup> Kingdom which Allah<sup>azwj</sup> Showed to His<sup>azwj</sup> Elites and Showed it to His<sup>azwj</sup> Friend (Ibrahim<sup>as</sup>), so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h75\">[6:75]</a> And thus did We Show Ibrahim the Kingdom of the skies and the earth and that he might be of those who are certain</span><span class=\"iTxt\">.</span>",
            "And how can the carriers of the Throne (الْعَرْشِ ) carry Allah<sup>azwj</sup> and their<sup>asws</sup> hearts are Encompassed by His<sup>azwj</sup> Life and His<sup>azwj</sup> Light, being Guided to His<sup>azwj</sup> recognition’."
          ],
          "en.sarwar": [
            " 1. A number of our people have narrated from Ahamad ibn Muhammad al-Barqi, in a marfu‘ manner, who has said the following. “Jathaliq, a christian scholar, asked Imam Ali (a.s.) saying, ‘Tell me about Allah, the Most Holy, the Most High. Does He carry the ‘Arsh or ‘Arsh carries Him?” Imam Ali (a.s.) replied, “Allah, the Most Holy, the Most High, is the One Who carries and has lifted the ‘Arsh, the heavens and earth and all that is between them from banishment. ‘Allah (God) prevents the heavens and the earth from falling apart. If they do fall apart, then, no one besides Him can restore them. He is All-forbearing and All-forgiving. <a href=\"/#/books/quran:35#h41\">[35:41]</a>’ He then asked, “Tell me about His words, ‘The angels will be around the heavens and on that day eight of them will carry the Throne of your Lord above all the creatures <a href=\"/#/books/quran:69#h17\">[69:17]</a>.’ “How has He said it. You just said that He carries the heavens, earth and all that is between them.” Asked the man. Amirul Mu’minin then said, “Allah, the Most High, created al-‘Arsh (the Throne) from four lights. From a red wherefrom the redness became red, a green light from which the greenness became green, a yellow light whereby the yellowness became yellow. He created it from a white light wherefrom is white and it is knowledge which Allah has made the carriers to carry and that is the light of His greatness. With His greatness and His light He has given sight to the hearts of believers. Because of His greatness and light the ignorant ones have become His enemies. Through His greatness and light all those in heavens and on earth, all His creatures seek to reach Allah, the Most Holy, the Most High, by means of their various deeds and mixed religions. All that is carried Allah carries them with the light of His greatness and power. They are not able to do any benefit, or harm, death or life or resurrection. All things are carried. Allah, the Most Holy, the Most High, preserves them from banishment and has control over both of them (heavens and earth). He is the life of all things, the light of all things. Glorious is He, the Most High, far above what they say about Him. He is far high above them with Greatness.” He then said tell me about Allah, the Most Holy, the Most High, where is He? Amirul Mu’minin said, “He is here. He is there, above, below, encompassing us and with us as He has said. ‘There is not a single place wherein any secret counsel can take place between any three people without God being the fourth, nor five people without His being the sixth nor any gathering of more or less people, wherever it may be, without His being with them . .’ <a href=\"/#/books/quran:58#h7\">[58:7]</a>. The al-Kursi contains the heavens and the earth and all that is between them and below the soil. If you would say anything loud, He knows the secrets and hidden as mentioned in His words, “The heavens and the earth are under His dominion (contained in His al-Kursi). He does not experience fatigue in preserving them both. He is the High, and the Greatest.’ <a href=\"/#/books/quran:2#h255\">[2:255]</a> Thus, those who carry al-‘Arsh (the throne) are the scholars whom Allah has made to carry His knowledge. There is nothing that Allah has created in the heavens and the earth that is out of these four that He has shown to those whom he chosen. He showed them to His friend Ibrahim (s.a.). “Also, We showed (Abraham) the kingdom of the heavens and the earth to strengthen his faith.” <a href=\"/#/books/quran:6#h75\">[6:75]</a> How would the carriers of al-‘Arsh (the Throne) carry Allah when with life from Him their hearts receive life and with His light they found guidance to know Him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/75)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 335,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:20:2",
        "relations": {
          "Mentions": [
            "/books/quran:40:7",
            "/books/quran:69:17",
            "/books/quran:7:180"
          ]
        },
        "text": [
          " سَأَلَنِي أَبُو قُرَّةَ الْمُحَدِّثُ أَنْ أُدْخِلَهُ عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فَاسْتَأْذَنْتُهُ فَأَذِنَ لِي فَدَخَلَ فَسَأَلَهُ عَنِ الْحَلَالِ وَ الْحَرَامِ ثُمَّ قَالَ لَهُ أَ فَتُقِرُّ أَنَّ اللَّهَ مَحْمُولٌ",
          "فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) كُلُّ مَحْمُولٍ مَفْعُولٌ بِهِ مُضَافٌ إِلَى غَيْرِهِ مُحْتَاجٌ وَ الْمَحْمُولُ اسْمُ نَقْصٍ فِي اللَّفْظِ وَ الْحَامِلُ فَاعِلٌ وَ هُوَ فِي اللَّفْظِ مِدْحَةٌ وَ كَذَلِكَ قَوْلُ الْقَائِلِ فَوْقَ وَ تَحْتَ وَ أَعْلَى وَ أَسْفَلَ وَ قَدْ قَالَ اللَّهُ وَ لِلَّهِ الْأَسْماءُ الْحُسْنى فَادْعُوهُ بِها وَ لَمْ يَقُلْ فِي كُتُبِهِ إِنَّهُ الْمَحْمُولُ بَلْ قَالَ إِنَّهُ الْحَامِلُ فِي الْبَرِّ وَ الْبَحْرِ وَ الْمُمْسِكُ السَّمَاوَاتِ وَ الْأَرْضَ أَنْ تَزُولَا وَ الْمَحْمُولُ مَا سِوَى اللَّهِ وَ لَمْ يُسْمَعْ أَحَدٌ آمَنَ بِاللَّهِ وَ عَظَمَتِهِ قَطُّ قَالَ فِي دُعَائِهِ يَا مَحْمُولُ ",
          "قَالَ أَبُو قُرَّةَ فَإِنَّهُ قَالَ وَ يَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمانِيَةٌ وَ قَالَ الَّذِينَ يَحْمِلُونَ الْعَرْشَ فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) الْعَرْشُ لَيْسَ هُوَ اللَّهَ وَ الْعَرْشُ اسْمُ عِلْمٍ وَ قُدْرَةٍ وَ عَرْشٍ فِيهِ كُلُّ شَيْ‏ءٍ ",
          "ثُمَّ أَضَافَ الْحَمْلَ إِلَى غَيْرِهِ خَلْقٍ مِنْ خَلْقِهِ لِأَنَّهُ اسْتَعْبَدَ خَلْقَهُ بِحَمْلِ عَرْشِهِ وَ هُمْ حَمَلَةُ عِلْمِهِ وَ خَلْقاً يُسَبِّحُونَ حَوْلَ عَرْشِهِ وَ هُمْ يَعْمَلُونَ بِعِلْمِهِ وَ مَلَائِكَةً يَكْتُبُونَ أَعْمَالَ عِبَادِهِ وَ اسْتَعْبَدَ أَهْلَ الْأَرْضِ بِالطَّوَافِ حَوْلَ بَيْتِهِ وَ اللَّهُ عَلَى الْعَرْشِ اسْتَوَى كَمَا قَالَ",
          "وَ الْعَرْشُ وَ مَنْ يَحْمِلُهُ وَ مَنْ حَوْلَ الْعَرْشِ وَ اللَّهُ الْحَامِلُ لَهُمُ الْحَافِظُ لَهُمُ الْمُمْسِكُ الْقَائِمُ عَلَى كُلِّ نَفْسٍ وَ فَوْقَ كُلِّ شَيْ‏ءٍ وَ عَلَى كُلِّ شَيْ‏ءٍ وَ لَا يُقَالُ مَحْمُولٌ وَ لَا أَسْفَلُ قَوْلًا مُفْرَداً لَا يُوصَلُ بِشَيْ‏ءٍ فَيَفْسُدُ اللَّفْظُ وَ الْمَعْنَى ",
          "قَالَ أَبُو قُرَّةَ فَتُكَذِّبُ بِالرِّوَايَةِ الَّتِي جَاءَتْ أَنَّ اللَّهَ إِذَا غَضِبَ إِنَّمَا يُعْرَفُ غَضَبُهُ أَنَّ الْمَلَائِكَةَ الَّذِينَ يَحْمِلُونَ الْعَرْشَ يَجِدُونَ ثِقْلَهُ عَلَى كَوَاهِلِهِمْ فَيَخِرُّونَ سُجَّداً فَإِذَا ذَهَبَ الْغَضَبُ خَفَّ وَ رَجَعُوا إِلَى مَوَاقِفِهِمْ",
          "فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) أَخْبِرْنِي عَنِ اللَّهِ تَبَارَكَ وَ تَعَالَى مُنْذُ لَعَنَ إِبْلِيسَ إِلَى يَوْمِكَ هَذَا هُوَ غَضْبَانُ عَلَيْهِ فَمَتَى رَضِيَ وَ هُوَ فِي صِفَتِكَ لَمْ يَزَلْ غَضْبَانَ عَلَيْهِ وَ عَلَى أَوْلِيَائِهِ وَ عَلَى أَتْبَاعِهِ كَيْفَ تَجْتَرِئُ أَنْ تَصِفَ رَبَّكَ بِالتَّغْيِيرِ مِنْ حَالٍ إِلَى حَالٍ وَ أَنَّهُ يَجْرِي عَلَيْهِ مَا يَجْرِي عَلَى الْمَخْلُوقِينَ ",
          "سُبْحَانَهُ وَ تَعَالَى لَمْ يَزُلْ مَعَ الزَّائِلِينَ وَ لَمْ يَتَغَيَّرْ مَعَ الْمُتَغَيِّرِينَ وَ لَمْ يَتَبَدَّلْ مَعَ الْمُتَبَدِّلِينَ وَ مَنْ دُونَهُ فِي يَدِهِ وَ تَدْبِيرِهِ وَ كُلُّهُمْ إِلَيْهِ مُحْتَاجٌ وَ هُوَ غَنِيٌّ عَمَّنْ سِوَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya who said, ",
            "‘Abu Qurra the narrator asked me if I could take him to see Abu Al-Hassan Al-Reza<sup>asws</sup>. So I sought permission for him and he<sup>asws</sup> permitted it for me. So he came over and asked him<sup>asws</sup> about the Permissible and the Prohibitions, then said to him<sup>asws</sup>, ‘So do you<sup>asws</sup> acknowledge that Allah<sup>azwj</sup> is carried?’ ",
            "So Abu Al-Hassan<sup>asws</sup> said: ‘Every carried is performed with as an addition to something else, needy, and the carried is deficient regarding the word, and the carrier is the performer, and he is praiseworthy regarding the word; and similar to that are the words of the speaker, ‘Above’, and ‘Under’, and ‘Higher’, and ‘Lower’; and Allah<sup>azwj</sup> has Said <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h180\">[7:180]</a> And Allah's are the Best Names, therefore call on Him by these</span>, and did not Say in His<sup>azwj</sup> Books that He<sup>azwj</sup> is the carried One. But He<sup>azwj</sup> Said that He<sup>azwj</sup> is the Carrier in the land and the sea and the Upholder of the skies and the earth lest they decline; and the carried is what is besides Allah<sup>azwj</sup>, and it is not heard from anyone who believes in Allah<sup>azwj</sup> and His<sup>azwj</sup> Magnificence at all that he says in his supplication, ‘O Carried One!’’. ",
            "Abu Qurra said, ‘But He<sup>azwj</sup> Says <span class=\"ibTxt\"><a href=\"/#/books/quran:69#h17\">[69:17]</a> and above them eight shall bear on that Day the Throne of your Lord</span>, and Said <span class=\"ibTxt\"><a href=\"/#/books/quran:40#h7\">[40:7]</a> Those who are bearing the Throne</span>!’ So Abu Al-Hassan<sup>asws</sup> said: ‘The Throne (الْعَرْشَ), it is not Allah<sup>azwj</sup>, and the ‘Throne’ is a name of ‘Knowledge and Power’, and the Throne (الْعَرْشَ), in it is everything. ",
            "Then He<sup>azwj</sup> Supplemented the carriers to others He<sup>azwj</sup> Created from His<sup>azwj</sup> creatures because He<sup>azwj</sup> Enslaved His<sup>azwj</sup> by the carriers of His<sup>azwj</sup> Throne (الْعَرْشَ), and they<sup>asws</sup> carry His<sup>azwj</sup> Knowledge, and creatures are Glorifying Him around His<sup>azwj</sup> Throne (الْعَرْشَ), and they are performing by His<sup>azwj</sup> Knowledge, and the Angels are recording the deeds of His<sup>azwj</sup> servants, and the people of the earth are worshipping by the <span class=\"iTxt\">Tawaaf</span> around His<sup>azwj</sup> House (Kabah), and Allah<sup>azwj</sup> is Even upon the Throne (الْعَرْشِ), Even just as He<sup>azwj</sup> Said. ",
            "And (as for) the Throne (الْعَرْشِ) and the ones who are carrying it, and the ones around the Throne (الْعَرْشِ), and Allah<sup>azwj</sup> is the Carrier of them, the Preserver of them, the Upholder, the Standing One upon every soul, and above everything, and upon everything, and He<sup>azwj</sup> cannot be called ‘The Carried One’, nor by a lower solitary word, nor can He<sup>azwj</sup> be arrived to anything. So it would spoil the word and the meaning’. ",
            "Abu Qurra said, ‘So you<sup>asws</sup> are belying the report which have come that Allah<sup>azwj</sup>, when He<sup>azwj</sup> is Angry, rather His<sup>azwj</sup> Anger is recognised. The Angels who are carrying the Throne (الْعَرْشِ) are finding its weight upon their shoulders, so they fall down prostrate. So when the Anger subsides, it becomes lighter, and they return to their places’.  ",
            "So Abu Al-Hassan<sup>asws</sup> said: ‘Inform me<sup>asws</sup> about Allah<sup>azwj</sup> Blessed and High, since He<sup>azwj</sup> Cursed Iblees<sup>la</sup> up to this day of yours, He<sup>azwj</sup> is Angry upon him<sup>la</sup>, so when is He<sup>azwj</sup> Pleased, and He<sup>azwj</sup> is in your description, does not cease to be Angry upon him<sup>la</sup> and upon his<sup>la</sup> followers. How can you be so audacious that you are describing your Lord<sup>azwj</sup> with the alteration from a state to a state, and that it flows upon Him<sup>azwj</sup> what flows upon the creatures?",
            "Glorious is He<sup>azwj</sup> and Exalted, not declining along with the decliners, and does not alter with the altering ones, and does not change with the changing ones, and the ones besides Him<sup>azwj</sup> are in His<sup>azwj</sup> Hands, and His<sup>azwj</sup> Management, and all of them are needy to Him<sup>azwj</sup>, and He<sup>azwj</sup> is Needless from the ones besides Him<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 2. Ahmad ibn Idris from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya who has said the following. “Abu Qurrah, the narrator of Hadith asked for help to meet Imam Ali abu al-Hassan al-Rida (a.s.). I requested the Imam (a.s.) to meet him and he agreed. Abu Qurrah asked the Imam about the lawful and unlawful matters and then said, “Do you affirm that Allah is carried?” Imam abu al-Hassan (a.s.) replied, “Every thing in an objective case is related to another thing and is dependent. Being carried is the name for verbal defect. On the other hand, carrier is in a subjective case and it verbally is a word to convey praises and so is the expression of one who says, “Above, below, upper and lower.” Allah has said, ‘For Him there are beautiful names, thus, call Him through those names.’ He (Allah) has not said anywhere in His books that He is al-Mahmul (Being carried) He has, in fact, said that He is the carrier in the sea and on land and the preserver of the heavens and earth from banishment. Al-Mahmul, (being carried) are things other than Allah. It is never heard from any one who believed in Allah and His greatness saying in his prayers Ya Mahmul, (O the one being carried,).” Abu Qurrah then said, “He Himself has said, ‘The angels will be around the heavens and on that day eight of them will carry the Throne of your Lord above all the creatures.’ <a href=\"/#/books/quran:69#h17\">[69:17]</a> Also He has said, “Those who carry the Throne (al-‘Arsh).” Imam abu al-Hassan (a.s.) then said, “Al-‘Arsh (the Throne) is not Allah. Al-‘Arsh is the name of knowledge and power. In al-‘Arsh there is everything. Besides, He has ascribed carrying to things other than His Own-self. It is ascribed to a creature among His creatures. This is because He has made His creatures to worship Him through carrying His al-‘Arsh (the Throne) and they are the carrier of His knowledge. There is a creature, who speaks of His praise around His al-‘Arsh (the Throne) and act according to His knowledge and the angels write down the deeds of His servants. He has made those on earth to worship Him in the form of Tawaf (walking around) His house. Allah has control over al-‘Arsh (the Throne) as He has said, “Allah carries al-‘Arsh, those who carry it and those around it, preserves them, keeps them together and is the guardian of all souls and above and over all things.” It is not permissible to say, “He is carried. He is below.” It would be the only expression that would not make any sense. Thus, both the word and meaning would be destroyed.” Abu Qurrah than said, “Do you then consider a false Hadith the Hadith that says, “When Allah becomes angry His anger becomes known to the angels who carry al-‘Arsh. They at such time feel the weight of His anger on their shoulders. They then bow down in prostration. When Allah’s anger goes away it becomes light and the angels return to their places.” Imam abu al-Hassan (a.s.) said, “Tell me about Allah, the Most Holy, the Most High. From the time He condemned Satan until today is He not angry with Satan? When did He become happy with Satan? As you say He is still angry with Satan, his friend and followers. How would you dare speak of your Lord as under going changes from one condition to another condition and that what happens to the creatures happens to Him also. He is the Most Glorious, the Most High. He does not banish with those who banish and does not change with those who change. He is not replaced with those who are replaced. The creatures are under His guardianship and they all are dependent on Him. He is Self-sufficient and independent of others.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/78)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 336,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "رِبْعِيِّ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/387",
              "text": "الْفُضَيْلِ بْنِ يَسَارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:20:3",
        "relations": {
          "Mentions": [
            "/books/quran:2:255"
          ]
        },
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ جَلَّ وَ عَزَّ وَسِعَ كُرْسِيُّهُ السَّماواتِ وَ الْأَرْضَ فَقَالَ يَا فُضَيْلُ كُلُّ شَيْ‏ءٍ فِي الْكُرْسِيِّ السَّمَاوَاتُ وَ الْأَرْضُ وَ كُلُّ شَيْ‏ءٍ فِي الْكُرْسِيِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazan, from Hammad Bin Isa, from Rabie Bin Abdullah, from Al Fuzayl Bin Yasaar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Majestic and Mighty <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h255\">[2:255]</a> His Chair extends over the skies and the earth</span>. So he<sup>asws</sup> said: ‘O Fuzayl! Everything is in the Chair (الْكُرْسِيِّ). The skies, and the earth and everything, is in the Chair (الْكُرْسِيِّ)’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Isma‘il has narrated from Fadl ibn Shadhan from Hammad ibn ‘Isa from Rabi‘i ibn ‘Abdallah from Fudayl ibn Yasar who has said the following. “I asked Imam abu ‘Abdallah (a.s.) about the words of Allah, the Most Holy, the Most High, “His al-Kursi (the Throne) encompasses the heavens and earth.” He said, “O Fudayl everything is the al-Kursi (the Throne), the heavens and earth everything is in al-Kursi.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/79)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 337,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/457",
              "text": "الْحَجَّالِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/301",
              "text": "ثَعْلَبَةَ بْنِ مَيْمُونٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/214",
              "text": "زُرَارَةَ بْنِ أَعْيَنَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَجَّالِ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:20:4",
        "relations": {
          "Mentions": [
            "/books/quran:2:255"
          ]
        },
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ جَلَّ وَ عَزَّ وَسِعَ كُرْسِيُّهُ السَّماواتِ وَ الْأَرْضَ السَّمَاوَاتُ وَ الْأَرْضُ وَسِعْنَ الْكُرْسِيَّ أَمِ الْكُرْسِيُّ وَسِعَ السَّمَاوَاتِ وَ الْأَرْضَ فَقَالَ بَلِ الْكُرْسِيُّ وَسِعَ السَّمَاوَاتِ وَ الْأَرْضَ وَ الْعَرْشُ وَ كُلَّ شَيْ‏ءٍ وَسِعَ الْكُرْسِيُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhamad Bin Yahya, from Ahmad in Muhammad Bin Isa, from Al Hajjal, from Sa’alba Bin Maymoun, from Zurara Bin Ayn who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Majestic and Mighty <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h255\">[2:255]</a> His Chair extends over the skies and the earth</span>, ‘Are the skies and the earth more extensive than the Chair (الْكُرْسِيِّ) or is the Chair (الْكُرْسِيِّ) more extensive than the skies and the earth?’. So he<sup>asws</sup> said: ‘But, the Chair (الْكُرْسِيِّ) is more extensive than the skies and the earth and the Throne (الْعَرْشُ) and everything. The Chair (الْكُرْسِيِّ) is more extensive’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hajjal form Tha‘labah ibn Maymun from Zurarah ibn ’a‘yun who has said the following. “I asked Imam abu ‘Abdallah (a.s.), ‘The heavens and the earth are (contained in His al-Kursi) under His dominion . .’ <a href=\"/#/books/quran:2#h255\">[2:255]</a> Do the heavens and earth contain the al-Kursi or that the latter contains the former?” He said that it is al-Kursi that contains the heavens and earth and all things are contained in al-Kursi.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (79/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 338,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "فَضَالَةَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/458",
              "text": "عَبْدِ اللَّهِ بْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/214",
              "text": "زُرَارَةَ بْنِ أَعْيَنَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:20:5",
        "relations": {
          "Mentions": [
            "/books/quran:2:255"
          ]
        },
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَسِعَ كُرْسِيُّهُ السَّماواتِ وَ الْأَرْضَ السَّمَاوَاتُ وَ الْأَرْضُ وَسِعْنَ الْكُرْسِيَّ أَوِ الْكُرْسِيُّ وَسِعَ السَّمَاوَاتِ وَ الْأَرْضَ فَقَالَ إِنَّ كُلَّ شَيْ‏ءٍ فِي الْكُرْسِيِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Abdullah Bin Bukeyr, from Zurara Bin Ayn who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h255\">[2:255]</a> His Chair extends over the skies and the earth</span>, ‘Are the skies and the earth more extensive than the Chair (الْكُرْسِيِّ) or is the Chair (الْكُرْسِيِّ) more extensive than the skies and the earth?’. So he<sup>asws</sup> said: ‘Everything is in the Chair (الْكُرْسِيِّ)’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Sa‘id from Fudala ibn Ayyub from ‘Abdallah ibn Bukayr from Zurara ibn ’Ayun who has said the following. “I asked Imam abu ‘Abdallah (a.s.) about the words of Allah, ‘The heavens and the earth are (contained in His al-Kursi) under His dominion.. .’ <a href=\"/#/books/quran:2#h255\">[2:255]</a> Do the heavens and earth contain the al-Kursi or that the latter contains the former?” He said that all things are contained in al-Kursi.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/80)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 339,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/239",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/459",
              "text": "مُحَمَّدِ بْنِ الْفُضَيْلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:20:6",
        "text": [
          " حَمَلَةُ الْعَرْشِ وَ الْعَرْشُ الْعِلْمُ ثَمَانِيَةٌ أَرْبَعَةٌ مِنَّا وَ أَرْبَعَةٌ مِمَّنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr, from Muhammad Bin Al Fuzayl, from Abu Hamza, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The carriers of the Throne (الْعَرْشُ), and the Throne (الْعَرْشُ) is the Knowledge, are eight – four from us<sup>asws</sup> and four from the one Allah<sup>azwj</sup> so Desires’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ahmad ibn Muhammad ibn abu Nasr from Muhammad ibn al-Fudayl from abu Hamza from Imam abu ‘abdallah (a.s.) who said the following. “The carriers of al-‘Arsh (the Throne), al-‘Arsh and al-‘Ilm (knowledge) are eight. Four of these are from us and the rest are whoever Allah will chose.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/81)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 340,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/461",
              "text": "دَاوُدَ الرَّقِّيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ دَاوُدَ الرَّقِّيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:20:7",
        "relations": {
          "Mentions": [
            "/books/quran:11:7",
            "/books/quran:11:8"
          ]
        },
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ كانَ عَرْشُهُ عَلَى الْماءِ فَقَالَ مَا يَقُولُونَ قُلْتُ يَقُولُونَ إِنَّ الْعَرْشَ كَانَ عَلَى الْمَاءِ وَ الرَّبُّ فَوْقَهُ فَقَالَ كَذَبُوا مَنْ زَعَمَ هَذَا فَقَدْ صَيَّرَ اللَّهَ مَحْمُولًا وَ وَصَفَهُ بِصِفَةِ الْمَخْلُوقِ وَ لَزِمَهُ أَنَّ الشَّيْ‏ءَ الَّذِي يَحْمِلُهُ أَقْوَى مِنْهُ",
          "قُلْتُ بَيِّنْ لِي جُعِلْتُ فِدَاكَ فَقَالَ إِنَّ اللَّهَ حَمَّلَ دِينَهُ وَ عِلْمَهُ الْمَاءَ قَبْلَ أَنْ يَكُونَ أَرْضٌ أَوْ سَمَاءٌ أَوْ جِنٌّ أَوْ إِنْسٌ أَوْ شَمْسٌ أَوْ قَمَرٌ فَلَمَّا أَرَادَ اللَّهُ أَنْ يَخْلُقَ الْخَلْقَ نَثَرَهُمْ بَيْنَ يَدَيْهِ فَقَالَ لَهُمْ مَنْ رَبُّكُمْ فَأَوَّلُ مَنْ نَطَقَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ الْأَئِمَّةُ صَلَوَاتُ اللَّهِ عَلَيْهِمْ فَقَالُوا أَنْتَ رَبُّنَا",
          "فَحَمَّلَهُمُ الْعِلْمَ وَ الدِّينَ ثُمَّ قَالَ لِلْمَلَائِكَةِ هَؤُلَاءِ حَمَلَةُ دِينِي وَ عِلْمِي وَ أُمَنَائِي فِي خَلْقِي وَ هُمُ الْمَسْئُولُونَ ",
          "ثُمَّ قَالَ لِبَنِي آدَمَ أَقِرُّوا لِلَّهِ بِالرُّبُوبِيَّةِ وَ لِهَؤُلَاءِ النَّفَرِ بِالْوَلَايَةِ وَ الطَّاعَةِ فَقَالُوا نَعَمْ رَبَّنَا أَقْرَرْنَا فَقَالَ اللَّهُ لِلْمَلَائِكَةِ اشْهَدُوا فَقَالَتِ الْمَلَائِكَةُ شَهِدْنَا عَلَى أَنْ لَا يَقُولُوا غَداً إِنَّا كُنَّا عَنْ هذا غافِلِينَ. ",
          "أَوْ تَقُولُوا إِنَّما أَشْرَكَ آباؤُنا مِنْ قَبْلُ وَ كُنَّا ذُرِّيَّةً مِنْ بَعْدِهِمْ أَ فَتُهْلِكُنا بِما فَعَلَ الْمُبْطِلُونَ يَا دَاوُدُ وَلَايَتُنَا مُؤَكَّدَةٌ عَلَيْهِمْ فِي الْمِيثَاقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Ibn Mahboub, from Abdul Rahman Bin Kaseer, from Dawood Al Raqqy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h7\">[11:7]</a> and His Throne was upon the water</span>. So he<sup>asws</sup> said: ‘What are they (people) saying?’ I said, ‘They are saying that the Throne (الْعَرْشُ) was upon the water and the Lord<sup>azwj</sup> above it’. So he<sup>asws</sup> said: ‘They are lying! The one who claim this, so he has rendered Allah<sup>azwj</sup> as a carried One, and described Him<sup>azwj</sup> by a description of the creatures, and necessitated it that the thing which is carrying Him<sup>azwj</sup> is stronger than Him<sup>azwj</sup>’. ",
            "I said, ‘Clarify it for me, may I be sacrificed for you<sup>asws</sup>!’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Loaded His<sup>azwj</sup> Religion and His<sup>azwj</sup> Knowledge upon the water, before the coming into being of the earth, or sky, or Jinn, or humans, or sun, or moon. So when Allah<sup>azwj</sup> Intended that He<sup>azwj</sup> Creates the creatures, Scattered them in front of Him<sup>azwj</sup>, and Said to them: “Who is your Lord<sup>azwj</sup>?” So the first one to speak was Rasool-Allah<sup>saww</sup> and Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup>, and the Imams<sup>asws</sup>, so they said: ‘You<sup>azwj</sup> are our<sup>asws</sup> Lord<sup>azwj</sup>’. ",
            "So He<sup>azwj</sup> Loaded the Knowledge and the Religion, then Said to the Angels: “They<sup>asws</sup> are the carriers of My<sup>azwj</sup> Religion, and My<sup>azwj</sup> Knowledge, and My<sup>azwj</sup> Trustees among My<sup>azwj</sup> creatures, and they would be asked from’. ",
            "Then He<sup>azwj</sup> Said to the Children of Adam<sup>as</sup>: “Acknowledge to Allah<sup>azwj</sup> with the Lordship, and to these persons<sup>asws</sup> with the Wilayah and the obedience!” So they said, ‘Yes, our Lord<sup>azwj</sup>, we acknowledge’. So Allah<sup>azwj</sup> Said to the Angels: “Bear witness!” So the Angels said: ‘We bear witness upon that they cannot be saying tomorrow that we were ignorant of this’. ",
            "Or you should be saying, ‘But rather, it was our fathers who associated (committed Shirk), and we were the offspring from after them, so should we be destroyed with what the false ones did?’ O Dawood! Our<sup>asws</sup> Wilayah is confirmed upon them in the Covenant’."
          ],
          "en.sarwar": [
            " 7. Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from ibn Mahbub from ‘Abd al-Rahman ibn Kathir from Dawud al-Ruqyy who has said the following. “I asked Imam abu ‘Abdallah (a.s.) about the words of Allah, ‘. . His Throne existed on water . <a href=\"/#/books/quran:11#h8\">[11:8]</a>.’” The Imam asked, “What do they say about it?” I said, “They say that al-‘Arsh (the Throne) was on the water and the Lord was on top of it.” The Imam then said, “They have said a lie. Whoever would think that way he has considered Allah as being carried and has described Him with the qualities of the creatures which involves that the thing that carries Him is stronger than Him.” I then asked, may Allah take my soul for your service, please explain it to me.” The Imam then said, “Allah made water to carry His religion and His knowledge before there were the earth, the heavens, the Jinns, the human beings, the sun and the moon. When Allah willed to create the creatures He spread them before His-self and said to them, “Who is you Lord? The first ones who spoke were the Holy Prophet and Amirul Mu‘minin Ali (a.s.) and the Imams (a.s.). They all said, “You are our Lord.” He then made them to carry the religion and the knowledge. Then He spoke to the angels, “These are the carriers of My religion and knowledge, My trustees in My people and they are responsible (or questions will be asked about them). Then Allah spoke to the children of Adam, “Acknowledge that Allah is the Lord and acknowledge that these people are the authorities (of Allah) among you and that obedience to them is obligatory. They said, “O our Lord, we acknowledge.” Allah then told the angels, “Bear witness to this.” The angels said, “We bear witness so that they, tomorrow will not say, ‘We were not aware of this or say that our forefathers have worshipped idols before us and we were only their offspring. Will You then destroy us just because what the followers of falsehood have done?” O Dawud, our authority over them was strongly stressed up on at the time of the covenant.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:20",
  "kind": "verse_list"
}