{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:1:3:21",
        "titles": {
          "ar": "بَابُ الرُّوحِ",
          "en": "Chapter 21 – The Spirit"
        }
      }
    ],
    "index": 44,
    "local_index": 21,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:1:3:22",
        "titles": {
          "ar": "بَابُ جَوَامِعِ التَّوْحِيدِ",
          "en": "Chapter 22 – Comprehensive of the Tawheed (Oneness)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:1:3:20",
        "titles": {
          "ar": "بَابُ الْعَرْشِ وَ الْكُرْسِيِّ",
          "en": "Chapter 20 – The Throne (الْعَرْشِ ) and the Chair (الْكُرْسِيِّ)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:21",
    "titles": {
      "ar": "بَابُ الرُّوحِ",
      "en": "Chapter 21 – The Spirit"
    },
    "verse_count": 4,
    "verse_start_index": 340,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/82)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 341,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:21:1",
        "refs": {
          "Quran": [
            "/books/quran:15:29"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنِ الْأَحْوَلِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرُّوحِ الَّتِي فِي آدَمَ ( عليه السلام ) قَوْلُهُ فَإِذا سَوَّيْتُهُ وَ نَفَخْتُ فِيهِ مِنْ رُوحِي قَالَ هَذِهِ رُوحٌ مَخْلُوقَةٌ وَ الرُّوحُ الَّتِي فِي عِيسَى مَخْلُوقَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Umeyr, from Ibn Azina, from Al Ahowl who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Spirit which was inside Adam<sup>as</sup> as per His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h29\">[15:29]</a> So when I have Made him complete and Blown into him from My Spirit</span>. He<sup>asws</sup> said: ‘This is a Created Spirit, and the Spirit which was inside Isa<sup>as</sup>, was (also) a Created being’."
          ],
          "en.sarwar": [
            " 1. It is narrated from a number of our people from Ahmad ibn Muhammad ibn ‘Isa from ibn abu ‘Umayr from ’Udhayna from al-Ahwal who has said the following. “I asked Imam abu ‘Abdallah (a.s.) about the spirit (Ruh) which was in Adam as indicated in the Holy Quran, ‘When it is properly shaped and I have blown My Spirit into it <a href=\"/#/books/quran:15#h29\">[15:29]</a>.’” Imam abu ‘Abdallah (a.s.) replied, “This is a created spirit and the spirit in Jesus is created.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/83)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 342,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:21:2",
        "refs": {
          "Quran": [
            "/books/quran:4:171"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَجَّالِ عَنْ ثَعْلَبَةَ عَنْ حُمْرَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ رُوحٌ مِنْهُ قَالَ هِيَ رُوحُ اللَّهِ مَخْلُوقَةٌ خَلَقَهَا اللَّهُ فِي آدَمَ وَ عِيسَى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Al Hajjal, from Sa’alba, from Humran who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h171\">[4:171]</a> and a Spirit from Him</span>. He<sup>asws</sup> said: ‘It is a Spirit of Allah<sup>azwj</sup>, a Created being. Allah<sup>azwj</sup> Created it in Adam<sup>as</sup> and Isa<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 2. It is narrated from a number of our people from Ahmad ibn Muhammad ibn ‘Isa from al-Hajjal from Tha‘laba from Himran who has said the following. “I asked Imam abu ‘Abdallah (a.s.) about the words of Allah, the Most Holy, the Most High, ‘The spirit from Him’. Imam abu ‘Abdallah (a.s.) replied, “It is the spirit (Ruh) from Allah created in Adam and Jesus.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (83/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 343,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:21:3",
        "refs": {
          "Quran": [
            "/books/quran:15:29"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ عُرْوَةَ عَنْ عَبْدِ الْحَمِيدِ الطَّائِيِّ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ نَفَخْتُ فِيهِ مِنْ رُوحِي كَيْفَ هَذَا النَّفْخُ فَقَالَ إِنَّ الرُّوحَ مُتَحَرِّكٌ كَالرِّيحِ وَ إِنَّمَا سُمِّيَ رُوحاً لِأَنَّهُ اشْتَقَّ اسْمَهُ مِنَ الرِّيحِ وَ إِنَّمَا أَخْرَجَهُ عَنْ لَفْظَةِ الرِّيحِ لِأَنَّ الْأَرْوَاحَ مُجَانِسَةٌ لِلرِّيحِ وَ إِنَّمَا أَضَافَهُ إِلَى نَفْسِهِ لِأَنَّهُ اصْطَفَاهُ عَلَى سَائِرِ الْأَرْوَاحِ كَمَا قَالَ لِبَيْتٍ مِنَ الْبُيُوتِ بَيْتِي وَ لِرَسُولٍ مِنَ الرُّسُلِ خَلِيلِي وَ أَشْبَاهِ ذَلِكَ وَ كُلُّ ذَلِكَ مَخْلُوقٌ مَصْنُوعٌ مُحْدَثٌ مَرْبُوبٌ مُدَبَّرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Al Qasim Bin Urwa, from Abdul Hameed Al Taiy, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h29\">[15:29]</a> and Blown into him from My Spirit</span>. How was this Blowing?’ So he<sup>asws</sup> said: ‘The Spirit (Rooh) moves like the wind (Reeh), and rather it is named as ‘Rooh’ because it derived its name from the wind (Reeh), and rather it is extracted from the word ‘Reeh’, because the spirits (Arwaah) are the genus of the ‘Reeh’ (wind), and rather He<sup>azwj</sup> Supplemented it to His<sup>azwj</sup> Own Self, because He<sup>azwj</sup> Chose it over the rest of the spirits, just as He<sup>azwj</sup> Said for a House (Kabah) from the houses, ‘My house’, and for a Rasool<sup>as</sup> from the Rasools<sup>as</sup>, ‘My<sup>azwj</sup> Friend’, and the likes of that; and all of that is a Created being, newly occurred, Nourished, Regulated’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from Qasin ibn ‘Urwa from ‘Abd al-Hamid al- Ta’i from Muhammad ibn Muslim who has said the following. “I asked Imam abu ‘Abdallah (a.s.) about the words of Allah, the Most Holy, the Most High, ‘I have blown My Spirit into it <a href=\"/#/books/quran:15#h29\">[15:29]</a>’” The Imam (a.s.) replied, “The spirit has motion like winds. It is called spirit (Ruh) because the word is a derivative of Rih (wind). This derivative is selected because the spirits are similar or are of the genus of the Rih (wind). He has given His own possessive case because He selected it from among the other spirits just as He has said about a House from among the houses ‘My house’ and to a messenger from among the messengers ‘My friend’ and so on. All such things are created, invented, newly produced and are cherished by the Lord.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (84/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 344,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:21:4",
        "refs": {
          "Quran": [
            "/books/quran:15:29"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ بَحْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَمَّا يَرْوُونَ أَنَّ اللَّهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ فَقَالَ هِيَ صُورَةٌ مُحْدَثَةٌ مَخْلُوقَةٌ وَ اصْطَفَاهَا اللَّهُ وَ اخْتَارَهَا عَلَى سَائِرِ الصُّوَرِ الْمُخْتَلِفَةِ فَأَضَافَهَا إِلَى نَفْسِهِ كَمَا أَضَافَ الْكَعْبَةَ إِلَى نَفْسِهِ وَ الرُّوحَ إِلَى نَفْسِهِ فَقَالَ بَيْتِيَ وَ نَفَخْتُ فِيهِ مِنْ رُوحِي ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Abdullah Bin Bahr, from Abu Ayoub Al Khazzaz, from Muahammad Bin Muslim who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about what they (reporters) are reporting, that Allah<sup>azwj</sup> Created Adam<sup>as</sup> upon His<sup>azwj</sup> Image’. So he<sup>asws</sup> said: ‘It was a newly occurring image, Created, and Allah<sup>azwj</sup> Chose it and Selected it over the rest of the different images. So He<sup>azwj</sup> Chose it to Himself<sup>azwj</sup> just as He<sup>azwj</sup> Supplemented the Kabah to Himself<sup>azwj</sup>, and the Spirit to Himself<sup>azwj</sup>, so He<sup>azwj</sup> Said:<span class=\"ibTxt\"><a href=\"/#/books/quran:15#h29\">[15:29]</a> and Blown into him from My Spirit</span>’."
          ],
          "en.sarwar": [
            " 4. It is narrated from a number of our people from Ahmad ibn Muhammad ibn Khalid from his father from ‘Abdallah ibn Bahr from abu Ayyub al-Khazzan from Muhammad ibn Muslim who has said the following. “I asked Imam abu ‘Abdallah (a.s.) about what people narrate that Allah created Adam in His-own form.” The Imam (a.s.) replied, “It is created and newly invented form. Allah selected and chose it over the other various forms and gave His-own possessive case just like He has done so about Ka‘bah and the spirit saying, ‘My house’ ‘I have blown My spirit in Him.’”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:21",
  "kind": "verse_list"
}