{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:1:3:23",
        "titles": {
          "ar": "بَابُ النَّوَادِرِ",
          "en": "Chapter 23 – The Miscellaneous"
        }
      }
    ],
    "index": 46,
    "local_index": 23,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:1:3:24",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْبَدَاءِ</span>",
          "en": "Chapter 24 – The Changing of Allah<sup>azwj</sup>’s Decision (الْبَدَاءِ)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:1:3:22",
        "titles": {
          "ar": "بَابُ جَوَامِعِ التَّوْحِيدِ",
          "en": "Chapter 22 – Comprehensive of the Tawheed (Oneness)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:23",
    "titles": {
      "ar": "بَابُ النَّوَادِرِ",
      "en": "Chapter 23 – The Miscellaneous"
    },
    "verse_count": 11,
    "verse_start_index": 351,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/111)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 352,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:1",
        "refs": {
          "Quran": [
            "/books/quran:28:88"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَمَّنْ ذَكَرَهُ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ النَّصْرِيِّ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى كُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ فَقَالَ مَا يَقُولُونَ فِيهِ قُلْتُ يَقُولُونَ يَهْلِكُ كُلُّ شَيْ‏ءٍ إِلَّا وَجْهَ اللَّهِ فَقَالَ سُبْحَانَ اللَّهِ لَقَدْ قَالُوا قَوْلًا عَظِيماً إِنَّمَا عَنَى بِذَلِكَ وَجْهَ اللَّهِ الَّذِي يُؤْتَى مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Nu’man, from Sayf Bin Ameyra, from the one who mentioned it, from Al Haris Bin Al Mugheira Al Nasry who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about the Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\"><a href=\"/#/books/quran:28#h88\">[28:88]</a> everything will perish except for His Face</span>. So he<sup>asws</sup> said: ‘What are they (people) saying with regards to it?’ I said, ‘They are saying, ‘Everything shall perish except for the Face of Allah<sup>azwj</sup>’’. So he<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! They have spoken a grievous speech! But rather, it Means by that the Face (Perspective) of Allah<sup>azwj</sup> Which Came from Him<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Ni‘man from Sayf ibn ‘Umayr from those whom he mentioned from al-Harith ibn al-Mughira al-Nasri who has said the following. “A person asked Imam abu ‘Abdallah (a.s.) about the words of Allah, the Most Holy, the Most High, “Everything will be destroyed except God. . .” <a href=\"/#/books/quran:28#h88\">[28:88]</a> The Imam (a.s.) asked, “What do they say about it?” I replied, “They say that everything will perish except the face of Allah.” The Imam (a.s.) said, “Glory belongs to Allah. What they say is monstrous. What is meant thereby is that aspect of Allah’s relation with people through which (persons of highest degree of excellence) they establish faith in Him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/113)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 353,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:2",
        "refs": {
          "Quran": [
            "/books/quran:28:88",
            "/books/quran:4:80"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ صَفْوَانَ الْجَمَّالِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ كُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ قَالَ مَنْ أَتَى اللَّهَ بِمَا أُمِرَ بِهِ مِنْ طَاعَةِ مُحَمَّدٍ ( صلى الله عليه وآله ) فَهُوَ الْوَجْهُ الَّذِي لَا يَهْلِكُ وَ كَذَلِكَ قَالَ مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ اللَّهَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ahmad Bin Muhammad Bin Abu Nasr, from Safwan Al Jammal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:28#h88\">[28:88]</a> everything will perish except for His Face</span>. He<sup>asws</sup> said: ‘The one who comes to Allah<sup>azwj</sup> with what He<sup>azwj</sup> Commanded with from being obedient to Muhammad<sup>saww</sup>, so it is the Face (Perspective) of Allah<sup>azwj</sup> which will not perish, and for that He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h80\">[4:80]</a> Whoever obeys the Rasool, so he has obeyed Allah</span>’."
          ],
          "en.sarwar": [
            " 2. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from Ahmad ibn Muhammad ibn abu Nasr from Safwan al-Jammal from Imam abu ‘Abdallah (a.s.) the following. “I asked Imam abu ‘Abdallah (a.s.) about the words of Allah, the Most Holy, the Most High, “Everything will be destroyed except God. . .” <a href=\"/#/books/quran:28#h88\">[28:88]</a> The Imam (a.s.) said, “It means whoever comes to Allah through obeying His commandments, i.e. following Prophet Muhammad (s.a.) is the face (the aspect of Allah’s relation with people) of Allah that does not perish. So also is His words, “One who obeys the Messenger has certainly obeyed God . .” <a href=\"/#/books/quran:4#h80\">[4:80]</a>."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/113)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 354,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي سَلَّامٍ النَّخَّاسِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ نَحْنُ الْمَثَانِي الَّذِي أَعْطَاهُ اللَّهُ نَبِيَّنَا مُحَمَّداً ( صلى الله عليه وآله ) وَ نَحْنُ وَجْهُ اللَّهِ نَتَقَلَّبُ فِي الْأَرْضِ بَيْنَ أَظْهُرِكُمْ وَ نَحْنُ عَيْنُ اللَّهِ فِي خَلْقِهِ وَ يَدُهُ الْمَبْسُوطَةُ بِالرَّحْمَةِ عَلَى عِبَادِهِ عَرَفَنَا مَنْ عَرَفَنَا وَ جَهِلَنَا مَنْ جَهِلَنَا وَ إِمَامَةَ الْمُتَّقِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Abu Sallam Al Nakhhas, from one of our companions, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘We<sup>asws</sup> are ‘الْمَثَانِي’ the double which Allah<sup>azwj</sup> Gave to our Prophet Muhammad<sup>saww</sup>, and we<sup>asws</sup> are the Face of Allah<sup>azwj</sup>. We<sup>azwj</sup> turn over between you apparently, and we<sup>asws</sup> are the Eye of Allah<sup>azwj</sup> among His<sup>azwj</sup> creatures, and His<sup>azwj</sup> Hand Extended with the Mercy upon His<sup>azwj</sup> servants. The one who recognised us<sup>asws</sup>, recognised us<sup>asws</sup>, and the one who is ignorant of us<sup>asws</sup> is ignorant of us<sup>asws</sup>, and (we<sup>asws</sup> are) the Imams<sup>asws</sup> of the pious’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from abu Salam al-Khannas from some of our people from Imam abu Ja‘far (a.s.) who has said the following. “We (family of Prophet Muhammad) are the al-Mathani (one of two) that Allah gave to Prophet Muhammad (s.a.). We are the Wajhullah (face of Allah, meaning a certain aspect of Allah’s relation with people) that move among you on earth. We are the eyes of Allah (overseers or observers from the side of Allah) in His creatures. We are the hands of Allah that are open with blessings for His servants. Those who wanted to know us have known us. There are people who are ignorant about us they are ignorant of us and of the leadership of the pious people.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/115)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 355,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:4",
        "refs": {
          "Quran": [
            "/books/quran:7:180"
          ]
        },
        "text": [
          "لْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ وَ مُحَمَّدُ بْنُ يَحْيَى جَمِيعاً عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لِلَّهِ الْأَسْماءُ الْحُسْنى فَادْعُوهُ بِها قَالَ نَحْنُ وَ اللَّهِ الْأَسْمَاءُ الْحُسْنَى الَّتِي لَا يَقْبَلُ اللَّهُ مِنَ الْعِبَادِ عَمَلًا إِلَّا بِمَعْرِفَتِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary and Muhammad Bin Yahya, altogether from Ahmad Bin Is’haq, from Sa’dan Bin Muslim, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h180\">[7:180]</a> And Allah's are the Best Names, therefore call on Him by these</span>. He<sup>asws</sup> said: ‘We<sup>asws</sup>, by Allah<sup>azwj</sup>, are ‘الْأَسْماءُ الْحُسْنى’ the good names which Allah<sup>azwj</sup> will not be Accepting the deeds from the servants except (if they are) with our<sup>asws</sup> recognition’."
          ],
          "en.sarwar": [
            " 4. Al-Husayn ibn Muhammad al-Ash‘ari and Muhammad ibn Yahya altogether have narrated from Ahmad ibn Ishaq from Su‘dan ibn Muslim from Mu‘awiya ibn ‘Ammar from abu ‘Abdallah (a.s.) who has said the following about the words of Allah. “God has the most blessed Names. You should address Him in your worship by these Names . .” <a href=\"/#/books/quran:7#h180\">[7:180]</a> The Imam said, “We, I swear by Allah, are the most blessed names of Allah without which Allah does not accept any of the good deeds of His servants until they know us properly.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/117)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 356,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:5",
        "text": [
          "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْحَسَنِ بْنِ سَعِيدٍ عَنِ الْهَيْثَمِ بْنِ عَبْدِ اللَّهِ عَنْ مَرْوَانَ بْنِ صَبَّاحٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ خَلَقَنَا فَأَحْسَنَ خَلْقَنَا وَ صَوَّرَنَا فَأَحْسَنَ صُوَرَنَا وَ جَعَلَنَا عَيْنَهُ فِي عِبَادِهِ وَ لِسَانَهُ النَّاطِقَ فِي خَلْقِهِ وَ يَدَهُ الْمَبْسُوطَةَ عَلَى عِبَادِهِ بِالرَّأْفَةِ وَ الرَّحْمَةِ وَ وَجْهَهُ الَّذِي يُؤْتَى مِنْهُ وَ بَابَهُ الَّذِي يَدُلُّ عَلَيْهِ وَ خُزَّانَهُ فِي سَمَائِهِ وَ أَرْضِهِ ",
          "بِنَا أَثْمَرَتِ الْأَشْجَارُ وَ أَيْنَعَتِ الثِّمَارُ وَ جَرَتِ الْأَنْهَارُ وَ بِنَا يَنْزِلُ غَيْثُ السَّمَاءِ وَ يَنْبُتُ عُشْبُ الْأَرْضِ وَ بِعِبَادَتِنَا عُبِدَ اللَّهُ وَ لَوْ لَا نَحْنُ مَا عُبِدَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Muhammad Bin Ismail, from Al Husayn Bin Al Hassan, from Bakr Bin Salih, from Al Hassan Bin Saeed, from Al Haysam Bin Abdullah, from Marwan Bin Sabbah who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Created us<sup>asws</sup>, so Optimised our<sup>asws</sup> creation; and He<sup>azwj</sup> Imaged us<sup>asws</sup>, so Optimised our<sup>asws</sup> images, and Made us<sup>asws</sup> to be His<sup>azwj</sup> Eye among His<sup>azwj</sup> servants, and His<sup>azwj</sup> Speaking Tongue among His<sup>azwj</sup> creatures, and His<sup>azwj</sup> Extended Hand upon His<sup>azwj</sup> creatures with the Leniency and the Mercy, and the Face (Perspective) which Came from Him<sup>azwj</sup>, and His<sup>azwj</sup> Door which He<sup>azwj</sup> can be come to, and His<sup>azwj</sup> Treasurers in His<sup>azwj</sup> sky and His<sup>azwj</sup> earth. ",
            "Due to us<sup>asws</sup> the trees are bearing fruit and the fruits are ripening, and the rivers are flowing, and due to us<sup>asws</sup> descend the rains of the sky and the vegetation of the earth is growing, and due to our<sup>asws</sup> worshipping Allah<sup>azwj</sup>. And, had it not been for us<sup>asws</sup>, Allah<sup>azwj</sup> would not be worshipped’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn abu ‘Abdallah ibn Muhammad ibn Isma‘il has narrated from al-Husayn ibn al-Hassan from Bakr ibn Salih from al-Hassan ibn Sa‘id from al-Haytham ibn ‘Abdallah from Marwan ibn Salih who has said that Imam abu ‘Abdallah has said the following. “Allah created us and made it well. He gave us our form and formed it well. He made us His eyes among His servants and His speaking tongue in His creatures. He made us His open hands over His servants with kindness and mercy. He has made us his face through which He is approached and his door that shows the way leading to Him. He made us His treasurers in the heavens and on earth. Through us the trees give fruit and the fruits ripen and the canals flow. Through us the skies send rain and plants grow on earth. Through our worship Allah is worshipped and were we not there Allah would not have been worshipped.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (118/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 357,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:6",
        "refs": {
          "Quran": [
            "/books/quran:48:10",
            "/books/quran:43:54",
            "/books/quran:43:55",
            "/books/quran:4:80"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ عَمِّهِ حَمْزَةَ بْنِ بَزِيعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَلَمَّا آسَفُونا انْتَقَمْنا مِنْهُمْ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يَأْسَفُ كَأَسَفِنَا وَ لَكِنَّهُ خَلَقَ أَوْلِيَاءَ لِنَفْسِهِ يَأْسَفُونَ وَ يَرْضَوْنَ وَ هُمْ مَخْلُوقُونَ مَرْبُوبُونَ فَجَعَلَ رِضَاهُمْ رِضَا نَفْسِهِ وَ سَخَطَهُمْ سَخَطَ نَفْسِهِ لِأَنَّهُ جَعَلَهُمُ الدُّعَاةَ إِلَيْهِ وَ الْأَدِلَّاءَ عَلَيْهِ",
          "فَلِذَلِكَ صَارُوا كَذَلِكَ وَ لَيْسَ أَنَّ ذَلِكَ يَصِلُ إِلَى اللَّهِ كَمَا يَصِلُ إِلَى خَلْقِهِ لَكِنْ هَذَا مَعْنَى مَا قَالَ مِنْ ذَلِكَ وَ قَدْ قَالَ مَنْ أَهَانَ لِي وَلِيّاً فَقَدْ بَارَزَنِي بِالْمُحَارَبَةِ وَ دَعَانِي إِلَيْهَا وَ قَالَ مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ اللَّهَ وَ قَالَ إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ اللَّهَ يَدُ اللَّهِ فَوْقَ أَيْدِيهِمْ ",
          "فَكُلُّ هَذَا وَ شِبْهُهُ عَلَى مَا ذَكَرْتُ لَكَ وَ هَكَذَا الرِّضَا وَ الْغَضَبُ وَ غَيْرُهُمَا مِنَ الْأَشْيَاءِ مِمَّا يُشَاكِلُ ذَلِكَ وَ لَوْ كَانَ يَصِلُ إِلَى اللَّهِ الْأَسَفُ وَ الضَّجَرُ وَ هُوَ الَّذِي خَلَقَهُمَا وَ أَنْشَأَهُمَا لَجَازَ لِقَائِلِ هَذَا أَنْ يَقُولَ إِنَّ الْخَالِقَ يَبِيدُ يَوْماً مَا لِأَنَّهُ إِذَا دَخَلَهُ الْغَضَبُ وَ الضَّجَرُ دَخَلَهُ التَّغْيِيرُ وَ إِذَا دَخَلَهُ التَّغْيِيرُ لَمْ يُؤْمَنْ عَلَيْهِ الْإِبَادَةُ",
          "ثُمَّ لَمْ يُعْرَفِ الْمُكَوِّنُ مِنَ الْمُكَوَّنِ وَ لَا الْقَادِرُ مِنَ الْمَقْدُورِ عَلَيْهِ وَ لَا الْخَالِقُ مِنَ الْمَخْلُوقِ تَعَالَى اللَّهُ عَنْ هَذَا الْقَوْلِ عُلُوّاً كَبِيراً بَلْ هُوَ الْخَالِقُ لِلْأَشْيَاءِ لَا لِحَاجَةٍ فَإِذَا كَانَ لَا لِحَاجَةٍ اسْتَحَالَ الْحَدُّ وَ الْكَيْفُ فِيهِ فَافْهَمْ إِنْ شَاءَ اللَّهُ تَعَالَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazie, from his uncle Hamza Bin Bazie, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:43#h55\">[43:55]</a> Then when they displeased Us, We Inflicted a retribution on them</span>. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic does not regret like we tend to regret, but He<sup>azwj</sup> Created Friends for Himself<sup>azwj</sup> who are regretting and being pleased, and they are creations, being Nourished. Thus, He<sup>azwj</sup> Made their<sup>asws</sup> pleasure as being His<sup>azwj</sup> Pleasure, and their<sup>asws</sup> anger as being His<sup>azwj</sup> Anger, because He<sup>azwj</sup> Made them<sup>asws</sup> as the inviters to Him<sup>azwj</sup>, and the Indicators to Him<sup>azwj</sup>. ",
            "So, due to that, they<sup>asws</sup> came to be like that, and it isn’t so that it (anger) comes to Allah<sup>azwj</sup> just as it tends to come to His<sup>azwj</sup> creatures. But, this is the Meaning of what He<sup>azwj</sup> Said from that, and He<sup>azwj</sup> has Said: “The one who offends a friend of Mine<sup>azwj</sup>, so he has duelled against Me<sup>azwj</sup> with the battle and called Me<sup>azwj</sup> to it”. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h80\">[4:80]</a> Whoever obeys the Rasool, so he has obeyed Allah</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:48#h10\">[48:10]</a> Surely, those who swear allegiance to you do but swear allegiance to Allah; the hand of Allah is above their hands</span>.",
            "So, all of this and the likes of it are upon what we<sup>asws</sup> mentioned to you, and like this is the (Divine) Pleasure, and the Anger, and other than these two from the things which are identical to that. And had it been so that the regret, and the weariness arrives to Allah<sup>azwj</sup>, and He<sup>azwj</sup> is the One<sup>azwj</sup> Who Created both, it would be allowed for a speaker to say this that one day the Creator would be obliterated, because He<sup>azwj</sup>, when the anger and the weariness enters Him<sup>azwj</sup>, the change would enter Him<sup>azwj</sup>, the obliteration would not be safe upon Him<sup>azwj</sup>.",
            "Then it would not be recognied, the Bringer into being from the comer into being, nor the Powerful from the one empowered upon, nor the Creator from the Created. Exalted is Allah<sup>azwj</sup> from this speech, Loftier, Greater. But, He<sup>azwj</sup> is the Creator of the things, not for a need. So when there was no need, the limitation is impossible, (as well as the) ‘how’ (Qualitative State) regarding Him<sup>azwj</sup>. Therefore, understand, if Allah<sup>azwj</sup> the Exalted so Desires’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Isma‘il ibn Bazi‘a from his uncle, Hamza ibn Bazi‘a from abu ‘Abdallah (a.s.) who has said the following about the words of Allah. “When they invoked Our anger, <a href=\"/#/books/quran:43#h54\">[43:54]</a>. We took revenge on them . .” <a href=\"/#/books/quran:43#h55\">[43:55]</a>. “Allah, the Most Holy, the Most High, does not become frustrated the way we do. But He has created friends for his-Own-self who become frustrated and at times happy. They are created. They worship (Allah). He has designed their happiness to be His Own happiness and their anger as His-Own anger. It is because He has assigned them to guide people to Him and serve as proof of His existence. For this reason such conditions belong to them. This does not reach Allah the way it reaches people. The meaning is what just mentioned. He has also said, “Whoever would humiliate My friends such people have declared war against Me with challenge.” He has also said, “One who obeys the Messenger has certainly obeyed God. . .” <a href=\"/#/books/quran:4#h80\">[4:80]</a>. “Those who pledge obedience to you are, in fact, pledging obedience to God. The hands of God are above their hands. . .” <a href=\"/#/books/quran:48#h10\">[48:10]</a>. All of these and other similar ones mean what I just said. The same is the case with anger and happiness and other such matters. Had it been possible for frustration and anger to reach Allah one could have said that one-day Allah will banish altogether. It is because if anger and frustration would reach Him changes also would take place in Him and, thus, He will not remain safe from banishment. As a result, there would exist no distinction between the created and the Creator, between the Almighty and those subject to such might and power. No distinction would remain between the created and the Creator. Allah is far above such things, and is the Most High and Most Great. He is the Creator of all things not because he needed them. If it would be without the need then it would be impossible to limit Him with limits and conditions. Note this if Allah would will it to be so.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/120)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 358,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ حُمْرَانَ عَنْ أَسْوَدَ بْنِ سَعِيدٍ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) فَأَنْشَأَ يَقُولُ ابْتِدَاءً مِنْهُ مِنْ غَيْرِ أَنْ أَسْأَلَهُ نَحْنُ حُجَّةُ اللَّهِ وَ نَحْنُ بَابُ اللَّهِ وَ نَحْنُ لِسَانُ اللَّهِ وَ نَحْنُ وَجْهُ اللَّهِ وَ نَحْنُ عَيْنُ اللَّهِ فِي خَلْقِهِ وَ نَحْنُ وُلَاةُ أَمْرِ اللَّهِ فِي عِبَادِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Nasr, from Muhammad Bin Humran, from Aswad Bin Saeed who said, ",
            "‘I was in the presence of Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> initiated saying from without having been questioned: ‘We<sup>asws</sup> are the Proof<sup>asws</sup> of Allah<sup>azwj</sup>, and we<sup>asws</sup> are the Door of Allah<sup>azwj</sup>, and we<sup>asws</sup> are the tongue of Allah<sup>azwj</sup>, and we<sup>asws</sup> are the Face of Allah<sup>azwj</sup>, and we<sup>asws</sup> are the eye of Allah<sup>azwj</sup> among His<sup>azwj</sup> creatures, and we<sup>asws</sup> are the Masters of the Command of Allah<sup>azwj</sup> among His<sup>azwj</sup> servants’."
          ],
          "en.sarwar": [
            " 7. A number of our people have narrated from Ahmad ibn Muhammad ibn abu Nasr from Muhammad ibn Humran from Aswad ibn Sa‘id who has said the following. “I was in the presence of Imam abu Ja‘far (a.s.), who began to speak without any question from me.” “We are the authority of Allah. We are the door to Allah. We are the tongue of Allah. We are the face of Allah. We are the eyes of Allah in His people. We are the authority in the commandments of Allah among His servants.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول بهاشم بنغابي وعمار الجنب ي  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (120/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 359,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَسَّانَ الْجَمَّالِ قَالَ حَدَّثَنِي هَاشِمُ بْنُ أَبِي عُمَارَةَ الْجَنْبِيُّ قَالَ سَمِعْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ أَنَا عَيْنُ اللَّهِ وَ أَنَا يَدُ اللَّهِ وَ أَنَا جَنْبُ اللَّهِ وَ أَنَا بَابُ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ahmad Bin Muhammad Bin Abu Nasr, from Hassan Al Jammal who said, ‘Hashim Bin Abu Umara Al Junbiyyi narrated to me saying, ",
            "‘I heard Amir Al-Momineen<sup>asws</sup> saying: ‘I<sup>asws</sup> am an eye of Allah<sup>azwj</sup>, and I<sup>asws</sup> am a Hand of Allah<sup>azwj</sup>, and I<sup>asws</sup> am a Side of Allah<sup>azwj</sup>, and I<sup>asws</sup> am a Door of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 8. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ahmad ibn abu Nasr from Hassan al-Jammal who has said that Hashim ibn abu ‘Ammara al-Janbi reported to him this. “I heard Amirul Mu’minin Ali (a.s.) saying, ‘I am the eyes of Allah. I am the hands of Allah. I am the sides of Allah. I am the door to Allah.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/121)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 360,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:9",
        "refs": {
          "Quran": [
            "/books/quran:39:56"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ عَمِّهِ حَمْزَةَ بْنِ بَزِيعٍ عَنْ عَلِيِّ بْنِ سُوَيْدٍ عَنْ أَبِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يا حَسْرَتى عَلى ما فَرَّطْتُ فِي جَنْبِ اللَّهِ قَالَ جَنْبُ اللَّهِ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ كَذَلِكَ مَا كَانَ بَعْدَهُ مِنَ الْأَوْصِيَاءِ بِالْمَكَانِ الرَّفِيعِ إِلَى أَنْ يَنْتَهِيَ الْأَمْرُ إِلَى آخِرِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazie, from his uncle Hamza Bin Bazie, from Ali Bin Suweyd, ",
            "(It has been narrated) from Abu Al-Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:39#h56\">[39:56]</a> O regret, for what I wasted regarding the Side of Allah</span>. He<sup>asws</sup> said: ‘Side of Allah<sup>azwj</sup>, is Amir Al-Momineen<sup>asws</sup>, and similar to that are the ones from after him<sup>asws</sup> from the successors<sup>asws</sup>, with the high place up to the matter ending to the last of them<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 9. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Isma‘il ibn Bazi‘a from his uncle Hamza ibn Bazi‘a from Ali ibn Suwayd from abu al-Hassan Musa ibn Ja‘far (a.s.) who has said the following. About the words of Allah “Woe to me because of my failure to fulfill my duties from the side of God. .” <a href=\"/#/books/quran:39#h56\">[39:56]</a>. The Imam (a.s.) said that the side of Allah is Amirul Mu’minin (a.s.) and so are the successors of the high position until the matters will reach to the last one among them.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (121/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 361,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:10",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ عَلِيِّ بْنِ الصَّلْتِ عَنِ الْحَكَمِ وَ إِسْمَاعِيلَ ابْنَيْ حَبِيبٍ عَنْ بُرَيْدٍ الْعِجْلِيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ بِنَا عُبِدَ اللَّهُ وَ بِنَا عُرِفَ اللَّهُ وَ بِنَا وُحِّدَ اللَّهُ تَبَارَكَ وَ تَعَالَى وَ مُحَمَّدٌ حِجَابُ اللَّهِ تَبَارَكَ وَ تَعَالَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Ali Bin Al Salt, from Al Hakam and Ismail, two sone of Habeeb, from Bureyd Al Ijaly who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Due to us<sup>azwj</sup> Allah<sup>azwj</sup> is worshipped, and due to us<sup>asws</sup> Allah<sup>azwj</sup> is recognised, and due to us<sup>asws</sup> Allah<sup>azwj</sup> the Blessed and High is regarded as One, and Muhammad<sup>saww</sup> is a veil of Allah<sup>azwj</sup> Blessed and High’."
          ],
          "en.sarwar": [
            " 10. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from Ali ibn al-Salt from al-Hakam and Isma‘il sons of Habid from Burayd al-‘Ijli who has said the following. “I heard Imam abu Ja‘far (a.s.) saying, ‘Through us Allah is worshipped. Through us Allah is known. Through us belief in the Oneness of Allah, the Most Holy, the Most High, is established. Muhammad is the Hijab (curtain) of Allah, the Most Holy, the Most High.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (122/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 362,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:23:11",
        "refs": {
          "Quran": [
            "/books/quran:5:55",
            "/books/quran:2:57"
          ]
        },
        "text": [
          "بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الْوَهَّابِ بْنِ بِشْرٍ عَنْ مُوسَى بْنِ قَادِمٍ عَنْ سُلَيْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ ما ظَلَمُونا وَ لكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ قَالَ إِنَّ اللَّهَ تَعَالَى أَعْظَمُ وَ أَعَزُّ وَ أَجَلُّ وَ أَمْنَعُ مِنْ أَنْ يُظْلَمَ وَ لَكِنَّهُ خَلَطَنَا بِنَفْسِهِ فَجَعَلَ ظُلْمَنَا ظُلْمَهُ وَ وَلَايَتَنَا وَلَايَتَهُ حَيْثُ يَقُولُ إِنَّما وَلِيُّكُمُ اللَّهُ وَ رَسُولُهُ وَ الَّذِينَ آمَنُوا يَعْنِي الْأَئِمَّةَ مِنَّا ثُمَّ قَالَ فِي مَوْضِعٍ آخَرَ وَ ما ظَلَمُونا وَ لكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ ثُمَّ ذَكَرَ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "One of our companions, from Muhammad Bin Abdullah, from Abdul Wahhab Bin Bishr, from Musa Bin Wadam, from Suleyman, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Might and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h57\">[2:57]</a> and they were not unjust to Us but they were unjust to themselves</span>. He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> the Exalted is Greater, and Mightier, and more Majestic, and more Impregnable than to be oppressed. But, He<sup>azwj</sup> Combined us<sup>asws</sup> with Himself<sup>azwj</sup>, so He<sup>azwj</sup> Made our<sup>asws</sup> being oppressed as Him<sup>azwj</sup> being oppressed, and our<sup>asws</sup> friendship as being His<sup>azwj</sup> friendship where He<sup>azwj</sup> is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:5#h55\">[5:55]</a> But rather, only Allah is your Guardian and His Rasool and those who believe</span>, Meaning the Imams<sup>asws</sup> from us<sup>asws</sup>. Then He<sup>azwj</sup> Said in another place <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h57\">[2:57]</a> and they were not unjust to Us but they were unjust to themselves</span>’. Then he<sup>asws</sup> mentioned similar to that’."
          ],
          "en.sarwar": [
            " 11. Some of our people have narrated from Muhammad ibn ‘Abdallah from ‘Abdal Wahhab ibn Bishr from Musa ibn Qadim from Sulayman from Zurara from abu Ja‘far (a.s.) who has said the following. “I asked the Imam about the words of Allah, the Most Holy, the Most High, “They (children of Israel) did not wrong Us but they wronged themselves.” <a href=\"/#/books/quran:2#h57\">[2:57]</a> The Imam said, “Allah is far Great and Majestic and Mighty above being wronged. But He has mixed us with His Own-self. He has considered the wrong done to us as being done to Him and His Own authority as our authority as He has said, “Only God, His Messenger, and the true believers who are steadfast in prayer and pay alms, while they kneel during prayer, are your guardians” <a href=\"/#/books/quran:5#h55\">[5:55]</a>. It means the Imams from us. Allah has also said, “They (children of Israel) did not wrong Us but wronged themselves. <a href=\"/#/books/quran:2#h57\">[2:57]</a>” Then he mentioned a similar statement.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:23",
  "kind": "verse_list"
}