{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:1:3:24",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْبَدَاءِ</span>",
          "en": "Chapter 24 – The Changing of Allah<sup>azwj</sup>’s Decision (الْبَدَاءِ)"
        }
      }
    ],
    "index": 47,
    "local_index": 24,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:24",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْبَدَاءِ</span>",
      "en": "Chapter 24 – The Changing of Allah<sup>azwj</sup>’s Decision (الْبَدَاءِ)"
    },
    "verse_count": 16,
    "verse_start_index": 362,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (123/ 2)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (17/ 1)"
        ],
        "index": 363,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَجَّالِ عَنْ أَبِي إِسْحَاقَ ثَعْلَبَةَ عَنْ زُرَارَةَ بْنِ أَعْيَنَ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ مَا عُبِدَ اللَّهُ بِشَيْ‏ءٍ مِثْلِ الْبَدَاءِ ",
          "وَ فِي رِوَايَةِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا عُظِّمَ اللَّهُ بِمِثْلِ الْبَدَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Ahmad Muhammad Bin Isa, from Al Hajjal, from Abu Is’haq Sa’alba, from Zurara Bin Ayn, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘Allah<sup>azwj</sup> has not been worshipped by anything like The Changing of Allah<sup>azwj</sup>’s Decision (الْبَدَاءِ)’. ",
            "And in another report of Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> (having said): ‘Allah<sup>azwj</sup> has not been revered with the likes of The Changing of Allah<sup>azwj</sup>’s Decision (الْبَدَاءِ)’."
          ],
          "en.sarwar": [
            " 1. It is narrated from Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa from al-Hajjal from abu Ishaq Tha‘laba from Zurara ibn A‘yun from one of the two Imams who has said the following. “Allah is best worshipped with belief in al-Bada’. In another Hadith from ibn abu ‘Umayr from Hisham ibn Salim from abu ‘Abdallah (a.s.) who has said, “Allah’s Greatness is not realized as good as it is realized with belief in al-Bad.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (137/ 2)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/17)"
        ],
        "index": 364,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ وَ حَفْصِ بْنِ الْبَخْتَرِيِّ وَ غَيْرِهِمَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي هَذِهِ الْآيَةِ يَمْحُوا اللَّهُ ما يَشاءُ وَ يُثْبِتُ قَالَ فَقَالَ وَ هَلْ يُمْحَى إِلَّا مَا كَانَ ثَابِتاً وَ هَلْ يُثْبَتُ إِلَّا مَا لَمْ يَكُنْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim and Hafs Bin Al Bakhtary and someone else, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding this Verse <span class=\"ibTxt\">[13:39] Allah Obliterates whatever He so Desires to and Establishes</span>: ‘And does He<sup>azwj</sup> Obliterate except what was (previously) Established, and does He<sup>azwj</sup> Establish except what had not occurred?"
          ],
          "en.sarwar": [
            " 2. It is narrated from Ali ibn Ibrahim from his father from ibn abu ‘Umayr from Hisham ibn Salim and Hafs ibn al-Bakhtari and others from abu ‘Abdallah (a.s.) whos has said the following about the words of Allah. “God establishes or effaces whatever He wants . .” (13:39) The Imam (a.s.) said, “Can anything be affaced without being established? Can anything be esblished unless it is out of nothing?”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (137/ 2)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/18)"
        ],
        "index": 365,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:3",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا بَعَثَ اللَّهُ نَبِيّاً حَتَّى يَأْخُذَ عَلَيْهِ ثَلَاثَ خِصَالٍ الْإِقْرَارَ لَهُ بِالْعُبُودِيَّةِ وَ خَلْعَ الْأَنْدَادِ وَ أَنَّ اللَّهَ يُقَدِّمُ مَا يَشَاءُ وَ يُؤَخِّرُ مَا يَشَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> did not Send a Prophet<sup>as</sup> until He<sup>azwj</sup> Took three characteristics to be upon him<sup>as</sup> – The acknowledgement to Him<sup>azwj</sup> of His<sup>azwj</sup> Lordship, and Keeping away from the idols, and that Allah<sup>azwj</sup> Brings forwards whatever He<sup>azwj</sup> so Desires to, and Delays whatever He<sup>azwj</sup> so Desires to’."
          ],
          "en.sarwar": [
            " 3. It is narrated from Ali from his father from ibn abu ‘Umayr from Hisham ibn Salim from Muhammad ibn Muslim from abu ‘Abdallah (a.s.) who has said the following. “Allah did not send any messenger without three conditions. (a) Acknowledgement of being His servant and worshipper (b) To acknowledge that there is nothing like Him and (c) that Allah may bring forwards whatever He would so will and takes backwards whatever He would so will.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/138)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/18)"
        ],
        "index": 366,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ حُمْرَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ قَضى أَجَلًا وَ أَجَلٌ مُسَمًّى عِنْدَهُ قَالَ هُمَا أَجَلَانِ أَجَلٌ مَحْتُومٌ وَ أَجَلٌ مَوْقُوفٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zurara, from Humran, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[6:2] then He Decreed a term; and there is a term Named with Him</span>. He<sup>asws</sup> said: ‘These are two terms – A Determined term and a suspended term’."
          ],
          "en.sarwar": [
            " 4. It is narrated from Muhammad ibn Yahya from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from Zurara from humran from abu Ja‘far (a.s.) who has said the following. “I asked the Imam about the words of Allah, “It is He who has created you from clay to live for a life-time and the span of your life is only known to Him. . .” (6:2) The Imam said, “There are two appointed times. One is is a definit time and the other is the conditional one.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/139)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 367,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:5",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ الْحَسَنِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنِ ابْنِ مُسْكَانَ عَنْ مَالِكٍ الْجُهَنِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ تَعَالَى أَ وَ لَمْ يَرَ الْإِنْسانُ أَنَّا خَلَقْناهُ مِنْ قَبْلُ وَ لَمْ يَكُ شَيْئاً قَالَ فَقَالَ لَا مُقَدَّراً وَ لَا مُكَوَّناً ",
          "قَالَ وَ سَأَلْتُهُ عَنْ قَوْلِهِ هَلْ أَتى عَلَى الْإِنْسانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً فَقَالَ كَانَ مُقَدَّراً غَيْرَ مَذْكُورٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Abdul Azeem Bin Abdullah Al Hasanni, from Ali Bin Asbat, from Khalaf Bin Hammad, from Ibn Muskan, from Malik Al Juhny who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\">[19:67] Or does not the human being remember that We Created him before, when he was nothing?</span> So he<sup>asws</sup> said: ‘Neither Measured nor Configured’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about His<sup>azwj</sup> Words <span class=\"ibTxt\">[76:1] There surely came over the human being a period of time when he had not become a thing worthy of mention</span>. So he<sup>asws</sup> said: ‘Ordained without being Mentioned’."
          ],
          "en.sarwar": [
            " 5. It is narrated from Ahmad ibn Mahran from ‘Abdal ‘Azim ibn ‘Abdallah al-Hassani from Ali ibn Asbat from Khalaf ibn Hammad from ibn Maskan from Malik al-Juhanni who has said the following. “I asked Imam abu ‘Abdallah (a.s.) about the words of Allah “Does he not remember that We created him when he did not exist?” (19:67) The Imam (a.s.) said, “It means that he did not exist in a definit or in the form of a being.” I asked the Imam about the words of Allah, “There was certainly a time when there was no mention of the human being” (76:1) The Imam said, “ It was definit but not mentioned.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/139)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 368,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:6",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ الْعِلْمُ عِلْمَانِ فَعِلْمٌ عِنْدَ اللَّهِ مَخْزُونٌ لَمْ يُطْلِعْ عَلَيْهِ أَحَداً مِنْ خَلْقِهِ وَ عِلْمٌ عَلَّمَهُ مَلَائِكَتَهُ وَ رُسُلَهُ ",
          "فَمَا عَلَّمَهُ مَلَائِكَتَهُ وَ رُسُلَهُ فَإِنَّهُ سَيَكُونُ لَا يُكَذِّبُ نَفْسَهُ وَ لَا مَلَائِكَتَهُ وَ لَا رُسُلَهُ وَ عِلْمٌ عِنْدَهُ مَخْزُونٌ يُقَدِّمُ مِنْهُ مَا يَشَاءُ وَ يُؤَخِّرُ مِنْهُ مَا يَشَاءُ وَ يُثْبِتُ مَا يَشَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaqn, from Hammad Bin Isa, from Rabie Bin Abdullah, from Al Fuzayl Bin Yasaar who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘The Knowledge is of (two types of) knowledge – A Knowledge Treasured with Allah<sup>azwj</sup>, not having Notified to anyone from His<sup>azwj</sup> creatures, and a Knowledge He<sup>azwj</sup> Taught His<sup>azwj</sup> Angels, and His<sup>azwj</sup> Rasools<sup>as</sup>. ",
            "So, as for what He<sup>azwj</sup> Taught His<sup>azwj</sup> Angels and His<sup>azwj</sup> Rasools<sup>as</sup>, so it is going to happen. Neither did He<sup>azwj</sup> Lie Himself<sup>azwj</sup>, nor did His<sup>azwj</sup> Angels, nor did His<sup>azwj</sup> Rasools<sup>as</sup>; and the Knowledge which is Treasured with Him<sup>azwj</sup>, He<sup>azwj</sup> Brings forwards from it whatever He<sup>azwj</sup> so Desires to, and Delays from it whatever He<sup>azwj</sup> so Desires to, and He<sup>azwj</sup> Affirms whatever He<sup>azwj</sup> so Desires to’."
          ],
          "en.sarwar": [
            " 6. It is narrated from Muhammad ibn Isma‘il from al-Fadl ibn Shadhan from Hammad ibn ‘Isa from Rabi‘ ibn ‘Abdallah from al-fudayl ibn Yasar who has said the following. “I heard abu Ja‘far (a.s.) saying, “There are two kinds of knolwedge. One kind is hidden with Allah of which no one of his creatures has any information. The other kind of knowledge is the knowledge of His angels and His messengers. Whatever knowledge He has given to His angels and messengers it will come to pass. He will not speak a lie not will He let His angels or messengers to do so. The knowledge that is hidden with Him of this He brings forwards whatever He would will and takes back whatever would He will so and establishes whatever would He will so.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/140)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/18)"
        ],
        "index": 369,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:7",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ حَمَّادٍ عَنْ رِبْعِيٍّ عَنِ الْفُضَيْلِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ مِنَ الْأُمُورِ أُمُورٌ مَوْقُوفَةٌ عِنْدَ اللَّهِ يُقَدِّمُ مِنْهَا مَا يَشَاءُ وَ يُؤَخِّرُ مِنْهَا مَا يَشَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And, by this chain, from Hammad, from Rabie, from Al Fuzayl who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘From the matters is a matter suspended in the Presence of Allah<sup>azwj</sup>. He<sup>azwj</sup> Brings forward from these whatever He<sup>azwj</sup> so Desires to, and Delays from these whatever He<sup>azwj</sup> so Desires to’."
          ],
          "en.sarwar": [
            " 7. It is narrated from a number of our people from Ahmad ibn Muhammad ibn ‘Isa from ibn abu ‘Umayr from Ja‘far ibn ‘Uthman from Suma‘a from abu Basir and Wahab ibn Hafs from abu Basir from abu ‘Abdallah (a.s.) who has said the following. “Allah has two kinds of knowledge. There is the hidden, treasured knowledge of which one has any information except Allah. From this knowledge comes al-Bada’. There is the knowledge that Allah has given to His angels, His messengers and His prophets and we know this knowledge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/140)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi"
        ],
        "index": 370,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَعْفَرِ بْنِ عُثْمَانَ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ وَ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ لِلَّهِ عِلْمَيْنِ عِلْمٌ مَكْنُونٌ مَخْزُونٌ لَا يَعْلَمُهُ إِلَّا هُوَ مِنْ ذَلِكَ يَكُونُ الْبَدَاءُ وَ عِلْمٌ عَلَّمَهُ مَلَائِكَتَهُ وَ رُسُلَهُ وَ أَنْبِيَاءَهُ فَنَحْنُ نَعْلَمُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Umeyr, from Ja’far Bin Usman, from Sama’at, from Abu Baseer, and Wuheyb Bin Hafs, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘For Allah<sup>azwj</sup> there are two (types of) Knowledge – a Knowledge Concealed, Treasured, none know it except for Him<sup>azwj</sup>. From that is the occurrence of the Changing of Allah<sup>azwj</sup>’s Decision; and a Knowledge Taught to His<sup>azwj</sup> Angels and His<sup>azwj</sup> Rasools<sup>as</sup>, and His<sup>azwj</sup> Prophets. So we<sup>asws</sup> know it’."
          ],
          "en.sarwar": [
            " 8. It is narrated from Muhammad ibn Yahya from Ahmad ibn Muhammad from al-Husayn ibn sa‘id from al-Hassan ibn Mahbub from ‘Abdallah ibn Sinan from abu ‘Abdallah (a.s.) who has said the following. “Nothing appeared to Allah in a thing except that He knew it before al-Bada’ would take place.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/140)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/18)"
        ],
        "index": 371,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا بَدَا لِلَّهِ فِي شَيْ‏ءٍ إِلَّا كَانَ فِي عِلْمِهِ قَبْلَ أَنْ يَبْدُوَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Hassan Bin Mahboub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> did not Change (His<sup>azwj</sup> Decision) regarding anything except that it was always in His<sup>azwj</sup> Knowledge before that He<sup>azwj</sup> would be Changing it’."
          ],
          "en.sarwar": [
            " 9. It is narrated from him from Ahmad from al-Hassan ibn Ali ibn Faddal from Dawud ibn Farqad from ‘Amr ibn ‘Uthman al-Juhanni from abu ‘Abdallah (a.s.) who has said the following. “Al-Bada’ does not takke place to Allah out of ignorance.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/140)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/18)"
        ],
        "index": 372,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:10",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ عَمْرِو بْنِ عُثْمَانَ الْجُهَنِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ لَمْ يَبْدُ لَهُ مِنْ جَهْلٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad, from Al Hassan Bin Ali Bin Fazzal, from Dawood Bin Farqad, from Amro Bin Usman Al Juhny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup>, (His<sup>azwj</sup> Decision) does not change for Him<sup>azwj</sup> due to ignorance’."
          ],
          "en.sarwar": [
            " 10. It is narrated from Ali ibn Ibrahim from Muhammad ibn ibn ‘Isa from Yunus from Mansur ibn Hazim who has said the following. I asked abu ‘Abdallah (a.s.), “Can anything happen today that was not in the knowledge of Allah the day before?’ The Imam (a.s.) said, “No, this does not happen. Whoever would say so Allah will make him to suffer a great deal.” I then said, “Do you consider that all that were there and all that will take place up to the Day of Judgment are all in the knowledge of Allah?” The Imam said, “Yes, it was so before He created the creatures.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (141/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 373,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) هَلْ يَكُونُ الْيَوْمَ شَيْ‏ءٌ لَمْ يَكُنْ فِي عِلْمِ اللَّهِ بِالْأَمْسِ قَالَ لَا مَنْ قَالَ هَذَا فَأَخْزَاهُ اللَّهُ قُلْتُ أَ رَأَيْتَ مَا كَانَ وَ مَا هُوَ كَائِنٌ إِلَى يَوْمِ الْقِيَامَةِ أَ لَيْسَ فِي عِلْمِ اللَّهِ قَالَ بَلَى قَبْلَ أَنْ يَخْلُقَ الْخَلْقَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, fromMuhammad Bin Isa, from Yunus, from Mansour Bin Hazim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup>, ‘Would something happen today which did not happen to be in the Knowledge of Allah<sup>azwj</sup> yesterday?’ He<sup>asws</sup> said: ‘No. The one who says this, so Allah<sup>azwj</sup> would Disgrace him’. I said, ‘What is your<sup>asws</sup> view of what has happened, and what is going to happen up to the Day of Judgment. Isn’t it in the Knowledge of Allah<sup>azwj</sup>?’ He<sup>asws</sup> said: ‘But, (even) before He<sup>azwj</sup> Created the creatures’."
          ],
          "en.sarwar": [
            " 11. It is narrated from Ali ibn Muhammad from Yunus from Malik al-Juhanni who has said the following. “I heard Imam abu ‘Abdallah (a.s.) saying, ‘Had the people known of the reward in the belief in al-Bada’ there would have been no weakness in their words about it.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (141/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 374,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:12",
        "text": [
          "عَلِيٌّ عَنْ مُحَمَّدٍ عَنْ يُونُسَ عَنْ مَالِكٍ الْجُهَنِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَوْ عَلِمَ النَّاسُ مَا فِي الْقَوْلِ بِالْبَدَاءِ مِنَ الْأَجْرِ مَا فَتَرُوا عَنِ الْكَلَامِ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Yunus, from Malik Al Juhny who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘If the people knew what Recompense would be in the speech with The Changing of Allah<sup>azwj</sup>’s Decision (الْبَدَاءِ), they would not languish from the speaking with regards to it’."
          ],
          "en.sarwar": [
            " 12. It is narrated from a number of our peole from Ahmad ibn Muhammad ibn Khalid fro some of our people from Muhammad ibn ‘Amr al-Kufi brother of Yahya from Murazim ibn Hakimwhos has said the following. I heard abu ‘Abdallah (a.s.) saying, “No prophet has ever proclaimed prophethood before acknowledging before Allah about five things. Acknowledgement of al-Bada’, of the wish of Allah, the prostration, affirmation of worshipping and obedience.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (142/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 375,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:13",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَمْرٍو الْكُوفِيِّ أَخِي يَحْيَى عَنْ مُرَازِمِ بْنِ حَكِيمٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَا تَنَبَّأَ نَبِيٌّ قَطُّ حَتَّى يُقِرَّ لِلَّهِ بِخَمْسِ خِصَالٍ بِالْبَدَاءِ وَ الْمَشِيئَةِ وَ السُّجُودِ وَ الْعُبُودِيَّةِ وَ الطَّاعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of our companions, from Muhammad Bin Amro Al Kufy, a brother of Yahya, from Murazim Bin Hakeym who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘No Prophet<sup>saww</sup> was Granted Prophet-hood at all until he<sup>as</sup> acknowled to Allah<sup>azwj</sup> with five characteristics – The Changing of Allah<sup>azwj</sup>’s Decision (الْبَدَاءِ), and the Desire, and the Prostrations, and the servitude, and the obedience’."
          ],
          "en.sarwar": [
            " 14. With the same chain of narrators it is narrated from Ahmad ibn Muhammad from Ja‘far ibn Muhammad from Yunus from Jahm ibn abu Jahma from whom he narrated from abu ‘Abdallah (a.s.) who has said the following. “Allah, the Most Holy, the Most High, inform Prophet Muhammad about all that was there from the beginning of the world and that will be there to the end of the world. He informed him about is definit in them and made an except about what is otherwise.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (142/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 376,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:14",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ يُونُسَ عَنْ جَهْمِ بْنِ أَبِي جَهْمَةَ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَخْبَرَ مُحَمَّداً ( صلى الله عليه وآله ) بِمَا كَانَ مُنْذُ كَانَتِ الدُّنْيَا وَ بِمَا يَكُونُ إِلَى انْقِضَاءِ الدُّنْيَا وَ أَخْبَرَهُ بِالْمَحْتُومِ مِنْ ذَلِكَ وَ اسْتَثْنَى عَلَيْهِ فِيمَا سِوَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Ahmad Bin Muhammad, from Ja’far Bin Muhammad, from Yunus, from Jahm Bin Abu Jahma, from the one who narrated it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Informed Muhammad<sup>saww</sup> with whatever had happened since the coming into being of the world, and with whatever was going to happen up to the expiry of the world, and Informed him<sup>saww</sup> with the Ordained (matters) from that, and Excluded upon him<sup>saww</sup> with regards to what was besides it’."
          ],
          "en.sarwar": [
            " 14. It is narrated from Ali ibn Ibrahim from his father from al-Rayyan ibn al-Salt who has said the following. “I heard Imam al-Rida (a.s.) saying, “Allah never sent a prophet without the law that prohibits the use of wine and without belief in al-Bada.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/142)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 377,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:15",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الرَّيَّانِ بْنِ الصَّلْتِ قَالَ سَمِعْتُ الرِّضَا ( عليه السلام ) يَقُولُ مَا بَعَثَ اللَّهُ نَبِيّاً قَطُّ إِلَّا بِتَحْرِيمِ الْخَمْرِ وَ أَنْ يُقِرَّ لِلَّهِ بِالْبَدَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from al Rayyan Bin Al Salt who said, ",
            "‘I heard Al-Reza<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> did not Send a Prophet<sup>as</sup> at all except with the Prohibition of the wine and that he<sup>as</sup> acknowledges to Allah<sup>azwj</sup> with the Changing of Allah<sup>azwj</sup>’s Decision (الْبَدَاءِ)’."
          ],
          "en.sarwar": [
            " 15. It is narrated from al-Husayn ibn Muhammad from Mu’alla ibn Muhammad who has said the following. “The ‘Alim (scholar) was asked, ‘How is the knowledge of Allah?” He replied, “He knew, He wanted, He willed, He measured, He decreed and He allowed it to happen. He let happen what He had decreed and decreed what he had measured and measured what He had willed. From His knowledge was His wish. From His wish was His will and from His will was His measuring. From His measuring was His decree and from His decree was His letting it to happen. Knowledge is before the wish. The wish is the second and the will is the third. Measuring happens up on the decree to let it happen. For Allah, the Most Holy, the Most High, there is al-Bada’ in whatever He knows when He wants and in the will to measure things. When the decree is issued to let it happen then there is no al-Bada’. Thus, the knowledge of the object of knowledge is before it comes into existence. The wish for the object of wish is before its substance. The will in what iis willed iis before it is established. The measuring of these objects of knowledge is before their details and before their reaching the stage of being manifested in their substance and time. The decree to let it happen is decisive in the acts with body and what is perceived with the senses of the colored having smells and weight and measurement and things walking, crawling and creeping on earth of man, Jinn, birds, beasts and others that are comprehended with the senses. Al-Bada’ happens with Allah in the matters that have no substance. When substance and meaning would appear then there is no al-Bada’. Allah does whatever He wants. With knowledge He has the knowledge of the things before their coming into existence. With the wish He has the knowledge their qualities and their limits. He invented them before they became manifest. With the will He distinguished them in their colors and qualities. With measurement He measured their sustenance and and made their beginning and end. With the decree Ahe made public for people theiir places and guided them thereto. With the letting them to happen He explained the reaasons and made the affairs public. This how is the planing of the Most Majestic, the All-knowing.”"
          ]
        }
      },
      {
        "index": 378,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:24:16",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ قَالَ سُئِلَ الْعَالِمُ ( عليه السلام ) كَيْفَ عِلْمُ اللَّهِ قَالَ عَلِمَ وَ شَاءَ وَ أَرَادَ وَ قَدَّرَ وَ قَضَى وَ أَمْضَى فَأَمْضَى مَا قَضَى وَ قَضَى مَا قَدَّرَ وَ قَدَّرَ مَا أَرَادَ فَبِعِلْمِهِ كَانَتِ الْمَشِيئَةُ وَ بِمَشِيئَتِهِ كَانَتِ الْإِرَادَةُ وَ بِإِرَادَتِهِ كَانَ التَّقْدِيرُ وَ بِتَقْدِيرِهِ كَانَ الْقَضَاءُ وَ بِقَضَائِهِ كَانَ الْإِمْضَاءُ",
          "وَ الْعِلْمُ مُتَقَدِّمٌ عَلَى الْمَشِيئَةِ وَ الْمَشِيئَةُ ثَانِيَةٌ وَ الْإِرَادَةُ ثَالِثَةٌ وَ التَّقْدِيرُ وَاقِعٌ عَلَى الْقَضَاءِ بِالْإِمْضَاءِ ",
          "فَلِلَّهِ تَبَارَكَ وَ تَعَالَى الْبَدَاءُ فِيمَا عَلِمَ مَتَى شَاءَ وَ فِيمَا أَرَادَ لِتَقْدِيرِ الْأَشْيَاءِ فَإِذَا وَقَعَ الْقَضَاءُ بِالْإِمْضَاءِ فَلَا بَدَاءَ فَالْعِلْمُ فِي الْمَعْلُومِ قَبْلَ كَوْنِهِ وَ الْمَشِيئَةُ فِي الْمُنْشَإِ قَبْلَ عَيْنِهِ وَ الْإِرَادَةُ فِي الْمُرَادِ قَبْلَ قِيَامِهِ وَ التَّقْدِيرُ لِهَذِهِ الْمَعْلُومَاتِ قَبْلَ تَفْصِيلِهَا وَ تَوْصِيلِهَا عِيَاناً وَ وَقْتاً",
          "وَ الْقَضَاءُ بِالْإِمْضَاءِ هُوَ الْمُبْرَمُ مِنَ الْمَفْعُولَاتِ ذَوَاتِ الْأَجْسَامِ الْمُدْرَكَاتِ بِالْحَوَاسِّ مِنْ ذَوِي لَوْنٍ وَ رِيحٍ وَ وَزْنٍ وَ كَيْلٍ وَ مَا دَبَّ وَ دَرَجَ مِنْ إِنْسٍ وَ جِنٍّ وَ طَيْرٍ وَ سِبَاعٍ وَ غَيْرِ ذَلِكَ مِمَّا يُدْرَكُ بِالْحَوَاسِّ ",
          "فَلِلَّهِ تَبَارَكَ وَ تَعَالَى فِيهِ الْبَدَاءُ مِمَّا لَا عَيْنَ لَهُ فَإِذَا وَقَعَ الْعَيْنُ الْمَفْهُومُ الْمُدْرَكُ فَلَا بَدَاءَ وَ اللَّهُ يَفْعَلُ مَا يَشَاءُ ",
          "فَبِالْعِلْمِ عَلِمَ الْأَشْيَاءَ قَبْلَ كَوْنِهَا وَ بِالْمَشِيئَةِ عَرَّفَ صِفَاتِهَا وَ حُدُودَهَا وَ أَنْشَأَهَا قَبْلَ إِظْهَارِهَا وَ بِالْإِرَادَةِ مَيَّزَ أَنْفُسَهَا فِي أَلْوَانِهَا وَ صِفَاتِهَا وَ بِالتَّقْدِيرِ قَدَّرَ أَقْوَاتَهَا وَ عَرَّفَ أَوَّلَهَا وَ آخِرَهَا وَ بِالْقَضَاءِ أَبَانَ لِلنَّاسِ أَمَاكِنَهَا وَ دَلَّهُمْ عَلَيْهَا وَ بِالْإِمْضَاءِ شَرَحَ عِلَلَهَا وَ أَبَانَ أَمْرَهَا ",
          "وَ ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad who said, ",
            "‘The Knowledgeable one<sup>asws</sup> was asked, ‘How does Allah<sup>azwj</sup> Know?’ He<sup>asws</sup> said: ‘He<sup>azwj</sup> Knows, and Desires, and Intends, and Determines, and Ordains, and Accomplishes. So He<sup>azwj</sup> Accomplishes what He<sup>azwj</sup> Ordains, and Ordains what He<sup>azwj</sup> Determines, and Determines what He<sup>azwj</sup> Intends. So, in His<sup>azwj</sup> Knowledge was the Desire, and in His<sup>azwj</sup> Desire was the Intention, and in His<sup>azwj</sup> Intention was the Pre-Determination, and in His<sup>azwj</sup> Pre-determination was the Ordainment, and in His<sup>azwj</sup> Ordainment was the Accomplishment.",
            "And the Knowledge was precedent upon the Desire, and the Desire is second, and the Intention is third, and the Pre-determination occurs upon the Ordainment by the Accomplishment. ",
            "Thus, for Allah<sup>azwj</sup> Blessed and High is the Change of Allah<sup>azwj</sup>’s Decision (الْبَدَاءُ) with regards to what He<sup>azwj</sup> Knows when He<sup>azwj</sup> Desires. Regarding what He<sup>azwj</sup> Intends for the Pre-determination of the things, so there is no Change in the Decision. Thus the knowledge regarding the known is before its coming into being, and the Desire regarding the desired is before its reality, and the Intention regarding the intended is before its establishment, and the Determination of these information is before it detail and it’s arriving into visibility and time. ",
            "And the Ordainment is by the Accomplishment, the conclusion from the deeds with the embodiments which can be felt by the sensory perception from the ones with the colours, and smell, and weight, and measurement, and what creeps and crawls from the humans, and Jinn, and birds, and wild animals and other than that from what can be felt by the sensory perceptions. ",
            "So, for the Blessed and High there is the Change of Decision (الْبَدَاءُ) in it from what there is no physical reality to it. So when the physical reality occurs, the concept of the sensed, so there is no Change of Decision (الْبَدَاءُ), and Allah<sup>azwj</sup> Does whatever He<sup>azwj</sup> so Desires to. ",
            "So by the Knowledge, the things are known before their coming into being; and by the Desire are recognised their qualities, and their limits, and He<sup>azwj</sup> Established these before their manifestations; and by the Intention He<sup>azwj</sup> Distinguished their selves with regards to their colours and their qualities; and by the Determination Measured out their strengths, and Recognised their beginnings, and their endings; and by the Ordainment, He<sup>azwj</sup> Clarified to the people of their places and Indicated upon these; and by the Accomplishment, Explained their reasons, and Clarified their matters. ",
            "And that is the Determination of the Mighty, the Wise."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:24",
  "kind": "verse_list"
}