{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:1:3", "titles": {"ar": "كِتَابُ التَّوْحِيدِ", "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"}}, {"indexed_titles": {"en": "Chapter 26"}, "path": "/books/al-kafi:1:3:26", "titles": {"ar": "بَابُ الْمَشِيئَةِ وَ الْإِرَادَةِ", "en": "Chapter 26 – The Desire and the Intention"}}], "index": 49, "local_index": 26, "part_type": "Chapter", "path": "/books/al-kafi:1:3:26", "titles": {"ar": "بَابُ الْمَشِيئَةِ وَ الْإِرَادَةِ", "en": "Chapter 26 – The Desire and the Intention"}, "verse_count": 6, "verse_start_index": 380, "verses": [{"index": 381, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:3:26:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدِ</span> بْنِ عَبْدِ اللَّهِ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ عَنْ عَلِيِّ بْنِ إِبْرَاهِيمَ الْهَاشِمِيِّ قَالَ سَمِعْتُ أَبَا الْحَسَنِ مُوسَى بْنَ جَعْفَرٍ ( عليه السلام ) يَقُولُ لَا يَكُونُ شَيْ‏ءٌ إِلَّا مَا شَاءَ اللَّهُ وَ أَرَادَ وَ قَدَّرَ وَ قَضَى قُلْتُ مَا مَعْنَى شَاءَ قَالَ ابْتِدَاءُ الْفِعْلِ قُلْتُ مَا مَعْنَى قَدَّرَ قَالَ تَقْدِيرُ الشَّيْ‏ءِ مِنْ طُولِهِ وَ عَرْضِهِ قُلْتُ مَا مَعْنَى قَضَى قَالَ إِذَا قَضَى أَمْضَاهُ فَذَلِكَ الَّذِي لَا مَرَدَّ لَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad Bin Abdullah, from Ahmad Bin Abu Abdullah, from his father, from Muhammad Bin Suleyman Al Dalaymi, from Ali Bin Ibrahim Al Hashimy who said, \n‘I heard Abu Al-Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> saying: ‘Nothing comes into being except what Allah<sup>azwj</sup> so Desires, and Intends, and Determines, and Ordains’. I said, ‘What is the meaning of Desire?’ He<sup>asws</sup> said: ‘Initiating the deed’. I said, ‘What is the meaning of determination?’ He<sup>asws</sup> said: ‘Determining the things, from its length, and its width’. I said, ‘What is the meaning of Ordaining?’ He<sup>asws</sup> said: ‘When it is Ordained, it is accomplished. So that is which, there is no averting for it’."}]}, {"index": 382, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:3:26:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبَانٍ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) شَاءَ وَ أَرَادَ وَ قَدَّرَ وَ قَضَى قَالَ نَعَمْ قُلْتُ وَ أَحَبَّ قَالَ لَا قُلْتُ وَ كَيْفَ شَاءَ وَ أَرَادَ وَ قَدَّرَ وَ قَضَى وَ لَمْ يُحِبَّ قَالَ هَكَذَا خَرَجَ إِلَيْنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Aban, from Abu Baseer who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘(He<sup>azwj</sup>) ‘شَاءَ وَ أَرَادَ وَ قَدَّرَ وَ قَضَى’ Desires, and Intends, and Determines and Ordains?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘And He<sup>azwj</sup> Loves?’ He<sup>asws</sup> said: ‘No’. I said, ‘And how does He<sup>azwj</sup> Desires, and Intends, and Determines, and Ordains, and He<sup>azwj</sup> does not Love?’ He<sup>asws</sup> said: ‘This is how it has come out to us<sup>asws</sup>’."}]}, {"index": 383, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:3:26:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ وَاصِلِ بْنِ سُلَيْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ أَمَرَ اللَّهُ وَ لَمْ يَشَأْ وَ شَاءَ وَ لَمْ يَأْمُرْ أَمَرَ إِبْلِيسَ أَنْ يَسْجُدَ لآِدَمَ وَ شَاءَ أَنْ لَا يَسْجُدَ وَ لَوْ شَاءَ لَسَجَدَ وَ نَهَى آدَمَ عَنْ أَكْلِ الشَّجَرَةِ وَ شَاءَ أَنْ يَأْكُلَ مِنْهَا وَ لَوْ لَمْ يَشَأْ لَمْ يَأْكُلْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from Wasil Bin Suleyman, from Abdullah Bin Sinan, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Commands and does not Desire, and Desires and does not Command. He<sup>azwj</sup> Commanded Iblees<sup>la</sup> that he<sup>la</sup> should prostrate to Adam<sup>as</sup> and Desired that he<sup>la</sup> does not prostrate, and had He<sup>azwj</sup> Desired so, he<sup>la</sup> would have prostrated; and He<sup>azwj</sup> Forbade Adam<sup>as</sup> from eating from the tree, and Desired that he<sup>as</sup> eats from eat, and had He<sup>azwj</sup> not Desired so, he<sup>as</sup> would not have eaten’."}]}, {"index": 384, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:3:26:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْمُخْتَارِ بْنِ مُحَمَّدٍ الْهَمْدَانِيِّ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ الْعَلَوِيِّ جَمِيعاً عَنِ الْفَتْحِ بْنِ يَزِيدَ الْجُرْجَانِيِّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ إِنَّ لِلَّهِ إِرَادَتَيْنِ وَ مَشِيئَتَيْنِ إِرَادَةَ حَتْمٍ وَ إِرَادَةَ عَزْمٍ يَنْهَى وَ هُوَ يَشَاءُ وَ يَأْمُرُ وَ هُوَ لَا يَشَاءُ أَ وَ مَا رَأَيْتَ أَنَّهُ نَهَى آدَمَ وَ زَوْجَتَهُ أَنْ يَأْكُلَا مِنَ الشَّجَرَةِ وَ شَاءَ ذَلِكَ وَ لَوْ لَمْ يَشَأْ أَنْ يَأْكُلَا لَمَا غَلَبَتْ مَشِيئَتُهُمَا مَشِيئَةَ اللَّهِ تَعَالَى \nوَ أَمَرَ إِبْرَاهِيمَ أَنْ يَذْبَحَ إِسْحَاقَ وَ لَمْ يَشَأْ أَنْ يَذْبَحَهُ وَ لَوْ شَاءَ لَمَا غَلَبَتْ مَشِيئَةُ إِبْرَاهِيمَ مَشِيئَةَ اللَّهِ تَعَالَى .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Al Mukhtar Bin Muhammad Al Hamadany and Muhammad Bin Al Hassan, from Abdullah Bin Al Hassan Al Alawy, altogether, from Al Fatah Bin Yazeed Al Jurjany, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘For Allah<sup>azwj</sup> there are two Intentions and two Desires – an Absolute Intention and a Determined Intention. He<sup>azwj</sup> Forbids while He<sup>azwj</sup> Desires, and He<sup>azwj</sup> Commands while He<sup>azwj</sup> does not Desire. Or did you not see that He<sup>azwj</sup> Forbade Adam<sup>as</sup> and his<sup>as</sup> wife<sup>as</sup> from eating from the tree, and He<sup>azwj</sup> Desired that, and had He<sup>azwj</sup> not Desired that they<sup>as</sup> both eat, their<sup>as</sup> both desires would not have prevailed over the Desire of Allah<sup>azwj</sup> the Exalted. \nAnd He<sup>azwj</sup> Commanded Ibrahim<sup>as</sup> that he<sup>as</sup> slaughers Is’haq<sup>as</sup> (Ismail<sup>as</sup>) and did not Desire that he<sup>as</sup> slaughters him<sup>as</sup>. And had He<sup>azwj</sup> so Desired, the desire of Ibrahim<sup>as</sup> would not have prevailed over the Desire of Allah<sup>azwj</sup> the Exalted’."}]}, {"index": 385, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:3:26:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ فُضَيْلِ بْنِ يَسَارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ شَاءَ وَ أَرَادَ وَ لَمْ يُحِبَّ وَ لَمْ يَرْضَ شَاءَ أَنْ لَا يَكُونَ شَيْ‏ءٌ إِلَّا بِعِلْمِهِ وَ أَرَادَ مِثْلَ ذَلِكَ وَ لَمْ يُحِبَّ أَنْ يُقَالَ ثَالِثُ ثَلَاثَةٍ وَ لَمْ يَرْضَ لِعِبَادِهِ الْكُفْرَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from Dorost Bin Abu Mansour, from Fuzayl Bin Yasaar who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘He<sup>azwj</sup> Desires and Intends, and He<sup>azwj</sup> does not Love and does not get Pleased. He<sup>azwj</sup> Desires that a thing does not come into being except in His<sup>azwj</sup> Knowledge, and He<sup>azwj</sup> Intends similar to that, and He<sup>azwj</sup> does not Love for it to said He<sup>azwj</sup> is third of three, and is not Pleased of the disbelief for His<sup>azwj</sup> servants’."}]}, {"index": 386, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:3:26:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ قَالَ أَبُو الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ اللَّهُ يَا ابْنَ آدَمَ بِمَشِيئَتِي كُنْتَ أَنْتَ الَّذِي تَشَاءُ لِنَفْسِكَ مَا تَشَاءُ وَ بِقُوَّتِي أَدَّيْتَ فَرَائِضِي وَ بِنِعْمَتِي قَوِيتَ عَلَى مَعْصِيَتِي جَعَلْتُكَ سَمِيعاً بَصِيراً قَوِيّاً مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ وَ مَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ وَ ذَاكَ أَنِّي أَوْلَى بِحَسَنَاتِكَ مِنْكَ وَ أَنْتَ أَوْلَى بِسَيِّئَاتِكَ مِنِّي وَ ذَاكَ أَنَّنِي لَا أُسْأَلُ عَمَّا أَفْعَلُ وَ هُمْ يُسْأَلُونَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Abu Nasr who said, \n‘Abu Al-Hassan Al-Reza<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Said: “O son of Adam<sup>as</sup>! By My<sup>azwj</sup> Desire you came into being. You desire for your own self whatever you so desire; and by My<sup>azwj</sup> Strength you are fulfilling My<sup>azwj</sup> Obligations, and by My<sup>azwj</sup> Favour I<sup>azwj</sup> Given you the Strength (so you may) disobey My<sup>azwj</sup>. I<sup>azwj</sup> Made you to be hearing, seeing, strong. Whatever you attain from a goodness, so (it is) from Allah<sup>azwj</sup>, and whatever you attain from evil, so it is from yourself, and that is because I<sup>azwj</sup> am closer with your good deeds than you are, and you are closer with your evil deeds than I<sup>azwj</sup> am, and that I<sup>azwj</sup> will not be Questioned about what I<sup>azwj</sup> Do, but they would be questioned’."}]}]}, "index": "al-kafi:1:3:26", "kind": "verse_list"}