{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:1:3:28",
        "titles": {
          "ar": "بَابُ السَّعَادَةِ وَ الشَّقَاءِ",
          "en": "Chapter 28 – The Happiness and the Misery"
        }
      }
    ],
    "index": 51,
    "local_index": 28,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:1:3:29",
        "titles": {
          "ar": "بَابُ الْخَيْرِ وَ الشَّرِّ",
          "en": "Chapter 29 – The Good and the Evil"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:1:3:27",
        "titles": {
          "ar": "بَابُ الِابْتِلَاءِ وَ الِاخْتِبَارِ",
          "en": "Chapter 27 – The Trial and the Testing"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:28",
    "titles": {
      "ar": "بَابُ السَّعَادَةِ وَ الشَّقَاءِ",
      "en": "Chapter 28 – The Happiness and the Misery"
    },
    "verse_count": 3,
    "verse_start_index": 388,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/165)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 389,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "مَنْصُورِ بْنِ حَازِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:28:1",
        "text": [
          " إِنَّ اللَّهَ خَلَقَ السَّعَادَةَ وَ الشَّقَاءَ قَبْلَ أَنْ يَخْلُقَ خَلْقَهُ فَمَنْ خَلَقَهُ اللَّهُ سَعِيداً لَمْ يُبْغِضْهُ أَبَداً وَ إِنْ عَمِلَ شَرّاً أَبْغَضَ عَمَلَهُ وَ لَمْ يُبْغِضْهُ ",
          "وَ إِنْ كَانَ شَقِيّاً لَمْ يُحِبَّهُ أَبَداً وَ إِنْ عَمِلَ صَالِحاً أَحَبَّ عَمَلَهُ وَ أَبْغَضَهُ لِمَا يَصِيرُ إِلَيْهِ فَإِذَا أَحَبَّ اللَّهُ شَيْئاً لَمْ يُبْغِضْهُ أَبَداً وَ إِذَا أَبْغَضَ شَيْئاً لَمْ يُحِبَّهُ أَبَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazan, from Safwan Bin Yahya, from Mansour Bin Hazim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Created ‘السَّعَادَةَ وَ الشَّقَاءَ’ the happiness and the misery before He<sup>azwj</sup> Created His<sup>azwj</sup> creatures. So the one whom Allah<sup>azwj</sup> Created as happy, He<sup>azwj</sup> would not Hate him ever, and even if he performs evil deeds. He<sup>azwj</sup> would Hate his deed, and would not Hate him.",
            "And if he was (Created) ‘شَقِيّاً’ miserable, He<sup>azwj</sup> would not Love him ever, and even if performed righteous deeds. He<sup>azwj</sup> would Love his deed and Hate him due to what he would be coming to. So when Allah<sup>azwj</sup> Loves something, He<sup>azwj</sup> would not Hate it, ever, and when He<sup>azwj</sup> Hates a thing, He<sup>azwj</sup> would not Love it, ever’."
          ],
          "en.sarwar": [
            " 1. It is narrated from Muhammad ibn Isma‘il from al-Fadl ibn Shadhan from Saffron ibn Yahya from Mansur ibn Hazim from Imam abu ‘Abdallah (a.s.) who has said the following. “Allah created good fortune and bad fortune before He created the creatures. Whoever Allah has created fortunate He never becomes angry with him even though he may do bad deeds. He to reach and nor do the deep diving intelligence is capable to grasp. Most High is Allah. It is He who is not subject to the effects of the numbered time or extended period or limited attributes. Glorious is Allah, Who has no beginning that started or a destination that would close or an end that would finish. Glorious is He Who is just as He Him Self has introduced. Those who speak of His attributes can never praise Him duly. He gave to everything a limit at the time of its creation for their non- similarity to Him and His none-similarity to them. For Him th of would dislike his deeds but his own self. If he is an unfortunate He would never love him even if he would do good deeds. He would love his deeds but not his own self because of what he will end up to. If Allah would love someone He will not dislike him and if He would dislike someone He will not love him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (166/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 390,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/384",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "شُعَيْبٍ الْعَقَرْقُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ عَنْ شُعَيْبٍ الْعَقَرْقُوفِيِّ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:28:2",
        "text": [
          " كُنْتُ بَيْنَ يَدَيْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَالِساً وَ قَدْ سَأَلَهُ سَائِلٌ فَقَالَ جُعِلْتُ فِدَاكَ يَا ابْنَ رَسُولِ اللَّهِ مِنْ أَيْنَ لَحِقَ الشَّقَاءُ أَهْلَ الْمَعْصِيَةِ حَتَّى حَكَمَ اللَّهُ لَهُمْ فِي عِلْمِهِ بِالْعَذَابِ عَلَى عَمَلِهِمْ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَيُّهَا السَّائِلُ حُكْمُ اللَّهِ عَزَّ وَ جَلَّ لَا يَقُومُ لَهُ أَحَدٌ مِنْ خَلْقِهِ بِحَقِّهِ فَلَمَّا حَكَمَ بِذَلِكَ وَهَبَ لِأَهْلِ مَحَبَّتِهِ الْقُوَّةَ عَلَى مَعْرِفَتِهِ وَ وَضَعَ عَنْهُمْ ثِقْلَ الْعَمَلِ بِحَقِيقَةِ مَا هُمْ أَهْلُهُ ",
          "وَ وَهَبَ لِأَهْلِ الْمَعْصِيَةِ الْقُوَّةَ عَلَى مَعْصِيَتِهِمْ لِسَبْقِ عِلْمِهِ فِيهِمْ وَ مَنَعَهُمْ إِطَاقَةَ الْقَبُولِ مِنْهُ فَوَافَقُوا مَا سَبَقَ لَهُمْ فِي عِلْمِهِ وَ لَمْ يَقْدِرُوا أَنْ يَأْتُوا حَالًا تُنْجِيهِمْ مِنْ عَذَابِهِ لِأَنَّ عِلْمَهُ أَوْلَى بِحَقِيقَةِ التَّصْدِيقِ وَ هُوَ مَعْنَى شَاءَ مَا شَاءَ وَ هُوَ سِرُّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, raising it, from Shuayb Al Aqarquqy, from Abu Baseer who said, ",
            "‘I was seated in front of Abu Abdullah<sup>asws</sup> and a questioner asked saying, ‘May I be sacrificed for you<sup>asws</sup>, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! From where did the misery come upon the people of disobedience until Allah<sup>azwj</sup> Decided for them in His<sup>azwj</sup> Knowledge with the Punishment upon their deeds?’ ",
            "So Abu Abdullah<sup>asws</sup> said: ‘O you questioner! A Decision of Allah<sup>azwj</sup> Mighty and Majestic is such that no one from His<sup>azwj</sup> creatures can stand up to it by his right. So when Allah<sup>azwj</sup> Decided with that, Endowed for the people of His<sup>azwj</sup> Love, the strength upon recognising Him<sup>azwj</sup> and Staved off from them the weight of the deeds by a reality for what they are rightful of. ",
            "And He<sup>azwj</sup> Endowed to the people of the disobedience, the strength upon their disobedience due to the precedence of His<sup>azwj</sup> Knowledge regarding them, and He<sup>azwj</sup> Prevented from them the tolerance of the acceptance. So they harmonised themselves what preceded for them in His<sup>azwj</sup> Knowledge and they have no ability that they should come to a state which would save them from His<sup>azwj</sup> Punishment, because His<sup>azwj</sup> Knowledge is closer with the realities of the ratification. And it is what is meant by, ‘He<sup>azwj</sup> Desired’, and ‘What He<sup>azwj</sup> so Desires’, it is His<sup>azwj</sup> Secret’ (Beyond one’s comprehension)."
          ],
          "en.sarwar": [
            " 2. It is narrated from Ali ibn Muhammad (in a marfu‘ manner) from shu‘ayb al-‘aqaqufi from abu Basir who has said the following. “I was in presence of Imam abu ‘abdallah (a.s.) when a certain person asked him saying, ‘May Allah take my soul in service for your cause, O great-great-great-great-grandson of the holy Prophet (s.a.), wherefrom misfortune took hold of the people committing sins and so Allah in His knowledge deemed it for them to suffer?” The Imam said, “It is the judgment of Allah, the Most Holy, the Most High and no one has the right (to oppose it). When passed such judgment He gave to the people of love the ability to know Him and relieved them of the hardships of deeds by means of what they are capable of and He gave the people of sins the ability to commit sins due His early knowledge and denying them the power to accept from Him, thus, they agree with what is in His knowledge about them and they remain unable to do things that would save them from His punishment. It is because His knowledge is more preferred in the reality of judgment and acknowledgement and this is what is meant by He wanted what He wanted and it is His secret”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/170)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 391,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/98",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/547",
              "text": "يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/548",
              "text": "مُعَلَّى بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/267",
              "text": "عَلِيِّ بْنِ حَنْظَلَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/366",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ مُعَلَّى بْنِ عُثْمَانَ عَنْ عَلِيِّ بْنِ حَنْظَلَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:28:3",
        "text": [
          " يُسْلَكُ بِالسَّعِيدِ فِي طَرِيقِ الْأَشْقِيَاءِ حَتَّى يَقُولَ النَّاسُ مَا أَشْبَهَهُ بِهِمْ بَلْ هُوَ مِنْهُمْ ثُمَّ يَتَدَارَكُهُ السَّعَادَةُ وَ قَدْ يُسْلَكُ بِالشَّقِيِّ فِي طَرِيقِ السُّعَدَاءِ حَتَّى يَقُولَ النَّاسُ مَا أَشْبَهَهُ بِهِمْ بَلْ هُوَ مِنْهُمْ ثُمَّ يَتَدَارَكُهُ الشَّقَاءُ ",
          "إِنَّ مَنْ كَتَبَهُ اللَّهُ سَعِيداً وَ إِنْ لَمْ يَبْقَ مِنَ الدُّنْيَا إِلَّا فُوَاقُ نَاقَةٍ خَتَمَ لَهُ بِالسَّعَادَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Al Nazar Bin Suweyd, from Yahya Bin Imran Al Halby, from Moalla Bin Usman, from Ali Bin Hanzala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The happy one is made to travel in a path of the miserable until the people are saying, ‘How he resembles with them’. But, he is (not) from them. Then the happiness rectifies him. And, the miserable one is made to be on the path of the happy ones until the people are saying, ‘How he resembles with them’. But, he is (not) from them. Then the misery rectifies him.",
            "Verily, the one whom Allah<sup style=\"font-weight: normal\">azwj</sup> has Written (Decreed) as happy, and even if he does not remain except (a duration of) milking a she-camel, Allah<sup style=\"font-weight: normal\">azwj</sup> would End it for him with the happiness’."
          ],
          "en.sarwar": [
            " 3. It is narrated from a number of our people from Ahmad ibn Muhammad ibn Khalid from his father from al-Nadr ibn Suwayd for Yahya ibn ‘Imran al-Halabi from Mu’alla ibn ‘Uthman from Ali ibn Hanzala from Imam abu ‘Abdallah (a.s.) Who has said the following. The Imam said, “A fortunate person is made to walk on the path of the unfortunate ones so much so that people would say, “How similar has he become with them? In fact, he has become one of them. Then good fortune helps him. Sometimes a unfortunate one is made to walk on the path of the fortunate ones and people begins to say, “How similar has he become with them? In fact, he has become one of them. But misfortune takes hold of him. Whoever Allah has written to be of the fortunate ones, even if very little time, such equal to the period between two breast-feeding of a camel her young, would have been left from his life in this world Allah will make it end in good fortune."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:28",
  "kind": "verse_list"
}