{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:1:3:30",
        "titles": {
          "ar": "بَابُ الْجَبْرِ وَ الْقَدَرِ وَ الْأَمْرِ بَيْنَ الْأَمْرَيْنِ",
          "en": "Chapter 30 – The Compulsion, and the Pre-determination, and the matter is between the two matters"
        }
      }
    ],
    "index": 53,
    "local_index": 30,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:1:3:31",
        "titles": {
          "ar": "بَابُ الِاسْتِطَاعَةِ",
          "en": "Chapter 31 – The Capability"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:1:3:29",
        "titles": {
          "ar": "بَابُ الْخَيْرِ وَ الشَّرِّ",
          "en": "Chapter 29 – The Good and the Evil"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:30",
    "titles": {
      "ar": "بَابُ الْجَبْرِ وَ الْقَدَرِ وَ الْأَمْرِ بَيْنَ الْأَمْرَيْنِ",
      "en": "Chapter 30 – The Compulsion, and the Pre-determination, and the matter is between the two matters"
    },
    "verse_count": 14,
    "verse_start_index": 394,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 395,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/551",
              "text": "إِسْحَاقَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/552",
              "text": "غَيْرِهِمَا رَفَعُوهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ وَ إِسْحَاقَ بْنِ مُحَمَّدٍ وَ غَيْرِهِمَا رَفَعُوهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:1",
        "text": [
          " كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) جَالِساً بِالْكُوفَةِ بَعْدَ مُنْصَرَفِهِ مِنْ صِفِّينَ إِذْ أَقْبَلَ شَيْخٌ فَجَثَا بَيْنَ يَدَيْهِ ثُمَّ قَالَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ أَخْبِرْنَا عَنْ مَسِيرِنَا إِلَى أَهْلِ الشَّامِ أَ بِقَضَاءٍ مِنَ اللَّهِ وَ قَدَرٍ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَجَلْ يَا شَيْخُ مَا عَلَوْتُمْ تَلْعَةً وَ لَا هَبَطْتُمْ بَطْنَ وَادٍ إِلَّا بِقَضَاءٍ مِنَ اللَّهِ وَ قَدَرٍ ",
          "فَقَالَ لَهُ الشَّيْخُ عِنْدَ اللَّهِ أَحْتَسِبُ عَنَائِي يَا أَمِيرَ الْمُؤْمِنِينَ فَقَالَ لَهُ مَهْ يَا شَيْخُ فَوَ اللَّهِ لَقَدْ عَظَّمَ اللَّهُ الْأَجْرَ فِي مَسِيرِكُمْ وَ أَنْتُمْ سَائِرُونَ وَ فِي مَقَامِكُمْ وَ أَنْتُمْ مُقِيمُونَ وَ فِي مُنْصَرَفِكُمْ وَ أَنْتُمْ مُنْصَرِفُونَ وَ لَمْ تَكُونُوا فِي شَيْ‏ءٍ مِنْ حَالَاتِكُمْ مُكْرَهِينَ وَ لَا إِلَيْهِ مُضْطَرِّينَ ",
          "فَقَالَ لَهُ الشَّيْخُ وَ كَيْفَ لَمْ نَكُنْ فِي شَيْ‏ءٍ مِنْ حَالَاتِنَا مُكْرَهِينَ وَ لَا إِلَيْهِ مُضْطَرِّينَ وَ كَانَ بِالْقَضَاءِ وَ الْقَدَرِ مَسِيرُنَا وَ مُنْقَلَبُنَا وَ مُنْصَرَفُنَا فَقَالَ لَهُ وَ تَظُنُّ أَنَّهُ كَانَ قَضَاءً حَتْماً وَ قَدَراً لَازِماً إِنَّهُ لَوْ كَانَ كَذَلِكَ لَبَطَلَ الثَّوَابُ وَ الْعِقَابُ وَ الْأَمْرُ وَ النَّهْيُ وَ الزَّجْرُ مِنَ اللَّهِ وَ سَقَطَ مَعْنَى الْوَعْدِ وَ الْوَعِيدِ",
          "فَلَمْ تَكُنْ لَائِمَةٌ لِلْمُذْنِبِ وَ لَا مَحْمَدَةٌ لِلْمُحْسِنِ وَ لَكَانَ الْمُذْنِبُ أَوْلَى بِالْإِحْسَانِ مِنَ الْمُحْسِنِ وَ لَكَانَ الْمُحْسِنُ أَوْلَى بِالْعُقُوبَةِ مِنَ الْمُذْنِبِ تِلْكَ مَقَالَةُ إِخْوَانِ عَبَدَةِ الْأَوْثَانِ وَ خُصَمَاءِ الرَّحْمَنِ وَ حِزْبِ الشَّيْطَانِ وَ قَدَرِيَّةِ هَذِهِ الْأُمَّةِ وَ مَجُوسِهَا",
          "إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى كَلَّفَ تَخْيِيراً وَ نَهَى تَحْذِيراً وَ أَعْطَى عَلَى الْقَلِيلِ كَثِيراً وَ لَمْ يُعْصَ مَغْلُوباً وَ لَمْ يُطَعْ مُكْرِهاً وَ لَمْ يُمَلِّكْ مُفَوِّضاً وَ لَمْ يَخْلُقِ السَّمَاوَاتِ وَ الْأَرْضَ وَ مَا بَيْنَهُمَا بَاطِلًا وَ لَمْ يَبْعَثِ النَّبِيِّينَ مُبَشِّرِينَ وَ مُنْذِرِينَ عَبَثاً ذَلِكَ ظَنُّ الَّذِينَ كَفَرُوا فَوَيْلٌ لِلَّذِينَ كَفَرُوا مِنَ النَّارِ ",
          "فَأَنْشَأَ الشَّيْخُ يَقُولُ : أَنْتَ الْإِمَامُ الَّذِي نَرْجُو بِطَاعَتِهِ * يَوْمَ النَّجَاةِ مِنَ الرَّحْمَنِ غُفْرَاناً أَوْضَحْتَ مِنْ أَمْرِنَا مَا كَانَ مُلْتَبِساً * جَزَاكَ رَبُّكَ بِالْإِحْسَانِ إِحْسَاناً"
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad and Is’haq Bin Muhammad and someone else, raising it, ",
            "He<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> was seated in Al-Kufa, after his<sup>asws</sup> leaving from (the battle of) Siffeen, when an old man squatted in front of him<sup>asws</sup>, then said to him<sup>asws</sup>, ‘O Amir Al-Momineen<sup>asws</sup>! Inform us about our travel to the people of Syria. Was it by an Ordainment from Allah<sup>azwj</sup> and Pre-determination?’ So Amir Al-Momineen<sup>asws</sup> said: ‘Yes O Sheykh! No hill did you ascend nor a valley you descend into except it was by an Ordainment from Allah<sup>azwj</sup> and Pre-determined’.",
            "So the Sheykh said to him<sup>asws</sup>, ‘Will my exhaustion be Counted in the Presence of Allah<sup>azwj</sup>, O Amir Al Momineen<sup>asws</sup>?’ So he<sup>asws</sup> said to him: ‘Muh! (Shh!), O Sheykh! Allah<sup>azwj</sup> has Magnified the Recompense regarding your travels while you were travelling, and regarding your staying while you were staying, and regarding your leaving, while you were leaving, and you did not happen to be in anything from your states being coerced nor forced to it’.",
            "So the Sheykh said to him, ‘And how can it be that we were not in anything from our states being coerced nor being forced to it, and it was with the Ordainment and the Pre-determination, our travels, and our transfers, and our leaving?’ So he<sup>asws</sup> said to him: ‘And you think that it was an unavoidable Ordainment, Necessitated? If it was like that, it would invalidate the Rewards, and the Punishments, and the enjoinment, and the forbiddance, and the Rebukes from Allah<sup>azwj</sup>, the meanings of the Promises and the Threats would crumble. ",
            "So the sinners would not be blameable nor would the good doers be praiseworthy. It would have been so that the sinner would be closer with the good deed than the good doer, and it would be so that the good doer would be closer with the Punishment than the sinner. These are the talks of the brotherhood of the idol-worshippers, and the disputants to the Beneficent, and parties of the Satan<sup>la</sup>, and the Qadiriyya of this community and its Magians. ",
            "Surely, Allah<sup>azwj</sup> Blessed and High Encumbered choices and Forbade as a warning, and Gives a lot upon the little (deed), and He<sup>azwj</sup> is not disobeyed due to being overcome, nor is He<sup>azwj</sup> obeyed forcefully, and did not Give control as a delegated (authority), and did not Create the skies and the earth and what is between the two in vain, and did not Send the Prophets<sup>as</sup>, the Givers of Glad Tidings and the Warners in futility. That is a conjecture of those who are disbelieving. So woe be unto those who are disbelieving of the Fire!’ ",
            "So the Sheykh prosed saying, ‘You<sup>asws</sup> are the Imam<sup>asws</sup> whom we are hoping to by obeying him<sup>asws</sup> on a Day for salvation from the Beneficent (and for) Forgiveness. You<sup>asws</sup> clarified from our matters what was vague. May your<sup>asws</sup> Lord<sup>azwj</sup> Recompense you by a Favour with the favour’."
          ]
        }
      },
      {
        "index": 396,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/61",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/64",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/347",
              "text": "أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:2",
        "text": [
          " مَنْ زَعَمَ أَنَّ اللَّهَ يَأْمُرُ بِالْفَحْشَاءِ فَقَدْ كَذَبَ عَلَى اللَّهِ وَ مَنْ زَعَمَ أَنَّ الْخَيْرَ وَ الشَّرَّ إِلَيْهِ فَقَدْ كَذَبَ عَلَى اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Hammad Bin Usman, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who claim that Allah<sup>azwj</sup> Commands with the immoralities, so he has lied upon Allah<sup>azwj</sup>, and the one who claims that the good and the evil are to Him<sup>azwj</sup> (His<sup>azwj</sup> Responsibility), so he has lied upon Allah<sup>azwj</sup>’."
          ]
        }
      },
      {
        "index": 397,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/61",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/64",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/93",
              "text": "أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:3",
        "text": [
          " سَأَلْتُهُ فَقُلْتُ اللَّهُ فَوَّضَ الْأَمْرَ إِلَى الْعِبَادِ قَالَ اللَّهُ أَعَزُّ مِنْ ذَلِكَ قُلْتُ فَجَبَرَهُمْ عَلَى الْمَعَاصِي قَالَ اللَّهُ أَعْدَلُ وَ أَحْكَمُ مِنْ ذَلِكَ قَالَ ثُمَّ قَالَ قَالَ اللَّهُ يَا ابْنَ آدَمَ أَنَا أَوْلَى بِحَسَنَاتِكَ مِنْكَ وَ أَنْتَ أَوْلَى بِسَيِّئَاتِكَ مِنِّي عَمِلْتَ الْمَعَاصِيَ بِقُوَّتِيَ الَّتِي جَعَلْتُهَا فِيكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washha, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I asked him<sup>asws</sup>, so I said, ‘Does Allah<sup>azwj</sup> Delegate the matters to the servants?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is Mightier than that’. I said, ‘So does He<sup>azwj</sup> Compel them upon the disobedience?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is more Just and Wise than that’. He (the narrator) said, ‘Then he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Said: “O son of Adam<sup>as</sup>! I<sup>azwj</sup> am closer with your good deeds than you are, and you are closer with your evil deeds than I<sup>azwj</sup> am. You are doing the disobediences by My<sup>azwj</sup> (Given) Strength which I<sup>azwj</sup> Made to be in you”’."
          ]
        }
      },
      {
        "index": 398,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/330",
              "text": "إِسْمَاعِيلَ بْنِ مَرَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/109",
              "text": "يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:4",
        "relations": {
          "Mentions": [
            "/books/quran:23:106",
            "/books/quran:15:39",
            "/books/quran:7:43"
          ]
        },
        "text": [
          " قَالَ لِي أَبُو الْحَسَنِ الرِّضَا ( عليه السلام ) يَا يُونُسُ لَا تَقُلْ بِقَوْلِ الْقَدَرِيَّةِ فَإِنَّ الْقَدَرِيَّةَ لَمْ يَقُولُوا بِقَوْلِ أَهْلِ الْجَنَّةِ وَ لَا بِقَوْلِ أَهْلِ النَّارِ وَ لَا بِقَوْلِ إِبْلِيسَ فَإِنَّ أَهْلَ الْجَنَّةِ قَالُوا الْحَمْدُ لِلَّهِ الَّذِي هَدانا لِهذا وَ ما كُنَّا لِنَهْتَدِيَ لَوْ لا أَنْ هَدانَا اللَّهُ وَ قَالَ أَهْلُ النَّارِ رَبَّنا غَلَبَتْ عَلَيْنا شِقْوَتُنا وَ كُنَّا قَوْماً ضالِّينَ وَ قَالَ إِبْلِيسُ رَبِّ بِما أَغْوَيْتَنِي ",
          "فَقُلْتُ وَ اللَّهِ مَا أَقُولُ بِقَوْلِهِمْ وَ لَكِنِّي أَقُولُ لَا يَكُونُ إِلَّا بِمَا شَاءَ اللَّهُ وَ أَرَادَ وَ قَدَّرَ وَ قَضَى فَقَالَ يَا يُونُسُ لَيْسَ هَكَذَا لَا يَكُونُ إِلَّا مَا شَاءَ اللَّهُ وَ أَرَادَ وَ قَدَّرَ وَ قَضَى ",
          "يَا يُونُسُ تَعْلَمُ مَا الْمَشِيئَةُ قُلْتُ لَا قَالَ هِيَ الذِّكْرُ الْأَوَّلُ فَتَعْلَمُ مَا الْإِرَادَةُ قُلْتُ لَا قَالَ هِيَ الْعَزِيمَةُ عَلَى مَا يَشَاءُ فَتَعْلَمُ مَا الْقَدَرُ قُلْتُ لَا قَالَ هِيَ الْهَنْدَسَةُ وَ وَضْعُ الْحُدُودِ مِنَ الْبَقَاءِ وَ الْفَنَاءِ ",
          "قَالَ ثُمَّ قَالَ وَ الْقَضَاءُ هُوَ الْإِبْرَامُ وَ إِقَامَةُ الْعَيْنِ ",
          "قَالَ فَاسْتَأْذَنْتُهُ أَنْ أُقَبِّلَ رَأْسَهُ وَ قُلْتُ فَتَحْتَ لِي شَيْئاً كُنْتُ عَنْهُ فِي غَفْلَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus Bin Abdul Rahman who said, ",
            "‘Abu Al-Hassan Al-Reza<sup>asws</sup> said to me: ‘O Yunus! Do not say with the speech of the Qadiriyya, for the Qadiriyya are not speaking with the speech of the people of the Paradise, nor by the speech of the people of the Fire, nor by the speech of Iblees<sup>la</sup>, for the people of the Paradise would be saying <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h43\">[7:43]</a> All Praise is due to Allah Who Guided us to this, and we would not have found the Way had it not been that Allah had Guided us</span>; and the people of the Fire would say <span class=\"ibTxt\"><a href=\"/#/books/quran:23#h106\">[23:106]</a> O our Lord! Our adversity overcame us and we were an erroneous people</span>; and Iblees<sup>la</sup> would say <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h39\">[15:39]</a> He said: Lord! With what You Sent me astray?</span>’.",
            "So I said, ‘By Allah<sup style=\"font-weight: normal\">azwj</sup>! I am not speaking by their speech, but I am saying, nothing can happen to be except <span style=\"text-decoration: underline\">with what</span> Allah<sup style=\"font-weight: normal\">azwj</sup> so Desires, and Intends, and Determines, and Ordains’. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘O Yunus! It is not like this. Nothing can happen to be <span style=\"text-decoration: underline\">except what</span> Allah<sup style=\"font-weight: normal\">azwj</sup> so Desires, and Intends, and Determines, and Ordains.",
            "O Yunus! Do you know what is the Desire?’ I said, ‘No’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘It is the first Remembrance (الذِّكْر). So do you know what is the Intention?’ I said, ‘No’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘It is the Determination upon what He<sup style=\"font-weight: normal\">azwj</sup> so Desires. So do you know what is the Determination?’ I said, ‘No’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘It is the Engineering and the Placement of the limitations for the remaining and the perishing’. ",
            "He (the narrator) said, ‘Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘And the Ordainment, it is the accomplishment of the eyes (physical reality)’. ",
            "He (the narrator) said, ‘So I sought his<sup style=\"font-weight: normal\">asws</sup> permission to kiss his<sup style=\"font-weight: normal\">asws</sup> head, and I said, ‘You<sup style=\"font-weight: normal\">asws</sup> opened something for me which I was oblivious of’."
          ]
        }
      },
      {
        "index": 399,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/325",
              "text": "إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:5",
        "text": [
          " إِنَّ اللَّهَ خَلَقَ الْخَلْقَ فَعَلِمَ مَا هُمْ صَائِرُونَ إِلَيْهِ وَ أَمَرَهُمْ وَ نَهَاهُمْ فَمَا أَمَرَهُمْ بِهِ مِنْ شَيْ‏ءٍ فَقَدْ جَعَلَ لَهُمُ السَّبِيلَ إِلَى تَرْكِهِ وَ لَا يَكُونُونَ آخِذِينَ وَ لَا تَارِكِينَ إِلَّا بِإِذْنِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazal Bin Shazan, from Hammad Bin Isa, from Ibrahim Bin Umar Al Yamani, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Created the creatures so He<sup>azwj</sup> Knew what they would be coming to, and Commanded them and Forbade them. So whatever He<sup>azwj</sup> Commanded them with from something, so He<sup>azwj</sup> has Made the way for them to neglect it, and they would not happen to be taking to it nor neglecting except by the Permission of Allah<sup>azwj</sup>’."
          ]
        }
      },
      {
        "index": 400,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/109",
              "text": "يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/553",
              "text": "حَفْصِ بْنِ قُرْطٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ قُرْطٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:6",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ زَعَمَ أَنَّ اللَّهَ يَأْمُرُ بِالسُّوءِ وَ الْفَحْشَاءِ فَقَدْ كَذَبَ عَلَى اللَّهِ وَ مَنْ زَعَمَ أَنَّ الْخَيْرَ وَ الشَّرَّ بِغَيْرِ مَشِيئَةِ اللَّهِ فَقَدْ أَخْرَجَ اللَّهَ مِنْ سُلْطَانِهِ وَ مَنْ زَعَمَ أَنَّ الْمَعَاصِيَ بِغَيْرِ قُوَّةِ اللَّهِ فَقَدْ كَذَبَ عَلَى اللَّهِ وَ مَنْ كَذَبَ عَلَى اللَّهِ أَدْخَلَهُ اللَّهُ النَّارَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Hafs Bin Qurt, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who claims that Allah<sup>azwj</sup> Commands with the evil and the immoralities, so he has lied upon Allah<sup>azwj</sup>, and the one who claims that the good and the evil exist without the Desire of Allah<sup>azwj</sup>, so he has exited Allah<sup>azwj</sup> from His<sup>azwj</sup> Authority, and the one who claims that the disobedience is (committed) without the (given) Strength of Allah<sup>azwj</sup>, so he has lied upon Allah<sup>azwj</sup>. And the one who lies upon Allah<sup>azwj</sup>, Allah<sup>azwj</sup> would Enter him into the Fire’."
          ]
        }
      },
      {
        "index": 401,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/136",
              "text": "إِسْمَاعِيلَ بْنِ جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:7",
        "text": [
          " كَانَ فِي مَسْجِدِ الْمَدِينَةِ رَجُلٌ يَتَكَلَّمُ فِي الْقَدَرِ وَ النَّاسُ مُجْتَمِعُونَ قَالَ فَقُلْتُ يَا هَذَا أَسْأَلُكَ قَالَ سَلْ قُلْتُ يَكُونُ فِي مُلْكِ اللَّهِ تَبَارَكَ وَ تَعَالَى مَا لَا يُرِيدُ قَالَ فَأَطْرَقَ طَوِيلًا ثُمَّ رَفَعَ رَأْسَهُ إِلَيَّ فَقَالَ لِي يَا هَذَا لَئِنْ قُلْتُ إِنَّهُ يَكُونُ فِي مُلْكِهِ مَا لَا يُرِيدُ إِنَّهُ لَمَقْهُورٌ وَ لَئِنْ قُلْتُ لَا يَكُونُ فِي مُلْكِهِ إِلَّا مَا يُرِيدُ أَقْرَرْتُ لَكَ بِالْمَعَاصِي ",
          "قَالَ فَقُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) سَأَلْتُ هَذَا الْقَدَرِيَّ فَكَانَ مِنْ جَوَابِهِ كَذَا وَ كَذَا فَقَالَ لِنَفْسِهِ نَظَرَ أَمَا لَوْ قَالَ غَيْرَ مَا قَالَ لَهَلَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Ismail Bin Jabir who said, ",
            "‘There was a man in a Masjid of Al-Medina who was speaking regarding the Pre-determination, and the people were gathering. So I said, ‘O you! I (would like to) question you’. He said, ‘Ask’. I said, ‘Can there happen to be in the Kingdom of Allah<sup>azwj</sup> Blessed and High what He<sup>azwj</sup> does not want?’ So he lowered his head for a long while, then raised his head towards me, so he said to me, ‘O you! If I were to say that there does happen to be in His<sup>azwj</sup> Kingdom what He<sup>azwj</sup> does not want, so He<sup>azwj</sup> would be defeated, and if I were to say that there cannot happen to be in His<sup>azwj</sup> Kingdom except what He<sup>azwj</sup> wants, I would be acknowledging to you with the disobedience (freedom to commit sins)’. ",
            "He (the narrator) said, ‘I said to Abu Abdullah<sup>asws</sup>, ‘I asked the Qadiriyya, so it was from his answers, such and such’. So he<sup>asws</sup> said: ‘He watched out for himself. But, had he said other than what he said, he would be destroyed’."
          ]
        }
      },
      {
        "index": 402,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/554",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ الْحَسَنِ زَعْلَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَبِي طَالِبٍ الْقُمِّيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/135",
              "text": "رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ الْحَسَنِ زَعْلَانَ عَنْ أَبِي طَالِبٍ الْقُمِّيِّ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:8",
        "text": [
          " قُلْتُ أَجْبَرَ اللَّهُ الْعِبَادَ عَلَى الْمَعَاصِي قَالَ لَا قُلْتُ فَفَوَّضَ إِلَيْهِمُ الْأَمْرَ قَالَ قَالَ لَا قَالَ قُلْتُ فَمَا ذَا قَالَ لُطْفٌ مِنْ رَبِّكَ بَيْنَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Al Hassan Za’lan, from Abu Talib Al Qummy, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘Does Allah<sup>azwj</sup> Compel the servants upon the disobedience?’ He<sup>asws</sup> said: ‘No’. I said, ‘So, does He<sup>azwj</sup> Delegate the matters to them?’ He<sup>asws</sup> said: ‘No’. I said, ‘So what is (correct in) that?’ He<sup>asws</sup> said: ‘A Kindness from your Lord<sup>azwj</sup> between that’."
          ]
        }
      },
      {
        "index": 403,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/109",
              "text": "يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/219",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/297",
              "text": "أَبِي جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/556",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليهما السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليهما السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:9",
        "text": [
          "ا إِنَّ اللَّهَ أَرْحَمُ بِخَلْقِهِ مِنْ أَنْ يُجْبِرَ خَلْقَهُ عَلَى الذُّنُوبِ ثُمَّ يُعَذِّبَهُمْ عَلَيْهَا وَ اللَّهُ أَعَزُّ مِنْ أَنْ يُرِيدَ أَمْراً فَلَا يَكُونَ ",
          "قَالَ فَسُئِلَا ( عليهما السلام ) هَلْ بَيْنَ الْجَبْرِ وَ الْقَدَرِ مَنْزِلَةٌ ثَالِثَةٌ قَالَا نَعَمْ أَوْسَعُ مِمَّا بَيْنَ السَّمَاءِ وَ الْأَرْضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from someone else, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having said: ‘Allah<sup>azwj</sup> is more Merciful with His<sup>azwj</sup> creatures than Compelling His<sup>azwj</sup> creatures upon the sins, then He<sup>azwj</sup> Punishes them upon these; and Allah is Mightier than for Him<sup>azwj</sup> to Intend a matter, so it does not come into being’. ",
            "He (the narrator) said, ‘So they<sup>asws</sup> were both asked, ‘Is there a third status between the Compulsion and the Pre-determination?’ They<sup>asws</sup> both said: ‘Yes, more extensive than what is between the sky and the earth’."
          ]
        }
      },
      {
        "index": 404,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/109",
              "text": "يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/557",
              "text": "صَالِحِ بْنِ سَهْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ صَالِحِ بْنِ سَهْلٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:10",
        "text": [
          " سُئِلَ عَنِ الْجَبْرِ وَ الْقَدَرِ فَقَالَ لَا جَبْرَ وَ لَا قَدَرَ وَ لَكِنْ مَنْزِلَةٌ بَيْنَهُمَا فِيهَا الْحَقُّ الَّتِي بَيْنَهُمَا لَا يَعْلَمُهَا إِلَّا الْعَالِمُ أَوْ مَنْ عَلَّمَهَا إِيَّاهُ الْعَالِمُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Salih Bin Sahl, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about the compulsion and the Pre-determination’. So he<sup>asws</sup> said: ‘There is neither Compulsion nor Pre-determination, but there is a status between the two wherein is the Truth which is between the two. None knows it except for the knowledgeable ones<sup>asws</sup>, or the ones whom the knowledgeable ones<sup>asws</sup> teach it to’."
          ]
        }
      },
      {
        "index": 405,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/304",
              "text": "مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/558",
              "text": "عِدَّةٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدٍ عَنْ يُونُسَ عَنْ عِدَّةٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:11",
        "text": [
          " قَالَ لَهُ رَجُلٌ جُعِلْتُ فِدَاكَ أَجْبَرَ اللَّهُ الْعِبَادَ عَلَى الْمَعَاصِي فَقَالَ اللَّهُ أَعْدَلُ مِنْ أَنْ يُجْبِرَهُمْ عَلَى الْمَعَاصِي ثُمَّ يُعَذِّبَهُمْ عَلَيْهَا ",
          "فَقَالَ لَهُ جُعِلْتُ فِدَاكَ فَفَوَّضَ اللَّهُ إِلَى الْعِبَادِ قَالَ فَقَالَ لَوْ فَوَّضَ إِلَيْهِمْ لَمْ يَحْصُرْهُمْ بِالْأَمْرِ وَ النَّهْيِ ",
          "فَقَالَ لَهُ جُعِلْتُ فِدَاكَ فَبَيْنَهُمَا مَنْزِلَةٌ قَالَ فَقَالَ نَعَمْ أَوْسَعُ مَا بَيْنَ السَّمَاءِ وَ الْأَرْضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad, from Yunus, from a number (of people), ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Does Allah<sup>azwj</sup> Compel the servants upon the disobedience?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is more Just that for Him<sup>azwj</sup> to Compel them upon the disobedience then Punishing them upon it’. ",
            "So he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! So does Allah<sup>azwj</sup> Delegate to the servants?’ So He<sup>azwj</sup> Said: ‘If He<sup>azwj</sup> had Delegated to them, He<sup>azwj</sup> would not have Surrounded them with the Commands and the Prohibitions’. ",
            "So he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! So there is a (third) status between the two?’ So he<sup>asws</sup> said: ‘Yes, more extensive than what is between the sky and the earth’."
          ]
        }
      },
      {
        "index": 406,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/358",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "غَيْرُهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ وَ غَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:12",
        "text": [
          " قُلْتُ لِأَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) إِنَّ بَعْضَ أَصْحَابِنَا يَقُولُ بِالْجَبْرِ وَ بَعْضَهُمْ يَقُولُ بِالِاسْتِطَاعَةِ ",
          "قَالَ فَقَالَ لِي اكْتُبْ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ قَالَ اللَّهُ عَزَّ وَ جَلَّ يَا ابْنَ آدَمَ بِمَشِيئَتِي كُنْتَ أَنْتَ الَّذِي تَشَاءُ وَ بِقُوَّتِي أَدَّيْتَ إِلَيَّ فَرَائِضِي وَ بِنِعْمَتِي قَوِيتَ عَلَى مَعْصِيَتِي جَعَلْتُكَ سَمِيعاً بَصِيراً مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ وَ مَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ وَ ذَلِكَ أَنِّي أَوْلَى بِحَسَنَاتِكَ مِنْكَ وَ أَنْتَ أَوْلَى بِسَيِّئَاتِكَ مِنِّي وَ ذَلِكَ أَنِّي لَا أُسْأَلُ عَمَّا أَفْعَلُ وَ هُمْ يُسْأَلُونَ ",
          "قَدْ نَظَمْتُ لَكَ كُلَّ شَيْ‏ءٍ تُرِيدُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, and someone else, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I said to Abu Al-Hassan Al-Reza<sup>asws</sup>, ‘Some of our companions are saying with the Compulsion and some of them are saying with the (people’s) capabilities’. ",
            "He (the narrator) said, ‘So he<sup>asws</sup> said to me: ‘Write down, ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Said: “O son of Adam<sup>as</sup>! By My<sup>azwj</sup> Desire you came into being desiring (for yourself), and by My<sup>azwj</sup> Strength you are fulfilling My<sup>azwj</sup> Obligations to Me<sup>azwj</sup>, and by My<sup>azwj</sup> Favour I<sup>azwj</sup> (have Given) you strength upon disobeying Me<sup>azwj</sup>. I<sup>azwj</sup> made you to be hearing, seeing. Whatever you attains from the good deeds, so it is from Allah<sup>azwj</sup>, and whatever you attain from an evil, so it is from yourself, and that is because I<sup>azwj</sup> am closer with your good deeds than you are, and you are closer with your evil deeds than I<sup>azwj</sup> am, and that is because I<sup>azwj</sup> will not be questioned about what I<sup>azwj</sup> Do, and they would be questioned”’.",
            "I have organised for you everything you wanted’."
          ]
        }
      },
      {
        "index": 407,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/358",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/559",
              "text": "حُسَيْنِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/254",
              "text": "مُحَمَّدِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/114",
              "text": "حَدَّثَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ حُسَيْنِ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:13",
        "text": [
          " لَا جَبْرَ وَ لَا تَفْوِيضَ وَ لَكِنْ أَمْرٌ بَيْنَ أَمْرَيْنِ قَالَ قُلْتُ وَ مَا أَمْرٌ بَيْنَ أَمْرَيْنِ قَالَ مَثَلُ ذَلِكَ رَجُلٌ رَأَيْتَهُ عَلَى مَعْصِيَةٍ فَنَهَيْتَهُ فَلَمْ يَنْتَهِ فَتَرَكْتَهُ فَفَعَلَ تِلْكَ الْمَعْصِيَةَ فَلَيْسَ حَيْثُ لَمْ يَقْبَلْ مِنْكَ فَتَرَكْتَهُ كُنْتَ أَنْتَ الَّذِي أَمَرْتَهُ بِالْمَعْصِيَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Husayn Bin Muhammad, from Muhammad Bin Yahya, from the one who narrated it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is neither Compulsion nor Delegation, but there is a matter between the two matters’. I said, ‘And what is the matter between the two matters?’ He<sup>asws</sup> said: ‘An example of that is a man you see upon disobedience. So you forbid him, so he does not finish it. So you neglect him (for a while). Then he commits that very disobedience. Therefore it isn’t so when he did not accept from you, so you neglected him, you came to be the one who instructed him with the disobedience’."
          ]
        }
      },
      {
        "index": 408,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/115",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:30:14",
        "text": [
          " اللَّهُ أَكْرَمُ مِنْ أَنْ يُكَلِّفَ النَّاسَ مَا لَا يُطِيقُونَ وَ اللَّهُ أَعَزُّ مِنْ أَنْ يَكُونَ فِي سُلْطَانِهِ مَا لَا يُرِيدُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from Ali Bin Al Hakam, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> is more Benevolent than for Him<sup>azwj</sup> to Encumber the people what they are not enduring; and Allah<sup>azwj</sup> is Mightier than that there would happen to be in His<sup>azwj</sup> Authority what He<sup>azwj</sup> does not want’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:30",
  "kind": "verse_list"
}