{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:1:3:32",
        "titles": {
          "ar": "بَابُ الْبَيَانِ وَ التَّعْرِيفِ وَ لُزُومِ الْحُجَّةِ",
          "en": "Chapter 32 – The Declaration, and the Definition, and the necessity of the Proof<sup>asws</sup>"
        }
      }
    ],
    "index": 55,
    "local_index": 32,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:1:3:33",
        "titles": {
          "ar": "بَابُ اخْتِلَافِ الْحُجَّةِ عَلَى عِبَادِهِ",
          "en": "Chapter 33 – Different Arguments upon His<sup>azwj</sup> servants"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:1:3:31",
        "titles": {
          "ar": "بَابُ الِاسْتِطَاعَةِ",
          "en": "Chapter 31 – The Capability"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:32",
    "titles": {
      "ar": "بَابُ الْبَيَانِ وَ التَّعْرِيفِ وَ لُزُومِ الْحُجَّةِ",
      "en": "Chapter 32 – The Declaration, and the Definition, and the necessity of the Proof<sup>asws</sup>"
    },
    "verse_count": 6,
    "verse_start_index": 412,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 413,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:32:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنِ ابْنِ الطَّيَّارِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ احْتَجَّ عَلَى النَّاسِ بِمَا آتَاهُمْ وَ عَرَّفَهُمْ .",
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, and someone else, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Ibn Al Tayyar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Argued upon the people with what He<sup>azwj</sup> Gave them and Introduced them (to)’. ",
            "<span style=\"font-size: small\">Muhammad Bin Ismail, from Al Fazl Bin Shazan, from Ibn Abu Umeyr, from Jameel Bin Darraj </span>– similar to it."
          ]
        }
      },
      {
        "index": 414,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:32:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْمَعْرِفَةُ مِنْ صُنْعِ مَنْ هِيَ قَالَ مِنْ صُنْعِ اللَّهِ لَيْسَ لِلْعِبَادِ فِيهَا صُنْعٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and someone else, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Abu Umeyr, from Muhammad Bin Hakeym who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The recognition (الْمَعْرِفَةُ) from a maker, whose is it?’ He<sup>asws</sup> said: ‘From the Making of Allah<sup>azwj</sup>. There isn’t for the servants, a making with regards to it’."
          ]
        }
      },
      {
        "index": 415,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:32:3",
        "refs": {
          "Quran": [
            "/books/quran:41:17",
            "/books/quran:76:3",
            "/books/quran:91:8",
            "/books/quran:9:115"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ حَمْزَةَ بْنِ مُحَمَّدٍ الطَّيَّارِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ ما كانَ اللَّهُ لِيُضِلَّ قَوْماً بَعْدَ إِذْ هَداهُمْ حَتَّى يُبَيِّنَ لَهُمْ ما يَتَّقُونَ قَالَ حَتَّى يُعَرِّفَهُمْ مَا يُرْضِيهِ وَ مَا يُسْخِطُهُ ",
          "وَ قَالَ فَأَلْهَمَها فُجُورَها وَ تَقْواها قَالَ بَيَّنَ لَهَا مَا تَأْتِي وَ مَا تَتْرُكُ ",
          "وَ قَالَ إِنَّا هَدَيْناهُ السَّبِيلَ إِمَّا شاكِراً وَ إِمَّا كَفُوراً قَالَ عَرَّفْنَاهُ إِمَّا آخِذٌ وَ إِمَّا تَارِكٌ ",
          "وَ عَنْ قَوْلِهِ وَ أَمَّا ثَمُودُ فَهَدَيْناهُمْ فَاسْتَحَبُّوا الْعَمى عَلَى الْهُدى قَالَ عَرَّفْنَاهُمْ فَاسْتَحَبُّوا الْعَمَى عَلَى الْهُدَى وَ هُمْ يَعْرِفُونَ وَ فِي رِوَايَةٍ بَيَّنَّا لَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ibn Fazzal, from Sa’alba Bin Maymoun, from Hamza Bin Muhammad Al Tayyar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h115\">[9:115]</a> It was not for Allah that He should Lead a people astray after He has Guided them; until He Clarifies to them what they should guard against</span>. He<sup>asws</sup> said: ‘Until He<sup>azwj</sup> has Introduced to them what Pleases Him<sup>azwj</sup> and what Angers Him<sup>azwj</sup>’. ",
            "And he (the narrator) said, ‘(What about) <span class=\"ibTxt\"><a href=\"/#/books/quran:91#h8\">[91:8]</a> Then He inspired it to understand its immorality and its piety</span>?’ He<sup>asws</sup> said: ‘Clarified to it what you should be coming to and what you should neglect’. ",
            "And he (the narrator) said, ‘(What about) <span class=\"ibTxt\"><a href=\"/#/books/quran:76#h3\">[76:3]</a> Surely, We have shown him the way: he may be thankful or unthankful</span>?’ He<sup>asws</sup> said: ‘Made him (human being) recognise it, either he takes it or he leaves it’. ",
            "And about His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:41#h17\">[41:17]</a> And as to Samood, We Guided them but they chose blindness over the Guidance</span>, (he<sup>asws</sup> said): ‘And they were recognising’. And in a report, ‘(He<sup>asws</sup> said): ‘It was clarified to them’."
          ]
        }
      },
      {
        "index": 416,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:32:4",
        "refs": {
          "Quran": [
            "/books/quran:90:10"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنِ ابْنِ بُكَيْرٍ عَنْ حَمْزَةَ بْنِ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ هَدَيْناهُ النَّجْدَيْنِ قَالَ نَجْدَ الْخَيْرِ وَ الشَّرِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Ibn Bukeyr, from Hamza Bin Muhammad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:90#h10\">[90:10]</a> And pointed out to him the two conspicuous ways</span>, he<sup>asws</sup> said: ‘The way of good and the evil’."
          ]
        }
      },
      {
        "index": 417,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:32:5",
        "refs": {
          "Quran": [
            "/books/quran:65:7",
            "/books/quran:2:286",
            "/books/quran:9:115"
          ]
        },
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ يُونُسَ عَنْ حَمَّادٍ عَنْ عَبْدِ الْأَعْلَى قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَصْلَحَكَ اللَّهُ هَلْ جُعِلَ فِي النَّاسِ أَدَاةٌ يَنَالُونَ بِهَا الْمَعْرِفَةَ قَالَ فَقَالَ لَا قُلْتُ فَهَلْ كُلِّفُوا الْمَعْرِفَةَ قَالَ لَا عَلَى اللَّهِ الْبَيَانُ لا يُكَلِّفُ اللَّهُ نَفْساً إِلَّا وُسْعَها وَ لا يُكَلِّفُ اللَّهُ نَفْساً إِلَّا ما آتاها ",
          "قَالَ وَ سَأَلْتُهُ عَنْ قَوْلِهِ وَ ما كانَ اللَّهُ لِيُضِلَّ قَوْماً بَعْدَ إِذْ هَداهُمْ حَتَّى يُبَيِّنَ لَهُمْ ما يَتَّقُونَ قَالَ حَتَّى يُعَرِّفَهُمْ مَا يُرْضِيهِ وَ مَا يُسْخِطُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Yunus, from Hammad, from Abdul A’ala who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! Has there Made to be in the people a tool by which they can attain the recognition?’ So he<sup>asws</sup> said: ‘No’. He said, ‘So is He<sup>azwj</sup> Encumbering the recognition?’ He<sup>asws</sup> said: ‘No. Upon Allah<sup>azwj</sup> is the Clarification. <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h286\">[2:286]</a> Allah does not impose upon any soul a duty but to the extent of its ability</span>. <span class=\"ibTxt\"><a href=\"/#/books/quran:65#h7\">[65:7]</a> Allah does not lay on any soul a burden except to the extent to which He has granted it</span>’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h115\">[9:115]</a> It was not for Allah that He should Lead a people astray after He has Guided them; until He Clarifies to them what they should guard against</span>. He<sup>asws</sup> said: ‘Until He<sup>azwj</sup> Introduces to them what Pleases Him<sup>azwj</sup> and what Angers Him<sup>azwj</sup>’."
          ]
        }
      },
      {
        "index": 418,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:32:6",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ يُونُسَ عَنْ سَعْدَانَ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ لَمْ يُنْعِمْ عَلَى عَبْدٍ نِعْمَةً إِلَّا وَ قَدْ أَلْزَمَهُ فِيهَا الْحُجَّةَ مِنَ اللَّهِ فَمَنْ مَنَّ اللَّهُ عَلَيْهِ فَجَعَلَهُ قَوِيّاً فَحُجَّتُهُ عَلَيْهِ الْقِيَامُ بِمَا كَلَّفَهُ وَ احْتِمَالُ مَنْ هُوَ دُونَهُ مِمَّنْ هُوَ أَضْعَفُ مِنْهُ ",
          "وَ مَنْ مَنَّ اللَّهُ عَلَيْهِ فَجَعَلَهُ مُوَسَّعاً عَلَيْهِ فَحُجَّتُهُ عَلَيْهِ مَالُهُ ثُمَّ تَعَاهُدُهُ الْفُقَرَاءَ بَعْدُ بِنَوَافِلِهِ وَ مَنْ مَنَّ اللَّهُ عَلَيْهِ فَجَعَلَهُ شَرِيفاً فِي بَيْتِهِ جَمِيلًا فِي صُورَتِهِ فَحُجَّتُهُ عَلَيْهِ أَنْ يَحْمَدَ اللَّهَ تَعَالَى عَلَى ذَلِكَ وَ أَنْ لَا يَتَطَاوَلَ عَلَى غَيْرِهِ فَيَمْنَعَ حُقُوقَ الضُّعَفَاءِ لِحَالِ شَرَفِهِ وَ جَمَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Yunus, from Sa’dan, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> does not Favour upon a servant with a Bounty unless He<sup>azwj</sup> has Necessitated with regards to it the Proof<sup>asws</sup> from Allah<sup>azwj</sup>. So the one whom Allah<sup>azwj</sup> Favours upon, so He<sup>azwj</sup> would Make him strong, so the Proof is established upon him with what He<sup>azwj</sup> Encumbers him with, and the toleration of the one who is below him from the ones who are weaker than him (in understanding). ",
            "And the one whom Allah<sup>azwj</sup> Favours upon, so He<sup>azwj</sup> would Make him capacious upon it, so the Argument upon him is his wealth. Then He<sup>azwj</sup> Pacted him with (helping) the poor afterwards by his optional (helping). And the one whom Allah<sup>azwj</sup> Favours upon, so He<sup>azwj</sup> would Make him noble in his house, beautiful in his image. So the Argument upon him is that he should Praise Allah<sup>azwj</sup> the Exalted upon that, and that he should not be insolent upon others, so that he would prevent the rights of the weak due to his noble state and his beauty’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:32",
  "kind": "verse_list"
}