{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:1:3", "titles": {"ar": "كِتَابُ التَّوْحِيدِ", "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"}}, {"indexed_titles": {"en": "Chapter 5"}, "path": "/books/al-kafi:1:3:5", "titles": {"ar": "بَابُ الْمَعْبُودِ", "en": "Chapter 5 – The Worshipped One (Deity)"}}], "index": 28, "local_index": 5, "part_type": "Chapter", "path": "/books/al-kafi:1:3:5", "titles": {"ar": "بَابُ الْمَعْبُودِ", "en": "Chapter 5 – The Worshipped One (Deity)"}, "verse_count": 3, "verse_start_index": 231, "verses": [{"index": 232, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:3:5:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ وَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ عَبَدَ اللَّهَ بِالتَّوَهُّمِ فَقَدْ كَفَرَ وَ مَنْ عَبَدَ الِاسْمَ دُونَ الْمَعْنَى فَقَدْ كَفَرَ وَ مَنْ عَبَدَ الِاسْمَ وَ الْمَعْنَى فَقَدْ أَشْرَكَ وَ مَنْ عَبَدَ الْمَعْنَى بِإِيقَاعِ الْأَسْمَاءِ عَلَيْهِ بِصِفَاتِهِ الَّتِي وَصَفَ بِهَا نَفْسَهُ فَعَقَدَ عَلَيْهِ قَلْبَهُ وَ نَطَقَ بِهِ لِسَانُهُ فِي سَرَائِرِهِ وَ عَلَانِيَتِهِ فَأُولَئِكَ أَصْحَابُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) حَقّاً \nوَ فِي حَدِيثٍ آخَرَ أُولَئِكَ هُمُ الْمُؤْمِنُونَ حَقّاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, Bin Ubeyd, from Al Hassan Bin Mahboub, from Ibn Ra’ib and from someone else, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who worships Allah<sup>azwj</sup> in the imaginations so he has blasphemed (disbelieved); and the one who worships the Name besides the Meaning, so he has blasphemed; and the one who worships the Name and the Meaning, so he has associated (committed polytheism (Shirk)); and the one who worships the Meaning with the harmony of the Name with His<sup>azwj</sup> Attributes upon Him<sup>azwj</sup> which He<sup>azwj</sup> Himself has Described with, so He<sup>azwj</sup> pacts his heart upon it, and his tongue speaks with it during his privacy and his public appearances, so they would be the companions of Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> truly’. \nAnd in another Hadeeth, ‘(He<sup style=\"font-weight: normal\">asws</sup> said): ‘They are the <span class=\"iTxt\">Momin</span>een, truly’."}]}, {"index": 233, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:3:5:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ هِشَامِ بْنِ الْحَكَمِ أَنَّهُ سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَسْمَاءِ اللَّهِ وَ اشْتِقَاقِهَا اللَّهُ مِمَّا هُوَ مُشْتَقٌّ قَالَ فَقَالَ لِي يَا هِشَامُ اللَّهُ مُشْتَقٌّ مِنْ إِلَهٍ وَ الْإِلَهُ يَقْتَضِي مَأْلُوهاً وَ الِاسْمُ غَيْرُ الْمُسَمَّى فَمَنْ عَبَدَ الِاسْمَ دُونَ الْمَعْنَى فَقَدْ كَفَرَ وَ لَمْ يَعْبُدْ شَيْئاً وَ مَنْ عَبَدَ الِاسْمَ وَ الْمَعْنَى فَقَدْ كَفَرَ وَ عَبَدَ اثْنَيْنِ وَ مَنْ عَبَدَ الْمَعْنَى دُونَ الِاسْمِ فَذَاكَ التَّوْحِيدُ أَ فَهِمْتَ يَا هِشَامُ \nقَالَ فَقُلْتُ زِدْنِي قَالَ إِنَّ لِلَّهِ تِسْعَةً وَ تِسْعِينَ اسْماً فَلَوْ كَانَ الِاسْمُ هُوَ الْمُسَمَّى لَكَانَ كُلُّ اسْمٍ مِنْهَا إِلَهاً وَ لَكِنَّ اللَّهَ مَعْنًى يُدَلُّ عَلَيْهِ بِهَذِهِ الْأَسْمَاءِ وَ كُلُّهَا غَيْرُهُ يَا هِشَامُ الْخُبْزُ اسْمٌ لِلْمَأْكُولِ وَ الْمَاءُ اسْمٌ لِلْمَشْرُوبِ وَ الثَّوْبُ اسْمٌ لِلْمَلْبُوسِ وَ النَّارُ اسْمٌ لِلْمُحْرِقِ أَ فَهِمْتَ يَا هِشَامُ فَهْماً تَدْفَعُ بِهِ وَ تُنَاضِلُ بِهِ أَعْدَاءَنَا وَ الْمُتَّخِذِينَ مَعَ اللَّهِ جَلَّ وَ عَزَّ غَيْرَهُ قُلْتُ نَعَمْ\nقَالَ فَقَالَ نَفَعَكَ اللَّهُ بِهِ وَ ثَبَّتَكَ يَا هِشَامُ \nقَالَ هِشَامٌ فَوَ اللَّهِ مَا قَهَرَنِي أَحَدٌ فِي التَّوْحِيدِ حَتَّى قُمْتُ مَقَامِي هَذَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nazar Bin Suweyd, from Hisham Bin Al Hakam, \n‘He asked Abu Abdullah<sup>asws</sup> about the Names of Allah<sup>azwj</sup> and their deriving Allah<sup>azwj</sup> from what He<sup>azwj</sup> is Derived’. So he<sup>asws</sup> said to me: ‘O Hisham! Allah<sup>azwj</sup> is derived from ‘God’ and ‘The God’, it requires its worshipper. And the name is other than the named. So the one who worships the Name besides the Meaning, so he has blasphemed and has not worshipped anything; and the one who worships the Name and the Meaning, so he has blasphemed and has worshipped two; and the one who worships the Meaning besides the Name, so that is the <span class=\"iTxt\">Tawheed</span> (Oneness). Do you understand, O Hisham?’ \nHe (Hisham) said, ‘So I said, ‘Increase it for me’. He<sup>asws</sup> said: ‘For Allah<sup>azwj</sup> there are ninety nine Names, and if it was such that the Name was the Named, it would be so that every Name from these would be a God. But, Allah<sup>azwj</sup> is the Meaning which these Names Indicate upon, and all of these are other than Him<sup>azwj</sup>. O Hisham! The bread is a name of the food, and the water is a name of the drink, and the cloth is a name of the garment, and the fire is a name of the incinerator. Do you understand, O Hisham? (It is) an understanding you can repulse and fight our<sup>asws</sup> enemies with it and the ones who taking others along with Allah<sup>azwj</sup> Majestic and Mighty’.  I said, ‘Yes’. \nHe (Hisham) said, ‘So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Benefit you with it and Affirm you, O Hisham!’. \nHisham said, ‘So, by Allah<sup>azwj</sup>! No one was able to subdue me regarding the <span class=\"iTxt\">Tawheed</span> (Oneness) until I rose to this status of mine’."}]}, {"index": 234, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:3:5:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ قَالَ كَتَبْتُ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) أَوْ قُلْتُ لَهُ جَعَلَنِي اللَّهُ فِدَاكَ نَعْبُدُ الرَّحْمَنَ الرَّحِيمَ الْوَاحِدَ الْأَحَدَ الصَّمَدَ قَالَ فَقَالَ إِنَّ مَنْ عَبَدَ الِاسْمَ دُونَ الْمُسَمَّى بِالْأَسْمَاءِ أَشْرَكَ وَ كَفَرَ وَ جَحَدَ وَ لَمْ يَعْبُدْ شَيْئاً بَلِ اعْبُدِ اللَّهَ الْوَاحِدَ الْأَحَدَ الصَّمَدَ الْمُسَمَّى بِهَذِهِ الْأَسْمَاءِ دُونَ الْأَسْمَاءِ إِنَّ الْأَسْمَاءَ صِفَاتٌ وَصَفَ بِهَا نَفْسَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Al Abbas Bin Marouf, from Abdul Rahman Bin Abu Najran who said, \n‘I wrote to Abu Ja’far<sup>asws</sup>, or said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! We worship the Beneficent, the Merciful, the One, the First, the Last’. So he<sup>asws</sup> said: ‘Surely, the one who worships the Name besides the One Named by the Names has associated (committed Shirk), and blasphemed, and denied and did not worship anything. But worship the One, the First, the Last, the Named One by these Names, besides the Names. The Name is an attribute by which He<sup>azwj</sup> Describes Himself’."}]}]}, "index": "al-kafi:1:3:5", "kind": "verse_list"}