{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:1:3", "titles": {"ar": "كِتَابُ التَّوْحِيدِ", "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"}}, {"indexed_titles": {"en": "Chapter 6"}, "path": "/books/al-kafi:1:3:6", "titles": {"ar": "بَابُ الْكَوْنِ وَ الْمَكَانِ", "en": "Chapter 6 – Coming into being and the space"}}], "index": 29, "local_index": 6, "part_type": "Chapter", "path": "/books/al-kafi:1:3:6", "titles": {"ar": "بَابُ الْكَوْنِ وَ الْمَكَانِ", "en": "Chapter 6 – Coming into being and the space"}, "verse_count": 8, "verse_start_index": 234, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 235, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:3:6:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ قَالَ سَأَلَ نَافِعُ بْنُ الْأَزْرَقِ أَبَا جَعْفَرٍ ( عليه السلام ) فَقَالَ أَخْبِرْنِي عَنِ اللَّهِ مَتَى كَانَ فَقَالَ مَتَى لَمْ يَكُنْ حَتَّى أُخْبِرَكَ مَتَى كَانَ سُبْحَانَ مَنْ لَمْ يَزَلْ وَ لَا يَزَالُ فَرْداً صَمَداً لَمْ يَتَّخِذْ صَاحِبَةً وَ لَا وَلَداً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Abu Hamza who said, ", "‘Naf’au Bin Arzaq asked Abu Ja’far<sup>asws</sup> saying, ‘Inform me about Allah<sup>azwj</sup>, when was He<sup>azwj</sup> (from)?’ So he<sup>asws</sup> said: ‘When was He<sup>azwj</sup> not, and I<sup>asws</sup> shall inform you when He<sup>azwj</sup> was. Glorious is the One who never ceased to be and will not cease to be, Individual, Last, neither having taken a female companion nor a son’."]}}, {"index": 236, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:3:6:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ جَاءَ رَجُلٌ إِلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) مِنْ وَرَاءِ نَهَرِ بَلْخَ فَقَالَ إِنِّي أَسْأَلُكَ عَنْ مَسْأَلَةٍ فَإِنْ أَجَبْتَنِي فِيهَا بِمَا عِنْدِي قُلْتُ بِإِمَامَتِكَ فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) سَلْ عَمَّا شِئْتَ فَقَالَ أَخْبِرْنِي عَنْ رَبِّكَ مَتَى كَانَ وَ كَيْفَ كَانَ وَ عَلَى أَيِّ شَيْ‏ءٍ كَانَ اعْتِمَادُهُ ", "فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَيَّنَ الْأَيْنَ بِلَا أَيْنٍ وَ كَيَّفَ الْكَيْفَ بِلَا كَيْفٍ وَ كَانَ اعْتِمَادُهُ عَلَى قُدْرَتِهِ ", "فَقَامَ إِلَيْهِ الرَّجُلُ فَقَبَّلَ رَأْسَهُ وَ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ وَ أَنَّ عَلِيّاً وَصِيُّ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ الْقَيِّمُ بَعْدَهُ بِمَا قَامَ بِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ أَنَّكُمُ الْأَئِمَّةُ الصَّادِقُونَ وَ أَنَّكَ الْخَلَفُ مِنْ بَعْدِهِمْ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ahmad Bin Muhammad Bin Abu Nasr who said, ", "‘A man came over to Abu Al-Hassan Al-Reza<sup>asws</sup> from behind the river Balkh. So he said, ‘I want to ask you<sup>asws</sup> a question. So if you<sup>asws</sup> were to answer me with regards to it with what is with me, I shall speak with your<sup>asws</sup> Imamate’. So Abu Al Hassan<sup>asws</sup> said: ‘Ask about whatever you so desire to’. So he said, ‘Inform me about your<sup>asws</sup> Lord<sup>azwj</sup>, when was He<sup>azwj</sup> (from), and how was He<sup>azwj</sup> and upon which thing is His<sup>azwj</sup> dependency?’ ", "So Abu Al-Hassan<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High is the ‘where’ of the ‘where’ without a ‘where’, and ‘how’ of the ‘how’ without a ‘how’, and His<sup>azwj</sup> dependency is upon His<sup>azwj</sup> Power’. ", "So the man stood up to him<sup>asws</sup> and kissed his<sup>asws</sup> forehead and said, ‘I testify that there is no god except Allah<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is His<sup>azwj</sup> Rasool<sup>saww</sup>, and that Ali<sup>asws</sup> is a successor<sup>asws</sup> of Rasool<sup>saww</sup>, and the custodian after him<sup>saww</sup> with whatever Rasool-Allah<sup>saww</sup> stood with, and you<sup>asws</sup> all (Imams<sup>asws</sup> are the truthful ones, and that you<sup>asws</sup> are the replacement from after them<sup>asws</sup>’."]}}, {"index": 237, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:3:6:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ جَاءَ رَجُلٌ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ لَهُ أَخْبِرْنِي عَنْ رَبِّكَ مَتَى كَانَ فَقَالَ وَيْلَكَ إِنَّمَا يُقَالُ لِشَيْ‏ءٍ لَمْ يَكُنْ مَتَى كَانَ إِنَّ رَبِّي تَبَارَكَ وَ تَعَالَى كَانَ وَ لَمْ يَزَلْ حَيّاً بِلَا كَيْفٍ وَ لَمْ يَكُنْ لَهُ كَانَ وَ لَا كَانَ لِكَوْنِهِ كَوْنُ كَيْفٍ وَ لَا كَانَ لَهُ أَيْنٌ وَ لَا كَانَ فِي شَيْ‏ءٍ وَ لَا كَانَ عَلَى شَيْ‏ءٍ وَ لَا ابْتَدَعَ لِمَكَانِهِ مَكَاناً وَ لَا قَوِيَ بَعْدَ مَا كَوَّنَ الْأَشْيَاءَ وَ لَا كَانَ ضَعِيفاً قَبْلَ أَنْ يُكَوِّنَ شَيْئاً وَ لَا كَانَ مُسْتَوْحِشاً قَبْلَ أَنْ يَبْتَدِعَ شَيْئاً وَ لَا يُشْبِهُ شَيْئاً مَذْكُوراً وَ لَا كَانَ خِلْواً مِنْ الْمُلْكِ قَبْلَ إِنْشَائِهِ وَ لَا يَكُونُ مِنْهُ خِلْواً بَعْدَ ذَهَابِهِ", "لَمْ يَزَلْ حَيّاً بِلَا حَيَاةٍ وَ مَلِكاً قَادِراً قَبْلَ أَنْ يُنْشِئَ شَيْئاً وَ مَلِكاً جَبَّاراً بَعْدَ إِنْشَائِهِ لِلْكَوْنِ فَلَيْسَ لِكَوْنِهِ كَيْفٌ وَ لَا لَهُ أَيْنٌ وَ لَا لَهُ حَدٌّ وَ لَا يُعْرَفُ بِشَيْ‏ءٍ يُشْبِهُهُ وَ لَا يَهْرَمُ لِطُولِ الْبَقَاءِ وَ لَا يَصْعَقُ لِشَيْ‏ءٍ بَلْ لِخَوْفِهِ تَصْعَقُ الْأَشْيَاءُ كُلُّهَا", "كَانَ حَيّاً بِلَا حَيَاةٍ حَادِثَةٍ وَ لَا كَوْنٍ مَوْصُوفٍ وَ لَا كَيْفٍ مَحْدُودٍ وَ لَا أَيْنٍ مَوْقُوفٍ عَلَيْهِ وَ لَا مَكَانٍ جَاوَرَ شَيْئاً بَلْ حَيٌّ يُعْرَفُ وَ مَلِكٌ لَمْ يَزَلْ لَهُ الْقُدْرَةُ وَ الْمُلْكُ أَنْشَأَ مَا شَاءَ حِينَ شَاءَ بِمَشِيئَتِهِ لَا يُحَدُّ وَ لَا يُبَعَّضُ وَ لَا يَفْنَى كَانَ أَوَّلًا بِلَا كَيْفٍ وَ يَكُونُ آخِراً بِلَا أَيْنٍ وَ كُلُّ شَيْ‏ءٍ هَالِكٌ إِلَّا وَجْهَهُ لَهُ الْخَلْقُ وَ الْأَمْرُ تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ ", "وَيْلَكَ أَيُّهَا السَّائِلُ إِنَّ رَبِّي لَا تَغْشَاهُ الْأَوْهَامُ وَ لَا تَنْزِلُ بِهِ الشُّبُهَاتُ وَ لَا يَحَارُ وَ لَا يُجَاوِزُهُ شَيْ‏ءٌ وَ لَا تَنْزِلُ بِهِ الْأَحْدَاثُ وَ لَا يُسْأَلُ عَنْ شَيْ‏ءٍ وَ لَا يَنْدَمُ عَلَى شَيْ‏ءٍ وَ لَا تَأْخُذُهُ سِنَةٌ وَ لَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَ مَا فِي الْأَرْضِ وَ مَا بَيْنَهُمَا وَ مَا تَحْتَ الثَّرَى ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer who said, ", "‘A man came over to Abu Ja’far<sup>asws</sup>, and he said to him<sup>asws</sup>, ‘Inform me about your<sup>asws</sup> Lord<sup>azwj</sup>, when was He<sup>azwj</sup> (from)?’ So he<sup>asws</sup> said: ‘Woe be unto you! But rather, it is only said to the thing which never was, when it was from. My<sup>asws</sup> Lord<sup>azwj</sup>, Blessed and High, always has been and will not cease to be living without a ‘how’, and there cannot happen to be a ‘was’ for Him<sup>azwj</sup>, nor was there for His<sup>azwj</sup> coming into being an occurrence of ‘how’, nor was there for Him<sup>azwj</sup> a ‘where’, nor was He<sup>azwj</sup> in anything, nor was He<sup>azwj</sup> upon anything, nor was there a beginning for His<sup>azwj</sup> Place a place, nor was He<sup>azwj</sup> Strong after the coming into being of the things, nor was He<sup>azwj</sup> weak before the things came into being, nor was He<sup>azwj</sup> lonely before He<sup>azwj</sup> Initiated the things, nor does anything mentionable resemble Him<sup>azwj</sup>, nor was He<sup>azwj</sup> Distinct from His<sup>azwj</sup> Kingdom before He<sup>azwj</sup> Built it, nor will there be a distinction from Him<sup>azwj</sup> after its non-existence. ", "He<sup>azwj</sup> had never ceased to be living without a life and a kingdom and a Powerful King before He<sup>azwj</sup> Built anything, and was a Compelling King after His<sup>azwj</sup> Building the universe. So there isn’t from His<sup>azwj</sup> coming into being, a ‘how’, nor is there a ‘where’ for Him<sup>azwj</sup>, nor is there a (defined) limit for Him<sup>azwj</sup>, nor can He<sup>azwj</sup> be recognised by something resembling Him<sup>azwj</sup>, nor does He<sup>azwj</sup> age due to the prolonged remaining, nor is He<sup>azwj</sup> bewildered to anything, but out of fear of Him<sup>azwj</sup> the things are bewildered, all of them. ", "He<sup>azwj</sup> was Living without a new (lease of) life, and occurrence of a space, nor a limitation of ‘how’, nor a ‘where’ reserved upon Him<sup>azwj</sup>, nor a place being in the vicinity of anything. But, He<sup>azwj</sup> is Living, recognised, and a King not having a decline for Him<sup>azwj</sup> of the Power and the Kingdom, for as long as when He<sup>azwj</sup> so Desires with His<sup>azwj</sup> Desire. He<sup>azwj</sup> can neither be limited, nor divided, nor perish. He<sup>azwj</sup> was the First without a ‘how’ (qualitative state), and will happen to be Last without a ‘where’. And everything is perishable except for His<sup>azwj</sup> Face. For Him<sup>azwj</sup> is the creation and the Command. Blessed is Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’. ", "Woe be unto you, O questioner! My<sup>asws</sup> Lord<sup>azwj</sup> is such that the imaginations cannot grasp Him<sup>azwj</sup>, nor can the doubts descend with Him<sup>azwj</sup>, nor confusion, nor does anything exceed Him<sup>azwj</sup>, nor does anything new descend with Him<sup>azwj</sup>, nor does He<sup>azwj</sup> Ask about anything, nor does he regret upon anything, nor does slumber seize Him<sup>azwj</sup> nor is there any sleep for Him<sup>azwj</sup>. For Him<sup>azwj</sup> is whatever is in the skies and whatever is in the earth and whatever is between the two and whatever is beneath the surface’."]}}, {"index": 238, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:3:6:4", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ رَفَعَهُ قَالَ اجْتَمَعَتِ الْيَهُودُ إِلَى رَأْسِ الْجَالُوتِ فَقَالُوا لَهُ إِنَّ هَذَا الرَّجُلَ عَالِمٌ يَعْنُونَ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَانْطَلِقْ بِنَا إِلَيْهِ نَسْأَلْهُ فَأَتَوْهُ فَقِيلَ لَهُمْ هُوَ فِي الْقَصْرِ فَانْتَظَرُوهُ حَتَّى خَرَجَ ", "فَقَالَ لَهُ رَأْسُ الْجَالُوتِ جِئْنَاكَ نَسْأَلُكَ فَقَالَ سَلْ يَا يَهُودِيُّ عَمَّا بَدَا لَكَ فَقَالَ أَسْأَلُكَ عَنْ رَبِّكَ مَتَى كَانَ فَقَالَ كَانَ بِلَا كَيْنُونِيَّةٍ كَانَ بِلَا كَيْفٍ كَانَ لَمْ يَزَلْ بِلَا كَمٍّ وَ بِلَا كَيْفٍ كَانَ لَيْسَ لَهُ قَبْلٌ هُوَ قَبْلَ الْقَبْلِ بِلَا قَبْلٍ وَ لَا غَايَةٍ وَ لَا مُنْتَهًى انْقَطَعَتْ عَنْهُ الْغَايَةُ وَ هُوَ غَايَةُ كُلِّ غَايَةٍ ", "فَقَالَ رَأْسُ الْجَالُوتِ امْضُوا بِنَا فَهُوَ أَعْلَمُ مِمَّا يُقَالُ فِيهِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, raising it, said, ", "‘The Jews gathered around their chief Al-Jalout and they said to him, ‘This man is a knowledgeable one’, meaning Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup>’, so come with us to him<sup>asws</sup>, to question him<sup>asws</sup>’. So they came over, and it was said to them, ‘He<sup>asws</sup> is in the (government) building’. So they waited for him<sup>asws</sup> until he<sup>asws</sup> came out’. ", "So chief Al-Jalout said to him<sup>asws</sup>, ‘We came to question you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘Ask, O Jew, about whatever comes to you’. So he said, ‘I ask you<sup>asws</sup> about your<sup>asws</sup> Lord<sup>azwj</sup>, when was He<sup>azwj</sup> (from)?’ So he<sup>asws</sup> said: ‘He<sup>azwj</sup> was without there being any entities. He<sup>azwj</sup> was without a ‘how’ (qualitative state). He<sup>azwj</sup> still exists without an extent (limit) and without a ‘how’. He<sup>azwj</sup> was, there being no ‘before’ for Him<sup>azwj</sup>. He<sup>azwj</sup> was before the ‘before’, without a ‘before’, nor is there an end-point or a termination. The termination is cut off from Him<sup>azwj</sup>, and He<sup>azwj</sup> is an end-point of every end-point’. ", "So chief Al-Jalout said, ‘Lets us go, for he<sup>asws</sup> is more knowledgeable than what is said for him<sup>asws</sup>’."]}}, {"index": 239, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:3:6:5", "text": ["وَ بِهَذَا الْإِسْنَادِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ الْمَوْصِلِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَ حِبْرٌ مِنَ الْأَحْبَارِ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ مَتَى كَانَ رَبُّكَ فَقَالَ لَهُ ثَكِلَتْكَ أُمُّكَ وَ مَتَى لَمْ يَكُنْ حَتَّى يُقَالَ مَتَى كَانَ كَانَ رَبِّي قَبْلَ الْقَبْلِ بِلَا قَبْلٍ وَ بَعْدَ الْبَعْدِ بِلَا بَعْدٍ وَ لَا غَايَةَ وَ لَا مُنْتَهَى لِغَايَتِهِ انْقَطَعَتِ الْغَايَاتُ عِنْدَهُ فَهُوَ مُنْتَهَى كُلِّ غَايَةٍ ", "فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَ فَنَبِيٌّ أَنْتَ فَقَالَ وَيْلَكَ إِنَّمَا أَنَا عَبْدٌ مِنْ عَبِيدِ مُحَمَّدٍ ( صلى الله عليه وآله )", "وَ رُوِيَ أَنَّهُ سُئِلَ ( عليه السلام ) أَيْنَ كَانَ رَبُّنَا قَبْلَ أَنْ يَخْلُقَ سَمَاءً وَ أَرْضاً فَقَالَ ( عليه السلام ) أَيْنَ سُؤَالٌ عَنْ مَكَانٍ وَ كَانَ اللَّهُ وَ لَا مَكَانَ ."], "translations": {"en.hubeali": ["And by this chain, from Ahmad Bin Muhammad Bin Abu Nasr, from Abu Al Hassan Al Nowsaly, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A Rabbi from the Rabbis came over to Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> and he said, ‘O Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup>! When was your<sup>asws</sup> Lord<sup>azwj</sup> (from)?’ So he<sup>asws</sup> said to him: ‘May your mother be bereft of you! And when did He<sup>azwj</sup> not happen to be until it can be said when my<sup>asws</sup> Lord<sup>azwj</sup> was (from). My<sup>asws</sup> Lord<sup>azwj</sup> was before the ‘before’ without there being a ‘before’, and (will be) after the ‘after’ without there being an ‘after’. And there is neither an end-point nor a termination to His<sup>azwj</sup> end-point cutting off the end-point in His<sup>azwj</sup> Presence. Thus, He<sup>azwj</sup> is the termination of every end-point’. ", "So he said, ‘O Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup>! So, are you<sup>asws</sup> a Prophet<sup>as</sup>?’ So he<sup>asws</sup> said: ‘Woe be unto you! But rather, I<sup>asws</sup> am a servant from the servants of Muhammad<sup>saww</sup>’. ", "And it is reported that he<sup>asws</sup> was asked, ‘Where was our Lord<sup>azwj</sup> before He<sup>azwj</sup> Created the sky and earth? (meaning the universe)’. So he<sup>asws</sup> said: ‘Where is a question about a place, and Allah<sup>azwj</sup> was, and there was no place’."]}}, {"index": 240, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:3:6:6", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَأْسُ الْجَالُوتِ لِلْيَهُودِ إِنَّ الْمُسْلِمِينَ يَزْعُمُونَ أَنَّ عَلِيّاً ( عليه السلام ) مِنْ أَجْدَلِ النَّاسِ وَ أَعْلَمِهِمْ اذْهَبُوا بِنَا إِلَيْهِ لَعَلِّي أَسْأَلُهُ عَنْ مَسْأَلَةٍ وَ أُخَطِّئُهُ فِيهَا ", "فَأَتَاهُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي أُرِيدُ أَنْ أَسْأَلَكَ عَنْ مَسْأَلَةٍ قَالَ سَلْ عَمَّا شِئْتَ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ مَتَى كَانَ رَبُّنَا قَالَ لَهُ يَا يَهُودِيُّ إِنَّمَا يُقَالُ مَتَى كَانَ لِمَنْ لَمْ يَكُنْ فَكَانَ مَتَى كَانَ هُوَ كَائِنٌ بِلَا كَيْنُونِيَّةٍ كَائِنٍ كَانَ بِلَا كَيْفٍ يَكُونُ ", "بَلَى يَا يَهُودِيُّ ثُمَّ بَلَى يَا يَهُودِيُّ كَيْفَ يَكُونُ لَهُ قَبْلٌ هُوَ قَبْلَ الْقَبْلِ بِلَا غَايَةٍ وَ لَا مُنْتَهَى غَايَةٍ وَ لَا غَايَةَ إِلَيْهَا انْقَطَعَتِ الْغَايَاتُ عِنْدَهُ هُوَ غَايَةُ كُلِّ غَايَةٍ ", "فَقَالَ أَشْهَدُ أَنَّ دِينَكَ الْحَقُّ وَ أَنَّ مَا خَالَفَهُ بَاطِلٌ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Sahl Bin Ziyad, from Amro Bin Usman, from Muhammad Bin Yahya, from Muhammad Bin Sama’at, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Chief Al-Jalout said to the Jews that the Muslims are alleging that Ali<sup>asws</sup> is from the best of the people in the art of argumentation and their most knowledgeable. Let us go to him<sup>asws</sup>. I shall ask him<sup>asws</sup> a question and make him<sup>asws</sup> err in it’. ", "So he came over to him<sup>asws</sup> and he said, ‘O Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup>! I wanted to ask you<sup>asws</sup> a question’. He<sup>asws</sup> said: ‘Ask about whatever you so desire to’. He said, ‘O Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup>! When was our Lord<sup>azwj</sup> (from)?’ He<sup>asws</sup> said to him: ‘O Jew! But rather, it is said, ‘When was he’, for the one who did not happen to be. So He<sup>azwj</sup> was when He<sup>azwj</sup> was. He<sup>azwj</sup> was existing without there being any entity. He<sup>azwj</sup> exists without a ‘how’ (Qualitative State) happening to be.  ", "Yes, O Jew! Then (again), yes O Jew! How can there be a ‘before’ for Him<sup>azwj</sup>? He<sup>azwj</sup> was before the ‘before’, without there being an end-point and no termination of an end-point, nor is there an end-point having a termination to it. The end-point is in His<sup>azwj</sup> Presence. He<sup>azwj</sup> is the end-point of all end-points’. ", "So he said, ‘I testify that your<sup>asws</sup> Religion is the Truth and that whatever is different to it, is false’."]}}, {"index": 241, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:3:6:7", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَ كَانَ اللَّهُ وَ لَا شَيْ‏ءَ قَالَ نَعَمْ كَانَ وَ لَا شَيْ‏ءَ قُلْتُ فَأَيْنَ كَانَ يَكُونُ قَالَ وَ كَانَ مُتَّكِئاً فَاسْتَوَى جَالِساً وَ قَالَ أَحَلْتَ يَا زُرَارَةُ وَ سَأَلْتَ عَنِ الْمَكَانِ إِذْ لَا مَكَانَ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, raising it from Zurara who said, ", "‘I said to Abu Ja’far<sup>asws</sup>, ‘Was Allah<sup>azwj</sup> (existing) and there was nothing?’ He<sup>asws</sup> said: ‘Yes, He<sup>azwj</sup> was and there was nothing’. I said, ‘So where did He<sup>azwj</sup> happen to be?’ He<sup>asws</sup> was leaning, so he<sup>asws</sup> sat upright and said: ‘You (speak of the) Impossibility, O Zurara, and you ask about the place when there was no place’."]}}, {"index": 242, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:3:6:8", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ الْمَوْصِلِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَتَى حِبْرٌ مِنَ الْأَحْبَارِ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ مَتَى كَانَ رَبُّكَ قَالَ وَيْلَكَ إِنَّمَا يُقَالُ مَتَى كَانَ لِمَا لَمْ يَكُنْ فَأَمَّا مَا كَانَ فَلَا يُقَالُ مَتَى كَانَ كَانَ قَبْلَ الْقَبْلِ بِلَا قَبْلٍ وَ بَعْدَ الْبَعْدِ بِلَا بَعْدٍ وَ لَا مُنْتَهَى غَايَةٍ لِتَنْتَهِيَ غَايَتُهُ ", "فَقَالَ لَهُ أَ نَبِيٌّ أَنْتَ فَقَالَ لِأُمِّكَ الْهَبَلُ إِنَّمَا أَنَا عَبْدٌ مِنْ عَبِيدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Al Waleed, from Ibn Abu Nasr, from Abu Al Hassan Al Mowsaly, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A Rabbi from the Rabbis came over to Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> and he said, ‘O Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup>! When was your<sup>asws</sup> Lord<sup>azwj</sup> (from)?’ He<sup>asws</sup> said: ‘Woe be unto you! But rather, it is said, ‘When was it’, for what did not happen to be. So, as for what always was, so you cannot say when it was (from). He<sup>azwj</sup> was before the ‘before’ without there being a ‘before’, and (will be) after the ‘after’ without there being an ‘after’, and there is no termination to an end-point to end His<sup>azwj</sup> end-point’. ", "So he said to him<sup>asws</sup>, ‘Are you<sup>asws</sup> a Prophet<sup>as</sup>?’ So he<sup>asws</sup> said: ‘For your mother be the bereavement! But rather, I<sup>asws</sup> am a servant from the servants of Rasool-Allah<sup>saww</sup>’."]}}]}, "index": "al-kafi:1:3:6", "kind": "verse_list"}