{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:1:3", "titles": {"ar": "كِتَابُ التَّوْحِيدِ", "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"}}, {"indexed_titles": {"en": "Chapter 7"}, "path": "/books/al-kafi:1:3:7", "titles": {"ar": "بَابُ النِّسْبَةِ", "en": "Chapter 7 – The Lineage"}}], "index": 30, "local_index": 7, "part_type": "Chapter", "path": "/books/al-kafi:1:3:7", "titles": {"ar": "بَابُ النِّسْبَةِ", "en": "Chapter 7 – The Lineage"}, "verse_count": 4, "verse_start_index": 242, "verses": [{"index": 243, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:3:7:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ إِدْرِيسَ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْيَهُودَ سَأَلُوا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالُوا انْسِبْ لَنَا رَبَّكَ فَلَبِثَ ثَلَاثاً لَا يُجِيبُهُمْ ثُمَّ نَزَلَتْ قُلْ هُوَ اللَّهُ أَحَدٌ إِلَى آخِرِهَا .\nوَ رَوَاهُ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin yahya, from Abu Ayoub, from Muhammad Bin Muslim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Jews asked Rasool-Allah<sup>saww</sup> and they said, ‘(Describe the) Lineage (of) your<sup>saww</sup> Lord<sup>azwj</sup> for us’. So he<sup>saww</sup> waited for three (days) and did not answer them. Then it was Revealed <span class=\"ibTxt\">[112:1] Say: He Allah is One</span> – up to the end of it’. \nAnd it is (also) reported by Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abu Ayoub."}]}, {"index": 244, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:3:7:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ مَحْبُوبٍ عَنْ حَمَّادِ بْنِ عَمْرٍو النَّصِيبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ عَنْ قُلْ هُوَ اللَّهُ أَحَدٌ فَقَالَ نِسْبَةُ اللَّهِ إِلَى خَلْقِهِ أَحَداً صَمَداً أَزَلِيّاً صَمَدِيّاً لَا ظِلَّ لَهُ يُمْسِكُهُ وَ هُوَ يُمْسِكُ الْأَشْيَاءَ بِأَظِلَّتِهَا عَارِفٌ بِالْمَجْهُولِ مَعْرُوفٌ عِنْدَ كُلِّ جَاهِلٍ فَرْدَانِيّاً لَا خَلْقُهُ فِيهِ وَ لَا هُوَ فِي خَلْقِهِ غَيْرُ مَحْسُوسٍ وَ لَا مَجْسُوسٍ لَا تُدْرِكُهُ الْأَبْصَارُ \nعَلَا فَقَرُبَ وَ دَنَا فَبَعُدَ وَ عُصِيَ فَغَفَرَ وَ أُطِيعَ فَشَكَرَ لَا تَحْوِيهِ أَرْضُهُ وَ لَا تُقِلُّهُ سَمَاوَاتُهُ حَامِلُ الْأَشْيَاءِ بِقُدْرَتِهِ دَيْمُومِيٌّ أَزَلِيٌّ لَا يَنْسَى وَ لَا يَلْهُو وَ لَا يَغْلَطُ وَ لَا يَلْعَبُ وَ لَا لِإِرَادَتِهِ فَصْلٌ وَ فَصْلُهُ جَزَاءٌ وَ أَمْرُهُ وَاقِعٌ لَمْ يَلِدْ فَيُورَثَ وَ لَمْ يُولَدْ فَيُشَارَكَ وَ لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa and Muhammad Bin Al Husayn, from Ibn Mahboub, from Hammad Bin Amro Al Naseybi, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked Abu Abdullah<sup>asws</sup> about <span class=\"ibTxt\">[112:1] Say: He Allah is One</span>. So he<sup>asws</sup> said: ‘Lineage of Allah<sup>azwj</sup> to His<sup>azwj</sup> creatures. One, Everlasting, Eternal, Perpetual, there being no support to Hold Him<sup>azwj</sup>, and He<sup>azwj</sup> Withholds the things by His<sup>azwj</sup> Hold. He<sup>azwj</sup> Recognises the unknown and is well-known with every ignorant one. An Individuality. Neither are His<sup>azwj</sup> creatures inside Him<sup>azwj</sup> nor is He<sup>azwj</sup> inside His<sup>azwj</sup> creatures. He<sup>azwj</sup> can neither be felt nor discerned. The visions cannot envisage Him<sup>azwj</sup>.\nHe<sup>azwj</sup> is High, so is nearby, and close-by, so is remote, and is disboyed, so Forgives, and is obeyed, so is Grateful. Neither does His<sup>azwj</sup> earth contain Him<sup>azwj</sup> nor do His<sup>azwj</sup> skies bear Him<sup>azwj</sup>. He<sup>azwj</sup> Carries the things by His<sup>azwj</sup> Power forever, eternally. He<sup>azwj</sup> neither forgets, nor plays, nor mistakes, nor is His<sup>azwj</sup> Intention in vain. His<sup>azwj</sup> Grace is Recompense, and His<sup>azwj</sup> Command Occurs. He<sup>azwj</sup> does not beget, so would leave an inheritance, and is not begotten, so He<sup>azwj</sup> would be participated with, and there does not happen to be for Him<sup>azwj</sup> anyone as a match’."}]}, {"index": 245, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:3:7:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ قَالَ قَالَ سُئِلَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) عَنِ التَّوْحِيدِ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ عَلِمَ أَنَّهُ يَكُونُ فِي آخِرِ الزَّمَانِ أَقْوَامٌ مُتَعَمِّقُونَ فَأَنْزَلَ اللَّهُ تَعَالَى قُلْ هُوَ اللَّهُ أَحَدٌ وَ الْآيَاتِ مِنْ سُورَةِ الْحَدِيدِ إِلَى قَوْلِهِ وَ هُوَ عَلِيمٌ بِذاتِ الصُّدُورِ فَمَنْ رَامَ وَرَاءَ ذَلِكَ فَقَدْ هَلَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Aasim Bin Humeyd who said, \n‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was asked about the <span class=\"iTxt\">Tawheed</span> (Oneness), so he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Knows that there would happen to be a people at the end of times who would be investigating in depth. So Allah<sup>azwj</sup> the Exalted Revealed <span class=\"ibTxt\">[112:1] Say: He Allah is One</span>, and the Verses from Surah Al-Hadeed (Chapter 57) up to His<sup>azwj</sup> Words <span class=\"ibTxt\">[57:6], and He is Aware of what is in the chests</span>. So whoever aims behind (any more than) that, so he is destroyed’."}]}, {"index": 246, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:3:7:4", "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ رَفَعَهُ عَنْ عَبْدِ الْعَزِيزِ بْنِ الْمُهْتَدِي قَالَ سَأَلْتُ الرِّضَا ( عليه السلام ) عَنِ التَّوْحِيدِ فَقَالَ كُلُّ مَنْ قَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ وَ آمَنَ بِهَا فَقَدْ عَرَفَ التَّوْحِيدَ قُلْتُ كَيْفَ يَقْرَأُهَا قَالَ كَمَا يَقْرَأُهَا النَّاسُ وَ زَادَ فِيهِ كَذَلِكَ اللَّهُ رَبِّي كَذَلِكَ اللَّهُ رَبِّي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Abu Abdullah, raising it from Abdul Aziz Bin Al Muhtady who said, \n‘I asked Al-Reza<sup>asws</sup> about the <span class=\"iTxt\">Tawheed</span> (Oneness). So he<sup>asws</sup> said: ‘The one who recites <span class=\"ibTxt\">[112:1] Say: He Allah is One</span> and believes in it, so he has recognised the <span class=\"iTxt\">Tawheed</span> (Oneness)’. I said, ‘How should one recite it?’ He<sup>asws</sup> said: ‘Just as the people are reciting it, and increase in it, ‘Like that is Allah<sup>azwj</sup> my Lord<sup>azwj</sup>, like that is Allah<sup>azwj</sup> my Lord<sup>azwj</sup>’’."}]}]}, "index": "al-kafi:1:3:7", "kind": "verse_list"}