{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:1:3", "titles": {"ar": "كِتَابُ التَّوْحِيدِ", "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"}}, {"indexed_titles": {"en": "Chapter 8"}, "path": "/books/al-kafi:1:3:8", "titles": {"ar": "بَابُ النَّهْيِ عَنِ الْكَلَامِ فِي الْكَيْفِيَّةِ", "en": "Chapter 8 – The Forbiddance about speaking regarding the Qualitative State (how)"}}], "index": 31, "local_index": 8, "part_type": "Chapter", "path": "/books/al-kafi:1:3:8", "titles": {"ar": "بَابُ النَّهْيِ عَنِ الْكَلَامِ فِي الْكَيْفِيَّةِ", "en": "Chapter 8 – The Forbiddance about speaking regarding the Qualitative State (how)"}, "verse_count": 10, "verse_start_index": 246, "verses": [{"index": 247, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:3:8:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ الْحَسَنِ</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) تَكَلَّمُوا فِي خَلْقِ اللَّهِ وَ لَا تَتَكَلَّمُوا فِي اللَّهِ فَإِنَّ الْكَلَامَ فِي اللَّهِ لَا يَزْدَادُ صَاحِبَهُ إِلَّا تَحَيُّراً .\nوَ فِي رِوَايَةٍ أُخْرَى عَنْ حَرِيزٍ تَكَلَّمُوا فِي كُلِّ شَيْ‏ءٍ وَ لَا تَتَكَلَّمُوا فِي ذَاتِ اللَّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Abu Baseer who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘You can speak regarding the creation of Allah<sup>azwj</sup>, but do not speak regarding Allah<sup>azwj</sup>, for the speech regarding Allah<sup>azwj</sup> does not increase its owner except with the confusion’. \nAnd in another report, from Hareyz, ‘(He<sup>asws</sup> said): ‘You can speak regarding everythings, but do not be speaking regarding ‘ذَاتِ اللَّهِ’ the Essence (Self) of Allah<sup>azwj</sup>’."}]}, {"index": 248, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:3:8:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ أَنَّ إِلى رَبِّكَ الْمُنْتَهى فَإِذَا انْتَهَى الْكَلَامُ إِلَى اللَّهِ فَأَمْسِكُوا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjal, from Suleyman Bin Khalid who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[53:42] And that to your Lord is the ending</span>. so when the speech (discussion) ends up to Allah<sup>azwj</sup> (His<sup>azwj</sup> Essence), so hold (stop there and refrain from further comments)’."}]}, {"index": 249, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:3:8:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا مُحَمَّدُ إِنَّ النَّاسَ لَا يَزَالُ بِهِمُ الْمَنْطِقُ حَتَّى يَتَكَلَّمُوا فِي اللَّهِ فَإِذَا سَمِعْتُمْ ذَلِكَ فَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ الْوَاحِدُ الَّذِي لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ.", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub, form Muhammad Bin Muslim who said, \n‘Abu Abdullah<sup>asws</sup> said, ‘O Muhammad! Do not cease speaking with the people until they (start) speaking regarding Allah<sup>azwj</sup>. So when you hear that, so be saying, ‘There is no god except Allah<sup>azwj</sup>, the One Who, there is nothing like Him<sup>azwj</sup>’’."}]}, {"index": 250, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:3:8:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ حُمْرَانَ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَا زِيَادُ إِيَّاكَ وَ الْخُصُومَاتِ فَإِنَّهَا تُورِثُ الشَّكَّ وَ تَهْبِطُ الْعَمَلَ وَ تُرْدِي صَاحِبَهَا وَ عَسَى أَنْ يَتَكَلَّمَ بِالشَّيْ‏ءِ فَلَا يُغْفَرَ لَهُ \nإِنَّهُ كَانَ فِيمَا مَضَى قَوْمٌ تَرَكُوا عِلْمَ مَا وُكِّلُوا بِهِ وَ طَلَبُوا عِلْمَ مَا كُفُوهُ حَتَّى انْتَهَى كَلَامُهُمْ إِلَى اللَّهِ فَتَحَيَّرُوا حَتَّى إِنْ كَانَ الرَّجُلُ لَيُدْعَى مِنْ بَيْنِ يَدَيْهِ فَيُجِيبُ مِنْ خَلْفِهِ وَ يُدْعَى مِنْ خَلْفِهِ فَيُجِيبُ مِنْ بَيْنِ يَدَيْهِ \nوَ فِي رِوَايَةٍ أُخْرَى حَتَّى تَاهُوا فِي الْأَرْضِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Ibn Abu Umeyr, from Muhammad Bin Humran, from Abu Ubeyda Al Haza’a who said, \n‘Abu Ja’far<sup>asws</sup> said: ‘O Ziyad! Beware of the disputes, for these inherit the doubt and the confiscation of the deeds and would deteriorate its performer, as he may speak with something, so it would not be Forgiven for him. \nIt was so that in the past there were a people who neglected the knowledge what they had been allocated with and they sought a knowledge which did not restrain them to the extent that their speech ended up to Allah<sup>azwj</sup>. So they got confused to the extent that the man would be called from in front of him, so he would answer from behind him, and he would be called from behind him, so he would answer from in front of him’. \nAnd in another report, ‘To the extent that they wandered in the earth’."}]}, {"index": 251, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:3:8:5", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْحُسَيْنِ بْنِ الْمَيَّاحِ عَنْ أَبِيهِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَنْ نَظَرَ فِي اللَّهِ كَيْفَ هُوَ هَلَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of his companions, from Al Husayn Bin Al Mayyah, from his father who said, \n‘I hear Abu Abdullah<sup>asws</sup> saying: ‘The one who inquires about Allah<sup>azwj</sup>, how He<sup>azwj</sup> is (His<sup>azwj</sup> Qualitative State), would be destroyed’."}]}, {"index": 252, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:3:8:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ مَلِكاً عَظِيمَ الشَّأْنِ كَانَ فِي مَجْلِسٍ لَهُ فَتَنَاوَلَ الرَّبَّ تَبَارَكَ وَ تَعَالَى فَفُقِدَ فَمَا يُدْرَى أَيْنَ هُوَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzal, from Ibn Bukeyr, from Zurara Bin Ayn, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A king of great splendour was in a gathering of his and he discussed the Lord<sup>azwj</sup> Blessed and High. So it is not (even) known where he is’."}]}, {"index": 253, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:3:8:7", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِيَّاكُمْ وَ التَّفَكُّرَ فِي اللَّهِ وَ لَكِنْ إِذَا أَرَدْتُمْ أَنْ تَنْظُرُوا إِلَى عَظَمَتِهِ فَانْظُرُوا إِلَى عَظِيمِ خَلْقِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Abdul Hameed, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Beware of the pondering regarding Allah<sup>azwj</sup>. But whenever you intend to look into His<sup>azwj</sup> Magnificence, so look into the Magnificence of His<sup>azwj</sup> creation’."}]}, {"index": 254, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:3:8:8", "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا ابْنَ آدَمَ لَوْ أَكَلَ قَلْبَكَ طَائِرٌ لَمْ يُشْبِعْهُ وَ بَصَرُكَ لَوْ وُضِعَ عَلَيْهِ خَرْقُ إِبْرَةٍ لَغَطَّاهُ تُرِيدُ أَنْ تَعْرِفَ بِهِمَا مَلَكُوتَ السَّمَاوَاتِ وَ الْأَرْضِ إِنْ كُنْتَ صَادِقاً فَهَذِهِ الشَّمْسُ خَلْقٌ مِنْ خَلْقِ اللَّهِ فَإِنْ قَدَرْتَ أَنْ تَمْلَأَ عَيْنَيْكَ مِنْهَا فَهُوَ كَمَا تَقُولُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Abu Abdullah, raising it, said, \n‘Abu Abdullah<sup>asws</sup> said: ‘O son of Adam<sup>as</sup>! If a bird was to eat your heart, it would not satiate it, and if a needle was to poke your eye, it would cover (blind) it. You are intending with these two, to recognise the kingdoms of the skies and the earth? If you are truthful, so this here is the sun, a creation from the creations of Allah<sup>azwj</sup>. So, if you are able to fill your eyes from it, then it is as you are saying it to be’."}]}, {"index": 255, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:1:3:8:9", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنِ الْيَعْقُوبِيِّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ يَهُودِيّاً يُقَالُ لَهُ سِبَخْتُ جَاءَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ جِئْتُ أَسْأَلُكَ عَنْ رَبِّكَ فَإِنْ أَنْتَ أَجَبْتَنِي عَمَّا أَسْأَلُكَ عَنْهُ وَ إِلَّا رَجَعْتُ قَالَ سَلْ عَمَّا شِئْتَ \nقَالَ أَيْنَ رَبُّكَ قَالَ هُوَ فِي كُلِّ مَكَانٍ وَ لَيْسَ فِي شَيْ‏ءٍ مِنَ الْمَكَانِ الْمَحْدُودِ قَالَ وَ كَيْفَ هُوَ قَالَ وَ كَيْفَ أَصِفُ رَبِّي بِالْكَيْفِ وَ الْكَيْفُ مَخْلُوقٌ وَ اللَّهُ لَا يُوصَفُ بِخَلْقِهِ \nقَالَ فَمِنْ أَيْنَ يُعْلَمُ أَنَّكَ نَبِيُّ اللَّهِ قَالَ فَمَا بَقِيَ حَوْلَهُ حَجَرٌ وَ لَا غَيْرُ ذَلِكَ إِلَّا تَكَلَّمَ بِلِسَانٍ عَرَبِيٍّ مُبِينٍ يَا سِبَخْتُ إِنَّهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) \nفَقَالَ سِبَخْتُ مَا رَأَيْتُ كَالْيَوْمِ أَمْراً أَبْيَنَ مِنْ هَذَا ثُمَّ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّكَ رَسُولُ اللَّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Hassan Bin Ali, from Al Yaqouby, from one of our companions, from Abdul A’ala, a slave of the family of Saam, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A Jew call Sibakht came over to Rasool-Allah<sup>saww</sup> and he said, ‘O Rasool-Allah<sup>saww</sup>! I came over to ask you<sup>saww</sup> about your<sup>saww</sup> Lord<sup>azwj</sup>. So if you<sup>saww</sup> were to answer me about what I am asking about (fine), or else I will return’. He<sup>saww</sup> said: ‘Ask about whatever you so desire to’.\nHe said, ‘Where is your<sup>saww</sup> Lord<sup>azwj</sup>?’ He<sup>azwj</sup> is in every place, and He<sup>azwj</sup> is not enclosed into a thing from the limited place’. He said, ‘And how is He<sup>azwj</sup>?’ He<sup>saww</sup> said: ‘And how can I<sup>saww</sup> describe my<sup>saww</sup> Lord<sup>azwj</sup> with the ‘how’, and the ‘how’ is a creation, and Allah<sup>azwj</sup> cannot be described by His<sup>azwj</sup> creation’. \nHe said, ‘So from where did you<sup>saww</sup> come to know that you<sup>saww</sup> are a Prophet<sup>saww</sup> of Allah<sup>azwj</sup>?’ He (the narrator) said, ‘So there did not remain around him<sup>saww</sup> a tree, nor anything other than that, except that it spoke in clear Arabic language, ‘O Sibakht! He<sup>saww</sup> is Rasool-Allah<sup>saww</sup>!’\nSo Sibakht said, ‘I have not seen like today, a matter more clear than this’. Then he said, ‘I testify that there is no god except Allah<sup>azwj</sup> and you<sup>saww</sup> are a Rasool<sup>saww</sup> of Allah<sup>azwj</sup>’."}]}, {"index": 256, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:1:3:8:10", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَثْعَمِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَتِيكٍ الْقَصِيرِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ شَيْ‏ءٍ مِنَ الصِّفَةِ فَرَفَعَ يَدَهُ إِلَى السَّمَاءِ ثُمَّ قَالَ تَعَالَى الْجَبَّارُ تَعَالَى الْجَبَّارُ مَنْ تَعَاطَى مَا ثَمَّ هَلَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Yahya Al Khas’amy, from Abdul Rahman Bin Ateyk Al Qaseyr who said, \n‘I asked Abu Ja’far<sup>asws</sup> about something from the characteristics (of Allah<sup>azwj</sup>. So he<sup>asws</sup> raised his<sup>asws</sup> hand towards the sky, then said: ‘Exalted is the Compeller! Exalted is the Compeller! The one who practices (something) else, is destroyed’."}]}]}, "index": "al-kafi:1:3:8", "kind": "verse_list"}