{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:1:3:9",
        "titles": {
          "ar": "باب فِي إِبْطَالِ الرُّؤْيَةِ",
          "en": "Chapter 9 – Regarding the invalidation of sighting"
        }
      }
    ],
    "index": 32,
    "local_index": 9,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:1:3:10",
        "titles": {
          "ar": "بَابُ النَّهْيِ عَنِ الصِّفَةِ بِغَيْرِ مَا وَصَفَ بِهِ نَفْسَهُ تَعَالَى",
          "en": "Chapter 10 – The Forbiddance from describing with other than what He<sup>azwj</sup> has Described Himself<sup>azwj</sup> with"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 8"
        },
        "path": "/books/al-kafi:1:3:8",
        "titles": {
          "ar": "بَابُ النَّهْيِ عَنِ الْكَلَامِ فِي الْكَيْفِيَّةِ",
          "en": "Chapter 8 – The Forbiddance about speaking regarding the Qualitative State (how)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:1:3",
        "titles": {
          "ar": "كِتَابُ التَّوْحِيدِ",
          "en": "The Book of Tawheed (Oneness of Allah<sup>azwj</sup>)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:3:9",
    "titles": {
      "ar": "باب فِي إِبْطَالِ الرُّؤْيَةِ",
      "en": "Chapter 9 – Regarding the invalidation of sighting"
    },
    "verse_count": 12,
    "verse_start_index": 256,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول أو صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (327/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 257,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/358",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/395",
              "text": "عَلِيِّ بْنِ أَبِي الْقَاسِمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/396",
              "text": "يَعْقُوبَ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ أَبِي الْقَاسِمِ عَنْ يَعْقُوبَ بْنِ إِسْحَاقَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:1",
        "text": [
          " كَتَبْتُ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) أَسْأَلُهُ كَيْفَ يَعْبُدُ الْعَبْدُ رَبَّهُ وَ هُوَ لَا يَرَاهُ فَوَقَّعَ ( عليه السلام ) يَا أَبَا يُوسُفَ جَلَّ سَيِّدِي وَ مَوْلَايَ وَ الْمُنْعِمُ عَلَيَّ وَ عَلَى آبَائِي أَنْ يُرَى ",
          "قَالَ وَ سَأَلْتُهُ هَلْ رَأَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) رَبَّهُ فَوَقَّعَ ( عليه السلام ) إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَرَى رَسُولَهُ بِقَلْبِهِ مِنْ نُورِ عَظَمَتِهِ مَا أَحَبَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Ali Bin Abu Al Qasim, from Yaqoub Bin Is’haq who said, ",
            "‘I wrote to Abu Muhammad<sup>asws</sup> asking him<sup>asws</sup>, ‘How can a servant worship his Lord<sup>azwj</sup> and he does not see Him<sup>azwj</sup>?’ So he<sup>asws</sup> signed: ‘O Au Yusuf! My<sup>asws</sup> Chief, and my<sup>asws</sup> Master, and the Bestower upon me<sup>asws</sup> and upon my<sup>asws</sup> forefathers<sup>asws</sup> is more Majestic than for He<sup>azwj</sup> to be seen’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup>, ‘Did Rasool-Allah<sup>saww</sup> see his<sup>saww</sup> Lord<sup>azwj</sup>?’ So he<sup>asws</sup> signed: ‘Allah<sup>azwj</sup> the Blessed and High Showed into the heart of His<sup>azwj</sup> Rasool<sup>saww</sup>, from a Light of His<sup>azwj</sup> Magnificence what He<sup>azwj</sup> Loved to’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn abu ‘Abdallah has narrated from Ali ibn abu al-Qasim from Ya’qub ibn Ishaq who wrote to Imam abu Muhammad al-‘Askari and asked. “How can a worshipper worship his Lord, Whom he does not see?” The Imam wrote in reply, “O abu Yusuf, my Lord, my Master, and my Benefactor and the Benefactor of my ancestors, is far exalted and is above being seen.” I (Ya’qub ibn Ishaq) asked him, “Had the Messenger of Allah (s.a.) seen his Lord?” The Imam replied in writing and signed, “Allah, the Most Holy, the Most High, showed His Prophet, in his heart, the light of His Greatness as much as He liked.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/328)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 258,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:2",
        "relations": {
          "Mentions": [
            "/books/quran:20:110",
            "/books/quran:53:13",
            "/books/quran:6:103",
            "/books/quran:53:18",
            "/books/quran:53:11",
            "/books/quran:42:11"
          ]
        },
        "text": [
          " سَأَلَنِي أَبُو قُرَّةَ الْمُحَدِّثُ أَنْ أُدْخِلَهُ عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فَاسْتَأْذَنْتُهُ فِي ذَلِكَ فَأَذِنَ لِي فَدَخَلَ عَلَيْهِ فَسَأَلَهُ عَنِ الْحَلَالَ وَ الْحَرَامِ وَ الْأَحْكَامِ حَتَّى بَلَغَ سُؤَالُهُ إِلَى التَّوْحِيدِ فَقَالَ أَبُو قُرَّةَ إِنَّا رُوِّينَا أَنَّ اللَّهَ قَسَمَ الرُّؤْيَةَ وَ الْكَلَامَ بَيْنَ نَبِيَّيْنِ فَقَسَمَ الْكَلَامَ لِمُوسَى وَ لِمُحَمَّدٍ الرُّؤْيَةَ",
          "فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) فَمَنِ الْمُبَلِّغُ عَنِ اللَّهِ إِلَى الثَّقَلَيْنِ مِنَ الْجِنِّ وَ الْإِنْسِ لَا تُدْرِكُهُ الْأَبْصَارُ وَ لَا يُحِيطُونَ بِهِ عِلْماً وَ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ أَ لَيْسَ مُحَمَّدٌ قَالَ بَلَى",
          "قَالَ كَيْفَ يَجِي‏ءُ رَجُلٌ إِلَى الْخَلْقِ جَمِيعاً فَيُخْبِرُهُمْ أَنَّهُ جَاءَ مِنْ عِنْدِ اللَّهِ وَ أَنَّهُ يَدْعُوهُمْ إِلَى اللَّهِ بِأَمْرِ اللَّهِ فَيَقُولُ لَا تُدْرِكُهُ الْأَبْصَارُ وَ لَا يُحِيطُونَ بِهِ عِلْماً وَ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ثُمَّ يَقُولُ أَنَا رَأَيْتُهُ بِعَيْنِي وَ أَحَطْتُ بِهِ عِلْماً وَ هُوَ عَلَى صُورَةِ الْبَشَرِ أَ مَا تَسْتَحُونَ مَا قَدَرَتِ الزَّنَادِقَةُ أَنْ تَرْمِيَهُ بِهَذَا أَنْ يَكُونَ يَأْتِي مِنْ عِنْدِ اللَّهِ بِشَيْ‏ءٍ ثُمَّ يَأْتِي بِخِلَافِهِ مِنْ وَجْهٍ آخَرَ ",
          "قَالَ أَبُو قُرَّةَ فَإِنَّهُ يَقُولُ وَ لَقَدْ رَآهُ نَزْلَةً أُخْرى فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) إِنَّ بَعْدَ هَذِهِ الْآيَةِ مَا يَدُلُّ عَلَى مَا رَأَى حَيْثُ قَالَ ما كَذَبَ الْفُؤادُ ما رَأى يَقُولُ مَا كَذَبَ فُؤَادُ مُحَمَّدٍ مَا رَأَتْ عَيْنَاهُ ثُمَّ أَخْبَرَ بِمَا رَأَى",
          "فَقَالَ لَقَدْ رَأى مِنْ آياتِ رَبِّهِ الْكُبْرى فَآيَاتُ اللَّهِ غَيْرُ اللَّهِ وَ قَدْ قَالَ اللَّهُ وَ لا يُحِيطُونَ بِهِ عِلْماً فَإِذَا رَأَتْهُ الْأَبْصَارُ فَقَدْ أَحَاطَتْ بِهِ الْعِلْمُ وَ وَقَعَتِ الْمَعْرِفَةُ",
          "فَقَالَ أَبُو قُرَّةَ فَتُكَذِّبُ بِالرِّوَايَاتِ فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) إِذَا كَانَتِ الرِّوَايَاتُ مُخَالِفَةً لِلْقُرْآنِ كَذَّبْتُهَا وَ مَا أَجْمَعَ الْمُسْلِمُونَ عَلَيْهِ أَنَّهُ لَا يُحَاطُ بِهِ عِلْماً وَ لَا تُدْرِكُهُ الْأَبْصَارُ وَ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya who said, ",
            "‘Abu Qurra the narrator asked me if I could take him over to Abu Al-Hassan Al-Reza<sup>asws</sup>. So I sought permission for him regarding that and he permitted to me. So I took him over to him<sup>asws</sup>. So he asked him<sup>asws</sup> about the Permissible and the prohibitions and the regulations, until his questions reached to the <span class=\"iTxt\">Tawheed</span> (Oneness). So Abu Qurra said, ‘We are reporting that Allah<sup>azwj</sup> Distributed the Sighting and the Speech between two Prophets<sup>as</sup>. So He<sup>azwj</sup> Distributed the Speech to Musa<sup>as</sup> and for Muhammad<sup>saww</sup>, the Sighting’. ",
            "So Abu Al-Hassan<sup>asws</sup> said: ‘So who delivered from Allah<sup>azwj</sup> to the two communities of the Jinn and the human beings <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h103\">[6:103]</a> Visions cannot comprehend Him</span>, (and)<span class=\"ibTxt\"> <a href=\"/#/books/quran:20#h110\">[20:110]</a> and they do not comprehend Him in knowledge</span>, (and) <span class=\"ibTxt\">[42:11 nothing is a likeness of Him</span>? Was it not Muhammad<sup>saww</sup>?’ He said, ‘Yes’. ",
            "He<sup>asws</sup> said: ‘How can a man<sup>saww</sup> come over to the people and he<sup>saww</sup> informs them that he<sup>saww</sup> has come from Allah<sup>azwj</sup> and that he<sup>saww</sup> is inviting them to Allah<sup>azwj</sup> by the Command of Allah<sup>azwj</sup>, so he<sup>saww</sup> is saying <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h103\">[6:103]</a> Visions cannot comprehend Him</span>, (and)<span class=\"ibTxt\"> <a href=\"/#/books/quran:20#h110\">[20:110]</a> and they do not comprehend Him in knowledge</span>, (and) <span class=\"ibTxt\">[42:11 nothing is a likeness of Him</span>, then he<sup>saww</sup> would be saying that: ‘’I<sup>saww</sup> saw Him<sup>azwj</sup> with my<sup>saww</sup> own eyes and I<sup>saww</sup> comprehended Him<sup>azwj</sup> in knowledge and He<sup>azwj</sup> is upon an image of the person’? Are you not ashamed of what would enable the atheists to pelt with this that he<sup>saww</sup> happened to come from the Presence of Allah<sup>azwj</sup> with something, then he<sup>saww</sup> came with the opposite of it from another aspect?’ ",
            "Abu Qurrat said, ‘But He<sup>azwj</sup> is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:53#h13\">[53:13]</a> And certainly he saw it </span>(meaning Him<sup>azwj</sup>)<span class=\"ibTxt\"> in another descent</span>.’ So Abu Al-Hassan<sup>asws</sup> said: ‘It is after the Verse indicating upon what he<sup>saww</sup> saw where He<sup>azwj</sup> Says <span class=\"ibTxt\"><a href=\"/#/books/quran:53#h11\">[53:11]</a> The heart did not belie what it saw</span>. He<sup>azwj</sup> is Saying that the heart of Muhammad<sup>saww</sup> did not belie what his<sup>saww</sup> eyes saw. Then He<sup>azwj</sup> Informed with what he<sup>saww</sup> saw.",
            "So He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:53#h18\">[53:18]</a> He saw of the greatest Signs of his Lord</span>. So the Signs of Allah<sup>azwj</sup> is other than Allah<sup>azwj</sup>, and He<sup>azwj</sup> had Said <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h110\">[20:110]</a> and they do not comprehend Him in knowledge</span>. So if the visions were to see Him<sup>azwj</sup>, so they would have comprehended Him<sup>azwj</sup> in knowledge, and the recognition would occur’. ",
            "So Abu Qurra said, ‘So you<sup>asws</sup> are belying the reports’. So Abu Al-Hassan<sup>asws</sup> said: ‘When the reports were in opposition to the Quran, I<sup>saww</sup> would belie these, and what the Muslims have formed a consensus upon is that <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h110\">[20:110]</a> and they do not comprehend Him in knowledge <a href=\"/#/books/quran:6#h103\">[6:103]</a> Visions cannot comprehend Him</span>, (and) (and) <span class=\"ibTxt\">[42:11 nothing is a likeness of Him</span>’."
          ],
          "en.sarwar": [
            " 2. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abdal Jabbar from Safwan ibn Yahya who has said that abu Qurrah (Musa ibn Tariq al-Yamani al-Zabudi, d. 203/818), a narrator of Hadith, asked me to take him to abul Hassan al-Rida (a.s.). I sought permission from the Imam (a.s.) and an audience was granted. He asked the Imam about what is lawful and unlawful and the rules in Islamic laws. His questions came to Oneness of Allah (God). Abu Qurrah said, “We (the narrators of Hadith) narrate that Allah, the Almighty has divided His being seen al-Ru’yah and His al-kalam, speech between the two prophets. He gave Musa (Moses) the opportunity to hear His speech, and Muhammad (s.a.) the opportunity to see Him.” Imam abu al-Hassan (a.s.) said, “Who conveyed the message from Allah to the two heavy communities; mankind and the Jinn that says: ‘The eyes can not comprehend Him.’ <a href=\"/#/books/quran:6#h103\">[6:103]</a> “They can not limit Him through their knowledge.” <a href=\"/#/books/quran:20#h110\">[20:110]</a> ‘There is nothing similar to Him.’ <a href=\"/#/books/quran:42#h11\">[42:11]</a> “Was it not Muhammad (s.a.)?’” Asked the Imam (a.s.). Abu Qurrah then replied, “Yes, He was Prophet Muhammad (s.a.). “ The Imam said, “How can a person who brought such messages to all creatures and told them that he has brought such messages from Allah and called them to Allah by His commands and said, “The eyes can not comprehend Him.” <a href=\"/#/books/quran:6#h103\">[6:103]</a> “They can not limit Him through their knowledge.” <a href=\"/#/books/quran:20#h110\">[20:110]</a> “There is nothing similar to Him.” <a href=\"/#/books/quran:42#h11\">[42:11]</a>, then he would say, “I saw Him with my own eyes? I did limit Him in my knowledge and that He is similar to a man? Should you not be ashamed of yourselves? Even the atheist have not said that the Prophet first brought one thing from Allah and then announced from Him other things contrary to the first.” Abu Qurrah then said, “Does Allah Himself not say, ‘And indeed he (the Prophet) saw him in another descent.?” (53: 13) Imam abu al-Hassan (a.s.) said, “The other verses point out what the Prophet actually saw. Allah has said, “His heart did not lie about what he saw” (53: 11) It means that the heart of Muhammad did not belie what his eyes saw. Therefore, Allah in the subsequent verse has said, “Indeed he saw of the greatest signs of his Lord.” <a href=\"/#/books/quran:53#h18\">[53:18]</a> The signs of Allah are different from Allah Himself. Allah has also said, “They can not limit Him in their knowledge.” <a href=\"/#/books/quran:20#h110\">[20:110]</a> If the eyes could see Him, then people might limit Him in their knowledge and He could be fully defined.” Abu Qurrah asked, “Do you disregard Hadith?” Imam abu al-Hassan (a.s.) replied, “If Ahadith are contrary to Quran, I disregard them. Besides, all Muslims believe that Allah cannot be limited by knowledge, that eyes can not see Him and that nothing is similar to Him.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/331)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 259,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/397",
              "text": "عَلِيِّ بْنِ سَيْفٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/398",
              "text": "مُحَمَّدِ بْنِ عُبَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ مُحَمَّدِ بْنِ عُبَيْدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:3",
        "text": [
          " كَتَبْتُ إِلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) أَسْأَلُهُ عَنِ الرُّؤْيَةِ وَ مَا تَرْوِيهِ الْعَامَّةُ وَ الْخَاصَّةُ وَ سَأَلْتُهُ أَنْ يَشْرَحَ لِي ذَلِكَ",
          "فَكَتَبَ بِخَطِّهِ اتَّفَقَ الْجَمِيعُ لَا تَمَانُعَ بَيْنَهُمْ أَنَّ الْمَعْرِفَةَ مِنْ جِهَةِ الرُّؤْيَةِ ضَرُورَةٌ فَإِذَا جَازَ أَنْ يُرَى اللَّهُ بِالْعَيْنِ وَقَعَتِ الْمَعْرِفَةُ ضَرُورَةً ثُمَّ لَمْ تَخْلُ تِلْكَ الْمَعْرِفَةُ مِنْ أَنْ تَكُونَ إِيمَاناً أَوْ لَيْسَتْ بِإِيمَانٍ ",
          "فَإِنْ كَانَتْ تِلْكَ الْمَعْرِفَةُ مِنْ جِهَةِ الرُّؤْيَةِ إِيمَاناً فَالْمَعْرِفَةُ الَّتِي فِي دَارِ الدُّنْيَا مِنْ جِهَةِ الِاكْتِسَابِ لَيْسَتْ بِإِيمَانٍ لِأَنَّهَا ضِدُّهُ فَلَا يَكُونُ فِي الدُّنْيَا مُؤْمِنٌ لِأَنَّهُمْ لَمْ يَرَوُا اللَّهَ عَزَّ ذِكْرُهُ",
          "وَ إِنْ لَمْ تَكُنْ تِلْكَ الْمَعْرِفَةُ الَّتِي مِنْ جِهَةِ الرُّؤْيَةِ إِيمَاناً لَمْ تَخْلُ هَذِهِ الْمَعْرِفَةُ الَّتِي مِنْ جِهَةِ الِاكْتِسَابِ أَنْ تَزُولَ وَ لَا تَزُولُ فِي الْمَعَادِ فَهَذَا دَلِيلٌ عَلَى أَنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يُرَى بِالْعَيْنِ إِذِ الْعَيْنُ تُؤَدِّي إِلَى مَا وَصَفْنَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Sayf, from Muhammad Bin Ubeyd who said, ",
            "‘I wrote to Abu Al-Hassan Al-Reza<sup>asws</sup> asking him<sup>asws</sup> about the sighting and what is being reported by the general Muslims and the specific ones (Shias), and asked him<sup>asws</sup> that he<sup>asws</sup> should explain that to me’. ",
            "So he<sup>asws</sup> by his<sup>asws</sup> own handwriting: ‘The recognition from an aspect of the sighting is a necessity. So when it is possible that one sees Allah<sup>azwj</sup> with the eyes, the necessary recognition would occur. Then that recognition cannot be free from whether it happens to be with <span class=\"iTxt\">Eman</span> or does not happen to be with <span class=\"iTxt\">Eman</span>. ",
            "So if it was so that the recognition from the aspect of the sighting was <span class=\"iTxt\">Eman</span>, then the recognition which is in the house of the world from the aspect of the attaining would not be with <span class=\"iTxt\">Eman</span>, because it is opposite to it. Thus, there would not happen to be a (single) <span class=\"iTxt\">Momin</span> because they are not seeing Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention. ",
            "And if that recognition which was from the aspect of the sighting does not happen to be <span class=\"iTxt\">Eman</span>, then these recognitions which are attained from the aspect of the attaining would not be free from declining (in the world) and not declining in the Hereafter. So this is the evidence upon the fact that Allah<sup>azwj</sup> Mighty and Majestic cannot be seen with the eyes, when the eye (sighting) would lead to what we<sup>asws</sup> have described’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Idris has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn Sayf from Muhammad ibn ‘Ubayd who has said the following. “I wrote to abu al-Hassan al-Rida (a.s.) and asked him about the belief in eye-witnessing Allah’s self. Is it is possible to see Allah’s self with one’s own eyes as is traditionally narrated in the affirmative by the Sunni Muslims (al-’ammah) and the Shi‘ah Muslims (al-khassah) who are contrary. I requested him to explain the matter. The Imam answered in his own handwriting. “All agree and there is no dissension among the people that eye-witnessed knowledge of things is certainly knowledge without doubt. It is the form of knowledge that does not require logical proofs. If it is true that seeing Allah’s self with the eyes is possible then it becomes a necessity to acknowledge that Allah becomes entirely known and defined through eye-witnessed process. Now, can eye-witnessed knowledge of Allah’s self be considered faith or not? If the knowledge of Him as such, i.e. eye-witnessed knowledge (which according to Sunni Muslims will happen on the Day of resurrection) be considered faith, then faith in Allah in this world, which comes through non-eye-witnessed knowledge is not faith. It is contrary to eye-witnessed knowledge and faith (contrary things do not exist at the same time). Thus, there would be no one who would have faith in Allah in this world because no one has seen Him, Majestic is Whose name. If the eye-witnessed knowledge and understanding would not be considered faith then the non-eye-witnessed faith and knowledge formed and acquired must go away in the next life, but, in fact, it will not go away on the Day of resurrection. This is proof that Allah, the Majestic, the Glorious, can not be seen because it will lead to (the kind of confusion) what we just mentioned.”"
          ]
        }
      },
      {
        "index": 260,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "وَ عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/141",
              "text": "أَحْمَدَ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:4",
        "text": [
          " كَتَبْتُ إِلَى أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام ) أَسْأَلُهُ عَنِ الرُّؤْيَةِ وَ مَا اخْتَلَفَ فِيهِ النَّاسُ فَكَتَبَ لَا تَجُوزُ الرُّؤْيَةُ مَا لَمْ يَكُنْ بَيْنَ الرَّائِي وَ الْمَرْئِيِّ هَوَاءٌ لَمْ يَنْفُذْهُ الْبَصَرُ فَإِذَا انْقَطَعَ الْهَوَاءُ عَنِ الرَّائِي وَ الْمَرْئِيِّ لَمْ تَصِحَّ الرُّؤْيَةُ وَ كَانَ فِي ذَلِكَ الِاشْتِبَاهُ لِأَنَّ الرَّائِيَ مَتَى سَاوَى الْمَرْئِيَّ فِي السَّبَبِ الْمُوجِبِ بَيْنَهُمَا فِي الرُّؤْيَةِ وَجَبَ الِاشْتِبَاهُ وَ كَانَ ذَلِكَ التَّشْبِيهُ لِأَنَّ الْأَسْبَابَ لَا بُدَّ مِنِ اتِّصَالِهَا بِالْمُسَبَّبَاتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ahmad Bin Is’haq who said, ",
            "‘I wrote to Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup> asking him<sup>asws</sup> about the sighting and what the people are differing in with regards to it. So he<sup>asws</sup> wrote: ‘The sighting is not allowed (possible) for as long as there does not happen to be an atmosphere between the seeing and the seen, carrying the vision. So when the atmosphere is cut off from the seeing and the seen, the sighting would not be valid and there would be the similarity in that because the seer, when he is equal to the seen in the cause, it would obligate between the two with regards to the sighting, the obligation of the similarity, and that is the similarity because the causes, it is inevitable from these to be related with the effects’."
          ],
          "en.sarwar": [
            " 4. It is narrated from the same narrator (Ahmad ibn Idris) from Ahmad ibn Ishaq who has said the following. “I wrote to Imam abul Hassan the 3rd and asked him about eye-witnessing Allah’s self and the differences among people about this issue. The Imam (a.s.) answered in writing.” “Eye-witnessing Allah’s self is not possible until there is air (light-carrier medium) that would let the light reach the eye. If air is remove from (space between) the viewer and the object, no eye-witnessing will take place. In this is ground for similarity. When the viewer and the object in view would have the same medium that make eye-witnessing possible a similarity must exist therein. (When applying this to the case of Allah) it is an analogy and similarity. The means must have a connection with the source.”"
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 261,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/176",
              "text": "عَلِيِّ بْنِ مَعْبَدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِيهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:5",
        "relations": {
          "Mentions": [
            "/books/quran:6:124"
          ]
        },
        "text": [
          " حَضَرْتُ أَبَا جَعْفَرٍ ( عليه السلام ) فَدَخَلَ عَلَيْهِ رَجُلٌ مِنَ الْخَوَارِجِ فَقَالَ لَهُ يَا أَبَا جَعْفَرٍ أَيَّ شَيْ‏ءٍ تَعْبُدُ قَالَ اللَّهَ تَعَالَى قَالَ رَأَيْتَهُ قَالَ بَلْ لَمْ تَرَهُ الْعُيُونُ بِمُشَاهَدَةِ الْأَبْصَارِ وَ لَكِنْ رَأَتْهُ الْقُلُوبُ بِحَقَائِقِ الْإِيمَانِ لَا يُعْرَفُ بِالْقِيَاسِ وَ لَا يُدْرَكُ بِالْحَوَاسِّ وَ لَا يُشَبَّهُ بِالنَّاسِ مَوْصُوفٌ بِالْآيَاتِ مَعْرُوفٌ بِالْعَلَامَاتِ لَا يَجُورُ فِي حُكْمِهِ ذَلِكَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ ",
          "قَالَ فَخَرَجَ الرَّجُلُ وَ هُوَ يَقُولُ اللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسالَتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from Abdullah Bin Sinan, from his father who said, ",
            "‘I was present with Abu Ja’far<sup>asws</sup> and a man from the Kharijites came over to him<sup>asws</sup> and said to him, ‘O Abu Ja’far<sup>asws</sup>! Which thing do you<sup>asws</sup> worship?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> the Exalted’. He said, ‘Have you<sup>asws</sup> seen Him<sup>azwj</sup>?’ He<sup>asws</sup> said: ‘But, the eyes cannot see Him<sup>azwj</sup> with the visualizing of the visions, but the hearts seen Him<sup>azwj</sup> by the realities of the <span class=\"iTxt\">Eman</span>. He<sup>azwj</sup> cannot be recognised by the analogies, nor can He<sup>azwj</sup> be realised by the sensory perceptions, nor can He<sup>azwj</sup> be resembled with the people. He<sup>azwj</sup> is Described in the Verses (of the Quran), recognised by the Signs. He<sup>azwj</sup> is not tyrannous in His<sup>azwj</sup> Judgments. That is Allah<sup>azwj</sup>. There is no god except Him<sup>azwj</sup>’. ",
            "He (the narrator) said, ‘So the man went out and he was saying, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:6#h124\">[6:124]</a> Allah best knows where He Places His Message</span>’."
          ],
          "en.sarwar": [
            " 5. Ali ibn Ibrahim has narrated from his father from Ali ibn Ma‘bad from ‘Abdallah ibn Sinan from his father who has said the following. “I met Imam abu Ja‘far (a.s.) and at that time a man from the Khariji group came to see the Imam (a.s.) and asked, ‘O abu Ja‘far, who do you worship?’” The Imam replied, “I worship Allah, the Most High.” He then asked, “Have you seen Him?” The Imam then said, “Eyes can not see Him in an eye-witnessing process but the hearts can see Him through the reality of faith. Allah can not be known by analogy or physical senses and He is not similar to people. He is mentioned in the verses of revelation. He is known from the signs. He does not do injustice in His judgments. Thus, is Allah besides Him there is no Allah.” The narrator has said, “The man then left the Imam (a.s.) saying, “Allah knows best to who should He entrust His message to mankind.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/337)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 262,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/382",
              "text": "أَبِي الْحَسَنِ الْمَوْصِلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ الْمَوْصِلِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:6",
        "text": [
          " جَاءَ حِبْرٌ إِلَى أَمِيرِ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ هَلْ رَأَيْتَ رَبَّكَ حِينَ عَبَدْتَهُ قَالَ فَقَالَ وَيْلَكَ مَا كُنْتُ أَعْبُدُ رَبّاً لَمْ أَرَهُ قَالَ وَ كَيْفَ رَأَيْتَهُ قَالَ وَيْلَكَ لَا تُدْرِكُهُ الْعُيُونُ فِي مُشَاهَدَةِ الْأَبْصَارِ وَ لَكِنْ رَأَتْهُ الْقُلُوبُ بِحَقَائِقِ الْإِيمَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammd Bin Khalid, from Ahmad Bin Muhammad Bin Abu Nasr, from Abu Al Hassan Al Mowsaly, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A Rabbi came over to Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> and he said, ‘O Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup>! Do you<sup>asws</sup> see your<sup>asws</sup> Lord<sup>azwj</sup> when you<sup>asws</sup> worship Him<sup>azwj</sup>?’ So he<sup>asws</sup> said: ‘Woe be unto you! I<sup>asws</sup> have never worshipped a Lord<sup>azwj</sup> I<sup>asws</sup> do not see’. He said, ‘And how do you<sup>asws</sup> see Him<sup>azwj</sup>?’ He<sup>asws</sup> said: ‘Woe be unto you! The eyes cannot envisage Him<sup>azwj</sup> in the viewing of the sights. But, the hearts see Him<sup>azwj</sup> by the realities of the <span class=\"iTxt\">Eman</span>’."
          ],
          "en.sarwar": [
            " 6. A group of our people has narrated from Ahmad ibn Muhammad ibn Khalid from Ahmad ibn Muhammad ibn abu Nasr from abu al-Hassan al-Muwsali from abu ‘Abdallah (a.s.) who has said, “Once a rabbi (hibr) came to Imam Ali (a.s.) and asked, ‘O Amir al-mu’minin, have you seen your Lord when worshipping Him?’” Imam Ali (a.s.) replied, “This is not a proper question. I would not have worshipped a Lord whom I could not see.” He then asked, “How did you see Him?” Imam Ali (a.s.) said, “This is not a proper statement. Eyes can not see Him in eye-witnessing process but hearts see Him in the realities of faith.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/337)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 263,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/280",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:7",
        "text": [
          " ذَاكَرْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فِيمَا يَرْوُونَ مِنَ الرُّؤْيَةِ فَقَالَ الشَّمْسُ جُزْءٌ مِنْ سَبْعِينَ جُزْءاً مِنْ نُورِ الْكُرْسِيِّ وَ الْكُرْسِيُّ جُزْءٌ مِنْ سَبْعِينَ جُزْءاً مِنْ نُورِ الْعَرْشِ وَ الْعَرْشُ جُزْءٌ مِنْ سَبْعِينَ جُزْءاً مِنْ نُورِ الْحِجَابِ وَ الْحِجَابُ جُزْءٌ مِنْ سَبْعِينَ جُزْءاً مِنْ نُورِ السِّتْرِ فَإِنْ كَانُوا صَادِقِينَ فَلْيَمْلَئُوا أَعْيُنَهُمْ مِنَ الشَّمْسِ لَيْسَ دُونَهَا سَحَابٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Aasim Bin Humeyd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘I discussed with Abu Abdullah<sup>asws</sup> regarding what they (reporters) are reporting of the sighting. So he<sup>asws</sup> said: ‘The sun is a one part from the seventy of the light of the Chair (الْكُرْسِيِّ), and the Chair (الْكُرْسِيِّ) is one part of seventy parts from the Light of the Throne (الْعَرْشِ), and the Throne (الْعَرْشِ ) is one part from seventy parts from the Light of the Veil, and the Veil is one part from the seventy part from the Light of the Curtain. So if they were truthful, so let them be filling their eyes from the sun where there is no cloud under it’."
          ],
          "en.sarwar": [
            " 7. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Asim ibn Hamiyd who has said the following. “I discussed with Imam abu ‘Abdallah (a.s.) about what he says to eye-witnessing Allah’s self. The Imam said, “The light of the sun has a ratio equal to one seventieth of the light of the Kursi (the throne). The same is the ratio of the light of Kursi to al-‘Arsh, the light of which is of the same ration to that of al-Hijab the light of which is of the same ration to the light of al-Satr. If they tell the truth let them fill their eyes with the light of the sun without a curtain in between.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/338)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 264,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "غَيْرُهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/386",
              "text": "ابْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/93",
              "text": "أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:8",
        "relations": {
          "Mentions": [
            "/books/quran:6:103"
          ]
        },
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَمَّا أُسْرِيَ بِي إِلَى السَّمَاءِ بَلَغَ بِي جَبْرَئِيلُ مَكَاناً لَمْ يَطَأْهُ قَطُّ جَبْرَئِيلُ فَكَشَفَ لَهُ فَأَرَاهُ اللَّهُ مِنْ نُورِ عَظَمَتِهِ مَا أَحَبَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, and someone else from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Nasr, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘When I<sup>saww</sup> was ascended to the sky, Jibraeel<sup>as</sup> reached with me<sup>saww</sup> to a place which Jibraeel<sup>as</sup> had not trodden upon at all’. So it was uncovered for him<sup>saww</sup>, and Allah<sup>azwj</sup> Showed him<sup>saww</sup>, from the Light of His<sup>azwj</sup> magnificence, whatever He<sup>azwj</sup> so Loved to’."
          ],
          "en.sarwar": [
            " 8. Muhammad ibn Yahya and others have narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn abu Nasr from abu al-Hassan al-Rida (a.s.) who has said that the holy Prophet (s.a.) said, “When Jibril took me for a visit to the heavens we reached a place where he had never sat food there before. Then it was unveiled to him and Allah showed him of the light of His greatness that which he loved.” On the words of Allah “ No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware. <a href=\"/#/books/quran:6#h103\">[6:103]</a>"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (339/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 265,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/78",
              "text": "ابْنِ أَبِي نَجْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/399",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ لا تُدْرِكُهُ الْأَبْصارُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ لا تُدْرِكُهُ الْأَبْصارُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:9",
        "relations": {
          "Mentions": [
            "/books/quran:6:103",
            "/books/quran:6:104"
          ]
        },
        "text": [
          " إِحَاطَةُ الْوَهْمِ أَ لَا تَرَى إِلَى قَوْلِهِ قَدْ جاءَكُمْ بَصائِرُ مِنْ رَبِّكُمْ لَيْسَ يَعْنِي بَصَرَ الْعُيُونِ فَمَنْ أَبْصَرَ فَلِنَفْسِهِ لَيْسَ يَعْنِي مِنَ الْبَصَرِ بِعَيْنِهِ وَ مَنْ عَمِيَ فَعَلَيْها لَيْسَ يَعْنِي عَمَى الْعُيُونِ إِنَّمَا عَنَى إِحَاطَةَ الْوَهْمِ كَمَا يُقَالُ فُلَانٌ بَصِيرٌ بِالشِّعْرِ وَ فُلَانٌ بَصِيرٌ بِالْفِقْهِ وَ فُلَانٌ بَصِيرٌ بِالدَّرَاهِمِ وَ فُلَانٌ بَصِيرٌ بِالثِّيَابِ اللَّهُ أَعْظَمُ مِنْ أَنْ يُرَى بِالْعَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Najran, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h103\">[6:103]</a> Visions cannot comprehend Him</span>. He<sup>asws</sup> said: ‘The grasping of the imaginations. Do you not see His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h104\">[6:104]</a> There has come to you Insight from your Lord</span>? It does not Mean the insight of the eyes <span class=\"ibTxt\">whoever will therefore see, it is for his own soul</span>, it does not Mean the visualising with his eyes <span class=\"ibTxt\">and whoever will be blind, it shall be against himself</span>, it does not mean the blindness of the eyes. But rather, it Means the grasp of the imagination, just as it is said, ‘So and so has insight in the poetry, and so and so has insight in the understanding, and so and so has insight in the Dirhams, and so and so has insight in the clothes’. Allah<sup>azwj</sup> is more Magnificent than that He<sup>azwj</sup> should be seen with the eye’."
          ],
          "en.sarwar": [
            " 9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn abu Najran from ‘Abdallah ibn Sinan from Imam abu ‘Abdallah (a.s.) who has said the following about the words of Allah. “No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.” <a href=\"/#/books/quran:6#h103\">[6:103]</a> It means within what is called al-Wahm which in terms of the degrees of knowledge is less than fifty percent. Consider the words of Allah in: “Clear proofs have certainly come to you from your Lord.. .” <a href=\"/#/books/quran:6#h104\">[6:104]</a> It does not mean eye-witnessed knowledge. Also consider, “Whosoever sees clearly, it is to his own gain.” (ibid) does not mean seeing with the eyes and in “Whosoever is blind, it is to his own loss’ (ibid ). Blindness does not mean deprivation of eye-sight. It means within the range of Wahm (mentioned above). As is commonly said, so and so is very keen-sighted in matters of poetry, and so and so is very keen-sighted in religion and jurisprudence. So and so has a keen eye for money, and so and so an eye for clothes. Allah is far great and above being eye-witnessed by people.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/339)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 266,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/58",
              "text": "أَبِي هَاشِمٍ الْجَعْفَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/93",
              "text": "أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِي هَاشِمٍ الْجَعْفَرِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:10",
        "relations": {
          "Mentions": [
            "/books/quran:6:103"
          ]
        },
        "text": [
          " سَأَلْتُهُ عَنِ اللَّهِ هَلْ يُوصَفُ فَقَالَ أَ مَا تَقْرَأُ الْقُرْآنَ قُلْتُ بَلَى قَالَ أَ مَا تَقْرَأُ قَوْلَهُ تَعَالَى لا تُدْرِكُهُ الْأَبْصارُ وَ هُوَ يُدْرِكُ الْأَبْصارَ قُلْتُ بَلَى قَالَ فَتَعْرِفُونَ الْأَبْصَارَ قُلْتُ بَلَى قَالَ مَا هِيَ قُلْتُ أَبْصَارُ الْعُيُونِ فَقَالَ إِنَّ أَوْهَامَ الْقُلُوبِ أَكْبَرُ مِنْ أَبْصَارِ الْعُيُونِ فَهُوَ لَا تُدْرِكُهُ الْأَوْهَامُ وَ هُوَ يُدْرِكُ الْأَوْهَامَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Abu Hashim Al Ja’fary, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about Allah<sup>azwj</sup>, can He<sup>azwj</sup> be described?’ So he<sup>asws</sup> said: ‘Did you not read the Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h103\">[6:103]</a> Visions cannot comprehend Him, and He Comprehends (all) visions</span>?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So are you recognising the ‘visions’?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘What are these?’ I said, ‘Visions of the eyes’. So he<sup>asws</sup> said: ‘The imaginations of the hearts are greater than the visions of the eyes. So He<sup>azwj</sup> is such that the imaginations cannot comprehend Him<sup>azwj</sup> and He<sup>azwj</sup> Comprehends the imaginations (of the creatures)’."
          ],
          "en.sarwar": [
            " 10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Abu Hashim al-Ja‘fari who has said the following. “I asked Imam abul Hassan al-Rida (a.s.), about Allah if He can be described (defined in words). The Imam (a.s.) said, “Have you not read the Quran?” I replied, “Yes, I do read the Quran.” He then said, “Have you not read the words of Allah, the Most High, “No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.” <a href=\"/#/books/quran:6#h103\">[6:103]</a> I replied, “Yes, I have read them.” The Imam (a.s.) said, “Do they know the meaning of the eyes?” I replied, “Yes, they do.” The Imam (a.s.) said, “What is it?” I replied, “ It means seeing with the eyes.” Then the Imam said, the Awham (mentioned above) of the heart is far greater comprehensive in knowledge than eye-witnessing. It is not able to comprehend Him but He comprehends all things.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (141/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 267,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/358",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/400",
              "text": "دَاوُدَ بْنِ الْقَاسِمِ أَبِي هَاشِمٍ الْجَعْفَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ دَاوُدَ بْنِ الْقَاسِمِ أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:11",
        "relations": {
          "Mentions": [
            "/books/quran:6:103"
          ]
        },
        "text": [
          " قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) لا تُدْرِكُهُ الْأَبْصارُ وَ هُوَ يُدْرِكُ الْأَبْصارَ فَقَالَ يَا أَبَا هَاشِمٍ أَوْهَامُ الْقُلُوبِ أَدَقُّ مِنْ أَبْصَارِ الْعُيُونِ أَنْتَ قَدْ تُدْرِكُ بِوَهْمِكَ السِّنْدَ وَ الْهِنْدَ وَ الْبُلْدَانَ الَّتِي لَمْ تَدْخُلْهَا وَ لَا تُدْرِكُهَا بِبَصَرِكَ وَ أَوْهَامُ الْقُلُوبِ لَا تُدْرِكُهُ فَكَيْفَ أَبْصَارُ الْعُيُونِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from the one who mentioned it, from Muhammad Bin Isa, from Dawood Bin Al Qasim Abu Hashim Al Ja’fary who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘(What about the Verse) <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h103\">[6:103]</a> Visions cannot comprehend Him, and He Comprehends (all) visions</span>?’. So he<sup>asws</sup> said: ‘O Abu Hashim! Imaginations of the hearts are more sharper than the visions of the eyes. You have realised by your imaginations, Al-Sind, and Al-Hind, and the countries which you have not entered into nor seen with your vision, and the imaginations of the heart cannot comprehend Him<sup>azwj</sup>, so how could the visions of the eyes?’"
          ],
          "en.sarwar": [
            " 11. Muhammad ibn abu ‘Abdallah has narrated from the person whose name he mentioned from Muhammad ibn ‘Isa from Dawud ibn al-Qasim abu Hashim al-Ja‘fari who has said the following. “I mentioned the words of Allah , ‘No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.’ <a href=\"/#/books/quran:6#h103\">[6:103]</a> to Imam abu Ja’far (a.s.). He said, “O abu Hashim, Awham (mentioned above) of hearts are keener and sharper than the perceptions of the eyes. Through the Awham of the heart you can perceive countries like Sind, Hind (India) and other cities which you have never seen with your eyes. How can your eyes see Him when the Awham of your heart cannot perceive Him?”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل موقو ف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/141)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 268,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/44",
              "text": "هِشَامِ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:3:9:12",
        "text": [
          " الْأَشْيَاءُ كُلُّهَا لَا تُدْرَكُ إِلَّا بِأَمْرَيْنِ بِالْحَوَاسِّ وَ الْقَلْبِ وَ الْحَوَاسُّ إِدْرَاكُهَا عَلَى ثَلَاثَةِ مَعَانٍ إِدْرَاكاً بِالْمُدَاخَلَةِ وَ إِدْرَاكاً بِالْمُمَاسَّةِ وَ إِدْرَاكاً بِلَا مُدَاخَلَةٍ وَ لَا مُمَاسَّةٍ ",
          "فَأَمَّا الْإِدْرَاكُ الَّذِي بِالْمُدَاخَلَةِ فَالْأَصْوَاتُ وَ الْمَشَامُّ وَ الطُّعُومُ وَ أَمَّا الْإِدْرَاكُ بِالْمُمَاسَّةِ فَمَعْرِفَةُ الْأَشْكَالِ مِنَ التَّرْبِيعِ وَ التَّثْلِيثِ وَ مَعْرِفَةُ اللَّيِّنِ وَ الْخَشِنِ وَ الْحَرِّ وَ الْبَرْدِ وَ أَمَّا الْإِدْرَاكُ بِلَا مُمَاسَّةٍ وَ لَا مُدَاخَلَةٍ فَالْبَصَرُ فَإِنَّهُ يُدْرِكُ الْأَشْيَاءَ بِلَا مُمَاسَّةٍ وَ لَا مُدَاخَلَةٍ فِي حَيِّزِ غَيْرِهِ وَ لَا فِي حَيِّزِهِ ",
          "وَ إِدْرَاكُ الْبَصَرِ لَهُ سَبِيلٌ وَ سَبَبٌ فَسَبِيلُهُ الْهَوَاءُ وَ سَبَبُهُ الضِّيَاءُ فَإِذَا كَانَ السَّبِيلُ مُتَّصِلًا بَيْنَهُ وَ بَيْنَ الْمَرْئِيِّ وَ السَّبَبُ قَائِمٌ أَدْرَكَ مَا يُلَاقِي مِنَ الْأَلْوَانِ وَ الْأَشْخَاصِ فَإِذَا حُمِلَ الْبَصَرُ عَلَى مَا لَا سَبِيلَ لَهُ فِيهِ رَجَعَ رَاجِعاً فَحَكَى مَا وَرَاءَهُ كَالنَّاظِرِ فِي الْمِرْآةِ لَا يَنْفُذُ بَصَرُهُ فِي الْمِرْآةِ فَإِذَا لَمْ يَكُنْ لَهُ سَبِيلٌ رَجَعَ رَاجِعاً يَحْكِي مَا وَرَاءَهُ وَ كَذَلِكَ النَّاظِرُ فِي الْمَاءِ الصَّافِي يَرْجِعُ رَاجِعاً فَيَحْكِي مَا وَرَاءَهُ إِذْ لَا سَبِيلَ لَهُ فِي إِنْفَاذِ بَصَرِهِ ",
          "فَأَمَّا الْقَلْبُ فَإِنَّمَا سُلْطَانُهُ عَلَى الْهَوَاءِ فَهُوَ يُدْرِكُ جَمِيعَ مَا فِي الْهَوَاءِ وَ يَتَوَهَّمُهُ فَإِذَا حُمِلَ الْقَلْبُ عَلَى مَا لَيْسَ فِي الْهَوَاءِ مَوْجُوداً رَجَعَ رَاجِعاً فَحَكَى مَا فِي الْهَوَاءِ فَلَا يَنْبَغِي لِلْعَاقِلِ أَنْ يَحْمِلَ قَلْبَهُ عَلَى مَا لَيْسَ مَوْجُوداً فِي الْهَوَاءِ مِنْ أَمْرِ التَّوْحِيدِ جَلَّ اللَّهُ وَ عَزَّ فَإِنَّهُ إِنْ فَعَلَ ذَلِكَ لَمْ يَتَوَهَّمْ إِلَّا مَا فِي الْهَوَاءِ مَوْجُودٌ كَمَا قُلْنَا فِي أَمْرِ الْبَصَرِ تَعَالَى اللَّهُ أَنْ يُشْبِهَهُ خَلْقُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of his companions, from Hisham Bin Al Hakam who said, ",
            "‘The things, all of them cannot be comprehended except by two matters – by the sensory perceptions and the heart; and the senses are such that their realisation is based upon three aids – realisation by the penetration, and realisation by the touching, and realisation without a penetration or a touch.",
            "So, as for the realisation which is by the penetration, so it is the sounds, and the smells, and the tastes. And as for the realisation by the touching, so it is the recognition of the shapes, from the square and the triangle, and recognition of the softness and the hardness, and the heat, and the cold. And as for the realisation without touching nor penetration, so it is the visualising, for it realises the things without touching or penetrating in a space other than it, and not in its own space.",
            "And the realisation of the vision, for it there is a way and a cause. So its way is the atmosphere and its cause is the illumination. So when it was such that the way was continuous between it and the seen (object), and the cause existed, one would realise what one faces from the colour and the persons. So when the vision is carried upon what there is no way for it, it would return with a returning, so it would tell one what is behind him. ",
            "Like the beholder in the mirror, his vision does not go through the mirror. So when there does not happen to be a way for it, it returns with a returning, telling what is behind him. And similar to that is the beholder in the clear water, it returns with a returning, so it tells what is behind him, where there is no way for it, with regards to the penetration of his vision’. ",
            "So, as for the heart, so rather its authority is upon the atmosphere. So one realises the entirety of whatever is in the whims, and imagine it. So when the heart is carried upon what is not in the whims which exists, it would return with a returning, so it would tell of what is in the whims. Therefore, it is not befitting for the intellectual that he carries his heart upon what there is no existence of in the whims, from the matter of the <span class=\"iTxt\">Tawheed</span> (Oneness) of Majestic Allah<sup>azwj</sup> and Mighty. So if he does that, he would not imagine anything except what is existent in the desires, just as we<sup>asws</sup> are saying regarding the matter of the visualisation of Allah<sup>azwj</sup> that He<sup>azwj</sup> resembles His<sup>azwj</sup> creatures’."
          ],
          "en.sarwar": [
            " 12. Ali ibn Ibrahim has narrated from his father from some of his people from Hisham ibn al-Hakam who has said the following. “Things can be perceived by two means: (1) By the senses and (2) by the heart, intellect. Perceptions of the senses are of three kinds: (1) Perception in the form of penetration, (2) Perception in the form of touching, and (3) Perception without penetration or touCh Perception by means of sounds, smells and tastes are formed through penetration. Perception through touching comes from the knowledge of shapes, such as rectangular or triangular etc., and also softness, hardness, heat and cold. Perception without touch or penetration is that of sight which is capable of perceiving things without touching or penetration, directly or indirectly. Perception through sight needs a path and medium. Its path is air and its medium is the light. If the path is continuous between the viewer and the object and the medium then seeing takes place such as colors and persons. If light falls on something without a path, it will return reflecting what is behind (the observed), like an observer looking into a mirror. Light does not penetrate into the mirror, because it finds no path. So it returns reflecting what lies behind the observed. It is similar to looking into the clear water returns light that reflects what is at the rear. This happens because there is no path for the penetration of light. Intellect dominates the air. It perceives all that is in the air and forms his Wahm (intuitive form of perception). If the heart will not find any thing in the air it comes back and reflects what is in the air. A person of reason should not force his heart against what is not in the air of the issue of the Oneness of Allah, the Majestic, the Glorious, otherwise, it will form his Wahm of what is there in the air as mentioned about the eye-witnessing. Allah, the Most High is far and above similarities with the creatures.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:3:9",
  "kind": "verse_list"
}