{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 1"}, "path": "/books/al-kafi:4:3:1", "titles": {"ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>َابُ بَدْءِ الْحَجَرِ</span> وَ الْعِلَّةِ فِي اسْتِلَامِهِ", "en": "Chapter 1 – The commencement of the (Black) Stone and the reason for kissing it"}}], "index": 944, "local_index": 1, "part_type": "Chapter", "path": "/books/al-kafi:4:3:1", "titles": {"ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>َابُ بَدْءِ الْحَجَرِ</span> وَ الْعِلَّةِ فِي اسْتِلَامِهِ", "en": "Chapter 1 – The commencement of the (Black) Stone and the reason for kissing it"}, "verse_count": 3, "verse_start_index": 6669, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6670, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:1:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ح</span>َدَّثَنِي عَلِيُّ</span> بْنُ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمَّا أَخَذَ مَوَاثِيقَ الْعِبَادِ أَمَرَ الْحَجَرَ فَالْتَقَمَهَا وَ لِذَلِكَ يُقَالُ أَمَانَتِي أَدَّيْتُهَا وَ مِيثَاقِي تَعَاهَدْتُهُ لِتَشْهَدَ لِي بِالْمُوَافَاةِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim Bin Hashim narrated to me, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Muawiya Bin Ammar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Allah<sup>azwj</sup> Blessed and High Took the Covenant of the servants, Commanded the (Black) Stone, so it devoured it, and due to that it is said (during Hajj), ‘My entrustment, I have fulfilled it, and my Covenant I promise to you  (The Black Stone) so that you would testify for me with the loyalty’’."]}}, {"index": 6671, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:1:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنِ الْحَلَبِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) لِمَ جُعِلَ اسْتِلَامُ الْحَجَرِ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ حَيْثُ أَخَذَ مِيثَاقَ بَنِي آدَمَ دَعَا الْحَجَرَ مِنَ الْجَنَّةِ فَأَمَرَهُ فَالْتَقَمَ الْمِيثَاقَ فَهُوَ يَشْهَدُ لِمَنْ وَافَاهُ بِالْمُوَافَاةِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Abdullah Bin Bukeyr, from Al Halby who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘Why was kissing the (Black) Stone made to be?’ So he<sup>asws</sup> said: ‘When Allah<sup>azwj</sup> Mighty and Majestic Took the Covenant of the Children of Adam<sup>as</sup>, Called the (Black) Stone from the Paradise, so He<sup>azwj</sup> Commanded it and it devoured the Covenant. Thus, it would testify for the ones who were loyal to it with the loyalty (to the Wilayah)’."]}}, {"index": 6672, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:1:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُوسَى بْنِ عُمَرَ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي سَعِيدٍ الْقَمَّاطِ عَنْ بُكَيْرِ بْنِ أَعْيَنَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) لِأَيِّ عِلَّةٍ وَضَعَ اللَّهُ الْحَجَرَ فِي الرُّكْنِ الَّذِي هُوَ فِيهِ وَ لَمْ يُوضَعْ فِي غَيْرِهِ وَ لِأَيِّ عِلَّةٍ تُقَبَّلُ وَ لِأَيِّ عِلَّةٍ أُخْرِجَ مِنَ الْجَنَّةِ وَ لِأَيِّ عِلَّةٍ وُضِعَ مِيثَاقُ الْعِبَادِ وَ الْعَهْدُ فِيهِ وَ لَمْ يُوضَعْ فِي غَيْرِهِ وَ كَيْفَ السَّبَبُ فِي ذَلِكَ تُخْبِرُنِي جَعَلَنِيَ اللَّهُ فِدَاكَ فَإِنَّ تَفَكُّرِي فِيهِ لَعَجَبٌ", "قَالَ فَقَالَ سَأَلْتَ وَ أَعْضَلْتَ فِي الْمَسْأَلَةِ وَ اسْتَقْصَيْتَ فَافْهَمِ الْجَوَابَ وَ فَرِّغْ قَلْبَكَ وَ أَصْغِ سَمْعَكَ أُخْبِرْكَ إِنْ شَاءَ اللَّهُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى وَضَعَ الْحَجَرَ الْأَسْوَدَ وَ هِيَ جَوْهَرَةٌ أُخْرِجَتْ مِنَ الْجَنَّةِ إِلَى آدَمَ ( عليه السلام ) فَوُضِعَتْ فِي ذَلِكَ الرُّكْنِ لِعِلَّةِ الْمِيثَاقِ وَ ذَلِكَ أَنَّهُ لَمَّا أَخَذَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ حِينَ أَخَذَ اللَّهُ عَلَيْهِمُ الْمِيثَاقَ فِي ذَلِكَ الْمَكَانِ وَ فِي ذَلِكَ الْمَكَانِ تَرَاءَى لَهُمْ وَ مِنْ ذَلِكَ الْمَكَانِ يَهْبِطُ الطَّيْرُ عَلَى الْقَائِمِ ( عليه السلام )", "فَأَوَّلُ مَنْ يُبَايِعُهُ ذَلِكَ الطَّائِرُ وَ هُوَ وَ اللَّهِ جَبْرَئِيلُ ( عليه السلام ) وَ إِلَى ذَلِكَ الْمَقَامِ يُسْنِدُ الْقَائِمُ ظَهْرَهُ وَ هُوَ الْحُجَّةُ وَ الدَّلِيلُ عَلَى الْقَائِمِ وَ هُوَ الشَّاهِدُ لِمَنْ وَافَاهُ فِي ذَلِكَ الْمَكَانِ وَ الشَّاهِدُ عَلَى مَنْ أَدَّى إِلَيْهِ الْمِيثَاقَ وَ الْعَهْدَ الَّذِي أَخَذَ اللَّهُ عَزَّ وَ جَلَّ عَلَى الْعِبَادِ", "وَ أَمَّا الْقُبْلَةُ وَ الِاسْتِلَامُ فَلِعِلَّةِ الْعَهْدِ تَجْدِيداً لِذَلِكَ الْعَهْدِ وَ الْمِيثَاقِ وَ تَجْدِيداً لِلْبَيْعَةِ لِيُؤَدُّوا إِلَيْهِ الْعَهْدَ الَّذِي أَخَذَ اللَّهُ عَلَيْهِمْ فِي الْمِيثَاقِ فَيَأْتُوهُ فِي كُلِّ سَنَةٍ وَ يُؤَدُّوا إِلَيْهِ ذَلِكَ الْعَهْدَ وَ الْأَمَانَةَ اللَّذَيْنِ أُخِذَا عَلَيْهِمْ أَ لَا تَرَى أَنَّكَ تَقُولُ أَمَانَتِي أَدَّيْتُهَا وَ مِيثَاقِي تَعَاهَدْتُهُ لِتَشْهَدَ لِي بِالْمُوَافَاةِ وَ وَ اللَّهِ مَا يُؤَدِّي ذَلِكَ أَحَدٌ غَيْرُ شِيعَتِنَا وَ لَا حَفِظَ ذَلِكَ الْعَهْدَ وَ الْمِيثَاقَ أَحَدٌ غَيْرُ شِيعَتِنَا وَ إِنَّهُمْ لَيَأْتُوهُ فَيَعْرِفُهُمْ وَ يُصَدِّقُهُمْ وَ يَأْتِيهِ غَيْرُهُمْ فَيُنْكِرُهُمْ وَ يُكَذِّبُهُمْ وَ ذَلِكَ أَنَّهُ لَمْ يَحْفَظْ ذَلِكَ غَيْرُكُمْ", "فَلَكُمْ وَ اللَّهِ يَشْهَدُ وَ عَلَيْهِمْ وَ اللَّهِ يَشْهَدُ بِالْخَفْرِ وَ الْجُحُودِ وَ الْكُفْرِ وَ هُوَ الْحُجَّةُ الْبَالِغَةُ مِنَ اللَّهِ عَلَيْهِمْ يَوْمَ الْقِيَامَةِ يَجِي‏ءُ وَ لَهُ لِسَانٌ نَاطِقٌ وَ عَيْنَانِ فِي صُورَتِهِ الْأُولَى يَعْرِفُهُ الْخَلْقُ وَ لَا يُنْكِرُهُ يَشْهَدُ لِمَنْ وَافَاهُ وَ جَدَّدَ الْعَهْدَ وَ الْمِيثَاقَ عِنْدَهُ بِحِفْظِ الْعَهْدِ وَ الْمِيثَاقِ وَ أَدَاءِ الْأَمَانَةِ وَ يَشْهَدُ عَلَى كُلِّ مَنْ أَنْكَرَ وَ جَحَدَ وَ نَسِيَ الْمِيثَاقَ بِالْكُفْرِ وَ الْإِنْكَارِ", "فَأَمَّا عِلَّةُ مَا أَخْرَجَهُ اللَّهُ مِنَ الْجَنَّةِ فَهَلْ تَدْرِي مَا كَانَ الْحَجَرُ قُلْتُ لَا قَالَ كَانَ مَلَكاً مِنْ عُظَمَاءِ الْمَلَائِكَةِ عِنْدَ اللَّهِ فَلَمَّا أَخَذَ اللَّهُ مِنَ الْمَلَائِكَةِ الْمِيثَاقَ كَانَ أَوَّلَ مَنْ آمَنَ بِهِ وَ أَقَرَّ ذَلِكَ الْمَلَكُ فَاتَّخَذَهُ اللَّهُ أَمِيناً عَلَى جَمِيعِ خَلْقِهِ فَأَلْقَمَهُ الْمِيثَاقَ وَ أَوْدَعَهُ عِنْدَهُ وَ اسْتَعْبَدَ الْخَلْقَ أَنْ يُجَدِّدُوا عِنْدَهُ فِي كُلِّ سَنَةٍ الْإِقْرَارَ بِالْمِيثَاقِ وَ الْعَهْدِ الَّذِي أَخَذَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِمْ", "ثُمَّ جَعَلَهُ اللَّهُ مَعَ آدَمَ فِي الْجَنَّةِ يُذَكِّرُهُ الْمِيثَاقَ وَ يُجَدِّدُ عِنْدَهُ الْإِقْرَارَ فِي كُلِّ سَنَةٍ فَلَمَّا عَصَى آدَمُ وَ أُخْرِجَ مِنَ الْجَنَّةِ أَنْسَاهُ اللَّهُ الْعَهْدَ وَ الْمِيثَاقَ الَّذِي أَخَذَ اللَّهُ عَلَيْهِ وَ عَلَى وُلْدِهِ لِمُحَمَّدٍ ( صلى الله عليه وآله ) وَ لِوَصِيِّهِ ( عليه السلام ) وَ جَعَلَهُ تَائِهاً حَيْرَانَ", "فَلَمَّا تَابَ اللَّهُ عَلَى آدَمَ حَوَّلَ ذَلِكَ الْمَلَكَ فِي صُورَةِ دُرَّةٍ بَيْضَاءَ فَرَمَاهُ مِنَ الْجَنَّةِ إِلَى آدَمَ ( عليه السلام ) وَ هُوَ بِأَرْضِ الْهِنْدِ فَلَمَّا نَظَرَ إِلَيْهِ آنَسَ إِلَيْهِ وَ هُوَ لَا يَعْرِفُهُ بِأَكْثَرَ مِنْ أَنَّهُ جَوْهَرَةٌ وَ أَنْطَقَهُ اللَّهُ عَزَّ وَ جَلَّ فَقَالَ لَهُ يَا آدَمُ أَ تَعْرِفُنِي قَالَ لَا قَالَ أَجَلْ اسْتَحْوَذَ عَلَيْكَ الشَّيْطَانُ فَأَنْسَاكَ ذِكْرَ رَبِّكَ ", "ثُمَّ تَحَوَّلَ إِلَى صُورَتِهِ الَّتِي كَانَ مَعَ آدَمَ فِي الْجَنَّةِ فَقَالَ لآِدَمَ أَيْنَ الْعَهْدُ وَ الْمِيثَاقُ فَوَثَبَ إِلَيْهِ آدَمُ وَ ذَكَرَ الْمِيثَاقَ وَ بَكَى وَ خَضَعَ لَهُ وَ قَبَّلَهُ وَ جَدَّدَ الْإِقْرَارَ بِالْعَهْدِ وَ الْمِيثَاقِ ثُمَّ حَوَّلَهُ اللَّهُ عَزَّ وَ جَلَّ إِلَى جَوْهَرَةِ الْحَجَرِ دُرَّةً بَيْضَاءَ صَافِيَةً تُضِي‏ءُ", "فَحَمَلَهُ آدَمُ ( عليه السلام ) عَلَى عَاتِقِهِ إِجْلَالًا لَهُ وَ تَعْظِيماً فَكَانَ إِذَا أَعْيَا حَمَلَهُ عَنْهُ جَبْرَئِيلُ ( عليه السلام ) حَتَّى وَافَى بِهِ مَكَّةَ فَمَا زَالَ يَأْنَسُ بِهِ بِمَكَّةَ وَ يُجَدِّدُ الْإِقْرَارَ لَهُ كُلَّ يَوْمٍ وَ لَيْلَةٍ ثُمَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا بَنَى الْكَعْبَةَ وَضَعَ الْحَجَرَ فِي ذَلِكَ الْمَكَانِ لِأَنَّهُ تَبَارَكَ وَ تَعَالَى حِينَ أَخَذَ الْمِيثَاقَ مِنْ وُلْدِ آدَمَ أَخَذَهُ فِي ذَلِكَ الْمَكَانِ وَ فِي ذَلِكَ الْمَكَانِ أَلْقَمَ الْمَلَكَ الْمِيثَاقَ وَ لِذَلِكَ وَضَعَ فِي ذَلِكَ الرُّكْنِ", "وَ نَحَّى آدَمَ مِنْ مَكَانِ الْبَيْتِ إِلَى الصَّفَا وَ حَوَّاءَ إِلَى الْمَرْوَةِ وَ وَضَعَ الْحَجَرَ فِي ذَلِكَ الرُّكْنِ فَلَمَّا نَظَرَ آدَمُ مِنَ الصَّفَا وَ قَدْ وُضِعَ الْحَجَرُ فِي الرُّكْنِ كَبَّرَ اللَّهَ وَ هَلَّلَهُ وَ مَجَّدَهُ فَلِذَلِكَ جَرَتِ السُّنَّةُ بِالتَّكْبِيرِ وَ اسْتِقْبَالِ الرُّكْنِ الَّذِي فِيهِ الْحَجَرُ مِنَ الصَّفَا", "فَإِنَّ اللَّهَ أَوْدَعَهُ الْمِيثَاقَ وَ الْعَهْدَ دُونَ غَيْرِهِ مِنَ الْمَلَائِكَةِ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا أَخَذَ الْمِيثَاقَ لَهُ بِالرُّبُوبِيَّةِ وَ لِمُحَمَّدٍ ( صلى الله عليه وآله ) بِالنُّبُوَّةِ وَ لِعَلِيٍّ ( عليه السلام ) بِالْوَصِيَّةِ اصْطَكَّتْ فَرَائِصُ الْمَلَائِكَةِ فَأَوَّلُ مَنْ أَسْرَعَ إِلَى الْإِقْرَارِ ذَلِكَ الْمَلَكُ لَمْ يَكُنْ فِيهِمْ أَشَدُّ حُبّاً لِمُحَمَّدٍ وَ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) مِنْهُ وَ لِذَلِكَ اخْتَارَهُ اللَّهُ مِنْ بَيْنِهِمْ وَ أَلْقَمَهُ الْمِيثَاقَ وَ هُوَ يَجِي‏ءُ يَوْمَ الْقِيَامَةِ وَ لَهُ لِسَانٌ نَاطِقٌ وَ عَيْنٌ نَاظِرَةٌ يَشْهَدُ لِكُلِّ مَنْ وَافَاهُ إِلَى ذَلِكَ الْمَكَانِ وَ حَفِظَ الْمِيثَاقَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, and someone else, from Muhammad Bin Ahmad, from Musa Bin Umar, from Ibn Sinan, from Abu Saeed Al Qammat, from Bukeyr Bin Ayn who said, ", "‘I asked Abu Abdullah<sup>asws</sup>, ‘For which reason did Allah<sup>azwj</sup> Place the (Black) Stone in the corner in which it is (found to be) in, and did not Place it in other than it, and for which reason does one kiss (it), and for which reason was it brought out from the Paradise, and for which reason was the Covenant of the servant and the oath Placed in it and was not Placed in other than it, and what is the reason regarding that. You<sup>asws</sup> inform me, may I be sacrificed for you<sup>asws</sup>, for my thinking with regards to it is strange’.", "He (the narrator) said, ‘So he<sup>asws</sup> said: ‘You asked and complicated yourself in the problem, and you investigated, therefore understand the answer and free your heart and intent your listening. I<sup>asws</sup> shall inform you, Allah<sup>azwj</sup> Willing. Allah<sup>azwj</sup> Blessed and High Placed the Black Stone and it was a jewel from Paradise brought out to Adam<sup>as</sup>. Thus, it was Placed in that corner due to the reason of the Covenant, and that is because when the offspring of the Children of Adam<sup>as</sup> were Taken from the backs, when the Covenant was Taken upon them in that place, and it is in that place it was Shown to them, and it is from that place the bird shall descend upon Al-Qaim<sup>asws</sup>. ", "So the first one to pledge allegiance would be that bird, and by Allah<sup>azwj</sup>, it is Jibraeel<sup>as</sup>, and it is to that place Al-Qaim<sup>asws</sup> would assign his<sup>asws</sup> appearance, and it is the Proof and the evidence upon Al-Qaim<sup>asws</sup>, it is a witness to the one who are loyal to it in that place, and the witness upon the ones who fulfill the Covenant to it, and the promise which Allah<sup>azwj</sup> Mighty and Majestic Took upon the servants. ", "And as for the kissing and the submitting, so it is due to the reason of the promise and the renewal of that promise and the Covenant, and renewal of the allegiance in order to fulfil the promise to it which Allah<sup>azwj</sup> Took upon them in the Covenant. Therefore, they would be coming to it during every year and would be repeating that promise to it, and the entrustment which was Taken upon them. Do you not see that you are saying, ‘My entrustment I have fulfilled it, and my Covenant I have promised it in order for you to testify for me with the loyalty’? ", "And, by Allah<sup>azwj</sup>! No one apart from you Shias of ours<sup>asws</sup> are fulfilling that, nor is anyone preserving that promise, and the Covenant, anyone apart from our<sup>asws</sup> Shias, and they are coming to it, so it is recognising them and ratifying them; and when the others are coming to it, so it is denying that and belying them, and that is because it has not been preserved by other than you (Shias). ", "By Allah<sup>azwj</sup>, it would testify for you, and by Allah<sup>azwj</sup> it would testify against them with the disregard, and the ingratitude, and the disbelief; and it would be the eloquent Proof from Allah<sup>azwj</sup> against them on the Day of Judgement. It would come, and for it would be a speaking tongue, and two eyes in its former face. The creatures would recognise it and would not deny it. It would testify for the ones who were loyal to it and renewed the promise and the Covenant in its presence. ", "It preserves the promise and the Covenant and the fulfilment of the entrustment. And it would testify against everyone who denied, and strived against, and forgot the Covenant with the disbelief, and the denial. ", "So, as for the reason why Allah<sup>azwj</sup> had it to be brought out from the Paradise, so do you know what the (Black) stone was?’ I said, ‘No’. He<sup>asws</sup> said: ‘It was an Angel from the great Angels in the Presence of Allah<sup>azwj</sup>. So when Allah<sup>azwj</sup> Took the Covenant from the Angels, and the first one to believe in it, and accept was that Angel. So Allah<sup>azwj</sup> Took it as a trustsee upon the entirety of His<sup>azwj</sup> creatures. So He<sup>azwj</sup> Caused it to devour the Covenant, and Entrusted it inside it, and Commanded the creatures that they should be renewing it in its presence during every year, accepting with the Covenant and the promise which Allah<sup>azwj</sup> Mighty and Majestic Took upon them. ", "Then Allah<sup>azwj</sup> Made it to be with Adam<sup>as</sup> in the Paradise, reminding him<sup>as</sup> of the Covenant, and he<sup>as</sup> used to renew the acceptance in its presence during every year. So when Adam<sup>as</sup> disobeyed and came out from the Paradise, Allah<sup>azwj</sup> Caused him<sup>as</sup> to forget the promise and the Covenant which Allah<sup>azwj</sup> had Taken upon him<sup>as</sup> and upon his<sup>as</sup> children, for Muhammad<sup>saww</sup>, and for his<sup>saww</sup> successor<sup>asws</sup>, and Made him<sup>as</sup> to be wandering, confused.", "So when Allah<sup>azwj</sup> Turned to Adam<sup>as</sup> (with Mercy and Forgiveness), Changed that Angel to be in the image of a white pearl, and had is cast from the Paradise to Adam<sup>as</sup>, and it was in the land of India. So when he<sup>as</sup> looked at it, he<sup>as</sup> felt love towards it, and he<sup>as</sup> did not recognise it, mostly because it was a jewel. And Allah<sup>azwj</sup> Mighty and Majestic Caused it to speak, so it said to him<sup>as</sup>: ‘O Adam<sup>as</sup>! Do you<sup>as</sup> recognise me?’ He<sup>as</sup> said: ‘No’. It said, ‘The Satan<sup>la</sup> overcame upon you<sup>as</sup>, so he<sup>la</sup> made you<sup>as</sup> forget the remembrance of your<sup>as</sup> Lord<sup>azwj</sup>’. ", "Then it transformed itself to its image which it had when it was with Adam<sup>as</sup> in the Paradise. So it said to Adam<sup>as</sup>: ‘Where is the promise and the Covenant?’ So Adam<sup>as</sup> leapt to it and remembered the Covenant, and wept, and he<sup>as</sup> threw himself<sup>as</sup> at it, and kissed it, and renewed the acceptance with the promise and the Covenant. Then Allah<sup>azwj</sup> Mighty and Majestic Changed it to the essence of the stone, being a white pearl, clear, illuminating. ", "So Adam<sup>as</sup> carried it upon his<sup>as</sup> shoulder due to its majesty for it, and its reverence. So whenever he<sup>as</sup> was exhausted, Jibraeel<sup>as</sup> would carry it on his<sup>as</sup> behalf until he<sup>as</sup> arrived at Makkah with it. So he<sup>as</sup> did not cease to love it in Makkah, and he<sup>as</sup> would renew the acceptance to it every day and night. Then when Allah<sup>azwj</sup> Mighty and Majestic Built the Kaaba, Placed the Stone in that place because, when Allah<sup>azwj</sup> Mighty and Majestic Took the Covenant from the Children of Adam<sup>as</sup>, Took it in that place, and in that place the Angel devoured the Covenant, and due to that it was placed in that corner.", "And Adam<sup>as</sup> moved away from the place of the House (Kaaba) to Al-Safa, and Hawwa<sup>as</sup> to Al-Marwa, and the Stone was place in that corner. So when Adam<sup>as</sup> looked from Al-Safa, and the Stone had illuminated in the corner, he exclaimed the Greatness of Allah<sup>azwj</sup> (<span class=\"iTxt\">Takbeer</span>), and extolled Him<sup>azwj</sup>, and Glorified Him<sup>azwj</sup>. Thus, it was due to that the Sunnah flowed with the <span class=\"iTxt\">Takbeer</span>, and the welcoming the corner wherein is the (Black) Stone, from Al-Safa.", "Therefore, Allah<sup>azwj</sup> Entrusted the Covenant, and the promise with it apart from others from the Angels because when Allah<sup>azwj</sup> Mighty and Majestic Took the Covenant for Himself<sup>azwj</sup> for the Lordship, and for Muhammad<sup>saww</sup> with the Prophet-hood, and for Ali<sup>asws</sup> with the successorship, the Angels trembled in awe, and the first one from them who hastened to the acceptance was that Angel. There has never happened to be among them anyone more intense for his love of Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> than him, and due to that Allah<sup>azwj</sup> Chose him from between them, and Caused him to devour the Covenant, and he would be coming on the Day of Judgement, and for him would be a speaking tongue, and seeing eyes. He would be testifying for every one who had been loyal to it at that place, and preserved the Covenant’."]}}]}, "index": "al-kafi:4:3:1", "kind": "verse_list"}