{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 10"}, "path": "/books/al-kafi:4:3:10", "titles": {"ar": "بَابٌ فِي قَوْلِهِ تَعَالَى فِيهِ آياتٌ بَيِّناتٌ", "en": "Chapter 10 – Regarding the Words of the Exalted [3:97] In it are clear Signs"}}], "index": 953, "local_index": 10, "part_type": "Chapter", "path": "/books/al-kafi:4:3:10", "titles": {"ar": "بَابٌ فِي قَوْلِهِ تَعَالَى فِيهِ آياتٌ بَيِّناتٌ", "en": "Chapter 10 – Regarding the Words of the Exalted [3:97] In it are clear Signs"}, "verse_count": 2, "verse_start_index": 6729, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6730, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:10:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ ابْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبارَكاً وَ هُدىً لِلْعالَمِينَ فِيهِ آياتٌ بَيِّناتٌ مَا هَذِهِ الْآيَاتُ الْبَيِّنَاتُ قَالَ مَقَامُ إِبْرَاهِيمَ حَيْثُ قَامَ عَلَى الْحَجَرِ فَأَثَّرَتْ فِيهِ قَدَمَاهُ وَ الْحَجَرُ الْأَسْوَدُ وَ مَنْزِلُ إِسْمَاعِيلَ ( عليه السلام ) ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Hassan Bin Mahboub, from Ibn Sinan who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the Words of the Mighty and Majestic <span class=\"ibTxt\">[3:96] Surely, the first House Appointed for the people is the one at Bekka, Blessed and a Guidance for the nations [3:97] In it are clear Signs</span>. What are these clear Signs?’ He<sup>asws</sup> said: ‘The Standing Place of Ibrahim<sup>as</sup> where he<sup>as</sup> stood at the (Black) Stone, so his<sup>as</sup> feet made an impact in it, and the Black Stone, and the house of Ismail<sup>as</sup>’."]}}, {"index": 6731, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:10:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) قَدْ أَدْرَكْتَ الْحُسَيْنَ ( عليه السلام ) قَالَ نَعَمْ أَذْكُرُ وَ أَنَا مَعَهُ فِي الْمَسْجِدِ الْحَرَامِ وَ قَدْ دَخَلَ فِيهِ السَّيْلُ وَ النَّاسُ يَقُومُونَ عَلَى الْمَقَامِ يَخْرُجُ الْخَارِجُ يَقُولُ قَدْ ذَهَبَ بِهِ السَّيْلُ وَ يَخْرُجُ مِنْهُ الْخَارِجُ فَيَقُولُ هُوَ مَكَانَهُ", "قَالَ فَقَالَ لِي يَا فُلَانُ مَا صَنَعَ هَؤُلَاءِ فَقُلْتُ أَصْلَحَكَ اللَّهُ يَخَافُونَ أَنْ يَكُونَ السَّيْلُ قَدْ ذَهَبَ بِالْمَقَامِ فَقَالَ نَادِ أَنَّ اللَّهَ تَعَالَى قَدْ جَعَلَهُ عَلَماً لَمْ يَكُنْ لِيَذْهَبَ بِهِ فَاسْتَقِرُّوا", "وَ كَانَ مَوْضِعُ الْمَقَامِ الَّذِي وَضَعَهُ إِبْرَاهِيمُ ( عليه السلام ) عِنْدَ جِدَارِ الْبَيْتِ فَلَمْ يَزَلْ هُنَاكَ حَتَّى حَوَّلَهُ أَهْلُ الْجَاهِلِيَّةِ إِلَى الْمَكَانِ الَّذِي هُوَ فِيهِ الْيَوْمَ فَلَمَّا فَتَحَ النَّبِيُّ ( صلى الله عليه وآله ) مَكَّةَ رَدَّهُ إِلَى الْمَوْضِعِ الَّذِي وَضَعَهُ إِبْرَاهِيمُ ( عليه السلام ) فَلَمْ يَزَلْ هُنَاكَ إِلَى أَنْ وَلِيَ عُمَرُ بْنُ الْخَطَّابِ فَسَأَلَ النَّاسَ مَنْ مِنْكُمْ يَعْرِفُ الْمَكَانَ الَّذِي كَانَ فِيهِ الْمَقَامُ فَقَالَ رَجُلٌ أَنَا قَدْ كُنْتُ أَخَذْتُ مِقْدَارَهُ بِنِسْعٍ فَهُوَ عِنْدِي فَقَالَ ائْتِنِي بِهِ فَأَتَاهُ بِهِ فَقَاسَهُ ثُمَّ رَدَّهُ إِلَى ذَلِكَ الْمَكَانِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zurara who said, ", "‘I said to Abu Ja’far<sup>asws</sup>, ‘Did you<sup>asws</sup> meet Al-Husayn<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Yes. I<sup>asws</sup> remember him<sup>asws</sup>, and I<sup>asws</sup> was with him<sup>asws</sup> in the Sacred Masjid, and the flood had entered into it, and the people were standing upon the Standing Place (of Ibrahim<sup>as</sup>). Someone coming out was saying, ‘The flood has swept it away’, and someone coming out was saying, ‘It is (still) in its place’.  ", "He (the narrator) said, ‘So he<sup>asws</sup> said to me: ‘O so and so! What are they making of it?’ So I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! They are fearing that the torrent may have swept away the Standing Place (of Ibrahim<sup>as</sup>)’. So he<sup>asws</sup>said: ‘Announce that Allah<sup>azwj</sup> the Exalted has Made it as a flag, it cannot happen that it would be gone away with, therefore, be calm. ", "And the place of the Standing Place (of Ibrahim<sup>as</sup>) is that which Ibrahim<sup>as</sup> had placed it by the wall of the House. So it did not cease to be over there until the people of the Pre-Islamic period transferred it to the place in which it is in today. So when the Prophet<sup>saww</sup> conquered Makkah, he<sup>saww</sup> returned it to the place where Ibrahim<sup>as</sup> had (originally) placed it. So it did not cease to be over there until the rule of Umar Bin Al-Khattab. So he asked, ‘Who are the ones from you who recognise the place which the Standing Place (of Ibrahim<sup>as</sup>) used to be in?’ So a man said, ‘I do. I had taken its measurement with a belt, so it is with me’. So he said, ‘Come to me with it’. So he went to him with it. So he (Umar) measured it, then returned it to that place (of the Pre-Islamic period)’."]}}]}, "index": "al-kafi:4:3:10", "kind": "verse_list"}