{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 100"}, "path": "/books/al-kafi:4:3:100", "titles": {"ar": "بَابُ الْمُحْرِمِ يَمُوتُ", "en": "Chapter 100 – The one in Ihraam dies"}}], "index": 1043, "local_index": 100, "part_type": "Chapter", "path": "/books/al-kafi:4:3:100", "titles": {"ar": "بَابُ الْمُحْرِمِ يَمُوتُ", "en": "Chapter 100 – The one in Ihraam dies"}, "verse_count": 4, "verse_start_index": 7307, "verses": [{"index": 7308, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:100:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ ابْنِ أَبِي حَمْزَةَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي الْمُحْرِمِ يَمُوتُ قَالَ يُغَسَّلُ وَ يُكَفَّنُ وَ يُغَطَّى وَجْهُهُ وَ لَا يُحَنَّطُ وَ لَا يُمَسُّ شَيْئاً مِنَ الطِّيبِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Ibn Abu Hamza, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding the one in <span class=\"iTxt\">Ihraam</span> dying. He<sup>asws</sup> said: ‘He would be washed, and enshrouded, and his face would be covered. Neither would he be embalmed nor touched by anything from the perfumes’."}]}, {"index": 7309, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:100:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ الْمُحْرِمِ يَمُوتُ قَالَ يُغَسَّلُ وَ يُكَفَّنُ بِالثِّيَابِ كُلِّهَا يُصْنَعُ بِهِ كَمَا يُصْنَعُ بِالْمُحِلِّ غَيْرَ أَنَّهُ لَا يُمَسُّ الطِّيبَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, \n‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span>, dying’. He<sup>asws</sup> said: ‘He would be washed and can be enshrouded with the clothes, all of them. He would be dealt with just as the one not in <span class=\"iTxt\">Ihraam</span> is dealt with, apart from that he would not be touched with the perfume’."}]}, {"index": 7310, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:100:3", "text": "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي مَرْيَمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تُوُفِّيَ عَبْدُ الرَّحْمَنِ بْنُ الْحَسَنِ بْنِ عَلِيٍّ بِالْأَبْوَاءِ وَ هُوَ مُحْرِمٌ وَ مَعَهُ الْحَسَنُ وَ الْحُسَيْنُ وَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ وَ عَبْدُ اللَّهِ وَ عُبَيْدُ اللَّهِ ابْنَا الْعَبَّاسِ فَكَفَّنُوهُ وَ خَمَّرُوا وَجْهَهُ وَ رَأْسَهُ وَ لَمْ يُحَنِّطُوهُ وَ قَالَ هَكَذَا فِي كِتَابِ عَلِيٍّ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad, from Ahmad Bin Muhammad, from Ibn Fazzal, from Yunus Bin Yaqoub, from Abu Maryam, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, having said: ‘Abdul Rahman Bin Al-Hassan Bin Ali died at Al-Abwa and he was in <span class=\"iTxt\">Ihraam</span>, and with him were Al-Hassa, Al-Husayn, and Abdullah Bin Ja’far, and Abdullah, and Ubeydullah, the two sons of Al-Abbas. So they enshrouded him, and covered his face and his dead, and did not embalm him’. And he<sup>asws</sup> said: ‘This is how it is in the Book of Ali<sup>asws</sup>’."}]}, {"index": 7311, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:100:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْمَرْأَةِ الْمُحْرِمَةِ تَمُوتُ وَ هِيَ طَامِثٌ قَالَ لَا تُمَسَّ الطِّيبَ وَ إِنْ كُنَّ مَعَهَا نِسْوَةٌ حَلَالٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah Bin Hilal, from Abdullah Bin Jabala, from Is’haq Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the woman in <span class=\"iTxt\">Ihraam</span>, dying, and she is in her menstruation. He<sup>asws</sup> said: ‘The perfume should not touch her and even if there were (other) women with her who were not in <span class=\"iTxt\">Ihraam</span>’."}]}]}, "index": "al-kafi:4:3:100", "kind": "verse_list"}