{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 103"
        },
        "path": "/books/al-kafi:4:3:103",
        "titles": {
          "ar": "بَابُ الْمُحْرِمِ يُوَاقِعُ امْرَأَتَهُ قَبْلَ أَنْ يَقْضِيَ مَنَاسِكَهُ أَوْ مُحِلٍّ يَقَعُ عَلَى مُحْرِمَةٍ",
          "en": "Chapter 103 – The one in Ihraam falls upon his wife before he fulfils his rituals, or the one free from Ihraam falls upon a woman in Ihraam"
        }
      }
    ],
    "index": 1046,
    "local_index": 103,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 104"
        },
        "path": "/books/al-kafi:4:3:104",
        "titles": {
          "ar": "بَابُ الْمُحْرِمِ يُقَبِّلُ امْرَأَتَهُ وَ يَنْظُرُ إِلَيْهَا بِشَهْوَةٍ أَوْ غَيْرِ شَهْوَةٍ أَوْ يَنْظُرُ إِلَى غَيْرِهَا",
          "en": "Chapter 104 – The one in Ihraam kisses his wife and he looks at her with desire, or without desire, or he looks at someone else"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 102"
        },
        "path": "/books/al-kafi:4:3:102",
        "titles": {
          "ar": "بَابُ الْمُحْرِمِ يَتَزَوَّجُ أَوْ يُزَوِّجُ وَ يُطَلِّقُ وَ يَشْتَرِي الْجَوَارِيَ",
          "en": "Chapter 102 – The one in Ihraam gets married, or marries and divorces, and he buys the slave girl"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:103",
    "titles": {
      "ar": "بَابُ الْمُحْرِمِ يُوَاقِعُ امْرَأَتَهُ قَبْلَ أَنْ يَقْضِيَ مَنَاسِكَهُ أَوْ مُحِلٍّ يَقَعُ عَلَى مُحْرِمَةٍ",
      "en": "Chapter 103 – The one in Ihraam falls upon his wife before he fulfils his rituals, or the one free from Ihraam falls upon a woman in Ihraam"
    },
    "verse_count": 7,
    "verse_start_index": 7328,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/346)"
        ],
        "index": 7329,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/190",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:103:1",
        "text": [
          " سَأَلْتُهُ عَنْ مُحْرِمٍ غَشِيَ امْرَأَتَهُ وَ هِيَ مُحْرِمَةٌ قَالَ جَاهِلَيْنِ أَوْ عَالِمَيْنِ قُلْتُ أَجِبْنِي فِي الْوَجْهَيْنِ جَمِيعاً قَالَ إِنْ كَانَا جَاهِلَيْنِ اسْتَغْفَرَا رَبَّهُمَا وَ مَضَيَا عَلَى حَجِّهِمَا وَ لَيْسَ عَلَيْهِمَا شَيْ‏ءٌ وَ إِنْ كَانَا عَالِمَيْنِ فُرِّقَ بَيْنَهُمَا مِنَ الْمَكَانِ الَّذِي أَحْدَثَا فِيهِ وَ عَلَيْهِمَا بَدَنَةٌ وَ عَلَيْهِمَا الْحَجُّ مِنْ قَابِلٍ فَإِذَا بَلَغَا الْمَكَانَ الَّذِي أَحْدَثَا فِيهِ فُرِّقَ بَيْنَهُمَا حَتَّى يَقْضِيَا نُسُكَهُمَا وَ يَرْجِعَا إِلَى الْمَكَانِ الَّذِي أَصَابَا فِيهِ مَا أَصَابَا ",
          "قُلْتُ فَأَيُّ الْحَجَّتَيْنِ لَهُمَا قَالَ الْأُولَى الَّتِي أَحْدَثَا فِيهَا مَا أَحْدَثَا وَ الْأُخْرَى عَلَيْهِمَا عُقُوبَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Zurara who said, ",
            "‘I asked him<sup>asws</sup> about one in <span class=\"iTxt\">Ihraam</span> overwhelming his wife and she is in <span class=\"iTxt\">Ihraam</span>. He<sup>asws</sup> said: ‘Were they both ignorant or knowing?’ I said, ‘Answer me regarding the two aspects together’. He<sup>asws</sup> said: ‘If they were both ignorant, they would both seek Forgiveness of their Lord<sup>azwj</sup> and fulfil their rituals upon their Hajj, and there would not be anything upon them. But, if they were both knowing, separation would be effected between the two of them from the place wherein the occurrence took place, and upon them both would be a sacrificial animal (each), and upon them would be the performance of the Hajj the next year. So when they reach the place in which they had acted so, separation would be effected between them until they both fulfill their rituals, and they return back to the place in which they attained that which they attained’. ",
            "I said, ‘So which of the two Hajj is for them?’ He<sup>asws</sup> said: ‘The first in which they did what they did, and the other would be upon them as a Punishment’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from Zurarah who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about a man who in the state of Ihram performs sexual relation with his wife who also is in the state of Ihram. He (the Imam) asked, ’Do they know or they are ignorant?’ I replied, ’It is not known altogether.’ He (the Imam) said, ‘If they are ignorant, they must ask forgiveness and continue their al-Hajj and there is nothing on them. If they know they must separate at that place where it has happened. They owe one badanah each and al-Hajj in future. When they reach that place where it happened, they must separate from each other until they complete all acts of al-Hajj and return to the place where it had happened.’ I then asked, ‘Which of the two al- Hajj is for them?’ He (the Imam) said, ‘It is the first al-Hajj in which they did what they did and the other al-Hajj is a penalty upon them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/348)"
        ],
        "index": 7330,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/55",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ إِلَى "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/497",
              "text": "أَحَدِهِمَا ( عليهما السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ أَبَانِ بْنِ عُثْمَانَ رَفَعَهُ إِلَى أَحَدِهِمَا ( عليهما السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:103:2",
        "text": [
          " مَعْنَى يُفَرَّقُ بَيْنَهُمَا أَيْ لَا يَخْلُوَانِ وَ أَنْ يَكُونَ مَعَهُمَا ثَالِثٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Hammad, from Aban Bin Usman, ",
            "(It has been narrated) raising it to one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The meaning of ‘effecting separation between the two)’, i.e.. They both should not be together without there happening to be a third person along with them’."
          ],
          "en.sarwar": [
            "2. Ali has narrated from his father from Hammad from Aban ibn ‘Uthman in a marfu‘ manner who has said the following: “One of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘The meaning of separating them is that they must not stay together without a third person being with them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/348)"
        ],
        "index": 7331,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/142",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ صَفْوَانَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:103:3",
        "text": [
          " الْمُحْرِمِ يَقَعُ عَلَى أَهْلِهِ قَالَ إِنْ كَانَ أَفْضَى إِلَيْهَا فَعَلَيْهِ بَدَنَةٌ وَ الْحَجُّ مِنْ قَابِلٍ وَ إِنْ لَمْ يَكُنْ أَفْضَى إِلَيْهَا فَعَلَيْهِ بَدَنَةٌ وَ لَيْسَ عَلَيْهِ الْحَجُّ مِنْ قَابِلٍ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ وَقَعَ عَلَى امْرَأَتِهِ وَ هُوَ مُحْرِمٌ قَالَ إِنْ كَانَ جَاهِلًا فَلَيْسَ عَلَيْهِ شَيْ‏ءٌ وَ إِنْ لَمْ يَكُنْ جَاهِلًا فَعَلَيْهِ سَوْقُ بَدَنَةٍ وَ عَلَيْهِ الْحَجُّ مِنْ قَابِلٍ فَإِذَا انْتَهَى إِلَى الْمَكَانِ الَّذِي وَقَعَ بِهَا فُرِّقَ مَحْمِلُهُمَا فَلَمْ يَجْتَمِعَا فِي خِبَاءٍ وَاحِدٍ إِلَّا أَنْ يَكُونَ مَعَهُمَا غَيْرُهُمَا حَتَّى يَبْلُغَ الْهَدْيُ مَحِلَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, and Safwan, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the one in <span class=\"iTxt\">Ihraam</span> falling upon his wife. He<sup>asws</sup> said: ‘If he has gone into her, so upon him would be a sacrificial animal, and he (performing of the) Hajj the next year. And if he had not gone into her, so upon him would be a sacrificial animal, and there would not be a Hajj upon him the next year’. ",
            "He (the narrator) said, ‘I asked him<sup>asws</sup> about a man who falls upon his wife, and he is in <span class=\"iTxt\">Ihraam</span>. He<sup>asws</sup> said: ‘If he was ignorant, so there is nothing upon him; and if he did not happen to be ignorant, so upon him would be ushering of a sacrificial animal, and upon him would be the Hajj next year. So when he ends up to the place where he fell upon her, separation would be effect between their two carriages, so they would not be gathered in one tent unless there happens to be someone else along with the two of them, until the sacrificial animal reaches its place’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Ahmad ibn Muhammad from Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from ibn abu ‘Umayr and Safwan from Mu‘awiyah ibn ‘Ammar who has said the following: “About a man who is in the state of Ihram and performs sexual relation with his wife, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If intercourse has taken place, he owes a badanah and al-Hajj in future; if it has not taken place, he owes one badanah but not al-Hajj in future.’ I then asked, about a man who performs sexual relation with his wife while he is in the state of Ihram. He (the Imam) said, ‘If he does not know the rule he does not owe anything. If he is not ignorant, then he must drive a badanah and he owes al-Hajj in future. When he arrives at the place where it had happened they must separate from each other’s carriage and must not sit together in one tent unless there is a third person present with them until the offering reaches its place.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/348)"
        ],
        "index": 7332,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:103:4",
        "text": [
          " قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) رَجُلٌ وَقَعَ عَلَى أَهْلِهِ وَ هُوَ مُحْرِمٌ قَالَ أَ جَاهِلٌ أَوْ عَالِمٌ قَالَ قُلْتُ جَاهِلٌ قَالَ يَسْتَغْفِرُ اللَّهَ وَ لَا يَعُودُ وَ لَا شَيْ‏ءَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moallah Bin Muhammad, from Al Hassan Bin Ali, from Aban Bin Usman, from Zurara who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘A man falls upon his wife and he is in <span class=\"iTxt\">Ihraam</span>’. He<sup>asws</sup> said: ‘Are they both ignorant of knowing?’ I said, ‘Ignorant’. He<sup>asws</sup> said: ‘He should seek Forgiveness of Allah<sup>azwj</sup>, and he should not repeat, and there would be nothing upon him’."
          ],
          "en.sarwar": [
            "4. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali from Aban ibn ‘Uthman from Zurarah who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, about a man who is in the state of Ihram and is involved in sexual relation with his wife. He (the Imam) asked, ‘Is he informed or ignorant?’ I replied, ‘He is ignorant.’ He (the Imam) said, ‘He must ask forgiveness, must not repeat and there is nothing on him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/349)"
        ],
        "index": 7333,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/162",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:103:5",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ مُحْرِمٍ وَاقَعَ أَهْلَهُ فَقَالَ قَدْ أَتَى عَظِيماً قُلْتُ أَفْتِنِي فَقَالَ اسْتَكْرَهَهَا أَوْ لَمْ يَسْتَكْرِهْهَا قُلْتُ أَفْتِنِي فِيهِمَا جَمِيعاً ",
          "فَقَالَ إِنْ كَانَ اسْتَكْرَهَهَا فَعَلَيْهِ بَدَنَتَانِ وَ إِنْ لَمْ يَكُنِ اسْتَكْرَهَهَا فَعَلَيْهِ بَدَنَةٌ وَ عَلَيْهَا بَدَنَةٌ وَ يَفْتَرِقَانِ مِنَ الْمَكَانِ الَّذِي كَانَ فِيهِ مَا كَانَ حَتَّى يَنْتَهِيَا إِلَى مَكَّةَ وَ عَلَيْهِمَا الْحَجُّ مِنْ قَابِلٍ لَا بُدَّ مِنْهُ ",
          "قَالَ قُلْتُ فَإِذَا انْتَهَيَا إِلَى مَكَّةَ فَهِيَ امْرَأَتُهُ كَمَا كَانَتْ فَقَالَ نَعَمْ هِيَ امْرَأَتُهُ كَمَا هِيَ فَإِذَا انْتَهَيَا إِلَى الْمَكَانِ الَّذِي كَانَ مِنْهُمَا مَا كَانَ افْتَرَقَا حَتَّى يُحِلَّا فَإِذَا أَحَلَّا فَقَدِ انْقَضَى عَنْهُمَا فَإِنَّ أَبِي كَانَ يَقُولُ ذَلِكَ ",
          "وَ فِي رِوَايَةٍ أُخْرَى فَإِنْ لَمْ يَقْدِرْ عَلَى بَدَنَةٍ فَإِطْعَامُ سِتِّينَ مِسْكِيناً لِكُلِّ مِسْكِينٍ مُدٌّ فَإِنْ لَمْ يَقْدِرْ فَصِيَامُ ثَمَانِيَةَ عَشَرَ يَوْماً وَ عَلَيْهَا أَيْضاً كَمِثْلِهِ إِنْ لَمْ يَكُنِ اسْتَكْرَهَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about one in <span class=\"iTxt\">Ihraam</span> falling upon his wife. So he<sup>asws</sup> said: ‘He has come to a grievous matter’. I said, ‘Issue a verdict to me’. So he<sup>asws</sup> said: ‘Did he coerce (force) her or did he not coerce her?’ I said, ‘Issue a verdict regarding both together’. ",
            "So he<sup>asws</sup> said: ‘If he had coerced her, so upon him would be two sacrificial animals; and if did not happen to have coerced her, so upon him would be a sacrificial animal, and upon her would be a sacrificial animal, and they would both be separate from the place in which they did what they did, until they both end up to Makkah, and upon them both would be the Hajj of the next year, it being inevitable from it’. ",
            "He (the narrator) said, ‘I said, ‘So when they both end up to Makkah, so she would still be his wife just as she used to be?’ So he<sup>asws</sup> said: ‘Yes. She would be his wife just as she used to be. So when they both end up to the place which from the two of them was what was, separated would be effected between them until they were free from their <span class=\"iTxt\">Ihraam</span>. So it would have been ended from them. My<sup>asws</sup> father<sup>asws</sup> was saying that’. ",
            "And in another report, ‘(He<sup>asws</sup> said): ‘So if he was not able upon a sacrificial animal, so he should feed sixty poor ones, for each poor one being one <span class=\"iTxt\">Mudd</span> (approximated 750 gms of food). So if he was not able, then he should Fast for eighteen days, and upon her as well would be similar to it if he did not happen to have coerced her’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who is in the state of Ihram and is involved in sexual relation with his wife. He (the Imam) said, ‘He has done a great awfull thing.’ I said, ‘Grant us a Fatwa.’ He (the Imam) said, ‘I despise it, does he not despise it?’ I then said, ‘Grant us a Fatwa about both of them.’ He (the Imam) said, ‘If she despised it, there are two badanah on him, if she did not despise, there is one badanah on him and she owes one badanah. They must stay away from each other from that place until they reach Makkah and they owe al-Hajj in future.’ I then said, ‘When they arrive in Makkah will she be his wife as before?’ He (the Imam) said, ‘Yes, she is his wife as before and when they arrive at the place where it had happened they still remain separated until they come out of the state of Ihram; it then ends. This is what my father, ‘Alayhi al-Salam, has said.’” In another Hadith it is said that if he cannot offer badanah he must feed sixty destitute people, one mud (a certain measurement) to each person, and if he cannot do this also he must fast eighteen days and the same rule applies to her case also. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/350)"
        ],
        "index": 7334,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/361",
              "text": "ابْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2184",
              "text": "صَبَّاحٍ الْحَذَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ صَبَّاحٍ الْحَذَّاءِ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:103:6",
        "text": [
          " قُلْتُ لِأَبِي الْحَسَنِ مُوسَى ( عليه السلام ) أَخْبِرْنِي عَنْ رَجُلٍ مُحِلٍّ وَقَعَ عَلَى أَمَةٍ لَهُ مُحْرِمَةٍ قَالَ مُوسِرٌ أَوْ مُعْسِرٌ قُلْتُ أَجِبْنِي فِيهِمَا قَالَ هُوَ أَمَرَهَا بِالْإِحْرَامِ أَوْ لَمْ يَأْمُرْهَا أَوْ أَحْرَمَتْ مِنْ قِبَلِ نَفْسِهَا قُلْتُ أَجِبْنِي فِيهِمَا ",
          "فَقَالَ إِنْ كَانَ مُوسِراً وَ كَانَ عَالِماً أَنَّهُ لَا يَنْبَغِي لَهُ وَ كَانَ هُوَ الَّذِي أَمَرَهَا بِالْإِحْرَامِ فَعَلَيْهِ بَدَنَةٌ وَ إِنْ شَاءَ بَقَرَةٌ وَ إِنْ شَاءَ شَاةٌ وَ إِنْ لَمْ يَكُنْ أَمَرَهَا بِالْإِحْرَامِ فَلَا شَيْ‏ءَ عَلَيْهِ مُوسِراً كَانَ أَوْ مُعْسِراً وَ إِنْ كَانَ أَمَرَهَا وَ هُوَ مُعْسِرٌ فَعَلَيْهِ دَمُ شَاةٍ أَوْ صِيَامٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Nasr, from Sabbah Al Haza’a, from Is’haq Bin Ammar who, ",
            "‘I said to Abu Al-Hassan Musa<sup>asws</sup>, ‘Inform me about a man not in <span class=\"iTxt\">Ihraam</span> falling upon a slave girl of his in <span class=\"iTxt\">Ihraam</span>’. He<sup>asws</sup> said: ‘Is he (financially) solvent or insolvent?’ I said, ‘Answer me regarding both of them’. He<sup>asws</sup> said: ‘Did he instruct her to be in <span class=\"iTxt\">Ihraam</span> or did not instruct her so? Or did she wear <span class=\"iTxt\">Ihraam</span> of her own accord?’ I said, ‘Answer me regarding both of these’. ",
            "So he<sup>asws</sup> said: ‘If he was (financially) solvent and was knowing that it is not befitting for him, and he had instructed her to be in <span class=\"iTxt\">Ihraam</span>, so upon him is a sacrificial animal; and if he so desires it, a cow, or if he so desires it, a sheep. And, if he did not happen to have instructed her with the <span class=\"iTxt\">Ihraam</span>, so there is nothing upon him, whether he was (financially) solvent or insolvent; and if he had instructed her so and he was (financially) solvent, so upon him is blood of a sheep, or Fasts’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad from ibn abu Nasr from Sabbah al-Hadhdha’ from Ishaq ibn ‘Ammar who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who is not in the state of Ihram and involves himself in sexual relation with his slave-girl who is in the state of Ihram. He (the Imam) asked, ‘Is he affluent or poor?’ I replied, ‘I am a stranger about his condition.’ He (the Imam) asked, ‘Did he command her to assume the state of Ihram or she did it on her own?’ I replied, ‘I am stranger about it.’ He (the Imam) then said, ‘If he is affluent and knowing that he must not have done so and he was the one who commanded her to assume the state of Ihram, he owes one badanah or if he likes one cow or one sheep. If he did not command her to assume the state of Ihram, he then does not owe anything, regardless of being affluent or poor, but if he had commanded her to assume the state of Ihram and he is poor, he then owes one sheep.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/350)"
        ],
        "index": 7335,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/176",
              "text": "سُلَيْمَانَ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:103:7",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ بَاشَرَ امْرَأَتَهُ وَ هُمَا مُحْرِمَانِ مَا عَلَيْهِمَا فَقَالَ إِنْ كَانَتِ الْمَرْأَةُ أَعَانَتْ بِشَهْوَةٍ مَعَ شَهْوَةِ الرَّجُلِ فَعَلَيْهِمَا الْهَدْيُ جَمِيعاً وَ يُفَرَّقُ بَيْنَهُمَا حَتَّى يَفْرُغَا مِنَ الْمَنَاسِكِ وَ حَتَّى يَرْجِعَا إِلَى الْمَكَانِ الَّذِي أَصَابَا فِيهِ مَا أَصَابَا وَ إِنْ كَانَتِ الْمَرْأَةُ لَمْ تُعِنْ بِشَهْوَةٍ وَ اسْتَكْرَهَهَا صَاحِبُهَا فَلَيْسَ عَلَيْهَا شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Hisham Bin Salim, from Suleyman Bin Khalid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who slept with his wife and they were both in <span class=\"iTxt\">Ihraam</span>, ‘What is upon them both?’ So he<sup>asws</sup> said: ‘If the woman had aided by desire along with the desire of the man, so upon them both would be the sacrifice, together (each), and separation would be effected between the two of them until they are both free from the rituals, and until they both return to the place in which they attained what they attained. And if it was such that the woman did not aid with desire and disliked her companion (doing it), so there is nothing upon her’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Hisham ibn Salim from Sulayman ibn Khalid who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in the state of Ihram as well as his wife and he involves himself in sexual relation with her. He (the Imam) said, ‘If it is with her and his lustfulness, they both owe an offering. They must separate from each other until all acts of al-Hajj are complete and they return to the place where it had happened; if it was not with lust on her part, instead she had despised, then she does not owe anything.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:103",
  "kind": "verse_list"
}