{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 104"
        },
        "path": "/books/al-kafi:4:3:104",
        "titles": {
          "ar": "بَابُ الْمُحْرِمِ يُقَبِّلُ امْرَأَتَهُ وَ يَنْظُرُ إِلَيْهَا بِشَهْوَةٍ أَوْ غَيْرِ شَهْوَةٍ أَوْ يَنْظُرُ إِلَى غَيْرِهَا",
          "en": "Chapter 104 – The one in Ihraam kisses his wife and he looks at her with desire, or without desire, or he looks at someone else"
        }
      }
    ],
    "index": 1047,
    "local_index": 104,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 105"
        },
        "path": "/books/al-kafi:4:3:105",
        "titles": {
          "ar": "بَابُ الْمُحْرِمِ يَأْتِي أَهْلَهُ وَ قَدْ قَضَى بَعْضَ مَنَاسِكِهِ",
          "en": "Chapter 105 – The one in Ihraam goes to his wife, and he had already fulfilled some of his rituals"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 103"
        },
        "path": "/books/al-kafi:4:3:103",
        "titles": {
          "ar": "بَابُ الْمُحْرِمِ يُوَاقِعُ امْرَأَتَهُ قَبْلَ أَنْ يَقْضِيَ مَنَاسِكَهُ أَوْ مُحِلٍّ يَقَعُ عَلَى مُحْرِمَةٍ",
          "en": "Chapter 103 – The one in Ihraam falls upon his wife before he fulfils his rituals, or the one free from Ihraam falls upon a woman in Ihraam"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:104",
    "titles": {
      "ar": "بَابُ الْمُحْرِمِ يُقَبِّلُ امْرَأَتَهُ وَ يَنْظُرُ إِلَيْهَا بِشَهْوَةٍ أَوْ غَيْرِ شَهْوَةٍ أَوْ يَنْظُرُ إِلَى غَيْرِهَا",
      "en": "Chapter 104 – The one in Ihraam kisses his wife and he looks at her with desire, or without desire, or he looks at someone else"
    },
    "verse_count": 12,
    "verse_start_index": 7335,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/351)"
        ],
        "index": 7336,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ مُحْرِمٍ نَظَرَ إِلَى امْرَأَتِهِ فَأَمْنَى أَوْ أَمْذَى وَ هُوَ مُحْرِمٌ قَالَ لَا شَيْ‏ءَ عَلَيْهِ وَ لَكِنْ لِيَغْتَسِلْ وَ يَسْتَغْفِرُ رَبَّهُ وَ إِنْ حَمَلَهَا مِنْ غَيْرِ شَهْوَةٍ فَأَمْنَى أَوْ أَمْذَى فَلَا شَيْ‏ءَ عَلَيْهِ وَ إِنْ حَمَلَهَا أَوْ مَسَّهَا بِشَهْوَةٍ فَأَمْنَى أَوْ أَمْذَى فَعَلَيْهِ دَمٌ ",
          "وَ قَالَ فِي الْمُحْرِمِ يَنْظُرُ إِلَى امْرَأَتِهِ وَ يُنْزِلُهَا بِشَهْوَةٍ حَتَّى يُنْزِلَ قَالَ عَلَيْهِ بَدَنَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, and Safwan Bin Yahya, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> looking at his wife so he discharges semen or seminal fluid, and he is in <span class=\"iTxt\">Ihraam</span>. He<sup>asws</sup> said: ‘There is nothing upon him, but let him wash, and he should seek Forgiveness of his Lord<sup>azwj</sup>. And, if he burdened upon her from without desire, so he discharged semen or seminal fluid, then there is nothing upon him; and if he burdened her or touched her with desire, so he discharged semen or seminal fluid, then upon him is blood (of a sacrificial animal)’. ",
            "And he<sup>asws</sup> said regarding the one in <span class=\"iTxt\">Ihraam</span> looking at his wife, and he descends upon her until his discharge descends, said: ‘Upon him is a sacrificial animal’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from and Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from ibn abu ‘Umayr and from Safwan ibn Yahya from Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about a man who in the state of Ihram, looks to his wife and discharges semen or madhiy (a certain fluid). He (the Imam) said, ‘There is nothing on him but he must take Ghusl (bath) and ask forgiveness from his Lord; if he carries her without lust and discharges semen or madhiy also, there is nothing on him, and if he carries her or touches her with lust and discharges semen or madhiy, he owes one offering.’ He (the Imam) said, ‘If one carries his wife down with lust until he discharges, he owes one badanah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/352)"
        ],
        "index": 7337,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْمُحْرِمِ يَضَعُ يَدَهُ مِنْ غَيْرِ شَهْوَةٍ عَلَى امْرَأَتِهِ قَالَ نَعَمْ يُصْلِحُ عَلَيْهَا خِمَارَهَا وَ يُصْلِحُ عَلَيْهَا ثَوْبَهَا وَ مَحْمِلَهَا قُلْتُ أَ فَيَمَسُّهَا وَ هِيَ مُحْرِمَةٌ قَالَ نَعَمْ قُلْتُ الْمُحْرِمُ يَضَعُ يَدَهُ بِشَهْوَةٍ قَالَ يُهَرِيقُ دَمَ شَاةٍ قُلْتُ فَإِنْ قَبَّلَ قَالَ هَذَا أَشَدُّ يَنْحَرُ بَدَنَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> placing his hand upon his wife from without desire. He<sup>asws</sup> said: ‘Yes, he can correct her veil upon her, or he can correct her clothes upon her, and her carriage’. I said, ‘Can he touch her and she is in <span class=\"iTxt\">Ihraam</span>?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘The one in <span class=\"iTxt\">Ihraam</span> placing his hand with desire?’ He<sup>asws</sup> said: ‘He should spill blood of a sheep’. I said, ‘Supposing he kisses?’ He<sup>asws</sup> said: ‘This is more intense. He should sacrifice a camel’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in the state of Ihram and places his hand on his wife without lust. He (the Imam) said, ‘Yes, he can secure her veil or her cloth or her carriage.’ I then asked, ‘Can he touch her while she is in the state of Ihram?’ He (the Imam) said, ‘Yes, he can do so.’ I then asked, ‘Can he place his hand on her with lust while he is in the state of Ihram?’ He (the Imam) said, ‘There is offering of one sheep on him.’ I then asked about kissing. He (the Imam) said, ‘This is more severe. He must offer one badanah for it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/353)"
        ],
        "index": 7338,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ قَبَّلَ امْرَأَتَهُ وَ هُوَ مُحْرِمٌ قَالَ عَلَيْهِ بَدَنَةٌ وَ إِنْ لَمْ يُنْزِلْ وَ لَيْسَ لَهُ أَنْ يَأْكُلَ مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad, from Ali Bin Abu Hamza, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who kisses his wife and he is in <span class=\"iTxt\">Ihraam</span>. He<sup>asws</sup> said: ‘Upon him is a sacrificial animal. And even if he did not discharge, it is not for him that he should eat from it’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from Ali ibn abu Hamzah who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who is in the state of Ihram and kisses his wife. He (the Imam) said, ‘There is one badanah on him and he must not eat from its meat even if he does not discharge any semen.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/353)"
        ],
        "index": 7339,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:4",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ مِسْمَعٍ أَبِي سَيَّارٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا سَيَّارٍ إِنَّ حَالَ الْمُحْرِمِ ضَيِّقَةٌ فَمَنْ قَبَّلَ امْرَأَتَهُ عَلَى غَيْرِ شَهْوَةٍ وَ هُوَ مُحْرِمٌ فَعَلَيْهِ دَمُ شَاةٍ وَ مَنْ قَبَّلَ امْرَأَتَهُ عَلَى شَهْوَةٍ فَأَمْنَى فَعَلَيْهِ جَزُورٌ وَ يَسْتَغْفِرُ رَبَّهُ وَ مَنْ مَسَّ امْرَأَتَهُ بِيَدِهِ وَ هُوَ مُحْرِمٌ عَلَى شَهْوَةٍ فَعَلَيْهِ دَمُ شَاةٍ وَ مَنْ نَظَرَ إِلَى امْرَأَتِهِ نَظَرَ شَهْوَةٍ فَأَمْنَى فَعَلَيْهِ جَزُورٌ وَ مَنْ مَسَّ امْرَأَتَهُ أَوْ لَازَمَهَا مِنْ غَيْرِ شَهْوَةٍ فَلَا شَيْ‏ءَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Ibn Raib, from Misma’a Abu Sayyar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘O Abu Sayyar! The state of the one in <span class=\"iTxt\">Ihraam</span> is constricted. So the one who kisses his wife upon other than desire and he was in <span class=\"iTxt\">Ihraam</span>, so upon him is blood of a sheep; and the one who kisses his wife upon desire, so he discharges semen, so upon him would be a camel, and he should seek Forgiveness of his Lord<sup>azwj</sup>. And the one who touches his wife with his hand upon desire and he is in <span class=\"iTxt\">Ihraam</span>, so upon him is blood of a sheep. And the one who looks at his wife with a lustful look, so he discharges semen, so upon him would be a camel. And the one who touches his wife, or holds her from without desire, so there is nothing upon him’."
          ],
          "en.sarwar": [
            "4. Sahl ibn Ziyad and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad all from ibn Mahbub from ibn Ri’ab from Misma’ abu Sayyar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once said to me, ‘O abu Sayyar the condition of one in the state of Ihram is restricted. If one kisses his wife without lust while in the state of Ihram, he owes one sheep; if one does so with lust and discharges semen, he owes a Jazur (slaughtering a camel) and must ask his Lord for forgiveness. If one touches his wife with his hand while he is in the state of Ihram with lust, he owes one sheep. If one looks at his wife with lust and ejaculates semen, he owes one Jazur. However, if one touches his wife or holds without lust there is not anything on him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/354)"
        ],
        "index": 7340,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:5",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْمُحْرِمِ يَعْبَثُ بِأَهْلِهِ حَتَّى يُمْنِيَ مِنْ غَيْرِ جِمَاعٍ أَوْ يَفْعَلُ ذَلِكَ فِي شَهْرِ رَمَضَانَ مَا ذَا عَلَيْهِمَا قَالَ عَلَيْهِمَا جَمِيعاً الْكَفَّارَةُ مِثْلُ مَا عَلَى الَّذِي يُجَامِعُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> tampering with his wife until he discharges semen from without copulation, or he does that during a Month of Ramazan. What is that which would be upon them both?’ He<sup>asws</sup> said: ‘Upon them both is an expiation similar to what is upon the one who copulates’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who is in the state of Ihram and plays with his wife until he discharges semen without intercourse; or if it is in the month of Ramadan what he will owe. He (the Imam) said, ‘There is kaffarah (expiation) on both of them just as for sexual intercourse.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/355)"
        ],
        "index": 7341,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ الْخَزَّازِ عَنْ صَبَّاحٍ الْحَذَّاءِ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قُلْتُ لَهُ مَا تَقُولُ فِي مُحْرِمٍ عَبِثَ بِذَكَرِهِ فَأَمْنَى قَالَ أَرَى عَلَيْهِ مِثْلَ مَا عَلَى مَنْ أَتَى أَهْلَهُ وَ هُوَ مُحْرِمٌ بَدَنَةً وَ الْحَجَّ مِنْ قَابِلٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Amro Bin Usman Al Khazzaz, from Sabbah Al Haza’a, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding the one in <span class=\"iTxt\">Ihraam</span> who tampers with his manhood, so he discharges?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> upon him to be similar to what is upon the one who goes to his wife and he is in <span class=\"iTxt\">Ihraam</span> – a sacrificial animal, and the Hajj (to be performed) the next year’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Amr ibn ‘Uthman al-Khazzaz from Sabah al-Hadhdha’ from Ishaq ibn ‘Ammar who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who is in the state of Ihram, plays with his penis and discharges semen. He (the Imam) said, ‘It is like one who, while in the state of Ihram, performs sexual intercourse with his wife; he owes badanah and al-Hajj in future.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/355)"
        ],
        "index": 7342,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:7",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ نَظَرَ إِلَى سَاقِ امْرَأَةٍ فَأَمْنَى قَالَ إِنْ كَانَ مُوسِراً فَعَلَيْهِ بَدَنَةٌ وَ إِنْ كَانَ بَيْنَ ذَلِكَ فَبَقَرَةٌ وَ إِنْ كَانَ فَقِيراً فَشَاةٌ أَمَا إِنِّي لَمْ أَجْعَلْ ذَلِكَ عَلَيْهِ مِنْ أَجْلِ الْمَاءِ وَ لَكِنْ مِنْ أَجْلِ أَنَّهُ نَظَرَ إِلَى مَا لَا يَحِلُّ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Is’haq Bin Ammar, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who looks at a leg of a woman, so he discharges. He<sup>asws</sup> said: ‘If he was (financially) solvent, so upon him is a camel; and if he was in between that, so a cow; and if he was poor, so a sheep. But, I<sup>asws</sup> do not make that to be upon him from a reason of the water (discharge), but from a reason that he looked at what is not Permissible for him’."
          ],
          "en.sarwar": [
            "7. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Ishaq ibn ‘Ammar from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in the state of Ihram, looks at the leg of a woman and discharges semen. He (the Imam) said, ‘If he is affluent, he owes badanah; if he is not so much affluent, then it is a cow; if he is poor then it is a sheep. I do not place it on him because of semen but it is because of looking to what is not lawful for him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/355)"
        ],
        "index": 7343,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ فِي مُحْرِمٍ نَظَرَ إِلَى غَيْرِ أَهْلِهِ فَأَنْزَلَ قَالَ عَلَيْهِ دَمٌ لِأَنَّهُ نَظَرَ إِلَى غَيْرِ مَا يَحِلُّ لَهُ وَ إِنْ لَمْ يَكُنْ أَنْزَلَ فَلْيَتَّقِ اللَّهَ وَ لَا يَعُدْ وَ لَيْسَ عَلَيْهِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "‘Regarding the one in <span class=\"iTxt\">Ihraam</span> looking at other than his wife, so his discharge descends. He<sup>asws</sup> said: ‘Upon him is blood (of a sacrificial animal), because he looked at other than what is Permissible for him. And, if he did not happen to have discharged, so let him fear Allah<sup>azwj</sup>, and he should not repeat, and there is nothing upon him’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “About a man who in the state of Ihram, looks to those other than his wife and discharges semen, he (the Imam), ‘Alayhi al-Salam, said, ‘He owes an animal offering because of looking at what is not lawful for him. If there is no semen discharge, he must maintain piety before Allah, he must not repeat and there is not anything on him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/356)"
        ],
        "index": 7344,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:9",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْحُسَيْنِ بْنِ حَمَّادٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمُحْرِمِ يُقَبِّلُ أُمَّهُ قَالَ لَا بَأْسَ هَذِهِ قُبْلَةُ رَحْمَةٍ إِنَّمَا يُكْرَهُ قُبْلَةُ الشَّهْوَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Ahmad Al Nahdy, from Muhammad Bin Al Waleed, from Aban Bin Usman, from Al Husayn Bin Hammad who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> kissing his mother. He<sup>asws</sup> said: ‘There is no problem with these kisses of mercy. But what is disliked is kisses of the lustful desires’."
          ],
          "en.sarwar": [
            "9. Ahmad ibn Muhammad from has narrated from Muhammad ibn Ahmad al-Nahdiy from Muhammad ibn al-Walid from Aban ibn ‘Uthman from al-Husayn ibn Hammad who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in the state of Ihram and his mother kisses him. He (the Imam) said, ‘It is not harmful; it is a kiss of blessing, only kissing with lust is despised.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/356)"
        ],
        "index": 7345,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ يَسْمَعُ كَلَامَ امْرَأَةٍ مِنْ خَلْفِ حَائِطٍ وَ هُوَ مُحْرِمٌ فَتَشَهَّى حَتَّى أَنْزَلَ قَالَ لَيْسَ عَلَيْهِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Wuheyb Bin Hafs, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who heard the speech of his wife from behind a wall and he was in Ihraam. So he desired her until he discharged. He<sup>asws</sup> said: ‘There is nothing upon him’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from Wuhayb ibn Hafs from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who in the state of Ihram, hears a woman speaking from behind the wall and because of lust he discharges semen. He (the Imam) said, ‘There is nothing on him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/356)"
        ],
        "index": 7346,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي مُحْرِمٍ اسْتَمَعَ عَلَى رَجُلٍ يُجَامِعُ أَهْلَهُ فَأَمْنَى قَالَ لَيْسَ عَلَيْهِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ahmad Bin Muhammad Bin Abu Nasr, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the one in <span class=\"iTxt\">Ihraam</span> who listened upon a man copulating with his wife, so he discharged. He<sup>asws</sup> said: ‘There is nothing upon him’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ahmad ibn Muhammad from ibn abu Nasr from certain persons of our people who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in the state of Ihram, hears a man performing sexual intercourse with his wife and he also discharges semen. He (the Imam) said, ‘There is nothing on him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/356)"
        ],
        "index": 7347,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:104:12",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْمُحْرِمِ تُنْعَتُ لَهُ الْمَرْأَةُ الْجَمِيلَةُ الْخِلْقَةِ فَيُمْنِي قَالَ لَيْسَ عَلَيْهِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ahmad Bin Muhammad Bin Abu Nasr, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the one in <span class=\"iTxt\">Ihraam</span> to whom the beautiful woman describes her creation, so he discharges. He<sup>asws</sup> said: ‘There is nothing upon her’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ahmad ibn Muhammad from ibn abu Nasr from Sama‘ah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in the state of Ihram, a beautiful woman describes her beauty and he discharges semen. He (the Imam) said, ‘There is nothing on him.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:104",
  "kind": "verse_list"
}