{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 109"}, "path": "/books/al-kafi:4:3:109", "titles": {"ar": "بَابُ كَفَّارَاتِ مَا أَصَابَ الْمُحْرِمُ مِنَ الْوَحْشِ", "en": "Chapter 109 – The expiations on what the one in Ihraam attains from the wild animals"}}], "index": 1052, "local_index": 109, "part_type": "Chapter", "path": "/books/al-kafi:4:3:109", "titles": {"ar": "بَابُ كَفَّارَاتِ مَا أَصَابَ الْمُحْرِمُ مِنَ الْوَحْشِ", "en": "Chapter 109 – The expiations on what the one in Ihraam attains from the wild animals"}, "verse_count": 14, "verse_start_index": 7373, "verses": [{"index": 7374, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ مُحْرِمٍ أَصَابَ نَعَامَةً أَوْ حِمَارَ وَحْشٍ قَالَ عَلَيْهِ بَدَنَةٌ قُلْتُ فَإِنْ لَمْ يَقْدِرْ عَلَى بَدَنَةٍ قَالَ فَلْيُطْعِمْ سِتِّينَ مِسْكِيناً قُلْتُ فَإِنْ لَمْ يَقْدِرْ عَلَى أَنْ يَتَصَدَّقَ قَالَ فَلْيَصُمْ ثَمَانِيَةَ عَشَرَ يَوْماً وَ الصَّدَقَةُ مُدٌّ عَلَى كُلِّ مِسْكِينٍ \nقَالَ وَ سَأَلْتُهُ عَنْ مُحْرِمٍ أَصَابَ بَقَرَةً قَالَ عَلَيْهِ بَقَرَةٌ قُلْتُ فَإِنْ لَمْ يَقْدِرْ عَلَى بَقَرَةٍ قَالَ فَلْيُطْعِمْ ثَلَاثِينَ مِسْكِيناً قُلْتُ فَإِنْ لَمْ يَقْدِرْ عَلَى أَنْ يَتَصَدَّقَ قَالَ فَلْيَصُمْ تِسْعَةَ أَيَّامٍ \nقُلْتُ فَإِنْ أَصَابَ ظَبْياً قَالَ عَلَيْهِ شَاةٌ قُلْتُ فَإِنْ لَمْ يَقْدِرْ قَالَ فَإِطْعَامُ عَشَرَةِ مَسَاكِينَ فَإِنْ لَمْ يَقْدِرْ عَلَى مَا يَتَصَدَّقُ بِهِ فَعَلَيْهِ صِيَامُ ثَلَاثَةِ أَيَّامٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, from Abu Baseer, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> hunting an ostrich or a wild donkey. He<sup>asws</sup> said: ‘Upon him is a sacrificial animal’. I said, ‘Supposing he is not able upon an animal?’ He<sup>asws</sup> said: ‘So let him feed sixty poor ones’. I said, ‘Supposing he is not able upon giving charity?’ He<sup>asws</sup> said: ‘So let him Fast eighteen days, and give in charity with one <span class=\"iTxt\">Mudd</span> (approximately 750 gms of food) upon a poor one each day’. \nHe (the narrator) said, ‘And I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> killing a cow. He<sup>asws</sup> said: ‘Upon him is a cow (as a sacrifice)’. I said, ‘Supposing he is not able upon a cow?’ He<sup>asws</sup> said: ‘So let him feed thirty poor ones’. I said, ‘Supposing he is not able upon giving charity?’ He<sup>asws</sup> said: ‘So let him Fast nine days’. \nI said, ‘Supposing he kills an antelope?’ He<sup>asws</sup> said: ‘Upon him is a sheep’. I said, ‘Supposing he is not able?’ He<sup>asws</sup> said: ‘So he should feed ten poor ones. So, if he is not able upon what he should be giving in charity with, so upon him would be the Fasts of three days’."}]}, {"index": 7375, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ مُحَمَّدٍ عَنْ دَاوُدَ الرَّقِّيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يَكُونُ عَلَيْهِ بَدَنَةٌ وَاجِبَةٌ فِي فِدَاءٍ قَالَ إِذَا لَمْ يَجِدْ بَدَنَةً فَسَبْعُ شِيَاهٍ فَإِنْ لَمْ يَقْدِرْ صَامَ ثَمَانِيَةَ عَشَرَ يَوْماً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Muhammad, from Dawood Al Raqqy, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who happens to have a (penalty of) a camel upon him, being an Obligation regarding a ransom. He<sup>asws</sup> said: ‘When he cannot find a camel, so seven sheep. So, if he is not able, he should Fast for eighteen days’."}]}, {"index": 7376, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:3", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَوْ عَدْلُ ذلِكَ صِياماً قَالَ يُثَمِّنُ قِيمَةَ الْهَدْيِ طَعَاماً ثُمَّ يَصُومُ لِكُلِّ مُدٍّ يَوْماً فَإِذَا زَادَتِ الْأَمْدَادُ عَلَى شَهْرَيْنِ فَلَيْسَ عَلَيْهِ أَكْثَرُ مِنْهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Al Hassan Bin Ali Bin Fazzal, from Ibn Bukeyr, from one of our companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[5:95] or the equivalent of it in Fasting</span>. He<sup>asws</sup> said: ‘He should evaluate the price of the sacrifice as food, then he would Fast for each <span class=\"iTxt\">Mudd</span> (approximately 750 gms), one day. So when the <span class=\"iTxt\">Mudd</span>s increase upon two months, so there is nothing more upon him than it’."}]}, {"index": 7377, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:4", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ الْمُحْرِمُ يَقْتُلُ نَعَامَةً قَالَ عَلَيْهِ بَدَنَةٌ مِنَ الْإِبِلِ قُلْتُ يَقْتُلُ حِمَارَ وَحْشٍ قَالَ عَلَيْهِ بَدَنَةٌ قُلْتُ فَالْبَقَرَةَ قَالَ بَقَرَةٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar and Muhammad Bin Yahya, from Muhammad Bin Al Husayn, altogether from Safwan Bin Yahya, from Yaqoub Bin Shuayb, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘The one in <span class=\"iTxt\">Ihraam</span> kills an ostrick’. He<sup>asws</sup> said: ‘Upon him is a sacrificial animal from the camels’. I said, ‘He kills a wild donkey’. He<sup>asws</sup> said: ‘Upon him is a sacrificial animal’. I said, ‘So (what about if he kills) a cow?’ He<sup>asws</sup> said: ‘(Upon him is) a cow’."}]}, {"index": 7378, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي مُحْرِمٍ قَتَلَ نَعَامَةً قَالَ عَلَيْهِ بَدَنَةٌ فَإِنْ لَمْ يَجِدْ فَإِطْعَامُ سِتِّينَ مِسْكِيناً \nوَ قَالَ إِنْ كَانَ قِيمَةُ الْبَدَنَةِ أَكْثَرَ مِنْ إِطْعَامِ سِتِّينَ مِسْكِيناً لَمْ يَزِدْ عَلَى إِطْعَامِ سِتِّينَ مِسْكِيناً وَ إِنْ كَانَ قِيمَةُ الْبَدَنَةِ أَقَلَّ مِنْ إِطْعَامِ سِتِّينَ مِسْكِيناً لَمْ يَكُنْ عَلَيْهِ إِلَّا قِيمَةُ الْبَدَنَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, from one of our companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding one in <span class=\"iTxt\">Ihraam</span> killing an ostrich. He<sup>asws</sup> said: ‘Upon him is a sacrificial animal. So if he cannot find, the he feeds sixty poor ones’. \nAnd he<sup>asws</sup> said: ‘If the value of the animal was more than the feeding of sixty poor ones, it (the penalty) would not exceed feeding of sixty poor ones; and if the value of the animal was less than the feeding of sixty poor ones, it (penalty) would not be upon him except for the value of the animal’."}]}, {"index": 7379, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:6", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي مُحْرِمٍ رَمَى ظَبْياً فَأَصَابَهُ فِي يَدِهِ فَعَرَجَ مِنْهَا قَالَ إِنْ كَانَ الظَّبْيُ مَشَى عَلَيْهَا وَ رَعَى فَعَلَيْهِ رُبُعُ قِيمَتِهِ وَ إِنْ كَانَ ذَهَبَ عَلَى وَجْهِهِ فَلَمْ يَدْرِ مَا صَنَعَ فَعَلَيْهِ الْفِدَاءُ لِأَنَّهُ لَا يَدْرِي لَعَلَّهُ قَدْ هَلَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Ali Bin Abu Hamza, from Abu Baseer, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding one in <span class=\"iTxt\">Ihraam</span> shooting an arrow at an antelope, so he hits it in its hand, and it lames from it. He<sup>asws</sup> said: ‘If the antelope walks upon it and grazes, so upon him would be a quarter of its value. And, if it was such that he goes upon its direction, so he does not know what happened, upon him would be the penalty, because he does not know, perhaps it may have perished’."}]}, {"index": 7380, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:7", "text": "سَهْلُ بْنُ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَتَلَ ثَعْلَباً قَالَ عَلَيْهِ دَمٌ قُلْتُ فَأَرْنَباً قَالَ مِثْلُ مَا عَلَى الثَّعْلَبِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Sahl Bin Ziyad, from Ahmad Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer who said, \n‘I asked Abu Abdullah<sup>asws</sup> about a man who kills a fox. He<sup>asws</sup> said: ‘Upon him is blood (of a sacrificial animal)’. I said, ‘So (what about) a rabbit?’ He<sup>asws</sup> said: ‘Similar to what is (Obligated) upon the fox’."}]}, {"index": 7381, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:8", "text": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ مُحْرِمٍ أَصَابَ أَرْنَباً أَوْ ثَعْلَباً قَالَ فِي الْأَرْنَبِ شَاةٌ.", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad Bin Abu Nasr, \n(It has been narrated) from Abu Al Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> killing a rabbit, or a fox. He<sup>asws</sup> said: ‘Regarding the rabbit is (a penalty of) a sheep’."}]}, {"index": 7382, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:9", "text": "سَهْلُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَحْمَدَ بْنِ عَلِيٍّ عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْيَرْبُوعُ وَ الْقُنْفُذُ وَ الضَّبُّ إِذَا أَصَابَهُ الْمُحْرِمُ فَعَلَيْهِ جَدْيٌ وَ الْجَدْيُ خَيْرٌ مِنْهُ وَ إِنَّمَا جُعِلَ عَلَيْهِ هَذَا كَيْ يَنْكُلَ عَنْ صَيْدِ غَيْرِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "<span style=\"font-size: small\">Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Misma’a Bin Abdul Malik, </span>from Abu Abdullah<sup>asws</sup>; \nand Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Ahmad Bin Ali, from Misma’a Bin Abdul Malik, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The jerboa (a rodent), and the hedgehog, and the lizard, when the one in <span class=\"iTxt\">Ihraam</span> kills it, so upon him is a kid (young goat); and the young goat is better than it, but rather I<sup>asws</sup> make this to be upon him to perhaps deter him from hunting something else’."}]}, {"index": 7383, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:10", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَصَابَ الْمُحْرِمُ الصَّيْدَ وَ لَمْ يَجِدْ مَا يُكَفِّرُ مِنْ مَوْضِعِهِ الَّذِي أَصَابَ فِيهِ الصَّيْدَ قُوِّمَ جَزَاؤُهُ مِنَ النَّعَمِ دَرَاهِمَ ثُمَّ قُوِّمَتِ الدَّرَاهِمُ طَعَاماً لِكُلِّ مِسْكِينٍ نِصْفُ صَاعٍ فَإِنْ لَمْ يَقْدِرْ عَلَى الطَّعَامِ صَامَ لِكُلِّ نِصْفِ صَاعٍ يَوْماً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, and a number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Abu Ubeya, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the one in <span class=\"iTxt\">Ihraam</span> attains the hunted prey, and cannot find what he can expiate from its which he hunted the prey, should evaluate its price from the cattle in Dirhams, then evaluate the Dirham as foodstuff – for each poor one being half a <span class=\"iTxt\">Sa’a</span> (approximately 1.5 kg). So if he is not able upon the foodstuff, should Fast one day for each half <span class=\"iTxt\">Sa’a</span>’."}]}, {"index": 7384, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:11", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ أَصَابَ بَيْضَ نَعَامَةٍ وَ هُوَ مُحْرِمٌ قَالَ يُرْسِلُ الْفَحْلَ فِي الْإِبِلِ عَلَى عَدَدِ الْبَيْضِ قُلْتُ فَإِنَّ الْبَيْضَ يَفْسُدُ كُلُّهُ وَ يَصْلُحُ كُلُّهُ قَالَ مَا يُنْتَجُ مِنَ الْهَدْيِ فَهُوَ هَدْيٌ بَالِغُ الْكَعْبَةِ وَ إِنْ لَمْ يُنْتَجْ فَلَيْسَ عَلَيْهِ شَيْ‏ءٌ فَمَنْ لَمْ يَجِدْ إِبِلًا فَعَلَيْهِ لِكُلِّ بَيْضَةٍ شَاةٌ فَإِنْ لَمْ يَجِدْ فَالصَّدَقَةُ عَلَى عَشَرَةِ مَسَاكِينَ لِكُلِّ مِسْكِينٍ مُدٌّ فَإِنْ لَمْ يَقْدِرْ فَصِيَامُ ثَلَاثَةِ أَيَّامٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad, from Ali Bin Abu Hamza, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who attained an egg of an ostrich, and he was in <span class=\"iTxt\">Ihraam</span>. He<sup>asws</sup> said: ‘He should send (as a sacrifice), the stallion among the camels upon the number of the eggs’.  I said, ‘Supposing the eggs get spoilt, all of them, and (if) they are correct, all of them’. He<sup>asws</sup> said: ‘What is befitting from the sacrifice, so it is the sacrifice reaching the Kabah; and if it produces, so there is nothing upon him. So the one who cannot find a camel, so upon him, for each of the eggs, is a sheep. So if he cannot find, so let him give in charity upon ten poor ones, for each poor one being a <span class=\"iTxt\">Mudd</span> (750 gms.). So if he is not able, so he should Fast for three days’."}]}, {"index": 7385, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:12", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ اشْتَرَى لِرَجُلٍ مُحْرِمٍ بَيْضَ نَعَامَةٍ فَأَكَلَهُ الْمُحْرِمُ قَالَ عَلَى الَّذِي اشْتَرَاهُ لِلْمُحْرِمِ فِدَاءٌ وَ عَلَى الْمُحْرِمِ فِدَاءٌ \nقُلْتُ وَ مَا عَلَيْهِمَا قَالَ عَلَى الْمُحِلِّ جَزَاءُ قِيمَةِ الْبَيْضِ لِكُلِّ بَيْضَةٍ دِرْهَمٌ وَ عَلَى الْمُحْرِمِ الْجَزَاءُ لِكُلِّ بَيْضَةٍ شَاةٌ .\nعِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ مِثْلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Ali Bin Raib, from Abu Ubeyda, \n(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who buys ostrich eggs for a man in <span class=\"iTxt\">Ihraam</span>, so the man in <span class=\"iTxt\">Ihraam</span> eats it. He<sup>asws</sup> said: ‘There is a ransom upon the one who bought it for the one in <span class=\"iTxt\">Ihraam</span>, and upon the one in <span class=\"iTxt\">Ihraam</span> is (also) a ransom’. \nI said, ‘And what is upon both of them?’ He<sup>asws</sup> said: ‘Upon the one not in <span class=\"iTxt\">Ihraam</span> is a penalty of the price of the eggs, for each egg being a Dirham; and upon the one in <span class=\"iTxt\">Ihraam</span> is the penalty, for each egg being a sheep’.\n<span style=\"font-size: small\">A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Abu Ubeyda </span>– similar to it."}]}, {"index": 7386, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:13", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ يَزِيدَ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ مَرَّ وَ هُوَ مُحْرِمٌ فَأَخَذَ ظَبْيَةً فَاحْتَلَبَهَا وَ شَرِبَ لَبَنَهَا قَالَ عَلَيْهِ دَمٌ وَ جَزَاءٌ فِي الْحَرَمِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazie, from Salih Bin Uqba, from Yazeed Bin Abdul Malik, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man passing-by and he is in <span class=\"iTxt\">Ihraam</span>. So he seizes an antelope, so he milks it and drinks its milk. He<sup>asws</sup> said: ‘Upon him is blood (of a sacrificial animal), and a penalty in the <span class=\"iTxt\">Harram</span>’."}]}, {"index": 7387, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:4:3:109:14", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ مُحْرِمٍ كَسَرَ قَرْنَ ظَبْيٍ قَالَ يَجِبُ عَلَيْهِ الْفِدَاءُ \nقَالَ قُلْتُ فَإِنْ كَسَرَ يَدَهُ قَالَ إِنْ كَسَرَ يَدَهُ وَ لَمْ يَرْعَ فَعَلَيْهِ دَمُ شَاةٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Yahya Bin Al Mubarak, from Abdullah Bin Jabala, from Sama’at Bin Mihran, from Abu Baseer who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> breaking a horn of an antelope. He<sup>asws</sup> said: ‘The ransom is Obligated upon him’. \nHe (the narrator) said, ‘I said, ‘Supposing he broke its hand?’ He<sup>asws</sup> said: ‘If he broke his hand and it did not graze, so upon him would be blood of a sheep (as sacrifice)’."}]}]}, "index": "al-kafi:4:3:109", "kind": "verse_list"}