{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:4:3:11",
        "titles": {
          "ar": "بَابٌ نَادِرٌ",
          "en": "Chapter 11 - Miscellaneous"
        }
      }
    ],
    "index": 954,
    "local_index": 11,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:4:3:12",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ اللَّهَ</span> عَزَّ وَ جَلَّ حَرَّمَ مَكَّةَ حِينَ خَلَقَ السَّمَاوَاتِ وَ الْأَرْضَ ",
          "en": "Chapter 12 – Allah<sup>azwj</sup> Mighty and Majestic Sancified Makkah when He<sup>azwj</sup> Created the skies and the earth"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:4:3:10",
        "titles": {
          "ar": "بَابٌ فِي قَوْلِهِ تَعَالَى فِيهِ آياتٌ بَيِّناتٌ",
          "en": "Chapter 10 – Regarding the Words of the Exalted [3:97] In it are clear Signs"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:11",
    "titles": {
      "ar": "بَابٌ نَادِرٌ",
      "en": "Chapter 11 - Miscellaneous"
    },
    "verse_count": 2,
    "verse_start_index": 6731,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/67)"
        ],
        "index": 6732,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:11:1",
        "text": [
          "مُحَمَّدُ بْنُ عَقِيلٍ عَنِ الْحَسَنِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ يَزِيدَ الرِّفَاعِيِّ رَفَعَهُ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) سُئِلَ عَنِ الْوُقُوفِ بِالْجَبَلِ لِمَ لَمْ يَكُنْ فِي الْحَرَمِ فَقَالَ لِأَنَّ الْكَعْبَةَ بَيْتُهُ وَ الْحَرَمَ بَابُهُ فَلَمَّا قَصَدُوهُ وَافِدِينَ وَقَفَهُمْ بِالْبَابِ يَتَضَرَّعُونَ",
          "قِيلَ لَهُ فَالْمَشْعَرُ الْحَرَامُ لِمَ صَارَ فِي الْحَرَمِ قَالَ لِأَنَّهُ لَمَّا أَذِنَ لَهُمْ بِالدُّخُولِ وَقَفَهُمْ بِالْحِجَابِ الثَّانِي فَلَمَّا طَالَ تَضَرُّعُهُمْ بِهَا أَذِنَ لَهُمْ لِتَقْرِيبِ قُرْبَانِهِمْ فَلَمَّا قَضَوْا تَفَثَهُمْ تَطَهَّرُوا بِهَا مِنَ الذُّنُوبِ الَّتِي كَانَتْ حِجَاباً بَيْنَهُمْ وَ بَيْنَهُ أَذِنَ لَهُمْ بِالزِّيَارَةِ عَلَى الطَّهَارَةِ ",
          "قِيلَ لَهُ فَلِمَ حُرِّمَ الصِّيَامُ أَيَّامَ التَّشْرِيقِ قَالَ لِأَنَّ الْقَوْمَ زُوَّارُ اللَّهِ وَ هُمْ فِي ضِيَافَتِهِ وَ لَا يَجْمُلُ بِمُضِيفٍ أَنْ يُصَوِّمَ أَضْيَافَهُ ",
          "قِيلَ لَهُ فَالتَّعَلُّقُ بِأَسْتَارِ الْكَعْبَةِ لِأَيِّ مَعْنًى هُوَ قَالَ مَثَلُ رَجُلٍ لَهُ عِنْدَ آخَرَ جِنَايَةٌ وَ ذَنْبٌ فَهُوَ يَتَعَلَّقُ بِثَوْبِهِ يَتَضَرَّعُ إِلَيْهِ وَ يَخْضَعُ لَهُ أَنْ يَتَجَافَى عَنْ ذَنْبِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Aqeel Bin Al Hassan Bin Al Husayn, from Ali Bin Isa, from Ali Bin Al Hassan, from Muhammad Bin Yazeed Al Rafa’iy, ",
            "(It has been narrated) raising it that Amir Al-Momineen<sup>asws</sup> was asked about the pausing by the mountain, how come it did not happen to be in ‘الْحَرَمِ’ the Sanctuary? So he<sup>asws</sup> said: ‘Because the Kabah is His<sup>azwj</sup> House and the الْحَرَمِ is its door. So when the delegations come over, He<sup>azwj</sup> Pauses them by the door, supplicating’. ",
            "It was said to him<sup>asws</sup>, ‘So why have the Signs of ‘الْحَرَمِ’ (Al-Harram) the Sanctuary) come to be inside the Al-Harram?’ He<sup>asws</sup> said: ‘Because when Permission was Granted to them with the entry, they were Paused by the second Veil. So when their supplication were prolonged at it, Permission was Granted to them with the offering of the sacrifice. So when they fulfilled their rituals, they were purified by it from the sins which were an obstacle between them and Him<sup>azwj</sup>, He<sup>azwj</sup> Permitted them with the visitation upon the purity’.",
            "It was said to him<sup>asws</sup>, ‘So why are the Fasts Prohibited during the days of Al-Tashreek (11<sup>th</sup>, 12<sup>th</sup>, and 13<sup>th</sup> of Zilhajj)?’ He<sup>asws</sup> said: ‘Because the people are visitors of Allah<sup>azwj</sup>, and they are among His<sup>azwj</sup> guests, and it is not Commendable for the Host that He<sup>azwj</sup> would Make His<sup>azwj</sup> guests to Fast’. ",
            "It was said to him<sup>asws</sup>, ‘So the attachment with the curtains of the Kabah, for which meaning is it?’ He<sup>asws</sup> said: ‘Like a man who has a felony with another and a sin, so he hangs on to his clothes, beseeching to him, and humbling himself to him that he would overlook from his sins’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn ‘Aqil has narrated from al-Hassan ibn al-Husayn from Ali ibn ‘Isa from Ali ibn al-Hassan from Muhammad ibn Yazid aI-Rifa’ ‘iy who in a marfu‘ manner has narrated from ’Amir al-Mu’minin the following: “’Amir al-Mu’minin was asked about staying on the hill, why it is not inside the Sacred area (al- Haram)?’ He (the Imam) replied, ‘It is because al-Ka‘bah is His house and al-Haram (the sacred area) is its door. When people wanted to come to His House, He made them stand, wait at the door and appeal for permission.’ It was asked from him, ‘Why is al-Mash‘ar al-Haram part of al-Haram?’ He (the Imam) replied, ‘It is because when permission was given to come, He made them to stop on the second barrier but when their pleading prolonged, permission was granted to them to move their offerings closer. When they cleaned themselves with it, they became clean of sins, which were as barriers between them, and He granted permission to visit (His House) in a clean condition.’ It was then asked, ‘Why is fasting during the bright days not permissible?’ He (the Imam) replied, ‘It is because people are Allah’s visitors, they are His guests and it is not nice for a host that his guests remain fasting.’ He was asked, ‘Why should one hold to the curtains of al-Ka‘bah and what does it mean?’ He (the Imam) replied, ‘It is like one who has committed a crime against another person; thus he holds to his clothes and expresses humility before him to forgive him his sins and crime.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/68)"
        ],
        "index": 6733,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3555",
              "text": "صَفْوَانَ أَوْ رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/263",
              "text": "ابْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ صَفْوَانَ أَوْ رَجُلٍ عَنْ صَفْوَانَ عَنِ ابْنِ بُكَيْرٍ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:11:2",
        "text": [
          " إِنَّ الْمُزْدَلِفَةَ أَكْثَرُ بِلَادِ اللَّهِ هَوَامّاً فَإِذَا كَانَتْ لَيْلَةُ التَّرْوِيَةِ نَادَى مُنَادٍ مِنْ عِنْدِ اللَّهِ يَا مَعْشَرَ الْهَوَامِّ ارْحَلْنَ عَنْ وَفْدِ اللَّهِ ",
          "قَالَ فَتَخْرُجُ فِي الْجِبَالِ فَتَسَعُهَا حَيْثُ لَا تُرَى فَإِذَا انْصَرَفَ الْحَاجُّ عَادَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Safwan, or a man, from Safwan, from Ibn Bukeyr, from his father, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Al-Muzdalifa is a city of Allah<sup>azwj</sup> with the most insects. So when it is the night of Al-Tarwiyya, a Caller Calls out from the Presence of Allah<sup>azwj</sup>: ‘O group of insects! Go away from the delegations of Allah<sup>azwj</sup>!’ ",
            "He<sup>asws</sup> said: ‘So they go out to be in the mountains and they crawl around where they cannot be seen. So when the Pilgims leave, they return’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Safwan or a man from Safwan from ibn Bukayr from his father who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘Al-Muzdalifah had more insects than other lands of Allah. On the night of al-Tarwiyah, it was announced from Allah, ‘O insects, move away from where delegations to Allah are about to pass.’ He (the Imam) said, ‘The insects move in the hills in a way that they are not seen. When al-Hajj (pilgrims) return, they come back.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:11",
  "kind": "verse_list"
}