{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:4:3:12",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ اللَّهَ</span> عَزَّ وَ جَلَّ حَرَّمَ مَكَّةَ حِينَ خَلَقَ السَّمَاوَاتِ وَ الْأَرْضَ ",
          "en": "Chapter 12 – Allah<sup>azwj</sup> Mighty and Majestic Sancified Makkah when He<sup>azwj</sup> Created the skies and the earth"
        }
      }
    ],
    "index": 955,
    "local_index": 12,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:4:3:13",
        "titles": {
          "ar": "بَابٌ فِي قَوْلِهِ تَعَالَى وَ مَنْ دَخَلَهُ كانَ آمِناً",
          "en": "Chapter 13 – Regarding the Words of the Exalted [3:97] and whoever enters it shall be secure"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:4:3:11",
        "titles": {
          "ar": "بَابٌ نَادِرٌ",
          "en": "Chapter 11 - Miscellaneous"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:12",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ اللَّهَ</span> عَزَّ وَ جَلَّ حَرَّمَ مَكَّةَ حِينَ خَلَقَ السَّمَاوَاتِ وَ الْأَرْضَ ",
      "en": "Chapter 12 – Allah<sup>azwj</sup> Mighty and Majestic Sancified Makkah when He<sup>azwj</sup> Created the skies and the earth"
    },
    "verse_count": 4,
    "verse_start_index": 6733,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/68)"
        ],
        "index": 6734,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:12:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَعِيدٍ الْأَعْرَجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ قُرَيْشاً لَمَّا هَدَمُوا الْكَعْبَةَ وَجَدُوا فِي قَوَاعِدِهِ حَجَراً فِيهِ كِتَابٌ لَمْ يُحْسِنُوا قِرَاءَتَهُ حَتَّى دَعَوْا رَجُلًا فَقَرَأَهُ فَإِذَا فِيهِ أَنَا اللَّهُ ذُو بَكَّةَ حَرَّمْتُهَا يَوْمَ خَلَقْتُ السَّمَاوَاتِ وَ الْأَرْضَ وَ وَضَعْتُهَا بَيْنَ هَذَيْنِ الْجَبَلَيْنِ وَ حَفَفْتُهَا بِسَبْعَةِ أَمْلَاكٍ حَفّاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Numan, from Saeed Al A’araj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the Qureysh demolished the Kabah, they found a rock in its foundation wherein was a letter which could not be read properly, until they called over a man, so he read it, so there was (written) in it: “I<sup>azwj</sup> am Allah<sup>azwj</sup>! The Owner of Bakka. I<sup>azwj</sup> Sanctified it on the day I<sup>azwj</sup> Created the skies and the earth, and I<sup>azwj</sup> Placed it between these two mountains, and Surrounded it with seven Angels, encircling”’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Nu’aman from Sa‘id al-’A‘raj who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that when Quraysh demolished al-Ka‘bah, they found in its foundations a stone with a writing on it which could not be read properly. They found a man who was able to read and this was written on it, ‘I am Allah, owner of Bakkah, which I made sacred on the day I created the skies and earth. I placed it between these two hills and made seven angels to guard it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/68)"
        ],
        "index": 6735,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:12:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ حَرَّمَ اللَّهُ حَرَمَهُ أَنْ يُخْتَلَى خَلَاهُ أَوْ يُعْضَدَ شَجَرُهُ إِلَّا الْإِذْخِرَ أَوْ يُصَادَ طَيْرُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ib Fazzal, from Ibn Bukeyr, from Zurara who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Sanctified His<sup>azwj</sup> Al-Harram, from it being vacated and being empty, or its trees to be tampered with except for Al-Izkhir (a fragrant tropical grass), or its birds from being hunted’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad, from ibn Faddal from ibn Bukayr from Zurarah who has said the following: “I once heard abu Ja‘far, ‘Alayhi al-Salam, say, ‘Allah has made His House sacred. He has prohibited uprooting of its grass, cutting down of its trees, except al-Idhkhir, and hunting its birds.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/69)"
        ],
        "index": 6736,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:12:3",
        "refs": {
          "Quran": [
            "/books/quran:12:92",
            "/books/quran:12:96"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَكَّةَ يَوْمَ افْتَتَحَهَا فَتَحَ بَابَ الْكَعْبَةِ فَأَمَرَ بِصُوَرٍ فِي الْكَعْبَةِ فَطُمِسَتْ فَأَخَذَ بِعِضَادَتَيِ الْبَابِ فَقَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ صَدَقَ وَعْدَهُ وَ نَصَرَ عَبْدَهُ وَ هَزَمَ الْأَحْزَابَ وَحْدَهُ مَا ذَا تَقُولُونَ وَ مَا ذَا تَظُنُّونَ",
          "قَالُوا نَظُنُّ خَيْراً وَ نَقُولُ خَيْراً أَخٌ كَرِيمٌ وَ ابْنُ أَخٍ كَرِيمٍ وَ قَدْ قَدَرْتَ ",
          "قَالَ فَإِنِّي أَقُولُ كَمَا قَالَ أَخِي يُوسُفُ لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ يَغْفِرُ اللَّهُ لَكُمْ وَ هُوَ أَرْحَمُ الرَّاحِمِينَ أَلَا إِنَّ اللَّهَ قَدْ حَرَّمَ مَكَّةَ يَوْمَ خَلَقَ السَّمَاوَاتِ وَ الْأَرْضَ فَهِيَ حَرَامٌ بِحَرَامِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ لَا يُنَفَّرُ صَيْدُهَا وَ لَا يُعْضَدُ شَجَرُهَا وَ لَا يُخْتَلَى خَلَاهَا وَ لَا تَحِلُّ لُقَطَتُهَا إِلَّا لِمُنْشِدٍ ",
          "فَقَالَ الْعَبَّاسُ يَا رَسُولَ اللَّهِ إِلَّا الْإِذْخِرَ فَإِنَّهُ لِلْقَبْرِ وَ الْبُيُوتِ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَّا الْإِذْخِرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said; ‘When Rasool-Allah<sup>saww</sup> stepped into Makkah on the day he<sup>saww</sup> conquered Makkah, opened the door of the Kabah and ordered with the images in the Kabah so they were obliterated. Then he<sup>saww</sup> grabbed to two sides of the door, so he<sup>saww</sup> said: ‘There is no god except for Allah<sup>azwj</sup>, One, there being no associates for Him<sup>azwj</sup>. True in His<sup>azwj</sup> Promise, Helping His<sup>azwj</sup> servants, and Defeating the (Polytheist) confederates Alone. What is that which you all are saying?’",
            "They (people) said, ‘We think good and we are saying good, O son<sup>saww</sup> of a benevolent one, and a cousin of a benevolent one, and you have become powerful’. ",
            "He<sup>saww</sup> said: ‘So I<sup>saww</sup> am saying just as my<sup>saww</sup> brother<sup>as</sup> Yusuf<sup>as</sup> said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:12#h92\">[12:92]</a> He said: (There shall be) no reprach against you this day; May Allah Forgive you, and He is the most Merciful of the merciful ones</span>. Indeed! Allah<sup>azwj</sup> had Sanctified Makkah on the day He<sup>azwj</sup> Created the skies and the earth. Thus, it would be a Al-Harram by the Sanctity of Allah<sup>azwj</sup> up to the Day of Judgement. Neither can anyone drive away its preys, nor tamper with its trees, nor vacate it to be empty, nor to keep lost items except for publicising it’. ",
            "So Al-Abbas said, ‘O Rasool-Allah<sup>saww</sup>! Except for Al-Izkhir (a fragrant tropical grass), for it is for the grave and the houses’. So Rasool-Allah<sup>saww</sup> said: ‘Except for Al-Izkhir (a fragrant tropical grass)’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, arrived in Makkah on the day of its liberation, he opened the door of al-Ka‘bah and ordered the pictures that were on the walls deleted. He was then holding the doorjamb on both sides and said, ‘No one except Allah deserves worship. He is the only One and has no partner. He makes His promise to come true, supports His servant, defeats the parties all by Himself alone. What do you say and what do you think?’ They replied, ‘We think good and say good about you. You are gracious brethren, the son of gracious brethren and you now certainly are powerful.’ He then said, ‘I then say what my brother Yusuf (Joseph) had said, “I place no blame on you this day. Allah forgives and He is most merciful of the merciful ones.” <a href=\"/#/books/quran:12#h96\">[12:96]</a> However, Allah made Makkah a sacred place on the day He created the skies and earth. Therefore, it is sacred because of Allah’s prohibition until the Day of Judgment. Hunting in it is not permissible; cutting its trees is not permissible; uprooting its grass is not permissible; and keeping findings therein is not permissible unless it is to find the owner.’ Al- ‘Abbas then said, ‘O Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, ‘Is al-Idhkhir an exception? It is used for burial and houses.’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, ‘al-Idhkhir is an exception.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/69)"
        ],
        "index": 6737,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:12:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَوْمَ فَتْحِ مَكَّةَ إِنَّ اللَّهَ حَرَّمَ مَكَّةَ يَوْمَ خَلَقَ السَّمَاوَاتِ وَ الْأَرْضَ وَ هِيَ حَرَامٌ إِلَى أَنْ تَقُومَ السَّاعَةُ لَمْ تَحِلَّ لِأَحَدٍ قَبْلِي وَ لَا تَحِلُّ لِأَحَدٍ بَعْدِي وَ لَمْ تَحِلَّ لِي إِلَّا سَاعَةً مِنْ نَهَارٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazan, altogether from Ibn Abu Umeyr, from Muawiya Bin Ammar who said, ",
            "‘Rasool-Allah<sup>saww</sup> said on the day he<sup>saww</sup> conquered Makkah that: ‘Allah<sup>azwj</sup> Sanctified Makkah the day He<sup>azwj</sup> Created the skies and the earth, and it is a Al-Harram up to the Establishment of the Hour. It was not unrestricted for anyone before me<sup>saww</sup>, and it will not be unrestricted for anyone after me<sup>saww</sup>, and it is not unrestricted for me<sup>saww</sup> except for ‘a time’ of ‘a day’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan all from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “He (the Imam) has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, on the day of liberation of Makkah said, ‘Allah made Makkah sacred (restricted) on the day He created the skies and earth and it remains sacred until the Hour of doom. It never was unsacred (unrestricted) for anyone before me, it will never be unsacred for anyone after me, and it is not unsacred (unrestricted) for me except for one hour during the day (to deal with the enemy).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:12",
  "kind": "verse_list"
}