{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 127"
        },
        "path": "/books/al-kafi:4:3:127",
        "titles": {
          "ar": "بَابُ حَدِّ مَوْضِعِ الطَّوَافِ",
          "en": "Chapter 127 – Boundary of the place of the Tawaaf"
        }
      }
    ],
    "index": 1070,
    "local_index": 127,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 128"
        },
        "path": "/books/al-kafi:4:3:128",
        "titles": {
          "ar": "بَابُ حَدِّ الْمَشْيِ فِي الطَّوَافِ",
          "en": "Chapter 128 – Limit of the walking during the Tawaaf"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 126"
        },
        "path": "/books/al-kafi:4:3:126",
        "titles": {
          "ar": "بَابُ أَنَّ الصَّلَاةَ وَ الطَّوَافَ أَيُّهُمَا أَفْضَلُ",
          "en": "Chapter 126 – The Prayer and the Tawaaf, which of the two is superior"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:127",
    "titles": {
      "ar": "بَابُ حَدِّ مَوْضِعِ الطَّوَافِ",
      "en": "Chapter 127 – Boundary of the place of the Tawaaf"
    },
    "verse_count": 1,
    "verse_start_index": 7494,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/31)"
        ],
        "index": 7495,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/109",
              "text": "غَيْرُهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2287",
              "text": "يَاسِينَ الضَّرِيرِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/210",
              "text": "حَرِيزِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يَاسِينَ الضَّرِيرِ عَنْ حَرِيزِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:127:1",
        "text": [
          " سَأَلْتُهُ عَنْ حَدِّ الطَّوَافِ بِالْبَيْتِ الَّذِي مَنْ خَرَجَ مِنْهُ لَمْ يَكُنْ طَائِفاً بِالْبَيْتِ قَالَ كَانَ النَّاسُ عَلَى عَهْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) يَطُوفُونَ بِالْبَيْتِ وَ الْمَقَامِ وَ أَنْتُمُ الْيَوْمَ تَطُوفُونَ مَا بَيْنَ الْمَقَامِ وَ بَيْنَ الْبَيْتِ ",
          "فَكَانَ الْحَدُّ مَوْضِعَ الْمَقَامِ الْيَوْمَ فَمَنْ جَازَهُ فَلَيْسَ بِطَائِفٍ وَ الْحَدُّ قَبْلَ الْيَوْمِ وَ الْيَوْمَ وَاحِدٌ قَدْرَ مَا بَيْنَ الْمَقَامِ وَ بَيْنَ الْبَيْتِ مِنْ نَوَاحِي الْبَيْتِ كُلِّهَا ",
          "فَمَنْ طَافَ فَتَبَاعَدَ مِنْ نَوَاحِيهِ أَبْعَدَ مِنْ مِقْدَارِ ذَلِكَ كَانَ طَائِفاً بِغَيْرِ الْبَيْتِ بِمَنْزِلَةِ مَنْ طَافَ بِالْمَسْجِدِ لِأَنَّهُ طَافَ فِي غَيْرِ حَدٍّ وَ لَا طَوَافَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, and someone else from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Yaseen Al Zareyr, from Hareyz Bin Abdullah, from Muhammad Bin Muslim who said, ",
            "‘I asked him<sup>asws</sup> about the boundary of the <span class=\"iTxt\">Tawaaf</span> by the House (Kaaba), which, if one were to go out from it, would not happen to be a circumambulator of the House (Kaaba). He<sup>asws</sup> said: ‘It was so that the people in the era of Rasool-Allah<sup>saww</sup> were performing <span class=\"iTxt\">Tawaaf</span> by the House (Kaaba) and the Standing Place (of Ibrahim<sup>as</sup>, and you all today are performing <span class=\"iTxt\">Tawaaf</span> what is between the Standing Place (of Ibrahim<sup>as</sup>) and the House (Kaaba). ",
            "So, the boundary today is the place of the Standing Place (of Ibrahim<sup>as</sup>). Therefore the one who exceeds it, so he is not with the <span class=\"iTxt\">Tawaaf</span>. And the boundary before today, and today, is one, measured by what is between the Standing Place (of Ibrahim<sup>as</sup>) and the House (Kaaba) from the surrounding of the House (Kaaba), all of it. ",
            "Thus, the one who performs <span class=\"iTxt\">Tawaaf</span> remotely from its surrounding area, further from that measurement, would be circumambulating by other than the House, being at the status of the one who performs <span class=\"iTxt\">Tawaaf</span> by the Masjid, because he would be performing <span class=\"iTxt\">Tawaaf</span> in another boundary, and there is no <span class=\"iTxt\">Tawaaf</span> for him’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya and others have narrated from Muhammad ibn Ahmad from Muhammad ibn ‘Isa from Yasin al-Darir from Hariz ibn ‘ Abd Allah from Muhammad ibn Muslim who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the limits of the area for Tawaf around the House and the point beyond which Tawaf is not considered as Tawaf around the House. He (the Imam) said, ‘During the time of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, people performed Tawaf around the House and Maqam (station) of Ibrahim ‘Alayhi al-Salam (the station was attached to the House). Today you perform Tawaf between the House and Maqam (station) of Ibrahim ‘Alayhi al-Salam. Today the limit is Maqam (station) of Ibrahim ‘Alayhi al-Salam. Whoever goes beyond it is not doing Tawaf. The limit today and before is one, that is, between the House and Maqam (station) of Ibrahim ‘Alayhi al-Salam, all around the House. If one performs Tawaf and goes beyond the area which is away from the House more than Maqam (station) of Ibrahim ‘Alayhi al-Salam is, he is not doing Tawaf around the House; he has performed Tawaf around something which is other than the House which, is like performing Tawaf around the Masjid. It is because he has performed Tawaf in something which is beyond the limit and his Tawaf is not valid/” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:127",
  "kind": "verse_list"
}