{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 129"}, "path": "/books/al-kafi:4:3:129", "titles": {"ar": "بَابُ الرَّجُلِ يَطُوفُ فَتَعْرِضُ لَهُ الْحَاجَةُ أَوِ الْعِلَّةُ", "en": "Chapter 129 – The man performs Tawaaf, so a need presents itself to him, or an illness"}}], "index": 1072, "local_index": 129, "part_type": "Chapter", "path": "/books/al-kafi:4:3:129", "titles": {"ar": "بَابُ الرَّجُلِ يَطُوفُ فَتَعْرِضُ لَهُ الْحَاجَةُ أَوِ الْعِلَّةُ", "en": "Chapter 129 – The man performs Tawaaf, so a need presents itself to him, or an illness"}, "verse_count": 7, "verse_start_index": 7496, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 7497, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:129:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ طَافَ شَوْطاً أَوْ شَوْطَيْنِ ثُمَّ خَرَجَ مَعَ رَجُلٍ فِي حَاجَةٍ فَقَالَ إِنْ كَانَ طَوَافَ نَافِلَةٍ بَنَى عَلَيْهِ وَ إِنْ كَانَ طَوَافَ فَرِيضَةٍ لَمْ يَبْنِ عَلَيْهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, from Aban Bin Taghlub, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who performs <span class=\"iTxt\">Tawaaf</span> one circuit, or two circuits, then goes out with a man regarding a need. So he<sup>asws</sup> said: ‘If it was such that it’s was an optional <span class=\"iTxt\">Tawaaf</span>, he would build upon it (and complete the seven circuits), but if it was such that it was an Obligatory <span class=\"iTxt\">Tawaaf</span>, he would not build upon it (i.e., repeat it)’."]}}, {"index": 7498, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:129:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي الرَّجُلِ يُحْدِثُ فِي طَوَافِ الْفَرِيضَةِ وَ قَدْ طَافَ بَعْضَهُ قَالَ يَخْرُجُ فَيَتَوَضَّأُ فَإِنْ كَانَ جَازَ النِّصْفَ بَنَى عَلَى طَوَافِهِ وَ إِنْ كَانَ أَقَلَّ مِنَ النِّصْفِ أَعَادَ الطَّوَافَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of our companions, ", "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the man who excretes wind during the Obligatory <span class=\"iTxt\">Tawaaf</span>, and he had circumambulated part of it. He<sup>asws</sup> said: ‘He should go out and perform ablution. So if he had completed the half, he would build upon his <span class=\"iTxt\">Tawaaf</span>; and if it was less than half, he would repeat the <span class=\"iTxt\">Tawaaf</span>’."]}}, {"index": 7499, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:129:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ فَضَّالٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عِمْرَانَ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ طَافَ بِالْبَيْتِ ثَلَاثَةَ أَشْوَاطٍ مِنَ الْفَرِيضَةِ ثُمَّ وَجَدَ خَلْوَةً مِنَ الْبَيْتِ فَدَخَلَهُ كَيْفَ يَصْنَعُ فَقَالَ يَقْضِي طَوَافَهُ وَ قَدْ خَالَفَ السُّنَّةَ فَلْيُعِدْ طَوَافَهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Hassan Bin Fazzal, from Hammad Bin Isa, from Imran Al Halby who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who performed <span class=\"iTxt\">Tawaaf</span> by the House (Kaaba), three circuits from the Obligatory one. Then he found empty space from the House (Kaaba). So he entered it. How should he deal with it?’ So he<sup>asws</sup> said: ‘He should fulfil his <span class=\"iTxt\">Tawaaf</span>, and he has opposed the Sunnah, therefore upon him is his <span class=\"iTxt\">Tawaaf</span> (to repeat)’."]}}, {"index": 7500, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:129:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا طَافَ الرَّجُلُ بِالْبَيْتِ أَشْوَاطاً ثُمَّ اشْتَكَى أَعَادَ الطَّوَافَ يَعْنِي الْفَرِيضَةَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the man performs <span class=\"iTxt\">Tawaaf</span> by the House, a few circuits, then complains, should repeat the <span class=\"iTxt\">Tawaaf</span>, meaning the Obligatory one’."]}}, {"index": 7501, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:129:5", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي رَجُلٍ طَافَ طَوَافَ الْفَرِيضَةِ ثُمَّ اعْتَلَّ عِلَّةً لَا يَقْدِرُ مَعَهَا عَلَى تَمَامِ الطَّوَافِ فَقَالَ إِنْ كَانَ طَافَ أَرْبَعَةَ أَشْوَاطٍ أَمَرَ مَنْ يَطُوفُ عَنْهُ ثَلَاثَةَ أَشْوَاطٍ فَقَدْ تَمَّ طَوَافُهُ وَ إِنْ كَانَ طَافَ ثَلَاثَةَ أَشْوَاطٍ وَ لَا يَقْدِرُ عَلَى الطَّوَافِ فَإِنَّ هَذَا مِمَّا غَلَبَ اللَّهُ عَلَيْهِ فَلَا بَأْسَ بِأَنْ يُؤَخِّرَ الطَّوَافَ يَوْماً وَ يَوْمَيْنِ ", "فَإِنْ خَلَّتْهُ الْعِلَّةُ عَادَ فَطَافَ أُسْبُوعاً وَ إِنْ طَالَتْ عِلَّتُهُ أَمَرَ مَنْ يَطُوفُ عَنْهُ أُسْبُوعاً وَ يُصَلِّي هُوَ رَكْعَتَيْنِ وَ يَسْعَى عَنْهُ وَ قَدْ خَرَجَ مِنْ إِحْرَامِهِ وَ كَذَلِكَ يَفْعَلُ فِي السَّعْيِ وَ فِي رَمْيِ الْجِمَار."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Is’haq Bin Ammar, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding a man who circumambulated the Obligatory <span class=\"iTxt\">Tawaaf</span>. Then becomes unwell with such an illness that he is unable, along with it, upon completing the <span class=\"iTxt\">Tawaaf</span>. So he<sup>asws</sup> said: ‘If he had performed four circuits, he can instruct someone to perform three circuits on his behalf; and if he had performed three circuits, and he was not able upon the <span class=\"iTxt\">Tawaaf</span>, so this one is from the one whom Allah<sup>azwj</sup> has Overcome upon. Therefore, there is no problem if he was to delay the <span class=\"iTxt\">Tawaaf</span> for a day, and two days. ", "So if his illness leaves him, he would repeat, and he would perform seven (circuits). But, if his illness prolongs, he can instruct someone to perform <span class=\"iTxt\">Tawaaf</span> on his behalf, seven (circuits), and he would Pray two Cycles, and perform Sa’ee on his behalf, and he would have come out from his Ihraam. And similar to that he would do regarding the Sa’ee, and regarding the pelting of the rocks’."]}}, {"index": 7502, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:129:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي عَزَّةَ قَالَ مَرَّ بِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا فِي الشَّوْطِ الْخَامِسِ مِنَ الطَّوَافِ فَقَالَ لِي انْطَلِقْ حَتَّى نَعُودَ هَاهُنَا رَجُلًا فَقُلْتُ لَهُ إِنَّمَا أَنَا فِي خَمْسَةِ أَشْوَاطٍ فَأُتِمُّ أُسْبُوعِي قَالَ اقْطَعْهُ وَ احْفَظْهُ مِنْ حَيْثُ تَقْطَعُ حَتَّى تَعُودَ إِلَى الْمَوْضِعِ الَّذِي قَطَعْتَ مِنْهُ فَتَبْنِيَ عَلَيْهِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abdul Aziz, from Abu Azza who said, ", "‘Abu Abdullah<sup>asws</sup> passed by me, and I was in the fifth circuit from the <span class=\"iTxt\">Tawaaf</span>’. So he<sup>asws</sup> said to me: ‘Go, until we bid farewell to a man over there’. So I said to him<sup>asws</sup>, ‘But rather, I am in the fifth circuit, so I should complete by seven’. He<sup>asws</sup> said: ‘Cut it, and memorise it from where you have cut until you return to the place which you cut if off from, and build upon it’."]}}, {"index": 7503, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:129:7", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنْ سُكَيْنِ بْنِ عَمَّارٍ عَنْ رَجُلٍ مِنْ أَصْحَابِنَا يُكَنَّى أَبَا أَحْمَدَ قَالَ كُنْتُ مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الطَّوَافِ يَدُهُ فِي يَدِي إِذْ عَرَضَ لِي رَجُلٌ لَهُ إِلَيَّ حَاجَةٌ فَأَوْمَأْتُ إِلَيْهِ بِيَدِي فَقُلْتُ لَهُ كَمَا أَنْتَ حَتَّى أَفْرُغَ مِنْ طَوَافِي فَقَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا هَذَا قُلْتُ أَصْلَحَكَ اللَّهُ رَجُلٌ جَاءَنِي فِي حَاجَةٍ فَقَالَ لِي مُسْلِمٌ هُوَ قُلْتُ نَعَمْ ", "فَقَالَ لِي اذْهَبْ مَعَهُ فِي حَاجَتِهِ فَقُلْتُ لَهُ أَصْلَحَكَ اللَّهُ فَأَقْطَعُ الطَّوَافَ فَقَالَ نَعَمْ قُلْتُ وَ إِنْ كُنْتُ فِي الْمَفْرُوضِ قَالَ نَعَمْ وَ إِنْ كُنْتَ فِي الْمَفْرُوضِ ", "قَالَ وَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ مَشَى مَعَ أَخِيهِ الْمُسْلِمِ فِي حَاجَتِهِ كَتَبَ اللَّهُ لَهُ أَلْفَ أَلْفِ حَسَنَةٍ وَ مَحَا عَنْهُ أَلْفَ أَلْفِ سَيِّئَةٍ وَ رَفَعَ لَهُ أَلْفَ أَلْفِ دَرَجَةٍ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad Bin Ismail Bin Bazie, from Abu Ismail Al Sarraj, from Sukeyn Bin Ammar, from a man from our companions teknonymed as Abu Ahmad, who said, ", "‘I was with Abu Abdullah<sup>asws</sup> in the <span class=\"iTxt\">Tawaaf</span>, his<sup>asws</sup> hand being in my hand, when a man presented himself to me having a need for him to me. So, I gestured to him with my hand saying, ‘Stay where you are until I am free from my <span class=\"iTxt\">Tawaaf</span>’. So Abu Abdullah<sup>asws</sup> said to me: ‘Who is this?’ I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! A man who came to me regarding a need’. So he<sup>asws</sup> said to me: ‘Is he a Muslim?’ I said, ‘Yes’. ", "So he<sup>asws</sup> said to me: ‘Go with him regarding his need’. So I said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! So I should cut the <span class=\"iTxt\">Tawaaf</span>?’ So he<sup>asws</sup> said: ‘Yes’. I said, ‘And even if I was in the Obligatory one?’ He<sup>asws</sup> said: ‘Yes, and even if you were in the Obligatory one’. ", "He (the narrator) said, ‘And Abu Abdullah<sup>asws</sup> said: ‘And the one who walks along with his Muslim brother with regards to his need, Allah<sup>azwj</sup> would Write for him a thousand thousand good deeds, and Delete from him a thousand thousand sins, and Rasie for him a thousand thousand Levels’."]}}]}, "index": "al-kafi:4:3:129", "kind": "verse_list"}