{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:4:3:13",
        "titles": {
          "ar": "بَابٌ فِي قَوْلِهِ تَعَالَى وَ مَنْ دَخَلَهُ كانَ آمِناً",
          "en": "Chapter 13 – Regarding the Words of the Exalted [3:97] and whoever enters it shall be secure"
        }
      }
    ],
    "index": 956,
    "local_index": 13,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:4:3:14",
        "titles": {
          "ar": "بَابُ الْإِلْحَادِ بِمَكَّةَ وَ الْجِنَايَاتِ",
          "en": "Chapter 14 – Heresy in Makkah and the crimes"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:4:3:12",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ اللَّهَ</span> عَزَّ وَ جَلَّ حَرَّمَ مَكَّةَ حِينَ خَلَقَ السَّمَاوَاتِ وَ الْأَرْضَ ",
          "en": "Chapter 12 – Allah<sup>azwj</sup> Mighty and Majestic Sancified Makkah when He<sup>azwj</sup> Created the skies and the earth"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:13",
    "titles": {
      "ar": "بَابٌ فِي قَوْلِهِ تَعَالَى وَ مَنْ دَخَلَهُ كانَ آمِناً",
      "en": "Chapter 13 – Regarding the Words of the Exalted [3:97] and whoever enters it shall be secure"
    },
    "verse_count": 3,
    "verse_start_index": 6737,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/70)"
        ],
        "index": 6738,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:13:1",
        "refs": {
          "Quran": [
            "/books/quran:3:97",
            "/books/quran:3:96"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ دَخَلَهُ كانَ آمِناً الْبَيْتَ عَنَى أَمِ الْحَرَمَ قَالَ مَنْ دَخَلَ الْحَرَمَ مِنَ النَّاسِ مُسْتَجِيراً بِهِ فَهُوَ آمِنٌ مِنْ سَخَطِ اللَّهِ وَ مَنْ دَخَلَهُ مِنَ الْوَحْشِ وَ الطَّيْرِ كَانَ آمِناً مِنْ أَنْ يُهَاجَ أَوْ يُؤْذَى حَتَّى يَخْرُجَ مِنَ الْحَرَمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h97\">[3:97]</a> and whoever enters it shall be secure</span>. Is it the House (Kabah) which is Meant by it or the Al-Harram?’ He<sup>asws</sup> said: ‘The one from the people who enters the Al-Harram seeking refuge with it, so he is secure from the Wrath of Allah<sup>azwj</sup>; and the ones from the wild animals and the birds who enter it would be secure from being flustered and harmed until they exit from the Al-Harram’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from ‘ Abd Allah ibn Sinan who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, the Most Majestic, the Most Glorious, ‘Whoever enters it (al-Haram, the Sacred area) gains immunity. 5 <a href=\"/#/books/quran:3#h96\">[3:96]</a> Does it refer to the House only or it applies to al-Harm also? 5 He (the Imam) replied, ‘Of the people whoever enters, seeking refuge and protection therein, he is immune from the anger of Allah. Those of beasts and birds which enter al-Haram are also immune from mistreatment and injuries until they leave al- Haram. ‘“"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/71)"
        ],
        "index": 6739,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:13:2",
        "refs": {
          "Quran": [
            "/books/quran:3:97",
            "/books/quran:3:96"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ دَخَلَهُ كانَ آمِناً قَالَ إِذَا أَحْدَثَ الْعَبْدُ فِي غَيْرِ الْحَرَمِ جِنَايَةً ثُمَّ فَرَّ إِلَى الْحَرَمِ لَمْ يَسَعْ لِأَحَدٍ أَنْ يَأْخُذَهُ فِي الْحَرَمِ وَ لَكِنْ يُمْنَعُ مِنَ السُّوقِ وَ لَا يُبَايَعُ وَ لَا يُطْعَمُ وَ لَا يُسْقَى وَ لَا يُكَلَّمُ فَإِنَّهُ إِذَا فُعِلَ ذَلِكَ بِهِ يُوشِكُ أَنْ يَخْرُجَ فَيُؤْخَذَ ",
          "وَ إِذَا جَنَى فِي الْحَرَمِ جِنَايَةً أُقِيمَ عَلَيْهِ الْحَدُّ فِي الْحَرَمِ لِأَنَّهُ لَمْ يَدَعْ لِلْحَرَمِ حُرْمَتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h97\">[3:97]</a> and whoever enters it shall be secure</span>. He<sup>asws</sup> said: ‘When the servant commits a felony in other than the Al-Harram, then he flees into the Al-Harram, there is no leeway for anyone that he seizes him inside the Al-Harram. But he can be prevented from the market, and he can neither sell, nor feed, nor drink, nor speak (to anyone). So when that is done with him, he would desire to come out, and he would be seized.",
            "And when he commits a crime inside the Al-Harram with a felony, the Legal Punishment (Hadd) would be established upon him inside the Al-Harram, because he did not leave for the Al-Harram, its Sanctity’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, the Most Majestic, the Most Glorious, ‘Whoever enters it (al-Haram, the sacred area) gains immunity. 5 <a href=\"/#/books/quran:3#h96\">[3:96]</a> He (the Imam) said, ‘If a servant (of Allah) commits a crime outside al-Haram (the sacred area) then flees to al- Haram, no one can arrest him inside al-Haram; however, he can be stopped from entering the market place, to buy or sell; he is not fed, provided drink or spoken to. If this is done, he eventually leaves; then he can be arrested. If one commits a crime inside al-Haram, he is brought to justice inside al- Haram; he has violated the sanctity of al-Haram.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/72)"
        ],
        "index": 6740,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:13:3",
        "refs": {
          "Quran": [
            "/books/quran:3:97",
            "/books/quran:3:96"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ دَخَلَهُ كانَ آمِناً قَالَ إِنْ سَرَقَ سَارِقٌ بِغَيْرِ مَكَّةَ أَوْ جَنَى جِنَايَةً عَلَى نَفْسِهِ فَفَرَّ إِلَى مَكَّةَ لَمْ يُؤْخَذْ مَا دَامَ فِي الْحَرَمِ حَتَّى يَخْرُجَ مِنْهُ وَ لَكِنْ يُمْنَعُ مِنَ السُّوقِ وَ لَا يُبَايَعُ وَ لَا يُجَالَسُ حَتَّى يَخْرُجَ مِنْهُ فَيُؤْخَذَ وَ إِنْ أَحْدَثَ فِي الْحَرَمِ ذَلِكَ الْحَدَثَ أُخِذَ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h97\">[3:97]</a> and whoever enters it shall be secure</span>. He<sup>asws</sup> said: ‘If a thief were to steal in other than Makkah or commits a felony (offence) upon himself, so he flees to Makkah, he would not be seized for as long as he in inside the Al-Harram, until he comes out from it. But he can be prevented from the market, and he can neither sell, nor sat with, until he comes out from it, and he would be seized. And, if he was to do (a crime) inside the Al-Harram that which he did, he would be seized inside it’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the meaning of the words of Allah, ‘Whoever enters it he gains immunity. 5 <a href=\"/#/books/quran:3#h96\">[3:96]</a> He (the Imam) said, ‘If a thief steals something in a place other than Makkah or commits a crime against his own self, then flees to Makkah, he cannot be arrested in al-Haram (the sacred area) until he comes out. However, he can be stopped from going to the market places, selling, buying and from sitting with people until he goes out of al-Haram (the sacred area), then he can be arrested, but if he commits such things inside al-Haram (the sacred area) he can be arrested and taken in custody. ‘“"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:13",
  "kind": "verse_list"
}