{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 134"}, "path": "/books/al-kafi:4:3:134", "titles": {"ar": "بَابُ مَنْ طَافَ عَلَى غَيْرِ وُضُوءٍ", "en": "Chapter 134 – The one who performs Tawaaf without being in ablution"}}], "index": 1077, "local_index": 134, "part_type": "Chapter", "path": "/books/al-kafi:4:3:134", "titles": {"ar": "بَابُ مَنْ طَافَ عَلَى غَيْرِ وُضُوءٍ", "en": "Chapter 134 – The one who performs Tawaaf without being in ablution"}, "verse_count": 4, "verse_start_index": 7522, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 7523, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:134:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُثَنًّى عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَطُوفُ عَلَى غَيْرِ وُضُوءٍ أَ يَعْتَدُّ بِذَلِكَ الطَّوَافِ قَالَ لَا ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad, from Musna, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who performs <span class=\"iTxt\">Tawaaf</span> without being in ablution. Can he count that as the <span class=\"iTxt\">Tawaaf</span>?’ He<sup>asws</sup> said: ‘No’."]}}, {"index": 7524, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:134:2", "text": ["سَهْلُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ سُئِلَ أَ يَنْسُكُ الْمَنَاسِكَ وَ هُوَ عَلَى غَيْرِ وُضُوءٍ فَقَالَ نَعَمْ إِلَّا الطَّوَافَ بِالْبَيْتِ فَإِنَّ فِيهِ صَلَاةً .", "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."], "translations": {"en.hubeali": ["Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Abu Hamza, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having been asked, ‘Can one perform the rituals and he is without ablution?’ So he<sup>asws</sup> said: ‘Yes, except for the <span class=\"iTxt\">Tawaaf</span> by the House, for in it is a Prayer’.", "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> – similar to it."]}}, {"index": 7525, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:134:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَحَدَهُمَا ( عليهما السلام ) عَنْ رَجُلٍ طَافَ طَوَافَ الْفَرِيضَةِ وَ هُوَ عَلَى غَيْرِ طَهُورٍ قَالَ يَتَوَضَّأُ وَ يُعِيدُ طَوَافَهُ وَ إِنْ كَانَ تَطَوُّعاً تَوَضَّأَ وَ صَلَّى رَكْعَتَيْنِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Ala’a Bin Razeyn, from Muhammad Bin Muslim who said, ", "‘I asked one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) about a man who performs the Obligatory <span class=\"iTxt\">Tawaaf</span>, and he is without purity. He<sup>asws</sup> said: ‘He should perform ablution and he would repeat his <span class=\"iTxt\">Tawaaf</span>. And if it was optional, he should perform ablution and Pray two Cycles’."]}}, {"index": 7526, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:134:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ طَافَ بِالْبَيْتِ وَ هُوَ جُنُبٌ فَذَكَرَ وَ هُوَ فِي الطَّوَافِ قَالَ يَقْطَعُ طَوَافَهُ وَ لَا يَعْتَدُّ بِشَيْ‏ءٍ مِمَّا طَافَ ", "وَ سَأَلْتُهُ عَنْ رَجُلٍ طَافَ ثُمَّ ذَكَرَ أَنَّهُ عَلَى غَيْرِ وُضُوءٍ قَالَ يَقْطَعُ طَوَافَهُ وَ لَا يَعْتَدُّ بِهِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Al Amraky Bin Ali, ", "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who performs <span class=\"iTxt\">Tawaaf</span> by the House (Kaaba), and he was with sexual impurity, and he was in the <span class=\"iTxt\">Tawaaf</span>. He<sup>asws</sup> said: ‘He would cut off his <span class=\"iTxt\">Tawaaf</span> and he would not count with anything from what he had circuited’.", "And I asked him<sup>asws</sup> about a man who performs <span class=\"iTxt\">Tawaaf</span>, then he remembers that he was without ablution. He<sup>asws</sup> said: ‘He should cut off his <span class=\"iTxt\">Tawaaf</span>, and he would not count with it’."]}}]}, "index": "al-kafi:4:3:134", "kind": "verse_list"}