{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 141"}, "path": "/books/al-kafi:4:3:141", "titles": {"ar": "بَابُ الْوُقُوفِ عَلَى الصَّفَا وَ الدُّعَاءِ", "en": "Chapter 141 – The pausing upon Al Safa and the supplication"}}], "index": 1084, "local_index": 141, "part_type": "Chapter", "path": "/books/al-kafi:4:3:141", "titles": {"ar": "بَابُ الْوُقُوفِ عَلَى الصَّفَا وَ الدُّعَاءِ", "en": "Chapter 141 – The pausing upon Al Safa and the supplication"}, "verse_count": 9, "verse_start_index": 7574, "verses": [{"index": 7575, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:141:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حِينَ فَرَغَ مِنْ طَوَافِهِ وَ رَكْعَتَيْهِ قَالَ أَبْدَأُ بِمَا بَدَأَ اللَّهُ عَزَّ وَ جَلَّ بِهِ مِنْ إِتْيَانِ الصَّفَا إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ إِنَّ الصَّفا وَ الْمَرْوَةَ مِنْ شَعائِرِ اللَّهِ\nقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثُمَّ اخْرُجْ إِلَى الصَّفَا مِنَ الْبَابِ الَّذِي خَرَجَ مِنْهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ الْبَابُ الَّذِي يُقَابِلُ الْحَجَرَ الْأَسْوَدَ حَتَّى تَقْطَعَ الْوَادِيَ وَ عَلَيْكَ السَّكِينَةَ وَ الْوَقَارَ فَاصْعَدْ عَلَى الصَّفَا حَتَّى تَنْظُرَ إِلَى الْبَيْتِ وَ تَسْتَقْبِلَ الرُّكْنَ الَّذِي فِيهِ الْحَجَرُ الْأَسْوَدُ وَ احْمَدِ اللَّهَ وَ أَثْنِ عَلَيْهِ ثُمَّ اذْكُرْ مِنْ آلَائِهِ وَ بَلَائِهِ وَ حُسْنِ مَا صَنَعَ إِلَيْكَ مَا قَدَرْتَ عَلَى ذِكْرِهِ\nثُمَّ كَبِّرِ اللَّهَ سَبْعاً وَ احْمَدْهُ سَبْعاً وَ هَلِّلْهُ سَبْعاً وَ قُلْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْيِي وَ يُمِيتُ وَ هُوَ حَيٌّ لَا يَمُوتُ وَ هُوَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ ثَلَاثَ مَرَّاتٍ\nثُمَّ صَلِّ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ قُلِ اللَّهُ أَكْبَرُ عَلَى مَا هَدَانَا وَ الْحَمْدُ لِلَّهِ عَلَى مَا أَوْلَانَا وَ الْحَمْدُ لِلَّهِ الْحَيِّ الْقَيُّومِ وَ الْحَمْدُ لِلَّهِ الْحَيِّ الدَّائِمِ ثَلَاثَ مَرَّاتٍ\nوَ قُلْ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ لَا نَعْبُدُ إِلَّا إِيَّاهُ مُخْلِصِينَ لَهُ الدِّينَ وَ لَوْ كَرِهَ الْمُشْرِكُونَ ثَلَاثَ مَرَّاتٍ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَ الْعَافِيَةَ وَ الْيَقِينَ فِي الدُّنْيَا وَ الْآخِرَةِ ثَلَاثَ مَرَّاتٍ اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْآخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ ثَلَاثَ مَرَّاتٍ\nثُمَّ كَبِّرِ اللَّهَ مِائَةَ مَرَّةٍ وَ هَلِّلْ مِائَةَ مَرَّةٍ وَ احْمَدْ مِائَةَ مَرَّةٍ وَ سَبِّحْ مِائَةَ مَرَّةٍ وَ تَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ أَنْجَزَ وَعْدَهُ وَ نَصَرَ عَبْدَهُ وَ غَلَبَ الْأَحْزَابَ وَحْدَهُ فَلَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ وَحْدَهُ وَحْدَهُ\nاللَّهُمَّ بَارِكْ لِي فِي الْمَوْتِ وَ فِي مَا بَعْدَ الْمَوْتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ ظُلْمَةِ الْقَبْرِ وَ وَحْشَتِهِ اللَّهُمَّ أَظِلَّنِي فِي ظِلِّ عَرْشِكَ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّكَ\nوَ أَكْثِرْ مِنْ أَنْ تَسْتَوْدِعَ رَبَّكَ دِينَكَ وَ نَفْسَكَ وَ أَهْلَكَ ثُمَّ تَقُولُ أَسْتَوْدِعُ اللَّهَ الرَّحْمَنَ الرَّحِيمَ الَّذِي لَا يَضِيعُ وَدَائِعُهُ نَفْسِي وَ دِينِي وَ أَهْلِي اللَّهُمَّ اسْتَعْمِلْنِي عَلَى كِتَابِكَ وَ سُنَّةِ نَبِيِّكَ وَ تَوَفَّنِي عَلَى مِلَّتِهِ وَ أَعِذْنِي مِنَ الْفِتْنَةِ \nثُمَّ تُكَبِّرُ ثَلَاثاً ثُمَّ تُعِيدُهَا مَرَّتَيْنِ ثُمَّ تُكَبِّرُ وَاحِدَةً ثُمَّ تُعِيدُهَا فَإِنْ لَمْ تَسْتَطِعْ هَذَا فَبَعْضَهُ \nوَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَقِفُ عَلَى الصَّفَا بِقَدْرِ مَا يُقْرَأُ سُورَةُ الْبَقَرَةِ مُتَرَتِّلًا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan Bin Yahya, from Ibn Abu Umeyr, from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> that Rasool-Allah<sup>saww</sup>, when he<sup>saww</sup> was free from his<sup>saww</sup> <span class=\"iTxt\">Tawaaf</span> and (Praying of) two Cycles, said: ‘I<sup>saww</sup> hereby begin with what Allah<sup>azwj</sup> Mighty and Majestic Began with, from going to Al-Safa. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[2:158] Surely the Safa and the Marwa are among the Rituals appointed by Allah</span>’.\nAbu Abdullah<sup>asws</sup> said: ‘Then go out to Al-Safa from the door which Rasool-Allah<sup>saww</sup> went out from, and it is the door which faces the Black Stone, until you cut through the valley, and upon you should be the tranquillity and the dignity. So, climb upon Al-Safa until you look at the House (Kabah) and face the corner in which is the Black Stone, and Praise Allah<sup>azwj</sup> and Extol upon Him<sup>azwj</sup>. Then remember His<sup>azwj</sup> Favours and His<sup>azwj</sup> Trials, and the goodness with which He<sup>azwj</sup> has Dealth with you, in accordance to your ability upon His<sup>azwj</sup> Mention. \nThen exclaim the Greatness of Allah<sup>azwj</sup> (Takbeer) seven times, and Praise Him<sup>azwj</sup> seven times, and say, ‘There is no God except for Allah<sup>azwj</sup> Alone, there being no associates for Him<sup>azwj</sup>, from Him<sup>azwj</sup> being the Kingdom and for Him<sup>azwj</sup> being the Praise. He<sup>azwj</sup> Revives and He<sup>azwj</sup> Causes to die, and He<sup>azwj</sup> is Alive and does not die, and He<sup>azwj</sup> is Able upon every thing’ – three times.\nThen Send Blessings upon the Prophet<sup>saww</sup>, and say, ‘Allah<sup>azwj</sup> is the Greatest upon what He<sup>azwj</sup> has Guided us, and the Praise is for Allah<sup>azwj</sup> upon what He<sup>azwj</sup> has Preferred us, and the Praise is for Allah<sup>azwj</sup>, the Living, the Everelasting; and the Praise is for Allah<sup>azwj</sup> the eternally Living’ – three times.\nAnd say, ‘I testify that there is no God except for Allah<sup>azwj</sup>; and I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>. We do not worship except for Him<sup>azwj</sup>, being sincere for Him<sup>azwj</sup> in the Religion, and even though the Polytheists may be averse to it’ – three times. ‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> for Forgiveness, and the well being, and the conviction in the world and the Hereafter’ – three times. ‘O Allah<sup>azwj</sup>! Give us goodness in the world and goodness in the Hereafter and Save us from the Punishment of the Fire’ – three times.\nThen exclaim the Greatness of Allah<sup>azwj</sup> one hundred times, and Extol His<sup>azwj</sup> Holiness one hundred times, and Praise Him<sup>azwj</sup> one hundred times, and Glorify Him<sup>azwj</sup> one hundred times, and you should be saying, ‘There is no god except for Allah<sup>azwj</sup>, Alone, being True to His<sup>azwj</sup> Promise, and Helping His<sup>azwj</sup> servants, and Overcomes all the ones allied (against Him<sup>azwj</sup>). For Him<sup>azwj</sup> is the Kingdom, and for Him<sup>azwj</sup> is the Praise Alone, Alone’. \nO Allah<sup>azwj</sup>! Bless me during the death, and in what is after the death. O Allah<sup>azwj</sup>! I seek Refuge with You<sup>azwj</sup> from the darkness of the grave, and its loneliness. O Allah<sup>azwj</sup>! Shade me in the Shade of Your<sup>azwj</sup> Throne on the Day in which there would be no shade except for Your<sup>azwj</sup> Shade’.\nAnd frequently entrust to your Lord<sup>azwj</sup> for your Religion, and yourself, and your family. Then you should be saying, ‘I entrust to Allah<sup>azwj</sup>, the Beneficent, the Merciful Who does not Waste His<sup>azwj</sup> Entrustments, myself and my Religion, and my family. O Allah<sup>azwj</sup>! Utilise me upon Your<sup>azwj</sup> Book, and Sunnah of Your<sup>azwj</sup> Prophet<sup>saww</sup>, and Cause me to die upon his<sup>saww</sup> Religion, and Shelter me from the strife’.\nThen exclaim Takbeer three times, then repeat it twice, then exclaim Takbeer once,then repeat it. So if you are not able upon this, then (do) part of it.\nAnd Abu Abdullah<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> used to pause upon Al-Safa by a measurement of what it takes to recite Surah Al-Baqarah (Chapter 2), slowly’."}]}, {"index": 7576, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:141:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ قَالَ حَدَّثَنِي جَمِيلٌ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) هَلْ مِنْ دُعَاءٍ مُوَقَّتٍ أَقُولُهُ عَلَى الصَّفَا وَ الْمَرْوَةِ فَقَالَ تَقُولُ إِذَا وَقَفْتَ عَلَى الصَّفَا لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْيِي وَ يُمِيتُ وَ هُوَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ ثَلَاثَ مَرَّاتٍ .\nلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْيِي وَ يُمِيتُ وَ هُوَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Yaqoub Bin Shuayb who said, ‘Jameel narrated to me saying, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘Is there any from a prescribed supplication which I should be saying upon Al-Safa and Al-Marwa?’ So he<sup>asws</sup> said: ‘You should be saying when you pause upon Al-Safa:\n‘There is no god except for Allah<sup>azwj</sup> Alone, there being no associates for him. For Him<sup>azwj</sup> is the Kingdom, and for Him<sup>azwj</sup> is the Praise. He<sup>azwj</sup> Revives and He<sup>azwj</sup> Causes to die, and He<sup>azwj</sup> is Able upon everything – three times."}]}, {"index": 7577, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:141:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) كَيْفَ يَقُولُ الرَّجُلُ عَلَى الصَّفَا وَ الْمَرْوَةِ قَالَ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْيِي وَ يُمِيتُ وَ هُوَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ ثَلَاثَ مَرَّاتٍ .\nلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْيِي وَ يُمِيتُ وَ هُوَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoubm from Zurara who said, \n‘I asked Abu Ja’far<sup>asws</sup>, ‘How should the man be reciting upon Al-Safa and Al-Marwa?’ He<sup>asws</sup> said: ‘He should be saying, \n‘There is no god except fo Allah<sup>azwj</sup>, Alone, there being no associates for Him<sup>azwj</sup>. For Him<sup>azwj</sup> is the Kingdom, and for Him<sup>azwj</sup> is the Praise. He<sup>azwj</sup> Revives and He<sup>azwj</sup> Causes to die, and He<sup>azwj</sup> is Able over every thing – three times’."}]}, {"index": 7578, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:141:4", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الْحَمِيدِ بْنِ سَعِيدٍ قَالَ سَأَلْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) عَنْ بَابِ الصَّفَا قُلْتُ إِنَّ أَصْحَابَنَا قَدِ اخْتَلَفُوا فِيهِ بَعْضُهُمْ يَقُولُ الَّذِي يَلِي السِّقَايَةَ وَ بَعْضُهُمْ يَقُولُ الَّذِي يَلِي الْحَجَرَ فَقَالَ هُوَ الَّذِي يَلِي السِّقَايَةَ مُحْدَثٌ صَنَعَهُ دَاوُدُ وَ فَتَحَهُ دَاوُدُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Safwan Bin Yahya, from Abdul Hameed Bin Saeed who said, \n‘I asked Abu Ibrahim<sup>as</sup> about the door of Al-Safa. I said, ‘Our companions have differed with regards to it. Some of them are saying, ‘(It is that) which is next to the watering place (Zamzam)’, and some of them are saying, ‘(It is that) which is next to the (Black) Stone’.’ So he<sup>asws</sup> said: ‘It is which is next to the watering place (Zamzam). It was newly made by Dawood, and Dawood opened it’."}]}, {"index": 7579, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:141:5", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ يَرْفَعُهُ قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا صَعِدَ الصَّفَا اسْتَقْبَلَ الْكَعْبَةَ ثُمَّ رَفَعَ يَدَيْهِ ثُمَّ يَقُولُ اللَّهُمَّ اغْفِرْ لِي كُلَّ ذَنْبٍ أَذْنَبْتُهُ قَطُّ فَإِنْ عُدْتُ فَعُدْ عَلَيَّ بِالْمَغْفِرَةِ فَإِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ \nاللَّهُمَّ افْعَلْ بِي مَا أَنْتَ أَهْلُهُ فَإِنَّكَ إِنْ تَفْعَلْ بِي مَا أَنْتَ أَهْلُهُ تَرْحَمْنِي وَ إِنْ تُعَذِّبْنِي فَأَنْتَ غَنِيٌّ عَنْ عَذَابِي وَ أَنَا مُحْتَاجٌ إِلَى رَحْمَتِكَ فَيَا مَنْ أَنَا مُحْتَاجٌ إِلَى رَحْمَتِهِ ارْحَمْنِي \nاللَّهُمَّ لَا تَفْعَلْ بِي مَا أَنَا أَهْلُهُ فَإِنَّكَ إِنْ تَفْعَلْ بِي مَا أَنَا أَهْلُهُ تُعَذِّبْنِي وَ لَمْ تَظْلِمْنِي أَصْبَحْتُ أَتَّقِي عَدْلَكَ وَ لَا أَخَافُ جَوْرَكَ فَيَا مَنْ هُوَ عَدْلٌ لَا يَجُورُ ارْحَمْنِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ali Bin Hadeed, from Ali Bin Al Numan, raising it, said, \n‘Amir Al-Momineen<sup>asws</sup>, whenever he<sup>asws</sup> ascended Al-Safa, faced the Kabah, then raised his<sup>asws</sup> hand, then he<sup>asws</sup> was saying: ‘O Allah<sup>azwj</sup>! Forgive me<sup>asws</sup>, every sin that I<sup>asws</sup> have sinned. So if I<sup>asws</sup> were to return (to sinning), then Return to me<sup>asws</sup> with the Forgiveness, for You<sup>azwj</sup> are the Forgiver, the Merciful.\nO Allah<sup>azwj</sup>! Deal with me what You<sup>azwj</sup> are Rightful of, for if You<sup>azwj</sup> were to deal with me what You<sup>azwj</sup> are Rightful of, You<sup>azwj</sup> would be Merciful with me; and if You<sup>azwj</sup> were to Punish me, so You<sup>azwj</sup> are needless from Punishing me, and I am needy to Your<sup>azwj</sup> Mercy. So, since I am needy to Your<sup>azwj</sup> Mercy, be Merciful to me.\nO Allah<sup>azwj</sup>! Do not Deal with me<sup>asws</sup> what I<sup>asws</sup> am deserving of, for if You<sup>azwj</sup> were to Deal with me<sup>asws</sup> what I<sup>asws</sup> am deserving of, You<sup>azwj</sup> would Punish me, and would not be oppressing me<sup>asws</sup>. I<sup>asws</sup> have come to be fearful of Your<sup>azwj</sup> Justice, and I<sup>asws</sup> do not fear Your<sup>azwj</sup> Inequity, since the one who is Just would not be tyrannical. Be Merciful to me!’"}]}, {"index": 7580, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:141:6", "text": "مُحَمَّدُ بْنِ يَحْيَى عَنْ حَمْدَانَ بْنِ سُلَيْمَانَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ الْوَلِيدِ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَرَادَ أَنْ يَكْثُرَ مَالُهُ فَلْيُطِلِ الْوُقُوفَ عَلَى الصَّفَا وَ الْمَرْوَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Hamdan Bin Suleyman, from Al Hassan Bin Ali Bin Al Waleed, raising it, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who intends to boost his wealth, so let him prolong the pausing upon Al-Safa and Al-Marwa’."}]}, {"index": 7581, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:141:7", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ الْحَسَنِ بْنِ أَبِي الْحَسَنِ عَنْ صَالِحِ بْنِ أَبِي الْأَسْوَدِ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَيْسَ عَلَى الصَّفَا شَيْ‏ءٌ مُوَقَّتٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Hassan Bin Abu Al Hassan Bin Abu Al Hassan, from Salih Bin Abu Al Aswad, from Abu Al Jaroud, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘There is nothing (specifically) Prescribed (to be performed) upon Al-Safa’."}]}, {"index": 7582, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:141:8", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مَوْلًى لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِنْ أَهْلِ الْمَدِينَةِ قَالَ رَأَيْتُ أَبَا الْحَسَنِ ( عليه السلام ) صَعِدَ الْمَرْوَةَ فَأَلْقَى نَفْسَهُ عَلَى الْحَجَرِ الَّذِي فِي أَعْلَاهَا فِي مَيْسَرَتِهَا وَ اسْتَقْبَلَ الْكَعْبَةَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, \n(It has been narrated) from a friend of Abu Abdullah<sup>asws</sup> from the people of Al-Medina who said, ‘I saw Abu Al-Hassan<sup>asws</sup> ascend Al-Marwa, so he<sup>asws</sup> attached himself<sup>asws</sup> upon the rock which was at the top part of the pathway, and faced the Kabah’."}]}, {"index": 7583, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:3:141:9", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ أَحْمَدَ بْنِ الْجَهْمِ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ عُمَرَ بْنِ يَزِيدَ عَنْ بَعْضِ أَصْحَابِهِ قَالَ كُنْتُ وَرَاءَ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) عَلَى الصَّفَا أَوْ عَلَى الْمَرْوَةِ وَ هُوَ لَا يَزِيدُ عَلَى حَرْفَيْنِ اللَّهُمَّ إِنِّي أَسْأَلُكَ حُسْنَ الظَّنِّ بِكَ فِي كُلِّ حَالٍ وَ صِدْقَ النِّيَّةِ فِي التَّوَكُّلِ عَلَيْكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Salih Bin Abu Hammad, from Ahmad Bin Al Jaham Al Khazzaz, from Muhammad Bin Uar Bin Yazeed, from one of his companions who said, \n‘We were behind Abu Al-Hassan Musa<sup>asws</sup> upon Al-Safa, or upon Al-Marwa, and he<sup>asws</sup> did not increase upon two words: ‘O Allah<sup>azwj</sup>! I ask You<sup>asws</sup> for having good thoughts about You<sup>azwj</sup> in every state, and truthful intentions during the reliance upon You<sup>azwj</sup>’."}]}]}, "index": "al-kafi:4:3:141", "kind": "verse_list"}