{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 143"
        },
        "path": "/books/al-kafi:4:3:143",
        "titles": {
          "ar": "بَابُ مَنْ بَدَأَ بِالْمَرْوَةِ قَبْلَ الصَّفَا أَوْ سَهَا فِي السَّعْيِ بَيْنَهُمَا",
          "en": "Chapter 143 – The one who begins with Al-Marwa before Al-Safa, or makes a mistake in the Sa’ee between the two"
        }
      }
    ],
    "index": 1086,
    "local_index": 143,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:143",
    "titles": {
      "ar": "بَابُ مَنْ بَدَأَ بِالْمَرْوَةِ قَبْلَ الصَّفَا أَوْ سَهَا فِي السَّعْيِ بَيْنَهُمَا",
      "en": "Chapter 143 – The one who begins with Al-Marwa before Al-Safa, or makes a mistake in the Sa’ee between the two"
    },
    "verse_count": 5,
    "verse_start_index": 7593,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/74)"
        ],
        "index": 7594,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:143:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ بَدَأَ بِالْمَرْوَةِ قَبْلَ الصَّفَا قَالَ يُعِيدُ أَ لَا تَرَى أَنَّهُ لَوْ بَدَأَ بِشِمَالِهِ قَبْلَ يَمِينِهِ فِي الْوُضُوءِ أَرَادَ أَنْ يُعِيدَ الْوُضُوءَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who began with Al-Marwa before Al-Safa. He<sup>asws</sup> said: ‘He should repeat. Do you not see that had he began with his left before his right during the ablution, he would repeat the ablution?’"
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad Ali ibn al-Hakam from Ali ibn abu Hamzah who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about a man who begins from al-Marwah before al- Safa’. He (the Imam) said, ‘He must do it again. Consider if one begins washing his left arms before the right arm for wudu’, he is required to take wudu’ again.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/75)"
        ],
        "index": 7595,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:143:2",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) فِي رَجُلٍ سَعَى بَيْنَ الصَّفَا وَ الْمَرْوَةِ ثَمَانِيَةَ أَشْوَاطٍ مَا عَلَيْهِ فَقَالَ إِنْ كَانَ خَطَأً اطَّرَحَ وَاحِداً وَ اعْتَدَّ بِسَبْعَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abdul Rahmann Bin Al Hajjaj, ",
            "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) regarding a man who performed Sa’ee between Al-Safa and Al-Marwa by eight circuits, what would be upon him?’ So he<sup>asws</sup> said: ‘If he had erred, one would be dropped, and he would be counted with seven’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about a man who performs eight instead of seven times Sa‘y between al-Safa’ and al-Marwah. He (the Imam) said, ‘If it is by mistake, he can consider the extra being dropped and count the seven.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/75)"
        ],
        "index": 7596,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:143:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ قَالَ حَجَجْنَا وَ نَحْنُ صَرُورَةٌ فَسَعَيْنَا بَيْنَ الصَّفَا وَ الْمَرْوَةِ أَرْبَعَةَ عَشَرَ شَوْطاً فَسَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَلِكَ فَقَالَ لَا بَأْسَ سَبْعَةٌ لَكَ وَ سَبْعَةٌ تُطْرَحُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Jameel Bin Darraj who said, ",
            "‘We performed Hajj and we were first timers, and we performed Sa’ee between Al-Safa and Al-Marwa by fourteen circuits. So I asked Abu Abdullah<sup>asws</sup> about that, and he<sup>asws</sup> said: ‘There is no problem – seven are for you and seven are dropped’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Ahmad ibn Muhammad from ibn abu Nasr from Jamil ibn Darraj who has said the following: “We performed al-Hajj as Sarurah (first time performing al-Hajj) so we performed Sa‘y between al- Safa’ and al-Marwah by fourteen times walking between al-Safa’ and al-Marwah. I asked abu ‘Abd Allah, ‘Alayhi al-Salam, about it. He (the Imam) said, ‘It is not harmful, seven is for you and the other seven just being dropped.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/75)"
        ],
        "index": 7597,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:143:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ عَلِيٍّ الصَّائِغِ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا حَاضِرٌ عَنْ رَجُلٍ بَدَأَ بِالْمَرْوَةِ قَبْلَ الصَّفَا قَالَ يُعِيدُ أَ لَا تَرَى أَنَّهُ لَوْ بَدَأَ بِشِمَالِهِ قَبْلَ يَمِينِهِ كَانَ عَلَيْهِ أَنْ يَبْدَأَ بِيَمِينِهِ ثُمَّ يُعِيدَ عَلَى شِمَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Ali Al Sani’e who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked and I was present, about a man who began with Al-Marwa before Al-Safa. He<sup>asws</sup> said: ‘He should repeat. Do you not see that had he began (his ablution) with his left hand before his right hand, upon him would be that he begins with his right hand, then return upon his left hand?’"
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ‘Isma‘il ibn Marrar from Yunus from Ali al-Sa‘igh who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, was asked, when I was present, about a man who begins from al- Marwah instead of from al-Safa’. He (the Imam) said, ‘He must do it again. Consider if you begin with your left arms for wudu’ instead of with your right arm, you must begin with your right arm and then do your left arm again.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/76)"
        ],
        "index": 7598,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:143:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ مَنْ طَافَ بَيْنَ الصَّفَا وَ الْمَرْوَةِ خَمْسَةَ عَشَرَ شَوْطاً طَرَحَ ثَمَانِيَةً وَ اعْتَدَّ بِسَبْعَةٍ وَ إِنْ بَدَأَ بِالْمَرْوَةِ فَلْيَطْرَحْ وَ لْيَبْدَأْ بِالصَّفَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, and Safwan Bin Yahya, from Muawiya Bin Ammar who said, ",
            "‘The one who performs <span class=\"iTxt\">Tawaaf</span> between Al-Safa and Al-Marwa by fifteen circuits, eight would be dropped and he would be counted with seven; and if he began with Al-Marwa, so let him drop (it all) and let him begin with Al-Safa’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Safwan ibn Yahya from Mu‘awiyah ibn ‘Ammar who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘If one performs fifteen times instead of seven times walking between al-Safa’ and al-Marwah he drops eight Shawt (walking once between al-Safa’ and al- Marwah) and counts the seven. If he begins from al-Marwah he must drop it and begin from al- Safa’.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:143",
  "kind": "verse_list"
}