{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 148"
        },
        "path": "/books/al-kafi:4:3:148",
        "titles": {
          "ar": "بَابُ الْمُتَمَتِّعِ تَعْرِضُ لَهُ الْحَاجَةُ خَارِجاً مِنْ مَكَّةَ بَعْدَ إِحْلَالِهِ",
          "en": "Chapter 148 – A need presents itself to the performer of Tumatto, outside of Makkah, after his being free from Ihraam"
        }
      }
    ],
    "index": 1091,
    "local_index": 148,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:148",
    "titles": {
      "ar": "بَابُ الْمُتَمَتِّعِ تَعْرِضُ لَهُ الْحَاجَةُ خَارِجاً مِنْ مَكَّةَ بَعْدَ إِحْلَالِهِ",
      "en": "Chapter 148 – A need presents itself to the performer of Tumatto, outside of Makkah, after his being free from Ihraam"
    },
    "verse_count": 5,
    "verse_start_index": 7621,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/85)"
        ],
        "index": 7622,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:148:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ دَخَلَ مَكَّةَ مُتَمَتِّعاً فِي أَشْهُرِ الْحَجِّ لَمْ يَكُنْ لَهُ أَنْ يَخْرُجَ حَتَّى يَقْضِيَ الْحَجَّ فَإِنْ عَرَضَتْ لَهُ حَاجَةٌ إِلَى عُسْفَانَ أَوْ إِلَى الطَّائِفِ أَوْ إِلَى ذَاتِ عِرْقٍ خَرَجَ مُحْرِماً وَ دَخَلَ مُلَبِّياً بِالْحَجِّ فَلَا يَزَالُ عَلَى إِحْرَامِهِ فَإِنْ رَجَعَ إِلَى مَكَّةَ رَجَعَ مُحْرِماً وَ لَمْ يَقْرَبِ الْبَيْتَ حَتَّى يَخْرُجَ مَعَ النَّاسِ إِلَى مِنًى عَلَى إِحْرَامِهِ وَ إِنْ شَاءَ كَانَ وَجْهُهُ ذَلِكَ إِلَى مِنًى ",
          "قُلْتُ فَإِنْ جَهِلَ وَ خَرَجَ إِلَى الْمَدِينَةِ أَوْ إِلَى نَحْوِهَا بِغَيْرِ إِحْرَامٍ ثُمَّ رَجَعَ فِي إِبَّانِ الْحَجِّ فِي أَشْهُرِ الْحَجِّ يُرِيدُ الْحَجَّ أَ يَدْخُلُهَا مُحْرِماً أَوْ بِغَيْرِ إِحْرَامٍ فَقَالَ إِنْ رَجَعَ فِي شَهْرِهِ دَخَلَ بِغَيْرِ إِحْرَامٍ وَ إِنْ دَخَلَ فِي غَيْرِ الشَّهْرِ دَخَلَ مُحْرِماً ",
          "قُلْتُ فَأَيُّ الْإِحْرَامَيْنِ وَ الْمُتْعَتَيْنِ مُتْعَةِ الْأُولَى أَوِ الْأَخِيرَةِ قَالَ الْأَخِيرَةُ وَ هِيَ عُمْرَتُهُ وَ هِيَ الْمُحْتَبَسُ بِهَا الَّتِي وُصِلَتْ بِحَجِّهِ قُلْتُ فَمَا فَرْقٌ بَيْنَ الْمُفْرَدَةِ وَ بَيْنَ عُمْرَةِ الْمُتْعَةِ إِذَا دَخَلَ فِي أَشْهُرِ الْحَجِّ قَالَ أَحْرَمَ بِالْعُمْرَةِ وَ هُوَ يَنْوِي الْعُمْرَةَ ثُمَّ أَحَلَّ مِنْهَا وَ لَمْ يَكُنْ عَلَيْهِ دَمٌ وَ لَمْ يَكُنْ مُحْتَبِساً بِهَا لِأَنَّهُ لَا يَكُونُ يَنْوِي الْحَجَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who enters Makkah for performing <span class=\"iTxt\">Tumatto</span> during the months of Hajj, it would not be for him that he should go out until he has fulfilled the Hajj. So if a need presents itself to him to (go) to Usfan, or to Al-Taif, or to Zat Irq, he should go out being in <span class=\"iTxt\">Ihraam</span>, and enter exclaiming <span class=\"iTxt\">Talbiyya</span> for the Hajj, thus he would not cease to be in his <span class=\"iTxt\">Ihraam</span>. So if he were to return to Makkah, he should return being in <span class=\"iTxt\">Ihraam</span>, and should not go near the House (Kabah) until he goes out along with the people to Mina upon his <span class=\"iTxt\">Ihraam</span> as if that was his direction to Mina’.",
            "I said, ‘Supposing he does not know and goes out to Al-Medina, or to around it without <span class=\"iTxt\">Ihraam</span>, then he returns at the time of Hajj, during the months of Hajj, intending the Hajj, should he enter it being in <span class=\"iTxt\">Ihraam</span>, or without <span class=\"iTxt\">Ihraam</span>?’ So he<sup>asws</sup> said: ‘If he returns during his month, he would enter without <span class=\"iTxt\">Ihraam</span>, and if enterd during other than the month, would enter in <span class=\"iTxt\">Ihraam</span>’. ",
            "I said, ‘So which of the two <span class=\"iTxt\">Ihraam</span>s, and the two <span class=\"iTxt\">Tumatto</span>s would it be, the first <span class=\"iTxt\">Tumatto</span> or the later one?’ He<sup>asws</sup> said: ‘The later one, and it is his Umra, and it is the one which he is withheld by, which links with his Hajj’. I said, ‘So what is the difference between the exclusive (Hajj) and the Umra <span class=\"iTxt\">Tumatto</span>, when he enters during the months of Hajj?’ He<sup>asws</sup> said: ‘He should wear <span class=\"iTxt\">Ihraam</span> for the Umra and he would be intending the Umra. Then he should free from it and there would not be blood (of a sacrificial animal) upon him, and he would not be reckoned with it, because he did not happen to have intended the Hajj’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One who enters Makkah in the months of al-Hajj for al- Hajj al-Tamattu‘ (advantageous) must not leave Makkah until he completes al-Hajj. If he for an urgent reason needs to go to ‘Usfan or to Ta’if or to Dhat ‘Irq, he must go in the state of Ihram and enter Makkah saying Talbiyah for al-Hajj. He then continues with his Ihram. If he returns to Makkah, he does so in the state of Ihram and must not go near the House until he goes out with people to Mina’ with his Ihram, as if Mina is his destination.’ I then asked, ‘What happens if he out of ignorance goes to al-Madinah or similar places without Ihram, then returns close to the time for al-Hajj in the months of al-Hajj wanting to perform al-Hajj? Must he enter Makkah in the state of Ihram or without it?’ He (the Imam) said, ‘If he returns in the same month he enters without Ihram, but if he enters in another month he must enter in the state of Ihram.’ I then asked, ‘Which one of the two Ihram and two Mut‘ah is it, the first or the later Mut‘ah is the one?’ He (the Imam) said, ‘The last one which is al-‘Umrah and it is on hold which connects with al-Hajj.’ I then asked, ‘What is then the difference between al-‘Umrah of al-Hajj al-Tamattu‘ (advantageous) and al-‘Umrah alone if he enters in the months of al- Hajj?’ He (the Imam) said, ‘He assumed the state of Ihram for al-‘Umrah and wanted al-‘Umrah; then came out of that Ihram in which case was no offering on him (as penalty), and was not on hold with it because he did not have the intention of performing al-Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/86)"
        ],
        "index": 7623,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:148:2",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْمُتَمَتِّعِ يَجِي‏ءُ فَيَقْضِي مُتْعَتَهُ ثُمَّ تَبْدُو لَهُ الْحَاجَةُ فَيَخْرُجُ إِلَى الْمَدِينَةِ أَوْ إِلَى ذَاتِ عِرْقٍ أَوْ إِلَى بَعْضِ الْمَعَادِنِ قَالَ يَرْجِعُ إِلَى مَكَّةَ بِعُمْرَةٍ إِنْ كَانَ فِي غَيْرِ الشَّهْرِ الَّذِي يَتَمَتَّعُ فِيهِ لِأَنَّ لِكُلِّ شَهْرٍ عُمْرَةً وَ هُوَ مُرْتَهَنٌ بِالْحَجِّ ",
          "قُلْتُ فَإِنْ دَخَلَ فِي الشَّهْرِ الَّذِي خَرَجَ فِيهِ قَالَ كَانَ أَبِي مُجَاوِراً هَاهُنَا فَخَرَجَ مُتَلَقِّياً بَعْضَ هَؤُلَاءِ فَلَمَّا رَجَعَ بَلَغَ ذَاتَ عِرْقٍ أَحْرَمَ مِنْ ذَاتِ عِرْقٍ بِالْحَجِّ وَ دَخَلَ وَ هُوَ مُحْرِمٌ بِالْحَجِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ishaq Bin Ammar who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the performer of <span class=\"iTxt\">Tumatto</span> who comes over, so he fulfills his <span class=\"iTxt\">Tumatto</span>, then the need appears for him, so he goes out to Al-Medina, or to Zaat Irq, or to one of the places. He<sup>asws</sup> said: ‘He should return to Makkah for Umra if it was during other than the month in which he performed <span class=\"iTxt\">Tumatto</span> in, because for every month there is an Umra, and he is pledged with the Hajj’. ",
            "I said, ‘Supposing he enters during the month in which he went out?’ He<sup>asws</sup> said: ‘My<sup>asws</sup> was in the vicinity over there. So he<sup>asws</sup> went out to meet some of them. So when he<sup>asws</sup> was returning, he<sup>asws</sup> reached Zaat Irq, he<sup>asws</sup> wore <span class=\"iTxt\">Ihraam</span> from Zaat Irq for the Hajj, and entered (Makkah) and he<sup>asws</sup> was in <span class=\"iTxt\">Ihraam</span> for the Hajj’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Ishaq ibn ‘Ammar who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who is for al-Hajj al-Tamattu‘ (advantageous). He comes and completes his Mut‘ah, then he for a certain work goes to al-Madinah or to Dhat ‘Irq or to a certain other place. He (the Imam) said, ‘He returns to Makkah for al-‘Umrah if it is in the months in which Mut‘ah is performed; for every month there is al-‘Umrah and he is bound with al-Hajj.’ I then asked, ‘What can happen if he enters in the month in which he left?’ He (the Imam) said, ‘My father, ‘Alayhi al-Salam, was residing here and he once went to meet certain ones of these people. When he returned and reached Dhat ‘Irq he assumed the state of Ihram for al-Hajj. He entered in the state of Ihram for al-Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/87)"
        ],
        "index": 7624,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:148:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَتَمَتَّعُ بِالْعُمْرَةِ إِلَى الْحَجِّ يُرِيدُ الْخُرُوجَ إِلَى الطَّائِفِ قَالَ يُهِلُّ بِالْحَجِّ مِنْ مَكَّةَ وَ مَا أُحِبُّ لَهُ أَنْ يَخْرُجَ مِنْهَا إِلَّا مُحْرِماً وَ لَا يَتَجَاوَزُ الطَّائِفَ إِنَّهَا قَرِيبَةٌ مِنْ مَكَّةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man performing <span class=\"iTxt\">Tumatto</span> with the Umra to the Hajj, intending the going out to Al-Taif. He<sup>asws</sup> said: ‘He should begin with the Hajj from Makkah, and I<sup>asws</sup> do no love for him that he should go out from it unless he is in <span class=\"iTxt\">Ihraam</span>, and he should not exceed Al-Taif, it is nearby from Makkah’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is for al-Hajj al-Tamattu‘ (advantageous) but wants to go to Ta’if. He (the Imam) said, ‘He must commence al-Hajj from Makkah and I do not like for him to go out without Ihram. He must not go beyond Ta’if; it is not far from Makkah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/87)"
        ],
        "index": 7625,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:148:4",
        "text": [
          "ابْنُ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ قَضَى مُتْعَتَهُ ثُمَّ عَرَضَتْ لَهُ حَاجَةٌ أَرَادَ أَنْ يَخْرُجَ إِلَيْهَا قَالَ فَقَالَ فَلْيَغْتَسِلْ لِلْإِحْرَامِ وَ لْيُهِلَّ بِالْحَجِّ وَ لْيَمْضِ فِي حَاجَتِهِ وَ إِنْ لَمْ يَقْدِرْ عَلَى الرُّجُوعِ إِلَى مَكَّةَ مَضَى إِلَى عَرَفَاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Abu Umeyr, from Hafs Bin Al Bakhtary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who fulfilled his <span class=\"iTxt\">Tumatto</span>, then a need presented itself to him, so he intended to go out to it’. So he<sup>asws</sup> said: ‘So let him what for the <span class=\"iTxt\">Ihraam</span>, and let him begin with the Hajj, and let him go regarding his need; and if he is not able upon the return to Makkah, he should go to Arafaat’."
          ],
          "en.sarwar": [
            "4. Ibn abu ‘Umayr has narrated from Hafs ibn al-Bakhtariy who has said the following: “About a man who completes Mut‘ah then because of a certain work wants to go out, he (the Imam) said, ‘He must take Ghusl (bath) for Ihram and say Talbiyah for al-Hajj, then go for his work and if he cannot return to Makkah he must go straight to ‘Arafat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/87)"
        ],
        "index": 7626,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:148:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَمَّنْ ذَكَرَهُ عَنْ أَبَانٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْمُتَمَتِّعُ هُوَ مُحْتَبِسٌ لَا يَخْرُجُ مِنْ مَكَّةَ حَتَّى يَخْرُجَ إِلَى الْحَجِّ إِلَّا أَنْ يَأْبِقَ غُلَامُهُ أَوْ تَضِلَّ رَاحِلَتُهُ فَيَخْرُجَ مُحْرِماً وَ لَا يُجَاوِزُ إِلَّا عَلَى قَدْرِ مَا لَا تَفُوتُهُ عَرَفَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from the one who mentioned it, from Aban, from the one who informed him, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The performer of <span class=\"iTxt\">Tumatto</span> is withheld. He cannot go out from Makkah until he goes out to the Hajj, unless if his slave absconds, or his ride goes astray, so he would go out in <span class=\"iTxt\">Ihraam</span>, and he cannot do so except upon a measurement of what would not make him loose (the day of) Arafaat’."
          ],
          "en.sarwar": [
            "5. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from those whom he has mentioned from Aban from those who narrated to him who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One who is for al-Hajj al-Tamattu‘ (advantageous) is on hold. He cannot go out of Makkah until he goes out for al-Hajj, unless his slave runs away or his stumper is lost, in which case he can go out of Makkah in the state of Ihram but he must reach ‘Arafat in time.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:148",
  "kind": "verse_list"
}