{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 154"
        },
        "path": "/books/al-kafi:4:3:154",
        "titles": {
          "ar": "بَابٌ نَادِرٌ",
          "en": "Chapter 154 – Miscellaneous"
        }
      }
    ],
    "index": 1097,
    "local_index": 154,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:154",
    "titles": {
      "ar": "بَابٌ نَادِرٌ",
      "en": "Chapter 154 – Miscellaneous"
    },
    "verse_count": 5,
    "verse_start_index": 7651,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/100)"
        ],
        "index": 7652,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:154:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ جَارِيَةٍ لَمْ تَحِضْ خَرَجَتْ مَعَ زَوْجِهَا وَ أَهْلِهَا فَحَاضَتْ فَاسْتَحْيَتْ أَنْ تُعْلِمَ أَهْلَهَا وَ زَوْجَهَا حَتَّى قَضَتِ الْمَنَاسِكَ وَ هِيَ عَلَى تِلْكَ الْحَالِ فَوَاقَعَهَا زَوْجُهَا ثُمَّ رَجَعَتْ إِلَى الْكُوفَةِ فَقَالَتْ لِأَهْلِهَا كَانَ مِنَ الْأَمْرِ كَذَا وَ كَذَا قَالَ عَلَيْهَا سَوْقُ بَدَنَةٍ وَ عَلَيْهَا الْحَجُّ مِنْ قَابِلٍ وَ لَيْسَ عَلَى زَوْجِهَا شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Is’haq Bin Ammar who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about a girl who had yet to menstruate goes out with her husband and her family. So she menstruates, but she is too embarrassed to let her family and her husband know until she fulfils the rituals, and she is upon that state. So her husband falls upon her. Then she returns to Al-Kufa, and she says to her family, ‘There was from the matter, such and such’. He<sup>asws</sup> said: ‘Upon her is ushering of a camel (for sacrifice), and upon her is the Hajj in the future, and there is nothing upon her husband’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Ishaq ibn ‘Ammar who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about the case of a girl (young woman) who did not experience Hayd (menses), traveled with her husband and family and began to experience Hayd (menses); but felt embarrassed to tell her husband or family until they completed all acts and she was in that condition. Her husband had sexual intercourse with her. They returned to al-Kufah and she told it (her story) to her family. He (the Imam) said, ‘She owes to drive a badanah and al-Hajj in future. Her husband is not obligated for anything in this matter.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/100)"
        ],
        "index": 7653,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:154:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ حَمَّادٍ عَنْ رَجُلٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا طَافَتِ الْمَرْأَةُ الْحَائِضُ ثُمَّ أَرَادَتْ أَنْ تُوَدِّعَ الْبَيْتَ فَلْتَقِفْ عَلَى أَدْنَى بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ وَ لْتُوَدِّعِ الْبَيْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Ali Bin Al Husayn, from Muhammad Bin Ziyad, from Hammad, from a man who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When the menstruating woman performs <span class=\"iTxt\">Tawaaf</span>, then she intends to bid farewell to the House (Kabah), so let her stand upon the nearest door from the doors of the Masjid, and let her bid farewell to the House (Kabah)’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Salmah ibn al-Khattab from Ali ibn al-Husayn from Muhammad ibn Ziyad from Hammad from a man who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘A woman experiencing Hayd (menses) who has performed Tawaf then wants to say farewell to the House, should stand near any of the doors of the Masjid and say farewell to the House.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/101)"
        ],
        "index": 7654,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:154:3",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ أَرْسَلْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ بَعْضَ مَنْ مَعَنَا مِنْ صَرُورَةِ النِّسَاءِ قَدِ اعْتَلَلْنَ فَكَيْفَ تَصْنَعُ فَقَالَ تَنْتَظِرُ مَا بَيْنَهَا وَ بَيْنَ التَّرْوِيَةِ فَإِنْ طَهُرَتْ فَلْتُهِلَّ وَ إِلَّا فَلَا تَدْخُلَنَّ عَلَيْهَا التَّرْوِيَةُ إِلَّا وَ هِيَ مُحْرِمَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I sent a message to Abu Abdullah<sup>asws</sup> that one of us, from the women first timers has fallen ill, so what should she do?’ So he<sup>asws</sup> said: ‘She would wait what is between her and the (day of the Tarwiyya (8<sup>th</sup> Zilhajj). So if she becomes pure, so let her begin, or else the (day of the) Tarwiyya should not enter upon her except if she is in <span class=\"iTxt\">Ihraam</span>’."
          ],
          "en.sarwar": [
            "3. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “I once sent a message to abu ‘Abd Allah, ‘Alayhi al-Salam, that one of first time al-Hajj performing women with us has begun experiencing Hayd. What must she do? He (the Imam) said, ‘She must wait until al-Tarwiyah (eight of Dhu al-Hajj ah), if she is clean by that time, she says Talbiyah, otherwise, she must assume the state of Ihram before it is al-Tarwiyah (eight of Dhu al-Hajjah).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/101)"
        ],
        "index": 7655,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:154:4",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا طَافَتِ الْمَرْأَةُ طَوَافَ النِّسَاءِ وَ طَافَتْ أَكْثَرَ مِنَ النِّصْفِ فَحَاضَتْ نَفَرَتْ إِنْ شَاءَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from someone else, from Aban Bin Usman, from Fuzayl Bin Yasaar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When the woman performs a <span class=\"iTxt\">Tawaaf</span>, being the <span class=\"iTxt\">Tawaaf</span> of the women (طَوَافَ النِّسَاءِ), and performs more than half (of the circuits), then she menstruates, she can leave if she so desires to’."
          ],
          "en.sarwar": [
            "4. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from Fudayl ibn Yasar who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If a woman has performed Tawaf al-Nisa’, more than half of it, then begins experiencing Hayd (menses), she can leave if she wanted.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/101)"
        ],
        "index": 7656,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:154:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَدَخَلَ عَلَيْهِ رَجُلٌ لَيْلًا فَقَالَ أَصْلَحَكَ اللَّهُ امْرَأَةٌ مَعَنَا حَاضَتْ وَ لَمْ تَطُفْ طَوَافَ النِّسَاءِ فَقَالَ لَقَدْ سُئِلْتُ عَنْ هَذِهِ الْمَسْأَلَةِ الْيَوْمَ فَقَالَ أَصْلَحَكَ اللَّهُ أَنَا زَوْجُهَا وَ قَدْ أَحْبَبْتُ أَنْ أَسْمَعَ ذَلِكَ مِنْكَ فَأَطْرَقَ كَأَنَّهُ يُنَاجِي نَفْسَهُ وَ هُوَ يَقُولُ لَا يُقِيمُ عَلَيْهَا جَمَّالُهَا وَ لَا تَسْتَطِيعُ أَنْ تَتَخَلَّفَ عَنْ أَصْحَابِهَا تَمْضِي وَ قَدْ تَمَّ حَجُّهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub Al khazaz who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, so a man came over to him<sup>asws</sup> and he said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! A woman with us has menstruated and has not performed <span class=\"iTxt\">Tawaaf</span>, being the <span class=\"iTxt\">Tawaaf</span> of the women (طَوَافَ النِّسَاءِ)’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> have already been asked this question today’. So he said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! I am her husband, and I would love it to hear from you<sup>asws</sup>’. So he<sup>asws</sup> hushed as if he<sup>asws</sup> was whispering to himself<sup>asws</sup>, and he<sup>asws</sup> was saying: ‘Her beauty would not remain upon her, and she is not able to stay behind from her companions. She can go, and her Hajj is complete’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Ayyub al-Khazzaz who has said the following: “I was with abu ‘Abd Allah, ‘Alayhi al-Salam, when a man during the night came to him (the Imam) and said, ‘May Allah keep you well, there is a woman with us who experiences Hayd (menses) and has not performed Tawaf al-Nisa’. He (the Imam) said, ‘She has already asked this question today.’ He said, ‘May Allah keep you well, I am her husband and I love to hear it from you.’ He (the Imam) looked down as if speaking to himself and saying, ‘Her beauty will not remain and she cannot stay behind from her companions; she can go, her al-Hajj is complete.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:154",
  "kind": "verse_list"
}