{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 159"
        },
        "path": "/books/al-kafi:4:3:159",
        "titles": {
          "ar": "بَابُ تَقْدِيمِ طَوَافِ الْحَجِّ لِلْمُتَمَتِّعِ قَبْلَ الْخُرُوجِ إِلَى مِنًى",
          "en": "Chapter 159 – Bringing forward the circumambulation of the Hajj for the performer of Tumatto before the going out to Mina"
        }
      }
    ],
    "index": 1102,
    "local_index": 159,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 160"
        },
        "path": "/books/al-kafi:4:3:160",
        "titles": {
          "ar": "بَابُ تَقْدِيمِ الطَّوَافِ لِلْمُفْرِدِ",
          "en": "Chapter 160 – Bringing forward the Tawaaf for the performer of the exclusive Hajj"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 158"
        },
        "path": "/books/al-kafi:4:3:158",
        "titles": {
          "ar": "بَابُ الْحَجِّ مَاشِياً وَ انْقِطَاعِ مَشْيِ الْمَاشِي",
          "en": "Chapter 158 – The going to the Hajj walking and the cutting off the walk of the walker"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:159",
    "titles": {
      "ar": "بَابُ تَقْدِيمِ طَوَافِ الْحَجِّ لِلْمُتَمَتِّعِ قَبْلَ الْخُرُوجِ إِلَى مِنًى",
      "en": "Chapter 159 – Bringing forward the circumambulation of the Hajj for the performer of Tumatto before the going out to Mina"
    },
    "verse_count": 5,
    "verse_start_index": 7673,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/111)"
        ],
        "index": 7674,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:159:1",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْمُتَمَتِّعِ إِذَا كَانَ شَيْخاً كَبِيراً أَوِ امْرَأَةً تَخَافُ الْحَيْضَ تُعَجِّلُ طَوَافَ الْحَجِّ قَبْلَ أَنْ تَأْتِيَ مِنًى فَقَالَ نَعَمْ مَنْ كَانَ هَكَذَا يُعَجِّلُ ",
          "قَالَ وَ سَأَلْتُهُ عَنِ الرَّجُلِ يُحْرِمُ بِالْحَجِّ مِنْ مَكَّةَ ثُمَّ يَرَى الْبَيْتَ خَالِياً فَيَطُوفُ بِهِ قَبْلَ أَنْ يَخْرُجَ عَلَيْهِ شَيْ‏ءٌ فَقَالَ لَا ",
          "قُلْتُ الْمُفْرِدُ بِالْحَجِّ إِذَا طَافَ بِالْبَيْتِ وَ بِالصَّفَا وَ الْمَرْوَةِ يُعَجِّلُ طَوَافَ النِّسَاءِ فَقَالَ لَا إِنَّمَا طَوَافُ النِّسَاءِ بَعْدَ مَا يَأْتِي مِنًى ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Is’haq Bin Ammar who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the performer of <span class=\"iTxt\">Tumatto</span> when he was an old aged man, or a woman who fears the menstruation, hastening the <span class=\"iTxt\">Tawaaf</span> of the Hajj before going to Mina. He<sup>asws</sup> said: ‘Yes. The one who was like this, he can hasten’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the man who wears <span class=\"iTxt\">Ihraam</span> for the Hajj from Makkah. Then he sees the House (Kabah) as being vacant, so he performs <span class=\"iTxt\">Tawaaf</span> by it before he goes out upon anything. So he<sup>asws</sup> said: ‘No’. ",
            "I said, ‘The performer of the exclusive Hajj, when he performs <span class=\"iTxt\">Tawaaf</span> by the House, and by Al-Safa and Al-Marwa hastens the circumambulation of the women (طَوَافَ النِّسَاءِ)’. So he<sup>asws</sup> said: ‘No. But rather, the <span class=\"iTxt\">Tawaaf</span> of the women (طَوَافُ النِّسَاءِ) is (to be done) after going to Mina’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Ishaq ibn ‘Ammar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is for al-Hajj al-Tamattu‘ (advantageous) and he is an old man, or a woman who is afraid of experiencing Hayd (menses); if such people can perform Tawaf earlier before going to Mina’. He (the Imam) said, ‘Yes, those who are as such must do it earlier/ I then asked him (the Imam) about a man who assumes the state of Ihram in Makkah, then finds the House empty; so he performs Tawaf around the House and Sa‘y between al- Safa’ and al-Marwah; if he can perform Tawaf al-Nisa’ earlier. He (the Imam) said, ‘No, Tawaf al- Nisa’ is only after coming back from Mina.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/112)"
        ],
        "index": 7675,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:159:2",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ رَجُلٍ يَدْخُلُ مَكَّةَ وَ مَعَهُ نِسَاءٌ قَدْ أَمَرَهُنَّ فَتَمَتَّعْنَ قَبْلَ التَّرْوِيَةِ بِيَوْمٍ أَوْ يَوْمَيْنِ أَوْ ثَلَاثَةٍ فَخَشِيَ عَلَى بَعْضِهِنَّ الْحَيْضَ فَقَالَ إِذَا فَرَغْنَ مِنْ مُتْعَتِهِنَّ وَ أَحْلَلْنَ فَلْيَنْظُرْ إِلَى الَّتِي يَخَافُ عَلَيْهَا الْحَيْضَ فَيَأْمُرُهَا تَغْتَسِلُ وَ تُهِلُّ بِالْحَجِّ مِنْ مَكَانِهَا ثُمَّ تَطُوفُ بِالْبَيْتِ وَ بِالصَّفَا وَ الْمَرْوَةِ فَإِنْ حَدَثَ بِهَا شَيْ‏ءٌ قَضَتْ بَقِيَّةَ الْمَنَاسِكِ وَ هِيَ طَامِثٌ ",
          "فَقُلْتُ أَ لَيْسَ قَدْ بَقِيَ طَوَافُ النِّسَاءِ قَالَ بَلَى قُلْتُ فَهِيَ مُرْتَهَنَةٌ حَتَّى تَفْرُغَ مِنْهُ قَالَ نَعَمْ قُلْتُ فَلِمَ لَا تَتْرُكُهَا حَتَّى تَقْضِيَ مَنَاسِكَهَا قَالَ يَبْقَى عَلَيْهَا مَنْسَكٌ وَاحِدٌ أَهْوَنُ عَلَيْهَا مِنْ أَنْ تَبْقَى عَلَيْهَا الْمَنَاسِكُ كُلُّهَا مَخَافَةَ الْحَدَثَانِ ",
          "قُلْتُ أَبَى الْجَمَّالُ أَنْ يُقِيمَ عَلَيْهَا وَ الرِّفْقَةُ قَالَ لَيْسَ لَهُمْ ذَلِكَ تَسْتَعْدِي عَلَيْهِمْ حَتَّى يُقِيمَ عَلَيْهَا حَتَّى تَطْهُرَ وَ تَقْضِيَ مَنَاسِكَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about a man who enters Makkah and with him are women whom he had instructed, so they performed <span class=\"iTxt\">Tumatto</span> before the (day of) Al-Tarwiyya (8<sup>th</sup> Zilhajj) by one day, or two days, or three. So he feared upon some of them, of the menstruation. So he<sup>asws</sup> said: ‘When they are free from performing their <span class=\"iTxt\">Tumatto</span>, and they are free from the <span class=\"iTxt\">Ihraam</span>, so let him consider the ones whom he fears the menstruation upon, so he should instruct her to wash, and begin with the Hajj from her place. Then she should perform <span class=\"iTxt\">Tawaaf</span> by the House (Kabah), and by Al-Safa and Al-Marwa. So if something occurs with her, she can fulfil the remainder of the rituals while being in menstruation’. ",
            "So I said, ‘Is it not so that the <span class=\"iTxt\">Tawaaf</span> of the women (طَوَافُ النِّسَاءِ) would have remained (unperformed)?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘So she is pledged until she is free’. He<sup>asws</sup> said: ‘Yes’. I said, ‘So why leave it until she is free from fulfilling her rituals?’ He<sup>asws</sup> said: ‘The remaining of one ritual upon her is easier upon her than if there remained outstanding upon her of all the rituals, being fearful of the menstruation’. ",
            "I said, ‘Supposing the cameleer refuses to stay upon her, and the fellow travelers?’ He<sup>asws</sup> said: ‘That is not for them. She should seek their support until they stay upon her, until she is pure, and she fulfils her rituals’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Ali ibn abu Hamzah who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who enters Makkah in the company of women whom he instructs to perform al-Hajj al-Tamattu‘ (advantageous) to enjoy the advantage one or two or three days before al-Tarwiyah (eight of Dhu al-Hajj ah) and is afraid about certain ones among them for experiencing Hayd (menses). He (the Imam) said, ‘When they are free from the period of advantage, he must examine the case of those for whom he is afraid of Hayd (menses). He can instruct them to take Ghusl (bath) and say Talbiyah for al-Hajj from their place, then perform Tawaf around the House and Sa‘y between al-Safa’ and al-Marwah; if something happens to her, she completes the rest of the acts of al-Hajj in her condition of experiencing Hayd (menses).’ I then asked, ‘Is Tawaf al-Nisa’ left out?’ He (the Imam) said, ‘Yes, it is left out.’ I then asked, ‘Is she on hold until completing it?’ He (the Imam) said, ‘Yes, she is on hold.’ I then asked, ‘Why she then leaves it out until completing other acts?’ He (the Imam) said, ‘Leaving one act is easier for her than leaving out all acts because of fear for something to happen (Hayd (menses)).’ I then asked, ‘What happens if the camel man and other travel-mates do not wait for her?’ He (the Imam) said, ‘They cannot do so. She can ask for their support to stay for her so that she becomes clean to perform her act (that is left out).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/113)"
        ],
        "index": 7676,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/235",
              "text": "حَفْصِ بْنِ الْبَخْتَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/142",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ وَ مُعَاوِيَةَ بْنِ عَمَّارٍ وَ حَمَّادٍ عَنِ الْحَلَبِيِّ جَمِيعاً عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:159:3",
        "text": [
          " لَا بَأْسَ بِتَعْجِيلِ الطَّوَافِ لِلشَّيْخِ الْكَبِيرِ وَ الْمَرْأَةِ تَخَافُ الْحَيْضَ قَبْلَ أَنْ تَخْرُجَ إِلَى مِنًى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from hafs Bin Al Bakhtary, and Muawiya Bin Ammar, and Hammad, from Al Halby, altogether, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is no problem with hastening the <span class=\"iTxt\">Tawaaf</span>, for the aged old man, and the woman who fears the menstruation, before the going out to Mina’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Um ay r from Hafs ibn al-Bakhtariy Ahmad ibn Muhammad from Mu‘awiyah ibn ‘Ammar and Hammad from al-Halabiy all have said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Old people, and women who are afraid of experiencing Hayd (menses), can perform Tawaf before leaving for Mina’.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/113)"
        ],
        "index": 7677,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/313",
              "text": "إِسْمَاعِيلَ بْنِ مَرَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:159:4",
        "text": [
          " قُلْتُ رَجُلٌ كَانَ مُتَمَتِّعاً وَ أَهَلَّ بِالْحَجِّ قَالَ لَا يَطُوفُ بِالْبَيْتِ حَتَّى يَأْتِيَ عَرَفَاتٍ فَإِذَا هُوَ طَافَ قَبْلَ أَنْ يَأْتِيَ مِنًى مِنْ غَيْرِ عِلَّةٍ فَلَا يَعْتَدَّ بِذَلِكَ الطَّوَافِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘A man who was a performer of <span class=\"iTxt\">Tumatto</span>, and began with the Hajj. He<sup>asws</sup> said: ‘He should not perform <span class=\"iTxt\">Tawaaf</span> by the House (Kabah) until he goes to Arafaat. So when he performs <span class=\"iTxt\">Tawaaf</span> before he goes to Mina from other than a (valid) reason, so he would not be counted with that <span class=\"iTxt\">Tawaaf</span>’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ‘Isma‘il ibn Marrar from Yunus from Ali ibn abu Hamzah from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is for al-Hajj al-Tamattu‘ (advantageous) and has said Talbiyah for al-Hajj. He (the Imam) said, ‘He must not perform Tawaf until he attends ‘Arafah; if he performs Tawaf before attending Mina’ without illness, that Tawaf is not counted.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/113)"
        ],
        "index": 7678,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/313",
              "text": "إِسْمَاعِيلَ بْنِ مَرَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2189",
              "text": "إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:159:5",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَا بَأْسَ أَنْ يُعَجِّلَ الشَّيْخُ الْكَبِيرُ وَ الْمَرِيضُ وَ الْمَرْأَةُ وَ الْمَعْلُولُ طَوَافَ الْحَجِّ قَبْلَ أَنْ يَخْرُجَ إِلَى مِنًى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Ismail Bin Abdul Khaliq who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘There is no problem if the old aged man, and the sick, and the woman, and the disabled were to hasten the <span class=\"iTxt\">Tawaaf</span> of the Hajj before the going out to Mina’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ‘Isma‘il ibn Marrar from Yunus from ‘Isma‘il ibn ‘Abd af-Khafiq who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘It is not harmful for old people, people suffering from illness and women and people with defect to perform Tawaf before leaving for MinaY” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:159",
  "kind": "verse_list"
}