{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 166"
        },
        "path": "/books/al-kafi:4:3:166",
        "titles": {
          "ar": "بَابُ الْإِفَاضَةِ مِنْ عَرَفَاتٍ",
          "en": "Chapter 166 – The departure from Arafaat"
        }
      }
    ],
    "index": 1109,
    "local_index": 166,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 167"
        },
        "path": "/books/al-kafi:4:3:167",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ لَيْلَةِ الْمُزْدَلِفَةِ</span> وَ الْوُقُوفِ بِالْمَشْعَرِ وَ الْإِفَاضَةِ مِنْهُ وَ حُدُودِهِ",
          "en": "Chapter 167 – The night of Al-Muzdalifa, and the pausing at the (Sacred) Monuments and the departure from it, and its boundary"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 165"
        },
        "path": "/books/al-kafi:4:3:165",
        "titles": {
          "ar": "بَابُ الْوُقُوفِ بِعَرَفَةَ وَ حَدِّ الْمَوْقِفِ",
          "en": "Chapter 165 – The pausing at Arafaat and the boundary of the Pausing Station (Al Mowqif)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:166",
    "titles": {
      "ar": "بَابُ الْإِفَاضَةِ مِنْ عَرَفَاتٍ",
      "en": "Chapter 166 – The departure from Arafaat"
    },
    "verse_count": 6,
    "verse_start_index": 7704,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/124)"
        ],
        "index": 7705,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/550",
              "text": "يُونُسَ بْنِ يَعْقُوبَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:166:1",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَتَى الْإِفَاضَةُ مِنْ عَرَفَاتٍ قَالَ إِذَا ذَهَبَ الْحُمْرَةُ يَعْنِي مِنَ الْجَانِبِ الشَّرْقِيِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazal, from Yunus Bin Yqoub who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘When is the departure from Arafaat?’ He<sup>asws</sup> said: ‘When the redness disappears, meaning from the eastern side’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from Yunus ibn Ya’qub who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the time of leaving ‘Arafat. He (the Imam) said, ‘It is when the redness goes away, that is, from the eastern side.”’ (Fatwa best explains Hadith 1 of this Chapter) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/125)"
        ],
        "index": 7706,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/142",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:166:2",
        "relations": {
          "Mentions": [
            "/books/quran:2:198",
            "/books/quran:2:199"
          ]
        },
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الْمُشْرِكِينَ كَانُوا يُفِيضُونَ مِنْ قَبْلِ أَنْ تَغِيبَ الشَّمْسُ فَخَالَفَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَأَفَاضَ بَعْدَ غُرُوبِ الشَّمْسِ",
          "قَالَ وَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا غَرَبَتِ الشَّمْسُ فَأَفِضْ مَعَ النَّاسِ وَ عَلَيْكَ السَّكِينَةَ وَ الْوَقَارَ وَ أَفِضْ بِالِاسْتِغْفَارِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفاضَ النَّاسُ وَ اسْتَغْفِرُوا اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
          "فَإِذَا انْتَهَيْتَ إِلَى الْكَثِيبِ الْأَحْمَرِ عَنْ يَمِينِ الطَّرِيقِ فَقُلِ اللَّهُمَّ ارْحَمْ مَوْقِفِي وَ زِدْ فِي عِلْمِي وَ سَلِّمْ لِي دِينِي وَ تَقَبَّلْ مَنَاسِكِي وَ إِيَّاكَ وَ الْوَجِيفَ الَّذِي يَصْنَعُهُ النَّاسُ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ أَيُّهَا النَّاسُ إِنَّ الْحَجَّ لَيْسَ بِوَجِيفِ الْخَيْلِ وَ لَا إِيضَاعِ الْإِبِلِ وَ لَكِنِ اتَّقُوا اللَّهَ وَ سِيرُوا سَيْراً جَمِيلًا لَا تُوَطِّئُوا ضَعِيفاً وَ لَا تُوَطِّئُوا مُسْلِماً وَ تَوَأَّدُوا وَ اقْتَصِدُوا فِي السَّيْرِ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَكُفُّ نَاقَتَهُ حَتَّى يُصِيبَ رَأْسُهَا مُقَدَّمَ الرَّحْلِ وَ يَقُولُ أَيُّهَا النَّاسُ عَلَيْكُمْ بِالدَّعَةِ فَسُنَّةُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) تُتَّبَعُ",
          "قَالَ مُعَاوِيَةُ وَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ اللَّهُمَّ أَعْتِقْنِي مِنَ النَّارِ وَ كَرَّرَهَا حَتَّى أَفَاضَ فَقُلْتُ أَ لَا تُفِيضُ فَقَدْ أَفَاضَ النَّاسُ فَقَالَ إِنِّي أَخَافُ الزِّحَامَ وَ أَخَافُ أَنْ أَشْرَكَ فِي عَنَتِ إِنْسَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al fazl Bin Sh<span class=\"iTxt\">azaan</span>, from Safwan Bin Yahya, from Muawiya Bin Ammar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The Polytheists were departing from before the disappearance of the sun, so Rasool-Allah<sup>saww</sup> opposed them, and he<sup>saww</sup> departed after the setting of the sun’. ",
            "He (the narrator) said, ‘Abu Abdullah<sup>asws</sup> said: ‘When the sun sets, so depart along with the people, and upon you should be the tranquillity and the dignity. And, depart with the seeking of the Forgiveness, for Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h199\">[2:199]</a> Then hasten on from where the people hasten on and seek the Forgiveness of Allah; surely Allah is Forgiving, Merciful</span>.",
            "So when you end up to the red dune upon the right of the road, so say, ‘O Allah<sup>azwj</sup>! Have Mercy upon my pausing, and Increase in my knowledge, and Safeguard my Religion for me, and Accept my rituals’. Beware of the excitement, which the people are doing, for Rasool-Allah<sup>saww</sup> said: ‘O you people! The Hajj is not with the excitement of the cavalry, nor the racing of the camels. But, fear Allah<sup>azwj</sup> and walk with a beautiful walking, not trampling upon the weak, nor trampling a Muslim, and be considerate and moderate in the walking, for Rasool-Allah<sup>saww</sup> would restrain his<sup>saww</sup> she-camel until its head would touch its front legs, and he<sup>saww</sup> was saying: ‘O you people! It is upon you with the calmness. Thus, you should follow the Sunnah of Rasool-Allah<sup>saww</sup>’. ",
            "Muawiya (the narrator) said, ‘And I hear Abu Abdullah<sup>asws</sup> saying: ‘O Allah<sup>azwj</sup>! Emancipate me<sup>asws</sup> from the Fire!’, and he<sup>asws</sup> repeated it until he<sup>asws</sup> departed. So I<sup>asws</sup> said to him<sup>asws</sup>, ‘Are you<sup>asws</sup> not departing, for the people have already departed?’ So he<sup>asws</sup> said: ‘I<sup>asws</sup> fear the congestion, and I<sup>asws</sup> fear that I<sup>asws</sup> might participate in impeding (hindering) a person’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the pagans would depart ‘Arafat before sunset. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, opposed them. He departed after sunset. He (the narrator) has said that abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When it is sunset, then depart ‘Arafat along with the people in a calm and dignified manner. Ask forgiveness from Allah, the Most Majestic, the Most Glorious, who has said, “Then depart ‘Arafat as people do and ask forgiveness from Allah; Allah is forgiving and merciful.” <a href=\"/#/books/quran:2#h198\">[2:198]</a> When you reach al-Kathib al-Ahmar on the right side of the road say, “O Allah, grant me kindness for my staying in ‘Arafat, increase my knowledge, protect my religion and accept my acts of al-Hajj.” Beware of al-Wajif (moving in a rough and rushing manner) as people do. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, had said, “O people, al-Hajj is not horse or camel racing. Be God-fearing and walk in a beautiful manner. You must not overrun the weak ones or Muslims. Walk considerately and moderately.” The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, halted his camel until the camel’s head reached the front part of the leg and the Messenger of Allah said, “O people, you must remain calm.” The tradition of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, must be followed.’ Mu‘awiyah has said, ‘I heard abu ‘Abd Allah, ‘Alayhi al- Salam, say, “O Allah, set me free from hellfire.” He (the Imam) repeated it until he departed ‘Arafat. I asked, “Are you not leaving? People have left.” He (the Imam) replied, “I am afraid of congestion and I do not want to cause trouble to a human being.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/125)"
        ],
        "index": 7707,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/117",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/818",
              "text": "هَارُونَ بْنِ خَارِجَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ هَارُونَ بْنِ خَارِجَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:166:3",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ فِي آخِرِ كَلَامِهِ حِينَ أَفَاضَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَقْطَعَ رَحِماً أَوْ أُوذِيَ جَاراً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Usman Bin Isa, from Haroun Bin Kharjat who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying at the end of his<sup>asws</sup> speech, when he<sup>asws</sup> departed: ‘O Allah<sup>azwj</sup>! I<sup>asws</sup> seek Refuge with You<sup>azwj</sup> from being unjust, of mistreating, or cutting off a relationship, or harming a neighbour’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from al-FIusayn ibn Sa‘id from ‘Uthman ibn ‘Isa from Harun ibn Kharijah who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, when departing ‘Arafat at the end of his words, ‘O Allah, I seek protection with You against my disappointing, mistreating or doing injustice to or being treated unjustly by a relative or a neighbor.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/126)"
        ],
        "index": 7708,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/207",
              "text": "عَلِيِّ بْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/697",
              "text": "ضُرَيْسٍ الْكُنَاسِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ ضُرَيْسٍ الْكُنَاسِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:166:4",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ أَفَاضَ مِنْ عَرَفَاتٍ قَبْلَ أَنْ تَغِيبَ الشَّمْسُ قَالَ عَلَيْهِ بَدَنَةٌ يَنْحَرُهَا يَوْمَ النَّحْرِ فَإِنْ لَمْ يَقْدِرْ صَامَ ثَمَانِيَةَ عَشَرَ يَوْماً بِمَكَّةَ أَوْ فِي الطَّرِيقِ أَوْ فِي أَهْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Zureys Al Kunasy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who departed from Arafaat before the setting of the sun. He<sup>asws</sup> said: ‘Upon him is a camel he would sacrifice it on the Day of the Sacrifice. So if he is not able, he should Fast for eighteen days in Makkah, or in the road, or among his family’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad from al-Hassan ibn Mahbub from ibn Ri’ab from Durays al-Kunasiy who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about a man who leaves ‘Arafat before sunset. He (the Imam) said, ‘He owes one badanah to slaughter on the day of al-Nahr (slaughtering the offering), if unable to do this he must fast for eighteen days in Makkah or on the way or at home.’” (Fatwa best explains Hadith 4 of this Chapter) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/126)"
        ],
        "index": 7709,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:166:5",
        "text": [
          " يُوَكِّلُ اللَّهُ عَزَّ وَ جَلَّ مَلَكَيْنِ بِمَأْزِمَيْ عَرَفَةَ فَيَقُولَانِ سَلِّمْ سَلِّمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Allocates two Angels at the two (narrow) points at Arafaat, so they are both saying: ‘Safety! Safety!’"
          ],
          "en.sarwar": [
            "5. Ahmad ibn Muhammad has narrated from al-Husayn ibn Sa‘id from al-Nadr ibn al-Suwayd from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Allah, the Most Majestic, the Most Glorious, appoints two angels who in the narrow area between ‘Arafat and al-Muzdalifah say, ‘Keep safe, keep safe.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/126)"
        ],
        "index": 7710,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/245",
              "text": "عَلِيِّ بْنِ النُّعْمَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1622",
              "text": "سَعِيدٍ الْأَعْرَجِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَعِيدٍ الْأَعْرَجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:166:6",
        "text": [
          " مَلَكَانِ يُفَرِّجَانِ لِلنَّاسِ لَيْلَةَ مُزْدَلِفَةَ عِنْدَ الْمَأْزِمَيْنِ الضَّيِّقَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ali Bin Al Numan, from Saeed Al A’araj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Two Angels make way for the people on the night of Muzdalifa at the two narrow points’."
          ],
          "en.sarwar": [
            "6. It is narrated from him (narrator of previous Hadith) from Ali ibn al-Nu’man from Sa‘id al-’A‘raj who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Two angels make room for people who become congested in al-Mazemin.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:166",
  "kind": "verse_list"
}