{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 169"
        },
        "path": "/books/al-kafi:4:3:169",
        "titles": {
          "ar": "بَابُ مَنْ جَهِلَ أَنْ يَقِفَ بِالْمَشْعَرِ",
          "en": "Chapter 169 – The one who is ignorant that he should be pausing at the Monuments"
        }
      }
    ],
    "index": 1112,
    "local_index": 169,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 170"
        },
        "path": "/books/al-kafi:4:3:170",
        "titles": {
          "ar": "بَابُ مَنْ تَعَجَّلَ مِنَ الْمُزْدَلِفَةِ قَبْلَ الْفَجْرِ",
          "en": "Chapter 170 – The one who hastens from Al-Muzdalifa before the dawn"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 168"
        },
        "path": "/books/al-kafi:4:3:168",
        "titles": {
          "ar": "بَابُ السَّعْيِ فِي وَادِي مُحَسِّرٍ",
          "en": "Chapter 168 – The walking briskly in the valley of Muhassar"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:169",
    "titles": {
      "ar": "بَابُ مَنْ جَهِلَ أَنْ يَقِفَ بِالْمَشْعَرِ",
      "en": "Chapter 169 – The one who is ignorant that he should be pausing at the Monuments"
    },
    "verse_count": 6,
    "verse_start_index": 7724,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/132)"
        ],
        "index": 7725,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:169:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ الْأَعْجَمِيُّ وَ الْمَرْأَةُ الضَّعِيفَةُ يَكُونَانِ مَعَ الْجَمَّالِ الْأَعْرَابِيِّ فَإِذَا أَفَاضَ بِهِمْ مِنْ عَرَفَاتٍ مَرَّ بِهِمْ كَمَا مَرَّ بِهِمْ إِلَى مِنًى وَ لَمْ يَنْزِلْ بِهِمْ جَمْعاً فَقَالَ أَ لَيْسَ قَدْ صَلَّوْا بِهَا فَقَدْ أَجْزَأَهُمْ قُلْتُ وَ إِنْ لَمْ يُصَلُّوا بِهَا قَالَ ذَكَرُوا اللَّهَ فِيهَا فَإِنْ كَانُوا ذَكَرُوا اللَّهَ فِيهَا فَقَدْ أَجْزَأَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammad Bin Usman, from Muhammad Bin Hakeym who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The non-Arab man and the weak woman both happen to be with the Bedouin cameleer. So when he departs with them from Arafaat, he passes with them just as he passed with them to Mina and did not encamp with them at Jam’a’ (place of assembly near Muzdalifah). So he<sup>asws</sup> said: ‘Had they Prayed at it, it would have sufficed them’. I said, ‘And if they did not Pray at it?’ He<sup>asws</sup> said: ‘They should mention Allah<sup>azwj</sup>. So if they had mentioned Allah<sup>azwj</sup> therein, so it would have sufficed them’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad Ahmad ibn Muhammad from ibn abu Nasr from Hammad ibn ‘Uthaman from Muhammad ibn al-Hakim who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about a man who is a non- Arab with a weak woman and an Arab camel man who takes them to leave ’Arafat and pass along with them through al-Jam‘ (place of assembly al-Muzdalifah) to Mina’, without allowing them to disembark in al-Jam‘. He (the Imam) said, ’Had they been able to perform one Salat (prayer) in it (al-Jam‘) it would have been sufficient for them.’ I then asked, ‘What happens if they cannot perform one Salat (prayer) there ? 5 He (the Imam) said, ‘They can speak of Allah; if they say Dhikr of Allah (speak of Allah), it is sufficient for them. ‘“"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/133)"
        ],
        "index": 7726,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:169:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنَّ صَاحِبَيَّ هَذَيْنِ جَهِلَا أَنْ يَقِفَا بِالْمُزْدَلِفَةِ فَقَالَ يَرْجِعَانِ مَكَانَهُمَا فَيَقِفَانِ بِالْمَشْعَرِ سَاعَةً ",
          "قُلْتُ فَإِنَّهُ لَمْ يُخْبِرْهُمَا أَحَدٌ حَتَّى كَانَ الْيَوْمُ وَ قَدْ نَفَرَ النَّاسُ قَالَ فَنَكَسَ رَأْسَهُ سَاعَةً ثُمَّ قَالَ أَ لَيْسَا قَدْ صَلَّيَا الْغَدَاةَ بِالْمُزْدَلِفَةِ قُلْتُ بَلَى فَقَالَ أَ لَيْسَا قَدْ قَنَتَا فِي صَلَاتِهِمَا قُلْتُ بَلَى فَقَالَ تَمَّ حَجُّهُمَا ثُمَّ قَالَ الْمَشْعَرُ مِنَ الْمُزْدَلِفَةِ وَ الْمُزْدَلِفَةُ مِنَ الْمَشْعَرِ وَ إِنَّمَا يَكْفِيهِمَا الْيَسِيرُ مِنَ الدُّعَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ibn Muskan, from Abu Baseer who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! There two companions of mine who were ignorant (of the fact) that they should be pausing at Muzdalifa’. So he<sup>asws</sup> said: ‘They should both go back to their places, and they should pause at the Monuments for a while’. ",
            "I said, ‘But no one informed them until today, and the people have left’. So he<sup>asws</sup> lowered his<sup>asws</sup> head for a while, then said: ‘Is it not so that both of them had Prayed the morning (Prayer) at Al-Muzdalifa?’ I said, ‘Yes’. So he<sup>asws</sup> said: ‘Is it not so that they had both performed Qunoot in their Prayer?’ I said, ‘Yes’. So he<sup>asws</sup> said: ‘Their Hajj is complete’. Then he<sup>asws</sup> said: ‘The Monuments are from Al-Muzdalifa, and Al-Muzdalifa is from the Monuments. But rather, a little from the supplication would suffice them’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ibn Muskan from abu Basir who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I pray to Allah to keep my soul in service for your cause, these two of my friends due to ignorance have not stayed in al-Muzdalifah. He (the Imam) said, ‘They must go back to stay in al-Mash‘ar for an hour . 5 I then said that no one told them about it until today and people have already left. He (the Imam) then looked down for a while and said, ‘Did they perform the morning Salat (prayer) in al-Muzdalifah . 5 I said, ‘Yes, they did . 5 He (the Imam) asked, ‘Did they say Qunut (supplication after recitation in second Rak’at) in their Salat (prayer )? 5 I replied, ‘Yes, they did . 5 He (the Imam) said, ‘Their Hajj then is complete . 5 He (the Imam) then said, ‘Al- Mash’ar is of al-Muzdalifah and al-Muzdalifah is from al-Mash‘ar; only a little prayer is sufficient for them . ‘“ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/133)"
        ],
        "index": 7727,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:169:3",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَقُولُ فِي رَجُلٍ أَفَاضَ مِنْ عَرَفَاتٍ فَأَتَى مِنًى قَالَ فَلْيَرْجِعْ فَيَأْتِي جَمْعاً فَيَقِفُ بِهَا وَ إِنْ كَانَ النَّاسُ قَدْ أَفَاضُوا مِنْ جَمْعٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Sh<span class=\"iTxt\">azaan</span>, from Safwan Bin Yahya, from Muawiya Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding a man who departs from Arafaat, so he goes to Mina?’ He<sup>asws</sup> said: ‘So let him return and go to Jam’a. So he should pause at it, and even if the people had departed from Jam’a’ (place of assembly near Muzdalifah)."
          ],
          "en.sarwar": [
            "3. Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who leaves ‘Arafat and comes to Mina 5 . He (the Imam) said, ‘He must go back to al-Jam‘ (place of assembly) to stay there even if all people may have already left al-Jam‘ (place of assembly ). ‘“ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/134)"
        ],
        "index": 7728,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:169:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ أَفَاضَ مِنْ عَرَفَاتٍ فَمَرَّ بِالْمَشْعَرِ فَلَمْ يَقِفْ حَتَّى انْتَهَى إِلَى مِنًى وَ رَمَى الْجَمْرَةَ وَ لَمْ يَعْلَمْ حَتَّى ارْتَفَعَ النَّهَارُ قَالَ يَرْجِعُ إِلَى الْمَشْعَرِ فَيَقِفُ بِهِ ثُمَّ يَرْجِعُ فَيَرْمِي الْجَمْرَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Yunus Bin Yaqoub who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man departs from Arafaat, so he passed by the ‘الْمَشْعَرِ’ Monuments, but he does not paused until he ends up to Mina and pelts the <span class=\"iTxt\">Jamarah</span>, and he does not know until the day is raised’. He<sup>asws</sup> said: ‘He should return to the ‘الْمَشْعَرِ’ Monuments, so he should pause at it, then he should return, so he would pelt the <span class=\"iTxt\">Jamarah</span>’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from Yunus ibn Ya’qub who has said the following: “Once, I asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who leaves ‘Arafat and passes through al-Mash‘ar to Mina 5 without staying in al-Mash‘ar. In Mina’he throws pebbles on al-Jamarat and only when the sun rises high he comes to know. He (the Imam) said, ‘He must go back to al-Mash‘ar, stay there for a while, then return to Mina 5 and throw pebbles . ‘“ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/134)"
        ],
        "index": 7729,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:169:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَثْعَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ فِي رَجُلٍ لَمْ يَقِفْ بِالْمُزْدَلِفَةِ وَ لَمْ يَبِتْ بِهَا حَتَّى أَتَى مِنًى فَقَالَ أَ لَمْ يَرَ النَّاسَ وَ لَمْ يُنْكِرْ مِنًى حِينَ دَخَلَهَا قُلْتُ فَإِنْ جَهِلَ ذَلِكَ قَالَ يَرْجِعُ قُلْتُ إِنَّ ذَلِكَ قَدْ فَاتَهُ فَقَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Yahya Al Khas’amy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding a man who did not pause at Al-Muzdalifa, and did not sleep at it until he went to Mina. So he<sup>asws</sup> said: ‘Did he not see the people and did not deny (that he was in) Mina when he entered it?’ I said, ‘Supposing he was ignorant of that’. He<sup>asws</sup> said: ‘He should return’. I said, ‘If that (opportunity) has been lost?’ So he<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Muhammad ibn Yahya al-Khath’amiy who has said the following: “About a man who had not stayed in al-Muzdalifah and did not pass the night there until he arrived in Mina’, he (the Imam) asked, ‘Did he not see the people and recognize Mina 5 when he arrived ? 5 I then asked, ‘What happens if he is ignorant about it ?’ He (the Imam) said, ‘He must go back.’ I then said, ‘He has missed such chance .’ He (the Imam) said, ‘It is not harmful .’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/135)"
        ],
        "index": 7730,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:169:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ حَرِيزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَفَاضَ مِنْ عَرَفَاتٍ مَعَ النَّاسِ وَ لَمْ يَلْبَثْ مَعَهُمْ بِجَمْعٍ وَ مَضَى إِلَى مِنًى مُتَعَمِّداً أَوْ مُسْتَخِفّاً فَعَلَيْهِ بَدَنَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Hareyz, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who departs from Arafaat along with the people and does not remain with them at Jam’a, and goes to Mina deliberately, or by taking it lightly, so upon him is a camel (as a sacrifice)’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub from ibn Ri’ab from Hariz who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one leaves ‘Arafat with people, does not wait with them in Jam‘ and passes to Mina 5 intentionally or due to considering it unimportant, he owes one badanah.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:169",
  "kind": "verse_list"
}