{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 173"}, "path": "/books/al-kafi:4:3:173", "titles": {"ar": "بَابُ يَوْمِ النَّحْرِ وَ مُبْتَدَإِ الرَّمْيِ وَ فَضْلِهِ", "en": "Chapter 173 – The day of the sacrifice, and beginning the pelting (of the Jamarah), and its merits"}}], "index": 1116, "local_index": 173, "part_type": "Chapter", "path": "/books/al-kafi:4:3:173", "titles": {"ar": "بَابُ يَوْمِ النَّحْرِ وَ مُبْتَدَإِ الرَّمْيِ وَ فَضْلِهِ", "en": "Chapter 173 – The day of the sacrifice, and beginning the pelting (of the Jamarah), and its merits"}, "verse_count": 7, "verse_start_index": 7753, "verses": [{"index": 7754, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:173:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ خُذْ حَصَى الْجِمَارِ ثُمَّ ائْتِ الْجَمْرَةَ الْقُصْوَى الَّتِي عِنْدَ الْعَقَبَةِ فَارْمِهَا مِنْ قِبَلِ وَجْهِهَا وَ لَا تَرْمِهَا مِنْ أَعْلَاهَا وَ تَقُولُ وَ الْحَصَى فِي يَدِكَ اللَّهُمَّ هَؤُلَاءِ حَصَيَاتِي فَأَحْصِهِنَّ لِي وَ ارْفَعْهُنَّ فِي عَمَلِي ثُمَّ تَرْمِي \nوَ تَقُولُ مَعَ كُلِّ حَصَاةٍ اللَّهُ أَكْبَرُ اللَّهُمَّ ادْحَرْ عَنِّي الشَّيْطَانَ اللَّهُمَّ تَصْدِيقاً بِكِتَابِكَ وَ عَلَى سُنَّةِ نَبِيِّكَ ( صلى الله عليه وآله ) اللَّهُمَّ اجْعَلْهُ حَجّاً مَبْرُوراً وَ عَمَلًا مَقْبُولًا وَ سَعْياً مَشْكُوراً وَ ذَنْباً مَغْفُوراً وَ لْيَكُنْ فِيمَا بَيْنَكَ وَ بَيْنَ الْجَمْرَةِ قَدْرَ عَشَرَةِ أَذْرُعٍ أَوْ خَمْسَةَ عَشَرَ ذِرَاعاً \nفَإِذَا أَتَيْتَ رَحْلَكَ وَ رَجَعْتَ مِنَ الرَّمْيِ فَقُلِ اللَّهُمَّ بِكَ وَثِقْتُ وَ عَلَيْكَ تَوَكَّلْتُ فَنِعْمَ الرَّبُّ وَ نِعْمَ الْمَوْلَى وَ نِعْمَ النَّصِيرُ \nقَالَ وَ يُسْتَحَبُّ أَنْ يُرْمَى الْجِمَارُ عَلَى طُهْرٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Take the pebbles (for pelting the) <span class=\"iTxt\">Jamarah</span>, then go to Al-Qaswa <span class=\"iTxt\">Jamarah</span> which is at Aqaba, so pelt it from its front, and do not pelt it from its above, and you should be saying while the pebble is in your hand, ‘O Allah<sup>azwj</sup>! These are my pebbles, so Count these for me and Raise these in my deeds’. \nAnd you should be saying with each pebble, ‘Allah<sup>azwj</sup> is the Greatest! O Allah<sup>azwj</sup>! Drive away the Satan<sup>la</sup> from me! O Allah<sup>azwj</sup>! In ratification of Your<sup>azwj</sup> Book and upon the Sunnah of Your<sup>azwj</sup> Prophet<sup>saww</sup>. O Allah<sup>azwj</sup>! Make it to be an Authorised Hajj, and an Acceptable deed, and an Appreciated effort, and a Forgiven sin’. And let there happen to be in what is between you and the <span class=\"iTxt\">Jamarah</span>, a measurement of ten cubits, or fifteen cubits.\nSo when you go to your ride and return from the pelting, so say, ‘O Allah<sup>azwj</sup>! In You<sup>azwj</sup> I trust, and upon You<sup>azwj</sup> do I rely, for You<sup>azwj</sup> are the best Lord<sup>azwj</sup>, and the best Guardian, and the best Helper’. \nHe<sup>asws</sup> said: ‘And it is recommended that you pelt the <span class=\"iTxt\">Jamarah</span> upon cleanliness’."}]}, {"index": 7755, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:173:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنْ رَمْيِ الْجَمْرَةِ يَوْمَ النَّحْرِ مَا لَهَا تُرْمَى وَحْدَهَا وَ لَا تُرْمَى مِنَ الْجِمَارِ غَيْرُهَا يَوْمَ النَّحْرِ فَقَالَ قَدْ كُنَّ يُرْمَيْنَ كُلُّهُنَّ وَ لَكِنَّهُمْ تَرَكُوا ذَلِكَ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ فَأَرْمِيهِنَّ قَالَ لَا تَرْمِهِنَّ أَ مَا تَرْضَى أَنْ تَصْنَعَ مِثْلَ مَا نَصْنَعُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Jameel Bin Darraj, from Zurara, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about pelting <span class=\"iTxt\">Al-Jamarah </span>on the day of Al-Nahr (the sacrifice), ‘What is the matter with it that one pelts one of these, and does not pelt others from <span class=\"iTxt\">Al-Jamarah</span> on the day of the sacrifice (10<sup>th</sup> Zilhajj)?’ So he<sup>asws</sup> said: ‘All of these used to be pelted, but they left that’. So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! So can I pelt them (all)?’ He<sup>asws</sup> said: ‘Do not pelt them (all). Are you not please that you are doing similar to what we<sup>asws</sup> do?’"}]}, {"index": 7756, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:173:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ حُمْرَانَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَمْيِ الْجِمَارِ فَقَالَ كُنَّ يُرْمَيْنَ جَمِيعاً يَوْمَ النَّحْرِ فَرَمَيْتُهَا جَمِيعاً بَعْدَ ذَلِكَ ثُمَّ حَدَّثْتُهُ فَقَالَ لِي أَ مَا تَرْضَى أَنْ تَصْنَعَ كَمَا كَانَ عَلِيٌّ ( عليه السلام ) يَصْنَعُ فَتَرَكْتُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zuurara, from Humran who said, \n‘I asked Abu Ja’far<sup>asws</sup> about pelting <span class=\"iTxt\">Al-Jamarah</span>, so he<sup>asws</sup> said: ‘All of these used to be pelted on the day of Al-Nahr (10<sup>th</sup> Zilhajj)’. So I used to pelt them all after that. Then I narrated it to him<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘Are you not pleased that you should be doing just as Ali<sup>asws</sup> used to do?’ So I left it’."}]}, {"index": 7757, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:173:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) وَ عَنِ ابْنِ أُذَيْنَةَ عَنِ ابْنِ بُكَيْرٍ قَالَ كَانَتِ الْجِمَارُ تُرْمَى جَمِيعاً قُلْتُ فَأَرْمِيهَا فَقَالَ لَا أَ مَا تَرْضَى أَنْ تَصْنَعَ كَمَا أَصْنَعُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Irahim, from his father, from Ibn Abu Umeyr, from Jameel, from Zurara, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), and from Ibn Azina, from Ibn Bukeyr. He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Jamarah</span> used to be pelted altogether’. I said, ‘So can I pelt them (all)?’ So he<sup>asws</sup> said: ‘No. Are you not pleased that you should be doing just as I<sup>asws</sup> do?’"}]}, {"index": 7758, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:173:5", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ سَعِيدٍ الرُّومِيِّ قَالَ رَمَى أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْجَمْرَةَ الْعُظْمَى فَرَأَى النَّاسَ وُقُوفاً فَقَامَ وَسْطَهُمْ ثُمَّ نَادَى بِأَعْلَى صَوْتِهِ أَيُّهَا النَّاسُ إِنَّ هَذَا لَيْسَ بِمَوْقِفٍ ثَلَاثَ مَرَّاتٍ فَفَعَلْتُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad,f rom Muhammad Bin Sinan, from Ibn Muskan, from Saeed Al Roumy who said, \n‘Abu Abdullah<sup>asws</sup> pelted <span class=\"iTxt\">Al-Jamarah </span>Al-Uzmah (the bigger <span class=\"iTxt\">Jamarah</span>), so he<sup>asws</sup> saw the people having paused. So he<sup>asws</sup> stood up in their midst, then called out in a loud voice of his<sup>asws</sup>: ‘O you people! This is not a Pausing Stop!’ – three times. So I did it (as well)’."}]}, {"index": 7759, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:173:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِرَجُلٍ مِنَ الْأَنْصَارِ إِذَا رَمَيْتَ الْجِمَارَ كَانَ لَكَ بِكُلِّ حَصَاةٍ عَشْرُ حَسَنَاتٍ تُكْتَبُ لَكَ لِمَا تَسْتَقْبِلُ مِنْ عُمُرِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Muhammad Bin Qays, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said to a man from the Ansaar: ‘When you have pelted <span class=\"iTxt\">Al-Jamarah</span>, there would be for you with each pebble (pelted), ten good deeds being Written for you (every year) for whatever is from your life in the future’."}]}, {"index": 7760, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:173:7", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَمْيِ الْجِمَارِ قَالَ لَهُ بِكُلِّ حَصَاةٍ يَرْمِي بِهَا تُحَطُّ عَنْهُ كَبِيرَةٌ مُوبِقَةٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "<span style=\"font-size: small\">A number of our companions, from Ahmad Bin Muhammad Bin Abu Abdullah</span><sup>asws</sup><span style=\"font-size: small\">, from his father, from Hammad, from Hareyz, </span>\n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding pelting of <span class=\"iTxt\">Al-Jamarah</span>. He<sup>asws</sup> said to him: ‘With each pebble one pelts with, a major sins get Obliterated from him’."}]}]}, "index": "al-kafi:4:3:173", "kind": "verse_list"}