{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 176"
        },
        "path": "/books/al-kafi:4:3:176",
        "titles": {
          "ar": "بَابُ مَنْ نَسِيَ رَمْيَ الْجِمَارِ أَوْ جَهِلَ",
          "en": "Chapter 176 – The one who forgets pelting the Jamarah, or is ignorant of it"
        }
      }
    ],
    "index": 1119,
    "local_index": 176,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 177"
        },
        "path": "/books/al-kafi:4:3:177",
        "titles": {
          "ar": "بَابُ الرَّمْيِ عَنِ الْعَلِيلِ وَ الصِّبْيَانِ وَ الرَّمْيِ رَاكِباً",
          "en": "Chapter 177 – The pelting (of the Jamarah) on behalf of the sick, and the children, and the pelting while riding"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 175"
        },
        "path": "/books/al-kafi:4:3:175",
        "titles": {
          "ar": "بَابُ مَنْ خَالَفَ الرَّمْيَ أَوْ زَادَ أَوْ نَقَصَ",
          "en": "Chapter 175 – The one who pelts differently, or more, or less"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:176",
    "titles": {
      "ar": "بَابُ مَنْ نَسِيَ رَمْيَ الْجِمَارِ أَوْ جَهِلَ",
      "en": "Chapter 176 – The one who forgets pelting the Jamarah, or is ignorant of it"
    },
    "verse_count": 5,
    "verse_start_index": 7775,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/152)"
        ],
        "index": 7776,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:176:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ رَجُلٌ نَسِيَ أَنْ يَرْمِيَ الْجِمَارَ حَتَّى أَتَى مَكَّةَ قَالَ يَرْجِعُ فَيَرْمِيهَا يَفْصِلُ بَيْنَ كُلِّ رَمْيَتَيْنِ بِسَاعَةٍ قُلْتُ فَاتَهُ ذَلِكَ وَ خَرَجَ قَالَ لَيْسَ عَلَيْهِ شَيْ‏ءٌ قَالَ قُلْتُ فَرَجُلٌ نَسِيَ السَّعْيَ بَيْنَ الصَّفَا وَ الْمَرْوَةِ فَقَالَ يُعِيدُ السَّعْيَ قُلْتُ فَاتَهُ ذَلِكَ حَتَّى خَرَجَ قَالَ يَرْجِعُ فَيُعِيدُ السَّعْيَ إِنَّ هَذَا لَيْسَ كَرَمْيِ الْجِمَارِ إِنَّ الرَّمْيَ سُنَّةٌ وَ السَّعْيَ بَيْنَ الصَّفَا وَ الْمَرْوَةِ فَرِيضَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘A man forgets that he should be pelting the <span class=\"iTxt\">Jamarah</span> until he comes to Makka’. He<sup>asws</sup> said: ‘He should return, and he should pelt them, with a gap between each two peltings being an hour’. I said, ‘Suppose he misses that and leaves?’ He<sup>asws</sup> said: ‘There is nothing upon him’. I said, ‘So (what about) the man who forgets the Sa’ee between Al-Safa and Al-Marwa?’ So he<sup>asws</sup> said: ‘He should repeat the Sa’ee’. I said, ‘He misses that until he goes out?’ He<sup>asws</sup> said: ‘He should return, so he would repeat the Sa’ee. This is not like pelting of the <span class=\"iTxt\">Jamarah</span>. The pelting is a Sunnah, and the Sa’ee between Al-Saf and Al-Marwa is an Obligation’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about a man who forgets throwing pebbles on al- Jamar until he is in Makkah. He (the Imam) said, ‘He must go back to throw pebbles with an interval of an hour between two throwing/ I then asked about if he misses it and leaves. He (the Imam) said, ‘He is not obligated for anything in this matter. 5 I asked him (the Imam) about the case of a person’s missing Sa‘y between al-Safa’ and al-Marwah. He (the Imam) said, ‘He must do it again.’ I then asked about if he misses it and leaves. He (the Imam) said, ‘He must come back and do Sa‘y between al- Safa’ and al-Marwah again, it is not like throwing pebbles on al-Jamar. Throwing pebbles on al-Jamar is sunnah and Sa‘y between al-Safa’ and al-Marwah is obligatory.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/153)"
        ],
        "index": 7777,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:176:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ وَ غَيْرِهِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ أَفَاضَ مِنْ جَمْعٍ حَتَّى انْتَهَى إِلَى مِنًى فَعَرَضَ لَهُ عَارِضٌ فَلَمْ يَرْمِ الْجَمْرَةَ حَتَّى غَابَتِ الشَّمْسُ قَالَ يَرْمِي إِذَا أَصْبَحَ مَرَّتَيْنِ إِحْدَاهُمَا بُكْرَةً وَ هِيَ لِلْأَمْسِ وَ الْأُخْرَى عِنْدَ زَوَالِ الشَّمْسِ وَ هِيَ لِيَوْمِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al nazar Bin Suweyd, and someone else, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who departs from Jam’a until he ends up to Mina. So an incident occurs for him, and he does not pelt the <span class=\"iTxt\">Jamarah</span> until the sun sets. He<sup>asws</sup> said: ‘He should pelt twice when it is the morning – one of them in the morning, and it would be for the day before, and the other one at the (start of the) decline of the sun, and it would be for (that) day of his’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd and others from ‘Abd Allah ibn Sinan who has said the following: “This is about a man who leaves Jam‘ (al-Muzdalifah) until he arrives in Mina’ and something happens to him because of which he does not throw pebbles until it is sunset. He (the Imam) said, ‘The next day he must throw pebbles twice, once early in the day for the day before and one at Zawal (declining of the sun toward the west at noontime) for the same day.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/154)"
        ],
        "index": 7778,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:176:3",
        "text": [
          "وَ عَنْهُ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) مَا تَقُولُ فِي امْرَأَةٍ جَهِلَتْ أَنْ تَرْمِيَ الْجِمَارَ حَتَّى نَفَرَتْ إِلَى مَكَّةَ قَالَ فَلْتَرْجِعْ وَ لْتَرْمِ الْجِمَارَ كَمَا كَانَتْ تَرْمِي وَ الرَّجُلُ كَذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Fazalat Bin Ayoub, from Muawiya Bin Ammar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding a woman who was ignorant (of the fact) that she should be pelting the <span class=\"iTxt\">Jamarah</span>, until she went to Makkah?’ He<sup>asws</sup> said: ‘So let her return and let her pelt the <span class=\"iTxt\">Jamarah</span>, just as she would have pelted; and (for) the men, it is like that (as well)’."
          ],
          "en.sarwar": [
            "3. It is narrated from him (narrator of previous Hadith) from Fadalah ibn Ayyub from Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a woman who is ignorant of throwing pebbles until she leaves Makkah. He (the Imam) said, ‘She must return to throw pebbles as she was required to throw and the same rule applies to man.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/154)"
        ],
        "index": 7779,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:176:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ فِي الْخَائِفِ لَا بَأْسَ بِأَنْ يَرْمِيَ الْجِمَارَ بِاللَّيْلِ وَ يُضَحِّيَ بِاللَّيْلِ وَ يُفِيضَ بِاللَّيْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, from Zurara, and Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding the scared one: ‘There is no problem if he were to pelt the <span class=\"iTxt\">Jamarah</span> at night, and sacrifice at night, and depart at night’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil from Zurarah who has said the following: “This is about a man who is afraid. Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is not harmful to throw pebbles during the night, slaughter offering and leave (al-Muzdalifah) during the night.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/155)"
        ],
        "index": 7780,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:176:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ أَخِيهِ الْحَسَنِ عَنْ زُرْعَةَ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ كَرِهَ رَمْيَ الْجِمَارِ بِاللَّيْلِ وَ رَخَّصَ لِلْعَبْدِ وَ الرَّاعِي فِي رَمْيِ الْجِمَارِ لَيْلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from his brother Al Hassan, from Zur’at, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having disliked pelting the <span class=\"iTxt\">Jamarah</span> at night, and he<sup>asws</sup> permitted it for the slave, and the herdsman with regards to pelting the <span class=\"iTxt\">Jamarah</span> at night’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from his brother al-Hassan from Zur’ah from Sanaa ‘ah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, disliked throwing pebbles during the night; but he gave permission to slaves and people tending camels to throw pebbles on al-Jamar during night.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:176",
  "kind": "verse_list"
}