{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 183"
        },
        "path": "/books/al-kafi:4:3:183",
        "titles": {
          "ar": "بَابُ الْهَدْيِ يَعْطَبُ أَوْ يَهْلِكُ قَبْلَ أَنْ يَبْلُغَ مَحِلَّهُ وَ الْأَكْلِ مِنْهُ",
          "en": "Chapter 183 – The sacrificial animal gets exhausted or persihes before it reaches its (slaughtering) place, and the eating from it"
        }
      }
    ],
    "index": 1126,
    "local_index": 183,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:183",
    "titles": {
      "ar": "بَابُ الْهَدْيِ يَعْطَبُ أَوْ يَهْلِكُ قَبْلَ أَنْ يَبْلُغَ مَحِلَّهُ وَ الْأَكْلِ مِنْهُ",
      "en": "Chapter 183 – The sacrificial animal gets exhausted or persihes before it reaches its (slaughtering) place, and the eating from it"
    },
    "verse_count": 9,
    "verse_start_index": 7815,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالحسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/170)"
        ],
        "index": 7816,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:183:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كُلُّ مَنْ سَاقَ هَدْياً تَطَوُّعاً فَعَطِبَ هَدْيُهُ فَلَا شَيْ‏ءَ عَلَيْهِ يَنْحَرُهُ وَ يَأْخُذُ نَعْلَ التَّقْلِيدِ فَيَغْمِسُهَا فِي الدَّمِ وَ يَضْرِبُ بِهِ صَفْحَةَ سَنَامِهِ وَ لَا بَدَلَ عَلَيْهِ وَ مَا كَانَ مِنْ جَزَاءِ صَيْدٍ أَوْ نَذْرٍ فَعَطِبَ فَعَلَ مِثْلَ ذَلِكَ وَ عَلَيْهِ الْبَدَلُ وَ كُلُّ شَيْ‏ءٍ إِذَا دَخَلَ الْحَرَمَ فَعَطِبَ فَلَا بَدَلَ عَلَى صَاحِبِهِ تَطَوُّعاً أَوْ غَيْرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from the one who informed him, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Everyone who ushers a sacrificial animal voluntarily, and his sacrificial animal gets exhausted, so there is nothing upon him. He should sacrifice it, and he should take a rein of the yoke, so he should immerse it in the blood, and he should strike its hump with it, and there would not be a replace upon him; and whatever was from the penalty of the hunting, or a vow, and it gets exhausted, so it would be upon the like of that, and upon him would be a camel; and every thing which enters the <span class=\"iTxt\">Harram</span> and it gets exhausted, so there would be no replacement upon its owner, be it a voluntary one or something else’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from those who narrated to him who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Whoever drives an offering animal optionally and it is damaged, he is not obligated for anything in this matter. He slaughters it and takes away the shove off its neck, stains it with blood, applies against its hump and he does not owe any replacement for it. Any offering animal, which is as expiation and penalty because of hunting or a vow and becomes damaged, he must do with it as the case above but he owes its replacement. Everything that enters al-Haram (the sacred area) and becomes damaged, the owner does not owe any replacement for it, regardless of being optional or otherwise.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/171)"
        ],
        "index": 7817,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:183:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى جَمِيعاً عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ اشْتَرَى أُضْحِيَّةً فَمَاتَتْ أَوْ سُرِقَتْ قَبْلَ أَنْ يَذْبَحَهَا فَقَالَ لَا بَأْسَ وَ إِنْ أَبْدَلَهَا فَهُوَ أَفْضَلُ وَ إِنْ لَمْ يَشْتَرِ فَلَيْسَ عَلَيْهِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, and Muhammad Bin Ismail, from Al Fazl Bin Sh<span class=\"iTxt\">azaan</span>, from Safwan Bin Yahya altogether from Muawiya Bin Ammar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who buys a sacrificial animal, so it dies or is stolen before he slaughters it. So he<sup>asws</sup> said: ‘There is no problem if he were to replace it, and it would be superior, and if he does not buy (another one) so there would be nothing upon him’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr and Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya all from Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who buys an animal for offering but it dies or is stolen before slaughtering. He (the Imam) said, ‘It is not harmful but it is better to replace it, and if he does not buy, he is not obligated for anything in this matter.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/171)"
        ],
        "index": 7818,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:183:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ رَجُلٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْبَدَنَةِ يُهْدِيهَا الرَّجُلُ فَتُكْسَرُ أَوْ تَهْلِكُ فَقَالَ إِنْ كَانَ هَدْياً مَضْمُوناً فَإِنَّ عَلَيْهِ مَكَانَهُ وَ إِنْ لَمْ يَكُنْ مَضْمُوناً فَلَيْسَ عَلَيْهِ شَيْ‏ءٌ قُلْتُ أَ وَ يَأْكُلُ مِنْهُ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from a man who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the camel which the man offers as a sacrifice, so it either breaks (a body part), or it perishes. So he<sup>asws</sup> said: ‘If his sacrificial animal was ensured, so upon him would be (another one) in its place; and if it did not happen to be ensured, so there is nothing upon him’. I said, ‘And can he eat from it?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from a man who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about a man who offers a badanah but it suffers damage or is destroyed. He (the Imam) said, ’If it is a binding obligation, he owes its replacement, otherwise, he is not obligated for anything in this matter.’ I then asked, ‘Can he use it for food?’ He (the Imam) said, ‘Yes, he can do so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/171)"
        ],
        "index": 7819,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:183:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْهَدْيِ الْوَاجِبِ إِذَا أَصَابَهُ كَسْرٌ أَوْ عَطَبٌ أَ يَبِيعُهُ صَاحِبُهُ وَ يَسْتَعِينُ بِثَمَنِهِ عَلَى هَدْيٍ آخَرَ قَالَ يَبِيعُهُ وَ يَتَصَدَّقُ بِثَمَنِهِ وَ يُهْدِي هَدْياً آخَرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the sacrificial animal, the Obligatory one, when it is hit by a break (of a body part), or damaged, can its owner sell it and be helped by its price upon (buying) another sacrificial animal?’ He<sup>asws</sup> said: ‘He should sell it and give in charity with its price, and he should offer another sacrificial animal’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man whose obligatory offering animal suffers damage or is destroyed; if he can sell it and get help from its sale to buy its replacement. He (the Imam) said, ‘He can sell it, give the proceeds as charity and offer another offering.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/172)"
        ],
        "index": 7820,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:183:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ إِذَا وَجَدَ الرَّجُلُ هَدْياً ضَالًّا فَلْيُعَرِّفْهُ يَوْمَ النَّحْرِ وَ الْيَوْمَ الثَّانِيَ وَ الْيَوْمَ الثَّالِثَ ثُمَّ يَذْبَحُهُ عَنْ صَاحِبِهِ عَشِيَّةَ يَوْمِ الثَّالِثِ ",
          "وَ قَالَ فِي الرَّجُلِ يَبْعَثُ بِالْهَدْيِ الْوَاجِبِ فَيَهْلِكُ الْهَدْيُ فِي الطَّرِيقِ قَبْلَ أَنْ يَبْلُغَ وَ لَيْسَ لَهُ سَعَةُ أَنْ يُهْدِيَ فَقَالَ اللَّهُ سُبْحَانَهُ أَوْلَى بِالْعُذْرِ إِلَّا أَنْ يَكُونَ يَعْلَمُ أَنَّهُ إِذَا سَأَلَ أُعْطِيَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two<sup>asws</sup> (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘When the man finds a stray sacrificial animal, so he should introduce it (to the people) on the day of the sacrifice, and the second day, and the third day. Then he should slaughter it on behalf of its owner on the evening of the third (day)’. ",
            "And he<sup>asws</sup> said regarding the man who sends the Obligatory sacrificial animal, but the animal perishes in the road before it reaches (the place of sacrifice), and there is no capacity for him that he would (get another) sacrificial animal’. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup>, Glorious is He<sup>azwj</sup>, is the Foremost with the (Accepting of the) excuse, except if he happens to know that when he asks (for a replacement) he would be given it’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn, from Safwan ibn Yahya from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “One of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘If one finds a lost offering animal, he must make a public announcement. He can do so on the day of al-Nahr (slaughtering the offering, 10th of Dhu al-Hajjah). On the second day and on the third day, then slaughter it on behalf of its owner in the evening of the third day.’ About a man who sends an obligatory offering and it is destroyed on the way before reaching its place and he is not able to replace it, he (the Imam) said, ‘Allah, most Glorious, is the first to accept his excuse, unless he knows that if he asks he is given his wish.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/173)"
        ],
        "index": 7821,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:183:6",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) عَنْ رَجُلٍ اشْتَرَى هَدْياً لِمُتْعَتِهِ فَأَتَى بِهِ أَهْلَهُ وَ رَبَطَهُ ثُمَّ انْحَلَّ وَ هَلَكَ هَلْ يُجْزِئُهُ أَوْ يُعِيدُ قَالَ لَا يُجْزِئُهُ إِلَّا أَنْ يَكُونَ لَا قُوَّةَ بِهِ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ab Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I asked Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) about a man who buys a sacrificial animal for his Tumatto. So he comes with it to his family and ties it. Then he frees it, and it perishes. Would it suffice him or should he repeat (get another one)?’ He<sup>asws</sup> said: ‘It would not suffice him unless if he does not happen to have any (financial) strength upon it’."
          ],
          "en.sarwar": [
            "6. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about a man who buys an offering animal for al- Tamattu‘ (advantageous), al-Hajj. He brings it to his family and ties down for security then releases it and it dies, if it is sufficient or he has to do it again. He (the Imam) said, ‘It is not sufficient unless he has no power on it.’” "
          ]
        }
      },
      {
        "index": 7822,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:183:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ اشْتَرَى كَبْشاً فَهَلَكَ مِنْهُ قَالَ يَشْتَرِي مَكَانَهُ آخَرَ قُلْتُ فَإِنِ اشْتَرَى مَكَانَهُ آخَرَ ثُمَّ وَجَدَ الْأَوَّلَ قَالَ إِنْ كَانَا جَمِيعاً قَائِمَيْنِ فَلْيَذْبَحِ الْأَوَّلَ وَ لْيَبِعِ الْآخَرَ وَ إِنْ شَاءَ ذَبَحَهُ وَ إِنْ كَانَ قَدْ ذَبَحَ الْآخَرَ فَلْيَذْبَحِ الْأَوَّلَ مَعَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ibn Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who bought a ram but it perished. He<sup>asws</sup> said: ‘He should buy another one in its place’. I said, ‘Supposing he buys another one in its place, then finds the first one?’ He<sup>asws</sup> said: ‘If it was so that both of them were standing (available), so let him slaughter the first one, and let him sell the other one, and if he so desires to, he can slaughter it; and if it was so that he had already slaughtered the other one, so let him slaughter the first one along with it’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ibn Muskan from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who buys a ram and it is destroyed (lost). He (the Imam) said, ‘He must buy another one to replace it.’ I then asked, ‘What is the rule if he buys another and finds the first one?’ He (the Imam) said, ‘If both are available, he slaughters the first one and sells the other, and if he wants he can slaughter it; but if he has already slaughtered the second he must slaughter the first one also.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/173)"
        ],
        "index": 7823,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:183:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يَضِلُّ هَدْيُهُ فَيَجِدُهُ رَجُلٌ آخَرُ فَيَنْحَرُهُ فَقَالَ إِنْ كَانَ نَحَرَهُ بِمِنًى فَقَدْ أَجْزَأَ عَنْ صَاحِبِهِ الَّذِي ضَلَّ مِنْهُ وَ إِنْ كَانَ نَحَرَهُ فِي غَيْرِ مِنًى لَمْ يُجْزِ عَنْ صَاحِبِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary, from Mansour Bin Hazim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man whose sacrificial animal strays, so another man finds it, and he sacrifices it. So he<sup>asws</sup> said: ‘If he had sacrificed it at Mina, so it would suffice from its owner from whom it had strayed; and if he had slaughtered it in other than Mina, it would not suffice from its owner’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hafs ibn al-Bakhtariy from Mansur ibn Hazim who has said the following: “This is about a man whose offering becomes lost and another man finds it and slaughters it. Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If he has slaughtered it in Mina’ it is sufficient for its owner. If it is slaughtered somewhere other than Mina’, it then is not sufficient for its owner,”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/174)"
        ],
        "index": 7824,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:183:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي رَجُلٍ اشْتَرَى هَدْياً فَنَحَرَهُ فَمَرَّ بِهِ رَجُلٌ فَعَرَفَهُ فَقَالَ هَذِهِ بَدَنَتِي ضَلَّتْ مِنِّي بِالْأَمْسِ وَ شَهِدَ لَهُ رَجُلَانِ بِذَلِكَ فَقَالَ لَهُ لَحْمُهَا وَ لَا يُجْزِئُ عَنْ وَاحِدٍ مِنْهُمَا ثُمَّ قَالَ وَ لِذَلِكَ جَرَتِ السُّنَّةُ بِإِشْعَارِهَا وَ تَقْلِيدِهَا إِذَا عُرِّفَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Jameel, from one of our companions, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding a man who buys a sacrificial animal and he sacrifices it. So a man passes by and recognises it and he says, ‘This here is my sacrificial animal which had strayed from me yesterday, and two men testify with that. So he<sup>asws</sup> said to him: ‘For him is its meat, and it would not suffice from any one of the two (as a sacrifice)’. Then he<sup>asws</sup> said: ‘And due to that, the Sunnah flowed with the marking it, and its yoking, when it is recognised’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn Hadid from Jamil from certain persons of our people who have said the following: “A man buys an offering animal then slaughters it. Another man passing by recognizes it and says, ‘It is my badanah that was lost yesterday.’ Two people testify in his favor. About such case, one of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘The meat belongs to him. As an offering it is not sufficient for neither of them.’ He (the Imam) then said, ‘For this reason there is the Sunnah of ‘al-Tsh‘ar (to mark) or collaring (such as hanging a shove from the neck of the offering animal).’” (Fatwa best explains Hadith 1-8 of this Chapter) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:183",
  "kind": "verse_list"
}