{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 185"
        },
        "path": "/books/al-kafi:4:3:185",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الذَّبْحِ</span>",
          "en": "Chapter 185 – The slaughtering"
        }
      }
    ],
    "index": 1128,
    "local_index": 185,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:185",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الذَّبْحِ</span>",
      "en": "Chapter 185 – The slaughtering"
    },
    "verse_count": 8,
    "verse_start_index": 7829,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/177)"
        ],
        "index": 7830,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:185:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَاذْكُرُوا اسْمَ اللَّهِ عَلَيْها صَوافَّ قَالَ ذَلِكَ حِينَ تَصُفُّ لِلنَّحْرِ تَرْبِطُ يَدَيْهَا مَا بَيْنَ الْخُفِّ إِلَى الرُّكْبَةِ وَ وُجُوبُ جُنُوبِهَا إِذَا وَقَعَتْ عَلَى الْأَرْضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic  <span class=\"ibTxt\">[22:36] therefore Mention the Name of Allah on these as they stand in a row</span>. He<sup>asws</sup> said: ‘That is where they are stood in a row for the sacrifice. You would tie down its hand in what is between the hooves up to the knees, and <span class=\"ibTxt\">[22:36] then when they fall down</span> - is when they fall upon the ground’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Abd Allah ibn Sinan who has said the following: “This is about the words of Allah, most Majestic, most Glorious, ’Pronounce the name of Allah on them while lined up. . . (22:36) He (the Imam) said that this is when they are lined up for slaughtering. When their front legs are tied down between the feet to the knees, and ’falling of their sides’ is a reference to their reaching the ground.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/178)"
        ],
        "index": 7831,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:185:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) كَيْفَ تُنْحَرُ الْبَدَنَةُ فَقَالَ تُنْحَرُ وَ هِيَ قَائِمَةٌ مِنْ قِبَلِ الْيَمِينِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup>, ‘How to slaughter the camel?’. So he<sup>asws</sup> said: ‘Slaughter it while it is standing, from the right hand side’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isma’il from Muhammad ibn al-Fadl from abu al-Sabbah al-Kinaniy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about how a badanah is slaughtered. He (the Imam) said, ‘It is slaughtered from its right side when standing.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/178)"
        ],
        "index": 7832,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:185:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) النَّحْرُ فِي اللَّبَّةِ وَ الذَّبْحُ فِي الْحَلْقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘النَّحْرُ’ the sacrificing is in the upper chest, and ‘الذَّبْحُ’ the slaughtering is in the throat’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Al-Nahr is slaughtering from the upper part of the chest (applicable to camels only) and al-Dhabh is slaughtering from the throat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/178)"
        ],
        "index": 7833,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:185:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ لَا يَذْبَحْ لَكَ الْيَهُودِيُّ وَ لَا النَّصْرَانِيُّ أُضْحِيَّتَكَ فَإِنْ كَانَتِ امْرَأَةً فَلْتَذْبَحْ لِنَفْسِهَا وَ تَسْتَقْبِلُ الْقِبْلَةَ وَ تَقُولُ وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَ الْأَرْضَ حَنِيفاً اللَّهُمَّ مِنْكَ وَ لَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby who said, ",
            "‘Neither should the Jew, nor the Christian slaughter your sacrificial animal for you. So if it was a woman, then let her slaughter it herself, and she should face the Qiblah, and she should be saying, <span class=\"ibTxt\">[6:79] I have turned myself, being upright, wholly to Him Who Originated the skies and the earth</span>. O Allah<sup>azwj</sup>! This is from You<sup>azwj</sup> and for You<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘Jews or Christians must not slaughter your offering. A woman can slaughter for herself facing al-Qiblah (al-Ka‘bah). She must say, ‘I have turned my face toward the Creator of the heavens and earth, obediently. O Lord, this is from You and for You.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/178)"
        ],
        "index": 7834,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:185:5",
        "text": [
          "وَ عَنْهُ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ  ( عليه السلام ) يَجْعَلُ السِّكِّينَ فِي يَدِ الصَّبِيِّ ثُمَّ يَقْبِضُ الرَّجُلُ عَلَى يَدِ الصَّبِيِّ فَيَذْبَحُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Muawiyia Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> used to make the knife to be in the hand of a youth, then the man would grab the hand of the youth, so he would slaughter’."
          ],
          "en.sarwar": [
            "5. It is narrated from him (narrator of previous Hadith) from Mu‘awiyah ibn ‘Ammar who has said the following: “Ali ibn al-Husayn ‘Alayhi al-Salam, would allow a child to place his hand on the knife. A man then places his hand on the hand of the child and slaughters the offering.’” (Fatwa best explains Hadith 1-5 of this Chapter) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/178)"
        ],
        "index": 7835,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:185:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ وَ ابْنِ أَبِي عُمَيْرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا اشْتَرَيْتَ هَدْيَكَ فَاسْتَقْبِلْ بِهِ الْقِبْلَةَ وَ انْحَرْهُ أَوِ اذْبَحْهُ وَ قُلْ وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَ الْأَرْضَ حَنِيفاً وَ مَا أَنَا مِنَ الْمُشْرِكِينَ إِنَّ صَلَاتِي وَ نُسُكِي وَ مَحْيَايَ وَ مَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَ بِذَلِكَ أُمِرْتُ وَ أَنَا مِنَ الْمُسْلِمِينَ اللَّهُمَّ مِنْكَ وَ لَكَ بِسْمِ اللَّهِ وَ اللَّهُ أَكْبَرُ اللَّهُمَّ تَقَبَّلْ مِنِّي ثُمَّ أَمِرَّ السِّكِّينَ وَ لَا تَنْخَعْهَا حَتَّى تَمُوتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwaan, and Ibn Abu Umeyr who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When you buy your sacirifical animal, so face the Qiblah with it, and sacrifice it, while slaughtering it (one should) say, <span class=\"ibTxt\">[6:79] Surely I have turned myself, being upright, wholly to Him Who Originated the skies and the earth, and I am not of the polytheists [6:162] Say: Surely my Prayer and my sacrifice and my life and my death are (all) for Allah, the Lord of the worlds [6:163] </span>There is no associate for Him<sup>azwj</sup>; and with that I am Commanded, and I am from the ‘Muslimeen’ (the submitters). O Allah<sup>azwj</sup>! From You<sup>azwj</sup> and for You <sup>azwj</sup>. In the Name of Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> is the Greatest. Accept from me’. Then use the knife and do not break its bones until it dies’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan from Safwan and ibn abu ‘Umayr who have said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When you buy an animal for offering, face the direction of Qiblah (Ka’bah), then slaughter the way camel or other animals are slaughtered. You must say, ‘I turn my face toward the One who has invented the skies and earth, as an obedient person and I am not a pagan. My salat (prayer), acts of al-Hajj (worship), my life and death are for Allah, Lord of the worlds, who has no partners and thus I am commanded and I am the first Muslim. O Allah, this is from You, for You and by the help of the name of Allah, Allah is great beyond description. O Allah, accept it from me.’ Thereafter make the knife to work until it is slaughtered; and do not cut the spinal cord before it dies.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/179)"
        ],
        "index": 7836,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:185:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُوسَى بْنِ جَعْفَرٍ الْبَغْدَادِيِّ عَنْ جَمِيلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَبْدَأُ بِمِنًى بِالذَّبْحِ قَبْلَ الْحَلْقِ وَ فِي الْعَقِيقَةِ بِالْحَلْقِ قَبْلَ الذَّبْحِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Musa Bin Ja’far Al Baghdady, from Jameel, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You should begin at Mina with the slaughter before the shaving (of the head); but in ‘الْعَقِيقَةِ’ ‘Al-Aqiqah’ (offering for a new born child) with the shaving (of the head) before the slaughter’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Musa ibn Ja’far al-Baghdadiy from Jamil who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘In Mina’ begin with slaughtering before shaving, and in al-‘Aqiqah (offering for child-birth) begin with shaving before slaughtering the offering.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/179)"
        ],
        "index": 7837,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:185:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي هَاشِمٍ الْبَجَلِيِّ عَنْ أَبِي خَدِيجَةَ قَالَ رَأَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ هُوَ يَنْحَرُ بَدَنَتَهُ مَعْقُولَةً يَدُهَا الْيُسْرَى ثُمَّ يَقُومُ مِنْ جَانِبِ يَدِهَا الْيُمْنَى وَ يَقُولُ بِسْمِ اللَّهِ وَ اللَّهُ أَكْبَرُ اللَّهُمَّ هَذَا مِنْكَ وَ لَكَ اللَّهُمَّ تَقَبَّلْهُ مِنِّي ",
          "ثُمَّ يَطْعُنُ فِي لَبَّتِهَا ثُمَّ يُخْرِجُ السِّكِّينَ بِيَدِهِ فَإِذَا وَجَبَتْ قَطَعَ مَوْضِعَ الذَّبْحِ بِيَدِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Abdul Rahman Bin Abu Hisham Al Bajaly, from Abu Khadeeja who said, ",
            "‘I saw Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> was sacrificing his<sup>asws</sup> camel having tied down its left leg. Then he<sup>asws</sup> stood by the side of its right hand, and he<sup>asws</sup> was saying: ‘In the Name of Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> is the Greatest. O Allah<sup>azwj</sup>! This is from You<sup>azwj</sup>, and for You<sup>azwj</sup>. O Allah<sup>azwj</sup>! Accept it from me<sup>asws</sup>’. ",
            "Then he<sup>asws</sup> made a cut in its chest, then brought out the knife. So when it fell down, he<sup>asws</sup> cut the place of the slaughter (throat), by his<sup>asws</sup> hand’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from ‘Abd al-Rahman ibn abu al-Hashim al-Bajaliy from abu Khadijah who has said the following: “I saw abu ‘Abd Allah, ‘Alayhi al-Salam, slaughtering a badanah with its left front leg tied down. He (the Imam) then stood up on the right side and said, ‘In the name of Allah, Allah is greater than can be described. O Lord, this is from You and for You. O Lord, accept it from me.’ He (the Imam) then caused a cut in the upper part of its chest. He (the Imam) then took out the knife with his hand. When it was on the ground he (the Imam) made a cut in the place for Dhabh.” NOTE: Fatwa best explains the following Chapters. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:185",
  "kind": "verse_list"
}