{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 191"}, "path": "/books/al-kafi:4:3:191", "titles": {"ar": "بَابُ صَوْمِ الْمُتَمَتِّعِ إِذَا لَمْ يَجِدِ الْهَدْيَ", "en": "Chapter 191 – The Fasting of the performer of Tumatto when he cannot find (afford) the sacrificial animal"}}], "index": 1134, "local_index": 191, "part_type": "Chapter", "path": "/books/al-kafi:4:3:191", "titles": {"ar": "بَابُ صَوْمِ الْمُتَمَتِّعِ إِذَا لَمْ يَجِدِ الْهَدْيَ", "en": "Chapter 191 – The Fasting of the performer of Tumatto when he cannot find (afford) the sacrificial animal"}, "verse_count": 16, "verse_start_index": 7871, "verses": [{"index": 7872, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنْ رِفَاعَةَ بْنِ مُوسَى قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمُتَمَتِّعِ لَا يَجِدُ الْهَدْيَ قَالَ يَصُومُ قَبْلَ التَّرْوِيَةِ بِيَوْمٍ وَ يَوْمَ التَّرْوِيَةِ وَ يَوْمَ عَرَفَةَ قُلْتُ فَإِنَّهُ قَدِمَ يَوْمَ التَّرْوِيَةِ قَالَ يَصُومُ ثَلَاثَةَ أَيَّامٍ بَعْدَ التَّشْرِيقِ \nقُلْتُ لَمْ يُقِمْ عَلَيْهِ جَمَّالُهُ قَالَ يَصُومُ يَوْمَ الْحَصْبَةِ وَ بَعْدَهُ يَوْمَيْنِ قَالَ قُلْتُ وَ مَا الْحَصْبَةُ قَالَ يَوْمُ نَفْرِهِ قُلْتُ يَصُومُ وَ هُوَ مُسَافِرٌ قَالَ نَعَمْ أَ لَيْسَ هُوَ يَوْمَ عَرَفَةَ مُسَافِراً إِنَّا أَهْلُ بَيْتٍ نَقُولُ ذَلِكَ لِقَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَصِيامُ ثَلاثَةِ أَيَّامٍ فِي الْحَجِّ يَقُولُ فِي ذِي الْحِجَّةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahad Bin Muhammad and Sahl Bin Ziyad, altogether from Rafa’at Bin Musa who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the performer of <span class=\"iTxt\">Tumatto</span> not finding (affording) the sacrificial animal’. He<sup>asws</sup> said: ‘He should Fast before Al-Tarwiyya by one day, and the day of Al-Tarwiyya (8<sup>th</sup> Zilhajj), and the day of Arafaat’. I said, ‘Supposing he had arrived on the day of Al-Tarwiyya?’ He<sup>asws</sup> said: ‘He should Fast then three days after Al-Tashreek (11<sup>th</sup>, 12<sup>th</sup>, & 13<sup>th</sup> Zilhajj)’. \nI said, ‘(Supposing) his camelier does not wait for him?’ He<sup>asws</sup> said: ‘He should Fast the day of <span class=\"iTxt\">Al-Hasba</span>, and two days after it’. I said, ‘And what is <span class=\"iTxt\">Al-Hasba</span>?’ He<sup>asws</sup> said: ‘The day he leaves’. I said, ‘He should Fast and he is a traveller?’ He<sup>asws</sup> said: ‘Yes. Was he not a traveller on the day of Arafaat? We<sup>asws</sup>, the People<sup>asws</sup> of the Household are saying that due to the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[2:196] but he should Fast for three days during the Hajj</span>. He<sup>azwj</sup> is Saying: “During Zilhajj”’."}]}, {"index": 7873, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:2", "text": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) أَنَّهُ قَالَ مَنْ لَمْ يَجِدْ هَدْياً وَ أَحَبَّ أَنْ يُقَدِّمَ الثَّلَاثَةَ الْأَيَّامِ فِي أَوَّلِ الْعَشْرِ فَلَا بَأْسَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad Bin Abu Nasr, from Abdul Kareem Bin Amro, from Zurara, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup> having said: ‘The one who cannot find a sacrificial animal and would like to bring forward the three days (of Fasting) during the first ten (days), so there is no problem’."}]}, {"index": 7874, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى وَ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ مُتَمَتِّعٍ لَمْ يَجِدْ هَدْياً قَالَ يَصُومُ ثَلَاثَةَ أَيَّامٍ فِي الْحَجِّ يَوْماً قَبْلَ التَّرْوِيَةِ وَ يَوْمَ التَّرْوِيَةِ وَ يَوْمَ عَرَفَةَ قَالَ قُلْتُ فَإِنْ فَاتَهُ ذَلِكَ قَالَ يَتَسَحَّرُ لَيْلَةَ الْحَصْبَةِ وَ يَصُومُ ذَلِكَ الْيَوْمَ وَ يَوْمَيْنِ بَعْدَهُ قُلْتُ فَإِنْ لَمْ يُقِمْ عَلَيْهِ جَمَّالُهُ أَ يَصُومُهَا فِي الطَّرِيقِ قَالَ إِنْ شَاءَ صَامَهَا فِي الطَّرِيقِ وَ إِنْ شَاءَ إِذَا رَجَعَ إِلَى أَهْلِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan Bin Yahya, and Ibn Abu Umeyr, from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the performer of <span class=\"iTxt\">Tumatto</span>, not finding a sacrificial animal. He<sup>asws</sup> said: ‘He should Fast for three days during the Hajj – one day before Al-Tarwiyya (7<sup>th</sup> Zilhajj), and the day of Al-Tarwiyya (8<sup>th</sup> Zilhajj), and the day of Arafat (9<sup>th</sup> Zilhajj)’. I said, ‘Supposing he misses that’. He<sup>asws</sup> said: ‘He should take a pre-dawn meal on the day of <span class=\"iTxt\">Al-Hasba </span>(leaving) and he should Fast that day, and the two days after it’. I said, ‘Supposing his camelier does not stay for him, can he Fast these on the way?’ He<sup>asws</sup> said: ‘If he so desires to, he can Fast these in the way, and if he so desires to, (or) when he returns to his family’."}]}, {"index": 7875, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:4", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ مُتَمَتِّعٍ يَدْخُلُ يَوْمَ التَّرْوِيَةِ وَ لَيْسَ مَعَهُ هَدْيٌ قَالَ فَلَا يَصُومُ ذَلِكَ الْيَوْمَ وَ لَا يَوْمَ عَرَفَةَ وَ يَتَسَحَّرُ لَيْلَةَ الْحَصْبَةِ فَيُصْبِحُ صَائِماً وَ هُوَ يَوْمُ النَّفْرِ وَ يَصُومُ يَوْمَيْنِ بَعْدَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin yahya, from Ays Bin Al Qasim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the performer of <span class=\"iTxt\">Tumatto</span> entering the day of Al-Tarwiyya (8<sup>th</sup> Zilhajj), and there is no ‘هَدْيٌ’ (sacrificial animal) with him. He<sup>asws</sup> said: ‘So he should not Fast that day, nor the day of Arafaat, and he should take a pre-dawn meal on the night of the leaving, so he would be Fasting in the morning, and it would be the day of the sacrifice, and he would Fast the two days after it’."}]}, {"index": 7876, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ قُلْتُ لَهُ رَجُلٌ تَمَتَّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ فِي عَيْبَتِهِ ثِيَابٌ لَهُ يَبِيعُ مِنْ ثِيَابِهِ وَ يَشْتَرِي هَدْيَهُ قَالَ لَا هَذَا يَتَزَيَّنُ بِهِ الْمُؤْمِنُ يَصُومُ وَ لَا يَأْخُذُ شَيْئاً مِنْ ثِيَابِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from one of his companions, \n(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘A man performing <span class=\"iTxt\">Tumatto</span> with the Umra to the Hajj and in his bag are his clothes. Is it for him that he sells his clothes and buys his sacrificial animal (from its proceeds)?’ He<sup>asws</sup> said: ‘No. This is what the Believers adorns himself with. He should Fast and not take anything from his clothes’."}]}, {"index": 7877, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي مُتَمَتِّعٍ يَجِدُ الثَّمَنَ وَ لَا يَجِدُ الْغَنَمَ قَالَ يُخَلِّفُ الثَّمَنَ عِنْدَ بَعْضِ أَهْلِ مَكَّةَ وَ يَأْمُرُ مَنْ يَشْتَرِي لَهُ وَ يَذْبَحُ عَنْهُ وَ هُوَ يُجْزِئُ عَنْهُ فَإِنْ مَضَى ذُو الْحِجَّةِ أَخَّرَ ذَلِكَ إِلَى قَابِلٍ مِنْ ذِي الْحِجَّةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the performer of <span class=\"iTxt\">Tumatto</span> finding the price and not finding the sheep. He<sup>asws</sup> said: ‘He should leave behind the price with one of the inhabitants of Makkah, and instruct someone to buy for him and slaughter on his behalf, and he would be sufficed from it. So if Zil Hijja passes by, he would delay that to the Zil Hijja in the next year’."}]}, {"index": 7878, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:7", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ يَحْيَى الْأَزْرَقِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ مُتَمَتِّعٍ كَانَ مَعَهُ ثَمَنُ هَدْيٍ وَ هُوَ يَجِدُ بِمِثْلِ ذَلِكَ الَّذِي مَعَهُ هَدْياً فَلَمْ يَزَلْ يَتَوَانَى وَ يُؤَخِّرُ ذَلِكَ حَتَّى إِذَا كَانَ آخِرُ النَّهَارِ غَلَتِ الْغَنَمُ فَلَمْ يَقْدِرْ أَنْ يَشْتَرِيَ بِالَّذِي مَعَهُ هَدْياً قَالَ يَصُومُ ثَلَاثَةَ أَيَّامٍ بَعْدَ أَيَّامِ التَّشْرِيقِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Yahya Al Azraq who said, \n‘I asked Abu Al-Hassan<sup>asws</sup> about the performer of <span class=\"iTxt\">Tumatto</span> who had the price of the ‘هَدْيٌ’ (Hadayy - thesacrificial animal) with him and he could have found a sacrificial animal with the likes of what was with him. But he did not cease to hesitate and delay that until when it was the end of the day, the sheep became expensive, so he was not able upon buying a sacrificial animal by that which was with him. He<sup>asws</sup> said: ‘He should Fast the three days after the days of Al-Tashreek’."}]}, {"index": 7879, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:8", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُهُ عَنْ رَجُلٍ تَمَتَّعَ فَلَمْ يَجِدْ هَدْياً فَصَامَ الثَّلَاثَةَ الْأَيَّامِ فَلَمَّا قَضَى نُسُكَهُ بَدَا لَهُ أَنْ يُقِيمَ بِمَكَّةَ قَالَ يَنْتَظِرُ مَقْدَمَ أَهْلِ بِلَادِهِ فَإِذَا ظَنَّ أَنَّهُمْ قَدْ دَخَلُوا فَلْيَصُمِ السَّبْعَةَ الْأَيَّامِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ahad Bin Muhammad Bin Abu nasr, from Abdul Kareem, from Abu Baseer who said, \n‘I asked him<sup>asws</sup> about a man who performs <span class=\"iTxt\">Tumatto</span>, but cannot find a sacrificial animal. So he Fasts the three days. So when he fulfils his rituals, it becomes inevitable for him that he stays in Makkah. He<sup>asws</sup> said: ‘He should wait for the arrival of the Inhabitants of his city. So when he thinks that they have entered (the city), so let him Fast the seven days’."}]}, {"index": 7880, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:9", "text": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ تَمَتَّعَ فَلَمْ يَجِدْ مَا يُهْدِي بِهِ حَتَّى إِذَا كَانَ يَوْمُ النَّفْرِ وَجَدَ ثَمَنَ شَاةٍ أَ يَذْبَحُ أَوْ يَصُومُ قَالَ بَلْ يَصُومُ فَإِنَّ أَيَّامَ الذَّبْحِ قَدْ مَضَتْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhaad Bin Abu Nasr, from Abdul Kareem, from Abu Baseer, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about a man who performs <span class=\"iTxt\">Tumatto</span>, but cannot find what he could sacrifice with until when it was the day of departure, he found the price of a sheep. Should he slaughter it, or should he Fast?’ He<sup>asws</sup> said: ‘But he should Fast, for the days of the slaughter have passed’."}]}, {"index": 7881, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:10", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ مَنْصُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ لَمْ يَصُمْ فِي ذِي الْحِجَّةِ حَتَّى يُهَلَّ هِلَالُ الْمُحَرَّمِ فَعَلَيْهِ دَمُ شَاةٍ وَ لَيْسَ لَهُ صَوْمٌ وَ يَذْبَحُهُ بِمِنًى .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary, from Mansour, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who does not Fast during Zil Hijja until the crescent of <span class=\"iTxt\">Muharram</span> is seen, so upon him is blood of a sheep, and it is not for him to Fast, and he should slaughter it at Mina’."}]}, {"index": 7882, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:11", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ بَحْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ مُتَمَتِّعٍ صَامَ ثَلَاثَةَ أَيَّامٍ فِي الْحَجِّ ثُمَّ أَصَابَ هَدْياً يَوْمَ خَرَجَ مِنْ مِنًى قَالَ أَجْزَأَهُ صِيَامُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Abdullah Bin Bahr, from Hammad Bin Usman who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the performer of <span class=\"iTxt\">Tumatto</span> Fasting for three days during the Hajj, then he comes across a sacrificial animal on the day he exits from Makkah. He<sup>asws</sup> said: ‘His Fasts would suffice him’."}]}, {"index": 7883, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:12", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ مَنْ مَاتَ وَ لَمْ يَكُنْ لَهُ هَدْيٌ لِمُتْعَتِهِ فَلْيَصُمْ عَنْهُ وَلِيُّهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Muawiya Bin Ammar who said, \n‘The one who dies and did not happen to have a sacrificial animal for him <span class=\"iTxt\">Tumatto</span>, so let his guardian Fast on his behalf’."}]}, {"index": 7884, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:13", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنْ رَجُلٍ يَتَمَتَّعُ بِالْعُمْرَةِ إِلَى الْحَجِّ وَ لَمْ يَكُنْ لَهُ هَدْيٌ فَصَامَ ثَلَاثَةَ أَيَّامٍ فِي الْحَجِّ ثُمَّ مَاتَ بَعْدَ مَا رَجَعَ إِلَى أَهْلِهِ قَبْلَ أَنْ يَصُومَ السَّبْعَةَ الْأَيَّامِ أَ عَلَى وَلِيِّهِ أَنْ يَقْضِيَ عَنْهُ قَالَ مَا أَرَى عَلَيْهِ قَضَاءً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having been asked about a man performing <span class=\"iTxt\">Tumatto</span> with the Umra to the Hajj, and does not happen to have a sacrificial animal with him So he Fasts the three days during the Hajj, then dies after having returned to his family, before he Fasts the seven days. Is it upon his guardian that he fulfils it on his behalf?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> do not see a repayment to be upon him’."}]}, {"index": 7885, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:14", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ عُقْبَةَ بْنِ خَالِدٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ تَمَتَّعَ وَ لَيْسَ مَعَهُ مَا يَشْتَرِي بِهِ هَدْياً فَلَمَّا أَنْ صَامَ ثَلَاثَةَ أَيَّامٍ فِي الْحَجِّ أَيْسَرَ أَ يَشْتَرِي هَدْياً فَيَنْحَرُهُ أَوْ يَدَعُ ذَلِكَ وَ يَصُومُ سَبْعَةَ أَيَّامٍ إِذَا رَجَعَ إِلَى أَهْلِهِ قَالَ يَشْتَرِي هَدْياً فَيَنْحَرُهُ وَ يَكُونُ صِيَامُهُ الَّذِي صَامَهُ نَافِلَةً لَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah Bin Hilal, from Uqba Bin Khalid who said, \n‘I asked Abu Abdullah<sup>asws</sup> about a man who performs <span class=\"iTxt\">Tumatto</span> and there is not with him (sufficient money) what he could buy a sacrificial animal with. So when he Fasts three days during the Hajj, there is an ease (financially). Should he buy a sacrificial animal and sacrifice it, or should he leave that and Fast seven days when he returns to his family?’ He<sup>asws</sup> He should buy a sacrificial animal, so he should sacrifice it, and his Fasts which he had Fasted would happen to be optional ones of his’."}]}, {"index": 7886, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:15", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ رَفَعَهُ فِي قَوْلِهِ عَزَّ وَ جَلَّ فَمَنْ لَمْ يَجِدْ فَصِيامُ ثَلاثَةِ أَيَّامٍ فِي الْحَجِّ وَ سَبْعَةٍ إِذا رَجَعْتُمْ تِلْكَ عَشَرَةٌ كامِلَةٌ قَالَ كَمَالُهَا كَمَالُ الْأُضْحِيَّةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin IBrahimm, from his father, raising it, \n‘Regarding the Words of the Mighty and Majestic <span class=\"ibTxt\">[2:196] but he who cannot find (any offering) should Fast for three days during the Hajj and for seven days when he returns; these (make) ten (days) complete</span>. He<sup>asws</sup> said: ‘Its completion is the completion of the slaughtering’."}]}, {"index": 7887, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:4:3:191:16", "text": "بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَحْمَدَ بْنِ عَبْدِ اللَّهِ الْكَرْخِيِّ قَالَ قُلْتُ لِلرِّضَا ( عليه السلام ) الْمُتَمَتِّعُ يَقْدَمُ وَ لَيْسَ مَعَهُ هَدْيٌ أَ يَصُومُ مَا لَمْ يَجِبْ عَلَيْهِ قَالَ يَصْبِرُ إِلَى يَوْمِ النَّحْرِ فَإِنْ لَمْ يُصِبْ فَهُوَ مِمَّنْ لَمْ يَجِدْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "One of our companions, from Muhmmad Bin Al Husayn, from Ahmad Bin Abdullah Al Karkhy who said, \n‘I said to Al-Reza<sup>asws</sup>, ‘The performer of <span class=\"iTxt\">Tumatto</span> arrives and there is no sacrificial animal with him. Should he Fast for as long as it is not Obligated upon him?’ He<sup>asws</sup> said: ‘He should be patient up to the day of the sacrifice. So, if he does not come across (a sacrificial animal), so he would be from the ones <span class=\"ibTxt\">cannot find (any offering)</span>’."}]}]}, "index": "al-kafi:4:3:191", "kind": "verse_list"}