{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:4:3:2",
        "titles": {
          "ar": "بَابُ بَدْءِ الْبَيْتِ وَ الطَّوَافِ",
          "en": "Chapter 2 – Commencement of the House (Kaaba) and the Circumambulation"
        }
      }
    ],
    "index": 945,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:4:3:3",
        "titles": {
          "ar": "بَابُ أَنَّ أَوَّلَ مَا خَلَقَ اللَّهُ مِنَ الْأَرَضِينَ مَوْضِعُ الْبَيْتِ وَ كَيْفَ كَانَ أَوَّلَ مَا خَلَقَ",
          "en": "Chapter 3 – The first of what Allah<sup>azwj</sup> Created from the lands was the place of the House (Kaaba), and how was the first of what He<sup>azwj</sup> Created"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:4:3:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>َابُ بَدْءِ الْحَجَرِ</span> وَ الْعِلَّةِ فِي اسْتِلَامِهِ",
          "en": "Chapter 1 – The commencement of the (Black) Stone and the reason for kissing it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:2",
    "titles": {
      "ar": "بَابُ بَدْءِ الْبَيْتِ وَ الطَّوَافِ",
      "en": "Chapter 2 – Commencement of the House (Kaaba) and the Circumambulation"
    },
    "verse_count": 2,
    "verse_start_index": 6672,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/7)"
        ],
        "index": 6673,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:2:1",
        "refs": {
          "Mentions": [
            "/books/quran:2:30",
            "/books/quran:67:1",
            "/books/quran:2:29",
            "/books/quran:70:24",
            "/books/quran:68:1",
            "/books/quran:70:25"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي عَبَّادٍ عِمْرَانَ بْنِ عَطِيَّةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ بَيْنَا أَبِي ( عليه السلام ) وَ أَنَا فِي الطَّوَافِ إِذْ أَقْبَلَ رَجُلٌ شَرْجَبٌ مِنَ الرِّجَالِ فَقُلْتُ وَ مَا الشَّرْجَبُ أَصْلَحَكَ اللَّهُ قَالَ الطَّوِيلُ فَقَالَ السَّلَامُ عَلَيْكُمْ وَ أَدْخَلَ رَأْسَهُ بَيْنِي وَ بَيْنَ أَبِي",
          "قَالَ فَالْتَفَتَ إِلَيْهِ أَبِي وَ أَنَا فَرَدَدْنَا عَلَيْهِ السَّلَامَ ثُمَّ قَالَ أَسْأَلُكَ رَحِمَكَ اللَّهُ فَقَالَ لَهُ أَبِي نَقْضِي طَوَافَنَا ثُمَّ تَسْأَلُنِي فَلَمَّا قَضَى أَبِيَ الطَّوَافَ دَخَلْنَا الْحِجْرَ فَصَلَّيْنَا الرَّكْعَتَيْنِ ثُمَّ الْتَفَتَ فَقَالَ أَيْنَ الرَّجُلُ يَا بُنَيَّ فَإِذَا هُوَ وَرَاءَهُ قَدْ صَلَّى فَقَالَ مِمَّنِ الرَّجُلُ قَالَ مِنْ أَهْلِ الشَّامِ فَقَالَ وَ مِنْ أَيِّ أَهْلِ الشَّامِ فَقَالَ مِمَّنْ يَسْكُنُ بَيْتَ الْمَقْدِسِ فَقَالَ قَرَأْتَ الْكِتَابَيْنِ قَالَ نَعَمْ قَالَ سَلْ عَمَّا بَدَا لَكَ",
          "فَقَالَ أَسْأَلُكَ عَنْ بَدْءِ هَذَا الْبَيْتِ وَ عَنْ قَوْلِهِ ن وَ الْقَلَمِ وَ ما يَسْطُرُونَ وَ عَنْ قَوْلِهِ وَ الَّذِينَ فِي أَمْوالِهِمْ حَقٌّ مَعْلُومٌ لِلسَّائِلِ وَ الْمَحْرُومِ فَقَالَ يَا أَخَا أَهْلِ الشَّامِ اسْمَعْ حَدِيثَنَا وَ لَا تَكْذِبْ عَلَيْنَا فَإِنَّهُ مَنْ كَذَبَ عَلَيْنَا فِي شَيْ‏ءٍ فَقَدْ كَذَبَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مَنْ كَذَبَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَدْ كَذَبَ عَلَى اللَّهِ وَ مَنْ كَذَبَ عَلَى اللَّهِ عَذَّبَهُ اللَّهُ عَزَّ وَ جَلَّ",
          "أَمَّا بَدْءُ هَذَا الْبَيْتِ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَالَ لِلْمَلَائِكَةِ إِنِّي جاعِلٌ فِي الْأَرْضِ خَلِيفَةً فَرَدَّتِ الْمَلَائِكَةُ عَلَى اللَّهِ عَزَّ وَ جَلَّ فَقَالَتْ أَ تَجْعَلُ فِيها مَنْ يُفْسِدُ فِيها وَ يَسْفِكُ الدِّماءَ فَأَعْرَضَ عَنْهَا فَرَأَتْ أَنَّ ذَلِكَ مِنْ سَخَطِهِ فَلَاذَتْ بِعَرْشِهِ فَأَمَرَ اللَّهُ مَلَكاً مِنَ الْمَلَائِكَةِ أَنْ يَجْعَلَ لَهُ بَيْتاً فِي السَّمَاءِ السَّادِسَةِ يُسَمَّى الضُّرَاحَ بِإِزَاءِ عَرْشِهِ فَصَيَّرَهُ لِأَهْلِ السَّمَاءِ يَطُوفُ بِهِ سَبْعُونَ أَلْفَ مَلَكٍ فِي كُلِّ يَوْمٍ لَا يَعُودُونَ وَ يَسْتَغْفِرُونَ",
          "فَلَمَّا أَنْ هَبَطَ آدَمُ إِلَى السَّمَاءِ الدُّنْيَا أَمَرَهُ بِمَرَمَّةِ هَذَا الْبَيْتِ وَ هُوَ بِإِزَاءِ ذَلِكَ فَصَيَّرَهُ لآِدَمَ وَ ذُرِّيَّتِهِ كَمَا صَيَّرَ ذَلِكَ لِأَهْلِ السَّمَاءِ قَالَ صَدَقْتَ يَا ابْنَ رَسُولِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Abu Abbad Imran Bin Atiyya, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whilst my<sup>asws</sup> father<sup>asws</sup> and I<sup>asws</sup> were in the circumambulation we<sup>asws</sup> came across a ‘Sharjab’ from the men. So I<sup>asws</sup> said: ‘And what is the ‘Sharjab’, may Allah<sup>azwj</sup> Keep you<sup>asws</sup> well?’ He<sup>asws</sup> said: ‘The (unusually) tall’. So he said, ‘The greetings be unto you<sup>asws</sup>!’, and he entered his head in between me<sup>asws</sup> and my<sup>asws</sup> father<sup>asws</sup>’.",
            "He<sup>asws</sup> said: ‘So my<sup>asws</sup> father<sup>asws</sup> and I<sup>asws</sup> turned towards him, and we<sup>asws</sup> returned the greeting. Then he said, ‘I would like to ask you<sup>asws</sup> (a question), may Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>’. So my<sup>asws</sup> father<sup>asws</sup> said to him: ‘We<sup>asws</sup> shall complete our<sup>asws</sup> circumambulation, then you can ask me<sup>asws</sup>’. So when my<sup>asws</sup> father<sup>asws</sup> completed the circumambulation, we<sup>asws</sup> went over to the (Black) Stone, and we<sup>asws</sup> Prayed two Cycles. Then he<sup>asws</sup> turned, so he<sup>asws</sup> said: ‘Where is the man, O my<sup>asws</sup> son<sup>asws</sup>?’ So there he was, behind him<sup>asws</sup>, having had Prayed. So he<sup>asws</sup> said: ‘From whom is the man?’ He said, ‘From the people of Syria’. So he<sup>asws</sup> said: ‘And from which people of Syria?’ He said, ‘From the dwellers of Bayt Al-Maqdis’. He<sup>asws</sup> said: ‘You recite the two Books?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘Ask about whatever comes to you’.",
            "So he said, ‘I ask you<sup>asws</sup> about the commencement of this House and about His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:68#h1\">[68:1]</a> Noon, and I swear by the Pen and what he will be writing</span>, and about His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:70#h24\">[70:24]</a> And those in whose wealth there is a known right <a href=\"/#/books/quran:70#h25\">[70:25]</a> For him who asks and for him who is denied</span>’. So he<sup>asws</sup> said: ‘O brother of the people of Syria. Hear our Hadeeth and do not belie against us, for the one who belies upon us<sup>asws</sup> with regards to anything, so he has belied upon Rasool-Allah<sup>saww</sup>, and the one who belies upon Rasool-Allah<sup>saww</sup>, so he has belied upon Allah<sup>azwj</sup>, and the one who belies upon Allah<sup>azwj</sup>, Allah<sup>azwj</sup> Mighty and Majestic would Punish him.",
            "As for the commencement of this House, so Allah<sup>azwj</sup> Blessed and High Said to the Angels <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h30\">[2:30]</a> And when your Lord said to the Angels, I am going to Make a Caliph in the earth</span>, so the Angels responded to Allah<sup>azwj</sup> Mighty and Majestic, and <span class=\"ibTxt\">they said: Are You going to Make in it one as shall make mischief therein and shed the blood</span>? So He<sup>azwj</sup> Turned away from it. Thus, they saw that to be from His<sup>azwj</sup> Anger, so they sought Refuge by His<sup>azwj</sup> Throne. So Allah<sup>azwj</sup> Commanded an Angel from His<sup>azwj</sup> Angels that he should make a House for Him<sup>azwj</sup> in the sixth sky, called Al-Zurrah facing His<sup>azwj</sup> Throne. So He<sup>azwj</sup> Rendered it for the inhabitants of the sky. Seventy thousand Angels circumambulate by it every day, not returning (again), and seeking Forgiveness. ",
            "So when Adam<sup>as</sup> descended to the sky of the world, He<sup>azwj</sup> Commanded him<sup>as</sup> with the restoration of this House, and it is parallel to that. So He<sup>azwj</sup> Rendered it for Adam<sup>as</sup> and his<sup>as</sup> offspring, just as that was Rendered to the inhabitants of the sky’. He said, ‘You<sup>asws</sup> speak the truth, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from abu ‘Abbad, ‘Imran ibn ‘Atiyah who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that once when my father and I were performing Tawaf, a man, Sharjab, among men came forward. I asked, ’May Allah keep you well, what is al-Sharjab?’ He (the Imam) replied, ‘It means ‘taller’ than others.’ The man said, ‘Al-Salamu ‘Alaykum’ and he brought his head between my father and me. He (the Imam) said that my father then turned to him and so did I, and responded to his greeting of peace. He said, ‘I have a question, may Allah grant you blessings.’ My father said to him, ‘Allow us to complete our Tawaf, then you can ask your question.’ When my father completed Tawaf we entered al-Hijr and said two Rak‘at salat (prayer). He (my father) turned around and asked, ‘Where is the man, son?’ He was just behind him and had completed his salat (prayer). My father asked, ‘Where from is the gentleman?’ He replied, ‘I am from al-Sham.’ He then asked, ‘From which people of al-Sham are you?’ He replied, ‘I am from the people of Bayt al- Maqdis.’ He (my father) asked, ‘Have you read the two books?’ He (the man) replied, ‘Yes, I have read them.’ He (the Imam) then said, ‘Ask your question.’ He said, ‘I like to ask about the beginning of this House, and about His words, “Nun, and by the pen with which you write” <a href=\"/#/books/quran:67#h1\">[67:1]</a> and about His words, “...those in whose properties there is a certain share for the needy and deprived.’” (75:25-26) He (the Imam) then said, ‘O brother from al-Sham, listen to our Hadith and do not call it false. Those who call our Hadith false have called the words of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, as false, and those who do so have called the words of Allah as false. Those who call the words of Allah as false, Allah, the Most Majestic, the Most Glorious, subjects them to punishment. The beginning of the House was when Allah, the most Blessed, the most High, said to the angels, “I have decided to appoint a deputy on earth. . . .” <a href=\"/#/books/quran:2#h29\">[2:29]</a> The angels responded to Allah, the Most Majestic, the Most Glorious, saying, “Do You want to appoint one who causes destruction and bloodshed therein?” He did not pay attention to them and they realized that it was due to His anger. They sought refuge with His Throne and Allah commanded an angel from among them to establish a house for Him in the sixth heaven, which was called al-Durrah parallel to His Throne. It was designed for the inhabitants of the heaven for Tawaf by seventy thousand angels every day, of whom no one had to return for Tawaf again. They ask forgiveness. When Adam descended to the heaven of the world, He commanded him to build this House. This is parallel to that house. This is designated for Adam and his offspring just as that is designated for those in the heaven.’ The man then said, ‘You have spoken the truth, O child of the Messenger of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/9)"
        ],
        "index": 6674,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:2:2",
        "refs": {
          "Mentions": [
            "/books/quran:2:30"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ وَ ابْنِ مَحْبُوبٍ جَمِيعاً عَنِ الْمُفَضَّلِ بْنِ صَالِحٍ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كُنْتُ مَعَ أَبِي فِي الْحِجْرِ فَبَيْنَمَا هُوَ قَائِمٌ يُصَلِّي إِذْ أَتَاهُ رَجُلٌ فَجَلَسَ إِلَيْهِ فَلَمَّا انْصَرَفَ سَلَّمَ عَلَيْهِ ثُمَّ قَالَ إِنِّي أَسْأَلُكَ عَنْ ثَلَاثَةِ أَشْيَاءَ لَا يَعْلَمُهَا إِلَّا أَنْتَ وَ رَجُلٌ آخَرُ قَالَ مَا هِيَ",
          "قَالَ أَخْبِرْنِي أَيَّ شَيْ‏ءٍ كَانَ سَبَبُ الطَّوَافِ بِهَذَا الْبَيْتِ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا أَمَرَ الْمَلَائِكَةَ أَنْ يَسْجُدُوا لآِدَمَ ( عليه السلام ) رَدُّوا عَلَيْهِ فَقَالُوا أَ تَجْعَلُ فِيها مَنْ يُفْسِدُ فِيها وَ يَسْفِكُ الدِّماءَ وَ نَحْنُ نُسَبِّحُ بِحَمْدِكَ وَ نُقَدِّسُ لَكَ قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى إِنِّي أَعْلَمُ ما لا تَعْلَمُونَ",
          "فَغَضِبَ عَلَيْهِمْ ثُمَّ سَأَلُوهُ التَّوْبَةَ فَأَمَرَهُمْ أَنْ يَطُوفُوا بِالضُّرَاحِ وَ هُوَ الْبَيْتُ الْمَعْمُورُ وَ مَكَثُوا يَطُوفُونَ بِهِ سَبْعَ سِنِينَ وَ يَسْتَغْفِرُونَ اللَّهَ عَزَّ وَ جَلَّ مِمَّا قَالُوا ",
          "ثُمَّ تَابَ عَلَيْهِمْ مِنْ بَعْدِ ذَلِكَ وَ رَضِيَ عَنْهُمْ فَهَذَا كَانَ أَصْلُ الطَّوَافِ ثُمَّ جَعَلَ اللَّهُ الْبَيْتَ الْحَرَامَ حَذْوَ الضُّرَاحِ تَوْبَةً لِمَنْ أَذْنَبَ مِنْ بَنِي آدَمَ وَ طَهُوراً لَهُمْ فَقَالَ صَدَقْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr and Ibn Mahboub, altogether from Al Mufazzal Bin Salih, from Muhammad Bin Marwan who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘I<sup>asws</sup> was with my<sup>asws</sup> father<sup>asws</sup> at the (Black) Stone. So whilst he<sup>asws</sup> was standing Praying, a man came over to him<sup>asws</sup>, and he sat (near) him<sup>asws</sup>. So when he<sup>asws</sup> finished, he greeted him<sup>asws</sup>, then said, ‘I ask you<sup>asws</sup> about three things, none knows these except you<sup>asws</sup>, and another man’. He<sup>asws</sup> said: ‘What are these?’ ",
            "He said, ‘Inform me, which thing was the cause of the circumambulation of the House (Kaaba)?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic, when He<sup>azwj</sup> Commanded the Angels that they should Prostrate to Adam<sup>saww</sup> they responded to Him<sup>azwj</sup>, so they said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h30\">[2:30]</a> Are You going to Make in it one as shall make mischief therein and shed the blood, and we Glorify with Your Praise and extol Your Holiness?</span> Allah<sup>azwj</sup> Blessed and High said: <span class=\"ibTxt\">He said: I know what you are not knowing</span>. ",
            "Thus, He<sup>azwj</sup> was Angered upon them. Then, they pleaded Him<sup>azwj</sup> for the Forgiveness, so He<sup>azwj</sup> Commanded them that (to attain it) they should be circumambulating by <span class=\"iTxt\">Al-Zurah</span>, and it is the <span class=\"iTxt\">Bayt Al-Mamour</span> (The Oft-Frequented House). And they remained circuambulating by it for seven years, seeking Forgiveness of Allah<sup>azwj</sup> Mighty and Majestic, due to what they had said. ",
            "Then He<sup>azwj</sup> Turned towards them (with Mercy) and was Pleased with them. So this was the origin of the circumambulation. Then Allah<sup>azwj</sup> Made the Sacred House facing <span class=\"iTxt\">Al-Zurah</span>, as (a means of) repentance for the ones from the Children of Adam<sup>as</sup> who sin, and (as a means of) Purificatin for them’. So he said, ‘You<sup>asws</sup> speak the truth’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad ibn abu Nasr and ibn Mahbub all from al-Mufaddal ibn Salih from Muhammad ibn Marwan who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘My father and I were in al-Hijr. When he was standing for prayer, a man came to him and sat down. When he completed his prayer, the man turned to him (the Imam), offered him the greeting of peace and said, ‘I want to ask you three questions which no one except you and another person knows.’ He (the Imam) asked, ‘What are they?’ He said, ‘Tell me what the reason is for Tawaf around this House?’ He (the Imam) replied, ‘When Allah, the Most Majestic, the Most Glorious, commanded the angels to prostrate before Adam, they responded saying, “Will You appoint someone who will destroy it with bloodshed, while we speak of You as free from all defects due to Your praise and holiness?” Allah, most Blessed, most High said, “I know what you do not know.” He expressed anger at them. They asked Him to accept their repentance. He then commanded them to make Tawaf around al-Durrah which is al-Bayt al-Ma £ mur (the established house). They continued doing it for seven years and asked Allah, the Most Majestic, the Most Glorious, for forgiveness because of what they had said. He turned to them, accepted their repentance and expressed happiness with them. This was the origin of Tawaf. Allah thereafter made the sacred House parallel with al-Durrah so that those who commit sin of the children of Adam repent as a means to cleanse themselves.’ He (the man) said, ‘You have spoken the truth.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:2",
  "kind": "verse_list"
}