{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 202"
        },
        "path": "/books/al-kafi:4:3:202",
        "titles": {
          "ar": "بَابُ دُخُولِ الْكَعْبَةِ",
          "en": "Chapter 202 – Entering the Kabah"
        }
      }
    ],
    "index": 1145,
    "local_index": 202,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 203"
        },
        "path": "/books/al-kafi:4:3:203",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ وَدَاعِ الْبَيْتِ</span>",
          "en": "Chapter 203 – Bidding Farewell to the House (Kabah)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 201"
        },
        "path": "/books/al-kafi:4:3:201",
        "titles": {
          "ar": "بَابُ فَضْلِ الصَّلَاةِ فِي الْمَسْجِدِ الْحَرَامِ وَ أَفْضَلِ بُقْعَةٍ فِيهِ",
          "en": "Chapter 201 – The merits of the Salaat in the Sacred Masjid and the most superior spot therein"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:202",
    "titles": {
      "ar": "بَابُ دُخُولِ الْكَعْبَةِ",
      "en": "Chapter 202 – Entering the Kabah"
    },
    "verse_count": 11,
    "verse_start_index": 7950,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/224)"
        ],
        "index": 7951,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ عَلِيِّ بْنِ خَالِدٍ عَمَّنْ حَدَّثَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ أَبِي يَقُولُ الدَّاخِلُ الْكَعْبَةَ يَدْخُلُ وَ اللَّهُ رَاضٍ عَنْهُ وَ يَخْرُجُ عُطُلًا مِنَ الذُّنُوبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Amro Bin Usman, from Ali Bin Khalid, from the one who narrated it, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘My<sup>asws</sup> father<sup>asws</sup> was saying: ‘A number of our companions, from Ahmad Bin Abu Abdullah, from Amro Bin Usman, from Ali Bin Khalid, from the one who narrated it, from Abu Ja’far<sup>asws</sup> having said: ‘My<sup>asws</sup> father<sup>asws</sup> was saying: ‘The one entering the Kabah enters, and Allah<sup>azwj</sup> is Pleased from him, and he returns having been neutralised from the sins’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from ‘Amr ibn ‘Uthman from Ali ibn Khalid from those whom he has mentioned who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘My father would say, ‘One who enters al-Ka‘bah does so while Allah is happy with him and comes out while his sins are suspended.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/225)"
        ],
        "index": 7952,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ الْقَدَّاحِ عَنْ جَعْفَرٍ عَنْ أَبِيهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ دُخُولِ الْكَعْبَةِ قَالَ الدُّخُولُ فِيهَا دُخُولٌ فِي رَحْمَةِ اللَّهِ وَ الْخُرُوجُ مِنْهَا خُرُوجٌ مِنَ الذُّنُوبِ مَعْصُومٌ فِيمَا بَقِيَ مِنْ عُمُرِهِ مَغْفُورٌ لَهُ مَا سَلَفَ مِنْ ذُنُوبِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Yaqoub Bin Yazeed, from Ibn Fazzal, from Ibn Al Qaddah, ",
            "(It has been narrated) from Ja’far<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about entering the Kabah. He<sup>asws</sup> said: ‘The one entering therein enters into the Mercy of Allah<sup>azwj</sup>, and the one exiting from it exits from the sins sinless regarding what remains from his lifetime, having been Forgiven for him whatever was past from his sins’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Ya’qub ibn Yazid from ibn Faddal from ibn al-Qaddah who has said the following: “Ja’far, ‘Alayhi al-Salam, has said, ‘I asked my father, ‘Alayhi al-Salam, about entering al-Ka‘bah. He said, ‘Entering al-Ka‘bah is entering in the mercy of Allah. Coming out of al-Ka‘bah is coming out of sins, and protection in the rest of one’s life and his past sins forgiven.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/225)"
        ],
        "index": 7953,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ وَ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَرَدْتَ دُخُولَ الْكَعْبَةِ فَاغْتَسِلْ قَبْلَ أَنْ تَدْخُلَهَا وَ لَا تَدْخُلْهَا بِحِذَاءٍ وَ تَقُولُ إِذَا دَخَلْتَ اللَّهُمَّ إِنَّكَ قُلْتَ وَ مَنْ دَخَلَهُ كَانَ آمِناً فَآمِنِّي مِنْ عَذَابِ النَّارِ ",
          "ثُمَّ تُصَلِّي رَكْعَتَيْنِ بَيْنَ الْأُسْطُوَانَتَيْنِ عَلَى الرُّخَامَةِ الْحَمْرَاءِ تَقْرَأُ فِي الرَّكْعَةِ الْأُولَى حم السَّجْدَةَ وَ فِي الثَّانِيَةِ عَدَدَ آيَاتِهَا مِنَ الْقُرْآنِ وَ تُصَلِّي فِي زَوَايَاهُ وَ تَقُولُ اللَّهُمَّ مَنْ تَهَيَّأَ أَوْ تَعَبَّأَ أَوْ أَعَدَّ أَوِ اسْتَعَدَّ لِوِفَادَةٍ إِلَى مَخْلُوقٍ رَجَاءَ رِفْدِهِ وَ جَائِزَتِهِ وَ نَوَافِلِهِ وَ فَوَاضِلِهِ فَإِلَيْكَ يَا سَيِّدِي تَهْيِئَتِي وَ تَعْبِئَتِي وَ إِعْدَادِي وَ اسْتِعْدَادِي رَجَاءَ رِفْدِكَ وَ نَوَافِلِكَ وَ جَائِزَتِكَ",
          "فَلَا تُخَيِّبِ الْيَوْمَ رَجَائِي يَا مَنْ لَا يَخِيبُ عَلَيْهِ سَائِلٌ وَ لَا يَنْقُصُهُ نَائِلٌ فَإِنِّي لَمْ آتِكَ الْيَوْمَ بِعَمَلٍ صَالِحٍ قَدَّمْتُهُ وَ لَا شَفَاعَةِ مَخْلُوقٍ رَجَوْتُهُ وَ لَكِنِّي أَتَيْتُكَ مُقِرّاً بِالظُّلْمِ وَ الْإِسَاءَةِ عَلَى نَفْسِي فَإِنَّهُ لَا حُجَّةَ لِي وَ لَا عُذْرَ فَأَسْأَلُكَ يَا مَنْ هُوَ كَذَلِكَ أَنْ تُعْطِيَنِي مَسْأَلَتِي وَ تُقِيلَنِي عَثْرَتِي وَ تَقْبَلَنِي بِرَغْبَتِي وَ لَا تَرُدَّنِي مَجْبُوهاً مَمْنُوعاً وَ لَا خَائِباً يَا عَظِيمُ يَا عَظِيمُ يَا عَظِيمُ أَرْجُوكَ لِلْعَظِيمِ أَسْأَلُكَ يَا عَظِيمُ أَنْ تَغْفِرَ لِيَ الذَّنْبَ الْعَظِيمَ لَا إِلَهَ إِلَّا أَنْتَ ",
          "قَالَ وَ لَا تَدْخُلْهَا بِحِذَاءٍ وَ لَا تَبْزُقْ فِيهَا وَ لَا تَمْتَخِطْ فِيهَا وَ لَمْ يَدْخُلْهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَّا يَوْمَ فَتْحِ مَكَّةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan, and Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you want to enter the Kabah, so wash before you enter it, and do not enter it with shoes, and you should be saying when you enter, ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> Said <span class=\"ibTxt\">[3:97] and whoever enters it shall be secure</span>. So secure me from the Punishment of the Fire’. ",
            "Then you should Pray two Cycles of <span class=\"iTxt\">Salaat</span> between the two pillars upon the red marble slab, reciting in the first Cycle <span class=\"ibTxt\"> [41:1] Ha Meem</span>, the Prostration (Chapter 41), and in the second, a number of its Verses from the Quran, and you should Pray <span class=\"iTxt\">Salaat</span> in its corner and you should be saying, ‘O Allah<sup>azwj</sup>! O Allah<sup>azwj</sup>! (If ever) anyone mobilised, and readied, and prepared, and warmed up for a delegation, hoping of his provision, and his optional (deeds), and seeking its awards and its recompense, so upon You<sup>azwj</sup>, my Master<sup>azwj</sup>, today would be the day of my mobilisation, and my readiness, and my preparation hoping for Your<sup>azwj</sup> Forgiveness, and Your<sup>azwj</sup> Provision, and seeking Your<sup>azwj</sup> Awards and Your<sup>azwj</sup> Recompense.",
            "So (Please) do not Disappoint my hope today. O the One<sup>azwj</sup> Whom a beggar cannot annoy, nor can a receiver diminish, for I did not come to You<sup>azwj</sup> relying upon the righteous deeds which I sent forward, nor hoping for an intercession of any creature, but I come to You<sup>azwj</sup> acknowledging (my) injustice, and the evil wrought upon myself, for there is no argument for me<sup>asws</sup> nor any excuse. Therefore, I beseech/ plead You<sup>azwj</sup>, the One Who is like that, that You<sup>azwj</sup> May Grant me what I ask for, and Erase my slips, and Accept me for the hopes (I have), and do not Repel me as rejected, denied, nor disappointed. O the Greatest One! O the Greatest One! O the Greatest One! I (have come with a) hope to You<sup>azwj</sup> for the Greatness. I ask You<sup>azwj</sup>, O the Greatest One, that You<sup>azwj</sup> Forgive for me the grievous sins (I have committed). There is no god except for You<sup>azwj</sup>’. ",
            "He<sup>asws</sup> said: ‘And do not enter it with the shoes, nor spit in it, nor throw any mucus in it. And, Rasool-Allah<sup>saww</sup> did not enter it except on the day of the conquest of Makkah’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr and Muhammad ibn Isma’il from al-Fadl ibn Shadhan from Safwan and ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when you decide to enter al-Ka‘bah, take a shower before entering and do not enter with shoes. When you are inside say, ‘O Allah, You have said, “Those who enter it have immunity,” thus, grant me protection against the torment of the fire.’ Thereafter perform two Rak‘at salat (prayer) between the two pillars on the red marble. In the first Rak‘at read Ha Mim al-Sajdah and in the second Rak‘at read an equal number of verses to this Chapter from the Holy Quran. Perform salat (prayer) in the corners and say, ‘O Allah, people become ready, supply themselves, prepare, organize and plan to meet a creature in the hope to receive kindness, reward, favors and extra generosity. I however, my Master, have made ready, supplied myself, organized, and planned in the hope to receive Your kindness, favors and rewards. Do not allow my hopes to fail. You are the One who does not allow the hopes of those who ask help to fail. You are the One whose favors do not diminish. I have not come to You today with good deeds that I may have done. I do not have any hope in any creature to intercede for me before You. However, I have come to You with my confession to my injustice that I have done to myself and wickedness that I have committed against myself. I have no argument or good reason. I appeal before You, O the One who has such a position to grant my wishes, straighten my slips and accept me with my interests and do not turn me back, rejected, denied and failed. O Great, O Great, O Great, I have this great hope. I appeal before You, O Great, to forgive my great sins. No one other than You deserves worship.’ He (the Imam) said, ‘You must not enter with shoes, you must not spit in it or drop mucus. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, entered only once on the day of victory.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/226)"
        ],
        "index": 7954,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ ذَكَرْتُ الصَّلَاةَ فِي الْكَعْبَةِ قَالَ بَيْنَ الْعَمُودَيْنِ تَقُومُ عَلَى الْبَلَاطَةِ الْحَمْرَاءِ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) صَلَّى عَلَيْهَا ثُمَّ أَقْبَلَ عَلَى أَرْكَانِ الْبَيْتِ وَ كَبَّرَ إِلَى كُلِّ رُكْنٍ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bi Al Hakam, from Al Husayn Bin Abu Al Bala’a who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> and mentioned the <span class=\"iTxt\">Salaat</span> in the Kabah. He<sup>asws</sup> said: ‘Between the two pillars. You should stand upon the red marble slab, for Rasool-Allah<sup>saww</sup> Prayed <span class=\"iTxt\">Salaat</span> upon it, then turned towards the corners of the House (Kabah) and exclaimed <span class=\"iTxt\">Takbeer </span>towards each corner from it’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-Husayn ibn abu al-‘Ala’ who has said the following: “I once spoke to abu ‘Abd Allah, ‘Alayhi al-Salam, about performing salat (prayer) inside al-Ka‘bah. He (the Imam) said, ‘Perform salat (prayer) between the two pillars on the red marble; the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed salat (prayer) there. Thereafter go to the corners of the House and say Takhir (Allah is great beyond description) in every corner.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/226)"
        ],
        "index": 7955,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:5",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ رَأَيْتُ الْعَبْدَ الصَّالِحَ ( عليه السلام ) دَخَلَ الْكَعْبَةَ فَصَلَّى رَكْعَتَيْنِ عَلَى الرُّخَامَةِ الْحَمْرَاءِ ثُمَّ قَامَ فَاسْتَقْبَلَ الْحَائِطَ بَيْنَ الرُّكْنِ الْيَمَانِيِّ وَ الْغَرْبِيِّ فَوَقَعَ يَدُهُ عَلَيْهِ وَ لَزِقَ بِهِ وَ دَعَا ثُمَّ تَحَوَّلَ إِلَى الرُّكْنِ الْيَمَانِيِّ فَلَصِقَ بِهِ وَ دَعَا ثُمَّ أَتَى الرُّكْنَ الْغَرْبِيَّ ثُمَّ خَرَجَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Muawiya Bin Ammar who said, ",
            "‘I saw Al-Abd Al-Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) enter the Kabah. So he<sup>asws</sup> Prayed two Cycles of <span class=\"iTxt\">Salaat</span> upon the red marble slab. Then he<sup>asws</sup> stood and faced the wall between Al-Yamani corner and Al-Gharby. So he<sup>asws</sup> placed his<sup>asws</sup> hand upon it, and adhere with it, and supplicated. Then he<sup>asws</sup> transferred to Al-Yamani corner, so he<sup>asws</sup> adhered with it and supplicated. Then he<sup>asws</sup> went to Al-Gharby corner, then went out’."
          ],
          "en.sarwar": [
            "5. Ahmad ibn Muhammad has narrated from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from Mu‘awiyah ibn ‘Ammar who has said the following: “I saw (Allah’s) virtuous servant, ‘Alayhi al-Salam, enter al-Ka‘bah and perform two Rak‘at Salat (prayer) on the red marble, then stand up and face the wall between al-Yemaniy and western corners. He (the Imam) placed his hand on it and wiped and prayed, then turned to al-Yemaniy corner, touched it and prayed, then he (the Imam) came to the western corner and went out.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/226)"
        ],
        "index": 7956,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:6",
        "text": [
          "وَ عَنْهُ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَعِيدٍ الْأَعْرَجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا بُدَّ لِلصَّرُورَةِ أَنْ يَدْخُلَ الْبَيْتَ قَبْلَ أَنْ يَرْجِعَ فَإِذَا دَخَلْتَهُ فَادْخُلْهُ بِسَكِينَةٍ وَ وَقَارٍ ثُمَّ ائْتِ كُلَّ زَاوِيَةٍ مِنْ زَوَايَاهُ ثُمَّ قُلِ اللَّهُمَّ إِنَّكَ قُلْتَ وَ مَنْ دَخَلَهُ كَانَ آمِناً فَآمِنِّي مِنْ عَذَابِ يَوْمِ الْقِيَامَةِ وَ صَلِّ بَيْنَ الْعَمُودَيْنِ اللَّذَيْنِ يَلِيَانِ عَلَى الرُّخَامَةِ الْحَمْرَاءِ وَ إِنْ كَثُرَ النَّاسُ فَاسْتَقْبِلْ كُلَّ زَاوِيَةٍ فِي مَقَامِكَ حَيْثُ صَلَّيْتَ وَ ادْعُ اللَّهَ وَ اسْأَلْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ali Bin Al Numan, from Saeed Al A’araj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is a must for ‘Al-Sarura’ (the first-timer) that he enters the House (Kabah) before he returns. So when he enters, so he should enter with tranquillity and dignity. Then he should go to every corner from the corners, then say, ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> Said <span class=\"ibTxt\">[3:97] and whoever enters it shall be secure</span>, so Secure me from the Punishment of the Day of Judgement’; and offer <span class=\"iTxt\">Salaat</span> between the two Pillars which follow from the red marble slab; and if the people are numerous, so face each corner from your place where you Prayed <span class=\"iTxt\">Salaat</span>, and supplicate to Allah<sup>azwj</sup>, and ask Him<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "6. It is narrated from him (narrator of previous Hadith) from Ali ibn al-Nu’man from Sa‘id al-A’raj who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘Al-Sarura (one who performs Hajj for the first time) must enter the House before his return. When you enter it, you should do so with calmness and dignity; then go to each corner and say, “O Lord, You have said, ‘Whoever enters it receives amnesty’, so grant me amnesty against suffering on the Day of Judgment”, and perform Salat (prayer) between the two pillars near the red marble. If there are many people, then face each corner from your place where you perform Salat (prayer), pray and appeal before Allah for your needs.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/227)"
        ],
        "index": 7957,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:7",
        "text": [
          "وَ عَنْهُ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ هُوَ خَارِجٌ مِنَ الْكَعْبَةِ وَ هُوَ يَقُولُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ حَتَّى قَالَهَا ثَلَاثاً ثُمَّ قَالَ اللَّهُمَّ لَا تُجْهِدْ بَلَاءَنَا رَبَّنَا وَ لَا تُشْمِتْ بِنَا أَعْدَاءَنَا فَإِنَّكَ أَنْتَ الضَّارُّ النَّافِعُ ثُمَّ هَبَطَ فَصَلَّى إِلَى جَانِبِ الدَّرَجَةِ جَعَلَ الدَّرَجَةَ عَنْ يَسَارِهِ مُسْتَقْبِلَ الْكَعْبَةِ لَيْسَ بَيْنَهَا وَ بَيْنَهُ أَحَدٌ ثُمَّ خَرَجَ إِلَى مَنْزِلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Abdullah Bin Sinan who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> and he<sup>asws</sup> was exiting from the Kabah, and he<sup>asws</sup> was saying: ‘Allah<sup>azwj</sup> is the Greatest (beyond description)! Allah<sup>azwj</sup> is the Greatest (beyond description)!’, until he<sup>asws</sup> had said it three times. Then, he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Do not Overload our<sup>asws</sup> afflictions! O Lord<sup>azwj</sup>, and do not let our<sup>asws</sup> enemies gloat with us<sup>asws</sup>, no harm and benefits can occur (except) with Your<sup>azwj</sup> Permission’. Then he<sup>asws</sup> climbed down, so he<sup>asws</sup> Prayed <span class=\"iTxt\">Salaat</span> to the side of the stairs, making the stairs to be on his<sup>asws</sup> left, facing the Kabah, there not being anyone between him<sup>asws</sup> and it. Then he<sup>asws</sup> went out to his<sup>asws</sup> house’."
          ],
          "en.sarwar": [
            "7. It is narrated from him (narrator of previous Hadith) from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from ‘Abd Allah ibn Sinan who has said the following: “I once heard Abu `Abd Allah, ‘Alayhi al-Salam, say, when coming out of al-Ka £ bah, ‘Allah is great beyond description. Allah is great beyond description.’ He (the Imam) said it three times; then said, “ 0 Lord, do not make our trial stressful, O Lord, do not make our enemies rejoice at our failure because You can cause harm and grant benefits.’ He (the Imam) then climbed down, performed Salat (prayer) next to the stairs keeping it on his left, facing al-Qiblah (al-Ka‘bah) and there was no one between him and al-Ka‘bah. Then he (the Imam) left for his lodging.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/227)"
        ],
        "index": 7958,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:8",
        "text": [
          "وَ عَنْهُ عَنْ إِسْمَاعِيلَ بْنِ هَمَّامٍ قَالَ قَالَ أَبُو الْحَسَنِ ( عليه السلام ) دَخَلَ النَّبِيُّ ( صلى الله عليه وآله ) الْكَعْبَةَ فَصَلَّى فِي زَوَايَاهَا الْأَرْبَعِ صَلَّى فِي كُلِّ زَاوِيَةٍ رَكْعَتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ismail Bin Hammam who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> said: ‘The Prophet<sup>saww</sup> entered the Kabah, so he<sup>saww</sup> Prayed <span class=\"iTxt\">Salaat</span> in its four corners, Praying two Cycles in each corner’."
          ],
          "en.sarwar": [
            "8. It is narrated from him (narrator of previous Hadith) from ‘Isma‘il ibn Hammam who has said the following: “Abu al-Hassan, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, entered al-Ka‘bah and performed Salat (prayer) in all of its four corners two Rak‘at in each.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/227)"
        ],
        "index": 7959,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:9",
        "text": [
          "وَ عَنْهُ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ رَأَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) قَدْ دَخَلَ الْكَعْبَةَ ثُمَّ أَرَادَ بَيْنَ الْعَمُودَيْنِ فَلَمْ يَقْدِرْ عَلَيْهِ فَصَلَّى دُونَهُ ثُمَّ خَرَجَ فَمَضَى حَتَّى خَرَجَ مِنَ الْمَسْجِدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from hi, from Ibn Fazzal, from Yunus Bin Yaqoub who said, ",
            "‘I saw Abu Abdullah<sup>asws</sup> entering the Kabah, then intended to be between the two pillars, but was not able upon doing so, so he<sup>asws</sup> Prayed <span class=\"iTxt\">Salaat</span> besides it. Then he<sup>asws</sup> exited, so he<sup>asws</sup> went until he had gone out from the Masjid’."
          ],
          "en.sarwar": [
            "9. It is narrated from him (narrator of previous Hadith) from ibn Faddal from Yunus ibn Ya’qub who has said the following: “I saw abu ‘Abd Allah, ‘Alayhi al-Salam, enter al-Ka‘bah and he (the Imam) wanted between the two pillars; but could not get there, he (the Imam) then performed Salat (prayer) nearby, then went out and continued walking until he left the Masjid.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/227)"
        ],
        "index": 7960,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:10",
        "text": [
          "وَ عَنْهُ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذَا دَخَلْتُ الْكَعْبَةَ كَيْفَ أَصْنَعُ قَالَ خُذْ بِحَلْقَتَيِ الْبَابِ إِذَا دَخَلْتَ ثُمَّ امْضِ حَتَّى تَأْتِيَ الْعَمُودَيْنِ فَصَلِّ عَلَى الرُّخَامَةِ الْحَمْرَاءِ ثُمَّ إِذَا خَرَجْتَ مِنَ الْبَيْتِ فَنَزَلْتَ مِنَ الدَّرَجَةِ فَصَلِّ عَنْ يَمِينِكَ رَكْعَتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ibn Fazzal, from Yunus who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘When I enter the Kabah, so what should I do?’ He<sup>asws</sup> said: ‘Grab hold of the two rings of the (Door of the Kabah) when you enter, then go until you come to the two Pillars, so offer <span class=\"iTxt\">Salaat</span> upon the red marble. Then, when you exit from the House (Kabah), so climb down from the stairs, and perform <span class=\"iTxt\">Salaat</span> on your right, by two Cycles’."
          ],
          "en.sarwar": [
            "10. It is narrated from him (narrator of previous Hadith) from ibn Faddal from Yunus who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘What should I do when I enter al-Ka‘bah? He (the Imam) said, ‘When entering hold the two rings of the door, then move forward until you reach the two pillars, then perform Salat (prayer) on the red marble. When you leave the House and climb down, perform two Rak‘at Salat (prayer) on your right side.’” (Fatwa best explains Hadith 5-10 of this Chapter) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/227)"
        ],
        "index": 7961,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:202:11",
        "text": [
          "وَ عَنْهُ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ فِي دُعَاءِ الْوَلَدِ قَالَ أَفِضْ عَلَيْكَ دَلْواً مِنْ مَاءِ زَمْزَمَ ثُمَّ ادْخُلِ الْبَيْتَ فَإِذَا قُمْتَ عَلَى بَابِ الْبَيْتِ فَخُذْ بِحَلْقَةِ الْبَابِ ثُمَّ قُلِ اللَّهُمَّ إِنَّ الْبَيْتَ بَيْتُكَ وَ الْعَبْدَ عَبْدُكَ وَ قَدْ قُلْتَ وَ مَنْ دَخَلَهُ كَانَ آمِناً فَآمِنِّي مِنْ عَذَابِكَ وَ أَجِرْنِي مِنْ سَخَطِكَ ",
          "ثُمَّ ادْخُلِ الْبَيْتَ فَصَلِّ عَلَى الرُّخَامَةِ الْحَمْرَاءِ رَكْعَتَيْنِ ثُمَّ قُمْ إِلَى الْأُسْطُوَانَةِ الَّتِي بِحِذَاءِ الْحَجَرِ وَ أَلْصِقْ بِهَا صَدْرَكَ ثُمَّ قُلْ يَا وَاحِدُ يَا أَحَدُ يَا مَاجِدُ يَا قَرِيبُ يَا بَعِيدُ يَا عَزِيزُ يَا حَكِيمُ لَا تَذَرْنِي فَرْداً وَ أَنْتَ خَيْرُ الْوَارِثِينَ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ ",
          "ثُمَّ دُرْ بِالْأُسْطُوَانَةِ فَأَلْصِقْ بِهَا ظَهْرَكَ وَ بَطْنَكَ وَ تَدْعُو بِهَذَا الدُّعَاءِ فَإِنْ يُرِدِ اللَّهُ شَيْئاً كَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Safwan Bin Yahya, from Muawiya Bin Ammar, ",
            "‘Regarding a supplication for the child, he<sup>asws</sup> said: ‘Pour upon yourself a cup from the water of Zamzam, then enter the House (Kabah). So when you stand upon the Door of the Kabah, so grab a ring of the Door, then say, ‘O Allah<sup>azwj</sup>! The House is Your<sup>azwj</sup> House, and the servant is Your<sup>azwj</sup> servant, and You<sup>azwj</sup> have Said <span class=\"ibTxt\">[3:97] and whoever enters it shall be secure</span>, therefore Secure me from Your<sup>azwj</sup> Punishment, and Resuce me from Your<sup>azwj</sup> Wrath’. ",
            "Then enter the House (Kabah), so perform <span class=\"iTxt\">Salaat</span> upon the red marble slab. Then arise to go to the Pillar which is parallel to the (Black) Stone, and adhere your chest with it, then say, ‘O the Alone! O the One! O the Glorious! O the Near One! O the Remote One! O the Mighty! O the Wise! <span class=\"ibTxt\">[21:89] Lord! Do not leave me alone; and You are the Best of inheritors</span>, Endow to me, from You<sup>azwj</sup>, a goodly offspring. You<sup>azwj</sup> are the Hearer of the supplications’. ",
            "Then circle by the Pillars, and adhere your back with it, and your belly, and supplicate with this supplication. So if Allah<sup>azwj</sup> Wants something, it would happen’."
          ],
          "en.sarwar": [
            "11. Ahmad ibn Muhammad has narrated from Safwan ibn Yahya from Mu‘awiyah ibn ‘Ammar about prayer for children in a mawquf manner the following: “He (the Imam) has said, Tour on yourself a bucket of water from Zamzam, then enter the House. When you are at the door of the House, hold to the ring of the door and say, “O Allah, the House is Your house, the servant is Your servant and You have said, ‘Whoever enters it is safe/ so grant me immunity against Your torment and grant me refuge against Your anger.” Thereafter enter the house and perform two Rak‘at salat (prayer) on the red marble. Go to the pillar next to the Black Stone, place your chest against it and say, “O the One, the Only One, O Glorious, O Near, O Far, O Majestic, O Wise, do not leave me alone. You are the best heir. Grant me virtuous children; You listen to appeals.” Go around the pillar, place your back, belly against it, and say the prayer mentioned above again. If Allah wills something, it happens/” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:202",
  "kind": "verse_list"
}