{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 21"}, "path": "/books/al-kafi:4:3:21", "titles": {"ar": "بَابُ صَيْدِ الْحَرَمِ وَ مَا تَجِبُ فِيهِ الْكَفَّارَةُ", "en": "Chapter 21 – Hunt of the Al-Harram and what expiation is Obligated with regards to it"}}], "index": 964, "local_index": 21, "part_type": "Chapter", "path": "/books/al-kafi:4:3:21", "titles": {"ar": "بَابُ صَيْدِ الْحَرَمِ وَ مَا تَجِبُ فِيهِ الْكَفَّارَةُ", "en": "Chapter 21 – Hunt of the Al-Harram and what expiation is Obligated with regards to it"}, "verse_count": 30, "verse_start_index": 6762, "verses": [{"index": 6763, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا كُنْتَ حَلَالًا فَقَتَلْتَ الصَّيْدَ فِي الْحِلِّ مَا بَيْنَ الْبَرِيدِ إِلَى الْحَرَمِ فَعَلَيْكَ جَزَاؤُهُ فَإِنْ فَقَأْتَ عَيْنَهُ أَوْ كَسَرْتَ قَرْنَهُ أَوْ جَرَحْتَهُ تَصَدَّقْتَ بِصَدَقَةٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you were free (not in Ihram), so you kill the hunt during the free mode, what is between Al-Bareyd (a measurement of distance) up to the Al-Harram, so upon you would be its compensation. So if you were to blind its eyes, or break its horn, or you injure it, so give in charity’."}]}, {"index": 6764, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:2", "text": "عَلِيٌّ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ أُهْدِيَ لَهُ حَمَامٌ أَهْلِيٌّ وَ هُوَ فِي الْحَرَمِ فَقَالَ إِنْ هُوَ أَصَابَ مِنْهُ شَيْئاً فَلْيَتَصَدَّقْ بِثَمَنِهِ نَحْواً مِمَّا كَانَ يَسْوَى فِي الْقِيمَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who was gifted a domesticated dove and he was inside the Al-Harram. So he<sup>asws</sup> said: ‘If he hurts anything from it, so let him give in charity with its price approximating from what it would have been (before the injury etc.), equal in the price’."}]}, {"index": 6765, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُثَنَّى بْنِ عَبْدِ السَّلَامِ عَنْ مُحَمَّدِ بْنِ أَبِي الْحَكَمِ قَالَ قُلْتُ لِغُلَامٍ لَنَا هَيِّئْ لَنَا غَدَاءً فَأَخَذَ أَطْيَاراً مِنَ الْحَرَمِ فَذَبَحَهَا وَ طَبَخَهَا فَأَخْبَرْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ ادْفِنْهَا وَ افْدِ كُلَّ طَائِرٍ مِنْهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Musna Bin Abdul Salaam, from Muhammad Bin Abu Al Hakam who said, \n‘I said to a slave of ours, ‘Hurry the lunch for us’. So he took birds from the Al-Harram, slaughtered them, and cooked them. So I informed Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> said: ‘Bury these, and pay the expiation of every bird from these’."}]}, {"index": 6766, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنِ الصَّيْدِ يُصَادُ فِي الْحِلِّ ثُمَّ يُجَاءُ بِهِ إِلَى الْحَرَمِ وَ هُوَ حَيٌّ فَقَالَ إِذَا أَدْخَلَهُ إِلَى الْحَرَمِ حَرُمَ عَلَيْهِ أَكْلُهُ وَ إِمْسَاكُهُ فَلَا تَشْتَرِيَنَّ فِي الْحَرَمِ إِلَّا مَذْبُوحاً ذُبِحَ فِي الْحِلِّ ثُمَّ جِي‏ءَ بِهِ إِلَى الْحَرَمِ مَذْبُوحاً فَلَا بَأْسَ لِلْحَلَالِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Abu Umeyr, from Hammad, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having been asked about the hunting hunted in the unrestricted area, then he comes over to the Al-Harram and it is (still) alive. So he<sup>asws</sup> said: ‘When he entered it into the Al-Harram it is prohibited upon him to eat it, and keeping it. Therefore, you should not be buying inside the Al-Harram except the slaughter which has been slaughtered in the unrestricted area, then it has been brought into the Al-Harram, so there would be no problem with the Permissible (animals)’."}]}, {"index": 6767, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:5", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ أَنَّ الْحَكَمَ سَأَلَ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ أُهْدِيَ لَهُ حَمَامَةٌ فِي الْحَرَمِ مَقْصُوصَةٌ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) انْتِفْهَا وَ أَحْسِنْ إِلَيْهَا وَ اعْلِفْهَا حَتَّى إِذَا اسْتَوَى رِيشُهَا فَخَلِّ سَبِيلَهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Hammad Bin Isa, from Hareyz, from Zurara that, \n‘Al-Hakam asked Abu Ja’far<sup>asws</sup> about a man who was gifted a clipped dove inside the Al-Harram. So Abu Ja’far<sup>asws</sup> said: ‘Take it and be good to it, and look after it until when its feathers are complete (grown back), so free its way’."}]}, {"index": 6768, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:6", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ مُثَنَّى بْنِ عَبْدِ السَّلَامِ عَنْ كَرِبٍ الصَّيْرَفِيِّ قَالَ كُنَّا جَمَاعَةً فَاشْتَرَيْنَا طَيْراً فَقَصَصْنَاهُ وَ دَخَلْنَا بِهِ مَكَّةَ فَعَابَ ذَلِكَ عَلَيْنَا أَهْلُ مَكَّةَ فَأَرْسَلَ كَرِبٌ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلَهُ فَقَالَ اسْتَوْدِعُوهُ رَجُلًا مِنْ أَهْلِ مَكَّةَ مُسْلِماً أَوِ امْرَأَةً مُسْلِمَةً فَإِذَا اسْتَوَى خَلَّوْا سَبِيلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Mansour Bin hazim, from Musna Bin Abdul Salam, from Karb Al Sayrafi who said, \n‘We were a group who bought a bird, so we clipped it and entered Makkah with it. So the people of Makkah faulted that upon us. So Karb sent a message to Abu Abdullah<sup>asws</sup> asking him<sup>asws</sup>, so he<sup>asws</sup> said: ‘Entrust it to a Muslim man from the people of Makkah, or a Muslim woman. So when it is straight (wings grown back), free its way’."}]}, {"index": 6769, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:7", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ مَنْ أَصَابَ طَيْراً فِي الْحَرَمِ وَ هُوَ مُحِلٌّ فَعَلَيْهِ الْقِيمَةُ وَ الْقِيمَةُ دِرْهَمٌ يَشْتَرِي بِهِ عَلَفاً لِحَمَامِ الْحَرَمِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Safwan Bin Yahya, \n(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘The one who hits a bird inside the Al-Harram and he is free (not in Ihram), so upon him is the price, and the price is one Dirham. He buys feed with it for the doves of the Al-Harram’."}]}, {"index": 6770, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:8", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ خَلَّادٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي رَجُلٍ ذَبَحَ حَمَامَةً مِنْ حَمَامِ الْحَرَمِ قَالَ عَلَيْهِ الْفِدَاءُ قُلْتُ فَيَأْكُلُهُ قَالَ لَا قُلْتُ فَيَطْرَحُهُ قَالَ إِذاً يَكُونُ عَلَيْهِ فِدَاءٌ آخَرُ قُلْتُ فَمَا يَصْنَعُ بِهِ قَالَ يَدْفِنُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Khallad, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding a man who slaughtered a dove from the doves of the Al-Harram. He<sup>asws</sup> said: ‘Upon him is the expiation’. I said, ‘So can he eat it?’ He<sup>asws</sup> said: ‘No?’ I said, ‘Can he throw it away?’ He<sup>asws</sup> said: ‘Then there would happen to be another expiation upon him’. I said, ‘So what should he do with it?’ He<sup>asws</sup> said: ‘He should bury it’."}]}, {"index": 6771, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:9", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ مُثَنًّى الْحَنَّاطِ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ خَرَجَ بِطَيْرٍ مِنْ مَكَّةَ إِلَى الْكُوفَةِ قَالَ يَرُدُّهُ إِلَى مَكَّةَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Musna Al Hannat, from Zurara, \n(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who went out with a bird, from Makkah to Al-Kufa. He<sup>asws</sup> said: ‘He should return it to Makkah’."}]}, {"index": 6772, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:10", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي الْحَمَامَةِ دِرْهَمٌ وَ فِي الْفَرْخِ نِصْفُ دِرْهَمٍ وَ فِي الْبَيْضَةِ رُبُعُ دِرْهَمٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al fazl Bin Shazaan, altogether, from Ibn Abu Umeyr, from Hafs Bin Nakhtary, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Regarding the dove, one Dirham, and regarding the fledgling, half a Dirham, and regarding the egg, a quarter of a Dirham (as a compensation)’."}]}, {"index": 6773, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:11", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنِ ابْنِ بُكَيْرٍ قَالَ سَأَلْتُ أَحَدَهُمَا ( عليهما السلام ) عَنْ رَجُلٍ أَصَابَ طَيْراً فِي الْحِلِّ فَاشْتَرَاهُ فَأَدْخَلَهُ الْحَرَمَ فَمَاتَ فَقَالَ إِنْ كَانَ حِينَ أَدْخَلَهُ الْحَرَمَ خَلَّى سَبِيلَهُ فَمَاتَ فَلَا شَيْ‏ءَ عَلَيْهِ وَ إِنْ كَانَ أَمْسَكَهُ حَتَّى مَاتَ عِنْدَهُ فِي الْحَرَمِ فَعَلَيْهِ الْفِدَاءُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from sahl Bin Ziyad, from Ibn Mahboub, from Ibn Raib, from Ibn Bukeyr who said, \n‘I asked one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) about a man who came across a bird in the unrestricted area. She bought it and entered with it into the Al-Harram, and it died. So he<sup>asws</sup> said: ‘If it was such that when he entered it into the Al-Harram, freed its way, so it died, then there is nothing upon him; and if it was such that he withheld it until it died with him inside the Al-Harram, so upon him is the expiation’."}]}, {"index": 6774, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:12", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ رَجُلٍ رَمَى صَيْداً فِي الْحِلِّ فَمَضَى بِرَمْيَتِهِ حَتَّى دَخَلَ الْحَرَمَ فَمَاتَ أَ عَلَيْهِ جَزَاؤُهُ قَالَ لَا لَيْسَ عَلَيْهِ جَزَاؤُهُ لِأَنَّهُ رَمَى حَيْثُ رَمَى وَ هُوَ لَهُ حَلَالٌ إِنَّمَا مَثَلُ ذَلِكَ مَثَلُ رَجُلٍ نَصَبَ شَرَكاً فِي الْحِلِّ إِلَى جَانِبِ الْحَرَمِ فَوَقَعَ فِيهِ صَيْدٌ فَاضْطَرَبَ الصَّيْدُ حَتَّى دَخَلَ الْحَرَمَ فَلَيْسَ عَلَيْهِ جَزَاؤُهُ لِأَنَّهُ كَانَ بَعْدَ ذَلِكَ شَيْ‏ءٌ \nفَقُلْتُ هَذَا الْقِيَاسُ عِنْدَ النَّاسِ فَقَالَ إِنَّمَا شَبَّهْتُ لَكَ شَيْئاً بِشَيْ‏ءٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Al Jabbar, from Safwan Bin Yahya, from Abdul Rahman Bin Al Hajjaj who said, \n‘I asked Abu Al-Hassan<sup>asws</sup> about a man who pelted (stoned) a prey in the unrestricted area. So it went, due to his pelting, until it entered the Al-Harram, and it died. Is there its compensation upon him?’ He<sup>asws</sup> said: ‘No, there is no compensation upon him, because he pelted where he pelted, and it was Permissible for him. But rather, the example of that is the example of a man who established a snare in the unrestricted are to the side of the Al-Harram. So a prey falls into it, and the prey wavers until it enters the Al-Harram. Thus, there is no compensation for it upon him, because it was a thing (which happened) afterwards’. \nSo I said, ‘This is the analogy in the presence of the people’. So he<sup>asws</sup> said: ‘But rather, I<sup>asws</sup> compared for you, a thing with a thing’."}]}, {"index": 6775, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:13", "text": "صَفْوَانُ بْنُ يَحْيَى عَنْ زِيَادٍ أَبِي الْحَسَنِ الْوَاسِطِيِّ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْمٍ قَفَّلُوا عَلَى طَائِرٍ مِنْ حَمَامِ الْحَرَمِ الْبَابَ فَمَاتَ قَالَ عَلَيْهِمْ بِقِيمَةِ كُلِّ طَيْرٍ [نِصْفُ] دِرْهَمٍ يُعْلَفُ بِهِ حَمَامُ الْحَرَمِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Safwan Bin yahya, from Ziyad Abu Al Hassan Al Wasity, \n(It has been narrated) from Abu Ibrahim<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a group locked the door upon birds from the doves of the Al-Harram, so they died. He<sup>asws</sup> said: ‘Upon them is the price of each bird, half a Dirham, feeding by it the doves of the Al-Harram’."}]}, {"index": 6776, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:14", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ حَلَّ فِي الْحَرَمِ رَمَى صَيْداً خَارِجاً مِنَ الْحَرَمِ فَقَتَلَهُ قَالَ عَلَيْهِ الْجَزَاءُ لِأَنَّ الْآفَةَ جَاءَتْهُ مِنْ قِبَلِ الْحَرَمِ \nقَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ رَمَى صَيْداً خَارِجاً مِنَ الْحَرَمِ فِي الْحِلِّ فَتَحَامَلَ الصَّيْدُ حَتَّى دَخَلَ الْحَرَمَ فَقَالَ لَحْمُهُ حَرَامٌ مِثْلُ الْمَيْتَةِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziiyad, and Ali Bin Ibrahim, from his father, altogether, from Ibn Mahboub, from Ibn Raib, from Misma’a Bin Abdul Malik, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man, not in Ihram, being inside the Al-Harram, pelts a prey outside from the Al-Harram, so he kills it. He<sup>asws</sup> said: ‘Upon him is the compensation, because the injury came to it from the Al-Harram’. \nHe (the narrator) said, ‘And I asked him<sup>asws</sup> about a man who pelted a prey outside from the Al-Harram in the unrestricted area. So the prey survives until it enters the Al-Harram. So he<sup>asws</sup> said: ‘Its flesh is prohibited like the dead’."}]}, {"index": 6777, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:15", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ فِي حَمَامِ مَكَّةَ الطَّيْرُ الْأَهْلِيُّ غَيْرُ حَمَامِ الْحَرَمِ مَنْ ذَبَحَ طَيْراً مِنْهُ وَ هُوَ غَيْرُ مُحْرِمٍ فَعَلَيْهِ أَنْ يَتَصَدَّقَ بِصَدَقَةٍ أَفْضَلَ مِنْ ثَمَنِهِ فَإِنْ كَانَ مُحْرِماً فَشَاةٌ عَنْ كُلِّ طَيْرٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Abdullah Bin Sinan, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying regarding the domesticated birds of Makkah, apart from the doves of the Al-Harram: ‘The one who slaughters a bird from it, and he was not in Ihram, so upon him is that he gives in charity more than its price. So if he was in Ihram, so a sheep, for each bird’."}]}, {"index": 6778, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:16", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ أَرْسَلْتُ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) أَنَّ أَخاً لِي اشْتَرَى حَمَاماً مِنَ الْمَدِينَةِ فَذَهَبْنَا بِهَا إِلَى مَكَّةَ فَاعْتَمَرْنَا وَ أَقَمْنَا إِلَى الْحَجِّ ثُمَّ أَخْرَجْنَا الْحَمَامَ مَعَنَا مِنْ مَكَّةَ إِلَى الْكُوفَةِ فَعَلَيْنَا فِي ذَلِكَ شَيْ‏ءٌ قَالَ لِلرَّسُولِ إِنِّي أَظُنُّهُنَّ كُنَّ فُرْهَةً قَالَ لَهُ يَذْبَحُ مَكَانَ كُلِّ طَيْرٍ شَاةً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ibn Fazzal, from Yunus Bin Yaqoub who said, \n‘I sent a message to Abu Al-Hassan<sup>asws</sup> that a brother of mine had bought doves from Al-Medina, so we went with it to Makkah. So we performed Umra and we stayed up to the Hajj. Then we brought out the doves along with us, from Makkah to Al-Kufa. So is there anything upon us with regards to that?’ He<sup>asws</sup> said to the messenger: ‘I<sup>asws</sup> thing they were delightful. They should slaughter a sheep in place of each bird’."}]}, {"index": 6779, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:17", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنْ إِبْرَاهِيمَ بْنِ مَيْمُونٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ نَتَفَ حَمَامَةً مِنْ حَمَامِ الْحَرَمِ قَالَ يَتَصَدَّقُ بِصَدَقَةٍ عَلَى مِسْكِينٍ وَ يُعْطِي بِالْيَدِ الَّتِي نَتَفَ بِهَا فَإِنَّهُ قَدْ أَوْجَعَهُ.", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Ibn Muskan, from Ibrahim Bin Maymoun who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘A man grasped a dove from the doves of the Al-Harram. He<sup>asws</sup> said: ‘He should give in charity upon the poor, and he should give with the very hand which he caught it with, for it is what had pained it’."}]}, {"index": 6780, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:18", "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أُهْدِيَ لَنَا طَائِرٌ مَذْبُوحٌ بِمَكَّةَ فَأَكَلَهُ أَهْلُنَا فَقَالَ لَا يَرَى بِهِ أَهْلُ مَكَّةَ بَأْساً قُلْتُ فَأَيُّ شَيْ‏ءٍ تَقُولُ أَنْتَ قَالَ عَلَيْهِمْ ثَمَنُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan Bin yahya, from Mansour Bin Hazim who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘A slaughtered bird was gifted to us in Makkah, so our families ate it’. So he<sup>asws</sup> said: ‘The people of Makkah do not see any problem with it’. I said, ‘So which thing are you<sup>asws</sup> saying: ‘He<sup>asws</sup> said: ‘Upon them is its price (penalty)’."}]}, {"index": 6781, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:19", "text": "بَعْضُ أَصْحَابِنَا عَنْ أَبِي جَرِيرٍ الْقُمِّيِّ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) نَشْتَرِي الصُّقُورَ فَنُدْخِلُهَا الْحَرَمَ فَلَنَا ذَلِكَ فَقَالَ كُلُّ مَا أُدْخِلَ الْحَرَمَ مِنَ الطَّيْرِ مِمَّا يَصُفُّ جَنَاحَهُ فَقَدْ دَخَلَ مَأْمَنَهُ فَخَلِّ سَبِيلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "One of our companions, from Abu Jareer Al Qummy who said, \n‘I said to Abu Al-Hassan<sup>asws</sup>, ‘We bought hawks and we entered the Al-Harram. So is that for us?’ So he<sup>asws</sup> said: ‘Everything from the birds which enters the Al-Harram, from what arrays its wings, so it has entered into its safety, therefore, free its way’."}]}, {"index": 6782, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:20", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ يَزِيدَ بْنِ خَلِيفَةَ قَالَ كَانَ فِي جَانِبِ بَيْتِي مِكْتَلٌ فِيهِ بَيْضَتَانِ مِنْ حَمَامِ الْحَرَمِ فَذَهَبَ الْغُلَامُ يَكُبُّ الْمِكْتَلَ وَ هُوَ لَا يَعْلَمُ أَنَّ فِيهِ بَيْضَتَيْنِ فَكَسَرَهُمَا فَخَرَجْتُ فَلَقِيتُ عَبْدَ اللَّهِ بْنَ الْحَسَنِ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ تَصَدَّقْ بِكَفَّيْنِ مِنْ دَقِيقٍ \nقَالَ ثُمَّ لَقِيتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) بَعْدُ فَأَخْبَرْتُهُ فَقَالَ ثَمَنُ طَيْرَيْنِ تَعْلِفُ بِهِ حَمَامَ الْحَرَمِ فَلَقِيتُ عَبْدَ اللَّهِ بْنَ الْحَسَنِ فَأَخْبَرْتُهُ فَقَالَ صَدَقَكَ حَدِّثْ بِهِ فَإِنَّمَا أَخَذَهُ عَنْ آبَائِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ibn Muskan, from Yazeed Bin Khaleefa who said, \n‘By the side of my house there is a nest where were two eggs from a dove of the Al-Harram. So the boy went and threw the nest and he did not know that there were two eggs in it. So he broke them both. So I went out and met Abdullah Bin Al-Hassan and mentioned that to him, so he said, ‘Give in charity with two handfuls of flour’. \nHe (the narrator) said, ‘Then I met Abu Abdullah<sup>asws</sup> afterwards, so I informed him<sup>asws</sup>. So he<sup>asws</sup> said: ‘The price of the two birds to feed the doves of the Al-Harram with it’. So I met Abdullah Bin Al-Hassan and informed him, so he said, ‘You speak the truth. Narrate with it, for rather, he<sup>asws</sup> has taken it from his<sup>asws</sup> forefathers<sup>asws</sup>’."}]}, {"index": 6783, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:21", "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ فَرْخَيْنِ مُسَرْوَلَيْنِ ذَبَحْتُهُمَا وَ أَنَا بِمَكَّةَ فَقَالَ لِي لِمَ ذَبَحْتَهُمَا فَقُلْتُ جَاءَتْنِي بِهِمَا جَارِيَةٌ مِنْ أَهْلِ مَكَّةَ فَسَأَلَتْنِي أَنْ أَذْبَحَهُمَا فَظَنَنْتُ أَنِّي بِالْكُوفَةِ وَ لَمْ أَذْكُرِ الْحَرَمَ فَقَالَ عَلَيْكَ قِيمَتُهُمَا قُلْتُ كَمْ قِيمَتُهُمَا قَالَ دِرْهَمٌ وَ هُوَ خَيْرٌ مِنْهُمَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ismail, from Al Fazl Bin Shazaan and Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Abdul Rahman Bin Al Hajjaj who said, \n‘I asked Abu Abdullah<sup>asws</sup> about two chickens which I slaughtered and I was in Makkah. So he<sup>asws</sup> said to me: ‘Why did you slaughter them?’ So I said, ‘A slave girl from the people of Makkah came with these two to me and asked me to slaughter them. So I thought I was in Al-Kufa and I did not remember the Al-Harram’. So he<sup>asws</sup> said: ‘Upon you is their price’. I said, ‘How much is their price?’ He<sup>asws</sup> said: ‘One Dirham, and it is better than these two’."}]}, {"index": 6784, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:22", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ قَالَ كُنَّا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) بِمَكَّةَ وَ دَاوُدُ بْنُ عَلِيٍّ بِهَا فَقَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لِي دَاوُدُ بْنُ عَلِيٍّ مَا تَقُولُ يَا أَبَا عَبْدِ اللَّهِ فِي قَمَارِيَّ اصْطَدْنَاهَا وَ قَصَّيْنَاهَا فَقُلْتُ تُنْتَفُ وَ تُعْلَفُ فَإِذَا اسْتَوَتْ خُلِّيَ سَبِيلُهَا.", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat, from Dawood Bin Farqad who said, \n‘We were in the presence of Abu Abdullah<sup>asws</sup> at Makkah, and Dawood Bin Ali was in it. So Abu Abdullah<sup>asws</sup> said to me: ‘Dawood Bin Ali said to me<sup>asws</sup>, ‘What are you<sup>asws</sup> saying, O Abu Abdullah<sup>asws</sup>, regarding the dove we had hunted and clipped (its wings)?’ So I<sup>asws</sup> said: ‘You plucked, and you should feed it. So when it is straight (wings grown back), free its way’."}]}, {"index": 6785, "local_index": 23, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:23", "text": "أَحْمَدُ عَنِ الْحَسَنِ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَعْدِ بْنِ عَبْدِ اللَّهِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ بَيْضَةِ نَعَامَةٍ أَكَلْتُ فِي الْحَرَمِ قَالَ تَصَدَّقْ بِثَمَنِهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad, from Al Hassan, from Ali Bin Al Numan, from Sa’d Bin Abdullah who said, \n‘I asked Abu Abdullah<sup>asws</sup> about an ostrich egg which I ate in the Al-Harram. He<sup>asws</sup> said: ‘Give in charity with its price’."}]}, {"index": 6786, "local_index": 24, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:24", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ مُثَنًّى قَالَ خَرَجْنَا إِلَى مَكَّةَ فَاصْطَادَتِ النِّسَاءُ قُمْرِيَّةً مِنْ قَمَارِيِّ أَمَجَ حَيْثُ بَلَغْنَا الْبَرِيدَ فَنَتَفَتِ النِّسَاءُ جَنَاحَيْهِ ثُمَّ دَخَلُوا بِهَا مَكَّةَ فَدَخَلَ أَبُو بَصِيرٍ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَأَخْبَرَهُ فَقَالَ تَنْظُرُونَ امْرَأَةً لَا بَأْسَ بِهَا فَتُعْطُونَهَا الطَّيْرَ تَعْلِفُهُ وَ تُمْسِكُهُ حَتَّى إِذَا اسْتَوَى جَنَاحَاهُ خَلَّتْهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa, from Musa who said, \n‘We went out to Makkah, so the women caught a dove from the doves of Amaj when we reached Al-bareyd. So the women plucked out its wings. Then they entered Makkah with it. So Abu Baseer went over to Abu Abdullah<sup>asws</sup> and informed him<sup>asws</sup>, so he<sup>asws</sup> said: ‘Look around for a woman not having a problem with her, so give the bird to her to look after it and keep it. When it’s wings are straight (grown back), she should free it’."}]}, {"index": 6787, "local_index": 25, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:25", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عِمْرَانَ الْحَلَبِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا يُكْرَهُ مِنَ الطَّيْرِ فَقَالَ مَا صَفَّ عَلَى رَأْسِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Isa, from Imran Al Halby who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘What is disliked from the birds?’ So he<sup>asws</sup> said: ‘When arrays its wings hovering upon your head’."}]}, {"index": 6788, "local_index": 26, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:26", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْبَرْقِيِّ عَنْ دَاوُدَ بْنِ أَبِي يَزِيدَ الْعَطَّارِ عَنْ أَبِي سَعِيدٍ الْمُكَارِي قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ قَتَلَ أَسَداً فِي الْحَرَمِ قَالَ عَلَيْهِ كَبْشٌ يَذْبَحُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al barqy, from Dawood Bin Abu Yazeed Al Attar, from Abu Saeed Al Mukary who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘A man kills a lion inside the Al-Harram?’ He<sup>asws</sup> said: ‘Upon him would be a ram to slaughter’."}]}, {"index": 6789, "local_index": 27, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:27", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ بُكَيْرِ بْنِ أَعْيَنَ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي رَجُلٍ أَصَابَ ظَبْياً فِي الْحِلِّ فَاشْتَرَاهُ فَأَدْخَلَهُ الْحَرَمَ فَمَاتَ الظَّبْيُ فِي الْحَرَمِ فَقَالَ إِنْ كَانَ حِينَ أَدْخَلَهُ الْحَرَمَ خَلَّى سَبِيلَهُ فَمَاتَ فَلَا شَيْ‏ءَ عَلَيْهِ وَ إِنْ كَانَ أَمْسَكَهُ حَتَّى مَاتَ عِنْدَهُ فِي الْحَرَمِ فَعَلَيْهِ الْفِدَاءُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Bukeyr Bin Ayn, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding a man who came across an antelope in the unrestricted area. So he bought it and entered the Al-Harram with it. So the antelope died inside the Al-Harram. So he<sup>asws</sup> said: ‘If it was such that when he entered it into the Al-Harram, he had freed its way, so it died, then there is nothing upon him; but if it was such that he withheld it until it died with him inside ‘الْحَرَمِ’ the Al-Harram, so upon him is the expiation’."}]}, {"index": 6790, "local_index": 28, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:28", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ أَبِي نَصْرٍ قَالَ أَخْبَرَنِي حَمْزَةُ بْنُ الْيَسَعَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْفَهْدِ يُشْتَرَى بِمِنًى وَ يُخْرَجُ بِهِ مِنَ الْحَرَمِ فَقَالَ كُلُّ مَا أُدْخِلَ الْحَرَمَ مِنَ السَّبُعِ مَأْسُوراً فَعَلَيْكَ إِخْرَاجُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad and Ahmad Bin Muhammad, altogether, from Ibn Abu Nasr who said, \n‘Hamza Bin Al-Yas’a informed me saying, ‘I asked Abu Abdullah<sup>asws</sup> about the leopard someone bought in Mina, and he went out with it from Al-Harram. So he<sup>asws</sup> said: ‘Everything from the predatory wild animal which enter the الْحَرَمِ in captivity, so upon you is exiting it’."}]}, {"index": 6791, "local_index": 29, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:29", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ ( عليه السلام ) أَنَّهُ سُئِلَ عَنْ شَجَرَةٍ أَصْلُهَا فِي الْحَرَمِ وَ أَغْصَانُهَا فِي الْحِلِّ عَلَى غُصْنٍ مِنْهَا طَائِرٌ رَمَاهُ رَجُلٌ فَصَرَعَهُ قَالَ عَلَيْهِ جَزَاؤُهُ إِذَا كَانَ أَصْلُهَا فِي الْحَرَمِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Ja’far<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup>, from Ali<sup>asws</sup> having been asked about a tree, the root of which is in الْحَرَمِ (the Al-Harram), and its branches are in the unrestricted area, and upon a branch of it is a bird which a man pelted and felled it. He<sup>asws</sup> said: ‘Upon him is its compensation, when its roots were inside ‘الْحَرَمِ’ the Al-Harram’."}]}, {"index": 6792, "local_index": 30, "part_type": "Hadith", "path": "/books/al-kafi:4:3:21:30", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ عَبْدِ الْأَعْلَى بْنِ أَعْيَنَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ أَصَابَ صَيْداً فِي الْحِلِّ فَرَبَطَهُ إِلَى جَانِبِ الْحَرَمِ فَمَشَى الصَّيْدُ بِرِبَاطِهِ حَتَّى دَخَلَ الْحَرَمَ وَ الرِّبَاطُ فِي عُنُقِهِ فَأَجَرَّهُ الرَّجُلُ بِحَبْلِهِ حَتَّى أَخْرَجَهُ مِنَ الْحَرَمِ وَ الرَّجُلُ فِي الْحِلِّ فَقَالَ ثَمَنُهُ وَ لَحْمُهُ حَرَامٌ مِثْلُ الْمَيْتَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ibn Mahboub, from Malik Bin Atiyya, from Abdul A’ala Bin Ayn who said, \n‘I asked Abu Abdullah<sup>asws</sup> about a man who came across a prey in the unrestricted area, so he tied it down to the side of the Al-Harram. So the prey went with its tying until it entered the Al-Harram, and the rope was in its neck. So the man pulled with his rope until he exited it from the Al-Harram, and the man was not in Ihram. So he<sup>asws</sup> said: ‘It’s price (as a penalty), and its flesh would be Prohibited like the dead’."}]}]}, "index": "al-kafi:4:3:21", "kind": "verse_list"}