{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 211"
        },
        "path": "/books/al-kafi:4:3:211",
        "titles": {
          "ar": "بَابُ الرَّجُلِ يَبْعَثُ بِالْهَدْيِ تَطَوُّعاً وَ يُقِيمُ فِي أَهْلِهِ",
          "en": "Chapter 211 – The man sends the sacrificial animal voluntarily, and he stays among his family"
        }
      }
    ],
    "index": 1154,
    "local_index": 211,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 212"
        },
        "path": "/books/al-kafi:4:3:212",
        "titles": {
          "ar": "بَابُ النَّوَادِرِ",
          "en": "Chapter 212 – The Miscellaneous"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 210"
        },
        "path": "/books/al-kafi:4:3:210",
        "titles": {
          "ar": "بَابُ الْمُعْتَمِرِ يَطَأُ أَهْلَهُ وَ هُوَ مُحْرِمٌ وَ الْكَفَّارَةِ فِي ذَلِكَ",
          "en": "Chapter 210 – The performer of Umra sleeps with his wife and he is in Ihraam, and the expiation regarding that"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:211",
    "titles": {
      "ar": "بَابُ الرَّجُلِ يَبْعَثُ بِالْهَدْيِ تَطَوُّعاً وَ يُقِيمُ فِي أَهْلِهِ",
      "en": "Chapter 211 – The man sends the sacrificial animal voluntarily, and he stays among his family"
    },
    "verse_count": 4,
    "verse_start_index": 7998,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/241)"
        ],
        "index": 7999,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:211:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ بَعَثَ بِهَدْيٍ مَعَ قَوْمٍ وَ وَاعَدَهُمْ يَوْمَ يُقَلِّدُونَ فِيهِ هَدْيَهُمْ وَ يُحْرِمُونَ فِيهِ فَقَالَ يَحْرُمُ عَلَيْهِ مَا يَحْرُمُ عَلَى الْمُحْرِمِ فِي الْيَوْمِ الَّذِي وَاعَدَهُمْ حَتَّى يَبْلُغَ الْهَدْيُ مَحِلَّهُ ",
          "فَقُلْتُ أَ رَأَيْتَ إِنْ أَخْلَفُوا فِي مِيعَادِهِمْ وَ أَبْطَئُوا فِي السَّيْرِ عَلَيْهِ جُنَاحٌ فِي الْيَوْمِ الَّذِي وَاعَدَهُمْ قَالَ لَا وَ يَحِلُّ فِي الْيَوْمِ الَّذِي وَاعَدَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fazeyl, from Abu Al Sabbah Al Kinany who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who sends a sacrificial animal with a group of people, and sets the timing with them when they were yoking their sacrificial animal in and they were wearing their <span class=\"iTxt\">Ihraam</span> in. So he<sup>asws</sup> said: ‘It is Prohibited upon him what is Prohibited upon the one in <span class=\"iTxt\">Ihraam</span> during the day when he fixed with them until the sacrificial animal reaches its place’. ",
            "So I said, ‘What is your<sup>asws</sup> view if they lag behind in their fixed time, and are slower in the travelling, would there be blame upon him regarding the day which he fixed with them?’ He<sup>asws</sup> said: ‘No, and he would free from <span class=\"iTxt\">Ihraam</span> during the day which he fixed with them’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isma‘il from Muhammad ibn al-Fudayl from abu al-Sabbah al-Kinaniy who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about a man who sends an animal for offering with a people, sets the time when they mark their animals for offering and assuming the state of Ihram. He (the Imam) said, ‘At such time all things unlawful for them become unlawful for him until the animal for offering reaches its destination.’ I then asked, ‘What will happen if they cannot reach in the appointed time which is set up?’ He (the Imam) said, ‘He must not become as one not in the state of Ihram on the appointed day which he has set up with them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/242)"
        ],
        "index": 8000,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:211:2",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ سَلَمَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ عَلِيّاً ( عليه السلام ) كَانَ يَبْعَثُ بِهَدْيِهِ ثُمَّ يُمْسِكُ عَمَّا يُمْسِكُ عَنْهُ الْمُحْرِمُ غَيْرَ أَنَّهُ لَا يُلَبِّي وَ يُوَاعِدُهُمْ يَوْمَ يُنْحَرُ فِيهِ بَدَنَةٌ فَيَحِلُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban, from Salma, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Ali<sup>asws</sup> would send his<sup>asws</sup> sacrificial animal, then he<sup>asws</sup> would refrain from what the one in <span class=\"iTxt\">Ihraam</span> would refrain from, apart from that he<sup>asws</sup> did not exclaim <span class=\"iTxt\">Talbiyya</span>, and he<sup>asws</sup> fixed a time with them for the day of the sacrifice for the sacrificial animal, so he<sup>asws</sup> would free (from restrictions)’."
          ],
          "en.sarwar": [
            "2. Humayd ibn Ziyad has narrated from al-Hassan ibn m h ibn Sama‘ah from more than one person from Aban from Salmah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ali, ‘Alayhi al-Salam, would send an animal for offering. He would then stay away from all things from which a person in the state of Ihram stays away, except that he would not say Talbiyah. He would set up a time in which they were to slaughter the badanah and thereafter he would become as one not in the state of Ihram.’” NOTE: (Fatwa best explains Hadith 1-2 of this Chapter) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/242)"
        ],
        "index": 8001,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:211:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَبْعَثُ بِالْهَدْيِ تَطَوُّعاً لَيْسَ بِوَاجِبٍ قَالَ يُوَاعِدُ أَصْحَابَهُ يَوْماً فَيُقَلِّدُونَهُ فَإِذَا كَانَتْ تِلْكَ السَّاعَةُ اجْتَنَبَ عَمَّا يَجْتَنِبُ الْمُحْرِمُ إِلَى يَوْمِ النَّحْرِ فَإِذَا كَانَ يَوْمُ النَّحْرِ أَجْزَأَ عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhamamd Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, from Muawiya Bin Ammmar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who sends the sacrificial animal voluntarily, not being with an Obligation. He<sup>asws</sup> said: ‘He would fix a time with his companion of a day, so he would yoke it. So when it would be that time, he would keep away from whatever the one in <span class=\"iTxt\">Ihraam</span> keeps away from, up to the day of the sacrifice. So when it would be the day of the sacrifice, it would suffice him from it’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Am mar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who, optionally, not obligatory, sends an offering animal (to be offered as sacrifice) with other people. He (the Imam) said, ‘He sets up with his friends a day. They tag the offering animal. When that hour comes he stays away from things that are not lawful in the state of Ihram up to the tenth day of Dhu al-Hajjah. When it is the tenth day, his offering is considered sufficient.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/243)"
        ],
        "index": 8002,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:211:4",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ هَارُونَ بْنِ خَارِجَةَ قَالَ إِنَّ مُرَاداً بَعَثَ بِبَدَنَةٍ وَ أَمَرَ أَنْ تُقَلَّدَ وَ تُشْعَرَ فِي يَوْمِ كَذَا وَ كَذَا فَقُلْتُ لَهُ إِنَّمَا يَنْبَغِي أَنْ لَا يَلْبَسَ الثِّيَابَ فَبَعَثَنِي إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) بِالْحِيرَةِ فَقُلْتُ لَهُ إِنَّ مُرَاداً صَنَعَ كَذَا وَ كَذَا وَ إِنَّهُ لَا يَسْتَطِيعُ أَنْ يَتْرُكَ الثِّيَابَ لِمَكَانِ زِيَادٍ فَقَالَ مُرْهُ أَنْ يَلْبَسَ الثِّيَابَ وَ لْيَذْبَحْ بَقَرَةً يَوْمَ الْأَضْحَى عَنْ نَفْسِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Haroun Bin Kharjat who said, ",
            "‘Murada sent his sacrificial animal and instructed that it be yoked and marked on such and such a day. So I said to him, ‘But rather, it is befitting that you do not wear the (normal) clothes’. So he sent me to Abu Abdullah<sup>asws</sup> at Al-Hira, and I said to him<sup>asws</sup>, ‘Murada did such and such, and he did not have the capacity that he neglects the (normal) clothing due to Ziyad’. So he<sup>asws</sup> said: ‘Instruct him that he should wear the (normal) clothes, and let him slaughter a cow on the day of the slaughtering from himself’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Flarun ibn Kharijah who has said the following: “Murad once sent a badanah as offering and commanded to mark and tag it on such and such day. I then said that it is proper not to wear clothes. He then sent me to ‘Abd Allah, ‘Alayhi al-Salam, in al- Hirah, (a place in Iraq). I said to him (the Imam) that Murad has done such and such things and he is not able to ignore the clothes because of Ziyad. He (the Imam) said, ‘Instruct him to wear the clothes and slaughter a cow on the day of al-Adha’ for himself.’” NOTE:(Fatwa best explains Hadith 4) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:211",
  "kind": "verse_list"
}