{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 214"
        },
        "path": "/books/al-kafi:4:3:214",
        "titles": {
          "ar": "بَابُ إِتْبَاعِ الْحَجِّ بِالزِّيَارَةِ",
          "en": "Chapter 214 – Following up the Hajj with the Ziyarah"
        }
      }
    ],
    "index": 1157,
    "local_index": 214,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:214",
    "titles": {
      "ar": "بَابُ إِتْبَاعِ الْحَجِّ بِالزِّيَارَةِ",
      "en": "Chapter 214 – Following up the Hajj with the Ziyarah"
    },
    "verse_count": 4,
    "verse_start_index": 8044,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/258)"
        ],
        "index": 8045,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:214:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّمَا أُمِرَ النَّاسُ أَنْ يَأْتُوا هَذِهِ الْأَحْجَارَ فَيَطُوفُوا بِهَا ثُمَّ يَأْتُونَا فَيُخْبِرُونَا بِوَلَايَتِهِمْ وَ يَعْرِضُوا عَلَيْنَا نَصْرَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘But rather, the people have been Commanded that they should come to these rocks, so they would be performing <span class=\"iTxt\">Tawaaf</span> by these. Then they should be coming to us<sup>asws</sup>, and informing us<sup>asws</sup> of their Wilayah, and they should be presenting to us<sup>asws</sup> their support’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah from Zurarah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘People are commanded to come to these stones, perform Tawaf, thereafter come to us to inform us of their acceptance of our Divine Authority and offer us their support. ‘“"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/258)"
        ],
        "index": 8046,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:214:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ تَمَامُ الْحَجِّ لِقَاءُ الْإِمَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Hajj is completed by meeting the Imam<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Sinan from ‘Ammar ibn Marwan from Jabir who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘Meeting the Imam is completion of al-Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/258)"
        ],
        "index": 8047,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:214:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ يَحْيَى بْنِ يَسَارٍ قَالَ حَجَجْنَا فَمَرَرْنَا بِأَبِي  عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ حَاجُّ بَيْتِ اللَّهِ وَ زُوَّارُ قَبْرِ نَبِيِّهِ ( صلى الله عليه وآله ) وَ شِيعَةُ آلِ مُحَمَّدٍ هَنِيئاً لَكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Asbaat, from Yahya Bin Yasaar who said, ",
            "‘We performed Hajj and we passed by Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said: ‘You have performed Hajj of the House of Allah<sup>azwj</sup>, and <span class=\"iTxt\">Ziyarah</span> of the grave of the Prophet<sup>saww</sup>, and Shiahs of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> welcome to you all!’."
          ],
          "en.sarwar": [
            "3. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from Ali ibn Asbat from Yahya ibn Yasar who has said the following: “We performed al-Hajj. We then visited abu ‘Abd Allah, ‘Alayhi al-Salam. He (the Imam) said, ‘Welcome, visitors of the House of Allah, visitors of the grave of His prophet and followers of the family of Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, wholesome and delightful indeed are your visits.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/259)"
        ],
        "index": 8048,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:214:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ سُلَيْمَانَ عَنْ زِيَادٍ الْقَنْدِيِّ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ ذَرِيحٍ الْمُحَارِبِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ أَمَرَنِي فِي كِتَابِهِ بِأَمْرٍ فَأُحِبُّ أَنْ أَعْمَلَهُ قَالَ وَ مَا ذَاكَ قُلْتُ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ ثُمَّ لْيَقْضُوا تَفَثَهُمْ وَ لْيُوفُوا نُذُورَهُمْ قَالَ لْيَقْضُوا تَفَثَهُمْ لِقَاءُ الْإِمَامِ وَ لْيُوفُوا نُذُورَهُمْ تِلْكَ الْمَنَاسِكُ ",
          "قَالَ عَبْدُ اللَّهِ بْنُ سِنَانٍ فَأَتَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقُلْتُ جُعِلْتُ فِدَاكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ ثُمَّ لْيَقْضُوا تَفَثَهُمْ وَ لْيُوفُوا نُذُورَهُمْ قَالَ أَخْذُ الشَّارِبِ وَ قَصُّ الْأَظْفَارِ وَ مَا أَشْبَهَ ذَلِكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّ ذَرِيحَ الْمُحَارِبِيِّ حَدَّثَنِي عَنْكَ بِأَنَّكَ قُلْتَ لَهُ لْيَقْضُوا تَفَثَهُمْ لِقَاءُ الْإِمَامِ وَ لْيُوفُوا نُذُورَهُمْ تِلْكَ الْمَنَاسِكُ فَقَالَ صَدَقَ ذَرِيحٌ وَ صَدَقْتَ إِنَّ لِلْقُرْآنِ ظَاهِراً وَ بَاطِناً وَ مَنْ يَحْتَمِلُ مَا يَحْتَمِلُ ذَرِيحٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Suleyman, from Ziyad Al Qindy, from Abdullah Bin Sinan, from Zareeh Al Muhariby who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Allah<sup>azwj</sup> has Commanded me with a Command, so I would love to perform it’. He<sup>asws</sup> said: ‘And what is that?’ I said, ‘The Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[22:29] Then let them fulfil their needful acts, and let them be loyal to their vows</span>. He<sup>asws</sup> said: ‘<span class=\"ibTxt\">Then let them fulfil their needful acts</span> is meeting the Imam<sup>asws</sup>, <span class=\"ibTxt\">and let them be loyal to their vows</span>, these are the rituals’. ",
            "Abdullah Bin Sinan said, ‘So I went over to Abu Abdullah<sup>asws</sup> and said, ‘May I be sacrificed for you<sup>asws</sup>! The Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[22:29] Then let them fulfil their needful acts, and let them be loyal to their vows</span>’. He<sup>asws</sup> said: ‘Trimming the moustache, and clipping the nails, and whatever resembles that’. I said, ‘May I be sacrificed for you<sup>asws</sup>! Zareeh Al-Mahariby narrated to me from you<sup>asws</sup> that you<sup>asws</sup> said to him: ‘<span class=\"ibTxt\">Then let them fulfill their needful acts </span>(that) is meeting the Imam<sup>asws</sup>, <span class=\"ibTxt\">and let them be loyal to their vows</span>, these are the rituals’. So he<sup>asws</sup> said: ‘Zareeh spoke the truth. Surely, for the Quran there is an apparent and a hidden; and who can bear what ‘Zareeh’ can bear?’"
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Sulayman from Ziyad al-Qandiy from ‘Abd Allah ibn Sinan from Dharih al-Muharibiy who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, Allah has commanded me in His book and I love to obey that command. He (the Imam) asked, ‘What is that commandment?’ I replied, ‘It is the words of Allah. “Then spruce up and comply with your vows.’” He (the Imam) said, ‘Spruce up’ means visit your Imam, ‘comply with your vows’ means perform the acts of al-Hajj.’ ‘Abd Allah ibn Sinan has said, ‘I visited abu ‘Abd Allah, ‘Alayhi al-Salam, and asked, “I pray to Allah to keep my soul in service for your cause. What is the meaning of the words of Allah, most Majestic, most Glorious, ‘Spruce up and comply with your vows?”” He (the Imam) replied, ‘It means trimming one’s mustache and nails, and so on.’ I (the narrator) then said, ‘I pray to Allah to keep my soul in service for your cause. Dharih al-Muharibiy narrated to me that you have said to him, “Spruce up” means visiting the Imam, “comply with your vows” means performing acts of al-Hajj.’ He (the Imam) replied, ‘Dharih has spoken the truth and you have spoken the truth. Al-Quran has apparent and hidden meanings. Who is he to bear what Dharih is able to bear?”” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:214",
  "kind": "verse_list"
}