{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 216"
        },
        "path": "/books/al-kafi:4:3:216",
        "titles": {
          "ar": "بَابُ دُخُولِ الْمَدِينَةِ وَ زِيَارَةِ النَّبِيِّ ( صلى الله عليه وآله ) وَ الدُّعَاءِ عِنْدَ قَبْرِهِ",
          "en": "Chapter 216 – Entering Al-Medina and Ziyarah of the Prophet<sup>saww</sup>, and the supplication at his<sup>saww</sup> grave"
        }
      }
    ],
    "index": 1159,
    "local_index": 216,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 217"
        },
        "path": "/books/al-kafi:4:3:217",
        "titles": {
          "ar": "بَابُ الْمِنْبَرِ وَ الرَّوْضَةِ وَ مَقَامِ النَّبِيِّ ( صلى الله عليه وآله )",
          "en": "Chapter 217 – The Pulpit, and the garden, and place of the Prophet<sup>saww</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 215"
        },
        "path": "/books/al-kafi:4:3:215",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ فَضْلِ الرُّجُوعِ</span> إِلَى الْمَدِينَةِ",
          "en": "Chapter 215 – The merits of the returning to Al-Medina (after performing Hajj)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:216",
    "titles": {
      "ar": "بَابُ دُخُولِ الْمَدِينَةِ وَ زِيَارَةِ النَّبِيِّ ( صلى الله عليه وآله ) وَ الدُّعَاءِ عِنْدَ قَبْرِهِ",
      "en": "Chapter 216 – Entering Al-Medina and Ziyarah of the Prophet<sup>saww</sup>, and the supplication at his<sup>saww</sup> grave"
    },
    "verse_count": 8,
    "verse_start_index": 8050,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/260)"
        ],
        "index": 8051,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/143",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ وَ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:216:1",
        "relations": {
          "Mentions": [
            "/books/quran:4:64"
          ]
        },
        "text": [
          " إِذَا دَخَلْتَ الْمَدِينَةَ فَاغْتَسِلْ قَبْلَ أَنْ تَدْخُلَهَا أَوْ حِينَ تَدْخُلُهَا ثُمَّ تَأْتِي قَبْرَ النَّبِيِّ ( صلى الله عليه وآله ) ثُمَّ تَقُومُ فَتُسَلِّمُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ تَقُومُ عِنْدَ الْأُسْطُوَانَةِ الْمُقَدَّمَةِ مِنْ جَانِبِ الْقَبْرِ الْأَيْمَنِ عِنْدَ رَأْسِ الْقَبْرِ عِنْدَ زَاوِيَةِ الْقَبْرِ وَ أَنْتَ مُسْتَقْبِلُ الْقِبْلَةِ وَ مَنْكِبُكَ الْأَيْسَرُ إِلَى جَانِبِ الْقَبْرِ وَ مَنْكِبُكَ الْأَيْمَنُ مِمَّا يَلِي الْمِنْبَرَ فَإِنَّهُ مَوْضِعُ رَأْسِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ تَقُولُ",
          "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ وَ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ وَ أَشْهَدُ أَنَّكَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ وَ أَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ رِسَالَاتِ رَبِّكَ وَ نَصَحْتَ لِأُمَّتِكَ وَ جَاهَدْتَ فِي سَبِيلِ اللَّهِ وَ عَبَدْتَ اللَّهَ مُخْلِصاً حَتَّى أَتَاكَ الْيَقِينُ بِالْحِكْمَةِ وَ الْمَوْعِظَةِ الْحَسَنَةِ وَ أَدَّيْتَ الَّذِي عَلَيْكَ مِنَ الْحَقِّ وَ أَنَّكَ قَدْ رَؤُفْتَ بِالْمُؤْمِنِينَ وَ غَلُظْتَ عَلَى الْكَافِرِينَ فَبَلَغَ اللَّهُ بِكَ أَفْضَلَ شَرَفِ مَحَلِّ الْمُكْرَمِينَ",
          "الْحَمْدُ لِلَّهِ الَّذِي اسْتَنْقَذَنَا بِكَ مِنَ الشِّرْكِ وَ الضَّلَالَةِ اللَّهُمَّ فَاجْعَلْ صَلَوَاتِكَ وَ صَلَوَاتِ مَلَائِكَتِكَ الْمُقَرَّبِينَ وَ عِبَادِكَ الصَّالِحِينَ وَ أَنْبِيَائِكَ الْمُرْسَلِينَ وَ أَهْلِ السَّمَاوَاتِ وَ الْأَرَضِينَ وَ مَنْ سَبَّحَ لَكَ يَا رَبَّ الْعَالَمِينَ مِنَ الْأَوَّلِينَ وَ الْآخِرِينَ عَلَى مُحَمَّدٍ عَبْدِكَ وَ رَسُولِكَ وَ نَبِيِّكَ وَ أَمِينِكَ وَ نَجِيِّكَ وَ حَبِيبِكَ وَ صَفِيِّكَ وَ خَاصَّتِكَ وَ صَفْوَتِكَ وَ خِيَرَتِكَ مِنْ خَلْقِكَ ",
          "اللَّهُمَّ أَعْطِهِ الدَّرَجَةَ وَ الْوَسِيلَةَ مِنَ الْجَنَّةِ وَ ابْعَثْهُ مَقَاماً مَحْمُوداً يَغْبِطُهُ بِهِ الْأَوَّلُونَ وَ الْآخِرُونَ اللَّهُمَّ إِنَّكَ قُلْتَ وَ لَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ فَاسْتَغْفَرُوا اللَّهَ وَ اسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللَّهَ تَوَّاباً رَحِيماً وَ إِنِّي أَتَيْتُ نَبِيَّكَ مُسْتَغْفِراً تَائِباً مِنْ ذُنُوبِي وَ إِنِّي أَتَوَجَّهُ بِكَ إِلَى اللَّهِ رَبِّي وَ رَبِّكَ لِيَغْفِرَ لِي ذُنُوبِي ",
          "وَ إِنْ كَانَتْ لَكَ حَاجَةٌ فَاجْعَلْ قَبْرَ النَّبِيِّ ( صلى الله عليه وآله ) خَلْفَ كَتِفَيْكَ وَ اسْتَقْبِلِ الْقِبْلَةَ وَ ارْفَعْ يَدَيْكَ وَ اسْأَلْ حَاجَتَكَ فَإِنَّكَ أَحْرَى أَنْ تُقْضَى إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Ismail, from Al fazl Bin Shazaan, from Safwan, and Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you enter Al-Medina, so wash before you enter it, or where you enter it. Then go to the grave of the Prophet<sup>saww</sup>. Then you should stand and send greetings upon Rasool-Allah<sup>saww</sup>. Then stand by the front pillar from the right side of the grave near the head of the grave in the corner of the grave, and you are facing the Qiblah, and your left shoulder being to the side of the grave, and your right shoulder from what follows the Pulpit, for it is the place of the head of Rasool-Allah<sup>saww</sup>, and you should be saying, ‘",
            "I testify that there is no god except for Allah<sup>azwj</sup> Alone, there being no associates for Him<sup>azwj</sup>, and I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, and I testify that you<sup>saww</sup> are Rasool-Allah<sup>saww</sup>, and I testify that you<sup>saww</sup>, Muhammad<sup>saww</sup> Bin Abdullah<sup>as</sup>, you<sup>saww</sup> have delivered the Message of your<sup>saww</sup> Lord<sup>azwj</sup>, and preached to your<sup>saww</sup> community, and struggled in the Way of Allah<sup>azwj</sup>, and worshipped Allah<sup>azwj</sup> sincerely until conviction (death) came to you<sup>saww</sup> with the Wisdom, and the goodly preaching, and that you<sup>saww</sup> fulfilled that which was upon you<sup>saww</sup> from the Truth; and you<sup>saww</sup> were kind with the Believers and harsh upon the Infidels, therefore Allah<sup>azwj</sup> Delivered with you<sup>saww</sup>, the most superior of the honours placed upon the honourable ones. ",
            "The Praise is for Allah<sup>azwj</sup> Who saved us through you<sup>saww</sup> from the Polytheism and the straying. O Allah<sup>azwj</sup>! Thus, Make Your<sup>azwj</sup> Blessings and the Blessings of Your<sup>azwj</sup> Angels of Proximity, and Your<sup>azwj</sup> righteous servant, and Your<sup>azwj</sup> Prophets<sup>as</sup>, the Mursils, and the inhabitants of the skies and the firmaments, and the ones who Glorify to You<sup>azwj</sup>, O Lord<sup>azwj</sup> of the worlds, from the former ones and the later ones, to be upon Muhammad<sup>saww</sup> (who is) Your<sup>azwj</sup> servant, and Your<sup>azwj</sup> Rasool<sup>saww</sup>, and Your<sup>saww</sup> Prophet<sup>saww</sup>, and Your<sup>azwj</sup> trustworthy one, and Your<sup>azwj</sup> excellent one, and Your<sup>azwj</sup> Beloved, and Your<sup>azwj</sup> special one, and Your<sup>azwj</sup> Chosen one, Your<sup>azwj</sup> elite, and Your<sup>azwj</sup> Choice from Your<sup>azwj</sup> creatures. ",
            "O Allah<sup>azwj</sup>! Give him<sup>saww</sup> the Level and the Means from the Paradise, and Resurrect him<sup>saww</sup> on the Praiseworthy Place (<span class=\"iTxt\">Maqaam Mahmoud</span>), envied by the former ones and the later ones. O Allah<sup>azwj</sup>! You<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h64\">[4:64]</a> and had they, when they were unjust to themselves, come to you and asked Forgiveness from Allah and the Rasool had (also) asked Forgiveness for them, they would have found Allah Oft-returning (to Mercy), Merciful</span>. And I have come to Your<sup>azwj</sup> Prophet<sup>saww</sup>, seeking Forgiveness, repentant from my sins, and I hereby divert by you<sup>saww</sup> towards Allah<sup>azwj</sup>, my Lord<sup>azwj</sup> and your<sup>saww</sup> Lord<sup>azwj</sup>, so that He<sup>azwj</sup> would Forgive my sins for me’. ",
            "And if there was a need for you, so make the grave of the Prophet<sup>saww</sup> to be behind your shoulders, and face the Qiblah and raise your hands, and ask your need, for you would be more entitled that it be fulfilled, if Allah<sup>azwj</sup> so Desires it’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan from Safwan and ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that when you enter al-Madinah, take a shower before you enter or at that time. Thereafter go to the grave of the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, stand up and offer Salam to the Messenger of Allah. Then stand up near the pillar, the first one from the right side of the grave near the head of the grave and near the corner of the grave when you are facing al-Qiblah (the direction of Makkah). Keep your left shoulder toward the grave and your right shoulder toward the pulpit, which is the place of the head of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. Thereafter say, ‘I testify that no one except Allah, who is One and only and has no partners, deserves worship. I testify that Muhammad is His servant and His messenger. I testify that you are the Messenger of Allah. I testify that you are Muhammad ibn ’Abd Allah. I testify that you conveyed and preached the messages of your Lord, gave good advice to your followers, strove hard for the cause of Allah, and worshipped Allah sincerely, until the time of your death, with wisdom and good advice. You fulfilled your duty of conveying the truth. You treated believers with compassion and dealt with the unbelievers by means of strength. Allah thus took you to the excellent position of honor of the honorable ones. All praise and thanks belong to Allah who saved us through you from paganism and straying. O Allah, grant salawat (favors and compensation to Muhammad and his family worthy of their services to Your cause) and accept such prayers of angels, of prominent position before You, Your virtuous servant, messenger prophets, inhabitants of heavens and earths and all of those who glorify You. O Lord of the world, accept such prayers of those who lived in the past and those to come into being. Accept such prayers in favor of Muhammad, Your servant, Your messenger, Your prophet, Your trusted one, Your chosen one, Your beloved one, Your selected one, the one very special to You, the purified one, the one who is Your choice from among Your creatures. “O Allah, grant him high position, the means from paradise, raise him to the praiseworthy position which is coveted by those who lived in the past and those who came later on. O Allah, You have said, “If they do injustice to themselves and then come to you, then ask forgiveness from Allah for their sins and the messenger also asks forgiveness from Allah for them; they will find Allah forgiving and merciful. ”<a href=\"/#/books/quran:4#h64\">[4:64]</a> I have come to Your prophet, begging for forgiveness, repenting for my sins and I through you (the Messenger of Allah) have turned to Allah, my Lord, and your Lord, so He forgives my sins.’ If you have any wishes then keep the grave of the Holy Prophet behind your shoulders, face the direction of Ka’bah, raise your hands and ask for your wishes; you deserve to find your wishes made to come true, if Allah so wills.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/262)"
        ],
        "index": 8052,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2679",
              "text": "الْحُسَيْنِ بْنِ عَلِيٍّ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/976",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3921",
              "text": "الْحَسَنِ بْنِ عَلِيِّ بْنِ عُثْمَانَ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/643",
              "text": "عَلِيِّ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3922",
              "text": "أَخِيهِ أَبِي الْحَسَنِ مُوسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3923",
              "text": "جَدِّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحُسَيْنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عُثْمَانَ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ مُوسَى عَنْ أَبِيهِ عَنْ جَدِّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:216:2",
        "relations": {
          "Mentions": [
            "/books/quran:28:24"
          ]
        },
        "text": [
          " كَانَ أَبِي عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَقِفُ عَلَى قَبْرِ النَّبِيِّ ( صلى الله عليه وآله ) فَيُسَلِّمُ عَلَيْهِ وَ يَشْهَدُ لَهُ بِالْبَلَاغِ وَ يَدْعُو بِمَا حَضَرَهُ",
          "ثُمَّ يُسْنِدُ ظَهْرَهُ إِلَى الْمَرْوَةِ الْخَضْرَاءِ الدَّقِيقَةِ الْعَرْضِ مِمَّا يَلِي الْقَبْرَ وَ يَلْتَزِقُ بِالْقَبْرِ وَ يُسْنِدُ ظَهْرَهُ إِلَى الْقَبْرِ وَ يَسْتَقْبِلُ الْقِبْلَةَ فَيَقُولُ اللَّهُمَّ إِلَيْكَ أَلْجَأْتُ ظَهْرِي وَ إِلَى قَبْرِ مُحَمَّدٍ عَبْدِكَ وَ رَسُولِكَ أَسْنَدْتُ ظَهْرِي وَ الْقِبْلَةَ الَّتِي رَضِيتَ لِمُحَمَّدٍ ( صلى الله عليه وآله ) اسْتَقْبَلْتُ",
          "اللَّهُمَّ إِنِّي أَصْبَحْتُ لَا أَمْلِكُ لِنَفْسِي خَيْرَ مَا أَرْجُو وَ لَا أَدْفَعُ عَنْهَا شَرَّ مَا أَحْذَرُ عَلَيْهَا وَ أَصْبَحَتِ الْأُمُورُ بِيَدِكَ فَلَا فَقِيرَ أَفْقَرُ مِنِّي إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ اللَّهُمَّ ارْدُدْنِي مِنْكَ بِخَيْرٍ فَإِنَّهُ لَا رَادَّ لِفَضْلِكَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أَنْ تُبَدِّلَ اسْمِي أَوْ تُغَيِّرَ جِسْمِي أَوْ تُزِيلَ نِعْمَتَكَ عَنِّي اللَّهُمَّ كَرِّمْنِي بِالتَّقْوَى وَ جَمِّلْنِي بِالنِّعَمِ وَ اغْمُرْنِي بِالْعَافِيَةِ وَ ارْزُقْنِي شُكْرَ الْعَافِيَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Husayn Bin Ali Al Kufy, from Ali Bin Mahziyar, ",
            "(It has been narrated) from Al-Hassan Bin Ali Bin Usman Bin Ali, son of Al-Husayn<sup>asws</sup> son of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, from his brother Al-Hassan Bin Musa<sup>asws</sup>, from his<sup>asws</sup> brother, from his grandfather<sup>asws</sup> having said: ‘My<sup>asws</sup> father<sup>asws</sup> Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> would pause at the grave of the Prophet<sup>saww</sup>, so he<sup>asws</sup> would greet upon him<sup>saww</sup>, and he<sup>asws</sup> would testify to him<sup>saww</sup> with the delivery (of the Message), and supplicate with what presented to him<sup>asws</sup>. ",
            "Then he<sup>asws</sup> would incline his<sup>asws</sup> back towards the green rock displayed on the ground from what follows the grave, and he<sup>asws</sup> would incline his<sup>asws</sup> back towards the grave, and he<sup>asws</sup> would face the Qiblah and he<sup>asws</sup> was saying: ‘To You<sup>azwj</sup> I<sup>asws</sup> I seek Support of my<sup>asws</sup> back, and to the grave of Muhammad<sup>saww</sup> Your<sup>azwj</sup> servant, and Your<sup>azwj</sup> Rasool<sup>saww</sup>. I<sup>asws</sup> incline my<sup>asws</sup> back and the Qiblah which Your<sup>azwj</sup> were Pleased with Muhammad<sup>saww</sup> have I<sup>asws</sup> turned towards. ",
            "O Allah<sup>azwj</sup>! I<sup>asws</sup> have become such that I<sup>asws</sup> do not possess good for myself<sup>asws</sup> what I<sup>asws</sup> hope for, nor repelling evil what I<sup>asws</sup> am cautious over, and the affairs have come to be in Your<sup>azwj</sup> Hands. Thus, there is no poor one poorer than I<sup>asws</sup> am. <span class=\"ibTxt\"><a href=\"/#/books/quran:28#h24\">[28:24]</a> Surely I stand in need of whatever good You may Send down upon me</span>. O Allah<sup>azwj</sup>! I<sup>asws</sup> intend to be Returned from You<sup>azwj</sup> with goodness, for there is none who can repel Your<sup>azwj</sup> Grace. O Allah<sup>azwj</sup>! I<sup>asws</sup> seek Refuge from my<sup>asws</sup> name being changed, or my<sup>asws</sup> body being altered, or Your<sup>azwj</sup> Bounties to decline from me<sup>asws</sup>. O Allah<sup>azwj</sup>! Be Generous on me<sup>asws</sup> with the piety, and Load upon me<sup>asws</sup> with the Bounties, and Immerse me<sup>asws</sup> in the good health, and Grace me<sup>asws</sup> the thankfulness for the good health’’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash’ariy has narrated from al-Husayn ibn Ali al-Kufiy from Ali ibn Mahziyar from al-Hassan ibn Ali ibn ‘Uthman from Ali ibn al-Husayn ibn abu Talib from Ali ibn Ja’far who has said the following: “Abu al-Hassan Musa, ‘Alayhi al-Salam, has narrated from his father from his grandfather, ‘Alayhi al- Salam, this Hadith. ‘My father, Ali ibn al-Husayn, ‘Alayhi al-Salam, would stand near the grave of the Holy Prophet and offer his Salam, testify to his preaching the messages of Allah and ask Allah for his wishes, as he wanted. He then liked to keep his back against the brightly green stone, which is next to the grave, stay attached to the grave with his back toward it, facing the direction of Ka’bah, and say, “O Allah, I have sought backing and support from You. I have turned my back for support toward the grave of Muhammad, Your servant and Your messenger, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. I have set my back for support and faced the direction, which You chose for Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. O Allah, I do not possess anything good for myself that I can hope for. I am not able to keep away from my soul any evil and wickedness of which I am afraid. All matters are in Your hands. There is no one poorer than I am. I am in dire need of goodness because of what has come upon me. O Allah, return me back with goodness; no one is able to keep away Your favors. O Allah, I seek protection with You against Your changing my name, my body and removal of Your bounties from me. O Allah, honor me with piety, beautify me with bounties, cover me with good health and grant me the opportunity to thank you for good health.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/262)"
        ],
        "index": 8053,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:216:3",
        "text": [
          " قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) كَيْفَ السَّلَامُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عِنْدَ قَبْرِهِ فَقَالَ قُلِ السَّلَامُ عَلَى رَسُولِ اللَّهِ السَّلَامُ عَلَيْكَ يَا حَبِيبَ اللَّهِ السَّلَامُ عَلَيْكَ يَا صَفْوَةَ اللَّهِ السَّلَامُ عَلَيْكَ يَا أَمِينَ اللَّهِ ",
          "أَشْهَدُ أَنَّكَ قَدْ نَصَحْتَ لِأُمَّتِكَ وَ جَاهَدْتَ فِي سَبِيلِ اللَّهِ وَ عَبَدْتَهُ حَتَّى أَتَاكَ الْيَقِينُ فَجَزَاكَ اللَّهُ أَفْضَلَ مَا جَزَى نَبِيّاً عَنْ أُمَّتِهِ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ أَفْضَلَ مَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَ آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘How is the greetings to be upon Rasool-Allah<sup>saww</sup> at his<sup>saww</sup> grave?’ So he<sup>asws</sup> said: ‘Say, ‘The greetings be upon Rasool-Allah<sup>saww</sup>! The greetings be upon you<sup>saww</sup>, O Beloved of Allah<sup>azwj</sup>! The greetings be upon you<sup>saww</sup>, O elite of Allah<sup>azwj</sup>! The greetings be upon you<sup>saww</sup>, O trustworthy one of Allah<sup>azwj</sup>! ",
            "I hereby testify that you<sup>saww</sup> did preach to your<sup>saww</sup> community, and struggled in the Way of Allah<sup>azwj</sup>, and worshipped Him<sup>azwj</sup> until conviction came to you<sup>saww</sup>. So, may Allah<sup>azwj</sup> Recompense you<sup>saww</sup> with the most superior of what He<sup>azwj</sup> would Recompense a Prophet<sup>as</sup> of a community. O Allah<sup>azwj</sup>! Send Blessings upon Muhammad<sup>saww</sup>, and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, Superior than what You<sup>azwj</sup> Blessed upon Ibrahim<sup>as</sup> and the progeny of Ibrahim<sup>as</sup>, You<sup>azwj</sup> being the Praised One, the Glorious’’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr who has said the following: “I asked abu al-Hassan, ‘Alayhi al-Salam, ’How is al-Salam offered to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, near his grave?’ He (the Imam) replied, one should say, ’(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam, and my) submission to (the commandments of) the Messenger of Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O the beloved one to Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O chosen person of Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O trusted person of Allah. I testify that you gave good advice to your followers, strove hard for the cause of Allah and worshipped Him to the time of your death. May Allah grant you the best of reward that He has granted to His prophets for their service to their followers. O Allah, grant salawat (favors and compensation to Muhammad and his family worthy of their services to Your cause), the best of favors and compensations that You have granted to Ibrahim, ‘Alayhi al-Salam, and the family of Ibrahim; You are praiseworthy and glorious.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/263)"
        ],
        "index": 8054,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/727",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/976",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3924",
              "text": "مُحَمَّدِ بْنِ مَسْعُودٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ مَسْعُودٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:216:4",
        "relations": {
          "Mentions": [
            "/books/quran:33:56"
          ]
        },
        "text": [
          " رَأَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) انْتَهَى إِلَى قَبْرِ النَّبِيِّ ( صلى الله عليه وآله ) فَوَضَعَ يَدَهُ عَلَيْهِ وَ قَالَ أَسْأَلُ اللَّهَ الَّذِي اجْتَبَاكَ وَ اخْتَارَكَ وَ هَدَاكَ وَ هَدَى بِكَ أَنْ يُصَلِّيَ عَلَيْكَ ",
          "ثُمَّ قَالَ إِنَّ اللَّهَ وَ مَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَ سَلِّمُوا تَسْلِيماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ahsary, from Al Hassan Bin Ali Al Kufy, from Ali Bin Mahziyar, from Hammad Bin Isa, from Muhammad Bin Masoud who said, ",
            "‘I saw Abu Abdullah<sup>asws</sup> ending up at the grave of the Prophet<sup>saww</sup>. So he<sup>asws</sup> placed his<sup>asws</sup> hand upon it and said, ‘I<sup>asws</sup> ask Allah<sup>azwj</sup> Who Selected you<sup>saww</sup>, and Chose you<sup>saww</sup>, and Guided you<sup>saww</sup>, and Guided (us) through you<sup>saww</sup>, that He<sup>azwj</sup> should Send Blessings upon you<sup>saww</sup>’. ",
            "Then he<sup>asws</sup> said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:33#h56\">[33:56]</a> Surely Allah and His Angels are Sending Blessings upon the Prophet; O you who believe! Send blessings upon him and submit to him with a (complete) submission</span>’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash’ariy has narrated from al-Hassan ibn Ali al-Kufiy from Ali ibn Mahziyar from Hammad ibn ‘Isa from Muhammad ibn Mas’ud who has said the following: “I saw abu ‘ Abd Allah, ‘Alayhi al-Salam, approaching the grave of the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. He placed his hand on the grave and said, I appeal before Allah who chose you, selected you, guided you and guided through you to grant salawat (favors and compensation to you worthy of your services to Allah’s cause). He (the Imam) then said, ’Allah grants salawat and the angels ask for salawat in favor of the Holy Prophet. O believers, you should also ask salawat in favor the Holy Prophet and (declare, affirm and acknowledge that he is a ‘Alayhi al-Salam and your) submission to (commandments of) the Messenger of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/263)"
        ],
        "index": 8055,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3925",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ أَنَّ أَبَا عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ أَنَّ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:216:5",
        "text": [
          " لَهُمْ مُرُّوا بِالْمَدِينَةِ فَسَلِّمُوا عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنْ قَرِيبٍ وَ إِنْ كَانَتِ الصَّلَاةُ تَبْلُغُهُ مِنْ بَعِيدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad, from Hammad Bin Usman, from Is’haq Bin Ammar that, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘It is for them to pass by Al-Medina, so they would greet upon Rasool-Allah<sup>saww</sup> from nearby, even though the Blessings do reach him<sup>saww</sup> from afar’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from Hammad ibn ‘Uthman from Ishaq ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, said to them (Hammad and Ishaq), ‘You should pass by al- Madinah and offer al-Salam to the Messenger of Allah from nearby, although it reaches him from faraway places also.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/263)"
        ],
        "index": 8056,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:216:6",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْمَمَرِّ فِي مُؤَخَّرِ مَسْجِدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ لَا أُسَلِّمُ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ لَمْ يَكُنْ أَبُو الْحَسَنِ ( عليه السلام ) يَصْنَعُ ذَلِكَ قُلْتُ فَيَدْخُلُ الْمَسْجِدَ فَيُسَلِّمُ مِنْ بَعِيدٍ لَا يَدْنُو مِنَ الْقَبْرِ فَقَالَ لَا قَالَ سَلِّمْ عَلَيْهِ حِينَ تَدْخُلُ وَ حِينَ تَخْرُجُ وَ مِنْ بَعِيدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Safwan Bin Yahya who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the passing by at the end of the Masjid of Rasool-Allah<sup>saww</sup> and not greeting upon the Prophet<sup>saww</sup>. So he<sup>asws</sup> said: ‘Abu Al-Hassan<sup>asws</sup> did not happen to do that’. I said, ‘So he<sup>asws</sup> would enter the Masjid, and he<sup>asws</sup> would greet from afar, not approaching the grave?’ So he<sup>asws</sup> said: ‘No, (but) He<sup>asws</sup> said greetings upon him<sup>saww</sup> while entering and when exiting, and from afar’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Safwan ibn Yahya who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about passing behind the Masjid of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, without offering al-Salam to the Holy Prophet. He (the Imam) replied, ’Abu al-Hassan, ‘Alayhi al-Salam, would not do so.’ I then asked, ’Would he enter the Masjid and offer al-Salam without approaching the grave?’ He (the Imam) replied, ‘No, he, however, would offer al-Salam when entering and when leaving (the Masjid) from a distance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/264)"
        ],
        "index": 8057,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/201",
              "text": "فَضَالَةَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/166",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:216:7",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) صَلُّوا إِلَى جَانِبِ قَبْرِ النَّبِيِّ ( صلى الله عليه وآله ) وَ إِنْ كَانَتْ صَلَاةُ الْمُؤْمِنِينَ تَبْلُغُهُ أَيْنَمَا كَانُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Muawiya Bin Wahab who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Send <span class=\"iTxt\">Salawaat</span> by the side of the grave of the Prophet<sup>saww</sup>, and even though the sending of the <span class=\"iTxt\">Salawaat</span> by the Believers reaches him<sup>saww</sup>, from wherever they may happen to be’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from Mu‘awiyah ibn Wahab who has said the following: “Abu ‘Abd Allah, has said, ‘Offer al-Salawat, next to the grave of the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, although Salat of believers reach him wherever they may live. (The word al-Salat in this context may mean, ’Perform salat (prayer) as gift for the Holy Prophet,’ or say, ‘O Allah, grant salawat (favors and compensation to Muhammad and his family worthy of their services to Your cause).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/264)"
        ],
        "index": 8058,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/344",
              "text": "عَلِيِّ بْنِ حَسَّانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/50",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ بَعْضِ أَصْحَابِنَا قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:216:8",
        "text": [
          " حَضَرْتُ أَبَا الْحَسَنِ الْأَوَّلَ ( عليه السلام ) وَ هَارُونَ الْخَلِيفَةَ وَ عِيسَى بْنَ جَعْفَرٍ وَ جَعْفَرَ بْنَ يَحْيَى بِالْمَدِينَةِ قَدْ جَاءُوا إِلَى قَبْرِ النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ هَارُونُ لِأَبِي الْحَسَنِ ( عليه السلام ) تَقَدَّمْ فَأَبَى فَتَقَدَّمَ هَارُونُ فَسَلَّمَ وَ قَامَ نَاحِيَةً ",
          "وَ قَالَ عِيسَى بْنُ جَعْفَرٍ لِأَبِي الْحَسَنِ ( عليه السلام ) تَقَدَّمْ فَأَبَى فَتَقَدَّمَ عِيسَى فَسَلَّمَ وَ وَقَفَ مَعَ هَارُونَ فَقَالَ جَعْفَرٌ لِأَبِي الْحَسَنِ ( عليه السلام ) تَقَدَّمْ فَأَبَى فَتَقَدَّمَ جَعْفَرٌ فَسَلَّمَ وَ وَقَفَ مَعَ هَارُونَ ",
          "وَ تَقَدَّمَ أَبُو الْحَسَنِ ( عليه السلام ) فَقَالَ السَّلَامُ عَلَيْكَ يَا أَبَهْ أَسْأَلُ اللَّهَ الَّذِي اصْطَفَاكَ وَ اجْتَبَاكَ وَ هَدَاكَ وَ هَدَى بِكَ أَنْ يُصَلِّيَ عَلَيْكَ ",
          "فَقَالَ هَارُونُ لِعِيسَى سَمِعْتَ مَا قَالَ قَالَ نَعَمْ فَقَالَ هَارُونُ أَشْهَدُ أَنَّهُ أَبُوهُ حَقّاً"
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Hassan, from one of our companions who said, ",
            "‘I was present with Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> (7<sup>th</sup> Imam<sup>asws</sup>), and Haroun (Al Rasheed) the Caliph, and Isa Bin Ja’far, and Ja’far Bin Yahya, at Al-Medina, and they had come to the grave of the Prophet<sup>saww</sup>. So Haroun said to Abu Al-Hassan<sup>asws</sup>, ‘Proceed!’ But, he<sup>asws</sup> refused. So Haroun proceeded and greeted, and stood nearby. ",
            "And Isa Bin ja’far said to Abu Al Hassan<sup>asws</sup>, ‘Proceed’. But he<sup>asws</sup> refused. So Isa proceeded and greeted, and paused alongside Haroun. So Ja’far said to Abu Al-Hassan<sup>asws</sup>, ‘Proceed’. But he<sup>asws</sup> refused. So Ja’far proceeded and paused alongside Haroun.",
            "And Abu Al-Hassan<sup>asws</sup> proceeded, so he<sup>asws</sup> said: ‘The greetings be upon you<sup>saww</sup>, O father<sup>saww</sup>! I<sup>asws</sup> ask Allah<sup>azwj</sup> Who Chose you<sup>saww</sup>, and Appointed you<sup>saww</sup>, and Guided you<sup>saww</sup>, and Guided through you<sup>saww</sup>, that He<sup>azwj</sup> should Send Blessings upon you<sup>saww</sup>’. ",
            "So Haroun said to Isa, ‘Did you hear what he<sup>asws</sup> said?’ He said, ‘Yes’. So Haroun said, ‘I testify that he<sup>saww</sup> is his<sup>asws</sup> father<sup>saww</sup>, truly’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Hassan from certain individuals of our people who have said the following: “I was present when abu al-Hassan the 1st, Harun, the Caliph, ‘Isa ibn Ja’far and Ja’far ibn Yahya came to al-Madinah to visit the grave of the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. Harun said to abu al-Hassan, ‘Alayhi al-Salam, ‘You go first.’ He (the Imam) abstained. Harun then moved forward, offered al- Salam and then moved to one side. ‘Isa ibn Ja’far then said to abu al-Hassan, ‘Alayhi al-Salam, ‘You go first.’ He (the Imam) abstained. ‘Isa then moved forward and offered al-Salam and then moved to one side alongside Harun. Ja’far then said to abu al-Hassan, ‘Alayhi al-Salam, ‘You go first.’ He (the Imam) abstained. Ja’far then moved forward, offered al-Salam, and then moved to one side alongside Harun. Abu al-Hassan, ‘Alayhi al-Salam, then moved forward and said, ‘(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O my father. I appeal before Allah, who chose you, selected you, guided you and guided through you to grant salawat (favors and compensation to you worthy of Your services to Allah’s cause).’ Harun said to ‘Isa, ‘Did you hear what he said?’ He replied, ‘Yes, I heard what he said.’ Harun then said, ‘I testify that he (the Messenger of Allah) is indeed his father.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:216",
  "kind": "verse_list"
}