{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 217"
        },
        "path": "/books/al-kafi:4:3:217",
        "titles": {
          "ar": "بَابُ الْمِنْبَرِ وَ الرَّوْضَةِ وَ مَقَامِ النَّبِيِّ ( صلى الله عليه وآله )",
          "en": "Chapter 217 – The Pulpit, and the garden, and place of the Prophet<sup>saww</sup>"
        }
      }
    ],
    "index": 1160,
    "local_index": 217,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 218"
        },
        "path": "/books/al-kafi:4:3:218",
        "titles": {
          "ar": "بَابُ مَقَامِ جَبْرَئِيلَ ( عليه السلام )",
          "en": "Chapter 218 – Standing Place of Jibraeel<sup>as</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 216"
        },
        "path": "/books/al-kafi:4:3:216",
        "titles": {
          "ar": "بَابُ دُخُولِ الْمَدِينَةِ وَ زِيَارَةِ النَّبِيِّ ( صلى الله عليه وآله ) وَ الدُّعَاءِ عِنْدَ قَبْرِهِ",
          "en": "Chapter 216 – Entering Al-Medina and Ziyarah of the Prophet<sup>saww</sup>, and the supplication at his<sup>saww</sup> grave"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:217",
    "titles": {
      "ar": "بَابُ الْمِنْبَرِ وَ الرَّوْضَةِ وَ مَقَامِ النَّبِيِّ ( صلى الله عليه وآله )",
      "en": "Chapter 217 – The Pulpit, and the garden, and place of the Prophet<sup>saww</sup>"
    },
    "verse_count": 14,
    "verse_start_index": 8058,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/265)"
        ],
        "index": 8059,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/143",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:1",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا فَرَغْتَ مِنَ الدُّعَاءِ عِنْدَ قَبْرِ النَّبِيِّ ( صلى الله عليه وآله ) فَائْتِ الْمِنْبَرَ فَامْسَحْهُ بِيَدِكَ وَ خُذْ بِرُمَّانَتَيْهِ وَ هُمَا السُّفْلَاوَانِ وَ امْسَحْ عَيْنَيْكَ وَ وَجْهَكَ بِهِ فَإِنَّهُ يُقَالُ إِنَّهُ شِفَاءُ الْعَيْنِ ",
          "وَ قُمْ عِنْدَهُ فَاحْمَدِ اللَّهَ وَ أَثْنِ عَلَيْهِ وَ سَلْ حَاجَتَكَ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ مَا بَيْنَ مِنْبَرِي وَ بَيْتِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ وَ مِنْبَرِي عَلَى تُرْعَةٍ مِنْ تُرَعِ الْجَنَّةِ وَ التُّرْعَةُ هِيَ الْبَابُ الصَّغِيرُ ",
          "ثُمَّ تَأْتِي مَقَامَ النَّبِيِّ ( صلى الله عليه وآله ) فَتُصَلِّي فِيهِ مَا بَدَا لَكَ فَإِذَا دَخَلْتَ الْمَسْجِدَ فَصَلِّ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ إِذَا خَرَجْتَ فَاصْنَعْ مِثْلَ ذَلِكَ وَ أَكْثِرْ مِنَ الصَّلَاةِ فِي مَسْجِدِ الرَّسُولِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr and Safwan Bin yahya, from Muawiya Bin Ammar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When you are free from the supplication by the grave of the Prophet<sup>saww</sup>, then go to the Pulpit and wipe it with your hand, and grab its two pomegranates, and they are both ceramic, and wipe your eyes and your face with it, for it is said that it is a healing for the eyes. ",
            "And stand by it, so Praise Allah<sup>azwj</sup> and Extoll upon Him<sup>azwj</sup>, and ask your need, for Rasool-Allah<sup>saww</sup> said: ‘What is between my<sup>as</sup> Pulpit and my<sup>saww</sup> house, there is a garden from the Gardens of the Paradise, and my<sup>saww</sup> Pulpit is a channel from the channels of the Paradise, and the channel, it is the small door.",
            "Then go to the place of the Prophet<sup>saww</sup>, and Pray <span class=\"iTxt\">Salaat</span> therein whatever come to you. So when you enter the Masjid, then send Blessings upon the Prophet<sup>saww</sup>. And when you exit, so do similar to that, and frequent from the Praying of <span class=\"iTxt\">Salaat</span> in the Masjid of the Rasool-Allah<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il from af-Fadf ibn Shadhan from ibn abu ‘Umayr and Safwan ibn Yahya from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, once said to me, ‘When you complete your prayer near the grave of the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, then go to the pulpit. You should touch it with your hand, hold the two pomegranates, which are made of ceramic materials and wipe your hand over your eyes and face. It is said that it is cure for the eyes. Then stand up near the pulpit, thank and praise Allah and ask for your wishes. The Messenger of Allah has said, “Between my pulpit and my house there is a garden of the gardens of paradise and my pulpit is a Tur‘ah (passage) of the passage of paradise.” Al-Tur‘a is a small door. Thereafter you should go to the station of the Holy Prophet, perform salat (prayer) as much as you like. When you enter the Masjid, then say, “O Allah, grant salawat (favors and compensation to Muhammad and his family worthy of their services to Your cause). When you leave do as you just had done. In the Masjid of the Messenger of Allah, perform as many salat (prayer) as you can.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/265)"
        ],
        "index": 8060,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/166",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:2",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَمَّا كَانَ سَنَةُ إِحْدَى وَ أَرْبَعِينَ أَرَادَ مُعَاوِيَةُ الْحَجَّ فَأَرْسَلَ نَجَّاراً وَ أَرْسَلَ بِالْآلَةِ وَ كَتَبَ إِلَى صَاحِبِ الْمَدِينَةِ أَنْ يَقْلَعَ مِنْبَرَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ يَجْعَلُوهُ عَلَى قَدْرِ مِنْبَرِهِ بِالشَّامِ فَلَمَّا نَهَضُوا لِيَقْلَعُوهُ انْكَسَفَتِ الشَّمْسُ وَ زُلْزِلَتِ الْأَرْضُ فَكَفُّوا وَ كَتَبُوا بِذَلِكَ إِلَى مُعَاوِيَةَ فَكَتَبَ عَلَيْهِمْ يَعْزِمُ عَلَيْهِمْ لَمَّا فَعَلُوهُ فَفَعَلُوا ذَلِكَ فَمِنْبَرُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الْمَدْخَلُ الَّذِي رَأَيْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Muawiya Bin Wahab who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When it was the year forty one, Muawiya intended the Hajj. So he sent carpenters and sent the tools, and wrote to the governor of Al-Medina that he should get rid of the Pulpit of Rasool-Allah<sup>saww</sup> and make it to be upon a measurement of his own pulpit which was in Syria.  So, when they got ready to get rid of it, the sun eclipsed and the ground shook.  So, they refrained and wrote about that to Muawiya. So he wrote back to them, stressing upon them to what they should be doing. So they did that, and the Pulpit of Rasool-Allah<sup>saww</sup> is (today) the entrance which one can see’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Mu‘awiyah ibn Wahab who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘In the year forty-one Mu‘awiyah decided to perform al-Hajj. He sent certain carpenters with tools with orders to the governor of al-Madinah to remove the pulpit of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and position it in place of his pulpit in Damascus. When they began to remove the pulpit, a sun eclipse took place and the earth began to shake. They stopped the work and wrote about it to Mu‘awiyah. He wrote back and urged them to do what they were ordered to do before. They then complied with the order and today the pulpit of the Messenger of Allah is the opening that you can see.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/266)"
        ],
        "index": 8061,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/153",
              "text": "جَمِيلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/697",
              "text": "أَبِي بَكْرٍ الْحَضْرَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ جَمِيلٍ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:3",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا بَيْنَ بَيْتِي وَ مِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ وَ مِنْبَرِي عَلَى تُرْعَةٍ مِنْ تُرَعِ الْجَنَّةِ وَ قَوَائِمُ مِنْبَرِي رُبَّتْ فِي الْجَنَّةِ ",
          "قَالَ قُلْتُ هِيَ رَوْضَةُ الْيَوْمِ قَالَ نَعَمْ إِنَّهُ لَوْ كُشِفَ الْغِطَاءُ لَرَأَيْتُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Jameel, from Abu Bakr Al Hazramy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘In what is between my<sup>saww</sup> house and my<sup>saww</sup> Pulpit, there is a Garden from the Gardens of the Paradise, and my<sup>saww</sup> Pulpit is upon a channel from the channels of the Paradise, and the legs of my<sup>saww</sup> Pulpit were grown in the Paradise’. ",
            "He (the narrator) said, ‘I said, ‘Is it a Garden today?’ He<sup>asws</sup> said: ‘Yes, if the cover is removed, you would see it’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from, Ahmad ibn Muhammad from ibn Faddal from Jamil from abu Bakr af-Hadramiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Between my house and my pulpit there is a garden of the gardens of paradise. My pulpit is on a passageway of the passageways of paradise. The legs of my pulpit had grown in paradise.’ I (the narrator) asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Is it a garden today?’ He (the Imam) replied, ‘Yes, it is a garden today. If the curtain is removed, you can see it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/266)"
        ],
        "index": 8062,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/105",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:4",
        "text": [
          " سَأَلْتُهُ عَنْ حَدِّ مَسْجِدِ الرَّسُولِ ( صلى الله عليه وآله ) فَقَالَ الْأُسْطُوَانَةُ الَّتِي عِنْدَ رَأْسِ الْقَبْرِ إِلَى الْأُسْطُوَانَتَيْنِ مِنْ وَرَاءِ الْمِنْبَرِ عَنْ يَمِينِ الْقِبْلَةِ وَ كَانَ مِنْ وَرَاءِ الْمِنْبَرِ طَرِيقٌ تَمُرُّ فِيهِ الشَّاةُ وَ يَمُرُّ الرَّجُلُ مُنْحَرِفاً وَ كَانَ سَاحَةُ الْمَسْجِدِ مِنَ الْبَلَاطِ إِلَى الصَّحْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim who said, ",
            "‘I asked him<sup>asws</sup> about the boundary of the Masjid of the Rasool<sup>saww</sup>, so he<sup>asws</sup> said: ‘The pillar which is by the head of the grave, up to the two pillars from behind the Pulpit from the right of the Qiblah; and it was so from behind the Pulpit there was a passageway which the sheep could pass through, and the man could pass through sideways, and the tiles of the Masjid were from Al-Balaat (a place), up to the courtyard’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn, from Safwan ibn Yahya from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has narrated the following in a Mudmar manner: “I once asked him (the Imam), ‘Alayhi al-Salam, about the limits of the Masjid of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. He (the Imam) replied, ‘It is from the pillar near the head of the grave to the two pillars behind the pulpit from the right side of the direction of Ka‘bah. Behind the pulpit there is a passageway through which a sheep or man can pass obliquely. The courtyard of the Masjid was tiled with al-Balat (name of a place in al-Madinah) stones.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/267)"
        ],
        "index": 8063,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/589",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/46",
              "text": "عَلِيِّ بْنِ حَدِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/313",
              "text": "مُرَازِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ مُرَازِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:5",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَمَّا يَقُولُ النَّاسُ فِي الرَّوْضَةِ فَقَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِيمَا بَيْنَ بَيْتِي وَ مِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ وَ مِنْبَرِي عَلَى تُرْعَةٍ مِنْ تُرَعِ الْجَنَّةِ ",
          "فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ فَمَا حَدُّ الرَّوْضَةِ فَقَالَ بُعْدُ أَرْبَعِ أَسَاطِينَ مِنَ الْمِنْبَرِ إِلَى الظِّلَالِ فَقُلْتُ جُعِلْتُ فِدَاكَ مِنَ الصَّحْنِ فِيهَا شَيْ‏ءٌ قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Hadeed, from Muraam who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about what the people were saying regarding the Garden. So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘In what is between my<sup>saww</sup> house and my<sup>saww</sup> Pulpit, there is a Garden from the Gardens of the Paradise, and my<sup>saww</sup> Pulpit is upon a channel from the channels of the Paradise’. ",
            "So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! So what is the boundary of the Garden?’ So he<sup>asws</sup> said: ‘A distance of four pillars from the Pulpit up to the shaded area’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! Is there anything from the courtyard in it?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "5. Ahmad ibn Muhammad has narrated from Ali ibn Hadid from Murazim who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about al-Rawdah (garden) which people speak of. He (the Imam) said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “Between my house and my pulpit is a garden of the gardens of paradise. My pulpit is a passageway of the passageways of paradise.’” I (the narrator) then asked, ‘I pray to Allah to keep my soul in service for your cause, what are the limits of al-Rawdah?’ He (the Imam) replied, ‘It is four pillars away from the pulpit to the Shadows.’ I then asked, ‘I pray to Allah to keep my soul in service for your cause, is any part of the courtyard in it (al-Rawdah)?’ He (the Imam) replied, ‘No part of the courtyard is in it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/267)"
        ],
        "index": 8064,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/359",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/259",
              "text": "عَلِيِّ بْنِ النُّعْمَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/260",
              "text": "عَبْدِ اللَّهِ بْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:6",
        "text": [
          " حَدُّ الرَّوْضَةِ فِي مَسْجِدِ الرَّسُولِ ( صلى الله عليه وآله ) إِلَى طَرَفِ الظِّلَالِ وَ حَدُّ الْمَسْجِدِ إِلَى الْأُسْطُوَانَتَيْنِ عَنْ يَمِينِ الْمِنْبَرِ إِلَى الطَّرِيقِ مِمَّا يَلِي سُوقَ اللَّيْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Ali Bin Al Nu’man, from Abdullah Bin Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A boundary of the Garden in the Masjid of Rasool<sup>saww</sup> is up to the side of the shaded area, and a boundary of the Masjid is up to the two pillars from the right of the Pulpit up to the street from what follows the night market’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn Isma‘il from Ali ibn al-Nu’man from ‘Abd Allah ibn Muskan from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the limit of al-Rawdah in the Masjid of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, is to the edge of the shadows. The limit of the Masjid is up to two pillars from the right side of the pulpit up to the pathway in front of the night Suq (market).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/267)"
        ],
        "index": 8065,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/604",
              "text": "عَلِيِّ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2748",
              "text": "مُحَمَّدِ بْنِ عَمْرِو بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/346",
              "text": "مُوسَى بْنِ بَكْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/392",
              "text": "عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ سَعِيدٍ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:7",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) كَمْ كَانَ مَسْجِدُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ كَانَ ثَلَاثَةَ آلَافٍ وَ سِتَّمِائَةِ ذِرَاعٍ مُكَسَّراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Ismail, from Muhammad Bin Amro Bin Saeed, from Musa Bin Bakr, from Abdul A’ala, a slave of the progeny of Saam who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘How much was the Masjid of Rasool-Allah<sup>saww</sup>?’ He<sup>asws</sup> said: ‘It was of three thousand and six hundred cubits, broken (squared)’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Isma‘il from Muhammad ibn ‘Amr ibn Sa‘id from Musa ibn Bakr from ‘Abd al-‘A’la’ Mawla ale Sam who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘What was the area of the Masjid of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause?’ He (the Imam) replied, ‘It was three thousand six hundred square yards.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/267)"
        ],
        "index": 8066,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/166",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:8",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) هَلْ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا بَيْنَ بَيْتِي وَ مِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ فَقَالَ نَعَمْ",
          "وَ قَالَ بَيْتُ عَلِيٍّ وَ فَاطِمَةَ ( عليهما السلام ) مَا بَيْنَ الْبَيْتِ الَّذِي فِيهِ النَّبِيُّ ( صلى الله عليه وآله ) إِلَى الْبَابِ الَّذِي يُحَاذِي الزُّقَاقَ إِلَى الْبَقِيعِ قَالَ فَلَوْ دَخَلْتَ مِنْ ذَلِكَ الْبَابِ وَ الْحَائِطُ مَكَانَهُ أَصَابَ مَنْكِبَكَ الْأَيْسَرَ ثُمَّ سَمَّى سَائِرَ الْبُيُوتِ وَ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الصَّلَاةُ فِي مَسْجِدِي تَعْدِلُ أَلْفَ صَلَاةٍ فِي غَيْرِهِ إِلَّا الْمَسْجِدَ الْحَرَامَ فَهُوَ أَفْضَلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al hakam, from Muawiya Bin Wahab who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Did Rasool-Allah<sup>saww</sup> say: ‘In what is between my<sup>saww</sup> house and my<sup>saww</sup> Pulpit, there is a garden from the Gardens of the Paradise?’ He<sup>asws</sup> said: ‘Yes’.",
            "And he<sup>asws</sup> said: ‘The house of Ali<sup>asws</sup> and Fatima<sup>asws</sup> is between the house in which is the Prophet<sup>saww</sup> up to the door which is adjacent to the alleyway up to Al-Baqi’e. So if you were to enter from that door, and the wall, its place would be on your right shoulder’. Then he<sup>asws</sup> named the rest of the houses, and said, ‘Rasool-Allah<sup>saww</sup> said: ‘The <span class=\"iTxt\">Salaat</span> in my<sup>saww</sup> Masjid equates to a thousand <span class=\"iTxt\">Salaats</span> elsewhere, except for the Sacred Masjid, for it is superior’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Mu‘awiyah ibn Wahab who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Did the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, say, “Between my house and my pulpit is a garden of the gardens of paradise?”’ He (the Imam) replied, ‘Yes, he did say so.’ He (the Imam) then said, ‘The house of Ali and Fatimah, ‘Alayhim al-Salam, is between the house of the Holy Prophet and the door which is parallel to the alley toward al-Baqi‘.’ He (the Imam) said, ‘If you enter through that door, the wall is on the side of your left shoulder.’ He (the Imam) them mentioned other houses and said, ‘The Messenger of Allah has said, “Performing salat (prayer) in my Masjid is equal to one thousand salat (prayer) in other places except Masjid al-Haram (the Sacred Masjid) where it is more virtuous.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/268)"
        ],
        "index": 8067,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/61",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/64",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3926",
              "text": "الْقَاسِمِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْقَاسِمِ بْنِ سَالِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:9",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا دَخَلْتَ مِنْ بَابِ الْبَقِيعِ فَبَيْتُ عَلِيٍّ صَلَوَاتُ اللَّهِ عَلَيْهِ عَلَى يَسَارِكَ قَدْرَ مَمَرِّ عَنْزٍ مِنَ الْبَابِ وَ هُوَ إِلَى جَانِبِ بَيْتِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ بَابَاهُمَا جَمِيعاً مَقْرُونَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washa, and a number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad, altogether from Hammad Bin Usman, from Al Qasim Bin Salim who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When you enter from the door of Al-Baqie, so the house of Ali<sup>asws</sup> would be upon your left of a measurement of a passageway of a goat from the door, and it is to the side of the house of Rasool-Allah<sup>saww</sup>, and both of the doors are paired together’."
          ],
          "en.sarwar": [
            "9. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali al-Washsha’ and a number of our people from Sahl ibn Ziyad from Ahmad ibn Muhammad all from Hammad ibn ‘Uthman from al-Qasim ibn Salim who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘If you enter (the Masjid of the Holy Prophet) through the door of al-Baqi‘, the house of Ali, ‘Alayhi al-Salam, is on your left side, a goat’s passage away from the door. It is by the side of the house of the Messenger of Allah. The doors of both houses are close by.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/268)"
        ],
        "index": 8068,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1119",
              "text": "سَهْلُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/124",
              "text": "جَمِيلِ بْنِ دَرَّاجٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلُ بْنُ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ جَمِيلِ بْنِ دَرَّاجٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:10",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا بَيْنَ مِنْبَرِي وَ بُيُوتِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ وَ مِنْبَرِي عَلَى تُرْعَةٍ مِنْ تُرَعِ الْجَنَّةِ وَ صَلَاةٌ فِي مَسْجِدِي تَعْدِلُ أَلْفَ صَلَاةٍ فِيمَا سِوَاهُ مِنَ الْمَسَاجِدِ إِلَّا الْمَسْجِدَ الْحَرَامَ ",
          "قَالَ جَمِيلٌ قُلْتُ لَهُ بُيُوتُ النَّبِيِّ ( صلى الله عليه وآله ) وَ بَيْتُ عَلِيٍّ مِنْهَا قَالَ نَعَمْ وَ أَفْضَلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Ahmad Bin Muhammad, from Hammad Bin Usman, from Jameel Bin Darraj who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> said: ‘In what is between my<sup>saww</sup> Pulpit and my<sup>saww</sup> houses, there is a Garden from the Gardens of the Paradise, and my<sup>saww</sup> Pulpit is upon a channel from the channels of the Paradise, and a <span class=\"iTxt\">Salaat</span> (performed) in my<sup>saww</sup> Masjid equates to a thousand <span class=\"iTxt\">Salaats</span> (performed) in what is besides from the Masjids, except for the ‘الْمَسْجِدَ الْحَرَامَ’ Sacred Masjid’. ",
            "Jameel said, ‘I said to him<sup>asws</sup>, ‘The houses of the Prophet<sup>saww</sup> and the house of Ali<sup>asws</sup> are from it?’ He<sup>asws</sup> said: ‘Yes, and superior (to it)’."
          ],
          "en.sarwar": [
            "10. Sahl ibn Ziyad has narrated from Ahmad ibn Muhammad from Hammad ibn ‘Uthman from Jamil ibn Darraj who has said the following: “I heard abu ‘ Abd Allah, ‘Alayhi al-Salam, say, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “Between my pulpit and my houses is a garden of the gardens of paradise and my pulpit is a passageway of the passageways of paradise. Performing one salat (prayer) in my Masjid is equal to one thousand salat (prayer) in other Masjids except Masjid al-Haram (the Sacred Masjid).’ Jamil has said, ‘I then asked, is the house of Ali, ‘Alayhi al-Salam, of the houses of the Holy Prophet?’ He (the Imam) replied, ‘Yes, it is. In fact it is the best of them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/268)"
        ],
        "index": 8069,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/627",
              "text": "أَبِي سَلَمَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/884",
              "text": "هَارُونَ بْنِ خَارِجَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي سَلَمَةَ عَنْ هَارُونَ بْنِ خَارِجَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:11",
        "text": [
          " الصَّلَاةُ فِي مَسْجِدِ الرَّسُولِ ( صلى الله عليه وآله ) تَعْدِلُ عَشَرَةَ آلَافِ صَلَاةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abu Salma, from Haroun Bin Kharjat, ",
            "‘He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Salaat</span> prayed in the Masjid of the Rasool<sup>saww</sup> equates to ten thousand <span class=\"iTxt\">Salaats (performed elsewhere)</span>’."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from abu Salmah from Harun ibn Kharijah who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘Performing salat (prayer) in the Masjid of the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, is equal to ten thousand salat (prayer).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/268)"
        ],
        "index": 8070,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/589",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/359",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/783",
              "text": "أَبِي إِسْمَاعِيلَ السَّرَّاجِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/224",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3927",
              "text": "أَبِي الصَّامِتِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي الصَّامِتِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:12",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) صَلَاةٌ فِي مَسْجِدِ النَّبِيِّ ( صلى الله عليه وآله ) تَعْدِلُ بِعَشَرَةِ آلَافِ صَلَاةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Abu Ismail Al Sarraj, from Ibn Muskan, from Abu Al Saamit who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘A <span class=\"iTxt\">Salaat</span> prayed in the Masjid of the Prophet<sup>saww</sup> equates with ten thousand <span class=\"iTxt\">Salaats</span>’."
          ],
          "en.sarwar": [
            "12. Ahmad ibn Muhammad has narrated from Muhammad ibn Isma‘il al-Sarraj from ibn Muskan from abu al-Samit who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Performing salat (prayer) in the Masjid of the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, is equal to ten thousand salat (prayer).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/269)"
        ],
        "index": 8071,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/580",
              "text": "يُونُسَ بْنِ يَعْقُوبَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:13",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الصَّلَاةُ فِي بَيْتِ  فَاطِمَةَ ( عليها السلام ) أَفْضَلُ أَوْ فِي الرَّوْضَةِ قَالَ فِي بَيْتِ  فَاطِمَةَ ( عليها السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Yunus Bin Yaqoub who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Is the <span class=\"iTxt\">Salaat</span> prayed in the house of Syeda Fatima<sup>asws</sup> superior or if prayed in the Garden?’ He<sup>asws</sup> said: ‘(The one prayed) in the house of Syeda Fatima<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from Yunus ibn Ya’qub who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Is performing salat (prayer) in the house of Fatimah, ‘Alayha al-Salam, more virtuous or in al-Rawdah?’ He (the Imam) replied, ‘Performing salat (prayer) in the house of Fatimah, ‘Alayha al-Salam, is more virtuous.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/269)"
        ],
        "index": 8072,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/816",
              "text": "أَيُّوبَ بْنِ نُوحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/219",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/124",
              "text": "جَمِيلِ بْنِ دَرَّاجٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَيُّوبَ بْنِ نُوحٍ عَنْ صَفْوَانَ وَ ابْنِ أَبِي عُمَيْرٍ وَ غَيْرِ وَاحِدٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:217:14",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الصَّلَاةُ فِي بَيْتِ  فَاطِمَةَ ( عليها السلام ) مِثْلُ الصَّلَاةِ فِي الرَّوْضَةِ قَالَ وَ أَفْضَلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ayoub Bin Nuh, from Safwan, and Ibn Abu Umeyr, and someone else, from Jameel Bin Darraj who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The <span class=\"iTxt\">Salaat</span> prayed in the house of Syeda Fatima<sup>asws</sup> is similar to the <span class=\"iTxt\">Salaat</span> in the garden?’ He<sup>asws</sup> said: ‘And superior (than it)’."
          ],
          "en.sarwar": [
            "14. A number of our people have narrated from Sahl ibn Ziyad from Ayyub ibn Nuh from Safwan and ibn abu ‘Umayr and more than one of the others from Jamil ibn Darraj who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Is performing salat (prayer) in the house of Fatimah, ‘Alayha al-Salam, like performing salat (prayer) in al-Rawdah?’ He (the Imam) replied, ‘It is more virtuous.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:217",
  "kind": "verse_list"
}