{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 22"}, "path": "/books/al-kafi:4:3:22", "titles": {"ar": "بَابُ لُقَطَةِ الْحَرَمِ", "en": "Chapter 22 – The findings (lost property) of the Al-Harram"}}], "index": 965, "local_index": 22, "part_type": "Chapter", "path": "/books/al-kafi:4:3:22", "titles": {"ar": "بَابُ لُقَطَةِ الْحَرَمِ", "en": "Chapter 22 – The findings (lost property) of the Al-Harram"}, "verse_count": 4, "verse_start_index": 6792, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6793, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:22:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) اللُّقَطَةُ لُقَطَتَانِ لُقَطَةُ الْحَرَمِ تُعَرِّفُ سَنَةً فَإِنْ وَجَدْتَ صَاحِبَهَا وَ إِلَّا تَصَدَّقْتَ بِهَا وَ لُقَطَةُ غَيْرِهَا تُعَرِّفُ سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَ إِلَّا فَهِيَ كَسَبِيلِ مَالِكَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘The findings are of two (types of) findings. A finding of the Al-Harram would be publicised for a year. So if its owner is found, or else it should be given in charity with it; and a finding somewhere else would be publicised for a year. So if its owner comes up, or else it would be like part of your wealth’."]}}, {"index": 6794, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:22:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ فُضَيْلِ بْنِ يَسَارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَجِدُ اللُّقَطَةَ فِي الْحَرَمِ قَالَ لَا يَمَسَّهَا وَ أَمَّا أَنْتَ فَلَا بَأْسَ لِأَنَّكَ تُعَرِّفُهَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Fuzayl Bin Yasaar wo said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the man who found the lost property inside the Al-Harram. He<sup>asws</sup> said: ‘He should not touch it, and as for you, so there is no problem if you were to (take it and) publicise it’."]}}, {"index": 6795, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:22:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ فُضَيْلِ بْنِ غَزْوَانَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ الطَّيَّارُ إِنِّي وَجَدْتُ دِينَاراً فِي الطَّوَافِ قَدِ انْسَحَقَ كِتَابَتُهُ فَقَالَ هُوَ لَهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Fuzayl Bin Azran who said, ", "‘I was in the presence of Abu Abdullah<sup>asws</sup>, so Al-Tayyar said to him<sup>asws</sup>, ‘I found one Dinar during the circumambulation whose writing had been obscured’. So he<sup>asws</sup> said: ‘It would be for him’."]}}, {"index": 6796, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:22:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ رَجَاءٍ الْأَرَّجَانِيِّ قَالَ كَتَبْتُ إِلَى الطَّيِّبِ ( عليه السلام ) أَنِّي كُنْتُ فِي الْمَسْجِدِ الْحَرَامِ فَرَأَيْتُ دِينَاراً فَأَهْوَيْتُ إِلَيْهِ لآِخُذَهُ فَإِذَا أَنَا بِآخَرَ ثُمَّ بَحَثْتُ الْحَصَى فَإِذَا أَنَا بِثَالِثٍ فَأَخَذْتُهَا فَعَرَّفْتُهَا فَلَمْ يَعْرِفْهَا أَحَدٌ فَمَا تَرَى فِي ذَلِكَ فَكَتَبَ فَهِمْتُ مَا ذَكَرْتَ مِنْ أَمْرِ الدَّنَانِيرِ فَإِنْ كُنْتَ مُحْتَاجاً فَتَصَدَّقْ بِثُلُثِهَا وَ إِنْ كُنْتَ غَنِيّاً فَتَصَدَّقْ بِالْكُلِّ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Muhammad Bin Raja’a Al Arjany who said, ", "‘I wrote to Al-Tayyib<sup>asws</sup> (8<sup>th</sup> Imam<sup>asws</sup>), ‘I was in the Sacred Masjid, so I saw one Dinar. So I bent down to take it, and there was another one. So I looked around in the gravel, so there was a third one. So I took these and publicised them, but no one recognised them (as being theirs). So what is your<sup>asws</sup> view regarding that?’ So he<sup>asws</sup> wrote, ‘I<sup>asws</sup> understood what you mentioned from the matter of the Dinars. So if you were in need, then give in charity with a third of it, but if you are needless, so give in charity with all of them’."]}}]}, "index": "al-kafi:4:3:22", "kind": "verse_list"}