{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 220"
        },
        "path": "/books/al-kafi:4:3:220",
        "titles": {
          "ar": "بَابُ زِيَارَةِ مَنْ بِالْبَقِيعِ",
          "en": "Chapter 220 – Ziyarah of the ones at Al Baqi’e"
        }
      }
    ],
    "index": 1163,
    "local_index": 220,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:220",
    "titles": {
      "ar": "بَابُ زِيَارَةِ مَنْ بِالْبَقِيعِ",
      "en": "Chapter 220 – Ziyarah of the ones at Al Baqi’e"
    },
    "verse_count": 1,
    "verse_start_index": 8078,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موقوف مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/272)"
        ],
        "index": 8079,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:220:1",
        "text": [
          "إِذَا أَتَيْتَ الْقَبْرَ الَّذِي بِالْبَقِيعِ فَاجْعَلْهُ بَيْنَ يَدَيْكَ ثُمَّ تَقُولُ السَّلَامُ عَلَيْكُمْ أَئِمَّةَ الْهُدَى السَّلَامُ عَلَيْكُمْ أَهْلَ التَّقْوَى السَّلَامُ عَلَيْكُمُ الْحُجَّةَ عَلَى أَهْلِ الدُّنْيَا السَّلَامُ عَلَيْكُمُ الْقُوَّامَ فِي الْبَرِيَّةِ بِالْقِسْطِ السَّلَامُ عَلَيْكُمْ أَهْلَ الصَّفْوَةِ السَّلَامُ عَلَيْكُمْ أَهْلَ النَّجْوَى",
          "أَشْهَدُ أَنَّكُمْ قَدْ بَلَّغْتُمْ وَ نَصَحْتُمْ وَ صَبَرْتُمْ فِي ذَاتِ اللَّهِ وَ كُذِّبْتُمْ وَ أُسِي‏ءَ إِلَيْكُمْ فَعَفَوْتُمْ وَ أَشْهَدُ أَنَّكُمُ الْأَئِمَّةُ الرَّاشِدُونَ الْمَهْدِيُّونَ وَ أَنَّ طَاعَتَكُمْ مَفْرُوضَةٌ وَ أَنَّ قَوْلَكُمُ الصِّدْقُ وَ أَنَّكُمْ دَعَوْتُمْ فَلَمْ تُجَابُوا وَ أَمَرْتُمْ فَلَمْ تُطَاعُوا",
          "وَ أَنَّكُمْ دَعَائِمُ الدِّينِ وَ أَرْكَانُ الْأَرْضِ وَ لَمْ تَزَالُوا بِعَيْنِ اللَّهِ يَنْسَخُكُمْ فِي أَصْلَابِ كُلِّ مُطَهَّرٍ وَ يَنْقُلُكُمْ فِي أَرْحَامِ الْمُطَهَّرَاتِ لَمْ تُدَنِّسْكُمُ الْجَاهِلِيَّةُ الْجَهْلَاءُ وَ لَمْ تَشْرَكْ فِيكُمْ فِتَنُ الْأَهْوَاءِ طِبْتُمْ وَ طَابَ مَنْبِتُكُمْ",
          "مَنَّ بِكُمْ عَلَيْنَا دَيَّانُ الدِّينِ فَجَعَلَكُمْ فِي بُيُوتٍ أَذِنَ اللَّهُ أَنْ تُرْفَعَ وَ يُذْكَرَ فِيهَا اسْمُهُ وَ جَعَلَ صَلَوَاتِنَا عَلَيْكُمْ رَحْمَةً لَنَا وَ كَفَّارَةً لِذُنُوبِنَا إِذَا اخْتَارَكُمْ لَنَا وَ طَيَّبَ خَلْقَنَا بِمَا مَنَّ بِهِ عَلَيْنَا مِنْ وَلَايَتِكُمْ وَ كُنَّا عِنْدَهُ مُسَمَّيْنَ بِفَضْلِكُمْ مُعْتَرِفِينَ بِتَصْدِيقِنَا",
          "إِيَّاكُمْ وَ هَذَا مَقَامُ مَنْ أَسْرَفَ وَ أَخْطَأَ وَ اسْتَكَانَ وَ أَقَرَّ بِمَا جَنَى وَ رَجَا بِمَقَامِهِ الْخَلَاصَ وَ أَنْ يَسْتَنْقِذَهُ بِكُمْ مُسْتَنْقِذُ الْهَلْكَى مِنَ الرَّدَى",
          "فَكُونُوا لِي شُفَعَاءَ فَقَدْ وَفَدْتُ إِلَيْكُمْ إِذَا رَغِبَ عَنْكُمْ أَهْلُ الدُّنْيَا وَ اتَّخَذُوا آيَاتِ اللَّهِ هُزُواً وَ اسْتَكْبَرُوا عَنْهَا يَا مَنْ هُوَ قَائِمٌ لَا يَسْهُو وَ دَائِمٌ لَا يَلْهُو وَ مُحِيطٌ بِكُلِّ شَيْ‏ءٍ لَكَ الْمَنُّ بِمَا وَفَّقْتَنِي وَ عَرَّفْتَنِي مِمَّا ائْتَمَنْتَنِي عَلَيْهِ إِذْ صَدَّ عَنْهُمْ عِبَادُكَ وَ جَهِلُوا مَعْرِفَتَهُمْ وَ اسْتَخَفُّوا بِحَقِّهِمْ وَ مَالُوا إِلَى سِوَاهُمْ ",
          "فَكَانَتِ الْمِنَّةُ مِنْكَ عَلَيَّ مَعَ أَقْوَامٍ خَصَصْتَهُمْ بِمَا خَصَصْتَنِي بِهِ فَلَكَ الْحَمْدُ إِذْ كُنْتُ عِنْدَكَ فِي مَقَامِي هَذَا مَذْكُوراً مَكْتُوباً وَ لَا تَحْرِمْنِي مَا رَجَوْتُ وَ لَا تُخَيِّبْنِي فِيمَا دَعَوْتُ وَ ادْعُ لِنَفْسِكَ بِمَا أَحْبَبْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">– </span>(From the narrator</span> of the previous Hadith) ",
            "When you go to the graves, which are at Al-Baqie, so make it to be in front of you. Then you should be saying, ‘The greetings be upon you<sup>asws</sup>, O Imams<sup>asws</sup> of the Guidance! The greetings be upon you<sup>asws</sup> the people of piety! The greetings be upon you<sup>asws</sup> the Proofs upon the people of the world! The greetings be upon you<sup>asws</sup>, the founders of the justice among the created beings! The greetings be upon you<sup>asws</sup>, O elite people! The greetings be upon you<sup>asws</sup>, the people of excellency! ",
            "I testify that you<sup>asws</sup> have delivered (the Message), and preached, and were patient regarding the Being of Allah<sup>azwj</sup>, and you<sup>asws</sup> were belied, and they (people) poured grief upon you<sup>asws</sup>, but you<sup>asws</sup> forgave them. And, I testify that obedience to you<sup>asws</sup> and the righteous Imams<sup>asws</sup> (from you<sup>asws</sup>) the Guides is an Obligation and that your<sup>asws</sup> words are the Truth. And you<sup>asws</sup> called but you<sup>asws</sup> were not answered, and you<sup>asws</sup> ordered but you<sup>asws</sup> were not obeyed. ",
            "And you<sup>asws</sup> are the foundations of the Religion, and cornerstones of the earth, and never ceased to be in the Eye (Consideration) of Allah<sup>azwj</sup>, Reproducing you<sup>asws</sup> in the loins of every Purified one, and Transferring you<sup>asws</sup> into the Purified laps, the ignorance of the ignorant ones not soiling you<sup>asws</sup>, nor being affected by the strife of the whimsical desires. You<sup>asws</sup> are good and goodly was your<sup>asws</sup> coming to the world. ",
            "The Creator of the Religion Favoured upon us, so He<sup>azwj</sup> Made you<sup>asws</sup> to be in the houses which Allah<sup>azwj</sup> Permitted to be Elevated and His<sup>azwj</sup> Name to be mentioned therein, and Made our sending of the Blessings upon you<sup>saww</sup> to be a Mercy upon you, and an expiation for our sins and Chose you<sup>asws</sup> for us, and Made good our births due to what He<sup>azwj</sup> Favoured with upon us from your Wilayah, and we became named by your<sup>asws</sup> merits, acknowledging with our ratifications. ",
            "Be aware! And this place, the one who transgresses, and errs, and takes shelter, and acknowledges with what crimes he had committed, and hopes of being finished from it, and that he be Delivered through you<sup>asws</sup> from the destruction and the doom.  ",
            "Therefore, become intercessors for me, for I am a delegate to you<sup>asws</sup> when the people of the world turned away from you<sup>asws</sup>, and they took the Signs of Allah<sup>azwj</sup> as a mockery, and were arrogant about it. O the One<sup>azwj</sup> Who Stands without forgetting, and Eternal without any vanity, and Encompasses everything. For You<sup>azwj</sup> is the Favour with what You<sup>azwj</sup> Made me to be concordant with, and Introduced me to what You<sup>azwj</sup> Entrusted me upon, when Your<sup>azwj</sup> servants shut-off from them, and were ignorant of recognising them<sup>asws</sup>, and took their<sup>asws</sup> rights lightly, and inclined to others besides them<sup>asws</sup>. ",
            "Thus is the Favour from You<sup>azwj</sup> upon me along with a people You<sup>azwj</sup> have Specialised with what You<sup>azwj</sup> Specialised me with. So, for You<sup>azwj</sup> is the Praise, when I am mentioned in Your<sup>azwj</sup> Presence, Recorded, and do not Prohibit from me what I hope for, nor Disappoint me with regards to what I supplicate to You<sup>azwj</sup> for myself’ – and supplicate for yourself with whatever you so like to’."
          ],
          "en.sarwar": [
            "1. The following is narrated in a mawquf and mursal manner who has narrated the following: (It seems as if it is part of Hadith 5 of previous Chapter narrated from Mu‘awiyah ibn ‘Ammar). “When you go to the grave in al-Baqi‘ keep it in front of you and say, ‘(I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments), O leaders of (divine) guidance. (I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments), O people of piety. (I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments), O people who possess divine authority over the people of the world. (I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments) O executors of justice among people in the world. (I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments) O chosen ones. (I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments) O the ones with whom cherished conversation is worthwhile. I testify that you have preached (the divine message) and provided good advice, exercised patience for the cause of Allah, that you were rejected and that certain people treated you in wicked manners but you forgave. I testify that you are intelligent leaders, the well-guiding ones. Obedience to you is obligatory and your words speak the truth. I testify that you called (people to Allah) but you did not receive proper response, gave commands but were not obeyed. I testify that you are the pillars of religion and the cornerstones of earth. You continue to remain before the eyes (special attention) of Allah. He has kept you as offspring of clean generations and transferred you to clean wombs. The filth of total ignorance or the mischief of evil desires could not affect you. You are of noble birth as well as the noble place of growth. The Creator of religion and justice has done a great favor to us through you. He thus has placed you in such homes, which Allah wants to be made to stand high wherein His name is spoken of. He has made our asking Him to grant salawat (favors and compensation to Muhammad and his family worthy of their services to Your cause), a blessing for us and expiations for our sins; He has chosen you for us and has cleansed our creation through His favor of making you our guardians with divine authority. We were marked before Him to receive favors from you and that we affirm and acknowledge your divine authority. This is the place of one who has transgressed, slipped and shown his destitution and has confessed to his sins. He hopes in his place to be relieved and saved through you from destruction and condemnation. Be my intercessors, I have come to you when people of the world have turned away from you, have taken the signs of Allah in ridicule and have treated them with arrogance. O the One, who guards without making any mistakes, lives forever but never is playful and has encompassed all things, it is because of Your generosity that You have granted me this opportunity. (You have) introduced to me (my ’A’immah) what You have entrusted me with, when Your servants have kept away from them, lived in ignorance of knowing their high position, treated their rights as insignificant and inclined toward others. (What you have done for me) is because of Your generosity to me and to certain people whom You have given special attention. All praise belongs to You and thanks for the fact that You have kept me in this position, mentioned and listed me before You. Do not deprive me in what I hope for and do not fail me in my prayers.’ Pray for yourself and for whatever matter you like.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:220",
  "kind": "verse_list"
}