{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 221"
        },
        "path": "/books/al-kafi:4:3:221",
        "titles": {
          "ar": "بَابُ إِتْيَانِ الْمَشَاهِدِ وَ قُبُورِ الشُّهَدَاءِ",
          "en": "Chapter 221 – Going to the shrines and the graves of the martyrs"
        }
      }
    ],
    "index": 1164,
    "local_index": 221,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 222"
        },
        "path": "/books/al-kafi:4:3:222",
        "titles": {
          "ar": "بَابُ وَدَاعِ قَبْرِ النَّبِيِّ ( صلى الله عليه وآله )",
          "en": "Chapter 222 – Bidding farewell to the grave of the Prophet<sup>saww</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 220"
        },
        "path": "/books/al-kafi:4:3:220",
        "titles": {
          "ar": "بَابُ زِيَارَةِ مَنْ بِالْبَقِيعِ",
          "en": "Chapter 220 – Ziyarah of the ones at Al Baqi’e"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:221",
    "titles": {
      "ar": "بَابُ إِتْيَانِ الْمَشَاهِدِ وَ قُبُورِ الشُّهَدَاءِ",
      "en": "Chapter 221 – Going to the shrines and the graves of the martyrs"
    },
    "verse_count": 6,
    "verse_start_index": 8079,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/274)"
        ],
        "index": 8080,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/142",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى وَ ابْنِ أَبِي عُمَيْرٍ جَمِيعاً عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:221:1",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا تَدَعْ إِتْيَانَ الْمَشَاهِدِ كُلِّهَا مَسْجِدِ قُبَاءَ فَإِنَّهُ الْمَسْجِدُ الَّذِي أُسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ وَ مَشْرَبَةِ أُمِّ إِبْرَاهِيمَ وَ مَسْجِدِ الْفَضِيخِ وَ قُبُورِ الشُّهَدَاءِ وَ مَسْجِدِ الْأَحْزَابِ وَ هُوَ مَسْجِدُ الْفَتْحِ ",
          "قَالَ وَ بَلَغَنَا أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) كَانَ إِذَا أَتَى قُبُورَ الشُّهَدَاءِ قَالَ السَّلَامُ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ وَ لْيَكُنْ فِيمَا تَقُولُ عِنْدَ مَسْجِدِ الْفَتْحِ يَا صَرِيخَ الْمَكْرُوبِينَ وَ يَا مُجِيبَ دَعْوَةِ الْمُضْطَرِّينَ اكْشِفْ هَمِّي وَ غَمِّي وَ كَرْبِي كَمَا كَشَفْتَ عَنْ نَبِيِّكَ هَمَّهُ وَ غَمَّهُ وَ كَرْبَهُ وَ كَفَيْتَهُ هَوْلَ عَدُوِّهِ فِي هَذَا الْمَكَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan Bin Yahya and Ibn Abu Umeyr, altogether from Muawiya Bin Ammar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Do not neglect going to the shrines, all of them (e.g.) Masjid Quba, for it is the Masjid which has been founded upon the piety from the first day, and the drinking place of Umm Ibrahim<sup>as</sup>, and Masjid Al-Fazeekh, and graves of the martyrs, and Masjid Al-Ahzaab and it is Masjid Al-Fat’h’. ",
            "He<sup>asws</sup> said, ‘And it has reached us that the Prophet<sup>saww</sup>, whenever he<sup>saww</sup> went to the graves of the martyrs, said: ‘The greetings be upon you with what you endured patiently. So the best end-result is the House (of the Hereafter)’; and let yourself become, in what you should be saying at the Masjid Al-Fat’h, ‘O Helper in distress, and O Responder to the supplication of the desperate ones! Remove my worries, and my gloom, and my stress, just as You<sup>azwj</sup> Removed from Your<sup>azwj</sup> Prophet<sup>saww</sup>, his<sup>saww</sup> worries, and his<sup>saww</sup> gloom, and his<sup>saww</sup> stress, and Sufficed him<sup>saww</sup> around his<sup>saww</sup> enemies in this place’’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr and Muhammad ibn Isma‘il from af-Fadf ibn Shadhan from Safwan ibn Yahya and ibn abu ‘Umayr all from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You must not ignore visiting all shrines. One is Masjid of al-Quba’. It is the Masjid, which was built with pious intentions from the first day. There are the platform of the mother of Ibrahim, the Masjid of al-Fadikh, the graves of the martyrs, the Masjid of al-Ahzab and the Masjid of al-Fath.’ He (the Imam) then said, ‘It has come to our notice that the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, when visiting the graves of the martyrs said, “May Allah grant you peace for your exercising patience. The next life indeed is a happy life.” However, of the things you may say near the Masjid of al-Fath should be this: “O Supporter of one crying for help in distressful conditions, O the One who answers the prayers of the helpless ones, remove my anxiety, sadness and distress. (Remove them) just as You removed the anxiety, sadness and distressfulness from Your Holy Prophet, and supported him against fear from his enemies in this place.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/275)"
        ],
        "index": 8081,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2676",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2860",
              "text": "عُقْبَةَ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ عُقْبَةَ بْنِ خَالِدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:221:2",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) أَنَّا نَأْتِي الْمَسَاجِدَ الَّتِي حَوْلَ الْمَدِينَةِ فَبِأَيِّهَا أَبْدَأُ فَقَالَ ابْدَأْ بِقُبَا فَصَلِّ فِيهِ وَ أَكْثِرْ فَإِنَّهُ أَوَّلُ مَسْجِدٍ صَلَّى فِيهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي هَذِهِ الْعَرْصَةِ ثُمَّ ائْتِ مَشْرَبَةَ أُمِّ إِبْرَاهِيمَ فَصَلِّ فِيهَا وَ هِيَ مَسْكَنُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مُصَلَّاهُ ثُمَّ تَأْتِي مَسْجِدَ الْفَضِيخِ فَتُصَلِّي فِيهِ فَقَدْ صَلَّى فِيهِ نَبِيُّكَ",
          "فَإِذَا قَضَيْتَ هَذَا الْجَانِبَ أَتَيْتَ جَانِبَ أُحُدٍ فَبَدَأْتَ بِالْمَسْجِدِ الَّذِي دُونَ الْحَرَّةِ فَصَلَّيْتَ فِيهِ ثُمَّ مَرَرْتَ بِقَبْرِ حَمْزَةَ بْنِ عَبْدِ الْمُطَّلِبِ فَسَلَّمْتَ عَلَيْهِ ثُمَّ مَرَرْتَ بِقُبُورِ الشُّهَدَاءِ فَقُمْتَ عِنْدَهُمْ فَقُلْتَ السَّلَامُ عَلَيْكُمْ يَا أَهْلَ الدِّيَارِ أَنْتُمْ لَنَا فَرَطٌ وَ إِنَّا بِكُمْ لَاحِقُونَ ",
          "ثُمَّ تَأْتِي الْمَسْجِدَ الَّذِي كَانَ فِي الْمَكَانِ الْوَاسِعِ إِلَى جَنْبِ الْجَبَلِ عَنْ يَمِينِكَ حِينَ تَدْخُلُ أُحُداً فَتُصَلِّي فِيهِ فَعِنْدَهُ خَرَجَ النَّبِيُّ ( صلى الله عليه وآله ) إِلَى أُحُدٍ حِينَ لَقِيَ الْمُشْرِكِينَ فَلَمْ يَبْرَحُوا حَتَّى حَضَرَتِ الصَّلَاةُ فَصَلَّى فِيهِ ",
          "ثُمَّ مُرَّ أَيْضاً حَتَّى تَرْجِعَ فَتُصَلِّيَ عِنْدَ قُبُورِ الشُّهَدَاءِ مَا كَتَبَ اللَّهُ لَكَ ثُمَّ امْضِ عَلَى وَجْهِكَ حَتَّى تَأْتِيَ مَسْجِدَ الْأَحْزَابِ فَتُصَلِّيَ فِيهِ وَ تَدْعُوَ اللَّهَ فِيهِ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) دَعَا فِيهِ يَوْمَ الْأَحْزَابِ وَ قَالَ يَا صَرِيخَ الْمَكْرُوبِينَ وَ يَا مُجِيبَ دَعْوَةِ الْمُضْطَرِّينَ وَ يَا مُغِيثَ الْمَهْمُومِينَ اكْشِفْ هَمِّي وَ كَرْبِي وَ غَمِّي فَقَدْ تَرَى حَالِي وَ حَالَ أَصْحَابِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah Bin Hilal, from Uqba Bin khalid who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup>, ‘We go to the Masjids which are around Al-Medina, so which of these should I begin with?’ Begin with (Masjid) Quba, so Pray <span class=\"iTxt\">Salaat</span> therein and frequent it, for it is the first Masjid in this earth wherein Rasool-Allah<sup>saww</sup> Prayed. Then go to the drinking place of Umm Ibrahim<sup>as</sup>, so Pray <span class=\"iTxt\">Salaat</span> therein, and it is a dwelling of Rasool-Allah<sup>saww</sup> and his<sup>saww</sup> Praying place. Then go to Masjid Al Fazeekh, so Pray <span class=\"iTxt\">Salaat</span> therein, for your Prophet<sup>saww</sup> had Prayed <span class=\"iTxt\">Salaat</span> in it. ",
            "When you have fulfilled this side, go to the side of Ohad, so begin with the Masjid which is besides Al-Harra, so Pray therein. Then pass by the grave of Hamza Bin Abdul Muttalib<sup>as</sup>, and greet upon him<sup>as</sup>. Then pass by the graves of the martyrs, so stay by them and said, ‘The greetings be upon you, O people of the houses! You have preceded us and we would be meeting you’. ",
            "Then go over to the Masjid which was in the expanse to the side of the mountain, on your right where you entered Ohad, so Pray <span class=\"iTxt\">Salaat</span> therein, for the Prophet<sup>saww</sup> went out to Ohad from it where he<sup>saww</sup> met (in battle) the Polytheists. But, he<sup>saww</sup> did not move-ahead until the time for the <span class=\"iTxt\">Salaat</span> presented itself, so he<sup>saww</sup> Prayed therein. ",
            "Then return after (visiting) those so you Pray <span class=\"iTxt\">Salaat</span> by the graves of the martyrs what Allah<sup>azwj</sup> has Ordained for you. Then go upon your direction until you get to the Masjid Al-Ahzaab, so you Pray <span class=\"iTxt\">Salaat</span> in it, and you supplicate to Allah<sup>azwj</sup> in it, for Rasool-Allah<sup>saww</sup> supplicated therein on the day of (the battle of) Al-Ahzaab and said: ‘O Helper in distress, and O Responder to the supplication of the desperate ones! O Helper of the distressed one, Remove my<sup>saww</sup> stress, and my<sup>saww</sup> grief, for You<sup>azwj</sup> have Seen my<sup>saww</sup> state and the state of my<sup>saww</sup> companions’’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ‘Abd Allah ibn Hilal from ‘Uqbah ibn Khalid who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘We go to the Masjids which are around al-Madinah. Which one should we visit first?’ He (the Imam) replied, ‘First you should go to Masjid of Quba’. Perform salat (prayer) therein a great deal; it is the first Masjid where the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed salat (prayer) in this area. Then you should go to Mushrabah of mother of Ibrahim and perform salat (prayer) therein. This place is the living quarter of the Messenger of Allah where he performed salat (prayer). Then you should go to the Masjid of al-Fadikh and perform salat (prayer) therein. In this place, Your prophet performed salat (prayer). When you complete your visit of this side then go to the side of ‘Uhud. First you should go to the Masjid which is before al-Hurrah, perform salat (prayer) there, then visit the grave of Hamzah ibn ‘Abd al-Muttalib and offer him your greeting of peace. Then you should visit the graves of the martyrs standing nearby and say, “May (Allah’s) favors be with you, O inhabitants of this dwelling. You have left and we are about to join you.” Thereafter you should go to the Masjid, which was in the open area on the side of the hill on the right side when entering ‘Uhud. Perform salat (prayer) therein. The Holy Prophet had left for ‘Uhud from this place to face the pagans. They remained there until the time for salat (prayer) and he performed salat (prayer) therein. Thereafter you should go on to perform salat (prayer) near the graves of the martyrs (to gain) what Allah has written for you. Thereafter go forward until you come to the Masjid of al-Ahzab, perform salat (prayer) therein and say what the Messenger of Allah had said, “O Supporter of one crying for help in distressful conditions, O the One who answers the prayers of the helpless ones, remove my anxiety, sadness and distress. You are watching my condition and the condition of my companions.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/275)"
        ],
        "index": 8082,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:221:3",
        "text": [
          " سَمِعْتُهُ يَقُولُ عَاشَتْ فَاطِمَةُ ( سلام الله عليها ) بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) خَمْسَةً وَ سَبْعِينَ يَوْماً لَمْ تُرَ كَاشِرَةً وَ لَا ضَاحِكَةً تَأْتِي قُبُورَ الشُّهَدَاءِ فِي كُلِّ جُمْعَةٍ مَرَّتَيْنِ الْإِثْنَيْنِ وَ الْخَمِيسَ فَتَقُولُ هَاهُنَا كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ هَاهُنَا كَانَ الْمُشْرِكُونَ ",
          "وَ فِي رِوَايَةٍ أُخْرَى أَبَانٌ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهَا كَانَتْ تُصَلِّي هُنَاكَ وَ تَدْعُو حَتَّى مَاتَتْ ( عليها السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Ssaeed, from Al Nazar Bin Suweyd, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Syeda Fatima<sup>asws</sup> lived after Rasool-Allah<sup>saww</sup> for seventy five days, not being seen smiling nor laughing. She<sup>asws</sup> was going to the graves of the martyrs twice very week, the Mondays and the Thursdays, so she<sup>asws</sup> would be saying: ‘Over here was Rasool-Allah<sup>saww</sup>, and over there were the Polytheists’. ",
            "And in another report of Aban, from the one who informed him, from Abu Abdullah<sup>asws</sup>, that Syeda<sup>asws</sup> used to Pray <span class=\"iTxt\">Salaat</span> over there and supplicated until when she<sup>asws</sup> passed away’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Al-Nadr ibn al-Suwayd from Hisham ibn Salim who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘Fatimah, ‘Alayha al-Salam, lived for seventy-five days after the death of the Messenger of Allah. During this time, she was never seen laughing or smiling. Every week she would go twice to the gravesites of the martyrs, once on Monday and on Thursdays, and say, ‘There was the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and there were the pagans.”’ In another Hadith, Aban has narrated from those whom he has mentioned from abu ‘Abd Allah, ‘Alayhi al-Salam, who has said the following: “She would perform salat (prayer) there and pray until she died.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/276)"
        ],
        "index": 8083,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1142",
              "text": "الْمُفَضَّلِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1475",
              "text": "لَيْثٍ الْمُرَادِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْمُفَضَّلِ بْنِ صَالِحٍ عَنْ لَيْثٍ الْمُرَادِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:221:4",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ مَسْجِدِ الْفَضِيخِ لِمَ سُمِّيَ مَسْجِدَ الْفَضِيخِ فَقَالَ لِنَخْلٍ يُسَمَّى الْفَضِيخَ فَلِذَلِكَ سُمِّيَ مَسْجِدَ الْفَضِيخِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad, from Ahmad Bin Muhammad, from Ibn Fazzal, from Al Mufazzal Bin Salih, from Lays Al Murady who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about Masjid Al-Fazeekh, ‘Why was it named as Masjid Al-Fazeekh?’ So he<sup>asws</sup> said: ‘Due to a palm tree named as Al-Fazeekh, so due to that it was named as Masjid Al-Fazeekh’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from al-Mufaddal ibn Salih from Layth al-Muradiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Why Masjid of al-Fadikh is called Masjid of al- Fadikh?’ He (the Imam) replied, ‘It is because of a palm tree that was called al-Fadikh and for this reason it is called Masjid of al-Fadikh.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/276)"
        ],
        "index": 8084,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنِ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:221:5",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَلْ أَتَيْتُمْ مَسْجِدَ قُبَاءَ أَوْ مَسْجِدَ الْفَضِيخِ أَوْ مَشْرَبَةَ أُمِّ إِبْرَاهِيمَ قُلْتُ نَعَمْ قَالَ أَمَا إِنَّهُ لَمْ يَبْقَ مِنْ آثَارِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) شَيْ‏ءٌ إِلَّا وَ قَدْ غُيِّرَ غَيْرَ هَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ibn Muskaan, from Al Halby who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Have you ever gone to Masjid Quba, or Masjid Al-Fazeekh, or the drinking place of Umm Ibrahim<sup>as</sup>?’  I said, ‘Yes’. He<sup>asws</sup> said: ‘But, there does not remain any traces of Rasool-Allah<sup>saww</sup> of anything, except that they have changed it, apart from this’."
          ],
          "en.sarwar": [
            "5. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ibn Muskan from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once asked, ‘Have you gone to Masjid of Quba’, or Masjid of al- Fadikh, or Mashrabah of mother of Ibrahim?’ I replied, ‘Yes, I have done so.’ He (the Imam) said, ‘No other thing of the things reminding of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, is left that is not changed except this.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/276)"
        ],
        "index": 8085,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/755",
              "text": "مُوسَى بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3255",
              "text": "عُمَرَ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2655",
              "text": "الْحَسَنِ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2295",
              "text": "عَمَّارِ بْنِ مُوسَى"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُوسَى بْنِ جَعْفَرٍ عَنْ عُمَرَ بْنِ سَعِيدٍ عَنِ الْحَسَنِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:221:6",
        "text": [
          " دَخَلْتُ أَنَا وَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَسْجِدَ الْفَضِيخِ فَقَالَ يَا عَمَّارُ تَرَى هَذِهِ الْوَهْدَةَ قُلْتُ نَعَمْ قَالَ كَانَتِ امْرَأَةُ جَعْفَرٍ الَّتِي خَلَفَ عَلَيْهَا أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قَاعِدَةً فِي هَذَا الْمَوْضِعِ وَ مَعَهَا ابْنَاهَا مِنْ جَعْفَرٍ فَبَكَتْ فَقَالَ لَهَا ابْنَاهَا مَا يُبْكِيكِ يَا أُمَّهْ قَالَتْ بَكَيْتُ  لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَا لَهَا تَبْكِينَ لِأَمِيرِ الْمُؤْمِنِينَ وَ لَا تَبْكِينَ لِأَبِينَا قَالَتْ لَيْسَ هَذَا هَكَذَا وَ لَكِنْ ذَكَرْتُ حَدِيثاً حَدَّثَنِي بِهِ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي هَذَا الْمَوْضِعِ فَأَبْكَانِي قَالَا وَ مَا هُوَ",
          "قَالَتْ كُنْتُ أَنَا وَ أَمِيرُ الْمُؤْمِنِينَ فِي هَذَا الْمَسْجِدِ فَقَالَ لِي تَرَيْنَ هَذِهِ الْوَهْدَةَ قُلْتُ نَعَمْ قَالَ كُنْتُ أَنَا وَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَاعِدَيْنِ فِيهَا إِذْ وَضَعَ رَأْسَهُ فِي حَجْرِي ثُمَّ خَفَقَ حَتَّى غَطَّ وَ حَضَرَتْ صَلَاةُ الْعَصْرِ فَكَرِهْتُ أَنْ أُحَرِّكَ رَأْسَهُ عَنْ فَخِذِي فَأَكُونَ قَدْ آذَيْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حَتَّى ذَهَبَ الْوَقْتُ وَ فَاتَتْ",
          "فَانْتَبَهَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا عَلِيُّ صَلَّيْتَ قُلْتُ لَا قَالَ وَ لِمَ ذَلِكَ قُلْتُ كَرِهْتُ أَنْ أُوذِيَكَ قَالَ فَقَامَ وَ اسْتَقْبَلَ الْقِبْلَةَ وَ مَدَّ يَدَيْهِ كِلْتَيْهِمَا وَ قَالَ اللَّهُمَّ رُدَّ الشَّمْسَ إِلَى وَقْتِهَا حَتَّى يُصَلِّيَ عَلِيٌّ فَرَجَعَتِ الشَّمْسُ إِلَى وَقْتِ الصَّلَاةِ حَتَّى صَلَّيْتُ الْعَصْرَ ثُمَّ انْقَضَّتْ انْقِضَاضَ الْكَوْكَبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Musa Bin Ja’far, from Umar Bin Saeed, from Al Hassan Bin Sadaqa, from Ammar Bin Musa who said, ",
            "‘Abu Abdullah<sup>asws</sup> and I went over to Masjid Al-Fazeekh, so he<sup>asws</sup> said: ‘O Ammar! Do you see this lowland?’ I said, ‘Yes’ He<sup>asws</sup> said: ‘It was so that the wife of Ja’far<sup>as</sup> who was looked after by Amir Al-Momineen<sup>asws</sup> used to sit in this place, and with her were her two sons from Ja’far, so she would wail. So, her sons said to her, ‘What makes you weep, O mother?’ She said, ‘I cry for Amir Al-Momineen<sup>asws</sup>’. So they both said to her, ‘You are crying for Amir Al-Momineen<sup>asws</sup> and you are not crying for our father<sup>as</sup>?’ She said, ‘This is not like this, but I remembered a Hadeeth narrated to me by Amir Al-Momineen<sup>asws</sup> in this place, so it made me cry’. They said, ‘And what is it?’ ",
            "She said, ‘I (was in the company of) Amir Al-Momineen<sup>asws</sup> in this Masjid, so he<sup>asws</sup> said to me: ‘Do you see this lowland?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘I<sup>asws</sup> and Rasool-Allah<sup>saww</sup> were seated therein when he<sup>saww</sup> placed his<sup>saww</sup> head in my<sup>asws</sup> lap. Then he<sup>saww</sup> pulsated until he<sup>saww</sup> was immersed in sleep, and the time for <span class=\"iTxt\">Salaat</span> presented itself. But I<sup>asws</sup> disliked to move his<sup>saww</sup> head from my<sup>asws</sup> thigh so that I<sup>asws</sup> might end up disturbing Rasool-Allah<sup>saww</sup>, until the time (of the <span class=\"iTxt\">Salaat</span>) passed and was lost. ",
            "So Rasool-Allah<sup>saww</sup> woke up and said: ‘O Ali<sup>asws</sup>! Did you<sup>asws</sup> Pray <span class=\"iTxt\">Salaat</span>?’ I<sup>asws</sup> said: ‘No’. He<sup>saww</sup> said: ‘And why is that so?’ I<sup>asws</sup> said: ‘I<sup>asws</sup> disliked to disturb you<sup>saww</sup>’. So he<sup>saww</sup> arose and faced the Qiblah and extended both his<sup>saww</sup> hands and said: ‘O Allah<sup>azwj</sup>! Return the sun to its time until Ali<sup>asws</sup> Prays <span class=\"iTxt\">Salaat</span>’. So the sun returned to the time of the <span class=\"iTxt\">Salaat</span> until I<sup>asws</sup> Prayed Al-Asr, then it dived like the diving of the (shooting) stars’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from Musa ibn Ja’far from ‘Umar ibn Sa‘id from al-Hassan ibn Sadaqah from ‘Ammar ibn Musa who has said the following: “I once visited abu ‘Abd Allah, ‘Alayhi al-Salam, and I entered Masjid of al-Fadikh. He (the Imam) asked, ‘O ‘Ammar, do you see this depression of land?’ I replied, ‘Yes, I see it.’ He (the Imam) then said, ‘Wife of Ja’far who married ’Amir al-Mu’minin once was sitting at this place with her two sons from Ja’far. She wept and her sons asked, ‘Mother, what has made you weep?’ She replied, ‘I wept for ’Amir al-Mu’minin.’ They asked, ‘Mother, why do you weep for ’Amir al-Mu’minin but not for our father?’ She replied, ‘It is not that way. I wept because of a Hadith I remembered from ’Amir al- Mu’minin narrated to me at this place and that made me weep.’ They asked, ‘What is that Hadith?’ She then said, ‘Once ’Amir al-Mu’minin and I were in this Masjid. He asked, ‘Do you see this depression in the land?’ I replied, ‘Yes, I see it.’ He then said, ‘Once the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and I were sitting in there. He (the Messenger of Allah) placed his head in my lap and went to sleep until he began to snore. It became time for al-‘Asr salat (prayer) but I did not like to move his head from my lap which may have caused any trouble to the Messenger of Allah. Time went by and al-‘Asr salat (prayer) was missed. The Messenger of Allah woke up and asked, ‘O Ali, did you perform salat (prayer)?’ I replied, ‘No, I did not do so.’ He asked, ‘Why did you not perform salat (prayer)?’ I replied, ‘I did not like to cause you any trouble.’ He (the Imam) said, ‘He (the Messenger of Allah) stood up facing the direction of Ka‘bah and stretched his both hands and said, “O Allah, return the sun to its time so Ali, ‘Alayhi al-Salam, can perform his salat (prayer).” The sun returned to the time for salat (prayer) for such a period of time in which he could perform al-‘Asr salat (prayer) and then it went by like a star.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:221",
  "kind": "verse_list"
}