{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 226"
        },
        "path": "/books/al-kafi:4:3:226",
        "titles": {
          "ar": "بَابٌ",
          "en": "Chapter 226 – A Chapter"
        }
      }
    ],
    "index": 1169,
    "local_index": 226,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 227"
        },
        "path": "/books/al-kafi:4:3:227",
        "titles": {
          "ar": "بَابُ مَا يُقَالُ عِنْدَ قَبْرِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "Chapter 227 – What is to be said at the grave of Amir Al-Momineen<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 225"
        },
        "path": "/books/al-kafi:4:3:225",
        "titles": {
          "ar": "بَابُ مَسْجِدِ غَدِيرِ خُمٍّ",
          "en": "Chapter 225 – Masjid Ghadeer Khumm"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:226",
    "titles": {
      "ar": "بَابٌ",
      "en": "Chapter 226 – A Chapter"
    },
    "verse_count": 3,
    "verse_start_index": 8100,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/284)"
        ],
        "index": 8101,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:226:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ زِيَادِ بْنِ أَبِي الْحَلَّالِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ نَبِيٍّ وَ لَا وَصِيِّ نَبِيٍّ يَبْقَى فِي الْأَرْضِ أَكْثَرَ مِنْ ثَلَاثَةِ أَيَّامٍ حَتَّى تُرْفَعَ رُوحُهُ وَ عَظْمُهُ وَ لَحْمُهُ إِلَى السَّمَاءِ وَ إِنَّمَا تُؤْتَى مَوَاضِعُ آثَارِهِمْ وَ يُبَلِّغُونَهُمْ مِنْ بَعِيدٍ السَّلَامَ وَ يَسْمَعُونَهُمْ فِي مَوَاضِعِ آثَارِهِمْ مِنْ قَرِيبٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al hakam, from Ziyad Bin Abu Al Hallal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from a Prophet<sup>as</sup> nor a successor<sup>as</sup> of a Prophet<sup>as</sup> who remains in the earth (after his<sup>as</sup> passing away), for more than three days, until his<sup>as</sup> soul, and his<sup>as</sup> bones, and his<sup>as</sup> flesh are Raised to the sky; and rather, they (people) are going to the places of their<sup>as</sup> traces, and they are delivering the greetings from afar, and they<sup>as</sup> are hearing them in the places of their<sup>as</sup> traces, from nearby’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Ziyad ibn abu al-Hallal who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that no one of the prophets and the executors of the will of the prophets remain on earth for more than three days, within which time his Ruh (spirit), bones and flesh are taken to the heaven. People come only to the places where their marks are left. They convey and express their al-Salam from distant places and they hear them nearby in the places where their marks are left.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/285)"
        ],
        "index": 8102,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:226:2",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ مُوسَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ قَالَ سَمِعْتُ الرِّضَا ( عليه السلام ) يَقُولُ إِنَّ لِكُلِّ إِمَامٍ عَهْداً فِي عُنُقِ أَوْلِيَائِهِ وَ شِيعَتِهِ وَ إِنَّ مِنْ تَمَامِ الْوَفَاءِ بِالْعَهْدِ وَ حُسْنِ الْأَدَاءِ زِيَارَةَ قُبُورِهِمْ فَمَنْ زَارَهُمْ رَغْبَةً فِي زِيَارَتِهِمْ وَ تَصْدِيقاً بِمَا رَغِبُوا فِيهِ كَانَ أَئِمَّتُهُمْ شُفَعَاءَهُمْ يَوْمَ الْقِيَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Abdullah Bin Musa, from Al Hassan Bin Ali Al Washa who said, ",
            "‘I heard Al-Reza<sup>asws</sup> saying: ‘For every Imam<sup>asws</sup> that is a pact in the necks of his<sup>asws</sup> friends and his<sup>asws</sup> Shiahs; and it is from the completion of the loyalty with the pact, and good etiquettes, the performance of the <span class=\"iTxt\">Ziyarah</span>s of their<sup>asws</sup> graves. So the one who performs their<sup>asws</sup> Ziyaraats and wishes to be performing their<sup>asws</sup> <span class=\"iTxt\">Ziyarah</span>s, and ratification with what they are wishing for therein, it would be so that their Imams<sup>asws</sup> would be their intercessors on the Day of Judgement’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash’ariy has narrated from ‘Abd Allah ibn Musa from al-Hassan ibn Ali al-Washsha’ who has said the following: “I once heard al-Rida’, ‘Alayhi al-Salam, say, ’The covenant makes all and every friend and followers of every Imam accountable. In order to stand up truly by this covenant, one should visit the gravesites of ’A’immah, ‘Alayhim al-Salam. Those who visit them because of their interest in such visits and to affirm what they are interested in, their Imam will intercede on their behalf on the Day of Judgment.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/285)"
        ],
        "index": 8103,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:226:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ بَعَثَ إِلَيَّ أَبُو الْحَسَنِ ( عليه السلام ) فِي مَرَضِهِ وَ إِلَى مُحَمَّدِ بْنِ حَمْزَةَ فَسَبَقَنِي إِلَيْهِ مُحَمَّدُ بْنُ حَمْزَةَ وَ أَخْبَرَنِي مُحَمَّدٌ مَا زَالَ يَقُولُ ابْعَثُوا إِلَى الْحَيْرِ ابْعَثُوا إِلَى الْحَيْرِ فَقُلْتُ لِمُحَمَّدٍ أَ لَا قُلْتَ لَهُ أَنَا أَذْهَبُ إِلَى الْحَيْرِ ثُمَّ دَخَلْتُ عَلَيْهِ وَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ أَنَا أَذْهَبُ إِلَى الْحَيْرِ فَقَالَ انْظُرُوا فِي ذَاكَ ",
          "ثُمَّ قَالَ لِي إِنَّ مُحَمَّداً لَيْسَ لَهُ سِرٌّ مِنْ زَيْدِ بْنِ عَلِيٍّ وَ أَنَا أَكْرَهُ أَنْ يَسْمَعَ ذَلِكَ قَالَ فَذَكَرْتُ ذَلِكَ لِعَلِيِّ بْنِ بِلَالٍ فَقَالَ مَا كَانَ يَصْنَعُ بِالْحَيْرِ وَ هُوَ الْحَيْرُ فَقَدِمْتُ الْعَسْكَرَ فَدَخَلْتُ عَلَيْهِ فَقَالَ لِي اجْلِسْ حِينَ أَرَدْتُ الْقِيَامَ فَلَمَّا رَأَيْتُهُ أَنِسَ بِي ذَكَرْتُ لَهُ قَوْلَ عَلِيِّ بْنِ بِلَالٍ",
          "فَقَالَ لِي أَ لَا قُلْتَ لَهُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَطُوفُ بِالْبَيْتِ وَ يُقَبِّلُ الْحَجَرَ وَ حُرْمَةُ النَّبِيِّ وَ الْمُؤْمِنِ أَعْظَمُ مِنْ حُرْمَةِ الْبَيْتِ وَ أَمَرَهُ اللَّهُ عَزَّ وَ جَلَّ أَنْ يَقِفَ بِعَرَفَةَ وَ إِنَّمَا هِيَ مَوَاطِنُ يُحِبُّ اللَّهُ أَنْ يُذْكَرَ فِيهَا فَأَنَا أُحِبُّ أَنْ يُدْعَى اللَّهُ لِي حَيْثُ يُحِبُّ اللَّهُ أَنْ يُدْعَى فِيهَا",
          "وَ ذَكَرَ عَنْهُ أَنَّهُ قَالَ وَ لَمْ أَحْفَظْ عَنْهُ قَالَ إِنَّمَا هَذِهِ مَوَاضِعُ يُحِبُّ اللَّهُ أَنْ يُتَعَبَّدَ لَهُ فِيهَا فَأَنَا أُحِبُّ أَنْ يُدْعَى لِي حَيْثُ يُحِبُّ اللَّهُ أَنْ يُعْبَدَ هَلَّا قُلْتَ لَهُ كَذَا [وَ كَذَا] قَالَ قُلْتُ جُعِلْتُ فِدَاكَ لَوْ كُنْتُ أُحْسِنُ مِثْلَ هَذَا لَمْ أَرُدَّ الْأَمْرَ عَلَيْكَ هَذِهِ أَلْفَاظُ أَبِي هَاشِمٍ لَيْسَتْ أَلْفَاظَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Abu Hashim Al Ja’fary who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> sent for me and Muhammad Bin Hamza during his<sup>asws</sup> illness. So Muhammad Bin Hamza preceded me to go to him<sup>asws</sup>, and Muhammad informed me, ‘He<sup>asws</sup> did not cease saying, ‘Go to Al-Hayr, go to Al-Hayr!’ So I said to Muhammad, ‘Did you not say to him<sup>asws</sup> that I am going to Al-Hayr?’ Then I went over to him<sup>asws</sup> and said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I am going to Al-Hayr’. So he<sup>asws</sup> said: ‘Look into that’. ",
            "Then he<sup>asws</sup> said to me: ‘Muhammad, there is a secret for him from Zayd Bin Ali, and I dislike it that he should hear that’. So I mentioned that to Ali Bin Bilal, and he said, ‘What does he<sup>asws</sup> have to do with Al-Hayr and he<sup>asws</sup> (himself) is (from) Al-Hayr?’ So I proceeded to Al-Askar and I went over to him<sup>asws</sup>. So he<sup>asws</sup> said to me: ‘Be seated!’, when I wanted to arise (to leave). So when I saw him<sup>asws</sup> glancing at me, I mentioned to him<sup>asws</sup> the words of Ali Bin Bilal. ",
            "So he<sup>asws</sup> said to me: ‘Did I<sup>asws</sup> not say to you that Rasool-Allah<sup>saww</sup> would perform <span class=\"iTxt\">Tawaaf</span> by the House, and he<sup>saww</sup> would kiss the (Black) Stone, and the sanctity of the Prophet<sup>saww</sup> and the Believer is greater than sanctity of the House (Kaaba)? However, Allah<sup>azwj</sup> Mighty and Majestic Commanded him<sup>saww</sup> that he<sup>saww</sup> should pause at Arafaat, and rather it is a place wherein Allah<sup>azwj</sup> Loves that He<sup>azwj</sup> be mentioned therein. Thus I<sup>asws</sup> loved it that you supplicate to Allah<sup>azwj</sup> for me where Allah<sup>azwj</sup> Loves that He<sup>azwj</sup> be supplicated to’. ",
            "And he mentioned from him<sup>asws</sup> that he<sup>asws</sup> said, and did not memorise it from him, he<sup>asws</sup> said: ‘But rather, these are places wherein Allah<sup>azwj</sup> Loved that He<sup>azwj</sup> be worshipped, thus I<sup>asws</sup> loved it that he should supplicate for me where Allah<sup>azwj</sup> Loves that He<sup>azwj</sup> be worshipped. Did you not say to him such and such?’ He (the narrator) said, ‘I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! If I was good similar to this, I would not have referred the matter upon you<sup>asws</sup>’. These are the words of Hashim, not my words’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from abu Hashim al-Ja’fariy who has said the following: “Once, abu al-Hassan, ‘Alayhi al-Salam, during his illness, called me and Muhammad ibn Hamzah. Muhammad ibn Hamzah went to him before me. Muhammad told me that he (the Imam) still says, ‘You must send someone to al-Hayr (shrine of Imam al-Husayn) to pray there so I get well soon.’ I then asked Muhammad, ‘Did you not tell him (the Imam) that I am going to al-Hayr?’ I then went to the Imam and said, ‘I pray to Allah to keep my soul in service for your cause, I am going to al-Hayr.’ He (the Imam) said, ‘You must consider it properly.’ He (the Imam) then said, ‘Muhammad does not possess the secret (belief in the divine authority of Imam) from Zayd ibn Ali, (his father) and I do not like that he hears this.’ He (the narrator) has said that he mentioned this to Ali ibn Bilal. He said, ‘What does he (Imam) want from al-Hayr (shrine of Imam al-Hassan)? He himself is al-Hayr.’ I then went to the army camp near his home. He (the Imam) said, ‘Sit down’, when I wanted to stand up to leave. When I found that he was comfortable with me, I then mentioned to him the words of Ali ibn Bilal. He (the Imam) said to me, ‘Why did you not tell him that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would perform Tawaf around the House and kiss the Black Stone? The greatness of the prophet and believers is greater than the greatness of the House. Allah, the Most Majestic, the Most Glorious, commanded him to stay in ‘Arafah. Allah loves wherein He loves to be spoken of. I love that prayer is made for me before Allah wherein Allah loves prayers that are made before Him.’ He (the narrator) has said that he mentioned certain things from the Imam that I did not save from him. He (the Imam) said, ‘These are places wherein Allah loves that He is worshipped. I thus love that prayers be made for me wherein Allah loves to be worshipped. Why did you not say so and so to him.’ He, abu Hashim has said that I then said, ‘I pray to Allah to keep my soul in service for your cause. Could I do as good as this (what you said), I would not bring the matter before you.’ These are the words of abu Hashim, not the words of Imam.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:226",
  "kind": "verse_list"
}