{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 227"
        },
        "path": "/books/al-kafi:4:3:227",
        "titles": {
          "ar": "بَابُ مَا يُقَالُ عِنْدَ قَبْرِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "Chapter 227 – What is to be said at the grave of Amir Al-Momineen<sup>asws</sup>"
        }
      }
    ],
    "index": 1170,
    "local_index": 227,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 228"
        },
        "path": "/books/al-kafi:4:3:228",
        "titles": {
          "ar": "دُعَاءٌ آخَرُ عِنْدَ قَبْرِ أَمِيرِ الْمُؤْمِنِينَ ع‏",
          "en": "228. Another Dua at the grave of Ameer al-Mumineen"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 226"
        },
        "path": "/books/al-kafi:4:3:226",
        "titles": {
          "ar": "بَابٌ",
          "en": "Chapter 226 – A Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:227",
    "titles": {
      "ar": "بَابُ مَا يُقَالُ عِنْدَ قَبْرِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
      "en": "Chapter 227 – What is to be said at the grave of Amir Al-Momineen<sup>asws</sup>"
    },
    "verse_count": 1,
    "verse_start_index": 8103,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف والسند الثاني مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/287)"
        ],
        "index": 8104,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:227:1",
        "refs": {
          "Quran": [
            "/books/quran:21:28"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَمَّنْ حَدَّثَهُ عَنِ الصَّادِقِ أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام ) قَالَ يَقُولُ السَّلَامُ عَلَيْكَ يَا وَلِيَّ اللَّهِ أَنْتَ أَوَّلُ مَظْلُومٍ وَ أَوَّلُ مَنْ غُصِبَ حَقُّهُ صَبَرْتَ وَ احْتَسَبْتَ حَتَّى أَتَاكَ الْيَقِينُ فَأَشْهَدُ أَنَّكَ لَقِيتَ اللَّهَ وَ أَنْتَ شَهِيدٌ عَذَّبَ اللَّهُ قَاتِلَكَ بِأَنْوَاعِ الْعَذَابِ وَ جَدَّدَ عَلَيْهِ الْعَذَابَ ",
          "جِئْتُكَ عَارِفاً بِحَقِّكَ مُسْتَبْصِراً بِشَأْنِكَ مُعَادِياً لِأَعْدَائِكَ وَ مَنْ ظَلَمَكَ أَلْقَى عَلَى ذَلِكَ رَبِّي إِنْ شَاءَ اللَّهُ يَا وَلِيَّ اللَّهِ إِنَّ لِي ذُنُوباً كَثِيرَةً فَاشْفَعْ لِي إِلَى رَبِّكَ فَإِنَّ لَكَ عِنْدَ اللَّهِ مَقَاماً مَحْمُوداً مَعْلُوماً وَ إِنَّ لَكَ عِنْدَ اللَّهِ جَاهاً وَ شَفَاعَةً وَ قَدْ قَالَ تَعَالَى وَ لا يَشْفَعُونَ إِلَّا لِمَنِ ارْتَضى .",
          "مُحَمَّدُ بْنُ جَعْفَرٍ الرَّازِيُّ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام ) مِثْلَهُ "
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Awrama, from the one who narrated it, ",
            "(It has been narrated) from Al-Sadiq Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup> having said: ‘You should be saying, ‘The greetings be upon you<sup>asws</sup>, O Guardian (from) Allah<sup>azwj</sup>! You<sup>asws</sup> are the first oppressed one, and the first one whose rights were usurped, and you<sup>asws</sup> were patient and reckoned until the conviction (death) came to you<sup>asws</sup>. I hereby testify that You<sup>asws</sup> met Allah<sup>azwj</sup>, and you<sup>asws</sup> were a martyr. May Allah<sup>azwj</sup> Punish your<sup>asws</sup> murderer with the varieties of the Punishments, and Renew the Punishments upon him. ",
            "I come to you having recognised your<sup>asws</sup> right, with an insight concerning you<sup>asws</sup>, and enemy to your<sup>asws</sup> enemies and the ones who oppressed you<sup>asws</sup>. I shall meet my Lord<sup>azwj</sup> being upon that, Allah<sup>azwj</sup> Willing. O Guardian<sup>asws</sup> of Allah<sup>azwj</sup>! There are numerous sins for me, therefore intercede for me to your<sup>asws</sup> Lord<sup>azwj</sup>, there is a praiseworthy status for you<sup>asws</sup> in the Presence of Allah<sup>azwj</sup>, well-known, and that for you<sup>asws</sup>, in the Presence of Allah<sup>azwj</sup>, is a prestige and (right of) intercession, and Allah<sup>azwj</sup> th Exalted has Said <span class=\"ibTxt\"><a href=\"/#/books/quran:21#h28\">[21:28]</a> and they will not be interceding except for the one whom He Approves of</span>’.",
            "Muhammad Bin Ja’far Al Razy, from Muhammad Bin Is Bin Ubeyd, from one of our companions, from Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup> – similar to it."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ‘Uramah from those who have said the following: “Al-Sadiq abu al-Hassan the 3rd has said that one should say this near the gravesite of ’Amir al- Mu’minin. ‘(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O the one who possesses Authority from Allah. You are the first oppressed and the first one whose rights were usurped. You exercised patience nobly until the time of your death. I testify that you went before Allah as a martyr. May Allah punish your assassin by all kinds of punishments and renew his punishments. I, with understanding of your rights and position, have come to visit you. I am aware of your prominent status and I am an enemy of your enemies and those who did injustice to you. I will go before my Lord with this belief, if Allah so wills. O possessor of authority from Allah, I have committed a great deal of sins. So intercede on my behalf before your Lord. You have a praiseworthy position, before Allah, which is well known. You possess high honor before Allah as well as approved intercession. Allah, the most High, has said, ‘No one will be able to intercede before Him except those whom He accepts.’ <a href=\"/#/books/quran:21#h28\">[21:28]</a>” Muhammad ibn Ja’far al-Raziy has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from certain individuals of our people from abu al-Hassan, a similar Hadith. Another Prayer - Another Prayer to be Made Near the Gravesite of ’Amir al- Mu’minin, ‘Alayhi al-Salam “You should say the following near the gravesite of ’Amir al-Mu’minin, ‘Alayhi al-Salam. “(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O friend of Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O Authority of Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O deputy of Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O pillar of religion. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O heir of the prophets. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O person in charge of paradise and hellfire, the person in charge of the ‘Asa’ and Misam (Staff and Marking item). (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O ’Amir al-Mu’minin. I testify that you are the word of piety, the gateway of guidance, the unbreakable ring, the strong rope and the straight path. I testify that you are the authority of Allah over His creatures, His witness over His servants, His trustee of the treasure of His knowledge, the reservoir of His secret, the place of His wisdom and brother of His messenger. I testify that your call and preaching is the truth; and all callers and preachers appointed before you are false and invalid. You are the oppressed, the first one whose rights were usurped, but you exercised patience to be rewarded in the hereafter. May Allah condemn those who did injustice to you, transgressed against you and created obstacles in your way. May Allah condemn them with the strongest condemnation along with condemnation by the angels of prominent positions before Allah, by the messenger- prophets and all believing people whose faith has passed (Allah’s) test. I appeal before Allah to grant salawat (favors and kindness to you worthy of Your services to His cause), O ’Amir al-Mu’minin. I appeal before Allah to shower salawat (favors and kindness) upon your spirit and body. I testify that you are the servant and trustee of Allah. You have preached good advice and kept your trust properly, you died as a truthful person and passed away with pure certainty. You did not give preference to blindness over guidance and you never inclined toward falsehood against the truth. I testify that you performed salat (prayer), paid Zakat, asked people to obey Allah’s commands and to stay away from what Allah has prohibited. You followed the Messenger of Allah, provided guidance to his followers, recited the book in a true manner of recitation, and strove hard in true manners for the cause of Allah. You invited people to the path of Allah with wisdom and good advice until the time of your death. I testify that you lived with the strongest proof and good reason about your Lord and invited people to Him with full awareness. You preached what you were commanded to preach and stood firm for the rights of Allah without acting weakly or showing any weakness. I appeal before Allah to grant salawat (favors and compensation to you worthy of Your services to His cause), with such salat, thereafter, along with it and on its sides one after the other, without any break in between, a timeless and endless one. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) and may Allah grant you blessings and kindness. May Allah reward you, as the truthful one and because of his services to his followers. I testify that Jihad in your support is the true form of Jihad and that truth is on your side and in your favor. You are the man of Jihad and its source and that the legacy of prophet-hood is with you. May Allah grant you salawat (favors and compensation to you worthy of your services to Allah’s cause) and may Allah grant you safety and blessing. May Allah punish your assassin with all kinds of punishment. O ’Amir al-Mu’minin, I have come with my knowledge of your rights and my awareness about your prominent status. I am an enemy of your enemies and a friend of your friends. I pray to Allah to keep my soul and the soul of my parents in service for your cause. I have come to seek refuge with you against the fire, which is prepared for people like myself because of what I have committed against my soul. I have come to you as a visitor seeking thereby freedom for my neck from the hellfire. I have come to you fleeing from my sins, which I have loaded on my back. I have come to you because of your great status and position before my Lord. So intercede on my behalf before your Lord; I have committed great many sins. You have a well-known position before Allah and a great status, and an accepted intercession. Allah, the Most Majestic, the Most Glorious, has said, ‘They do not intercede except for the chosen ones.’ O Allah, (You are) the Lord of lords, the One who responds to those whom He loves. I have sought protection with the brother of Your messenger. Set my neck free from the hellfire. I believe in Allah and in whatever He has revealed to you (family of the Messenger of Allah). I accept as my guardian with love the first one among you and the last one of you just as I do so with first one of you. I reject al-Jibt and al-Taghut, al-Lat and al-‘Uzza’.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:227",
  "kind": "verse_list"
}