{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 230"
        },
        "path": "/books/al-kafi:4:3:230",
        "titles": {
          "ar": "بَابُ زِيَارَةِ قَبْرِ أَبِي عَبْدِ اللَّهِ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام )",
          "en": "Chapter 229 – Ziyarah of the gave of Abu Abdullah Al-Husayn Bin Ali<sup>asws</sup>"
        }
      }
    ],
    "index": 1173,
    "local_index": 230,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 231"
        },
        "path": "/books/al-kafi:4:3:231",
        "titles": {
          "ar": "بَابُ الْقَوْلِ عِنْدَ قَبْرِ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) وَ أَبِي جَعْفَرٍ الثَّانِي وَ مَا يُجْزِئُ مِنَ الْقَوْلِ عِنْدَ كُلِّهِمْ (عليهم السلام)",
          "en": "Chapter 230 – The words to be spoken at the grave of Abu Al-Hassan Musa<sup>asws</sup>, and Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, and what suffices from the words at (the graves) of all of them<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 229"
        },
        "path": "/books/al-kafi:4:3:229",
        "titles": {
          "ar": "بَابُ مَوْضِعِ رَأْسِ الْحُسَيْنِ ( عليه السلام )",
          "en": "Chapter 228 – Place of the head of Al-Husayn<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:230",
    "titles": {
      "ar": "بَابُ زِيَارَةِ قَبْرِ أَبِي عَبْدِ اللَّهِ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام )",
      "en": "Chapter 229 – Ziyarah of the gave of Abu Abdullah Al-Husayn Bin Ali<sup>asws</sup>"
    },
    "verse_count": 4,
    "verse_start_index": 8107,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/291)"
        ],
        "index": 8108,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:230:1",
        "refs": {
          "Mentions": [
            "/books/quran:3:146",
            "/books/quran:31:22",
            "/books/quran:48:26"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ نُعَيْمِ بْنِ الْوَلِيدِ عَنْ يُونُسَ الْكُنَاسِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَتَيْتَ قَبْرَ الْحُسَيْنِ ( عليه السلام ) فَائْتِ الْفُرَاتَ وَ اغْتَسِلْ بِحِيَالِ قَبْرِهِ وَ تَوَجَّهْ إِلَيْهِ وَ عَلَيْكَ السَّكِينَةَ وَ الْوَقَارَ حَتَّى تَدْخُلَ إِلَى الْقَبْرِ مِنَ الْجَانِبِ الشَّرْقِيِّ وَ قُلْ حِينَ تَدْخُلُهُ السَّلَامُ عَلَى مَلَائِكَةِ اللَّهِ الْمُنْزَلِينَ السَّلَامُ عَلَى مَلَائِكَةِ اللَّهِ الْمُرْدِفِينَ السَّلَامُ عَلَى مَلَائِكَةِ اللَّهِ الْمُسَوِّمِينَ السَّلَامُ عَلَى مَلَائِكَةِ اللَّهِ الَّذِينَ هُمْ فِي هَذَا الْحَرَمِ مُقِيمُونَ ",
          "فَإِذَا اسْتَقْبَلْتَ قَبْرَ الْحُسَيْنِ ( عليه السلام ) فَقُلِ السَّلَامُ عَلَى رَسُولِ اللَّهِ السَّلَامُ عَلَى أَمِينِ اللَّهِ عَلَى رُسُلِهِ وَ عَزَائِمِ أَمْرِهِ وَ الْخَاتَمِ لِمَا سَبَقَ وَ الْفَاتِحِ لِمَا اسْتَقْبَلَ وَ الْمُهَيْمِنِ عَلَى ذَلِكَ كُلِّهِ وَ السَّلَامُ عَلَيْهِ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ",
          "ثُمَّ تَقُولُ اللَّهُمَّ صَلِّ عَلَى أَمِيرِ الْمُؤْمِنِينَ عَبْدِكَ وَ أَخِي رَسُولِكَ الَّذِي انْتَجَبْتَهُ بِعِلْمِكَ وَ جَعَلْتَهُ هَادِياً لِمَنْ شِئْتَ مِنْ خَلْقِكَ وَ الدَّلِيلِ عَلَى مَنْ بَعَثْتَهُ بِرِسَالَاتِكَ وَ دَيَّانِ الدِّينِ بِعَدْلِكَ وَ فَصْلِ قَضَائِكَ بَيْنَ خَلْقِكَ وَ الْمُهَيْمِنِ عَلَى ذَلِكَ كُلِّهِ وَ السَّلَامُ عَلَيْهِ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ",
          "اللَّهُمَّ صَلِّ عَلَى الْحَسَنِ بْنِ عَلِيٍّ عَبْدِكَ وَ ابْنِ الَّذِي انْتَجَبْتَهُ بِعِلْمِكَ وَ جَعَلْتَهُ هَادِياً لِمَنْ شِئْتَ مِنْ خَلْقِكَ وَ الدَّلِيلِ عَلَى مَنْ بَعَثْتَهُ بِرِسَالَاتِكَ وَ دَيَّانِ الدِّينِ بِعَدْلِكَ وَ فَصْلِ قَضَائِكَ بَيْنَ خَلْقِكَ وَ الْمُهَيْمِنِ عَلَى ذَلِكَ كُلِّهِ وَ السَّلَامُ عَلَيْهِ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ",
          "ثُمَّ تُصَلِّي عَلَى الْحُسَيْنِ وَ سَائِرِ الْأَئِمَّةِ ( عليهم السلام ) كَمَا صَلَّيْتَ وَ سَلَّمْتَ عَلَى الْحَسَنِ ( عليه السلام ) ثُمَّ تَأْتِي قَبْرَ الْحُسَيْنِ ( عليه السلام ) فَتَقُولُ السَّلَامُ عَلَيْكَ يَا ابْنَ رَسُولِ اللَّهِ السَّلَامُ عَلَيْكَ يَا ابْنَ أَمِيرِ الْمُؤْمِنِينَ صَلَّى اللَّهُ عَلَيْكَ يَا أَبَا عَبْدِ اللَّهِ أَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ عَنِ اللَّهِ عَزَّ وَ جَلَّ مَا أُمِرْتَ بِهِ وَ لَمْ تَخْشَ أَحَداً غَيْرَهُ وَ جَاهَدْتَ فِي سَبِيلِهِ وَ عَبَدْتَهُ صَادِقاً حَتَّى أَتَاكَ الْيَقِينُ",
          "أَشْهَدُ أَنَّكَ كَلِمَةُ التَّقْوَى وَ بَابُ الْهُدَى وَ الْعُرْوَةُ الْوُثْقَى وَ الْحُجَّةُ عَلَى مَنْ يَبْقَى وَ مَنْ تَحْتَ الثَّرَى أَشْهَدُ أَنَّ ذَلِكَ سَابِقٌ فِيمَا مَضَى وَ ذَلِكَ لَكُمْ فَاتِحٌ فِيمَا بَقِيَ أَشْهَدُ أَنَّ أَرْوَاحَكُمْ وَ طِينَتَكُمْ طَيِّبَةٌ طَابَتْ وَ طَهُرَتْ هِيَ بَعْضُهَا مِنْ بَعْضٍ مَنّاً مِنَ اللَّهِ وَ رَحْمَةً",
          "وَ أُشْهِدُ اللَّهَ وَ أُشْهِدُكُمْ أَنِّي بِكُمْ مُؤْمِنٌ وَ لَكُمْ تَابِعٌ فِي ذَاتِ نَفْسِي وَ شَرَائِعِ دِينِي وَ خَاتِمَةِ عَمَلِي وَ مُنْقَلَبِي وَ مَثْوَايَ وَ أَسْأَلُ اللَّهَ الْبَرَّ الرَّحِيمَ أَنْ يُتِمَّ ذَلِكَ لِي أَشْهَدُ أَنَّكُمْ قَدْ بَلَّغْتُمْ عَنِ اللَّهِ مَا أَمَرَكُمْ بِهِ وَ لَنْ تَخْشَوْا أَحَداً غَيْرَهُ وَ جَاهَدْتُمْ فِي سَبِيلِهِ وَ عَبَدْتُمُوهُ حَتَّى أَتَاكُمُ الْيَقِينُ",
          "لَعَنَ اللَّهُ مَنْ قَتَلَكُمْ وَ لَعَنَ اللَّهُ مَنْ أَمَرَ بِهِ وَ لَعَنَ اللَّهُ مَنْ بَلَغَهُ ذَلِكَ مِنْهُمْ فَرَضِيَ بِهِ أَشْهَدُ أَنَّ الَّذِينَ انْتَهَكُوا حُرْمَتَكُمْ وَ سَفَكُوا دَمَكُمْ مَلْعُونُونَ عَلَى لِسَانِ النَّبِيِّ الْأُمِّيِّ ( صلى الله عليه وآله )",
          "ثُمَّ تَقُولُ اللَّهُمَّ الْعَنِ الَّذِينَ بَدَّلُوا نِعْمَتَكَ وَ خَالَفُوا مِلَّتَكَ وَ رَغِبُوا عَنْ أَمْرِكَ وَ اتَّهَمُوا رَسُولَكَ وَ صَدُّوا عَنْ سَبِيلِكَ اللَّهُمَّ احْشُ قُبُورَهُمْ نَاراً وَ أَجْوَافَهُمْ نَاراً وَ احْشُرْهُمْ وَ أَشْيَاعَهُمْ إِلَى جَهَنَّمَ زُرْقاً",
          "اللَّهُمَّ الْعَنْهُمْ لَعْناً يَلْعَنُهُمْ بِهِ كُلُّ مَلَكٍ مُقَرَّبٍ وَ كُلُّ نَبِيٍّ مُرْسَلٍ وَ كُلُّ عَبْدٍ مُؤْمِنٍ امْتَحَنْتَ قَلْبَهُ لِلْإِيمَانِ اللَّهُمَّ الْعَنْهُمْ فِي مُسْتَسِرِّ السِّرِّ وَ فِي ظَاهِرِ الْعَلَانِيَةِ اللَّهُمَّ الْعَنْ جَوَابِيتَ هَذِهِ الْأُمَّةِ وَ الْعَنْ طَوَاغِيتَهَا وَ الْعَنْ فَرَاعِنَتَهَا وَ الْعَنْ قَتَلَةَ أَمِيرِ الْمُؤْمِنِينَ وَ الْعَنْ قَتَلَةَ الْحُسَيْنِ وَ عَذِّبْهُمْ عَذَاباً لَا تُعَذِّبُ بِهِ أَحَداً مِنَ الْعَالَمِينَ اللَّهُمَّ اجْعَلْنَا مِمَّنْ يَنْصُرُهُ وَ تَنْتَصِرُ بِهِ وَ تَمُنُّ عَلَيْهِ بِنَصْرِكَ لِدِينِكَ فِي الدُّنْيَا وَ الْآخِرَةِ ",
          "ثُمَّ اجْلِسْ عِنْدَ رَأْسِهِ فَقُلْ صَلَّى اللَّهُ عَلَيْكَ أَشْهَدُ أَنَّكَ عَبْدُ اللَّهِ وَ أَمِينُهُ بَلَّغْتَ نَاصِحاً وَ أَدَّيْتَ أَمِيناً وَ قُتِلْتَ صِدِّيقاً وَ مَضَيْتَ عَلَى يَقِينٍ لَمْ تُؤْثِرْ عَمًى عَلَى هُدًى وَ لَمْ تَمِلْ مِنْ حَقٍّ إِلَى بَاطِلٍ",
          "أَشْهَدُ أَنَّكَ قَدْ أَقَمْتَ الصَّلَاةَ وَ آتَيْتَ الزَّكَاةَ وَ أَمَرْتَ بِالْمَعْرُوفِ وَ نَهَيْتَ عَنِ الْمُنْكَرِ وَ اتَّبَعْتَ الرَّسُولَ وَ تَلَوْتَ الْكِتَابَ حَقَّ تِلَاوَتِهِ وَ دَعَوْتَ إِلَى سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَ الْمَوْعِظَةِ الْحَسَنَةِ صَلَّى اللَّهُ عَلَيْكَ وَ سَلَّمَ تَسْلِيماً وَ جَزَاكَ اللَّهُ مِنْ صِدِّيقٍ خَيْراً عَنْ رَعِيَّتِكَ",
          "وَ أَشْهَدُ أَنَّ الْجِهَادَ مَعَكَ جِهَادٌ وَ أَنَّ الْحَقَّ مَعَكَ وَ إِلَيْكَ وَ أَنْتَ أَهْلُهُ وَ مَعْدِنُهُ وَ مِيرَاثَ النُّبُوَّةِ عِنْدَكَ وَ عِنْدَ أَهْلِ بَيْتِكَ صَلَّى اللَّهُ عَلَيْكَ وَ سَلَّمَ تَسْلِيماً أَشْهَدُ أَنَّكَ صِدِّيقُ اللَّهِ وَ حُجَّتُهُ عَلَى خَلْقِهِ وَ أَشْهَدُ أَنَّ دَعْوَتَكَ حَقٌّ وَ كُلَّ دَاعٍ مَنْصُوبٍ غَيْرَكَ فَهُوَ بَاطِلٌ مَدْحُوضٌ وَ أَشْهَدُ أَنَّ اللَّهَ هُوَ الْحَقُّ الْمُبِينُ",
          "ثُمَّ تَحَوَّلُ عِنْدَ رِجْلَيْهِ وَ تَخَيَّرُ مِنَ الدُّعَاءِ وَ تَدْعُو لِنَفْسِكَ ثُمَّ تَحَوَّلُ عِنْدَ رَأْسِ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَ تَقُولُ سَلَامُ اللَّهِ وَ سَلَامُ مَلَائِكَتِهِ الْمُقَرَّبِينَ وَ أَنْبِيَائِهِ الْمُرْسَلِينَ يَا مَوْلَايَ وَ ابْنَ مَوْلَايَ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ عَلَيْكَ صَلَّى اللَّهُ عَلَيْكَ وَ عَلَى أَهْلِ بَيْتِكَ وَ عِتْرَةِ آبَائِكَ الْأَخْيَارِ الْأَبْرَارِ الَّذِينَ أَذْهَبَ اللَّهُ عَنْهُمُ الرِّجْسَ وَ طَهَّرَهُمْ تَطْهِيراً",
          "ثُمَّ تَأْتِي قُبُورَ الشُّهَدَاءِ وَ تُسَلِّمُ عَلَيْهِمْ وَ تَقُولُ السَّلَامُ عَلَيْكُمْ أَيُّهَا الرَّبَّانِيُّونَ أَنْتُمْ لَنَا فَرَطٌ وَ نَحْنُ لَكُمْ تَبَعٌ وَ نَحْنُ لَكُمْ خَلَفٌ وَ أَنْصَارٌ أَشْهَدُ أَنَّكُمْ أَنْصَارُ اللَّهِ وَ سَادَةُ الشُّهَدَاءِ فِي الدُّنْيَا وَ الْآخِرَةِ فَإِنَّكُمْ أَنْصَارُ اللَّهِ كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ كَأَيِّنْ مِنْ نَبِيٍّ قاتَلَ مَعَهُ رِبِّيُّونَ كَثِيرٌ فَما وَهَنُوا لِما أَصابَهُمْ فِي سَبِيلِ اللَّهِ وَ ما ضَعُفُوا وَ مَا اسْتَكانُوا وَ مَا ضَعُفْتُمْ وَ مَا اسْتَكَنْتُمْ حَتَّى لَقِيتُمُ اللَّهَ عَلَى سَبِيلِ الْحَقِّ وَ نُصْرَةِ كَلِمَةِ اللَّهِ التَّامَّةِ ",
          "صَلَّى اللَّهُ عَلَى أَرْوَاحِكُمْ وَ أَبْدَانِكُمْ وَ سَلَّمَ تَسْلِيماً أَبْشِرُوا بِمَوْعِدِ اللَّهِ الَّذِي لَا خُلْفَ لَهُ إِنَّهُ لَا يُخْلِفُ الْمِيعَادَ وَ اللَّهُ مُدْرِكٌ لَكُمْ بِثَارِ مَا وَعَدَكُمْ أَنْتُمْ سَادَةُ الشُّهَدَاءِ فِي الدُّنْيَا وَ الْآخِرَةِ أَنْتُمُ السَّابِقُونَ وَ الْمُهَاجِرُونَ وَ الْأَنْصَارُ أَشْهَدُ أَنَّكُمْ قَدْ جَاهَدْتُمْ فِي سَبِيلِ اللَّهِ وَ قُتِلْتُمْ عَلَى مِنْهَاجِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ ابْنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ سَلَّمَ تَسْلِيماً الْحَمْدُ لِلَّهِ الَّذِي صَدَقَكُمْ وَعْدَهُ وَ أَرَاكُمْ مَا تُحِبُّونَ",
          "ثُمَّ تَرْجِعُ إِلَى الْقَبْرِ وَ تَقُولُ أَتَيْتُكَ يَا حَبِيبَ رَسُولِ اللَّهِ وَ ابْنَ رَسُولِهِ وَ إِنِّي بِكَ عَارِفٌ وَ بِحَقِّكَ مُقِرٌّ بِفَضْلِكَ مُسْتَبْصِرٌ بِضَلَالَةِ مَنْ خَالَفَكَ عَارِفٌ بِالْهُدَى الَّذِي أَنْتُمْ عَلَيْهِ بِأَبِي أَنْتَ وَ أُمِّي وَ نَفْسِي اللَّهُمَّ إِنِّي أُصَلِّي عَلَيْهِ كَمَا صَلَّيْتَ عَلَيْهِ أَنْتَ وَ رَسُولُكَ وَ أَمِيرُ الْمُؤْمِنِينَ صَلَاةً مُتَتَابِعَةً مُتَوَاصِلَةً مُتَرَادِفَةً تَتْبَعُ بَعْضُهَا بَعْضاً لَا انْقِطَاعَ لَهَا وَ لَا أَمَدَ وَ لَا أَجَلَ فِي مَحْضَرِنَا هَذَا وَ إِذَا غِبْنَا وَ شَهِدْنَا وَ السَّلَامُ عَلَيْكَ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ",
          "وَ إِذَا أَرَدْتَ أَنْ تُوَدِّعَهُ فَقُلِ السَّلَامُ عَلَيْكَ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ أَسْتَوْدِعُكَ اللَّهَ وَ أَقْرَأُ عَلَيْكَ السَّلَامَ آمَنَّا بِاللَّهِ وَ بِالرَّسُولِ وَ بِمَا جِئْتَ بِهِ وَ دَلَلْتَ عَلَيْهِ وَ اتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
          "اللَّهُمَّ لَا تَجْعَلْهُ آخِرَ الْعَهْدِ مِنَّا وَ مِنْهُ اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَنْفَعَنَا بِحُبِّهِ اللَّهُمَّ ابْعَثْهُ مَقَاماً مَحْمُوداً تَنْصُرُ بِهِ دِينَكَ وَ تَقْتُلُ بِهِ عَدُوَّكَ وَ تُبِيرُ بِهِ مَنْ نَصَبَ حَرْباً لآِلِ مُحَمَّدٍ فَإِنَّكَ وَعَدْتَ ذَلِكَ وَ أَنْتَ لَا تُخْلِفُ الْمِيعَادَ ",
          "السَّلَامُ عَلَيْكَ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ أَشْهَدُ أَنَّكُمْ شُهَدَاءُ نُجَبَاءُ جَاهَدْتُمْ فِي سَبِيلِ اللَّهِ وَ قُتِلْتُمْ عَلَى مِنْهَاجِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ سَلَّمَ تَسْلِيماً كَثِيراً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Nuaym Bin Al Waleed, from Yunus Al Kunasy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you go to the grave of Al-Husayn<sup>asws</sup>, so go to the Euphrates and wash by his<sup>asws</sup> grave and divert your attention towards him<sup>asws</sup>, and upon you should be the tranquillity and the dignity until you enter to go to the grave from the eastern side, and said, when you are entering, ‘The greetings be upon the descending Angels of Allah<sup>azwj</sup>! The greetings be upon the replacement Angels of Allah<sup>azwj</sup>! The greetings be upon the Branding Angels of Allah<sup>azwj</sup>. The greetings be upon the Angels of Allah<sup>azwj</sup> who are stationed in this <span class=\"iTxt\">Harram</span>!",
            "So when you face the grave of Al-Husayn<sup>asws</sup>, so say, ‘The greetings be upon Rasool-Allah<sup>saww</sup>! The greetings be upon the trustworthy one of Allah<sup>azwj</sup> upon His<sup>azwj</sup> Rasools<sup>as</sup>, and the most determined one in His<sup>azwj</sup> Commands, and the final seal due to what preceded, and the opening of what is in the future, and the dominant one upon all of that. And the greetings be upon him<sup>saww</sup>, and Mercy of Allah<sup>azwj</sup>, and His<sup>azwj</sup> Blessings’. ",
            "Then you should be saying, ‘O Allah<sup>azwj</sup> Send Blessings upon Amir Al Momineen<sup>asws</sup>, Your<sup>azwj</sup> servant, and brother<sup>asws</sup> of Your<sup>azwj</sup> Rasool<sup>saww</sup> whom You<sup>azwj</sup> Appointed with Your<sup>azwj</sup> Knowledge, and Made him<sup>saww</sup> as a gift to the ones whom You<sup>azwj</sup> so Desired from Your<sup>azwj</sup> creatures, and the pointer upon the ones whom You<sup>azwj</sup> Sent with Your<sup>azwj</sup> Messages, and the established of the Religion with Your<sup>azwj</sup> Justice, and a decider of Your<sup>azwj</sup> Judgements in between Your<sup>azwj</sup> creatures, and the dominant one upon all of that. And the greetings be upon him<sup>saww</sup>, and Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings.",
            "O Allah<sup>azwj</sup>! Send Blessings upon Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup>, Your<sup>azwj</sup> servant, and son<sup>asws</sup> one whom You<sup>azwj</sup> Chose with Your<sup>azwj</sup> Knowledge, and Made him<sup>saww</sup> as a guide for the ones whom You<sup>azwj</sup> so Desired from Your<sup>azwj</sup> creatures, and the pointed upon the ones whom You<sup>azwj</sup> Sent with Your<sup>azwj</sup> Messages, and an establisher of the Religion with Your<sup>azwj</sup> justice, and a decider of Your<sup>azwj</sup> Judgements in between Your<sup>azwj</sup> creatures, and the dominant upon all of that. And the greetings be upon him<sup>asws</sup> and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings’.",
            "Then you should send Blessings upon Al-Husayn<sup>asws</sup> and the rest of the Imams<sup>asws</sup> just as you sent upon Al-Hassan<sup>asws</sup>. Then go to the grave of Al-Husayn<sup>asws</sup>, and you should be saying, ‘The greetings be upon you<sup>asws</sup>, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! The greetings be upon you<sup>asws</sup>, O son<sup>asws</sup> of Amir Al-Momineen<sup>asws</sup>! O Abu Abdullah<sup>asws</sup>! I hereby testify that you<sup>asws</sup> had delivered on behalf of Allah<sup>azwj</sup> Mighty and Majestic what you<sup>asws</sup> had been Commanded with, and did not fear anyone apart from Him<sup>azwj</sup>; and you<sup>asws</sup> struggled in His<sup>azwj</sup> Way, and worshipped Him<sup>azwj</sup> truthfully until the conviction (death) came to you<sup>asws</sup>. ",
            "I testify that you<sup>asws</sup> are the <span class=\"ibTxt\"><a href=\"/#/books/quran:48#h26\">[48:26]</a> the word of piety</span>, and the door of guidance, and the <span class=\"ibTxt\"><a href=\"/#/books/quran:31#h22\">[31:22]</a> the Firmest Handle</span>, and the Proof upon the ones who remain, and the ones under the ground. I testify that preceded in what has past, and that is a victory for you<sup>asws</sup> regarding what remains. I testify that your<sup>asws</sup> souls and your<sup>asws</sup> essences are good, Made good and Purified, and one of them was from the other, being a Favour from Allah<sup>azwj</sup>, and a Mercy. ",
            "And I testify by Allah<sup>azwj</sup>, and keep you<sup>asws</sup> as witnesses that I am a believer in you<sup>asws</sup>, and a follower of yours<sup>asws</sup> with regards to my own person, and Laws of my Religion, and the completion of my deeds, and my transference, and my place of rest. And I ask Allah<sup>azwj</sup>, the Benefactor, the Merciful, that He<sup>azwj</sup> Completes that for me. I testify that you<sup>asws</sup> have preached on behalf of Allah<sup>azwj</sup> what you<sup>asws</sup> had been Commanded with, and never feared anyone apart from Him<sup>azwj</sup>, and you<sup>asws</sup> struggled in His<sup>azwj</sup> Way, and worshipped Him<sup>azwj</sup> until the conviction (death) came to you<sup>asws</sup> all. ",
            "And May Allah<sup>azwj</sup> Curse the ones who murdered you<sup>asws</sup>, and the one who ordered with it, and may Allah<sup>azwj</sup> Curse the ones who executed it from them, so he was pleased with it. I testify that those who violated your<sup>asws</sup> sanctities and spilt your<sup>asws</sup> blood are accursed upon the tongue of the <span class=\"iTxt\">Ummy</span> Prophet<sup>saww</sup>.",
            "Then you should be saying, ‘O Allah<sup>azwj</sup>! Curse those who changed Your<sup>azwj</sup> Bounties and opposed Your<sup>azwj</sup> Religion, and turned away from Your<sup>azwj</sup> Commands, and falsely accused Your<sup>azwj</sup> Rasool<sup>saww</sup>, and prevented from Your<sup>azwj</sup> Way. O Allah<sup>azwj</sup>! Fill their graves with Fire, and their insides with Fire, and Resurrect them and their adherents to Hell as blue-eyed.",
            "O Allah<sup>azwj</sup>! Curse them with such a Curse that every Angel of Proximity would curse with, and every Musril Prophet<sup>saww</sup>, and every Believing servant whose heart has been Tested for the faith. O Allah<sup>azwj</sup>! Curse them in private, privately, and in the open, publicly. O Allah<sup>azwj</sup>! Curse the false gods of this community, and Curse its tyrants, and Curse its Pharaohs, and Curse the murderer of Amir Al-Momineen<sup>asws</sup>, and Curse the murderer of Al-Husayn<sup>asws</sup>, and Punish them with such a Punishment which no one has been Punished with from the worlds. O Allah<sup>azwj</sup>! Make us to be from the ones who help him<sup>asws</sup>, and are sought for help, and Favoured upon with Your<sup>azwj</sup> Help for Your<sup>azwj</sup> Religion, in the world and the Hereafter.",
            "Then sit by his<sup>asws</sup> head, so say, ‘O Allah<sup>azwj</sup> May the Blessings of Allah<sup>azwj</sup> be upon you<sup>asws</sup>! I testify that you<sup>asws</sup> are a servant of Allah<sup>azwj</sup>, and His<sup>azwj</sup> trustworthy one. You<sup>asws</sup> delivered the preaching, and fulfilled the entrustments, and were murdered while being truthful, and passed away upon conviction, never having had preferred the blindness over guidance, and did not incline away from Truth to the falsehood. ",
            "I testify that you<sup>asws</sup> have established the <span class=\"iTxt\">Salaat</span>, and paid the Zakat, and enjoined with the goodness and forbade from the evil, and followed the Rasool<sup>saww</sup>, and recited the Book as its was its right to be recited, and called to the Way of your<sup>asws</sup> Lord<sup>azwj</sup> with the wisdom and the goodly preachings. May Allah<sup>azwj</sup> Send Blessings upon you<sup>asws</sup>, and greetings with abundant greetings. And may Allah<sup>azwj</sup> Recompense you<sup>asws</sup> goodly from the truthful ones of your<sup>asws</sup> citizens. ",
            "And I testify that the Jihad with you is a Jihad, and that the Truth is with you<sup>asws</sup>, and to you<sup>asws</sup>, and you<sup>asws</sup> are its rightful one, and its mine, and the inheritance of the Prophet-hood is with you<sup>asws</sup>, and with the People<sup>asws</sup> of your<sup>asws</sup> Household. May Allah<sup>azwj</sup> Send Blessings upon you<sup>asws</sup>, and greetings with abundant greetings. I testify that you<sup>asws</sup> are the truthful one of Allah<sup>azwj</sup>, and His<sup>azwj</sup> Proof upon His<sup>azwj</sup> creatures. And I testify that you<sup>asws</sup> was true, and every caller linked to other than you<sup>asws</sup>, is on the falsehood, refuted. And I testify that Allah<sup>azwj</sup>, He<sup>azwj</sup> is the Evident Truth’. ",
            "Then transfer yourself to be by his<sup>asws</sup> feet, and choose from the supplications, and supplicate for yourself. Then transfer to be by the head of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> and you should be saying, ‘Greeting of Allah<sup>azwj</sup>, and greetings of His<sup>azwj</sup> Angels of Proximity, and His<sup>azwj</sup> Mursil Prophets<sup>as</sup>, O my Master<sup>asws</sup>, and son<sup>asws</sup> of my Master<sup>asws</sup>, and Mercy of Allah<sup>azwj</sup>, and His<sup>azwj</sup> Blessings be upon you<sup>asws</sup>, and upon the People<sup>asws</sup> of your<sup>asws</sup> Household, and the goodly offspring of your<sup>asws</sup> forefathers<sup>asws</sup>, the righteous ones from whom<sup>asws</sup> Allah<sup>azwj</sup> Kept Away the uncleanness from them<sup>asws</sup> and Purified them<sup>asws</sup> with a Purification’.  ",
            "Then go to the graves of the martyrs and greet upon them, and you should be saying, ‘The greetings be upon you, O Rabbis. You all preceded us and we are following you, and we are behind you and are your helpers. I testify that you are the helpers of Allah<sup>azwj</sup>, and chiefs of the martyrs in the world and the Hereafter, for you all helped Allah<sup>azwj</sup> just as Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h146\">[3:146]</a> And how many a Prophet has fought with whom were many worshippers of the Lord; so they did not become weak-hearted on account of what befell them in Allah's Way, nor did they weaken, nor did they abase themselves</span> – you were neither weak nor calmed down until you met Allah<sup>azwj</sup> upon the way of the Truth, and helped the Perfect Word of Allah<sup>azwj</sup>.",
            "May Allah<sup>azwj</sup> Bless your souls and your bodies, and Greet you with abundant greetings. Received glad tidings by the Promises of Allah<sup>azwj</sup>, which there is no opposing it because He<sup>azwj</sup> does not break His<sup>azwj</sup> Promises. And Allah<sup>azwj</sup> is Aware of you with the rest of what He<sup>azwj</sup> Promised you. You are the chiefs of the martyrs in the world and the Hereafter. You are the preceding ones, and the emigrants, and the helpers. I testify that you have struggled in the Way of Allah<sup>azwj</sup>, and fought upon the manifesto of Rasool-Allah<sup>saww</sup>, and son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>, and greetings (be upon you) with abundant greetings. The Praise is for Allah<sup>azwj</sup> Who Made His<sup>azwj</sup> Promises come true and Showed you what you were longing for’.",
            "Then return to the grave and you should be saying, ‘I come to you<sup>asws</sup>, of beloved of Rasool-Allah<sup>saww</sup>, and son<sup>asws</sup> of His<sup>azwj</sup> Rasool<sup>saww</sup>, and I am a recogniser of your<sup>asws</sup> right, acknowledger of your<sup>asws</sup> merits with an insight into the ones who opposed you<sup>asws</sup>, recognising the guidance which you<sup>asws</sup> are upon. May my father and my mother and myself be sacrificed for you<sup>asws</sup>! O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> to Send Blessings upon him<sup>asws</sup> just as You<sup>azwj</sup>, and Your<sup>azwj</sup> Rasool<sup>saww</sup>, and Amir Al-Momineen<sup>asws</sup> Sent Blessings consecutively, continuously, in tandem, one following the other, there being no interruption to it, nor a time, nor a term, in this presence of ours, and when we are absent and present, and the greetings be upon you<sup>asws</sup>, and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings’. ",
            "And when you want to bid farewell, so say, ‘The greetings be upon you, and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings! I entrust you<sup>asws</sup> to Allah<sup>azwj</sup>, and covey the greetings upon you<sup>asws</sup>, believing in Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and in whatever you<sup>asws</sup> came with, and pointed upon, and made us to follow the Rasool<sup>saww</sup>, so we would be Recorded to be with the witnesses. ",
            "O Allah<sup>azwj</sup>! Do Make it to be the last of the promises from us and from him<sup>asws</sup>. O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> that You Benefit us with his<sup>asws</sup> love. O Allah<sup>azwj</sup>! Resurrect him<sup>asws</sup> in the praiseworthy place, by which Your<sup>azwj</sup> Religion would be helped by, and by which Your<sup>azwj</sup> enemies be fought against, and by which the ones who establish war against the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> can be defeated, for You<sup>azwj</sup> Promised that and You<sup>azwj</sup> do not break the Promises.",
            "The greetings be upon you<sup>asws</sup>, and Mercy of Allah<sup>azwj</sup>, and His<sup>azwj</sup> Blessings. I testify that you are the martyrs who fought in the Way of Allah<sup>azwj</sup>, and were killed upon the manifesto of Rasool-Allah<sup>saww</sup>, and greetings be with abundant greetings’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa’id from Fadalah ibn Ayyub from Nu’aym ibn al-Walid from Yunus al-Kunasiy who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that when you decide to visit the gravesite of al-Husayn, ‘Alayhi al-Salam, go to al-Furat and take a bath near his gravesite; then move toward him in a serene and dignified manner until you enter the shrine from its east side. During entering say, ‘I offer greeting of peace to the descending angels of Allah. I offer greeting of peace to the substituting angels of Allah. I offer greeting of peace to the marking angels of Allah. I offer greeting of peace to the angel of Allah who live in this sacred place.’ When you are in front of the gravesite of Al-Husayn, ‘Alayhi al-Salam, you should say, ‘(I hereby declare, affirm and acknowledge the divine authority of and my) submission to (the commandments of) the Messenger of Allah. (I hereby declare, affirm and acknowledge the divine authority of the trustee of Allah over His messengers and His decisive commandments, the seal of that which were before and the opening of that which is to come and the dominant over all of the affairs. May Allah grant him protection, kindness and blessings.’ Then you should say, £ 0 Allah, I appeal before You to grant salawat (favors and compensation) to ’Amir al- Mu’minin, Ali, Your servant, brother of Your messenger, whom You have chosen through Your knowledge and have made a guide for whomever of Your creatures You wanted and a vanguard for those whom You have sent with Your messages. He is the one provider and facilitator of the system of justice of Your religion according to Your justice, a differentiator in the issuance of Your judgment among Your creatures and the dominant over all such affairs. O Allah, grant him protection, kindness and blessing. O Allah, I appeal before You to grant salawat (favors and compensation to al-Hassan ibn Ali, worthy of his services to Your cause). He is Your servant and the son of the one whom You have chosen through Your knowledge and have appointed a guide for whomever You wanted of Your creatures, a vanguard for those whom You have sent with Your messages. He is the one provider and facilitator of the system of justice of Your religion according to Your justice, a differentiator in the issuance of Your judgment among Your creatures and the dominant over all such affairs. O Allah grant him protection, kindness and blessing.’ Then say salawat al-Salam for al-Husayn and all other ’A’immah, ‘Alayhim al-Salam, just as you said for (Imam) al-Hassan, ‘Alayhi al-Salam. Thereafter go near the gravesite of al-Husayn, ‘Alayhi al-Salam, and say, ‘(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O grandson of the Messenger of Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O son of ’Amir al-Mu’minin. I appeal before Allah to grant salawat (favors and compensation to you worthy of Your services to His cause) O abu ‘Abd Allah. I testify that you completed the task Allah, the Most Majestic, the Most Glorious, had commanded you to accomplish. You were not afraid of anyone other than Allah, strove hard for His cause, worshipped Him a true worshipping until the time of your martyrdom. I testify that you are the words of piety, the gateway of guidance, the unbreakable safety ring, the authority of Allah over the living and those under the earth. I testify that such qualities existed with you in the past and they are means of victory and triumph in future. I testify that your spirits and your clay (substance of your bodies) are clean, pure and cleansed. The substances of you (’A’immah) bodies were one from the other. It was a favor and great kindness for us from Allah. I designate Allah as my witness and I designate you as my witness that I believe in your (divine authority), I am your follower in my soul, in the rules of my religion, in the consequences of my deeds, in my return and my place of rest. I appeal before Allah, Honorable and Merciful to complete it for me. I testify that you accomplished all that Allah had commanded you to do and in so doing you were not afraid of anyone other than Allah. You strove hard for His cause, worshipped Him until the time of your death. I appeal before Allah to condemn those who murdered you, those who commanded your murderer and those condoned with the plan of your murderers. I testify that the statements of the Holy Prophet condemned those who violated your sanctity and spilled your blood.’ “Thereafter say, ‘O Allah, condemn those who have misrepresented Your bounty, opposed Your institution, turned away from Your command, accused Your messenger and created obstacles in Your path. O Allah, fill their graves with fire as well as their bellies and drive them and their followers to hell with their eyes turned blue. O Allah, condemn them with such condemnation with which the prominent angels, every messenger-prophet and every believing person whose faith is tested for its strength will condemn. O Allah, condemn them in most secrecy and concealment as well as openly in public manner. O Allah, condemn Jawabit (pi. of Jibt, devil) of this nation as well as its Tawaghit (pi. of taghut, transgressors), condemn its Pharaohs, condemn the murderers of ’Amir al-Mu’minin, the murderers of al-Husayn and punish them with such punishment which no one in the world is punished with. O Allah, make us of those who support him, of those whom You use for support and You grant them Your support for the cause of Your religion in this world as well as in the next world.’ “Then sit down near his head and say, I appeal before Allah to grant salawat (favors and compensation to you worthy of Your services to His cause). I testify that you are a servant of Allah, His trustee who has accomplished with wisdom the task of trustworthiness, spoke as truthful person and passed away with certainty. You did not accept blindness in place of guidance and never deviated from truth to falsehood. I testify that you performed salat (prayer), paid zakat, commanded people to do good and forbade them from doing evil deeds, followed the Messenger, recited the book in the true way of recitation and called people to the path of your Lord with wisdom and good advice. I appeal before Allah to grant salawat (favors and compensation to you worthy of Your services to His cause), with safety and protection. I appeal before Allah to reward you as with the reward of a truthful one’s good rewards for his services to his people. I testify that Jihad (striving for the cause of Allah) in your support is the true Jihad. I testify that truth is on your side, it belongs to you, you are of the people of truth, the source of truth and that the legacy of prophet-hood is with you and with the people of your family. I appeal before Allah to grant salawat (favors and compensation to you worthy of Your services to His cause), with peace and protection. I testify that you are Allah’s truthful servant and His authority over his creatures. I testify that your call is truthful call and every caller appointed beside you is false and invalid. I testify that Allah is the clear truth.’ “Thereafter you should go toward his feet and pray for yourself as you may choose. ‘Then you should go toward the head of Ali ibn al-Husayn and say, ‘I appeal before Allah to grant you His protection and peace and the greeting of peace of His prominent angels and prophets who were sent as messengers. You are my master and the son of my master. I appeal before Allah to bless you with His kindness and blessings. I appeal before Allah to grant compensation and reward to you, your family and the offspring of your noble and chosen ancestors from whom Allah has decided to remove all rijs (all filthy matters) and purify in a through purification.’ “Thereafter you should go to the gravesites of the martyrs and offer them your greetings of peace and say, I appeal before Allah to grant you peace and protection, O believers in the Lord, you have proceeded and we follow you. We are your followers and supporters. I testify that you are supporters of Allah, the masters of the martyrs in this world and in the next life. You are supporters of Allah as Allah, the Most Majestic, the Most Glorious, has said, “There were many prophets on whose side people believing in the Lord were fighting. They did not show any lack of responsibility even though they were hurt for the cause of Allah, nor showed any weakness or compromise with the enemy.” <a href=\"/#/books/quran:3#h146\">[3:146]</a> You indeed did not show any weakness or compromise with the enemy, until you went before Allah on the path of the truth, supporting the perfect words of Allah. I appeal before Allah to grant favors and compensation to your spirits and bodies worthy of your services to His cause, with peace and protection. There is good news for you through the promise of Allah, which does not change, because He does not change His promises. Allah will accomplish His granting what He has promised to you, the masters of the martyrs, in this world and in the next life. You are the first al-Muhajirun (immigrants (to Allah)) and al- Ansar (the helpers). I testify that you did Jihad (strove hard) for the cause of Allah and you were murdered while protecting the institution of the Messenger of Allah and the son (the child) of the Messenger of Allah, I appeal before Allah to grant salawat (favors and compensation to Muhammad and his family worthy of their services to Your cause) with peace and protection. All praise belongs to Allah who made His promise with you to come true and showed you what you loved.’ “Then return to the gravesite and say, ‘I have come to you, O beloved of the Messenger of Allah, the son (child) of the Messenger of Allah. I am aware of your status and I acknowledge your rights. I am aware of your merits and the straying of those who opposed you. I have knowledge of the guidance you follow. I pray to Allah to keep my soul and the souls of my parents in service for your cause. O Allah, I appeal before You to grant salawat (favors and compensation to you worthy of Your services to His cause) just as You have granted favors and compensation worthy of his services to Your cause, and as Your messenger and ’Amir al-Mu’minin have appealed before You to grant compensation to him worthy of his services to Your cause. Grant him a continuous salat, connected, substituted one, following the other without break in time or point of time at this time and when we are here or not here. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) and appeal before Allah to grant you protection, kindness and blessings’. “When you decide to say farewell to him say, ’(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) and appeal before Allah to grant you protection and kindness and blessings. I leave you in the protection of Allah and offer you my greeting of peace. We believe in Allah, the Messenger of Allah and in what you have brought and guided to. We have followed the messenger, so list us among the witnesses. O Allah, do not make this the last chance for me to visit him and his seeing us. O Allah, I appeal before You to make us benefit from our love for him. O Allah, raise him to the praiseworthy position whereby You support through him Your religion, eliminate Your enemies, destroy those who commence a war against the family of Muhammad, ‘Alayhi al-Salam; You have promised so and You do not change Your promise. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments and I appeal before Allah to grant you protection, kindness and blessings. I testify that you are noble martyrs who strove hard for the cause of Allah and were murdered while protecting the institution of the Messenger of Allah, O Allah, grant salawat (favors and compensation to Muhammad and his family worthy of their services to Your cause) with protection and safety a great deal.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/297)"
        ],
        "index": 8109,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:230:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنِ الْحُسَيْنِ بْنِ ثُوَيْرٍ قَالَ كُنْتُ أَنَا وَ يُونُسُ بْنُ ظَبْيَانَ وَ الْمُفَضَّلُ بْنُ عُمَرَ وَ أَبُو سَلَمَةَ السَّرَّاجُ جُلُوساً عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ كَانَ الْمُتَكَلِّمُ مِنَّا يُونُسَ وَ كَانَ أَكْبَرَنَا سِنّاً فَقَالَ لَهُ جُعِلْتُ فِدَاكَ إِنِّي أَحْضُرُ مَجْلِسَ هَؤُلَاءِ الْقَوْمِ يَعْنِي وُلْدَ الْعَبَّاسِ فَمَا أَقُولُ فَقَالَ إِذَا حَضَرْتَ فَذَكَرْتَنَا فَقُلِ اللَّهُمَّ أَرِنَا الرَّخَاءَ وَ السُّرُورَ فَإِنَّكَ تَأْتِي عَلَى مَا تُرِيدُ",
          "فَقُلْتُ جُعِلْتُ فِدَاكَ إِنِّي كَثِيراً مَا أَذْكُرُ الْحُسَيْنَ ( عليه السلام ) فَأَيَّ شَيْ‏ءٍ أَقُولُ فَقَالَ قُلْ صَلَّى اللَّهُ عَلَيْكَ يَا أَبَا عَبْدِ اللَّهِ تُعِيدُ ذَلِكَ ثَلَاثاً فَإِنَّ السَّلَامَ يَصِلُ إِلَيْهِ مِنْ قَرِيبٍ وَ مِنْ بَعِيدٍ ثُمَّ قَالَ إِنَّ أَبَا عَبْدِ اللَّهِ الْحُسَيْنَ ( عليه السلام ) لَمَّا قَضَى بَكَتْ عَلَيْهِ السَّمَاوَاتُ السَّبْعُ وَ الْأَرَضُونَ السَّبْعُ وَ مَا فِيهِنَّ وَ مَا بَيْنَهُنَّ وَ مَنْ يَنْقَلِبُ فِي الْجَنَّةِ وَ النَّارِ مِنْ خَلْقِ رَبِّنَا وَ مَا يُرَى وَ مَا لَا يُرَى بَكَى عَلَى أَبِي عَبْدِ اللَّهِ الْحُسَيْنِ ( عليه السلام ) إِلَّا ثَلَاثَةَ أَشْيَاءَ لَمْ تَبْكِ عَلَيْهِ",
          "قُلْتُ جُعِلْتُ فِدَاكَ وَ مَا هَذِهِ الثَّلَاثَةُ الْأَشْيَاءِ قَالَ لَمْ تَبْكِ عَلَيْهِ الْبَصْرَةُ وَ لَا دِمَشْقُ وَ لَا آلُ عُثْمَانَ عَلَيْهِمْ لَعْنَةُ اللَّهِ قُلْتُ جُعِلْتُ فِدَاكَ إِنِّي أُرِيدُ أَنْ أَزُورَهُ فَكَيْفَ أَقُولُ وَ كَيْفَ أَصْنَعُ قَالَ إِذَا أَتَيْتَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَاغْتَسِلْ عَلَى شَاطِئِ الْفُرَاتِ ثُمَّ الْبَسْ ثِيَابَكَ الطَّاهِرَةَ ثُمَّ امْشِ حَافِياً فَإِنَّكَ فِي حَرَمٍ مِنْ حَرَمِ اللَّهِ وَ حَرَمِ رَسُولِهِ وَ عَلَيْكَ بِالتَّكْبِيرِ وَ التَّهْلِيلِ وَ التَّسْبِيحِ وَ التَّحْمِيدِ وَ التَّعْظِيمِ لِلَّهِ عَزَّ وَ جَلَّ كَثِيراً وَ الصَّلَاةِ عَلَى مُحَمَّدٍ وَ أَهْلِ بَيْتِهِ حَتَّى تَصِيرَ إِلَى بَابِ الْحَيْرِ",
          "ثُمَّ تَقُولُ السَّلَامُ عَلَيْكَ يَا حُجَّةَ اللَّهِ وَ ابْنَ حُجَّتِهِ السَّلَامُ عَلَيْكُمْ يَا مَلَائِكَةَ اللَّهِ وَ زُوَّارَ قَبْرِ ابْنِ نَبِيِّ اللَّهِ ثُمَّ اخْطُ عَشْرَ خُطُوَاتٍ ثُمَّ قِفْ وَ كَبِّرْ ثَلَاثِينَ تَكْبِيرَةً ثُمَّ امْشِ إِلَيْهِ حَتَّى تَأْتِيَهُ مِنْ قِبَلِ وَجْهِهِ فَاسْتَقْبِلْ وَجْهَكَ بِوَجْهِهِ وَ تَجْعَلُ الْقِبْلَةَ بَيْنَ كَتِفَيْكَ ثُمَّ قُلِ السَّلَامُ عَلَيْكَ يَا حُجَّةَ اللَّهِ وَ ابْنَ حُجَّتِهِ السَّلَامُ عَلَيْكَ يَا قَتِيلَ اللَّهِ وَ ابْنَ قَتِيلِهِ ",
          "السَّلَامُ عَلَيْكَ يَا ثَارَ اللَّهِ وَ ابْنَ ثَارِهِ السَّلَامُ عَلَيْكَ يَا وَتْرَ اللَّهِ الْمَوْتُورَ فِي السَّمَاوَاتِ وَ الْأَرْضِ أَشْهَدُ أَنَّ دَمَكَ سَكَنَ فِي الْخُلْدِ وَ اقْشَعَرَّتْ لَهُ أَظِلَّةُ الْعَرْشِ وَ بَكَى لَهُ جَمِيعُ الْخَلَائِقِ وَ بَكَتْ لَهُ السَّمَاوَاتُ السَّبْعُ وَ الْأَرَضُونَ السَّبْعُ وَ مَا فِيهِنَّ وَ مَا بَيْنَهُنَّ وَ مَنْ يَتَقَلَّبُ فِي الْجَنَّةِ وَ النَّارِ مِنْ خَلْقِ رَبِّنَا وَ مَا يُرَى وَ مَا لَا يُرَى أَشْهَدُ أَنَّكَ حُجَّةُ اللَّهِ وَ ابْنُ حُجَّتِهِ ",
          "وَ أَشْهَدُ أَنَّكَ قَتِيلُ اللَّهِ وَ ابْنُ قَتِيلِهِ وَ أَشْهَدُ أَنَّكَ ثَائِرُ اللَّهِ وَ ابْنُ ثَائِرِهِ وَ أَشْهَدُ أَنَّكَ وَتْرُ اللَّهِ الْمَوْتُورُ فِي السَّمَاوَاتِ وَ الْأَرْضِ وَ أَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ وَ نَصَحْتَ وَ وَفَيْتَ وَ أَوْفَيْتَ وَ جَاهَدْتَ فِي سَبِيلِ اللَّهِ وَ مَضَيْتَ لِلَّذِي كُنْتَ عَلَيْهِ شَهِيداً وَ مُسْتَشْهَداً وَ شَاهِداً وَ مَشْهُوداً ",
          "أَنَا عَبْدُ اللَّهِ وَ مَوْلَاكَ وَ فِي طَاعَتِكَ وَ الْوَافِدُ إِلَيْكَ أَلْتَمِسُ كَمَالَ الْمَنْزِلَةِ عِنْدَ اللَّهِ وَ ثَبَاتَ الْقَدَمِ فِي الْهِجْرَةِ إِلَيْكَ وَ السَّبِيلَ الَّذِي لَا يُخْتَلَجُ دُونَكَ مِنَ الدُّخُولِ فِي كَفَالَتِكَ الَّتِي أُمِرْتَ بِهَا مَنْ أَرَادَ اللَّهَ بَدَأَ بِكُمْ",
          "بِكُمْ يُبَيِّنُ اللَّهُ الْكَذِبَ وَ بِكُمْ يُبَاعِدُ اللَّهُ الزَّمَانَ الْكَلِبَ وَ بِكُمْ فَتَحَ اللَّهُ وَ بِكُمْ يَخْتِمُ اللَّهُ وَ بِكُمْ يَمْحُو مَا يَشَاءُ وَ بِكُمْ يُثْبِتُ وَ بِكُمْ يَفُكُّ الذُّلَّ مِنْ رِقَابِنَا وَ بِكُمْ يُدْرِكُ اللَّهُ تِرَةَ كُلِّ مُؤْمِنٍ يُطْلَبُ بِهَا وَ بِكُمْ تُنْبِتُ الْأَرْضُ أَشْجَارَهَا وَ بِكُمْ تُخْرِجُ الْأَشْجَارُ أَثْمَارَهَا وَ بِكُمْ تُنْزِلُ السَّمَاءُ قَطْرَهَا وَ رِزْقَهَا وَ بِكُمْ يَكْشِفُ اللَّهُ الْكَرْبَ وَ بِكُمْ يُنَزِّلُ اللَّهُ الْغَيْثَ وَ بِكُمْ تَسِيخُ الْأَرْضُ الَّتِي تَحْمِلُ أَبْدَانَكُمْ وَ تَسْتَقِرُّ جِبَالُهَا عَنْ مَرَاسِيهَا إِرَادَةُ الرَّبِّ فِي مَقَادِيرِ أُمُورِهِ تَهْبِطُ إِلَيْكُمْ وَ تَصْدُرُ مِنْ بُيُوتِكُمْ وَ الصَّادِرُ عَمَّا فَصَلَ مِنْ أَحْكَامِ الْعِبَادِ ",
          "لُعِنَتْ أُمَّةٌ قَتَلَتْكُمْ وَ أُمَّةٌ خَالَفَتْكُمْ وَ أُمَّةٌ جَحَدَتْ وَلَايَتَكُمْ وَ أُمَّةٌ ظَاهَرَتْ عَلَيْكُمْ وَ أُمَّةٌ شَهِدَتْ وَ لَمْ تُسْتَشْهَدْ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ النَّارَ مَثْوَاهُمْ وَ بِئْسَ وِرْدُ الْوَارِدِينَ وَ بِئْسَ الْوِرْدُ الْمَوْرُودُ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَ صَلَّى اللَّهُ عَلَيْكَ يَا أَبَا عَبْدِ اللَّهِ أَنَا إِلَى اللَّهِ مِمَّنْ خَالَفَكَ بَرِي‏ءٌ ثَلَاثاً",
          "ثُمَّ تَقُومُ فَتَأْتِي ابْنَهُ عَلِيّاً ( عليه السلام ) وَ هُوَ عِنْدَ رِجْلَيْهِ فَتَقُولُ السَّلَامُ عَلَيْكَ يَا ابْنَ رَسُولِ اللَّهِ السَّلَامُ عَلَيْكَ يَا ابْنَ عَلِيٍّ أَمِيرِ الْمُؤْمِنِينَ السَّلَامُ عَلَيْكَ يَا ابْنَ الْحَسَنِ وَ الْحُسَيْنِ السَّلَامُ عَلَيْكَ يَا ابْنَ خَدِيجَةَ وَ فَاطِمَةَ صَلَّى اللَّهُ عَلَيْكَ لَعَنَ اللَّهُ مَنْ قَتَلَكَ تَقُولُهَا ثَلَاثاً أَنَا إِلَى اللَّهِ مِنْهُمْ بَرِي‏ءٌ ثَلَاثاً",
          "ثُمَّ تَقُومُ فَتُومِئُ بِيَدِكَ إِلَى الشُّهَدَاءِ وَ تَقُولُ السَّلَامُ عَلَيْكُمْ ثَلَاثاً فُزْتُمْ وَ اللَّهِ فُزْتُمْ وَ اللَّهِ فَلَيْتَ أَنِّي مَعَكُمْ فَأَفُوزَ فَوْزاً عَظِيماً ثُمَّ تَدُورُ فَتَجْعَلُ قَبْرَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) بَيْنَ يَدَيْكَ فَصَلِّ سِتَّ رَكَعَاتٍ وَ قَدْ تَمَّتْ زِيَارَتُكَ فَإِنْ شِئْتَ فَانْصَرِفْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, from Al Husayn Bin Suweyr who said, ",
            "‘I, and Yunus Bin Zibyan, and Al-Mufazzal Bin Umar, and Abu Salma Al-Sarraj were seated in the presence of Abu Abdullah<sup>asws</sup>, and the speaker from us was Ynus, and he was the eldest of us in age. So he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I tend to be present in the gatherings of these people, meaning the sons of Al-Abbas, so what should I be saying?’ So he<sup>asws</sup> said: ‘Whenever you are present, so mention us<sup>asws</sup> and say, ‘O Allah<sup>azwj</sup>! Show us the ease and the happiness’, for you would come upon what you want’. ",
            "So I said, ‘May I be sacrificed for you<sup>asws</sup>! I frequently mention Al-Husayn<sup>asws</sup>, so which should I be saying?’ Say, ‘May Allah<sup>azwj</sup> Send Blessings upon you<sup>asws</sup>, O Abu Abdullah<sup>asws</sup>!’ – repeating that three times, for the greetings arrives to him<sup>asws</sup> from nearby and from afar. Then say, ‘Abu Abdullah<sup>asws</sup> was such that when he<sup>asws</sup> passed away, the seven skies and the seven firmaments and whatever is in them cried over him<sup>asws</sup>, and the ones who move around in the Paradise and the Fire, from the creatures of our Lord<sup>azwj</sup>, and what can be seen and what cannot be seen cry upon Abu Abdullah Al-Husayn<sup>asws</sup>, except for three things which did not cry upon him<sup>asws</sup>’. ",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! And what are these three things?’ He<sup>asws</sup> said: ‘Three did not cry upon him<sup>asws</sup> (the people of) Al-Basra, nor (people of) Syria, nor the progeny of Usman, may the Curse of Allah<sup>azwj</sup> be upon them’. I said, ‘May I be sacrificed for you<sup>asws</sup>! I want to perform his<sup>asws</sup> <span class=\"iTxt\">Ziyarah</span>, so what should I be doing?’ He<sup>asws</sup> said: ‘When you go to Abu Abdullah<sup>asws</sup>, so wash (yourself) upon the banks of the Euphrates, then wear your clean clothes, then walk bare-footed, for you would be in a <span class=\"iTxt\">Harram</span> from a <span class=\"iTxt\">Harram</span> of Allah<sup>azwj</sup>, and a <span class=\"iTxt\">Harram</span> of His<sup>azwj</sup> Rasool<sup>saww</sup>, and it is upon you with the exclamations of Greatness (Takbeer), and the Holiness (Tahleel), and the Glorification (Tasbeeh), and the Praise (Tahmeed), and the reverence for Allah<sup>azwj</sup> Mighty and Majestic, a lot, and the sending of <span class=\"iTxt\">Salawaat</span> upon Muhammad<sup>saww</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household until you come to the door of Al-Heyr.",
            "Then you should be saying, ‘The greetings be upon you<sup>asws</sup>, O Proof of Allah<sup>azwj</sup>, and a son<sup>asws</sup> of His<sup>azwj</sup> Proof. The greetings be upon you, O Angels of Allah<sup>azwj</sup> and the visitors of the grave of a son<sup>asws</sup> of the Prophet<sup>saww</sup> of Allah<sup>azwj</sup>!’ Then take ten steps, then pause and exclaim thirty Takbeers. Then walk towards him<sup>asws</sup> until you come to him<sup>asws</sup> from its front side, so turn your face towards his<sup>asws</sup> face, and make the Qiblah to be between your shoulders, then say, ‘The greetings be upon you<sup>asws</sup>, O Proof of Allah<sup>azwj</sup>, and son<sup>asws</sup> of His<sup>azwj</sup> Proof. The greetings be upon you<sup>asws</sup>, O the one (who was) killed for (the sake of) Allah<sup>azwj</sup>, and a son<sup>asws</sup> of the one<sup>asws</sup> (who was) killed for Him<sup>azwj</sup>.",
            "The greetings be upon you<sup>asws</sup>, of helper of Allah<sup>azwj</sup> and a son<sup>asws</sup> of His<sup>azwj</sup> helper. The greetings be upon you<sup>asws</sup>, O the most oppressed ones of the oppressed ones of Allah<sup>azwj</sup> in the skies and the earth. I testify that your<sup>asws</sup> blood would settle in the eternity, and the shades of the Throne would shudder for it, and they would be crying for it, the entirety of the creatures, and they would cry for it, the seven skies and the seven firmaments and whatever is within them, and whatever is in between them, and the ones who move about in the Paradise and the Fire, from the creatures of our Lord<sup>azwj</sup>, and what can be seen and what cannot be seen. I testify that you<sup>asws</sup> are the Proof of Allah<sup>azwj</sup> and a son<sup>asws</sup> of His<sup>azwj</sup> Proof.",
            "And I testify that you are the one (who was) killed for (the sake of) Allah<sup>azwj</sup> and a son<sup>asws</sup> of the one<sup>asws</sup> (was) killed for Him<sup>azwj</sup>. And I testify that you<sup>asws</sup> are a helper of Allah<sup>azwj</sup> and a son<sup>asws</sup> of His<sup>azwj</sup> helpers. And I testify that you<sup>asws</sup> are the most oppressed one of the oppressed ones of Allah<sup>azwj</sup> in the skies and the earth. And I testify that you<sup>asws</sup> have delivered, and preached, and were loyal and accomplished, and struggled in the Way of Allah<sup>azwj</sup>, and passed away for which you<sup>asws</sup> were martyred upon, and were seeking martyrdom, and were a witness, and were witnessed’. ",
            "I am a servant of Allah<sup>azwj</sup> and your<sup>asws</sup> slave, and in your<sup>asws</sup> obedience, and the delegate to you<sup>asws</sup>, seeking the perfection status in the Presence of Allah<sup>azwj</sup>, and steadfast in the emigration to you<sup>asws</sup>, and the Way which there is no wavering besides you<sup>asws</sup> from the entry into being in your<sup>asws</sup> responsibility which you<sup>asws</sup> have been Commanded with for the ones whom Allah<sup>azwj</sup> so Intends, beginning with you<sup>asws</sup>. ",
            "Through you<sup>asws</sup>, Allah<sup>azwj</sup> Exposes the lies, and through you<sup>asws</sup> does Allah<sup>azwj</sup> Distances the era of the dogs, and by you<sup>asws</sup> does Allah<sup>azwj</sup> Grant victory, and by you<sup>asws</sup> Allah<sup>azwj</sup> Ends (matters), and by you<sup>asws</sup> He<sup>azwj</sup> Deletes whatever He<sup>azwj</sup> so Desires to, and by you<sup>asws</sup> He<sup>azwj</sup> Affirms, and by you<sup>asws</sup> He<sup>azwj</sup> Repels the humiliation from our necks, and by you<sup>asws</sup> Allah<sup>azwj</sup> Causes all the Believers to realise justice seeking by it, and by you<sup>asws</sup> does the earth grow its trees, and by you<sup>asws</sup> the trees bring out their fruits, and by you<sup>asws</sup> does the sky send down its drops and its sustenance, and by you<sup>asws</sup> does Allah<sup>azwj</sup> Remove the worries, and by you<sup>asws</sup> Allah<sup>azwj</sup> Sends down the rain, and by you<sup>asws</sup> the earth does the earth subside carrying your<sup>asws</sup> bodies, and the mountains come to a rest from its anchorages. The Intentions of the Lord<sup>azwj</sup> in the Ordainment of His<sup>azwj</sup> affairs descends to you<sup>asws</sup>, and gets implemented from your<sup>asws</sup> houses, and the implementation about what decisions are to be made from the regulations of the servants.",
            "Curse be upon the community which murdered you<sup>asws</sup>, and the community which opposed you<sup>asws</sup>, and the community which fought against your<sup>asws</sup> Wilayah, and the community which were openly against you<sup>asws</sup>, and the community who witnessed and did not seek martyrdom. Praise be to Allah<sup>azwj</sup> Who Made the Fire to be their dwelling, and evil is the return of the returners, and evil is the return of the returning ones; and the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds, and Blessings be upon you<sup>asws</sup>, O Abu Abdullah<sup>asws</sup>. I am from the ones who disavow from those who opposed you<sup>asws</sup>’ – (saying it) three times. ",
            "Then you should arise and go to his<sup>asws</sup> son Ali<sup>as</sup>, and he<sup>as</sup><sup>ws</sup> is by his<sup>asws</sup> feet, so you should be saying, ‘The greetings be upon you<sup>as</sup><sup>ws</sup>, O son<sup>as</sup><sup>ws</sup> of Rasool-Allah<sup>saww</sup>! The greetings be upon you<sup>as</sup><sup>ws</sup>, O son<sup>as</sup><sup>ws</sup> of Amir Al-Momineen<sup>asws</sup>. The greetings be upon you<sup>as</sup><sup>ws</sup> O son<sup>as</sup> of Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>. The greetings be upon you<sup>as</sup><sup>ws</sup> O son<sup>as</sup><sup>ws</sup> of Khadeeja<sup>as</sup><sup>ws</sup> and Fatima<sup>asws</sup>. May Allah<sup>azwj</sup> Curse the one who murdered you<sup>as</sup>’ – saying it three times. ‘I am, to Allah<sup>azwj</sup>, disavowing from them’ – three times. ",
            "Then arise and gesture towards the martyrs and you should be saying, ‘The greetings be upon you’ – three times. ‘You succeeded, by Allah<sup>azwj</sup>, you succeeded, by Allah<sup>azwj</sup>! And if only I was with you all, so I would have succeeded with a great success’. Then turn around, so made the grave of Abu Abdullah<sup>asws</sup> to be in front of you<sup>asws</sup>, and Pray six Cycles of <span class=\"iTxt\">Salaat</span>, and you would have completed your <span class=\"iTxt\">Ziyarah</span>. Thus, if you so desire to, so leave’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from al-Qasim ibn Yahya from his grandfather al-Hassan ibn Rashid from al-Husayn ibn Thuwayr who has said the following: “Once Yunus ibn Zabayan, al-Mufaddal ibn ‘Umar, abu Salmah al-Sarraj and I were sitting in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam. Among us Yunus, who was the eldest did the speaking and he said, ‘I pray to Allah to keep my soul in service for your cause, I sometimes attend the meeting of these people, meaning children of al-‘Abbas, what should I say?’ He (the Imam) said, ‘When you are in their meeting and you speak of us then say, “O Allah, show us comfort and happiness,” in saying this you come up with what you want.’ I then said, ‘I pray to Allah to keep my soul in service for your cause, I very often speak of al-Husayn, ‘Alayhi al-Salam, what I should say?’ He (the Imam) said, ‘Say, ‘Sala’ Allah ‘Alayka O abu ‘Abd Allah, I appeal before Allah to grant you salawat (favors and compensation to you worthy of Your services to His cause), three times. Al-Salam reaches him from nearby as well as distant places.’ He (the Imam) then said, ‘When abu ‘Abd Allah, ‘Alayhi al- Salam, passed away, the seven heavens and the seven earths wept. Everything between them, those who move in paradise and in hell, all that our Creator has created, all that can be seen and those that cannot be seen wept for abu ‘Abd Allah, al-Husayn ‘Alayhi al-Salam. Only three things did not weep.’ I then asked, ‘I pray to Allah to keep my soul in service for your cause, what are these three things?’ He (the Imam) said, ‘Things that did not weep were al-Basrah, Damascus and Ale ‘Uthman who did not weep, may Allah’s condemnation be upon them.’ I then said, ‘I want to visit him. What should I do?’ He (the Imam) said, ‘When you want to visit abu ‘Abd Allah, ‘Alayhi al-Salam, take a bath in al- Furat canal, then dress up in clean cloths, walk bare-foot; you are in a sacred location of Allah and the sacred locations of His Messenger. You must say Takhir (Allah is great beyond description), Tahlil (no one deserves worship except Allah). Tasbih, (Allah is free of all defects), Tahmid (all praise belongs to Allah) and Ta‘zim (Allah the most great is free of all defects) of Allah, the Most Majestic, the Most Glorious, a great deal as well as saying, O Allah, grant salawat (favors and compensation to Muhammad and his family worthy of their services to Your cause). When you arrive at the door of al- Hayr then say, ‘(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O the one who possesses authority from Allah, and son of the one who possesses authority from Allah. I offer greeting of peace to you, O angels of Allah, and visitors of the gravesite of the grandchild of the prophet of Allah.’ Then take ten steps forward, then stand up and say Takhir (Allah is great beyond description) thirty times. Then move forward until you reach in front of him. Turn your face toward his face and your back toward the direction of Ka‘bah, then say, ‘(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments), O Tha’ra Allah (wergild for whom belongs to Allah) son of Tha’ra Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O Watru (the oppressed one who belong to the side of Allah) Allah al-Mawtur in heavens and on earth. I testify that your blood lives in eternity because of which the shadows of the Throne shudder, for which all creatures in all seven heavens, seven earths, all that is between them, all that moves in paradise and in hell of the creatures of our Lord, things that can be seen and those that cannot be seen weep. I testify that you possess authority from Allah and you are the son of one who possesses authority from Allah. I testify that you were murdered and your father was murdered as well. I testify that you are Tha’ra Allah son of Tha’ra Allah. I testify that you are watru Allah al-Mawtur in the heaves and on earth. I testify that you preached, gave good advice, remained loyal, accomplished the task assigned to you and strove hard for the cause of Allah and passed away for the cause, which you cherished, as a martyr seeking martyrdom, and a witness and witnessed to. I am a servant of Allah under your guardianship, obedient to your commandments, and one of your visitors who seek perfect position before Allah and steadfastness in migrating toward you and in the way without wavering toward you until arriving in your custodianship, which you maintain and you are commanded to maintain. Whomever Allah wants He begins with you. Through you, falsehood becomes clear where falsehood is, through you Allah keeps away the difficult times, through you Allah commences and with you Allah ends a task. Through you Allah deletes whatever He wills and through you He establishes whatever He wills. Through you He opens up humiliation from around our necks and through you Allah brings to justice the murderers of every believer. Through you the earth grows its trees. Through you the trees yield their fruits. Through you Allah sends down rain and sustenance from the sky. Through you Allah removes hardship and through you Allah sends down heavy rain. Through you the earth, which carries your bodies, stands solid and mountains remain firm against swirling. The will of the Lord about the measurements of affairs descends before you and comes out from your homes as well as the decisions about rules dealing with affairs of servants (of Allah). Condemned is the group who murdered you and the group who opposed you, the group who rejected your divine authority, the group who came against you openly and the group who witnessed but did not seek martyrdom. All praise belongs to Allah who has made hellfire their dwelling, which is the worst place in which to disembark and the worst place for the arriving ones and a worst arrival place. All praise belongs to Allah, Lord of the worlds. I appeal before Allah to grant salawat (favors and compensation to you worthy of your services to His cause), O abu ‘ Abd Allah. We before Allah denounce all of those who opposed you’ - three times. ‘Then stand up and go to his son, Ali who is near his feet, and say, “I offer to you my greeting of peace, O son of the grandson of the Messenger of Allah. I offer you my greeting of peace, O grandson of ’Amir al-Mu’minin Ali. I offer you my greeting of peace, O child of al-Hassan and al-Husayn. I offer you my greeting of peace, O great grandson of Khadijah and Fatimah. I appeal before Allah to grant you favors worthy of your services to His cause. Allah has condemned those who murdered you”- say it three times. “I, before Allah denounce them”- three times. Then say, making a hand gesture toward the martyrs, “I offer you my greeting of peace”- three times. “(I am certain that), by Allah, you have achieved success and you have become successful. I wish I was with you and gained a great success.” Then you should go around keeping the gravesite of abu ‘Abd Allah before you, then perform six Rak‘at salat (prayer). Your visit is complete and you may leave if you wish.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/303)"
        ],
        "index": 8110,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:230:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي الْحَسَنِ صَاحِبِ الْعَسْكَرِ ( عليه السلام ) قَالَ تَقُولُ عِنْدَ رَأْسِ الْحُسَيْنِ ( عليه السلام ) السَّلَامُ عَلَيْكَ يَا أَبَا عَبْدِ اللَّهِ السَّلَامُ عَلَيْكَ يَا حُجَّةَ اللَّهِ فِي أَرْضِهِ وَ شَاهِدَهُ عَلَى خَلْقِهِ السَّلَامُ عَلَيْكَ يَا ابْنَ رَسُولِ اللَّهِ السَّلَامُ عَلَيْكَ يَا ابْنَ عَلِيٍّ الْمُرْتَضَى السَّلَامُ عَلَيْكَ يَا ابْنَ فَاطِمَةَ الزَّهْرَاءِ ",
          "أَشْهَدُ أَنَّكَ قَدْ أَقَمْتَ الصَّلَاةَ وَ آتَيْتَ الزَّكَاةَ وَ أَمَرْتَ بِالْمَعْرُوفِ وَ نَهَيْتَ عَنِ الْمُنْكَرِ وَ جَاهَدْتَ فِي سَبِيلِ اللَّهِ حَتَّى أَتَاكَ الْيَقِينُ فَصَلَّى اللَّهُ عَلَيْكَ حَيّاً وَ مَيِّتاً ",
          "ثُمَّ تَضَعُ خَدَّكَ الْأَيْمَنَ عَلَى الْقَبْرِ وَ قُلْ أَشْهَدُ أَنَّكَ عَلَى بَيِّنَةٍ مِنْ رَبِّكَ جِئْتُ مُقِرّاً بِالذُّنُوبِ لِتَشْفَعَ لِي عِنْدَ رَبِّكَ يَا ابْنَ رَسُولِ اللَّهِ ",
          "ثُمَّ اذْكُرِ الْأَئِمَّةَ بِأَسْمَائِهِمْ وَاحِداً وَاحِداً وَ قُلْ أَشْهَدُ أَنَّكُمْ حُجَّةُ اللَّهِ ثُمَّ قُلْ اكْتُبْ لِي عِنْدَكَ مِيثَاقاً وَ عَهْداً أَنِّي أَتَيْتُكَ أُجَدِّدُ الْمِيثَاقَ فَاشْهَدْ لِي عِنْدَ رَبِّكَ إِنَّكَ أَنْتَ الشَّاهِدُ .",
          "مُحَمَّدُ بْنُ جَعْفَرٍ الرَّزَّازُ الْكُوفِيُّ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Awrama, from one of our companions, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, owner of army (Al-Askar) (11<sup>th</sup> Imam<sup>asws</sup>) having said: ‘You should be saying by the head of Al-Husayn<sup>asws</sup>, ‘The greetings be upon you<sup>asws</sup>, O Abu Abdullah<sup>asws</sup>! The greetings be upon you<sup>asws</sup> O Proof of Allah<sup>azwj</sup> in His<sup>azwj</sup> earth, and His<sup>azwj</sup> witness upon His<sup>azwj</sup> creatures. The greetings be upon you<sup>asws</sup>, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>. The greetings be upon you<sup>asws</sup>, O son<sup>asws</sup> of Ali Al-Murtaza<sup>asws</sup>. The greetings be upon you<sup>asws</sup> son<sup>asws</sup> of Fatima Al-Zahra<sup>asws</sup>.",
            "I testify that you<sup>asws</sup> had established the <span class=\"iTxt\">Salaat</span>, and gave the Zakat, and enjoined for the goodness and forbade form the evil, and struggled in the Way of Allah<sup>azwj</sup> until the conviction (death) came to you<sup>asws</sup>. So may Allah<sup>azwj</sup> Send Blessings upon you<sup>asws</sup>, (of both) the living and the dead’. ",
            "Then place your right cheek upon the grave and say, ‘I testify that you<sup>asws</sup> are upon the evidence from your<sup>asws</sup> Lord<sup>azwj</sup>. I come acknowledging with my sins for you<sup>asws</sup> to intercede for me in the Presence of your<sup>asws</sup> Lord<sup>azwj</sup>, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>!’",
            "Then mentioned the Imams<sup>asws</sup> with their<sup>asws</sup> names, one by one, and say, ‘I testify that you<sup>asws</sup> all are the Proofs of Allah<sup>azwj</sup>’. Then say, ‘Write for me a Covenant with you<sup>asws</sup>, and a promise that I come to you for renewing the Covenant, therefore testify for me in the Presence of your<sup>asws</sup> Lord<sup>azwj</sup> that you<sup>asws</sup> are the witness’.",
            "Muhammad Bin Ja’far Al-Razzaz Al-Kufy, from Muhammad Bin Isa Bin Ubeyd, from the one who mentioned it, from Abu Al-Hassan<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ‘Uramah from certain individuals of our people who has said the following: “Abu al-Hassan Sahib al- ‘Askar, ‘Alayhi al-Salam, has said, near the head of al-Husayn, ‘Alayhi al- Salam, you should say this. ‘(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments), O abu ‘Abd Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments), O possessor of authority of Allah on His earth and a witness over His creatures. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments), O grandson of the Messenger of Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments), O son of Ali, al-Murtada’. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments), O son of Fatimah, al-Zahra’. I testify that you performed salat (prayer), paid zakat, commanded people to do good and forbade them from doing evil deeds and strove hard for the cause of Allah until the time of your death. I appeal before Allah to grant salawat (favors and compensation to you worthy of your services to His cause) during the lifetime as well as after death.’ “Thereafter place the right side of your face on the grave and say, ‘I testify that you had clear proof about your Lord. I have come to confess to my sins so you may intercede on my behalf before your Lord, O grandson of the Messenger of Allah,’ then mention the names of ’A’immah, ‘Alayhi al-Salam, one by one and say, T testify that you are possessors of authority of Allah.’ Then say, ‘Please, write down before you, as pledge and covenant that I came before you to renew the covenant, so bear witness for me before your Lord that you are the witness.’” NOTE:Muhammad ibn Ja’far al-Raziy al-Kufiy has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from those whom he has mentioned from abu al-Hassan, ‘Alayhi al-Salam, a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/303)"
        ],
        "index": 8111,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:230:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ زَيْدِ بْنِ إِسْحَاقَ عَنِ الْحَسَنِ بْنِ عَطِيَّةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا فَرَغْتَ مِنَ السَّلَامِ عَلَى الشُّهَدَاءِ فَائْتِ قَبْرَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَاجْعَلْهُ بَيْنَ يَدَيْكَ ثُمَّ تُصَلِّي مَا بَدَا لَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bi nIbrahim, from his father, from Ibn Abu Najra, from Zayd Bin Is’haq, from Al Hassan Bin Atiyya, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you are free from the greeting upon the martyrs, so go to the grave of Abu Abdullah<sup>asws</sup>, and make it to be in front of you, then Pray <span class=\"iTxt\">Salaat</span>, whatever comes to you’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu Najran from Zayd ibn Ishaq from al-Hassan ibn ‘Atiyyah who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that when you complete offering your greeting of peace to the martyrs then go the gravesite of abu ‘Abd Allah, ‘Alayhi al-Salam, keep it in front of you and perform salat (prayer) as much as you want.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:230",
  "kind": "verse_list"
}