{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 233"
        },
        "path": "/books/al-kafi:4:3:233",
        "titles": {
          "ar": "بَابُ فَضْلِ زِيَارَةِ أَبِي عَبْدِ اللَّهِ الْحُسَيْنِ ( عليه السلام )",
          "en": "Chapter 232 – Merits of the Ziyarah of Abu Abdullah Al-Husayn<sup>asws</sup>"
        }
      }
    ],
    "index": 1176,
    "local_index": 233,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 234"
        },
        "path": "/books/al-kafi:4:3:234",
        "titles": {
          "ar": "بَابُ فَضْلِ زِيَارَةِ أَبِي الْحَسَنِ مُوسَى ( عليه السلام )",
          "en": "Chapter 233 – Merits of the Ziyarah of Abu Al-Hassan Musa<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 232"
        },
        "path": "/books/al-kafi:4:3:232",
        "titles": {
          "ar": "بَابُ فَضْلِ الزِّيَارَاتِ وَ ثَوَابِهَا",
          "en": "Chapter 231 – Merits of the Ziyarah and its Rewards"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:233",
    "titles": {
      "ar": "بَابُ فَضْلِ زِيَارَةِ أَبِي عَبْدِ اللَّهِ الْحُسَيْنِ ( عليه السلام )",
      "en": "Chapter 232 – Merits of the Ziyarah of Abu Abdullah Al-Husayn<sup>asws</sup>"
    },
    "verse_count": 11,
    "verse_start_index": 8116,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/307)"
        ],
        "index": 8117,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ بَشِيرٍ الدَّهَّانِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رُبَّمَا فَاتَنِي الْحَجُّ فَأُعَرِّفُ عِنْدَ قَبْرِ الْحُسَيْنِ ( عليه السلام ) فَقَالَ أَحْسَنْتَ يَا بَشِيرُ أَيُّمَا مُؤْمِنٍ أَتَى قَبْرَ الْحُسَيْنِ ( عليه السلام ) عَارِفاً بِحَقِّهِ فِي غَيْرِ يَوْمِ عِيدٍ كَتَبَ اللَّهُ لَهُ عِشْرِينَ حَجَّةً وَ عِشْرِينَ عُمْرَةً مَبْرُورَاتٍ مَقْبُولَاتٍ وَ عِشْرِينَ حَجَّةً وَ عُمْرَةً مَعَ نَبِيٍّ مُرْسَلٍ أَوْ إِمَامٍ عَدْلٍ وَ مَنْ أَتَاهُ فِي يَوْمِ عِيدٍ كَتَبَ اللَّهُ لَهُ مِائَةَ حَجَّةٍ وَ مِائَةَ عُمْرَةٍ وَ مِائَةَ غَزْوَةٍ مَعَ نَبِيٍّ مُرْسَلٍ أَوْ إِمَامٍ عَدْلٍ ",
          "قَالَ قُلْتُ لَهُ كَيْفَ لِي بِمِثْلِ الْمَوْقِفِ قَالَ فَنَظَرَ إِلَيَّ شِبْهَ الْمُغْضَبِ ثُمَّ قَالَ لِي يَا بَشِيرُ إِنَّ الْمُؤْمِنَ إِذَا أَتَى قَبْرَ الْحُسَيْنِ ( عليه السلام ) يَوْمَ عَرَفَةَ وَ اغْتَسَلَ مِنَ الْفُرَاتِ ثُمَّ تَوَجَّهَ إِلَيْهِ كَتَبَ اللَّهُ لَهُ بِكُلِّ خُطْوَةٍ حَجَّةً بِمَنَاسِكِهَا وَ لَا أَعْلَمُهُ إِلَّا قَالَ وَ غَزْوَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Salih Bin Uqba,, from Bashir Al Dahhhan who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Sometimes I miss the Hajj, so I go over to the grave of Al-Husayn<sup>asws</sup>’. So he<sup>asws</sup> said: ‘Well done, O Bashir! Whichever Believer goes to the grave of Al-Husayn<sup>asws</sup>, recognising his<sup>asws</sup> right during other than the day of Eid, Allah<sup>azwj</sup> would Write for him twenty Hajjs, and twenty Umrahs, properly performed, Accepted; and twenty Hajj and Umra with a Mursil Prophet<sup>as</sup>, or a Just Imam<sup>asws</sup>. And the one who goes to him<sup>asws</sup> on the day of Eid, Allah<sup>azwj</sup> would Write for him one hundred Hajj, and one hundred Umrah, and one hundred military expeditions with a Mursil Prophet<sup>as</sup>, or a just Imam<sup>asws</sup>’. ",
            "He (the narrator) said, ‘I said to him<sup>asws</sup>, ‘How is it for me with the likes of the Pausing Station (like Arafaat)?’ So he<sup>asws</sup> looked at me resembling the anger, then said to me: ‘O Bashir! The Believer, when he goes to the grave of Al-Husayn<sup>asws</sup> on the day of Arafaat, and washes from the Euphrates, then diverts (his attention) to him<sup>asws</sup>, Allah<sup>azwj</sup> would Write for him, with every step taken, a Hajj with its rituals’ – and I do not know except that he<sup>asws</sup> said: ‘And a military expedition’’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Isma‘il from Salih ibn ‘Uqbah from Bashir al-Dahhan who has said the following: “I once said to abu ‘ Abd Allah, ‘Alayhi al-Salam, ‘I may miss performing al-Hajj, so I spend the day of ‘Arafah near the gravesite of al-Husayn, ‘Alayhi al-Salam .’ He (the Imam) said, ‘That is very good, O Bashir. If anyone of believing people visits the gravesite of al-Husayn, ‘Alayhi al-Salam, with proper awareness of his rights on a day other than the day of ‘Id, Allah writes for him the reward for twenty Hajjah. (He writes for him) the reward for twenty accepted ‘Umrah, well-performed, twenty Hajjah and al-‘Umrah in the company of a prophet who is sent as a messenger and an Imam of justice. If one visits his gravesite on the day of Td, Allah writes for him the reward for one hundred Hajjah, one hundred ‘Umrah, one hundred times an armed campaign against the enemies of Allah in support of a prophet who is sent as a messenger or an Imam of justice.’ I (the narrator) then asked, ‘How can this be for me like staying in ‘Arafat?’ He (the narrator) has said that he (the Imam) looked at me as if with anger then said, ‘O Bashir, take notice of this. When a believing person comes to the gravesite of al-Husayn, ‘Alayhi al-Salam, on the day of ‘Arafah, after taking a bath in al-Furat and comes to him, Allah writes for him for every step, one Hajjah performed with its acts’ - I do not know else, except, until he said, ‘and an armed campaign against the enemies of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/307)"
        ],
        "index": 8118,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ زَيْدٍ الشَّحَّامِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ زِيَارَةُ قَبْرِ الْحُسَيْنِ ( عليه السلام ) تَعْدِلُ عِشْرِينَ حَجَّةً وَ أَفْضَلُ وَ مِنْ عِشْرِينَ عُمْرَةً وَ حَجَّةً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Al Husayn Bin Al Mukhtar, from Zayd Al Shahham, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A <span class=\"iTxt\">Ziyarah</span> of the grave of Al-Husayn<sup>asws</sup> equates to twenty Hajjs and superior, and from twenty Umrahs and Hajj’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from al-Husayn ibn al- Mukhtar from Zayd al-Shahham who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that visiting the gravesite of al-Husayn, ‘Alayhi al- Salam, is equal in rewards to twenty Hajjah. It is even more virtuous than ‘Umrah and Hajjah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/307)"
        ],
        "index": 8119,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ يَزِيدَ بْنِ عَبْدِ الْمَلِكِ قَالَ كُنْتُ مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَمَرَّ قَوْمٌ عَلَى حَمِيرٍ فَقَالَ أَيْنَ يُرِيدُ هَؤُلَاءِ قُلْتُ قُبُورَ الشُّهَدَاءِ قَالَ فَمَا يَمْنَعُهُمْ مِنْ زِيَارَةِ الشَّهِيدِ الْغَرِيبِ فَقَالَ رَجُلٌ مِنْ أَهْلِ الْعِرَاقِ وَ زِيَارَتُهُ وَاجِبَةٌ قَالَ زِيَارَتُهُ خَيْرٌ مِنْ حَجَّةٍ وَ عُمْرَةٍ وَ عُمْرَةٍ وَ حَجَّةٍ حَتَّى عَدَّ عِشْرِينَ حَجَّةً وَ عُمْرَةً ثُمَّ قَالَ مَقْبُولَاتٍ مَبْرُورَاتٍ ",
          "قَالَ فَوَ اللَّهِ مَا قُمْتُ حَتَّى أَتَاهُ رَجُلٌ فَقَالَ لَهُ إِنِّي قَدْ حَجَجْتُ تِسْعَ عَشْرَةَ حَجَّةً فَادْعُ اللَّهَ أَنْ يَرْزُقَنِي تَمَامَ الْعِشْرِينَ حَجَّةً قَالَ هَلْ زُرْتَ قَبْرَ الْحُسَيْنِ ( عليه السلام ) قَالَ لَا قَالَ لَزِيَارَتُهُ خَيْرٌ مِنْ عِشْرِينَ حَجَّةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazie, from Salih Bin Uqba, from Yazeed Bin Abdul Malik who said, ",
            "‘I was with Abu Abdullah<sup>asws</sup> and a group of people passed by (riding) upon donkeys. So he<sup>asws</sup> said: ‘Where are they intending (to go to)?’ I said, ‘Graves of the martyrs’. He<sup>asws</sup> said: ‘So what is preventing them from the <span class=\"iTxt\">Ziyarah</span> of the martyr, the alienated?’ So a man from the people of Al-Iraq said, ‘Is his<sup>asws</sup> <span class=\"iTxt\">Ziyarah</span> Obligatory?’ He<sup>asws</sup> said: ‘His<sup>asws</sup> <span class=\"iTxt\">Ziyarah</span> is better than a Hajj and an Umra, and an Umra, and a Hajj’ – until he<sup>asws</sup> had counted twenty Hajj and Umra’. Then he<sup>asws</sup> said: the ‘Accepted, properly performed’ (ones). ",
            "He (the narrator) said, ‘I had not arisen until a man came over, and he said to him<sup>asws</sup>, ‘I have performed nineteen Hajjs, so supplicate to Allah<sup>azwj</sup> to Grace me with completing the twentieth Hajj’. He<sup>asws</sup> said: ‘Have you performed the <span class=\"iTxt\">Ziyarah</span> of the grave of Al-Husayn<sup>asws</sup>?’ He said, ‘No’. He<sup>asws</sup> said: ‘His<sup>asws</sup> <span class=\"iTxt\">Ziyarah</span> is better than twenty Hajjs’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Isma‘il ibn Bazi’ from Salih ibn ‘Uqbah from Yazid ibn ‘Abd al-Malik who has said the following: “I once was in the company of abu ‘Abd Allah, ‘Alayhi al-Salam, when people on donkey backs passed by. He (the Imam) asked, ‘Where do they want to go?’ I replied, ‘They want to visit the graves of the martyrs.’ He (the Imam) then said, ‘What prevents them from visiting the martyr whom no one helped?’ A man from Iraq then asked, ‘Is visiting him obligatory?’ He (the Imam) said, ‘Visiting him is more virtuous than Hajjah and ‘Umrah, ‘Umrah and Hajjah’, until he counted up to twenty Hajjah and ‘Umrah. Then he said, ‘All accepted, well-performed.’ By Allah, I had not stood up that another man came and said to him, ‘I have performed nineteen times al-Hajj. Pray for me so, He grants me the opportunity to perform twenty times al-Hajj.’ He (the Imam) asked, ‘Have you visited the gravesite of al-Husayn, ‘Alayhi al-Salam ?’ The man replied, ‘No, I have not done so.’ He (the Imam) said, ‘Visiting al-Husayn, ‘Alayhi al-Salam, is more virtuous than twenty times performing al-Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/308)"
        ],
        "index": 8120,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:4",
        "text": [
          "مُحَمَّدُ بْنُ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ أَبِي سَعِيدٍ الْمَدَائِنِيِّ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ أَئْتِ [آتِي] قَبْرَ الْحُسَيْنِ ( عليه السلام ) قَالَ نَعَمْ يَا أَبَا سَعِيدٍ فَائْتِ قَبْرَ ابْنِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَطْيَبِ الطَّيِّبِينَ وَ أَطْهَرِ الطَّاهِرِينَ وَ أَبَرِّ الْأَبْرَارِ فَإِذَا زُرْتَهُ كَتَبَ اللَّهُ لَكَ بِهِ خَمْسَةً وَ عِشْرِينَ حَجَّةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Salih Bin Uqba, from Abu Saeed Al Madainy who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup>, so I said, ‘May I be sacrificed for you<sup>asws</sup>! Can I go to the grave of Al-Husayn<sup>asws</sup>?’. He<sup>asws</sup> said: ‘Yes, O Abu Saeed! The visitor of the grave of a son<sup>asws</sup> of Rasool-Allah<sup>saww</sup> is better than the best ones, and cleaner than the cleanest ones, and more righteous than the righteous ones. So when you perform his<sup>asws</sup> <span class=\"iTxt\">Ziyarah</span>, Allah<sup>azwj</sup> would Write for you twenty-five Hajjs due to it’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn al-Husayn has narrated from Muhammad ibn Isma‘il from Salih ibn ‘Uqbah from abu Sa‘id al-Mada’iniy who has said the following: “I once visited abu ‘Abd Allah, ‘Alayhi al-Salam, and said to him, ‘I pray to Allah to keep my soul in service for your cause, can I visit the grave of al-Husayn, ‘Alayhi al-Salam ?’ He (the Imam) said, ‘Yes, O abu Sa‘id, you should visit the grave of the grandson of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. He is the most likeable of all likeable ones, the cleanest of all clean ones, the most virtuous of all virtuous ones. When you visit him Allah writes for you the reward for twenty- five times performing al-Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/308)"
        ],
        "index": 8121,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:5",
        "text": [
          "مُحَمَّدُ بْنُ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُحَمَّدِ بْنِ صَدَقَةَ عَنْ صَالِحٍ النِّيلِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ أَتَى قَبْرَ الْحُسَيْنِ ( عليه السلام ) عَارِفاً بِحَقِّهِ كَتَبَ اللَّهُ لَهُ أَجْرَ مَنْ أَعْتَقَ أَلْفَ نَسَمَةٍ وَ كَمَنْ حَمَلَ عَلَى أَلْفِ فَرَسٍ مُسْرَجَةٍ مُلْجَمَةٍ فِي سَبِيلِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Husayn, from Muhammad Bin Sinan, from Muhammad Bin Sadaqa, from Salih Al Nayli who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The one who goes to the grave of Al-Husayn<sup>asws</sup> recognising his<sup>asws</sup> right, Allah<sup>azwj</sup> would Write for him the Recompense of freeing a thousand people, and he would be like the one who readies a thousand horses with saddles and reins in the Way of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn al-Husayn has narrated from Muhammad ibn Sinan from Muhammad ibn Sadaqah from Salih al-Niliy who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, Tor one who visits the grave of al-Husayn, ‘Alayhi al- Salam, with proper understanding of his rights, Allah writes for him the reward for setting free of one thousand persons. It is like readying one thousand horses fully harnessed to join the battle for the cause of Allah.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/308)"
        ],
        "index": 8122,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ خَارِجَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَكَّلَ اللَّهُ بِقَبْرِ الْحُسَيْنِ ( عليه السلام ) أَرْبَعَةَ آلَافِ مَلَكٍ شُعْثٍ غُبْرٍ يَبْكُونَهُ إِلَى يَوْمِ الْقِيَامَةِ فَمَنْ زَارَهُ عَارِفاً بِحَقِّهِ شَيَّعُوهُ حَتَّى يُبْلِغُوهُ مَأْمَنَهُ وَ إِنْ مَرِضَ عَادُوهُ غُدْوَةً وَ عَشِيَّةً وَ إِنْ مَاتَ شَهِدُوا جَنَازَتَهُ وَ اسْتَغْفَرُوا لَهُ إِلَى يَوْمِ الْقِيَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Is’haq Bin Ibrahim, from haroun Bin Kharjat who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> has Allocated four thousand Angels by the grave of Al-Husayn<sup>asws</sup>, dishevelled, dusty, crying over him<sup>asws</sup> up to the Day of Judgement. So the one who performs his<sup>asws</sup> <span class=\"iTxt\">Ziyarah</span> recognising his<sup>asws</sup> right, they would accompany him until he reaches his safe place; and if he is sick they console him morning and evening; and if he dies they witness his funeral and seek Forgiveness for him up to the Day of Judgement’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ishaq ibn Ibrahim from Harun ibn Kharijah who has said the following: “I once heard abu ‘Abd Allah, Alayhi al-Salam, say, ‘Allah has assigned four thousand untidy and dusty angels to the grave of al-Husayn, Alayhi al-Salam. They weep for him until the Day of Judgment. They escort one who visits him with proper understanding of his rights, to his secure place. If he becomes ill these angels visit him mornings and evenings; and if he dies, these angels take part in his funeral and ask forgiveness for him until the Day of Judgment.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/308)"
        ],
        "index": 8123,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُوسَى بْنِ سَعْدَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ عُمَرَ بْنِ أَبَانٍ الْكَلْبِيِّ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ أَرْبَعَةَ آلَافِ مَلَكٍ عِنْدَ قَبْرِ الْحُسَيْنِ ( عليه السلام ) شُعْثٍ غُبْرٍ يَبْكُونَهُ إِلَى يَوْمِ الْقِيَامَةِ رَئِيسُهُمْ مَلَكٌ يُقَالُ لَهُ مَنْصُورٌ فَلَا يَزُورُهُ زَائِرٌ إِلَّا اسْتَقْبَلُوهُ وَ لَا يُوَدِّعُهُ مُوَدِّعٌ إِلَّا شَيَّعُوهُ وَ لَا مَرِضَ إِلَّا عَادُوهُ وَ لَا يَمُوتُ إِلَّا صَلَّوْا عَلَى جِنَازَتِهِ وَ اسْتَغْفَرُوا لَهُ بَعْدَ مَوْتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Musa Bin Sa’dan, from Abdullah Bin Al Qasim, from Umar Bin Aban Al Kalby, from Aban Bin Taghlub who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘There are four thousand Angels by the grave of Al-Husayn<sup>asws</sup>, dishevelled, dusty, weeping him<sup>asws</sup> up to the Day of Judgement. Their head is an Angel called Mansour. So there is no visitor who performs his<sup>asws</sup> <span class=\"iTxt\">Ziyarah</span> except that they welcome him, and they do not bid him farewell except that they accompany him; and there is neither a sick one except that they console him, nor one who dies except that they Pray <span class=\"iTxt\">Salaat</span> upon his funeral, and they seek Forgiveness for him after his death’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Musa ibn Sa‘dan from ‘Abd Allah ibn al-Qasim from ‘Umar ibn Aban al-Kalbiy from Aban ibn Taghlib who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said, ‘Four thousand angels assigned for the grave of al- Husayn, Alayhi al-Salam, are untidy and dusty. They weep for him until the Day of Judgment. Their chief is an angel called Mansur. They welcome everyone who visits him and escort everyone who says farewell to him. They visit everyone of such visitors if he becomes ill, perform funeral salat (prayer) for those of them who die, and ask forgiveness for him after his death.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/309)"
        ],
        "index": 8124,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:8",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَبِي دَاوُدَ الْمُسْتَرِقِّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُثَنًّى الْحَنَّاطِ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ مَنْ أَتَى الْحُسَيْنَ عَارِفاً بِحَقِّهِ غَفَرَ اللَّهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَ مَا تَأَخَّرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Abu Dawood Al Mustaraq, from one of our companions, from Musna Al Hannat, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the first who said, ‘I heard him<sup>asws</sup> saying: ‘The one who comes to Al-Husayn<sup>asws</sup> recognising his<sup>asws</sup> right, Allah<sup>azwj</sup> would Forgive for him whatever had preceded from his sins and whatever is delayed’."
          ],
          "en.sarwar": [
            "8. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from abu Dawud al-Mustariq from certain individuals of our people from Muthanna al-Hannat who has said the following: “I once heard abu al-Hassan, the 1st, Alayhi al-Salam, say, ‘Whoever visits al-Husayn, Alayhi al- Salam, with proper understanding of his rights, Allah forgives his sins of the past and those that come later.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/309)"
        ],
        "index": 8125,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْخَيْبَرِيِّ عَنِ الْحُسَيْنِ بْنِ مُحَمَّدٍ قَالَ قَالَ أَبُو الْحَسَنِ مُوسَى ( عليه السلام ) أَدْنَى مَا يُثَابُ بِهِ زَائِرُ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) بِشَطِّ الْفُرَاتِ إِذَا عَرَفَ حَقَّهُ وَ حُرْمَتَهُ وَ وَلَايَتَهُ أَنْ يُغْفَرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَ مَا تَأَخَّرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Al Kahybari, from Al Husayn Bin Muhammad who said, ",
            "‘Abu Al-Hassan Musa<sup>asws</sup> said: ‘The lowest of what the performer of a <span class=\"iTxt\">Ziyarah</span> of Abu Abdullah<sup>asws</sup> by the banks of the Euphrates is Rewarded with when he recognises his right, and his<sup>asws</sup> sanctity, and his<sup>asws</sup> Wilayah that He<sup>azwj</sup> would Forgive for him whatever had preceded from his sins and what is delayed’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Isma‘il from al-Khaybariy from al-Husayn ibn Muhammad who has said the following: “Abu al-Hassan, Musa, Alayhi al-Salam, has said, ‘The least of rewards that a visitor of abu ‘Abd Allah, Alayhi al-Salam, near al-Furat canal, will receive, when he has proper understanding of his rights, sacred status, his possessing authority from Allah, is forgiveness of his past sins and that which come later.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/309)"
        ],
        "index": 8126,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:10",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ غَسَّانَ الْبَصْرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَتَى قَبْرَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَارِفاً بِحَقِّهِ غَفَرَ اللَّهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَ مَا تَأَخَّرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ibn Muskan, from Gassan Al Basry, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who comes to the grave of Abu Abdullah<sup>asws</sup> recognising his<sup>asws</sup> right, Allah<sup>azwj</sup> would Forgive his sins, from the committed ones and those he will commit (in the future)’."
          ],
          "en.sarwar": [
            "10. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ibn Muskan from Ghassan al- Basriy who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said that if one visits the grave of abu ‘Abd Allah, Alayhi al- Salam, with proper understanding of his rights, Allah forgives his past sins and whatever sins come later on.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> السندان مجهولن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/309)"
        ],
        "index": 8127,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:233:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ وَ مُحَمَّدِ بْنِ الْحُسَيْنِ جَمِيعاً عَنْ مُوسَى بْنِ عُمَرَ عَنْ غَسَّانَ الْبَصْرِيِّ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ اسْتَأْذَنْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقِيلَ لِي ادْخُلْ فَدَخَلْتُ فَوَجَدْتُهُ فِي مُصَلَّاهُ فِي بَيْتِهِ فَجَلَسْتُ حَتَّى قَضَى صَلَاتَهُ فَسَمِعْتُهُ وَ هُوَ يُنَاجِي رَبَّهُ وَ يَقُولُ يَا مَنْ خَصَّنَا بِالْكَرَامَةِ وَ خَصَّنَا بِالْوَصِيَّةِ وَ وَعَدَنَا الشَّفَاعَةَ وَ أَعْطَانَا عِلْمَ مَا مَضَى وَ مَا بَقِيَ وَ جَعَلَ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْنَا",
          "اغْفِرْ لِي وَ لِإِخْوَانِي وَ لِزُوَّارِ قَبْرِ أَبِي عَبْدِ اللَّهِ الْحُسَيْنِ ( عليه السلام ) الَّذِينَ أَنْفَقُوا أَمْوَالَهُمْ وَ أَشْخَصُوا أَبْدَانَهُمْ رَغْبَةً فِي بِرِّنَا وَ رَجَاءً لِمَا عِنْدَكَ فِي صِلَتِنَا وَ سُرُوراً أَدْخَلُوهُ عَلَى نَبِيِّكَ صَلَوَاتُكَ عَلَيْهِ وَ آلِهِ وَ إِجَابَةً مِنْهُمْ لِأَمْرِنَا وَ غَيْظاً أَدْخَلُوهُ عَلَى عَدُوِّنَا أَرَادُوا بِذَلِكَ رِضَاكَ",
          "فَكَافِهِمْ عَنَّا بِالرِّضْوَانِ وَ اكْلَأْهُمْ بِاللَّيْلِ وَ النَّهَارِ وَ اخْلُفْ عَلَى أَهَالِيهِمْ وَ أَوْلَادِهِمُ الَّذِينَ خُلِّفُوا بِأَحْسَنِ الْخَلَفِ وَ اصْحَبْهُمْ وَ اكْفِهِمْ شَرَّ كُلِّ جَبَّارٍ عَنِيدٍ وَ كُلِّ ضَعِيفٍ مِنْ خَلْقِكَ أَوْ شَدِيدٍ وَ شَرَّ شَيَاطِينِ الْإِنْسِ وَ الْجِنِّ وَ أَعْطِهِمْ أَفْضَلَ مَا أَمَّلُوا مِنْكَ فِي غُرْبَتِهِمْ عَنْ أَوْطَانِهِمْ وَ مَا آثَرُونَا بِهِ عَلَى أَبْنَائِهِمْ وَ أَهَالِيهِمْ وَ قَرَابَاتِهِمْ",
          "اللَّهُمَّ إِنَّ أَعْدَاءَنَا عَابُوا عَلَيْهِمْ خُرُوجَهُمْ فَلَمْ يَنْهَهُمْ ذَلِكَ عَنِ الشُّخُوصِ إِلَيْنَا وَ خِلَافاً مِنْهُمْ عَلَى مَنْ خَالَفَنَا فَارْحَمْ تِلْكَ الْوُجُوهَ الَّتِي قَدْ غَيَّرَتْهَا الشَّمْسُ وَ ارْحَمْ تِلْكَ الْخُدُودَ الَّتِي تَقَلَّبَتْ عَلَى حُفْرَةِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ ارْحَمْ تِلْكَ الْأَعْيُنَ الَّتِي جَرَتْ دُمُوعُهَا رَحْمَةً لَنَا وَ ارْحَمْ تِلْكَ الْقُلُوبَ الَّتِي جَزِعَتْ وَ احْتَرَقَتْ لَنَا وَ ارْحَمِ الصَّرْخَةَ الَّتِي كَانَتْ لَنَا اللَّهُمَّ إِنِّي أَسْتَوْدِعُكَ تِلْكَ الْأَنْفُسَ وَ تِلْكَ الْأَبْدَانَ حَتَّى نُوَافِيَهُمْ عَلَى الْحَوْضِ يَوْمَ الْعَطَشِ",
          "فَمَا زَالَ وَ هُوَ سَاجِدٌ يَدْعُو بِهَذَا الدُّعَاءِ فَلَمَّا انْصَرَفَ قُلْتُ جُعِلْتُ فِدَاكَ لَوْ أَنَّ هَذَا الَّذِي سَمِعْتُ مِنْكَ كَانَ لِمَنْ لَا يَعْرِفُ اللَّهَ لَظَنَنْتُ أَنَّ النَّارَ لَا تَطْعَمُ مِنْهُ شَيْئاً وَ اللَّهِ لَقَدْ تَمَنَّيْتُ أَنْ كُنْتُ زُرْتُهُ وَ لَمْ أَحُجَّ فَقَالَ لِي مَا أَقْرَبَكَ مِنْهُ فَمَا الَّذِي يَمْنَعُكَ مِنْ إِتْيَانِهِ ",
          "ثُمَّ قَالَ يَا مُعَاوِيَةُ لِمَ تَدَعُ ذَلِكَ قُلْتُ جُعِلْتُ فِدَاكَ لَمْ أَدْرِ أَنَّ الْأَمْرَ يَبْلُغُ هَذَا كُلَّهُ قَالَ يَا مُعَاوِيَةُ مَنْ يَدْعُو لِزُوَّارِهِ فِي السَّمَاءِ أَكْثَرُ مِمَّنْ يَدْعُو لَهُمْ فِي الْأَرْضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, and someone else, from Muhammad Bin Ahmad and Muhammad Bin Al Husayn, altogether from Musa Bin Umra, from Gassan Al basry, from Muawiya Bin Wahab, and Ali Bin Ibrahim, from his father, from one of our companions, from Ibrahim Bin Uqba, from Muawiya Bin Wahab who said, ",
            "‘I sought permission to see Abu Abdullah<sup>asws</sup>, so it was said to me, ‘Enter’. So I went in and found him<sup>asws</sup> to be upon his<sup>asws</sup> Prayer mat in his<sup>asws</sup> room. So, I sat down until he<sup>asws</sup> had completed his<sup>asws</sup> <span class=\"iTxt\">Salaat</span>. Then I heard him<sup>asws</sup>, and he<sup>asws</sup> was whispering to his<sup>asws</sup> Lord<sup>azwj</sup>, and saying: ‘O the One<sup>azwj</sup> Who Specialised us<sup>asws</sup> with the Prestige, and Specialised us<sup>asws</sup> with the successor-ship, and Promised us<sup>asws</sup> (the right of) intercession, and Granted us<sup>asws</sup> knowledge what is past and what remains, Made the hearts of the people to incline towards us<sup>asws</sup>. ",
            "(The prayer for a believer) Forgive me, and my brethren, and the visitors of the grave of Abu Abdullah Al-Husayn<sup>asws</sup> who spent their wealth, and drove their bodies wishing to be good to us<sup>asws</sup>, and hoping for what is in Your<sup>azwj</sup> Presence regarding maintaining relationships with us<sup>asws</sup> and the cheerfulness entering upon Your<sup>azwj</sup> Prophet<sup>saww</sup>, and their answering to our<sup>asws</sup> orders, and the rage which they entered upon our<sup>asws</sup> enemies intending by that Your<sup>azwj</sup> Pleasure. ",
            "Therefore, suffice them from us<sup>asws</sup> with the contentment and Care for them by the night and the day, and Look after their families and their children whom they have left behind, with the best care; and Accompany them and Suffice them from the evil of every stubborn tyrant, from every weak ones of Your<sup>azwj</sup> creatures and the strong ones, and evil of the devils, and the human beings, and the jinn, and Give them the best of what is to be Granted from You<sup>azwj</sup> regarding their being strangers away from their homelands, and what they preferred us<sup>asws</sup> with upon their own sons, and their families, and their relatives.",
            "O Allah<sup>azwj</sup>! Our<sup>asws</sup> enemies faulted them for their going towards (our<sup>asws</sup> shrines), but that did not prevent them from the travelling to us<sup>asws</sup>, and they opposed (all of) those who had opposed us<sup>asws</sup>. So be Merciful to those faces whom the sun has changed, and be Merciful to those cheeks which kissed upon the grave of Abu Abdullah<sup>asws</sup>, and be Merciful to those eyes which flowed its tears in sympathy with us<sup>asws</sup>, and be Merciful to those hearts which mourned and burnt for us<sup>asws</sup>, and be Merciful to the screams which were for us<sup>asws</sup>. O Allah<sup>azwj</sup>! I hereby entrust to You<sup>azwj</sup> those selves, and those bodies until we<sup>asws</sup> fulfil (our<sup>asws</sup> Promises to them) at the Fountain on the day of the thirst’. ",
            "So he<sup>asws</sup> did not cease to be in Prostration supplicating with this supplication. So when he<sup>asws</sup> finished, I said, ‘May I be sacrificed for you<sup>asws</sup>! If this, which I heard from you<sup>asws</sup> was for the one who does not recognise Allah<sup>azwj</sup>, I think that the Fire would not consume anything from him. By Allah<sup>azwj</sup>! I wish that I had performed his<sup>asws</sup> <span class=\"iTxt\">Ziyarah</span> and had not performed Hajj’. So he<sup>asws</sup> said to me: ‘How close he<sup>asws</sup> is to you. So what is that which prevents you from going to him<sup>asws</sup>?’ ",
            "Then he<sup>asws</sup> said: ‘O Muawiya! Why did you leave that?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! I did not know that the matter had reach all of this (significance)’. He<sup>asws</sup> said: ‘O Muawiya! The ones who supplicate for his<sup>asws</sup> visitors in the sky are more than the ones who supplicate for them in the earth’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya and others have narrated from Muhammad ibn Ahmad and Muhammad ibn al-Husayn all from Musa ibn ‘Umar from Ghassan al-Basriy from Mu‘awiyah ibn Wahab Ali ibn Ibrahim has narrated from his father from certain individuals of our people from Ibrahim ibn ‘Uqbah from Mu‘awiyah ibn Wahab who has said the following: “I once asked permission to see abu ‘ Abd Allah, ‘Alayhi al-Salam, and permission was granted. I was told to come in. When I went inside, I found him in his place for salat (prayer) in his house. I then sat down until he completed his salat (prayer). I then heard him secretly speaking to his Lord. ‘O the One who has granted us honor in a special way, O the one who has granted us exclusive executorships of the will of the messengers and has promised us intercession, granted us the knowledge of the past and future and has made the hearts of people to incline toward us, forgive me and my brothers (in belief). (O Lord, forgive) the visitors of the grave of abu ‘Abd Allah, al-Husayn, ‘Alayhi al-Salam, who spend their wealth. Those who ready their bodies due to their interest in doing good to us and because of their hope in what is with You of compensation for keeping good relations with us and because of the happiness they bring to the heart of Your prophet. I appeal before Allah to grant salawat (favors and compensation to Your Holy prophet and his family worthy of his services to Your cause) and forgive them because of their yielding to our commands and because of the anger due to their visit they cause to our enemies. In doing so, they only want to find that You are happy with them. So compensate them on our behalf by being happy with them, and support them in the night and day. Be their deputy in their families and children whom they have left behind, as best deputy. Accompany them and protect them against the evil of every hostile tyrant, weak ones of Your creatures or strong ones, and against the evil of the devils of humankind and al-Jinn. Grant them the best, which they are to receive from You in their condition of being in strange places away from their homes and because of the preference they have given to us over their own children, families and relatives. O Allah, our enemies mock at them for their visiting us, but this does not prevent them from setting on their journey toward us and from opposing those who oppose us. So be kind to the faces, which the heat of sun has changed. Be kind to the side of those faces, which are turned from side to side over the grave of abu ‘Abd Allah, ‘Alayhi al-Salam. Be kind to those eyes, which have shed tears in sympathy with us. Be kind to the hearts, which mourned and felt pain for us. Be kind to the wailing cries for us. O Allah, I entrust those souls and bodies with You until the time we meet, and compensate them at the pond (in paradise) on the dehydrating day.’ He (the Imam) continued with such prayers in a prostrating position. When he completed, I said, ‘I pray to Allah to keep my soul in service for your cause, if what I heard from you were for even those who do not know Allah, I think, hellfire would not touch them. I by Allah, wished to have visited the grave of al-Husayn, ‘Alayhi al-Salam, instead of performing al-Hajj.’ He (the Imam) said to me, ‘He is much closer to you. What then prevents you from visiting him?’ He (the Imam) then said, ‘O Mu‘awiyah, why do you neglect such visitations?’ I said, ‘I pray to Allah to keep my soul in service for your cause, I did not know the matter is of all such great degrees of significance.’ He (the Imam) said, ‘O Mu‘awiyah, the number of those who pray for the visitors of al- Husayn, ‘Alayhi al-Salam, in the heavens is much greater than those who pray for them on earth.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:233",
  "kind": "verse_list"
}