{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 235"
        },
        "path": "/books/al-kafi:4:3:235",
        "titles": {
          "ar": "بَابُ فَضْلِ زِيَارَةِ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )",
          "en": "Chapter 234 – Merits of the Ziyarah of Abu Al-Hassan Al-Reza<sup>asws</sup>"
        }
      }
    ],
    "index": 1178,
    "local_index": 235,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:235",
    "titles": {
      "ar": "بَابُ فَضْلِ زِيَارَةِ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )",
      "en": "Chapter 234 – Merits of the Ziyarah of Abu Al-Hassan Al-Reza<sup>asws</sup>"
    },
    "verse_count": 5,
    "verse_start_index": 8130,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/311)"
        ],
        "index": 8131,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:235:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) جُعِلْتُ فِدَاكَ زِيَارَةُ الرِّضَا ( عليه السلام ) أَفْضَلُ أَمْ زِيَارَةُ أَبِي عَبْدِ اللَّهِ الْحُسَيْنِ ( عليه السلام ) فَقَالَ زِيَارَةُ أَبِي أَفْضَلُ وَ ذَلِكَ أَنَّ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَزُورُهُ كُلُّ النَّاسِ وَ أَبِي لَا يَزُورُهُ إِلَّا الْخَوَاصُّ مِنَ الشِّيعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ali Bin Mahziyar who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! <span class=\"iTxt\">Ziyarah</span> of Al-Reza<sup>asws</sup> is superior or <span class=\"iTxt\">Ziyarah</span> of Abu Abdullah Al-Husayn<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘<span class=\"iTxt\">Ziyarah</span> of my<sup>asws</sup> father<sup>asws</sup> is superior, and that is that Abu Abdullah<sup>asws</sup>, all the people visit him<sup>asws</sup>, and my<sup>asws</sup> father<sup>asws</sup>, no one visits him<sup>asws</sup> except for the particular ones from the Shiah’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Ali ibn Mahziyar who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, saying, ’I pray to Allah to keep my soul in service for your cause, Is visiting al-Rida, ‘Alayhi al-Salam, more virtuous or that of abu ‘ Abd Allah, al-Husayn, ‘Alayhi al-Salam, more virtuous?’ He (the Imam) replied, ‘Visiting my father is more virtuous; all people visit abu ‘Abd Allah, al-Husayn, ‘Alayhi al-Salam, but only very special people of our followers visit my father.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/312)"
        ],
        "index": 8132,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:235:2",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنِ الْحُسَيْنِ بْنِ سَيْفٍ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ حَجَّ حَجَّةَ الْإِسْلَامِ فَدَخَلَ مُتَمَتِّعاً بِالْعُمْرَةِ إِلَى الْحَجِّ فَأَعَانَهُ اللَّهُ عَلَى عُمْرَتِهِ وَ حَجِّهِ ثُمَّ أَتَى الْمَدِينَةَ فَسَلَّمَ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) ثُمَّ أَتَاكَ عَارِفاً بِحَقِّكَ يَعْلَمُ أَنَّكَ حُجَّةُ اللَّهِ عَلَى خَلْقِهِ وَ بَابُهُ الَّذِي يُؤْتَى مِنْهُ فَسَلَّمَ عَلَيْكَ ثُمَّ أَتَى أَبَا عَبْدِ اللَّهِ الْحُسَيْنَ ( صلوات الله عليه ) فَسَلَّمَ عَلَيْهِ ثُمَّ أَتَى بَغْدَادَ وَ سَلَّمَ عَلَى أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) ثُمَّ انْصَرَفَ إِلَى بِلَادِهِ فَلَمَّا كَانَ فِي وَقْتِ الْحَجِّ رَزَقَهُ اللَّهُ الْحَجَّ فَأَيُّهُمَا أَفْضَلُ هَذَا الَّذِي قَدْ حَجَّ حَجَّةَ الْإِسْلَامِ يَرْجِعُ أَيْضاً فَيَحُجُّ أَوْ يَخْرُجُ إِلَى خُرَاسَانَ إِلَى أَبِيكَ عَلِيِّ بْنِ مُوسَى ( عليه السلام ) فَيُسَلِّمُ عَلَيْهِ ",
          "قَالَ لَا بَلْ يَأْتِي خُرَاسَانَ فَيُسَلِّمُ عَلَى أَبِي الْحَسَنِ ( عليه السلام ) أَفْضَلُ وَ لْيَكُنْ ذَلِكَ فِي رَجَبٍ وَ لَا يَنْبَغِي أَنْ تَفْعَلُوا فِي هَذَا الْيَوْمِ فَإِنَّ عَلَيْنَا وَ عَلَيْكُمْ مِنَ السُّلْطَانِ شُنْعَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Al Husayn Bin Sayf, from Muhammad Bin Aslam, from Muhammad Bin Suleyman who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about a man who performs Hajj, a Hajj of Al-Islam, so he enters to perform Umrah, being the Umrah to the Hajj. So, Allah<sup>azwj</sup> Supports him upon his Umrah and his Hajj. Then he goes to Al-Medina and greets upon the Prophet<sup>saww</sup>. Then he comes to you<sup>asws</sup>, having recognised your<sup>asws</sup> right, knowing that you<sup>asws</sup> are a Proof of Allah<sup>azwj</sup> upon His<sup>azwj</sup> creatures, and His<sup>azwj</sup> Door, which come from Him<sup>azwj</sup>. So he greets you<sup>asws</sup>, then he goes to Abu Abdullah Al-Husayn<sup>asws</sup>, so he greets upon him<sup>asws</sup>. Then he goes to Baghdad and greets upon Abu Al-Hassan Musa<sup>asws</sup>. Then he leaves to go to his city. So when it was the time for Hajj, Allah<sup>azwj</sup> Graces him with the Hajj. So which of the two is superior, this which he had already performed the Hajj of Al-Islam, returning as well, so he performs hajj (again), or he returns to Khurasan to your<sup>asws</sup> father<sup>asws</sup> Ali<sup>asws</sup> Bin Musa<sup>asws</sup> so he greets upon him<sup>asws</sup>?’ ",
            "He<sup>asws</sup> said: ‘No. But, his going to Khurasan and greeting upon Abu Al-Hassan<sup>asws</sup> is superior, but that is during Rajab, and it is not befitting that you should do so during these days, for upon us<sup>asws</sup> and upon you<sup>asws</sup> is a repulsiveness from the ruling authority’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash’ariy has narrated from al-Hassan ibn Ali al-Kufiy from al-Husayn ibn Sayf from Muhammad ibn Aslam from Muhammad ibn Sulayman who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, ‘A man has performed al-Hajjahta al-Islam, he then commences al-Hajj with al-‘Umrah, and Allah grants him the opportunity to complete his al-Hajj and al-‘Umrah. He then comes to al-Madinah and offers his greeting of peace to the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. Then he comes to you with proper understanding of your rights that you possess authority from Allah over His creatures and that you are the door through which they can go to Him. He then comes to you saying, “(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) and offer my greeting of peace to you.” He then goes to abu ‘Abd Allah, al-Husayn, ‘Alayhi al-Salam, and offers him his greeting of peace. He then goes to Baghdad and offers his greeting of peace to abu al-Hassan Musa, ‘Alayhi al-Salam. He then goes to his home. When al-Hajj season comes, Allah then grants him the opportunity to perform al-Hajj. Which one is more virtuous; is performing al-Hajj al-Islam then going for al-Hajj again, or instead going to Khurasan to visit your father, Ali ibn Musa, ‘Alayhi al-Salam, and offering him his greeting of peace?’ He (the Imam) said, ‘No, but he should go to Khuransan to offer his greeting of peace to abu al- Hassan, ‘Alayhi al-Salam. It is more virtuous; but this should be done in the month of Rajab. You should do this these days, because the sultan will deride us and you as well.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/312)"
        ],
        "index": 8133,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:235:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ إِبْرَاهِيمَ الْجَعْفَرِيِّ عَنْ حَمْدَانَ بْنِ إِسْحَاقَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) أَوْ حُكِيَ لِي عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) الشَّكُّ مِنْ عَلِيِّ بْنِ إِبْرَاهِيمَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَنْ زَارَ قَبْرَ أَبِي بِطُوسَ غَفَرَ اللَّهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَ مَا تَأَخَّرَ ",
          "قَالَ فَحَجَجْتُ بَعْدَ الزِّيَارَةِ فَلَقِيتُ أَيُّوبَ بْنَ نُوحٍ فَقَالَ لِي قَالَ أَبُو جَعْفَرٍ الثَّانِي ( عليه السلام ) مَنْ زَارَ قَبْرَ أَبِي بِطُوسَ غَفَرَ اللَّهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَ مَا تَأَخَّرَ وَ بَنَى اللَّهُ لَهُ مِنْبَراً فِي حِذَاءِ مِنْبَرِ مُحَمَّدٍ وَ عَلِيٍّ ( عليه السلام ) حَتَّى يَفْرُغَ اللَّهُ مِنْ حِسَابِ الْخَلَائِقِ فَرَأَيْتُهُ وَ قَدْ زَارَ فَقَالَ جِئْتُ أَطْلُبُ الْمِنْبَرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ali Bin Ibrahim Al Ja’fary, from Hamdan Bin Is’haq who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> or it was told to me from a man, from Abu Ja’far<sup>asws</sup> – the doubt being from Ali Bin Ibrahim, who said, ‘Abu Ja’far<sup>asws</sup> said: ‘The one who performs <span class=\"iTxt\">Ziyarah</span> of the grave of my<sup>asws</sup> father<sup>asws</sup> at Toos, Allah<sup>azwj</sup> would Forgive his sins, whatever he has committed and what he will commit’. ",
            "He (the narrator) said, ‘So I performed Hajj after the <span class=\"iTxt\">Ziyarah</span>. Then I met Ayoub Bin Nuh, and he said to me, ‘Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> said: ‘The one who performs <span class=\"iTxt\">Ziyarah</span> of my<sup>asws</sup> father<sup>asws</sup> at Toos, Allah<sup>azwj</sup> would Forgive for him whatever had preceded from his sins, and whatever was delayed, and Allah<sup>azwj</sup> would Build for him a Pulpit (in the vicinity) of the Pulpit of Muhammad<sup>saww</sup> and Ali<sup>asws</sup>, until Allah<sup>azwj</sup> is Free from the Reckoning of the creatures’. So I saw that he had performed <span class=\"iTxt\">Ziyarah</span> seeking the Pulpit’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ali ibn Ibrahim al-Ja’fariy from Hamdan ibn Ishaq who has said the following: “I heard abu Ja‘far, or it was narrated to me from abu Ja‘far, ‘Alayhi al-Salam”, -uncertainty is from Ali ibn Ibrahim- “that abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Whoever visits my father in Tus (Iran), Allah forgives his sins of the past and those that comes later on.’ He (the narrator) has said, ‘I then performed al-Hajj after Ziyarat (visit). Thereafter, I met Ayyub ibn Nuh who said to me, ‘Abu Ja‘far, the 2nd, ‘Alayhi al-Salam, has said, “Whoever visits the grave of my father in Tus, Allah forgives his sins of the past and that which come later. Allah builds for his use a pulpit, parallel to those for Muhammad and Ali, ‘Alayhim al-Salam, until He will complete all creatures, accounting.’” I (the narrator) saw him when he already had visited and said, ‘I have come to claim my pulpit.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/313)"
        ],
        "index": 8134,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:235:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ الْحُسَيْنِ النَّيْسَابُورِيِّ عَنْ إِبْرَاهِيمَ بْنِ أَحْمَدَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعِيدٍ الْمَكِّيِّ عَنْ يَحْيَى بْنِ سُلَيْمَانَ الْمَازِنِيِّ عَنْ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ مَنْ زَارَ قَبْرَ وَلَدِي عَلِيٍّ كَانَ لَهُ عِنْدَ اللَّهِ كَسَبْعِينَ حَجَّةً مَبْرُورَةً قَالَ قُلْتُ سَبْعِينَ حَجَّةً قَالَ نَعَمْ وَ سَبْعِينَ أَلْفَ حَجَّةٍ قَالَ قُلْتُ سَبْعِينَ أَلْفَ حَجَّةٍ قَالَ رُبَّ حَجَّةٍ لَا تُقْبَلُ مَنْ زَارَهُ وَ بَاتَ عِنْدَهُ لَيْلَةً كَانَ كَمَنْ زَارَ اللَّهَ فِي عَرْشِهِ ",
          "قَالَ نَعَمْ إِذَا كَانَ يَوْمُ الْقِيَامَةِ كَانَ عَلَى عَرْشِ الرَّحْمَنِ أَرْبَعَةٌ مِنَ الْأَوَّلِينَ وَ أَرْبَعَةٌ مِنَ الْآخِرِينَ فَأَمَّا الْأَرْبَعَةُ الَّذِينَ هُمْ مِنَ الْأَوَّلِينَ فَنُوحٌ وَ إِبْرَاهِيمُ وَ مُوسَى وَ عِيسَى ( عليهم السلام ) وَ أَمَّا الْأَرْبَعَةُ مِنَ الْآخِرِينَ فَمُحَمَّدٌ وَ عَلِيٌّ وَ الْحَسَنُ وَ الْحُسَيْنُ صَلَوَاتُ اللَّهِ عَلَيْهِمْ ثُمَّ يُمَدُّ الْمِضْمَارُ فَيَقْعُدُ مَعَنَا مَنْ زَارَ قُبُورَ الْأَئِمَّةِ ( عليهم السلام ) إِلَّا أَنَّ أَعْلَاهُمْ دَرَجَةً وَ أَقْرَبَهُمْ حَبْوَةً زُوَّارُ قَبْرِ وَلَدِي عَلِيٍّ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ali Bin Al Husayn Al Neyshapouri, from Ibrahim Bin Ahmad, from Abdul Rahman Bin Saeed Al Makky, from Yahya Bin Suleyman Al Mazany, ",
            "(It has been narrated) from Abu Al-Hassan Musa<sup>asws</sup> having said: ‘The one who performs <span class=\"iTxt\">Ziyarah</span> of my<sup>asws</sup> son<sup>asws</sup> Ali<sup>asws</sup>, there would be for him, in the Presence of Allah<sup>azwj</sup>, like seventy Hajj, performed correctly’. I said, ‘Seventy Hajjs?’ He<sup>asws</sup> said: ‘Yes, and (even) seventy thousand Hajjs’. I said, ‘Seventy thousand Hajjs?’ He<sup>asws</sup> said: ‘Perhaps a Hajj is not Accepted. (But) the one who visits him<sup>asws</sup> and spends the night in his<sup>asws</sup> presence would be like the one who had visited Allah<sup>azwj</sup> in His<sup>azwj</sup> Throne’. ",
            "He<sup>asws</sup> said: ‘Yes, when it would be the Day of Judgement, there would be upon the Throne of the Beneficent, four from the former ones, and four from the later ones. So, as for the four who would be from the former, so it would be Noah<sup>as</sup>, and Ibrahim<sup>as</sup>, and Musa<sup>as</sup>, and Isa<sup>as</sup>. And as for the four who would be from the later ones, so it would be Muhammad<sup>saww</sup>, and Ali<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>. Then the area would be extended, so there would be sitting with us<sup>asws</sup>, the ones who performed <span class=\"iTxt\">Ziyarah</span> of the graves of the Imams<sup>asws</sup>, except that the one with the highest of the ranks and the closest of them in receipt of gifts would be the performers of the <span class=\"iTxt\">Ziyarah</span> of the grave of my<sup>asws</sup> son<sup>asws</sup> Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ali ibn al-Husayn al-Naysaburiy from Ibrahim ibn Ahmad from ‘Abd al-Rahman ibn Sa‘id al-Makkiy from Yahya’ ibn Sulayman al-Mazeniy who has said the following: “Abu al-Hassan, Musa, ‘Alayhi al-Salam, has said, ‘Whoever visits the grave of my son, Ali it is before Allah like performing seventy thousand well-performed accepted Hajjah.’ He (the narrator) said, I asked, ‘Is it seventy well-performed Hajjah?’ He (the Imam) said, ‘Yes, and it is seventy thousand Hajjah.’ I then said, ‘Seventy thousand Hajjah!’ He (the Imam) said, ‘A Hajjah perhaps is not accepted. One who visits him and spends the night near his grave is as if one’s visiting Allah in His Throne. He (the Imam) said, ‘Yes, on the Day of Judgment, on the Throne of the Beneficent there will be four from those of the earlier times and four from the latter generations. The four from the earlier generations are Nuh, Ibrahim, Moses and Jesus, ‘Alayhim al-Salam. The four from the later generations are Muhammad, Ali, al-Hassan and al-Husayn, ‘Alayhim al-Salam. Thereafter, the leveling tool is applied and along with us will sit those who have visited the graves of ’A’immah, and among them of the highest degree and the first to receive gifts are those who have visited the grave of my son, Ali, ‘Alayhi al-Salam.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/313)"
        ],
        "index": 8135,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:235:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ زَيْدٍ الشَّحَّامِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا لِمَنْ زَارَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ كَمَنْ زَارَ اللَّهَ عَزَّ وَ جَلَّ فَوْقَ عَرْشِهِ قَالَ قُلْتُ فَمَا لِمَنْ زَارَ أَحَداً مِنْكُمْ قَالَ كَمَنْ زَارَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Salih Bin Uqba, from Zayd Al Shahham who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is for the one who performs the <span class=\"iTxt\">Ziyarah</span> of Rasool-Allah<sup>saww</sup>?’ He<sup>asws</sup> said: ‘He would be like the one who visits Allah<sup>azwj</sup> Mighty and Majestic above His<sup>azwj</sup> Throne’. I said, ‘So what is for the one who performs the <span class=\"iTxt\">Ziyarah</span> of one of you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘It is as if he performed the <span class=\"iTxt\">Ziyarah</span> of Rasool-Allah<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn al-Husayn from Muhammad ibn Isma‘il from Salih ibn ‘Uqbah from Zayd al-Shahham who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘What is the reward for one who visits the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause?’ He (the Imam) replied, ‘It is like visiting Allah, the Most Majestic, the Most Glorious, on His Throne.’ He (the narrator) has said that I then asked, ‘What is the reward for one who visits any one of you?’ He (the Imam) replied, ‘It is like visiting the Messenger of Allah.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:235",
  "kind": "verse_list"
}