{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 25"}, "path": "/books/al-kafi:4:3:25", "titles": {"ar": "بَابُ مَا يُهْدَى إِلَى الْكَعْبَةِ", "en": "Chapter 25 – What is gifted to the Kabah"}}], "index": 968, "local_index": 25, "part_type": "Chapter", "path": "/books/al-kafi:4:3:25", "titles": {"ar": "بَابُ مَا يُهْدَى إِلَى الْكَعْبَةِ", "en": "Chapter 25 – What is gifted to the Kabah"}, "verse_count": 5, "verse_start_index": 6803, "verses": [{"index": 6804, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:25:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ قَالَ أَخْبَرَنِي يَاسِينُ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ قَوْماً أَقْبَلُوا مِنْ مِصْرٍ فَمَاتَ مِنْهُمْ رَجُلٌ فَأَوْصَى بِأَلْفِ دِرْهَمٍ لِلْكَعْبَةِ فَلَمَّا قَدِمَ الْوَصِيُّ مَكَّةَ سَأَلَ فَدَلُّوهُ عَلَى بَنِي شَيْبَةَ فَأَتَاهُمْ فَأَخْبَرَهُمُ الْخَبَرَ فَقَالُوا قَدْ بَرِئَتْ ذِمَّتُكَ ادْفَعْهَا إِلَيْنَا\nفَقَامَ الرَّجُلُ فَسَأَلَ النَّاسَ فَدَلُّوهُ عَلَى أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام ) قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَأَتَانِي فَسَأَلَنِي فَقُلْتُ لَهُ إِنَّ الْكَعْبَةَ غَنِيَّةٌ عَنْ هَذَا انْظُرْ إِلَى مَنْ أَمَّ هَذَا الْبَيْتَ فَقُطِعَ بِهِ أَوْ ذَهَبَتْ نَفَقَتُهُ أَوْ ضَلَّتْ رَاحِلَتُهُ أَوْ عَجَزَ أَنْ يَرْجِعَ إِلَى أَهْلِهِ فَادْفَعْهَا إِلَى هَؤُلَاءِ الَّذِينَ سَمَّيْتُ لَكَ \nفَأَتَى الرَّجُلُ بَنِي شَيْبَةَ فَأَخْبَرَهُمْ بِقَوْلِ أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالُوا هَذَا ضَالٌّ مُبْتَدِعٌ لَيْسَ يُؤْخَذُ عَنْهُ وَ لَا عِلْمَ لَهُ وَ نَحْنُ نَسْأَلُكَ بِحَقِّ هَذَا وَ بِحَقِّ كَذَا وَ كَذَا لَمَّا أَبْلَغْتَهُ عَنَّا هَذَا الْكَلَامَ\nقَالَ فَأَتَيْتُ أَبَا جَعْفَرٍ ( عليه السلام ) فَقُلْتُ لَهُ لَقِيتُ بَنِي شَيْبَةَ فَأَخْبَرْتُهُمْ فَزَعَمُوا أَنَّكَ كَذَا وَ كَذَا وَ أَنَّكَ لَا عِلْمَ لَكَ ثُمَّ سَأَلُونِي بِالْعَظِيمِ إِلَّا بَلَّغْتُكَ مَا قَالُوا قَالَ وَ أَنَا أَسْأَلُكَ بِمَا سَأَلُوكَ لَمَّا أَتَيْتَهُمْ فَقُلْتَ لَهُمْ إِنَّ مِنْ عِلْمِي أَنْ لَوْ وُلِّيتُ شَيْئاً مِنْ أَمْرِ الْمُسْلِمِينَ لَقَطَعْتُ أَيْدِيَهُمْ ثُمَّ عَلَّقْتُهَا فِي أَسْتَارِ الْكَعْبَةِ ثُمَّ أَقَمْتُهُمْ عَلَى الْمِصْطَبَّةِ ثُمَّ أَمَرْتُ مُنَادِياً يُنَادِي أَلَا إِنَّ هَؤُلَاءِ سُرَّاقُ اللَّهِ فَاعْرِفُوهُمْ.", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz who said, ‘Yasin informed me saying, \n‘I heard Abu Ja’far<sup>asws</sup> saying: ‘A group came over from Egypt, and a man from them died. So he bequeathed with a thousand Dirhams to the Kabah. So when the trustee proceeded to Makkah, he asked around. So they pointed him to the Clan of Shayba. So he went over to them and informed them of the news, and they said, ‘You are free from your responsibility. Hand it over to us’. \nSo the man arose and asked around the people. So they pointed him to Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>. Abu Ja’far<sup>asws</sup> said: ‘So he came over to me and asked me<sup>asws</sup>. So I<sup>asws</sup> said to him: ‘The Kabah is needless from this. Look to the one who is visiting this House, if he has been cut off (robbed by bandits), or his expenses are exhausted, or his ride has strayed, or he is frustrated from returning back to his family, so hand it over to these ones whom I have named for you. \nSo the man went over to the Clan of Shayba and informed them with the words of Abu Ja’far<sup>asws</sup>. So they said, ‘This one is a strayed one, an innovator. It is not to be taken from him<sup>asws</sup>, nor is there any knowledge for him<sup>asws</sup>, and we ask you by the right of this, and by the right of such and such, to convey this speech from us’. \nHe said, ‘So I went over to Abu Ja’far<sup>asws</sup>, so I said to him<sup>asws</sup>, ‘I met the Clan of Shayba and informed them, so they are claiming that you<sup>asws</sup> are such and such, and that you<sup>asws</sup> are one with no knowledge for you<sup>asws</sup>. Then they asked me with the grievous thing, except that I should deliver to you<sup>asws</sup> what they said’. He<sup>asws</sup> said: ‘And I<sup>asws</sup> am asking you with what they asked you. When you go over to them, so say to them, ‘From my<sup>asws</sup> knowledge is that, if I<sup>asws</sup> were to govern anything from the affairs of the Muslims, I<sup>asws</sup> would cut off their hands, then hang them (their necks) in the curtains of the Kabah. Then I<sup>asws</sup> would make them stand upon the bench (to be judged). Then I<sup>asws</sup> would order a caller to call out, ‘Indeed! These are the stealers from Allah<sup>azwj</sup>, therefore recognise them!’"}]}, {"index": 6805, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:25:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ بُنَانِ بْنِ مُحَمَّدٍ عَنْ مُوسَى بْنِ الْقَاسِمِ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ جَعَلَ جَارِيَتَهُ هَدْياً لِلْكَعْبَةِ كَيْفَ يَصْنَعُ قَالَ إِنَّ أَبِي أَتَاهُ رَجُلٌ قَدْ جَعَلَ جَارِيَتَهُ هَدْياً لِلْكَعْبَةِ فَقَالَ لَهُ قَوِّمِ الْجَارِيَةَ أَوْ بِعْهَا ثُمَّ مُرْ مُنَادِياً يَقُومُ عَلَى الْحِجْرِ فَيُنَادِي أَلَا مَنْ قَصُرَتْ بِهِ نَفَقَتُهُ أَوْ قُطِعَ بِهِ طَرِيقُهُ أَوْ نَفِدَ بِهِ طَعَامُهُ فَلْيَأْتِ فُلَانَ بْنَ فُلَانٍ وَ مُرْهُ أَنْ يُعْطِيَ أَوَّلًا فَأَوَّلًا حَتَّى يَنْفَدَ ثَمَنُ الْجَارِيَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Bunan Bin Muhammad, from Musa Bin Al Qasim, \n(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man made his slave girls as a gift to the Kabah. How should he deal with it?’ He<sup>asws</sup> said: ‘A man had come over to my<sup>asws</sup> father, and he had gifted his slave girl to the Kabah. So he<sup>asws</sup> said to him: ‘Evaluate the slave girl, or sell her. Then instruct a caller to stand at the (Black) Stone, so he should call out, ‘Indeed! The one who is short with his expenses, or his way has been cut off (by bandits), or his food supply is exhausted, so let him go to so and so’, and instruct him that he should give first to the first one until the price of the slave girl is depleted’."}]}, {"index": 6806, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:25:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ أَبَانٍ عَنْ أَبِي الْحُرِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَ رَجُلٌ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ إِنِّي أَهْدَيْتُ جَارِيَةً إِلَى الْكَعْبَةِ فَأُعْطِيتُ بِهَا خَمْسَمِائَةِ دِينَارٍ فَمَا تَرَى قَالَ بِعْهَا ثُمَّ خُذْ ثَمَنَهَا ثُمَّ قُمْ عَلَى حَائِطِ الْحِجْرِ ثُمَّ نَادِ وَ أَعْطِ كُلَّ مُنْقَطَعٍ بِهِ وَ كُلَّ مُحْتَاجٍ مِنَ الْحَاجِّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Salih Bin Al Sandy, from Ja’far Bin Basheer, from ban, from Abu Al Hurr, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man came over to Abu Ja’far<sup>asws</sup>, so he said, ‘I have gifted a slave girl to the Kabah, and I have given five hundred Dinar for her. So what is your<sup>asws</sup> view?’ He<sup>asws</sup> said: ‘Sell her. Then take her price, then stand upon the wall of the (Black) Stone. Then call out, and give to everyone who has been cut off (by bandits), and every needy one, from the Pilgrims’."}]}, {"index": 6807, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:25:4", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَخَوَيْهِ مُحَمَّدٍ وَ أَحْمَدَ عَنْ عَلِيِّ بْنِ يَعْقُوبَ الْهَاشِمِيِّ عَنْ مَرْوَانَ بْنِ مُسْلِمٍ عَنْ سَعِيدِ بْنِ عَمْرٍو الْجُعْفِيِّ عَنْ رَجُلٍ مِنْ أَهْلِ مِصْرَ قَالَ أَوْصَى إِلَيَّ أَخِي بِجَارِيَةٍ كَانَتْ لَهُ مُغَنِّيَةٍ فَارِهَةٍ وَ جَعَلَهَا هَدْياً لِبَيْتِ اللَّهِ الْحَرَامِ فَقَدِمْتُ مَكَّةَ فَسَأَلْتُ فَقِيلَ ادْفَعْهَا إِلَى بَنِي شَيْبَةَ وَ قِيلَ لِي غَيْرُ ذَلِكَ مِنَ الْقَوْلِ فَاخْتُلِفَ عَلَيَّ فِيهِ فَقَالَ لِي رَجُلٌ مِنْ أَهْلِ الْمَسْجِدِ أَ لَا أُرْشِدُكَ إِلَى مَنْ يُرْشِدُكَ فِي هَذَا إِلَى الْحَقِّ قُلْتُ بَلَى\nقَالَ فَأَشَارَ إِلَى شَيْخٍ جَالِسٍ فِي الْمَسْجِدِ فَقَالَ هَذَا جَعْفَرُ بْنُ مُحَمَّدٍ ( عليه السلام ) فَسَلْهُ قَالَ فَأَتَيْتُهُ ( عليه السلام ) فَسَأَلْتُهُ وَ قَصَصْتُ عَلَيْهِ الْقِصَّةَ فَقَالَ إِنَّ الْكَعْبَةَ لَا تَأْكُلُ وَ لَا تَشْرَبُ وَ مَا أُهْدِيَ لَهَا فَهُوَ لِزُوَّارِهَا بِعِ الْجَارِيَةَ وَ قُمْ عَلَى الْحِجْرِ فَنَادِ هَلْ مِنْ مُنْقَطَعٍ بِهِ وَ هَلْ مِنْ مُحْتَاجٍ مِنْ زُوَّارِهَا فَإِذَا أَتَوْكَ فَسَلْ عَنْهُمْ وَ أَعْطِهِمْ وَ اقْسِمْ فِيهِمْ ثَمَنَهَا \nقَالَ فَقُلْتُ لَهُ إِنَّ بَعْضَ مَنْ سَأَلْتُهُ أَمَرَنِي بِدَفْعِهَا إِلَى بَنِي شَيْبَةَ فَقَالَ أَمَا إِنَّ قَائِمَنَا لَوْ قَدْ قَامَ لَقَدْ أَخَذَهُمْ وَ قَطَعَ أَيْدِيَهُمْ وَ طَافَ بِهِمْ وَ قَالَ هَؤُلَاءِ سُرَّاقُ اللَّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ali Bin Al Hassan Al Maysami, from his two brothers, Muhammad and Ahmad, from Ali Bin Yaqoub Al Hashimy, from Marwan Bin Muslim, from Saeed Bin Amro Al Ju’fy, from a man from the people of Egypt who said, \n‘My brother bequeathed to me with a slave girl who was a singer for him, a luxury, and made her to be gifted to the Sacred House of Allah<sup>azwj</sup>. So I proceeded to Makkah and asked around. So it was said, ‘Hand her over to the Clan of Shayba’, and it was said to me other than that from the words. So it was conflicting upon me with regards to it. So a man from the people of the (Sacred) Masjid said to me, ‘Shall I guide you to the one who would guide you regarding this, to the Truth?’ I said, ‘Yes’. \nHe (the narrator) said, ‘So he indicated towards an old man seated in the Masjid and he said, ‘This is Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>, so ask him<sup>asws</sup>’. So I went over to him<sup>asws</sup> and asked him<sup>asws</sup>, and related the story to him<sup>asws</sup>. So he<sup>asws</sup> said: ‘The Kabah neither eats nor drinks, and whatever is gifted to it, so it is for the visitors. Sell the slave girl and stand upon the (Black) Stone and call out, ‘Is there one who has been cut-off (by the bandits), and is there one who is needy’, from its visitors. So when they come over, so ask about them, and give them, and distribute her price among them’. \nHe (the narrator) said, ‘So I said to him<sup>asws</sup>, ‘One of the ones I asked instructed me with handing her over to the Clan of Shayba’. So he<sup>asws</sup> said: ‘But, our<sup>asws</sup> Qaim<sup>asws</sup>, if he<sup>asws</sup> had risen, would have seized them, and cut off their hands, and circled with them and said: ‘These are the thieves (stealing from) Allah<sup>azwj</sup>’."}]}, {"index": 6808, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:25:5", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ الْبَرْقِيِّ عَنْ بَعْضِ أَصْحَابِنَا قَالَ دَفَعَتْ إِلَيَّ امْرَأَةٌ غَزْلًا فَقَالَتِ ادْفَعْهُ بِمَكَّةَ لِيُخَاطَ بِهِ كِسْوَةُ الْكَعْبَةِ فَكَرِهْتُ أَنْ أَدْفَعَهُ إِلَى الْحَجَبَةِ وَ أَنَا أَعْرِفُهُمْ فَلَمَّا صِرْتُ بِالْمَدِينَةِ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنَّ امْرَأَةً أَعْطَتْنِي غَزْلًا وَ أَمَرَتْنِي أَنْ أَدْفَعَهُ بِمَكَّةَ لِيُخَاطَ بِهِ كِسْوَةُ الْكَعْبَةِ فَكَرِهْتُ أَنْ أَدْفَعَهُ إِلَى الْحَجَبَةِ فَقَالَ اشْتَرِ بِهِ عَسَلًا وَ زَعْفَرَاناً وَ خُذْ طِينَ قَبْرِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ اعْجِنْهُ بِمَاءِ السَّمَاءِ وَ اجْعَلْ فِيهِ شَيْئاً مِنَ الْعَسَلِ وَ الزَّعْفَرَانِ وَ فَرِّقْهُ عَلَى الشِّيعَةِ لِيُدَاوُوا بِهِ مَرْضَاهُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Abu Abdullah Al barqy, from one of our companions who said, \n‘A woman handed over some yarn to me and she said, ‘Hand it over at Makkah for the covering of the Kabah to be spun with it’. But, I dislike that I should hand it over to the guards (of the Kabah), and I knew them. So when I came to Al-Medina I went over to Abu Ja’far<sup>asws</sup>, so I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! A woman gave me some yarn and instructed me that I hand it over at Makkah for the covering of the Kabah to be spun with it. But I disliked to hand it over to the guards’. So he<sup>asws</sup> said: ‘Buy some honey with it, and saffron, and take some clay from the grave of Abu Abdullah<sup>asws</sup> (Imam Husayn<sup>asws</sup>), and knead it with water of the sky (rain), and make something from the honey and the saffron to be in it, and distribute it upon the Shias for them to heal their sick ones with it’."}]}]}, "index": "al-kafi:4:3:25", "kind": "verse_list"}