{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:4:3:27",
        "titles": {
          "ar": "بَابُ حَجِّ النَّبِيِّ ( صلى الله عليه وآله )",
          "en": "Chapter 27 – Hajj of the Prophet<sup>saww</sup>"
        }
      }
    ],
    "index": 970,
    "local_index": 27,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:4:3:28",
        "titles": {
          "ar": "بَابُ فَضْلِ الْحَجِّ وَ الْعُمْرَةِ وَ ثَوَابِهِمَا",
          "en": "Chapter 28 – Merits of the Hajj and the Umra, and their Rewards"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 26"
        },
        "path": "/books/al-kafi:4:3:26",
        "titles": {
          "ar": "بَابٌ فِي قَوْلِهِ عَزَّ وَ جَلَّ سَواءً الْعاكِفُ فِيهِ وَ الْبادِ",
          "en": "Chapter 26 – Regarding the Words of the Mighty and Majestic [22:25] They are equal in it, the dweller and the visitor"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:27",
    "titles": {
      "ar": "بَابُ حَجِّ النَّبِيِّ ( صلى الله عليه وآله )",
      "en": "Chapter 27 – Hajj of the Prophet<sup>saww</sup>"
    },
    "verse_count": 14,
    "verse_start_index": 6810,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/109)"
        ],
        "index": 6811,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ جَعْفَرٍ ( عليه السلام ) قَالَ لَمْ يَحُجَّ النَّبِيُّ ( صلى الله عليه وآله ) بَعْدَ قُدُومِهِ الْمَدِينَةَ إِلَّا وَاحِدَةً وَ قَدْ حَجَّ بِمَكَّةَ مَعَ قَوْمِهِ حِجَّاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Giyas Bin Ibrahim, ",
            "(It has been narrated) from Ja’far<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> did not perform Hajj, after proceeding to Al-Medina, except for one, and he<sup>saww</sup> had performed Hajj in Makkah along with his<sup>saww</sup> people, (many) Hajjs’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad, from Muhammad ibn Yahya from Ghiyath ibn Ibrahim who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘The Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed only one hajj from al- Madinah; however, he had performed al-Hajj many times when in Makkah along with his people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/109)"
        ],
        "index": 6812,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:2",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عِيسَى الْفَرَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ حَجَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَشْرَ حِجَّاتٍ مُسْتَسِرّاً."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Isa Al fara’a, from Abdullah Bin Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>azwj</sup> performed ten Hajjs in concealment’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad has narrated from al-Hassan ibn Ali, from ‘Isa al-Farra’ from ‘Abd Allah ibn abu Ya’fur who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed Hajj ten times secretly and every time when in al-Mazimin would disembark and pass water (it was the first place where idols were worshipped).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/110)"
        ],
        "index": 6813,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:3",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ حَجَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عِشْرِينَ حَجَّةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Hassan Bin ali, from Yunus Bin Yaqoub, from Umar Bin Yazeed, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> performed twenty Hajjs’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn Muhammad has narrated from al-Hassan ibn Ali from Yunus ibn Ya’qub from ‘Umar ibn Yazid who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed Hajj a total of twenty times.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/110)"
        ],
        "index": 6814,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:4",
        "refs": {
          "Mentions": [
            "/books/quran:2:198",
            "/books/quran:2:199",
            "/books/quran:22:26",
            "/books/quran:2:158",
            "/books/quran:22:27",
            "/books/quran:3:95",
            "/books/quran:3:89"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَقَامَ بِالْمَدِينَةِ عَشْرَ سِنِينَ لَمْ يَحُجَّ ثُمَّ أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ وَ أَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجالًا وَ عَلى كُلِّ ضامِرٍ يَأْتِينَ مِنْ كُلِّ فَجٍّ عَمِيقٍ فَأَمَرَ الْمُؤَذِّنِينَ أَنْ يُؤَذِّنُوا بِأَعْلَى أَصْوَاتِهِمْ بِأَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَحُجُّ فِي عَامِهِ هَذَا",
          "فَعَلِمَ بِهِ مَنْ حَضَرَ الْمَدِينَةَ وَ أَهْلُ الْعَوَالِي وَ الْأَعْرَابُ وَ اجْتَمَعُوا لِحَجِّ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِنَّمَا كَانُوا تَابِعِينَ يَنْظُرُونَ مَا يُؤْمَرُونَ وَ يَتَّبِعُونَهُ أَوْ يَصْنَعُ شَيْئاً فَيَصْنَعُونَهُ",
          "فَخَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي أَرْبَعٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ فَلَمَّا انْتَهَى إِلَى ذِي الْحُلَيْفَةِ زَالَتِ الشَّمْسُ فَاغْتَسَلَ ثُمَّ خَرَجَ حَتَّى أَتَى الْمَسْجِدَ الَّذِي عِنْدَ الشَّجَرَةِ فَصَلَّى فِيهِ الظُّهْرَ وَ عَزَمَ بِالْحَجِّ مُفْرِداً وَ خَرَجَ حَتَّى انْتَهَى إِلَى الْبَيْدَاءِ عِنْدَ الْمِيلِ الْأَوَّلِ فَصُفَّ لَهُ سِمَاطَانِ ",
          "فَلَبَّى بِالْحَجِّ مُفْرِداً وَ سَاقَ الْهَدْيَ سِتّاً وَ سِتِّينَ أَوْ أَرْبَعاً وَ سِتِّينَ حَتَّى انْتَهَى إِلَى مَكَّةَ فِي سَلْخِ أَرْبَعٍ مِنْ ذِي الْحِجَّةِ فَطَافَ بِالْبَيْتِ سَبْعَةَ أَشْوَاطٍ ثُمَّ صَلَّى رَكْعَتَيْنِ خَلْفَ مَقَامِ إِبْرَاهِيمَ ( عليه السلام ) ثُمَّ عَادَ إِلَى الْحَجَرِ فَاسْتَلَمَهُ وَ قَدْ كَانَ اسْتَلَمَهُ فِي أَوَّلِ طَوَافِهِ ",
          "ثُمَّ قَالَ إِنَّ الصَّفَا وَ الْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَأَبْدَأُ بِمَا بَدَأَ اللَّهُ تَعَالَى بِهِ وَ إِنَّ الْمُسْلِمِينَ كَانُوا يَظُنُّونَ أَنَّ السَّعْيَ بَيْنَ الصَّفَا وَ الْمَرْوَةِ شَيْ‏ءٌ صَنَعَهُ الْمُشْرِكُونَ فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ الصَّفا وَ الْمَرْوَةَ مِنْ شَعائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلا جُناحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِما",
          "ثُمَّ أَتَى الصَّفَا فَصَعِدَ عَلَيْهِ وَ اسْتَقْبَلَ الرُّكْنَ الْيَمَانِيَّ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ دَعَا مِقْدَارَ مَا يُقْرَأُ سُورَةُ الْبَقَرَةِ مُتَرَسِّلًا ثُمَّ انْحَدَرَ إِلَى الْمَرْوَةِ فَوَقَفَ عَلَيْهَا كَمَا وَقَفَ عَلَى الصَّفَا ثُمَّ انْحَدَرَ وَ عَادَ إِلَى الصَّفَا فَوَقَفَ عَلَيْهَا ثُمَّ انْحَدَرَ إِلَى الْمَرْوَةِ حَتَّى فَرَغَ مِنْ سَعْيِهِ",
          "فَلَمَّا فَرَغَ مِنْ سَعْيِهِ وَ هُوَ عَلَى الْمَرْوَةِ أَقْبَلَ عَلَى النَّاسِ بِوَجْهِهِ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ هَذَا جَبْرَئِيلُ وَ أَوْمَأَ بِيَدِهِ إِلَى خَلْفِهِ يَأْمُرُنِي أَنْ آمُرَ مَنْ لَمْ يَسُقْ هَدْياً أَنْ يُحِلَّ وَ لَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَصَنَعْتُ مِثْلَ مَا أَمَرْتُكُمْ وَ لَكِنِّي سُقْتُ الْهَدْيَ وَ لَا يَنْبَغِي لِسَائِقِ الْهَدْيِ أَنْ يُحِلَّ حَتَّى يَبْلُغَ الْهَدْيُ مَحِلَّهُ",
          "قَالَ فَقَالَ لَهُ رَجُلٌ مِنَ الْقَوْمِ لَنَخْرُجَنَّ حُجَّاجاً وَ رُءُوسُنَا وَ شُعُورُنَا تَقْطُرُ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَمَا إِنَّكَ لَنْ تُؤْمِنَ بِهَذَا أَبَداً فَقَالَ لَهُ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ الْكِنَانِيُّ يَا رَسُولَ اللَّهِ عُلِّمْنَا دِينَنَا كَأَنَّا خُلِقْنَا الْيَوْمَ فَهَذَا الَّذِي أَمَرْتَنَا بِهِ لِعَامِنَا هَذَا أَمْ لِمَا يَسْتَقْبِلُ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بَلْ هُوَ لِلْأَبَدِ إِلَى يَوْمِ الْقِيَامَةِ ثُمَّ شَبَّكَ أَصَابِعَهُ وَ قَالَ دَخَلَتِ الْعُمْرَةُ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِ ",
          "قَالَ وَ قَدِمَ عَلِيٌّ ( عليه السلام ) مِنَ الْيَمَنِ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ بِمَكَّةَ فَدَخَلَ عَلَى فَاطِمَةَ سَلَامُ اللَّهِ عَلَيْهَا وَ هِيَ قَدْ أَحَلَّتْ فَوَجَدَ رِيحاً طَيِّبَةً وَ وَجَدَ عَلَيْهَا ثِيَاباً مَصْبُوغَةً فَقَالَ مَا هَذَا يَا فَاطِمَةُ فَقَالَتْ أَمَرَنَا بِهَذَا رَسُولُ اللَّهِ ( صلى الله عليه وآله )",
          "فَخَرَجَ عَلِيٌّ ( عليه السلام ) إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مُسْتَفْتِياً فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَأَيْتُ فَاطِمَةَ قَدْ أَحَلَّتْ وَ عَلَيْهَا ثِيَابٌ مَصْبُوغَةٌ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنَا أَمَرْتُ النَّاسَ بِذَلِكَ فَأَنْتَ يَا عَلِيُّ بِمَا أَهْلَلْتَ قَالَ يَا رَسُولَ اللَّهِ إِهْلَالًا كَإِهْلَالِ النَّبِيِّ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قِرَّ عَلَى إِحْرَامِكَ مِثْلِي وَ أَنْتَ شَرِيكِي فِي هَدْيِي ",
          "قَالَ وَ نَزَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِمَكَّةَ بِالْبَطْحَاءِ هُوَ وَ أَصْحَابُهُ وَ لَمْ يَنْزِلِ الدُّورَ فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ عِنْدَ زَوَالِ الشَّمْسِ أَمَرَ النَّاسَ أَنْ يَغْتَسِلُوا وَ يُهِلُّوا بِالْحَجِّ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ الَّذِي أَنْزَلَ عَلَى نَبِيِّهِ ( صلى الله عليه وآله ) فَاتَّبِعُوا مِلَّةَ أَبِيكُمْ إِبْرَاهِيمَ",
          "فَخَرَجَ النَّبِيُّ ( صلى الله عليه وآله ) وَ أَصْحَابُهُ مُهِلِّينَ بِالْحَجِّ حَتَّى أَتَى مِنًى فَصَلَّى الظُّهْرَ وَ الْعَصْرَ وَ الْمَغْرِبَ وَ الْعِشَاءَ الْآخِرَةَ وَ الْفَجْرَ ثُمَّ غَدَا وَ النَّاسُ مَعَهُ وَ كَانَتْ قُرَيْشٌ تُفِيضُ مِنَ الْمُزْدَلِفَةِ وَ هِيَ جَمْعٌ وَ يَمْنَعُونَ النَّاسَ أَنْ يُفِيضُوا مِنْهَا فَأَقْبَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ قُرَيْشٌ تَرْجُوا أَنْ تَكُونَ إِفَاضَتُهُ مِنْ حَيْثُ كَانُوا يُفِيضُونَ ",
          "فَأَنْزَلَ اللَّهُ تَعَالَى عَلَيْهِ ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفاضَ النَّاسُ وَ اسْتَغْفِرُوا اللَّهَ يَعْنِي إِبْرَاهِيمَ وَ إِسْمَاعِيلَ وَ إِسْحَاقَ فِي إِفَاضَتِهِمْ مِنْهَا وَ مَنْ كَانَ بَعْدَهُمْ فَلَمَّا رَأَتْ قُرَيْشٌ أَنَّ قُبَّةَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَدْ مَضَتْ كَأَنَّهُ دَخَلَ فِي أَنْفُسِهِمْ شَيْ‏ءٌ لِلَّذِي كَانُوا يَرْجُونَ مِنَ الْإِفَاضَةِ مِنْ مَكَانِهِمْ حَتَّى انْتَهَى إِلَى نَمِرَةَ وَ هِيَ بَطْنُ عُرَنَةَ بِحِيَالِ الْأَرَاكِ فَضُرِبَتْ قُبَّتُهُ وَ ضَرَبَ النَّاسُ أَخْبِيَتَهُمْ عِنْدَهَا ",
          "فَلَمَّا زَالَتِ الشَّمْسُ خَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ مَعَهُ قُرَيْشٌ وَ قَدِ اغْتَسَلَ وَ قَطَعَ التَّلْبِيَةَ حَتَّى وَقَفَ بِالْمَسْجِدِ فَوَعَظَ النَّاسَ وَ أَمَرَهُمْ وَ نَهَاهُمْ ثُمَّ صَلَّى الظُّهْرَ وَ الْعَصْرَ بِأَذَانٍ وَ إِقَامَتَيْنِ ثُمَّ مَضَى إِلَى الْمَوْقِفِ فَوَقَفَ بِهِ فَجَعَلَ النَّاسُ يَبْتَدِرُونَ أَخْفَافَ نَاقَتِهِ يَقِفُونَ إِلَى جَانِبِهَا فَنَحَّاهَا فَفَعَلُوا مِثْلَ ذَلِكَ فَقَالَ أَيُّهَا النَّاسُ لَيْسَ مَوْضِعُ أَخْفَافِ نَاقَتِي بِالْمَوْقِفِ وَ لَكِنْ هَذَا كُلُّهُ وَ أَوْمَأَ بِيَدِهِ إِلَى الْمَوْقِفِ فَتَفَرَّقَ النَّاسُ ",
          "وَ فَعَلَ مِثْلَ ذَلِكَ بِالْمُزْدَلِفَةِ فَوَقَفَ النَّاسُ حَتَّى وَقَعَ الْقُرْصُ قُرْصُ الشَّمْسِ ثُمَّ أَفَاضَ وَ أَمَرَ النَّاسَ بِالدَّعَةِ حَتَّى انْتَهَى إِلَى الْمُزْدَلِفَةِ وَ هُوَ الْمَشْعَرُ الْحَرَامُ فَصَلَّى الْمَغْرِبَ وَ الْعِشَاءَ الْآخِرَةَ بِأَذَانٍ وَاحِدٍ وَ إِقَامَتَيْنِ",
          "ثُمَّ أَقَامَ حَتَّى صَلَّى فِيهَا الْفَجْرَ وَ عَجَّلَ ضُعَفَاءَ بَنِي هَاشِمٍ بِلَيْلٍ وَ أَمَرَهُمْ أَنْ لَا يَرْمُوا الْجَمْرَةَ جَمْرَةَ الْعَقَبَةِ حَتَّى تَطْلُعَ الشَّمْسُ فَلَمَّا أَضَاءَ لَهُ النَّهَارُ أَفَاضَ حَتَّى انْتَهَى إِلَى مِنًى فَرَمَى جَمْرَةَ الْعَقَبَةِ",
          "وَ كَانَ الْهَدْيُ الَّذِي جَاءَ بِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَرْبَعَةً وَ سِتِّينَ أَوْ سِتَّةً وَ سِتِّينَ وَ جَاءَ عَلِيٌّ ( عليه السلام ) بِأَرْبَعَةٍ وَ ثَلَاثِينَ أَوْ سِتَّةٍ وَ ثَلَاثِينَ فَنَحَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سِتَّةً وَ سِتِّينَ وَ نَحَرَ عَلِيٌّ ( عليه السلام ) أَرْبَعَةً وَ ثَلَاثِينَ بَدَنَةً وَ أَمَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ يُؤْخَذَ مِنْ كُلِّ بَدَنَةٍ مِنْهَا جَذْوَةٌ مِنْ لَحْمٍ ثُمَّ تُطْرَحَ فِي بُرْمَةٍ ثُمَّ تُطْبَخَ",
          "فَأَكَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٌّ وَ حَسَوَا مِنْ مَرَقِهَا وَ لَمْ يُعْطِيَا الْجَزَّارِينَ جُلُودَهَا وَ لَا جِلَالَهَا وَ لَا قَلَائِدَهَا وَ تَصَدَّقَ بِهِ وَ حَلَقَ وَ زَارَ الْبَيْتَ وَ رَجَعَ إِلَى مِنًى وَ أَقَامَ بِهَا حَتَّى كَانَ الْيَوْمُ الثَّالِثُ مِنْ آخِرِ أَيَّامِ التَّشْرِيقِ",
          "ثُمَّ رَمَى الْجِمَارَ وَ نَفَرَ حَتَّى انْتَهَى إِلَى الْأَبْطَحِ فَقَالَتْ لَهُ عَائِشَةُ يَا رَسُولَ اللَّهِ تَرْجِعُ نِسَاؤُكَ بِحَجَّةٍ وَ عُمْرَةٍ مَعاً وَ أَرْجِعُ بِحَجَّةٍ فَأَقَامَ بِالْأَبْطَحِ وَ بَعَثَ مَعَهَا عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ إِلَى التَّنْعِيمِ فَأَهَلَّتْ بِعُمْرَةٍ ثُمَّ جَاءَتْ وَ طَافَتْ بِالْبَيْتِ وَ صَلَّتْ رَكْعَتَيْنِ عِنْدَ مَقَامِ إِبْرَاهِيمَ ( عليه السلام ) وَ سَعَتْ بَيْنَ الصَّفَا وَ الْمَرْوَةِ ثُمَّ أَتَتِ النَّبِيَّ ( صلى الله عليه وآله )",
          "فَارْتَحَلَ مِنْ يَوْمِهِ وَ لَمْ يَدْخُلِ الْمَسْجِدَ الْحَرَامَ وَ لَمْ يَطُفْ بِالْبَيْتِ وَ دَخَلَ مِنْ أَعْلَى مَكَّةَ مِنْ عَقَبَةِ الْمَدَنِيِّينَ وَ خَرَجَ مِنْ أَسْفَلِ مَكَّةَ مِنْ ذِي طُوًى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that Rasool-Allah<sup>saww</sup> stayed in Al-Medina for ten years not performing Hajj. Then Allah<sup>azwj</sup> Mighty and Majestic Revealed upon him <span class=\"ibTxt\"><a href=\"/#/books/quran:22#h27\">[22:27]</a> And proclaim among the people for the Pilgrimage: they will come to you on foot and on every lean camel, coming from every remote path</span>. So he<sup>saww</sup> ordered the proclaimers that they should be proclaiming in their loud voices that Rasool-Allah<sup>saww</sup> would be performing (Hajj) during this year of his<sup>saww</sup>.",
            "So the one who were present in Al-Medina came to know of it, and the people of Al-Awaly, and the Bedouins, and they gathered for the Hajj of Rasool-Allah<sup>saww</sup> during the four days remaining from Zil-Qadah. And rather, they were following awaiting what he<sup>saww</sup> would ordered them with so they would follow it, or he<sup>saww</sup> would do something, so they would be doing it. ",
            "So Rasool-Allah<sup>saww</sup> went out with four days remaining from Zil-Qadah. So when he<sup>saww</sup> ended up to Zul Huleyfa, the sun declined, so he<sup>saww</sup> washed, then went out until he<sup>saww</sup> came over to the Masjid which was by the tree. So he<sup>saww</sup> Prayed Al-Zohr therein, and determined with the individual Hajj, and went out until he<sup>saww</sup> ended up to Al-Bayda at the first mile. So they stood in two rows for him<sup>saww</sup>.",
            "So he<sup>saww</sup> exclaimed Talbiyya with the individual Hajj and ushered the sacrificial animals, sixty-six or forty-six, until he<sup>saww</sup> ended up to Makkah during the end part of the fourth of Zil-Hijja. So he<sup>saww</sup> circumambulated with the House (Kabah) seven circuits, then Prayed two Cycles behind the Standing Place of Ibrahim<sup>as</sup>. Then he<sup>saww</sup> turned back to the (Black) Stone, so he<sup>saww</sup> kissed it, and he<sup>saww</sup> had kissed it during his<sup>saww</sup> first circumambulation. ",
            "Then he<sup>saww</sup> said: ‘Al-Safa and Al-Marwa are from the Rituals of Allah<sup>azwj</sup>, therefore begin with what Allah<sup>azwj</sup> the Exalted Began with. And the Muslims were thinking that the Sa’ee between Al-Safa and Al-Marwa was something which the Polytheists used to do. So Allah<sup>azwj</sup> Mighty and Majestic Revealed <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h158\">[2:158]</a> Surely, the Safa and the Marwa are among the Rituals appointed by Allah; so whoever makes a Pilgrimage to the House or pays a visit (to it), there is no blame on him if he goes round them both</span>.",
            "Then he<sup>saww</sup> came to Al-Safa, so he<sup>saww</sup> climbed upon it and faced the Yemeni corner (of the Kabah), and he<sup>saww</sup> Praised Allah<sup>azwj</sup> and Extolled upon Him<sup>azwj</sup>, and supplicated for a measurement of what it takes to recite Surah Al-Baqarah slowly. Then he<sup>saww</sup> went down to Al-Marwa, so he<sup>saww</sup> paused upon it just as he<sup>saww</sup> had paused upon Al-Safa. Then he<sup>saww</sup> came down and returned to Al-Safa. So he<sup>saww</sup> paused upon it, then went down to Al-Marwa, until he<sup>saww</sup> was free from (doing it) seven (times).",
            "So when he<sup>saww</sup> was free from his<sup>saww</sup> seventh, and he<sup>saww</sup> was upon Al-Marwa, faced towards the people with his<sup>saww</sup> face, and he<sup>saww</sup> Praised Allah<sup>azwj</sup> and Extolled upon Him<sup>azwj</sup>, then said: ‘This is Jibraeel<sup>as</sup>’, and he<sup>saww</sup> gestured by his<sup>saww</sup> hand to behind him<sup>saww</sup>, ‘Instructing me<sup>saww</sup> that I<sup>saww</sup> should order the one who did not usher a sacrificial animal, that he should free (himself from the wearing of Ihram), and had I<sup>saww</sup> faced from my<sup>saww</sup> matters what I<sup>saww</sup> managed, I<sup>saww</sup> would have done the like of what I<sup>saww</sup> am ordering you all for, but I<sup>saww</sup> ushered the sacrificial animal, and it is not befitting for an usherer of the sacrificial animal that he frees (from wearing the Ihram) until the sacrificial animal reaches its place.",
            "He<sup>asws</sup> said: ‘So a man from the group said, ‘We were brought out as Pilgrims and our heads and our hairs are dripping’. So Rasool-Allah<sup>saww</sup> said to him: ‘But, you will never believe in this, ever!’ So Suraqat Bin Malik Bin Ju’sham Al-Kinany said to him<sup>saww</sup>, ‘O Rasool-Allah<sup>saww</sup>! Teach us our Religioin as if we have been Created today. So this, which you<sup>saww</sup> are ordering us with, it is for this year of our or (we) do this in the future (as well)?’ So Rasool-Allah<sup>saww</sup> said to him: ‘But, it is forever, up to the Day of Judgement’. Then he<sup>saww</sup> clasped (held) his<sup>saww</sup> fingers and said: ‘The Umra is included in the Hajj up to the Day of Judgement’. ",
            "He<sup>asws</sup> said: ‘And Ali<sup>asws</sup> came back from Al-Yemen to Rasool-Allah<sup>saww</sup>, and he<sup>saww</sup> was in Makkah. So he<sup>asws</sup> went over to Syeda Fatima<sup>asws</sup> and she<sup>asws</sup> had freed (from wearing Ihram), so he<sup>asws</sup> found an aromatic fragrance, and found dyed clothes upon her. So he<sup>asws</sup> said: ‘What is this, O Fatima<sup>asws</sup>?’ So she<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> ordered us with this’. ",
            "So Ali<sup>asws</sup> went out to Rasool-Allah<sup>saww</sup> to follow up, and he<sup>asws</sup> said: ‘O Rasool-Allah<sup>saww</sup>! I<sup>asws</sup> saw Fatima<sup>asws</sup> to have freed (from wearing Ihram), and upon her<sup>asws</sup> were dyed clothes’. So Rasool-Allah<sup>saww</sup> said: ‘I<sup>saww</sup> ordered the people with that. But you<sup>asws</sup>, O Ali<sup>asws</sup>, with what have you<sup>asws</sup> welcomed (commenced) (the Hajj)?’ He<sup>asws</sup> said: ‘O Rasool-Allah<sup>saww</sup>! My<sup>asws</sup> welcoming is like the welcoming of the Prophet<sup>saww</sup>’. So Rasool-Allah<sup>saww</sup> said to him<sup>asws</sup>: ‘Remain upon your<sup>asws</sup> Ihram like me<sup>saww</sup>, and you<sup>asws</sup> are a participant in my<sup>saww</sup> sacrificial offerings’. ",
            "He<sup>asws</sup> said: ‘And Rasool-Allah<sup>saww</sup> encamped in Makkah at Al-Bat’ha, him<sup>saww</sup> and his<sup>saww</sup> companions, and he<sup>saww</sup> did not lodge in the houses. So when it was the day of Al-Tarwiyya (8<sup>th</sup> of Zil-Hijja), at the decline of the sun, he<sup>saww</sup> ordered the people that they should wash and commence with the Hajj, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic which were Revealed unto His<sup>azwj</sup> Prophet<sup>saww</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h95\">[3:95]</a> therefore follow the Religion of Ibrahim</span>.",
            "So the Prophet<sup>saww</sup> and his<sup>saww</sup> companions went out inclined with the Hajj until he<sup>saww</sup> came to Mina. So he<sup>saww</sup> Prayed Al-Zohr, and Al-Asr, and Al-Magrib, and Al-Isha the last, and Al-Fajr. Then he<sup>saww</sup> went in the morning, and the people were with him<sup>saww</sup>. And the Qureysh used to hasten from Al-Muzdalifa, and it is Jam’a, and they were preventing people that they should be hastening from it. So Rasool-Allah<sup>saww</sup> came back, and Qureysh were hoping that his<sup>saww</sup> hastening would be from where they were hastening from.",
            "But, Allah<sup>azwj</sup> the Exalted Revealed unto him<sup>saww</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h199\">[2:199]</a> Then hasten on from where the people hasten on and seek the Forgiveness of Allah; surely Allah is Forgiving, Merciful</span>, Meaning Ibrahim<sup>as</sup>, and Ismail<sup>as</sup>, and Is’haq<sup>as</sup> during their<sup>as</sup> hastening from it, and the ones who were after them<sup>as</sup>. So when the Qureysh saw that the tent of Rasool-Allah<sup>saww</sup> had passed, it was as if something had entered into their selves which they were hoping for from the hastening from their places, until they ended up to Namira, and it is middle of Urana around Al-Arak. So he<sup>saww</sup> struck his<sup>saww</sup> tent, and the people pitched their tents by it. ",
            "So when the sun declined, Rasool-Allah<sup>saww</sup> went out and with him<sup>saww</sup> were the Qureysh, and he<sup>saww</sup> had washed and cut-off the Talbiyya until he<sup>saww</sup> paused by the Masjid. So he preached the people and ordered them and forbid them. Then he<sup>saww</sup> Prayed Al-Zohr, and Al-Asr with one Azan and two Iqamas. Then he<sup>saww</sup> went to the Pausing Station, so he<sup>saww</sup> paused in it. So the people went on to crowd with their sandals by his<sup>saww</sup> camel, pausing by his<sup>saww</sup> side. So he<sup>saww</sup> forbid it, but they did similar to that. So he<sup>saww</sup> said: ‘O you people! The place of the sandals is not by my<sup>saww</sup> camel with the Pausing, but all this’, and he<sup>saww</sup> gestured by his<sup>saww</sup> hand to the Pausing Station’. So the people dispersed.",
            "And he<sup>saww</sup> did similar to that in Al Muzdalifa. So the people paused until the disc fell, the disc of the sun. Then he<sup>saww</sup> departed and ordered the people with the gentleness until he<sup>saww</sup> ended up to Al Muzdalifa, and it is the Sacred Ritual. So he<sup>saww</sup> Prayed Al-Magrib, and Al-Isha the last, with one Azan and two Iqamas. ",
            "Then he<sup>saww</sup> stayed until he<sup>saww</sup> Prayed Al-Fajr therein, and urged the weak ones of the Clan of Hashim to leave at night and ordered them that they should not pelt the rock, the rock of Al-Aqaba, until the emergence of the sun. So when the day illuminated for him<sup>saww</sup>, he<sup>saww</sup> departed until he<sup>saww</sup> ended up to Mina, so he<sup>saww</sup> pelted the rock of Al-Aqaba. ",
            "And the sacrificial animals which Rasool-Allah<sup>saww</sup> came with were sixty-four to sixty-six, and Ali<sup>asws</sup> came with thirty-four to thirty-six. So Rasool-Allah<sup>saww</sup> sacrificed sixty six, and Ali<sup>asws</sup> sacrificed thirty-four camels. And Rasool-Allah<sup>saww</sup> ordered a piece of flesh be taken from each camel sacrificed from it, then placed in a cooking pot, then cooked. ",
            "So Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup> ate and sipped from its soup, and did not give to the butchers, their skins, nor their decorations, nor their reins, but gave in charity with it. And he<sup>saww</sup> shaved (his<sup>saww</sup> head), and visited the House (Kabah), and returned to Mina and stayed in it until it was the third day from the last days of Al-Tashreek (11<sup>th</sup>, 12<sup>th</sup>, and 13<sup>th</sup> of Zilhajj). ",
            "Then he<sup>saww</sup> pelted the rocks and went until he<sup>saww</sup> ended up to Al-Bat’ha. So Ayesha said to him<sup>saww</sup>, ‘O Rasool-Allah<sup>saww</sup>! You<sup>saww</sup> are returning your<sup>saww</sup> wives with Hajj and Umra together, and I should return (only) with Hajj?’ So he<sup>saww</sup> stayed at Bat’ha and sent her with Abdul Rahman Bin Abu Bakr to al Al-Tan’eem. So she commenced with her Umra, then came over and circumambulated with the House, and Prayed two Cycles by the Standing Place of Ibrahim<sup>as</sup>, and performed Sa’ee between Al-Safa and Al-Marwa. Then she came over to the Prophet<sup>saww</sup>.",
            "So he<sup>saww</sup> travelled from that day of his<sup>saww</sup> and did not enter the Sacred Masjid and did not circumambulate with the House, and entered from the high ground of Makkah from Aqaba, of the two cities and went out from the lower ground of Makkah, from Zi-Tuwwa’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan all from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, lived in al- Madinah for ten years but did not perform Hajj. Allah, the Most Majestic, the Most Glorious, then revealed this verse, ‘Call people for Hajj, they will come to you on foot and on lean transport animals from faraway places.’ <a href=\"/#/books/quran:22#h26\">[22:26]</a> “He then commanded two announcers to announce loudly that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, this year has decided to perform Hajj. People of al-Madinah, people of al-‘Awaliy and Arabs all came together for Hajj of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. They only followed the Messenger of Allah and waited for his orders or did what the Messenger of Allah did. The Messenger of Allah left for Makkah just four days before the beginning of the month of Dhu al-Hajj ah. When he arrived at Dhu al-Hulayfah it was noontime, the sun had just declined to the west from a point half way between east and west overhead. He took a shower, and then went to the Masjid near the tree. He performed al-Zuhr salat (prayer), and then made his decision to perform an individual (Ifrad) Hajj. He then left and arrived at al-Bayda’, one mile away from al-Madinah, where two rows of people stood in line. He said Talbiyah (here I am O Lord, to obey Your command). He herded his offering animals that numbered sixty-six or sixty-four heads of cattle. He then arrived in Makkah during the end of the fourth day of Dhu al-Hajj. He performed seven times Tawaf around the House, performed two Rak‘at salat (prayer) behind the station of Ibrahim, returned to the Black Stone and touched it. He had touched it in the beginning of his Tawaf walking around the House. He then said, ‘Al-Safa’ and al-Marwah are of al-Sha’a’ir of Allah (things that remind one of Allah). So I begin with what Allah, the most High, has begun with.’ The Muslims thought that al-Sa‘y (walking) between al-Safa’ al-Marwah was something that the pagans did. Allah, the Most Majestic, the Most Glorious, then revealed this, ‘Al-Safa’ and al-Marwah are of al-Sha’a’ir of Allah (things that remind one of Allah). Those who perform Hajj or ‘Umrah must perform Tawaf between them.’ ( 2 : 153 ) “He then went to al-Safa’, climbed it, turned his face to the al-Yemaniy corner (of the House), thanked and praised Allah, and prayed for as long as it may take one to read Chapter two of the Holy Quran, in fluent reading. He then climbed down toward al-Marwah and stood on it just as he had done on al- Safa’ . He then climbed down and returned to al-Safa’ where he stood for a while, then came down toward al-Marwah (and so on) until he completed seven times of walking between the two places. When he completed his Sa‘y while on al-Marwah, he turned toward people, praised Allah, spoke of His glory and then said, ‘This is Jibril. He pointed with his hand to a point behind him. He commands me to command those who have not herded their sacrificial animals to come out of the state of Ihram. In future, I will not do what I have done this time (performing Ifrad Hajj and herding sacrificial animals). Instead, I will do what I am commanding you to do, but I have herded my sacrificial animals and it is not proper for one who has herded his sacrificial animals to come out of the state of Ihram (at this point) before the sacrificial animals reach their place.’ He (the Imam) said that a man from the group then said to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, ‘Must we then begin performing the acts of Hajj while water from our heads and hairs is dropping down (after taking a shower for carnal relations)?’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, then said to him, ‘You, however, will never believe in it.’ Suraqah ibn Malik ibn Jush‘am al-Kinaniy then said, ‘O Messenger of Allah, teach us our religion as if we are just created today. Is what you do for this year only, or it is for future also?’ The Messenger of Allah replied, ‘It certainly is forever to the Day of Judgment.’ He then grappled the fingers of one of his hands with those of the other hand saying, ‘A1-’ Umrah with Hajj are joined together up to the Day of Judgment.’ He (the Imam) then said, ‘Ali, ‘Alayhi al-Salam, then arrived in Makkah in the presence of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, from Yemen. He went to Fatimah, ‘Alayha al-Salam, when she had come out of the state of Ihram. He found her using perfume and dressed in colored clothes. He then asked, ‘Why have you done this, O Fatimah?’ She replied, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, commanded us to do so.’ Ali, Alayhi al-Salam, then went to the Messenger of Allah to find out a fatwa saying, ‘O Messenger of Allah, Fatimah has come out of the state of Ihram and has dressed up in colored clothes.’ The Messenger of Allah replied, ‘I have commanded people to do so. O Ali, how have you commenced your Hajj?’ He replied, ‘O Messenger of Allah, I have said, “My commencement of Hajj is like that of the Holy Prophet.” The Messenger of Allah then said, ‘You must remain with your Ihram as I have remained and you are my partner in my sacrificial animals.’ He (the Imam) said, ‘The Messenger of Allah arrived in Makkah, at al-Batha’ along with his companions. They did not use the houses. On the day of al-Tarwiyah (eighth of Dhu al-Hajjah) at noontime, he (the Messenger of Allah) commanded people to take a shower, say Talbiyah (here I am O Lord, to obey Your command) for Hajj. These are the words of Allah, the Most Majestic, the Most Glorious, that He revealed to His Prophet, ‘Follow the religion of (your father) Ibrahim.’ <a href=\"/#/books/quran:3#h89\">[3:89]</a> The Messenger of Allah and his companions came out for Hajj saying Talbiyah (here I am O Lord, to obey Your command) until they arrived in Mina, where they said salat (prayer) of al-Zuhr, al-‘Asr, al-Maghrib, al-Tsha’a and al-Fajr. In the morning, people were with him. Quraysh would leave from al-Muzdalifah, which is al-JanT, and would prevent people to leave from that place. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, came and Quraysh hoped that his leaving would be like their leaving from al-Muzdalifah. Allah, most High, then revealed this verse. ’Then you must leave (al-Muzdalifah) as people do and ask Allah for His forgiveness’ <a href=\"/#/books/quran:2#h198\">[2:198]</a>, meaning thereby, Ibrahim, Isma’il and Ishaq in their departure from it and those after them. When Quraysh saw the banner of the Messenger of Allah had passed, they felt something in their heart about leaving from their place. It (the banner) arrived at al-Namirah, which is Batn ‘ Arnah, parallel to Arak. The banner was raised and people pitched their tents there. When it was noontime, the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, came out. Quraysh also did so, along with him. He had taken a shower and had discontinued saying Talbiyah (here I am O Lord, to obey Your command). He stood at the door of the Masjid, preached to people of His commands and prohibitions. He then said salat (prayer) of al-Zuhr and al-’Asr with one Adhan and two Tqamah. He then went to the staying place and remained there. People began crowding around his camel. He moved his camel and they also did so. He then said, £ 0 people, the staying place is not under the feet of my camel only. This whole area’ - pointing with his hand to station - ’is the place to stay’. People then scattered around. He did the same thing in al-Muzdalifah and people stayed there until sunset, then he left and commanded people to remain calm and peaceful until they arrived in al- Muzdalifah, which is al-Mash‘ar al-Haram. He said salat (prayer) of al-Maghrib and al-‘Isha’ prayers with one Adhan and two Tqamah, then he stayed until he said salat (prayer) of al-Fajr there and asked the weaker people of banu Hashim to leave quickly during the night and not to throw pebbles on al- Jamarah (Jamarah al-‘Aqabah) before sunrise. When the day became bright, he left al-Muzdalifah. He arrived in Mina. He then threw pebbles on Jamarah al-‘Aqabah. The sacrificial animals that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, had brought were sixty-four or sixty-six heads. Ali, ‘Alayhi al-Salam, had brought thirty-four heads or thirty-six heads of cattle. The Messenger of Allah offered sixty-six heads of cattle and Ali, ‘Alayhi al-Salam, offered thirty-four heads of cattle. “The Messenger of Allah commanded him to take from the meat of every camel a piece and cook it in a pot. The Messenger of Allah and Ali, ‘Alayhim al-Salam, ate from the meat and sipped of the soup thereof. They did not give the hide or the items with which the animals were herded or decorated to the butchers. Instead, such items were given as charity to the needy. He shaved his head, visited the House, returned to Mina and stayed there until the bright days were over. He threw pebbles on al- Jamar and left until he arrived in al-Abtah. ‘A’ishah then asked, ’O Messenger of Allah, are you returning your wives with Hajj and ‘Umrah together and only I return with Hajj?’ He then stayed in al- Abtah and sent ‘Abd al-Rahman ibn abu Bakr with her to al-Tan‘im. She said Talbiyah (here I am O Lord, to obey Your command) for ‘Umrah from there and came for Tawaf around the House, to pray two Rak’at prayers near the station of Ibrahim, made Sa’y between al-Safa’ and al-Marwah, then came to the Holy Prophet. He (the Messenger of Allah) left the same day, did not enter al-Masjid al-Haram and did not perform Tawaf around the House. He entered from the upper part of Makkah from ‘Aqabah al-Madaniyin and came out from the lower part of Makkah from Dhu Tuwa’.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/115)"
        ],
        "index": 6815,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ إِسْمَاعِيلَ بْنِ هَمَّامٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ أَخَذَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حِينَ غَدَا مِنْ مِنًى فِي طَرِيقِ ضَبٍّ وَ رَجَعَ مَا بَيْنَ الْمَأْزِمَيْنِ وَ كَانَ إِذَا سَلَكَ طَرِيقاً لَمْ يَرْجِعْ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ismail Bin Hammam, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup>, when he<sup>saww</sup> went from Mina, took the Zabb road, and returned by what is between Al-Mazimayn, and it was such that whenever he<sup>saww</sup> travelled by a road, did not return in it (i.e. came back from another way)’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Isma‘il ibn Hammam who has said the following: “Abu al-Hassan, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, when leaving Mina moved through the path of Dabb and returned from between al-Mazimin, and when he walked through a path, he would not return by the same path.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/116)"
        ],
        "index": 6816,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:6",
        "refs": {
          "Mentions": [
            "/books/quran:2:196"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حِينَ حَجَّ حَجَّةَ الْإِسْلَامِ خَرَجَ فِي أَرْبَعٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ حَتَّى أَتَى الشَّجَرَةَ فَصَلَّى بِهَا ثُمَّ قَادَ رَاحِلَتَهُ حَتَّى أَتَى الْبَيْدَاءَ فَأَحْرَمَ مِنْهَا وَ أَهَلَّ بِالْحَجِّ وَ سَاقَ مِائَةَ بَدَنَةٍ وَ أَحْرَمَ النَّاسُ كُلُّهُمْ بِالْحَجِّ لَا يَنْوُونَ عُمْرَةً وَ لَا يَدْرُونَ مَا الْمُتْعَةُ حَتَّى إِذَا قَدِمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَكَّةَ طَافَ بِالْبَيْتِ وَ طَافَ النَّاسُ مَعَهُ",
          "ثُمَّ صَلَّى رَكْعَتَيْنِ عِنْدَ الْمَقَامِ وَ اسْتَلَمَ الْحَجَرَ ثُمَّ قَالَ أَبْدَأُ بِمَا بَدَأَ اللَّهُ عَزَّ وَ جَلَّ بِهِ فَأَتَى الصَّفَا فَبَدَأَ بِهَا ثُمَّ طَافَ بَيْنَ الصَّفَا وَ الْمَرْوَةِ سَبْعاً فَلَمَّا قَضَى طَوَافَهُ عِنْدَ الْمَرْوَةِ قَامَ خَطِيباً",
          "فَأَمَرَهُمْ أَنْ يُحِلُّوا وَ يَجْعَلُوهَا عُمْرَةً وَ هُوَ شَيْ‏ءٌ أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهِ فَأَحَلَّ النَّاسُ وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَوْ كُنْتُ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَفَعَلْتُ كَمَا أَمَرْتُكُمْ وَ لَمْ يَكُنْ يَسْتَطِيعُ أَنْ يُحِلَّ مِنْ أَجْلِ الْهَدْيِ الَّذِي كَانَ مَعَهُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ لا تَحْلِقُوا رُؤُسَكُمْ حَتَّى يَبْلُغَ الْهَدْيُ مَحِلَّهُ",
          "فَقَالَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ الْكِنَانِيُّ يَا رَسُولَ اللَّهِ عُلِّمْنَا كَأَنَّا خُلِقْنَا الْيَوْمَ أَ رَأَيْتَ هَذَا الَّذِي أَمَرْتَنَا بِهِ لِعَامِنَا هَذَا أَوْ لِكُلِّ عَامٍ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا بَلْ لِلْأَبَدِ الْأَبَدِ وَ إِنَّ رَجُلًا قَامَ فَقَالَ يَا رَسُولَ اللَّهِ نَخْرُجُ حُجَّاجاً وَ رُءُوسُنَا تَقْطُرُ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّكَ لَنْ تُؤْمِنَ بِهَذَا أَبَداً",
          "قَالَ وَ أَقْبَلَ عَلِيٌّ ( عليه السلام ) مِنَ الْيَمَنِ حَتَّى وَافَى الْحَجَّ فَوَجَدَ فَاطِمَةَ سَلَامُ اللَّهِ عَلَيْهَا قَدْ أَحَلَّتْ وَ وَجَدَ رِيحَ الطِّيبِ فَانْطَلَقَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مُسْتَفْتِياً فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا عَلِيُّ بِأَيِّ شَيْ‏ءٍ أَهْلَلْتَ فَقَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ النَّبِيُّ ( صلى الله عليه وآله ) فَقَالَ لَا تُحِلَّ أَنْتَ فَأَشْرَكَهُ فِي الْهَدْيِ وَ جَعَلَ لَهُ سَبْعاً وَ ثَلَاثِينَ وَ نَحَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثَلَاثاً وَ سِتِّينَ فَنَحَرَهَا بِيَدِهِ",
          "ثُمَّ أَخَذَ مِنْ كُلِّ بَدَنَةٍ بَضْعَةً فَجَعَلَهَا فِي قِدْرٍ وَاحِدٍ ثُمَّ أَمَرَ بِهِ فَطُبِخَ فَأَكَلَ مِنْهُ وَ حَسَا مِنَ الْمَرَقِ وَ قَالَ قَدْ أَكَلْنَا مِنْهَا الْآنَ جَمِيعاً وَ الْمُتْعَةُ خَيْرٌ مِنَ الْقَارِنِ السَّائِقِ وَ خَيْرٌ مِنَ الْحَاجِّ الْمُفْرِدِ ",
          "قَالَ وَ سَأَلْتُهُ أَ لَيْلًا أَحْرَمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَمْ نَهَاراً فَقَالَ نَهَاراً قُلْتُ أَيَّةَ سَاعَةٍ قَالَ صَلَاةَ الظُّهْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup>, when he<sup>saww</sup> performed Hajj, the Hajj of Al-Islam, went out during where there remained four days from Zil-Qadah until he<sup>saww</sup> came over to Al-Shajara. So he<sup>saww</sup> Prayed by it, then sat upon his<sup>saww</sup> ride until he<sup>saww</sup> came to Al-Bayda. So he<sup>saww</sup> wore the Ihram from it, and commenced with the Hajj, and ushered one hundred camels. And the people, all of them, wore their Ihrams with the Hajj, not intending an Umra, nor knowing what the Mut’a (of Hajj) was, until when Rasool-Allah<sup>saww</sup> set foot in Makkah, he<sup>saww</sup> circumambulated by the House, then the people circumambulated along with him<sup>saww</sup>. ",
            "Then he<sup>saww</sup> Prayed two Cycles by the Standing Place (of Ibrahim<sup>as</sup>, and kissed the (Black) Stone, then said: ‘Begin with what Allah<sup>azwj</sup> Mighty and Majestic Began with’. So he<sup>saww</sup> came over to Al-Saffa and began with it. Then he<sup>saww</sup> circumambulated between Al-Safa and Al-Marwa, seven (times). So when he<sup>saww</sup> had completed his<sup>saww</sup> circumambulations at Al-Marwa, he<sup>saww</sup> stood preaching. ",
            "So he<sup>saww</sup> ordered them that they should free (themselves from the Ihram), and make it to be an Umra, and it is something which Allah<sup>azwj</sup> Mighty and Majestic had Commanded with. So the people freed (themselves from the Ihram), and Rasool-Allah<sup>saww</sup> said: ‘Had I<sup>saww</sup> faced from my<sup>saww</sup> matters what I<sup>saww</sup> managed, I<sup>saww</sup> would have done the like of what I<sup>saww</sup> am ordering you all for’, and he<sup>saww</sup> did not have the leeway that he<sup>saww</sup> frees (from his<sup>saww</sup> Ihram) due to the reason of the sacrificial animal which were with him<sup>azwj</sup>. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h196\">[2:196]</a> and do not shave your heads until the offering reaches its destination</span>.",
            "So, Suraqat Bin Malik Bin Ju’sham said, ‘O Rasool-Allah<sup>saww</sup>! Teach us as if we were Created today. What is your<sup>saww</sup> view of this which you<sup>saww</sup> are ordering us with. Is it for this year of ours, or for every year?’ So Rasool-Allah<sup>saww</sup> said: ‘No, but it is for ever and ever’. And a man stood up, so he said, ‘O Rasool-Allah<sup>saww</sup>! We came out as Pilgrims and our heads are dripping’. So Rasool-Allah<sup>saww</sup> said: ‘You will never believe in this, ever!’ ",
            "He<sup>asws</sup> said: ‘And Ali<sup>asws</sup> came back from Al-Yemen until fulfilled the Hajj. So he<sup>asws</sup> found Syeda Fatima<sup>asws</sup> having had freed (from wearing the Ihram), and found aromatic fragrance. So he<sup>asws</sup> went to Rasool-Allah<sup>saww</sup> to follow up. So Rasool-Allah<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! With which thing have you<sup>asws</sup> welcomed (the Hajj)?’ So he<sup>asws</sup> said: ‘I<sup>asws</sup> welcomed with the welcoming of the Prophet<sup>saww</sup>’. So he<sup>saww</sup> said: ‘Do not free (from the Ihram), for you<sup>asws</sup> are a participant in the sacrifice’, and he<sup>saww</sup> made thirty-seven to be for him<sup>asws</sup>, and Rasool-Allah<sup>saww</sup> sacrificed sixty-three, which he<sup>saww</sup> sacrificed with his<sup>saww</sup> own hands.",
            "Then he<sup>saww</sup> grabbed a piece from each camel to be in one pot. Then he<sup>saww</sup> ordered with it, so it was cooked. So he<sup>saww</sup> ate from it and sipped from the soup, and said: ‘We<sup>saww</sup> have eaten from it now together, and the Mut’a (of the Hajj) is better than pairing the usherer, and better than the individual Hajj’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup>, ‘Did Rasool-Allah<sup>saww</sup> wear the Ihram at night or at daytime?’ So he<sup>asws</sup> said: ‘Daytime’. I said, ‘Which time?’ He<sup>asws</sup> said: ‘Al-Zohr Prayer’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Yahya from Ahmad ibn Muhammad all from ibn abu ‘Umayr from Hammad al-Halabiy who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that when the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed al- Hajjata al-Islam, he left al-Madinah when only four days from the month of Dhu al-Qa‘dah remained. When he (the Messenger of Allah) arrived at al-Shajarah, he performed Salat (prayer) then drove his stumper until he arrived in al-Bayda’, he then assumed the state of Ihram and recited Talbiyah for al- Hajj. He (the Messenger of Allah) drove one hundred camels and all the people also assumed the state of Ihram for al-Hajj. They did not have the intention for al-‘Umrah and did not know what al-Mut‘ah was. When the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, arrived in Makkah he performed Tawaf around the House. People also performed Tawaf along with him. He (the Messenger of Allah) then performed two Rak‘at Salat (prayer) near the station of Ibrahim, ‘Alayhi al-Salam, then touched the Black Stone. He (the Messenger of Allah) then said, T commence with what Allah, most Majestic, most Glorious, has commenced. He then went to al-Safa’ to commence walking. He (the Messenger of Allah) then performed Tawaf between al-Safa’ and al-Marwah seven times. When he (the Messenger of Allah) completed his Tawaf at al-Marwah, he (the Messenger of Allah) then stood there for a speech. He (the Messenger of Allah) commanded them to come out of the state of Ihram and make it an al-‘Umrah. It is something that Allah, most Majestic, most Glorious, has commanded to do. People came out of the state of Ihram and the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, Tf I will have a chance in future I will not go back. I will do as I have commanded you to do. He (the Messenger of Allah) was not able to come out of the state of Ihram because of the offering animals, which were with him (the Messenger of Allah). Allah, most Majestic, most Glorious, says, ‘Do not shave your heads until the offering animals reach their designated places.’ Suraqah ibn Malik ibn Jush‘am al-Kinaniy said, ‘O Messenger of Allah, teach us just as we are created today. What you have commanded us to do this year is it just for this year or it will be as such every year?’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, ‘It is forever.’ A man stood up and said, ‘O Messenger of Allah is it that we will come to perform al-Hajj and water will drip from our heads?’ (He thereby meant engagement in sexual activities). The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, ‘You will never believe in it (al-Mut‘ah of al-Hajj). He (the Imam) said that Ali ‘Alayhi al-Salam, arrived from Yeman to perform al-Hajj, he found Fatimah, ‘Alayha al-Salam, who had come out of the state of Ihram, and he sensed perfumes. He (the Imam) went to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, for a fatwa. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, asked, ‘What kind of intention did you have?’ He (the Imam) replied, ‘I made my intention like the intention of the Holy prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause.’ He (the Messenger of Allah) said, ‘You must not come out of the state of Hiram.’ He (the Messenger of Allah) allowed him (the Imam) to share his offering animals and gave him (the Imam) thirty-seven. The Messenger of Allah slaughtered sixty- three. He (the Messenger of Allah) slaughtered them with his own hands. He (the Messenger of Allah) then from every camel took a certain amount of meat and placed it in one cooking pot. He then commanded to cook, then ate from the meat and sipped from the broth. He (the Messenger of Allah) then said, ‘Now we all have used the meat of our offering for food. Having al-Mut‘ah (advantage of coming out of the state of Ihram after completing the acts of ‘Umrah) is better than al-Qiran Hajj, in which one herds his offering cattle as well as performs Hajj in the form of al-Mufrad Hajj.’ I (the narrator) then asked, ‘Did the Messenger of Allah enter the state of Ihram during the night or during the day?’ He (the Imam) replied, ‘It was during the day.’ I then asked, ‘In which hour of the day was it?’ He (the Imam) replied it was at the time of the Salat (prayer) at noontime.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/117)"
        ],
        "index": 6817,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ذَكَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْحَجَّ فَكَتَبَ إِلَى مَنْ بَلَغَهُ كِتَابُهُ مِمَّنْ دَخَلَ فِي الْإِسْلَامِ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يُرِيدُ الْحَجَّ يُؤْذِنُهُمْ بِذَلِكَ لِيَحُجَّ مَنْ أَطَاقَ الْحَجَّ فَأَقْبَلَ النَّاسُ فَلَمَّا نَزَلَ الشَّجَرَةَ أَمَرَ النَّاسَ بِنَتْفِ الْإِبْطِ وَ حَلْقِ الْعَانَةِ وَ الْغُسْلِ وَ التَّجَرُّدِ فِي إِزَارٍ وَ رِدَاءٍ أَوْ إِزَارٍ وَ عِمَامَةٍ يَضَعُهَا عَلَى عَاتِقِهِ لِمَنْ لَمْ يَكُنْ لَهُ رِدَاءٌ ",
          "وَ ذَكَرَ أَنَّهُ حَيْثُ لَبَّى قَالَ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَ النِّعْمَةَ لَكَ وَ الْمُلْكَ لَا شَرِيكَ لَكَ وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُكْثِرُ مِنْ ذِي الْمَعَارِجِ وَ كَانَ يُلَبِّي كُلَّمَا لَقِيَ رَاكِباً أَوْ عَلَا أَكَمَةً أَوْ هَبَطَ وَادِياً وَ مِنْ آخِرِ اللَّيْلِ وَ فِي أَدْبَارِ الصَّلَوَاتِ",
          "فَلَمَّا دَخَلَ مَكَّةَ دَخَلَ مِنْ أَعْلَاهَا مِنَ الْعَقَبَةِ وَ خَرَجَ حِينَ خَرَجَ مِنْ ذِي طُوًى فَلَمَّا انْتَهَى إِلَى بَابِ الْمَسْجِدِ اسْتَقْبَلَ الْكَعْبَةَ وَ ذَكَرَ ابْنُ سِنَانٍ أَنَّهُ بَابُ بَنِي شَيْبَةَ ",
          "فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ صَلَّى عَلَى أَبِيهِ إِبْرَاهِيمَ ثُمَّ أَتَى الْحَجَرَ فَاسْتَلَمَهُ فَلَمَّا طَافَ بِالْبَيْتِ صَلَّى رَكْعَتَيْنِ خَلْفَ مَقَامِ إِبْرَاهِيمَ ( عليه السلام ) وَ دَخَلَ زَمْزَمَ فَشَرِبَ مِنْهَا ثُمَّ قَالَ اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَ رِزْقاً وَاسِعاً وَ شِفَاءً مِنْ كُلِّ دَاءٍ وَ سُقْمٍ ",
          "فَجَعَلَ يَقُولُ ذَلِكَ وَ هُوَ مُسْتَقْبِلُ الْكَعْبَةِ ثُمَّ قَالَ لِأَصْحَابِهِ لِيَكُنْ آخِرُ عَهْدِكُمْ بِالْكَعْبَةِ اسْتِلَامَ الْحَجَرِ فَاسْتَلَمَهُ ثُمَّ خَرَجَ إِلَى الصَّفَا ثُمَّ قَالَ أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ ثُمَّ صَعِدَ عَلَى الصَّفَا فَقَامَ عَلَيْهِ مِقْدَارَ مَا يَقْرَأُ الْإِنْسَانُ سُورَةَ الْبَقَرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Naar Bin Suweyd, from Abdullah Bin Sinan who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The Hajj was mentioned to Rasool-Allah<sup>saww</sup>, so he<sup>saww</sup> to the ones to whom his<sup>saww</sup> letter reached, from the ones who had entered into Al-Islam, that Rasool-Allah<sup>saww</sup> intended the Hajj, proclaiming with that, the one who can bear the Hajj should perform the Hajj. So the people came over. So when he<sup>saww</sup> encamped at Al-Shajara, he<sup>saww</sup> ordered the people with the plucking of the armpit (hairs), and shaving the pubic (hair), and the bathing, and the stripping off their trousers and wearing of a cloak, or a loin cloth and a turban, placing it upon his shoulders for the one who does not happen to have a cloak for him. ",
            "And he<sup>asws</sup> mentioned that when he<sup>saww</sup> exclaimed Talbiyya, said, ‘Here I<sup>saww</sup> am O Allah<sup>azwj</sup>! Here I<sup>saww</sup> am! Here I<sup>saww</sup> am! There is no associate for You<sup>azwj</sup>! Here I<sup>saww</sup> am! The Praise, and the Bounties are for You<sup>azwj</sup>, and the Kingdom! There is no associate for You<sup>azwj</sup>!’ And Rasool-Allah<sup>saww</sup> would frequent in saying: ‘O the One with the Loftiness!’ And he<sup>saww</sup> would exclaim Talbiyya every time he<sup>saww</sup> met a rider, or ascend a high ground or go down a valley, and at the end of the night, and after the Prayers. ",
            "So when he<sup>saww</sup> entered Makkah, he<sup>saww</sup> entered from its high ground, from Al-Aqaba, and when he<sup>saww</sup> went out, went from Zi-Tuwwa (a low ground). So when he<sup>saww</sup> ended up to the door of the (Sacred) Masjid, faced the Kabah’. And Ibn Sinan (the narrator) mentioned that it is (now where) the door of the Clan of Shayba is.",
            "So he<sup>saww</sup> Praised Allah<sup>azwj</sup> and Extolled upon Him<sup>azwj</sup>, and sent Blessings upon his<sup>saww</sup> father<sup>as</sup> Ibrahim<sup>as</sup>. Then he<sup>saww</sup> went over to the (Black) Stone. So when he<sup>saww</sup> circumambulated with the House (Kabah), Prayed two Cycles behind the Standing Place of Ibrahim<sup>as</sup>. And he<sup>azwj</sup> entered Zamzam, so he<sup>saww</sup> drank from it, then said: ‘O Allah<sup>azwj</sup>! I<sup>saww</sup> ask You<sup>azwj</sup> for beneficial knowledge, and extensive sustenance, and a healing from every disease and sickness’. ",
            "So he<sup>saww</sup> went on saying that, and he<sup>saww</sup> was facing the Kabah. Then he<sup>saww</sup> said to his<sup>saww</sup> companions: ‘Let the last of your promised with the Kabah be the submission to the Black) Stone, therefore submit to it’. Then he<sup>saww</sup> went out to Al-Safa, then said: ‘I<sup>saww</sup> begin with what Allah<sup>azwj</sup> Began with’. Then he<sup>saww</sup> ascended upon Al-Safa. So he<sup>saww</sup> stayed upon it of a measurement of what it takes the human being to recite Surah Al-Baqarah’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, mentioned al- Hajj. He (the Messenger of Allah) then wrote a letter to those who received his letter and who had accepted Islam that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has decided to perform al-Hajj. He (the Messenger of Allah) has given permission to all those who are capable to perform al-Hajj to do so. People came. When they arrived at al-Shajarah, he (the Messenger of Allah) commanded them to clean their under- arms, pubic hairs, and take a shower; that they must wear just a loincloth, a sheet of cloth on their shoulders and a turban to place it on their shoulder if one did not have the sheet of cloth to place on his shoulders. He (the Imam) has mentioned that when he (the Messenger of Allah) said Talbiyah he (the Messenger of Allah) said, ‘O Lord, here I am to obey your command, here I am, O Lord, to obey Your command. Indeed You have no partners, here I am to obey Your command, all praise, all bounties and the whole kingdom belong to You, You indeed have no partners.’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would say ‘O the owner of exalted status’ a great deal. He (the Messenger of Allah) said Talbiyah when coming across a rider, climb a height, climb down a hill or a valley, toward the end of the night and after Salat (prayer). When he (the Messenger of Allah) entered Makkah, he (the Messenger of Allah) did so from the upper part of Makkah, from al-‘Aqabah and left when he left through Dhi Tuwa’. When he (the Messenger of Allah) arrived at the door of the Masjid, he (the Messenger of Allah) faced al-Ka’bah.’ Ibn Sinan has mentioned that it was the gate of banu Shaybah. He (the Messenger of Allah) praised Allah, spoke of His glory, prayed for Ibrahim and then he (the Messenger of Allah) moved to the Black Stone and touched it. When he performed Tawaf around the House he (the Messenger of Allah) then performed two Rak‘at Salat (prayer) behind the station of Ibrahim ‘Alayhi al-Salam. He (the Messenger of Allah) entered Zamzam, drank thereof and said, ‘O Allah, I appeal before You for useful knowledge, extended means of living and cure for all illnesses.’ He would say this with his face toward al-Ka‘bah. He (the Messenger of Allah) said to his companions that your last meeting with al-Ka’bah should be touching the Black Stone. He (the Messenger of Allah) touched the Black Stone; then moved to al-Safa’ then said, ‘I begin with what Allah has begun’, then he (the Messenger of Allah) climbed al-Safa’, stood there for a time within which one can recite Chapter two of al-Quran.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/118)"
        ],
        "index": 6818,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:8",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ نَحَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِيَدِهِ ثَلَاثاً وَ سِتِّينَ وَ نَحَرَ عَلِيٌّ ( عليه السلام ) مَا غَبَرَ قُلْتُ سَبْعَةً وَ ثَلَاثِينَ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa, from Hammad Bin Usman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> sacrificed thirty-six (camels) with his<sup>saww</sup> own hands and Ali<sup>asws</sup> sacrificed what remained’. I said, ‘Thirty-seven?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "8. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Washsha’ from Hammad ibn ‘Uthaman who has said the following: “I heard abu ‘ Abd Allah, ‘Alayhi al-Salam, say, ‘The messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, slaughtered sixty-three heads of cattle with his own hand; and Ali, ‘Alayhi al-Salam, slaughtered the rest.’ I then asked, ‘Was it thirty- seven ?’ He (the Imam) replied, ‘Yes. It was thirty-seven.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/118)"
        ],
        "index": 6819,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الَّذِي كَانَ عَلَى بُدْنِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) نَاجِيَةُ بْنُ جُنْدَبٍ الْخُزَاعِيُّ الْأَسْلَمِيُّ وَ الَّذِي حَلَقَ رَأْسَ النَّبِيِّ ( صلى الله عليه وآله ) فِي حَجَّتِهِ مَعْمَرُ بْنُ عَبْدِ اللَّهِ بْنِ حَرَاثَةَ بْنِ نَصْرِ بْنِ عَوْفِ بْنِ عَوِيجِ بْنِ عَدِيِّ بْنِ كَعْبٍ",
          "قَالَ وَ لَمَّا كَانَ فِي حَجَّةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ يَحْلِقُهُ قَالَتْ قُرَيْشٌ أَيْ مَعْمَرُ أُذُنُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي يَدِكَ وَ فِي يَدِكَ الْمُوسَى فَقَالَ مَعْمَرٌ وَ اللَّهِ إِنِّي لَأَعُدُّهُ مِنَ اللَّهِ فَضْلًا عَظِيماً عَلَيَّ",
          "قَالَ وَ كَانَ مَعْمَرٌ هُوَ الَّذِي يَرْحَلُ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ رَسُولُ اللَّهِ يَا مَعْمَرُ إِنَّ الرَّحْلَ اللَّيْلَةَ لَمُسْتَرْخًى فَقَالَ مَعْمَرٌ بِأَبِي أَنْتَ وَ أُمِّي لَقَدْ شَدَدْتُهُ كَمَا كُنْتُ أَشُدُّهُ وَ لَكِنْ بَعْضُ مَنْ حَسَدَنِي مَكَانِي مِنْكَ يَا رَسُولَ اللَّهِ أَرَادَ أَنْ تَسْتَبْدِلَ بِي فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا كُنْتُ لِأَفْعَلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who was in charge upon the camels of Rasool-Allah<sup>saww</sup> was Najiya Bin Jundub Al-Khuzai’e Al-Aslamy, and the one who shaved the head of the Prophet<sup>saww</sup> during his<sup>saww</sup> Hajj was Mo’mar Bin Abdullah Bin Harasat Bin Nasr Bin Awf Bin Aweyj Bin Adayy Bin Ka’ab.",
            "He<sup>asws</sup> said: ‘And when it was the Hajj of Rasool-Allah<sup>saww</sup> and he was shaving him<sup>saww</sup>, the Qureysh said, ‘Mo’mar! The ear of Rasool-Allah<sup>saww</sup> is in your hands, and in your hand is the razor’. So Mo’mar said, ‘By Allah<sup>azwj</sup>! I count is as a great favour from Allah<sup>azwj</sup> upon me’. ",
            "He<sup>asws</sup> said: ‘And Mo’mar was the one who used to prepare the ride for Rasool-Allah<sup>saww</sup>. So Rasool-Allah<sup>saww</sup> said: ‘O Mo’mar! The ride tonight is loose’. So Mo’mar said, ‘By my father and my mother! I had tightened it just as I used to tighten it, but some of the ones who envy me for my place from you<sup>saww</sup>, O Rasool-Allah<sup>saww</sup>, intending that you<sup>saww</sup> would replace me’. So Rasool-Allah<sup>saww</sup> said: ‘I<sup>saww</sup> would have not done it’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the person in charge of herding the camel for offering by the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, was Najiyah ibn Jundab al-Khuza‘iy al-Aslamiy. The person who shaved the head of the Holy Prophet during his Hajj was Mu‘amar ibn ‘Abd Allah ibn Harithah ibn Nasr ibn ‘Awf ibn ‘Awiyj ibn ‘Adiy ibn Ka’b. He (the Imam) said, ‘During the Hajj of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, as he shaved his head, Quraysh said to him, ‘O Mu’ammar, the ear of the Messenger of Allah is in your hand. Also in your hand is the shaving knife . 5 Mu’ammar then said, ‘I by Allah consider it a great favor on me . 5 He (the Imam) said, ‘Mu’ammar was he who would prepare the saddle on the camel for the Messenger of Allah. The Messenger of Allah asked him, ‘O Mu’ammar, how is it that the saddle is prepared loose tonight ? 5 He replied, ‘I pray to Allah to keep my soul in service for your cause, I had prepared it tight as usually I do, but certain ones jealous of my nearness to you wanted to replace me . 5 The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, ‘I would not have allowed it to happen . ‘“ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/119)"
        ],
        "index": 6820,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اعْتَمَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثَلَاثَ عُمَرٍ مُفْتَرِقَاتٍ عُمْرَةً فِي ذِي الْقَعْدَةِ أَهَلَّ مِنْ عُسْفَانَ وَ هِيَ عُمْرَةُ الْحُدَيْبِيَةِ وَ عُمْرَةً أَهَلَّ مِنَ الْجُحْفَةِ وَ هِيَ عُمْرَةُ الْقَضَاءِ وَ عُمْرَةً أَهَلَّ مِنَ الْجِعْرَانَةِ بَعْدَ مَا رَجَعَ مِنَ الطَّائِفِ مِنْ غَزْوَةِ حُنَيْنٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> performed Umra with three individual Umras – an Umra during Zil-Qadah, commencing from Usfan, and it is an Umra of Al-Hudaybiyya; and an Umra commencing from Al-Juhfa, and it is an Umra of the compliance (Qaza); and an Umra commencing from Al-Ji’rana after having returned from Al-Ta’if from the military expedition of Hunayn’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan all from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed three ‘Umrah separately. He performed one ‘Umrah in Dhu al-Qa 5 dah, in which he said Talbiyah (here I am O Lord, to obey Your command) in ‘Usfan (name of a place) and that was ‘Umrah al-Hudaybiyah. He performed one ‘Umrah, in which he said Talbiyah (here I am O Lord, to obey Your command) in al- Juhfah and it, was ‘Umrah of al-Qada 5 . He performed one ‘Umrah, for which he said Talbiyah (here I am O Lord, to obey Your command) in al-Ja‘ranah after his return from al-Ta 5 if from the battle of Hunayn.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/120)"
        ],
        "index": 6821,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:11",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَ حَجَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) غَيْرَ حَجَّةِ الْوَدَاعِ قَالَ نَعَمْ عِشْرِينَ حَجَّةً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Abu Najran, from Al A’ala Bin Razeyn, from Umar Bin Yazeed who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Did Rasool-Allah<sup>saww</sup> perform a Hajj other than the Farewell Hajj?’ He<sup>asws</sup> said: ‘Yes, twenty Hajjs’ (in concealment as per the below Hadith)."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Sahl ibn Ziyad from ibn abu Najran from al-‘Ala’ ibn Razin from ‘Umar ibn Yazid who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Did the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, perform any other Hajj besides the farewell Hajj ? 5 He replied, ‘Yes, he did so twenty times . ‘“ "
          ]
        }
      },
      {
        "index": 6822,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:12",
        "text": [
          "سَهْلٌ عَنِ ابْنِ فَضَّالٍ عَنْ عِيسَى الْفَرَّاءِ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ حَجَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عِشْرِينَ حَجَّةً."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl, from Ibn Fazzal, from Isa Al Fara’a, from Ibn Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> performed twenty Hajjs in concealment’."
          ],
          "en.sarwar": [
            "12. Sahl ibn Ziyad has narrated from ibn Faddal from ‘Isa al-Farra’ from ibn abu Ya’fur who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, 0 Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed twenty Hajj secretly, every time he would pass by the Mazimin and disembark and pass water.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/120)"
        ],
        "index": 6823,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:13",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ جَعْفَرِ بْنِ سَمَاعَةَ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ جَمِيعاً عَنْ أَبَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اعْتَمَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عُمْرَةَ الْحُدَيْبِيَةِ وَ قَضَى الْحُدَيْبِيَةَ مِنْ قَابِلٍ وَ مِنَ الْجِعْرَانَةِ حِينَ أَقْبَلَ مِنَ الطَّائِفِ ثَلَاثَ عُمَرٍ كُلُّهُنَّ فِي ذِي الْقَعْدَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Ja’far Bin Sama’at, and Muhammad Bin Yahya, from Abdullah Bin Muhammad, from Ali Bin Al Hakam, from Aban, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> performed Umras – Umra of Al-Hudaybiyya, and a Qaza of Al-Hudaybiyya from returning, and from Al-Ji’rana when he came back from Al-Ta’if – three Umras, all of these being in Zil-Qadah’."
          ],
          "en.sarwar": [
            "13. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from Ja’far ibn Sama‘ah and Muhammad ibn Yahya from ‘Abd Allah ibn Muhammad from Ali ibn al-Hakam all from Aban who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed ‘Umrah of al-Hudaybiyah and Qada’ of al-Hudaybiyah next time, and from al-Ja‘ranah when coming from al-Ta’if. All three ‘Umrah took place in the month of Dhu al-Qa’dah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/121)"
        ],
        "index": 6824,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:27:14",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ ذُكِرَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) اعْتَمَرَ فِي ذِي الْقَعْدَةِ ثَلَاثَ عُمَرٍ كُلُّ ذَلِكَ يُوَافِقُ عُمْرَتُهُ ذَا الْقَعْدَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said mentioning that Rasool-Allah<sup>saww</sup> performed Umras during Zil-Qadah – three Umras. All of that was in accordance with his<sup>saww</sup> Umra of Zil-Qadah’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed three ‘Umrah in the month of Dhu al-Qa’dah; all of them coincided with his al-‘Umrah in the month of Dhu al-Qa’dah.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:27",
  "kind": "verse_list"
}