{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:4:3:28",
        "titles": {
          "ar": "بَابُ فَضْلِ الْحَجِّ وَ الْعُمْرَةِ وَ ثَوَابِهِمَا",
          "en": "Chapter 28 – Merits of the Hajj and the Umra, and their Rewards"
        }
      }
    ],
    "index": 971,
    "local_index": 28,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:4:3:29",
        "titles": {
          "ar": "بَابُ فَرْضِ الْحَجِّ وَ الْعُمْرَةِ",
          "en": "Chapter 29 – Obligation of (performing) the Hajj and the Umra"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:4:3:27",
        "titles": {
          "ar": "بَابُ حَجِّ النَّبِيِّ ( صلى الله عليه وآله )",
          "en": "Chapter 27 – Hajj of the Prophet<sup>saww</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:28",
    "titles": {
      "ar": "بَابُ فَضْلِ الْحَجِّ وَ الْعُمْرَةِ وَ ثَوَابِهِمَا",
      "en": "Chapter 28 – Merits of the Hajj and the Umra, and their Rewards"
    },
    "verse_count": 47,
    "verse_start_index": 6824,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/121)"
        ],
        "index": 6825,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ الْخَزَّازِ عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ عَنْ خَالِدٍ الْقَلَانِسِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) حُجُّوا وَ اعْتَمِرُوا تَصِحَّ أَبْدَانُكُمْ وَ تَتَّسِعْ أَرْزَاقُكُمْ وَ تُكْفَوْنَ مَئُونَاتِ عِيَالِكُمْ ",
          "وَ قَالَ الْحَاجُّ مَغْفُورٌ لَهُ وَ مَوْجُوبٌ لَهُ الْجَنَّةُ وَ مُسْتَأْنَفٌ لَهُ الْعَمَلُ وَ مَحْفُوظٌ فِي أَهْلِهِ وَ مَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Amro Bin Usman Al Hazaz, from Ali Bin Abdullah Al Bajaly, from Khalid Al Qalanasy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘Perform Hajj and perform Umra, it would correct your bodies, and expand your livelihoods, and there would happen to be provisions for your dependents’. ",
            "And he<sup>asws</sup> said: ‘The Pilgrim is Forgiven for, and the Paradise is Obligated for him, and the deeds are resumed for him, and there would be safety regarding his family and his wealth’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ‘Amr ibn ‘ Uthman af-Khazzaz from Afi ibn ‘ Abd Allah al-Bajaliy, from Khalid al- Qalanisiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ali ibn Al-Husayn, ‘Alayhi al-Salam, has said, ‘Perform ‘Umrah and Hajj, your bodies will become healthy, your sustenance increase and you will have sufficient for the expenses of your families.’ He (the Imam) said, ‘One who performs Hajj is forgiven, paradise is necessary, he resumes his deeds and he is safe and sound as well as his family and properties.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالحسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/121)"
        ],
        "index": 6826,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:2",
        "relations": {
          "Mentions": [
            "/books/quran:2:199",
            "/books/quran:2:203"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ عَبْدِ الْأَعْلَى قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ أَبِي يَقُولُ مَنْ أَمَّ هَذَا الْبَيْتَ حَاجّاً أَوْ مُعْتَمِراً مُبَرَّأً مِنَ الْكِبْرِ رَجَعَ مِنْ ذُنُوبِهِ كَهَيْئَةِ يَوْمَ وَلَدَتْهُ أُمُّهُ ثُمَّ قَرَأَ فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلا إِثْمَ عَلَيْهِ وَ مَنْ تَأَخَّرَ فَلا إِثْمَ عَلَيْهِ لِمَنِ اتَّقى ",
          "قُلْتُ مَا الْكِبْرُ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ أَعْظَمَ الْكِبْرِ غَمْصُ الْخَلْقِ وَ سَفَهُ الْحَقِّ قُلْتُ مَا غَمْصُ الْخَلْقِ وَ سَفَهُ الْحَقِّ قَالَ يَجْهَلُ الْحَقَّ وَ يَطْعُنُ عَلَى أَهْلِهِ وَ مَنْ فَعَلَ ذَلِكَ نَازَعَ اللَّهَ رِدَاءَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali in Al Hakam, from Sayf Bin Ameyra, from Abdul A’ala who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> was saying: ‘The one who travels to this House (Kabah) as a pilgrim, or performs Umra free from arrogance, would return from his sins to as he was on the day his mother gave him birth’. Then he<sup>asws</sup> recited <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h203\">[2:203]</a> then whoever hastens off in two days, there is no sin on him, and whoever remains behind, there is no sin on him, (this is) the one who fears</span>’.",
            "I said, ‘What is the arrogance?’ He<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘The greatest of all arrogant ones are the most contemptible of the people and the most foolish of the people’. I said, ‘Who are the most contemptible of the people and the most foolish of the people?’ He<sup>asws</sup> said: ‘The one who is ignorant of the Truth, and he slanders against his family; and the one who does that, would have disputed with Allah<sup>azwj</sup> with his cloak’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Sayf ibn ‘Amirah from ‘Abd al-‘ Ala’ who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘My father would say, “One who decides to perform Hajj or ‘Umrah free of al-Kibr (arrogance) returns, in matters of sins, as the day his mother gave birth to him.’” He (the Imam) then read this, ‘On one who hastens during the two days, there is no sin, and on one who delays, there is no sin.’ <a href=\"/#/books/quran:2#h199\">[2:199]</a> I (the narrator) then asked, ‘What is al-Kibr?’ He (the Imam) replied, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “The greatest al-Kibr is ghamd and Safah of the creatures.’” I then asked, ‘What is ghamd and safah of creatures?’ He (the Imam) replied, ‘It is ignoring the truth, and falsifying the people of truth. Whoever does this has quarreled with Allah about His gown.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/122)"
        ],
        "index": 6827,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ ضَمَانُ الْحَاجِّ وَ الْمُعْتَمِرِ عَلَى اللَّهِ إِنْ أَبْقَاهُ بَلَّغَهُ أَهْلَهُ وَ إِنْ أَمَاتَهُ أَدْخَلَهُ الْجَنَّةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The guarantee of the Pilgrim of Hajj and the Pilgrim of Umra is upon Allah<sup>azwj</sup> that He<sup>azwj</sup> would Keep him alive and Make him reach back to his family. And if he was to die, Enter him into the Paradise’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Ali ibn abu Hamzah from abu Basir who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘Allah has undertaken the responsibility toward those who perform Hajj or ‘Umrah to join them with their families if He decides to keep them living, or admit them in paradise if He decides to cause them to die.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/123)"
        ],
        "index": 6828,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَنْ آبَائِهِ ( عليهم السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْحَجَّةُ ثَوَابُهَا الْجَنَّةُ وَ الْعُمْرَةُ كَفَّارَةٌ لِكُلِّ ذَنْبٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The Hajj, its Reward is the Paradise, and the Umra is an expiation of every sin’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father, from al-Nawfaliy from al-Sakuniy who has said the following from his ancestors: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘The reward for performing Hajj is paradise and ‘Umrah is expiation for all sins.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/123)"
        ],
        "index": 6829,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:5",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ يَحْيَى بْنِ عَمْرِو بْنِ كُلَيْعٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي قَدْ وَطَّنْتُ نَفْسِي عَلَى لُزُومِ الْحَجِّ كُلَّ عَامٍ بِنَفْسِي أَوْ بِرَجُلٍ مِنْ أَهْلِ بَيْتِي بِمَالِي فَقَالَ وَ قَدْ عَزَمْتَ عَلَى ذَلِكَ قَالَ قُلْتُ نَعَمْ قَالَ إِنْ فَعَلْتَ فَأَبْشِرْ بِكَثْرَةِ الْمَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Hammad Bin Isa, from Yahya Bin Amro Bin Kuuleyb, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I have settled myself upon necessitating the Hajj every year by myself or by a man from my family with my wealth’. So he<sup>asws</sup> said: ‘And you are determined upon that?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘If you were to do so, then receive glad tidings with the abundance of the wealth’."
          ],
          "en.sarwar": [
            "5. Ali has narrated from his father from Hammad ibn ‘Isa from Yahya ibn ‘Amr ibn Kulay‘ from Ishaq ibn ‘Ammar who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I have settled my soul upon performing Hajj every year by myself or along with a man from my family with my expenses. He (the Imam) asked, ‘Is the decision you have made a firm one?’ I replied, ‘Yes, it is a firm decision.’ He (the Imam) said, ‘If you have done so, I give you the glad news of enjoying a great wealth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/123)"
        ],
        "index": 6830,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:6",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْحُجَّاجُ يَصْدُرُونَ عَلَى ثَلَاثَةِ أَصْنَافٍ صِنْفٌ يُعْتَقُ مِنَ النَّارِ وَ صِنْفٌ يَخْرُجُ مِنْ ذُنُوبِهِ كَهَيْئَةِ يَوْمَ وَلَدَتْهُ أُمُّهُ وَ صِنْفٌ يُحْفَظُ فِي أَهْلِهِ وَ مَالِهِ فَذَاكَ أَدْنَى مَا يَرْجِعُ بِهِ الْحَاجُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The Pilgrims are arriving back being upon three types – a type who is emancipated (liberated) from the Fire, and a type who is exited from his sins as if he was like the day his mother gave him birth, and a type who received Protection regarding his family and his wealth. So that is the lowest of what the Pilgrim returns with’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Pilgrims (al-Hujjaj) are of three categories. Those in one group are set free from hellfire, the other group are made free of sins like their freedom from sin on the day their mother gave birth to them, and the third group consists of those who receive protection for their families and properties and this is the minimum benefit with which pilgrims return home.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/123)"
        ],
        "index": 6831,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:7",
        "relations": {
          "Mentions": [
            "/books/quran:16:7"
          ]
        },
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى الْكَاهِلِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَ يَذْكُرُ الْحَجَّ فَقَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) هُوَ أَحَدُ الْجِهَادَيْنِ هُوَ جِهَادُ الضُّعَفَاءِ وَ نَحْنُ الضُّعَفَاءُ أَمَا إِنَّهُ لَيْسَ شَيْ‏ءٌ أَفْضَلَ مِنَ الْحَجِّ إِلَّا الصَّلَاةُ وَ فِي الْحَجِّ لَهَاهُنَا صَلَاةٌ وَ لَيْسَ فِي الصَّلَاةِ قِبَلَكُمْ حَجٌّ لَا تَدَعِ الْحَجَّ وَ أَنْتَ تَقْدِرُ عَلَيْهِ ",
          "أَ مَا تَرَى أَنَّهُ يَشْعَثُ رَأْسُكَ وَ يَقْشَفُ فِيهِ جِلْدُكَ وَ يَمْتَنِعُ فِيهِ مِنَ النَّظَرِ إِلَى النِّسَاءِ وَ إِنَّا نَحْنُ لَهَاهُنَا وَ نَحْنُ قَرِيبٌ وَ لَنَا مِيَاهٌ مُتَّصِلَةٌ مَا نَبْلُغُ الْحَجَّ حَتَّى يَشُقَّ عَلَيْنَا فَكَيْفَ أَنْتُمْ فِي بُعْدِ الْبِلَادِ وَ مَا مِنْ مَلِكٍ وَ لَا سُوقَةٍ يَصِلُ إِلَى الْحَجِّ إِلَّا بِمَشَقَّةٍ فِي تَغْيِيرِ مَطْعَمٍ أَوْ مَشْرَبٍ أَوْ رِيحٍ أَوْ شَمْسٍ لَا يَسْتَطِيعُ رَدَّهَا وَ ذَلِكَ قَوْلُهُ عَزَّ وَ جَلَّ وَ تَحْمِلُ أَثْقالَكُمْ إِلى بَلَدٍ لَمْ تَكُونُوا بالِغِيهِ إِلَّا بِشِقِّ الْأَنْفُسِ إِنَّ رَبَّكُمْ لَرَؤُفٌ رَحِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from safwan Bin Yahya, from Abdullah Bin Yahya Al Kahily who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying, and the Hajj was mentioned, so he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘It is one of the two Jihads. It is the Jihad of the weak’, and we<sup>asws</sup> are the weak ones. But, there is nothing superior than the Hajj except for the Prayer. And in the Hajj there is Prayer over there, and there was no Prayer in Hajj before you. Do not leave the Hajj and you are able over it. ",
            "Do you not see that it dishevels your head and roughens your skin, and during it you are forbidden from looking at the women? And we<sup>asws</sup> are over here for it, and we<sup>asws</sup> are nearby, and for us<sup>asws</sup> is its continuous (supply of) its water, (even then) we<sup>asws</sup> do not reach the Hajj until it is difficult upon us<sup>asws</sup>. So how would you be in the remote cities. And there is none from a king, nor a common folk who arrives to the Hajj except with difficulties with regards to the alteration of the food, or drink, or weather, or sun (heat), not having the ability to repel it; and these are the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h7\">[16:7]</a> And they carry your heavy loads to regions which you could not reach but with distress of the souls; most surely your Lord is Kind, Merciful</span>’."
          ],
          "en.sarwar": [
            "7. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘ Abd al-Jabbar from Safwan ibn Yahya from ‘ Abd Allah ibn Yahya al-Kahiliy who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, speaking of Hajj, say, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “It (Hajj) is one of the two kinds of Jihad (striving for a cause). This is the Jihad for the weak ones and we are the weak ones. However, no other thing is better than Hajj except salat (prayer). In Hajj nowadays is salat (prayer) and there was no salat (prayer) in Hajj before you. Do not ignore Hajj when you are able to perform it. Consider how your hairs become dusty during performing Hajj and your skin rough and you abstain from looking at women. We are here and near. We have water but still arrive (in Makkah) for Hajj with a great deal of difficulty. The case of those who live far away from Makkah is much more difficult. All kings and subjects arrive (in Makkah) for Hajj after facing a great deal of difficulties, such as changes in their diet, water, air and sun, which they cannot avoid. This is in the words of Allah, the Most Majestic, the Most Glorious, ‘They carry your loads to a town that you could only do so with causing a great deal of hardships to souls. Your Lord is compassionate and kind.’” <a href=\"/#/books/quran:16#h7\">[16:7]</a> "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/124)"
        ],
        "index": 6832,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:8",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا يُحَالِفُ الْفَقْرُ وَ الْحُمَّى مُدْمِنَ الْحَجِّ وَ الْعُمْرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazan, from Hammad Bin Isa, from Rabi’e Bin Abdullah, from Al Fuzayl Bin Yasar who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> said: ‘The poverty and the fever does not come near the one habitual of the Hajj and the Umra’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Hammad ibn ‘Isa from Rib’iy ibn ‘Abd Allah from al-Fudayl ibn Yasar who has said the following: “I heard abu Ja‘far, ‘Alayhi al-Salam, say, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “Chronic poverty and fever cannot come with al-Hajj and al-‘Umrah.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/124)"
        ],
        "index": 6833,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ عَنْ سَعْدٍ الْإِسْكَافِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ الْحَاجَّ إِذَا أَخَذَ فِي جَهَازِهِ لَمْ يَخْطُ خُطْوَةً فِي شَيْ‏ءٍ مِنْ جَهَازِهِ إِلَّا كَتَبَ اللَّهُ عَزَّ وَ جَلَّ لَهُ عَشْرَ حَسَنَاتٍ وَ مَحَا عَنْهُ عَشْرَ سَيِّئَاتٍ وَ رَفَعَ لَهُ عَشْرَ دَرَجَاتٍ حَتَّى يَفْرُغَ مِنْ جَهَازِهِ مَتَى مَا فَرَغَ فَإِذَا اسْتَقْبَلَتْ بِهِ رَاحِلَتُهُ لَمْ تَضَعْ خُفّاً وَ لَمْ تَرْفَعْهُ إِلَّا كَتَبَ اللَّهُ عَزَّ وَ جَلَّ لَهُ مِثْلَ ذَلِكَ حَتَّى يَقْضِيَ نُسُكَهُ فَإِذَا قَضَى نُسُكَهُ غَفَرَ اللَّهُ لَهُ ذُنُوبَهُ",
          "وَ كَانَ ذَا الْحِجَّةِ وَ الْمُحَرَّمَ وَ صَفَرَ وَ شَهْرَ رَبِيعٍ الْأَوَّلِ أَرْبَعَةَ أَشْهُرٍ تُكْتَبُ لَهُ الْحَسَنَاتُ وَ لَا تُكْتَبُ عَلَيْهِ السَّيِّئَاتُ إِلَّا أَنْ يَأْتِيَ بِمُوجِبَةٍ فَإِذَا مَضَتِ الْأَرْبَعَةُ الْأَشْهُرِ خُلِطَ بِالنَّاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abu Ayoub, from Sa’ad Al Askaf who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘When the pilgrim begins his preparation, he does not take a step with regards to something from his preparations, except that Allah<sup>azwj</sup> Mighty and Majestic Writes ten good deeds for him, and Deletes ten sin from him, and Raises ten Levels for him, until he is free from his preparations. When he is free and he faces his ride with it, he does not place a shoe nor does he raise it, except that Allah<sup>azwj</sup> Mighty and Majestic Writes for him similar to that until he has completed his rituals. So when he has completed his rituals, Allah<sup>azwj</sup> Forgives his sins for him.",
            "And Zil-Hijja, and Al-Muharram, and Safar, and the month of Rabbi Al-Awwal are four months in which the good deeds are Written for him and the sins are not Written against him, except if he comes to a major sin. So when the four months are past, he is mixed with the people’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from abu Ayyub from Sa‘d al-Iskaf who has said the following: “I heard abu Ja’far, ‘Alayhi al-Salam, say, ‘When a pilgrim (al-Hajj) prepares his supplies for Hajj, for every step that he walks for the preparation, Allah, most Majestic, most Glorious, writes down for him ten good deeds, deletes ten sins and raises for him ten degrees until his preparation is complete, whenever it happens. When his animal for transportation moves, for every step lifted up or placed on the ground Allah, the Most Majestic, the Most Glorious, writes down for him the same number of good deeds until all of the acts of Hajj are complete, at which point Allah forgives his sins. During the months of Dhu al-Hajj ah, al-Muharram, Safar, Rabi’ al-Awwal, which are four months, good deeds are written for him. No evil deed is written against him until he in fact commits one (a major sin). After these four months he is mixed with people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/125)"
        ],
        "index": 6834,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:10",
        "relations": {
          "Mentions": [
            "/books/quran:9:2"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ الْحُسَيْنِ بْنِ خَالِدٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) لِأَيِّ شَيْ‏ءٍ صَارَ الْحَاجُّ لَا يُكْتَبُ عَلَيْهِ الذَّنْبُ أَرْبَعَةَ أَشْهُرٍ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَبَاحَ الْمُشْرِكِينَ الْحَرَمَ فِي أَرْبَعَةِ أَشْهُرٍ إِذْ يَقُولُ فَسِيحُوا فِي الْأَرْضِ أَرْبَعَةَ أَشْهُرٍ ثُمَّ وَهَبَ لِمَنْ يَحُجُّ مِنَ الْمُؤْمِنِينَ الْبَيْتَ الذُّنُوبَ أَرْبَعَةَ أَشْهُرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ahmad Bin Muhammad Bin Abu Nasr, from Al Husayn Bin Khalid who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘For which thing did the Hajj come to be such that the sins are not written against him for four months?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Allowed the Al-Harram for the Polytheists during four months when He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h2\">[9:2]</a> So go about in the land for four months</span>. Then He<sup>azwj</sup> Gifted for the ones from the Believers who perform Hajj of the House (Kabah), the sins of four months’."
          ],
          "en.sarwar": [
            "10. A number of our people have narrated from Ahmad ibn Muhammad from Ahmad ibn Muhammad ibn abu Nasr from Husayn ibn Khalid who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, ‘For what reason is no sin written against a pilgrim for four months?’ He (the Imam) replied, ‘Allah, the Most Majestic, the Most Glorious, granted permission to the pagans in al-Haram area for four months as He has said, ‘You can move in the land for four months.’ <a href=\"/#/books/quran:9#h2\">[9:2]</a> Thereafter He has said, that He forgives sins of pilgrims to the House for four months.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/126)"
        ],
        "index": 6835,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:11",
        "text": [
          "أَحْمَدُ عَنْ أَبِي مُحَمَّدٍ الْحَجَّالِ عَنْ دَاوُدَ بْنِ أَبِي يَزِيدَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْحَاجُّ لَا يَزَالُ عَلَيْهِ نُورُ الْحَجِّ مَا لَمْ يُلِمَّ بِذَنْبٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Abu Muhammad Al Hajjal, from Dawood Bin Abu Yazeed, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The pilgrim is such that the Light of the Hajj does not cease to be upon him for as long as he does not sin’."
          ],
          "en.sarwar": [
            "11. Ahmad has narrated from abu Muhammad al-Hajjal, from Dawud ibn abu Yazid from those whom he has mentioned who has said the foiiowing: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that a pilgrim continues to live with the light of al-Hajj until he commits sins again and again.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/126)"
        ],
        "index": 6836,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:12",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي مُحَمَّدٍ الْفَرَّاءِ قَالَ سَمِعْتُ جَعْفَرَ بْنَ مُحَمَّدٍ ( عليه السلام ) يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَابِعُوا بَيْنَ الْحَجِّ وَ الْعُمْرَةِ فَإِنَّهُمَا يَنْفِيَانِ الْفَقْرَ وَ الذُّنُوبَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Muhammad Al Farra who said, ",
            "‘I heard Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> said: ‘Pursue between the Hajj and the Umra, for these two negate the poverty and the sins, just as the bellows negate the slag of the iron’."
          ],
          "en.sarwar": [
            "12. Afi ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Muhammad al-Farra’ who has said the following: “I heard abu Ja’far ibn Muhammad, ‘Alayhi al-Salam, say, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “Perform al-Hajj and al-‘Umrah consecutively; they remove poverty and sins just as al-Kir (a bellowing kiln) removes impurities from iron.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/126)"
        ],
        "index": 6837,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:13",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ جَعْفَرِ بْنِ عِمْرَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْحَجُّ وَ الْعُمْرَةُ سُوقَانِ مِنْ أَسْوَاقِ الْآخِرَةِ اللَّازِمُ لَهُمَا فِي ضَمَانِ اللَّهِ إِنْ أَبْقَاهُ أَدَّاهُ إِلَى عِيَالِهِ وَ إِنْ أَمَاتَهُ أَدْخَلَهُ الْجَنَّةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ali Bin Ismail, from Ali Bin Al Hakam, from Ja’far Bin Imran, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Hajj and the Umra are two markets from the markets of the Hereafter. It is a pre-requisite for these two to be in the Guarantee of Allah<sup>azwj</sup> that if He<sup>azwj</sup> Keeps him alive, would Return him back to his family, and if He<sup>azwj</sup> Causes him to die, would Enter him into the Paradise’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Yahya has narrated from Ali ibn Isma‘il from Ali ibn al-Hakam from Ja’far ibn ‘Imran from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that al-Hajj and al-‘Umrah are two market places (that deal with the merchandise) of the next life. Those who attach themselves to these two are part of the undertaking of Allah. He returns them to their families if He decides to keep them living, or admits them in paradise if He decides to cause them to die.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/126)"
        ],
        "index": 6838,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:14",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ زَكَرِيَّا الْمُؤْمِنِ عَنْ إِبْرَاهِيمَ بْنِ صَالِحٍ عَنْ رَجُلٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْحَاجُّ وَ الْمُعْتَمِرُ وَفْدُ اللَّهِ إِنْ سَأَلُوهُ أَعْطَاهُمْ وَ إِنْ دَعَوْهُ أَجَابَهُمْ وَ إِنْ شَفَعُوا شَفَّعَهُمْ وَ إِنْ سَكَتُوا ابْتَدَأَهُمْ وَ يُعَوَّضُونَ بِالدِّرْهَمِ أَلْفَ أَلْفِ دِرْهَمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Zakariyya Al Momin, from Ibrahim Bin Salih, from a man from our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The pilgrims of the Hajj, and the pilgrims of the Umra are delegates of Allah<sup>azwj</sup>. If they ask Him<sup>azwj</sup>, He<sup>azwj</sup> Grants them, and if they supplicate to Him<sup>azwj</sup>, He<sup>azwj</sup> Answers them, and if the intercede (for someone), He<sup>azwj</sup> (Accepts) their intercession, and if they are silent, He<sup>azwj</sup> Initiates them and Compensates with the Dirham, a thousand (and a) thousand Dirhams’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Muhammad ibn ‘Isa from Zakariya al-Mu’min from Ibrahim ibn Salih from a man from our people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that people who perform al-Hajj or al-‘Umrah are delegates before Allah. If they ask Him for help, He grants their wishes; if they pray, He answers their prayers; if they intercede on behalf of someone, their intercession is honored; if they remain silent, He initiates and He compensates them for every dirham a million dirham.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/126)"
        ],
        "index": 6839,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:15",
        "text": [
          "وَ عَنْهُ عَنْ عَبْدِ الْمُؤْمِنِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ دِرْهَمٌ تُنْفِقُهُ فِي الْحَجِّ أَفْضَلُ مِنْ عِشْرِينَ أَلْفَ دِرْهَمٍ تُنْفِقُهَا فِي حَقٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Abdul Momine, from Ali Bin Abu Hama, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A Dirham you spend in the Hajj is superior than the twenty thousand Dirhams you spend regarding a right’."
          ],
          "en.sarwar": [
            "15. It is narrated from him (narrator of previous Hadith) from ‘Abd al-Mu’min from Ali ibn abu Hamzah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that one dirham that you spend for Hajj is better than twenty thousand dirham which you spent for a truth (a right).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/127)"
        ],
        "index": 6840,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:16",
        "text": [
          "وَ عَنْهُ عَنْ عَبْدِ الْمُؤْمِنِ عَنْ دَاوُدَ بْنِ أَبِي سُلَيْمَانَ الْجَصَّاصِ عَنْ عُذَافِرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا يَمْنَعُكَ مِنَ الْحَجِّ فِي كُلِّ سَنَةٍ قُلْتُ جُعِلْتُ فِدَاكَ الْعِيَالُ قَالَ فَقَالَ إِذَا مِتَّ فَمَنْ لِعِيَالِكَ أَطْعِمْ عِيَالَكَ الْخَلَّ وَ الزَّيْتَ وَ حُجَّ بِهِمْ كُلَّ سَنَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Abdul Momin, from Dawood Bin Abu Suleyman Al Jasas, from Uzafir who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘What prevents you from the Hajj in every year?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! The dependents’. So he<sup>asws</sup> said: ‘If you were to die, so who would be there for your dependants? Feed your dependants the vinegar, and the oil, and perform Hajj with them every year’."
          ],
          "en.sarwar": [
            "16. It is narrated from him (narrator of previous Hadith) from ‘Abd al-Mu’min from Dawud ibn Sulayman al-Jassas from ‘Adhafir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once asked, ‘What prevents you from performing Hajj every year?’ I replied, ‘I pray to Allah to keep my soul in service for your cause; my dependents prevent me from performing Hajj.’ He (the Imam) said, ‘If you die who will be there for your dependents? You should feed your dependents vinegar and oil and perform Hajj with them every year.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/127)"
        ],
        "index": 6841,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:17",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَقُولُ بَادِرُوا بِالسَّلَامِ عَلَى الْحَاجِّ وَ الْمُعْتَمِرِ وَ مُصَافَحَتِهِمْ مِنْ قَبْلِ أَنْ تُخَالِطَهُمُ الذُّنُوبُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Asbat, from Suleyman Al Ja’fary, from the one who reported it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was saying: ‘Initiate with the greetings upon the pilgrims of the Hajj and the pilgrims of the Umra, and shake their hands from before the sins get mixed up with them’."
          ],
          "en.sarwar": [
            "17. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from Ali ibn Asbat from Sulayman al-Ja’fariy from those whom he has mentioned who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ali ibn al-Husayn, ‘Alayhi al-Salam, would say, "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/127)"
        ],
        "index": 6842,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:18",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ زَكَرِيَّا الْمُؤْمِنِ عَنْ شُعَيْبٍ الْعَقَرْقُوفِيِّ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْحَاجُّ وَ الْمُعْتَمِرُ فِي ضَمَانِ اللَّهِ فَإِنْ مَاتَ مُتَوَجِّهاً غَفَرَ اللَّهُ لَهُ ذُنُوبَهُ وَ إِنْ مَاتَ مُحْرِماً بَعَثَهُ اللَّهُ مُلَبِّياً وَ إِنْ مَاتَ بِأَحَدِ الْحَرَمَيْنِ بَعَثَهُ اللَّهُ مِنَ الْآمِنِينَ وَ إِنْ مَاتَ مُنْصَرِفاً غَفَرَ اللَّهُ لَهُ جَمِيعَ ذُنُوبِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Muhammad Bin Isa, from Zakariyya Al momin, from Shuayb Al Aqarquqy, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The pilgrim of the Hajj and the pilgrim of the Umra is in the Guarantee of Allah<sup>azwj</sup>. So if he were to die heading for it, Allah<sup>azwj</sup> would Forgive his sins for him; but if he were to die in Ihram, Allah<sup>azwj</sup> would Resurrect him exclaiming Talbiyya; and if he were to die in one of the two Sanctuaries, Allah<sup>azwj</sup> would Resurrect him among the secured ones; and if he were to die on his way back, Allah<sup>azwj</sup> would Forgive for him the entirety of his sins’."
          ],
          "en.sarwar": [
            "18. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isa from Zakariya al-Mu’min from Shu’ayb al-‘Aqarqufiy from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the pilgrim’s performing al-Hajj and al-‘Umrah is part of the undertaking of Allah. If he dies when on his way, Allah forgives his sins. If he dies in the state of Ihram, Allah raises him saying Talbiyah (here I am O Lord, to obey Your command). If he dies in one of the two sacred places, Allah raises him well protected. If he dies on his way back home, Allah forgives all of his sins.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/127)"
        ],
        "index": 6843,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:19",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنِ الرِّضَا ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ مَا وَقَفَ أَحَدٌ فِي تِلْكَ الْجِبَالِ إِلَّا اسْتُجِيبَ لَهُ فَأَمَّا الْمُؤْمِنُونَ فَيُسْتَجَابُ لَهُمْ فِي آخِرَتِهِمْ وَ أَمَّا الْكُفَّارُ فَيُسْتَجَابُ لَهُمْ فِي دُنْيَاهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Fazal, ",
            "(It has been narrated) from Al-Reza<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘No one would pause in those mountains except that it (his supplication) would be Answered for him. So, as for the Believers, it would be Answered for them in their Hereafter, and as for the Infidel, so it would be Answered for them in their world’."
          ],
          "en.sarwar": [
            "19. Ali ibn Ibrahim has narrated from his father from ibn Faddal who has said the following: “I once heard al-Rida, ‘Alayhi al-Salam, say, ‘No one has stood in those hills without their prayers answered. The believing people’s prayers are answered in the matters of their next life, and the unbeliever’s prayers are answered in their worldly matters.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/128)"
        ],
        "index": 6844,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:20",
        "text": [
          "وَ عَنْهُ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ بَعْضِ أَصْحَابِنَا قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا أَخَذَ النَّاسُ مَنَازِلَهُمْ بِمِنًى نَادَى مُنَادٍ يَا مِنًى قَدْ جَاءَ أَهْلُكِ فَاتَّسِعِي فِي فِجَاجِكِ وَ اتْرَعِي فِي مَثَابِكِ وَ مُنَادٍ يُنَادِي لَوْ تَدْرُونَ بِمَنْ حَلَلْتُمْ لَأَيْقَنْتُمْ بِالْخَلَفِ بَعْدَ الْمَغْفِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from his father, from Ali Bin Asbat, from one of our companions who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When the people take their place in Mina, a Caller calls out: ‘O Mina! Your people have come. Therefore expand your glens and irrigate your resorts!’ And a Caller calls out: ‘Had you known the One<sup>azwj</sup> you are being Welcomed by, you would have been convinced with the replacement (of your expenditure) after the Forgiveness’."
          ],
          "en.sarwar": [
            "20. It is narrated from him (narrator of previous Hadith) from his father from Ali ibn Asbat from certain individuals of our people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When people take their places in Mina, an announcer announces, “O Mina, your people have come, so expand your open fields to fill up your ponds.” And another announcer announces, ‘Had you known who your host is, you would become certain of al- Khalaf (reward) after forgiveness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/128)"
        ],
        "index": 6845,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:21",
        "relations": {
          "Mentions": [
            "/books/quran:51:50"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ فَفِرُّوا إِلَى اللَّهِ إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ قَالَ حُجُّوا إِلَى اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Abu Al Jaroud, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘(What about) <span class=\"ibTxt\"><a href=\"/#/books/quran:51#h50\">[51:50]</a> Therefore flee to Allah, surely I am a plain warner to you from Him</span>?’ He<sup>asws</sup> said: ‘Be a pilgrim to Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "21. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from abu al-Jarud who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘The words of Allah, ‘’Flee to Allah,’ I am the one who clearly warns you about Him’ <a href=\"/#/books/quran:51#h50\">[51:50]</a>, means, perform Hajj for Allah, the Most Majestic, the Most Glorious.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/128)"
        ],
        "index": 6846,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:22",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَخَذَ النَّاسُ مَنَازِلَهُمْ بِمِنًى نَادَى مُنَادٍ لَوْ تَعْلَمُونَ بِفِنَاءِ مَنْ حَلَلْتُمْ لَأَيْقَنْتُمْ بِالْخَلَفِ بَعْدَ الْمَغْفِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazan, altogether from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the people take their places in Mina, a Caller calls out: ‘Had you known of the court of the One you are being Welcomed by, you would have been convinced with the replacement (of your expenses) after the Forgiveness’."
          ],
          "en.sarwar": [
            "22. Ali has narrated from his father and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan all from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when people take their places in Mina, an announcer announces, ‘Had you known in whose neighborhood you have disembarked, you would become certain of receiving rewards after forgiveness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/129)"
        ],
        "index": 6847,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:23",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ خَالِهِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سَعِيدٍ السَّمَّانِ قَالَ كُنْتُ أَحُجُّ فِي كُلِّ سَنَةٍ فَلَمَّا كَانَ فِي سَنَةٍ شَدِيدَةٍ أَصَابَ النَّاسَ فِيهَا جَهْدٌ فَقَالَ لِي أَصْحَابِي لَوْ نَظَرْتَ إِلَى مَا تُرِيدُ أَنْ تَحُجَّ الْعَامَ بِهِ فَتَصَدَّقْتَ بِهِ كَانَ أَفْضَلَ قَالَ فَقُلْتُ لَهُمْ وَ تَرَوْنَ ذَلِكَ قَالُوا نَعَمْ قَالَ فَتَصَدَّقْتُ تِلْكَ السَّنَةَ بِمَا أُرِيدُ أَنْ أَحُجَّ بِهِ وَ أَقَمْتُ قَالَ فَرَأَيْتُ رُؤْيَا لَيْلَةَ عَرَفَةَ وَ قُلْتُ وَ اللَّهِ لَا أَعُودُ وَ لَا أَدَعُ الْحَجَّ ",
          "قَالَ فَلَمَّا كَانَ مِنْ قَابِلٍ حَجَجْتُ فَلَمَّا أَتَيْتُ مِنًى رَأَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ عِنْدَهُ النَّاسُ مُجْتَمِعُونَ فَأَتَيْتُهُ فَقُلْتُ لَهُ أَخْبِرْنِي عَنِ الرَّجُلِ وَ قَصَصْتُ عَلَيْهِ قِصَّتِي وَ قُلْتُ أَيُّهُمَا أَفْضَلُ الْحَجُّ أَوِ الصَّدَقَةُ فَقَالَ مَا أَحْسَنَ الصَّدَقَةَ ثَلَاثَ مَرَّاتٍ",
          "قَالَ قُلْتُ أَجَلْ فَأَيُّهُمَا أَفْضَلُ قَالَ مَا يَمْنَعُ أَحَدَكُمْ مِنْ أَنْ يَحُجَّ وَ يَتَصَدَّقَ قَالَ قُلْتُ مَا يَبْلُغُ مَالُهُ ذَلِكَ وَ لَا يَتَّسِعُ قَالَ إِذَا أَرَادَ أَنْ يُنْفِقَ عَشَرَةَ دَرَاهِمَ فِي شَيْ‏ءٍ مِنْ سَبَبِ الْحَجِّ أَنْفَقَ خَمْسَةً وَ تَصَدَّقَ بِخَمْسَةٍ أَوْ قَصَّرَ فِي شَيْ‏ءٍ مِنْ نَفَقَتِهِ فِي الْحَجِّ فَيَجْعَلُ مَا يَحْبِسُ فِي الصَّدَقَةِ فَإِنَّ لَهُ فِي ذَلِكَ أَجْراً",
          "قَالَ قُلْتُ هَذَا لَوْ فَعَلْنَاهُ اسْتَقَامَ قَالَ ثُمَّ قَالَ وَ أَنَّى لَهُ مِثْلُ الْحَجِّ فَقَالَهَا ثَلَاثَ مَرَّاتٍ إِنَّ الْعَبْدَ لَيَخْرُجُ مِنْ بَيْتِهِ فَيُعْطِي قِسْماً حَتَّى إِذَا أَتَى الْمَسْجِدَ الْحَرَامَ طَافَ طَوَافَ الْفَرِيضَةِ ثُمَّ عَدَلَ إِلَى مَقَامِ إِبْرَاهِيمَ فَصَلَّى رَكْعَتَيْنِ فَيَأْتِيهِ مَلَكٌ فَيَقُومُ عَنْ يَسَارِهِ فَإِذَا انْصَرَفَ ضَرَبَ بِيَدِهِ عَلَى كَتِفَيْهِ فَيَقُولُ يَا هَذَا أَمَّا مَا مَضَى فَقَدْ غُفِرَ لَكَ وَ أَمَّا مَا يَسْتَقْبِلُ فَجِدَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Yunus Bin Yaqoub, from his maternal uncle Abdullah Bin Abdul Rahman, from Saeed Al Samman who said, ",
            "‘I used to perform Hajj every year. So when it was during a difficult year, the people were hit by hardships. So my companions said to me, ‘If only you would reconsider to what you are intending to perform Hajj of the year with, so giving in charity with it would be superior’. So I said to them, ‘And you are viewing that?’ They said, ‘Yes’. So I gave in charity that year with what I had intended to perform Hajj with, and I stayed (at home)’. So I saw a dream on the night of Arafat, and I said, ‘By Allah<sup>azwj</sup>! Neither will I repeat, nor leave the Hajj’. ",
            "He (the narrator) said, ‘So when it was the next year, I performed Hajj. So when I went over to Mina, I saw Abu Abdullah<sup>asws</sup>, and in his<sup>asws</sup> presence was a gathering of the people. So I went over to him<sup>asws</sup>, and I said to him<sup>asws</sup>, ‘Inform me about the man’, and related to him<sup>asws</sup> my story, and I said, ‘Which of these two is superior, the Hajj or the charity?’ So he<sup>asws</sup> said: ‘How good is the charity’, three times. ",
            "He (the narrator) said, ‘I said, ‘Certainly! But which of the two is superior?’ He<sup>asws</sup> said: ‘What prevents one of you from performing Hajj and giving charity?’ I said, ‘His wealth does not reach to that, nor can he expand (his expenditure)’. He<sup>asws</sup> said: ‘Whenever he intends to spend ten Dirhams regarding something from the causes of the Hajj, spends five and gives in charity with five, or reduces something from his expenditure regarding the Hajj. Thus, he would make, whatever he has withheld regarding the charity, so there would be a Recompense for him with regards to that’. ",
            "He (the narrator) said, ‘I said, ‘This, were we to do it, would be straight’. Then he<sup>asws</sup> said: ‘And in what way is it similar to Hajj?’ - So he<sup>asws</sup> said it three times – ‘The servant goes out from his house, so he gives a chunk, until when he comes to the Sacred Masjid, circumambulates the Obligatory circumambulation, then goes over to the Standing Place of Ibrahim<sup>as</sup>, so he Prays two Cycles, so an Angel comes over to him, and it stands upon his left. So when he leaves, strikes with its hand upon his shoulder and it would be saying: ‘O you! As for what has passed, so it has been Forgiven for you, and as for what is in the future, so strive’."
          ],
          "en.sarwar": [
            "23. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from Yunus ibn Ya’qub from his uncle, ‘Abd Allah ibn ‘Abd al-Rahman from Sa‘id al-Samman who has said the following: “I would perform Hajj every year. One year in which people suffered severe hardships, my people told me to consider my performing Hajj that year; that I should instead of spending for Hajj, give it in charity. It can be more beneficial than performing Hajj. I then asked them, ‘Do you think that is right?’ They replied, ‘Yes, that is true.’ That year I gave my expenses for Hajj in charity and stayed home. I saw a dream during the night on the ninth of Dhu al-Hajjah and said, ‘By Allah I will not do what I have done and I will not neglect performing Hajj.’ Next year I went to performing Hajj and when I arrived in Mina I saw abu ‘Abd Allah, ‘Alayhi al-Salam, in whose presence people had gathered. I went near him and asked him, “Please tell me about a man.” I told him of my story. Then I asked, ‘Which one is better. Performing Hajj or charity?”” He (the Imam) said, ‘Charity is very good - three times.’ I then said, ‘That is true but which one is better?’ He (the Imam) said, ‘What prevents one of you to do both?’ I replied, ‘His belongings are not sufficient for both.’ He (the Imam) said, ‘If he wants to spend ten for Hajj, he can spend five out of this for Hajj and give the other five as charity or reduce some of his expenses for Hajj and spend what he has cut down in charity for which he earns rewards.’ I then asked, ‘Will it do it if he did so?’ He (the Imam) said, ‘Where can he have something like Hajj’ - he said it three times - ‘one comes out of his house and gives in charity a part of it until he arrives in the Sacred Masjid, performs an obligatory Tawaf, then goes to the station of Ibrahim to say two Rak‘at salat (prayer). An angel comes and stands on his left side. When he completes salat (prayer) the angel taps on his shoulder saying, “O so and so, your sins of the past are forgiven and for the future you can work assiduously.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/130)"
        ],
        "index": 6848,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:24",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ قَالَ رَجُلٌ لِعَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) تَرَكْتَ الْجِهَادَ وَ خُشُونَتَهُ وَ لَزِمْتَ الْحَجَّ وَ لِينَهُ قَالَ وَ كَانَ مُتَّكِئاً فَجَلَسَ وَ قَالَ وَيْحَكَ أَ مَا بَلَغَكَ مَا قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي حَجَّةِ الْوَدَاعِ إِنَّهُ لَمَّا وَقَفَ بِعَرَفَةَ وَ هَمَّتِ الشَّمْسُ أَنْ تَغِيبَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا بِلَالُ قُلْ لِلنَّاسِ فَلْيُنْصِتُوا فَلَمَّا نَصَتُوا قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ رَبَّكُمْ تَطَوَّلَ عَلَيْكُمْ فِي هَذَا الْيَوْمِ فَغَفَرَ لِمُحْسِنِكُمْ وَ شَفَّعَ مُحْسِنَكُمْ فِي مُسِيئِكُمْ فَأَفِيضُوا مَغْفُوراً لَكُمْ ",
          "قَالَ وَ زَادَ غَيْرُ الثُّمَالِيِّ أَنَّهُ قَالَ إِلَّا أَهْلَ التَّبِعَاتِ فَإِنَّ اللَّهَ عَدْلٌ يَأْخُذُ لِلضَّعِيفِ مِنَ الْقَوِيِّ ",
          "فَلَمَّا كَانَتْ لَيْلَةُ جَمْعٍ لَمْ يَزَلْ يُنَاجِي رَبَّهُ وَ يَسْأَلُهُ لِأَهْلِ التَّبِعَاتِ فَلَمَّا وَقَفَ بِجَمْعٍ قَالَ لِبِلَالٍ قُلْ لِلنَّاسِ فَلْيُنْصِتُوا فَلَمَّا نَصَتُوا قَالَ إِنَّ رَبَّكُمْ تَطَوَّلَ عَلَيْكُمْ فِي هَذَا الْيَوْمِ فَغَفَرَ لِمُحْسِنِكُمْ وَ شَفَّعَ مُحْسِنَكُمْ فِي مُسِيئِكُمْ فَأَفِيضُوا مَغْفُوراً لَكُمْ وَ ضَمِنَ لِأَهْلِ التَّبِعَاتِ مِنْ عِنْدِهِ الرِّضَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub, from Abu Hamza Al Sumaly who said, ",
            "‘A man said to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, ‘You<sup>asws</sup> neglected the Jihad and necessitated the Hajj and its softness?’ He said, ‘And he<sup>asws</sup> was reclining, so he<sup>asws</sup> sat up and said: ‘Woe be unto you! Has it not reached you what Rasool-Allah<sup>saww</sup> said in the Farewell Hajj? It was when he<sup>saww</sup> had paused at Arafat and the sun had inclined to set, Rasool-Allah<sup>saww</sup> said: ‘O Bilal! Say to the people, so let them be silent’. So when they were silent, Rasool-Allah<sup>saww</sup> said: ‘Your Lord<sup>azwj</sup> has Extended (Favours) upon you in this day, so He<sup>azwj</sup> Forgave your good-doers, and Interceded for your good-doers regarding your evil-doers. Therefore depart (with your sins having been) Forgiven for you’. ",
            "He (the narrator) said, ‘And (narrators) other than Al-Sumaly have increased that, ‘He<sup>saww</sup> said: ‘Except for the people with the liabilities, for Allah<sup>azwj</sup> is Just. He<sup>azwj</sup> Takes for the weak ones, from the strong ones’. ",
            "So when it was the night of Friday, he<sup>saww</sup> did not cease to whisper to his<sup>saww</sup> Lord<sup>azwj</sup>, and he<sup>saww</sup> asked Him<sup>azwj</sup> for the people with the liabilities. So when he<sup>saww</sup> paused at Jam’a, said to Bilal: ‘Say to the people, so let them be silent!’ So when they were silent, he<sup>saww</sup> said: ‘Your Lord<sup>azwj</sup> has Extended (Favours) upon you in this day, so He<sup>azwj</sup> Forgave your good-doers, and Interceded for your good-doers regarding your evil-doers. Therefore depart (with your sins having been) Forgiven for you, and He<sup>azwj</sup> has Taken the Responsibility for the people with the liabilities of the pleasure (of their creditors) from His<sup>azwj</sup> Presence’."
          ],
          "en.sarwar": [
            "24. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Ayyub from abu Hamzah al-Thumafiy who has said the following: “A man once said to Ali ibn al-Husayn, ‘Alayhi al-Salam, ‘You have given up Jihad because it is harsh, but you have attached yourself to Hajj because it is comfortable.’ He (the Imam) who was leaning sat up straight and said, ‘Fie upon you. Have you not heard what the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said during his farewell pilgrimage during his stay in ‘Arafat, and it was about sunset. The Messenger of Allah said, ‘O Bilal, ask people to remain silent.’ When people became silent the Messenger of Allah said, ‘Your Lord has granted you favors on this day. He has granted forgiveness to the individuals of good deeds, and has made the ones of good deed to intercede for the ones of evil deeds. You can leave now with your sins forgiven.’ Narrators other than abu Hamzah al-Thumaliy have mentioned that the Imam additionally said, ‘Except those who are of individuals of al-Tabi‘at (acts that require investigation).’ Allah is just. He brings to justice the stronger ones who wrong the weaker ones. On the night of al-Jam‘ he continued quietly speaking to his Lord and asked Him for forgiveness for the individuals of al-Tabi‘at. When he stayed in Jam‘ he said to Bilal. ‘You should ask people to remain silent.’ When people became silent he (the Messenger of Allah) said, ‘Your Lord has granted you favors on this day. He has forgiven the individuals of good deeds among you. He has made the individuals of good deeds among you to intercede on behalf of the individuals of evil deeds. You now may leave with your sins forgiven and He has made an undertaking in favor of the individuals of al- Tabi‘at (people liable for the rights of others) to be happy with them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/130)"
        ],
        "index": 6849,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:25",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ لَمَّا أَفَاضَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَلَقَّاهُ أَعْرَابِيٌّ بِالْأَبْطَحِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي خَرَجْتُ أُرِيدُ الْحَجَّ فَعَاقَنِي وَ أَنَا رَجُلٌ مَيِّلٌ يَعْنِي كَثِيرَ الْمَالِ فَمُرْنِي أَصْنَعُ فِي مَالِي مَا أَبْلُغُ بِهِ مَا يَبْلُغُ بِهِ الْحَاجُّ قَالَ فَالْتَفَتَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَى أَبِي قُبَيْسٍ فَقَالَ لَوْ أَنَّ أَبَا قُبَيْسٍ لَكَ زِنَتَهُ ذَهَبَةٌ حَمْرَاءُ أَنْفَقْتَهُ فِي سَبِيلِ اللَّهِ مَا بَلَغْتَ مَا بَلَغَ الْحَاجُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazan, from Ibn Abu Umeyr, from Muawiya Bin Ammar who said, ",
            "‘When Rasool-Allah<sup>saww</sup> departed, he<sup>saww</sup> came across a Bedouin at Al-Bat’ha, who said, ‘O Rasool-Allah<sup>saww</sup>! I went out intending the Hajj but I was hindered, and I am an affluent man, meaning of abundant wealth. So order me to do (something) with my wealth by which I can achieve what I would achieve with by the Hajj’. So Rasool-Allah<sup>saww</sup> turned towards (Mount) Abu Qubays, so he<sup>saww</sup> said: ‘If (Mount) Abu Qubayys was (a pile of) red gold coins for you, spending it in the Way of Allah<sup>azwj</sup>, it would not achieve what the Hajj would achieve’."
          ],
          "en.sarwar": [
            "25. Ali has narrated from his father and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “He (the Imam) has said, that when the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, left an Arab came to him in al- Abtah and said, ‘O Messenger of Allah, I wanted to perform Hajj but something prevented me. I am a wealthy person. Command me to do something with my wealth that benefits me like the benefit of performing Hajj. The Messenger of Allah then looked to abu Qubays hill and said, “Even if you spend an amount of gold equal to the weight of abu Qubays hill for the cause of Allah, you will not gain the benefit of Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/130)"
        ],
        "index": 6850,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:26",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنْ هَارُونَ بْنِ خَارِجَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَنْ دُفِنَ فِي الْحَرَمِ أَمِنَ مِنَ الْفَزَعِ الْأَكْبَرِ فَقُلْتُ لَهُ مِنْ بَرِّ النَّاسِ وَ فَاجِرِهِمْ قَالَ مِنْ بَرِّ النَّاسِ وَ فَاجِرِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Ismail, from Abu Ismail Al sarraj, from Haroun Bin Kharja who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The one who is buried in the Al-Harram would be secure from the great panic’. So I said to him<sup>asws</sup>, ‘From the righteous of the people and their immoral ones (as well)?’ He<sup>asws</sup> said: ‘From the righteous of the people and their immoral ones (as well)’."
          ],
          "en.sarwar": [
            "26. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Isma‘il from abu Isma‘il al-Sarraj from Harun ibn Kharijah who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘One who is buried in al-Haram is immune from the great terrifying event.’ I (the narrator) asked him, ’Does it apply to both people of good and evil deeds?’ He (the Imam) replied, ’Yes, it applies to both kinds of people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/131)"
        ],
        "index": 6851,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:27",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْعَلَاءِ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أَدْنَى مَا يَرْجِعُ بِهِ الْحَاجُّ الَّذِي لَا يُقْبَلُ مِنْهُ أَنْ يُحْفَظَ فِي أَهْلِهِ وَ مَالِهِ قَالَ فَقُلْتُ بِأَيِّ شَيْ‏ءٍ يُحْفَظُ فِيهِمْ قَالَ لَا يَحْدُثُ فِيهِمْ إِلَّا مَا كَانَ يَحْدُثُ فِيهِمْ وَ هُوَ مُقِيمٌ مَعَهُمْ .",
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جُنْدَبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْحَجُّ جِهَادُ الضَّعِيفِ ثُمَّ وَضَعَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَدَهُ فِي صَدْرِ نَفْسِهِ وَ قَالَ نَحْنُ الضُّعَفَاءُ وَ نَحْنُ الضُّعَفَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Al A’ala, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The lowest of what can be hoped for with the Hajj which is not Accepted from him, is that he (the pilgrim) would have Protection regarding his family and his wealth’. He (the narrator) said, ‘I said, ‘By which thing would he have Protection regarding them?’ He<sup>asws</sup> said: ‘Nothing (bad) would happen regarding them except for what has already happened while he was staying with them’.",
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jundub, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The Hajj is a Jihad of the weak ones’. Then Abu Abdullah<sup>asws</sup> placed his<sup>asws</sup> hand upon his<sup>asws</sup> own chest and said: ‘We<sup>asws</sup> are the weak ones, and we<sup>asws</sup> are the weak ones’."
          ],
          "en.sarwar": [
            "27. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from al-‘Ala’ from a man who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the least with which a pilgrim, whose Hajj is not accepted, returns is safety of his family and property at home.” I (the narrator) then asked, ‘What kind of thing is this safety?’ He (the Imam) replied, ’Nothing will happen to them except things that may happen during his presence in his family and belongings.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/131)"
        ],
        "index": 6852,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:28",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ إِبْرَاهِيمَ بْنِ مَيْمُونٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي أَحُجُّ سَنَةً وَ شَرِيكِي سَنَةً قَالَ مَا يَمْنَعُكَ مِنَ الْحَجِّ يَا إِبْرَاهِيمُ قُلْتُ لَا أَتَفَرَّغُ لِذَلِكَ جُعِلْتُ فِدَاكَ أَتَصَدَّقُ بِخَمْسِمِائَةٍ مَكَانَ ذَلِكَ قَالَ الْحَجُّ أَفْضَلُ قُلْتُ أَلْفٍ قَالَ الْحَجُّ أَفْضَلُ قُلْتُ فَأَلْفٍ وَ خَمْسِمِائَةٍ قَالَ الْحَجُّ أَفْضَلُ قُلْتُ أَلْفَيْنِ ",
          "قَالَ أَ فِي أَلْفَيْكَ طَوَافُ الْبَيْتِ قُلْتُ لَا قَالَ أَ فِي أَلْفَيْكَ سَعْيٌ بَيْنَ الصَّفَا وَ الْمَرْوَةِ قُلْتُ لَا قَالَ أَ فِي أَلْفَيْكَ وُقُوفٌ بِعَرَفَةَ قُلْتُ لَا قَالَ أَ فِي أَلْفَيْكَ رَمْيُ الْجِمَارِ قُلْتُ لَا قَالَ أَ فِي أَلْفَيْكَ الْمَنَاسِكُ قُلْتُ لَا قَالَ الْحَجُّ أَفْضَلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Ibrahim Bin Maymoun who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I perform Hajj one year and my associate performs Hajj one year’. He<sup>asws</sup> said: ‘What is preventing you from the Hajj, O Ibrahim?’ I said, ‘I am not free for that, may I be sacrificed for you<sup>asws</sup>. I tend to give in charity with five hundred in place of that’. He<sup>asws</sup> said: ‘The Hajj is superior’. I said, ‘A thousand?’ He<sup>asws</sup> said: ‘The Hajj is superior’. I said, ‘So a thousand and five hundred?’ He<sup>asws</sup> said: ‘The Hajj is superior’. I said, ‘Two thousand?’ ",
            "He<sup>asws</sup> said: ‘Is there, in your two thousand, a circumambulation of the House (Kabah)?’ I said, ‘No’. He<sup>asws</sup> said: ‘Is there, in your two thousand, a Sa’ee between Al-Safa and Al-Marwa’. I said, ‘No’. He<sup>asws</sup> said: ‘Is there, in your two thousand, a pausing at Arafat?’ I said, ‘No’. He<sup>asws</sup> said: ‘Is there, in your two thousand, pelting of the rocks?’ I said, ‘No’. He<sup>asws</sup> said: ‘Is there, in your two thousand, the rituals?’ I said, ‘No’. He<sup>asws</sup> said: ‘The Hajj is superior’."
          ],
          "en.sarwar": [
            "28. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jundab who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ’ Al-Hajj is Jihad (hard work for the cause of Allah) of the weak people.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then placed his hand on his chest and said, ‘We are the weak people, (we) are weak.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/131)"
        ],
        "index": 6853,
        "local_index": 29,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:29",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ قَالَ لِي إِبْرَاهِيمُ بْنُ مَيْمُونٍ كُنْتُ جَالِساً عِنْدَ أَبِي حَنِيفَةَ فَجَاءَهُ رَجُلٌ فَسَأَلَهُ فَقَالَ مَا تَرَى فِي رَجُلٍ قَدْ حَجَّ حَجَّةَ الْإِسْلَامِ الْحَجُّ أَفْضَلُ أَمْ يُعْتِقُ رَقَبَةً فَقَالَ لَا بَلْ عِتْقُ رَقَبَةٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَذَبَ وَ اللَّهِ وَ أَثِمَ لَحَجَّةٌ أَفْضَلُ مِنْ عِتْقِ رَقَبَةٍ وَ رَقَبَةٍ وَ رَقَبَةٍ حَتَّى عَدَّ عَشْراً ",
          "ثُمَّ قَالَ وَيْحَهُ فِي أَيِّ رَقَبَةٍ طَوَافٌ بِالْبَيْتِ وَ سَعْيٌ بَيْنَ الصَّفَا وَ الْمَرْوَةِ وَ الْوُقُوفُ بِعَرَفَةَ وَ حَلْقُ الرَّأْسِ وَ رَمْيُ الْجِمَارِ لَوْ كَانَ كَمَا قَالَ لَعَطَّلَ النَّاسُ الْحَجَّ وَ لَوْ فَعَلُوا كَانَ يَنْبَغِي لِلْإِمَامِ أَنْ يُجْبِرَهُمْ عَلَى الْحَجِّ إِنْ شَاءُوا وَ إِنْ أَبَوْا فَإِنَّ هَذَا الْبَيْتَ إِنَّمَا وُضِعَ لِلْحَجِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘Abu Abdullah<sup>asws</sup> said to me: ‘Ibrahim Bin Maymoun said to me<sup>asws</sup> that he was seated in the presence of Abu Haneefa, so a man came over and asked him, ‘What is your view regarding a man who performs the Hajj of Al-Islam, is the Hajj superior or freeing a neck?’ So he said, ‘But, freeing of a neck’. So Abu Abdullah<sup>asws</sup> said: ‘He lied, by Allah<sup>azwj</sup>, and sinned! A Hajj is superior to freeing a neck, and a neck, and a neck. . .’ until he<sup>asws</sup> counted ten.",
            "Then he<sup>asws</sup> said: ‘Woe be unto him! In which neck is a circumambulation with the House (Kabah), and Saee between Al-Safa and Al-Marwa, and the pausing at Arafat, and shaving of the head, and pelting of the rocks?’ Had it been what he said, the people would have suspended the Hajj, and if they had done so, it would have been befitting for the Imam<sup>asws</sup> that he<sup>asws</sup> forces them upon the Hajj, if they like it and even if they refuse, for this House (Kabah), rather, has been Placed for the Hajj’."
          ],
          "en.sarwar": [
            "29. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah from Ibrahim ibn Maymun who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘One year I perform Hajj and one year my partner in business performs Hajj.’ He (the Imam) said, ‘What prevents you from performing Hajj, O Ibrahim?’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/131)"
        ],
        "index": 6854,
        "local_index": 30,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:30",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ حَجَّةٌ أَفْضَلُ مِنْ عِتْقِ سَبْعِينَ رَقَبَةً فَقُلْتُ مَا يَعْدِلُ الْحَجَّ شَيْ‏ءٌ قَالَ مَا يَعْدِلُهُ شَيْ‏ءٌ وَ لَدِرْهَمٌ وَاحِدٌ فِي الْحَجِّ أَفْضَلُ مِنْ أَلْفَيْ أَلْفِ دِرْهَمٍ فِيمَا سِوَاهُ مِنْ سَبِيلِ اللَّهِ ",
          "ثُمَّ قَالَ لَهُ خَرَجْتُ عَلَى نَيِّفٍ وَ سَبْعِينَ بَعِيراً وَ بِضْعَ عَشْرَةَ دَابَّةً وَ لَقَدِ اشْتَرَيْتُ سُوداً أُكَثِّرُ بِهَا الْعَدَدَ وَ لَقَدْ آذَانِي أَكْلُ الْخَلِّ وَ الزَّيْتِ حَتَّى إِنَّ حَمِيدَةَ أَمَرَتْ بِدَجَاجَةٍ فَشُوِيَتْ فَرَجَعَتْ إِلَيَّ نَفْسِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of his companions, from Umar Bin Yazeed who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘A Hajj is superios than freeing seventy necks’. So I said, ‘Does anything equate to the Hajj?’ He<sup>asws</sup> said, ‘Nothing equates to the Hajj, and for one Dirham regarding the Hajj is superior than the two thousand, thousand (two million) Dirhams in what is besides it, from the Ways of Allah<sup>azwj</sup>’. ",
            "Then he<sup>asws</sup> said to him: ‘I<sup>asws</sup> went (to Hajj) upon more, and there were seventy camles and some ten animals, and I<sup>asws</sup> had bought slaves to increase the number with it, and the eating of the vinegar and the oil had harmed me<sup>asws</sup> until Hameeda instructed with the chicken to be grilled, so I<sup>asws</sup> returned to my<sup>asws</sup> (former) self’."
          ],
          "en.sarwar": [
            "30. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ibrahim ibn Maymun told him that he was once sitting in the meeting of abu Hanifah. A man came and asked him (abu Hanifah), ‘What do you think of a man who has performed Hajjahta al-Islam? Is al-Hajj better or setting free of a slave?’ He (abu Hanifah) replied, ‘No, setting free a slave is better.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘He (abu Hanifah) by Allah, has spoken a lie and has committed a sin. One Hajj is better than setting free of a slave’ . . .he counted up to ten slaves, then he said, ‘Fie upon him; in what kind of setting free of slaves is Tawaf around the House, Sa‘y between al-Safa’ and al-Marwah, staying in ‘Arafat, shaving one’s head and throwing pebbles on al-Jamarat? Had this been true, people would cancel performing al-Hajj altogether; and were they to do it, the Imam would force them to perform al-Hajj whether they liked or disliked it; this House is established for al-Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/132)"
        ],
        "index": 6855,
        "local_index": 31,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:31",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حُسَيْنٍ الْأَحْمَسِيِّ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) حَجَّةٌ خَيْرٌ مِنْ بَيْتٍ مَمْلُوءٍ ذَهَباً يُتَصَدَّقُ بِهِ حَتَّى يَفْنَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Husayn Al Ahmasy, from Abu Baseer who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘A Hajj is better than a house filled with gold to be given in charity with until it depletes’."
          ],
          "en.sarwar": [
            "31. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from certain individuals of his people from ‘Umar ibn Yazid who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘Al-Hajj is better than setting free of seventy slaves/ I then asked, ‘Is there anything equal to al-Hajj?’ He (the Imam) replied, ‘No other thing is equal to al- Hajj. Spending one dirham for al-Hajj is better than spending two million dirhams for the cause of Allah, which is other than al-Hajj. 5 He (the Imam) then said, ‘I left for al-Hajj and there were seventy camels and ten or so horses. I had purchased slaves to increase the number. Eating vinegar with oil had made me upset. Hamidah had ordered to roast a chicken that made me feel better.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/133)"
        ],
        "index": 6856,
        "local_index": 32,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:32",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنِ الْفُضَيْلِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ لَا وَ رَبِّ هَذِهِ الْبَنِيَّةِ لَا يُخَالِفُ مُدْمِنَ الْحَجِّ بِهَذَا الْبَيْتِ حُمَّى وَ لَا فَقْرٌ أَبَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Rabie Bin Abdullah, from Al Fuzayl who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘No, by the Lord<sup>azwj</sup> of this House (Kabah)! A habitual one of this House (Kabah) would neither be violated by fever, nor poverty, ever!’"
          ],
          "en.sarwar": [
            "32. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Husayn al-Ahmasiy from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One Hajj is better than spending a whole house full of gold in charity until it is finished.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/133)"
        ],
        "index": 6857,
        "local_index": 33,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:33",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ قَالَ قُلْتُ لِلرِّضَا ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنَّ أَبِي حَدَّثَنِي عَنْ آبَائِكَ ( عليهم السلام ) أَنَّهُ قِيلَ لِبَعْضِهِمْ إِنَّ فِي بِلَادِنَا مَوْضِعَ رِبَاطٍ يُقَالُ لَهُ قَزْوِينُ وَ عَدُوّاً يُقَالُ لَهُ الدَّيْلَمُ فَهَلْ مِنْ جِهَادٍ أَوْ هَلْ مِنْ رِبَاطٍ فَقَالَ عَلَيْكُمْ بِهَذَا الْبَيْتِ فَحُجُّوهُ ",
          "ثُمَّ قَالَ فَأَعَادَ عَلَيْهِ الْحَدِيثَ ثَلَاثَ مَرَّاتٍ كُلَّ ذَلِكَ يَقُولُ عَلَيْكُمْ بِهَذَا الْبَيْتِ فَحُجُّوهُ ثُمَّ قَالَ فِي الثَّالِثَةِ أَ مَا يَرْضَى أَحَدُكُمْ أَنْ يَكُونَ فِي بَيْتِهِ يُنْفِقُ عَلَى عِيَالِهِ يَنْتَظِرُ أَمْرَنَا فَإِنْ أَدْرَكَهُ كَانَ كَمَنْ شَهِدَ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بَدْراً وَ إِنْ لَمْ يُدْرِكْهُ كَانَ كَمَنْ كَانَ مَعَ قَائِمِنَا فِي فُسْطَاطِهِ هَكَذَا وَ هَكَذَا وَ جَمَعَ بَيْنَ سَبَّابَتَيْهِ",
          "فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) صَدَقَ هُوَ عَلَى مَا ذَكَرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ahmad Bin Muhammad, altogether from Ahmad Bin Muhammad Bin Abu Nasr, from Muhammad Bin Abdullah who said, ",
            "‘I said to Al-Reza<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! My father narrated to me from your<sup>asws</sup> forefathers<sup>asws</sup> that it was said to one of them<sup>asws</sup>, ‘In our city is a fort called Qazween, and enemies called Al-Daylam. So is there from a Jihad, or is there from a fort (to fight)?’ So he<sup>asws</sup> said: ‘Upon you is with this House (Kabah), so perform its Hajj’.",
            "Then he (the narrator) said: ‘So the discussion was repeated to him<sup>asws</sup> three times, during all of that he<sup>asws</sup> was saying: ‘It is upon you with this House (Kabah), so perform its Hajj’. Then he<sup>asws</sup> said during the third: ‘Would not one of you be happy that he would happen to be in his house, spending upon his dependents, awaiting our<sup>asws</sup> command? So if he was to meet him<sup>asws</sup>, he would be like the one who witnessed (the battle of) Badr with Rasool-Allah<sup>saww</sup>; and if he does meet him<sup>asws</sup>, he would be like the one who would be with our<sup>asws</sup> Qaim<sup>asws</sup> in his<sup>asws</sup> tent like this, and like this’ – and he<sup>asws</sup> gathered between two of his<sup>asws</sup> fingers’. ",
            "So Abu Al-Hassan<sup>asws</sup>, said: ‘He spoke the truth upon what he mentioned’."
          ],
          "en.sarwar": [
            "33. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Rib’iy ibn ‘Abd Allah from al-Fudayl who has said the following: “I heard abu Ja‘far, ‘Alayhi al-Salam, say, ‘I swear by the Lord of this House that one constantly visiting this House does not suffer from fever and poverty.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/133)"
        ],
        "index": 6858,
        "local_index": 34,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:34",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ غَالِبٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْحَجُّ وَ الْعُمْرَةُ سُوقَانِ مِنْ أَسْوَاقِ الْآخِرَةِ وَ الْعَامِلُ بِهِمَا فِي جِوَارِ اللَّهِ إِنْ أَدْرَكَ مَا يَأْمُلُ غَفَرَ اللَّهُ لَهُ وَ إِنْ قَصَرَ بِهِ أَجَلُهُ وَقَعَ أَجْرُهُ عَلَى اللَّهِ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Hajjal, from Ghalib, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Hajj and the Umra are two markets from the markets of the Hereafter, and the performer of these two would be in the Neighbourhood of Allah<sup>azwj</sup>. If he realises what he performes, Allah<sup>azwj</sup> would Forgive for him, and if he is deficient with it, of his term (life-span), his Recompense would fall upon Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "34. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad all from Ahmad ibn Muhammad ibn abu Nasr from Muhammad ibn ‘Abd Allah who has said the following: “I once said to al-Rida, ‘Alayhi al-Salam, ‘I pray to Allah to keep my soul in service for your cause. My father has narrated to me from your ancestors, ‘Alayhim al-Salam, that it was said to one of them, ‘In our country there is a station for travelers called Qazvin and enemies called al-Daylam. Is it obligatory to fight and arm (ourselves)?’ He (the Imam) replied, ‘You must not ignore this House and must not miss performing Hajj.’ He (the narrator) has said that the question was repeated three times. Each time he (the Imam) said, ‘You must not ignore this House and must not miss performing Hajj.’ After the last time he (the Imam) said, ‘Why should one of you not love to spend on his family at home waiting for the rise of one from us with Divine Authority? If he finds him, it is as if he has joined the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, in the battle of Badr. If he does not find, him it will be as if he is standing in the tent of al-Qa’im from us like this and this.’ He placed his two fingers side by side. Abu al- Hassan, ‘Alayhi al-Salam, then said, ‘He has spoken the truth in what he has narrated.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/134)"
        ],
        "index": 6859,
        "local_index": 35,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:35",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ زَعْلَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنِ ابْنِ الطَّيَّارِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) حِجَجٌ تَتْرَى وَ عُمَرٌ تُسْعَى يَدْفَعْنَ عَيْلَةَ الْفَقْرِ وَ مِيتَةَ السَّوْءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Al Hassan Za’lan, from Abdullah Bin Al Mugheira, from Ibn Al Tayyar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Hajj performed in succession, and Umra performed constantly, both dispel the abject poverty and the evil death’."
          ],
          "en.sarwar": [
            "35. A number of our people have narrated from Ahmad ibn Muhammad from al-Hajjal from Ghalib from those whom he has mentioned who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that al-Hajj and al-‘Umrah are market places for the next life in which the workers are neighbors of Allah. If they find what they hope, Allah grants them forgiveness, but if the appointed time for his death did not give him a chance, the reward for him remains with Allah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/134)"
        ],
        "index": 6860,
        "local_index": 36,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:36",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَتَى النَّبِيَّ ( صلى الله عليه وآله ) رَجُلَانِ رَجُلٌ مِنَ الْأَنْصَارِ وَ رَجُلٌ مِنْ ثَقِيفٍ فَقَالَ الثَّقِيفِيُّ يَا رَسُولَ اللَّهِ حَاجَتِي فَقَالَ سَبَقَكَ أَخُوكَ الْأَنْصَارِيُّ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي عَلَى ظَهْرِ سَفَرٍ وَ إِنِّي عَجْلَانُ وَ قَالَ الْأَنْصَارِيُّ إِنِّي قَدْ أَذِنْتُ لَهُ ",
          "فَقَالَ إِنْ شِئْتَ سَأَلْتَنِي وَ إِنْ شِئْتَ نَبَّأْتُكَ فَقَالَ نَبِّئْنِي يَا رَسُولَ اللَّهِ فَقَالَ جِئْتَ تَسْأَلُنِي عَنِ الصَّلَاةِ وَ عَنِ الْوُضُوءِ وَ عَنِ السُّجُودِ فَقَالَ الرَّجُلُ إِي وَ الَّذِي بَعَثَكَ بِالْحَقِّ فَقَالَ أَسْبِغِ الْوُضُوءَ وَ امْلَأْ يَدَيْكَ مِنْ رُكْبَتَيْكَ وَ عَفِّرْ جَبِينَكَ فِي التُّرَابِ وَ صَلِّ صَلَاةَ مُوَدِّعٍ ",
          "وَ قَالَ الْأَنْصَارِيُّ يَا رَسُولَ اللَّهِ حَاجَتِي فَقَالَ إِنْ شِئْتَ سَأَلْتَنِي وَ إِنْ شِئْتَ نَبَّأْتُكَ فَقَالَ يَا رَسُولَ اللَّهِ نَبِّئْنِي قَالَ جِئْتَ تَسْأَلُنِي عَنِ الْحَجِّ وَ عَنِ الطَّوَافِ بِالْبَيْتِ وَ السَّعْيِ بَيْنَ الصَّفَا وَ الْمَرْوَةِ وَ رَمْيِ الْجِمَارِ وَ حَلْقِ الرَّأْسِ وَ يَوْمِ عَرَفَةَ فَقَالَ الرَّجُلُ إِي وَ الَّذِي بَعَثَكَ بِالْحَقِّ قَالَ لَا تَرْفَعُ نَاقَتُكَ خُفّاً إِلَّا كَتَبَ اللَّهُ بِهِ لَكَ حَسَنَةً وَ لَا تَضَعُ خُفّاً إِلَّا حَطَّ بِهِ عَنْكَ سَيِّئَةً",
          "وَ طَوَافٌ بِالْبَيْتِ وَ سَعْيٌ بَيْنَ الصَّفَا وَ الْمَرْوَةِ تَنْفَتِلُ كَمَا وَلَدَتْكَ أُمُّكَ مِنَ الذُّنُوبِ وَ رَمْيُ الْجِمَارِ ذُخْرٌ يَوْمَ الْقِيَامَةِ وَ حَلْقُ الرَّأْسِ لَكَ بِكُلِّ شَعْرَةٍ نُورٌ يَوْمَ الْقِيَامَةِ وَ يَوْمُ عَرَفَةَ يَوْمٌ يُبَاهِي اللَّهُ عَزَّ وَ جَلَّ بِهِ الْمَلَائِكَةَ فَلَوْ حَضَرْتَ ذَلِكَ الْيَوْمَ بِرَمْلِ عَالِجٍ وَ قَطْرِ السَّمَاءِ وَ أَيَّامِ الْعَالَمِ ذُنُوباً فَإِنَّهُ تَبُتُّ ذَلِكَ الْيَوْمَ",
          "وَ فِي حَدِيثٍ آخَرَ لَهُ بِكُلِّ خُطْوَةٍ يَخْطُو إِلَيْهَا يُكْتَبُ لَهُ حَسَنَةٌ وَ يُمْحَى عَنْهُ سَيِّئَةٌ وَ يُرْفَعُ لَهُ بِهَا دَرَجَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shaan, from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Two men from the Helpers and one man from Saqeef came over to the Prophet<sup>saww</sup>, so the Saqifite said, ‘O Rasool-Allah<sup>saww</sup>! I need your<sup>saww</sup> help’. So he<sup>saww</sup> said: ‘Your brother, the Helper, preceded you’. So he said, ‘O Rasool-Allah<sup>saww</sup>! I am upon the back of a journey and I am in a hurry’. And the Helper said, ‘I have permitted him (to be first)’. ",
            "So he<sup>saww</sup> said: ‘If you like, you can ask me<sup>saww</sup>, and if you like I<sup>saww</sup> can tell you’. So he said, ‘Clarify it for me, O Rasool-Allah<sup>saww</sup>!’. So he<sup>saww</sup> said: ‘You came to ask me<sup>asws</sup> about the Prayer, and about the ablution, and about the Prostrations’. So the man said, ‘Yes, by the One<sup>azwj</sup> Who Sent you<sup>saww</sup> with the Truth’. So he<sup>saww</sup> said: ‘Perfect the ablution and fill your hands from your two knees, and spray your forehead in the dust, and Pray a farewell Prayer’.",
            "And the Helper said, ‘O Rasool-Allah<sup>saww</sup>! My need’. So he<sup>saww</sup> said: ‘If you like, you can ask me<sup>saww</sup>, and if you like I<sup>saww</sup> can tell you’. So he said, ‘O Rasool-Allah<sup>saww</sup>! Clarify to me’. He<sup>as</sup> said: ‘You came to ask me<sup>asws</sup> about the Hajj, and about the circumambulation with the House (Kabah), and the Sa’ee between Al-Safa and Al-Marwa, and pelting of the rocks, and shaving of the head, and the day of Arafat’. So the man said, ‘Yes, by the One<sup>azwj</sup> Whom Sent you<sup>saww</sup> with the Truth’. He<sup>saww</sup> said: ‘Your she-camel will not raise a foot except that Allah<sup>azwj</sup> would Write a good deed for you, due to it, nor would it place a foot except a sin would be deleted from you, due to it.",
            "And circumambulating with the House (Kabah), and performing Sa’ee between Al-Safa and Al-Marwa, would cleanse you from the sins to be just as you were when your mother gave brith to you; and pelting of the rocks would be a hoard of treasure on the Day of Judgement; and shaving of the head, there would be for you, for each hair of yours (shaved off), a Light on the Day of Judgement; and the day of Arafat is a day Allah<sup>azwj</sup> Mighty and Majestic Boasts with to the Angels. So if you were to be present on that day with sins (of the number of) the grains of sand, and drops of the sky (rain), and days of the year, it would be Forgiven on that day’.",
            "And in another Hadeeth of his<sup>asws</sup>, (he<sup>asws</sup> said): ‘With each step he steps towards it, a good deed would be Written for him and a sin would be deleted from him, and a Level would be raised for him’."
          ],
          "en.sarwar": [
            "36. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn al-Hassan Ali ibn abu Za‘lan from ‘Abd Allah ibn al-Mughirah from ibn al-Tayyar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Perform al-Hajj repeatedly and al-‘Umrah assiduously (or after every nine days). This expels the burden of poverty and death in wickedness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/134)"
        ],
        "index": 6861,
        "local_index": 37,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:37",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنِ الْحَسَنِ بْنِ الْجَهْمِ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَا يَقِفُ أَحَدٌ عَلَى تِلْكَ الْجِبَالِ بَرٌّ وَ لَا فَاجِرٌ إِلَّا اسْتَجَابَ اللَّهُ لَهُ فَأَمَّا الْبَرُّ فَيُسْتَجَابُ لَهُ فِي آخِرَتِهِ وَ دُنْيَاهُ وَ أَمَّا الْفَاجِرُ فَيُسْتَجَابُ لَهُ فِي دُنْيَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Al Hassan Bin Al Jaham, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘Abu Ja’far<sup>asws</sup> said: ‘One would not pause upon that mountain, neither a righteous one nor an immoral one, except that Allah<sup>azwj</sup> would Answer (his supplication) for him. So, as for the righteous one, so it would be Answered for him in his Hereafter and in his world; and as for the immoral one, so it would be Answered for him in his world’."
          ],
          "en.sarwar": [
            "37. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once, two men came to the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, one from the people of al- Ansar and the other one from Thaqif. The man from al-Thaqif said, ‘O Messenger of Allah, I need help.’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, ‘Your brother (in faith) from the people of al- Ansar had come before you.’ He then said, ‘O Messenger of Allah, I am about to leave for a journey and I am in a hurry.’ The man from the people of al- Ansar said, ‘I allow him to present his case before me.’ The Messenger of Allah then said, ‘If you like, I can inform you what you need, or if you like, you can ask what you need.’ He then said, ‘I’d like you to inform me, O Messenger of Allah.’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, ‘You have come to ask me about salat (prayer), Wudu’ and al-Sajdah (prostration).’ The man said, ‘Yes, by the One who has sent you in all truth.’ The Messenger of Allah then said, ‘Take a Wudu’, properly, fill your palms with your knee caps, place your forehead on the soil and perform your salat (prayer) as it is the last farewell salat (prayer).’ The man from al- Ansar then said, ‘O Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, I need help.’ The Messenger of Allah then said, ‘If you like I can inform you what you need or if you like you can ask what you need.’ He then said, ‘I like you to inform me O Messenger of Allah.’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, ‘You have come to ask me about al-Hajj, Tawaf around the House, al-Sa‘y between al-Safa’ and al-Marwah, throwing pebbles on al-Jamar, shaving the head and about the day of ‘Arafah.’ “The man said, ‘Yes, by the One who has sent you in all truth, it is true.’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, then said, ‘For every step that your camel will move (to al-Hajj), Allah writes one good deed for you. Every time you place your foot on the ground, Allah deletes one of your sins. For Tawaf you perform around the House and Sa‘y between al-Safa’ and al-Marwah, your condition will change in regard to sins into that when your mother gave birth to you. Throwing pebbles on al-Jamar is of providing supplies for the next life. For shaving your head, there will be light for you on the Day of Judgment for each hair. For the day of ‘Arafah Allah, the Most Majestic, the Most Glorious, will express pride before the angels. If you attend that day, even if your sins are equal to the grains of sands, the drops of rain from the sky and the number of the days of the world, they will all scatter away from you on that day.’” NOTE:In another Hadith it is said, ‘For every step that he moves forward, one good deed is written for him, one bad deed is deleted and by one degree his position is raised.’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/135)"
        ],
        "index": 6862,
        "local_index": 38,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:38",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ الْمُفَضَّلِ بْنِ صَالِحٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْحَاجُّ ثَلَاثَةٌ فَأَفْضَلُهُمْ نَصِيباً رَجُلٌ غُفِرَ لَهُ ذَنْبُهُ مَا تَقَدَّمَ مِنْهُ وَ مَا تَأَخَّرَ وَ وَقَاهُ اللَّهُ عَذَابَ الْقَبْرِ وَ أَمَّا الَّذِي يَلِيهِ فَرَجُلٌ غُفِرَ لَهُ ذَنْبُهُ مَا تَقَدَّمَ مِنْهُ وَ يَسْتَأْنِفُ الْعَمَلَ فِيمَا بَقِيَ مِنْ عُمُرِهِ وَ أَمَّا الَّذِي يَلِيهِ فَرَجُلٌ حُفِظَ فِي أَهْلِهِ وَ مَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Al Mufazzal Bin Salih, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said; ‘Rasool-Allah<sup>saww</sup> said: ‘The pilgrims are three, so the most superior of them in share is a man for whom his sins are Forgiven, whatever has preceded from it and whatever it delayed, and Allah<sup>azwj</sup> Saves him from the Punishment of the grave; and as for the one who follows him, so it is a man whose sins have been Forgiven for him, whatever has preceded from it, and he resumes the deeds in what is remaining from his life-span; and as for the one who follows him, so it is a man who is Protected regarding his family and his wealth’."
          ],
          "en.sarwar": [
            "38. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali from al-Hassan ibn al-Jahm from abu al- Hassan al-Rida’, ‘Alayhi al-Salam, who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘All of the people who stay in those hills, good or evil, Allah answers them all. People of good deed receive answers for the worldly and the hereafter and the people of evil deeds receive answer to their worldly matters.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/135)"
        ],
        "index": 6863,
        "local_index": 39,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:39",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْحَاجُّ عَلَى ثَلَاثَةِ أَصْنَافٍ صِنْفٌ يُعْتَقُ مِنَ النَّارِ وَ صِنْفٌ يَخْرُجُ مِنْ ذُنُوبِهِ كَهَيْئَةِ يَوْمَ وَلَدَتْهُ أُمُّهُ وَ صِنْفٌ يُحْفَظُ فِي أَهْلِهِ وَ مَالِهِ وَ هُوَ أَدْنَى مَا يَرْجِعُ بِهِ الْحَاجُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazan, and Ali Bin Ibrahim, from his father, altogether from Ibn Abu Umeyr, from Hisham Bin Al Hakam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The pilgrim is upon three types – a type who is emancipated from the Fire, and a type who comes out from his sins as if he was like the day his mother gave birth to him, and a type who is Protected regarding his family and his wealth – and it is the lowest of what the pilgrim returns with’."
          ],
          "en.sarwar": [
            "39. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr from al-Mufaddal ibn Salih from Jabir who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Al-H’ajj (people who perform al-Hajj) are of three kinds. The one with the best share is one all of whose sins, those of the past and those to come are forgiven, and Allah protects him against the torments in the grave. Next to this is one whose sins of the past are forgiven but he begins his good deeds for the rest of his life. After these two is one who receives safety for his own self, family and property.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/136)"
        ],
        "index": 6864,
        "local_index": 40,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:40",
        "text": [
          "ابْنُ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ سَفَرٍ أَبْلَغَ فِي لَحْمٍ وَ لَا دَمٍ وَ لَا جِلْدٍ وَ لَا شَعْرٍ مِنْ سَفَرِ مَكَّةَ وَ مَا أَحَدٌ يَبْلُغُهُ حَتَّى تَنَالَهُ الْمَشَقَّةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Abu Umeyr, from Hisham Bin Al Hakam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from a journey more affecting in the flesh, nor blood, nor skin, nor hair, than the journey to Makkah; and there is no one who reaches it until he experiences hardship’."
          ],
          "en.sarwar": [
            "40. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan and Ali ibn Ibrahim from his father all from ibn abu ‘Umayr from Hisham ibn al-Hakam who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that al-H’ajj (people performing al-Hajj) are of three kinds. One group is set free from hellfire, one group comes out of their sin to become free of sins like the day they were just born, and one group receives protection for themselves, their family and property, and this is the least benefit with which al-H’ajj (one performing al-Hajj) returns home.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/136)"
        ],
        "index": 6865,
        "local_index": 41,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:41",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ دَاوُدَ بْنِ أَبِي يَزِيدَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَخَذَ النَّاسُ مَوَاطِنَهُمْ بِمِنًى نَادَى مُنَادٍ مِنْ قِبَلِ اللَّهِ عَزَّ وَ جَلَّ إِنْ أَرَدْتُمْ أَنْ أَرْضَى فَقَدْ رَضِيتُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Hajjal, from Dawood Bin Abu Yazeed, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> said: ‘When the people take their places in Mina, a Caller calls out on behalf of Allah<sup>azwj</sup> Mighty and Majestic: ‘If you are intending for Me<sup>azwj</sup> to be Pleased, so I<sup>asws</sup> am Pleased’."
          ],
          "en.sarwar": [
            "41. Ibn abu ‘Umayr has narrated from Hisham ibn al-Hakam who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that no other journey affects one’s flesh, blood, skin and hair more than the journey to Makkah. No one reaches it (the journey) without facing hardships.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/136)"
        ],
        "index": 6866,
        "local_index": 42,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:42",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ إِذَا أَخَذَ النَّاسُ مَنَازِلَهُمْ بِمِنًى نَادَى مُنَادٍ لَوْ تَعْلَمُونَ بِفِنَاءِ مَنْ حَلَلْتُمْ لَأَيْقَنْتُمْ بِالْخَلَفِ بَعْدَ الْمَغْفِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the people that their spots in Mina, a Caller calls out: ‘Had you known of the Court of the one who has Welcomed you, you would have been convinced with the replacement (of your expenditure) after the Forgiveness’."
          ],
          "en.sarwar": [
            "42. A number of our people have narrated from Ahmad ibn Muhammad from al-Hajjal from Dawud ibn abu Yazid who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when people take their places in Mina, an announcer from Allah, the Most Majestic, the Most Glorious, announces, ‘If you wish that I will be happy with you, I have become happy with you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/136)"
        ],
        "index": 6867,
        "local_index": 43,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:43",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عُمَرَ بْنِ حَفْصٍ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَشِيَّةً مِنَ الْعَشِيَّاتِ وَ نَحْنُ بِمِنًى وَ هُوَ يَحُثُّنِي عَلَى الْحَجِّ وَ يُرَغِّبُنِي فِيهِ يَا سَعِيدُ أَيُّمَا عَبْدٍ رَزَقَهُ اللَّهُ رِزْقاً مِنْ رِزْقِهِ فَأَخَذَ ذَلِكَ الرِّزْقَ فَأَنْفَقَهُ عَلَى نَفْسِهِ وَ عَلَى عِيَالِهِ ثُمَّ أَخْرَجَهُمْ قَدْ ضَحَاهُمْ بِالشَّمْسِ حَتَّى يَقْدَمَ بِهِمْ عَشِيَّةَ عَرَفَةَ إِلَى الْمَوْقِفِ فَيَقِيلَ أَ لَمْ تَرَ فُرَجاً تَكُونُ هُنَاكَ فِيهَا خَلَلٌ وَ لَيْسَ فِيهَا أَحَدٌ فَقُلْتُ بَلَى جُعِلْتُ فِدَاكَ ",
          "فَقَالَ يَجِي‏ءُ بِهِمْ قَدْ ضَحَاهُمْ حَتَّى يَشْعَبَ بِهِمْ تِلْكَ الْفُرَجَ فَيَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى لَا شَرِيكَ لَهُ عَبْدِي رَزَقْتُهُ مِنْ رِزْقِي فَأَخَذَ ذَلِكَ الرِّزْقَ فَأَنْفَقَهُ فَضَحَى بِهِ نَفْسَهُ وَ عِيَالَهُ ثُمَّ جَاءَ بِهِمْ حَتَّى شَعَبَ بِهِمْ هَذِهِ الْفُرْجَةَ الْتِمَاسَ مَغْفِرَتِي أَغْفِرُ لَهُ ذَنْبَهُ وَ أَكْفِيهِ مَا أَهَمَّهُ وَ أَرْزُقُهُ ",
          "قَالَ سَعِيدٌ مَعَ أَشْيَاءَ قَالَهَا نَحْواً مِنْ عَشَرَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Umar Bin Hafs, from Saeed Bin Yasar who said, ",
            "‘Abu Abdullah<sup>asws</sup>, said during an evening from the evenings, when we were in Mina, and he<sup>asws</sup> was encouraging me upon the Hajj and making me desirous with regards to it: ‘O Saeed! Whichever servant is Graced by Allah<sup>azwj</sup> with sustenance from His<sup>azwj</sup> Sustenances, so he takes that sustenance and spends it upon himself and upon his dependents. Then he takes them out, having exposed them to the sun until he proceeds with them to an evening of Arafat, to the Pausing Stop. Do you see relief to be over there in a vacant spot, and there is no one in it?’ So I said, ‘Yes, may I be sacrificed for you<sup>asws</sup>’. ",
            "So he<sup>asws</sup> said: ‘He comes with them, having exposed them (to the sun) until he fills with them that relief, so Allah<sup>azwj</sup> Blessed and High, there being no associates for Him<sup>azwj</sup>, would be Saying: “My<sup>azwj</sup> servant, I<sup>azwj</sup> Graced him from My<sup>azwj</sup> Sustenance, so he took that sustenance and spent it, exposing himself and his dependents by it (to the hot sun), then he came over with them until he filled with them this relief, seeking My<sup>azwj</sup> Forgiveness. I<sup>azwj</sup> hereby Forgive his sins for him, and Suffice him for whatever worries him, and Sustain him’. ",
            "Saeed (the narrator) said, ‘Along with the things which he<sup>asws</sup> said, there were approximately ten’."
          ],
          "en.sarwar": [
            "43. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When people take their places in Mina, an announcer announces, “Had you known in whose courtyard have you disembarked, you would have become certain of receiving compensation after having received forgiveness.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/136)"
        ],
        "index": 6868,
        "local_index": 44,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:44",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ مَاتَ فِي طَرِيقِ مَكَّةَ ذَاهِباً أَوْ جَائِياً أَمِنَ مِنَ الْفَزَعِ الْأَكْبَرِ يَوْمَ الْقِيَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who dies in a road to Makkah, going or coming, would be secure from the great panic on the Day of Judgement’."
          ],
          "en.sarwar": [
            "44. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Umar ibn Hafs from Sa‘id ibn Yasar who has said the following: “During one of the evenings when we were in Mina, abu ‘Abd Allah, ‘Alayhi al-Salam, encouraging and urging me to perform al-Hajj, said, ‘O Sa‘id, there is a servant of Allah to whom Allah has granted sustenance from His wealth. He takes from such sustenance the expenditures for himself and his family and then takes them on a journey, exposing them to hot sun until they attend the evening of ‘Arafah to attend the staying place and rest there. Do you not think that there a vacancy may exist for which there is no one to attend?’ I replied, ‘Yes, I pray to Allah to keep my soul in service for your cause, that can happen.’ He (the Imam) then said, ‘This servant of Allah brings them exposed to the hot sun to fill up that vacancy. Allah, the most Blessed, the most High, who has no partners, then says, ‘My servant whom I had granted sustenance out of My wealth, has taken that sustenance for his expenditures. He has exposed his own self and family to the hot sun to come and fill the vacancy for the sake of seeking forgiveness from Me. I forgive his sins, suffice him in whatever is important to him, and grant him sustenance.’ Sa‘id has said, ‘He (the Imam) mentioned such things up to ten in number.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/137)"
        ],
        "index": 6869,
        "local_index": 45,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:45",
        "relations": {
          "Mentions": [
            "/books/quran:22:28"
          ]
        },
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ أَبِي الْمَغْرَاءِ عَنْ سَلَمَةَ بْنِ مُحْرِزٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذْ جَاءَهُ رَجُلٌ يُقَالُ لَهُ أَبُو الْوَرْدِ فَقَالَ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَحِمَكَ اللَّهُ إِنَّكَ لَوْ كُنْتَ أَرَحْتَ بَدَنَكَ مِنَ الْمَحْمِلِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا الْوَرْدِ إِنِّي أُحِبُّ أَنْ أَشْهَدَ الْمَنَافِعَ الَّتِي قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى لِيَشْهَدُوا مَنافِعَ لَهُمْ إِنَّهُ لَا يَشْهَدُهَا أَحَدٌ إِلَّا نَفَعَهُ اللَّهُ أَمَّا أَنْتُمْ فَتَرْجِعُونَ مَغْفُوراً لَكُمْ وَ أَمَّا غَيْرُكُمْ فَيُحْفَظُونَ فِي أَهَالِيهِمْ وَ أَمْوَالِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Abu Al Magra’a, from Salma Bin Muhriz who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup> when a man called Abu Al-Wardi came over. So he said to Abu Abdullah<sup>asws</sup>, ‘May Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>! You<sup>asws</sup>, if only you<sup>asws</sup> would rest your<sup>asws</sup> body from the carriage’. So Abu Abdullah<sup>asws</sup> said: ‘O Abu Al-Wardi! I<sup>asws</sup> love it that I<sup>asws</sup> witness the benefits which Allah<sup>azwj</sup> Blessed and High Speaks of <span class=\"ibTxt\"><a href=\"/#/books/quran:22#h28\">[22:28]</a> That they may witness benefits for them</span>. No one has witnessed these except that Allah<sup>azwj</sup> has Benefited him. As for you, so you are returning having been Forgiven for you, and as for the others, so they are Protected with regards to their families and their wealth’."
          ],
          "en.sarwar": [
            "45. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that if one dies on the way to or from Makkah, he receives immunity against the terror of the Day of Judgment.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/137)"
        ],
        "index": 6870,
        "local_index": 46,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:46",
        "relations": {
          "Mentions": [
            "/books/quran:22:28"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ عَبْدِ اللَّهِ بْنِ جُنْدَبٍ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا كَانَ الرَّجُلُ مِنْ شَأْنِهِ الْحَجُّ كُلَّ سَنَةٍ ثُمَّ تَخَلَّفَ سَنَةً فَلَمْ يَخْرُجْ قَالَتِ الْمَلَائِكَةُ الَّذِينَ عَلَى الْأَرْضِ لِلَّذِينَ عَلَى الْجِبَالِ لَقَدْ فَقَدْنَا صَوْتَ فُلَانٍ فَيَقُولُونَ اطْلُبُوهُ فَيَطْلُبُونَهُ فَلَا يُصِيبُونَهُ فَيَقُولُونَ اللَّهُمَّ إِنْ كَانَ حَبَسَهُ دَيْنٌ فَأَدِّ عَنْهُ أَوْ مَرَضٌ فَاشْفِهِ أَوْ فَقْرٌ فَأَغْنِهِ أَوْ حَبْسٌ فَفَرِّجْ عَنْهُ أَوْ فِعْلٌ فَافْعَلْ بِهِ وَ النَّاسُ يَدْعُونَ لِأَنْفُسِهِمْ وَ هُمْ يَدْعُونَ لِمَنْ تَخَلَّفَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Abdul Hameed, from Abdullah Bin Jundub, from one of his men, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the Hajj was from the occupation of the man, then he stays behind one year and does not go out, the Angels who are upon the ground say to those who are upon the mountains: ‘We are missing the voice of so and so’. So they are saying: ‘Seek him’. So they seek him but they are not finding him, so they are saying: ‘O Allah<sup>azwj</sup>! If it was the debts which withheld him, so Pay-off his debts, or an illness, so Cure him, or poverty, so Enrich him, or if he is imprisoned, so Relieve him from it, or work, so Deal with it’. And the people are supplicating for themselves, and they are supplicating for the one who stayed behind’."
          ],
          "en.sarwar": [
            "46. Abu Ali af-Ash’ariy has narrated from Muhammad ibn ‘Abd af-Jabbar from Safwan from abu af-Mighra’ from Safmah ibn Muhriz who has said the following: “I once was with abu ‘Abd Allah, ‘Alayhi al-Salam, when a man called abu al-Ward came and said to ‘Abd Allah, ‘Alayhi al-Salam, ‘May Allah be kind to you. I wish you to allow yourself to rest by the comfort of al-Mahmil (the carriage carried on camel backs).’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘O abu al-Ward, I love to be present for the benefits that Allah, the most Blessed, the most High, has spoken of, “...so they can be present for the benefits which are there for them.” <a href=\"/#/books/quran:22#h28\">[22:28]</a> Whoever is present for such benefits, Allah grants them such benefits. As far as you are concerned, it is a returning home with sins forgiven and what others receive is safety for their persons and properties.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/138)"
        ],
        "index": 6871,
        "local_index": 47,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:28:47",
        "text": [
          "أَحْمَدُ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( صلوات الله عليه ) يَقُولُ يَا مَعْشَرَ مَنْ لَمْ يَحُجَّ اسْتَبْشِرُوا بِالْحَاجِّ وَ صَافِحُوهُمْ وَ عَظِّمُوهُمْ فَإِنَّ ذَلِكَ يَجِبُ عَلَيْكُمْ تُشَارِكُوهُمْ فِي الْأَجْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Amro Bin Isman, from Ali Bin Abdullah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was saying: ‘O group of the ones who did not perform Hajj! Receive glad tidings with the pilgrims, and shake their hands, and magnify them, for that is Obligatory upon you in order to participate with them in the Recompense’."
          ],
          "en.sarwar": [
            "47. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn ‘Abd al-Hamid from ‘Abd Allah ibn Jundab from certain individuals of his people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that one who normally attends al-Hajj every year, then he lags behind and does not go for al-Hajj one year, the angels on land say to those in the mountains, ‘We miss hearing the voice of so and so.’ They then say, ‘Allow us to search for him.’ They search but do not find him and they say, “O Allah, if debts have kept him behind, pay them off for him; if illness has kept him from performing, grant him good health; if it is poverty, grant him wealth; if it is prison, grant him freedom; if a preoccupation, please complete it for him.’” People pray for themselves; they (angels) pray for those who have remained behind.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/139)"
        ],
        "part_type": "Hadith",
        "text": [
          "48ـ أَحْمَدُ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ عَلِيِّ بْنِ عَبْدِ الله عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ (صلَّى اللهُ عَلَيْهِ وَآلِه) يَقُولُ يَا مَعْشَرَ مَنْ لَمْ يَحُجَّ اسْتَبْشِرُوا بِالْحَاجِّ وَصَافِحُوهُمْ وَعَظِّمُوهُمْ فَإِنَّ ذَلِكَ يَجِبُ عَلَيْكُمْ تُشَارِكُوهُمْ فِي الأَجْرِ."
        ],
        "translations": {
          "en.sarwar": [
            "48. Ahmad has narrated from ‘Amr ibn ‘Uthman from Ali ibn ‘Abd Allah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ali ibn al-Husayn, ‘Alayhi al-Salam, has said, ‘O people who have not performed al-Hajj, spread good news about al-H’ajj (people performing al-Hajj), shake hands with them, consider them great people; it is necessary for you to share with them in matters of the reward.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:28",
  "kind": "verse_list"
}