{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:4:3:30",
        "titles": {
          "ar": "بَابُ اسْتِطَاعَةِ الْحَجِّ ",
          "en": "Chapter 30 – Ability for the Hajj"
        }
      }
    ],
    "index": 973,
    "local_index": 30,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:4:3:31",
        "titles": {
          "ar": "بَابُ مَنْ سَوَّفَ الْحَجَّ وَ هُوَ مُسْتَطِيعٌ",
          "en": "Chapter 31 – The one who delays the Hajj and he is with the ability (for performing it)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:4:3:29",
        "titles": {
          "ar": "بَابُ فَرْضِ الْحَجِّ وَ الْعُمْرَةِ",
          "en": "Chapter 29 – Obligation of (performing) the Hajj and the Umra"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:30",
    "titles": {
      "ar": "بَابُ اسْتِطَاعَةِ الْحَجِّ ",
      "en": "Chapter 30 – Ability for the Hajj"
    },
    "verse_count": 5,
    "verse_start_index": 6880,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/144)"
        ],
        "index": 6881,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:30:1",
        "refs": {
          "Mentions": [
            "/books/quran:3:97"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطاعَ إِلَيْهِ سَبِيلًا قَالَ مَا السَّبِيلُ قَالَ أَنْ يَكُونَ لَهُ مَا يَحُجُّ بِهِ ",
          "قَالَ قُلْتُ مَنْ عُرِضَ عَلَيْهِ مَا يَحُجُّ بِهِ فَاسْتَحْيَا مِنْ ذَلِكَ أَ هُوَ مِمَّنْ يَسْتَطِيعُ إِلَيْهِ سَبِيلًا قَالَ نَعَمْ مَا شَأْنُهُ أَنْ يَسْتَحْيِيَ وَ لَوْ يَحُجُّ عَلَى حِمَارٍ أَجْدَعَ أَبْتَرَ فَإِنْ كَانَ يُطِيقُ أَنْ يَمْشِيَ بَعْضاً وَ يَرْكَبَ بَعْضاً فَلْيَحُجَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Hajby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h97\">[3:97]</a> and Hajj to the House is incumbent upon the people for the Sake of Allah, (upon) every one who is able to undertake the journey to it</span>. He<sup>asws</sup> said: ‘That there happens to be for him what he can perform Hajj with it’. ",
            "He (the narrator) said, ‘I said, ‘ (what about) the one who is offered that, from which he can perform Hajj with, but he is too embarrassed from that, would he be from the ones who has the capacity to journey to it?’ He<sup>asws</sup> said: ‘Yes. What is his matter that he is too embarrassed, and even if he has to perform Hajj upon an amputated tailless donkey? So if he has to endure walking partly and riding partly, so let him perform Hajj’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthaman from af-Halabiy who has said the following: “This is about the words of Allah, most Majestic, most Glorious, ‘It is obligatory upon people from Allah to perform al-Hajj who has the way (are able) to do so.’ <a href=\"/#/books/quran:3#h97\">[3:97]</a> Abu ‘Abd Allah, ‘Alayhi al- Salam, said, ‘What is ‘the way’?’ He (the Imam) then said, ‘It means that he must have the means to perform al-Hajj.’ I then asked, ‘If one is provided with all the means to perform al-Hajj but he feels shy, is he considered of the ones who have the way (are able) to perform al-Hajj?’ He (the Imam) said, ‘Yes, and why should he feel shy even if he performs al-Hajj on a donkey whose nose, ears and tail are cutoff? Even if one needs to walk certain distance of the way and ride other parts one must perform al- Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/146)"
        ],
        "index": 6882,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:30:2",
        "refs": {
          "Mentions": [
            "/books/quran:3:97",
            "/books/quran:3:96"
          ]
        },
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَثْعَمِيِّ قَالَ سَأَلَ حَفْصٌ الْكُنَاسِيُّ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا عِنْدَهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطاعَ إِلَيْهِ سَبِيلًا مَا يَعْنِي بِذَلِكَ قَالَ مَنْ كَانَ صَحِيحاً فِي بَدَنِهِ مُخَلًّى سَرْبُهُ لَهُ زَادٌ وَ رَاحِلَةٌ فَهُوَ مِمَّنْ يَسْتَطِيعُ الْحَجَّ أَوْ قَالَ مِمَّنْ كَانَ لَهُ مَالٌ ",
          "فَقَالَ لَهُ حَفْصٌ الْكُنَاسِيُّ فَإِذَا كَانَ صَحِيحاً فِي بَدَنِهِ مُخَلًّى سَرْبُهُ لَهُ زَادٌ وَ رَاحِلَةٌ فَلَمْ يَحُجَّ فَهُوَ مِمَّنْ يَسْتَطِيعُ الْحَجَّ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Muhammad Bin Yahya Al Khash’amy who said, ",
            "‘Hafs Al-Kunany asked Abu Abdullah<sup>asws</sup>, and I was in his<sup>asws</sup> presence, about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h97\">[3:97]</a> and Hajj to the House is incumbent upon the people for the Sake of Allah, (upon) every one who is able to undertake the journey to it</span>, what is Meant by that?’ He<sup>asws</sup> said; ‘The one who was of well-being in his body, his flock having been freed (looked after) for him, provisions, and ride, so he is from the ones who has the capacity for the Hajj’, or said: ‘From the ones who has wealth for him’. ",
            "So Hafs Al-Kinany said to him<sup>asws</sup>, ‘So when he was of well-being in his body, his flock having been freed (looked after) for him, provisions, and ride, so he is from the ones who has the capacity for the Hajj?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Muhammad ibn Yahya al-Khath’amiy who has said the following: “Hafs al-Kunasiy once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the meaning of the words of Allah, most Majestic, most Glorious, ‘It is obligatory upon people from Allah to perform al-Hajj who have the way (are able) to do so.’ <a href=\"/#/books/quran:3#h96\">[3:96]</a> He (the Imam) said, ‘It means that one is physically safe, has supplies and transportation, then he has the way (is able) to perform al-Hajj or that he (the Imam) said that he is of the ones who is wealthy.’ Hafs al-Kunasiy then asked, ‘So if one is physically safe, free, has supplies, transportation and has not performed al-Hajj, is he of those who are able to perform al- Hajj? He (the Imam) said, ‘Yes, that is correct.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/147)"
        ],
        "index": 6883,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:30:3",
        "refs": {
          "Mentions": [
            "/books/quran:3:97",
            "/books/quran:3:96"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ خَالِدِ بْنِ جَرِيرٍ عَنْ أَبِي الرَّبِيعِ الشَّامِيِّ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ مَنِ اسْتَطاعَ إِلَيْهِ سَبِيلًا فَقَالَ مَا يَقُولُ النَّاسُ قَالَ فَقِيلَ لَهُ الزَّادُ وَ الرَّاحِلَةُ قَالَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَدْ سُئِلَ أَبُو جَعْفَرٍ ( عليه السلام ) عَنْ هَذَا فَقَالَ هَلَكَ النَّاسُ إِذاً لَئِنْ كَانَ مَنْ كَانَ لَهُ زَادٌ وَ رَاحِلَةٌ قَدْرَ مَا يَقُوتُ عِيَالَهُ وَ يَسْتَغْنِي بِهِ عَنِ النَّاسِ يَنْطَلِقُ إِلَيْهِ فَيَسْلُبُهُمْ إِيَّاهُ لَقَدْ هَلَكُوا ",
          "فَقِيلَ لَهُ فَمَا السَّبِيلُ قَالَ فَقَالَ السَّعَةُ فِي الْمَالِ إِذَا كَانَ يَحُجُّ بِبَعْضٍ وَ يُبْقِي بَعْضاً يَقُوتُ بِهِ عِيَالَهُ أَ لَيْسَ قَدْ فَرَضَ اللَّهُ الزَّكَاةَ فَلَمْ يَجْعَلْهَا إِلَّا عَلَى مَنْ يَمْلِكُ مِائَتَيْ دِرْهَمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Khalid Bin Jareer, from Abu Al Rabie Al Shamy who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h97\">[3:97]</a> every one who is able to undertake the journey to it</span>. So he<sup>asws</sup> said: ‘What are the people saying?’ So it was said to him<sup>asws</sup>, ‘The provisions and the ride’. So Abu Abdullah<sup>asws</sup> said: ‘Abu Ja’far<sup>asws</sup> had been asked about this, so he<sup>asws</sup> said: ‘The people are destroyed, because if it was such that the one for whom were provisions and a ride, able upon what he can feed his family, and he is needless from the people with it, he goes to it. So if that is confiscated (stolen) from him, he would be destroyed’. ",
            "So it was said to him<sup>asws</sup>, ‘So what is the way?’ So he<sup>asws</sup> said: ‘The capacity in the wealth. If he was to perform Hajj with part of it, and part of it remains with his dependents (and they) can live by it. Allah<sup>azwj</sup> has Necessitated the Zakat, so He<sup>azwj</sup> did not Make it to be except upon the one who owns two hundred Dirhams’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from ibn Mahbub from Khalid ibn Jarir from abu al-Rabi’ al- Shamiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, most Majestic, most Glorious, ‘It is obligatory upon people from Allah to perform al-Hajj who have the way (are able) to do so.’ <a href=\"/#/books/quran:3#h96\">[3:96]</a> He (the Imam) asked, ‘What do people say about it?’ It was said, to him (the Imam), ‘They say it is supplies and transportation.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘Abu Ja‘far, was asked about it and he said, “If so, then people are destroyed. If it was only supplies, transportation and enough food for the family that made them needless of people and he then left and was looted, such people would have been destroyed.’” It then was asked, ‘What then is ‘the way’?’ He (the Imam) said, ‘It means to be affluent so that if one uses a certain portion, others (enough funds) are left from which, one’s family can spend. Is it not the case that Allah has made Zakat obligatory only when one has two hundred dirham?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/148)"
        ],
        "index": 6884,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:30:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي شَيَّعْتُ أَصْحَابِي إِلَى الْقَادِسِيَّةِ فَقَالُوا لِي انْطَلِقْ مَعَنَا وَ نُقِيمُ عَلَيْكَ ثَلَاثاً فَرَجَعْتُ وَ لَيْسَ عِنْدِي نَفَقَةٌ فَيَسَّرَ اللَّهُ وَ لَحِقْتُهُمْ قَالَ إِنَّهُ مَنْ كُتِبَ عَلَيْهِ فِي الْوَفْدِ لَمْ يَسْتَطِعْ أَنْ لَا يَحُجَّ وَ إِنْ كَانَ فَقِيراً وَ مَنْ لَمْ يُكْتَبْ لَمْ يَسْتَطِعْ أَنْ يَحُجَّ وَ إِنْ كَانَ غَنِيّاً صَحِيحاً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Abu Bakr Al Hazramy who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I accompanied my companions to Al-Qadisiyya, so they said to me, ‘Come with us and we will stay (waiting) three (days) for you’. So I returned, and there was no expenditure (money) with me. But, Allah<sup>azwj</sup> Eased it and I met up with them’. He<sup>asws</sup> said: ‘The one upon whom is Ordained to be among the delegation (of the Hajj) would be able to perform Hajj even if he was poor; but the one for whom it is not Ordained, would not be able to perform Hajj, and even if he was rich, healthy’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from fro Sayf ibn ‘Amirah from abu Bakr al-Hadramiy who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that I escorted my people to al-Qadisiyah and they said to me, ‘Come with us, we shall wait for three days for you. I returned and I did not have anything for my expenses but Allah made it possible and I joined them. He (the Imam) said, ‘Whoever’ s name is written in the delegation is not able to avoid al-Hajj even if he is poor and whoever’ s name is not written cannot do al-Hajj even if he is rich and in good health.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/148)"
        ],
        "index": 6885,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:30:5",
        "refs": {
          "Mentions": [
            "/books/quran:3:97",
            "/books/quran:3:96"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُوسَى بْنِ عِمْرَانَ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلَهُ رَجُلٌ مِنْ أَهْلِ الْقَدَرِ فَقَالَ يَا ابْنَ رَسُولِ اللَّهِ أَخْبِرْنِي عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطاعَ إِلَيْهِ سَبِيلًا أَ لَيْسَ قَدْ جَعَلَ اللَّهُ لَهُمُ الِاسْتِطَاعَةَ فَقَالَ وَيْحَكَ إِنَّمَا يَعْنِي بِالِاسْتِطَاعَةِ الزَّادَ وَ الرَّاحِلَةَ لَيْسَ اسْتِطَاعَةَ الْبَدَنِ ",
          "فَقَالَ الرَّجُلُ أَ فَلَيْسَ إِذَا كَانَ الزَّادُ وَ الرَّاحِلَةُ فَهُوَ مُسْتَطِيعٌ لِلْحَجِّ فَقَالَ وَيْحَكَ لَيْسَ كَمَا تَظُنُّ قَدْ تَرَى الرَّجُلَ عِنْدَهُ الْمَالُ الْكَثِيرُ أَكْثَرَ مِنَ الزَّادِ وَ الرَّاحِلَةِ فَهُوَ لَا يَحُجُّ حَتَّى يَأْذَنَ اللَّهُ تَعَالَى فِي ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Musa Bin Imran, from Al Husayn Bin Yazeed Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man from the people of (believers in) Destiny asked him<sup>asws</sup>, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! Inform me about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h97\">[3:97]</a> and Hajj to the House is incumbent upon the people for the Sake of Allah, (upon) every one who is able to undertake the journey to it</span>. Is it not so that Allah<sup>azwj</sup> Makes to the capacity to be for them?’ So he<sup>asws</sup> said; ‘Woe be unto you! But rather, what is Meant by the capacity are the provisions and the ride, it is not the ability of the body (only)’. ",
            "So the man said, ‘So is it not so that when there are provisions and the ride, so he would have the capacity for the Hajj?’ So he<sup>asws</sup> said: ‘Woe be unto you! It is not as you are thinking it to be. You have seen the man with whom is the abundant wealth, more than the (required) provision and the ride, but he is not performing Hajj until Allah<sup>azwj</sup> the Exalted Permits him with regards to that’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn ‘Abd Allah has narrated from Musa ibn ‘Imran from al-Husayn ibn Yazid from al-Nawfaliy from al-Sakuniy who has said the following: “Once a man who believed in absolute freedom of will ideology, asked abu ‘Abd Allah, ‘Alayhi al- Salam, ‘O child of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, I have a question. Tell me about the words of Allah, most Majestic, most Glorious, “It is obligatory upon people from Allah to perform al-Hajj who are able to do so.” <a href=\"/#/books/quran:3#h96\">[3:96]</a> Has Allah not given them the ability?’ He (the Imam) said, ‘Fie upon you, ‘ability’ means supplies and transportation and physical well being.’ The man then said, ‘Is it not true that when there is supply and transportation one then is able to perform al-Hajj.’ He (the Imam) said, ‘Fie upon you, it is not the way you think it is. There are times when a man has a great deal of wealth, more than supplies and transportation and still does not do al-Hajj until Allah, most High, grants him permission to do so.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:30",
  "kind": "verse_list"
}