{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 38"
        },
        "path": "/books/al-kafi:4:3:38",
        "titles": {
          "ar": "بَابُ مَا يُجْزِئُ مِنْ حَجَّةِ الْإِسْلَامِ وَ مَا لَا يُجْزِئُ",
          "en": "Chapter 38 – What suffices from the Hajj of Al-Islam and what does not suffice"
        }
      }
    ],
    "index": 981,
    "local_index": 38,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 39"
        },
        "path": "/books/al-kafi:4:3:39",
        "titles": {
          "ar": "بَابُ مَنْ لَمْ يَحُجَّ بَيْنَ خَمْسِ سِنِينَ",
          "en": "Chapter 39 – The one who does not perform Hajj in between five years"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 37"
        },
        "path": "/books/al-kafi:4:3:37",
        "titles": {
          "ar": "بَابُ أَنَّ مَنْ لَمْ يُطِقِ الْحَجَّ بِبَدَنِهِ جَهَّزَ غَيْرَهُ",
          "en": "Chapter 37 – The one who cannot endure the Hajj with his own body, should prepare someone else for it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:38",
    "titles": {
      "ar": "بَابُ مَا يُجْزِئُ مِنْ حَجَّةِ الْإِسْلَامِ وَ مَا لَا يُجْزِئُ",
      "en": "Chapter 38 – What suffices from the Hajj of Al-Islam and what does not suffice"
    },
    "verse_count": 18,
    "verse_start_index": 6908,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/158)"
        ],
        "index": 6909,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/119",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:1",
        "text": [
          " لَوْ أَنَّ رَجُلًا مُعْسِراً أَحَجَّهُ رَجُلٌ كَانَتْ لَهُ حَجَّةٌ فَإِنْ أَيْسَرَ بَعْدُ كَانَ عَلَيْهِ الْحَجُّ وَ كَذَلِكَ النَّاصِبُ إِذَا عَرَفَ فَعَلَيْهِ الْحَجُّ وَ إِنْ كَانَ قَدْ حَجَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, and Sahl Bin Ziyad, altogether from Ahmad Bin Muhammad Bin Abu Nasr, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If a man was insolvent, and a man who has wealth for him gets him to perform Hajj, for him would be a Hajj. So if he becomes affluent afterwards, the Hajj would be (outstanding) upon him. And similar to that is the Hostile One (<span class=\"iTxt\">Nasibi</span>), when he recognises (the Wilayah), so upon him would be the Hajj (outstanding), and even though he had performed Hajj beforehand’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from and Sahl ibn Ziyad all Ahmad ibn Muhammad from ibn abu Nasr from Ali ibn abu Hamzah from abu Basir who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that if a man in a difficult condition financially performs al-Hajj with the help of an affluent man, he has one al-Hajj. If later he himself becomes affluent, he is required to perform al-Hajj. So also is the case of one who has animosity toward ’A’immah, after learning the truth is required to perform al-Hajj, even if he already has performed al-Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/159)"
        ],
        "index": 6910,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1565",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1519",
              "text": "ابْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1497",
              "text": "عِدَّةٍ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/271",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3596",
              "text": "الْفَضْلِ بْنِ عَبْدِ الْمَلِكِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْفَضْلِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:2",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ لَمْ يَكُنْ لَهُ مَالٌ فَحَجَّ بِهِ أُنَاسٌ مِنْ أَصْحَابِهِ أَ قَضَى حَجَّةَ الْإِسْلَامِ قَالَ نَعَمْ فَإِذَا أَيْسَرَ بَعْدَ ذَلِكَ فَعَلَيْهِ أَنْ يَحُجَّ قُلْتُ وَ هَلْ تَكُونُ حَجَّتُهُ تِلْكَ تَامَّةً أَوْ نَاقِصَةً إِذَا لَمْ يَكُنْ حَجَّ مِنْ مَالِهِ قَالَ نَعَمْ يُقْضَى عَنْهُ حَجَّةُ الْإِسْلَامِ وَ تَكُونُ تَامَّةً وَ لَيْسَتْ بِنَاقِصَةٍ وَ إِنْ أَيْسَرَ فَلْيَحُجَّ",
          "قَالَ وَ سُئِلَ عَنِ الرَّجُلِ يَكُونُ لَهُ الْإِبِلُ يُكْرِيهَا فَيُصِيبُ عَلَيْهَا فَيَحُجُّ وَ هُوَ كَرِيٌّ تُغْنِي عَنْهُ حَجَّتُهُ أَوْ يَكُونُ يَحْمِلُ التِّجَارَةَ إِلَى مَكَّةَ فَيَحُجُّ فَيُصِيبُ الْمَالَ فِي تِجَارَتِهِ أَوْ يَضَعُ أَ تَكُونُ حَجَّتُهُ تَامَّةً أَوْ نَاقِصَةً أَوْ لَا تَكُونُ حَتَّى يَذْهَبَ بِهِ إِلَى الْحَجِّ وَ لَا يَنْوِي غَيْرَهُ أَوْ يَكُونُ يَنْوِيهِمَا جَمِيعاً أَ يَقْضِي ذَلِكَ حَجَّتَهُ قَالَ نَعَمْ حَجَّتُهُ تَامَّةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from a number of our companions, from Aban Bin usman, from Al Fazl Bin Abdul Malik, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who did not happen to have wealth for him, so he performed Hajj (with the help of) some people from his companions. Has he fulfilled a Hajj of Al-Islam?’ He<sup>asws</sup> said: ‘Yes. But when he becomes affluent after that, upon him would be that he performs Hajj (again)’. I said, ‘And would that Hajj of his be complete or deficient when he did not perform Hajj from his own wealth?’ He<sup>asws</sup> said: ‘Yes. The Hajj of Al-Islam has been fulfilled from it, and would happen to be complete, and would not be with deficiency; and if he becomes affluent, so let him perform Hajj (again)’. ",
            "He (the narrator) said, ‘And he<sup>asws</sup> was asked about the man who happened to have the camel for him which he has hired. So rides and performs Hajj upon it, and he has hired it. Would it suffice him from his Hajj; or he carries the merchandise to Makkah (for trade), so he performs Hajj, and he earns the wealth in his trading or loses, would his Hajj happen to be complete or deficient, or it would not happen to be until he goes with it to the Hajj not intending something else (e.g. trade), or he intends both of these together, would that fulfill his Hajj?’ He<sup>asws</sup> said: ‘Yes, his Hajj is complete’."
          ],
          "en.sarwar": [
            "2. Humayd ibn Ziyad has narrated from ibn Sama‘ah from A number of our people have narrated from Aban ibn ‘Uthman from al-Fadl ibn ‘Abd al-Malik who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who does not have any assets but people helped him to perform al-Hajj; if it is sufficient for Hajjahta al-Islam. He (the Imam) said, ‘Yes, but if later he becomes affluent, he is required to perform al-Hajj again.’ I then asked, ‘The kind of al-Hajj that he has performed, is it complete or defective because he has not performed it from his own assets?’ He (the Imam) said, ‘Yes, it is sufficient for Hajjahta al-Islam and it will be complete, not defective; however, if he becomes affluent he must perform al-Hajj again.’ He (the Imam) was asked about a man who has camel for hire who finds a passenger and performs al-Hajj while he is hired; is his al-Hajj sufficient Hajjah for him; also if he carries assets for trade to Makkah, then he finds a certain amount of assets from his trade or suffers losses. Is his al-Hajj complete or defective or it is not al-Hajj, unless he goes to Makkah just for al-Hajj without any intention for other things or that he has intention for al-Hajj as well as other matters? Is this kind of al-Hajj sufficient for his al-Hajj? He (the Imam) said, ‘Yes, his al-Hajj is complete.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/160)"
        ],
        "index": 6911,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/143",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:3",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ حَجَّ عَنْ غَيْرِهِ أَ يُجْزِئُهُ ذَلِكَ مِنْ حَجَّةِ الْإِسْلَامِ قَالَ نَعَمْ قُلْتُ حَجَّةُ الْجَمَّالِ تَامَّةٌ أَوْ نَاقِصَةٌ قَالَ تَامَّةٌ قُلْتُ حَجَّةُ الْأَجِيرِ تَامَّةٌ أَمْ نَاقِصَةٌ قَالَ تَامَّةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who performs Hajj on behalf of others, would that suffice him from the Hajj of Al-Islam?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘Is the Hajj of the camelier complete or deficient?’ He<sup>asws</sup> said: ‘Complete’. I said, ‘Is the Hajj of the hired one complete or deficient?’ He<sup>asws</sup> said: ‘Complete’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who performs al-Hajj for someone else; if it is sufficient for Hajjahta al-Islam. He (the Imam) said, ‘Yes it is sufficient.’ I then asked, ‘Is al- Hajj of a camel-man complete or defective?’ He (the Imam) said, ‘It is complete.’ I asked, ‘Is al-Hajj on hire complete or defective?’ He (the Imam) said, ‘It is complete.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/161)"
        ],
        "index": 6912,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/57",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/227",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:4",
        "text": [
          " كَتَبْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَسْأَلُهُ عَنْ رَجُلٍ حَجَّ وَ لَا يَدْرِي وَ لَا يَعْرِفُ هَذَا الْأَمْرَ ثُمَّ مَنَّ اللَّهُ عَلَيْهِ بِمَعْرِفَتِهِ وَ الدَّيْنُونَةِ بِهِ أَ عَلَيْهِ حَجَّةُ الْإِسْلَامِ أَمْ قَدْ قَضَى قَالَ قَدْ قَضَى فَرِيضَةَ اللَّهِ وَ الْحَجُّ أَحَبُّ إِلَيَّ ",
          "وَ عَنْ رَجُلٍ هُوَ فِي بَعْضِ هَذِهِ الْأَصْنَافِ مِنْ أَهْلِ الْقِبْلَةِ نَاصِبٍ مُتَدَيِّنٍ ثُمَّ مَنَّ اللَّهُ عَلَيْهِ فَعَرَفَ هَذَا الْأَمْرَ أَ يُقْضَى عَنْهُ حَجَّةُ الْإِسْلَامِ أَوْ عَلَيْهِ أَنْ يَحُجَّ مِنْ قَابِلٍ قَالَ الْحَجُّ أَحَبُّ إِلَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Umar Bin Azina who said, ",
            "‘I wrote to Abu Abdullah<sup>asws</sup> asking him<sup>asws</sup> about a man who performed Hajj and neither knew nor recognised this matter (Al-Wilayah). Then Allah<sup>azwj</sup> Favoured upon him with his understanding and the Religion with it, is the Hajj of Al-Islam upon him (to perform again), or has it been fulfilled?’ He<sup>asws</sup> said: ‘He has fulfilled an Obligation of Allah<sup>azwj</sup>, and the (repeating of the) Hajj is more beloved to me<sup>asws</sup>’. ",
            "And about a man who is among one of these types from the people of the Qiblah, a devout <span class=\"iTxt\">Nasibi</span>. Then Allah<sup>azwj</sup> Favours upon him, so he recognises this matter (Al-Wilayah). Has the Hajj of Al-Islam been fulfilled from him, or it is (still) upon him that he should perform Hajj the coming year?’ He<sup>asws</sup> said: ‘The (performance of the) Hajj is more beloved to me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "4. Ali has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah who has said the following: “I once wrote to abu ‘Abd Allah, ‘Alayhi al-Salam, and asked him about a man who did not believe in this issue (the Divine Authority of ’A’immah); then Allah granted him understanding and belief in it. Does he still owe Hajjahta al-Islam or it is complete?’ He (the Imam) said, ‘He has completed the obligation from Allah but performing al-Hajj is more beloved to me.’ I asked about a man of the people of al-Qiblah (al-Ka‘bah) who had animosity toward ’A’immah, but Allah granted him understanding and recognized this issue (the Divine Authority of ’A’immah); does this complete his Hajjahta al-Islam or he is required to perform al-Hajj in future? He (the Imam) said, ‘Al-Hajj is more beloved to me.’” "
          ]
        }
      },
      {
        "index": 6913,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/976",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:5",
        "text": [
          " كَتَبَ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ عِمْرَانَ الْهَمَدَانِيُّ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) أَنِّي حَجَجْتُ وَ أَنَا مُخَالِفٌ وَ كُنْتُ صَرُورَةً فَدَخَلْتُ مُتَمَتِّعاً بِالْعُمْرَةِ إِلَى الْحَجِّ قَالَ فَكَتَبَ إِلَيْهِ أَعِدْ حَجَّكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Mahziyar who said, ",
            "‘Ibrahim Bin Muhammad Bin Imran Al-Hamdany wrote to Abu Ja’far<sup>asws</sup>, ‘I performed Hajj, and I am an adversary, and I was <span class=\"iTxt\">Saroura</span> (not having had performed Hajj before). So I included the <span class=\"iTxt\">Tamatto</span> of Umra to the Hajj’. So he<sup>asws</sup> wrote to him: ‘Repeat your Hajj’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Mahziyar from who has said the following: “Ibrahim ibn Muhammad ibn ‘Umar al-Hamadaniy once wrote to abu Ja‘far, ‘Alayhi al-Salam, and asked, ‘I performed al-Hajj and I was against ’A’immah, and it was my first al-Hajj; so I entered Makkah with al-‘Umrah for al-Hajj. He (the Imam) wrote to him the answer, ‘Do your al-Hajj again.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/161)"
        ],
        "index": 6914,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/78",
              "text": "ابْنِ أَبِي نَجْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/280",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/143",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:6",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَمُرُّ مُجْتَازاً يُرِيدُ الْيَمَنَ أَوْ غَيْرَهَا مِنَ الْبُلْدَانِ وَ طَرِيقُهُ بِمَكَّةَ فَيُدْرِكُ النَّاسَ وَ هُمْ يَخْرُجُونَ إِلَى الْحَجِّ فَيَخْرُجُ مَعَهُمْ إِلَى الْمَشَاهِدِ أَ يُجْزِئُهُ ذَلِكَ مِنْ حَجَّةِ الْإِسْلَامِ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Najran, from Aasim Bin Humeyd, from Muawiya Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man is just passing through intending (to go to) Al-Yemen, or somewhere else from the cities, and on his way is Makkah. So he comes across the people who are going out to the Hajj. So he goes out with them to the memorial places. Would that suffice him from the Hajj of Al-Islam?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu Najran from ‘Asem ibn Humayd from Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who passes through Makkah on his way to Yemen or other lands and finds other people traveling for al-Hajj, so he joins them to al-Mashahid (memorial places); if it is sufficient for Hajjahta al-Islam. He (the Imam) said, ‘Yes, it is sufficient.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/161)"
        ],
        "index": 6915,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/201",
              "text": "فَضَالَةَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/143",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:7",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَخْرُجُ فِي تِجَارَةٍ إِلَى مَكَّةَ أَوْ يَكُونُ لَهُ إِبِلٌ فَيُكْرِيهَا حَجَّتُهُ نَاقِصَةٌ أَمْ تَامَّةٌ قَالَ لَا بَلْ حَجَّتُهُ تَامَّةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Muawiya Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man goes out to Makkah regarding business, or there happens to be a camel for him which he has hired. Would his Hajj be deficient or complete?’ He<sup>asws</sup> said: ‘No, but his Hajj is complete’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who goes out for trade to Makkah or that he has a camel that he has given for hire to transport people; if his al-Hajj is complete or defective. He (the Imam) said, ‘No, but it is complete al-Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/162)"
        ],
        "index": 6916,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1608",
              "text": "شِهَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3597",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ أَعْتَقَ عَشِيَّةَ عَرَفَةَ عَبْداً لَهُ أَ يُجْزِئُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3598",
              "text": "الْعَبْدِ حَجَّةُ الْإِسْلَامِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ شِهَابٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ أَعْتَقَ عَشِيَّةَ عَرَفَةَ عَبْداً لَهُ أَ يُجْزِئُ عَنِ الْعَبْدِ حَجَّةُ الْإِسْلَامِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:8",
        "text": [
          " نَعَمْ قُلْتُ فَأُمُّ وَلَدٍ أَحَجَّهَا مَوْلَاهَا أَ يُجْزِئُ عَنْهَا قَالَ لَا قُلْتُ أَ لَهُ أَجْرٌ فِي حَجَّتِهَا قَالَ نَعَمْ ",
          "قَالَ وَ سَأَلْتُهُ عَنِ ابْنِ عَشْرِ سِنِينَ يَحُجُّ قَالَ عَلَيْهِ حَجَّةُ الْإِسْلَامِ إِذَا احْتَلَمَ وَ كَذَلِكَ الْجَارِيَةُ عَلَيْهَا الْحَجُّ إِذَا طَمِثَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Shihab, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who freed a slave of his on the eve of Arafat. Would a Hajj be sufficed from the slave, a Hajj of Al-Islam?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘So if a mother of a child is taken to Hajj by her master, would it suffice from her?’ He<sup>asws</sup> said: ‘No’. I said, ‘Is there any Recompense for him regarding her Hajj?’ He<sup>asws</sup> said: ‘Yes’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a boy of ten years performing Hajj’. He<sup>asws</sup> said: ‘Upon him is the Hajj of Al-Islam when he attains puberty, and similar to that is the girl, upon her would be the Hajj when she (starts) menstruating’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from Shihab who has said the following: “A man set free his slave in the evening of the day of ‘Arafah (ninth of Dhul Hajjah); if the slave’s al- Hajj is sufficient for Hajjahta al-Islam. He (the Imam) said, ‘No, it is not sufficient.’ I then asked, ‘Will he receive any reward for it?’ He (the Imam) said, ‘Yes, he receives rewards.’ I asked about a ten-years old boy and his al-Hajj. He (the Imam), ‘Alayhi al-Salam, said, ‘He owes Hajjahta al-Islam when he grows to adulthood and so also is the case of a young girl.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/162)"
        ],
        "index": 6917,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/976",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/481",
              "text": "مُحَمَّدِ بْنِ الْفُضَيْلِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:9",
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ الثَّانِيَ ( عليه السلام ) عَنِ الصَّبِيِّ مَتَى يُحْرَمُ بِهِ قَالَ إِذَا اثَّغَرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and a number of our companions, from Sahl Bin Ziyad, altogether from Ali Bin Mahziyar, from Muhammad Bin Al Fuzayl who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> about the child, when can he wear <span class=\"iTxt\">Ihraam</span> (Perform Hajj)?’ He<sup>asws</sup> said: ‘When he can safeguard’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and a number of our people have narrated from Sahl ibn Ziyad all from Ali ibn Mahziyar from Muhammad ibn al-Fudayl who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the case of a child when he is made to assume the state of Ihram? He (the Imam) said, ‘When he safeguards and protects.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/162)"
        ],
        "index": 6918,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/376",
              "text": "ابْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/809",
              "text": "ضُرَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ ضُرَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:10",
        "text": [
          " فِي رَجُلٍ خَرَجَ حَاجّاً حَجَّةَ الْإِسْلَامِ فَمَاتَ فِي الطَّرِيقِ فَقَالَ إِنْ مَاتَ فِي الْحَرَمِ فَقَدْ أَجْزَأَتْ عَنْهُ حَجَّةُ الْإِسْلَامِ وَ إِنْ كَانَ مَاتَ دُونَ الْحَرَمِ فَلْيَقْضِ عَنْهُ وَلِيُّهُ حَجَّةَ الْإِسْلَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Zureys, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said regarding a man who went out as a Pilgrim for Hajj of Al-Islam, so he died on the way, so he<sup>asws</sup> said: ‘If he died in ‘Al-Haram’ (the Sanctuary), the Hajj of Al-Islam would suffice from him, but if he had died besides the Sanctuary, so let it his guardian fulfil it on his behalf, the Hajj of Al-Islam’."
          ],
          "en.sarwar": [
            "10. A number of our people have narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from Durays who has said the following: “This is about a man who travels for Hajjahta al-Islam and dies on the way. Abu Ja‘far, ‘Alayhi al- Salam, has said, ‘If he dies in al-Haram (the sacred area), it is sufficient for Hajjahta al-Islam. However, if he dies outside al-Haram (the sacred area), then his guardians should complete, Qada’ (compensatory for) Hajjahta al-Islam, on his behalf.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/163)"
        ],
        "index": 6919,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/589",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/376",
              "text": "ابْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/518",
              "text": "بُرَيْدٍ الْعِجْلِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ بُرَيْدٍ الْعِجْلِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:11",
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ خَرَجَ حَاجّاً وَ مَعَهُ جَمَلٌ لَهُ وَ نَفَقَةٌ وَ زَادٌ فَمَاتَ فِي الطَّرِيقِ قَالَ إِنْ كَانَ صَرُورَةً ثُمَّ مَاتَ فِي الْحَرَمِ فَقَدْ أَجْزَأَ عَنْهُ حَجَّةُ الْإِسْلَامِ وَ إِنْ كَانَ مَاتَ وَ هُوَ صَرُورَةٌ قَبْلَ أَنْ يُحْرِمَ جُعِلَ جَمَلُهُ وَ زَادُهُ وَ نَفَقَتُهُ وَ مَا مَعَهُ فِي حَجَّةِ الْإِسْلَامِ فَإِنْ فَضَلَ مِنْ ذَلِكَ شَيْ‏ءٌ فَهُوَ لِلْوَرَثَةِ إِنْ لَمْ يَكُنْ عَلَيْهِ دَيْنٌ ",
          "قُلْتُ أَ رَأَيْتَ إِنْ كَانَتِ الْحَجَّةُ تَطَوُّعاً ثُمَّ مَاتَ فِي الطَّرِيقِ قَبْلَ أَنْ يُحْرِمَ لِمَنْ يَكُونُ جَمَلُهُ وَ نَفَقَتُهُ وَ مَا مَعَهُ قَالَ يَكُونُ جَمِيعُ مَا مَعَهُ وَ مَا تَرَكَ لِلْوَرَثَةِ إِلَّا أَنْ يَكُونَ عَلَيْهِ دَيْنٌ فَيُقْضَى عَنْهُ أَوْ يَكُونَ أَوْصَى بِوَصِيَّةٍ فَيُنْفَذَ ذَلِكَ لِمَنْ أَوْصَى لَهُ وَ يُجْعَلَ ذَلِكَ مِنْ ثُلُثِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Bureyd Al Ijaly who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about a man who went out as a pilgrim and with him was a camel of his, and expense money, and provisions. So he died on the way’. He<sup>asws</sup> said: ‘If he was <span class=\"iTxt\">Saroura</span> (not having had performed Hajj), then died in <span class=\"iTxt\">Ihraam</span>, so it has sufficed from him for Hajj of Al-Islam; but if he died and he was <span class=\"iTxt\">Saroura</span> (not having had performed Hajj) before he wore <span class=\"iTxt\">Ihraam</span>, his camel and his provisions and his expenses would be made to be for a Hajj of Al-Islam. So if there is something excess from that, so it would be for the inheritors, if there do no happen to be debts upon him’.",
            "I said, ‘What is your<sup>asws</sup> view if the Hajj was optional, then he died on the way before he wore <span class=\"iTxt\">Ihraam</span>, for whom would be his camel, and his expense money, and whatever was with him?’ He<sup>asws</sup> said: ‘Whatever was with him, and whatever he left would happen to be for his inheritors, except if there happen to be debts upon him, so these would be fulfilled on his behalf; or if he had bequeathed with a bequest, so that bequest would be established for the one to whom it had been bequeathed to, and that would be made to be from his one-third (of his wealth/belongings)’."
          ],
          "en.sarwar": [
            "11. Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from Burayd al-‘Ijliy who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about a man who travels for al-Hajj. He has a camel with him and his supplies, but he dies on the way. He (the Imam) said, ‘If it was his first al-Hajj and has died in al-Haram (the sacred area), it is sufficient for Hajjahta al-Islam. If he dies, being his first al- Hajj, before assuming the state of Ihram, his camel, supplies and things with him are applied to his Hajjahta al-Islam, if anything is left extra it is for his heirs, if there is no loan on him.’ I then asked, ‘What happens if it was an optional al-Hajj and he dies on the way before assuming the state of Ihram, who will have his camel, and things with him?’ He (the Imam) said, ‘All things belonging to him go to his heirs, unless there is loan on him which is paid on his behalf or if his will says to give something to someone, in which case it is paid from one-third of his legacy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/164)"
        ],
        "index": 6920,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1334",
              "text": "رِفَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِفَاعَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:12",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ نَذَرَ أَنْ يَمْشِيَ إِلَى بَيْتِ اللَّهِ الْحَرَامِ أَ يُجْزِئُهُ ذَلِكَ عَنْ حَجَّةِ الْإِسْلَامِ قَالَ نَعَمْ قُلْتُ وَ إِنْ حَجَّ عَنْ غَيْرِهِ وَ لَمْ يَكُنْ لَهُ مَالٌ وَ قَدْ نَذَرَ أَنْ يَحُجَّ مَاشِياً أَ يُجْزِئُ ذَلِكَ عَنْهُ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Rafa’at who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who vowed that he would walk to the Sacred House of Allah<sup>azwj</sup>, would that suffice from the Hajj of Al-Islam?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘And if he performs Hajj on behalf of others and there does not happen to be wealth for him, and he had vowed that he would be performing Hajj walking, would that suffice from him?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Rifa’ah who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about a man who has made a vow to walk to Bayt Allah al-Haram (the Sacred House of Allah): if it is sufficient for Hajjahta al-Islam. He (the Imam) said, ‘Yes, it is sufficient.’ I then asked, ‘What happens if he performs al-Hajj for others and he does not have any assets and has vowed to perform al-Hajj on foot? Is this kind of al-Hajj sufficient? He (the Imam) said, ‘Yes, it is sufficient.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/165)"
        ],
        "index": 6921,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/224",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3599",
              "text": "عَامِرِ بْنِ عَمِيرَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ عَامِرِ بْنِ عَمِيرَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:13",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) بَلَغَنِي عَنْكَ أَنَّكَ قُلْتَ لَوْ أَنَّ رَجُلًا مَاتَ وَ لَمْ يَحُجَّ حَجَّةَ الْإِسْلَامِ فَحَجَّ عَنْهُ بَعْضُ أَهْلِهِ أَجْزَأَ ذَلِكَ عَنْهُ فَقَالَ نَعَمْ أَشْهَدُ بِهَا عَنْ أَبِي أَنَّهُ حَدَّثَنِي أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَبِي مَاتَ وَ لَمْ يَحُجَّ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حُجَّ عَنْهُ فَإِنَّ ذَلِكَ يُجْزِئُ عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ibn Muskan, from Aamir Bin Ameyra who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘It has reached me from you<sup>asws</sup> that you<sup>asws</sup> said, ‘If a man dies and had not performed Hajj, a Hajj of Al-Islam, so one of his family members performs Hajj on his behalf, that would suffice from him’. So he<sup>asws</sup> said: ‘Yes. I<sup>asws</sup> have it (the Hadeeth) from my<sup>asws</sup> father<sup>asws</sup>. He<sup>asws</sup> narrated to me<sup>asws</sup> that a man came over to Rasool-Allah<sup>saww</sup>, so he said, ‘O Rasool-Allah<sup>saww</sup>! My father died and did not perform Hajj’. So Rasool-Allah<sup>saww</sup> said to him: ‘Perform Hajj on his behalf, for that would suffice him from it’."
          ],
          "en.sarwar": [
            "13. Abu Ali ai-Ash’ariy has narrated from Muhammad ibn ‘Abd af-Jabbar from Safwan ibn Yahya from ibn Muskan from ‘Amir ibn ‘Amirah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of the issue that I had heard from him (the Imam) and he (the Imam) had said, ‘If a man dies owing Hajjahta al-Islam and a certain relative performs al-Hajj on his behalf it is sufficient.’ He (the Imam) said, ‘Yes, I can testify that my father, ‘Alayhi al-Salam, narrated to me from the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, that a man came to him and said, “O Messenger of Allah, my father has died without performing al-Hajj.” The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, ‘Perform al-Hajj on his behalf; it is sufficient for him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/165)"
        ],
        "index": 6922,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2638",
              "text": "حَكَمِ بْنِ حُكَيْمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ صَفْوَانَ عَنْ حَكَمِ بْنِ حُكَيْمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:14",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنْسَانٌ هَلَكَ وَ لَمْ يَحُجَّ وَ لَمْ يُوصِ بِالْحَجِّ فَأَحَجَّ عَنْهُ بَعْضُ أَهْلِهِ رَجُلًا أَوِ امْرَأَةً هَلْ يُجْزِئُ ذَلِكَ وَ يَكُونُ قَضَاءً عَنْهُ وَ يَكُونُ الْحَجُّ لِمَنْ حَجَّ وَ يُؤْجَرُ مَنْ أَحَجَّ عَنْهُ فَقَالَ إِنْ كَانَ الْحَاجُّ غَيْرَ صَرُورَةٍ أَجْزَأَ عَنْهُمَا جَمِيعاً وَ أُجِرَ الَّذِي أَحَجَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Safwan, from Hakam Bin Hukeym who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A person died and had not performed Hajj and did not bequeath with the Hajj to be performed. So one of his family members, a man or a woman performs Hajj on his behalf. Would that suffice him, and become a payback (Qazaa) from it, and the Hajj would happen to be for the one who performed Hajj and paid for the one to perform the Hajj on his behalf?’ So he<sup>asws</sup> said: ‘If the pilgrim was not <span class=\"iTxt\">Saroura</span> (not having had performed Hajj), it would suffice from both of them together, and the Recompense would be for the one who performed his Hajj’."
          ],
          "en.sarwar": [
            "14. It is narrated from him (narrator of previous Hadith) from Safwan from Hakam ibn Hakam who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who dies without performing al-Hajj and without a will to perform al-Hajj on his behalf. However, a certain one of his relatives, male or female, enables someone to perform al-Hajj on his behalf; if it is sufficient for his al-Hajj, or al-Hajj belongs to one who has enabled and the one who performs al-Hajj receives reward. He (the Imam) said, ‘If it is his first al-Hajj it is sufficient for both of them and the enabler receives reward.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/166)"
        ],
        "index": 6923,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/787",
              "text": "فَضَالَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1334",
              "text": "رِفَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ عَنْ رِفَاعَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:15",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ يَمُوتُ وَ لَمْ يَحُجَّ حَجَّةَ الْإِسْلَامِ وَ لَمْ يُوصِ بِهَا أَ يُقْضَى عَنْهُ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat, from Rafa’at who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who dies and did not perform Hajj, a Hajj of Al-Islam, and did not bequeath with it, does it have to be fulfilled on his behalf?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "15. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah from Rifa’ah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who dies and has not performed Hajjahta al-Islam and has not made any will about it if it can be carried out on his behalf. He (the Imam) said, ‘Yes, it is permissible.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/166)"
        ],
        "index": 6924,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/327",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1334",
              "text": "رِفَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ رِفَاعَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:16",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ وَ الْمَرْأَةِ يَمُوتَانِ وَ لَمْ يَحُجَّا أَ يُقْضَى عَنْهُمَا حَجَّةُ الْإِسْلَامِ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Rafa’at who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man and the woman both dying and had not performed Hajj, does it have to be fulfilled from both of them, a Hajj of Al-Islam?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "16. A number of our people have narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali from Rifa’ah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man and a woman who die without performing al-Hajj; if Hajjahta al-Islam can be performed on their behalf. He (the Imam) said, ‘Yes, it is permissible.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/166)"
        ],
        "index": 6925,
        "local_index": 17,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/84",
              "text": "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:17",
        "text": [
          " سُئِلَ عَنْ رَجُلٍ مَاتَ وَ لَهُ ابْنٌ لَمْ يَدْرِ أَ حَجَّ أَبُوهُ أَمْ لَا قَالَ يَحُجُّ عَنْهُ فَإِنْ كَانَ أَبُوهُ قَدْ حَجَّ كُتِبَ لِأَبِيهِ نَافِلَةً وَ لِلِابْنِ فَرِيضَةً وَ إِنْ كَانَ أَبُوهُ لَمْ يَحُجَّ كُتِبَ لِأَبِيهِ فَرِيضَةً وَ لِلِابْنِ نَافِلَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about a man who died and for him was a son who did not know whether his father had performed Hajj or not’. He<sup>asws</sup> said: ‘He should perform Hajj on his behalf. So if it was such that his father had performed Hajj, an optional (Hajj) would be Written for his father, and for the son, the Obligatory (Hajj); and if it was such that his father had not performed Hajj, an Obligatory (Hajj) would be Written for his father, and for the son, the optional (Hajj)’."
          ],
          "en.sarwar": [
            "17. Muhammad ibn Yahya has narrated from in a marfu‘ manner who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who dies and has a son who does not know if his father has performed al-Hajj or not. He (the Imam) said, ‘He performs al-Hajj on his behalf, if his father has performed al-Hajj, it is written as optional al-Hajj for him and an obligatory al-Hajj for his son; and if his father has not performed al-Hajj, it is written obligatory for his father and optional for the son.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/167)"
        ],
        "index": 6926,
        "local_index": 18,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/659",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/660",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2064",
              "text": "مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:38:18",
        "text": [
          " لَوْ أَنَّ عَبْداً حَجَّ عَشْرَ حِجَجٍ كَانَتْ عَلَيْهِ حَجَّةُ الْإِسْلَامِ أَيْضاً إِذَا اسْتَطَاعَ إِلَى ذَلِكَ سَبِيلًا وَ لَوْ أَنَّ غُلَاماً حَجَّ عَشْرَ حِجَجٍ ثُمَّ احْتَلَمَ كَانَتْ عَلَيْهِ فَرِيضَةُ الْإِسْلَامِ وَ لَوْ أَنَّ مَمْلُوكاً حَجَّ عَشْرَ حِجَجٍ ثُمَّ أُعْتِقَ كَانَتْ عَلَيْهِ فَرِيضَةُ الْإِسْلَامِ إِذَا اسْتَطَاعَ إِلَيْهِ سَبِيلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman Al Asamma, from Misma’a Bin Abdul Malik, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If a servant performs Hajj ten times, there would (still) be upon him a Hajj of Al-Islam as well, when he has the capacity to that. And if a young boy were to perform Hajj ten times, then attains puberty, upon him would be an Obligation of Al-Islam, and if an owned slave performs Hajj ten times, then is freed, upon him would be an Obligation of Al-Islam, when he has the capacity for it’."
          ],
          "en.sarwar": [
            "18. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan al-Shammun from ‘Abd Allah ibn ‘Abd al-Rahman al-Asamm from Misma’ ibn ‘Abd al-Malik who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Even if a servant of Allah performs ten al-Hajj, he owes obligatory Hajjahta al-Islam also; if he is able to perform Hajjahta al-Islam. If a boy performs ten al- Hajj ah, he owes obligatory Hajjahta al-Islam also; if he is able to perform Hajjahta al-Islam when he becomes an adult. If a slave performs ten al-Hajj ah, then is set free that person owes obligatory Hajjahta al-Islam also, if he is able to perform Hajjahta al-Islam.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:38",
  "kind": "verse_list"
}