{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 4"}, "path": "/books/al-kafi:4:3:4", "titles": {"ar": "بَابٌ فِي حَجِّ آدَمَ ( عليه السلام )", "en": "Chapter 4 – Regarding the Hajj of Adam<sup>as</sup>"}}], "index": 947, "local_index": 4, "part_type": "Chapter", "path": "/books/al-kafi:4:3:4", "titles": {"ar": "بَابٌ فِي حَجِّ آدَمَ ( عليه السلام )", "en": "Chapter 4 – Regarding the Hajj of Adam<sup>as</sup>"}, "verse_count": 6, "verse_start_index": 6681, "verses": [{"index": 6682, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:4:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا أَصَابَ آدَمُ وَ زَوْجَتُهُ الْحِنْطَةَ أَخْرَجَهُمَا مِنَ الْجَنَّةِ وَ أَهْبَطَهُمَا إِلَى الْأَرْضِ فَأُهْبِطَ آدَمُ عَلَى الصَّفَا وَ أُهْبِطَتْ حَوَّاءُ عَلَى الْمَرْوَةِ وَ إِنَّمَا سُمِّيَ صَفًا لِأَنَّهُ شُقَّ لَهُ مِنِ اسْمِ آدَمَ الْمُصْطَفَى وَ ذَلِكَ لِقَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ اصْطَفى آدَمَ وَ نُوحاً وَ سُمِّيَتِ الْمَرْوَةُ مَرْوَةً لِأَنَّهُ شُقَّ لَهَا مِنِ اسْمِ الْمَرْأَةِ\nفَقَالَ آدَمُ مَا فُرِّقَ بَيْنِي وَ بَيْنَهَا إِلَّا أَنَّهَا لَا تَحِلُّ لِي وَ لَوْ كَانَتْ تَحِلُّ لِي هَبَطَتْ مَعِي عَلَى الصَّفَا وَ لَكِنَّهَا حُرِّمَتْ عَلَيَّ مِنْ أَجْلِ ذَلِكَ وَ فُرِّقَ بَيْنِي وَ بَيْنَهَا\nفَمَكَثَ آدَمُ مُعْتَزِلًا حَوَّاءَ فَكَانَ يَأْتِيهَا نَهَاراً فَيَتَحَدَّثُ عِنْدَهَا عَلَى الْمَرْوَةِ فَإِذَا كَانَ اللَّيْلُ وَ خَافَ أَنْ تَغْلِبَهُ نَفْسُهُ يَرْجِعُ إِلَى الصَّفَا فَيَبِيتُ عَلَيْهِ وَ لَمْ يَكُنْ لآِدَمَ أُنْسٌ غَيْرَهَا وَ لِذَلِكَ سُمِّينَ النِّسَاءَ مِنْ أَجْلِ أَنَّ حَوَّاءَ كَانَتْ أُنْساً لآِدَمَ\nلَا يُكَلِّمُهُ اللَّهُ وَ لَا يُرْسِلُ إِلَيْهِ رَسُولًا ثُمَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ مَنَّ عَلَيْهِ بِالتَّوْبَةِ وَ تَلَقَّاهُ بِكَلِمَاتٍ فَلَمَّا تَكَلَّمَ بِهَا تَابَ اللَّهُ عَلَيْهِ وَ بَعَثَ إِلَيْهِ جَبْرَئِيلَ ( عليه السلام ) فَقَالَ السَّلَامُ عَلَيْكَ يَا آدَمُ التَّائِبُ مِنْ خَطِيئَتِهِ الصَّابِرُ لِبَلِيَّتِهِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَرْسَلَنِي إِلَيْكَ لِأُعَلِّمَكَ الْمَنَاسِكَ الَّتِي تَطْهُرُ بِهَا \nفَأَخَذَ بِيَدِهِ فَانْطَلَقَ بِهِ إِلَى مَكَانِ الْبَيْتِ وَ أَنْزَلَ اللَّهُ عَلَيْهِ غَمَامَةً فَأَظَلَّتْ مَكَانَ الْبَيْتِ وَ كَانَتِ الْغَمَامَةُ بِحِيَالِ الْبَيْتِ الْمَعْمُورِ فَقَالَ يَا آدَمُ خُطَّ بِرِجْلِكَ حَيْثُ أَظَلَّتْ عَلَيْكَ هَذِهِ الْغَمَامَةُ فَإِنَّهُ سَيُخْرِجُ لَكَ بَيْتاً مِنْ مَهَاةٍ يَكُونُ قِبْلَتَكَ وَ قِبْلَةَ عَقِبِكَ مِنْ بَعْدِكَ \nفَفَعَلَ آدَمُ ( عليه السلام ) وَ أَخْرَجَ اللَّهُ لَهُ تَحْتَ الْغَمَامَةِ بَيْتاً مِنْ مَهَاةٍ وَ أَنْزَلَ اللَّهُ الْحَجَرَ الْأَسْوَدَ وَ كَانَ أَشَدَّ بَيَاضاً مِنَ اللَّبَنِ وَ أَضْوَأَ مِنَ الشَّمْسِ وَ إِنَّمَا اسْوَدَّ لِأَنَّ الْمُشْرِكِينَ تَمَسَّحُوا بِهِ فَمِنْ نَجَسِ الْمُشْرِكِينَ اسْوَدَّ الْحَجَرُ وَ أَمَرَهُ جَبْرَئِيلُ ( عليه السلام ) أَنْ يَسْتَغْفِرَ اللَّهَ مِنْ ذَنْبِهِ عِنْدَ جَمِيعِ الْمَشَاعِرِ وَ يُخْبِرُهُ أَنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ غَفَرَ لَهُ وَ أَمَرَهُ أَنْ يَحْمِلَ حَصَيَاتِ الْجِمَارِ مِنَ الْمُزْدَلِفَةِ\nفَلَمَّا بَلَغَ مَوْضِعَ الْجِمَارِ تَعَرَّضَ لَهُ إِبْلِيسُ فَقَالَ لَهُ يَا آدَمُ أَيْنَ تُرِيدُ فَقَالَ لَهُ جَبْرَئِيلُ ( عليه السلام ) لَا تُكَلِّمْهُ وَ ارْمِهِ بِسَبْعِ حَصَيَاتٍ وَ كَبِّرْ مَعَ كُلِّ حَصَاةٍ فَفَعَلَ آدَمُ ( عليه السلام ) حَتَّى فَرَغَ مِنْ رَمْيِ الْجِمَارِ\nوَ أَمَرَهُ أَنْ يُقَرِّبَ الْقُرْبَانَ وَ هُوَ الْهَدْيُ قَبْلَ رَمْيِ الْجِمَارِ وَ أَمَرَهُ أَنْ يَحْلِقَ رَأْسَهُ تَوَاضُعاً لِلَّهِ عَزَّ وَ جَلَّ فَفَعَلَ آدَمُ ذَلِكَ\nثُمَّ أَمَرَهُ بِزِيَارَةِ الْبَيْتِ وَ أَنْ يَطُوفَ بِهِ سَبْعاً وَ يَسْعَى بَيْنَ الصَّفَا وَ الْمَرْوَةِ أُسْبُوعاً يَبْدَأُ بِالصَّفَا وَ يَخْتِمُ بِالْمَرْوَةِ\nثُمَّ يَطُوفَ بَعْدَ ذَلِكَ أُسْبُوعاً بِالْبَيْتِ وَ هُوَ طَوَافُ النِّسَاءِ لَا يَحِلُّ لِلْمُحْرِمِ أَنْ يُبَاضِعَ حَتَّى يَطُوفَ طَوَافَ النِّسَاءِ فَفَعَلَ آدَمُ ( عليه السلام )\nفَقَالَ لَهُ جَبْرَئِيلُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ غَفَرَ ذَنْبَكَ وَ قَبِلَ تَوْبَتَكَ وَ أَحَلَّ لَكَ زَوْجَتَكَ فَانْطَلَقَ آدَمُ وَ غُفِرَ لَهُ ذَنْبُهُ وَ قُبِلَتْ مِنْهُ تَوْبَتُهُ وَ حَلَّتْ لَهُ زَوْجَتُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Salih Bin Abu Hammad, from Al Husayn Bin Yazeed, from Al Hassan Bin Ali Bin Abu Hamza, \n(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>, from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic, when Adam<sup>as</sup> and his<sup>as</sup> wife attained from the wheat, Exited both of them<sup>as</sup> from the Paradise, and Caused them to descend to the earth. So Adam<sup>as</sup> descended upon Al-Safa<sup>as</sup>, and Hawwa<sup>as</sup> descended upon Al-Marwa, and rather, Al-Safa was named as ‘Safa; because it was derived for him<sup>as</sup>, from the name of Adam<sup>as</sup>, the chosen one (Al-Mustafa), and that is due to the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[3:33] Surely Allah Chose Adam and Noah</span>. And Al-Marwa was named ‘Marwa’ because it was derived for her<sup>as</sup>, from the name ‘Al-Mar’a’ (The woman).\nSo Adam<sup>as</sup> said: ‘There would not have been a separation between me<sup>as</sup> and her<sup>as</sup>, except that she is not Permissible unto me<sup>as</sup>, and had she<sup>as</sup> been Permissible unto me<sup>as</sup>, she<sup>as</sup> would have descended with me<sup>as</sup> upon Al-Safa, but she<sup>as</sup> is Forbidden unto me<sup>as</sup> due to the reason of that, and separation has been effected between me<sup>as</sup> and her<sup>as</sup>’.\nThus, Adam<sup>as</sup> remained isolated from Hawwa<sup>as</sup>. So he<sup>as</sup> used to go to her at daytime, discussing with her<sup>as</sup> upon Al-Marwa. So whenever it was the night, and he<sup>as</sup> feared of being overcome by his<sup>as</sup> self (desire), would return to Al-Safa, and he<sup>as</sup> would sleep upon it. And, Adam<sup>as</sup> did not have a comfort  apart from her<sup>as</sup>, and due to that, the woman (Al-Nisa) has been named as such, as Hawwa<sup>as</sup> was the ‘Ansa’ (comfort) for Adam<sup>as</sup>. \nNeither did Allah<sup>azwj</sup> Spoke to him<sup>as</sup>, nor did He<sup>azwj</sup> Send a Messenger to him<sup>as</sup>. Then, Allah<sup>azwj</sup> Mighty and Majestic Favoured upon him<sup>as</sup> with the repentance, and Dictated him<sup>as</sup> certain words. So when he<sup>as</sup> spoke by these, Allah<sup>azwj</sup> Turned towards him<sup>as</sup> (with Mercy) and Sent Jibraeel<sup>as</sup> unto him<sup>as</sup>’. So he<sup>as</sup> said: ‘Greeting be unto you<sup>as</sup>, O Adam<sup>as</sup>, the repentant one from his<sup>as</sup> error, the patient upon his<sup>as</sup> tribulation. Allah<sup>azwj</sup> Mighty and Majestic Sent me<sup>as</sup> to you<sup>as</sup>, to teach you<sup>as</sup> the rituals through which you<sup>as</sup> can be purified. \nSo he<sup>as</sup> grabbed his<sup>as</sup> hand and went with him<sup>as</sup> to the place of the House (Kaaba), and Allah<sup>azwj</sup> Sent down the cloud upon him<sup>as</sup>. So it shaded the place of the House, and the cloud used to be by the side of the Bayt Al-Ma’mour (The oft-frequented House). So he<sup>as</sup> said: ‘O Adam<sup>as</sup>! Mark with your<sup>as</sup> foot where this cloud has shaded upon you<sup>as</sup>, for a house of white gem would be extracted for you, becoming your<sup>as</sup> Qiblah (direction), and a Qiblah of your<sup>as</sup> offspring from after you<sup>as</sup>’.\nSo Adam<sup>as</sup> did so, and Allah<sup>azwj</sup> Brought out a House of white gem for him<sup>as</sup> beneath the cloud, and Allah<sup>azwj</sup> Sent down the Black Stone, and it used to be intensely whiter than the milk, and more illuminating than the sun. But rather, it turned black because the Polytheists used to wipe with it, thus it is from the filth of the Polytheists, the Stone turned black. And, Jibraeel<sup>as</sup> instructed him<sup>as</sup> that he<sup>as</sup> should seek Forgiveness of Allah<sup>azwj</sup> from his<sup>as</sup> sins at the entirety of the Signs, and informed him<sup>as</sup> that Allah<sup>azwj</sup> Mighty and Majestic had Forgiven him<sup>asws</sup>, and instructed him<sup>as</sup> to carry a number of pebbles of stones from Al-Muzdalifa.\nSo when he<sup>as</sup> reached the place of the pebbles, Iblees<sup>la</sup> appeared to him<sup>as</sup>, and he<sup>la</sup> said to him<sup>as</sup>, ‘O Adam<sup>la</sup>! Where are you<sup>asws</sup> intending (to go to)?’ So Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘Do not speak to him<sup>la</sup>, and pelt him<sup>as</sup> with seven pebbles, and exclaim <span class=\"iTxt\">Takbeer </span>with each pebble’. So Adam<sup>as</sup> did it, until he<sup>as</sup> was free from pelting the stones.\nAnd he<sup>as</sup> instructed him<sup>as</sup> that he<sup>as</sup> should offer the sacrifice, and it is the sacrificial animal, before the pelting of the stones. And he<sup>as</sup> instructed him<sup>as</sup> that he<sup>as</sup> should shave his<sup>as</sup> head, in reverence to Allah<sup>azwj</sup> Mighty and Majestic. So Adam<sup>as</sup> did that.\nThen he<sup>as</sup> instructed him<sup>as</sup> with the visitation of the House (Kaaba), and that he<sup>as</sup> should circumambulate with it seven (times), and he<sup>as</sup> should walk briskly between Al-Safa and Al-Marwa, seven (times), beginning with Al-Safa and ending at Al-Marwa. \nThen, after that, he<sup>as</sup> circumambulated seven (times) by the House (Kaaba), and it is the circumambulation of the wife (<span class=\"iTxt\">Tawaaf Al-Nisa</span>), it not being Permissible for the one in Ihraam that he should approach his wife until he has done the <span class=\"iTxt\">Tawaaf Al-Nisa</span>. So Adam<sup>as</sup> did so.   \nSo Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘Allah<sup>azwj</sup> Mighty and Majestic has Forgiven your<sup>as</sup> sins, and Accepted your<sup>as</sup> repentance, and Permitted your<sup>as</sup> wife for you<sup>as</sup>’. So Adam<sup>as</sup> went, and his<sup>as</sup> sins were Forgiven for him<sup>as</sup>, and his<sup>as</sup> repentance having been Accepted from him<sup>as</sup>, and his<sup>as</sup> wife having been Permitted unto him<sup>as</sup>’."}]}, {"index": 6683, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:4:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْقَلَانِسِيِّ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَمِّهِ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ آدَمَ ( عليه السلام ) لَمَّا أُهْبِطَ إِلَى الْأَرْضِ أُهْبِطَ عَلَى الصَّفَا وَ لِذَلِكَ سُمِّيَ الصَّفَا لِأَنَّ الْمُصْطَفَى هَبَطَ عَلَيْهِ فَقُطِعَ لِلْجَبَلِ اسْمٌ مِنِ اسْمِ آدَمَ يَقُولُ اللَّهُ عَزَّ وَ جَلَّ إِنَّ اللَّهَ اصْطَفى آدَمَ وَ نُوحاً وَ آلَ إِبْراهِيمَ وَ آلَ عِمْرانَ عَلَى الْعالَمِينَ\nوَ أُهْبِطَتْ حَوَّاءُ عَلَى الْمَرْوَةِ وَ إِنَّمَا سُمِّيَتِ الْمَرْوَةُ مَرْوَةً لِأَنَّ الْمَرْأَةَ هَبَطَتْ عَلَيْهَا فَقُطِعَ لِلْجَبَلِ اسْمٌ مِنِ اسْمِ الْمَرْأَةِ وَ هُمَا جَبَلَانِ عَنْ يَمِينِ الْكَعْبَةِ وَ شِمَالِهَا \nفَقَالَ آدَمُ حِينَ فُرِّقَ بَيْنَهُ وَ بَيْنَ حَوَّاءَ مَا فُرِّقَ بَيْنِي وَ بَيْنَ زَوْجَتِي إِلَّا وَ قَدْ حُرِّمَتْ عَلَيَّ فَاعْتَزَلَهَا وَ كَانَ يَأْتِيهَا بِالنَّهَارِ فَيَتَحَدَّثُ إِلَيْهَا فَإِذَا كَانَ اللَّيْلَةُ خَشِيَ أَنْ تَغْلِبَهُ نَفْسُهُ عَلَيْهَا رَجَعَ فَبَاتَ عَلَى الصَّفَا وَ لِذَلِكَ سُمِّيَتِ النِّسَاءُ لِأَنَّهُ لَمْ يَكُنْ لآِدَمَ أُنْسٌ غَيْرَهَا\nفَمَكَثَ آدَمُ بِذَلِكَ مَا شَاءَ اللَّهُ أَنْ يَمْكُثَ لَا يُكَلِّمُهُ اللَّهُ وَ لَا يُرْسِلُ إِلَيْهِ رَسُولًا وَ الرَّبُّ سُبْحَانَهُ يُبَاهِي بِصَبْرِهِ الْمَلَائِكَةَ فَلَمَّا بَلَغَ الْوَقْتُ الَّذِي يُرِيدُ اللَّهُ عَزَّ وَ جَلَّ أَنْ يَتُوبَ عَلَى آدَمَ فِيهِ أَرْسَلَ إِلَيْهِ جَبْرَئِيلَ ( عليه السلام ) فَقَالَ السَّلَامُ عَلَيْكَ يَا آدَمُ الصَّابِرُ لِبَلِيَّتِهِ التَّائِبُ عَنْ خَطِيئَتِهِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ بَعَثَنِي إِلَيْكَ لِأُعَلِّمَكَ الْمَنَاسِكَ الَّتِي يُرِيدُ اللَّهُ أَنْ يَتُوبَ عَلَيْكَ بِهَا\nفَأَخَذَ جَبْرَئِيلُ ( عليه السلام ) بِيَدِ آدَمَ ( عليه السلام ) حَتَّى أَتَى بِهِ مَكَانَ الْبَيْتِ فَنَزَلَ غَمَامٌ مِنَ السَّمَاءِ فَأَظَلَّ مَكَانَ الْبَيْتِ فَقَالَ جَبْرَئِيلُ ( عليه السلام ) يَا آدَمُ خُطَّ بِرِجْلِكَ حَيْثُ أَظَلَّ الْغَمَامُ فَإِنَّهُ قِبْلَةٌ لَكَ وَ لآِخِرِ عَقِبِكَ مِنْ وُلْدِكَ فَخَطَّ آدَمُ بِرِجْلِهِ حَيْثُ أَظَلَّ الْغَمَامُ\nثُمَّ انْطَلَقَ بِهِ إِلَى مِنًى فَأَرَاهُ مَسْجِدَ مِنًى فَخَطَّ بِرِجْلِهِ وَ مَدَّ خِطَّةَ الْمَسْجِدِ الْحَرَامِ بَعْدَ مَا خَطَّ مَكَانَ الْبَيْتِ\nثُمَّ انْطَلَقَ بِهِ مِنْ مِنًى إِلَى عَرَفَاتٍ فَأَقَامَهُ عَلَى الْمُعَرَّفِ فَقَالَ إِذَا غَرَبَتِ الشَّمْسُ فَاعْتَرِفْ بِذَنْبِكَ سَبْعَ مَرَّاتٍ وَ سَلِ اللَّهَ الْمَغْفِرَةَ وَ التَّوْبَةَ سَبْعَ مَرَّاتٍ فَفَعَلَ ذَلِكَ آدَمُ ( عليه السلام ) وَ لِذَلِكَ سُمِّيَ الْمُعَرَّفَ لِأَنَّ آدَمَ اعْتَرَفَ فِيهِ بِذَنْبِهِ وَ جُعِلَ سُنَّةً لِوُلْدِهِ يَعْتَرِفُونَ بِذُنُوبِهِمْ كَمَا اعْتَرَفَ آدَمُ وَ يَسْأَلُونَ التَّوْبَةَ كَمَا سَأَلَهَا آدَمُ\nثُمَّ أَمَرَهُ جَبْرَئِيلُ فَأَفَاضَ مِنْ عَرَفَاتٍ فَمَرَّ عَلَى الْجِبَالِ السَّبْعَةِ فَأَمَرَهُ أَنْ يُكَبِّرَ عِنْدَ كُلِّ جَبَلٍ أَرْبَعَ تَكْبِيرَاتٍ فَفَعَلَ ذَلِكَ آدَمُ حَتَّى انْتَهَى إِلَى جَمْعٍ فَلَمَّا انْتَهَى إِلَى جَمْعٍ ثُلُثَ اللَّيْلِ فَجَمَعَ فِيهَا الْمَغْرِبَ وَ الْعِشَاءَ الْآخِرَةَ تِلْكَ اللَّيْلَةَ ثُلُثَ اللَّيْلِ فِي ذَلِكَ الْمَوْضِعِ\nثُمَّ أَمَرَهُ أَنْ يَنْبَطِحَ فِي بَطْحَاءِ جَمْعٍ فَانْبَطَحَ فِي بَطْحَاءِ جَمْعٍ حَتَّى انْفَجَرَ الصُّبْحُ فَأَمَرَهُ أَنْ يَصْعَدَ عَلَى الْجَبَلِ جَبَلِ جَمْعٍ وَ أَمَرَهُ إِذَا طَلَعَتِ الشَّمْسُ أَنْ يَعْتَرِفَ بِذَنْبِهِ سَبْعَ مَرَّاتٍ وَ يَسْأَلَ اللَّهَ التَّوْبَةَ وَ الْمَغْفِرَةَ سَبْعَ مَرَّاتٍ فَفَعَلَ ذَلِكَ آدَمُ كَمَا أَمَرَهُ جَبْرَئِيلُ ( عليه السلام )\nوَ إِنَّمَا جَعَلَهُ اعْتِرَافَيْنِ لِيَكُونَ سُنَّةً فِي وُلْدِهِ فَمَنْ لَمْ يُدْرِكْ مِنْهُمْ عَرَفَاتٍ وَ أَدْرَكَ جَمْعاً فَقَدْ وَافَى حَجَّهُ إِلَى مِنًى ثُمَّ أَفَاضَ مِنْ جَمْعٍ إِلَى مِنًى فَبَلَغَ مِنًى ضُحًى فَأَمَرَهُ فَصَلَّى رَكْعَتَيْنِ فِي مَسْجِدِ مِنًى\nثُمَّ أَمَرَهُ أَنْ يُقَرِّبَ لِلَّهِ قُرْبَاناً لِيُقْبَلَ مِنْهُ وَ يَعْرِفَ أَنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ تَابَ عَلَيْهِ وَ يَكُونَ سُنَّةً فِي وُلْدِهِ الْقُرْبَانُ فَقَرَّبَ آدَمُ قُرْبَاناً فَقَبِلَ اللَّهُ مِنْهُ فَأَرْسَلَ نَاراً مِنَ السَّمَاءِ فَقُبِلَتْ قُرْبَانُ آدَمَ فَقَالَ لَهُ جَبْرَئِيلُ يَا آدَمُ إِنَّ اللَّهَ قَدْ أَحْسَنَ إِلَيْكَ إِذْ عَلَّمَكَ الْمَنَاسِكَ الَّتِي يَتُوبُ بِهَا عَلَيْكَ وَ قَبِلَ قُرْبَانَكَ فَاحْلِقْ رَأْسَكَ تَوَاضُعاً لِلَّهِ عَزَّ وَ جَلَّ إِذْ قَبِلَ قُرْبَانَكَ فَحَلَقَ آدَمُ رَأْسَهُ تَوَاضُعاً لِلَّهِ عَزَّ وَ جَلَّ\nثُمَّ أَخَذَ جَبْرَئِيلُ بِيَدِ آدَمَ ( عليه السلام ) فَانْطَلَقَ بِهِ إِلَى الْبَيْتِ فَعَرَضَ لَهُ إِبْلِيسُ عِنْدَ الْجَمْرَةِ فَقَالَ لَهُ إِبْلِيسُ لَعَنَهُ اللَّهُ يَا آدَمُ أَيْنَ تُرِيدُ فَقَالَ لَهُ جَبْرَئِيلُ ( عليه السلام ) يَا آدَمُ ارْمِهِ بِسَبْعِ حَصَيَاتٍ وَ كَبِّرْ مَعَ كُلِّ حَصَاةٍ تَكْبِيرَةً فَفَعَلَ ذَلِكَ آدَمُ فَذَهَبَ إِبْلِيسُ\nثُمَّ عَرَضَ لَهُ عِنْدَ الْجَمْرَةِ الثَّانِيَةِ فَقَالَ لَهُ يَا آدَمُ أَيْنَ تُرِيدُ فَقَالَ لَهُ جَبْرَئِيلُ ( عليه السلام ) ارْمِهِ بِسَبْعِ حَصَيَاتٍ وَ كَبِّرْ مَعَ كُلِّ حَصَاةٍ تَكْبِيرَةً فَفَعَلَ ذَلِكَ آدَمُ فَذَهَبَ إِبْلِيسُ ثُمَّ عَرَضَ لَهُ عِنْدَ الْجَمْرَةِ الثَّالِثَةِ فَقَالَ لَهُ يَا آدَمُ أَيْنَ تُرِيدُ فَقَالَ لَهُ جَبْرَئِيلُ ( عليه السلام ) ارْمِهِ بِسَبْعِ حَصَيَاتٍ وَ كَبِّرْ مَعَ كُلِّ حَصَاةٍ تَكْبِيرَةً فَفَعَلَ ذَلِكَ آدَمُ فَذَهَبَ إِبْلِيسُ\nفَقَالَ لَهُ جَبْرَئِيلُ ( عليه السلام ) إِنَّكَ لَنْ تَرَاهُ بَعْدَ مَقَامِكَ هَذَا أَبَداً ثُمَّ انْطَلَقَ بِهِ إِلَى الْبَيْتِ فَأَمَرَهُ أَنْ يَطُوفَ بِالْبَيْتِ سَبْعَ مَرَّاتٍ فَفَعَلَ ذَلِكَ آدَمُ فَقَالَ لَهُ جَبْرَئِيلُ ( عليه السلام ) إِنَّ اللَّهَ قَدْ غَفَرَ لَكَ ذَنْبَكَ وَ قَبِلَ تَوْبَتَكَ وَ أَحَلَّ لَكَ زَوْجَتَكَ .\nمُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو وَ إِسْمَاعِيلَ بْنِ حَازِمٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ أَبِي الدَّيْلَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Al Qalanasy, from Ali Bin Hassan, from his uncle Al Rahman Bin Kaseer, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Adam<sup>as</sup>, when he<sup>as</sup> descended upon the earth, descended upon Al-Safa, and due to that Al-Safa has been named as such, because <span class=\"iTxt\">Al-Mustafa</span> (the chosen one) descended upon it. So the name of the hill was derived from a name of Adam<sup>as</sup>. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[3:33] Surely Allah chose Adam and Noah and the Progeny of Ibrahim and the Progeny of Imran above the nations</span>.\nAnd Hawwa<sup>as</sup> descended upon Al-Marwa, and rather, Al-Marwa was named as ‘Marwa’ because the woman (Al-Mar’a) descended upon it. Hence, the name of the hill was derived from a name of the woman, and these are both hillocks on the right side of the Kaaba, and to the north of it. \nSo Adam<sup>as</sup> said, when there was separation between him<sup>as</sup> and Hawwa<sup>as</sup>, ‘There would not have been a separation between me<sup>as</sup> and my<sup>as</sup> wife except that she<sup>as</sup> has been Prohibited unto me<sup>as</sup>’. So he<sup>as</sup> isolated from her<sup>as</sup>, and he<sup>as</sup> used to go to her<sup>as</sup> at daytime. So he<sup>as</sup> would discuss with her, and whenever it was night, he<sup>as</sup> would fear upon being overcome by his<sup>as</sup> self (desire) over her<sup>as</sup>, he<sup>as</sup> would return and sleep upon Al-Safa. And, it is due to that, the woman (Al-Nisa) has been named as such, there was not comfort (Ans) for Adam<sup>as</sup> apart from her<sup>as</sup>.\nSo Adam<sup>as</sup> remain with that for as long as Allah<sup>azwj</sup> do Desired that he<sup>as</sup> remains. Allah<sup>azwj</sup> neither Spoke to him<sup>as</sup> nor Sent a Messenger to him<sup>as</sup>. And the Lord<sup>azwj</sup> Praised his<sup>as</sup> patience to the Angels. So when the time arrived, which Allah<sup>azwj</sup> Mighty and Majestic Intended that He<sup>azwj</sup> Turns towards Adam<sup>as</sup> (with Mercy), Sent Jibraeel<sup>as</sup> unto him<sup>as</sup>. So he<sup>as</sup> said: ‘Greeting be unto you<sup>as</sup>, O Adam<sup>as</sup>, the patient upon his<sup>as</sup> tribulations, the repentant from his<sup>as</sup> error! Allah<sup>azwj</sup> Mighty and Majestic Sent me<sup>as</sup> to you<sup>as</sup>, to teach you<sup>as</sup> the rituals which Allah<sup>azwj</sup> Intends to Turns towards you<sup>as</sup> with’. \nSo Jibraeel<sup>as</sup> grabbed the hand of Adam<sup>as</sup> until he<sup>as</sup> came with him<sup>as</sup> to the place of the House (Kaaba). So a cloud descended from the sky and shaded the place of the House. So Jibraeel<sup>as</sup> said: ‘O Adam<sup>as</sup>! Mark with your food where the cloud shades, for it is a Qiblah (direction) for you and for the later ones of your<sup>as</sup> posterity from your<sup>as</sup> children’. So Adam<sup>as</sup> marked by his<sup>as</sup> food where the cloud shaded.\nThen he<sup>as</sup> went with him<sup>as</sup> to Mina. So he<sup>as</sup> showed him<sup>as</sup> a Masjid of Mina. So he<sup>as</sup> marked with his<sup>as</sup> leg, and extended his<sup>as</sup> marking of the Sacred Masjid after having marked the place of the House (Kaaba).\nThen he<sup>as</sup> went with him<sup>as</sup> from Mina to Arafat, so he<sup>as</sup> made him<sup>as</sup> stay at Al-Muarraf. So he<sup>as</sup> said, when the sun set, ‘Acknowledge your<sup>as</sup> sin seven times and ask Allah<sup>azwj</sup> for the Forgiveness and the Turning, seven times’. So Adam<sup>as</sup> did that, and it is due to that Al-Muarraf has been named as ‘Al-Muarraf’ because Adam<sup>as</sup> acknowledged his<sup>as</sup> sins therein, and made it to be a Sunnah for his<sup>as</sup> children to be acknowledging their sins just as Adam<sup>as</sup> did, and they would be asking for Allah<sup>azwj</sup>’s Turning just as Adam<sup>as</sup> has asked for it.\nThen Jibraeel<sup>as</sup> instructed him<sup>as</sup>, so he<sup>as</sup> departed from Arafat. So he<sup>as</sup> passed upon seven mountains, and he<sup>as</sup> instructed him<sup>as</sup> that he<sup>as</sup> exclaims (<span class=\"iTxt\">Takbeer</span>) at each mountain with four exclamations. So Adam<sup>as</sup> did that, until he<sup>as</sup> ended up to Jam’a. So when he<sup>as</sup> ended up to Jam’a, a third of the night (had passed). So he gathered (Jam’a) therein Al-Magrib and Al-Isha the last (Prayers) of that night, during the third of the night (having passed), in that place. \nThen he<sup>as</sup> instructed him<sup>as</sup> that he<sup>as</sup> lies down (Yanbat’ha) in Bat’ha of Jam’a. So he<sup>as</sup> lied down in Bat’ha of Jam’a until the morning broke. So he<sup>as</sup> instructed him<sup>as</sup> that he<sup>as</sup> ascend upon the mountain, a mount of Jam’a, and instructed him<sup>as</sup> that when the sun emerges, he<sup>as</sup> should acknowledge his<sup>as</sup> sins seven times, and ask Allah<sup>azwj</sup> for the Turning, and the Forgiveness, seven times’. So Adam<sup>as</sup> did that just as he<sup>as</sup> Jibraeel<sup>as</sup> had instructed him<sup>as</sup>.\nAnd rather, he<sup>as</sup> made the two acknowledgements for these to become a Sunnah among his<sup>as</sup> children. So the one from them who does not come across Arafat, and come to Jam’a, so he has fulfilled his Hajj to Mina. Then he<sup>as</sup> departed from Jam’a to Mina. So he<sup>as</sup> reached Mina at noon, and he<sup>as</sup> instructed him<sup>as</sup> to Pray two Cycles in a Masjid of Mina. \nThen he<sup>as</sup> instructed him<sup>as</sup> that he<sup>as</sup> offers an offering to Allah<sup>azwj</sup>, for it to be Accepted from him<sup>as</sup>, and he<sup>as</sup> would recognise that Allah<sup>azwj</sup> Mighty and Majestic has Turned towards him<sup>as</sup> (with Mercy), and the sacrifice would become a Sunnah among his<sup>as</sup> children. So Adam<sup>as</sup> offered a sacrifice and Allah<sup>azwj</sup> Accepted it from him<sup>as</sup>, so He<sup>azwj</sup> Sent a flame from the sky, so it devoured the offering of Adam<sup>as</sup>. So Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘O Adam<sup>as</sup>! Allah<sup>azwj</sup> has Favoured to you<sup>saww</sup> when He<sup>azwj</sup> Taught you the rituals by which He<sup>azwj</sup> would Turn towards you<sup>as</sup> and Accepted your<sup>azwj</sup> offering. Therefore, shave-off your<sup>as</sup> head in reverence to Allah<sup>azwj</sup> Mighty and Majestic when He<sup>azwj</sup> Accepts your<sup>as</sup> sacrifice’. So Adam<sup>as</sup> shaved-off his<sup>as</sup> head in reverence to Allah<sup>azwj</sup> Mighty and Majestic.\nThen Jibraeel<sup>as</sup> grabbed the hand of Adam<sup>as</sup> and he<sup>as</sup> went with him<sup>as</sup> to the House (Kaaba). So Iblees<sup>la</sup> appeared to him<sup>as</sup> at the stone. So Iblees<sup>la</sup> may Allah<sup>azwj</sup> Cure him<sup>la</sup> said to him<sup>as</sup>, ‘O Adam<sup>as</sup>! Where are you<sup>as</sup> intending (to go to)?’ So Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘O Adam<sup>as</sup>! Pelt him<sup>la</sup> with seven pebbles, and exclaim <span class=\"iTxt\">Takbeer</span> with each pelting, one <span class=\"iTxt\">Takbeer</span>’. So Adam<sup>as</sup> did that, and Iblees<sup>la</sup> went away.\nThen he<sup>la</sup> appeared to him<sup>as</sup> at the second stone, so he<sup>la</sup> said to him<sup>as</sup>, ‘O Adam<sup>as</sup>! Where are you<sup>as</sup> intending (to go to)?’ So Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘Pelt him<sup>la</sup> with seven pebbles, and exclaim <span class=\"iTxt\">Takbeer</span> with each pebble, one exclamation’. So Adam<sup>as</sup> did that, and Iblees<sup>la</sup> went away. Then he<sup>la</sup> appeared to him<sup>as</sup> at the third stone, so he<sup>la</sup> said to him<sup>as</sup>, ‘O Adam<sup>as</sup>! Where are you<sup>as</sup> intending (to go to)?’ So Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘Pelt him with seven pebbles, and exclaim <span class=\"iTxt\">Takbeer</span> with each pebble, one exclamation’. So Adam<sup>as</sup> did that and Iblees<sup>la</sup> went away.\nSo Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘You<sup>as</sup> will never see him<sup>la</sup> in your<sup>as</sup> place after this, ever!’ Then he<sup>as</sup> went with him<sup>as</sup> to the House (Kaaba) and he<sup>as</sup> instructed him<sup>as</sup> that he<sup>as</sup> circumambulate with the House, seven times. So Adam<sup>as</sup> did that, and Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘Allah<sup>azwj</sup> has Forgiven you<sup>as</sup> for your<sup>as</sup> sins, and Accepted your<sup>as</sup> repentance, and Permitted for you<sup>as</sup>, your<sup>as</sup> wife<sup>as</sup>’.\n<span style=\"font-size: small\">Muhammad Bin Abu Abdullah, from Muhammad Bin Al Husayn, from Muhammad Bin Sinan, from Abdul Kareem Bin Amro, and Ismail Bin Hazim, from Abdul Hameed Bin Abu Al Daylam,</span> from Abu Abdullah<sup>asws</sup> – similar to it’."}]}, {"index": 6684, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:4:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ وَ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا طَافَ آدَمُ بِالْبَيْتِ وَ انْتَهَى إِلَى الْمُلْتَزَمِ قَالَ لَهُ جَبْرَئِيلُ ( عليه السلام ) يَا آدَمُ أَقِرَّ لِرَبِّكَ بِذُنُوبِكَ فِي هَذَا الْمَكَانِ قَالَ فَوَقَفَ آدَمُ ( عليه السلام ) فَقَالَ يَا رَبِّ إِنَّ لِكُلِّ عَامِلٍ أَجْراً وَ قَدْ عَمِلْتُ فَمَا أَجْرِي فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا آدَمُ قَدْ غَفَرْتُ ذَنْبَكَ \nقَالَ يَا رَبِّ وَ لِوُلْدِي أَوْ لِذُرِّيَّتِي فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا آدَمُ مَنْ جَاءَ مِنْ ذُرِّيَّتِكَ إِلَى هَذَا الْمَكَانِ وَ أَقَرَّ بِذُنُوبِهِ وَ تَابَ كَمَا تُبْتَ ثُمَّ اسْتَغْفَرَ غَفَرْتُ لَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, form Ibn Abu Umeyr, from Muawiya Bin Ammar and Jameel Bin Salih, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Adam<sup>as</sup> circumambulated with the House (Kaaba) and ended up to Al-Multazam, Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘O Adam<sup>as</sup>! Acknowledge your<sup>as</sup> sins to your<sup>as</sup> Lord<sup>azwj</sup> in this place’. So Adam<sup>as</sup> paused and said: ‘O Lord<sup>azwj</sup>! For every deed is a Recompense, and I<sup>as</sup> have worked, so what is my<sup>as</sup> Recompense?’ So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “O Adam<sup>as</sup>! I<sup>azwj</sup> have Forgiven your<sup>as</sup> sins”. \nHe<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! And for my<sup>as</sup> children, or for my<sup>as</sup> offspring?’ So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “O Adam<sup>as</sup>! The ones from your<sup>as</sup> offspring who comes to this place and acknowledges his sins, and repents just as you<sup>as</sup> repented, then seeks Forgiveness, I<sup>azwj</sup> will Forgive him’."}]}, {"index": 6685, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:4:4", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا أَفَاضَ آدَمُ مِنْ مِنًى تَلَقَّتْهُ الْمَلَائِكَةُ فَقَالُوا يَا آدَمُ بُرَّ حَجُّكَ أَمَا إِنَّهُ قَدْ حَجَجْنَا هَذَا الْبَيْتَ قَبْلَ أَنْ تَحُجَّهُ بِأَلْفَيْ عَامٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Adam<sup>as</sup> departed from Mina, the Angels met him<sup>as</sup>, so they said: ‘O Adam<sup>as</sup>! Righteous was your<sup>as</sup> Hajj. But it is such that we have performed Hajj of this House before you<sup>as</sup> performed your<sup>as</sup> Hajj, by two thousand years’."}]}, {"index": 6686, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:4:5", "text": "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ قَالَ حَدَّثَنِي أَبُو بِلَالٍ الْمَكِّيُّ قَالَ رَأَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) طَافَ بِالْبَيْتِ ثُمَّ صَلَّى فِيمَا بَيْنَ الْبَابِ وَ الْحَجَرِ الْأَسْوَدِ رَكْعَتَيْنِ فَقُلْتُ لَهُ مَا رَأَيْتُ أَحَداً مِنْكُمْ صَلَّى فِي هَذَا الْمَوْضِعِ فَقَالَ هَذَا الْمَكَانُ الَّذِي تِيبَ عَلَى آدَمَ فِيهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, and someone else, from Ahmad Bin Muhammad, from Al Abbas Bin Marouf, from Ali Bin Mahziyar, from Al Husayn Bin Saeed, from Ibrahim Bin Abu Al Balaad who said, \n‘Abu Bilal Al-Makky narrated to me saying, ‘I saw Abu Abdullah<sup>asws</sup> circumambulate with the House (Kaaba), and then Prayed in what is between the Door and the Black Stone, two Cycles’. So I said to him, ‘I have not seen any of you Praying in this place?’ So he said, ‘That is the place in which Adam<sup>as</sup> was Turned to’."}]}, {"index": 6687, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:4:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ الْعَلَوِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ آدَمَ حَيْثُ حَجَّ بِمَا حَلَقَ رَأْسَهُ فَقَالَ نَزَلَ عَلَيْهِ جَبْرَئِيلُ ( عليه السلام ) بِيَاقُوتَةٍ مِنَ الْجَنَّةِ فَأَمَرَّهَا عَلَى رَأْسِهِ فَتَنَاثَرَ شَعْرُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Muhammad Al Alawy who said, \n‘I asked Abu Ja’far<sup>asws</sup> about Adam<sup>as</sup> when he<sup>as</sup> performed Hajj, what did he<sup>as</sup> shave off his<sup>as</sup> head with?’ So he<sup>asws</sup> said: ‘Jibraeel<sup>as</sup> descended unto him<sup>as</sup> with a sapphire from the Paradise, so he<sup>as</sup> brushed it upon his<sup>as</sup> head, and his<sup>as</sup> hair scattered off’."}]}]}, "index": "al-kafi:4:3:4", "kind": "verse_list"}