{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:4:3:45",
        "titles": {
          "ar": "بَابُ الْقَوْلِ عِنْدَ الْخُرُوجِ مِنْ بَيْتِهِ وَ فَضْلِ الصَّدَقَةِ",
          "en": "Chapter 45 – The words (to be spoken) during the going out from his house, and the merits of the charity"
        }
      }
    ],
    "index": 988,
    "local_index": 45,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:45",
    "titles": {
      "ar": "بَابُ الْقَوْلِ عِنْدَ الْخُرُوجِ مِنْ بَيْتِهِ وَ فَضْلِ الصَّدَقَةِ",
      "en": "Chapter 45 – The words (to be spoken) during the going out from his house, and the merits of the charity"
    },
    "verse_count": 4,
    "verse_start_index": 6949,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/174)"
        ],
        "index": 6950,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:45:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَنْ آبَائِهِ ( عليهم السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا اسْتَخْلَفَ رَجُلٌ عَلَى أَهْلِهِ بِخِلَافَةٍ أَفْضَلَ مِنْ رَكْعَتَيْنِ يَرْكَعُهُمَا إِذَا أَرَادَ الْخُرُوجَ إِلَى سَفَرٍ يَقُولُ اللَّهُمَّ إِنِّي أَسْتَوْدِعُكَ نَفْسِي وَ أَهْلِي وَ مَالِي وَ ذُرِّيَّتِي وَ دُنْيَايَ وَ آخِرَتِي وَ أَمَانَتِي وَ خَاتِمَةَ عَمَلِي إِلَّا أَعْطَاهُ اللَّهُ مَا سَأَلَ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘A mam will not leave behind upon his family with something superior than two Cycles (of Prayer) which he Prays when intending the going out to travel. He should be saying, ‘O Allah<sup>azwj</sup>! I entrust to You<sup>azwj</sup>, myself, and my family, and my wealth, and my offspring, and my world, and my Hereafter, and my entrustments, and the completion of my (pending) works’, except that Allah<sup>azwj</sup> would Give him what he asks for’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy, from al-Sakuniy who has said the following from his ancestors: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ’No deputy is better for a man to leave behind for his family than two Rak’at salat (prayer). At the time of coming out, one should say, “O Lord, I leave in Your trust my family, property, children, my worldly affairs, my next life, my trust and end-result of my deeds”, Allah grants his appeals.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/174)"
        ],
        "index": 6951,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:45:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْحَارِثِ بْنِ مُحَمَّدٍ الْأَحْوَلِ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ الْعِجْلِيِّ قَالَ كَانَ أَبُو جَعْفَرٍ ( عليه السلام ) إِذَا أَرَادَ سَفَراً جَمَعَ عِيَالَهُ فِي بَيْتٍ ثُمَّ قَالَ اللَّهُمَّ إِنِّي أَسْتَوْدِعُكَ الْغَدَاةَ نَفْسِي وَ مَالِي وَ أَهْلِي وَ وُلْدِي الشَّاهِدَ مِنَّا وَ الْغَائِبَ اللَّهُمَّ احْفَظْنَا وَ احْفَظْ عَلَيْنَا اللَّهُمَّ اجْعَلْنَا فِي جِوَارِكَ اللَّهُمَّ لَا تَسْلُبْنَا نِعْمَتَكَ وَ لَا تُغَيِّرْ مَا بِنَا مِنْ عَافِيَتِكَ وَ فَضْلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al Haris Bin Muhammad Al Ahowl, from Bureyd Bin Muawiya Al Ijaly who said, ",
            "‘It was such that whenever Abu Ja’far<sup>asws</sup> intended the travel, would gather his<sup>asws</sup> dependents in a room, then say: ‘O Allah<sup>azwj</sup>! I<sup>asws</sup> entrust to You<sup>azwj</sup>, myself<sup>asws</sup>, and my<sup>asws</sup> wealth, and my<sup>asws</sup> family, and my<sup>asws</sup> children, the ones present from us and the absent. O Allah<sup>azwj</sup>! Protect us and Protect upon us. O Allah<sup>azwj</sup>! Make us to be in Your<sup>azwj</sup> vicinity. O Allah<sup>azwj</sup> Do not Confiscate Your<sup>azwj</sup> Bounties from us, and do not Change what is with us, from good health from You<sup>azwj</sup> and Your<sup>azwj</sup> Grace’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from ibn Mahbub from al-Harith ibn Muhammad al-Ahwal from Burayd ibn Mu‘awiyah al-‘Ijliy who has said the following: “When abu Ja’far, ‘Alayhi al-Salam, wanted to leave for a journey, he would ask his family to come together in the house. He would then say, ‘O Allah, I leave in the morning in Your trust my soul, my possession, my family, my children, those present and those absent. O Allah, protect us and protect things important to us. O Allah, place us in Your neighborhood. O Allah, do not take away Your bounties from us and do not change the good health and favors that we enjoy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/175)"
        ],
        "index": 6952,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:45:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَ يُكْرَهُ السَّفَرُ فِي شَيْ‏ءٍ مِنَ الْأَيَّامِ الْمَكْرُوهَةِ الْأَرْبِعَاءِ وَ غَيْرِهِ فَقَالَ افْتَتِحْ سَفَرَكَ بِالصَّدَقَةِ وَ اقْرَأْ آيَةَ الْكُرْسِيِّ إِذَا بَدَا لَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Is the travelling abhorred regarding something from the disliked days, the Wednesday and others?’ So he<sup>asws</sup> said: ‘Begin your travel with the charity, and recite the Verse of the Chair (Chapter 2:255), when it begins for you’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthman who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, this question. ‘Is it detestable to leave for a journey at any particular day like Wednesday or so?’ He (the Imam) said, ’Begin your journey with giving charity and reading verse 255 of Chapter two when you decide to leave for your journey.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/175)"
        ],
        "index": 6953,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:45:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) تَصَدَّقْ وَ اخْرُجْ أَيَّ يَوْمٍ شِئْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub,from Abdul Rahman Bin Al Hajjal who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Give charity and go out in whichever day you so desire to’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad from ibn Mahbub from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You should give charity and leave for your journey any time you like.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:45",
  "kind": "verse_list"
}