{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 46"}, "path": "/books/al-kafi:4:3:46", "titles": {"ar": "بَابُ الْقَوْلِ إِذَا خَرَجَ الرَّجُلُ مِنْ بَيْتِهِ", "en": "Chapter 46 – The words (to be spoken) when the man goes out from his house"}}], "index": 989, "local_index": 46, "part_type": "Chapter", "path": "/books/al-kafi:4:3:46", "titles": {"ar": "بَابُ الْقَوْلِ إِذَا خَرَجَ الرَّجُلُ مِنْ بَيْتِهِ", "en": "Chapter 46 – The words (to be spoken) when the man goes out from his house"}, "verse_count": 2, "verse_start_index": 6953, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6954, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:46:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُوسَى بْنِ الْقَاسِمِ قَالَ حَدَّثَنَا صَبَّاحٌ الْحَذَّاءُ قَالَ سَمِعْتُ مُوسَى بْنَ جَعْفَرٍ ( عليه السلام ) يَقُولُ لَوْ كَانَ الرَّجُلُ مِنْكُمْ إِذَا أَرَادَ السَّفَرَ قَامَ عَلَى بَابِ دَارِهِ تِلْقَاءَ وَجْهِهِ الَّذِي يَتَوَجَّهُ لَهُ فَقَرَأَ فَاتِحَةَ الْكِتَابِ أَمَامَهُ وَ عَنْ يَمِينِهِ وَ عَنْ شِمَالِهِ وَ آيَةَ الْكُرْسِيِّ أَمَامَهُ وَ عَنْ يَمِينِهِ وَ عَنْ شِمَالِهِ ", "ثُمَّ قَالَ اللَّهُمَّ احْفَظْنِي وَ احْفَظْ مَا مَعِي وَ سَلِّمْنِي وَ سَلِّمْ مَا مَعِي وَ بَلِّغْنِي وَ بَلِّغْ مَا مَعِي بِبَلَاغِكَ الْحَسَنِ لَحَفِظَهُ اللَّهُ وَ حَفِظَ مَا مَعَهُ وَ سَلَّمَهُ وَ سَلَّمَ مَا مَعَهُ وَ بَلَّغَهُ وَ بَلَّغَ مَا مَعَهُ ", "قَالَ ثُمَّ قَالَ يَا صَبَّاحُ أَ مَا رَأَيْتَ الرَّجُلَ يُحْفَظُ وَ لَا يُحْفَظُ مَا مَعَهُ وَ يَسْلَمُ وَ لَا يَسْلَمُ مَا مَعَهُ وَ يَبْلُغُ وَ لَا يَبْلُغُ مَا مَعَهُ قُلْتُ بَلَى جُعِلْتُ فِدَاكَ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Musa Bin Al Qasim who said, ‘Sabah Al Haza’a narrated to us saying, ", "‘I heard Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> saying: ‘If the man among you intends the travel, should stand upon the door of his house, turn his face to be towards the direction which he is diverting to, so he should recite the Opening of the Book (Chapter 1) in front of him, and on his right, and on his left, and the Verse of the Chair (Ch 2 V 255) in front of him, and on his right, and on his left.", "Then he should say, ‘O Allah<sup>azwj</sup>! Protect me and Protect what is with me, and Secure me and Secure what is with me, and Make me reach (the destination) and Make what is with me to reach (its destination) with Your<sup>azwj</sup> Goodly Delivery’, Allah<sup>azwj</sup> will Protect him and Protect what is with him, and Secure him and Secure what is with him, and Deliver him (to the destination) and Deliver what is with him (to the destination)’.", "He (the narrator) said, ‘Then he<sup>asws</sup> said: ‘O Sabah! Have you not seen them man who is Protected and what is with him is not protected, and he is safe but what is with him is not safe, and he reaches (the destination) and what is with him does not reach?’ I said, ‘Yes, may I be sacrificed for you<sup>asws</sup>’."]}}, {"index": 6955, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:46:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ صَفْوَانَ بْنِ يَحْيَى جَمِيعاً عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا خَرَجْتَ مِنْ بَيْتِكَ تُرِيدُ الْحَجَّ وَ الْعُمْرَةَ إِنْ شَاءَ اللَّهُ فَادْعُ دُعَاءَ الْفَرَجِ وَ هُوَ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ لَا إِلَهَ إِلَّا اللَّهُ الْعَلِيُّ الْعَظِيمُ سُبْحَانَ اللَّهِ رَبِّ السَّمَاوَاتِ السَّبْعِ وَ رَبِّ الْأَرَضِينَ السَّبْعِ وَ رَبِّ الْعَرْشِ الْعَظِيمِ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ", "ثُمَّ قُلْ اللَّهُمَّ كُنْ لِي جَاراً مِنْ كُلِّ جَبَّارٍ عَنِيدٍ وَ مِنْ كُلِّ شَيْطَانٍ مَرِيدٍ ثُمَّ قُلْ بِسْمِ اللَّهِ دَخَلْتُ وَ بِسْمِ اللَّهِ خَرَجْتُ وَ فِي سَبِيلِ اللَّهِ اللَّهُمَّ إِنِّي أُقَدِّمُ بَيْنَ يَدَيْ نِسْيَانِي وَ عَجَلَتِي بِسْمِ اللَّهِ وَ مَا شَاءَ اللَّهُ فِي سَفَرِي هَذَا ذَكَرْتُهُ أَوْ نَسِيتُهُ اللَّهُمَّ أَنْتَ الْمُسْتَعَانُ عَلَى الْأُمُورِ كُلِّهَا وَ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَ الْخَلِيفَةُ فِي الْأَهْلِ", "اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا وَ اطْوِ لَنَا الْأَرْضَ وَ سَيِّرْنَا فِيهَا بِطَاعَتِكَ وَ طَاعَةِ رَسُولِكَ اللَّهُمَّ أَصْلِحْ لَنَا ظَهْرَنَا وَ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا وَ قِنَا عَذَابَ النَّارِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَ كَآبَةِ الْمُنْقَلَبِ وَ سُوءِ الْمَنْظَرِ فِي الْأَهْلِ وَ الْمَالِ وَ الْوَلَدِ اللَّهُمَّ أَنْتَ عَضُدِي وَ نَاصِرِي بِكَ أَحُلُّ وَ بِكَ أَسِيرُ", "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِي سَفَرِي هَذَا السُّرُورَ وَ الْعَمَلَ بِمَا يُرْضِيكَ عَنِّي اللَّهُمَّ اقْطَعْ عَنِّي بُعْدَهُ وَ مَشَقَّتَهُ وَ اصْحَبْنِي فِيهِ وَ اخْلُفْنِي فِي أَهْلِي بِخَيْرٍ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ", "اللَّهُمَّ إِنِّي عَبْدُكَ وَ هَذَا حُمْلَانُكَ وَ الْوَجْهُ وَجْهُكَ وَ السَّفَرُ إِلَيْكَ وَ قَدِ اطَّلَعْتَ عَلَى مَا لَمْ يَطَّلِعْ عَلَيْهِ أَحَدٌ فَاجْعَلْ سَفَرِي هَذَا كَفَّارَةً لِمَا قَبْلَهُ مِنْ ذُنُوبِي وَ كُنْ عَوْناً لِي عَلَيْهِ وَ اكْفِنِي وَعْثَهُ وَ مَشَقَّتَهُ وَ لَقِّنِّي مِنَ الْقَوْلِ وَ الْعَمَلِ رِضَاكَ فَإِنَّمَا أَنَا عَبْدُكَ وَ بِكَ وَ لَكَ", "فَإِذَا جَعَلْتَ رِجْلَكَ فِي الرِّكَابِ فَقُلْ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ بِسْمِ اللَّهِ وَ اللَّهُ أَكْبَرُ فَإِذَا اسْتَوَيْتَ عَلَى رَاحِلَتِكَ وَ اسْتَوَى بِكَ مَحْمِلُكَ فَقُلْ الْحَمْدُ لِلَّهِ الَّذِي هَدَانَا لِلْإِسْلَامِ وَ عَلَّمَنَا الْقُرْآنَ وَ مَنَّ عَلَيْنَا بِمُحَمَّدٍ ( صلى الله عليه وآله ) سُبْحَانَ اللَّهِ سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَ مَا كُنَّا لَهُ مُقْرِنِينَ وَ إِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ", "اللَّهُمَّ أَنْتَ الْحَامِلُ عَلَى الظَّهْرِ وَ الْمُسْتَعَانُ عَلَى الْأَمْرِ اللَّهُمَّ بَلِّغْنَا بَلَاغاً يَبْلُغُ إِلَى خَيْرٍ بَلَاغاً يَبْلُغُ إِلَى مَغْفِرَتِكَ وَ رِضْوَانِكَ اللَّهُمَّ لَا طَيْرَ إِلَّا طَيْرُكَ وَ لَا خَيْرَ إِلَّا خَيْرُكَ وَ لَا حَافِظَ غَيْرُكَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr and Safwan Bin Yahya, altogether from Muawiya Bin Ammar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you go out from your house intending the Hajj and the Umra, Allah<sup>azwj</sup> Willing, so supplicate with the supplication of the Relief (Du’a Al-Faraj), and it is, ‘There is no god except for Allah<sup>azwj</sup>, the Lenient, the Benevolent. There is no god except for Allah<sup>azwj</sup> the Exalted, the Magnificent. Glory be to Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the seven skies, and Lord<sup>azwj</sup> of the seven firmaments, and Lord<sup>azwj</sup> of the Magnificent Throne. And the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the Worlds’.", "Then say, ‘O Allah<sup>azwj</sup>! Be a Protector of mine from every stubborn tyrant, and from every castaway Satan<sup>la</sup>’. Then say, ‘In the Name of Allah<sup>azwj</sup> do I enter, and in the Name of Allah<sup>azwj</sup> do I go out, and in the Way of Allah<sup>azwj</sup>. O Allah<sup>azwj</sup>! I proceed in front of me with my forgetfulness and my haste. In the Name of Allah<sup>azwj</sup> and whatever Allah<sup>azwj</sup> so Desires, in this journey of mine, I shall remember it or forget it. O Allah<sup>azwj</sup>! You<sup>azwj</sup> are the Aider upon the affairs, all of them, and You<sup>azwj</sup> are the Companion in the journey, and the Caliph (Caretaker) regarding the family.", "O Allah<sup>azwj</sup>! Ease our journey upon us, and Fold the land for us, and Make us to travel in it in Your<sup>azwj</sup> as well as in the obedience of Your<sup>azwj</sup> Rasool<sup>saww</sup>. O Allah<sup>azwj</sup>! Correct our backs for us and Bless for us in what Your<sup>azwj</sup> Grace upon us and Save us from the Punishment of the Fire. O Allah<sup>azwj</sup>! I seek Refuge with You<sup>azwj</sup> from the fatigue of the travel, and anguish of the return, and the evil scenarios regarding the family, and the wealth, and the children. O Allah<sup>azwj</sup>! You<sup>azwj</sup> are my Reinforcement and my Helper. It is with You<sup>azwj</sup> that I disembark and with You<sup>azwj</sup> that I travel.", "O Allah<sup>azwj</sup>! I ask you for the tranquillity in this journey of mine, and the actions with what You<sup>azwj</sup> would be Pleased with from me. O Allah<sup>azwj</sup>! Cut-off the difficulties from me after it, and be my Companion in it, and my Caliph (Caretaker) regarding my family with goodness; and there is neither Might nor Strength except with Allah<sup>azwj</sup>. ", "O Allah<sup>azwj</sup>! I am Your<sup>azwj</sup> servant and this is Your<sup>azwj</sup> Carrier, and the direction is Your<sup>azwj</sup> Direction, and the journey is to You<sup>azwj</sup>, and You<sup>azwj</sup> are being notified upon what no one is notified upon. Therefore, Make this journey of mine to be an expiation for my sins which were before it, and Be a Supporter of mine upon it, and Suffice me from its fatigue, and its difficulties, and Attach me with Your<sup>azwj</sup> Pleasure from the words and the deeds, for rather, I am Your<sup>azwj</sup> servant, and with You<sup>azwj</sup>, and for You<sup>azwj</sup>’.", "So when you make your feet to be in the stirrups, so say, ‘In the Name of Allah<sup style=\"font-weight: normal\">azwj</sup> the Beneficent, the Merciful. In the Name of Allah<sup style=\"font-weight: normal\">azwj</sup>, and Allah<sup style=\"font-weight: normal\">azwj</sup> is the Greatest’. So when you are established upon your ride, and your carriage is (also) established with you, so say, ‘The Praise is for Allah<sup style=\"font-weight: normal\">azwj</sup> who Guided us to Al-Islam and Taught us the Quran, and Favoured upon us with Muhammad<sup style=\"font-weight: normal\">saww</sup>. Glroy be to Allah<sup style=\"font-weight: normal\">azwj</sup>! <span class=\"ibTxt\">[43:13] Glory be to Him Who Made this subservient to us and we were not able to do it [43:14] And surely to our Lord we must return</span>, and the Praise is for Allah<sup style=\"font-weight: normal\">azwj</sup>, Lord<sup style=\"font-weight: normal\">azwj</sup> of the Worlds. ", "O Allah<sup>azwj</sup>! You<sup>azwj</sup> are the Carrier upon the backs, and the Supporter upon the affairs. O Allah<sup>azwj</sup>! Deliver us (to our destination) with an arrival, which reaches to a goodly arrival, reaching to Your<sup>azwj</sup> Forgiveness, and Your<sup>azwj</sup> Pleasure. O Allah<sup>azwj</sup>! There is no traversing except for Your<sup>azwj</sup> Making us traverse, and there is no goodness except for Your<sup>azwj</sup> Goodness, and there is no Protector apart from You<sup>azwj</sup>’."]}}]}, "index": "al-kafi:4:3:46", "kind": "verse_list"}