{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:4:3:5",
        "titles": {
          "ar": "بَابُ عِلَّةِ الْحَرَمِ وَ كَيْفَ صَارَ هَذَا الْمِقْدَارَ",
          "en": "Chapter 5 – Reason for the Sanctuary, and how it came to be of this measurement"
        }
      }
    ],
    "index": 948,
    "local_index": 5,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:4:3:6",
        "titles": {
          "ar": "بَابُ ابْتِلَاءِ الْخَلْقِ وَ اخْتِبَارِهِمْ بِالْكَعْبَةِ",
          "en": "Chapter 6 – Trials of the creatures and their Testing by the Kaaba"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:4:3:4",
        "titles": {
          "ar": "بَابٌ فِي حَجِّ آدَمَ ( عليه السلام )",
          "en": "Chapter 4 – Regarding the Hajj of Adam<sup>as</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:5",
    "titles": {
      "ar": "بَابُ عِلَّةِ الْحَرَمِ وَ كَيْفَ صَارَ هَذَا الْمِقْدَارَ",
      "en": "Chapter 5 – Reason for the Sanctuary, and how it came to be of this measurement"
    },
    "verse_count": 2,
    "verse_start_index": 6687,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن والسند الثاني صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/18)"
        ],
        "index": 6688,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:5:1",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) عَنِ الْحَرَمِ وَ أَعْلَامِهِ كَيْفَ صَارَ بَعْضُهَا أَقْرَبَ مِنْ بَعْضٍ وَ بَعْضُهَا أَبْعَدَ مِنْ بَعْضٍ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا أَهْبَطَ آدَمَ مِنَ الْجَنَّةِ هَبَطَ عَلَى أَبِي قُبَيْسٍ فَشَكَا إِلَى رَبِّهِ الْوَحْشَةَ وَ أَنَّهُ لَا يَسْمَعُ مَا كَانَ يَسْمَعُهُ فِي الْجَنَّةِ فَأَهْبَطَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ يَاقُوتَةً حَمْرَاءَ فَوَضَعَهَا فِي مَوْضِعِ الْبَيْتِ فَكَانَ يَطُوفُ بِهَا آدَمُ فَكَانَ ضَوْؤُهَا يَبْلُغُ مَوْضِعَ الْأَعْلَامِ فَيُعَلَّمُ الْأَعْلَامُ عَلَى ضَوْئِهَا وَ جَعَلَهُ اللَّهُ حَرَماً .",
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي هَمَّامٍ إِسْمَاعِيلَ بْنِ هَمَّامٍ الْكِنْدِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) نَحْوَ هَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I asked Abu Al-Hassan Al-Reza<sup>asws</sup> about the Sanctuary and its boundary, how part of it came to be closer than the other, and part of it is remote than the other. So he<sup>asws</sup> said: ‘When Allah<sup>azwj</sup> Mighty and Majestic Caused Adam<sup>as</sup> to descend from the Paradise, descended upon (Mount) Abu Qubays. So he<sup>as</sup> complained to his<sup>as</sup> Lord<sup>azwj</sup> of the loneliness, and he could neither hear what he<sup>as</sup> used to hear in the Paradise. So Allah<sup>azwj</sup> Mighty and Majestic Caused a red ruby to descend, so he<sup>as</sup> placed it in the place of the House (Kaaba). So Adam<sup>as</sup> used to circumambulate by it, and its illumination reached the places of the boundaries. Thus, he<sup>as</sup> came to know its boundaries based upon its illumination, and Allah<sup>azwj</sup> Made it to be a Sanctuary’. ",
            "<span style=\"font-size: small\">A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Abu Hammam Ismail Bin Hammam Al Kindy,</span> from Abu Al-Hassan Al-Reza<sup>asws</sup>, approximate to this’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad ibn abu Nasr who has said the following: “I once asked abu al-Hassan, al-Rida, ‘Alayhi al-Salam, about the Sacred Area, about its landmarks and why certain ones of its landmarks are closer than others, and others are farther?’ He (the Imam) replied, ’When Allah, the Most Majestic, the Most Glorious, sent Adam down from paradise, he landed on abu Qubays (hill). He complained before his Lord against loneliness and that he does not hear what he used to hear in paradise. Allah, the Most Majestic, the Most Glorious, then sent for him a piece of red ruby. He placed it on the site of the House. Adam walked around it. The light from it fell on certain surrounding sites of the landmarks which are distinguished as such (the landmarks). Allah made them the boundary of the Sacred Area.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/19)"
        ],
        "index": 6689,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:5:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ أَبِي جَعْفَرٍ عَنْ آبَائِهِ ( عليهم السلام ) أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَوْحَى إِلَى جَبْرَئِيلَ ( عليه السلام ) أَنَا اللَّهُ الرَّحْمَنُ الرَّحِيمُ وَ أَنِّي قَدْ رَحِمْتُ آدَمَ وَ حَوَّاءَ لَمَّا شَكَيَا إِلَيَّ مَا شَكَيَا فَاهْبِطْ عَلَيْهِمَا بِخَيْمَةٍ مِنْ خِيَمِ الْجَنَّةِ وَ عَزِّهِمَا عَنِّي بِفِرَاقِ الْجَنَّةِ وَ اجْمَعْ بَيْنَهُمَا فِي الْخَيْمَةِ فَإِنِّي قَدْ رَحِمْتُهُمَا لِبُكَائِهِمَا وَ وَحْشَتِهِمَا فِي وَحْدَتِهِمَا وَ انْصِبِ الْخَيْمَةَ عَلَى التُّرْعَةِ الَّتِي بَيْنَ جِبَالِ مَكَّةَ ",
          "قَالَ وَ التُّرْعَةُ مَكَانُ الْبَيْتِ وَ قَوَاعِدِهِ الَّتِي رَفَعَتْهَا الْمَلَائِكَةُ قَبْلَ آدَمَ فَهَبَطَ جَبْرَئِيلُ ( عليه السلام ) عَلَى آدَمَ بِالْخَيْمَةِ عَلَى مِقْدَارِ أَرْكَانِ الْبَيْتِ وَ قَوَاعِدِهِ فَنَصَبَهَا قَالَ وَ أَنْزَلَ جَبْرَئِيلُ آدَمَ مِنَ الصَّفَا وَ أَنْزَلَ حَوَّاءَ مِنَ الْمَرْوَةِ وَ جَمَعَ بَيْنَهُمَا فِي الْخَيْمَةِ",
          "قَالَ وَ كَانَ عَمُودُ الْخَيْمَةِ قَضِيبَ يَاقُوتٍ أَحْمَرَ فَأَضَاءَ نُورُهُ وَ ضَوْؤُهُ جِبَالَ مَكَّةَ وَ مَا حَوْلَهَا قَالَ وَ امْتَدَّ ضَوْءُ الْعَمُودِ قَالَ فَهُوَ مَوَاضِعُ الْحَرَمِ الْيَوْمَ مِنْ كُلِّ نَاحِيَةٍ مِنْ حَيْثُ بَلَغَ ضَوْءُ الْعَمُودِ قَالَ فَجَعَلَهُ اللَّهُ حَرَماً لِحُرْمَةِ الْخَيْمَةِ وَ الْعَمُودِ لِأَنَّهُمَا مِنَ الْجَنَّةِ",
          "قَالَ وَ لِذَلِكَ جَعَلَ اللَّهُ عَزَّ وَ جَلَّ الْحَسَنَاتِ فِي الْحَرَمِ مُضَاعَفَةً وَ السَّيِّئَاتِ مُضَاعَفَةً قَالَ وَ مُدَّتْ أَطْنَابُ الْخَيْمَةِ حَوْلَهَا فَمُنْتَهَى أَوْتَادِهَا مَا حَوْلَ الْمَسْجِدِ الْحَرَامِ قَالَ وَ كَانَتْ أَوْتَادُهَا مِنْ عِقْيَانِ الْجَنَّةِ وَ أَطْنَابُهَا مِنْ ضَفَائِرِ الْأُرْجُوَانِ",
          "قَالَ وَ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى جَبْرَئِيلَ ( عليه السلام ) اهْبِطْ عَلَى الْخَيْمَةِ بِسَبْعِينَ أَلْفَ مَلَكٍ يَحْرُسُونَهَا مِنْ مَرَدَةِ الشَّيَاطِينِ وَ يُؤْنِسُونَ آدَمَ وَ يَطُوفُونَ حَوْلَ الْخَيْمَةِ تَعْظِيماً لِلْبَيْتِ وَ الْخَيْمَةِ قَالَ فَهَبَطَ بِالْمَلَائِكَةِ فَكَانُوا بِحَضْرَةِ الْخَيْمَةِ يَحْرُسُونَهَا مِنْ مَرَدَةِ الشَّيَاطِينِ الْعُتَاةِ وَ يَطُوفُونَ حَوْلَ أَرْكَانِ الْبَيْتِ وَ الْخَيْمَةِ كُلَّ يَوْمٍ وَ لَيْلَةٍ كَمَا كَانُوا يَطُوفُونَ فِي السَّمَاءِ حَوْلَ الْبَيْتِ الْمَعْمُورِ قَالَ وَ أَرْكَانُ الْبَيْتِ الْحَرَامِ فِي الْأَرْضِ حِيَالَ الْبَيْتِ الْمَعْمُورِ الَّذِي فِي السَّمَاءِ",
          "ثُمَّ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَوْحَى إِلَى جَبْرَئِيلَ بَعْدَ ذَلِكَ أَنِ اهْبِطْ إِلَى آدَمَ وَ حَوَّاءَ فَنَحِّهِمَا عَنْ مَوَاضِعِ قَوَاعِدِ بَيْتِي وَ ارْفَعْ قَوَاعِدَ بَيْتِي لِمَلَائِكَتِي",
          "ثُمَّ وُلْدِ آدَمَ فَهَبَطَ جَبْرَئِيلُ عَلَى آدَمَ وَ حَوَّاءَ فَأَخْرَجَهُمَا مِنَ الْخَيْمَةِ وَ نَحَّاهُمَا عَنْ تُرْعَةِ الْبَيْتِ وَ نَحَّى الْخَيْمَةَ عَنْ مَوْضِعِ التُّرْعَةِ قَالَ وَ وَضَعَ آدَمَ عَلَى الصَّفَا وَ حَوَّاءَ عَلَى الْمَرْوَةِ فَقَالَ آدَمُ يَا جَبْرَئِيلُ أَ بِسَخَطٍ مِنَ اللَّهِ عَزَّ وَ جَلَّ حَوَّلْتَنَا وَ فَرَّقْتَ بَيْنَنَا أَمْ بِرِضاً وَ تَقْدِيرٍ عَلَيْنَا",
          "فَقَالَ لَهُمَا لَمْ يَكُنْ ذَلِكَ بِسَخَطٍ مِنَ اللَّهِ عَلَيْكُمَا وَ لَكِنَّ اللَّهَ لَا يُسْأَلُ عَمَّا يَفْعَلُ يَا آدَمُ إِنَّ السَّبْعِينَ أَلْفَ مَلَكٍ الَّذِينَ أَنْزَلَهُمُ اللَّهُ إِلَى الْأَرْضِ لِيُؤْنِسُوكَ وَ يَطُوفُوا حَوْلَ أَرْكَانِ الْبَيْتِ الْمَعْمُورِ وَ الْخَيْمَةِ سَأَلُوا اللَّهَ أَنْ يَبْنِيَ لَهُمْ مَكَانَ الْخَيْمَةِ بَيْتاً عَلَى مَوْضِعِ التُّرْعَةِ الْمُبَارَكَةِ حِيَالَ الْبَيْتِ الْمَعْمُورِ فَيَطُوفُونَ حَوْلَهُ كَمَا كَانُوا يَطُوفُونَ فِي السَّمَاءِ حَوْلَ الْبَيْتِ الْمَعْمُورِ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيَّ أَنْ أُنَحِّيَكَ وَ أَرْفَعَ الْخَيْمَةَ",
          "فَقَالَ آدَمُ قَدْ رَضِينَا بِتَقْدِيرِ اللَّهِ وَ نَافِذِ أَمْرِهِ فِينَا فَرَفَعَ قَوَاعِدَ الْبَيْتِ الْحَرَامِ بِحَجَرٍ مِنَ الصَّفَا وَ حَجَرٍ مِنَ الْمَرْوَةِ وَ حَجَرٍ مِنْ طُورِ سَيْنَاءَ وَ حَجَرٍ مِنْ جَبَلِ السَّلَامِ وَ هُوَ ظَهْرَ الْكُوفَةِ ",
          "وَ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى جَبْرَئِيلَ أَنِ ابْنِهِ وَ أَتِمَّهُ فَاقْتَلَعَ جَبْرَئِيلُ الْأَحْجَارَ الْأَرْبَعَةَ بِأَمْرِ اللَّهِ عَزَّ وَ جَلَّ مِنْ مَوَاضِعِهِنَّ بِجَنَاحِهِ فَوَضَعَهَا حَيْثُ أَمَرَ اللَّهُ عَزَّ وَ جَلَّ فِي أَرْكَانِ الْبَيْتِ عَلَى قَوَاعِدِهِ الَّتِي قَدَّرَهَا الْجَبَّارُ وَ نَصَبَ أَعْلَامَهَا",
          "ثُمَّ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى جَبْرَئِيلَ ( عليه السلام ) أَنِ ابْنِهِ وَ أَتِمَّهُ بِحِجَارَةٍ مِنْ أَبِي قُبَيْسٍ وَ اجْعَلْ لَهُ بَابَيْنِ بَاباً شَرْقِيّاً وَ بَاباً غَرْبِيّاً قَالَ فَأَتَمَّهُ جَبْرَئِيلُ ( عليه السلام ) فَلَمَّا أَنْ فَرَغَ طَافَتْ حَوْلَهُ الْمَلَائِكَةُ فَلَمَّا نَظَرَ آدَمُ وَ حَوَّاءُ إِلَى الْمَلَائِكَةِ يَطُوفُونَ حَوْلَ الْبَيْتِ انْطَلَقَا فَطَافَا سَبْعَةَ أَشْوَاطٍ ثُمَّ خَرَجَا يَطْلُبَانِ مَا يَأْكُلَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Muhammad Bin Ishaq, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup>: ‘Allah<sup>azwj</sup> Blessed and High Revealed unto Jibraeel<sup>as</sup>: “I<sup>azwj</sup> am Allah<sup>azwj</sup>! The Beneficent, the Merciful. And, I<sup>azwj</sup> was Merciful to Adam<sup>as</sup> and Hawwa<sup>as</sup> when they complained to Me<sup>azwj</sup> what they complained of. So I<sup>azwj</sup> Sent down to them a tent from the tents of the Paradise, and Strengthened them from Me<sup>azwj</sup> due to the separation from the Paradise, and Gathered both of them<sup>as</sup> in the tent. Thus, I<sup>azwj</sup> was Merciful to them due to their<sup>as</sup> weeping, and their<sup>as</sup> fear in their<sup>as</sup> loneliness”, and the tent was pitched upon Al-Tur’a which is between the mountains of Makkah.",
            "He<sup>asws</sup> said: ‘And Al-Tur’a is the ‘place’ of the House (Kaaba), and its foundations are which the Angels built before Adam<sup>as</sup>. So Jibraeel<sup>as</sup> descended unto Adam<sup>as</sup> with the tent, which was of the measurement of the corners of the House (Kaaba) and its base, so he<sup>as</sup> pitched it. He<sup>asws</sup> said: ‘And Jibraeel<sup>as</sup> brought down Adam<sup>as</sup> from Al-Safa, and Hawwa<sup>as</sup> from Al-Marwa, and gathered both of them<sup>as</sup> in the tent. ",
            "He<sup>asws</sup> said: ‘And the pillars of the tent were rods of red rubies, so its light shined and it illuminated the mountains of Makkah and what was around it. And the extent of the light of the pillars, so it is the place of the Sanctuary today, from each side, from wherever the light of he pillars reached. Thus, Allah<sup>azwj</sup> Made it as a Sanctuary due to the sanctity of the tent and the pillars, because both of these were from the Paradise’.",
            "He<sup>asws</sup> said: ‘And due to that, Allah<sup>azwj</sup> Mighty and Majestic Made the good deeds performed in the Sanctuary to be multiplied, and the evil deeds to be multiplied. And the ropes of the tent around it, so its pegs ended up to what is around the Sacred Masjid (today), and its pegs were from the pure gold of the Paradise, and its ropes were from purple braids’.",
            "He<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Jibraeel<sup>as</sup>: “Descend upon the tent with seventy thousand Angels to fortify it from the renegade devils, and comforting Adam<sup>as</sup> and circumambulating the tent in reverence to the House (Kaaba) and the tent”. So he<sup>as</sup> descended with the Angels. So they used to be present at the tent, fortifying it from the ruthless renegade devils, and they were circumambulating around the corners of the House (Kaaba) and the tent every day and night, just as they were circumambulating in the sky around the <span class=\"iTxt\">Bayt Al-Mamoor</span> (The oft-frequented House). And the corners of the Sacred House in the earth are parallel/directly underneath to the <span class=\"iTxt\">Bayt Al-Mamoor</span> which is in the sky’. ",
            "Then he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Jibraeel<sup>as</sup> after that: “Descend unto Adam<sup>as</sup> and Hawwa<sup>as</sup> and prevent them from the place of the base of My<sup>azwj</sup> House and raise the foundations of My<sup>azwj</sup> House for My<sup>azwj</sup> Angels, then the children of Adam<sup>as</sup>”. ",
            "So Jibraeel<sup>as</sup> descended unto Adam<sup>as</sup> and Hawwa<sup>as</sup> and exited them from the tent, and forbade then from the conduit of the House and removed the tent from the place of the conduit, and placed Adam<sup>as</sup> upon Al-Safa and Hawwa<sup>as</sup> upon Al-Marwa. So Adam<sup>as</sup> said: ‘O Jibraeel<sup>as</sup>! Is it due to the Anger from Allah<sup>azwj</sup> Mighty and Majestic that you<sup>as</sup> are transferring us<sup>as</sup> and separating between us<sup>as</sup>, or is it by the Pleasure and Management upon us<sup>as</sup>?’ ",
            "So he<sup>as</sup> said to them both: ‘That did not happen due to the Anger from Allah<sup>azwj</sup> upon you<sup>as</sup>, but Allah<sup>azwj</sup> will not be questioned about what He<sup>azwj</sup> does. O Adam<sup>as</sup>! The seventy thousand Angels which Allah<sup>azwj</sup> Sent down to the earth in order to comfort you<sup>as</sup> and were circumambulating around the corners of Bayt Al-Mamoor and the tent, asked Allah<sup>azwj</sup> to Build for them a House in place of the tent, upon the plance of the Blessed conduit, underneath to Bayt Al-Mamoor. Thus, they would be circumambulating around it just as they were circumambulating in the sky around the Bayt Al-Mamoor. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto me<sup>as</sup> that I<sup>as</sup> forbid you<sup>as</sup> and raise the tent’.",
            "So Adam<sup>as</sup> said: ‘We<sup>as</sup> are pleased with the ‘بِتَقْدِيرِ’ (Ordainment) of Allah<sup>azwj</sup> and would implement His<sup>azwj</sup> Command with regards to us<sup>as</sup>’. So the foundations of the Sacred House were raised with a rock from Al-Safa, and a rock from Al-Marwa, and a rock from (Mount) Toor of Sinai, and a rock from Mount Al-Salaam, and it is at the back of Al-Kufa.",
            "And Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Jibraeel<sup>as</sup>: “Build it and complete it”. So Jibraeel<sup>as</sup> uprooted the four rocks from their places by the Command of Allah<sup>azwj</sup> Mighty and Majestic by his<sup>as</sup> wings. So he<sup>as</sup> placed them where Allah<sup>azwj</sup> Mighty and Majestic had Commanded, in the corners of the House upon its base which the Compeller has Measured as, and established its markings. ",
            "Then Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Jibraeel<sup>as</sup>: “Build it and complete it by stones from (Mount) Abu Qubays, and Make it to be two doors, and eatern door and a western door”. So Jibraeel<sup>as</sup> completed it. So when he<sup>as</sup> was free (from that), the Angels circumambulated around it. So when Adam<sup>as</sup> and Hawwa<sup>as</sup> looked at the Angels circumambulating around the House (Kaaba), they both<sup>as</sup> went and circumambulated seven circuits. Then they both<sup>as</sup> left to seek what they<sup>as</sup> should be eating’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad all from ibn Mahbub from Muhammad ibn Ishaq who have said the following: “Abu Ja’far, has narrated from his ancestors, ‘Alayhim al-Salam, who have said that Allah, the most Blessed, the most High, sent revelation to Jibril that said, T am Allah, the Beneficent, the Merciful. I granted mercy to Adam and Hawwa’ (Eve) when they complained to Me the way they did. Descend down to them with a tent from paradise; provide them comfort on My behalf on their separation from paradise. Call them in one tent; I have granted them mercy due to their weeping, their fear and feeling lonely. Pitch the tent on al-Tur‘ah (a high place) in the mountains of Makkah’. He (the Imam) said, ‘Al-Tur’ah is the site of the House and its pillars that angels had raised before Adam.’ Jibril descended down with the tent, which was of the size of the site of the House, and its pillars. He (Jibril) pitched up the tent.’ He (the Imam) said, ’Jibril then asked Adam to come down from al-Safa’ and asked Hawwa’ to come down from al-Marwah. He (Jibril) brought them in one tent.’ He (the Imam) said, ‘The pole of the tent was a pole made of red ruby, its light and rays shone at the hills of Makkah and its surroundings.’ He (the Imam) said, ‘The light of the pole then extended.’ He (the Imam) said, ’Places on which the light from the pole fell became known as part of the Sacred Area today.’ He (the Imam) then said, ‘Allah made such area sacred due to the sanctity of the tent and the pole; they were from paradise.’ He (the Imam) said, ’For this reason Allah counts both good deeds and evil deeds in multiples.’ He (the Imam) said, ‘Ropes of the tent were extended around it to fasten to the pegs which in turn mark the limits of the area of the Sacred Masjid.’ He (the Imam) said, ‘The pegs were of pure gold and the ropes were of purple color fibers from paradise.’ He (the Imam) said, ‘Allah, the Most Majestic, the Most Glorious, sent revelation to Jibril that said, ‘Allow seventy thousand angels to guard the tent against satanic disobedient ones, comfort Adam and perform Tawaf around the tent to show the greatness of the House and the tent.’ He (the Imam) said, ‘Jibril came with the angels and they were guards at the tent against disobedient and violent individuals of Satan. They performed Tawaf around the House and the tent every day and night just as they did around the established House in the heaven.’ He (the Imam) said, ‘The pillars of the Sacred House on earth stand parallel with the Established House in the heaven.’ He (the Imam) said, ‘Allah, the Most Majestic, the Most Glorious, sent thereafter revelation to Jibril that said, “You must go to Adam and Hawwa’ (Eve), move them away from the pillars of the House and raise the pillars of the House for my angels, then for the children of Adam.” Jibril came to Adam and Hawwa’ (Eve), moved them away from the tent and al- Tur‘ah of the House and removed the tent from al-Tur‘ah (the site of the House).’ He (the Imam) said, ‘Adam was placed on al-Safa’ and Hawwa’ was placed on al-Marwah. Adam then asked Jibril, “Is it because of the anger of Allah, the Most Majestic, the Most Glorious, that you have moved us and separated us from each other or with His agreement and measures for us?” He (Jibril) told them that it was not due to Allah’s anger against both of them but Allah cannot be questioned for what He does. O Adam, the seventy thousand angels that Allah has sent to earth provide you comfort; you must perform Tawaf around the pillars of the House, the Established one, and the tent. They asked Allah to build for them instead of the tent a house on the site of al-Tur‘ah, the blessed one, parallel to the Established House in the heaven so they can perform Tawaf around it, as they do around the Established House in the heaven. Allah, the Most Majestic, the Most Glorious, then sent to me revelation to move you away and the tent. Adam then said, “We are happy with the measures of Allah and whatever He commands about us.” The pillars of the Sacred House were raised with one stone from al-Safa’, one from al-Marwah, one from Mount Sinai and one from the Mount Peace which is behind al-Kufa. Allah, the Most Majestic, the Most Glorious, sent revelation to Jibril to build and complete it. Jibril then dug out the four stones by the command of Allah, the Most Majestic, the Most Glorious, from their places by his wing, and placed them on the corners of the House in places of the pillars marked and measured by the Almighty, as Allah, the Most Majestic, the Most Glorious, had commanded him to do. Allah, the Most Majestic, the Most Glorious, then sent revelation to Jibril that said, “You must build and complete it with stones from abu Qubays and make two doors for it, one to the east and one to the west.’” He (the Imam) said, ‘He (Jibril) completed it. When he finished, angels performed Tawaf around it. When Adam and Hawwa’ looked to the angels performing Tawaf around the House, they moved to perform Tawaf by walking around it seven times and then they went out in search for food.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:5",
  "kind": "verse_list"
}