{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 54"}, "path": "/books/al-kafi:4:3:54", "titles": {"ar": "بَابُ صِفَةِ الْإِشْعَارِ وَ التَّقْلِيدِ", "en": "Chapter 54 – Description of the marking (the sacrificial animal) and the yoking (Taqleed)"}}], "index": 997, "local_index": 54, "part_type": "Chapter", "path": "/books/al-kafi:4:3:54", "titles": {"ar": "بَابُ صِفَةِ الْإِشْعَارِ وَ التَّقْلِيدِ", "en": "Chapter 54 – Description of the marking (the sacrificial animal) and the yoking (Taqleed)"}, "verse_count": 6, "verse_start_index": 6997, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6998, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:54:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي قَدِ اشْتَرَيْتُ بَدَنَةً فَكَيْفَ أَصْنَعُ بِهَا فَقَالَ انْطَلِقْ حَتَّى تَأْتِيَ مَسْجِدَ الشَّجَرَةِ فَأَفِضْ عَلَيْكَ مِنَ الْمَاءِ وَ الْبَسْ ثَوْبَيْكَ ثُمَّ أَنِخْهَا مُسْتَقْبِلَ الْقِبْلَةِ ثُمَّ ادْخُلِ الْمَسْجِدَ فَصَلِّ ثُمَّ افْرِضْ بَعْدَ صَلَاتِكَ ثُمَّ اخْرُجْ إِلَيْهَا فَأَشْعِرْهَا مِنَ الْجَانِبِ الْأَيْمَنِ مِنْ سَنَامِهَا ثُمَّ قُلْ بِسْمِ اللَّهِ اللَّهُمَّ مِنْكَ وَ لَكَ اللَّهُمَّ تَقَبَّلْ مِنِّي ثُمَّ انْطَلِقْ حَتَّى تَأْتِيَ الْبَيْدَاءَ فَلَبِّهْ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Yunus Bin Yaqoub who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘I have purchased a camel, so how should I deal with it’. So he<sup>asws</sup> said: ‘Go with it until you come to Masjid Al-Shajara, so shower upon yourself with the water, and wear your two clothes. Then kneel it facing the Qiblah. Then enter the Masjid, so Pray, then commit upon your Prayer, then go out to it. So mark it from the right side of its hump, the say, ‘In the Name of Allah<sup>azwj</sup>! O Allah<sup>azwj</sup>, from You<sup>azwj</sup> and to You<sup>azwj</sup>. O Allah<sup>azwj</sup>! Accept from me’. Then go until you get to Al-Bayda, and recite <span class=\"iTxt\">Talbiyya</span>h’."]}}, {"index": 6999, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:54:2", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانٍ عَنْ مُحَمَّدٍ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ تَجْلِيلِ الْهَدْيِ وَ تَقْلِيدِهَا فَقَالَ لَا تُبَالِي أَيَّ ذَلِكَ فَعَلْتَ وَ سَأَلْتُهُ عَنْ إِشْعَارِ الْهَدْيِ فَقَالَ نَعَمْ مِنَ الشِّقِّ الْأَيْمَنِ فَقُلْتُ مَتَى نُشْعِرُهَا قَالَ حِينَ تُرِيدُ أَنْ تُحْرِمَ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Al Hassan Bin Ali, from Aban, from Muhammad Al Halby who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about decorating the sacrificial animal and yoking it, so he<sup>asws</sup> said: ‘It does not matter which of that you do’. And I asked him<sup>asws</sup> about marking the sacrificial animal, so he<sup>asws</sup> said: ‘Yes, notch on the right side’. So I said, ‘When should we mark it’. He<sup>asws</sup> said: ‘When you intend to wear the <span class=\"iTxt\">Ihraam</span>’."]}}, {"index": 7000, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:54:3", "text": ["أَبَانٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ وَ زُرَارَةُ قَالَا سَأَلْنَا أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْبُدْنِ كَيْفَ تُشْعَرُ وَ مَتَى يُحْرِمُ صَاحِبُهَا وَ مِنْ أَيِّ جَانِبٍ تُشْعَرُ وَ مَعْقُولَةً تُنْحَرُ أَوْ بَارِكَةً فَقَالَ تُنْحَرُ مَعْقُولَةً وَ تُشْعَرُ مِنَ الْجَانِبِ الْأَيْمَنِ ."], "translations": {"en.hubeali": ["Aban, from Abdul Rahman Bin Abu Abdullah, and Zurara, both said, ", "‘We asked Abu Abdullah<sup>asws</sup> about the camel, how to mark it, and when should its owner wear the <span class=\"iTxt\">Ihraam</span>, and from which side to mark it, and to sacrifice it tied down or knelt down. So he<sup>asws</sup> said: ‘Sacrifice it tied down, and mark it from the right side’."]}}, {"index": 7001, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:54:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْبُدْنِ كَيْفَ تُشْعَرُ قَالَ تُشْعَرُ وَ هِيَ مَعْقُولَةٌ وَ تُنْحَرُ وَ هِيَ قَائِمَةٌ تُشْعَرُ مِنْ جَانِبِهَا الْأَيْمَنِ وَ يُحْرِمُ صَاحِبُهَا إِذَا قُلِّدَتْ وَ أُشْعِرَتْ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Najra, from Abdullah Bin Sinan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the camel, how to mark it. He<sup>asws</sup> said: ‘Mark it while it is tied down, and sacrifice it while it is standing. Mark it from its right side, and its owner should wear the <span class=\"iTxt\">Ihraam</span> when he yokes and marks’."]}}, {"index": 7002, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:54:5", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا كَانَتِ الْبُدْنُ كَثِيرَةً قَامَ فِيمَا بَيْنَ ثِنْتَيْنِ ثُمَّ أَشْعَرَ الْيُمْنَى ثُمَّ الْيُسْرَى وَ لَا يُشْعِرُ أَبَداً حَتَّى يَتَهَيَّأَ لِلْإِحْرَامِ لِأَنَّهُ إِذَا أَشْعَرَ وَ قَلَّدَ وَ جَلَّلَ وَجَبَ عَلَيْهِ الْإِحْرَامُ وَ هِيَ بِمَنْزِلَةِ التَّلْبِيَةِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Jameel Bin Darraj, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When there are many camels, stand in what is between the two, then mark the right side, then the left, but do not mark it ever until you are ready for the Ihraan, because when one marks, and yokes, and decorates, the <span class=\"iTxt\">Ihraam</span> would be Obligatory upon him, and it is at the status of the <span class=\"iTxt\">Talbiyya</span>’."]}}, {"index": 7003, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:54:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ قَالَ الْبُدْنُ تُشْعَرُ مِنَ الْجَانِبِ الْأَيْمَنِ وَ يَقُومُ الرَّجُلُ فِي جَانِبِ الْأَيْسَرِ ثُمَّ يُقَلِّدُهَا بِنَعْلٍ خَلَقٍ قَدْ صَلَّى فِيهَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The camel should be marked from the right side, and the man should be standing in the left side. Then he should yoke it with a slipper which he has Prayed in’."]}}]}, "index": "al-kafi:4:3:54", "kind": "verse_list"}