{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:4:3:6",
        "titles": {
          "ar": "بَابُ ابْتِلَاءِ الْخَلْقِ وَ اخْتِبَارِهِمْ بِالْكَعْبَةِ",
          "en": "Chapter 6 – Trials of the creatures and their Testing by the Kaaba"
        }
      }
    ],
    "index": 949,
    "local_index": 6,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:6",
    "titles": {
      "ar": "بَابُ ابْتِلَاءِ الْخَلْقِ وَ اخْتِبَارِهِمْ بِالْكَعْبَةِ",
      "en": "Chapter 6 – Trials of the creatures and their Testing by the Kaaba"
    },
    "verse_count": 2,
    "verse_start_index": 6689,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/22)"
        ],
        "index": 6690,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:6:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ أَبِي</span> عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ أَبِي يُسْرٍ عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ مُحَمَّدٍ عَنْ عِيسَى بْنِ يُونُسَ قَالَ كَانَ ابْنُ أَبِي الْعَوْجَاءِ مِنْ تَلَامِذَةِ الْحَسَنِ الْبَصْرِيِّ فَانْحَرَفَ عَنِ التَّوْحِيدِ فَقِيلَ لَهُ تَرَكْتَ مَذْهَبَ صَاحِبِكَ وَ دَخَلْتَ فِيمَا لَا أَصْلَ لَهُ وَ لَا حَقِيقَةَ فَقَالَ إِنَّ صَاحِبِي كَانَ مِخْلَطاً كَانَ يَقُولُ طَوْراً بِالْقَدَرِ وَ طَوْراً بِالْجَبْرِ وَ وَ مَا أَعْلَمُهُ اعْتَقَدَ مَذْهَباً دَامَ عَلَيْهِ",
          "وَ قَدِمَ مَكَّةَ مُتَمَرِّداً وَ إِنْكَاراً عَلَى مَنْ يَحُجُّ وَ كَانَ يَكْرَهُ الْعُلَمَاءُ مُجَالَسَتَهُ وَ مُسَاءَلَتَهُ لِخُبْثِ لِسَانِهِ وَ فَسَادِ ضَمِيرِهِ فَأَتَى أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَجَلَسَ إِلَيْهِ فِي جَمَاعَةٍ مِنْ نُظَرَائِهِ فَقَالَ يَا أَبَا عَبْدِ اللَّهِ إِنَّ الْمَجَالِسَ أَمَانَاتٌ وَ لَا بُدَّ لِكُلِّ مَنْ بِهِ سُعَالٌ أَنْ يَسْعُلَ أَ فَتَأْذَنُ فِي الْكَلَامِ فَقَالَ تَكَلَّمْ",
          "فَقَالَ إِلَى كَمْ تَدُوسُونَ هَذَا الْبَيْدَرَ وَ تَلُوذُونَ بِهَذَا الْحَجَرِ وَ تَعْبُدُونَ هَذَا الْبَيْتَ الْمَعْمُورَ بِالطُّوبِ وَ الْمَدَرِ وَ تُهَرْوِلُونَ حَوْلَهُ هَرْوَلَةَ الْبَعِيرِ إِذَا نَفَرَ إِنَّ مَنْ فَكَّرَ فِي هَذَا وَ قَدَّرَ عَلِمَ أَنَّ هَذَا فِعْلٌ أَسَّسَهُ غَيْرُ حَكِيمٍ وَ لَا ذِي نَظَرٍ فَقُلْ فَإِنَّكَ رَأْسُ هَذَا الْأَمْرِ وَ سَنَامُهُ وَ أَبُوكَ أُسُّهُ وَ تَمَامُهُ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ مَنْ أَضَلَّهُ اللَّهُ وَ أَعْمَى قَلْبَهُ اسْتَوْخَمَ الْحَقَّ وَ لَمْ يَسْتَعِذْ بِهِ وَ صَارَ الشَّيْطَانُ وَلِيَّهُ وَ رَبَّهُ وَ قَرِينَهُ يُورِدُهُ مَنَاهِلَ الْهَلَكَةِ ثُمَّ لَا يُصْدِرُهُ وَ هَذَا بَيْتٌ اسْتَعْبَدَ اللَّهُ بِهِ خَلْقَهُ لِيَخْتَبِرَ طَاعَتَهُمْ فِي إِتْيَانِهِ فَحَثَّهُمْ عَلَى تَعْظِيمِهِ وَ زِيَارَتِهِ وَ جَعَلَهُ مَحَلَّ أَنْبِيَائِهِ وَ قِبْلَةً لِلْمُصَلِّينَ إِلَيْهِ",
          "فَهُوَ شُعْبَةٌ مِنْ رِضْوَانِهِ وَ طَرِيقٌ يُؤَدِّي إِلَى غُفْرَانِهِ مَنْصُوبٌ عَلَى اسْتِوَاءِ الْكَمَالِ وَ مَجْمَعِ الْعَظَمَةِ وَ الْجَلَالِ خَلَقَهُ اللَّهُ قَبْلَ دَحْوِ الْأَرْضِ بِأَلْفَيْ عَامٍ فَأَحَقُّ مَنْ أُطِيعَ فِيمَا أَمَرَ وَ انْتُهِيَ عَمَّا نَهَى عَنْهُ وَ زَجَرَ اللَّهُ الْمُنْشِئُ لِلْأَرْوَاحِ وَ الصُّوَرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Muhammad Bin Abu Yusar, from Dawood Bin Abdullah, from Muhammad Bin Amro Bin Muhammad, from Isa Bin Yunus who said, ",
            "‘Ibn Abu Al-Awja was from the students of Al-Hassan Al-Basry, so he deviated from the Oneness (Tawheed). So it was said to him, ‘You neglected the doctrine of your master, and entered into what there is not origin for it, nor any reality’. So he said, ‘My master was muddled up and was speaking sometimes with the pre-destination, and sometimes with the compulsion, and I do not know him believing a doctrine adhering upon it’.",
            "And he went to Makkah in rebellion and denial upon the ones who performed Hajj, and the scholars used to dislike sitting with him and his questioning due to his bad language and his corrupt conscience. So he came over to Abu Abdullah<sup>asws</sup> and sat with him<sup>asws</sup> among a group of his like minded people. So he said, ‘O Abu Abdullah<sup>asws</sup>! The gatherings are a safety, and it is inevitable for the one who needs to cough, so he coughs. Do you<sup>asws</sup> permit me with regards to speaking?’ So he<sup>asws</sup> said: ‘Speak’.",
            "So he said, ‘For how long will you<sup>asws</sup> be trampling this threshing surface, and seeking refuge with this (Black) Stone, and worshipping this House (Kaaba), built with bricks and mud, and running around it with the running of the camels when they flee? The one who thinks regarding this and surveys, would know that this deed is unfounded, without wisdom, nor with consideration. So speak, for you<sup>asws</sup> are a head of this matter and its peak, and your<sup>asws</sup> father<sup>saww</sup> founded it and completed it’.",
            "So Abu Abdullah<sup>asws</sup> said; ‘The one whom Allah<sup>azwj</sup> Lets to stray and Blinds his heart is obscured from the Truth and does not seek refuge with it, and the Satan<sup>la</sup> becomes his guardian, and his lord, and his pair, preparing his return to the destruction, then he cannot come out of it. ",
            "And this House, Allah<sup>azwj</sup> is worshipped at by His<sup>azwj</sup> creatures in order for their obedience to be Tested in their coming to it. So they are urged upon its reverence, and its visitation, and He<sup>azwj</sup> Made it as a place of His<sup>azwj</sup> Prophets<sup>as</sup> and a Qiblah (direction) for the Praying ones. ",
            "Thus, it is a branch from attaining His<sup>azwj</sup> Pleasure, and a road to get to His<sup>azwj</sup> Forgiveness. It is established upon the balance of perfection, and is a summary of the Magnificence and the Majesty. Allah<sup>azwj</sup> Created it before the spread of the land, by two thousand years. Thus, He<sup>azwj</sup> is the most rightful of being obeyed regarding whatever He<sup>azwj</sup> Commands, and refrained from whatever He<sup>azwj</sup> Forbids from and Enjoins. Allah<sup>azwj</sup> is the Originator of the souls and the images’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn abu ‘Abd Allah has narrated from Muhammad ibn abu Yusr from Dawud ibn ‘Abd Allah from Muhammad ibn ‘Amr ibn Muhammad from ‘Isa ibn Yunus who has said the following: “Ibn abu al-‘Awja’ was one of the pupils of al-Hassan al-Basriy. He deviated from the belief of Monotheism. It was said to him, ‘You have given up the religion of your friend and have come to something that has no foundation and reality.’ He replied, ‘My friend was mixing the issue. One time he would say, “It is predestination” and then he would say, “It is compulsion.” I do not know if he believes in any religion with which he can continue.’ He went to Makkah, in disobedience and in rejection of belief in performing Hajj. Scholars disliked to sit and to speak with him due to his bad mouth and filthy conscience. He went to abu ‘Abd Allah, ‘Alayhi al-Salam, and sat next to him in the company of people like him, and said, ‘O abu ‘Abd Allah, meeting places are trusts where everyone can cough if one needs to cough. Will you allow speaking?’ He (the Imam) said, ‘You can speak.’ He said, ‘For how long you continue walking around it like farmers threshing hay under their feet, seek refuge with this stone, worship this House built with bricks and rubble, run around like runaway camels? One who thinks a little about it comes to know of this action to be founded without wisdom and thinking. Say something about it; you’re the head of this matter and its peak, your father is the origin thereof and its completion.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘One whom Allah has made blind and has made him to go astray, he mistreats the truth and considers it tasteless; thus Satan becomes his source of authority and guardian, lord and companion, who leads to destructive places wherefrom he can never come out to safety. Through this house, Allah has asked His creatures to worship Him (acknowledge Him as their sole owner) so He may examine the quality of their obedience in their answering His call. He thus has strongly advised them to respect it with greatness and visit it. He has made it a place of His prophets and a point to face during performing salat (prayer). It is a branch of His pleasure, and it is a road and it leads to His forgiveness. It is established in perfect balance as a focal point of greatness and glory. Allah created it two thousand years before the spread of earth. He deserves more than anyone who is obeyed in what He commands and in what He prohibits and admonishes. Allah is the inventor of the spirits and forms.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/23)"
        ],
        "index": 6691,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:6:2",
        "text": [
          "وَ رُوِيَ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( صلوات الله عليه ) قَالَ فِي خُطْبَةٍ لَهُ وَ لَوْ أَرَادَ اللَّهُ جَلَّ ثَنَاؤُهُ بِأَنْبِيَائِهِ حَيْثُ بَعَثَهُمْ أَنْ يَفْتَحَ لَهُمْ كُنُوزَ الذِّهْبَانِ وَ مَعَادِنَ الْعِقْيَانِ وَ مَغَارِسَ الْجِنَانِ وَ أَنْ يَحْشُرَ طَيْرَ السَّمَاءِ وَ وَحْشَ الْأَرْضِ مَعَهُمْ لَفَعَلَ وَ لَوْ فَعَلَ لَسَقَطَ الْبَلَاءُ وَ بَطَلَ الْجَزَاءُ وَ اضْمَحَلَّتِ الْأَنْبَاءُ وَ لَمَا وَجَبَ لِلْقَائِلِينَ أُجُورُ الْمُبْتَلَيْنَ وَ لَا لَحِقَ الْمُؤْمِنِينَ ثَوَابُ الْمُحْسِنِينَ وَ لَا لَزِمَتِ الْأَسْمَاءُ أَهَالِيَهَا عَلَى مَعْنًى مُبِينٍ ",
          "وَ لِذَلِكَ لَوْ أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ آيَةً فَظَلَّتْ أَعْنَاقُهُمْ لَهَا خَاضِعِينَ وَ لَوْ فَعَلَ لَسَقَطَ الْبَلْوَى عَنِ النَّاسِ أَجْمَعِينَ وَ لَكِنَّ اللَّهَ جَلَّ ثَنَاؤُهُ جَعَلَ رُسُلَهُ أُولِي قُوَّةٍ فِي عَزَائِمِ نِيَّاتِهِمْ وَ ضَعَفَةً فِيمَا تَرَى الْأَعْيُنُ مِنْ حَالَاتِهِمْ مِنْ قَنَاعَةٍ تَمْلَأُ الْقُلُوبَ وَ الْعُيُونَ غَنَاؤُهُ وَ خَصَاصَةٍ تَمْلَأُ الْأَسْمَاعَ وَ الْأَبْصَارَ أَذَاؤُهُ",
          "وَ لَوْ كَانَتِ الْأَنْبِيَاءُ أَهْلَ قُوَّةٍ لَا تُرَامُ وَ عِزَّةٍ لَا تُضَامُ وَ مُلْكٍ يُمَدُّ نَحْوَهُ أَعْنَاقُ الرِّجَالِ وَ يُشَدُّ إِلَيْهِ عُقَدُ الرِّحَالِ لَكَانَ أَهْوَنَ عَلَى الْخَلْقِ فِي الِاخْتِبَارِ وَ أَبْعَدَ لَهُمْ فِي الِاسْتِكْبَارِ وَ لآَمَنُوا عَنْ رَهْبَةٍ قَاهِرَةٍ لَهُمْ أَوْ رَغْبَةٍ مَائِلَةٍ بِهِمْ فَكَانَتِ النِّيَّاتُ مُشْتَرَكَةً وَ الْحَسَنَاتُ مُقْتَسَمَةً ",
          "وَ لَكِنَّ اللَّهَ أَرَادَ أَنْ يَكُونَ الِاتِّبَاعُ لِرُسُلِهِ وَ التَّصْدِيقُ بِكُتُبِهِ وَ الْخُشُوعُ لِوَجْهِهِ وَ الِاسْتِكَانَةُ لِأَمْرِهِ وَ الِاسْتِسْلَامُ لِطَاعَتِهِ أُمُوراً لَهُ خَاصَّةً لَا تَشُوبُهَا مِنْ غَيْرِهَا شَائِبَةٌ",
          "وَ كُلَّمَا كَانَتِ الْبَلْوَى وَ الِاخْتِبَارُ أَعْظَمَ كَانَتِ الْمَثُوبَةُ وَ الْجَزَاءُ أَجْزَلَ أَ لَا تَرَوْنَ أَنَّ اللَّهَ جَلَّ ثَنَاؤُهُ اخْتَبَرَ الْأَوَّلِينَ مِنْ لَدُنِ آدَمَ إِلَى الْآخِرِينَ مِنْ هَذَا الْعَالَمِ بِأَحْجَارٍ لَا تَضُرُّ وَ لَا تَنْفَعُ وَ لَا تُبْصِرُ وَ لَا تَسْمَعُ فَجَعَلَهَا بَيْتَهُ الْحَرَامَ الَّذِي جَعَلَهُ لِلنَّاسِ قِيَاماً ثُمَّ وَضَعَهُ بِأَوْعَرِ بِقَاعِ الْأَرْضِ حَجَراً وَ أَقَلِّ نَتَائِقِ الدُّنْيَا مَدَراً وَ أَضْيَقِ بُطُونِ الْأَوْدِيَةِ مَعَاشاً وَ أَغْلَظِ مَحَالِّ الْمُسْلِمِينَ مِيَاهاً بَيْنَ جِبَالٍ خَشِنَةٍ وَ رِمَالٍ دَمِثَةٍ وَ عُيُونٍ وَشِلَةٍ وَ قُرًى مُنْقَطِعَةٍ وَ أَثَرٍ مِنْ مَوَاضِعِ قَطْرِ السَّمَاءِ دَاثِرٍ لَيْسَ يَزْكُو بِهِ خُفٌّ وَ لَا ظِلْفٌ وَ لَا حَافِرٌ",
          "ثُمَّ أَمَرَ آدَمَ وَ وُلْدَهُ أَنْ يَثْنُوا أَعْطَافَهُمْ نَحْوَهُ فَصَارَ مَثَابَةً لِمُنْتَجَعِ أَسْفَارِهِمْ وَ غَايَةً لِمُلْقَى رِحَالِهِمْ تَهْوِي إِلَيْهِ ثِمَارُ الْأَفْئِدَةِ مِنْ مَفَاوِزِ قِفَارٍ مُتَّصِلَةٍ وَ جَزَائِرِ بِحَارٍ مُنْقَطِعَةٍ وَ مَهَاوِي فِجَاجٍ عَمِيقَةٍ حَتَّى يَهُزُّوا مَنَاكِبَهُمْ ذُلُلًا يُهَلِّلُونَ لِلَّهِ حَوْلَهُ وَ يَرْمُلُونَ عَلَى أَقْدَامِهِمْ شُعْثاً غُبْراً لَهُ قَدْ نَبَذُوا الْقُنُعَ وَ السَّرَابِيلَ وَرَاءَ ظُهُورِهِمْ وَ حَسَرُوا بِالشُّعُورِ حَلْقاً عَنْ رُءُوسِهِمُ",
          "ابْتِلَاءً عَظِيماً وَ اخْتِبَاراً كَبِيراً وَ امْتِحَاناً شَدِيداً وَ تَمْحِيصاً بَلِيغاً وَ قُنُوتاً مُبِيناً جَعَلَهُ اللَّهُ سَبَباً لِرَحْمَتِهِ وَ وُصْلَةً وَ وَسِيلَةً إِلَى جَنَّتِهِ وَ عِلَّةً لِمَغْفِرَتِهِ وَ ابْتِلَاءً لِلْخَلْقِ بِرَحْمَتِهِ",
          "وَ لَوْ كَانَ اللَّهُ تَبَارَكَ وَ تَعَالَى وَضَعَ بَيْتَهُ الْحَرَامَ وَ مَشَاعِرَهُ الْعِظَامَ بَيْنَ جَنَّاتٍ وَ أَنْهَارٍ وَ سَهْلٍ وَ قَرَارٍ جَمَّ الْأَشْجَارِ دَانِيَ الثِّمَارِ مُلْتَفَّ النَّبَاتِ مُتَّصِلَ الْقُرَى مِنْ بُرَّةٍ سَمْرَاءَ وَ رَوْضَةٍ خَضْرَاءَ وَ أَرْيَافٍ مُحْدِقَةٍ وَ عِرَاصٍ مُغْدِقَةٍ وَ زُرُوعٍ نَاضِرَةٍ وَ طُرُقٍ عَامِرَةٍ وَ حَدَائِقَ كَثِيرَةٍ لَكَانَ قَدْ صَغُرَ الْجَزَاءُ عَلَى حَسَبِ ضَعْفِ الْبَلَاءِ ",
          "ثُمَّ لَوْ كَانَتِ الْأَسَاسُ الْمَحْمُولُ عَلَيْهَا وَ الْأَحْجَارُ الْمَرْفُوعُ بِهَا بَيْنَ زُمُرُّدَةٍ خَضْرَاءَ وَ يَاقُوتَةٍ حَمْرَاءَ وَ نُورٍ وَ ضِيَاءٍ لَخَفَّفَ ذَلِكَ مُصَارَعَةَ الشَّكِّ فِي الصُّدُورِ وَ لَوَضَعَ مُجَاهَدَةَ إِبْلِيسَ عَنِ الْقُلُوبِ وَ لَنَفَى مُعْتَلِجَ الرَّيْبِ مِنَ النَّاسِ وَ لَكِنَّ اللَّهَ عَزَّ وَ جَلَّ يَخْتَبِرُ عَبِيدَهُ بِأَنْوَاعِ الشَّدَائِدِ وَ يَتَعَبَّدُهُمْ بِأَلْوَانِ الْمَجَاهِدِ وَ يَبْتَلِيهِمْ بِضُرُوبِ الْمَكَارِهِ إِخْرَاجاً لِلتَّكَبُّرِ مِنْ وَ إِسْكَاناً لِلتَّذَلُّلِ فِي أَنْفُسِهِمْ",
          "وَ لِيَجْعَلَ ذَلِكَ أَبْوَاباً فُتُحاً إِلَى فَضْلِهِ وَ أَسْبَاباً ذُلُلًا لِعَفْوِهِ وَ فِتْنَتِهِ كَمَا قَالَ الم. أَ حَسِبَ النَّاسُ أَنْ يُتْرَكُوا أَنْ يَقُولُوا آمَنَّا وَ هُمْ لا يُفْتَنُونَ. وَ لَقَدْ فَتَنَّا الَّذِينَ مِنْ قَبْلِهِمْ فَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ صَدَقُوا وَ لَيَعْلَمَنَّ الْكاذِبِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And it is reported that, ",
            "‘Amir Al-Momineen<sup>asws</sup> said in a sermon of his<sup>asws</sup>: ‘And had Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Praise, so Intended with His<sup>azwj</sup> Prophets<sup>as</sup>, when He<sup>azwj</sup> Sent them<sup>as</sup>, He<sup>azwj</sup> would have Opened for them treasures of gold, and mines of minerals, and plantations of Gardens, and flocks of birds of the sky and the animals of the land, along with them<sup>as</sup>, would have Done so. And, had He<sup>azwj</sup> Done so, the Trials would have dropped and the Recompense would have been invalidated, and the News (Commandments) would have been eroded, and whatever was Obligated for the speakers would have been for the deniers, nor would there have been a right of the Believers the Rewards of the good deeds, nor would the names have been necessitated for its deserving ones upon the clear meaning.  ",
            "And due to that, had Allah<sup>azwj</sup> Sent a Sign down from the sky, so it would have humbled their necks to it in submission, and had He<sup>azwj</sup> done so, the afflictions would have been dropped from the people altogether. But, Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Praise, Made His<sup>azwj</sup> Rasool<sup>saww</sup> of higher strength in their<sup>as</sup> determinations of their<sup>as</sup> intentions, and weak in what the eyes could see from their<sup>as</sup> state, from the contentment filling the hearts and the eyes, its self-sufficiency, and self-denial filling the parts of the hearing and the vision. ",
            "And had the Prophets<sup>as</sup> been the people of strength not seen (among the people), and might not merged, and a kingdom to which the necks of the men could extend to, and the belts of the men tightened to achieve, it would have been easier upon the creatures with regards to the choice and the remoteness of their regarding the arrogance, and to believe out of awe compelling for them, or desires to incline with. Thus, the intentions would be associated, and the good deeds divided.",
            "But, Allah<sup>azwj</sup> Intended that there should happen to be a following for His<sup>azwj</sup> Rasools<sup>as</sup>, and the ratifications for His<sup>azwj</sup> Books, and the humbleness to His<sup>azwj</sup> Religion, and the submissiveness to His<sup>azwj</sup> Commands, and the acceptance to His<sup>azwj</sup> obedience, the Commands being for Him<sup>azwj</sup> in particular, not being confused from others with impurity. ",
            "And every time the Trial and Test is greater, its Rewards and Recompens is more. Have you not observed that Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Praise, has Tested the former ones, since Adam<sup>as</sup> to the last of them from this world, with the stones which can neither harm nor benefit, nor can they see nor hear, so He<sup>azwj</sup> made it to be His<sup>azwj</sup> Sacred House (Kaaba) which has been Made for the people to stand (in Prayer). Then He<sup>azwj</sup> Placed it (Kaaba) at the rocky barren spot of the earth, and the least in generating vegetation, and the narrowest of valleys in livelihoods, and the harshest of the places of the Muslims for the water, between rough mountains, and soft sands, and springs of trickling flows, and cut-off towns, and hardly any traces of the drops from the sky which neither can the shoes be cleaned with nor hooves. ",
            "Then He<sup>azwj</sup> Commanded Adam<sup>as</sup> and his<sup>as</sup> children that they Praise Him<sup>azwj</sup> around it. So it became a resort for their journeys, and a destination for resting their rides. The fruits of their hearts incline towards it from the vast expansive lands, and the islands of the oceans cut-off, and the valleys of the deep glens, until they stoop their shoulders in humbleness, extolling to Allah<sup>azwj</sup> around it, and walking upon their feets, tired, dusty, for Him<sup>azwj</sup>, having cast their head-coverings and their regular trousers behind their backs, and fatigues, with the hair shaven off from their heads. ",
            "A grievous tribulation, and a great trial, and a difficult examination, a critical scrutiny, and clear devoutness. Allah<sup>azwj</sup> Made it a cause for His<sup>azwj</sup> Mercy, and a link and a means to His<sup>azwj</sup> Paradise, and a reason for His<sup>azwj</sup> Forgiveness, and a trial for His<sup>azwj</sup> creatures by His<sup>azwj</sup> Mercy. ",
            "And had Allah<sup>azwj</sup> Blessed and High Placed His<sup>azwj</sup> Sacred House, and Magnificent Signs between gardens and rivers, and ease and tranquility, thickness of the trees, laden with fruits, clad with vegetation, connected towns, brown fields, green meadows, rural houses with attractive courtyards, and scenic plantations, and well-built roads, and plentiful gardens, would have reduced the Recompense upon the accounting of the weakness of the Trial.",
            "Then, had the foundation been carried upon, and the stones raised by, between the green emeralds, and the red rubies, and light, and illuminations, that would have softened the wrestling against the doubts in the chests, and would have weakened the striving against Iblees<sup>la</sup> from ‘الْقُلُوبِ’ the hearts, and would have negated the weakening of the insecurities from the people. But, Allah<sup>azwj</sup> Mighty and Majestic Tests His<sup>azwj</sup> servants with a variety of difficulties, and they worship Him<sup>azwj</sup> with a variety of struggles, and He<sup>azwj</sup> Tries them with strikes of the difficulties to extract the arrogance from ‘قُلُوبِهِمْ’ their hearts, and settle the tremorts in their own selves.",
            "And, He<sup>azwj</sup> Made that as gateways opened to His<sup>azwj</sup> Mercy, and causes for ease to His<sup>azwj</sup> Forgiveness and His<sup>azwj</sup> Trial, just as He<sup>azwj</sup> Said <span class=\"ibTxt\">[29:1] Alif Lam Meem  [29:2] Do the people reckon that they will be left alone on saying, We believe, and they will not be Tested? [29:3] And We have Tested those before them, so Allah will Make known those who are truthful and He will Make known the liars</span>’."
          ],
          "en.sarwar": [
            "2. It is narrated that ’Amir al-Mu’minin once said in his sermon the following: “’Amir al-Mu’minin, ‘Alayhi al-Salam, has said that if Allah, Glorious is whose praise, wanted, He could have opened to His prophets the treasures of gold (stored), mines of pure growing gold, placed at their disposal, gardens of plantations, flocks of birds from the skies and animals on land. Had He done so, trial and testing system would have failed as well, the system of reward; the news (about the hereafter) vanished, people resting would have been the same as those under trial and assessment. The believers would not receive any reward as people of good deeds, nor do any name and terminology make any clear sense. In addition, if Allah were to send from the sky miracles to force their neck down to submission, He could have done so, but trial and test would have remained without basis in the case of all people. However, Allah, Glorious is whose praise, made His messengers to possess determination in their intentions, but weak to the eyes of people. “It is due to such determination that their (prophet’s) ability to exercise moderation fills up the hearts and eyes with satisfaction, with feeling of self-sufficiency and their exercising of self-abnegation fills up the ears and eyes (without question). Had the prophets been powerful beyond the power of others, had they had incompatible might and a kingdom that every man desired, and every one sought to achieve, it would have been easy to examine the creatures and far for the creatures to assume arrogance. They (people) would believe them for crushing fear from them or for the attractive interest found with them (the prophets). In such case, the intentions and good deeds remained subject to equal division and distribution. Allah, however, wanted that following of His messengers, acknowledgement of His books, expressing humbleness before Him, seeking comfort with His commands, submission to His orders, remain especially for Him alone, without any confusion or doubts to affect its purity of being just for Him. The more there is trial and greater test, the reward and compensation is worthier and appreciable. Have you not noticed that Allah, Glorious is whose praise, has tried and tested from Adam to the last ones of this world by means of stones that do not harm anyone or benefit them, do not see or hear? Thus, He has made it His sacred house, which He has made for people a place of worship. He then has made its location in a most barren land with rocks, the least in terms of fertility, the narrowest of valleys and means of living, the most difficult in availability of water for Muslims. It is among the rough hills, fine sands, fountains of very little water and towns that are cut off from each other, with very little traces of the drops from the sky which do not even reach anyone’s shoes or cloven-hoofs or hooves. He then commanded Adam and his offspring to ready themselves to turn to it. It then became the turning point for the destination of their journey, the final destination for them to rest. To this destination, the fruits of hearts fall from the wilderness, and vast extended land, from the cut off island in the oceans, from the deep valley of faraway places. They move their shoulders with humbleness, declaring around it (the House) that no one except Allah deserves worship. They walk on sand, on foot, dusty and tired for His sake. (One can see them) without head covering and (normal) dress, their heads shaven for the great trial, and tremendous test, intense examination, slow purification and sifting and with clear appeals. Allah has made it a means to achieve His kindness, a connection and means to reach His paradise, a reason to gain His forgiveness. It is a trial for His creatures through His kindness. The reward would have been very little and small if the trial had been of a certain lesser degree. This could happen if Allah, the most Blessed, the most High, were to place His Sacred House and other great monumental landmarks among the gardens, canals, open flat lands, thick groves of trees, easily accessible fruits, plentiful grass, connected towns, with brown colored fields, green gardens, countryside houses surrounded with beautiful yards, delightful farms, well built roads and many gardens. “The trial would turn into ease and comfort if the foundations on which it is carried, the stones with which it is raised were of green emerald, red ruby, lights and rays. This would reduce the creeping of doubts in the chests, make the struggle of Satan against the hearts very weak, nullify the pricking of doubts and hesitation by the people. Allah, the Most Majestic, the Most Glorious, however, tests and examines His servants by various kinds of difficult examinations. He makes them to prove their loyalty as worshippers by a hard struggle. He tries by means of hardships to expel arrogance from their hearts and settle humbleness in their souls, so that it can open the door to His favors and provide easy means for His forgiveness and His trial, as He has said, ’Do people think that they will be left without trial just because they have said, “We have believed?” We certainly placed under test and trial those who lived before them so that Allah would find who was truthful and who were the liars.’” (29:1-2) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:6",
  "kind": "verse_list"
}