{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 61"}, "path": "/books/al-kafi:4:3:61", "titles": {"ar": "بَابُ مَنْ يُعْطَى حَجَّةً مُفْرَدَةً فَيَتَمَتَّعُ أَوْ يَخْرُجُ مِنْ غَيْرِ الْمَوْضِعِ الَّذِي يُشْتَرَطُ", "en": "Chapter 61 – The one who is given (money) to perform exclusive Hajj, so he performs Tamatto, or he goes out from other than the place which was stipulated"}}], "index": 1004, "local_index": 61, "part_type": "Chapter", "path": "/books/al-kafi:4:3:61", "titles": {"ar": "بَابُ مَنْ يُعْطَى حَجَّةً مُفْرَدَةً فَيَتَمَتَّعُ أَوْ يَخْرُجُ مِنْ غَيْرِ الْمَوْضِعِ الَّذِي يُشْتَرَطُ", "en": "Chapter 61 – The one who is given (money) to perform exclusive Hajj, so he performs Tamatto, or he goes out from other than the place which was stipulated"}, "verse_count": 2, "verse_start_index": 7036, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 7037, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:61:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي رَجُلٍ أَعْطَى رَجُلًا دَرَاهِمَ يَحُجُّ بِهَا عَنْهُ حَجَّةً مُفْرَدَةً أَ يَجُوزُ لَهُ أَنْ يَتَمَتَّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ فَقَالَ نَعَمْ إِنَّمَا خَالَفَهُ إِلَى الْفَضْلِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, fom Ibn Mahboub, from Hisham Bin Salim, from Abu Baseer, ", "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding a man who gives Dirhams to a man to perform Hajj on his behalf, an exclusive Hajj. Would it suffice for him if he were to perform <span class=\"iTxt\">Tamatto</span> with the Umra to the Hajj?’ So he<sup>asws</sup> said: ‘Yes. But rather, he would have opposed him to perform the more meritorious one’."]}}, {"index": 7038, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:61:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ حَرِيزٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ أَعْطَى رَجُلًا حَجَّةً يَحُجُّ بِهَا عَنْهُ مِنَ الْكُوفَةِ فَحَجَّ عَنْهُ مِنَ الْبَصْرَةِ قَالَ لَا بَأْسَ إِذَا قَضَى جَمِيعَ مَنَاسِكِهِ فَقَدْ تَمَّ حَجُّهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Ali Bin Raib, from Hareyz who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who gives (money) to a man who had performed Hajj, to perform Hajj with it on his behalf from Al-Kufa, but he performs Hajj on his behalf from Al-Basra. He<sup>asws</sup> said: ‘There is no problem. When he fulfills the entirety of his rituals so he would have completed his Hajj’."]}}]}, "index": "al-kafi:4:3:61", "kind": "verse_list"}