{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 7"}, "path": "/books/al-kafi:4:3:7", "titles": {"ar": "بَابُ حَجِّ إِبْرَاهِيمَ وَ إِسْمَاعِيلَ وَ بِنَائِهِمَا الْبَيْتَ وَ مَنْ وَلِيَ الْبَيْتَ بَعْدَهُمَا ( عليهما السلام )", "en": "Chapter 7 – Hajj of Ibrahim<sup>as</sup> and Ismail<sup>as</sup>, and their<sup>as</sup> building the House (Kaaba), and the ones who were the guardians of the House (Kaaba) after them<sup>as</sup>"}}], "index": 950, "local_index": 7, "part_type": "Chapter", "path": "/books/al-kafi:4:3:7", "titles": {"ar": "بَابُ حَجِّ إِبْرَاهِيمَ وَ إِسْمَاعِيلَ وَ بِنَائِهِمَا الْبَيْتَ وَ مَنْ وَلِيَ الْبَيْتَ بَعْدَهُمَا ( عليهما السلام )", "en": "Chapter 7 – Hajj of Ibrahim<sup>as</sup> and Ismail<sup>as</sup>, and their<sup>as</sup> building the House (Kaaba), and the ones who were the guardians of the House (Kaaba) after them<sup>as</sup>"}, "verse_count": 19, "verse_start_index": 6691, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6692, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدَوَيْهِ بْنِ عَامِرٍ وَ غَيْرِهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا وُلِدَ إِسْمَاعِيلُ حَمَلَهُ إِبْرَاهِيمُ وَ أُمَّهُ عَلَى حِمَارٍ وَ أَقْبَلَ مَعَهُ جَبْرَئِيلُ حَتَّى وَضَعَهُ فِي مَوْضِعِ الْحِجْرِ وَ مَعَهُ شَيْ‏ءٌ مِنْ زَادٍ وَ سِقَاءٌ فِيهِ شَيْ‏ءٌ مِنْ مَاءٍ وَ الْبَيْتُ يَوْمَئِذٍ رَبْوَةٌ حَمْرَاءُ مِنْ مَدَرٍ فَقَالَ إِبْرَاهِيمُ لِجَبْرَئِيلَ ( عليه السلام ) هَاهُنَا أُمِرْتَ قَالَ نَعَمْ ", "قَالَ وَ مَكَّةُ يَوْمَئِذٍ سَلَمٌ وَ سَمُرٌ وَ حَوْلَ مَكَّةَ يَوْمَئِذٍ نَاسٌ مِنَ الْعَمَالِيقِ", "وَ فِي حَدِيثٍ آخَرَ عَنْهُ أَيْضاً قَالَ فَلَمَّا وَلَّى إِبْرَاهِيمُ قَالَتْ هَاجَرُ يَا إِبْرَاهِيمُ إِلَى مَنْ تَدَعُنَا قَالَ أَدَعُكُمَا إِلَى رَبِّ هَذِهِ الْبَنِيَّةِ ", "قالَ فَلَمَّا نَفِدَ الْمَاءُ وَ عَطِشَ الْغُلَامُ خَرَجَتْ حَتَّى صَعِدَتْ عَلَى الصَّفَا فَنَادَتْ هَلْ بِالْبَوَادِي مِنْ أَنِيسٍ ثُمَّ انْحَدَرَتْ حَتَّى أَتَتِ الْمَرْوَةَ فَنَادَتْ مِثْلَ ذَلِكَ ثُمَّ أَقْبَلَتْ رَاجِعَةً إِلَى ابْنِهَا فَإِذَا عَقِبُهُ يَفْحَصُ فِي مَاءٍ فَجَمَعَتْهُ فَسَاخَ وَ لَوْ تَرَكَتْهُ لَسَاحَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, and Al Husayn Bin Muhammad, from Abduwayh Bin Aamir, and someone else, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ahmad Bin Muhammad Bin Abu nast, from Aban Bin Usman, from Abu Al Abbas, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Ismail<sup>as</sup> was born, Ibrahim<sup>as</sup> and his<sup>as</sup> mother<sup>as</sup> carried him<sup>as</sup> upon a donkey, and Jibraeel<sup>as</sup> went with him<sup>as</sup>, until he<sup>as</sup> placed him<sup>as</sup> at the (Black) Stone, and with him<sup>as</sup> was something from provisions, and drink wherein was something from the water. And the House in those days, was a hillock of red mud. So Ibrahim<sup>as</sup> said to Jibraeel<sup>as</sup>: ‘Is it over here I<sup>as</sup> should build?’ He<sup>as</sup> said: ‘Yes’. ", "He<sup>asws</sup> said: ‘And in those days, Makkah were (trees of) <span class=\"iTxt\">Salmun</span> and <span class=\"iTxt\">Samrun</span>, and in those days around Makkah were people from Al-Amaleeq’. ", "And in another Hadeeth from him<sup>asws</sup> as well, he<sup>asws</sup> said: ‘When Ibrahim<sup>as</sup> turned (to leave), Hajar<sup>as</sup> said to him<sup>as</sup>: ‘To whom are you<sup>as</sup> leaving us<sup>as</sup>?’ He<sup>as</sup> said: ‘To the Lord<sup>azwj</sup> of this Building’.  ", "He<sup>asws</sup> said: ‘So when the water ran out and the boy was thirsty, she<sup>as</sup> went out until she<sup>as</sup> ascended Al-Safa. So she<sup>as</sup> called out: ‘Is there anyone kind in the valley?’ Then she<sup>as</sup> came down until she<sup>as</sup> went to Al-Marwa. So she<sup>as</sup> called out similar to that. Then she<sup>as</sup> turned returning to her<sup>as</sup> son<sup>as</sup>. So there he<sup>as</sup> was kicking his<sup>as</sup> heel in water. So she<sup>as</sup> gathered it. So it accumulated, and had she<sup>as</sup> neglected it, it would have evaporated’."]}}, {"index": 6693, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ إِبْرَاهِيمَ ( عليه السلام ) لَمَّا خَلَّفَ إِسْمَاعِيلَ بِمَكَّةَ عَطِشَ الصَّبِيُّ فَكَانَ فِيمَا بَيْنَ الصَّفَا وَ الْمَرْوَةِ شَجَرٌ فَخَرَجَتْ أُمُّهُ حَتَّى قَامَتْ عَلَى الصَّفَا فَقَالَتْ هَلْ بِالْبَوَادِي مِنْ أَنِيسٍ فَلَمْ تُجِبْهَا أَحَدٌ فَمَضَتْ حَتَّى انْتَهَتْ إِلَى الْمَرْوَةِ فَقَالَتْ هَلْ بِالْبَوَادِي مِنْ أَنِيسٍ فَلَمْ تُجَبْ ", "ثُمَّ رَجَعَتْ إِلَى الصَّفَا وَ قَالَتْ ذَلِكَ حَتَّى صَنَعَتْ ذَلِكَ سَبْعاً فَأَجْرَى اللَّهُ ذَلِكَ سُنَّةً وَ أَتَاهَا جَبْرَئِيلُ فَقَالَ لَهَا مَنْ أَنْتِ فَقَالَتْ أَنَا أُمُّ وَلَدِ إِبْرَاهِيمَ قَالَ لَهَا إِلَى مَنْ تَرَكَكُمْ فَقَالَتْ أَمَا لَئِنْ قُلْتَ ذَاكَ لَقَدْ قُلْتُ لَهُ حَيْثُ أَرَادَ الذَّهَابَ يَا إِبْرَاهِيمُ إِلَى مَنْ تَرَكْتَنَا فَقَالَ إِلَى اللَّهِ عَزَّ وَ جَلَّ فَقَالَ جَبْرَئِيلُ ( عليه السلام ) لَقَدْ وَكَلَكُمْ إِلَى كَافٍ ", "قَالَ وَ كَانَ النَّاسُ يَجْتَنِبُونَ الْمَمَرَّ إِلَى مَكَّةَ لِمَكَانِ الْمَاءِ فَفَحَصَ الصَّبِيُّ بِرِجْلِهِ فَنَبَعَتْ زَمْزَمُ قَالَ فَرَجَعَتْ مِنَ الْمَرْوَةِ إِلَى الصَّبِيِّ وَ قَدْ نَبَعَ الْمَاءُ فَأَقْبَلَتْ تَجْمَعُ التُّرَابَ حَوْلَهُ مَخَافَةَ أَنْ يَسِيحَ الْمَاءُ وَ لَوْ تَرَكَتْهُ لَكَانَ سَيْحاً ", "قَالَ فَلَمَّا رَأَتِ الطَّيْرُ الْمَاءَ حَلَّقَتْ عَلَيْهِ فَمَرَّ رَكْبٌ مِنَ الْيَمَنِ يُرِيدُ السَّفَرَ فَلَمَّا رَأَوُا الطَّيْرَ قَالُوا مَا حَلَّقَتِ الطَّيْرُ إِلَّا عَلَى مَاءٍ فَأَتَوْهُمْ فَسَقَوْهُمْ مِنَ الْمَاءِ فَأَطْعَمُوهُمُ الرَّكْبُ مِنَ الطَّعَامِ وَ أَجْرَى اللَّهُ عَزَّ وَ جَلَّ لَهُمْ بِذَلِكَ رِزْقاً وَ كَانَ النَّاسُ يَمُرُّونَ بِمَكَّةَ فَيُطْعِمُونَهُمْ مِنَ الطَّعَامِ وَ يَسْقُونَهُمْ مِنَ الْمَاءِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Ibrahim<sup>as</sup> left Ismail<sup>as</sup> at Makkah, the young child was thirsty. So there was a tree in between Al-Safa and Al-Marwa. So his<sup>as</sup> mother<sup>as</sup> went out until she<sup>as</sup> stood upon Al-Safa, so she<sup>as</sup> said: ‘Is there anyone in the valley who is kind?’ But no one answered her<sup>as</sup>. So she<sup>as</sup> went until she<sup>as</sup> ended up to Al-Marwa, and she<sup>as</sup> said: ‘Is there anyone in the valley who is kind?’ But she<sup>as</sup> was not answered. ", "Then she<sup>as</sup> returned to Al-Safa and said that, until she did that seven (times). Thus, Allah<sup>azwj</sup> Made that to flow as a Sunnah, and Jibraeel<sup>as</sup> came to her<sup>as</sup>, so he<sup>as</sup> said to her<sup>as</sup>: ‘Who are you<sup>as</sup>?’ So she<sup>as</sup> said: ‘I<sup>as</sup> am a mother of a son<sup>as</sup> of Ibrahim<sup>as</sup>’. He<sup>as</sup> said to her<sup>as</sup>: ‘To whom did he<sup>as</sup> leave you<sup>as</sup>?’ So she<sup>as</sup> said: ‘But, you<sup>as</sup> say that. I<sup>as</sup> did say to him<sup>as</sup>, ‘Where are you<sup>as</sup> intending to go, O Ibrahim<sup>as</sup>, to whom are you<sup>as</sup> leaving us<sup>as</sup>?’ So he<sup>as</sup> said: ‘To Allah<sup>azwj</sup> Mighty and Majestic’. So Jibraeel<sup>as</sup> said: ‘And he<sup>as</sup> has allocated you<sup>as</sup> to (One Who is) Sufficient’. ", "He<sup>asws</sup> said: ‘And the people used to keep away from passing by Makkah due to the scarcity of the water. So the child kicked with his<sup>as</sup> leg and Zamzam flowed. So she<sup>as</sup> returned from Al-Marwa to the child, and the water had accumulated. So she collected the sand to gather around it, fearing that the water would evaporate, and had she<sup>as</sup> neglected it, it would have evaporated.", "He<sup>asws</sup> said; ‘So when the birds saw the water, they encircled over it. So the riders passed by from Al-Yemen intending the journey, and when they saw the birds, they said, ‘The birds would not encircle except upon the water’. So they came over to them<sup>as</sup>, and they<sup>as</sup> quenched them from the water. So the riders (in turn) fed them<sup>as</sup> from the food, and Allah<sup>azwj</sup> Mighty and Majestic Caused that to flow for them<sup>as</sup> as livelihood. And the people used to pass by at Makkah, so they would be feeding them<sup>as</sup> from the food, and they<sup>as</sup> were quenching them from the water’."]}}, {"index": 6694, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ إِدْرِيسَ عَنْ عِيسَى بْنِ مُحَمَّدِ بْنِ أَبِي أَيُّوبَ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَلِيِّ بْنِ مَنْصُورٍ عَنْ كُلْثُومِ بْنِ عَبْدِ الْمُؤْمِنِ الْحَرَّانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَمَرَ اللَّهُ عَزَّ وَ جَلَّ إِبْرَاهِيمَ ( عليه السلام ) أَنْ يَحُجَّ وَ يُحِجَّ إِسْمَاعِيلَ مَعَهُ وَ يُسْكِنَهُ الْحَرَمَ فَحَجَّا عَلَى جَمَلٍ أَحْمَرَ وَ مَا مَعَهُمَا إِلَّا جَبْرَئِيلُ ( عليه السلام ) فَلَمَّا بَلَغَا الْحَرَمَ قَالَ لَهُ جَبْرَئِيلُ يَا إِبْرَاهِيمُ انْزِلَا فَاغْتَسِلَا قَبْلَ أَنْ تَدْخُلَا الْحَرَمَ فَنَزَلَا فَاغْتَسَلَا وَ أَرَاهُمَا كَيْفَ يَتَهَيَّئَانِ لِلْإِحْرَامِ فَفَعَلَا", "ثُمَّ أَمَرَهُمَا فَأَهَلَّا بِالْحَجِّ وَ أَمَرَهُمَا بِالتَّلْبِيَاتِ الْأَرْبَعِ الَّتِي لَبَّى بِهَا الْمُرْسَلُونَ ثُمَّ صَارَ بِهِمَا إِلَى الصَّفَا فَنَزَلَا وَ قَامَ جَبْرَئِيلُ بَيْنَهُمَا وَ اسْتَقْبَلَ الْبَيْتَ فَكَبَّرَ اللَّهَ وَ كَبَّرَا وَ هَلَّلَ اللَّهَ وَ هَلَّلَا وَ حَمَّدَ اللَّهَ وَ حَمَّدَا وَ مَجَّدَ اللَّهَ وَ مَجَّدَا وَ أَثْنَى عَلَيْهِ وَ فَعَلَا مِثْلَ ذَلِكَ", "وَ تَقَدَّمَ جَبْرَئِيلُ وَ تَقَدَّمَا يُثْنِيَانِ عَلَى اللَّهِ عَزَّ وَ جَلَّ وَ يُمَجِّدَانِهِ حَتَّى انْتَهَى بِهِمَا إِلَى مَوْضِعِ الْحَجَرِ فَاسْتَلَمَ جَبْرَئِيلُ الْحَجَرَ وَ أَمَرَهُمَا أَنْ يَسْتَلِمَا وَ طَافَ بِهِمَا أُسْبُوعاً ثُمَّ قَامَ بِهِمَا فِي مَوْضِعِ مَقَامِ إِبْرَاهِيمَ ( عليه السلام ) فَصَلَّى رَكْعَتَيْنِ وَ صَلَّيَا ثُمَّ أَرَاهُمَا الْمَنَاسِكَ وَ مَا يَعْمَلَانِ بِهِ", "فَلَمَّا قَضَيَا مَنَاسِكَهُمَا أَمَرَ اللَّهُ إِبْرَاهِيمَ ( عليه السلام ) بِالِانْصِرَافِ وَ أَقَامَ إِسْمَاعِيلُ وَحْدَهُ مَا مَعَهُ أَحَدٌ غَيْرُ أُمِّهِ فَلَمَّا كَانَ مِنْ قَابِلٍ أَذِنَ اللَّهُ لِإِبْرَاهِيمَ ( عليه السلام ) فِي الْحَجِّ وَ بِنَاءِ الْكَعْبَةِ وَ كَانَتِ الْعَرَبُ تَحُجُّ إِلَيْهِ وَ إِنَّمَا كَانَ رَدْماً إِلَّا أَنَّ قَوَاعِدَهُ مَعْرُوفَةٌ", "فَلَمَّا صَدَرَ النَّاسُ جَمَعَ إِسْمَاعِيلُ الْحِجَارَةَ وَ طَرَحَهَا فِي جَوْفِ الْكَعْبَةِ فَلَمَّا أَذِنَ اللَّهُ لَهُ فِي الْبِنَاءِ قَدِمَ إِبْرَاهِيمُ ( عليه السلام ) فَقَالَ يَا بُنَيَّ قَدْ أَمَرَنَا اللَّهُ بِبِنَاءِ الْكَعْبَةِ وَ كَشَفَا عَنْهَا فَإِذَا هُوَ حَجَرٌ وَاحِدٌ أَحْمَرُ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ ضَعْ بِنَاءَهَا عَلَيْهِ وَ أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ أَرْبَعَةَ أَمْلَاكٍ يَجْمَعُونَ إِلَيْهِ الْحِجَارَةَ", "فَكَانَ إِبْرَاهِيمُ وَ إِسْمَاعِيلُ ( عليهما السلام ) يَضَعَانِ الْحِجَارَةَ وَ الْمَلَائِكَةُ تُنَاوِلُهُمَا حَتَّى تَمَّتِ اثْنَا عَشَرَ ذِرَاعاً وَ هَيَّئَا لَهُ بَابَيْنِ بَاباً يُدْخَلُ مِنْهُ وَ بَاباً يُخْرَجُ مِنْهُ وَ وَضَعَا عَلَيْهِ عَتَباً وَ شَرَجاً مِنْ حَدِيدٍ عَلَى أَبْوَابِهِ وَ كَانَتِ الْكَعْبَةُ عُرْيَانَةً فَصَدَرَ إِبْرَاهِيمُ وَ قَدْ سَوَّى الْبَيْتَ وَ أَقَامَ إِسْمَاعِيلُ", "فَلَمَّا وَرَدَ عَلَيْهِ النَّاسُ نَظَرَ إِلَى امْرَأَةٍ مِنْ حِمْيَرٍ أَعْجَبَهُ جَمَالُهَا فَسَأَلَ اللَّهَ عَزَّ وَ جَلَّ أَنْ يُزَوِّجَهَا إِيَّاهُ وَ كَانَ لَهَا بَعْلٌ فَقَضَى اللَّهُ عَلَى بَعْلِهَا بِالْمَوْتِ وَ أَقَامَتْ بِمَكَّةَ حُزْناً عَلَى بَعْلِهَا فَأَسْلَى اللَّهُ ذَلِكَ عَنْهَا وَ زَوَّجَهَا إِسْمَاعِيلَ ", "وَ قَدِمَ إِبْرَاهِيمُ الْحَجَّ وَ كَانَتِ امْرَأَةً مُوَفَّقَةً وَ خَرَجَ إِسْمَاعِيلُ إِلَى الطَّائِفِ يَمْتَارُ لِأَهْلِهِ طَعَاماً فَنَظَرَتْ إِلَى شَيْخٍ شَعِثٍ فَسَأَلَهَا عَنْ حَالِهِمْ فَأَخْبَرَتْهُ بِحُسْنِ حَالٍ فَسَأَلَهَا عَنْهُ خَاصَّةً فَأَخْبَرَتْهُ بِحُسْنِ الدِّينِ وَ سَأَلَهَا مِمَّنْ أَنْتِ فَقَالَتْ امْرَأَةٌ مِنْ حِمْيَرٍ فَسَارَ إِبْرَاهِيمُ وَ لَمْ يَلْقَ إِسْمَاعِيلَ وَ قَدْ كَتَبَ إِبْرَاهِيمُ كِتَاباً فَقَالَ ادْفَعِي هَذَا إِلَى بَعْلِكِ إِذَا أَتَى إِنْ شَاءَ اللَّهُ", "فَقَدِمَ عَلَيْهَا إِسْمَاعِيلُ فَدَفَعَتْ إِلَيْهِ الْكِتَابَ فَقَرَأَهُ فَقَالَ أَ تَدْرِينَ مَنْ هَذَا الشَّيْخُ فَقَالَتْ لَقَدْ رَأَيْتُهُ جَمِيلًا فِيهِ مُشَابَهَةٌ مِنْكَ قَالَ ذَاكَ إِبْرَاهِيمُ فَقَالَتْ وَا سَوْأَتَاهْ مِنْهُ فَقَالَ وَ لِمَ نَظَرَ إِلَى شَيْ‏ءٍ مِنْ مَحَاسِنِكِ فَقَالَتْ لَا وَ لَكِنْ خِفْتُ أَنْ أَكُونَ قَدْ قَصَّرْتُ وَ قَالَتْ لَهُ الْمَرْأَةُ وَ كَانَتْ عَاقِلَةً فَهَلَّا تُعَلِّقُ عَلَى هَذَيْنِ الْبَابَيْنِ سِتْرَيْنِ سِتْراً مِنْ هَاهُنَا وَ سِتْراً مِنْ هَاهُنَا فَقَالَ لَهَا نَعَمْ", "فَعَمِلَا لَهُمَا سِتْرَيْنِ طُولُهُمَا اثْنَا عَشَرَ ذِرَاعاً فَعَلَّقَاهُمَا عَلَى الْبَابَيْنِ فَأَعْجَبَهُمَا ذَلِكَ فَقَالَتْ فَهَلَّا أَحُوكُ لِلْكَعْبَةِ ثِيَاباً فَتَسْتُرَهَا كُلَّهَا فَإِنَّ هَذِهِ الْحِجَارَةَ سَمِجَةٌ فَقَالَ لَهَا إِسْمَاعِيلُ بَلَى فَأَسْرَعَتْ فِي ذَلِكَ وَ بَعَثَتْ إِلَى قَوْمِهَا بِصُوفٍ كَثِيرٍ تَسْتَغْزِلُهُمْ", "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ إِنَّمَا وَقَعَ اسْتِغْزَالُ النِّسَاءِ مِنْ ذَلِكَ بَعْضِهِنَّ لِبَعْضٍ لِذَلِكَ قَالَ فَأَسْرَعَتْ وَ اسْتَعَانَتْ فِي ذَلِكَ فَكُلَّمَا فَرَغَتْ مِنْ شُقَّةٍ عَلَّقَتْهَا فَجَاءَ الْمَوْسِمُ وَ قَدْ بَقِيَ وَجْهٌ مِنْ وُجُوهِ الْكَعْبَةِ فَقَالَتْ لِإِسْمَاعِيلَ كَيْفَ نَصْنَعُ بِهَذَا الْوَجْهِ الَّذِي لَمْ تُدْرِكْهُ الْكِسْوَةُ فَكَسَوْهُ خَصَفاً", "فَجَاءَ الْمَوْسِمُ وَ جَاءَتْهُ الْعَرَبُ عَلَى حَالِ مَا كَانَتْ تَأْتِيهِ فَنَظَرُوا إِلَى أَمْرٍ أَعْجَبَهُمْ فَقَالُوا يَنْبَغِي لِعَامِلِ هَذَا الْبَيْتِ أَنْ يُهْدَى إِلَيْهِ فَمِنْ ثَمَّ وَقَعَ الْهَدْيُ فَأَتَى كُلُّ فَخِذٍ مِنَ الْعَرَبِ بِشَيْ‏ءٍ يَحْمِلُهُ مِنْ وَرِقٍ وَ مِنْ أَشْيَاءَ غَيْرِ ذَلِكَ حَتَّى اجْتَمَعَ شَيْ‏ءٌ كَثِيرٌ فَنَزَعُوا ذَلِكَ الْخَصَفَ وَ أَتَمُّوا كِسْوَةَ الْبَيْتِ وَ عَلَّقُوا عَلَيْهَا بَابَيْنِ", "وَ كَانَتِ الْكَعْبَةُ لَيْسَتْ بِمُسَقَّفَةٍ فَوَضَعَ إِسْمَاعِيلُ فِيهَا أَعْمِدَةً مِثْلَ هَذِهِ الْأَعْمِدَةِ الَّتِي تَرَوْنَ مِنْ خَشَبٍ وَ سَقَّفَهَا إِسْمَاعِيلُ بِالْجَرَائِدِ وَ سَوَّاهَا بِالطِّينِ فَجَاءَتِ الْعَرَبُ مِنَ الْحَوْلِ فَدَخَلُوا الْكَعْبَةَ وَ رَأَوْا عِمَارَتَهَا فَقَالُوا يَنْبَغِي لِعَامِلِ هَذَا الْبَيْتِ أَنْ يُزَادَ فَلَمَّا كَانَ مِنْ قَابِلٍ جَاءَهُ الْهَدْيُ فَلَمْ يَدْرِ إِسْمَاعِيلُ كَيْفَ يَصْنَعُ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنِ انْحَرْهُ وَ أَطْعِمْهُ الْحَاجَّ", "قَالَ وَ شَكَا إِسْمَاعِيلُ إِلَى إِبْرَاهِيمَ قِلَّةَ الْمَاءِ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى إِبْرَاهِيمَ أَنِ احْتَفِرْ بِئْراً يَكُونُ مِنْهَا شَرَابُ الْحَاجِّ فَنَزَلَ جَبْرَئِيلُ ( عليه السلام ) فَاحْتَفَرَ قَلِيبَهُمْ يَعْنِي زَمْزَمَ حَتَّى ظَهَرَ مَاؤُهَا ثُمَّ قَالَ جَبْرَئِيلُ ( عليه السلام ) انْزِلْ يَا إِبْرَاهِيمُ فَنَزَلَ بَعْدَ جَبْرَئِيلَ فَقَالَ يَا إِبْرَاهِيمُ اضْرِبْ فِي أَرْبَعِ زَوَايَا الْبِئْرِ وَ قُلْ بِسْمِ اللَّهِ", "قَالَ فَضَرَبَ إِبْرَاهِيمُ ( عليه السلام ) فِي الزَّاوِيَةِ الَّتِي تَلِي الْبَيْتَ وَ قَالَ بِسْمِ اللَّهِ فَانْفَجَرَتْ عَيْنٌ ثُمَّ ضَرَبَ فِي الزَّاوِيَةِ الثَّانِيَةِ وَ قَالَ بِسْمِ اللَّهِ فَانْفَجَرَتْ عَيْنٌ ثُمَّ ضَرَبَ فِي الثَّالِثَةِ وَ قَالَ بِسْمِ اللَّهِ فَانْفَجَرَتْ عَيْنٌ ثُمَّ ضَرَبَ فِي الرَّابِعَةِ وَ قَالَ بِسْمِ اللَّهِ فَانْفَجَرَتْ عَيْنٌ", "وَ قَالَ لَهُ جَبْرَئِيلُ اشْرَبْ يَا إِبْرَاهِيمُ وَ ادْعُ لِوَلَدِكَ فِيهَا بِالْبَرَكَةِ وَ خَرَجَ إِبْرَاهِيمُ ( عليه السلام ) وَ جَبْرَئِيلُ جَمِيعاً مِنَ الْبِئْرِ فَقَالَ لَهُ أَفِضْ عَلَيْكَ يَا إِبْرَاهِيمُ وَ طُفْ حَوْلَ الْبَيْتِ فَهَذِهِ سُقْيَا سَقَاهَا اللَّهُ وُلْدَ إِسْمَاعِيلَ فَسَارَ إِبْرَاهِيمُ وَ شَيَّعَهُ إِسْمَاعِيلُ حَتَّى خَرَجَ مِنَ الْحَرَمِ فَذَهَبَ إِبْرَاهِيمُ وَ رَجَعَ إِسْمَاعِيلُ إِلَى الْحَرَمِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya and Ahmad Bin Idrees, from Isa Bin Muhammad Bin Abu Ayoub, from Ali Bin Mahziyar, from Al Husayn Bin saeed, from Ali Bin Mansour, from Kulsoum in Abdul Momin Al Harrany, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Commanded Ibrahim<sup>as</sup> that he should perform Hajj and Ismail<sup>as</sup> should perform Hajj along with him<sup>as</sup> and settle him<sup>as</sup> in the sanctuary. So he<sup>as</sup> performed Hajj upon a red camel, and there wasn’t anyone with him<sup>as</sup> except for Jibraeel<sup>as</sup>. So when he<sup>as</sup> reached the Sanctuary, Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘O Ibrahim<sup>as</sup>! Both of you<sup>as</sup> should descend and bathe before entering the Sanctuary’. So they both<sup>as</sup> descended and bathed, and he<sup>as</sup> showed them<sup>as</sup> how they<sup>as</sup> should be preparing for the Ihraam. So they<sup>as</sup> did. ", "Then he<sup>as</sup> instructed them<sup>as</sup> to welcome with the Hajj and instructed them<sup>as</sup> with the four <span class=\"iTxt\">Talbiyya </span> (Here I am O Allah<sup>azwj</sup>!) which the Mursil Prophets<sup>as</sup> had exclaimed beforehand. Then he<sup>as</sup> went with them<sup>as</sup> to Al-Safa, so they encamped, and Jibraeel<sup>as</sup> stood in between them<sup>as</sup>, and faced the House (Kaaba). So he<sup>as</sup> exclaimed <span class=\"iTxt\">Takbeer</span>, so they<sup>as</sup> exclaimed <span class=\"iTxt\">Takbeer</span>, and he<sup>as</sup> extolled Allah<sup>azwj</sup> and they<sup>as</sup> extolled Allah<sup>azwj</sup>, and he<sup>as</sup> Praised and Glorified Allah<sup>azwj</sup>, so they<sup>as</sup> Praised and Glorified Allah<sup>azwj</sup>, and he<sup>as</sup> commended upon Him<sup>azwj</sup> and they<sup>as</sup> both did similar to that.", "And Jibraeel<sup>as</sup> proceeded, and they<sup>as</sup> both went Praising upon Allah<sup>azwj</sup> Mighty and Majestic and Glorifying Him<sup>azwj</sup> until they ended up with them<sup>as</sup> to the place of the (Black) Stone. So Jibraeel<sup>as</sup> kissed the Stone, and instructed them that they should both<sup>as</sup> kiss it and circumambulate it, seven (times). Then he<sup>as</sup> stood with them<sup>as</sup> in the place of Standing Place of Ibrahim<sup>as</sup>, so he<sup>as</sup> Prayed two Cyclces, and they both<sup>as</sup> Prayed. Then he<sup>as</sup> showed them<sup>as</sup> the rituals and what they<sup>as</sup> should be doing with it. ", "So when they<sup>as</sup> had fulfilled their<sup>as</sup> rituals, Allah<sup>azwj</sup> Commanded Ibrahim<sup>as</sup> with the leaving and Ismail<sup>as</sup> to stay alone, not having anyone with him<sup>as</sup> apart from his<sup>as</sup> mother<sup>as</sup>. So when it was the next (year), Allah<sup>azwj</sup> Permitted Ibrahim<sup>as</sup> for the Hajj and building of the Kaaba. And it was such that the Arabs used to perform Pilgrimage to it, and rather is was in ruins except that its foundations were well known. ", "So when the people departed, Ismail<sup>as</sup> gathered the rocks and placed them in the middle of the Kaaba. So when Allah<sup>azwj</sup> Permitted for him<sup>as</sup> regarding the building, Ibrahim<sup>as</sup> proceeded, so he<sup>as</sup> said: ‘O my<sup>as</sup> son<sup>as</sup>! Allah<sup>azwj</sup> has Commanded us<sup>as</sup> with the building of the Kaaba’, and he<sup>as</sup> uncovered from it, and there it was, one red rock. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “Build the construction upon it”, and, Allah<sup>azwj</sup> Mighty and Majestic Sent four Angels who were gathering the rock towards it.", "Ibrahim<sup>as</sup> and Ismail<sup>as</sup> used to place the rocks, and the Angels were pulling them, until twelve cubits were completed, and two doors were made for it, one door to enter from, and a door to exit from, and placed steps for it and a canopy of iron upon its doors. And the Kaaba was bare, so Ibrahim<sup>as</sup> departed and he<sup>as</sup> had evened out the House, and Ismail<sup>as</sup> stayed.", "So when the people came over he<sup>as</sup> saw a woman from Himeyr whose beauty astounded them. So he<sup>as</sup> asked Allah<sup>azwj</sup> Mighty and Majestic to get him<sup>as</sup> to be married to her, and she used to have a husband for her. So Allah<sup>azwj</sup> Judge upon her husband with the death, and she stayed at Makkah in grief upon her husband. So Allah<sup>azwj</sup> Eased that from her and Ismail<sup>as</sup> married her.", "And Ibrahim<sup>as</sup> proceeded to Hajj, and the woman stayed at home and Ismail<sup>as</sup> went out to Al-Taif to acquire some provisions for his<sup>as</sup> family. So she looked at an old disheveled man. So he<sup>as</sup> asked about their state, and she informed him<sup>as</sup> with the goodness of the state. So he<sup>as</sup> asked her about him<sup>as</sup> in particular. So she informed him<sup>as</sup> with the goodness of the Religion, and he<sup>as</sup> asked her: ‘Where are you from?’ So she said, ‘A woman from Himeyr’. So Ibrahim<sup>as</sup> went and did not meet Ismail<sup>as</sup>, and Ibrahim<sup>as</sup> had written a letter, so he<sup>as</sup> said: ‘Hand it over to your husband when he<sup>as</sup> comes, Allah<sup>azwj</sup> Willing’. ", "Ismail<sup>as</sup> came back to her, so she handed over the letter to him<sup>as</sup>. He<sup>as</sup> read it and said: ‘Do you know who this old man is?’ So she said, ‘I had seen him<sup>as</sup> as more handsome than you<sup>as</sup> in his<sup>as</sup> resemblance’. He<sup>as</sup> said: ‘That is Ibrahim<sup>as</sup>’. So she said, ‘Aah! Evil is what I was with him<sup>as</sup>’. So he<sup>as</sup> said: ‘And why is that so? Did he<sup>as</sup> look at anything from your beauty?’ She said, ‘No, but I fear that I have been deficient’. And the woman said to him<sup>as</sup>, and she was intelligent, ‘So why don’t we hand curtains upon these two doors, one curtains from over here, and one curtain from over here?’ So he<sup>as</sup> said to her: ‘Yes’. ", "So they made two curtains for these two (doors), the length of which were twelve cubits, to be upon the two doors. That astounded them both, so she said, ‘So why don’t I weave clothes for the Kaaba, so I could veil all of it, for these stones are dull’ So Ismail<sup>as</sup> said to her: ‘Yes’. So she hurried with regards to that and sent a message to her people for a lot of wool to be spun by them.", "Abu Abdullah<sup>asws</sup> said: ‘And rather, the spinning by the women occurred from that, some of them for the other, due to that. So she was quick and was aided in that, so every time she was free from a strip, so hung it. So the season (for Hajj) came, and there remained one faced from the facets of the Kaaba, so she said to Ismail<sup>as</sup>, ‘How shall we deal with this facet which is not covered by the apparel?’ So he<sup>as</sup> covered it with fibres. ", "So the season (for Hajj) came, and the Arabs came over upon a state which they used to come, so they looked at a matter which amazed them. So they said, ‘It is befitting for the worker of this House that one makes an offering to him’. So from then on, the offering occurred, and every tribe from the Arabs came with something, carrying it, from money, and from things other than that, until a lot of things became gathered. So they removed that fibre and completed the apparel of the House (Kaaba), and hung it upon the two doors. ", "And the Kaaba wasn’t with a ceiling, so Ismail<sup>as</sup> placed columns therein similar to these columns which you are seeing (today), from wood. And Ismail<sup>as</sup> roofed it with the boards and evened it with the clay. So the Arabs came from the (next) year and they entered the Kaaba and saw its construction, so they said, ‘It is befitting for the worker of this House (Kaaba) that he should be increased’. So when it was the following year they came with the offerings. Ismail<sup>as</sup> did not know how he<sup>as</sup> should be dealing with it, so Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup> he<sup>as</sup> should sacrificed (the animals) and feed it to the Pilgrims’.", "He<sup>asws</sup> said: ‘And Ismail<sup>as</sup> complained to Ibrahim<sup>as</sup> of the scarcity of the water, so Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Ibrahim<sup>as</sup> that he<sup>as</sup> should dig a well from there to occur drinking for the Pilgrims from it. So Jibraeel<sup>as</sup> descended and dug their<sup>as</sup> well, meaning Zamzam, until its water appeared. Then Jibraeel<sup>as</sup> said: ‘Descend, O Ibrahim<sup>as</sup>!’ So he<sup>as</sup> descended after Jibraeel<sup>as</sup>. So he<sup>as</sup> said; ‘O Ibrahim<sup>as</sup>! Strike in the four corners of the well and say: ‘In the Name of Allah<sup>azwj</sup>!’", "He<sup>asws</sup> said: ‘So Ibrahim<sup>as</sup> struck in the corner which faced the House and said: ‘In the Name of Allah<sup>azwj</sup>!’ So a spring sprouted. Then he<sup>as</sup> struck in the second corner and said: ‘In the Name of Allah<sup>azwj</sup>!’ So a spring sprouted. Then he<sup>as</sup> struck in the third, and said: ‘In the Name of Allah<sup>azwj</sup>!’ So a spring sprouted. Then he<sup>as</sup> struck in the fourth, and said: ‘In the Name of Allah<sup>azwj</sup>!’ So a spring sprouted.", "And Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘Drink, O Ibrahim<sup>as</sup>, and supplicate for your<sup>as</sup> son in it, for the Blessing’. And Ibrahim<sup>as</sup> and Jibraeel<sup>as</sup> came out from the well together. So he<sup>as</sup> said to him<sup>as</sup>: ‘I<sup>as</sup> leave it upon you<sup>as</sup>, O Ibrahim<sup>as</sup>, and circumambulate the House, for this here is a watering place which Allah<sup>azwj</sup> would Quench the children of Ismail<sup>as</sup>’. So Ibrahim<sup>as</sup> went and Ismail<sup>as</sup> accompanied him<sup>as</sup> until he<sup>as</sup> went out from the Sanctuary. Ibrahim<sup>as</sup> went away, and Ismail<sup>as</sup> returned to the Sanctuary’."]}}, {"index": 6695, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدَوَيْهِ بْنِ عَامِرٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عُقْبَةَ بْنِ بَشِيرٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَمَرَ إِبْرَاهِيمَ بِبِنَاءِ الْكَعْبَةِ وَ أَنْ يَرْفَعَ قَوَاعِدَهَا وَ يُرِيَ النَّاسَ مَنَاسِكَهُمْ فَبَنَى إِبْرَاهِيمُ وَ إِسْمَاعِيلُ الْبَيْتَ كُلَّ يَوْمٍ سَافاً حَتَّى انْتَهَى إِلَى مَوْضِعِ الْحَجَرِ الْأَسْوَدِ ", "قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَنَادَى أَبُو قُبَيْسٍ إِبْرَاهِيمَ ( عليه السلام ) إِنَّ لَكَ عِنْدِي وَدِيعَةً فَأَعْطَاهُ الْحَجَرَ فَوَضَعَهُ مَوْضِعَهُ ثُمَّ إِنَّ إِبْرَاهِيمَ ( عليه السلام ) أَذَّنَ فِي النَّاسِ بِالْحَجِّ فَقَالَ أَيُّهَا النَّاسُ إِنِّي إِبْرَاهِيمُ خَلِيلُ اللَّهِ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تَحُجُّوا هَذَا الْبَيْتَ فَحُجُّوهُ فَأَجَابَهُ مَنْ يَحُجُّ إِلَى يَوْمِ الْقِيَامَةِ وَ كَانَ أَوَّلُ مَنْ أَجَابَهُ مِنْ أَهْلِ الْيَمَنِ ", "قَالَ وَ حَجَّ إِبْرَاهِيمُ ( عليه السلام ) هُوَ وَ أَهْلُهُ وَ وَلَدُهُ فَمَنْ زَعَمَ أَنَّ الذَّبِيحَ هُوَ إِسْحَاقُ فَمَنْ هَاهُنَا كَانَ ذَبَحَهُ .", "وَ ذُكِرَ عَنْ أَبِي بَصِيرٍ أَنَّهُ سَمِعَ أَبَا جَعْفَرٍ وَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَزْعُمَانِ أَنَّهُ إِسْحَاقُ فَأَمَّا زُرَارَةُ فَزَعَمَ أَنَّهُ إِسْمَاعِيلُ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, and Al Husayn Bin Muhammad, from Abduwayh Bin Aamir, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ahmad Bni Muhammad Bin Abu Nasr, from Aban Bin usman, from Uqba Bin Basheer, ", "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Commanded Ibrahim<sup>as</sup> with the building of the House (Kaaba), and that he<sup>as</sup> should raise its foundations, and show the people their rituals (to be performed). Therefore, Ibrahim<sup>as</sup> and Ismail<sup>as</sup> built the House (Kaaba) every day, endeavouring, until they ended up to the place of the (Black) Stone’. ", "Abu Ja’far<sup>asws</sup> said: ‘So Ibrahim<sup>as</sup> called out on (Mount) Abu Qubays: ‘There is an entrustment with me<sup>as</sup> for you!’ So he<sup>as</sup> gave it the (Black) Stone, and he<sup>as</sup> placed it in its place. Then Ibrahim<sup>as</sup> called out among the people with the Hajj, so he<sup>as</sup> said: ‘O you people! I<sup>as</sup> am Ibrahim<sup>as</sup>, the Friend of Allah<sup>azwj</sup>! Allah<sup>azwj</sup> Commands you all that you should be performing the Hajj of this House (Kaaba)! So perform its Hajj!’ So they answered, the ones who would be performing Hajj, up to the Day of Judgement, and the first one who answered him<sup>as</sup> were from the people of Al-Yemen’. ", "He<sup>asws</sup> said: ‘And Ibrahim<sup>as</sup> performed Hajj, him<sup>as</sup> and his<sup>as</sup> wife and his children. So the one who claims that the slaughtered one, he was Is’haq, so it is from over here he was slaughtered’.", "And it is mentioned from Abu Baseer that he heard Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both claiming that it was Is’haq, and as for Zurara, so he claimes that it was Ismail<sup>as</sup>."]}}, {"index": 6696, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ قَالَ قَالَ أَبُو الْحَسَنِ ( عليه السلام ) يَعْنِي الرِّضَا لِلْحَسَنِ بْنِ الْجَهْمِ أَيُّ شَيْ‏ءٍ السَّكِينَةُ عِنْدَكُمْ فَقَالَ لَا أَدْرِي جُعِلْتُ فِدَاكَ وَ أَيُّ شَيْ‏ءٍ هِيَ قَالَ رِيحٌ تَخْرُجُ مِنَ الْجَنَّةِ طَيِّبَةٌ لَهَا صُورَةٌ كَصُورَةِ وَجْهِ الْإِنْسَانِ فَتَكُونُ مَعَ الْأَنْبِيَاءِ وَ هِيَ الَّتِي نَزَلَتْ عَلَى إِبْرَاهِيمَ ( عليه السلام ) حَيْثُ بَنَى الْكَعْبَةَ فَجَعَلَتْ تَأْخُذُ كَذَا وَ كَذَا فَبَنَى الْأَسَاسَ عَلَيْهَا .", "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ السَّكِينَةِ فَذَكَرَ مِثْلَهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal who said, ", "‘Abu Al-Hassan<sup>asws</sup>, meaning Al-Reza<sup>asws</sup>, said to Al-Hassan Bin Jaham: ‘Which thing is the tranquility in your presence?’ So he said, ‘I do not know, may I be sacrificed for you<sup>asws</sup>, and which thing is it?’ He<sup>asws</sup> said: ‘A wind coming out from the Paradise, aromatic. For it is an image like the image of the face of a human being. So it happens to be with the Prophets<sup>as</sup>, and it is which descended unto Ibrahim<sup>as</sup>, when he<sup>as</sup> built the Kaaba. So it went on to take such and such, so the foundation was built upon it’. ", "Ali Bin Ibrahim, from his father, from Ali Bin Asbaat who said, ", "‘I asked Abu Al-Hassan<sup>asws</sup> about the tranquility, so he<sup>asws</sup> mentioned similar to it’."]}}, {"index": 6697, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا أُمِرَ إِبْرَاهِيمُ وَ إِسْمَاعِيلُ ( عليهما السلام ) بِبِنَاءِ الْبَيْتِ وَ تَمَّ بِنَاؤُهُ قَعَدَ إِبْرَاهِيمُ عَلَى رُكْنٍ ثُمَّ نَادَى هَلُمَّ الْحَجَّ هَلُمَّ الْحَجَّ فَلَوْ نَادَى هَلُمُّوا إِلَى الْحَجِّ لَمْ يَحُجَّ إِلَّا مَنْ كَانَ يَوْمَئِذٍ إِنْسِيّاً مَخْلُوقاً وَ لَكِنَّهُ نَادَى هَلُمَّ الْحَجَّ فَلَبَّى النَّاسُ فِي أَصْلَابِ الرِّجَالِ لَبَّيْكَ دَاعِيَ اللَّهِ لَبَّيْكَ دَاعِيَ اللَّهِ عَزَّ وَ جَلَّ ", "فَمَنْ لَبَّى عَشْراً يَحُجُّ عَشْراً وَ مَنْ لَبَّى خَمْساً يَحُجُّ خَمْساً وَ مَنْ لَبَّى أَكْثَرَ مِنْ ذَلِكَ فَبِعَدَدِ ذَلِكَ وَ مَنْ لَبَّى وَاحِداً حَجَّ وَاحِداً وَ مَنْ لَمْ يُلَبِّ لَمْ يَحُجَّ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ibn Fazzal, from Abdullah Bin Sinan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Ibrahim<sup>as</sup> and Ismail<sup>as</sup> constructed the building of the House (Kaaba) and completed its building, Ibrahim<sup>as</sup> sat upon a corner, then called out: ‘Come for the Hajj! Come for the Hajj!’ Had he<sup>as</sup> called out ‘Come you all to the Hajj!’ none would have performed Hajj except the human beings who were in those days. But, he<sup>as</sup> called out: ‘Come for the Hajj!’ Thus, the people responded in the backs of the men, ‘Here I am, Inviter to Allah<sup>azwj</sup>! Here I am, Incited to Allah<sup>azwj</sup> Mighty and Majestic!’ ", "So the one who responded ten (times) would perform Hajj ten (times), and the one who responded five would perform five Hajj, and the one who responded more than that, so it would be by the counting of that, and the one who responded once would performe one Hajj, and the one who did not responded, would not be performing Hajj’."]}}, {"index": 6698, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:7", "text": ["عَنْهُ عَنْ سَعِيدِ بْنِ جَنَاحٍ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَتِ الْكَعْبَةُ عَلَى عَهْدِ إِبْرَاهِيمَ ( عليه السلام ) تِسْعَةَ أَذْرُعٍ وَ كَانَ لَهَا بَابَانِ فَبَنَاهَا عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ فَرَفَعَهَا ثَمَانِيَةَ عَشَرَ ذِرَاعاً فَهَدَمَهَا الْحَجَّاجُ فَبَنَاهَا سَبْعَةً وَ عِشْرِينَ ذِرَاعاً ."], "translations": {"en.hubeali": ["From him, from Saeed Bin Janah, from a number of our companions, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Kaaba, in the era of Ibrahim<sup>as</sup> was of ten cubits, and for it were two doors. Abdullah Bin Al-Zubeyr built it, so he raised it to eighteen cubits. Al-Hajjaj demolished it, and he built it to twenty seven cubits’."]}}, {"index": 6699, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:8", "text": ["وَ رُوِيَ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ طُولُ الْكَعْبَةِ يَوْمَئِذٍ تِسْعَةَ أَذْرُعٍ وَ لَمْ يَكُنْ لَهَا سَقْفٌ فَسَقَّفَهَا قُرَيْشٌ ثَمَانِيَةَ عَشَرَ ذِرَاعاً فَلَمْ تَزَلْ ثُمَّ كَسَرَهَا الْحَجَّاجُ عَلَى ابْنِ الزُّبَيْرِ فَبَنَاهَا وَ جَعَلَهَا سَبْعَةً وَ عِشْرِينَ ذِرَاعاً ."], "translations": {"en.hubeali": ["And it is reported from Ibn Abu Nasr, from Aban Bin Usman, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The height of the Kaaba in those days used to be of nine cubits, and there did not happen to be a roof for it. So the Qureysh placed a roof on it of eighteen cubits. Then it did not cease to be so, until Al-Hajjaj broke it down upon (in his fight against) Ibn Al-Zubeyr, and made it to be of twenty seven cubits’."]}}, {"index": 6700, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:9", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدَوَيْهِ بْنِ عَامِرٍ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ أَنَّهُ سَمِعَ أَبَا جَعْفَرٍ وَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَذْكُرَانِ أَنَّهُ لَمَّا كَانَ يَوْمُ التَّرْوِيَةِ قَالَ جَبْرَئِيلُ لِإِبْرَاهِيمَ ( عليه السلام ) تَرَوَّهْ مِنَ الْمَاءِ فَسُمِّيَتِ التَّرْوِيَةَ", "ثُمَّ أَتَى مِنًى فَأَبَاتَهُ بِهَا ثُمَّ غَدَا بِهِ إِلَى عَرَفَاتٍ فَضَرَبَ خِبَاهُ بِنَمِرَةَ دُونَ عَرَفَةَ فَبَنَى مَسْجِداً بِأَحْجَارٍ بِيضٍ وَ كَانَ يُعْرَفُ أَثَرُ مَسْجِدِ إِبْرَاهِيمَ حَتَّى أُدْخِلَ فِي هَذَا الْمَسْجِدِ الَّذِي بِنَمِرَةَ حَيْثُ يُصَلِّي الْإِمَامُ يَوْمَ عَرَفَةَ فَصَلَّى بِهَا الظُّهْرَ وَ الْعَصْرَ ثُمَّ عَمَدَ بِهِ إِلَى عَرَفَاتٍ فَقَالَ هَذِهِ عَرَفَاتٌ فَاعْرِفْ بِهَا مَنَاسِكَكَ وَ اعْتَرِفْ بِذَنْبِكَ فَسُمِّيَ عَرَفَاتٍ ", "ثُمَّ أَفَاضَ إِلَى الْمُزْدَلِفَةِ فَسُمِّيَتِ الْمُزْدَلِفَةَ لِأَنَّهُ ازْدَلَفَ إِلَيْهَا", "ثُمَّ قَامَ عَلَى الْمَشْعَرِ الْحَرَامِ فَأَمَرَهُ اللَّهُ أَنْ يَذْبَحَ ابْنَهُ وَ قَدْ رَأَى فِيهِ شَمَائِلَهُ وَ خَلَائِقَهُ وَ أَنِسَ مَا كَانَ إِلَيْهِ فَلَمَّا أَصْبَحَ أَفَاضَ مِنَ الْمَشْعَرِ إِلَى مِنًى فَقَالَ لِأُمِّهِ زُورِي الْبَيْتَ أَنْتِ وَ أَحْتَبِسَ الْغُلَامَ فَقَالَ يَا بُنَيَّ هَاتِ الْحِمَارَ وَ السِّكِّينَ حَتَّى أُقَرِّبَ الْقُرْبَانَ", "فَقَالَ أَبَانٌ فَقُلْتُ لِأَبِي بَصِيرٍ مَا أَرَادَ بِالْحِمَارِ وَ السِّكِّينِ قَالَ أَرَادَ أَنْ يَذْبَحَهُ ثُمَّ يَحْمِلَهُ فَيُجَهِّزَهُ وَ يَدْفِنَهُ", "قَالَ فَجَاءَ الْغُلَامُ بِالْحِمَارِ وَ السِّكِّينِ فَقَالَ يَا أَبَتِ أَيْنَ الْقُرْبَانُ قَالَ رَبُّكَ يَعْلَمُ أَيْنَ هُوَ يَا بُنَيَّ أَنْتَ وَ اللَّهِ هُوَ إِنَّ اللَّهَ قَدْ أَمَرَنِي بِذَبْحِكَ فَانْظُرْ مَا ذَا تَرَى قَالَ يا أَبَتِ افْعَلْ ما تُؤْمَرُ سَتَجِدُنِي إِنْ شاءَ اللَّهُ مِنَ الصَّابِرِينَ", "قَالَ فَلَمَّا عَزَمَ عَلَى الذَّبْحِ قَالَ يَا أَبَتِ خَمِّرْ وَجْهِي وَ شُدَّ وَثَاقِي قَالَ يَا بُنَيَّ الْوَثَاقُ مَعَ الذَّبْحِ وَ اللَّهِ لَا أَجْمَعُهُمَا عَلَيْكَ الْيَوْمَ", "قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَطَرَحَ لَهُ قُرْطَانَ الْحِمَارِ ثُمَّ أَضْجَعَهُ عَلَيْهِ وَ أَخَذَ الْمُدْيَةَ فَوَضَعَهَا عَلَى حَلْقِهِ قَالَ فَأَقْبَلَ شَيْخٌ فَقَالَ مَا تُرِيدُ مِنْ هَذَا الْغُلَامِ قَالَ أُرِيدُ أَنْ أَذْبَحَهُ فَقَالَ سُبْحَانَ اللَّهِ غُلَامٌ لَمْ يَعْصِ اللَّهَ طَرْفَةَ عَيْنٍ تَذْبَحُهُ فَقَالَ نَعَمْ إِنَّ اللَّهَ قَدْ أَمَرَنِي بِذَبْحِهِ فَقَالَ بَلْ رَبُّكَ نَهَاكَ عَنْ ذَبْحِهِ وَ إِنَّمَا أَمَرَكَ بِهَذَا الشَّيْطَانُ فِي مَنَامِكَ قَالَ وَيْلَكَ الْكَلَامُ الَّذِي سَمِعْتُ هُوَ الَّذِي بَلَغَ بِي مَا تَرَى لَا وَ اللَّهِ لَا أُكَلِّمُكَ ", "ثُمَّ عَزَمَ عَلَى الذَّبْحِ فَقَالَ الشَّيْخُ يَا إِبْرَاهِيمُ إِنَّكَ إِمَامٌ يُقْتَدَى بِكَ فَإِنْ ذَبَحْتَ وَلَدَكَ ذَبَحَ النَّاسُ أَوْلَادَهُمْ فَمَهْلًا فَأَبَى أَنْ يُكَلِّمَهُ", "قَالَ أَبُو بَصِيرٍ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ فَأَضْجَعَهُ عِنْدَ الْجَمْرَةِ الْوُسْطَى ثُمَّ أَخَذَ الْمُدْيَةَ فَوَضَعَهَا عَلَى حَلْقِهِ ثُمَّ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ ثُمَّ انْتَحَى عَلَيْهِ فَقَلَبَهَا جَبْرَئِيلُ ( عليه السلام ) عَنْ حَلْقِهِ فَنَظَرَ إِبْرَاهِيمُ فَإِذَا هِيَ مَقْلُوبَةٌ فَقَلَبَهَا إِبْرَاهِيمُ عَلَى خَدِّهَا وَ قَلَبَهَا جَبْرَئِيلُ عَلَى قَفَاهَا فَفَعَلَ ذَلِكَ مِرَاراً ثُمَّ نُودِيَ مِنْ مَيْسَرَةِ مَسْجِدِ الْخَيْفِ يَا إِبْرَاهِيمُ قَدْ صَدَّقْتَ الرُّؤْيَا وَ اجْتَرَّ الْغُلَامَ مِنْ تَحْتِهِ وَ تَنَاوَلَ جَبْرَئِيلُ الْكَبْشَ مِنْ قُلَّةِ ثَبِيرٍ فَوَضَعَهُ تَحْتَهُ", "وَ خَرَجَ الشَّيْخُ الْخَبِيثُ حَتَّى لَحِقَ بِالْعَجُوزِ حِينَ نَظَرَتْ إِلَى الْبَيْتِ وَ الْبَيْتُ فِي وَسَطِ الْوَادِي فَقَالَ مَا شَيْخٌ رَأَيْتُهُ بِمِنًى فَنَعَتَ نَعْتَ إِبْرَاهِيمَ قَالَتْ ذَاكَ بَعْلِي قَالَ فَمَا وَصِيفٌ رَأَيْتُهُ مَعَهُ وَ نَعَتَ نَعْتَهُ قَالَتْ ذَاكَ ابْنِي قَالَ فَإِنِّي رَأَيْتُهُ أَضْجَعَهُ وَ أَخَذَ الْمُدْيَةَ لِيَذْبَحَهُ قَالَتْ كَلَّا مَا رَأَيْتُ إِبْرَاهِيمَ إِلَّا أَرْحَمَ النَّاسِ وَ كَيْفَ رَأَيْتَهُ يَذْبَحُ ابْنَهُ قَالَ وَ رَبِّ السَّمَاءِ وَ الْأَرْضِ وَ رَبِّ هَذِهِ الْبَنِيَّةِ لَقَدْ رَأَيْتُهُ أَضْجَعَهُ وَ أَخَذَ الْمُدْيَةَ لِيَذْبَحَهُ قَالَتْ لِمَ قَالَ زَعَمَ أَنَّ رَبَّهُ أَمَرَهُ بِذَبْحِهِ قَالَتْ فَحَقٌّ لَهُ أَنْ يُطِيعَ رَبَّهُ ", "قَالَ فَلَمَّا قَضَتْ مَنَاسِكَهَا فَرِقَتْ أَنْ يَكُونَ قَدْ نَزَلَ فِي ابْنِهَا شَيْ‏ءٌ فَكَأَنِّي أَنْظُرُ إِلَيْهَا مُسْرِعَةً فِي الْوَادِي وَاضِعَةً يَدَهَا عَلَى رَأْسِهَا.", "قَالَ فَلَمَّا جَاءَتْ سَارَةُ فَأُخْبِرَتِ الْخَبَرَ قَامَتْ إِلَى ابْنِهَا تَنْظُرُ فَإِذَا أَثَرُ السِّكِّينِ خُدُوشاً فِي حَلْقِهِ فَفَزِعَتْ وَ اشْتَكَتْ وَ كَانَ بَدْءَ مَرَضِهَا الَّذِي هَلَكَتْ فِيهِ ", "وَ ذَكَرَ أَبَانٌ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَرَادَ أَنْ يَذْبَحَهُ فِي الْمَوْضِعِ الَّذِي حَمَلَتْ أُمُّ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عِنْدَ الْجَمْرَةِ الْوُسْطَى فَلَمْ يَزَلْ مَضْرَبَهُمْ يَتَوَارَثُونَ بِهِ كَابِرٌ عَنْ كَابِرٍ حَتَّى كَانَ آخِرَ مَنِ ارْتَحَلَ مِنْهُ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) فِي شَيْ‏ءٍ كَانَ بَيْنَ بَنِي هَاشِمٍ وَ بَيْنَ بَنِي أُمَيَّةَ فَارْتَحَلَ فَضَرَبَ بِالْعَرِينِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Al Husayn Bin Muhammad, from Abduwayh Bin Aamir, altogether, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban Bin Usman, ", "(It has been narrated) from Abu Baseer who heard Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both mentioning that when it was the day of Al-Tarwiyya (8<sup>th</sup> Zilhajj), Jibraeel<sup>as</sup> said to Ibrahim<sup>as</sup>: ‘Quench from the water’. Thus ‘Al-Tarwiyya’ was named as such.", "Then he<sup>as</sup> went to Mina, so he<sup>as</sup> slept overnight at it. Then he<sup>as</sup> went to Arafat in the morning and he<sup>as</sup> pitched his<sup>as</sup> tent at Namira besides Arafat. He<sup>as</sup> built a Masjid with white stones, and the effects of the Masjid of Ibrahim could be recognised until it was included in this Masjid which is at Namira when the Prayer leader Prays on the day of Arafat. Therefore, Pray Al-Zohr and Al-Asr in it. Then he<sup>as</sup> deliberated to Arafat, so he (Jibraeel<sup>as</sup> said: ‘This here is Arafat, therefore recognised (A’raf) your<sup>as</sup> rituals at it, and acknowledge with your<sup>as</sup> sins’. Thus, Arafat was named as such’.", "Then he<sup>as</sup> departed to Al-Muzdalifa. Thus, Al-Muzdalifa has been named as such because he<sup>as</sup> moved (Azdalaf) towards it.", "Then he<sup>as</sup> stood at the Sacred Monument, so Allah<sup>azwj</sup> Commanded him<sup>as</sup> that he<sup>as</sup> should slaughter his<sup>as</sup> son<sup>as</sup>, and he<sup>as</sup> had seen merits and morals in him<sup>as</sup> and politeness which was with him<sup>as</sup>. So when it was the morning, he<sup>as</sup> departed from the Monument to Mina, so he<sup>as</sup> to his<sup>as</sup> mother: ‘Visit the House (Kaaba) and retain the boy’. So he<sup>as</sup> said: ‘O my<sup>as</sup> son<sup>as</sup>! Bring a donkey and the knife until I<sup>as</sup> offer the sacrifice’. ", "Aban (the narrator) said, ‘So I said to Abu Baseer, ‘What did he<sup>as</sup> intend by the donkey and the knife?’ He said, ‘He<sup>as</sup> intended to slaughter him<sup>as</sup>, then carry him<sup>as</sup> upon it and bury him<sup>as</sup>’. ", "He<sup>asws</sup> said: ‘So the boy<sup>as</sup> came with the donkey and the knife, and he<sup>as</sup> said: ‘O father<sup>as</sup>! Where is the sacrifice?’ He<sup>as</sup> said: ‘Your<sup>as</sup> Lord<sup>azwj</sup> Knows where it is, O my<sup>as</sup> son<sup>as</sup>! By Allah<sup>azwj</sup>, it is such that Allah<sup>azwj</sup> has Commanded me<sup>as</sup> with slaughtering you<sup>as</sup>, therefore consider what is your<sup>as</sup> view’. He<sup>as</sup> said: ‘O father<sup>as</sup>! Do what you<sup>as</sup> have been Commanded with, for you<sup>as</sup> will find me<sup>as</sup>, Allah<sup>azwj</sup> Willing, from the patient ones’.  ", "He<sup>asws</sup> said;’ So when he<sup>as</sup> was determined upon the slaughter, he<sup>as</sup> said: ‘O father<sup>as</sup>! Cover my<sup>as</sup> face and tie my<sup>as</sup> legs’. He<sup>as</sup> said: ‘O my<sup>as</sup> son<sup>as</sup>! The tying along with the slaughter! By Allah<sup>azwj</sup>, I<sup>as</sup> will not gather these two upon you<sup>as</sup> today’.", "Abu Ja’far<sup>asws</sup> said: ‘So he<sup>as</sup> threw down for him the saddle of the donkey, then laid him<sup>as</sup> down upon it, and took the knife and placed it upon his<sup>as</sup> throat. So an old man appeared and said, ‘What are you<sup>as</sup> intending from this boy?’ He<sup>as</sup> said: ‘I<sup>as</sup> intend to slaughter him<sup>as</sup>’. So he said, ‘Glory be to Allah<sup>azwj</sup>! A boy who has not disobeyed Allah<sup>azwj</sup> even for the blink of an eye, you<sup>as</sup> are slaughtering him<sup>as</sup>?’ So he<sup>as</sup> said: ‘Yes. Allah<sup>azwj</sup> has Commanded me<sup>as</sup>’. So he said, ‘But, your<sup>as</sup> Lord<sup>azwj</sup> has Forbidden you<sup>as</sup> from slaughtering him<sup>as</sup>, and rather the Satan<sup>la</sup> instructed you<sup>as</sup> with this in your<sup>as</sup> dream’. He<sup>as</sup> said: ‘Woe be unto you<sup>as</sup>! The speech which you heard, it is which was Delivered to me<sup>as</sup>, what you are seeing. No, by Allah<sup>azwj</sup>! I<sup>as</sup> shall not speak with you’.", "Then he<sup>as</sup> was determined upon the slaughtering. So the old man said, ‘O Ibrahim<sup>as</sup>! You<sup>as</sup> are an Imam<sup>as</sup> followed with (by the people), so if you<sup>as</sup> were to slaughter your<sup>as</sup> son<sup>as</sup>, the people would be slaughtering their sons. So, stop, don’t!’ But he<sup>as</sup> refused to speak to him’. ", "Abu Baseer (the narrator) said, ‘I heard Abu Ja’far<sup>asws</sup> saying: ‘So he<sup>as</sup> laid him<sup>as</sup> down at the middle rock (the three pelted rocks), then grabbed the knife and placed it upon his<sup>as</sup> throat. Then he<sup>as</sup> raised his<sup>as</sup> head towards the sky, then leaned upon it. So Jibraeel<sup>as</sup> overturned it (the knife) upon his<sup>as</sup> throat. So Ibrahim<sup>as</sup> looked and there it was, overturned. So Ibrahim<sup>as</sup> turned it back upon its sharp edge, and Jibraeel<sup>as</sup> overturned it upon its blunt edge. So he<sup>as</sup> did that time and again, then there was a Call from the left of Masjid Al-Khief: ‘O Ibrahim<sup>as</sup>! You<sup>as</sup> have ratified the dream’, and he (Jibraeel<sup>as</sup> withdrew the boy<sup>as</sup> from underneath him<sup>as</sup>, and Jibraeel<sup>as</sup> got the ram from the peak of (Mount) Subeyr, and placed it underneath him<sup>as</sup>.", "And the wicked old man went out until he met the old woman when she was looking at the House (Kaaba), and the House (Kaaba) was in the middle of the valley. So he said, ‘What an old man I saw in Mina’, and he described the description of Ibrahim<sup>as</sup>. She said, ‘That is my<sup>as</sup> husband<sup>as</sup>’. He said, ‘So who was whom I saw with him upon his<sup>as</sup> description, and his<sup>as</sup> qualities?’ She said, ‘That is my<sup>as</sup> son<sup>as</sup>’. He said, ‘I saw him<sup>as</sup> to have laid him<sup>as</sup> down, and grab the knife in order to slaughter him<sup>as</sup>’. She said, ‘Never! I<sup>as</sup> have not seen Ibrahim<sup>as</sup> except as the most merciful of the people. And, how did you see him<sup>as</sup> slaughter his<sup>as</sup> son<sup>as</sup>?’ He said, ‘By the Lord<sup>azwj</sup> of the sky and the earth, and Lord<sup>azwj</sup> of this House (Kaaba), I have seen him<sup>as</sup> laying him<sup>as</sup> down and grab the knife in order to slaughter him<sup>as</sup>’. She said, ‘Why?’ He said, ‘He<sup>as</sup> claimed that his<sup>as</sup> Lord<sup>azwj</sup> has Commanded him<sup>as</sup> for it’. She said, ‘So it is right for him<sup>as</sup> that he<sup>as</sup> obeys his<sup>as</sup> Lord<sup>azwj</sup>’.", "He<sup>asws</sup> said: ‘So when she<sup>as</sup> completed her<sup>as</sup> rituals, she<sup>as</sup> scared that something may have descended with regards to her<sup>as</sup> son<sup>as</sup>. It is as if I<sup>asws</sup> am looking at her<sup>as</sup> hastening in the valley, placing her<sup>as</sup> hands upon her<sup>as</sup> head.", "He<sup>asws</sup> said: ‘So when Sarah<sup>as</sup> (Hajar<sup>as</sup>)<a id=\"_ftnref736\"></a><sup>[736]</sup> came over and was informed of the news, she stood by her<sup>as</sup> son<sup>as</sup>, and there were the effects of the knife scratches in his<sup>as</sup> throat. So she<sup>as</sup> panicked, and complained, and that was the beginning of her illness in which she<sup>as</sup> passed away. ", "And Aban (the narrator) mentioned, from Abu Baseer, from Abu Ja’far<sup>asws</sup> having said: ‘He<sup>as</sup> intended to slaughter him<sup>as</sup> in the place in which the mother<sup>as</sup> of Rasool-Allah<sup>saww</sup> was blessed, at the middle rock. So it did not cease to be their striking place, an elder inheriting it from an elder, until it was such that the last one to be departed from it was Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> regarding something which was between the Clan of Hashim<sup>as</sup> and the Clan of Umayya. So he<sup>asws</sup> travelled and was struck in the wilderness’."]}}, {"index": 6701, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:10", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) أَيْنَ أَرَادَ إِبْرَاهِيمُ ( عليه السلام ) أَنْ يَذْبَحَ ابْنَهُ قَالَ عَلَى الْجَمْرَةِ الْوُسْطَى ", "وَ سَأَلْتُهُ عَنْ كَبْشِ إِبْرَاهِيمَ ( عليه السلام ) مَا كَانَ لَوْنُهُ وَ أَيْنَ نَزَلَ فَقَالَ أَمْلَحَ وَ كَانَ أَقْرَنَ وَ نَزَلَ مِنَ السَّمَاءِ عَلَى الْجَبَلِ الْأَيْمَنِ مِنْ مَسْجِدِ مِنًى وَ كَانَ يَمْشِي فِي سَوَادٍ وَ يَأْكُلُ فِي سَوَادٍ وَ يَنْظُرُ وَ يَبْعَرُ وَ يَبُولُ فِي سَوَادٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad, and Al Hassan Bin Mahboub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim who said, ", "‘I asked Abu Ja’far<sup>asws</sup>, ‘Where did Ibrahim<sup>as</sup> intend to slaughter his<sup>as</sup> son<sup>as</sup>?’ He<sup>asws</sup> said: ‘Upon the midlle rock’. ", "And I asked him<sup>asws</sup> about the ram of Ibrahim<sup>as</sup>, what was it’s colour, and from where did it descend. So he<sup>asws</sup> said: ‘And it was with horns, and it descended from the sky upon the Mount Al-Yemen from Masjid of Mina, and it was walking in darkness, and eating in darkness, and looking, and excreting, and urinating in darkness’."]}}, {"index": 6702, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:11", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَسَنِ بْنِ نُعْمَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَمَّا زَادُوا فِي الْمَسْجِدِ الْحَرَامِ فَقَالَ إِنَّ إِبْرَاهِيمَ وَ إِسْمَاعِيلَ ( عليهما السلام ) حَدَّا الْمَسْجِدَ الْحَرَامَ بَيْنَ الصَّفَا وَ الْمَرْوَةِ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa, from Hammad Bin Usman, from Al Hassan Bin Nu’man who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about what has been increased regarding the Sacred Masjid (the extension of the Masjid). So he<sup>asws</sup> said: ‘Ibrahim<sup>as</sup> and Ismail<sup>as</sup> limited the Sacred Masjid between Al-Safa and Al-Marwa’."]}}, {"index": 6703, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:12", "text": ["وَ فِي رِوَايَةٍ أُخْرَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ خَطَّ إِبْرَاهِيمُ بِمَكَّةَ مَا بَيْنَ الْحَزْوَرَةِ إِلَى الْمَسْعَى فَذَلِكَ الَّذِي خَطَّ إِبْرَاهِيمُ ( عليه السلام ) يَعْنِي الْمَسْجِدَ ."], "translations": {"en.hubeali": ["And in another report, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Ibrahim<sup>as</sup> marked in Makkah what is between Al-Hazoura to the place of Sa’ee (Al-Safa and Al-Marwa), so that is it, which Ibrahim<sup>as</sup> marked, meaning the Masjid’."]}}, {"index": 6704, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:13", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ إِسْمَاعِيلَ دَفَنَ أُمَّهُ فِي الْحِجْرِ وَ حَجَّرَ عَلَيْهَا لِئَلَّا يُوطَأَ قَبْرُ أُمِّ إِسْمَاعِيلَ فِي الْحِجْرِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Numan, from Sayf Bin Ameyra, from Abu Bakr Al Hazramy, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Ismail<sup>as</sup> buried his<sup>as</sup> mother<sup>as</sup> in Al-Hijr, and built a chamber upon it, lest the grave of the mother<sup>as</sup> of Ismail<sup>as</sup> be trampled upon in Al-Hijr’ (by those who circle the Kaaba)."]}}, {"index": 6705, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:14", "text": ["بَعْضُ أَصْحَابِنَا عَنِ ابْنِ جُمْهُورٍ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْحِجْرُ بَيْتُ إِسْمَاعِيلَ وَ فِيهِ قَبْرُ هَاجَرَ وَ قَبْرُ إِسْمَاعِيلَ ."], "translations": {"en.hubeali": ["One of our companions, from Ibn Jamhour, from his father, from Muhammad Bin Sinan, from Al Mufazzal Bin Umar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Al-Hijr is the house of Ismail<sup>as</sup>, and therein is the grave of Hajar<sup>as</sup>, and grave of Ismail<sup>as</sup>’."]}}, {"index": 6706, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:15", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْحِجْرِ أَ مِنَ الْبَيْتِ هُوَ أَوْ فِيهِ شَيْ‏ءٌ مِنَ الْبَيْتِ فَقَالَ لَا وَ لَا قُلَامَةُ ظُفُرٍ وَ لَكِنْ إِسْمَاعِيلُ دَفَنَ أُمَّهُ فِيهِ فَكَرِهَ أَنْ تُوطَأَ فَحَجَّرَ عَلَيْهِ حِجْراً وَ فِيهِ قُبُورُ أَنْبِيَاءَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Muawiya Bin Ammar who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about Al-Hijr, is it from the House (Kaaba), or is there something (else) in it, from the House (Kaaba)?’ So he<sup>asws</sup> said: ‘No, not even (the size of) a nail clipping. But, Ismail<sup>as</sup> buried his<sup>as</sup> mother in it, and he<sup>as</sup> disliked that it should be trampled upon. So he<sup>as</sup> built a chamber upon it, and therein are the graves of the Prophets<sup>as</sup>’."]}}, {"index": 6707, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:16", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ شَبَابٍ الصَّيْرَفِيِّ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) دُفِنَ فِي الْحِجْرِ مِمَّا يَلِي الرُّكْنَ الثَّالِثَ عَذَارَى بَنَاتِ إِسْمَاعِيلَ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Waleed Shabaab Al Sayrafi, from Muawiya Bin Ammar who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘Buried in Al-Hijr, from what follows the third corner (of the Kaaba), are the virgin daughters of Ismail<sup>as</sup>’."]}}, {"index": 6708, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:17", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمْ يَزَلْ بَنُو إِسْمَاعِيلَ وُلَاةَ الْبَيْتِ وَ يُقِيمُونَ لِلنَّاسِ حَجَّهُمْ وَ أَمْرَ دِينِهِمْ يَتَوَارَثُونَهُ كَابِرٌ عَنْ كَابِرٍ حَتَّى كَانَ زَمَنُ عَدْنَانَ بْنِ أُدَدَ فَطَالَ عَلَيْهِمُ الْأَمَدُ فَقَسَتْ قُلُوبُهُمْ وَ أَفْسَدُوا وَ أَحْدَثُوا فِي دِينِهِمْ وَ أَخْرَجَ بَعْضُهُمْ بَعْضاً فَمِنْهُمْ مَنْ خَرَجَ فِي طَلَبِ الْمَعِيشَةِ وَ مِنْهُمْ مَنْ خَرَجَ كَرَاهِيَةَ الْقِتَالِ ", "وَ فِي أَيْدِيهِمْ أَشْيَاءُ كَثِيرَةٌ مِنَ الْحَنِيفِيَّةِ مِنْ تَحْرِيمِ الْأُمَّهَاتِ وَ الْبَنَاتِ وَ مَا حَرَّمَ اللَّهُ فِي النِّكَاحِ إِلَّا أَنَّهُمْ كَانُوا يَسْتَحِلُّونَ امْرَأَةَ الْأَبِ وَ ابْنَةَ الْأُخْتِ وَ الْجَمْعَ بَيْنَ الْأُخْتَيْنِ وَ كَانَ فِي أَيْدِيهِمُ الْحَجُّ وَ التَّلْبِيَةُ وَ الْغُسْلُ مِنَ الْجَنَابَةِ إِلَّا مَا أَحْدَثُوا فِي تَلْبِيَتِهِمْ وَ فِي حَجِّهِمْ مِنَ الشِّرْكِ وَ كَانَ فِيمَا بَيْنَ إِسْمَاعِيلَ وَ عَدْنَانَ بْنِ أُدَدَ مُوسَى ( عليه السلام ) ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban, from Abu Baseer, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The children of Ismail<sup>as</sup> did not cease to be the governors of the House (Kaaba), and they were establishing for the people, their Hajj, and the matters of their Religion, an elder inheriting from an elder, until it was the time of Adnan Bin Adad. So the term prolonged upon them, and their hearts hardened, and they became corrupt, and were innovating in their Religion, and throwing out each other. Thus, from them were ones who went out in seeking the livelihood, and from them were the ones who went out disliking the fighting. ", "And, in their hands were a lot of things from the uprightness (the Religion of Ibrahim<sup>as</sup>), from the Prohibition of the mother and the daughter and whatever Allah<sup>azwj</sup> Prohibited regarding the marriage, except that they were permitting a woman of the father, and a daughter of the sister, and the gathering between two sister. And, in their hands was the Hajj, and the (exclaiming of the) <span class=\"iTxt\">Talbiyya</span>, and the bathing from the sexual impurities, except what they innovated in their exclamation of their <span class=\"iTxt\">Talbiyya</span> during their Hajj, from the Polytheists. And, in (the period) what was in between Ismail<sup>as</sup> and Adnan Bin Adad, was Musa<sup>as</sup>’."]}}, {"index": 6709, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:18", "text": ["وَ رُوِيَ أَنَّ مَعَدَّ بْنَ عَدْنَانَ خَافَ أَنْ يَدْرُسَ الْحَرَمُ فَوَضَعَ أَنْصَابَهُ وَ كَانَ أَوَّلَ مَنْ وَضَعَهَا ثُمَّ غَلَبَتْ جُرْهُمُ عَلَى وِلَايَةِ الْبَيْتِ فَكَانَ يَلِي مِنْهُمْ كَابِرٌ عَنْ كَابِرٍ حَتَّى بَغَتْ جُرْهُمُ بِمَكَّةَ وَ اسْتَحَلُّوا حُرْمَتَهَا وَ أَكَلُوا مَالَ الْكَعْبَةِ وَ ظَلَمُوا مَنْ دَخَلَ مَكَّةَ وَ عَتَوْا وَ بَغَوْا", "وَ كَانَتْ مَكَّةُ فِي الْجَاهِلِيَّةِ لَا يَظْلِمُ وَ لَا يَبْغِي فِيهَا وَ لَا يَسْتَحِلُّ حُرْمَتَهَا مَلِكٌ إِلَّا هَلَكَ مَكَانَهُ وَ كَانَتْ تُسَمَّى بَكَّةَ لِأَنَّهَا تَبُكُّ أَعْنَاقَ الْبَاغِينَ إِذَا بَغَوْا فِيهَا وَ تُسَمَّى بَسَّاسَةَ كَانُوا إِذَا ظَلَمُوا فِيهَا بَسَّتْهُمْ وَ أَهْلَكَتْهُمْ وَ تُسَمَّى أُمَّ رُحْمٍ كَانُوا إِذَا لَزِمُوهَا رُحِمُوا", "فَلَمَّا بَغَتْ جُرْهُمُ وَ اسْتَحَلُّوا فِيهَا بَعَثَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِمُ الرُّعَافَ وَ النَّمْلَ وَ أَفْنَاهُمْ", "فَغَلَبَتْ خُزَاعَةُ وَ اجْتَمَعَتْ لِيُجْلُوا مَنْ بَقِيَ مِنْ جُرْهُمَ عَنِ الْحَرَمِ وَ رَئِيسُ خُزَاعَةَ عَمْرُو بْنُ رَبِيعَةَ بْنِ حَارِثَةَ بْنِ عَمْرٍو وَ رَئِيسُ جُرْهُمَ عَمْرُو بْنُ الْحَارِثِ بْنِ مُصَاصٍ الْجُرْهُمِيُّ فَهَزَمَتْ خُزَاعَةُ جُرْهُمَ وَ خَرَجَ مَنْ بَقِيَ مِنْ جُرْهُمَ إِلَى أَرْضٍ مِنْ أَرْضِ جُهَيْنَةَ فَجَاءَهُمْ سَيْلٌ أَتِيٌّ فَذَهَبَ بِهِمْ", "وَ وَلِيَتْ خُزَاعَةُ الْبَيْتَ فَلَمْ يَزَلْ فِي أَيْدِيهِمْ حَتَّى جَاءَ قُصَيُّ بْنُ كِلَابٍ وَ أَخْرَجَ خُزَاعَةَ مِنَ الْحَرَمِ وَ وَلِيَ الْبَيْتَ وَ غَلَبَ عَلَيْهِ."], "translations": {"en.hubeali": ["And it is reported that Ma’ad Bin Adnan feared that the (boundary of the) Sanctuary would be obscured, so he placed his monuments, and he was the first one to place these. Then Jurhum overcame upon the governership of the House (Kaaba), so it was passed on from them, from an elder to an elder, until Jurhum rebelled at Makkah and permitted (the violations of) it’s Sanctity, and consumed the wealth of the Kaaba, and oppressed the ones who entered Makkah, and he exceeded, and rebelled. ", "And Makkah, during the pre-Islamic period, there was neither any oppression nor any rebellion therein, nor were (the violations) of its Sanctity permitted by any king, except that he was destroyed right there in his place; and it used to be called Bakkah, because it crushed the necks of the rebels when they rebelled in it; and it was called Basa’sa (because) whevenever there were injustices committed therein, it crushed them and destroyed them; and it was called Umm Raham (mother of Mercy), whenever someone sought refuge, was shown mercy.", "So when Jurhum rebelled and permitted (the violations of the Sanctity) therein, Allah<sup>azwj</sup> Mighty and Majestic Sent the nose-bleeds (plague), and the ants upon them and Perished them. ", "So Khuza’a overcame, and gathered the remnants of Jurhum to be expelled from the Sanctuary. And the chief of Khuza’a was Amro Bin Rabi’e Bin Harisa Bin Amro, and the chief of Jurhum was Amro Bin Al Haris Bin Musasi Al Jurhumy. So Khuza’a defeated Jurhum and threw out the ones who remained from Jurhum to a lan from the lands of Juhayna. So a flood came and swept them away. ", "And Khuza’a governed the House (Kaaba). So it did not cease to be in their hands until Qusayy Bin Kilab came, and threw out Khuza’a from the Sanctuary, and governed the House (Kaaba), and overcame upon it."]}}, {"index": 6710, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:4:3:7:19", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَعِيدٍ الْأَعْرَجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْعَرَبَ لَمْ يَزَالُوا عَلَى شَيْ‏ءٍ مِنَ الْحَنِيفِيَّةِ يَصِلُونَ الرَّحِمَ وَ يَقْرُونَ الضَّيْفَ وَ يَحُجُّونَ الْبَيْتَ وَ يَقُولُونَ اتَّقُوا مَالَ الْيَتِيمِ فَإِنَّ مَالَ الْيَتِيمِ عِقَالٌ وَ يَكُفُّونَ عَنْ أَشْيَاءَ مِنَ الْمَحَارِمِ مَخَافَةَ الْعُقُوبَةِ وَ كَانُوا لَا يُمْلَى لَهُمْ إِذَا انْتَهَكُوا الْمَحَارِمَ وَ كَانُوا يَأْخُذُونَ مِنْ لِحَاءِ شَجَرِ الْحَرَمِ فَيُعَلِّقُونَهُ فِي أَعْنَاقِ الْإِبِلِ فَلَا يَجْتَرِئُ أَحَدٌ أَنْ يَأْخُذَ مِنْ تِلْكَ الْإِبِلِ حَيْثُمَا ذَهَبَتْ وَ لَا يَجْتَرِئُ أَحَدٌ أَنْ يُعَلِّقَ مِنْ غَيْرِ لِحَاءِ شَجَرِ الْحَرَمِ أَيُّهُمْ فَعَلَ ذَلِكَ عُوقِبَ", "وَ أَمَّا الْيَوْمَ فَأُمْلِيَ لَهُمْ وَ لَقَدْ جَاءَ أَهْلُ الشَّامِ فَنَصَبُوا الْمَنْجَنِيقَ عَلَى أَبِي قُبَيْسٍ فَبَعَثَ اللَّهُ عَلَيْهِمْ سَحَابَةً كَجَنَاحِ الطَّيْرِ فَأَمْطَرَتْ عَلَيْهِمْ صَاعِقَةً فَأَحْرَقَتْ سَبْعِينَ رَجُلًا حَوْلَ الْمَنْجَنِيقِ ."], "translations": {"en.hubeali": ["(p.s. – This is a report and not a Hadeeth)", "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Muhammad Bin Ismail, from Ali Bin Al Numan, from Saeed Al A’araj, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Arabs did not cease to be upon something from the uprightness (The Religion of Ibrahim<sup>as</sup>). They were maintaining relationships, and were entertaining the guests, and performing Hajj of the House (Kaaba), and they were saying, ‘Fear (of consuming) the wealth of the orphans is a shackle’, and they were refraining from certain things of the Prohibitions fearing the consequential Punishment, and would not find any respite if they violated the Prohibitions, and they were taking from the bark of a tree of the Sanctuary, so they were hanging it in the neck of the camel (gifted to the Kaaba). So no one had the audacity that he would take it from that camel, wherever it may go to, nor was anyone audacious enough that he would hand something other than the bark of a tree of the Sanctuary. Whoever did that, faced punishment.", "And as for today, so it has been respited for them; and the people of Syria had come, so they had set up the catapult upon (Mount) Abu Qubays. So Allah<sup>azwj</sup> Sent a cloud upon them like the wing of a bird, so it rained thunderbolts upon them. Seventeen men were incinerated around the catapult’."]}}]}, "index": "al-kafi:4:3:7", "kind": "verse_list"}