{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 70"
        },
        "path": "/books/al-kafi:4:3:70",
        "titles": {
          "ar": "بَابُ الرَّجُلِ يُعْطَى الْحَجَّ فَيَصْرِفُ مَا أَخَذَ فِي غَيْرِ الْحَجِّ أَوْ تَفْضُلُ الْفَضْلَةُ مِمَّا أُعْطِيَ",
          "en": "Chapter 70 – A man gives the (responsibility of performing the) Hajj, but he spends what he took, on other than the Hajj, or there remained an excess from what he was given"
        }
      }
    ],
    "index": 1013,
    "local_index": 70,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:70",
    "titles": {
      "ar": "بَابُ الرَّجُلِ يُعْطَى الْحَجَّ فَيَصْرِفُ مَا أَخَذَ فِي غَيْرِ الْحَجِّ أَوْ تَفْضُلُ الْفَضْلَةُ مِمَّا أُعْطِيَ",
      "en": "Chapter 70 – A man gives the (responsibility of performing the) Hajj, but he spends what he took, on other than the Hajj, or there remained an excess from what he was given"
    },
    "verse_count": 3,
    "verse_start_index": 7059,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/228)"
        ],
        "index": 7060,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:70:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ الْقُمِّيِّ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) عَنِ الرَّجُلِ يُعْطَى الْحَجَّةَ يَحُجُّ بِهَا وَ يُوَسِّعُ عَلَى نَفْسِهِ فَيَفْضُلُ مِنْهَا أَ يَرُدُّهَا عَلَيْهِ قَالَ لَا هِيَ لَهُ"
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, and Sahl Bin Ziyad, altogether from Ahmad Bin Muhammad Bin Abu Nasr, from Muhammad Bin Abdullah Al Qummy who said, ",
            "‘I asked Abu Al-Hassan Al-Reza<sup>asws</sup> about the man who is given (the responsibility of performing the) Hajj. He performs Hajj with it and spends liberally upon himself, but there remains excess from it. Should he return it back to him?’ He<sup>asws</sup> said: ‘No. It is for him’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Sahl ibn Ziyad all from Ahmad ibn Muhammad from ibn abu Nasr from Muhammad ibn ‘Abd Allah al-Qummiy who has said the following: “I once asked abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, about a man who is paid for al-Hajj and he spends openhandedly, but still a certain amount remains with him; if he is required to return it to the payer. He (the Imam) said, ‘No, it belongs to him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/228)"
        ],
        "index": 7061,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:70:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى السَّابَاطِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَأْخُذُ الدَّرَاهِمَ لِيَحُجَّ بِهَا عَنْ رَجُلٍ هَلْ يَجُوزُ لَهُ أَنْ يُنْفِقَ مِنْهَا فِي غَيْرِ الْحَجِّ قَالَ إِذَا ضَمِنَ الْحَجَّ فَالدَّرَاهِمُ لَهُ يَصْنَعُ بِهَا مَا أَحَبَّ وَ عَلَيْهِ حَجَّةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Al Hassan, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, from Ammar Bin Musa Al Sabaty, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who takes the Dirhams from a man in order to perform Hajj with it. Is it allowed for him that he should spend from it in other than the Hajj?’ He<sup>asws</sup> said: ‘When he took the responsibility for the Hajj, so the Dirhams are for him. He can do with these whatever he so likes to, and upon him is the performance of the Hajj’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ahmad ibn al-Hassan from ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqah from ‘Ammar ibn Musa al-Sabatiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is paid for performing al-Hajj for another person; if he can spend from such amount for other things. He (the Imam) said, ‘If he guarantees al-Hajj, dirhams belong to him with which he can do whatever he wants, but he owes al- Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/228)"
        ],
        "index": 7062,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:70:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ بَعَثَنِي عُمَرُ بْنُ يَزِيدَ إِلَى أَبِي جَعْفَرٍ الْأَحْوَلِ بِدَرَاهِمَ وَ قَالَ قُلْ لَهُ إِنْ أَرَادَ أَنْ يَحُجَّ بِهَا فَلْيَحُجَّ وَ إِنْ أَرَادَ أَنْ يُنْفِقَهَا فَلْيُنْفِقْهَا قَالَ فَأَنْفَقَهَا وَ لَمْ يَحُجَّ قَالَ حَمَّادٌ فَذَكَرَ ذَلِكَ أَصْحَابُنَا لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ وَجَدْتُمُ الشَّيْخَ فَقِيهاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman who said, ‘Amar Bin Yazeed sent me to Abu Ja’far Al Ahowl with Dirhams and said, ",
            "‘Say to him that I intend the Hajj to be performed with it, so let him perform Hajj. And, if he intends to spend it, so let him spend it’. So I spent it and did not perform Hajj’. Hammad said, ‘So our companions mentioned that to Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said: ‘You have found the understanding Sheykh’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthman who has said the following: “‘Umar ibn Yazid sent me to abu Ja’far al-Ahwal with a certain amount of dirham and asked me to tell him to perform al-Hajj with it if he wanted, or if he wanted to benefit in other ways, he can do so. He spent it for other things and did not perform al-Hajj . Certain persons of our people mentioned it to abu ‘Abd Allah, ‘Alayhi al-Salam, and he (the Imam) said, ‘You have found a faqih (knowledgeable in matters of Shari ‘ah) shaykh.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:70",
  "kind": "verse_list"
}