{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 71"
        },
        "path": "/books/al-kafi:4:3:71",
        "titles": {
          "ar": "بَابُ الطَّوَافِ وَ الْحَجِّ عَنِ الْأَئِمَّةِ ( عليهم السلام )",
          "en": "Chapter 71 – The circumambulation and the Hajj on behalf of the Imams<sup>asws</sup>"
        }
      }
    ],
    "index": 1014,
    "local_index": 71,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 72"
        },
        "path": "/books/al-kafi:4:3:72",
        "titles": {
          "ar": "بَابُ مَنْ يُشْرِكُ قَرَابَتَهُ وَ إِخْوَتَهُ فِي حَجَّتِهِ أَوْ يَصِلُهُمْ بِحَجَّةٍ",
          "en": "Chapter 72 – The one who participates his relatives and his brethren in his Hajj, or he links them with Hajj"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 70"
        },
        "path": "/books/al-kafi:4:3:70",
        "titles": {
          "ar": "بَابُ الرَّجُلِ يُعْطَى الْحَجَّ فَيَصْرِفُ مَا أَخَذَ فِي غَيْرِ الْحَجِّ أَوْ تَفْضُلُ الْفَضْلَةُ مِمَّا أُعْطِيَ",
          "en": "Chapter 70 – A man gives the (responsibility of performing the) Hajj, but he spends what he took, on other than the Hajj, or there remained an excess from what he was given"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:71",
    "titles": {
      "ar": "بَابُ الطَّوَافِ وَ الْحَجِّ عَنِ الْأَئِمَّةِ ( عليهم السلام )",
      "en": "Chapter 71 – The circumambulation and the Hajj on behalf of the Imams<sup>asws</sup>"
    },
    "verse_count": 2,
    "verse_start_index": 7062,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/229)"
        ],
        "index": 7063,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1151",
              "text": "مُوسَى بْنِ الْقَاسِمِ الْبَجَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُوسَى بْنِ الْقَاسِمِ الْبَجَلِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:71:1",
        "text": [
          " قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) يَا سَيِّدِي إِنِّي أَرْجُو أَنْ أَصُومَ فِي الْمَدِينَةِ شَهْرَ رَمَضَانَ فَقَالَ تَصُومُ بِهَا إِنْ شَاءَ اللَّهُ قُلْتُ وَ أَرْجُو أَنْ يَكُونَ خُرُوجُنَا فِي عَشْرٍ مِنْ شَوَّالٍ وَ قَدْ عَوَّدَ اللَّهُ زِيَارَةَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَهْلِ بَيْتِهِ وَ زِيَارَتَكَ فَرُبَّمَا حَجَجْتُ عَنْ أَبِيكَ وَ رُبَّمَا حَجَجْتُ عَنْ أَبِي وَ رُبَّمَا حَجَجْتُ عَنِ الرَّجُلِ مِنْ إِخْوَانِي وَ رُبَّمَا حَجَجْتُ عَنْ نَفْسِي فَكَيْفَ أَصْنَعُ فَقَالَ تَمَتَّعْ فَقُلْتُ إِنِّي مُقِيمٌ بِمَكَّةَ مُنْذُ عَشْرِ سِنِينَ فَقَالَ تَمَتَّعْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Musa Bin Al Qasim Al Bajaly who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘O my Master<sup>asws</sup>! I hope to be Fasting in Al-Medina in a month of Ramazan’. So he<sup>asws</sup> said: ‘You will Fast in it, Allah<sup>azwj</sup> Willing’. I said, ‘And I am hoping that our exit takes place in the 10<sup>th</sup> of Shawwal, and I would have visited Rasool-Allah<sup>saww</sup>, and the People<sup>asws</sup> of his<sup>saww</sup> Household, and visited you<sup>asws</sup>. So, sometimes I perform Hajj on behalf of your<sup>asws</sup> father<sup>asws</sup>, and sometimes I perform Hajj on behalf of my father, and sometimes I perform Hajj on behalf of the man from my brethren, and sometimes I perform Hajj for myself. So how should I be doing it?’ So he<sup>asws</sup> said: ‘<span class=\"iTxt\">Tamatto</span>’. So I said, ‘I am staying in Makkah since the last ten years’. So he<sup>asws</sup> said: ‘<span class=\"iTxt\">Tamatto</span>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Musa ibn al-Qasim al-Bajaliy who has said the following: “I once said to abu Ja‘far, ‘Alayhi al-Salam, ‘My master, I hope to fast during the month of Ramadan in al-Madinah.’ He (the Imam) said, ‘You will do so by the will of Allah.’ I then said, ‘I hope to leave by the tenth of the month of Shawwal after visiting the Messenger of Allah, his family and yourself, may Allah grant me such opportunity again. I sometimes perform al-Hajj on behalf of your father or on behalf of my father, or on behalf of a man from our brothers (in belief) or perform al-Hajj for myself. How should I perform such al-Hajj?’ He (the Imam) said, ‘You should perform al-Hajj in al- Tamattu‘ manner.’ I then said, ‘I am a resident of Makkah for the past twenty years.’ He (the Imam) said, ‘You should perform al-Hajj in al-Tamattu‘ manner.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/229)"
        ],
        "index": 7064,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/678",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/904",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1715",
              "text": "مُوسَى بْنِ الْقَاسِمِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ مُوسَى بْنِ الْقَاسِمِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:71:2",
        "text": [
          " قُلْتُ لِأَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) قَدْ أَرَدْتُ أَنْ أَطُوفَ عَنْكَ وَ عَنْ أَبِيكَ فَقِيلَ لِي إِنَّ الْأَوْصِيَاءَ لَا يُطَافُ عَنْهُمْ فَقَالَ لِي بَلْ طُفْ مَا أَمْكَنَكَ فَإِنَّهُ جَائِزٌ ",
          "ثُمَّ قُلْتُ لَهُ بَعْدَ ذَلِكَ بِثَلَاثِ سِنِينَ إِنِّي كُنْتُ اسْتَأْذَنْتُكَ فِي الطَّوَافِ عَنْكَ وَ عَنْ أَبِيكَ فَأَذِنْتَ لِي فِي ذَلِكَ فَطُفْتُ عَنْكُمَا مَا شَاءَ اللَّهُ ثُمَّ وَقَعَ فِي قَلْبِي شَيْ‏ءٌ فَعَمِلْتُ بِهِ قَالَ وَ مَا هُوَ قُلْتُ طُفْتُ يَوْماً عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ ثَلَاثَ مَرَّاتٍ صَلَّى اللَّهُ عَلَى رَسُولِ اللَّهِ",
          "ثُمَّ الْيَوْمَ الثَّانِيَ عَنْ أَمِيرِ الْمُؤْمِنِينَ ثُمَّ طُفْتُ الْيَوْمَ الثَّالِثَ عَنِ الْحَسَنِ ( عليه السلام ) وَ الرَّابِعَ عَنِ الْحُسَيْنِ ( عليه السلام ) وَ الْخَامِسَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَ السَّادِسَ عَنْ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام ) وَ الْيَوْمَ السَّابِعَ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام ) وَ الْيَوْمَ الثَّامِنَ عَنْ أَبِيكَ مُوسَى ( عليه السلام ) وَ الْيَوْمَ التَّاسِعَ عَنْ أَبِيكَ عَلِيٍّ ( عليه السلام ) وَ الْيَوْمَ الْعَاشِرَ عَنْكَ يَا سَيِّدِي وَ هَؤُلَاءِ الَّذِينَ أَدِينُ اللَّهَ بِوَلَايَتِهِمْ",
          "فَقَالَ إِذَنْ وَ اللَّهِ تَدِينَ اللَّهَ بِالدِّينِ الَّذِي لَا يَقْبَلُ مِنَ الْعِبَادِ غَيْرَهُ قُلْتُ وَ رُبَّمَا طُفْتُ عَنْ أُمِّكَ فَاطِمَةَ ( عليها السلام ) وَ رُبَّمَا لَمْ أَطُفْ فَقَالَ اسْتَكْثِرْ مِنْ هَذَا فَإِنَّهُ أَفْضَلُ مَا أَنْتَ عَامِلُهُ إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Ali Bin Mahziyar, from Musa Bin Al Qasim who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> (9<sup>th</sup> Imam<sup>asws</sup>) ‘I intended to circumambulate on your<sup>asws</sup> behalf and on behalf of your<sup>asws</sup> father<sup>asws</sup>. So it was said to me: ‘The successors<sup>asws</sup> are such that circumambulations are not to be performed on their<sup>asws</sup> behalf’. So he<sup>asws</sup> said to me: ‘But, circumambulate whatever you are able to, for it is allowed’.",
            "Then, I said to him<sup>asws</sup>, after three years, ‘I had sought your<sup>asws</sup> permission regarding the circumambulation on your<sup>asws</sup> behalf, and on behalf of your<sup>asws</sup> father, so you<sup>asws</sup> permitted to me with regards to that. So I circumambulated on behalf of you<sup>asws</sup> both what Allah<sup>azwj</sup> so Desired. Then something occurred in my heart, so I acted by it’. He<sup>asws</sup> said: ‘And what was it?’ I said, ‘I circumambulated one day, on behalf of Rasool-Allah<sup>saww</sup>’. So he<sup>asws</sup> said three times: ‘May Allah<sup>azwj</sup> Send Blessings upon Rasool-Allah<sup>saww</sup>’. ",
            "Then on the second day, on behalf of Amir Al-Momineen<sup>asws</sup>. Then one the third day I circumambulated on behalf of Al-Hassan<sup>asws</sup>; and on the fourth day on behalf of Al-Husayn<sup>asws</sup>; and on the fifth day on behalf of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>; and on the sixth day on behalf of Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>; and on the seventh day on behalf of Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>; and on the eight day on behalf of your<sup>asws</sup> father<sup>asws</sup> Musa<sup>asws</sup>; and on the ninth day on behalf of your<sup>asws</sup> father<sup>asws</sup> Ali<sup>asws</sup> (Al Reza)<sup>asws</sup>, and on the tenth day on your<sup>asws</sup> behalf, my Master<sup>asws</sup>. And they<sup>asws</sup> are those whom I make to be a Religion of Allah<sup>azwj</sup>, by their<sup>asws</sup> Wilayah’.",
            "So he<sup>asws</sup> said: ‘Then, by Allah<sup>azwj</sup>, you have made a Religion of Allah<sup>azwj</sup> with the Religion which He<sup>azwj</sup> will not be Accepting from the servants, apart from it’. I said, ‘And sometimes I circumambulate on behalf of your<sup>asws</sup> mother<sup>asws</sup> Fatima<sup>asws</sup>, and sometimes I do not circumambulate’. So he<sup>asws</sup> said: ‘Frequent from this, for it would be the most superior of what you act upon, Allah<sup>azwj</sup> Willing’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash’ariy has narrated from al-Hassan al-Kufiy from Ali ibn Mahziyar from Musa al-Qasim who has said the following: “I once said to abu Ja‘far, the second ‘Alayhi al-Salam, ‘I want to perform Tawaf on your behalf and on behalf of your father.’ It was said to me, ‘Tawaf is not performed on behalf of the executors of the will (of the Messenger of Allah).’ He (the Imam) then said, ‘Perform Tawaf as much as you can; it is permissible.’ I then after three years said, to him, ‘I had sought permission from you to perform Tawaf on your behalf and on behalf of your father and you had granted permission. I then performed Tawaf on behalf of both of you as much as Allah willed. I then said, ‘Then something came to my mind and I then did something accordingly.’ He (the Imam) asked, ‘What did you do?’ I then replied, ‘I one day performed Tawaf on behalf of the Messenger of Allah; he (the Imam) said three times, “O Allah, grant salawat (favors and compensation to Muhammad worthy of his services to your cause).” I then on the second day performed Tawaf on behalf of ’Amir al-Mu’minin. On the third day, I performed Tawaf on behalf of al-Hassan, ‘Alayhi al-Salam. On the fourth day, I performed Tawaf on behalf of al-Husayn, ‘Alayhi al-Salam. On the fifth day, I performed Tawaf on behalf of Ali ibn al- Husayn. On the sixth day, I performed Tawaf on behalf of abu Ja’far; on the seventh day, I performed Tawaf on behalf of Ja’far ibn Muhammad. On the eighth day, I performed Tawaf on behalf of your grandfather, Musa ibn Ja’far. On the ninth day, I performed Tawaf on behalf of your father. On the tenth day, I performed Tawaf on your behalf, O my master. These are those whose divine authority is part of my religion in obedience to Allah.’ He (the Imam) said, ‘The religion you have followed in obedience to Allah is the one beside which no other religion is accepted from the servants (of Allah).’ I then said, ‘I may have performed Tawaf on behalf of your mother, Fatimah, ‘Alayha al-Salam, also, or may not have done so.’ He (the Imam) said, ‘You should do so very often; this is better than what you may do, by the will of Allah.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:71",
  "kind": "verse_list"
}