{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 75"
        },
        "path": "/books/al-kafi:4:3:75",
        "titles": {
          "ar": "بَابُ مَنْ أَحْرَمَ دُونَ الْوَقْتِ",
          "en": "Chapter 75 – The one who wears Ihraam besides the juncture"
        }
      }
    ],
    "index": 1018,
    "local_index": 75,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 76"
        },
        "path": "/books/al-kafi:4:3:76",
        "titles": {
          "ar": "بَابُ مَنْ جَاوَزَ مِيقَاتَ أَرْضِهِ بِغَيْرِ إِحْرَامٍ أَوْ دَخَلَ مَكَّةَ بِغَيْرِ إِحْرَامٍ ",
          "en": "Chapter 76 – The one who exceeds the land of a juncture without Ihraam, or enters Makkah without Ihraam"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 74"
        },
        "path": "/books/al-kafi:4:3:74",
        "titles": {
          "ar": "بَابُ مَوَاقِيتِ الْإِحْرَامِ",
          "en": "Chapter 74 – Junctures for (wearing of) the Ihraam"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:75",
    "titles": {
      "ar": "بَابُ مَنْ أَحْرَمَ دُونَ الْوَقْتِ",
      "en": "Chapter 75 – The one who wears Ihraam besides the juncture"
    },
    "verse_count": 9,
    "verse_start_index": 7089,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/240)"
        ],
        "index": 7090,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:75:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ إِبْرَاهِيمَ الْكَرْخِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ أَحْرَمَ بِحَجَّةٍ فِي غَيْرِ أَشْهُرِ الْحَجِّ دُونَ الْوَقْتِ الَّذِي وَقَّتَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ لَيْسَ إِحْرَامُهُ بِشَيْ‏ءٍ إِنْ أَحَبَّ أَنْ يَرْجِعَ إِلَى مَنْزِلِهِ فَلْيَرْجِعْ وَ لَا أَرَى عَلَيْهِ شَيْئاً وَ إِنْ أَحَبَّ أَنْ يَمْضِيَ فَلْيَمْضِ فَإِذَا انْتَهَى إِلَى الْوَقْتِ فَلْيُحْرِمْ مِنْهُ وَ يَجْعَلُهَا عُمْرَةً فَإِنَّ ذَلِكَ أَفْضَلُ مِنْ رُجُوعِهِ لِأَنَّهُ أَعْلَنَ الْإِحْرَامَ بِالْحَجِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Ibrahim Al Karkhy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who wore <span class=\"iTxt\">Ihraam</span> for Hajj during other than the months of the Hajj, besides the juncture which Rasool-Allah<sup>saww</sup> had designated’. He<sup>asws</sup> said: ‘His <span class=\"iTxt\">Ihraam</span> is not with anything. If he so likes to, he can return to his house, so let him return, and I<sup>asws</sup> do not see anything upon him; and if keeps going, so let him keep going. So when he ends up to a juncture, so let him wear <span class=\"iTxt\">Ihraam</span> from it, and make it to be an Umra, for that would be superior than his returning, because he announced the <span class=\"iTxt\">Ihraam</span> to be for the Hajj’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from Ibrahim al-Karkhiy who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about a man who assumes the state of Ihram for al- Hajj. He does it in a month, which is other than the months of al-Hajj. It is at a place other than those designated by the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. He (the Imam) said, ‘His Ihram is not valid. If he likes, he can go to his home; and I do not see anything against him, or to continue and upon arriving at Miqat (place for assuming the state of Ihram), assume the state of Ihram at that point, and make it an al-‘Umrah. It is more virtuous than his returning home when he has already announced his state of Ihram for al- Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/240)"
        ],
        "index": 7091,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:75:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُثَنًّى عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْحَجُّ أَشْهُرٌ مَعْلُومَاتٌ شَوَّالٌ وَ ذُو الْقَعْدَةِ وَ ذُو الْحِجَّةِ لَيْسَ لِأَحَدٍ أَنْ يُحْرِمَ بِالْحَجِّ فِي سِوَاهُنَّ وَ لَيْسَ لِأَحَدٍ أَنْ يُحْرِمَ دُونَ الْوَقْتِ الَّذِي وَقَّتَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ مَنْ صَلَّى فِي السَّفَرِ أَرْبَعاً وَ تَرَكَ الثِّنْتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Musna, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Hajj is during known months – Shawwal, and Zilqadah, and Zilhijja. It is not for anyone that he wears <span class=\"iTxt\">Ihraam</span> for the Hajj during other that these, and it is not for anyone that he wears <span class=\"iTxt\">Ihraam</span> besides the junctures which Rasool-Allah<sup>saww</sup> designated. So, rather, the example of that is like the one who Prays four (Cycles) during the journey and leaves the (Praying of) two (Cycles)’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from Muthanna’ from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘The months of al-Hajj are well known; they are Shawwal, Dhu al-Qa’dah and Dhu al-Hajj ah. One must not assume the state of Ihram for al-Hajj in other months and one must not assume the state of Ihram before Mawaqit (places for assuming the state of Ihram) designated by the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. To do so is like performing four Rak‘ats Salat (prayer) on a journey and ignoring the fact that one’s duty is to perform two Rak‘ats only.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/240)"
        ],
        "index": 7092,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:75:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ فُضَيْلِ بْنِ يَسَارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ اشْتَرَى بَدَنَةً قَبْلَ أَنْ يَنْتَهِيَ إِلَى الْوَقْتِ الَّذِي يُحْرِمُ فِيهِ فَأَشْعَرَهَا وَ قَلَّدَهَا أَ يَجِبُ عَلَيْهِ حِينَ فَعَلَ ذَلِكَ مَا يَجِبُ عَلَى الْمُحْرِمِ قَالَ لَا وَ لَكِنْ إِذَا انْتَهَى إِلَى الْوَقْتِ فَلْيُحْرِمْ ثُمَّ لْيُشْعِرْهَا وَ يُقَلِّدْهَا فَإِنَّ تَقْلِيدَهُ الْأَوَّلَ لَيْسَ بِشَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Jameel Bin Salih, from Fuzayl Bin Yasaar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who bought a camel before he ended up to the juncture in which he wore the <span class=\"iTxt\">Ihraam</span>. So he marked it and yoked it. Does it Obligate upon him, when he did that, what is Obligated upon the one in <span class=\"iTxt\">Ihraam</span>?’ He<sup>asws</sup> said: ‘No, but when he ended up to the juncture, so let him wear the <span class=\"iTxt\">Ihraam</span>, then let him mark it and yoke it, for his yoking it firstly, is not with anything’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad, from ibn Mahbub from Jamil ibn Salih from Fudayl ibn Yasar who has said the following: I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who buys a Badanah before Miqat (place for assuming the state of Ihram) of his location, then marks and tags it: if it is obligatory on him thereafter to follow what a person in the state of Ihram does. He (the Imam) said, ‘No, when he arrives at Miqat, assumes the state of Ihram, then marks and tags his badanah because the first marking and tags are not valid.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/241)"
        ],
        "index": 7093,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:75:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ أَحْرَمَ بِالْحَجِّ فِي غَيْرِ أَشْهُرِ الْحَجِّ فَلَا حَجَّ لَهُ وَ مَنْ أَحْرَمَ دُونَ الْمِيقَاتِ فَلَا إِحْرَامَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The one who wears <span class=\"iTxt\">Ihraam</span> for the Hajj during other than the months of the Hajj, so there is no Hajj for him; and the one who wears <span class=\"iTxt\">Ihraam</span> besides the junctures, so there is no <span class=\"iTxt\">Ihraam</span> for him’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ‘Udhaynah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One who assumes the state of Ihram for al-Hajj in the months that are not for al-Hajj; his Hajj is not valid, and one who assumes the state of Ihram from a non-Miqat (place for assuming the state of Ihram), his Ihram is not valid.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/241)"
        ],
        "index": 7094,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:75:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مِهْرَانَ بْنِ أَبِي نَصْرٍ عَنْ أَخِيهِ رَبَاحٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّا نُرَوَّى بِالْكُوفَةِ أَنَّ عَلِيّاً صَلَوَاتُ اللَّهِ عَلَيْهِ قَالَ إِنَّ مِنْ تَمَامِ الْحَجِّ وَ الْعُمْرَةِ أَنْ يُحْرِمَ الرَّجُلُ مِنْ دُوَيْرَةِ أَهْلِهِ فَهَلْ قَالَ هَذَا عَلِيٌّ ( عليه السلام ) فَقَالَ قَدْ قَالَ ذَلِكَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لِمَنْ كَانَ مَنْزِلُهُ خَلْفَ الْمَوَاقِيتِ وَ لَوْ كَانَ كَمَا يَقُولُونَ مَا كَانَ يَمْنَعُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ لَا يَخْرُجَ بِثِيَابِهِ إِلَى الشَّجَرَةِ "
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Mihran Bin Abu Nasr, from his brother Rabah who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘We are reporting in Al-Kufa that Ali<sup>asws</sup> said: ‘From the completion of the Hajj and the Umra is that the man should wear <span class=\"iTxt\">Ihraam</span> from the houses of his family. Has Ali<sup>asws</sup> said this?’ So he<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> has said that for the one whose house is behind the junctures. And, had it been as they are saying it to be, Rasool-Allah<sup>saww</sup> would not have forbidden that one should not go out with his clothes to the (Masjid) Al-Shajara’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from Mehran ibn abu Nasr from his brother Rabah who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, in al-Kufah, we narrate that Ali, ‘Alayhi al-Salam, has said, ‘It is of the completion of al-Hajj and al-‘Umrah for one to assume the state of Ihram from the (sweet) home of his family.’ Is this what he (the Imam) has said?’ He (the Imam) said, ‘Yes, ’Amir al-Mu’minin, ‘Alayhi al-Salam, has said it about those whose homes are behind Miqat (place for assuming the state of Ihram) (closer to Makkah than Miqat to Makkah). Had it been as they say it is, the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would prohibit saying, ‘You must not go with your clothes to al-Shajarah (Miqat (place for assuming the state of Ihram for people of al-Madinah)).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/241)"
        ],
        "index": 7095,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:75:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ مَيْسَرَةَ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا مُتَغَيِّرُ اللَّوْنِ فَقَالَ لِي مِنْ أَيْنَ أَحْرَمْتَ قُلْتُ مِنْ مَوْضِعِ كَذَا وَ كَذَا فَقَالَ رُبَّ طَالِبِ خَيْرٍ تَزِلُّ قَدَمُهُ ثُمَّ قَالَ يَسُرُّكَ إِنْ صَلَّيْتَ الظُّهْرَ فِي السَّفَرِ أَرْبَعاً قُلْتُ لَا قَالَ فَهُوَ وَ اللَّهِ ذَاكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Numan, from Ali Bin Uqba, from Maysara who said, ",
            "‘I went to Abu Abdullah<sup>asws</sup> and the colour of my face had changed. So he<sup>asws</sup> said to me: ‘From where did you wear <span class=\"iTxt\">Ihraam</span>?’ I said, ‘From such and such a place’. So he<sup>asws</sup> said: ‘Sometimes the seeker of the goodness, his feet tend to waver’. Then he<sup>asws</sup> said: ‘Would it make you joyful if you were to Pray Al-Zohr during a journey, as four (Cycles)?’ I said, ‘No’. He<sup>asws</sup> said: ‘So it, By Allah<sup>azwj</sup>, is (like) that’ (i.e. wearing <span class=\"iTxt\">Ihraam</span> at other than a designated juncture)."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad and Ali ibn al-Nu’man from Ali ibn ‘Uqbah from Maysarah who has said the following: “I once went to see abu ‘Abd Allah, ‘Alayhi al-Salam. My color had changed and he (the Imam) asked, ‘From where did you assume the state of Ihram?’ I replied, ‘From such and such place.’ He (the Imam) said, ‘There are many who seek goodness but their feet slip.’ He (the Imam) then said, ‘Will it make you happy to perform four Rak‘at for al-Zuhr Salat (prayer) on a journey?’ I replied, ‘No, it does not make me happy.’ He (the Imam) said, ‘This (your assuming the state of Ihram) by Allah is like that (four Rak‘at on a journey).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالحسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/241)"
        ],
        "index": 7096,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:75:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ أَحْرَمَ دُونَ الْوَقْتِ وَ أَصَابَ مِنَ النِّسَاءِ وَ الصَّيْدِ فَلَا شَيْ‏ءَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from one of our companions, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The one who wears <span class=\"iTxt\">Ihraam</span> besides the juncture, and attains from the women, and the hunting, so there is nothing upon him’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from certain persons of our people who has said the following: “If one assumes the state of Ihram before Miqat (place for assuming the state of Ihram) and then involves with woman or hunting, there is nothing upon him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/242)"
        ],
        "index": 7097,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:75:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَيْسَ يَنْبَغِي لِأَحَدٍ أَنْ يُحْرِمَ دُونَ الْمَوَاقِيتِ الَّتِي وَقَّتَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَّا أَنْ يَخَافَ فَوْتَ الشَّهْرِ فِي الْعُمْرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘It is not befitting for anyone that he should wear <span class=\"iTxt\">Ihraam</span> beside the junctures which Rasool-Allah<sup>saww</sup> had designated, except if he fears losing the month regarding the Umra’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Mu‘awiyah who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, say this Hadith. ‘It is not proper to assume the state of Ihram before Miqat. They are (places for assuming the state of Ihram) designated by the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, except when one is afraid of missing the month of al-‘Umrah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/242)"
        ],
        "index": 7098,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:75:9",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَجِي‏ءُ مُعْتَمِراً عُمْرَةَ رَجَبٍ فَيَدْخُلُ عَلَيْهِ هِلَالُ شَعْبَانَ قَبْلَ أَنْ يَبْلُغَ الْوَقْتَ أَ يُحْرِمُ قَبْلَ الْوَقْتِ وَ يَجْعَلُهَا لِرَجَبٍ أَوْ يُؤَخِّرُ الْإِحْرَامَ إِلَى الْعَقِيقِ وَ يَجْعَلُهَا لِشَعْبَانَ قَالَ يُحْرِمُ قَبْلَ الْوَقْتِ فَيَكُونُ لِرَجَبٍ لِأَنَّ لِرَجَبٍ فَضْلَهُ وَ هُوَ الَّذِي نَوَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who comes for Umra, the Umra of Rajab. So the crescent of Shaban enters upon him before he reaches the juncture. Can he wear <span class=\"iTxt\">Ihraam</span> before the juncture, and make it to be for Rajab, or should he delay wearing the <span class=\"iTxt\">Ihraam</span> up to the juncture and make it to be for Shaban?’ He<sup>asws</sup> said: ‘He can wear <span class=\"iTxt\">Ihraam</span> before the juncture, so it would happen to be for Rajab, because for Rajab there is its merit, and it is which he intended’."
          ],
          "en.sarwar": [
            "9. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Ishaq ibn ‘Ammar who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who travels for al-‘Umrah in the month of Rajab. It becomes the month of al-Sha‘ban before his reaching the Miqat (place for assuming the state of Ihram); should he assume the state of Ihram before Miqat, to make it al-‘Umrah of Rajab, or delay it until his reaching al-‘Aqiq and make it al-‘Umrah of the month of al-Sha‘ban? He (the Imam) said, ‘He can assume the state of Ihram, before Miqat, for al-‘Umrah of Rajab because Rajab has its virtue and that is what he had intended.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:75",
  "kind": "verse_list"
}