{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 76"}, "path": "/books/al-kafi:4:3:76", "titles": {"ar": "بَابُ مَنْ جَاوَزَ مِيقَاتَ أَرْضِهِ بِغَيْرِ إِحْرَامٍ أَوْ دَخَلَ مَكَّةَ بِغَيْرِ إِحْرَامٍ ", "en": "Chapter 76 – The one who exceeds the land of a juncture without Ihraam, or enters Makkah without Ihraam"}}], "index": 1019, "local_index": 76, "part_type": "Chapter", "path": "/books/al-kafi:4:3:76", "titles": {"ar": "بَابُ مَنْ جَاوَزَ مِيقَاتَ أَرْضِهِ بِغَيْرِ إِحْرَامٍ أَوْ دَخَلَ مَكَّةَ بِغَيْرِ إِحْرَامٍ ", "en": "Chapter 76 – The one who exceeds the land of a juncture without Ihraam, or enters Makkah without Ihraam"}, "verse_count": 12, "verse_start_index": 7098, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 7099, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ نَسِيَ أَنْ يُحْرِمَ حَتَّى دَخَلَ الْحَرَمَ قَالَ قَالَ أَبِي يَخْرُجُ إِلَى مِيقَاتِ أَهْلِ أَرْضِهِ فَإِنْ خَشِيَ أَنْ يَفُوتَهُ الْحَجُّ أَحْرَمَ مِنْ مَكَانِهِ فَإِنِ اسْتَطَاعَ أَنْ يَخْرُجَ مِنْ الْحَرَمِ فَلْيَخْرُجْ ثُمَّ لْيُحْرِمْ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al halby who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who forgot to wear <span class=\"iTxt\">Ihraam</span> until he entered the Harram. He<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> said: ‘He should go out to a juncture of the people of his land. So if he fears that the Hajj would be lost, he can wear <span class=\"iTxt\">Ihraam</span> from his place. So if he is able to out from the Harram, so let him go out, then he should wear <span class=\"iTxt\">Ihraam</span>’."]}}, {"index": 7100, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ كَتَبْتُ إِلَيْهِ أَنَّ بَعْضَ مَوَالِيكَ بِالْبَصْرَةِ يُحْرِمُونَ بِبَطْنِ الْعَقِيقِ وَ لَيْسَ بِذَلِكَ الْمَوْضِعِ مَاءٌ وَ لَا مَنْزِلٌ وَ عَلَيْهِمْ فِي ذَلِكَ مَئُونَةٌ شَدِيدَةٌ وَ يُعْجِلُهُمْ أَصْحَابُهُمْ وَ جَمَّالُهُمْ وَ مِنْ وَرَاءِ بَطْنِ الْعَقِيقِ بِخَمْسَةَ عَشَرَ مِيلًا مَنْزِلٌ فِيهِ مَاءٌ وَ هُوَ مَنْزِلُهُمُ الَّذِي يَنْزِلُونَ فِيهِ فَتَرَى أَنْ يُحْرِمُوا مِنْ مَوْضِعِ الْمَاءِ لِرِفْقِهِ بِهِمْ وَ خِفَّتِهِ عَلَيْهِمْ ", "فَكَتَبَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَقَّتَ الْمَوَاقِيتَ لِأَهْلِهَا وَ لِمَنْ أَتَى عَلَيْهَا مِنْ غَيْرِ أَهْلِهَا وَ فِيهَا رُخْصَةٌ لِمَنْ كَانَتْ بِهِ عِلَّةٌ فَلَا يُجَاوِزِ الْمِيقَاتَ إِلَّا مِنْ عِلَّةٍ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Safwan Bin Yahya, ", "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I wrote to him<sup>asws</sup> Some of those in your<sup>asws</sup> Wilayah in Al-Basra are wearing <span class=\"iTxt\">Ihraam</span> at Batn Al-Aqeeq, and there is no water in that place, nor is there any lodging, and upon them regarding that requires intense provisions, and their companions and their cameleers hasten them; and from behind Batn Al-Aqeeq by fifteen miles, there is a station wherein is water, and it is their lodgement which they are encamping in. So what is your<sup>asws</sup> view if they were to wear <span class=\"iTxt\">Ihraam</span> from a place of water in order to be easier with them and light upon them’. ", "So he<sup>asws</sup> wrote: ‘Rasool-Allah<sup>saww</sup> designated the junctures for its people and for the ones who come to it from other than its people, and with regards to it is a permission for the one who has a reason for it. Therefore, none should exceed the junctures except for the one who has a reason to do so’."]}}, {"index": 7101, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي خَرَجْتُ بِأَهْلِي مَاشِياً فَلَمْ أُهِلَّ حَتَّى أَتَيْتُ الْجُحْفَةَ وَ قَدْ كُنْتُ شَاكِياً فَجَعَلَ أَهْلُ الْمَدِينَةِ يَسْأَلُونَ عَنِّي فَيَقُولُونَ لَقِينَاهُ وَ عَلَيْهِ ثِيَابُهُ وَ هُمْ لَا يَعْلَمُونَ وَ قَدْ رَخَّصَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِمَنْ كَانَ مَرِيضاً أَوْ ضَعِيفاً أَنْ يُحْرِمَ مِنَ الْجُحْفَةِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al hakam, from Sayf Bin Umeyra, from Abu Bakr Al Hazramy who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘I<sup>asws</sup> went out walking with my<sup>asws</sup> family, so I<sup>asws</sup> did not commence (Hajj) until I<sup>asws</sup> came up to Al-Juhfa, and there had been complaints (of the hardships endured). So the people of Al-Medina went on asking about me<sup>asws</sup>, and they were saying, ‘We met him<sup>asws</sup>, and upon him<sup>asws</sup> were his<sup>asws</sup> (normal) clothes’, and they were not knowing that Rasool-Allah<sup>saww</sup> had permitted for the one who was sick, or weak, that he can wear <span class=\"iTxt\">Ihraam</span> from Al-Juhfa’."]}}, {"index": 7102, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:4", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ رِفَاعَةَ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَعْرِضُ لَهُ الْمَرَضُ الشَّدِيدُ قَبْلَ أَنْ يَدْخُلَ مَكَّةَ قَالَ لَا يَدْخُلْهَا إِلَّا بِإِحْرَامٍ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad, from Rafa’at Bin Musa, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man to whom the extreme illness presented itself before he entered Makkah. He<sup>asws</sup> said: ‘He should not enter it except being in <span class=\"iTxt\">Ihraam</span>’."]}}, {"index": 7103, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أُنَاسٍ مِنْ أَصْحَابِنَا حَجُّوا بِامْرَأَةٍ مَعَهُمْ فَقَدِمُوا إِلَى الْوَقْتِ وَ هِيَ لَا تُصَلِّي فَجَهِلُوا أَنَّ مِثْلَهَا يَنْبَغِي أَنْ يُحْرِمَ فَمَضَوْا بِهَا كَمَا هِيَ حَتَّى قَدِمُوا مَكَّةَ وَ هِيَ طَامِثٌ حَلَالٌ فَسَأَلُوا النَّاسَ فَقَالُوا تَخْرُجُ إِلَى بَعْضِ الْمَوَاقِيتِ فَتُحْرِمُ مِنْهُ وَ كَانَتْ إِذَا فَعَلَتْ لَمْ تُدْرِكِ الْحَجَّ فَسَأَلُوا أَبَا جَعْفَرٍ ( عليه السلام ) فَقَالَ تُحْرِمُ مِنْ مَكَانِهَا قَدْ عَلِمَ اللَّهُ نِيَّتَهَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zurara, from Anaas, ", "(It has been narrated) from our companions performing Hajj, and there was a woman along with them. So they proceeded to the juncture, and she did not Pray. So they did not know whether the likes of her should be wearing <span class=\"iTxt\">Ihraam</span>. So they went with her until they proceeded to Makkah, and she was menstruating, being free (from <span class=\"iTxt\">Ihraam</span>). So they asked the people, and they said, ‘She should go out to one of the junctures, and she should wear the <span class=\"iTxt\">Ihraam</span> from it’. And, it was so that, had she done that, she would not have realised the Hajj’. So they asked Abu Ja’far<sup>asws</sup>, and he<sup>asws</sup> said: ‘She should wear <span class=\"iTxt\">Ihraam</span> from her place. Allah<sup>azwj</sup> has Knowledge of her intentions’."]}}, {"index": 7104, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:6", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ مَرَّ عَلَى الْوَقْتِ الَّذِي يُحْرِمُ النَّاسُ مِنْهُ فَنَسِيَ أَوْ جَهِلَ فَلَمْ يُحْرِمْ حَتَّى أَتَى مَكَّةَ فَخَافَ إِنْ رَجَعَ إِلَى الْوَقْتِ أَنْ يَفُوتَهُ الْحَجُّ فَقَالَ يَخْرُجُ مِنَ الْحَرَمِ وَ يُحْرِمُ وَ يُجْزِئُهُ ذَلِكَ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Abdullah Bin Sinan who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who passed by the juncture which the people were wearing <span class=\"iTxt\">Ihraam</span> from, but he forgot, or did not know. So he did not wear <span class=\"iTxt\">Ihraam</span> until he came to Makkah. Then, he feared that if he were to return to the juncture, he would miss the Hajj. So he<sup>asws</sup> said: ‘He should go out from the Harram, and he should wear <span class=\"iTxt\">Ihraam</span>, and that would suffice him’."]}}, {"index": 7105, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ جَهِلَ أَنْ يُحْرِمَ حَتَّى دَخَلَ الْحَرَمَ كَيْفَ يَصْنَعُ قَالَ يَخْرُجُ مِنَ الْحَرَمِ ثُمَّ يُهِلُّ بِالْحَجِّ ."], "translations": {"en.hubeali": ["Muhammad Bin yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who did not know that he should be wearing <span class=\"iTxt\">Ihraam</span> until he entered the Harram. What should he do?’ He<sup>asws</sup> said: ‘He should go out from the Harram, then he should commence with the Hajj’."]}}, {"index": 7106, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:8", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي رَجُلٍ نَسِيَ أَنْ يُحْرِمَ أَوْ جَهِلَ وَ قَدْ شَهِدَ الْمَنَاسِكَ كُلَّهَا وَ طَافَ وَ سَعَى قَالَ تُجْزِئُهُ نِيَّتُهُ إِذَا كَانَ قَدْ نَوَى ذَلِكَ فَقَدْ تَمَّ حَجُّهُ وَ إِنْ لَمْ يُهِلَّ وَ قَالَ فِي مَرِيضٍ أُغْمِيَ عَلَيْهِ حَتَّى أَتَى الْوَقْتَ فَقَالَ يُحْرِمُ مِنْهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from one of our companions, ", "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding a man who forgot that he should be wearing <span class=\"iTxt\">Ihraam</span>, or did not know, and he had witnessed the rituals, all of them, and circumambulated, and performed Sa’ee. He<sup>asws</sup> said: ‘His intention would suffice him when he had intended that. Thus, his Hajj would be complete, and even if he had not exclaimed <span class=\"iTxt\">Talbiyya</span>’. And he<sup>asws</sup> said regarding a man who had fainted until he came to the juncture. So he<sup>asws</sup> said: ‘He should wear <span class=\"iTxt\">Ihraam</span> from it’."]}}, {"index": 7107, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:9", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْإِحْرَامِ مِنْ غَمْرَةَ قَالَ لَيْسَ بِهِ بَأْسٌ أَنْ يُحْرِمَ مِنْهَا وَ كَانَ بَرِيدُ الْعَقِيقِ أَحَبَّ إِلَيَّ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan BinYahya, from Is’haq Bin Ammar who said, ", "‘I asked Abu Al-Hassan<sup>asws</sup> about (wearing) the <span class=\"iTxt\">Ihraam</span> from Ghamra. He<sup>asws</sup> said: ‘There is no problem with it if one wears <span class=\"iTxt\">Ihraam</span> from it, and Bareyd Al-Aqeeq would be more beloved to me<sup>asws</sup>’."]}}, {"index": 7108, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:10", "text": ["صَفْوَانُ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ امْرَأَةٍ كَانَتْ مَعَ قَوْمٍ فَطَمِثَتْ فَأَرْسَلَتْ إِلَيْهِمْ فَسَأَلَتْهُمْ فَقَالُوا مَا نَدْرِي أَ عَلَيْكِ إِحْرَامٌ أَمْ لَا وَ أَنْتِ حَائِضٌ فَتَرَكُوهَا حَتَّى دَخَلَتِ الْحَرَمَ قَالَ إِنْ كَانَ عَلَيْهَا مُهْلَةٌ فَلْتَرْجِعْ إِلَى الْوَقْتِ فَلْتُحْرِمْ مِنْهُ وَ إِنْ لَمْ يَكُنْ عَلَيْهَا وَقْتٌ فَلْتَرْجِعْ إِلَى مَا قَدَرَتْ عَلَيْهِ بَعْدَ مَا تَخْرُجُ مِنَ الْحَرَمِ بِقَدْرِ مَا لَا يَفُوتُهَا ."], "translations": {"en.hubeali": ["Safwan, from Muawiya Bin Ammar who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a woman who was with a group of people, so she experienced menstruation. So she sent a message to them, and asked them. So they said, ‘We do not know whether wearing of the <span class=\"iTxt\">Ihraam</span> is upon you or not, and you as in menstruation’. So they left her until she entered the Harram. He<sup>asws</sup> said: ‘If there was sufficient time for her, so let her return to the juncture, and wear <span class=\"iTxt\">Ihraam</span> from it; and if there was not sufficient time for her, so let her return to whatever she is able upon after having gone out from the Harram, by a measurement of would not make her to miss it (the Hajj)’."]}}, {"index": 7109, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:11", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ أَحْمَدَ بْنِ عَمْرِو بْنِ سَعِيدٍ عَنْ وَرْدَانَ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ مَنْ كَانَ مِنْ مَكَّةَ عَلَى مَسِيرَةِ عَشَرَةِ أَمْيَالٍ لَمْ يَدْخُلْهَا إِلَّا بِإِحْرَامٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Ahmad Bin Amro Bin Saeed, from Wardaan, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> having said: ‘The one who was away from Makkah upon a travel distance of ten miles cannot enter it (the Harram) except in <span class=\"iTxt\">Ihraam</span>’."]}}, {"index": 7110, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:4:3:76:12", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ سَوْرَةَ بْنِ كُلَيْبٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) خَرَجَتْ مَعَنَا امْرَأَةٌ مِنْ أَهْلِنَا فَجَهِلَتِ الْإِحْرَامَ فَلَمْ تُحْرِمْ حَتَّى دَخَلْنَا مَكَّةَ وَ نَسِينَا أَنْ نَأْمُرَهَا بِذَلِكَ قَالَ فَمُرُوهَا فَلْتُحْرِمْ مِنْ مَكَانِهَا مِنْ مَكَّةَ أَوْ مِنَ الْمَسْجِدِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Sowrat Bin Kuleyb who said, ", "‘I said to Abu Ja’far<sup>asws</sup>, ‘I went out (for Hajj) and with us was a woman from our family. She did not know about (wearing of) the <span class=\"iTxt\">Ihraam</span> until we entered Makkah, and we forgot that we should be instructing her with that’. He<sup>asws</sup> said: ‘So instruct her, and let her wear <span class=\"iTxt\">Ihraam</span> from her place, from Makkah or from the Masjid’."]}}]}, "index": "al-kafi:4:3:76", "kind": "verse_list"}