{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 8"}, "path": "/books/al-kafi:4:3:8", "titles": {"ar": "بَابُ حَجِّ الْأَنْبِيَاءِ ( عليهم السلام )", "en": "Chapter 8 – Hajj of the Prophets<sup>as</sup>"}}], "index": 951, "local_index": 8, "part_type": "Chapter", "path": "/books/al-kafi:4:3:8", "titles": {"ar": "بَابُ حَجِّ الْأَنْبِيَاءِ ( عليهم السلام )", "en": "Chapter 8 – Hajj of the Prophets<sup>as</sup>"}, "verse_count": 11, "verse_start_index": 6710, "verses": [{"index": 6711, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْوَشَّاءِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ قَالَ لِي أَبُو الْحَسَنِ ( عليه السلام ) إِنَّ سَفِينَةَ نُوحٍ كَانَتْ مَأْمُورَةً طَافَتْ بِالْبَيْتِ حَيْثُ غَرِقَتِ الْأَرْضُ ثُمَّ أَتَتْ مِنًى فِي أَيَّامِهَا ثُمَّ رَجَعَتِ السَّفِينَةُ وَ كَانَتْ مَأْمُورَةً وَ طَافَتْ بِالْبَيْتِ طَوَافَ النِّسَاءِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from one of his companions, from Al Washa, from Ali Bin Abu Hamza who said, \n‘Abu Al-Hassan<sup>asws</sup> said to me: ‘The ark of Noah<sup>as</sup> was Commanded to circumambulate the House (Kaaba) when the land was drowned. Then it came to Mina during its days, and then the ark returned. It was Commanded to circumambulate with the House, a circumambulation of the women (<span class=\"iTxt\">Tawaaf Al-Nisa</span>)’."}]}, {"index": 6712, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْحَسَنِ بْنِ صَالِحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يُحَدِّثُ عَطَاءً قَالَ كَانَ طُولُ سَفِينَةِ نُوحٍ أَلْفَ ذِرَاعٍ وَ مِائَتَيْ ذِرَاعٍ وَ عَرْضُهَا ثَمَانَمِائَةِ ذِرَاعٍ وَ طُولُهَا فِي السَّمَاءِ مِائَتَيْنِ ذِرَاعاً وَ طَافَتْ بِالْبَيْتِ وَ سَعَتْ بَيْنَ الصَّفَا وَ الْمَرْوَةِ سَبْعَةَ أَشْوَاطٍ ثُمَّ اسْتَوَتْ عَلَى الْجُودِيِّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Al Hassan Bin Salih, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard Abu Ja’far<sup>asws</sup> narrating to Ata’a saying: ‘The length of the ark of Noah<sup>as</sup> was of a thousand cubits and two hundred cubits, and its width was of eight cubits, and its height in the sky was of two hundred cubits; and it circumambulated with the House (Kaaba) and <span class=\"iTxt\">Sa’ee</span> between Al-Safa and Al-Marwa, seven circuits. Then it rested upon the Mount Joudy’."}]}, {"index": 6713, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:3", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ مَرَّ مُوسَى بْنُ عِمْرَانَ فِي سَبْعِينَ نَبِيّاً عَلَى فِجَاجِ الرَّوْحَاءِ عَلَيْهِمُ الْعَبَاءُ الْقَطَوَانِيَّةُ يَقُولُ لَبَّيْكَ عَبْدُكَ ابْنُ عَبْدِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Hammad Bin Isa, from Al Husayn Bin Al Mukhtar, from Abu Baseer who said, \n‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Musa<sup>as</sup> Bin Imran<sup>as</sup> passed by among seventy Prophets<sup>as</sup> upon the glens of Al-Rawha. Upon them were the Qatwany cloaks, saying: ‘Here I am, Your<sup>azwj</sup> servant son of Your<sup>azwj</sup> servant! (<span class=\"iTxt\">Talbiyya </span>)’."}]}, {"index": 6714, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:4", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَرَّ مُوسَى النَّبِيُّ ( عليه السلام ) بِصِفَاحِ الرَّوْحَاءِ عَلَى جَمَلٍ أَحْمَرَ خِطَامُهُ مِنْ لِيفٍ عَلَيْهِ عَبَاءَتَانِ قَطَوَانِيَّتَانِ وَ هُوَ يَقُولُ لَبَّيْكَ يَا كَرِيمُ لَبَّيْكَ\nقَالَ وَ مَرَّ يُونُسُ بْنُ مَتَّى بِصِفَاحِ الرَّوْحَاءِ وَ هُوَ يَقُولُ لَبَّيْكَ كَشَّافَ الْكُرَبِ الْعِظَامِ لَبَّيْكَ \nقَالَ وَ مَرَّ عِيسَى ابْنُ مَرْيَمَ بِصِفَاحِ الرَّوْحَاءِ وَ هُوَ يَقُولُ لَبَّيْكَ عَبْدُكَ ابْنُ أَمَتِكَ لَبَّيْكَ \nوَ مَرَّ مُحَمَّدٌ ( صلى الله عليه وآله ) بِصِفَاحِ الرَّوْحَاءِ وَ هُوَ يَقُولُ لَبَّيْكَ ذَا الْمَعَارِجِ لَبَّيْكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ibn Abu Umeyr, from Hisham Bin Al Hakam, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Musa<sup>as</sup>, the Prophet<sup>as</sup>, passed by the glens of Al-Rawha upon a red camel harnessed from fibres. Upon him<sup>as</sup> were two Qatwany cloaks, and he<sup>as</sup> was saying: ‘Here I<sup>as</sup> am, O Benevolent! Here I<sup>as</sup> am! (<span class=\"iTxt\">Talbiyya </span>).\nHe<sup>asws</sup> said:’ And Yunus Bin Matta<sup>as</sup> passed by the glens of Al-Rawha and he<sup>as</sup> was saying: ‘Here I<sup>as</sup> am, O Remover of grievous anguish! Here I<sup>as</sup> am (<span class=\"iTxt\">Talbiyya </span>).\nHe<sup>asws</sup> said: ‘And Isa<sup>as</sup> Bin Maryam<sup>as</sup> passed by the glens of Al-Rawha, and he<sup>as</sup> was saying: ‘Here I<sup>as</sup> am, Your<sup>azwj</sup> servant, son<sup>as</sup> of Your<sup>azwj</sup> Maid<sup>as</sup>! Here I<sup>as</sup> am!’\nAnd Muhammad<sup>saww</sup> passed by the glens of Al-Rawha and he<sup>saww</sup> was saying: ‘Here I<sup>saww</sup> am, O One with the Loftiness! Here I<sup>saww</sup> am!’"}]}, {"index": 6715, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْمُفَضَّلِ بْنِ صَالِحٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَحْرَمَ مُوسَى ( عليه السلام ) مِنْ رَمْلَةِ مِصْرَ قَالَ وَ مَرَّ بِصِفَاحِ الرَّوْحَاءِ مُحْرِماً يَقُودُ نَاقَتَهُ بِخِطَامٍ مِنْ لِيفٍ عَلَيْهِ عَبَاءَتَانِ قَطَوَانِيَّتَانِ يُلَبِّي وَ تُجِيبُهُ الْجِبَالُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ali Bin Ismail, from Ali Bin Al Hakam, from Al Mufazzal Bin Salih, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Musa<sup>as</sup> adorned the <span class=\"iTxt\">Ihraam</span> from Ramla in Egypt, and he<sup>as</sup> passed by the glens of Al-Rawha wearing <span class=\"iTxt\">Ihraam</span>, sitting on a she-camel harnessed from fibres. Upon him<sup>as</sup> were two Qatwany cloaks, exclaiming <span class=\"iTxt\">Talbiyya </span>, and the mountains responded to him<sup>as</sup>’."}]}, {"index": 6716, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِيهِ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّ سُلَيْمَانَ بْنَ دَاوُدَ حَجَّ الْبَيْتَ فِي الْجِنِّ وَ الْإِنْسِ وَ الطَّيْرِ وَ الرِّيَاحِ وَ كَسَا الْبَيْتَ الْقَبَاطِيَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Ali Bin Uqba, from his father, from Zurara, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> that Suleyman<sup>as</sup> Bin Dawood<sup>as</sup> performed Hajj of the House (Kaaba) among the Jinn and the humans, and the birds, and the winds, and a cloak of the household tapestries’."}]}, {"index": 6717, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:7", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنِ الْمُفَضَّلِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ صَلَّى فِي مَسْجِدِ الْخَيْفِ سَبْعُمِائَةِ نَبِيٍّ وَ إِنَّ مَا بَيْنَ الرُّكْنِ وَ الْمَقَامِ لَمَشْحُونٌ مِنْ قُبُورِ الْأَنْبِيَاءِ وَ إِنَّ آدَمَ لَفِي حَرَمِ اللَّهِ عَزَّ وَ جَلَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Najran, from Al Mufazzal, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Seven hundred Prophets<sup>as</sup> have Prayed in Masjid Al-Khief, and that what is in between the corner (of the Kaaba) and the Standing Place (of Ibrahim<sup>as</sup>) is fraught with the graves of the Prophets<sup>as</sup>, and that Adam<sup>as</sup> is in the Sanctuary of Allah<sup>azwj</sup> Mighty and Majestic’."}]}, {"index": 6718, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:8", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زَيْدٍ الشَّحَّامِ عَمَّنْ رَوَاهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ حَجَّ مُوسَى بْنُ عِمْرَانَ ( عليه السلام ) وَ مَعَهُ سَبْعُونَ نَبِيّاً مِنْ بَنِي إِسْرَائِيلَ خُطُمُ إِبِلِهِمْ مِنْ لِيفٍ يُلَبُّونَ وَ تُجِيبُهُمُ الْجِبَالُ وَ عَلَى مُوسَى عَبَاءَتَانِ قَطَوَانِيَّتَانِ يَقُولُ لَبَّيْكَ عَبْدُكَ ابْنُ عَبْدِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban Bin Usman, from Zayd Al Shahham, from the one who reported it, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Musa<sup>as</sup> Bin Imran<sup>as</sup> performed Hajj and with him<sup>as</sup> were seventy Prophets<sup>as</sup> from the Children of Israel. Their<sup>as</sup> camels were harnessed from fibre. They<sup>as</sup> were exclaiming <span class=\"iTxt\">Talbiyya</span>, and the mountains were responding to them<sup>as</sup>. And, upon Musa<sup>as</sup>, were two Qatwany cloaks. He<sup>as</sup> was saying: ‘Here I<sup>as</sup> am! Your<sup>azwj</sup> servant, son<sup>as</sup> of Your<sup>azwj</sup> servant!’"}]}, {"index": 6719, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:9", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ أَبِي بِلَالٍ الْمَكِّيِّ قَالَ رَأَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) دَخَلَ الْحِجْرَ مِنْ نَاحِيَةِ الْبَابِ فَقَامَ يُصَلِّي عَلَى قَدْرِ ذِرَاعَيْنِ مِنَ الْبَيْتِ فَقُلْتُ لَهُ مَا رَأَيْتُ أَحَداً مِنْ أَهْلِ بَيْتِكَ يُصَلِّي بِحِيَالِ الْمِيزَابِ فَقَالَ هَذَا مُصَلَّى شَبَّرَ وَ شَبِيرٍ ابْنَيْ هَارُونَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Ibrahim Bin Abu Al Balaad, from Abu Bilal Al Makky who said, \n‘I saw Abu Abdullah<sup>asws</sup> enter Al-Hijr from the side of the door. So he<sup>asws</sup> stood Praying upon a measurement of two cubits from the House (Kaaba). So I said to him<sup>asws</sup>, ‘I have not seen anyone from your<sup>asws</sup> family Praying by the conduit’. So he<sup>asws</sup> said: ‘This is the Praying place of Shabbar and Shabbir, the two sons of (Prophet) Haroun<sup>as</sup>’."}]}, {"index": 6720, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:10", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ شَبَابٍ الصَّيْرَفِيِّ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ الدُّهْنِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ دُفِنَ مَا بَيْنَ الرُّكْنِ الْيَمَانِيِّ وَ الْحَجَرِ الْأَسْوَدِ سَبْعُونَ نَبِيّاً أَمَاتَهُمُ اللَّهُ جُوعاً وَ ضُرّاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Waleed Shabaab Al Sayrai, from Muawiya Bin Ammar Al Duhny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Seventy Prophets<sup>as</sup> are buried in what is between the Yamani corner and the Black Stone. Allah<sup>azwj</sup> Caused them<sup>as</sup> to die of hunger and adversities’."}]}, {"index": 6721, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:3:8:11", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ عُثْمَانَ بْنِ عِيسَى عَنِ ابْنِ مُسْكَانَ عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ دَاوُدَ لَمَّا وَقَفَ الْمَوْقِفَ بِعَرَفَةَ نَظَرَ إِلَى النَّاسِ وَ كَثْرَتِهِمْ فَصَعِدَ الْجَبَلَ فَأَقْبَلَ يَدْعُو فَلَمَّا قَضَى نُسُكَهُ أَتَاهُ جَبْرَئِيلُ ( عليه السلام ) فَقَالَ لَهُ يَا دَاوُدُ يَقُولُ لَكَ رَبُّكَ لِمَ صَعِدْتَ الْجَبَلَ ظَنَنْتَ أَنَّهُ يَخْفَى عَلَيَّ صَوْتُ مَنْ صَوَّتَ \nثُمَّ مَضَى بِهِ إِلَى الْبَحْرِ إِلَى جُدَّةَ فَرَسَبَ بِهِ فِي الْمَاءِ مَسِيرَةَ أَرْبَعِينَ صَبَاحاً فِي الْبَرِّ فَإِذَا صَخْرَةٌ فَفَلَقَهَا فَإِذَا فِيهَا دُودَةٌ فَقَالَ لَهُ يَا دَاوُدُ يَقُولُ لَكَ رَبُّكَ أَنَا أَسْمَعُ صَوْتَ هَذِهِ فِي بَطْنِ هَذِهِ الصَّخْرَةِ فِي قَعْرِ هَذَا الْبَحْرِ فَظَنَنْتَ أَنَّهُ يَخْفَى عَلَيَّ صَوْتُ مَنْ صَوَّتَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Ali Bin Mahziyar, from Usman Bin Isa, from Ibn Muskan, from the one who reported it, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Dawood<sup>as</sup> paused at the Pausing Station in Arafat, looked at the people and their abundance. So he<sup>as</sup> climbed upon the mountain, and started supplicating. So when he<sup>as</sup> had completed his<sup>as</sup> rituals, Jibraeel<sup>as</sup> came over to him and said to him<sup>as</sup>: ‘O Dawood<sup>as</sup>! Your<sup>as</sup> Lord<sup>azwj</sup> is Saying to you<sup>as</sup>: “Why did you<sup>as</sup> ascend the mountain? Do you<sup>as</sup> think that a voice from the voices would be concealed from Me<sup>azwj</sup>?”\nThen he<sup>as</sup> went with him<sup>as</sup> to the sea to Jeddah. So he<sup>as</sup> swam with him<sup>as</sup> in the sea for a travel distance of forty mornings in the land. So there was a rock, and he (Jibraeel<sup>as</sup> split it and there was an insect in it. So he<sup>as</sup> said to him<sup>as</sup>: ‘O Dawood<sup>as</sup>! Your<sup>as</sup> Lord<sup>azwj</sup> is Saying to you<sup>as</sup>: “I<sup>azwj</sup> can Hear the voice of this one in the inside of this rock at the bottom of this sea, so do you<sup>as</sup> think that a voice from the voices would be concealed from Me<sup>azwj</sup>?”’"}]}]}, "index": "al-kafi:4:3:8", "kind": "verse_list"}