{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 80"}, "path": "/books/al-kafi:4:3:80", "titles": {"ar": "بَابُ صَلَاةِ الْإِحْرَامِ وَ عَقْدِهِ وَ الِاشْتِرَاطِ فِيهِ", "en": "Chapter 80 – The Prayer of the Ihraam, and tying it, and the stipulations regarding it"}}], "index": 1023, "local_index": 80, "part_type": "Chapter", "path": "/books/al-kafi:4:3:80", "titles": {"ar": "بَابُ صَلَاةِ الْإِحْرَامِ وَ عَقْدِهِ وَ الِاشْتِرَاطِ فِيهِ", "en": "Chapter 80 – The Prayer of the Ihraam, and tying it, and the stipulations regarding it"}, "verse_count": 16, "verse_start_index": 7135, "verses": [{"index": 7136, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ وَ مُعَاوِيَةَ بْنِ عَمَّارٍ جَمِيعاً عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَضُرُّكَ بِلَيْلٍ أَحْرَمْتَ أَمْ نَهَارٍ إِلَّا أَنَّ أَفْضَلَ ذَلِكَ عِنْدَ زَوَالِ الشَّمْسِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, form Ibn Abu Umeyr, from Hammad, from Al Halby, and Muawiya Bin Ammar, altogether, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It does not harm you whether you wear <span class=\"iTxt\">Ihraam</span> at night or by the day, except that the superior of that is at the (start of the) decline of the sun’."}]}, {"index": 7137, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:2", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ جَمِيعاً عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ لَا يَكُونُ إِحْرَامٌ إِلَّا فِي دُبُرِ صَلَاةٍ مَكْتُوبَةٍ أَحْرَمْتَ فِي دُبُرِهَا بَعْدَ التَّسْلِيمِ وَ إِنْ كَانَتْ نَافِلَةً صَلَّيْتَ رَكْعَتَيْنِ وَ أَحْرَمْتَ فِي دُبُرِهِمَا فَإِذَا انْفَتَلْتَ مِنْ صَلَاتِكَ فَاحْمَدِ اللَّهَ وَ أَثْنِ عَلَيْهِ وَ صَلِّ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) \nوَ قُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَجْعَلَنِي مِمَّنِ اسْتَجَابَ لَكَ وَ آمَنَ بِوَعْدِكَ وَ اتَّبَعَ أَمْرَكَ فَإِنِّي عَبْدُكَ وَ فِي قَبْضَتِكَ لَا أُوقَى إِلَّا مَا وَقَيْتَ وَ لَا آخُذُ إِلَّا مَا أَعْطَيْتَ\nوَ قَدْ ذَكَرْتَ الْحَجَّ فَأَسْأَلُكَ أَنْ تَعْزِمَ لِي عَلَيْهِ عَلَى كِتَابِكَ وَ سُنَّةِ نَبِيِّكَ وَ تُقَوِّيَنِي عَلَى مَا ضَعُفْتُ عَنْهُ وَ تَسَلَّمَ مِنِّي مَنَاسِكِي فِي يُسْرٍ مِنْكَ وَ عَافِيَةٍ وَ اجْعَلْنِي مِنْ وَفْدِكَ الَّذِينَ رَضِيتَ وَ ارْتَضَيْتَ وَ سَمَّيْتَ وَ كَتَبْتَ\nاللَّهُمَّ فَتَمِّمْ لِي حَجِّي وَ عُمْرَتِي اللَّهُمَّ إِنِّي أُرِيدُ التَّمَتُّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ عَلَى كِتَابِكَ وَ سُنَّةِ نَبِيِّكَ ( صلى الله عليه وآله ) فَإِنْ عَرَضَ لِي شَيْ‏ءٌ يَحْبِسُنِي فَحُلَّنِي حَيْثُ حَبَسْتَنِي لِقَدَرِكَ الَّذِي قَدَّرْتَ عَلَيَّ\nاللَّهُمَّ إِنْ لَمْ تَكُنْ حَجَّةً فَعُمْرَةً أَحْرَمَ لَكَ شَعْرِي وَ بَشَرِي وَ لَحْمِي وَ دَمِي وَ عِظَامِي وَ مُخِّي وَ عَصَبِي مِنَ النِّسَاءِ وَ الثِّيَابِ وَ الطِّيبِ أَبْتَغِي بِذَلِكَ وَجْهَكَ وَ الدَّارَ الْآخِرَةَ \nقَالَ وَ يُجْزِئُكَ أَنْ تَقُولَ هَذَا مَرَّةً وَاحِدَةً حِينَ تُحْرِمُ ثُمَّ قُمْ فَامْشِ هُنَيْئَةً فَإِذَا اسْتَوَتْ بِكَ الْأَرْضُ مَاشِياً كُنْتَ أَوْ رَاكِباً فَلَبِّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ibn Abu Umeyr, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan, from Ibn Abu Umeyr, altogether from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Ihraam</span> does not happen except after the Prescribed Prayer. You should wear <span class=\"iTxt\">Ihraam</span> at the end of it after the greetings (in the Prayer), even though it may be an optional (Prayer). You should Pray two Cycles, and wear <span class=\"iTxt\">Ihraam</span> at the end of these two. So when you turn from your Prayer, then Praise Allah<sup>azwj</sup> and Extol upon Him<sup>azwj</sup>, and send Blessings upon the Prophet<sup>saww</sup>.\nAnd say, ‘O Allah<sup>azwj</sup>! I hereby ask You<sup>azwj</sup> to Make me to be from the ones who have answered to You, and believed in Your<sup>azwj</sup> Promise, and followed Your<sup>azwj</sup> Commands, for I am Your<sup>azwj</sup> servant, and in Your<sup>azwj</sup> Hold. I cannot protect except what You<sup>azwj</sup> Protect, and I cannot take except what You<sup>azwj</sup> Give. \nAnd You<sup>azwj</sup> have Mentioned the Hajj, so I hereby ask You<sup>azwj</sup> that You<sup>azwj</sup> should Determine it for me to be upon Your<sup>azwj</sup> Book and the Sunnah of Your<sup>azwj</sup> Prophet<sup>saww</sup>, and Strengthen me upon what I have weakened from, and Accept from me my rituals in Ease from You<sup>azwj</sup> and well-being, and Make me to be from Your<sup>azwj</sup> delegates who Please You<sup>azwj</sup> and You<sup>azwj</sup> are Pleased with, and Named, and Ordained. \nO Allah<sup>azwj</sup>! So Perfect my Hajj for me, and my Umra. O Allah<sup>azwj</sup>! I intend the <span class=\"iTxt\">Tamutto</span> with the Umra to the Hajj upon Your<sup>azwj</sup> Book and Sunnah of Your<sup>azwj</sup> Prophet<sup>saww</sup>. Thus, if something were to present itself to me withholding me, so free me when it withholds me by Your<sup>azwj</sup> Power which Your<sup>azwj</sup> have Ordained upon me. \nO Allah<sup>azwj</sup>! If it does not happen to be for Hajj, so for Umra. I shall hold sacred for You<sup>azwj</sup>, my hair, and my skin, and my flesh, and my blood, and my bones, and my mind away from my attaining from the women, and the clothes, and the perfume, and I seek Your<sup>azwj</sup> Face by that and the House of the Hereafter’. \nHe<sup>asws</sup> said: ‘And it would suffice you if you were to be saying this once when you wear <span class=\"iTxt\">Ihraam</span>. Then stand, so walk comfortably, then when the ground is even with you, whether you were walking or riding, so exclaim <span class=\"iTxt\">Talbiyya</span>’."}]}, {"index": 7138, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنِّي أُرِيدُ أَنْ أَتَمَتَّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ فَكَيْفَ أَقُولُ قَالَ تَقُولُ اللَّهُمَّ إِنِّي أُرِيدُ أَنْ أَتَمَتَّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ عَلَى كِتَابِكَ وَ سُنَّةِ نَبِيِّكَ ( صلى الله عليه وآله ) وَ إِنْ شِئْتَ أَضْمَرْتَ الَّذِي تُرِيدُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘I intend to perform <span class=\"iTxt\">Tamutto</span> with the Umra to the Hajj, so what should I be saying?’ He<sup>asws</sup> said: ‘You should be saying, ‘O Allah<sup>azwj</sup>! I intend to perform <span class=\"iTxt\">Tamutto</span> with the Umra to the Hajj upon Your<sup>azwj</sup> Book and the Sunnah of Your<sup>azwj</sup> Prophet<sup>saww</sup>’; and if you so desire to, you can keep in mind that which you intend for (instead of saying it)’."}]}, {"index": 7139, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:4", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ أَ لَيْلًا أَحْرَمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَمْ نَهَاراً فَقَالَ نَهَاراً قُلْتُ أَيَّ سَاعَةٍ قَالَ صَلَاةَ الظُّهْرِ فَسَأَلْتُهُ مَتَى تَرَى أَنْ نُحْرِمَ فَقَالَ سَوَاءٌ عَلَيْكُمْ إِنَّمَا أَحْرَمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) صَلَاةَ الظُّهْرِ لِأَنَّ الْمَاءَ كَانَ قَلِيلًا كَأَنْ يَكُونَ فِي رُءُوسِ الْجِبَالِ فَيُهَجِّرُ الرَّجُلُ إِلَى مِثْلِ ذَلِكَ مِنَ الْغَدِ وَ لَا يَكَادُ يَقْدِرُونَ عَلَى الْمَاءِ وَ إِنَّمَا أُحْدِثَتْ هَذِهِ الْمِيَاهُ حَدِيثاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ibn Abu Umeyr, from Hammad Bin usman, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup>, ‘Did Rasool-Allah<sup>saww</sup> wear <span class=\"iTxt\">Ihraam</span> at night or at daytime?’ So he<sup>asws</sup> said: ‘At daytime’. I said, ‘At what time?’ He<sup>asws</sup> said: ‘Al-Zohr Prayer’. So I asked him<sup>asws</sup>, ‘When do you<sup>asws</sup> view we should be wearing <span class=\"iTxt\">Ihraam</span>?’ So he<sup>asws</sup> said: ‘It is the same upon you. But rather, Rasool-Allah<sup>saww</sup> wore <span class=\"iTxt\">Ihraam</span> at Al-Zohr Prayer because the water was scarce. It used to occur in the top parts of the mountains, so the man would leave to acquire that from the morning, and almost was not able upon finding the water, and rather, these waters (today), are newly occurring’."}]}, {"index": 7140, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:5", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي إِبْرَاهِيمَ ( عليه السلام ) إِنَّ أَصْحَابَنَا يَخْتَلِفُونَ فِي وَجْهَيْنِ مِنَ الْحَجِّ يَقُولُ بَعْضٌ أَحْرِمْ بِالْحَجِّ مُفْرِداً فَإِذَا طُفْتَ بِالْبَيْتِ وَ سَعَيْتَ بَيْنَ الصَّفَا وَ الْمَرْوَةِ فَأَحِلَّ وَ اجْعَلْهَا عُمْرَةً وَ بَعْضُهُمْ يَقُولُ أَحْرِمْ وَ انْوِ الْمُتْعَةَ بِالْعُمْرَةِ إِلَى الْحَجِّ أَيُّ هَذَيْنِ أَحَبُّ إِلَيْكَ قَالَ انْوِ الْمُتْعَةَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Is’haq Bin Ammar who said, \n‘I said to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) that our companions are differing regarding two aspect from the Hajj. Some are saying, ‘Wear <span class=\"iTxt\">Ihraam</span> for the exclusive Hajj. So when you have circumambulated by the House, and performed Sa’ee between Al-Safa and Al-Marwa, so free (yourself from the <span class=\"iTxt\">Ihraam</span>) and make to be an Umra’; and some of them are saying, ‘Wear <span class=\"iTxt\">Ihraam</span> and intend the <span class=\"iTxt\">Tamutto</span> with the Umra to the Hajj’. Which of these two is more beloved to you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Intend the <span class=\"iTxt\">Tamutto</span>’."}]}, {"index": 7141, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ حَمْزَةَ بْنِ حُمْرَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الَّذِي يَقُولُ حُلَّنِي حَيْثُ حَبَسْتَنِي قَالَ هُوَ حِلٌّ حَيْثُ حَبَسَهُ قَالَ أَوْ لَمْ يَقُلْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Hamza Bin Humran who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the one who is saying, ‘Free me whereas You<sup>azwj</sup> withheld me’ (the obligations of Hajj). He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> has Freed him where he was withheld’. He<sup>asws</sup> said: ‘Or should he not say it’."}]}, {"index": 7142, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:7", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ هُوَ حِلٌّ إِذَا حُبِسَ اشْتَرَطَ أَوْ لَمْ يَشْتَرِطْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin usman, from Zurara, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘He is free as he is withheld, whether he makes such stipulation or not’."}]}, {"index": 7143, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:8", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ وَ زَيْدٍ الشَّحَّامِ وَ مَنْصُورِ بْنِ حَازِمٍ قَالُوا أَمَرَنَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَنْ نُلَبِّيَ وَ لَا نُسَمِّيَ شَيْئاً وَ قَالَ أَصْحَابُ الْإِضْمَارِ أَحَبُّ إِلَيَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Abu Bakr Al Hazramy and Zayd Al Shahham, and Mansour Bin Hazim who said, \n‘Abu Abdullah<sup>asws</sup> ordered us that we should exclaim <span class=\"iTxt\">Talbiyya</span> and not to specify anything. And he<sup>asws</sup> said: ‘The people of the concealment in the mind are more beloved to me (than the ones speaking their intentions)’."}]}, {"index": 7144, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:9", "text": "أَحْمَدُ عَنْ عَلِيٍّ عَنْ سَيْفٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ أَنَّهُ سَأَلَ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ الْإِضْمَارُ أَحَبُّ إِلَيَّ فَلَبِّ وَ لَا تُسَمِّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad, from Ali, from Sayf, from Is’haq Bin Ammar, \nWhen asked, Abu Al-Hassan Musa<sup>asws</sup> said: ‘The keeping (of the intention) in the mind is more beloved to me<sup>asws</sup>, therefore exclaim <span class=\"iTxt\">Talbiyya</span> and do not specify’."}]}, {"index": 7145, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:10", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَ رَأَيْتَ لَوْ أَنَّ رَجُلًا أَحْرَمَ فِي دُبُرِ صَلَاةٍ مَكْتُوبَةٍ أَ كَانَ يُجْزِئُهُ ذَلِكَ قَالَ نَعَمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘Do you<sup>asws</sup> view that if a man were to wear <span class=\"iTxt\">Ihraam</span> at the end of the Prescribed Prayer that would suffice him?’ He<sup>asws</sup> said: ‘Yes’."}]}, {"index": 7146, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:11", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ وَ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ وَ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ جَمِيعاً عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا صَلَّيْتَ فِي مَسْجِدِ الشَّجَرَةِ فَقُلْ وَ أَنْتَ قَاعِدٌ فِي دُبُرِ الصَّلَاةِ قَبْلَ أَنْ تَقُومَ مَا يَقُولُ الْمُحْرِمُ ثُمَّ قُمْ فَامْشِ حَتَّى تَبْلُغَ الْمِيلَ وَ تَسْتَوِيَ بِكَ الْبَيْدَاءُ فَإِذَا اسْتَوَتْ بِكَ فَلَبِّهْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary, and Abdul Rahman Bin Al Hajjaj, and Hammad Bin Usman, from Al Halby, altogether, \nAbu Abdullah<sup>asws</sup> has said: ‘When you have Prayed in the Masjid Al-Shajara, so say while you are seated, at the end of the Prayer, before you arise, what the one in <span class=\"iTxt\">Ihraam</span> would be saying. Then arise, and walk until you reach the mile, and Al-Bayda is in front of you. So when it is in front of you, then exclaim Talibiyya’."}]}, {"index": 7147, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:12", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ أَنَّهُ سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) هَلْ يَجُوزُ لِلْمُتَمَتِّعِ بِالْعُمْرَةِ إِلَى الْحَجِّ أَنْ يُظْهِرَ التَّلْبِيَةَ فِي مَسْجِدِ الشَّجَرَةِ فَقَالَ نَعَمْ إِنَّمَا لَبَّى النَّبِيُّ ( صلى الله عليه وآله ) عَلَى الْبَيْدَاءِ لِأَنَّ النَّاسَ لَمْ يَكُونُوا يَعْرِفُونَ التَّلْبِيَةَ فَأَحَبَّ أَنْ يُعَلِّمَهُمْ كَيْفَ التَّلْبِيَةُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ismail Bin Marrar, from Yunus, from Abdullah Bin Sinan, \nThe (narrator) asked Abu Abdullah<sup>asws</sup>, ‘Is it allowed for the one performing <span class=\"iTxt\">Tamutto</span> with the Umra to the Hajj, that he should manifest the <span class=\"iTxt\">Talbiyya</span> in Masjid Al-Shajara?’ So he<sup>asws</sup> said: ‘But rather, the Prophet<sup>saww</sup> exclaimed <span class=\"iTxt\">Talbiyya</span> at Al-Bayda, because the people were not recognising the <span class=\"iTxt\">Talbiyya</span>. Therefore Allah<sup>azwj</sup> Loved it that he<sup>saww</sup> should be teaching them how to exclaim <span class=\"iTxt\">Talbiyya</span>’."}]}, {"index": 7148, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:13", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِذَا أَحْرَمَ الرَّجُلُ فِي دُبُرِ الْمَكْتُوبَةِ أَ يُلَبِّي حِينَ يَنْهَضُ بِهِ بَعِيرُهُ أَوْ جَالِساً فِي دُبُرِ الصَّلَاةِ قَالَ أَيَّ ذَلِكَ شَاءَ صَنَعَ .\nقَالَ الْكُلَيْنِيُّ وَ هَذَا عِنْدِي مِنَ الْأَمْرِ الْمُتَوَسَّعِ إِلَّا أَنَّ الْفَضْلَ فِيهِ أَنْ يُظْهِرَ التَّلْبِيَةَ حَيْثُ أَظْهَرَ النَّبِيُّ ( صلى الله عليه وآله ) عَلَى طَرَفِ الْبَيْدَاءِ وَ لَا يَجُوزُ لِأَحَدٍ أَنْ يَجُوزَ مِيلَ الْبَيْدَاءِ إِلَّا وَ قَدْ أَظْهَرَ التَّلْبِيَةَ وَ أَوَّلُ الْبَيْدَاءِ أَوَّلُ مِيلٍ يَلْقَاكَ عَنْ يَسَارِ الطَّرِيقِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Ammar, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘When the man wears the <span class=\"iTxt\">Ihraam</span> at the end of the Prescribed (Prayer), should he exclaim <span class=\"iTxt\">Talbiyya</span> when he gets ready with it on his camel, or when he is seated at the end of the Prayer?’ He<sup>asws</sup> said: ‘Whichever of that he so desires to, he can do it’. \nAl-Kulayni (author of this book) said, ‘And this is with me from the easier matters, except that the merit in it is that he should manifest the <span class=\"iTxt\">Talbiyya</span> where the Prophet<sup>saww</sup> manifested it, upon the side of Al-Bayda, and it is not allowed for anyone that he should exceed a mile of Al-Bayda, except if he had already expressed <span class=\"iTxt\">Talbiyya</span>; and the first mile of Al-Bayda is the first mile which you come across on the left of the road’."}]}, {"index": 7149, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:14", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ صَلِّ الْمَكْتُوبَةَ ثُمَّ أَحْرِمْ بِالْحَجِّ أَوْ بِالْمُتْعَةِ وَ اخْرُجْ بِغَيْرِ تَلْبِيَةٍ حَتَّى تَصْعَدَ إِلَى أَوَّلِ الْبَيْدَاءِ إِلَى أَوَّلِ مِيلٍ عَنْ يَسَارِكَ فَإِذَا اسْتَوَتْ بِكَ الْأَرْضُ رَاكِباً كُنْتَ أَوْ مَاشِياً فَلَبِّ فَلَا يَضُرُّكَ لَيْلًا أَحْرَمْتَ أَوْ نَهَاراً وَ مَسْجِدُ ذِي الْحُلَيْفَةِ الَّذِي كَانَ خَارِجاً عَنِ السَّقَائِفِ عَنْ صَحْنِ الْمَسْجِدِ ثُمَّ الْيَوْمَ لَيْسَ شَيْ‏ءٌ مِنَ السَّقَائِفِ مِنْهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Pray the Prescribed (Prayers), then wear <span class=\"iTxt\">Ihraam</span> for the Hajj, or for the Umra, and go out without <span class=\"iTxt\">Talbiyya</span> until you ascend to the beginning of Al-Bayda, to the first mile on your left. So when the ground is level, whether you are riding or walking, so exclaim <span class=\"iTxt\">Talbiyya</span>. It would not harm you whether you wear <span class=\"iTxt\">Ihraam</span> at night or at daytime. And, Masjid Zul-Huleyfa is that which was outside from the pavilions, from the courtyard of the Masjid. Then today, there is nothing from the pavilions from it (still remaining)’."}]}, {"index": 7150, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:15", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْمُعْتَمِرُ عُمْرَةً مُفْرَدَةً يَشْتَرِطُ عَلَى رَبِّهِ أَنْ يَحُلَّهُ حَيْثُ حَبَسَهُ وَ مُفْرِدُ الْحَجِّ يَشْتَرِطُ عَلَى رَبِّهِ إِنْ لَمْ يَكُنْ حَجَّةً فَعُمْرَةً .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahbooub, from Ali Bin Raib, from Fuzayl Bin Yasaar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one performing Umra exclusively stipulates to his Lord<sup>azwj</sup> that He<sup>azwj</sup> Releases him as He<sup>azwj</sup> had withheld him, and the one performing the exclusive Hajj who stipulates to his Lord<sup>azwj</sup> if Hajj does not happen (for him), so (make) it is an Umra (for him)’."}]}, {"index": 7151, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:4:3:80:16", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ أَبِي الْمَغْرَاءِ عَنْ أَبِي عَبْدِ اللَّهِ قَالَ كَانَتْ بَنُو إِسْرَائِيلَ إِذَا قَرَّبَتِ الْقُرْبَانَ تَخْرُجُ نَارٌ تَأْكُلُ قُرْبَانَ مَنْ قُبِلَ مِنْهُ وَ إِنَّ اللَّهَ جَعَلَ الْإِحْرَامَ مَكَانَ الْقُرْبَانِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Usman Bin Isa, from Abu Al Magra, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It used to be so that whenever the Children of Israel used to offer an offering, a flame would come out consuming the offering (which was a sign of) accepting it from him, and that Allah<sup>azwj</sup> Made the <span class=\"iTxt\">Ihraam</span> to be in place of the offering (as a means of acceptance)’."}]}]}, "index": "al-kafi:4:3:80", "kind": "verse_list"}