{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 81"}, "path": "/books/al-kafi:4:3:81", "titles": {"ar": "بَابُ التَّلْبِيَةِ", "en": "Chapter 81 – The Talbiyya (The exclamation: ‘Here I am Lord<sup>azwj</sup>! Here I am!)"}}], "index": 1024, "local_index": 81, "part_type": "Chapter", "path": "/books/al-kafi:4:3:81", "titles": {"ar": "بَابُ التَّلْبِيَةِ", "en": "Chapter 81 – The Talbiyya (The exclamation: ‘Here I am Lord<sup>azwj</sup>! Here I am!)"}, "verse_count": 8, "verse_start_index": 7151, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 7152, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:81:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُهُ لِمَ جُعِلَتِ التَّلْبِيَةُ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَوْحَى إِلَى إِبْرَاهِيمَ ( عليه السلام ) أَنْ أَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجالًا وَ عَلى كُلِّ ضامِرٍ يَأْتِينَ مِنْ كُلِّ فَجٍّ عَمِيقٍ فَنَادَى فَأُجِيبَ مِنْ كُلِّ وَجْهٍ يُلَبُّونَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby who said, ", "‘I asked him<sup>asws</sup>, ‘Why has the <span class=\"iTxt\">Talbiyya</span> made to be?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Ibrahim<sup>as</sup> <span class=\"ibTxt\">[22:27] And proclaim among the people for the Pilgrimage: they will come to you on foot and on every lean camel, coming from every remote path</span>. So he<sup>as</sup> called out, and was answered from every direction, exclaiming <span class=\"iTxt\">Talbiyya</span>’."]}}, {"index": 7153, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:81:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ جَعْفَرٍ عَنْ أَبِيهِ ( عليه السلام ) أَنَّ عَلِيّاً ( صلوات الله عليه ) قَالَ تَلْبِيَةُ الْأَخْرَسِ وَ تَشَهُّدُهُ وَ قِرَاءَتُهُ الْقُرْآنَ فِي الصَّلَاةِ تَحْرِيكُ لِسَانِهِ وَ إِشَارَتُهُ بِإِصْبَعِهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al nowfaly, from Al Sakuny, ", "(It has been narrated) from Ja’far<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup> that Ali<sup>asws</sup> said: ‘<span class=\"iTxt\">Talbiyya</span> of the mute person, and his testimony, and his recitation of the Quran during the Prayer is the movement of his tongue, and gestures by his fingers’."]}}, {"index": 7154, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:81:3", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ وَ ابْنِ أَبِي عُمَيْرٍ جَمِيعاً عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ التَّلْبِيَةُ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَ النِّعْمَةَ لَكَ وَ الْمُلْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ ذَا الْمَعَارِجِ لَبَّيْكَ لَبَّيْكَ دَاعِياً إِلَى دَارِ السَّلَامِ لَبَّيْكَ لَبَّيْكَ غَفَّارَ الذُّنُوبِ لَبَّيْكَ", "لَبَّيْكَ أَهْلَ التَّلْبِيَةِ لَبَّيْكَ لَبَّيْكَ ذَا الْجَلَالِ وَ الْإِكْرَامِ لَبَّيْكَ لَبَّيْكَ مَرْهُوباً وَ مَرْغُوباً إِلَيْكَ لَبَّيْكَ لَبَّيْكَ تُبْدِئُ وَ الْمَعَادُ إِلَيْكَ لَبَّيْكَ لَبَّيْكَ كَشَّافَ الْكُرَبِ الْعِظَامِ لَبَّيْكَ لَبَّيْكَ عَبْدُكَ وَ ابْنُ عَبْدَيْكَ لَبَّيْكَ لَبَّيْكَ يَا كَرِيمُ لَبَّيْكَ ", "تَقُولُ ذَلِكَ فِي دُبُرِ كُلِّ صَلَاةٍ مَكْتُوبَةٍ أَوْ نَافِلَةٍ وَ حِينَ يَنْهَضُ بِكَ بَعِيرُكَ وَ إِذَا عَلَوْتَ شَرَفاً أَوْ هَبَطْتَ وَادِياً أَوْ لَقِيتَ رَاكِباً أَوِ اسْتَيْقَظْتَ مِنْ مَنَامِكَ وَ بِالْأَسْحَارِ وَ أَكْثِرْ مَا اسْتَطَعْتَ مِنْهَا وَ اجْهَرْ بِهَا وَ إِنْ تَرَكْتَ بَعْضَ التَّلْبِيَةِ فَلَا يَضُرُّكَ غَيْرَ أَنَّ تَمَامَهَا أَفْضَلُ", "وَ اعْلَمْ أَنَّهُ لَا بُدَّ مِنَ التَّلْبِيَاتِ الْأَرْبَعِ فِي أَوَّلِ الْكَلَامِ وَ هِيَ الْفَرِيضَةُ وَ هِيَ التَّوْحِيدُ وَ بِهَا لَبَّى الْمُرْسَلُونَ وَ أَكْثِرْ مِنْ ذِي الْمَعَارِجِ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يُكْثِرُ مِنْهَا ", "وَ أَوَّلُ مَنْ لَبَّى إِبْرَاهِيمُ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَدْعُوكُمْ إِلَى أَنْ تَحُجُّوا بَيْتَهُ فَأَجَابُوهُ بِالتَّلْبِيَةِ فَلَمْ يَبْقَ أَحَدٌ أُخِذَ مِيثَاقُهُ بِالْمُوَافَاةِ فِي ظَهْرِ رَجُلٍ وَ لَا بَطْنِ امْرَأَةٍ إِلَّا أَجَابَ بِالتَّلْبِيَةِ ."], "translations": {"en.hubeali": ["Ali, from his father, from Ibn Abu Umeyr, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan, and Ibn Abu Umeyr, altogether from Muawiya Bin Ammar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Talbiyya</span> is – O Allah<sup>azwj</sup>! Here I am! O Allah<sup>azwj</sup>! Here I am! Here I am! There is no associate for You<sup>azwj</sup>. Here I am! Surely the Praise, and the Bounties are for You<sup>azwj</sup>, and the Kingdom, there being no associates for You<sup>azwj</sup>! Here I am!, O the One with the Loftiness! Here I am! O the Caller to the house of Al-Islam. Here I am! Here I am! Forgiver of sins, here I am!", "Here I am, O the Rightful One for the <span class=\"iTxt\">Talbiyya</span>! Here I am O the One with the Majesty and the Prestige, here I am! Here I am O the One hoped to and desired to You, here I am! Here I am the O Beginner and the ending being to You<sup>azwj</sup>, here I am! Here I am O the Remover of the great anguish, here I am! Here I am, Your<sup>azwj</sup> servant and a son of Your<sup>azwj</sup> servant, here I am! Here I am, O the Benevolent, here I am!", "You should be saying that at the end of each Prescribed Prayer, or optional, and when you get ready with your camel, or ascending a hillock, or descending into a valley, or meeting a rider, or when you wake up from your sleep, and at dawn, and frequent it as per your ability from it, and be loud with it. And, if you were to neglect some of the <span class=\"iTxt\">Talbiyya</span>, so it would not harm you apart from that the complete of it is superior.", "And know, that it is a must from the <span class=\"iTxt\">Talbiyya</span>, the four fist words (of it), and it is the Obligatory, and it is the Oneness (Tawheed), and by it have the Mursil Prophets<sup>as</sup> exclaimed, and many of the ones with loftiness, for Rasool-Allah<sup>saww</sup> used to frequent from it. ", "And, the first one to exclaim <span class=\"iTxt\">Talbiyya</span> was Ibrahim<sup>as</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic is Calling you all to perform Hajj of His<sup>azwj</sup> House (Kabah)!’ Thus, there did not remain anyone whose Covenant had been Taken with the loyalty in the back of a man, nor a belly of a woman, except that he answered by the <span class=\"iTxt\">Talbiyya</span>’."]}}, {"index": 7155, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:81:4", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ يَقْطِينٍ عَنْ أَسَدِ بْنِ أَبِي الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَمَّنْ رَأَى أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ هُوَ مُحْرِمٌ قَدْ كَشَفَ عَنْ ظَهْرِهِ حَتَّى أَبْدَاهُ لِلشَّمْسِ هُوَ يَقُولُ لَبَّيْكَ فِي الْمُذْنِبِينَ لَبَّيْكَ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Hassan Bin Ali Bin Yaqteen, from Asad Bin Abu Al A’ala, from Muhammad Bin Al Fuzayl, ", "(It has been narrated) from the one who saw Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> was in <span class=\"iTxt\">Ihraam</span>, as his<sup>asws</sup> back being exposed to the sun, he<sup>asws</sup> was saying: ‘Here I<sup>asws</sup> am among the sinners, here I<sup>asws</sup> am!’."]}}, {"index": 7156, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:81:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ رَفَعَهُ قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَمَّا أَحْرَمَ أَتَاهُ  جَبْرَئِيلُ ( عليه السلام ) فَقَالَ لَهُ مُرْ أَصْحَابَكَ بِالْعَجِّ وَ الثَّجِّ وَ الْعَجُّ رَفْعُ الصَّوْتِ بِالتَّلْبِيَةِ وَ الثَّجُّ نَحْرُ الْبُدْنِ ", "وَ قَالَ قَالَ جَابِرُ بْنُ عَبْدِ اللَّهِ مَا بَلَغْنَا الرَّوْحَاءَ حَتَّى بَحَّتْ أَصْوَاتُنَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, raising it, ", "‘He<sup>asws</sup> said: ‘When Rasool-Allah<sup>saww</sup> wore <span class=\"iTxt\">Ihraam</span>, Jibraeel<sup>as</sup> came over to him<sup>saww</sup>, so he<sup>as</sup> said to him<sup>saww</sup>: ‘Order your<sup>saww</sup> companions with the ‘Ajji’ and the ‘Sajji’; and the Ajji is raising of the voice with the <span class=\"iTxt\">Talbiyya</span>, and Al Sajji is sacrificing of the ‘الْبُدْنِ’ animal’.  ", "And he (the narrator) said, ‘Jabir Bin Abdullah said, ‘We had not reached Al-Rowha until our voices were (loud and) clear’."]}}, {"index": 7157, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:81:6", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا بَأْسَ بِأَنْ تُلَبِّيَ وَ أَنْتَ عَلَى غَيْرِ طُهْرٍ وَ عَلَى كُلِّ حَالٍ ."], "translations": {"en.hubeali": ["Ali, from his father, from Hammad Bin Usman, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is no problem with it if you were to exclaim <span class=\"iTxt\">Talbiyya</span> upon other than purity, and upon every state’."]}}, {"index": 7158, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:81:7", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ أَبِي سَعِيدٍ الْمُكَارِي عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَيْسَ عَلَى النِّسَاءِ جَهْرٌ بِالتَّلْبِيَةِ ."], "translations": {"en.hubeali": ["Ali, from his father, from Ibn Abu Umeyr, from Abu Ayoub Al Khazzaz, from Abu Saeed Al Mukary, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is not upon the women to be loud with the <span class=\"iTxt\">Talbiyya</span>’."]}}, {"index": 7159, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:81:8", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنِ ابْنِ فَضَّالٍ عَنْ رِجَالٍ شَتَّى عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ لَبَّى فِي إِحْرَامِهِ سَبْعِينَ مَرَّةً إِيمَاناً وَ احْتِسَاباً أَشْهَدَ اللَّهُ لَهُ أَلْفَ أَلْفِ مَلَكٍ بِبَرَاءَةٍ مِنَ النَّارِ وَ بَرَاءَةٍ مِنَ النِّفَاقِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Abu Abdullah, from Ibn Fazzal, from various men, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who exclaims <span class=\"iTxt\">Talbiyya</span> seventy times being in his <span class=\"iTxt\">Ihraam</span> with having Eman (faith) and considering it as a good deed, Allah<sup>azwj</sup> would Cause a thousand thousand Angels to testify for him with the freedom from the Fire, and freedom from the hypocrisy’."]}}]}, "index": "al-kafi:4:3:81", "kind": "verse_list"}