{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 9"}, "path": "/books/al-kafi:4:3:9", "titles": {"ar": "بَابُ وُرُودِ تُبَّعٍ وَ أَصْحَابِ الْفِيلِ الْبَيْتَ وَ حَفْرِ عَبْدِ الْمُطَّلِبِ زَمْزَمَ وَ هَدْمِ قُرَيْشٍ الْكَعْبَةَ وَ بِنَائِهِمْ إِيَّاهَا وَ هَدْمِ الْحَجَّاجِ لَهَا وَ بِنَائِهِ إِيَّاهَا ", "en": "Chapter 9 – The advent of Tubba and the owners of the elephants to the House (Kaaba), and Abdul Muttalib<sup>as</sup>’s digging of (the well of) Zamzam, and the Qureysh demolishing the Kaaba and their building of it, and demolishing of Al-Hajjaj of it and his building it"}}], "index": 952, "local_index": 9, "part_type": "Chapter", "path": "/books/al-kafi:4:3:9", "titles": {"ar": "بَابُ وُرُودِ تُبَّعٍ وَ أَصْحَابِ الْفِيلِ الْبَيْتَ وَ حَفْرِ عَبْدِ الْمُطَّلِبِ زَمْزَمَ وَ هَدْمِ قُرَيْشٍ الْكَعْبَةَ وَ بِنَائِهِمْ إِيَّاهَا وَ هَدْمِ الْحَجَّاجِ لَهَا وَ بِنَائِهِ إِيَّاهَا ", "en": "Chapter 9 – The advent of Tubba and the owners of the elephants to the House (Kaaba), and Abdul Muttalib<sup>as</sup>’s digging of (the well of) Zamzam, and the Qureysh demolishing the Kaaba and their building of it, and demolishing of Al-Hajjaj of it and his building it"}, "verse_count": 8, "verse_start_index": 6721, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6722, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:9:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ جَابِرٍ قَالَ كُنْتُ فِيمَا بَيْنَ مَكَّةَ وَ الْمَدِينَةِ أَنَا وَ صَاحِبٌ لِي فَتَذَاكَرْنَا الْأَنْصَارَ فَقَالَ أَحَدُنَا هُمْ نُزَّاعٌ مِنْ قَبَائِلَ وَ قَالَ أَحَدُنَا هُمْ مِنْ أَهْلِ الْيَمَنِ قَالَ ", "فَانْتَهَيْنَا إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ هُوَ جَالِسٌ فِي ظِلِّ شَجَرَةٍ فَابْتَدَأَ الْحَدِيثَ وَ لَمْ نَسْأَلْهُ فَقَالَ إِنَّ تُبَّعاً لَمَّا أَنْ جَاءَ مِنْ قِبَلِ الْعِرَاقِ وَ جَاءَ مَعَهُ الْعُلَمَاءُ وَ أَبْنَاءُ الْأَنْبِيَاءِ فَلَمَّا انْتَهَى إِلَى هَذَا الْوَادِي لِهُذَيْلٍ أَتَاهُ أُنَاسٌ مِنْ بَعْضِ الْقَبَائِلِ فَقَالُوا إِنَّكَ تَأْتِي أَهْلَ بَلْدَةٍ قَدْ لَعِبُوا بِالنَّاسِ زَمَاناً طَوِيلًا حَتَّى اتَّخَذُوا بِلَادَهُمْ حَرَماً وَ بُنْيَتَهُمْ رَبّاً أَوْ رَبَّةً فَقَالَ إِنْ كَانَ كَمَا تَقُولُونَ قَتَلْتُ مُقَاتِلِيهِمْ وَ سَبَيْتُ ذُرِّيَّتَهُمْ وَ هَدَمْتُ بُنْيَتَهُمْ", "قَالَ فَسَالَتْ عَيْنَاهُ حَتَّى وَقَعَتَا عَلَى خَدَّيْهِ قَالَ فَدَعَا الْعُلَمَاءَ وَ أَبْنَاءَ الْأَنْبِيَاءِ فَقَالَ انْظُرُونِي وَ أَخْبِرُونِي لِمَا أَصَابَنِي هَذَا قَالَ فَأَبَوْا أَنْ يُخْبِرُوهُ حَتَّى عَزَمَ عَلَيْهِمْ قَالُوا حَدِّثْنَا بِأَيِّ شَيْ‏ءٍ حَدَّثْتَ نَفْسَكَ قَالَ حَدَّثْتُ نَفْسِي أَنْ أَقْتُلَ مُقَاتِلِيهِمْ وَ أَسْبِيَ ذُرِّيَّتَهُمْ وَ أَهْدِمَ بُنْيَتَهُمْ فَقَالُوا إِنَّا لَا نَرَى الَّذِي أَصَابَكَ إِلَّا لِذَلِكَ", "قَالَ وَ لِمَ هَذَا قَالُوا لِأَنَّ الْبَلَدَ حَرَمُ اللَّهِ وَ الْبَيْتَ بَيْتُ اللَّهِ وَ سُكَّانَهُ ذُرِّيَّةُ إِبْرَاهِيمَ خَلِيلِ الرَّحْمَنِ فَقَالَ صَدَقْتُمْ فَمَا مَخْرَجِي مِمَّا وَقَعْتُ فِيهِ قَالُوا تُحَدِّثُ نَفْسَكَ بِغَيْرِ ذَلِكَ فَعَسَى اللَّهُ أَنْ يَرُدَّ عَلَيْكَ", "قَالَ فَحَدَّثَ نَفْسَهُ بِخَيْرٍ فَرَجَعَتْ حَدَقَتَاهُ حَتَّى ثَبَتَتَا مَكَانَهُمَا قَالَ فَدَعَا بِالْقَوْمِ الَّذِينَ أَشَارُوا عَلَيْهِ بِهَدْمِهَا فَقَتَلَهُمْ ثُمَّ أَتَى الْبَيْتَ وَ كَسَاهُ وَ أَطْعَمَ الطَّعَامَ ثَلَاثِينَ يَوْماً كُلَّ يَوْمٍ مِائَةَ جَزُورٍ حَتَّى حُمِلَتِ الْجِفَانُ إِلَى السِّبَاعِ فِي رُءُوسِ الْجِبَالِ وَ نُثِرَتِ الْأَعْلَافُ فِي الْأَوْدِيَةِ لِلْوُحُوشِ ثُمَّ انْصَرَفَ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ فَأَنْزَلَ بِهَا قَوْماً مِنْ أَهْلِ الْيَمَنِ مِنْ غَسَّانَ وَ هُمُ الْأَنْصَارُ ", "فِي رِوَايَةٍ أُخْرَى كَسَاهُ النِّطَاعَ وَ طَيَّبَهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Al husayn Bin Al Mukhtar who said, ", "‘Ismail Bin Jabir narrated to be saying, ‘We were in what is between Makkah and Al-Medina, myself and some companions of mine, so we mentioned the Helpers (Ansaar), so one of us said, ‘They sprung from the tribes’, and one of us said, ‘They were the people of Al-Yemen’.  ", "So we ended up to Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> was seated in the shade of a tree. So he<sup>asws</sup> began the discussion and we did not ask him<sup>asws</sup>, so he<sup>asws</sup> said: ‘When Tubba came from Al-Iraq and there came with him the scholars and the sons of the Prophets<sup>as</sup>. So when he ended up to this valley of Huzeyl, the people came over to him from some of the tribes, so they said, ‘You have come to the people of a city who have played with the people for a long time now, to the extent that they have taken their cities as sacred, and their buildings as male lords or female lords’. So he said, ‘If it is such as what you are saying it to be, I will kill their fighters and make captives of their offspring, and demolish their buildings. ", "He<sup>asws</sup> said: ‘So his eyes came out until they dropped upon his cheeks. So he called the scholars and the sons of the Prophets<sup>as</sup> and he said, ‘Look at me and inform me of what is this which has hit me’. But they refused to inform him until he was resolute upon them. They said, ‘Narrate to us with which thing you have narrated yourself’. He said, ‘I narrated to myself that I would be killing their fighters and imprisoning their offspring, and demolish their buildings’. They said, ‘We do not see that which has hit you except it being due to that’. ", "He said, ‘And why is this so?’ They said, ‘Because the city is the Sanctuary of Allah<sup>azwj</sup> and the House is the House of Allah<sup>azwj</sup> and therein dwell the offspring of Ibrahim<sup>as</sup> the Friend of the Beneficent’. So he said, ‘You speak the truth. So what is my way out from what I have fallen into?’ They said, ‘You must narrate to yourself with other than that, so perhaps Allah<sup>azwj</sup> would Return upon you (your previous state). ", "He<sup>asws</sup> said: ‘So he narrated to himself with the goodness, and his eyes returned to the extent that they were affirmed back in their places. So he called the people who had advised him with its demolishing, and he killed them. Then he went over to the House (Kaaba) and clothed it, and fed the food (to the people) for thirty days, each day one hundred camels to the extent that they carried the cooking to the wild animal in the top of the mountain and scattered it in the valleys for the wild animal. Then he left from Makkah to Al-Medina, so he lodged at it with a people from the inhabitants of Al-Yemen, from the youths, and they are the Helpers (Al-Ansaar)’. ", "In another report, ‘He (Tubba) clothed it (Kaaba) with fragrances and perfumes’."]}}, {"index": 6723, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:9:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ حُمْرَانَ وَ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا أَقْبَلَ صَاحِبُ الْحَبَشَةِ بِالْفِيلِ يُرِيدُ هَدْمَ الْكَعْبَةِ مَرُّوا بِإِبِلٍ لِعَبْدِ الْمُطَّلِبِ فَاسْتَاقُوهَا فَتَوَجَّهَ عَبْدُ الْمُطَّلِبِ إِلَى صَاحِبِهِمْ يَسْأَلُهُ رَدَّ إِبِلِهِ عَلَيْهِ فَاسْتَأْذَنَ عَلَيْهِ فَأَذِنَ لَهُ وَ قِيلَ لَهُ إِنَّ هَذَا شَرِيفُ قُرَيْشٍ أَوْ عَظِيمُ قُرَيْشٍ وَ هُوَ رَجُلٌ لَهُ عَقْلٌ وَ مُرُوَّةٌ فَأَكْرَمَهُ وَ أَدْنَاهُ", "ثُمَّ قَالَ لِتَرْجُمَانِهِ سَلْهُ مَا حَاجَتُكَ فَقَالَ لَهُ إِنَّ أَصْحَابَكَ مَرُّوا بِإِبِلٍ لِي فَاسْتَاقُوهَا فَأَحْبَبْتُ أَنْ تَرُدَّهَا عَلَيَّ قَالَ فَتَعَجَّبَ مِنْ سُؤَالِهِ إِيَّاهُ رَدَّ الْإِبِلِ وَ قَالَ هَذَا الَّذِي زَعَمْتُمْ أَنَّهُ عَظِيمُ قُرَيْشٍ وَ ذَكَرْتُمْ عَقْلَهُ يَدَعُ أَنْ يَسْأَلَنِي أَنْ أَنْصَرِفَ عَنْ بَيْتِهِ الَّذِي يَعْبُدُهُ أَمَا لَوْ سَأَلَنِي أَنْ أَنْصَرِفَ عَنْ هَدِّهِ لَانْصَرَفْتُ لَهُ عَنْهُ", "فَأَخْبَرَهُ التَّرْجُمَانُ بِمَقَالَةِ الْمَلِكِ فَقَالَ لَهُ عَبْدُ الْمُطَّلِبِ إِنَّ لِذَلِكَ الْبَيْتِ رَبّاً يَمْنَعُهُ وَ إِنَّمَا سَأَلْتُكَ رَدَّ إِبِلِي لِحَاجَتِي إِلَيْهَا فَأَمَرَ بِرَدِّهَا عَلَيْهِ وَ مَضَى عَبْدُ الْمُطَّلِبِ حَتَّى لَقِيَ الْفِيلَ عَلَى طَرَفِ الْحَرَمِ فَقَالَ لَهُ مَحْمُودُ فَحَرَّكَ رَأْسَهُ فَقَالَ لَهُ أَ تَدْرِي لِمَا جِي‏ءَ بِكَ فَقَالَ بِرَأْسِهِ لَا فَقَالَ جَاءُوا بِكَ لِتَهْدِمَ بَيْتَ رَبِّكَ أَ فَتَفْعَلُ فَقَالَ بِرَأْسِهِ لَا", "قَالَ فَانْصَرَفَ عَنْهُ عَبْدُ الْمُطَّلِبِ وَ جَاءُوا بِالْفِيلِ لِيَدْخُلَ الْحَرَمَ فَلَمَّا انْتَهَى إِلَى طَرَفِ الْحَرَمِ امْتَنَعَ مِنَ الدُّخُولِ فَضَرَبُوهُ فَامْتَنَعَ فَأَدَارُوا بِهِ نَوَاحِيَ الْحَرَمِ كُلَّهَا كُلُّ ذَلِكَ يَمْتَنِعُ عَلَيْهِمْ فَلَمْ يَدْخُلْ", "وَ بَعَثَ اللَّهُ عَلَيْهِمُ الطَّيْرَ كَالْخَطَاطِيفِ فِي مَنَاقِيرِهَا حَجَرٌ كَالْعَدَسَةِ أَوْ نَحْوِهَا فَكَانَتْ تُحَاذِي بِرَأْسِ الرَّجُلِ ثُمَّ تُرْسِلُهَا عَلَى رَأْسِهِ فَتَخْرُجُ مِنْ دُبُرِهِ حَتَّى لَمْ يَبْقَ مِنْهُمْ أَحَدٌ إِلَّا رَجُلٌ هَرَبَ فَجَعَلَ يُحَدِّثُ النَّاسَ بِمَا رَأَى إِذَا طَلَعَ عَلَيْهِ طَائِرٌ مِنْهَا فَرَفَعَ رَأْسَهُ فَقَالَ هَذَا الطَّيْرُ مِنْهَا وَ جَاءَ الطَّيْرُ حَتَّى حَاذَى بِرَأْسِهِ ثُمَّ أَلْقَاهَا عَلَيْهِ فَخَرَجَتْ مِنْ دُبُرِهِ فَمَاتَ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Muhammad Bin Humran, and Hisham Bin Salim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the master (king) of Ethiopia came over with the elephants intending to demolish the Kaaba, (he) passed by the camels of Abdul Muttalib<sup>as</sup>, so he took them. So Abdul Muttalib<sup>as</sup> directed himself<sup>as</sup> to his companions to ask him to return his<sup>as</sup> camels back to him<sup>as</sup>, and he<sup>as</sup> sought permission to see him. So they got the permission for him<sup>as</sup> and said to him, ‘This is a nobleman of Qureysh, or a great one of Qureysh, and he is a man for whom is intellect and a personality. So he honoured him<sup>as</sup> and let him<sup>as</sup> come near.", "The he said to his interpretor, ‘Ask him<sup>as</sup>, ‘What is your<sup>as</sup> need?’’ So he<sup>as</sup> said to him: ‘Your companions passed by camels of mine, so they took them, therefore I<sup>as</sup> would like you to return these to me<sup>as</sup>’. So he was astounded (surprised) from his<sup>asws</sup> request to him for the return of the camels, and said, ‘This is the one who you all are claiming that he<sup>as</sup> is the great one of Qureysh and mentioned his<sup>as</sup> intellect, neglecting asking me that I should leave from his<sup>as</sup> House (Kaaba) which he<sup>as</sup> worships. But, had he<sup>as</sup> asked me that I should leave from demolishing it, I would have left it for him<sup>as</sup>, from it’. ", "So the interpreter informed him<sup>as</sup> of his speech, so Abdul Muttalib<sup>as</sup> said to him: ‘For that House (Kaaba) there is a Lord<sup>azwj</sup> Defending it, and rather I<sup>as</sup> asked you to return my camels to me due to my<sup>as</sup> need to these’. So he ordered with their return to him<sup>as</sup> and Abdul Muttalib<sup>as</sup> went away until he<sup>as</sup> came across the elephant upon the side of the Sanctuary. So he<sup>as</sup> said to it: ‘Mahmoud!’ So it moved its head, and he<sup>as</sup> said to it: ‘Do you know for what they have come with you?’ So it said by (shaking) its head, ‘No’. So he<sup>as</sup> said: ‘They have come with you to demolish the House of your Lord<sup>azwj</sup>. Would you do it?’ So it said by (shaking) its head, ‘No’. ", "He<sup>asws</sup> said: ‘So Abdul Muttalib<sup>as</sup> left from it and they came over with the elephants in order to enter the Sanctuary. So when they ended up to the side of the Sanctuary, it obstructed from their entering. So they struck it, but it still obstructed. So they circled with it around the Sanctuary, all of it. During each of that it obstructed against them and it did not enter. ", "And, Allah<sup>azwj</sup> Sent the birds upon them like swallows. In the beak (of each bird) was a stone like a bean or so. So it hovered on top of the man, then released it upon his head. So it came out from his behind, to the extent that there did not remain anyone from them except for one man who fled. So he went on to narrate to the people with what he saw, when a bird from them emerged, so he raised his head and said, ‘This is the bird from it’, and the bird came over until it hovered on top of his head, then cast it upon him. So it came out from his behind, so he died’."]}}, {"index": 6724, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:9:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَعِيدِ بْنِ عَبْدِ اللَّهِ الْأَعْرَجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ قُرَيْشاً فِي الْجَاهِلِيَّةِ هَدَمُوا الْبَيْتَ فَلَمَّا أَرَادُوا بِنَاءَهُ حِيلَ بَيْنَهُمْ وَ بَيْنَهُ وَ أُلْقِيَ فِي رُوعِهِمُ الرُّعْبُ حَتَّى قَالَ قَائِلٌ مِنْهُمْ لَيَأْتِي كُلُّ رَجُلٍ مِنْكُمْ بِأَطْيَبِ مَالِهِ وَ لَا تَأْتُوا بِمَالٍ اكْتَسَبْتُمُوهُ مِنْ قَطِيعَةِ رَحِمٍ أَوْ حَرَامٍ فَفَعَلُوا فَخُلِّيَ بَيْنَهُمْ وَ بَيْنَ بِنَائِهِ", "فَبَنَوْهُ حَتَّى انْتَهَوْا إِلَى مَوْضِعِ الْحَجَرِ الْأَسْوَدِ فَتَشَاجَرُوا فِيهِ أَيُّهُمْ يَضَعُ الْحَجَرَ الْأَسْوَدَ فِي مَوْضِعِهِ حَتَّى كَادَ أَنْ يَكُونَ بَيْنَهُمْ شَرٌّ فَحَكَّمُوا أَوَّلَ مَنْ يَدْخُلُ مِنْ بَابِ الْمَسْجِدِ فَدَخَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ", "فَلَمَّا أَتَاهُمْ أَمَرَ بِثَوْبٍ فَبَسَطَ ثُمَّ وَضَعَ الْحَجَرَ فِي وَسَطِهِ ثُمَّ أَخَذَتِ الْقَبَائِلُ بِجَوَانِبِ الثَّوْبِ فَرَفَعُوهُ ثُمَّ تَنَاوَلَهُ ( صلى الله عليه وآله ) فَوَضَعَهُ فِي مَوْضِعِهِ فَخَصَّهُ اللَّهُ بِهِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Numan, from Saeed Bin Abdullah Al A’raj, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Qureysh had demolished the House (Kaaba) during the pre-Islamic period. So when they intended to build it, there was an impediment between them and it, and the awe (fear) was prevalent among them to the extent that a speaker from them said, ‘Let each man from you come with the best of his wealth, and he should not come with wealth he has earned from cutting-off of relationships or prohibited means’. So they did it, and there was a loosening between them and building it. ", "So they built it to the extent that they ended up to the place of the Black Stone. So they quarrelled with regards to it, which of them should be placing the Black Stone in its place, to the extent that evil almost occurred between them. So they decided that it would be the first one to enter from the door of the Masjid. So Rasool-Allah<sup>saww</sup> entered. ", "So when they came to him<sup>saww</sup>, he<sup>as</sup> ordered them with a cloth which he<sup>saww</sup> spread out, then placed the Stone in its middle, then the tribes grabbed with the sides of the cloth, so they raised it. Then he<sup>saww</sup> took it, so he<sup>saww</sup> placed it in its place. Thus, Allah<sup>azwj</sup> Specialised him<sup>saww</sup> with it’."]}}, {"index": 6725, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:9:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ وَ غَيْرُهُ بِأَسَانِيدَ مُخْتَلِفَةٍ رَفَعُوهُ قَالُوا إِنَّمَا هَدَمَتْ قُرَيْشٌ الْكَعْبَةَ لِأَنَّ السَّيْلَ كَانَ يَأْتِيهِمْ مِنْ أَعْلَى مَكَّةَ فَيَدْخُلُهَا فَانْصَدَعَتْ وَ سُرِقَ مِنَ الْكَعْبَةِ غَزَالٌ مِنْ ذَهَبٍ رِجْلَاهُ مِنْ جَوْهَرٍ وَ كَانَ حَائِطُهَا قَصِيراً وَ كَانَ ذَلِكَ قَبْلَ مَبْعَثِ النَّبِيِّ ( صلى الله عليه وآله ) بِثَلَاثِينَ سَنَةً فَأَرَادَتْ قُرَيْشٌ أَنْ يَهْدِمُوا الْكَعْبَةَ وَ يَبْنُوهَا وَ يَزِيدُوا فِي عَرْصَتِهَا ثُمَّ أَشْفَقُوا مِنْ ذَلِكَ وَ خَافُوا إِنْ وَضَعُوا فِيهَا الْمَعَاوِلَ أَنْ تَنْزِلَ عَلَيْهِمْ عُقُوبَةٌ ", "فَقَالَ الْوَلِيدُ بْنُ الْمُغِيرَةِ دَعُونِي أَبْدَأُ فَإِنْ كَانَ لِلَّهِ رِضًا لَمْ يُصِبْنِي شَيْ‏ءٌ وَ إِنْ كَانَ غَيْرَ ذَلِكَ كَفَفْنَا فَصَعِدَ عَلَى الْكَعْبَةِ وَ حَرَّكَ مِنْهُ حَجَراً فَخَرَجَتْ عَلَيْهِ حَيَّةٌ وَ انْكَسَفَتِ الشَّمْسُ فَلَمَّا رَأَوْا ذَلِكَ بَكَوْا وَ تَضَرَّعُوا وَ قَالُوا اللَّهُمَّ إِنَّا لَا نُرِيدُ إِلَّا الْإِصْلَاحَ فَغَابَتْ عَنْهُمُ الْحَيَّةُ فَهَدَمُوهُ وَ نَحَّوْا حِجَارَتَهُ حَوْلَهُ حَتَّى بَلَغُوا الْقَوَاعِدَ الَّتِي وَضَعَهَا إِبْرَاهِيمُ ( عليه السلام )", "فَلَمَّا أَرَادُوا أَنْ يَزِيدُوا فِي عَرْصَتِهِ وَ حَرَّكُوا الْقَوَاعِدَ الَّتِي وَضَعَهَا إِبْرَاهِيمُ ( عليه السلام ) أَصَابَتْهُمْ زَلْزَلَةٌ شَدِيدَةٌ وَ ظُلْمَةٌ فَكَفُّوا عَنْهُ وَ كَانَ بُنْيَانُ إِبْرَاهِيمَ الطُّوْلُ ثَلَاثُونَ ذِرَاعاً وَ الْعَرْضُ اثْنَانِ وَ عِشْرُونَ ذِرَاعاً وَ السَّمْكُ تِسْعَةُ أَذْرُعٍ فَقَالَتْ قُرَيْشٌ نَزِيدُ فِي سَمْكِهَا فَبَنَوْهَا فَلَمَّا بَلَغَ الْبِنَاءُ إِلَى مَوْضِعِ الْحَجَرِ الْأَسْوَدِ تَشَاجَرَتْ قُرَيْشٌ فِي وَضْعِهِ فَقَالَ كُلُّ قَبِيلَةٍ نَحْنُ أَوْلَى بِهِ نَحْنُ نَضَعُهُ", "فَلَمَّا كَثُرَ بَيْنَهُمْ تَرَاضَوْا بِقَضَاءِ مَنْ يَدْخُلُ مِنْ بَابِ بَنِي شَيْبَةَ فَطَلَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَقَالُوا هَذَا الْأَمِينُ قَدْ جَاءَ فَحَكَّمُوهُ فَبَسَطَ رِدَاءَهُ وَ قَالَ بَعْضُهُمْ كِسَاءٌ طَارُونِيٌّ كَانَ لَهُ وَ وَضَعَ الْحَجَرَ فِيهِ ثُمَّ قَالَ يَأْتِي مِنْ كُلِّ رَبْعٍ مِنْ قُرَيْشٍ رَجُلٌ فَكَانُوا عُتْبَةَ بْنَ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ وَ الْأَسْوَدَ بْنَ الْمُطَّلِبِ مِنْ بَنِي أَسَدِ بْنِ عَبْدِ الْعُزَّى وَ أَبُو حُذَيْفَةَ بْنَ الْمُغِيرَةِ مِنْ بَنِي مَخْزُومٍ وَ قَيْسَ بْنَ عَدِيٍّ مِنْ بَنِي سَهْمٍ فَرَفَعُوهُ وَ وَضَعَهُ النَّبِيُّ ( صلى الله عليه وآله ) فِي مَوْضِعِهِ ", "وَ قَدْ كَانَ بَعَثَ مَلِكُ الرُّومِ بِسَفِينَةٍ فِيهَا سُقُوفٌ وَ آلَاتٌ وَ خَشَبٌ وَ قَوْمٌ مِنَ الْفَعَلَةِ إِلَى الْحَبَشَةِ لِيُبْنَى لَهُ هُنَاكَ بِيعَةٌ فَطَرَحَتْهَا الرِّيحُ إِلَى سَاحِلِ الشَّرِيعَةِ فَبُطِحَتْ فَبَلَغَ قُرَيْشاً خَبَرُهَا فَخَرَجُوا إِلَى السَّاحِلِ فَوَجَدُوا مَا يَصْلُحُ لِلْكَعْبَةِ مِنْ خَشَبٍ وَ زِينَةٍ وَ غَيْرِ ذَلِكَ فَابْتَاعُوهُ وَ صَارُوا بِهِ إِلَى مَكَّةَ فَوَافَقَ ذَرْعُ ذَلِكَ الْخَشَبِ الْبِنَاءَ مَا خَلَا الْحِجْرَ فَلَمَّا بَنَوْهَا كَسَوْهَا الْوَصَائِدَ وَ هِيَ الْأَرْدِيَةُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, and someone else, by different chains, raising it, said, ", "‘But rather, the Qureysh demolished the Kaaba because the torrents used to come to them from the high grounds of Makkah, and it would enter it, so it would crack it; and a gazelle made of gold and its legs of jewels was stolen from the Kaaba, and its walls were short, and that was before the Sending of the Prophet<sup>saww</sup> by thirty years. So the Qureysh intended to demolish the Kaaba and re-build it, and increase in its floor area. Then they refrained from that and feared that if they were to place the digging tools in it, the Punishment might descend upon them.", "So Waleed Bin Al-Mugheira said, ‘Leave me to begin, so if there was Pleasure of Allah<sup>azwj</sup>, nothing would hit me, and if it was other than that, we shall refrain’. So he ascended upon the Kaaba and moved a stone from it, and a snake appeared to him, and the sun was eclipsed. So when they saw that, they wailed and supplicated, and said, ‘O Allah<sup>azwj</sup> We are not intending except for the repairing!’ So the snaked disappeared from them, and they demolished it, and placed the stones around it until they reached the foundations which (Prophet) Ibrahim<sup>as</sup> had placed. ", "So when they intended that they increase in its floor area and moved the foundation which (Prophet) Ibrahim<sup>as</sup> had placed it, an intense tremor hit them, and there was darkness. So they refrained from it. And the building of Ibrahim<sup>as</sup> was of the length of thirty cubits, and the width was of twenty two cubits, and the ceiling was at nine cubits. So the Qureysh said, ‘We should increase in its ceiling’. So they build it. So when the construction reached up to the place of the Black Stone, the Qureysh quarrelled with regards to placing it. So every tribe said, ‘We are the highest with it. We should be placing it’. ", "So when (the quarrelling) became a lot among them, they agreed with fulfilling it by the one who entered from the door of the Clan of Shayba (of the Masjid). So Rasool-Allah<sup>saww</sup> emerged, and they said, ‘This is the trustworthy one who has come’. So they made him<sup>as</sup> the judge, and he<sup>saww</sup> spread his<sup>saww</sup> cloak’, and one of them said, ‘This is a Taraouniyuun (a type of clothing) cloak which was his<sup>saww</sup>’. And he<sup>saww</sup> placed the Stone in it, then said: ‘There should come a man from every group of Qureysh’. So it was Utba Bin Rabi’e from the Clan of Abd Al-Shams, and Al-Aswad Bin Al Muttalib from the Clan of Asad Bin Abdul Uzza, and Abu Huzeyfa Bin Al-Mugheira from the Clan of Makhzoum, and Qays Bin Adayy from the Clan of Sahm. So they raised it, and the Prophet<sup>saww</sup> placed it in its place’.", "And a king of Roman had sent a ship wherein were tools, and roofing, and wood, and a group of builders, to Ethiopia in order to build a synagogue for him over there. So the wind cast it to the coast grounded. So the news of it reached the Qureysh, and they went out to the coast. So they found what was correct for the Kaaba, from the wood, and decorations, and other than that. So they bought these and went with it to Makkah. So that material was compatible with the construction except for the Stone. So when they built it, they clothed it with <span class=\"iTxt\">Al-Wasaaid</span>, and these were the fabrics’."]}}, {"index": 6726, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:9:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ دَاوُدَ بْنِ سِرْحَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) سَاهَمَ قُرَيْشاً فِي بِنَاءِ الْبَيْتِ فَصَارَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنْ بَابِ الْكَعْبَةِ إِلَى النِّصْفِ مَا بَيْنَ الرُّكْنِ الْيَمَانِيِّ إِلَى الْحَجَرِ الْأَسْوَدِ .", "وَ فِي رِوَايَةٍ أُخْرَى كَانَ لِبَنِي هَاشِمٍ مِنَ الْحَجَرِ الْأَسْوَدِ إِلَى الرُّكْنِ الشَّامِيِّ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Dawood Bin Sirhan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> was shared with the Qureysh in building the House (Kaaba). So there came to be for Rasool-Allah<sup>saww</sup>, from the door of the Kaaba up to the middle of what is between the Al-Yamany corner to the Black Stone’.", "And in another report, ‘It was for the Clan of Hashim<sup>as</sup>, from the Black Stone up to the Syrian corner’."]}}, {"index": 6727, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:9:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ وَ غَيْرُهُ رَفَعُوهُ قَالَ كَانَ فِي الْكَعْبَةِ غَزَالَانِ مِنْ ذَهَبٍ وَ خَمْسَةُ أَسْيَافٍ فَلَمَّا غَلَبَتْ خُزَاعَةُ جُرْهُمَ عَلَى الْحَرَمِ أَلْقَتْ جُرْهُمُ الْأَسْيَافَ وَ الْغَزَالَيْنِ فِي بِئْرِ زَمْزَمَ وَ أَلْقَوْا فِيهَا الْحِجَارَةَ وَ طَمُّوهَا وَ عَمَّوْا أَثَرَهَا فَلَمَّا غَلَبَ قُصَيٌّ عَلَى خُزَاعَةَ لَمْ يَعْرِفُوا مَوْضِعَ زَمْزَمَ وَ عَمِيَ عَلَيْهِمْ مَوْضِعُهَا ", "فَلَمَّا غَلَبَ عَبْدُ الْمُطَّلِبِ وَ كَانَ يُفْرَشُ لَهُ فِي فِنَاءِ الْكَعْبَةِ وَ لَمْ يَكُنْ يُفْرَشُ لِأَحَدٍ هُنَاكَ غَيْرَهُ فَبَيْنَمَا هُوَ نَائِمٌ فِي ظِلِّ الْكَعْبَةِ فَرَأَى فِي مَنَامِهِ أَتَاهُ آتٍ فَقَالَ لَهُ احْفِرْ بَرَّةَ قَالَ وَ مَا بَرَّةُ ثُمَّ أَتَاهُ فِي الْيَوْمِ الثَّانِي فَقَالَ احْفِرْ طِيبَةَ ثُمَّ أَتَاهُ فِي الْيَوْمِ الثَّالِثِ فَقَالَ احْفِرْ الْمَصُونَةَ قَالَ وَ مَا الْمَصُونَةُ ", "ثُمَّ أَتَاهُ فِي الْيَوْمِ الرَّابِعِ فَقَالَ احْفِرْ زَمْزَمَ لَا تَنْزَحْ وَ لَا تَذُمَّ تَسْقِي الْحَجِيجَ الْأَعْظَمَ عِنْدَ الْغُرَابِ الْأَعْصَمِ عِنْدَ قَرْيَةِ النَّمْلِ وَ كَانَ عِنْدَ زَمْزَمَ حَجَرٌ يَخْرُجُ مِنْهُ النَّمْلُ فَيَقَعُ عَلَيْهِ الْغُرَابُ الْأَعْصَمُ فِي كُلِّ يَوْمٍ يَلْتَقِطُ النَّمْلَ فَلَمَّا رَأَى عَبْدُ الْمُطَّلِبِ هَذَا عَرَفَ مَوْضِعَ زَمْزَمَ", "فَقَالَ لِقُرَيْشٍ إِنِّي أُمِرْتُ فِي أَرْبَعِ لَيَالٍ فِي حَفْرِ زَمْزَمَ وَ هِيَ مَأْثُرَتُنَا وَ عِزُّنَا فَهَلُمُّوا نَحْفِرْهَا فَلَمْ يُجِيبُوهُ إِلَى ذَلِكَ فَأَقْبَلَ يَحْفِرُهَا هُوَ بِنَفْسِهِ وَ كَانَ لَهُ ابْنٌ وَاحِدٌ وَ هُوَ الْحَارِثُ وَ كَانَ يُعِينُهُ عَلَى الْحَفْرِ", "فَلَمَّا صَعُبَ ذَلِكَ عَلَيْهِ تَقَدَّمَ إِلَى بَابِ الْكَعْبَةِ ثُمَّ رَفَعَ يَدَيْهِ وَ دَعَا اللَّهَ عَزَّ وَ جَلَّ وَ نَذَرَ لَهُ إِنْ رَزَقَهُ عَشْرَ بَنِينَ أَنْ يَنْحَرَ أَحَبَّهُمْ إِلَيْهِ تَقَرُّباً إِلَى اللَّهِ عَزَّ وَ جَلَّ", "فَلَمَّا حَفَرَ وَ بَلَغَ الطَّوِيَّ طَوِيَّ إِسْمَاعِيلَ وَ عَلِمَ أَنَّهُ قَدْ وَقَعَ عَلَى الْمَاءِ كَبَّرَ وَ كَبَّرَتْ قُرَيْشٌ وَ قَالُوا يَا أَبَا الْحَارِثِ هَذِهِ مَأْثُرَتُنَا وَ لَنَا فِيهَا نَصِيبٌ قَالَ لَهُمْ لَمْ تُعِينُونِي عَلَى حَفْرِهَا هِيَ لِي وَ لِوُلْدِي إِلَى آخِرِ الْأَبَدِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, and someone else, raising it, ", "‘He<sup>asws</sup> said: ‘In the Kaaba there used to be two gazelle of gold and five swords. So when Khuza’a overcame Jurhum at the Sanctuary, Jurhum threw the swords and the two gazelles into the well of Zamzam, and threw the rocks into it, and filled it up and deleted its traces. So when Qusayy overcame upon Khuza’a, he did not know the place of Zamzam, and its place was unknown unto them.", "So when Abdul Muttalib<sup>as</sup> overcame, and they had furnishing for him<sup>as</sup> in the courtyard of the Kaaba, and that did not happen for anyone over there apart from him<sup>as</sup>. So while he<sup>as</sup> was sleeping in the shade of the Kaaba, he<sup>as</sup> saw in his<sup>as</sup> dream, a comer had come saying to him<sup>as</sup>: ‘Dig <span class=\"iTxt\">Barra</span>’. He<sup>as</sup> said: ‘And what is <span class=\"iTxt\">Barra</span>?’ Then he came to him<sup>as</sup> during the second day, so he said, ‘Dig <span class=\"iTxt\">Tayba</span>’. Then he came to him<sup>as</sup> during the third day, so he said, ‘Dig <span class=\"iTxt\">Al-Masouna</span>’. He<sup>as</sup> said: ‘And what is <span class=\"iTxt\">Al-Masouna</span>?’ ", "Then he came to him<sup>as</sup> during the fourth day, so he said: ‘Dig Zamzam, neither drying up nor condemned, quenching the great Pilgrims in the presence of the white-footed crows, by the colony of the ants’. And there used to be a rock by Zamzam, from which the ants used to come out from. So the white-footed crows used to fall upon it every day to catch the ants. So when Abdul Muttalib<sup>as</sup> saw this, he<sup>as</sup> recognised the place of Zamzam.", "So he<sup>as</sup> said to Qureysh: ‘I<sup>as</sup> have been Commanded during four nights regarding digging of Zamzam, and it is our preference and our honour, so come you all, let us dig it’. But they did not answer him<sup>as</sup> to that. So he<sup>as</sup> went to dig it by himself<sup>as</sup>, and he<sup>as</sup> had only one son for him<sup>as</sup>, and he is Al-Haris, and he used to assist him<sup>as</sup> upon the digging. ", "So when that was difficult upon him<sup>as</sup>, he<sup>as</sup> went to the door of the Kaaba, then raised his<sup>as</sup> hand, and supplicated to Allah<sup>azwj</sup> Mighty and Majestic and vowed to Him<sup>azwj</sup> that if He<sup>azwj</sup> was to Grace him<sup>as</sup> with ten sons, he<sup>as</sup> would sacrifice the most beloved of them to him<sup>as</sup>, as an offering to Allah<sup>azwj</sup> Mighty and Majestic. ", "So when he<sup>as</sup> dug and reached the walls of the well built by Ismail<sup>as</sup> and knew that he<sup>as</sup> had come across the water, exclaimed <span class=\"iTxt\">Takbeer</span>, and the Qureysh exclaimed <span class=\"iTxt\">Takbeer</span> and they said, ‘O Abu Al-Haris! This here is our preference and there is a share for us in it’. He<sup>as</sup> said to them: ‘You did not assist me<sup>as</sup> upon digging it. It is for me<sup>as</sup> and for my<sup>as</sup> children up to the end, forever’."]}}, {"index": 6728, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:9:7", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ قَالَ سَمِعْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) يَقُولُ لَمَّا احْتَفَرَ عَبْدُ الْمُطَّلِبِ زَمْزَمَ وَ انْتَهَى إِلَى قَعْرِهَا خَرَجَتْ عَلَيْهِ مِنْ إِحْدَى جَوَانِبِ الْبِئْرِ رَائِحَةٌ مُنْتِنَةٌ أَفْظَعَتْهُ فَأَبَى أَنْ يَنْثَنِيَ وَ خَرَجَ ابْنُهُ الْحَارِثُ عَنْهُ ثُمَّ حَفَرَ حَتَّى أَمْعَنَ فَوَجَدَ فِي قَعْرِهَا عَيْناً تَخْرُجُ عَلَيْهِ بِرَائِحَةِ الْمِسْكِ", "ثُمَّ احْتَفَرَ فَلَمْ يَحْفِرْ إِلَّا ذِرَاعاً حَتَّى تَجَلَّاهُ النَّوْمُ فَرَأَى رَجُلًا طَوِيلَ الْبَاعِ حَسَنَ الشَّعْرِ جَمِيلَ الْوَجْهِ جَيِّدَ الثَّوْبِ طَيِّبَ الرَّائِحَةِ وَ هُوَ يَقُولُ احْفِرْ تَغْنَمْ وَ جِدَّ تَسْلَمْ وَ لَا تَدَّخِرْهَا لِلْمَقْسَمِ الْأَسْيَافُ لِغَيْرِكَ وَ الْبِئْرُ لَكَ أَنْتَ أَعْظَمُ الْعَرَبِ قَدْراً وَ مِنْكَ يَخْرُجُ نَبِيُّهَا وَ وَلِيُّهَا وَ الْأَسْبَاطُ النُّجَبَاءُ الْحُكَمَاءُ الْعُلَمَاءُ الْبُصَرَاءُ وَ السُّيُوفُ لَهُمْ", "وَ لَيْسُوا الْيَوْمَ مِنْكَ وَ لَا لَكَ وَ لَكِنْ فِي الْقَرْنِ الثَّانِي مِنْكَ بِهِمْ يُنِيرُ اللَّهُ الْأَرْضَ وَ يُخْرِجُ الشَّيَاطِينَ مِنْ أَقْطَارِهَا وَ يُذِلُّهَا فِي عِزِّهَا وَ يُهْلِكُهُا بَعْدَ قُوَّتِهَا وَ يُذِلُّ الْأَوْثَانَ وَ يَقْتُلُ عُبَّادَهَا حَيْثُ كَانُوا ثُمَّ يَبْقَى بَعْدَهُ نَسْلٌ مِنْ نَسْلِكَ ", "هُوَ أَخُوهُ وَ وَزِيرُهُ وَ دُونَهُ فِي السِّنِّ وَ قَدْ كَانَ الْقَادِرُ عَلَى الْأَوْثَانِ لَا يَعْصِيهِ حَرْفاً وَ لَا يَكْتُمُهُ شَيْئاً وَ يُشَاوِرُهُ فِي كُلِّ أَمْرٍ هَجَمَ عَلَيْهِ", "وَ اسْتَعْيَا عَنْهَا عَبْدُ الْمُطَّلِبِ فَوَجَدَ ثَلَاثَةَ عَشَرَ سَيْفاً مُسْنَدَةً إِلَى جَنْبِهِ فَأَخَذَهَا وَ أَرَادَ أَنْ يَبُثَّ فَقَالَ وَ كَيْفَ وَ لَمْ أَبْلُغِ الْمَاءَ ثُمَّ حَفَرَ فَلَمْ يَحْفِرْ شِبْراً حَتَّى بَدَا لَهُ قَرْنُ الْغَزَالِ وَ رَأْسُهُ فَاسْتَخْرَجَهُ وَ فِيهِ طُبِعَ لَا إِلَهَ إِلَّا اللَّهُ مُحَمَّدٌ رَسُولُ اللَّهِ عَلِيٌّ وَلِيُّ اللَّهِ فُلَانٌ خَلِيفَةُ اللَّهِ", "فَسَأَلْتُهُ فَقُلْتُ فُلَانٌ مَتَى كَانَ قَبْلَهُ أَوْ بَعْدَهُ قَالَ لَمْ يَجِئْ بَعْدُ وَ لَا جَاءَ شَيْ‏ءٌ مِنْ أَشْرَاطِهِ", "فَخَرَجَ عَبْدُ الْمُطَّلِبِ وَ قَدِ اسْتَخْرَجَ الْمَاءَ وَ أَدْرَكَ وَ هُوَ يَصْعَدُ فَإِذَا أَسْوَدُ لَهُ ذَنَبٌ طَوِيلٌ يَسْبِقُهُ بِدَاراً إِلَى فَوْقُ فَضَرَبَهُ فَقَطَعَ أَكْثَرَ ذَنَبِهِ ثُمَّ طَلَبَهُ فَفَاتَهُ وَ فُلَانٌ قَاتِلُهُ إِنْ شَاءَ اللَّهُ ", "وَ مِنْ رَأْيِ عَبْدِ الْمُطَّلِبِ أَنْ يُبْطِلَ الرُّؤْيَا الَّتِي رَآهَا فِي الْبِئْرِ وَ يَضْرِبَ السُّيُوفَ صَفَائِحَ الْبَيْتِ فَأَتَاهُ اللَّهُ بِالنَّوْمِ فَغَشِيَهُ وَ هُوَ فِي حِجْرِ الْكَعْبَةِ فَرَأَى ذَلِكَ الرَّجُلَ بِعَيْنِهِ وَ هُوَ يَقُولُ يَا شَيْبَةَ الْحَمْدِ احْمَدْ رَبَّكَ فَإِنَّهُ سَيَجْعَلُكَ لِسَانَ الْأَرْضِ وَ يَتْبَعُكَ قُرَيْشٌ خَوْفاً وَ رَهْبَةً وَ طَمَعاً ضَعِ السُّيُوفَ فِي مَوَاضِعِهَا", "وَ اسْتَيْقَظَ عَبْدُ الْمُطَّلِبِ فَأَجَابَهُ أَنَّهُ يَأْتِينِي فِي النَّوْمِ فَإِنْ يَكُنْ مِنْ رَبِّي فَهُوَ أَحَبُّ إِلَيَّ وَ إِنْ يَكُنْ مِنْ شَيْطَانٍ فَأَظُنُّهُ مَقْطُوعَ الذَّنَبِ فَلَمْ يَرَ شَيْئاً وَ لَمْ يَسْمَعْ كَلَاماً فَلَمَّا أَنْ كَانَ اللَّيْلُ أَتَاهُ فِي مَنَامِهِ بِعِدَّةٍ مِنْ رِجَالٍ وَ صِبْيَانٍ فَقَالُوا لَهُ نَحْنُ أَتْبَاعُ وَلَدِكَ وَ نَحْنُ مِنْ سُكَّانِ السَّمَاءِ السَّادِسَةِ السُّيُوفُ لَيْسَتْ لَكَ تَزَوَّجْ فِي مَخْزُومٍ تَقْوَ وَ اضْرِبْ بَعْدُ فِي بُطُونِ الْعَرَبِ", "فَإِنْ لَمْ يَكُنْ مَعَكَ مَالٌ فَلَكَ حَسَبٌ فَادْفَعْ هَذِهِ الثَّلَاثَةَ عَشَرَ سَيْفاً إِلَى وَلَدِ الْمَخْزُومِيَّةِ وَ لَا يُبَانُ لَكَ أَكْثَرَ مِنْ هَذَا وَ سَيْفٌ لَكَ مِنْهَا وَاحِدٌ سَيَقَعُ مِنْ يَدِكَ فَلَا تَجِدُ لَهُ أَثَراً إِلَّا أَنْ يَسْتَجِنَّهُ جَبَلُ كَذَا وَ كَذَا فَيَكُونُ مِنْ أَشْرَاطِ قَائِمِ آلِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَ عَلَيْهِمْ ", "فَانْتَبَهَ عَبْدُ الْمُطَّلِبِ وَ انْطَلَقَ وَ السُّيُوفُ عَلَى رَقَبَتِهِ فَأَتَى نَاحِيَةً مِنْ نَوَاحِي مَكَّةَ فَفَقَدَ مِنْهَا سَيْفاً كَانَ أَرَقَّهَا عِنْدَهُ فَيَظْهَرُ مِنْ ثَمَّ ثُمَّ دَخَلَ مُعْتَمِراً وَ طَافَ بِهَا عَلَى رَقَبَتِهِ وَ الْغَزَالَيْنِ أَحَداً وَ عِشْرِينَ طَوَافاً وَ قُرَيْشٌ تَنْظُرُ إِلَيْهِ وَ هُوَ يَقُولُ اللَّهُمَّ صَدِّقْ وَعْدَكَ فَأَثْبِتْ لِي قَوْلِي وَ انْشُرْ ذِكْرِي وَ شُدَّ عَضُدِي", "وَ كَانَ هَذَا تَرْدَادَ كَلَامِهِ وَ مَا طَافَ حَوْلَ الْبَيْتِ بَعْدَ رُؤْيَاهُ فِي الْبِئْرِ بِبَيْتِ شِعْرٍ حَتَّى مَاتَ وَ لَكِنْ قَدِ ارْتَجَزَ عَلَى بَنِيهِ يَوْمَ أَرَادَ نَحْرَ عَبْدِ اللَّهِ فَدَفَعَ الْأَسْيَافَ جَمِيعَهَا إِلَى بَنِي الْمَخْزُومِيَّةِ إِلَى الزُّبَيْرِ وَ إِلَى أَبِي طَالِبٍ وَ إِلَى عَبْدِ اللَّهِ فَصَارَ لِأَبِي طَالِبٍ مِنْ ذَلِكَ أَرْبَعَةُ أَسْيَافٍ سَيْفٌ لِأَبِي طَالِبٍ وَ سَيْفٌ لِعَلِيٍّ وَ سَيْفٌ لِجَعْفَرٍ وَ سَيْفٌ لِطَالِبٍ وَ كَانَ لِلزُّبَيْرِ سَيْفَانِ وَ كَانَ لِعَبْدِ اللَّهِ سَيْفَانِ", "ثُمَّ عَادَتْ فَصَارَتْ لِعَلِيٍّ الْأَرْبَعَةُ الْبَاقِيَةُ اثْنَيْنِ مِنْ فَاطِمَةَ وَاِثْنَيْنِ مِنْ أَوْلَادِهَا فَطَاحَ سَيْفُ جَعْفَرٍ يَوْمَ أُصِيبَ فَلَمْ يُدْرَ فِي يَدِ مَنْ وَقَعَ حَتَّى السَّاعَةِ وَ نَحْنُ نَقُولُ لَا يَقَعُ سَيْفٌ مِنْ أَسْيَافِنَا فِي يَدِ غَيْرِنَا إِلَّا رَجُلٌ يُعِينُ بِهِ مَعَنَا إِلَّا صَارَ فَحْماً", "قَالَ وَ إِنَّ مِنْهَا لَوَاحِداً فِي نَاحِيَةٍ يَخْرُجُ كَمَا تَخْرُجُ الْحَيَّةُ فَيَبِينُ مِنْهُ ذِرَاعٌ وَ مَا يُشْبِهُهُ فَتَبْرُقُ لَهُ الْأَرْضُ مِرَاراً ثُمَّ يَغِيبُ فَإِذَا كَانَ اللَّيْلُ فَعَلَ مِثْلَ ذَلِكَ فَهَذَا دَأْبُهُ حَتَّى يَجِي‏ءَ صَاحِبُهُ وَ لَوْ شِئْتُ أَنْ أُسَمِّيَ مَكَانَهُ لَسَمَّيْتُهُ وَ لَكِنْ أَخَافُ عَلَيْكُمْ مِنْ أَنْ أُسَمِّيَهُ فَتُسَمُّوهُ فَيُنْسَبَ إِلَى غَيْرِ مَا هُوَ عَلَيْهِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid who said, ", "‘I heard Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) saying: ‘When Abudl Muttalib<sup>as</sup> dug Zamzam and ended up to its bottom, there came out to him<sup>as</sup>, from one of the sides of the well, a stinking odour which frightened him<sup>as</sup>, but he<sup>as</sup> refused to give up, and his<sup>as</sup> son Al-Haris came out (from the well). Then he<sup>as</sup> persistently, and he<sup>as</sup> found at the bottom, a spring which came out to him<sup>as</sup> with the aroma of musk. ", "Then he<sup>as</sup> dug, so he<sup>as</sup> had not dug except for one cubit until sleep overcame him<sup>as</sup>. So he<sup>as</sup> saw (in his<sup>as</sup> dream), a man of long hands, beautiful hair, handsome face, excellent clothes, aromatic perfume, and he was saying: ‘Dig, you<sup>as</sup> will achieve, and strive, you<sup>asws</sup> will receive, and do not hoard it for the distribution. The swords are for others and the well is for you<sup>as</sup>. You<sup>as</sup> are the greatest of the Arabs in worthiness, and from you<sup>as</sup> would be coming out, its Prophet<sup>saww</sup>, and its Guardian<sup>asws</sup>, and the excellent clan, the wise ones, the scholars, and visionaries; and the swords are for them.", "And today it is neither from you<sup>as</sup> nor for you<sup>as</sup>, but in the second century from you<sup>as</sup>, by them, Allah<sup>azwj</sup> will Enlighten the land and Exit the devils from its horizons and Humiliate them during their honour, and destroy them after their strength, and Humiliate the idols, and kill their worshippers wherever they may be. Then there would remain after it, a descendant from your<sup>as</sup> descendants. ", "He<sup>asws</sup> would be his<sup>saww</sup> brother, and his<sup>saww</sup> Vizier, and less than him<sup>saww</sup> in age, and he<sup>asws</sup> would be able upon the idols, not disobeying him<sup>saww</sup> by one letter, nor concealing anything, and he<sup>saww</sup> would be consulting him<sup>asws</sup> in every matter which would come up against him<sup>saww</sup>.", "And Abdul Muttalib<sup>as</sup> was exhausted from it, so he<sup>as</sup> found thirteen swords leaning to the side of it. So he<sup>as</sup> took these and intended broadcast it, so he<sup>as</sup> said (to himself<sup>as</sup>: ‘And how can I<sup>as</sup>, and I<sup>as</sup> have not reached the water yet?’ Then he<sup>as</sup> dug, so he<sup>as</sup> had not dug a palm’s width until a horn of a gazelle and its head was see. So he<sup>as</sup> brought it out and in it was inscribed: ‘There is no god except for Allah<sup>azwj</sup>, Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>, Ali<sup>asws</sup> is a Guardian<sup>asws</sup> from Allah<sup>azwj</sup>, So and so is the Caliph of Allah<sup>azwj</sup>’.", "So I (the narrator) asked him<sup>asws</sup>, ‘So and so, when would he be, before him<sup>asws</sup> or after him<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘He<sup>asws</sup> has yet to come after him<sup>asws</sup>, nor has anything from his<sup>asws</sup> conditions come yet’.", "So Abdul Muttalib<sup>as</sup> came out, and the water had emerged, and he<sup>as</sup> realized, and he<sup>as</sup> was ascending and there was a black snake which had a long tail for it, preceding him<sup>as</sup> quickly to the top. So he<sup>as</sup> struck it and cut off most of its tail. Then he<sup>as</sup> sought it but it was lost, and so and so would kill it, Allah<sup>azwj</sup> Willing.", "And it was from the opinions of Abdul Muttalib<sup>as</sup> invalidating the dream which he<sup>as</sup> saw regarding the well, and he<sup>as</sup> kept the swords in sheets in the Kaaba. So Allah<sup>azwj</sup> Granted him the sleep, and he<sup>as</sup> was in a chamber of the Kaaba, so he<sup>as</sup> saw that very man and he was saying: ‘O praise-worthy one of (the Clan of) Shayba! Praise your<sup>saww</sup> Lord<sup>azwj</sup>, for He<sup>azwj</sup> would be Making you<sup>as</sup> to be a speaker of the earth, and the Qureysh would be following you<sup>as</sup> out of fear, and panic, and greed. Place the swords in their places’.", "And Abdul Muttalib<sup>as</sup> woke up, so it astounded him<sup>as</sup>: ‘He came to me in the sleep. So if he is from my<sup>as</sup> Lord<sup>azwj</sup>, then he<sup>as</sup> is beloved to me<sup>as</sup>; and if he happens to be from Satan<sup>la</sup>, then I<sup>as</sup> think it would be a tail-less one’. But, he<sup>as</sup> neither saw anything, nor did he<sup>as</sup> hear a speech. So when it was the night, he came to him<sup>as</sup> in his<sup>as</sup> dream with a number of men and children. So they said to him<sup>as</sup>: ‘We are the followers of your<sup>as</sup> children, and we are from the dwellers of the sixth sky. The swords are not for you. Get married among the (Clan of) Makhzoum, strengthen yourself<sup>as</sup> and trade afterwards among the middle of the Arabs.", "So, if there does not happen to be wealth for you<sup>as</sup>, then for you<sup>asws</sup> is the nobility. Therefore hand over these thirteen swords to a child of (the Clan of) Makhzoum, and there would not appear to you<sup>as</sup> more than this; and one sword from it is for you<sup>as</sup>, for it would fall from your<sup>as</sup> hand. So you<sup>as</sup> will not find any trace of it except that such and such a mountain would be shielding it. It would therefore become from the condition of Qaim<sup>asws</sup> of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. ", "So Abdul Muttalib<sup>as</sup> woke up and went, and the swords were upon his<sup>as</sup> shoulder, and he<sup>as</sup> came to an area around Makkah. So a sword was lost from him<sup>asws</sup>. It was the most finest of these with him<sup>as</sup>. Thus, it would be appearing from there. Then he<sup>as</sup> entered in readiness for Umra and circumambulated with it. Upon his<sup>as</sup> shoulders were the swords and the two gazelles, performing twenty one circumambulations, and the Qureysh were looking on at him<sup>as</sup>, and he<sup>as</sup> was saying: ‘O Allah<sup>azwj</sup>! Make Your<sup>azwj</sup> Promise come True, and Affirm my<sup>as</sup> words for me<sup>as</sup>, and Publicise my<sup>as</sup> mention, and Strengthen my<sup>as</sup> arms’.", "And this was his<sup>as</sup> oft-repeated speech, and he<sup>as</sup> did not circumambulate the House (Kaaba) after his<sup>as</sup> dream regarding the well, with the quatrains of poems until he<sup>as</sup> died. But, he<sup>as</sup> recited a poem upon his<sup>as</sup> son<sup>as</sup> on the day he<sup>as</sup> wanted to sacrifice Abdullah<sup>as</sup>. So he<sup>as</sup> handed over the swords, all of them, to the Clan of Makhzoum – to Al-Zubeyr, and to Abu Talib<sup>as</sup>, and to Abdullah<sup>as</sup>. So there came to be four swords for Abu Talib<sup>as</sup> from that – one sword being for Abu Talib<sup>as</sup>, and a sword for Ali<sup>asws</sup>, and a sword for Ja’far<sup>as</sup> and one sword for Talib. And there were two swords for Al-Zubeyr, and there were two swords for Abdullah<sup>as</sup>.", "Then he<sup>as</sup> repeated, so there came to be four for Ali<sup>asws</sup>, the remainder being two for Fatima<sup>asws</sup>, and two for her<sup>asws</sup> children<sup>asws</sup>. So the sword of Ja’far<sup>as</sup> fell on the day he<sup>as</sup> was injured, and it is no known in whose hand it felt until today. And we<sup>asws</sup> are saying: ‘A sword from our<sup>asws</sup> swords will not fall to be in the hands of others except for a man who would assist us<sup>asws</sup> with it, along with us<sup>asws</sup>, but it would become rock/powder’.", "He<sup>asws</sup> said: ‘From these (swords) is one in a (particular) location. It comes out like the coming out of the snake, so an arm and what resembles it appears from it, so the earth shines for it time and again, then it disappears. So when it is night time, it does similar to that. So these are its etiquettes until its master<sup>asws</sup> revives it. And had I<sup>asws</sup> so desired I<sup>asws</sup> would name its place, I<sup>asws</sup> would name him<sup>asws</sup>, but I<sup>asws</sup> fear upon you all that if I<sup>asws</sup> were to name him<sup>asws</sup>, so you (in turn) would reveal his<sup>asws</sup> name, and it would end up being linked to other than to him<sup>asws</sup>’."]}}, {"index": 6729, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:9:8", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي عَلِيٍّ صَاحِبِ الْأَنْمَاطِ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ لَمَّا هَدَمَ الْحَجَّاجُ الْكَعْبَةَ فَرَّقَ النَّاسُ تُرَابَهَا فَلَمَّا صَارُوا إِلَى بِنَائِهَا فَأَرَادُوا أَنْ يَبْنُوهَا خَرَجَتْ عَلَيْهِمْ حَيَّةٌ فَمَنَعَتِ النَّاسَ الْبِنَاءَ حَتَّى هَرَبُوا فَأَتَوُا الْحَجَّاجَ فَأَخْبَرُوهُ فَخَافَ أَنْ يَكُونَ قَدْ مَنَعَ بِنَاءَهَا فَصَعِدَ الْمِنْبَرَ ثُمَّ نَشَدَ النَّاسَ وَ قَالَ أَنْشُدُ اللَّهَ عَبْداً عِنْدَهُ مِمَّا ابْتُلِينَا بِهِ عِلْمٌ لَمَّا أَخْبَرَنَا بِهِ", "قَالَ فَقَامَ إِلَيْهِ شَيْخٌ فَقَالَ إِنْ يَكُنْ عِنْدَ أَحَدٍ عِلْمٌ فَعِنْدَ رَجُلٍ رَأَيْتُهُ جَاءَ إِلَى الْكَعْبَةِ فَأَخَذَ مِقْدَارَهَا ثُمَّ مَضَى فَقَالَ الْحَجَّاجُ مَنْ هُوَ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) فَقَالَ مَعْدِنُ ذَلِكَ فَبَعَثَ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ صَلَوَاتُ اللَّهِ عَلَيْهِمَا فَأَتَاهُ فَأَخْبَرَهُ مَا كَانَ مِنْ مَنْعِ اللَّهِ إِيَّاهُ الْبِنَاءَ", "فَقَالَ لَهُ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَا حَجَّاجُ عَمَدْتَ إِلَى بِنَاءِ إِبْرَاهِيمَ وَ إِسْمَاعِيلَ فَأَلْقَيْتَهُ فِي الطَّرِيقِ وَ انْتَهَبْتَهُ كَأَنَّكَ تَرَى أَنَّهُ تُرَاثٌ لَكَ اصْعَدِ الْمِنْبَرَ وَ انْشُدِ النَّاسَ أَنْ لَا يَبْقَى أَحَدٌ مِنْهُمْ أَخَذَ مِنْهُ شَيْئاً إِلَّا رَدَّهُ", "قَالَ فَفَعَلَ فَأَنْشَدَ النَّاسَ أَنْ لَا يَبْقَى مِنْهُمْ أَحَدٌ عِنْدَهُ شَيْ‏ءٌ إِلَّا رَدَّهُ قَالَ فَرَدُّوهُ فَلَمَّا رَأَى جَمْعَ التُّرَابِ أَتَى عَلِيُّ بْنُ الْحُسَيْنِ صَلَوَاتُ اللَّهِ عَلَيْهِمَا فَوَضَعَ الْأَسَاسَ وَ أَمَرَهُمْ أَنْ يَحْفِرُوا قَالَ فَتَغَيَّبَتْ عَنْهُمُ الْحَيَّةُ وَ حَفَرُوا حَتَّى انْتَهَوْا إِلَى مَوْضِعِ الْقَوَاعِدِ قَالَ لَهُمْ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) تَنَحَّوْا فَتَنَحَّوْا", "فَدَنَا مِنْهَا فَغَطَّاهَا بِثَوْبِهِ ثُمَّ بَكَى ثُمَّ غَطَّاهَا بِالتُّرَابِ بِيَدِ نَفْسِهِ ثُمَّ دَعَا الْفَعَلَةَ فَقَالَ ضَعُوا بِنَاءَكُمْ فَوَضَعُوا الْبِنَاءَ فَلَمَّا ارْتَفَعَتْ حِيطَانُهَا أَمَرَ بِالتُّرَابِ فَقُلِّبَ فَأُلْقِيَ فِي جَوْفِهِ فَلِذَلِكَ صَارَ الْبَيْتُ مُرْتَفِعاً يُصْعَدُ إِلَيْهِ بِالدَّرَجِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Abu Ali Sahib Al Anmaat, from Aban Bin Taghlub who said, ", "‘When Al-Hajjaj demolished the Kaaba, the people scattered its soil. So when they came to building it, so they intended to (commence) its building, a snake came out to them, and it prevented the people from the construction until they fled. So they came over to Al-Hajjaj and informed him. So he feared that it was himself who had been prevented from building it. So he ascended the Pulpit, then adjured the people, and said, ‘I adjure with Allah<sup>azwj</sup> if any man has knowledge from what we have been afflicted with, that he should inform us with it’. ", "He<sup>asws</sup> said: ‘So and old man stood up to him and said, ‘If there happens to be knowledge with any one, so it would be with a man whom I saw come to the Kaaba, so he took something of it, then he went away’. So Al-Hajjaj said, ‘Who is he?’ He said, ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>’. So he said, ‘That is a mine’. So he sent for Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and he<sup>asws</sup> came over to him. So he informed him<sup>asws</sup> of what was from the prevention of Allah<sup>azwj</sup> from the construction.", "So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to him: ‘O Hajjaj! You deliberated to a construction of Ibrahim<sup>as</sup> and Ismail<sup>as</sup>, so you threw it in the street, and seized it as if you saw it as being an inheritance for you. Ascend the Pulpit and adjure the people that there should not remain anyone from them who had taken anything from it, except that he must return it’.", "He<sup>asws</sup> said: ‘So he did that and adjured the people that there should not remain anyone from them with whom there is something, except that he must return it. So they returned it. So when he<sup>asws</sup> saw the gathering of the soil, Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> came over, and he<sup>asws</sup> placed the base and ordered them that they should be digging. So the snake disappeared from them, and they dig until they ended up to the place of the foundation. Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to them: ‘Move aside!’ So they moved aside.", "So he<sup>asws</sup> approached it and covered it with his<sup>asws</sup> clothing, then wept. Then he<sup>asws</sup> covered it with the soil by his<sup>asws</sup> hand himself<sup>asws</sup>. Then he<sup>asws</sup> called the builders, so he<sup>asws</sup> said: ‘Place your building’. So they placed their building. So when its walls were raised, he<sup>asws</sup> ordered with the soil. So it was transferred and cast into its middle. Thus, it is due to that, the House (Kaaba) is higher, (requiring) the ladder to ascend it’."]}}]}, "index": "al-kafi:4:3:9", "kind": "verse_list"}