{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 90"
        },
        "path": "/books/al-kafi:4:3:90",
        "titles": {
          "ar": "بَابُ الظِّلَالِ لِلْمُحْرِمِ",
          "en": "Chapter 90 – The shade for the one in Ihraam"
        }
      }
    ],
    "index": 1033,
    "local_index": 90,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 91"
        },
        "path": "/books/al-kafi:4:3:91",
        "titles": {
          "ar": "بَابُ أَنَّ الْمُحْرِمَ لَا يَرْتَمِسُ فِي الْمَاءِ",
          "en": "Chapter 91 – The one in Ihraam cannot immerse himself into the water"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 89"
        },
        "path": "/books/al-kafi:4:3:89",
        "titles": {
          "ar": "بَابُ الْمُحْرِمِ يُغَطِّي رَأْسَهُ أَوْ وَجْهَهُ مُتَعَمِّداً أَوْ نَاسِياً",
          "en": "Chapter 89 – The one in Ihraam covers his head or his face deliberately, or out of forgetfulness"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:90",
    "titles": {
      "ar": "بَابُ الظِّلَالِ لِلْمُحْرِمِ",
      "en": "Chapter 90 – The shade for the one in Ihraam"
    },
    "verse_count": 15,
    "verse_start_index": 7216,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/301)"
        ],
        "index": 7217,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1350",
              "text": "جَعْفَرِ بْنِ الْمُثَنَّى الْخَطِيبِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/481",
              "text": "مُحَمَّدِ بْنِ الْفُضَيْلِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3680",
              "text": "بِشْرِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ الْمُثَنَّى الْخَطِيبِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ وَ بِشْرِ بْنِ إِسْمَاعِيلَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:1",
        "text": [
          " قَالَ لِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ أَ لَا أَسُرُّكَ يَا ابْنَ مُثَنًّى قَالَ قُلْتُ بَلَى وَ قُمْتُ إِلَيْهِ قَالَ دَخَلَ هَذَا الْفَاسِقُ آنِفاً فَجَلَسَ قُبَالَةَ أَبِي الْحَسَنِ ( عليه السلام ) ثُمَّ أَقْبَلَ عَلَيْهِ فَقَالَ لَهُ يَا أَبَا الْحَسَنِ مَا تَقُولُ فِي الْمُحْرِمِ أَ يَسْتَظِلُّ عَلَى الْمَحْمِلِ فَقَالَ لَهُ لَا قَالَ فَيَسْتَظِلُّ فِي الْخِبَاءِ فَقَالَ لَهُ نَعَمْ ",
          "فَأَعَادَ عَلَيْهِ الْقَوْلَ شِبْهَ الْمُسْتَهْزِئِ يَضْحَكُ فَقَالَ يَا أَبَا الْحَسَنِ فَمَا فَرْقُ بَيْنِ هَذَا وَ هَذَا فَقَالَ يَا أَبَا يُوسُفَ إِنَّ الدِّينَ لَيْسَ بِقِيَاسٍ كَقِيَاسِكُمْ أَنْتُمْ تَلْعَبُونَ بِالدِّينِ إِنَّا صَنَعْنَا كَمَا صَنَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ قُلْنَا كَمَا قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَرْكَبُ رَاحِلَتَهُ فَلَا يَسْتَظِلُّ عَلَيْهَا وَ تُؤْذِيهِ الشَّمْسُ فَيَسْتُرُ جَسَدَهُ بَعْضَهُ بِبَعْضٍ وَ رُبَّمَا سَتَرَ وَجْهَهُ بِيَدِهِ وَ إِذَا نَزَلَ اسْتَظَلَّ بِالْخِبَاءِ وَ فَيْ‏ءِ الْبَيْتِ وَ فَيْ‏ءِ الْجِدَارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ja’far Bin Al Musanna Al Khattab, from Muhammad Bin al Fuzayl, and Bishr Bin Ismail who said, ",
            "‘Muhammad Bin Ismail said to me, ‘Shall I cheer you up O son of Musanna?’ I said, ‘Yes’, and I arose to him. This indecent man entered just nowhere, so he sat nearby Abu Al-Hassan<sup>asws</sup>. Then he turned facing him<sup>asws</sup> and he said to him<sup>asws</sup>, ‘O Abu Al-Hassan<sup>asws</sup>! What are you<sup>asws</sup> saying regarding the one in <span class=\"iTxt\">Ihraam</span>, can he shade himself in the carriage?’ So he<sup>asws</sup> said to him: ‘No’. He said, ‘So can he shade in the tent?’ So he<sup>asws</sup> said to him; ‘Yes’. ",
            "So he repeated the words to him<sup>asws</sup>, like scoffing, laughing, saying, ‘O Abu Al-Hassan<sup>asws</sup>! So what is the difference between this and this?’ So he<sup>asws</sup> said: ‘O Abu Yusuf! The Religion is not by the analogy like your analogies. You all are playing with the Religion. We<sup>asws</sup> are doing just as Rasool-Allah<sup>saww</sup> did, and we<sup>asws</sup> say what Rasool-Allah<sup>saww</sup> said. Rasool-Allah<sup>saww</sup> used to ride upon his animal, so he<sup>saww</sup> did not shade himself<sup>saww</sup> upon it, and the sun bothered him<sup>saww</sup>. So he<sup>saww</sup> used to veil part of his<sup>saww</sup> body with the other parts. Sometimes he<sup>saww</sup> would veil his face with his<sup>saww</sup> hands, and when he<sup>saww</sup> encamped, he<sup>saww</sup> shaded in the tent, and in the house, and by the wall’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Ja’far ibn al-Muthanna’ al-Khatib from Muhammad ibn al- Fudayl and Bishr ibn ‘Isma‘il who has said the following: “Muhammad ibn ‘Isma‘il once said to me, ‘Would you like if I give you happy news, O ibn Muthanna?’ I replied, ‘Yes, please,’ and I stood up before him. He said, ‘This sinful person came to abu al-Hassan ‘Alayhi al-Salam, and he turned to him (the Imam) and asked, “O abu al-Hassan, can a man in the state of Ihram seek shadow in the carriage on the back of camels?” He (the Imam) said, “No, he cannot do so.” He then asked, “Can he seek shadow in the tent?” He (the Imam) said, “Yes, he can do so.” He repeated those words in a scolding manner, laughed and said, “O abu al-Hassan, what is the difference between this and that?” He (the Imam) then said, “O abu Yusuf, religion is not based on analogies like your analogies. You play with religion. We do only what the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, did and we say what the Messenger of Allah said. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, rode his stumper and did not prepare a shadow for himself. The sun rays hurt him and he covered only one part of his body with the other part, like covering his face with his hand, and when he disembarked he sought shadow in the tent, next to the House and walls.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/302)"
        ],
        "index": 7218,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:2",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الظِّلَالِ لِلْمُحْرِمِ فَقَالَ اضْحَ لِمَنْ أَحْرَمْتَ لَهُ قُلْتُ إِنِّي مَحْرُورٌ وَ إِنَّ الْحَرَّ يَشْتَدُّ عَلَيَّ قَالَ أَ مَا عَلِمْتَ أَنَّ الشَّمْسَ تَغْرُبُ بِذُنُوبِ الْمُحْرِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the shades for the one in Ihram. So he<sup>asws</sup> said: ‘Brightness is for the One<sup>azwj</sup> Whom you are wearing <span class=\"iTxt\">Ihraam</span> for’. I said, ‘I am feverish and the heat is intense upon me’. He<sup>asws</sup> said: ‘Do you not know that the sun sets along with the sins of the ones in <span class=\"iTxt\">Ihraam</span>?’"
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ‘ Abd Allah ibn al-Mughirah who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about shadow for a man in the state of Ihram. He (the Imam) said, ‘Remain in the sun for the sake of the One by whose command you assume the state of Ihram.’ I then said, ‘My endurance in the sun is low and heat becomes unbearable to me.’ He (the Imam) said, ‘Did you not know that the sun sits along with the sins of the people in the state of Ihram?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/302)"
        ],
        "index": 7219,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1027",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2348",
              "text": "عَلِيِّ بْنِ الرَّيَّانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3052",
              "text": "قَاسِمٍ الصَّيْقَلِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عَلِيِّ بْنِ الرَّيَّانِ عَنْ قَاسِمٍ الصَّيْقَلِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:3",
        "text": [
          " مَا رَأَيْتُ أَحَداً كَانَ أَشَدَّ تَشْدِيداً فِي الظِّلِّ مِنْ أَبِي جَعْفَرٍ ( عليه السلام ) كَانَ يَأْمُرُ بِقَلْعِ الْقُبَّةِ وَ الْحَاجِبَيْنِ إِذَا أَحْرَمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ali Bin Al Rayyan, from Qasim Al Sayqal who said, ",
            "‘I did not see anyone who was more intense in strictness regarding the shade than Abu Ja’far<sup>asws</sup>. He<sup>asws</sup> used to order with the dome of the tent and the two curtains (to be removed) when he<sup>asws</sup> wore <span class=\"iTxt\">Ihraam</span>’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Rayyan from al-Qasim al-Sayqal who has said the following: “I did not see anyone more strict about shadow in the state of Ihram than abu Ja‘far, ‘Alayhi al-Salam, who would command to remove the dome (tent) and its poles when he assumed the state of Ihram.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/302)"
        ],
        "index": 7220,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/119",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:4",
        "text": [
          " سَأَلْتُهُ عَنِ الْمَرْأَةِ يُضْرَبُ عَلَيْهَا الظِّلَالُ وَ هِيَ مُحْرِمَةٌ قَالَ نَعَمْ قُلْتُ فَالرَّجُلُ يُضْرَبُ عَلَيْهِ الظِّلَالُ وَ هُوَ مُحْرِمٌ قَالَ نَعَمْ إِذَا كَانَتْ بِهِ شَقِيقَةٌ وَ يَتَصَدَّقُ بِمُدٍّ لِكُلِّ يَوْمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘I asked him<sup>asws</sup> about the woman for whom a shade is established and she is in <span class=\"iTxt\">Ihraam</span>. He<sup>asws</sup> said: ‘Yes’. I said, ‘So the man upon whom a shade is struck and he is in <span class=\"iTxt\">Ihraam</span>?’ He<sup>asws</sup> said: ‘Yes, when he was with a headache, and he would have to give in charity with one Mudd (750 gms approximately of wheat etc.) for each day’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad Ahmad ibn Muhammad, from ibn abu Nasr from Ali ibn abu Hamzah from abu Basir who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of a woman for whom a shadow is prepared while she is in the state of Ihram. He (the Imam) said, ‘Yes, it is permissible.’ I then asked the same about men. He (the Imam) said, ‘Yes, if he suffers from severe headache, but he must pay one mud (a certain measurement) of food as charity for every day.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/303)"
        ],
        "index": 7221,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/204",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:5",
        "text": [
          " كَتَبْتُ إِلَى الرِّضَا ( عليه السلام ) هَلْ يَجُوزُ لِلْمُحْرِمِ أَنْ يَمْشِيَ تَحْتَ ظِلِّ الْمَحْمِلِ فَكَتَبَ نَعَمْ ",
          "قَالَ وَ سَأَلَهُ رَجُلٌ عَنِ الظِّلَالِ لِلْمُحْرِمِ مِنْ أَذَى مَطَرٍ أَوْ شَمْسٍ وَ أَنَا أَسْمَعُ فَأَمَرَهُ أَنْ يَفْدِيَ شَاةً وَ يَذْبَحَهَا بِمِنًى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazie who said, ",
            "‘I wrote to Al-Reza<sup>asws</sup>, ‘Is it allowed for the one in <span class=\"iTxt\">Ihraam</span> if he walks under a shade of the carriage?’ So he<sup>asws</sup> said: ‘Yes’. ",
            "He (the narrator) said, ‘And a man asked him<sup>asws</sup> about the shade for the one in <span class=\"iTxt\">Ihraam</span>, from the harm of rain, or sun, and I was listening. So he<sup>asws</sup> ordered him that he should expiate with a sheep, and slaughter it at Mina’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad from ‘Isma‘il ibn Bazi’ who has said the following: “I wrote to al-Rida’, ‘Alayhi al-Salam, and asked if it is permissible to walk in the shadow of the carriage on camel back. He (the Imam) wrote back, ‘Yes, it is permissible.’ Another man had asked about preparing a shadow for one in the state of Ihram because of rain or sun and I was listening, he (the Imam) commanded him to pay a ransom of one sheep to be slaughtered in Mina.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/304)"
        ],
        "index": 7222,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/857",
              "text": "أَحْمَدُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2629",
              "text": "عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/437",
              "text": "مُوسَى بْنِ عُمَرَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1098",
              "text": "مُحَمَّدِ بْنِ مَنْصُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/373",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ عَنْ مُوسَى بْنِ عُمَرَ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:6",
        "text": [
          " سَأَلْتُهُ عَنِ الظِّلَالِ لِلْمُحْرِمِ قَالَ لَا يُظَلِّلْ إِلَّا مِنْ عِلَّةِ مَرَضٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Ali Bin Ahmad Bin Asheym, from Musa Bin Umar, from Muhammad Bin Mansour, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the shade for the one in <span class=\"iTxt\">Ihraam</span>. He<sup>asws</sup> said: ‘He should not shade except from a reason of illness’."
          ],
          "en.sarwar": [
            "6. Ahmad has narrated from Ali ibn Ahmad ibn ‘Ushaym from Musa ibn ‘Umar from Muhammad ibn Mansur who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of a man in the state of Ihram and shadows. He (the Imam) said, ’He must not seek shadows unless he is ill.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/304)"
        ],
        "index": 7223,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/857",
              "text": "أَحْمَدُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3681",
              "text": "عُثْمَانَ بْنِ عِيسَى الْكِلَابِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ عَنْ عُثْمَانَ بْنِ عِيسَى الْكِلَابِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:7",
        "text": [
          " قُلْتُ لِأَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) إِنَّ عَلِيَّ بْنَ شِهَابٍ يَشْكُو رَأْسَهُ وَ الْبَرْدُ شَدِيدٌ وَ يُرِيدُ أَنْ يُحْرِمَ فَقَالَ إِنْ كَانَ كَمَا زَعَمَ فَلْيُظَلِّلْ وَ أَمَّا أَنْتَ فَاضْحَ لِمَنْ أَحْرَمْتَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Usman Bin Isa Al Kilaby who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> that Ali Bin Shihaab complained about his headache and the intense cold, and he intends to wear <span class=\"iTxt\">Ihraam</span>. So he<sup>asws</sup> said: ‘If it was as you are claiming, so let him shade (himself). And as for you, so brightness is for the One<sup>azwj</sup> Whom you are wearing <span class=\"iTxt\">Ihraam</span> for’."
          ],
          "en.sarwar": [
            "7. Ahmad has narrated from ‘Uthman ibn ‘Isa al-Kilabiy who has said the following: “I once said to abu al-Hassan, ‘Alayhi al-Salam, that Ali ibn Shihab has a headache, and cold is severe and he wants to assume the state of Ihram. He (the Imam) said, ‘If that is the case he can use shadows, but you must stay out of the shadow for the sake of the One for whom you assume the state of Ihram.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/304)"
        ],
        "index": 7224,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/589",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2420",
              "text": "إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:8",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) هَلْ يَسْتَتِرُ الْمُحْرِمُ مِنَ الشَّمْسِ فَقَالَ لَا إِلَّا أَنْ يَكُونَ شَيْخاً كَبِيراً أَوْ قَالَ ذَا عِلَّةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ismail Bin Abdul Khaliq who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup>, ‘Can the one in <span class=\"iTxt\">Ihraam</span> veil himself from the sun?’ So he<sup>asws</sup> said: ‘No, except he happens to be an old man’. Or he<sup>asws</sup> said: ‘(When he is) with an illness’."
          ],
          "en.sarwar": [
            "8. Ahmad ibn Muhammad from has narrated from Ali ibn al-Hakam from ‘Isma‘il ibn ‘Abd al-Khaliq who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, if a man in the state of Ihram can cover himself from the sun. He (the Imam) said, ‘No, he cannot do so, unless he is an old man or one with illness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/304)"
        ],
        "index": 7225,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/589",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2623",
              "text": "إِبْرَاهِيمَ بْنِ أَبِي مَحْمُودٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي مَحْمُودٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:9",
        "text": [
          " قُلْتُ لِلرِّضَا ( عليه السلام ) الْمُحْرِمُ يُظَلِّلُ عَلَى مَحْمِلِهِ وَ يَفْتَدِي إِذَا كَانَتِ الشَّمْسُ وَ الْمَطَرُ يُضِرَّانِ بِهِ قَالَ نَعَمْ قُلْتُ كَمِ الْفِدَاءُ قَالَ شَاةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ibrahim Bin Abu Mahmud who said, ",
            "‘I said to Al-Reza<sup>asws</sup>, ‘The one in <span class=\"iTxt\">Ihraam</span> shades upon his carriage, and he expiates when there was the sun and the rain, being harmed by it’. He<sup>asws</sup> said: ‘Yes’. I said, ‘How much is the expiation?’ He<sup>asws</sup> said: ‘A sheep’."
          ],
          "en.sarwar": [
            "9. Ahmad ibn Muhammad from has narrated from Ibrahim ibn abu Mahmud who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who is in the state of Ihram: if he can use shadow and pay ransom if the sun and rain are harmful for him. He (the Imam) said, ‘Yes, he can do so.’ I asked, ‘How much is the ransom?’ He (the Imam) said, ‘It is one sheep.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/305)"
        ],
        "index": 7226,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/422",
              "text": "الْكَاهِلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3386",
              "text": "أَبِي  عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْكَاهِلِيِّ عَنْ أَبِي  عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:10",
        "text": [
          " لَا بَأْسَ بِالْقُبَّةِ عَلَى النِّسَاءِ وَ الصِّبْيَانِ وَ هُمْ مُحْرِمُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al Kahily, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is no problem with the tent upon the women and the children, and they are in <span class=\"iTxt\">Ihraam</span>’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-Kahiliy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is not harmful for women and children to have a dome (umbrella) while they are in the state of Ihram.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/305)"
        ],
        "index": 7227,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/98",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/242",
              "text": "يَحْيَى الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/319",
              "text": "الْمُعَلَّى بْنِ خُنَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:11",
        "text": [
          " لَا يَسْتَتِرُ الْمُحْرِمُ مِنَ الشَّمْسِ بِثَوْبٍ وَ لَا بَأْسَ أَنْ يَسْتَتِرَ بَعْضَهُ بِبَعْضٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Al Moalla Bin Khunays, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one in <span class=\"iTxt\">Ihraam</span> cannot veil himself from the sun by clothes, and there is no problem if he were to veil himself with part of himself (like a hand etc.) the other parts (like face etc.)’."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya al-Halabiy from Mu ‘alia’ ibn Khunays who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A man in the state of Ihram must not cover himself from the sun with a cloth; but it is not harmful to cover one part by the other part of his body.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/305)"
        ],
        "index": 7228,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/361",
              "text": "بَكْرِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَكْرِ بْنِ صَالِحٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:12",
        "text": [
          " كَتَبْتُ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّ عَمَّتِي مَعِي وَ هِيَ زَمِيلَتِي وَ الْحَرُّ تَشْتَدُّ عَلَيْهَا إِذَا أَحْرَمَتْ فَتَرَى لِي أَنْ أُظَلِّلَ عَلَيَّ وَ عَلَيْهَا فَكَتَبَ ( عليه السلام ) ظَلِّلْ عَلَيْهَا وَحْدَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Bakr Bin Salih who said, ",
            "‘I wrote to Abu Ja’far<sup>asws</sup> that my paternal aunt is with me and she is my colleague, and the heat is intense upon her when she wears <span class=\"iTxt\">Ihraam</span>. So, what is your<sup>asws</sup> view for me if I were to shade upon myself and upon her?’ So he<sup>asws</sup> wrote: ‘Shade upon her alone’."
          ],
          "en.sarwar": [
            "12. A number of our people have narrated from Sahl ibn Ziyad from baker ibn Salih who has said the following: “I once wrote to abu Ja‘far, ‘Alayhi al-Salam, that my aunt who is my travel-mate and the heat is severe for her while she is in the state of Ihram; if I can provide shadow for her and for myself. He (the Imam) wrote, ‘You can provide shadow just for her alone.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/305)"
        ],
        "index": 7229,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/61",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/64",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/327",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/220",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:13",
        "text": [
          " سَأَلْتُهُ عَنِ الْمُحْرِمِ أَ يَتَغَطَّى قَالَ أَمَّا مِنَ الْحَرِّ وَ الْبَرْدِ فَلَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali, from Aban, from Zurara who said, ",
            "‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span>, can he cover himself?’ He<sup>asws</sup> said: ‘As for, from the heat and the cold, so no’."
          ],
          "en.sarwar": [
            "13. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali from Aban from Zurarah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man in the state of Ihram if he can cover himself. He (the Imam) said, ‘From heat or cold, however, he cannot cover himself.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/306)"
        ],
        "index": 7230,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/599",
              "text": "أَبِي عَلِيِّ بْنِ رَاشِدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَلِيِّ بْنِ رَاشِدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:14",
        "text": [
          " سَأَلْتُهُ عَنْ مُحْرِمٍ ظَلَّلَ فِي عُمْرَتِهِ قَالَ يَجِبُ عَلَيْهِ دَمٌ قَالَ وَ إِنْ خَرَجَ إِلَى مَكَّةَ وَ ظَلَّلَ وَجَبَ عَلَيْهِ أَيْضاً دَمٌ لِعُمْرَتِهِ وَ دَمٌ لِحَجَّتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from the one who mentioned it, from Abu Ali Bin Rashid who said, ",
            "‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> shading himself during his Umra. He<sup>asws</sup> said: ‘Blood (slaughter of an animal) is Obligated upon him’. He<sup>asws</sup> said: ‘And if he goes out to Makka and shades, so it Obligates the blood (slaughter of an animal) upon him as well for his Umra, and blood (slaughter of an animal) for his Hajj’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Yahya has narrated from those whom he has mentioned from Ali ibn Rashid who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about a man who seeks shadow in his al-‘Umrah. He (the Imam) said, ’Slaughtering (an animal) is necessary.’ He (the Imam) then said, ‘If he goes out to Makkah and uses shadow, it is necessary to slaughter an animal; one for al-‘Umrah and one for al- Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/306)"
        ],
        "index": 7231,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/78",
              "text": "ابْنِ أَبِي نَجْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/481",
              "text": "مُحَمَّدِ بْنِ الْفُضَيْلِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:90:15",
        "text": [
          " كُنَّا فِي دِهْلِيزِ يَحْيَى بْنِ خَالِدٍ بِمَكَّةَ وَ كَانَ هُنَاكَ أَبُو الْحَسَنِ مُوسَى ( عليه السلام ) وَ أَبُو يُوسُفَ فَقَامَ إِلَيْهِ أَبُو يُوسُفَ وَ تَرَبَّعَ بَيْنَ يَدَيْهِ فَقَالَ يَا أَبَا الْحَسَنِ جُعِلْتُ فِدَاكَ الْمُحْرِمُ يُظَلِّلُ قَالَ لَا قَالَ فَيَسْتَظِلُّ بِالْجِدَارِ وَ الْمَحْمِلِ وَ يَدْخُلُ الْبَيْتَ وَ الْخِبَاءَ قَالَ نَعَمْ قَالَ فَضَحِكَ أَبُو يُوسُفَ شِبْهَ الْمُسْتَهْزِئِ",
          "فَقَالَ لَهُ أَبُو الْحَسَنِ ( عليه السلام ) يَا أَبَا يُوسُفَ إِنَّ الدِّينَ لَيْسَ بِالْقِيَاسِ كَقِيَاسِكَ وَ قِيَاسِ أَصْحَابِكَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَمَرَ فِي كِتَابِهِ بِالطَّلَاقِ وَ أَكَّدَ فِيهِ بِشَاهِدَيْنِ وَ لَمْ يَرْضَ بِهِمَا إِلَّا عَدْلَيْنِ وَ أَمَرَ فِي كِتَابِهِ بِالتَّزْوِيجِ وَ أَهْمَلَهُ بِلَا شُهُودٍ فَأَتَيْتُمْ بِشَاهِدَيْنِ فِيمَا أَبْطَلَ اللَّهُ وَ أَبْطَلْتُمْ شَاهِدَيْنِ فِيمَا أَكَّدَ اللَّهُ عَزَّ وَ جَلَّ وَ أَجَزْتُمْ طَلَاقَ الْمَجْنُونِ وَ السَّكْرَانِ ",
          "حَجَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَأَحْرَمَ وَ لَمْ يُظَلِّلْ وَ دَخَلَ الْبَيْتَ وَ الْخِبَاءَ وَ اسْتَظَلَّ بِالْمَحْمِلِ وَ الْجِدَارِ فَعَلْنَا كَمَا فَعَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَسَكَتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ibn Abu Umeyr, from Abu najran, from Muhammad Bin Al Fuzayl who said, ",
            "‘We were in a hallway of Yahya Bin Khalid in Makkah, and over there was Abu Al-Hassan Musa<sup style=\"font-weight: normal\">asws</sup>, and Abu Yusuf. So Abu Yusuf<sup style=\"font-weight: normal\">asws</sup> stood up to him<sup style=\"font-weight: normal\">asws</sup> and squatted in front of him<sup style=\"font-weight: normal\">asws</sup>, and he said, ‘O Abu Al Hassan<sup style=\"font-weight: normal\">asws</sup>! May I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>! The one in <span class=\"iTxt\">Ihraam</span> can shade?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘No’. He said, ‘So can he shade by the wall, and the carriage, and enter the house, and the tent?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes’. So Abu Yusuf laughed in a scoffing manner.",
            "So Abu Al-Hassan<sup>asws</sup> said to him: ‘O Abu Yusuf! The Religion is not with the analogy like your analogies, and the analogies of your companions. Allah<sup>azwj</sup> Mighty and Majestic Commanded in His<sup>azwj</sup> Book with the divorce, and corroborated regarding it with two witnesses, and He<sup>azwj</sup> was not Pleased with these two unless they were both just, and Commanded in His<sup>azwj</sup> Book with the marriage, and Left it out without (necessitating) witnesses. But you are coming with two witnesses in what Allah<sup>azwj</sup> has Voided, and you are voiding the two witnesses in what Allah<sup>azwj</sup> Mighty and Majestic has Corroborated, and, you are allowing a divorce of the insane one, and the intoxicated one?",
            "Rasool-Allah<sup>saww</sup> performed Hajj, so he<sup>saww</sup> wore <span class=\"iTxt\">Ihraam</span> and did no shade himself<sup>saww</sup>, and entered the house, and the tent, and shaded with the carriage, and the wall. We<sup>asws</sup> are doing just as Rasool-Allah<sup>saww</sup> did’. So he was silent’."
          ],
          "en.sarwar": [
            "15. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from ibn abu Najran from Muhammad ibn al-Fudayl who has said the following: “Once we were in the hall of Yahya ibn Khalid in Makkah. Abu al-Hassan, Musa, ‘Alayhi al-Salam and abu Yusuf were there. Abu Yusuf stood up to move closer and then sat down square in front of him (the Imam), and said, ‘O abu al-Hassan, I pray to Allah to keep my soul in service for your cause, can a man in the state of Ihram seek shadow?’ He (the Imam) said, ‘No, he cannot do so.’ He (abu Yusuf) asked, ‘Can he seek shadow of a wall, carriage, or enter the house or tent?’ He (the Imam) said, ‘Yes, he can do so.’ He (abu Yusuf) laughed in a scolding manner. He (the Imam) then said, ‘O abu Yusuf, religion is not based on analogies like your analogies and the analogies of your companions. Allah, most Majestic, most Glorious, has commanded in His book to apply divorce and has insisted to have two witnesses bear testimony to the pronouncement of divorce and has not agreed unless they are just people. He has commanded to get married and has ignored the presence of witnesses but you require witnesses where Allah has made it (presence of witnesses) invalid and you have ignored the need for witnesses where Allah, most Majestic, most Glorious, requires. You have also made divorce by an insane and drunk person permissible. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed al-Hajj, assumed the state of Ihram and did not prepare a shadow for himself. He (the Messenger of Allah) entered the house, the tent, used the shadow of the carriage and the wall; and we do as the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, did. He (abu Yusuf) remained quiet.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:90",
  "kind": "verse_list"
}