{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:4:3", "titles": {"ar": "كِتَابُ الْحَجِّ", "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "}}, {"indexed_titles": {"en": "Chapter 90"}, "path": "/books/al-kafi:4:3:90", "titles": {"ar": "بَابُ الظِّلَالِ لِلْمُحْرِمِ", "en": "Chapter 90 – The shade for the one in Ihraam"}}], "index": 1033, "local_index": 90, "part_type": "Chapter", "path": "/books/al-kafi:4:3:90", "titles": {"ar": "بَابُ الظِّلَالِ لِلْمُحْرِمِ", "en": "Chapter 90 – The shade for the one in Ihraam"}, "verse_count": 15, "verse_start_index": 7216, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 7217, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ الْمُثَنَّى الْخَطِيبِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ وَ بِشْرِ بْنِ إِسْمَاعِيلَ قَالَ قَالَ لِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ أَ لَا أَسُرُّكَ يَا ابْنَ مُثَنًّى قَالَ قُلْتُ بَلَى وَ قُمْتُ إِلَيْهِ قَالَ دَخَلَ هَذَا الْفَاسِقُ آنِفاً فَجَلَسَ قُبَالَةَ أَبِي الْحَسَنِ ( عليه السلام ) ثُمَّ أَقْبَلَ عَلَيْهِ فَقَالَ لَهُ يَا أَبَا الْحَسَنِ مَا تَقُولُ فِي الْمُحْرِمِ أَ يَسْتَظِلُّ عَلَى الْمَحْمِلِ فَقَالَ لَهُ لَا قَالَ فَيَسْتَظِلُّ فِي الْخِبَاءِ فَقَالَ لَهُ نَعَمْ ", "فَأَعَادَ عَلَيْهِ الْقَوْلَ شِبْهَ الْمُسْتَهْزِئِ يَضْحَكُ فَقَالَ يَا أَبَا الْحَسَنِ فَمَا فَرْقُ بَيْنِ هَذَا وَ هَذَا فَقَالَ يَا أَبَا يُوسُفَ إِنَّ الدِّينَ لَيْسَ بِقِيَاسٍ كَقِيَاسِكُمْ أَنْتُمْ تَلْعَبُونَ بِالدِّينِ إِنَّا صَنَعْنَا كَمَا صَنَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ قُلْنَا كَمَا قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَرْكَبُ رَاحِلَتَهُ فَلَا يَسْتَظِلُّ عَلَيْهَا وَ تُؤْذِيهِ الشَّمْسُ فَيَسْتُرُ جَسَدَهُ بَعْضَهُ بِبَعْضٍ وَ رُبَّمَا سَتَرَ وَجْهَهُ بِيَدِهِ وَ إِذَا نَزَلَ اسْتَظَلَّ بِالْخِبَاءِ وَ فَيْ‏ءِ الْبَيْتِ وَ فَيْ‏ءِ الْجِدَارِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ja’far Bin Al Musanna Al Khattab, from Muhammad Bin al Fuzayl, and Bishr Bin Ismail who said, ", "‘Muhammad Bin Ismail said to me, ‘Shall I cheer you up O son of Musanna?’ I said, ‘Yes’, and I arose to him. This indecent man entered just nowhere, so he sat nearby Abu Al-Hassan<sup>asws</sup>. Then he turned facing him<sup>asws</sup> and he said to him<sup>asws</sup>, ‘O Abu Al-Hassan<sup>asws</sup>! What are you<sup>asws</sup> saying regarding the one in <span class=\"iTxt\">Ihraam</span>, can he shade himself in the carriage?’ So he<sup>asws</sup> said to him: ‘No’. He said, ‘So can he shade in the tent?’ So he<sup>asws</sup> said to him; ‘Yes’. ", "So he repeated the words to him<sup>asws</sup>, like scoffing, laughing, saying, ‘O Abu Al-Hassan<sup>asws</sup>! So what is the difference between this and this?’ So he<sup>asws</sup> said: ‘O Abu Yusuf! The Religion is not by the analogy like your analogies. You all are playing with the Religion. We<sup>asws</sup> are doing just as Rasool-Allah<sup>saww</sup> did, and we<sup>asws</sup> say what Rasool-Allah<sup>saww</sup> said. Rasool-Allah<sup>saww</sup> used to ride upon his animal, so he<sup>saww</sup> did not shade himself<sup>saww</sup> upon it, and the sun bothered him<sup>saww</sup>. So he<sup>saww</sup> used to veil part of his<sup>saww</sup> body with the other parts. Sometimes he<sup>saww</sup> would veil his face with his<sup>saww</sup> hands, and when he<sup>saww</sup> encamped, he<sup>saww</sup> shaded in the tent, and in the house, and by the wall’."]}}, {"index": 7218, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الظِّلَالِ لِلْمُحْرِمِ فَقَالَ اضْحَ لِمَنْ أَحْرَمْتَ لَهُ قُلْتُ إِنِّي مَحْرُورٌ وَ إِنَّ الْحَرَّ يَشْتَدُّ عَلَيَّ قَالَ أَ مَا عَلِمْتَ أَنَّ الشَّمْسَ تَغْرُبُ بِذُنُوبِ الْمُحْرِمِينَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira who said, ", "‘I asked Abu Al-Hassan<sup>asws</sup> about the shades for the one in Ihram. So he<sup>asws</sup> said: ‘Brightness is for the One<sup>azwj</sup> Whom you are wearing <span class=\"iTxt\">Ihraam</span> for’. I said, ‘I am feverish and the heat is intense upon me’. He<sup>asws</sup> said: ‘Do you not know that the sun sets along with the sins of the ones in <span class=\"iTxt\">Ihraam</span>?’"]}}, {"index": 7219, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عَلِيِّ بْنِ الرَّيَّانِ عَنْ قَاسِمٍ الصَّيْقَلِ قَالَ مَا رَأَيْتُ أَحَداً كَانَ أَشَدَّ تَشْدِيداً فِي الظِّلِّ مِنْ أَبِي جَعْفَرٍ ( عليه السلام ) كَانَ يَأْمُرُ بِقَلْعِ الْقُبَّةِ وَ الْحَاجِبَيْنِ إِذَا أَحْرَمَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ali Bin Al Rayyan, from Qasim Al Sayqal who said, ", "‘I did not see anyone who was more intense in strictness regarding the shade than Abu Ja’far<sup>asws</sup>. He<sup>asws</sup> used to order with the dome of the tent and the two curtains (to be removed) when he<sup>asws</sup> wore <span class=\"iTxt\">Ihraam</span>’."]}}, {"index": 7220, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:4", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُهُ عَنِ الْمَرْأَةِ يُضْرَبُ عَلَيْهَا الظِّلَالُ وَ هِيَ مُحْرِمَةٌ قَالَ نَعَمْ قُلْتُ فَالرَّجُلُ يُضْرَبُ عَلَيْهِ الظِّلَالُ وَ هُوَ مُحْرِمٌ قَالَ نَعَمْ إِذَا كَانَتْ بِهِ شَقِيقَةٌ وَ يَتَصَدَّقُ بِمُدٍّ لِكُلِّ يَوْمٍ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Ali Bin Abu Hamza, from Abu Baseer who said, ", "‘I asked him<sup>asws</sup> about the woman for whom a shade is established and she is in <span class=\"iTxt\">Ihraam</span>. He<sup>asws</sup> said: ‘Yes’. I said, ‘So the man upon whom a shade is struck and he is in <span class=\"iTxt\">Ihraam</span>?’ He<sup>asws</sup> said: ‘Yes, when he was with a headache, and he would have to give in charity with one Mudd (750 gms approximately of wheat etc.) for each day’."]}}, {"index": 7221, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:5", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ قَالَ كَتَبْتُ إِلَى الرِّضَا ( عليه السلام ) هَلْ يَجُوزُ لِلْمُحْرِمِ أَنْ يَمْشِيَ تَحْتَ ظِلِّ الْمَحْمِلِ فَكَتَبَ نَعَمْ ", "قَالَ وَ سَأَلَهُ رَجُلٌ عَنِ الظِّلَالِ لِلْمُحْرِمِ مِنْ أَذَى مَطَرٍ أَوْ شَمْسٍ وَ أَنَا أَسْمَعُ فَأَمَرَهُ أَنْ يَفْدِيَ شَاةً وَ يَذْبَحَهَا بِمِنًى ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazie who said, ", "‘I wrote to Al-Reza<sup>asws</sup>, ‘Is it allowed for the one in <span class=\"iTxt\">Ihraam</span> if he walks under a shade of the carriage?’ So he<sup>asws</sup> said: ‘Yes’. ", "He (the narrator) said, ‘And a man asked him<sup>asws</sup> about the shade for the one in <span class=\"iTxt\">Ihraam</span>, from the harm of rain, or sun, and I was listening. So he<sup>asws</sup> ordered him that he should expiate with a sheep, and slaughter it at Mina’."]}}, {"index": 7222, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:6", "text": ["أَحْمَدُ عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ عَنْ مُوسَى بْنِ عُمَرَ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الظِّلَالِ لِلْمُحْرِمِ قَالَ لَا يُظَلِّلْ إِلَّا مِنْ عِلَّةِ مَرَضٍ ."], "translations": {"en.hubeali": ["Ahmad, from Ali Bin Ahmad Bin Asheym, from Musa Bin Umar, from Muhammad Bin Mansour, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the shade for the one in <span class=\"iTxt\">Ihraam</span>. He<sup>asws</sup> said: ‘He should not shade except from a reason of illness’."]}}, {"index": 7223, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:7", "text": ["أَحْمَدُ عَنْ عُثْمَانَ بْنِ عِيسَى الْكِلَابِيِّ قَالَ قُلْتُ لِأَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) إِنَّ عَلِيَّ بْنَ شِهَابٍ يَشْكُو رَأْسَهُ وَ الْبَرْدُ شَدِيدٌ وَ يُرِيدُ أَنْ يُحْرِمَ فَقَالَ إِنْ كَانَ كَمَا زَعَمَ فَلْيُظَلِّلْ وَ أَمَّا أَنْتَ فَاضْحَ لِمَنْ أَحْرَمْتَ لَهُ ."], "translations": {"en.hubeali": ["Ahmad, from Usman Bin Isa Al Kilaby who said, ", "‘I said to Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> that Ali Bin Shihaab complained about his headache and the intense cold, and he intends to wear <span class=\"iTxt\">Ihraam</span>. So he<sup>asws</sup> said: ‘If it was as you are claiming, so let him shade (himself). And as for you, so brightness is for the One<sup>azwj</sup> Whom you are wearing <span class=\"iTxt\">Ihraam</span> for’."]}}, {"index": 7224, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:8", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) هَلْ يَسْتَتِرُ الْمُحْرِمُ مِنَ الشَّمْسِ فَقَالَ لَا إِلَّا أَنْ يَكُونَ شَيْخاً كَبِيراً أَوْ قَالَ ذَا عِلَّةٍ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ismail Bin Abdul Khaliq who said, ", "‘I asked Abu Abdullah<sup>asws</sup>, ‘Can the one in <span class=\"iTxt\">Ihraam</span> veil himself from the sun?’ So he<sup>asws</sup> said: ‘No, except he happens to be an old man’. Or he<sup>asws</sup> said: ‘(When he is) with an illness’."]}}, {"index": 7225, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:9", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي مَحْمُودٍ قَالَ قُلْتُ لِلرِّضَا ( عليه السلام ) الْمُحْرِمُ يُظَلِّلُ عَلَى مَحْمِلِهِ وَ يَفْتَدِي إِذَا كَانَتِ الشَّمْسُ وَ الْمَطَرُ يُضِرَّانِ بِهِ قَالَ نَعَمْ قُلْتُ كَمِ الْفِدَاءُ قَالَ شَاةٌ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from Ibrahim Bin Abu Mahmud who said, ", "‘I said to Al-Reza<sup>asws</sup>, ‘The one in <span class=\"iTxt\">Ihraam</span> shades upon his carriage, and he expiates when there was the sun and the rain, being harmed by it’. He<sup>asws</sup> said: ‘Yes’. I said, ‘How much is the expiation?’ He<sup>asws</sup> said: ‘A sheep’."]}}, {"index": 7226, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:10", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْكَاهِلِيِّ عَنْ أَبِي  عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا بَأْسَ بِالْقُبَّةِ عَلَى النِّسَاءِ وَ الصِّبْيَانِ وَ هُمْ مُحْرِمُونَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al Kahily, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is no problem with the tent upon the women and the children, and they are in <span class=\"iTxt\">Ihraam</span>’."]}}, {"index": 7227, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:11", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَسْتَتِرُ الْمُحْرِمُ مِنَ الشَّمْسِ بِثَوْبٍ وَ لَا بَأْسَ أَنْ يَسْتَتِرَ بَعْضَهُ بِبَعْضٍ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Al Moalla Bin Khunays, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one in <span class=\"iTxt\">Ihraam</span> cannot veil himself from the sun by clothes, and there is no problem if he were to veil himself with part of himself (like a hand etc.) the other parts (like face etc.)’."]}}, {"index": 7228, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:12", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَكْرِ بْنِ صَالِحٍ قَالَ كَتَبْتُ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّ عَمَّتِي مَعِي وَ هِيَ زَمِيلَتِي وَ الْحَرُّ تَشْتَدُّ عَلَيْهَا إِذَا أَحْرَمَتْ فَتَرَى لِي أَنْ أُظَلِّلَ عَلَيَّ وَ عَلَيْهَا فَكَتَبَ ( عليه السلام ) ظَلِّلْ عَلَيْهَا وَحْدَهَا ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Bakr Bin Salih who said, ", "‘I wrote to Abu Ja’far<sup>asws</sup> that my paternal aunt is with me and she is my colleague, and the heat is intense upon her when she wears <span class=\"iTxt\">Ihraam</span>. So, what is your<sup>asws</sup> view for me if I were to shade upon myself and upon her?’ So he<sup>asws</sup> wrote: ‘Shade upon her alone’."]}}, {"index": 7229, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:13", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُهُ عَنِ الْمُحْرِمِ أَ يَتَغَطَّى قَالَ أَمَّا مِنَ الْحَرِّ وَ الْبَرْدِ فَلَا ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali, from Aban, from Zurara who said, ", "‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span>, can he cover himself?’ He<sup>asws</sup> said: ‘As for, from the heat and the cold, so no’."]}}, {"index": 7230, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:14", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَلِيِّ بْنِ رَاشِدٍ قَالَ سَأَلْتُهُ عَنْ مُحْرِمٍ ظَلَّلَ فِي عُمْرَتِهِ قَالَ يَجِبُ عَلَيْهِ دَمٌ قَالَ وَ إِنْ خَرَجَ إِلَى مَكَّةَ وَ ظَلَّلَ وَجَبَ عَلَيْهِ أَيْضاً دَمٌ لِعُمْرَتِهِ وَ دَمٌ لِحَجَّتِهِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from the one who mentioned it, from Abu Ali Bin Rashid who said, ", "‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> shading himself during his Umra. He<sup>asws</sup> said: ‘Blood (slaughter of an animal) is Obligated upon him’. He<sup>asws</sup> said: ‘And if he goes out to Makka and shades, so it Obligates the blood (slaughter of an animal) upon him as well for his Umra, and blood (slaughter of an animal) for his Hajj’."]}}, {"index": 7231, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:4:3:90:15", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ قَالَ كُنَّا فِي دِهْلِيزِ يَحْيَى بْنِ خَالِدٍ بِمَكَّةَ وَ كَانَ هُنَاكَ أَبُو الْحَسَنِ مُوسَى ( عليه السلام ) وَ أَبُو يُوسُفَ فَقَامَ إِلَيْهِ أَبُو يُوسُفَ وَ تَرَبَّعَ بَيْنَ يَدَيْهِ فَقَالَ يَا أَبَا الْحَسَنِ جُعِلْتُ فِدَاكَ الْمُحْرِمُ يُظَلِّلُ قَالَ لَا قَالَ فَيَسْتَظِلُّ بِالْجِدَارِ وَ الْمَحْمِلِ وَ يَدْخُلُ الْبَيْتَ وَ الْخِبَاءَ قَالَ نَعَمْ قَالَ فَضَحِكَ أَبُو يُوسُفَ شِبْهَ الْمُسْتَهْزِئِ", "فَقَالَ لَهُ أَبُو الْحَسَنِ ( عليه السلام ) يَا أَبَا يُوسُفَ إِنَّ الدِّينَ لَيْسَ بِالْقِيَاسِ كَقِيَاسِكَ وَ قِيَاسِ أَصْحَابِكَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَمَرَ فِي كِتَابِهِ بِالطَّلَاقِ وَ أَكَّدَ فِيهِ بِشَاهِدَيْنِ وَ لَمْ يَرْضَ بِهِمَا إِلَّا عَدْلَيْنِ وَ أَمَرَ فِي كِتَابِهِ بِالتَّزْوِيجِ وَ أَهْمَلَهُ بِلَا شُهُودٍ فَأَتَيْتُمْ بِشَاهِدَيْنِ فِيمَا أَبْطَلَ اللَّهُ وَ أَبْطَلْتُمْ شَاهِدَيْنِ فِيمَا أَكَّدَ اللَّهُ عَزَّ وَ جَلَّ وَ أَجَزْتُمْ طَلَاقَ الْمَجْنُونِ وَ السَّكْرَانِ ", "حَجَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَأَحْرَمَ وَ لَمْ يُظَلِّلْ وَ دَخَلَ الْبَيْتَ وَ الْخِبَاءَ وَ اسْتَظَلَّ بِالْمَحْمِلِ وَ الْجِدَارِ فَعَلْنَا كَمَا فَعَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَسَكَتَ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Sahl Bin Ziyad, from Ibn Abu Umeyr, from Abu najran, from Muhammad Bin Al Fuzayl who said, ", "‘We were in a hallway of Yahya Bin Khalid in Makkah, and over there was Abu Al-Hassan Musa<sup style=\"font-weight: normal\">asws</sup>, and Abu Yusuf. So Abu Yusuf<sup style=\"font-weight: normal\">asws</sup> stood up to him<sup style=\"font-weight: normal\">asws</sup> and squatted in front of him<sup style=\"font-weight: normal\">asws</sup>, and he said, ‘O Abu Al Hassan<sup style=\"font-weight: normal\">asws</sup>! May I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>! The one in <span class=\"iTxt\">Ihraam</span> can shade?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘No’. He said, ‘So can he shade by the wall, and the carriage, and enter the house, and the tent?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes’. So Abu Yusuf laughed in a scoffing manner.", "So Abu Al-Hassan<sup>asws</sup> said to him: ‘O Abu Yusuf! The Religion is not with the analogy like your analogies, and the analogies of your companions. Allah<sup>azwj</sup> Mighty and Majestic Commanded in His<sup>azwj</sup> Book with the divorce, and corroborated regarding it with two witnesses, and He<sup>azwj</sup> was not Pleased with these two unless they were both just, and Commanded in His<sup>azwj</sup> Book with the marriage, and Left it out without (necessitating) witnesses. But you are coming with two witnesses in what Allah<sup>azwj</sup> has Voided, and you are voiding the two witnesses in what Allah<sup>azwj</sup> Mighty and Majestic has Corroborated, and, you are allowing a divorce of the insane one, and the intoxicated one?", "Rasool-Allah<sup>saww</sup> performed Hajj, so he<sup>saww</sup> wore <span class=\"iTxt\">Ihraam</span> and did no shade himself<sup>saww</sup>, and entered the house, and the tent, and shaded with the carriage, and the wall. We<sup>asws</sup> are doing just as Rasool-Allah<sup>saww</sup> did’. So he was silent’."]}}]}, "index": "al-kafi:4:3:90", "kind": "verse_list"}