{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:4:3",
        "titles": {
          "ar": "كِتَابُ الْحَجِّ",
          "en": "<a id=\"_Toc452717124\"></a>THE BOOK OF HAJJ "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 94"
        },
        "path": "/books/al-kafi:4:3:94",
        "titles": {
          "ar": "بَابُ الْعِلَاجِ لِلْمُحْرِمِ إِذَا مَرِضَ أَوْ أَصَابَهُ جُرْحٌ أَوْ خُرَاجٌ أَوْ عِلَّةٌ",
          "en": "Chapter 94 – The treatment for the one in Ihraam when he falls sick, or is hit by an injury, or pus, or a disease"
        }
      }
    ],
    "index": 1037,
    "local_index": 94,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:3:94",
    "titles": {
      "ar": "بَابُ الْعِلَاجِ لِلْمُحْرِمِ إِذَا مَرِضَ أَوْ أَصَابَهُ جُرْحٌ أَوْ خُرَاجٌ أَوْ عِلَّةٌ",
      "en": "Chapter 94 – The treatment for the one in Ihraam when he falls sick, or is hit by an injury, or pus, or a disease"
    },
    "verse_count": 10,
    "verse_start_index": 7256,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/316)"
        ],
        "index": 7257,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:94:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا اشْتَكَى الْمُحْرِمُ فَلْيَتَدَاوَ بِمَا يَأْكُلُ وَ هُوَ مُحْرِمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the one in <span class=\"iTxt\">Ihraam</span> complains, so let him be treated with that what he eats, while he is in <span class=\"iTxt\">Ihraam</span>’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Isma‘il ibn Muhammad ibn al-Fadl from abu al-Sabbah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one in the state of Ihram becomes ill one must treat the illness with edible items while he is in the state of Ihram.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل معتبر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/316)"
        ],
        "index": 7258,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:94:2",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَرَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَى كَعْبِ بْنِ عُجْرَةَ وَ الْقَمْلُ يَتَنَاثَرُ مِنْ رَأْسِهِ وَ هُوَ مُحْرِمٌ فَقَالَ لَهُ أَ تُؤْذِيكَ هَوَامُّكَ فَقَالَ نَعَمْ فَأُنْزِلَتْ هَذِهِ الْآيَةُ فَمَنْ كانَ مِنْكُمْ مَرِيضاً أَوْ بِهِ أَذىً مِنْ رَأْسِهِ فَفِدْيَةٌ مِنْ صِيامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ ",
          "فَأَمَرَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ يَحْلِقَ وَ جَعَلَ الصِّيَامَ ثَلَاثَةَ أَيَّامٍ وَ الصَّدَقَةَ عَلَى سِتَّةِ مَسَاكِينَ لِكُلِّ مِسْكِينٍ مُدَّيْنِ وَ النُّسُكَ شَاةً ",
          "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ كُلُّ شَيْ‏ءٍ مِنَ الْقُرْآنِ أَوْ فَصَاحِبُهُ بِالْخِيَارِ يَخْتَارُ مَا شَاءَ وَ كُلُّ شَيْ‏ءٍ مِنَ الْقُرْآنِ فَمَنْ لَمْ يَجِدْ كَذَا فَعَلَيْهِ كَذَا فَالْأُولَى الْخِيَارُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Hammad, from Hareyz, from the one who informed him, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> passed by Ka’ab Bin Ujra and lice was scattering from his head, and he was in <span class=\"iTxt\">Ihraam</span>. So he<sup>saww</sup> said to him: ‘Your vermins are harming you?’ So he said, ‘Yes’. So this Verse was Revealed <span class=\"ibTxt\">[2:196] but whoever among you is sick or has an ailment of the head, he (should effect) a compensation by Fasting or alms or sacrificing</span>.",
            "So Rasool-Allah<sup>saww</sup> ordered him that he should shave off his head and make the Fasting to be for three days, and to give charity upon six poor ones, for each poor one being two Mudds (750 gms x 2), and sacrifice a sheep’. ",
            "Abu Abdullah<sup>asws</sup> said: ‘And everything is from the Quran, or its doer is with the choice, he can choose whatever he so desires to; and everything from the Quran, ‘so the one who cannot find such and such, so upon him is such and such’, so he would have preference with the choice’."
          ],
          "en.sarwar": [
            "2. Ali has narrated from his father from Hammad from Hariz from those who narrated to him who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, passed by Ka‘b ibn ‘Ujrah. Lice spread from his head and he was in the state of Ihram. He (the Messenger of Allah) asked, ‘Do your bugs annoy you?’ He replied, ‘Yes, they annoy me.’ This verse of al-Quran was then revealed. ‘Those of you who become ill or find annoyance in their head expiate it by fasting or charity or an act of worship.’ (2:195) The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, commanded him to shave his head and made the fasting to be three days, charity to six destitute people two mud (a certain measurement) for each one and one sheep as an act of worship.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Wherever in al-Quran it is ‘or’ it is a reference to one’s having the choice to do what he likes, and wherever in al-Quran it says, ‘if one does not find then so and so’, then the first preference is one’s having the choice.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/317)"
        ],
        "index": 7259,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:94:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى الْكَاهِلِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلَهُ رَجُلٌ ضَرِيرُ الْبَصَرِ وَ أَنَا حَاضِرٌ فَقَالَ أَكْتَحِلُ إِذَا أَحْرَمْتُ قَالَ لَا وَ لِمَ تَكْتَحِلُ قَالَ إِنِّي ضَرِيرُ الْبَصَرِ فَإِذَا أَنَا اكْتَحَلْتُ نَفَعَنِي وَ إِذَا لَمْ أَكْتَحِلْ ضَرَّنِي قَالَ فَاكْتَحِلْ قَالَ فَإِنِّي أَجْعَلُ مَعَ الْكُحْلِ غَيْرَهُ قَالَ مَا هُوَ قَالَ آخُذُ خِرْقَتَيْنِ فَأُرَبِّعُهُمَا فَأَجْعَلُ عَلَى كُلِّ عَيْنٍ خِرْقَةً وَ أُعَصِّبُهُمَا بِعِصَابَةٍ إِلَى قَفَايَ فَإِذَا فَعَلْتُ ذَلِكَ نَفَعَنِي وَ إِذَا تَرَكْتُهُ ضَرَّنِي قَالَ فَاصْنَعْهُ .",
          "قَالَ فَإِنِّي أَجْعَلُ مَعَ الْكُحْلِ غَيْرَهُ قَالَ مَا هُوَ قَالَ آخُذُ خِرْقَتَيْنِ فَأُرَبِّعُهُمَا فَأَجْعَلُ عَلَى كُلِّ عَيْنٍ خِرْقَةً وَ أُعَصِّبُهُمَا بِعِصَابَةٍ إِلَى قَفَايَ فَإِذَا فَعَلْتُ ذَلِكَ نَفَعَنِي وَ إِذَا تَرَكْتُهُ ضَرَّنِي قَالَ فَاصْنَعْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdullah Bin Yahya Al Kahily, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man of impaired vision asked him<sup>asws</sup>, and I was present, so he said, ‘Can I apply Kohl when I wear <span class=\"iTxt\">Ihraam</span>?’ He<sup>asws</sup> said: ‘No, and why would you apply Kohl?’ He said, ‘I am of impaired vision. So when I apply Kohl, it benefits me, and when I do not apply Kohl, it harms me’. He<sup>asws</sup> said: ‘So apply Kohl’. ",
            "He said, ‘Supposing if I was to make something else to be along with the Kohl?’ He<sup>asws</sup> said: ‘What would it be?’ He said, ‘I take to rags and I fold them, so I make one rag to be upon each eye, and I tie these upon with a strip to the back of my head. So when I do so, that benefits me, and when I neglect it, it harms me’. He<sup>asws</sup> said: ‘So do it’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Abd Allah ibn Yahya al-Kahiliy who has said the following: “Once, a blind man asked abu ‘Abd Allah, ‘Alayhi al-Salam, when I was there, saying, ‘I use kohl when I assume the state of Ihram.’ He (the Imam) said, ‘No, do not use kohl.’ He said, ‘I am blind. If I use kohl it benefits me but if I do not use, it harms me.’ He (the Imam) said, ‘If that is the case then you can use kohl.’ He then said, ‘With kohl I use a certain other thing.’ He (the Imam) asked, ‘What is it?’ He said, ‘I take two pieces of cloth, fold them and place them on my eyes, then secure them in place by a strip behind my head. If I did this it benefits me; if I did not do, it harms me. He (the Imam) said, ‘If that is the case then you can do it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/318)"
        ],
        "index": 7260,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:94:4",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سُئِلَ عَنْ رَجُلٍ تَشَقَّقَتْ يَدَاهُ وَ رِجْلَاهُ وَ هُوَ مُحْرِمٌ أَ يَتَدَاوَى قَالَ نَعَمْ بِالسَّمْنِ وَ الزَّيْتِ وَ قَالَ إِذَا اشْتَكَى الْمُحْرِمُ فَلْيَتَدَاوَ بِمَا يَحِلُّ لَهُ أَنْ يَأْكُلَهُ وَ هُوَ مُحْرِمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali, from Aban, from the one who informed him, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about a man, his hands and his legs crack while he is in <span class=\"iTxt\">Ihraam</span>. Can he apply treatment?’ He<sup>asws</sup> said: ‘Yes, with the butter and the oil’. And he<sup>asws</sup> said: ‘When the one in <span class=\"iTxt\">Ihraam </span>complains, so let him be treated with whatever is Permissible for him, from (that what) he eats it, while he is in <span class=\"iTxt\">Ihraam</span>’."
          ],
          "en.sarwar": [
            "4. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali from Aban from those who narrated to him who has said the following: “A man once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man in whose hands and feet cracks appear while he is in the state of Ihram; if he can use medicine. He (the Imam) said, ‘Yes, he can do so with oil and ghee.’ He (the Imam) said, ‘If one in the state of Ihram becomes ill, one must treat the illness with what is lawful for him to eat in the state of Ihram.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/318)"
        ],
        "index": 7261,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:94:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْمُحْرِمِ يَعْصِرُ الدُّمَّلَ وَ يَرْبِطُ عَلَى الْقَرْحَةِ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> squeezing the pimple and bandage upon his ulcer. He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Um ay r from Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in the state of Ihram; if he can squeeze a pimple or bandage a wound. He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/318)"
        ],
        "index": 7262,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:94:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنْ خَرَجَ بِالرَّجُلِ مِنْكُمُ الْخُرَاجُ أَوِ الدُّمَّلُ فَلْيَرْبِطْهُ وَ لْيَتَدَاوَ بِزَيْتٍ أَوْ سَمْنٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If a man from you is injured with injury, or the pimple, so let him bandage it, and let him effect treatment with oil or butter’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Hisham ibn Salim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If something appears on your skin like a pimple or so, you can bandage it and use ghee or oil as medicine.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/318)"
        ],
        "index": 7263,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:94:7",
        "text": [
          "أَحْمَدُ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَعِيدٍ الْأَعْرَجِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمُحْرِمِ يَكُونُ بِهِ شَجَّةٌ أَ يُدَاوِيهَا أَوْ يُعَصِّبُهَا بِخِرْقَةٍ قَالَ نَعَمْ وَ كَذَلِكَ الْقَرْحَةُ تَكُونُ فِي الْجَسَدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Ali Bin Al Numan, from Saeed Al A’raj who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> who happens to be with a fracture. Can he treat it, or tie it with a bandage?’ He<sup>asws</sup> said: ‘Yes. And, similar to that is the ulcers which happen to be upon the body’."
          ],
          "en.sarwar": [
            "7. Ahmad has narrated from Ali ibn al-Nu’man from Sa‘id al-’A‘raj who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in the state of Ihram and has a head wound; if he can treat it with medicine or use bandage. He (the Imam) said, ‘Yes, he can do so and so also with a sore on the body.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/318)"
        ],
        "index": 7264,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:94:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عِمْرَانَ الْحَلَبِيِّ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمُحْرِمِ يَكُونُ بِهِ الْجُرْحُ فَيَتَدَاوَى بِدَوَاءٍ فِيهِ زَعْفَرَانٌ قَالَ إِنْ كَانَ الْغَالِبَ عَلَى الدَّوَاءِ فَلَا وَ إِنْ كَانَتِ الْأَدْوِيَةُ الْغَالِبَةَ عَلَيْهِ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Imran Al Halby who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about the one in <span class=\"iTxt\">Ihraam</span> who happens to be with an injury, so he treats with a medication which has saffron in it. He<sup>asws</sup> said: ‘If it (saffron) was overwhelming upon the medication, so no; and if it was such that the medication was overwhelming upon it, so there is no problem’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from ‘Imran al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in the state of Ihram with a wound and treats it with a medicine which has saffron. He (the Imam) said, ‘If saffron is overwhelming, it is not permissible; but if the medicine is overwhelming, it is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/319)"
        ],
        "index": 7265,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:94:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ نَاجِيَةَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مَرْوَانَ بْنِ مُسْلِمٍ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْمُحْرِمِ يُصِيبُ أُذُنَهُ الرِّيحُ فَيَخَافُ أَنْ يَمْرَضَ هَلْ يَصْلُحُ لَهُ أَنْ يَسُدَّ أُذُنَيْهِ بِالْقُطْنِ قَالَ نَعَمْ لَا بَأْسَ بِذَلِكَ إِذَا خَافَ ذَلِكَ وَ إِلَّا فَلَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Najiya, from Muhammad Bin Ali, from Marwan Bin Muslim, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the one in <span class=\"iTxt\">Ihraam</span> whose ears are hit by the wind, so he fears that he would fall sick. Is it correct for him that he closes his ears with the cotton?’ He<sup>asws</sup> said: ‘Yes, there is no problem with that when he fears that, or else, so no’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya Ahmad ibn Muhammad from Muhammad ibn Najiyah from Muhammad ibn Ali from Marwan ibn Muslim from who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in the state of Ihram, his ears are affected by winds and is afraid of illness; if he can place cotton in his ears. He (the Imam) said, ‘It is not harmful if he is afraid of illness, otherwise, it is not permissible.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/319)"
        ],
        "index": 7266,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:3:94:10",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ لَا بَأْسَ بِأَنْ يُعَصِّبَ الْمُحْرِمُ رَأْسَهُ مِنَ الصُّدَاعِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Muawiya Bin Wahab, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is no problem with it if the one in <span class=\"iTxt\">Ihraam</span> were to tie a strip around his head due to headache’."
          ],
          "en.sarwar": [
            "10. Abu Ali al-Ash’ariy has narrated from Muhammad ibn “Abd al-Jabbar from Safwan from Mu‘awiyah ibn Wahab who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is not harmful if one in the state of Ihram ties a strip around his head because of headache.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:3:94",
  "kind": "verse_list"
}