{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:6:6",
        "titles": {
          "ar": "كتاب الْأَطْعِمَةِ",
          "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:6:6:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب عِلَلِ التَّحْرِيمِ</span>",
          "en": "Chapter 1 – Reason for the Prohibition"
        }
      }
    ],
    "index": 1735,
    "local_index": 1,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:6:6:2",
        "titles": {
          "ar": "باب جَامِعٌ فِي الدَّوَابِّ الَّتِي لَا تُؤْكَلُ لَحْمُهَا",
          "en": "Chapter 2 – The comprehensive regarding the animals whose flesh cannot be consumed"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:6:6",
        "titles": {
          "ar": "كتاب الْأَطْعِمَةِ",
          "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:6:1",
    "titles": {
      "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب عِلَلِ التَّحْرِيمِ</span>",
      "en": "Chapter 1 – Reason for the Prohibition"
    },
    "verse_count": 1,
    "verse_start_index": 11329,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول والثاتني ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/29)"
        ],
        "index": 11330,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/11",
              "text": "عَمْرِو بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/106",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/50",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4938",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا أَيْضاً"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/731",
              "text": "مُحَمَّدِ بْنِ أَسْلَمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1368",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/83",
              "text": "مُفَضَّلِ بْنِ عُمَرَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ عِدَّةٌ مِنْ أَصْحَابِنَا أَيْضاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَالِمٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:1:1",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَخْبِرْنِي جُعِلْتُ فِدَاكَ لِمَ حَرَّمَ اللَّهُ تَبَارَكَ وَ تَعَالَى الْخَمْرَ وَ الْمَيْتَةَ وَ الدَّمَ وَ لَحْمَ الْخِنْزِيرِ",
          "فَقَالَ إِنَّ اللَّهَ سُبْحَانَهُ وَ تَعَالَى لَمْ يُحَرِّمْ ذَلِكَ عَلَى عِبَادِهِ وَ أَحَلَّ لَهُمْ سِوَاهُ رَغْبَةً مِنْهُ فِيمَا حَرَّمَ عَلَيْهِمْ وَ لَا زُهْداً فِيمَا أَحَلَّ لَهُمْ وَ لَكِنَّهُ خَلَقَ الْخَلْقَ وَ عَلِمَ عَزَّ وَ جَلَّ مَا تَقُومُ بِهِ أَبْدَانُهُمْ وَ مَا يُصْلِحُهُمْ فَأَحَلَّهُ لَهُمْ وَ أَبَاحَهُ تَفَضُّلًا مِنْهُ عَلَيْهِمْ بِهِ تَبَارَكَ وَ تَعَالَى لِمَصْلَحَتِهِمْ وَ عَلِمَ مَا يَضُرُّهُمْ فَنَهَاهُمْ عَنْهُ وَ حَرَّمَهُ عَلَيْهِمْ",
          "ثُمَّ أَبَاحَهُ لِلْمُضْطَرِّ وَ أَحَلَّهُ لَهُ فِي الْوَقْتِ الَّذِي لَا يَقُومُ بَدَنُهُ إِلَّا بِهِ فَأَمَرَهُ أَنْ يَنَالَ مِنْهُ بِقَدْرِ الْبُلْغَةِ لَا غَيْرِ ذَلِكَ",
          "ثُمَّ قَالَ أَمَّا الْمَيْتَةُ فَإِنَّهُ لَا يُدْمِنُهَا أَحَدٌ إِلَّا ضَعُفَ بَدَنُهُ وَ نَحَلَ جِسْمُهُ وَ ذَهَبَتْ قُوَّتُهُ وَ انْقَطَعَ نَسْلُهُ وَ لَا يَمُوتُ آكِلُ الْمَيْتَةِ إِلَّا فَجْأَةً",
          "وَ أَمَّا الدَّمُ فَإِنَّهُ يُورِثُ آكِلَهُ الْمَاءَ الْأَصْفَرَ وَ يُبْخِرُ الْفَمَ وَ يُنَتِّنُ الرِّيحَ وَ يُسِي‏ءُ الْخُلُقَ وَ يُورِثُ الْكَلَبَ وَ الْقَسْوَةَ فِي الْقَلْبِ وَ قِلَّةَ الرَّأْفَةِ وَ الرَّحْمَةِ حَتَّى لَا يُؤْمَنَ أَنْ يَقْتُلَ وَلَدَهُ وَ وَالِدَيْهِ وَ لَا يُؤْمَنَ عَلَى حَمِيمِهِ وَ لَا يُؤْمَنَ عَلَى مَنْ يَصْحَبُهُ",
          "وَ أَمَّا لَحْمُ الْخِنْزِيرِ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى مَسَخَ قَوْماً فِي صُوَرٍ شَتَّى شِبْهِ الْخِنْزِيرِ وَ الْقِرْدِ وَ الدُّبِّ وَ مَا كَانَ مِنَ الْمُسُوخِ ثُمَّ نَهَى عَنْ أَكْلِهِ لِلْمَثُلَةِ لِكَيْلَا يَنْتَفِعَ النَّاسُ بِهَا وَ لَا يُسْتَخَفَّ بِعُقُوبَتِهَا",
          "وَ أَمَّا الْخَمْرُ فَإِنَّهُ حَرَّمَهَا لِفِعْلِهَا وَ لِفَسَادِهَا وَ قَالَ مُدْمِنُ الْخَمْرِ كَعَابِدِ وَثَنٍ تُورِثُهُ الِارْتِعَاشَ وَ تَذْهَبُ بِنُورِهِ وَ تَهْدِمُ مُرُوءَتَهُ وَ تَحْمِلُهُ عَلَى أَنْ يَجْسُرَ عَلَى الْمَحَارِمِ مِنْ سَفْكِ الدِّمَاءِ وَ رُكُوبِ الزِّنَا فَلَا يُؤْمَنُ إِذَا سَكِرَ أَنْ يَثِبَ عَلَى حَرَمِهِ وَ هُوَ لَا يَعْقِلُ ذَلِكَ وَ الْخَمْرُ لَا يَزْدَادُ شَارِبُهَا إِلَّا كُلَّ سُوءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, altogether, from Amro Bin Usman, from Muhammad Bin Abdullah, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, ",
            "and a number of our companions as well, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Aslam, from Abdul Rahman Bin Salim, from Mufazzal Bin Umar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Inform me, may I be sacrificed for you<sup>asws</sup>, why did Allah<sup>azwj</sup> Blessed and High Prohibiting the wine, and the dead, and the blood, and the flesh of the swine?’",
            "So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Glorious and High did not Prohibit that upon His<sup>azwj</sup> servants, and Permit for them besides it as a Desire from Him<sup>azwj</sup> with regards to what He<sup>azwj</sup> Prohibits upon them, nor as a Distaste with regards to what He<sup>azwj</sup> Permitted for them, but He<sup>azwj</sup> Created the creatures and the Mighty and Majestic Knows what their bodies stand by and what is correct for them. Thus, He<sup>azwj</sup> Permitted for them and Authorised it for them as a Grace from Him<sup>azwj</sup> the Blessed and High, upon them with it for their correctness; and He<sup>azwj</sup> Knows what harms them, so He<sup>azwj</sup> Forbade them from it, and Prohibited it upon them.",
            "The He<sup>azwj</sup> Authorised it for the desperate and Permitted it for him during the time which his body would not be able to stand except by it. So, He<sup>azwj</sup> Commanded him to take from it by a measurement of the necessity, not other than that.",
            "Then he<sup>asws</sup> said: ‘As for the dead, so no one would be habitual with it except that it would weaken his body, and slims his body, and his strength goes away, and his lineage is cut-off, and the eater of the dead would not be dying except for suddenly.",
            "And as for the blood, so its consumer inherits the yellow water, and odour of the mouth, and stinking wind, and he would be of evil mannerisms, and intense thirst, and the hardness in the heart, and be with scarcity of the kindness and the mercy to the extent there is no safety that he would kill his children, and his parents, and there would be no safety upon his intimate one, nor would there be safety upon the one who accompanies him.",
            "And as for the flesh of the swine, so Allah<sup>azwj</sup> Blessed and High Morphed a people in the variety of images resembling the pig, and the monkey, and the bear, and whatever was from the mutants. Then He<sup>azwj</sup> Forbade from eating it due to the resemblance that perhaps the people might avail themselves by it and would not belittle its consequences.",
            "And as for the wine, so He<sup>azwj</sup> Prohibited it due to its impact and its corruption’. And he<sup>asws</sup> said: ‘The one habitual of the wine is like a worshipper of idols. He would inherit trembling, and his light would go away, and his manhood would be demolished, and it would carry him upon being audacious upon the Prohibitions from the shedding of the blood, and indulging in the adultery. So there is no safety, when he is intoxicated, that he would leap upon his sanctimonious family members and he has no intellect for that. And the wine does not increase its drinker except with every evil’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad, Ali ibn Ibrahim has narrated from his father all, from ‘Amr ibn ‘Uthman from Muhammad ibn ‘Abd Allah, from certain persons of our people from abu ‘Abd Allah, ‘Alayhi al-Salam. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Aslam from ‘Abd al-Rahman ibn Salim from Mufaddal ibn ‘Umar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep my soul in service for your cause, why has Allah, most Blessed, most High, made wine, dead animals, blood and the flesh of pigs unlawful?’ He (the Imam) said, ‘Allah, who is free of all defects, the most High has not made such things unlawful for His servants and made certain things lawful for them because of His interest in what He has made unlawful and His dislike of what He has made lawful for them. In fact He created the creatures and He, most Majestic, most Glorious, knew what their bodies needed and what was beneficial for them; so He made such things lawful for them as a favor to them from Him, most Blessed, most High, for their well being. He knew what was harmful to them, so He prohibited them and made it unlawful to them but then He made lawful for those compelled and in the times when their bodies could not survive without it so He commanded to use it for the bare necessities and not more.’ “He (the Imam) said, ‘The dead animals are unlawful; no one must use it every now and then because it weakens their bodies, makes it thin and his power goes away, his offspring become cutoff and those who eat dead bodies die suddenly. “Blood is unlawful because eating it causes yellow fluid, bad breath, foul smell, bad moral behavior and causes an illness similar to madness, hardheartedness, lack of kindness and sympathy so much so that one may murder his children, and parents, and he cannot be trusted about his best friends and his companions. “The flesh of pigs is unlawful because Allah, most Blessed, most High, metamorphosed certain people in different shapes such as pigs, apes and bears and others. He then prohibited eating such things, it is a kind of cannibalism, so people must not take advantage of such things and must not take consequent suffering lightly. “Wine is made unlawful because of its bad effects and damages it may cause. He (the Imam) then said, ‘One who often uses wine is like a worshipper of idols, it causes tremors, takes away the light (beauty), abolishes kindness, carries him to excessive boldness against the relatives like bloodshed and fornication. He, when drunk cannot be trusted and he may disregard his sanctity when failing to understand. Drinking wine does not increase anything to one except what is worse and evil.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:6:1",
  "kind": "verse_list"
}