{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 6"}, "path": "/books/al-kafi:6:6", "titles": {"ar": "كتاب الْأَطْعِمَةِ", "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "}}, {"indexed_titles": {"en": "Chapter 132"}, "path": "/books/al-kafi:6:6:132", "titles": {"ar": "باب رَمْيِ مَا يَدْخُلُ بَيْنَ الْأَسْنَانِ", "en": "Chapter 132 – Throwing what enters in between the teeth"}}], "index": 1858, "local_index": 132, "part_type": "Chapter", "path": "/books/al-kafi:6:6:132", "titles": {"ar": "باب رَمْيِ مَا يَدْخُلُ بَيْنَ الْأَسْنَانِ", "en": "Chapter 132 – Throwing what enters in between the teeth"}, "verse_count": 4, "verse_start_index": 12017, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 12018, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:6:132:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ إِسْحَاقَ بْنِ جَرِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ اللَّحْمِ الَّذِي يَكُونُ فِي الْأَسْنَانِ فَقَالَ أَمَّا مَا كَانَ فِي مُقَدَّمِ الْفَمِ فَكُلْهُ وَ مَا كَانَ فِي الْأَضْرَاسِ فَاطْرَحْهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Is’haq Bin Jareer who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the meat which happens (to be stuck) in the teeth. So he<sup>asws</sup> said: ‘As for what is in the front of the mouth, so swallow it, and whatever was in the molars, so toss it’."]}}, {"index": 12019, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:6:132:2", "text": ["عَنْهُ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَمَّا مَا يَكُونُ عَلَى اللِّثَةِ فَكُلْهُ وَ ازْدَرِدْهُ وَ مَا كَانَ بَيْنَ الْأَسْنَانِ فَارْمِ بِهِ ."], "translations": {"en.hubeali": ["From him, from Ibn Mahboub, from Ibn Sinana, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘As for what happens to be upon the gums, so swallow it and gobble it, and whatever was in between the teeth, so throw it’."]}}, {"index": 12020, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:6:132:3", "text": ["عَنْهُ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ النَّوْفَلِيِّ عَنِ الْفَضْلِ بْنِ يُونُسَ قَالَ تَغَدَّى عِنْدِي أَبُو الْحَسَنِ ( عليه السلام ) فَلَمَّا فَرَغَ مِنَ الطَّعَامِ أُتِيَ بِالْخِلَالِ فَقُلْتُ جُعِلْتُ فِدَاكَ مَا حَدُّ هَذَا الْخِلَالِ فَقَالَ يَا فَضْلُ كُلُّ مَا بَقِيَ فِي فَمِكَ فَمَا أَدَرْتَ عَلَيْهِ لِسَانَكَ فَكُلْهُ وَ مَا اسْتَكَنَّ فَأَخْرِجْهُ بِالْخِلَالِ فَأَنْتَ فِيهِ بِالْخِيَارِ إِنْ شِئْتَ أَكَلْتَهُ وَ إِنْ شِئْتَ طَرَحْتَهُ ."], "translations": {"en.hubeali": ["From him, from his father, from Abdullah Bin Al Fazl Al Nowfaly, from Al Fazl Bin Yunus who said, ", "‘Abu Al-Hassan<sup>asws</sup> had lunch with me. So when he<sup>asws</sup> was free from the meal, they came with the toothpicks. So I said, ‘May I be sacrificed for you<sup>asws</sup>! What is a limit of this toothpick?’ So he<sup>asws</sup> said: ‘O Fazl! Eat what remains in your mouth. So whatever your tongue can get around to, so eat it, and whatever is settled, so extract it with the tooth pick. So you are in the choice with regards to it, if you so desire to, eat, and if you so desire to, toss it’."]}}, {"index": 12021, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:6:132:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لَا يَزْدَرِدَنَّ أَحَدُكُمْ مَا يَتَخَلَّلُ بِهِ فَإِنَّهُ يَكُونُ مِنْهُ الدُّبَيْلَةُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, ", "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup> having said: ‘Not one of you should swallow what he picks teeth with, for the pus can happen from it’."]}}]}, "index": "al-kafi:6:6:132", "kind": "verse_list"}