{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:6:6",
        "titles": {
          "ar": "كتاب الْأَطْعِمَةِ",
          "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:6:6:14",
        "titles": {
          "ar": "باب الْفَأْرَةِ تَمُوتُ فِي الطَّعَامِ وَ الشَّرَابِ",
          "en": "Chapter 14 – The mouse which has died in the food and the drink"
        }
      }
    ],
    "index": 1748,
    "local_index": 14,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:6:6:15",
        "titles": {
          "ar": "باب اخْتِلَاطِ الْحَلَالِ بِغَيْرِهِ فِي الشَّيْ‏ءِ",
          "en": "Chapter 15 – Mixture of the Permissible with other regarding the things"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:6:6:13",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 13 – Another Chapter from it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:6:6",
        "titles": {
          "ar": "كتاب الْأَطْعِمَةِ",
          "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:6:14",
    "titles": {
      "ar": "باب الْفَأْرَةِ تَمُوتُ فِي الطَّعَامِ وَ الشَّرَابِ",
      "en": "Chapter 14 – The mouse which has died in the food and the drink"
    },
    "verse_count": 4,
    "verse_start_index": 11399,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/57)"
        ],
        "index": 11400,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:14:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا وَقَعَتِ الْفَأْرَةُ فِي السَّمْنِ فَمَاتَتْ فِيهِ فَإِنْ كَانَ جَامِداً فَأَلْقِهَا وَ مَا يَلِيهَا وَ كُلْ مَا بَقِيَ وَ إِنْ كَانَ ذَائِباً فَلَا تَأْكُلْهُ وَ اسْتَصْبِحْ بِهِ وَ الزَّيْتُ مِثْلُ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When the mouse falls in the butter, so it dies in it, so if it was solidified, so throw it (the mouse) and whatever it came into contact with, and eat what remains (from the butter), and if it had melted, so do not eat it and you can kindle the light with it; and the oil is similar to that’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has stated this Hadith. ‘If a rat falls in ghee and dies in it, if it is solid, it (the rat) then must be thrown away as well as whatever has come in contact with it. If it is fluid you must not use it for food but you can use it for lighting during the night and so also is the case about oil.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/58)"
        ],
        "index": 11401,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:14:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ جُرَذٌ مَاتَ فِي سَمْنٍ أَوْ زَيْتٍ أَوْ عَسَلٍ فَقَالَ ( عليه السلام ) أَمَّا السَّمْنُ وَ الْعَسَلُ فَيُؤْخَذُ الْجُرَذُ وَ مَا حَوْلَهُ وَ الزَّيْتُ يُسْتَصْبَحُ بِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al hakam, from Muawiya Bin Wahab, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘A rat dies in butter, or oil, or honey’. So he<sup>asws</sup> said: ‘As for the butter and the honey, so seize the rat and what is around it (and throw it away), and the oil you can kindle the light with it’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Mu‘awiyah ibn Wahab who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the mouse that dies in ghee or oil or honey. He (the Imam) said, ‘In the case of ghee and honey the mouse and whatever has come in contact with it can be taken out; but oil can be used only for lighting during the night.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/58)"
        ],
        "index": 11402,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:14:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) سُئِلَ عَنْ قِدْرٍ طُبِخَتْ فَإِذَا فِي الْقِدْرِ فَأْرَةٌ قَالَ يُهَرَاقُ مَرَقُهَا وَ يُغْسَلُ اللَّحْمُ وَ يُؤْكَلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that: ‘Amir Al-Momineen<sup>asws</sup> was asked about a cooking pot when there is the mouse in the cooking pot. He<sup>asws</sup> said: ‘Discard its broth and wash the meat, and eat’."
          ],
          "en.sarwar": [
            "3. Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Muhammad ibn ’Isma‘il from Ali ibn al-Nu’man from Sa‘id al-A’raj who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about rat or dog that falls in ghee and oil, then it is taken out alive. He (the Imam) said, ‘It is not unlawful to use it for food.’” (In al-Tahdhib by Shaykh there is no mention of dog. It perhaps is a mistake by scribes). "
          ]
        }
      },
      {
        "index": 11403,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:14:4",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَعِيدٍ الْأَعْرَجِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْفَأْرَةِ وَ الْكَلْبِ يَقَعُ فِي السَّمْنِ وَ الزَّيْتِ ثُمَّ يَخْرُجُ مِنْهُ حَيّاً فَقَالَ لَا بَأْسَ بِأَكْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Muhammad Bin Ismail, from Ali Bin Al Noman, from Saeed Al A’araj who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the mouse and the dog which fall into the butter and the oil, then come out alive from it’. So he<sup>asws</sup> said: ‘There is no problem with eating it’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:6:14",
  "kind": "verse_list"
}