{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 6"}, "path": "/books/al-kafi:6:6", "titles": {"ar": "كتاب الْأَطْعِمَةِ", "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "}}, {"indexed_titles": {"en": "Chapter 2"}, "path": "/books/al-kafi:6:6:2", "titles": {"ar": "باب جَامِعٌ فِي الدَّوَابِّ الَّتِي لَا تُؤْكَلُ لَحْمُهَا", "en": "Chapter 2 – The comprehensive regarding the animals whose flesh cannot be consumed"}}], "index": 1728, "local_index": 2, "part_type": "Chapter", "path": "/books/al-kafi:6:6:2", "titles": {"ar": "باب جَامِعٌ فِي الدَّوَابِّ الَّتِي لَا تُؤْكَلُ لَحْمُهَا", "en": "Chapter 2 – The comprehensive regarding the animals whose flesh cannot be consumed"}, "verse_count": 16, "verse_start_index": 11320, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 11321, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ بِسْطَامَ بْنِ مُرَّةَ عَنْ إِسْحَاقَ بْنِ حَسَّانَ عَنْ هَيْثَمِ بْنِ وَاقِدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ الْعَبْدِيِّ عَنْ أَبِي هَارُونَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ سُئِلَ مَا قَوْلُكَ فِي هَذَا السَّمَكِ الَّذِي يَزْعُمُ إِخْوَانُنَا مِنْ أَهْلِ الْكُوفَةِ أَنَّهُ حَرَامٌ فَقَالَ أَبُو سَعِيدٍ سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ الْكُوفَةُ جُمْجُمَةُ الْعَرَبِ وَ رُمْحُ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ كَنْزُ الْإِيمَانِ فَخُذْ عَنْهُمْ أُخْبِرُكَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مَكَثَ بِمَكَّةَ يَوْماً وَ لَيْلَةً يَطْوِي ثُمَّ خَرَجَ وَ خَرَجْتُ مَعَهُ فَمَرَرْنَا بِرِفْقَةٍ جُلُوسٍ يَتَغَدَّوْنَ فَقَالُوا يَا رَسُولَ اللَّهِ الْغَدَاءَ فَقَالَ لَهُمْ نَعَمْ أَفْرِجُوا لِنَبِيِّكُمْ", "فَجَلَسَ بَيْنَ رَجُلَيْنِ وَ جَلَسْتُ وَ تَنَاوَلَ رَغِيفاً فَصَدَعَ بِنِصْفِهِ ثُمَّ نَظَرَ إِلَى أُدْمِهِمْ فَقَالَ مَا أُدْمُكُمْ هَذَا فَقَالُوا الْجِرِّيثُ يَا رَسُولَ اللَّهِ فَرَمَى بِالْكِسْرَةِ مِنْ يَدِهِ وَ قَامَ", "قَالَ أَبُو سَعِيدٍ وَ تَخَلَّفْتُ بَعْدَهُ لِأَنْظُرَ مَا رَأْيُ النَّاسِ فَاخْتَلَفَ النَّاسُ فِيمَا بَيْنَهُمْ فَقَالَتْ طَائِفَةٌ حَرَّمَ رَسُولُ اللَّهِ الْجِرِّيثَ وَ قَالَتْ طَائِفَةٌ لَمْ يُحَرِّمْهُ وَ لَكِنْ عَافَهُ فَلَوْ كَانَ حَرَّمَهُ لَنَهَانَا عَنْ أَكْلِهِ قَالَ فَحَفِظْتُ مَقَالَتَهُمْ وَ تَبِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) جَوَاداً حَتَّى لَحِقْتُهُ", "ثُمَّ غَشِينَا رِفْقَةً أُخْرَى يَتَغَدَّوْنَ فَقَالُوا يَا رَسُولَ اللَّهِ الْغَدَاءَ فَقَالَ نَعَمْ أَفْرِجُوا لِنَبِيِّكُمْ فَجَلَسَ بَيْنَ رَجُلَيْنِ وَ جَلَسْتُ مَعَهُ فَلَمَّا أَنْ تَنَاوَلَ كِسْرَةً نَظَرَ إِلَى أُدْمِ الْقَوْمِ فَقَالَ مَا أُدْمُكُمْ هَذَا قَالُوا ضَبٌّ يَا رَسُولَ اللَّهِ فَرَمَى بِالْكِسْرَةِ وَ قَامَ", "قَالَ أَبُو سَعِيدٍ فَتَخَلَّفْتُ بَعْدُ فَإِذَا النَّاسُ فِرْقَتَانِ فَقَالَتْ فِرْقَةٌ حَرَّمَهُ رَسُولُ اللَّهِ فَمِنْ هُنَاكَ لَمْ يَأْكُلْهُ وَ قَالَتْ فِرْقَةٌ أُخْرَى إِنَّمَا عَافَهُ وَ لَوْ حَرَّمَهُ لَنَهَانَا عَنْ أَكْلِهِ ثُمَّ تَبِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حَتَّى لَحِقْتُهُ", "فَمَرَرْنَا بِأَصْلِ الصَّفَا وَ بِهَا قُدُورٌ تَغْلِي فَقَالُوا يَا رَسُولَ اللَّهِ لَوْ عَرَّجْتَ عَلَيْنَا حَتَّى تُدْرِكَ قُدُورَنَا فَقَالَ لَهُمْ وَ مَا فِي قُدُورِكُمْ فَقَالُوا حُمُرٌ لَنَا كُنَّا نَرْكَبُهَا فَقَامَتْ فَذَبَحْنَاهَا فَدَنَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنَ الْقُدُورِ فَأَكْفَأَهَا بِرِجْلِهِ ثُمَّ انْطَلَقَ جَوَاداً وَ تَخَلَّفْتُ بَعْدَهُ فَقَالَ بَعْضُهُمْ حَرَّمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَحْمَ الْحَمِيرِ وَ قَالَ بَعْضُهُمْ كَلَّا إِنَّمَا أَفْرَغَ قُدُورَكُمْ حَتَّى لَا تَعُودُوا فَتَذْبَحُوا دَوَابَّكُمْ", "قَالَ أَبُو سَعِيدٍ فَبَعَثَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَيَّ فَلَمَّا جِئْتُهُ قَالَ يَا أَبَا سَعِيدٍ ادْعُ لِي بِلَالًا فَلَمَّا جِئْتُهُ بِبِلَالٍ قَالَ يَا بِلَالُ اصْعَدْ أَبَا قُبَيْسٍ فَنَادِ عَلَيْهِ أَنَّ رَسُولَ اللَّهِ حَرَّمَ الْجِرِّيَّ وَ الضَّبَّ وَ الْحَمِيرَ الْأَهْلِيَّةَ أَلَا فَاتَّقُوا اللَّهَ جَلَّ وَ عَزَّ وَ لَا تَأْكُلُوا مِنَ السَّمَكِ إِلَّا مَا كَانَ لَهُ قِشْرٌ وَ مَعَ الْقِشْرِ فُلُوسٌ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى مَسَخَ سَبْعَمِائَةِ أُمَّةٍ عَصَوُا الْأَوْصِيَاءَ بَعْدَ الرُّسُلِ فَأَخَذَ أَرْبَعُمِائَةٍ مِنْهُمْ بَرّاً وَ ثَلَاثُمِائَةٍ بَحْراً ", "ثُمَّ تَلَا هَذِهِ الْآيَةَ فَجَعَلْناهُمْ أَحادِيثَ وَ مَزَّقْناهُمْ كُلَّ مُمَزَّقٍ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Bastaam Bin Murra, from Is’haq in Hassan, from Haysam Bin Waqid, from Ali Bin Al Hassan Al Abady, from Abu Haroun, ", "(It has been narrated) from Abu Saeed Al-Khudry who was asked, ‘What is your word regarding this fish which our brethren from the people of Al-Kufa are alleging that it is Prohibited?’ So Abu Saeed said, ‘I heard Rasool-Allah<sup>saww</sup> saying: ‘Al-Kufa is the skull of the Arabs and spear of Allah<sup>azwj</sup> Blessed and High, and a treasure-hoard of faith, therefore take from them. I am informing you that Rasool-Allah<sup>saww</sup> remained at Makkah for a day and a night, hungry. Then he<sup>saww</sup> went out and we went out with him<sup>saww</sup>. So we passed by some friends who were seated eating lunch. So they said, ‘O Rasool-Allah<sup>saww</sup>! The lunch!’ So he<sup>saww</sup> said to them: ‘Yes, make way for your Prophet<sup>saww</sup>’. ", "So he<sup>saww</sup> sat down in between two men, and I sat down, and we took a loaf and broke it in half. Then he<sup>saww</sup> looked at their sauce, so he<sup>saww</sup> said: ‘What is this sauce of yours?’ So they said, ‘The sea bass, O Rasool-Allah<sup>saww</sup>!’ So he<sup>saww</sup> threw down the piece from his<sup>saww</sup> hand and arose. ", "Abu Saeed said, ‘And I stayed behind after it in order to view what the opinion of the people was. So the people differed regarding what was between them. A group said, ‘Rasool-Allah<sup>saww</sup> has Prohibited the sea bass’, and a group said, ‘He did not Prohibit it, but excused (himself<sup>saww</sup> from) it, for had he Prohibited it, he<sup>saww</sup> would have forbidden us from eating it’. So I memorised their discussion and followed Rasool-Allah<sup>saww</sup> trotting until I caught up with him<sup>saww</sup>. ", "Then we came to other friends eating lunch, so they said, ‘O Rasool-Allah<sup>saww</sup>! The lunch!’ So he<sup>saww</sup> said: ‘Yes, make way for your Prophet<sup>saww</sup>’. So he<sup>saww</sup> sat in between two men, and I sat down along with him<sup>saww</sup>. So when he<sup>saww</sup> took a piece, he<sup>saww</sup> looked at the sauce of the people, so he<sup>saww</sup> said: ‘What is this sauce of yours?’ They said, ‘Lizard, O Rasool-Allah<sup>saww</sup>!’ So he<sup>saww</sup> threw down the piece and arose.", "Abu Saeed said, ‘So I stayed behind afterwards, so the people were divided into two sects. So a sect said, Rasool-Allah<sup>saww</sup> Prohibited it, therefore from now onwards, we should not be eating it’. And the other sect said, ‘But rather, he<sup>saww</sup> excused (himself<sup>saww</sup> from) it, but had he<sup>saww</sup> Prohibited it, he<sup>saww</sup> would have forbidden us from eating it’. Then I followed Rasool-Allah<sup>saww</sup> until I caught up with him<sup>saww</sup>.", "So we passed by the base of the (mount) Safa, and at it were cooking pots, boiling. So they said, ‘O Rasool-Allah<sup>saww</sup>! If only you<sup>saww</sup> would stop by us until our pots are ready (with the meal)’. So he<sup>saww</sup> said to them: ‘What is in your pots?’ So they said, ‘A donkey of ours we were riding upon, and it stalled, so we slaughtered it’. So Rasool-Allah<sup>saww</sup> approached the cooking pots, so he<sup>saww</sup> thwacked it by his<sup>saww</sup> leg. Then he<sup>saww</sup> went away hurriedly, and I remained behind after it. So some of them said, ‘Rasool-Allah<sup>saww</sup> Prohibited the flesh of the donkey’, and some of them said, ‘Never! But rather, he<sup>saww</sup> destroyed your cooking pots until you would not repeat slaughtering your rides’. ", "Abu Saeed said, ‘So Rasool-Allah<sup>saww</sup> sent for me, so when I went over to him<sup>saww</sup>, he<sup>saww</sup> said: ‘O Abu Saeed! Call Bilal over for me<sup>saww</sup>’. So when Bilal came over, he<sup>saww</sup> said: ‘O Bilal! Ascend Abu Qubays, so call out upon it that Rasool-Allah<sup>saww</sup> has Prohibited the sea bass, and the lizard, and the domesticated donkeys. Indeed! Fear Allah<sup>azwj</sup> Mighty and Majestic and do not eat from the fish except what has peels for it, and with the peel being scales, for Allah<sup>azwj</sup> Blessed and High Morphed seven hundred communities who disobeyed the successor<sup>as</sup> after the Rasool<sup>saww</sup>, so four hundred of them were seized by the land, and three hundred of them were seized by the sea. ", "Then he<sup>saww</sup> recited this Verse <span class=\"ibTxt\">[34:19] so We Made them as folklore and scattered them with a disintegration</span>’."]}}, {"index": 11322, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي عَبْدِ اللَّهِ ع قَالَ كُلُّ ذِي نَابٍ مِنَ السِّبَاعِ وَ مِخْلَبٍ مِنَ الطَّيْرِ حَرَامٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Dawood Bin Farqad, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘All the ones with fangs (pointed teeth) from the predatory animals, and claws from the birds, are Prohibited’."]}}, {"index": 11323, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ كُلُّ ذِي نَابٍ مِنَ السِّبَاعِ وَ مِخْلَبٍ مِنَ الطَّيْرِ حَرَامٌ وَ قَالَ ( عليه السلام ) لَا تَأْكُلْ مِنَ السِّبَاعِ شَيْئاً."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Ibn Abu Umeyr, from Hammad, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘All the ones with fangs from the predatory animals, and claws from the birds, are Prohibited’. And he<sup>saww</sup> said: ‘Do not eat anything from the predators’."]}}, {"index": 11324, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنِ الْحُسَيْنِ بْنِ خَالِدٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ يَعْنِي مُوسَى بْنَ جَعْفَرٍ ( عليه السلام ) أَ يَحِلُّ أَكْلُ لَحْمِ الْفِيلِ فَقَالَ لَا قُلْتُ وَ لِمَ قَالَ ( عليه السلام ) لِأَنَّهُ مَثُلَةٌ وَ قَدْ حَرَّمَ اللَّهُ عَزَّ وَ جَلَّ الْأَمْسَاخَ وَ لَحْمَ مَا مُثِّلَ بِهِ فِي صُوَرِهَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, form his father, from Amro Bin Usman, from Al Husayn Bin Khalid who said, ", "‘I said to Abu Al-Hassan<sup>asws</sup>, meaning Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>, ‘Is it Permissible to eat the meat of the elephant?’ So he<sup>asws</sup> said: ‘No’. I said, ‘And why?’ He<sup>asws</sup> said: ‘Because it is a resemblance, and Allah<sup>azwj</sup> Mighty and Majestic has Prohibited the morphed ones, and the meat of what has been transformed by it in its image’."]}}, {"index": 11325, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ أَكْلِ الضَّبِّ فَقَالَ إِنَّ الضَّبَّ وَ الْفَأْرَةَ وَ الْقِرَدَةَ وَ الْخَنَازِيرَ مُسُوخٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about eating the lizard. So he<sup>asws</sup> said: ‘The lizard, and the mouse, and the monkey, and the pigs, are morphed (creatures)’."]}}, {"index": 11326, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي سَهْلٍ الْقُرَشِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ لَحْمِ الْكَلْبِ فَقَالَ هُوَ مَسْخٌ قُلْتُ هُوَ حَرَامٌ قَالَ هُوَ نَجَسٌ أُعِيدُهَا عَلَيْهِ ثَلَاثَ مَرَّاتٍ كُلَّ ذَلِكَ يَقُولُ هُوَ نَجَسٌ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ibn Abu Najran, from Aasim Bin Humeyd, from Abu Sahl Al Qurshy who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about meat of the dog. So he<sup>asws</sup> said: ‘It is a morphed (creature)’. I said, ‘It is Prohibited?’ He<sup>asws</sup> said: ‘It is unclean’. I re-iterated over it three times, during each of that he<sup>asws</sup> was saying: ‘It is unclean’."]}}, {"index": 11327, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ كَرِهَ أَكْلَ كُلِّ ذِي حُمَةٍ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Gayas Bin Ibrahim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having disliked eating all those with a sting (scorpion etc.)’."]}}, {"index": 11328, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:8", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْغُرَابِ الْأَبْقَعِ وَ الْأَسْوَدِ أَ يَحِلُّ أَكْلُهُمَا فَقَالَ لَا يَحِلُّ أَكْلُ شَيْ‏ءٍ مِنَ الْغِرْبَانِ زَاغٍ وَ لَا غَيْرِهِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Al Amraky Bin Ali, ", "(It has been narrated) from Ali son of Ja’far<sup style=\"font-weight: normal\">asws</sup>, from his brother<sup style=\"font-weight: normal\">asws</sup> Abu Al-Hassan<sup style=\"font-weight: normal\">asws</sup>, said, ‘I asked him<sup style=\"font-weight: normal\">asws</sup> about the speckled crows. And the black ones, is it to eat these two?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘It is not Permissible to anything from the crows, ravens and others’."]}}, {"index": 11329, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:9", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ الطَّاوُسُ لَا يَحِلُّ أَكْلُهُ وَ لَا بَيْضُهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Bakr Bin Salih, from Suleyman Al Ja’fary, ", "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘The peacock, it is not Permissible to eat it nor its eggs’."]}}, {"index": 11330, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:10", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ وَ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُمَا سَأَلَاهُ عَنْ أَكْلِ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ قَالَ نَهَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْهَا وَ عَنْ أَكْلِهَا يَوْمَ خَيْبَرَ وَ إِنَّمَا نَهَى عَنْ أَكْلِهَا فِي ذَلِكَ الْوَقْتِ لِأَنَّهَا كَانَتْ حَمُولَةَ النَّاسِ وَ إِنَّمَا الْحَرَامُ مَا حَرَّمَ اللَّهُ عَزَّ وَ جَلَّ فِي الْقُرْآنِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeur, from Umar Bin Azina, from Muhammad Bin Muslim and Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>, both having asked him<sup>asws</sup> about eating the meat of the domesticated donkeys. He<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> forbade from it, and from eating it on the day of Khyber. But rather, he<sup>saww</sup> forbade from eating it during that time because it was a carrier of the people, and rather a Prohibition is what Allah<sup>azwj</sup> Mighty and Majestic Prohibited in the Quran’."]}}, {"index": 11331, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:11", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ الْمُسْلِمِينَ كَانُوا أَجْهَدُوا فِي خَيْبَرَ فَأَسْرَعَ الْمُسْلِمُونَ فِي دَوَابِّهِمْ فَأَمَرَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِإِكْفَاءِ الْقُدُورِ وَ لَمْ يَقُلْ إِنَّهَا حَرَامٌ وَ كَانَ ذَلِكَ إِبْقَاءً عَلَى الدَّوَابِّ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Abu Al Jaroud, ", "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup>, said, ‘I heard him<sup style=\"font-weight: normal\">asws</sup> saying that the Muslims were exhausted in Khyber, so were quick with regards to their animals. So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> ordered them with restraint of the cooking-pots (from these animals), and did not say that these are Prohibited, and that was a preservation upon the animals’."]}}, {"index": 11332, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:12", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ تَغْلِبَ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ لُحُومِ الْخَيْلِ فَقَالَ لَا تَأْكُلْ إِلَّا أَنْ تُصِيبَكَ ضَرُورَةٌ وَ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ فَقَالَ فِي كِتَابِ عَلِيٍّ ( عليه السلام ) أَنَّهُ مَنَعَ أَكْلَهَا."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Aban Bin Taghlub, from the one who informed him, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about meat of the cavalry horse. So he<sup>asws</sup> said: ‘Do not eat except if you are hit by necessity, and meat of the domesticated donkeys’ He<sup>asws</sup> said: ‘In the Book of Ali<sup>asws</sup> it is Forbidden to eat it’."]}}, {"index": 11333, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:13", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ لُحُومِ الْحَمِيرِ فَقَالَ نَهَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْ أَكْلِهَا يَوْمَ خَيْبَرَ ", "قَالَ وَ سَأَلْتُهُ عَنْ أَكْلِ الْخَيْلِ وَ الْبِغَالِ فَقَالَ نَهَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْهَا فَلَا تَأْكُلُوهَا إِلَّا أَنْ تُضْطَرُّوا إِلَيْهَا ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Ibn Muskan who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about meat of the donkeys. So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> forbade from eating it on the day of Khyber’. ", "He (the narrator) said, ‘And I asked him<sup>asws</sup> about eating the cavalry horse, and the mules. So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> forbade from it, therefore do not eat it, except if you are desperate for it’."]}}, {"index": 11334, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:14", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ الْأَشْعَرِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ الْفِيلُ مَسْخٌ كَانَ مَلِكاً زَنَّاءً وَ الذِّئْبُ مَسْخٌ كَانَ أَعْرَابِيّاً دَيُّوثاً وَ الْأَرْنَبُ مَسْخٌ كَانَتِ امْرَأَةً تَخُونُ زَوْجَهَا وَ لَا تَغْتَسِلُ مِنْ حَيْضِهَا وَ الْوَطْوَاطُ مَسْخٌ كَانَ يَسْرِقُ تُمُورَ النَّاسِ وَ الْقِرَدَةُ وَ الْخَنَازِيرُ قَوْمٌ مِنْ بَنِي إِسْرَائِيلَ اعْتَدَوْا فِي السَّبْتِ وَ الْجِرِّيثُ وَ الضَّبُّ فِرْقَةٌ مِنْ بَنِي إِسْرَائِيلَ لَمْ يُؤْمِنُوا حَيْثُ نَزَلَتِ الْمَائِدَةُ عَلَى عِيسَى ابْنِ مَرْيَمَ ( عليه السلام ) فَتَاهُوا فَوَقَعَتْ فِرْقَةٌ فِي الْبَحْرِ وَ فِرْقَةٌ فِي الْبَرِّ وَ الْفَأْرَةُ فَهِيَ الْفُوَيْسِقَةُ وَ الْعَقْرَبُ كَانَ نَمَّاماً وَ الدُّبُّ وَ الزُّنْبُورُ كَانَتْ لَحَّاماً يَسْرِقُ فِي الْمِيزَانِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yaya, from Ahmad Bin Muhammad, from Muhammad Bin Al Hassan Al Ashary, ", "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘The elephant is a morphed (creature), it was an adulterous king; and the wolf was morphed, it was a Bedouin pimp; and the rabbit was morphed, it was a woman who betrayed her husband, and did not wash from her menstruations; and the bat was morphed, it was (a thief) stealing dates of the people; and the monkey and the pigs were a people from the Children of Israel, having exceeded in the Sabbath; and the sea bass and the lizard were a sect from the Children of Israel who did not believe when the meal was descended upon Isa<sup>as</sup> Bin Maryam<sup>as</sup>, so they strayed and a sect fell into the sea, and a sect in the land; and the mouse, so it was an immoral woman; and the scorpion was a malicious gossiper; and the bear and the wasp were butchers who used to steal (cheat) in the weighing’."]}}, {"index": 11335, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:15", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي يَحْيَى الْوَاسِطِيِّ قَالَ سُئِلَ الرِّضَا ( عليه السلام ) عَنِ الْغُرَابِ الْأَبْقَعِ فَقَالَ إِنَّهُ لَا يُؤْكَلُ وَ قَالَ وَ مَنْ أَحَلَّ لَكَ الْأَسْوَدَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Muslim, from Abu Yahya Al Wasity who said, ", "‘(Imam) Al-Reza<sup>asws</sup> was asked about the speckled crows. So he<sup>asws</sup> said: ‘It cannot be eaten’. And he<sup>asws</sup> said: ‘And who Permitted to you, the black (crow)?’"]}}, {"index": 11336, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:6:6:2:16", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ الطَّاوُسُ مَسْخٌ كَانَ رَجُلًا جَمِيلًا فَكَابَرَ امْرَأَةَ رَجُلٍ مُؤْمِنٍ تُحِبُّهُ فَوَقَعَ بِهَا ثُمَّ رَاسَلَتْهُ بَعْدُ فَمَسَخَهُمَا اللَّهُ عَزَّ وَ جَلَّ طَاوُسَيْنِ أُنْثَى وَ ذَكَراً وَ لَا يُؤْكَلُ لَحْمُهُ وَ لَا بَيْضُهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Bakr Bin Salih, from Suleyman Al Ja’fary, ", "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘The peacock was morphed, and it was a handsome man, so he insisted stubbornly a wife of a Believing man who loved him. So he copulated with her, then (she) sent messages to him (inviting him) afterwards. So Allah<sup>azwj</sup> Mighty and Majestic Morphed both of them as peacocks, female and male, and neither eat their meats, nor their eggs’."]}}]}, "index": "al-kafi:6:6:2", "kind": "verse_list"}