{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 6"}, "path": "/books/al-kafi:6:6", "titles": {"ar": "كتاب الْأَطْعِمَةِ", "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "}}, {"indexed_titles": {"en": "Chapter 23"}, "path": "/books/al-kafi:6:6:23", "titles": {"ar": "باب الْأَكْلِ مُتَّكِئاً", "en": "Chapter 23 – Eating whilst leaning"}}], "index": 1749, "local_index": 23, "part_type": "Chapter", "path": "/books/al-kafi:6:6:23", "titles": {"ar": "باب الْأَكْلِ مُتَّكِئاً", "en": "Chapter 23 – Eating whilst leaning"}, "verse_count": 10, "verse_start_index": 11437, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 11438, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:6:23:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زَيْدٍ الشَّحَّامِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا أَكَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مُتَّكِئاً مُنْذُ بَعَثَهُ اللَّهُ عَزَّ وَ جَلَّ إِلَى أَنْ قَبَضَهُ وَ كَانَ يَأْكُلُ إِكْلَةَ الْعَبْدِ وَ يَجْلِسُ جِلْسَةَ الْعَبْدِ قُلْتُ وَ لِمَ ذَلِكَ قَالَ تَوَاضُعاً لِلَّهِ عَزَّ وَ جَلَّ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Washa, from Aban Bin Usman, from Zayd Al Shahaam, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> did not eat whilst leaning since Allah<sup>azwj</sup> Mighty and Majestic Sent him until he<sup>saww</sup> passed away, and he<sup>saww</sup> used to eat the eating of the slave, and he<sup>saww</sup> would sit the seating of a slave’. I said, ‘And why was that?’ He<sup>asws</sup> said: ‘In reverence to Allah<sup>azwj</sup> Mighty and Majestic’."]}}, {"index": 11439, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:6:23:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنِ الْحَسَنِ الصَّيْقَلِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَرَّتِ امْرَأَةٌ بَذِيَّةٌ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ يَأْكُلُ وَ هُوَ جَالِسٌ عَلَى الْحَضِيضِ فَقَالَتْ يَا مُحَمَّدُ إِنَّكَ لَتَأْكُلُ أَكْلَ الْعَبْدِ وَ تَجْلِسُ جُلُوسَهُ فَقَالَ لَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنِّي عَبْدٌ وَ أَيُّ عَبْدٍ أَعْبَدُ مِنِّي قَالَتْ فَنَاوِلْنِي لُقْمَةً مِنْ طَعَامِكَ فَنَاوَلَهَا فَقَالَتْ لَا وَ اللَّهِ إِلَّا الَّذِي فِي فِيكَ فَأَخْرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) اللُّقْمَةَ مِنْ فِيهِ فَنَاوَلَهَا فَأَكَلَتْهَا ", "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَمَا أَصَابَهَا بَذَاءٌ حَتَّى فَارَقَتِ الدُّنْيَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Safwan, from Ibn Muskan, from Al Hassan Al Sayqal who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘An unpleasant woman passed by Rasool-Allah<sup>saww</sup> and he<sup>saww</sup> was eating, and he<sup>saww</sup> was seated upon the low ground. So she said, ‘O Muhammad<sup>saww</sup>! You<sup>saww</sup> are eating the eating of the slave, and sitting the seating his seating’. So Rasool-Allah<sup>saww</sup> said to her: ‘I<sup>saww</sup> am a slave, and which slave is more of a slave than me<sup>saww</sup>?’ She said, ‘So give me a morsel from your<sup>saww</sup> food’. So he<sup>saww</sup> gave it to her. So she said, ‘No, by Allah<sup>azwj</sup>, except (the morsel) what is in your<sup>saww</sup> mouth’. So Rasool-Allah<sup>saww</sup> took out the morsel from his<sup>saww</sup> mouth, so gave it to her. So she ate it’. ", "Abu Abdullah<sup>asws</sup> said: ‘So there did no hit her any unpleasantness until she separated from the world’."]}}, {"index": 11440, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:6:23:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي الْمَغْرَاءِ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ يَأْكُلُ أَكْلَ الْعَبْدِ وَ يَجْلِسُ جِلْسَةَ الْعَبْدِ وَ يَعْلَمُ أَنَّهُ عَبْدٌ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abu Al Magra, from Haroun Bin Kharja, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>azwj</sup> used to eat the eating of the slave, and sitting the seating of the slave, and he<sup>saww</sup> knew he<sup>saww</sup> was a slave (of Allah<sup>azwj</sup>)’."]}}, {"index": 11441, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:6:23:4", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَأْكُلُ مُتَّكِئاً فَقَالَ لَا وَ لَا مُنْبَطِحاً ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Sama’at who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the man who ate whilst leaning, so he<sup>asws</sup> said: ‘No, and not lying facing down (as well)’."]}}, {"index": 11442, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:6:23:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي إِسْمَاعِيلَ الْبَصْرِيِّ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ كَانَ عَبَّادٌ الْبَصْرِيُّ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَأْكُلُ فَوَضَعَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَدَهُ عَلَى الْأَرْضِ فَقَالَ لَهُ عَبَّادٌ أَصْلَحَكَ اللَّهُ أَ مَا تَعْلَمُ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) نَهَى عَنْ هَذَا فَرَفَعَ يَدَهُ فَأَكَلَ ثُمَّ أَعَادَهَا أَيْضاً فَقَالَ لَهُ أَيْضاً فَرَفَعَهَا ثُمَّ أَكَلَ فَأَعَادَهَا فَقَالَ لَهُ عَبَّادٌ أَيْضاً فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا وَ اللَّهِ مَا نَهَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْ هَذَا قَطُّ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ismail Al Basry, from Al Fuzayl Bin Yasaar who said, ", "‘Abbad Al-Basry was in the presence of Abu Abdullah<sup>asws</sup>, eating. So Abu Abdullah<sup>asws</sup> placed his<sup>asws</sup> hand upon the ground. So Abbad said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! Do you<sup>asws</sup> not know that Rasool-Allah<sup>saww</sup> forbade from this?’ So he<sup>asws</sup> raised his<sup>asws</sup> hand, so he<sup>asws</sup> ate. Then he<sup>asws</sup> repeated it again. So he said to him<sup>asws</sup> again. So he<sup>asws</sup> raised it, then ate. So he<sup>asws</sup> repeated it. So Abbad said to him again. So Abu Abdullah<sup>asws</sup> said to him: ‘No, by Allah<sup>azwj</sup>! Rasool-Allah<sup>saww</sup> did not forbid from this at all’."]}}, {"index": 11443, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:6:23:6", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَأْكُلُ أَكْلَ الْعَبْدِ وَ يَجْلِسُ جِلْسَةَ الْعَبْدِ وَ كَانَ ( صلى الله عليه وآله ) يَأْكُلُ عَلَى الْحَضِيضِ وَ يَنَامُ عَلَى الْحَضِيضِ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Abdul Jabbar, from Muhammad Bin Salim, from Ahmad Bin Al nazar, from Amro Bin Shimr, from Jabir, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> was eating the eating of the slave, and sitting the seating of the slave, and he<sup>saww</sup> was eating upon the low ground, and sleeping upon the low ground’."]}}, {"index": 11444, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:6:6:23:7", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنْ أَبِي خَدِيجَةَ قَالَ سَأَلَ بَشِيرٌ الدَّهَّانُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا حَاضِرٌ فَقَالَ هَلْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَأْكُلُ مُتَّكِئاً عَلَى يَمِينِهِ وَ عَلَى يَسَارِهِ فَقَالَ مَا كَانَ رَسُولُ اللَّهِ يَأْكُلُ مُتَّكِئاً عَلَى يَمِينِهِ وَ لَا عَلَى يَسَارِهِ وَ لَكِنْ كَانَ يَجْلِسُ جِلْسَةَ الْعَبْدِ قُلْتُ وَ لِمَ ذَلِكَ قَالَ تَوَاضُعاً لِلَّهِ عَزَّ وَ جَلَّ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moala Bin Mhammad, from Al Hassan Bin Ali, from Ahmad Bin A’iz, from Abu Khadeeja who said, ", "‘Bashir Al-Dahhan asked Abu Abdullah<sup>asws</sup>, and I was present, so he said, ‘Did Rasool-Allah<sup>saww</sup> used to eat whilst leaning upon his<sup>saww</sup> right, and upon his<sup>saww</sup> left?’ So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> was not eating leaning upon his<sup>saww</sup> right and upon his<sup>saww</sup> left, but he<sup>saww</sup> was sitting the seating of the slave’. I said, ‘And why was that?’ He<sup>asws</sup> said: ‘As a reverence to Allah<sup>azwj</sup> Mighty and Majestic’."]}}, {"index": 11445, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:6:6:23:8", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ مُعَلَّى بْنِ عُثْمَانَ عَنْ مُعَلَّى بْنِ خُنَيْسٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا أَكَلَ نَبِيُّ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ مُتَّكِئٌ مُنْذُ بَعَثَهُ اللَّهُ عَزَّ وَ جَلَّ وَ كَانَ يَكْرَهُ أَنْ يَتَشَبَّهَ بِالْمُلُوكِ وَ نَحْنُ لَا نَسْتَطِيعُ أَنْ نَفْعَلَ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Moala Bin Usman, from Moala Bin Khunays who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘The Prophet<sup>saww</sup> of Allah<sup>azwj</sup> did not eat whilst leaning since Allah<sup>azwj</sup> Mighty and Majestic Sent him<sup>saww</sup>, and he<sup>saww</sup> disliked that he<sup>saww</sup> resembles with the kings, and we (the public) are not able that we do it’."]}}, {"index": 11446, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:6:6:23:9", "text": ["قَالَ وَ قَالَ مَا أَكَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ مُتَّكِئٌ قَطُّ ."], "translations": {"en.hubeali": ["He (the narrator) said, ‘And he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> did not eat whilst he<sup>saww</sup> was leaning, at all’."]}}, {"index": 11447, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:6:6:23:10", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا جَلَسَ أَحَدُكُمْ عَلَى الطَّعَامِ فَلْيَجْلِسْ جِلْسَةَ الْعَبْدِ وَ لَا يَضَعَنَّ أَحَدُكُمْ إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى وَ لَا يَتَرَبَّعْ فَإِنَّهَا جِلْسَةٌ يُبْغِضُهَا اللَّهُ عَزَّ وَ جَلَّ وَ يَمْقُتُ صَاحِبَهَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘When one of you sits upon the meal, so let him sit a seating of the slave, nor should one of you push down his leg upon another, nor cross-legged, for it is a seating hateful to Allah<sup>azwj</sup> Mighty and Majestic and He<sup>azwj</sup> Detests its doer’."]}}]}, "index": "al-kafi:6:6:23", "kind": "verse_list"}