{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 6"}, "path": "/books/al-kafi:6:6", "titles": {"ar": "كتاب الْأَطْعِمَةِ", "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "}}, {"indexed_titles": {"en": "Chapter 29"}, "path": "/books/al-kafi:6:6:29", "titles": {"ar": "باب الْعَرْضِ", "en": "Chapter 29 – The Offering (a meal)"}}], "index": 1755, "local_index": 29, "part_type": "Chapter", "path": "/books/al-kafi:6:6:29", "titles": {"ar": "باب الْعَرْضِ", "en": "Chapter 29 – The Offering (a meal)"}, "verse_count": 2, "verse_start_index": 11461, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 11462, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:6:29:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاشَانِيِّ عَنْ أَبِي أَيُّوبَ سُلَيْمَانَ بْنِ مُقَاتِلٍ الْمَدِينِيِّ عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْجَعْفَرِيِّ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ فِي بَعْضِ مَغَازِيهِ فَمَرَّ بِهِ رَكْبٌ وَ هُوَ يُصَلِّي فَوَقَفُوا عَلَى أَصْحَابِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ سَاءَلُوهُمْ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ دَعَوْا وَ أَثْنَوْا وَ قَالُوا لَوْ لَا أَنَّا عِجَالٌ لَانْتَظَرْنَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَأَقْرِءُوهُ مِنَّا السَّلَامَ وَ مَضَوْا ", "فَأَقْبَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مُغْضَباً ثُمَّ قَالَ لَهُمْ يَقِفُ عَلَيْكُمُ الرَّكْبُ وَ يَسْأَلُونَكُمْ عَنِّي وَ يُبَلِّغُونِّي السَّلَامَ وَ لَا تَعْرِضُونَ عَلَيْهِمُ الْغَدَاءَ لَيَعِزُّ عَلَى قَوْمٍ فِيهِمْ خَلِيلِي جَعْفَرٌ أَنْ يَجُوزُوهُ حَتَّى يَتَغَدَّوْا عِنْدَهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ali Bin Muhammad Al Qashany, from Abu Ayoub Suleyman Bin Muqatal Al Madainy, from Dawood Bin Abdullah Bin Muhammad Al Ja’fary, from his father that, ", "‘Rasool-Allah<sup>saww</sup> was in one of his<sup>saww</sup> military expeditions, so riders passed by whilst he<sup>saww</sup> was Praying. So they paused by the companions of Rasool-Allah<sup>saww</sup> and asked them about Rasool-Allah<sup>saww</sup>, a supplicated and praised, and they said, ‘No, had we not been in a hurry we would have awaited Rasool-Allah<sup>saww</sup>, therefore convey our greetings from us’. And they went away.", "So Rasool-Allah<sup>saww</sup> came back in anger, then said to them: ‘The riders paused by you and they asked you about me<sup>saww</sup>, delivered the greeting to me, and you did not offer the lunch to them. Had there been among a people my<sup>saww</sup> dear friend Ja’far<sup>as</sup>, he<sup>as</sup> would not have allowed it (them to leave) until they would have had lunch with him’."]}}, {"index": 11463, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:6:29:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عِدَّةٍ رَفَعُوهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا دَخَلَ عَلَيْكَ أَخُوكَ فَاعْرِضْ عَلَيْهِ الطَّعَامَ فَإِنْ لَمْ يَأْكُلْ فَاعْرِضْ عَلَيْهِ الْمَاءَ فَإِنْ لَمْ يَشْرَبْ فَاعْرِضْ عَلَيْهِ الْوَضُوءَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from a number, ", "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup> having said: ‘When your brother comes over to you, so offer the food to him. So if he does not eat, so offer the water to him. So if he does not drink, so offer the ablution to him’."]}}]}, "index": "al-kafi:6:6:29", "kind": "verse_list"}