{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 6"}, "path": "/books/al-kafi:6:6", "titles": {"ar": "كتاب الْأَطْعِمَةِ", "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "}}, {"indexed_titles": {"en": "Chapter 32"}, "path": "/books/al-kafi:6:6:32", "titles": {"ar": "باب", "en": "Chapter 32 – A Chapter"}}], "index": 1758, "local_index": 32, "part_type": "Chapter", "path": "/books/al-kafi:6:6:32", "titles": {"ar": "باب", "en": "Chapter 32 – A Chapter"}, "verse_count": 6, "verse_start_index": 11474, "verses": [{"index": 11475, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:6:32:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ قَالَ دَخَلْنَا مَعَ ابْنِ أَبِي يَعْفُورٍ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ نَحْنُ جَمَاعَةٌ فَدَعَا بِالْغَدَاءِ فَتَغَدَّيْنَا وَ تَغَدَّى مَعَنَا وَ كُنْتُ أَحْدَثَ الْقَوْمِ سِنّاً فَجَعَلْتُ أَقْصُرُ وَ أَنَا آكُلُ فَقَالَ لِي كُلْ أَ مَا عَلِمْتَ أَنَّهُ تُعْرَفُ مَوَدَّةُ الرَّجُلِ لِأَخِيهِ بِأَكْلِهِ مِنْ طَعَامِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, form his father, from Ibn Abu Umeyr, from Hisham Bin Salim who said, ‘We went over, along with Ibn Abu Yafour, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, and we were a group. So he<sup>asws</sup> called for the breakfast, and we had breakfast and he<sup>asws</sup> had breakfast with us, and I was the youngest of the group in age, so I was cautious in my eating. So he<sup>asws</sup> said to me: ‘Eat (well)! Do you not know that the cordiality of the man for his brother is recognised by his eating from his food?’"}]}, {"index": 11476, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:6:32:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ رَجُلٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ أَكَلْنَا مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَأُوتِينَا بِقَصْعَةٍ مِنْ أَرُزٍّ فَجَعَلْنَا نُعَذِّرُ فَقَالَ ( عليه السلام ) مَا صَنَعْتُمْ شَيْئاً إِنَّ أَشَدَّكُمْ حُبّاً لَنَا أَحْسَنُكُمْ أَكْلًا عِنْدَنَا \nقَالَ عَبْدُ الرَّحْمَنِ فَرَفَعْتُ كُسْحَةَ الْمَائِدَةِ فَأَكَلْتُ فَقَالَ نَعَمْ الْآنَ وَ أَنْشَأَ يُحَدِّثُنَا أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أُهْدِيَ إِلَيْهِ قَصْعَةُ أَرُزٍّ مِنْ نَاحِيَةِ الْأَنْصَارِ فَدَعَا سَلْمَانَ وَ الْمِقْدَادَ وَ أَبَا ذَرٍّ رَضِيَ اللَّهُ عَنْهُمْ فَجَعَلُوا يُعَذِّرُونَ فِي الْأَكْلِ فَقَالَ مَا صَنَعْتُمْ شَيْئاً أَشَدُّكُمْ حُبّاً لَنَا أَحْسَنُكُمْ أَكْلًا عِنْدَنَا فَجَعَلُوا يَأْكُلُونَ أَكْلًا جَيِّداً \nثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) رَحِمَهُمُ اللَّهُ وَ رَضِيَ اللَّهُ عَنْهُمْ وَ صَلَّى عَلَيْهِمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Umar Bin Abdul Aziz, from a man from Abdul Rahman Bin Al Hajjaj who said, \n‘We ate with Abu Abdullah<sup>asws</sup>, and we were brought a bowl of rice. So we went on excusing ourselves, so he<sup>asws</sup> said: ‘What thing are you doing? The one of you with the most intense love for us<sup>asws</sup>, is the best of you in eating with us<sup>asws</sup>’.  \nAbdul Rahman (the narrator) said, ‘So I raised the covering of the meal, so I ate. So he<sup>asws</sup> said: ‘Yes, now’, and he<sup>asws</sup> started narrating that: ‘Rasool-Allah<sup>saww</sup> was gifted a bowl of rice from the area of the Helpers. So he<sup>saww</sup> called over Salman<sup>as</sup>, and Al-Miqdad<sup>as</sup>, and Abu Dharr<sup>as</sup>, may Allah<sup>azwj</sup> be Pleased with them<sup>as</sup>. So they went on excusing themselves regarding the eating. So he<sup>saww</sup> said: ‘What thing are you<sup>as</sup> doing? The most intense of you<sup>as</sup> all in love for us<sup>saww</sup> is the best of you<sup>as</sup> all in eating with us<sup>asws</sup>’. So they went on to eat well’.  \nThen Abu Abdullah<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> have Mercy on them<sup>ra</sup>, and may Allah<sup>azwj</sup> be Pleased with them<sup>ra</sup>, and Send Blessings upon them<sup>as</sup>’."}]}, {"index": 11477, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:6:32:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ عِيسَى بْنِ أَبِي مَنْصُورٍ قَالَ أَكَلْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَجَعَلَ يُلْقِي بَيْنَ يَدَيَّ الشِّوَاءَ ثُمَّ قَالَ يَا عِيسَى إِنَّهُ يُقَالُ اعْتَبِرْ حُبَّ الرَّجُلِ بِأَكْلِهِ مِنْ طَعَامِ أَخِيهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mhaboub, from Yunus Bin Yaqoub, from isa Bin Abu Mansour who said, \n‘I ate in the presence of Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> went on to place the roast in front of me, then said: ‘O Isa! Determine the love of the man by his eating from the food of his brother’."}]}, {"index": 11478, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:6:32:4", "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عِدَّةٍ مِنْ أَصْحَابِهِ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ الصَّيْرَفِيِّ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَدَّمَ إِلَيْنَا طَعَاماً فِيهِ شِوَاءٌ وَ أَشْيَاءَ بَعْدَهُ ثُمَّ جَاءَ بِقَصْعَةٍ فِيهَا أَرُزٌّ فَأَكَلْتُ مَعَهُ فَقَالَ كُلْ قُلْتُ قَدْ أَكَلْتُ فَقَالَ كُلْ فَإِنَّهُ يُعْتَبَرُ حُبُّ الرَّجُلِ لِأَخِيهِ بِانْبِسَاطِهِ فِي طَعَامِهِ ثُمَّ حَازَ لِي حَوْزاً بِإِصْبَعِهِ مِنَ الْقَصْعَةِ فَقَالَ لِي لَتَأْكُلَنَّ ذَا بَعْدَ مَا قَدْ أَكَلْتَ فَأَكَلْتُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad Bin Bundr, from Ahmad Bin Abu Abdullah, from a number of our companions, from Yunus Bin Yaqoub, from Abdullah Bin Suleyman Al Sayrafi who said, \n‘I was in the presence of Abu Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> forwarded some food towards us in which was a roast and some things after it. Then he<sup>asws</sup> came over with a bowl in which was rice. So I ate with him<sup>asws</sup>. So he<sup>asws</sup> said: ‘Eat’. I said, ‘I have eaten’. So he<sup>asws</sup> said: ‘Eat, for the determination of the love of the man for his brother by his extension in his eating’. Then he<sup>asws</sup> marked for me a marking by his<sup>asws</sup> finger in the bowl, so he<sup>asws</sup> said to me: ‘You should eat (up to) that’, after I had already eaten. So I ate it’."}]}, {"index": 11479, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:6:32:5", "text": "أَحْمَدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي الْمَغْرَاءِ الْعِجْلِيِّ قَالَ حَدَّثَنِي عَنْبَسَةُ بْنُ مُصْعَبٍ قَالَ أَتَيْنَا أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ هُوَ يُرِيدُ الْخُرُوجَ إِلَى مَكَّةَ فَأَمَرَ بِسُفْرَةٍ فَوُضِعَتْ بَيْنَ أَيْدِينَا فَقَالَ كُلُوا فَأَكَلْنَا فَقَالَ أَثْبَتُّمْ أَثْبَتُّمْ إِنَّهُ كَانَ يُقَالُ اعْتَبِرْ حُبَّ الْقَوْمِ بِأَكْلِهِمْ \nقَالَ فَأَكَلْنَا وَ قَدْ ذَهَبَتِ الْحِشْمَةُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Abu Abdullah, from Ismail Bin Mihran, from Sayf Bin Umeyra, from Abu Magra Al Ijaly, from Anbasa Bin Mus’ab who said, \n‘We went over to Abu Abdullah<sup>asws</sup> and he<sup>asws</sup> intended to go out to Makkah, so he<sup>asws</sup> ordered for the meal, and it was placed in front of us. So he<sup>asws</sup> said; ‘Eat’. So we ate, and he<sup>asws</sup> said: ‘You have confirmed, you have confirmed! It was said that the determination of the love of the people is by their eating’. \nHe (the narrator) said, ‘So we ate, and the modesty was gone’."}]}, {"index": 11480, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:6:32:6", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ يُونُسَ عَنْ أَبِي الرَّبِيعِ قَالَ دَعَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بِطَعَامٍ فَأُتِيَ بِهَرِيسَةٍ فَقَالَ لَنَا ادْنُوا فَكُلُوا قَالَ فَأَقْبَلَ الْقَوْمُ يَقْصُرُونَ فَقَالَ ( عليه السلام ) كُلُوا فَإِنَّمَا يَسْتَبِينُ مَوَدَّةُ الرَّجُلِ لِأَخِيهِ فِي أَكْلِهِ عِنْدَهُ قَالَ فَأَقْبَلْنَا نُغِصُّ أَنْفُسَنَا كَمَا تَغَصُّ الْإِبِلُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali, from Yunus, from Abu Al Rabie who said, \n‘Abu Abdullah<sup>asws</sup> called for the meal, so they came with mash. So he<sup>asws</sup> said to us: ‘Approach, so eat’. So the group went on being reserve. So he<sup>asws</sup> said: ‘Eat, for the warmth of the man for his brother is manifested in his eating with him’. So we went on to gorge ourselves like the gorging of the camels’."}]}]}, "index": "al-kafi:6:6:32", "kind": "verse_list"}