{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 6"}, "path": "/books/al-kafi:6:6", "titles": {"ar": "كتاب الْأَطْعِمَةِ", "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "}}, {"indexed_titles": {"en": "Chapter 37"}, "path": "/books/al-kafi:6:6:37", "titles": {"ar": "باب كَرَاهِيَةِ اسْتِخْدَامِ الضَّيْفِ", "en": "Chapter 37 – Abhorrence of the guest serving"}}], "index": 1763, "local_index": 37, "part_type": "Chapter", "path": "/books/al-kafi:6:6:37", "titles": {"ar": "باب كَرَاهِيَةِ اسْتِخْدَامِ الضَّيْفِ", "en": "Chapter 37 – Abhorrence of the guest serving"}, "verse_count": 3, "verse_start_index": 11496, "verses": [{"index": 11497, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:6:37:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُوسَى عَنْ ذُبْيَانَ بْنِ حَكِيمٍ عَنْ مُوسَى النُّمَيْرِيِّ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ رَأَيْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) ضَيْفاً فَقَامَ يَوْماً فِي بَعْضِ الْحَوَائِجِ فَنَهَاهُ عَنْ ذَلِكَ وَ قَامَ بِنَفْسِهِ إِلَى تِلْكَ الْحَاجَةِ وَ قَالَ ( عليه السلام ) نَهَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْ أَنْ يُسْتَخْدَمَ الضَّيْفُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Musa, from Zubyan Bin Hakeym, from Musa Al Nameyri, from Ibn Abu Yafour who said, \n‘I saw a guest in the presence of Abu Abdullah<sup>asws</sup>. So he (the guest) stood up one day regarding one of the needs. So he<sup>asws</sup> forbade him from that, and stood up himself<sup>asws</sup> to that particular need, and he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> forbade from the guest serving’."}]}, {"index": 11498, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:6:37:2", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ السَّيَّارِيِّ عَنْ عُبَيْدِ بْنِ أَبِي عَبْدِ اللَّهِ الْبَغْدَادِيِّ عَمَّنْ أَخْبَرَهُ قَالَ نَزَلَ بِأَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) ضَيْفٌ وَ كَانَ جَالِساً عِنْدَهُ يُحَدِّثُهُ فِي بَعْضِ اللَّيْلِ فَتَغَيَّرَ السِّرَاجُ فَمَدَّ الرَّجُلُ يَدَهُ لِيُصْلِحَهُ فَزَبَرَهُ أَبُو الْحَسَنِ ( عليه السلام ) ثُمَّ بَادَرَهُ بِنَفْسِهِ فَأَصْلَحَهُ ثُمَّ قَالَ لَهُ إِنَّا قَوْمٌ لَا نَسْتَخْدِمُ أَضْيَافَنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Al Sayyari, from Ubeyd Bin Abu Abdullah Al Baghdady, from the one who informed him, said, \n‘A guest had lodge with Abu Al-Hassan Al-Reza<sup>asws</sup>, and was seated in his<sup>asws</sup> presence discussing with him<sup>asws</sup> in one of the nights. So the lantern dimmed, and the man extended his hand to correct it. So Abu Al-Hassan<sup>asws</sup> stopped him, then attended to it himself<sup>asws</sup>, so he<sup>asws</sup> corrected it. Then he<sup>asws</sup> said to him: ‘We<sup>asws</sup> are a people who do not make our<sup>asws</sup> gests to serve’."}]}, {"index": 11499, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:6:37:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُوسَى عَنْ ذُبْيَانَ بْنِ حَكِيمٍ عَنْ مُوسَى بْنِ أُكَيْلٍ النُّمَيْرِيِّ عَنْ مَيْسَرَةَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ مِنَ التَّضْعِيفِ تَرْكَ الْمُكَافَأَةِ وَ مِنَ الْجَفَاءِ اسْتِخْدَامَ الضَّيْفِ فَإِذَا نَزَلَ بِكُمُ الضَّيْفُ فَأَعِينُوهُ وَ إِذَا ارْتَحَلَ فَلَا تُعِينُوهُ فَإِنَّهُ مِنَ النَّذَالَةِ وَ زَوِّدُوهُ وَ طَيِّبُوا زَادَهُ فَإِنَّهُ مِنَ السَّخَاءِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Musa, from Zubyan Bin Hakeym, from Musa Bin Akeyl Al Nameyri, from Maysara who said, \n‘Abu Ja’far<sup>asws</sup> said: ‘It is from the weaknesses, neglect of the rewards, and from the disloyalty, making the guest to serve. So when the guest lodges with you, so aid him, and when he departs, so do not aid him in it (his departure), for it is from the lowness, and provide for him, and make good his provision, for it is from the generosity’."}]}]}, "index": "al-kafi:6:6:37", "kind": "verse_list"}