{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:6:6",
        "titles": {
          "ar": "كتاب الْأَطْعِمَةِ",
          "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 49"
        },
        "path": "/books/al-kafi:6:6:49",
        "titles": {
          "ar": "باب أَكْلِ مَا يَسْقُطُ مِنَ الْخِوَانِ",
          "en": "Chapter 49 – Eat what falls from the food-spread"
        }
      }
    ],
    "index": 1783,
    "local_index": 49,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:6:49",
    "titles": {
      "ar": "باب أَكْلِ مَا يَسْقُطُ مِنَ الْخِوَانِ",
      "en": "Chapter 49 – Eat what falls from the food-spread"
    },
    "verse_count": 9,
    "verse_start_index": 11600,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/117)"
        ],
        "index": 11601,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:49:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) كُلُوا مَا يَسْقُطُ مِنَ الْخِوَانِ فَإِنَّهُ شِفَاءٌ مِنْ كُلِّ دَاءٍ بِإِذْنِ اللَّهِ عَزَّ وَ جَلَّ لِمَنْ أَرَادَ أَنْ يَسْتَشْفِيَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Qasim Bin yahya, form his grandfather Al Hassan Bin Rashid, form Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Eat what falls from the food-spread, for it is a healing from every illness by the Permission of Allah<sup>azwj</sup> Mighty and Majestic for the one who wants to be healed by it’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Qasim ibn Yahya from his grandfather al-Hassan ibn Rashid from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ’Eat what falls off of food, because in it is cure for all kinds of illness by the permission of Allah, most Majestic, most Glorious, for those who seek cures.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/117)"
        ],
        "index": 11602,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:49:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ دَاوُدَ بْنِ كَثِيرٍ قَالَ تَعَشَّيْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَتَمَةً فَلَمَّا فَرَغَ مِنْ عَشَائِهِ حَمِدَ اللَّهَ عَزَّ وَ جَلَّ وَ قَالَ هَذَا عَشَائِي وَ عَشَاءُ آبَائِي فَلَمَّا رُفِعَ الْخِوَانُ تَقَمَّمَ مَا سَقَطَ مِنْهُ ثُمَّ أَلْقَاهُ إِلَى فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sandy, from Ja’far Bin Bashir, from Aban Bin Usman, from Dawood Bin Kaseer who said, ",
            "‘I had dinner in the presence of Abu Abdullah<sup>asws</sup> late into the evening. So when he<sup>asws</sup> was free from his<sup>asws</sup> dinner, he<sup>asws</sup> Praised Allah<sup>azwj</sup> Mighty and Majestic and said: ‘This is my<sup>asws</sup> dinner, and a dinner of my<sup>asws</sup> forefathers<sup>asws</sup>’. So when the meal was raised, he<sup>asws</sup> proceeded to eat what had fallen from it, then cast it into his<sup>asws</sup> mouth’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from Salih ibn al-Sindiy from Ja‘far ibn Bashir from Aban ‘Uthman from Dawud ibn Kathir who has said the following: “Once I had dinner with abu ‘Abd Allah, ‘Alayhi al-Salam, at ‘Atmah (time of late evening Salat (prayer)). When he (the Imam) ended his dinner, he praised Allah, most Majestic, most Glorious, and said, ‘This is my (manner of having) dinner and the dinner of my ancestors. When the table-spread was pulled out, he (the Imam) picked pieces of food fallen on it and ate them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/117)"
        ],
        "index": 11603,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:49:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ عَبْدِ اللَّهِ بْنِ صَالِحٍ الْخَثْعَمِيِّ قَالَ شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَجَعَ الْخَاصِرَةِ فَقَالَ عَلَيْكَ بِمَا يَسْقُطُ مِنْ الْخِوَانِ فَكُلْهُ قَالَ فَفَعَلْتُ ذَلِكَ فَذَهَبَ عَنِّي ",
          "قَالَ إِبْرَاهِيمُ قَدْ كُنْتُ وَجَدْتُ ذَلِكَ فِي الْجَانِبِ الْأَيْمَنِ وَ الْأَيْسَرِ فَأَخَذْتُ ذَلِكَ فَانْتَفَعْتُ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Abdullah Bin Salih Al Khash’amy who said, ",
            "‘I complained to Abu Abdullah<sup>asws</sup> of the waist pain. So he<sup>asws</sup> said: ‘Upon you is with what falls from the food-spread, so eat it’. So I did that, so it went away from me’. ",
            "Ibrahim (the narrator) said, ‘I had found that in the right side and the left, so I took with that (eating the fallen crumbs), so I benefited by it’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Ibrahim ibn ‘Abd al-Hamid from ‘Abd Allah ibn Salih al- Khath’amiy who has said the following: “I once complained before abu ‘Abd Allah, ‘Alayhi al-Salam, against lower back pain. He (the Imam) said, ‘You must eat pieces of food that fall on the table-spread.’ I (the narrator) followed the instruction and the pain went away. Ibrahim has said, ‘I then found it on the left and the right side; I did the same thing again and benefited thereby.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/117)"
        ],
        "index": 11604,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:49:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مَنْصُورِ بْنِ الْعَبَّاسِ عَنِ الْحَسَنِ بْنِ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِيهِ قَالَ أَكَلْنَا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَلَمَّا رُفِعَ الْخِوَانُ لَقَطَ مَا وَقَعَ مِنْهُ فَأَكَلَهُ ثُمَّ قَالَ لَنَا إِنَّهُ يَنْفِي الْفَقْرَ وَ يُكْثِرُ الْوَلَدَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Mansour Bin Al Abbas, from Al Hassan Bin Muawiya Bin Wahab, from his father, who said, ",
            "‘We ate in the presence of Abu Abdullah<sup>asws</sup>. So when the meal was raised, he<sup>asws</sup> picked up what had fallen from it, so he<sup>asws</sup> ate it. Then he<sup>asws</sup> said to us: ‘It negates the poverty and causes abundance of the children’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad from Mansur ibn al-‘Abbas from al-Hassan ibn Wahab from his father who has said the following: “Once we ate food with abu ‘Abd Allah, ‘Alayhi al-Salam. When the table-spread was collected, he (the Imam) picked up the pieces that had fallen on it and ate them then said to us, ‘This removes poverty and increases the number of children.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/117)"
        ],
        "index": 11605,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:49:5",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْخَشَّابِ عَنِ ابْنِ بَقَّاحٍ عَنْ عَمْرِو بْنِ جُمَيْعٍ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ وَجَدَ كِسْرَةً فَأَكَلَهَا كَانَتْ لَهُ حَسَنَةٌ وَ مَنْ وَجَدَهَا فِي قَذِرٍ فَغَسَلَهَا ثُمَّ رَفَعَهَا كَانَتْ لَهُ سَبْعُونَ حَسَنَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Khashaab, from Ibn Baqqa, from Amro Bin Jumi’a who said, ",
            "‘Rasool-Allah<sup>saww</sup> said: ‘The one who finds one crumb, so he eats it, would have a Reward for him; and the one who finds it in dirt, so he washes it, then raises it, would have seventy Rewards for him’."
          ],
          "en.sarwar": [
            "5. Humayd ibn Ziyad has narrated from al-Khashshab from ibn Baqqah from ‘Amr ibn Jami’ who has said the following: “He (the Imam), ‘Alayhi al-Salam, has stated this Hadith. ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “If one finds pieces of food and eats them it is one good deed, and if one finds them in unclean places, then washes them, then picks them up, he will have seventy good deeds recorded for him.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/118)"
        ],
        "index": 11606,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:49:6",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ عَمْرِو بْنِ جُمَيْعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ دَخَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَى عَائِشَةَ فَرَأَى كِسْرَةً كَادَ أَنْ يَطَأَهَا فَأَخَذَهَا فَأَكَلَهَا ثُمَّ قَالَ يَا حُمَيْرَاءُ أَكْرِمِي جِوَارَ نِعَمِ اللَّهِ عَزَّ وَ جَلَّ عَلَيْكِ فَإِنَّهَا لَمْ تَنْفِرْ مِنْ قَوْمٍ فَكَادَتْ تَعُودُ إِلَيْهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">And by this chain, from Amro Bin Jumi’a, from Abu Abdullah</span><sup>asws</sup><span style=\"font-size: small\"> having said: </span>",
            "‘Rasool-Allah<sup>saww</sup> went over to Ayesha, so he<sup>saww</sup> saw a crumb which he<sup>saww</sup> almost trod upon, so he<sup>saww</sup> took it and ate it. Then he<sup>saww</sup> said: ‘O Humeyra! Honour the neighbourliness of a Bounty of Allah<sup>azwj</sup> Mighty and Majestic upon you, for it does not flee from a people, so it almost does not return to them’."
          ],
          "en.sarwar": [
            "6. Through the same chain of narrators as that of the previous Hadith the following is narrated: from ‘Amr ibn Jami’ who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, once entered ‘A’ishah’s home and saw pieces of food on which he was about to step. He (the Messenger of Allah) picked them up and said, ‘O Humayra’ you must honor the company of the bounties of Allah, most Majestic, most Glorious, with you; from whoever they get farther away they never then return to them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/118)"
        ],
        "index": 11607,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:49:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ إِبْرَاهِيمَ بْنِ مِهْزَمٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ شَكَا رَجُلٌ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا يَلْقَى مِنْ وَجَعِ الْخَاصِرَةِ فَقَالَ مَا يَمْنَعُكَ مِنْ أَكْلِ مَا يَقَعُ مِنَ الْخِوَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ali, from Ibrahim Bin Mihzan, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I complained to Abu Abdullah<sup>asws</sup> what I faced from the waist pain. So he<sup>asws</sup> said: ‘What is preventing you from eating what falls from the food-spread’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad, from ibn Khalid from Muhammad ibn Ali from Ibrahim ibn Mehzam who has said the following: “Abu al-Hassan, ‘Alayhi al-Salam, has said that once a man complained before abu ‘Abd Allah, ‘Alayhi al-Salam, against his lower back pain. He (the Imam) said, ‘Why do you not eat pieces of food that fall on the table-spread/” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/118)"
        ],
        "index": 11608,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:49:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُعَمَّرِ بْنِ خَلَّادٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ مَنْ أَكَلَ فِي مَنْزِلِهِ طَعَاماً فَسَقَطَ مِنْهُ شَيْ‏ءٌ فَلْيَتَنَاوَلْهُ وَ مَنْ أَكَلَ فِي الصَّحْرَاءِ أَوْ خَارِجاً فَلْيَتْرُكْهُ لِلطَّيْرِ وَ السَّبُعِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Moamar Bin Khallad who said, ",
            "‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘The one who eats food in his house, so something from it falls off, so let him take it; and the one who eats in the desert, or outside, so let him leave it for the birds and the wild animals’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Mu’ammar ibn Khallad who has said the following: “I once heard abu al-Hassan, ‘Alayhi al-Salam, saying, ‘If one eats food in his house and pieces of food fall off, he must pick them up and eat; but if one eats food in the wilderness or outdoors he should leave such pieces for the birds and beasts.”’ (See also Ch. 48, h 15) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/118)"
        ],
        "index": 11609,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:49:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْأَصَمِّ عَنْ عَبْدِ اللَّهِ الْأَرَّجَانِيِّ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ هُوَ يَأْكُلُ فَرَأَيْتُهُ يَتَتَبَّعُ مِثْلَ السِّمْسِمِ مِنَ الطَّعَامِ مَا سَقَطَ مِنَ الْخِوَانِ فَقُلْتُ جُعِلْتُ فِدَاكَ تَتَبَّعُ هَذَا فَقَالَ يَا عَبْدَ اللَّهِ هَذَا رِزْقُكَ فَلَا تَدَعْهُ أَمَا إِنَّ فِيهِ شِفَاءً مِنْ كُلِّ دَاءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of his companions, from Al Asamma, from Abdullah Al Arjany who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup> and he<sup>asws</sup> was eating. So I saw him pursue the likes of the sesame seeds from the food what fell off from the food-spread. So I said, ‘May I be sacrificed for you<sup>asws</sup>! You<sup>asws</sup> are pursuing this?’ So he<sup>asws</sup> said: ‘O Abdullah! This is the sustenance, therefore do not leave it, but in it is a healing from every illness’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from certain persons of his people from al- Asamm from ‘ Abd Allah al-Arjaniy who has said the following: “Once I was with abu ‘Abd Allah, ‘Alayhi al-Salam, and he was eating. I saw him searching for pieces of food fallen on the table-spread of the size of sesame seed. I then said, ‘I pray to Allah to keep my soul in service for your cause, are you looking for such pieces?’ He (the Imam) said, ‘O ‘Abd Allah, it is your sustenance; do not leave them, and besides there is cure in them for all kinds of illness.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:6:49",
  "kind": "verse_list"
}