{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:6:6",
        "titles": {
          "ar": "كتاب الْأَطْعِمَةِ",
          "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 50"
        },
        "path": "/books/al-kafi:6:6:50",
        "titles": {
          "ar": "باب فَضْلِ الْخُبْزِ",
          "en": "Chapter 50 – Merits of the bread"
        }
      }
    ],
    "index": 1784,
    "local_index": 50,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:6:50",
    "titles": {
      "ar": "باب فَضْلِ الْخُبْزِ",
      "en": "Chapter 50 – Merits of the bread"
    },
    "verse_count": 14,
    "verse_start_index": 11609,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/119)"
        ],
        "index": 11610,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَمْرِو بْنِ شِمْرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنِّي لَأَلْحَسُ أَصَابِعِي مِنَ الْأُدْمِ حَتَّى أَخَافَ أَنْ يَرَانِي خَادِمِي فَيَرَى أَنَّ ذَلِكَ مِنَ التَّجَشُّعِ وَ لَيْسَ ذَلِكَ كَذَلِكَ ",
          "إِنَّ قَوْماً أُفْرِغَتْ عَلَيْهِمُ النِّعْمَةُ وَ هُمْ أَهْلُ الثَّرْثَارِ فَعَمَدُوا إِلَى مُخِّ الْحِنْطَةِ فَجَعَلُوهَا خُبْزاً هَجَاءً وَ جَعَلُوا يُنْجُونَ بِهِ صِبْيَانَهُمْ حَتَّى اجْتَمَعَ مِنْ ذَلِكَ جَبَلٌ عَظِيمٌ ",
          "قَالَ فَمَرَّ بِهِمْ رَجُلٌ صَالِحٌ وَ إِذَا امْرَأَةٌ وَ هِيَ تَفْعَلُ ذَلِكَ بِصَبِيٍّ لَهَا فَقَالَ لَهُمْ وَيْحَكُمْ اتَّقُوا اللَّهَ عَزَّ وَ جَلَّ وَ لَا تُغَيِّرُوا مَا بِكُمْ مِنْ نِعْمَةٍ فَقَالَتْ لَهُ كَأَنَّكَ تُخَوِّفُنَا بِالْجُوعِ أَمَّا مَا دَامَ ثَرْثَارُنَا تَجْرِي فَإِنَّا لَا نَخَافُ الْجُوعَ ",
          "قَالَ فَأَسِفَ اللَّهُ عَزَّ وَ جَلَّ فَأَضْعَفَ لَهُمُ الثَّرْثَارَ وَ حَبَسَ عَنْهُمْ قَطْرَ السَّمَاءِ وَ نَبَاتَ الْأَرْضِ قَالَ فَاحْتَاجُوا إِلَى ذَلِكَ الْجَبَلِ وَ أَنَّهُ كَانَ يُقْسَمُ بَيْنَهُمْ بِالْمِيزَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Amro Bin Shimr who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘I<sup>asws</sup> lick my<sup>asws</sup> fingers from the sauce until I<sup>asws</sup> fear that my<sup>asws</sup> servant would see me, so he would view that as being from the greed, and that is not like that. ",
            "A people had the Bounties offloaded upon them, and they are the (people of) Sarsaar. So they took the wheat and made it as bread (to be used) for firewood, and made it to be utilised for cleaning their children with it, to the extent that a big hill gathered from that (soiled bread)’. ",
            "He<sup>asws</sup> said: ‘So a righteous man passed by them and there was a woman, and she was doing that with a child of hers (cleaning him with the bread). So he said to them, ‘Woe be unto you all! Fear Allah<sup>azwj</sup> Might and Majestic, and do not change what is with you from the Bounties’. So she said to him, ‘It is as if you are scaring us with the hunger. But, for as long as our Sarsaar (river) is flowing, so we do not fear the hunger’. ",
            "He<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> Mighty and Majestic Made them regret and weakened the Sarsaar (river) to them, and Withheld the drops of the sky (rain) from them, and the vegetation of the earth. So they became needy to that hill (of soiled bread) and they would then distribute it between them with the scale’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ‘ Abd Allah ibn al-Mughirah ‘Amr ibn Shamir who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘I lick food from my fingers but I fear my servants’ seeing me and their thinking that I am greedy. That is not true. A people upon whom bounties were poured owned a very large canal. They bleached the wheat for bread for food and used it to wipe their children with it until the dumpsite became like a huge mountain. A virtuous man passed by and saw a woman wipe her child with it. He said to them, ‘Fie upon you, have fear of Allah, most Majestic, most Glorious, and do not change the bounty you enjoy.’ She said, ‘Are you frightening us of hunger? As long as we have our great canal flowing we will not be afraid of hunger.’ It angered Allah, most Majestic, most Glorious, and He made their canal to weaken, stopped the sky to rain on them and the earth to grow (anything ). He (the Imam) said, ‘They became needy of that dumpsite and divided it among them by means of balance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/120)"
        ],
        "index": 11611,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) أَكْرِمُوا الْخُبْزَ فَإِنَّهُ قَدْ عَمِلَ فِيهِ مَا بَيْنَ الْعَرْشِ إِلَى الْأَرْضِ وَ مَا فِيهَا مِنْ كَثِيرٍ مِنْ خَلْقِهِ ",
          "ثُمَّ قَالَ لِمَنْ حَوْلَهُ أَ لَا أُخْبِرُكُمْ قَالُوا بَلَى يَا رَسُولَ اللَّهِ فِدَاكَ الْآبَاءُ وَ الْأُمَّهَاتُ فَقَالَ إِنَّهُ كَانَ نَبِيٌّ فِيمَنْ كَانَ قَبْلَكُمْ يُقَالُ لَهُ دَانِيَالُ وَ إِنَّهُ أَعْطَى صَاحِبَ مِعْبَرٍ رَغِيفاً لِكَيْ يَعْبُرَ بِهِ فَرَمَى صَاحِبُ الْمِعْبَرِ بِالرَّغِيفِ وَ قَالَ مَا أَصْنَعُ بِالْخُبْزِ هَذَا الْخُبْزُ عِنْدَنَا قَدْ يُدَاسُ بِالْأَرْجُلِ ",
          "فَلَمَّا رَأَى ذَلِكَ مِنْهُ دَانِيَالُ رَفَعَ يَدَهُ إِلَى السَّمَاءِ ثُمَّ قَالَ اللَّهُمَّ أَكْرِمِ الْخُبْزَ فَقَدْ رَأَيْتَ يَا رَبِّ مَا صَنَعَ هَذَا الْعَبْدُ وَ مَا قَالَ ",
          "قَالَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى السَّمَاءِ أَنْ تَحْبِسَ الْغَيْثَ وَ أَوْحَى إِلَى الْأَرْضِ أَنْ كُونِي طَبَقاً كَالْفَخَّارِ قَالَ فَلَمْ يُمْطَرُوا حَتَّى أَنَّهُ بَلَغَ مِنْ أَمْرِهِمْ أَنَّ بَعْضَهُمْ أَكَلَ بَعْضاً فَلَمَّا بَلَغَ مِنْهُمْ مَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ مِنْ ذَلِكَ قَالَتِ امْرَأَةٌ لِأُخْرَى وَ لَهُمَا وَلَدَانِ يَا فُلَانَةُ تَعَالِي حَتَّى نَأْكُلَ أَنَا وَ أَنْتِ الْيَوْمَ وَلَدِي وَ إِذَا كَانَ غَداً أَكَلْنَا وَلَدَكِ قَالَتْ لَهَا نَعَمْ فَأَكَلَتَاهُ ",
          "فَلَمَّا أَنْ جَاعَتَا مِنْ بَعْدُ رَاوَدَتِ الْأُخْرَى عَلَى أَكْلِ وَلَدِهَا فَامْتَنَعَتْ عَلَيْهَا فَقَالَتْ لَهَا بَيْنِي وَ بَيْنَكِ نَبِيُّ اللَّهِ فَاخْتَصَمَا إِلَى دَانِيَالَ ( عليه السلام ) فَقَالَ لَهُمَا وَ قَدْ بَلَغَ الْأَمْرُ إِلَى مَا أَرَى قَالَتَا لَهُ نَعَمْ يَا نَبِيَّ اللَّهِ وَ أَشَدَّ ",
          "قَالَ فَرَفَعَ يَدَهُ إِلَى السَّمَاءِ فَقَالَ اللَّهُمَّ عُدْ عَلَيْنَا بِفَضْلِكَ وَ فَضْلِ رَحْمَتِكَ وَ لَا تُعَاقِبِ الْأَطْفَالَ وَ مَنْ فِيهِ خَيْرٌ بِذَنْبِ صَاحِبِ الْمِعْبَرِ وَ أَضْرَابِهِ لِنِعْمَتِكَ ",
          "قَالَ فَأَمَرَ اللَّهُ عَزَّ وَ جَلَّ السَّمَاءَ أَنْ أَمْطِرِي عَلَى الْأَرْضِ وَ أَمَرَ الْأَرْضَ أَنْ أَنْبِتِي لِخَلْقِي مَا قَدْ فَاتَهُمْ مِنْ خَيْرِكَ فَإِنِّي قَدْ رَحِمْتُهُمْ بِالطِّفْلِ الصَّغِيرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘Honour the bread, for it has been worked upon by what is between the Throne and the earth and what is from the numerous of its people’.",
            "Then he<sup>saww</sup> said to the ones around him<sup>saww</sup>: ‘Shall I<sup>saww</sup> inform you all?’ They said, ‘Yes, O Rasool-Allah<sup>saww</sup>, may the fathers and the mothers be sacrificed for you<sup>saww</sup>’. So he<sup>saww</sup> said: ‘There was a Prophet<sup>as</sup> among the ones who were before you all, called Dainel<sup>as</sup>, and he<sup>asws</sup> gave the owner of the crossing a bread in order to cross with it. So the owner of the crossing threw down the bread and said, ‘What do I do with this bread. The bread is with us’, and he trampled it with the leg. ",
            "So when Daniel<sup>as</sup> saw that from him, he<sup>as</sup> raised his<sup>as</sup> hands towards the sky, then said: ‘O Allah<sup>azwj</sup>! Honour the bread, for You<sup>azwj</sup> have Seen, O Lord<sup>azwj</sup> what this servant has done and what he said’. ",
            "He<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto the sky that it withholds the rain, and Revealed unto the earth that it become layers like the pottery. So it did not rain to the extent that their affairs reached such that some of them ate each other. So when (the situation) reached what Allah<sup>azwj</sup> Mighty and Majestic Intended from that, a woman said to another, and for both of them were parents, ‘O so and so, come, let I and you both, eat my parents today, and when it is tomorrow, we both eat your parents’. So she said to her, ‘Yes’. So they ate them. ",
            "So when she came over afterwards the other enticing to eat her parents, she prevented her, and she said, ‘Between me and you is a Prophet<sup>as</sup> of Allah<sup>azwj</sup>. So they both brought their dispute to Daniel<sup>as</sup>. So he<sup>as</sup> said to them both: ‘And has the matter reached to what I<sup>as</sup> see?’ She said to him<sup>as</sup>, ‘Yes, O Prophet<sup>as</sup> of Allah<sup>azwj</sup>, and even more difficult’. ",
            "He<sup>asws</sup> said: ‘So he<sup>as</sup> raised his<sup>as</sup> hands towards the sky, so he<sup>as</sup> said; ‘O Allah<sup>azwj</sup>! Return upon us with Your<sup>azwj</sup> Grace, and Grace of Your<sup>azwj</sup> Mercy, and do not Punish the children, and the good ones in it, by the sin of the owner of the crossing, and his disrespecting Your<sup>azwj</sup> Bounty’. ",
            "He<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> Mighty and Majestic Commanded the sky that: “Rain for Me<sup>azwj</sup> upon the earth”, and Commanded the earth that “Grow for My<sup>azwj</sup> Creatures, so Give them from your goodness, for I<sup>azwj</sup> am being Merciful to them due to the young children’."
          ],
          "en.sarwar": [
            "2. Afi ibn Ibrahim has narrated from his father from Harun ibn Muslim from Mas’adah ibn Sadaqah who has said the following: “It is a narration of abu ‘Abd Allah, ‘Alayhi al-Salam, from the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. He (the Messenger of Allah) once said, ‘You must treat bread with reverence because from the throne to earth and what is in it, a large number of His creatures have worked for it (to make it ready).’ He (the Messenger of Allah) then said, ‘Will you like if I tell you something?’ They replied, ‘Yes, O Messenger of Allah, we pray to Allah to keep the fathers and mothers in service for your cause.’ He (the Messenger of Allah) said, ‘Among the Prophets before you there was a Prophet called Daniel. He once gave one loaf of bread to the owner of the crossing (means) to help for crossing. He threw the bread away saying, ‘It is of no use for me. We crush bread under our foot.’ When Daniel saw it, he raised his hands to the sky and said, ‘O Lord, make bread revered because I saw what this servant just did to it and what he said.’ Allah, most Majestic, most Glorious, sent revelation to the sky and told it to withhold rain and the earth to turn into a piece of pottery.’ It did not rain and they ended up eating each other. When their condition reached the point which Allah, most Majestic, most Glorious, wanted, one woman said to the other, who each had a child, to one day eat the child of one of them. The other woman agreed and they ate the child. When they became hungry again the other woman demanded to eat the child of the other woman but she refused saying, ‘Between us there is the Prophet of Allah.’ They went to Daniel, ‘Alayhi al-Salam, for judgment. He said to them, ‘I can see to what degree the condition has reached.’ They said, ‘Yes, O Prophet of Allah and it is more difficult.’ He raised his hands to the sky and said, ‘O Lord, return to us with Your generosity, and the extra of Your mercy and do not make the children to suffer because of the sins of the owner of the crossing and his disrespecting Your bounties.’ Allah, most Majestic, most Glorious, commanded the sky to send rain and earth to grow produce for His creatures what they had lost of the goodness because He had turned to them with kindness through the small child.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/120)"
        ],
        "index": 11612,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا يُوضَعُ الرَّغِيفُ تَحْتَ الْقَصْعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Washa, from Al Maysami, from Aban Bin Taghlub who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Do not place the bread beneath the bowl’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from al-Washsha’ from al-Mithamiy from Aban ibn Taghlib who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A loaf of bread must not be placed under the dish.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/120)"
        ],
        "index": 11613,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:4",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ السَّيَّارِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ بَعْضِ أَصْحَابِهِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَكْرِمُوا الْخُبْزَ قِيلَ وَ مَا إِكْرَامُهُ قَالَ إِذَا وُضِعَ لَا يُنْتَظَرُ بِهِ غَيْرُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Bin Al Sayyari, from Ali Bin Asbad, from one of his companions who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Honour the bread’. It was said, ‘And what is its honouring?’ He<sup>asws</sup> said: ‘When it is placed, so do not wait with it for something else’."
          ],
          "en.sarwar": [
            "4. Al-Husayn from Muhammad has narrated from al-Sayyariy from Ali ibn Asbat from certain persons of his people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You must treat bread with reverence.’ It was asked, ‘What is treating it with reverence?’ He (the Imam) said, ‘When it is made available one must not wait for others.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع وآخره مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/121)"
        ],
        "index": 11614,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ بَعْضِ أَصْحَابِنَا قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَكْرِمُوا الْخُبْزَ فَقِيلَ يَا رَسُولَ اللَّهِ وَ مَا إِكْرَامُهُ قَالَ إِذَا وُضِعَ لَمْ يُنْتَظَرْ بِهِ غَيْرُهُ ",
          "وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ مِنْ كَرَامَتِهِ أَنْ لَا يُوطَأَ وَ لَا يُقْطَعَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Talha Bin Zayd, from one of our companions who said, ",
            "‘Rasool-Allah<sup>saww</sup> said: ‘Honour the bread!’ So it was said, ‘O Rasool-Allah<sup>saww</sup>! What is its honouring?’ He<sup>saww</sup> said: ‘When it is placed, do not wait with it for something else’. ",
            "And Rasool-Allah<sup>saww</sup> said: ‘And from its honouring is that it should neither be trodden upon nor cut (into pieces before it is placed)’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ‘ Abd Allah ibn al-Mughirah from Talhah ibn Zayd from certain persons of our people who has said the following: “He (the Imam) has said that the Messenger of Allah, once said, ‘You must treat bread with reverence.’ It was asked, ‘What is its reverence?’ He (the Messenger of Allah) said, ‘When it is made available one must not wait for others.’ The Messenger of Allah has said that of treating it with reverence is not to step on it or cut it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/121)"
        ],
        "index": 11615,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِيَّاكُمْ أَنْ تَشَمُّوا الْخُبْزَ كَمَا تَشَمُّهُ السِّبَاعُ فَإِنَّ الْخُبْزَ مُبَارَكٌ أَرْسَلَ اللَّهُ عَزَّ وَ جَلَّ لَهُ السَّمَاءَ مِدْرَاراً وَ لَهُ أَنْبَتَ اللَّهُ الْمَرْعَى وَ بِهِ صَلَّيْتُمْ وَ بِهِ صُمْتُمْ وَ بِهِ حَجَجْتُمْ بَيْتَ رَبِّكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Beware of smelling the bread just as you smell the wild animals smell it, for the bread is Blessed. Allah<sup>azwj</sup> Mighty and Majestic has Commanded the sky for it for torrential downpour, and for Allah<sup>azwj</sup> has Grown the meadows, and by it you are Praying, and by it you are Fasting, and by it you are performing the Hajj of the House of your Lord<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘You must never smell bread like the beasts do. Bread is blessed and Allah, most Majestic, most Glorious, has sent the sky with rain and because of it He has grown the pastures. By means of bread you perform Salat (prayer), observe fast and perform al-Hajj of the House of your Lord.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/121)"
        ],
        "index": 11616,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:7",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا أُوتِيتُمْ بِالْخُبْزِ وَ اللَّحْمِ فَابْدَءُوا بِالْخُبْزِ فَسُدُّوا بِهِ خِلَالَ الْجُوعِ ثُمَّ كُلُوا اللَّحْمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "‘He<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘When you are brought the bread and the meat, so begin with the bread, so close by it the emptiness of the hunger, then eat the meat’."
          ],
          "en.sarwar": [
            "7. Through the same chain of narrators as that of the previous Hadith the following is narrated: “He (the Imam) has said that the Messenger of Allah has said, ‘When bread and meat is brought for you, eat bread first to stop the emptiness of hunger, then eat the meat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/121)"
        ],
        "index": 11617,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يَعْقُوبَ بْنِ يَقْطِينٍ قَالَ قَالَ أَبُو الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) صَغِّرُوا رُغْفَانَكُمْ فَإِنَّ مَعَ كُلِّ رَغِيفٍ بَرَكَةً ",
          "وَ قَالَ يَعْقُوبُ بْنُ يَقْطِينٍ رَأَيْتُ أَبَا الْحَسَنِ يَعْنِي الرِّضَا ( عليه السلام ) يَكْسِرُ الرَّغِيفَ إِلَى فَوْقُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Isa, from Yaqoub Bin Yaqteen who said, ",
            "‘Abu Al-Hassan Al-Reza<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Make your bread as small, for with each loaf is a Blessing’. ",
            "And Yaqoub Bin Yaqteen (the narrator) said, ",
            "‘I saw Abu Al-Hassan<sup>asws</sup>, meaning Al-Reza<sup>asws</sup>, breaking the bread upwards’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn Tsa from Ya’qub ibn Yaqtin who has said the following: “Abu al-Hassan, al-Rida’ ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Make your bread of small loaves because there is blessing with each loaf.’ Ya‘qub ibn Yaqtin has said, ‘I saw abu al-Hassan, ‘Alayhi al-Salam, break the bread upward.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/121)"
        ],
        "index": 11618,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ السَّيَّارِيِّ عَنْ أَبِي عَلِيِّ بْنِ رَاشِدٍ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا لَمْ يَكُنْ لَهُ أُدْمٌ قَطَعَ الْخُبْزَ بِالسِّكِّينِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Sayyari, from Abu Ali Bin Rashid, ",
            "(It has been narrated) raising it from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup>, whenever he<sup>asws</sup> did not have a sauce for him<sup>asws</sup>, cut the bread with the knife’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Sayyariy from abu Ali ibn Rashid in a marfu‘ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when ’Amir al-Mu’minin did not have curry; he would cut the bread with a knife.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/122)"
        ],
        "index": 11619,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:10",
        "text": [
          "السَّيَّارِيُّ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَدْنَى الْأُدْمِ قَطْعُ الْخُبْزِ بِالسِّكِّينِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Sayyari, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup> having said: ‘The lowest of the sauce is to cut the bread with the knife’."
          ],
          "en.sarwar": [
            "10. Al-Sayyariy in a marfu‘ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the least of curry is to cut the bread with a knife.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالموثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/122)"
        ],
        "index": 11620,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:11",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ النَّوْفَلِيِّ عَنِ الْفَضْلِ بْنِ يُونُسَ قَالَ تَغَدَّى عِنْدِي أَبُو الْحَسَنِ ( عليه السلام ) فَجِي‏ءَ بِقَصْعَةٍ وَ تَحْتَهَا خُبْزٌ فَقَالَ أَكْرِمُوا الْخُبْزَ أَنْ لَا يَكُونَ تَحْتَهَا وَ قَالَ لِي مُرِ الْغُلَامَ أَنْ يُخْرِجَ الرَّغِيفَ مِنْ تَحْتِ الْقَصْعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar, and someone else, from Ahmad Bin Abu Abdullah, from his father, from Abdullah Bin Al Fazl Al Nowfaly, from Al Fazl Bin Yunus who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> had lunch with me, so I came with a bowl and beneath it was bread. So he<sup>asws</sup> said: ‘Honour the bread, that it should not happen to be under it’. And he<sup>asws</sup> said to me: ‘Instruct the slave that he takes out the bread from beneath the bowl’."
          ],
          "en.sarwar": [
            "11. Ali ibn Muhammad Bandar and others have narrated from Ahmad ibn abu ‘Abd Allah from his father from ‘Abd Allah ibn al-Fadl al- Nawfaliy from al-Fadl ibn Yunus who has said the following: “I once had lunch with abu al-Hassan, ‘Alayhi al-Salam, and the dish was brought with bread underneath the dish. He (the Imam) said, ‘You must revere bread and do not allow it to be placed under the dish.’ He (the Imam) then said to me to command the slave to take the bread from underneath the dish.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالموثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/122)"
        ],
        "index": 11621,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:12",
        "text": [
          "أَحْمَدُ عَنِ ابْنِ فَضَّالٍ عَنِ الْمِيثَمِيِّ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ كَرِهَ أَنْ يُوضَعَ الرَّغِيفُ تَحْتَ الْقَصْعَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Ibn Fazzal, from Al Maysami, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having disliked that the bread be placed under the bowl’."
          ],
          "en.sarwar": [
            "12. Ahmad has narrated from ibn Faddal from af-Mithamiy from abu Basir who has said the foiiowing: “Abu ‘Abd Allah, ‘Alayhi al-Salam, disliked placing of the loaf of bread under the dish.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/122)"
        ],
        "index": 11622,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:13",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ إِدْرِيسَ بْنِ يُوسُفَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا تَقْطَعُوا الْخُبْزَ بِالسِّكِّينِ وَ لَكِنِ اكْسِرُوهُ بِالْيَدِ وَ لْيُكْسَرْ لَكُمْ خَالِفُوا الْعَجَمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Yaqoub Bin Yazeed, from Muhammad Bin Jamhour, from Idrees Bin Yusuf, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘do not cut the bread with the knife, but break it with the hand, and let your breaking be opposite to that of the non-Arabs’."
          ],
          "en.sarwar": [
            "13. Ahmad ibn Muhammad has narrated from Ya’qub ibn Yazid from Muhammad ibn Jumhur from Idris ibn Yusuf who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Do not cut bread with knife but break it with your hand and others must break it for you. You must do the opposite of al-‘Ajam (non- Arabs).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/122)"
        ],
        "index": 11623,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:50:14",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ لَا تَقْطَعُوا الْخُبْزَ بِالسِّكِّينِ وَ لَكِنِ اكْسِرُوهُ بِالْيَدِ وَ خَالِفُوا الْعَجَمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘Do not cut the bread with the knife, but cut it by the hand, and oppose the non-Arabs’."
          ],
          "en.sarwar": [
            "14. Afi ibn Ibrahim has narrated from Muhammad ibn ’Isa from Yunus who has said the following: “Abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, has said, ‘Do not cut bread with knife, instead break it with the hands and do the opposite of al-Ajam (non- Arabs).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:6:50",
  "kind": "verse_list"
}