{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:6:6",
        "titles": {
          "ar": "كتاب الْأَطْعِمَةِ",
          "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 89"
        },
        "path": "/books/al-kafi:6:6:89",
        "titles": {
          "ar": "باب الْجُبُنِّ",
          "en": "Chapter 88 – The Cheese"
        }
      }
    ],
    "index": 1823,
    "local_index": 89,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 90"
        },
        "path": "/books/al-kafi:6:6:90",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْجُبُنِّ وَ الْجَوْزِ</span>",
          "en": "Chapter 89 – The Cheese and the Wlanut"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 88"
        },
        "path": "/books/al-kafi:6:6:88",
        "titles": {
          "ar": "باب أَلْبَانِ الْأُتُنِ",
          "en": "Chapter 87 – The Yoghurt water (Lassi)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:6:6",
        "titles": {
          "ar": "كتاب الْأَطْعِمَةِ",
          "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:6:89",
    "titles": {
      "ar": "باب الْجُبُنِّ",
      "en": "Chapter 88 – The Cheese"
    },
    "verse_count": 3,
    "verse_start_index": 11825,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/172)"
        ],
        "index": 11826,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:89:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْجُبُنِّ فَقَالَ لِي لَقَدْ سَأَلْتَنِي عَنْ طَعَامٍ يُعْجِبُنِي ثُمَّ أَعْطَى الْغُلَامَ دِرْهَماً فَقَالَ يَا غُلَامُ ابْتَعْ لَنَا جُبُنّاً وَ دَعَا بِالْغَدَاءِ فَتَغَدَّيْنَا مَعَهُ وَ أُتِيَ بِالْجُبُنِّ ",
          "فَأَكَلَ وَ أَكَلْنَا مَعَهُ فَلَمَّا فَرَغْنَا مِنَ الْغَدَاءِ قُلْتُ لَهُ مَا تَقُولُ فِي الْجُبُنِّ فَقَالَ لِي أَ وَ لَمْ تَرَنِي أَكَلْتُهُ قُلْتُ بَلَى وَ لَكِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْكَ فَقَالَ سَأُخْبِرُكَ عَنِ الْجُبُنِّ وَ غَيْرِهِ كُلُّ مَا كَانَ فِيهِ حَلَالٌ وَ حَرَامٌ فَهُوَ لَكَ حَلَالٌ حَتَّى تَعْرِفَ الْحَرَامَ بِعَيْنِهِ فَتَدَعَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Abdullah Bin Sinan, from Abdullah Bin Suleyman who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the cheese, so he<sup>asws</sup> said to me: ‘You have asked me<sup>asws</sup> about a food which I<sup>asws</sup> love’.  Then he<sup>asws</sup> gave one Dirham to the slave, so he<sup>asws</sup> said: ‘O slave! Buy some cheese for us and call for the lunch’. So we had lunch with him<sup>asws</sup>, and they came with the cheese. ",
            "So he<sup>asws</sup> ate and we ate with him<sup>asws</sup>. So when we were free from the lunch, I said to him<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding the cheese?’ So he<sup>asws</sup> said to me: ‘Or did you not see me<sup>asws</sup> eating it?’ I said, ‘Yes, but I would love to hear it from you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘I shall inform you about the cheese and other such, everything what was Permissible regarding it, and Prohibited. So it is Permissible for you until you recognise the Prohibition with exactly it, so leave it’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from ‘Abd Allah ibn Sinan from ‘Abd Allah ibn Sulayman who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about cheese. He (the Imam) said, ’You have asked me about a food that is attractive to me. 5 He (the Imam) then gave a dirham to the boy and asked him to bring cheese. He (the Imam) asked for lunch which was brought. He (the Imam) ate and we ate with him (the Imam). When we finished lunch I asked, ‘What do you say about cheese? 5 He (the Imam) asked me, ‘Did you not see me eating it with you? 5 I replied, ‘Yes, I saw you but I like to hear it from you. 5 He (the Imam) said, ‘I will tell you about cheese and other things. Whatever has lawful in it as well as unlawful is lawful for you, until you learn that it particularly is unlawful, then you must leave it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/173)"
        ],
        "index": 11827,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:89:2",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ أَبَانِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْجُبُنِّ قَالَ كُلُّ شَيْ‏ءٍ لَكَ حَلَالٌ حَتَّى يَجِيئَكَ شَاهِدَانِ يَشْهَدَانِ عِنْدَكَ أَنَّ فِيهِ مَيْتَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Al Kufy, from Muhammad Bin Ahmad Al Nahdy, from Muhammad Bin Al Waleed, from Aban Bin Abdul Rahman, from Abdullah Bin Suleyman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the cheese. He<sup>asws</sup> said: ‘Everything is Permissible for you until two witnesses come to you with two testimonies in your presence that in it is a dead (animal thing)’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad al-Kufiy has narrated from Muhammad ibn Ahmad al-Nahdiy from Muhammad ibn al-Walid from Aban ibn ‘Abd al-Rahman from ‘Abd Allah ibn Sulayman who has said the following: “About cheese abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Everything is lawful for you until two witnesses testify before you that it is dead animal.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول وآخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/173)"
        ],
        "index": 11828,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:6:89:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ إِبْرَاهِيمَ الْهَاشِمِيِّ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ الْفَضْلِ النَّيْسَابُورِيِّ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلَهُ رَجُلٌ عَنِ الْجُبُنِّ فَقَالَ دَاءٌ لَا دَوَاءَ فِيهِ ",
          "فَلَمَّا كَانَ بِالْعَشِيِّ دَخَلَ الرَّجُلُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَنَظَرَ إِلَى الْجُبُنِّ عَلَى الْخِوَانِ فَقَالَ جُعِلْتُ فِدَاكَ سَأَلْتُكَ بِالْغَدَاةِ عَنِ الْجُبُنِّ فَقُلْتَ لِي إِنَّهُ هُوَ الدَّاءُ الَّذِي لَا دَوَاءَ لَهُ وَ السَّاعَةَ أَرَاهُ عَلَى الْخِوَانِ قَالَ فَقَالَ لِي هُوَ ضَارٌّ بِالْغَدَاةِ نَافِعٌ بِالْعَشِيِّ وَ يَزِيدُ فِي مَاءِ الظَّهْرِ .",
          "وَ رُوِيَ أَنَّ مَضَرَّةَ الْجُبُنِّ فِي قِشْرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ali Bin Ibrahim Al Hashimy, from his father, from Muhammad Bin Al Fazal Al Neyshapouri, from one of his men, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man asked him<sup>asws</sup> about the cheese, so he<sup>asws</sup> said: ‘An illness, there is no cure in it’. ",
            "So when it was the evening, the man came over to Abu Abdullah<sup>asws</sup>, so he looked at the cheese upon the table-spread, so he said, ‘May I be sacrificed for you<sup>asws</sup>! I asked you<sup>asws</sup> at lunch about the cheese, so you<sup>asws</sup> said to me: ‘It is an illness, there is no cure for it, and at this time I see it upon the food-spread?’ So he<sup>asws</sup> said to me: ‘It is harmful with the lunch and beneficial with the dinner, increasing in the water of the back’.",
            "And it is reported that: ‘The harmfulness of the cheese is in its crust’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ali ibn Ibrahim al-Hashimiy, from his father from Muhammad ibn al- Fadl al-Naysaburiy from certain persons of our people who has said the following: “A man once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about cheese. He (the Imam) said, ‘It is an illness for which there is no cure.’ When it was al-‘Isha’ (evening) the man came to abu ‘Abd Allah, ‘Alayhi al-Salam, and looked at cheese on the table-spread and said, ‘I pray to Allah to keep my soul in service for your cause. At lunchtime, I asked you about cheese. You said to me that it is an illness for which there is no cure and now I see it on the table-spread.’ He (the Imam) said, ‘It is harmful at lunch and useful in dinner and it increases the water of one’s back.’ It is narrated that harmfulness of cheese is in its crust.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:6:89",
  "kind": "verse_list"
}