{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 6"}, "path": "/books/al-kafi:6:6", "titles": {"ar": "كتاب الْأَطْعِمَةِ", "en": "<a id=\"_Toc452729791\"></a>THE BOOK OF FOODSTUFFS "}}, {"indexed_titles": {"en": "Chapter 9"}, "path": "/books/al-kafi:6:6:9", "titles": {"ar": "باب مَا يُنْتَفَعُ بِهِ مِنَ الْمَيْتَةِ وَ مَا لَا يُنْتَفَعُ بِهِ مِنْهَا", "en": "Chapter 9 – What can be benefited with from the dead, and what cannot be benefitted with from it"}}], "index": 1735, "local_index": 9, "part_type": "Chapter", "path": "/books/al-kafi:6:6:9", "titles": {"ar": "باب مَا يُنْتَفَعُ بِهِ مِنَ الْمَيْتَةِ وَ مَا لَا يُنْتَفَعُ بِهِ مِنْهَا", "en": "Chapter 9 – What can be benefited with from the dead, and what cannot be benefitted with from it"}, "verse_count": 7, "verse_start_index": 11377, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 11378, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:6:9:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ كُنْتُ جَالِساً فِي مَسْجِدِ الرَّسُولِ ( صلى الله عليه وآله ) إِذَا أَقْبَلَ رَجُلٌ فَسَلَّمَ فَقَالَ مَنْ أَنْتَ يَا عَبْدَ اللَّهِ قُلْتُ رَجُلٌ مِنْ أَهْلِ الْكُوفَةِ فَقُلْتُ مَا حَاجَتُكَ فَقَالَ لِي أَ تَعْرِفُ أَبَا جَعْفَرٍ مُحَمَّدَ بْنَ عَلِيٍّ ( عليه السلام ) فَقُلْتُ نَعَمْ فَمَا حَاجَتُكَ إِلَيْهِ قَالَ هَيَّأْتُ لَهُ أَرْبَعِينَ مَسْأَلَةً أَسْأَلُهُ عَنْهَا فَمَا كَانَ مِنْ حَقٍّ أَخَذْتُهُ وَ مَا كَانَ مِنْ بَاطِلٍ تَرَكْتُهُ قَالَ أَبُو حَمْزَةَ فَقُلْتُ لَهُ هَلْ تَعْرِفُ مَا بَيْنَ الْحَقِّ وَ الْبَاطِلِ قَالَ نَعَمْ فَقُلْتُ لَهُ فَمَا حَاجَتُكَ إِلَيْهِ إِذَا كُنْتَ تَعْرِفُ مَا بَيْنَ الْحَقِّ وَ الْبَاطِلِ فَقَالَ لِي يَا أَهْلَ الْكُوفَةِ أَنْتُمْ قَوْمٌ مَا تُطَاقُونَ إِذَا رَأَيْتَ أَبَا جَعْفَرٍ ( عليه السلام ) فَأَخْبِرْنِي", "فَمَا انْقَطَعَ كَلَامِي مَعَهُ حَتَّى أَقْبَلَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ حَوْلَهُ أَهْلُ خُرَاسَانَ وَ غَيْرُهُمْ يَسْأَلُونَهُ عَنْ مَنَاسِكِ الْحَجِّ فَمَضَى حَتَّى جَلَسَ مَجْلِسَهُ وَ جَلَسَ الرَّجُلُ قَرِيباً مِنْهُ قَالَ أَبُو حَمْزَةَ فَجَلَسْتُ حَيْثُ أَسْمَعُ الْكَلَامَ وَ حَوْلَهُ عَالَمٌ مِنَ النَّاسِ فَلَمَّا قَضَى حَوَائِجَهُمْ وَ انْصَرَفُوا الْتَفَتَ إِلَى الرَّجُلِ فَقَالَ لَهُ مَنْ أَنْتَ قَالَ أَنَا قَتَادَةُ بْنُ دِعَامَةَ الْبَصْرِيُّ فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) أَنْتَ فَقِيهُ أَهْلِ الْبَصْرَةِ قَالَ نَعَمْ", "فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) وَيْحَكَ يَا قَتَادَةُ إِنَّ اللَّهَ جَلَّ وَ عَزَّ خَلَقَ خَلْقاً مِنْ خَلْقِهِ فَجَعَلَهُمْ حُجَجاً عَلَى خَلْقِهِ فَهُمْ أَوْتَادٌ فِي أَرْضِهِ قُوَّامٌ بِأَمْرِهِ نُجَبَاءُ فِي عِلْمِهِ اصْطَفَاهُمْ قَبْلَ خَلْقِهِ أَظِلَّةً عَنْ يَمِينِ عَرْشِهِ", "قَالَ فَسَكَتَ قَتَادَةُ طَوِيلًا ثُمَّ قَالَ أَصْلَحَكَ اللَّهُ وَ اللَّهِ لَقَدْ جَلَسْتُ بَيْنَ يَدَيِ الْفُقَهَاءِ وَ قُدَّامَ ابْنِ عَبَّاسٍ فَمَا اضْطَرَبَ قَلْبِي قُدَّامَ وَاحِدٍ مِنْهُمْ مَا اضْطَرَبَ قُدَّامَكَ قَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) وَيْحَكَ أَ تَدْرِي أَيْنَ أَنْتَ أَنْتَ بَيْنَ يَدَيْ بُيُوتٍ أَذِنَ اللَّهُ أَنْ تُرْفَعَ وَ يُذْكَرَ فِيهَا اسْمُهُ يُسَبِّحُ لَهُ فِيها بِالْغُدُوِّ وَ الْآصالِ. رِجالٌ لا تُلْهِيهِمْ تِجارَةٌ وَ لا بَيْعٌ عَنْ ذِكْرِ اللَّهِ وَ إِقامِ الصَّلاةِ وَ إِيتاءِ الزَّكاةِ فَأَنْتَ ثَمَّ وَ نَحْنُ أُولَئِكَ", "فَقَالَ لَهُ قَتَادَةُ صَدَقْتَ وَ اللَّهِ جَعَلَنِيَ اللَّهُ فِدَاكَ وَ اللَّهِ مَا هِيَ بُيُوتُ حِجَارَةٍ وَ لَا طِينٍ قَالَ قَتَادَةُ فَأَخْبِرْنِي عَنِ الْجُبُنِّ قَالَ فَتَبَسَّمَ أَبُو جَعْفَرٍ ( عليه السلام ) ثُمَّ قَالَ رَجَعَتْ مَسَائِلُكَ إِلَى هَذَا قَالَ ضَلَّتْ عَلَيَّ فَقَالَ لَا بَأْسَ بِهِ فَقَالَ إِنَّهُ رُبَّمَا جُعِلَتْ فِيهِ إِنْفَحَةُ الْمَيِّتِ قَالَ لَيْسَ بِهَا بَأْسٌ إِنَّ الْإِنْفَحَةَ لَيْسَ لَهَا عُرُوقٌ وَ لَا فِيهَا دَمٌ وَ لَا لَهَا عَظْمٌ إِنَّمَا تَخْرُجُ مِنْ بَيْنِ فَرْثٍ وَ دَمٍ", "ثُمَّ قَالَ وَ إِنَّمَا الْإِنْفَحَةُ بِمَنْزِلَةِ دَجَاجَةٍ مَيْتَةٍ أُخْرِجَتْ مِنْهَا بَيْضَةٌ فَهَلْ تُؤْكَلُ تِلْكَ الْبَيْضَةُ فَقَالَ قَتَادَةُ لَا وَ لَا آمُرُ بِأَكْلِهَا فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) وَ لِمَ فَقَالَ لِأَنَّهَا مِنَ الْمَيْتَةِ قَالَ لَهُ فَإِنْ حُضِنَتْ تِلْكَ الْبَيْضَةُ فَخَرَجَتْ مِنْهَا دَجَاجَةٌ أَ تَأْكُلُهَا قَالَ نَعَمْ قَالَ فَمَا حَرَّمَ عَلَيْكَ الْبَيْضَةَ وَ حَلَّلَ لَكَ الدَّجَاجَةَ", "ثُمَّ قَالَ ( عليه السلام ) فَكَذَلِكَ الْإِنْفَحَةُ مِثْلُ الْبَيْضَةِ فَاشْتَرِ الْجُبُنَّ مِنْ أَسْوَاقِ الْمُسْلِمِينَ مِنْ أَيْدِي الْمُصَلِّينَ وَ لَا تَسْأَلْ عَنْهُ إِلَّا أَنْ يَأْتِيَكَ مَنْ يُخْبِرُكَ عَنْهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Al Fuzayl, from Abu Hamz Al Sumaly who said, ", "‘I was seated in Masjid of Rasool<sup>saww</sup> when a man came over, so I greeted. So he said, ‘Who are you, O servant of Allah<sup>azwj</sup>?’ I said, ‘A man from the People of Al-Kufa. What is your need?’ So he said to me, ‘Do you know Abu Ja’far Muhammad Bin Ali<sup>asws</sup>?’ So I said, ‘Yes, so what is your need to him<sup>asws</sup>?’ He said, ‘I have brought forty questions to him<sup>asws</sup> to ask him<sup>asws</sup> about these, so whatever was from truth I shall take it, and whatever was from falsehood I shall leave it’. Abu Hamza said, ‘So I said to him, ‘Do you recognised what (difference there) is between the truth and the falsehood?’ He said, ‘Yes’. So I said to him, ‘So what is your need for him<sup>asws</sup> when you recognise what (difference there) is between the truth and the falsehood?’ So he said so me, ‘O people of Al-Kufa! You all are a people who cannot be tolerated. When you see Abu Ja’far<sup>asws</sup>, so inform me’.", "So I did not speak to him until Abu Ja’far<sup>asws</sup> came over, and around him<sup>asws</sup> were the people of Khurasan and others, asking him<sup>asws</sup> about the rituals of the Hajj. So I went until I was seated in his<sup>asws</sup> gathering and the man sat near to him<sup>asws</sup>. Abu Hamza said, ‘So I sat where I could hear the speech, and around him<sup>asws</sup> there was a world of people (many). So when he<sup>asws</sup> had fulfilled their needs and they dispersed, he<sup>asws</sup> turned towards the man, so he<sup>asws</sup> said to him: ‘Who are you?’ He said, ‘I am Qatada Bin Diama Al-Basry’. So Abu Ja’far<sup>asws</sup> said to him: ‘You are a jurist of the people of Al-Basra?’ He said, ‘Yes’. ", "So Abu Ja’far<sup>asws</sup> said to him: ‘Woe be unto you, O Qatada! Allah<sup>azwj</sup> Majestic and Mighty Created a people from His<sup>azwj</sup> creatures, so He<sup>azwj</sup> Made them as Proofs upon His<sup>azwj</sup> creatures. So they<sup>asws</sup> are the pegs in His<sup>azwj</sup> earth, standing by His<sup>azwj</sup> Commands, excelling in His<sup>azwj</sup> Knowledge, having Chosen them<sup>asws</sup> before His<sup>azwj</sup> creatures as shadows on the right of the Throne’.", "He (Abu Hamza) said, ‘Qatada was silent for a long time, then said, ‘May Allah<sup>azwj</sup> Keep you well! By Allah<sup>azwj</sup>, I have sat in front of the jurist, and in front of Ibn Abbas, by my heart did not shake in front of any of them what it has shaken in front of you<sup>asws</sup>’. Abu Ja’far<sup>asws</sup> said to him: ‘Woe be unto you! Do you know where you are? You are in front of <span class=\"ibTxt\">[24:36] houses which Allah has Allowed to be Exalted and that His Name may be Mentioned in them; Glorifying Him therein in the mornings and the evenings [24:37] Men whom neither merchandise nor selling diverts from the Remembrance of Allah and the keeping up of Prayer and the giving of Zakat</span>. So you are therein and we<sup>asws</sup> are them<sup>asws</sup>’. ", "So Qatada said to him<sup>asws</sup>, ‘You<sup>asws</sup> have spoken the truth, by Allah<sup>azwj</sup>, may Allah<sup>azwj</sup> Make me to be sacrificed for you! By Allah<sup>azwj</sup>, these are neither houses of stones nor of clay’. Qatada said, ‘So inform me about the cheese’. He (Abu Hamza) said, ‘So Abu Ja’far<sup>asws</sup> smiled, then said: ‘You questions have reverted to this?’ He said, ‘(It is) lost upon me’. So he<sup>asws</sup> said: ‘There is no problem with it’. So he said, ‘Sometimes they put rennet of the dead in it?’ He<sup>asws</sup> said: ‘There is no problem with it. The rennet, there are no veins for it, nor is there blood in it, nor does it have bones for it, but rather it is extracted from between the bowels and blood’. ", "Then he<sup>asws</sup> said: ‘But rather, the rennet is at the status of a dead chicken from which an egg is extracted, so would you eat that egg?’ So Qatada said, ‘No, and I would not instruct with eating it’. So Abu Ja’far<sup>asws</sup> said to him: ‘And why (not)?’ So he said, ‘Because it is from the dead’. He<sup>asws</sup> said to him: ‘So if that egg incubates, so a chicken comes out from it, would you eat it?’ He said, ‘Yes’.  He<sup>asws</sup> said: ‘So what Prohibits the egg upon you and Permits the chicken for you?’ ", "Then he<sup>asws</sup> said: ‘So that rennet is like the egg. So buy the cheese from the markets of the Muslim, from the hand of the Praying one, and do not ask about it except if there comes to you one who informs you about it (that it is from the non-belivers)’."]}}, {"index": 11379, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:6:9:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْهُمْ ( عليهم السلام ) قَالُوا خَمْسَةُ أَشْيَاءَ ذَكِيَّةٌ مِمَّا فِيهَا مَنَافِعُ الْخَلْقِ الْإِنْفَحَةُ وَ الْبَيْضَةُ وَ الصُّوفُ وَ الشَّعْرُ وَ الْوَبَرُ لَا بَأْسَ بِأَكْلِ الْجُبُنِّ كُلِّهِ مِمَّا عَمِلَهُ مُسْلِمٌ أَوْ غَيْرُهُ وَ إِنَّمَا يُكْرَهُ أَنْ يُؤْكَلَ سِوَى الْإِنْفَحَةِ مِمَّا فِي آنِيَةِ الْمَجُوسِ وَ أَهْلِ الْكِتَابِ لِأَنَّهُمْ لَا يَتَوَقَّوْنَ الْمَيْتَةَ وَ الْخَمْرَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, ", "(It has been narrated) from them<sup>asws</sup> having said: ‘Five things are pure from wherein is benefit for the people – the rennet, and the egg, and the wool, and the hair, and the fur. There is no problem with eating the cheese, all of these from what the Muslim had made, or others, and rather it is disliked to eat besides the rennet from what is in the vessels of the Magians, and the People of the Book, because they do not consider the dead and the wine’."]}}, {"index": 11380, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:6:9:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنِ الْحُسَيْنِ بْنِ زُرَارَةَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ أَبِي يَسْأَلُهُ عَنِ اللَّبَنِ مِنَ الْمَيْتَةِ وَ الْبَيْضَةِ مِنَ الْمَيْتَةِ وَ إِنْفَحَةِ الْمَيْتَةِ فَقَالَ كُلُّ هَذَا ذَكِيٌّ قَالَ فَقُلْتُ لَهُ فَشَعْرُ الْخِنْزِيرِ يُعْمَلُ حَبْلًا وَ يُسْتَقَى بِهِ مِنَ الْبِئْرِ الَّتِي يُشْرَبُ مِنْهَا أَوْ يُتَوَضَّأُ مِنْهَا قَالَ لَا بَأْسَ بِهِ .", "وَ زَادَ فِيهِ عَلِيُّ بْنُ عُقْبَةَ وَ عَلِيُّ بْنُ الْحَسَنِ بْنِ رِبَاطٍ قَالَ وَ الشَّعْرُ وَ الصُّوفُ كُلُّهُ ذَكِيٌّ .", "وَ فِي رِوَايَةِ صَفْوَانَ عَنِ الْحُسَيْنِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الشَّعْرُ وَ الصُّوفُ وَ الْوَبَرُ وَ الرِّيشُ وَ كُلُّ نَابِتٍ لَا يَكُونُ مَيْتاً قَالَ وَ سَأَلْتُهُ عَنِ الْبَيْضَةِ تُخْرَجُ مِنْ بَطْنِ الدَّجَاجَةِ الْمَيْتَةِ قَالَ تَأْكُلُهَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Al Husayn Bin Zurara who said, ", "‘I was in the presence of Abu Abdullah<sup>asws</sup> and my father asked him<sup>asws</sup> about the milk from the dead, and the eggs from the dead, and rennet of the dead. So he<sup>asws</sup> said: ‘All this is clean’. So I said to him<sup>asws</sup>, ‘So the hair of the pig by which a rope is made, (water) is drawn by it from the well from which it is drunk, or ablution performed from it?’ He<sup>asws</sup> said: ‘There is no problem with it’. ", "And there increased in it Ali Bin Uqba, and Ali Bin Al-Hassan Bin Ribat, He<sup>asws</sup> said: ‘And the hair and the wool, all of it is clean’.", "And in a report of Safwan, from Al Husayn Bin Zurara, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The hair, and the wool, and the fur, and the feathers, and everything which grows does not happen to be dead’. And I asked him<sup>asws</sup> about the eggs extracted from the belly of the dead chicken. He<sup>asws</sup> said: ‘You can eat it’."]}}, {"index": 11381, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:6:9:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِزُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ اللَّبَنُ وَ اللِّبَأُ وَ الْبَيْضَةُ وَ الشَّعْرُ وَ الصُّوفُ وَ الْقَرْنُ وَ النَّابُ وَ الْحَافِرُ وَ كُلُّ شَيْ‏ءٍ يُفْصَلُ مِنَ الشَّاةِ وَ الدَّابَّةِ فَهُوَ ذَكِيٌّ وَ إِنْ أَخَذْتَهُ مِنْهَا بَعْدَ أَنْ تَمُوتَ فَاغْسِلْهُ وَ صَلِّ فِيهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad, from Hareyz who said, ", "‘Abu Abdullah<sup>asws</sup> said to Zurara and Muhammad Bin Muslim: ‘The milk, and the colostrums, and the eggs, and the hair, and the wool, and the horns, and the teeth, and the hooves, and everything separated from the sheep and the animals, so it is clean, and if it is taken from it after it has died, so wash it and Pray in it’."]}}, {"index": 11382, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:6:9:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي بَيْضَةٍ خَرَجَتْ مِنِ اسْتِ دَجَاجَةٍ مَيْتَةٍ فَقَالَ إِنْ كَانَتِ الْبَيْضَةُ اكْتَسَتِ الْجِلْدَ الْغَلِيظَ فَلَا بَأْسَ بِهَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Gayas Bin Ibrahim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding eggs extracted from the dead chicken. So he<sup>asws</sup> said: ‘If the egg as the hard shell, so there is no problem with it’."]}}, {"index": 11383, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:6:9:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْمُخْتَارِ بْنِ مُحَمَّدِ بْنِ الْمُخْتَارِ وَ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ الْعَلَوِيِّ جَمِيعاً عَنِ الْفَتْحِ بْنِ يَزِيدَ الْجُرْجَانِيِّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ كَتَبْتُ إِلَيْهِ ( عليه السلام ) أَسْأَلُهُ عَنْ جُلُودِ الْمَيْتَةِ الَّتِي يُؤْكَلُ لَحْمُهَا إِنْ ذُكِّيَ فَكَتَبَ لَا يُنْتَفَعُ مِنَ الْمَيْتَةِ بِإِهَابٍ وَ لَا عَصَبٍ وَ كُلُّ مَا كَانَ مِنَ السِّخَالِ مِنَ الصُّوفِ إِنْ جُزَّ وَ الشَّعْرِ وَ الْوَبَرِ وَ الْإِنْفَحَةِ وَ الْقَرْنِ وَ لَا يُتَعَدَّى إِلَى غَيْرِهَا إِنْ شَاءَ اللَّهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Al Mukhtar Bin Muhammad Bin Al Mukhtar, and Muhammad Bin Al Hassan, from Abdullah Bin Al Hassan Al Alawy, altogether from Al Fat’h Bin Yazeed Al Jurjany, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘I wrote to him<sup>asws</sup> asking him<sup>asws</sup> about the skins of the dead whose meat is eaten, if it is clean’. So he<sup>asws</sup> wrote: ‘Do not benefit from the death with neither the skin nor the backbone, and (benefit from) everything what was from the items from the wool if sheared, and the hair, and the fur, and the rennet, and the horn, and do not exceed to other than these, Allah<sup>azwj</sup> Willing’."]}}, {"index": 11384, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:6:6:9:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ عَلِيِّ بْنِ أَبِي الْمُغِيرَةِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ الْمَيْتَةُ يُنْتَفَعُ مِنْهَا بِشَيْ‏ءٍ فَقَالَ لَا قُلْتُ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مَرَّ بِشَاةٍ مَيْتَةٍ فَقَالَ مَا كَانَ عَلَى أَهْلِ هَذِهِ الشَّاةِ إِذَا لَمْ يَنْتَفِعُوا بِلَحْمِهَا أَنْ يَنْتَفِعُوا بِإِهَابِهَا قَالَ تِلْكَ شَاةٌ كَانَتْ لِسَوْدَةَ بِنْتِ زَمْعَةَ زَوْجِ النَّبِيِّ ( صلى الله عليه وآله ) وَ كَانَتْ شَاةً مَهْزُولَةً لَا يُنْتَفَعُ بِلَحْمِهَا فَتَرَكُوهَا حَتَّى مَاتَتْ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا كَانَ عَلَى أَهْلِهَا إِذَا لَمْ يَنْتَفِعُوا بِلَحْمِهَا أَنْ يَنْتَفِعُوا بِإِهَابِهَا أَيْ تُذَكَّى ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, form Ahmad Bin Muhammad, form Ibn Mahboub, from Aasim Bin Humeyd, from Ali Bin Abu Al Mugra who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The dead, can one benefit from it with anything’. So he<sup>asws</sup> said: ‘No’. I said, ‘It has reached us that Rasool-Allah<sup>saww</sup> passed by a dead sheep, so he<sup>saww</sup> said: ‘What was upon the owners of this sheep that when they could not benefit by its flesh, that they did not benefit from its skin?’ He<sup>asws</sup> said: ‘That was a sheep of Sawda Bin Zam’at, wife of the Prophet<sup>saww</sup>, and it was thin and weak, could not be benefit by its flesh. So she left it until it was dead. So Rasool-Allah<sup>saww</sup> said: ‘What was upon the owners of this sheep that when they could not benefit by its flesh, that they did not benefit from its skin?’ i.e., slaughtering it’."]}}]}, "index": "al-kafi:6:6:9", "kind": "verse_list"}