{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:7:4:12",
        "titles": {
          "ar": "باب نَادِرٌ",
          "en": "Chapter 12 - Miscellaneous"
        }
      }
    ],
    "index": 2168,
    "local_index": 12,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:4:12",
    "titles": {
      "ar": "باب نَادِرٌ",
      "en": "Chapter 12 - Miscellaneous"
    },
    "verse_count": 3,
    "verse_start_index": 14020,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 14021,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:12:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ الْحَسَنِ بْنِ صَالِحٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ وُجِدَ مَقْتُولًا فَجَاءَ رَجُلَانِ إِلَى وَلِيِّهِ فَقَالَ أَحَدُهُمَا أَنَا قَتَلْتُهُ عَمْداً وَ قَالَ الْآخَرُ أَنَا قَتَلْتُهُ خَطَأً فَقَالَ إِنْ هُوَ أَخَذَ بِقَوْلِ صَاحِبِ الْعَمْدِ فَلَيْسَ لَهُ عَلَى صَاحِبِ الْخَطَإِ سَبِيلٌ وَ إِنْ أَخَذَ بِقَوْلِ صَاحِبِ الْخَطَإِ فَلَيْسَ لَهُ عَلَى صَاحِبِ الْعَمْدِ سَبِيلٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, form Al Hassan Bin Mahboub, from Al Hassan Bin Salih who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who was found killed, so two men came over to his guardian, so one of the two said, ‘I killed him deliberately’, and the other one said, ‘I killed him in error’. So he<sup>asws</sup> said: ‘If he takes to the words of the one with the deliberation, so there is no way for him upon the one with the error; and if he were to take to the words of the one with the error, so there is no way for him against the one with the deliberation’."
          ]
        }
      },
      {
        "index": 14022,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:12:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ قَالَ أَخْبَرَنِي بَعْضُ أَصْحَابِنَا رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُتِيَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِرَجُلٍ وُجِدَ فِي خَرِبَةٍ وَ بِيَدِهِ سِكِّينٌ مُلَطَّخٌ بِالدَّمِ وَ إِذَا رَجُلٌ مَذْبُوحٌ يَتَشَحَّطُ فِي دَمِهِ فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَا تَقُولُ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَنَا قَتَلْتُهُ قَالَ اذْهَبُوا بِهِ فَاقْتُلُوهُ بِهِ فَلَمَّا ذَهَبُوا بِهِ لِيَقْتُلُوهُ بِهِ أَقْبَلَ رَجُلٌ مُسْرِعاً فَقَالَ لَا تَعْجَلُوا وَ رُدُّوهُ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَرَدُّوهُ",
          "فَقَالَ وَ اللَّهِ يَا أَمِيرَ الْمُؤْمِنِينَ مَا هَذَا صَاحِبَهُ أَنَا قَتَلْتُهُ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لِلْأَوَّلِ مَا حَمَلَكَ عَلَى إِقْرَارِكَ عَلَى نَفْسِكَ وَ لَمْ تَفْعَلْ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ وَ مَا كُنْتُ أَسْتَطِيعُ أَنْ أَقُولَ وَ قَدْ شَهِدَ عَلَيَّ أَمْثَالُ هَؤُلَاءِ الرِّجَالِ وَ أَخَذُونِي وَ بِيَدِي سِكِّينٌ مُلَطَّخٌ بِالدَّمِ وَ الرَّجُلُ يَتَشَحَّطُ فِي دَمِهِ وَ أَنَا قَائِمٌ عَلَيْهِ وَ خِفْتُ الضَّرْبَ ",
          "فَأَقْرَرْتُ وَ أَنَا رَجُلٌ كُنْتُ ذَبَحْتُ بِجَنْبِ هَذِهِ الْخَرِبَةِ شَاةً وَ أَخَذَنِي الْبَوْلُ فَدَخَلْتُ الْخَرِبَةَ فَرَأَيْتُ الرَّجُلَ يَتَشَحَّطُ فِي دَمِهِ فَقُمْتُ مُتَعَجِّباً فَدَخَلَ عَلَيَّ هَؤُلَاءِ فَأَخَذُونِي",
          "فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) خُذُوا هَذَيْنِ فَاذْهَبُوا بِهِمَا إِلَى الْحَسَنِ وَ قُصُّوا عَلَيْهِ قِصَّتَهُمَا وَ قُولُوا لَهُ مَا الْحُكْمُ فِيهِمَا فَذَهَبُوا إِلَى الْحَسَنِ ( عليه السلام ) وَ قَصُّوا عَلَيْهِ قِصَّتَهُمَا فَقَالَ الْحَسَنُ ( عليه السلام ) قُولُوا لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ هَذَا إِنْ كَانَ ذَبَحَ ذَاكَ فَقَدْ أَحْيَا هَذَا وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ مَنْ أَحْياها فَكَأَنَّما أَحْيَا النَّاسَ جَمِيعاً يُخَلَّى عَنْهُمَا وَ تُخْرَجُ دِيَةُ الْمَذْبُوحِ مِنْ بَيْتِ الْمَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of our companions, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘They came to Amir Al-Momineen<sup>asws</sup> with a man (who was found in) some ruins, and in his hand was a knife soaked in blood, and there was a slaughtered man soaked in his blood. So Amir Al-Momineen<sup>asws</sup> said to him: ‘What are you saying?’ He said, ‘O Amir Al-Momineen<sup>asws</sup>! I killed him’. He<sup>asws</sup> said: ‘Go away with him, so kill him’. So when they went away with him in order to kill him, a man came over in haste, so he said, ‘Do not be hasty, and return him to Amir Al-Momineen<sup>asws</sup>!’ So they returned him. ",
            "So he said, ‘By Allah<sup>azwj</sup>, O Amir Al-Momineen<sup>asws</sup>! This one is not its perpetrator, it was I who killed him’. So Amir Al-Momineen<sup>asws</sup> said to the first one: ‘What carried you upon your confession against your own self, and you did not do it?’ So he said, ‘O Amir Al-Momineen<sup>asws</sup>, and I did not have the ability that I should be saying (anything in my defense), and there had testified against me the likes of these men, and they seized me, and in my hand was a knife soaked with the blood, and the man was soaked in his blood, and I was standing over him, and I feared the beating. ",
            "So I confessed, and I am a man who had gone to slaughter a sheep by the side of these ruins, and I was seized (by the need for) the urination. So I entered the ruins, and I saw the man soaked in his blood. So I stood there wondering, and they came over to me, so they seized me’. ",
            "So Amir Al-Momineen<sup>asws</sup> said: ‘Take these two and go with them both to Al-Hassan<sup>asws</sup>, and related both their stories to him<sup>asws</sup> and say to him<sup>asws</sup>: ‘What is the decision with regards to these two?’ So they went to Al-Hassan<sup>asws</sup> and related the both their stories to him<sup>asws</sup>. So Al-Hassan<sup>asws</sup> said: ‘Say to Amir Al-Momineen<sup>asws</sup>, ‘If this one has killed him so he has revived this one, and Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\">[5:32] and whoever keeps it alive, it is as though he kept alive all men</span>. Free them both and take the wergild of the slaughtered one from the public treasury’."
          ]
        }
      },
      {
        "index": 14023,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:12:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ قَتَلَ فَحُمِلَ إِلَى الْوَالِي وَ جَاءَهُ قَوْمٌ فَشَهِدُوا عَلَيْهِ الشُّهُودُ أَنَّهُ قَتَلَهُ عَمْداً فَدَفَعَ الْوَالِي الْقَاتِلَ إِلَى أَوْلِيَاءِ الْمَقْتُولِ لِيُقَادَ بِهِ فَلَمْ يَرْتِمُوا حَتَّى أَتَاهُمْ رَجُلٌ فَأَقَرَّ عِنْدَ الْوَالِي أَنَّهُ قَتَلَ صَاحِبَهُمْ عَمْداً وَ أَنَّ هَذَا الرَّجُلَ الَّذِي شَهِدَ عَلَيْهِ الشُّهُودُ بَرِي‏ءٌ مِنْ قَتْلِ صَاحِبِكُمْ فُلَانٍ فَلَا تَقْتُلُوهُ بِهِ وَ خُذُونِي بِدَمِهِ",
          "قَالَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنْ أَرَادَ أَوْلِيَاءُ الْمَقْتُولِ أَنْ يَقْتُلُوا الَّذِي أَقَرَّ عَلَى نَفْسِهِ فَلْيَقْتُلُوهُ وَ لَا سَبِيلَ لَهُمْ عَلَى الْآخَرِ ثُمَّ لَا سَبِيلَ لِوَرَثَةِ الَّذِي أَقَرَّ عَلَى نَفْسِهِ عَلَى وَرَثَةِ الَّذِي شُهِدَ عَلَيْهِ وَ إِنْ أَرَادُوا أَنْ يَقْتُلُوا الَّذِي شُهِدَ عَلَيْهِ فَلْيَقْتُلُوهُ وَ لَا سَبِيلَ لَهُمْ عَلَى الَّذِي أَقَرَّ ثُمَّ لْيُؤَدِّ الدِّيَةَ الَّذِي أَقَرَّ عَلَى نَفْسِهِ إِلَى أَوْلِيَاءِ الَّذِي شُهِدَ عَلَيْهِ نِصْفَ الدِّيَةِ ",
          "قُلْتُ أَ رَأَيْتَ إِنْ أَرَادُوا أَنْ يَقْتُلُوهُمَا جَمِيعاً قَالَ ذَاكَ لَهُمْ وَ عَلَيْهِمْ أَنْ يَدْفَعُوا إِلَى أَوْلِيَاءِ الَّذِي شُهِدَ عَلَيْهِ نِصْفَ الدِّيَةِ خَاصَّةً دُونَ صَاحِبِهِ ثُمَّ يَقْتُلُونَهُمَا ",
          "قُلْتُ إِنْ أَرَادُوا أَنْ يَأْخُذُوا الدِّيَةَ قَالَ فَقَالَ الدِّيَةُ بَيْنَهُمَا نِصْفَانِ لِأَنَّ أَحَدَهُمَا أَقَرَّ وَ الْآخَرَ شُهِدَ عَلَيْهِ ",
          "قُلْتُ كَيْفَ جُعِلَتْ لِأَوْلِيَاءِ الَّذِي شُهِدَ عَلَيْهِ عَلَى الَّذِي أَقَرَّ عَلَى نَفْسِهِ نِصْفُ الدِّيَةِ حِينَ قُتِلَ وَ لَمْ تُجْعَلْ لِأَوْلِيَاءِ الَّذِي أَقَرَّ عَلَى أَوْلِيَاءِ الَّذِي شُهِدَ عَلَيْهِ وَ لَمْ يُقْتَلْ ",
          "قَالَ فَقَالَ لِأَنَّ الَّذِي شُهِدَ عَلَيْهِ لَيْسَ مِثْلَ الَّذِي أَقَرَّ الَّذِي شُهِدَ عَلَيْهِ لَمْ يُقِرَّ وَ لَمْ يُبْرِئْ صَاحِبَهُ وَ الْآخَرُ أَقَرَّ وَ أَبْرَأَ صَاحِبَهُ فَلَزِمَ الَّذِي أَقَرَّ وَ أَبْرَأَ صَاحِبَهُ مَا لَمْ يَلْزَمِ الَّذِي شُهِدَ عَلَيْهِ وَ لَمْ يُقِرَّ وَ لَمْ يُبْرِئْ صَاحِبَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya from Ahmad Bin Muhammad and Ali Bin Ibrahim from his father, both together from Ibn Mahboub, from Hisham Bin Salim, from Zurara, ",
            "(The narrator) says, ‘I asked Abu Ja’far<sup>asws</sup> about a man who killed, so they carried him to the governor, and a group came so the witnesses testified against him that they killed him deliberately. So the governor handed over the killer to the guardians of the killed one in order for them to retaliate (revenge) against him. So, they had not begun with him when a man came over and confessed in the presence of the governor that he had killed their companion deliberately, and that this man against whom the witnesses had testified is free from the killing of so and so companion of yours, therefore he should not be killed for it, and seize me (instead) for his blood’. ",
            "He (the narrator) said, ‘So Abu Ja’far<sup>asws</sup> said: ‘If the guardians of the killed one intend to kill the one who confessed against himself, so let them kill him, and there would be no way for them against the other one. Then there is no way for the inheritors of the one who confessed against himself against the inheritors of the one testified against. And if they intend to kill the one who has been testified against, so let them kill him, and there would be no way for them against the one who confessed. Then the one who confessed against himself should pay the wergild to the guardians of the one testified against, of half the wergild’. ",
            "I said, ‘What is your<sup>asws</sup> view if they intend to they should kill both of them together?’ He<sup>asws</sup> said: ‘That is for them, and upon them would be that they should hand over half the wergild to the guardians of the one testified against in particular, besides his companion. Then they can kill both of them’. ",
            "I said, ‘What is your<sup>asws</sup> view if they intend to take the wergild?’ So he<sup>asws</sup> said: ‘The wergild is in two halves in between them both, because one of the two confessed, and the other one has been testified against’. ",
            "I said, ‘How come you<sup>asws</sup> made half the wergild to be for the guardians of the one who was testified against, over the one who confessed against himself that he had killed, and did not make it for the guardians of the one who confessed against himself over the one who was testified against, and he did not kill?’ ",
            "So he<sup>asws</sup> said: ‘Because the one who was testified against is not similar to the one who confessed. The one who was testified against did not confess and did not free his companions, and the one other confessed and freed his companion. Therefore, it necessitates that the one who confessed and freed his companion that does not necessitate the one who was testified against, and did not confess and did not free his companion’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:4:12",
  "kind": "verse_list"
}