{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:7:4", "titles": {"ar": "كِتَابُ الدِّيَاتِ", "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"}}, {"indexed_titles": {"en": "Chapter 20"}, "path": "/books/al-kafi:7:4:20", "titles": {"ar": "باب مَنْ خَطَؤُهُ عَمْدٌ وَ مَنْ عَمْدُهُ خَطَأٌ", "en": "Chapter 20 – The one whose error is (like) deliberate, and one whose deliberation is (like) an error"}}], "index": 2166, "local_index": 20, "part_type": "Chapter", "path": "/books/al-kafi:7:4:20", "titles": {"ar": "باب مَنْ خَطَؤُهُ عَمْدٌ وَ مَنْ عَمْدُهُ خَطَأٌ", "en": "Chapter 20 – The one whose error is (like) deliberate, and one whose deliberation is (like) an error"}, "verse_count": 3, "verse_start_index": 14058, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14059, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:4:20:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سُئِلَ عَنْ غُلَامٍ لَمْ يُدْرِكْ وَ امْرَأَةٍ قَتَلَا رَجُلًا خَطَأً فَقَالَ إِنَّ خَطَأَ الْمَرْأَةِ وَ الْغُلَامِ عَمْدٌ فَإِنْ أَحَبَّ أَوْلِيَاءُ الْمَقْتُولِ أَنْ يَقْتُلُوهُمَا قَتَلُوهُمَا وَ يُؤَدُّوا إِلَى أَوْلِيَاءِ الْغُلَامِ خَمْسَةَ آلَافِ دِرْهَمٍ وَ إِنْ أَحَبُّوا أَنْ يَقْتُلُوا الْغُلَامَ قَتَلُوهُ وَ تَرُدُّ الْمَرْأَةُ إِلَى أَوْلِيَاءِ الْغُلَامِ رُبُعَ الدِّيَةِ وَ إِنْ أَحَبَّ أَوْلِيَاءُ الْمَقْتُولِ أَنْ يَقْتُلَ الْمَرْأَةَ قَتَلُوهَا وَ يَرُدُّ الْغُلَامُ عَلَى أَوْلِيَاءِ الْمَرْأَةِ رُبُعَ الدِّيَةِ قَالَ وَ إِنْ أَحَبَّ أَوْلِيَاءُ الْمَقْتُولِ أَنْ يَأْخُذُوا الدِّيَةَ كَانَ عَلَى الْغُلَامِ نِصْفُ الدِّيَةِ وَ عَلَى الْمَرْأَةِ نِصْفُ الدِّيَةِ ."], "translations": {"en.hubeali": ["Muhmmad Bin Yahya, from Ahmad Bin Muhammad and Ali Bin Ibrahim, from his father, both together from Al Hassan Bin Mahboub, from Hisham Bin Salim, from Abu Baseer, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having been asked about a boy who had yet to mature and a woman, both killed a man in error. So he<sup>asws</sup> said: ‘The error of the woman and the boy is (considered) deliberate. So if the guardians of the killed one like to kill both of them, they can kill them both and pay five thousand Dirhams to the guardians of the boy; and if they like to kill the boy, they kill him and the guardians of the woman return a quarter of the wergild to the guardians of the boy; and if the guardians of the killed one kill the woman, and the boy return a quarter of the wergild to the guardians of the woman; and if the guardians of the killed one like to take the wergild, upon the boy is half the wergild, and upon the woman is half the wergild’."]}}, {"index": 14060, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:4:20:2", "text": ["ابْنُ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ ضُرَيْسٍ الْكُنَاسِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ امْرَأَةٍ وَ عَبْدٍ قَتَلَا رَجُلًا خَطَأً فَقَالَ إِنَّ خَطَأَ الْمَرْأَةِ وَ الْعَبْدِ مِثْلُ الْعَمْدِ فَإِنْ أَحَبَّ أَوْلِيَاءُ الْمَقْتُولِ أَنْ يَقْتُلُوهُمَا قَتَلُوهُمَا فَإِنْ كَانَ قِيمَةُ الْعَبْدِ أَكْثَرَ مِنْ خَمْسَةِ آلَافِ دِرْهَمٍ فَلْيَرُدُّوا إِلَى سَيِّدِ الْعَبْدِ مَا يَفْضُلُ بَعْدَ الْخَمْسَةِ آلَافِ دِرْهَمٍ وَ إِنْ أَحَبُّوا أَنْ يَقْتُلُوا الْمَرْأَةَ وَ يَأْخُذُوا الْعَبْدَ أَخَذُوا إِلَّا أَنْ يَكُونَ قِيمَتُهُ أَكْثَرَ مِنْ خَمْسَةِ آلَافِ دِرْهَمٍ فَلْيَرُدُّوا عَلَى مَوْلَى الْعَبْدِ مَا يَفْضُلُ بَعْدَ الْخَمْسَةِ آلَافِ دِرْهَمٍ وَ يَأْخُذُوا الْعَبْدَ أَوْ يَفْتَدِيَهُ سَيِّدُهُ وَ إِنْ كَانَتْ قِيمَةُ الْعَبْدِ أَقَلَّ مِنْ خَمْسَةِ آلَافِ دِرْهَمٍ فَلَيْسَ لَهُمْ إِلَّا الْعَبْدُ ."], "translations": {"en.hubeali": ["Ibn Mahboub, from Abu Ayoub, from Zureys Al Kunasy who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a woman and a slave who both kill a man in error. So he<sup>asws</sup> said: ‘The error of the woman and the slave is like the deliberate. So if the guardians of the killed one like to kill both of them, they can kill both of them. So if it was such that the value of the slave is more than five thousand Dirhams, so let it be returned to the master of the slave what remains after the five thousand Dirhams; and if they like to kill the woman and take the salve, or ransom him by his master; and if the value of the slave is less than the five thousand Dirhams, so there is nothing for them except for the slave’."]}}, {"index": 14061, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:4:20:3", "text": ["ابْنُ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ عَمَّارٍ السَّابَاطِيِّ عَنْ أَبِي عُبَيْدَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ أَعْمَى فَقَأَ عَيْنَ صَحِيحٍ [مُتَعَمِّداً] قَالَ فَقَالَ يَا أَبَا عُبَيْدَةَ إِنَّ عَمْدَ الْأَعْمَى مِثْلُ الْخَطَإِ هَذَا فِيهِ الدِّيَةُ مِنْ مَالِهِ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ فَإِنَّ دِيَتَهُ عَلَى الْإِمَامِ وَ لَا يَبْطُلُ حَقُّ مُسْلِمٍ ."], "translations": {"en.hubeali": ["Ibn Mahboub, from Hisham Bin Salim, from Ammar Al Sabaty, from Abu Ubeyda who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about a blind (man) who blinded an eye of a correct one deliberately. So he<sup>asws</sup> said: ‘O Abu Ubeyda! The deliberation of the blind is like the error. In this in the wergild from his own wealth. So if there does not happen to be wealth for him, so his wergild is upon the Imam<sup>asws</sup>, and a right of a Muslim would not be invalidated’."]}}]}, "index": "al-kafi:7:4:20", "kind": "verse_list"}