{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:7:4:24",
        "titles": {
          "ar": "باب الْمُكَاتَبِ يَقْتُلُ الْحُرَّ أَوْ يَجْرَحُهُ وَ الْحُرِّ يَقْتُلُ الْمُكَاتَبَ أَوْ يَجْرَحُهُ",
          "en": "Chapter 24 – The contracted slave kills the free or injures him, and the free kills the contracted slave or injures him"
        }
      }
    ],
    "index": 2180,
    "local_index": 24,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:7:4:25",
        "titles": {
          "ar": "باب الْمُسْلِمِ يَقْتُلُ الذِّمِّيَّ أَوْ يَجْرَحُهُ وَ الذِّمِّيِّ يَقْتُلُ الْمُسْلِمَ أَوْ يَجْرَحُهُ أَوْ يَقْتَصُّ بَعْضُهُمْ بَعْضاً",
          "en": "Chapter 25 – The Muslim kills the Zimmy or injures him, and the Zimmy kills the Muslim or injures him, or they retaliate against each other"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:7:4:23",
        "titles": {
          "ar": "باب الرَّجُلِ الْحُرِّ يَقْتُلُ مَمْلُوكَ غَيْرِهِ أَوْ يَجْرَحُهُ وَ الْمَمْلُوكِ يَقْتُلُ الْحُرَّ أَوْ يَجْرَحُهُ",
          "en": "Chapter 23 – The free man kills a slave of someone else, or injures him, and the slave kills the free or injures him"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:4:24",
    "titles": {
      "ar": "باب الْمُكَاتَبِ يَقْتُلُ الْحُرَّ أَوْ يَجْرَحُهُ وَ الْحُرِّ يَقْتُلُ الْمُكَاتَبَ أَوْ يَجْرَحُهُ",
      "en": "Chapter 24 – The contracted slave kills the free or injures him, and the free kills the contracted slave or injures him"
    },
    "verse_count": 5,
    "verse_start_index": 14102,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 14103,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/266",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1661",
              "text": "مُحَمَّدِ بْنِ قَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:24:1",
        "text": [
          " قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي مُكَاتَبٍ قُتِلَ قَالَ يُحْسَبُ مَا أُعْتِقَ مِنْهُ فَيُؤَدَّى دِيَةُ الْحُرِّ وَ مَا رَقَّ مِنْهُ فَدِيَةُ الْعَبْدِ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a contracted slave who was killed. He<sup>asws</sup> said: ‘It would be counted what (proportion) he was free from it, so he (the killer) would pay the wergild of the free, and what (proportion) he was still enslaved from it, is a ransom of the slave’."
          ]
        }
      },
      {
        "index": 14104,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1472",
              "text": "أَبِي وَلَّادٍ الْحَنَّاطِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ الْحَنَّاطِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:24:2",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ مُكَاتَبٍ اشْتَرَطَ عَلَيْهِ مَوْلَاهُ حِينَ كَاتَبَهُ جَنَى إِلَى رَجُلٍ جِنَايَةً فَقَالَ إِنْ كَانَ أَدَّى مِنْ مُكَاتَبَتِهِ شَيْئاً أُغْرِمَ فِي جِنَايَتِهِ بِقَدْرِ مَا أَدَّى مِنْ مُكَاتَبَتِهِ لِلْحُرِّ فَإِنْ عَجَزَ عَنْ حَقِّ الْجِنَايَةِ شَيْئاً أُخِذَ ذَلِكَ مِنْ مَالِ الْمَوْلَى الَّذِي كَاتَبَهُ ",
          "قُلْتُ فَإِنْ كَانَتِ الْجِنَايَةُ لِلْعَبْدِ قَالَ فَقَالَ عَلَى مِثْلِ ذَلِكَ دُفِعَ إِلَى مَوْلَى الْعَبْدِ الَّذِي جَرَحَهُ الْمُكَاتَبُ وَ لَا تَقَاصَّ بَيْنَ الْمُكَاتَبِ وَ بَيْنَ الْعَبْدِ إِذَا كَانَ الْمُكَاتَبُ قَدْ أَدَّى مِنْ مُكَاتَبَتِهِ شَيْئاً فَإِنْ لَمْ يَكُنْ أَدَّى مِنْ مُكَاتَبَتِهِ شَيْئاً فَإِنَّهُ يُقَاصُّ الْعَبْدُ مِنْهُ أَوْ يُغَرَّمُ الْمَوْلَى كُلَّ مَا جَنَى الْمُكَاتَبُ لِأَنَّهُ عَبْدُهُ مَا لَمْ يُؤَدِّ مِنْ مُكَاتَبَتِهِ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad and Ali Bin Ibrahim, from his father, both together from Ibn Mahboub, from Abu Wallad Al Hannat who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a contracted slave, his master stipulated a condition upon him when he contracted him, he would pay to a man he commits a crime against. So he<sup>asws</sup> said; ‘If he has fulfilled something from his contract, he would be fined for his crime in accordance with what he has paid from his contract, to the free. So if he was frustrated from (paying) anything from the right of the crime, that would be taken from the wealth of the master who had contracted him’. ",
            "I said, ‘If it was that the (compensation of the) crime was for the slave?’ So he<sup>asws</sup> said: ‘A similar amount would be handed over to the master of the slave whom the contracted slave injured, and there would be no retaliation between the contracted slave and the (owned) slave when it was that the contracted slave had paid something off from his contract. So if he did not happen to have paid something off from his contract, so the slave would be retaliated from him, or the master would be fined for every crime which the contracted slave committed, because he is his slave, if he has not paid anything off from his contract’."
          ]
        }
      },
      {
        "index": 14105,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1205",
              "text": "ابْنُ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/362",
              "text": "أَبِي أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "ابْنُ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:24:3",
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ مُكَاتَبٍ قَتَلَ رَجُلًا خَطَأً قَالَ فَقَالَ إِنْ كَانَ مَوْلَاهُ حِينَ كَاتَبَهُ اشْتَرَطَ عَلَيْهِ إِنْ عَجَزَ فَهُوَ رَدٌّ فِي الرِّقِّ فَهُوَ بِمَنْزِلَةِ الْمَمْلُوكِ يُدْفَعُ إِلَى أَوْلِيَاءِ الْمَقْتُولِ فَإِنْ شَاءُوا قَتَلُوا وَ إِنْ شَاءُوا بَاعُوا وَ إِنْ كَانَ مَوْلَاهُ حِينَ كَاتَبَهُ لَمْ يَشْتَرِطْ عَلَيْهِ وَ قَدْ كَانَ أَدَّى مِنْ مُكَاتَبَتِهِ شَيْئاً فَإِنَّ عَلِيّاً ( عليه السلام ) كَانَ يَقُولُ يُعْتَقُ مِنَ الْمُكَاتَبِ بِقَدْرِ مَا أَدَّى مِنْ مُكَاتَبَتِهِ ",
          "فَإِنَّ عَلَى الْإِمَامِ أَنْ يُؤَدِّيَ إِلَى أَوْلِيَاءِ الْمَقْتُولِ مِنَ الدِّيَةِ بِقَدْرِ مَا أُعْتِقَ مِنَ الْمُكَاتَبِ وَ لَا يَبْطُلُ دَمُ امْرِئٍ مُسْلِمٍ وَ أَرَى أَنْ يَكُونَ مَا بَقِيَ عَلَى الْمُكَاتَبِ مِمَّا لَمْ يُؤَدِّهِ رِقّاً لِأَوْلِيَاءِ الْمَقْتُولِ يَسْتَخْدِمُونَهُ حَيَاتَهُ بِقَدْرِ مَا بَقِيَ عَلَيْهِ وَ لَيْسَ لَهُمْ أَنْ يَبِيعُوهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Abu Ayoub, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about a contracted slave who killed a man in error. So he<sup>asws</sup> said: ‘If it was the case that his master had stipulated upon him when he contracted him, that if he was frustrated (from paying), so he would return it with regards to the slave, so he would be at the status of the owned slave. He would be handed over to the guardians of the killed one, so if they so desire to they can kill him, and if they so desire to they can sell him. And if it was that his master, when he contracted him, did not stipulate upon him, and it was such that he had paid something off from his contract, so Ali<sup>asws</sup> was saying: ‘He would be free from the contract in proportionate to what he has paid off from his contract’. ",
            "Thus it would be upon the Imam<sup>asws</sup> that he<sup>asws</sup> pays the wergild to the guardians of the killed one in accordance to what he has been freed from the contract, and the blood of a Muslim person would not be invalidated. And I<sup>asws</sup> see that whatever remains upon the contracted slave, from what he has not paid off, he would be enslave to the guardians of the killed one, to serve them for his life, in proportionate to what remains upon him, and it would not be for them that they sell him’."
          ]
        }
      },
      {
        "index": 14106,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/313",
              "text": "إِسْمَاعِيلَ بْنِ مَرَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:24:4",
        "text": [
          " فِي مُكَاتَبٍ قَتَلَ رَجُلًا خَطَأً قَالَ عَلَيْهِ مِنْ دِيَتِهِ بِقَدْرِ مَا أُعْتِقَ وَ عَلَى مَوْلَاهُ مَا بَقِيَ مِنْ قِيمَةِ الْمَمْلُوكِ فَإِنْ عَجَزَ الْمُكَاتَبُ فَلَا عَاقِلَةَ لَهُ إِنَّمَا ذَلِكَ عَلَى إِمَامِ الْمُسْلِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding a contracted slave who killed a man in error. He<sup>asws</sup> said: ‘Upon him from his wergild, is in proportion to what he is free, and upon his master is what remains from the value of the price. So if the contracted slave is frustrated (from paying), so there is no blood (compensation) for him. But rather, that is upon the Imam<sup>asws</sup> of the Muslims’."
          ]
        }
      },
      {
        "index": 14107,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2753",
              "text": "الْحَسَنِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ الْحَسَنِ بْنِ صَالِحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:24:5",
        "text": [
          " رَجُلٍ حُرٍّ قَتَلَ عَبْداً قِيمَتُهُ عِشْرُونَ أَلْفَ دِرْهَمٍ فَقَالَ لَا يَجُوزُ أَنْ يُتَجَاوَزَ بِقِيمَةِ عَبْدٍ أَكْثَرَ مِنْ دِيَةِ حُرٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Hassan Bin Mahboub, from Al Hassan Bin Salih, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a free man who kills a slave who value is twenty thousand Dirham. So he<sup>asws</sup> said: ‘It is not allowed that the value of a slave should be more than the wergild of a free’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:4:24",
  "kind": "verse_list"
}