{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:7:4", "titles": {"ar": "كِتَابُ الدِّيَاتِ", "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"}}, {"indexed_titles": {"en": "Chapter 31"}, "path": "/books/al-kafi:7:4:31", "titles": {"ar": "باب مَا يُمْتَحَنُ بِهِ مَنْ يُصَابُ فِي سَمْعِهِ أَوْ بَصَرِهِ أَوْ غَيْرِ ذَلِكَ مِنْ جَوَارِحِهِ وَ الْقِيَاسِ فِي ذَلِكَ", "en": "Chapter 31 – What he is tested with, the one who is hit regards to his hearing, or his sight, or other than that from his limbs, and the quantification regarding that"}}], "index": 2177, "local_index": 31, "part_type": "Chapter", "path": "/books/al-kafi:7:4:31", "titles": {"ar": "باب مَا يُمْتَحَنُ بِهِ مَنْ يُصَابُ فِي سَمْعِهِ أَوْ بَصَرِهِ أَوْ غَيْرِ ذَلِكَ مِنْ جَوَارِحِهِ وَ الْقِيَاسِ فِي ذَلِكَ", "en": "Chapter 31 – What he is tested with, the one who is hit regards to his hearing, or his sight, or other than that from his limbs, and the quantification regarding that"}, "verse_count": 10, "verse_start_index": 14152, "verses": [{"index": 14153, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:4:31:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي رَجُلٍ ضَرَبَ رَجُلًا فِي رَأْسِهِ فَثَقُلَ لِسَانُهُ أَنَّهُ يُعْرَضُ عَلَيْهِ حُرُوفُ الْمُعْجَمِ كُلُّهَا ثُمَّ يُعْطَى الدِّيَةَ بِحِصَّةِ مَا لَمْ يُفْصِحْهُ مِنْهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Mahboub and Muhammad Bin Yahya, from Ahamd Bin Muhammad, from Ibn Mahboub, from Abu Ayoub, from Suleyman Bin Khalid, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘With regard to a man who struck a man in his head, so his tongue became heavy, there would be presented to him the letters of the alphabet, all of them. Then he would be given the wergild by the counting of what he could not pronounce correctly from these’."}]}, {"index": 14154, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:4:31:2", "text": "عَنْهُ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ ضَرَبَ رَجُلًا بِعَصاً عَلَى رَأْسِهِ فَثَقُلَ لِسَانُهُ فَقَالَ يُعْرَضُ عَلَيْهِ حُرُوفُ الْمُعْجَمِ فَمَا أَفْصَحَ مِنْهُ بِهِ وَ مَا لَمْ يُفْصِحْ بِهِ كَانَ عَلَيْهِ الدِّيَةُ وَ هِيَ تِسْعَةٌ وَ عِشْرُونَ حَرْفاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from his father, from Abdullah Bin Al Mugheira, from Abdullah Bin Sinan, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who struck a man with a stick upon his head, so his tongue became heavy. So he<sup>asws</sup> said: ‘There would be presented to him the letter of the alphabet, so whatever he pronounces eloquently from it, and whatever he cannot pronounce eloquently from it, the wergild would be (based) upon it, and these are twenty nine letters’."}]}, {"index": 14155, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:4:31:3", "text": "عَنْهُ عَنْ أَبِيهِ وَ مُحَمَّدِ بْنِ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ فِي رَجُلٍ ضَرَبَ رَجُلًا فِي أُذُنِهِ بِعَظْمٍ فَادَّعَى أَنَّهُ لَا يَسْمَعُ قَالَ يُتَرَصَّدُ وَ يُسْتَغْفَلُ وَ يُنْتَظَرُ بِهِ سَنَةً فَإِنْ سَمِعَ أَوْ شَهِدَ عَلَيْهِ رَجُلَانِ أَنَّهُ يَسْمَعُ وَ إِلَّا حَلَّفَهُ وَ أَعْطَاهُ الدِّيَةَ \nقِيلَ يَا أَمِيرَ الْمُؤْمِنِينَ فَإِنْ عُثِرَ عَلَيْهِ بَعْدَ ذَلِكَ أَنَّهُ يَسْمَعُ قَالَ إِنْ كَانَ اللَّهُ عَزَّ وَ جَلَّ رَدَّ عَلَيْهِ سَمْعَهُ لَمْ أَرَ عَلَيْهِ شَيْئاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, both together from Ibn Mahboub, from Abu Ayoub, from Suleyman Bin Khalid, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said with regards to a man who struck a man in his ear with a bone, so he claimed that he cannot hear. He<sup>asws</sup> said: ‘He would be placed under surveillance and would be awaited with for a year. So if he hears, or two men testify against him that he can hear, or else he would be made to swear an oath, and he would be given the wergild’. \nIt was said, ‘O Amir Al-Momineen<sup>asws</sup>! So if it was discovered afterwards that he can hear?’ He<sup>asws</sup> said: ‘If Allah<sup>azwj</sup> Mighty and Majestic Returns his hearing, I<sup>asws</sup> do not see anything upon him’."}]}, {"index": 14156, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:4:31:4", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ وُجِئَ فِي أُذُنِهِ فَادَّعَى أَنَّ إِحْدَى أُذُنَيْهِ نَقَصَ مِنْ سَمْعِهَا شَيْ‏ءٌ قَالَ قَالَ تُسَدُّ الَّتِي ضُرِبَتْ سَدّاً شَدِيداً وَ تُفْتَحُ الصَّحِيحَةُ فَيُضْرَبُ لَهَا بِالْجَرَسِ حِيَالَ وَجْهِهِ وَ يُقَالُ لَهُ اسْمَعْ فَإِذَا خَفِيَ عَلَيْهِ الصَّوْتُ عُلِّمَ مَكَانُهُ ثُمَّ يُضْرَبُ بِهِ مِنْ خَلْفِهِ وَ يُقَالُ لَهُ اسْمَعْ فَإِذَا خَفِيَ عَلَيْهِ الصَّوْتُ عُلِّمَ مَكَانُهُ ثُمَّ يُقَاسُ مَا بَيْنَهُمَا فَإِنْ كَانَا سَوَاءً عُلِمَ أَنَّهُ قَدْ صَدَقَ\nثُمَّ يُؤْخَذُ بِهِ عَنْ يَمِينِهِ ثُمَّ يُضْرَبُ حَتَّى يَخْفَى عَلَيْهِ الصَّوْتُ ثُمَّ يُعَلَّمُ مَكَانُهُ ثُمَّ يُؤْخَذُ بِهِ عَنْ يَسَارِهِ فَيُضْرَبُ حَتَّى يَخْفَى عَلَيْهِ الصَّوْتُ ثُمَّ يُعَلَّمُ مَكَانُهُ ثُمَّ يُقَاسُ مَا بَيْنَهُمَا فَإِنْ كَانَ سَوَاءً عُلِمَ أَنَّهُ قَدْ صَدَقَ \nقَالَ ثُمَّ تُفْتَحُ أُذُنُهُ الْمُعْتَلَّةُ وَ تُسَدُّ الْأُخْرَى سَدّاً جَيِّداً ثُمَّ يُضْرَبُ بِالْجَرَسِ مِنْ قُدَّامِهِ ثُمَّ يُعَلَّمُ حَيْثُ يَخْفَى عَلَيْهِ الصَّوْتُ يُصْنَعُ بِهِ كَمَا صُنِعَ أَوَّلَ مَرَّةٍ بِأُذُنِهِ الصَّحِيحَةِ ثُمَّ يُقَاسُ فَضْلُ مَا بَيْنَ الصَّحِيحَةِ وَ الْمُعْتَلَّةِ بِحِسَابِ ذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ibn Mahboub, from Ali Bin Abu Hamza, from Abu Baseer, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man was hit in his ear, so he claimed that one of his ears is deficient from hearing anything. He<sup>asws</sup> said: ‘The struck ear would be covered up with an intense covering, and the correct ear would be kept open. So the bell would be sounded towards his face and it would be said to him, ‘Listen’. So when the sound is hidden to him, its place would be noted. Then it (the bell) would be sounded from behind him, and it would be said to him, ‘Listen’. So when the sound is hidden from him its place would be noted. Then it would be measured what is between the two. So if it was the same, it would be known that he is speaking the truth. \nThen he would be seized by it from his right. Then it (the bell) would be sounded until the sound is hidden from him. Then its place would be noted. Then he would be seized by it from his left. So it (the bell) would be sounded until the sound is hidden from him. Then its place would be noted. There it would be measured what is between the two. So if it was the same, it would be known that he is speaking the truth.\nHe<sup>asws</sup> said: ‘Then his damaged ear would be opened up, and the other one would be closed with a new covering. Then the bell would be struck from in front of him. Then the sounds would be hidden from him, and he would be dealt with just as he had been dealt with the first time around, with his healthy ear. Then to find the difference of the hearing (abilities) of both ears to calculate a fair compensation on the basis of the differences that may have happened between the two ears."}]}, {"index": 14157, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:4:31:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا ضُرِبَ الرَّجُلُ عَلَى رَأْسِهِ فَثَقُلَ لِسَانُهُ عُرِضَتْ عَلَيْهِ حُرُوفُ الْمُعْجَمِ يَقْرَأُ ثُمَّ قُسِمَتِ الدِّيَةُ عَلَى حُرُوفِ الْمُعْجَمِ فَمَا لَمْ يُفْصِحْ بِهِ الْكَلَامَ كَانَتِ الدِّيَةُ بِالْقِيَاسِ مِنْ ذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the man is struck upon his head, so his tongues becomes heavy, the letters of the alphabet would be presented to him. He would read, then the wergild would be divided upon the letters of the alphabet. So whatever he could not pronounce eloquently with the speech, the wergild would be quantified by the measurement from that’."}]}, {"index": 14158, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:7:4:31:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْحَسَنِ بْنِ كَثِيرٍ عَنْ أَبِيهِ قَالَ قَالَ أُصِيبَتْ عَيْنُ رَجُلٍ وَ هِيَ قَائِمَةٌ فَأَمَرَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَرُبِطَتْ عَيْنُهُ الصَّحِيحَةُ وَ أَقَامَ رَجُلًا بِحِذَاهُ بِيَدِهِ بَيْضَةٌ يَقُولُ هَلْ تَرَاهَا قَالَ فَجَعَلَ إِذَا قَالَ نَعَمْ تَأَخَّرَ قَلِيلًا حَتَّى إِذَا خَفِيَتْ عَلَيْهِ عُلِّمَ ذَلِكَ الْمَكَانُ \nقَالَ وَ عُصِّبَتْ عَيْنُهُ الْمُصَابَةُ وَ جَعَلَ الرَّجُلُ يَتَبَاعَدُ وَ هُوَ يَنْظُرُ بِعَيْنِهِ الصَّحِيحَةِ حَتَّى إِذَا خَفِيَتْ عَلَيْهِ ثُمَّ قِيسَ مَا بَيْنَهُمَا فَأُعْطِيَ الْأَرْشَ عَلَى ذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from one of his companions, from Aban Bin Usman, from Al Hassan Bin Kaseer, from his father who said, \n‘An eye of a man was hit, and it was firm (in its place). So Amir Al-Momineen<sup>asws</sup> ordered for his healthy eye to be tied up (blindfolded), and got a man to stand in front of him with an egg in his hand. He<sup>asws</sup> said to him: ‘Can you see it?’ So when he said, ‘Yes, he<sup>asws</sup> made him to stand away a little more, (repeating the process) until it was hidden from him (could not see it anymore), he<sup>asws</sup> noted that place. \nHe<sup>asws</sup> said: ‘And he<sup>asws</sup> tied up (blindfolded) the struck eye and made the man to be remote, and he was looking with his healthy eye, until it was hidden to him (could not see it anymore). Then he<sup>asws</sup> compared what was between the two, so he<sup>asws</sup> gave him the compensation upon that’."}]}, {"index": 14159, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:7:4:31:7", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ مُحَمَّدِ بْنِ فُرَاتٍ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ قَالَ سُئِلَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَنْ رَجُلٍ ضَرَبَ رَجُلًا عَلَى هَامَتِهِ فَادَّعَى الْمَضْرُوبُ أَنَّهُ لَا يُبْصِرُ شَيْئاً وَ لَا يَشَمُّ الرَّائِحَةَ وَ أَنَّهُ قَدْ ذَهَبَ لِسَانُهُ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنْ صَدَقَ فَلَهُ ثَلَاثُ دِيَاتٍ \nفَقِيلَ يَا أَمِيرَ الْمُؤْمِنِينَ وَ كَيْفَ يُعْلَمُ أَنَّهُ صَادِقٌ فَقَالَ أَمَّا مَا ادَّعَاهُ أَنَّهُ لَا يَشَمُّ الرَّائِحَةَ فَإِنَّهُ يُدْنَى مِنْهُ الْحُرَاقُ فَإِنْ كَانَ كَمَا يَقُولُ وَ إِلَّا نَحَّى رَأْسَهُ وَ دَمَعَتْ عَيْنُهُ وَ أَمَّا مَا ادَّعَاهُ فِي عَيْنِهِ فَإِنَّهُ يُقَابَلُ بِعَيْنِهِ الشَّمْسُ فَإِنْ كَانَ كَاذِباً لَمْ يَتَمَالَكْ حَتَّى يُغَمِّضَ عَيْنَهُ وَ إِنْ كَانَ صَادِقاً بَقِيَتَا مَفْتُوحَتَيْنِ وَ أَمَّا مَا ادَّعَاهُ فِي لِسَانِهِ فَإِنَّهُ يُضْرَبُ عَلَى لِسَانِهِ بِإِبْرَةٍ فَإِنْ خَرَجَ الدَّمُ أَحْمَرَ فَقَدْ كَذَبَ وَ إِنْ خَرَجَ الدَّمُ أَسْوَدَ فَقَدْ صَدَقَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Al Waleed, from Muhammad Bin Furaat, from Al Asbagh Bin Nabata who said, \n‘Amir Al-Momineen<sup>asws</sup> was asked about a man who struck a man upon his head. So the struck one claimed that he could not visualise anything, nor smell the aromas, and that his tongue had gone. So Amir Al-Momineen<sup>asws</sup> said: ‘If he is speaking the truth, there would be three wergilds for him’. \nSo it was said, ‘O Amir Al-Momineen<sup>asws</sup>! And how does one know that he is truthful?’ So he<sup>asws</sup> said: ‘As for what he claimed that he could not smell the aromas, the tinder (firewood) would be brought near him. So if it was as he is saying, or else he would turn his head away and his eyes would water. And as for what he is claiming regarding his eyes, so he would be made to turn to face the sun with his eyes. So if he was lying, he would not be able to control himself from closing his eyes, and if he was truthful, they would both remain open. And as for what he claims regarding his tongue, so he would be pricked by a needle upon his tongue, so if the red blood comes out, so he has lied, and if the black blood comes out, so he has spoken truthfully’."}]}, {"index": 14160, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:7:4:31:8", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يُصَابُ فِي عَيْنِهِ فَيَذْهَبُ بَعْضُ بَصَرِهِ أَيَّ شَيْ‏ءٍ يُعْطَى قَالَ تُرْبَطُ إِحْدَاهُمَا ثُمَّ يُوضَعُ لَهُ بَيْضَةٌ ثُمَّ يُقَالُ لَهُ انْظُرْ فَمَا دَامَ يَدَّعِي أَنَّهُ يُبْصِرُ مَوْضِعَهَا حَتَّى إِذَا انْتَهَى إِلَى مَوْضِعٍ إِنْ جَازَهُ قَالَ لَا أُبْصِرُ قَرَّبَهَا حَتَّى يُبْصِرَ ثُمَّ يُعَلَّمُ ذَلِكَ الْمَكَانُ ثُمَّ يُقَاسُ بِذَلِكَ الْقِيَاسِ مِنْ خَلْفِهِ وَ عَنْ يَمِينِهِ وَ عَنْ شِمَالِهِ فَإِنْ جَاءَ سَوَاءً وَ إِلَّا قِيلَ لَهُ كَذَبْتَ حَتَّى يَصْدُقَ قَالَ قُلْتُ أَ لَيْسَ يُؤْمَنُ قَالَ لَا وَ لَا كَرَامَةَ وَ يُصْنَعُ بِالْعَيْنِ الْأُخْرَى مِثْلُ ذَلِكَ ثُمَّ يُقَاسُ ذَلِكَ عَلَى دِيَةِ الْعَيْنِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Hammad Bin Isa, from Muawiya Bin Ammar who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the man who was hit in his eye, so part of his vision was gone. Which thing would he be given?’ He<sup>asws</sup> said: ‘One of it (eyes) would be covered and an egg would be placed for him, then it would be said to him, ‘Look!’ So for as long as he claims that he can see its place, (it would be moved away) until it ends up at a place that he is helpless (from seeing it), so he says, ‘I cannot see it’. It would be brought nearer until he can visualise it, then a note would be made of that place. Then it would be compared with that from behind him, and from his right, and from his left. So it comes to be the same, or else it would be said to him, ‘You are lying’, until he speaks the truth’. I said, ‘Can he not be trusted?’ He<sup>asws</sup> said: ‘No, and there is no honour, and he would be dealt with the other eye similar to that. Then the wergild of the eye would be based upon that’."}]}, {"index": 14161, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:7:4:31:9", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ وَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ جَمِيعاً عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ يُونُسُ عَرَضْتُ عَلَيْهِ الْكِتَابَ فَقَالَ هُوَ صَحِيحٌ\nوَ قَالَ ابْنُ فَضَّالٍ قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا أُصِيبَ الرَّجُلُ فِي إِحْدَى عَيْنَيْهِ فَإِنَّهَا تُقَاسُ بِبَيْضَةٍ تُرْبَطُ عَلَى عَيْنِهِ الْمُصَابَةِ وَ يُنْظَرُ مَا يَنْتَهِي بَصَرُ عَيْنِهِ الصَّحِيحَةِ ثُمَّ تُغَطَّى عَيْنُهُ الصَّحِيحَةُ وَ يُنْظَرُ مَا تَنْتَهِي عَيْنُهُ الْمُصَابَةُ فَيُعْطَى دِيَتَهُ مِنْ حِسَابِ ذَلِكَ وَ الْقَسَامَةُ مَعَ ذَلِكَ مِنَ السِّتَّةِ الْأَجْزَاءِ عَلَى قَدْرِ مَا أُصِيبَتْ مِنْ عَيْنِهِ\nفَإِنْ كَانَ سُدُسَ بَصَرِهِ فَقَدْ حَلَفَ هُوَ وَحْدَهُ وَ أُعْطِيَ وَ إِنْ كَانَ ثُلُثَ بَصَرِهِ حَلَفَ هُوَ وَ حَلَفَ مَعَهُ رَجُلٌ آخَرُ وَ إِنْ كَانَ نِصْفَ بَصَرِهِ حَلَفَ هُوَ وَ حَلَفَ مَعَهُ رَجُلَانِ وَ إِنْ كَانَ ثُلُثَيْ بَصَرِهِ حَلَفَ هُوَ وَ حَلَفَ مَعَهُ ثَلَاثَةُ نَفَرٍ وَ إِنْ كَانَ أَرْبَعَةَ أَخْمَاسِ بَصَرِهِ حَلَفَ هُوَ وَ حَلَفَ مَعَهُ أَرْبَعَةُ نَفَرٍ وَ إِنْ كَانَ بَصَرَهُ كُلَّهُ حَلَفَ هُوَ وَ حَلَفَ مَعَهُ خَمْسَةُ نَفَرٍ وَ كَذَلِكَ الْقَسَامَةُ كُلُّهَا فِي الْجُرُوحِ\nوَ إِنْ لَمْ يَكُنْ لِلْمُصَابِ بَصَرُهُ مَنْ يَحْلِفُ مَعَهُ ضُوعِفَتْ عَلَيْهِ الْأَيْمَانُ إِنْ كَانَ سُدُسَ بَصَرِهِ حَلَفَ مَرَّةً وَاحِدَةً وَ إِنْ كَانَ ثُلُثَ بَصَرِهِ حَلَفَ مَرَّتَيْنِ وَ إِنْ كَانَ أَكْثَرَ عَلَى هَذَا الْحِسَابِ وَ إِنَّمَا الْقَسَامَةُ عَلَى مَبْلَغِ مُنْتَهَى بَصَرِهِ\nوَ إِنْ كَانَ السَّمْعَ فَعَلَى نَحْوٍ مِنْ ذَلِكَ غَيْرَ أَنَّهُ يُضْرَبُ لَهُ بِشَيْ‏ءٍ حَتَّى يُعْلَمَ مُنْتَهَى سَمْعِهِ ثُمَّ يُقَاسُ ذَلِكَ وَ الْقَسَامَةُ عَلَى نَحْوِ مَا يَنْقُصُ مِنْ سَمْعِهِ فَإِنْ كَانَ سَمْعَهُ كُلَّهُ فَخِيفَ مِنْهُ فُجُورٌ فَإِنَّهُ يُتْرَكُ حَتَّى إِذَا اسْتَقَلَّ نَوْماً صِيحَ بِهِ فَإِنْ سَمِعَ قَاسَ بَيْنَهُمُ الْحَاكِمُ بِرَأْيِهِ \nوَ إِنْ كَانَ النَّقْصُ فِي الْعَضُدِ وَ الْفَخِذِ فَإِنَّهُ يُعَلَّمُ قَدْرُ ذَلِكَ يُقَاسُ رِجْلُهُ الصَّحِيحَةُ بِخَيْطٍ ثُمَّ يُقَاسُ رِجْلُهُ الْمُصَابَةُ فَيُعَلَّمُ قَدْرُ مَا نَقَصَتْ رِجْلُهُ أَوْ يَدُهُ فَإِنْ أُصِيبَ السَّاقُ أَوِ السَّاعِدُ فَمِنَ الْفَخِذِ وَ الْعَضُدِ يُقَاسُ وَ يَنْظُرُ الْحَاكِمُ قَدْرَ فَخِذِهِ .\nعِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ ظَرِيفٍ عَنْ أَبِيهِ ظَرِيفِ بْنِ نَاصِحٍ عَنْ رَجُلٍ يُقَالُ لَهُ عَبْدُ اللَّهِ بْنُ أَيُّوبَ قَالَ حَدَّثَنِي أَبُو عَمْرٍو الْمُتَطَبِّبُ قَالَ عَرَضْتُ هَذَا الْكِتَابَ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ).\nو عَلِيُّ بْنُ فَضَّالٍ عَنِ الْحَسَنِ بْنِ الْجَهْمِ قَالَ عَرَضْتُهُ عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فَقَالَ لِي ارْوُوهُ فَإِنَّهُ صَحِيحٌ ثُمَّ ذَكَرَ مِثْلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, and from his father, from Ibn Fazzal both together, \n(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>. Yunus said, ‘I presented the book to him<sup>asws</sup>, so he<sup>asws</sup> said: ‘It is correct’. \nAnd Ibn Fazal said, ‘Amir Al-Momineen<sup>asws</sup> judged: ‘When the man is hit in one of his eyes, so it would be measured by an egg. The hit eye would be covered, and he would look what his correct eye can end up visualising. Then his correct eye would be covered, and he would look at what his hit eye can end up (visualising). So he would be given a wergild based upon that accounting. And the sworn endorsement along with that are from six parts, upon a measurement of what he has been hit from his eye. \nSo if it was such that a sixth of his vision had gone so he alone would have to swear an oath and he would be given; and if it was that a third of his vision had gone, he and another man along with him would have to swear an oath; and if it was that half of his vision had gone, he and two men along with him would swear an oath; and if it was that two-thirds of his vision had gone, he and three persons would swear an oath; and if it was that four-fifths of his vision had gone, he and four persons would have to swear an oath along with him; and if it was that all of it is gone, he and five persons along with him would have to swear an oath. And similar to that are the sworn endorsements, all of these regarding the injuries. \nAnd if there does not happen to be for the one whose eyesight was hit, anyone who would swear an oath along with him, the swearing would be additional upon him. If it was such that a sixth of his vision had gone, he would swear once; and if it was such that a third of his vision had gone, he would have to swear twice; and if it was more, it would be upon this counting. But rather, the sworn endorsements (compurgation) are upon to what extent his vision reaches.\nAnd if it was the hearing, so it would be approximate from that, apart from that something would be struck (to make a sound) to him, until the extent of his hearing is known. Then that would be compared, and the sworn endorsement would be approximated based upon what his hearing had been measured. So if it was such that all of his hearing (was lost), and mischief was feared from him, so he would be left to sleep until when he had slept a little, he would be shrieked at. So if he were to hear, the judge would compare between them by his opinion. \nAnd if it was such that the deficiency was regarding the upper arms and the thighs, so that would be known by comparing the healthy leg by a cord. Then his hit leg would be compared. Thus it would be known, the measurement of the deficiency of his leg, or his hand. So if the injury was to the leg or the arm, so it is from (the measuring device) for the thigh and the upper arm that he would be compared, and the judge would look at the measurement of his thigh’.\nA number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Zareyf, from his father Zareyf Bin Nasih, from a man caled Abdullah Bin Ayoub, \n(It has been narrated) from Abu Amro Al Mutatabbab who said, ‘I presented the book to Abu Abdullah<sup>asws</sup>’. \nAnd Ali Bin Fazzal, from Al Hassan Bin Al Jahm who said, \n‘I presented it to Abu Al-Hassan Al-Reza<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘Report it, for it is correct’. Then he mentioned similar to it’."}]}, {"index": 14162, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:7:4:31:10", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ رِفَاعَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَقُولُ فِي رَجُلٍ ضَرَبَ رَجُلًا فَنَقَصَ بَعْضُ نَفَسِهِ بِأَيِّ شَيْ‏ءٍ يُعْرَفُ ذَلِكَ قَالَ ذَلِكَ بِالسَّاعَاتِ قُلْتُ وَ كَيْفَ بِالسَّاعَاتِ قَالَ فَإِنَّ النَّفَسَ يَطْلُعُ الْفَجْرُ وَ هُوَ فِي الشِّقِّ الْأَيْمَنِ مِنَ الْأَنْفِ فَإِذَا مَضَتِ السَّاعَةُ صَارَ إِلَى الشِّقِّ الْأَيْسَرِ فَتَنْظُرُ مَا بَيْنَ نَفَسِكَ وَ نَفَسِهِ ثُمَّ يُحْتَسَبُ فَيُؤْخَذُ بِحِسَابِ ذَلِكَ مِنْهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Salih Bin Uqba, from Rafa’at who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding a man who struck a man, so some of his breathing was deficient. With what thing would that be known?’ He<sup>asws</sup> said: ‘By the timing’. I said, ‘And how by the timing?’ He<sup>asws</sup> said: ‘At the emergence of dawn, he is breathing, and it is from the right nostril. So when an hour goes by, he (comes to be) breathing by the left nostril. So you would look at what (difference) there is between your breathing, and his breathing. Then it would be reckoned, so he would be taking by that counting from it’."}]}]}, "index": "al-kafi:7:4:31", "kind": "verse_list"}