{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:7:4", "titles": {"ar": "كِتَابُ الدِّيَاتِ", "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"}}, {"indexed_titles": {"en": "Chapter 32"}, "path": "/books/al-kafi:7:4:32", "titles": {"ar": "باب الرَّجُلِ يَضْرِبُ الرَّجُلَ فَيَذْهَبُ سَمْعُهُ وَ بَصَرُهُ وَ عَقْلُهُ", "en": "Chapter 32 – The man strikes the man, so his hearing, and his vision, and his intellect goes"}}], "index": 2178, "local_index": 32, "part_type": "Chapter", "path": "/books/al-kafi:7:4:32", "titles": {"ar": "باب الرَّجُلِ يَضْرِبُ الرَّجُلَ فَيَذْهَبُ سَمْعُهُ وَ بَصَرُهُ وَ عَقْلُهُ", "en": "Chapter 32 – The man strikes the man, so his hearing, and his vision, and his intellect goes"}, "verse_count": 2, "verse_start_index": 14162, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14163, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:4:32:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ ضَرَبَ رَجُلًا بِعَمُودِ فُسْطَاطٍ عَلَى رَأْسِهِ ضَرْبَةً وَاحِدَةً فَأَجَافَهُ حَتَّى وَصَلَتِ الضَّرْبَةُ إِلَى الدِّمَاغِ فَذَهَبَ عَقْلُهُ فَقَالَ إِنْ كَانَ الْمَضْرُوبُ لَا يَعْقِلُ مِنْهَا الصَّلَاةَ وَ لَا يَعْقِلُ مَا قَالَ وَ لَا مَا قِيلَ لَهُ فَإِنَّهُ يُنْتَظَرُ بِهِ سَنَةً فَإِنْ مَاتَ فِيمَا بَيْنَهُ وَ بَيْنَ السَّنَةِ أُقِيدَ بِهِ ضَارِبُهُ وَ إِنْ لَمْ يَمُتْ فِيمَا بَيْنَهُ وَ بَيْنَ السَّنَةِ وَ لَمْ يَرْجِعْ إِلَيْهِ عَقْلُهُ أُغْرِمَ ضَارِبُهُ الدِّيَةَ فِي مَالِهِ لِذَهَابِ عَقْلِهِ ", "قُلْتُ لَهُ فَمَا تَرَى عَلَيْهِ فِي الشَّجَّةِ شَيْئاً قَالَ لَا لِأَنَّهُ إِنَّمَا ضَرَبَهُ ضَرْبَةً وَاحِدَةً فَجَنَتِ الضَّرْبَةُ جِنَايَتَيْنِ فَأُلْزِمُهُ أَغْلَظَ الْجِنَايَتَيْنِ وَ هِيَ الدِّيَةُ وَ لَوْ كَانَ ضَرَبَهُ ضَرْبَتَيْنِ فَجَنَتِ الضَّرْبَتَانِ جِنَايَتَيْنِ لَأَلْزَمْتُهُ جِنَايَةَ مَا جَنَتَا كَانَتَا مَا كَانَتَا إِلَّا أَنْ يَكُونَ فِيهِمَا الْمَوْتُ فَيُقَادَ بِهِ ضَارِبُهُ [بِوَاحِدَةٍ وَ تُطْرَحَ الْأُخْرَى قَالَ وَ قَالَ] فَإِنْ ضَرَبَهُ ثَلَاثَ ضَرَبَاتٍ وَاحِدَةً بَعْدَ وَاحِدَةٍ فَجَنَيْنَ ثَلَاثَ جِنَايَاتٍ أَلْزَمْتُهُ جِنَايَةَ مَا جَنَتِ الثَّلَاثُ ضَرَبَاتٍ كَائِنَةً مَا كَانَتْ مَا لَمْ يَكُنْ فِيهَا الْمَوْتُ فَيُقَادَ بِهِ ضَارِبُهُ قَالَ وَ قَالَ فَإِنْ ضَرَبَهُ عَشْرَ ضَرَبَاتٍ فَجَنَيْنَ جِنَايَةً وَاحِدَةً أَلْزَمْتُهُ تِلْكَ الْجِنَايَةَ الَّتِي جَنَيْنَهَا الْعَشْرُ ضَرَبَاتٍ [كَائِنَةً مَا كَانَتْ] ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, both together, from Ibn Mahboub, from Jameel Bin Salih, from Abu Ubeyda Al Haza’a who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about a man who struck a man with a pole of a tent, upon his head, with one strike. So it pierced him to the extent that it arrived to the brain. So his intellect went’. So he<sup>asws</sup> said: ‘If it was that the struck one did not have the intellect for the Prayer, nor any intellect of what he says, nor what is said to him, so he would be awaited with for a year. So if he were to dies in what is between it and the year, his striker would be retaliated with; and if he does not die in what is between it and the year, and his intellect does not return to him, his striker would be fined the (complete) wergild in his wealth, due to the going away of his (victim’s) intellect. ", "I said to him<sup>asws</sup>, ‘So what do you<sup>asws</sup> view to be upon him for fracturing something?’ He<sup>asws</sup> said: ‘No, because, rather he struck him with one strike. So the one strike committed two crimes. Therefore, it necessitates him the harshest of the two crimes, and it is the (complete) wergild. And had he struck him with two strikes, so the two strikes would have committed two crimes, it would necessitate him one crime, so whatever was it was, except if there happens to be the death in it, so his striker would be retaliated (due to one strike and the other would be dropped). So if he had struck him with three stroked, one after the other, so he would have committed three crimes, it would necessitate him with one crime what the three strikes had committed, as it if was such, for as long as there does not happen to be the death in it, so his striker would be retaliated with. So if he had struck him with ten strike, so it would be the one crime, even it ten strikes had committed, so he will be held for one crime – whatever it may be’."]}}, {"index": 14164, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:4:32:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ خَالِدٍ الْبَرْقِيِّ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ ضَرَبَ رَجُلًا بِعَصاً فَذَهَبَ سَمْعُهُ وَ بَصَرُهُ وَ لِسَانُهُ وَ عَقْلُهُ وَ فَرْجُهُ وَ انْقَطَعَ جِمَاعُهُ وَ هُوَ حَيٌّ بِسِتِّ دِيَاتٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Muhammad Bin Khalid Al Barqy, from Hammad Bin Isa, from Ibrahim Bin Umar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a man who struck a man with a stick, so his hearing, and his vision, and his tongue, and his intellect, and his private parts ceased to function and his (ability) to copulate went, but he was alive - (a judgement of) six wergilds’."]}}]}, "index": "al-kafi:7:4:32", "kind": "verse_list"}