{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:7:4:36",
        "titles": {
          "ar": "باب الْخِلْقَةِ الَّتِي تُقْسَمُ عَلَيْهِ الدِّيَةُ فِي الْأَسْنَانِ وَ الْأَصَابِعِ",
          "en": "Chapter 36 – The creation upon which the wergild is distributed, regarding the teeth and the fingers"
        }
      }
    ],
    "index": 2192,
    "local_index": 36,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 37"
        },
        "path": "/books/al-kafi:7:4:37",
        "titles": {
          "ar": "باب آخَرُ",
          "en": "Chapter 37 – Another chapter"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:7:4:35",
        "titles": {
          "ar": "باب تَفْسِيرِ الْجِرَاحَاتِ وَ الشِّجَاجِ",
          "en": "Chapter 35 – Classification of the injuries and the fractures"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:4:36",
    "titles": {
      "ar": "باب الْخِلْقَةِ الَّتِي تُقْسَمُ عَلَيْهِ الدِّيَةُ فِي الْأَسْنَانِ وَ الْأَصَابِعِ",
      "en": "Chapter 36 – The creation upon which the wergild is distributed, regarding the teeth and the fingers"
    },
    "verse_count": 2,
    "verse_start_index": 14189,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 14190,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/849",
              "text": "زِيَادِ بْنِ سُوقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/850",
              "text": "الْحَكَمِ بْنِ عُتَيْبَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ زِيَادِ بْنِ سُوقَةَ عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:36:1",
        "text": [
          " قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَصْلَحَكَ اللَّهُ إِنَّ بَعْضَ النَّاسِ فِي فِيهِ اثْنَانِ وَ ثَلَاثُونَ سِنّاً وَ بَعْضُهُمْ لَهُمْ ثَمَانِيَةٌ وَ عِشْرُونَ سِنّاً فَعَلَى كَمْ تُقْسَمُ دِيَةُ الْأَسْنَانِ فَقَالَ الْخِلْقَةُ إِنَّمَا هِيَ ثَمَانِيَةٌ وَ عِشْرُونَ سِنّاً اثْنَتَا عَشَرَ فِي مَقَادِيمِ الْفَمِ وَ سِتَّةَ عَشَرَ سِنّاً فِي مَوَاخِيرِهِ فَعَلَى هَذَا قُسِمَتْ دِيَةُ الْأَسْنَانِ",
          "فَدِيَةُ كُلِّ سِنٍّ مِنَ الْمَقَادِيمِ إِذَا كُسِرَتْ حَتَّى يَذْهَبَ خَمْسُمِائَةِ دِرْهَمٍ فَدِيَتُهَا كُلُّهَا سِتَّةُ آلَافِ دِرْهَمٍ وَ فِي كُلِّ سِنٍّ مِنَ الْمَوَاخِيرِ إِذَا كُسِرَتْ حَتَّى يَذْهَبَ فَإِنَّ دِيَتَهَا مِائَتَانِ وَ خَمْسُونَ دِرْهَماً وَ هِيَ سِتَّةَ عَشَرَ سِنّاً فَدِيَتُهَا كُلُّهَا أَرْبَعَةُ آلَافِ دِرْهَمٍ فَجَمِيعُ دِيَةِ الْمَقَادِيمِ وَ الْمَوَاخِيرِ مِنَ الْأَسْنَانِ عَشَرَةُ آلَافِ دِرْهَمٍ وَ إِنَّمَا وُضِعَتِ الدِّيَةُ عَلَى هَذَا فَمَا زَادَ عَلَى ثَمَانِيَةٍ وَ عِشْرِينَ سِنّاً فَلَا دِيَةَ لَهُ وَ مَا نَقَصَ فَلَا دِيَةَ لَهُ هَكَذَا وَجَدْنَاهُ فِي كِتَابِ عَلِيٍّ ( عليه السلام ) ",
          "قَالَ فَقَالَ الْحَكَمُ فَقُلْتُ إِنَّ الدِّيَاتِ إِنَّمَا كَانَتْ تُؤْخَذُ قَبْلَ الْيَوْمِ مِنَ الْإِبِلِ وَ الْبَقَرِ وَ الْغَنَمِ قَالَ فَقَالَ إِنَّمَا كَانَ ذَلِكَ فِي الْبَوَادِي قَبْلَ الْإِسْلَامِ فَلَمَّا ظَهَرَ الْإِسْلَامُ وَ كَثُرَتِ الْوَرِقُ فِي النَّاسِ قَسَمَهَا أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَلَى الْوَرِقِ ",
          "قَالَ الْحَكَمُ فَقُلْتُ لَهُ أَ رَأَيْتَ مَنْ كَانَ الْيَوْمَ مِنْ أَهْلِ الْبَوَادِي مَا الَّذِي يُؤْخَذُ مِنْهُمْ فِي الدِّيَةِ الْيَوْمَ إِبِلٌ أَوْ وَرِقٌ قَالَ فَقَالَ الْإِبِلُ الْيَوْمَ مِثْلُ الْوَرِقِ بَلْ هِيَ أَفْضَلُ مِنَ الْوَرِقِ فِي الدِّيَةِ إِنَّهُمْ كَانُوا يَأْخُذُونَ مِنْهُمْ فِي الدِّيَةِ الْخَطَإِ مِائَةً مِنَ الْإِبِلِ يُحْسَبُ بِكُلِّ بَعِيرٍ مِائَةُ دِرْهَمٍ فَذَلِكَ عَشَرَةُ آلَافِ دِرْهَمٍ قُلْتُ لَهُ فَمَا أَسْنَانُ الْمِائَةِ بَعِيرٍ قَالَ فَقَالَ مَا حَالَ عَلَيْهِ الْحَوْلُ ذُكْرَانٌ كُلُّهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad and Ali Bin Ibrahim, from his father, both together from Ibn Mahboub, from Hishan Bin Salim, from Ziyad Bin Sowqat, from Al Hakam Bin Uteyba who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! Some of the people have thirty two teeth in their mouths, and for some of them are twenty eight teeth. So upon how much would be the distribution of wergild of the teeth?’ So he<sup>asws</sup> said: ‘The creation, rather, it is of twenty eight teeth – twelve in the front of the mouth, and sixteen at the end of it. So it is upon this that the wergild of the teeth would be distributed.",
            "Ransom of every tooth from the front, when it breaks until it is gone, is of five hundred Dirhams, the ransom of all of these being six thousand Dirhams. And regarding every tooth from the back when it breaks until it is gone, so its wergild is two hundred and fifty Dirhams, and these are sixteen teeth, all of it being four thousand Dirhams. So the entire wergild of the front and the back from the teeth is of ten thousand Dirhams. But rather, the wergild would be placed upon this, so whatever increased upon twenty eight teeth, so there is no wergild for it, and whatever is deficient, so there is no wergild for it. This is how we<sup>asws</sup> found it to be in the Book of Ali<sup>asws</sup> ",
            "He (the narrator) said, ‘So Al-Hakam said, ‘So I said, ‘But rather, the wergilds used to be taken before today, from the camels, and the cows, and the sheep’. So he<sup>asws</sup> said: ‘But rather that used to be in the villages, before Al-Islam. So when Al-Islam appeared, and the currency became abundant among the people, so Amir Al-Momineen<sup>asws</sup> named it upon the currency’. ",
            "Al-Hakam said, ‘So I said to him<sup>asws</sup>, ‘What is your<sup>asws</sup> view of the one who was from the people of the villages today. What is that which would be taken from him regarding the wergild today, camels or currency?’ So he<sup>asws</sup> said: ‘The camels, today are like the currency. But it is preferable than the currency regarding the wergild. It used to be taken from them, regarding the wergild of the erroneous (killing), one hundred from the camels by the reckoning of every camel being one hundred Dirhams. So that is ten thousand Dirhams’. I said to him<sup>asws</sup>, ‘So what are the ages of the one hundred camels?’ So he<sup>asws</sup> said: ‘Whatever a year has passed upon, males, all of them’."
          ]
        }
      },
      {
        "index": 14191,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1349",
              "text": "ابْنُ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/849",
              "text": "زِيَادِ بْنِ سُوقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/850",
              "text": "الْحَكَمِ بْنِ عُتَيْبَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "ابْنُ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ زِيَادِ بْنِ سُوقَةَ عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:36:2",
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ أَصَابِعِ الْيَدَيْنِ وَ أَصَابِعِ الرِّجْلَيْنِ أَ رَأَيْتَ مَا زَادَ فِيهَا عَلَى عَشْرِ أَصَابِعَ أَوْ نَقَصَ مِنْ عَشَرَةٍ فِيهَا دِيَةٌ قَالَ فَقَالَ لِي يَا حَكَمُ الْخِلْقَةُ الَّتِي قُسِمَتْ عَلَيْهَا الدِّيَةُ عَشَرَةُ أَصَابِعَ فِي الْيَدَيْنِ فَمَا زَادَ أَوْ نَقَصَ فَلَا دِيَةَ لَهُ وَ عَشَرَةُ أَصَابِعَ فِي الرِّجْلَيْنِ فَمَا زَادَ أَوْ نَقَصَ فَلَا دِيَةَ لَهُ وَ فِي كُلِّ إِصْبَعٍ مِنْ أَصَابِعِ الْيَدَيْنِ أَلْفُ دِرْهَمٍ وَ فِي كُلِّ إِصْبَعٍ مِنْ أَصَابِعِ الرِّجْلَيْنِ أَلْفُ دِرْهَمٍ وَ كُلُّ مَا كَانَ مِنْ شَلَلٍ فَهُوَ عَلَى الثُّلُثِ مِنْ دِيَةِ الصِّحَاحِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Hisham Bin Salim, from Ziyad Bin Sowqat, from Al Hakam Bin Uteyba who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about fingers of the two hands, and toes of the two feet, ‘What is your<sup>asws</sup> view with regards to these, upon ten fingers, or deficient from ten, regarding wergild?’ So he<sup>asws</sup> said to me: ‘O Hakam! The creation upon which the wergild is to be distributed is ten fingers in the two hands. So whatever is additional or deficient, so there is no wergild for it; and ten toes in the two feet, so whatever was additional or deficient, so there is no wergild for it; and regarding every finger from the fingers of the two hands, is a thousand Dirhams; and regarding every toe from the toes of the two feet, is a thousand Dirhams; and regarding everything what was from the paralysed, so it is upon the third from the wergild of the healthy’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:4:36",
  "kind": "verse_list"
}