{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:7:4", "titles": {"ar": "كِتَابُ الدِّيَاتِ", "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"}}, {"indexed_titles": {"en": "Chapter 37"}, "path": "/books/al-kafi:7:4:37", "titles": {"ar": "باب آخَرُ", "en": "Chapter 37 – Another chapter"}}], "index": 2183, "local_index": 37, "part_type": "Chapter", "path": "/books/al-kafi:7:4:37", "titles": {"ar": "باب آخَرُ", "en": "Chapter 37 – Another chapter"}, "verse_count": 3, "verse_start_index": 14180, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14181, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:4:37:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ وَ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ جَمِيعاً قَالَا عَرَضْنَا كِتَابَ الْفَرَائِضِ عَنْ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فَقَالَ هُوَ صَحِيحٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Fazal and Muhammad Bin Isa, from Yunus, both together said, ", "‘We presented a book of the Obligations, from Amir Al-Momineen<sup>asws</sup> to Abu Al-Hassan Al-Reza<sup>asws</sup>, so he<sup>asws</sup> said: ‘It is correct’."]}}, {"index": 14182, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:4:37:2", "text": ["وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ ظَرِيفٍ عَنْ أَبِيهِ ظَرِيفِ بْنِ نَاصِحٍ قَالَ حَدَّثَنِي رَجُلٌ يُقَالُ لَهُ عَبْدُ اللَّهِ بْنُ أَيُّوبَ قَالَ حَدَّثَنِي أَبُو عَمْرٍو الْمُتَطَبِّبُ قَالَ عَرَضْتُهُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَفْتَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَكَتَبَ النَّاسُ فُتْيَاهُ وَ كَتَبَ بِهِ أَمِيرُ الْمُؤْمِنِينَ إِلَى أُمَرَائِهِ وَ رُءُوسِ أَجْنَادِهِ", "فَمِمَّا كَانَ فِيهِ إِنْ أُصِيبَ شَفْرُ الْعَيْنِ الْأَعْلَى فَشُتِرَفَدِيَتُهُ ثُلُثُ دِيَةِ الْعَيْنِ مِائَةُ دِينَارٍ وَ سِتَّةٌ وَ سِتُّونَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ إِنْ أُصِيبَ شَفْرُ الْعَيْنِ الْأَسْفَلُ فَشُتِرَ فَدِيَتُهُ نِصْفُ دِيَةِ الْعَيْنِ مِائَةُ دِينَارٍ وَ خَمْسُونَ دِينَاراً وَ إِنْ أُصِيبَ الْحَاجِبُ فَذَهَبَ شَعْرُهُ كُلُّهُ فَدِيَتُهُ نِصْفُ دِيَةِ الْعَيْنِ مِائَتَا دِينَارٍ وَ خَمْسُونَ دِينَاراً فَمَا أُصِيبَ مِنْهُ فَعَلَى حِسَابِ ذَلِكَ ", "الْأَنْفُ فَإِنْ قُطِعَ رَوْثَةُ الْأَنْفِ وَ هِيَ طَرَفُهُ فَدِيَتُهُ خَمْسُمِائَةِ دِينَارٍ إِنْ أُنْفِذَتْ فِيهِ نَافِذَةٌ لَا تَنْسَدُّ بِسَهْمٍ أَوْ رُمْحٍ فَدِيَتُهُ ثَلَاثُمِائَةِ دِينَارٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ إِنْ كَانَتْ نَافِذَةٌ فَبَرَأَتْ وَ الْتَأَمَتْ فَدِيَتُهَا خُمُسُ دِيَةِ رَوْثَةِ الْأَنْفِ مِائَةُ دِينَارٍ فَمَا أُصِيبَ مِنْهُ فَعَلَى حِسَابِ ذَلِكَ ", "وَ إِنْ كَانَتْ نَافِذَةٌ فِي إِحْدَى الْمَنْخِرَيْنِ إِلَى الْخَيْشُومِ وَ هُوَ الْحَاجِزُ بَيْنَ الْمَنْخِرَيْنِ فَدِيَتُهَا عُشْرُ دِيَةِ رَوْثَةِ الْأَنْفِ خَمْسُونَ دِينَاراً لِأَنَّهُ النِّصْفُ وَ إِنْ كَانَتْ نَافِذَةٌ فِي إِحْدَى الْمَنْخِرَيْنِ أَوِ الْخَيْشُومِ إِلَى الْمَنْخِرِ الْآخَرِ فَدِيَتُهَا سِتَّةٌ وَ سِتُّونَ دِينَاراً وَ ثُلُثَا دِينَارٍ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin zareyf, from his father Zareyf Bin Nasih, from a man called Abdullah Bin Ayoubm from Abu Amro Al Mutatabbab who said, ", "‘I presented it (book of Obligations from Amir Al-Momineen<sup>asws</sup>) to Abu Abdullah<sup>asws</sup>. He<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> issued Verdicts, so the people wrote down his<sup>asws</sup> Verdicts, and (what) Amir Al-Momineen<sup>asws</sup> wrote to his governors, and the heads of his<sup>asws</sup> battalions. ", "So from what was in it – If an upper eyelid is hit, so it tears, its wergild is a third of the wergild of the eye, being one hundred and sixty-six and two-third Dinars. And if the lower eyelid is hit, so it tears, its wergild is half the wergild of the eye, being one hundred and fifty Dinars. And if the eyebrow is hit and all of its hair is gone, so its wergild is half the wergild of the eye, being two hundred and fifty Dinars. So whatever is hit from it, so it is based upon the accounting of that. ", "The nose – So if the side of the nose is cut, and it is its edge, so its wergild is five hundred Dinars. If it has been pierced by a piercing by an arrow or a spear, and does not close, so its wergild is of three hundred and thirty three and a third Dinar; and it was pierced, so it was cured and was complete, so its wergild is a fifth of the wergild of the side of the nose, being one hundred Dinars. So whatever was hit from it, so it would be based upon the accounting of that.", "And if it was pierced in one of the two nostrils to the nasopharynx, and it is the barrier between the two nostrils, so its wergild is a tenth of the wergild of the nose, being fifty Dinars, because it is the half. And if it was pierced in one of the nostrils, or the nasopharynx to the other nostril, so its wergild is sixty-six Dinars and two-thirds of a Dinar’."]}}, {"index": 14183, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:4:37:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مِسْمَعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَضَى فِي خَرْمِ الْأَنْفِ ثُلُثَ دِيَةِ الْأَنْفِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Misma’a, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> judged regarding (piercing of a) hole in the nose, being a third of the wergild of the nose’."]}}]}, "index": "al-kafi:7:4:37", "kind": "verse_list"}