{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 38"
        },
        "path": "/books/al-kafi:7:4:38",
        "titles": {
          "ar": "باب الشَّفَتَيْنِ",
          "en": "Chapter 38 – The two lips"
        }
      }
    ],
    "index": 2194,
    "local_index": 38,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 39"
        },
        "path": "/books/al-kafi:7:4:39",
        "titles": {
          "ar": "باب دِيَةِ الْجَنِينِ",
          "en": "Chapter 39 – Wergild of the foetus"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 37"
        },
        "path": "/books/al-kafi:7:4:37",
        "titles": {
          "ar": "باب آخَرُ",
          "en": "Chapter 37 – Another chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:4:38",
    "titles": {
      "ar": "باب الشَّفَتَيْنِ",
      "en": "Chapter 38 – The two lips"
    },
    "verse_count": 29,
    "verse_start_index": 14194,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 14195,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/5785",
              "text": "وَ بِالْإِسْنَادِ الْأَوَّلِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِالْإِسْنَادِ الْأَوَّلِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:1",
        "text": [
          " وَ إِذَا قُطِعَتِ الشَّفَةُ الْعُلْيَا وَ اسْتُؤصِلَتْ فَدِيَتُهَا خَمْسُمِائَةِ دِينَارٍ فَمَا قُطِعَ مِنْهَا فَبِحِسَابِ ذَلِكَ فَإِذَا انْشَقَّتْ حَتَّى تَبْدُوَ مِنْهَا الْأَسْنَانُ ثُمَّ دُووِيَتْ وَ بَرَأَتْ وَ الْتَأَمَتْ فَدِيَتُهَا مِائَةُ دِينَارٍ فَذَلِكَ خُمُسُ دِيَةِ الشَّفَةِ إِذَا قُطِعَتْ فَاسْتُؤْصِلَتْ وَ مَا قُطِعَ مِنْهَا فَبِحِسَابِ ذَلِكَ فَإِنْ شُتِرَتْ فَشِينَتْ شَيْناً قَبِيحاً فَدِيَتُهَا مِائَةُ دِينَارٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ",
          "وَ دِيَةُ الشَّفَةِ السُّفْلَى إِذَا اسْتُؤْصِلَتْ ثُلُثَا الدِّيَةِ سِتُّمِائَةٍ وَ سِتَّةٌ وَ سِتُّونَ دِينَاراً وَ ثُلُثَا دِينَارٍ فَمَا قُطِعَ مِنْهَا فَبِحِسَابِ ذَلِكَ فَإِنِ انْشَقَّتْ حَتَّى تَبْدُوَ الْأَسْنَانُ مِنْهَا ثُمَّ بَرَأَتْ وَ الْتَأَمَتْ فَدِيَتُهَا مِائَةٌ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ إِنْ أُصِيبَتْ فَشِينَتْ شَيْناً قَبِيحاً فَدِيَتُهَا ثَلَاثُمِائَةٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ ذَلِكَ نِصْفُ دِيَتِهَا ",
          "وَ فِي رِوَايَةِ ظَرِيفِ بْنِ نَاصِحٍ قَالَ فَسَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَلِكَ فَقَالَ بَلَغَنَا أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَضَّلَهَا لِأَنَّهَا تُمْسِكُ الطَّعَامَ مَعَ الْأَسْنَانِ فَلِذَلِكَ فَضَّلَهَا فِي حُكُومَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by the first chain, ",
            "He<sup>asws</sup> said: ‘And when the upper lip is cut and is eradicated, so its wergild is five hundred Dinars. So whatever was cut from it, so its accounting would be based upon that. So, when it is cut to the extent that the teeth emerge from it, then medication is applied and it is cured and complete, so its wergild is one hundred Dinars. So that is a fifth of the wergild of the lip when it is cut and is eradicated, and whatever was cut from it, so its accounting would be by that. So if it is torn, so it manifests an ugliness, so its wergild is one hundred and thirty three Dinars and one-third of a Dinar. ",
            "And wergild of the lower lip when it is eradicated, is one-third of the wergild, being six hundred and sixty six Dinars and two-thirds of a Dinar. So whatever is cut from it, so it would be based upon that accounting. So if it is torn to the extent that the teeth emerge from it, then it is cured and complete, so its wergild is one hundred and thirty three Dinars and one-third of a Dinar. And if it is hit, so it manifests an ugliness, so its wergild is three hundred and thirty three Dinars and one-third of a Dinar, and that is half its wergild’. ",
            "And in a report of Zareyf Bin Nasih who said, ‘So I asked Abu Abdullah<sup>asws</sup> about that, so he<sup>asws</sup> said: ‘It has reached us<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> preferred it (the lower lip) because it withholds the food along with the teeth, therefore it was due to that, that he<sup>asws</sup> preferred it in his<sup>asws</sup> judgements’."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْخَدُّ "
        ],
        "translations": {
          "en.hubeali": [
            "The Cheek"
          ]
        }
      },
      {
        "index": 14196,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:2",
        "text": [
          "وَ فِي الْخَدِّ إِذَا كَانَ فِيهِ نَافِذَةٌ يُرَى مِنْهَا جَوْفُ الْفَمِ فَدِيَتُهَا مِائَتَا دِينَارٍ وَ إِنْ دُووِيَ فَبَرَأَ وَ الْتَأَمَ وَ بِهِ أَثَرٌ بَيِّنٌ وَ شَتَرٌ فَاحِشٌ فَدِيَتُهُ خَمْسُونَ دِينَاراً فَإِنْ كَانَتْ نَافِذَةٌ فِي الْخَدَّيْنِ كِلَيْهِمَا فَدِيَتُهَا مِائَةُ دِينَارٍ وَ ذَلِكَ نِصْفُ دِيَةِ الَّتِي يُرَى مِنْهَا الْفَمُ ",
          "فَإِنْ كَانَتْ رَمْيَةٌ بِنَصْلٍ يَثْبُتُ فِي الْعَظْمِ حَتَّى يَنْفُذَ إِلَى الْحَنَكِ فَدِيَتُهَا مِائَةٌ وَ خَمْسُونَ دِينَاراً جُعِلَ مِنْهَا خَمْسُونَ دِينَاراً لِمُوضِحَتِهَا وَ إِنْ كَانَتْ نَاقِبَةٌ وَ لَمْ يَنْفُذْ فِيهَا فَدِيَتُهَا مِائَةُ دِينَارٍ فَإِنْ كَانَتْ مُوضِحَةٌ فِي شَيْ‏ءٍ مِنَ الْوَجْهِ فَدِيَتُهَا خَمْسُونَ دِينَاراً فَإِنْ كَانَ لَهَا شَيْنٌ فَدِيَةُ شَيْنِهِ مَعَ دِيَةِ مُوضِحَتِهِ ",
          "فَإِنْ كَانَ جُرْحاً وَ لَمْ يُوضِحْ ثُمَّ بَرَأَ وَ كَانَ فِي الْخَدَّيْنِ فَدِيَتُهُ عَشَرَةُ دَنَانِيرَ فَإِنْ كَانَ فِي الْوَجْهِ صَدْعٌ فَدِيَتُهُ ثَمَانُونَ دِينَاراً فَإِنْ سَقَطَتْ مِنْهُ جِذْمَةُ لَحْمٍ وَ لَمْ يُوضِحْ وَ كَانَ قَدْرَ الدِّرْهَمِ فَمَا فَوْقَ ذَلِكَ فَدِيَتُهُ ثَلَاثُونَ دِينَاراً وَ دِيَةُ الشَّجَّةِ إِذَا كَانَتْ تُوضِحُ أَرْبَعُونَ دِينَاراً إِذَا كَانَتْ فِي الْخَدِّ ",
          "وَ فِي مُوضِحَةِ الرَّأْسِ خَمْسُونَ دِينَاراً فَإِنْ نُقِّلَ مِنْهَا الْعِظَامُ فَدِيَتُهَا مِائَةٌ وَ خَمْسُونَ دِينَاراً فَإِنْ كَانَتْ نَاقِبَةٌ فِي الرَّأْسِ فَتِلْكَ الْمَأْمُومَةُ دِيَتُهَا ثَلَاثُمِائَةٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَار."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the cheek, when there is a rupture in it from which the inside of the mouth can be seen, so its wergild is two hundred Dinars; and if medication is applied so it is cured, and complete, and due to it there is a clear mark and an obscene tear, so its wergild is fifty Dinars. So if there was piercing in both of the cheeks, so its wergild is one hundred Dinars. And that is half the wergild of that from which the (inside of) the mouth can be seen. ",
            "So if it had been jabbed at with a blade which affirmed into the bone to the extent that it pierced into the jaw, so its wergild is one hundred and fifty Dinars, fifty of which have been made to be for exposing it (the bone); and if it had caused a blister and did not get affirmed in it, so its wergild is one hundred Dinars; so if it had exposed something from the face, so its wergild would be fifty Dinars; so if it was that it had ugliness for it, so its wergild would be for it along with the wergild for the exposure (of the bone).",
            "So if it has been a wound and did not expose (a bone), then it was cured, and it was in the two cheeks, so its wergild would be ten Dinars; so if it was in the face as a fracture, its wergild would be eighty Dinars; so if a piece of the flesh had fallen from it, and it did not expose bone), and it was the size of the Dirham, and it was not above that, its wergild would be thirty Dinars; and a wergild of the piercing when it had exposed (the bone) is forty Dinars, when it was in the cheek.",
            "And with regards to exposure (of the bone) in the head, it is fifty Dinars; so if the bone had been displaced from it, its wergild is one hundred and fifty Dinars. So if it had been pierced in the head, so that would be <span class=\"iTxt\">Al-Mamouma</span> (the skull fracture reaching the brain), its wergild is three hundred and thirty three Dinars and one-third of a Dinar."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "اللَّطْمَةِ"
        ],
        "translations": {
          "en.hubeali": [
            "The slap"
          ]
        }
      },
      {
        "index": 14197,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:3",
        "text": [],
        "translations": {
          "en.hubeali": [
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي اللَّطْمَةِ يَسْوَدُّ أَثَرُهَا فِي الْوَجْهِ أَنَّ أَرْشَهَا سِتَّةُ دَنَانِيرَ فَإِنْ لَمْ تَسْوَدَّ وَ اخْضَرَّتْ فَإِنَّ أَرْشَهَا ثَلَاثَةُ دَنَانِيرَ فَإِنِ احْمَرَّتْ وَ لَمْ تَخْضَرَّ فَإِنَّ أَرْشَهَا دِينَارٌ وَ نِصْفٌ .",
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Is’haq Bin Ammr, ",
            "(It has been narrated) from Abu abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding the slap, blackening in the face by its impact, that its compensation is six Dinars. So if it does not blacken, and it becomes green, so its compensation is three Dinars; so if it reddens and does not become green, so its compensation is a Dinar and a half’."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْأُذُنُ "
        ],
        "translations": {
          "en.hubeali": [
            "The ear"
          ]
        }
      },
      {
        "index": 14198,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/659",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/660",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2428",
              "text": "مِسْمَعٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ مِسْمَعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:4",
        "text": [
          " إِنَّ عَلِيّاً ( عليه السلام ) قَضَى فِي شَحْمَةِ الْأُذُنِ ثُلُثَ دِيَةِ الْأُذُنِ .",
          "وَ بِالْإِسْنَادِ الْأَوَّلِ فِي الْأُذُنَيْنِ إِذَا قُطِعَتْ إِحْدَاهُمَا فَدِيَتُهَا خَمْسُمِائَةِ دِينَارٍ وَ مَا قُطِعَ مِنْهَا فَبِحِسَابِ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman Al Asamma, from Misma’a, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘Ali<sup>asws</sup> judged regarding an ear lobe, being one-third of the wergild of the ear’.",
            "And by the first chain regarding the two ears when one of them is cut, so its wergild is five hundred Dinars, and whatever is cut from it, it would be by the accounting of that’."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْأَسْنَانُ "
        ],
        "translations": {
          "en.hubeali": [
            "The teeth"
          ]
        }
      },
      {
        "index": 14199,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:5",
        "text": [
          "قَالَ وَ فِي الْأَسْنَانِ فِي كُلِّ سِنٍّ خَمْسُونَ دِينَاراً وَ الْأَسْنَانُ كُلُّهَا سَوَاءٌ وَ كَانَ قَبْلَ ذَلِكَ يَقْضِي فِي الثَّنِيَّةِ خَمْسُونَ دِينَاراً وَ فِي الرَّبَاعِيَةِ أَرْبَعُونَ دِينَاراً وَ فِي النَّابِ ثَلَاثُونَ دِينَاراً وَ فِي الضِّرْسِ خَمْسَةٌ وَ عِشْرُونَ دِينَاراً ",
          "فَإِنِ اسْوَدَّتِ السِّنُّ إِلَى الْحَوْلِ وَ لَمْ تَسْقُطْ فَدِيَتُهَا دِيَةُ السَّاقِطَةِ خَمْسُونَ دِينَاراً وَ إِنِ انْصَدَعَتْ وَ لَمْ تَسْقُطْ فَدِيَتُهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ مَا انْكَسَرَ مِنْهَا مِنْ شَيْ‏ءٍ فَبِحِسَابِهِ مِنَ الْخَمْسِينَ دِينَاراً فَإِنْ سَقَطَتْ بَعْدُ وَ هِيَ سَوْدَاءُ فَدِيَتُهَا اثْنَا عَشَرَ دِينَاراً وَ نِصْفُ دِينَارٍ فَمَا انْكَسَرَ مِنْهَا مِنْ شَيْ‏ءٍ فَبِحِسَابِهِ مِنَ الْخَمْسَةِ وَ الْعِشْرِينَ دِينَاراً ."
        ],
        "translations": {
          "en.hubeali": [
            "He<sup>asws</sup> said: ‘And regarding the teeth, for every tooth is fifty Dinars, and all the teeth are equal; and before that it was judged with regards to the incisors being fifty Dinars, and regarding the quadrilaterals is forty Dinars, and regarding the canines is thirty Dinars, and regarding the molars is twenty five Dinars. ",
            "If the tooth blackens to its surroundings and does not fall off, so its wergild is the wergild of the falling, being fifty Dinars; and if it cracks and does not fall off, so its wergild is twenty Dinars, and whatever breaks from it, from something, so it would be by its accounting from the fifty Dinars. So if it falls of afterwards and it has blackened, so its wergild is twelve Dinars and a half a Dinar. So whatever breaks from it from something, so its accounting would be from the twenty five Dinars’."
          ]
        }
      },
      {
        "index": 14200,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:6",
        "text": [
          " الْأَسْنَانُ كُلُّهَا سَوَاءٌ فِي كُلِّ سِنٍّ خَمْسُمِائَةِ دِرْهَمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abdullah Bin Sinan, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘The teeth, all of them are equal, regarding each tooth is five hundred Dirhams’."
          ]
        }
      },
      {
        "index": 14201,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2483",
              "text": "عَلِيِّ بْنِ الْحَكَمِ أَوْ غَيْرِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/220",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ أَوْ غَيْرِهِ عَنْ أَبَانٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:7",
        "text": [
          " كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ إِذَا اسْوَدَّتِ الثَّنِيَّةُ جُعِلَ فِيهَا الدِّيَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, or someone else, from Aban, from one of his companions, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘Amir Al-Momineen<sup>asws</sup> was saying: ‘When the incisors blacken, the wergild would be applicable regarding it’."
          ]
        }
      },
      {
        "index": 14202,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/322",
              "text": "سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:8",
        "text": [
          " سَأَلْتُهُ عَنِ الْأَسْنَانِ فَقَالَ هِيَ فِي الدِّيَةِ سَوَاءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Usma Bin Isa, from Sama’at who said, ",
            "‘I asked him<sup>asws</sup> about the teeth, so he<sup>asws</sup> said: ‘These, with regards to the wergild, are the same’."
          ]
        }
      },
      {
        "index": 14203,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:9",
        "text": [
          " السِّنُّ إِذَا ضُرِبَتِ انْتُظِرَ بِهَا سَنَةً فَإِنْ وَقَعَتْ أُغْرِمَ الضَّارِبُ خَمْسَمِائَةِ دِرْهَمٍ وَ إِنْ لَمْ تَقَعْ وَ اسْوَدَّتْ أُغْرِمَ ثُلُثَيْ دِيَتِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abdullah Bin Sinan, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘The tooth, when it is stuck, would be awaited with for a year. So if it falls off, the striker would be fined five hundred Dirhams, and if it does not fall off and blackens, he would be fined two-thirds of its wergild’."
          ]
        }
      },
      {
        "index": 14204,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/659",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/611",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2428",
              "text": "مِسْمَعٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مِسْمَعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:10",
        "text": [
          " إِنَّ عَلِيّاً ( عليه السلام ) قَضَى فِي سِنِّ الصَّبِيِّ قَبْلَ أَنْ يَثَّغِرَ بَعِيراً بَعِيراً فِي كُلِّ سِنٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Misma’a, ",
            "Abu Abdullah<sup>asws</sup> has sad: ‘Ali<sup>asws</sup> judged regarding a tooth of a child before it extrudes, with a camel, a camel regarding each tooth’."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "التَّرْقُوَةُ "
        ],
        "translations": {
          "en.hubeali": [
            "The clavicle (collar-bone)"
          ]
        }
      },
      {
        "index": 14205,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/5786",
              "text": "رَجَعَ"
            },
            {
              "kind": "plain",
              "text": " إِلَى "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5787",
              "text": "الْإِسْنَادِ الْأَوَّلِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "رَجَعَ إِلَى الْإِسْنَادِ الْأَوَّلِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:11",
        "text": [
          " وَ فِي التَّرْقُوَةِ إِذَا انْكَسَرَتْ فَجُبِرَتْ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ أَرْبَعُونَ دِينَاراً فَإِنِ انْصَدَعَتْ فَدِيَتُهَا أَرْبَعَةُ أَخْمَاسِ كَسْرِهَا اثْنَانِ وَ ثَلَاثُونَ دِينَاراً فَإِنْ أَوْضَحَتْ فَدِيَتُهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ ذَلِكَ خَمْسَةُ أَجْزَاءٍ مِنْ ثَمَانِيَةٍ مِنْ دِيَتِهَا إِذَا انْكَسَرَتْ فَإِنْ نُقِّلَ مِنْهَا الْعِظَامُ فَدِيَتُهَا نِصْفُ دِيَةِ كَسْرِهَا عِشْرُونَ دِينَاراً فَإِنْ نُقِبَتْ فَدِيَتُهَا رُبُعُ دِيَةِ كَسْرِهَا عَشَرَةُ دَنَانِيرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Referring to the first chain, he<sup>asws</sup> said: ‘And regarding the clavicle when it breaks, so it is bandaged upon and becomes flawless, is forty Dinars. So if it cracks, it wergild is four fifths for its breaking, being thirty-two Dinars. So if it is exposed, its wergild is twenty-five Dinars, and this is a fifth part from one-eight from its wergild, when it breaks. So if the bone is displaced from it, its wergild is half the wergild of its breaking, being twenty Dinars. So if it is pierced, its wergild is a quarter of the wergild of its breaking, being ten Dinars’.  "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْمَنْكِبُ "
        ],
        "translations": {
          "en.hubeali": [
            "The shoulder"
          ]
        }
      },
      {
        "index": 14206,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:12",
        "text": [
          "وَ دِيَةُ الْمَنْكِبِ إِذَا كُسِرَ الْمَنْكِبُ خُمُسُ دِيَةِ الْيَدِ مِائَةُ دِينَارٍ فَإِنْ كَانَ فِي الْمَنْكِبِ صَدْعٌ فَدِيَتُهُ أَرْبَعَةُ أَخْمَاسِ دِيَةِ كَسْرِهِ ثَمَانُونَ دِينَاراً فَإِنْ أُوضِحَ فَدِيَتُهُ رُبُعُ دِيَةِ كَسْرِهِ خَمْسَةٌ وَ عِشْرُونَ دِينَاراً فَإِنْ نُقِّلَتْ مِنْهُ الْعِظَامُ فَدِيَتُهُ مِائَةُ دِينَارٍ وَ خَمْسَةٌ وَ سَبْعُونَ دِينَاراً مِنْهَا مِائَةُ دِينَارٍ دِيَةُ كَسْرِهِ وَ خَمْسُونَ دِينَاراً لِنَقْلِ عِظَامِهِ وَ خَمْسَةٌ وَ عِشْرُونَ دِينَاراً لِمُوضِحَتِهِ فَإِنْ كَانَتْ نَاقِبَةً فَدِيَتُهَا رُبُعُ دِيَةِ كَسْرِهِ خَمْسَةٌ وَ عِشْرُونَ دِينَاراً فَإِنْ رُضَّ فَعَثَمَ فَدِيَتُهُ ثُلُثُ دِيَةِ النَّفْسِ ثَلَاثُمِائَةٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ فَإِنْ فُكَّ فَدِيَتُهُ ثَلَاثُونَ دِينَاراً ."
        ],
        "translations": {
          "en.hubeali": [
            "And a wergild of the shoulder, when the shoulder breaks, is one-fifth of the wergild of the hand, being one hundred Dinars. So if there was a crack in the shoulder, so its wergild would be four-fifths of the wergild of its breaking, being eighty Dinars. So if it is exposed, so its wergild is one-quarter of the wergild of its breaking, being twenty-five Dinars. So if the bone is displaced from it, so its wergild is one hundred Dinars plus seventy-five Dinars, of which one hundred Dinars being for its breaking, and fifty Dinars for the displacement of its bone, and twenty-five Dinars being for its exposure. So it was pierced, so its wergild is a quarter of its breaking, being twenty-five Dinars. So if it is bruised, so it is defective, so its wergild is one-third of the wergild of the soul, being three hundred and thirty three Dinars and one-third of a Dinar. So if it is disjointed, so its wergild is thirty Dinars’."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْعَضُدُ "
        ],
        "translations": {
          "en.hubeali": [
            "The (upper) arms"
          ]
        }
      },
      {
        "index": 14207,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:13",
        "text": [
          "وَ فِي الْعَضُدِ إِذَا انْكَسَرَتْ فَجُبِرَتْ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ فَدِيَتُهَا خُمُسُ دِيَةِ الْيَدِ مِائَةُ دِينَارٍ وَ دِيَةُ مُوضِحَتِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ دِيَةُ نَقْلِ عِظَامِهَا نِصْفُ دِيَةِ كَسْرِهَا خَمْسُونَ دِينَاراً وَ دِيَةُ نَقْبِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً ."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the arm, when it breaks, so it is bandaged upon and there is no fault, so its wergild is a fifth of the wergild of the hand, being one hundred Dinars; and wergild for its exposure is a quarter of the wergild of its breaking, being twenty-five Dinars; and wergild for the displacement of its bone is half the wergild of its breaking, being fifty Dinars; and wergild of its being pierced is a quarter of the wergild of its breaking, being twenty-five Dinars’."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْمِرْفَقُ "
        ],
        "translations": {
          "en.hubeali": [
            "The elbow"
          ]
        }
      },
      {
        "index": 14208,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:14",
        "text": [
          "وَ فِي الْمِرْفَقِ إِذَا كُسِرَ فَجُبِرَ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ فَدِيَتُهُ مِائَةُ دِينَارٍ وَ ذَلِكَ خُمُسُ دِيَةِ الْيَدِ فَإِنِ انْصَدَعَ فَدِيَتُهُ أَرْبَعَةُ أَخْمَاسِ كَسْرِهِ ثَمَانُونَ دِينَاراً فَإِنْ نُقِّلَ مِنْهُ الْعِظَامُ فَدِيَتُهُ مِائَةُ دِينَارٍ وَ خَمْسَةٌ وَ سَبْعُونَ دِينَاراً لِلْكَسْرِ مِائَةُ دِينَارٍ وَ لِنَقْلِ الْعِظَامِ خَمْسُونَ دِينَاراً وَ لِلْمُوضِحَةِ خَمْسَةٌ وَ عِشْرُونَ دِينَاراً فَإِنْ كَانَتْ نَاقِبَةً فَدِيَتُهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً فَإِنْ رُضَّ الْمِرْفَقُ فَعَثَمَ فَدِيَتُهُ ثُلُثُ دِيَةِ النَّفْسِ ثَلَاثُمِائَةِ دِينَارٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ فَإِنْ كَانَ فُكَّ فَدِيَتُهُ ثَلَاثُونَ دِينَاراً ."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the elbow, when it breaks, so it is bandaged upon and there is no fault, so its wergild is one hundred Dinars, and that is a fifth of the wergild of the hand. So if it cracks, its wergild is four-fifths of its breaking, being eighty Dinars. So if the bone was displaced from it, its wergild is one hundred Dinar plus seventy-five Dinars, for the breaking being one hundred Dinars, and for the displacement of the bone being fifty Dinars, and for the exposure being twenty-five Dinars. So if was pierced, its wergild is one-quarter of its breaking, being twenty-five Dinars. So if it is bruised and becomes defective, its wergild is one-third of the wergild of the soul, being three hundred and thirty three Dinars and one-third of a Dinar. So it was disjointed, its wergild is thirty Dinars’."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "السَّاعِدُ "
        ],
        "translations": {
          "en.hubeali": [
            "The forearm"
          ]
        }
      },
      {
        "index": 14209,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:15",
        "text": [
          "وَ فِي السَّاعِدِ إِذَا كُسِرَ ثُمَّ جُبِرَ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ فَدِيَتُهُ ثُلُثُ دِيَةِ النَّفْسِ ثَلَاثُمِائَةٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ فَإِنْ كُسِرَ إِحْدَى الْقَصَبَتَيْنِ مِنَ السَّاعِدِ فَدِيَتُهُ خُمُسُ دِيَةِ الْيَدِ مِائَةُ دِينَارٍ فَإِنْ كُسِرَتْ قَصَبَتَا السَّاعِدِ فَدِيَتُهَا خُمُسُ دِيَةِ الْيَدِ مِائَةُ دِينَارٍ ",
          "وَ فِي الْكَسْرِ لِأَحَدِ الزَّنْدَيْنِ خَمْسُونَ دِينَاراً وَ فِي كِلَيْهِمَا مِائَةُ دِينَارٍ فَإِنِ انْصَدَعَتْ إِحْدَى الْقَصَبَتَيْنِ فَفِيهَا أَرْبَعَةُ أَخْمَاسِ دِيَةِ إِحْدَى قَصَبَتَيِ السَّاعِدِ أَرْبَعُونَ دِينَاراً وَ دِيَةُ مُوضِحَتِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ دِيَةُ نَقْلِ عِظَامِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ دِيَةُ نَقْبِهَا نِصْفُ دِيَةِ مُوضِحَتِهَا اثْنَا عَشَرَ دِينَاراً وَ نِصْفُ دِينَارٍ وَ دِيَةُ نَافِذَتِهَا خَمْسُونَ دِينَاراً فَإِنْ كَانَتْ فِيهِ قَرْحَةٌ لَا تَبْرَأُ فَدِيَتُهَا ثُلُثُ دِيَةِ السَّاعِدِ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ ذَلِكَ ثُلُثُ دِيَةِ الَّذِي هِيَ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the forearm, when it breaks, then is bandaged upon and there is no fault, so its wergild is one-third of a wergild of the soul, being three hundred and thirty three Dinars and one-third of a Dinar. So if one of the two bones of the forearm breaks, its wergild is a fifth of the wergild of the hand, being one hundred Dinars. So if both the bones of the forearm were to break, its wergild is (still) a fifth of the wergild of the hand, being one hundred Dinars.  ",
            "And regarding the breaking of one of the two wrists, it is fifty Dinars, and regarding both of these is one hundred Dinars. So if one of the two bones cracks, so regarding it is four-fifths of the wergild of one of the two bones of the forearms, being forty Dinars; and the wergild for its exposure is a quarter of the wergild of its breaking, being twenty five Dinars; and wergild of the displacement of its bones is a quarter of the wergild of its breaking, being twenty five Dinars; and the wergild of its piercing is half the wergild of its exposure, being twelve Dinars and half a Dinar; and wergild of its being jabbed is fifty Dinars. So if there was a scar in it which does not get cured, so its wergild is one-third of the wergild of the forearm, being thirty-three Dinars, and one-third of a Dinar, that is one-third of the wergild of that which is in it’. "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الرُّصْغُ "
        ],
        "translations": {
          "en.hubeali": [
            "The wrist"
          ]
        }
      },
      {
        "index": 14210,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:16",
        "text": [
          "وَ دِيَةُ الرُّصْغِ إِذَا رُضَّ فَجُبِرَ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ ثُلُثُ دِيَةِ الْيَدِ مِائَةُ دِينَارٍ وَ سِتَّةٌ وَ سِتُّونَ دِينَاراً وَ ثُلُثَا دِينَارٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And the wergild for the wrist, when it is bruised, so it is bandaged upon and there is no fault, is one-third of the wergild of the hand, being one hundred and sixty-six Dinars, and one-third of a Dinar’."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْكَفُّ "
        ],
        "translations": {
          "en.hubeali": [
            "The palm"
          ]
        }
      },
      {
        "index": 14211,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:17",
        "text": [
          "وَ فِي الْكَفِّ إِذَا كُسِرَتْ فَجُبِرَتْ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ فَدِيَتُهَا خُمُسُ دِيَةِ الْيَدِ مِائَةُ دِينَارٍ وَ إِنْ فُكَّ الْكَفُّ فَدِيَتُهَا ثُلُثُ دِيَةِ الْيَدِ مِائَةُ دِينَارٍ وَ سِتَّةٌ وَ سِتُّونَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ فِي مُوضِحَتِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ دِيَةُ نَقْلِ عِظَامِهَا خَمْسُونَ دِينَاراً نِصْفُ دِيَةِ كَسْرِهَا وَ فِي نَافِذَتِهَا إِنْ لَمْ تَنْسَدَّ خُمُسُ دِيَةِ الْيَدِ مِائَةُ دِينَارٍ فَإِنْ كَانَتْ نَاقِبَةً فَدِيَتُهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً ",
          "وَ فِي دِيَةِ الْأَصَابِعِ وَ الْقَصَبِ الَّتِي فِي الْكَفِّ فَفِي الْإِبْهَامِ إِذَا قُطِعَ ثُلُثُ دِيَةِ الْيَدِ مِائَةُ دِينَارٍ وَ سِتَّةٌ وَ سِتُّونَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ دِيَةُ قَصَبَةِ الْإِبْهَامِ الَّتِي فِي الْكَفِّ تُجْبَرُ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ خُمُسُ دِيَةِ الْإِبْهَامِ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ إِذَا اسْتَوَى جَبْرُهَا وَ ثَبَتَ وَ دِيَةُ صَدْعِهَا سِتَّةٌ وَ عِشْرُونَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ دِيَةُ مُوضِحَتِهَا ثَمَانِيَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ دِيَةُ نَقْلِ عِظَامِهَا سِتَّةَ عَشَرَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ دِيَةُ نَقْبِهَا ثَمَانِيَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ نِصْفُ دِيَةِ نَقْلِ عِظَامِهَا",
          "وَ دِيَةُ مُوضِحَتِهَا نِصْفُ دِيَةِ نَاقِلَتِهَا ثَمَانِيَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ دِيَةُ فَكِّهَا عَشَرَةُ دَنَانِيرَ وَ دِيَةُ الْمَفْصِلِ الثَّانِي مِنْ أَعْلَى الْإِبْهَامِ إِنْ كُسِرَ فَجُبِرَ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ سِتَّةَ عَشَرَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ دِيَةُ الْمُوضِحَةِ إِنْ كَانَتْ فِيهَا أَرْبَعَةُ دَنَانِيرَ وَ سُدُسُ دِينَارٍ وَ دِيَةُ صَدْعِهَا ثَلَاثَةَ عَشَرَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ دِيَةُ نَقْلِ عِظَامِهَا خَمْسَةُ دَنَانِيرَ فَمَا قُطِعَ مِنْهَا فَبِحِسَابِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the palm when it breaks, so it is bandaged upon and there is no fault, so its wergild is a fifth of the wergild of the hand, being one hundred Dinars; and if the palm is disjointed, so its wergild is one-third of the wergild of the hand, being one hundred and sixty-six Dinars and two-thirds of a Dinar; and regarding its exposure is a quarter of the wergild of its breaking, being twenty five Dinars; and a wergild for the displacement of its bones is fifty Dinars, being half the wergild for its breaking; and regarding its piercing, if it not sealed up, is a fifth of the wergild of the hand, being one hundred Dinars. So if it was pierced, its wergild is a quarter of the wergild of its breaking, being twenty-five Dinars. ",
            "And regarding the wergild of the fingers and the bones which are in the palm, so regarding the thumb when it is cut-off, there is one-third of the wergild of the hand, being one hundred and sixty-six Dinars and two-thirds of a Dinar; and wergild of the bone of the thumb which is in the palm, is bandaged upon and there is no fault, is one-fifth of the wergild of the thumb, being thirty-three Dinars and one- third of the Dinar, when its bones are set and evened, and it is firm; and the wergild of its cracking is twenty-six Dinars and two-thirds of a Dinar; and the wergild for its exposure is eighty Dinars and one-third of a Dinar; and wergild of the displacement of its bone is sixteen Dinar and two-thirds of a Dinar; and wergild for its piercing is eight Dinars and one-third of a Dinar, being half the wergild of the displacement of its bones;",
            "And a wergild of its exposure is half the wergild of its displacement, being eight Dinars and one-third of a Dinar; and the wergild of it being disjointed is ten Dinars; and wergild of the second joint from the top of the thumb, if it breaks, so it is bandaged upon and there is no fault, is sixteen Dinars and one-third of a Dinar; and wergild of the exposure, if there was in it, is four Dinars and one-sixth of a Dinar; and wergild of its cracking is thirteen Dinars and one-third of a Dinar; and wergild of the displacement of its bones is five Dinars. So whatever was cut from it, so it would be by its accounting’. "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْأَصَابِعُ "
        ],
        "translations": {
          "en.hubeali": [
            "The fingers"
          ]
        }
      },
      {
        "index": 14212,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:18",
        "text": [
          "وَ فِي الْأَصَابِعِ فِي كُلِّ إِصْبَعٍ سُدُسُ دِيَةِ الْيَدِ ثَلَاثَةٌ وَ ثَمَانُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ دِيَةُ قَصَبِ أَصَابِعِ الْكَفِّ سِوَى الْإِبْهَامِ دِيَةُ كُلِّ قَصَبَةٍ عِشْرُونَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ دِيَةُ كُلِّ مُوضِحَةٍ فِي كُلِّ قَصَبَةٍ مِنَ الْقَصَبِ الْأَرْبَعِ أَرْبَعَةُ دَنَانِيرَ وَ سُدُسُ دِينَارٍ وَ دِيَةُ نَقْلِ كُلِّ قَصَبَةٍ مِنْهُنَّ ثَمَانِيَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ دِيَةُ كَسْرِ كُلِّ مَفْصِلٍ مِنَ الْأَصَابِعِ الْأَرْبَعِ الَّتِي تَلِي الْكَفَّ سِتَّةَ عَشَرَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ فِي صَدْعِ كُلِّ قَصَبَةٍ مِنْهُنَّ ثَلَاثَةَ عَشَرَ دِينَاراً وَ ثُلُثُ دِينَارٍ",
          "فَإِنْ كَانَ فِي الْكَفِّ قَرْحَةٌ لَا تَبْرَأُ فَدِيَتُهَا ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ فِي نَقْلِ عِظَامِهِ ثَمَانِيَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ فِي مُوضِحَتِهِ أَرْبَعَةُ دَنَانِيرَ وَ سُدُسُ دِينَارٍ وَ فِي نَقْبِهِ أَرْبَعَةُ دَنَانِيرَ وَ سُدُسُ دِينَارٍ وَ فِي فَكِّهِ خَمْسَةُ دَنَانِيرَ",
          "وَ دِيَةُ الْمَفْصِلِ الْأَوْسَطِ مِنَ الْأَصَابِعِ الْأَرْبَعِ إِذَا قُطِعَ فَدِيَتُهُ خَمْسَةٌ وَ خَمْسُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ فِي كَسْرِهِ أَحَدَ عَشَرَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ فِي صَدْعِهِ ثَمَانِيَةُ دَنَانِيرَ وَ نِصْفُ دِينَارٍ وَ فِي مُوضِحَتِهِ دِينَارَانِ وَ ثُلُثَا دِينَارٍ وَ فِي نَقْلِ عِظَامِهِ خَمْسَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ فِي نَقْبِهِ دِينَارَانِ لُثَا دِينَارٍ وَ فِي فَكِّهِ ثَلَاثَةُ دَنَانِيرَ وَ ثُلُثَا دِينَارٍ",
          "وَ فِي الْمَفْصِلِ الْأَعْلَى مِنَ الْأَصَابِعِ الْأَرْبَعِ إِذَا قُطِعَ سَبْعَةٌ وَ عِشْرُونَ دِينَاراً وَ وَ ثُ نِصْفٌ وَ رُبُعٌ وَ نِصْفُ عُشْرِ دِينَارٍ وَ فِي كَسْرِهِ خَمْسَةُ دَنَانِيرَ وَ أَرْبَعَةُ أَخْمَاسِ دِينَارٍ وَ فِي صَدْعِهِ أَرْبَعَةُ دَنَانِيرَ وَ خُمُسُ دِينَارٍ وَ فِي مُوضِحَتِهِ دِينَارَانِ وَ ثُلُثُ دِينَارٍ وَ فِي نَقْلِ عِظَامِهِ خَمْسَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ فِي نَقْبِهِ دِينَارَانِ وَ ثُلُثَا دِينَارٍ وَ فِي فَكِّهِ ثَلَاثَةُ دَنَانِيرَ وَ ثُلُثَا دِينَارٍ وَ فِي ظُفُرِ كُلِّ إِصْبَعٍ مِنْهَا خَمْسَةُ دَنَانِيرَ",
          "وَ فِي الْكَفِّ إِذَا كُسِرَتْ فَجُبِرَتْ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ فَدِيَتُهَا أَرْبَعُونَ دِينَاراً وَ دِيَةُ صَدْعِهَا أَرْبَعَةُ أَخْمَاسِ دِيَةِ كَسْرِهَا اثْنَانِ وَ ثَلَاثُونَ دِينَاراً وَ دِيَةُ مُوضِحَتِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ دِيَةُ نَقْلِ عِظَامِهَا عِشْرُونَ دِينَاراً وَ نِصْفُ دِينَارٍ وَ دِيَةُ نَقْبِهَا رُبُعُ دِيَةِ كَسْرِهَا عَشَرَةُ دَنَانِيرَ وَ دِيَةُ قَرْحَةٍ لَا تَبْرَأُ ثَلَاثَةَ عَشَرَ دِينَاراً وَ ثُلُثُ دِينَارٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the fingers, for every finger is a sixth of the wergild of the hand, being eighty three Dinars and one-third of a Dinar; and wergild for the fingers bones of the palm beside the thumb, is a wergild of all bones being twenty Dinars and one-third of a Dinar; and wergild of every exposure regarding each of the bone from the four bones is four Dinars and one-sixth of a Dinar; and wergild of displacement of every bone from these is eight Dinars and one-third of a Dinar; and wergild of breaking of every joint from the four fingers which emerge from the palm is sixteen Dinars and one-third of a Dinar; and regarding a crack in each bone from these is thirteen Dinars and one-third of a Dinar.",
            "So if there was a sore in the palm which does not get cured, so its wergild is thirty-three Dinars and one-third of a Dinar; and regarding the displacement of its bone is eighty Dinars and one-third of a Dinar; and regarding the exposure is four Dinars and one-sixth of a Dinar; and regarding a piercing is four Dinars and one-sixth of a Dinar; and regarding a disjointing is five Dinars; ",
            "and wergild of the middle joint from the four fingers, when it is cut, so its wergild is fifty-five Dinars and one-third of a Dinar; and regarding the breaking of one (finger) is ten Dinars and one-third of a Dinar; and regarding its cracking is eight Dinars and half a Dinar; and regarding exposure are two Dinars and one-third of a Dinar; and regarding the displacement of its bone is five Dinars and one-third of a Dinar; and regarding a piercing are two Dinars and one-third of a Dinar; and regarding is disjointing is three Dinars and two-thirds of a Dinar; ",
            "and regarding the upper joint from the four fingers, when it is cut, is twenty-seven Dinars and a half, and one-quarter, and half of a tenth of a Dinar; and regarding breaking it is five Dinars and four-fifth of a Dinar; and regarding its cracking is four Dinars and a fifth of a Dinar; and regarding its exposure are two Dinars and one-third of a Dinar; and regarding displacement of its bone is five Dinars and one-third of a Dinar; and regarding its piercing are two Dinars and one-third of a Dinar; and regarding its disjointing is three Dinars and one-third of a Dinar; and regarding a nail of each finger from these, is five Dinars;",
            "And regarding the palm when it breaks, so it is bandaged upon and there is no fault, so its wergild is forty Dinars; and wergild of its cracking it four-fifths of the wergild of its breaking, being thirty-two Dinars; wergild of its exposure is twenty-five Dinars; and wergild of displacement of its bone is twenty Dinars and half a Dinar; and wergild of its piercing is a quarter of the wergild of its breaking, being ten Dinars; and wergild of its sore which does not get cured, is ten Dinars and one-third of a Dinar’."
          ]
        }
      },
      {
        "index": 14213,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:19",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَزَّازِ عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْإِصْبَعِ الزَّائِدَةِ إِذَا قُطِعَتْ ثُلُثُ دِيَةِ الصَّحِيحَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya Al Khazzaz, from Ghayas Bin Ibrahim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the excessive finger when it is cut-off, is one-third of the wergild of the healthy (finger)’. "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الصَّدْرُ "
        ],
        "translations": {
          "en.hubeali": [
            "The chest"
          ]
        }
      },
      {
        "index": 14214,
        "local_index": 20,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/5785",
              "text": "وَ بِالْإِسْنَادِ الْأَوَّلِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِالْإِسْنَادِ الْأَوَّلِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:20",
        "text": [
          " وَ فِي الصَّدْرِ إِذَا رُضَّ فَثَنَى شِقَّيْهِ كِلَيْهِمَا فَدِيَتُهُ خَمْسُمِائَةِ دِينَارٍ وَ دِيَةُ أَحَدِ شِقَّيْهِ إِذَا انْثَنَى مِائَتَانِ وَ خَمْسُونَ دِينَاراً وَ إِذَا انْثَنَى الصَّدْرُ وَ الْكَتِفَانِ فَدِيَتُهُ أَلْفُ دِينَارٍ وَ إِنِ انْثَنَى أَحَدُ شِقَّيِ الصَّدْرِ وَ إِحْدَى الْكَتِفَيْنِ فَدِيَتُهُ خَمْسُمِائَةِ دِينَارٍ وَ دِيَةُ مُوضِحَةِ الصَّدْرِ خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ دِيَةُ مُوضِحَةِ الْكَتِفَيْنِ وَ الظَّهْرِ خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ إِنِ اعْتَرَى الرَّجُلَ مِنْ ذَلِكَ صَعَرٌ لَا يَسْتَطِيعُ أَنْ يَلْتَفِتَ فَدِيَتُهُ خَمْسُمِائَةِ دِينَارٍ فَإِنِ انْكَسَرَ الصُّلْبُ فَجُبِرَ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ فَدِيَتُهُ مِائَةُ دِينَارٍ وَ إِنْ عَثَمَ فَدِيَتُهُ أَلْفُ دِينَارٍ وَ فِي حَلَمَةِ ثَدْيِ الرَّجُلِ ثُمُنُ الدِّيَةِ مِائَةٌ وَ خَمْسَةٌ وَ عِشْرُونَ دِينَاراً ."
        ],
        "translations": {
          "en.hubeali": [
            "And by the first chain, he<sup>asws</sup> said: ‘And regarding the chest when it is bruised, so both of its sides are bent, its wergild is five hundred Dinars; and wergild of one side when it is bent, is two hundred and fifty Dinars; and when the chest and the two shoulders are bent, its wergild is one thousand Dinars; and if one of the side of the chest is bent and one of the shoulders, so its wergild is five hundred Dinars; and wergild of the exposure of the chest is twenty-five Dinars; and wergild of the exposure of the shoulder and the back is twenty five Dinars; and if the man gets twisted from that, not being able to turn around, so its wergild is five hundred Dinars. So if the spine breaks, and it is bandaged upon and there is no fault, so its wergild is one hundred Dinars; and if there remains a flaw, so its wergild is one thousand Dinars; and regarding the nipple of the breast of the man is damaged, the wergild is one hundred and twenty five Dinars’. "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْأَضْلَاعُ "
        ],
        "translations": {
          "en.hubeali": [
            "The ribs"
          ]
        }
      },
      {
        "index": 14215,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:21",
        "text": [
          "وَ فِي الْأَضْلَاعِ فِيمَا خَالَطَ الْقَلْبَ مِنَ الْأَضْلَاعِ إِذَا كُسِرَ مِنْهَا ضِلْعٌ فَدِيَتُهُ خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ فِي صَدْعِهِ اثْنَا عَشَرَ دِينَاراً وَ نِصْفٌ وَ دِيَةُ نَقْلِ عِظَامِهِ سَبْعَةُ دَنَانِيرَ وَ نِصْفٌ وَ مُوضِحَتِهِ عَلَى رُبُعِ كَسْرِهِ وَ نَقْبِهِ مِثْلُ ذَلِكَ وَ فِي الْأَضْلَاعِ مِمَّا يَلِي الْعَضُدَيْنِ دِيَةُ كُلِّ ضِلْعٍ عَشَرَةُ دَنَانِيرَ إِذَا كُسِرَ وَ دِيَةُ صَدْعِهِ سَبْعَةُ دَنَانِيرَ وَ دِيَةُ نَقْلِ عِظَامِهِ خَمْسَةُ دَنَانِيرَ وَ مُوضِحَةِ كُلِّ ضِلْعٍ مِنْهَا رُبُعُ دِيَةِ كَسْرِهِ دِينَارَانِ وَ نِصْفٌ ",
          "فَإِنْ نُقِبَ ضِلْعٌ مِنْهَا فَدِيَتُهَا دِينَارَانِ وَ نِصْفٌ وَ فِي الْجَائِفَةِ ثُلُثُ دِيَةِ النَّفْسِ ثَلَاثُمِائَةٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ فَإِنْ نَفَذَتْ مِنَ الْجَانِبَيْنِ كِلَيْهِمَا رَمْيَةٌ أَوْ طَعْنَةٌ فَدِيَتُهَا أَرْبَعُمِائَةِ دِينَارٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً [وَ ثُلُثُ دِينَارٍ] ."
        ],
        "translations": {
          "en.hubeali": [
            "And with regards to the ribs, regarding what is mingled with the hear from the ribs, when a rib from these breaks, so its wergild is twenty-five Dinars; and regarding its fracture is twelve Dinars and half a Dinar; and wergild of the displacement of its bone is seven Dinars and a half; and its exposure is upon a quarter of its breaking, and its piercing is like that; and with regards to the ribs from what follow from the two upper arms, wergild of each rib is ten Dinars when it breaks; and wergild of its fracture is seven Dinars; and wergild of the displacement of its bone is five Dinars; and the exposure of each rib from it is a quarter of the wergild of its breaking, being two dinars and a half; ",
            "So if a rib from it were to be pierced, so its wergild is two Dinars and a half; and regarding the injury reaching to the inside, is one-third of the wergild of the soul, three hundred and thirty-three Dinars and one-third of a Dinar. So if there is a penetration from both the two sides, by an arrow or a jab, so its wergild is four hundred and thirty-three Dinars and one-third of a Dinar. "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْوَرِكُ "
        ],
        "translations": {
          "en.hubeali": [
            "The hip"
          ]
        }
      },
      {
        "index": 14216,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:22",
        "text": [
          "وَ فِي الْوَرِكِ إِذَا كُسِرَ فَجُبِرَ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ خُمُسُ دِيَةِ الرِّجْلِ مِائَتَا دِينَارٍ وَ إِنْ صُدِعَ الْوَرِكُ فَدِيَتُهُ مِائَةٌ وَ سِتُّونَ دِينَاراً أَرْبَعَةُ أَخْمَاسِ دِيَةِ كَسْرِهِ فَإِنْ أَوْضَحَتْ فَدِيَتُهُ رُبُعُ دِيَةِ كَسْرِهِ خَمْسُونَ دِينَاراً وَ دِيَةُ نَقْلِ عِظَامِهِ مِائَةٌ وَ خَمْسَةٌ وَ سَبْعُونَ دِينَاراً مِنْهَا لِكَسْرِهَا مِائَةُ دِينَارٍ وَ لِنَقْلِ عِظَامِهَا خَمْسُونَ دِينَاراً وَ لِمُوضِحَتِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ دِيَةُ فَكِّهَا ثَلَاثُونَ دِينَاراً فَإِنْ رُضَّتْ فَعَثَمَتْ فَدِيَتُهَا ثَلَاثُمِائَةِ دِينَارٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the hip, when it breaks, so it is bandaged upon and there is no fault, is one-fifth of the wergild of the leg, being one hundred Dinars; and if the hip is fractured, so its wergild is one hundred and sixty Dinars, being four-fifths of the wergild of its breaking. So it is exposed, its wergild is one-quarter of its breaking, being fifty Dinars; and wergild of the displacement of its bone is one hundred and seventy-five Dinars, from it for its break is one hundred Dinars, and for the displacement of its bone is fifty Dinars, and for its exposure is twenty-five Dinars; and wergild of its disjointing is thirty Dinars. So if it is bruised, and becomes defective, so its wergild is three hundred and thirty-three Dinars and one-third of a Dinar. "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْفَخِذُ "
        ],
        "translations": {
          "en.hubeali": [
            "The thigh"
          ]
        }
      },
      {
        "index": 14217,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:23",
        "text": [
          "وَ فِي الْفَخِذِ إِذَا كُسِرَتْ فَجُبِرَتْ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ خُمُسُ دِيَةِ الرِّجْلِ مِائَتَا دِينَارٍ فَإِنْ عَثَمَتْ فَدِيَتُهَا ثَلَاثُمِائَةٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ ذَلِكَ ثُلُثُ دِيَةِ النَّفْسِ وَ دِيَةُ صَدْعِ الْفَخِذِ أَرْبَعَةُ أَخْمَاسِ دِيَةِ كَسْرِهَا مِائَةُ دِينَارٍ وَ سِتُّونَ دِينَاراً فَإِنْ كَانَتْ قَرْحَةً لَا تَبْرَأُ فَدِيَتُهَا ثُلُثُ دِيَةِ كَسْرِهَا سِتَّةٌ وَ سِتُّونَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ دِيَةُ مُوضِحَتِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسُونَ دِينَاراً وَ دِيَةُ نَقْلِ عِظَامِهَا نِصْفُ دِيَةِ كَسْرِهَا مِائَةُ دِينَارٍ وَ دِيَةُ نَقْبِهَا رُبُعُ دِيَةِ كَسْرِهَا مِائَةٌ وَ سِتُّونَ دِينَاراً ."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the thigh, when it breaks, so it is bandaged upon and there is no fault, is one-fifth of the wergild of the left, being two hundred Dinars. So if there is a flaw, so its wergild is three hundred and thirty-three Dinars and one-third of a Dinar, and that is one-third of the wergild of the soul; and wergild of a fracture of the thigh is four-fifths of the wergild of its breaking, being one hundred and sixty Dinars. So if it was a wound that does not get cured, so its wergild is one-third of the wergild of its breaking, being sixty-six Dinars and two-thirds of a Dinar; and wergild of its exposure is a quarter of the wergild of its breaking, being fifty Dinars; and wergild of the displacement of its bone is half the wergild of its breaking, being one hundred Dinars; and wergild of its piercing is a quarter of the wergild of its breaking, being one hundred and sixty Dinars’. "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الرُّكْبَةُ "
        ],
        "translations": {
          "en.hubeali": [
            "The knee"
          ]
        }
      },
      {
        "index": 14218,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:24",
        "text": [
          "وَ فِي الرُّكْبَةِ إِذَا كُسِرَتْ فَجُبِرَتْ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ خُمُسُ دِيَةِ الرِّجْلِ مِائَتَا دِينَارٍ فَإِنِ انْصَدَعَتْ فَدِيَتُهَا أَرْبَعَةُ أَخْمَاسِ دِيَةِ كَسْرِهَا مِائَةٌ وَ سِتُّونَ دِينَاراً وَ دِيَةُ مُوضِحَتِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسُونَ دِينَاراً وَ دِيَةُ نَقْلِ عِظَامِهَا مِائَةُ دِينَارٍ وَ خَمْسَةٌ وَ سَبْعُونَ دِينَاراً مِنْهَا دِيَةُ كَسْرِهَا مِائَةُ دِينَارٍ وَ فِي نَقْلِ عِظَامِهَا خَمْسُونَ دِينَاراً وَ فِي مُوضِحَتِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ فِي قَرْحَةٍ فِيهَا لَا تَبْرَأُ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ فِي نُفُوذِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسُونَ دِينَاراً وَ دِيَةُ نَقْبِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسُونَ دِينَاراً فَإِنْ رُضَّتْ فَعَثَمَتْ فَفِيهَا ثُلُثُ دِيَةِ النَّفْسِ ثَلَاثُمِائَةٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ فَإِنْ فُكَّتْ فَفِيهَا ثَلَاثَةُ أَجْزَاءٍ مِنْ دِيَةِ الْكَسْرِ ثَلَاثُونَ دِينَاراً ."
        ],
        "translations": {
          "en.hubeali": [
            "And with regards to the knee, when it breaks, so it is bandaged upon and there is no fault, is one-fifth of the wergild of the leg, being two hundred Dinars. So if it is fractured, its wergild is four-fifths of the wergild of its breaking it, being one hundred and sixty Dinars; and wergild of its exposure is one-quarter of the wergild of its breaking, being fifty Dinars; and wergild of the displacement of its bones is one hundred and seventy-five Dinars, from it the wergild of its breaking is one hundred Dinars, and regarding the displacement of its bone is fifty Dinars, and regarding its exposure is twenty-five Dinars; and regarding bruising in it which does not get cured, is thirty-three Dinars and one-third of a Dinar; and regarding it’s piercing is one-quarter of the wergild of its breaking, being fifty Dinars; and wergild of its bruising is one-quarter of the wergild of its breaking, being fifty Dinars. So if it is bruised and becomes defective, so regarding it is one-third of the wergild of the soul, being three hundred and thirty-three Dinars and one-third of a Dinar. So if it was disjointed, so regarding it is three parts from the break, being thirty Dinars. "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "السَّاقُ "
        ],
        "translations": {
          "en.hubeali": [
            "The leg"
          ]
        }
      },
      {
        "index": 14219,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:25",
        "text": [
          "وَ فِي السَّاقِ إِذَا كُسِرَتْ فَجُبِرَتْ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ خُمُسُ دِيَةِ الرِّجْلِ مِائَتَا دِينَارٍ وَ دِيَةُ صَدْعِهَا أَرْبَعَةُ أَخْمَاسِ دِيَةِ كَسْرِهَا مِائَةٌ وَ سِتُّونَ دِينَاراً وَ فِي مُوضِحَتِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسُونَ دِينَاراً وَ فِي نَقْبِهَا نِصْفُ دِيَةِ مُوضِحَتِهَا خَمْسَةٌ وَ عِشْرُونَ دِينَاراً وَ فِي نَقْلِ عِظَامِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسُونَ دِينَاراً وَ فِي نُفُوذِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسُونَ دِينَاراً وَ فِي قَرْحَةٍ فِيهَا لَا تَبْرَأُ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ فَإِنْ عَثَمَ السَّاقُ فَدِيَتُهَا ثُلُثُ دِيَةِ النَّفْسِ ثَلَاثُمِائَةٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the leg, when it breaks, so it is bandaged upon and there is no fault, is one-fifth of the wergild of the leg, being two hundred Dinars; and wergild of its fracture is four-fifths of the wergild of its breaking, being one hundred and sixty Dinars; and regarding its exposure is one-quarter of the wergild of its breaking, being fifty Dinars; and regarding its piercing is half the wergild of its exposure, being twenty-five Dinars; and regarding the displacement of its bone is one-quarter of the wergild of its breaking, being fifty Dinars; and regarding its piercing is one-quarter of the wergild of its breaking, being fifty Dinars; and regarding a bruising in it which does not get cured is thirty-three Dinars and one-third of a Dinar. So if the leg becomes defective, so its wergild is one-third of the wergild of the soul, being three hundred and thirty-three Dinars and one-third of a Dinar."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْكَعْبُ "
        ],
        "translations": {
          "en.hubeali": [
            "The heel"
          ]
        }
      },
      {
        "index": 14220,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:26",
        "text": [
          "وَ فِي الْكَعْبِ إِذَا رُضَّ فَجُبِرَ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ ثُلُثُ دِيَةِ الرِّجْلِ ثَلَاثُمِائَةٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the heel when it is bruised, so it is bandaged upon and there is no fault, is one-third of the wergild of the leg, being three hundred and thirty-three Dinars and one-third of a Dinar."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْقَدَمُ "
        ],
        "translations": {
          "en.hubeali": [
            "The foot"
          ]
        }
      },
      {
        "index": 14221,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:27",
        "text": [
          "وَ فِي الْقَدَمِ إِذَا كُسِرَتْ فَجُبِرَتْ عَلَى غَيْرِ عَثْمٍ وَ لَا عَيْبٍ خُمُسُ دِيَةِ الرِّجْلِ مِائَتَا دِينَارٍ وَ دِيَةُ مُوضِحَتِهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسُونَ دِينَاراً وَ فِي نَقْلِ عِظَامِهَا مِائَةُ دِينَارٍ نِصْفُ دِيَةِ كَسْرِهَا وَ فِي نَافِذَةٍ فِيهَا لَا تَنْسَدُّ خُمُسُ دِيَةِ الرِّجْلِ مِائَتَا دِينَارٍ وَ فِي نَاقِبَةٍ فِيهَا رُبُعُ دِيَةِ كَسْرِهَا خَمْسُونَ دِينَاراً ."
        ],
        "translations": {
          "en.hubeali": [
            "And regarding the foot, when it beaks, so it is bandaged upon without defect and there is no fault, is one-fifth of the wergild of the leg, being two hundred Dinars; and wergild of its exposure is one-quarter of the wergild of its breaking, being fifty Dinars; and regarding the displacement of its bone is one hundred Dinars, half the wergild of breaking it; and regarding the piercing in it which does not get filled, is one-fifth of the wergild of the leg, being two hundred Dinars; and regarding a bruising in it is one-quarter of the wergild of its breaking, being fifty Dinars."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "الْأَصَابِعُ وَ الْقَصَبُ "
        ],
        "translations": {
          "en.hubeali": [
            "The toes and the (foot) bones"
          ]
        }
      },
      {
        "index": 14222,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:28",
        "text": [
          "الَّتِي فِي الْقَدَمِ وَ الْإِبْهَامِ دِيَةُ الْإِبْهَامِ ثُلُثُ دِيَةِ الرِّجْلِ ثَلَاثُمِائَةٍ وَ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ دِيَةُ كَسْرِ قَصَبَةِ الْإِبْهَامِ الَّتِي تَلِي الْقَدَمَ خُمُسُ دِيَةِ الْإِبْهَامِ سِتَّةٌ وَ سِتُّونَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ فِي نَقْلِ عِظَامِهَا سِتَّةٌ وَ عِشْرُونَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ فِي صَدْعِهَا سِتَّةٌ وَ عِشْرُونَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ فِي مُوضِحَتِهَا ثَمَانِيَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ فِي نَقْبِهَا ثَمَانِيَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ فِي فَكِّهَا عَشَرَةُ دَنَانِيرَ",
          "وَ دِيَةُ الْمَفْصِلِ الْأَعْلَى مِنَ الْإِبْهَامِ وَ هُوَ الثَّانِي الَّذِي فِيهِ الظُّفُرُ سِتَّةَ عَشَرَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ فِي مُوضِحَتِهِ أَرْبَعَةُ دَنَانِيرَ وَ سُدُسٌ وَ فِي نَقْلِ عِظَامِهِ ثَمَانِيَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ فِي نَاقِبَتِهِ أَرْبَعَةُ دَنَانِيرَ وَ سُدُسٌ وَ فِي صَدْعِهَا ثَلَاثَةَ عَشَرَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ فِي فَكِّهَا خَمْسَةُ دَنَانِيرَ وَ فِي ظُفُرِهِ ثَلَاثُونَ دِينَاراً وَ ذَلِكَ لِأَنَّهُ ثُلُثُ دِيَةِ الرِّجْلِ",
          "وَ دِيَةُ الْأَصَابِعِ دِيَةُ كُلِّ إِصْبَعٍ مِنْهَا سُدُسُ دِيَةِ الرِّجْلِ ثَلَاثَةٌ وَ ثَمَانُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ دِيَةُ قَصَبَةِ الْأَصَابِعِ الْأَرْبَعِ سِوَى الْإِبْهَامِ دِيَةُ كُلِّ قَصَبَةٍ مِنْهُنَّ سِتَّةَ عَشَرَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ دِيَةُ مُوضِحَةِ قَصَبَةِ كُلِّ إِصْبَعٍ مِنْهُنَّ أَرْبَعَةُ دَنَانِيرَ وَ سُدُسُ دِينَارٍ وَ دِيَةُ نَقْلِ عَظْمِ كُلِّ قَصَبَةٍ مِنْهُنَّ ثَمَانِيَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ دِيَةُ صَدْعِهَا ثَلَاثَةَ عَشَرَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ دِيَةُ نَقْبِ كُلِّ قَصَبَةٍ مِنْهُنَّ أَرْبَعَةُ دَنَانِيرَ وَ سُدُسُ دِينَارٍ وَ دِيَةُ قَرْحَةٍ لَا تَبْرَأُ فِي الْقَدَمِ ثَلَاثَةٌ وَ ثَلَاثُونَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ دِيَةُ كَسْرِ كُلِّ مَفْصِلٍ مِنَ الْأَصَابِعِ الْأَرْبَعِ الَّتِي تَلِي الْقَدَمَ سِتَّةَ عَشَرَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ دِيَةُ صَدْعِهَا ثَلَاثَةَ عَشَرَ دِينَاراً وَ ثُلُثُ دِينَارٍ وَ دِيَةُ نَقْلِ عِظَامِ كُلِّ قَصَبَةٍ مِنْهُنَّ ثَمَانِيَةُ دَنَانِيرَ وَ ثُلُثُ دِينَارٍ وَ دِيَةُ مُوضِحَةِ كُلِّ قَصَبَةٍ مِنْهُنَّ أَرْبَعَةُ دَنَانِيرَ وَ سُدُسُ دِينَارٍ وَ دِيَةُ نَقْبِهَا أَرْبَعَةُ دَنَانِيرَ وَ سُدُسُ دِينَارٍ وَ دِيَةُ فَكِّهَا خَمْسَةُ دَنَانِيرَ",
          "وَ فِي الْمَفْصِلِ الْأَوْسَطِ مِنَ الْأَصَابِعِ الْأَرْبَعِ إِذَا قُطِعَ فَدِيَتُهُ خَمْسَةٌ وَ خَمْسُونَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ دِيَةُ كَسْرِهِ أَحَدَ عَشَرَ دِينَاراً وَ ثُلُثَا دِينَارٍ وَ دِيَةُ صَدْعِهِ ثَمَانِيَةُ دَنَانِيرَ وَ أَرْبَعَةُ أَخْمَاسِ دِينَارٍ وَ دِيَةُ مُوضِحَتِهِ دِينَارَانِ وَ دِيَةُ نَقْلِ عِظَامِهِ خَمْسَةُ دَنَانِيرَ وَ ثُلُثَا دِينَارٍ وَ دِيَةُ نَقْبِهِ دِينَارَانِ وَ ثُلُثَا دِينَارٍ وَ دِيَةُ فَكِّهِ ثَلَاثَةُ دَنَانِيرَ ",
          "وَ فِي الْمَفْصِلِ الْأَعْلَى مِنَ الْأَصَابِعِ الْأَرْبَعِ الَّتِي فِيهَا الظُّفُرُ إِذَا قُطِعَ فَدِيَتُهُ سَبْعَةٌ وَ عِشْرُونَ دِينَاراً وَ أَرْبَعَةُ أَخْمَاسِ دِينَارٍ وَ دِيَةُ كَسْرِهِ خَمْسَةُ دَنَانِيرَ وَ أَرْبَعَةُ أَخْمَاسِ دِينَارٍ وَ دِيَةُ صَدْعِهِ أَرْبَعَةُ دَنَانِيرَ وَ خُمُسُ دِينَارٍ وَ دِيَةُ مُوضِحَتِهِ دِينَارٌ وَ ثُلُثُ دِينَارٍ وَ دِيَةُ نَقْلِ عِظَامِهِ دِينَارَانِ وَ خُمُسُ دِينَارٍ وَ دِيَةُ نَقْبِهِ دِينَارٌ وَ ثُلُثُ دِينَارٍ وَ دِيَةُ فَكِّهِ دِينَارَانِ وَ أَرْبَعَةُ أَخْمَاسِ دِينَارٍ وَ دِيَةُ كُلِّ ظُفُرٍ عَشَرَةُ دَنَانِيرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "(That) which is in the feet and the big toe – Wergild of the big toe is one-third of the wergild of the leg, being three hundred and thirty-three Dinars and one-third of a Dinar; and wergild of the breaking of the bone of the big toe which emerges from the foot is one-fifth of the wergild of the big toe, being sixty-six Dinars and two-thirds of a Dinar; and regarding the displacement of its bone is twenty-six Dinars and two-third of a Dinar; and regarding its fracture is twenty-six Dinars and two-thirds of a Dinar; and regarding its exposure is eighty Dinars and one-third of a Dinar; and regarding its piercing is eighty Dinars and one-third of a Dinar; and regarding its disjointing is ten Dinars; ",
            "And wergild of the upper joint from the big toe, and it is the second in which is the nail, is sixteen Dinars; and regarding its exposure is four Dinars and one-sixth; and regarding the displacement of its bone is eighty Dinars and one-third of a Dinar; and regarding its piercing is four Dinars and one-sixth; and regarding its fracture is thirteen Dinars and one-third of a Dinar; and regarding its disjointing is five Dinars; and regarding its nail is thirty Dinars, and that is because it is one-third of the wergild of the leg;",
            "And wergild of the toes – wergild of each toe from it is one-sixth of the wergild of the left, being eighty three Dinars and one-third of a Dinar; and wergild of the bones of the four toes are equal to the big toe, the wergild from each toe from these is sixteen Dinars and one-third of a Dinar; and wergild of the exposure of the bone of each of the toe from these is four Dinars and one-sixth of a Dinar; and wergild of the displacement of a bone of each of the bones from these is eighty Dinars and one-third of a Dinar; and wergild of its fracture is thirteen Dinars and two-thirds of a Dinar; and wergild of the piercing of each bone from these is four Dinars and one-sixth of a Dinar; and wergild of a bruise in the foot which does not get cured is thirty-three Dinars and one-third of a Dinar; and wergild for breaking of each joint from the four toes which emerge from the foot is sixteen Dinars and one-third of a Dinar; and wergild for its fracture is thirteen Dinars and one-third of a Dinar; and wergild of the displacement of a bone of each bones from these is eighty Dinars and one-third of a Dinar; and wergild for the exposure of each bone from these is four Dinars and one-sixth of a Dinar; and wergild for its piercing is four Dinars and one-sixth of a Dinar; and wergild for its disjointing is five Dinars; ",
            "And regarding the middle joints from the four toes when it is cut-off, so its wergild is fifty-five Dinars and two-thirds of a Dinar; and wergild of the breaking is eleven Dinars and two-thirds of a Dinar; and wergild of its fracture is eighty Dinars and four-fifths of a Dinar; and wergild of its exposure is two Dinars; and wergild of the displacement of its bone is five Dinars and two-thirds of a Dinar; and wergild of its piercing is two Dinars and two-thirds of a Dinar; and wergild of its disjointing is three Dinars; ",
            "And regarding the upper joint from the four toes in which are the nails, when it is cut-off, so its wergild is twenty-seven Dinars and four-fifths of a Dinar; and wergild of its breaking is five dinars and four-fifths of a Dinar; and wergild of its fracture is four Dinars and a fifth of a Dinar; and wergild of its exposure is a Dinar and one-third of a Dinar; and wergild of the displacement of its bone is two Dinars and one-fifth of a Dinar; and wergild of its piercing is a Dinar and one-third of a Dinar; and wergild of its disjointing is two Dinars and a four-fifths of a Dinar; and wergild of each nail is ten Dinars’."
          ]
        }
      },
      {
        "index": 14223,
        "local_index": 29,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/659",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/660",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2428",
              "text": "مِسْمَعٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ مِسْمَعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:38:29",
        "text": [
          " قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي الظُّفُرِ إِذَا قُلِعَ وَ لَمْ يَنْبُتْ وَ خَرَجَ أَسْوَدَ فَاسِداً عَشَرَةَ دَنَانِيرَ فَإِنْ خَرَجَ أَبْيَضَ فَخَمْسَةُ دَنَانِيرَ .",
          "رَجَعَ إِلَى الْإِسْنَادِ الْأَوَّلِ قَالَ وَ قَضَى فِي مُوضِحَةِ الْأَصَابِعِ ثُلُثَ دِيَةِ الْإِصْبَعِ فَإِنْ أُصِيبَ رَجُلٌ فَأَدِرَ خُصْيَتَاهُ كِلْتَاهُمَا فَدِيَتُهُ أَرْبَعُمِائَةِ دِينَارٍ فَإِنْ فَحِجَ فَلَمْ يَسْتَطِعِ الْمَشْيَ إِلَّا مَشْياً يَسِيراً لَا يَنْفَعُهُ فَدِيَتُهُ أَرْبَعُمِائَةِ أَخْمَاسِ دِيَةِ النَّفْسِ ثَمَانُمِائَةِ دِينَارٍ فَإِنْ أُحْدِبَ مِنْهَا الظَّهْرُ فَحِينَئِذٍ تَمَّتْ دِيَتُهُ أَلْفُ دِينَارٍ وَ الْقَسَامَةُ فِي كُلِّ شَيْ‏ءٍ مِنْ ذَلِكَ سِتَّةُ نَفَرٍ عَلَى مَا بَلَغَتْ دِيَتُهُ وَ دِيَةُ الْبُجْرَةِ إِذَا كَانَتْ فَوْقَ الْعَانَةِ عُشْرُ دِيَةِ النَّفْسِ مِائَةُ دِينَارٍ فَإِنْ كَانَتْ فِي الْعَانَةِ فَخَرَقَتِ الصِّفَاقَ فَصَارَتْ أُدْرَةً فِي إِحْدَى الْبَيْضَتَيْنِ فَدِيَتُهَا مِائَتَا دِينَارٍ خُمُسُ الدِّيَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman Al Asamma, from Misma’a, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding the nails, when it is ripped out and does not grow back, and blackness emerges and it rots, is ten Dinars. So if whiteness emerges, so it is five Dinars’. ",
            "Referring to the first chain, he<sup>asws</sup> said: ‘And he (Amir Al-Momineen<sup>asws</sup>) judged regarding exposure of the toes being one-third of the wergild of the toes. So if a man is hit and both his testicles turn around, so its wergild is four hundred Dinars. So if he has to straddle and is not able to walk except for a simple walk, which is not beneficial to him, so its wergild is four-fifths of the wergild of the soul, being a hundred Dinars. So if he becomes hunch backed from it, so this is where is the complete wergild, being a thousand Dinars; and the sworn endorsements regarding everything from that is six people upon whatever his wergild reaches; and wergild of the rupture above the pubic area is a tenth of the wergild of the soul, being one hundred Dinars. So if it was in the pubic area, so it violates the abdominal membrane, so there occurs a swelling in one of the testicles, so its wergild is two hundred Dinars, being a fifth of the (complete) wergild’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:4:38",
  "kind": "verse_list"
}