{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 39"
        },
        "path": "/books/al-kafi:7:4:39",
        "titles": {
          "ar": "باب دِيَةِ الْجَنِينِ",
          "en": "Chapter 39 – Wergild of the foetus"
        }
      }
    ],
    "index": 2195,
    "local_index": 39,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 40"
        },
        "path": "/books/al-kafi:7:4:40",
        "titles": {
          "ar": "باب الرَّجُلِ يَقْطَعُ رَأْسَ مَيِّتٍ أَوْ يَفْعَلُ بِهِ مَا يَكُونُ فِيهِ اجْتِيَاحُ نَفْسِ الْحَيِّ",
          "en": "Chapter 40 – The man cuts-off the head of a deceased, or does with him what annihilated the self of the live"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 38"
        },
        "path": "/books/al-kafi:7:4:38",
        "titles": {
          "ar": "باب الشَّفَتَيْنِ",
          "en": "Chapter 38 – The two lips"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:4:39",
    "titles": {
      "ar": "باب دِيَةِ الْجَنِينِ",
      "en": "Chapter 39 – Wergild of the foetus"
    },
    "verse_count": 16,
    "verse_start_index": 14223,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 14224,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">و</span>َ بِهَذَا الْإِسْنَادِ</span> عَنْ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ جَعَلَ دِيَةَ الْجَنِينِ مِائَةَ دِينَارٍ وَ جَعَلَ مَنِيَّ الرَّجُلِ إِلَى أَنْ يَكُونَ جَنِيناً خَمْسَةَ أَجْزَاءٍ فَإِذَا كَانَ جَنِيناً قَبْلَ أَنْ تَلِجَهُ الرُّوحُ مِائَةَ دِينَارٍ وَ ذَلِكَ أَنَّ اللَّهَ عَزَّ وَ جَلَّ خَلَقَ الْإِنْسَانَ مِنْ سُلَالَةٍ وَ هِيَ النُّطْفَةُ فَهَذَا جُزْءٌ ثُمَّ عَلَقَةً فَهُوَ جُزْءَانِ ثُمَّ مُضْغَةً فَهُوَ ثَلَاثَةُ أَجْزَاءٍ ثُمَّ عَظْماً فَهُوَ أَرْبَعَةُ أَجْزَاءٍ ثُمَّ يُكْسَى لَحْماً فَحِينَئِذٍ تَمَّ جَنِيناً فَكَمَلَتْ لَهُ خَمْسَةُ أَجْزَاءٍ مِائَةُ دِينَارٍ وَ الْمِائَةُ دِينَارٍ خَمْسَةُ أَجْزَاءٍ فَجَعَلَ لِلنُّطْفَةِ خُمُسَ الْمِائَةِ عِشْرِينَ دِينَاراً وَ لِلْعَلَقَةِ خُمُسَيِ الْمِائَةِ أَرْبَعِينَ دِينَاراً وَ لِلْمُضْغَةِ ثَلَاثَةَ أَخْمَاسِ الْمِائَةِ سِتِّينَ دِينَاراً وَ لِلْعَظْمِ أَرْبَعَةَ أَخْمَاسِ الْمِائَةِ ثَمَانِينَ دِينَاراً فَإِذَا كُسِيَ اللَّحْمَ كَانَتْ لَهُ مِائَةُ دِينَارٍ كَامِلَةً",
          "فَإِذَا نَشَأَ فِيهِ خَلْقٌ آخَرُ وَ هُوَ الرُّوحُ فَهُوَ حِينَئِذٍ نَفْسٌ فِيهِ أَلْفُ دِينَارٍ دِيَةٌ كَامِلَةٌ إِنْ كَانَ ذَكَراً وَ إِنْ كَانَ أُنْثَى فَخَمْسُمِائَةِ دِينَارٍ وَ إِنْ قُتِلَتِ امْرَأَةٌ وَ هِيَ حُبْلَى فَتَمَّ فَلَمْ يَسْقُطْ وَلَدُهَا وَ لَمْ يُعْلَمْ أَ ذَكَرٌ هُوَ أَمْ أُنْثَى وَ لَمْ يُعْلَمْ أَ بَعْدَهَا مَاتَ أَوْ قَبْلَهَا فَدِيَتُهُ نِصْفَانِ نِصْفُ دِيَةِ الذَّكَرِ وَ نِصْفُ دِيَةِ الْأُنْثَى وَ دِيَةُ الْمَرْأَةِ كَامِلَةٌ بَعْدَ ذَلِكَ وَ ذَلِكَ سِتَّةُ أَجْزَاءٍ مِنَ الْجَنِينِ ",
          "وَ أَفْتَى ( عليه السلام ) فِي مَنِيِّ الرَّجُلِ يُفْرِغُ مِنْ عِرْسِهِ فَيَعْزِلُ عَنْهَا الْمَاءَ وَ لَمْ يُرِدْ ذَلِكَ نِصْفَ خُمُسِ الْمِائَةِ عَشَرَةَ دَنَانِيرَ وَ إِذَا أَفْرَغَ فِيهَا عِشْرِينَ دِينَاراً ",
          "وَ قَضَى فِي دِيَةِ جِرَاحِ الْجَنِينِ مِنْ حِسَابِ الْمِائَةِ عَلَى مَا يَكُونُ مِنْ جِرَاحِ الذَّكَرِ وَ الْأُنْثَى الرَّجُلِ وَ الْمَرْأَةِ كَامِلَةً وَ جَعَلَ لَهُ فِي قِصَاصِ جِرَاحَتِهِ وَ مَعْقُلَتِهِ عَلَى قَدْرِ دِيَتِهِ وَ هِيَ مِائَةُ دِينَارٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Amir Al-Momineen<sup>asws</sup> having said: ‘The wergild of the foetus is made to be one hundred Dinars, and the sperm of the man up to the stage it happens to be a foetus is of five segments. So if it was a foetus before the spirit enters into it, is one hundred Dinars, and that is that Allah<sup>azwj</sup> Mighty and Majestic Created the human being from an extract, and it is the seed. So this is a segment. Then a clot, so it is a segment. Then a lump, so these are three segments. Then bones, so this is a fourth segment. Then flesh grows upon it, so this is where the foetus is complete. So when the five segments are completed for it, it is one hundred Dinars, and the one hundred Dinars is of five segment. So for the seed is made to be one-fifth of the hundred, being twenty Dinars; and for the clot being two-fifths of the hundred, being forty Dinars; and for the lump being three-fifths of the hundred, being sixty Dinars; and for the bones is four-fifths of the hundred, being eighty Dinars. So when the flesh covers it, there would be one hundred Dinars for it, complete.",
            "So when another creation prevails in it, and it is the spirit, so this is where there it is a soul, regarding it is a thousand Dinars complete, if it was a male; and if it was a female, so it is five hundred Dinars. So if a woman is killed, and she is pregnant, so it was complete, but it did not miscarry, and it was not know whether it was a male or a female, and it is not know whether it died after her or before her, so its wergild is in two halves, being half the wergild of the male, and half the wergild of the female, and wergild of the woman is complete after that, and that is of six segments from the foetus.",
            "And he<sup>asws</sup> issued a verdict regarding the seed of the man which flows out from his bride, so the water is isolated from her and that is not returned, being half of the fifth of the hundred, being ten Dinars; and when it is poured from her, being twenty Dinars’.  ",
            "And he<sup>asws</sup> judged regarding wergild of the injuries from the foetus from the accounting of the one hundred based upon what it happens to be, from the injury of the male and the female, the man and the woman (proportion of its completion), and made for it regarding its retaliation of its injuries and its blood relations based upon the measurement of its wergild, and it is one hundred Dinars’."
          ]
        }
      },
      {
        "index": 14225,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ أَوْ غَيْرِهِ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ دِيَةُ الْجَنِينِ خَمْسَةُ أَجْزَاءٍ خُمُسٌ لِلنُّطْفَةِ عِشْرُونَ دِينَاراً وَ لِلْعَلَقَةِ خُمُسَانِ أَرْبَعُونَ دِينَاراً وَ لِلْمُضْغَةِ ثَلَاثَةُ أَخْمَاسٍ سِتُّونَ دِينَاراً وَ لِلْعَظْمِ أَرْبَعَةُ أَخْمَاسٍ ثَمَانُونَ دِينَاراً فَإِذَا تَمَّ الْجَنِينُ كَانَتْ لَهُ مِائَةُ دِينَارٍ فَإِذَا أُنْشِئَ فِيهِ الرُّوحُ فَدِيَتُهُ أَلْفُ دِينَارٍ أَوْ عَشَرَةُ آلَافِ دِرْهَمٍ إِنْ كَانَ ذَكَراً وَ إِنْ كَانَ أُنْثَى فَخَمْسُمِائَةِ دِينَارٍ وَ إِنْ قُتِلَتِ الْمَرْأَةُ وَ هِيَ حُبْلَى فَلَمْ يُدْرَ أَ ذَكَراً كَانَ وَلَدُهَا أَوْ أُنْثَى فَدِيَةُ الْوَلَدِ نِصْفَانِ نِصْفُ دِيَةِ الذَّكَرِ وَ نِصْفُ دِيَةِ الْأُنْثَى وَ دِيَتُهَا كَامِلَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, or someone else, from Ibn Muskan, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘Wergild of the foetus is of five segments, one-fifth for the seed being twenty Dinars; and two-fifths for the clot being forty dinars; and three-fifths for the lump, being sixty Dinars; and four-fifths for the bones, being eighty Dinars. So when the foetus is complete, there would be one-hundred Dinars for it. So when the spirit prevails in it, so its wergild would be a thousand Dinars, or ten thousand Dirhams, if it was a male; and if it was a female, so it would be five hundred Dinars. And if the woman is killed and she is pregnant, so it is not know whether her child was a male of a female, so the wergild of the child is in two halves – half the wergild of the male, and half the wergild of the female, and her wergild would be complete’."
          ]
        }
      },
      {
        "index": 14226,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَتِ امْرَأَةٌ فَاسْتَعْدَتْ عَلَى أَعْرَابِيٍّ قَدْ أَفْزَعَهَا فَأَلْقَتْ جَنِيناً فَقَالَ الْأَعْرَابِيُّ لَمْ يُهِلَّ وَ لَمْ يَصِحْ وَ مِثْلُهُ يُطَلُّ فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) اسْكُتْ سَجَّاعَةُ عَلَيْكَ غُرَّةٌ وَصِيفٌ عَبْدٌ أَوْ أَمَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Abu Hamza, from Dawood Bin Farqad, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘A woman came across a Bedouin who terrified her, so she miscarried a foetus. So the Bedouin said, ‘I neither scared her nor shouted at her, for the like of it to happen’. So the Prophet<sup>saww</sup> said: ‘Be silent! The compensation is upon you for surprising her (and) negligence, a servant (male) or a maid (female) (to serve her for life)’."
          ]
        }
      },
      {
        "index": 14227,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنْ ضَرَبَ رَجُلٌ بَطْنَ امْرَأَةٍ حُبْلَى فَأَلْقَتْ مَا فِي بَطْنِهَا مَيِّتاً فَإِنَّ عَلَيْهِ غُرَّةَ عَبْدٍ أَوْ أَمَةٍ يَدْفَعُهَا إِلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, form Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘If a man were to strike the belly of a woman, so she miscarries whatever was in her belly as dead, so upon him would be the fine of providing a male or a female servant, and (to be) handing over to her’."
          ]
        }
      },
      {
        "index": 14228,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ نُعَيْمِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَيَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ قَتَلَ جَنِينَ أَمَةٍ لِقَوْمٍ فِي بَطْنِهَا فَقَالَ إِنْ كَانَ مَاتَ فِي بَطْنِهَا بَعْدَ مَا ضَرَبَهَا فَعَلَيْهِ نِصْفُ عُشْرِ قِيمَةِ أُمِّهِ وَ إِنْ كَانَ ضَرَبَهَا فَأَلْقَتْهُ حَيّاً فَمَاتَ فَإِنَّ عَلَيْهِ عُشْرَ قِيمَةِ أُمِّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, both together, from Ibn Mahboub, from Nuaym Bin Ibrahim, from Abu Sayyar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who killed a foetus of a slave girl in her belly, (which was) for a people (not belong to him). So he<sup>asws</sup> said: ‘If it died inside her belly after her having been struck, so upon him is half of the price of his slave girl, and if she had been struck, so it was miscarried alive, so it died (afterwards), so upon him is a tenth of the price of his slave girl’."
          ]
        }
      },
      {
        "index": 14229,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:6",
        "text": [
          "ابْنُ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي امْرَأَةٍ شَرِبَتْ دَوَاءً وَ هِيَ حَامِلٌ لِتَطْرَحَ وَلَدَهَا فَأَلْقَتْ وَلَدَهَا فَقَالَ إِنْ كَانَ عَظْماً قَدْ نَبَتَ عَلَيْهِ اللَّحْمُ وَ شُقَّ لَهُ السَّمْعُ وَ الْبَصَرُ فَإِنَّ عَلَيْهَا دِيَتَهُ تُسَلِّمُهَا إِلَى أَبِيهِ قَالَ وَ إِنْ كَانَ جَنِيناً عَلَقَةً أَوْ مُضْغَةً فَإِنَّ عَلَيْهَا أَرْبَعِينَ دِينَاراً أَوْ غُرَّةً تُسَلِّمُهَا إِلَى أَبِيهِ قُلْتُ فَهِيَ لَا تَرِثُ مِنْ وَلَدِهَا مِنْ دِيَتِهِ قَالَ لَا لِأَنَّهَا قَتَلَتْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Ali Bin Raib, from Abu Ubeyda, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a woman who drank medication and she was pregnant, in order to abort her child. So she miscarried her child (as a result). So he<sup>asws</sup> said: ‘If it was bones and flesh had grown upon it, and the hearing and the sight had been pierced for it, so upon her is its wergild to be submitted to its father. And if it was a foetus, either a clot or a lump, so upon her would be forty Dinars, a compensation to be submitted to its father’. I said, ‘So she would not be inheriting from her child, from its wergild?’ He<sup>asws</sup> said: ‘No, because she killed it’."
          ]
        }
      },
      {
        "index": 14230,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَضَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي جَنِينِ الْهِلَالِيَّةِ حَيْثُ رُمِيَتْ بِالْحَجَرِ فَأَلْقَتْ مَا فِي بَطْنِهَا غُرَّةَ عَبْدٍ أَوْ أَمَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> judged regarding a foetus of Al-Hilaliya when she was pelted by a rock, so she miscarried what was in her belly, a compensation of a (male) servant, or a (female) servant’."
          ]
        }
      },
      {
        "index": 14231,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ الرَّجُلُ يَضْرِبُ الْمَرْأَةَ فَتَطْرَحُ النُّطْفَةَ قَالَ عَلَيْهِ عِشْرُونَ دِينَاراً فَإِنْ كَانَتْ عَلَقَةً فَعَلَيْهِ أَرْبَعُونَ دِينَاراً وَ إِنْ كَانَتْ مُضْغَةً فَعَلَيْهِ سِتُّونَ دِينَاراً وَ إِنْ كَانَ عَظْماً فَعَلَيْهِ الدِّيَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdullah Bin Sinan, from man, ",
            "(The narrator) says, ‘I said to Abu Ja’far<sup>asws</sup>, ‘The man strikes a woman, so she dropped the seed’. He<sup>asws</sup> said, ‘Upon him is twenty Dinars. So if it was a clot, so upon him is forty Dinars; and if it was a lump, so upon him is sixty Dinars; and if it was bones, so upon him is the (complete) wergild’."
          ]
        }
      },
      {
        "index": 14232,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ سُلَيْمَانَ بْنِ صَالِحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي النُّطْفَةِ عِشْرُونَ دِينَاراً وَ فِي الْعَلَقَةِ أَرْبَعُونَ دِينَاراً وَ فِي الْمُضْغَةِ سِتُّونَ دِينَاراً وَ فِي الْعَظْمِ ثَمَانُونَ دِينَاراً فَإِذَا كُسِيَ اللَّحْمَ فَمِائَةُ دِينَارٍ ثُمَّ هِيَ دِيَتُهُ حَتَّى يَسْتَهِلَّ فَإِذَا اسْتَهَلَّ فَالدِّيَةُ كَامِلَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Salih Bin Uqba, from Suleyman Bin Salih, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the seed being twenty Dinars, and regarding the clot being forty Dinars, and regarding the lump being sixty Dinars, and regarding the bones being eighty Dinars. So when the flesh covers it, so it is a hundred Dinars. Then it is its wergild until it commences (living). So when it commences, so it is the complete wergild (a thousand Dinars)’."
          ]
        }
      },
      {
        "index": 14233,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الرَّجُلِ يَضْرِبُ الْمَرْأَةَ فَتَطْرَحُ النُّطْفَةَ فَقَالَ عَلَيْهِ عِشْرُونَ دِينَاراً فَقُلْتُ يَضْرِبُهَا فَتَطْرَحُ الْعَلَقَةَ فَقَالَ عَلَيْهِ أَرْبَعُونَ دِينَاراً قُلْتُ فَيَضْرِبُهَا فَتَطْرَحُ الْمُضْغَةَ قَالَ عَلَيْهِ سِتُّونَ دِينَاراً قُلْتُ فَيَضْرِبُهَا فَتَطْرَحُهُ وَ قَدْ صَارَ لَهُ عَظْمٌ فَقَالَ عَلَيْهِ الدِّيَةُ كَامِلَةً وَ بِهَذَا قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) ",
          "قُلْتُ فَمَا صِفَةُ خِلْقَةِ النُّطْفَةِ الَّتِي تُعْرَفُ بِهَا فَقَالَ النُّطْفَةُ تَكُونُ بَيْضَاءَ مِثْلَ النُّخَامَةِ الْغَلِيظَةِ فَتَمْكُثُ فِي الرَّحِمِ إِذَا صَارَتْ فِيهِ أَرْبَعِينَ يَوْماً ثُمَّ تَصِيرُ إِلَى عَلَقَةٍ قُلْتُ فَمَا صِفَةُ خِلْقَةِ الْعَلَقَةِ الَّتِي تُعْرَفُ بِهَا فَقَالَ هِيَ عَلَقَةٌ كَعَلَقَةِ الدَّمِ الْمِحْجَمَةِ الْجَامِدَةِ تَمْكُثُ فِي الرَّحِمِ بَعْدَ تَحْوِيلِهَا عَنِ النُّطْفَةِ أَرْبَعِينَ يَوْماً ثُمَّ تَصِيرُ مُضْغَةً ",
          "قُلْتُ فَمَا صِفَةُ الْمُضْغَةِ وَ خِلْقَتِهَا الَّتِي تُعْرَفُ بِهَا قَالَ هِيَ مُضْغَةُ لَحْمٍ حَمْرَاءُ فِيهَا عُرُوقٌ خُضْرٌ مُشْتَبِكَةٌ ثُمَّ تَصِيرُ إِلَى عَظْمٍ قُلْتُ فَمَا صِفَةُ خِلْقَتِهِ إِذَا كَانَ عَظْماً فَقَالَ إِذَا كَانَ عَظْماً شُقَّ لَهُ السَّمْعُ وَ الْبَصَرُ وَ رُتِّبَتْ جَوَارِحُهُ فَإِذَا كَانَ كَذَلِكَ فَإِنَّ فِيهِ الدِّيَةَ كَامِلَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Abu Ayoub Al Khazaz, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the man who struck the woman, so she dropped the seed. So he<sup>asws</sup> said: ‘Upon him is twenty Dinars’. So I said, ‘He hits her and she drops the clot?’ So he<sup>asws</sup> said: ‘Upon him is forty Dinars’. I said, ‘So he hits her, and she drops the lump?’ He<sup>asws</sup> said: ‘Upon his is sixty Dinars’. I said, ‘So he hits her, she drops it, and bones had occurred upon it?’ So he<sup>asws</sup> said: ‘Upon him is the complete wergild, and it is by this that Amir Al-Momineen<sup>asws</sup> judged’. ",
            "I said, ‘So what is the description of the creation of the seed which it is recognised by?’ So he<sup>asws</sup> said: ‘The seed happens to be white, like the thick phlegm. So it remains in the womb. When forty days pass over it, then it becomes a clot’. I said, ‘So what is the description of the creation of the clot which it is recognised by?’ So he<sup>asws</sup> said: ‘It is a clot like the clot of the coagulated blood, solidified, remaining in the womb after its conversion from the seed, for forty days, then it becomes a lump’. ",
            "I said, ‘So what is the description of the lump and its creation which it is recognised by?’ He<sup>asws</sup> said: ‘It is a lump of red flesh in which are green veins, entangled. Then it becomes bones’. I said, ‘So what is the description of its creation when it was bones?’ So he<sup>asws</sup> said: ‘When it was bones, there are formed limbs for it, the hearing, and the sight, and arrangement of its limbs. So when it was like that, so regarding it is the complete wergild’."
          ]
        }
      },
      {
        "index": 14234,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:11",
        "text": [
          "صَالِحُ بْنُ عُقْبَةَ عَنْ يُونُسَ الشَّيْبَانِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَإِنْ خَرَجَ فِي النُّطْفَةِ قَطْرَةُ دَمٍ قَالَ الْقَطْرَةُ عُشْرُ النُّطْفَةِ فِيهَا اثْنَانِ وَ عِشْرُونَ دِينَاراً قُلْتُ فَإِنْ قَطَرَتْ قَطْرَتَيْنِ قَالَ أَرْبَعَةٌ وَ عِشْرُونَ دِينَاراً قَالَ قُلْتُ فَإِنْ قَطَرَتْ بِثَلَاثٍ قَالَ فَسِتَّةٌ وَ عِشْرُونَ دِينَاراً قُلْتُ فَأَرْبَعٌ قَالَ فَثَمَانِيَةٌ وَ عِشْرُونَ دِينَاراً وَ فِي خَمْسٍ ثَلَاثُونَ دِينَاراً وَ مَا زَادَ عَلَى النِّصْفِ فَعَلَى حِسَابِ ذَلِكَ حَتَّى تَصِيرَ عَلَقَةً فَإِذَا صَارَتْ عَلَقَةً فَفِيهَا أَرْبَعُونَ ",
          "فَقَالَ لَهُ أَبُو شِبْلٍ وَ أَخْبَرَنَا أَبُو شِبْلٍ قَالَ حَضَرْتُ يُونُسَ وَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يُخْبِرُهُ بِالدِّيَاتِ قَالَ قُلْتُ فَإِنَّ النُّطْفَةَ خَرَجَتْ مُتَحَصْحِصَةً بِالدَّمِ قَالَ فَقَالَ لِي فَقَدْ عَلِقَتْ إِنْ كَانَ دَماً صَافِياً فَفِيهَا أَرْبَعُونَ دِينَاراً وَ إِنْ كَانَ دَماً أَسْوَدَ فَلَا شَيْ‏ءَ عَلَيْهِ إِلَّا التَّعْزِيرَ لِأَنَّهُ مَا كَانَ مِنْ دَمٍ صَافٍ فَذَلِكَ لِلْوَلَدِ وَ مَا كَانَ مِنْ دَمٍ أَسْوَدَ فَذَلِكَ مِنَ الْجَوْفِ ",
          "قَالَ أَبُو شِبْلٍ فَإِنَّ الْعَلَقَةَ صَارَ فِيهَا شِبْهُ الْعِرْقِ مِنْ لَحْمٍ قَالَ اثْنَانِ وَ أَرْبَعُونَ الْعُشْرُ قَالَ قُلْتُ فَإِنَّ عُشْرَ الْأَرْبَعِينَ أَرْبَعَةٌ فَقَالَ لَا إِنَّمَا هُوَ عُشْرُ الْمُضْغَةِ لِأَنَّهُ إِنَّمَا ذَهَبَ عُشْرُهَا فَكُلَّمَا زَادَتْ زِيدَ حَتَّى تَبْلُغَ السِّتِّينَ قَالَ قُلْتُ فَإِنْ رَأَيْتُ فِي الْمُضْغَةِ شِبْهَ الْعُقْدَةِ عَظْماً يَابِساً قَالَ فَذَلِكَ عَظْمٌ كَذَلِكَ أَوَّلُ مَا يَبْتَدِئُ الْعَظْمُ فَيَبْتَدِئُ بِخَمْسَةِ أَشْهُرٍ فَفِيهِ أَرْبَعَةُ دَنَانِيرَ فَإِنْ زَادَ فَزِدْ أَرْبَعَةً أَرْبَعَةً حَتَّى يُتِمَّ الثَّمَانِينَ ",
          "قَالَ قُلْتُ وَ كَذَلِكَ إِذَا كُسِيَ الْعَظْمُ لَحْماً قَالَ ( عليه السلام ) كَذَلِكَ قُلْتُ فَإِذَا وَكَزَهَا فَسَقَطَ الصَّبِيُّ وَ لَا يُدْرَى أَ حَيٌّ كَانَ أَمْ لَا قَالَ هَيْهَاتَ يَا أَبَا شِبْلٍ إِذَا مَضَتِ الْخَمْسَةُ الْأَشْهُرِ فَقَدْ صَارَتْ فِيهِ الْحَيَاةُ وَ قَدِ اسْتَوْجَبَ الدِّيَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Salih Bin Uqba, from Yunus Al Shaybani who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Suppose a drop of blood comes out in the seed?’ He<sup>asws</sup> said: ‘The drop is a tenth of the seed, regarding it is twenty two Dinars’. I said, ‘So if the drop are two drops?’ He<sup>asws</sup> said: ‘Twenty four Dinars’. I said, ‘So if there are three drops?’ He<sup>asws</sup> said: ‘Twenty-six Dinars’. I said, ‘So, four?’ He<sup>asws</sup> said: ‘Twenty-eight Dinars; and regarding five is thirty Dinars; and whatever increases upon the half. So it would be based upon the accounting of that until it becomes a clot. So when it becomes a clot, so with regards to it is forty (Dinars)’. ",
            "So Abu Shibl asked him<sup>asws</sup>, and Abu Shibl informed us saying, ‘Yunus was present and Abu Abdullah<sup>asws</sup> informed him with the wergilds. I said, ‘So if the seed comes out submerged in the blood?’ So he<sup>asws</sup> said to me: ‘So it has clotted, if it was clear blood. Therefore with regards to it is forty Dinars; and if it was black blood, so there is nothing upon it except for the reprimanding, because whatever was from clear blood, so that is for the child, and whatever was from the black blood, so that is from the inside’. ",
            "Abu Shibl said, ‘So if the clot is such that there happen to be in it resembling the veins from the flesh?’ He<sup>asws</sup> said: ‘Forty-two and the one-tenth’. I said, ‘So if the tenth is forty-four?’ So he<sup>asws</sup> said: ‘No! But rather, it is a tenth of the lump, because its one-tenth has gone. So whatever is increased, it increased until it reaches the sixty’. I said, ‘So what is your<sup>asws</sup> view regarding the lump with nodes resembling the dry bones?’ He<sup>asws</sup> said: ‘So that is the bone. It is like that in the beginning, what is the beginning of (the formation of) the bones, by five months. Therefore, with regards to it is forty Dinars. So if it is additional, so it increases by four, four, until it is completed at eighty’. ",
            "I said, ‘And similar to that when the bones attain flesh?’ He<sup>asws</sup> said: ‘It is like that’. I said, ‘So when she is punched (in the belly) and the child is dropped, and it is not known whether it was alive, or not?’ He<sup>asws</sup> said: ‘Far be it! O Abu Shibl, when five months elapse, so the life has come into it, and the wergild is Obligated’."
          ]
        }
      },
      {
        "index": 14235,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:12",
        "text": [
          "صَالِحُ بْنُ عُقْبَةَ عَنْ يُونُسَ الشَّيْبَانِيِّ قَالَ حَضَرْتُ أَنَا وَ أَبُو شِبْلٍ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلْتُهُ عَنْ هَذِهِ الْمَسَائِلِ فِي الدِّيَاتِ ثُمَّ سَأَلَ أَبُو شِبْلٍ وَ كَانَ أَشَدَّ مُبَالَغَةً فَخَلَّيْتُهُ حَتَّى اسْتَنْظَفَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Salih Bin Iqba, from Yunus Al Shaybani who said, ",
            "‘I and Abu Shibl were present in the presence of Abu Abdullah<sup>asws</sup>, so I asked him<sup>asws</sup> about these questions regarding the wergild. The Abu Shibl asked, and he was speaking intensely about it. So I left him until he grasped it’."
          ]
        }
      },
      {
        "index": 14236,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:13",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الْغُرَّةَ تَكُونُ بِثَمَانِيَةِ دَنَانِيرَ وَ تَكُونُ بِعَشَرَةِ دَنَانِيرَ فَقَالَ بِخَمْسِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Ubeyd Bin Zurara who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The commencement (of the foetus) happens with eight Dinars, and happens with ten Dinars?’ So he<sup>asws</sup> said: ‘By fifty’."
          ]
        }
      },
      {
        "index": 14237,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:14",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ ضَرَبَ ابْنَتَهُ وَ هِيَ حُبْلَى فَأَسْقَطَتْ سِقْطاً مَيِّتاً فَاسْتَعْدَى زَوْجُ الْمَرْأَةِ عَلَيْهِ فَقَالَتِ الْمَرْأَةُ لِزَوْجِهَا إِنْ كَانَ لِهَذَا السِّقْطِ دِيَةٌ وَ لِي فِيهِ مِيرَاثٌ فَإِنَّ مِيرَاثِي مِنْهُ لِأَبِي فَقَالَ يَجُوزُ لِأَبِيهَا مَا وَهَبَتْ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at, ",
            "(The narrator) says, ‘I asked Abu Abdullah<sup>asws</sup> about a man who struck his daughter, and she was pregnant. So she dropped a dead (foetus). So the husband of the woman antagonised against him. So the woman said to her husband, ‘If there was a wergild for this aborted (foetus), and for me with regards to it is inheritance, so my inheritance from it is for my father’. So he<sup>asws</sup> said: ‘It is allowed for her father whatever she gifts for him’."
          ]
        }
      },
      {
        "index": 14238,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:15",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ سَأَلْتُ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) عَنْ رَجُلٍ ضَرَبَ امْرَأَةً حَامِلًا بِرِجْلِهِ فَطَرَحَتْ مَا فِي بَطْنِهَا مَيِّتاً فَقَالَ إِنْ كَانَ نُطْفَةً فَإِنَّ عَلَيْهِ عِشْرِينَ دِينَاراً قُلْتُ فَمَا حَدُّ النُّطْفَةِ فَقَالَ هِيَ الَّتِي إِذَا وَقَعَتْ فِي الرَّحِمِ فَاسْتَقَرَّتْ فِيهِ أَرْبَعِينَ يَوْماً ",
          "قَالَ وَ إِنْ طَرَحَتْهُ وَ هُوَ عَلَقَةٌ فَإِنَّ عَلَيْهِ أَرْبَعِينَ دِينَاراً قُلْتُ فَمَا حَدُّ الْعَلَقَةِ فَقَالَ هِيَ الَّتِي إِذَا وَقَعَتْ فِي الرَّحِمِ فَاسْتَقَرَّتْ فِيهِ ثَمَانِينَ يَوْماً ",
          "قَالَ وَ إِنْ طَرَحَتْهُ وَ هُوَ مُضْغَةٌ فَإِنَّ عَلَيْهِ سِتِّينَ دِينَاراً قُلْتُ فَمَا حَدُّ الْمُضْغَةِ فَقَالَ هِيَ الَّتِي إِذَا وَقَعَتْ فِي الرَّحِمِ فَاسْتَقَرَّتْ فِيهِ مِائَةً وَ عِشْرِينَ يَوْماً ",
          "قَالَ وَ إِنْ طَرَحَتْهُ وَ هُوَ نَسَمَةٌ مُخَلَّقَةٌ لَهُ عَظْمٌ وَ لَحْمٌ مُزَيَّلَ الْجَوَارِحِ قَدْ نُفِخَ فِيهِ رُوحُ الْعَقْلِ فَإِنَّ عَلَيْهِ دِيَةً كَامِلَةً قُلْتُ لَهُ أَ رَأَيْتَ تَحَوُّلَهُ فِي بَطْنِهَا إِلَى حَالٍ أَ بِرُوحٍ كَانَ ذَلِكَ أَوْ بِغَيْرِ رُوحٍ قَالَ بِرُوحٍ عَدَا الْحَيَاةِ الْقَدِيمِ الْمَنْقُولِ فِي أَصْلَابِ الرِّجَالِ وَ أَرْحَامِ النِّسَاءِ وَ لَوْ لَا أَنَّهُ كَانَ فِيهِ رُوحٌ عَدَا الْحَيَاةِ مَا تَحَوَّلَ عَنْ حَالٍ بَعْدَ حَالٍ فِي الرَّحِمِ وَ مَا كَانَ إِذاً عَلَى مَنْ يَقْتُلُهُ دِيَةٌ وَ هُوَ فِي تِلْكَ الْحَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboun, from Abdullah Bin Ghalib, from his father, from Saeed Bin Al Musayyab who said, ",
            "‘I asked Ali Bin Al-Husayn<sup>asws</sup> about a man who struck a pregnant woman by his leg, so she dropped what was in her belly, as dead’. So he<sup>asws</sup> said: ‘So if it was seed, so upon is twenty Dinars’. I said, ‘So what is the limit for the seed?’ So he<sup>asws</sup> said: ‘It is which, when it fall in the womb, so it rests in it for forty days’. ",
            "He<sup>asws</sup> said: ‘And if she dropped it and it was a clot, so upon him is forty Dinars’. I said, ‘So what is the limit of the clot?’ So he<sup>asws</sup> said: ‘It is which, when it falls in the womb, so it settles in it for eighty days’. ",
            "He<sup>asws</sup> said: ‘And if she dropped it, and it was a lump, so upon him is sixty Dinars’. I said, ‘So what is the limit of the lump?’ So he<sup>asws</sup> said: ‘it is which, when it falls in the womb, so it settles in it for one hundred and twenty days’. ",
            "He<sup>asws</sup> said: ‘And if she dropped it, and it is a person for whom is Created the bones, and the flesh, distinguishable limbs, and there has been Blown into it the spirit of the intellect, so upon him is the complete wergild’. I said to him<sup>asws</sup>, ‘So what is your<sup>asws</sup> view if it is transforming in her belly to a state, would it be with a sprit, or without a spirit?’ He<sup>asws</sup> said: ‘With a spirit except for the old life which gets transferred in the loins of the men and the wombs of the women. And if it were not so that there was spirit in it except for the life, it would not have converted from a state after a state, in the womb, and there would not have been a wergild upon the one who kills it, and it would be in that state’."
          ]
        }
      },
      {
        "index": 14239,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:39:16",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْغُرَّةَ تَزِيدُ وَ تَنْقُصُ وَ لَكِنْ قِيمَتُهَا أَرْبَعُونَ دِينَاراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Is’haq Bin Ammar, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘The commencement of the foetus increases and (sometimes) it is deficient, but its value is forty Dinars’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:4:39",
  "kind": "verse_list"
}