{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 40"
        },
        "path": "/books/al-kafi:7:4:40",
        "titles": {
          "ar": "باب الرَّجُلِ يَقْطَعُ رَأْسَ مَيِّتٍ أَوْ يَفْعَلُ بِهِ مَا يَكُونُ فِيهِ اجْتِيَاحُ نَفْسِ الْحَيِّ",
          "en": "Chapter 40 – The man cuts-off the head of a deceased, or does with him what annihilated the self of the live"
        }
      }
    ],
    "index": 2196,
    "local_index": 40,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 41"
        },
        "path": "/books/al-kafi:7:4:41",
        "titles": {
          "ar": "باب مَا يَلْزَمُ مَنْ يَحْفِرُ الْبِئْرَ فَيَقَعُ فِيهَا الْمَارُّ",
          "en": "Chapter 41 – What necessitates the one who digs the well, so there falls in it the passer-by"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 39"
        },
        "path": "/books/al-kafi:7:4:39",
        "titles": {
          "ar": "باب دِيَةِ الْجَنِينِ",
          "en": "Chapter 39 – Wergild of the foetus"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:4:40",
    "titles": {
      "ar": "باب الرَّجُلِ يَقْطَعُ رَأْسَ مَيِّتٍ أَوْ يَفْعَلُ بِهِ مَا يَكُونُ فِيهِ اجْتِيَاحُ نَفْسِ الْحَيِّ",
      "en": "Chapter 40 – The man cuts-off the head of a deceased, or does with him what annihilated the self of the live"
    },
    "verse_count": 4,
    "verse_start_index": 14239,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 14240,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1825",
              "text": "الْحُسَيْنِ بْنِ مُوسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3587",
              "text": "مُحَمَّدِ بْنِ الصَّبَّاحِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحُسَيْنِ بْنِ مُوسَى عَنْ مُحَمَّدِ بْنِ الصَّبَّاحِ عَنْ بَعْضِ أَصْحَابِنَا قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:40:1",
        "text": [
          " أَتَى الرَّبِيعُ أَبَا جَعْفَرٍ الْمَنْصُورَ وَ هُوَ خَلِيفَةٌ فِي الطَّوَافِ فَقَالَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ مَاتَ فُلَانٌ مَوْلَاكَ الْبَارِحَةَ فَقَطَعَ فُلَانٌ مَوْلَاكَ رَأْسَهُ بَعْدَ مَوْتِهِ قَالَ فَاسْتَشَاطَ وَ غَضِبَ قَالَ فَقَالَ لِابْنِ شُبْرُمَةَ وَ ابْنِ أَبِي لَيْلَى وَ عِدَّةٍ مَعَهُ مِنَ الْقُضَاةِ وَ الْفُقَهَاءِ مَا تَقُولُونَ فِي هَذَا فَكُلٌّ قَالَ مَا عِنْدَنَا فِي هَذَا شَيْ‏ءٌ قَالَ فَجَعَلَ يُرَدِّدُ الْمَسْأَلَةَ فِي هَذَا وَ يَقُولُ أَقْتُلُهُ أَمْ لَا فَقَالُوا مَا عِنْدَنَا فِي هَذَا شَيْ‏ءٌ",
          "قَالَ فَقَالَ لَهُ بَعْضُهُمْ قَدْ قَدِمَ رَجُلٌ السَّاعَةَ فَإِنْ كَانَ عِنْدَ أَحَدٍ شَيْ‏ءٌ فَعِنْدَهُ الْجَوَابُ فِي هَذَا وَ هُوَ جَعْفَرُ بْنُ مُحَمَّدٍ وَ قَدْ دَخَلَ الْمَسْعَى فَقَالَ لِلرَّبِيعِ اذْهَبْ إِلَيْهِ فَقُلْ لَهُ لَوْ لَا مَعْرِفَتُنَا بِشُغُلِ مَا أَنْتَ فِيهِ لَسَأَلْنَاكَ أَنْ تَأْتِيَنَا وَ لَكِنْ أَجِبْنَا فِي كَذَا وَ كَذَا",
          "قَالَ فَأَتَاهُ الرَّبِيعُ وَ هُوَ عَلَى الْمَرْوَةِ فَأَبْلَغَهُ الرِّسَالَةَ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَدْ تَرَى شُغُلَ مَا أَنَا فِيهِ وَ قِبَلَكَ الْفُقَهَاءُ وَ الْعُلَمَاءُ فَسَلْهُمْ قَالَ فَقَالَ لَهُ قَدْ سَأَلَهُمْ وَ لَمْ يَكُنْ عِنْدَهُمْ فِيهِ شَيْ‏ءٌ قَالَ فَرَدَّهُ إِلَيْهِ فَقَالَ أَسْأَلُكَ إِلَّا أَجَبْتَنَا فِيهِ فَلَيْسَ عِنْدَ الْقَوْمِ فِي هَذَا شَيْ‏ءٌ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) حَتَّى أَفْرُغَ مِمَّا أَنَا فِيهِ",
          "قَالَ فَلَمَّا فَرَغَ جَاءَ فَجَلَسَ فِي جَانِبِ الْمَسْجِدِ الْحَرَامِ فَقَالَ لِلرَّبِيعِ اذْهَبْ فَقُلْ لَهُ عَلَيْهِ مِائَةُ دِينَارٍ قَالَ فَأَبْلَغَهُ ذَلِكَ فَقَالُوا لَهُ فَسَلْهُ كَيْفَ صَارَ عَلَيْهِ مِائَةُ دِينَارٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فِي النُّطْفَةِ عِشْرُونَ وَ فِي الْعَلَقَةِ عِشْرُونَ وَ فِي الْمُضْغَةِ عِشْرُونَ وَ فِي الْعَظْمِ عِشْرُونَ وَ فِي اللَّحْمِ عِشْرُونَ ثُمَّ أَنْشَأْنَاهُ خَلْقاً آخَرَ وَ هَذَا هُوَ مَيِّتٌ بِمَنْزِلَتِهِ قَبْلَ أَنْ يُنْفَخَ فِيهِ الرُّوحُ فِي بَطْنِ أُمِّهِ جَنِيناً",
          "قَالَ فَرَجَعَ إِلَيْهِ فَأَخْبَرَهُ بِالْجَوَابِ فَأَعْجَبَهُمْ ذَلِكَ وَ قَالُوا ارْجِعْ إِلَيْهِ فَسَلْهُ الدَّنَانِيرَ لِمَنْ هِيَ لِوَرَثَتِهِ أَمْ لَا فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَيْسَ لِوَرَثَتِهِ فِيهَا شَيْ‏ءٌ إِنَّمَا هَذَا شَيْ‏ءٌ أُتِيَ إِلَيْهِ فِي بَدَنِهِ بَعْدَ مَوْتِهِ يُحَجُّ بِهَا عَنْهُ أَوْ يُتَصَدَّقُ بِهَا عَنْهُ أَوْ تَصِيرُ فِي سَبِيلٍ مِنْ سُبُلِ الْخَيْرِ ",
          "قَالَ فَزَعَمَ الرَّجُلُ أَنَّهُمْ رَدُّوا الرَّسُولَ إِلَيْهِ فَأَجَابَ فِيهَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بِسِتَّةٍ وَ ثَلَاثِينَ مَسْأَلَةً وَ لَمْ يَحْفَظِ الرَّجُلُ إِلَّا قَدْرَ هَذَا الْجَوَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Husayn Bin Musa, from Muhammad Bin Al Sabbah, from onoe of our companions who said, ",
            "‘Al-Rabie came over to Abu Ja’far Al-Mansour and he was the caliph, during him being in the circumambulation. So he said to him, ‘O commander of the faithful! So and so slave of yours died last night, so and so slave of yours cut-off his head after his death’. So he was fuming and angry, and said to Ibn Shabrama, and Ibn Abu Layli, and a number who were with him, from the judges, ‘What are you all saying regarding this?’ So all of them said, ‘There is nothing with us with regards to this, anything’. So he repeated the question regarding this, and he was saying, ‘Shall I kill him or not?’ So they said, ‘There is nothing with us with regards to this, anything’. ",
            "He (the narrator) said, ‘So, one of them said to him, ‘At the moment a man has set foot here, so if there was anyone who had anything with regards to this, the answer would be with him<sup>asws</sup>, and he<sup>asws</sup> is Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>, and he<sup>asws</sup> has entered into (performance of) <span class=\"iTxt\">Al-Sa’ee</span>’. So he said to Al-Rabie, ‘Go to him<sup>asws</sup>, and say to him<sup>asws</sup>, ‘Had we not know what you<sup>asws</sup> are occupied in, we would have asked you<sup>asws</sup> to come over, but answer us regarding such and such’. ",
            "He (the narrator) said, ‘So Al-Rabie went over, and he<sup>asws</sup> was at Al-Marwa. So he delivered the message to him<sup>asws</sup>. So Abu Abdullah<sup>asws</sup> said to him: ‘You have seen what I<sup>asws</sup> am occupied in, and in front of you are the judges and the scholars, so ask them’. So he said to him<sup>asws</sup>, ‘He has asked them, and there did not happen to with anything with them regarding it’. So he<sup>asws</sup> responded (similarly) to him. So he said, ‘I ask you<sup>asws</sup> only to answer us with regards to it, for there is nothing with the people regarding this’. So Abu Abdullah<sup>asws</sup> said: ‘Until after I<sup>asws</sup> are free from what I<sup>asws</sup> am occupied in (<span class=\"iTxt\">Al-Sa’ee</span>)’. ",
            "He (the narrator) said, ‘So when he<sup>asws</sup> was free, he<sup>asws</sup> came and sat by the side of the Sacred Masjid. He<sup>asws</sup> said to Al-Rabie: ‘Go and say to him, ‘Upon him is (wergild of) one hundred Dinars’. So he delivered that. So they said, ‘Ask him<sup>asws</sup> how it came to be one hundred Dinars upon him’. So Abu Abdullah<sup>asws</sup> said: ‘With regards to the seed is twenty, and regarding the clot is twenty, and regarding the lump is twenty, and regarding the bone is twenty, and regarding the flesh is twenty. The it grows to another creation, and this deceased is at its status, before the spirit has been Blown into it, in the belly of its mother, as a foetus’. ",
            "He (the narrator) said, ‘So he returned to him and informed him of the answer. So that astounded them, and they said, ‘Return to him<sup>asws</sup>, and ask him<sup>asws</sup> about the Dinars, for who it is to be, for his (of the decapitated deceased) inheritors or not?’ So Abu Abdullah<sup>asws</sup> said: ‘There is not for his inheritors, anything. But rather this is a thing which came upon him in his body after his death. It would be (utilised for) performing Hajj on his behalf, or given in charity by it on his behalf, or it would be made to be in a way from the ways of the goodness’. ",
            "He (the narrator) said, ‘The man claimed that the messenger returned (many a time), so Abu Abdullah<sup>asws</sup> answered regarding it with thirty-six questions, and the man did not memorise except to the measurement of this answer’."
          ]
        }
      },
      {
        "index": 14241,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "جَمِيلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2119",
              "text": "غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:40:2",
        "text": [
          "هُ قَالَ قَطْعُ رَأْسِ الْمَيِّتِ أَشَدُّ مِنْ قَطْعِ رَأْسِ الْحَيِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, from someone else from our companions, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘Cutting-off of the head of the deceased is harsher than cutting a head of the living’."
          ]
        }
      },
      {
        "index": 14242,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1148",
              "text": "أَخْبَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:40:3",
        "text": [
          " قُلْتُ رَجُلٌ قَطَعَ رَأْسَ مَيِّتٍ فَقَالَ حُرْمَةُ الْمَيِّتِ كَحُرْمَةِ الْحَيِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad, from Muhammad Bin Sinan, from the one who informed him, ",
            "Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘A man cuts-off the head of a deceased’. So he<sup>asws</sup> said: ‘The sanctity of the dead is like the sanctity of the living’."
          ]
        }
      },
      {
        "index": 14243,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1941",
              "text": "مُحَمَّدِ بْنِ حَفْصٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/78",
              "text": "الْحُسَيْنِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ حَفْصٍ عَنِ الْحُسَيْنِ بْنِ خَالِدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:40:4",
        "text": [
          " سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَطَعَ رَأْسَ رَجُلٍ مَيِّتٍ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ حَرَّمَ مِنْهُ مَيِّتاً كَمَا حَرَّمَ مِنْهُ حَيّاً فَمَنْ فَعَلَ بِمَيِّتٍ فِعْلًا يَكُونُ فِي مِثْلِهِ اجْتِيَاحُ نَفْسِ الْحَيِّ فَعَلَيْهِ الدِّيَةُ ",
          "فَسَأَلْتُ عَنْ ذَلِكَ أَبَا الْحَسَنِ ( عليه السلام ) فَقَالَ صَدَقَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَكَذَا قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قُلْتُ فَمَنْ قَطَعَ رَأْسَ مَيِّتٍ أَوْ شَقَّ بَطْنَهُ أَوْ فَعَلَ بِهِ مَا يَكُونُ فِيهِ اجْتِيَاحُ نَفْسِ الْحَيِّ فَعَلَيْهِ دِيَةُ النَّفْسِ كَامِلَةً فَقَالَ لَا وَ لَكِنْ دِيَتُهُ دِيَةُ الْجَنِينِ فِي بَطْنِ أُمِّهِ قَبْلَ أَنْ تُنْشَأَ فِيهِ الرُّوحُ وَ ذَلِكَ مِائَةُ دِينَارٍ وَ هِيَ لِوَرَثَتِهِ وَ دِيَةُ هَذَا هِيَ لَهُ لَا لِلْوَرَثَةِ ",
          "قُلْتُ فَمَا الْفَرْقُ بَيْنَهُمَا قَالَ إِنَّ الْجَنِينَ أَمْرٌ مُسْتَقْبِلٌ مَرْجُوٌّ نَفْعُهُ وَ هَذَا قَدْ مَضَى وَ ذَهَبَتْ مَنْفَعَتُهُ فَلَمَّا مُثِّلَ بِهِ بَعْدَ مَوْتِهِ صَارَتْ دِيَتُهُ بِتِلْكَ الْمُثْلَةِ لَهُ لَا لِغَيْرِهِ يُحَجُّ بِهَا عَنْهُ وَ يُفْعَلُ بِهَا أَبْوَابُ الْخَيْرِ وَ الْبِرِّ مِنْ صَدَقَةٍ أَوْ غَيْرِهَا ",
          "قُلْتُ فَإِنْ أَرَادَ رَجُلٌ أَنْ يَحْفِرَ لَهُ لِيَغْسِلَهُ فِي الْحُفْرَةِ فَسَدِرَ الرَّجُلُ مِمَّا يَحْفِرُ فَدِيرَ بِهِ فَمَالَتْ مِسْحَاتُهُ فِي يَدِهِ فَأَصَابَ بَطْنَهُ فَشَقَّهُ فَمَا عَلَيْهِ فَقَالَ إِذَا كَانَ هَكَذَا فَهُوَ خَطَأٌ وَ كَفَّارَتُهُ عِتْقُ رَقَبَةٍ أَوْ صِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ أَوْ صَدَقَةٌ عَلَى سِتِّينَ مِسْكِيناً مُدٌّ لِكُلِّ مِسْكِينٍ بِمُدِّ النَّبِيِّ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Muhammad Bin Hafs, from Al Husayn Bin Khalid who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about a man who cut off the head of a dead man. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic has Sanctified from it for a dead just as He<sup>azwj</sup> has Sanctified from it for a living. So the one who deals with a dead with a deed which violates it is similar to violating a living. Thus, upon him would be the wergild’. ",
            "So I asked Abu Al-Hassan<sup>asws</sup> about that, so he<sup>asws</sup> said: ‘Abu Abdullah<sup>asws</sup> spoke truthfully. Such is what Rasool-Allah<sup>saww</sup> said’. I said, ‘So the one who cut of the head of a dead, or pierces his belly, or does with him what happens to be a violation in it of a living soul, so upon him is the complete wergild of the soul?’ So he<sup>asws</sup> said: ‘No, but its wergild is the wergild of the foetus which is in the belly of its mother, before the spirit is Breathed into it, and that is one hundred Dinars, and it is for its (foetus’s) inheritors, while the wergild of this one (deceased), it is for him, not for his inheritors.",
            "I said, ‘So what is the difference between the two?’ He<sup>asws</sup> said: ‘The foetus is a matter of the future, its benefit is hoped for, and this one has passed and its benefit has gone. So when his is tortured with after his death, his wergild comes to be for the torture of his, not for someone else. It (wergild) would be utilised for performing Hajj with it on his behalf, and would be done with it from the doors of goodness and the righteousness, from charity or other than it.’  ",
            "I said, ‘So if a man intends that he digs a grave for him in order to wash him in his grave, so the man shovel from what he digs, and the shovel in his hand touches his belly so it pierces. So what would be upon him?’ So he<sup>asws</sup> said: ‘When it is like that, so it is a mistake, and its expiation is the freeing of a neck, or Fasting for two months consecutively, or charity upon sixty poor ones, a handful (<span class=\"iTxt\">Mudd</span>) for each poor, by a handful (<span class=\"iTxt\">Mudd</span>) of the Prophet<sup>saww</sup>’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:4:40",
  "kind": "verse_list"
}