{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:7:4", "titles": {"ar": "كِتَابُ الدِّيَاتِ", "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"}}, {"indexed_titles": {"en": "Chapter 42"}, "path": "/books/al-kafi:7:4:42", "titles": {"ar": "باب ضَمَانِ مَا يُصِيبُ الدَّوَابُّ وَ مَا لَا ضَمَانَ فِيهِ مِنْ ذَلِكَ", "en": "Chapter 42 – Responsibility of what hits the animals and what is not a responsibility regarding it from that"}}], "index": 2188, "local_index": 42, "part_type": "Chapter", "path": "/books/al-kafi:7:4:42", "titles": {"ar": "باب ضَمَانِ مَا يُصِيبُ الدَّوَابُّ وَ مَا لَا ضَمَانَ فِيهِ مِنْ ذَلِكَ", "en": "Chapter 42 – Responsibility of what hits the animals and what is not a responsibility regarding it from that"}, "verse_count": 15, "verse_start_index": 14240, "verses": [{"index": 14241, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ بَهِيمَةُ الْأَنْعَامِ لَا يَغْرَمُ أَهْلُهَا شَيْئاً مَا دَامَتْ مُرْسَلَةً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from a man, \nAbu Abdullah<sup>asws</sup> has said: ‘The animals, cattle, its owner would not be fined for as long as they are left free to roam’."}]}, {"index": 14242, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:2", "text": "يُونُسُ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْعَلَاءِ بْنِ الْفُضَيْلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنْ رَجُلٍ يَسِيرُ عَلَى طَرِيقٍ مِنْ طُرُقِ الْمُسْلِمِينَ عَلَى دَابَّتِهِ فَتُصِيبُ بِرِجْلِهَا فَقَالَ لَيْسَ عَلَيْهِ مَا أَصَابَتْ بِرِجْلِهَا وَ عَلَيْهِ مَا أَصَابَتْ بِيَدِهَا وَ إِذَا وَقَفَتْ فَعَلَيْهِ مَا أَصَابَتْ بِيَدِهَا وَ رِجْلِهَا وَ إِنْ كَانَ يَسُوقُهَا فَعَلَيْهِ مَا أَصَابَتْ بِيَدِهَا وَ رِجْلِهَا أَيْضاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Yunus, from Muhammad Bin Sinan, from Al A’ala Bin Al Fazl, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> being asked about a man who travelled upon a road from the Muslim roads upon his animal, so it hit someone with its (hind) legs. So he<sup>asws</sup> said: ‘There is nothing upon him what it hits by its (hind) legs, and when he pauses it, so upon him is what it hits by its hands (front legs) and its (hind) legs, and even if he is ushering it, so upon him is what it hits by its hands (front legs) and its (hind) legs, as well’."}]}, {"index": 14243, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنِ الرَّجُلِ يَمُرُّ عَلَى طَرِيقٍ مِنْ طُرُقِ الْمُسْلِمِينَ فَتُصِيبُ دَابَّتُهُ إِنْسَاناً بِرِجْلِهَا فَقَالَ لَيْسَ عَلَيْهِ مَا أَصَابَتْ بِرِجْلِهَا وَ لَكِنْ عَلَيْهِ مَا أَصَابَتْ بِيَدِهَا لِأَنَّ رِجْلَهَا خَلْفَهُ إِنْ رَكِبَ وَ إِنْ كَانَ قَائِدَهَا فَإِنَّهُ يَمْلِكُ بِإِذْنِ اللَّهِ يَدَهَا يَضَعُهَا حَيْثُ يَشَاءُ \nقَالَ وَ سُئِلَ عَنْ بُخْتِيٍّ اغْتَلَمَ فَخَرَجَ مِنَ الدَّارِ فَقَتَلَ رَجُلًا فَجَاءَ أَخُو الرَّجُلِ فَضَرَبَ الْفَحْلَ بِالسَّيْفِ فَعَقَرَهُ فَقَالَ صَاحِبُ الْبُخْتِيِّ ضَامِنٌ لِلدِّيَةِ وَ يَقْبِضُ ثَمَنَ بُخْتِيِّهِ \nوَ عَنِ الرَّجُلِ يُنَفِّرُ بِالرَّجُلِ فَيَعْقِرُهُ وَ تَعْقِرُ دَابَّتُهُ رَجُلًا آخَرَ فَقَالَ هُوَ ضَامِنٌ لِمَا كَانَ مِنْ شَيْ‏ءٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having been asked about the man who passes upon a road from the roads of the Muslim, so his animal hits a human being by its (hind) legs. So he<sup>asws</sup> said: ‘There is nothing upon him what it hit by its (hind) legs, but upon him is what it hits by its hands (front legs), because its (hind) legs are behind him if he is riding, and if he was guiding it, so he was in control of its hands (front legs), by the Permission of Allah<sup>azwj</sup>, to place these wherever he so wishes to’.\nHe (the narrator) said, ‘And he<sup>asws</sup> was asked about a camel in heat, so it went out from the house and killed a man. So a brother of the man came and struck the stallion with the sword and he slew it. So he<sup>asws</sup> said: ‘The owner of the camel is responsible of the wergild and would seize the price of his camel’. \nAnd about the man who caused the man to flee, so another man slew him and his animal. So he<sup>asws</sup> said: ‘He is responsible for whatever was from something’."}]}, {"index": 14244, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ حَمَلَ عَبْدَهُ عَلَى دَابَّةٍ فَوَطِئَتْ رَجُلًا قَالَ الْغُرْمُ عَلَى مَوْلَاهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, both together from Ibn Mahboub, from Ibn Raib, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who carried his slave upon an animal, so it trampled a man. He<sup>asws</sup> said: ‘The fine is upon his master’."}]}, {"index": 14245, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ شَيْخٍ مِنْ أَهْلِ الْكُوفَةِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ قُلْتُ جُعِلْتُ فِدَاكَ رَجُلٌ دَخَلَ دَارَ رَجُلٍ فَوَثَبَ كَلْبٌ عَلَيْهِ فِي الدَّارِ فَعَقَرَهُ فَقَالَ إِنْ كَانَ دُعِيَ فَعَلَى أَهْلِ الدَّارِ أَرْشُ الْخَدْشِ وَ إِنْ كَانَ لَمْ يُدْعَ فَدَخَلَ فَلَا شَيْ‏ءَ عَلَيْهِمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Sheykh from the people of Al Kufa, from one of our companions, \n(The narrator) says, ‘I asked Abu Abdullah<sup>asws</sup> saying, ‘May I be sacrificed for you<sup>asws</sup>! A man enters a house of a man, so a dog leaps upon him in the house, so it injures him’. So he<sup>asws</sup> said: ‘If he was invited, so it is upon the people of the house, the compensation of the scratch; and if he was not invited, so he entered (of his own accord), so there is nothing upon them’."}]}, {"index": 14246, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:6", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِي الْخَزْرَجِ عَنْ مُصْعَبِ بْنِ سَلَّامٍ التَّمِيمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ ( عليه السلام ) أَنَّ ثَوْراً قَتَلَ حِمَاراً عَلَى عَهْدِ النَّبِيِّ ( صلى الله عليه وآله ) فَرُفِعَ ذَلِكَ إِلَيْهِ وَ هُوَ فِي أُنَاسٍ مِنْ أَصْحَابِهِ فِيهِمْ أَبُو بَكْرٍ وَ عُمَرُ فَقَالَ يَا أَبَا بَكْرٍ اقْضِ بَيْنَهُمْ فَقَالَ يَا رَسُولَ اللَّهِ بَهِيمَةٌ قَتَلَتْ بَهِيمَةً مَا عَلَيْهَا شَيْ‏ءٌ فَقَالَ يَا عُمَرُ اقْضِ بَيْنَهُمَا فَقَالَ مِثْلَ قَوْلِ أَبِي بَكْرٍ \nفَقَالَ يَا عَلِيُّ اقْضِ بَيْنَهُمْ فَقَالَ نَعَمْ يَا رَسُولَ اللَّهِ إِنْ كَانَ الثَّوْرُ دَخَلَ عَلَى الْحِمَارِ فِي مُسْتَرَاحِهِ ضَمِنَ أَصْحَابُ الثَّوْرِ وَ إِنْ كَانَ الْحِمَارُ دَخَلَ عَلَى الثَّوْرِ فِي مُسْتَرَاحِهِ فَلَا ضَمَانَ عَلَيْهِمَا \nقَالَ فَرَفَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَدَهُ إِلَى السَّمَاءِ فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ مِنِّي مَنْ يَقْضِي بِقَضَاءِ النَّبِيِّينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Abu Al Khazzaz, from Mos’ab Bin Sallam Al Tameemi, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup>: ‘A bull killed a donkey during the era of the Prophet<sup>saww</sup>, so that (matter) was raised to him<sup>saww</sup>, and he<sup>asws</sup> was among the people from his companions, among whom were Abu Bakr, and Umar. So he<sup>saww</sup> said: ‘O Abu Bakr! Judge between the two’. So he said, ‘O Rasool-Allah<sup>saww</sup>! An animal has killed an animal, there is nothing upon it’. So he<sup>saww</sup> said: ‘O Umar! Judge between the two’. So he spoke similar to the words of Abu Bakr’. \nSo he<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! Judge between the two’. So he<sup>asws</sup> said: ‘Yes, O Rasool-Allah<sup>saww</sup>! If the bull entered upon the donkey in its resting place, the owner of the bull is responsible; and if it was the donkey which had entered upon the bull in its resting place, so there is no one responsible upon the two’. \nHe (the narrator) said, ‘So Rasool-Allah<sup>saww</sup> raised his<sup>saww</sup> hands towards the sky, so he<sup>saww</sup> said: ‘The Praise is for Allah<sup>azwj</sup> Whom Made from me<sup>saww</sup>, one who judges by the judgements of the Prophets<sup>as</sup>’."}]}, {"index": 14247, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:7", "text": "عَنْهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ صَبَّاحٍ الْحَذَّاءِ عَنْ رَجُلٍ عَنْ سَعْدِ بْنِ طَرِيفٍ الْإِسْكَافِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَتَى رَجُلٌ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ إِنَّ ثَوْرَ فُلَانٍ قَتَلَ حِمَارِي فَقَالَ لَهُ النَّبِيُّ ( صلى الله عليه وآله ) ائْتِ أَبَا بَكْرٍ فَسَلْهُ فَأَتَاهُ فَسَأَلَهُ فَقَالَ لَيْسَ عَلَى الْبَهَائِمِ قَوَدٌ فَرَجَعَ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَأَخْبَرَهُ بِمَقَالَةِ أَبِي بَكْرٍ \nفَقَالَ لَهُ النَّبِيُّ ( صلى الله عليه وآله ) ائْتِ عُمَرَ فَسَلْهُ فَأَتَاهُ فَسَأَلَهُ فَقَالَ مِثْلَ مَقَالَةِ أَبِي بَكْرٍ فَرَجَعَ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَأَخْبَرَهُ \nفَقَالَ لَهُ النَّبِيُّ ( صلى الله عليه وآله ) ائْتِ عَلِيّاً ( عليه السلام ) فَسَلْهُ فَأَتَاهُ فَسَأَلَهُ فَقَالَ عَلِيٌّ ( عليه السلام ) إِنْ كَانَ الثَّوْرُ الدَّاخِلَ عَلَى حِمَارِكَ فِي مَنَامِهِ حَتَّى قَتَلَهُ فَصَاحِبُهُ ضَامِنٌ وَ إِنْ كَانَ الْحِمَارُ هُوَ الدَّاخِلَ عَلَى الثَّوْرِ فِي مَنَامِهِ فَلَيْسَ عَلَى صَاحِبِهِ ضَمَانٌ \nقَالَ فَرَجَعَ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَأَخْبَرَهُ فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ مِنْ أَهْلِ بَيْتِي مَنْ يَحْكُمُ بِحُكْمِ الْأَنْبِيَاءِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Abdul Rahman Bin Abu Najran, fromo Sabbah, from a man, from Sa’ad Bin Tareyf Al Iskaaf, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A man came over to Rasool-Allah<sup>saww</sup>, so he said, ‘A bull of so and so killed my donkey!’ So the Prophet<sup>saww</sup> said to him; ‘Go to Abu Bakr, so ask him’. So he went to him, so he said, ‘There is nothing upon the animals’. So he returned to the Prophet<sup>as</sup> and informed him<sup>saww</sup> of the words of Abu Bakr. \nSo the Prophet<sup>saww</sup> said to him: ‘Go to Umar, so ask him’. So he asked him, and he said similar to the words of Abu Bakr. So he returned to the Prophet<sup>saww</sup> and informed him<sup>saww</sup>. \nSo the Prophet<sup>saww</sup> said to him: ‘Go to Ali<sup>asws</sup>, so ask him<sup>asws</sup>’. So he asked him<sup>asws</sup>, so Ali<sup>asws</sup> said: ‘If the bull had entered upon your donkey in his sleeping place until it killed it, so its owner is responsible; but if it was that the donkey was the one who entered upon the bull in his sleeping place, so there is no responsibility upon its owner’. \nHe<sup>asws</sup> said: ‘So he returned to the Prophet<sup>saww</sup> and informed him<sup>saww</sup>. So the Prophet<sup>saww</sup> said: ‘The Praise is for Allah<sup>azwj</sup> Who Made from the People<sup>asws</sup> of my<sup>saww</sup> Household one who judges by the judgements of the Prophets<sup>as</sup>’."}]}, {"index": 14248, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:8", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عُبَيْدِ اللَّهِ الْحَلَبِيِّ عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ بَعَثَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلِيّاً ( عليه السلام ) إِلَى الْيَمَنِ فَأَفْلَتَ فَرَسٌ لِرَجُلٍ مِنْ أَهْلِ الْيَمَنِ وَ مَرَّ يَعْدُو فَمَرَّ بِرَجُلٍ فَنَفَحَهُ بِرِجْلِهِ فَقَتَلَهُ فَجَاءَ أَوْلِيَاءُ الْمَقْتُولِ إِلَى الرَّجُلِ فَأَخَذُوهُ وَ رَفَعُوهُ إِلَى عَلِيٍّ ( عليه السلام ) فَأَقَامَ صَاحِبُ الْفَرَسِ الْبَيِّنَةَ عِنْدَ عَلِيٍّ ( عليه السلام ) أَنَّ فَرَسَهُ أَفْلَتَ مِنْ دَارِهِ وَ نَفَحَ الرَّجُلَ فَأَبْطَلَ عَلِيٌّ ( عليه السلام ) دَمَ صَاحِبِهِمْ \nفَجَاءَ أَوْلِيَاءُ الْمَقْتُولِ مِنَ الْيَمَنِ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّ عَلِيّاً ( عليه السلام ) ظَلَمَنَا وَ أَبْطَلَ صَاحِبَنَا فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ عَلِيّاً ( عليه السلام ) لَيْسَ بِظَلَّامٍ وَ لَمْ يُخْلَقْ لِلظُّلْمِ إِنَّ الْوَلَايَةَ لِعَلِيٍّ ( عليه السلام ) مِنْ بَعْدِي وَ الْحُكْمَ حُكْمُهُ وَ الْقَوْلَ قَوْلُهُ وَ لَا يَرُدُّ وَلَايَتَهُ وَ قَوْلَهُ وَ حُكْمَهُ إِلَّا كَافِرٌ وَ لَا يَرْضَى وَلَايَتَهُ وَ قَوْلَهُ وَ حُكْمَهُ إِلَّا مُؤْمِنٌ \nفَلَمَّا سَمِعَ الْيَمَانِيُّونَ قَوْلَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي عَلِيٍّ ( عليه السلام ) قَالُوا يَا رَسُولَ اللَّهِ رَضِينَا بِحُكْمِ عَلِيٍّ ( عليه السلام ) وَ قَوْلِهِ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) هُوَ تَوْبَتُكُمْ مِمَّا قُلْتُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ubeydullah Al Halby, from a man, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>asws</sup> sent Ali<sup>asws</sup> to Al-Yemen. A horse of a man from the people of Al-Yemen had escaped, and it had passed galloping by a man, and kicked him with its feed, so it had killed him. So the guardians of the killed one went over to the man and seized him, and brought him to Ali<sup>asws</sup>. So the owner of the horse established the evidence in the presence of Ali<sup>asws</sup> that his horse had escaped from his house and kicked the man’. So Ali<sup>asws</sup> invalidated the blood (compensation) of their companion. \nSo the guardians of the killed one came over from Al-Yemen, to Rasool-Allah<sup>asws</sup>, so they said, ‘O Rasool-Allah<sup>asws</sup>! Ali<sup>asws</sup> has been unjust to us and invalidated (the wergild) of our companion’. So Radool-Allah<sup>saww</sup> said: ‘Ali<sup>asws</sup> is not with injustice and had not been Created for the injustice. Verily, the Wilayah is for Ali<sup>asws</sup> from after me<sup>saww</sup>, and the (final) judgement is his<sup>asws</sup> judgement, and the (final) words are his<sup>asws</sup> words, and none would repudiate (deny) his<sup>asws</sup> Wilayah, and his<sup>asws</sup> words, and his<sup>asws</sup> judgement except for an Infidel; and none would be pleased with his<sup>asws</sup> Wilayah, and his<sup>asws</sup> words, and his<sup>asws</sup> judgements except for a Believer’. \nSo when the Yemenis heard the words of Rasool-Allah<sup>saww</sup> regarding Ali<sup>asws</sup>, they said, ‘O Rasool-Allah<sup>saww</sup>! We are pleased with the judgement of Ali<sup>asws</sup>, and his<sup>asws</sup> words’. So Rasool-Allah<sup>saww</sup> said: ‘It is your repentance from what you had said’."}]}, {"index": 14249, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:9", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَيُّمَا رَجُلٍ فَزَّعَ رَجُلًا عَنِ الْجِدَارِ أَوْ نَفَّرَ بِهِ عَنْ دَابَّتِهِ فَخَرَّ فَمَاتَ فَهُوَ ضَامِنٌ لِدِيَتِهِ وَ إِنِ انْكَسَرَ فَهُوَ ضَامِنٌ لِدِيَةِ مَا يَنْكَسِرُ مِنْهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whichever man panics a man from the wall, or dislodges him from his animal, so he falls off and dies, so he is responsible for his wergild; and if he (the rider) breaks something, so he is responsible of the wergild of whatever has been broken from him’."}]}, {"index": 14250, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:10", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ حَمَلَ عَبْدَهُ عَلَى دَابَّةٍ فَأَوْطَأَتْ فَقَالَ الْغُرْمُ عَلَى مَوْلَاهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, both together from Ibn Mahboub, from Ibn Raib, from a man, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who carried his slave upon an animal, so it trampled (someone). So he<sup>asws</sup> said: ‘The fine is upon his master’."}]}, {"index": 14251, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:11", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي مَرْيَمَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي صَاحِبِ الدَّابَّةِ أَنَّهُ يَضْمَنُ فِي مَا وَطِئَتْ بِيَدِهَا وَ رِجْلِهَا وَ مَا نَفَحَتْ بِرِجْلِهَا فَلَا ضَمَانَ عَلَيْهِ إِلَّا أَنْ يَضْرِبَهَا إِنْسَانٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Yunus Bin Yaqoub, from Abu Maryam, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding the owner of the animal that he is responsible regarding whatever it tramples by its hands (front legs), and its (hind) legs; and whatever it kicks with its (hind) legs, so there is no responsibility upon him except if a human being strikes it’."}]}, {"index": 14252, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:12", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ أَنَّ امْرَأَةً نَذَرَتْ أَنْ تُقَادَ مَزْمُومَةً فَدَفَعَهَا بَعِيرٌ فَخَرَمَ أَنْفَهَا فَأَتَتْ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) تُخَاصِمُ صَاحِبَ الْبَعِيرِ فَأَبْطَلَهُ وَ قَالَ إِنَّمَا نَذَرْتِ لَيْسَ عَلَيْكِ ذَلِكِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from one of his companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> that a woman had vowed to be le bridled, so she was pushed by a camel and her nose was pierced. So she came over to Amir Al-Momineen<sup>asws</sup> to dispute against the owner of the camel. But, he<sup>asws</sup> invalidated it (her claim) and said: ‘But rather, she had vowed (to be bridles), and that is not upon you (the camel owner)’."}]}, {"index": 14253, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:13", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) كَانَ إِذَا صَالَ الْفَحْلُ أَوَّلَ مَرَّةٍ لَمْ يُضَمِّنْ صَاحِبَهُ فَإِذَا ثَنَّى ضَمَّنَ صَاحِبَهُ .</span>", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman Al Asamma, from Misma’a Bin Abdul Malik, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> assails (attacks) for the first time, its owner is not responsible. So when it is the second (time), its owner is responsible’."}]}, {"index": 14254, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:14", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ دَخَلَ دَارَ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَعَقَرَهُ كَلْبُهُمْ قَالَ لَا ضَمَانَ عَلَيْهِمْ وَ إِنْ دَخَلَ بِإِذْنِهِمْ ضَمِنُوا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a man who entered a house of a people without their permission. So their dog injured him. He<sup>asws</sup> said: ‘There is no responsibility upon them, and if he had entered with their permission, they would have been responsible’."}]}, {"index": 14255, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:7:4:42:15", "text": "عَنْهُ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ ضَمَّنَ الْقَائِدَ وَ السَّائِقَ وَ الرَّاكِبَ فَقَالَ مَا أَصَابَ الرِّجْلُ فَعَلَى السَّائِقِ وَ مَا أَصَابَ الْيَدُ فَعَلَى الْقَائِدِ وَ الرَّاكِبِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> that the guide, and the usher, and the rider is responsible, so he<sup>asws</sup> said: ‘Whatever the (hind) legs hit, so it is upon the usher, and whatever the hands (front legs) hit, so it is upon the guide and the rider’."}]}]}, "index": "al-kafi:7:4:42", "kind": "verse_list"}