{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 48"
        },
        "path": "/books/al-kafi:7:4:48",
        "titles": {
          "ar": "باب",
          "en": "Chapter 48 – A chapter"
        }
      }
    ],
    "index": 2204,
    "local_index": 48,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:4:48",
    "titles": {
      "ar": "باب",
      "en": "Chapter 48 – A chapter"
    },
    "verse_count": 1,
    "verse_start_index": 14289,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 14290,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:48:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ الْحَنَّاطِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ مُسْلِمٍ قَتَلَ رَجُلًا مُسْلِماً عَمْداً فَلَمْ يَكُنْ لِلْمَقْتُولِ أَوْلِيَاءُ مِنَ الْمُسْلِمِينَ إِلَّا أَوْلِيَاءُ مِنْ أَهْلِ الذِّمَّةِ مِنْ قَرَابَتِهِ فَقَالَ عَلَى الْإِمَامِ أَنْ يَعْرِضَ عَلَى قَرَابَتِهِ مِنْ أَهْلِ بَيْتِهِ الْإِسْلَامَ فَمَنْ أَسْلَمَ مِنْهُمْ فَهُوَ وَلِيُّهُ يَدْفَعَ الْقَاتِلَ إِلَيْهِ فَإِنْ شَاءَ قَتَلَ وَ إِنْ شَاءَ عَفَا وَ إِنْ شَاءَ أَخَذَ الدِّيَةَ ",
          "فَإِنْ لَمْ يُسْلِمْ أَحَدٌ كَانَ الْإِمَامُ وَلِيَّ أَمْرِهِ فَإِنْ شَاءَ قَتَلَ وَ إِنْ شَاءَ أَخَذَ الدِّيَةَ يَجْعَلُهَا فِي بَيْتِ مَالِ الْمُسْلِمِينَ لِأَنَّ جِنَايَةَ الْمَقْتُولِ كَانَتْ عَلَى الْإِمَامِ فَكَذَلِكَ يَكُونُ دِيَتُهُ لِإِمَامِ الْمُسْلِمِينَ ",
          "قُلْتُ فَإِنْ عَفَا عَنْهُ الْإِمَامُ قَالَ فَقَالَ إِنَّمَا هُوَ حَقُّ جَمِيعِ الْمُسْلِمِينَ وَ إِنَّمَا عَلَى الْإِمَامِ أَنْ يَقْتُلَ أَوْ يَأْخُذَ الدِّيَةَ وَ لَيْسَ لَهُ أَنْ يَعْفُوَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya from Ahmad Bin Muhammad, and Ali Bin Ibrahim from his father, from Ibn Mahboub, from Abu Wallad who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a Muslim man who killed a Muslim man deliberately. So there did not happen to be for the killed one any guardians from the Muslims except for guardians from the <span class=\"iTxt\">Ahl Zimmi</span> (people under the responsibility) from his relatives. So he<sup>asws</sup> said: ‘It would be upon the Imam<sup>asws</sup> to present Al-Islam to his relatives from his family. So the one who became a Muslim from them, so he would be his guardian, the killer would be handed over to him. So if he so desires to he kills, and if he so desires to he excuses, and if he so desires to he takes the wergild.",
            "So if no one were to become a Muslim, the Imam<sup>asws</sup> would be the guardian of his affairs. So if he<sup>asws</sup> so desires to he<sup>asws</sup> kills, and if he<sup>asws</sup> so desires to he takes the wergild. He<sup>asws</sup> would make it to be in the public treasury of the Muslims, because the crime of the killed would be to be resolved by the Imam<sup>asws</sup>. So, like that, his wergild would happen to be for the Imam<sup>asws</sup> of the Muslims’. ",
            "I said, ‘So if the Imam<sup>asws</sup> excuses him from it?’ So he<sup>asws</sup> said: ‘But rather, it is a right of the Muslims, and rather it is upon the Imam<sup>asws</sup> that he<sup>asws</sup> either kills or he<sup>asws</sup> takes the wergild, and it is not for him<sup>asws</sup> that he<sup>asws</sup> excuses’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:4:48",
  "kind": "verse_list"
}