{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 50"
        },
        "path": "/books/al-kafi:7:4:50",
        "titles": {
          "ar": "باب الْقَسَامَةِ",
          "en": "Chapter 50 – The compurgation (sworn endorsements)"
        }
      }
    ],
    "index": 2206,
    "local_index": 50,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:4:50",
    "titles": {
      "ar": "باب الْقَسَامَةِ",
      "en": "Chapter 50 – The compurgation (sworn endorsements)"
    },
    "verse_count": 10,
    "verse_start_index": 14291,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 14292,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:50:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْقَسَامَةِ كَيْفَ كَانَتْ فَقَالَ هِيَ حَقٌّ وَ هِيَ مَكْتُوبَةٌ عِنْدَنَا وَ لَوْ لَا ذَلِكَ لَقَتَلَ النَّاسُ بَعْضُهُمْ بَعْضاً ثُمَّ لَمْ يَكُنْ شَيْ‏ءٌ وَ إِنَّمَا الْقَسَامَةُ نَجَاةٌ لِلنَّاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(The narrator) says, ‘I asked Abu Abdullah<sup>asws</sup> about the compurgation (sworn endorsements), how it was to be?’ So he<sup>asws</sup> said: ‘It is truth, and it is written with us<sup>asws</sup>. And had it not been for that, the people would have killed each other, then nothing would happen. But rather, the compurgation (sworn endorsements) is a salvation for the people’."
          ]
        }
      },
      {
        "index": 14293,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:50:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْقَسَامَةِ هَلْ جَرَتْ فِيهَا سُنَّةٌ قَالَ فَقَالَ نَعَمْ خَرَجَ رَجُلَانِ مِنَ الْأَنْصَارِ يُصِيبَانِ مِنَ الثِّمَارِ فَتَفَرَّقَا فَوُجِدَ أَحَدُهُمَا مَيِّتاً فَقَالَ أَصْحَابُهُ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِنَّمَا قَتَلَ صَاحِبَنَا الْيَهُودُ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تُحَلَّفُ الْيَهُودُ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُحَلِّفُ الْيَهُودَ عَلَى أَخِينَا وَ هُمْ قَوْمٌ كُفَّارٌ قَالَ فَاحْلِفُوا أَنْتُمْ قَالُوا كَيْفَ نَحْلِفُ عَلَى مَا لَمْ نَعْلَمْ وَ لَمْ نَشْهَدْ ",
          "قَالَ فَوَدَاهُ النَّبِيُّ ( صلى الله عليه وآله ) مِنْ عِنْدِهِ قَالَ قُلْتُ كَيْفَ كَانَتِ الْقَسَامَةُ قَالَ فَقَالَ أَمَا إِنَّهَا حَقٌّ وَ لَوْ لَا ذَلِكَ لَقَتَلَ النَّاسُ بَعْضُهُمْ بَعْضاً وَ إِنَّمَا الْقَسَامَةُ حَوْطٌ يُحَاطُ بِهِ النَّاسُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abdullah Bin Sinan who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the compurgation (sworn endorsements), did the Sunnah flow with regards to it?’ So he<sup>asws</sup> said: ‘Yes. Two men from the Helpers went out to collect fruits. So they separated, and one of the two was found to be dead. So his companion said to Rasool-Allah<sup>saww</sup>, ‘But rather, the Jews killed our companion’. So Rasool-Allah<sup>saww</sup> said: ‘The Jews should swear an oath’. So they said, ‘O Rasool-Allah<sup>saww</sup>! How can we get the Jews to swear upon our brother, and they are an Infidel people?’ He<sup>saww</sup> said: ‘So you all swear an oath’. They said, ‘How can we swear upon what we do not know, and did not witness?’ ",
            "He<sup>asws</sup> said: ‘So the Prophet<sup>saww</sup> paid him from himself<sup>saww</sup>’. I said, ‘How did the compurgation (sworn endorsements) come to be?’ So he<sup>asws</sup> said: ‘But, it is the truth, and had it not been for that, the people would have killed each other. But rather, the compurgation (sworn endorsements) is a safeguard which the people are safeguarded by’."
          ]
        }
      },
      {
        "index": 14294,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:50:3",
        "text": [
          "عَنْهُ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْقَسَامَةِ هَلْ جَرَتْ فِيهَا سُنَّةٌ قَالَ فَذَكَرَ مِثْلَ حَدِيثِ ابْنِ سِنَانٍ قَالَ وَ فِي حَدِيثِهِ هِيَ حَقٌّ وَ هِيَ مَكْتُوبَةٌ عِنْدَنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Abdullah Bin Muskam, from Suleyman Bin Khalid who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the compurgation (sworn endorsements), has the Sunnah flowed regarding it?’ He (the narrator) said, ‘So he<sup>asws</sup> mentioned a Hadeeth similar to the one of Ibn Sinan, and said in his<sup>asws</sup> Hadeeth: ‘It is the truth, and it is written with us<sup>asws</sup>’."
          ]
        }
      },
      {
        "index": 14295,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:50:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْقَسَامَةِ فَقَالَ الْحُقُوقُ كُلُّهَا الْبَيِّنَةُ عَلَى الْمُدَّعِي وَ الْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ إِلَّا فِي الدَّمِ خَاصَّةً فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) بَيْنَمَا هُوَ بِخَيْبَرَ إِذْ فَقَدَتِ الْأَنْصَارُ رَجُلًا مِنْهُمْ فَوَجَدُوهُ قَتِيلًا فَقَالَتِ الْأَنْصَارُ إِنَّ فُلَانَ الْيَهُودِيِّ قَتَلَ صَاحِبَنَا فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِلطَّالِبِينَ أَقِيمُوا رَجُلَيْنِ عَدْلَيْنِ مِنْ غَيْرِكُمْ أَقِيدُوهُ بِرُمَّتِهِ فَإِنْ لَمْ تَجِدُوا شَاهِدَيْنِ فَأَقِيمُوا قَسَامَةً خَمْسِينَ رَجُلًا أَقِيدُوهُ بِرُمَّتِهِ فَقَالُوا يَا رَسُولَ اللَّهِ مَا عِنْدَنَا شَاهِدَانِ مِنْ غَيْرِنَا وَ إِنَّا لَنَكْرَهُ أَنْ نُقْسِمَ عَلَى مَا لَمْ نَرَهُ"
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Bureyd Bin Muawiya, ",
            "(The narrator) says: ‘I asked Abu Abdullah<sup>asws</sup> about the compurgation (sworn endorsements), so he<sup>asws</sup> said: ‘With regards to the right, all of them, the burden of proof is upon the claimant, and the swearing of the oath is upon the defendant, except regarding the blood, in particular, for Rasool-Allah<sup>saww</sup> was in Khyber when the Helpers missed a man from them, so he was found killed. So the Helpers said, ‘So and so the Jew killed our companion’. So Rasool-Allah<sup>saww</sup> said to the seekers: ‘Establish two just men from others, I<sup>saww</sup> shall retaliate by its entirety. So if you do not find two witnesses, so establish compurgation (sworn endorsements) of fifty men, I<sup>saww</sup> shall retaliate by its entirety’. So they said, ‘O Rasool-Allah<sup>saww</sup>! There are no two witnesses with us from others, and we hate that we swear upon what we have not seen’. ",
            "فَوَدَاهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ عِنْدِهِ وَ قَالَ إِنَّمَا حُقِنَ دِمَاءُ الْمُسْلِمِينَ بِالْقَسَامَةِ لِكَيْ إِذْ رَأَى الْفَاجِرُ الْفَاسِقُ فُرْصَةً مِنْ عَدُوِّهِ حَجَزَهُ مَخَافَةُ الْقَسَامَةِ أَنْ يُقْتَلَ بِهِ فَكَفَّ عَنْ قَتْلِهِ وَ إِلَّا حَلَفَ الْمُدَّعَى عَلَيْهِ قَسَامَةً خَمْسِينَ رَجُلًا مَا قَتَلْنَا وَ لَا عَلِمْنَا قَاتِلًا وَ إِلَّا أُغْرِمُوا الدِّيَةَ إِذَا وَجَدُوا قَتِيلًا بَيْنَ أَظْهُرِهِمْ إِذَا لَمْ يُقْسِمِ الْمُدَّعُونَ .",
            "So Rasool-Allah<sup>saww</sup> paid it from himself<sup>saww</sup>, and said: ‘But rather, the blood of the Muslims is saved by the compurgation, perhaps when the immoral mischievous one might see a chance from his enemy, would keep aside in fear of the compurgation (sworn endorsements), that he himself would be killed by it. So he would restrain from killing him, or else the claimant would swear an oath against him, a compurgation (sworn endorsement) of fifty men, ‘We have neither killed nor do we know the killer’, or else be fined the wergild. When the killer is found in their presence, when the claimants do not swear’."
          ]
        }
      },
      {
        "index": 14296,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:50:5",
        "text": [
          "ابْنُ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْقَسَامَةِ فَقَالَ هِيَ حَقٌّ إِنَّ رَجُلًا مِنَ الْأَنْصَارِ وُجِدَ قَتِيلًا فِي قَلِيبٍ مِنْ قُلُبِ الْيَهُودِ فَأَتَوْا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّا وَجَدْنَا رَجُلًا مِنَّا قَتِيلًا فِي قَلِيبٍ مِنْ قُلُبِ الْيَهُودِ فَقَالَ ائْتُونِي بِشَاهِدَيْنِ مِنْ غَيْرِكُمْ قَالُوا يَا رَسُولَ اللَّهِ مَا لَنَا شَاهِدَانِ مِنْ غَيْرِنَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَلْيُقْسِمْ خَمْسُونَ رَجُلًا مِنْكُمْ عَلَى رَجُلٍ نَدْفَعُهُ إِلَيْكُمْ قَالُوا يَا رَسُولَ اللَّهِ وَ كَيْفَ نُقْسِمُ عَلَى مَا لَمْ نَرَهُ قَالَ فَيُقْسِمُ الْيَهُودُ قَالُوا يَا رَسُولَ اللَّهِ وَ كَيْفَ نَرْضَى بِالْيَهُودِ وَ مَا فِيهِمْ مِنَ الشِّرْكِ أَعْظَمُ فَوَدَاهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله )",
          "قَالَ زُرَارَةُ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّمَا جُعِلَتِ الْقَسَامَةُ احْتِيَاطاً لِدِمَاءِ النَّاسِ لِكَيْمَا إِذَا أَرَادَ الْفَاسِقُ أَنْ يَقْتُلَ رَجُلًا أَوْ يَغْتَالَ رَجُلًا حَيْثُ لَا يَرَاهُ أَحَدٌ خَافَ ذَلِكَ وَ امْتَنَعَ مِنَ الْقَتْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Abu Umeyr, from Umar Bin Aina, from Zurara who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the compurgation (sworn endorsements), so he<sup>asws</sup> said: ‘It is truth. A man from the Helpers was found killed in a well from the wells of the Jews. So they came to Rasool-Allah<sup>saww</sup>, so they said, ‘O Rasool-Allah<sup>saww</sup>! We found a man from us killed in a well from the wells of the Jews’. So he<sup>saww</sup> said: ‘Come to me with two witnesses from other than you all’. They said, ‘O Rasool-Allah<sup>saww</sup>! There are no two witnesses for us from others’. So Rasool-Allah<sup>saww</sup> said to them: ‘So let fifty men from you swear upon a man, we shall hand him over to you’. They said, ‘O Rasool-Allah <sup>saww</sup>! And how can we swear upon what we have not seen?’ He<sup>saww</sup> said: ‘So the Jew should swear’. So they said, ‘O Rasool-Allah<sup>saww</sup>! And how can we be pleased with the Jew and what is among them from the grievous Polytheism?’ So Rasool-Allah<sup>saww</sup> paid it’.",
            "Zurara said, ‘Abu Abdullah<sup>asws</sup> said; ‘But rather, the compurgation (sworn endorsements) has been made to be as a precaution for the blood of the people so that when the immoral intends to kill a man, or assassinate a man where no one would see him, he would fear that, and be prevented from the killing’."
          ]
        }
      },
      {
        "index": 14297,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:50:6",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ بُكَيْرٍعَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ حَكَمَ فِي دِمَائِكُمْ بِغَيْرِ مَا حَكَمَ بِهِ فِي أَمْوَالِكُمْ ",
          "حَكَمَ فِي أَمْوَالِكُمْ أَنَّ الْبَيِّنَةَ عَلَى الْمُدَّعِي وَ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ وَ حَكَمَ فِي دِمَائِكُمْ أَنَّ الْبَيِّنَةَ عَلَى مَنِ ادُّعِيَ عَلَيْهِ وَ الْيَمِينَ عَلَى مَنِ ادَّعَى لِكَيْلَا يَبْطُلَ دَمُ امْرِئٍ مُسْلِمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ibn Bukeyr, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic has Judged with regards to your blood (lives) with other than what He<sup>azwj</sup> has Judged with regards to your wealth. ",
            "A Judgement with regards to your wealth is that the burden of proof is upon the claimant, and the swearing is upon the defendant; and a Judgement with regards to your blood (life) is that the burden of proof is upon the defendant, but the swearing is upon the one who claims, so that the blood of a Muslim is not lost’."
          ]
        }
      },
      {
        "index": 14298,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:50:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ حَنَانِ بْنِ سَدِيرٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) سَأَلَنِي ابْنُ شُبْرُمَةَ مَا تَقُولُ فِي الْقَسَامَةِ فِي الدَّمِ فَأَجَبْتُهُ بِمَا صَنَعَ النَّبِيُّ ( صلى الله عليه وآله ) فَقَالَ أَ رَأَيْتَ لَوْ أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) لَمْ يَصْنَعْ هَكَذَا كَيْفَ كَانَ الْقَوْلُ فِيهِ قَالَ فَقُلْتُ لَهُ أَمَّا مَا صَنَعَ النَّبِيُّ ( صلى الله عليه وآله ) فَقَدْ أَخْبَرْتُكَ بِهِ وَ أَمَّا مَا لَمْ يَصْنَعْ فَلَا عِلْمَ لِي بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazie, from hanan Bin Sudeyr who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me<sup>asws</sup>, ‘Ibn Shabrama asked me<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding the compurgation (sworn endorsements) with regards to the blood?’ So I<sup>asws</sup> answered him: ‘With what the Prophet<sup>saww</sup> dealt with’. So he said, ‘What is your<sup>asws</sup> view if the Prophet<sup>saww</sup> had not done it like this, how would have been the word (of judgement) with regards to it?’ So I<sup>asws</sup> said: ‘As far as what the Prophet<sup>saww</sup> did do, so I<sup>asws</sup> have informed you of it; and as for what he<sup>saww</sup> did not do, so there is no knowledge for me<sup>asws</sup> of it’."
          ]
        }
      },
      {
        "index": 14299,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:50:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْقَسَامَةِ أَيْنَ كَانَ بَدْؤُهَا قَالَ كَانَ مِنْ قِبَلِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَمَّا كَانَ بَعْدَ فَتْحِ خَيْبَرَ تَخَلَّفَ رَجُلٌ مِنَ الْأَنْصَارِ عَنْ أَصْحَابِهِ فَرَجَعُوا فِي طَلَبِهِ فَوَجَدُوهُ مُتَشَحِّطاً فِي دَمِهِ قَتِيلًا فَجَاءَتِ الْأَنْصَارُ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَتْ يَا رَسُولَ اللَّهِ قَتَلَتِ الْيَهُودُ صَاحِبَنَا فَقَالَ لِيُقْسِمْ مِنْكُمْ خَمْسُونَ رَجُلًا عَلَى أَنَّهُمْ قَتَلُوهُ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُقْسِمُ عَلَى مَا لَمْ نَرَهُ قَالَ فَيُقْسِمُ الْيَهُودُ فَقَالُوا يَا رَسُولَ اللَّهِ مَنْ يُصَدِّقُ الْيَهُودَ فَقَالَ أَنَا إِذاً أَدِي صَاحِبَكُمْ",
          "فَقُلْتُ لَهُ كَيْفَ الْحُكْمُ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ حَكَمَ فِي الدِّمَاءِ مَا لَمْ يَحْكُمْ فِي شَيْ‏ءٍ مِنْ حُقُوقِ النَّاسِ لِتَعْظِيمِهِ الدِّمَاءَ لَوْ أَنَّ رَجُلًا ادَّعَى عَلَى رَجُلٍ عَشَرَةَ آلَافِ دِرْهَمٍ أَوْ أَقَلَّ مِنْ ذَلِكَ أَوْ أَكْثَرَ لَمْ يَكُنِ الْيَمِينُ لِلْمُدَّعِي وَ كَانَتِ الْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ فَإِذَا ادَّعَى الرَّجُلُ عَلَى الْقَوْمِ بِالدَّمِ أَنَّهُمْ قَتَلُوا كَانَتِ الْيَمِينُ لِمُدَّعِي الدَّمِ قَبْلَ الْمُدَّعَى عَلَيْهِمْ فَعَلَى الْمُدَّعِي أَنْ يَجِي‏ءَ بِخَمْسِينَ رَجُلًا يَحْلِفُونَ أَنَّ فُلَاناً قَتَلَ فُلَاناً فَيُدْفَعُ إِلَيْهِمُ الَّذِي حُلِفَ عَلَيْهِ فَإِنْ شَاءُوا عَفَوْا وَ إِنْ شَاءُوا قَتَلُوا وَ إِنْ شَاءُوا قَبِلُوا الدِّيَةَ",
          "وَ إِنْ لَمْ يُقْسِمُوا فَإِنَّ عَلَى الَّذِينَ ادُّعِيَ عَلَيْهِمْ أَنْ يَحْلِفَ مِنْهُمْ خَمْسُونَ مَا قَتَلْنَا وَ لَا عَلِمْنَا لَهُ قَاتِلًا فَإِنْ فَعَلُوا وَدَى أَهْلُ الْقَرْيَةِ الَّذِينَ وُجِدَ فِيهِمْ وَ إِنْ كَانَ بِأَرْضِ فَلَاةٍ أُدِّيَتْ دِيَتُهُ مِنْ بَيْتِ الْمَالِ فَإِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ لَا يَبْطُلُ دَمُ امْرِئٍ مُسْلِمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the compurgation (sworn endorsements), ‘Where was its beginning?’ He<sup>asws</sup> said: ‘It was from before Rasool-Allah<sup>saww</sup>. When it was after the victory of Khyber, a man from the Helpers was left behind from his companions. So they returned to seek him, and they found him covered in his blood, killed. So the Helpers came over to Rasool-Allah<sup>saww</sup>, so they said, ‘The Jews have killed our companion’. So he<sup>saww</sup> said: ‘Let fifty men from you swear upon that it is they who killed him’. They said, ‘O Rasool-Allah<sup>saww</sup>! How can we swear upon what we have not seen?’ He<sup>saww</sup> said: ‘So the Jew should swear’. So they said, ‘O Rasool-Allah<sup>saww</sup>! Who would ratify the Jew?’ So he<sup>saww</sup> said: ‘I<sup>saww</sup> would then pay your companion’.",
            "So I said to him<sup>asws</sup>, ‘How is the judgement?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Judged regarding the blood what He<sup>azwj</sup> did not Judge regarding anything from the rights of the people, due to the reverence of the blood. ",
            "If a man were to claim upon a man ten thousand Dirhams, or less than that, or more, there would not be swearing for the claimant, and the swearing was upon the defendant. So when the man claims upon a group with the blood that they killed him, the swearing would be for the claimant of the blood before the defendant. Thus, it would be upon the claimant that he comes with fifty men swearing on oath that so and so killed so and so. So he would be handed over to them, the one who has been sworn against. So if they so desire to they may excuse, and if they so desire to they may kill, and if they so desire to they accept the wergild.",
            "And if they do not swear, so it would be upon the defendant that he should get fifty of them (the accusers) to swear, ‘We neither have killed nor do we know his killer’. So if they do that, it is the people of the town where he (the killed one) was found to be among them, should pay, and if (he was found) in the land of wilderness, his wergild would be paid from the public treasury, for Amir Al-Momineen<sup>asws</sup> was saying: ‘There would be no invalidation of the blood of a Muslim’."
          ]
        }
      },
      {
        "index": 14300,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:50:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ وَ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ جَمِيعاً عَنِ الرِّضَا ( عليه السلام ) وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ ظَرِيفٍ عَنْ أَبِيهِ ظَرِيفِ بْنِ نَاصِحٍ عَنْ عَبْدِ اللَّهِ بْنِ أَيُّوبَ عَنْ أَبِي عَمْرٍو الْمُتَطَبِّبِ قَالَ عَرَضْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا أَفْتَى بِهِ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي الدِّيَاتِ فَمِمَّا أَفْتَى بِهِ أَفْتَى فِي الْجَسَدِ وَ جَعَلَهُ سِتَّةَ فَرَائِضَ النَّفْسُ وَ الْبَصَرُ وَ السَّمْعُ وَ الْكَلَامُ وَ نَقْصُ الصَّوْتِ مِنَ الْغَنَنِ وَ الْبَحَحِ وَ الشَّلَلُ مِنَ الْيَدَيْنِ وَ الرِّجْلَيْنِ ثُمَّ جَعَلَ مَعَ كُلِّ شَيْ‏ءٍ مِنْ هَذِهِ قَسَامَةً عَلَى نَحْوِ مَا بَلَغَتِ الدِّيَةُ وَ الْقَسَامَةَ جَعَلَ فِي النَّفْسِ عَلَى الْعَمْدِ خَمْسِينَ رَجُلًا ",
          "وَ جَعَلَ فِي النَّفْسِ عَلَى الْخَطَإِ خَمْسَةً وَ عِشْرِينَ رَجُلًا وَ عَلَى مَا بَلَغَتْ دِيَتُهُ مِنَ الْجُرُوحِ أَلْفَ دِينَارٍ سِتَّةَ نَفَرٍ فَمَا كَانَ دُونَ ذَلِكَ فَبِحِسَابِهِ مِنْ سِتَّةِ نَفَرٍ وَ الْقَسَامَةُ فِي النَّفْسِ وَ السَّمْعِ وَ الْبَصَرِ وَ الْعَقْلِ وَ الصَّوْتِ مِنَ الْغَنَنِ وَ الْبَحَحِ وَ نَقْصِ الْيَدَيْنِ وَ الرِّجْلَيْنِ فَهُوَ مِنْ سِتَّةِ أَجْزَاءِ الرَّجُلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Fazzal, and Muhammad Bin Isa, from Yunus, ",
            "(It has been narrated) both together from Al-Reza<sup>asws</sup>, ",
            "and and number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Zareyf, from his father Zareyf Bin Naih, from Abdullah Bin Ayoun, from Abu Amro Al Mutatayyab who said, ",
            "‘I presented to Abu Abdullah<sup>asws</sup> the verdict of Amir Al-Momineen<sup>asws</sup> regarding the wergild. So from what he<sup>asws</sup> had issued verdict with regarding the body, and made it six obligations of the self, and the sight, and the hearing, and the speech, and deficiency of the voice from the croaking, and the paralysis of the two hands, and the two legs. ",
            "And he<sup>asws</sup> made to be regarding the self upon the erroneous (killing), being twenty-five men (swearing), and upon what his wergild reached from the injuries sustained, a thousand Dinars, being six persons (swearing). So whatever was less than that, it would be by that counting, from six persons (swearing). And the compurgation (sworn endorsements) regarding the self, and the hearing and the sight, and the intellect, and the voice, from the croacking, and the deficiency of the two hands and the two legs, so it is from six parts of the man’."
          ]
        }
      },
      {
        "index": 14301,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:50:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> فِي الْقَسَامَةِ خَمْسُونَ رَجُلًا فِي الْعَمْدِ وَ فِي الْخَطَإِ خَمْسَةٌ وَ عِشْرُونَ رَجُلًا وَ عَلَيْهِمْ أَنْ يَحْلِفُوا بِاللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abdullah Bin Sinan who said, ",
            "‘Abu Abdullah<sup>asws</sup> said regarding the compurgation (sworn endorsements) being fifty men regarding the deliberate (killing), and regarding the erroneous, being twenty-five men, and upon them is that they should be swearing by Allah<sup>azwj</sup>’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:4:50",
  "kind": "verse_list"
}