{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:7:4", "titles": {"ar": "كِتَابُ الدِّيَاتِ", "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"}}, {"indexed_titles": {"en": "Chapter 52"}, "path": "/books/al-kafi:7:4:52", "titles": {"ar": "باب الْعَاقِلَةِ", "en": "Chapter 52 – The (wergild paid by) the blood relatives"}}], "index": 2198, "local_index": 52, "part_type": "Chapter", "path": "/books/al-kafi:7:4:52", "titles": {"ar": "باب الْعَاقِلَةِ", "en": "Chapter 52 – The (wergild paid by) the blood relatives"}, "verse_count": 5, "verse_start_index": 14291, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14292, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:4:52:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَيْسَ بَيْنَ أَهْلِ الذِّمَّةِ مُعَاقَلَةٌ فِيمَا يَجْنُونَ مِنْ قَتْلٍ أَوْ جِرَاحَةٍ إِنَّمَا يُؤْخَذُ ذَلِكَ مِنْ أَمْوَالِهِمْ فَإِنْ لَمْ يَكُنْ لَهُمْ مَالٌ رَجَعَتِ الْجِنَايَةُ عَلَى إِمَامِ الْمُسْلِمِينَ لِأَنَّهُمْ يُؤَدُّونَ إِلَيْهِ الْجِزْيَةَ كَمَا يُؤَدِّي الْعَبْدُ الضَّرِيبَةَ إِلَى سَيِّدِهِ ", "قَالَ وَ هُمْ مَمَالِيكُ الْإِمَامِ فَمَنْ أَسْلَمَ مِنْهُمْ فَهُوَ حُرٌّ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, both together from Ibn Mahboub, from Abu Wallad, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is no (payment of the wergild) by the blood relatives between the people under the responsibility (<span class=\"iTxt\">Ahl Al-Zimma</span>), regarding what crimes they commit from killing or injuries. But rather, that would be taken from their wealth. So if there does not happen to be wealth for them, the crime would be referred to Imam<sup>asws</sup> of the Muslims, because they would be paying the tax to him<sup>asws</sup>, just like the slave pays whatever he earns to his master’. ", "He<sup>asws</sup> said: ‘And they are the owned slaves of the Imam<sup>asws</sup>, so the one who becomes a Muslim from them, so he is free’."]}}, {"index": 14293, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:4:52:2", "text": ["ابْنُ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِيهِ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ قَالَ أُتِيَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِرَجُلٍ قَدْ قَتَلَ رَجُلًا خَطَأً فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَنْ عَشِيرَتُكَ وَ قَرَابَتُكَ فَقَالَ مَا لِي بِهَذِهِ الْبَلْدَةِ عَشِيرَةٌ وَ لَا قَرَابَةٌ قَالَ فَقَالَ فَمِنْ أَيِّ أَهْلِ الْبُلْدَانِ أَنْتَ فَقَالَ أَنَا رَجُلٌ مِنْ أَهْلِ الْمَوْصِلِ وُلِدْتُ بِهَا وَ لِي بِهَا قَرَابَةٌ وَ أَهْلُ بَيْتٍ", "قَالَ فَسَأَلَ عَنْهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَلَمْ يَجِدْ لَهُ بِالْكُوفَةِ قَرَابَةً وَ لَا عَشِيرَةً قَالَ فَكَتَبَ إِلَى عَامِلِهِ عَلَى الْمَوْصِلِ أَمَّا بَعْدُ فَإِنَّ فُلَانَ بْنَ فُلَانٍ وَ حِلْيَتَهُ كَذَا وَ كَذَا قَتَلَ رَجُلًا مِنَ الْمُسْلِمِينَ خَطَأً فَذَكَرَ أَنَّهُ رَجُلٌ مِنَ الْمَوْصِلِ وَ أَنَّ لَهُ بِهَا قَرَابَةً وَ أَهْلَ بَيْتٍ وَ قَدْ بَعَثْتُ بِهِ إِلَيْكَ مَعَ رَسُولِي فُلَانِ بْنِ فُلَانٍ وَ حِلْيَتُهُ كَذَا وَ كَذَا فَإِذَا وَرَدَ عَلَيْكَ إِنْ شَاءَ اللَّهُ وَ قَرَأْتَ كِتَابِي فَافْحَصْ عَنْ أَمْرِهِ وَ سَلْ عَنْ قَرَابَتِهِ مِنَ الْمُسْلِمِينَ فَإِنْ كَانَ مِنْ أَهْلِ الْمَوْصِلِ مِمَّنْ وُلِدَ بِهَا وَ أَصَبْتَ لَهُ بِهَا قَرَابَةً مِنَ الْمُسْلِمِينَ فَاجْمَعْهُمْ إِلَيْكَ ثُمَّ انْظُرْ فَإِنْ كَانَ مِنْهُمْ رَجُلٌ يَرِثُهُ لَهُ سَهْمٌ فِي الْكِتَابِ لَا يَحْجُبُهُ عَنْ مِيرَاثِهِ أَحَدٌ مِنْ قَرَابَتِهِ فَأَلْزِمْهُ الدِّيَةَ وَ خُذْهُ بِهَا نُجُوماً فِي ثَلَاثِ سِنِينَ ", "فَإِنْ لَمْ يَكُنْ لَهُ مِنْ قَرَابَتِهِ أَحَدٌ لَهُ سَهْمٌ فِي الْكِتَابِ وَ كَانُوا قَرَابَتُهُ سَوَاءً فِي النَّسَبِ وَ كَانَ لَهُ قَرَابَةٌ مِنْ قِبَلِ أَبِيهِ وَ أُمِّهِ فِي النَّسَبِ سَوَاءً فَفُضَّ الدِّيَةَ عَلَى قَرَابَتِهِ مِنْ قِبَلِ أَبِيهِ وَ عَلَى قَرَابَتِهِ مِنْ قِبَلِ أُمِّهِ مِنَ الرِّجَالِ الْمُدْرِكِينَ الْمُسْلِمِينَ ثُمَّ اجْعَلْ عَلَى قَرَابَتِهِ مِنْ قِبَلِ أَبِيهِ ثُلُثَيِ الدِّيَةِ وَ اجْعَلْ عَلَى قَرَابَتِهِ مِنْ قِبَلِ أُمِّهِ ثُلُثَ الدِّيَةِ ", "وَ إِنْ لَمْ يَكُنْ لَهُ قَرَابَةٌ مِنْ قِبَلِ أَبِيهِ فَفُضَّ الدِّيَةَ عَلَى قَرَابَتِهِ مِنْ قِبَلِ أُمِّهِ مِنَ الرِّجَالِ الْمُدْرِكِينَ الْمُسْلِمِينَ ثُمَّ خُذْهُمْ بِهَا وَ اسْتَأْدِهِمُ الدِّيَةَ فِي ثَلَاثِ سِنِينَ فَإِنْ لَمْ يَكُنْ لَهُ قَرَابَةٌ مِنْ قِبَلِ أُمِّهِ وَ لَا قَرَابَةٌ مِنْ قِبَلِ أَبِيهِ فَفُضَّ الدِّيَةَ عَلَى أَهْلِ الْمَوْصِلِ مِمَّنْ وُلِدَ بِهَا وَ نَشَأَ وَ لَا تُدْخِلَنَّ فِيهِمْ غَيْرَهُمْ مِنْ أَهْلِ الْبَلَدِ ثُمَّ اسْتَأْدِ ذَلِكَ مِنْهُمْ فِي ثَلَاثِ سِنِينَ فِي كُلِّ سَنَةٍ نَجْماً حَتَّى تَسْتَوْفِيَهُ إِنْ شَاءَ اللَّهُ ", "وَ إِنْ لَمْ يَكُنْ لِفُلَانِ بْنِ فُلَانٍ قَرَابَةٌ مِنْ أَهْلِ الْمَوْصِلِ وَ لَا يَكُونُ مِنْ أَهْلِهَا وَ كَانَ مُبْطِلًا فَرُدَّهُ إِلَيَّ مَعَ رَسُولِي فُلَانِ بْنِ فُلَانٍ إِنْ شَاءَ اللَّهُ فَأَنَا وَلِيُّهُ وَ الْمُؤَدِّي عَنْهُ وَ لَا أُبْطِلُ دَمَ امْرِئٍ مُسْلِمٍ ."], "translations": {"en.hubeali": ["Ibn Mahboub, from Malik Bin Atiyya, from his father, from Salma Bin Kuheyl who said, ", "‘They came to Amir Al-Momineen<sup>asws</sup> with a man who had killed a man in error. So Amir Al-Momineen<sup>asws</sup> said to him: ‘Who are your clan and your relatives?’ So he said, ‘There is neither a clan nor any relatives for me in this city’. So he<sup>asws</sup> said: ‘So from which of the cities are you?’ So he said, ‘I am a man from the people of Mosul, born in it and for me are relatives and family’. ", "He (the narrator) said, ‘So Amir Al-Momineen<sup>asws</sup> asked about him, but they did no find at Al-Kufa, neither relatives nor a clan. So he<sup>asws</sup> wrote to his<sup>asws</sup> office-bearer in Al-Mosul: ‘As for afterwards, so and so son of so and so, and his appearance is such and such, killed one (person) from the Muslim in error. So, he mentioned that he is a man from Al-Mosul, and that for him, at it, are relatives and a family, and I<sup>asws</sup> am sending him to you with my<sup>asws</sup> so and so son of so and so messenger, and his appearance is such and such. So when they come over to you, Allah<sup>azwj</sup> Willing, and you read my<sup>asws</sup> letter, so examine his matter and ask about his relatives from the Muslims. So if there was one from the people of Al-Mosul, from the ones who were born at it, and relationships were established by it from the Muslims, so gather them to you. Then look around, so if there was among them a man who would inherit a share from him, in the Book (Quran), no one from his relatives barring him from his inheritance, so necessitate the wergild, and take it by instalments over three years.", "So if there does not happen to be a relative of his for whom there is a share in the Book (Quran), and that his relatives were equal in their kinship, and there was for him a relative from his father and his mother being equal in the kinship, so divide the payable wergild upon his relatives from his father, and upon the relatives from his mother, from the adult Muslim males. Then make it upon his relatives (female) from his father, two-thirds of the wergild, and make it upon his relatives from his mother, one-third of the wergild. ", "And if there do not happen to be relatives for him from his father, so divide the payable wergild upon his relatives from his mother, from the adult Muslim males. Then seize them by it, and make them pay the wergild during three years. So if there do not happen to be relatives for him from his mother, nor any relatives for him from his father, so divide the payable wergild upon the people of Al-Mosul from the one who were born at it, and grew up, and do not include others among them from the people of the city. Then make it payable from them over three years, an instalment in each year, until they have fulfilled it, Allah<sup>azwj</sup> Willing.", "And if there do not happen to be relatives for so and so, son of so and so, from the people of Al-Mosul. And if he does not happen to be from its people, and he has falsified it, so return him to me<sup>asws</sup> along with my<sup>asws</sup> messenger, so and so, son of so and so, Allah<sup>azwj</sup> willing, for I<sup>asws</sup> am his guardian, and the claimant from him, and I<sup>asws</sup> will not invalidate the blood of a Muslim person’."]}}, {"index": 14294, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:4:52:3", "text": ["حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَتَلَ رَجُلًا مُتَعَمِّداً ثُمَّ هَرَبَ الْقَاتِلُ فَلَمْ يُقْدَرْ عَلَيْهِ قَالَ إِنْ كَانَ لَهُ مَالٌ أُخِذَتِ الدِّيَةُ مِنْ مَالِهِ وَ إِلَّا فَمِنَ الْأَقْرَبِ فَالْأَقْرَبِ فَإِنْ لَمْ يَكُنْ لَهُ قَرَابَةٌ وَدَاهُ الْإِمَامُ فَإِنَّهُ لَا يَبْطُلُ دَمُ امْرِئٍ مُسْلِمٍ .", "وَ فِي رِوَايَةٍ أُخْرَى ثُمَّ لِلْوَالِي بَعْدُ حَبْسُهُ وَ أَدَبُهُ ."], "translations": {"en.hubeali": ["Humeyd Bin Ziyad, from Al Hazzan Bin Muhammad Bin Sama’at, from Ahmad Bin Al Hassan Al Maysami, from Aban Bin Usman, from Abu Baseer who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who killed a man deliberately, then the killer fled and they were not able over him (to catch him). He<sup>asws</sup> said: ‘If there was wealth for him, the wergild would be taken from his wealth, or else from the relatives, if there are relatives. So if there do not happen to be relatives for him, the Imam<sup>asws</sup> would pay it, for the blood of a Muslim person would not be invalidated’.", "And in another report: ‘The it would be for the ruler afterwards to imprison him, and discipline him’."]}}, {"index": 14295, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:4:52:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي مَرْيَمَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَنَّهُ لَا يُحْمَلُ عَلَى الْعَاقِلَةِ إِلَّا الْمُوضِحَةُ فَصَاعِداً وَ قَالَ مَا دُونَ السِّمْحَاقِ أَجْرُ الطَّبِيبِ سِوَى الدِّيَةِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Yunus Bin Yaqoub, from Abu Maryan, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged that there would be no burden upon the (wergild payable by) the blood relatives except for the bone exposing injury upwards’. And he<sup>asws</sup> said: ‘What is below bone reaching injury, the fees of the doctor is in addition to the wergild’."]}}, {"index": 14296, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:4:52:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَا تَضْمَنُ الْعَاقِلَةُ عَمْداً وَ لَا إِقْرَاراً وَ لَا صُلْحاً ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, form Ibn Mahboub, from Ali Bin Abu Hamza, from Abu Baseer, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The blood relatives are not guarantors in deliberate (killing), nor confession, nor a reconciliation’."]}}]}, "index": "al-kafi:7:4:52", "kind": "verse_list"}