{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:7:4", "titles": {"ar": "كِتَابُ الدِّيَاتِ", "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"}}, {"indexed_titles": {"en": "Chapter 53"}, "path": "/books/al-kafi:7:4:53", "titles": {"ar": "باب", "en": "Chapter 53 – A chapter"}}], "index": 2199, "local_index": 53, "part_type": "Chapter", "path": "/books/al-kafi:7:4:53", "titles": {"ar": "باب", "en": "Chapter 53 – A chapter"}, "verse_count": 4, "verse_start_index": 14296, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14297, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:4:53:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مِسْمَعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَضَى فِي أَرْبَعَةٍ شَهِدُوا عَلَى رَجُلٍ أَنَّهُمْ رَأَوْهُ مَعَ امْرَأَةٍ يُجَامِعُهَا فَيُرْجَمُ ثُمَّ يَرْجِعُ وَاحِدٌ مِنْهُمْ قَالَ يُغَرَّمُ رُبُعَ الدِّيَةِ إِذَا قَالَ شُبِّهَ عَلَيَّ فَإِنْ رَجَعَ اثْنَانِ وَ قَالَا شُبِّهَ عَلَيْنَا غُرِّمَا نِصْفَ الدِّيَةِ وَ إِنْ رَجَعُوا جَمِيعاً وَ قَالُوا شُبِّهَ عَلَيْنَا غُرِّمُوا الدِّيَةَ وَ إِنْ قَالُوا شَهِدْنَا بِالزُّورِ قُتِلُوا جَمِيعاً ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Misma’a, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> judged regarding four witnesses upon a man who had seen him copulating with a woman. So he was stoned. Then one of them retracted (his statement). He<sup>asws</sup> said: ‘He would be fined a quarter of the wergild, when he says, ‘It was doubtful to me’. So if two were to retract, and they both say, ‘It was doubtful upon us’, they would both be fined half the wergild. And if all of them were to retract, and they say, ‘It was doubtful upon us’, they would be fined the (complete) wergild. But if they were to say, ‘We testified falsely’, they would be killed all together’."]}}, {"index": 14298, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:4:53:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي أَرْبَعَةٍ شَهِدُوا عَلَى رَجُلٍ مُحْصَنٍ بِالزِّنَى ثُمَّ رَجَعَ أَحَدُهُمْ بَعْدَ مَا قُتِلَ الرَّجُلُ قَالَ إِنْ قَالَ الرَّابِعُ وَهَمْتُ ضُرِبَ الْحَدَّ وَ غُرِّمَ الدِّيَةَ وَ إِنْ قَالَ تَعَمَّدْتُ قُتِلَ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Mahboub, from one of his companion, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding four who testified upon a married man with the adultery. Then one of them retracted after the man had been killed. He<sup>asws</sup> said : ‘If the fourth one says, ‘I was delusional’, he would be struck the legal penalty (<span class=\"iTxt\">Hadd</span>), and fined the wergild. And if he says, ‘I was deliberate’, he would be killed’."]}}, {"index": 14299, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:4:53:3", "text": ["ابْنُ مَحْبُوبٍ عَنْ إِبْرَاهِيمَ بْنِ نُعَيْمٍ الْأَزْدِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَرْبَعَةٍ شَهِدُوا عَلَى رَجُلٍ بِالزِّنَى فَلَمَّا قُتِلَ رَجَعَ أَحَدُهُمْ عَنْ شَهَادَتِهِ قَالَ فَقَالَ يُقْتَلُ الرَّابِعُ وَ يُؤَدِّي الثَّلَاثَةُ إِلَى أَهْلِهِ ثَلَاثَةَ أَرْبَاعِ الدِّيَةِ ."], "translations": {"en.hubeali": ["Ibn Mahboub, from Ibrahim Bin Nuaym Al Azdy who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about four who testified upon a man with the adultery. So when he was killed, one of them retracted from hits testimony. So he<sup>asws</sup> said: ‘The fourth one would be killed, and the (other) three would pay three-quarters of the wergild to his family’."]}}, {"index": 14300, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:4:53:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْمُخْتَارِ بْنِ مُحَمَّدِ بْنِ الْمُخْتَارِ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ الْعَلَوِيِّ جَمِيعاً عَنِ الْفَتْحِ بْنِ يَزِيدَ الْجُرْجَانِيِّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي أَرْبَعَةٍ شَهِدُوا عَلَى رَجُلٍ أَنَّهُ زَنَى فَرُجِمَ ثُمَّ رَجَعُوا وَ قَالُوا قَدْ وَهَمْنَا يُلْزَمُونَ الدِّيَةَ وَ إِنْ قَالُوا إِنَّا تَعَمَّدْنَا قَتَلَ أَيَّ الْأَرْبَعَةِ شَاءَ وَلِيُّ الْمَقْتُولِ وَ رَدَّ الثَّلَاثَةُ ثَلَاثَةَ أَرْبَاعِ الدِّيَةِ إِلَى أَوْلِيَاءِ الْمَقْتُولِ الثَّانِي وَ يُجْلَدُ الثَّلَاثَةُ كُلُّ وَاحِدٍ مِنْهُمْ ثَمَانِينَ جَلْدَةً وَ إِنْ شَاءَ وَلِيُّ الْمَقْتُولِ أَنْ يَقْتُلَهُمْ رَدَّ ثَلَاثَ دِيَاتٍ عَلَى أَوْلِيَاءِ الشُّهُودِ الْأَرْبَعَةِ وَ يُجْلَدُونَ ثَمَانِينَ كُلُّ وَاحِدٍ مِنْهُمْ ثُمَّ يَقْتُلُهُمُ الْإِمَامُ ", "وَ قَالَ فِي رَجُلَيْنِ شَهِدَا عَلَى رَجُلٍ أَنَّهُ سَرَقَ فَقُطِعَ ثُمَّ رَجَعَ وَاحِدٌ مِنْهُمَا وَ قَالَ وَهَمْتُ فِي هَذَا وَ لَكِنْ كَانَ غَيْرَهُ يُلْزَمُ نِصْفَ دِيَةِ الْيَدِ وَ لَا تُقْبَلُ شَهَادَتُهُ فِي الْآخَرِ فَإِنْ رَجَعَا جَمِيعاً وَ قَالَا وَهَمْنَا بَلْ كَانَ السَّارِقُ فُلَاناً أُلْزِمَا دِيَةَ الْيَدِ وَ لَا تُقْبَلُ شَهَادَتُهُمَا فِي الْآخَرِ ", "وَ إِنْ قَالَا إِنَّا تَعَمَّدْنَا قُطِعَ يَدُ أَحَدِهِمَا بِيَدِ الْمَقْطُوعِ وَ يُؤَدِّي الَّذِي لَمْ يُقْطَعْ رُبُعَ دِيَةِ الرَّجُلِ عَلَى أَوْلِيَاءِ الْمَقْطُوعِ الْيَدِ فَإِنْ قَالَ الْمَقْطُوعُ الْأَوَّلُ لَا أَرْضَى أَوْ تُقْطَعَ أَيْدِيهِمَا مَعاً رَدَّ دِيَةَ يَدٍ فَتُقْسَمُ بَيْنَهُمَا وَ تُقْطَعُ أَيْدِيهِمَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Al Mukhtar Bin Muhammad Bin Al Mukhtar and Muhammad Bin Al Hassan, from Abdullah Bin Al Hassan Al Alawy, bothe together from Al Fatah Bin Yazeed Al Jarjany, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding four who testified upon a man that he had committed adultery. So he was stoned. Then they retracted and said, ‘We had imagined’. (He<sup>asws</sup> said): ‘They would be necessitated the (payment of) wergild. And if they say, ‘We were deliberate’, whichever of the four the guardian of the killed one so desires to kill, and the three would paid three quarters of the wergild to the guardians of the second one killed, and the three would be whipped eighty (lashes), each one from them, then the Imam<sup>asws</sup> would kill them’. ", "And he<sup>asws</sup> said regarding two men who testified upon a man that he had stolen. So he (his hand) was cut. Then one of the two retracted and said, ‘I imagined it with regards to this, but it was someone else: ‘He would be necessitated (payment of) half the wergild of the hand, and his testimony with regards to the others would not be accepted. So if both of them were to retract and both say, ‘We imagined it, but so and so was the thief’, they would both be necessitated (payment of) the wergild of the hand and both their testimonies with regards to the others would not be acceptable. ", "And if both say, ‘We were deliberate’, the hand of one of the two would be cut by the one whose hand was cut, but the one whose (hand) was not cut would pay a quarter of the wergild to the guardians of the one whose hand was cut. So if the first one (whose hand was) cut says, ‘I am not pleased until the hands of both of them are to be cut together, he has to return the wergild of one hand to be divided between the two of them, and he can cut (hands of) both of them’."]}}]}, "index": "al-kafi:7:4:53", "kind": "verse_list"}