{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 55"
        },
        "path": "/books/al-kafi:7:4:55",
        "titles": {
          "ar": "باب النَّوَادِرِ",
          "en": "Chapter 55- The Miscellaneous"
        }
      }
    ],
    "index": 2211,
    "local_index": 55,
    "nav": {
      "prev": {
        "indexed_titles": {
          "en": "Chapter 54"
        },
        "path": "/books/al-kafi:7:4:54",
        "titles": {
          "ar": "باب فِيمَا يُصَابُ مِنَ الْبَهَائِمِ وَ غَيْرِهَا مِنَ الدَّوَابِّ",
          "en": "Chapter 54 – Regarding what is hit from the cattle and others from the animals"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:7:4",
        "titles": {
          "ar": "كِتَابُ الدِّيَاتِ",
          "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:4:55",
    "titles": {
      "ar": "باب النَّوَادِرِ",
      "en": "Chapter 55- The Miscellaneous"
    },
    "verse_count": 21,
    "verse_start_index": 14320,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 14321,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْحُسَيْنِ بْنِ يُوسُفَ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِي الْحَسَنِ الثَّانِي ( عليه السلام ) وَ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ وَ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ قَالَا سَأَلْنَا أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) عَنْ رَجُلٍ اسْتَغَاثَ بِهِ قَوْمٌ لِيُنْقِذَهُمْ مِنْ قَوْمٍ يُغِيرُونَ عَلَيْهِمْ لِيَسْتَبِيحُوا أَمْوَالَهُمْ وَ يَسْبُوا ذَرَارِيَّهُمْ",
          "فَخَرَجَ الرَّجُلُ يَعْدُو بِسِلَاحِهِ فِي جَوْفِ اللَّيْلِ لِيُغِيثَ الْقَوْمَ الَّذِينَ اسْتَغَاثُوا بِهِ فَمَرَّ بِرَجُلٍ قَائِمٍ عَلَى شَفِيرِ بِئْرٍ يَسْتَقِي مِنْهَا فَدَفَعَهُ وَ هُوَ لَا يُرِيدُ ذَلِكَ وَ لَا يَعْلَمُ فَسَقَطَ فِي الْبِئْرِ فَمَاتَ وَ مَضَى الرَّجُلُ فَاسْتَنْقَذَ أَمْوَالَ أُولَئِكَ الْقَوْمِ الَّذِينَ اسْتَغَاثُوا بِهِ ",
          "فَلَمَّا انْصَرَفَ إِلَى أَهْلِهِ قَالُوا لَهُ مَا صَنَعْتَ قَالَ قَدِ انْصَرَفَ الْقَوْمُ عَنْهُمْ وَ أَمِنُوا وَ سَلِمُوا قَالُوا لَهُ أَ شَعَرْتَ أَنَّ فُلَانَ بْنَ فُلَانٍ سَقَطَ فِي الْبِئْرِ فَمَاتَ قَالَ أَنَا وَ اللَّهِ طَرَحْتُهُ قِيلَ وَ كَيْفَ ذَلِكَ فَقَالَ إِنِّي خَرَجْتُ أَعْدُو بِسِلَاحِي فِي ظُلْمَةِ اللَّيْلِ وَ أَنَا أَخَافُ الْفَوْتَ عَلَى الْقَوْمِ الَّذِينَ اسْتَغَاثُوا بِي فَمَرَرْتُ بِفُلَانٍ وَ هُوَ قَائِمٌ يَسْتَقِي فِي الْبِئْرِ فَزَحَمْتُهُ وَ لَمْ أُرِدْ ذَلِكَ فَسَقَطَ فِي الْبِئْرِ فَمَاتَ فَعَلَى مَنْ دِيَةُ هَذَا ",
          "فَقَالَ دِيَتُهُ عَلَى الْقَوْمِ الَّذِينَ اسْتَنْجَدُوا الرَّجُلَ فَأَنْجَدَهُمْ وَ أَنْقَذَ أَمْوَالَهُمْ وَ نِسَاءَهُمْ وَ ذَرَارِيَّهُمْ أَمَا إِنَّهُ لَوْ كَانَ آجَرَ نَفْسَهُ بِأُجْرَةٍ لَكَانَتِ الدِّيَةُ عَلَيْهِ وَ عَلَى عَاقِلَتِهِ دُونَهُمْ وَ ذَلِكَ أَنَّ سُلَيْمَانَ بْنَ دَاوُدَ ( عليه السلام ) أَتَتْهُ امْرَأَةٌ عَجُوزٌ تَسْتَعْدِيهِ عَلَى الرِّيحِ فَقَالَتْ يَا نَبِيَّ اللَّهِ إِنِّي كُنْتُ قَائِمَةً عَلَى سَطْحٍ لِي وَ إِنَّ الرِّيحَ طَرَحَتْنِي مِنَ السَّطْحِ فَكَسَرَتْ يَدِي فَأَعْدِنِي عَلَى الرِّيحِ ",
          "فَدَعَا سُلَيْمَانُ بْنُ دَاوُدَ ( عليه السلام ) الرِّيحَ فَقَالَ لَهَا مَا دَعَاكِ إِلَى مَا صَنَعْتِ بِهَذِهِ الْمَرْأَةِ فَقَالَتْ صَدَقَتْ يَا نَبِيَّ اللَّهِ إِنَّ رَبَّ الْعِزَّةِ جَلَّ وَ عَزَّ بَعَثَنِي إِلَى سَفِينَةِ بَنِي فُلَانٍ لِأُنْقِذَهَا مِنَ الْغَرَقِ وَ قَدْ كَانَتْ أَشْرَفَتْ عَلَى الْغَرَقِ فَخَرَجْتُ فِي سَنَنِي وَ عَجَلَتِي إِلَى مَا أَمَرَنِي اللَّهُ عَزَّ وَ جَلَّ بِهِ فَمَرَرْتُ بِهَذِهِ الْمَرْأَةِ وَ هِيَ عَلَى سَطْحِهَا فَعَثَرْتُ بِهَا وَ لَمْ أُرِدْهَا فَسَقَطَتْ فَانْكَسَرَتْ يَدُهَا ",
          "قَالَ فَقَالَ سُلَيْمَانُ يَا رَبِّ بِمَا أَحْكُمُ عَلَى الرِّيحِ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا سُلَيْمَانُ احْكُمْ بِأَرْشِ كَسْرِ يَدِ هَذِهِ الْمَرْأَةِ عَلَى أَرْبَابِ السَّفِينَةِ الَّتِي أَنْقَذَتْهَا الرِّيحُ مِنَ الْغَرَقِ فَإِنَّهُ لَا يُظْلَمُ لَدَيَّ أَحَدٌ مِنَ الْعَالَمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al Husayn Bin Yusuf, from Muhammad Bin Suleyman, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 2<sup>nd</sup> and Muhammad Bin Ali, from Muhammad Bin Aslam, from Muhammad Bin Suleyman and Yunus Bin Abdul Rahman who both said, ‘We both asked Abu Al-Hassan Al-Reza<sup>asws</sup> about a man who was sought for help by a group of people to rescue them from a group of people who were attacking them, looting their wealth and capturing their children. ",
            "So the man went out prepared with his weapons, in the middle of the night in order to help the people who had sought his help, So (on the way) he passed by the brink of a well where someone was quenching himself from it. So he inadvertently pushed him, and he was not aware of that and did not know. So he fell into the well and died, and the man went (on his way). So he rescued the wealth of those people who had sought his help. ",
            "So when he went to his family, they said to him, ‘What did you do?’ He said, ‘I dispersed the people from them, and made them secure and safe’. They said to him, ‘Are you aware that so and so fell into the well, so he died?’ He said, ‘By Allah<sup>azwj</sup>! I tossed him’. It was said, ‘And how was that?’ So he said, ‘I went out prepared with my weapons in the darkness of the night, and I feared the death upon the people who had sought my help. So I passed by so and so, and he was standing quenching himself from the well. So I bumped into him, and I did not intend that. So he fell into the well, so he died. So upon whom is the wergild for this one?’ ",
            "So he<sup>asws</sup> said: ‘His wergild is upon the group which the man rescued. So he rescued them, and saved their wealth, and their womenfolk, and their children. But, had he employed himself with a wage (to be paid by the group he had saved), the wergild would have been upon himself, and upon his blood relatives, besides them; and that is that Suleyman Bin Dawood<sup>as</sup>, an old woman came over to him<sup>as</sup>, making a claim against the wind, so she said, ‘O Prophet<sup>as</sup> of Allah<sup>azwj</sup>! I was standing upon the roof of mine, and the wind pushed me from the roof, so my hand broke. Therefore, support me against the wind’. ",
            "So Suleyman Bin Dawood<sup>as</sup> called the wind over, so he<sup>as</sup> said to it: ‘What invited you what you did with this woman?’ So it said, ‘She speaks the truth, O Prophet<sup>as</sup> of Allah<sup>azwj</sup>! The Lord<sup>azwj</sup> of Honour, Mighty and Majestic had Sent me to a ship of the Clan of so and so, in order to rescue it from the drowning, and it had come close to the drowning. So I went out in my way, and my haste to what Allah<sup>azwj</sup> Mighty and Majestic had Commanded me with. So I passed by this woman, and she was upon her roof. So I bumped into her, and I did not intend her. So she fell and she broke her hand’. ",
            "He<sup>asws</sup> said: ‘So Suleyman Bin Dawood<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! With what shall I<sup>as</sup> judge with, upon the wind?’ So Allah<sup>azwj</sup> Mighty and Majestic Revealed upon him<sup>as</sup>: “O Suleyman<sup>as</sup>! Judge with the compensation of the breaking of the hand of this woman, upon the lords of the ship, which the wind rescued it from the drowning, for I<sup>azwj</sup> am not the least unjust to the claim of anyone from the worlds’."
          ]
        }
      },
      {
        "index": 14322,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:2",
        "text": [
          "عَنْهُ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ هَارُونَ بْنِ الْجَهْمِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) أَيُّمَا ظِئْرِ قَوْمٍ قَتَلَتْ صَبِيّاً لَهُمْ وَ هِيَ نَائِمَةٌ فَانْقَلَبَتْ عَلَيْهِ فَقَتَلَتْهُ فَإِنَّ عَلَيْهَا الدِّيَةَ مِنْ مَالِهَا خَاصَّةً إِنْ كَانَتْ إِنَّمَا ظَاءَرَتْ طَلَبَ الْعِزِّ وَ الْفَخْرِ وَ إِنْ كَانَتْ إِنَّمَا ظَاءَرَتْ مِنَ الْفَقْرِ فَإِنَّ الدِّيَةَ عَلَى عَاقِلَتِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Muhammad Bin Aslam, from Haroun Bin Al Jaham, from Muhammad Bin Muslim who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘Whichever wet-nurse of the people who kills a child of their whilst in her sleep, turning over upon it, so she kills it, then upon her is the wergild from her wealth in particular, if she was wet-nursing seeking the honour and the pride; and if she was rather wet-nursing out of poverty, so the wergild is upon her blood relatives’."
          ]
        }
      },
      {
        "index": 14323,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي الْعَبَّاسِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا لِلرَّجُلِ يُعَاقِبُ بِهِ مَمْلُوكَهُ فَقَالَ عَلَى قَدْرِ ذَنْبِهِ قَالَ فَقُلْتُ فَقَدْ عَاقَبْتَ حَرِيزاً بِأَعْظَمَ مِنْ جُرْمِهِ فَقَالَ وَيْلَكَ هُوَ مَمْلُوكٌ لِي وَ إِنَّ حَرِيزاً شَهَرَ السَّيْفَ وَ لَيْسَ مِنِّي مَنْ شَهَرَ السَّيْفَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, from Abu Al Abbas who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is for the man he can punish his slave with?’ So he<sup>asws</sup> said: ‘Upon the measurement of his sin’. So I said, ‘So I have punished Hareza with greater than his offence’. So he<sup>asws</sup> said: ‘Woe be unto you! He was a slave of mine<sup>asws</sup>, and Hareyz brandished the sword, and the one who brandishes the sword is not from me<sup>asws</sup>’."
          ]
        }
      },
      {
        "index": 14324,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ كَانَتْ فِي زَمَنِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) امْرَأَةٌ صِدْقٌ يُقَالُ لَهَا أُمُّ قَيَّانَ فَأَتَاهَا رَجُلٌ مِنْ أَصْحَابِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَسَلَّمَ عَلَيْهَا قَالَ فَرَآهَا مُهْتَمَّةً فَقَالَ لَهَا مَا لِي أَرَاكِ مُهْتَمَّةً فَقَالَتْ مَوْلَاةٌ لِي دَفَنْتُهَا فَنَبَذَتْهَا الْأَرْضُ مَرَّتَيْنِ ",
          "فَدَخَلْتُ عَلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَأَخْبَرْتُهُ فَقَالَ إِنَّ الْأَرْضَ لَتَقْبَلُ الْيَهُودِيَّ وَ النَّصْرَانِيَّ فَمَا لَهَا إِلَّا أَنْ تَكُونَ تُعَذِّبُ بِعَذَابِ اللَّهِ ثُمَّ قَالَ أَمَا إِنَّهُ لَوْ أُخِذَتْ تُرْبَةٌ مِنْ قَبْرِ رَجُلٍ مُسْلِمٍ فَأُلْقِيَ عَلَى قَبْرِهَا لَقَرَّتْ ",
          "قَالَ فَأَتَيْتُ أُمَّ قَيَّانَ فَأَخْبَرْتُهَا فَأَخَذُوا تُرْبَةً مِنْ قَبْرِ رَجُلٍ مُسْلِمٍ فَأُلْقِيَ عَلَى قَبْرِهَا فَقَرَّتْ فَسَأَلْتُ عَنْهَا مَا كَانَتْ حَالُهَا فَقَالُوا كَانَتْ شَدِيدَةَ الْحُبِّ لِلرِّجَالِ لَا تَزَالُ قَدْ وَلَدَتْ فَأَلْقَتْ وَلَدَهَا فِي التَّنُّورِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Ibrahim Bin Abu Al Balad, from one of his companions, raising it, said, ",
            "‘There was a truthful woman in the era of Amir Al-Momineen<sup>asws</sup> called Umm Qayyan. So, a man from the companions of Amir Al-Momineen<sup>asws</sup> came over to her, so he greeted her. He saw her as worried, so he said to her, ‘What is the matter I see you to be worried?’ So she said, ‘I buried a slave girl of mine, but the earth rejected her twice’. ",
            "So I went over to Amir Al-Momineen<sup>asws</sup> and informed him<sup>asws</sup> of it, so he<sup>asws</sup> said: ‘The earth accepts the Jews and the Christian, so what is for her except that she is being Punished by the Punishment of Allah<sup>azwj</sup>’. Then he<sup>asws</sup> said: ‘If she were to take the sand from a grave of a Muslim man, so let her throw it upon her grave, in order to calm it’. ",
            "He (the narrator) said, ‘So I went over to Umm Qayyan and informed her of it. So she took some sand from a grave of a Muslim man, so she threw it upon her grave. So it settled. So I asked (people) about her, what her situation used to be, so they said, ‘She used to intensely love the man. She would not stop giving birth, so she used to throw her children into the oven (to kill them)’."
          ]
        }
      },
      {
        "index": 14325,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ النَّبِيَّ ( صلى الله عليه وآله ) كَانَ يَحْبِسُ فِي تُهَمَةِ الدَّمِ سِتَّةَ أَيَّامٍ فَإِنْ جَاءَ أَوْلِيَاءُ الْمَقْتُولِ بِبَيِّنَةٍ وَ إِلَّا خَلَّى سَبِيلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that the Prophet<sup>saww</sup> used to imprison for six days with regards to the one (who was) accused of the blood (killing). So if the guardians of the killed-one were to come over (to seek blood money), or else he<sup>saww</sup> would release his way’."
          ]
        }
      },
      {
        "index": 14326,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ إِذَا مَاتَ وَلِيُّ الْمَقْتُولِ قَامَ وَلَدُهُ مِنْ بَعْدِهِ مَقَامَهُ بِالدَّمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, from one of our companions, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘When a guardian of the killed-one dies, his son stands from after him in his place, with the blood (wergild)’."
          ]
        }
      },
      {
        "index": 14327,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:7",
        "refs": {
          "Mentions": [
            "/books/quran:17:33"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فِي كِتَابِهِ وَ مَنْ قُتِلَ مَظْلُوماً فَقَدْ جَعَلْنا لِوَلِيِّهِ سُلْطاناً فَلا يُسْرِفْ فِي الْقَتْلِ إِنَّهُ كانَ مَنْصُوراً فَمَا هَذَا الْإِسْرَافُ الَّذِي نَهَى اللَّهُ عَزَّ وَ جَلَّ عَنْهُ قَالَ نَهَى أَنْ يَقْتُلَ غَيْرَ قَاتِلِهِ أَوْ يُمَثِّلَ بِالْقَاتِلِ ",
          "قُلْتُ فَمَا مَعْنَى قَوْلِهِ إِنَّهُ كانَ مَنْصُوراً قَالَ وَ أَيُّ نُصْرَةٍ أَعْظَمُ مِنْ أَنْ يُدْفَعَ الْقَاتِلُ إِلَى أَوْلِيَاءِ الْمَقْتُولِ فَيَقْتُلَهُ وَ لَا تَبِعَةَ تَلْزَمُهُ مِنْ قَتْلِهِ فِي دِينٍ وَ لَا دُنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from one of his companions, from Muhammad Bin Suleyman, from Sayf Bin Umeyra, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup> that Allah<sup>azwj</sup> Mighty and Majestic is Saying in His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h33\">[17:33]</a> And do not kill any one whom Allah has Forbidden, except with the right; and whoever is killed unjustly, We have indeed Given to his heir authority, so let him not be excessive with regards to the killing; surely he would always be Aided</span>. So what is this excessiveness which Allah<sup>azwj</sup> Mighty and Majestic has Forbidden from?’ He<sup>asws</sup> said: ‘Forbidden that he should kill anyone other than his killer, or dismembering the killer’. ",
            "I said, ‘So what is the Meaning of His<sup>azwj</sup> Words <span class=\"ibTxt\">surely he would always be Aided</span>. He<sup>asws</sup> said: ‘And which Aid is greater than that the killer should be handed over to the guardians of the killed-one, so they can kill him and there would be no follow-up (consequences) from killing him (the killer), neither in Religion nor in the world’."
          ]
        }
      },
      {
        "index": 14328,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ دَخَلَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) الْمَسْجِدَ فَاسْتَقْبَلَهُ شَابٌّ يَبْكِي وَ حَوْلَهُ قَوْمٌ يُسْكِتُونَهُ فَقَالَ عَلِيٌّ ( عليه السلام ) مَا أَبْكَاكَ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ شُرَيْحاً قَضَى عَلَيَّ بِقَضِيَّةٍ مَا أَدْرِي مَا هِيَ إِنَّ هَؤُلَاءِ النَّفَرَ خَرَجُوا بِأَبِي مَعَهُمْ فِي السَّفَرِ فَرَجَعُوا وَ لَمْ يَرْجِعْ أَبِي فَسَأَلْتُهُمْ عَنْهُ فَقَالُوا مَاتَ فَسَأَلْتُهُمْ عَنْ مَالِهِ فَقَالُوا مَا تَرَكَ مَالًا فَقَدَّمْتُهُمْ إِلَى شُرَيْحٍ فَاسْتَحْلَفَهُمْ وَ قَدْ عَلِمْتُ يَا أَمِيرَ الْمُؤْمِنِينَ أَنَّ أَبِي خَرَجَ وَ مَعَهُ مَالٌ كَثِيرٌ",
          "فَقَالَ لَهُمْ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) ارْجِعُوا فَرَجَعُوا وَ الْفَتَى مَعَهُمْ إِلَى شُرَيْحٍ فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَا شُرَيْحُ كَيْفَ قَضَيْتَ بَيْنَ هَؤُلَاءِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ ادَّعَى هَذَا الْفَتَى عَلَى هَؤُلَاءِ النَّفَرِ أَنَّهُمْ خَرَجُوا فِي سَفَرٍ وَ أَبُوهُ مَعَهُمْ فَرَجَعُوا وَ لَمْ يَرْجِعْ أَبُوهُ فَسَأَلْتُهُمْ عَنْهُ فَقَالُوا مَاتَ فَسَأَلْتُهُمْ عَنْ مَالِهِ فَقَالُوا مَا خَلَّفَ مَالًا فَقُلْتُ لِلْفَتَى هَلْ لَكَ بَيِّنَةٌ عَلَى مَا تَدَّعِي فَقَالَ لَا فَاسْتَحْلَفْتُهُمْ فَحَلَفُوا",
          "فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) هَيْهَاتَ يَا شُرَيْحُ هَكَذَا تَحْكُمُ فِي مِثْلِ هَذَا فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ فَكَيْفَ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ اللَّهِ لَأَحْكُمَنَّ فِيهِمْ بِحُكْمٍ مَا حَكَمَ بِهِ خَلْقٌ قَبْلِي إِلَّا دَاوُدُ النَّبِيُّ ( عليه السلام ) يَا قَنْبَرُ ادْعُ لِي شُرْطَةَ الْخَمِيسِ فَدَعَاهُمْ فَوَكَّلَ بِكُلِّ رَجُلٍ مِنْهُمْ رَجُلًا مِنَ الشُّرْطَةِ ثُمَّ نَظَرَ إِلَى وُجُوهِهِمْ فَقَالَ مَا ذَا تَقُولُونَ أَ تَقُولُونَ إِنِّي لَا أَعْلَمُ مَا صَنَعْتُمْ بِأَبِي هَذَا الْفَتَى إِنِّي إِذاً لَجَاهِلٌ ثُمَّ قَالَ فَرِّقُوهُمْ وَ غَطُّوا رُءُوسَهُمْ",
          "قَالَ فَفُرِّقَ بَيْنَهُمْ وَ أُقِيمَ كُلُّ رَجُلٍ مِنْهُمْ إِلَى أُسْطُوَانَةٍ مِنْ أَسَاطِينِ الْمَسْجِدِ وَ رُءُوسُهُمْ مُغَطَّاةٌ بِثِيَابِهِمْ ثُمَّ دَعَا بِعُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ كَاتِبِهِ فَقَالَ هَاتِ صَحِيفَةً وَ دَوَاةً وَ جَلَسَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ فِي مَجْلِسِ الْقَضَاءِ وَ جَلَسَ النَّاسُ إِلَيْهِ فَقَالَ لَهُمْ إِذَا أَنَا كَبَّرْتُ فَكَبِّرُوا ثُمَّ قَالَ لِلنَّاسِ اخْرُجُوا ثُمَّ دَعَا بِوَاحِدٍ مِنْهُمْ فَأَجْلَسَهُ بَيْنَ يَدَيْهِ وَ كَشَفَ عَنْ وَجْهِهِ ثُمَّ قَالَ لِعُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ اكْتُبْ إِقْرَارَهُ وَ مَا يَقُولُ",
          "ثُمَّ أَقْبَلَ عَلَيْهِ بِالسُّؤَالِ فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي أَيِّ يَوْمٍ خَرَجْتُمْ مِنْ مَنَازِلِكُمْ وَ أَبُو هَذَا الْفَتَى مَعَكُمْ فَقَالَ الرَّجُلُ فِي يَوْمِ كَذَا وَ كَذَا قَالَ وَ فِي أَيِّ شَهْرٍ قَالَ فِي شَهْرِ كَذَا وَ كَذَا قَالَ فِي أَيِّ سَنَةٍ قَالَ فِي سَنَةِ كَذَا وَ كَذَا قَالَ وَ إِلَى أَيْنَ بَلَغْتُمْ فِي سَفَرِكُمْ حَتَّى مَاتَ أَبُو هَذَا الْفَتَى قَالَ إِلَى مَوْضِعِ كَذَا وَ كَذَا قَالَ وَ فِي مَنْزِلِ مَنْ مَاتَ قَالَ فِي مَنْزِلِ فُلَانِ بْنِ فُلَانٍ قَالَ وَ مَا كَانَ مَرَضُهُ قَالَ كَذَا وَ كَذَا قَالَ وَ كَمْ يَوْماً مَرِضَ قَالَ كَذَا وَ كَذَا قَالَ فَفِي أَيِّ يَوْمٍ مَاتَ وَ مَنْ غَسَّلَهُ وَ مَنْ كَفَّنَهُ وَ بِمَا كَفَّنْتُمُوهُ وَ مَنْ صَلَّى عَلَيْهِ وَ مَنْ نَزَلَ قَبْرَهُ",
          "فَلَمَّا سَأَلَهُ عَنْ جَمِيعِ مَا يُرِيدُ كَبَّرَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ كَبَّرَ النَّاسُ جَمِيعاً فَارْتَابَ أُولَئِكَ الْبَاقُونَ وَ لَمْ يَشُكُّوا أَنَّ صَاحِبَهُمْ قَدْ أَقَرَّ عَلَيْهِمْ وَ عَلَى نَفْسِهِ فَأَمَرَ أَنْ يُغَطَّى رَأْسُهُ وَ يُنْطَلَقَ بِهِ إِلَى السِّجْنِ",
          "ثُمَّ دَعَا بِآخَرَ فَأَجْلَسَهُ بَيْنَ يَدَيْهِ وَ كَشَفَ عَنْ وَجْهِهِ ثُمَّ قَالَ كَلَّا زَعَمْتُمْ أَنِّي لَا أَعْلَمُ مَا صَنَعْتُمْ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ مَا أَنَا إِلَّا وَاحِدٌ مِنَ الْقَوْمِ وَ لَقَدْ كُنْتُ كَارِهاً لِقَتْلِهِ فَأَقَرَّ ثُمَّ دَعَا بِوَاحِدٍ بَعْدَ وَاحِدٍ كُلُّهُمْ يُقِرُّ بِالْقَتْلِ وَ أَخْذِ الْمَالِ ثُمَّ رَدَّ الَّذِي كَانَ أَمَرَ بِهِ إِلَى السِّجْنِ فَأَقَرَّ أَيْضاً فَأَلْزَمَهُمُ الْمَالَ وَ الدَّمَ",
          "فَقَالَ شُرَيْحٌ يَا أَمِيرَ الْمُؤْمِنِينَ وَ كَيْفَ حَكَمَ دَاوُدُ النَّبِيُّ ( عليه السلام ) فَقَالَ إِنَّ دَاوُدَ النَّبِيَّ ( عليه السلام ) مَرَّ بِغِلْمَةٍ يَلْعَبُونَ وَ يُنَادُونَ بَعْضَهُمْ بِيَا مَاتَ الدِّينُ فَيُجِيبُ مِنْهُمْ غُلَامٌ فَدَعَاهُمْ دَاوُدُ ( عليه السلام ) فَقَالَ يَا غُلَامُ مَا اسْمُكَ قَالَ مَاتَ الدِّينُ فَقَالَ لَهُ دَاوُدُ ( عليه السلام ) مَنْ سَمَّاكَ بِهَذَا الِاسْمِ فَقَالَ أُمِّي",
          "فَانْطَلَقَ دَاوُدُ ( عليه السلام ) إِلَى أُمِّهِ فَقَالَ لَهَا يَا أَيَّتُهَا الْمَرْأَةُ مَا اسْمُ ابْنِكِ هَذَا قَالَتْ مَاتَ الدِّينُ فَقَالَ لَهَا وَ مَنْ سَمَّاهُ بِهَذَا قَالَتْ أَبُوهُ قَالَ وَ كَيْفَ كَانَ ذَاكِ قَالَتْ إِنَّ أَبَاهُ خَرَجَ فِي سَفَرٍ لَهُ وَ مَعَهُ قَوْمٌ وَ هَذَا الصَّبِيُّ حَمْلٌ فِي بَطْنِي فَانْصَرَفَ الْقَوْمُ وَ لَمْ يَنْصَرِفْ زَوْجِي فَسَأَلْتُهُمْ عَنْهُ فَقَالُوا مَاتَ فَقُلْتُ لَهُمْ فَأَيْنَ مَا تَرَكَ قَالُوا لَمْ يُخَلِّفْ شَيْئاً فَقُلْتُ هَلْ أَوْصَاكُمْ بِوَصِيَّةٍ قَالُوا نَعَمْ زَعَمَ أَنَّكِ حُبْلَى فَمَا وَلَدْتِ مِنْ وَلَدٍ جَارِيَةٍ أَوْ غُلَامٍ فَسَمِّيهِ مَاتَ الدِّينُ فَسَمَّيْتُهُ ",
          "قَالَ دَاوُدُ ( عليه السلام ) وَ تَعْرِفِينَ الْقَوْمَ الَّذِينَ كَانُوا خَرَجُوا مَعَ زَوْجِكِ قَالَتْ نَعَمْ قَالَ فَأَحْيَاءٌ هُمْ أَمْ أَمْوَاتٌ قَالَتْ بَلْ أَحْيَاءٌ قَالَ فَانْطَلِقِي بِنَا إِلَيْهِمْ ثُمَّ مَضَى مَعَهَا فَاسْتَخْرَجَهُمْ مِنْ مَنَازِلِهِمْ فَحَكَمَ بَيْنَهُمْ بِهَذَا الْحُكْمِ بِعَيْنِهِ وَ أَثْبَتَ عَلَيْهِمُ الْمَالَ وَ الدَّمَ وَ قَالَ لِلْمَرْأَةِ سَمِّي ابْنَكِ هَذَا عَاشَ الدِّينُ ثُمَّ إِنَّ الْفَتَى ",
          "وَ الْقَوْمَ اخْتَلَفُوا فِي مَالِ الْفَتَى كَمْ كَانَ فَأَخَذَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) خَاتَمَهُ وَ جَمِيعَ خَوَاتِيمِ مَنْ عِنْدَهُ ثُمَّ قَالَ أَجِيلُوا هَذَا السِّهَامَ فَأَيُّكُمْ أَخْرَجَ خَاتَمِي فَهُوَ صَادِقٌ فِي دَعْوَاهُ لِأَنَّهُ سَهْمُ اللَّهِ وَ سَهْمُ اللَّهِ لَا يَخِيبُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup> entered the Masjid, so a young man came across him crying, and around him was a group calming him down. So Ali<sup style=\"font-weight: normal\">asws</sup> said: ‘What makes you weep?’ So he said, ‘O Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup>! Shurayh judged upon me with a judgement, I do not know what it is. These persons went out with my father being with them in a journey. So they came back, and my father did not return. So I asked them about him. So they said, ‘he died’. So I asked them about his wealth. So they said, ‘He did not leave any wealth’. So I proceeded with them to Shurayh. So he made them swear oaths; and I know well, O Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup>, that my father went out, and with him was a lot of wealth.",
            "So Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup> said to them: ‘Return to Shurayh, and the youth was with them. So Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup> said to him: ‘O Shurayh! How did you judge between these people?’ So he said, ‘O Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup>! This youth claimed against these persons that they had gone out in a journey, and his father was with them. So they returned, and his father did not return. So he asked them about him, so they said, ‘Died’. So he asked them about his wealth, so they said, ‘He did not leave behind any wealth’. So I said to the youth, ‘Is there any evidence with you upon what you are claiming?’ So he said, ‘No’. So I made them swear an oath, so they oathed’.",
            "So Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup> said: ‘Far be it! O Shurayh, is it like this that you judge for the likes of this?’ So he said, ‘O Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup>! So how?’ So Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup> said: ‘By Allah<sup style=\"font-weight: normal\">azwj</sup>! I<sup style=\"font-weight: normal\">asws</sup> shall not be judging regarding them with a judgement what a creature before me<sup style=\"font-weight: normal\">asws</sup> has judged with except for the Prophet Dawood<sup style=\"font-weight: normal\">as</sup>. O Qanbar! Call the thursday policemen for me!’ So he called them over. So he<sup style=\"font-weight: normal\">asws</sup> allocated with each men from them, with a man from the police. Then he<sup style=\"font-weight: normal\">asws</sup> looked at their faces, so he<sup style=\"font-weight: normal\">asws</sup> said; ‘What is that which you are saying? Are you saying that I<sup style=\"font-weight: normal\">asws</sup> do not know what you have done with the father of this youth, that I<sup style=\"font-weight: normal\">asws</sup> am ignorant?’ Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘Separate them and cover their heads!’. ",
            "He (Abu Ja’far<sup style=\"font-weight: normal\">asws</sup>) said: ‘So he<sup style=\"font-weight: normal\">asws</sup> separated them and stood each one of the man from them to a pillar from the pillars of the Masjid, and their head were covered by their own clothes. Then he called for Ubeydullah Bin Abu Rafi’e, his<sup style=\"font-weight: normal\">asws</sup> scribe. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Give me a parchment, and ink’. And Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup> sat in the seat of the judges, and the people sat facing him<sup style=\"font-weight: normal\">asws</sup>. So he<sup style=\"font-weight: normal\">asws</sup> said to them: ‘When I<sup style=\"font-weight: normal\">asws</sup> exclaim (Takbeer) so you all exclaim (as well)’. Then he<sup style=\"font-weight: normal\">asws</sup> said to the people: ‘Go out’. Then he called one of them, so he<sup style=\"font-weight: normal\">asws</sup> made him sit in front of him<sup style=\"font-weight: normal\">asws</sup>, and uncovered his face. Then he<sup style=\"font-weight: normal\">asws</sup> said to Ubeydullah Bin Abu Rafi’e: ‘Write down his confession and whatever he is saying’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> faced him with the questioning, so Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup> said: ‘In which day did you all go from your houses, and the father of this youth was with you?’ So the man said, ‘In such and such a day’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘And in which month?’ He said, ‘In such a such a month’. He<sup style=\"font-weight: normal\">asws</sup> said; ‘In which year?’ He said, ‘In such a such a year’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘And to where did you reach in your journey until the father of this youth died?’ He said, ‘To such and such a place’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘And in whose house did he died?’ He said, ‘In the house of so and so, son of so and so’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘And what was his illness?’ He said, ‘Such and such’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘And for how many days was he ill?’ He said, ‘For such and such number of days’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘And in which day did he die? And who washed him? And who shrouded him? And with what did you shroud him with? And who Prayed over him? And who descended into his grave?’",
            "So when he<sup style=\"font-weight: normal\">asws</sup> had questioned him about the entired of what he<sup style=\"font-weight: normal\">asws</sup> had intended to, Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup> exclaimed (<span class=\"iTxt\">Takbeer</span>), and the people exclaimed altogether. So the remaining ones (accused) suspected that did not doubt that their companion had confessed against them, and against himself. So he<sup style=\"font-weight: normal\">asws</sup> ordered for his head to be covered and be taken to the prison.  ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> called for the other one and made him to sit in front of him<sup style=\"font-weight: normal\">asws</sup>, and uncovered (the covering) from his face, then said: ‘All of you are thinking that I<sup style=\"font-weight: normal\">asws</sup> do not know what you have done’. So he said, ‘O Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup>! I was not except one of a group, and I had detested his killing. So he confessed. Then he called for one after the other. All of them confessted with the killing, and he<sup style=\"font-weight: normal\">asws</sup> seized the wealth, then returned the one he<sup style=\"font-weight: normal\">asws</sup> had ordered to be in the prison. So he confessed as well. So he<sup style=\"font-weight: normal\">asws</sup> necessitated upon them the wealth and the blood’.",
            "So Shurayh said, ‘O Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup>! And how was the judgement of the Prophet Dawood<sup style=\"font-weight: normal\">as</sup>?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘The Prophet Dawood<sup style=\"font-weight: normal\">as</sup> passed by boys who were playing and one of them called out, O Maat Al-Deen’ (O Religion is dead)!’ So a boy from them responded. So Dawood<sup style=\"font-weight: normal\">as</sup> called him over and said: ‘O boy! What is your name?’ He said, ‘Maat Al-Deen’. So Dawood<sup style=\"font-weight: normal\">as</sup> said to him: ‘Who has named you with this name?’ So he said, ‘My mother’.",
            "So Dawood went with him to his mother, so he<sup>as</sup> said to her: ‘O you woman! What is the name of this son of yours?’ She said, ‘Maat Al-Deen’. So he<sup>as</sup> said to her: ‘And who named him with this name?’ She said, ‘His father’. He<sup>as</sup> said: ‘And how was that’. She said, ‘His father had gone out in a journey of his and with him was a group, and this is the boy whom I was carrying in my belly. So the group left and my husband did not. So I asked them about him, so they said, ‘Died’. So I said to them, ‘What did he leave?’ They said, ‘He did not leave anything’. So I said, ‘Did he bequeath you all with a bequest?’ They said, ‘Yes. He claimed that you were pregnant, so whatever is born, a girl or a boy, so name him Maat Al-Deen. So I named him’ (like that after his birth). ",
            "Dawood<sup>as</sup> said: ‘And would you recognise the people who had gone out with your husband?’ She said, ‘Yes’. He<sup>as</sup> said: ‘So are they alive, or dead?’ She said, ‘But, (they are) alive’. He<sup>as</sup> said: ‘So come with us to them’. So he<sup>as</sup> went with her and made them come out from their houses. So he<sup>as</sup> judged between them with this judgement, exactly, and established against them the wealth, and the blood, and said to the woman: ‘Name this son of yours ‘Aash Al-Deen (Religion is alive)’. ",
            "And the people differed with regards to the wealth of the youth, how much it was, so Amir Al-Momineen<sup>asws</sup> took his<sup>asws</sup> ring and the all of the rings from his<sup>asws</sup> presence (from people), then said: ‘Make these as the arrows, so whichever one of you extracts my<sup>asws</sup> ring, so he is truthful in his claim, because it is a divination of Allah<sup>azwj</sup>, and the divination of Allah<sup>azwj</sup> is not unsuccessful’."
          ]
        }
      },
      {
        "index": 14329,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ إِسْحَاقَ بْنِ إِبْرَاهِيمَ الْكِنْدِيِّ قَالَ حَدَّثَنَا خَالِدٌ النَّوْفَلِيُّ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ قَالَ لَقَدْ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَاسْتَقْبَلَهُ شَابٌّ يَبْكِي وَ حَوْلَهُ قَوْمٌ يُسْكِتُونَهُ فَلَمَّا رَأَى أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ شُرَيْحاً قَضَى عَلَيَّ قَضِيَّةً مَا أَدْرِي مَا هِيَ فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَا هِيَ فَقَالَ الشَّابُّ إِنَّ هَؤُلَاءِ النَّفَرَ خَرَجُوا بِأَبِي مَعَهُمْ فِي سَفَرٍ فَرَجَعُوا وَ لَمْ يَرْجِعْ فَسَأَلْتُهُمْ عَنْهُ فَقَالُوا مَاتَ فَسَأَلْتُهُمْ عَنْ مَالِهِ فَقَالُوا مَا تَرَكَ مَالًا فَقَدَّمْتُهُمْ إِلَى شُرَيْحٍ فَاسْتَحْلَفَهُمْ وَ قَدْ عَلِمْتُ أَنَّ أَبِي خَرَجَ وَ مَعَهُ مَالٌ كَثِيرٌ ",
          "فَقَالَ لَهُمْ ارْجِعُوا فَرَجَعُوا وَ عَلِيٌّ ( عليه السلام ) يَقُولُ .أَوْرَدَهَا سَعْدٌ وَ سَعْدٌ يَشْتَمِلُ مَا هَكَذَا تُورَدُ يَا سَعْدُ الْإِبِلُ مَا يُغْنِي قَضَاؤُكَ يَا شُرَيْحُ ثُمَّ قَالَ وَ اللَّهِ لَأَحْكُمَنَّ فِيهِمْ بِحُكْمٍ مَا حَكَمَ أَحَدٌ قَبْلِي إِلَّا دَاوُدُ النَّبِيُّ ( عليه السلام ) يَا قَنْبَرُ ادْعُ لِي شُرْطَةَ الْخَمِيسِ قَالَ فَدَعَا شُرْطَةَ الْخَمِيسِ فَوَكَّلَ بِكُلِّ رَجُلٍ مِنْهُمْ رَجُلًا مِنَ الشُّرْطَةِ ثُمَّ دَعَا بِهِمْ فَنَظَرَ إِلَى وُجُوهِهِمْ ثُمَّ ذَكَرَ مِثْلَ حَدِيثِ الْأَوَّلِ إِلَى قَوْلِهِ سَمِّي ابْنَكِ هَذَا عَاشَ الدِّينُ ",
          "فَقُلْتُ جُعِلْتُ فِدَاكَ كَيْفَ تَأْخُذُهُمْ بِالْمَالِ إِنِ ادَّعَى الْغُلَامُ أَنَّ أَبَاهُ خَلَّفَ مِائَةَ أَلْفٍ أَوْ أَقَلَّ أَوْ أَكْثَرَ وَ قَالَ الْقَوْمُ لَا بَلْ عَشَرَةَ آلَافٍ أَوْ أَقَلَّ أَوْ أَكْثَرَ فَلِهَؤُلَاءِ قَوْلٌ وَ لِهَذَا قَوْلٌ قَالَ فَإِنِّي آخُذُ خَاتَمَهُ وَ خَوَاتِيمَهُمْ وَ أُلْقِيهَا فِي مَكَانٍ وَاحِدٍ ثُمَّ أَقُولُ أَجِيلُوا هَذِهِ السِّهَامَ فَأَيُّكُمْ خَرَجَ سَهْمُهُ فَهُوَ الصَّادِقُ فِي دَعْوَاهُ لِأَنَّهُ سَهْمُ اللَّهِ وَ سَهْمُ اللَّهِ لَا يَخِيبُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Is’haq Bin Ibrahim Al Kindy, from Khalid Al Nowfaly, from Al Asbagh Bin Nubata who said, ",
            "‘Amir Al-Momineen<sup>asws</sup> had judged, and a youth came across him<sup>asws</sup> and he was weeping, and round him was a group calming him. So when he saw Amir Al-Momineen<sup>asws</sup>, he said, ‘O Amir Al-Momineen<sup>asws</sup>! Shuray (the judge) has judged upon me with a judgement, I do not know what it is’. So Amir Al-Momineen<sup>asws</sup> said to him: ‘What is it?’ So the youth said, ‘These persons went out with my father being with them, in a journey. So they returned and he did not return. So I asked them about him, so they said, ‘Died’. So I asked them about his wealth, so they said, ‘He did not leave any wealth’. So I proceeded with them to Shurayh. He made them swear oaths, and I know that my father went out and with him was a lot of wealth’. ",
            "So he<sup>asws</sup> said to them: ‘Return!’ So they returned, and Ali<sup>asws</sup> was saying: ‘(A proverb) ‘Sa’ad ushered them and Sa’ad incorporated them. It is not like this you should be ushering the camels, O Sa’ad’. Your judgement did not suffice them, O Shurayh’. Then he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> shall judge among them with a judgement, which no one has judged by before me<sup>asws</sup> except for the Prophet Dawood<sup>as</sup>. O Qanbar! Call the Thursday policemen for me’. So he called over the Thursday police and he<sup>asws</sup> allocated with each man from them with a man from the police. Then he called for them and looked at their faces’ – then he (the narrator) mentioned a Hadeeth similar to the first one, until his (Prophet Dawood<sup>as</sup>’s) words: ‘Name this son of your Aash Al-Islam (Religion is alive)’.",
            "So I said, ‘May I be sacrificed for you<sup>asws</sup>! How did he<sup>as</sup> seize them with the wealth, if the boy claimed that his father left behind one hundred thousand, or less, or more, and the group said, ‘No, but it was ten thousand’, or less or more. So for them would be their word, and for this one would be his word’. He<sup>asws</sup> said: ‘So I<sup>asws</sup> would take his ring and their rings and throw them in one place. Then I<sup>asws</sup> would be saying: ‘Make these to be the arrows. So whichever one of you extract his right, so he is the truthful in his claim because it is a divination of Allah<sup>azwj</sup>, and a divination of Allah<sup>azwj</sup> is not unsuccessful’."
          ]
        }
      },
      {
        "index": 14330,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ خَرَجَ رَجُلٌ مِنَ الْمَدِينَةِ يُرِيدُ الْعِرَاقَ فَأَتْبَعَهُ أَسْوَدَانِ أَحَدُهُمَا غُلَامٌ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَلَمَّا أَتَى الْأَعْوَصَ نَامَ الرَّجُلُ فَأَخَذَا صَخْرَةً فَشَدَخَا بِهَا رَأْسَهُ فَأُخِذَا فَأُتِيَ بِهِمَا مُحَمَّدُ بْنُ خَالِدٍ وَ جَاءَ أَوْلِيَاءُ الْمَقْتُولِ فَسَأَلُوهُ أَنْ يُقِيدَهُمْ فَكَرِهَ أَنْ يَفْعَلَ فَسَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَلِكَ فَلَمْ يُجِبْهُ ",
          "قَالَ عَبْدُ الرَّحْمَنِ فَظَنَنْتُ أَنَّهُ كَرِهَ أَنْ يُجِيبَهُ لِأَنَّهُ لَا يَرَى أَنْ يُقْتَلَ اثْنَانِ بِوَاحِدٍ فَشَكَا أَوْلِيَاءُ الْمَقْتُولِ مُحَمَّدَ بْنَ خَالِدٍ وَ صَنِيعَهُ إِلَى أَهْلِ الْمَدِينَةِ فَقَالَ لَهُمْ أَهْلُ الْمَدِينَةِ إِنْ أَرَدْتُمْ أَنْ يُقِيدَكُمْ مِنْهُ فَاتَّبِعُوا جَعْفَرَ بْنَ مُحَمَّدٍ ( عليه السلام ) فَاشْكُوا إِلَيْهِ ظُلَامَتَكُمْ ",
          "فَفَعَلُوا فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَقِدْهُمْ فَلَمَّا أَنْ دَعَاهُمْ لِيُقِيدَهُمْ اسْوَدَّ وَجْهُ غُلَامِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) حَتَّى صَارَ كَأَنَّهُ الْمِدَادُ فَذُكِرَ ذَلِكَ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالُوا أَصْلَحَكَ اللَّهُ إِنَّهُ لَمَّا قُدِّمَ لِيُقْتَلَ اسْوَدَّ وَجْهُهُ حَتَّى صَارَ كَأَنَّهُ الْمِدَادُ فَقَالَ إِنَّهُ كَانَ يَكْفُرُ بِاللَّهِ جَهْرَةً فَقُتِلَا جَمِيعاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Safwan Bin Yahya, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘A man went out from Al-Medina intending for Al-Iraq. So two black men followed him, one of them being a slave of Abu Abdullah<sup>asws</sup>. So when he came to Al-Aws, the man slept. So they both took a rock and cracked his head with it. So they were both seized, and Muhammad Bin Khalid came with them both, and the guardians of the killed-one came over and asked him for the retaliation, but he did not like that to be done. So Abu Abdullah<sup>asws</sup> was asked about that, but he<sup>asws</sup> did not answer him. ",
            "Abdul Rahman said, ‘So I guessed that he<sup>asws</sup> did not like answering him because he<sup>asws</sup> did not view that two should be killed for one. So the guardians of the killed-one complained of Muhammad Bin Khalid and his dealings, to the people of Al-Medina. So the people of Al-Medina said to him, ‘If you intend the retaliation from him, so follow Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>. So complain to him<sup>asws</sup> of your grievances. ",
            "So they did it. So Abu Abdullah<sup>asws</sup> said: 'Retaliate them’. So when they called them over for their retaliation, the face of the slave of Abu Abdullah<sup>asws</sup> turned black until it became as if it was the ink. So that was mentioned to Abu Abdullah<sup>asws</sup>, so they said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! When he was brought forward to be killed, his face blackened until it became as if it was the ink’. So he<sup>asws</sup> said: ‘He had disbelieved in Allah<sup>azwj</sup> openly’. So both of them were killed’."
          ]
        }
      },
      {
        "index": 14331,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:11",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ الْعَاصِمِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَمِّهِ يَعْقُوبَ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَتِ امْرَأَةٌ بِالْمَدِينَةِ تُؤْتَى فَبَلَغَ ذَلِكَ عُمَرَ فَبَعَثَ إِلَيْهَا فَرَوَّعَهَا وَ أَمَرَ أَنْ يُجَاءَ بِهَا إِلَيْهِ فَفَزِعَتِ الْمَرْأَةُ فَأَخَذَهَا الطَّلْقُ فَانْطَلَقَتْ إِلَى بَعْضِ الدُّورِ فَوَلَدَتْ غُلَاماً فَاسْتَهَلَّ الْغُلَامُ ثُمَّ مَاتَ فَدَخَلَ عَلَيْهِ مِنْ رَوْعَةِ الْمَرْأَةِ وَ مِنْ مَوْتِ الْغُلَامِ مَا شَاءَ اللَّهُ فَقَالَ لَهُ بَعْضُ جُلَسَائِهِ يَا أَمِيرَ الْمُؤْمِنِينَ مَا عَلَيْكَ مِنْ هَذَا شَيْ‏ءٌ وَ قَالَ بَعْضُهُمْ وَ مَا هَذَا ",
          "قَالَ سَلُوا أَبَا الْحَسَنِ فَقَالَ لَهُمْ أَبُو الْحَسَنِ ( عليه السلام ) لَئِنْ كُنْتُمُ اجْتَهَدْتُمْ مَا أَصَبْتُمْ وَ لَئِنْ كُنْتُمْ قُلْتُمْ بِرَأْيِكُمْ لَقَدْ أَخْطَأْتُمْ ثُمَّ قَالَ عَلَيْكَ دِيَةُ الصَّبِيِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Al Asamy, from Ali Bin Al Hassan Al Maysami, from Ali Bin Asbaat, from his uncle Yaqoub Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There used to be a woman at Al-Medina to whom (visitors used to come to frequently). So the news of that reached Umar, so he sent a messenger to awe her and ordered that he should come with her to him. So the woman panicked, and she was seized by the pangs of childbirth. So she went to one of the rooms and gave birth to a boy. So the boy was alive but then died. So there entered upon him (Umar) dread of the woman and from the death of the boy, what Allah<sup>azwj</sup> so Desired. So one from his gathering said, ‘O commander of the faithful! There is nothing upon you from this thing’. And one of the said, ‘And what is this (it is of no consequence)’. ",
            "He (Umar) said, ‘Ask Abu Al-Hassan<sup>asws</sup>’. So Abu Al-Hassan<sup>asws</sup> said to them: ‘If you did your Ijtihaad you did not hit the truth, and if you spoke by your opinion, so you have erred’. Then he<sup>asws</sup> said: ‘Upon you (Umar) is the (payment of the) wergild of the child’."
          ]
        }
      },
      {
        "index": 14332,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:12",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ سَعِيدٍ عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ أَعْنَفَ عَلَى امْرَأَتِهِ أَوِ امْرَأَةٍ أَعْنَفَتْ عَلَى زَوْجِهَا فَقَتَلَ أَحَدُهُمَا الْآخَرَ قَالَ لَا شَيْ‏ءَ عَلَيْهِمَا إِذَا كَانَا مَأْمُونَيْنِ فَإِنِ اتُّهِمَا أُلْزِمَا الْيَمِينَ بِاللَّهِ أَنَّهُمَا لَمْ يُرِيدَا الْقَتْلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Salih Bin Saeed, from Yunus, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who was fierce upon his woman, or a woman who was fierce upon her husband, so one of the them killed the other one. He<sup>asws</sup> said: ‘There is nothing upon both of them, when they were two trustworthy ones. So if they are brought, the swearing of oath by Allah<sup>azwj</sup> would be necessitated upon them both that they did not intend the killing’."
          ]
        }
      },
      {
        "index": 14333,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:13",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ فِي غُلَامٍ دَخَلَ دَارَ قَوْمٍ فَوَقَعَ فِي الْبِئْرِ فَقَالَ إِنْ كَانُوا مُتَّهَمِينَ ضَمِنُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, raising it, ",
            "Regarding a boy who entered a house of a people, so he fell down into well. So he<sup>asws</sup> said: ‘If they were suspicious, they would be responsible’."
          ]
        }
      },
      {
        "index": 14334,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:14",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ بُرَيْدٍ الْعِجْلِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ مُؤْمِنٍ قَتَلَ رَجُلًا نَاصِباً مَعْرُوفاً بِالنَّصْبِ عَلَى دِينِهِ غَضَباً لِلَّهِ تَبَارَكَ وَ تَعَالَى أَ يُقْتَلُ بِهِ فَقَالَ أَمَّا هَؤُلَاءِ فَيَقْتُلُونَهُ بِهِ وَ لَوْ رُفِعَ إِلَى إِمَامٍ عَادِلٍ ظَاهِرٍ لَمْ يَقْتُلْهُ بِهِ ",
          "قُلْتُ فَيَبْطُلُ دَمُهُ قَالَ لَا وَ لَكِنْ إِنْ كَانَ لَهُ وَرَثَةٌ فَعَلَى الْإِمَامِ أَنْ يُعْطِيَهُمُ الدِّيَةَ مِنْ بَيْتِ الْمَالِ لِأَنَّ قَاتِلَهُ إِنَّمَا قَتَلَهُ غَضَباً لِلَّهِ عَزَّ وَ جَلَّ وَ لِلْإِمَامِ وَ لِدِينِ الْمُسْلِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Ayoub, from Bureyd Al Ajaly who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a Believer who kills a well-known Hostile one (Nasibi), upon his Religion, being angry for the Sake of Allah<sup>azwj</sup> Blessed and High, would he be killed due to it?’ He<sup>asws</sup> said: ‘As for them (rulers), so they would kill him for it, but if it were raised to a Just Imam<sup>asws</sup> present, he would not be killed for it’. ",
            "I said, ‘So his blood would be invalidated’. He<sup>asws</sup> said: ‘No, but if there were inheritors for him, so it would be upon the Imam<sup>asws</sup> that he<sup>asws</sup> gives them the wergild from the public treasury of the Muslims, because his killer, but rather his killing was an (act of) anger for the Sake of Allah<sup>azwj</sup> Mighty and Majestic, and for the Imam<sup>asws</sup>, and for the Religion of the Muslims’."
          ]
        }
      },
      {
        "index": 14335,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:15",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ رِبَاطٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي مَخْلَدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كُنْتُ عِنْدَ دَاوُدَ بْنِ عَلِيٍّ فَأُتِيَ بِرَجُلٍ قَدْ قَتَلَ رَجُلًا فَقَالَ لَهُ دَاوُدُ بْنُ عَلِيٍّ مَا تَقُولُ قَتَلْتَ هَذَا الرَّجُلَ قَالَ نَعَمْ أَنَا قَتَلْتُهُ قَالَ فَقَالَ لَهُ دَاوُدُ وَ لِمَ قَتَلْتَهُ قَالَ فَقَالَ إِنَّهُ كَانَ يَدْخُلُ عَلَى مَنْزِلِي بِغَيْرِ إِذْنِي فَاسْتَعْدَيْتُ عَلَيْهِ الْوُلَاةَ الَّذِينَ كَانُوا قَبْلَكَ فَأَمَرُونِي إِنْ هُوَ دَخَلَ بِغَيْرِ إِذْنٍ أَنْ أَقْتُلَهُ فَقَتَلْتُهُ",
          "قَالَ فَالْتَفَتَ دَاوُدُ إِلَيَّ فَقَالَ يَا أَبَا عَبْدِ اللَّهِ مَا تَقُولُ فِي هَذَا قَالَ فَقُلْتُ لَهُ أَرَى أَنَّهُ قَدْ أَقَرَّ بِقَتْلِ رَجُلٍ مُسْلِمٍ فَاقْتُلْهُ قَالَ فَأَمَرَ بِهِ فَقُتِلَ",
          "ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ أُنَاساً مِنْ أَصْحَابِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) كَانَ فِيهِمْ سَعْدُ بْنُ عُبَادَةَ فَقَالُوا يَا سَعْدُ مَا تَقُولُ لَوْ ذَهَبْتَ إِلَى مَنْزِلِكَ فَوَجَدْتَ فِيهِ رَجُلًا عَلَى بَطْنِ امْرَأَتِكَ مَا كُنْتَ صَانِعاً بِهِ قَالَ فَقَالَ سَعْدٌ كُنْتُ وَ اللَّهِ أَضْرِبُ رَقَبَتَهُ بِالسَّيْفِ",
          "قَالَ فَخَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ هُمْ فِي هَذَا الْكَلَامِ فَقَالَ يَا سَعْدُ مَنْ هَذَا الَّذِي قُلْتَ أَضْرِبُ عُنُقَهُ بِالسَّيْفِ قَالَ فَأَخْبَرَهُ بِالَّذِي قَالُوا وَ مَا قَالَ سَعْدٌ قَالَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عِنْدَ ذَلِكَ يَا سَعْدُ فَأَيْنَ الشُّهُودُ الْأَرْبَعَةُ الَّذِينَ قَالَ اللَّهُ عَزَّ وَ جَلَّ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ بَعْدَ رَأْيِ عَيْنِي وَ عِلْمِ اللَّهِ فِيهِ أَنَّهُ قَدْ فَعَلَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِي وَ اللَّهِ يَا سَعْدُ بَعْدَ رَأْيِ عَيْنِكَ وَ عِلْمِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ جَعَلَ لِكُلِّ شَيْ<span class=\"bTxt\">‏ءٍ حَدّاً وَ جَعَلَ عَلَى مَنْ تَعَدَّى حُدُودَ اللَّهِ حَدّاً وَ جَعَلَ مَا دُونَ الشُّهُودِ الْأَرْبَعَةِ مَسْتُوراً عَلَى الْمُسْلِمِينَ .</span>"
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father, both together, from Ibn Mahboub, from Ali Bin Al Hassan Bin Rabaat, from Ibn Muskan, from Abu Makhlad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, having said, ‘I<sup>asws</sup> was in the presence of Dawood Bin Ali, so they came with a man who had killed a man. So Dawood Bin Ali said to him, ‘What are you saying, having killed this man?’ He said, ‘Yes, I did kill him’. So Dawood said to him, ‘And why did you kill him?’ So he said, ‘He used to enter into my house without my permission. So I made claims against him to the rules who were before you, so they instructed me that if he were to enter without my permission so I should kill him. So I killed him’. ",
            "He<sup>asws</sup> said: ‘So Dawood turned towards me, so he said, ‘O Abu Abdullah<sup>asws</sup>! What are you<sup>asws</sup> saying regarding this?’ So I<sup>asws</sup> said to him: ‘I<sup>asws</sup> view that he has confessed with the killing of a Muslim man, so kill him’. So he ordered for it, so he was killed.",
            "Then Abu Abdullah<sup>asws</sup> said: ‘There were people from the companions of Rasool-Allah<sup>azwj</sup>, and among when was Sa’ad Bin Ubada. So they said, ‘O Sa’ad! What are you saying, if you were to go to your house, so you find in it a man upon the belly of your wife, what would you do with him?’ So Sa’ad said, ‘By Allah<sup>azwj</sup>! I would strike his neck with the sword’. ",
            "He<sup>asws</sup> said: ‘So Rasool-Allah<sup>saww</sup> came out, and they were in this speech, so he<sup>saww</sup> said: ‘O Sa’ad! Who is this one whom you are speaking that, ‘I would strike his neck with the sword?’ So he informed him<sup>saww</sup> with that which they had said, and what Sa’ad had said. So Rasool-Allah<sup>saww</sup> said during that: ‘O Sa’ad! So where are the four witnesses whom Allah<sup>azwj</sup> Mighty and Majestic Speaks of?’ So Sa’ad said, ‘O Rasool-Allah<sup>saww</sup>! After my having seen with my own eyes, and Allah<sup>azwj</sup> Knows that he has done it?’ So Rasool-Allah<sup>saww</sup> said: ‘Yes, by Allah<sup>azwj</sup>, O Sa’ad! After your eyes have seen, and Allah<sup>azwj</sup> Mighty and Majestic Knows. Allah<sup>azwj</sup> Mighty and Majestic has Made a Limit for everything, and Made for everyone who exceeds the Limits of Allah<sup>azwj</sup> a legal penalty (<span class=\"iTxt\">Hadd</span>), and Made whatever was less than the four witnesses as a veil upon the Muslims’."
          ]
        }
      },
      {
        "index": 14336,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:16",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ رَجُلٍ مِنْ أَصْحَابِنَا عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ لَنَا جَاراً مِنْ هَمْدَانَ يُقَالُ لَهُ الْجَعْدُ بْنُ عَبْدِ اللَّهِ وَ هُوَ يَجْلِسُ إِلَيْنَا فَنَذْكُرُ عَلِيّاً أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) وَ فَضْلَهُ فَيَقَعُ فِيهِ أَ فَتَأْذَنُ لِي فِيهِ فَقَالَ لِي يَا أَبَا الصَّبَّاحِ أَ فَكُنْتَ فَاعِلًا فَقُلْتُ إِي وَ اللَّهِ لَئِنْ أَذِنْتَ لِي فِيهِ لَأَرْصُدَنَّهُ فَإِذَا صَارَ فِيهَا اقْتَحَمْتُ عَلَيْهِ بِسَيْفِي فَخَبَطْتُهُ حَتَّى أَقْتُلَهُ قَالَ فَقَالَ يَا أَبَا الصَّبَّاحِ هَذَا الْفَتْكُ وَ قَدْ نَهَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنِ الْفَتْكِ يَا أَبَا الصَّبَّاحِ إِنَّ الْإِسْلَامَ قَيَّدَ الْفَتْكَ وَ لَكِنْ دَعْهُ فَسَتُكْفَى بِغَيْرِكَ ",
          "قَالَ أَبُو الصَّبَّاحِ فَلَمَّا رَجَعْتُ مِنَ الْمَدِينَةِ إِلَى الْكُوفَةِ لَمْ أَلْبَثْ بِهَا إِلَّا ثَمَانِيَةَ عَشَرَ يَوْماً فَخَرَجْتُ إِلَى الْمَسْجِدِ فَصَلَّيْتُ الْفَجْرَ ثُمَّ عَقَّبْتُ فَإِذَا رَجُلٌ يُحَرِّكُنِي بِرِجْلِهِ فَقَالَ يَا أَبَا الصَّبَّاحِ الْبُشْرَى فَقُلْتُ بَشَّرَكَ اللَّهُ بِخَيْرٍ فَمَا ذَاكَ فَقَالَ إِنَّ الْجَعْدَ بْنَ عَبْدِ اللَّهِ بَاتَ الْبَارِحَةَ فِي دَارِهِ الَّتِي فِي الْجَبَّانَةِ فَأَيْقَظُوهُ لِلصَّلَاةِ فَإِذَا هُوَ مِثْلُ الزِّقِّ الْمَنْفُوخِ مَيِّتاً فَذَهَبُوا يَحْمِلُونَهُ فَإِذَا لَحْمُهُ يَسْقُطُ عَنْ عَظْمِهِ فَجَمَعُوهُ فِي نَطْعٍ فَإِذَا تَحْتَهُ أَسْوَدُ فَدَفَنُوهُ "
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, form his father, from Ibn Mahboub, from a man from our companions, from Abu Al Sabbah Al Kinany who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup> that we have a neighbour from Hamdan called Al-Ja’d Bin Abdullah, and he was sitting with us. So we mentioned Ali<sup>asws</sup> Amir Al-Momineen<sup>asws</sup>, and his<sup>asws</sup> merits, but he falls out with us with regards to it (quarrels with us). Do you<sup>asws</sup> permit me with regards to (killing) him?’ So he<sup>asws</sup> said to me: ‘O Abu Al-Sabbah! Will you do it?’ So I said, ‘Yes, by Allah<sup>azwj</sup>! If you<sup>asws</sup> were to permit me with regards to it, I would ambush him. So when the time comes, I would storm upon him with my sword and strike him until I kill him’. He<sup>asws</sup> said: ‘O Abu Al Sabbah, this is the assassination, and Rasool-Allah<sup>saww</sup> has forbidden from the assassination. O Abu Al-Sabbah! Al-Islam retaliates the assassination. But, leave him, so it would be sufficed by other than you’. ",
            "Abu Al-Sabbah said, ‘So when I returned from Al-Medina to Al-Kufa, there had not elapsed except for eighteen days, when I went out to the Masjid, so I Prayed Al-Fajr, then optional, so there was a man to stirred me with his left, so he said, ‘O Abu Al-Sabbah! The good news’. So I said, ‘May Allah<sup>azwj</sup> Give you good news with the goodness, so what is that’. So he said, ‘Al-Ja’d Bin Abdullah was sleeping last night in his house in al-Jabanah, so (they came) to wake him up was for the Prayer, but there he was all puffed up like the balloon and dead. So they went to carry him, but his flesh kept falling off from his bones. So they gathered him in a leather rug, and there was a black (snake) underneath him. So they buried him’."
          ]
        }
      },
      {
        "index": 14337,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:17",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ مَحْبُوبٍ مِثْلَهُ .",
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ رَفَعَهُ عَنْ بَعْضِ أَصْحَابِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَظُنُّهُ أَبَا عَاصِمٍ السِّجِسْتَانِيَّ قَالَ زَامَلْتُ عَبْدَ اللَّهِ بْنَ النَّجَاشِيِّ وَ كَانَ يَرَى رَأْيَ الزَّيْدِيَّةِ فَلَمَّا كُنَّا بِالْمَدِينَةِ ذَهَبَ إِلَى عَبْدِ اللَّهِ بْنِ الْحَسَنِ وَ ذَهَبْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَلَمَّا انْصَرَفَ رَأَيْتُهُ مُغْتَمّاً فَلَمَّا أَصْبَحَ قَالَ لِي اسْتَأْذِنْ لِي عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَدَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ قُلْتُ إِنَّ عَبْدَ اللَّهِ بْنَ النَّجَاشِيِّ يَرَى رَأْيَ الزَّيْدِيَّةِ وَ إِنَّهُ ذَهَبَ إِلَى عَبْدِ اللَّهِ بْنِ الْحَسَنِ وَ قَدْ سَأَلَنِي أَنْ أَسْتَأْذِنَ لَهُ عَلَيْكَ فَقَالَ ائْذَنْ لَهُ",
          "فَدَخَلَ عَلَيْهِ فَسَلَّمَ فَقَالَ يَا ابْنَ رَسُولِ اللَّهِ إِنِّي رَجُلٌ أَتَوَلَّاكُمْ وَ أَقُولُ إِنَّ الْحَقَّ فِيكُمْ وَ قَدْ قَتَلْتُ سَبْعَةً مِمَّنْ سَمِعْتُهُ يَشْتِمُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَسَأَلْتُ عَنْ ذَلِكَ عَبْدَ اللَّهِ بْنَ الْحَسَنِ فَقَالَ لِي أَنْتَ مَأْخُوذٌ بِدِمَائِهِمْ فِي الدُّنْيَا وَ الْآخِرَةِ فَقُلْتُ فَعَلَامَ نُعَادِي النَّاسَ إِذَا كُنْتُ مَأْخُوذاً بِدِمَاءِ مَنْ سَمِعْتُهُ يَشْتِمُ عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) ",
          "فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَكَيْفَ قَتَلْتَهُمْ قَالَ مِنْهُمْ مَنْ جَمَعَ بَيْنِي وَ بَيْنَهُ الطَّرِيقُ فَقَتَلْتُهُ وَ مِنْهُمْ مَنْ دَخَلْتُ عَلَيْهِ بَيْتَهُ فَقَتَلْتُهُ وَ قَدْ خَفِيَ ذَلِكَ عَلَيَّ كُلُّهُ قَالَ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا خِدَاشٍ عَلَيْكَ بِكُلِّ رَجُلٍ مِنْهُمْ قَتَلْتَهُ كَبْشٌ تَذْبَحُهُ بِمِنًى لِأَنَّكَ قَتَلْتَهُمْ بِغَيْرِ إِذْنِ الْإِمَامِ وَ لَوْ أَنَّكَ قَتَلْتَهُمْ بِإِذْنِ الْإِمَامِ لَمْ يَكُنْ عَلَيْكَ شَيْ‏ءٌ فِي الدُّنْيَا وَ الْآخِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ibn Mahboub</span> – similar to it. ",
            "Ali Bin Ibrahim, from his father, raising it, ",
            "(It has been narrated) from one of the companions of Abu Abdullah<sup>asws</sup>, I guess it was Abu Aasim Al-Sajistany who said, ‘I was a fellow traveller of Abdullah Bin Al-Najjashy, and he viewed by the opinion of Al-Zaydiyya. So when we were at Al-Medina, he went to Abdullah Bin Al-Hassan (Al Basry), and I went to Abu Abdullah<sup>asws</sup>. So when I left, I saw him gloomy. So when it was the morning he said to me, ‘Get me permission to (see) Abu Abdullah<sup>asws</sup>. So I went over to Abu Abdullah<sup>asws</sup> and said, ‘Abdullah Bin Al-Najjashy, who views by the opinions of Al-Zaydiyya, and he had gone to Abdullah Bin Al-Hassan, and has asked me that I seek permission for him, to (see) you<sup>asws</sup>. So he<sup>asws</sup> said; ‘Give permission to him’.",
            "So he came over to him<sup>asws</sup>, so he said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! I am a man who has befriended you<sup>asws</sup>, and I am saying that the truth is among you<sup>asws</sup>, and I have killed seven from the ones whom I heard insulting Amir Al-Momineen<sup>asws</sup>. So I asked Abdullah Bin Al-Hassan about that, so he said to me, ‘You will be seized for their blood in the world and the Hereafter’. So I said, ‘So why do the people antagonise me when I am to be seized with the blood of the one I hear insulting Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>?’ ",
            "So Abu Abdullah<sup>asws</sup> said to him: ‘So how did you kill them?’ He said, ‘Among them was one whom there was a gathering between me and him, on the road, so I killed him. And among them was one whom I went over to, in his house, so I killed him, and that is concealed (matter) upon me, all of it’. So Abu Abdullah<sup>asws</sup> said to him: ‘O Abu Jidash! It is upon you, with each man you killed from them, a ram. You should slaughter it at Mina, because you killed them without permission from the Imam<sup>asws</sup>. And had you kill them with the permission of the Imam<sup>asws</sup>, there would not happen to be upon you anything in the world and the Hereafter’."
          ]
        }
      },
      {
        "index": 14338,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:18",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْهَيْثَمِ بْنِ أَبِي مَسْرُوقٍ النَّهْدِيِّ عَنْ مَرْوَكِ بْنِ عُبَيْدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) كُنْتُ أَخْرُجُ فِي الْحَدَاثَةِ إِلَى الْمُخَارَجَةِ مَعَ شَبَابِ أَهْلِ الْحَيِّ وَ إِنِّي بُلِيتُ أَنْ ضَرَبْتُ رَجُلًا ضَرْبَةً بِعَصاً فَقَتَلْتُهُ فَقَالَ أَ كُنْتَ تَعْرِفُ هَذَا الْأَمْرَ إِذْ ذَاكَ قَالَ قُلْتُ لَا فَقَالَ لِي مَا كُنْتَ عَلَيْهِ مِنْ جَهْلِكَ بِهَذَا الْأَمْرِ أَشَدُّ عَلَيْكَ مِمَّا دَخَلْتَ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Haysam Bin Abu Masrouq Al nahdy, from Marouk Bin Ubeyd, from one of our companions, from Mansour Bin Hazim who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I had gone out with regards to the need to the outskirts with youths of the people of Al-Hayy, and I had a misadventure that I struck a man with a strike of a stick, so I killed him’. So he<sup>asws</sup> said: ‘Did you recognise this matter (Al-Wilayah) when that (happened)?’ I said, ‘No’. So he<sup>asws</sup> said to me: ‘What you were upon from your ignorance with this matter (Al-Wilayah) is severer upon you from what you have entered into’."
          ]
        }
      },
      {
        "index": 14339,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:19",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مَرْوَكِ بْنِ عُبَيْدٍ مِثْلَهُ .",
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنِ اقْتُصَّ مِنْهُ فَهُوَ قَتِيلُ الْقُرْآنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Marouk Bin Ubeyd</span> – similar to it.",
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who is retaliated from it (Al-Wilayah), so he is killed (by the) Quran’."
          ]
        }
      },
      {
        "index": 14340,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:20",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْبِئْرُ جُبَارٌ وَ الْعَجْمَاءُ جُبَارٌ وَ الْمَعْدِنُ جُبَارٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "He<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘(Being killed by) the well is ‘<span class=\"iTxt\">Jubarru</span>’, (no wergild for it), and (being killed by) the beasts, is ‘<span class=\"iTxt\">Jubarru</span>’ (no wergild for it), and (being killed by) the mines, is ‘<span class=\"iTxt\">Jubarru</span>’ (no wergild for it’."
          ]
        }
      },
      {
        "index": 14341,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:4:55:21",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ قَالَ رُفِعَ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( صلوات الله عليه ) رَجُلٌ دَاسَ بَطْنَ رَجُلٍ حَتَّى أَحْدَثَ فِي ثِيَابِهِ فَقَضَى ( عليه السلام ) عَلَيْهِ أَنْ يُدَاسَ بَطْنُهُ حَتَّى يُحْدِثَ فِي ثِيَابِهِ كَمَا أَحْدَثَ أَوْ يَغْرَمَ ثُلُثَ الدِّيَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, said, ",
            "‘(A matter) was raised to Amir Al-Momineen<sup>asws</sup> of a man who squeezed the stomach of a man until he defecated in his clothes. So he<sup>asws</sup> judged upon him that he (also) be squeezed in the stomach until he defecate in his clothes, just as he (the other one) had defecated, or he is fined one-third of the wergild’."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "هَذَا آخِرُ كِتَابِ الدِّيَاتِ وَ يَتْلُوهُ إِنْ شَاءَ اللَّهُ تَعَالَى كِتَابُ الشَّهَادَاتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "This is the end of the Book of the Wergilds, and it would be followed, Allah<sup>azwj</sup> the Exalted Willing, by the book of the testimonies."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:4:55",
  "kind": "verse_list"
}