{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:7:4", "titles": {"ar": "كِتَابُ الدِّيَاتِ", "en": "THE BOOK OF WERGILDS (COMPENSATIONS)"}}, {"indexed_titles": {"en": "Chapter 7"}, "path": "/books/al-kafi:7:4:7", "titles": {"ar": "باب الرَّجُلِ يَأْمُرُ رَجُلًا بِقَتْلِ رَجُلٍ", "en": "Chapter 7 – The man orders a man with the killing of a man"}}], "index": 2153, "local_index": 7, "part_type": "Chapter", "path": "/books/al-kafi:7:4:7", "titles": {"ar": "باب الرَّجُلِ يَأْمُرُ رَجُلًا بِقَتْلِ رَجُلٍ", "en": "Chapter 7 – The man orders a man with the killing of a man"}, "verse_count": 3, "verse_start_index": 13995, "verses": [{"index": 13996, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:4:7:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي رَجُلٍ أَمَرَ رَجُلًا بِقَتْلِ رَجُلٍ فَقَتَلَهُ فَقَالَ يُقْتَلُ بِهِ الَّذِي قَتَلَهُ وَ يُحْبَسُ الْآمِرُ بِقَتْلِهِ فِي السِّجْنِ حَتَّى يَمُوتَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and a number of our companions, from Sahl Bin Ziyad, both together from Ibn Mahboub, from Ibn Raib, from Zurara, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a man who orders a man with the killing of a man, so he killed him. So he<sup>asws</sup> said: ‘The one who killed him should be killed, and the one who ordered with killing him should be held in the prison until he dies’."}]}, {"index": 13997, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:4:7:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ أَمَرَ عَبْدَهُ أَنْ يَقْتُلَ رَجُلًا فَقَتَلَهُ قَالَ فَقَالَ يُقْتَلُ السَّيِّدُ بِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, both together from Ibn Mahboub, from Is’haq Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who ordered his slave that he should kill a man, so he killed him. So he<sup>asws</sup> said: ‘The master should be killed due to it’."}]}, {"index": 13998, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:4:7:3", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ أَمَرَ عَبْدَهُ أَنْ يَقْتُلَ رَجُلًا فَقَتَلَهُ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ هَلْ عَبْدُ الرَّجُلِ إِلَّا كَسَوْطِهِ أَوْ كَسَيْفِهِ يُقْتَلُ السَّيِّدُ بِهِ وَ يُسْتَوْدَعُ الْعَبْدُ السِّجْنَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said regarding a man who ordered his slave that he should kill a man, so he killed him. So Amir Al-Momineen<sup>asws</sup> said: ‘And is a slave of the man anything except like his whip, or like his sword? The master would be killed due to it, and the slave would be left in the prison’."}]}]}, "index": "al-kafi:7:4:7", "kind": "verse_list"}