{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:1:2:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>َابُ فَرْضِ الْعِلْمِ</span> وَ وُجُوبِ طَلَبِهِ وَ الْحَثِّ عَلَيْهِ",
          "en": "Chapter 1 – The necessity of the knowledge, and the Obligation to seek it, and the urging upon it"
        }
      }
    ],
    "index": 2,
    "local_index": 1,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:2:1",
    "titles": {
      "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>َابُ فَرْضِ الْعِلْمِ</span> وَ وُجُوبِ طَلَبِهِ وَ الْحَثِّ عَلَيْهِ",
      "en": "Chapter 1 – The necessity of the knowledge, and the Obligation to seek it, and the urging upon it"
    },
    "verse_count": 9,
    "verse_start_index": 36,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (98/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 37,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:1:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َخْبَرَنَا مُحَمَّدُ</span> بْنُ يَعْقُوبَ عَنْ عَلِيِّ بْنِ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ أَبِي الْحُسَيْنِ الْفَارِسِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ أَلَا إِنَّ اللَّهَ يُحِبُّ بُغَاةَ الْعِلْمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yaqoub informed us, from Ali Bin Ibrahim Bin Hashim, from his father, from Al Hassan Bin Abu Al Husayn Al Farsy, from Abdul Rahman Bin Zayd, from his father, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Seeking the knowledge is mandatory upon every Muslim. Indeed! Allah<sup>azwj</sup> Loves the seekers of knowledge’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Ya‘qub has narrated from Ali ibn Ibrahim ibn Hashim from his father from al-Hassan ibn abu al-Hassan al-Farisi from ‘Abd al-Rahman ibn Ziyad from his father from abu ‘Abdallah (a.s.) who has said the following. “The Messenger of Allah said, ‘Seeking knowledge is obligatory for every Muslim. Let it be known that Allah loves those who seek knowledge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (99/ 1)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/2)"
        ],
        "index": 38,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:1:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ الْعُمَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ طَلَبُ الْعِلْمِ فَرِيضَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah, from Isa Bin Abdullah Al Umary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Seeking the knowledge is mandatory’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Hassan from Muhammad ibn ‘Abdallah from ‘Isa ibn ‘Abdallah al-‘Amri from abu ‘Abdallah (a.s.) who has said the following. “Seeking knowledge is obligatory.”"
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 39,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:1:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ بَعْضِ أَصْحَابِهِ قَالَ سُئِلَ أَبُو الْحَسَنِ ( عليه السلام ) هَلْ يَسَعُ النَّاسَ تَرْكُ الْمَسْأَلَةِ عَمَّا يَحْتَاجُونَ إِلَيْهِ فَقَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from one of his companions who said, ",
            "‘Abu Al Hassan<sup>asws</sup> was asked, ‘Do the people have the leeway (freedom) to neglect the asking about what they are needy to?’ So he<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus ibn ‘Abd al-Rahman from certain persons of his people who has said the following. “Abu al-Hassan (a.s.) was asked, “Is it permissible for people not to seek what (religious knowledge) they need?” The Imam (a.s.) said, “No, (it is not permissible to ignore learning).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/99)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 40,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:1:4",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ وَ غَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي إِسْحَاقَ السَّبِيعِيِّ عَمَّنْ حَدَّثَهُ قَالَ سَمِعْتُ أَمِيرَ الْمُؤْمِنِينَ يَقُولُ أَيُّهَا النَّاسُ اعْلَمُوا أَنَّ كَمَالَ الدِّينِ طَلَبُ الْعِلْمِ وَ الْعَمَلُ بِهِ أَلَا وَ إِنَّ طَلَبَ الْعِلْمِ أَوْجَبُ عَلَيْكُمْ مِنْ طَلَبِ الْمَالِ إِنَّ الْمَالَ مَقْسُومٌ مَضْمُونٌ لَكُمْ قَدْ قَسَمَهُ عَادِلٌ بَيْنَكُمْ وَ ضَمِنَهُ وَ سَيَفِي لَكُمْ وَ الْعِلْمُ مَخْزُونٌ عِنْدَ أَهْلِهِ وَ قَدْ أُمِرْتُمْ بِطَلَبِهِ مِنْ أَهْلِهِ فَاطْلُبُوهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, and someone else, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, altogether from Ibn Mahboub, from Hisham Bin Salim, from Abu Hamza, from Abu Is’haq Al Sabi’e, from the one who narrated it, said, ",
            "‘I heard Amir Al-Momineen<sup>asws</sup> saying: ‘O you people! Know that the perfection of the Religion is the seeking of the knowledge and acting by it. Indeed! And the seeking of the knowledge is more Obligatory upon you than the seeking of the wealth. The wealth is (already) apportioned, guaranteed for you all (already distributed). A just One<sup>azwj</sup> has Apportioned it between you all and He<sup>azwj</sup> and my<sup>asws</sup> sword Guarantee it for you all; however the knowledge is treasure stored with its rightful one<sup>asws</sup>, and you have been Commanded with seeking it from its rightful ones<sup>asws</sup>, therefore seek it’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad and others have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa all from ibn Mahbub from Hisham ibn Salim from abu Hamza from abu Ishaq al-Subay‘i from one who narrated to him who has said the following. “I heard Amir al-Mu’minin Ali (a.s.) say, ‘O people, you must know that religion becomes complete through seeking knowledge and acting accordingly. You must know that seeking knowledge is much more urgent for you than seeking wealth. In wealth every one’s share is guaranteed. A just person has already divided the wealth among you. He and my sword guarantee you to receive your share. Knowledge, however, is stored with those who possess it. You are commanded to seek knowledge from its sources (those who possess it). You must seek knowledge.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (100/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 41,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:1:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ اللَّهِ رَجُلٍ مِنْ أَصْحَابِنَا رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) طَلَبُ الْعِلْمِ فَرِيضَةٌ ",
          "وَ فِي حَدِيثٍ آخَرَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ أَلَا وَ إِنَّ اللَّهَ يُحِبُّ بُغَاةَ الْعِلْمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqu, from Yaqoub Bin Yazeed, from Abu Abdullah, a man from our companions, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Seeking the knowledge is ‘فَرِيضَةٌ’ mandatory’. ",
            "And in another Hadeeth, he (the narrator) said, ‘Abu Abdullah<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Seeking the knowledge is mandatory upon every Muslim. Indeed! And Allah<sup>azwj</sup> Loves the seeker of the knowledge’’."
          ],
          "en.sarwar": [
            " 5. A number of our people has narrated has narrated from Ahmad ibn Muhammad al-Barqi from Ya’qub ibn Yazid from abu ‘Abdallah, a man of our people narrated in a marfu‘ manner from abu ‘Abdallah (a.s.) from the Holy Prophet (s.a) who has said the following. “Seeking knowledge is obligatory.” In another Hadith Imam abu ‘Abdallah has narrated from the holy Prophet who said, “Seeking knowledge is obligatory for every Muslim. Let it be known that Allah loves those who seek knowledge.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (100/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 42,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:1:6",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ تَفَقَّهُوا فِي الدِّينِ فَإِنَّهُ مَنْ لَمْ يَتَفَقَّهْ مِنْكُمْ فِي الدِّينِ فَهُوَ أَعْرَابِيٌّ إِنَّ اللَّهَ يَقُولُ فِي كِتَابِهِ لِيَتَفَقَّهُوا فِي الدِّينِ وَ لِيُنْذِرُوا قَوْمَهُمْ إِذا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Abdullah, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Ali  Bin Abu Hamza who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘(one must) acquire understanding in the Religion, (however) the one from you who does not acquire understanding in the Religion is a Bedouin. Allah<sup>azwj</sup> is Saying in His<sup>azwj</sup> Book <span class=\"ibTxt\">[9:122] let them obtain understanding in religion, and that they may warn their people when they come back to them that they may be cautious?</span>’"
          ],
          "en.sarwar": [
            " 6. Ali ibn Muhammad ibn ‘Abdallah has narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from Ali ibn abu Hamza who has said the following. “I heard Imam abu ‘Abdallah saying, ‘Acquire good understand in religion because those of you who do not have good understand in religion are like the Bedouins. Allah has said in His book, ‘ Why do not some people from each group of believers seek to become specialists in religious learning and, after completing their studies, guide their group so that they will have fear of God. (9:122)’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/101)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 43,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:1:7",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ الرَّبِيعِ عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ عَلَيْكُمْ بِالتَّفَقُّهِ فِي دِينِ اللَّهِ وَ لَا تَكُونُوا أَعْرَاباً فَإِنَّهُ مَنْ لَمْ يَتَفَقَّهْ فِي دِينِ اللَّهِ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ وَ لَمْ يُزَكِّ لَهُ عَمَلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ja’far Bin Muhammad, from Al Qasim Bin Al Rabie, from Mufazzal Bin Umar who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘It is upon you (that you must acquire) understanding in the Religion of Allah<sup>azwj</sup>, and do not become Bedouins, for the one who does not (acquire) understanding in the Religion of Allah<sup>azwj</sup>, Allah<sup>azwj</sup> would not Look at him on the Day of Judgment and will not Purify his deeds’."
          ],
          "en.sarwar": [
            " 7. Al-Hassan ibn Muhammad has narrated from Ja‘far ibn Muhammad from al-Qasim ibn al-Rabi‘ from Mufaddal ibn ‘Umar who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘It is necessary for you to have good understanding of religion of Allah. Do not be like Bedouins because those who do not gain good understanding of religion, Allah will not look to then on the Day of Judgement and none of his deeds will be cleansed.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول لكن في قوة الصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (101/ 1)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/3)"
        ],
        "index": 44,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:1:8",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَوَدِدْتُ أَنَّ أَصْحَابِي ضُرِبَتْ رُءُوسُهُمْ بِالسِّيَاطِ حَتَّى يَتَفَقَّهُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Aban Bin Taghlub, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘I<sup>asws</sup> would (not even) mind if I<sup>asws</sup> have to whip the heads of my<sup>asws</sup> companions with the lashes until they (acquire) understanding (in the Religion)’."
          ],
          "en.sarwar": [
            " 8. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from ibn abu ‘Umayr from Jamil ibn Durraj from Aban ibn Taghlib from abu ‘Abdallah (a.s.) who has said the following. “I would like to teach my associates and followers to have good understanding of religion even if it would require to use my whip on their heads.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (102/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 45,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:1:9",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لَهُ رَجُلٌ جُعِلْتُ فِدَاكَ رَجُلٌ عَرَفَ هَذَا الْأَمْرَ لَزِمَ بَيْتَهُ وَ لَمْ يَتَعَرَّفْ إِلَى أَحَدٍ مِنْ إِخْوَانِهِ قَالَ فَقَالَ كَيْفَ يَتَفَقَّهُ هَذَا فِي دِينِهِ "
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Isa, from the one who reported it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! A man recognises this matter (<span class=\"iTxt\">Al-Wilayah</span>), necessitates the (staying in) his house and does not introduce (himself) to anyone from his brethren’. So he<sup>asws</sup> said: ‘How can this one (be able to enhance) understanding in his Religion (without interacting with people)?’"
          ],
          "en.sarwar": [
            " 9. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa from one who narrated to him from abu ‘Abdallah (a.s.) the following. “A man said asked, ‘May Allah take my soul in your service, a man believes in this fact, (Leadership of Ahlul Bayt with Divine Authority) but keeps himself at home and does not acquaint himself with his brethren.” Abu ‘Abdallah (a.s.) said, “How he achieves good understanding of his religion?”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:2:1",
  "kind": "verse_list"
}