{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:1:2:14",
        "titles": {
          "ar": "بَابُ الْمُسْتَأْكِلِ بِعِلْمِهِ وَ الْمُبَاهِي بِهِ",
          "en": "Chapter 14 – The consumer with his knowledge and the boaster with it"
        }
      }
    ],
    "index": 15,
    "local_index": 14,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:2:14",
    "titles": {
      "ar": "بَابُ الْمُسْتَأْكِلِ بِعِلْمِهِ وَ الْمُبَاهِي بِهِ",
      "en": "Chapter 14 – The consumer with his knowledge and the boaster with it"
    },
    "verse_count": 6,
    "verse_start_index": 115,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور معتمد عندي   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (147/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 116,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:14:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ أَبَانِ بْنِ أَبِي عَيَّاشٍ عَنْ سُلَيْمِ بْنِ قَيْسٍ قَالَ سَمِعْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْهُومَانِ لَا يَشْبَعَانِ طَالِبُ دُنْيَا وَ طَالِبُ عِلْمٍ فَمَنِ اقْتَصَرَ مِنَ الدُّنْيَا عَلَى مَا أَحَلَّ اللَّهُ لَهُ سَلِمَ وَ مَنْ تَنَاوَلَهَا مِنْ غَيْرِ حِلِّهَا هَلَكَ إِلَّا أَنْ يَتُوبَ أَوْ يُرَاجِعَ وَ مَنْ أَخَذَ الْعِلْمَ مِنْ أَهْلِهِ وَ عَمِلَ بِعِلْمِهِ نَجَا وَ مَنْ أَرَادَ بِهِ الدُّنْيَا فَهِيَ حَظُّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father, altogether from Hammad Bin Isa, from Umar Bin Azina, from Aban Bin Abu Ayyash, from Sulem Bin Qays who said, ",
            "‘I heard Amir Al-Momineen<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> said: ‘Two greedy ones are never satiated – a seeker of the world and a seeker of the knowledge. So the one who confines himself from the world upon what Allah<sup>azwj</sup> has Permitted for him, would be safe, and the one who attains it from other than its Permissible means would be destroyed, unless if he were to repent or retract; and the one who takes the knowledge from its rightful people<sup>asws</sup>, and acts with his<sup>asws</sup> knowledge, would be saved; and the one who intends the world by it, so it would be his share’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and Ali ibn Ibrahim from his father, both of them from Hammad ibn ‘Isa from ‘Umar ibn ’Udhayna from Aban ibn abu ‘Ayyash from Sulaym ibn Qays who has said the following. “(Imam) Ali (a.s.) narrated from the holy Prophet who said, ‘Two kinds of people with great appetites do not become satisfied. A person of great appetite for the worldly gains and a person with great appetite for knowledge. In the matters of the worldly gains if one would limit himself to what Allah has made lawful form him he is saved and if one would accumulate such gains in unlawful ways he is destroyed unless he repents and changes his ways. In the matters of knowledge if one would acquire it from the people of knowledge and practice accordingly he is saved and if one would use it for the worldly gains then that is what one gets.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور لكنه معتبر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/148)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 117,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:14:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدِ بْنِ عَامِرٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنْ أَبِي خَدِيجَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَرَادَ الْحَدِيثَ لِمَنْفَعَةِ الدُّنْيَا لَمْ يَكُنْ لَهُ فِي الْآخِرَةِ نَصِيبٌ وَ مَنْ أَرَادَ بِهِ خَيْرَ الْآخِرَةِ أَعْطَاهُ اللَّهُ خَيْرَ الدُّنْيَا وَ الْآخِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Bin Aamir, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washha, from Ahmad Bin Aiz, from Abu Khadeeja, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who intends (acquiring) the Hadeeth for benefitting the world, there would not happen to be a share for him in the Hereafter, and the one who intends goodness of the Hereafter by it, Allah<sup>azwj</sup> would Give him goodness of the world and the Hereafter (as well)’."
          ],
          "en.sarwar": [
            " 2. Al-Husayn ibn Muhammad ibn ‘Amir has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washshi’ from Ahmad ibn ‘A’idh from abu Khadija from abu ‘Abdallah (a.s.) who has said the following. “If one would want al-Hadith for the worldly benefits he will have no share for it in the next life but if one would want al-Hadith for the good of the next life, Allah will give him the good of both this and the next life.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/149)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 118,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:14:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْأَصْبَهَانِيِّ عَنِ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَرَادَ الْحَدِيثَ لِمَنْفَعَةِ الدُّنْيَا لَمْ يَكُنْ لَهُ فِي الْآخِرَةِ نَصِيبٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Qasim Bin Muhammad Al Asbahany, from Al Minqary, from Hafs Bin Giyas, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who intends (acquiring) the Hadeeth for the benefit of the world, there would not happen to be for him a share in the Hereafter’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad al-Isbahani from al-Minqari from Hafs ibn Ghiyath from abu ‘Abdallah (a.s.) who has said the following. “Whoever would want al-Hadith for the worldly gains he will have no share for it in the next life.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (149/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 119,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:14:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ عَنِ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا رَأَيْتُمُ الْعَالِمَ مُحِبّاً لِدُنْيَاهُ فَاتَّهِمُوهُ عَلَى دِينِكُمْ فَإِنَّ كُلَّ مُحِبٍّ لِشَيْ‏ءٍ يَحُوطُ مَا أَحَبَّ ",
          "وَ قَالَ ( صلوات الله عليه ) أَوْحَى اللَّهُ إِلَى دَاوُدَ ( عليه السلام ) لَا تَجْعَلْ بَيْنِي وَ بَيْنَكَ عَالِماً مَفْتُوناً بِالدُّنْيَا فَيَصُدَّكَ عَنْ طَرِيقِ مَحَبَّتِي فَإِنَّ أُولَئِكَ قُطَّاعُ طَرِيقِ عِبَادِيَ الْمُرِيدِينَ إِنَّ أَدْنَى مَا أَنَا صَانِعٌ بِهِمْ أَنْ أَنْزِعَ حَلَاوَةَ مُنَاجَاتِي عَنْ قُلُوبِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Qasim Bin Al Minqary, from Hafs Bin Giyas, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you see the scholar in love for his world, so denounce him upon your Religion, for every lover of a thing would be encompassed by what he loves’. ",
            "And he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Revealed unto Dawood<sup>as</sup>: “Do not make a scholar to be between you<sup>as</sup> and Me<sup>azwj</sup>, the one who is tempted by the world, for he would block you<sup>as</sup> from the path of My<sup>azwj</sup> Love, for they are the bandits of the road to My<sup>azwj</sup> servants, the devotees. The least of what I<sup>azwj</sup> would Do with them is that I<sup>azwj</sup> will Remove the sweetness of My<sup>azwj</sup> Whisperings from their hearts’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Ibrahim has narrated from his father from al-Qasim from al-Minqari from Hafs ibn Ghiyath from abu ‘Abdallah (a.s.) who has said the following. “If you would find a learned person who loves the worldly gains you must not trust him in the matters of your religion because whoever would love something it will encompass and entangle him. The holy Prophet has said, ‘Allah sent wahy, revelation to David (a.s.) and told him, “Do not set between Me and yourself a learned person who loves the worldly gains lest he will bar you from the way to My love. Such people are bandits who ambush my servants who want Me. The least that I will do to such bandits is to take away from them the sweetness of their private conversations and prayers with Me.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (149/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 120,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:14:5",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْفُقَهَاءُ أُمَنَاءُ الرُّسُلِ مَا لَمْ يَدْخُلُوا فِي الدُّنْيَا قِيلَ يَا رَسُولَ اللَّهِ وَ مَا دُخُولُهُمْ فِي الدُّنْيَا قَالَ اتِّبَاعُ السُّلْطَانِ فَإِذَا فَعَلُوا ذَلِكَ فَاحْذَرُوهُمْ عَلَى دِينِكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Al Nowfal, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The understanding ones (الْفُقَهَاءُ) are the trustees of the Rasools<sup>as</sup> for as long as they do not enter into the (matters of the) world’. It was said, ‘O Rasool-Allah<sup>saww</sup>! And what is their entering into the world?’ He<sup>as</sup> said: ‘Following the ruling authority. So when they do that, then be cautious of them upon your Religion'."
          ],
          "en.sarwar": [
            " 5. Ali from his father from al-Nawfali from al-Sakuni from abu ‘Abdallah (a.s.) who has said the following. “The holy Prophet has said, Al-Fuqaha, the scholars of the Fiqh, Islamic laws are the trustees of the prophets until they are not involved in the worldly matters.” People asked, “What is their ‘entering in the worldly matters, O the holy Prophet of Allah?” “Their following the kings is entering in the worldly matters. When they follow the kings then you must be very careful in involving them in your religion.” Replied the holy Prophet (s.a.)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/150)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 121,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:14:6",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَمَّنْ حَدَّثَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ طَلَبَ الْعِلْمَ لِيُبَاهِيَ بِهِ الْعُلَمَاءَ أَوْ يُمَارِيَ بِهِ السُّفَهَاءَ أَوْ يَصْرِفَ بِهِ وُجُوهَ النَّاسِ إِلَيْهِ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ إِنَّ الرِّئَاسَةَ لَا تَصْلُحُ إِلَّا لِأَهْلِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazzal Bin Shazan, from Hammad Bin Isa, from Rabie Bin Abdullah, from the one who narrated it, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The one who seeks the knowledge in order to boast to the scholars by it, or to argue with the fools by it, or to turn the faces of the people towards him by it, so let him assume his seat from the Fire. The leadership is not correct except for its rightful ones<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Hammed ibn ‘Isa from Ri’ab‘i ibn ‘Abdallah from one he narrated from abu Ja’far (a.s.) who has said the following. “Whoever would seek knowledge to show off to the scholars or to engage in arguments with fools or to attract people to himself he should know that in so doing he has prepare his seat in the fire. Leadership does not suite anyone besides those qualified for it.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:2:14",
  "kind": "verse_list"
}