{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:1:2:15",
        "titles": {
          "ar": "بَابُ لُزُومِ الْحُجَّةِ عَلَى الْعَالِمِ وَ تَشْدِيدِ الْأَمْرِ عَلَيْهِ",
          "en": "Chapter 15 – The necessity of the Proof<sup>asws</sup> upon the world and the emphasis of the matter upon it"
        }
      }
    ],
    "index": 16,
    "local_index": 15,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:2:15",
    "titles": {
      "ar": "بَابُ لُزُومِ الْحُجَّةِ عَلَى الْعَالِمِ وَ تَشْدِيدِ الْأَمْرِ عَلَيْهِ",
      "en": "Chapter 15 – The necessity of the Proof<sup>asws</sup> upon the world and the emphasis of the matter upon it"
    },
    "verse_count": 4,
    "verse_start_index": 121,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (151/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 122,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:15:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ يَا حَفْصُ يُغْفَرُ لِلْجَاهِلِ سَبْعُونَ ذَنْباً قَبْلَ أَنْ يُغْفَرَ لِلْعَالِمِ ذَنْبٌ وَاحِدٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim Bin Hashim, from his father, from Al Qasim Bin Muhammad Bin Al Minqary, from Hafs Bin Giyas, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘O Hafs! He<sup>azwj</sup> would Forgive seventy sins of the ignorant one before He<sup>azwj</sup> Forgives one sin of the scholar’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Ibrahim ibn Hashim has narrated from his father from al-Qasim ibn Muhammad from al-Minqari from Hafs ibn Ghiyath from abu ‘Abdallah (a.s.) who has said the following. “O Hafs, seventy sins of an ignorant person may be forgiven before only one sin of a learned person is forgiven.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/152)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 123,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:15:2",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ عِيسَى ابْنُ مَرْيَمَ عَلَى نَبِيِّنَا وَ آلِهِ وَ عَلَيْهِ السَّلَامُ وَيْلٌ لِلْعُلَمَاءِ السَّوْءِ كَيْفَ تَلَظَّى عَلَيْهِمُ النَّارُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Isa<sup>as</sup> Bin Maryam<sup>as</sup>, may peace be upon our Prophet<sup>as</sup>, said: ‘Woe be unto the evil scholars, how the Fire would be engulfing them!’’."
          ],
          "en.sarwar": [
            " 2. Through the same chain of narrators it is narrated from abu ‘Abdallah (a.s.) who has said the following. “Jesus son of Mary (s.a.) said, ‘Woe to bad scholars! If only they knew how raging fire will engulf them.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (152/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 124,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:15:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا بَلَغَتِ النَّفْسُ هَاهُنَا وَ أَشَارَ بِيَدِهِ إِلَى حَلْقِهِ لَمْ يَكُنْ لِلْعَالِمِ تَوْبَةٌ ثُمَّ قَرَأَ إِنَّمَا التَّوْبَةُ عَلَى اللَّهِ لِلَّذِينَ يَعْمَلُونَ السُّوءَ بِجَهالَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazan, altogether from Ibn Abu Umer, from Jameel Bin Darraj who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When the soul reaches over here’, and he<sup>asws</sup> indicated by his<sup>asws</sup> hand to his<sup>asws</sup> throat, ‘there would be no (chance of) repentance for the scholar’. Then he<sup>asws</sup> recited <span class=\"ibTxt\">[4:17] But rather, the Repentance with Allah is only for those who do evil in ignorance</span>’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim has narrated from his father and Muhammad ibn ’Isma‘il from al-Fadl ibn Shadhan, both from ibn abu ‘Umayr from Jamil ibn Darraj who has said the following. “(Imam) abu ‘Abdallah (a.s.) has said, “When the soul reaches here, pointing to his throat, there will be no chance for learned persons to repent. He recited this verse; “God will only accept the repentance of those who commit evil in ignorance, if they repent immediately. God is All-knowing and All-wise (4:17)”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/153)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (6/ 1)"
        ],
        "index": 125,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:15:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ أَبِي سَعِيدٍ الْمُكَارِي عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَكُبْكِبُوا فِيها هُمْ وَ الْغاوُونَ قَالَ هُمْ قَوْمٌ وَصَفُوا عَدْلًا بِأَلْسِنَتِهِمْ ثُمَّ خَالَفُوهُ إِلَى غَيْرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Abu Saeed Al Mukary, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[26:94] So they shall be flung into it, they and the erring ones</span>. He<sup>asws</sup> said: ‘They are a group who described justice with their tongues, then they opposed it to something else’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya al-Halabi from abu Sa‘id al-Mukari from abu Basir from abu Ja’far (a.s.) who has said the following. “Imam abu Ja‘far (a.s.) has said about the words of Allah in the holy Quran, ‘The idol worshippers, the idols, the rebellious ones, (26:94) and the army of Satan will all be thrown headlong into hell. (26:95)’ They are the people who speak about justice a great deal but in their own practice they would disregard it altogether.’”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:2:15",
  "kind": "verse_list"
}