{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:1:2:16",
        "titles": {
          "ar": "بَابُ النَّوَادِرِ",
          "en": "Chapter 16 – The Miscellaneous"
        }
      }
    ],
    "index": 17,
    "local_index": 16,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:1:2:17",
        "titles": {
          "ar": "بَابُ رِوَايَةِ الْكُتُبِ وَ الْحَدِيثِ وَ فَضْلِ الْكِتَابَةِ وَ التَّمَسُّكِ بِالْكُتُبِ",
          "en": "Chapter 17 – Reporting the books, and the Hadeeth, and the merits of the writing, and the attachment with the writings"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:1:2:15",
        "titles": {
          "ar": "بَابُ لُزُومِ الْحُجَّةِ عَلَى الْعَالِمِ وَ تَشْدِيدِ الْأَمْرِ عَلَيْهِ",
          "en": "Chapter 15 – The necessity of the Proof<sup>asws</sup> upon the world and the emphasis of the matter upon it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:2:16",
    "titles": {
      "ar": "بَابُ النَّوَادِرِ",
      "en": "Chapter 16 – The Miscellaneous"
    },
    "verse_count": 15,
    "verse_start_index": 125,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/152)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 126,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ رَفَعَهُ قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ رَوِّحُوا أَنْفُسَكُمْ بِبَدِيعِ الْحِكْمَةِ فَإِنَّهَا تَكِلُّ كَمَا تَكِلُّ الْأَبْدَانُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary who said, ",
            "‘Amir Al-Momineen<sup>asws</sup> was saying: ‘Rest your souls with the splendid wisdom, for these get tired just as the bodies get tired’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hafs ibn al-Bakhtari in a marfu’ manner from Amir al-Mu’minin Ali (a.s.) who has said the following. “Relax your souls with new sparks of wisdom, because souls also tire as bodies do.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/155)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 127,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ نُوحِ بْنِ شُعَيْبٍ النَّيْسَابُورِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ الدِّهْقَانِ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ عُرْوَةَ بْنِ أَخِي شُعَيْبٍ الْعَقَرْقُوفِيِّ عَنْ شُعَيْبٍ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ يَا طَالِبَ الْعِلْمِ إِنَّ الْعِلْمَ ذُو فَضَائِلَ كَثِيرَةٍ فَرَأْسُهُ التَّوَاضُعُ وَ عَيْنُهُ الْبَرَاءَةُ مِنَ الْحَسَدِ وَ أُذُنُهُ الْفَهْمُ وَ لِسَانُهُ الصِّدْقُ وَ حِفْظُهُ الْفَحْصُ وَ قَلْبُهُ حُسْنُ النِّيَّةِ وَ عَقْلُهُ مَعْرِفَةُ الْأَشْيَاءِ وَ الْأُمُورِ وَ يَدُهُ الرَّحْمَةُ وَ رِجْلُهُ زِيَارَةُ الْعُلَمَاءِ وَ هِمَّتُهُ السَّلَامَةُ وَ حِكْمَتُهُ الْوَرَعُ وَ مُسْتَقَرُّهُ النَّجَاةُ وَ قَائِدُهُ الْعَافِيَةُ وَ مَرْكَبُهُ الْوَفَاءُ وَ سِلَاحُهُ لِينُ الْكَلِمَةِ وَ سَيْفُهُ الرِّضَا وَ قَوْسُهُ الْمُدَارَاةُ وَ جَيْشُهُ مُحَاوَرَةُ الْعُلَمَاءِ وَ مَالُهُ الْأَدَبُ وَ ذَخِيرَتُهُ اجْتِنَابُ الذُّنُوبِ وَ زَادُهُ الْمَعْرُوفُ وَ مَاؤُهُ الْمُوَادَعَةُ وَ دَلِيلُهُ الْهُدَى وَ رَفِيقُهُ مَحَبَّةُ الْأَخْيَارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Nuh Bin Shuayb Al Neshapoury, from Ubedullah in Abdullah Al Dihqan, from Dorost Bin Abu Mansour, from Urwat a cousin of  Shuayb Al Aqarquqy, from Shuayb, from Abu Baseer who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Amir Al-Momineen<sup>asws</sup> was saying: ‘O seeker of knowledge! The knowledge is with a lot of merits. Its head is the humbleness, and its eyes is the disavowment from the envy, and its ear is the understanding, and its tongue is the truthfulness, and its memorisation is the investigation, and its heart is the good intention, and its intellect is the recognition of the things and the matters, and its hand is the mercy, and its leg is the visiting the scholars, and its mettle is the safety, and its wisdom is the piety, and its stability is the salvation, and its guide is the good health, and its ride is the loyalty, and its weapon is the softness of the speech, and consent frames his sword, and its bow is the politeness, and its army is the dialogue with the scholars, and its wealth is the discipline, and its treasure deposit is keeping away from the sins, and its provision is the good deeds, and its water is the cordiality, and its indicator is the guidance, and its friend is the love for the chosen ones<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. A number of our people has narrated from Ahmad ibn Muhammad from Nuh ibn Shu‘ayb al-Naysaburi from ‘Ubaydallah ibn ‘Abdallah al-Dihqan from Durust ibn abu Mansur from ’Urwa cousin of Shu‘ayb al-’Aqarqi from Shu‘ayb from abu Basir who has said the following. “(Imam) abu ‘Abdallah (a.s.) who has said that Imam Ali (a.s.) used to say, “O seekers of knowledge, knowledge (in a personified form) has a great deal of virtues. Humbleness is his head, freedom from jealousy forms his eyes, proper understanding shapes his ears, truthfulness constitutes his tongue, research and investigation produce his memory, optimism stands for his heart, the knowledge of facts and affairs strengthen his intellect. Intelligence and kindness are his hands, visitation of the scholars builds his legs, safety and peace emerge from his stamina, chastity develops his wisdom, salvation is his head quarters, good health and tranquility are his lead, loyalty will provide him his conveyance, politeness in communication gives him weapons, consent frames his sword, yielding to the truth stands for his bow and arrow, communication with the scholars establishes his army, proper discipline treasures his wealth, avoiding sins preserves his savings, uprightness institutes his supplies, amicable dealings supply him water, guidance determines his direction and love of virtuous people is the archetype for his friends.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/158)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 128,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) نِعْمَ وَزِيرُ الْإِيمَانِ الْعِلْمُ وَ نِعْمَ وَزِيرُ الْعِلْمِ الْحِلْمُ وَ نِعْمَ وَزِيرُ الْحِلْمِ الرِّفْقُ وَ نِعْمَ وَزِيرُ الرِّفْقِ الصَّبْرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammad Bin Usman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The best Vizier of the <span class=\"iTxt\">Eman</span> is the knowledge, and the best Vizier of the knowledge is the forbearance, and the best Vizier of the forbearance is the kindness, and the best Vizier of the kindness is the patience’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ahmad ibn Muhammad ibn abu Nasr from Hammad ibn ‘Uthman from abu ‘Abdallah (a.s.) who has said the following. “The holy Prophet has said, ‘The best minister for faith is knowledge, the best minister for knowledge is forbearance, the best minister for forbearance is amicable dealings and the best minister for amicable dealings is patience.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/158)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 129,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:4",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَيْمُونٍ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَنْ آبَائِهِ ( عليهم السلام ) قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ مَا الْعِلْمُ قَالَ الْإِنْصَاتُ قَالَ ثُمَّ مَهْ قَالَ الِاسْتِمَاعُ قَالَ ثُمَّ مَهْ قَالَ الْحِفْظُ قَالَ ثُمَّ مَهْ قَالَ الْعَمَلُ بِهِ قَالَ ثُمَّ مَهْ يَا رَسُولَ اللَّهِ قَالَ نَشْرُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al Ashary, from Abdullah Bin Maymoun Al Qaddah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> having said: ‘A man came over to Rasool-Allah<sup>saww</sup> and he said, ‘O Rasool-Allah<sup>saww</sup>! What is the knowledge?’ He<sup>saww</sup> said: ‘The silence’. He said, ‘Then what?’ He<sup>saww</sup> said: ‘The intent listening’. He said, ‘Then what?’ He<sup>saww</sup> said: ‘The memorisation’. He said, ‘Then what?’ He<sup>saww</sup> said: ‘The acting by it’. He said, ‘Then what, O Rasool-Allah<sup>saww</sup>?’ He<sup>saww</sup> said: ‘Propagating it (to the deserving ones)’’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash‘ari from ‘Abdallah ibn Maymun al-Qaddah from abu ‘Abdallah (a.s.) from his ancestors (the Imams (a.s.) who has said the following. “Once a man came to the holy Prophet (s.a.) and said, ‘O messenger of Allah what is knowledge?’ The holy Prophet replied, “It is silence.” The man then asked, “Then what?” The holy Prophet said, “It is listening.” The man asked, “Then what?” The holy Prophet (s.a.) said, “Then it is memorizing.” The man asked, “Then what?” The holy Prophet said, “Then it is practice accordingly.” The man then asked, “Then what O messenger of Allah?” The holy Prophet said, “Then it is to propagate what one has learned.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع وسنده الثاني مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/159)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 130,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ طَلَبَةُ الْعِلْمِ ثَلَاثَةٌ فَاعْرِفْهُمْ بِأَعْيَانِهِمْ وَ صِفَاتِهِمْ صِنْفٌ يَطْلُبُهُ لِلْجَهْلِ وَ الْمِرَاءِ وَ صِنْفٌ يَطْلُبُهُ لِلِاسْتِطَالَةِ وَ الْخَتْلِ وَ صِنْفٌ يَطْلُبُهُ لِلْفِقْهِ وَ الْعَقْلِ ",
          "فَصَاحِبُ الْجَهْلِ وَ الْمِرَاءِ مُوذٍ مُمَارٍ مُتَعَرِّضٌ لِلْمَقَالِ فِي أَنْدِيَةِ الرِّجَالِ بِتَذَاكُرِ الْعِلْمِ وَ صِفَةِ الْحِلْمِ قَدْ تَسَرْبَلَ بِالْخُشُوعِ وَ تَخَلَّى مِنَ الْوَرَعِ فَدَقَّ اللَّهُ مِنْ هَذَا خَيْشُومَهُ وَ قَطَعَ مِنْهُ حَيْزُومَهُ ",
          "وَ صَاحِبُ الِاسْتِطَالَةِ وَ الْخَتْلِ ذُو خِبٍّ وَ مَلَقٍ يَسْتَطِيلُ عَلَى مِثْلِهِ مِنْ أَشْبَاهِهِ وَ يَتَوَاضَعُ لِلْأَغْنِيَاءِ مِنْ دُونِهِ فَهُوَ لِحَلْوَائِهِمْ هَاضِمٌ وَ لِدِينِهِ حَاطِمٌ فَأَعْمَى اللَّهُ عَلَى هَذَا خُبْرَهُ وَ قَطَعَ مِنْ آثَارِ الْعُلَمَاءِ أَثَرَهُ ",
          "وَ صَاحِبُ الْفِقْهِ وَ الْعَقْلِ ذُو كَآبَةٍ وَ حَزَنٍ وَ سَهَرٍ قَدْ تَحَنَّكَ فِي بُرْنُسِهِ وَ قَامَ اللَّيْلَ فِي حِنْدِسِهِ يَعْمَلُ وَ يَخْشَى وَجِلًا دَاعِياً مُشْفِقاً مُقْبِلًا عَلَى شَأْنِهِ عَارِفاً بِأَهْلِ زَمَانِهِ مُسْتَوْحِشاً مِنْ أَوْثَقِ إِخْوَانِهِ فَشَدَّ اللَّهُ مِنْ هَذَا أَرْكَانَهُ وَ أَعْطَاهُ يَوْمَ الْقِيَامَةِ أَمَانَهُ .",
          "وَ حَدَّثَنِي بِهِ مُحَمَّدُ بْنُ مَحْمُودٍ أَبُو عَبْدِ اللَّهِ الْقَزْوِينِيُّ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا مِنْهُمْ جَعْفَرُ بْنُ مُحَمَّدٍ الصَّيْقَلِ بِقَزْوِينَ عَنْ أَحْمَدَ بْنِ عِيسَى الْعَلَوِيِّ عَنْ عَبَّادِ بْنِ صُهَيْبٍ الْبَصْرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup> having said: ‘The seekers of knowledge are three, so recognise them by their personalities and their description. There is a type who seeks it (to overcome) the ignorance and the disputes, and there is a type who seeks it for the domination and the deception, and there is a type who seeks it for the understanding and the intelligence. ",
            "So the one (seeking it for) the ignorance and the disputes is harmful, argumentative of the speech in the presence of the men by the discussion of the knowledge, and he would be described as forbearing by the one who has adorned with the humbleness, but he is devoid of the piety. May Allah<sup>azwj</sup> Hammer his nose (Condemn him) and cut off his heart and chest (Humiliate him). ",
            "And the one seeking is for the domination and the deception is with the swindle and enticement. He would dominate upon the likes of him who resemble him, and he would be revering to the rich ones from besides him. Thus, he would be digesting their sweets and breaking down his Religion. May Allah<sup>azwj</sup> Blind upon this of his news and Cut off the traces of such scholars of his traces. ",
            "And the one (seeking it for) the understanding and ‘الْعَقْلِ’ the intelligence is with the heartaches, and the grief, and the vigils, and would have covered his head in his robe, and stands (to pray) the night (<span class=\"iTxt\">Salat</span>) in his dark nights. He works hard, and he is fearful, apprehensive, supplicating, being compassionate, attentive upon his affairs, recognising the people of his time, scared of even the ones trustworthy of his brethren. So may Allah<sup style=\"font-weight: normal\">azwj</sup> Intensify His<sup style=\"font-weight: normal\">azwj</sup> Pillars from this one, and Give him security on the Day of Judgment’.  ",
            "<span style=\"font-size: small\">And it was narrated to me by Muhammad Bin Mahmoun Abu Abdullah Al Qazwiny, from a number of our companions, among them being Ja’far Bin Muhammad Al Sayqal, at Qazweek, from Ahmad Bin Isa, Al Alawy, from Abbad Bin Suheyb Al Basry,</span> from Abu Abdullah<sup>asws</sup>."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim in a marfu’ manner has narrated from abu ‘Abdallah (a.s.) who has said the following. “The seekers of knowledge are of three kinds. The more noticeable of them in person or character are: (a) the group who seeks knowledge for ignorance and quarrel. (b) The group who seeks knowledge to dominate and cheat others. (c) The group who seeks knowledge for proper understanding, Fiqh, and power of intelligence. The group whose purpose of seeking knowledge is ignorance and quarrel is a harmful and quarrelsome group. This group interrupts conversations in the gatherings of the people to speak about knowledge and the description of forbearance. Such people appear in the garb of the gentle and humble ones but, in fact, are devoid of all the qualities of the pious people. Allah has humiliated and has condemned this group. The group that seeks domination and cheating is a deceitful and flattering group. Such people try to dominate people of their kind and flatter the wealthy ones who know less than they do. Such people consume the sweetmeat of the rich people and destroy their own religion. May Allah banish the news of such people and cut off their traces from the history of the scholars. “The group that seeks knowledge for the sake of Fiqh, proper understanding, and to gain the power of intelligence consists of people who are deeply concerned and stay awake very often. They pull their robe on their heads and standup for prayer in the darkness of nights. They work hard anxiously and fearfully and pray with deep worries. They are very attentive of their affairs, knowledgeable of the people of their time and fearful even of their own trusted brothers. May Allah strengthen the corners of such people and grant them salvation on the Day of Judgment.” Narrated to me the above hadith Muhammad ibn Mahmud abu ‘Abdallah al-Qazwini from a number of our people of whom is Ja‘far in Muhammad al-Sayqal of Qazwin from Ahmad ibn ‘Isa al-‘Alawi from ‘Abbad ibn Suhayb al-Basri from abu ‘Abdallah (a.s.)."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (163/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 131,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ رُوَاةَ الْكِتَابِ كَثِيرٌ وَ إِنَّ رُعَاتَهُ قَلِيلٌ وَ كَمْ مِنْ مُسْتَنْصِحٍ لِلْحَدِيثِ مُسْتَغِشٍّ لِلْكِتَابِ فَالْعُلَمَاءُ يَحْزُنُهُمْ تَرْكُ الرِّعَايَةِ وَ الْجُهَّالُ يَحْزُنُهُمْ حِفْظُ الرِّوَايَةِ فَرَاعٍ يَرْعَى حَيَاتَهُ وَ رَاعٍ يَرْعَى هَلَكَتَهُ فَعِنْدَ ذَلِكَ اخْتَلَفَ الرَّاعِيَانِ وَ تَغَايَرَ الْفَرِيقَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Muhammad Bin Yahya, from Takha Bin Zayd who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The reporters of the Book are many but its due carers are few, and how many of the collectors of the Hadeeth, but are failures by the Book. The scholars are such that the neglect of the due care grieves them, and the ignorant are such that the preservation of the reports (Hadeeth) grieves them. So a shepherd is considering (preserving) its life, and a shepherd is considering (ensuring) its destruction. Thus, during that, the two shepherds are differing and the two sects are contradicting (each other)’."
          ],
          "en.sarwar": [
            " 6. Ali ibn Ibrahim has narrated from his father from Muhammad ibn Yahya from Talha ibn Zayd who has said the following. “(Imam) abu ‘Abdallah (a.s.) said, ‘The narrators of the book are a great many but those who would follow the proper discipline are very few. There are many, who are sincere about Hadith but mess up with the book. Lack of protection and discipline saddens the scholars and the (zeal) of ignorant ones to protect the (words of) narration (of a false text in reality) betrays the later group altogether. One kind of protectionism seeks protection of life and the other leads to its destruction and in such a situation the two forms of protectionism become different and the two groups distinct from each other.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (165/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 132,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:7",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ حَفِظَ مِنْ أَحَادِيثِنَا أَرْبَعِينَ حَدِيثاً بَعَثَهُ اللَّهُ يَوْمَ الْقِيَامَةِ عَالِماً فَقِيهاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Abdul Rahma Bin Abu Najran, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who preserves from our<sup>asws</sup> Ahadeeth, forty Ahadeeth, Allah<sup>azwj</sup> would Resurrect him on the Day of Judgment as a scholar, an understanding one (فَقِيهاً)’."
          ],
          "en.sarwar": [
            " 7. Al-Husayn ibn Muhammad al-Ash‘ari from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from ’Abd al-Rahman ibn abu Najran from one he mentioned from abu ‘Abdallah (a.s.) who has said the following. “Whoever would preserve and memorize forty of our Hadith on the Day of Judgment Allah will raise him as a scholar and Faqih, one with proper understanding of religion.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (167/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 133,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:8",
        "refs": {
          "Mentions": [
            "/books/quran:80:24"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ زَيْدٍ الشَّحَّامِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَلْيَنْظُرِ الْإِنْسانُ إِلى طَعامِهِ قَالَ قُلْتُ مَا طَعَامُهُ قَالَ عِلْمُهُ الَّذِي يَأْخُذُهُ عَمَّنْ يَأْخُذُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from the one who mentioned it, from Zayd Al Shahaam, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:80#h24\">[80:24]</a> Then let the human being look at his food</span>. I said, ‘What is his food?’ He<sup>asws</sup> said: ‘His knowledge which he is taking, from who he is taking it’."
          ],
          "en.sarwar": [
            " 8. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from his father from one he mentioned from Zayd al-Shahham from abu Ja’far (a.s.) who has said the following. “It is his knowledge that he acquires from whoever he acquires.” This he said in answer to the question ‘What is his food’ in the words of Allah, “Let the human being think about (how We produce) his food.” <a href=\"/#/books/quran:80#h24\">[80:24]</a>?’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/168)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/6)"
        ],
        "index": 134,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي سَعِيدٍ الزُّهْرِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْوُقُوفُ عِنْدَ الشُّبْهَةِ خَيْرٌ مِنَ الِاقْتِحَامِ فِي الْهَلَكَةِ وَ تَرْكُكَ حَدِيثاً لَمْ تُرْوَهُ خَيْرٌ مِنْ رِوَايَتِكَ حَدِيثاً لَمْ تُحْصِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Nu’man, from Abdullah Bin Muskan, from Dawood Bin Farqad, from Abu Saeed Al Zuhry, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The pausing at the doubtful (vagueness) is better than storming into the destruction; and refraining from reporting a Hadeeth which you have not verified, is better than your reporting a Hadeeth’."
          ],
          "en.sarwar": [
            " 9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn an-Ni‘man from ‘Abdallah ibn Muskan from Daiwud ibn Farqad from abu Sa‘id al-Zuhri from abu Ja’far (a.s.) who has said the following. “Holding back in an uncertain conditions is better than indulging in a destructive case. Your ignoring a Hadith that you do not narrate is better than your narrating a Hadith that you have not verified.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/169)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/6)"
        ],
        "index": 135,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:10",
        "refs": {
          "Mentions": [
            "/books/quran:16:43"
          ]
        },
        "text": [
          "مُحَمَّدٌ عَنْ أَحْمَدَ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ حَمْزَةَ بْنِ الطَّيَّارِ أَنَّهُ عَرَضَ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) بَعْضَ خُطَبِ أَبِيهِ حَتَّى إِذَا بَلَغَ مَوْضِعاً مِنْهَا قَالَ لَهُ كُفَّ وَ اسْكُتْ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا يَسَعُكُمْ فِيمَا يَنْزِلُ بِكُمْ مِمَّا لَا تَعْلَمُونَ إِلَّا الْكَفُّ عَنْهُ وَ التَّثَبُّتُ وَ الرَّدُّ إِلَى أَئِمَّةِ الْهُدَى حَتَّى يَحْمِلُوكُمْ فِيهِ عَلَى الْقَصْدِ وَ يَجْلُوا عَنْكُمْ فِيهِ الْعَمَى وَ يُعَرِّفُوكُمْ فِيهِ الْحَقَّ قَالَ اللَّهُ تَعَالَى فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad, from Ibn Fazzal, from Ibn Bukeyr, from Hamza Bin Al Tayyar that, ",
            "‘He presented to Abu Abdullah<sup>asws</sup> some of the sermons of his father, until when he reached a subject from it, he<sup>asws</sup> said to him: ‘Stop, and be silent’. Then Abu Abdullah<sup>asws</sup> said: ‘There is no leeway for you regarding what comes to you from what you do not know except to pause at that, and affirming, and referring it back to the Imams<sup>asws</sup> of the Guidance, until they<sup>asws</sup> deliver to you the purpose (of it), and they<sup>asws</sup> isolate from you the blindness in (that where you are going), and they<sup>asws</sup> make you recognise the truth in it. Allah<sup>azwj</sup> the Exalted Said <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h43\">[16:43]</a> so ask the People of the (Zikr) (Reminder) if you do not know</span>’."
          ],
          "en.sarwar": [
            " 10. Muhammad has narrated from Ahmad from ibn Faddal from ibn Bukayr from Hamza ibn al-Tayyar the following. “(Imam) abu ‘Abdallah (a.s.) said, ‘In the case of what may come to you and you have no knowledge of its veracity you can do nothing but to hold and verify and refer it to the Imams of guidance so that he would show the way of justice in it and enlighten you in the darkness and introduce to you the truth. Allah, the Most High has said, “Ask those who know about the heavenly Books if you do not know about this.”’’ <a href=\"/#/books/quran:16#h43\">[16:43]</a>"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/169)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 136,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْمِنْقَرِيِّ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَجَدْتُ عِلْمَ النَّاسِ كُلَّهُ فِي أَرْبَعٍ أَوَّلُهَا أَنْ تَعْرِفَ رَبَّكَ وَ الثَّانِي أَنْ تَعْرِفَ مَا صَنَعَ بِكَ وَ الثَّالِثُ أَنْ تَعْرِفَ مَا أَرَادَ مِنْكَ وَ الرَّابِعُ أَنْ تَعْرِفَ مَا يُخْرِجُكَ مِنْ دِينِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Qasim Bin Muhammad, from Al Minqary, from Sufyan Bin Uyayna who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘I<sup>asws</sup> found the knowledge of the people, all of it to be in four – the first of it is that you recognise your Lord<sup>azwj</sup>, and the second is that you recognise what He<sup>azwj</sup> has Done with (for) you, and the third is that you recognise what He<sup>azwj</sup> Intends from you, and the fourth is that you recognise what would (make you to) exit from your Religion’."
          ],
          "en.sarwar": [
            " 11. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad from al-Minqari from Sufyan ibn ‘Uyaynah who has said the following. “(Imam) abu ‘Abdallah (a.s.) who said, ‘I have found all the knowledge of people in four categories: (a) The knowledge that would teach you about your Lord. (b) The knowledge that would teach you what the Lord has done for you. (c) The knowledge that would teach you what the Lord wants from you. (d) The knowledge that would teach you what destroys your religion.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/170)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 137,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:12",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا حَقُّ اللَّهِ عَلَى خَلْقِهِ فَقَالَ أَنْ يَقُولُوا مَا يَعْلَمُونَ وَ يَكُفُّوا عَمَّا لَا يَعْلَمُونَ فَإِذَا فَعَلُوا ذَلِكَ فَقَدْ أَدَّوْا إِلَى اللَّهِ حَقَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is a right of Allah<sup>azwj</sup> upon His<sup>azwj</sup> creatures?’ So he<sup>asws</sup> said: ‘That they should be saying what they know, and they should be pausing from what they do not know. So when they do that, so they would have paid to Allah<sup>azwj</sup>, His<sup>azwj</sup> Right’."
          ],
          "en.sarwar": [
            " 12. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim who has said the following. “(Imam) abu ‘Abdallah (a.s.) said, ‘People must say only what they know and hold back from what they do not know. If they would do as such they have observed the rights of the Lord upon them.’” This he said in answer to a question from Hisham ibn Salim."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (170/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 138,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:13",
        "text": [
          "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ سِنَانٍ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ الْعِجْلِيِّ عَنْ عَلِيِّ بْنِ حَنْظَلَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ اعْرِفُوا مَنَازِلَ النَّاسِ عَلَى قَدْرِ رِوَايَتِهِمْ عَنَّا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Ibn Sinan, from Muhammad Bin Marwan Al Ijaly, from Ali Bin Hanzala who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Recognise the statuses of the people upon a measurement of their reporting from us<sup>asws</sup> (Our<sup>asws</sup> Ahadeeth)’."
          ],
          "en.sarwar": [
            " 13. Muhammad ibn al-Hassan from Sahl ibn Ziyad from ibn Sinan from Muhammad ibn Marwan al-‘Ijli from Ali ibn Hanzala who has said the following. “(Imam) abu ‘Abdallah (a.s.), said, ‘Note the position of the people from the degree of their narration of Hadith from us.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/171)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 139,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:14",
        "text": [
          "الْحُسَيْنُ بْنُ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ زَكَرِيَّا الْغَلَابِيِّ عَنِ ابْنِ عَائِشَةَ الْبَصْرِيِّ رَفَعَهُ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ فِي بَعْضِ خُطَبِهِ أَيُّهَا النَّاسُ اعْلَمُوا أَنَّهُ لَيْسَ بِعَاقِلٍ مَنِ انْزَعَجَ مِنْ قَوْلِ الزُّورِ فِيهِ وَ لَا بِحَكِيمٍ مَنْ رَضِيَ بِثَنَاءِ الْجَاهِلِ عَلَيْهِ النَّاسُ أَبْنَاءُ مَا يُحْسِنُونَ وَ قَدْرُ كُلِّ امْرِئٍ مَا يُحْسِنُ فَتَكَلَّمُوا فِي الْعِلْمِ تَبَيَّنْ أَقْدَارُكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Al Hassan, from Muhammad Bin Zakariyya Al Ghalaby, from Ibn Ayesha Al Basry, ",
            "(It has been narrated) raising it that Amir Al-Momineen<sup>asws</sup> said in one of his<sup>asws</sup> sermons: ‘O you people! Know that he is not with intelligence, the one who does not get agitated by the false words (put to him), nor is he with wisdom, the one who is pleased with the eulogies of the ignorant ones upon him. The people are the sons of what they are good at, and a worth of every person is what he is good at. Therefore, speak regarding the knowledge, your worth would be manifested’."
          ],
          "en.sarwar": [
            " 14. Al-Husayn ibn al-Hassan has narrated from Muhammad ibn Zakariyya al-Ghalibi from ibn ‘A’isha al-Basri in a marfu‘ manner (rafa’ahu) Amir al-Mu’minin Ali (a.s.) who has said the following. “In certain parts of his sermons he said, ‘O people, know that there is no man of intelligence who would become disappointed for a lie spoken about him. There is no man of wisdom who would become pleased with the praises of ignorant people of him. People are children of what they do best and the value of a man is what he does best. Speak knowledge it will manifest your value.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (172/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 140,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:16:15",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ وَ عِنْدَهُ رَجُلٌ مِنْ أَهْلِ الْبَصْرَةِ يُقَالُ لَهُ عُثْمَانُ الْأَعْمَى وَ هُوَ يَقُولُ إِنَّ الْحَسَنَ الْبَصْرِيَّ يَزْعُمُ أَنَّ الَّذِينَ يَكْتُمُونَ الْعِلْمَ يُؤْذِي رِيحُ بُطُونِهِمْ أَهْلَ النَّارِ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَهَلَكَ إِذَنْ مُؤْمِنُ آلِ فِرْعَوْنَ مَا زَالَ الْعِلْمُ مَكْتُوماً مُنْذُ بَعَثَ اللَّهُ نُوحاً ( عليه السلام ) فَلْيَذْهَبِ الْحَسَنُ يَمِيناً وَ شِمَالًا فَوَ اللَّهِ مَا يُوجَدُ الْعِلْمُ إِلَّا هَاهُنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Aban Bin Usman, from Abdullah Bin Suleyman who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying, and in his<sup>asws</sup> presence was a man from the people of Al-Basra called Usman the blind one, and he was saying, ‘Al-Hassan Al-Basry is alleging that those who are concealing the knowledge would be harming the inhabitants of the Fire by a wind of their bellies’. So Abu Ja’far<sup>asws</sup> said: ‘So, destroyed then, is the Believer of the people of the Pharaoh<sup>la</sup>. The knowledge has not ceased to be concealed since Allah<sup>azwj</sup> Sent Noah<sup>as</sup>. Therefore, let Al-Hassan (Al-Basry) go right and left, for by Allah<sup>azwj</sup>, he would not find the knowledge except over here’."
          ],
          "en.sarwar": [
            " 15. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from Aban ibn ‘Uthman from ‘Abdallah ibn Sulayman who has said the following. ‘(Imam) abu Ja‘far (a.s.) said to a man from Basra called ‘Uthman al-A’ma who would keep saying, “Al-Hassan al-Basri believes that those who hide knowledge the bad odor from their stomach will cause suffering to the people of hell.” The Imam said, “The true believer of the people of Pharaoh is then destroyed. Knowledge from the time of Noah became veiled (s.a). Let Hassan go left and right. I swear by Allah he will not find knowledge in no other place but here with us.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:2:16",
  "kind": "verse_list"
}