{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:1:2:18",
        "titles": {
          "ar": "بَابُ التَّقْلِيدِ",
          "en": "Chapter 18 – The Taqleed (Emulation)"
        }
      }
    ],
    "index": 19,
    "local_index": 18,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:1:2:19",
        "titles": {
          "ar": "بَابُ الْبِدَعِ وَ الرَّأْيِ وَ الْمَقَايِيسِ",
          "en": "Chapter 19 – The innovation, and the opinion, and the analogies"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:1:2:17",
        "titles": {
          "ar": "بَابُ رِوَايَةِ الْكُتُبِ وَ الْحَدِيثِ وَ فَضْلِ الْكِتَابَةِ وَ التَّمَسُّكِ بِالْكُتُبِ",
          "en": "Chapter 17 – Reporting the books, and the Hadeeth, and the merits of the writing, and the attachment with the writings"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:2:18",
    "titles": {
      "ar": "بَابُ التَّقْلِيدِ",
      "en": "Chapter 18 – The Taqleed (Emulation)"
    },
    "verse_count": 3,
    "verse_start_index": 155,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/183)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (7/ 1)"
        ],
        "index": 156,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:18:1",
        "refs": {
          "Quran": [
            "/books/quran:9:31"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ اتَّخَذُوا أَحْبارَهُمْ وَ رُهْبانَهُمْ أَرْباباً مِنْ دُونِ اللَّهِ فَقَالَ أَمَا وَ اللَّهِ مَا دَعَوْهُمْ إِلَى عِبَادَةِ أَنْفُسِهِمْ وَ لَوْ دَعَوْهُمْ مَا أَجَابُوهُمْ وَ لَكِنْ أَحَلُّوا لَهُمْ حَرَاماً وَ حَرَّمُوا عَلَيْهِمْ حَلَالًا فَعَبَدُوهُمْ مِنْ حَيْثُ لَا يَشْعُرُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Abdullah Bin Yahya, from Ibn Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘(What about the Verse) <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h31\">[9:31]</a> They are taking their Rabbis and their Monks for lords besides Allah</span>?’ So he<sup>asws</sup> said: ‘But, by Allah<sup>azwj</sup>! They (their priests) did not call to them their own worship. And had they called them, they would not have responded. But, they (priests) permitted for them what was Prohibited, and they prohibited what was Permissible. Thus, they worshipped them (indirectly) from where (an aspect) they were not aware’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from ’Abdallah ibn Yahya from ibn Muskan from abu Basir who has said the following. “I asked Imam abu ‘Abdallah (a.s.) about the verse of the holy Quran that says, ‘They (unconditionally) obeyed the rabbis and the monks and worshipped the Messiah, son of Mary, as they should have obeyed God. . <a href=\"/#/books/quran:9#h31\">[9:31]</a>’. The Imam replied, “By Allah they did not call people to worship them. If they had done so people would not have accepted it. The Rabbis and monks made unlawful things lawful for them and the lawful things as lawful. And in this way they worshipped them unintentionally.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/184)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 157,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:18:2",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْهَمَذَانِيِّ عَنْ مُحَمَّدِ بْنِ عُبَيْدَةَ قَالَ قَالَ لِي أَبُو الْحَسَنِ ( عليه السلام ) يَا مُحَمَّدُ أَنْتُمْ أَشَدُّ تَقْلِيداً أَمِ الْمُرْجِئَةُ قَالَ قُلْتُ قَلَّدْنَا وَ قَلَّدُوا فَقَالَ لَمْ أَسْأَلْكَ عَنْ هَذَا فَلَمْ يَكُنْ عِنْدِي جَوَابٌ أَكْثَرُ مِنَ الْجَوَابِ الْأَوَّلِ فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) إِنَّ الْمُرْجِئَةَ نَصَبَتْ رَجُلًا لَمْ تَفْرِضْ طَاعَتَهُ وَ قَلَّدُوهُ وَ أَنْتُمْ نَصَبْتُمْ رَجُلًا وَ فَرَضْتُمْ طَاعَتَهُ ثُمَّ لَمْ تُقَلِّدُوهُ فَهُمْ أَشَدُّ مِنْكُمْ تَقْلِيداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ibrahim Bin Muhammad Al Hamdany, from Muhammad Bin Ubeyda who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> said to me: ‘O Muhammad! Are you more intense of <span class=\"iTxt\">Taqleed</span> or the Murjiites?’ I said, ‘We are in <span class=\"iTxt\">Taqleed</span> and they are in <span class=\"iTxt\">Taqleed</span>’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> did not ask you about this’. So there was no answer with me, any more than the first answer. So Abu Al-Hassan<sup>asws</sup> said: ‘The Murjiites established a man whose obedience was not Obligated, and they did his <span class=\"iTxt\">Taqleed</span>, and you established a man<sup>asws</sup>, and obedience to him<sup>asws</sup> is Obligatory, then you are not doing his<sup>asws</sup> <span class=\"iTxt\">Taqleed</span>. Thus, they are more intense than you of <span class=\"iTxt\">Taqleed</span>’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ibrahim ibn Muhammad al-Hamdani from Muhammad ibn ‘Ubayda who has said the following. “Abu al-Hassan (a.s.) said, ‘O Muhammad, Do you observe Taqlid more strictly or the group of Murji’a?’ Muhammad ibn ‘ubaydah has said, “I replied, ‘They observe Taqlid and we observe Taqlid.’ The Imam then said, “I did not ask you about this.” I did not have any answer other than the first one. The Imam then said, “The group of Murji’a chose a man whose obedience was not obligatory (in the commands of Allah) but they obeyed and followed him strictly. You chose a man and considered obedience to him necessary (in commands from Allah) and then you did not follow him strictly, therefore, they are more strict in Taqlid, following than you are.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (185/ 1)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi"
        ],
        "index": 158,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:18:3",
        "refs": {
          "Quran": [
            "/books/quran:9:31"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ جَلَّ وَ عَزَّ اتَّخَذُوا أَحْبارَهُمْ وَ رُهْبانَهُمْ أَرْباباً مِنْ دُونِ اللَّهِ فَقَالَ وَ اللَّهِ مَا صَامُوا لَهُمْ وَ لَا صَلَّوْا لَهُمْ وَ لَكِنْ أَحَلُّوا لَهُمْ حَرَاماً وَ حَرَّمُوا عَلَيْهِمْ حَلَالًا فَاتَّبَعُوهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Hammad Bin Isa, from Rabie Bin Abdullah, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Majestic and Mighty <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h31\">[9:31]</a> They are taking their Rabbis and their Monks for lords besides Allah</span>. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! They (people) neither Fasted for them (priests) nor prayed to them. But they (priests) permitted for them the Prohibitions, and they prohibited to them the Permissible. Thus they (people) worshipped them (priests)’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from Hammed ibn ‘Isa from Rib‘i ibn ‘Abdallah from abu Basir from abu ‘Abdallah (a.s.) who has said the following. “They (unconditionally) obeyed the rabbis and the monks and worshipped the Messiah, son of Mary, as they should have obeyed God . <a href=\"/#/books/quran:9#h31\">[9:31]</a>.’ “By Allah, they (the people) did not pray or fast for them (rabbis and monks) but they (rabbis and monks) made lawful for the people what was unlawful and unlawful what was lawful and people followed them accordingly.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:2:18",
  "kind": "verse_list"
}