{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:1:2:21",
        "titles": {
          "ar": "بَابُ اخْتِلَافِ الْحَدِيثِ",
          "en": "Chapter 21 – Differences in the Hadeeth"
        }
      }
    ],
    "index": 22,
    "local_index": 21,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:1:2:22",
        "titles": {
          "ar": "بَابُ الْأَخْذِ بِالسُّنَّةِ وَ شَوَاهِدِ الْكِتَابِ",
          "en": "Chapter 22 – The taking by the Sunnah and the evidence of the Book (Quran)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:1:2:20",
        "titles": {
          "ar": "بَابُ الرَّدِّ إِلَى الْكِتَابِ وَ السُّنَّةِ وَ أَنَّهُ لَيْسَ شَيْ‏ءٌ مِنَ الْحَلَالِ وَ الْحَرَامِ وَ جَمِيعِ مَا يَحْتَاجُ النَّاسُ إِلَيْهِ إِلَّا وَ قَدْ جَاءَ فِيهِ كِتَابٌ أَوْ سُنَّةٌ",
          "en": "Chapter 20 – The referring to the Book and the Sunnah, and that there is nothing from the Permissible and the Prohibition and the entirety of what the people would be need to except that the Book or Sunnah has come with it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:2:21",
    "titles": {
      "ar": "بَابُ اخْتِلَافِ الْحَدِيثِ",
      "en": "Chapter 21 – Differences in the Hadeeth"
    },
    "verse_count": 10,
    "verse_start_index": 190,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور ومعتبر عند ي   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/210)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 191,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:21:1",
        "refs": {
          "Quran": [
            "/books/quran:63:4",
            "/books/quran:59:7"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ أَبَانِ بْنِ أَبِي عَيَّاشٍ عَنْ سُلَيْمِ بْنِ قَيْسٍ الْهِلَالِيِّ قَالَ قُلْتُ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) إِنِّي سَمِعْتُ مِنْ سَلْمَانَ وَ الْمِقْدَادِ وَ أَبِي ذَرٍّ شَيْئاً مِنْ تَفْسِيرِ الْقُرْآنِ وَ أَحَادِيثَ عَنْ نَبِيِّ اللَّهِ ( صلى الله عليه وآله ) غَيْرَ مَا فِي أَيْدِي النَّاسِ ثُمَّ سَمِعْتُ مِنْكَ تَصْدِيقَ مَا سَمِعْتُ مِنْهُمْ وَ رَأَيْتُ فِي أَيْدِي النَّاسِ أَشْيَاءَ كَثِيرَةً مِنْ تَفْسِيرِ الْقُرْآنِ وَ مِنَ الْأَحَادِيثِ عَنْ نَبِيِّ اللَّهِ ( صلى الله عليه وآله ) أَنْتُمْ تُخَالِفُونَهُمْ فِيهَا وَ تَزْعُمُونَ أَنَّ ذَلِكَ كُلَّهُ بَاطِلٌ أَ فَتَرَى النَّاسَ يَكْذِبُونَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مُتَعَمِّدِينَ وَ يُفَسِّرُونَ الْقُرْآنَ بِآرَائِهِمْ ",
          "قَالَ فَأَقْبَلَ عَلَيَّ فَقَالَ قَدْ سَأَلْتَ فَافْهَمِ الْجَوَابَ إِنَّ فِي أَيْدِي النَّاسِ حَقّاً وَ بَاطِلًا وَ صِدْقاً وَ كَذِباً وَ نَاسِخاً وَ مَنْسُوخاً وَ عَامّاً وَ خَاصّاً وَ مُحْكَماً وَ مُتَشَابِهاً وَ حِفْظاً وَ وَهَماً وَ قَدْ كُذِبَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عَلَى عَهْدِهِ حَتَّى قَامَ خَطِيباً فَقَالَ أَيُّهَا النَّاسُ قَدْ كَثُرَتْ عَلَيَّ الْكَذَّابَةُ فَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّداً فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ",
          "ثُمَّ كُذِبَ عَلَيْهِ مِنْ بَعْدِهِ وَ إِنَّمَا أَتَاكُمُ الْحَدِيثُ مِنْ أَرْبَعَةٍ لَيْسَ لَهُمْ خَامِسٌ",
          "رَجُلٍ مُنَافِقٍ يُظْهِرُ الْإِيمَانَ مُتَصَنِّعٍ بِالْإِسْلَامِ لَا يَتَأَثَّمُ وَ لَا يَتَحَرَّجُ أَنْ يَكْذِبَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مُتَعَمِّداً فَلَوْ عَلِمَ النَّاسُ أَنَّهُ مُنَافِقٌ كَذَّابٌ لَمْ يَقْبَلُوا مِنْهُ وَ لَمْ يُصَدِّقُوهُ وَ لَكِنَّهُمْ قَالُوا هَذَا قَدْ صَحِبَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ رَآهُ وَ سَمِعَ مِنْهُ وَ أَخَذُوا عَنْهُ وَ هُمْ لَا يَعْرِفُونَ حَالَهُ",
          "وَ قَدْ أَخْبَرَهُ اللَّهُ عَنِ الْمُنَافِقِينَ بِمَا أَخْبَرَهُ وَ وَصَفَهُمْ بِمَا وَصَفَهُمْ فَقَالَ عَزَّ وَ جَلَّ وَ إِذا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسامُهُمْ وَ إِنْ يَقُولُوا تَسْمَعْ لِقَوْلِهِمْ ثُمَّ بَقُوا بَعْدَهُ فَتَقَرَّبُوا إِلَى أَئِمَّةِ الضَّلَالَةِ وَ الدُّعَاةِ إِلَى النَّارِ بِالزُّورِ وَ الْكَذِبِ وَ الْبُهْتَانِ فَوَلَّوْهُمُ الْأَعْمَالَ وَ حَمَلُوهُمْ عَلَى رِقَابِ النَّاسِ وَ أَكَلُوا بِهِمُ الدُّنْيَا وَ إِنَّمَا النَّاسُ مَعَ الْمُلُوكِ وَ الدُّنْيَا إِلَّا مَنْ عَصَمَ اللَّهُ فَهَذَا أَحَدُ الْأَرْبَعَةِ ",
          "وَ رَجُلٍ سَمِعَ مِنْ رَسُولِ اللَّهِ شَيْئاً لَمْ يَحْمِلْهُ عَلَى وَجْهِهِ وَ وَهِمَ فِيهِ وَ لَمْ يَتَعَمَّدْ كَذِباً فَهُوَ فِي يَدِهِ يَقُولُ بِهِ وَ يَعْمَلُ بِهِ وَ يَرْوِيهِ فَيَقُولُ أَنَا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَلَوْ عَلِمَ الْمُسْلِمُونَ أَنَّهُ وَهِمَ لَمْ يَقْبَلُوهُ وَ لَوْ عَلِمَ هُوَ أَنَّهُ وَهِمَ لَرَفَضَهُ ",
          "وَ رَجُلٍ ثَالِثٍ سَمِعَ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) شَيْئاً أَمَرَ بِهِ ثُمَّ نَهَى عَنْهُ وَ هُوَ لَا يَعْلَمُ أَوْ سَمِعَهُ يَنْهَى عَنْ شَيْ‏ءٍ ثُمَّ أَمَرَ بِهِ وَ هُوَ لَا يَعْلَمُ فَحَفِظَ مَنْسُوخَهُ وَ لَمْ يَحْفَظِ النَّاسِخَ وَ لَوْ عَلِمَ أَنَّهُ مَنْسُوخٌ لَرَفَضَهُ وَ لَوْ عَلِمَ الْمُسْلِمُونَ إِذْ سَمِعُوهُ مِنْهُ أَنَّهُ مَنْسُوخٌ لَرَفَضُوهُ",
          "وَ آخَرَ رَابِعٍ لَمْ يَكْذِبْ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مُبْغِضٍ لِلْكَذِبِ خَوْفاً مِنَ اللَّهِ وَ تَعْظِيماً لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَمْ يَنْسَهُ بَلْ حَفِظَ مَا سَمِعَ عَلَى وَجْهِهِ فَجَاءَ بِهِ كَمَا سَمِعَ لَمْ يَزِدْ فِيهِ وَ لَمْ يَنْقُصْ مِنْهُ وَ عَلِمَ النَّاسِخَ مِنَ الْمَنْسُوخِ فَعَمِلَ بِالنَّاسِخِ وَ رَفَضَ الْمَنْسُوخَ",
          "فَإِنَّ أَمْرَ النَّبِيِّ ( صلى الله عليه وآله ) مِثْلُ الْقُرْآنِ نَاسِخٌ وَ مَنْسُوخٌ وَ خَاصٌّ وَ عَامٌّ وَ مُحْكَمٌ وَ مُتَشَابِهٌ قَدْ كَانَ يَكُونُ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الْكَلَامُ لَهُ وَجْهَانِ كَلَامٌ عَامٌّ وَ كَلَامٌ خَاصٌّ مِثْلُ الْقُرْآنِ وَ قَالَ اللَّهُ عَزَّ وَ جَلَّ فِي كِتَابِهِ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا",
          "فَيَشْتَبِهُ عَلَى مَنْ لَمْ يَعْرِفْ وَ لَمْ يَدْرِ مَا عَنَى اللَّهُ بِهِ وَ رَسُولُهُ ( صلى الله عليه وآله ) وَ لَيْسَ كُلُّ أَصْحَابِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَسْأَلُهُ عَنِ الشَّيْ‏ءِ فَيَفْهَمُ وَ كَانَ مِنْهُمْ مَنْ يَسْأَلُهُ وَ لَا يَسْتَفْهِمُهُ حَتَّى إِنْ كَانُوا لَيُحِبُّونَ أَنْ يَجِي‏ءَ الْأَعْرَابِيُّ وَ الطَّارِئُ فَيَسْأَلَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حَتَّى يَسْمَعُوا",
          "وَ قَدْ كُنْتُ أَدْخُلُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) كُلَّ يَوْمٍ دَخْلَةً وَ كُلَّ لَيْلَةٍ دَخْلَةً فَيُخَلِّينِي فِيهَا أَدُورُ مَعَهُ حَيْثُ دَارَ وَ قَدْ عَلِمَ أَصْحَابُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَنَّهُ لَمْ يَصْنَعْ ذَلِكَ بِأَحَدٍ مِنَ النَّاسِ غَيْرِي فَرُبَّمَا كَانَ فِي بَيْتِي يَأْتِينِي رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَكْثَرُ ذَلِكَ فِي بَيْتِي وَ كُنْتُ إِذَا دَخَلْتُ عَلَيْهِ بَعْضَ مَنَازِلِهِ أَخْلَانِي وَ أَقَامَ عَنِّي نِسَاءَهُ",
          "فَلَا يَبْقَى عِنْدَهُ غَيْرِي وَ إِذَا أَتَانِي لِلْخَلْوَةِ مَعِي فِي مَنْزِلِي لَمْ تَقُمْ عَنِّي فَاطِمَةُ وَ لَا أَحَدٌ مِنْ بَنِيَّ وَ كُنْتُ إِذَا سَأَلْتُهُ أَجَابَنِي وَ إِذَا سَكَتُّ عَنْهُ وَ فَنِيَتْ مَسَائِلِي ابْتَدَأَنِي",
          "فَمَا نَزَلَتْ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) آيَةٌ مِنَ الْقُرْآنِ إِلَّا أَقْرَأَنِيهَا وَ أَمْلَاهَا عَلَيَّ فَكَتَبْتُهَا بِخَطِّي وَ عَلَّمَنِي تَأْوِيلَهَا وَ تَفْسِيرَهَا وَ نَاسِخَهَا وَ مَنْسُوخَهَا وَ مُحْكَمَهَا وَ مُتَشَابِهَهَا وَ خَاصَّهَا وَ عَامَّهَا وَ دَعَا اللَّهَ أَنْ يُعْطِيَنِي فَهْمَهَا وَ حِفْظَهَا فَمَا نَسِيتُ آيَةً مِنْ كِتَابِ اللَّهِ وَ لَا عِلْماً أَمْلَاهُ عَلَيَّ وَ كَتَبْتُهُ مُنْذُ دَعَا اللَّهَ لِي بِمَا دَعَا",
          "وَ مَا تَرَكَ شَيْئاً عَلَّمَهُ اللَّهُ مِنْ حَلَالٍ وَ لَا حَرَامٍ وَ لَا أَمْرٍ وَ لَا نَهْيٍ كَانَ أَوْ يَكُونُ وَ لَا كِتَابٍ مُنْزَلٍ عَلَى أَحَدٍ قَبْلَهُ مِنْ طَاعَةٍ أَوْ مَعْصِيَةٍ إِلَّا عَلَّمَنِيهِ وَ حَفِظْتُهُ فَلَمْ أَنْسَ حَرْفاً وَاحِداً ",
          "ثُمَّ وَضَعَ يَدَهُ عَلَى صَدْرِي وَ دَعَا اللَّهَ لِي أَنْ يَمْلَأَ قَلْبِي عِلْماً وَ فَهْماً وَ حُكْماً وَ نُوراً فَقُلْتُ يَا نَبِيَّ اللَّهِ بِأَبِي أَنْتَ وَ أُمِّي مُنْذُ دَعَوْتَ اللَّهَ لِي بِمَا دَعَوْتَ لَمْ أَنْسَ شَيْئاً وَ لَمْ يَفُتْنِي شَيْ‏ءٌ لَمْ أَكْتُبْهُ أَ فَتَتَخَوَّفُ عَلَيَّ النِّسْيَانَ فِيمَا بَعْدُ فَقَالَ لَا لَسْتُ أَتَخَوَّفُ عَلَيْكَ النِّسْيَانَ وَ الْجَهْلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim Bin Hashim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar Al Yamani, from Aban Bin Abu Ayyash, from Suleym Bin Qays Al Hilaly who said, ",
            "‘I said to Amir Al-Momineen<sup>asws</sup>, ‘I heard from Salman<sup>ra</sup> and Al-Miqdad<sup>ra</sup> and Abu Zarr<sup>ra</sup>, something from the interpretation of the Quran and the Ahadeeth from the Prophet<sup>saww</sup> of Allah<sup>azwj</sup>, other than what is in the hands of the people. Then I heard from you<sup>asws</sup> the ratification of what I had heard from them<sup>ra</sup>; and I see a lot of things to be in the hands of the people, from the interpretation of the Quran and from the Ahadeeth from the Prophet<sup>saww</sup> of Allah<sup>azwj</sup>. You<sup>asws</sup> are differing from them in it, and you<sup>asws</sup> are claiming that, all of that (which they interpret) is false. So, are you<sup>asws</sup> viewing that the people are lying upon Rasool-Allah<sup>saww</sup> deliberately, and they are interpreting the Quran by their own opinions?’ ",
            "He (Suleymn Bin Qays) said, ‘So Ali<sup>asws</sup> turned to face me and he<sup>asws</sup> said: ‘You have asked, so understand the answer. In the hands of the people there is right, and wrong, and truthfulness and lies, and Abrogating and Abrogated, and general and specific, and Decisive and Allegorical, and memorised and delusions. And (it was so) that Rasool-Allah<sup>saww</sup> had been belied upon during his<sup>saww</sup> era, to the extent that he<sup>saww</sup> stood up and addressed, so he<sup>saww</sup> said: ‘O you people! The people have lied a lot upon me<sup>saww</sup>. So the one who lies upon me<sup>saww</sup> deliberately, so let him assume his seat from the Fire’. ",
            "Then he<sup>saww</sup> was belied upon from after him<sup>saww</sup>, and rather the Ahadeeth came to you all from four (types of people). There is not fifth (narrator) for them. ",
            "A hypocrite man who manifested the <span class=\"iTxt\">Eman</span> pretending with Al-Islam. Neither did he consider it a sin nor anything wrong with deliberately lying upon Rasool-Allah<sup>saww</sup>. So, had the people known that he is a lying hypocrite, they would not have accepted from him and would not have believed in him. But, they said, ‘This one has accompanied Rasool-Allah<sup>saww</sup>, and had seen him<sup>saww</sup> and heard from him<sup>saww</sup>’, and they took from him and there were not recognising his state. ",
            "And Allah<sup>azwj</sup> had Informed about the hypocrites with what He<sup>azwj</sup> Informed, and Described them with what He<sup>azwj</sup> Described them. So He<sup>azwj</sup> the Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:63#h4\">[63:4]</a> And when you see them, their persons would please you, and If they speak, you will listen to their speech</span>. Then they remained after him<sup>saww</sup>, so they went closer to the leaders of misguidance and the inviters of the Fire with the false testimonies, and the lies, and the accusations. Thus, they made them office-bearers and carried them upon ruling over the people, and they (the rulers) devoured the world through them, and rather, the people are (always) with the kings and the world except for the ones whom Allah<sup>azwj</sup> Protects. So this is one of the four (types of narrators of Ahadeeth)’.  ",
            "And a man who heard something from Rasool-Allah<sup>saww</sup>, but did not preserve it’s all aspect and them became uncertain about it, and he did not lie deliberately. So it was in his hands (and) he was speaking by it, and acting by it, and narrating with it, and he was saying, ‘I heard it from Rasool-Allah<sup>saww</sup>’. So, had the Muslims known that he was deluded, they would not have accepted it, and had he himself known that it was a delusion, he would have rejected it (himself).",
            "And a third man who heard something from Rasool-Allah<sup>saww</sup> he<sup>saww</sup> had ordered with, then he<sup>saww</sup> forbade from it, and he did not know (of the prohibition), or he heard him<sup>saww</sup> forbidding from something, then he<sup>saww</sup> ordered with it, and he did not know (of the order). Thus he preserved the Abrogated and did not preserve the Abrogating, and had he known that he<sup>saww</sup> had Abrogated it, he would have rejected it (himself), and had the Muslims known that when he had heard from him<sup>saww</sup>, it was actually Abrogated, they would have rejected it.",
            "And the fourth (type of narrator) did not lie upon Rasool-Allah<sup>saww</sup>, hated the lie out of fear of Allah<sup>azwj</sup> and reverence (respect) to Rasool-Allah<sup>saww</sup>. He did not forget, and he did preserve whatever he heard upon its (correct) aspect. So he came with it just as he had heard, and he did not increase in it and did not reduce from it, and he knew the Abrogating from the Abrogated (orders), thus he acted by the Abrogating and rejected the Abrogated.",
            "So the order of the Prophet<sup>saww</sup> is like the (order of the) Quran, Abrogating and Abrogated, and particular and general, and Decisive and Allegorical. There have happened to be the speech from Rasool-Allah<sup>saww</sup> having two aspects for it – a general speech and a particular speech, similar to the Quran. And Allah<sup>azwj</sup> Mighty and Majestic Said in His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:59#h7\">[59:7]</a> whatever the Rasool gives you, accept it, and from whatever he forbids you, keep back</span>.",
            "So it was doubtful upon the one who did not recognise and did not know what Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> Meant by it. And every companions of Rasool-Allah<sup>azwj</sup> was not such that everyone who asked him about something, so he understood; and there were from them ones who were asked and they did not understand, to the extent that they used to love that a Bedouin and a stranger would come over, so he would ask Rasool-Allah<sup>saww</sup> so that they would be listening.  ",
            "And I<sup>asws</sup> used to go over to Rasool-Allah<sup>saww</sup> every day for a meeting, and every night for a meeting. So he<sup>saww</sup> would isolate himself<sup>saww</sup> with me<sup>asws</sup>, going around with him<sup>saww</sup> wherever he<sup>saww</sup> went, and the companions of Rasool-Allah<sup>saww</sup> knew that he<sup>saww</sup> did not hold (those meetings) that with anyone from the people apart from me<sup>asws</sup>. So, sometimes it would be in my<sup>asws</sup> house. Rasool-Allah<sup>saww</sup> would mostly hold (consultations) that in my<sup>asws</sup> house; and whenever I<sup>asws</sup> went over to him<sup>saww</sup> in one of his<sup>saww</sup> rooms, he<sup>saww</sup> would isolate with me<sup>asws</sup>, and tell his<sup>saww</sup> womenfolk to arise (to go away) from me<sup>asws</sup>. ",
            "So there would not remain in his<sup>saww</sup> presence anyone apart from me<sup>asws</sup>. And whenever he<sup>saww</sup> came over to me<sup>asws</sup> in my<sup>asws</sup> house, Syeda Fatima<sup>asws</sup> would not arise from me<sup>asws</sup>, nor would anyone from my<sup>asws</sup> two sons<sup>asws</sup> (as among the Purified Ones) And it was so that whenever I<sup>asws</sup> asked him<sup>saww</sup>, he<sup>saww</sup> answered me<sup>asws</sup>, and whenever I<sup>asws</sup> was silent from him<sup>saww</sup> and my<sup>asws</sup> questions had finished, he<sup>saww</sup> would initiate (a discussion) me<sup>asws</sup>. ",
            "Thus, whatever was Revealed unto Rasool-Allah<sup>saww</sup> a Verse from the Quran except that he<sup>saww</sup> recited it and dictated it to me<sup>asws</sup>. So I<sup>asws</sup> wrote it down by my<sup>asws</sup> own handwriting, and he<sup>saww</sup> taught me<sup>asws</sup> its explanation and its interpretation, and its Abrogating and its Abrogated, and its Decisive and its Allegorical, and its particular and its general. And he<sup>saww</sup> supplicated to Allah<sup>azwj</sup> that He<sup>azwj</sup> should Give me<sup>asws</sup> its understanding and its preservation. So I did not forget a Verse from the Book of Allah<sup>azwj</sup>, nor any knowledge dictated unto me<sup>asws</sup>, and I<sup>asws</sup> wrote it down since he<sup>saww</sup> supplicated to Allah<sup>azwj</sup> for me<sup>asws</sup> with what he<sup>saww</sup> supplicated.",
            "And I did not neglect anything which Allah<sup>azwj</sup> had Taught him<sup>saww</sup>, neither from the Permissible nor Prohibition, nor a Command, nor a Forbiddance, occurrences of the past or that of the future, not a Book Revealed unto anyone before him<sup>saww</sup>, from an obedience or a disobedience, except that he<sup>saww</sup> let me<sup>asws</sup> know of it and I<sup>asws</sup> preserved it. Thus, I<sup>asws</sup> did not forget a single letter. ",
            "Then he<sup>saww</sup> placed his<sup>saww</sup> hand upon my<sup>asws</sup> chest and supplicated to Allah<sup>azwj</sup> for me<sup>asws</sup> that He<sup>azwj</sup> should Fill my<sup>asws</sup> ‘<span class=\"iTxt\">Qalb</span>’ heart with knowledge, and understanding, and wisdom, and light. So I<sup>asws</sup> said: ‘O Prophet<sup>saww</sup> of Allah<sup>azwj</sup>! By my<sup>asws</sup> father<sup>as</sup><sup>ws</sup> and my<sup>asws</sup> mother<sup>as</sup><sup>ws</sup> (be for) you<sup>saww</sup>! Since you<sup>saww</sup> supplicated to Allah<sup>azwj</sup> for me<sup>asws</sup> with what you<sup>saww</sup> supplicated, I<sup>asws</sup> never forgot a thing and nothing was missed out by me<sup>asws</sup> that I<sup>asws</sup> did not write it, but you<sup>saww</sup> are (still) fearing the forgetfulness upon me<sup>asws</sup>?’ So he<sup>saww</sup> said: ‘No. It is not out of fearing the forgetfulness and the ignorance upon you<sup>asws</sup>’’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Ibrahim ibn Hishim has narrated from his father from Hammad ibn ‘Isa from Ibrahim ibn ‘Umar al-Yamani from Aban ibn abu ‘Ayyash from Sulaym ibn Qays al-Hilali who has said the following. “I said to Imam Ali (a.s.), ‘I have heard from Salman, al-Miqdad and abu Dhar certain matters about the interpretations of t he holy Quran and certain Ahadith of the holy Prophet (s.a.) which is different from other have and then have heard from what confirms what I have heard from Salman and others (his friends). I have heard a great deal of Hadith and about the interpretations of the holy Quran. Do you disagree with what have heard from other people and consider such materials as false? Do you think people ascribe lies to the holy Prophet (s.a.) purposely and interpret by their own personal opinions?” The Imam then said, “You have posed a question now listen carefully. “What people have consists of the truth, falsehood, lies, what is abrogating, already abrogated, facts of general nature, of particular natures, clear texts, unclear texts, facts properly memorized and matters that are conjecturally preserved. People had forged certain narration calling them as Hadith of the holy Prophet. The condition was such that once the holy Prophet addressed the people from the pulpit saying, “O people a many lies have spread around and they are considered to be my Hadith. Whoever forges lies and calls them my Hadith has filled up his seat with fire. After the holy Prophet (s.a.) there were more of such lies. There are four kinds of Hadith only and there is no fifth kind. “One narrator of Hadith is a hypocrite who only pretends to be a Muslim. He does consider it a son and offense to lie and calls a narration purposely a Hadith of the holy Prophet while it is not a Hadith of the holy Prophet in reality. If people know that he is hypocrite and a liar they will not believe him. The people say, ‘He lived at the time of the holy Prophet, saw him, has heard Hadith from him and has preserved those Ahadith but they do not know his condition. It is certain that Allah has spoken about the hypocrites the way He has spoken about them and has describe them the way He has describe them. “Their physical appearance attracts you when you see them and when they speak, you carefully listen to them . .” 63:4 They hypocrites then sought closeness to the misguiding leaders and those calling other to hell fire with falsehood, lies and false accusations. The misguiding rulers assigned them for certain offices made them to dominate people. They with their help devoured the world. People follow only the kings and the worldly gains except for those that Allah has protected. This is one of the four kinds. “The other kind is one who has heard Hadith from the holy Prophet by the has preserved it the way it should have been preserved but he is uncertain about it. He has not fabricated anything purposely and has it with him. He speaks about it, practices accordingly and narrates it saying; “ I heard it from the holy Prophet (s.a.). If the Muslims would learn that he is uncertain about it they would accept it from him and if he also would know that there exists uncertainty in it even he also would reject it. “The third kind is one who has heard something form the holy Prophet (s.a.) that contained a command but latter the holy Prophet prohibited it but the man did not have any knowledge of such prohibition. Or that he heard a prohibition form the holy Prophet and then the holy Prophet made it a command but the man did not know of such commandment. In this way preserved the abrogated but not the abrogating but if he knew the abrogating thereof he would have rejected it. If the Muslims knew what they had heard from was abrogated they would also have rejected it. “The last and forth kind is one who has not ascribed a lie to the holy Prophet who hates lies has fear of Allah for respect of the holy Prophet (s.a.). He has not forgotten anything but that he has preserved it the way it should have been preserved. He speaks it just the way has heard with out any addition or omission. He knows which is abrogating and which is abrogated. He thus has practiced according to the abrogating and has rejected the abrogated. There is no doubt that the command so of the holy Prophet (s.a) like the holy Quran is abrogating and abrogated, of general nature and of particular nature, clear text and unclear text. Oftentimes the statements of the holy Prophet may have two aspects: Like a general statement and a statement of a particular nature just like the holy Quran as All, Most Majestic, the Most Glorious, has said, “ . .Take only what the Messenger gives to you and desist from what he forbids you . <a href=\"/#/books/quran:59#h7\">[59:7]</a>” It may become confusing for one who does not know what exactly Allah and His messenger want people to do. All the companions of the holy Prophet were not as such that would clearly understand the answer to their questions. There were those who would ask a question but would not ask for explanations and would rather love the coming of a Bedouin or a stranger and ask the holy Prophet questions so that he would also listen. “I would go in the presence of the holy Prophet once every day and once every night when he would admit me and we would deal with me the way he wanted. The Sahabah, companions of the Prophet knew that the holy Prophet would not deal with others the he dealt with me. Also the Prophet would come to my house most of the time but when I would go to any one of his houses he would admit me and would ask his wife to leave us alone and then we would have been the only ones therein. When he would come to my house he would ask Fatimah or any of my children to leave the house then whatever would ask he would answer me and when I would have exhausted all of my questions he would begin from his side. Thus, nothing of the holy Quran has ever been revealed the holy prophet had made me to read it and dictated me to and I wrote it down with my own hand writing. He taught me the interpretations of that verse and its explanations, its abrogating or that which was abrogated, the clear texts and the unclear statements, the ones of particular general nature. He would pray to Allah to give me understanding and strong memory. I never forgot any of the verses of the book of Allah or any of the knowledge that he had dictated to me which I wrote them down from the time he prayed to Allah for me. He did not leave any thing of the lawful and unlawful, commands or prohibitions that were there or that would come into being in future or any book that were revealed to anyone before him about the matters of obedience or disobedience that he had not completely taught me and I had not memorized them all. I have not forgotten of them even a single letter. The holy Prophet once placed his hand on my chest and prayed to Allah to fill my heart, with knowledge, proper understanding, wisdom and light. I then said, “O messenger of Allah, may Allah take the soul of my mother and father in service for your cause, from the time you prayed for me I have not forgotten a single matter or missed to write down anything. Do you fear that I might forget them in future? “I do not fear for you any forgetfulness of ignorance.” The holy Prophet (s.a.) replied.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/215)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 192,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:21:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ مَا بَالُ أَقْوَامٍ يَرْوُونَ عَنْ فُلَانٍ وَ فُلَانٍ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَا يُتَّهَمُونَ بِالْكَذِبِ فَيَجِي‏ءُ مِنْكُمْ خِلَافُهُ قَالَ إِنَّ الْحَدِيثَ يُنْسَخُ كَمَا يُنْسَخُ الْقُرْآنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from usman Bin Isa, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘What is the matter that the people are reporting from so and so, from Rasool-Allah<sup>saww</sup>, you<sup>asws</sup> are not accusing them of the lying, and there is coming from you<sup>asws</sup>, different to it?’ He<sup>asws</sup> said: ‘The Hadeeth Abrogates just as the Quran Abrogates’."
          ],
          "en.sarwar": [
            " 2. A number of our people has narrated from Ahmad ibn Muhammad from ‘Uthman ibn ’Isa from abu Ayyub al-Khazzaz from Muhammad ibn Muslim who has said the following. “I explained to Imam abu ‘Abdallah (a.s.) saying ‘What is the matter with people who narrate from so and so from the holy Prophet (s.a.) whom they do not accuse of telling lies and thing and from you facts against it comes to light? The Imam (a.s.) said, “Hadith becomes abrogated just as it happens with the holy Quran.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (216/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 193,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:21:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا بَالِي أَسْأَلُكَ عَنِ الْمَسْأَلَةِ فَتُجِيبُنِي فِيهَا بِالْجَوَابِ ثُمَّ يَجِيئُكَ غَيْرِي فَتُجِيبُهُ فِيهَا بِجَوَابٍ آخَرَ فَقَالَ إِنَّا نُجِيبُ النَّاسَ عَلَى الزِّيَادَةِ وَ النُّقْصَانِ ",
          "قَالَ قُلْتُ فَأَخْبِرْنِي عَنْ أَصْحَابِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) صَدَقُوا عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) أَمْ كَذَبُوا قَالَ بَلْ صَدَقُوا قَالَ قُلْتُ فَمَا بَالُهُمُ اخْتَلَفُوا فَقَالَ أَ مَا تَعْلَمُ أَنَّ الرَّجُلَ كَانَ يَأْتِي رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَيَسْأَلُهُ عَنِ الْمَسْأَلَةِ فَيُجِيبُهُ فِيهَا بِالْجَوَابِ ثُمَّ يُجِيبُهُ بَعْدَ ذَلِكَ مَا يَنْسَخُ ذَلِكَ الْجَوَابَ فَنَسَخَتِ الْأَحَادِيثُ بَعْضُهَا بَعْضاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Najran, from Aasim Bin Humeyd, from Mansour Bin Hazim who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is the matter that I ask you<sup>asws</sup> the question, so you<sup>asws</sup> answer me with regards to it with the answer, then there comes to you other than me, so you<sup>asws</sup> answer him with another answer, regarding his question?’ So he<sup>asws</sup> said: ‘We<sup>asws</sup> answer the people sometimes more and sometimes less (as per their merit/status)’. ",
            "He (the narrator) said, ‘I said, ‘So inform me about the companions of Rasool-Allah<sup>saww</sup>. Were they truthful upon Muhammad<sup>saww</sup> or they lied (while reporting)?’ He<sup>asws</sup> said: ‘But they (generally) were truthful’. I said, ‘So what is the matter with them that they are differing?’ So he<sup>asws</sup> said: ‘Do you not know that the man would come to Rasool-Allah<sup>saww</sup>, and he would ask him<sup>saww</sup> the question, so he<sup>saww</sup> would answer him with regards to it with an answer. Then he<sup>saww</sup> would answer him after that what Abrogated that answer. So the Ahadeeth got Abrogated by the other (Ahadeeth)’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim has narrated from his father from ibn abu Najran from ‘Asim ibn Humayd from Mansur ibn Hazim who has said the following. “I said to (Imam) abu ‘Abdallah (a.s.), ‘It is confuses me that when I ask you a question and you give an answer and then other person comes and you give a different answer for the same question.’” The Imam replied, “We answer people in a larger and reduced forms.” I then asked, “Did the Sahabah, companions of the holy Prophet speak the truth or lies when narrating his Hadith?” The Imam replied, “They spoke the truth.” I then said, “Why then they have differences?” Have you not considered the fact that a man would come to the holy Prophet (s.a.) and ask a question and would give him an answer and then he would answer that would abrogate the previous answer. Thus, Ahadith abrogated other Ahadith.”"
          ]
        }
      },
      {
        "index": 194,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:21:4",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ لِي يَا زِيَادُ مَا تَقُولُ لَوْ أَفْتَيْنَا رَجُلًا مِمَّنْ يَتَوَلَّانَا بِشَيْ‏ءٍ مِنَ التَّقِيَّةِ قَالَ قُلْتُ لَهُ أَنْتَ أَعْلَمُ جُعِلْتُ فِدَاكَ قَالَ إِنْ أَخَذَ بِهِ فَهُوَ خَيْرٌ لَهُ وَ أَعْظَمُ أَجْراً ",
          "وَ فِي رِوَايَةٍ أُخْرَى إِنْ أَخَذَ بِهِ أُوجِرَ وَ إِنْ تَرَكَهُ وَ اللَّهِ أَثِمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ibn Mahboub, from Ali Bin Raib, from Abu Ubeyda, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘He<sup>asws</sup> said to me: ‘O Ziyad! What would you be saying if we<sup>asws</sup> were to issue a Fatwa to a man from the ones who are in our<sup>asws</sup> Wilayah, with something from the dissimulation?’ I said to him<sup>asws</sup>, ‘You<sup>asws</sup> are more knowing, may I be sacrificed for you<sup>asws</sup>’. He<sup>asws</sup> said: ‘If he were to take by it, it would be better for him and of greater Recompense’. ",
            "And in another report, ‘(He<sup>asws</sup> said): ‘If he were to take by it, he would be Recompensed, and if he were to neglect it, By Allah<sup>azwj</sup>, he would sin’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from ibn Mahbub from Ali ibn Ri’ab from abu ‘Ubayda who has said the following. “Abu Ja‘far (a.s.) has said, ‘O Ziyad, What would you say if we give a Fatwa to one of our followers under pressure (and concealed the truth)?” I said, “You know better, may Allah take my soul in your service.’” The Imam said, “If would follow such Fatwa it would be better for him and of a greater rewarding.” In another Hadith it says, “If follows it, he will be rewarded and if he disregarded it he has sinned.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/217)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/10)"
        ],
        "index": 195,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:21:5",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ مَسْأَلَةٍ فَأَجَابَنِي ثُمَّ جَاءَهُ رَجُلٌ فَسَأَلَهُ عَنْهَا فَأَجَابَهُ بِخِلَافِ مَا أَجَابَنِي ثُمَّ جَاءَ رَجُلٌ آخَرُ فَأَجَابَهُ بِخِلَافِ مَا أَجَابَنِي وَ أَجَابَ صَاحِبِي ",
          "فَلَمَّا خَرَجَ الرَّجُلَانِ قُلْتُ يَا ابْنَ رَسُولِ اللَّهِ رَجُلَانِ مِنْ أَهْلِ الْعِرَاقِ مِنْ شِيعَتِكُمْ قَدِمَا يَسْأَلَانِ فَأَجَبْتَ كُلَّ وَاحِدٍ مِنْهُمَا بِغَيْرِ مَا أَجَبْتَ بِهِ صَاحِبَهُ فَقَالَ يَا زُرَارَةُ إِنَّ هَذَا خَيْرٌ لَنَا وَ أَبْقَى لَنَا وَ لَكُمْ وَ لَوِ اجْتَمَعْتُمْ عَلَى أَمْرٍ وَاحِدٍ لَصَدَّقَكُمُ النَّاسُ عَلَيْنَا وَ لَكَانَ أَقَلَّ لِبَقَائِنَا وَ بَقَائِكُمْ ",
          "قَالَ ثُمَّ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) شِيعَتُكُمْ لَوْ حَمَلْتُمُوهُمْ عَلَى الْأَسِنَّةِ أَوْ عَلَى النَّارِ لَمَضَوْا وَ هُمْ يَخْرُجُونَ مِنْ عِنْدِكُمْ مُخْتَلِفِينَ قَالَ فَأَجَابَنِي بِمِثْلِ جَوَابِ أَبِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Al Hassan Bin Ali, from Sa’alba Bin Maymoun, from Zurara Bin Ayn, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> a question, so he<sup>asws</sup> answered me. Then a man came over, so he asked him<sup>asws</sup> about it, so he<sup>asws</sup> answered differently to what he<sup>asws</sup> had answered me. Then another man came over, so he<sup>asws</sup> answered him differently to what he<sup>asws</sup> had answered me and to what he<sup>asws</sup> had answered my companion.",
            "So when the two men went out, I said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! Two men from the people of Al-Iraq, from your<sup>asws</sup> Shias came over asking, so you<sup>asws</sup> answered one of the two with other than what you<sup>asws</sup> answered his companion’. So he<sup>asws</sup> said: ‘O Zurara! This is better for us<sup>asws</sup> and more remaining for us<sup>asws</sup> and for you all. And if they were all to gather upon one matter, the people would (start) believe upon us<sup>asws</sup>. But, it would be less for our<sup>asws</sup> preservation and your preservation’. ",
            "He (the narrator) said, ‘Then I said to Abu Abdullah<sup>asws</sup>, ‘Your<sup>asws</sup> Shia, if you<sup>asws</sup> were to carry them upon the arrows or upon the fire, they would be walking (upon these), and they are (now) coming out from your<sup>asws</sup> presence, differing’. He (the narrator) said, ‘So he<sup>asws</sup> answered me with similar to the answer of his<sup>asws</sup> father<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 5. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from al-Hassan ibn Ali from Al-Thaqafi‘laba ibn Maymun from Zurara ibn ‘A‘yan who has said the following. “I asked Imam abu Ja‘far (a.s.) a question and he answered me. Then an other man came and asked the same question but the Imam gave a different answer. Then a third man came and asked the same question but the Imam gave him an answer that was different from both of the previous answers. When the other two men left I asked the Imam (a.s.), “Two of your followers from Iraq asked you the same question, how is it that you gave each one a different answer? The Imam replied, “O Zurarah, it is better for us and it gives all of us more time. If you all would say the same thing, people will know that you speak the truth from us and this will leave all of us with less time. Zurarah has said, “I then asked Imam abu ‘Abdallah, ‘Your follows would walk on spears and fire if you would ask them but they come out of your presence with different answers for the same question and the same answer as his father had given.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/117)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 196,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:21:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ نَصْرٍ الْخَثْعَمِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَنْ عَرَفَ أَنَّا لَا نَقُولُ إِلَّا حَقّاً فَلْيَكْتَفِ بِمَا يَعْلَمُ مِنَّا فَإِنْ سَمِعَ مِنَّا خِلَافَ مَا يَعْلَمُ فَلْيَعْلَمْ أَنَّ ذَلِكَ دِفَاعٌ مِنَّا عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Nazar Al Khash’amy who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The one who recognises that we<sup>asws</sup> are not saying except for the truth, so let him suffice with what he knows from us<sup>asws</sup>. So if he was to hear from us<sup>asws</sup> different to what he knows, so let him know that, that is a defence from us<sup>asws</sup>, about him’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from Nasr al-Kath‘ami who has said the following. “Abu ‘Abdallah (a.s.) has said, ‘Those who know that we say nothing but the truth what they know from us should consider it sufficient. If they would hear from us what is different from what they already know from us they should note that it is our way of defending them.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (218/ 1)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (10/ 1)"
        ],
        "index": 197,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:21:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ عِيسَى وَ الْحَسَنِ بْنِ مَحْبُوبٍ جَمِيعاً عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ اخْتَلَفَ عَلَيْهِ رَجُلَانِ مِنْ أَهْلِ دِينِهِ فِي أَمْرٍ كِلَاهُمَا يَرْوِيهِ أَحَدُهُمَا يَأْمُرُ بِأَخْذِهِ وَ الْآخَرُ يَنْهَاهُ عَنْهُ كَيْفَ يَصْنَعُ فَقَالَ يُرْجِئُهُ حَتَّى يَلْقَى مَنْ يُخْبِرُهُ فَهُوَ فِي سَعَةٍ حَتَّى يَلْقَاهُ ",
          "وَ فِي رِوَايَةٍ أُخْرَى بِأَيِّهِمَا أَخَذْتَ مِنْ بَابِ التَّسْلِيمِ وَسِعَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Usman Bin Isa, and Al Hassan Bin Mahboub, altogether from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man upon whom two men from the people of his Religion differ regarding a matter. Both of them are reporting it. One of them is enjoining it and the other one is forbidding from it. How should he deal with it?’ So he<sup>asws</sup> said: ‘He should adjourn it until he meets the one who would inform him. Thus, he is in a leeway until he does meet him’. ",
            "And in another report, ‘(He<sup>asws</sup> said): ‘Whichever of the two you take by from the door of submission, up to you’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Ibrahim has narrated from his father from ‘Uthman ibn ‘Isa and al-Hassan ibn Mahbub both from Sama’ from ‘Abdallah who has said the following. “I asked (Imam) abu ‘Abdallah (a.s.) about a man who was opposed by two people of his own faith in an issue that they both narrated. One of them said it to be obligatory and the other said it was prohibited. How it can be solved?” The Imam replied, “He must wait until he finds one who would inform him and until then he is not under any pressure.” In another Hadith it says, “Whichever answer he follows in obedience for his ease.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (220/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 198,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:21:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَ رَأَيْتَكَ لَوْ حَدَّثْتُكَ بِحَدِيثٍ الْعَامَ ثُمَّ جِئْتَنِي مِنْ قَابِلٍ فَحَدَّثْتُكَ بِخِلَافِهِ بِأَيِّهِمَا كُنْتَ تَأْخُذُ قَالَ قُلْتُ كُنْتُ آخُذُ بِالْأَخِيرِ فَقَالَ لِي رَحِمَكَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Usman Bin Isa, from Al Husayn Bin Al Mukhtar, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘What is your view if I<sup>asws</sup> was to narrate to you with the general Hadeeth, then you come to me in the future, so I<sup>asws</sup> narrate to you with one different to it. Which of the two would you be taking by?’ He (the narrator) said, ‘I said. ‘We would take the latest one’. So he<sup>asws</sup> said to me: ‘May Allah<sup>azwj</sup> have Mercy on you’."
          ],
          "en.sarwar": [
            " 8. Ali ibn Ibrahim has narrated from his father from ‘Uthman ibn ‘Isa from al-Husayn ibn al-Mukhtar from certain persons of our people from abu ‘Abdallah (a.s.) who has said the following. “If you would come to me for an answer to a question and I give you an answer of a general nature and then you come again and I give you an opposite answer which one would you follow?” I replied, “I would follow the later.” The Imam (a.s.) said, “May Allah grant you blessings.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/221)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 199,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:21:9",
        "text": [
          "وَ عَنْهُ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذَا جَاءَ حَدِيثٌ عَنْ أَوَّلِكُمْ وَ حَدِيثٌ عَنْ آخِرِكُمْ بِأَيِّهِمَا نَأْخُذُ فَقَالَ خُذُوا بِهِ حَتَّى يَبْلُغَكُمْ عَنِ الْحَيِّ فَإِنْ بَلَغَكُمْ عَنِ الْحَيِّ فَخُذُوا بِقَوْلِهِ ",
          "قَالَ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّا وَ اللَّهِ لَا نُدْخِلُكُمْ إِلَّا فِيمَا يَسَعُكُمْ ",
          "وَ فِي حَدِيثٍ آخَرَ خُذُوا بِالْأَحْدَثِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from his father, from Ismail Bin Marrar, from Yunus, from Dawood Bin Farqad, from Al Moalla Bin Khunays who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘When there comes a Hadeeth from your<sup>asws</sup> former ones<sup>asws</sup>, and a Hadeeth from your<sup>asws</sup> later ones<sup>asws</sup>, by which of these two should we take?’ So he<sup>asws</sup> said, ‘Be taking with it until there reached you all from the living one<sup>asws</sup>. So when there does reach you from the living one<sup>asws</sup>, so adhere to his<sup>asws</sup> words’. ",
            "He (the narrator) said, ‘Then Abu Abdullah<sup>asws</sup> said: ‘We<sup>asws</sup>, by Allah<sup>azwj</sup>, do not enter you all into anything except in what there is ease for you’. ",
            "And in another report, ‘(He<sup>asws</sup> said): ‘Take by the Hadeeth’."
          ],
          "en.sarwar": [
            " 9. It is narrated from him from his father from Isma’il ibn Marrar from Yunus from Dawud ibn Farqad from Mu‘alla ibn Khunays who has said the following. “I asked Imam abu ‘Abdallah (a.s.), ‘If we receive a Hadith from first of you and from the members of your later generation which one should we follow?” The Imam replied, “Follow it until you receive it from the living Imam. When it comes from a living Imam follow his words.” The Imam than said, “We by Allah, like you to follow what is easy for you.” In another Hadith it is says, “Follow whichever the newest.”’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق تلقاه الصحاب بالقبول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (221/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 200,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:21:10",
        "refs": {
          "Quran": [
            "/books/quran:4:60"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ عُمَرَ بْنِ حَنْظَلَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلَيْنِ مِنْ أَصْحَابِنَا بَيْنَهُمَا مُنَازَعَةٌ فِي دَيْنٍ أَوْ مِيرَاثٍ فَتَحَاكَمَا إِلَى السُّلْطَانِ وَ إِلَى الْقُضَاةِ أَ يَحِلُّ ذَلِكَ",
          "قَالَ مَنْ تَحَاكَمَ إِلَيْهِمْ فِي حَقٍّ أَوْ بَاطِلٍ فَإِنَّمَا تَحَاكَمَ إِلَى الطَّاغُوتِ وَ مَا يَحْكُمُ لَهُ فَإِنَّمَا يَأْخُذُ سُحْتاً وَ إِنْ كَانَ حَقّاً ثَابِتاً لِأَنَّهُ أَخَذَهُ بِحُكْمِ الطَّاغُوتِ وَ قَدْ أَمَرَ اللَّهُ أَنْ يُكْفَرَ بِهِ قَالَ اللَّهُ تَعَالَى يُرِيدُونَ أَنْ يَتَحاكَمُوا إِلَى الطَّاغُوتِ وَ قَدْ أُمِرُوا أَنْ يَكْفُرُوا بِهِ",
          "قُلْتُ فَكَيْفَ يَصْنَعَانِ قَالَ يَنْظُرَانِ إِلَى مَنْ كَانَ مِنْكُمْ مِمَّنْ قَدْ رَوَى حَدِيثَنَا وَ نَظَرَ فِي حَلَالِنَا وَ حَرَامِنَا وَ عَرَفَ أَحْكَامَنَا فَلْيَرْضَوْا بِهِ حَكَماً فَإِنِّي قَدْ جَعَلْتُهُ عَلَيْكُمْ حَاكِماً فَإِذَا حَكَمَ بِحُكْمِنَا فَلَمْ يَقْبَلْهُ مِنْهُ فَإِنَّمَا اسْتَخَفَّ بِحُكْمِ اللَّهِ وَ عَلَيْنَا رَدَّ وَ الرَّادُّ عَلَيْنَا الرَّادُّ عَلَى اللَّهِ وَ هُوَ عَلَى حَدِّ الشِّرْكِ بِاللَّهِ",
          "قُلْتُ فَإِنْ كَانَ كُلُّ رَجُلٍ اخْتَارَ رَجُلًا مِنْ أَصْحَابِنَا فَرَضِيَا أَنْ يَكُونَا النَّاظِرَيْنِ فِي حَقِّهِمَا وَ اخْتَلَفَا فِيمَا حَكَمَا وَ كِلَاهُمَا اخْتَلَفَا فِي حَدِيثِكُمْ قَالَ الْحُكْمُ مَا حَكَمَ بِهِ أَعْدَلُهُمَا وَ أَفْقَهُهُمَا وَ أَصْدَقُهُمَا فِي الْحَدِيثِ وَ أَوْرَعُهُمَا وَ لَا يَلْتَفِتْ إِلَى مَا يَحْكُمُ بِهِ الْآخَرُ",
          "قَالَ قُلْتُ فَإِنَّهُمَا عَدْلَانِ مَرْضِيَّانِ عِنْدَ أَصْحَابِنَا لَا يُفَضَّلُ وَاحِدٌ مِنْهُمَا عَلَى الْآخَرِ قَالَ فَقَالَ يُنْظَرُ إِلَى مَا كَانَ مِنْ رِوَايَتِهِمْ عَنَّا فِي ذَلِكَ الَّذِي حَكَمَا بِهِ الْمُجْمَعُ عَلَيْهِ مِنْ أَصْحَابِكَ فَيُؤْخَذُ بِهِ مِنْ حُكْمِنَا وَ يُتْرَكُ الشَّاذُّ الَّذِي لَيْسَ بِمَشْهُورٍ عِنْدَ أَصْحَابِكَ فَإِنَّ الْمُجْمَعَ عَلَيْهِ لَا رَيْبَ فِيهِ",
          "وَ إِنَّمَا الْأُمُورُ ثَلَاثَةٌ أَمْرٌ بَيِّنٌ رُشْدُهُ فَيُتَّبَعُ وَ أَمْرٌ بَيِّنٌ غَيُّهُ فَيُجْتَنَبُ وَ أَمْرٌ مُشْكِلٌ يُرَدُّ عِلْمُهُ إِلَى اللَّهِ وَ إِلَى رَسُولِهِ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَلَالٌ بَيِّنٌ وَ حَرَامٌ بَيِّنٌ وَ شُبُهَاتٌ بَيْنَ ذَلِكَ فَمَنْ تَرَكَ الشُّبُهَاتِ نَجَا مِنَ الْمُحَرَّمَاتِ وَ مَنْ أَخَذَ بِالشُّبُهَاتِ ارْتَكَبَ الْمُحَرَّمَاتِ وَ هَلَكَ مِنْ حَيْثُ لَا يَعْلَمُ",
          "قُلْتُ فَإِنْ كَانَ الْخَبَرَانِ عَنْكُمَا مَشْهُورَيْنِ قَدْ رَوَاهُمَا الثِّقَاتُ عَنْكُمْ قَالَ يُنْظَرُ فَمَا وَافَقَ حُكْمُهُ حُكْمَ الْكِتَابِ وَ السُّنَّةِ وَ خَالَفَ الْعَامَّةَ فَيُؤْخَذُ بِهِ وَ يُتْرَكُ مَا خَالَفَ حُكْمُهُ حُكْمَ الْكِتَابِ وَ السُّنَّةِ وَ وَافَقَ الْعَامَّةَ",
          "قُلْتُ جُعِلْتُ فِدَاكَ أَ رَأَيْتَ إِنْ كَانَ الْفَقِيهَانِ عَرَفَا حُكْمَهُ مِنَ الْكِتَابِ وَ السُّنَّةِ وَ وَجَدْنَا أَحَدَ الْخَبَرَيْنِ مُوَافِقاً لِلْعَامَّةِ وَ الْآخَرَ مُخَالِفاً لَهُمْ بِأَيِّ الْخَبَرَيْنِ يُؤْخَذُ قَالَ مَا خَالَفَ الْعَامَّةَ فَفِيهِ الرَّشَادُ",
          "فَقُلْتُ جُعِلْتُ فِدَاكَ فَإِنْ وَافَقَهُمَا الْخَبَرَانِ جَمِيعاً قَالَ يُنْظَرُ إِلَى مَا هُمْ إِلَيْهِ أَمْيَلُ حُكَّامُهُمْ وَ قُضَاتُهُمْ فَيُتْرَكُ وَ يُؤْخَذُ بِالْآخَرِ ",
          "قُلْتُ فَإِنْ وَافَقَ حُكَّامُهُمُ الْخَبَرَيْنِ جَمِيعاً قَالَ إِذَا كَانَ ذَلِكَ فَأَرْجِهْ حَتَّى تَلْقَى إِمَامَكَ فَإِنَّ الْوُقُوفَ عِنْدَ الشُّبُهَاتِ خَيْرٌ مِنَ الِاقْتِحَامِ فِي الْهَلَكَاتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Isa, from Safwan Bin Yahya, from Dawood Bin Al Husayn, from Umar Bin Hanzala who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about two men from our companions between who there was a dispute regarding a debt or an inheritance. So they both adjudicated it to the ruling authority and to the judges. Is that permissible?’ ",
            "He<sup>asws</sup> said: ‘The one who adjudicates to them regarding a right or a wrong, so rather he has adjudicated to the tyrant, and whatever they adjudicate to him, so rather he has taken an ill-gotten gain, and even though it may be a proven right, because he has taken it by a judgment of the tyrant, and Allah<sup>azwj</sup> has Commanded that he disbelieves in it. <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h60\">[4:60]</a> They desire to summon one another to the judgement of the tyrant, though they were Commanded to deny him</span>.",
            "I said, ‘So how should they both be dealing with it?’ He<sup>asws</sup> said: ‘They should both take it for consideration to the one who was from you, from the one who have reported our<sup>asws</sup> Ahadeeth and looks into our<sup>asws</sup> Pemissible and our<sup>asws</sup> Prohibition, and he recognises our<sup>asws</sup> regulations. So let them both be pleased with him as a judge, for I<sup>asws</sup> have made him to be a judge upon you (to settle their dispute). So when he does judge by our<sup>asws</sup> judgment and it is not accepted from him, so rather you would have taken lightly with the Judgment of Allah<sup>azwj</sup>, and upon us<sup>asws</sup> is the rejection. And the rejection upon us<sup>asws</sup>, is the rejection upon Allah<sup>azwj</sup>, and he would be upon the boundary of the Shirk (association) with Allah<sup>azwj</sup>’. ",
            "I said, ‘Supposing it was so that each man chooses a man each from our companions, so they are both pleased for them both to look into their rights, and they both differ in their respective judgments, and both of them differ regarding your<sup>asws</sup> Hadeeth?’ He<sup>asws</sup> said: ‘The judgment would what is judged by the one who is more just of the two, and more understanding of the two, or the more truthful of the two regarding the Hadeeth, or the more pious of the two, and he would not turn to what the other one judged with’. ",
            "He (the narrator) said, ‘I said, ‘Supposing both of them are just, agreeable in the presence of our companions, not one of the two having any merit upon the other?’ So he<sup>asws</sup> said: ‘You would look at what was from their reports from us<sup>asws</sup> regarding that (issue) which they are judging with, and consensus upon it from your companions. So they should be taking with our<sup>asws</sup> judgment and neglect the abnormal which is not well-known among your companions. So the consensus would be upon which there is no doubt in it. ",
            "And rather, the matters are three (types) – a matter which is clearly righteous guidance, so you would follow it, and a matter which is clearly wrong, so you would keep aside from it, and a matter which is difficult, you would return its knowledge to Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>. Rasool-Allah<sup>saww</sup> said: ‘The Permissible are clear, and the Prohibitions are clear, and the doubtful ones are between that. So the one who neglects the doubtful would be saved from the Prohibitions, and the one who takes the doubtful would indulge in the Prohibitions and be destroyed from where he does not even know’. ",
            "I said, ‘Supposing there are two Ahadeeth from you, both well known, both having been reported by the trustworthy ones from you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘It would be looked into. So whatever judgment was in accordance with the Judgment of the Book and the Sunnah, and differs from the general Muslims, so it would be taken with, and whatever judgment was different from the Judgment of the Book and the Sunnah, and in accordance with the general Muslims, would be neglected’. ",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! What is your<sup>asws</sup> view if they were both understanding ones, both recognising its judgment from the Book and the Sunnah, and we find one of the two Ahadeeth in accordance with the general Muslims and the other one opposed to them. With which of the two Ahadeeth would be it taken?’ He<sup>asws</sup> said: ‘Whatever opposes the general Muslims, for there would be righteous guidance therein’. ",
            "So I said, ‘May I be sacrificed for you<sup>asws</sup>! Supposing if both of the two Ahadeeth are in accordance together?’ He<sup>asws</sup> said: ‘It would be looked at what their rulers and their judges are inclined towards, so you would leave it, and be taking with the other one’. ",
            "I said, ‘Supposing their rulers and their judges are all concordant?’ He<sup>asws</sup> said: ‘When it was that, so wait until you meet your Imam<sup>asws</sup>, for the pausing during the doubtful matters is better than storming into the destruction’."
          ],
          "en.sarwar": [
            " 10. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ‘Isa from Safwan ibn Yahya from Dawud ibn al-Husayn from ‘Umar ibn Hanzala who has said the following. “I asked Imam abu ‘Abdallah (a.s.) about the two people with a dispute between them on the issue of debts or inheritance and they go to the king or the judges for a decision is it permissible to seek such decisions?” The Imam replied, “Whoever would go to them for a judgement in a right or wrongful matter it is like seeking the judgment of the devil. Anything received through such judgment would like consuming filth even if it would one’s established right. It is because of receiving through the judgment of the devil and Allah has commanded to reject the devil, “yet choose to take their affairs to Satan for judgment even though they are commanded to deny him. Satan wants to lead them far away from the right path. <a href=\"/#/books/quran:4#h60\">[4:60]</a>” I said, “What should then they do?” The Imam replied, “They must look for one among you who have narrated our Hadith and have studied what is lawful and unlawful in our teachings and have learned our laws they must agree to settle their dispute according to his judgment because I have made him over you a ruler. When he may judge according to our commands and then it is not accepted from him the dissenting this judgment has ignored the commands of Allah and it is rejection of us. Rejecting us is rejecting Allah and that is up to the level of paganism and considering things equal to Allah.” I said, “What if each one of such disputing parties would chose a man from among our people and agree to accept their judgment but these two man would come up with different judgments and they would have differences in your Hadith?” The Imam replied, “The judgment will be the judgment of the one who has a more just, having more better understanding of the law, Fiqh, the more truthful in Hadith and the more pious of the two. The judgment of the other one will be disregarded.” I said, “What if both (of such judges) would be just and accepted among our people and none of them would have been any preference over the other?” The Imam replied, “One must consider and study the hadith that each one of them would narrate from us as to which has received the acceptance of all of your people. Such Hadith must be followed and the one, which rarely accepted and is not popular in your people, must be disregarded because the one popularly accepted is free of doubts. The nature of cases are of three kinds: (a) A case that is a well-known and true to follow. (b) A case that is well known to be false to stay away from. (c) And a confusing case the knowledge of which must be left to Allah and His Prophet for an answer. The holy Prophet has said, ‘There is the clearly lawful and the clearly unlawful and the confusing cases. One who stays away from the confusing ones he has protected himself against the unlawful ones. Those who follow the confusing matters they indulge in unlawful matters and will be destroyed unexpectedly.” I said, “What if both Hadith from you would be popular and narrated by the trustworthy people from you?” The Imam replied, “One must study to find out which one agrees with the laws of the Quran and the Sunnah and it does not agree with the laws of the those who oppose us. Such Hadith must be accepted and the one that disagree with the laws of the Quran and the Sunnah and coincides the masses must be disregarded.” I said, “May Allah take my soul in the service of your cause, What if both Faqih, scholars of the law would have deduced and learned their judgment from the book and the Sunnah and found that one of the Hadith agrees with the masses and the other disagrees with the masses which one must be followed?” The Imam replied, “The one which disagrees with the masses must be followed because in it there is guidance.” I said, “May Allah take my soul in the service of your cause, what if both Hadith would agree with the masses?” The Imam replied, “One must study to find out of the two the one that is more agreeable to their rulers and judges must be disregarded and the other must be followed.” I said, “What if both Hadith would agree with their rulers?” The Imam replied, “If such would be the case it must be suspended until you meet your Imam. Restraint in confusing cases is better than indulging in destruction.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:2:21",
  "kind": "verse_list"
}