{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:1:2:5",
        "titles": {
          "ar": "بَابُ صِفَةِ الْعُلَمَاءِ",
          "en": "Chapter 5 – Description of the scholars"
        }
      }
    ],
    "index": 6,
    "local_index": 5,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:1:2:6",
        "titles": {
          "ar": "بَابُ حَقِّ الْعَالِمِ",
          "en": "Chapter 6 – Rights of the scholar"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:1:2:4",
        "titles": {
          "ar": "بَابُ ثَوَابِ الْعَالِمِ وَ الْمُتَعَلِّمِ",
          "en": "Chapter 4 – The Rewards of the scholar and the student"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:1:2",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْعِلْمِ",
          "en": "THE BOOK OF MERITS OF THE KNOWLEDGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:2:5",
    "titles": {
      "ar": "بَابُ صِفَةِ الْعُلَمَاءِ",
      "en": "Chapter 5 – Description of the scholars"
    },
    "verse_count": 7,
    "verse_start_index": 64,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (118/ 1)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/4)"
        ],
        "index": 65,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:5:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> الْعَطَّارُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ اطْلُبُوا الْعِلْمَ وَ تَزَيَّنُوا مَعَهُ بِالْحِلْمِ وَ الْوَقَارِ وَ تَوَاضَعُوا لِمَنْ تُعَلِّمُونَهُ الْعِلْمَ وَ تَوَاضَعُوا لِمَنْ طَلَبْتُمْ مِنْهُ الْعِلْمَ وَ لَا تَكُونُوا عُلَمَاءَ جَبَّارِينَ فَيَذْهَبَ بَاطِلُكُمْ بِحَقِّكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya Al Attar, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Muawiya Bin Wahab who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Seek the knowledge and adorn (yourselves) along with it, with the forbearance, and the dignity, and the humbleness towards the ones whom you teach it to, and humbleness towards the one whom you sought the knowledge from, and do not become tyrannous scholars, as your falsehoods would remove your truth’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya al-‘Attar from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Mu‘awiya ibn Wahab who has said the following. “Imam abu ‘Abdallah (a.s.) has said. “Seek knowledge and beautify it with forbearance and dignity. Be humble to your students and to those from whom you learn. Do not be a tyrant scholar lest your falsehood would destroy the truth in you.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (118/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 66,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:5:2",
        "refs": {
          "Quran": [
            "/books/quran:35:28"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ النَّصْرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّما يَخْشَى اللَّهَ مِنْ عِبادِهِ الْعُلَماءُ قَالَ يَعْنِي بِالْعُلَمَاءِ مَنْ صَدَّقَ فِعْلُهُ قَوْلَهُ وَ مَنْ لَمْ يُصَدِّقْ فِعْلُهُ قَوْلَهُ فَلَيْسَ بِعَالِمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Hammad Bin Usman, from Al Haris Bin Al Mugheira Al Nasry, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:35#h28\">[35:28]</a> but rather the ones from His servants who fear Allah, are the scholars</span>. He<sup>asws</sup> said: ‘It Means by the ‘scholars’, the one whose deeds ratify his words, and the one whose deed does not ratify his words, so he is not with the knowledge’."
          ],
          "en.sarwar": [
            " 2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Hammad ibn ‘Uthman from al-Harith ibn Mughirah al-Nasri from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “Only God’s knowledgeable servants fear Him . ..”, <a href=\"/#/books/quran:35#h28\">[35:28]</a> that scholars are those whose deeds would testify to the truthfulness of their words, otherwise, they are not scholars.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (119/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 67,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:5:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ أَبِي سَعِيدٍ الْقَمَّاطِ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَ لَا أُخْبِرُكُمْ بِالْفَقِيهِ حَقِّ الْفَقِيهِ مَنْ لَمْ يُقَنِّطِ النَّاسَ مِنْ رَحْمَةِ اللَّهِ وَ لَمْ يُؤْمِنْهُمْ مِنْ عَذَابِ اللَّهِ وَ لَمْ يُرَخِّصْ لَهُمْ فِي مَعَاصِي اللَّهِ وَ لَمْ يَتْرُكِ الْقُرْآنَ رَغْبَةً عَنْهُ إِلَى غَيْرِهِ ",
          "أَلَا لَا خَيْرَ فِي عِلْمٍ لَيْسَ فِيهِ تَفَهُّمٌ أَلَا لَا خَيْرَ فِي قِرَاءَةٍ لَيْسَ فِيهَا تَدَبُّرٌ أَلَا لَا خَيْرَ فِي عِبَادَةٍ لَيْسَ فِيهَا تَفَكُّرٌ ",
          "وَ فِي رِوَايَةٍ أُخْرَى أَلَا لَا خَيْرَ فِي عِلْمٍ لَيْسَ فِيهِ تَفَهُّمٌ أَلَا لَا خَيْرَ فِي قِرَاءَةٍ لَيْسَ فِيهَا تَدَبُّرٌ أَلَا لَا خَيْرَ فِي عِبَادَةٍ لَا فِقْهَ فِيهَا أَلَا لَا خَيْرَ فِي نُسُكٍ لَا وَرَعَ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from Ismail Bin Mihran, from Abu Saeed Al Qammat, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Shall I<sup>asws</sup> inform you all with the understanding one who is truly an understanding one? (It is) the one who does not despair the people from the Mercy of Allah<sup>azwj</sup>, and does not liberate them from the Punishment of Allah<sup>azwj</sup>, and does not permit for them to be in the disobedience of Allah<sup>azwj</sup>, and does not neglect the Quran, turning away from it to something else.",
            "Indeed! There is no goodness in a knowledge wherein there is no understanding. Indeed! There is no goodness in the recitation (of the Quran) wherein there is no pondering. Indeed! There is no goodness in a worship there being no thinking in it’. ",
            "And in another report, (He<sup style=\"font-weight: normal\">asws</sup> said): ‘Indeed! There is no goodness in a knowledge wherein there is no understanding. Indeed! There is no goodness in a recitation (of the Quran) wherein there is no pondering. Indeed! There is no goodness in a worship there being no thinking in it. There is no goodness in a ritual, there being no piety in it’."
          ],
          "en.sarwar": [
            " 3. A number of our people has narrated from Ahmad ibn Muhammad al-Barqi from ’Isma’il ibn Mihran from abu Sa‘id al-Qammat from al-Halabi from abu ‘Abdallah (a.s.) who has said the following. “Imam Ali (a.s.) said, ‘Do you want me to describe to you the true Faqih, person who truly has a good understanding of religion? A true Faqih is one who does not cause people to despair from the mercy of Allah and does not make them to be unconcerned about the punishment of Allah, who does not allow them to consider disobedience to Allah as permissible and who doe not abandon the holy Quran because of being attracted towards other matters. You must know that there is no goodness in knowledge without good understand (Fiqh). You must know that there is nothing good in a recitation without thinking about it. You must know that there is nothing good in worship without thoughtfulness. In another Hadith it says, “ You must know that there is nothing good in a knowledge without good understanding. You must know that there is nothing good in a recitation without thinking about it. You must know that there is nothing good in worship without having a good understanding of religion. You must know that there is nothing good in performing the acts of Hajj etc. without piety.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (120/ 1)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (4/ 1)"
        ],
        "index": 68,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:5:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ النَّيْسَابُورِيِّ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ إِنَّ مِنْ عَلَامَاتِ الْفِقْهِ الْحِلْمَ وَ الصَّمْتnَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Muhammad Bin Ismail, from Al Fazl Bin Shazan Al Neyshapouri, altogether from Safwan Bin Yahya, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘From the sings of the understanding (of the Religion), is the forbearance and the silence’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and Muhammad ibn ‘Ism’il from al-Fadl ibn Shadhan al-Naysaburi, all from Safwan ibn Yahya from abu al-Hassan al-Rida (a.s.) who has said the following. “Of the signs of Fiqh, good understanding of religion is forbearance and quietness.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (120/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 69,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:5:5",
        "text": [
          "أَحْمَدُ بْنُ عَبْدِ اللَّهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَا يَكُونُ السَّفَهُ وَ الْغِرَّةُ فِي قَلْبِ الْعَالِمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Abdullah, from Ahmad Bin Muhammad Al Barqy, from one of his companions, raising it, said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘There cannot happen to be the foolishness and the arrogance in the heart of a scholar’."
          ],
          "en.sarwar": [
            " 5. Ahmad ibn ‘Abdallah from Ahmad ibn Muhammad al-Barqi from certain persons of his people in a marfu‘ manner (rafa’ahu) from Amir al-Mu’minin Ali (a.s.) who has said the following. “Foolishness and arrogance are not found in the hearts of the scholars.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (120/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 70,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:5:6",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ رَفَعَهُ قَالَ قَالَ عِيسَى ابْنُ مَرْيَمَ ( عليه السلام ) يَا مَعْشَرَ الْحَوَارِيِّينَ لِي إِلَيْكُمْ حَاجَةٌ اقْضُوهَا لِي قَالُوا قُضِيَتْ حَاجَتُكَ يَا رُوحَ اللَّهِ فَقَامَ فَغَسَلَ أَقْدَامَهُمْ فَقَالُوا كُنَّا نَحْنُ أَحَقَّ بِهَذَا يَا رُوحَ اللَّهِ ",
          "فَقَالَ إِنَّ أَحَقَّ النَّاسِ بِالْخِدْمَةِ الْعَالِمُ إِنَّمَا تَوَاضَعْتُ هَكَذَا لِكَيْمَا تَتَوَاضَعُوا بَعْدِي فِي النَّاسِ كَتَوَاضُعِي لَكُمْ ",
          "ثُمَّ قَالَ عِيسَى ( عليه السلام ) بِالتَّوَاضُعِ تُعْمَرُ الْحِكْمَةُ لَا بِالتَّكَبُّرِ وَ كَذَلِكَ فِي السَّهْلِ يَنْبُتُ الزَّرْعُ لَا فِي الْجَبَلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Muhammad Bin Khalid, from Muhammad Bin Sinan, raising it, ",
            "(He<sup>asws</sup>) said: ‘Isa<sup>as</sup> Bin Maryam<sup>as</sup> said: ‘O group of disciples! There is a need for me<sup>as</sup> to you all, will you fulfil it for me<sup>as</sup>?’ They said, ‘We will fulfil your<sup>as</sup> need, O Spirit of Allah<sup>azwj</sup>!’ So he<sup>as</sup> arose and washed their feet. So they said, ‘We were always more rightful with this (washing your<sup>as</sup> feet), O Spirit of Allah<sup>azwj</sup>!’. ",
            "So he<sup>as</sup> said: ‘The people are more rightful with the service of the scholar. But rather, I<sup>as</sup> am revering (you all) like this, so that you would be revering, after me<sup>as</sup>, among the people, like my<sup>as</sup> reverence to you all’. ",
            "Then Isa<sup style=\"font-weight: normal\">as</sup> said: ‘(It is) with the reverence that you would be building the wisdom, not with the arrogance, and similar to that (it is) the crops grow in the plains, (and) not in the rocks’’."
          ],
          "en.sarwar": [
            " Through the same chain of narrators it is narrated from Muhammad ibn Khalid from Muhammad ibn Sinan in a marfu‘ manner (rafa’ahu ) from Jesus son of Mary who has said the following to his disciples. “O disciples, I need your help so help me.” They replied, “Your request is granted, O Spirit of God.” Jesus then got up and washed their feet. To this the disciples said, “We were supposed to serve you O Spirit of God.” Jesus then said, “Of the people who must serve others are the scholars. I acted in this humble way so that you will act among people in the humble way I acted before you.” Jesus then said, “With humbleness wisdom is established but not with arrogance. Just as plants grow in plain and soft grounds but not on the hard grounds and rocks.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (122/ 1)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 71,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:2:5:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَمَّنْ ذَكَرَهُ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ يَا طَالِبَ الْعِلْمِ إِنَّ لِلْعَالِمِ ثَلَاثَ عَلَامَاتٍ الْعِلْمَ وَ الْحِلْمَ وَ الصَّمْتَ وَ لِلْمُتَكَلِّفِ ثَلَاثَ عَلَامَاتٍ يُنَازِعُ مَنْ فَوْقَهُ بِالْمَعْصِيَةِ وَ يَظْلِمُ مَنْ دُونَهُ بِالْغَلَبَةِ وَ يُظَاهِرُ الظَّلَمَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from the one who mentioned it, from Muawiya Bin Wahab, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> was saying: ‘O seeker of knowledge! For the (real) scholar there are three signs – the knowledge and the forbearance (self-control) and the silence; and for the pretentious (scholar) there are three signs – He disputes with the one above him by the disobedience, and he oppresses the one below him with the domination, and he backs the unjust’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Ibrahim has narrated from his father from Ali ibn Ma‘bad from the person whom he mentioned from Mu‘awiya ibn Wahab from abu ‘Abdallah (a.s.) who has said the following. “Imam Ali (a.s.), would often say, ‘O seekers of knowledge, (note that) a scholar has three signs: Knowledge, forbearance and quietness. An orator has three signs: He quarrels those higher then him through disobedience. He does injustice to those lower than him in position through domination and he becomes a supporter of the unjust.’”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:2:5",
  "kind": "verse_list"
}