{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:4:2", "titles": {"ar": "كِتَابُ الصِّيَامِ", "en": "THE BOOK OF FASTS (1)"}}, {"indexed_titles": {"en": "Chapter 11"}, "path": "/books/al-kafi:4:2:11", "titles": {"ar": "بَابُ أَدَبِ الصَّائِمِ", "en": "Chapter 11 – Ettiquettes of the Fasting one"}}], "index": 871, "local_index": 11, "part_type": "Chapter", "path": "/books/al-kafi:4:2:11", "titles": {"ar": "بَابُ أَدَبِ الصَّائِمِ", "en": "Chapter 11 – Ettiquettes of the Fasting one"}, "verse_count": 11, "verse_start_index": 6284, "verses": [{"index": 6285, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا صُمْتَ فَلْيَصُمْ سَمْعُكَ وَ بَصَرُكَ وَ شَعْرُكَ وَ جِلْدُكَ وَ عَدَّدَ أَشْيَاءَ غَيْرَ هَذَا وَ قَالَ لَا يَكُونُ يَوْمُ صَوْمِكَ كَيَوْمِ فِطْرِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umey, from Hammad Bin usman, from Muhammad Bin Muslim who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘Whenever you Fast, so let your hearing, and your vision, and your hair, and your skin, and a number of this other than these, Fast (as well)’. And he<sup>asws</sup> said: ‘The day of your Fast should not happen to be like the day of your breaking (not Fasting)’."}]}, {"index": 6286, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ النَّضْرِ الْخَزَّازِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِجَابِرِ بْنِ عَبْدِ اللَّهِ يَا جَابِرُ هَذَا شَهْرُ رَمَضَانَ مَنْ صَامَ نَهَارَهُ وَ قَامَ وِرْداً مِنْ لَيْلِهِ وَ عَفَّ بَطْنُهُ وَ فَرْجُهُ وَ كَفَّ لِسَانَهُ خَرَجَ مِنْ ذُنُوبِهِ كَخُرُوجِهِ مِنَ الشَّهْرِ فَقَالَ جَابِرٌ يَا رَسُولَ اللَّهِ مَا أَحْسَنَ هَذَا الْحَدِيثَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا جَابِرُ وَ مَا أَشَدَّ هَذِهِ الشُّرُوطَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ahmad Bin Al Nazar, from Amro Bin Shimr, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said to Jabir Bin Abdullah; ‘O Jabir! This is the Month of Ramazan. The one who Fasts during its days, and stands in response (for Prayers) during its nights, and excuses his belly and his private parts, and restrains his tongue, would come out from his sins just as he comes out from the month’. So Jabir said, ‘O Rasool-Allah<sup>saww</sup>! How beautiful is this Hadeeth!’ So Rasool-Allah<sup>saww</sup> said: ‘O Jabir! And how difficult are these stipulations (conditions)’."}]}, {"index": 6287, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ جَرَّاحٍ الْمَدَائِنِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الصِّيَامَ لَيْسَ مِنَ الطَّعَامِ وَ الشَّرَابِ وَحْدَهُ ثُمَّ قَالَ قَالَتْ مَرْيَمُ إِنِّي نَذَرْتُ لِلرَّحْمنِ صَوْماً أَيْ صَوْماً صَمْتاً وَ فِي نُسْخَةٍ أُخْرَى أَيْ صَمْتاً فَإِذَا صُمْتُمْ فَاحْفَظُوا أَلْسِنَتَكُمْ وَ غُضُّوا أَبْصَارَكُمْ وَ لَا تَنَازَعُوا وَ لَا تَحَاسَدُوا\nقَالَ وَ سَمِعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) امْرَأَةً تَسُبُّ جَارِيَةً لَهَا وَ هِيَ صَائِمَةٌ فَدَعَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِطَعَامٍ فَقَالَ لَهَا كُلِي فَقَالَتْ إِنِّي صَائِمَةٌ فَقَالَ كَيْفَ تَكُونِينَ صَائِمَةً وَ قَدْ سَبَبْتِ جَارِيَتَكِ إِنَّ الصَّوْمَ لَيْسَ مِنَ الطَّعَامِ وَ الشَّرَابِ\nقَالَ وَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا صُمْتَ فَلْيَصُمْ سَمْعُكَ وَ بَصَرُكَ مِنَ الْحَرَامِ وَ الْقَبِيحِ وَ دَعِ الْمِرَاءَ وَ أَذَى الْخَادِمِ وَ لْيَكُنْ عَلَيْكَ وَقَارُ الصِّيَامِ وَ لَا تَجْعَلْ يَوْمَ صَوْمِكَ كَيَوْمِ فِطْرِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Al Qasim Bin Suleyman, from Jarrah Al Madainy, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Fasting is not from the food and the drink alone’. Then said: ‘Maryam<sup>as</sup> said: <span class=\"ibTxt\">[19:26] Surely I have vowed a fast to the Beneficent</span>, i.e., a Fast of silence’. (And in another copy: ‘i.e., silence). Therefore, whenever you Fast, preserve your tongues, and lower your gaze, and neither dispute not envy’.  \nHe<sup>asws</sup> said: ‘And Rasool-Allah<sup>saww</sup> heard a woman insulting a maid of her and she was Fasting. So Rasool-Allah<sup>saww</sup> called for the food and said to her: ‘Eat’. So she said, ‘I am Fasting’. So he<sup>saww</sup> said: ‘How can you happen to be Fasting and you have insulted your slave girl. The Fast is not from the food and the drink (only)’. \nHe (the narrator) said, ‘And Abu Abdullah<sup>asws</sup> said: ‘Whenever you Fast, so let your hearing, and your vision Fast from the Prohibition and the ugliness, and leave the disputing and hurting the servant, and let the dignity of the Fast be upon you, and do not make the day of your Fasting to be like a day of your breaking (not Fasting)’."}]}, {"index": 6288, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا صَامَ أَحَدُكُمُ الثَّلَاثَةَ الْأَيَّامِ مِنَ الشَّهْرِ فَلَا يُجَادِلَنَّ أَحَداً وَ لَا يَجْهَلْ وَ لَا يُسْرِعْ إِلَى الْحَلْفِ وَ الْأَيْمَانِ بِاللَّهِ فَإِنْ جَهِلَ عَلَيْهِ أَحَدٌ فَلْيَتَحَمَّلْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Abu Ayoub, from Al Fuzayl Bin Yasaar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever one of you Fasts for three days from the month, so he should neither dispute, nor act ignorantly, nor be hasty to the oath, and the oath by Allah<sup>azwj</sup>. So if anyone acts ignorantly upon him, so let him bear it (patiently)’."}]}, {"index": 6289, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ آبَائِهِ ( عليهم السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا مِنْ عَبْدٍ صَالِحٍ يُشْتَمُ فَيَقُولُ إِنِّي صَائِمٌ سَلَامٌ عَلَيْكَ لَا أَشْتِمُكَ كَمَا شَتَمْتَنِي إِلَّا قَالَ الرَّبُّ تَبَارَكَ وَ تَعَالَى اسْتَجَارَ عَبْدِي بِالصَّوْمِ مِنْ شَرِّ عَبْدِي فَقَدْ أَجَرْتُهُ مِنَ النَّارِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘There is none from a righteous servant who is insulted, so he is saying, ‘I am Fasting. Peace be upon you. I shall not insult you just as you have insulted me’, except that The Lord<sup>azwj</sup>, Blessed and High Says: “My<sup>azwj</sup> servant sought Protection with the Fast from the evil of My<sup>azwj</sup> servant, so I<sup>azwj</sup> have Protected from the Fire”’."}]}, {"index": 6290, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ وَ غَيْرِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يُنْشَدُ الشِّعْرُ بِلَيْلٍ وَ لَا يُنْشَدُ فِي شَهْرِ رَمَضَانَ بِلَيْلٍ وَ لَا نَهَارٍ فَقَالَ لَهُ إِسْمَاعِيلُ يَا أَبَتَاهْ فَإِنَّهُ فِينَا قَالَ وَ إِنْ كَانَ فِينَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, and someone else, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Neither should you recite ‘الشِّعْرُ’ fictitious stories at night nor should you (narrate) fiction during the Month of Ramazan at night, neither by the night or by the day’. So Ismail said to him<sup>asws</sup>, ‘O father<sup>asws</sup>! Supposing it (fiction) is regarding us<sup>asws</sup>?’ He<sup>asws</sup> said: ‘And even though it was regarding us<sup>asws</sup>’."}]}, {"index": 6291, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:7", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عُبَيْدٍ عَنْ عُبَيْدِ بْنِ هَارُونَ قَالَ حَدَّثَنَا أَبُو يَزِيدَ عَنْ حُصَيْنٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) عَلَيْكُمْ فِي شَهْرِ رَمَضَانَ بِكَثْرَةِ الِاسْتِغْفَارِ وَ الدُّعَاءِ فَأَمَّا الدُّعَاءُ فَيُدْفَعُ بِهِ عَنْكُمُ الْبَلَاءُ وَ أَمَّا الِاسْتِغْفَارُ فَيَمْحَى ذُنُوبَكُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ali Bin Al Husayn, from Muhammad Bin Ubeyd, from Ubeyd Bin Haroun who said, \n‘Abu Yazeed narrated to us, from Husayn, from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘It is upon you, during the Month of Ramazaan, with abundantly seeking of the Forgiveness, and the supplication. So, as for the supplication, the afflictions would be repelled from you, and as for the seeking of the Forgiveness, they would delete your sins’."}]}, {"index": 6292, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:8", "text": "وَ بِهَذَا الْإِسْنَادِ قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) إِذَا كَانَ شَهْرُ رَمَضَانَ لَمْ يَتَكَلَّمْ إِلَّا بِالدُّعَاءِ وَ التَّسْبِيحِ وَ الِاسْتِغْفَارِ وَ التَّكْبِيرِ فَإِذَا أَفْطَرَ قَالَ اللَّهُمَّ إِنْ شِئْتَ أَنْ تَفْعَلَ فَعَلْتَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by this chain, \n‘He<sup>asws</sup> said, ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, whenever it was the Month of Ramazaan, would not speak except by the supplication, and the Glorification, and the seeking of the Forgiveness, and the Exclamations of the Greatness (Takbeer). So when he<sup>asws</sup> would break Fast, he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! If You<sup>azwj</sup> so Desire to Do (something), so Do it’."}]}, {"index": 6293, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:9", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْوَشَّاءِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الصِّيَامَ لَيْسَ مِنَ الطَّعَامِ وَ الشَّرَابِ وَحْدَهُ إِنَّ مَرْيَمَ ( عليها السلام ) قَالَتْ إِنِّي نَذَرْتُ لِلرَّحْمنِ صَوْماً أَيْ صَمْتاً فَاحْفَظُوا أَلْسِنَتَكُمْ وَ غُضُّوا أَبْصَارَكُمْ وَ لَا تَحَاسَدُوا وَ لَا تَنَازَعُوا فَإِنَّ الْحَسَدَ يَأْكُلُ الْإِيمَانَ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ.", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Ahmad Bin Muhammad Bin Khalid, from Al Washa, from Ali Bin Abu Hamza, from Abu Baseer who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The Fasts are not from the food and the drink alone. Maryam<sup>as</sup> said <span class=\"ibTxt\">[19:26] Surely I have vowed a fast to the Beneficent</span>, i.e., silence. Therefore, preserve your tongues, and lower your gaze, and neither envy nor dispute, for the envy consumes the faith just as the fire consumes the firewood’."}]}, {"index": 6294, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:10", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ الْكَذِبَةُ تَنْقُضُ الْوُضُوءَ وَ تُفَطِّرُ الصَّائِمَ قَالَ قُلْتُ هَلَكْنَا قَالَ لَيْسَ حَيْثُ تَذْهَبُ إِنَّمَا ذَلِكَ الْكَذِبُ عَلَى اللَّهِ عَزَّ وَ جَلَّ وَ عَلَى رَسُولِهِ وَ عَلَى الْأَئِمَّةِ ( عليهم السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Mansour Bin Yunus, from Abu Baseer who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The lie breaks the ablution, and breaks the Fast’. I said, ‘We are destroyed’. He<sup>asws</sup> said: ‘It is not where you are going with it. But rather, that is the lie upon Allah<sup>azwj</sup> Mighty and Majestic and upon His<sup>azwj</sup> Rasool<sup>saww</sup>, and upon the Imams<sup>asws</sup>’."}]}, {"index": 6295, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:2:11:11", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مُوسَى عَنْ غِيَاثٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ اللَّهَ كَرِهَ لِي سِتَّ خِصَالٍ ثُمَّ كَرِهْتُهُنَّ لِلْأَوْصِيَاءِ مِنْ وُلْدِي وَ أَتْبَاعِهِمْ مِنْ بَعْدِي الرَّفَثَ فِي الصَّوْمِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Musa, from Giyas, from Is’haq Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said; ‘Allah<sup>azwj</sup> Disliked six characteristics for me<sup>saww</sup>, then I<sup>saww</sup> disliked these for the successors<sup>asws</sup> from my<sup>saww</sup> sons<sup>asws</sup>, and their<sup>asws</sup> followers from after me<sup>saww</sup>, (one of these being) obscenities during the Fasting’."}]}]}, "index": "al-kafi:4:2:11", "kind": "verse_list"}