{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:4:2:12",
        "titles": {
          "ar": "بَابُ صَوْمِ رَسُولِ اللَّهِ ( صلى الله عليه وآله )",
          "en": "Chapter 12 – The Fast of Rasool-Allah<sup>saww</sup>"
        }
      }
    ],
    "index": 872,
    "local_index": 12,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:4:2:13",
        "titles": {
          "ar": "بَابُ فَضْلِ صَوْمِ شَعْبَانَ وَ صِلَتِهِ بِرَمَضَانَ وَ صِيَامِ ثَلَاثَةِ أَيَّامٍ فِي كُلِّ شَهْرٍ",
          "en": "Chapter 13 – Merits of the Fasts of Shaban and its relating with Ramazan, and the three Fasts during every month"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:4:2:11",
        "titles": {
          "ar": "بَابُ أَدَبِ الصَّائِمِ",
          "en": "Chapter 11 – Ettiquettes of the Fasting one"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:12",
    "titles": {
      "ar": "بَابُ صَوْمِ رَسُولِ اللَّهِ ( صلى الله عليه وآله )",
      "en": "Chapter 12 – The Fast of Rasool-Allah<sup>saww</sup>"
    },
    "verse_count": 7,
    "verse_start_index": 6295,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/252)"
        ],
        "index": 6296,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:12:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ صَامَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَتَّى قِيلَ مَا يُفْطِرُ ثُمَّ أَفْطَرَ حَتَّى قِيلَ مَا يَصُومُ ثُمَّ صَامَ صَوْمَ دَاوُدَ ( عليه السلام ) يَوْماً وَ يَوْماً لَا ثُمَّ قُبِضَ عَلَى صِيَامِ ثَلَاثَةِ أَيَّامٍ فِي الشَّهْرِ قَالَ إِنَّهُنَّ يَعْدِلْنَ صَوْمَ الشَّهْرِ وَ يَذْهَبْنَ بِوَحَرِ الصَّدْرِ وَ الْوَحَرُ الْوَسْوَسَةُ ",
          "قَالَ حَمَّادٌ فَقُلْتُ وَ أَيُّ الْأَيَّامِ هِيَ قَالَ أَوَّلُ خَمِيسٍ فِي الشَّهْرِ وَ أَوَّلُ أَرْبِعَاءَ بَعْدَ الْعَشْرِ مِنْهُ وَ آخِرُ خَمِيسٍ فِيهِ فَقُلْتُ كَيْفَ صَارَتْ هَذِهِ الْأَيَّامُ الَّتِي تُصَامُ فَقَالَ إِنَّ مَنْ قَبْلَنَا مِنَ الْأُمَمِ كَانَ إِذَا نَزَلَ عَلَى أَحَدِهِمُ الْعَذَابُ نَزَلَ فِي هَذِهِ الْأَيَّامِ فَصَامَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) هَذِهِ الْأَيَّامَ الْمَخُوفَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa, from Hammad Bin Usman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> Fasted until it was said, ‘He<sup>saww</sup> would not break’. Then he<sup>saww</sup> broke (did not Fast) until it was said, ‘He<sup>saww</sup> will never Fast’. Then he<sup>saww</sup> Fasted the Fasts of Dawood<sup>as</sup>, one day, and one day not. Then he<sup>saww</sup> passed away upon Fasting three days during the month. These (three Fasts) equate to Fasting the (whole) month, and they remove <span class=\"iTxt\">Al-Wahr</span> of the chest, and <span class=\"iTxt\">Al-Wahr</span> is the anxiety’. ",
            "Hammad (the narrator) said, ‘So I said, ‘And which days are these?’ He<sup>asws</sup> said: ‘The first Thursday in the month, and the first Wednesday after the ten (days) from it, and the last Thursday in it’. So I said, ‘How did these days come to be the one in which is to be Fasting’. So he<sup>asws</sup> said: ‘The ones before us from the communities, whenever the Punishment descended upon any one of these, descended during these days. Thus, Rasool-Allah<sup>saww</sup> Fasted during these days, out of fear (upon the Punishment on his<sup>saww</sup> community’)."
          ],
          "en.sarwar": [
            "1. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from af-Washsha’ from Hammad ibn ‘Uthman who has said the following: “I heard abu ‘ Abd Allah, ‘Alayhi al-Salam, say, ‘The Messenger of Allah continued fasting for such a long time that people thought he would not discontinue it. He then discontinued fasting for such a long time that people thought he would not fast. Then he began fasting as Dawud, ‘Alayhi al-Salam, did. One day he would fast and not fast the next day. He left this world with a practice of fasting three days every month. The Imam said, ‘Fasting three days every month is like fasting a whole month. This removes wahr from one’s chest. Wahr means temptation.’ Hammad has said, ‘I then asked, which days are they?’ He (the Imam) replied, ‘Every first Thursday, every first Wednesday after the tenth of the month and the last Thursday therein.’ I then asked, ‘How did these days become as such?’ He replied, ‘The days when torment descended on the people of the past were one of these days. Because of fear, the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would fast during these days.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/252)"
        ],
        "index": 6297,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:12:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَوَّلَ مَا بُعِثَ يَصُومُ حَتَّى يُقَالَ مَا يُفْطِرُ وَ يُفْطِرُ حَتَّى يُقَالَ مَا يَصُومُ ثُمَّ تَرَكَ ذَلِكَ وَ صَامَ يَوْماً وَ أَفْطَرَ يَوْماً وَ هُوَ صَوْمُ دَاوُدَ ( عليه السلام ) ثُمَّ تَرَكَ ذَلِكَ وَ صَامَ الثَّلَاثَةَ الْأَيَّامِ الْغُرِّ ثُمَّ تَرَكَ ذَلِكَ وَ فَرَّقَهَا فِي كُلِّ عَشَرَةِ أَيَّامٍ يَوْمَا خَمِيسَيْنِ بَيْنَهُمَا أَرْبِعَاءُ فَقُبِضَ عَلَيْهِ وَ آلِهِ السَّلَامُ وَ هُوَ يَعْمَلُ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup>, at the beginning of his<sup>saww</sup> Sending, was Fasting such until it was said, ‘He<sup>saww</sup> will not be breaking (stop Fasting)’, and he<sup>saww</sup> was breaking (not Fasting) until it was said, ‘He<sup>saww</sup> will not be Fasting’. Then he<sup>saww</sup> left that and Fasted for one day, and broke (not Fasted) for one day, and it is the Fasting of Dawood<sup>as</sup>. Then he<sup>saww</sup> left that and Fasted the three days of brightness (13<sup>th</sup>, 14<sup>th</sup> & 15<sup>th</sup> of the month). Then he<sup>saww</sup> left that and separated these during every ten days, there being two Thursdays and one Wednesday in between. So he<sup>saww</sup> passed away, and he<sup>saww</sup> was acting upon that’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Ayyub from Muhammad ibn Muslim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, continued fasting for such a long time that people thought he would not discontinue it. He then discontinued fasting for such a long time that people thought he would not fast. Then he began fasting as Dawud, ‘Alayhi al- Salam, did. One day he would fast and then not fast the next day. He left this practice and would fast three bright days (13, 14 and 15) of every month. He then left this practice and divided them by one day in each ten days of the month, of which two were Thursdays with a Wednesday between the two Thursdays. He passed away with this practice.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/253)"
        ],
        "index": 6298,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:12:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَصُومُ حَتَّى يُقَالَ لَا يُفْطِرُ ثُمَّ صَامَ يَوْماً وَ أَفْطَرَ يَوْماً ثُمَّ صَامَ الْإِثْنَيْنَ وَ الْخَمِيسَ ثُمَّ آلَ مِنْ ذَلِكَ إِلَى صِيَامِ ثَلَاثَةِ أَيَّامٍ فِي الشَّهْرِ الْخَمِيسِ فِي أَوَّلِ الشَّهْرِ وَ أَرْبِعَاءَ فِي وَسَطِ الشَّهْرِ وَ خَمِيسٍ فِي آخِرِ الشَّهْرِ وَ كَانَ يَقُولُ ذَلِكَ صَوْمُ الدَّهْرِ ",
          "وَ قَدْ كَانَ أَبِي ( عليه السلام ) يَقُولُ مَا مِنْ أَحَدٍ أَبْغَضَ إِلَيَّ مِنْ رَجُلٍ يُقَالُ لَهُ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَفْعَلُ كَذَا وَ كَذَا فَيَقُولُ لَا يُعَذِّبُنِي اللَّهُ عَلَى أَنْ أَجْتَهِدَ فِي الصَّلَاةِ كَأَنَّهُ يَرَى أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) تَرَكَ شَيْئاً مِنَ الْفَضْلِ عَجْزاً عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Jameel Bin Slih, from Muhammad Bin Marwan who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> was Fasting such, until it was said, ‘He<sup>saww</sup> would not be breaking (not Fasting)’. Then he<sup>saww</sup> Fasted one day, and broke one day. Then he<sup>saww</sup> Fasted Mondays and Thursdays. Then he<sup>saww</sup> transferred from that to the Fasting of three days during the month, the first Thursday at the beginning of the month, and Wednesday in the middle of the month, and Thursday at the end of the month; and he<sup>saww</sup> was saying: ‘That is the Fasting of the whole time (whole month)’. ",
            "And my<sup>asws</sup> father<sup>asws</sup> was saying: ‘There is no one more hateful to me<sup>asws</sup> than a man to whom it is said, ‘Rasool-Allah<sup>saww</sup> used to do such and such’, so he is saying, ‘Allah<sup>azwj</sup> will not Punish me if I strive hard regarding the Prayer’. It is as if he sees that Rasool-Allah<sup>saww</sup> neglected something from the preferential acts being frustrated from it’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub from Jamil ibn Salih from Muhammad ibn Marwan who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, continued fasting for such a long time that people thought he was not to discontinue his fasting. He then discontinued fasting for such a long time that people thought he did not intend to fast anymore. He then would fast one day and eat the next day. He then fasted every Monday and Thursday. Then he would fast three days every month, Thursday of the beginning of the month, Wednesday of the middle of the month and the last Thursday of the month. He would say, “It is like fasting forever.’” My father would say, ‘There is no other thing more hateful to me than one to whom it is said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, did this, but he says, “Allah will not punish me if I tried to perform Salat (prayer)” as if he thinks the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, neglected some of the virtuous acts because of his failure.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/253)"
        ],
        "index": 6299,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:12:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كُنَّ نِسَاءُ النَّبِيِّ ( صلى الله عليه وآله ) إِذَا كَانَ عَلَيْهِنَّ صِيَامٌ أَخَّرْنَ ذَلِكَ إِلَى شَعْبَانَ كَرَاهَةَ أَنْ يَمْنَعْنَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَإِذَا كَانَ شَعْبَانُ صُمْنَ وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ شَعْبَانُ شَهْرِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The wives of the Prophet<sup>saww</sup>, whenever they had compensatory Fasts upon them, would delay that to Shaban in anticipation that Rasool-Allah<sup>saww</sup> would forbid them. So whenever it was Shaban, they would Fast these, and Rasool-Allah<sup>saww</sup> was saying: ‘Shaban is my<sup>saww</sup> month’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hafs ibn al-Bakhtariy who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that wives of the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, when required to fast, would wait up to the month of Sha‘ban, due to anticipation that he may forbid them. In the month of Sha‘ban they would fast and the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Sha‘ban is my month.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/254)"
        ],
        "index": 6300,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:12:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ قُلْتُ لِأَبِي  عَبْدِ اللَّهِ ( عليه السلام ) هَلْ صَامَ أَحَدٌ مِنْ آبَائِكَ شَعْبَانَ قَالَ خَيْرُ آبَائِي رَسُولُ اللَّهِ ( صلى الله عليه وآله ) صَامَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Did any of your<sup>asws</sup> forefathers<sup>asws</sup> Fast during Shaban?’ He<sup>asws</sup> said: ‘The best of my<sup>asws</sup> forefathers<sup>asws</sup>, Rasool-Allah<sup>saww</sup>, Fasted it’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah, who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Had any of your ancestors fasted during the month of Sha‘ban?’ He replied, ‘The best of my ancestors was the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, who fasted in it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/254)"
        ],
        "index": 6301,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:12:6",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) هَلْ صَامَ أَحَدٌ مِنْ آبَائِكَ شَعْبَانَ قَطُّ قَالَ صَامَهُ خَيْرُ آبَائِي رَسُولُ اللَّهِ ( صلى الله عليه وآله ) .",
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ عَنِ ابْنِ مُسْكَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ",
          "فَأَمَّا الَّذِي جَاءَ فِي صَوْمِ شَعْبَانَ أَنَّهُ سُئِلَ ( عليه السلام ) عَنْهُ فَقَالَ مَا صَامَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ لَا أَحَدٌ مِنْ آبَائِي قَالَ ذَلِكَ لِأَنَّ قَوْماً قَالُوا إِنَّ صِيَامَهُ فَرْضٌ مِثْلُ صِيَامِ شَهْرِ رَمَضَانَ وَ وُجُوبَهُ مِثْلُ وُجُوبِ شَهْرِ رَمَضَانَ وَ إِنَّ مَنْ أَفْطَرَ يَوْماً مِنْهُ فَعَلَيْهِ مِنَ الْكَفَّارَةِ مِثْلُ مَا عَلَى مَنْ أَفْطَرَ يَوْماً مِنْ شَهْرِ رَمَضَانَ",
          "وَ إِنَّمَا قَوْلُ الْعَالِمِ ( عليه السلام ) مَا صَامَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ لَا أَحَدٌ مِنْ آبَائِي ( عليهم السلام ) أَيْ مَا صَامُوهُ فَرْضاً وَاجِباً تَكْذِيباً لِقَوْلِ مَنْ زَعَمَ أَنَّهُ فَرْضٌ وَ إِنَّمَا كَانُوا يَصُومُونَهُ سُنَّةً فِيهَا فَضْلٌ وَ لَيْسَ عَلَى مَنْ لَمْ يَصُمْهُ شَيْ‏ءٌ "
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Safwan, from Ibn Muskan, from Al Halby who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> said: ‘Did anyone from your<sup>asws</sup> forefathers<sup>asws</sup> Fast during Shaban at all?’ He<sup>asws</sup> said: ‘The best of my<sup>asws</sup> forefathers<sup>asws</sup>, Rasool-Allah<sup>saww</sup> Fasted it’. ",
            "<span style=\"font-size: small\">Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Yunus, from Ibn Muskan, from Al Halby, from Abu Abdullah</span><sup>asws</sup><span style=\"font-size: small\"> –</span> similar to it. ",
            "So, as for what has come regarding the Fasts of Shaban, he<sup>asws</sup> was asked about it, so he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> did not Fast it, nor did anyone from my<sup>asws</sup> forefathers<sup>asws</sup>’. He<sup>asws</sup> said: ‘That is because a group was saying that Fasting in it is Obligatory like the Fasts of the Month of Ramazan, and its Obligation is like the Obligation of the Month of Ramazan, and that the one who breaks a day from it, so upon him would be the expiation similar to what it would be upon the one who breaks one day from the Month of Ramazan’.",
            "And rather, the words of the Scholar<sup>asws</sup>: ‘Rasool-Allah<sup>saww</sup> did not Fast it, nor did anyone from my<sup>asws</sup> forefathers<sup>asws</sup>’, yes, he<sup>saww</sup> did not Fast it as an Obligated Obligation, in belying the words of the one who alleged that it is an Obligation. And rather, Fasting it is a Sunnah wherein is virtue, and there is not upon the one who does not Fast it, anything’."
          ],
          "en.sarwar": [
            "6. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan all from Safwan from ibn Muskan from al-Halabiy who has said the following: “Once, I asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Had any of your ancestors ever fasted during the month of Sha‘ban?’ He (the Imam) replied, ‘The best of my ancestors, the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, fasted in it.’” Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from Yunus from ibn Muskan from al-Halabiy from abu ‘Abd Allah, ‘Alayhi al-Salam, a similar Hadith. There are narrations about fasting in the month of al-Sha‘ban. He (the Imam), ‘Alayhi al-Salam, was asked about it and he (the Imam) said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, did not fast (during the month of Sha‘ban) neither did any of my ancestors.’ He (the Imam) said, ‘It is because certain people said that fasting in the month of al-Sha‘ban is obligatory like fasting in the month of Ramadan. If one destroys one day of fasting of month of al-Sha‘ban, the expiation for it is like the expiation for destroying one day of fasting of the month of Ramadan. The words of the scholar, ‘Alayhi al-Salam, ‘The Messenger of Allah did not fast neither did any of my ancestors’ means they did not fast it as an obligatory fast. It was to refute what certain people thought it to be. Their fast was only as Sunnah in which there is virtue but it is not harmful to one who does not fast. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/254)"
        ],
        "index": 6302,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:12:7",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ أَحْمَدَ بْنِ صَبِيحٍ عَنْ عَنْبَسَةَ الْعَابِدِ قَالَ قُبِضَ النَّبِيُّ ( صلى الله عليه وآله ) عَلَى صَوْمِ شَعْبَانَ وَ رَمَضَانَ وَ ثَلَاثَةِ أَيَّامٍ فِي كُلِّ شَهْرٍ أَوَّلِ خَمِيسٍ وَ أَوْسَطِ أَرْبِعَاءَ وَ آخِرِ خَمِيسٍ وَ كَانَ أَبُو جَعْفَرٍ وَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَصُومَانِ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hassan, from Ahmad in Sabeeh, from Anbasa Al Aabid who said, ",
            "‘The Prophet<sup>saww</sup> passed away upon Fasting Shaban and Ramazaan, and three days during every month – the first Thursday, and the middle Wednesday, and the last Thursday; and Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup>, both were Fasting that’."
          ],
          "en.sarwar": [
            "7. Ahmad ibn Muhammad has narrated from Ali ibn al-Hassan from Ahmad ibn Sabih from ‘Anbasah al-‘Abid in a Mawquf manner who has said the following: “He (the Imam) ‘Alayhi al-Salam, has said, ‘The Messenger of Allah left this world practicing the fast of month of al-Sha‘ban and three days of every month, the first Thursday, the middle Wednesday and the last Thursday of the month. Abu Ja‘far, and abu ‘Abd Allah, ‘Alayhim al-Salam, would also do so. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:12",
  "kind": "verse_list"
}