{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:4:2:15",
        "titles": {
          "ar": "بَابُ مَا يَقُولُ الصَّائِمُ إِذَا أَفْطَرَ",
          "en": "Chapter 15 – What the Fasting one should be saying when he breaks Fast"
        }
      }
    ],
    "index": 875,
    "local_index": 15,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:4:2:16",
        "titles": {
          "ar": "بَابُ صَوْمِ الْوِصَالِ وَ صَوْمِ الدَّهْرِ",
          "en": "Chapter 16 – The continuous Fasting, and Fasting the whole time"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:4:2:14",
        "titles": {
          "ar": "بَابُ أَنَّهُ يُسْتَحَبُّ السَّحُورُ",
          "en": "Chapter 14 – The pre-dawn meal is recommended"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:15",
    "titles": {
      "ar": "بَابُ مَا يَقُولُ الصَّائِمُ إِذَا أَفْطَرَ",
      "en": "Chapter 15 – What the Fasting one should be saying when he breaks Fast"
    },
    "verse_count": 2,
    "verse_start_index": 6318,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/260)"
        ],
        "index": 6319,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:15:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي جَعْفَرٍ عَنْ آبَائِهِ ( عليهم السلام ) أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ إِذَا أَفْطَرَ قَالَ اللَّهُمَّ لَكَ صُمْنَا وَ عَلَى رِزْقِكَ أَفْطَرْنَا فَتَقَبَّلْهُ مِنَّا ذَهَبَ الظَّمَأُ وَ ابْتَلَّتِ الْعُرُوقُ وَ بَقِيَ الْأَجْرُ "
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> that Rasool-Allah<sup>saww</sup>, whenever he<sup>saww</sup> used to break Fast, said: ‘O Allah<sup>azwj</sup>! For You<sup>azwj</sup>, we Fast, and upon Your<sup>azwj</sup> sustenance we break, therefore Accept it from us. The thirst is gone, and the veins are wet, and the Recompense remains (outstanding)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father, from af-Nawfafiy, from af-Sakuniy who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has narrated from his ancestors who have said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would say this prayer during breakfast after sunset. ‘O Allah, we fasted for your sake, with your sustenance we break our fast. Please accept it from us. Thirst is gone, veins are quenched and the reward is to come.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول وربما يعد حسن ا  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/261)"
        ],
        "index": 6320,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:15:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَقُولُ فِي كُلِّ لَيْلَةٍ مِنْ شَهْرِ رَمَضَانَ عِنْدَ الْإِفْطَارِ إِلَى آخِرِهِ الْحَمْدُ لِلَّهِ الَّذِي أَعَانَنَا فَصُمْنَا وَ رَزَقَنَا فَأَفْطَرْنَا اللَّهُمَّ تَقَبَّلْ مِنَّا وَ أَعِنَّا عَلَيْهِ وَ سَلِّمْنَا فِيهِ وَ تَسَلَّمْهُ مِنَّا فِي يُسْرٍ مِنْكَ وَ عَافِيَةٍ الْحَمْدُ لِلَّهِ الَّذِي قَضَى عَنَّا يَوْماً مِنْ شَهْرِ رَمَضَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Sa’dan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘One should be saying during every night from the Month of Ramazan, during the breaking of the Fast up to its end, ‘The Praise is for Allah<sup>azwj</sup>, Who Aided us, so we Fasted, and Graced us, so we broke. O Allah<sup>azwj</sup>! Accept from us, and Aid us upon it, and Secure us in it, and Receive is from us in ease from You<sup>azwj</sup> and good health. The Praise is for Allah<sup>azwj</sup>, Who Accomplished for us one day from the Month of Ramazan’."
          ],
          "en.sarwar": [
            "2. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Sa‘dan from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that every night in the month of Ramadan during breakfast after sunset, say this prayer, ‘All praise belongs to Allah who has helped us to fast and has granted us sustenance to break our fast. O Allah, accept it from us and help us to do it, keep us safe in this month, receive it from us with ease from You and good health. All praise belongs to Allah who completed one day of the month of Ramadan for us.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:15",
  "kind": "verse_list"
}