{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:4:2:17",
        "titles": {
          "ar": "بَابُ مَنْ أَكَلَ أَوْ شَرِبَ وَ هُوَ شَاكٌّ فِي الْفَجْرِ أَوْ بَعْدَ طُلُوعِهِ",
          "en": "Chapter 17 – The one who eats or drinks and he doubts regarding the dawn, or after its emergence"
        }
      }
    ],
    "index": 877,
    "local_index": 17,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:4:2:18",
        "titles": {
          "ar": "بَابُ الْفَجْرِ مَا هُوَ وَ مَتَى يَحِلُّ وَ مَتَى يَحْرُمُ الْأَكْلُ",
          "en": "Chapter 18 – The dawn – what it is, and when is the eating Permissible and when is it Prohibited"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:4:2:16",
        "titles": {
          "ar": "بَابُ صَوْمِ الْوِصَالِ وَ صَوْمِ الدَّهْرِ",
          "en": "Chapter 16 – The continuous Fasting, and Fasting the whole time"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:17",
    "titles": {
      "ar": "بَابُ مَنْ أَكَلَ أَوْ شَرِبَ وَ هُوَ شَاكٌّ فِي الْفَجْرِ أَوْ بَعْدَ طُلُوعِهِ",
      "en": "Chapter 17 – The one who eats or drinks and he doubts regarding the dawn, or after its emergence"
    },
    "verse_count": 7,
    "verse_start_index": 6325,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/262)"
        ],
        "index": 6326,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:17:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنْ رَجُلٍ تَسَحَّرَ ثُمَّ خَرَجَ مِنْ بَيْتِهِ وَ قَدْ طَلَعَ الْفَجْرُ وَ تَبَيَّنَ قَالَ يُتِمُّ صَوْمَهُ ذَلِكَ ثُمَّ لْيَقْضِهِ فَإِنْ تَسَحَّرَ فِي غَيْرِ شَهْرِ رَمَضَانَ بَعْدَ الْفَجْرِ أَفْطَرَ ",
          "ثُمَّ قَالَ إِنَّ أَبِي كَانَ لَيْلَةً يُصَلِّي وَ أَنَا آكُلُ فَانْصَرَفَ فَقَالَ أَمَّا جَعْفَرٌ فَقَدْ أَكَلَ وَ شَرِبَ بَعْدَ الْفَجْرِ فَأَمَرَنِي فَأَفْطَرْتُ ذَلِكَ الْيَوْمَ فِي غَيْرِ شَهْرِ رَمَضَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having been asked about a man who partook a pre-dawn meal, then went out from his house, and the dawn had emerged and it was clear. He<sup>asws</sup> said: ‘He should complete that Fast of his, then let him make up for it. So, if he had taken the pre-dawn meal during other than a Month of Ramazan after the dawn, so he should break’. ",
            "Then he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> was Praying one night, and I<sup>asws</sup> ate. So he<sup>asws</sup> completed and said: ‘As for Ja’far<sup>asws</sup>, so he<sup>asws</sup> has eaten and drunk after the dawn’. So he<sup>asws</sup> instructed me<sup>asws</sup>, so I<sup>asws</sup> broke the Fast of that day (which was) other than the Month of Ramazan’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about a man who eats Suhur (breakfast in the morning before dawn), then comes out of his house to find out when it has already become dawn. He (the Imam) said, ‘He is required to complete that fast then make Qada’ (compensatory fast) for it; however if such breakfast is in a time other than the month of Ramadan and after dawn one must not fast.’ He (the Imam) then said, ‘Once during the night my father was performing Salat (prayer) and I was eating Suhur (breakfast in the morning before dawn). He ended and said, ‘Ja’far has eaten and drunk after dawn.’ So he commanded me and I did not fast that day which was not of the month of Ramadan.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/263)"
        ],
        "index": 6327,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:17:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ بْنِ مِهْرَانَ قَالَ سَأَلْتُهُ عَنْ رَجُلٍ أَكَلَ وَ شَرِبَ بَعْدَ مَا طَلَعَ الْفَجْرُ فِي شَهْرِ رَمَضَانَ فَقَالَ إِنْ كَانَ قَامَ فَنَظَرَ فَلَمْ يَرَ الْفَجْرَ فَأَكَلَ ثُمَّ عَادَ فَرَأَى الْفَجْرَ فَلْيُتِمَّ صَوْمَهُ وَ لَا إِعَادَةَ عَلَيْهِ وَ إِنْ كَانَ قَامَ فَأَكَلَ وَ شَرِبَ ثُمَّ نَظَرَ إِلَى الْفَجْرِ فَرَأَى أَنَّهُ قَدْ طَلَعَ الْفَجْرُ فَلْيُتِمَّ صَوْمَهُ وَ يَقْضِي يَوْماً آخَرَ لِأَنَّهُ بَدَأَ بِالْأَكْلِ قَبْلَ النَّظَرِ فَعَلَيْهِ الْإِعَادَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at Bin Mihran who said, ",
            "‘I asked him<sup>asws</sup> about a man who eats and drinks after the emergence of the dawn during a Month of Ramazan. So he<sup>asws</sup> said: ‘If it was such that he stood and looked (outside for the dawn), but did not see the dawn, so he ate, then returned, so he saw the dawn, so let him complete his Fast, and there is no repeating upon him; but if it was such that he stood up and ate and drank, then looked to the dawn, so he saw that the dawn had emerged, so let him complete his Fast, and he should compensate for it another day, because he began with the eating before looking, so upon him is the repeating’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah ibn Mehran who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who eats and drinks after dawn in the month of Ramadan. He (the Imam) said, ‘If he got up and looked but did not see the dawn then ate then returned and saw that it was dawn, he is required to complete that fast and there is no Qada’ (compensatory fast) on him. If he gets up, eats and drinks, and then looks to the dawn that is already there, he is required to complete that fast and make Qada’ (compensatory fast) for one other day because he ate first, then went to find out about dawn, thus fast of one day is necessary.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/263)"
        ],
        "index": 6328,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:17:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) آمُرُ الْجَارِيَةَ أَنْ تَنْظُرَ طَلَعَ الْفَجْرُ أَمْ لَا فَتَقُولُ لَمْ يَطْلُعْ فَآكُلُ ثُمَّ أَنْظُرُهُ فَأَجِدُهُ قَدْ طَلَعَ حِينَ نَظَرَتْ قَالَ تُتِمُّ يَوْمَكَ ثُمَّ تَقْضِيهِ أَمَا إِنَّكَ لَوْ كُنْتَ أَنْتَ الَّذِي نَظَرْتَ مَا كَانَ عَلَيْكَ قَضَاؤُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I instructed the maid that she looks whether the dawn has emerged or not, So she was saying, ‘It has not emerged’. So I ate, then looked, so I found that it had emerged when she had looked’. He<sup>asws</sup> said: ‘You should complete (the Fast of) your day, then compensate for it. But, had it been you who had looked, there would have been nothing upon you’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of my fasting when I asked the girl to look if it was dawn yet and she said that it was not dawn, yet and I ate; then I looked and saw that it was dawn. He (the Imam) said, ‘You are required to complete that fast and make Qada’ (compensatory fast for it); however, if you yourself had looked first before eating there would have been no Qada’ (compensatory fast) upon you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/264)"
        ],
        "index": 6329,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:17:4",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ خَرَجَ فِي شَهْرِ رَمَضَانَ وَ أَصْحَابُهُ يَتَسَحَّرُونَ فِي بَيْتٍ فَنَظَرَ إِلَى الْفَجْرِ وَ نَادَاهُمْ فَكَفَّ بَعْضُهُمْ وَ ظَنَّ بَعْضُهُمْ أَنَّهُ يَسْخَرُ فَأَكَلَ فَقَالَ يُتِمُّ صَوْمَهُ وَ يَقْضِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin ShAzan, from Safwan Bin Yahya, from Ays Bin Al Qasim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who goes out during the Month of Ramazan, and his companions are partaking their pre-dawn meal in the house. So he looks to the dawn and calls out to them, so some of them refrain and some of them think that he is joking. So he eats. So he<sup>asws</sup> said: ‘He should complete his Fast, and he should make up for it’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from ‘Is ibn al-Qasim who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who along with his friends go for Suhur (breakfast in the morning before dawn) in a house. He looks toward dawn and asks them to stop eating. Certain ones among them stop and others think that he is joking and he eats. He (the Imam) said, ‘He completes that fast and makes its Qada’ (compensatory fast) also.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/264)"
        ],
        "index": 6330,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:17:5",
        "text": [
          "صَفْوَانُ بْنُ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي إِبْرَاهِيمَ ( عليه السلام ) يَكُونُ عَلَيَّ الْيَوْمُ وَ الْيَوْمَانِ مِنْ شَهْرِ رَمَضَانَ فَأَتَسَحَّرُ مُصْبِحاً أُفْطِرُ ذَلِكَ الْيَوْمَ وَ أَقْضِي مَكَانَ ذَلِكَ الْيَوْمِ يَوْماً آخَرَ أَوْ أُتِمُّ عَلَى صَوْمِ ذَلِكَ الْيَوْمِ وَ أَقْضِي يَوْماً آخَرَ فَقَالَ لَا بَلْ تُفْطِرُ ذَلِكَ الْيَوْمَ لِأَنَّكَ أَكَلْتَ مُصْبِحاً وَ تَقْضِي يَوْماً آخَرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Safwan Bin Yahya, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), ‘There happens to be upon me (Fasting for) the day, and the two days from the Month of Ramazan (to make up for). So I take the pre-dawn meal in the morning. Should I break (not Fast) that day, and make up for it in place of that with another day, or should I complete upon the Fast of that day and make up for it with another day?’ So he<sup>asws</sup> said: ‘No, but you break that day, because you ate in the morning, and you should make up for it another day’."
          ],
          "en.sarwar": [
            "5. From Safwan ibn Yahya has narrated from Ishaq ibn ‘Ammar who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about the case of my fasting that I owe one or two days of the month of Ramadan. I eat Suhur (breakfast in the morning before dawn) but it is already dawn. Is it necessary for me to eat that day instead of fasting and make Qada’ (compensatory fast) of that day on another day or complete that fast and then make Qada’ (compensatory fast) on another day? He (the Imam) said, ‘No, but you eat in that day; you ate after dawn. You must make Qada’ (compensatory fast) for it on another day.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/264)"
        ],
        "index": 6331,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:17:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ شَرِبَ بَعْدَ مَا طَلَعَ الْفَجْرُ وَ هُوَ لَا يَعْلَمُ فِي شَهْرِ رَمَضَانَ قَالَ يَصُومُ يَوْمَهُ ذَلِكَ وَ يَقْضِي يَوْماً آخَرَ وَ إِنْ كَانَ قَضَاءً لِرَمَضَانَ فِي شَوَّالٍ أَوْ فِي غَيْرِهِ فَشَرِبَ بَعْدَ الْفَجْرِ فَلْيُفْطِرْ يَوْمَهُ ذَلِكَ وَ يَقْضِي ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Al Husayn Bin saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, ",
            "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about a man who drinks during the Month of Ramazan after the emergence of the dawn and he does not know’. He<sup>asws</sup> said; ‘He should Fast that day of his, and he should make up for it another day; and if he was making up for it for Ramazan during Shawwal, or in another (month), so he drinks after the dawn, so let him break that day of his, and he should make up for it’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about a man who drinks after dawn and he does not know that it is the month of Ramadan. He (the Imam) said, ‘He is required to fast that day and make Qada’ (compensatory fast for it) on another day and if it is a Qada’ (compensatory fast) of the month of Ramadan in the month of Shawwal or other times and he drinks after dawn, he eats in that day and makes Qada 5 (compensatory fast for it) on another day. ‘“"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/265)"
        ],
        "index": 6332,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:17:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ بْنِ مِهْرَانَ قَالَ سَأَلْتُهُ عَنْ رَجُلَيْنِ قَامَا فَنَظَرَا إِلَى الْفَجْرِ فَقَالَ أَحَدُهُمَا هُوَ ذَا وَ قَالَ الْآخَرُ مَا أَرَى شَيْئاً قَالَ فَلْيَأْكُلِ الَّذِي لَمْ يَسْتَبِنْ لَهُ الْفَجْرُ وَ قَدْ حَرُمَ عَلَى الَّذِي زَعَمَ أَنَّهُ رَأَى الْفَجْرَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ كُلُوا وَ اشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at Bin Mihran who said, ",
            "‘I asked him<sup>asws</sup> about two men who stand to look at the dawn. So, one of the two says, ‘It is that’, and the other one says, ‘I do not see a thing’. He<sup>asws</sup> said: ‘So, let him eat, the one for whom the dawn had not been evident, and it is forbidden (to eat) upon the one who claimed that he had seen the dawn. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[2:187] and eat and drink until the white thread becomes distinct from the black thread at Dawn</span>’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah ibn Mehran who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of two men who both look toward dawn and one of them say, ‘There is dawn/ but the other one says, ‘I do not see anything/ He (the Imam) said, ‘The one who does not see any dawn, eats but eating is unlawful for one who thinks he has seen the dawn. Allah, most Majestic, most Glorious, says, ‘Eat and drink until the white thread appears from the dark thread of dawn/ (2:187)” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:17",
  "kind": "verse_list"
}