{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:4:2:2",
        "titles": {
          "ar": "بَابُ فَضْلِ شَهْرِ رَمَضَانَ",
          "en": "Chapter 2 – Merits of the Month of Ramazan"
        }
      }
    ],
    "index": 862,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:4:2:3",
        "titles": {
          "ar": "بَابُ مَنْ فَطَّرَ صَائِماً",
          "en": "Chapter 3 – The one who provides for the breaking the Fast of a Fasting-one"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:4:2:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>َابُ مَا جَاءَ فِي</span> فَضْلِ الصَّوْمِ وَ الصَّائِمِ",
          "en": "Chapter 1 – What (reports) have come regarding the merits of the Fast and the Fasting one"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:2",
    "titles": {
      "ar": "بَابُ فَضْلِ شَهْرِ رَمَضَانَ",
      "en": "Chapter 2 – Merits of the Month of Ramazan"
    },
    "verse_count": 7,
    "verse_start_index": 6233,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/205)"
        ],
        "index": 6234,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/201",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2901",
              "text": "عَمْرٍو الشَّامِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَمْرٍو الشَّامِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:2:1",
        "text": [
          " إِنَّ عِدَّةَ الشُّهُورِ عِنْدَ اللَّهِ اثْنا عَشَرَ شَهْراً فِي كِتابِ اللَّهِ يَوْمَ خَلَقَ السَّماواتِ وَ الْأَرْضَ فَغُرَّةُ الشُّهُورِ شَهْرُ اللَّهِ عَزَّ ذِكْرُهُ وَ هُوَ شَهْرُ رَمَضَانَ وَ قَلْبُ شَهْرِ رَمَضَانَ لَيْلَةُ الْقَدْرِ وَ نُزِّلَ الْقُرْآنُ فِي أَوَّلِ لَيْلَةٍ مِنْ شَهْرِ رَمَضَانَ فَاسْتَقْبِلِ الشَّهْرَ بِالْقُرْآنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Amro Al Shamy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The number of months in the Presence of Allah<sup>azwj</sup> are twelve months in the Book of Allah<sup>azwj</sup>, from the day He<sup>azwj</sup> Created the skies and the earth. So the commencement of the months is the Month of Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, and it is the Month of Ramazan; and the heart of the Month of Ramazan is the Night of Pre-destination; and the Quran was Revealed in the first night of the Month of Ramazan. Therefore, welcome the Month with the Quran’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ‘ Abd Allah ibn al-Mughirah from ‘Amr al-Shamiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the number of months before Allah is twelve in Allah’s Book, from the day He created the heavens and earth. In front of the months is the month of Allah, whose mention is most majestic, and that is the month of Ramadan. The heart of the month of Ramadan is the night of al-Qadr (destiny). The Holy Quran came during the first night of the month of Ramadan; thus, the month is welcomed with the Holy Quran.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق على الظاه ر  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/206)"
        ],
        "index": 6235,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2145",
              "text": "الْمِسْمَعِيِّ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنِ الْمِسْمَعِيِّ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:2:2",
        "text": [
          "هُ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يُوصِي وُلْدَهُ إِذَا دَخَلَ شَهْرُ رَمَضَانَ فَاجْهَدُوا أَنْفُسَكُمْ فَإِنَّ فِيهِ تُقَسَّمُ الْأَرْزَاقُ وَ تُكْتَبُ الْآجَالُ وَ فِيهِ يُكْتَبُ وَفْدُ اللَّهِ الَّذِينَ يَفِدُونَ إِلَيْهِ وَ فِيهِ لَيْلَةٌ الْعَمَلُ فِيهَا خَيْرٌ مِنَ الْعَمَلِ فِي أَلْفِ شَهْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan, from Is’haq Bin Ammar, from Al Misma’a having heard, ",
            "‘Abu Abdullah<sup>asws</sup> advised his<sup>asws</sup> children: ‘When the Month of Ramazan enters (begins), so struggle yourselves, for therein is the distribution of the livelihoods, and the terms (life spans) are written (Ordained), and therein is written (Ordained) the delegations of Allah<sup>azwj</sup> (Pilgrims of Hajj) who are going to Him<sup>azwj</sup>, and in it is a night, the good deed therein it is better than the deed in a thousand months’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Ishaq ibn ‘Ammar from al-Misma‘iy who has heard the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, giving advice to his children in the beginning of the month of Ramadan. The Imam said, ‘Make yourselves to work hard; in it (month of Ramadan), sustenance is distributed and the duration of lives is written down. During this month, it is decided who should join the delegation before Allah. In it, there is a night when one good deed is better than a good deed for one thousand months.’” "
          ]
        }
      },
      {
        "index": 6236,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/44",
              "text": "هِشَامِ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:2:3",
        "text": [
          " مَنْ لَمْ يُغْفَرْ لَهُ فِي شَهْرِ رَمَضَانَ لَمْ يُغْفَرْ لَهُ إِلَى قَابِلٍ إِلَّا أَنْ يَشْهَدَ عَرَفَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, from Hisham Bin Al hakam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who is not Forgiven in the Month of Ramazan, would not have Forgiveness for him up to the next (Month of Ramazan), except if he were to be present at Arafaat (during Zilhajj)’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from ibn abu ‘Umayr from Hisham ibn al-Hakam who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that if one is not forgiven in the month of Ramadan, one will not be forgiven until the coming month of Ramadan unless he attends ‘Arafah (the ninth of the month of Dhul Hajjah).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/206)"
        ],
        "index": 6237,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/109",
              "text": "غَيْرُهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/362",
              "text": "أَبِي أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2433",
              "text": "أَبِي الْوَرْدِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي الْوَرْدِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:2:4",
        "text": [
          " خَطَبَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) النَّاسَ فِي آخِرِ جُمُعَةٍ مِنْ شَعْبَانَ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ أَيُّهَا النَّاسُ إِنَّهُ قَدْ أَظَلَّكُمْ شَهْرٌ فِيهِ لَيْلَةٌ خَيْرٌ مِنْ أَلْفِ شَهْرٍ وَ هُوَ شَهْرُ رَمَضَانَ فَرَضَ اللَّهُ صِيَامَهُ وَ جَعَلَ قِيَامَ لَيْلَةٍ فِيهِ بِتَطَوُّعِ صَلَاةٍ كَتَطَوُّعِ صَلَاةِ سَبْعِينَ لَيْلَةً فِيمَا سِوَاهُ مِنَ الشُّهُورِ",
          "وَ جَعَلَ لِمَنْ تَطَوَّعَ فِيهِ بِخَصْلَةٍ مِنْ خِصَالِ الْخَيْرِ وَ الْبِرِّ كَأَجْرِ مَنْ أَدَّى فَرِيضَةً مِنْ فَرَائِضِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ أَدَّى فِيهِ فَرِيضَةً مِنْ فَرَائِضِ اللَّهِ كَانَ كَمَنْ أَدَّى سَبْعِينَ فَرِيضَةً مِنْ فَرَائِضِ اللَّهِ فِيمَا سِوَاهُ مِنَ الشُّهُورِ",
          "وَ هُوَ شَهْرُ الصَّبْرِ وَ إِنَّ الصَّبْرَ ثَوَابُهُ الْجَنَّةُ وَ شَهْرُ الْمُوَاسَاةِ وَ هُوَ شَهْرٌ يَزِيدُ اللَّهُ فِي رِزْقِ الْمُؤْمِنِ فِيهِ وَ مَنْ فَطَّرَ فِيهِ مُؤْمِناً صَائِماً كَانَ لَهُ بِذَلِكَ عِنْدَ اللَّهِ عِتْقُ رَقَبَةٍ وَ مَغْفِرَةٌ لِذُنُوبِهِ فِيمَا مَضَى",
          "قِيلَ يَا رَسُولَ اللَّهِ لَيْسَ كُلُّنَا يَقْدِرُ عَلَى أَنْ يُفَطِّرَ صَائِماً فَقَالَ إِنَّ اللَّهَ كَرِيمٌ يُعْطِي هَذَا الثَّوَابَ لِمَنْ لَمْ يَقْدِرْ إِلَّا عَلَى مَذْقَةٍ مِنْ لَبَنٍ يُفَطِّرُ بِهَا صَائِماً أَوْ شَرْبَةٍ مِنْ مَاءٍ عَذْبٍ أَوْ تَمَرَاتٍ لَا يَقْدِرُ عَلَى أَكْثَرَ مِنْ ذَلِكَ وَ مَنْ خَفَّفَ فِيهِ عَنْ مَمْلُوكِهِ خَفَّفَ اللَّهُ عَنْهُ حِسَابَهُ",
          "وَ هُوَ شَهْرٌ أَوَّلُهُ رَحْمَةٌ وَ أَوْسَطُهُ مَغْفِرَةٌ وَ آخِرُهُ الْإِجَابَةُ وَ الْعِتْقُ مِنَ النَّارِ وَ لَا غِنَى بِكُمْ عَنْ أَرْبَعِ خِصَالٍ خَصْلَتَيْنِ تُرْضُونَ اللَّهَ بِهِمَا وَ خَصْلَتَيْنِ لَا غِنَى بِكُمْ عَنْهُمَا فَأَمَّا اللَّتَانِ تُرْضُونَ اللَّهَ عَزَّ وَ جَلَّ بِهِمَا فَشَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ وَ أَمَّا اللَّتَانِ لَا غِنَى بِكُمْ عَنْهُمَا فَتَسْأَلُونَ اللَّهَ فِيهِ حَوَائِجَكُمْ وَ الْجَنَّةَ وَ تَسْأَلُونَ الْعَافِيَةَ وَ تَعُوذُونَ بِهِ مِنَ النَّارِ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, and someone else, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Abu Ayoub from Abu Al Ward, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> preached the people during the last Friday of Sha’ban. So he<sup>saww</sup> Praised Allah<sup>azwj</sup> and Extolled upon Him<sup>azwj</sup>, then said: ‘O you people! There has come upon you a Month wherein is a night better than a thousand months, and it is the Month of Ramazan. Allah<sup>azwj</sup> has Obligated its Fasts and Made the standing at night (for Praying) in it with voluntary Prayers like the voluntary Prayers of seventy nights in what is besides from the months.",
            "And Made for the one who voluntarily does in it, a quality from the qualities of the goodness and the righteousness, would have a Recompense like the one who fulfilled an Obligation from the Obligations of Allah<sup>azwj</sup> Mighty and Majestic; and the one who fulfils therein an Obligation from the Obligations of Allah<sup>azwj</sup> would be like the one who fulfilled seventy Obligation from the Obligations of Allah<sup>azwj</sup> in what is besides from the months. ",
            "And it is the Month of patience, and the patience, its Reward is the Paradise; and it is a Month of sympathy, and it is a Month in which Allah<sup>azwj</sup> Increases the sustenance of the Believers. And the one who provides for breaking the Fast of a Believer therein, would have for him, due to that, in the Presence of Allah<sup>azwj</sup>, (Rewards of the) emancipation of a neck and Forgiveness regarding what is past’. ",
            "It was said, ‘O Rasool-Allah<sup>saww</sup>! All of us are not able upon providing the breaking of the Fast of a Fasting-one’. So he<sup>saww</sup> said: ‘Allah<sup>azwj</sup> is Benevolent. He<sup>azwj</sup> would Give this Reward for the one who is not able, upon the diluted milk to break the Fast of a Believer with it, or a drink of fresh water, or dates, if he is not able upon more than that. And the one who lightens therein (the tasks) of his owned slaves, Allah<sup>azwj</sup> would Lighten His<sup>azwj</sup> Reckoning from him.",
            "And it is such a Month, the beginning of it is Mercy, and its middle is Forgiveness, and its end is the Answering (of supplication), and the liberation (emancipation) from the Fire.  And four characteristics should not be needless with you. Two characteristics you would be Pleasing Allah<sup>azwj</sup> with them, and two characteristics you should not be needless from them. So as for those two which you would be Pleasing Allah<sup>azwj</sup> Mighty and Majestic with them, so it is the testimony that there is no god except for Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>; and as for those two which you should not be needless from, so it is your asking Allah<sup>azwj</sup> for your needs therein, and the Paradise, and you should be asking for ‘الْعَافِيَةَ’ the good health (and peace of mind), and seeking Refuge by it from the Fire’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya and people other than him have narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub, from abu Ayyub from abu al-Ward, who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘Once, the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, delivered a speech on the last Friday of the month of Sha‘ban. He thanked Allah, praised Him, and then said, “O people, a month is upon you when there is a night that is better than one thousand months. That month is the month of Ramadan. Allah has made fasting obligatory in the month of Ramadan. He has made one night in it wherein performing optional salat (prayer) is equal in reward to seventy nights of performing salat (prayer) in other months. For performing one good and virtuous deed voluntarily in it, He has assigned a reward equal to that for fulfilling an obligation toward Allah, the Most Majestic, the Most Glorious. For fulfilling an obligation toward Allah in this month, He has assigned a reward equal to that for fulfilling seventy obligations toward Allah in other months. It is the month of patience, and the reward for patience is Paradise. It is the month of cooperation. In this month, Allah increases the sustenance of the believing people. If one serves food for a fasting person at the end of a fasting day, Allah counts it equal in reward to setting free a slave and forgiveness of his sins of the past.” It was said, “O Messenger of Allah, not every one of us is able to serve food to a fasting person at the end of a fasting day.” The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, “Allah is gracious, He grants such reward even for serving some milk mixed with water or some sweet water or a few pieces of dates, if he is unable to do more than this. For one’s easing off the tasks for His servants to perform, Allah eases off his accountabilities. The beginning of this month is mercy and kindness, its middle is forgiveness, and its end is acceptance and freedom from the fire. You must have four characteristics during this month. With two of these characteristics, you will please Allah, but without the other two, you cannot have anything. The two with which you will please Allah is your testimony. ‘No one deserves worship besides Allah, and Muhammad is the Messenger of Allah.’ The other two are asking Him to meet your needs and for Paradise, and asking Him to grant you good health and protection against hell fire.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/208)"
        ],
        "index": 6238,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "فَضَالَةَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/27",
              "text": "سَيْفِ بْنِ عَمِيرَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2902",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/134",
              "text": "رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:2:5",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَمَّا حَضَرَ شَهْرُ رَمَضَانَ وَ ذَلِكَ فِي ثَلَاثٍ بَقِينَ مِنْ شَعْبَانَ قَالَ لِبِلَالٍ نَادِ فِي النَّاسِ فَجَمَعَ النَّاسَ ثُمَّ صَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ أَيُّهَا النَّاسُ إِنَّ هَذَا الشَّهْرَ قَدْ خَصَّكُمُ اللَّهُ بِهِ وَ حَضَرَكُمْ وَ هُوَ سَيِّدُ الشُّهُورِ ",
          "لَيْلَةٌ فِيهِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ تُغْلَقُ فِيهِ أَبْوَابُ النَّارِ وَ تُفَتَّحُ فِيهِ أَبْوَابُ الْجِنَانِ فَمَنْ أَدْرَكَهُ وَ لَمْ يُغْفَرْ لَهُ فَأَبْعَدَهُ اللَّهُ وَ مَنْ أَدْرَكَ وَالِدَيْهِ وَ لَمْ يُغْفَرْ لَهُ فَأَبْعَدَهُ اللَّهُ وَ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ فَلَمْ يَغْفِرِ اللَّهُ لَهُ فَأَبْعَدَهُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Sayf Bin Ameyra, from Abdullah Bin Abdullah, from a man, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said, when the Month of Ramazan presented itself, and that was when there remained three days from Sha’ban, said to Bilal: ‘Call out among the people’. So the people gathered. Then he<sup>saww</sup> ascended the Pulpit, so he<sup>saww</sup> Praised Allah<sup>azwj</sup> and Extolled upon Him<sup>azwj</sup>, then said: ‘O you people! This is the Month which Allah<sup>azwj</sup> has Chosen you all with, and it is presenting itself, and it is the chief of the months. ",
            "There is a night therein better than a thousand months, in which the doors of the Fire are locked, and in which the doors of the Gardens are opened up. So the one who realises it, and there is no Forgiveness for him, so Allah<sup>azwj</sup> has Made him to be remote; and the one has his parents, and there is no Forgiveness for him, so Allah<sup>azwj</sup> has Made him to be remote; and the one in whose presence I<sup>saww</sup> am mentioned and he does not send Blessing upon me<sup>saww</sup>, so Allah<sup>azwj</sup> will not Forgive him, and Allah<sup>azwj</sup> Makes him to be remote’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad, from al-Husayn ibn Sa‘id from, Fadalah ibn Ayyub from Sayf ibn ‘Ami rah from ‘ Abd Allah ibn ‘ Abd Allah from a man who has said the following: ”Abu Ja’far, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, once, just three days before the month of Ramadan, said to Bilal, ‘Call people (to come to the Masjid).’ People then gathered, and he climbed on the pulpit, thanked Allah, praised Him, and then said, “O people, Allah has granted you a privilege with this month. He has made it especially for you, and it is about to be upon you. There is one night in it that is better than one thousand months. The doors of hell fire remain closed in this month, and the doors of Paradise are open. If one’s sins remain without being forgiven in this month, Allah keeps him away. One who lives with his parents, but is not forgiven, Allah keeps him away; and one before whom I am mentioned but who does not say salawat (O Allah, grant compensation to Muhammad and his family worthy of their services to your cause) and is not forgiven, Allah keeps him away.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/209)"
        ],
        "index": 6239,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1485",
              "text": "الْحُسَيْنِ بْنِ عُلْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/203",
              "text": "عَمْرِو بْنِ شِمْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/181",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْحُسَيْنِ بْنِ عُلْوَانَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:2:6",
        "text": [
          " كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُقْبِلُ بِوَجْهِهِ إِلَى النَّاسِ فَيَقُولُ يَا مَعْشَرَ النَّاسِ إِذَا طَلَعَ هِلَالُ شَهْرِ رَمَضَانَ غُلَّتْ مَرَدَةُ الشَّيَاطِينِ وَ فُتِحَتْ أَبْوَابُ السَّمَاءِ وَ أَبْوَابُ الْجِنَانِ وَ أَبْوَابُ الرَّحْمَةِ وَ غُلِّقَتْ أَبْوَابُ النَّارِ وَ اسْتُجِيبَ الدُّعَاءُ",
          "وَ كَانَ لِلَّهِ فِيهِ عِنْدَ كُلِّ فِطْرٍ عُتَقَاءُ يُعْتِقُهُمُ اللَّهُ مِنَ النَّارِ وَ يُنَادِي مُنَادٍ كُلَّ لَيْلَةٍ هَلْ مِنْ سَائِلٍ هَلْ مِنْ مُسْتَغْفِرٍ اللَّهُمَّ أَعْطِ كُلَّ مُنْفِقٍ خَلَفاً وَ أَعْطِ كُلَّ مُمْسِكٍ تَلَفاً حَتَّى إِذَا طَلَعَ هِلَالُ شَوَّالٍ نُودِيَ الْمُؤْمِنُونَ أَنِ اغْدُوا إِلَى جَوَائِزِكُمْ فَهُوَ يَوْمُ الْجَائِزَةِ ",
          "ثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) أَمَا وَ الَّذِي نَفْسِي بِيَدِهِ مَا هِيَ بِجَائِزَةِ الدَّنَانِيرِ وَ لَا الدَّرَاهِمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Husayn Bin Ulwam, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> used to turn by his<sup>saww</sup> face towards the people and he<sup>saww</sup> was saying: ‘O group of people! When the crescent of the Month of Ramazan emerges, the apostate devils are chained up, and the Doors of the sky are opened, and the Doors of the Gardens, and the Doors of the Mercy, and the Doors of the Fire are closed, and the supplication is Answered.",
            "And in it, there is emancipation (libration) during each Fast. Allah<sup>azwj</sup> Emancipates (liberates) them from the Fire, and a Caller Calls out during each night: ‘Is there one who would ask? Is there one who seeks Forgiveness? O Allah<sup>azwj</sup>! Give Replacement to every spender, and Give Ruination to every hoarder’, until the crescent of Shawwal emerges, he Calls out to the Believers: ‘Come to your Recompenses, for it is the day of Recompense!’ ",
            "Then Abu Ja’far<sup>asws</sup> said: ‘But, by the One<sup>azwj</sup> in Whose Hand is my<sup>asws</sup> soul, it is not a Recompensing with the Dinars, nor with Dirhams’."
          ],
          "en.sarwar": [
            "6. Ahmad ibn Muhammad has narrated from ai-Husayn ibn Sa‘id from af-Husayn ibn ‘Uiwan from ‘Amr ibn Shamir from Jabir who has said the folio wing: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would turn his face to people and say, “O people, when the crescent for the month of Ramadan appears, the devils of Satan are put in chains. The doors to the heavens, Paradise and mercy are opened. The doors to hellfire are closed and prayers are accepted. Allah on every first day after the month of Ramadan sets many people free from hellfire. Every night someone calls, ‘Is there anyone who asks for help or forgiveness? O Allah, grant good rewards to those, who give charity. Make those who do not give any charity to lose.’ It continues until the month of Shawwal begins, then the believers are called, ‘Come for your presents; it is the day of receiving rewards.’” Abu Ja‘far, ‘Alayhi al-Salam, then said, ‘I swear by the One in whose hands is my life, such presents are not dirhams and dinars.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/210)"
        ],
        "index": 6240,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/155",
              "text": "جَمِيلِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/547",
              "text": "مُحَمَّدِ بْنِ مَرْوَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:2:7",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ لِلَّهِ عَزَّ وَ جَلَّ فِي كُلِّ لَيْلَةٍ مِنْ شَهْرِ رَمَضَانَ عُتَقَاءَ وَ طُلَقَاءَ مِنَ النَّارِ إِلَّا مَنْ أَفْطَرَ عَلَى مُسْكِرٍ فَإِذَا كَانَ فِي آخِرِ لَيْلَةٍ مِنْهُ أَعْتَقَ فِيهَا مِثْلَ مَا أَعْتَقَ فِي جَمِيعِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Salih, from Muhammad Bin Marwan who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic Liberates during every night of the Month of Ramazan with a Freeing, except for the one who breaks Fast upon an intoxicant. So when it is during the last night from it, He<sup>azwj</sup> Liberates in it the like of what He<sup>azwj</sup> had Liberated during the whole of it’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil ibn Salih from Muhammad ibn Marwan who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘Every night in the month of Ramadan, Allah, most Majestic, most Glorious, liberates many people and releases them from hellfire, except those who drink intoxicating liquor. During the last night of this month, Allah frees and releases a number of people equal to all that He had freed during the whole month.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:2",
  "kind": "verse_list"
}