{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:4:2:45",
        "titles": {
          "ar": "بَابُ صَوْمِ الصِّبْيَانِ وَ مَتَى يُؤْخَذُونَ بِهِ",
          "en": "Chapter 45 – The Fasting of the children and when they can be asked with it"
        }
      }
    ],
    "index": 905,
    "local_index": 45,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:45",
    "titles": {
      "ar": "بَابُ صَوْمِ الصِّبْيَانِ وَ مَتَى يُؤْخَذُونَ بِهِ",
      "en": "Chapter 45 – The Fasting of the children and when they can be asked with it"
    },
    "verse_count": 4,
    "verse_start_index": 6450,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/322)"
        ],
        "index": 6451,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:45:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّا نَأْمُرُ صِبْيَانَنَا بِالصِّيَامِ إِذَا كَانُوا بَنِي سَبْعِ سِنِينَ بِمَا أَطَاقُوا مِنْ صِيَامِ الْيَوْمِ فَإِنْ كَانَ إِلَى نِصْفِ النَّهَارِ وَ أَكْثَرَ مِنْ ذَلِكَ أَوْ أَقَلَّ فَإِذَا غَلَبَهُمُ الْعَطَشُ وَ الْغَرَثُ أَفْطَرُوا حَتَّى يَتَعَوَّدُوا الصَّوْمَ وَ يُطِيقُوهُ فَمُرُوا صِبْيَانَكُمْ إِذَا كَانُوا أَبْنَاءَ تِسْعِ سِنِينَ بِمَا أَطَاقُوا مِنْ صِيَامٍ فَإِذَا غَلَبَهُمُ الْعَطَشُ أَفْطَرُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘We<sup>asws</sup> order our<sup>asws</sup> children with the Fasting when a boy is of seven years with whatever they can endure from a Fast of the day. So if it was half the day and more than that, or less, and upon them is thirst and the hunger, they break, so they get used to the Fasting and they can endure it. So instruct your children, when they were sons of nine years, with whatever they can endure from the Fasting. So if the thirst was to overcome them, they break’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father [from ibn abu ‘ Umayr] from Hammad from al-Halabiy who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘We command our children, when they are seven years old, to fast as long as they can. In midday or more if thirst increases, they stop fasting so they develop endurance. You should command your children to fast, when they are nine years old, for as long as they can fast. When thirst increases they can stop fasting.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/322)"
        ],
        "index": 6452,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:45:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فِي كَمْ يُؤْخَذُ الصَّبِيُّ بِالصِّيَامِ قَالَ مَا بَيْنَهُ وَ بَيْنَ خَمْسَ عَشْرَةَ سَنَةً وَ أَرْبَعَ عَشْرَةَ سَنَةً فَإِنْ هُوَ صَامَ قَبْلَ ذَلِكَ فَدَعْهُ وَ لَقَدْ صَامَ ابْنِي فُلَانٌ قَبْلَ ذَلِكَ فَتَرَكْتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayou, from Muawiya Bin Wahab who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> regarding at what age the children can be asked with the Fasts. He<sup>asws</sup> said: ‘What is between him and fifteen years, and fourteen years of age. So if he was to Fast before that, so let him. My<sup>asws</sup> so and so son Fasted before that, so I let him do it’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa’id from Fadalah ibn Ayyub from Mu‘awiyah ibn Wahab who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of children when they are required to fast. He (the Imam) said, ‘They must fast when they are fifteen and fourteen years old. If they fast before this then allow them to do so. My son, so and so fasted before such time and I allowed him to do so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/323)"
        ],
        "index": 6453,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:45:3",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ الصَّبِيِّ مَتَى يَصُومُ قَالَ إِذَا قَوِيَ عَلَى الصِّيَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, ",
            "‘I asked him<sup>asws</sup> about the child, when can he Fast?’ He<sup>asws</sup> said: ‘When he is strong upon the Fasting’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn Muhammad from has narrated from ‘Uthman ibn ‘Isa from Sama‘ah, who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a child when he is required to fast. He (the Imam) said, ‘When he is able to fast he must fast.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/323)"
        ],
        "index": 6454,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:45:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَطَاقَ الْغُلَامُ صِيَامَ ثَلَاثَةِ أَيَّامٍ مُتَتَابِعَةٍ فَقَدْ وَجَبَ عَلَيْهِ صِيَامُ شَهْرِ رَمَضَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the boy is able to endure the Fasts of three days consecutively, so the Fasts of the Month of Ramazan are Obligated upon him’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When a boy is able to fast for three days continuously it is obligatory on him to fast in the month of Ramadan.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:45",
  "kind": "verse_list"
}