{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 51"
        },
        "path": "/books/al-kafi:4:2:51",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ صَوْمِ التَّطَوُّعِ</span> فِي السَّفَرِ وَ تَقْدِيمِهِ وَ قَضَائِهِ",
          "en": "Chapter 51 – The optional Fast during the journey, and its bring forward, and its making up"
        }
      }
    ],
    "index": 911,
    "local_index": 51,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 52"
        },
        "path": "/books/al-kafi:4:2:52",
        "titles": {
          "ar": "بَابُ الرَّجُلِ يُرِيدُ السَّفَرَ أَوْ يَقْدَمُ مِنْ سَفَرٍ فِي شَهْرِ رَمَضَانَ",
          "en": "Chapter 52 – The man intends the travel, or he comes back from a journey during a Month of Ramazan"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 50"
        },
        "path": "/books/al-kafi:4:2:50",
        "titles": {
          "ar": "بَابُ مَنْ لَا يَجِبُ لَهُ الْإِفْطَارُ وَ التَّقْصِيرُ فِي السَّفَرِ وَ مَنْ يَجِبُ لَهُ ذَلِكَ",
          "en": "Chapter 50 – The one for whom the breaking (of the Fast) and the shortening (of the Prayer is not Obligated, and the one for whom that is Obligated"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:51",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ صَوْمِ التَّطَوُّعِ</span> فِي السَّفَرِ وَ تَقْدِيمِهِ وَ قَضَائِهِ",
      "en": "Chapter 51 – The optional Fast during the journey, and its bring forward, and its making up"
    },
    "verse_count": 5,
    "verse_start_index": 6476,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/332)"
        ],
        "index": 6477,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1096",
              "text": "مَنْصُورِ بْنِ الْعَبَّاسِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2950",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ وَاسِعٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1150",
              "text": "إِسْمَاعِيلَ بْنِ سَهْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/134",
              "text": "رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مَنْصُورِ بْنِ الْعَبَّاسِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ وَاسِعٍ عَنْ إِسْمَاعِيلَ بْنِ سَهْلٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:51:1",
        "text": [
          " خَرَجَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مِنَ الْمَدِينَةِ فِي أَيَّامٍ بَقِينَ مِنْ شَعْبَانَ فَكَانَ يَصُومُ ثُمَّ دَخَلَ عَلَيْهِ شَهْرُ رَمَضَانَ وَ هُوَ فِي السَّفَرِ فَأَفْطَرَ فَقِيلَ لَهُ تَصُومُ شَعْبَانَ وَ تُفْطِرُ شَهْرَ رَمَضَانَ فَقَالَ نَعَمْ شَعْبَانُ إِلَيَّ إِنْ شِئْتُ صُمْتُ وَ إِنْ شِئْتُ لَا وَ شَهْرُ رَمَضَانَ عَزْمٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ عَلَيَّ الْإِفْطَارُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Mansour Bin Al Abbas, from Muhammad Bin Abdullah Bin Wasi’a, from Ismail Bin Sahl, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abu Abdullah<sup>asws</sup> went out from Al-Medina during a few remaining days from Shaban, so he<sup>asws</sup> was Fasting. Then the Month of Ramazan entered upon him<sup>asws</sup> and he<sup>asws</sup> was in a journey. So it was said to him<sup>asws</sup>, ‘You<sup>asws</sup> are Fasting Shaban and are breaking (not Fasting) the Month of Ramazan?’ So he<sup>asws</sup> said: ‘Yes. Shabaan to me<sup>asws</sup>, if I<sup>asws</sup> so desire to I<sup>asws</sup> Fast, and if I<sup>asws</sup> so desire to I<sup>asws</sup> don’t; and the Month of Ramazan is a fixed Determination from Allah<sup>azwj</sup> Mighty and Majestic upon me<sup>asws</sup> for the breaking (during a journey)’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Mansur ibn al-‘Abbas from Muhammad ibn ‘Abd Allah ibn Wash from ‘Isma‘il ibn Sahl from a man who has said the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, commenced a journey just a few days before the end of the month of al-Sha‘ban and he (the Imam) was fasting. The month of Ramadan then started while he (the Imam) was still on his journey but he stopped fasting. He (the Imam) was asked, ‘How is it that you have been fasting in the month of al-Sha‘ban and stopped fasting in the month of Ramadan?’ He (the Imam) said, ‘In the case of the month of al-Sha‘ban it is up to me to fast or not to fast: however, in the case of the month of Ramadan it is the commandment of Allah, most Majestic, most Glorious, to stop fasting (on a journey).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/332)"
        ],
        "index": 6478,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/638",
              "text": "أَحْمَدَ بْنِ هِلَالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/11",
              "text": "عَمْرِو بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2951",
              "text": "عُذَافِرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ هِلَالٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ عُذَافِرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:51:2",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَصُومُ هَذِهِ الثَّلَاثَةَ الْأَيَّامِ فِي الشَّهْرِ فَرُبَّمَا سَافَرْتُ وَ رُبَّمَا أَصَابَتْنِي عِلَّةٌ فَيَجِبُ عَلَيَّ قَضَاؤُهَا قَالَ فَقَالَ لِي إِنَّمَا يَجِبُ الْفَرْضُ فَأَمَّا غَيْرُ الْفَرْضِ فَأَنْتَ فِيهِ بِالْخِيَارِ قُلْتُ بِالْخِيَارِ فِي السَّفَرِ وَ الْمَرَضِ قَالَ فَقَالَ الْمَرَضُ قَدْ وَضَعَهُ اللَّهُ عَزَّ وَ جَلَّ عَنْكَ وَ السَّفَرُ إِنْ شِئْتَ فَاقْضِهِ وَ إِنْ لَمْ تَقْضِهِ فَلَا جُنَاحَ عَلَيْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Hilal, from Amro Bin Usman, from Uzafir who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I tend to Fast these three days during the month. So, sometimes I travel, and sometimes an illness hits me. Does it Obligate the making up for it upon me?’ So he<sup>asws</sup> said to me: ‘But rather, the Obligatory (Fasts) necessitate it. But, as for the other than the Obligatory (Fasts), so you are with the choice in it’. I said, ‘With the choice during the journey and the illness?’ So he<sup>asws</sup> said: ‘The illness, so Allah<sup>azwj</sup> has Exempted it from you, and the journey, if you so desire to, so make up for it, and if you don’t make up for it, so there is no blame upon you’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ahmad ibn Hilal from ‘Amr ibn ‘Uthman from ‘Adhafir who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that I fast these three days of the month but perhaps I travel or become ill, am I required to complete its Qada’ (compensatory fast)? He (the Imam) said, ‘Qada’ (compensatory fast) is obligatory for obligatory fast which is missed. In the case of optional fast it is up to you.’ I then asked, ‘Is it up to one’s choice even when on a journey and in illness?’ He (the Imam) said, ‘In the case of illness Allah, most Majestic, most Glorious, has exempted you, but in the case of journey you can complete its Qada’ (compensatory fast) and if you did not do so it is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/332)"
        ],
        "index": 6479,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/129",
              "text": "مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2785",
              "text": "سَعْدِ بْنِ سَعْدٍ الْأَشْعَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/90",
              "text": "أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ سَعْدِ بْنِ سَعْدٍ الْأَشْعَرِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:51:3",
        "text": [
          " سَأَلْتُهُ عَنْ صَوْمِ ثَلَاثَةِ أَيَّامٍ فِي الشَّهْرِ هَلْ فِيهِ قَضَاءٌ عَلَى الْمُسَافِرِ قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Sa’ad Bin Sa’ad Al Ashary, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about Fasting the three days during the month, is there a making up for it upon the traveler?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from Sa‘d ibn Sa‘d al-Ash’ariy who has said the following: “I once asked al-Rida’, ‘Alayhi al-Salam, about the case of the three days’ fasting every month, if Qada’ (compensatory fast) is required from a traveler. He (the Imam) said, ‘No, he is not required to fast.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/333)"
        ],
        "index": 6480,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2952",
              "text": "الْمَرْزُبَانِ بْنِ عِمْرَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْمَرْزُبَانِ بْنِ عِمْرَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:51:4",
        "text": [
          " قُلْتُ لِلرِّضَا ( عليه السلام ) أُرِيدُ السَّفَرَ فَأَصُومُ لِشَهْرِيَ الَّذِي أُسَافِرُ فِيهِ قَالَ لَا قُلْتُ فَإِذَا قَدِمْتُ أَقْضِيهِ قَالَ لَا كَمَا لَا تَصُومُ كَذَلِكَ لَا تَقْضِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Marzaban Bin Imran who said, ",
            "‘I said to Al-Reza<sup>asws</sup>, ‘I intend the travel, so can I Fast in my month in which I travel?’ He<sup>asws</sup> said: ‘No’. I said, ‘So when I return, do I have to make up for it?’ He<sup>asws</sup> said: ‘No, just as you did not Fast, similar to that, you do not make up for it’."
          ],
          "en.sarwar": [
            "4. Ahmad ibn Muhammad has narrated from al-Marzuban ibn ‘Imran who has said the following: “I once asked al-Rida’, ‘Alayhi al-Salam, that I like to travel; can I fast in the month in which I am on a journey? He (the Imam) said, ‘No, you cannot do so.’ ‘Can I complete its Qada’ (compensatory fast) when I come home?’ I asked. He (the Imam) said, ‘No, just as you cannot fast in the same way you cannot carry out its Qada’ (compensatory fast).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/333)"
        ],
        "index": 6481,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2476",
              "text": "عَلِيِّ بْنِ بِلَالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2953",
              "text": "الْحَسَنِ بْنِ بَسَّامٍ الْجَمَّالِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/134",
              "text": "رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ بِلَالٍ عَنِ الْحَسَنِ بْنِ بَسَّامٍ الْجَمَّالِ عَنْ رَجُلٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:51:5",
        "text": [
          " كُنْتُ مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِيمَا بَيْنَ مَكَّةَ وَ الْمَدِينَةِ فِي شَعْبَانَ وَ هُوَ صَائِمٌ ثُمَّ رَأَيْنَا هِلَالَ شَهْرِ رَمَضَانَ فَأَفْطَرَ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ أَمْسِ كَانَ عَنْ شَعْبَانَ وَ أَنْتَ صَائِمٌ وَ الْيَوْمُ مِنْ شَهْرِ رَمَضَانَ وَ أَنْتَ مُفْطِرٌ فَقَالَ إِنَّ ذَاكَ تَطَوُّعٌ وَ لَنَا أَنْ نَفْعَلَ مَا شِئْنَا وَ هَذَا فَرْضٌ فَلَيْسَ لَنَا أَنْ نَفْعَلَ إِلَّا مَا أُمِرْنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Bilal, from Al Hassan Bin Bassam Al Jammal, from a man who said, ",
            "‘I was with Abu Abdullah<sup>asws</sup> in what is between Makkah and Al-Medina, and he was Fasting. Then we saw the crescent of the Month of Ramazan, so he<sup>asws</sup> broke. So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Yesterday was from Shaban and you<sup>asws</sup> were Fasting, and today is from the Month of Ramazan and you are not Fasting?’ So he<sup>asws</sup> said: ‘That was voluntary (Fast), and for us<sup>asws</sup> is that we<sup>asws</sup> do what we<sup>asws</sup> so desire to, and this is an Obligation, so it is not for us<sup>asws</sup> that we<sup>asws</sup> do except for what we<sup>asws</sup> have been Commanded for’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Bilal from al-Hassan ibn Bassam al-Jammal from a man who has said the following: “I once was with abu ‘Abd Allah, ‘Alayhi al-Salam, between Makkah and al-Madinah in the month of al-Sha‘ban and he (the Imam) was fasting; then we saw the crescent of the month of Ramadan and he (the Imam) stopped fasting. I then said, ‘I pray to Allah to keep my soul in service for your cause, yesterday was of the month of al-Sha‘ban and you were fasting, but today is of the month of Ramadan and you are not fasting. He (the Imam) said, ‘That was optional and it is up to us to do what we want, but this is obligatory and we have no choice but to do what we are commanded to do.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:51",
  "kind": "verse_list"
}