{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:4:2", "titles": {"ar": "كِتَابُ الصِّيَامِ", "en": "THE BOOK OF FASTS (1)"}}, {"indexed_titles": {"en": "Chapter 55"}, "path": "/books/al-kafi:4:2:55", "titles": {"ar": "بَابُ صَوْمِ الْحَائِضِ وَ الْمُسْتَحَاضَةِ", "en": "Chapter 55 - The Fasting of the menstruating and the post-menstruation bleeding woman"}}], "index": 915, "local_index": 55, "part_type": "Chapter", "path": "/books/al-kafi:4:2:55", "titles": {"ar": "بَابُ صَوْمِ الْحَائِضِ وَ الْمُسْتَحَاضَةِ", "en": "Chapter 55 - The Fasting of the menstruating and the post-menstruation bleeding woman"}, "verse_count": 11, "verse_start_index": 6498, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6499, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ رَاشِدٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْحَائِضُ تَقْضِي الصَّوْمَ قَالَ نَعَمْ قُلْتُ تَقْضِي الصَّلَاةَ قَالَ لَا قُلْتُ مِنْ أَيْنَ جَاءَ هَذَا قَالَ أَوَّلُ مَنْ قَاسَ إِبْلِيسُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Hassan Bin Rashid who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘The menstruating woman would make up for the (missed) Fast?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘She would make up for the (missed) Prayer?’ He<sup>asws</sup> said: No. ‘I said, ‘Where does this come from?’ He<sup>asws</sup> said: ‘The first one to analogise was Iblees<sup>la</sup>’."]}}, {"index": 6500, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ امْرَأَةٍ أَصْبَحَتْ صَائِمَةً فَلَمَّا ارْتَفَعَ النَّهَارُ أَوْ كَانَ الْعَشِيُّ حَاضَتْ أَ تُفْطِرُ قَالَ نَعَمْ وَ إِنْ كَانَ وَقْتُ الْمَغْرِبِ فَلْتُفْطِرْ ", "قَالَ وَ سَأَلْتُهُ عَنِ امْرَأَةٍ رَأَتِ الطُّهْرَ فِي أَوَّلِ النَّهَارِ مِنْ شَهْرِ رَمَضَانَ فَتَغْتَسِلُ وَ لَمْ تَطْعَمْ فَمَا تَصْنَعُ فِي ذَلِكَ الْيَوْمِ قَالَ تُفْطِرُ ذَلِكَ الْيَوْمَ فَإِنَّمَا فِطْرُهَا مِنَ الدَّمِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a woman who woke up Fasting in the morning. So when the day rose, or it was the evening, she menstruated. Would she break?’ He<sup>asws</sup> said: ‘Yes, and even if it was the time of <span class=\"iTxt\">Al-Magrib</span>, so let her break’. ", "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a woman who saw the purity at the beginning of the day from a Month of Ramazan, so she bathed and did not eat. So what should she do during that day?’ He<sup>asws</sup> said: ‘She would break (the Fast of) that day. So rather, her breaking is from the blood’."]}}, {"index": 6501, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:3", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ امْرَأَةٍ تَطْمَثُ فِي شَهْرِ رَمَضَانَ قَبْلَ أَنْ تَغِيبَ الشَّمْسُ قَالَ تُفْطِرُ حِينَ تَطْمَثُ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ays Bin Al Qasim who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a woman who menstruated during a Month of Ramazan before the disappearance of the sun. He<sup>asws</sup> said: ‘She would break when she menstruated’."]}}, {"index": 6502, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:4", "text": ["صَفْوَانُ بْنُ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْمَرْأَةِ تَلِدُ بَعْدَ الْعَصْرِ أَ تُتِمُّ ذَلِكَ الْيَوْمَ أَمْ تُفْطِرُ قَالَ تُفْطِرُ وَ تَقْضِي ذَلِكَ الْيَوْمَ ."], "translations": {"en.hubeali": ["Safwan Bin Yahya, from Abdul Rahman Bin Al Hajjaj who said, ", "‘I asked Abu Al-Hassan<sup>asws</sup> about the woman who gives birth after <span class=\"iTxt\">Al-Asr</span>, would she complete (the Fast of) that day or break?’ He<sup>asws</sup> said: ‘She would break, and she would make up for that day’."]}}, {"index": 6503, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:5", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمُسْتَحَاضَةِ قَالَ فَقَالَ تَصُومُ شَهْرَ رَمَضَانَ إِلَّا الْأَيَّامَ الَّتِي كَانَتْ تَحِيضُ فِيهِنَّ ثُمَّ تَقْضِيهَا بَعْدَهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Sama’at Bin Mihran who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the post-menstrual bleeding woman. So he<sup>asws</sup> said: ‘She would be Fasting the Month of Ramazan except for the days which she menstruated in, she would make up for these after it’."]}}, {"index": 6504, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:6", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ كَتَبْتُ إِلَيْهِ ( عليه السلام ) امْرَأَةٌ طَهُرَتْ مِنْ حَيْضِهَا أَوْ مِنْ دَمِ نِفَاسِهَا فِي أَوَّلِ يَوْمٍ مِنْ شَهْرِ رَمَضَانَ ثُمَّ اسْتَحَاضَتْ فَصَلَّتْ وَ صَامَتْ شَهْرَ رَمَضَانَ كُلَّهُ مِنْ غَيْرِ أَنْ تَعْمَلَ مَا تَعْمَلُ الْمُسْتَحَاضَةُ مِنَ الْغُسْلِ لِكُلِّ صَلَاتَيْنِ فَهَلْ يَجُوزُ صَوْمُهَا وَ صَلَاتُهَا أَمْ لَا فَكَتَبَ ( عليه السلام ) تَقْضِي صَوْمَهَا وَ لَا تَقْضِي صَلَاتَهَا."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ali Bin Mahiyar who said, ", "‘I wrote to him<sup>asws</sup>, ‘A woman was clean from her menstruation, or from the blood of her post-childbirth during the beginning of the day from a Month of Ramazan. Then she has post-menstrual bleeding, so she Prays and Fasts a Month of Ramazan, all of it from without doing what the post-menstrual bleeding woman tends to do from the bathing for every Prayer. So, is her Fasting and her Prayer allowed or not?’ So he<sup>asws</sup> wrote: ‘She would make up for her Fasts and would not make up for her Prayer."]}}, {"index": 6505, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي امْرَأَةٍ أَصْبَحَتْ صَائِمَةً فَلَمَّا ارْتَفَعَ النَّهَارُ أَوْ كَانَ الْعَشِيُّ حَاضَتْ أَ تُفْطِرُ قَالَ نَعَمْ وَ إِنْ كَانَ قَبْلَ الْمَغْرِبِ فَلْتُفْطِرْ ", "وَ عَنِ امْرَأَةٍ تَرَى الطُّهْرَ مِنْ أَوَّلِ النَّهَارِ فِي شَهْرِ رَمَضَانَ لَمْ تَغْتَسِلْ وَ لَمْ تَطْعَمْ كَيْفَ تَصْنَعُ بِذَلِكَ الْيَوْمِ قَالَ إِنَّمَا فِطْرُهَا مِنَ الدَّمِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a woman who woke up in the morning Fasting. So when the day rose, or it was the evening, she menstruated. Would she break?’ He<sup>asws</sup> said: ‘Yes, and even if it was (just) before <span class=\"iTxt\">Al-Magrib</span>, so let her break’. ", "And (I asked) about a woman who saw purity at the beginning of the day during a Month of Ramazan. She did not bathe, and did not eat. How would she deal with that day?’ He<sup>asws</sup> said: ‘But rather, her breaking is from the blood’."]}}, {"index": 6506, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:8", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ امْرَأَةٍ مَرِضَتْ فِي شَهْرِ رَمَضَانَ وَ مَاتَتْ فِي شَوَّالٍ فَأَوْصَتْنِي أَنْ أَقْضِيَ عَنْهَا قَالَ هَلْ بَرَأَتْ مِنْ مَرَضِهَا قُلْتُ لَا مَاتَتْ فِيهِ فَقَالَ لَا تَقْضِ عَنْهَا فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمْ يَجْعَلْهُ عَلَيْهَا ", "قُلْتُ فَإِنِّي أَشْتَهِي أَنْ أَقْضِيَ عَنْهَا وَ قَدْ أَوْصَتْنِي بِذَلِكَ قَالَ كَيْفَ تَقْضِي عَنْهَا شَيْئاً لَمْ يَجْعَلْهُ اللَّهُ عَلَيْهَا فَإِنِ اشْتَهَيْتَ أَنْ تَصُومَ لِنَفْسِكَ فَصُمْ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Muhammad Bin yahya, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a woman who fell sick during a Month of Ramazan, and she died in Shawwal. So she bequeathed to me that I make up for it on her behalf. He<sup>asws</sup> said: ‘Was she cured from her illness?’ I said, ‘No. She died in it’. So he<sup>asws</sup> said: ‘Do not make up for it on her behalf, for Allah<sup>azwj</sup> Mighty and Majestic did not Make it to be (Obligatory) upon her’. ", "I said, ‘But I desire to make up for it on her behalf, and she had bequeathed it to me with that’. He<sup>asws</sup> said: ‘How can you make up for something which Allah<sup>azwj</sup> did not Make it to be upon her? So, if you desire that you Fast for yourself, so Fast’."]}}, {"index": 6507, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:9", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ امْرَأَةٍ مَرِضَتْ فِي شَهْرِ رَمَضَانَ أَوْ طَمِثَتْ أَوْ سَافَرَتْ فَمَاتَتْ قَبْلَ خُرُوجِ شَهْرِ رَمَضَانَ هَلْ يُقْضَى عَنْهَا قَالَ أَمَّا الطَّمْثُ وَ الْمَرَضُ فَلَا وَ أَمَّا السَّفَرُ فَنَعَمْ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abu Hamza, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a woman who fell sick during a Month of Ramazan, or menstruated, or travelled. So she died before the exit of the Month of Ramazan. Does it have to be made up for, on her behalf?’ He<sup>asws</sup> said: ‘As for the menstruation and the illness, so no; and as for the journey, so yes’."]}}, {"index": 6508, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:10", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ رِفَاعَةَ بْنِ مُوسَى قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمَرْأَةِ تَنْذِرُ عَلَيْهَا صَوْمَ شَهْرَيْنِ مُتَتَابِعَيْنِ قَالَ تَصُومُ وَ تَسْتَأْنِفُ أَيَّامَهَا الَّتِي قَعَدَتْ حَتَّى تُتِمَّ شَهْرَيْنِ قُلْتُ أَ رَأَيْتَ إِنْ هِيَ يَئِسَتْ مِنَ الْمَحِيضِ أَ تَقْضِيهِ قَالَ لَا تَقْضِي يُجْزِئُهَا الْأَوَّلُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Rafa’at Bin Musa who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the woman who made a vow. Upon her was the Fasting of two months consecutively. He<sup>asws</sup> said: ‘She would Fast, and she would resume her days which she stayed (not Fasting), until she completes two months’. I said, ‘What is your<sup>asws</sup> view if she has despaired from the menstruation (in menopause), does she make up for it?’ He<sup>asws</sup> said: ‘She would not make up for it. Her first (time around) would suffice for her’."]}}, {"index": 6509, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:2:55:11", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْحُسَيْنِ بْنِ عُثْمَانَ عَنِ ابْنِ مُسْكَانَ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) إِنَّ امْرَأَتِي جَعَلَتْ عَلَى نَفْسِهَا صَوْمَ شَهْرَيْنِ فَوَضَعَتْ وَلَدَهَا وَ أَدْرَكَهَا الْحَبَلُ فَلَمْ تَقْوَ عَلَى الصَّوْمِ قَالَ فَلْتَتَصَدَّقْ مَكَانَ كُلِّ يَوْمٍ بِمُدٍّ عَلَى مِسْكِينٍ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Al Husayn Bin Usman, from Ibn Muskan, from Muhammad Bin Ja’far who said, ", "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘My wife made it upon herself, the Fasting of two months. So she placed (gave birth to) her child, and she became pregnant, so she was not strong upon the Fasting’. He<sup>asws</sup> said: ‘So let her give in charity in place of each day, with a Mudd (approximately 750g. of food) upon the poor ones’."]}}]}, "index": "al-kafi:4:2:55", "kind": "verse_list"}