{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:4:2", "titles": {"ar": "كِتَابُ الصِّيَامِ", "en": "THE BOOK OF FASTS (1)"}}, {"indexed_titles": {"en": "Chapter 58"}, "path": "/books/al-kafi:4:2:58", "titles": {"ar": "بَابُ مَنْ جَعَلَ عَلَى نَفْسِهِ صَوْماً مَعْلُوماً وَ مَنْ نَذَرَ أَنْ يَصُومَ فِي شُكْرٍ", "en": "Chapter 58 – The one who makes it upon himself specified Fasts, and the one who vows that he would be Fasting in appreciation"}}], "index": 918, "local_index": 58, "part_type": "Chapter", "path": "/books/al-kafi:4:2:58", "titles": {"ar": "بَابُ مَنْ جَعَلَ عَلَى نَفْسِهِ صَوْماً مَعْلُوماً وَ مَنْ نَذَرَ أَنْ يَصُومَ فِي شُكْرٍ", "en": "Chapter 58 – The one who makes it upon himself specified Fasts, and the one who vows that he would be Fasting in appreciation"}, "verse_count": 10, "verse_start_index": 6521, "verses": [{"index": 6522, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:2:58:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنِ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ كَرَّامٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي جَعَلْتُ عَلَى نَفْسِي أَنْ أَصُومَ حَتَّى يَقُومَ الْقَائِمُ ( عليه السلام ) فَقَالَ صُمْ وَ لَا تَصُمْ فِي السَّفَرِ وَ لَا الْعِيدَيْنِ وَ لَا أَيَّامَ التَّشْرِيقِ وَ لَا الْيَوْمَ الَّذِي يُشَكُّ فِيهِ مِنْ شَهْرِ رَمَضَانَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Karram who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘I made it upon myself that I would be Fasting until the rising of Al-Qaim<sup>asws</sup>’. So he<sup>asws</sup> said: ‘Fast, and do not Fast during the journey, nor the two Eids, nor the days of Al-Tashreek (11<sup>th</sup>, 12<sup>th</sup> & 13<sup>th</sup> of Zil-Hijja), nor the day wherein is a doubt from a Month of Ramazan’."}]}, {"index": 6523, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:2:58:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ قَالَ كَتَبَ الْحُسَيْنُ إِلَى الرِّضَا ( عليه السلام ) جُعِلْتُ فِدَاكَ رَجُلٌ نَذَرَ أَنْ يَصُومَ أَيَّاماً مَعْلُومَةً فَصَامَ بَعْضَهَا ثُمَّ اعْتَلَّ فَأَفْطَرَ أَ يَبْتَدِئُ فِي صَوْمِهِ أَمْ يَحْتَسِبُ بِمَا مَضَى فَكَتَبَ إِلَيْهِ يَحْتَسِبُ مَا مَضَى .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Ahmad Bin Asheym who said, \n‘Al-Husayn wrote to (Imam) Al-Reza<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! A man vows that he would be Fasting for a known (number of) days. So he Fasts some of these, then he fell ill, so he broke. Should he begin his Fasting or can he count with what is past?’ So he<sup>asws</sup> wrote to him: ‘He can count what is past’."}]}, {"index": 6524, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:2:58:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ عَلَيَّ صِيَامُ شَهْرٍ إِنْ خَرَجَ عَمِّي مِنَ الْحَبْسِ فَخَرَجَ فَأُصْبِحُ وَ أَنَا أُرِيدُ الصِّيَامَ فَيَجِيئُنِي بَعْضُ أَصْحَابِنَا فَأَدْعُو بِالْغَدَاءِ وَ أَتَغَدَّى مَعَهُ قَالَ لَا بَأْسَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Salih Bin Abdullah, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Upon me are Fasts for a month if my uncle would come out from the prison. So he came out. So I woke up in the morning and I intended the Fasting, and one of our companions came over to me. So I called for the lunch and had lunch with him’. He<sup>asws</sup> said: ‘There is no problem’."}]}, {"index": 6525, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:2:58:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ جَعَلَ عَلَى نَفْسِهِ صَوْمَ شَهْرٍ بِالْكُوفَةِ وَ شَهْرٍ بِالْمَدِينَةِ وَ شَهْرٍ بِمَكَّةَ مِنْ بَلَاءٍ ابْتُلِيَ بِهِ فَقُضِيَ أَنَّهُ صَامَ بِالْكُوفَةِ شَهْراً وَ دَخَلَ الْمَدِينَةَ فَصَامَ بِهَا ثَمَانِيَةَ عَشَرَ يَوْماً وَ لَمْ يُقِمْ عَلَيْهِ الْجَمَّالُ قَالَ يَصُومُ مَا بَقِيَ عَلَيْهِ إِذَا انْتَهَى إِلَى بَلَدِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, \n(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about a man who makes it upon himself the Fasting for a month in Al-Kufa, and a month is Al-Medina, and a month in Al-Makkah, from an affliction he had been afflicted with. So he fulfilled his Fasts for a month in Al-Kufa, and he entered Al-Medina. So he Fasted eighteen days, and the camelier could not remain upon it. He<sup>asws</sup> said: ‘He can Fast what is remaining when he ends up to his city’."}]}, {"index": 6526, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:2:58:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ جَعْفَرٍ عَنْ آبَائِهِ ( عليهم السلام ) أَنَّ عَلِيّاً صَلَوَاتُ اللَّهِ عَلَيْهِ قَالَ فِي رَجُلٍ نَذَرَ أَنْ يَصُومَ زَمَاناً قَالَ الزَّمَانُ خَمْسَةُ أَشْهُرٍ وَ الْحِينُ سِتَّةُ أَشْهُرٍ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ تُؤْتِي أُكُلَها كُلَّ حِينٍ بِإِذْنِ رَبِّها .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Ja’far<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> that Ali<sup>asws</sup> said regarding a man who vowed that he would be Fasting for a time: ‘The ‘time’ is five months, and the ‘season’ is of six months because Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[14:25] Yielding its fruit in every season by the permission of its Lord</span>’."}]}, {"index": 6527, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:2:58:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ خَالِدِ بْنِ جَرِيرٍ عَنْ أَبِي الرَّبِيعِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنْ رَجُلٍ قَالَ لِلَّهِ عَلَيَّ أَنْ أَصُومَ حِيناً وَ ذَلِكَ فِي شُكْرٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَدْ أُتِيَ عَلِيٌّ ( عليه السلام ) فِي مِثْلِ هَذَا فَقَالَ صُمْ سِتَّةَ أَشْهُرٍ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ تُؤْتِي أُكُلَها كُلَّ حِينٍ بِإِذْنِ رَبِّها يَعْنِي سِتَّةَ أَشْهُرٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Hassan Bin Mahboub, from Khalid Bin Jareer, from Abu Al Rabi’e, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having been asked about a man who said, ‘By Allah<sup>azwj</sup>! It is upon me that I Fast for a season’, and that is regarding appreciation. So Abu Abdullah<sup>asws</sup> said: ‘Someone had come to Ali<sup>asws</sup> with the likes of this, so he<sup>asws</sup> said: ‘Fast for six months, for Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[14:25] Yielding its fruit in every season by the permission of its Lord</span> – Meaning six months’."}]}, {"index": 6528, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:2:58:7", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ آبَائِهِ ( عليهم السلام ) فِي الرَّجُلِ يَجْعَلُ عَلَى نَفْسِهِ أَيَّاماً مَعْدُودَةً مُسَمَّاةً فِي كُلِّ شَهْرٍ ثُمَّ يُسَافِرُ فَتَمُرُّ بِهِ الشُّهُورُ أَنَّهُ لَا يَصُومُ فِي السَّفَرِ وَ لَا يَقْضِيهَا إِذَا شَهِدَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> regarding the man who made it upon himself (to Fast) for a specified number of days during every month. Then he travels, so the months pass by him, that he would not be Fasting during the journey, nor would he be making up for it when he is present (back home)’."}]}, {"index": 6529, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:2:58:8", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَصُومُ صَوْماً قَدْ وَقَّتَهُ عَلَى نَفْسِهِ أَوْ يَصُومُ مِنْ أَشْهُرِ الْحُرُمِ فَيَمُرُّ بِهِ الشَّهْرُ وَ الشَّهْرَانِ لَا يَقْضِيهِ فَقَالَ لَا يَصُومُ فِي السَّفَرِ وَ لَا يَقْضِي شَيْئاً مِنْ صَوْمِ التَّطَوُّعِ إِلَّا الثَّلَاثَةَ الْأَيَّامِ الَّتِي كَانَ يَصُومُهَا مِنْ كُلِّ شَهْرٍ وَ لَا يَجْعَلُهَا بِمَنْزِلَةِ الْوَاجِبِ إِلَّا أَنِّي أُحِبُّ لَكَ أَنْ تَدُومَ عَلَى الْعَمَلِ الصَّالِحِ \nقَالَ وَ صَاحِبُ الْحُرُمِ الَّذِي كَانَ يَصُومُهَا وَ يُجْزِئُهُ أَنْ يَصُومَ مَكَانَ كُلِّ شَهْرٍ مِنْ أَشْهُرِ الْحُرُمِ ثَلَاثَةَ أَيَّامٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bn Mahboub, from Abdullah Bin Sinan who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the man who had timed it upon himself, or he was Fasting from Sacred Months. So the month, and the two month pass by him, not fulfilling it. So he<sup>asws</sup> said: ‘He should not be Fasting during the journey, nor would he make up for anything from the optional Fasts except for the three days which he had Fasted from each month, nor make it to be at the status of the Obligatory, except that I<sup>asws</sup> like it for you that you should be habitual upon the righteous deed’. \nHe<sup>asws</sup> said: ‘And the one who had the Fasting for the Sacred Months which he used to Fast, it would suffice him in place of each month from the Sacred Months, (the Fasting of) three days’."}]}, {"index": 6530, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:2:58:9", "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي الْحَسَنِ الرِّضَا صَلَوَاتُ اللَّهِ عَلَيْهِ قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَجْعَلُ لِلَّهِ عَزَّ وَ جَلَّ عَلَيْهِ صَوْمَ يَوْمٍ مُسَمًّى قَالَ يَصُومُهُ أَبَداً فِي السَّفَرِ وَ الْحَضَرِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ismail, from Al Fazal Bin Shazaan, from Ibn Abu Umeyr from Ibrahim Bin Abdul Hameed, \n(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who Made it upon himself for the Sake of Allah<sup>azwj</sup> Mighty and Majestic, Fasting of a specified day. He<sup>asws</sup> said: ‘He should be Fasting it for ever, during the journey and the presence (at home)’."}]}, {"index": 6531, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:2:58:10", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ إِنَّ أُمِّي كَانَتْ جَعَلَتْ عَلَى نَفْسِهَا لِلَّهِ عَلَيْهَا نَذْراً إِنْ كَانَ اللَّهُ رَدَّ عَلَيْهَا بَعْضَ وُلْدِهَا مِنْ شَيْ‏ءٍ كَانَتْ تَخَافُ عَلَيْهِ أَنْ تَصُومَ ذَلِكَ الْيَوْمَ الَّذِي يَقْدَمُ فِيهِ مَا بَقِيَتْ فَخَرَجَتْ مَعَنَا مُسَافِرَةً إِلَى مَكَّةَ فَأَشْكَلَ عَلَيْنَا لَمْ نَدْرِ أَ تَصُومُ أَمْ تُفْطِرُ فَسَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَلِكَ وَ أَخْبَرْتُهُ بِمَا جَعَلَتْ عَلَى نَفْسِهَا فَقَالَ لَا تَصُومُ فِي السَّفَرِ قَدْ وَضَعَ اللَّهُ عَنْهَا حَقَّهُ وَ تَصُومُ هِيَ مَا جَعَلَتْ عَلَى نَفْسِهَا \nقَالَ قُلْتُ مَا تَرَى إِذَا هِيَ قَدِمَتْ وَ تَرَكَتْ ذَلِكَ فَقَالَ إِنِّي أَخَافُ أَنْ تَرَى فِي الَّذِي نَذَرَتْ مَا تَكْرَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zurara who said, \n‘My mother had made it upon herself for the Sake of Allah<sup>azwj</sup>, a vow that if Allah<sup>azwj</sup> were to Return one of her children from something which she had feared upon, she would be Fasting that day in which he comes back, for as long as she remained. So she went out with us on a journey to Makkah. So it became doubtful upon us. We did not know whether she should be Fasting or breaking. So I asked Abu Abdullah<sup>asws</sup> about that, and I informed him with what she had made it to be upon herself. So he<sup>asws</sup> said: ‘She should not be Fasting during the journey. Allah<sup>azwj</sup> has Exempted it from her His<sup>azwj</sup> Right, and she should be Fasting what she has made it to be upon herself’. \nHe (the narrator) said, ‘What is your<sup>asws</sup> view when she returns and neglects that?’ So he<sup>asws</sup> said: ‘I<sup>asws</sup> fear that she might see in that which she had vowed, what she dislikes’."}]}]}, "index": "al-kafi:4:2:58", "kind": "verse_list"}