{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 59"
        },
        "path": "/books/al-kafi:4:2:59",
        "titles": {
          "ar": "بَابُ كَفَّارَةِ الصَّوْمِ وَ فِدْيَتِهِ",
          "en": "Chapter 59 – Expiation of the Fast and its redemption"
        }
      }
    ],
    "index": 919,
    "local_index": 59,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:59",
    "titles": {
      "ar": "بَابُ كَفَّارَةِ الصَّوْمِ وَ فِدْيَتِهِ",
      "en": "Chapter 59 – Expiation of the Fast and its redemption"
    },
    "verse_count": 7,
    "verse_start_index": 6531,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/355)"
        ],
        "index": 6532,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:59:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سَهْلٍ عَنْ إِدْرِيسَ بْنِ زَيْدٍ وَ عَلِيِّ بْنِ إِدْرِيسَ قَالَا سَأَلْنَا الرِّضَا ( عليه السلام ) عَنْ رَجُلٍ نَذَرَ نَذْراً إِنْ هُوَ تَخَلَّصَ مِنَ الْحَبْسِ أَنْ يَصُومَ ذَلِكَ الْيَوْمَ الَّذِي تَخَلَّصَ فِيهِ فَيَعْجِزُ عَنِ الصَّوْمِ لِعِلَّةٍ أَصَابَتْهُ أَوْ غَيْرِ ذَلِكَ فَمُدَّ لِلرَّجُلِ فِي عُمُرِهِ وَ قَدِ اجْتَمَعَ عَلَيْهِ صَوْمٌ كَثِيرٌ مَا كَفَّارَةُ ذَلِكَ الصَّوْمِ قَالَ يُكَفِّرُ عَنْ كُلِّ يَوْمٍ بِمُدِّ حِنْطَةٍ أَوْ شَعِيرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Sahl, from Idrees Bin zayd and Ali Bin Idrees who both said, ",
            "‘We asked (Imam) Al-Reza<sup>asws</sup> about a man who vowed a vow that if he is freed from the prison, he would be Fasting that day in which he was set free. Then he became frustrated from the Fasting due to an illness which hit him, or other than that. So it prolonged for the man during his lifetime, and a lot of Fasts had gathered upon him. What is the expiation of that Fast?’ He<sup>asws</sup> said: ‘He can expiate it from each day (by giving charity) with a Mudd (approximately 750g. of food) of wheat, or barley’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad, from ibn Khalid from Muhammad ibn Sahl from Idris ibn Zayd and Ali ibn Idris who has said the following: “Once we asked al-Rida’, ‘Alayhi al-Salam, about a man who makes a vow that if he is released from jail, he will fast the same day but he is unable to do so because of illness or other reasons, and during his life time he becomes indebted to carry out many days of fasting. What is the expiation for such fast? He (the Imam) said, ‘He can expiate it with one mud (a certain measurement) of wheat or barley for every day.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/355)"
        ],
        "index": 6533,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:59:2",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَحْمَدَ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ قَالَ سَأَلْتُ الرِّضَا ( عليه السلام ) عَنْ رَجُلٍ نَذَرَ نَذْراً فِي صِيَامٍ فَعَجَزَ فَقَالَ كَانَ أَبِي يَقُولُ عَلَيْهِ مَكَانَ كُلِّ يَوْمٍ مُدٌّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Ahmad, from Musa Bin Bakr, from Muhammad Bin Mansour who said, ",
            "‘I asked (Imam) Al-Reza<sup>asws</sup> about a man who vowed a vow regarding Fasts, so he was frustrated. So he<sup>asws</sup> said; ‘My<sup>asws</sup> father<sup>asws</sup> was saying: ‘Upon him, in place of each day, is a Mudd (approximately 750g. of food) (as charity)’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad has narrated from Ali ibn Ahmad from Musa ibn Bakr from Muhammad ibn Mansur who has said the following: “I once asked al-Rida’, ‘Alayhi al-Salam, about a man who makes a vow and then fails to fast. He (the Imam) said, ‘My father, ‘Alayhi al-Salam, would say that he is required to pay one mud (a certain measurement) for every day.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/356)"
        ],
        "index": 6534,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:59:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فِي رَجُلٍ نَذَرَ عَلَى نَفْسِهِ إِنْ هُوَ سَلِمَ مِنْ مَرَضٍ أَوْ تَخَلَّصَ مِنْ حَبْسٍ أَنْ يَصُومَ كُلَّ يَوْمِ أَرْبِعَاءَ وَ هُوَ الْيَوْمُ الَّذِي تَخَلَّصَ فِيهِ فَعَجَزَ عَنِ الصَّوْمِ لِعِلَّةٍ أَصَابَتْهُ أَوْ غَيْرِ ذَلِكَ فَمُدَّ لِلرَّجُلِ فِي عُمُرِهِ وَ اجْتَمَعَ عَلَيْهِ صَوْمٌ كَثِيرٌ مَا كَفَّارَةُ ذَلِكَ قَالَ تَصَدَّقَ لِكُلِّ يَوْمٍ بِمُدٍّ مِنْ حِنْطَةٍ أَوْ ثَمَنِ مُدٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from ahmad Bin Muhammad Bin Abu Nasr, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> regarding a man who vowed upon himself that if he was safe from an illness, or freed from prison, that he would be Fasting every day of Wednesday, and it was the day in which he was released. So he was frustrated from the Fasting due to an illness which hit him, or other than that. So it got prolonged for the man, during his lifetime, and there gathered upon him a lot of Fasts. What is the expiation for that?’ He<sup>asws</sup> said: ‘He should give in charity, for each day, with a Mudd (approximately 750g. of food) of wheat, or the price of a Mudd (approximately 750g. of food).’"
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr who has said the following: “I once asked abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, about a man who vows to fast, if he is released from jail, every Wednesday. It is the day when he was released but he fails to do so due to illness or other reasons; and during his lifetime a large number of days of such fast become due upon him. What is the expiation for such fast? He (the Imam) said, ‘He must pay charity of one mud (a certain measurement) of wheat or its price for every day of fast.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/356)"
        ],
        "index": 6535,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:59:4",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ قَالَ سَأَلْتُهُ عَمَّنْ لَمْ يَصُمِ الثَّلَاثَةَ الْأَيَّامِ مِنْ كُلِّ شَهْرٍ وَ هُوَ يَشُدُّ عَلَيْهِ الصِّيَامُ هَلْ فِيهِ فِدَاءٌ قَالَ مُدٌّ مِنْ طَعَامٍ فِي كُلِّ يَوْمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ays Bin Al Qasim who said, ",
            "‘I asked him<sup>asws</sup> about the one who does not Fast the three days from every month, and the Fasting is difficult upon him. Is there a redemption in it?’ He<sup>asws</sup> said: ‘A Mudd (approximately 750g. of food) of food regarding each day’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Is ibn al-Qasim who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about a man who does not fast three days every month because fasting is difficult for him: if there is a ransom for it. He (the Imam) said, ‘It is one mud (a certain measurement) of food for everyday.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/356)"
        ],
        "index": 6536,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:59:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الصَّوْمَ يَشُدُّ عَلَيَّ فَقَالَ لِي لَدِرْهَمٌ تَصَدَّقُ بِهِ أَفْضَلُ مِنْ صِيَامِ يَوْمٍ ثُمَّ قَالَ وَ مَا أُحِبُّ أَنْ تَدَعَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Hammad Bin Usman, from Umar Bin Yazeed who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The Fasting is difficult upon me’. So he<sup>asws</sup> said to me: ‘The Dirham you give in charity with is superior than Fasting a day’. Then he<sup>asws</sup> said: ‘And I<sup>asws</sup> do not like it if you were to neglect it’."
          ],
          "en.sarwar": [
            "5. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Hammad ibn ‘Uthaman from ‘Umar ibn Yazid who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, fasting is difficult for me. He (the Imam) said, ‘One dirham given as charity is better than fasting for one day. He (the Imam) then said, ‘I do not like if you neglect it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/356)"
        ],
        "index": 6537,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:59:6",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ يَزِيدَ بْنِ خَلِيفَةَ قَالَ شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقُلْتُ إِنِّي أُصَدَّعُ إِذَا صُمْتُ هَذِهِ الثَّلَاثَةَ الْأَيَّامِ وَ يَشُقُّ عَلَيَّ قَالَ فَاصْنَعْ كَمَا أَصْنَعُ إِذَا سَافَرْتُ فَإِنِّي إِذَا سَافَرْتُ تَصَدَّقْتُ عَنْ كُلِّ يَوْمٍ بِمُدٍّ مِنْ قُوتِ أَهْلِي الَّذِي أَقُوتُهُمْ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Yazeed Bin Khaleefa who said, ",
            "‘I complained to Abu Abdullah<sup>asws</sup>, so I said, ‘I tend to get a headache when I Fast these three days, and it is grievous upon me’. He<sup>asws</sup> said: ‘So you should do just as I<sup>asws</sup> do when I<sup>asws</sup> travel. So I<sup>asws</sup>, when I<sup>asws</sup> travel, give in charity for each day with a Mudd (approximately 750g. of food) of daily subsistence of my<sup>asws</sup> family which I<sup>asws</sup> tend to provide them with’."
          ],
          "en.sarwar": [
            "6. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Yazid ibn Khalifah who has said the following: “I once complained before abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘I get a headache if I fast the three days (recommended for every month) and it is difficult for me. He (the Imam) said, ‘You must do as I do when I travel. When traveling I pay charity for every day of one mud (a certain measurement) of the kind of food which is used in my family.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/357)"
        ],
        "index": 6538,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:59:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ عُقْبَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنِّي قَدْ كَبِرْتُ وَ ضَعُفْتُ عَنِ الصِّيَامِ فَكَيْفَ أَصْنَعُ بِهَذِهِ الثَّلَاثَةِ الْأَيَّامِ فِي كُلِّ شَهْرٍ فَقَالَ يَا عُقْبَةُ تَصَدَّقْ بِدِرْهَمٍ عَنْ كُلِّ يَوْمٍ قَالَ قُلْتُ دِرْهَمٌ وَاحِدٌ قَالَ لَعَلَّهَا كَبُرَتْ عِنْدَكَ وَ أَنْتَ تَسْتَقِلُّ الدِّرْهَمَ قَالَ قُلْتُ إِنَّ نِعَمَ اللَّهِ عَزَّ وَ جَلَّ عَلَيَّ لَسَابِغَةٌ فَقَالَ يَا عُقْبَةُ لَإِطْعَامُ مُسْلِمٍ خَيْرٌ مِنْ صِيَامِ شَهْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazie, from Salih Bin Uqba, from Uqba who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I have aged and weakened from Fasting. So how should I deal with these three days during every month?’ So he<sup>asws</sup> said: ‘O Uqba! Give in charity with a Dirham for each day’. I said, ‘One Dirham?’ He<sup>asws</sup> said: ‘Perhaps it is grievous with you, and you are belittling the Dirham’. I said, ‘Allah<sup>azwj</sup> Mighty and Majestic has Favoured upon me with abundance’. So he<sup>asws</sup> said: ‘O Uqba! Feeding a Muslim is better than Fasting (for) a month’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ‘Isma‘il ibn Bazi’ from Salih ibn ‘Uqbah who has said the following: “I once said to abu ‘ Abd Allah, ‘Alayhi al-Salam, that I have become old and weak to fast the three days every month. He (the Imam) said, ‘O ‘Uqbah, give one dirham as charity for every day.’ I then said, ‘Just one dirham!’ He (the Imam) said, ‘Perhaps it seems greatly strange to you and you think one dirham is small.’ I said, ‘The bounties of Allah, most Majestic, most Glorious, are plentiful with me.’ He (the Imam) said, ‘O ‘Uqbah, feeding one Muslim is better than fasting for one month.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:59",
  "kind": "verse_list"
}