{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:4:2", "titles": {"ar": "كِتَابُ الصِّيَامِ", "en": "THE BOOK OF FASTS (1)"}}, {"indexed_titles": {"en": "Chapter 61"}, "path": "/books/al-kafi:4:2:61", "titles": {"ar": "بَابُ صَوْمِ عَرَفَةَ وَ عَاشُورَاءَ", "en": "Chapter 61 – The Fast of (the day of) Arafat (9<sup>th</sup> Zil Hijja), and Ashoura (10<sup>th</sup> Muharram)"}}], "index": 921, "local_index": 61, "part_type": "Chapter", "path": "/books/al-kafi:4:2:61", "titles": {"ar": "بَابُ صَوْمِ عَرَفَةَ وَ عَاشُورَاءَ", "en": "Chapter 61 – The Fast of (the day of) Arafat (9<sup>th</sup> Zil Hijja), and Ashoura (10<sup>th</sup> Muharram)"}, "verse_count": 7, "verse_start_index": 6541, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6542, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:2:61:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى وَ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) أَنَّهُ سُئِلَ عَنْ صَوْمِ يَوْمِ عَرَفَةَ فَقَالَ أَ مَا أَصُومُهُ الْيَوْمَ وَ هُوَ يَوْمُ دُعَاءٍ وَ مَسْأَلَةٍ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya and Ali Bin Al Hakam, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ", "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having been asked about Fasting the day of Arafat (9<sup>th</sup> Zil-Hijja), so he<sup>asws</sup> said: ‘I<sup>asws</sup> do not Fast the day, and it is a day of supplications and the beseeching’."]}}, {"index": 6543, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:2:61:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَمْ يَصُمْ يَوْمَ عَرَفَةَ مُنْذُ نَزَلَ صِيَامُ شَهْرِ رَمَضَانَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Sa’alba Bin Maymoun, from Muhammad Bin Muslim who said, ", "‘I heard Abu Ja’far<sup>asws</sup> saying that Rasool-Allah<sup>saww</sup> did not Fast the day of Arafat (9<sup>th</sup> Zil Hijja) since the Fasting of the Month of Ramazan was Revealed’."]}}, {"index": 6544, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:2:61:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ نُوحِ بْنِ شُعَيْبٍ النَّيْسَابُورِيِّ عَنْ يَاسِينَ الضَّرِيرِ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَا لَا تَصُمْ فِي يَوْمِ عَاشُورَاءَ وَ لَا عَرَفَةَ بِمَكَّةَ وَ لَا فِي الْمَدِينَةِ وَ لَا فِي وَطَنِكَ وَ لَا فِي مِصْرٍ مِنَ الْأَمْصَارِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Nuh Bin Shuayb Al Neyshapouri, fom Yaseen Al Zareer, from Hareyz, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> or Abu Abdullah<sup>asws</sup> both having said: ‘Do not Fast during the day of Ashura (10<sup>th</sup> Muharram), nor Arafat (9<sup>th</sup> Zil-Hijja), neither in Makkah, nor in Al-Medina, nor in your hometown, nor in a city from the cities (during these two days)’."]}}, {"index": 6545, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:2:61:4", "text": ["الْحَسَنُ بْنُ عَلِيٍّ الْهَاشِمِيُّ عَنْ مُحَمَّدِ بْنِ مُوسَى عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ قَالَ حَدَّثَنِي نَجَبَةُ بْنُ الْحَارِثِ الْعَطَّارُ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ صَوْمِ يَوْمِ عَاشُورَاءَ فَقَالَ صَوْمٌ مَتْرُوكٌ بِنُزُولِ شَهْرِ رَمَضَانَ وَ الْمَتْرُوكُ بِدْعَةٌ ", "قَالَ نَجَبَةُ فَسَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) مِنْ بَعْدِ أَبِيهِ ( عليه السلام ) عَنْ ذَلِكَ فَأَجَابَنِي بِمِثْلِ جَوَابِ أَبِيهِ ثُمَّ قَالَ أَمَا إِنَّهُ صَوْمُ يَوْمٍ مَا نَزَلَ بِهِ كِتَابٌ وَ لَا جَرَتْ بِهِ سُنَّةٌ إِلَّا سُنَّةُ آلِ زِيَادٍ بِقَتْلِ الْحُسَيْنِ بْنِ عَلِيٍّ صَلَوَاتُ اللَّهِ عَلَيْهِمَا ."], "translations": {"en.hubeali": ["Al Hassan Bin Ali Al Hashimy, from Muhammad Bin Musa, from Yaqoub Bin Yazeed, from Al Hassan Bin Ali Al Washa who said, ‘My father narrated to me from Najbat Bin Al Haris Al Attar who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about Fasting the day of Ashura (10<sup>th</sup> Muharram), so he<sup>asws</sup> said: ‘It is an abandoned Fast due to the Revelation of the Month of Ramazan, and (practicing) the abandoned is ‘بِدْعَةٌ’ an innovation’. ", "Najba said, ‘So I asked Abu Abdullah<sup>asws</sup> from after his<sup>asws</sup> father<sup>asws</sup> about that, so he<sup>asws</sup> answered me with an answer to that of his<sup>asws</sup> father<sup>asws</sup>. Then he<sup>asws</sup> said: ‘But, it is a Fast of a day which neither the Book Revealed with it nor did a Sunnah flow with it, except for the sunnah of the progeny of Ziyad due to the killing of Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup>’."]}}, {"index": 6546, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:2:61:5", "text": ["عَنْهُ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ قَالَ حَدَّثَنِي جَعْفَرُ بْنُ عِيسَى أَخُوهُ قَالَ سَأَلْتُ الرِّضَا ( عليه السلام ) عَنْ صَوْمِ عَاشُورَاءَ وَ مَا يَقُولُ النَّاسُ فِيهِ فَقَالَ عَنْ صَوْمِ ابْنِ مَرْجَانَةَ تَسْأَلُنِي ذَلِكَ يَوْمٌ صَامَهُ الْأَدْعِيَاءُ مِنْ آلِ زِيَادٍ لِقَتْلِ الْحُسَيْنِ ( عليه السلام ) وَ هُوَ يَوْمٌ يَتَشَأَّمُ بِهِ آلُ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ يَتَشَأَّمُ بِهِ أَهْلُ الْإِسْلَامِ ", "وَ الْيَوْمُ الَّذِي يَتَشَأَّمُ بِهِ أَهْلُ الْإِسْلَامِ لَا يُصَامُ وَ لَا يُتَبَرَّكُ بِهِ وَ يَوْمُ الْإِثْنَيْنِ يَوْمُ نَحْسٌ قَبَضَ اللَّهُ عَزَّ وَ جَلَّ فِيهِ نَبِيَّهُ وَ مَا أُصِيبَ آلُ مُحَمَّدٍ إِلَّا فِي يَوْمِ الْإِثْنَيْنِ فَتَشَأَّمْنَا بِهِ وَ تَبَرَّكَ بِهِ عَدُوُّنَا وَ يَوْمُ عَاشُورَاءَ قُتِلَ الْحُسَيْنُ صَلَوَاتُ اللَّهِ عَلَيْهِ وَ تَبَرَّكَ بِهِ ابْنُ مَرْجَانَةَ وَ تَشَأَّمَ بِهِ آلُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِمْ ", "فَمَنْ صَامَهُمَا أَوْ تَبَرَّكَ بِهِمَا لَقِيَ اللَّهَ تَبَارَكَ وَ تَعَالَى مَمْسُوخَ الْقَلْبِ وَ كَانَ حَشْرُهُ مَعَ الَّذِينَ سَنُّوا صَوْمَهُمَا وَ التَّبَرُّكَ بِهِمَا ."], "translations": {"en.hubeali": ["From him, from Muhammad Bin Isa Bin Ubeyd who said, ‘Ja’far Bin Isa narrated to me from his brother who said, ", "‘I asked (Imam) Al-Reza<sup>asws</sup> about Fasting Ashura (10<sup>th</sup> Muharram) and what the people are saying with regards to it. So he<sup>asws</sup> said: ‘It is the Fast of Ibn Marjana you are asking me<sup>asws</sup> about. That is a day the pretenders from the Progeny of Ziyad Fasted in, due to the killing of Al-Husayn<sup>asws</sup>, and it is a day which the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> see it as an evil omen (a grievous/tragic day), and the people of Al-Islam see it as an evil omen.", "And the day which the people of Al-Islam see it as an evil omen can neither be Fasted nor can it be a blissful one. And the day of Wednesday is an inauspicious day. Allah<sup>azwj</sup> Caused His<sup>azwj</sup> Prophet<sup>saww</sup> to pass away during it, and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> was not afflicted with except during the day of Wednesday. Thus, we<sup>asws</sup> see it as an evil omen, and our<sup>asws</sup> enemies take it to be blissful/rewarding by it. And, the day of Ashura, Al-Husayn<sup>asws</sup> was killed, and Ibn Marjana was pleased with it, and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> see it as a day of tragedy. ", "Therefore, the one who Fasts it, or sees it to be blessed by it, would meet Allah<sup>azwj</sup> Blessed and High with a morphed heart, and his Resurrection would be with those who made a sunnah of Fasting it and the seekers of the Blessings by it’."]}}, {"index": 6547, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:2:61:6", "text": ["وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ عِيسَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَيْرٍ عَنْ زَيْدٍ النَّرْسِيِّ قَالَ سَمِعْتُ عُبَيْدَ بْنَ زُرَارَةَ يَسْأَلُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ صَوْمِ يَوْمِ عَاشُورَاءَ فَقَالَ مَنْ صَامَهُ كَانَ حَظُّهُ مِنْ صِيَامِ ذَلِكَ الْيَوْمِ حَظَّ ابْنِ مَرْجَانَةَ وَ آلِ زِيَادٍ قَالَ قُلْتُ وَ مَا كَانَ حَظُّهُمْ مِنْ ذَلِكَ الْيَوْمِ قَالَ النَّارُ أَعَاذَنَا اللَّهُ مِنَ النَّارِ وَ مِنْ عَمَلٍ يُقَرِّبُ مِنَ النَّارِ ."], "translations": {"en.hubeali": ["And from him, from Muhammad Bin Isa who said, ‘Muhammad in Abu Umeyr narrated to us, from Zayd Al Narsy who said, ", "‘I heard Zurara asking Abu Abdullah<sup>asws</sup> about the Fasting of the day of Ashura (10<sup>th</sup> Muharram). So he<sup>asws</sup> said: ‘The one who Fasts it, his share from the Fast of that day would be a share of Ibn Marjana and the progeny of Ziyad’. I said, ‘And what is their share from that day?’ He<sup>asws</sup> said: ‘The Fire. We<sup>asws</sup> seek Refuge with Allah<sup>azwj</sup> from the Fire and from the deed which takes one closer to the Fire’."]}}, {"index": 6548, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:2:61:7", "text": ["وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبَانٍ عَنْ عَبْدِ الْمَلِكِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ صَوْمِ تَاسُوعَاءَ وَ عَاشُورَاءَ مِنْ شَهْرِ الْمُحَرَّمِ فَقَالَ تَاسُوعَاءُ يَوْمٌ حُوصِرَ فِيهِ الْحُسَيْنُ ( عليه السلام ) وَ أَصْحَابُهُ رَضِيَ اللَّهُ عَنْهُمْ بِكَرْبَلَاءَ وَ اجْتَمَعَ عَلَيْهِ خَيْلُ أَهْلِ الشَّامِ وَ أَنَاخُوا عَلَيْهِ وَ فَرِحَ ابْنُ مَرْجَانَةَ وَ عُمَرُ بْنُ سَعْدٍ بِتَوَافُرِ الْخَيْلِ وَ كَثْرَتِهَا وَ اسْتَضْعَفُوا فِيهِ الْحُسَيْنَ صَلَوَاتُ اللَّهِ عَلَيْهِ وَ أَصْحَابَهُ رَضِيَ اللَّهُ عَنْهُمْ وَ أَيْقَنُوا أَنْ لَا يَأْتِيَ الْحُسَيْنَ ( عليه السلام ) نَاصِرٌ وَ لَا يُمِدَّهُ أَهْلُ الْعِرَاقِ بِأَبِي الْمُسْتَضْعَفُ الْغَرِيبُ ", "ثُمَّ قَالَ وَ أَمَّا يَوْمُ عَاشُورَاءَ فَيَوْمٌ أُصِيبَ فِيهِ الْحُسَيْنُ ( عليه السلام ) صَرِيعاً بَيْنَ أَصْحَابِهِ وَ أَصْحَابُهُ صَرْعَى حَوْلَهُ عُرَاةً أَ فَصَوْمٌ يَكُونُ فِي ذَلِكَ الْيَوْمِ كَلَّا وَ رَبِّ الْبَيْتِ الْحَرَامِ مَا هُوَ يَوْمَ صَوْمٍ وَ مَا هُوَ إِلَّا يَوْمُ حُزْنٍ وَ مُصِيبَةٍ دَخَلَتْ عَلَى أَهْلِ السَّمَاءِ وَ أَهْلِ الْأَرْضِ وَ جَمِيعِ الْمُؤْمِنِينَ", "وَ يَوْمُ فَرَحٍ وَ سُرُورٍ لِابْنِ مَرْجَانَةَ وَ آلِ زِيَادٍ وَ أَهْلِ الشَّامِ غَضِبَ اللَّهُ عَلَيْهِمْ وَ عَلَى ذُرِّيَّاتِهِمْ وَ ذَلِكَ يَوْمٌ بَكَتْ عَلَيْهِ جَمِيعُ بِقَاعِ الْأَرْضِ خَلَا بُقْعَةِ الشَّامِ فَمَنْ صَامَهُ أَوْ تَبَرَّكَ بِهِ حَشَرَهُ اللَّهُ مَعَ آلِ زِيَادٍ مَمْسُوخُ الْقَلْبِ مَسْخُوطٌ عَلَيْهِ وَ مَنِ ادَّخَرَ إِلَى مَنْزِلِهِ ذَخِيرَةً أَعْقَبَهُ اللَّهُ تَعَالَى نِفَاقاً فِي قَلْبِهِ إِلَى يَوْمِ يَلْقَاهُ وَ انْتَزَعَ الْبَرَكَةَ عَنْهُ وَ عَنْ أَهْلِ بَيْتِهِ وَ وُلْدِهِ وَ شَارَكَهُ الشَّيْطَانُ فِي جَمِيعِ ذَلِكَ ."], "translations": {"en.hubeali": ["And from him, from Muhammad Bin Al Husayn, from Muhammad Bin Sinan, from Aban, from Abdul Malik who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the Fast of ‘Tasua’ (9<sup>th</sup> Muharram), and Ashura (10<sup>th</sup> Muharram) from the month of Muharram. So he<sup>asws</sup> said: ‘Tasua is a day in which Al-Husayn<sup>asws</sup> and his<sup>asws</sup> companions, may Allah<sup>azwj</sup> be Pleased with them, were surrounded in Kerbala, and the cavalries of the people of Syria were gathered against him<sup>asws</sup>, and inflicted injuries upon him<sup>asws</sup>; and Ibn Marjana and Umar Bin Sa’ad were joyful due to the large numbers of the cavalries and its abundance, and Al-Husayn<sup>asws</sup> and his<sup>asws</sup> companions, may Allah<sup>azwj</sup> be Pleased with them, were weakened during it, and they were convinced that no helper would be coming to Al-Husayn<sup>asws</sup> nor would the people of Al-Iraq support him<sup>asws</sup>. By my<sup>asws</sup> father<sup>asws</sup>, the oppressed, the alienated. ", "Then he<sup>asws</sup> said: ‘And as for the day of Ashura, so it is a day in which Al-Husayn<sup>asws</sup> was injured to bits between his<sup>asws</sup> companions, and his<sup>asws</sup> companions were injured to bits around him<sup>asws</sup>, stripped. So, can a Fast happen to be during that day? Never! By the Lord<sup>azwj</sup> of the Sacred House, it is not a day of Fasting, and it is not except for a day of grief, and the difficulties enter upon the inhabitants of the sky and the inhabitants of the earth, and the entirety of the Believers. ", "And, it is a day of happiness and joy for Ibn Marjana and the progeny of Ziyad, and the people of Syria. May Allah<sup>azwj</sup> be Wrathful upon them and upon their offspring. And, that is a day in which the entirety of the spots of the earth wailed upon him<sup>asws</sup> except for the spot of Syria. So the one who Fasts, or (believes to be) fortunate by it, Allah<sup>azwj</sup> would Resurrect him with the progeny of Ziyad, morphed of the heart, Angered upon; and the one who hoards provisions in his house, Allah<sup>azwj</sup> the Exalted would Cause his end result for hypocrisy to be in his heart up to the day he meets Him<sup>azwj</sup>, and Snatch away the Blessings from him, and from the people of his household, and his children, and the Satan<sup>la</sup> would be his participant in the entirety of that’."]}}]}, "index": "al-kafi:4:2:61", "kind": "verse_list"}