{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 68"
        },
        "path": "/books/al-kafi:4:2:68",
        "titles": {
          "ar": "بَابُ مَا يُزَادُ مِنَ الصَّلَاةِ فِي شَهْرِ رَمَضَانَ",
          "en": "Chapter 68 – What should be increased from the Prayer during the Month of Ramazan"
        }
      }
    ],
    "index": 928,
    "local_index": 68,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:68",
    "titles": {
      "ar": "بَابُ مَا يُزَادُ مِنَ الصَّلَاةِ فِي شَهْرِ رَمَضَانَ",
      "en": "Chapter 68 – What should be increased from the Prayer during the Month of Ramazan"
    },
    "verse_count": 6,
    "verse_start_index": 6576,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/377)"
        ],
        "index": 6577,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:68:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ دَخَلْنَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ أَبُو بَصِيرٍ مَا تَقُولُ فِي الصَّلَاةِ فِي شَهْرِ رَمَضَانَ فَقَالَ لِشَهْرِ رَمَضَانَ حُرْمَةٌ وَ حَقٌّ لَا يَشْبَهُهُ شَيْ‏ءٌ مِنَ الشُّهُورِ صَلِّ مَا اسْتَطَعْتَ فِي شَهْرِ رَمَضَانَ تَطَوُّعاً بِاللَّيْلِ وَ النَّهَارِ فَإِنِ اسْتَطَعْتَ أَنْ تُصَلِّيَ فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ أَلْفَ رَكْعَةٍ فَافْعَلْ إِنَّ عَلِيّاً ( عليه السلام ) فِي آخِرِ عُمُرِهِ كَانَ يُصَلِّي فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ أَلْفَ رَكْعَةٍ فَصَلِّ يَا أَبَا مُحَمَّدٍ زِيَادَةً فِي رَمَضَانَ ",
          "فَقُلْتُ كَمْ جُعِلْتُ فِدَاكَ فَقَالَ فِي عِشْرِينَ لَيْلَةً تُصَلِّي فِي كُلِّ لَيْلَةٍ عِشْرِينَ رَكْعَةً ثَمَانِيَ رَكَعَاتٍ قَبْلَ الْعَتَمَةِ وَ اثْنَتَا عَشْرَةَ رَكْعَةً بَعْدَهَا سِوَى مَا كُنْتَ تُصَلِّي قَبْلَ ذَلِكَ فَإِذَا دَخَلَ الْعَشْرُ الْأَوَاخِرُ فَصَلِّ ثَلَاثِينَ رَكْعَةً فِي كُلِّ لَيْلَةٍ ثَمَانِيَ رَكَعَاتٍ قَبْلَ الْعَتَمَةِ وَ اثْنَيْنِ وَ عِشْرِينَ رَكْعَةً بَعْدَهَا سِوَى مَا كُنْتَ تَفْعَلُ قَبْلَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘We went over to Abu Abdullah<sup>asws</sup>, so Abu Baseer said to him<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding the Prayer during the Month of Ramazan?’ So he<sup>asws</sup> said: ‘For the Month of Ramazan is a sanctity and a right. Nothing resembles it from the (other) months. Pray what you are able to during a Month of Ramazan, voluntarily at night, and the day. So, if you have the ability that you Pray a thousand Cycles every day and night, so do it. Ali<sup>asws</sup>, and the end of his<sup>asws</sup> life-span, used to Pray a thousand Cycles during each day and night. Therefore Pray, O Abu Muhammad, increasingly during Ramazan’.",
            "So I said, ‘How much? May I be sacrificed for you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘During twenty nights, you should Pray during every night, twenty Cycles - eight Cycles being before the dusk, and twelve Cycles after it, besides what you were Praying before. So when the last ten days come over, so Pray thirty Cycles during every night – eight Cycles being before the dusk, and twenty two Cycles being after it, besides what you were doing before that’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad, from al-Husayn ibn Sa‘id who has narrated it from al-Qasim ibn Muhammad, from Ali ibn abu Hamzah, from abu Basir who has said the following: “Once we visited abu ‘ Abd Allah, ‘Alayhi al-Salam, and abu Basir asked, ’What do you say about al- salat (prayer) during the month of Ramadan?’ He (the Imam) replied, ’The month of Ramadan has a special respect and right, unlike the other months. You should perform salat (prayer) as much as you can in optional forms during the nights and days. If you can, perform a thousand Rak’at salat (prayer) every twenty-four hours you can. Imam Ali, ‘Alayhi al-Salam, toward the end of his life would say one thousand Rak’at salat (prayer) in twenty-four hours. O abu Muhammad, you should perform more salat (prayer) during the month of Ramadan.’ I then asked, ’I pray to Allah to keep my soul in service for your cause, how many Rak’ats (should one perform)?’ He said, ’During the first twenty nights, say twenty Rak’ats each night; eight Rak’ats before al-‘Atmah (late evening) and twelve Rak’ats thereafter, besides the prayers you would say before. During the last ten days, you should say thirty Rak’at every night; eight Rak’at before late evening, and twenty-two Rak’ats thereafter besides what you had been saying before these nights.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/378)"
        ],
        "index": 6578,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:68:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ عَنْ أَبِي الْعَبَّاسِ الْبَقْبَاقِ وَ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَزِيدُ فِي صَلَاتِهِ فِي شَهْرِ رَمَضَانَ إِذَا صَلَّى الْعَتَمَةَ صَلَّى بَعْدَهَا فَيَقُومُ النَّاسُ خَلْفَهُ فَيَدْخُلُ وَ يَدَعُهُمْ ثُمَّ يَخْرُجُ أَيْضاً فَيَجِيئُونَ وَ يَقُومُونَ خَلْفَهُ فَيَدَعُهُمْ وَ يَدْخُلُ مِرَاراً",
          "قَالَ وَ قَالَ لَا تُصَلِّ بَعْدَ الْعَتَمَةِ فِي غَيْرِ شَهْرِ رَمَضَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Ubeyd, from Yunus, from Abu Al Abbas Al Baqbaan, and Ubeyd Bin Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> used to increase in his<sup>saww</sup> Prayers during a Month of Ramazan. When he<sup>saww</sup> Prayed at dusk, Prayed after it, so the people would be standing behind him<sup>saww</sup>. So he<sup>saww</sup> would enter (his<sup>saww</sup> chamber) and leave them. Then he<sup>saww</sup> would come out as well, so they would be coming, and they would be standing behind him<sup>saww</sup>. So he<sup>saww</sup> would leave them, and he<sup>saww</sup> would enter his<sup>saww</sup> chambers time and again’.",
            "He (the narrator) said, ‘And he<sup>asws</sup> said: ‘Do not Pray after the dusk during other than a Month of Ramazan’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from Yunus from abu al-‘Abbas al-Baqbaq and ‘Ubayd ibn Zurarah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would increase his salat (prayer) during the month of Ramadan. After al-‘Atmah (late evening salat [prayer]), he would perform more prayers. People behind would stand up (for prayer), but he would go inside and leave them. Then, after he came out, they would come and stand up behind him (for prayer), but he would leave them and go inside several times.’ He (the narrator) has said that the Imam then said, ‘You must not perform salat (prayer) after late evening prayer during the times other than the month of Ramadan.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/378)"
        ],
        "index": 6579,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:68:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا دَخَلَ الْعَشْرُ الْأَوَاخِرُ شَدَّ الْمِئْزَرَ وَ اجْتَنَبَ النِّسَاءَ وَ أَحْيَا اللَّيْلَ وَ تَفَرَّغَ لِلْعِبَادَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at, from Abu Baseer who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup>, whenever the last days (of a Month of Ramazan) entered, would tighten the gown, and keep away from the women, and revive the night, and be free for the worship’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Uthman from ibn ‘Isa from Sama‘ah from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, during the last ten days of the month of Ramadan would prepare himself well, stay away from women, stay awake the whole night, and free himself for worship.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/379)"
        ],
        "index": 6580,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:68:4",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْحَسَنِ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ قَالَ قَالَ أَبُو الْحَسَنِ ( عليه السلام ) صَلِّ لَيْلَةَ إِحْدَى وَ عِشْرِينَ وَ لَيْلَةَ ثَلَاثٍ وَ عِشْرِينَ مِائَةَ رَكْعَةٍ تَقْرَأُ فِي كُلِّ رَكْعَةٍ قُلْ هُوَ اللَّهُ أَحَدٌ عَشْرَ مَرَّاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Hassan, from Suleyman Al Ja’fary who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> said: ‘Pray one hundred Cycles the night of 21<sup>st</sup> and the night of 23<sup>rd</sup>, reciting in each Cycle, <span class=\"ibTxt\">[112:1] Say: He, Allah, is One</span> (the whole Chapter), ten times’."
          ],
          "en.sarwar": [
            "4. Ahmad ibn Muhammad has narrated from al-Husayn ibn Sa‘id from al-Hassan from Sulayman al-Ja’fariy who has said the following: “Abu al-Hassan, ‘Alayhi al-Salam, has said, ‘In the twenty- first and twenty-third nights, you should perform salat (prayer) of one hundred Rak’ats and in each Rak’at read Chapter 112 of the Holy Quran ten times.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/379)"
        ],
        "index": 6581,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:68:5",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي شُعَيْبٍ الْمَحَامِلِيِّ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ كَانَ أَبُو جَعْفَرٍ ( عليه السلام ) إِذَا كَانَتْ لَيْلَةُ إِحْدَى وَ عِشْرِينَ وَ لَيْلَةُ ثَلَاثٍ وَ عِشْرِينَ أَخَذَ فِي الدُّعَاءِ حَتَّى يَزُولَ اللَّيْلُ فَإِذَا زَالَ اللَّيْلُ صَلَّى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Salih Bin Abu Hammad, from Al Hassan Bin Ali, from Ibn Sinan, from Abu Shuayb Al Mahamily, from Hammad Bin Usman, from Al Fuzayl Bin Yasaar who said, ",
            "‘Abu Ja’far<sup>asws</sup>, whenever it was a night of the 21<sup>st</sup> and a night of the 23<sup>rd</sup> (of a Month of Ramazan), used to take to the supplication until the decline of the night. So when the night declined, he<sup>asws</sup> Prayed’."
          ],
          "en.sarwar": [
            "5. Ali ibn Muhammad has narrated from Salih ibn abu Hammad from al-Hassan ibn Ali from ibn Sinan from abu Shu’ayb al-Muhamiliy from Hammad ibn ‘Uthman from al-Fudayl ibn Yasar who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, during the twenty-first and twenty-third nights, would pray until the end of the night, then perform (the obligatory) salat (prayer).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/379)"
        ],
        "index": 6582,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:68:6",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ بْنِ مُطَهَّرٍ أَنَّهُ كَتَبَ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) يُخْبِرُهُ بِمَا جَاءَتْ بِهِ الرِّوَايَةُ أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) كَانَ يُصَلِّي فِي شَهْرِ رَمَضَانَ وَ غَيْرِهِ مِنَ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً مِنْهَا الْوَتْرُ وَ رَكْعَتَا الْفَجْرِ",
          "فَكَتَبَ ( عليه السلام ) فَضَّ اللَّهُ فَاهُ صَلَّى مِنْ شَهْرِ رَمَضَانَ فِي عِشْرِينَ لَيْلَةً كُلَّ لَيْلَةٍ عِشْرِينَ رَكْعَةً ثَمَانِيَ بَعْدَ الْمَغْرِبِ وَ اثْنَتَيْ عَشْرَةَ بَعْدَ الْعِشَاءَ الْآخِرَةِ وَ اغْتَسَلَ لَيْلَةَ تِسْعَ عَشْرَةَ وَ لَيْلَةَ إِحْدَى وَ عِشْرِينَ وَ لَيْلَةَ ثَلَاثٍ وَ عِشْرِينَ وَ صَلَّى فِيهِمَا ثَلَاثِينَ رَكْعَةً اثْنَتَيْ عَشْرَةَ بَعْدَ الْمَغْرِبِ وَ ثَمَانِيَ عَشْرَةَ بَعْدَ عِشَاءِ الْآخِرَةِ وَ صَلَّى فِيهِمَا مِائَةَ رَكْعَةٍ يَقْرَأُ فِي كُلِّ رَكْعَةٍ فَاتِحَةَ الْكِتَابِ وَ قُلْ هُوَ اللَّهُ أَحَدٌ عَشْرَ مَرَّاتٍ وَ صَلَّى إِلَى آخِرِ الشَّهْرِ كُلَّ لَيْلَةٍ ثَلَاثِينَ رَكْعَةً كَمَا فَسَّرْتُ لَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, ",
            "(It has been narrated) from Muhammad Bin Ahmad Bin Mutahhar who wrote to Abu Muhammad<sup>asws</sup> informing him<sup>asws</sup> with what had come with the reports that the Prophet<sup>saww</sup> used to Pray during a Month of Ramazan, and others, from the night, thirteen Cycles, from these was the solitary, and two Cycles of Al-Fajr’. ",
            "So he<sup>asws</sup> wrote: ‘May Allah<sup>azwj</sup> Break his mouth. He<sup>saww</sup> Prayed from a Month of Ramazan, during the twenty nights, each night twenty Cycles, eight being after Al-Magrib, and twelve after Al-Isha the last; and he<sup>saww</sup> bathed the night of 19<sup>th</sup>, and night of twenty first, and night of 23<sup>rd</sup>, and he<sup>saww</sup> Prayed in these thirty Cycles, twelve being after Al Maghrib, and eighteen being after Isha the last, and he<sup>saww</sup> Prayed one hundred Cycles in these, reciting in each Cycle, the Opening of the Book (Chapter 1), and <span class=\"ibTxt\">[112:1] Say: He, Allah, is One</span> (the whole Chapter), ten times, and he<sup>saww</sup> Prayed up to the end of the Month, each night, thirty Cycles, just as I<sup>asws</sup> have explained it to you’."
          ],
          "en.sarwar": [
            "6. “Ali ibn Muhammad has narrated from Muhammad ibn Ahmad ibn Mutahhar who wrote to abu Muhammad, ‘Alayhi al-Salam, and informed him (the Imam) about a Hadith about the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. It said that he (the Messenger of Allah) performed thirteen Rak‘at prayers including al-Witr and the two Rak‘at morning prayer during the nights in the month of Ramadan. He (the Imam) wrote, ‘May Allah break his (narrator’s) mouth. He (the Holy Prophet) during the month of Ramadan in the first twenty nights performed twenty Rak‘ats every night. He (the Messenger of Allah) performed eight Rak‘at after al-Maghrib prayer and twelve after ‘Isha’ (late evening) prayer. He would take a shower on the nineteenth, twenty-first and twenty-third nights. In those nights, he performed one hundred Rak‘at prayers in each Rak‘at, of which he read Chapter 1 and Chapter 112 of the Holy Quran ten times. He would perform thirty Rak‘at in the remaining nights to the end of the month, as I have explained for you.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:68",
  "kind": "verse_list"
}