{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:4:2", "titles": {"ar": "كِتَابُ الصِّيَامِ", "en": "THE BOOK OF FASTS (1)"}}, {"indexed_titles": {"en": "Chapter 69"}, "path": "/books/al-kafi:4:2:69", "titles": {"ar": "بَابٌ فِي لَيْلَةِ الْقَدْرِ", "en": "Chapter 69 – Regarding the Night of Pre-determnation (Laylat Al-Qadr)"}}], "index": 929, "local_index": 69, "part_type": "Chapter", "path": "/books/al-kafi:4:2:69", "titles": {"ar": "بَابٌ فِي لَيْلَةِ الْقَدْرِ", "en": "Chapter 69 – Regarding the Night of Pre-determnation (Laylat Al-Qadr)"}, "verse_count": 12, "verse_start_index": 6582, "verses": [{"index": 6583, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ حَسَّانَ بْنِ مِهْرَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ الْتَمِسْهَا فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ أَوْ لَيْلَةِ ثَلَاثٍ وَ عِشْرِينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Hassan Bin Mihran, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Night of Pre-determination, so he<sup>asws</sup> said: ‘Seek it during the night of the 21<sup>st</sup>, or the night of 23<sup>rd</sup>’."}]}, {"index": 6584, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:2", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ أَبُو بَصِيرٍ جُعِلْتُ فِدَاكَ اللَّيْلَةُ الَّتِي يُرْجَى فِيهَا مَا يُرْجَى فَقَالَ فِي إِحْدَى وَ عِشْرِينَ أَوْ ثَلَاثٍ وَ عِشْرِينَ قَالَ فَإِنْ لَمْ أَقْوَ عَلَى كِلْتَيْهِمَا فَقَالَ مَا أَيْسَرَ لَيْلَتَيْنِ فِيمَا تَطْلُبُ قُلْتُ فَرُبَّمَا رَأَيْنَا الْهِلَالَ عِنْدَنَا وَ جَاءَنَا مَنْ يُخْبِرُنَا بِخِلَافِ ذَلِكَ مِنْ أَرْضٍ أُخْرَى فَقَالَ مَا أَيْسَرَ أَرْبَعَ لَيَالٍ تَطْلُبُهَا فِيهَا\nقُلْتُ جُعِلْتُ فِدَاكَ لَيْلَةُ ثَلَاثٍ وَ عِشْرِينَ لَيْلَةُ الْجُهَنِيِّ فَقَالَ إِنَّ ذَلِكَ لَيُقَالُ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّ سُلَيْمَانَ بْنَ خَالِدٍ رَوَى فِي تِسْعَ عَشْرَةَ يُكْتَبُ وَفْدُ الْحَاجِّ فَقَالَ لِي يَا أَبَا مُحَمَّدٍ وَفْدُ الْحَاجِّ يُكْتَبُ فِي لَيْلَةِ الْقَدْرِ وَ الْمَنَايَا وَ الْبَلَايَا وَ الْأَرْزَاقُ وَ مَا يَكُونُ إِلَى مِثْلِهَا فِي قَابِلٍ فَاطْلُبْهَا فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ وَ ثَلَاثٍ وَ عِشْرِينَ وَ صَلِّ فِي كُلِّ وَاحِدَةٍ مِنْهُمَا مِائَةَ رَكْعَةٍ وَ أَحْيِهِمَا إِنِ اسْتَطَعْتَ إِلَى النُّورِ وَ اغْتَسِلْ فِيهِمَا\nقَالَ قُلْتُ فَإِنْ لَمْ أَقْدِرْ عَلَى ذَلِكَ وَ أَنَا قَائِمٌ قَالَ فَصَلِّ وَ أَنْتَ جَالِسٌ قُلْتُ فَإِنْ لَمْ أَسْتَطِعْ قَالَ فَعَلَى فِرَاشِكَ لَا عَلَيْكَ أَنْ تَكْتَحِلَ أَوَّلَ اللَّيْلِ بِشَيْ‏ءٍ مِنَ النَّوْمِ إِنَّ أَبْوَابَ السَّمَاءِ تُفَتَّحُ فِي رَمَضَانَ وَ تُصَفَّدُ الشَّيَاطِينُ وَ تُقْبَلُ أَعْمَالُ الْمُؤْمِنِينَ نِعْمَ الشَّهْرُ رَمَضَانُ كَانَ يُسَمَّى عَلَى عَهْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الْمَرْزُوقَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad Al Jowhary, from Ali Bin Abu Hamza Al Sumaly who said, \n‘I was in the presence of Abu Abdullah<sup>asws</sup>, so Abu Baseer said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The night during which one hopes for what is hoped for?’ So he<sup>asws</sup> said: ‘During the 21<sup>st</sup> or 23<sup>rd</sup>’. He said, ‘Supposing I am not strong enough upon both these nights?’ So he<sup>asws</sup> said: ‘What is easier than two nights regarding who you seek?’ I said, ‘Sometimes we see the crescent with us, and there come to us the ones who inform us with the opposite of that, from another land’. So he<sup>asws</sup> said; ‘What is easier than four nights for you to seek therein’. \nI said, ‘May I be sacrificed for you<sup>asws</sup>! The night of the 23<sup>rd</sup> is a night of Al-Juhanny’. So he<sup>asws</sup> said: ‘That is what it is called’. I said, ‘May I be sacrificed for you<sup>asws</sup>! Suleyman Bin Khalid is reporting regarding the 19<sup>th</sup> that the delegations of the Hajj are Ordained therein?’  So he<sup>asws</sup> said to me: ‘O Abu Muhammad! The delegations of the Hajj are Ordained during the night of the Pre-destination (Laylat Al-Qadr), and the immunities, and the afflictions, and the livelihoods and whatever is to transpire up to the like of it during the coming year. Therefore, seek in during the night of the 21<sup>st</sup>, and 23<sup>rd</sup>, and Pray during each one of these two, one hundred Cycles, and stay awake during it in accordance to your ability up to the daylight, and bathe during these two’. \nHe (the narrator) said, ‘I said: ‘Supposing I am not able upon that, and while standing (for the Prayer)?’ He<sup>asws</sup> said: ‘So Pray, while seated’. I said, ‘Supposing I am not able?’ He<sup>asws</sup> said: ‘So (Pray lying) upon your bed. It is not upon you that you indulge with something from the sleep during the beginning of the night. The Gateways of the skies are opened during Ramazan, and the devils are chained, and the deeds of the believers are Accepted. The best of the Months is Ramazan. It used to be referred to, in the era of Rasool-Allah<sup>azwj</sup>, as Al-Marzooq (The Month in which sustenance is Determined)’."}]}, {"index": 6585, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:3", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنْ عَلَامَةِ لَيْلَةِ الْقَدْرِ فَقَالَ عَلَامَتُهَا أَنْ تَطِيبَ رِيحُهَا وَ إِنْ كَانَتْ فِي بَرْدٍ دَفِئَتْ وَ إِنْ كَانَتْ فِي حَرٍّ بَرَدَتْ فَطَابَتْ \nقَالَ وَ سُئِلَ عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ تَنْزِلُ فِيهَا الْمَلَائِكَةُ وَ الْكَتَبَةُ إِلَى السَّمَاءِ الدُّنْيَا فَيَكْتُبُونَ مَا يَكُونُ فِي أَمْرِ السَّنَةِ وَ مَا يُصِيبُ الْعِبَادَ وَ أَمْرُهُ عِنْدَهُ مَوْقُوفٌ لَهُ وَ فِيهِ الْمَشِيئَةُ فَيُقَدِّمُ مِنْهُ مَا يَشَاءُ وَ يُؤَخِّرُ مِنْهُ مَا يَشَاءُ وَ يَمْحُو وَ يُثْبِتُ وَ عِنْدَهُ أُمُّ الْكِتَابِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, \n(It has been narrated) from one of the two (5<sup>th</sup> or 5<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about a sign of the Night of the Pre-determination. So he<sup>asws</sup> said: ‘It’s sign is that is wind is aromatic; and if it was during the cold (winter) it warms, and if it was during the hot (summer), it cools, and is pleasant’.\nHe (the narrator) said, ‘And I asked him<sup>asws</sup> about the Night of Pre-determination, so he<sup>asws</sup> said: ‘The Angels and the Scribes descend therein to the sky of the world, so they are writing what is to transpire regarding the matters of the year, and what would be hitting the servants. And, its Command is Reserved for Him<sup>azwj</sup>, and in it is the Desire. So, He<sup>azwj</sup> Brings forwards from it whatever He<sup>azwj</sup> so Desires to, and He<sup>azwj</sup> Delays from it whatever He<sup>azwj</sup> so Desires to, and He<sup>azwj</sup> <span class=\"ibTxt\">[13:39] Obliterates whatever He so Desires to and Establishes, and with Him is the Mother of the Book</span>’."}]}, {"index": 6586, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالُوا قَالَ لَهُ بَعْضُ أَصْحَابِنَا قَالَ وَ لَا أَعْلَمُهُ إِلَّا سَعِيداً السَّمَّانَ كَيْفَ يَكُونُ لَيْلَةُ الْقَدْرِ خَيْراً مِنْ أَلْفِ شَهْرٍ قَالَ الْعَمَلُ فِيهَا خَيْرٌ مِنَ الْعَمَلِ فِي أَلْفِ شَهْرٍ لَيْسَ فِيهَا لَيْلَةُ الْقَدْرِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from someone else, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘One of our companions said, and I don’t know (who it was) except for Saeed Al-Samman, ‘How come the Night of Pre-determination happens to be better than a thousand months?’ He<sup>asws</sup> said: ‘The deeds therein are better than the deeds during a thousand months wherein is ‘no’ Night of Pre-determination’."}]}, {"index": 6587, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ نَزَلَتِ التَّوْرَاةُ فِي سِتٍّ مَضَتْ مِنْ شَهْرِ رَمَضَانَ وَ نَزَلَ الْإِنْجِيلُ فِي اثْنَتَيْ عَشْرَةَ لَيْلَةً مَضَتْ مِنْ شَهْرِ رَمَضَانَ وَ نَزَلَ الزَّبُورُ فِي لَيْلَةِ ثَمَانِيَ عَشَرَةَ مَضَتْ مِنْ شَهْرِ رَمَضَانَ وَ نَزَلَ الْقُرْآنُ فِي لَيْلَةِ الْقَدْرِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Torah was Revealed during the 6<sup>th</sup> night from a Month of Ramazan, and the Evangel was Revealed during the 12<sup>th</sup> night of a Month of Ramazan, and the Psalms were Revealed during the 18<sup>th</sup> night of a Month of Ramazan, and the Quran was Revealed during the Night of Predetermination’."}]}, {"index": 6588, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنِ الْفُضَيْلِ وَ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ حُمْرَانَ أَنَّهُ سَأَلَ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّا أَنْزَلْناهُ فِي لَيْلَةٍ مُبارَكَةٍ قَالَ نَعَمْ لَيْلَةُ الْقَدْرِ وَ هِيَ فِي كُلِّ سَنَةٍ فِي شَهْرِ رَمَضَانَ فِي الْعَشْرِ الْأَوَاخِرِ فَلَمْ يُنْزَلِ الْقُرْآنُ إِلَّا فِي لَيْلَةِ الْقَدْرِ \nقَالَ اللَّهُ عَزَّ وَ جَلَّ فِيها يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ قَالَ يُقَدَّرُ فِي لَيْلَةِ الْقَدْرِ كُلُّ شَيْ‏ءٍ يَكُونُ فِي تِلْكَ السَّنَةِ إِلَى مِثْلِهَا مِنْ قَابِلٍ خَيْرٍ وَ شَرٍّ وَ طَاعَةٍ وَ مَعْصِيَةٍ وَ مَوْلُودٍ وَ أَجَلٍ أَوْ رِزْقٍ فَمَا قُدِّرَ فِي تِلْكَ السَّنَةِ وَ قُضِيَ فَهُوَ الْمَحْتُومُ وَ لِلَّهِ عَزَّ وَ جَلَّ فِيهِ الْمَشِيئَةُ \nقَالَ قُلْتُ لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ أَيُّ شَيْ‏ءٍ عُنِيَ بِذَلِكَ فَقَالَ الْعَمَلُ الصَّالِحُ فِيهَا مِنَ الصَّلَاةِ وَ الزَّكَاةِ وَ أَنْوَاعِ الْخَيْرِ خَيْرٌ مِنَ الْعَمَلِ فِي أَلْفِ شَهْرٍ لَيْسَ فِيهَا لَيْلَةُ الْقَدْرِ وَ لَوْ لَا مَا يُضَاعِفُ اللَّهُ تَبَارَكَ وَ تَعَالَى لِلْمُؤْمِنِينَ مَا بَلَغُوا وَ لَكِنَّ اللَّهَ يُضَاعِفُ لَهُمُ الْحَسَنَاتِ بِحُبِّنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Al Fuzayl, and Zurara, and Muhammad Bin Muslim, \n(It has been narrated) from Humran who asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[44:3] Surely We Revealed it on a Blessed Night surely We are ever Warning</span>. He<sup>asws</sup> said: ‘Yes. The Night of Pre-determination. And it (occurs) during every year in a Month of Ramazan, during the last ten days. So the Quran was not Revealed except during the Night of Pre-determination’. \nHe<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\">[44:4] Therein every wise affair is made distinct</span>. During the Night of Pre-determination, everything is Ordained, which is to transpire during that year up to its similar (night) from the coming year, be it good or evil, and obedience, and disobedience, and births, and terms (life-spans), or livelihoods. So, whatever is Determined during that year, and Ordained, so it is the inevitable, and for Allah<sup>azwj</sup> Mighty and Majestic therein is the Desire’. \nHe (the narrator) said, ‘I said, <span class=\"ibTxt\">[97:3] The Night of Predestination is better than a thousand months</span>. Which thing is Meant by that?’ So he<sup>asws</sup> said: ‘The righteous deeds therein, from the Prayer, and the Zakat, and the variety of the goodness, is better than the deed during a thousand months wherein is not Night of Pre-determination. And, had Allah<sup>azwj</sup> Blessed and High not Multiplied it for the Believers, they would not have reached (success). But, Allah<sup>azwj</sup> Multiplies the Rewards for them by our<sup>asws</sup> love’."}]}, {"index": 6589, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:7", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ السَّيَّارِيِّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ دَاوُدَ بْنِ فَرْقَدٍ قَالَ حَدَّثَنِي يَعْقُوبُ قَالَ سَمِعْتُ رَجُلًا يَسْأَلُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ أَخْبِرْنِي عَنْ لَيْلَةِ الْقَدْرِ كَانَتْ أَوْ تَكُونُ فِي كُلِّ عَامٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَوْ رُفِعَتْ لَيْلَةُ الْقَدْرِ لَرُفِعَ الْقُرْآنُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Sayyari, from one of our companions, from Dawood Bin Farqad who said, \n‘Yaqoub narrated to me saying, ‘I heard a man ask Abu Abdullah<sup>asws</sup> about the Night of Pre-determination, so he said, ‘Inform me about the Night of Pre-determination. Has it already occurred or would it be occurring during every year?’ So Abu Abdullah<sup>asws</sup> said: ‘Had Allah<sup>azwj</sup> Raised up the Night of Pre-determination, the Quran would have been Raised up’ (too)."}]}, {"index": 6590, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:8", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ الْمُؤْمِنِ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَمِعْتُهُ يَقُولُ وَ نَاسٌ يَسْأَلُونَهُ يَقُولُونَ الْأَرْزَاقُ تُقَسَّمُ لَيْلَةَ النِّصْفِ مِنْ شَعْبَانَ قَالَ فَقَالَ لَا وَ اللَّهِ مَا ذَاكَ إِلَّا فِي لَيْلَةِ تِسْعَ عَشْرَةَ مِنْ شَهْرِ رَمَضَانَ وَ إِحْدَى وَ عِشْرِينَ وَ ثَلَاثٍ وَ عِشْرِينَ فَإِنَّ فِي لَيْلَةِ تِسْعَ عَشْرَةَ يَلْتَقِي الْجَمْعَانِ وَ فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ وَ فِي لَيْلَةِ ثَلَاثٍ وَ عِشْرِينَ يُمْضَى مَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ مِنْ ذَلِكَ وَ هِيَ لَيْلَةُ الْقَدْرِ الَّتِي قَالَ اللَّهُ عَزَّ وَ جَلَّ خَيْرٌ مِنْ أَلْفِ شَهْرٍ \nقَالَ قُلْتُ مَا مَعْنَى قَوْلِهِ يَلْتَقِي الْجَمْعَانِ قَالَ يَجْمَعُ اللَّهُ فِيهَا مَا أَرَادَ مِنْ تَقْدِيمِهِ وَ تَأْخِيرِهِ وَ إِرَادَتِهِ وَ قَضَائِهِ \nقَالَ قُلْتُ فَمَا مَعْنَى يُمْضِيهِ فِي ثَلَاثٍ وَ عِشْرِينَ قَالَ إِنَّهُ يَفْرُقُهُ فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ وَ يَكُونُ لَهُ فِيهِ الْبَدَاءُ فَإِذَا كَانَتْ لَيْلَةُ ثَلَاثٍ وَ عِشْرِينَ أَمْضَاهُ فَيَكُونُ مِنَ الْمَحْتُومِ الَّذِي لَا يَبْدُو لَهُ فِيهِ تَبَارَكَ وَ تَعَالَى .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Abu Abdullah Al Momin, from Is’haq Bin Ammar who said, \n‘I heard him<sup>asws</sup> saying, and the people were saying that the livelihoods are distributed during the night of the middle of Shaban, so he<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>! That is not except during the night of the 19<sup>th</sup> of a Month of Ramazan, and 21<sup>st</sup>, and 23<sup>rd</sup>. So, during the night of the 19<sup>th</sup> the two parties meet; and during the night of the 21<sup>st</sup>, every wise affair is Made to be distinct; and during the night of the 23<sup>rd</sup> whatever Allah<sup>azwj</sup> has Intended, gets accomplished, and it is the Night of Pre-destination of which Allah<sup>azwj</sup> Mighty and Majestic has Said it is better than a thousand months’.\nHe (the narrator) said, ‘I said, ‘What is the Meaning of His<sup>azwj</sup> Worlds <span class=\"ibTxt\">[8:41] the day on which the two parties meet</span>?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Gathers therein whatever He<sup>azwj</sup> so Intends from its Bringing forward, and its Delaying, and His<sup>azwj</sup> intention, and His<sup>azwj</sup> Judgement’. \nHe (the narrator) said, ‘I said, ‘So what is the meaning of ‘It gets accomplished during the 23<sup>rd</sup>?’ He<sup>asws</sup> said: ‘It is Made to be distinct during the night of the 21<sup>st</sup>, and there happens to be the Change with regards to it. So when it is the night of the 23<sup>rd</sup>, it gets accomplished, so it happens to be from the inevitable, there be no change for it from the Blessed and High’."}]}, {"index": 6591, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:9", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) التَّقْدِيرُ فِي لَيْلَةِ تِسْعَ عَشْرَةَ وَ الْإِبْرَامُ فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ وَ الْإِمْضَاءُ فِي لَيْلَةِ ثَلَاثٍ وَ عِشْرِينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ibn Bukeyr, from Zurara who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘The Ordainment is during the night of the 19<sup>th</sup>, and the Confirmation is during the night of the 21<sup>st</sup>, and the accomplishment is during the night of the 23<sup>rd</sup>’."}]}, {"index": 6592, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:10", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ وَ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ عَلِيِّ بْنِ عِيسَى الْقَمَّاطِ عَنْ عَمِّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رَأَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي مَنَامِهِ بَنِي أُمَيَّةَ يَصْعَدُونَ عَلَى مِنْبَرِهِ مِنْ بَعْدِهِ وَ يُضِلُّونَ النَّاسَ عَنِ الصِّرَاطِ الْقَهْقَرَى فَأَصْبَحَ كَئِيباً حَزِيناً قَالَ فَهَبَطَ عَلَيْهِ جَبْرَئِيلُ ( عليه السلام ) فَقَالَ يَا رَسُولَ اللَّهِ مَا لِي أَرَاكَ كَئِيباً حَزِيناً قَالَ يَا جَبْرَئِيلُ إِنِّي رَأَيْتُ بَنِي أُمَيَّةَ فِي لَيْلَتِي هَذِهِ يَصْعَدُونَ مِنْبَرِي مِنْ بَعْدِي وَ يُضِلُّونَ النَّاسَ عَنِ الصِّرَاطِ الْقَهْقَرَى \nفَقَالَ وَ الَّذِي بَعَثَكَ بِالْحَقِّ نَبِيّاً إِنَّ هَذَا شَيْ‏ءٌ مَا اطَّلَعْتُ عَلَيْهِ فَعَرَجَ إِلَى السَّمَاءِ فَلَمْ يَلْبَثْ أَنْ نَزَلَ عَلَيْهِ بِآيٍ مِنَ الْقُرْآنِ يُؤْنِسُهُ بِهَا قَالَ أَ فَرَأَيْتَ إِنْ مَتَّعْناهُمْ سِنِينَ ثُمَّ جاءَهُمْ ما كانُوا يُوعَدُونَ ما أَغْنى عَنْهُمْ ما كانُوا يُمَتَّعُونَ وَ أَنْزَلَ عَلَيْهِ إِنَّا أَنْزَلْناهُ فِي لَيْلَةِ الْقَدْرِ وَ ما أَدْراكَ ما لَيْلَةُ الْقَدْرِ لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ جَعَلَ اللَّهُ عَزَّ وَ جَلَّ لَيْلَةَ الْقَدْرِ لِنَبِيِّهِ ( صلى الله عليه وآله ) خَيْراً مِنْ أَلْفِ شَهْرِ مُلْكِ بَنِي أُمَيَّةَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ali Bin Al Husayn, from Muhammad Bin Al Waleed and Muhammad Bin Ahmad, from Yunus Bin Yaqoub, from Ali Bin Isa Al Qammat, from his uncle, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> saw in his<sup>saww</sup> dream, the Clan of Umayya would be ascending upon his<sup>saww</sup> Pulpit from after him<sup>saww</sup>, and they were straying the people away from the Path back on their heels. So he<sup>saww</sup> became bleak and sad. So, Jibraeel<sup>as</sup> descended unto him<sup>saww</sup>, so he<sup>as</sup> said : ‘O Rasool-Allah<sup>saww</sup>! What is the matter I<sup>as</sup> see you<sup>saww</sup> as bleak, sad?’ He<sup>saww</sup> said: ‘O Jibraeel<sup>as</sup>! I<sup>saww</sup> saw the Clan of Umayya, during this night of mine<sup>saww</sup>, ascending my<sup>saww</sup> Pulpit from after me<sup>saww</sup>, and straying the people away from the Path, back upon their heels’. \nSo he<sup>as</sup> said: ‘By the One<sup>azwj</sup> Who Sent you<sup>saww</sup> with the Truth as a Prophet<sup>saww</sup>! This is what has been not been Notified unto me<sup>as</sup>’. So he<sup>as</sup> ascended to the sky, and it was not long before he<sup>as</sup> descended unto him<sup>saww</sup> with a Verse from the Quran, to comfort him<sup>saww</sup> with it. He<sup>as</sup> said: ‘<span class=\"ibTxt\">[26:205] Have you then considered if We were to let them enjoy themselves for years [26:206] Then there comes to them that with which they are threatened [26:207] That which they were made to enjoy shall not avail them?</span>. And there was Revealed unto him<sup>saww</sup> <span class=\"ibTxt\">[97:1] Surely We revealed it in the Night of Predestination [97:2] And what will make you realise what the Night of Predestination is?[97:3] The Night of Predestination is better than a thousand months</span>. Allah<sup>azwj</sup> Mighty and Majestic Made the Night of Pre-determination for His<sup>azwj</sup> Prophet<sup>saww</sup> to be better than a thousand months of the kingdom of the Clan of Umayya’."}]}, {"index": 6593, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:11", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي جَمِيلَةَ عَنْ رِفَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَيْلَةُ الْقَدْرِ هِيَ أَوَّلُ السَّنَةِ وَ هِيَ آخِرُهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ibn Fazal, from Abu Jameela, from Rafa’at, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The night of Pre-determination, it is the beginning of the year, and it is the end of it’."}]}, {"index": 6594, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:4:2:69:12", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ رَبِيعٍ الْمُسْلِيِّ وَ زِيَادِ بْنِ أَبِي الْحَلَّالِ ذَكَرَاهُ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي لَيْلَةِ تِسْعَ عَشْرَةَ مِنْ شَهْرِ رَمَضَانَ التَّقْدِيرُ وَ فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ الْقَضَاءُ وَ فِي لَيْلَةِ ثَلَاثٍ وَ عِشْرِينَ إِبْرَامُ مَا يَكُونُ فِي السَّنَةِ إِلَى مِثْلِهَا لِلَّهِ جَلَّ ثَنَاؤُهُ يَفْعَلُ مَا يَشَاءُ فِي خَلْقِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Al Hakam, from Rabie Al Musly and Ziyad Bin Abu Al Hallal, mentioning it from a man, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘During the night of the 19<sup>th</sup> of a Month of Ramazan is the Ordainment, and during the night of the 21<sup>st</sup> is the accomplishment, and during the night of the 23<sup>rd</sup> is confirmation of what would be transpiring during the year up it its like (next Night of Pre-determination). For Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Praise, is that He<sup>azwj</sup> Does whatever He<sup>azwj</sup> so Desires to regarding His<sup>azwj</sup> creatures’."}]}]}, "index": "al-kafi:4:2:69", "kind": "verse_list"}