{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 69"
        },
        "path": "/books/al-kafi:4:2:69",
        "titles": {
          "ar": "بَابٌ فِي لَيْلَةِ الْقَدْرِ",
          "en": "Chapter 69 – Regarding the Night of Pre-determnation (Laylat Al-Qadr)"
        }
      }
    ],
    "index": 929,
    "local_index": 69,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 70"
        },
        "path": "/books/al-kafi:4:2:70",
        "titles": {
          "ar": "بَابُ الدُّعَاءِ فِي الْعَشْرِ الْأَوَاخِرِ مِنْ شَهْرِ رَمَضَانَ",
          "en": "Chapter 70 – The Supplication during the last ten (days) of a Month of Ramazan"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 68"
        },
        "path": "/books/al-kafi:4:2:68",
        "titles": {
          "ar": "بَابُ مَا يُزَادُ مِنَ الصَّلَاةِ فِي شَهْرِ رَمَضَانَ",
          "en": "Chapter 68 – What should be increased from the Prayer during the Month of Ramazan"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:69",
    "titles": {
      "ar": "بَابٌ فِي لَيْلَةِ الْقَدْرِ",
      "en": "Chapter 69 – Regarding the Night of Pre-determnation (Laylat Al-Qadr)"
    },
    "verse_count": 12,
    "verse_start_index": 6582,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/380)"
        ],
        "index": 6583,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ حَسَّانَ بْنِ مِهْرَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ الْتَمِسْهَا فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ أَوْ لَيْلَةِ ثَلَاثٍ وَ عِشْرِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Hassan Bin Mihran, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Night of Pre-determination, so he<sup>asws</sup> said: ‘Seek it during the night of the 21<sup>st</sup>, or the night of 23<sup>rd</sup>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Sayf ibn ‘Amirah from Hassan ibn Mehran who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the night of destiny. He replied, ‘You should try to find it in the twenty- first or twenty-third nights (of the month of Ramadan).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/381)"
        ],
        "index": 6584,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:2",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ أَبُو بَصِيرٍ جُعِلْتُ فِدَاكَ اللَّيْلَةُ الَّتِي يُرْجَى فِيهَا مَا يُرْجَى فَقَالَ فِي إِحْدَى وَ عِشْرِينَ أَوْ ثَلَاثٍ وَ عِشْرِينَ قَالَ فَإِنْ لَمْ أَقْوَ عَلَى كِلْتَيْهِمَا فَقَالَ مَا أَيْسَرَ لَيْلَتَيْنِ فِيمَا تَطْلُبُ قُلْتُ فَرُبَّمَا رَأَيْنَا الْهِلَالَ عِنْدَنَا وَ جَاءَنَا مَنْ يُخْبِرُنَا بِخِلَافِ ذَلِكَ مِنْ أَرْضٍ أُخْرَى فَقَالَ مَا أَيْسَرَ أَرْبَعَ لَيَالٍ تَطْلُبُهَا فِيهَا",
          "قُلْتُ جُعِلْتُ فِدَاكَ لَيْلَةُ ثَلَاثٍ وَ عِشْرِينَ لَيْلَةُ الْجُهَنِيِّ فَقَالَ إِنَّ ذَلِكَ لَيُقَالُ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّ سُلَيْمَانَ بْنَ خَالِدٍ رَوَى فِي تِسْعَ عَشْرَةَ يُكْتَبُ وَفْدُ الْحَاجِّ فَقَالَ لِي يَا أَبَا مُحَمَّدٍ وَفْدُ الْحَاجِّ يُكْتَبُ فِي لَيْلَةِ الْقَدْرِ وَ الْمَنَايَا وَ الْبَلَايَا وَ الْأَرْزَاقُ وَ مَا يَكُونُ إِلَى مِثْلِهَا فِي قَابِلٍ فَاطْلُبْهَا فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ وَ ثَلَاثٍ وَ عِشْرِينَ وَ صَلِّ فِي كُلِّ وَاحِدَةٍ مِنْهُمَا مِائَةَ رَكْعَةٍ وَ أَحْيِهِمَا إِنِ اسْتَطَعْتَ إِلَى النُّورِ وَ اغْتَسِلْ فِيهِمَا",
          "قَالَ قُلْتُ فَإِنْ لَمْ أَقْدِرْ عَلَى ذَلِكَ وَ أَنَا قَائِمٌ قَالَ فَصَلِّ وَ أَنْتَ جَالِسٌ قُلْتُ فَإِنْ لَمْ أَسْتَطِعْ قَالَ فَعَلَى فِرَاشِكَ لَا عَلَيْكَ أَنْ تَكْتَحِلَ أَوَّلَ اللَّيْلِ بِشَيْ‏ءٍ مِنَ النَّوْمِ إِنَّ أَبْوَابَ السَّمَاءِ تُفَتَّحُ فِي رَمَضَانَ وَ تُصَفَّدُ الشَّيَاطِينُ وَ تُقْبَلُ أَعْمَالُ الْمُؤْمِنِينَ نِعْمَ الشَّهْرُ رَمَضَانُ كَانَ يُسَمَّى عَلَى عَهْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الْمَرْزُوقَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad Al Jowhary, from Ali Bin Abu Hamza Al Sumaly who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, so Abu Baseer said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The night during which one hopes for what is hoped for?’ So he<sup>asws</sup> said: ‘During the 21<sup>st</sup> or 23<sup>rd</sup>’. He said, ‘Supposing I am not strong enough upon both these nights?’ So he<sup>asws</sup> said: ‘What is easier than two nights regarding who you seek?’ I said, ‘Sometimes we see the crescent with us, and there come to us the ones who inform us with the opposite of that, from another land’. So he<sup>asws</sup> said; ‘What is easier than four nights for you to seek therein’. ",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! The night of the 23<sup>rd</sup> is a night of Al-Juhanny’. So he<sup>asws</sup> said: ‘That is what it is called’. I said, ‘May I be sacrificed for you<sup>asws</sup>! Suleyman Bin Khalid is reporting regarding the 19<sup>th</sup> that the delegations of the Hajj are Ordained therein?’  So he<sup>asws</sup> said to me: ‘O Abu Muhammad! The delegations of the Hajj are Ordained during the night of the Pre-destination (Laylat Al-Qadr), and the immunities, and the afflictions, and the livelihoods and whatever is to transpire up to the like of it during the coming year. Therefore, seek in during the night of the 21<sup>st</sup>, and 23<sup>rd</sup>, and Pray during each one of these two, one hundred Cycles, and stay awake during it in accordance to your ability up to the daylight, and bathe during these two’. ",
            "He (the narrator) said, ‘I said: ‘Supposing I am not able upon that, and while standing (for the Prayer)?’ He<sup>asws</sup> said: ‘So Pray, while seated’. I said, ‘Supposing I am not able?’ He<sup>asws</sup> said: ‘So (Pray lying) upon your bed. It is not upon you that you indulge with something from the sleep during the beginning of the night. The Gateways of the skies are opened during Ramazan, and the devils are chained, and the deeds of the believers are Accepted. The best of the Months is Ramazan. It used to be referred to, in the era of Rasool-Allah<sup>azwj</sup>, as Al-Marzooq (The Month in which sustenance is Determined)’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad has narrated from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad al-Jawhariy from Ali ibn abu Hamzah al-Thumaliy who has said the following: “Once I was in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam, when abu Basir asked, ‘I pray to Allah to keep my soul in service for your cause, when is the night during which one may hope that his wishes will come true?’ He (the Imam) replied, ‘It is in the twenty-first or twenty-third nights.’ He (abu Basir) then asked, ‘What happens if I cannot (stay awake) on both nights?’ He (the Imam) said, ‘(Remaining awake for) just two nights is not difficult with a view to realizing your wishes.’ I (the narrator) then said, ‘We may see the new moon on a certain time and then receive information that people have seen the new moon on a different day at another place.’ He (the Imam) said, ‘Remaining awake for four nights is not difficult with a view to realizing your wishes.’ I then said, ‘I pray to Allah to keep my soul in service for your cause, the twenty-third night is the night of al-Juhanniy.’ He (the Imam) said, ‘That is what it is called.’ I then said, ‘I pray to Allah to keep my soul in service for your cause, Sulayman ibn Khalid narrates that during the twenty-ninth night, the list of people (honored to) perform Hajj is prepared.’ He (the Imam) said, ‘O abu Muhammad, the list of people for Hajj is prepared during the night of destiny; so also are deaths, trials, sustenance and things that have to happen until the next night of destiny. You should try to pray for the realization of your wishes during the twenty-first or twenty-third nights. You should perform one hundred Rak‘at salat (prayer) during each of these nights and remain awake if you can, up to daylight, and take a shower during both nights.’ I (the narrator) then asked, ‘What should I do if I cannot do this in a standing position?’ He (the Imam) replied, ‘You can say it in a sitting position.’ I then asked, ‘What should I do if I cannot do this also?’ He said, ‘You can say it while in your bed. It does not matter if you just slept very lightly at the beginning of the night. The doors of the sky remain open during the month of Ramadan, Satans are nailed down, and the deeds of believing people are accepted. The month of Ramadan is a very good month. During the time of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, it was called “provider of sustenance”.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/383)"
        ],
        "index": 6585,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:3",
        "refs": {
          "Mentions": [
            "/books/quran:13:39"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنْ عَلَامَةِ لَيْلَةِ الْقَدْرِ فَقَالَ عَلَامَتُهَا أَنْ تَطِيبَ رِيحُهَا وَ إِنْ كَانَتْ فِي بَرْدٍ دَفِئَتْ وَ إِنْ كَانَتْ فِي حَرٍّ بَرَدَتْ فَطَابَتْ ",
          "قَالَ وَ سُئِلَ عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ تَنْزِلُ فِيهَا الْمَلَائِكَةُ وَ الْكَتَبَةُ إِلَى السَّمَاءِ الدُّنْيَا فَيَكْتُبُونَ مَا يَكُونُ فِي أَمْرِ السَّنَةِ وَ مَا يُصِيبُ الْعِبَادَ وَ أَمْرُهُ عِنْدَهُ مَوْقُوفٌ لَهُ وَ فِيهِ الْمَشِيئَةُ فَيُقَدِّمُ مِنْهُ مَا يَشَاءُ وَ يُؤَخِّرُ مِنْهُ مَا يَشَاءُ وَ يَمْحُو وَ يُثْبِتُ وَ عِنْدَهُ أُمُّ الْكِتَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 5<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about a sign of the Night of the Pre-determination. So he<sup>asws</sup> said: ‘It’s sign is that is wind is aromatic; and if it was during the cold (winter) it warms, and if it was during the hot (summer), it cools, and is pleasant’.",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the Night of Pre-determination, so he<sup>asws</sup> said: ‘The Angels and the Scribes descend therein to the sky of the world, so they are writing what is to transpire regarding the matters of the year, and what would be hitting the servants. And, its Command is Reserved for Him<sup>azwj</sup>, and in it is the Desire. So, He<sup>azwj</sup> Brings forwards from it whatever He<sup>azwj</sup> so Desires to, and He<sup>azwj</sup> Delays from it whatever He<sup>azwj</sup> so Desires to, and He<sup>azwj</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:13#h39\">[13:39]</a> Obliterates whatever He so Desires to and Establishes, and with Him is the Mother of the Book</span>’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn Muhammad has narrated from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “Once I asked one of the two Imam, ‘Alayhim al-Salam, about signs of the night of destiny. He replied, ‘One of the signs of this night is sweet fragrance; during the cold season it is warm, and during the hot season it is cool and pleasant.’ Someone asked him about the night of destiny. He (the Imam) replied, ‘The angels and scribes come down to the sky above the world and then they write down all that has to happen during the year and what people will experience therein. Its affairs are withheld with Him. In it He has a wish and thus He brings forward whatever He wishes or delays whatever He wishes. He confirms whatever He wishes and deletes whatever He wishes; the mother book is with Him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/383)"
        ],
        "index": 6586,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالُوا قَالَ لَهُ بَعْضُ أَصْحَابِنَا قَالَ وَ لَا أَعْلَمُهُ إِلَّا سَعِيداً السَّمَّانَ كَيْفَ يَكُونُ لَيْلَةُ الْقَدْرِ خَيْراً مِنْ أَلْفِ شَهْرٍ قَالَ الْعَمَلُ فِيهَا خَيْرٌ مِنَ الْعَمَلِ فِي أَلْفِ شَهْرٍ لَيْسَ فِيهَا لَيْلَةُ الْقَدْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from someone else, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘One of our companions said, and I don’t know (who it was) except for Saeed Al-Samman, ‘How come the Night of Pre-determination happens to be better than a thousand months?’ He<sup>asws</sup> said: ‘The deeds therein are better than the deeds during a thousand months wherein is ‘no’ Night of Pre-determination’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from more than one person who have said the following: “Certain individuals of our people - the only one of these people I know is Sa‘id al-Samman- asked abu ‘ Abd Allah, ‘Alayhi al-Salam, ‘Why is it that the night of destiny is better than one thousand months? 5 He (the Imam) replied, ‘It is because doing good deeds during this night is better than doing good deeds in one thousand months that do not have the night of destiny.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/384)"
        ],
        "index": 6587,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ نَزَلَتِ التَّوْرَاةُ فِي سِتٍّ مَضَتْ مِنْ شَهْرِ رَمَضَانَ وَ نَزَلَ الْإِنْجِيلُ فِي اثْنَتَيْ عَشْرَةَ لَيْلَةً مَضَتْ مِنْ شَهْرِ رَمَضَانَ وَ نَزَلَ الزَّبُورُ فِي لَيْلَةِ ثَمَانِيَ عَشَرَةَ مَضَتْ مِنْ شَهْرِ رَمَضَانَ وَ نَزَلَ الْقُرْآنُ فِي لَيْلَةِ الْقَدْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Torah was Revealed during the 6<sup>th</sup> night from a Month of Ramazan, and the Evangel was Revealed during the 12<sup>th</sup> night of a Month of Ramazan, and the Psalms were Revealed during the 18<sup>th</sup> night of a Month of Ramazan, and the Quran was Revealed during the Night of Predetermination’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Torah was revealed during the sixth night of the month of Ramadan. Injil (New Testament) was revealed during the twelfth night of the month of Ramadan. Al-Zabbur, (Psalms) was revealed during the eighteenth night of the month of Ramadan; and the Holy Quran was revealed during the night of destiny.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/385)"
        ],
        "index": 6588,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:6",
        "refs": {
          "Mentions": [
            "/books/quran:44:3",
            "/books/quran:97:3",
            "/books/quran:44:4"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنِ الْفُضَيْلِ وَ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ حُمْرَانَ أَنَّهُ سَأَلَ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّا أَنْزَلْناهُ فِي لَيْلَةٍ مُبارَكَةٍ قَالَ نَعَمْ لَيْلَةُ الْقَدْرِ وَ هِيَ فِي كُلِّ سَنَةٍ فِي شَهْرِ رَمَضَانَ فِي الْعَشْرِ الْأَوَاخِرِ فَلَمْ يُنْزَلِ الْقُرْآنُ إِلَّا فِي لَيْلَةِ الْقَدْرِ ",
          "قَالَ اللَّهُ عَزَّ وَ جَلَّ فِيها يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ قَالَ يُقَدَّرُ فِي لَيْلَةِ الْقَدْرِ كُلُّ شَيْ‏ءٍ يَكُونُ فِي تِلْكَ السَّنَةِ إِلَى مِثْلِهَا مِنْ قَابِلٍ خَيْرٍ وَ شَرٍّ وَ طَاعَةٍ وَ مَعْصِيَةٍ وَ مَوْلُودٍ وَ أَجَلٍ أَوْ رِزْقٍ فَمَا قُدِّرَ فِي تِلْكَ السَّنَةِ وَ قُضِيَ فَهُوَ الْمَحْتُومُ وَ لِلَّهِ عَزَّ وَ جَلَّ فِيهِ الْمَشِيئَةُ ",
          "قَالَ قُلْتُ لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ أَيُّ شَيْ‏ءٍ عُنِيَ بِذَلِكَ فَقَالَ الْعَمَلُ الصَّالِحُ فِيهَا مِنَ الصَّلَاةِ وَ الزَّكَاةِ وَ أَنْوَاعِ الْخَيْرِ خَيْرٌ مِنَ الْعَمَلِ فِي أَلْفِ شَهْرٍ لَيْسَ فِيهَا لَيْلَةُ الْقَدْرِ وَ لَوْ لَا مَا يُضَاعِفُ اللَّهُ تَبَارَكَ وَ تَعَالَى لِلْمُؤْمِنِينَ مَا بَلَغُوا وَ لَكِنَّ اللَّهَ يُضَاعِفُ لَهُمُ الْحَسَنَاتِ بِحُبِّنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Al Fuzayl, and Zurara, and Muhammad Bin Muslim, ",
            "(It has been narrated) from Humran who asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:44#h3\">[44:3]</a> Surely We Revealed it on a Blessed Night surely We are ever Warning</span>. He<sup>asws</sup> said: ‘Yes. The Night of Pre-determination. And it (occurs) during every year in a Month of Ramazan, during the last ten days. So the Quran was not Revealed except during the Night of Pre-determination’. ",
            "He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\"><a href=\"/#/books/quran:44#h4\">[44:4]</a> Therein every wise affair is made distinct</span>. During the Night of Pre-determination, everything is Ordained, which is to transpire during that year up to its similar (night) from the coming year, be it good or evil, and obedience, and disobedience, and births, and terms (life-spans), or livelihoods. So, whatever is Determined during that year, and Ordained, so it is the inevitable, and for Allah<sup>azwj</sup> Mighty and Majestic therein is the Desire’. ",
            "He (the narrator) said, ‘I said, <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h3\">[97:3]</a> The Night of Predestination is better than a thousand months</span>. Which thing is Meant by that?’ So he<sup>asws</sup> said: ‘The righteous deeds therein, from the Prayer, and the Zakat, and the variety of the goodness, is better than the deed during a thousand months wherein is not Night of Pre-determination. And, had Allah<sup>azwj</sup> Blessed and High not Multiplied it for the Believers, they would not have reached (success). But, Allah<sup>azwj</sup> Multiplies the Rewards for them by our<sup>asws</sup> love’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah from al-Fudayl, Zurarah and Muhammad ibn Muslim from Humran who has narrated the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the following words of Allah, the Most Majestic, the Most Glorious: ‘We have revealed it during the blessed night.’ <a href=\"/#/books/quran:44#h3\">[44:3]</a> He (the Imam) said, ‘Yes, it is the night of destiny. Every year this night is during the last ten days in the month of Ramadan. It was the night of destiny and no other night when the Holy Quran was revealed. Allah, the Most Majestic, the Most Glorious, has said, “During this night all matters of wisdom are differentiated.’” <a href=\"/#/books/quran:44#h4\">[44:4]</a> He (Imam) said, ‘During the night of destiny, all things of good or evil, obedience or disobedience, birth or death, or sustenance that are to take place in the year up to the next month of Ramadan, are measured and determined. Whatever is measured and determined for that year becomes inevitable; however, Allah, the Most Majestic, the Most Glorious, has a wish in it.’ He (the narrator) has said, ‘I then asked about the meaning of, “The night of destiny is better than one thousand nights?”’ He (Imam) replied, ‘Good deeds like salat (prayer), zakat and other forms of good are better than good deeds done in one thousand months wherein the night of destiny does not exist. Had it not been for the generosity of Allah, the most Blessed, the most High, toward the believing people, they could not gain any success, but Allah increases their good deeds (through our love).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/386)"
        ],
        "index": 6589,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ السَّيَّارِيِّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ دَاوُدَ بْنِ فَرْقَدٍ قَالَ حَدَّثَنِي يَعْقُوبُ قَالَ سَمِعْتُ رَجُلًا يَسْأَلُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ أَخْبِرْنِي عَنْ لَيْلَةِ الْقَدْرِ كَانَتْ أَوْ تَكُونُ فِي كُلِّ عَامٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَوْ رُفِعَتْ لَيْلَةُ الْقَدْرِ لَرُفِعَ الْقُرْآنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Sayyari, from one of our companions, from Dawood Bin Farqad who said, ",
            "‘Yaqoub narrated to me saying, ‘I heard a man ask Abu Abdullah<sup>asws</sup> about the Night of Pre-determination, so he said, ‘Inform me about the Night of Pre-determination. Has it already occurred or would it be occurring during every year?’ So Abu Abdullah<sup>asws</sup> said: ‘Had Allah<sup>azwj</sup> Raised up the Night of Pre-determination, the Quran would have been Raised up’ (too)."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from af-Sayyariy from certain individuals of our people from Dawud ibn Farqad who has said that narrated to him Ya’qub who has said the following: “I once heard a man asking abu ‘Abd Allah, ‘Alayhi al-Salam, about the night of destiny, saying, ‘Please tell me about the night of destiny. Was it only just for one night, or it comes every year?’ Abu ‘Abd Allah, ‘Alayhi al-Salam, replied, ‘Had the night of destiny been removed, most certainly, the Holy Quran would also had been removed.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/387)"
        ],
        "index": 6590,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:8",
        "refs": {
          "Mentions": [
            "/books/quran:8:41"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ الْمُؤْمِنِ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَمِعْتُهُ يَقُولُ وَ نَاسٌ يَسْأَلُونَهُ يَقُولُونَ الْأَرْزَاقُ تُقَسَّمُ لَيْلَةَ النِّصْفِ مِنْ شَعْبَانَ قَالَ فَقَالَ لَا وَ اللَّهِ مَا ذَاكَ إِلَّا فِي لَيْلَةِ تِسْعَ عَشْرَةَ مِنْ شَهْرِ رَمَضَانَ وَ إِحْدَى وَ عِشْرِينَ وَ ثَلَاثٍ وَ عِشْرِينَ فَإِنَّ فِي لَيْلَةِ تِسْعَ عَشْرَةَ يَلْتَقِي الْجَمْعَانِ وَ فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ وَ فِي لَيْلَةِ ثَلَاثٍ وَ عِشْرِينَ يُمْضَى مَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ مِنْ ذَلِكَ وَ هِيَ لَيْلَةُ الْقَدْرِ الَّتِي قَالَ اللَّهُ عَزَّ وَ جَلَّ خَيْرٌ مِنْ أَلْفِ شَهْرٍ ",
          "قَالَ قُلْتُ مَا مَعْنَى قَوْلِهِ يَلْتَقِي الْجَمْعَانِ قَالَ يَجْمَعُ اللَّهُ فِيهَا مَا أَرَادَ مِنْ تَقْدِيمِهِ وَ تَأْخِيرِهِ وَ إِرَادَتِهِ وَ قَضَائِهِ ",
          "قَالَ قُلْتُ فَمَا مَعْنَى يُمْضِيهِ فِي ثَلَاثٍ وَ عِشْرِينَ قَالَ إِنَّهُ يَفْرُقُهُ فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ وَ يَكُونُ لَهُ فِيهِ الْبَدَاءُ فَإِذَا كَانَتْ لَيْلَةُ ثَلَاثٍ وَ عِشْرِينَ أَمْضَاهُ فَيَكُونُ مِنَ الْمَحْتُومِ الَّذِي لَا يَبْدُو لَهُ فِيهِ تَبَارَكَ وَ تَعَالَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Abu Abdullah Al Momin, from Is’haq Bin Ammar who said, ",
            "‘I heard him<sup>asws</sup> saying, and the people were saying that the livelihoods are distributed during the night of the middle of Shaban, so he<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>! That is not except during the night of the 19<sup>th</sup> of a Month of Ramazan, and 21<sup>st</sup>, and 23<sup>rd</sup>. So, during the night of the 19<sup>th</sup> the two parties meet; and during the night of the 21<sup>st</sup>, every wise affair is Made to be distinct; and during the night of the 23<sup>rd</sup> whatever Allah<sup>azwj</sup> has Intended, gets accomplished, and it is the Night of Pre-destination of which Allah<sup>azwj</sup> Mighty and Majestic has Said it is better than a thousand months’.",
            "He (the narrator) said, ‘I said, ‘What is the Meaning of His<sup>azwj</sup> Worlds <span class=\"ibTxt\"><a href=\"/#/books/quran:8#h41\">[8:41]</a> the day on which the two parties meet</span>?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Gathers therein whatever He<sup>azwj</sup> so Intends from its Bringing forward, and its Delaying, and His<sup>azwj</sup> intention, and His<sup>azwj</sup> Judgement’. ",
            "He (the narrator) said, ‘I said, ‘So what is the meaning of ‘It gets accomplished during the 23<sup>rd</sup>?’ He<sup>asws</sup> said: ‘It is Made to be distinct during the night of the 21<sup>st</sup>, and there happens to be the Change with regards to it. So when it is the night of the 23<sup>rd</sup>, it gets accomplished, so it happens to be from the inevitable, there be no change for it from the Blessed and High’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Muhammad ibn ‘Isa from abu ‘Abd Allah al-Mu’min from Ishaq ibn ‘Ammar who has said the following: “I heard him (the Imam) say- when people said, “Sustenance is divided during the night in the middle of the month of Sha‘ban”-, ‘No, by Allah, that is in no other time besides the nineteenth night of the month of Ramadan, or the twenty-first or twenty-third night of this month. During the nineteenth night of this month, two groups meet; in the twenty-first night, all matters of wisdom are differentiated; and in the twenty-third night, whatever Allah, the Most Majestic, the Most Glorious, wishes of such matters is approved. It is the night of destiny about which Allah, the Most Majestic, the Most Glorious, has said, . . the night of destiny is better than one thousand months.’” He (the narrator) has said, ‘I then asked about the meaning of his words, “Two groups meet”?’ He (the Imam) replied, ‘Allah brings together in that night what He has decided, in matters to be brought forward or delayed, to decide or to approve it.’ I then said, ‘What is the meaning of, “approves it during the twenty-third night”?’ He (the Imam) replied, ‘During the twenty-first night, He differentiates the rule. Then al- Bada’ may take place, therefore, in the twenty-third night is the approval and thus it becomes inevitable in such issues where al-Bada’ does not happen, Allah is most Blessed, the most High.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/388)"
        ],
        "index": 6591,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) التَّقْدِيرُ فِي لَيْلَةِ تِسْعَ عَشْرَةَ وَ الْإِبْرَامُ فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ وَ الْإِمْضَاءُ فِي لَيْلَةِ ثَلَاثٍ وَ عِشْرِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ibn Bukeyr, from Zurara who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The Ordainment is during the night of the 19<sup>th</sup>, and the Confirmation is during the night of the 21<sup>st</sup>, and the accomplishment is during the night of the 23<sup>rd</sup>’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ibn Bukayr from Zurarah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Measurement and determination is on the night of the nineteenth, verification is on the twenty- first night and final approval is on the twenty-third night.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/388)"
        ],
        "index": 6592,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:10",
        "refs": {
          "Mentions": [
            "/books/quran:26:207",
            "/books/quran:26:206",
            "/books/quran:26:205",
            "/books/quran:97:3",
            "/books/quran:97:1",
            "/books/quran:97:2"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ وَ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ عَلِيِّ بْنِ عِيسَى الْقَمَّاطِ عَنْ عَمِّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رَأَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي مَنَامِهِ بَنِي أُمَيَّةَ يَصْعَدُونَ عَلَى مِنْبَرِهِ مِنْ بَعْدِهِ وَ يُضِلُّونَ النَّاسَ عَنِ الصِّرَاطِ الْقَهْقَرَى فَأَصْبَحَ كَئِيباً حَزِيناً قَالَ فَهَبَطَ عَلَيْهِ جَبْرَئِيلُ ( عليه السلام ) فَقَالَ يَا رَسُولَ اللَّهِ مَا لِي أَرَاكَ كَئِيباً حَزِيناً قَالَ يَا جَبْرَئِيلُ إِنِّي رَأَيْتُ بَنِي أُمَيَّةَ فِي لَيْلَتِي هَذِهِ يَصْعَدُونَ مِنْبَرِي مِنْ بَعْدِي وَ يُضِلُّونَ النَّاسَ عَنِ الصِّرَاطِ الْقَهْقَرَى ",
          "فَقَالَ وَ الَّذِي بَعَثَكَ بِالْحَقِّ نَبِيّاً إِنَّ هَذَا شَيْ‏ءٌ مَا اطَّلَعْتُ عَلَيْهِ فَعَرَجَ إِلَى السَّمَاءِ فَلَمْ يَلْبَثْ أَنْ نَزَلَ عَلَيْهِ بِآيٍ مِنَ الْقُرْآنِ يُؤْنِسُهُ بِهَا قَالَ أَ فَرَأَيْتَ إِنْ مَتَّعْناهُمْ سِنِينَ ثُمَّ جاءَهُمْ ما كانُوا يُوعَدُونَ ما أَغْنى عَنْهُمْ ما كانُوا يُمَتَّعُونَ وَ أَنْزَلَ عَلَيْهِ إِنَّا أَنْزَلْناهُ فِي لَيْلَةِ الْقَدْرِ وَ ما أَدْراكَ ما لَيْلَةُ الْقَدْرِ لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ جَعَلَ اللَّهُ عَزَّ وَ جَلَّ لَيْلَةَ الْقَدْرِ لِنَبِيِّهِ ( صلى الله عليه وآله ) خَيْراً مِنْ أَلْفِ شَهْرِ مُلْكِ بَنِي أُمَيَّةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Husayn, from Muhammad Bin Al Waleed and Muhammad Bin Ahmad, from Yunus Bin Yaqoub, from Ali Bin Isa Al Qammat, from his uncle, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> saw in his<sup>saww</sup> dream, the Clan of Umayya would be ascending upon his<sup>saww</sup> Pulpit from after him<sup>saww</sup>, and they were straying the people away from the Path back on their heels. So he<sup>saww</sup> became bleak and sad. So, Jibraeel<sup>as</sup> descended unto him<sup>saww</sup>, so he<sup>as</sup> said : ‘O Rasool-Allah<sup>saww</sup>! What is the matter I<sup>as</sup> see you<sup>saww</sup> as bleak, sad?’ He<sup>saww</sup> said: ‘O Jibraeel<sup>as</sup>! I<sup>saww</sup> saw the Clan of Umayya, during this night of mine<sup>saww</sup>, ascending my<sup>saww</sup> Pulpit from after me<sup>saww</sup>, and straying the people away from the Path, back upon their heels’. ",
            "So he<sup>as</sup> said: ‘By the One<sup>azwj</sup> Who Sent you<sup>saww</sup> with the Truth as a Prophet<sup>saww</sup>! This is what has been not been Notified unto me<sup>as</sup>’. So he<sup>as</sup> ascended to the sky, and it was not long before he<sup>as</sup> descended unto him<sup>saww</sup> with a Verse from the Quran, to comfort him<sup>saww</sup> with it. He<sup>as</sup> said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:26#h205\">[26:205]</a> Have you then considered if We were to let them enjoy themselves for years <a href=\"/#/books/quran:26#h206\">[26:206]</a> Then there comes to them that with which they are threatened <a href=\"/#/books/quran:26#h207\">[26:207]</a> That which they were made to enjoy shall not avail them?</span>. And there was Revealed unto him<sup>saww</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h1\">[97:1]</a> Surely We revealed it in the Night of Predestination <a href=\"/#/books/quran:97#h2\">[97:2]</a> And what will make you realise what the Night of Predestination is?<a href=\"/#/books/quran:97#h3\">[97:3]</a> The Night of Predestination is better than a thousand months</span>. Allah<sup>azwj</sup> Mighty and Majestic Made the Night of Pre-determination for His<sup>azwj</sup> Prophet<sup>saww</sup> to be better than a thousand months of the kingdom of the Clan of Umayya’."
          ],
          "en.sarwar": [
            "10. Ahmad ibn Muhammad has narrated from Ali ibn al-Husayn from Muhammad ibn al-Walid and Muhammad ibn Ahmad from Yunus ibn Ya’qub from Ali ibn ’Isa al-Qammat from his uncle who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that in his dream, the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, saw banu ‘Umayyah climb on his pulpit after him and mislead people from the right path and take them backward. He remained sad and depressed. Jibril came and asked, ‘O Messenger of Allah, why are you sad and depressed?’ He replied, ‘O Jibril, in my dream last night, I saw banu ‘Umayyah climb my pulpit, mislead people from the right path and take them backward.’ He (Jibril) said, ‘I swear by the One who has sent you as a prophet in all truth that I have no information about this matter.’ The Messenger of Allah (Jibril) ascended to the heaven and, after a little while, came back with a verse of the Holy Quran to comfort him. “Consider, if We allow them to enjoy for a few years, then the thing about which they were warned comes upon them, and whatever they enjoyed will be of no benefit for them.” <a href=\"/#/books/quran:26#h205\">[26:205]</a> He revealed to him, “We have revealed the Holy Quran in the night of destiny. What do you think you know about the night of destiny? The night of destiny is better than one thousand months.’ Allah, the Most Majestic, the Most Glorious, has made the night of destiny better than one thousand months for His prophet. It (one thousand nights) is equal to the life of the kingdom of banu ‘Umayyah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/389)"
        ],
        "index": 6593,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي جَمِيلَةَ عَنْ رِفَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَيْلَةُ الْقَدْرِ هِيَ أَوَّلُ السَّنَةِ وَ هِيَ آخِرُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ibn Fazal, from Abu Jameela, from Rafa’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The night of Pre-determination, it is the beginning of the year, and it is the end of it’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from ibn Faddal from abu Jamilah from Rifa’ah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the night of destiny is the beginning of the year, and it also is the end of it (the year before).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/389)"
        ],
        "index": 6594,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:69:12",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ رَبِيعٍ الْمُسْلِيِّ وَ زِيَادِ بْنِ أَبِي الْحَلَّالِ ذَكَرَاهُ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي لَيْلَةِ تِسْعَ عَشْرَةَ مِنْ شَهْرِ رَمَضَانَ التَّقْدِيرُ وَ فِي لَيْلَةِ إِحْدَى وَ عِشْرِينَ الْقَضَاءُ وَ فِي لَيْلَةِ ثَلَاثٍ وَ عِشْرِينَ إِبْرَامُ مَا يَكُونُ فِي السَّنَةِ إِلَى مِثْلِهَا لِلَّهِ جَلَّ ثَنَاؤُهُ يَفْعَلُ مَا يَشَاءُ فِي خَلْقِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Al Hakam, from Rabie Al Musly and Ziyad Bin Abu Al Hallal, mentioning it from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘During the night of the 19<sup>th</sup> of a Month of Ramazan is the Ordainment, and during the night of the 21<sup>st</sup> is the accomplishment, and during the night of the 23<sup>rd</sup> is confirmation of what would be transpiring during the year up it its like (next Night of Pre-determination). For Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Praise, is that He<sup>azwj</sup> Does whatever He<sup>azwj</sup> so Desires to regarding His<sup>azwj</sup> creatures’."
          ],
          "en.sarwar": [
            "12. A number of our people have narrated, from Sahl ibn Ziyad, from Ali ibn al-Hakam, from Rabi’ al-Musliy and Ziyad ibn abu al- Hallal who have narrated it, from a man who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that during the nineteenth night of the month of Ramadan is measurement and determination; in the twenty-first night is decision; and in the twenty-third night is verification of what has to take place during the coming year up to the next night of destiny. Allah, glorious is whose praise, does whatever He wills about His creature.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:69",
  "kind": "verse_list"
}