{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 76"
        },
        "path": "/books/al-kafi:4:2:76",
        "titles": {
          "ar": "بَابُ الِاعْتِكَافِ ",
          "en": "Chapter 76 – The Itikaaf (Seclusion in the Masjid)"
        }
      }
    ],
    "index": 936,
    "local_index": 76,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 77"
        },
        "path": "/books/al-kafi:4:2:77",
        "titles": {
          "ar": "بَابُ أَنَّهُ لَا يَكُونُ الِاعْتِكَافُ إِلَّا بِصَوْمٍ",
          "en": "Chapter 77 – The Itikaaf (seclusion in the Masjid) does not take place except with Fasting"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 75"
        },
        "path": "/books/al-kafi:4:2:75",
        "titles": {
          "ar": "بَابُ الْفِطْرَةِ",
          "en": "Chapter 75 – The Fitra (Obligatory Zakat payable on the 1<sup>st</sup> Shawwal)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:76",
    "titles": {
      "ar": "بَابُ الِاعْتِكَافِ ",
      "en": "Chapter 76 – The Itikaaf (Seclusion in the Masjid)"
    },
    "verse_count": 3,
    "verse_start_index": 6638,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/426)"
        ],
        "index": 6639,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:76:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا كَانَ الْعَشْرُ الْأَوَاخِرُ اعْتَكَفَ فِي الْمَسْجِدِ وَ ضُرِبَتْ لَهُ قُبَّةٌ مِنْ شَعْرٍ وَ شَمَّرَ الْمِئْزَرَ وَ طَوَى فِرَاشَهُ وَ قَالَ بَعْضُهُمْ وَ اعْتَزَلَ النِّسَاءَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَمَّا اعْتِزَالُ النِّسَاءِ فَلَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup>, whenever it was the last ten (days of the Month of Ramazan), secluded in the Masjid, and a dome made of animal hair was set up for him<sup>saww</sup>, and he<sup>saww</sup> tightened his<sup>saww</sup> apron, and folded up his<sup>saww</sup> bed’. And one of them said, ‘And he<sup>saww</sup> isolated from the women’. So Abu Abdullah<sup>asws</sup> said: ‘As for isolating from the women, so no (he<sup>saww</sup> did not do so)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from af-Halabiy who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, in the last ten days of the month of Ramadan would retire in Masjid in seclusion for Ttikaf with a tent made of animals’ wool pitched for him. He (the Messenger of Allah) would secure his loincloth and fold up his bed (reduced sleeping). Certain others have said that he (the Messenger of Allah) stayed away from women; but Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Isolation from women was not true.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/426)"
        ],
        "index": 6640,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:76:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَتْ بَدْرٌ فِي شَهْرِ رَمَضَانَ فَلَمْ يَعْتَكِفْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَلَمَّا أَنْ كَانَ مِنْ قَابِلٍ اعْتَكَفَ عَشْرَيْنِ عَشْراً لِعَامِهِ وَ عَشْراً قَضَاءً لِمَا فَاتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘(The battle of) Badr was during a Month of Ramazan. So, Rasool-Allah<sup>saww</sup> did not seclude himself<sup>saww</sup>. So when it was the next year, he<sup>saww</sup> secluded himself<sup>saww</sup> for twenty nights – ten for his<sup>saww</sup> current year, and ten for making up to what was lost for him<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘(The battle of) Badr took place in the month of Ramadan. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, did not do Ttikaf. In the next year he performed Ttikaf for twenty days. Ten days were for the current year and ten days for Qada’ (compensatory) of the year before.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/427)"
        ],
        "index": 6641,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:76:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اعْتَكَفَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي شَهْرِ رَمَضَانَ فِي الْعَشْرِ الْأَوَّلِ ثُمَّ اعْتَكَفَ فِي الثَّانِيَةِ فِي الْعَشْرِ الْوُسْطَى ثُمَّ اعْتَكَفَ فِي الثَّالِثَةِ فِي الْعَشْرِ الْأَوَاخِرِ ثُمَّ لَمْ يَزَلْ يَعْتَكِفُ فِي الْعَشْرِ الْأَوَاخِرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad, from Dawood Bin Al Husayn, from Abu Al Abbas, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> secluded himself<sup>saww</sup> in a Month of Ramazan during the first ten. Then he<sup>saww</sup> secluded in the second year, during the middle ten, then secluded in the third year during the last ten. Then he<sup>saww</sup> did not cease to seclude during the last ten (every year)’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from Dawud ibn al-Huseen from abu al-‘Abbas who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, performed Ttikaf in the first ten days of the month of Ramadan. In the second year it was in the second ten days and then in the third year in the last ten days of the month of Ramadan. Thereafter it was all the time in the last ten days of the month of Ramadan.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:76",
  "kind": "verse_list"
}