{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:4:2", "titles": {"ar": "كِتَابُ الصِّيَامِ", "en": "THE BOOK OF FASTS (1)"}}, {"indexed_titles": {"en": "Chapter 79"}, "path": "/books/al-kafi:4:2:79", "titles": {"ar": "بَابُ أَقَلِّ مَا يَكُونُ الِاعْتِكَافُ", "en": "Chapter 79 – The least of what can be for the Itikaaf (Seclusion in the Masjid)"}}], "index": 939, "local_index": 79, "part_type": "Chapter", "path": "/books/al-kafi:4:2:79", "titles": {"ar": "بَابُ أَقَلِّ مَا يَكُونُ الِاعْتِكَافُ", "en": "Chapter 79 – The least of what can be for the Itikaaf (Seclusion in the Masjid)"}, "verse_count": 5, "verse_start_index": 6649, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6650, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:2:79:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ الْحَنَّاطِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ امْرَأَةٍ كَانَ زَوْجُهَا غَائِباً فَقَدِمَ وَ هِيَ مُعْتَكِفَةٌ بِإِذْنِ زَوْجِهَا فَخَرَجَتْ حِينَ بَلَغَهَا قُدُومُهُ مِنَ الْمَسْجِدِ إِلَى بَيْتِهَا فَتَهَيَّأَتْ لِزَوْجِهَا حَتَّى وَاقَعَهَا فَقَالَ إِنْ كَانَتْ خَرَجَتْ مِنَ الْمَسْجِدِ قَبْلَ أَنْ تَنْقَضِيَ ثَلَاثَةُ أَيَّامٍ وَ لَمْ تَكُنِ اشْتَرَطَتْ فِي اعْتِكَافِهَا فَإِنَّ عَلَيْهَا مَا عَلَى الْمُظَاهِرِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Wallad Al Hannat who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a woman whose husband was absent. So he came back and she was in <span class=\"iTxt\">Itikaaf</span> by the permission of her husband. So she went out from the Masjid back to her house, when news reached her of his return. So she adorned herself for her husband until he fell upon her. So he<sup>asws</sup> said: ‘If she has gone out from the Masjid before she had spent three days, and she had not stipulated (specified) in her <span class=\"iTxt\">Itikaaf</span>, so upon her would be (a penalty) what is upon the one who does <span class=\"iTxt\">Zihaar</span>’."]}}, {"index": 6651, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:2:79:2", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَكُونُ الِاعْتِكَافُ أَقَلَّ مِنْ ثَلَاثَةِ أَيَّامٍ وَ مَنِ اعْتَكَفَ صَامَ وَ يَنْبَغِي لِلْمُعْتَكِفِ إِذَا اعْتَكَفَ أَنْ يَشْتَرِطَ كَمَا يَشْتَرِطُ الَّذِي يُحْرِمُ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Ayoub, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Itikaaf</span> does not take place in less than three days, and the one who performs <span class=\"iTxt\">Itikaaf</span> should Fast; and it is befitting for the one performing <span class=\"iTxt\">Itikaaf</span> that when he does perform <span class=\"iTxt\">Itikaaf</span>, he should stipulate just as the one who wears an <span class=\"iTxt\">Ihraam</span> stipulates’ (if its for Umra or Hajj)."]}}, {"index": 6652, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:2:79:3", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا اعْتَكَفَ يَوْماً وَ لَمْ يَكُنِ اشْتَرَطَ فَلَهُ أَنْ يَخْرُجَ وَ يَفْسَخَ الِاعْتِكَافَ وَ إِنْ أَقَامَ يَوْمَيْنِ وَ لَمْ يَكُنِ اشْتَرَطَ فَلَيْسَ لَهُ أَنْ يَفْسَخَ اعْتِكَافَهُ حَتَّى يَمْضِيَ ثَلَاثَةُ أَيَّامٍ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Ayoub, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When one performs <span class=\"iTxt\">Itikaaf</span> for a day and there does not happen to be a stipulation, so it is for him that he goes out and terminate the <span class=\"iTxt\">Itikaaf</span>. And, if he were to stay for two days and there does not happen to be a stipulation, so it is not for him that he terminates his <span class=\"iTxt\">Itikaaf</span> until three days are past’."]}}, {"index": 6653, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:2:79:4", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْمُعْتَكِفُ لَا يَشَمُّ الطِّيبَ وَ لَا يَتَلَذَّذُ بِالرَّيْحَانِ وَ لَا يُمَارِي وَ لَا يَشْتَرِي وَ لَا يَبِيعُ ", "قَالَ وَ مَنِ اعْتَكَفَ ثَلَاثَةَ أَيَّامٍ فَهُوَ يَوْمَ الرَّابِعِ بِالْخِيَارِ إِنْ شَاءَ زَادَ ثَلَاثَةَ أَيَّامٍ أُخَرَ وَ إِنْ شَاءَ خَرَجَ مِنَ الْمَسْجِدِ فَإِنْ أَقَامَ يَوْمَيْنِ بَعْدَ الثَّلَاثَةِ فَلَا يَخْرُجُ مِنَ الْمَسْجِدِ حَتَّى يُتِمَّ ثَلَاثَةَ أَيَّامٍ أُخَرَ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Ayoub, from Abu Ubeyda, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The one performing <span class=\"iTxt\">Itikaaf</span> cannot smell the perfume, and cannot derive pleasure with the aromas, nor wrangle (arguments), nor buy, nor sell’.", "He<sup>asws</sup> said: ‘And the one who performs <span class=\"iTxt\">Itikaaf</span> for three days, so he would be with the choice on the fourth day. If he so desires to, he can increase three more days, but if he so desires to he can go out from the Masjid. So if he stays for two days after the (first) three, so he cannot go out from the Masjid until he completes the other three’."]}}, {"index": 6654, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:2:79:5", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ دَاوُدَ بْنِ سِرْحَانَ قَالَ بَدَأَنِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مِنْ غَيْرِ أَنْ أَسْأَلَهُ فَقَالَ الِاعْتِكَافُ ثَلَاثَةُ أَيَّامٍ يَعْنِي السُّنَّةَ إِنْ شَاءَ اللَّهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad, from dawood Bin Sirhan who said, ", "‘Abu Abdullah<sup>asws</sup> initiated me from without he asking him<sup>asws</sup>, so he<sup>asws</sup> said: ‘The <span class=\"iTxt\">Itikaaf</span> is for three days, meaning the Sunnah, Allah<sup>azwj</sup> Willing’."]}}]}, "index": "al-kafi:4:2:79", "kind": "verse_list"}