{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:4:2:9",
        "titles": {
          "ar": "بَابُ الْيَوْمِ الَّذِي يُشَكُّ فِيهِ مِنْ شَهْرِ رَمَضَانَ هُوَ أَوْ مِنْ شَعْبَانَ",
          "en": "Chapter 9 – The day in which there is doubt whether it is from the Month of Ramazan or from Shaban"
        }
      }
    ],
    "index": 869,
    "local_index": 9,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:4:2:10",
        "titles": {
          "ar": "بَابُ وُجُوهِ الصَّوْمِ ",
          "en": "Chapter 10 – Aspects of the Fast"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 8"
        },
        "path": "/books/al-kafi:4:2:8",
        "titles": {
          "ar": "بَابٌ",
          "en": "Chapter 8 – A Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:4:2",
        "titles": {
          "ar": "كِتَابُ الصِّيَامِ",
          "en": "THE BOOK OF FASTS (1)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:2:9",
    "titles": {
      "ar": "بَابُ الْيَوْمِ الَّذِي يُشَكُّ فِيهِ مِنْ شَهْرِ رَمَضَانَ هُوَ أَوْ مِنْ شَعْبَانَ",
      "en": "Chapter 9 – The day in which there is doubt whether it is from the Month of Ramazan or from Shaban"
    },
    "verse_count": 9,
    "verse_start_index": 6274,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/238)"
        ],
        "index": 6275,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:9:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حَمْزَةَ بْنِ يَعْلَى عَنْ زَكَرِيَّا بْنِ آدَمَ عَنِ الْكَاهِلِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْيَوْمِ الَّذِي يُشَكُّ فِيهِ مِنْ شَعْبَانَ قَالَ لَأَنْ أَصُومَ يَوْماً مِنْ شَعْبَانَ أَحَبُّ إِلَيَّ مِنْ أَنْ أُفْطِرَ يَوْماً مِنْ شَهْرِ رَمَضَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Hamza Bin Ya’la, from Zakariyya Bin Adam, from Al Kahily who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the day in which there is a doubt, it is from Shaban. He<sup>asws</sup> said: ‘If I<sup>asws</sup> were to Fast a day from Shaban, it would be more beloved to me<sup>asws</sup> than if I<sup>asws</sup> were to break the Fast of the Month of Ramazan’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Hamzah ibn Ya‘liy from Zakariya ibn Adam from al- Kahiliy who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of the day that is not known to be of the month of al-Sha’ban. He (the Imam) said, ’Fasting one day of the month of al-Sha’ban is more beloved to me than losing one day of the month of Ramadan.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/238)"
        ],
        "index": 6276,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:9:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ الْيَوْمِ الَّذِي يُشَكُّ فِيهِ مِنْ شَهْرِ رَمَضَانَ لَا يَدْرِي أَ هُوَ مِنْ شَعْبَانَ أَوْ مِنْ رَمَضَانَ فَصَامَهُ فَكَانَ مِنْ شَهْرِ رَمَضَانَ قَالَ هُوَ يَوْمٌ وُفِّقَ لَهُ وَ لَا قَضَاءَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Sama’at who said, ",
            "‘I asked him<sup>asws</sup> about the day in which there is a doubt, whether it is from the Month of Ramazan, one does not know whether it is from Shaban or from Ramazaan, so one Fasts it as if it was from the Month of Ramazan. He<sup>asws</sup> said: ‘It is a ‘يَوْمٌ وُفِّقَ’ day commensurate for him, and there is no fulfilment (making up for it) upon it’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Sama‘ah who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of the day which is doubtful of being of the month of Ramadan and one does not know if it is of al-Sha’ban or of the month of Ramadan. He fasts that day and it was of the month of Ramadan. He (the Imam) said, ‘It was a day when he fortunately fasted and there is no Qada’ (compensatory fast) upon him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/239)"
        ],
        "index": 6277,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:9:3",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَصُومُ الْيَوْمَ الَّذِي يَشُكُّ فِيهِ مِنْ شَهْرِ رَمَضَانَ فَيَكُونُ كَذَلِكَ فَقَالَ هُوَ شَيْ‏ءٌ وُفِّقَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Muawiya Bin Wahab who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The man Fasts the day in which there is doubt from the Month of Ramazan, so it happens to be that’. So he<sup>asws</sup> said: ‘It is a thing ‘وُفِّقَ’ commensurate for him’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu‘awiyah ibn Wahab who has said the following: “I once asked Abu `Abd Allah, ‘Alayhi al-Salam, about a man who fasts on a day which is doubtful of its being from al-Sha £ ban or of the month of Ramadan, and it happens to be of the month of Ramadan. He (the Imam) said, ‘It was something in which he was fortunate.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/239)"
        ],
        "index": 6278,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:9:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَبِي الصُّهْبَانِ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ رِبَاطٍ عَنْ سَعِيدٍ الْأَعْرَجِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي صُمْتُ الْيَوْمَ الَّذِي يُشَكُّ فِيهِ فَكَانَ مِنْ شَهْرِ رَمَضَانَ أَ فَأَقْضِيهِ قَالَ لَا هُوَ يَوْمٌ وُفِّقْتَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Abu Al Suhban, from Ali Bin Al Husayn Bin Rabaat, from Saeed Al a’araj who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I Fast the day wherein is a doubt, so it turns out to be from the Month of Ramaan. Shall I fulfil (make up for it)?’ He<sup>asws</sup> said: ‘No, it is a day commensurate for it’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn abu al-Suhban from Ali ibn al-Husayn ibn Ribat from Sa‘id al-’A‘raj who has said the following: “I once asked Abu `Abd Allah, ‘Alayhi al-Salam, ’I have fasted on the day which is doubtful about its being of al-Sha £ ban or of the month of Ramadan, if there is Qada’ (compensatory fast) upon me.’ He (the Imam) said, £ No, Qada’ (compensatory fast) is not obligatory on you and it was a day in which you had a fortunate chance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/239)"
        ],
        "index": 6279,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:9:5",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ أَبِي الصُّهْبَانِ عَنْ مُحَمَّدِ بْنِ بَكْرِ بْنِ جَنَاحٍ عَنْ عَلِيِّ بْنِ شَجَرَةَ عَنْ بَشِيرٍ النَّبَّالِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ صَوْمِ يَوْمِ الشَّكِّ فَقَالَ صُمْهُ فَإِنْ يَكُ مِنْ شَعْبَانَ كَانَ تَطَوُّعاً وَ إِنْ يَكُ مِنْ شَهْرِ رَمَضَانَ فَيَوْمٌ وُفِّقْتَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ibn Abu Al Suhban, from Muhammad Bin Bakr Bin Janah, from Ali Bin Shajara, from Bashir Al Nabbal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a Fast of the day of doubt. So he<sup>asws</sup> said: ‘Fast it. So, if it was from Shaban, it was a voluntary (Fast), and if it was from the Month of Ramazan, so it would be a commensurate day for it’."
          ],
          "en.sarwar": [
            "5. Ahmad ibn Muhammad from has narrated from ibn abu al-Suhban from Muhammad ibn Bakr ibn Janah from Ali ibn Shajarah from Bashir al-Nabbal who has said the following: “I once asked Abu `Abd Allah, ‘Alayhi al-Salam, about the case of a doubtful day. He (the Imam) said, ’Fast on such day, if it is of al-Sha £ ban, it is optional and if it is of the month of Ramadan then it is a day in which you have a fortunate chance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/239)"
        ],
        "index": 6280,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:9:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ صَامَ يَوْماً وَ لَا يَدْرِي أَ مِنْ شَهْرِ رَمَضَانَ هُوَ أَوْ مِنْ غَيْرِهِ فَجَاءَ قَوْمٌ فَشَهِدُوا أَنَّهُ كَانَ مِنْ شَهْرِ رَمَضَانَ فَقَالَ بَعْضُ النَّاسِ عِنْدَنَا لَا يُعْتَدُّ بِهِ فَقَالَ بَلَى فَقُلْتُ إِنَّهُمْ قَالُوا صُمْتَ وَ أَنْتَ لَا تَدْرِي أَ مِنْ شَهْرِ رَمَضَانَ هَذَا أَمْ مِنْ غَيْرِهِ فَقَالَ بَلَى فَاعْتَدَّ بِهِ ",
          "فَإِنَّمَا هُوَ شَيْ‏ءٌ وَفَّقَكَ اللَّهُ لَهُ إِنَّمَا يُصَامُ يَوْمُ الشَّكِّ مِنْ شَعْبَانَ وَ لَا يَصُومُهُ مِنْ شَهْرِ رَمَضَانَ لِأَنَّهُ قَدْ نُهِيَ أَنْ يَنْفَرِدَ الْإِنْسَانُ بِالصِّيَامِ فِي يَوْمِ الشَّكِّ وَ إِنَّمَا يَنْوِي مِنَ اللَّيْلَةِ أَنَّهُ يَصُومُ مِنْ شَعْبَانَ فَإِنْ كَانَ مِنْ شَهْرِ رَمَضَانَ أَجْزَأَ عَنْهُ بِتَفَضُّلِ اللَّهِ تَعَالَى وَ بِمَا قَدْ وَسَّعَ عَلَى عِبَادِهِ وَ لَوْ لَا ذَلِكَ لَهَلَكَ النَّاسُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man Fasts for a day, and he does not know whether it is from the Month of Ramazan or from other. So a group of people come over and they testify that it was from the Month of Ramazan’. So he said, ‘Some people are not reliable with us’. So he<sup>asws</sup> said: ‘Yes’. So I said, ‘They are saying, ‘Fast, and you don’t know whether this is from the Month of Ramazan or from some other’. So he<sup>asws</sup> said: ‘Yes, so hold with it. ",
            "But rather, it is something Allah<sup>azwj</sup> has Made it to be commensurate for him. But rather, he should be Fasting the day of doubt as being from Shaban, and he should not be Fasting it as being from the Month of Ramazan, because it is Forbidden that the human being should be solitary with the Fasts during the day of doubt, and rather he should make the intention that he is Fasting from Shaban. So, if it was from the Month of Ramazan, he would be sufficed from it by the Grace of Allah<sup>azwj</sup> the Exalted and with what He<sup>azwj</sup> has Extended upon His<sup>azwj</sup> servants, and had it not been for that, the human being would be destroyed’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah, who has said the following: “I once asked Abu `Abd Allah, ‘Alayhi al-Salam, about a man who fasts a day and does not know if it is of the month of Ramadan or if it is of other days. Then certain people come and testify that it is of the month of Ramadan. Certain people say that it is not reliable. He (the Imam) said, £ Yes, that is true.’ I then said that they say, ‘You fasted and did not know if it was of the month of Ramadan or of other days.’ He (the Imam) said, ’Yes, that is true. You can depend on it; it is something in which Allah granted you a fortunate chance. A doubtful day is fasted as that of al-Sha’ban and not as that of the month of Ramadan; he prohibited one’s fasting alone on a doubtful day. During the night one forms his intention to fast as a day of al-Sha’ban and if it happens to be of the month of Ramadan, it is sufficient for it by the favor from Allah, most High, because of the ease He has granted to His servants; otherwise, they would have been destroyed.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/241)"
        ],
        "index": 6281,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:9:7",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ رِفَاعَةَ عَنْ رَجُلٍ عَنْ أَبِي  عَبْدِ اللَّهِ ( عليه السلام ) قَالَ دَخَلْتُ عَلَى أَبِي الْعَبَّاسِ بِالْحِيرَةِ فَقَالَ يَا أَبَا عَبْدِ اللَّهِ مَا تَقُولُ فِي الصِّيَامِ الْيَوْمَ فَقُلْتُ ذَاكَ إِلَى الْإِمَامِ إِنْ صُمْتَ صُمْنَا وَ إِنْ أَفْطَرْتَ أَفْطَرْنَا فَقَالَ يَا غُلَامُ عَلَيَّ بِالْمَائِدَةِ فَأَكَلْتُ مَعَهُ وَ أَنَا أَعْلَمُ وَ اللَّهِ أَنَّهُ يَوْمٌ مِنْ شَهْرِ رَمَضَانَ فَكَانَ إِفْطَارِي يَوْماً وَ قَضَاؤُهُ أَيْسَرَ عَلَيَّ مِنْ أَنْ يُضْرَبَ عُنُقِي وَ لَا يُعْبَدَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Ali Bin Al-Hakam, from Rafa’at, from a man, from Abu Abdullah<sup>asws</sup> having said: ‘I<sup>asws</sup> went over to Abu Al-Abbas (the governor) at Al-Hira, so he said, ‘O Abu Abdullah<sup>asws</sup>! What are you<sup>asws</sup> saying regarding the Fasts of today?’ So I<sup>asws</sup> said, ‘That is up to the leader, if he Fasts, we will Fast, and if he breaks, we will break’. So he said, ‘O slave! (Come) to me with the meal!’ So I<sup>asws</sup> ate with him, and I<sup>asws</sup> knew, by Allah<sup>azwj</sup>, that it was a day from the Month of Ramazan. So my<sup>asws</sup> breaking a Fast for a day and fulfilling it (later) is easier upon me<sup>asws</sup> than if he were to strike off my<sup>asws</sup> neck, and Allah<sup>azwj</sup> is not worshipped’ (observing Taqeeya)."
          ],
          "en.sarwar": [
            "7. Sahl ibn Ziyad has narrated from Ali ibn al-Hakam from Rifa’ah from a man who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Once I went to abu al- ‘Abbas in al-Hirah and he asked, “O abu ‘Abd Allah, what do you say about today’s fast?” I replied, “It is up to the Imam to decide; if you fast we also fast, if you do not fast, we also will not fast.” He then said, “O slave, prepare the table.” I ate with him and I knew, by Allah, that it was a day of the month of Ramadan. My not fasting and instead Qada’ (compensatory fast) was easier for me than my neck being cut off and Allah is not worshipped.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/240)"
        ],
        "index": 6282,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:9:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عُبَيْسِ بْنِ هِشَامٍ عَنِ الْخَضِرِ بْنِ عَبْدِ الْمَلِكِ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْيَوْمِ الَّذِي يُشَكُّ فِيهِ فَإِنَّ النَّاسَ يَزْعُمُونَ أَنَّ مَنْ صَامَهُ بِمَنْزِلَةِ مَنْ أَفْطَرَ يَوْماً فِي شَهْرِ رَمَضَانَ فَقَالَ كَذَبُوا إِنْ كَانَ مِنْ شَهْرِ رَمَضَانَ فَهُوَ يَوْمٌ وُفِّقَ لَهُ وَ إِنْ كَانَ مِنْ غَيْرِهِ فَهُوَ بِمَنْزِلَةِ مَا مَضَى مِنَ الْأَيَّامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ubeys Bin Hisham, from Al Khizr Bin Abdul Malik, from Muhammad Bin Hakeym who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the day in which there is a doubt, so the people are alleging that the one who Fasts it would be at the status of the one who breaks a Fast during the Month of Ramazan’. So he<sup>asws</sup> said: ‘They are lying! If it was from the Month of Ramazan, so it would be a fortunate day for him, and if it was from others, so it is with a status of what has past from the days’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from ‘Ubays ibn Hisham from al-Hadramiy ibn ‘Abd al-Malik from Muhammad ibn Hakim who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of a day about which people have doubts. People think if one fasts on such a day, it is like destroying one day of fasting in the month of Ramadan. He (the Imam) said, ‘They have spoken a lie. If it is of the month of Ramadan, it is a fortunate chance for him; and if it is of other days then it is like any of the past days.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/240)"
        ],
        "index": 6283,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:2:9:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَيُّوبَ بْنِ نُوحٍ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ رَجُلٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ وَ هُوَ بِالْحِيرَةِ فِي زَمَانِ أَبِي الْعَبَّاسِ إِنِّي دَخَلْتُ عَلَيْهِ وَ قَدْ شَكَّ النَّاسُ فِي الصَّوْمِ وَ هُوَ وَ اللَّهِ مِنْ شَهْرِ رَمَضَانَ فَسَلَّمْتُ عَلَيْهِ فَقَالَ يَا أَبَا عَبْدِ اللَّهِ أَ صُمْتَ الْيَوْمَ فَقُلْتُ لَا وَ الْمَائِدَةُ بَيْنَ يَدَيْهِ قَالَ فَادْنُ فَكُلْ قَالَ فَدَنَوْتُ فَأَكَلْتُ قَالَ وَ قُلْتُ الصَّوْمُ مَعَكَ وَ الْفِطْرُ مَعَكَ",
          "فَقَالَ الرَّجُلُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) تُفْطِرُ يَوْماً مِنْ شَهْرِ رَمَضَانَ فَقَالَ إِي وَ اللَّهِ أَنْ أُفْطِرَ يَوْماً مِنْ شَهْرِ رَمَضَانَ أَحَبُّ إِلَيَّ مِنْ أَنْ يُضْرَبَ عُنُقِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Muhammad Bin Ahmad, from Ayoub Bin Nuh, from Al Abbas Bin Aamir, from Dawood Bin Al Husayn, from a man from our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said, and he<sup>asws</sup> was at Al-Hira during the era of Abu Al-Abbas (the governor): ‘And I<sup>asws</sup> went over to him, and the people had doubted regarding the Fast, and by Allah<sup>azwj</sup>, it was from the Day of Ramazan. So I<sup>asws</sup> greeted to him. So he said, ‘O Abu Abdullah<sup>asws</sup>! You<sup>asws</sup> have Fasted today?’ So I<sup>asws</sup> said: ‘No’, and the meal was in front of him. He said, ‘So approach, and eat’. So I<sup>asws</sup> approached, and ate’. He<sup>asws</sup> said: ‘And I said, ‘The Fasting is with you, and the breaking is with you’. ",
            "So the man said to Abu Abdullah<sup>asws</sup>, ‘You<sup>asws</sup> broke Fast in a day from the Month of Ramazan?’ So he<sup>asws</sup> said, ‘Yes, by Allah<sup>azwj</sup>! Breaking a Fast of a day from the Month of Ramazan is more beloved to me<sup>asws</sup> than if he were to strike off my<sup>asws</sup> neck’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ayyub ibn Nuh from al-‘ Abbas ibn ‘Amir from Dawud ibn al-Husayn from a man of our people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘I, in the time of abu al- ‘Abbas, once was in al-Hirah, when I went before him and people had doubts about the fast, and that day, by Allah, was of the month of Ramadan. I said Salam (the phrase of offering greeting of peace) to him and he asked, “O abu ‘Abd Allah, have you fasted today?” I replied, “No, I have not fasted;” the table was before him. He said, “Come close and eat.” He (the Imam) said, ‘I went close and ate, and said, “I fast with you and eat with you.’” A man then said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Did you eat on the day of the month of Ramadan?’ He (the Imam) said, ‘Yes, by Allah, eating on one day of the month of Ramadan is more beloved to me than my neck being cut off.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:2:9",
  "kind": "verse_list"
}