{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:2:2:19",
        "titles": {
          "ar": "بَابُ مَنْ أَبْطَأَتْ عَلَيْهِ الْإِجَابَةُ",
          "en": "Chapter 19 – The one upon whom the Answering is delayed"
        }
      }
    ],
    "index": 416,
    "local_index": 19,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:2:2:20",
        "titles": {
          "ar": "بَابُ الصَّلَاةِ عَلَى النَّبِيِّ مُحَمَّدٍ وَ أَهْلِ بَيْتِهِ عَلَيْهِمُ السَّلَامُ",
          "en": "Chapter 20 – The Salawāt (Blessings) upon the Prophet Muhammad<sup>saww</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:2:2:18",
        "titles": {
          "ar": "بَابُ الْعُمُومِ فِي الدُّعَاءِ",
          "en": "Chapter 18 – The Inclusiveness in the supplication"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:2:19",
    "titles": {
      "ar": "بَابُ مَنْ أَبْطَأَتْ عَلَيْهِ الْإِجَابَةُ",
      "en": "Chapter 19 – The one upon whom the Answering is delayed"
    },
    "verse_count": 9,
    "verse_start_index": 3141,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/79)"
        ],
        "index": 3142,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:19:1",
        "refs": {
          "Mentions": [
            "/books/quran:39:53",
            "/books/quran:2:268",
            "/books/quran:2:186"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنِّي قَدْ سَأَلْتُ اللَّهَ حَاجَةً مُنْذُ كَذَا وَ كَذَا سَنَةً وَ قَدْ دَخَلَ قَلْبِي مِنْ إِبْطَائِهَا شَيْ‏ءٌ فَقَالَ يَا أَحْمَدُ إِيَّاكَ وَ الشَّيْطَانَ أَنْ يَكُونَ لَهُ عَلَيْكَ سَبِيلٌ حَتَّى يُقَنِّطَكَ ",
          "إِنَّ أَبَا جَعْفَرٍ ( صلوات الله عليه )  كَانَ يَقُولُ إِنَّ الْمُؤْمِنَ يَسْأَلُ اللَّهَ عَزَّ وَ جَلَّ حَاجَةً فَيُؤَخِّرُ عَنْهُ تَعْجِيلَ إِجَابَتِهِ حُبّاً لِصَوْتِهِ وَ اسْتِمَاعِ نَحِيبِهِ ",
          "ثُمَّ قَالَ وَ اللَّهِ مَا أَخَّرَ اللَّهُ عَزَّ وَ جَلَّ عَنِ الْمُؤْمِنِينَ مَا يَطْلُبُونَ مِنْ هَذِهِ الدُّنْيَا خَيْرٌ لَهُمْ مِمَّا عَجَّلَ لَهُمْ فِيهَا وَ أَيُّ شَيْ‏ءٍ الدُّنْيَا إِنَّ أَبَا جَعْفَرٍ ( عليه السلام ) كَانَ يَقُولُ يَنْبَغِي لِلْمُؤْمِنِ أَنْ يَكُونَ دُعَاؤُهُ فِي الرَّخَاءِ نَحْواً مِنْ دُعَائِهِ فِي الشِّدَّةِ لَيْسَ إِذَا أُعْطِيَ فَتَرَ فَلَا تَمَلَّ الدُّعَاءَ فَإِنَّهُ مِنَ اللَّهِ عَزَّ وَ جَلَّ بِمَكَانٍ وَ عَلَيْكَ بِالصَّبْرِ وَ طَلَبِ الْحَلَالِ وَ صِلَةِ الرَّحِمِ",
          "وَ إِيَّاكَ وَ مُكَاشَفَةَ النَّاسِ فَإِنَّا أَهْلَ الْبَيْتِ نَصِلُ مَنْ قَطَعَنَا وَ نُحْسِنُ إِلَى مَنْ أَسَاءَ إِلَيْنَا فَنَرَى وَ اللَّهِ فِي ذَلِكَ الْعَاقِبَةَ الْحَسَنَةَ ",
          "إِنَّ صَاحِبَ النِّعْمَةِ فِي الدُّنْيَا إِذَا سَأَلَ فَأُعْطِيَ طَلَبَ غَيْرَ الَّذِي سَأَلَ وَ صَغُرَتِ النِّعْمَةُ فِي عَيْنِهِ فَلَا يَشْبَعُ مِنْ شَيْ‏ءٍ وَ إِذَا كَثُرَتِ النِّعَمُ كَانَ الْمُسْلِمُ مِنْ ذَلِكَ عَلَى خَطَرٍ لِلْحُقُوقِ الَّتِي تَجِبُ عَلَيْهِ وَ مَا يُخَافُ مِنَ الْفِتْنَةِ فِيهَا",
          "أَخْبِرْنِي عَنْكَ لَوْ أَنِّي قُلْتُ لَكَ قَوْلًا أَ كُنْتَ تَثِقُ بِهِ مِنِّي فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِذَا لَمْ أَثِقْ بِقَوْلِكَ فَبِمَنْ أَثِقُ وَ أَنْتَ حُجَّةُ اللَّهِ عَلَى خَلْقِهِ قَالَ فَكُنْ بِاللَّهِ أَوْثَقَ فَإِنَّكَ عَلَى مَوْعِدٍ مِنَ اللَّهِ أَ لَيْسَ اللَّهُ عَزَّ وَ جَلَّ يَقُولُ وَ إِذا سَأَلَكَ عِبادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ ",
          "وَ قَالَ لا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ وَ قَالَ وَ اللَّهُ يَعِدُكُمْ مَغْفِرَةً مِنْهُ وَ فَضْلًا فَكُنْ بِاللَّهِ عَزَّ وَ جَلَّ أَوْثَقَ مِنْكَ بِغَيْرِهِ وَ لَا تَجْعَلُوا فِي أَنْفُسِكُمْ إِلَّا خَيْراً فَإِنَّهُ مَغْفُورٌ لَكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I had asked Allah<sup>azwj</sup> of a need since such and such a year and there has entered into my heart something from its delay’. So he<sup>asws</sup> said: ‘O Ahmad! Beware of the Satan<sup>la</sup> for there to be a way for him<sup>la</sup> upon you until he<sup>la</sup> despairs you. ",
            "Abu Ja’far<sup>asws</sup> was saying: ‘A <span class=\"iTxt\">Momin</span> asks Allah<sup>azwj</sup> Mighty and Majestic for a need, so He<sup>azwj</sup> Delays it from him the hastening of its Answer, out of Love for his voice and Listening to his wailings’. ",
            "Then he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! Whatever Allah<sup>azwj</sup> Mighty and Majestic Delays from the <span class=\"iTxt\">Momineen</span> what they are seeking from this world is better for them from what is hastened for them in it. And which thing is the world? Abu Ja’far<sup>asws</sup> was saying: ‘It is befitting for the <span class=\"iTxt\">Momin</span> that his supplications during the prosperity should be approximately the same as his supplications during the difficulties. It should not be that when he is Given, so he gets bored and does not incline for the supplication, for it has a place (status) with Allah<sup>azwj</sup> Mighty and Majestic. And upon you is with the patience and seeking the Permissible, and helping the relatives. ",
            "And beware of conflicts with the people, for we<sup>asws</sup> the People<sup>asws</sup> of the Household maintain relationships with the ones who cut us<sup>asws</sup> off, and we do good to the ones who offend us<sup>asws</sup>, for we<sup>asws</sup> see, by Allah<sup>azwj</sup>, the good end-result in that. ",
            "The owner of the Bounties (rich) in the world, when he asks, so he is Given, he seeks other than which he asked for, and he belittles the Bounties in his eyes, so he is not satisfied from anything. And when the Bounties were numerous upon a Muslim he would be in danger from that for (violating) the rights which are Obligated upon him and he would fear from the strife with regards to it.",
            "Inform me<sup>asws</sup> about yourself. If I<sup>asws</sup> were to say certain words to you would you trust in it from me<sup>asws</sup>?’ So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! If I<sup>asws</sup> do not trust in your<sup>asws</sup> words, so in whose (words) would I trust, and you<sup>asws</sup> are the Proof of Allah<sup>azwj</sup> upon His<sup>azwj</sup> creatures!’ He<sup>asws</sup> said: ‘So become more trusting in Allah<sup>azwj</sup> upon a Promise from Allah<sup>azwj</sup>. Isn’t Allah<sup>azwj</sup> Mighty and Majestic Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h186\">[2:186]</a> And when My servants ask you concerning Me, then surely I am very near; I Answer the supplication of the suppliant when he supplicates</span>. ",
            "And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:39#h53\">[39:53]</a> do not despair of the Mercy of Allah</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h268\">[2:268]</a> and Allah Promises you Forgiveness from Himself and Grace</span>. Therefore, become more trusting in Allah<sup>azwj</sup> Mighty and Majestic from yourself than in others, and do not make within yourself anything except for goodness, for He<sup>azwj</sup> would be Forgiving you’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ahmad ibn Muhammad ibn abu Nasr who has said the following: “Once I said to abu al-Hassan (al-Rida) (a.s.) ‘May Allah keep my soul in service for your cause, I have been praying to Allah for help in something from the year so and so and because of delay something is happing in my heart.’ The Imam said, ‘O Ahmad, beware of Satan! Do not allow him to find a way in you to despair you. Abu Ja’far (a.s.) would say, “A believing person prays and pleads before Allah, the Most Majestic, the Most Holy, for help and help is delayed due to love for his voice and listening to his intense weeping.’” The Imam then said, ‘By Allah, whatever Allah, the Most Majestic, the Most Holy, delays for believing people of the help that they may ask in this world is far better for them than helping them quickly. Such a worthless world! Abu Ja’far (a.s.) would say, ‘It is very proper for a believing person to pray for help in his comfort just like in hardships. He should not grow to be lazy after receiving help to lose interest in prayer.’ You should never lose interest in prayer; it is of a very important position before Allah, the Most Majestic, the Most Holy. You should exercise patience and seek to find lawful sustenance, maintain good relations with relatives and should never make it public. We are a family who maintains good relations with those who cut off from us and do favors to those who cause us trouble. In this we find good consequences. If an affluent person in this world prays and asks for favors, his prayer receives acceptance. He may ask for more and the bounties seem insignificant to him. He does not feel satisfied with anything. When bounties are plentiful a Muslim is in a danger of violating the rights he owes and the mischief that may threaten him. Tell me about yourself. If I will say something to you, will you trust me?’ I (the narrator) said, ‘May Allah keep my soul in service for your cause, if I do not trust you, then whom will I trust? You possess authority from Allah over His creatures.’ The Imam said, ‘Your trust in Allah must be stronger; you have a covenant with Allah. Has Allah, the Most Majestic, the Most Holy, not said, “(Muhammad), if any of My servants ask you about Me, tell them that the Lord says, ‘I am near; I accept the prayers of those who pray.’ Allow My servants answer My call and believe in Me so that perhaps they may know the right direction.’ <a href=\"/#/books/quran:2#h186\">[2:186]</a> ‘Do not despair of the mercy of Allah. Allah certainly forgives all sins. He is All-Forgiving and All-Merciful.’ <a href=\"/#/books/quran:39#h53\">[39:53]</a> ‘Allah promises you forgiveness and favors. Allah is Munificent and All-Knowing.’ <a href=\"/#/books/quran:2#h268\">[2:268]</a> You must trust Allah, the Most Majestic, the Most Holy, more firmly than others. Do not allow anything to find a way in you except good; you are forgiven.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/82)"
        ],
        "index": 3143,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:19:2",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَنْصُورٍ الصَّيْقَلِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رُبَّمَا دَعَا الرَّجُلُ بِالدُّعَاءِ فَاسْتُجِيبَ لَهُ ثُمَّ أُخِّرَ ذَلِكَ إِلَى حِينٍ قَالَ فَقَالَ نَعَمْ قُلْتُ وَ لِمَ ذَاكَ لِيَزْدَادَ مِنَ الدُّعَاءِ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad, from Ali Bin Al Hakam, from Mansour Al Sayqal who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Sometimes the man supplicates with the supplication, so it is Answered for him. Then it is delayed for a while’. So he<sup>asws</sup> said: ‘Yes’. I said, ‘And why would that be so, in order for him to increase from the supplications?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "2. It is narrated from him (narrator of the Hadith above) from Ahmad from Ali ibn al-Hakam from Mansur al-Sayqal who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘Is it possible that at one time a man prays and it is accepted and then is delayed for a period of time?’ The narrator has said that the Imam then said, ‘Yes, it can happen.’ I then asked, ‘Why is that? Is it because so he will increase his prayer and pleading?’ The Imam said, ‘Yes, that is right.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/83)"
        ],
        "index": 3144,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:19:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِسْحَاقَ بْنِ أَبِي هِلَالٍ الْمَدَائِنِيِّ عَنْ حَدِيدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْعَبْدَ لَيَدْعُو فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ لِلْمَلَكَيْنِ قَدِ اسْتَجَبْتُ لَهُ وَ لَكِنِ احْبِسُوهُ بِحَاجَتِهِ فَإِنِّي أُحِبُّ أَنْ أَسْمَعَ صَوْتَهُ وَ إِنَّ الْعَبْدَ لَيَدْعُو فَيَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى عَجِّلُوا لَهُ حَاجَتَهُ فَإِنِّي أُبْغِضُ صَوْتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Is’haq Bin Abu Hilal Al Madainy, from Hadeed, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The servant is supplicating, so Allah<sup>azwj</sup> Mighty and Majestic is Saying to the two Angels: “I<sup>azwj</sup> have Answered for him, but withhold his need, for I<sup>azwj</sup> Love to Hear his voice”; and the servant is supplicating, so Allah<sup>azwj</sup> Blessed and High is Saying: “Hasten his need for him, for I<sup>azwj</sup> Hate Hearing his voice”’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Ishaq ibn abu Hilal al-Mada’Ini from Hadid from abu ‘Abd Allah (a.s.) who has said the following: “When a servant prays, Allah, the Most Majestic, the Most Holy, says to the two angels, ‘I have accepted his prayer, but keep it on hold; I love to hear his voice.’ It may also happen that a servant prays, but Allah, the Most Blessed, the Most High, says, ‘Hurry up and help him quickly; I hate his voice.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/83)"
        ],
        "index": 3145,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:19:4",
        "text": [
          "ابْنُ أَبِي عُمَيْرٍ عَنْ سُلَيْمَانَ صَاحِبِ السَّابِرِيِّ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يُسْتَجَابُ لِلرَّجُلِ الدُّعَاءُ ثُمَّ يُؤَخَّرُ قَالَ نَعَمْ عِشْرِينَ سَنَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Abu Umeyr, from Suleyman Sahib Al Sabiry, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup> having said: ‘The supplication gets Answered for the man, then it gets delayed?’ He<sup>asws</sup> said: ‘Yes, (it could be delayed for) twenty years’."
          ],
          "en.sarwar": [
            "4. Ibn abu ‘Umayr has narrated from Sulayman Sahib al-Sabiri from Ishaq ibn ‘ Ammar who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘Can a man’s prayer that is accepted be kept on hold and delayed?’ The Imam said, ‘Yes, it can remain on hold for up to twenty years.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/84)"
        ],
        "index": 3146,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:19:5",
        "refs": {
          "Mentions": [
            "/books/quran:10:89"
          ]
        },
        "text": [
          "ابْنُ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ بَيْنَ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ قَدْ أُجِيبَتْ دَعْوَتُكُما وَ بَيْنَ أَخْذِ فِرْعَوْنَ أَرْبَعِينَ عَاماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was so between the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:10#h89\">[10:89]</a> I have Accepted the supplication of both of you</span> (Musa<sup>asws</sup> and Haroun<sup>as</sup>), and between the Seizing of the Pharaoh<sup>la</sup>, (a duration of) forty years’."
          ],
          "en.sarwar": [
            "5. Ibn abu ‘Umayr has narrated from Hisham ibn Salim from abu ‘Abd Allah (a.s.) who has said the following: “Between the words of Allah, the Most Majestic, the Most Holy, ‘Your prayer is accepted,’ <a href=\"/#/books/quran:10#h89\">[10:89]</a> and the time the Pharaoh was seized there was a forty-year timespan.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/84)"
        ],
        "index": 3147,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:19:6",
        "text": [
          "ابْنُ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الْمُؤْمِنَ لَيَدْعُو فَيُؤَخَّرُ إِجَابَتُهُ إِلَى يَوْمِ الْجُمُعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Abu Baseer who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘A <span class=\"iTxt\">Momin</span> supplicates, so its Answer gets delayed up to the day of Friday’."
          ],
          "en.sarwar": [
            "6. Ibn abu ‘Umayr has narrated from Ibrahim ibn ‘Abd al-Hamid from abu Basir who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘A believing person prays and its (the prayer’s) acceptance may be delayed up to the next Friday [Day of Judgment].”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالحسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/84)"
        ],
        "index": 3148,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:19:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الْعَبْدَ الْوَلِيَّ لِلَّهِ يَدْعُو اللَّهَ عَزَّ وَ جَلَّ فِي الْأَمْرِ يَنُوبُهُ فَيَقُولُ لِلْمَلَكِ الْمُوَكَّلِ بِهِ اقْضِ لِعَبْدِي حَاجَتَهُ وَ لَا تُعَجِّلْهَا فَإِنِّي أَشْتَهِي أَنْ أَسْمَعَ نِدَاءَهُ وَ صَوْتَهُ وَ إِنَّ الْعَبْدَ الْعَدُوَّ لِلَّهِ لَيَدْعُو اللَّهَ عَزَّ وَ جَلَّ فِي الْأَمْرِ يَنُوبُهُ فَيُقَالُ لِلْمَلَكِ الْمُوَكَّلِ بِهِ اقْضِ لِعَبْدِي حَاجَتَهُ وَ عَجِّلْهَا فَإِنِّي أَكْرَهُ أَنْ أَسْمَعَ نِدَاءَهُ وَ صَوْتَهُ ",
          "قَالَ فَيَقُولُ النَّاسُ مَا أُعْطِيَ هَذَا إِلَّا لِكَرَامَتِهِ وَ لَا مُنِعَ هَذَا إِلَّا لِهَوَانِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdullah Bin Al Mugheira, from someone else, from our companions who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The servant who is a friend of Allah<sup>azwj</sup> would be supplicating to Allah<sup>azwj</sup> Mighty and Majestic regarding the matter delegated to Him<sup>azwj</sup>, so He<sup>azwj</sup> would be Saying to the Angel Allocated with him: “Fulfil for My<sup>azwj</sup> servant, his need, but do not hasten it, for I<sup>azwj</sup> Desire to Hear his calls and his voice”; and the servant who is an enemy of Allah<sup>azwj</sup> would be supplicating to Allah<sup>azwj</sup> Mighty and Majestic regarding the matter delegated to Him<sup>azwj</sup>, so He<sup>azwj</sup> would be Saying to the Angel Allocated with him: “Fulfil for My<sup>azwj</sup> servant his need and hasten it, for I<sup>azwj</sup> Dislike to Hear his call and his voice”. ",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘So the people would (instead) be saying, ‘This one has not been Given except due to his prestige, and this one has not been Prevented except due to his indignity’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Abd Allah ibn al-Mughirah from more than one individual of our people who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘A servant who is a friend of Allah may pray to Allah, the Most Majestic, the Most Holy, for a matter in his intention and Allah says to the angel guarding him, “Provide help to My servant but keep it on hold and do not hurry; I desire to hear his call and voice.” On the other hand a servant who is not a friend of Allah may pray to Allah, the Most Majestic, the Most Holy, for a matter in his intention and Allah says to the angel guarding him, ‘Provide him help quickly; I dislike his call and voice.’ “The Imam said, ‘People will say, “This person received help due to his merit and honor and he was denied due to his worthlessness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/84)"
        ],
        "index": 3149,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:19:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَزَالُ الْمُؤْمِنُ بِخَيْرٍ وَ رَجَاءٍ رَحْمَةً مِنَ اللَّهِ عَزَّ وَ جَلَّ مَا لَمْ يَسْتَعْجِلْ فَيَقْنَطَ وَ يَتْرُكَ الدُّعَاءَ قُلْتُ لَهُ كَيْفَ يَسْتَعْجِلُ قَالَ يَقُولُ قَدْ دَعَوْتُ مُنْذُ كَذَا وَ كَذَا وَ مَا أَرَى الْإِجَابَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Hisham Bin Salim, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Momin</span> does not cease to be with goodness and hoping for the Mercy of Allah<sup>azwj</sup> Mighty and Majestic for as long as he does not haste, so he would end up despairing and neglect the supplication’. I said to him<sup>asws</sup>, ‘How would he make haste?’ He<sup>asws</sup> said: ‘He would be saying, ‘I have been supplicating since such and such (a time) and I do not see the Answer’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from Hisham ibn Salim from abu Basir from abu ‘Abd Allah (a.s.) who has said the following: “A believing person is fine and hopeful through the favors of Allah, the Most Majestic, the Most Holy, as long as he does not msh to despair and give up prayer.’ I (the narrator) then asked the Imam (a.s.) ‘How can he msh?’ The Imam said, ‘He may say, “I have been praying for such and such period of time and I do not see any sign of acceptance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول بل حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/85)"
        ],
        "index": 3150,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:19:9",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْمُؤْمِنَ لَيَدْعُو اللَّهَ عَزَّ وَ جَلَّ فِي حَاجَتِهِ فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ أَخِّرُوا إِجَابَتَهُ شَوْقاً إِلَى صَوْتِهِ وَ دُعَائِهِ فَإِذَا كَانَ يَوْمُ الْقِيَامَةِ قَالَ اللَّهُ عَزَّ وَ جَلَّ عَبْدِي دَعَوْتَنِي فَأَخَّرْتُ إِجَابَتَكَ وَ ثَوَابُكَ كَذَا وَ كَذَا وَ دَعَوْتَنِي فِي كَذَا وَ كَذَا فَأَخَّرْتُ إِجَابَتَكَ وَ ثَوَابُكَ كَذَا وَ كَذَا ",
          "قَالَ فَيَتَمَنَّى الْمُؤْمِنُ أَنَّهُ لَمْ يُسْتَجَبْ لَهُ دَعْوَةٌ فِي الدُّنْيَا مِمَّا يَرَى مِنْ حُسْنِ الثَّوَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Sa’dan Bin Muslim, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Momin</span> supplicates to Allah<sup>azwj</sup> Mighty and Majestic regarding his need, so Allah<sup>azwj</sup> Mighty and Majetic is Saying: “Delay its Answer”, out of Desire to his voice and his supplication. So when it will be the Day of Judgment, Allah<sup>azwj</sup> Mighty and Majestic would Say: “My<sup>azwj</sup> servant! You supplicated to Me<sup>azwj</sup> but I<sup>azwj</sup> Delayed its Answer, and your Rewards are such and such, and you supplication to Me<sup>azwj</sup> regarding such and such, but I<sup>azwj</sup> Delayed Answering you and your Rewards are such and such”. ",
            "He<sup>asws</sup> said: ‘So the <span class=\"iTxt\">Momin</span> would wish that no supplication of his had been Answered in the world due to what he sees from the excellent Rewards’."
          ],
          "en.sarwar": [
            "9. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Su’Dan ibn Muslim from Ishaq ibn ‘Ammar from abu ‘Abd Allah (a.s.) who has said the following: “A believing person may pray to Allah, the Most Majestic, the Most Holy, for help and Allah, the Most Majestic, the Most Holy, will say, ‘Hold back the answer to his prayer for the desire in his voice and prayer.’ When it will be the Day of Judgment Allah, the Most Majestic, the Most Holy, will say, ‘My servant, you prayed to Me and I delayed your answer. So and so is your reward. You prayed to Me in such and such matters and I delayed your answer. Your reward is so and so.’ The Imam said, ‘The believing person then wishes that none of his prayers had been accepted in the worldly life. He will say so on finding such handsome rewards.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:2:19",
  "kind": "verse_list"
}