{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:2:2:22",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ ذِكْرِ اللَّهِ</span> عَزَّ وَ جَلَّ كَثِيراً",
          "en": "Chapter 22 – Abundant mention of Allah<sup>azwj</sup> Mighty and Majestic"
        }
      }
    ],
    "index": 419,
    "local_index": 22,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:2:2:23",
        "titles": {
          "ar": "بَابُ أَنَّ الصَّاعِقَةَ لَا تُصِيبُ ذَاكِراً",
          "en": "Chapter 23 – The thunderbolt would not strike a Zakir (Oft-mentioner) of Allah<sup>azwj</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:2:2:21",
        "titles": {
          "ar": "بَابُ مَا يَجِبُ مِنْ ذِكْرِ اللَّهِ عَزَّ وَ جَلَّ فِي كُلِّ مَجْلِسٍ",
          "en": "Chapter 21 – What is Obligated from the Mention of Allah<sup>azwj</sup> Mighty and Majestic in every gathering"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:2:22",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ ذِكْرِ اللَّهِ</span> عَزَّ وَ جَلَّ كَثِيراً",
      "en": "Chapter 22 – Abundant mention of Allah<sup>azwj</sup> Mighty and Majestic"
    },
    "verse_count": 5,
    "verse_start_index": 3184,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/128)"
        ],
        "index": 3185,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:22:1",
        "relations": {
          "Mentions": [
            "/books/quran:33:41",
            "/books/quran:74:6",
            "/books/quran:33:42"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ شَيْ‏ءٍ إِلَّا وَ لَهُ حَدٌّ يَنْتَهِي إِلَيْهِ إِلَّا الذِّكْرَ فَلَيْسَ لَهُ حَدٌّ يَنْتَهِي إِلَيْهِ فَرَضَ اللَّهُ عَزَّ وَ جَلَّ الْفَرَائِضَ فَمَنْ أَدَّاهُنَّ فَهُوَ حَدُّهُنَّ وَ شَهْرَ رَمَضَانَ فَمَنْ صَامَهُ فَهُوَ حَدُّهُ وَ الْحَجَّ فَمَنْ حَجَّ فَهُوَ حَدُّهُ إِلَّا الذِّكْرَ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمْ يَرْضَ مِنْهُ بِالْقَلِيلِ وَ لَمْ يَجْعَلْ لَهُ حَدّاً يَنْتَهِي إِلَيْهِ",
          "ثُمَّ تَلَا هَذِهِ الْآيَةَ يا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْراً كَثِيراً وَ سَبِّحُوهُ بُكْرَةً وَ أَصِيلًا فَقَالَ لَمْ يَجْعَلِ اللَّهُ عَزَّ وَ جَلَّ لَهُ حَدّاً يَنْتَهِي إِلَيْهِ قَالَ وَ كَانَ أَبِي ( عليه السلام ) كَثِيرَ الذِّكْرِ لَقَدْ كُنْتُ أَمْشِي مَعَهُ وَ إِنَّهُ لَيَذْكُرُ اللَّهَ وَ آكُلُ مَعَهُ الطَّعَامَ وَ إِنَّهُ لَيَذْكُرُ اللَّهَ وَ لَقَدْ كَانَ يُحَدِّثُ الْقَوْمَ وَ مَا يَشْغَلُهُ ذَلِكَ عَنْ ذِكْرِ اللَّهِ",
          "وَ كُنْتُ أَرَى لِسَانَهُ لَازِقاً بِحَنَكِهِ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَ كَانَ يَجْمَعُنَا فَيَأْمُرُنَا بِالذِّكْرِ حَتَّى تَطْلُعَ الشَّمْسُ وَ يَأْمُرُ بِالْقِرَاءَةِ مَنْ كَانَ يَقْرَأُ مِنَّا وَ مَنْ كَانَ لَا يَقْرَأُ مِنَّا أَمَرَهُ بِالذِّكْرِ",
          "وَ الْبَيْتُ الَّذِي يُقْرَأُ فِيهِ الْقُرْآنُ وَ يُذْكَرُ اللَّهُ عَزَّ وَ جَلَّ فِيهِ تَكْثُرُ بَرَكَتُهُ وَ تَحْضُرُهُ الْمَلَائِكَةُ وَ تَهْجُرُهُ الشَّيَاطِينُ وَ يُضِي‏ءُ لِأَهْلِ السَّمَاءِ كَمَا يُضِي‏ءُ الْكَوْكَبُ الدُّرِّيُّ لِأَهْلِ الْأَرْضِ وَ الْبَيْتُ الَّذِي لَا يُقْرَأُ فِيهِ الْقُرْآنُ وَ لَا يُذْكَرُ اللَّهُ فِيهِ تَقِلُّ بَرَكَتُهُ وَ تَهْجُرُهُ الْمَلَائِكَةُ وَ تَحْضُرُهُ الشَّيَاطِينُ ",
          "وَ قَدْ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَ لَا أُخْبِرُكُمْ بِخَيْرِ أَعْمَالِكُمْ لَكُمْ أَرْفَعِهَا فِي دَرَجَاتِكُمْ وَ أَزْكَاهَا عِنْدَ مَلِيكِكُمْ وَ خَيْرٍ لَكُمْ مِنَ الدِّينَارِ وَ الدِّرْهَمِ وَ خَيْرٍ لَكُمْ مِنْ أَنْ تَلْقَوْا عَدُوَّكُمْ فَتَقْتُلُوهُمْ وَ يَقْتُلُوكُمْ فَقَالُوا بَلَى فَقَالَ ذِكْرُ اللَّهِ عَزَّ وَ جَلَّ كَثِيراً ",
          "ثُمَّ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ مَنْ خَيْرُ أَهْلِ الْمَسْجِدِ فَقَالَ أَكْثَرُهُمْ لِلَّهِ ذِكْراً ",
          "وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أُعْطِيَ لِسَاناً ذَاكِراً فَقَدْ أُعْطِيَ خَيْرَ الدُّنْيَا وَ الْآخِرَةِ ",
          "وَ قَالَ فِي قَوْلِهِ تَعَالَى وَ لا تَمْنُنْ تَسْتَكْثِرُ قَالَ لَا تَسْتَكْثِرْ مَا عَمِلْتَ مِنْ خَيْرٍ لِلَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al Ashary, from Ibn Al Qadah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from the things except that there is an ultimate point to it except for the <span class=\"iTxt\">Zikr</span> (Mention of Allah<sup>azwj</sup>) for there is no limit for it one can end up to. Allah<sup>azwj</sup> Mighty and Majestic Imposed the Obligation, so the one who fulfils these, so it would be its limit (reached), and the Month of Ramazan, so the one who Fasts it, so it would be its limit (reached), and the Hajj, so the one performs Hajj, so it would be its limit (reached), except for the <span class=\"iTxt\">Zikr</span> (Mention of Allah<sup>azwj</sup>), for Allah<sup>azwj</sup> Mighty and Majestic is not Pleased from it with the little but did not Make a limit for it either for one to end up to it’. ",
            "Then he<sup>asws</sup> recited this Verse <span class=\"ibTxt\"><a href=\"/#/books/quran:33#h41\">[33:41]</a> O you who believe! Mention Allah, with a frequent Mentioning <a href=\"/#/books/quran:33#h42\">[33:42]</a> And Glorify Him morning and evening</span>, and he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic did not Make a limit for it for one to end up to it. And it was so that my<sup>asws</sup> father<sup>asws</sup> used to do a lot of <span class=\"iTxt\">Zikr</span> (Mention of Allah<sup>azwj</sup>). I<sup>asws</sup> had walked with him<sup>asws</sup> and he<sup>asws</sup> was doing <span class=\"iTxt\">Zikr</span> (mentioning) Allah<sup>azwj</sup> and was eating food along with it while he<sup>asws</sup> was doing <span class=\"iTxt\">Zikr</span> (mentioning) Allah<sup>azwj</sup>. And he<sup>asws</sup> used to narrate to the people and that would not pre-occupy him<sup>asws</sup> from doing Zikr of Allah<sup>azwj</sup>.",
            "And I<sup>asws</sup> used to see his<sup>asws</sup> tongue move in his<sup>asws</sup> jaws saying: ‘There is no god except Allah<sup>azwj</sup>’, and he<sup>asws</sup> used to gather us and order us with the <span class=\"iTxt\">Zikr</span> until the emergence of the sun, and he<sup>asws</sup> would order with the recitation the ones from us who could read, and the ones of us who could not read, he<sup>asws</sup> would order him with the <span class=\"iTxt\">Zikr</span>. ",
            "And the house in which the Quran is recited and Allah<sup>azwj</sup> Mighty and Majestic is mentioned therein would be with abundant Blessings, and the Angels would attend it, and the Satans<sup>la</sup> would flee, and it would shine to the inhabitants of the sky just like the brilliant star does for the inhabitants of the earth. And the house in which the Quran is not recited, nor is Allah<sup>azwj</sup> Mentioned therein would be of little Blessings and the Angels would flee from it and the Satans<sup>la</sup> would attend it.",
            "And Rasool-Allah<sup>saww</sup> has said: ‘Shall I<sup>saww</sup> inform you with the best of your deeds which would be raising for you in your levels be the most purifying in the Presence of your King<sup>azwj</sup>, and better for you all than the Dinar and the Dirham, and better for you than your meeting your enemies (in battle), so you would be killing them and they would be killing you?’ So they said, ‘Yes’. So he<sup>saww</sup> said: ‘Abundant <span class=\"iTxt\">Zikr</span> of Allah<sup>azwj</sup> Mighty and Majestic’’. ",
            "Then he<sup>asws</sup> said: ‘A man came over to the Prophet<sup>saww</sup> and he said, ‘Who are the best ones from the people of the Masjid?’ So he<sup>saww</sup> said: ‘The ones who most frequent the <span class=\"iTxt\">Zikr</span> of Allah<sup>azwj</sup>’. ",
            "And Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘The one who has been Given a oft-mentioning tongue, so he has been Given the goodness of the world and the Hereafter’. ",
            "And he (the narrator) said, ‘Regarding the Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:74#h6\">[74:6]</a> And bestow not favours that you may receive again with increase</span>, he<sup style=\"font-weight: normal\">asws</sup> said: ‘Do not (consider) as a lot, what you have done from the good works for the Sake of Allah<sup style=\"font-weight: normal\">azwj</sup>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash’ari from ibn al-Qaddah from abu ‘Abd Allah (a.s.) who has said the following: “Everything has a limit where it ends except speaking of Allah which has no limit to end. Allah, the Most Majestic, the Most Holy, has sanctioned obligations. When one fulfills them, their limit is where they end. The limit for the month of Ramadan is that when one fasts that is its limit where it ends, and the limit of Hajj is that when one performs Hajj it ends. Al-Dikr (speaking of Allah) is as such that Allah, the Most Majestic, the Most Holy, does not agree with a very little of it and He has not set a limit for where it ends.’ The Imam then read this verse of the Holy Quran: ‘Believers, remember Allah very often <a href=\"/#/books/quran:33#h41\">[33:41]</a> and glorify Him both in the mornings and in the evenings.’ <a href=\"/#/books/quran:33#h42\">[33:42]</a> “The Imam said, ‘Allah, the Most Majestic, the Most Holy, has not set a limit for it where it would end.’ He them said, ‘My father would speak of Allah very often. I would walk with him and he would speak of Allah. At the time I ate food with him he would speak of Allah. Even when speaking to people it would not stop him from speaking of Allah. I could see his tongue move saying, ‘No one deserves to be worshipped except Allah.’ He would gather all of us together and order us to speak of Allah until sunrise. He would command those of us who could read, to read the Holy Quran and those who could not to speak of Allah. The house in which the Holy Quran is read and Allah, the Most Majestic, the Most Holy, is spoken of therein blessings increase and angels are present, the devils run away and it shines to the people of heavens just as a diamond (shaped) star shines for the people of earth. The house in which the Holy Quran is not read, Allah is not spoken of therein, blessings in it decrease, angels move away from it and devils turn to be present therein. The Messenger of Allah once asked, ‘Should I tell you about the best of your deeds, which raise your position the highest and the purest before your owner, much better for you than the world and its money and is better for you than your fighting against your enemies whom you would eliminate or else they would kill you?’ They said, ‘Yes.’ He then said, ‘Speak of Allah, the Most Majestic, the Most Holy, very often.’ “The Imam then said, ‘Once a man came to the Holy Prophet and said, “Who is the best of the people in this Mosque?” He said, ‘The one who speaks of Allah more than others.’ The Messenger of Allah has said, ‘Whoever is given a tongue that speaks of Allah very often has been granted the good for both this and the next life.’ “About the words of Allah, ‘. . . and do not think that by doing such deeds, you have done a great favor to Allah,’ <a href=\"/#/books/quran:74#h6\">[74:6]</a> the Imam said, ‘It means do not think what you have done for the sake of Allah is a great deal.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/134)"
        ],
        "index": 3186,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:22:2",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ شِيعَتُنَا الَّذِينَ إِذَا خَلَوْا ذَكَرُوا اللَّهَ كَثِيراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from Wuheyb Bin Hafs, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Our<sup>asws</sup> Shias are those who when they are alone, they are doing <span class=\"iTxt\">Zikr </span>of (mentioning) Allah<sup>azwj</sup> a lot’."
          ],
          "en.sarwar": [
            "2. Humayd ibn Ziyad has narrated from ibn Sama’a from Wahab ibn Hafs from abu Basir from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Our Shi’a (followers) are those who when alone speak of Allah very often.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/134)"
        ],
        "index": 3187,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:22:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ دَاوُدَ بْنِ سِرْحَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَكْثَرَ ذِكْرَ اللَّهِ عَزَّ وَ جَلَّ أَحَبَّهُ اللَّهُ وَ مَنْ ذَكَرَ اللَّهَ كَثِيراً كُتِبَتْ لَهُ بَرَاءَتَانِ بَرَاءَةٌ مِنَ النَّارِ وَ بَرَاءَةٌ مِنَ النِّفَاقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, and a number of our companions, from Ahmad Bin Muhammad, altogether from Al Hassan Bin Ali Al Washha, from Dawood Bin Sirhan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who frequently mentions (<span class=\"iTxt\">Zikr</span>) of Allah<sup>azwj</sup> Mighty and Majestic, Allah<sup>azwj</sup> would Love him, and the one who frequently mentions (<span class=\"iTxt\">Zikr</span>) Allah<sup>azwj</sup>, two requittals are Written for him – a requital from the Fire and a requital from the hypocrisy’."
          ],
          "en.sarwar": [
            "3. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad and A number of our people have narrated from Ahmad ibn Muhammad all from al- Hassan ibn Ali al-Washsha’ from Dawud ibn Serhan from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘Whoever speaks of Allah, the Most Majestic, the Most Holy, often Allah loves him and whoever speaks of Allah very often, two kinds of freedoms will be written for him: freedom from fire and freedom from hypocrisy.’” "
          ]
        }
      },
      {
        "index": 3188,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:22:4",
        "relations": {
          "Mentions": [
            "/books/quran:33:41",
            "/books/quran:33:42"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ بَكْرِ بْنِ أَبِي بَكْرٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَسْبِيحُ فَاطِمَةَ الزَّهْرَاءِ ( عليها السلام ) مِنَ الذِّكْرِ الْكَثِيرِ الَّذِي قَالَ اللَّهُ عَزَّ وَ جَلَّ اذْكُرُوا اللَّهَ ذِكْراً كَثِيراً .",
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي أُسَامَةَ زَيْدٍ الشَّحَّامِ وَ مَنْصُورِ بْنِ حَازِمٍ وَ سَعِيدٍ الْأَعْرَجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Bakr Bin Abu Bakr, from Zurara Bin Ayn, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘The Glorification (<span class=\"iTxt\">Tasbeeh</span>) of Fatima Al-Zahra<sup style=\"font-weight: normal\">asws</sup> is from the ‘Abundant <span class=\"iTxt\">Zikr</span>’ which Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Speaks of <span class=\"ibTxt\"><a href=\"/#/books/quran:33#h41\">[33:41]</a> Mention Allah, with a frequent Mentioning</span>’. ",
            "From him, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Abu Asama Zayd Al Shahaam and Mansour Bin Hazim, and Saeed Al A’raj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Sayf ibn ‘Amirah from Bakr ibn Bukayr from Zurara ibn ‘A’Yun from abu ‘Abd Allah (a.s.) who has said the following: “Tasbih of Fatimah al-Zahra (a.s.) is a form of ‘Often speaking and remembering Allah’ about which Allah, the Most Majestic, the Most Holy, has said, ‘Believers, remember Allah very often <a href=\"/#/books/quran:33#h41\">[33:41]</a> and glorify Him both in the mornings and in the evenings.’” <a href=\"/#/books/quran:33#h42\">[33:42]</a> It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from Sayf ibn ‘Amirah from abu ‘Usamah Zayd al-Shahham and Mansur ibn Hazim and Sa’id al-‘A’raj from abu ‘Abd Allah (a.s.) a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/134)"
        ],
        "index": 3189,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:22:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ دَاوُدَ الْحَمَّارِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَكْثَرَ ذِكْرَ اللَّهِ عَزَّ وَ جَلَّ أَظَلَّهُ اللَّهُ فِي جَنَّتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Washha, from Dawood Al Hammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who frequents the <span class=\"iTxt\">Zikr</span> (Mention) of Allah<sup>azwj</sup> Mighty and Majestic, Allah<sup>azwj</sup> would Shade him in His<sup>azwj</sup> Paradise’."
          ],
          "en.sarwar": [
            "5. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Washsha’ from Dawud al-Hammar from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Whoever speaks of Allah, the Most Majestic, the Most Holy, very often, Allah will provide him a shadow in paradise.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:2:22",
  "kind": "verse_list"
}