{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:2:2:32",
        "titles": {
          "ar": "بَابُ مَنْ لَا تُسْتَجَابُ دَعْوَتُهُ",
          "en": "Chapter 32 – The one whose supplication is not Answered"
        }
      }
    ],
    "index": 429,
    "local_index": 32,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:2:2:33",
        "titles": {
          "ar": "بَابُ الدُّعَاءِ عَلَى الْعَدُوِّ",
          "en": "Chapter 33 – The supplication against the enemy"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:2:2:31",
        "titles": {
          "ar": "بَابُ مَنْ تُسْتَجَابُ دَعْوَتُهُ",
          "en": "Chapter 31 – The one whose supplication is Answered"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:2:32",
    "titles": {
      "ar": "بَابُ مَنْ لَا تُسْتَجَابُ دَعْوَتُهُ",
      "en": "Chapter 32 – The one whose supplication is not Answered"
    },
    "verse_count": 3,
    "verse_start_index": 3233,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/174)"
        ],
        "index": 3234,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:32:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حُسَيْنِ بْنِ مُخْتَارٍ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ صَحِبْتُهُ بَيْنَ مَكَّةَ وَ الْمَدِينَةِ فَجَاءَ سَائِلٌ فَأَمَرَ أَنْ يُعْطَى ثُمَّ جَاءَ آخَرُ فَأَمَرَ أَنْ يُعْطَى ثُمَّ جَاءَ آخَرُ فَأَمَرَ أَنْ يُعْطَى ثُمَّ جَاءَ الرَّابِعُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يُشْبِعُكَ اللَّهُ ",
          "ثُمَّ الْتَفَتَ إِلَيْنَا فَقَالَ أَمَا إِنَّ عِنْدَنَا مَا نُعْطِيهِ وَ لَكِنْ أَخْشَى أَنْ نَكُونَ كَأَحَدِ الثَّلَاثَةِ الَّذِينَ لَا يُسْتَجَابُ لَهُمْ دَعْوَةٌ رَجُلٌ أَعْطَاهُ اللَّهُ مَالًا فَأَنْفَقَهُ فِي غَيْرِ حَقِّهِ ثُمَّ قَالَ اللَّهُمَّ ارْزُقْنِي فَلَا يُسْتَجَابُ لَهُ ",
          "وَ رَجُلٌ يَدْعُو عَلَى امْرَأَتِهِ أَنْ يُرِيحَهُ مِنْهَا وَ قَدْ جَعَلَ اللَّهُ عَزَّ وَ جَلَّ أَمْرَهَا إِلَيْهِ وَ رَجُلٌ يَدْعُو عَلَى جَارِهِ وَ قَدْ جَعَلَ اللَّهُ عَزَّ وَ جَلَّ لَهُ السَّبِيلَ إِلَى أَنْ يَتَحَوَّلَ عَنْ جِوَارِهِ وَ يَبِيعَ دَارَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Husayn Bin Mukhtar, from Al Waleed Bin Sabeeh, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I accompanied him<sup>asws</sup> between Makkah and Al-Medina, and a beggar came over. So he<sup>asws</sup> ordered that he should be given. Then another one came over, so he<sup>asws</sup> ordered that he should be given. Then another one came over, so he<sup>asws</sup> ordered that he should be given. Then the fourth one came over, so Abu Abdullah<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Satiate you’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> turned towards us and he<sup style=\"font-weight: normal\">asws</sup> said: ‘But there is with us<sup style=\"font-weight: normal\">asws</sup> what we<sup style=\"font-weight: normal\">asws</sup> can give him, but I<sup style=\"font-weight: normal\">asws</sup> fear lest we<sup style=\"font-weight: normal\">asws</sup> would become like one of the three whose supplications are not Answered for them – a man whom Allah<sup style=\"font-weight: normal\">azwj</sup> had Given wealth, so he spent it in other that its rightful place, then says, ‘O Allah<sup style=\"font-weight: normal\">azwj</sup>! Grace me’, so it would not be Answered for him.",
            "And a man who I supplicating against his wife that he be freed from her, and Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic has already Made her matter to him; and a man who is supplicating against his neighbour, and Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic has already Made a way for him that he can move away from his neighbour and buy his house (somewhere else)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Husayn ibn Mukhtar from al-Walid ibn Sabih who has said the following: “Once I accompanied abu ‘Abd Allah (a.s.) between Makkah and Madinah and at a certain place a beggar came and he ordered his people to help. Another beggar came he ordered his people to help, another came and he ordered to help, then the fourth one came and abu ‘Abd Allah said, ‘May Allah satisfy you,’ and he turned to us saying, ‘We still can help but I feared becoming of the three kinds of people whose prayers are not heard: a man to whom Allah has granted wealth but he spends it on a wrong cause and then asks, “O Lord, grant me wealth.” His prayer is not accepted, a man who prays against his wife while Allah, the Most Majestic, the Most Holy, has made it lawful to dissolve the marriage, and a man who prays against his neighbor while Allah, the Most Majestic, the Most Holy, has made it possible for him to move away and buy another house.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول بسندي ه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/175)"
        ],
        "index": 3235,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:32:2",
        "refs": {
          "Mentions": [
            "/books/quran:25:67"
          ]
        },
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ عَنْ جَعْفَرِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَرْبَعَةٌ لَا تُسْتَجَابُ لَهُمْ دَعْوَةٌ رَجُلٌ جَالِسٌ فِي بَيْتِهِ يَقُولُ اللَّهُمَّ ارْزُقْنِي فَيُقَالُ لَهُ أَ لَمْ آمُرْكَ بِالطَّلَبِ وَ رَجُلٌ كَانَتْ لَهُ امْرَأَةٌ فَدَعَا عَلَيْهَا فَيُقَالُ لَهُ أَ لَمْ أَجْعَلْ أَمْرَهَا إِلَيْكَ ",
          "وَ رَجُلٌ كَانَ لَهُ مَالٌ فَأَفْسَدَهُ فَيَقُولُ اللَّهُمَّ ارْزُقْنِي فَيُقَالُ لَهُ أَ لَمْ آمُرْكَ بِالِاقْتِصَادِ أَ لَمْ آمُرْكَ بِالْإِصْلَاحِ ثُمَّ قَالَ وَ الَّذِينَ إِذا أَنْفَقُوا لَمْ يُسْرِفُوا وَ لَمْ يَقْتُرُوا وَ كانَ بَيْنَ ذلِكَ قَواماً وَ رَجُلٌ كَانَ لَهُ مَالٌ فَأَدَانَهُ بِغَيْرِ بَيِّنَةٍ فَيُقَالُ لَهُ أَ لَمْ آمُرْكَ بِالشَّهَادَةِ .",
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عِمْرَانَ بْنِ أَبِي عَاصِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from Abdullah Bin Ibrahim, from Ja’far Bin Ibrahim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Four (people), a supplication for not be Answered for them – a man who sits in his house saying, ‘O Allah<sup>azwj</sup>! Grace me sustenance’. So He<sup>azwj</sup> would Say to him: “Did I<sup>azwj</sup> not Command you with the seeking (of the livelihood)?” and a man who has a wife for him, so he supplicates against her, so He<sup>azwj</sup> would Say to him: “Did I<sup>azwj</sup> not Make her matter to you?”. ",
            "And a man who had wealth for him, so he spoilt it, so He<sup style=\"font-weight: normal\">azwj</sup> would Say to him: ‘Grace me sustenance’. So He<sup style=\"font-weight: normal\">azwj</sup> would Say to him: “Did I<sup style=\"font-weight: normal\">azwj</sup> not Command you with the moderation? Did I<sup style=\"font-weight: normal\">azwj</sup> not Command you with the righteousness?”. Then He<sup style=\"font-weight: normal\">azwj</sup> Says <span class=\"ibTxt\"><a href=\"/#/books/quran:25#h67\">[25:67]</a> And they who when they spend, are neither extravagant nor stingy, and between that by stature</span>”; and a man who did have wealth for him, but he lent it without any evidence, so He<sup style=\"font-weight: normal\">azwj</sup> would Say to him: “Did I<sup style=\"font-weight: normal\">azwj</sup> not Command you with the witnessing?’ ",
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Imran Bin Abu Aasim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn Faddal from ‘Abd Allah ibn Ibrahim from Ja’far ibn Ibrahim from abu ‘Abd Allah (a.s.) who has said the following: “The prayers of four kinds of people are not heard: a man who sits home and says, ‘O Lord, grant me sustenance,’ and it is said to him, “Have I not commanded you to work?” a man who is troubled by his wife so he prays for relief, but he will be asked, ‘Have 1 not made dissolving marriage lawful?’ A man who has destroyed his wealth and asks, ‘O Lord, grant me wealth,’ he will be asked, “Have I not commanded you to spend it moderately and have I not commanded you to make corrections?” Then the Imam read from the Holy Quran, ‘. . . who in their spending are neither extravagant nor stingy but maintain moderation,’ <a href=\"/#/books/quran:25#h67\">[25:67]</a> and a man who lends money to others without witnesses as evidence and it is said to him, ‘Have I not commanded you to ask for witnesses as testimony?”’ Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Umar ibn abu ‘Asim from abu ‘Abd Allah (a.s.) a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/176)"
        ],
        "index": 3236,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:32:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ قَالَ سَمِعْتُهُ يَقُولُ ثَلَاثَةٌ تُرَدُّ عَلَيْهِمْ دَعَوْتُهُمْ رَجُلٌ رَزَقَهُ اللَّهُ مَالًا فَأَنْفَقَهُ فِي غَيْرِ وَجْهِهِ ثُمَّ قَالَ يَا رَبِّ ارْزُقْنِي فَيُقَالُ لَهُ أَ لَمْ أَرْزُقْكَ ",
          "وَ رَجُلٌ دَعَا عَلَى امْرَأَتِهِ وَ هُوَ لَهَا ظَالِمٌ فَيُقَالُ لَهُ أَ لَمْ أَجْعَلْ أَمْرَهَا بِيَدِكَ وَ رَجُلٌ جَلَسَ فِي بَيْتِهِ وَ قَالَ يَا رَبِّ ارْزُقْنِي فَيُقَالُ لَهُ أَ لَمْ أَجْعَلْ لَكَ السَّبِيلَ إِلَى طَلَبِ الرِّزْقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Al Washa, from Abdullah Bin Sinan, from Al Waleed Bin Sabeeh who said, ",
            "‘I heard him<sup>asws</sup> saying: ‘Three (people), their supplication would not be returned upon them – a man whom Allah<sup>azwj</sup> had Graced wealth but he spent it in other than His<sup>azwj</sup> ways, then says, ‘O Lord<sup>azwj</sup>! Grace me sustenance’, so He<sup>azwj</sup> would Say to him: “Did I<sup>azwj</sup> not Grace you (before)?”. ",
            "And a man who supplicates against his unjust wife, so He<sup style=\"font-weight: normal\">azwj</sup> would Say to him: “Did I<sup style=\"font-weight: normal\">azwj</sup> not Make her matter to be in your hands?”; and a man who sits in his house and says, ‘O Lord<sup style=\"font-weight: normal\">azwj</sup>! Grace me sustenance’, so He<sup style=\"font-weight: normal\">azwj</sup> would be Saying to him: “Did I<sup style=\"font-weight: normal\">azwj</sup> not Make the way for you to seek the sustenance?”’."
          ],
          "en.sarwar": [
            "3. Al-Husayn ibn Muhammad al-Ash’ari has narrated from Mu’alla ibn Muhammad from al-Washsha’ from ‘Abd Allah ibn Sinan from al-Walid ibn Sabih who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘The prayer of three kinds of people is not accepted: a man to whom Allah has granted wealth but spends it improperly and then says, “O Lord, grant me wealth,” to him it is said, ‘Did I not give you wealth?’ A man who prays against his unjust wife, and it is said to him, ‘Have I not left her affairs to you (dissolving of marriage lawful)?’ A man who sits idle and prayers, ‘O Lord, grant me sustenance,’ and to him it is said, ‘Have I not made ways how to make a living?”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:2:32",
  "kind": "verse_list"
}