{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:2:2:33",
        "titles": {
          "ar": "بَابُ الدُّعَاءِ عَلَى الْعَدُوِّ",
          "en": "Chapter 33 – The supplication against the enemy"
        }
      }
    ],
    "index": 430,
    "local_index": 33,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:2:2:34",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْمُبَاهَلَةِ</span>",
          "en": "Chapter 34 – The Imprecation (Mubahila)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:2:2:32",
        "titles": {
          "ar": "بَابُ مَنْ لَا تُسْتَجَابُ دَعْوَتُهُ",
          "en": "Chapter 32 – The one whose supplication is not Answered"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:2:33",
    "titles": {
      "ar": "بَابُ الدُّعَاءِ عَلَى الْعَدُوِّ",
      "en": "Chapter 33 – The supplication against the enemy"
    },
    "verse_count": 5,
    "verse_start_index": 3236,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/176)"
        ],
        "index": 3237,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "يَحْيَى بْنِ الْمُبَارَكِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/60",
              "text": "عَبْدِ اللَّهِ بْنِ جَبَلَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:33:1",
        "text": [
          " شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَاراً لِي وَ مَا أَلْقَى مِنْهُ قَالَ فَقَالَ لِيَ ادْعُ عَلَيْهِ ",
          "قَالَ فَفَعَلْتُ فَلَمْ أَرَ شَيْئاً فَعُدْتُ إِلَيْهِ فَشَكَوْتُ إِلَيْهِ فَقَالَ لِيَ ادْعُ عَلَيْهِ قَالَ فَقُلْتُ جُعِلْتُ فِدَاكَ قَدْ فَعَلْتُ فَلَمْ أَرَ شَيْئاً فَقَالَ كَيْفَ دَعَوْتَ عَلَيْهِ فَقُلْتُ إِذَا لَقِيتُهُ دَعَوْتُ عَلَيْهِ قَالَ فَقَالَ ادْعُ عَلَيْهِ إِذَا أَدْبَرَ وَ إِذَا اسْتَدْبَرَ فَفَعَلْتُ فَلَمْ أَلْبَثْ حَتَّى أَرَاحَ اللَّهُ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Yahya Bin Al Mubarak, from Abdullah Bin Jabala, from Is’haq Bin Ammar who said, ",
            "‘I complained to Abu Abdullah<sup>asws</sup> of a neighbour of mine and what I tend to face from him. So he<sup>asws</sup> said to me: ‘Supplicate against him’. ",
            "He (he narrator) said, ‘So I did, but I did not see anything’. So I returned to him<sup>asws</sup> and complained to him<sup>asws</sup>. So he<sup>asws</sup> said to me: ‘Supplicate against him’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! I have done so, but I did not see anything’. So he<sup>asws</sup> said: ‘How did you supplicate against him?’ So I said, ‘When I met him, I supplicated against him’. So he<sup>asws</sup> said: ‘Supplicate against him when he turns around’; and when he did turn around so I did it, and it was not long before Allah<sup>azwj</sup> Gave me rest from him’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Yahya ibn al- Mubarak from ‘Abd Allah ibn Jabalah from Ishaq ibn ‘Ammar who has said the following: “Once I complained before abu ‘Abd Allah (a.s.) about my neighbor and what 1 had suffered from him. The narrator has said that the Imam said, ‘Pray and plead before Allah against him.’ I did so and did not have any results and I went back to the Imam to complain. He said, ‘Pray against him.’ I said, ‘May Allah keep my soul in service for your cause, I have already done but have not seen any result.’ The Imam said, ‘How did you pray against him?’ I said, ‘When I met him I prayed against him.’ The Imam said, ‘Pray against him when he moves away from you.’ 1 then did as I was told and Allah very soon granted me relief.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/177)"
        ],
        "index": 3238,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2372",
              "text": "وَ رُوِيَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/373",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ رُوِيَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:33:2",
        "text": [
          " إِذَا دَعَا أَحَدُكُمْ عَلَى أَحَدٍ قَالَ.",
          "اللَّهُمَّ اطْرُقْهُ بِبَلِيَّةٍ لَا أُخْتَ لَهَا وَ أَبِحْ حَرِيمَهُ"
        ],
        "translations": {
          "en.hubeali": [
            "And it is reported from Abu Al-Hassan<sup>asws</sup> having said: ‘Whenever one of you supplicates against anyone, he should say, ",
            "‘O Allah<sup>azwj</sup>! Strike him with an affliction there being no comparison for it, and crack his sanctity’."
          ],
          "en.sarwar": [
            "2. It is narrated from abu al-Hassan (a.s.) who has said the following: “When any of you prays against the other person he should say, ‘O Lord, strike him with peerless misfortune in the night and allow his defenses to be ransacked.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/178)"
        ],
        "index": 3239,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1691",
              "text": "مَالِكِ بْنِ عَطِيَّةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1734",
              "text": "يُونُسَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ يُونُسَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:33:3",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ لِي جَاراً مِنْ قُرَيْشٍ مِنْ آلِ مُحْرِزٍ قَدْ نَوَّهَ بِاسْمِي وَ شَهَرَنِي كُلَّمَا مَرَرْتُ بِهِ قَالَ هَذَا الرَّافِضِيُّ يَحْمِلُ الْأَمْوَالَ إِلَى جَعْفَرِ بْنِ مُحَمَّدٍ ",
          "قَالَ فَقَالَ لِي فَادْعُ اللَّهَ عَلَيْهِ إِذَا كُنْتَ فِي صَلَاةِ اللَّيْلِ وَ أَنْتَ سَاجِدٌ فِي السَّجْدَةِ الْأَخِيرَةِ مِنَ الرَّكْعَتَيْنِ الْأُولَيَيْنِ فَاحْمَدِ اللَّهَ عَزَّ وَ جَلَّ وَ مَجِّدْهُ وَ قُلِ ",
          "اللَّهُمَّ إِنَّ فُلَانَ بْنَ فُلَانٍ قَدْ شَهَرَنِي وَ نَوَّهَ بِي وَ غَاظَنِي وَ عَرَضَنِي لِلْمَكَارِهِ اللَّهُمَّ اضْرِبْهُ بِسَهْمٍ عَاجِلٍ تَشْغَلْهُ بِهِ عَنِّي اللَّهُمَّ وَ قَرِّبْ أَجَلَهُ وَ اقْطَعْ أَثَرَهُ وَ عَجِّلْ ذَلِكَ يَا رَبِّ السَّاعَةَ السَّاعَةَ",
          "قَالَ فَلَمَّا قَدِمْنَا الْكُوفَةَ قَدِمْنَا لَيْلًا فَسَأَلْتُ أَهْلَنَا عَنْهُ قُلْتُ مَا فَعَلَ فُلَانٌ فَقَالُوا هُوَ مَرِيضٌ فَمَا انْقَضَى آخِرُ كَلَامِي حَتَّى سَمِعْتُ الصِّيَاحَ مِنْ مَنْزِلِهِ وَ قَالُوا قَدْ مَاتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Malik Bin Atiyya, from Yunus Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>: ‘There is a neighbour of mine from Qureysh from the family of Muhriz, who has noted my name and publicises me every time I pass by him saying, ‘This is the <span class=\"iTxt\">Rafizi</span> (rejector). He carries the wealth to Ja’far Bin Muhammad<sup>asws</sup>’ (instead of the ruling authorities)’.",
            "He (the narrator) said, ‘So he<sup style=\"font-weight: normal\">asws</sup> said to me: ‘So supplicate to Allah<sup style=\"font-weight: normal\">azwj</sup> against him when you were in the night <span class=\"iTxt\">Salat</span>, while you are prostrating during the last <span class=\"iTxt\">Sajdah</span> from the first two Cycles. So Praise Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic and Glorify Him<sup style=\"font-weight: normal\">azwj</sup> and said, ",
            "‘O Allah<sup style=\"font-weight: normal\">azwj</sup>! So and so, son of so and so has publicised me and is being aggressive with me, and has angered me and exposed me to the harrassment. O Allah<sup style=\"font-weight: normal\">azwj</sup>! Strike him with an arrow immediately for him to be too pre-occupied with it from me. O Allah<sup style=\"font-weight: normal\">azwj</sup>! And Draw closer his death, and Cut-off his traces, and Hasten that, O Lord<sup style=\"font-weight: normal\">azwj</sup>, this moment, this moment!’. ",
            "He (the narrator) said, ‘So when we proceded to Al Kufa, we arrived at night, and I asked our family members about him. I said, ‘What happenned to so and so?’ So they said, ‘He is sick’. So the end of my speech had not passed until I heard a shriek from his house, and they said that he had died’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Malik ibn ‘Atiyyah from Yunus ibn ‘Ammar who has said the following: “Once I said to abu ‘Abd Allah (a.s.) ‘I have a neighbor from Quraysh from the family of Muhriz who propagates against me negatively. Whenever I pass by he calls me a Rafida (rejecting successors to the Holy Prophet who are not special members of his family) and that I collect funds for Ja’far ibn Muhammad, recipient of divine supreme covenant.’ The Imam said, ‘Pray to Allah against him in the last Sajdah (prostration) of the second Rak’at of Tahajjud (nightly prayer). Praise Allah, the Most Majestic, the Most Holy, and glorify Him and say, ‘O Lord, so and so, son of so and so propagates against me negatively, he has caused me anger and has exposed me to danger, O Lord, strike him a quick arrow to divert him away from me, O Lord, bring the time of his death closer, eliminate his traces and make it fast, O Lord, in this hour, in this hour!’ When I arrived in al-Kufa during the night and asked my family about him, how is so and so doing? They told me that he was ill. My words were not finished when I heard crying from the house of that man. They said that he had died.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/179)"
        ],
        "index": 3240,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2070",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2020",
              "text": "عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/92",
              "text": "عَلِيِّ بْنِ أَسْبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1329",
              "text": "يَعْقُوبَ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ يَعْقُوبَ بْنِ سَالِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:33:4",
        "text": [
          " كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ الْعَلَاءُ بْنُ كَامِلٍ إِنَّ فُلَاناً يَفْعَلُ بِي وَ يَفْعَلُ فَإِنْ رَأَيْتَ أَنْ تَدْعُوَ اللَّهَ عَزَّ وَ جَلَّ فَقَالَ هَذَا ضَعْفٌ بِكَ قُلِ.",
          "اللَّهُمَّ إِنَّكَ تَكْفِي مِنْ كُلِّ شَيْ‏ءٍ وَ لَا يَكْفِي مِنْكَ شَيْ‏ءٌ فَاكْفِنِي أَمْرَ فُلَانٍ بِمَ شِئْتَ وَ كَيْفَ شِئْتَ وَ مِنْ حَيْثُ شِئْتَ وَ أَنَّى شِئْتَ"
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Al Kufy, from Ali Bin Al Hassan Al Taymi, from Ali Bin Asbaat, from Yaqoub Bin Salim who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, and Al-A’ala Bin Kamil said to him<sup>asws</sup>, ‘So and so goes against me, and goes against me. So if you<sup>asws</sup> view proper, you<sup>asws</sup> could supplicate to Allah<sup>azwj</sup> Mighty and Majestic’. So he<sup>asws</sup> said: ‘This is weakness with you. Say, ",
            "‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> Suffice me from everything and nothing can suffice from You<sup>azwj</sup>, therefore Suffice me with the matter of so and so with whatever You<sup>azwj</sup> so Desire to, and from wherever You<sup>azwj</sup> so Desire to, and whenever You<sup>azwj</sup> so Desire to’’."
          ],
          "en.sarwar": [
            "4. Ahmad ibn Muhammad al-Kufi has narrated from Ali ibn al-Hassan al-Taymi from Ali ibn Asbat from Ya’qub ibn Salim who has said the following: “Once I was in the presence of abu ‘Abd Allah (a.s.) and al-‘Ala’ ibn Kamil said to him, ‘So and so acts against me again and again, if you consider it proper, pray to Allah, the Most Majestic, the Most Holy.’ The Imam said, ‘This is more than enough for you. Say, “O Lord, You are sufficient for everything and nothing is sufficient for You. Suffice me in the matters of so and so with whatever You wish, in whatever way You wish, from wherever You wish and whenever You wish.’” "
          ]
        }
      },
      {
        "index": 3241,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/78",
              "text": "ابْنِ أَبِي نَجْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2373",
              "text": "الْمِسْمَعِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْمِسْمَعِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:33:5",
        "text": [
          " لَمَّا قَتَلَ دَاوُدُ بْنُ عَلِيٍّ الْمُعَلَّى بْنَ خُنَيْسٍ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَأَدْعُوَنَّ اللَّهَ عَلَى مَنْ قَتَلَ مَوْلَايَ وَ أَخَذَ مَالِي فَقَالَ لَهُ دَاوُدُ بْنُ عَلِيٍّ إِنَّكَ لَتُهَدِّدُنِي بِدُعَائِكَ ",
          "قَالَ حَمَّادٌ قَالَ الْمِسْمَعِيُّ فَحَدَّثَنِي مُعَتِّبٌ أَنَّ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) لَمْ يَزَلْ لَيْلَتَهُ رَاكِعاً وَ سَاجِداً فَلَمَّا كَانَ فِي السَّحَرِ سَمِعْتُهُ يَقُولُ وَ هُوَ سَاجِدٌ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِقُوَّتِكَ الْقَوِيَّةِ وَ بِجَلَالِكَ الشَّدِيدِ الَّذِي كُلُّ خَلْقِكَ لَهُ ذَلِيلٌ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ أَهْلِ بَيْتِهِ وَ أَنْ تَأْخُذَهُ السَّاعَةَ السَّاعَةَ ",
          "فَمَا رَفَعَ رَأْسَهُ حَتَّى سَمِعْنَا الصَّيْحَةَ فِي دَارِ دَاوُدَ بْنِ عَلِيٍّ فَرَفَعَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) رَأْسَهُ وَ قَالَ إِنِّي دَعَوْتُ اللَّهَ بِدَعْوَةٍ بَعَثَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ مَلَكاً فَضَرَبَ رَأْسَهُ بِمِرْزَبَةٍ مِنْ حَدِيدٍ انْشَقَّتْ مِنْهَا مَثَانَتُهُ فَمَاتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Najran, from Hammad Bin Usman, from Al Misma’a who said, ",
            "‘When Dawood Bin Ali killed Al-Moalla Bin Khunays, Abu Abdullah<sup>asws</sup> said: ‘I<sup>asws</sup> will be supplicating to Allah<sup>azwj</sup> against the one who killed my<sup>asws</sup> friend and seized my<sup>asws</sup> wealth’. So Dawood Bin Ali said to him<sup>asws</sup>, ‘You<sup>asws</sup> are threatening me with your<sup>asws</sup> supplication?’ ",
            "Hammad (the second narrator) said, ‘Al-Misma’a (the first narrator) said, ‘Mo’tab  (a narrator) narrated to me that Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> did not cease to be in <span class=\"iTxt\">Ruku’u</span> and <span class=\"iTxt\">Sajdah</span> during his<sup style=\"font-weight: normal\">asws</sup> night. So when it was pre-dawn, I heard him<sup style=\"font-weight: normal\">asws</sup> saying while he was in <span class=\"iTxt\">Sajdah</span>: ‘O Allah<sup style=\"font-weight: normal\">azwj</sup>! I<sup style=\"font-weight: normal\">asws</sup> ask You<sup style=\"font-weight: normal\">azwj</sup> with Your<sup style=\"font-weight: normal\">azwj</sup> Strength and with Your<sup style=\"font-weight: normal\">azwj</sup> Intense Majesty which every creature is servile, that You<sup style=\"font-weight: normal\">azwj</sup> Send <span class=\"iTxt\">Salaw</span>ā<span class=\"iTxt\">t</span> upon Muhammad<sup style=\"font-weight: normal\">saww</sup> and the People<sup style=\"font-weight: normal\">asws</sup> of his<sup style=\"font-weight: normal\">saww</sup> Household, and that You<sup style=\"font-weight: normal\">azwj</sup> Seize him at the moment, at the moment!’. ",
            "So he<sup style=\"font-weight: normal\">asws</sup> had not raised his<sup style=\"font-weight: normal\">asws</sup> head until we heard the shriek in the house of Dawood Bin Ali. So Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> raised his<sup style=\"font-weight: normal\">asws</sup> head and said: ‘I<sup style=\"font-weight: normal\">asws</sup> supplicated to Allah<sup style=\"font-weight: normal\">azwj</sup> with a supplication, Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Sent an Angel upon him, so he struck his head with an iron sledgehammer, his bladder split from it, so he died’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu Najran from Hammad ibn ‘Uthman from al-Misma’I who has said that when Dawud ibn Ali killed al-Mu’alla’ ibn Khunays, abu ‘Abd Allah (a.s.) said the following: “Abu ‘Abd Allah (a.s.) said, ‘I will pray to Allah against whoever has murdered my Mawla (servant) and has seized my property.’ Dawud ibn Ali then said, ‘You threaten me with your prayer! (But I am not afraid).’ Hammad has said that al-Misma’i said that Mu’attib said to me, ‘Abu ‘Abd Allah (a.s.) that night continued his Ruku ’ and Sajdah and, when it was morning, I hear him saying in Sajdah (prostration) “O Lord, I ask You through Your power that is strong, through Your glory that is intense, that has humbled Your creatures, grant favors to Muhammad and his family and seize him (the enemy) in this hour! Seize him in this hour!’ He had not yet raised his head that we heard crying and wailing from the house of Dawud ibn Ali. Abu ‘Abd Allah (a.s.) raised his head and said, ‘I prayed to Allah with a prayer and Allah, the Most Majestic, the Most Holy, sent an angel over him to hit his head with an iron bar that ruptured his bladder and caused his death.’” Note: Dawud ibn Ali was the governor of Madinah during the rule of abu al- ‘Abbas al-Saffah. He ordered al-Mu’alla to identify for him every Shi’a (follower A ’ immah ) of abu ‘Abd Allah, recipient of divine supreme covenant. He refused saying, ‘Even if they were under my foot I would not raise it to expose them.’ He was murdered and the properties of abu ‘Abd Allah (a.s.) with him was seized. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:2:33",
  "kind": "verse_list"
}