{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:2:2", "titles": {"ar": "كِتَابُ الدُّعَاءِ", "en": "THE BOOK OF SUPPLICATION"}}, {"indexed_titles": {"en": "Chapter 34"}, "path": "/books/al-kafi:2:2:34", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْمُبَاهَلَةِ</span>", "en": "Chapter 34 – The Imprecation (Mubahila)"}}], "index": 431, "local_index": 34, "part_type": "Chapter", "path": "/books/al-kafi:2:2:34", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْمُبَاهَلَةِ</span>", "en": "Chapter 34 – The Imprecation (Mubahila)"}, "verse_count": 5, "verse_start_index": 3241, "verses": [{"index": 3242, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:2:34:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ عَنْ أَبِي مَسْرُوقٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ إِنَّا نُكَلِّمُ النَّاسَ فَنَحْتَجُّ عَلَيْهِمْ بِقَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ فَيَقُولُونَ نَزَلَتْ فِي أُمَرَاءِ السَّرَايَا \nفَنَحْتَجُّ عَلَيْهِمْ بِقَوْلِهِ عَزَّ وَ جَلَّ إِنَّما وَلِيُّكُمُ اللَّهُ وَ رَسُولُهُ إِلَى آخِرِ الْآيَةِ فَيَقُولُونَ نَزَلَتْ فِي الْمُؤْمِنِينَ وَ نَحْتَجُّ عَلَيْهِمْ بِقَوْلِ اللَّهِ عَزَّ وَ جَلَّ قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ فِي الْقُرْبى فَيَقُولُونَ نَزَلَتْ فِي قُرْبَى الْمُسْلِمِينَ\nقَالَ فَلَمْ أَدَعْ شَيْئاً مِمَّا حَضَرَنِي ذِكْرُهُ مِنْ هَذِهِ وَ شِبْهِهِ إِلَّا ذَكَرْتُهُ فَقَالَ لِي إِذَا كَانَ ذَلِكَ فَادْعُهُمْ إِلَى الْمُبَاهَلَةِ قُلْتُ وَ كَيْفَ أَصْنَعُ \nقَالَ أَصْلِحْ نَفْسَكَ ثَلَاثاً وَ أَظُنُّهُ قَالَ وَ صُمْ وَ اغْتَسِلْ وَ ابْرُزْ أَنْتَ وَ هُوَ إِلَى الْجَبَّانِ فَشَبِّكْ أَصَابِعَكَ مِنْ يَدِكَ الْيُمْنَى فِي أَصَابِعِهِ ثُمَّ أَنْصِفْهُ وَ ابْدَأْ بِنَفْسِكَ وَ قُلِ اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَ رَبَّ الْأَرَضِينَ السَّبْعِ عَالِمَ الْغَيْبِ وَ الشَّهَادَةِ الرَّحْمَنَ الرَّحِيمَ إِنْ كَانَ أَبُو مَسْرُوقٍ جَحَدَ حَقّاً وَ ادَّعَى بَاطِلًا فَأَنْزِلْ عَلَيْهِ حُسْبَاناً مِنَ السَّمَاءِ أَوْ عَذَاباً أَلِيماً \nثُمَّ رُدَّ الدَّعْوَةَ عَلَيْهِ فَقُلْ وَ إِنْ كَانَ فُلَانٌ جَحَدَ حَقّاً وَ ادَّعَى بَاطِلًا فَأَنْزِلْ عَلَيْهِ حُسْبَاناً مِنَ السَّمَاءِ أَوْ عَذَاباً أَلِيماً \nثُمَّ قَالَ لِي فَإِنَّكَ لَا تَلْبَثُ أَنْ تَرَى ذَلِكَ فِيهِ فَوَ اللَّهِ مَا وَجَدْتُ خَلْقاً يُجِيبُنِي إِلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Hakeym, from Abu Masrouq, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘We speak to the people, so we argue against them by the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:59] O you who believe! Obey Allah and obey the Rasool and those in authority from among you</span>. But, they are saying, ‘It was Revealed regarding the commanders of the battalions’.\nSo we argue against them by the Words of the Mighty and Majestic <span class=\"ibTxt\">[5:55] But rather, only Allah is your Guardian and His Rasool </span>– up to the end of the Verse. But they are saying, ‘It was Revealed regarding the <span class=\"iTxt\">Momin</span>een’. And we are arguing against them by the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[42:23] Say: I do not ask of you any Recompense for it except for the cordiality for my near relatives</span>. But they are saying, ‘It was Revealed regarding the relatives of the Muslims’. \nHe (the narrator) said, ‘So I did not leave anything for whatever presented to me, remembering it from these (arguments) and the likes of it, except that I mentioned it. So he<sup>asws</sup> said to me: ‘When it was like that, so call them to the (<span class=\"iTxt\">Mubahila</span>) imprecation’. I said, ‘And how should I deal with it?’ \nHe<sup>asws</sup> said: ‘Correct soul for three (days)’, and I think he<sup>asws</sup> said: ‘And Fast, wash, and you and him go to the mountain, so intertwine (crisscross) your fingers from your right hand in his fingers, then be fair with him, and begin with yourself and say, ‘O Allah<sup>azwj</sup>! Lord<sup>azwj</sup> of the seven skies and Lord<sup>azwj</sup> of the seven earths, Knower of the unseen and the seen, the Beneficent, the Merciful. If Abu Masrouq (the narrator himself) is denying the Truth and is claiming falsehood, so Send down upon him a thunderbolt from the sky, or a painful Punishment’. \nThen return the supplication upon him, so say, ‘And if so and so is denying the truth and claiming falsehood, so Send down upon him a thunderbolt from the sky or a painful Punishment’. \nThen he<sup style=\"font-weight: normal\">asws</sup> said to me: ‘So it won’t be long before you see that in him, for by Allah<sup style=\"font-weight: normal\">azwj</sup>, I<sup style=\"font-weight: normal\">asws</sup> have not found any creature who will answer me<sup style=\"font-weight: normal\">asws</sup> to it (the imprecation)’."}]}, {"index": 3243, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:2:34:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مَخْلَدٍ أَبِي الشُّكْرِ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ السَّاعَةُ الَّتِي تُبَاهِلُ فِيهَا مَا بَيْنَ طُلُوعِ الْفَجْرِ إِلَى طُلُوعِ الشَّمْسِ .\nعِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَخْلَدٍ أَبِي الشُّكْرِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ismail Bin Mihran, from Mukhlad Abu Al Shakr, from Abu Hamza Al Sumaly, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The timing during which the imprecation is to be performed is what is between the emergence of the dawn up to the emergence of the sun’. \nA number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ismail, from Makhlad Abu Al Shakr, from Abu Hamza, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> – similar to it."}]}, {"index": 3244, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:2:34:3", "text": "أَحْمَدُ عَنْ بَعْضِ أَصْحَابِنَا فِي الْمُبَاهَلَةِ قَالَ تُشَبِّكُ أَصَابِعَكَ فِي أَصَابِعِهِ ثُمَّ تَقُولُ اللَّهُمَّ إِنْ كَانَ فُلَانٌ جَحَدَ حَقّاً وَ أَقَرَّ بِبَاطِلٍ فَأَصِبْهُ بِحُسْبَانٍ مِنَ السَّمَاءِ أَوْ بِعَذَابٍ مِنْ عِنْدِكَ وَ تُلَاعِنُهُ سَبْعِينَ مَرَّةً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad, from one of our companions, \n‘Regarding the imprecation, he<sup>asws</sup> said: ‘Intertwine your fingers into his fingers, then you should be saying, O Allah<sup>azwj</sup>! If it was so that so and so has denied a truth and acknowledge with a falsehood, so either Hit him by a thunderbolt from the sky or with a Punishment from Your<sup>azwj</sup> Presence’, and you should curse him seventy times’."}]}, {"index": 3245, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:2:34:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْمُبَاهَلَةِ قَالَ تُشَبِّكُ أَصَابِعَكَ فِي أَصَابِعِهِ ثُمَّ تَقُولُ اللَّهُمَّ إِنْ كَانَ فُلَانٌ جَحَدَ حَقّاً وَ أَقَرَّ بِبَاطِلٍ فَأَصِبْهُ بِحُسْبَانٍ مِنَ السَّمَاءِ أَوْ بِعَذَابٍ مِنْ عِنْدِكَ وَ تُلَاعِنُهُ سَبْعِينَ مَرَّةً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Abu Al Abbas, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> ‘Regarding the imprecation, he<sup>asws</sup> said: ‘Intertwine your fingers into his fingers, then you should be saying, O Allah<sup>azwj</sup>! If it was so that so and so has denied a truth and acknowledge with a falsehood, so either Hit him by a thunderbolt from the sky or with a Punishment from Your<sup>azwj</sup> Presence’, and you should curse him seventy times’."}]}, {"index": 3246, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:2:34:5", "text": "مُحَمَّدُ بْنِ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي جَمِيلَةَ عَنْ بَعْضِ أَصْحَابِهِ قَالَ إِذَا جَحَدَ الرَّجُلُ الْحَقَّ فَإِنْ أَرَادَ أَنْ تُلَاعِنَهُ قُلِ.\nاللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَ رَبَّ الْأَرَضِينَ السَّبْعِ وَ رَبَّ الْعَرْشِ الْعَظِيمِ إِنْ كَانَ فُلَانٌ جَحَدَ الْحَقَّ وَ كَفَرَ بِهِ فَأَنْزِلْ عَلَيْهِ حُسْبَاناً مِنَ السَّمَاءِ أَوْ عَذَاباً أَلِيماً", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Abdul Hameed, from Abu Jameela, from one of his companions, \n‘He<sup>asws</sup> said: ‘When the man denies the truth and if you intend to curse him, say, \n‘O Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the seven skies and Lord<sup>azwj</sup> of the seven earths, and Lord<sup>azwj</sup> of the Magnificent Throne! If it was that so and so has denied the truth and disbelieved in it, so Send down upon him a thunderbolt from the sky or a painful Punishment’."}]}]}, "index": "al-kafi:2:2:34", "kind": "verse_list"}