{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:2:2:35",
        "titles": {
          "ar": "بَابُ مَا يُمَجِّدُ بِهِ الرَّبُّ تَبَارَكَ وَ تَعَالَى نَفْسَهُ",
          "en": "Chapter 35 – What the Lord<sup>azwj</sup> Blessed and High Glorified Himself<sup>azwj</sup> with"
        }
      }
    ],
    "index": 432,
    "local_index": 35,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:2:2:36",
        "titles": {
          "ar": "بَابُ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ",
          "en": "Chapter 36 – The one says, ‘There is no God except Allah<sup>azwj</sup>’"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:2:2:34",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْمُبَاهَلَةِ</span>",
          "en": "Chapter 34 – The Imprecation (Mubahila)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:2:35",
    "titles": {
      "ar": "بَابُ مَا يُمَجِّدُ بِهِ الرَّبُّ تَبَارَكَ وَ تَعَالَى نَفْسَهُ",
      "en": "Chapter 35 – What the Lord<sup>azwj</sup> Blessed and High Glorified Himself<sup>azwj</sup> with"
    },
    "verse_count": 2,
    "verse_start_index": 3246,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/189)"
        ],
        "index": 3247,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:35:1",
        "text": [
          " إِنَّ لِلَّهِ عَزَّ وَ جَلَّ ثَلَاثَ سَاعَاتٍ فِي اللَّيْلِ وَ ثَلَاثَ سَاعَاتٍ فِي النَّهَارِ يُمَجِّدُ فِيهِنَّ نَفْسَهُ فَأَوَّلُ سَاعَاتِ النَّهَارِ حِينَ تَكُونُ الشَّمْسُ هَذَا الْجَانِبَ يَعْنِي مِنَ الْمَشْرِقِ مِقْدَارَهَا مِنَ الْعَصْرِ يَعْنِي مِنَ الْمَغْرِبِ إِلَى الصَّلَاةِ الْأُولَى وَ أَوَّلُ سَاعَاتِ اللَّيْلِ فِي الثُّلُثِ الْبَاقِي مِنَ اللَّيْلِ إِلَى أَنْ يَنْفَجِرَ الصُّبْحُ ",
          "يَقُولُ إِنِّي ",
          "أَنَا اللَّهُ رَبُّ الْعَالَمِينَ إِنِّي أَنَا اللَّهُ الْعَلِيُّ الْعَظِيمُ إِنِّي أَنَا اللَّهُ الْعَزِيزُ الْحَكِيمُ إِنِّي أَنَا اللَّهُ الْغَفُورُ الرَّحِيمُ إِنِّي أَنَا اللَّهُ الرَّحْمَنُ الرَّحِيمُ إِنِّي أَنَا اللَّهُ مَالِكُ يَوْمِ الدِّينِ إِنِّي أَنَا اللَّهُ لَمْ أَزَلْ وَ لَا أَزَالُ إِنِّي أَنَا اللَّهُ خَالِقُ الْخَيْرِ وَ الشَّرِّ إِنِّي أَنَا اللَّهُ خَالِقُ الْجَنَّةِ وَ النَّارِ إِنِّي أَنَا اللَّهُ بَدِي‏ءُ كُلِّ شَيْ‏ءٍ وَ إِلَيَّ يَعُودُ",
          "إِنِّي أَنَا اللَّهُ الْوَاحِدُ الصَّمَدُ إِنِّي أَنَا اللَّهُ عَالِمُ الْغَيْبِ وَ الشَّهَادَةِ إِنِّي أَنَا اللَّهُ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ إِنِّي أَنَا اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لِيَ الْأَسْمَاءُ الْحُسْنَى إِنِّي أَنَا اللَّهُ الْكَبِيرُ الْمُتَعَالِ ",
          "قَالَ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مِنْ عِنْدِهِ وَ الْكِبْرِيَاءُ رِدَاؤُهُ فَمَنْ نَازَعَهُ شَيْئاً مِنْ ذَلِكَ أَكَبَّهُ اللَّهُ فِي النَّارِ ",
          "ثُمَّ قَالَ مَا مِنْ عَبْدٍ مُؤْمِنٍ يَدْعُو بِهِنَّ مُقْبِلًا قَلْبُهُ إِلَى اللَّهِ عَزَّ وَ جَلَّ إِلَّا قَضَى حَاجَتَهُ وَ لَوْ كَانَ شَقِيّاً رَجَوْتُ أَنْ يُحَوَّلَ سَعِيداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Safwan Bin Yahya, from Is’haq Bin Ammar, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘For Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic there are four timings during the night, and three timings during the day in which He<sup style=\"font-weight: normal\">azwj</sup> Glorifies Himself<sup style=\"font-weight: normal\">azwj</sup>. So the first timing of the day is when the sun happens to be on this side, meaning from the east its measurement from Al-Asr, meaning from the west, up to the first <span class=\"iTxt\">Salat</span>; and the first timing of the night during the remaining third from the night up to the morning breaking forth. ",
            "He<sup>azwj</sup> is Saying: ",
            "“I<sup>azwj</sup> am Allah<sup>azwj</sup>! Lord<sup>azwj</sup> of the worlds. I<sup>azwj</sup> am Allah<sup>azwj</sup>, the Mighty, the Wise! I<sup>azwj</sup> am Allah<sup>azwj</sup>, the Forgiver, the Merciful! I<sup>azwj</sup> am Allah<sup>azwj</sup>, the Beneficent, the Merficul! I<sup>azwj</sup> am Allah<sup>azwj</sup> Allah<sup>azwj</sup>, the Master of the Day of the Religion (Judgment). I<sup>asws</sup> Allah<sup>azwj</sup>, I<sup>azwj</sup> neither do I<sup>azwj</sup> decline nor will I<sup>azwj</sup> cease to be. I<sup>azwj</sup> am Allah<sup>azwj</sup>, Creator of the good and the evil. I<sup>azwj</sup> am Allah<sup>azwj</sup>, Creator of the Paradise and the Fire. I<sup>azwj</sup> am Allah<sup>azwj</sup>, the Initiator of everything, to Me<sup>azwj</sup> it would all return. ",
            "I<sup style=\"font-weight: normal\">azwj</sup> am Allah<sup style=\"font-weight: normal\">azwj</sup>, the Alone, the Last. I<sup style=\"font-weight: normal\">azwj</sup> am Allah<sup style=\"font-weight: normal\">azwj</sup> the Knower of the unseen and the seen. I<sup style=\"font-weight: normal\">azwj</sup> am Allah<sup style=\"font-weight: normal\">azwj</sup> the King, the Holy, the Source of safety, the Securor, the Controller, the Mighty, the Compeller, the Supreme. I<sup style=\"font-weight: normal\">azwj</sup> am Allah<sup style=\"font-weight: normal\">azwj</sup> the Creator, the Evolver, the Designer. For Me<sup style=\"font-weight: normal\">azwj</sup> are the Good Names. I<sup style=\"font-weight: normal\">azwj</sup> am Allah<sup style=\"font-weight: normal\">azwj</sup>, the Greatest, the Exalted”’. ",
            "He (the narrator) said, ‘Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said from himself<sup style=\"font-weight: normal\">asws</sup>: ‘And the Greatness is His<sup style=\"font-weight: normal\">azwj</sup> Robe, so the one who snatches anything from that, Allah<sup style=\"font-weight: normal\">azwj</sup> would Fling him into the Fire’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘There is none from a <span class=\"iTxt\">Momin</span> servant who supplicates with these being attentive with his heart towards Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic, except his need would be Fulfilled, and if he was unfortunate, hoping, he would be transformed to be a fortunate one’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Safwan ibn Y ahya from Ishaq ibn ‘Ammar from certain individuals of his people from abu ‘Abd Allah (a.s.) who has said the following: “In three hours of the day and in three hours of the night Allah, the Majestic, the Glorious, glorifies Himself. The first hours of the day begin when the distance of the sun from this side, the East, is equal to that between ‘Asr (the beginning of afternoon prayer), on the West, and the start of the time of the first prayer (prayer at noon time), and the first hours of night which begin with the start of the remaining one third of the night to dawn. “Allah says, ‘I am Allah, Cherisher of the worlds, I am Allah, the Most High, the Most Great, I am Allah, the Most Majestic, the Most Wise, I am Allah, the Most Forgiving, the Most Merciful, I am Allah, the Beneficent, the Merciful, I am Allah, the Owner of the Day of Judgment, I am Allah, Who has always been and will be, I am Allah, the Creator of the good and bad, I am Allah, the Creator of paradise and fire, I am Allah, the Initiator of all things and to Me it returns, I am Allah, the only One and Self-sufficient, I am Allah, the Knower of the unseen and the seen, I am Allah, the Owner, the Holy, the Peace, the Protector, the Dominant, the Compeller, the One who is Proud, I am Allah, the Creator, the Designer, and the Shape-giver. 1 have all good names; I am Allah, the Great and the Most Lofty. ’ “The narrator has said that abu ‘Abd Allah (a.s.) then said in his own words, ‘Greatness is His dress. Whoever disputes Him in that, He (Allah) will throw him in fire.’ The Imam then said, ‘Whoever of the believing people prays to Him in these words turning with his heart to Allah, the Most Majestic, the Most Holy, He will grant his wish. Even if he is a person of evil fortune, I hope he will change into a person of good fortune.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/196)"
        ],
        "index": 3248,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/458",
              "text": "عَبْدِ اللَّهِ بْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2148",
              "text": "عَبْدِ اللَّهِ بْنِ أَعْيَنَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَعْيَنَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:35:2",
        "text": [
          " إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يُمَجِّدُ نَفْسَهُ فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ ثَلَاثَ مَرَّاتٍ فَمَنْ مَجَّدَ اللَّهَ بِمَا مَجَّدَ بِهِ نَفْسَهُ ثُمَّ كَانَ فِي حَالِ شِقْوَةٍ حَوَّلَهُ اللَّهُ عَزَّ وَ جَلَّ إِلَى سَعَادَةٍ",
          "يَقُولُ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ رَبُّ الْعَالَمِينَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الرَّحْمَنُ الرَّحِيمُ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْعَزِيزُ الْعَلِيُّ الْكَبِيرُ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ مَالِكُ يَوْمِ الدِّينِ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْغَفُورُ الرَّحِيمُ",
          "أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْعَزِيزُ الْحَكِيمُ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ مِنْكَ بَدَأَ الْخَلْقُ وَ إِلَيْكَ يَعُودُ أَنْتَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا أَنْتَ لَمْ تَزَلْ وَ لَا تَزَالُ أَنْتَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا أَنْتَ خَالِقُ الْخَيْرِ وَ الشَّرِّ",
          "أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ خَالِقُ الْجَنَّةِ وَ النَّارِ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ أَحَدٌ صَمَدٌ لَمْ يَلِدْ وَ لَمْ يُولَدُ وَ لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ",
          "سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَ الْأَرْضِ وَ هُوَ الْعَزِيزُ الْحَكِيمُ إِلَى آخِرِ السُّورَةِ ",
          "أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْكَبِيرُ وَ الْكِبْرِيَاءُ رِدَاؤُكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Fazzal, from Abdullah Bin Bukeyr, from Abdullah Bin Ayn, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Blessed and High Glorifies Himself<sup>saww</sup> three times during every day and night. So the one who Glorifies Allah<sup>azwj</sup> with what He<sup>azwj</sup> Glorified Himself<sup>azwj</sup> with, then he was in a state of complaint, Allah<sup>azwj</sup> Mighty and Majestic would Transform him to a fortunate state. ",
            "He should be Saying: ‘You<sup>azwj</sup> are Allah<sup>azwj</sup>, there is no god except for You<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds! You<sup>azwj</sup> are Allah<sup>azwj</sup> the Beneficent, the Merciful! You<sup>azwj</sup> are Allah<sup>azwj</sup>, there is no God excep for You<sup>azwj</sup>, the Mighty, the Great. You<sup>azwj</sup> are Allah<sup>azwj</sup>, there is no God except for You<sup>azwj</sup>, the Master of the Day of the Religion (Judgment). You<sup>azwj</sup> are Allah<sup>azwj</sup>! There is no God except You<sup>azwj</sup>, the Forgiving, the Merciful.",
            "You<sup>azwj</sup> are Allah<sup>azwj</sup>, there is no god except for You<sup>azwj</sup>, the Mighty, the Wise! You<sup>azwj</sup> are Allah<sup>azwj</sup>, there is no god except for You<sup>azwj</sup>, The Creation began with You<sup>azwj</sup> and to You<sup>azwj</sup> it will return. You<sup>azwj</sup> are Allah<sup>azwj</sup> Who, there is no God except You<sup>azwj</sup>, neither do You<sup>azwj</sup> decline nor will You<sup>azwj</sup> Cease to be. You<sup>azwj</sup> are Allah<sup>azwj</sup>, Who there is no God except You<sup>azwj</sup>, the Creator of the good and the evil. ",
            "You<sup>azwj</sup> are Allah<sup>azwj</sup>, there is no god except for You<sup>azwj</sup>, Creator of the Paradise and the Fire. You<sup>azwj</sup> are Allah<sup>azwj</sup>, there is no god except for You<sup>azwj</sup>, One, Last, neither do You<sup>azwj</sup> beget nor are You<sup>azwj</sup> begotten, nor will anyone be a match for You<sup>azwj</sup>. You<sup>azwj</sup> are Allah<sup>azwj</sup>, there is no god except for You<sup>azwj</sup>, the King, the Holy, the the Source of safety, the Securer, the Controller, the Mighty, the Compeller, the Supreme. ",
            "Glory be to Allah<sup>azwj</sup> from what they are associating. He<sup>azwj</sup> is Allah<sup>azwj</sup>, the Creator, the Originator, the Designer. For Him<sup>azwj</sup> are the Good Names. There Glorifies to Him<sup>azwj</sup> whatever is in the skies and the earth, and He<sup>azwj</sup> is the Mighty, the Wise’ – up to the end of the Chapter (59).",
            "You<sup style=\"font-weight: normal\">azwj</sup> are Allah<sup style=\"font-weight: normal\">azwj</sup>. There is no god except You<sup style=\"font-weight: normal\">azwj</sup>, the Great, and the Greatness is Your<sup style=\"font-weight: normal\">azwj</sup> Robe’’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from ibn Faddal from ‘Abd Allah ibn Bukayr from ‘Abd Allah ibn ‘A’Yun from abu ‘Abd Allah (a.s.) who has said the following: “Allah, the Most Blessed, the Most High, glorifies Himself three times every-day and night. Whoever glorifies Allah with the words with which He has glorified Himself, and happens to be in a condition of misfortune, Allah, the Most Majestic, the Most Holy, will turn him into a condition of good fortune. “He should say, ‘You are Allah, no one deserves to be worshipped except You, the Cherisher of the worlds. You are Allah; no one deserves to be worshipped except You, the Beneficent, the Merciful. You are Allah, no one deserves to be worshipped except You, the Most Majestic, the Most (High) Great, You are Allah, no one deserves to be worshipped except You, the Owner of the Day of Judgment. You are Allah. No one deserves to be worshipped except You, the Forgiving, the Merciful. You are Allah; no one deserves to be worshipped except You, the Majestic, the Wise. You are Allah, no one deserves to be worshipped except You, from You began the creatures and to You they return. You are Allah, (besides whom) no one deserves to be worshipped. You have always been and will always be. You are Allah, (besides whom) no one deserves to be worshipped, the Creator of the good and evil. You are Allah, no one deserves to be worshipped except You, the Creator of paradise and fire. You are Allah, no one deserves to be worshipped except You, the One, Self-sufficient, who has not given birth to any one and is not born from anyone and no one is His partner. ‘. . . You are Allah, no one deserves to be worshipped except You, the King, the Holy, the Peace, the Protector, the Dominant, the Majestic, the Compeller, the Proud. Allah is by far more Glorious than what they call His partners. He is Allah, the Creator, the Designer, the Shape-giver; His are the most beautiful names. All that is in heavens and in the earth glorify Him and He is the Majestic, the Wise ... - to be read to the end of Chapter 59. You are Allah, no one deserves to be worshipped except You, the Most Great for whom greatness is the dress.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:2:35",
  "kind": "verse_list"
}