{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:2:2", "titles": {"ar": "كِتَابُ الدُّعَاءِ", "en": "THE BOOK OF SUPPLICATION"}}, {"indexed_titles": {"en": "Chapter 51"}, "path": "/books/al-kafi:2:2:51", "titles": {"ar": "بَابُ الدُّعَاءِ قَبْلَ الصَّلَاةِ", "en": "Chapter 51 – The supplication before the Salāt"}}], "index": 448, "local_index": 51, "part_type": "Chapter", "path": "/books/al-kafi:2:2:51", "titles": {"ar": "بَابُ الدُّعَاءِ قَبْلَ الصَّلَاةِ", "en": "Chapter 51 – The supplication before the Salāt"}, "verse_count": 3, "verse_start_index": 3333, "verses": [{"index": 3334, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:2:51:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ مَنْ قَالَ هَذَا الْقَوْلَ كَانَ مَعَ مُحَمَّدٍ وَ آلِ مُحَمَّدٍ إِذَا قَامَ قَبْلَ أَنْ يَسْتَفْتِحَ الصَّلَاةَ \nاللَّهُمَّ إِنِّي أَتَوَجَّهُ إِلَيْكَ بِمُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أُقَدِّمُهُمْ بَيْنَ يَدَيْ صَلَاتِي وَ أَتَقَرَّبُ بِهِمْ إِلَيْكَ فَاجْعَلْنِي بِهِمْ وَجِيهاً فِي الدُّنْيَا وَ الْآخِرَةِ وَ مِنَ الْمُقَرَّبِينَ مَنَنْتَ عَلَيَّ بِمَعْرِفَتِهِمْ فَاخْتِمْ لِي بِطَاعَتِهِمْ وَ مَعْرِفَتِهِمْ وَ وَلَايَتِهِمْ فَإِنَّهَا السَّعَادَةُ وَ اخْتِمْ لِي بِهَا فَإِنَّكَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ\nثُمَّ تُصَلِّي فَإِذَا انْصَرَفْتَ قُلْتَ.\nاللَّهُمَّ اجْعَلْنِي مَعَ مُحَمَّدٍ وَ آلِ مُحَمَّدٍ فِي كُلِّ عَافِيَةٍ وَ بَلَاءٍ وَ اجْعَلْنِي مَعَ مُحَمَّدٍ وَ آلِ مُحَمَّدٍ فِي كُلِّ مَثْوًى وَ مُنْقَلَبٍ اللَّهُمَّ اجْعَلْ مَحْيَايَ مَحْيَاهُمْ وَ مَمَاتِي مَمَاتَهُمْ وَ اجْعَلْنِي مَعَهُمْ فِي الْمَوَاطِنِ كُلِّهَا وَ لَا تُفَرِّقْ بَيْنِي وَ بَيْنَهُمْ إِنَّكَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhamad Bin Isa, from Ali Bin Al Nu’man, from one of his companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was so that Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> was saying: ‘The one who says these words would be with Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, when he stands before beginning the <span class=\"iTxt\">Salāt</span>, \n‘O Allah<sup>azwj</sup>! I divert towards You<sup>azwj</sup> by Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and I<sup>asws</sup> advance them<sup>asws</sup> in front of me in my <span class=\"iTxt\">Salāt</span>, and I come closer by them<sup>asws</sup> to You<sup>azwj</sup>, therefore Make me, by them<sup>asws</sup>, to be dignified in the world and the Hereafter, and to be from the ones of Proximity. You<sup>azwj</sup> have Favoured upon me with their<sup>asws</sup> recognition, therefore Conclude me to be in their<sup>asws</sup> obedience, and their<sup>asws</sup> recognition, and their<sup>asws</sup> <span class=\"iTxt\">Wilyah</span>, for it is the happiness, and Conclude me to be with it, for You<sup>azwj</sup> are Able upon everything’. \nThen you should pray <span class=\"iTxt\">Salāt</span>. So when you finish, say, \n‘O Allah<sup>azwj</sup>! Make me to be with Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> in every well-being and affliction, and Make me to be with Muhammad<sup>azwj</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> in every lodgement and transfer. O Allah<sup>azwj</sup>! Make my life to be (like) their<sup>asws</sup> living, and my death to be (like) their<sup>asws</sup> passing away, and Make me to be with them<sup>asws</sup> in all the places, and not do Make a separation to be between me and them<sup>asws</sup>. You<sup>azwj</sup> are Able upon every thing’."}]}, {"index": 3335, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:2:51:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ قَالَ تَقُولُ قَبْلَ دُخُولِكَ فِي الصَّلَاةِ.\nاللَّهُمَّ إِنِّي أُقَدِّمُ مُحَمَّداً نَبِيَّكَ ( صلى الله عليه وآله ) بَيْنَ يَدَيْ حَاجَتِي وَ أَتَوَجَّهُ بِهِ إِلَيْكَ فِي طَلِبَتِي فَاجْعَلْنِي بِهِمْ وَجِيهاً فِي الدُّنْيَا وَ الْآخِرَةِ وَ مِنَ الْمُقَرَّبِينَ اللَّهُمَّ اجْعَلْ صَلَاتِي بِهِمْ مُتَقَبَّلَةً وَ ذَنْبِي بِهِمْ مَغْفُوراً وَ دُعَائِي بِهِمْ مُسْتَجَاباً يَا أَرْحَمَ الرَّاحِمِينَ", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of our companions, raising it, said, \n‘You should be saying before your entry into the <span class=\"iTxt\">Salāt</span>, \n‘O Allah<sup>azwj</sup>! I give the lead to Muhammad<sup>saww</sup> Your<sup>azwj</sup> Prophet<sup>saww</sup> to be in front of my need, and I divert by him<sup>saww</sup> to You<sup>azwj</sup> regarding my seeking, therefore Make me to be dignified by them<sup>asws</sup> in the world and the Hereafter, and to be from the ones of Proximity. O Allah<sup>azwj</sup>! Make my <span class=\"iTxt\">Salāt</span> to be Acceptable due to them<sup>asws</sup>, and my sins to be Forgiven due to them<sup>asws</sup>, and my supplication to be Answered due to them<sup>asws</sup>, O Most Merciful of the merciful ones!’."}]}, {"index": 3336, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:2:51:3", "text": "عَنْهُ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ صَفْوَانَ الْجَمَّالِ قَالَ شَهِدْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ اسْتَقْبَلَ الْقِبْلَةَ قَبْلَ التَّكْبِيرِ وَ قَالَ اللَّهُمَّ لَا تُؤْيِسْنِي مِنْ رَوْحِكَ وَ لَا تُقَنِّطْنِي مِنْ رَحْمَتِكَ وَ لَا تُؤْمِنِّي مَكْرَكَ فَإِنَّهُ لَا يَأْمَنُ مَكْرَ اللَّهِ إِلَّا الْقَوْمُ الْخَاسِرُونَ \nقُلْتُ جُعِلْتُ فِدَاكَ مَا سَمِعْتُ بِهَذَا مِنْ أَحَدٍ قَبْلَكَ فَقَالَ إِنَّ مِنْ أَكْبَرِ الْكَبَائِرِ عِنْدَ اللَّهِ الْيَأْسَ مِنْ رَوْحِ اللَّهِ وَ الْقُنُوطَ مِنْ رَحْمَةِ اللَّهِ وَ الْأَمْنَ مِنْ مَكْرِ اللَّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from his father, form Abdullah Bin Al Qasim, from Safwan Al Jammal who said, \n‘I witnessed Abu Abdullah<sup>asws</sup> and he<sup>asws</sup> was facing the Qiblah, before the exclamation of <span class=\"iTxt\">Takbeer</span> (to commence the <span class=\"iTxt\">Salāt</span>), and he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Do not Let me lose hope from Your<sup>azwj</sup> Spirit, nor despair from Your<sup>azwj</sup> mercy, nor feel safe from Your<sup>azwj</sup> Plan, for there would not feel safe from the Plan of Allah<sup>azwj</sup> except for the people incurring losses’. \nI said, ‘May I be sacrificed for you<sup>asws</sup>! I have not heard this from anyone (else) before you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘From the most grievous of the major sins in the Presence of Allah<sup>azwj</sup> is the hopelessness from the Spirit of Allah<sup>azwj</sup>, and the despair from the Mercy of Allah<sup>azwj</sup>, and the (feeling of) security from the Plan of Allah<sup>azwj</sup>’."}]}]}, "index": "al-kafi:2:2:51", "kind": "verse_list"}