{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 52"
        },
        "path": "/books/al-kafi:2:2:52",
        "titles": {
          "ar": "بَابُ الدُّعَاءِ فِي أَدْبَارِ الصَّلَوَاتِ",
          "en": "Chapter 52 – The supplication at the end of the Salāt"
        }
      }
    ],
    "index": 449,
    "local_index": 52,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 53"
        },
        "path": "/books/al-kafi:2:2:53",
        "titles": {
          "ar": "بَابُ الدُّعَاءِ لِلرِّزْقِ",
          "en": "Chapter 53 – The supplication for the sustenance"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 51"
        },
        "path": "/books/al-kafi:2:2:51",
        "titles": {
          "ar": "بَابُ الدُّعَاءِ قَبْلَ الصَّلَاةِ",
          "en": "Chapter 51 – The supplication before the Salāt"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:2:52",
    "titles": {
      "ar": "بَابُ الدُّعَاءِ فِي أَدْبَارِ الصَّلَوَاتِ",
      "en": "Chapter 52 – The supplication at the end of the Salāt"
    },
    "verse_count": 12,
    "verse_start_index": 3336,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/335)"
        ],
        "index": 3337,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ الْبَرْقِيِّ عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ الْقُمِّيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه )  يَقُولُ إِذَا فَرَغَ مِنَ الزَّوَالِ اللَّهُمَّ إِنِّي أَتَقَرَّبُ إِلَيْكَ بِجُودِكَ وَ كَرَمِكَ وَ أَتَقَرَّبُ إِلَيْكَ بِمُحَمَّدٍ عَبْدِكَ وَ رَسُولِكَ وَ أَتَقَرَّبُ إِلَيْكَ بِمَلَائِكَتِكَ الْمُقَرَّبِينَ وَ أَنْبِيَائِكَ الْمُرْسَلِينَ وَ بِكَ ",
          "اللَّهُمَّ أَنْتَ الْغَنِيُّ عَنِّي وَ بِيَ الْفَاقَةُ إِلَيْكَ أَنْتَ الْغَنِيُّ وَ أَنَا الْفَقِيرُ إِلَيْكَ أَقَلْتَنِي عَثْرَتِي وَ سَتَرْتَ عَلَيَّ ذُنُوبِي فَاقْضِ لِيَ الْيَوْمَ حَاجَتِي وَ لَا تُعَذِّبْنِي بِقَبِيحِ مَا تَعْلَمُ مِنِّي بَلْ عَفْوُكَ وَ جُودُكَ يَسَعُنِي ",
          "قَالَ ثُمَّ يَخِرُّ سَاجِداً وَ يَقُولُ يَا أَهْلَ التَّقْوَى وَ يَا أَهْلَ الْمَغْفِرَةِ يَا بَرُّ يَا رَحِيمُ أَنْتَ أَبَرُّ بِي مِنْ أَبِي وَ أُمِّي وَ مِنْ جَمِيعِ الْخَلَائِقِ اقْبَلْنِي بِقَضَاءِ حَاجَتِي مُجَاباً دُعَائِي مَرْحُوماً صَوْتِي قَدْ كَشَفْتَ أَنْوَاعَ الْبَلَايَا عَنِّي ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Abu Abdullah Al Narqy, from Isa Bin Abdullah Al Qummy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> was saying whenever he<sup>asws</sup> was free from the decline (midday <span class=\"iTxt\">Salāt</span>): ‘O Allah<sup>azwj</sup>! I<sup>asws</sup> come closer to You<sup>azwj</sup> by Your<sup>azwj</sup> Generosity and Your<sup>azwj</sup> Benevolence, and I<sup>asws</sup> come closer to You<sup>azwj</sup> by Muhammad<sup>azwj</sup> Your<sup>azwj</sup> servant and Your<sup>azwj</sup> Rasool<sup>saww</sup>, and I<sup>asws</sup> come closer to You<sup>azwj</sup> by Your<sup>azwj</sup> Angels of Proximity, and Your<sup>azwj</sup> Prophets<sup>as</sup>, the <span class=\"iTxt\">Mursileen</span>, and By You<sup>azwj</sup>.",
            "O Allah<sup>azwj</sup>! You<sup>azwj</sup> are the One Needless from me, and with me is the need (requirement) to You<sup>azwj</sup>. You<sup>saww</sup> are the rich and I am the poor to You<sup>azwj</sup>. You<sup>azwj</sup> Discharge my traces (of errors), and Veil my sins upon me. So Fulfil my needs for me today and do not Punish me with ugliness what You<sup>azwj</sup> are more Knowing of than I am. But, Amplify upon me, Your<sup>azwj</sup> Pardon and Your<sup>azwj</sup> generosity’. ",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘Then he<sup style=\"font-weight: normal\">asws</sup> would perform Sajdah and he<sup style=\"font-weight: normal\">asws</sup> would be saying: ‘O the One rightful to be feared, and O the One rightful for the Forgiveness, O Righteous, O Merciful! You<sup style=\"font-weight: normal\">azwj</sup> are more Righteous with me than my father and my mother, and from the entirety of the creatures. Accept me by Fulfilling my need by Answering my supplication, Merciful upon my voice as You<sup style=\"font-weight: normal\">azwj</sup> have Removed a variety of the afflictions from me’’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from abu ‘Abd Allah al-Barqi from ‘Isa ibn ‘Abd Allah al-Qummi from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib (a.s.) after completing the prayer at noon time would say, ‘O Lord, I seek nearness to You through Your generosity and magnanimity, I seek nearness to You through Muhammad, Your servant, and Your messenger, I seek nearness to You through Your favorite angels. Your messenger prophets and Your Own Self. O Lord, You are Self-sufficient and do not need me and I need You. You are wealthy and I am poor, correct my slips (mistakes) and cover up my sins, provide me help this day, do not punish me for the evil that You know of me, but pardon me and Your munificence may encompass me.’ The Imam said, ‘Then he would prostrate and say, “O You Who deserves people’s observing piety before Him, O You Who grants forgiveness, O Virtuous, and O Merciful, You are more kind to me than my father and mother and all the creatures, accept my plea in providing me help, answering my supplication and prayer, grant me favor for my call while You have already removed so many misfortunes from me.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/337)"
        ],
        "index": 3338,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنِ الصَّبَّاحِ بْنِ سَيَابَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ قَالَ إِذَا صَلَّى الْمَغْرِبَ ثَلَاثَ مَرَّاتٍ الْحَمْدُ لِلَّهِ الَّذِي يَفْعَلُ مَا يَشَاءُ وَ لَا يَفْعَلُ مَا يَشَاءُ غَيْرُهُ أُعْطِيَ خَيْراً كَثِيراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Al Sabbah Bin Sayaba, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who says, when he prays the Maghrib <span class=\"iTxt\">Salāt</span>, three times, ‘The Praise is for Allah<sup>azwj</sup> who Does whatever He<sup>azwj</sup> so Desires to, and does not Do what others desire’, would be Given a lot of goodness’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma’Il have narrated from al-Fadl ibn Shadhan all from ibn abu ‘Umayr from Ibrahim ibn ‘Abd al-Hamid from al-Sabbah ibn Sayabah from abu ‘Abd Allah (a.s.) who has said the following: “Whoever, after Maghrib prayer, says three times, ‘All praise belongs to Allah, Who does as He wills and does not do what others will,’ will receive a great deal of good.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع مضم ر  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/337)"
        ],
        "index": 3339,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ رَفَعَهُ قَالَ يَقُولُ بَعْدَ الْعِشَاءَيْنِ اللَّهُمَّ بِيَدِكَ مَقَادِيرُ اللَّيْلِ وَ النَّهَارِ وَ مَقَادِيرُ الدُّنْيَا وَ الْآخِرَةِ وَ مَقَادِيرُ الْمَوْتِ وَ الْحَيَاةِ وَ مَقَادِيرُ الشَّمْسِ وَ الْقَمَرِ وَ مَقَادِيرُ النَّصْرِ وَ الْخِذْلَانِ وَ مَقَادِيرُ الْغِنَى وَ الْفَقْرِ اللَّهُمَّ بَارِكْ لِي فِي دِينِي وَ دُنْيَايَ وَ فِي جَسَدِي وَ أَهْلِي وَ وُلْدِي اللَّهُمَّ ادْرَأْ عَنِّي شَرَّ فَسَقَةِ الْعَرَبِ وَ الْعَجَمِ وَ الْجِنِّ وَ الْإِنْسِ وَ اجْعَلْ مُنْقَلَبِي إِلَى خَيْرٍ دَائِمٍ وَ نَعِيمٍ لَا يَزُولُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, raising it, ",
            "‘He<sup>asws</sup> said: ‘One should be saying after the two evening <span class=\"iTxt\">Sal</span>ā<span class=\"iTxt\">t</span>s, ‘O Allah<sup>azwj</sup>! In Your<sup>azwj</sup> Hand is the Ordainment of the night and the day, and the Ordainment of the world and the Hereafter, and the Ordainment of the death and the life, and the Ordainment of the sun and the moon, and the Ordainment of the Help and the Abandonment, and the Ordainment of the riches and the poverty! Bless for me in my Religion, and in my world, and in my body, and in my family, and in my children. O Allah<sup>azwj</sup>! Stave off the evil from me, the mischief of the Arabs and the non-Arabs, and the Jinn, and the human beings, and Make my transfer to the eternal goodness and Bliss which will no be ceasing’’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father in a marfu’ manner has said the following: “The Imam (a.s.) after ‘Isha ’ prayer would say, ‘O Lord, in Your hand are the measures of the night and day, the measures of this and the next world, the measures of death and life, the measures of the sun and moon, support and betrayal, and the measures of wealth and poverty. O Lord, grant me blessings in the matters of my religion, worldly life, my body, my family and children. O Lord, keep away from me the evil of Arabs, non-Arabs, Jinns and human beings. Make my return to everlasting good and permanent bounties.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع مضمر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/339)"
        ],
        "index": 3340,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:4",
        "text": [
          "عَنْهُ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ مَنْ قَالَ بَعْدَ كُلِّ صَلَاةٍ وَ هُوَ آخِذٌ بِلِحْيَتِهِ بِيَدِهِ الْيُمْنَى يَا ذَا الْجَلَالِ وَ الْإِكْرَامِ ارْحَمْنِي مِنَ النَّارِ ثَلَاثَ مَرَّاتٍ وَ يَدُهُ الْيُسْرَى مَرْفُوعَةٌ وَ بَطْنُهَا إِلَى مَا يَلِي السَّمَاءَ ثُمَّ يَقُولُ أَجِرْنِي مِنَ الْعَذَابِ الْأَلِيمِ ثَلَاثَ مَرَّاتٍ",
          "ثُمَّ يُؤَخِّرُ يَدَهُ عَنْ لِحْيَتِهِ ثُمَّ يَرْفَعُ يَدَهُ وَ يَجْعَلُ بَطْنَهَا مِمَّا يَلِي السَّمَاءَ ثُمَّ يَقُولُ يَا عَزِيزُ يَا كَرِيمُ يَا رَحْمَانُ يَا رَحِيمُ وَ يَقْلِبُ يَدَيْهِ وَ يَجْعَلُ بُطُونَهُمَا مِمَّا يَلِي السَّمَاءَ ثُمَّ يَقُولُ أَجِرْنِي مِنَ الْعَذَابِ الْأَلِيمِ ثَلَاثَ مَرَّاتٍ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ الْمَلَائِكَةِ وَ الرُّوحِ غُفِرَ لَهُ وَ رُضِيَ عَنْهُ وَ وُصِلَ بِالِاسْتِغْفَارِ لَهُ حَتَّى يَمُوتَ جَمِيعُ الْخَلَائِقِ إِلَّا الثَّقَلَيْنِ الْجِنَّ وَ الْإِنْسَ",
          "وَ قَالَ إِذَا فَرَغْتَ مِنْ تَشَهُّدِكَ فَارْفَعْ يَدَيْكَ وَ قُلِ ",
          "اللَّهُمَّ اغْفِرْ لِي مَغْفِرَةً عَزْماً جَزْماً لَا تُغَادِرُ ذَنْباً وَ لَا أَرْتَكِبُ بَعْدَهَا مُحَرَّماً أَبَداً وَ عَافِنِي مُعَافَاةً لَا بَلْوَى بَعْدَهَا أَبَداً وَ اهْدِنِي هُدًى لَا أَضِلُّ بَعْدَهُ أَبَداً وَ انْفَعْنِي يَا رَبِّ بِمَا عَلَّمْتَنِي وَ اجْعَلْهُ لِي وَ لَا تَجْعَلْهُ عَلَيَّ وَ ارْزُقْنِي كَفَافاً وَ رَضِّنِي بِهِ",
          "يَا رَبَّاهْ وَ تُبْ عَلَيَّ يَا اللَّهُ يَا اللَّهُ يَا اللَّهُ يَا رَحْمَانُ يَا رَحْمَانُ يَا رَحْمَانُ يَا رَحِيمُ يَا رَحِيمُ يَا رَحِيمُ ارْحَمْنِي مِنَ النَّارِ ذَاتِ السَّعِيرِ وَ ابْسُطْ عَلَيَّ مِنْ سَعَةِ رِزْقِكَ وَ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ وَ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ وَ أَبْلِغْ مُحَمَّداً صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ عَنِّي تَحِيَّةً كَثِيرَةً وَ سَلَاماً وَ اهْدِنِي بِهُدَاكَ وَ أَغْنِنِي بِغِنَاكَ وَ اجْعَلْنِي مِنْ أَوْلِيَائِكَ الْمُخْلَصِينَ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ آمِينَ",
          "قَالَ مَنْ قَالَ هَذَا بَعْدَ كُلِّ صَلَاةٍ رَدَّ اللَّهُ عَلَيْهِ رُوحَهُ فِي قَبْرِهِ وَ كَانَ حَيّاً مَرْزُوقاً نَاعِماً مَسْرُوراً إِلَى يَوْمِ الْقِيَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from one of his companions, raising it, said, ",
            "‘The one who says after every <span class=\"iTxt\">Salāt</span> while grabbing his beard by his right hand, ‘O One<sup>azwj</sup> with the Majesty and the Benevolence! Be Merciful to me from the Fire’, three times, and his left hand is raised, and its palm is facing towards the sky. Then he should be saying, ‘Rescue me from the painful Punishment’, three times. ",
            "Then he should drop his hand from his beard, then raise his hand and make its palm to be facing towards the sky, then he should be saying, ‘O Mighty! O benevolent! O Beneficent! O Merciful’, and he should flip over his hand and makes both their palms to face towards the sky, then he should be saying, ‘Rescue me from the painful Punishment’, three times. ‘Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and the Angels, and the Spirit’, (his sins) would be Forgiven for him, and he would be Pleased from, and be linked with the Forgiveness for him until the entirety of the creatures die off, except for the two heavy ones, the Jinn and the human beings’. ",
            "And he<sup>asws</sup> said: ‘Whenever you are free from your <span class=\"iTxt\">Tashahhud</span> (bearing of the testimonies), so raise your hand and say, ",
            "‘O Allah<sup>azwj</sup>! Forgive (my sins) for me with a Determined and Decisive Forgiveness, not leaving any sin nor will I be indulging in a Prohibition after it, ever! And Grant me such well-being that I would not suffer an affliction after it, ever! And Guide me with such a Guidance that I will not go astray after it, ever! And benefit me, O Lord<sup>azwj</sup> with what You<sup>azwj</sup> Teach me and Make it to be for me, and do not Make it to be against me, and Grace me sufficiently and Make me to be pleased with it.",
            "O Lord<sup>azwj</sup>! And Turn to me (with Mercy). O Allah<sup>azwj</sup>! O Allah<sup>azwj</sup>! O Allah<sup>azwj</sup>!. O Beneficent! O Beneficent! O Beneficent! O Merciful! O Merciful! O Merciful! Have Mercy on me from the Fire with the blaze, and Extend upon me from the Expansion of Your<sup>azwj</sup> Grace, and Guide me do what I am differing in from the Truth by Your<sup>azwj</sup> Permission, and Rescue me from the Pelted Satan<sup>la</sup>, and Deliver a lot of salutations upon Muhammad<sup>saww</sup> from me, and greeting, and Guide me by Your<sup>azwj</sup> Guidance, and Enrich me with Your<sup>azwj</sup> Riches, and Make me to be from Your<sup>azwj</sup> sincere friends. And may Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>azwj</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. Ameen!’ ",
            "He<sup>asws</sup> said: ‘The one says this after every <span class=\"iTxt\">Salāt</span>, Allah<sup>azwj</sup> would Return his soul upon him in his grave, and he would be alive, Sustained, blissful, joyful up to the Day of Judgment’."
          ],
          "en.sarwar": [
            "4. It is narrated from him (narrator of the Hadith above) from certain individuals of his people from in a marfu ’ manner from the Imam (a.s.) who has said the following: “Whoever after every prayer, holds his beard in his right hand and says, ‘O the Owner of glory and magnanimity, have mercy upon me against fire,’ three times, with the left hand raised and the palms up to the sky and says, ‘Grant me safety from the painful torment,’ three times, then removes his hand from his beard and raises it with palms up to the sky and says, ‘O Majestic, O Magnanimous, O Beneficent, O Merciful,’ then changes the position of his hands and turns his palms up to the sky and says, ‘Grant me safety against painful torment,’ three times, ‘Grant al-Salat (favors) upon Muhammad and his family, the angels and the spirit,’ his sins are covered for him, is pleased with, plea for forgiveness for him is continued up to the time of his death, by all the creatures except the two heavy populations of Jinn and humankind. He after completing the testimonies of belief ( tashahhud) raising his hands says, ‘O Lord, grant me forgiveness, a decisive and ascertained forgiveness that does not leave any of sins that I have committed and that I will never commit any unlawful act thereafter. Grant me good health so that thereafter I will never face any suffering, grant me guidance so that thereafter I will never stray, benefit me O Lord by what You have instructed me with, turn it in my favor and not against me, grant me enough for sustenance and help me to remain content with it. O Lord, accept my repentance, O Allah, O Allah, O Allah, O Beneficent, O Beneficent, O Beneficent, O Merciful, O Merciful, O Merciful, grant me mercy against the roaring fire, extend for me sustenance from Your vast provisions, grant me guidance in disputed matters, in the matters of the truth by Your permission, protect me against Satan, the condemned to stoning, convey to Muhammad and the family of Muhammad (a.s.) a great deal of my greetings of peace, guide me with Your guidance, grant me wealth from Your wealth, allow me to be one of Your sincere friends and grant al-Salat (favors) upon Muhammad and his family, Amin.’ “The Imam said, ‘Whoever says this after each prayer Allah will return his spirit to him in his grave and he will be alive receiving sustenance, pampered and happy to the Day of Judgment.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/343)"
        ],
        "index": 3341,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:5",
        "text": [
          "عَنْهُ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ تَقُولُ بَعْدَ الْفَجْرِ ",
          "اللَّهُمَّ لَكَ الْحَمْدُ حَمْداً خَالِداً مَعَ خُلُودِكَ وَ لَكَ الْحَمْدُ حَمْداً لَا مُنْتَهَى لَهُ دُونَ رِضَاكَ وَ لَكَ الْحَمْدُ حَمْداً لَا أَمَدَ لَهُ دُونَ مَشِيَّتِكَ وَ لَكَ الْحَمْدُ حَمْداً لَا جَزَاءَ لِقَائِلِهِ إِلَّا رِضَاكَ اللَّهُمَّ لَكَ الْحَمْدُ وَ إِلَيْكَ الْمُشْتَكَى وَ أَنْتَ الْمُسْتَعَانُ اللَّهُمَّ لَكَ الْحَمْدُ كَمَا أَنْتَ أَهْلُهُ الْحَمْدُ لِلَّهِ بِمَحَامِدِهِ كُلِّهَا عَلَى نَعْمَائِهِ كُلِّهَا حَتَّى يَنْتَهِيَ الْحَمْدُ إِلَى حَيْثُ مَا يُحِبُّ رَبِّي وَ يَرْضَى",
          "وَ تَقُولُ بَعْدَ الْفَجْرِ قَبْلَ أَنْ تَتَكَلَّمَ ",
          "الْحَمْدُ لِلَّهِ مِلْ‏ءَ الْمِيزَانِ وَ مُنْتَهَى الرِّضَا وَ زِنَةَ الْعَرْشِ وَ سُبْحَانَ اللَّهِ مِلْ‏ءَ الْمِيزَانِ وَ مُنْتَهَى الرِّضَا وَ زِنَةَ الْعَرْشِ وَ اللَّهُ أَكْبَرُ مِلْ‏ءَ الْمِيزَانِ وَ مُنْتَهَى الرِّضَا وَ زِنَةَ الْعَرْشِ وَ لَا إِلَهَ إِلَّا اللَّهُ مِلْ‏ءَ الْمِيزَانِ وَ مُنْتَهَى الرِّضَا وَ زِنَةَ الْعَرْشِ تُعِيدُ ذَلِكَ أَرْبَعَ مَرَّاتٍ",
          "ثُمَّ تَقُولُ.",
          "اللَّهُمَّ أَسْأَلُكَ مَسْأَلَةَ الْعَبْدِ الذَّلِيلِ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَنْ تَغْفِرَ لَنَا ذُنُوبَنَا وَ تَقْضِيَ لَنَا حَوَائِجَنَا فِي الدُّنْيَا وَ الْآخِرَةِ فِي يُسْرٍ مِنْكَ وَ عَافِيَةٍ"
        ],
        "translations": {
          "en.hubeali": [
            "From him, from one of his companions, raising it, ",
            "‘He<sup>asws</sup> said: ‘You should be saying after Al-Fajr (<span class=\"iTxt\">Salāt</span>), ",
            "‘O Allah<sup>azwj</sup>! For You<sup>azwj</sup> is the Praise, an eternal Praise with Your<sup>azwj</sup> Eternality, and for You<sup>azwj</sup> is the Praise, a Praise with no end point to it. And to You<sup>azwj</sup> I complain and You<sup>azwj</sup> are the Aider. O Allah<sup>azwj</sup>! For You<sup>azwj</sup> is the Praise as You<sup>azwj</sup> are rightful of it. The Praise is for Allah<sup>azwj</sup> when one praises, every time upon his Bounties, all of them, until the Praise ends up to where what You<sup>azwj</sup> Love, my Lord<sup>azwj</sup> and are Pleased with’. ",
            "And you should be saying after Al-Fajr (<span class=\"iTxt\">Salāt</span>) before you speak, ",
            "‘The Praise is for Allah<sup>azwj</sup>, Filler of the Scale and the Limit of the Pleasure, and Adornment of the Throne. And Glory be to Allah<sup>azwj</sup> Filler of the Scale and Limit of the Pleasure, and Adornment of the Throne! And Allah<sup>azwj</sup> is the Greatest, Filler of the Scale and Limit of the Pleasure and Adornment of the Throne. And there is no God except Allah<sup>azwj</sup>, Filler of the Scale, and Limit of the Pleasure, and Adornment of the Throne’ – repeating that four times. ",
            "Then you should be saying, ",
            "‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> the asking of the humble slave, that You<sup>azwj</sup> Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and that You<sup>azwj</sup> Forgive our sins for us, and Fulfil our needs for us in the world and the Hereafter, in Ease from You<sup>azwj</sup> and good health’."
          ],
          "en.sarwar": [
            "5. It is narrated from him (narrator of the Hadith above) from certain individuals of his people from in a marfu ’ manner from the Imam (a.s.) who has said the following: “Say after the morning prayer, ‘O Lord, to You belongs all praise, the eternal praise, with Your eternity, to You belongs all praise, the praise that does end before Your consent, to You belongs all praise, the timeless praise except as Your wish, to You belongs all praise, a praise whose speaker’s reward could be no other thing but Your approval, O Lord, to You belongs all praise, to You is the complaint and You are the supporter, O Lord, to You belongs all praise, as You deserve it, all praise belongs to Allah with all of His praiseworthy attributes for all of His bounties until praising reaches such a degree that my Lord loves and is pleased with. ’ After the morning prayer and before speaking to anyone say, ‘All praise belongs to Allah, to the fill of the balance, to the limits of consent, to the weight of the Throne, may I glorfy Allah, Who is free of all defects, to the fill of the balance, to the limits of assent and the weight of the Throne,’ four times, then say, ‘O Lord, I plead before You like a lowly servant to grant al-Salat (favors) upon Muhammad and his family, forgive our sins, grant our wishes in this world and in the hereafter with ease and good health.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/346)"
        ],
        "index": 3342,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:6",
        "relations": {
          "Mentions": [
            "/books/quran:3:173",
            "/books/quran:21:87",
            "/books/quran:21:88",
            "/books/quran:3:174",
            "/books/quran:40:45"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ مُحَمَّدِ بْنِ الْفَرَجِ قَالَ كَتَبَ إِلَيَّ أَبُو جَعْفَرٍ ابْنُ الرِّضَا ( عليه السلام ) بِهَذَا الدُّعَاءِ وَ عَلَّمَنِيهِ وَ قَالَ مَنْ قَالَ فِي دُبُرِ صَلَاةِ الْفَجْرِ لَمْ يَلْتَمِسْ حَاجَةً إِلَّا تَيَسَّرَتْ لَهُ وَ كَفَاهُ اللَّهُ مَا أَهَمَّهُ ",
          "بِسْمِ اللَّهِ وَ بِاللَّهِ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ وَ أُفَوِّضُ أَمْرِي إِلَى اللَّهِ إِنَّ اللَّهَ بَصِيرٌ بِالْعِبَادِ",
          "فَوَقَاهُ اللَّهُ سَيِّئَاتِ مَا مَكَرُوا لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ فَاسْتَجَبْنَا لَهُ وَ نَجَّيْنَاهُ مِنَ الْغَمِّ وَ كَذَلِكَ نُنْجِي الْمُؤْمِنِينَ حَسْبُنَا اللَّهُ وَ نِعْمَ الْوَكِيلُ فَانْقَلَبُوا بِنِعْمَةٍ مِنَ اللَّهِ وَ فَضْلٍ لَمْ يَمْسَسْهُمْ سُوءٌ ",
          "مَا شَاءَ اللَّهُ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ مَا شَاءَ اللَّهُ لَا مَا شَاءَ النَّاسُ مَا شَاءَ اللَّهُ وَ إِنْ كَرِهَ النَّاسُ حَسْبِيَ الرَّبُّ مِنَ الْمَرْبُوبِينَ حَسْبِيَ الْخَالِقُ مِنَ الْمَخْلُوقِينَ حَسْبِيَ الرَّازِقُ مِنَ الْمَرْزُوقِينَ حَسْبِيَ الَّذِي لَمْ يَزَلْ حَسْبِي مُنْذُ قَطُّ حَسْبِيَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَ هُوَ رَبُّ الْعَرْشِ الْعَظِيمِ ",
          "وَ قَالَ إِذَا انْصَرَفْتَ مِنْ صَلَاةٍ مَكْتُوبَةٍ فَقُلْ ",
          "رَضِيتُ بِاللَّهِ رَبّاً وَ بِمُحَمَّدٍ نَبِيّاً وَ بِالْإِسْلَامِ دِيناً وَ بِالْقُرْآنِ كِتَاباً وَ بِفُلَانٍ وَ فُلَانٍ أَئِمَّةً اللَّهُمَّ وَلِيُّكَ فُلَانٌ فَاحْفَظْهُ مِنْ بَيْنِ يَدَيْهِ وَ مِنْ خَلْفِهِ وَ عَنْ يَمِينِهِ وَ عَنْ شِمَالِهِ وَ مِنْ فَوْقِهِ وَ مِنْ تَحْتِهِ وَ امْدُدْ لَهُ فِي عُمُرِهِ وَ اجْعَلْهُ الْقَائِمَ بِأَمْرِكَ وَ الْمُنْتَصِرَ لِدِينِكَ",
          "وَ أَرِهِ مَا يُحِبُّ وَ مَا تَقَرُّ بِهِ عَيْنُهُ فِي نَفْسِهِ وَ ذُرِّيَّتِهِ وَ فِي أَهْلِهِ وَ مَالِهِ وَ فِي شِيعَتِهِ وَ فِي عَدُوِّهِ وَ أَرِهِمْ مِنْهُ مَا يَحْذَرُونَ وَ أَرِهِ فِيهِمْ مَا يُحِبُّ وَ تَقِرُّ بِهِ عَيْنُهُ وَ اشْفِ صُدُورَنَا وَ صُدُورَ قَوْمٍ مُؤْمِنِينَ",
          "قَالَ وَ كَانَ النَّبِيُّ ( صلى الله عليه وآله ) يَقُولُ إِذَا فَرَغَ مِنْ صَلَاتِهِ اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَ مَا أَخَّرْتُ وَ مَا أَسْرَرْتُ وَ مَا أَعْلَنْتُ وَ إِسْرَافِي عَلَى نَفْسِي وَ مَا أَنْتَ أَعْلَمُ بِهِ مِنِّي اللَّهُمَّ أَنْتَ الْمُقَدِّمُ وَ أَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ بِعِلْمِكَ الْغَيْبَ وَ بِقُدْرَتِكَ عَلَى الْخَلْقِ أَجْمَعِينَ مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي فَأَحْيِنِي وَ تَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي",
          "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي السِّرِّ وَ الْعَلَانِيَةِ وَ كَلِمَةَ الْحَقِّ فِي الْغَضَبِ وَ الرِّضَا وَ الْقَصْدَ فِي الْفَقْرِ وَ الْغِنَى وَ أَسْأَلُكَ نَعِيماً لَا يَنْفَدُ وَ قُرَّةَ عَيْنٍ لَا يَنْقَطِعُ وَ أَسْأَلُكَ الرِّضَا بِالْقَضَاءِ وَ بَرَكَةَ الْمَوْتِ بَعْدَ الْعَيْشِ وَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ وَ لَذَّةَ الْمَنْظَرِ إِلَى وَجْهِكَ وَ شَوْقاً إِلَى رُؤْيَتِكَ وَ لِقَائِكَ مِنْ غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَ لَا فِتْنَةٍ مَضَلَّةٍ ",
          "اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ وَ اجْعَلْنَا هُدَاةً مَهْدِيِّينَ اللَّهُمَّ اهْدِنَا فِيمَنْ هَدَيْتَ اللَّهُمَّ إِنِّي أَسْأَلُكَ عَزِيمَةَ الرَّشَادِ وَ الثَّبَاتَ فِي الْأَمْرِ وَ الرُّشْدِ وَ أَسْأَلُكَ شُكْرَ نِعْمَتِكَ وَ حُسْنَ عَافِيَتِكَ وَ أَدَاءَ حَقِّكَ وَ أَسْأَلُكَ يَا رَبِّ قَلْباً سَلِيماً وَ لِسَاناً صَادِقاً وَ أَسْتَغْفِرُكَ لِمَا تَعْلَمُ وَ أَسْأَلُكَ خَيْرَ مَا تَعْلَمُ وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ فَإِنَّكَ تَعْلَمُ وَ لَا نَعْلَمُ وَ أَنْتَ عَلَّامُ الْغُيُوبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from sahl Bin Ziyad, from one of our companions, from Muhammad Bin Al Faraj who said, ",
            "‘Abu Ja’far Ibn Al-Reza<sup>asws</sup> wrote to me with this supplication, and taught it and said: ‘The one who says this at the end of Al-Fajr <span class=\"iTxt\">Salāt</span>, would not seek a need except it would be Eased for him, and Allah<sup>azwj</sup> would Suffice him for what worries him – ",
            "‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>, and <span class=\"iTxt\">Salawāt</span> be upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, and I delegate my matters to Allah<sup>azwj</sup>, that Allah<sup>azwj</sup> is All-seeing with his servants. ",
            "<a href=\"/#/books/quran:40#h45\">[40:45]</a> So Allah Saved him from the evil of what they planned <a href=\"/#/books/quran:21#h87\">[21:87]</a> There is no god but You, Glory be to You; surely I am from the unjust ones <a href=\"/#/books/quran:21#h88\">[21:88]</a> So We Answered him and Delivered him from the grief and thus do We Deliver the Believers <a href=\"/#/books/quran:3#h173\">[3:173]</a> Allah is Sufficient for us and most excellent is the Protector <a href=\"/#/books/quran:3#h174\">[3:174]</a> So they returned with Favour from Allah and (His) Grace, no evil touched them ",
            "Whatever Allah<sup>azwj</sup> so Desires. There is neither Might nor Strength except with Allah<sup>azwj</sup>, the Exalted, the Magnificent, not what the people desire. Whatever Allah<sup>azwj</sup> so Desires and even if the people dislike it. Sufficient for me is the Lord<sup>azwj</sup> from the lords. Sufficient for me is the Creator from the created beings. Sufficient for me is the Sustainer from the sustained beings. Sufficient for me is the One Who will not cease to be. Sufficient for me since ever. Sufficient for me is Allah<sup>azwj</sup>, Who, there is no god except Allah<sup>azwj</sup>. He<sup>azwj</sup> is upon Whom I rely, and He<sup>azwj</sup> is the Lord<sup>azwj</sup> of the Magnificent Throne’. ",
            "And he<sup>asws</sup> said: ‘When you finish from the Prescribed <span class=\"iTxt\">Salāt</span>, so say, ",
            "‘I am pleased with Allah<sup>azwj</sup> as Lord<sup>azwj</sup>, and with Muhammad<sup>saww</sup> as Prophet<sup>saww</sup>, and with Al-Islam as Religion, and with Al-Quran as a Book, and with so and so, and so and so as Imams<sup>asws</sup>. O Allah<sup>azwj</sup>! So and so is a Guardian<sup>asws</sup> of Yours<sup>azwj</sup>, therefore Protect him from in front of him<sup>asws</sup>, and from behind him<sup>asws</sup>, and from his<sup>asws</sup> right, and from his<sup>asws</sup> left, and from above him<sup>asws</sup>, and from beneath him<sup>asws</sup>, and Extend for him<sup>asws</sup> in his<sup>asws</sup> life-span, and Make him<sup>asws</sup> as the Rising One<sup>asws</sup> with Your<sup>azwj</sup> Command, and the helper for Your<sup>azwj</sup> Religion.",
            "And Show him what he<sup>asws</sup> loves and what his<sup>asws</sup> eyes would be delighted with, in himself<sup>asws</sup>, and his<sup>asws</sup> offspring, and in his<sup>asws</sup> family, and his<sup>asws</sup> wealth, and in his<sup>asws</sup> Shias, and in his<sup>asws</sup> enemies, and Show them from him<sup>asws</sup> what they are bewaring, and Show him<sup>asws</sup> in them what he<sup>asws</sup> loves, and what his<sup>asws</sup> eyes would be delighted with, and Heal our chests and the chests of the group of <span class=\"iTxt\">Momin</span>een’. ",
            "He<sup>asws</sup> said: ‘And the Prophet<sup>saww</sup> was saying whenever he<sup>saww</sup> was free from his<sup>saww</sup> <span class=\"iTxt\">Salāt</span>: ‘O Allah<sup>azwj</sup>! Forgive for me<sup>saww</sup> the sins (of my<sup>saww</sup> Shias), whatever has preceded, and whatever is delayed, and whatever was in secret, and whatever was in public, and whatever was extravagance upon myself<sup>saww</sup> and what You<sup>azwj</sup> are more Knowing with than I<sup>saww</sup> am. O Allah<sup>azwj</sup>! You<sup>azwj</sup> are the Preceding One<sup>azwj</sup> and I<sup>saww</sup> are the following one. There is no god except for You<sup>azwj</sup>. You<sup>azwj</sup>, with Your<sup>azwj</sup> Knowledge of the unseen and by Your<sup>azwj</sup> Power upon Your<sup>azwj</sup> creatures in their entirety Know the life which is better for me<sup>saww</sup>, therefore Cause me<sup>saww</sup> to live and Cause me<sup>saww</sup> to die when You<sup>azwj</sup> Know of a (manner of) dying which is better for me<sup>saww</sup>.",
            "O Allah<sup>azwj</sup>! I<sup>saww</sup> ask You<sup>azwj</sup> for being fearful of You<sup>azwj</sup> during the privacy and publicly, and of (speaking the) word of truth during the anger, and the pleasure, and the moderation during the poverty and the riches. And I<sup>saww</sup> ask You<sup>azwj</sup> of bliss which does not run out, and a delight of the eyes which does not get cut-off. And I<sup>saww</sup> ask You<sup>azwj</sup> of the pleasure with the Ordainment and Blessings of the death after the life, and the coolness of the life after the death, and the pleasure of the looking at Your<sup>azwj</sup> Face, and desire to see You<sup>azwj</sup> and meet You<sup>azwj</sup>, from without being harmed by a harm nor a misleading strife.",
            "O Allah<sup style=\"font-weight: normal\">azwj</sup>! Adorn us with the adornment of the <span class=\"iTxt\">Eman</span>, and Make us to be calm Guided ones. O Allah<sup style=\"font-weight: normal\">azwj</sup>! Guide us to be among the ones You<sup style=\"font-weight: normal\">azwj</sup> Guided. O Allah<sup style=\"font-weight: normal\">azwj</sup>! I<sup style=\"font-weight: normal\">saww</sup> ask You<sup style=\"font-weight: normal\">azwj</sup> of the Determination of righteous reasoning, and the steadfastedness in the matters and the reasoning. And I<sup style=\"font-weight: normal\">saww</sup> ask You<sup style=\"font-weight: normal\">azwj</sup> for thanking for Your<sup style=\"font-weight: normal\">azwj</sup> Bounties, and goodness of Your<sup style=\"font-weight: normal\">azwj</sup> health, and paying Your<sup style=\"font-weight: normal\">azwj</sup> right. And I<sup style=\"font-weight: normal\">saww</sup> ask You<sup style=\"font-weight: normal\">azwj</sup>, O Lord<sup style=\"font-weight: normal\">azwj</sup>, for the sound heart, and a truthful tongue, and seeking Forgiveness to what You<sup style=\"font-weight: normal\">azwj</sup> Know of. And I<sup style=\"font-weight: normal\">saww</sup> ask You<sup style=\"font-weight: normal\">azwj</sup> of the best of what You<sup style=\"font-weight: normal\">azwj</sup> Know of and I<sup style=\"font-weight: normal\">saww</sup> seek Refuge with You<sup style=\"font-weight: normal\">azwj</sup> from the evil of what You<sup style=\"font-weight: normal\">azwj</sup> Know, for You<sup style=\"font-weight: normal\">azwj</sup> Know what we do not know, and You<sup style=\"font-weight: normal\">azwj</sup> are the Knower of the unseen’’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from certain individuals of his people from Muhammad ibn al-Faraj who has said the following: “Once abu Ja’far ibn al-Rida (a.s.) wrote to me and instructed me with this supplication saying, ‘Whoever recites it after the morning prayer, his wish will come true with ease and Allah will suffice him: “(I begin) in the name of Allah and with Allah. O Lord, grant al-Salat (favors) upon Muhammad and his family. I plead before Allah to keep my affairs in trust with Him, Allah knows well (His) servants. ‘Allah protected him (the believer among the people of Pharoah) against the evil of what they had planned against him. . . .’(40:44,45) ‘No one deserves to be worshipped except You, You are free of all defects. I have been unjust to myself.’ <a href=\"/#/books/quran:21#h87\">[21:87]</a> ‘We answered his prayer and saved him from sorrow and thus. We save the believing people. ’<a href=\"/#/books/quran:21#h88\">[21:88]</a> ‘. . . Allah is sufficient for us and He is the best representative.’ <a href=\"/#/books/quran:3#h173\">[3:173]</a> ‘They returned with the bounties of Allah and additional favors without being touched by evil. . . .’ <a href=\"/#/books/quran:3#h174\">[3:174]</a>, it is as Allah wills, there are no means and no power without Allah, the Most High, the Most Great. “It is as Allah wills, not as people will. It is as Allah wills even though people may dislike it. Sufficient for me is the Lord instead of those cherished, sufficient for me is the Creator instead of the creatures, sufficient for me is the provider of sustenance instead of the recipients of sustenance, the One Who has always been sufficient for me from the time I existed, sufficient for me is Allah besides Whom no one deserves to be worshipped, before Him I place my trust and He is the Lord of the great Throne.’ “The Imam said, ‘When you complete an obligatory prayer say, ‘I have accepted the fact that Allah is my Lord, Muhammad is the Holy Prophet, Islam is the religion, the Holy Quran is the Book and so and so . . . (mention your ‘ A’immah ) are my ‘A’immah. O Lord, protect Your friend, (whom You have granted Divine Authority) so and so . . . (mention the twelfth Imam) from all directions, front, back, right, left, above and below, grant him a long life and make him the one who will rise with Divine Authority to support Your religion, show him what he loves and is the delight to his eyes, in his own person, his descendents, his family, belongings, his followers and his enemies. Show them (his enemies) what frightens them and show him in them what he loves and be the delight to his eyes, grant the cure for our suffering chests (hearts) and the chests of the believing people.’ “The Imam said, ‘The Holy Prophet after completing a prayer would say, “O Lord, forgive me for what I have done and what I will do, what I have hidden, and what I have done in public and forgive my excesses against my own self and that about which You know better than I do. O Lord You are the One Who can move things forward or backwards with Your knowledge of the unseen and through Your power over all creatures. I pray to grant me life as long as it is in my best interest and cause me to die when it is in my best intrest. I plead before You to grant me a sense of concern about You in private and in public, to say the words of the truth in anger or happiness and to economize in poverty and in wealth. I plead before You for bounties that will not vanish and such delight of the eyes that will not discontinue. I plead before You to make me be happy with (Your) determination, with the blessing of death after life, the comfort of life after death, the pleasure of the look at Your face (things that lead to You), the excitement of seeing You, meeting You without being harmed or suffer harmfulness or the misfortune of straying. O Lord, beautify us with the beauty of belief and help us to be guided guides. O Lord, grant us guidance in the matters of those whom You have guided. O Lord, I plead before You for determination in understanding, steadfastness in the affairs, and good understanding. I plead before You for the opportunity to thank You for Your bounties, Your granting good health and yielding to Your right. I plead before You O Lord, to grant me a peaceful heart, and a truthful tongue. I beg You for forgiveness for that which You know. I seek protection with You against the evil of that which You know; You know and we do not know. You have the knowledge of the unseen.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/367)"
        ],
        "index": 3343,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ جَاءَ جَبْرَئِيلُ ( عليه السلام ) إِلَى يُوسُفَ وَ هُوَ فِي السِّجْنِ فَقَالَ لَهُ يَا يُوسُفُ قُلْ فِي دُبُرِ كُلِّ صَلَاةٍ.",
          "اللَّهُمَّ اجْعَلْ لِي فَرَجاً وَ مَخْرَجاً وَ ارْزُقْنِي مِنْ حَيْثُ أَحْتَسِبُ وَ مِنْ حَيْثُ لَا أَحْتَسِبُ"
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Sayf Bin Ameyra who said, ",
            "‘I heard Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> saying: ‘Jibraeel<sup style=\"font-weight: normal\">as</sup> came over to Yusuf<sup style=\"font-weight: normal\">as</sup> while he<sup style=\"font-weight: normal\">as</sup> was in the prison, and he<sup style=\"font-weight: normal\">as</sup> said to him<sup style=\"font-weight: normal\">as</sup>: ‘O Yusuf<sup style=\"font-weight: normal\">as</sup>! Say at the end of every <span class=\"iTxt\">Salāt</span>: ",
            "‘O Allah<sup style=\"font-weight: normal\">azwj</sup>! Make a relief for me<sup style=\"font-weight: normal\">as</sup> and an exit, and Grace me<sup style=\"font-weight: normal\">as</sup> from where I<sup style=\"font-weight: normal\">as</sup> do expect and from where I<sup style=\"font-weight: normal\">as</sup> do not expect (it to be from)’’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthman from Sayf ibn ‘Amirah who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Jibril (Gabriel) came to Joseph in prison and said to him, “Joseph, after every prayer say, ‘O Lord, grant me relief, a way out (of difficulties), and sustenance from the sources I expect and from those I do not expect.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/367)"
        ],
        "index": 3344,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:8",
        "relations": {
          "Mentions": [
            "/books/quran:114:1",
            "/books/quran:2:255",
            "/books/quran:113:1",
            "/books/quran:113:2"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عَبْدِ الْعَزِيزِ عَنْ بَكْرِ بْنِ مُحَمَّدٍ عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ قَالَ هَذِهِ الْكَلِمَاتِ عِنْدَ كُلِّ صَلَاةٍ مَكْتُوبَةٍ حُفِظَ فِي نَفْسِهِ وَ دَارِهِ وَ مَالِهِ وَ وُلْدِهِ أُجِيرُ نَفْسِي وَ مَالِي وَ وُلْدِي وَ أَهْلِي وَ دَارِي ",
          "وَ كُلَّ مَا هُوَ مِنِّي بِاللَّهِ الْوَاحِدِ الْأَحَدِ الصَّمَدِ الَّذِي لَمْ يَلِدْ وَ لَمْ يُولَدْ وَ لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ وَ أُجِيرُ نَفْسِي وَ مَالِي وَ وُلْدِي وَ كُلَّ مَا هُوَ مِنِّي بِرَبِّ الْفَلَقِ مِنْ شَرِّ مَا خَلَقَ إِلَى آخِرِهَا وَ بِرَبِّ النَّاسِ إِلَى آخِرِهَا وَ آيَةِ الْكُرْسِيِّ إِلَى آخِرِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Abdul Aziz, from Bakr Bin Muhammad, from the one who reported it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who says these words during every Prescribed <span class=\"iTxt\">Salāt</span>, there would be Protection regarding himself, and his house, and his wealth, and his children, and the wife and all what he owns:",
            "‘I seek Refuge for myself, and my children, and my wealth, and my children, and my family, and my house, and everything what is from me, with Allah<sup>azwj</sup>, the One, the First, the Last, who neither begets nor is begotten, and there does not happen to be anyone as a match for Him<sup>azwj</sup>. And I seek Refuge for myself, and my wealth, and my children, and everything what is from me, with <span class=\"ibTxt\"><a href=\"/#/books/quran:113#h1\">[113:1]</a> the Lord of Al-Falaq, <a href=\"/#/books/quran:113#h2\">[113:2]</a> From the evil of what He has Created</span> – up to its end, and with <span class=\"ibTxt\"><a href=\"/#/books/quran:114#h1\">[114:1]</a> Say: I seek refuge in the Lord of the people</span> – up to its end, and Ayat Al Kursy <a href=\"/#/books/quran:2#h255\">[2:255]</a> – up to its end’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn ‘Abd al-‘Aziz from Bakr ibn Muhammad from those whom he has mentioned (in his book) from abu ‘Abd Allah (a.s.) who has said the following: “Whoever says these words with every obligatory prayer will receive protection for his own soul, his home, his belongings and children: ‘I seek refuge for myself, belongings, children, family, home and everything of me with Allah, the One and only Self- sufficient Who has not given birth to anyone nor is born from anyone and there is no one like Him. ‘I seek refuge [for myself, belongings, children and all that is of me] with the Lord of the opening dawn from the evil of that which He has created, . . .’ recite to the end of Chapter 113 of the Holy Quran, Chapter 114, and verse 255 of Chapter 2.’” "
          ]
        }
      },
      {
        "index": 3345,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ مَنْ قَالَ فِي دُبُرِ الْفَرِيضَةِ يَا مَنْ يَفْعَلُ مَا يَشَاءُ وَ لَا يَفْعَلُ مَا يَشَاءُ أَحَدٌ غَيْرُهُ ثَلَاثاً ثُمَّ سَأَلَ أُعْطِيَ مَا سَأَلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar who said, ",
            "‘The one who says at the end of the Obligatory (<span class=\"iTxt\">Salāt</span>), ‘O One<sup>azwj</sup> Who Does whatever He<sup>azwj</sup> so Desires to and does not do what anyone else desires’, three times, then asks, would be Given what he asks for’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu’awiyah ibn ‘ Ammar who has said the following: “Whoever, after every obligatory prayer says: ‘O the One who does as He wills and does not do as others will,’ three times, and pleads (before Allah) for his wishes they will be granted.’” "
          ]
        }
      },
      {
        "index": 3346,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:10",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا صَلَّيْتَ الْمَغْرِبَ فَأَمِرَّ يَدَكَ عَلَى جَبْهَتِكَ وَ قُلْ.",
          "بِسْمِ اللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَالِمِ الْغَيْبِ وَ الشَّهَادَةِ الرَّحْمَنِ الرَّحِيمِ اللَّهُمَّ أَذْهِبْ عَنِّي الْهَمَّ وَ الْغَمَّ وَ الْحَزَنَ ثَلَاثَ مَرَّاتٍ"
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Sa’dan, from Saeed Bin Yasaar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Whenever you prays Al-Maghrib <span class=\"iTxt\">Salāt</span>, so pass your hand upon your face and say, ",
            "‘In the Name of Allah<sup>azwj</sup> Who, there is no god except Him, the Knower of the unseen and the seen, the Beneficent, the Merciful. O Allah<sup>azwj</sup>! Remove from me, the worries, and the gloom, and the grief’, <span style=\"text-decoration: underline\">three times’</span>."
          ],
          "en.sarwar": [
            "10. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Su’Dan from Sa’Id ibn Yasar who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘When you complete your Maghrib (sunset) prayer wipe your hand over your forehead and say, “(I begin) with the name of Allah, besides whom no one deserves to be worshipped. Who knows the unseen and seen, the Beneficent, the Merciful. O Lord, remove from me the sorrow, anxiety, and sadness,’ three times.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول ويمكن أن يعد حسنا   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/378)"
        ],
        "index": 3347,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدٍ الْجُعْفِيِّ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كُنْتُ كَثِيراً مَا أَشْتَكِي عَيْنِي فَشَكَوْتُ ذَلِكَ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ أَ لَا أُعَلِّمُكَ دُعَاءً لِدُنْيَاكَ وَ آخِرَتِكَ وَ بَلَاغاً لِوَجَعِ عَيْنَيْكَ قُلْتُ بَلَى ",
          "قَالَ تَقُولُ فِي دُبُرِ الْفَجْرِ وَ دُبُرِ الْمَغْرِبِ ",
          "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِحَقِّ مُحَمَّدٍ وَ آلِ مُحَمَّدٍ عَلَيْكَ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ اجْعَلِ النُّورَ فِي بَصَرِي وَ الْبَصِيرَةَ فِي دِينِي وَ الْيَقِينَ فِي قَلْبِي وَ الْإِخْلَاصَ فِي عَمَلِي وَ السَّلَامَةَ فِي نَفْسِي وَ السَّعَةَ فِي رِزْقِي وَ الشُّكْرَ لَكَ أَبَداً مَا أَبْقَيْتَنِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Al Ju’fy, from his father, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘I used to have a lot of complaints of my eyes, so I complained of that to Abu Abdullah<sup>asws</sup>. So he<sup>asws</sup> said, ‘Shall I<sup>asws</sup> teach you a supplication for your world and your Hereafter, and would be a cure for the pain of your eyes?’ I said, ‘Yes’. ",
            "He<sup>asws</sup> said: ‘You should be saying at the end of Al Fajr (<span class=\"iTxt\">Salāt</span>) and the end of Al Maghrib (<span class=\"iTxt\">Salāt</span>), ",
            "‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> with the right of Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> upon You<sup>azwj</sup>, Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and Make light to be in my vision and the insight to be in my Religion, and the conviction to be in my heart, and the sincerity to be in my deeds, and the safety to be in my self, and the expansion to be in my sustenance, and the gratefulness is to You<sup>azwj</sup>, forever, whatever my remaining (life is)’’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Muhammad al-Ju’Fi from his father who has said the following: “I often complained about my eyes and once I mentioned it to abu ‘Abd Allah (a.s.) and he said, ‘Should I teach you a supplication that will be for the good of your worldly life and hereafter and a cure for your eye?’ I said, ‘Yes, please do so.’ The Imam said after Maghrib (sunset) prayer say, ‘O Lord, I plead before You through the rights of Muhammad and the family of Muhammad (a.s.) with You to give light to my eyes, understanding in my religion, certainty in my heart, sincerity in my deeds, safety to my soul, increase in my sustenance and gratefulness to You as long as You will keep me (living).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول ويمكن أن يعد حسن ا  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/380)"
        ],
        "index": 3348,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:52:12",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ قَالَ حَدَّثَنِي أَبُو جَعْفَرٍ الشَّامِيُّ قَالَ حَدَّثَنِي رَجُلٌ بِالشَّامِ يُقَالُ لَهُ هِلْقَامُ بْنُ أَبِي هِلْقَامٍ قَالَ أَتَيْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ عَلِّمْنِي دُعَاءً جَامِعاً لِلدُّنْيَا وَ الْآخِرَةِ وَ أَوْجِزْ فَقَالَ قُلْ فِي دُبُرِ الْفَجْرِ إِلَى أَنْ تَطْلُعَ الشَّمْسُ ",
          "سُبْحَانَ اللَّهِ الْعَظِيمِ وَ بِحَمْدِهِ أَسْتَغْفِرُ اللَّهَ وَ أَسْأَلُهُ مِنْ فَضْلِهِ",
          "قَالَ هِلْقَامُ لَقَدْ كُنْتُ مِنْ أَسْوَإِ أَهْلِ بَيْتِي حَالًا فَمَا عَلِمْتُ حَتَّى أَتَانِي مِيرَاثٌ مِنْ قِبَلِ رَجُلٍ مَا ظَنَنْتُ أَنَّ بَيْنِي وَ بَيْنَهُ قَرَابَةً وَ إِنِّي الْيَوْمَ لَمِنْ أَيْسَرِ أَهْلِ بَيْتِي وَ مَا ذَلِكَ إِلَّا بِمَا عَلَّمَنِي مَوْلَايَ الْعَبْدُ الصَّالِحُ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr who said, ‘Abu Ja’far Al Shamy narrated to me saying, ‘A man called Hilqam Bin Abu Hilqam narrated to me at Syria saying, ",
            "‘I went over to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), and I said to him<sup>asws</sup>, ‘Teach me a comprehensive supplication for the world and the Hereafter, and be brief’. So he<sup>asws</sup> said: ‘Say at the end of Al-Fajr (<span class=\"iTxt\">Salāt</span>) up to the emergence of the sun, ",
            "‘Glorious is Allah<sup>azwj</sup> the Magnificent, and by His<sup>azwj</sup> Praise I seek Forgiveness of Allah<sup>azwj</sup>, and I ask Him<sup>azwj</sup> from His<sup>azwj</sup> Grace’’. ",
            "Hilqam (the narrator) said, ‘I had been in an evil state from my family members, until (one day) there came to me, an inheritance from a man who I did not think there was any relationship between me and him, and today I am from the most affluential people of my family, and that was not except due to what was taught to me by my Master<sup style=\"font-weight: normal\">asws</sup>, Al-Abd Al-Salih<sup style=\"font-weight: normal\">asws</sup> (7<sup style=\"font-weight: normal\">th</sup> Imam<sup style=\"font-weight: normal\">asws</sup>)’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from his father from m Mahziyar who has that narrated to h Imams abu la’ far al-Shami saying that narrated to him a man in al- Sham (Damascus) called Hilqamu ibn abu Hilqamu who said the following: “Once I went in the presence of abu Ibrahim, recipient of divine supreme covenant. I said, ‘May Allah keep my soul in service for your cause, instruct me with a supplication of universal form for this world and hereafter but very short one.’ The Imam said, ‘After the morning-prayer until sunrise say, “Glory belongs to Allah, the Great and I praise Him. I plead before Allah for forgiveness and I beg of His generosity. ’ “Hilqamu has said, ‘I (financially) was the worst off person in my family. I received an inheritance from a man whom I did not think was related to me and I had no knowledge, but today I am the most comfortable person among my people and this is only because of what my master, the virtuous servant (of Allah) instructed me with.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:2:52",
  "kind": "verse_list"
}