{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:2:2", "titles": {"ar": "كِتَابُ الدُّعَاءِ", "en": "THE BOOK OF SUPPLICATION"}}, {"indexed_titles": {"en": "Chapter 56"}, "path": "/books/al-kafi:2:2:56", "titles": {"ar": "بَابُ الدُّعَاءِ لِلْعِلَلِ وَ الْأَمْرَاضِ", "en": "Chapter 56 – The supplication for the illnesses and diseases"}}], "index": 453, "local_index": 56, "part_type": "Chapter", "path": "/books/al-kafi:2:2:56", "titles": {"ar": "بَابُ الدُّعَاءِ لِلْعِلَلِ وَ الْأَمْرَاضِ", "en": "Chapter 56 – The supplication for the illnesses and diseases"}, "verse_count": 19, "verse_start_index": 3388, "verses": [{"index": 3389, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ وَ ابْنِ فَضَّالٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ يَقُولُ عِنْدَ الْعِلَّةِ.\nاللَّهُمَّ إِنَّكَ عَيَّرْتَ أَقْوَاماً فَقُلْتَ قُلِ ادْعُوا الَّذِينَ زَعَمْتُمْ مِنْ دُونِهِ فَلا يَمْلِكُونَ كَشْفَ الضُّرِّ عَنْكُمْ وَ لا تَحْوِيلًا فَيَا مَنْ لَا يَمْلِكُ كَشْفَ ضُرِّي وَ لَا تَحْوِيلَهُ عَنِّي أَحَدٌ غَيْرُهُ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ اكْشِفْ ضُرِّي وَ حَوِّلْهُ إِلَى مَنْ يَدْعُو مَعَكَ إِلَهاً آخَرَ لَا إِلَهَ غَيْرُكَ", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Adul Rahman Bin Abu Najran and Ibn Fazzal, from one of our companions, \n(It has been narrated) from Abu Abduallah<sup>asws</sup>, ‘He<sup>asws</sup> used to say during an illness:\n‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> have criticised certain nations saying: so You<sup>azwj</sup> Said <span class=\"ibTxt\">[17:56] Say: Call on those whom you assume (to be gods) besides Him, so they shall not control the removal of distress from you nor change it</span>. So, O the One besides Whom one can control the Removal of my distress nor change it, apart from Him<sup>azwj</sup>! Send <span class=\"iTxt\">Salaw</span>ā<span class=\"iTxt\">t</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> and Remove my distress and Change it to the ones who are calling to a god along with You<sup>azwj</sup>. There is no god other than You<sup>azwj</sup>’."}]}, {"index": 3390, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:2", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ الْمُهْتَدِي عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ دَاوُدَ بْنِ زُرْبِيٍّ قَالَ مَرِضْتُ بِالْمَدِينَةِ مَرَضاً شَدِيداً فَبَلَغَ ذَلِكَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَكَتَبَ إِلَيَّ قَدْ بَلَغَنِي عِلَّتُكَ فَاشْتَرِ صَاعاً مِنْ بُرٍّ ثُمَّ اسْتَلْقِ عَلَى قَفَاكَ وَ انْثُرْهُ عَلَى صَدْرِكَ كَيْفَمَا انْتَثَرَ وَ قُلِ \nاللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الَّذِي إِذَا سَأَلَكَ بِهِ الْمُضْطَرُّ كَشَفْتَ مَا بِهِ مِنْ ضُرٍّ وَ مَكَّنْتَ لَهُ فِي الْأَرْضِ وَ جَعَلْتَهُ خَلِيفَتَكَ عَلَى خَلْقِكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَنْ تُعَافِيَنِي مِنْ عِلَّتِي\nثُمَّ اسْتَوِ جَالِساً وَ اجْمَعِ الْبُرَّ مِنْ حَوْلِكَ وَ قُلْ مِثْلَ ذَلِكَ وَ اقْسِمْهُ مُدّاً مُدّاً لِكُلِّ مِسْكِينٍ وَ قُلْ مِثْلَ ذَلِكَ \nقَالَ دَاوُدُ فَفَعَلْتُ ذَلِكَ فَكَأَنَّمَا نُشِطْتُ مِنْ عِقَالٍ وَ قَدْ فَعَلَهُ غَيْرُ وَاحِدٍ فَانْتَفَعَ بِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Abdul Aziz Bin Al Muhtady, from Yunus Bin Abdul Rahman, from Dawood Bin Zurby who said, \n‘I fell sick at Al-Madina with an intense illness. So (the news of) that reached Abu Abdullah<sup>azwj</sup>. So he<sup>asws</sup> wrote to me: ‘It has reached me<sup>asws</sup> (news of) your illness. So buy a <span class=\"iTxt\">Sa’a</span> (about 3kg.) of wheat, then lie down upon your back and scatter (the wheat) upon your chest, as it is done and say, \n‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Name Which, when You<sup>azwj</sup> are asked with by a desperate one, it would Remove whatever he is with, from the harm, and (matters) are enabled for him in the earth, and You<sup>azwj</sup> would Make him to Your<sup>azwj</sup> Caliph upon Your<sup>azwj</sup> creatures, that You<sup>azwj</sup> (please) Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and that You<sup>azwj</sup> (please) Grant me good health during my illness’. \nThen sit up straight, and gather the wheat from around you, and say similar to that, and distribute it, one <span class=\"iTxt\">Mudd</span> (750 gms.), one <span class=\"iTxt\">Mudd</span> to each poor one and say similar to that’. \nDawood (the narrator) said, ‘So I did that, and it was as if I was activated from inactivity, and someone else (also) had done it, and he benefited by it’."}]}, {"index": 3391, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ نُعَيْمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اشْتَكَى بَعْضُ وُلْدِهِ فَقَالَ يَا بُنَيَّ قُلِ.\nاللَّهُمَّ اشْفِنِي بِشِفَائِكَ وَ دَاوِنِي بِدَوَائِكَ وَ عَافِنِي مِنْ بَلَائِكَ فَإِنِّي عَبْدُكَ وَ ابْنُ عَبْدِكَ", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Husayn Bin Nuaym, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘One of his<sup>asws</sup> sons complained to him<sup>asws</sup>, so he<sup>asws</sup> said: ‘O my<sup>asws</sup> son! Say, \n‘O Allah<sup>azwj</sup>! Heal me with Your<sup>azwj</sup> Healing, and Cure me with Your<sup>azwj</sup> Cure, and Grant me good health from Your<sup>azwj</sup> affliction, for I am Your<sup>azwj</sup> servant and son of Your<sup>azwj</sup> servant’’."}]}, {"index": 3392, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ يُونُسَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ هَذَا الَّذِي قَدْ ظَهَرَ بِوَجْهِي يَزْعُمُ النَّاسُ أَنَّ اللَّهَ عَزَّ وَ جَلَّ لَمْ يَبْتَلِ بِهِ عَبْداً لَهُ فِيهِ حَاجَةٌ فَقَالَ لِي لَا لَقَدْ كَانَ مُؤْمِنُ آلِ فِرْعَوْنَ مُكَنَّعَ الْأَصَابِعِ فَكَانَ يَقُولُ هَكَذَا وَ يَمُدُّ يَدَهُ وَ يَقُولُ يا قَوْمِ اتَّبِعُوا الْمُرْسَلِينَ \nقَالَ ثُمَّ قَالَ إِذَا كَانَ الثُّلُثُ الْأَخِيرُ مِنَ اللَّيْلِ فِي أَوَّلِهِ فَتَوَضَّأْ وَ قُمْ إِلَى صَلَاتِكَ الَّتِي تُصَلِّيهَا فَإِذَا كُنْتَ فِي السَّجْدَةِ الْأَخِيرَةِ مِنَ الرَّكْعَتَيْنِ الْأُولَيَيْنِ فَقُلْ \nوَ أَنْتَ سَاجِدٌ يَا عَلِيُّ يَا عَظِيمُ يَا رَحْمَانُ يَا رَحِيمُ يَا سَامِعَ الدَّعَوَاتِ وَ يَا مُعْطِيَ الْخَيْرَاتِ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَعْطِنِي مِنْ خَيْرِ الدُّنْيَا وَ الْآخِرَةِ مَا أَنْتَ أَهْلُهُ وَ اصْرِفْ عَنِّي مِنْ شَرِّ الدُّنْيَا وَ الْآخِرَةِ مَا أَنْتَ أَهْلُهُ وَ أَذْهِبْ عَنِّي هَذَا الْوَجَعَ وَ سَمِّهِ فَإِنَّهُ قَدْ غَاظَنِي وَ أَحْزَنَنِي وَ أَلِحَّ فِي الدُّعَاءِ\nقَالَ فَمَا وَصَلْتُ إِلَى الْكُوفَةِ حَتَّى أَذْهَبَ اللَّهُ بِهِ عَنِّي كُلَّهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Malik Bin Atiyya, from Yunus Bin Ammar who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! This (illness) which has appeared in my face, the people are alleging that Allah<sup>azwj</sup> Mighty and Majestic does not Afflict any servant with it for whom He<sup>azwj</sup> has a need for’. So he<sup>asws</sup> said to him: ‘No! It was so that a Momin of the people of the Pharaoh<sup>la</sup> was paralysed of the fingers, so he was saying (gesturing) like this’ – and he<sup>asws</sup> extended his<sup>asws</sup> hand, and he was saying: ‘<span class=\"ibTxt\">[36:20] O people! Follow the Rasools</span>’. \nHe (the narrator) said, ‘Then he<sup>asws</sup> said: ‘When it is the last third of the night, during its beginning, perform ablution and stand to your <span class=\"iTxt\">Sal</span>ā<span class=\"iTxt\">t</span> which you tend to pray. So when you are in the last Sajdah of the first two Cycles, so say while you are in Sajdah, \n‘O Exalted! O Magnificent! O Beneficent! O Merciful! O Hearer of the supplications and O Giver of the goodness! Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and Give me from the goodness of the world and the Hereafter, what You<sup>azwj</sup> are Rightful of it, and Exchange from me from the evil of the world and the Hereafter what You<sup>azwj</sup> are Rightful of it, and Remove from me this pain’ – and specify it – ‘for it has infuriated me and grieved me’, and be insistent in the supplication’. \nHe (the narrator) said, ‘So I had not (even) arrive at Al-Kufa until Allah<sup>azwj</sup> Removed it from me, all of it’."}]}, {"index": 3393, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ جَمِيعاً عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا رَأَيْتَ الرَّجُلَ مَرَّ بِهِ الْبَلَاءُ فَقُلِ.\nالْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلَاكَ بِهِ وَ فَضَّلَنِي عَلَيْكَ وَ عَلَى كَثِيرٍ مِمَّنْ خَلَقَ وَ لَا تُسْمِعْهُ", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, and a number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, altogether from Hanan Bin Sadeyr, from his father, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Whenever you see a man who has been afflicted by the affliction, so say, \n‘The Praise is for Allah<sup>azwj</sup> Who Granted me good health from that He<sup>azwj</sup> Afflicted you with, and Preferred me over you, and from a lot of the people’ –  but be sure not to make him hear what you said.’."}]}, {"index": 3394, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ بَعْضِ أَصْحَابِهِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ دَاوُدَ بْنِ زُرْبِيٍّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَضَعُ يَدَكَ عَلَى الْمَوْضِعِ الَّذِي فِيهِ الْوَجَعُ وَ تَقُولُ ثَلَاثَ مَرَّاتٍ \nاللَّهُ اللَّهُ رَبِّي حَقّاً لَا أُشْرِكُ بِهِ شَيْئاً اللَّهُمَّ أَنْتَ لَهَا وَ لِكُلِّ عَظِيمَةٍ فَفَرِّجْهَا عَنِّي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from one of his companions, from Muhammad Bin Isa, from Dawood Bin Zurby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You should place your hand upon painful place, and you should be saying <span style=\"text-decoration: underline\">three times</span>, \n‘Allah<sup>azwj</sup>! Allah<sup>azwj</sup> is my Lord<sup>azwj</sup> truly. I do not associate anything with Him<sup>azwj</sup>. O Allah<sup>azwj</sup>! You<sup>azwj</sup> are (the help) for it (the pain), and for all great troubles, so (please) Relieve it from me’."}]}, {"index": 3395, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:7", "text": "عَنْهُ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ دَاوُدَ عَنْ مُفَضَّلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) لِلْأَوْجَاعِ تَقُولُ.\nبِسْمِ اللَّهِ وَ بِاللَّهِ كَمْ مِنْ نِعْمَةٍ لِلَّهِ فِي عِرْقٍ سَاكِنٍ وَ غَيْرِ سَاكِنٍ عَلَى عَبْدٍ شَاكِرٍ وَ غَيْرِ شَاكِرٍ وَ تَأْخُذْ لِحْيَتَكَ بِيَدِكَ الْيُمْنَى بَعْدَ صَلَاةٍ مَفْرُوضَةٍ وَ تَقُولُ اللَّهُمَّ فَرِّجْ عَنِّي كُرْبَتِي وَ عَجِّلْ عَافِيَتِي وَ اكْشِفْ ضُرِّي ثَلَاثَ مَرَّاتٍ وَ احْرِصْ أَنْ يَكُونَ ذَلِكَ مَعَ دُمُوعٍ وَ بُكَاءٍ", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Muhammad Bin Isa, from Dawood, from Mufazzal, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> for the pains: \n‘You should be saying, ‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>! How many Bounties of Allah<sup>azwj</sup> are in the calm veins and agitated veins, upon a grateful servant and an ungrateful servant’, and you should grab your beard by your right hand after the Obligatory <span class=\"iTxt\">Salāt</span>, and you should be saying, ‘Relieve from me my worries, and Hasten my good health, and Remove my harm’, <span style=\"text-decoration: underline\">three times</span>, and make sure that, that happens to be along with tears and weeping’."}]}, {"index": 3396, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:8", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ رَجُلٍ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَشَكَوْتُ إِلَيْهِ وَجَعاً بِي فَقَالَ قُلْ \nبِسْمِ اللَّهِ ثُمَّ امْسَحْ يَدَكَ عَلَيْهِ وَ \nقُلْ أَعُوذُ بِعِزَّةِ اللَّهِ وَ أَعُوذُ بِقُدْرَةِ اللَّهِ وَ أَعُوذُ بِجَلَالِ اللَّهِ وَ أَعُوذُ بِعَظَمَةِ اللَّهِ وَ أَعُوذُ بِجَمْعِ اللَّهِ وَ أَعُوذُ بِرَسُولِ اللَّهِ وَ أَعُوذُ بِأَسْمَاءِ اللَّهِ مِنْ شَرِّ مَا أَحْذَرُ وَ مِنْ شَرِّ مَا أَخَافُ عَلَى نَفْسِي تَقُولُهَا سَبْعَ مَرَّاتٍ\nقَالَ فَفَعَلْتُ فَأَذْهَبَ اللَّهُ عَزَّ وَ جَلَّ بِهَا الْوَجَعَ عَنِّي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from a man who said, \n‘I went over to Abu Abdullah<sup>asws</sup> and I complained to him<sup>asws</sup> of my pain. So he<sup>asws</sup> said, ‘Say, \n‘In the Name of Allah<sup>azwj</sup>’, then wipe your hand over it and say, \n‘I seek Refuge by the Might of Allah<sup>azwj</sup>, and I seek Refuge with the Power of Allah<sup>azwj</sup>, and I seek Refuge with the Majesty of Allah<sup>azwj</sup>, and I seek Refuge with the Magnificence of Allah<sup>azwj</sup>, and I seek Refuge with the Hold of Allah<sup>azwj</sup>, and I seek Refuge with Rasool-Allah<sup>saww</sup>, and I seek Refuge with the Names of Allah<sup>azwj</sup>, from the evil of what I am cautious of, and from the evil of what I fear upon myself’. You should be saying it <span style=\"text-decoration: underline\">seven times’</span>. \nHe (the narrator) said, ‘So I did it, and Allah<sup>azwj</sup> Mighty and Majestic Removed the pain by it’."}]}, {"index": 3397, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:9", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْوَشَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ عَوْنٍ قَالَ أَمِرَّ يَدَكَ عَلَى مَوْضِعِ الْوَجَعِ ثُمَّ قُلْ.\nبِسْمِ اللَّهِ وَ بِاللَّهِ وَ مُحَمَّدٌ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ اللَّهُمَّ امْسَحْ عَنِّي مَا أَجِدُ ثُمَّ تُمِرُّ يَدَكَ الْيُمْنَى وَ تَمْسَحُ مَوْضِعَ الْوَجَعِ ثَلَاثَ مَرَّاتٍ", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Washha, from Abdullah Bin Sinan, from Awn, \n‘He<sup>asws</sup> said said: ‘Pass your hand upon the place of the pain, then say, \n‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>, and Muhammad<sup>saww</sup> Rasool-Allah<sup>saww</sup>, and there is neither Might nor Strength except with Allah<sup>azwj</sup>, the Exalted, the Magnificent. O Allah<sup>azwj</sup>! Wipe out from me what I find (the pain)’. Then you should pass your right hand and wipe the place of the pain, <span style=\"text-decoration: underline\">three times’</span>."}]}, {"index": 3398, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:10", "text": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ أَخِي غَرَامٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَضَعُ يَدَكَ عَلَى مَوْضِعِ الْوَجَعِ ثُمَّ تَقُولُ.\nبِسْمِ اللَّهِ وَ بِاللَّهِ وَ مُحَمَّدٌ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ اللَّهُمَّ امْسَحْ عَنِّي مَا أَجِدُ وَ تَمْسَحُ الْوَجَعَ ثَلَاثَ مَرَّاتٍ", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ahmad Bin Muhammad, from Ahmad Bin Muhammad Bin Abu Nasr, from Muhammad Bin Akhy Gharam, from Abdullah Bin Sinan, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You should place your hand upon the place of the pain, then you should be saying, \n‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>, and Muhammad<sup>saww</sup> Rasool-Allah<sup>saww</sup>, and there is neither Might nor Strength except with Allah<sup>azwj</sup>. O Allah<sup>azwj</sup>! Wipe out from me what I find (the pain)’. Then wipe the place of the pain, three times’."}]}, {"index": 3399, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:11", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ عَلِيِّ بْنِ عِيسَى عَنْ عَمِّهِ قَالَ قُلْتُ لَهُ عَلِّمْنِي دُعَاءً أَدْعُو بِهِ لِوَجَعٍ أَصَابَنِي قَالَ قُلْ وَ أَنْتَ سَاجِدٌ.\nيَا اللَّهُ يَا رَحْمَانُ يَا رَحِيمُ يَا رَبَّ الْأَرْبَابِ وَ إِلَهَ الْآلِهَةِ وَ يَا مَلِكَ الْمُلُوكِ وَ يَا سَيِّدَ السَّادَةِ اشْفِنِي بِشِفَائِكَ مِنْ كُلِّ دَاءٍ وَ سُقْمٍ فَإِنِّي عَبْدُكَ أَتَقَلَّبُ فِي قَبْضَتِكَ", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Amro Bin usman, from Ali Bin Isa, from his uncle who said, \n‘I said to him<sup>asws</sup>, ‘Teach me a supplication I can supplicate with for the pain which has hit me’. He<sup>asws</sup> said: ‘Say while you are performing <span class=\"iTxt\">Sajdah</span>, \n‘O Allah<sup>azwj</sup>! O Beneficent! O Lord<sup>azwj</sup> of the lords and Sustainer of the Sustainers, and O King of the kings, and O Chief of the chiefs! Heal me by Your<sup>azwj</sup> Healing, from every illness and disease, for I am Your<sup>azwj</sup> servant, turning over in Your<sup>azwj</sup> Grip’’."}]}, {"index": 3400, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:12", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ إِذَا دَخَلْتَ عَلَى مَرِيضٍ فَقُلْ \nأُعِيذُكَ بِاللَّهِ الْعَظِيمِ رَبِّ الْعَرْشِ الْعَظِيمِ مِنْ شَرِّ كُلِّ عِرْقٍ نَفَّارٍ وَ مِنْ شَرِّ حَرِّ النَّارِ سَبْعَ مَرَّاتٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Najran, from Hammad Bin Isa, from Hareyz, from Zurara, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> imam<sup>asws</sup>) having said: ‘Whenever you go over to a sick person, so say, \n‘I seek Refuge with Allah<sup>azwj</sup> the Magnificent, Lord<sup>azwj</sup> of the Throne, from the evil of every swollen vein, and from the evil of the heat of the Fire’, <span style=\"text-decoration: underline\">seven times’</span>."}]}, {"index": 3401, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:13", "text": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الثُّمَالِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا اشْتَكَى الْإِنْسَانُ فَلْيَقُلْ.\nبِسْمِ اللَّهِ وَ بِاللَّهِ وَ مُحَمَّدٌ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَعُوذُ بِعِزَّةِ اللَّهِ وَ أَعُوذُ بِقُدْرَةِ اللَّهِ عَلَى مَا يَشَاءُ مِنْ شَرِّ مَا أَجِدُ", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu nasr, from Aban Bin Usman, from Al Sumaly, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When a person has a complaint, so let him say, \n‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>, and Muhammad<sup>saww</sup> Rasool-Allah<sup>saww</sup>! I seek Refuge by the Might of Allah<sup>azwj</sup>, and I seek Refuge with the Power of Allah<sup>azwj</sup> upon whatever He<sup>azwj</sup> so Desires to from the evil of what I find’."}]}, {"index": 3402, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:14", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ هِشَامٍ الْجَوَالِيقِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) .\nيَا مُنْزِلَ الشِّفَاءِ وَ مُذْهِبَ الدَّاءِ أَنْزِلْ عَلَى مَا بِي مِنْ دَاءٍ شِفَاءً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Ali, from Hisham Al Jawaleyqi, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: \n‘O (Who) Sends down the healing and Removes the illness, Send down a healing upon what is with me from the illness!’"}]}, {"index": 3403, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:15", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُوسَى بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي إِسْحَاقَ صَاحِبِ الشَّعِيرِ عَنْ حُسَيْنٍ الْخُرَاسَانِيِّ وَ كَانَ خَبَّازاً قَالَ شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَجَعاً بِي فَقَالَ إِذَا صَلَّيْتَ فَضَعْ يَدَكَ مَوْضِعَ سُجُودِكَ ثُمَّ قُلْ.\nبِسْمِ اللَّهِ مُحَمَّدٌ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) اشْفِنِي يَا شَافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سُقْماً شِفَاءً مِنْ كُلِّ دَاءٍ وَ سُقْمٍ", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Musa Bin Al Hassan, from Muhammad Bin Isa, from Abu Is’haq, Sahid Al Shaeer, from Husay Al Khurasany, and he was a baker, who said, \n‘I complained to Abu Abdullah<sup>asws</sup> of pains of mine, so he<sup>asws</sup> said: ‘When you pray <span class=\"iTxt\">Salāt</span>, so place your hand upon the place of your <span class=\"iTxt\">Sajdah</span>, then say, \n‘In the Name of Allah<sup>azwj</sup>, Muhammad<sup>saww</sup> Rasool-Allah<sup>saww</sup>! Heal me, O Healer! There is no healing except Your<sup>azwj</sup> Healing. A healing which not leaving out a sickness, a healing from every illness and disease’’."}]}, {"index": 3404, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:16", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَرِضَ عَلِيٌّ ( صلوات الله عليه )  فَأَتَاهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ لَهُ قُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ تَعْجِيلَ عَافِيَتِكَ وَ صَبْراً عَلَى بَلِيَّتِكَ وَ خُرُوجاً إِلَى رَحْمَتِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from one of his companions, from Abu Hamza, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Ali<sup>asws</sup> fell sick, so Rasool-Allah<sup>saww</sup> came over to him<sup>asws</sup> and said to him<sup>asws</sup>: ‘Say: ‘O Allah<sup>azwj</sup>! I<sup>asws</sup> ask You<sup>azwj</sup> of quick recovery and patience upon Your<sup>azwj</sup> affliction, and an exit into Your<sup>azwj</sup> Mercy’’."}]}, {"index": 3405, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:17", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) كَانَ يُنَشِّرُ بِهَذَا الدُّعَاءِ تَضَعُ يَدَكَ عَلَى مَوْضِعِ الْوَجَعِ وَ تَقُولُ \nأَيُّهَا الْوَجَعُ اسْكُنْ بِسَكِينَةِ اللَّهِ وَ قِرْ بِوَقَارِ اللَّهِ وَ انْحَجِزْ بِحَاجِزِ اللَّهِ وَ اهْدَأْ بِهَدْءِ اللَّهِ أُعِيذُكَ أَيُّهَا الْإِنْسَانُ بِمَا أَعَاذَ اللَّهُ عَزَّ وَ جَلَّ بِهِ عَرْشَهُ وَ مَلَائِكَتَهُ يَوْمَ الرَّجْفَةِ وَ الزَّلَازِلِ تَقُولُ ذَلِكَ سَبْعَ مَرَّاتٍ وَ لَا أَقَلَّ مِنَ الثَّلَاثِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> that the Prophet<sup>saww</sup> used to seek cure with this supplication: ‘You should place your hand upon the place of the pain, and you should be saying, \n‘O you pain! Settle by the Tranquility of Allah<sup>azwj</sup>, and cool down by the Dignity of Allah<sup>azwj</sup>, and be barred by the Barrier of Allah<sup>azwj</sup>, calm down by the Calmness of Allah<sup>azwj</sup>. Seek Refuge, O human being, by what Refuge of Allah<sup>azwj</sup> with Allah<sup>azwj</sup> would be sought by His<sup>azwj</sup> Throne, and His<sup>azwj</sup> Angels on the Day of tremors and earthquakes’. You should say that seven times, and not less <span style=\"text-decoration: underline\">than three’</span>."}]}, {"index": 3406, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:18", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَمَّارِ بْنِ الْمُبَارَكِ عَنْ عَوْنِ بْنِ سَعْدٍ مَوْلَى الْجَعْفَرِيِّ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَضَعُ يَدَكَ عَلَى مَوْضِعِ الْوَجَعِ وَ تَقُولُ \nاللَّهُمَّ إِنِّي أَسْأَلُكَ بِحَقِّ الْقُرْآنِ الْعَظِيمِ الَّذِي نَزَلَ بِهِ الرُّوحُ الْأَمِينُ وَ هُوَ عِنْدَكَ فِي أُمِّ الْكِتَابِ عَلِيٌّ حَكِيمٌ أَنْ تَشْفِيَنِي بِشِفَائِكَ وَ تُدَاوِيَنِي بِدَوَائِكَ وَ تُعَافِيَنِي مِنْ بَلَائِكَ ثَلَاثَ مَرَّاتٍ وَ تُصَلِّي عَلَى مُحَمَّدٍ وَ آلِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ammar Bin Al Mubarak, from Awn Bin Sa’ad, a slave of Al Ja’fary, from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You should place your hand upon the place of the pain, and you should be saying, \n‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> by the right of the Magnificent Quran Which the Trustworthy Spirit descended with, and it is with You<sup>azwj</sup> in the Mother of the Book, the Exalted, the Wise, that You<sup>azwj</sup> should Heal me with Your<sup>azwj</sup> Healing, and Treat me with Your<sup>azwj</sup> Treatment, and Grant me well-being from Your<sup>azwj</sup> afflictions’ – <span style=\"text-decoration: underline\">three times</span>, and you should send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>’."}]}, {"index": 3407, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:2:2:56:19", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْعَوْفِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زُرَارَةَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ عَرَضَ بِي وَجَعٌ فِي رُكْبَتِي فَشَكَوْتُ ذَلِكَ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ إِذَا أَنْتَ صَلَّيْتَ فَقُلْ \nيَا أَجْوَدَ مَنْ أَعْطَى وَ يَا خَيْرَ مَنْ سُئِلَ وَ يَا أَرْحَمَ مَنِ اسْتُرْحِمَ ارْحَمْ ضَعْفِي وَ قِلَّةَ حِيلَتِي وَ عَافِنِي مِنْ وَجَعِي\nقَالَ فَفَعَلْتُهُ فَعُوفِيتُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Al Awfy, from Ali Bin Al Husayn, form Muhammad Bin Abdullah Bin Zurara, from Muhammad Bin Al Fuzayl, from Abu Hamza who said, \n‘A pain appeared with me in my knee, so I complained about that to Abu Ja’far<sup>asws</sup>. So he<sup>asws</sup> said: ‘When you go to pray <span class=\"iTxt\">Sal</span>ā<span class=\"iTxt\">t</span>, so say, \n‘O the Most Benevolent of the ones who give, and O the Best of the ones who are asked from, and O the Most Benevolent of the ones who have mercy, have Mercy on my weakness and scarcity of my way out, and Grant me good health from my pain’. \nHe (the narrator) said, ‘So I did it, and regained health’."}]}]}, "index": "al-kafi:2:2:56", "kind": "verse_list"}