{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 57"
        },
        "path": "/books/al-kafi:2:2:57",
        "titles": {
          "ar": "بَابُ الْحِرْزِ وَ الْعُوذَةِ",
          "en": "Chapter 57 – The protection and the seeking Refuge"
        }
      }
    ],
    "index": 454,
    "local_index": 57,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 58"
        },
        "path": "/books/al-kafi:2:2:58",
        "titles": {
          "ar": "بَابُ الدُّعَاءِ عِنْدَ قِرَاءَةِ الْقُرْآنِ",
          "en": "Chapter 58 – The supplication during recitation of the Quran"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 56"
        },
        "path": "/books/al-kafi:2:2:56",
        "titles": {
          "ar": "بَابُ الدُّعَاءِ لِلْعِلَلِ وَ الْأَمْرَاضِ",
          "en": "Chapter 56 – The supplication for the illnesses and diseases"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:2:57",
    "titles": {
      "ar": "بَابُ الْحِرْزِ وَ الْعُوذَةِ",
      "en": "Chapter 57 – The protection and the seeking Refuge"
    },
    "verse_count": 14,
    "verse_start_index": 3407,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/436)"
        ],
        "index": 3408,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1407",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/532",
              "text": "الْحَسَنِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/212",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/213",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2221",
              "text": "ابْنِ الْمُنْذِرِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنِ ابْنِ الْمُنْذِرِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:1",
        "text": [
          " ذُكِرَتْ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْوَحْشَةُ فَقَالَ أَ لَا أُخْبِرُكُمْ بِشَيْ‏ءٍ إِذَا قُلْتُمُوهُ لَمْ تَسْتَوْحِشُوا بِلَيْلٍ وَ لَا نَهَارٍ ",
          "بِسْمِ اللَّهِ وَ بِاللَّهِ وَ تَوَكَّلْتُ عَلَى اللَّهِ وَ أَنَّهُ مَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْ‏ءٍ قَدْراً اللَّهُمَّ اجْعَلْنِي فِي كَنَفِكَ وَ فِي جِوَارِكَ وَ اجْعَلْنِي فِي أَمَانِكَ وَ فِي مَنْعِكَ",
          "فَقَالَ بَلَغَنَا أَنَّ رَجُلًا قَالَهَا ثَلَاثِينَ سَنَةً وَ تَرَكَهَا لَيْلَةً فَلَسَعَتْهُ عَقْرَبٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad, from someone else, from Aban, from Ibn al Munzar who said, ",
            "‘The loneliness was mentioned in the presence of Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said: ‘Shall I<sup>asws</sup> inform you all with something, when you say it, you will not feel the loneliness at night or by the day? (Say), ",
            "‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>, and I rely upon Allah<sup>azwj</sup>, and it is so that the one who relies upon Allah<sup>azwj</sup>, so He<sup>azwj</sup> would Suffice him. Allah<sup>azwj</sup> would Accomplish His<sup>azwj</sup> Command. Allah<sup>azwj</sup> has Made an Ordainment for everything. O Allah<sup>azwj</sup>! Make me to be in Your<sup>azwj</sup> Patronage, and in Your<sup>azwj</sup> Vicinity, and Make me to be in Your<sup>azwj</sup> Security and in Your<sup>azwj</sup> Interdiction’. ",
            "So he (the narrator) said, ‘It reached us that a man said it for thirty years and neglected it for one night, so a scorpion stung him’."
          ],
          "en.sarwar": [
            "1. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad from more than one person from Aban from ibn al-Mundhir who has said the following: “Once I mentioned fear before abu ‘Abd Allah (a.s.) and he said, ‘I should tell you something that after saying it you will not be frightened during the day or night, say, “In the name of Allah, with (the help of) Allah, I place my trust before Allah; whoever places his trust before Allah, He is suffices him and Allah completes his affairs. Allah has assigned a measure for everything. O Lord, place me under Your protection, in Your neighborhood, include me in Your amnesty and under Your protection.’ I (the narrator) heard the case of a man who had practiced this for thirty years. He did not say it one night and a scorpion bit him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> سكت عنه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/436)"
        ],
        "index": 3409,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1620",
              "text": "مُحَسِّنِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/550",
              "text": "يُونُسَ بْنِ يَعْقُوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:2",
        "text": [
          " قُلْ.",
          "أَعُوذُ بِعِزَّةِ اللَّهِ وَ أَعُوذُ بِقُدْرَةِ اللَّهِ وَ أَعُوذُ بِجَلَالِ اللَّهِ وَ أَعُوذُ بِعَظَمَةِ اللَّهِ وَ أَعُوذُ بِعَفْوِ اللَّهِ وَ أَعُوذُ بِمَغْفِرَةِ اللَّهِ وَ أَعُوذُ بِرَحْمَةِ اللَّهِ وَ أَعُوذُ بِسُلْطَانِ اللَّهِ الَّذِي هُوَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ وَ أَعُوذُ بِكَرَمِ اللَّهِ وَ أَعُوذُ بِجَمْعِ اللَّهِ مِنْ شَرِّ كُلِّ جَبَّارٍ عَنِيدٍ وَ كُلِّ شَيْطَانٍ مَرِيدٍ وَ شَرِّ كُلِّ قَرِيبٍ أَوْ بَعِيدٍ أَوْ ضَعِيفٍ أَوْ شَدِيدٍ وَ مِنْ شَرِّ السَّامَّةِ وَ الْهَامَّةِ وَ الْعَامَّةِ وَ مِنْ شَرِّ كُلِّ دَابَّةٍ صَغِيرَةٍ أَوْ كَبِيرَةٍ بِلَيْلٍ أَوْ نَهَارٍ وَ مِنْ شَرِّ فُسَّاقِ الْعَرَبِ وَ الْعَجَمِ وَ مِنْ شَرِّ فَسَقَةِ الْجِنِّ وَ الْإِنْسِ"
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Muhassin Bin Ahmad, from Yunus Bin Yaqoub, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Say ",
            "‘I seek Refuge with the Might of Allah<sup>azwj</sup>, and I seek Refuge by the Power of Allah<sup>azwj</sup>, and I seek Refuge by the majesty of Allah<sup>azwj</sup>, and I seek Refuge with the Magnificence of Allah<sup>azwj</sup>, and I seek Refuge with the Pardon of Allah<sup>azwj</sup>, and I seek Refuge with the Forgiveness of Allah<sup>azwj</sup>, and I seek Refuge with the Mercy of Allah<sup>azwj</sup>, and I seek Refuge with the Authority of Allah<sup>azwj</sup> by which He<sup>azwj </sup>is Able over everything, and I seek Refuge with the Benevolence of Allah<sup>azwj</sup>, and I seek Refuge with the Hold of Allah<sup>azwj</sup>, from the evil of every tenacious tyrant and every rebellious Satan<sup>la</sup> and the evil of everything nearby, or remote, or weak, or difficult, and from the evil of the venomous (reptiles) and the insects, and the critical and the general, and from the evil of every animal be it small or large, at night or day, and from the evil of every mischievous Arab and the non-Arab, and from the evil of the mischief of the Jinn and the human beings’’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from Muhsin ibn Ahmad from Yunus ibn Ya’qub from abu Basir from abu ‘Abd Allah (a.s.) who has said the following: “For protection say, ‘I seek protection with the majesty of Allah, I seek protection with the power of Allah, I seek protection with glory of Allah, I seek protection with the greatness of Allah, I seek protection with the pardoning of Allah, I seek protection with the forgiveness of Allah, I seek protection with the mercy of Allah, I seek protection with the authority of Allah, Who has power over all things, I seek protection with the generosity of Allah, I seek protection with the community of Allah against the evil of all tyrants and hatemongers and all the condemned devils, all near and far, weak and strong, all poisonous beasts, fear, plague, the evil of all small and large animals, during the night or day, the evil of sinful Arabs and non-Arabs and the evil of the sinful Jinn and man.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/437)"
        ],
        "index": 3410,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/154",
              "text": "الْقَدَّاحِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:3",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) رَقَى النَّبِيُّ ( صلى الله عليه وآله ) حَسَناً وَ حُسَيْناً فَقَالَ ",
          "أُعِيذُكُمَا بِكَلِمَاتِ اللَّهِ التَّامَّاتِ وَ أَسْمَائِهِ الْحُسْنَى كُلِّهَا عَامَّةً مِنْ شَرِّ السَّامَّةِ وَ الْهَامَّةِ وَ مِنْ شَرِّ كُلِّ عَيْنٍ لَامَّةٍ وَ مِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ",
          "ثُمَّ الْتَفَتَ النَّبِيُّ ( صلى الله عليه وآله ) إِلَيْنَا فَقَالَ هَكَذَا كَانَ يُعَوِّذُ إِبْرَاهِيمُ إِسْمَاعِيلَ وَ إِسْحَاقَ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of his companions, from Al Qaddah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The Prophet<sup>saww</sup> lifted Hassan<sup>asws</sup> and Husayn<sup>asws</sup> and he<sup>saww</sup> said: ",
            "‘I<sup>saww</sup> seek Refuge for the both of you<sup>asws</sup> with the complete Words of Allah<sup>azwj</sup> and the all the Good General Names of Allah<sup>azwj</sup>, from the evil of the venomous (reptiles) and the insects, and from the evil of every eye bearing ill-will, and from the evil of every envious one’. ",
            "Then the Prophet<sup>saww</sup> turned towards us and he<sup>saww</sup> said: ‘This is how Ibrahim<sup>as</sup> used to seek Refuge for Ismail<sup>as</sup> and Is’haq<sup>as</sup>’’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from certain individuals of his people from al-Qaddah from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib (a.s.) has said, ‘The Holy Prophet read the following for the protection of al-Hassan and al-Husayn, recipients of divine supreme covenant, ‘I seek protection for both of you with the perfect words of Allah, with all of His beautiful, universal names against the evil of the poisonous ones, that which causes worry, all the evil eyes, and the envious ones when they exercise their envy. ’ The Holy Prophet then turned to us saying, ‘This is how Ibrahim sought protection for Isma’il and Ishaq.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/437)"
        ],
        "index": 3411,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2222",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1455",
              "text": "سُلَيْمَانَ الْجَعْفَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ بُكَيْرٍ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:4",
        "text": [
          " سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ إِذَا أَمْسَيْتَ فَنَظَرْتَ إِلَى الشَّمْسِ فِي غُرُوبٍ وَ إِدْبَارٍ فَقُلْ ",
          "بِسْمِ اللَّهِ وَ بِاللَّهِ وَ الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ صَاحِبَةً وَ لَا وَلَداً وَ لَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَ لَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَ كَبِّرْهُ تَكْبِيراً",
          "وَ الْحَمْدُ لِلَّهِ الَّذِي يَصِفُ وَ لَا يُوصَفُ وَ يَعْلَمُ وَ لَا يُعْلَمُ يَعْلَمُ خَائِنَةَ الْأَعْيُنِ وَ مَا تُخْفِي الصُّدُورُ وَ أَعُوذُ بِوَجْهِ اللَّهِ الْكَرِيمِ وَ بِاسْمِ اللَّهِ الْعَظِيمِ مِنْ شَرِّ مَا بَرَأَ وَ ذَرَأَ وَ مِنْ شَرِّ مَا تَحْتَ الثَّرَى وَ مِنْ شَرِّ مَا بَطَنَ وَ ظَهَرَ وَ مِنْ شَرِّ مَا وَصَفْتُ وَ مَا لَمْ أَصِفْ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
          "ذَكَرَ أَنَّهَا أَمَانٌ مِنْ كُلِّ سَبُعٍ وَ مِنَ الشَّيْطَانِ الرَّجِيمِ وَ ذُرِّيَّتِهِ وَ كُلِّ مَا عَضَّ أَوْ لَسَعَ وَ لَا يَخَافُ صَاحِبُهَا إِذَا تَكَلَّمَ بِهَا لِصّاً وَ لَا غُولًا ",
          "قَالَ قُلْتُ لَهُ إِنِّي صَاحِبُ صَيْدِ السَّبُعِ وَ أَنَا أَبِيتُ فِي اللَّيْلِ فِي الْخَرَابَاتِ وَ أَتَوَحَّشُ فَقَالَ لِي قُلْ إِذَا دَخَلْتَ ",
          "بِسْمِ اللَّهِ أَدْخُلُ وَ أَدْخِلْ رِجْلَكَ الْيُمْنَى وَ إِذَا خَرَجْتَ فَأَخْرِجْ رِجْلَكَ الْيُسْرَى وَ سَمِّ اللَّهَ فَإِنَّكَ لَا تَرَى مَكْرُوهاً."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Bukeyr, from Suleyman Al Ja’fary who said, ",
            "‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘When it is evening, so look towards the sun during the setting and disappearing, so say, ",
            "‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>, and the Praise is for Allah<sup>azwj</sup> Who neither Took a female companion, nor a son, and there does not happen to be a match for Him<sup>azwj</sup> in the Kingdom, and there does not happen to be a guardian for him from the disgrace, and His<sup>azwj</sup> Greatness is the Greatest. ",
            "And the Praise is for Allah<sup>azwj</sup> Who Describes while He<sup>azwj</sup> cannot be described, and He<sup>azwj</sup> Knows while He<sup>azwj</sup> cannot be known. He<sup>azwj</sup> Knows the betrayal of the eyes and what the chests conceal. And I seek Refuge by His<sup>azwj</sup> Benevolent Face, and by the Magnificent Name of Allah<sup>azwj</sup>, from the evil of what is spread and inseminated, and from the evil of what is beneath the ground, and from the evil of what is hidden and apparent, and from the evil of what can be described and what cannot be described. And the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds.",
            "He<sup>asws</sup> mentioned: ‘It is a security from every predatory wild animals, and from the Pelted Satan<sup>la</sup> and his<sup>la</sup> offspring, and everything what bites or stings, and its reciter, when he speaks with it, would neither fear a thief nor a devil’. ",
            "He (the narrator) said, ‘I said to him<sup>asws</sup>, ‘I am a hunter of the wild animals and I tend to spend the night among the ruins and I am alone’. So he<sup>asws</sup> said to me: ‘Say when you enter (the hunting), ",
            "‘In the Name of Allah<sup>azwj</sup> I enter’, and enter your right leg; and when you exit, so exit your left leg (first) and Name Allah<sup>azwj</sup> (<span class=\"iTxt\">Bismillah</span>), so you will not be seeing an abhorrence’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn Bukayr from Sulayman al-Ja’fari who has said the following: “I heard abu al-Hassan saying, ‘In the evening when you see the sun about to go down and disappear then say, “In the name of Allah, with (the help of) Allah, all praise belongs to Allah, Who has not taken any companion, or children. Who has no partner in His kingdom or a supporter against weakness, and He is greater than can be described, all praise belongs to Allah Who describes (things) and Himself cannot be described. Who knows all things but Himself cannot be known. He knows the stealth glance of the eyes and whatever the chests hide. I seek protection with His honorable face, and with His great names against the evil of whatever He has spread and has populated, the evil of the things beneath the earth, the evil of what is apparent and that which is hidden, the evil of what I mentioned or did not mention, all praise belongs to Allah Lord of the worlds.” “The Imam mentioned that this is protection against all the beasts, and all devils condemned to stoning and all the biting and stinging animals. One who reads this supplication should have no fear from thieves or the devils.’ “I (the narrator) then said to him, T hunt beasts and at night I sleep in ruined places and I feel afraid.’ He said on entering them say, ‘In the name of Allah, I enter and step your right foot first but when coming out step with your left foot first and mention the name of Allah you will not see any frightening thing.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/438)"
        ],
        "index": 3412,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/65",
              "text": "قُتَيْبَةَ الْأَعْشَى"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ قُتَيْبَةَ الْأَعْشَى قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:5",
        "relations": {
          "Mentions": [
            "/books/quran:2:255"
          ]
        },
        "text": [
          " عَلَّمَنِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْ ",
          "بِسْمِ اللَّهِ الْجَلِيلِ أُعِيذُ فُلَاناً بِاللَّهِ الْعَظِيمِ مِنَ الْهَامَّةِ وَ السَّامَّةِ وَ اللَّامَّةِ وَ الْعَامَّةِ وَ مِنَ الْجِنِّ وَ الْإِنْسِ وَ مِنَ الْعَرَبِ وَ الْعَجَمِ وَ مِنْ نَفْثِهِمْ وَ بَغْيِهِمْ وَ نَفْخِهِمْ وَ بِآيَةِ الْكُرْسِيِّ ثُمَّ تَقْرَؤُهَا",
          "ثُمَّ تَقُولُ فِي الثَّانِيَةِ بِسْمِ اللَّهِ أُعِيذُ فُلَاناً بِاللَّهِ الْجَلِيلِ حَتَّى تَأْتِيَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Quteyba Al A’asha who said, ",
            "‘Abu Abdullah<sup>asws</sup> taught me saying: ‘Say, ",
            "‘In the Name of Allah<sup>azwj</sup> the Majestic! I seek refuge for so and so, with Allah<sup>azwj</sup> the Magnificent, from the insects and the venomous (reptiles), and the evil eyes, and the generality (of creatures), and from the Jinn and the human beings, and from the Arabs and the non-Arabs, and from their sorcery and their rebellions, and their spells, and by the Ayat Al Kursy <a href=\"/#/books/quran:2#h255\">[2:255]</a>’ – then recite it.  ",
            "Then you should be saying during the second (time), ‘In the Name of Allah<sup>azwj</sup>! I seek Refuge with Allah<sup>azwj</sup> the Majestic’ until you overcome upon it’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Qutaybah al-‘A’Sha’ who has said the following: “Abu ‘Abd Allah (a.s.) instructed me with this supplication: ‘In the name of Allah, the glorious, I seek protection for so and so with (the help of) Allah, the Most Great, against all small living things (vermin, insect, germs, viruses and so forth), the venomous things, evil eyes, plague, the evil of Jinn and human beings of Arabs and non- Arabs, against their sorcery, transgression and against their spell, with reading verse 255 of Chapter 2 and in the second time reading the above supplication say, “In the name of Allah, I seek protection for so and so, with (the help of) Allah, the Glorious One ... to the end of the above supplication.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/439)"
        ],
        "index": 3413,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:6",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنِّي أَخَافُ الْعَقَارِبَ فَقَالَ انْظُرْ إِلَى بَنَاتِ نَعْشٍ الْكَوَاكِبِ الثَّلَاثَةِ الْوُسْطَى مِنْهَا بِجَنْبِهِ كَوْكَبٌ صَغِيرٌ قَرِيبٌ مِنْهُ تُسَمِّيهِ الْعَرَبُ السُّهَا وَ نَحْنُ نُسَمِّيهِ أَسْلَمَ أَحِدَّ النَّظَرَ إِلَيْهِ كُلَّ لَيْلَةٍ وَ قُلْ ثَلَاثَ مَرَّاتٍ ",
          "اللَّهُمَّ رَبَّ أَسْلَمَ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ عَجِّلْ فَرَجَهُمْ وَ سَلِّمْنَا",
          "قَالَ إِسْحَاقُ فَمَا تَرَكْتُهُ مُنْذُ دَهْرِي إِلَّا مَرَّةً وَاحِدَةً فَضَرَبَتْنِي الْعَقْرَبُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I fear the scorpions’. So he<sup>asws</sup> said: ‘Look at the daughters of the little bear (Ursa Minor), the three stars, (at) the middle one from it, by the side of it is a small star near to it, named by the Arabs as Al-Suha, and we call it as Aslam, with a solitary gaze at it every night, and say three times, ",
            "‘O Allah<sup>azwj</sup>! Lord<sup>azwj</sup> of Aslam! Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and Hasten their<sup>asws</sup> relief and Keep us safe’. ",
            "Is’haq said, ‘So I did not neglect it since my time (of having learnt that) except for once, so the scorpion stung me’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Ishaq ibn ‘ Ammar who has said the following: “Once I said to abu ‘Abd Allah (a.s.) ‘May Allah keep my soul in service for your cause, I am afraid of scorpions. The Imam said, ‘Look at the little bear (Ursa Minor ) and of the three stars next to the middle one of them there is a small star. Arabs call it al-Suha’. We call it Aslama, look at it gazing every night and say, ‘O Lord of Aslama, confer al-Salat (favors) upon Muhammad and his family, hasten their happiness and grant us safety and protection.’ Ishaq has said that he did not miss it except once at which time a scorpion stung bit him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/439)"
        ],
        "index": 3414,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/88",
              "text": "عَلِيِّ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1066",
              "text": "الْعَبَّاسِ بْنِ عَامِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/762",
              "text": "أَبِي جَمِيلَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/673",
              "text": "سَعْدٍ الْإِسْكَافِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ أَبِي جَمِيلَةَ عَنْ سَعْدٍ الْإِسْكَافِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:7",
        "text": [
          " سَمِعْتُهُ يَقُولُ مَنْ قَالَ هَذِهِ الْكَلِمَاتِ فَأَنَا ضَامِنٌ لَهُ أَلَّا يُصِيبَهُ عَقْرَبٌ وَ لَا هَامَّةٌ حَتَّى يُصْبِحَ.",
          "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ وَ لَا فَاجِرٌ مِنْ شَرِّ مَا ذَرَأَ وَ مِنْ شَرِّ مَا بَرَأَ وَ مِنْ شَرِّ كُلِّ دَابَّةٍ هُوَ آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ"
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hassan, from Al Abbas Bin Aamir, from Abu Jameela, from Sa’d Al Iskaf who said, ",
            "‘I heard him<sup>asws</sup> saying: ‘The one who says these words, so I<sup>asws</sup> guarantee to him that a scorpion would not bite him, nor an insect until morning, ",
            "‘I seek Refuge with the complete Words of Allah<sup>azwj</sup> Which neither a righteous one nor an immoral one can exceed, from the evil what is inseminated, and from the evil of what is spread, and from the evil of every animal being Seized by its forelocks, that my Lord<sup>azwj</sup> is upon the Straight Path’’."
          ],
          "en.sarwar": [
            "7. Ahmad ibn Muhammad has narrated from Ali ibn al-Hassan from al- ‘Abbas ibn ‘Amir from Muhammad abu Jamilah from Sa’D al-Iskaf who has said the following: “I heard the Imam (a.s.) saying, ‘Whoever says these words I guarantee that scorpions and small vermin will not harm him, ‘I seek protection through such words of Allah that no virtuous or wicked person is able to bypass, I seek protection thereby against the evil of whatever He has spread and settled (on earth), against the evil of all walking things on earth under His control. My Lord has the straight path.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/440)"
        ],
        "index": 3415,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/351",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:8",
        "text": [
          " كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي بَعْضِ مَغَازِيهِ إِذَا شَكَوْا إِلَيْهِ الْبَرَاغِيثَ أَنَّهَا تُؤْذِيهِمْ فَقَالَ إِذَا أَخَذَ أَحَدُكُمْ مَضْجَعَهُ فَلْيَقُلْ ",
          "أَيُّهَا الْأَسْوَدُ الْوَثَّابُ الَّذِي لَا يُبَالِي غَلَقاً وَ لَا بَاباً عَزَمْتُ عَلَيْكَ بِأُمِّ الْكِتَابِ أَلَّا تُؤْذِيَنِي وَ أَصْحَابِي إِلَى أَنْ يَذْهَبَ اللَّيْلُ وَ يَجِي‏ءَ الصُّبْحُ بِمَا جَاءَ وَ الَّذِي",
          "نَعْرِفُهُ إِلَى أَنْ يَئُوبَ الصُّبْحُ مَتَى مَا آبَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> was in one of his<sup>saww</sup> military expedition when they (soldiers) complained to him<sup>saww</sup> of the fleas that they are hurting them. So he<sup>saww</sup> said: ‘Whenever one of you takes to his bed, so let him say, ",
            "‘O you black leaping one who does not care about the locked door nor about the greatness of a door! Upon you is with the Mother of the Book, that you shall neither hurt me or my companions up to the departure of the night and the coming of the morning, with whatever it comes with’.",
            "(The narrator said), ‘We recognise the coming of the morning, when it comes’’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Ali ibn abu Hamza from abu al-Hassan (a.s.) who has said the following: “During certain expeditions people complained before the Messenger of Allah against fleas that irritated them. He (the Messenger of Allah) said, ‘When going into your bed say, “O black jumping thing that does not stop by the barrier or door I ask you by the original Book, do not irritate me and my companions until the night passes and morning comes with whatever it will bring along.’” The narrator has said, ‘As we know the last part of this Hadith has the following expression: ‘Until morning comes back when it is the time to come back.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/440)"
        ],
        "index": 3416,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1038",
              "text": "ابْنِ جُمْهُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنِ ابْنِ جُمْهُورٍ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:9",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا لَقِيتَ السَّبُعَ فَقُلْ.",
          "أَعُوذُ بِرَبِّ دَانِيَالَ وَ الْجُبِّ مِنْ شَرِّ كُلِّ أَسَدٍ مُسْتَأْسِدٍ"
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ibn Jamhour, from his father, from Muhammad Bin Sinan, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘When you come across a predatory wild animal, so say, ",
            "‘I seek Refuge with the Lord<sup>azwj</sup> of Daniel and the Pit, from the evil of every ferocious lion’."
          ],
          "en.sarwar": [
            "9. Ali ibn has narrated from ibn Jumhur from his father from Muhammad ibn Sinan from ‘Abd Allah ibn Sinan from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib (a.s.) has said, ‘If you come face to face with a beast say, ‘I seek protection with the Lord of Daniel and the well against the evil of all powerful lions.” Note: Daniel was thrown in a well with wild beasts but they did not harm him. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/440)"
        ],
        "index": 3417,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2223",
              "text": "مُحَمَّدُ بْنُ جَعْفَرٍ أَبُو الْعَبَّاسِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/321",
              "text": "صَالِحِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2224",
              "text": "إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ هَارُونَ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ جَعْفَرٍ أَبُو الْعَبَّاسِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ صَالِحِ بْنِ سَعِيدٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ هَارُونَ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:10",
        "text": [
          "هُ كَتَبَ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) يَسْأَلُهُ عُوذَةً لِلرِّيَاحِ الَّتِي تَعْرِضُ لِلصِّبْيَانِ فَكَتَبَ إِلَيْهِ بِخَطِّهِ بِهَاتَيْنِ الْعُوذَتَيْنِ وَ زَعَمَ صَالِحٌ أَنَّهُ أَنْفَذَهُمَا إِلَيَّ إِبْرَاهِيمُ بِخَطِّهِ ",
          "اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ وَ لَا رَبَّ لِي إِلَّا اللَّهُ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ لَا شَرِيكَ لَهُ سُبْحَانَ اللَّهِ مَا شَاءَ اللَّهُ كَانَ وَ مَا لَمْ يَشَأْ لَمْ يَكُنْ",
          "اللَّهُمَّ ذَا الْجَلَالِ وَ الْإِكْرَامِ رَبَّ مُوسَى وَ عِيسَى وَ إِبْرَاهِيمَ الَّذِي وَفَّى إِلَهَ إِبْرَاهِيمَ وَ إِسْمَاعِيلَ وَ إِسْحَاقَ وَ يَعْقُوبَ وَ الْأَسْبَاطِ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ مَعَ مَا عَدَّدْتَ مِنْ آيَاتِكَ وَ بِعَظَمَتِكَ وَ بِمَا سَأَلَكَ بِهِ النَّبِيُّونَ وَ بِأَنَّكَ رَبُّ النَّاسِ ",
          "كُنْتَ قَبْلَ كُلِّ شَيْ‏ءٍ وَ أَنْتَ بَعْدَ كُلِّ شَيْ‏ءٍ أَسْأَلُكَ بِاسْمِكَ الَّذِي تُمْسِكُ بِهِ السَّمَاوَاتِ أَنْ تَقَعَ عَلَى الْأَرْضِ إِلَّا بِإِذْنِكَ وَ بِكَلِمَاتِكَ التَّامَّاتِ الَّتِي تُحْيِي بِهِ الْمَوْتَى أَنْ تُجِيرَ عَبْدَكَ فُلَاناً مِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ وَ مَا يَعْرُجُ إِلَيْهَا وَ مَا يَخْرُجُ مِنَ الْأَرْضِ وَ مَا يَلِجُ فِيهَا وَ سَلَامٌ عَلَى الْمُرْسَلِينَ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
          "وَ كَتَبَ إِلَيْهِ أَيْضاً بِخَطِّهِ.",
          "بِسْمِ اللَّهِ وَ بِاللَّهِ وَ إِلَى اللَّهِ وَ كَمَا شَاءَ اللَّهُ وَ أُعِيذُهُ بِعِزَّةِ اللَّهِ وَ جَبَرُوتِ اللَّهِ وَ قُدْرَةِ اللَّهِ وَ مَلَكُوتِ اللَّهِ هَذَا الْكِتَابُ مِنَ اللَّهِ شِفَاءٌ لِفُلَانِ بْنِ فُلَانٍ ابْنِ عَبْدِكَ وَ ابْنِ أَمَتِكَ عَبْدَيِ اللَّهِ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ"
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ja’far Abu Al Abbas, from Muhammad Bin Isa, from Salih Bin Saeed, ",
            "(It has been narrated) from Ibrahim Bin Muhammad Bin Haroun that he wrote to Abu Ja’far<sup>asws</sup> asking him<sup>asws</sup> for an amulet for the winds which bother the children. So he<sup>asws</sup> wrote to him in his<sup>asws</sup> own handwriting with these two amulets, and Salih alleged that ‘These two were implemented by Ibrahim to me in his handwriting’: -",
            "Allah<sup>azwj</sup> is the Greatest! Allah<sup>azwj</sup> is the Greatest! Allah<sup>azwj</sup> is the Greatest! I testify that there is no God except Allah<sup>azwj</sup>. I testify that Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>. Allah<sup>azwj</sup> is the Greatest! There is no god except Allah<sup>azwj</sup> and there is no Lord<sup>azwj</sup> for me except Allah<sup>azwj</sup>. For Him<sup>azwj</sup> is the Kingdom and for Him<sup>azwj</sup> is the Praise. There is no associate for Him<sup>azwj</sup>. Glorious is Allah<sup>azwj</sup>. Whatever Allah<sup>azwj</sup> so Desires occurs, and whatever He<sup>azwj</sup> does not Desire, does not occur.",
            "O Allah<sup>azwj</sup>! One<sup>azwj</sup> with the Majesty and the Benevolence. Lord<sup>azwj</sup> of Musa<sup>as</sup>, and Isa<sup>as</sup>, and Ibrahim<sup>as</sup> who fulfilled it. God of Ibrahim<sup>as</sup>, and Ismail<sup>as</sup>, and Is’haq<sup>as</sup>, and Yaqoub<sup>as</sup> and the chiefs. There is no god except You<sup>azwj</sup>. Glory be to You<sup>azwj</sup> along with what You<sup>azwj</sup> Numbered from Your<sup>azwj</sup> Signs, and by Your<sup>azwj</sup> Magnificence, and with what You<sup>azwj</sup> were asked with by the Prophets<sup>as</sup>, and that You<sup>azwj</sup> are the Lord<sup>azwj</sup> of the people.",
            "You<sup>azwj</sup> were before everything, and You<sup>azwj</sup> will be after everything. I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Name Which the skies attach with from falling to the earth except by Your<sup>azwj</sup> Permission, and by the complete Words by which You<sup>azwj</sup> Revive the dead, that You<sup>azwj</sup> should Rescue Your<sup>azwj</sup> servant, so and so, from the evil of what descends from the sky, and that what raises to it, and what comes out from the ground, and what penetrates into it. And greetings be upon the <span class=\"iTxt\">Mursil</span> Prophets<sup>as</sup>, and the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’. ",
            "And he<sup>asws</sup> wrote to him as well in his<sup>asws</sup> own handwriting: ",
            "‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>, and to Allah<sup>azwj</sup>, and just as Allah<sup>azwj</sup> so Desires, and I seek Refuge with the Might of Allah<sup>azwj</sup>, and the Compulsion of Allah<sup>azwj</sup>, and the Power of Allah<sup>azwj</sup>, and the Kingdom of Allah<sup>azwj</sup>’. This writing is a Healing from Allah<sup>azwj</sup> for so and so, son of so and so, son of Your<sup>azwj</sup> servant and son of Your<sup>azwj</sup> maid, both servants of Allah<sup>azwj</sup>. May Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Ja’far abu al-‘Abbas has narrated from Muhammad ibn ‘Isa from Salih ibn Sa’id from Ibrahim ibn Muhammad ibn Harun who wrote to abu Ja’iar (a.s.) asking for a supplication for protection of children against bothering gasses: “The Imam wrote in his own hand writing the following supplications for protection and Salih thought that the Imam had sent them to Ibrahim: ‘Allah is greater than can be described, Allah is greater than can be described, Allah is greater than can be described. I testify that no one deserves to be worshipped except Allah. I testify that Muhammad is the Messenger of Allah. Allah is greater than can be described. Allah is greater than can be described. No one deserves to be worshipped except Allah. No one is my Lord, except Allah, to Him belongs the kingdom, all praise belongs to Him and He has no partner. Allah is free of all defects. As Allah willed it was, whatever He did not will did not come into being. O Lord, the Possessor of glory and magnanimity. Lord of Moses, Jesus and Ibrahim who fulfilled his duty, Lord of Ibrahim, Isma’il, Ishaq, Ya’qub and the tribes, no one deserves to be worshipped except You. I glorify You by means of Your signs that You have shown, by means of Your greatness, and by means of the facts with which the prophets pleaded before You for help that You are Lord of the people, that You were before everything and that You will be after everything, I plead before You through Your name with which You hold the skies from falling on earth except by Your permission, through Your perfect words with which You bring the dead to life, grant protection to Your servant so and so against the evil of whatever comes down from the sky and whatever goes up into the sky, whatever comes out of the earth and whatever enters into it, peace be with the messengers, all praise belongs to Allah, Lord of the worlds.’ “He also wrote in his own handwriting, ‘In the name of Allah, with (the help of) Allah, to Allah, and as Allah wills, I seek protection (from Allah) for him with the majesty of Allah, with the might of Allah, with the power of Allah, with the possession of Allah, this writing is cure from Allah for so and so, son of male and female, two servants of Allah, O Allah, bestow al- Salat (favors) upon Muhammad and his family.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/442)"
        ],
        "index": 3418,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/180",
              "text": "مُحَمَّدِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/586",
              "text": "عَلِيِّ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1700",
              "text": "عَبْدِ اللَّهِ بْنِ يَحْيَى الْكَاهِلِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى الْكَاهِلِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:11",
        "relations": {
          "Mentions": [
            "/books/quran:2:255"
          ]
        },
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا لَقِيتَ السَّبُعَ فَاقْرَأْ فِي وَجْهِهِ آيَةَ الْكُرْسِيِّ وَ قُلْ لَهُ عَزَمْتُ عَلَيْكَ بِعَزِيمَةِ اللَّهِ وَ عَزِيمَةِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ عَزِيمَةِ سُلَيْمَانَ بْنِ دَاوُدَ ( عليه السلام ) وَ عَزِيمَةِ أَمِيرِ الْمُؤْمِنِينَ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) وَ الْأَئِمَّةِ الطَّاهِرِينَ مِنْ بَعْدِهِ فَإِنَّهُ يَنْصَرِفُ عَنْكَ إِنْ شَاءَ اللَّهُ قَالَ فَخَرَجْتُ ",
          "فَإِذَا السَّبُعُ قَدِ اعْتَرَضَ فَعَزَمْتُ عَلَيْهِ وَ قُلْتُ لَهُ إِلَّا تَنَحَّيْتَ عَنْ طَرِيقِنَا وَ لَمْ تُؤْذِنَا قَالَ فَنَظَرْتُ إِلَيْهِ قَدْ طَأْطَأَ بِرَأْسِهِ وَ أَدْخَلَ ذَنَبَهُ بَيْنَ رِجْلَيْهِ وَ انْصَرَفَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ali, from Ali Bin Muhammad, from Abdullah Bin Yahya Al Kahily who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When you come across a predatory wild animal, so recite Ayat Al-Kursy <a href=\"/#/books/quran:2#h255\">[2:255]</a> in its face, and say to it: ‘I am determined against you by the Determination of Allah<sup>azwj</sup>, and determination of Muhammad<sup>saww</sup>, and determination of Suleyman Bin Dawood<sup>as</sup>, and determination of Amir Al-Momineen Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> and the Purified Imams<sup>asws</sup> from after him<sup>asws</sup>’, so it would be exchanged from him, Allah<sup>azwj</sup> Willing. ",
            "So a wild animal presented itself, so I was determined against it and said it to it so it step aside from our way and did not harm us. So I looked at it and it had bowed its head and entered its tail between its legs and left’."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Ali from Ali ibn Muhammad from ‘Abd Allah ibn Yahya al-Kahili who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Whenever you may come face to face with a wild beast, read verse 255 of Chapter 2 of the Holy Quran to its face and say, “I swear you by the oath of Allah, the oath of Muhammad (a.s.) the oath of Solomon son of David, the oath of Amir al-Mu’Mini, Ali ibn abu Talib and A ’immah, the clean ones (of all sins), after the Holy Prophet.” The beast will turn away from you by the will of Allah.’ I (the narrator) went out and a wild beast came face to face with me. I then swore it and said to it to turn and move out of the way without harming me. I looked at the beast, who had bent his head down, with the tail between the two legs and turned away.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/442)"
        ],
        "index": 3419,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/119",
              "text": "جَعْفَرِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/32",
              "text": "أَبِي الْجَارُودِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي الْجَارُودِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:12",
        "text": [
          " مَنْ قَالَ فِي دُبُرِ الْفَرِيضَةِ.",
          "أَسْتَوْدِعُ اللَّهَ الْعَظِيمَ الْجَلِيلَ نَفْسِي وَ أَهْلِي وَ وُلْدِي وَ مَنْ يَعْنِينِي أَمْرُهُ وَ أَسْتَوْدِعُ اللَّهَ الْمَرْهُوبَ الْمَخُوفَ الْمُتَضَعْضِعَ لِعَظَمَتِهِ كُلُّ شَيْ‏ءٍ نَفْسِي وَ أَهْلِي وَ مَالِي وَ وُلْدِي وَ مَنْ يَعْنِينِي أَمْرُهُ حُفَّ بِجَنَاحٍ مِنْ أَجْنِحَةِ جَبْرَئِيلَ ( عليه السلام ) وَ حُفِظَ فِي نَفْسِهِ وَ أَهْلِهِ وَ مَالِهِ"
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ja’far Bin Muhammad, from Yunus, from one of our companions, from Abu Al Jaroud, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who says at the end of the Obligatory (<span class=\"iTxt\">Salāt</span>), ",
            "‘I entrust to Allah<sup>azwj</sup> the Magnificent, myself, and my family, and my wealth, and the one whose matters are meaningful to me; and I entrust to Allah<sup>azwj</sup>, the One hoped to, the One feared to, the One broken to His<sup>azwj</sup> Determination, everything, myself, and my family, and my wealth, and my children, and the ones who matters are meaningful to me’, would be saved by a wing from the wings of Jibraeel<sup>as</sup>, and would be protected regarding himself, and his family, and his wealth’."
          ],
          "en.sarwar": [
            "12. It is narrated from him (narrator of the Hadith above) from la’ far ibn Muhammad from Yunus from certain individuals of our people from abu al- Jarud from abu ‘Abd Allah (a.s.) who has said the following: “Whoever, after an obligatory prayer, says, ‘Under the trust of Allah, the Great, the Most Glorious, I place myself, family, children and all those whose affairs concern me, under the trust of Allah, whose Greatness is awesome, frightful and unapproachable, I place myself, family, children and all those whose affairs concern me,’ he will be guarded under the wing of Jibril (Gabriel), his person, family and belongings will be protected.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/442)"
        ],
        "index": 3420,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "عَنْهُ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:13",
        "relations": {
          "Mentions": [
            "/books/quran:2:255"
          ]
        },
        "text": [
          " مَنْ بَاتَ فِي دَارٍ وَ بَيْتٍ وَحْدَهُ فَلْيَقْرَأْ آيَةَ الْكُرْسِيِّ وَ لْيَقُلِ ",
          "اللَّهُمَّ آنِسْ وَحْشَتِي وَ آمِنْ رَوْعَتِي وَ أَعِنِّي عَلَى وَحْدَتِي ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, raising it, ",
            "‘He<sup>asws</sup> said: ‘The one spends the night in a house and a room alone, so let him recited Ayat Al-Kursy <a href=\"/#/books/quran:2#h255\">[2:255]</a>, and let him say, ",
            "‘O Allah<sup>azwj</sup>! Comfort my loneliness, and Secure my awe, and Assist me upon my loneliness’’."
          ],
          "en.sarwar": [
            "13. It is narrated from him (narrator of the Hadith above) in a marfu ’ manner from the Imam (a.s.) who has said the following: “If one sleeps alone in a house he should read verse 255 of Chapter 2 of the Holy Quran and say, ‘O Lord, calm down my anxiety, change my concern into peace and assist me in my loneliness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/443)"
        ],
        "index": 3421,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/643",
              "text": "مُحَمَّدِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/202",
              "text": "أَحْمَدَ بْنِ النَّضْرِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/203",
              "text": "عَمْرِو بْنِ شِمْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2225",
              "text": "يَزِيدَ بْنِ مُرَّةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2226",
              "text": "بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ يَزِيدَ بْنِ مُرَّةَ عَنْ بُكَيْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:57:14",
        "text": [
          " سَمِعْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ قَالَ لِي رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا عَلِيُّ أَ لَا أُعَلِّمُكَ كَلِمَاتٍ إِذَا وَقَعْتَ فِي وَرْطَةٍ أَوْ بَلِيَّةٍ فَقُلْ.",
          "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَصْرِفُ بِهَا عَنْكَ مَا يَشَاءُ مِنْ أَنْوَاعِ الْبَلَاءِ"
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Salim, from Ahmad Bin Al Nazar, from Umro Bin Shimr, from Yazeed Bin Murra, from Bukeyr who said, ",
            "‘I heard Amir Al-Momineen<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> said to me: ‘O Ali<sup>asws</sup>! Shall<sup>saww</sup> let you<sup>asws</sup> know of certain words? Whenever you<sup>asws</sup> fall into a predicament or an affliction, so say: ",
            "‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful, and there is neither Might nor Strength except with Allah<sup>azwj</sup> the Exalted, the Magnificent’, for Allah<sup>azwj</sup> Mighty and Majestic would Exchange it from you<sup>asws</sup> by it, whatever He<sup>azwj</sup> so Desires from a variety of afflictions’."
          ],
          "en.sarwar": [
            "14. Abu Ali al-Ash’ari has narrated from Muhammad ibn Salim from Ahmad ibn al- Nadr from ‘Amr ibn Shimr from Yazid ibn Murrah from Bukayr who has said the following: “I heard Amir al-Mu’minin, Ali ibn abu Talib (a.s.) saying, ‘The Messenger of Allah once said to me, “O Ali I should instruct you with the words that you should say in a troublesome condition or a misfortune: ‘(I begin) in the name of Allah, the Beneficent, the Merciful. There are no means and no power without Allah, the Most High, the Most Great,’ Allah, the Most Majestic, the Most Holy, will divert away from you through these words, many kinds of misfortune as He wills.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:2:57",
  "kind": "verse_list"
}