{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 58"
        },
        "path": "/books/al-kafi:2:2:58",
        "titles": {
          "ar": "بَابُ الدُّعَاءِ عِنْدَ قِرَاءَةِ الْقُرْآنِ",
          "en": "Chapter 58 – The supplication during recitation of the Quran"
        }
      }
    ],
    "index": 455,
    "local_index": 58,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 59"
        },
        "path": "/books/al-kafi:2:2:59",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الدُّعَاءِ فِي</span> حِفْظِ الْقُرْآنِ",
          "en": "Chapter 59 – The supplication regarding the memorisation of the Quran"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 57"
        },
        "path": "/books/al-kafi:2:2:57",
        "titles": {
          "ar": "بَابُ الْحِرْزِ وَ الْعُوذَةِ",
          "en": "Chapter 57 – The protection and the seeking Refuge"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:2:2",
        "titles": {
          "ar": "كِتَابُ الدُّعَاءِ",
          "en": "THE BOOK OF SUPPLICATION"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:2:58",
    "titles": {
      "ar": "بَابُ الدُّعَاءِ عِنْدَ قِرَاءَةِ الْقُرْآنِ",
      "en": "Chapter 58 – The supplication during recitation of the Quran"
    },
    "verse_count": 1,
    "verse_start_index": 3421,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 3422,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2227",
              "text": "قَالَ كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": ""
            }
          ],
          "text": "قَالَ كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام )"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:2:58:1",
        "text": [
          " يَدْعُو عِنْدَ قِرَاءَةِ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ ",
          "اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ أَنْتَ الْمُتَوَحِّدُ بِالْقُدْرَةِ وَ السُّلْطَانِ الْمَتِينِ وَ لَكَ الْحَمْدُ أَنْتَ الْمُتَعَالِي بِالْعِزِّ وَ الْكِبْرِيَاءِ وَ فَوْقَ السَّمَاوَاتِ وَ الْعَرْشِ الْعَظِيمِ رَبَّنَا",
          "وَ لَكَ الْحَمْدُ أَنْتَ الْمُكْتَفِي بِعِلْمِكَ وَ الْمُحْتَاجُ إِلَيْكَ كُلُّ ذِي عِلْمٍ رَبَّنَا وَ لَكَ الْحَمْدُ يَا مُنْزِلَ الْآيَاتِ وَ الذِّكْرِ الْعَظِيمِ رَبَّنَا فَلَكَ الْحَمْدُ بِمَا عَلَّمْتَنَا مِنَ الْحِكْمَةِ وَ الْقُرْآنِ الْعَظِيمِ الْمُبِينِ اللَّهُمَّ أَنْتَ عَلَّمْتَنَاهُ قَبْلَ رَغْبَتِنَا فِي تَعَلُّمِهِ وَ اخْتَصَصْتَنَا بِهِ قَبْلَ رَغْبَتِنَا بِنَفْعِهِ ",
          "اللَّهُمَّ فَإِذَا كَانَ ذَلِكَ مَنّاً مِنْكَ وَ فَضْلًا وَ جُوداً وَ لُطْفاً بِنَا وَ رَحْمَةً لَنَا وَ امْتِنَاناً عَلَيْنَا مِنْ غَيْرِ حَوْلِنَا وَ لَا حِيلَتِنَا وَ لَا قُوَّتِنَا اللَّهُمَّ فَحَبِّبْ إِلَيْنَا حُسْنَ تِلَاوَتِهِ وَ حِفْظَ آيَاتِهِ وَ إِيمَاناً بِمُتَشَابِهِهِ وَ عَمَلًا بِمُحْكَمِهِ وَ سَبَباً فِي تَأْوِيلِهِ وَ هُدًى فِي تَدْبِيرِهِ وَ بَصِيرَةً بِنُورِهِ",
          "اللَّهُمَّ وَ كَمَا أَنْزَلْتَهُ شِفَاءً لِأَوْلِيَائِكَ وَ شَقَاءً عَلَى أَعْدَائِكَ وَ عَمًى عَلَى أَهْلِ مَعْصِيَتِكَ وَ نُوراً لِأَهْلِ طَاعَتِكَ اللَّهُمَّ فَاجْعَلْهُ لَنَا حِصْناً مِنْ عَذَابِكَ وَ حِرْزاً مِنْ غَضَبِكَ وَ حَاجِزاً عَنْ مَعْصِيَتِكَ وَ عِصْمَةً مِنْ سَخَطِكَ وَ دَلِيلًا عَلَى طَاعَتِكَ وَ نُوراً يَوْمَ نَلْقَاكَ نَسْتَضِي‏ءُ بِهِ فِي خَلْقِكَ وَ نَجُوزُ بِهِ عَلَى صِرَاطِكَ وَ نَهْتَدِي بِهِ إِلَى جَنَّتِكَ",
          "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنَ الشِّقْوَةِ فِي حَمْلِهِ وَ الْعَمَى عَنْ عَمَلِهِ وَ الْجَوْرِ عَنْ حُكْمِهِ وَ الْعُلُوِّ عَنْ قَصْدِهِ وَ التَّقْصِيرِ دُونَ حَقِّهِ اللَّهُمَّ احْمِلْ عَنَّا ثِقْلَهُ وَ أَوْجِبْ لَنَا أَجْرَهُ وَ أَوْزِعْنَا شُكْرَهُ وَ اجْعَلْنَا نُرَاعِيهِ وَ نَحْفَظُهُ",
          "اللَّهُمَّ اجْعَلْنَا نَتَّبِعُ حَلَالَهُ وَ نَجْتَنِبُ حَرَامَهُ وَ نُقِيمُ حُدُودَهُ وَ نُؤَدِّي فَرَائِضَهُ اللَّهُمَّ ارْزُقْنَا حَلَاوَةً فِي تِلَاوَتِهِ وَ نَشَاطاً فِي قِيَامِهِ وَ وَجِلًا فِي تَرْتِيلِهِ وَ قُوَّةً فِي اسْتِعْمَالِهِ فِي آنَاءِ اللَّيْلِ وَ أَطْرَافِ النَّهَارِ اللَّهُمَّ وَ اشْفِنَا مِنَ النَّوْمِ بِالْيَسِيرِ وَ أَيْقِظْنَا فِي سَاعَةِ اللَّيْلِ مِنْ رُقَادِ الرَّاقِدِينَ وَ نَبِّهْنَا عِنْدَ الْأَحَايِينِ الَّتِي يُسْتَجَابُ فِيهَا الدُّعَاءُ مِنْ سِنَةِ الْوَسْنَانِينَ ",
          "اللَّهُمَّ اجْعَلْ لِقُلُوبِنَا ذَكَاءً عِنْدَ عَجَائِبِهِ الَّتِي لَا تَنْقَضِي وَ لَذَاذَةً عِنْدَ تَرْدِيدِهِ وَ عِبْرَةً عِنْدَ تَرْجِيعِهِ وَ نَفْعاً بَيِّناً عِنْدَ اسْتِفْهَامِهِ اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ تَخَلُّفِهِ فِي قُلُوبِنَا وَ تَوَسُّدِهِ عِنْدَ رُقَادِنَا وَ نَبْذِهِ وَرَاءَ ظُهُورِنَا وَ نَعُوذُ بِكَ مِنْ قَسَاوَةِ قُلُوبِنَا لِمَا بِهِ وَعَظْتَنَا",
          "اللَّهُمَّ انْفَعْنَا بِمَا صَرَفْتَ فِيهِ مِنَ الْآيَاتِ وَ ذَكِّرْنَا بِمَا ضَرَبْتَ فِيهِ مِنَ الْمَثُلَاتِ وَ كَفِّرْ عَنَّا بِتَأْوِيلِهِ السَّيِّئَاتِ وَ ضَاعِفْ لَنَا بِهِ جَزَاءً فِي الْحَسَنَاتِ وَ ارْفَعْنَا بِهِ ثَوَاباً فِي الدَّرَجَاتِ وَ لَقِّنَا بِهِ الْبُشْرَى بَعْدَ الْمَمَاتِ",
          "اللَّهُمَّ اجْعَلْهُ لَنَا زَاداً تُقَوِّينَا بِهِ فِي الْمَوْقِفِ بَيْنَ يَدَيْكَ وَ طَرِيقاً وَاضِحاً نَسْلُكُ بِهِ إِلَيْكَ وَ عِلْماً نَافِعاً نَشْكُرُ بِهِ نَعْمَاءَكَ وَ تَخَشُّعاً صَادِقاً نُسَبِّحُ بِهِ أَسْمَاءَكَ فَإِنَّكَ اتَّخَذْتَ بِهِ عَلَيْنَا حُجَّةً قَطَعْتَ بِهِ عُذْرَنَا وَ اصْطَنَعْتَ بِهِ عِنْدَنَا نِعْمَةً قَصَرَ عَنْهَا شُكْرُنَا اللَّهُمَّ اجْعَلْهُ لَنَا وَلِيّاً يُثَبِّتُنَا مِنَ الزَّلَلِ وَ دَلِيلًا يَهْدِينَا لِصَالِحِ الْعَمَلِ وَ عَوْناً هَادِياً يُقَوِّمُنَا مِنَ الْمَيْلِ وَ عَوْناً يُقَوِّينَا مِنَ الْمَلَلِ حَتَّى يَبْلُغَ بِنَا أَفْضَلَ الْأَمَلِ ",
          "اللَّهُمَّ اجْعَلْهُ لَنَا شَافِعاً يَوْمَ اللِّقَاءِ وَ سِلَاحاً يَوْمَ الِارْتِقَاءِ وَ حَجِيجاً يَوْمَ الْقَضَاءِ وَ نُوراً يَوْمَ الظَّلْمَاءِ يَوْمَ لَا أَرْضَ وَ لَا سَمَاءَ يَوْمَ يُجْزَى كُلُّ سَاعٍ بِمَا سَعَى",
          "اللَّهُمَّ اجْعَلْهُ لَنَا رَيّاً يَوْمَ الظَّمَإِ وَ فَوْزاً يَوْمَ الْجَزَاءِ مِنْ نَارٍ حَامِيَةٍ قَلِيلَةِ الْبُقْيَا عَلَى مَنْ بِهَا اصْطَلَى وَ بِحَرِّهَا تَلَظَّى اللَّهُمَّ اجْعَلْهُ لَنَا بُرْهَاناً عَلَى رُءُوسِ الْمَلَإِ يَوْمَ يُجْمَعُ فِيهِ أَهْلُ الْأَرْضِ وَ أَهْلُ السَّمَاءِ اللَّهُمَّ ارْزُقْنَا مَنَازِلَ الشُّهَدَاءِ وَ عَيْشَ السُّعَدَاءِ وَ مُرَافَقَةَ الْأَنْبِيَاءِ إِنَّكَ سَمِيعُ الدُّعَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "He (the narrator) said, ",
            "‘It was so that Abu Abdullah<sup>asws</sup> would supplicate during the recitation of the Book of Allah<sup>azwj</sup> Mighty and Majestic: ",
            "‘O Allah<sup>azwj</sup>! Our Lord<sup>azwj</sup>! For You<sup>azwj</sup> is the Praise. You<sup>azwj</sup> are the only One with the Power and the Strong Authority, and for You<sup>azwj</sup> is the Praise. You<sup>azwj</sup> are Exalted with the Might and the Greatness, and above the skies and the Magnificent Throne. ",
            "And for You<sup>azwj</sup> is the Praise. You<sup>azwj</sup> are the Sufficer with Your<sup>azwj</sup> Knowledge and needy to You<sup>azwj</sup> es everyone with knowledge. Our Lord<sup>azwj</sup>! And for You<sup>azwj</sup> is the Praise, O Revealer of the Verses and the Magnificent Reminder. Our Lord<sup>azwj</sup>! So, for You<sup>azwj</sup> is the Praise with what You<sup>azwj</sup> Taught us<sup>asws</sup> from the Wisdom, and the Magnificent Quran, the Evident. You<sup>azwj</sup> Taught us<sup>asws</sup> before we wished to be in its teaching, and You<sup>azwj</sup> Specialised us<sup>asws</sup> with it before we wished to be benefited by it.",
            "O Allah<sup>azwj</sup>! So when it was that from us<sup>asws</sup>, from You<sup>azwj</sup>, and Preference, and Generosity, and Kindness with us<sup>asws</sup>, and Mercy for us<sup>asws</sup>, and Gratitude upon us<sup>asws</sup> from without any might for us<sup>asws</sup>. Nor a strategy for us<sup>asws</sup>, nor any strength of ours<sup>asws</sup>. O Allah<sup>azwj</sup>! Therefore, Bestow to us the excellent recitation of it, and the memorisation of its Verses, and <span class=\"iTxt\">Eman</span> its Allegorical (Verses), and acting upon its Decisive (Verses), and reasoning in its interpretation, and Guidance in its arrangement, and insight into its Light.",
            "O Allah<sup>azwj</sup>! And it is as if You<sup>azwj</sup> have Revealed it as a Healing to Your<sup>azwj</sup> friends, and a misery to Your<sup>azwj</sup> enemies, and a blindness upon the people disobedient to You<sup>azwj</sup>, and a Light for the people obedient to You<sup>azwj</sup>. O Allah<sup>azwj</sup>! So Make it to be a fortress for us<sup>asws</sup> from Your<sup>azwj</sup> Punishment and a Protection from Your<sup>azwj</sup> Wrath, and Barrier from disobeying You<sup>azwj</sup>, and a Preservation from Your<sup>azwj</sup> Harshness, and a Pointer towards obeying You<sup>azwj</sup>, and a Light on the Day we<sup>asws</sup> meet You<sup>azwj</sup> we<sup>asws</sup> can shine with among Your<sup>azwj</sup> creatures, and we<sup>asws</sup> can cross by it upon Your<sup>azwj</sup> Bridge, and we<sup>asws</sup> can be Guided with to Your<sup>azwj</sup> Paradise.",
            "O Allah<sup>azwj</sup>! We<sup>asws</sup> seek Refuge by it from the misfortune in bearing it, and the blindness from its actions, and the tyranny from its decision, and higher from its Meanings and being deficient below its rights. O Allah<sup>azwj</sup>! Unload its weight from us<sup>asws</sup> and Obligate its Recompense for us<sup>asws</sup>, and Apportion is gratefulness upon us<sup>asws</sup>, and Make us<sup>asws</sup> to be its caretakers and its preservers. ",
            "O Allah<sup>azwj</sup>! Make us<sup>asws</sup> to follow its Permissible and keep aloof from its Prohibitions, and establish its Limits, and fulfil its Impositions. O Allah<sup>azwj</sup>! Grace us<sup>asws</sup> its sweetness during its recitation, and vigour in establishing it, and respect in reading it slowly, and strength in utilizing it at night and the two ends of the day. O Allah<sup>azwj</sup>! And Comfort us<sup>asws</sup> with the little sleep, and Wake us<sup>asws</sup> up during a time of the night from the sleep of the sleeping ones, and Wake us<sup>asws</sup> during the events in which the supplications are Answered from the slumber of the ones in slumber.",
            "O Allah<sup>azwj</sup>! Make intelligence to be for our<sup>asws</sup> hearts during its (Holy Quran’s) wonderments which do not expire, and pleasures during its repeating, and lessons during its reviews, and clear benefits during its understanding. O Allah<sup>azwj</sup>! We<sup>asws</sup> seek Refuge with You<sup>azwj</sup> from opposing it in our<sup>asws</sup> hearts, and neglecting it during our<sup>asws</sup> sleep and throwing it behind our<sup>asws</sup> backs. And we<sup>asws</sup> seek Refuge from the harshness of our<sup>asws</sup> hearts when it is Advised to us<sup>asws</sup> with it. ",
            "O Allah<sup>azwj</sup>! Benefit us<sup>asws</sup> with what You<sup>azwj</sup> Served in it from the Verses and Mentioned us<sup>asws</sup> with what You<sup>azwj</sup> Struck in it from the examples, and Expiated the evil deeds (of our<sup>asws</sup> Shias) from us<sup>asws</sup> by its interpretation, and Multiplied for us<sup>asws</sup> by it the Recompense regarding the good deeds, and Raised the Rewards by us<sup>asws</sup> by it in the Levels, and Made us<sup>asws</sup> face glad tidings after the deaths.",
            "O Allah<sup>azwj</sup>! Make it (Holy Quran) to be an increase in our<sup>asws</sup> strength by it during the pausing in front of You<sup>azwj</sup> and a clear way we<sup>asws</sup> can travel by towards You<sup>azwj</sup>, and a beneficial knowledge we<sup>asws</sup> can be grateful with for You<sup>azwj</sup> Bounties, and Makes us<sup>asws</sup> to be humble, truthful, we<sup>asws</sup> can Glorify Your<sup>azwj</sup> Name with, for You<sup>azwj</sup> will be Taking it as an Argument upon us<sup>asws</sup>, Cutting-off our<sup>asws</sup> excuses by it, and Loaded it with us<sup>asws</sup> such Bounties that we<sup>asws</sup> are deficient in thanking for it. O Allah<sup>azwj</sup>! Make it to be a friend for us<sup>asws</sup> affirming us<sup>asws</sup> from wavering, and a pointer guiding us<sup>asws</sup> to the righteous deeds, and an aiding guide strengthening us<sup>asws</sup> from other religions, and aiding us<sup>asws</sup> from the fatigue, until it reaches with us<sup>asws</sup> the best deeds.",
            "O Allah<sup>azwj</sup>! Make it to be a healing for us<sup>asws</sup> on the Day of the Meeting and a weapon on the Day of Raising (of matters), and an argument on the Day of the Judgments, and a Light on the Day of the darkness there being neither an earth nor a sky, the Day every strivers would be Sufficed for what he strove for. ",
            "O Allah<sup>azwj</sup>! Make it (Holy Quran) to be a quenching for us<sup>asws</sup> on the Day of thirst, and a success on the Day of the Recompense from the Blazing Fire, giving little survival upon the ones who are with it, uprooting by its oceans of fire. O Allah<sup>azwj</sup>! Make it to be a Proof for us<sup>asws</sup> against the chiefs of the nations on the Day in which would be gathered the inhabitants of the earth and the inhabitants of the sky. O Allah<sup>azwj</sup>! Grace us<sup>asws</sup> the status of the martyrs and a life of happiness, and the friendship of the Prophets<sup>as</sup>. You<sup>azwj</sup> are the Hearer of the supplications’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:2:58",
  "kind": "verse_list"
}