{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:2:2", "titles": {"ar": "كِتَابُ الدُّعَاءِ", "en": "THE BOOK OF SUPPLICATION"}}, {"indexed_titles": {"en": "Chapter 59"}, "path": "/books/al-kafi:2:2:59", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الدُّعَاءِ فِي</span> حِفْظِ الْقُرْآنِ", "en": "Chapter 59 – The supplication regarding the memorisation of the Quran"}}], "index": 456, "local_index": 59, "part_type": "Chapter", "path": "/books/al-kafi:2:2:59", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الدُّعَاءِ فِي</span> حِفْظِ الْقُرْآنِ", "en": "Chapter 59 – The supplication regarding the memorisation of the Quran"}, "verse_count": 2, "verse_start_index": 3422, "verses": [{"index": 3423, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:2:59:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَمَّنْ ذَكَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ وَ لَمْ يَسْأَلِ الْعِبَادُ مِثْلَكَ أَسْأَلُكَ بِحَقِّ مُحَمَّدٍ نَبِيِّكَ وَ رَسُولِكَ وَ إِبْرَاهِيمَ خَلِيلِكَ وَ صَفِيِّكَ وَ مُوسَى كَلِيمِكَ وَ نَجِيِّكَ وَ عِيسَى كَلِمَتِكَ وَ رُوحِكَ\nوَ أَسْأَلُكَ بِصُحُفِ إِبْرَاهِيمَ وَ تَوْرَاةِ مُوسَى وَ زَبُورِ دَاوُدَ وَ إِنْجِيلِ عِيسَى وَ قُرْآنِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ بِكُلِّ وَحْيٍ أَوْحَيْتَهُ وَ قَضَاءٍ أَمْضَيْتَهُ وَ حَقٍّ قَضَيْتَهُ وَ غَنِيٍّ أَغْنَيْتَهُ وَ ضَالٍّ هَدَيْتَهُ وَ سَائِلٍ أَعْطَيْتَهُ\nوَ أَسْأَلُكَ بِاسْمِكَ الَّذِي وَضَعْتَهُ عَلَى اللَّيْلِ فَأَظْلَمَ وَ بِاسْمِكَ الَّذِي وَضَعْتَهُ عَلَى النَّهَارِ فَاسْتَنَارَ وَ بِاسْمِكَ الَّذِي وَضَعْتَهُ عَلَى الْأَرْضِ فَاسْتَقَرَّتْ وَ دَعَمْتَ بِهِ السَّمَاوَاتِ فَاسْتَقَلَّتْ وَ وَضَعْتَهُ عَلَى الْجِبَالِ فَرَسَتْ\nوَ بِاسْمِكَ الَّذِي بَثَثْتَ بِهِ الْأَرْزَاقَ وَ أَسْأَلُكَ بِاسْمِكَ الَّذِي تُحْيِي بِهِ الْمَوْتَى وَ أَسْأَلُكَ بِمَعَاقِدِ الْعِزِّ مِنْ عَرْشِكَ وَ مُنْتَهَى الرَّحْمَةِ مِنْ كِتَابِكَ\nأَسْأَلُكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَنْ تَرْزُقَنِي حِفْظَ الْقُرْآنِ وَ أَصْنَافَ الْعِلْمِ وَ أَنْ تُثَبِّتَهَا فِي قَلْبِي وَ سَمْعِي وَ بَصَرِي وَ أَنْ تُخَالِطَ بِهَا لَحْمِي وَ دَمِي وَ عِظَامِي وَ مُخِّي وَ تَسْتَعْمِلَ بِهَا لَيْلِي وَ نَهَارِي بِرَحْمَتِكَ وَ قُدْرَتِكَ فَإِنَّهُ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِكَ يَا حَيُّ يَا قَيُّومُ \nقَالَ وَ فِي حَدِيثٍ آخَرَ زِيَادَةُ \nوَ أَسْأَلُكَ بِاسْمِكَ الَّذِي دَعَاكَ بِهِ عِبَادُكَ الَّذِينَ اسْتَجَبْتَ لَهُمْ وَ أَنْبِيَاؤُكَ فَغَفَرْتَ لَهُمْ وَ رَحِمْتَهُمْ \nوَ أَسْأَلُكَ بِكُلِّ اسْمٍ أَنْزَلْتَهُ فِي كُتُبِكَ وَ بِاسْمِكَ الَّذِي اسْتَقَرَّ بِهِ عَرْشُكَ وَ بِاسْمِكَ الْوَاحِدِ الْأَحَدِ الْفَرْدِ الْوَتْرِ الْمُتَعَالِ الَّذِي يَمْلَأُ الْأَرْكَانَ كُلَّهَا الطَّاهِرِ الطُّهْرِ الْمُبَارَكِ الْمُقَدَّسِ الْحَيِّ الْقَيُّومِ نُورِ السَّمَاوَاتِ وَ الْأَرْضِ الرَّحْمَنِ الرَّحِيمِ الْكَبِيرِ الْمُتَعَالِ وَ كِتَابِكَ الْمُنْزَلِ بِالْحَقِّ وَ كَلِمَاتِكَ التَّامَّاتِ وَ نُورِكَ التَّامِّ وَ بِعَظَمَتِكَ وَ أَرْكَانِكَ .\nوَ قَالَ فِي حَدِيثٍ آخَرَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَرَادَ أَنْ يُوعِيَهُ اللَّهُ عَزَّ وَ جَلَّ الْقُرْآنَ وَ الْعِلْمَ فَلْيَكْتُبْ هَذَا الدُّعَاءَ فِي إِنَاءٍ نَظِيفٍ بِعَسَلٍ مَاذِيٍّ ثُمَّ يَغْسِلُهُ بِمَاءِ الْمَطَرِ قَبْلَ أَنْ يَمَسَّ الْأَرْضَ وَ يَشْرَبُهُ ثَلَاثَةَ أَيَّامٍ عَلَى الرِّيقِ فَإِنَّهُ يَحْفَظُ ذَلِكَ إِنْ شَاءَ اللَّهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from the one who mentioned it, from Abu Abdullah Bin Sinan, from Aban Bin Taghlib, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You should be saying, ‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> and do not ask the servants like I ask You<sup>azwj</sup>. I ask You<sup>azwj</sup> by the right of Muhammad<sup>saww</sup> Your<sup>saww</sup> Prophet<sup>saww</sup> and Your<sup>azwj</sup> Rasool<sup>saww</sup>, and Ibrahim<sup>as</sup> Your<sup>azwj</sup> friend and Your<sup>azwj</sup> elite, and Musa<sup>as</sup> Your<sup>azwj</sup> speaker and Your<sup>azwj</sup> whisperer, and Isa<sup>as</sup> Your<sup>azwj</sup> Word and Your<sup>azwj</sup> Spirit.\nAnd I ask You<sup>azwj</sup> by the Parchments of Ibrahim<sup>as</sup>, and the Torah of Musa<sup>as</sup>, and the Psalms of Dawood<sup>as</sup>, and the Evangel of Isa<sup>as</sup>, and Quran of Muhammad<sup>saww</sup>, and by every Revelation You<sup>azwj</sup> Revealed, and every Judgment You<sup>azwj</sup> Passed, and right You<sup>azwj</sup> Fulfilled, and rich one You<sup>azwj</sup> Enriched, and straying one You<sup>azwj</sup> Guided, and begging one You<sup>azwj</sup> Gave to. \nAnd I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Name which You<sup>azwj</sup> Placed upon the night, so it turned dark, and by Your<sup>azwj</sup> Name which You<sup>azwj</sup> Placed upon the day so it shone, and by Your<sup>azwj</sup> Name which You<sup>azwj</sup> Placed upon the earth so it settled and the skies were underpinned by it so (became) upheld, and Placed it upon the mountains, so were anchored. \nAnd by Your<sup>azwj</sup> Name by which the sustenance are Sent with, and I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Name by which the dead are revived with, and I ask You<sup>azwj</sup> by the Bond of the Might from Your<sup>azwj</sup> Throne and the limit of the Mercy from Your<sup>azwj</sup> Book. \nI ask You<sup>azwj</sup> that You<sup>azwj</sup> should Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> and that You<sup>azwj</sup> should Grace me the memorisation of the Quran, and the varieties of the knowledge, and that You<sup>azwj</sup> affirm it in my<sup>asws</sup> heart and my<sup>asws</sup> hearing and my sight, and that You<sup>azwj</sup> mingle it with my<sup>asws</sup> flesh and my<sup>asws</sup> blood and my<sup>asws</sup> bones and my<sup>asws</sup> brain, and that You<sup>azwj</sup> Utilise by it my<sup>asws</sup> night and my<sup>asws</sup> day by Your<sup>azwj</sup> Mercy and Your<sup>azwj</sup> Power, for there is neither Might nor Strength except with You<sup>azwj</sup>. O Living! O Eternal!’\nHe (the narrator) said, ‘And in another Hadeeth there is more: -\n‘And I<sup>asws</sup> ask You<sup>azwj</sup> by Your<sup>azwj</sup> Name by which Your<sup>azwj</sup> servants supplicate with so it is Answered for them, and Your<sup>azwj</sup> Prophets, so it is Forgiven for them<sup>as</sup> and there is Mercy upon them<sup>as</sup>.\nAnd I<sup>asws</sup> ask You<sup>azwj</sup> by every Name You<sup>azwj</sup> Revealed in Your<sup>azwj</sup> Book, and by Your<sup>azwj</sup> Name which Your<sup>azwj</sup> Throne is stabilized, and by Your<sup>azwj</sup> Name, the Single, the One, the Individual, the Solitary, the Exalted which Fills up the corners, all of them, the Immaculate, the Clean, the Blessed, the Holy, the Living, the Eternal, Light of the skies and the earth, the Beneficent, the Merciful, the Greatest, and Exalted, and Your<sup>azwj</sup> Revealed Book with the Truth, and the Perfect Words of Yours<sup>azwj</sup>, and Your<sup>azwj</sup> Perfect Light, and by Your<sup>azwj</sup> Magnificence and Your<sup>azwj</sup> Elements’. \nAnd he<sup>asws</sup> said in another Hadeeth: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who wants Allah<sup>azwj</sup> Mighty and Majestic should Cause him to retain (memorise) the Quran and the Knowledge, so let him write this supplication in a clean container with white honey, then wash it with rain water before it touches the ground, and drink it for three days upon the empty stomach, for it would make him memorise that, Allah<sup>azwj</sup> Willing’."}]}, {"index": 3424, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:2:59:2", "text": "عَنْهُ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى رَفَعَهُ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أُعَلِّمُكَ دُعَاءً لَا تَنْسَى الْقُرْآنَ اللَّهُمَّ ارْحَمْنِي بِتَرْكِ مَعَاصِيكَ أَبَداً مَا أَبْقَيْتَنِي وَ ارْحَمْنِي مِنْ تَكَلُّفِ مَا لَا يَعْنِينِي وَ ارْزُقْنِي حُسْنَ الْمَنْظَرِ فِيمَا يُرْضِيكَ عَنِّي وَ أَلْزِمْ قَلْبِي حِفْظَ كِتَابِكَ كَمَا عَلَّمْتَنِي وَ ارْزُقْنِي أَنْ أَتْلُوَهُ عَلَى النَّحْوِ الَّذِي يُرْضِيكَ عَنِّي \nاللَّهُمَّ نَوِّرْ بِكِتَابِكَ بَصَرِي وَ اشْرَحْ بِهِ صَدْرِي وَ فَرِّحْ بِهِ قَلْبِي وَ أَطْلِقْ بِهِ لِسَانِي وَ اسْتَعْمِلْ بِهِ بَدَنِي وَ قَوِّنِي عَلَى ذَلِكَ وَ أَعِنِّي عَلَيْهِ إِنَّهُ لَا مُعِينَ عَلَيْهِ إِلَّا أَنْتَ لَا إِلَهَ إِلَّا أَنْتَ .\nقَالَ وَ رَوَاهُ بَعْضُ أَصْحَابِنَا عَنْ وَلِيدِ بْنِ صَبِيحٍ عَنْ حَفْصٍ الْأَعْوَرِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ).", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from his father, from Hammad Bin Isa, \n(It has been narrated) raising it to Amir Al-Momineen<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘I<sup>saww</sup> shall teach you a supplication, (by which) you will not forget the Quran, ‘O Allah<sup>azwj</sup>! Have Mercy on me so I neglect disobeying You<sup>azwj</sup> for ever what it my remaining (life), and have Mercy on me from encumbering what is not befitting for me, and Grace me the good scenery in what would Please You<sup>azwj</sup> from me, and Impose the memorisation of Your<sup>azwj</sup> Book in my heart just as You<sup>azwj</sup> Taught me and Graced me that I recite it upon as which would Please You<sup>azwj</sup> from me. \nO Allah<sup style=\"font-weight: normal\">azwj</sup>! Illuminate my vision by Your<sup style=\"font-weight: normal\">azwj</sup> Book and Expand my chest by it, and Cause my heart to be happy with it, and Loosen my tongue by it, and Utilise my body by it, and Strengthen me upon that, and Assist me upon it, (for) there is no Aider upon it except You<sup style=\"font-weight: normal\">azwj</sup>. There is no god except You<sup style=\"font-weight: normal\">azwj</sup>’’. \nHe (the narrator) said, ‘Some of our companions have reported from Waleed Bin Sabeeh, from Hafs Al-Awr, from Abu Abdullah<sup>asws</sup>’."}]}]}, "index": "al-kafi:2:2:59", "kind": "verse_list"}