{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:2:2", "titles": {"ar": "كِتَابُ الدُّعَاءِ", "en": "THE BOOK OF SUPPLICATION"}}, {"indexed_titles": {"en": "Chapter 60"}, "path": "/books/al-kafi:2:2:60", "titles": {"ar": "بَابُ دَعَوَاتٍ مُوجَزَاتٍ لِجَمِيعِ الْحَوَائِجِ لِلدُّنْيَا وَ الْآخِرَةِ", "en": "Chapter 60 – Brief supplications for the entirety of the needs of the world and the Hereafter"}}], "index": 457, "local_index": 60, "part_type": "Chapter", "path": "/books/al-kafi:2:2:60", "titles": {"ar": "بَابُ دَعَوَاتٍ مُوجَزَاتٍ لِجَمِيعِ الْحَوَائِجِ لِلدُّنْيَا وَ الْآخِرَةِ", "en": "Chapter 60 – Brief supplications for the entirety of the needs of the world and the Hereafter"}, "verse_count": 35, "verse_start_index": 3424, "verses": [{"index": 3425, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ إِسْمَاعِيلَ بْنِ سَهْلٍ عَنْ عَبْدِ اللَّهِ بْنِ جُنْدَبٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلِ اللَّهُمَّ اجْعَلْنِي أَخْشَاكَ كَأَنِّي أَرَاكَ وَ أَسْعِدْنِي بِتَقْوَاكَ وَ لَا تُشْقِنِي بِنَشْطِي لِمَعَاصِيكَ وَ خِرْ لِي فِي قَضَائِكَ وَ بَارِكْ لِي فِي قَدَرِكَ حَتَّى لَا أُحِبَّ تَأْخِيرَ مَا عَجَّلْتَ وَ لَا تَعْجِيلَ مَا أَخَّرْتَ وَ اجْعَلْ غِنَايَ فِي نَفْسِي وَ مَتِّعْنِي بِسَمْعِي وَ بَصَرِي وَ اجْعَلْهُمَا الْوَارِثَيْنِ مِنِّي وَ انْصُرْنِي عَلَى مَنْ ظَلَمَنِي وَ أَرِنِي فِيهِ قُدْرَتَكَ يَا رَبِّ وَ أَقِرَّ بِذَلِكَ عَيْنِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ismail Bin Sahl, from Abdullah Bin Jundab, from his father, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Say, ‘O Allah<sup>azwj</sup>! Make me to fear You<sup>azwj</sup> as if I can see You<sup>azwj</sup>, and Assist me with being pious to You<sup>azwj</sup>, and do not Cause me to be miserable by my practicing to disobeying You<sup>azwj</sup>, and Choose for me in Your<sup>azwj</sup> Judgment, and Bless for me in Your<sup>azwj</sup> Ordainment until I do not love the delay of what You<sup>azwj</sup> Hasten nor hastening of what You<sup>azwj</sup> Delay; and Make self-sufficiency in myself, and Cause me to enjoy with my hearing and my vision, and Make them both as the inheritors from me, and Help me against the ones who oppress me, and Show me Your<sup>azwj</sup> Power in it, O Lord<sup>azwj</sup>, and my eyes to be delighted with that’’."}]}, {"index": 3426, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:2", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي سُلَيْمَانَ الْجَصَّاصِ عَنْ إِبْرَاهِيمَ بْنِ مَيْمُونٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ اللَّهُمَّ أَعِنِّي عَلَى هَوْلِ يَوْمِ الْقِيَامَةِ وَ أَخْرِجْنِي مِنَ الدُّنْيَا سَالِماً وَ زَوِّجْنِي مِنَ الْحُورِ الْعِينِ وَ اكْفِنِي مَئُونَتِي وَ مَئُونَةَ عِيَالِي وَ مَئُونَةَ النَّاسِ وَ أَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abu Suleyman Al Jassas, from Ibrahim Bin Maymoun who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘O Allah<sup>azwj</sup>! Assist me upon the terror of the Day of Judgment and Extract me safely from the world, and Pair me with the Maiden Houries, and Suffice me for my livelihood and the livelihood of my dependants, and livelihood of the people, and by Your<sup>azwj</sup> Mercy Enter me to be among the righteous servants’’."}]}, {"index": 3427, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ أَحَاطَ بِهِ عِلْمُكَ وَ أَعُوذُ بِكَ مِنْ كُلِّ سُوءٍ أَحَاطَ بِهِ عِلْمُكَ اللَّهُمَّ إِنِّي أَسْأَلُكَ عَافِيَتَكَ فِي أُمُورِي كُلِّهَا وَ أَعُوذُ بِكَ مِنْ خِزْيِ الدُّنْيَا وَ عَذَابِ الْآخِرَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Zurara, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Say, ‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> from every goodness Your<sup>azwj</sup> Knowledge is Encompassing with, and I seek Refuge with You<sup>azwj</sup> from every evil Your<sup>azwj</sup> Knowledge is Encompassing with. O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> for Your<sup>azwj</sup> good health to be in my life-time, all of it, and I seek Refuge with You<sup>azwj</sup> from every disgrace of the world and the Punishment of the Hereafter’’."}]}, {"index": 3428, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنْ عَلِيِّ بْنِ زِيَادٍ قَالَ كَتَبَ عَلِيُّ بْنُ بَصِيرٍ يَسْأَلُهُ أَنْ يَكْتُبَ لَهُ فِي أَسْفَلِ كِتَابِهِ دُعَاءً يُعَلِّمُهُ إِيَّاهُ يَدْعُو بِهِ فَيُعْصَمُ بِهِ مِنَ الذُّنُوبِ جَامِعاً لِلدُّنْيَا وَ الْآخِرَةِ \nفَكَتَبَ ( عليه السلام ) بِخَطِّهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ يَا مَنْ أَظْهَرَ الْجَمِيلَ وَ سَتَرَ الْقَبِيحَ وَ لَمْ يَهْتِكِ السِّتْرَ عَنِّي يَا كَرِيمَ الْعَفْوِ يَا حَسَنَ التَّجَاوُزِ يَا وَاسِعَ الْمَغْفِرَةِ يَا بَاسِطَ الْيَدَيْنِ بِالرَّحْمَةِ يَا صَاحِبَ كُلِّ نَجْوَى وَ يَا مُنْتَهَى كُلِّ شَكْوَى يَا كَرِيمَ الصَّفْحِ يَا عَظِيمَ الْمَنِّ يَا مُبْتَدِئَ كُلِّ نِعْمَةٍ قَبْلَ اسْتِحْقَاقِهَا \nيَا رَبَّاهْ يَا سَيِّدَاهْ يَا مَوْلَاهْ يَا غِيَاثَاهْ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَسْأَلُكَ أَنْ لَا تَجْعَلَنِي فِي النَّارِ ثُمَّ تَسْأَلُ مَا بَدَا لَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and a number of our companions, from Sahl BiN Ziyad, altogether from Ali Bin Ziyad who said, \n‘Ali Bin Baseer wrote to him<sup>asws</sup>, asking him<sup>asws</sup> that he<sup>asws</sup> write to him at the bottom of his<sup>asws</sup> letter, teaching him a supplication he can supplicate with, so he can be saved from the comprehensive sins of the world and the Hereafter.\nSo he<sup>asws</sup> wrote in his<sup>asws</sup> own handwriting: ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. O the One<sup>azwj</sup> Who Manifest the beauty and Veils the ugliness, and does not Tear down the Veil from me. O Benevolent, the Pardon, O Excellent Overlooker! O Extensive of Forgiveness! O Most Extensive of the Hands with the Mercy! O Companion of every conversation, and O the End-point of every complaint! O the Benevolent Excuser! O the Magnifier of the Favours! O the Initiator of every Bounty it is being deserved!\nO Lord<sup>azwj</sup>! O Chief! O Master! O Rescuer! Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>; and I ask You<sup>azwj</sup> that You<sup>azwj</sup> do not Make me to be in the Fire’. Then ask whatever comes to you’."}]}, {"index": 3429, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ الْبَرْقِيِّ وَ أَبِي طَالِبٍ عَنْ بَكْرِ بْنِ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اللَّهُمَّ أَنْتَ ثِقَتِي فِي كُلِّ كُرْبَةٍ وَ أَنْتَ رَجَائِي فِي كُلِّ شِدَّةٍ وَ أَنْتَ لِي فِي كُلِّ أَمْرٍ نَزَلَ بِي ثِقَةٌ وَ عُدَّةٌ كَمْ مِنْ كَرْبٍ يَضْعُفُ عَنْهُ الْفُؤَادُ وَ تَقِلُّ فِيهِ الْحِيلَةُ وَ يَخْذُلُ عَنْهُ الْقَرِيبُ وَ الْبَعِيدُ وَ يَشْمَتُ بِهِ الْعَدُوُّ وَ تَعْنِينِي فِيهِ الْأُمُورُ \nأَنْزَلْتُهُ بِكَ وَ شَكَوْتُهُ إِلَيْكَ رَاغِباً فِيهِ عَمَّنْ سِوَاكَ فَفَرَّجْتَهُ وَ كَشَفْتَهُ وَ كَفَيْتَنِيهِ فَأَنْتَ وَلِيُّ كُلِّ نِعْمَةٍ وَ صَاحِبُ كُلِّ حَاجَةٍ وَ مُنْتَهَى كُلِّ رَغْبَةٍ فَلَكَ الْحَمْدُ كَثِيراً وَ لَكَ الْمَنُّ فَاضِلًا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Abu Abdullah Al Barqy, and Abu Talib, from Bakr Bin Muhammad, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘(Say), ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> are my reliance during every worry, and You<sup>azwj</sup> are my hope during every difficulty, and Your<sup>azwj</sup> are for me during every matter which descends with me, as a Trustworthy and the Resource. And how many worries were such that the heart was weakened from it, and the plans were scarce with regards to it, and the end near ones and the far ones abandoned from it, and the enemies gloated with it, and the life-time was exhausted in it. \nI revealed it to You<sup>azwj</sup> and complained of it to You<sup>azwj</sup>, turning away from the ones besides You<sup>azwj</sup>. Therefore, Relieve it and Remove it and Suffice for it, for You<sup>azwj</sup> are the Patron of every Bounty and a Companion of every need, and the End-point of every desire. So, for You<sup>azwj</sup> is the abundant Praise, and for You<sup>azwj</sup> is the extra Favours (to Grant)’."}]}, {"index": 3430, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:6", "text": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانٍ عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ الْقُمِّيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِجَلَالِكَ وَ جَمَالِكَ وَ كَرَمِكَ أَنْ تَفْعَلَ بِي كَذَا وَ كَذَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Aban, from Isa Bin Abdullah Al Qummy, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Say, ‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Majesty and Your<sup>azwj</sup> Beauty and Your<sup>azwj</sup> benevolence that You<sup>azwj</sup> Do for me such and such’."}]}, {"index": 3431, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:7", "text": "عَنْهُ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْفَضْلِ بْنِ يُونُسَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قَالَ لِي أَكْثِرْ مِنْ أَنْ تَقُولَ اللَّهُمَّ لَا تَجْعَلْنِي مِنَ الْمُعَارِينَ وَ لَا تُخْرِجْنِي مِنَ التَّقْصِيرِ قَالَ قُلْتُ أَمَّا الْمُعَارِينَ فَقَدْ عَرَفْتُ فَمَا مَعْنَى لَا تُخْرِجْنِي مِنَ التَّقْصِيرِ \nقَالَ كُلُّ عَمَلٍ تَعْمَلُهُ تُرِيدُ بِهِ وَجْهَ اللَّهِ عَزَّ وَ جَلَّ فَكُنْ فِيهِ مُقَصِّراً عِنْدَ نَفْسِكَ فَإِنَّ النَّاسَ كُلَّهُمْ فِي أَعْمَالِهِمْ فِي مَا بَيْنَهُمْ وَ بَيْنَ اللَّهِ عَزَّ وَ جَلَّ مُقَصِّرُونَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ibn Mahboub, from Al Fazl Bin Yunus, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘He<sup>asws</sup> said to me: ‘You should frequent in saying, ‘O Allah<sup>azwj</sup>! Do not Make me to be from the ones of temporary <span class=\"iTxt\">Eman</span>, nor Exit me from the deficiency (<span class=\"iTxt\">Taqseer</span>)’. I said, ‘As for the ones of temporary <span class=\"iTxt\">Eman</span>, so I have recognised, but what is the meaning of ‘Do not Exit me from the deficiency (<span class=\"iTxt\">Taqseer</span>)?’ \nHe<sup>asws</sup> said: ‘Every deed you perform intending the Face of Allah<sup>azwj</sup> Mighty and Majestic by it, so become a deficient one (<span class=\"iTxt\">Muqassir</span>) within yourself, for the people, all of them, in their deeds regarding what is between them and Allah<sup>azwj</sup> Mighty and Majestic, are (all) deficient (<span class=\"iTxt\">Muqassireen</span>)’’."}]}, {"index": 3432, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:8", "text": "عَنْهُ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَعْيَنَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) لَقَدْ غَفَرَ اللَّهُ عَزَّ وَ جَلَّ لِرَجُلٍ مِنْ أَهْلِ الْبَادِيَةِ بِكَلِمَتَيْنِ دَعَا بِهِمَا قَالَ اللَّهُمَّ إِنْ تُعَذِّبْنِي فَأَهْلٌ لِذَلِكَ أَنَا وَ إِنْ تَغْفِرْ لِي فَأَهْلٌ لِذَلِكَ أَنْتَ فَغَفَرَ اللَّهُ لَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ibn Mahboub, from Aban, from Abdul Rahman Bin Ayn who said, \n‘Abu Ja’far<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic had Forgiven a man from the people of the valleys due to two phrases he supplicated with. He said, ‘O Allah<sup>azwj</sup>! If You<sup>azwj</sup> were to Punish me, so I am deserving of that, and if You<sup>azwj</sup> were to Forgive me, so You<sup>azwj</sup> are Rightful with it’. So Allah<sup>azwj</sup> Forgave him’."}]}, {"index": 3433, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:9", "text": "عَنْهُ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ عَمِّهِ عَنِ الرِّضَا ( عليه السلام ) قَالَ يَا مَنْ دَلَّنِي عَلَى نَفْسِهِ وَ ذَلَّلَ قَلْبِي بِتَصْدِيقِهِ أَسْأَلُكَ الْأَمْنَ وَ الْإِيمَانَ فِي الدُّنْيَا وَ الْآخِرَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Yahya Bin Al Mubarak, from Ibrahim Bin Abu Al Balaad, from his uncle, \n(It has been narrated) from Al-Reza<sup>asws</sup> having said: ‘(Say), ‘O the One Who Pointed me upon myself and Humbled my heart by Ratifying Him<sup>azwj</sup>! I ask You<sup>azwj</sup> for the security, and the <span class=\"iTxt\">Eman</span> in the world and the Hereafter’’."}]}, {"index": 3434, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:10", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ أَبِيهِ قَالَ رَأَيْتُ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) فِي فِنَاءِ الْكَعْبَةِ فِي اللَّيْلِ وَ هُوَ يُصَلِّي فَأَطَالَ الْقِيَامَ حَتَّى جَعَلَ مَرَّةً يَتَوَكَّأُ عَلَى رِجْلِهِ الْيُمْنَى وَ مَرَّةً عَلَى رِجْلِهِ الْيُسْرَى ثُمَّ سَمِعْتُهُ يَقُولُ بِصَوْتٍ كَأَنَّهُ بَاكٍ \nيَا سَيِّدِي تُعَذِّبُنِي وَ حُبُّكَ فِي قَلْبِي أَمَا وَ عِزَّتِكَ لَئِنْ فَعَلْتَ لَتَجْمَعَنَّ بَيْنِي وَ بَيْنَ قَوْمٍ طَالَ مَا عَادَيْتُهُمْ فِيكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Abu Hamza, from his father who said, \n‘I saw Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> in the courtyard of the Kabah during the night and he<sup>asws</sup> was praying <span class=\"iTxt\">Salāt</span>, and he<sup>asws</sup> prolonged the standing until he repeatedly leaned upon his<sup>asws</sup> right leg, and at times upon his<sup>asws</sup> left leg. Then I heard him<sup>asws</sup> saying in a voice as if he<sup>asws</sup> was crying. (The suppliction is): \n‘O my Master! Will You<sup>azwj</sup> Punish me while Your<sup>azwj</sup> Love is in my<sup>asws</sup> heart? But, by Your<sup>azwj</sup> Mighty, if You<sup>azwj</sup> Do so, You<sup>azwj</sup> would be Gathering between me<sup>asws</sup> and the group of people with whom I<sup>asws</sup> have prolonged being their enemy for Your<sup>azwj</sup> Sake’’."}]}, {"index": 3435, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:11", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ دَاوُدَ الرَّقِّيِّ قَالَ إِنِّي كُنْتُ أَسْمَعُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) أَكْثَرَ مَا يُلِحُّ بِهِ فِي الدُّعَاءِ.\nعَلَى اللَّهِ بِحَقِّ الْخَمْسَةِ يَعْنِي رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ أَمِيرَ الْمُؤْمِنِينَ وَ فَاطِمَةَ وَ الْحَسَنَ وَ الْحُسَيْنَ ( صلوات الله عليهم )", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Umar Bin Abdul Aziz, from one of our companions, from Dawood Al Raqyy who said, \n‘I used to frequently hear Abu Abdullah<sup>asws</sup> what he<sup>asws</sup> would frequently supplicate to Allah<sup>azwj</sup>, \nBy the right of the (Holy) Five – meaning Rasool-Allah<sup>saww</sup>, and Amir Al Momineen<sup>asws</sup>, and Fatima<sup>asws</sup>, and Al Hassan<sup>asws</sup> and Al Husayn<sup>asws</sup>’’."}]}, {"index": 3436, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:12", "text": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ عَنْ إِبْرَاهِيمَ الْكَرْخِيِّ قَالَ عَلَّمَنَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) دُعَاءً وَ أَمَرَنَا أَنْ نَدْعُوَ بِهِ يَوْمَ الْجُمُعَةِ اللَّهُمَّ إِنِّي تَعَمَّدْتُ إِلَيْكَ بِحَاجَتِي وَ أَنْزَلْتُ بِكَ الْيَوْمَ فَقْرِي وَ مَسْكَنَتِي فَأَنَا الْيَوْمَ لِمَغْفِرَتِكَ أَرْجَى مِنِّي لِعَمَلِي وَ لَمَغْفِرَتُكَ وَ رَحْمَتُكَ أَوْسَعُ مِنْ ذُنُوبِي \nفَتَوَلَّ قَضَاءَ كُلِّ حَاجَةٍ هِيَ لِي بِقُدْرَتِكَ عَلَيْهَا وَ تَيْسِيرِ ذَلِكَ عَلَيْكَ وَ لِفَقْرِي إِلَيْكَ فَإِنِّي لَمْ أُصِبْ خَيْراً قَطُّ إِلَّا مِنْكَ وَ لَمْ يَصْرِفْ عَنِّي أَحَدٌ شَرّاً قَطُّ غَيْرُكَ وَ لَيْسَ أَرْجُو لآِخِرَتِي وَ دُنْيَايَ سِوَاكَ وَ لَا لِيَوْمِ فَقْرِي وَ يَوْمِ يُفْرِدُنِي النَّاسُ فِي حُفْرَتِي وَ أُفْضِي إِلَيْكَ يَا رَبِّ بِفَقْرِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abu Ayoub, from Ibrahim Al Karkhy who said, \n‘Abu Abdullah<sup>asws</sup> taught us a supplication and instructed us that we should be supplicating with it on the day of Friday: ‘(Say), ‘O Allah<sup>azwj</sup>! I have deliberated to You<sup>azwj</sup> with my need and revealed to You<sup>azwj</sup> today, my poverty and my destitution. Thus, today, I am hoping for Your<sup>azwj</sup> Forgiveness for my deeds, and for Your<sup>azwj</sup> Forgiveness and Your<sup>azwj</sup> Mercy which is more Capacious than my sins. \nSo Undertake the fulfilment of every need which is for me, by Your<sup>azwj</sup> Power over it, and that is Easy upon You<sup>azwj</sup> and my poverty to You<sup>azwj</sup>, for I cannot attain goodness at all except from You<sup>azwj</sup>, and no one can exchange evil from me at all apart from You<sup>azwj</sup>, and I do not hope for my Hereafter and my world (to anyone) besides You<sup>azwj</sup>, nor for my day of poverty and the day of my isolation from the people in my pit (grave), and I am panicking to You<sup>azwj</sup>, O Lord<sup>azwj</sup>, with my poverty’."}]}, {"index": 3437, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:13", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ عَطِيَّةَ عَنْ زَيْدٍ الصَّائِغِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) ادْعُ اللَّهَ لَنَا فَقَالَ اللَّهُمَّ ارْزُقْهُمْ صِدْقَ الْحَدِيثِ وَ أَدَاءَ الْأَمَانَةِ وَ الْمُحَافَظَةَ عَلَى الصَّلَوَاتِ اللَّهُمَّ إِنَّهُمْ أَحَقُّ خَلْقِكَ أَنْ تَفْعَلَهُ بِهِمُ اللَّهُمَّ وَ افْعَلْهُ بِهِمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Husayn Bin Atiyya, from Zayd Al Saig who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘Supplicate to Allah<sup>azwj</sup> for us’. So he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Grace them the truthful narrations, and payment of the entrustment, and the preservation upon the <span class=\"iTxt\">Salāt</span>. O Allah<sup>azwj</sup>! They are the most deserving of Your<sup>azwj</sup> creatures that You<sup>azwj</sup> Grant them (Favours). O Allah<sup>azwj</sup>, and Grant them (Favours)’’."}]}, {"index": 3438, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:14", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ص يَقُولُ اللَّهُمَّ مُنَّ عَلَيَّ بِالتَّوَكُّلِ عَلَيْكَ وَ التَّفْوِيضِ إِلَيْكَ وَ الرِّضَا بِقَدَرِكَ وَ التَّسْلِيمِ لِأَمْرِكَ حَتَّى لَا أُحِبَّ تَعْجِيلَ مَا أَخَّرْتَ وَ لَا تَأْخِيرَ مَا عَجَّلْتَ يَا رَبَّ الْعَالَمِينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abu Hamza, \n(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> was saying: ‘O Allah<sup>azwj</sup>! Bestow upon me<sup>asws</sup> with the reliance upon You<sup>azwj</sup>, and the delegation to You<sup>azwj</sup> (of the affairs), and the pleasure with Your<sup>azwj</sup> Ordainment, and the submission to Your<sup>azwj</sup> Command, until I<sup>asws</sup> do not love the hastening of whatever You<sup>azwj</sup> Delay, nor the delay of what You<sup>azwj</sup> Hasten, O Lord<sup>azwj</sup> of the worlds’’."}]}, {"index": 3439, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:15", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ سُحَيْمٍ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَ هُوَ رَافِعٌ يَدَهُ إِلَى السَّمَاءِ رَبِّ لَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ أَبَداً لَا أَقَلَّ مِنْ ذَلِكَ وَ لَا أَكْثَرَ \nقَالَ فَمَا كَانَ بِأَسْرَعَ مِنْ أَنْ تَحَدَّرَ الدُّمُوعُ مِنْ جَوَانِبِ لِحْيَتِهِ ثُمَّ أَقْبَلَ عَلَيَّ فَقَالَ يَا ابْنَ أَبِي يَعْفُورٍ إِنَّ يُونُسَ بْنَ مَتَّى وَكَلَهُ اللَّهُ عَزَّ وَ جَلَّ إِلَى نَفْسِهِ أَقَلَّ مِنْ طَرْفَةِ عَيْنٍ فَأَحْدَثَ ذَلِكَ الذَّنْبَ قُلْتُ فَبَلَغَ بِهِ كُفْراً أَصْلَحَكَ اللَّهُ قَالَ لَا وَ لَكِنَّ الْمَوْتَ عَلَى تِلْكَ الْحَالِ هَلَاكٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Suheym, from Ibn Abu Yafour who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying while he<sup>asws</sup> was raising his<sup>asws</sup> hand towards the sky: ‘O Lord<sup>azwj</sup>! Do not Leave me to myself (even) for the blink of an eye, ever, neither less than that nor more’. \nHe (the narrator) said, ‘So it was with immediate flow of the tears from the sides of his<sup>asws</sup> beard. Then he<sup>asws</sup> turned towards me and he<sup>asws</sup> said: ‘O Ibn Abu Yafour! Yunus Bin Matta<sup>ra</sup>, Allah<sup>azwj</sup> Mighty and Majestic Left him<sup>as</sup> to himself<sup>as</sup> for less than the blink of an eye, so he<sup>as</sup> committed that sin’. I said, ‘So did he<sup>as</sup> reach disbelief with it, may Allah<sup>azwj</sup> Keep you<sup>asws</sup> well!?’ He<sup>asws</sup> said: ‘No, but the death upon that state is destruction’."}]}, {"index": 3440, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:16", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ رَفَعَهُ قَالَ أَتَى جَبْرَئِيلُ ( عليه السلام ) إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ لَهُ إِنَّ رَبَّكَ يَقُولُ لَكَ إِذَا أَرَدْتَ أَنْ تَعْبُدَنِي يَوْماً وَ لَيْلَةً حَقَّ عِبَادَتِي فَارْفَعْ يَدَيْكَ إِلَيَّ وَ قُلِ\nاللَّهُمَّ لَكَ الْحَمْدُ حَمْداً خَالِداً مَعَ خُلُودِكَ وَ لَكَ الْحَمْدُ حَمْداً لَا مُنْتَهَى لَهُ دُونَ عِلْمِكَ وَ لَكَ الْحَمْدُ حَمْداً لَا أَمَدَ لَهُ دُونَ مَشِيئَتِكَ وَ لَكَ الْحَمْدُ حَمْداً لَا جَزَاءَ لِقَائِلِهِ إِلَّا رِضَاكَ\nاللَّهُمَّ لَكَ الْحَمْدُ كُلُّهُ وَ لَكَ الْمَنُّ كُلُّهُ وَ لَكَ الْفَخْرُ كُلُّهُ وَ لَكَ الْبَهَاءُ كُلُّهُ وَ لَكَ النُّورُ كُلُّهُ وَ لَكَ الْعِزَّةُ كُلُّهَا وَ لَكَ الْجَبَرُوتُ كُلُّهَا وَ لَكَ الْعَظَمَةُ كُلُّهَا وَ لَكَ الدُّنْيَا كُلُّهَا وَ لَكَ الْآخِرَةُ كُلُّهَا وَ لَكَ اللَّيْلُ وَ النَّهَارُ كُلُّهُ وَ لَكَ الْخَلْقُ كُلُّهُ وَ بِيَدِكَ الْخَيْرُ كُلُّهُ وَ إِلَيْكَ يَرْجِعُ الْأَمْرُ كُلُّهُ عَلَانِيَتُهُ وَ سِرُّهُ \nاللَّهُمَّ لَكَ الْحَمْدُ حَمْداً أَبَداً أَنْتَ حَسَنُ الْبَلَاءِ جَلِيلُ الثَّنَاءِ سَابِغُ النَّعْمَاءِ عَدْلُ الْقَضَاءِ جَزِيلُ الْعَطَاءِ حَسَنُ الْآلَاءِ إِلَهُ مَنْ فِي الْأَرْضِ وَ إِلَهُ مَنْ فِي السَّمَاءِ\nاللَّهُمَّ لَكَ الْحَمْدُ فِي السَّبْعِ الشِّدَادِ وَ لَكَ الْحَمْدُ فِي الْأَرْضِ الْمِهَادِ وَ لَكَ الْحَمْدُ طَاقَةَ الْعِبَادِ وَ لَكَ الْحَمْدُ سَعَةَ الْبِلَادِ وَ لَكَ الْحَمْدُ فِي الْجِبَالِ الْأَوْتَادِ وَ لَكَ الْحَمْدُ فِي اللَّيْلِ إِذَا يَغْشَى وَ لَكَ الْحَمْدُ فِي النَّهَارِ إِذَا تَجَلَّى وَ لَكَ الْحَمْدُ فِي الْآخِرَةِ وَ الْأُولَى وَ لَكَ الْحَمْدُ فِي الْمَثَانِي وَ الْقُرْآنِ الْعَظِيمِ\nوَ سُبْحَانَ اللَّهِ وَ بِحَمْدِهِ وَ الْأَرْضُ جَمِيعاً قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَ السَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ سُبْحَانَهُ وَ تَعَالَى عَمَّا يُشْرِكُونَ سُبْحَانَ اللَّهِ وَ بِحَمْدِهِ كُلُّ شَيْ‏ءٍ هَالِكٌ إِلَّا وَجْهَهُ سُبْحَانَكَ رَبَّنَا وَ تَعَالَيْتَ وَ تَبَارَكْتَ وَ تَقَدَّسْتَ \nخَلَقْتَ كُلَّ شَيْ‏ءٍ بِقُدْرَتِكَ وَ قَهَرْتَ كُلَّ شَيْ‏ءٍ بِعِزَّتِكَ وَ عَلَوْتَ فَوْقَ كُلِّ شَيْ‏ءٍ بِارْتِفَاعِكَ وَ غَلَبْتَ كُلَّ شَيْ‏ءٍ بِقُوَّتِكَ وَ ابْتَدَعْتَ كُلَّ شَيْ‏ءٍ بِحِكْمَتِكَ وَ عِلْمِكَ وَ بَعَثْتَ الرُّسُلَ بِكُتُبِكَ وَ هَدَيْتَ الصَّالِحِينَ بِإِذْنِكَ وَ أَيَّدْتَ الْمُؤْمِنِينَ بِنَصْرِكَ وَ قَهَرْتَ الْخَلْقَ بِسُلْطَانِكَ \nلَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ لَا نَعْبُدُ غَيْرَكَ وَ لَا نَسْأَلُ إِلَّا إِيَّاكَ وَ لَا نَرْغَبُ إِلَّا إِلَيْكَ أَنْتَ مَوْضِعُ شَكْوَانَا وَ مُنْتَهَى رَغْبَتِنَا وَ إِلَهُنَا وَ مَلِيكُنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, raising it, \n‘He<sup>asws</sup> said: ‘Jibraeel<sup>as</sup> came over to the Prophet<sup>as</sup> and said to him<sup>saww</sup>: ‘Your<sup>saww</sup> Lord<sup>azwj</sup> is Saying to you<sup>saww</sup>: “Whenever you<sup>saww</sup> to worship Me<sup>azwj</sup> for a day and night as is the right of My<sup>azwj</sup> worship, so raise your<sup>saww</sup> hands towards Me<sup>azwj</sup> and say: -\n‘O Allah<sup>azwj</sup>! For You<sup>azwj</sup> is the Praise, eternal Praise along with Your<sup>azwj</sup> Eternality; and for You<sup>azwj</sup> is the Praise, a Praise with no end to it besides Your<sup>azwj</sup> Knowledge; and for You<sup>azwj</sup> is the Praise, a Praise having not extension for it besides Your<sup>azwj</sup> Desire; and for You<sup>azwj</sup> is the Praise, a Praise having no Recompense for its speaker except Your<sup>azwj</sup> Pleasure. \nO Allah<sup>azwj</sup>! For You<sup>azwj</sup> is the Praise, all of it, and for You<sup>azwj</sup> is the Favour, all of it, and for You<sup>azwj</sup> is the Beauty, all of it, and for You<sup>azwj</sup> is the Light, all of it, and for You<sup>azwj</sup> is the Might, all of it, and for You<sup>azwj</sup> is the Grandeur, all of it, and for You<sup>azwj</sup> is the Magnificence, all of it, and for You<sup>azwj</sup> is the world, all of it, and for You<sup>azwj</sup> is the Hereafter, all of it, and for You<sup>azwj</sup> is the night and the day, all of it, and for You<sup>azwj</sup> is the creation, all of it, and in Your<sup>azwj</sup> Hand is the goodness, all of It, and to You<sup>azwj</sup> do the matters return, all of them, its public and its private.\nO Allah<sup>azwj</sup>! The Praise is for You<sup>azwj</sup>, an everlasting Praise. You<sup>azwj</sup> are the Good affliction, the One of Majestic Laudation, the concealed Bounty Giver, the Just Judge, the abundant Giver, the Good Rewarder, Lord<sup>azwj</sup> of the one in the earth and Lord<sup>azwj</sup> of the ones in the sky.\nO Allah<sup>azwj</sup>! For You<sup>azwj</sup> is the Praise in the seven mighty (skies), and for You<sup>azwj</sup> is the Praise in the earth spread out, and for You<sup>azwj</sup> is the Praise of the endurance of the servants, and for You<sup>azwj</sup> is the Praise at the times of the afflictions, and for You<sup>azwj</sup> is the Praise in the mountains (like) pegs, and for You<sup>azwj</sup> is the Praise in the night when it cover, and for You<sup>azwj</sup> is the Praise in the day when it brightens, and for You<sup>azwj</sup> is the Praise in the Hereafter, and the former (life in the earth), and for You<sup>azwj</sup> is the Praise in the doubles (Imams<sup>asws</sup> and the Magnificent Quran. \nAnd Glory be to Allah<sup>azwj</sup>, and with His<sup>azwj</sup> Praise, and the earth, all of it would be in His<sup>azwj</sup> Grip on the Day of Judgment, and the skies would be (like) leaflets in His<sup>azwj</sup> Right Hand. Glorious is He<sup>azwj</sup> and Exalted from what they (people) are associating. Glory be to Him<sup>azwj</sup> and with His<sup>azwj</sup> Praise. Everything will perish except for His<sup>azwj</sup> Face. Glory be to You<sup>azwj</sup>, our Lord<sup>azwj</sup>, and You<sup>azwj</sup> are more Exalted, and more Blessed, and Holier.\nYou<sup>azwj</sup> Created everything by Your<sup>azwj</sup> Power, and Compelled everything by Your<sup>azwj</sup> Mighty, and Exalted above everything by Your<sup>azwj</sup> Loftiness, and Overcame everything by Your<sup>azwj</sup> Strength, and Initiated everything by Your<sup>azwj</sup> Wisdom and Your<sup>azwj</sup> Knowledge, and Sent the Rasools<sup>as</sup> with Your<sup>azwj</sup> Books, and Guided the righteous ones by Your<sup>azwj</sup> Permission, and Aided the Momineen by Your<sup>azwj</sup> Help, and Coerced Your<sup>azwj</sup> creatures by Your<sup>azwj</sup> Authority.\nThere is no god except You<sup>azwj</sup>, Alone. There is no associate for You<sup>azwj</sup>. Neither do we worship any apart from You<sup>azwj</sup>, nor do we ask except You<sup>azwj</sup>, nor do we turn towards except to You<sup>azwj</sup>. You<sup>azwj</sup> are the place of (placing) our complaints, and the end-point of our hopes, and (You<sup>azwj</sup> are) our God<sup>azwj</sup> and our King’’."}]}, {"index": 3441, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:17", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ابْتِدَاءً مِنْهُ يَا مُعَاوِيَةُ أَ مَا عَلِمْتَ أَنَّ رَجُلًا أَتَى أَمِيرَ الْمُؤْمِنِينَ ( صلوات الله عليه )  فَشَكَا الْإِبْطَاءَ عَلَيْهِ فِي الْجَوَابِ فِي دُعَائِهِ فَقَالَ لَهُ أَيْنَ أَنْتَ عَنِ الدُّعَاءِ السَّرِيعِ الْإِجَابَةِ فَقَالَ لَهُ الرَّجُلُ مَا هُوَ\nقَالَ قُلِ \nاللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الْعَظِيمِ الْأَعْظَمِ الْأَجَلِّ الْأَكْرَمِ الْمَخْزُونِ الْمَكْنُونِ النُّورِ الْحَقِّ الْبُرْهَانِ الْمُبِينِ الَّذِي هُوَ نُورٌ مَعَ نُورٍ وَ نُورٌ مِنْ نُورٍ وَ نُورٌ فِي نُورٍ وَ نُورٌ عَلَى نُورٍ وَ نُورٌ فَوْقَ كُلِّ نُورٍ وَ نُورٌ يُضِي‏ءُ بِهِ كُلُّ ظُلْمَةٍ وَ يُكْسَرُ بِهِ كُلُّ شِدَّةٍ وَ كُلُّ شَيْطَانٍ مَرِيدٍ وَ كُلُّ جَبَّارٍ عَنِيدٍ\nلَا تَقِرُّ بِهِ أَرْضٌ وَ لَا تَقُومُ بِهِ سَمَاءٌ وَ يَأْمَنُ بِهِ كُلُّ خَائِفٍ وَ يَبْطُلُ بِهِ سِحْرُ كُلِّ سَاحِرٍ وَ بَغْيُ كُلِّ بَاغٍ وَ حَسَدُ كُلِّ حَاسِدٍ وَ يَتَصَدَّعُ لِعَظَمَتِهِ الْبَرُّ وَ الْبَحْرُ وَ يَسْتَقِلُّ بِهِ الْفُلْكُ حِينَ يَتَكَلَّمُ بِهِ الْمَلَكُ فَلَا يَكُونُ لِلْمَوْجِ عَلَيْهِ سَبِيلٌ وَ هُوَ اسْمُكَ الْأَعْظَمُ الْأَعْظَمُ الْأَجَلُّ الْأَجَلُّ النُّورُ الْأَكْبَرُ الَّذِي سَمَّيْتَ بِهِ نَفْسَكَ وَ اسْتَوَيْتَ بِهِ عَلَى عَرْشِكَ \nوَ أَتَوَجَّهُ إِلَيْكَ بِمُحَمَّدٍ وَ أَهْلِ بَيْتِهِ أَسْأَلُكَ بِكَ وَ بِهِمْ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَنْ تَفْعَلَ بِي كَذَا وَ كَذَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, form Ibn Abu Umeyr, from Muawiya Bin Ammar who said, \n‘Abu Abdullahh<sup>asws</sup> said to me, initiating from himself<sup>asws</sup>: ‘O Muawiya! Do you not know that a man came over to Amir Al-Momineen<sup>asws</sup>, so he complained of the slowness upon him regarding the Answer of his supplication. So he<sup>asws</sup> said to him: ‘Where are you from the supplication of the quick response?’ So the man said to him, ‘What is it?’ \nHe<sup>asws</sup> said: ‘Say, \n‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Magnificent Name, the most Magnificent, and most Majestic, the most Benevolent, the most Treasured, the Light, the Truth, the Manifest Proof which it is a Light with a Light, and a light from a Light, and a Light in a Light, and a Light upon a Light, and a Light above every Light, and a Light by which every darkness is illuminated, and by which everything is broken down, and every Expelled Satan<sup>la</sup>, and every tenacious tyrant. \nNeither can the earth bear it nor can the sky stand by it; and every fearful ones is secured by it; and there is invalidated by it the magic of every magician, and the rebellion of every rebel, and the envy of every envying one; and the land and the sea  crack up due to its Magnificence, and the ships sail by it when the Angels speak with it, so there does not happen to be a way for the waves upon it, and it is Your<sup>azwj</sup> most Magnificent Name and the most Majestic, the Great Light which You<sup>azwj</sup> Named Yourself<sup>azwj</sup> with and Established Yourself<sup>azwj</sup> upon the Throne with it. \nAnd I divert to You<sup>azwj</sup> by Muhammad<sup>saww</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household. I ask You<sup>azwj</sup> by You<sup>azwj</sup> and by them<sup>asws</sup> that You<sup>azwj</sup> Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and that You<sup>azwj</sup> (please) Resolve such and such with me’’."}]}, {"index": 3442, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:18", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ قَالَ أَمْلَى عَلَيَّ هَذَا الدُّعَاءَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ هُوَ جَامِعٌ لِلدُّنْيَا وَ الْآخِرَةِ تَقُولُ بَعْدَ حَمْدِ اللَّهِ وَ الثَّنَاءِ عَلَيْهِ\nاللَّهُمَّ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْحَلِيمُ الْكَرِيمُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْعَزِيزُ الْحَكِيمُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْوَاحِدُ الْقَهَّارُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْمَلِكُ الْجَبَّارُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الرَّحِيمُ الْغَفَّارُ\nوَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ شَدِيدُ الْمِحَالِ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْكَبِيرُ الْمُتَعَالِ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ السَّمِيعُ الْبَصِيرُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْمَنِيعُ الْقَدِيرُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْغَفُورُ الشَّكُورُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْحَمِيدُ الْمَجِيدُ\nوَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْغَفُورُ الْوَدُودُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْحَنَّانُ الْمَنَّانُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْحَلِيمُ الدَّيَّانُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْجَوَادُ الْمَاجِدُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْوَاحِدُ الْأَحَدُ\nوَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْغَائِبُ الشَّاهِدُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الظَّاهِرُ الْبَاطِنُ وَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ تَمَّ نُورُكَ فَهَدَيْتَ وَ بَسَطْتَ يَدَكَ فَأَعْطَيْتَ رَبَّنَا وَجْهُكَ أَكْرَمُ الْوُجُوهِ وَ جِهَتُكَ خَيْرُ الْجِهَاتِ وَ عَطِيَّتُكَ أَفْضَلُ الْعَطَايَا وَ أَهْنَؤُهَا \nتُطَاعُ رَبَّنَا فَتَشْكُرُ وَ تُعْصَى رَبَّنَا فَتَغْفِرُ لِمَنْ شِئْتَ تُجِيبُ الْمُضْطَرِّينَ وَ تَكْشِفُ السُّوءَ وَ تَقْبَلُ التَّوْبَةَ وَ تَعْفُو عَنِ الذُّنُوبِ لَا تُجَازَى أَيَادِيكَ وَ لَا تُحْصَى نِعَمُكَ وَ لَا يَبْلُغُ مِدْحَتَكَ قَوْلُ قَائِلٍ \nاللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ عَجِّلْ فَرَجَهُمْ وَ رُوحَهُمْ وَ رَاحَتَهُمْ وَ سُرُورَهُمْ وَ أَذِقْنِي طَعْمَ فَرَجِهِمْ وَ أَهْلِكْ أَعْدَاءَهُمْ مِنَ الْجِنِّ وَ الْإِنْسِ وَ آتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْآخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ اجْعَلْنَا مِنَ الَّذِينَ لَا خَوْفٌ عَلَيْهِمْ وَ لَا هُمْ يَحْزَنُونَ \nوَ اجْعَلْنِي مِنَ الَّذِينَ صَبَرُوا وَ عَلَى رَبِّهِمْ يَتَوَكَّلُونَ وَ ثَبِّتْنِي بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَ فِي الْآخِرَةِ وَ بَارِكْ لِي فِي الْمَحْيَا وَ الْمَمَاتِ وَ الْمَوْقِفِ وَ النُّشُورِ وَ الْحِسَابِ وَ الْمِيزَانِ وَ أَهْوَالِ يَوْمِ الْقِيَامَةِ وَ سَلِّمْنِي عَلَى الصِّرَاطِ وَ أَجِزْنِي عَلَيْهِ وَ ارْزُقْنِي عِلْماً نَافِعاً وَ يَقِيناً صَادِقاً وَ تُقًى وَ بِرّاً وَ وَرَعاً وَ خَوْفاً مِنْكَ وَ فَرَقاً يُبْلِغُنِي مِنْكَ زُلْفَى وَ لَا يُبَاعِدُنِي عَنْكَ\nوَ أَحْبِبْنِي وَ لَا تُبْغِضْنِي وَ تَوَلَّنِي وَ لَا تَخْذُلْنِي وَ أَعْطِنِي مِنْ جَمِيعِ خَيْرِ الدُّنْيَا وَ الْآخِرَةِ مَا عَلِمْتُ مِنْهُ وَ مَا لَمْ أَعْلَمْ وَ أَجِرْنِي مِنَ السُّوءِ كُلِّهِ بِحَذَافِيرِهِ مَا عَلِمْتُ مِنْهُ وَ مَا لَمْ أَعْلَمْ ", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Khalaf Bin Hammad, from Amro Bin Abu Al Miqdam who said, \n‘This supplication was dictated upon me by Abu Abdullah<sup>azwj</sup>, and it is comprehensive for the world and the Hereafter. You should be saying after the Praise of Allah<sup>azwj</sup> and the Laudation upon Him<sup>azwj</sup>: -\nO Allah<sup>azwj</sup>! You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Forbearing, the Benevolent; and You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Mighty, the Wise. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There Is no god except You<sup>azwj</sup>, the Alone, the Subduer. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the King, the Compeller. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Merciful, the Forgiver. \nAnd You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup> the intensely unimaginable. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Great, the Exalted. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Hearing, the Seeing. You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Invincible, the all-Powerful. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Forgiver, the Grateful. And You<sup>azwj</sup> are allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the most Praised, the most Glorified.\nAnd You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Forgiver, the Cordial. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Affectionate, the Benefactor. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Forbearing, the Recompensing. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Generous, the Glorious. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Alone, the One.\nAnd You<sup>azwj</sup> are allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Unseen, the Witness. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, the Manifest, the Hidden. And You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except You<sup>azwj</sup>, Knower of everything. Your<sup>azwj</sup> Light is Perfect, so You<sup>azwj</sup> Guide, and Your<sup>azwj</sup> Hand Extends, so You<sup>azwj</sup> Give. Our Lord<sup>azwj</sup>! Your<sup>azwj</sup> Face is Benevolent, and Your<sup>azwj</sup> Perspective is the best of the perspectives, and Your<sup>azwj</sup> Gift is the most superior of the Gifts and the most welcoming.\nYou<sup>azwj</sup> are obeyed, our Lord<sup>azwj</sup>, so You<sup>azwj</sup> are Grateful, and You<sup>azwj</sup> are disobeyed, our Lord<sup>azwj</sup>, so You<sup>azwj</sup> Forgive the one You<sup>azwj</sup> so Desire to. You<sup>azwj</sup> Answer the desperate ones, and Remove the evil, and Accept the repentance, and Pardon from the sins. Your<sup>azwj</sup> Aid cannot be exceeded (by anyone else), nor can Your<sup>azwj</sup> Bounties be counted, nor can Your<sup>azwj</sup> Eulogy cannot be reached by the words of the speaker.\nO Allah<sup>azwj</sup>! Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad, and Hasten their<sup>asws</sup> relief, and their<sup>asws</sup> comfort, and their<sup>asws</sup> rest, and their<sup>asws</sup> joy, and Cause me to taste the food (pleasure) of their<sup>asws</sup> relief, and Destroy their<sup>asws</sup> enemies from the Jinn and the human beings, and Give us goodness in the world and goodness in the Hereafter, and Save us from the Punishment of the Fire, and Make us to be from those who <span class=\"ibTxt\">[2:62] there would be no fear for them, nor shall they be grieving</span>. \nAnd Make me to be from <span class=\"ibTxt\">[16:42] Those who are patient and upon their Lord they are relying</span>, and Affirm me <span class=\"ibTxt\">[14:27] with the firm Word</span> in the life of the world and in the Hereafter, and Bless for me in the life, and the death, and the Pausing, and the Resurrection, and the Reckoning, and the Scale, and the Horrors on the Day of Judgment, and Secure me upon the Bridge, and Allow me (to pass) upon it, and Grace me beneficial knowledge, and sincere conviction, and piety, and righteousness, and devoutness, and fear from You<sup>azwj</sup>, and a separation (from others) making me reach closer to You<sup>azwj</sup> and not distancing me from You<sup>azwj</sup>. \nAnd Love me and do not Hate me, and Befriend me and do not Abandon me, and Give me from the entirety of the goodness of the world and the Hereafter, what I know of and what I do not know of, and Rescue me from the evil, all of it, by it strictness, what I know from it and what I do not know’’."}]}, {"index": 3443, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:19", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَ لَا تَخُصُّنِي بِدُعَاءٍ قَالَ بَلَى \nقَالَ قُلْ يَا وَاحِدُ يَا مَاجِدُ يَا أَحَدُ يَا صَمَدُ يَا مَنْ لَمْ يَلِدْ وَ لَمْ يُولَدْ وَ لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ يَا عَزِيزُ يَا كَرِيمُ يَا حَنَّانُ يَا مَنَّانُ يَا سَامِعَ الدَّعَوَاتِ يَا أَجْوَدَ مَنْ سُئِلَ وَ يَا خَيْرَ مَنْ أَعْطَى يَا اللَّهُ يَا اللَّهُ يَا اللَّهُ قُلْتُ وَ لَقَدْ نَادَانَا نُوحٌ فَلَنِعْمَ الْمُجِيبُونَ\nثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ نَعَمْ لَنِعْمَ الْمُجِيبُ أَنْتَ وَ نِعْمَ الْمَدْعُوُّ وَ نِعْمَ الْمَسْئُولُ \nأَسْأَلُكَ بِنُورِ وَجْهِكَ وَ أَسْأَلُكَ بِعِزَّتِكَ وَ قُدْرَتِكَ وَ جَبَرُوتِكَ وَ أَسْأَلُكَ بِمَلَكُوتِكَ وَ دِرْعِكَ الْحَصِينَةِ وَ بِجَمْعِكَ وَ أَرْكَانِكَ كُلِّهَا وَ بِحَقِّ مُحَمَّدٍ وَ بِحَقِّ الْأَوْصِيَاءِ بَعْدَ مُحَمَّدٍ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَنْ تَفْعَلَ بِي كَذَا وَ كَذَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Fazalat Bin Ayoub, from Muawiya Bin Ammar who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘Can you<sup>asws</sup> specialise me with a supplication?’ He<sup>asws</sup> said: ‘Yes’. \nHe<sup>asws</sup> said: ‘Say, ‘O the One, O Glorified, O the First, O the Last, O the One Who does not beget and is not begotten and there does not happen anyone to be a match for Him<sup>azwj</sup>! O the Mighty, O the Benevolent, O the Affectionate, O the Benefactor, O the Hearer of the supplications, O the most Generous of the asked ones, and O the Best of the ones who give. O Allah<sup>azwj</sup>! O Allah<sup>azwj</sup>!’. I said, ‘<span class=\"ibTxt\">[37:75] And Nuh did call upon Us, so the most excellent Responders are We</span>’.\nThen Abu Abdullah<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> was saying: ‘Yes, You<sup>azwj</sup> are the Best of the Responders, and the best of the ones supplicated to, and best of the ones asked from’. \n(Say), ‘I ask You<sup>azwj</sup> by the Light of Your<sup>azwj</sup> Face, and I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Might, and Your<sup>azwj</sup> Power, and Your<sup>azwj</sup> Compulsion, and I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Kingdom, and Your<sup>azwj</sup> Fortified Shield, and by Your<sup>azwj</sup> Grip, and Your<sup>azwj</sup> Elements, all of them, and by the right of Muhammad<sup>saww</sup>, and by the right of the successors<sup>as</sup> after Muhammad<sup>saww</sup>, that You<sup>azwj</sup> should Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and that You<sup>azwj</sup> should Do such and such with me’’."}]}, {"index": 3444, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:20", "text": "عَنْهُ عَنْ بَعْضِ أَصْحَابِهِ عَنْ حُسَيْنِ بْنِ عُمَارَةَ عَنْ حُسَيْنِ بْنِ أَبِي سَعِيدٍ الْمُكَارِي وَ جَهْمِ بْنِ أَبِي جَهْمَةَ عَنْ أَبِي جَعْفَرٍ رَجُلٌ مِنْ أَهْلِ الْكُوفَةِ كَانَ يُعْرَفُ بِكُنْيَتِهِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فَقَالَ نَعَمْ قُلْ \nيَا مَنْ أَرْجُوهُ لِكُلِّ خَيْرٍ وَ يَا مَنْ آمَنُ سَخَطَهُ عِنْدَ كُلِّ عَثْرَةٍ وَ يَا مَنْ يُعْطِي بِالْقَلِيلِ الْكَثِيرَ يَا مَنْ أَعْطَى مَنْ سَأَلَهُ تُحَنُّناً مِنْهُ وَ رَحْمَةً يَا مَنْ أَعْطَى مَنْ لَمْ يَسْأَلْهُ وَ لَمْ يَعْرِفْهُ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَعْطِنِي بِمَسْأَلَتِي مِنْ جَمِيعِ خَيْرِ الدُّنْيَا وَ جَمِيعِ خَيْرِ الْآخِرَةِ فَإِنَّهُ غَيْرُ مَنْقُوصٍ مَا أَعْطَيْتَنِي وَ زِدْنِي مِنْ سَعَةِ فَضْلِكَ يَا كَرِيمُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from one of his companions, from Husayn Bin Umara, from Husayn Bin Abu Saeed Al Mukary and Jahm Bin Abu Jahma, from Abu Ja’far, a man from the people of Al Kufa who is well-known by his teknonym, said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘Teach me a supplication I can supplicate with’. So he<sup>asws</sup> said: ‘Yes, say, \n‘O the One I can hope to for every goodness, and O the One I can be safe from His<sup>azwj</sup> Wrath during every stumble, and O the One Who Gives a lot due to a little, O the One Who Give to the one who asks Him<sup>azwj</sup> as a Compassion from Him<sup>azwj</sup> and a Mercy. O the One who Gives to the one who does not (even) ask Him<sup>azwj</sup> and does not know Him<sup>azwj</sup>! Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and Give me due to my asking, from the entirety of goodness of the world and the entirety of the goodness of the Hereafter, for it is without a deficient what You<sup>azwj</sup> have already Given me, and Increase it for me from the Expansiveness of Your<sup>azwj</sup> Grace, O Benevolent!’’."}]}, {"index": 3445, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:21", "text": "وَ عَنْهُ رَفَعَهُ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ عَلَّمَ أَخَاهُ عَبْدَ اللَّهِ بْنَ عَلِيٍّ هَذَا الدُّعَاءَ.\nاللَّهُمَّ ارْفَعْ ظَنِّي صَاعِداً وَ لَا تُطْمِعْ فِيَّ عَدُوّاً وَ لَا حَاسِداً وَ احْفَظْنِي قَائِماً وَ قَاعِداً وَ يَقْظَاناً [يَقْظَانَ] وَ رَاقِداً اللَّهُمَّ اغْفِرْ لِي وَ ارْحَمْنِي وَ اهْدِنِي سَبِيلَكَ الْأَقْوَمَ وَ قِنِي حَرَّ جَهَنَّمَ وَ احْطُطْ عَنِّي الْمَغْرَمَ وَ الْمَأْثَمَ وَ اجْعَلْنِي مِنْ خَيْرِ خِيَارِ الْعَالَمِ", "translations": [{"lang": "en", "name": "hubeali", "text": "And from him, \n(It has been narrated) raising it to Abu Ja’far<sup>asws</sup> that he<sup>asws</sup> taught his brother Abdullah Bin Ali, this supplication: \n‘O Allah<sup>azwj</sup>! Raise my thinking upwards and do not Let them covet me, neither an enemy nor an envying one, and Protect me standing, and sitting, and Wake us up (awake) and sleeping. O Allah<sup>azwj</sup>! Forgive (my sins) for me, and have Mercy on me, and Guide me to Your<sup>azwj</sup> Way, the Straight, and Save me from the heat of Hell, and Shake off the creditors and the sins from me, and Make me to be from the best of choicest of the world’."}]}, {"index": 3446, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:22", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عُثْمَانَ بْنِ عِيسَى وَ هَارُونَ بْنِ خَارِجَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ.\nارْحَمْنِي مِمَّا لَا طَاقَةَ لِي بِهِ وَ لَا صَبْرَ لِي عَلَيْهِ", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin saeed, from Usman Bin Isa and Haroun Bin Kharjat who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying:\n‘Have Mercy on me<sup>asws</sup> from what there is no strength for me with I, nor any patience for me<sup>asws</sup> upon it’."}]}, {"index": 3447, "local_index": 23, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:23", "text": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ ابْنِ سِنَانٍ عَنْ حَفْصٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قُلْتُ لَهُ عَلِّمْنِي دُعَاءً فَقَالَ فَأَيْنَ أَنْتَ عَنْ دُعَاءِ الْإِلْحَاحِ قَالَ قُلْتُ وَ مَا دُعَاءُ الْإِلْحَاحِ \nفَقَالَ اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَ مَا بَيْنَهُنَّ وَ رَبَّ الْعَرْشِ الْعَظِيمِ وَ رَبَّ جَبْرَئِيلَ وَ مِيكَائِيلَ وَ إِسْرَافِيلَ وَ رَبَّ الْقُرْآنِ الْعَظِيمِ وَ رَبَّ مُحَمَّدٍ خَاتَمِ النَّبِيِّينَ إِنِّي أَسْأَلُكَ بِالَّذِي تَقُومُ بِهِ السَّمَاءَ وَ بِهِ تَقُومُ الْأَرْضَ وَ بِهِ تُفَرِّقُ بَيْنَ الْجَمْعِ وَ بِهِ تَجْمَعُ بَيْنَ الْمُتَفَرِّقِ وَ بِهِ تَرْزُقُ الْأَحْيَاءَ وَ بِهِ أَحْصَيْتَ عَدَدَ الرِّمَالِ وَ وَزْنَ الْجِبَالِ وَ كَيْلَ الْبُحُورِ \nثُمَّ تُصَلِّي عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ ثُمَّ تَسْأَلُهُ حَاجَتَكَ وَ أَلِحَّ فِي الطَّلَبِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, fro mIbn Sinan, from Hafs, from Muhammad Bin Muslim who said, \n‘I said to him<sup>asws</sup>, ‘Teach me a supplication’. So he<sup>asws</sup> said: ‘So where are you from the supplication of the urgency?’ I said, ‘And what is the supplication of the urgency?’ \nSo he<sup>asws</sup> said: ‘(say), ‘O Allah<sup>azwj</sup>! Lord<sup>azwj</sup> of the seven skies and what is between these, and Lord<sup>azwj</sup> of the Magnificent Throne, and Lord<sup>azwj</sup> of Jibraeel<sup>as</sup>, and Mikaeel<sup>as</sup>, and Israfeel<sup>as</sup>, and Lord<sup>azwj</sup> of the Magnificent Quran, and Lord<sup>azwj</sup> of Muhammad<sup>saww</sup>, the last of the Prophets<sup>as</sup>! I ask You<sup>azwj</sup> by which You<sup>azwj</sup> are Regulating the sky, and by which You<sup>azwj</sup> are Regulating the earth, and by it You<sup>azwj</sup> are Separating the gathered ones, and by it You<sup>azwj</sup> are Gathering the separated ones; and by it You<sup>azwj</sup> are Sustaining the living beings, and by it You<sup>azwj</sup> are Counting the grains of sand, and the weight of the mountains, and the measurement of the oceans’. \nThen you should send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. Then you should ask Him<sup>azwj</sup> your need, and be insistent in the seeking’."}]}, {"index": 3448, "local_index": 24, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:24", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ كَرَّامٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ كَانَ يَقُولُ \nاللَّهُمَّ امْلَأْ قَلْبِي حُبّاً لَكَ وَ خَشْيَةً مِنْكَ وَ تَصْدِيقاً وَ إِيمَاناً بِكَ وَ فَرَقاً مِنْكَ وَ شَوْقاً إِلَيْكَ يَا ذَا الْجَلَالِ وَ الْإِكْرَامِ\nاللَّهُمَّ حَبِّبْ إِلَيَّ لِقَاءَكَ وَ اجْعَلْ لِي فِي لِقَائِكَ خَيْرَ الرَّحْمَةِ وَ الْبَرَكَةِ وَ أَلْحِقْنِي بِالصَّالِحِينَ وَ لَا تُؤَخِّرْنِي مَعَ الْأَشْرَارِ وَ أَلْحِقْنِي بِصَالِحِ مَنْ مَضَى وَ اجْعَلْنِي مَعَ صَالِحِ مَنْ بَقِيَ وَ خُذْ بِي سَبِيلَ الصَّالِحِينَ وَ أَعِنِّي عَلَى نَفْسِي بِمَا تُعِينُ بِهِ الصَّالِحِينَ عَلَى أَنْفُسِهِمْ وَ لَا تَرُدَّنِي فِي سُوءٍ اسْتَنْقَذْتَنِي مِنْهُ\nيَا رَبَّ الْعَالَمِينَ أَسْأَلُكَ إِيمَاناً لَا أَجَلَ لَهُ دُونَ لِقَائِكَ تُحْيِينِي وَ تُمِيتُنِي عَلَيْهِ وَ تَبْعَثُنِي عَلَيْهِ إِذَا بَعَثْتَنِي وَ ابْرَأْ قَلْبِي مِنَ الرِّيَاءِ وَ السُّمْعَةِ وَ الشَّكِّ فِي دِينِكَ اللَّهُمَّ أَعْطِنِي نَصْراً فِي دِينِكَ وَ قُوَّةً فِي عِبَادَتِكَ وَ فَهْماً فِي خَلْقِكَ وَ كِفْلَيْنِ مِنْ رَحْمَتِكَ وَ بَيِّضْ وَجْهِي بِنُورِكَ وَ اجْعَلْ رَغْبَتِي فِيمَا عِنْدَكَ وَ تَوَفَّنِي فِي سَبِيلِكَ عَلَى مِلَّتِكَ وَ مِلَّةِ رَسُولِكَ\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَ الْهَرَمِ وَ الْجُبْنِ وَ الْبُخْلِ وَ الْغَفْلَةِ وَ الْقَسْوَةِ وَ الْفَتْرَةِ وَ الْمَسْكَنَةِ وَ أَعُوذُ بِكَ يَا رَبِّ مِنْ نَفْسٍ لَا تَشْبَعُ وَ مِنْ قَلْبٍ لَا يَخْشَعُ وَ مِنْ دُعَاءٍ لَا يُسْمَعُ وَ مِنْ صَلَاةٍ لَا تَنْفَعُ وَ أُعِيذُ بِكَ نَفْسِي وَ أَهْلِي وَ ذُرِّيَّتِي مِنَ الشَّيْطَانِ الرَّجِيمِ\nاللَّهُمَّ إِنَّهُ لَا يُجِيرُنِي مِنْكَ أَحَدٌ وَ لَا أَجِدُ مِنْ دُونِكَ مُلْتَحَداً فَلَا تَخْذُلْنِي وَ لَا تُرْدِنِي فِي هَلَكَةٍ وَ لَا تُرِدْنِي بِعَذَابٍ أَسْأَلُكَ الثَّبَاتَ عَلَى دِينِكَ وَ التَّصْدِيقَ بِكِتَابِكَ وَ اتِّبَاعَ رَسُولِكَ اللَّهُمَّ اذْكُرْنِي بِرَحْمَتِكَ وَ لَا تَذْكُرْنِي بِخَطِيئَتِي وَ تَقَبَّلْ مِنِّي وَ زِدْنِي مِنْ فَضْلِكَ إِنِّي إِلَيْكَ رَاغِبٌ\nاللَّهُمَّ اجْعَلْ ثَوَابَ مَنْطِقِي وَ ثَوَابَ مَجْلِسِي رِضَاكَ عَنِّي وَ اجْعَلْ عَمَلِي وَ دُعَائِي خَالِصاً لَكَ وَ اجْعَلْ ثَوَابِيَ الْجَنَّةَ بِرَحْمَتِكَ وَ اجْمَعْ لِي جَمِيعَ مَا سَأَلْتُكَ وَ زِدْنِي مِنْ فَضْلِكَ إِنِّي إِلَيْكَ رَاغِبٌ\nاللَّهُمَّ غَارَتِ النُّجُومُ وَ نَامَتِ الْعُيُونُ وَ أَنْتَ الْحَيُّ الْقَيُّومُ لَا يُوَارِي مِنْكَ لَيْلٌ سَاجٍ وَ لَا سَمَاءٌ ذَاتُ أَبْرَاجٍ وَ لَا أَرْضٌ ذَاتُ مِهَادٍ وَ لَا بَحْرٌ لُجِّيٌّ وَ لَا ظُلُمَاتٌ بَعْضُهَا فَوْقَ بَعْضٍ تُدْلِجُ الرَّحْمَةَ عَلَى مَنْ تَشَاءُ مِنْ خَلْقِكَ تَعْلَمُ خَائِنَةَ الْأَعْيُنِ وَ مَا تُخْفِي الصُّدُورُ\nأَشْهَدُ بِمَا شَهِدْتَ بِهِ عَلَى نَفْسِكَ وَ شَهِدَتْ مَلَائِكَتُكَ وَ أُولُو الْعِلْمِ لَا إِلَهَ إِلَّا أَنْتَ الْعَزِيزُ الْحَكِيمُ وَ مَنْ لَمْ يَشْهَدْ بِمَا شَهِدْتَ بِهِ عَلَى نَفْسِكَ وَ شَهِدَتْ مَلَائِكَتُكَ وَ أُولُو الْعِلْمِ فَاكْتُبْ شَهَادَتِي مَكَانَ شَهَادَتِهِمْ \nاللَّهُمَّ أَنْتَ السَّلَامُ وَ مِنْكَ السَّلَامُ أَسْأَلُكَ يَا ذَا الْجَلَالِ وَ الْإِكْرَامِ أَنْ تَفُكَّ رَقَبَتِي مِنَ النَّارِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Hassan Bin Ali, from Karram, from Ibn Abu Yafour, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, that he<sup>asws</sup> used to recite (the following supplication): \n‘O Allah<sup>azwj</sup>! Fill my heart with love for You<sup>azwj</sup>, and humbleness from You<sup>azwj</sup>, and ratification and <span class=\"iTxt\">Eman</span> in You<sup>azwj</sup>, and distinction from You<sup>azwj</sup>, and desire to You<sup>azwj</sup>, O the One with the Majesty and the Benevolence!\nO Allah<sup>azwj</sup>! Cause me to love meeting You<sup>azwj</sup>, and Make for me, during Your<sup>azwj</sup> meeting, best of the Mercy and the Blessings, and Join me with the righteous ones and do not Delay me with the evil ones, and Join me with the righteous ones of the past and Make me to be with the righteous ones who remain, and Take me to the way of the righteous ones, and Assist me upon myself with what You<sup>azwj</sup> Assisted the righteous ones upon themselves, and do not Repel me to be in evil but You<sup>azwj</sup> would be Rescuing me from it.\nO Lord<sup>azwj</sup> of the worlds! I ask You<sup>azwj</sup> for <span class=\"iTxt\">Eman</span> there being nor reason for it except Meeting You<sup>azwj</sup>, Causing me to live, and Causing me to die upon it, and Resurrecting me upon it when You<sup>azwj</sup> do Resurrect me, and free my heart from the show-off, and to be heard of, and the doubts in Your<sup>azwj</sup> Religion. O Allah<sup>azwj</sup>! Give me victory in Your<sup>azwj</sup> Religion, and strength to be in Your<sup>azwj</sup> worship, and understanding in Your<sup>azwj</sup> creation, and two portion from Your<sup>azwj</sup> Mercy (57:28), and Whiten my face with Your<sup>azwj</sup> <span class=\"iTxt\">Noor</span> (Light), and Make my desire to be in what is with You<sup>azwj</sup>, and Cause me to pass away being in Your<sup>azwj</sup> Way, upon Your<sup>azwj</sup> Religion, and Religion of Your<sup>azwj</sup> Rasool<sup>saww</sup>. \nO Allah<sup>azwj</sup>! I seek Refuge with You<sup>azwj</sup> from the laziness, and the infirmity (of old age), and the cowardice, and the stinginess, and the neglect-fullness, and the cruelness, and the weakness, and the destitution. And I seek Refuge with You<sup>azwj</sup>, O Lord<sup>azwj</sup>, from a self not being satiated, and from a heart not fearing, and from a supplication not being heard, and from a <span class=\"iTxt\">Salāt</span> not being beneficial. And I seek Refuge with You<sup>azwj</sup> for myself<sup>asws</sup>, and my<sup>asws</sup> family, and my<sup>asws</sup> offspring, from the Pelted Satan<sup>la</sup>. \nO Allah<sup>azwj</sup>! It is such that no one can Rescue me from You<sup>azwj</sup>, and I cannot find anyone as a Shelter besides You<sup>azwj</sup>. Therefore, do not Abandon me, and do not Repel me to be in destruction, nor Repel me to be in a Punishment. I ask You<sup>azwj</sup> of the steadfastness upon Your<sup>azwj</sup> Religion, and the ratification of Your<sup>azwj</sup> Book, and following of Your<sup>azwj</sup> Rasool<sup>saww</sup>. O Allah<sup>azwj</sup>! Remember me by Your<sup>azwj</sup> Mercy, and do not Remember me with my mistakes, and Accept from me, and increase for me from Your<sup>azwj</sup> Grace, I am being hopeful to You<sup>azwj</sup>. \nO Allah<sup>azwj</sup>! Make the Reward of my<sup>asws</sup> speaking, and the Reward for my sitting as being Your<sup>azwj</sup> Pleasure from me, and Make my deeds and my supplication to be sincerely for You<sup>azwj</sup>, and Make my Reward to be the Paradise by Your<sup>azwj</sup> Mercy, and Make to be for me the entirety of what I am asking You<sup>azwj</sup> for, and Increase it for me from Your<sup>azwj</sup> Grace, I am being hopeful to You<sup>azwj</sup>.\nO Allah<sup>azwj</sup>! The stars have disappeared, and the eyes are sleeping, and You<sup>azwj</sup> are the Living, the Eternal. Neither is the dark night hidden from You<sup>azwj</sup>, nor is the sky with the constellations, nor the earth with the flatness, nor the unfathomable ocean, nor the darkness on top of each other. You<sup>azwj</sup> Bestow the Mercy upon the one whom You<sup>azwj</sup> so Desire to from Your<sup>azwj</sup> creatures. You<sup>azwj</sup> Know the betrayal of the eyes and what the chests conceal. \nI testify with what You<sup>azwj</sup> Testified with upon Yourself<sup>azwj</sup>, and Your<sup>azwj</sup> Angels testified with, and the ones with the knowledge, that, there is no god except You<sup>azwj</sup>, the Mighty, the Wise; and the ones who do not testify with what You<sup>azwj</sup> Testified with upon Yourself<sup>azwj</sup> and (what) Your<sup>azwj</sup> Angels testified with, and (what) the ones with the knowledge (testified with), so Write my testimony in place of their testimonies. \nO Allah<sup>azwj</sup>! You<sup>azwj</sup> are the (source of) the Peace and from You<sup>azwj</sup> is the Peace. I ask You<sup>azwj</sup>, O One with the Majesty and the Benevolence, that You<sup>azwj</sup> Liberate my neck from the Fire’."}]}, {"index": 3449, "local_index": 25, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:25", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَثْعَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أَبَا ذَرٍّ أَتَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ مَعَهُ جَبْرَئِيلُ ( عليه السلام ) فِي صُورَةِ دِحْيَةَ الْكَلْبِيِّ وَ قَدِ اسْتَخْلَاهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَلَمَّا رَآهُمَا انْصَرَفَ عَنْهُمَا وَ لَمْ يَقْطَعْ كَلَامَهُمَا فَقَالَ جَبْرَئِيلُ ( عليه السلام ) يَا مُحَمَّدُ هَذَا أَبُو ذَرٍّ قَدْ مَرَّ بِنَا وَ لَمْ يُسَلِّمْ عَلَيْنَا أَمَا لَوْ سَلَّمَ لَرَدَدْنَا عَلَيْهِ يَا مُحَمَّدُ إِنَّ لَهُ دُعَاءً يَدْعُو بِهِ مَعْرُوفاً عِنْدَ أَهْلِ السَّمَاءِ فَسَلْهُ عَنْهُ إِذَا عَرَجْتُ إِلَى السَّمَاءِ \nفَلَمَّا ارْتَفَعَ جَبْرَئِيلُ جَاءَ أَبُو ذَرٍّ إِلَى النَّبِيِّ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا مَنَعَكَ يَا أَبَا ذَرٍّ أَنْ تَكُونَ سَلَّمْتَ عَلَيْنَا حِينَ مَرَرْتَ بِنَا فَقَالَ ظَنَنْتُ يَا رَسُولَ اللَّهِ أَنَّ الَّذِي كَانَ مَعَكَ دِحْيَةُ الْكَلْبِيُّ قَدِ اسْتَخْلَيْتَهُ لِبَعْضِ شَأْنِكَ فَقَالَ ذَاكَ جَبْرَئِيلُ ( عليه السلام ) يَا أَبَا ذَرٍّ وَ قَدْ قَالَ أَمَا لَوْ سَلَّمَ عَلَيْنَا لَرَدَدْنَا عَلَيْهِ\nفَلَمَّا عَلِمَ أَبُو ذَرٍّ أَنَّهُ كَانَ جَبْرَئِيلَ ( عليه السلام ) دَخَلَهُ مِنَ النَّدَامَةِ حَيْثُ لَمْ يُسَلِّمْ عَلَيْهِ مَا شَاءَ اللَّهُ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا هَذَا الدُّعَاءُ الَّذِي تَدْعُو بِهِ فَقَدْ أَخْبَرَنِي جَبْرَئِيلُ ( عليه السلام ) أَنَّ لَكَ دُعَاءً تَدْعُو بِهِ مَعْرُوفاً فِي السَّمَاءِ \nفَقَالَ نَعَمْ يَا رَسُولَ اللَّهِ أَقُولُ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ الْأَمْنَ وَ الْإِيمَانَ بِكَ وَ التَّصْدِيقَ بِنَبِيِّكَ وَ الْعَافِيَةَ مِنْ جَمِيعِ الْبَلَاءِ وَ الشُّكْرَ عَلَى الْعَافِيَةِ وَ الْغِنَى عَنْ شِرَارِ النَّاسِ", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Muhammad Bin Yahya Al Khas’amy, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abu Zarr<sup>ra</sup> came over to the Prophet<sup>saww</sup>, and with him<sup>saww</sup> was Jibraeel<sup>as</sup> in the image of Dihyat Al Kalby (name of a man), and Rasool-Allah<sup>saww</sup> had isolated with him<sup>as</sup>. So when he (Abu Zarr<sup>ra</sup>) saw them<sup>asws</sup>, he<sup>ra</sup> turned away from the two of them<sup>asws</sup>, and did not cut off their<sup>asws</sup> conversation. So Jibraeel<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! This is Abu Zarr<sup>ra</sup> who has passed by us<sup>asws</sup> and did not greet upon us<sup>asws</sup>. But, had he<sup>ra</sup> greeted, we<sup>asws</sup> would have returned the greeting upon him<sup>ra</sup>. O Muhammad<sup>saww</sup>! For him<sup>ra</sup> there is a supplication he<sup>ra</sup> tends to supplicate with which is well-known among the inhabitants of the sky, therefore ask him<sup>ra</sup> about it, when I<sup>ra</sup> ascend to the sky’. \nSo when Jibraeel<sup>as</sup> ascended, Abu Zarr<sup>ra</sup> came over to the Prophet<sup>saww</sup>. So Rasool-Allah<sup>saww</sup> said to him<sup>as</sup>: ‘What prevented you<sup>ra</sup>, O Abu Zarr<sup>ra</sup>, from greeting upon us<sup>asws</sup> when you<sup>ra</sup> passed by us<sup>asws</sup>?’ So he<sup>ra</sup> said: ‘I<sup>ra</sup> thought, O Rasool-Allah<sup>saww</sup>, that who was with you<sup>saww</sup>, Dihiyat Al-Kalby, you<sup>saww</sup> had isolated with him for one of your<sup>saww</sup> matters’. So he<sup>saww</sup> said: ‘That was Jibraeel<sup>as</sup>, O Abu Zarr<sup>ra</sup>, and he<sup>as</sup> said: ‘But, had he<sup>ra</sup> greeted, we<sup>asws</sup> would have returned the greeting upon him<sup>ra</sup>’. \nSo when Abu Zarr<sup>ra</sup> came to know that it was Jibraeel<sup>as</sup>, regret entered upon him<sup>ra</sup> why he<sup>ra</sup> did not greet upon him<sup>as</sup>, for as long as Allah<sup>azwj</sup> so Desired. So Rasool-Allah<sup>saww</sup> said to him: ‘What is this supplication which you<sup>ra</sup> tend to supplicate with, for Jibraeel<sup>as</sup> informed me<sup>saww</sup> that there is a supplication with you<sup>ra</sup>, which you<sup>as</sup> tend to supplicate with which is well-known in the sky?’ \nSo he<sup>ra</sup> said: ‘Yes, O Rasool-Allah<sup>saww</sup>! I<sup>ra</sup> say, \n‘O Allah<sup>azwj</sup>! I<sup>as</sup> ask You<sup>azwj</sup> for the safety and the <span class=\"iTxt\">Eman</span> in You<sup>azwj</sup>, and the ratification with Your<sup>azwj</sup> Prophet<sup>saww</sup>, and the well-being from the entirety of the affliction, and the gratefulness upon the well-being, and the needlessness from the evil people’."}]}, {"index": 3450, "local_index": 26, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:26", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي حَمْزَةَ قَالَ أَخَذْتُ هَذَا الدُّعَاءَ عَنْ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ عَلِيٍّ ( عليه السلام ) قَالَ وَ كَانَ أَبُو جَعْفَرٍ يُسَمِّيهِ الْجَامِعَ\nبِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ آمَنْتُ بِاللَّهِ وَ بِجَمِيعِ رُسُلِهِ وَ بِجَمِيعِ مَا أَنْزَلَ بِهِ عَلَى جَمِيعِ الرُّسُلِ وَ أَنَّ وَعْدَ اللَّهِ حَقٌّ وَ لِقَاءَهُ حَقٌّ وَ صَدَقَ اللَّهُ وَ بَلَّغَ الْمُرْسَلُونَ\nوَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَ سُبْحَانَ اللَّهِ كُلَّمَا سَبَّحَ اللَّهَ شَيْ‏ءٌ وَ كَمَا يُحِبُّ اللَّهُ أَنْ يُسَبَّحَ وَ الْحَمْدُ لِلَّهِ كُلَّمَا حَمِدَ اللَّهَ شَيْ‏ءٌ وَ كَمَا يُحِبُّ اللَّهُ أَنْ يُحْمَدَ وَ لَا إِلَهَ إِلَّا اللَّهُ كُلَّمَا هَلَّلَ اللَّهَ شَيْ‏ءٌ وَ كَمَا يُحِبُّ اللَّهُ أَنْ يُهَلَّلَ وَ اللَّهُ أَكْبَرُ كُلَّمَا كَبَّرَ اللَّهَ شَيْ‏ءٌ وَ كَمَا يُحِبُّ اللَّهُ أَنْ يُكَبَّرَ\nاللَّهُمَّ إِنِّي أَسْأَلُكَ مَفَاتِيحَ الْخَيْرِ وَ خَوَاتِيمَهُ وَ سَوَابِغَهُ وَ فَوَائِدَهُ وَ بَرَكَاتِهِ وَ مَا بَلَغَ عِلْمَهُ عِلْمِي وَ مَا قَصَرَ عَنْ إِحْصَائِهِ حِفْظِي اللَّهُمَّ انْهَجْ إِلَيَّ أَسْبَابَ مَعْرِفَتِهِ وَ افْتَحْ لِي أَبْوَابَهُ وَ غَشِّنِي بِبَرَكَاتِ رَحْمَتِكَ وَ مُنَّ عَلَيَّ بِعِصْمَةٍ عَنِ الْإِزَالَةِ عَنْ دِينِكَ\nوَ طَهِّرْ قَلْبِي مِنَ الشَّكِّ وَ لَا تَشْغَلْ قَلْبِي بِدُنْيَايَ وَ عَاجِلِ مَعَاشِي عَنْ آجِلِ ثَوَابِ آخِرَتِي وَ اشْغَلْ قَلْبِي بِحِفْظِ مَا لَا تَقْبَلُ مِنِّي جَهْلَهُ وَ ذَلِّلْ لِكُلِّ خَيْرٍ لِسَانِي وَ طَهِّرْ قَلْبِي مِنَ الرِّيَاءِ وَ لَا تُجْرِهِ فِي مَفَاصِلِي وَ اجْعَلْ عَمَلِي خَالِصاً لَكَ\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشَّرِّ وَ أَنْوَاعِ الْفَوَاحِشِ كُلِّهَا ظَاهِرِهَا وَ بَاطِنِهَا وَ غَفَلَاتِهَا وَ جَمِيعِ مَا يُرِيدُنِي بِهِ الشَّيْطَانُ الرَّجِيمُ وَ مَا يُرِيدُنِي بِهِ السُّلْطَانُ الْعَنِيدُ مِمَّا أَحَطْتَ بِعِلْمِهِ وَ أَنْتَ الْقَادِرُ عَلَى صَرْفِهِ عَنِّي\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ طَوَارِقِ الْجِنِّ وَ الْإِنْسِ وَ زَوَابِعِهِمْ وَ بَوَائِقِهِمْ وَ مَكَايِدِهِمْ وَ مَشَاهِدِ الْفَسَقَةِ مِنَ الْجِنِّ وَ الْإِنْسِ وَ أَنْ أُسْتَزَلَّ عَنْ دِينِي فَتَفْسُدَ عَلَيَّ آخِرَتِي وَ أَنْ يَكُونَ ذَلِكَ مِنْهُمْ ضَرَراً عَلَيَّ فِي مَعَاشِي أَوْ يَعْرِضُ بَلَاءٌ يُصِيبُنِي مِنْهُمْ لَا قُوَّةَ لِي بِهِ وَ لَا صَبْرَ لِي عَلَى احْتِمَالِهِ\nفَلَا تَبْتَلِنِي يَا إِلَهِي بِمُقَاسَاتِهِ فَيَمْنَعَنِي ذَلِكَ عَنْ ذِكْرِكَ وَ يَشْغَلَنِي عَنْ عِبَادَتِكَ أَنْتَ الْعَاصِمُ الْمَانِعُ الدَّافِعُ الْوَاقِي مِنْ ذَلِكَ كُلِّهِ أَسْأَلُكَ اللَّهُمَّ الرَّفَاهِيَةَ فِي مَعِيشَتِي مَا أَبْقَيْتَنِي مَعِيشَةً أَقْوَى بِهَا عَلَى طَاعَتِكَ وَ أَبْلُغُ بِهَا رِضْوَانَكَ وَ أَصِيرُ بِهَا إِلَى دَارِ الْحَيَوَانِ غَداً\nوَ لَا تَرْزُقْنِي رِزْقاً يُطْغِينِي وَ لَا تَبْتَلِنِي بِفَقْرٍ أَشْقَى بِهِ مُضَيَّقاً عَلَيَّ أَعْطِنِي حَظّاً وَافِراً فِي آخِرَتِي وَ مَعَاشاً وَاسِعاً هَنِيئاً مَرِيئاً فِي دُنْيَايَ وَ لَا تَجْعَلِ الدُّنْيَا عَلَيَّ سِجْناً وَ لَا تَجْعَلْ فِرَاقَهَا عَلَيَّ حُزْناً أَجِرْنِي مِنْ فِتْنَتِهَا وَ اجْعَلْ عَمَلِي فِيهَا مَقْبُولًا وَ سَعْيِي فِيهَا مَشْكُوراً\nاللَّهُمَّ وَ مَنْ أَرَادَنِي بِسُوءٍ فَأَرِدْهُ بِمِثْلِهِ وَ مَنْ كَادَنِي فِيهَا فَكِدْهُ وَ اصْرِفْ عَنِّي هَمَّ مَنْ أَدْخَلَ عَلَيَّ هَمَّهُ وَ امْكُرْ بِمَنْ مَكَرَ بِي فَإِنَّكَ خَيْرُ الْمَاكِرِينَ وَ افْقَأْ عَنِّي عُيُونَ الْكَفَرَةِ الظَّلَمَةِ وَ الطُّغَاةِ وَ الْحَسَدَةِ \nاللَّهُمَّ وَ أَنْزِلْ عَلَيَّ مِنْكَ السَّكِينَةَ وَ أَلْبِسْنِي دِرْعَكَ الْحَصِينَةَ وَ احْفَظْنِي بِسِتْرِكَ الْوَاقِي وَ جَلِّلْنِي عَافِيَتَكَ النَّافِعَةَ وَ صَدِّقْ قَوْلِي وَ فَعَالِي وَ بَارِكْ لِي فِي وُلْدِي وَ أَهْلِي وَ مَالِي \nاللَّهُمَّ مَا قَدَّمْتُ وَ مَا أَخَّرْتُ وَ مَا أَغْفَلْتُ وَ مَا تَعَمَّدْتُ وَ مَا تَوَانَيْتُ وَ مَا أَعْلَنْتُ وَ مَا أَسْرَرْتُ فَاغْفِرْهُ لِي يَا أَرْحَمَ الرَّاحِمِينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ibn Mahboub, from Hisham Bin Salim, \n(It has been narrated) from Abu Hamza who said, ‘I took this supplication from Abu Ja’far<sup>asws</sup> Muhammad Bin Ali<sup>asws</sup>, and Abu Ja’far<sup>asws</sup> used to call it, ‘The Comprehensive’.\nIn the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. I testify that there is no god except Allah<sup>azwj</sup>, Alone, there being no associate for Him<sup>azwj</sup>. And I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>. I believe in Allah<sup>azwj</sup> and in the entirety of His<sup>azwj</sup> Rasool<sup>as</sup>, and in the entirety of what He<sup>azwj</sup> Revealed with upon the entirety of the Rasools<sup>as</sup>, and that the Promise of Allah<sup>azwj</sup> is True, and His<sup>azwj</sup> Meeting is True, and Allah<sup>azwj</sup> Spoke the Truth and the Mursil Prophets<sup>as</sup> delivered (the Message). \nAnd the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds, and Glory be to Allah<sup>azwj</sup> every time something Glorifies Allah<sup>azwj</sup>, and just as Allah<sup>azwj</sup> Loves that He<sup>azwj</sup> be Glorified. And the Praise is for Allah<sup>azwj</sup> every time something praises Him<sup>azwj</sup>, and just as He<sup>azwj</sup> Loves that He<sup>azwj</sup> be Glorifed. And there is no god except Allah<sup>azwj</sup> every time something Extols the Oneness of Allah<sup>azwj</sup>, and just as Allah<sup>azwj</sup> Loves that He<sup>azwj</sup> be Extolled. And Allah<sup>azwj</sup> is the Greatest, every time something exclaims the Greatness of Allah<sup>azwj</sup> and just as Allah<sup>azwj</sup> Loves that His<sup>azwj</sup> Greatness be exclaimed. \nO Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> for the opening of the goodness, and for its completion, and for its pleasures, and its benefits, and I Blessings, and what my knowledge reaches it, and what my memory falls short of its counting. O Allah<sup>azwj</sup>! Draw closer to me the causes for its recognition, and Open its doors for me, and Overwhelm me with the Blessings of Your<sup>azwj</sup> Mercy, and Bestow upon me the infallibility from the decline from Your<sup>azwj</sup> Religion. \nAnd Purify my heart from the doubts, and do not Let my heart be pre-occupied with my world and my immediate life from the deferred Rewards of my Hereafter, and Pre-occupy my heart with the preservation of what is not Acceptable from me from being ignorant of it, and Humble my tongue for every goodness, and Purify my heart from the showing off, and do not Cause it (showing off) to flow in my joints, and Make my deeds to be sincerely for You<sup>azwj</sup>. \nO Allah<sup>azwj</sup>! I seek Refuge with You<sup>azwj</sup> from the evil and the varieties of the immoralities, all of them, its apparent ones and its hidden ones, and its neglectful ones, and the entirety of what the Pelted Satan<sup>la</sup> intends me with, and what the obstinate ruling authorities intend me with from what his knowledge encompasses, and You<sup>azwj</sup> are Able upon Exchanging it from me. \nO Allah<sup>azwj</sup>! I seek Refuge with You<sup>azwj</sup> from the ways of the Jinn and the human beings, and their furies, and their noisy disputes, and their plots, and facing the mischief from the Jinn and the human beings and that they would waver me from my Religion so they would spoil my Hereafter upon me, and that would happen to be harmful upon me during my life-time, or they would present an affliction to hit me from them, there neither being any strength for me with it nor patience for me upon bearing it. \nTherefore, do not Try me, O my God, with its sizes so that would prevent me from remembering You<sup>azwj</sup> and pre-occupy me from worshipping You<sup>azwj</sup>. You<sup>azwj</sup> are the Rescuer, the Defender, the Repeller, the Saver from all of that. I ask You<sup>azwj</sup>, O Allah<sup>azwj</sup>, for the ease in my living for what remains of my life-time, I can strengthen by being upon Your<sup>azwj</sup> obedience, and reach Your<sup>azwj</sup> Pleasure by it, and by it I can come to the House of (eternal) living tomorrow. \nAnd do not Grace me with such a sustenance which would cause me to transgress, and nor Try me with poverty which I would be miserable with, being constrained upon me. Give me an abundant share in my Hereafter, and a capacious living, welcoming, pleasant in my world, and do not Make the world to be a prison upon me, nor Making its separation upon me to be a grief. Rescue me from its strife and Make my deeds therein to be Acceptable, and my striving in it to be grateful.\nO Allah<sup>azwj</sup>! And the one who intends evil with me, Return it to him with the like of it, and the one who plots against me therein, so Plot (against) him, and Exchange from me its worries from entering upon me, and Plan against the one who plans against me, for You<sup>azwj</sup> are the Best of the planners, and Blind from me the eyes of the disbelievers, and the oppressors, and the arrogant ones, and the envious ones.\nO Allah<sup>azwj</sup>! And Send down the tranquillity upon me, from You<sup>azwj</sup>, and Clothe me with Your<sup>azwj</sup> Fortified Shield, and Protect me with Your<sup>azwj</sup> Defensive Veil, and Wrap me with Your<sup>azwj</sup> goodly beneficial health, and Ratify my words and my deeds, and Bless for me regarding my children, and my family, and my wealth. \nO Allah<sup>azwj</sup>! Whatever I have sent forward, and whatever I have delayed, and whatever I neglected, and whatever I deliberated, and whatever I slackened, and whatever I (did) publicly, and whatever I (did) privately, so Forgive it for me, O Most Merciful of the merciful ones!’’."}]}, {"index": 3451, "local_index": 27, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:27", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلِ اللَّهُمَّ أَوْسِعْ عَلَيَّ فِي رِزْقِي وَ امْدُدْ لِي فِي عُمُرِي وَ اغْفِرْ لِي ذَنْبِي وَ اجْعَلْنِي مِمَّنْ تَنْتَصِرُ بِهِ لِدِينِكَ وَ لَا تَسْتَبْدِلْ بِي غَيْرِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Say, ‘O Allah<sup>azwj</sup>! Expand upon me regarding my sustenance, and Extend to me regarding my life-span, and Forgive my sins for me, and Make me to be from the one whom You<sup>azwj</sup> would be Helping Your<sup>azwj</sup> Religion with’’."}]}, {"index": 3452, "local_index": 28, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:28", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ كَانَ يَقُولُ يَا مَنْ يَشْكُرُ الْيَسِيرَ وَ يَعْفُو عَنِ الْكَثِيرِ وَ هُوَ الْغَفُورُ الرَّحِيمُ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي ذَهَبَتْ لَذَّتُهَا وَ بَقِيَتْ تَبِعَتُهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Yaqoub Bin Shuayb, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, that he<sup>asws</sup> was saying: ‘O the One Who Thanks for the less, and Forgives from the more, and He<sup>azwj</sup> is the Forgiving, the Merciful. Forgive my sins for me whose pleasure has (already) gone, and there remains its consequence’’."}]}, {"index": 3453, "local_index": 29, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:29", "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ مِنْ دُعَائِهِ يَقُولُ يَا نُورُ يَا قُدُّوسُ يَا أَوَّلَ الْأَوَّلِينَ وَ يَا آخِرَ الْآخِرِينَ يَا رَحْمَانُ يَا رَحِيمُ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُغَيِّرُ النِّعَمَ وَ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُحِلُّ النِّقَمَ وَ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تَهْتِكُ الْعِصَمَ وَ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُنْزِلُ الْبَلَاءَ وَ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُدِيلُ الْأَعْدَاءَ وَ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُعَجِّلُ الْفَنَاءَ وَ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تَقْطَعُ الرَّجَاءَ وَ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تُظْلِمُ الْهَوَاءَ وَ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تَكْشِفُ الْغِطَاءَ وَ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تَرُدُّ الدُّعَاءَ وَ اغْفِرْ لِيَ الذُّنُوبَ الَّتِي تَرُدُّ غَيْثَ السَّمَاءِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by this chain, from Yaqoub Bin Shuayb, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said: ‘It was from his<sup>asws</sup> supplications, that he<sup>asws</sup> was saying: ‘O Light! O Holy! O First of the foremost ones and O Last of the latter ones! O Beneficent! O Merciful! Forgive for me the sins which change the Bounties, and Forgive for me the sins which bring down the calamities, and Forgive for me the sins which rupture the defences, and Forgive for me the sins which bring down the afflictions, and Forgive for me the sins which assist the enemies, and Forgive for me the sins which hasten the perishing, and Forgive for me the sins which cut-off the hopes, and Forgive for me the sins which darken the atmosphere, and Forgive for me the sins which uncover the cover, and Forgive for me the sins which repel the supplications, and Forgive for me the sins which repel the rains of the sky’’."}]}, {"index": 3454, "local_index": 30, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:30", "text": "عَنْهُ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَا عُدَّتِي فِي كُرْبَتِي وَ يَا صَاحِبِي فِي شِدَّتِي وَ يَا وَلِيِّي فِي نِعْمَتِي وَ يَا غِيَاثِي فِي رَغْبَتِي \nقَالَ وَ كَانَ مِنْ دُعَاءِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) اللَّهُمَّ كَتَبْتَ الْآثَارَ وَ عَلِمْتَ الْأَخْبَارَ وَ اطَّلَعْتَ عَلَى الْأَسْرَارِ فَحُلْتَ بَيْنَنَا وَ بَيْنَ الْقُلُوبِ فَالسِّرُّ عِنْدَكَ عَلَانِيَةٌ وَ الْقُلُوبُ إِلَيْكَ مُفْضَاةٌ وَ إِنَّمَا أَمْرُكَ لِشَيْ‏ءٍ إِذَا أَرَدْتَهُ أَنْ تَقُولَ لَهُ كُنْ فَيَكُونُ \nفَقُلْ بِرَحْمَتِكَ لِطَاعَتِكَ أَنْ تَدْخُلَ فِي كُلِّ عُضْوٍ مِنْ أَعْضَائِي وَ لَا تُفَارِقَنِي حَتَّى أَلْقَاكَ وَ قُلْ بِرَحْمَتِكَ لِمَعْصِيَتِكَ أَنْ تَخْرُجَ مِنْ كُلِّ عُضْوٍ مِنْ أَعْضَائِي فَلَا تَقْرَبَنِي حَتَّى أَلْقَاكَ وَ ارْزُقْنِي مِنَ الدُّنْيَا وَ زَهِّدْنِي فِيهَا وَ لَا تَزْوِهَا عَنِّي وَ رَغْبَتِي فِيهَا يَا رَحْمَانُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Muhammad Bin Sinan, from Yaoub Bin Shuayb, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘O my<sup>asws</sup> Aider during my<sup>asws</sup> complains, and my<sup>asws</sup> Companions during my<sup>asws</sup> difficulties, and O my<sup>asws</sup> Guardian in my<sup>asws</sup> Bounties, and O my<sup>asws</sup> Helper during my<sup>asws</sup> wishes!’. \nHe<sup>asws</sup> said: ‘And it was from the supplications of Amir Al-Momineen<sup>asws</sup>: ‘(Say), ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> Write down the impacts, and Know the information, and are Notified upon the secrets. You<sup>azwj</sup> are Situated between us and the hearts, therefore the secret with You<sup>azwj</sup> is open, and the hearts are broken up to You<sup>azwj</sup>, and rather Your<sup>azwj</sup> Command for something when You<sup>azwj</sup> Intend it is that You<sup>azwj</sup> are Saying to it: “Be”, so it comes into being. \nSo, Say with Your<sup>azwj</sup> Mercy to Your<sup>azwj</sup> obedience to enter into every part of my body parts, and not to separate from me until I meet You<sup>azwj</sup>. And Say with Your<sup>azwj</sup> Mercy to Your<sup>azwj</sup> disobedience that it should exit from every part of my body parts, so it would not come near me until I meet You<sup>azwj</sup>; and Grace me from the world, and Cause me to be ascetic therein, and not to impede me and my wishes therein, O Beneficent!’’."}]}, {"index": 3455, "local_index": 31, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:31", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَيَابَةَ قَالَ أَعْطَانِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَذَا الدُّعَاءَ \nالْحَمْدُ لِلَّهِ وَلِيِّ الْحَمْدِ وَ أَهْلِهِ وَ مُنْتَهَاهُ وَ مَحَلِّهِ أَخْلَصَ مَنْ وَحَّدَهُ وَ اهْتَدَى مَنْ عَبَدَهُ وَ فَازَ مَنْ أَطَاعَهُ وَ أَمِنَ الْمُعْتَصِمُ بِهِ\nاللَّهُمَّ يَا ذَا الْجُودِ وَ الْمَجْدِ وَ الثَّنَاءِ الْجَمِيلِ وَ الْحَمْدِ أَسْأَلُكَ مَسْأَلَةَ مَنْ خَضَعَ لَكَ بِرَقَبَتِهِ وَ رَغِمَ لَكَ أَنْفُهُ وَ عَفَّرَ لَكَ وَجْهَهُ وَ ذَلَّلَ لَكَ نَفْسَهُ وَ فَاضَتْ مِنْ خَوْفِكَ دُمُوعُهُ وَ تَرَدَّدَتْ عَبْرَتُهُ وَ اعْتَرَفَ لَكَ بِذُنُوبِهِ وَ فَضَحَتْهُ عِنْدَكَ خَطِيئَتُهُ وَ شَانَتْهُ عِنْدَكَ جَرِيرَتُهُ وَ ضَعُفَتْ عِنْدَ ذَلِكَ قُوَّتُهُ وَ قَلَّتْ حِيلَتُهُ وَ انْقَطَعَتْ عَنْهُ أَسْبَابُ خَدَائِعِهِ وَ اضْمَحَلَّ عَنْهُ كُلُّ بَاطِلٍ وَ أَلْجَأَتْهُ ذُنُوبُهُ إِلَى ذُلِّ مَقَامِهِ بَيْنَ يَدَيْكَ وَ خُضُوعِهِ لَدَيْكَ وَ ابْتِهَالِهِ إِلَيْكَ \nأَسْأَلُكَ اللَّهُمَّ سُؤَالَ مَنْ هُوَ بِمَنْزِلَتِهِ أَرْغَبُ إِلَيْكَ كَرَغْبَتِهِ وَ أَتَضَرَّعُ إِلَيْكَ كَتَضَرُّعِهِ وَ أَبْتَهِلُ إِلَيْكَ كَأَشَدِّ ابْتِهَالِهِ اللَّهُمَّ فَارْحَمِ اسْتِكَانَةَ مَنْطِقِي وَ ذُلَّ مَقَامِي وَ مَجْلِسِي وَ خُضُوعِي إِلَيْكَ بِرَقَبَتِي أَسْأَلُكَ اللَّهُمَّ الْهُدَى مِنَ الضَّلَالَةِ وَ الْبَصِيرَةَ مِنَ الْعَمَى وَ الرُّشْدَ مِنَ الْغَوَايَةِ\nوَ أَسْأَلُكَ اللَّهُمَّ أَكْثَرَ الْحَمْدِ عِنْدَ الرَّخَاءِ وَ أَجْمَلَ الصَّبْرِ عِنْدَ الْمُصِيبَةِ وَ أَفْضَلَ الشُّكْرِ عِنْدَ مَوْضِعِ الشُّكْرِ وَ التَّسْلِيمَ عِنْدَ الشُّبُهَاتِ وَ أَسْأَلُكَ الْقُوَّةَ فِي طَاعَتِكَ وَ الضَّعْفَ عَنْ مَعْصِيَتِكَ وَ الْهَرَبَ إِلَيْكَ مِنْكَ وَ التَّقَرُّبَ إِلَيْكَ رَبِّ لِتَرْضَى وَ التَّحَرِّيَ لِكُلِّ مَا يُرْضِيكَ عَنِّي فِي إِسْخَاطِ خَلْقِكَ الْتِمَاساً لِرِضَاكَ\nرَبِّ مَنْ أَرْجُوهُ إِنْ لَمْ تَرْحَمْنِي أَوْ مَنْ يَعُودُ عَلَيَّ إِنْ أَقْصَيْتَنِي أَوْ مَنْ يَنْفَعُنِي عَفْوُهُ إِنْ عَاقَبْتَنِي أَوْ مَنْ آمُلُ عَطَايَاهُ إِنْ حَرَمْتَنِي أَوْ مَنْ يَمْلِكُ كَرَامَتِي إِنْ أَهَنْتَنِي أَوْ مَنْ يَضُرُّنِي هَوَانُهُ إِنْ أَكْرَمْتَنِي\nرَبِّ مَا أَسْوَأَ فِعْلِي وَ أَقْبَحَ عَمَلِي وَ أَقْسَى قَلْبِي وَ أَطْوَلَ أَمَلِي وَ أَقْصَرَ أَجَلِي وَ أَجْرَأَنِي عَلَى عِصْيَانِ مَنْ خَلَقَنِي\nرَبِّ وَ مَا أَحْسَنَ بَلَاءَكَ عِنْدِي وَ أَظْهَرَ نَعْمَاءَكَ عَلَيَّ كَثُرَتْ عَلَيَّ مِنْكَ النِّعَمُ فَمَا أُحْصِيهَا وَ قَلَّ مِنِّيَ الشُّكْرُ فِيمَا أَوْلَيْتَنِيهِ فَبَطِرْتُ بِالنِّعَمِ وَ تَعَرَّضْتُ لِلنِّقَمِ وَ سَهَوْتُ عَنِ الذِّكْرِ وَ رَكِبْتُ الْجَهْلَ بَعْدَ الْعِلْمِ وَ جُزْتُ مِنَ الْعَدْلِ إِلَى الظُّلْمِ وَ جَاوَزْتُ الْبِرَّ إِلَى الْإِثْمِ وَ صِرْتُ إِلَى الْهَرَبِ مِنَ الْخَوْفِ وَ الْحُزْنِ \nفَمَا أَصْغَرَ حَسَنَاتِي وَ أَقَلَّهَا فِي كَثْرَةِ ذُنُوبِي وَ مَا أَكْثَرَ ذُنُوبِي وَ أَعْظَمَهَا عَلَى قَدْرِ صِغَرِ خَلْقِي وَ ضَعْفِ رُكْنِي\nرَبِّ وَ مَا أَطْوَلَ أَمَلِي فِي قِصَرِ أَجَلِي وَ أَقْصَرَ أَجَلِي فِي بُعْدِ أَمَلِي وَ مَا أَقْبَحَ سَرِيرَتِي وَ عَلَانِيَتِي\nرَبِّ لَا حُجَّةَ لِي إِنِ احْتَجَجْتُ وَ لَا عُذْرَ لِي إِنِ اعْتَذَرْتُ وَ لَا شُكْرَ عِنْدِي إِنِ ابْتُلِيتُ وَ أُولِيتُ إِنْ لَمْ تُعِنِّي عَلَى شُكْرِ مَا أُولِيتُ\nرَبِّ مَا أَخَفَّ مِيزَانِي غَداً إِنْ لَمْ تُرَجِّحْهُ وَ أَزَلَّ لِسَانِي إِنْ لَمْ تُثَبِّتْهُ وَ أَسْوَدَ وَجْهِي إِنْ لَمْ تُبَيِّضْهُ \nرَبِّ كَيْفَ لِي بِذُنُوبِيَ الَّتِي سَلَفَتْ مِنِّي قَدْ هَدَّتْ لَهَا أَرْكَانِي\nرَبِّ كَيْفَ أَطْلُبُ شَهَوَاتِ الدُّنْيَا وَ أَبْكِي عَلَى خَيْبَتِي فِيهَا وَ لَا أَبْكِي وَ تَشْتَدُّ حَسَرَاتِي عَلَى عِصْيَانِي وَ تَفْرِيطِي\nرَبِّ دَعَتْنِي دَوَاعِي الدُّنْيَا فَأَجَبْتُهَا سَرِيعاً وَ رَكَنْتُ إِلَيْهَا طَائِعاً وَ دَعَتْنِي دَوَاعِي الْآخِرَةِ فَتَثَبَّطْتُ عَنْهَا وَ أَبْطَأْتُ فِي الْإِجَابَةِ وَ الْمُسَارَعَةِ إِلَيْهَا كَمَا سَارَعْتُ إِلَى دَوَاعِي الدُّنْيَا وَ حُطَامِهَا الْهَامِدِ وَ هَشِيمِهَا الْبَائِدِ وَ سَرَابِهَا الذَّاهِبِ \nرَبِّ خَوَّفْتَنِي وَ شَوَّقْتَنِي وَ احْتَجَجْتَ عَلَيَّ بِرِقِّي وَ كَفَلْتَ لِي بِرِزْقِي فَأَمِنْتُ مِنْ خَوْفِكَ وَ تَثَبَّطْتُ عَنْ تَشْوِيقِكَ وَ لَمْ أَتَّكِلْ عَلَى ضَمَانِكَ وَ تَهَاوَنْتُ بِاحْتِجَاجِكَ\nاللَّهُمَّ فَاجْعَلْ أَمْنِي مِنْكَ فِي هَذِهِ الدُّنْيَا خَوْفاً وَ حَوِّلْ تَثَبُّطِي شَوْقاً وَ تَهَاوُنِي بِحُجَّتِكَ فَرَقاً مِنْكَ ثُمَّ رَضِّنِي بِمَا قَسَمْتَ لِي مِنْ رِزْقِكَ\nيَا كَرِيمُ يَا كَرِيمُ أَسْأَلُكَ بِاسْمِكَ الْعَظِيمِ رِضَاكَ عِنْدَ السَّخْطَةِ وَ الْفَرْجَةَ عِنْدَ الْكُرْبَةِ وَ النُّورَ عِنْدَ الظُّلْمَةِ وَ الْبَصِيرَةَ عِنْدَ تَشَبُّهِ الْفِتْنَةِ\nرَبِّ اجْعَلْ جُنَّتِي مِنْ خَطَايَايَ حَصِينَةً وَ دَرَجَاتِي فِي الْجِنَانِ رَفِيعَةً وَ أَعْمَالِي كُلَّهَا مُتَقَبَّلَةً وَ حَسَنَاتِي مُضَاعَفَةً زَاكِيَةً وَ أَعُوذُ بِكَ مِنَ الْفِتَنِ كُلِّهَا مَا ظَهَرَ مِنْهَا وَ مَا بَطَنَ وَ مِنْ رَفِيعِ المَطْعَمِ وَ الْمَشْرَبِ وَ مِنْ شَرِّ مَا أَعْلَمُ وَ مِنْ شَرِّ مَا لَا أَعْلَمُ وَ أَعُوذُ بِكَ مِنْ أَنْ أَشْتَرِيَ الْجَهْلَ بِالْعِلْمِ وَ الْجَفَاءَ بِالْحِلْمِ وَ الْجَوْرَ بِالْعَدْلِ وَ الْقَطِيعَةَ بِالْبِرِّ وَ الْجَزَعَ بِالصَّبْرِ وَ الْهُدَى بِالضَّلَالَةِ وَ الْكُفْرَ بِالْإِيمَانِ .\nابْنُ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ أَنَّهُ ذَكَرَ أَيْضاً مِثْلَهُ وَ ذَكَرَ أَنَّهُ دُعَاءُ عَلِيِّ بْنِ الْحُسَيْنِ ( صلوات الله عليه )  وَ زَادَ فِي آخِرِهِ آمِينَ رَبَّ الْعَالَمِينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Al A’ala Bin Razeyn, from Abdul Rahman Bin Sayaba who said, \n‘Abu Abdullah<sup>asws</sup> gave me this supplication: \n‘The Praise is for Allah<sup>azwj</sup> the Sovereign of the Praise, and its Rightful, and its End-point, and its (rightful) Place. He (became) sincere, the one who professed His<sup>azwj</sup> Oneness, and Guided was the one who worshipped Him<sup>azwj</sup>, and successful was the one who obeyed Him<sup>azwj</sup>, and secured was the one who attached himself with Him<sup>azwj</sup>. \nO Allah<sup>azwj</sup>! O One with the Benevolence, and the Glory, and the Laudation, and the Beauty, and the Praise! I ask You<sup>azwj</sup> by a (manner of) asking of the one who has humbled to You<sup>azwj</sup> with his neck, and rubbed his nose (in the ground) for You<sup>azwj</sup>, and covered his face (in dust) for You<sup>azwj</sup>, and disgraced himself to You<sup>azwj</sup>, and his tears flowed from Your<sup>azwj</sup> fear, and repeatedly was his crying, and acknowledged to You<sup>azwj</sup> of his sins, and exposed his mistakes in Your<sup>azwj</sup> Presence, and reflected his audacity in Your<sup>azwj</sup> Presence, and his strength weakend during that in Your<sup>azwj</sup> Presence, and scarce were his strategies, and the reasons of his deception were cut off from him, and every falsehood has wasted away from him, and his sins have compelled him to a lowly place in front of You<sup>azwj</sup>, and his humbleness to You<sup>azwj</sup>, and his invocation to You<sup>azwj</sup>. \nI ask You<sup>azwj</sup>, O Allah<sup>azwj</sup>, a (manner of) asking of the one who is at his status of wishing to You<sup>azwj</sup> like his desire and is desperate to You<sup>azwj</sup> like his desperation, and is invoking to You<sup>azwj</sup> with intense invocation. O Allah<sup>azwj</sup>! Have Mercy on the complacency of my speaking, and the lowliness of my position and my sitting, and by humbleness to You<sup>azwj</sup> with my neck. I ask You<sup>azwj</sup>, O Allah<sup>azwj</sup>, for the Guidance from the straying, and the insight from the blindness, and the righteous Guidance from the temptations. \nAnd I ask You<sup>azwj</sup> for the frequency of the Praise during the prosperity and the beautiful patience during the difficulties, and the best gratefulness during the place of the thankfulness, and the submission during the confusioin. And I ask You<sup>azwj</sup> for the strength in obeying You<sup>azwj</sup>, and the weakness from disobeying You<sup>azwj</sup>, and the fleeing towards You<sup>azwj</sup> from You<sup>azwj</sup>, and the nearness to You<sup>azwj</sup> Lord<sup>azwj</sup>, in order for me to be pleased and investigate for everything what would Please You<sup>azwj</sup> from me in agering Your<sup>azwj</sup> creatures seeking Your<sup>azwj</sup> Pleasure. \nLord<sup>azwj</sup>! Whom can I hope to if You<sup>azwj</sup> do not have Mercy on me, or who would be cordial upon me if You<sup>azwj</sup> were to Exclude me, or whose pardon would benefit me if You<sup>azwj</sup> were to Punish me, or whose gifts can I have expectancy for if You<sup>azwj</sup> were to Deprive me, or who could control my prestige if You<sup>azwj</sup> were to Degrade me, or whose degradation would harm me if You<sup>azwj</sup> were to Honour me.\nLord<sup>azwj</sup>! How evil are my deeds, and how ugly are my deeds, and how harsh is my heart, and how long-term are my works and how short is my term (life-span), and these have made me to be audacious upon disobeying the One<sup>azwj</sup> Who Created me.\nLord<sup>azwj</sup>! And how good is Your<sup>azwj</sup> affliction with me, and the manifestation of Your<sup>azwj</sup> Bounties upon me. Abundant upon me are the the Bounties from You<sup>azwj</sup>, and I cannot (even) count them, and the gratefulness from me is little regarding what I have been Given, so I was exulted with the Bounties and exposed myself to the afflictions, and forgot from the Remembrance, and rode the ignorance after having the knowledge, and panicked from the justice to the oppression, and exceeded the righteousness to the sinning, and came to be in the fleeing from the fear and the grief.\nSo how small are my good deeds and its scarcity regarding the abundance of my sinning, and how more are my sins and grievous upon the measurement of the smallness of my stature, and weakness of my limbs. \nLord<sup>azwj</sup>! And how long-term are my works during the shortness of my term (life-span), and short is my term regarding the remoteness of (the completion) of my workds, and how ugly is my secretive deeds and my public ones. \nLord<sup>azwj</sup>! There is no argument (left) for me that I can argue with, nor is there any excuse for me that I can offer as an excuse, nor is there any gratefulness with me if I were to be Tried and Given if You<sup>azwj</sup> do not Assist upon the thanking of what I have been Given.\nLord<sup>azwj</sup>! How light would be my scale tomorrow if You<sup>azwj</sup> do not Toggle it (in my favour), and how wavering is my tongue if You<sup>azwj</sup> do not Affirm it, and how black is my face if You<sup>azwj</sup> do not Whiten it. \nLord<sup>azwj</sup>! How would it be for me with my sins which have have been commited in the past from me, that have crushed my limbs?\nLord<sup>azwj</sup>! How can I seek the lustful desires of the world and cry upon my defeat regarding (achieving) these, and I do not cry while my regrets have intensified upon my disobedience and my audciousness? \nLord<sup>azwj</sup>! The temptations of the world invited me, so I responded to these quickly and turned towards these willingly, and the temptations of the Hereafter invited me, so I stayed steadfastedly away from these and was complacent in the response and being quick towards these, just as I had quickly gone to the temptations of the world and its lifeless debris, and its transitory vanities, and its disappearing mirages.\nLord<sup>azwj</sup>! You<sup>azwj</sup> Frightened me, and Argued against me of my slavery, and Guaranteed for me with my sustenance, but I felt safe from Your<sup>azwj</sup> fear, and remained steadfast from Your Encouragement and did not rely upon Your<sup>azwj</sup> Guarantee and took lightly with Your<sup>azwj</sup> Arguments.\nO Allah<sup>azwj</sup>! Hasten my security from You<sup>azwj</sup> in this world from the fear and horrors which have demoralized my desires and made me take lightly with Your<sup>azwj</sup> Arguments separating from You<sup>azwj</sup>, then (Please Help) me with what You<sup>azwj</sup> have Apportioned for me from Your<sup>azwj</sup> sustenance.\nO Benevolent! O Benevolent! I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Magnificent Name, of Your<sup>azwj</sup> Pleasure during the anger, and the relief dueing the worries, and the Light during the darkness, and the insight during the confusion of the strife.\nLord<sup style=\"font-weight: normal\">azwj</sup>! Make my shield to be fortified from my mistakes, and my Levels in the Gardens to be elevated, and my works, all of them, as being Acceptable, and my good deeds to be multiplied, purifying. And I seek Refuge with You<sup style=\"font-weight: normal\">azwj</sup> from the strife, all of them, what is apparent from it and what is hidden, and from the lifting of the foods and the drinks, and from the evil of what I know and from the evil of what I do not know. And I seek Refuge with You<sup style=\"font-weight: normal\">azwj</sup> from buying the ignorance with the knowledge, and the disloyalty with the forbearance, and the tyranny with the justice, and the cutting off of relationships with the righteousness, and the panic with the patience, and the Guidance with the straying, and the disbelief with the <span class=\"iTxt\">Eman</span>’’. \nIbn Mahboub, from Jameel Bin Salih, that he mentioned as well (a Hadeeth) similar to it, and mentioned that is it a supplication of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and there was an increase at the end of it of, ‘Ameen, Lord<sup>azwj</sup> of the worlds’’."}]}, {"index": 3456, "local_index": 32, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:32", "text": "ابْنُ مَحْبُوبٍ قَالَ حَدَّثَنَا نُوحٌ أَبُو الْيَقْظَانِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ ادْعُ بِهَذَا الدُّعَاءِ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي لَا تُنَالُ مِنْكَ إِلَّا بِرِضَاكَ وَ الْخُرُوجَ مِنْ جَمِيعِ مَعَاصِيكَ وَ الدُّخُولَ فِي كُلِّ مَا يُرْضِيكَ وَ النَّجَاةَ مِنْ كُلِّ وَرْطَةٍ وَ الْمَخْرَجَ مِنْ كُلِّ كَبِيرَةٍ أَتَى بِهَا مِنِّي عَمْدٌ أَوْ زَلَّ بِهَا مِنِّي خَطَأٌ أَوْ خَطَرَ بِهَا عَلَيَّ خَطَرَاتُ الشَّيْطَانِ \nأَسْأَلُكَ خَوْفاً تُوقِفُنِي بِهِ عَلَى حُدُودِ رِضَاكَ وَ تَشْعَبُ بِهِ عَنِّي كُلَّ شَهْوَةٍ خَطَرَ بِهَا هَوَايَ وَ اسْتَزَلَّ بِهَا رَأْيِي لِيُجَاوِزَ حَدَّ حَلَالِكَ\nأَسْأَلُكَ اللَّهُمَّ الْأَخْذَ بِأَحْسَنِ مَا تَعْلَمُ وَ تَرْكَ سَيِّئِ كُلِّ مَا تَعْلَمُ أَوْ أَخْطَأُ مِنْ حَيْثُ لَا أَعْلَمُ أَوْ مِنْ حَيْثُ أَعْلَمُ\nأَسْأَلُكَ السَّعَةَ فِي الرِّزْقِ وَ الزُّهْدَ فِي الْكَفَافِ وَ الْمَخْرَجَ بِالْبَيَانِ مِنْ كُلِّ شُبْهَةٍ وَ الصَّوَابَ فِي كُلِّ حُجَّةٍ وَ الصِّدْقَ فِي جَمِيعِ الْمَوَاطِنِ وَ إِنْصَافَ النَّاسِ مِنْ نَفْسِي فِيمَا عَلَيَّ وَ لِي وَ التَّذَلُّلَ فِي إِعْطَاءِ النَّصَفِ مِنْ جَمِيعِ مَوَاطِنِ السَّخَطِ وَ الرِّضَا وَ تَرْكَ قَلِيلِ الْبَغْيِ وَ كَثِيرِهِ فِي الْقَوْلِ مِنِّي وَ الْفِعْلِ وَ تَمَامَ نِعْمَتِكَ فِي جَمِيعِ الْأَشْيَاءِ وَ الشُّكْرَ لَكَ عَلَيْهَا لِكَيْ تَرْضَى وَ بَعْدَ الرِّضَا\nوَ أَسْأَلُكَ الْخِيَرَةَ فِي كُلِّ مَا يَكُونُ فِيهِ الْخِيَرَةُ بِمَيْسُورِ الْأُمُورِ كُلِّهَا لَا بِمَعْسُورِهَا يَا كَرِيمُ يَا كَرِيمُ يَا كَرِيمُ وَ افْتَحْ لِي بَابَ الْأَمْرِ الَّذِي فِيهِ الْعَافِيَةُ وَ الْفَرَجُ وَ افْتَحْ لِي بَابَهُ وَ يَسِّرْ لِي مَخْرَجَهُ\nوَ مَنْ قَدَّرْتَ لَهُ عَلَيَّ مَقْدُرَةً مِنْ خَلْقِكَ فَخُذْ عَنِّي بِسَمْعِهِ وَ بَصَرِهِ وَ لِسَانِهِ وَ يَدِهِ وَ خُذْهُ عَنْ يَمِينِهِ وَ عَنْ يَسَارِهِ وَ مِنْ خَلْفِهِ وَ مِنْ قُدَّامِهِ وَ امْنَعْهُ أَنْ يَصِلَ إِلَيَّ بِسُوءٍ\nعَزَّ جَارُكَ وَ جَلَّ ثَنَاءُ وَجْهِكَ وَ لَا إِلَهَ غَيْرُكَ أَنْتَ رَبِّي وَ أَنَا عَبْدُكَ\nاللَّهُمَّ أَنْتَ رَجَائِي فِي كُلِّ كُرْبَةٍ وَ أَنْتَ ثِقَتِي فِي كُلِّ شِدَّةٍ وَ أَنْتَ لِي فِي كُلِّ أَمْرٍ نَزَلَ بِي ثِقَةٌ وَ عُدَّةٌ فَكَمْ مِنْ كَرْبٍ يَضْعُفُ عَنْهُ الْفُؤَادُ وَ تَقِلُّ فِيهِ الْحِيلَةُ وَ يَشْمَتُ فِيهِ الْعَدُوُّ وَ تَعْيَا فِيهِ الْأُمُورُ \nأَنْزَلْتُهُ بِكَ وَ شَكَوْتُهُ إِلَيْكَ رَاغِباً إِلَيْكَ فِيهِ عَمَّنْ سِوَاكَ قَدْ فَرَّجْتَهُ وَ كَفَيْتَهُ فَأَنْتَ وَلِيُّ كُلِّ نِعْمَةٍ وَ صَاحِبُ كُلِّ حَاجَةٍ وَ مُنْتَهَى كُلِّ رَغْبَةٍ فَلَكَ الْحَمْدُ كَثِيراً وَ لَكَ الْمَنُّ فَاضِلًا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ibn Mahboub said, ‘Nuh Abu Al Yaqzan narrated to us, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Supplicate with this supplication, ‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Mercy which cannot be attained from You<sup>azwj</sup> except by Your<sup>azwj</sup> Pleasure, and the exiting from the entirety of Your<sup>azwj</sup> disobedience, and the entering into every thing what Pleases You<sup>azwj</sup>, and the salvation from every predicament, and the exiting from every major sin indulged in by me deliberately, or an error by me as a mistake, or there was a faltering with it upon by by the insinuations of the Satan<sup>la</sup>’. \nI ask You<sup>azwj</sup> for the fear which I could stop with upon the limits of Your<sup>azwj</sup> Pleasure, and I can diverge by it from every lustful desire insinuated by my desires, and my opinions would falter by it to exceed the Limit if Your<sup>azwj</sup> Permissibles. \nI ask You<sup>azwj</sup>, O Allah<sup>azwj</sup>, for my taking with the good deeds what You<sup>azwj</sup> Know of and neglecting of my evil deeds all of which You<sup>azwj</sup> Know of, or my mistakes from where I do not (even) know of, or from where I do know of.\nI ask You<sup>azwj</sup> of the Expansion in the sustenance, and the ascetism in the subsistence, and the coming out from every confusion by the clarity, and the correctness in every argument, and the truthfulness in the entirety of the places, and being fair with the people from myself regarding whatever is against me or for me, and the subservience in the giving of the justice from the entirety of the situations, the anger and the pleasures, and neglecting the lesser rebellions and its more, in the words from me and the deeds, and the completion of Your<sup>azwj</sup> Bounties in the entirety of the things, and the thanking to You<sup>azwj</sup> upon it, perhaps You<sup>azwj</sup> would be Pleased, and after the Pleasure (as well).\nAnd I ask You<sup>azwj</sup> of the goodness during everythin what is to happen wherein is the goodness with the easy matters, all of them, not by its difficult ones. O Benevilent! O Benevolent! O Benevolent! And Open a door of the matter for me in which is the good health, and the relief; and Open its door for me, and Ease its exit for me.\nAnd the one from Your<sup>azwj</sup> creatures for whom You<sup>azwj</sup> have Empowered upon me, so Seize him from me by his hearing, and his sight, and his tongue, and his hands, and Seize him from his right, and from his left, and from behind him, and from his front, and Prevent him from arriving to me with evil.  \nMighty is Your<sup>azwj</sup> Vicinity, and Majestic is Your<sup>azwj</sup> Laudation of Your<sup>azwj</sup> Face, and there is no God apart from You<sup>azwj</sup> my Lord<sup>azwj</sup>, and I am Your<sup>azwj</sup> servant. \nO Allah<sup>azwj</sup>! You<sup>azwj</sup> are my hope in every distress, and You<sup>azwj</sup> are my reliance in every difficulty, and You<sup>azwj</sup> are a Reliable one and One can count upon during every matter which descends with me. So how many worries has my heart been weakend from, and the strategies were scarce with regards to it, and the enemies gloated regarding it, and the matters exhausted me during it. \nI present them with You<sup>azwj</sup> and complain of it to You<sup>azwj</sup>, hoping to You<sup>azwj</sup> regarding it from the ones besides You<sup>azwj</sup>, so You<sup>azwj</sup> Relieve it and Suffice for it, for You<sup>azwj</sup> are the Guardian of every Bounty, and Owner of every need, and End-point of every wish. So for You<sup>azwj</sup> is the abundant Praise, and for You<sup>azwj</sup> is the (Giving of) extra Favours’."}]}, {"index": 3457, "local_index": 33, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:33", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ قُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ قَوْلَ التَّوَّابِينَ وَ عَمَلَهُمْ وَ نُورَ الْأَنْبِيَاءِ وَ صِدْقَهُمْ وَ نَجَاةَ الْمُجَاهِدِينَ وَ ثَوَابَهُمْ وَ شُكْرَ الْمُصْطَفَيْنَ وَ نَصِيحَتَهُمْ وَ عَمَلَ الذَّاكِرِينَ وَ يَقِينَهُمْ وَ إِيمَانَ الْعُلَمَاءِ وَ فِقْهَهُمْ وَ تَعَبُّدَ الْخَاشِعِينَ وَ تَوَاضُعَهُمْ وَ حُكْمَ الْفُقَهَاءِ وَ سِيرَتَهُمْ وَ خَشْيَةَ الْمُتَّقِينَ وَ رَغْبَتَهُمْ وَ تَصْدِيقَ الْمُؤْمِنِينَ وَ تَوَكُّلَهُمْ وَ رَجَاءَ الْمُحْسِنِينَ وَ بِرَّهُمْ\nاللَّهُمَّ إِنِّي أَسْأَلُكَ ثَوَابَ الشَّاكِرِينَ وَ مَنْزِلَةَ الْمُقَرَّبِينَ وَ مُرَافَقَةَ النَّبِيِّينَ\nاللَّهُمَّ إِنِّي أَسْأَلُكَ خَوْفَ الْعَامِلِينَ لَكَ وَ عَمَلَ الْخَائِفِينَ مِنْكَ وَ خُشُوعَ الْعَابِدِينَ لَكَ وَ يَقِينَ الْمُتَوَكِّلِينَ عَلَيْكَ وَ تَوَكُّلَ الْمُؤْمِنِينَ بِكَ\nاللَّهُمَّ إِنَّكَ بِحَاجَتِي عَالِمٌ غَيْرُ مُعَلَّمٍ وَ أَنْتَ لَهَا وَاسِعٌ غَيْرُ مُتَكَلِّفٍ وَ أَنْتَ الَّذِي لَا يُحْفِيكَ سَائِلٌ وَ لَا يَنْقُصُكَ نَائِلٌ وَ لَا يَبْلُغُ مِدْحَتَكَ قَوْلُ قَائِلٍ أَنْتَ كَمَا تَقُولُ وَ فَوْقَ مَا نَقُولُ \nاللَّهُمَّ اجْعَلْ لِي فَرَجاً قَرِيباً وَ أَجْراً عَظِيماً وَ سِتْراً جَمِيلًا اللَّهُمَّ إِنَّكَ تَعْلَمُ أَنِّي عَلَى ظُلْمِي لِنَفْسِي وَ إِسْرَافِي عَلَيْهَا لَمْ أَتَّخِذْ لَكَ ضِدّاً وَ لَا نِدّاً وَ لَا صَاحِبَةً وَ لَا وَلَداً\nيَا مَنْ لَا تُغَلِّطُهُ الْمَسَائِلُ يَا مَنْ لَا يَشْغَلُهُ شَيْ‏ءٌ عَنْ شَيْ‏ءٍ وَ لَا سَمْعٌ عَنْ سَمْعٍ وَ لَا بَصَرٌ عَنْ بَصَرٍ وَ لَا يُبْرِمُهُ إِلْحَاحُ الْمُلِحِّينَ أَسْأَلُكَ أَنْ تُفَرِّجَ عَنِّي فِي سَاعَتِي هَذِهِ مِنْ حَيْثُ أَحْتَسِبُ وَ مِنْ حَيْثُ لَا أَحْتَسِبُ إِنَّكَ تُحْيِي الْعِظَامَ وَ هِيَ رَمِيمٌ وَ إِنَّكَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ \nيَا مَنْ قَلَّ شُكْرِي لَهُ فَلَمْ يَحْرِمْنِي وَ عَظُمَتْ خَطِيئَتِي فَلَمْ يَفْضَحْنِي وَ رَآنِي عَلَى الْمَعَاصِي فَلَمْ يَجْبَهْنِي وَ خَلَقَنِي لِلَّذِي خَلَقَنِي لَهُ فَصَنَعْتُ غَيْرَ الَّذِي خَلَقَنِي لَهُ فَنِعْمَ الْمَوْلَى أَنْتَ يَا سَيِّدِي وَ بِئْسَ الْعَبْدُ أَنَا وَجَدْتَنِي وَ نِعْمَ الطَّالِبُ أَنْتَ رَبِّي وَ بِئْسَ الْمَطْلُوبُ أَنَا أَلْفَيْتَنِي عَبْدُكَ وَ ابْنُ عَبْدِكَ وَ ابْنُ أَمَتِكَ بَيْنَ يَدَيْكَ مَا شِئْتَ صَنَعْتَ بِيَ \nاللَّهُمَّ هَدَأَتِ الْأَصْوَاتُ وَ سَكَنَتِ الْحَرَكَاتُ وَ خَلَا كُلُّ حَبِيبٍ بِحَبِيبِهِ وَ خَلَوْتُ بِكَ أَنْتَ الْمَحْبُوبُ إِلَيَّ فَاجْعَلْ خَلْوَتِي مِنْكَ اللَّيْلَةَ الْعِتْقَ مِنَ النَّارِ\nيَا مَنْ لَيْسَتْ لِعَالِمٍ فَوْقَهُ صِفَةٌ يَا مَنْ لَيْسَ لِمَخْلُوقٍ دُونَهُ مَنَعَةٌ يَا أَوَّلَ قَبْلَ كُلِّ شَيْ‏ءٍ وَ يَا آخِرَ بَعْدَ كُلِّ شَيْ‏ءٍ يَا مَنْ لَيْسَ لَهُ عُنْصُرٌ وَ يَا مَنْ لَيْسَ لآِخِرِهِ فَنَاءٌ وَ يَا أَكْمَلَ مَنْعُوتٍ وَ يَا أَسْمَحَ الْمُعْطِينَ وَ يَا مَنْ يَفْقَهُ بِكُلِّ لُغَةٍ يُدْعَى بِهَا وَ يَا مَنْ عَفْوُهُ قَدِيمٌ وَ بَطْشُهُ شَدِيدٌ وَ مُلْكُهُ مُسْتَقِيمٌ \nأَسْأَلُكَ بِاسْمِكَ الَّذِي شَافَهْتَ بِهِ مُوسَى يَا اللَّهُ يَا رَحْمَانُ يَا رَحِيمُ يَا لَا إِلَهَ إِلَّا أَنْتَ اللَّهُمَّ أَنْتَ الصَّمَدُ أَسْأَلُكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَنْ تُدْخِلَنِيَ الْجَنَّةَ بِرَحْمَتِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Mansour Bin Yunus, from Abu Baseer, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Say, ‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> for the words of the repentants and their deeds, and Light of the Prophets<sup>as</sup> and their<sup>as</sup> truthfulness, and the salvation of the Mujahideen (soldiers) and their Rewards, and the gratefulness of the Chosen ones and their advice, and the deeds of the <span class=\"iTxt\">Zakireen</span> (Oft-mentioners of Allah<sup>azwj</sup>) and their conviction, and <span class=\"iTxt\">Eman</span> of the scholar and their understanding, and the worship of the fearful ones and their humbleness, and wisdom of the jurists and their ways, and fear of the pious ones and their wishes, and the ratification of the Momineen and their reliance (upon Allah<sup>azwj</sup>), and hopes of the good doers and their righteousness. \nO Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> for the Rewards of the grateful ones, and the status of the ones of Proximity, and the friendship of the Prophets<sup>as</sup>. \nO Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> for the fear of the workers for You<sup>azwj</sup>, and the deeds of the ones fearful from You<sup>azwj</sup>, and the humbleness of the worshippers to You<sup>azwj</sup>, and the conviction of the ones relying upon You<sup>azwj</sup>, and the reliance of the Momineen with You<sup>azwj</sup>.\nO Allah<sup>azwj</sup>! You<sup>azwj</sup> are Knowing of my needs without these being made known, and You<sup>azwj</sup> are Capacious for these without any encumberance, and You<sup>azwj</sup> are such that no beggar can Exhaust You<sup>azwj</sup>, and not attainer can reduce You<sup>azwj</sup> (of Your<sup>azwj</sup> resources), and no word of a speaker can reach Your<sup>azwj</sup> (Rightful) Praise. You<sup>azwj</sup> are just as You<sup>azwj</sup> are Saying, and above what we are saying.\nO Allah<sup>azwj</sup>! Make a relief for me to be close-by, and a great Recompense, and a beautiful Veiling. O Allah<sup>azwj</sup>! You<sup>azwj</sup> Know that I am upon doing injustice to myself, and my extravagance upon it. I have neither taken to be for You<sup>azwj</sup>, an opposite, nor a match, nor a female companion nor a son. \nO the One Whom the questions do make Him<sup>azwj</sup> to err! O the One Whom nothing can pre-occupy from anything, nor a hearing from Hearing, nor a sight from Seeing, nor does the insistence of the insisting ones Tire Him<sup>azwj</sup>. I Ask You<sup>azwj</sup> that You<sup>azwj</sup> Relieve from me during this time of mine, from where I an expecting and from where I am not expecting. You<sup>azwj</sup> will Revive the bones when they are dust, and You are Able upon every thing.\nO the One Who received little thanks of mine but did not Deprive me, and grievous were my sins but did not Expose me, and Saw me to be upon the disobedience but did not Confront me, and Created me for which I was Created for, but I did other than what I was Created for. So the Best Master are You<sup>azwj</sup>, O my Master, and the most evil worshipper am I. You<sup>azwj</sup> Found me and the Best Seeker are You<sup>azwj</sup>my Lord<sup>azwj</sup> and the most evil of the sought ones am I, as You<sup>azwj</sup> Know me, I am Your<sup>azwj</sup> servant, and son of Your<sup>azwj</sup> servant, and son of Your<sup>azwj</sup> maid, in front of You<sup>azwj</sup>. Do whatever You<sup>azwj</sup> so Desire to with me.\nO Allah<sup>azwj</sup>! The voices have subsided, and the movements have settled, and every beloved is alone with his beloved, and You<sup>azwj</sup> are Alone with me. You<sup>azwj</sup> are the Beloved to me, therefore Make my being Alone with You<sup>azwj</sup> at night to be an <span class=\"iTxt\">Eman</span>cipation from the Fire. \nO the One Who, there is none above Him<sup>azwj</sup> to describe for the Knowledge! O the One Who, there is no Defender for the creatures besides Him<sup>azwj</sup>! O the First One before everything, and O the last One after everything! O the One Who there are no ingredients for Him<sup>azwj</sup>! O the One Who there is no perishing for His<sup>azwj</sup> End, and O the One of Complete Attributes, and O Pardoner of the obeying ones, and O the One Who Surpasses with every language supplicated with, and O the One Whose Pardoning is ancient, and His<sup>azwj</sup> Grip is intense, and His<sup>azwj</sup> Kingdom is straight. \nI ask You<sup>azwj</sup> by Your<sup>azwj</sup> Name Which You<sup>azwj</sup> Faced Musa<sup>as</sup> with, O Allah<sup>azwj</sup>, O Beneficent, O Merciful! There is no god except You<sup>azwj</sup>. O Allah<sup>azwj</sup>! You<sup>azwj</sup> are the Last. I ask You<sup>azwj</sup> that You<sup>azwj</sup> Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and that You<sup>azwj</sup> Enter me into the Paradise by Your<sup>azwj</sup> Mercy’."}]}, {"index": 3458, "local_index": 34, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:34", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ يُونُسَ قَالَ قُلْتُ لِلرِّضَا ( عليه السلام ) عَلِّمْنِي دُعَاءً وَ أَوْجِزْ فَقَالَ قُلْ يَا مَنْ دَلَّنِي عَلَى نَفْسِهِ وَ ذَلَّلَ قَلْبِي بِتَصْدِيقِهِ أَسْأَلُكَ الْأَمْنَ وَ الْإِيمَانَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Al Waleed, from Yunus who said, \n‘I said to Al-Reza<sup>asws</sup>, ‘Teach me a supplication and be brief’. So he<sup>asws</sup> said: ‘Say, ‘O One<sup>azwj</sup> Who Pointed me to Himself<sup>saww</sup> and Humbled my heart with ratifying Him<sup>azwj</sup>! I ask You<sup>azwj</sup> for the safety and the <span class=\"iTxt\">Eman</span>’’."}]}, {"index": 3459, "local_index": 35, "part_type": "Hadith", "path": "/books/al-kafi:2:2:60:35", "text": "عَلِيُّ بْنُ أَبِي حَمْزَةَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلًا أَتَى أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ كَانَ لِي مَالٌ وَرِثْتُهُ وَ لَمْ أُنْفِقْ مِنْهُ دِرْهَماً فِي طَاعَةِ اللَّهِ عَزَّ وَ جَلَّ ثُمَّ اكْتَسَبْتُ مِنْهُ مَالًا فَلَمْ أُنْفِقْ مِنْهُ دِرْهَماً فِي طَاعَةِ اللَّهِ فَعَلِّمْنِي دُعَاءً يُخْلِفُ عَلَيَّ مَا مَضَى وَ يَغْفِرُ لِي مَا عَمِلْتُ أَوْ عَمَلًا أَعْمَلُهُ \nقَالَ قُلْ قَالَ وَ أَيَّ شَيْ‏ءٍ أَقُولُ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ قُلْ كَمَا أَقُولُ يَا نُورِي فِي كُلِّ ظُلْمَةٍ وَ يَا أُنْسِي فِي كُلِّ وَحْشَةٍ وَ يَا رَجَائِي فِي كُلِّ كُرْبَةٍ وَ يَا ثِقَتِي فِي كُلِّ شِدَّةٍ وَ يَا دَلِيلِي فِي الضَّلَالَةِ أَنْتَ دَلِيلِي إِذَا انْقَطَعَتْ دَلَالَةُ الْأَدِلَّاءِ فَإِنَّ دَلَالَتَكَ لَا تَنْقَطِعُ وَ لَا يَضِلُّ مَنْ هَدَيْتَ\nأَنْعَمْتَ عَلَيَّ فَأَسْبَغْتَ وَ رَزَقْتَنِي فَوَفَّرْتَ وَ غَذَّيْتَنِي فَأَحْسَنْتَ غِذَائِي وَ أَعْطَيْتَنِي فَأَجْزَلْتَ بِلَا اسْتِحْقَاقٍ لِذَلِكَ بِفِعْلٍ مِنِّي وَ لَكِنِ ابْتِدَاءً مِنْكَ لِكَرَمِكَ وَ جُودِكَ\nفَتَقَوَّيْتُ بِكَرَمِكَ عَلَى مَعَاصِيكَ وَ تَقَوَّيْتُ بِرِزْقِكَ عَلَى سَخَطِكَ وَ أَفْنَيْتُ عُمُرِي فِيمَا لَا تُحِبُّ فَلَمْ يَمْنَعْكَ جُرْأَتِي عَلَيْكَ وَ رُكُوبِي لِمَا نَهَيْتَنِي عَنْهُ وَ دُخُولِي فِيمَا حَرَّمْتَ عَلَيَّ أَنْ عُدْتَ عَلَيَّ بِفَضْلِكَ وَ لَمْ يَمْنَعْنِي حِلْمُكَ عَنِّي وَ عَوْدُكَ عَلَيَّ بِفَضْلِكَ أَنْ عُدْتُ فِي مَعَاصِيكَ\nفَأَنْتَ الْعَوَّادُ بِالْفَضْلِ وَ أَنَا الْعَوَّادُ بِالْمَعَاصِي فَيَا أَكْرَمَ مَنْ أُقِرَّ لَهُ بِذَنْبٍ وَ أَعَزَّ مَنْ خُضِعَ لَهُ بِذُلٍّ لِكَرَمِكَ أَقْرَرْتُ بِذَنْبِي وَ لِعِزِّكَ خَضَعْتُ بِذُلِّي فَمَا أَنْتَ صَانِعٌ بِي فِي كَرَمِكَ وَ إِقْرَارِي بِذَنْبِي وَ عِزِّكَ وَ خُضُوعِي بِذُلِّي افْعَلْ بِي مَا أَنْتَ أَهْلُهُ وَ لَا تَفْعَلْ بِي مَا أَنَا أَهْلُهُ", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Hamza, from one of his companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> that a man came over to Amir Al-Momineen<sup>asws</sup> and he said, ‘O Amir Al-Momineen<sup>asws</sup>! There used to be wealth for me. I had inherited it and did not spend a Dirham from it in the obedience of Allah<sup>azwj</sup> Mighty and Majestic. Then I earned wealth from it, but I did not spend Dirham from it in the obedience of Allah<sup>azwj</sup>. So teach me a supplication replacing upon me what is past and He<sup>azwj</sup> would Forgive me what I have done or work that I am doing’. \nHe<sup>asws</sup> said: ‘Say!’ He said, ‘And which thing should I be saying, O Amir Al-Momineen<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Say just as I<sup>asws</sup> am saying: ‘O my Light in every darkness, and O my Comfort in every loneliness, and O my Hope in every distress, and of My Reliance in every difficulty, and O my Direction during the straying! You<sup>azwj</sup> are my Guidance when the guidance of the guides is cut off, for Your<sup>azwj</sup> Guidance doe not  get cut off, nor does he go astray, the one whom You<sup>azwj</sup> Guide. \nYou<sup>azwj</sup> Bestowed upon me, so You<sup>azwj</sup> were Liberal, and You<sup>azwj</sup> Graced me sustenance, so You<sup>azwj</sup> were Ample in provision, and You<sup>azwj</sup> Fed me with excellent of my food, and You Gave to me, so You<sup>azwj</sup> (Chose) the best without me being deserving of that by any deed from me, but Initiated from You<sup>azwj</sup> due to Your<sup>azwj</sup> Benevolence and Your<sup>azwj</sup> generousity. \nThus, I was strengthened upon my disobedience due to Your<sup>azwj</sup> Benevolence, and was strengthened upon Your<sup>azwj</sup> Wrath by Your<sup>azwj</sup> sustenance, and I finished my life regarding what You<sup>azwj</sup> do not Love, but You<sup>azwj</sup> did not Deprive me despite my audacity to You<sup>azwj</sup> and my indulging in what You<sup>azwj</sup> had Forbidden from and my entering into what You<sup>azwj</sup> had Prohibited upon me, You<sup>azwj</sup> (still) Returned upon me with Your<sup>azwj</sup> Grace, and did not Deprive me of Your<sup>azwj</sup> Forbearance from me and Your<sup>azwj</sup> Cordiality upon me with Your<sup>azwj</sup> Grace even when I returned to be in Your<sup>azwj</sup> disobedience. \nSo You<sup>azwj</sup> are the Liberal with the Grace and I am the liberal in my disobedience. So O Benevolent to the one who acknowledges with Him<sup>azwj</sup>, and Honourable to the one who succumbs to Him<sup>azwj</sup> with humiliation to Your<sup>azwj</sup> Benevolence, I hereby acknowledge with my sins and I humble myself to Your<sup>azwj</sup> Might with my humbleness. So whatever You<sup>azwj</sup> Do with me in Your<sup>azwj</sup> Benevolence and my acknowledgement with my sins, and Your<sup>azwj</sup> Mighty and my subservience with my humiliation, Treat me with what You<sup>azwj</sup> are Rightful of and do not Treat with me what I am deserving of’’."}]}]}, "index": "al-kafi:2:2:60", "kind": "verse_list"}