{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/quran:32",
        "titles": {
          "ar": "السجدة",
          "en": "The Prostration",
          "ent": "As-Sajda"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 32,
    "local_index": 32,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/quran:33",
        "titles": {
          "ar": "الأحزاب",
          "en": "The Clans",
          "ent": "Al-Ahzaab"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/quran:31",
        "titles": {
          "ar": "لقمان",
          "en": "Luqman",
          "ent": "Luqman"
        }
      },
      "up": {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      }
    },
    "order": 75,
    "part_type": "Chapter",
    "path": "/books/quran:32",
    "reveal_type": "Meccan",
    "rukus": 3,
    "sajda_type": "obligatory",
    "titles": {
      "ar": "السجدة",
      "en": "The Prostration",
      "ent": "As-Sajda"
    },
    "verse_count": 30,
    "verse_start_index": 3503,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 3504,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:32:1",
        "text": [
          "الم‌"
        ],
        "translations": {
          "en.ahmedali": [
            "ALIF LAM MIM."
          ],
          "en.ahmedraza": [
            "Alif-Lam-Meem. (Alphabets of the Arabic language – Allah and to whomever He reveals, know their precise meanings.)"
          ],
          "en.arberry": [
            "Alif Lam Mim"
          ],
          "en.daryabadi": [
            "Alif. Lam Mim."
          ],
          "en.hilali": [
            "Alif-Lam-Mim. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings.]"
          ],
          "en.itani": [
            "Alif, Lam, Meem."
          ],
          "en.maududi": [
            "Alif. Lam. Mim."
          ],
          "en.mubarakpuri": [
            "Alif Lam Mim."
          ],
          "en.pickthall": [
            "Alif. Lam. Mim"
          ],
          "en.qarai": [
            "Alif, Lam, Meem."
          ],
          "en.qaribullah": [
            "AlifLaamMeem."
          ],
          "en.sahih": [
            "Alif, Lam, Meem."
          ],
          "en.sarwar": [
            "Alif. Lam. Mim."
          ],
          "en.shakir": [
            "Alif Lam Mim."
          ],
          "en.transliteration": [
            "Alifl<u>a</u>mmeem"
          ],
          "en.wahiduddin": [
            "Alif Lam Mim."
          ],
          "en.yusufali": [
            "A. L. M."
          ],
          "fa.ansarian": [
            "الم"
          ],
          "fa.ayati": [
            "الف. لام. ميم."
          ],
          "fa.bahrampour": [
            "الف، لام، ميم"
          ],
          "fa.fooladvand": [
            "الف، لام، ميم."
          ],
          "fa.ghomshei": [
            "الم (از اسرار یا متشابهات یا اشاره به اسماء الهی یا نام این سوره قرآن است)."
          ],
          "fa.khorramdel": [
            "الف. لام. میم. [[«الم»: (نگا: بقره / 1).]]"
          ],
          "fa.khorramshahi": [
            "الم [الف لام میم‌]"
          ],
          "fa.makarem": [
            "الم‌"
          ],
          "fa.moezzi": [
            "الم‌"
          ],
          "fa.mojtabavi": [
            "الف، لام، ميم."
          ],
          "fa.sadeqi": [
            "الم‌"
          ]
        }
      },
      {
        "index": 3505,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:32:2",
        "text": [
          "تَنْزِيلُ‌ الْکِتَابِ‌ لاَ رَيْبَ‌ فِيهِ‌ مِنْ‌ رَبِ‌ الْعَالَمِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "The revelation of this Book free of doubt and involution is from the Lord of all the worlds."
          ],
          "en.ahmedraza": [
            "The revelation of the Book is, without doubt, from the Lord Of The Creation."
          ],
          "en.arberry": [
            "The sending down of the Book, wherein no doubt is, from the Lord of all Being."
          ],
          "en.daryabadi": [
            "Revelation of this Book, whereof there is no doubt, is from the Lord of the Worlds."
          ],
          "en.hilali": [
            "The revelation of the Book (this Quran) is from the Lord of the 'Alamin (mankind, jinns and all that exists) in which there is not doubt!"
          ],
          "en.itani": [
            "The revelation of the Book, without a doubt, is from the Lord of the Universe."
          ],
          "en.maududi": [
            "This Book, beyond all doubt, was revealed by the Lord of the Universe."
          ],
          "en.mubarakpuri": [
            "The revelation of the Book in which there is no doubt, is from the Lord of all that exists."
          ],
          "en.pickthall": [
            "The revelation of the Scripture whereof there is no doubt is from the Lord of the Worlds."
          ],
          "en.qarai": [
            "The [gradual] sending down of the Book, there is no doubt in it, is from the Lord of all the worlds."
          ],
          "en.qaribullah": [
            "The sending down of the Book in which there is no doubt that is from the Lord of the Worlds."
          ],
          "en.sahih": [
            "[This is] the revelation of the Book about which there is no doubt from the Lord of the worlds."
          ],
          "en.sarwar": [
            "There is no doubt that this Book is revealed by the Lord of the Universe."
          ],
          "en.shakir": [
            "The revelation of the Book, there is no doubt in it, is from the Lord of the worlds."
          ],
          "en.transliteration": [
            "Tanzeelu alkit<u>a</u>bi l<u>a</u> rayba feehi min rabbi alAA<u>a</u>lameen<b>a</b>"
          ],
          "en.wahiduddin": [
            "This Book has beyond all doubt been revealed by the Lord of the Universe."
          ],
          "en.yusufali": [
            "(This is) the Revelation of the Book in which there is no doubt,- from the Lord of the Worlds."
          ],
          "fa.ansarian": [
            "نازل کردن این کتاب که هیچ تردیدی در [وحی بودن] آن نیست، از سوی پروردگار جهانیان است."
          ],
          "fa.ayati": [
            "نازل شدن اين كتاب، كه در آن هيچ شكى نيست، از جانب پروردگار جهانيان است."
          ],
          "fa.bahrampour": [
            "فرو فرستادن [اين‌] كتاب، كه هيچ [جاى‌] شكى در آن نيست از طرف پروردگار جهانيان است"
          ],
          "fa.fooladvand": [
            "نازل شدن اين كتاب -كه هيچ [جاى‌] شك در آن نيست- از طرف پروردگار جهانهاست."
          ],
          "fa.ghomshei": [
            "تنزیل این کتاب بزرگ (قرآن) بی هیچ شک از جانب پروردگار عالمیان است."
          ],
          "fa.khorramdel": [
            "(این) کتاب از سوی پروردگار جهانیان نازل شده است و تردیدی در آن نیست (که از سوی خدا فرو فرستاده شده است). [[«تَنزِیلُ الْکِتَابِ»: فرو فرستادن کتاب قرآن. کتاب فرستاده شده. واژه (تنزیل) به معنی مصدری خود، و یا این که به معنی اسم مفعول است و اضافه صفت به موصوف است یا به معنی (مِنْ) است (نگا: شعراء / 192).]]"
          ],
          "fa.khorramshahi": [
            "کتابی است فرو فرستاده و شک در آن نیست [که‌] از سوی پروردگار جهان است‌"
          ],
          "fa.makarem": [
            "این کتابی است که از سوی پروردگار جهانیان نازل شده، و شک و تردیدی در آن نیست!"
          ],
          "fa.moezzi": [
            "فرود آوردن کتاب نیست شکی در آن از پروردگار جهانیان‌"
          ],
          "fa.mojtabavi": [
            "فروفرستادن اين كتاب، كه هيچ شكى در آن نيست، از پروردگار جهانيان است."
          ],
          "fa.sadeqi": [
            "فرو فرستادن تدریجی این کتاب - که هیچ شکی مستند در آن نیست - تنها از طرف پروردگار جهانیان است."
          ]
        }
      },
      {
        "index": 3506,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:32:3",
        "text": [
          "أَمْ‌ يَقُولُونَ‌ افْتَرَاهُ‌ بَلْ‌ هُوَ الْحَقُ‌ مِنْ‌ رَبِّکَ‌ لِتُنْذِرَ قَوْماً مَا أَتَاهُمْ‌ مِنْ‌ نَذِيرٍ مِنْ‌ قَبْلِکَ‌ لَعَلَّهُمْ‌ يَهْتَدُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Or do they say he has fabricated it? In fact, it is the truth from your Lord so that you may warn the people to whom no admonisher was sent before you. They may haply come to guidance."
          ],
          "en.ahmedraza": [
            "What! They dare say that, “He has fabricated it”? In fact it is the Truth from your Lord, in order that you warn a nation towards whom no Herald of Warning came before you, in the hope of their attaining guidance."
          ],
          "en.arberry": [
            "Or do they say, 'He has forged it'? Say: 'Not so; it is the truth from thy Lord that thou mayest warn a people to whom no warner came before thee, that haply so they may be guided."
          ],
          "en.daryabadi": [
            "Will they say: he hath fabricated it? Aye! it is the truth from thy Lord, that thou mayest warn therewith a people unto whom no warner came before thee, that haply they may be guided."
          ],
          "en.hilali": [
            "Or say they: \"He (Muhammad SAW) has fabricated it?\" Nay, it is the truth from your Lord, that you may warn a people to whom no warner has come before you (O Muhammad SAW), in order that they may be guided."
          ],
          "en.itani": [
            "Yet they say, “He made it up.” In fact, it is the Truth from your Lord, to warn a people who received no warner before you, that they may be guided."
          ],
          "en.maududi": [
            "Or do they say: “He has fabricated it?” Nay, it is the Truth from your Lord so that you may warn a people to whom no warner came before you; perhaps they will be guided to the Right Way."
          ],
          "en.mubarakpuri": [
            "Or say they: \"He has fabricated it\" Nay, it is the truth from your Lord, so that you may warn a people to whom no warner has come before you, in order that they may be guided."
          ],
          "en.pickthall": [
            "Or say they: He hath invented it? Nay, but it is the Truth from thy Lord, that thou mayst warn a folk to whom no warner came before thee, that haply they may walk aright."
          ],
          "en.qarai": [
            "But they say, ‘He has fabricated it.’ No, it is the truth from your Lord, that you may warn a people to whom there did not come any warner before you, so that they may be guided [to the right path]."
          ],
          "en.qaribullah": [
            "Or do they say: 'He has forged it himself' Say: 'No, it is the truth from your Lord so that you can warn a nation to whom none has warned before you, in order that they are guided."
          ],
          "en.sahih": [
            "Or do they say, \"He invented it\"? Rather, it is the truth from your Lord, [O Muhammad], that you may warn a people to whom no warner has come before you [so] perhaps they will be guided."
          ],
          "en.sarwar": [
            "Do they say that he, (Muhammad), has invented it? No, it is the truth from your Lord so that you will warn the people who have not received a warning before you. Perhaps they will seek guidance."
          ],
          "en.shakir": [
            "Or do they say: He has forged it? Nay! it is the truth from your Lord that you may warn a people to whom no warner has come before you, that they may follow the right direction."
          ],
          "en.transliteration": [
            "Am yaqooloona iftar<u>a</u>hu bal huwa al<u>h</u>aqqu min rabbika litun<u>th</u>ira qawman m<u>a</u> at<u>a</u>hum min na<u>th</u>eerin min qablika laAAallahum yahtadoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Do they say, \"He has invented it himself.\"? No indeed! It is the truth from your Lord to warn a people to whom, before you, no warner came, so that hopefully they may be rightly guided."
          ],
          "en.yusufali": [
            "Or do they say, \"He has forged it\"? Nay, it is the Truth from thy Lord, that thou mayest admonish a people to whom no warner has come before thee: in order that they may receive guidance."
          ],
          "fa.ansarian": [
            "آیا [مشرکان لجوج] می گویند: [پیامبر] آن را از نزد خود ساخته و پرداخته [و به خدا نسبت داده است؟ چنین نیست] بلکه آن [کتابی] حق و درست است [که] از سوی پروردگارت [نازل شده است]، تا به مردمی که پیش از تو هیچ بیم دهنده ای برای آنان نیامده است بیم دهی تا هدایت یابند."
          ],
          "fa.ayati": [
            "آيا مى‌گويند دروغى است كه خود به هم بافته؟ نه، سخنى است بر حق از جانب پروردگارت، تا مردمى را كه پيش از تو بيم‌دهنده‌اى نداشته‌اند بيم دهى. شايد به راه هدايت افتند."
          ],
          "fa.bahrampour": [
            "آيا مى‌گويند: [محمد] آن را به دروغ ساخته است؟ [نه‌]، بلكه آن حق است و از جانب پروردگار توست، تا مردمى را كه پيش از تو بيم دهنده‌اى برايشان نيامده هشدار دهى، اميد كه هدايت يابند"
          ],
          "fa.fooladvand": [
            "آيا مى‌گويند: «آن را بربافته است»؟ [نه چنين است‌] بلكه آن حقّ و از جانب پروردگار توست، تا مردمى را كه پيش از تو بيم‌دهنده‌اى براى آنان نيامده است هشدار دهى، اميد كه راه يابند."
          ],
          "fa.ghomshei": [
            "بلکه کافران می‌گویند قرآن را او از پیش خود (بی‌مدد وحی خدا) فرابافته. (چنین نیست) بلکه آن به حقّ و راستی از جانب خدا فرستاده شده تا تو قومی را که رسولی پیش از تو به سوی آنان نیامده (از معصیت خدا) بترسانی، باشد که راه هدایت پیش گیرند."
          ],
          "fa.khorramdel": [
            "امّا (مشرکان) می‌گویند: (محمّد) خودش آن را از پیش خود ساخته است (و به دروغ به خدا نسبت داده است). بلکه قرآن (سخن) حقّی است که از سوی پروردگارت (بر تو) نازل شده است تا گروهی را (از خشم خدا) بترسانی که پیش از تو پیغمبری برای آنان نیامده است، شاید هدایت یابند (و به سوی حق رهنمود شوند). [[«أَمْ»: این واژه برای انتقال از کلام پیشین به کلام پسین تازه‌ای است. «مَآ أَتَاهُمْ ... مِن قَبْلِکَ»: مراد از (هُمْ) مخاطبان مشرک عصر نزول قرآن و پیشینیان اقرب ایشان است که از زمان ابراهیم و اسماعیل به بعد، پیغمبری برای آنان نیامده بود و کتابی هم در میانشان نبود که بیانگر قوانین آسمانی باشد. این است که در عصر نزول قرآن 360 بت در کعبه پرستش می‌شد (نگا: قصص / 46، سبأ / 44).]]"
          ],
          "fa.khorramshahi": [
            "یا گویند که آن را برساخته است، نه بلکه حق است و از سوی پروردگار توست تا قومی را که [پیامبری‌] هشداردهنده پیش از تو به سراغشان نیامده بود، بیم‌دهی، باشد که به راه آیند"
          ],
          "fa.makarem": [
            "ولی آنان می‌گویند: «(محمّد) آن را بدروغ به خدا بسته است»، امّا این سخن حقّی است از سوی پروردگارت تا گروهی را انذار کنی که پیش از تو هیچ انذارکننده‌ای برای آنان نیامده است، شاید (پند گیرند و) هدایت شوند!"
          ],
          "fa.moezzi": [
            "یا گویند دروغ بست آن را بلکه آن است حقّ از پروردگارت تا بترسانی گروهی را که نیامدستشان بیم‌دهنده‌ای پیش از تو شاید ایشان رهبری شوند"
          ],
          "fa.mojtabavi": [
            "بلكه مى‌گويند اين را خود فرابافته است، [نه چنين است،] بلكه آن [سخن‌] راست و درست است از پروردگار تو تا مردمى را بيم كنى كه هيچ بيم‌كننده‌اى پيش از تو بديشان نيامده است، شايد راه يابند."
          ],
          "fa.sadeqi": [
            "یا می‌گویند: «آن را (به خدا) افترا بسته است‌؟» (چنان نیست.) بلکه آن تمامی حقّ است از جانب پروردگارت، تا مردمی را که پیش از تو هیچ هشداردهنده‌ای برایشان نیامده است، هشدار دهی؛ شاید راه یابند."
          ]
        }
      },
      {
        "index": 3507,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:32:4",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:8:1:33:10"
          ]
        },
        "text": [
          "اللَّهُ‌ الَّذِي‌ خَلَقَ‌ السَّمَاوَاتِ‌ وَ الْأَرْضَ‌ وَ مَا بَيْنَهُمَا فِي‌ سِتَّةِ أَيَّامٍ‌ ثُمَ‌ اسْتَوَى‌ عَلَى‌ الْعَرْشِ‌ مَا لَکُمْ‌ مِنْ‌ دُونِهِ‌ مِنْ‌ وَلِيٍ‌ وَ لاَ شَفِيعٍ‌ أَ فَلاَ تَتَذَکَّرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "It is God who created the heavens and the earth and all that lies between them, in six spans, then assumed all authority. You have no protector other than Him, nor any intercessor. Will you not be warned even then?"
          ],
          "en.ahmedraza": [
            "It is Allah Who created the heavens and the earth, and all what is between them, in six days, then (befitting His Majesty) established Himself over the Throne (of control); leaving Allah, there is neither a friend nor an intercessor for you; so do you not ponder?"
          ],
          "en.arberry": [
            "God is He that created the heavens and the earth, and what between them is, in six days, then seated Himself upon the Throne. Apart from Him, you have no protector neither mediator; will you not remember?"
          ],
          "en.daryabadi": [
            "Allah it is Who created the heavens and the earth and whatsoever is betwixt the twain in six days, and then He established Himself on the throne. No patron have ye nor an intercessor, besides Him. Will ye not then be admonished?"
          ],
          "en.hilali": [
            "Allah it is He Who has created the heavens and the earth, and all that is between them in six Days. Then He Istawa (rose over) the Throne (in a manner that suits His Majesty). You (mankind) have none, besides Him, as a Wali (protector or helper etc.) or an intercessor. Will you not then remember (or be admonished)?"
          ],
          "en.itani": [
            "God is He who created the heavens and the earth and everything between them in six days, and then established Himself on the Throne. Apart from Him, you have no master and no intercessor. Will you not reflect?"
          ],
          "en.maududi": [
            "It is Allah Who created the heavens and the earth and all that is between the two, in six days, and then He established Himself on the Throne. You have no guardian or intercessor other than He. Will you, then, not take heed?"
          ],
          "en.mubarakpuri": [
            "Allah it is He Who has created the heavens and the earth, and all that is between them in six Days. Then He Istawa over the Throne. You have none, besides Him, as a protector or an intercessor. Will you not then remember"
          ],
          "en.pickthall": [
            "Allah it is Who created the heavens and the earth, and that which is between them, in six Days. Then He mounted the Throne. Ye have not, beside Him, a protecting friend or mediator. Will ye not then remember?"
          ],
          "en.qarai": [
            "It is Allah who created the heavens and the earth and whatever is between them in six days, then He settled on the Throne. You do not have besides Him any guardian or intercessor. Will you not then take admonition?"
          ],
          "en.qaribullah": [
            "It was Allah, who, in six days created the heavens and the earth and all that is between them, and then willed to the Throne. You have no guardian nor intercessor other than Him. Will you not remember?"
          ],
          "en.sahih": [
            "It is Allah who created the heavens and the earth and whatever is between them in six days; then He established Himself above the Throne. You have not besides Him any protector or any intercessor; so will you not be reminded?"
          ],
          "en.sarwar": [
            "God is the one who created the heavens and the earth and all that is between them in six days, then He established His dominion over the Throne. No one besides Him is your guardian or intercessor. Will you then not take heed?"
          ],
          "en.shakir": [
            "Allah is He Who created the heavens and the earth and what is between them in six periods, and He mounted the throne (of authority); you have not besides Him any guardian or any intercessor, will you not then mind?"
          ],
          "en.transliteration": [
            "All<u>a</u>hu alla<u>th</u>ee khalaqa a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>a wam<u>a</u> baynahum<u>a</u> fee sittati ayy<u>a</u>min thumma istaw<u>a</u> AAal<u>a</u> alAAarshi m<u>a</u> lakum min doonihi min waliyyin wal<u>a</u> shafeeAAin afal<u>a</u> tata<u>th</u>akkaroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "It was God who created the heavens and the earth and whatsoever is in between in six Days, and then He established Himself on the throne. You have no patron nor any intercessor besides Him. So will you not pay heed?"
          ],
          "en.yusufali": [
            "It is Allah Who has created the heavens and the earth, and all between them, in six Days, and is firmly established on the Throne (of Authority): ye have none, besides Him, to protect or intercede (for you): will ye not then receive admonition?"
          ],
          "fa.ansarian": [
            "خداست که آسمان ها و زمین را و آنچه را میان آنهاست در شش روز آفرید، سپس بر تخت فرمانروایی و تدبیر امور آفرینش چیره و مسلط شد. برای شما جز او هیچ یاور و شفاعت کننده ای نیست، [با این حال] آیا متذکّر و هوشیار نمی شوید؟"
          ],
          "fa.ayati": [
            "خداست كه آسمانها و زمين را و آنچه ميان آنهاست در شش روز بيافريد و آنگاه به عرش پرداخت. شما را جز او كارساز و شفيعى نيست. آيا پند نمى‌گيريد؟"
          ],
          "fa.bahrampour": [
            "خدا كسى است كه آسمان‌ها و زمين و آنچه را كه ميان آن دو است در شش روز آفريد، آن‌گاه بر عرش [قدرت‌] قرار گرفت، براى شما غير از او سرپرست و شفيعى نيست، پس آيا پند نمى‌گيريد"
          ],
          "fa.fooladvand": [
            "خدا كسى است كه آسمانها و زمين و آنچه را كه ميان آن دو است، در شش هنگام آفريد، آنگاه بر عرش [قدرت‌] استيلا يافت، براى شما غير از او سرپرست و شفاعتگرى نيست؛ آيا باز هم پند نمى‌گيريد؟"
          ],
          "fa.ghomshei": [
            "خدا آن کسی است که آسمانها و زمین و هر چه در بین آنهاست همه را در مقدار شش روز بیافرید، آن گاه بر عرش (فرمانروایی) قرار گرفت، شما را غیر او هیچ (در عالم) یار و یاور و شفیع و مددکاری نیست، آیا تذکر نمی‌یابید؟"
          ],
          "fa.khorramdel": [
            "خدا کسی است که آسمانها و زمین و آنچه را که در میان آن دو است در شش دوره بیافرید و سپس بر تخت فرماندهی جهان قرار گرفت. بجز خدا برای شما هیچ یاوری (که شما را از عذاب خدا برهاند) و هیچ شفیعی (که در پیش خدا - جز با اجازه‌ی خدا - برایتان شفاعت کند) وجود ندارد. آیا یادآور می‌شوید؟ [[«سِتَّةِ أَیَّامٍ»: مراد شش دوره است (نگا: اعراف / 54، یونس / 3، هود / 7، فرقان / 59). «إِسْتَوی عَلَی الْعَرْشِ»: (نگا: اعراف / 54، یونس / 3، رعد / 2، فرقان / 59). «وَلِیٍّ»: یاور. کمک کننده. «شَفِیعٍ»: میانجی.]]"
          ],
          "fa.khorramshahi": [
            "خداوند کسی است که آسمان و زمین و مابین آنها را در شش روز آفرید، سپس بر عرش استیلاء یافت، شما را جز او سرور و شفیعی نیست، آیا پند نمی‌گیرید"
          ],
          "fa.makarem": [
            "خداوند کسی است که آسمانها و زمین و آنچه را میان این دو است در شش روز [= شش دوران‌] آفرید، سپس بر عرش (قدرت) قرار گرفت؛ هیچ سرپرست و شفاعت کننده‌ای برای شما جز او نیست؛ آیا متذکّر نمی‌شوید؟!"
          ],
          "fa.moezzi": [
            "خدا است آنکه آفرید آسمانها و زمین را و آنچه میان آنها است در شش روز سپس استوار شد بر عرش نیست شما را جز او دوست و نه شفاعتگری پس آیا یادآور نمی‌شوید"
          ],
          "fa.mojtabavi": [
            "خداست آن كه آسمانها و زمين و آنچه را ميان آنهاست در شش روز- دوره- بيافريد، سپس بر عرش- مقام فرمانروايى بر جهان آفرينش- برآمد، شما را جز او هيچ سرپرست و كارسازى و هيچ شفيعى نيست، آيا ياد نمى‌كنيد و پند نمى‌گيريد؟"
          ],
          "fa.sadeqi": [
            "خدایی که آسمان‌ها و زمین و آنچه را که میان آن دو است، در شش هنگام آفرید. سپس بر عرش (آفرینش) چیره شد. حال آنکه برای شما غیر از او نه هیچ سرپرست و نه هیچ شفاعتگری نیست‌. آیا پس (باز هم) متذکر نمی‌شوید؟"
          ]
        }
      },
      {
        "index": 3508,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:32:5",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:8:1:33:1"
          ]
        },
        "text": [
          "يُدَبِّرُ الْأَمْرَ مِنَ‌ السَّمَاءِ إِلَى‌ الْأَرْضِ‌ ثُمَ‌ يَعْرُجُ‌ إِلَيْهِ‌ فِي‌ يَوْمٍ‌ کَانَ‌ مِقْدَارُهُ‌ أَلْفَ‌ سَنَةٍ مِمَّا تَعُدُّونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "He regulates all affairs from high to low, then they rise to perfection step by step in a (heavenly) day whose measure is a thousand years of your reckoning."
          ],
          "en.ahmedraza": [
            "He plans (all) the job(s) from the heaven to the earth – then it will return to Him on the Day which amounts to a thousand years in your count."
          ],
          "en.arberry": [
            "He directs the affair from heaven to earth, then it goes up to Him in one day, whose measure is a thousand years of your counting."
          ],
          "en.daryabadi": [
            "He disposeth every affair from the heaven unto the earth; thereafter it shall ascend unto Him in a Day the measure whereof is one thousand years of that which ye compute."
          ],
          "en.hilali": [
            "He arranges (every) affair from the heavens to the earth, then it (affair) will go up to Him, in one Day, the space whereof is a thousand years of your reckoning (i.e. reckoning of our present world's time)."
          ],
          "en.itani": [
            "He regulates all affairs, from the heavens, to the earth. Then it ascends to Him on a Day the length of which is a thousand years by your count."
          ],
          "en.maududi": [
            "He governs from the heaven to the earth and then the record (of this governance) goes up to Him in a day whose measure is a thousand years in your reckoning."
          ],
          "en.mubarakpuri": [
            "He directs the command from the heavens to the earth; then it will go up to Him, in one Day, the space whereof is a thousand years of your reckoning."
          ],
          "en.pickthall": [
            "He directeth the ordinance from the heaven unto the earth; then it ascendeth unto Him in a Day, whereof the measure is a thousand years of that ye reckon."
          ],
          "en.qarai": [
            "He directs the command from the heaven to the earth; then it ascends toward Him in a day whose span is a thousand years by your reckoning."
          ],
          "en.qaribullah": [
            "He directs the affair from heaven to earth. Then it will ascend to Him in one day, a day whose value is a thousand years by your reckoning."
          ],
          "en.sahih": [
            "He arranges [each] matter from the heaven to the earth; then it will ascend to Him in a Day, the extent of which is a thousand years of those which you count."
          ],
          "en.sarwar": [
            "He sends the regulation of the affair from the heavens to the earth, then on the day which is equal to one thousand years of yours, it will ascend to Him."
          ],
          "en.shakir": [
            "He regulates the affair from the heaven to the earth; then shall it ascend to Him in a day the measure of which is a thousand years of what you count."
          ],
          "en.transliteration": [
            "Yudabbiru alamra mina a<b>l</b>ssam<u>a</u>i il<u>a</u> alar<u>d</u>i thumma yaAAruju ilayhi fee yawmin k<u>a</u>na miqd<u>a</u>ruhu alfa sanatin mimm<u>a</u> taAAuddoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "He directs all affairs from heaven to earth. Then all will again ascend to Him on a Day whose length is a thousand years by the way you measure."
          ],
          "en.yusufali": [
            "He rules (all) affairs from the heavens to the earth: in the end will (all affairs) go up to Him, on a Day, the space whereof will be (as) a thousand years of your reckoning."
          ],
          "fa.ansarian": [
            "[همه] امور را [همواره] از آسمان تا زمین تدبیر و تنظیم می کند، سپس در روزی که اندازه آن به شمارش شما هزار سال است به سوی او بالا می رود."
          ],
          "fa.ayati": [
            "كار را از آسمان تا زمين سامان مى‌دهد. سپس در روزى كه مقدار آن هزار سال است -چنان كه مى‌شماريد- به سوى او بالا مى‌رود."
          ],
          "fa.bahrampour": [
            "امور [جهان‌] را از آسمان به سوى زمين تدبير مى‌كند، سپس [نتيجه آن‌] در روزى كه مقدار آن هزار سال از سال‌هايى است كه شما مى‌شمريد، به سوى او بالا مى‌رود [و دنيا پايان مى‌يابد]"
          ],
          "fa.fooladvand": [
            "كار [جهان‌] را از آسمان [گرفته‌] تا زمين، اداره مى‌كند؛ آنگاه [نتيجه و گزارش آن‌] در روزى كه مقدارش -آن چنان كه شما [آدميان‌] برمى‌شماريد- هزار سال است، به سوى او بالا مى‌رود."
          ],
          "fa.ghomshei": [
            "اوست که امر عالم را (به نظام احسن و اکمل) از آسمان تا زمین تدبیر می‌کند سپس در روزی که مقدارش به حساب شما بندگان هزار سال است باز (حقایق و ارواح) به سوی او بالا می‌رود."
          ],
          "fa.khorramdel": [
            "خداوند (تمام عالم هستی را) از آسمان گرفته تا زمین، زیر پوشش تدبیر خود قرار داده است، (و جز او مدبِّری در این جهان وجود ندارد). سپس تدبیر امور در روزی که اندازه‌ی آن هزار سال از سالهائی است که شما می‌شمارید، به سوی او باز می‌گردد. [[«یُدَبِّرُ الأمْرَ»: کار را می‌گرداند. تدبیر کار را می‌کند. «مِنَ السَّمَآءِ إِلیَ الأرْضِ»: از آسمان تا زمین، یعنی کلّ عالم هستی. از مرکز فرماندهی آسمان، برای زمین فرمان را صادر می‌کند و امور زمین را زیر نظر می‌دارد. «یَعْرُجُ إِلَیْهِ»: گزارش کار برای او برده می‌شود. امر جهان پایان می‌گیرد و به سویش برگشت داده می‌شود. «أَلْفَ سَنَةٍ»: هزار سال. مراد از هزار و فروع آن کثرت است (نگا: حجّ / 47). مفهوم آیه این است که خداوند این جهان را آفریده و آسمان و زمین را با تدبیر خاصّی نظم بخشیده است، و پیوسته به رتق و فتق امور آن مشغول است، و پس از سالیان سال، این جهان را در هم می‌پیچد، و تمام امور سرانجام به خدا باز می‌گردد، و خدا جهان دیگری را با طرح نوینی ابداع می‌فرماید.]]"
          ],
          "fa.khorramshahi": [
            "از آسمان کار و بار زمین را تدبیر می‌کند، سپس [اعمال مردمان‌] در روزی که اندازه‌اش هزار سال است از آنچه شما می‌شمارید، به سوی او بالا می‌رود"
          ],
          "fa.makarem": [
            "امور این جهان را از آسمان به سوی زمین تدبیر می‌کند؛ سپس در روزی که مقدار آن هزار سال از سالهایی است که شما می‌شمرید بسوی او بالا می‌رود (و دنیا پایان می‌یابد)."
          ],
          "fa.moezzi": [
            "بپردازد کار را از آسمان بسوی زمین سپس بالا رود بسویش در روزی که اندازه آن هزار سال است از آنچه می‌شمرید"
          ],
          "fa.mojtabavi": [
            "كار- وحى يا كار دنيا- را از آسمان تا زمين تدبير مى‌كند، سپس [آن كار] به سوى او بالا مى‌رود در روزى كه اندازه آن هزار است سال از آنچه شما مى‌شمريد."
          ],
          "fa.sadeqi": [
            "همه چیز را از آسمان تا زمین (به اراده‌ی خود) اداره می‌کند؛ سپس در روزی که مقدارش - آن چنان که شما (آدمیان) برمی‌شمارید - هزار سال بوده است، سوی او بالا می‌رود."
          ]
        }
      },
      {
        "index": 3509,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:32:6",
        "text": [
          "ذٰلِکَ‌ عَالِمُ‌ الْغَيْبِ‌ وَ الشَّهَادَةِ الْعَزِيزُ الرَّحِيمُ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Such is (He) the knower of the unknown and the known, the mighty and the merciful,"
          ],
          "en.ahmedraza": [
            "This is the All Knowing – of all the hidden and the visible, the Most Honourable, the Most Merciful."
          ],
          "en.arberry": [
            "He is the knower of the Unseen and the Visible, the All-mighty, the All-compassionate,"
          ],
          "en.daryabadi": [
            "Such is the Knower of the unseen and the seen, the Mighty, the Merciful."
          ],
          "en.hilali": [
            "That is He, the All-Knower of the unseen and the seen, the All-Mighty, the Most Merciful."
          ],
          "en.itani": [
            "That is the Knower of the Invisible and the Visible, the Powerful, the Merciful."
          ],
          "en.maududi": [
            "He knows all that is beyond as well as all that is within a creature's sense-perception. He is the Most Mighty, the Most Compassionate,"
          ],
          "en.mubarakpuri": [
            "That is He, the All-Knower of the unseen and the seen, the All-Mighty, the Most Merciful."
          ],
          "en.pickthall": [
            "Such is the Knower of the Invisible and the Visible, the Mighty, the Merciful,"
          ],
          "en.qarai": [
            "That is the Knower of the sensible and the Unseen, the All-mighty, the All-merciful,"
          ],
          "en.qaribullah": [
            "He is the Knower of the Unseen and the Visible, the Almighty, the Most Merciful,"
          ],
          "en.sahih": [
            "That is the Knower of the unseen and the witnessed, the Exalted in Might, the Merciful,"
          ],
          "en.sarwar": [
            "He knows the unseen and the seen. He is Majestic and All-merciful."
          ],
          "en.shakir": [
            "This is the Knower of the unseen and the seen, the Mighty the Merciful,"
          ],
          "en.transliteration": [
            "<u>Tha</u>lika AA<u>a</u>limu alghaybi wa<b>al</b>shshah<u>a</u>dati alAAazeezu a<b>l</b>rra<u>h</u>eem<b>u</b>"
          ],
          "en.wahiduddin": [
            "Such is the Knower of the unseen and the visible, the Powerful, the Merciful,"
          ],
          "en.yusufali": [
            "Such is He, the Knower of all things, hidden and open, the Exalted (in power), the Merciful;-"
          ],
          "fa.ansarian": [
            "این است [پروردگار] دانای نهان و آشکار که توانای شکست ناپذیر و مهربان است،"
          ],
          "fa.ayati": [
            "اوست كه داناى نهان و آشكار است. پيروزمند و مهربان است."
          ],
          "fa.bahrampour": [
            "او داناى نهان و آشكار است، شكست ناپذير مهربان است"
          ],
          "fa.fooladvand": [
            "اوست داناى نهان و آشكار، كه شكوهمند مهربان است."
          ],
          "fa.ghomshei": [
            "این است همان خدایی که بر غیب و شهود عالم دانا و (بر جهانیان) مقتدر و مهربان است."
          ],
          "fa.khorramdel": [
            "او خداوندی است که از پنهان و آشکار باخبر است، و چیره و مهربان است. [[«الْغَیْبِ»: آنچه از مردم نهان است. «الشَّهَادَةِ»: آنچه بر مردم عیان است.]]"
          ],
          "fa.khorramshahi": [
            "اوست که دانای نهان و آشکارا [و] پیروزمند مهربان است‌"
          ],
          "fa.makarem": [
            "او خداوندی است که از پنهان و آشکار با خبر است، و شکست‌ناپذیر و مهربان است!"
          ],
          "fa.moezzi": [
            "این است دانای نهان و هویدا آن عزتمند مهربان‌"
          ],
          "fa.mojtabavi": [
            "اين است [وصف‌] داناى نهان و آشكارا، همان تواناى بى‌همتا و مهربان"
          ],
          "fa.sadeqi": [
            "اوست (همان) دانای نهان و آشکار، (آن) شکوهمند رحمتگر بر ویژگان."
          ]
        }
      },
      {
        "index": 3510,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:32:7",
        "text": [
          "الَّذِي‌ أَحْسَنَ‌ کُلَ‌ شَيْ‌ءٍ خَلَقَهُ‌ وَ بَدَأَ خَلْقَ‌ الْإِنْسَانِ‌ مِنْ‌ طِينٍ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Who made all things He created excellent; and first fashioned man from clay,"
          ],
          "en.ahmedraza": [
            "The One Who created all things excellent, and Who initiated the creation of man from clay."
          ],
          "en.arberry": [
            "who has created all things well. And He originated the creation of man out of clay,"
          ],
          "en.daryabadi": [
            "Who hath made everything exceeding good which He hath created. And He originated the creation of man from clay;"
          ],
          "en.hilali": [
            "Who made everything He has created good, and He began the creation of man from clay."
          ],
          "en.itani": [
            "He who perfected everything He created, and originated the creation of man from clay."
          ],
          "en.maududi": [
            "He Who excelled in the creation of all that He created. He originated the creation of man from clay,"
          ],
          "en.mubarakpuri": [
            "Who made everything He has created good and He began the creation of man from clay."
          ],
          "en.pickthall": [
            "Who made all things good which He created, and He began the creation of man from clay;"
          ],
          "en.qarai": [
            "who perfected everything that He created and commenced man’s creation from clay."
          ],
          "en.qaribullah": [
            "who perfected everything He created. He originated the creation of the human from clay,"
          ],
          "en.sahih": [
            "Who perfected everything which He created and began the creation of man from clay."
          ],
          "en.sarwar": [
            "It is He Who created everything in the best manner and began the creation of the human being from clay."
          ],
          "en.shakir": [
            "Who made good everything that He has created, and He began the creation of man from dust."
          ],
          "en.transliteration": [
            "Alla<u>th</u>ee a<u>h</u>sana kulla shayin khalaqahu wabadaa khalqa alins<u>a</u>ni min <u>t</u>een<b>in</b>"
          ],
          "en.wahiduddin": [
            "who gave everything its perfect form. He originated the creation of man from clay,"
          ],
          "en.yusufali": [
            "He Who has made everything which He has created most good: He began the creation of man with (nothing more than) clay,"
          ],
          "fa.ansarian": [
            "همان کسی که آنچه را آفرید نیکو ساخت، و آفرینش انسان را از گِل آغاز کرد،"
          ],
          "fa.ayati": [
            "آن كه هر چه را آفريد به نيكوترين وجه آفريد و خلقت انسان را از گل آغاز كرد."
          ],
          "fa.bahrampour": [
            "همان كسى كه همه چيز را نيكو آفريد، و آفرينش انسان را از گل آغاز كرد"
          ],
          "fa.fooladvand": [
            "همان كسى كه هر چيزى را كه آفريده است نيكو آفريده، و آفرينش انسان را از گِل آغاز كرد؛"
          ],
          "fa.ghomshei": [
            "آن خدایی که هر چیز را به نیکوترین وجه خلقت کرد و آدمی را نخست از خاک (پست بدین حسن و کمال) بیافرید."
          ],
          "fa.khorramdel": [
            "آن کسی است که هر چه را آفرید، نیکو آفرید، و آفرینش انسان (اوّل) را از گل آغازید. [[«أَحْسَنَ»: زیبا و آراسته و پیراسته کرد. یعنی کاخ عظیم خلقت را بر «نظام احسن» آفریده است و کاملتر و زیباتر از آن تصوّر نمی‌شود. به گونه‌ای که میان همه موجودات پیوند و هماهنگی است و به هر کدام آنچه را به زبان حال خواسته است عطاء فرموده است (نگا: طه / 50). «طِینٍ»: گِل. یعنی مخلوق برجسته انسان نام را از موجود ساده و کم ارزش گِل آفریده است و او را گُل سرسبد جهان خلقت کرده است و شاعر در این باره چه نیکو سروده است: دهنده‌ای که به گُل نَکهت و به گِل جان داد]]"
          ],
          "fa.khorramshahi": [
            "و [همان‌] کسی که هرچیز را که آفرید نیکو آفرید، و آفرینش انسان [/آدم‌] را از گل آغاز کرد"
          ],
          "fa.makarem": [
            "او همان کسی است که هر چه را آفرید نیکو آفرید؛ و آفرینش انسان را از گِل آغاز کرد؛"
          ],
          "fa.moezzi": [
            "آنکو نکو کرد هر چیزی آفرینش آن را و آغاز کرد آفرینش انسان را از گل‌"
          ],
          "fa.mojtabavi": [
            "آن كه هر چه آفريد به نيكوترين شيوه ساخت و آفرينش آدمى را از گِل آغاز كرد."
          ],
          "fa.sadeqi": [
            "کسی که همه چیز را نیکو آفرید و آفرینش انسان را از گِل آغاز کرد‌؛"
          ]
        }
      },
      {
        "index": 3511,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:32:8",
        "text": [
          "ثُمَ‌ جَعَلَ‌ نَسْلَهُ‌ مِنْ‌ سُلاَلَةٍ مِنْ‌ مَاءٍ مَهِينٍ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Then made his offspring from the extract of base fluid,"
          ],
          "en.ahmedraza": [
            "Then kept his posterity with a part of an abject fluid."
          ],
          "en.arberry": [
            "then He fashioned his progeny of an extraction of mean water,"
          ],
          "en.daryabadi": [
            "Then He made his progeny from an extract of water base."
          ],
          "en.hilali": [
            "Then He made his offspring from semen of worthless water (male and female sexual discharge)."
          ],
          "en.itani": [
            "Then made his reproduction from an extract of an insignificant fluid."
          ],
          "en.maududi": [
            "then made his progeny from the extract of a mean fluid,"
          ],
          "en.mubarakpuri": [
            "Then He made his offspring from semen of despised water."
          ],
          "en.pickthall": [
            "Then He made his seed from a draught of despised fluid;"
          ],
          "en.qarai": [
            "Then He made his progeny from an extract of a base fluid."
          ],
          "en.qaribullah": [
            "then He made his offspring from a clot of weak water (semen)."
          ],
          "en.sahih": [
            "Then He made his posterity out of the extract of a liquid disdained."
          ],
          "en.sarwar": [
            "He made His offspring come into existence from an extract of insignificant fluid,"
          ],
          "en.shakir": [
            "Then He made his progeny of an extract, of water held in light estimation."
          ],
          "en.transliteration": [
            "Thumma jaAAala naslahu min sul<u>a</u>latin min m<u>a</u>in maheen<b>in</b>"
          ],
          "en.wahiduddin": [
            "then He made his progeny from an extract of a humble fluid."
          ],
          "en.yusufali": [
            "And made his progeny from a quintessence of the nature of a fluid despised:"
          ],
          "fa.ansarian": [
            "سپس نسل او را از چکیده ای از آب پست و بی مقدار قرار داد،"
          ],
          "fa.ayati": [
            "سپس نسل او را از عصاره آبى بى‌مقدار پديد آورد."
          ],
          "fa.bahrampour": [
            "سپس [تداوم‌] نسل او را از چكيده‌ى آبى حقير مقرّر كرد"
          ],
          "fa.fooladvand": [
            "سپس [تداوم‌] نسل او را از چكيده آبى پست مقرر فرمود؛"
          ],
          "fa.ghomshei": [
            "آن‌گاه خلقت نژاد نوع او را از چکیده‌ای از آب بی‌قدر (و نطفه بی‌حس) مقرر گردانید."
          ],
          "fa.khorramdel": [
            "سپس خداوند ذرّیّه‌ی او را از عُصاره‌ی آب (به ظاهر) ضعیف و ناچیزی (به نام منی) آفرید. [[«سُلالَةٍ»: عُصاره و فشرده خالص هر چیز. مراد نطفه آدمی است (نگا: مؤمنون / 12). «مَهِینٍ»: حقیر و ناچیز. ضعیف و خوار. مراد نطفه و منی است که به ظاهر ناچیز ولی در حقیقت از اسرارآمیزترین موجودات است.]]"
          ],
          "fa.khorramshahi": [
            "سپس نسل او را از چکیده آب بی‌مقدار پدید آورد"
          ],
          "fa.makarem": [
            "سپس نسل او را از عصاره‌ای از آب ناچیز و بی‌قدر آفرید."
          ],
          "fa.moezzi": [
            "پس گردانید نژادش را از چکه‌ای از آبی پست‌"
          ],
          "fa.mojtabavi": [
            "سپس نسل- فرزندان- او را از چكيده‌اى از آبى سست و پست پديد كرد."
          ],
          "fa.sadeqi": [
            "سپس (تداوم) نسل او را از خلاصه و برگزیده‌ای از آبی پست نهاد؛"
          ]
        }
      },
      {
        "index": 3512,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:32:9",
        "text": [
          "ثُمَ‌ سَوَّاهُ‌ وَ نَفَخَ‌ فِيهِ‌ مِنْ‌ رُوحِهِ‌ وَ جَعَلَ‌ لَکُمُ‌ السَّمْعَ‌ وَ الْأَبْصَارَ وَ الْأَفْئِدَةَ قَلِيلاً مَا تَشْکُرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Then proportioned and breathed into him of His spirit, and gave you the senses of hearing, sight and feeling. And yet how little are the thanks you offer!"
          ],
          "en.ahmedraza": [
            "Then made him proper and blew into him a spirit from Him, and bestowed ears and eyes and hearts to you; very little thanks do you offer!"
          ],
          "en.arberry": [
            "then He shaped him, and breathed His spirit in him. And He appointed for you hearing, and sight, and hearts; little thanks you show."
          ],
          "en.daryabadi": [
            "Then He fashioned him and breathed into him something of a spirit from Him; and He ordained for you hearing and sight and hearts. Little is the thanks ye return."
          ],
          "en.hilali": [
            "Then He fashioned him in due proportion, and breathed into him the soul (created by Allah for that person), and He gave you hearing (ears), sight (eyes) and hearts. Little is the thanks you give!"
          ],
          "en.itani": [
            "Then He proportioned him, and breathed into him of His Spirit. Then He gave you the hearing, and the eyesight, and the brains—but rarely do you give thanks."
          ],
          "en.maududi": [
            "then He duly proportioned him, and breathed into him of His spirit, and bestowed upon you ears and eyes and hearts. And yet, little thanks do you give."
          ],
          "en.mubarakpuri": [
            "Then He fashioned him in due proportion, and breathed into him the soul; and He gave you hearing, sight and the sense of deduction. Little is the thanks you give!"
          ],
          "en.pickthall": [
            "Then He fashioned him and breathed into him of His Spirit; and appointed for you hearing and sight and hearts. Small thanks give ye!"
          ],
          "en.qarai": [
            "Then He proportioned him and breathed into him of His Spirit, and made for you hearing, sight, and hearts. Little do you thank."
          ],
          "en.qaribullah": [
            "Then He created him and (caused the angel to) breathe into him his (created) spirit. He gave you eyes and ears, and hearts, yet little do you thank."
          ],
          "en.sahih": [
            "Then He proportioned him and breathed into him from His [created] soul and made for you hearing and vision and hearts; little are you grateful."
          ],
          "en.sarwar": [
            "then He gave it proper shape and blew His spirit in it. He made ears, eyes and hearts for you, but you give Him very little thanks."
          ],
          "en.shakir": [
            "Then He made him complete and breathed into him of His spirit, and made for you the ears and the eyes and the hearts; little is it that you give thanks."
          ],
          "en.transliteration": [
            "Thumma saww<u>a</u>hu wanafakha feehi min roo<u>h</u>ihi wajaAAala lakumu a<b>l</b>ssamAAa wa<b>a</b>lab<u>sa</u>ra wa<b>a</b>lafidata qaleelan m<u>a</u> tashkuroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Then He moulded him; He breathed His Spirit into him; He gave you hearing, sight, and hearts. How seldom you are grateful!"
          ],
          "en.yusufali": [
            "But He fashioned him in due proportion, and breathed into him something of His spirit. And He gave you (the faculties of) hearing and sight and feeling (and understanding): little thanks do ye give!"
          ],
          "fa.ansarian": [
            "آن گاه او را [از جهت اندام] درست و نیکو نمود، و از روح خود در وی دمید و برای شما گوش و چشم و قلب آفرید در حالی که اندک سپاس گزاری می کنید."
          ],
          "fa.ayati": [
            "آنگاه بالاى او راست كرد و از روح خود در آن بدميد. و برايتان گوش و چشمها و دلها آفريد. چه اندك شكر مى‌گوييد."
          ],
          "fa.bahrampour": [
            "آن‌گاه [ساختار] او را تنظيم كرد، و از روح خويش در او دميد، و براى شما شنوايى و چشم‌ها و دل‌ها قرار داد، [ولى‌] اندكى سپاس مى‌گزاريد"
          ],
          "fa.fooladvand": [
            "آنگاه او را درست‌اندام كرد، و از روح خويش در او دميد، و براى شما گوش و ديدگان و دلها قرار داد؛ چه اندك سپاس مى‌گزاريد."
          ],
          "fa.ghomshei": [
            "سپس آن (نطفه بی‌جان) را نیکو بیاراست و از روح (قدسی الهی) خود در آن بدمید، و شما را دارای گوش و چشمها و قلبها (با حسّ و هوش) گردانید، باز بسیار اندک شکر و سپاسگزاری نعمتهای حق می‌کنید."
          ],
          "fa.khorramdel": [
            "آن گاه اندامهای او را تکمیل و آراسته کرد و از روح متعلّق به خود (که سرّی از اسرار است) در او دمید، و برای شما گوشها و چشمها و دلها آفرید (تا بشنوید و بنگرید و بفهمید، امّا) شما کمتر شکر (نعمتهای او) را به جای می‌آورید. [[«سَوَّاهُ»: انسان را تکمیل و آراسته کرد. خلقت او را اتمام بخشید. «مِن رُّوحِهِ»: (نگا: حجر / 29). «قَلِیلاً مَّا»: کمتر. اندک.]]"
          ],
          "fa.khorramshahi": [
            "سپس او را استوار کرد و در او از روح خویش دمید و برای شما گوش [ها] و چشمان و دلها آفرید، چه اندک سپاس می‌گزارید"
          ],
          "fa.makarem": [
            "سپس (اندام) او را موزون ساخت و از روح خویش در وی دمید؛ و برای شما گوش و چشمها و دلها قرار داد؛ امّا کمتر شکر نعمتهای او را بجا می‌آورید!"
          ],
          "fa.moezzi": [
            "سپس آراستش و دمید در آن از روح خویش و گذاشت برای شما گوش و دیدگان و دلها را به کمی سپاس گزارید"
          ],
          "fa.mojtabavi": [
            "آنگاه اندام او را درست و تمام ساخت و از روح خويش در او دميد و شما را گوش و ديدگان و دلها پديد كرد [ولى‌] اندك سپاس مى‌داريد."
          ],
          "fa.sadeqi": [
            "سپس او را سامان و سازمان داد و از روح ویژه‌‌اش (از آفریدگانش) در او دمید. و برای شما گوش‌ها و چشم‌ها و دل‌های فروزان قرار داد. چه اندک سپاس می‌گزارید!"
          ]
        }
      },
      {
        "index": 3513,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:32:10",
        "text": [
          "وَ قَالُوا أَ إِذَا ضَلَلْنَا فِي‌ الْأَرْضِ‌ أَ إِنَّا لَفِي‌ خَلْقٍ‌ جَدِيدٍ بَلْ‌ هُمْ‌ بِلِقَاءِ رَبِّهِمْ‌ کَافِرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "But they say: \"When we have mingled with the earth, shall we be created anew?\" In fact they deny the meeting with their Lord."
          ],
          "en.ahmedraza": [
            "And they said, “When we have mingled into the earth, will we be created again?”; in fact they disbelieve in the meeting with their Lord."
          ],
          "en.arberry": [
            "They say, 'What, when we have gone astray in the earth, shall we indeed be in a new creation?' Nay, but they disbelieve in the encounter with their Lord."
          ],
          "en.daryabadi": [
            "And they say: when we are vanished in the earth, shall we then be raised in a new creation? Aye! in the meeting with their Lord they are disbelieving."
          ],
          "en.hilali": [
            "And they say: \"When we are (dead and become) lost in the earth, shall we indeed be recreated anew?\" Nay, but they deny the Meeting with their Lord!"
          ],
          "en.itani": [
            "And they say, “When we are lost into the earth, shall we be in a new creation?” In fact, they deny the meeting with their Lord."
          ],
          "en.maududi": [
            "They say: “Shall we be created afresh after we have become lost in the earth?” Nay, the fact is that they deny that they will meet their Lord."
          ],
          "en.mubarakpuri": [
            "And they say: \"When we are lost in the earth, shall we indeed be created anew\" Nay, but they deny the meeting with their Lord!"
          ],
          "en.pickthall": [
            "And they say: When we are lost in the earth, how can we then be re-created? Nay but they are disbelievers in the meeting with their Lord."
          ],
          "en.qarai": [
            "They say, ‘When we have been lost in the dust, shall we be indeed created anew?’ Indeed, they disbelieve in the encounter with their Lord."
          ],
          "en.qaribullah": [
            "They say: 'What, when we have been destroyed in the earth, shall we indeed be in a new creation' Indeed, they disbelieve that they will meet their Lord."
          ],
          "en.sahih": [
            "And they say, \"When we are lost within the earth, will we indeed be [recreated] in a new creation?\" Rather, they are, in [the matter of] the meeting with their Lord, disbelievers."
          ],
          "en.sarwar": [
            "They have said, \"How can we be brought to life again after we have been lost in the earth?\" In fact, they have no faith in the Day of Judgment"
          ],
          "en.shakir": [
            "And they say: What! when we have become lost in the earth, shall we then certainly be in a new creation? Nay! they are disbelievers in the meeting of their Lord."
          ],
          "en.transliteration": [
            "Waq<u>a</u>loo ai<u>tha</u> <u>d</u>al<u>a</u>ln<u>a</u> fee alar<u>d</u>i ainn<u>a</u> lafee khalqin jadeedin bal hum biliq<u>a</u>i rabbihim k<u>a</u>firoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "They say, \"When we are lost in the earth, how can we then be recreated?\" Indeed, they deny they will ever meet their Lord."
          ],
          "en.yusufali": [
            "And they say: \"What! when we lie, hidden and lost, in the earth, shall we indeed be in a Creation renewed? Nay, they deny the Meeting with their Lord."
          ],
          "fa.ansarian": [
            "و [منکران لجوج] گفتند: آیا زمانی که [پس از مردنمان بدن ما ریز ریز شد و پوسید و] در زمین گم شدیم، آیا به راستی ما در آفرینشی جدید خواهیم آمد؟ [نه اینکه این لجوجان متکبر فقط منکر قدرت حق باشند] بلکه آنان منکر دیدار [قیامت و محاسبه اعمال به وسیله] پروردگارشان هستند،"
          ],
          "fa.ayati": [
            "و گفتند: آيا وقتى كه در زمين ناپديد شويم، آفرينش تازه‌اى خواهيم يافت؟ آرى، ايشان به ديدار با پروردگارشان ايمان ندارند."
          ],
          "fa.bahrampour": [
            "و گفتند: آيا وقتى [مرديم و] در زمين ناپديد شديم، در آفرينش تازه‌اى خواهيم شد؟ بلكه آنها به لقاى پروردگارشان كافرند"
          ],
          "fa.fooladvand": [
            "و گفتند: «آيا وقتى در [دلِ‌] زمين گم شديم، آيا [باز] ما در خلقت جديدى خواهيم بود؟» [نه،] بلكه آنها به لقاى پروردگارشان [و حضور او] كافرند."
          ],
          "fa.ghomshei": [
            "کافران (از روی تعجب و انکار) گویند که آیا پس از آنکه ما در زمین (خاک و در خاک) نابود و گم شدیم باز از نو زنده خواهیم شد؟! (بلی البتّه زنده خواهید شد) بلکه آنها به شهود و لقاء خدایشان کافرند."
          ],
          "fa.khorramdel": [
            "(کافران) می‌گویند: آیا هنگامی که ما مردیم و در زمین گم گشتیم (و ذرّات وجود ما آمیزه‌ی خاک گردید و اثری از آن نماند) آفرینش تازه‌ای خواهیم یافت (و دوباره زندگی را از سر می‌گیریم؟) بلکه آنان منکر ملاقات با پروردگارشان (برای حساب و کتاب) هم هستند. [[«ضَلَلْنَا فِی‌الأرْضِ»: در زمین گم شدیم. مراد از گم شدن، جزو خاک شدن و در پهنه زمین پراکندن و پرتاب شدن است. «خَلْقٍ»: آفرینش. «بِلِقَآءِ رَبِّهِمْ کَافِرُونَ»: (نگا: یونس / 7 و 8).]]"
          ],
          "fa.khorramshahi": [
            "و گویند آیا چون در [خاک‌] زمین ناپدید شدیم، آیا آفرینش تازه‌ای خواهیم یافت؟ بلکه ایشان لقای پروردگارشان را منکرند"
          ],
          "fa.makarem": [
            "آنها گفتند: «آیا هنگامی که ما (مردیم و) در زمین گم شدیم، آفرینش تازه‌ای خواهیم یافت؟!» ولی آنان لقای پروردگارشان را انکار می‌کنند (و می‌خواهند با انکار معاد، آزادانه به هوسرانی خویش ادامه دهند)."
          ],
          "fa.moezzi": [
            "و گفتند آیا هر گاه گم شدیم در زمین آیا مائیم در آفرینشی نوین بلکه ایشانند به ملاقات پروردگار خویش کافران‌"
          ],
          "fa.mojtabavi": [
            "و گفتند: آيا هنگامى كه در زمين گم و ناپديد شويم، باز به آفرينشى نو درخواهيم آمد؟! [نه چنين است كه مى‌گويند] بلكه آنان به ديدار پروردگارشان- روز رستاخيز- كافرند."
          ],
          "fa.sadeqi": [
            "و گفتند: «آیا وقتی ما در (دل) زمین گم شدیم، آیا (باز هم همین) ما به‌راستی بی‌چون در آفرینش نوینی هستیم‌؟» بلکه آنان به لقای پروردگارشان کافرانند."
          ]
        }
      },
      {
        "index": 3514,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:32:11",
        "text": [
          "قُلْ‌ يَتَوَفَّاکُمْ‌ مَلَکُ‌ الْمَوْتِ‌ الَّذِي‌ وُکِّلَ‌ بِکُمْ‌ ثُمَ‌ إِلَى‌ رَبِّکُمْ‌ تُرْجَعُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"The angel of death appointed over you will take away your soul, then you will be sent back to your Lord.\""
          ],
          "en.ahmedraza": [
            "Proclaim, “The angel of death, who is appointed over you, causes you to die and then towards your Lord you will return.”"
          ],
          "en.arberry": [
            "Say: 'Death's angel, who has been charged with you, shall gather you, then to your Lord you shall be returned.'"
          ],
          "en.daryabadi": [
            "Say thou: the angel of death who is set over you shall cause you to die, thereafter unto your Lord ye shall be returned."
          ],
          "en.hilali": [
            "Say: \"The angel of death, who is set over you, will take your souls, then you shall be brought to your Lord.\""
          ],
          "en.itani": [
            "Say, “The angel of death put in charge of you will reclaim you. Then to your Lord you will be returned.”"
          ],
          "en.maududi": [
            "Tell them: “The angel of death who has been charged with your souls shall gather you, and then you shall be brought back to your Lord.”"
          ],
          "en.mubarakpuri": [
            "Say: \"The angel of death, who is set over you, will take your souls. Then you shall be brought to your Lord.\""
          ],
          "en.pickthall": [
            "Say: The angel of death, who hath charge concerning you, will gather you, and afterward unto your Lord ye will be returned."
          ],
          "en.qarai": [
            "Say, ‘You will be taken away by the angel of death, who has been charged with you. Then you will be brought back to your Lord.’"
          ],
          "en.qaribullah": [
            "Say: 'The Angel of Death, who has been given charge of you will gather you then to your Lord you shall be returned'"
          ],
          "en.sahih": [
            "Say, \"The angel of death will take you who has been entrusted with you. Then to your Lord you will be returned.\""
          ],
          "en.sarwar": [
            "(Muhammad), say, \"The angel of death, who is appointed over everyone of you, will cause you to die and to your Lord you will all return.\""
          ],
          "en.shakir": [
            "Say: The angel of death who is given charge of you shall cause you to die, then to your Lord you shall be brought back."
          ],
          "en.transliteration": [
            "Qul yatawaff<u>a</u>kum malaku almawti alla<u>th</u>ee wukkila bikum thumma il<u>a</u> rabbikum turjaAAoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Say, \"The Angel of Death who has been given charge of you will gather in your souls. Then you will [all] be returned to your Lord.\""
          ],
          "en.yusufali": [
            "Say: \"The Angel of Death, put in charge of you, will (duly) take your souls: then shall ye be brought back to your Lord.\""
          ],
          "fa.ansarian": [
            "بگو: فرشته مرگ که بر شما گماشته شده است [روح] شما را می گیرد، سپس به سوی پروردگارتان باز گردانده می شوید."
          ],
          "fa.ayati": [
            "بگو: فرشته مرگ كه موكل بر شماست، شما را مى‌ميراند. سپس به سوى پروردگارتان باز گردانيده مى‌شويد."
          ],
          "fa.bahrampour": [
            "بگو: فرشته مرگ كه بر شما گمارده شده، جانتان را مى‌ستاند، آن‌گاه به سوى پروردگارتان بازگردانده مى‌شويد"
          ],
          "fa.fooladvand": [
            "بگو: «فرشته مرگى كه بر شما گمارده شده، جانتان را مى‌ستاند، آنگاه به سوى پروردگارتان بازگردانيده مى‌شويد.»"
          ],
          "fa.ghomshei": [
            "بگو: فرشته مرگ که مأمور قبض روح شماست جان شما را خواهد گرفت و پس از مرگ به سوی خدای خود بازگردانیده می‌شوید."
          ],
          "fa.khorramdel": [
            "بگو: فرشته‌ی مرگ که بر شما گماشته شده است، به سراغتان می‌آید و جان شما را می‌گیرد، سپس به سوی پروردگارتان بازگردانده می‌شوید. [[«یَتَوَفَّاکُمْ»: جان شما را می‌گیرد (نگا: نحل / 28 و 32، انفال / 50). «وُکِّلَ»: مأمور گشته است. گماشته شده است.]]"
          ],
          "fa.khorramshahi": [
            "بگو فرشته مرگ که بر شما گماشته شده است، روح شما را می‌گیرد، سپس به سوی پروردگارتان بازگردانده می‌شوید"
          ],
          "fa.makarem": [
            "بگو: «فرشته مرگ که بر شما مأمور شده، (روح) شما را می‌گیرد؛ سپس شما را بسوی پروردگارتان بازمی‌گردانند.»"
          ],
          "fa.moezzi": [
            "بگو دریابد شما را فرشته مرگ که گمارده شده است بر شما سپس بسوی پروردگار خویش بازگردانیده شوید"
          ],
          "fa.mojtabavi": [
            "بگو: فرشته مرگ- عزرائيل- كه بر شما گماشته شده جان شما را برگيرد- پس گم و نابود نمى‌شويد-، سپس به سوى پروردگارتان بازگردانيده شويد."
          ],
          "fa.sadeqi": [
            "بگو: «فرشته‌ی مرگ که بر شما گمارده شده، تمامی وجود شما (تن و جانتان) را به تمام و کمال برمی‌گیرد، سپس سوی پروردگارتان بازگشت می‌کنید.»"
          ]
        }
      },
      {
        "index": 3515,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:32:12",
        "text": [
          "وَ لَوْ تَرَى‌ إِذِ الْمُجْرِمُونَ‌ نَاکِسُو رُءُوسِهِمْ‌ عِنْدَ رَبِّهِمْ‌ رَبَّنَا أَبْصَرْنَا وَ سَمِعْنَا فَارْجِعْنَا نَعْمَلْ‌ صَالِحاً إِنَّا مُوقِنُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "If only you could see when the sinners will stand before their Lord, heads hung low, (and say:) \"O Lord, we have seen and heard. So send us back. We shall do the right, for we have come to believe with certainty.\""
          ],
          "en.ahmedraza": [
            "And if you see when the guilty will hang their heads before their Lord; “Our Lord! We have seen and heard, therefore send us back in order that we do good deeds – we are now convinced!”"
          ],
          "en.arberry": [
            "Ah, if thou couldst see the guilty hanging their heads before their Lord! 'Our Lord, we have seen and heard; now return us, that we may do righteousness, for we have sure faith.'"
          ],
          "en.daryabadi": [
            "Couldst thou but see when the culprits shall hang their heads before their Lord, saying: our Lord! we have now seen and heard; so send us back; we shall work righteously, verily we are convinced."
          ],
          "en.hilali": [
            "And if you only could see when the Mujrimun (criminals, disbelievers, polytheists, sinners, etc.) shall hang their heads before their Lord (saying): \"Our Lord! We have now seen and heard, so send us back (to the world), we will do righteous good deeds. Verily! We now believe with certainty.\""
          ],
          "en.itani": [
            "If only you could see the guilty, bowing their heads before their Lord: “Our Lord, we have seen and we have heard, so send us back, and we will act righteously; we are now convinced.”"
          ],
          "en.maududi": [
            "Would that you could see the guilty standing before their Lord with their heads downcast, (saying to Him): “Our Lord, we have now seen and heard, so send us back (to the world) that we might act righteously. For now we have come to have firm faith.”"
          ],
          "en.mubarakpuri": [
            "And if you only could see when the criminals shall hang their heads before their Lord (saying): \"Our Lord! We have now seen and heard, so send us back that we will do righteous good deeds. Verily, we now believe with certainty.\""
          ],
          "en.pickthall": [
            "Couldst thou but see when the guilty hang their heads before their Lord, (and say): Our Lord! We have now seen and heard, so send us back; we will do right, now we are sure."
          ],
          "en.qarai": [
            "Were you to see when the guilty hang their heads before their Lord [confessing], ‘Our Lord! We have seen and heard. Send us back so that we may act righteously. Indeed we are [now] convinced.’"
          ],
          "en.qaribullah": [
            "Would that you could see the wrongdoers when they lower their heads before their Lord! They will say: 'Our Lord, we have now seen and heard. Send us back and we will do righteous deeds, we are certain'"
          ],
          "en.sahih": [
            "If you could but see when the criminals are hanging their heads before their Lord, [saying], \"Our Lord, we have seen and heard, so return us [to the world]; we will work righteousness. Indeed, we are [now] certain.\""
          ],
          "en.sarwar": [
            "Would that you could see (on the Day of Judgment) that criminals, with their heads hanging down before their Lord, saying, \"Our Lord, we have seen and heard. Send us back to act righteously. Now we have strong faith\"."
          ],
          "en.shakir": [
            "And could you but see when the guilty shall hang down their heads before their Lord: Our Lord! we have seen and we have heard, therefore send us back, we will do good; surely (now) we are certain."
          ],
          "en.transliteration": [
            "Walaw tar<u>a</u> i<u>th</u>i almujrimoona n<u>a</u>kisoo ruoosihim AAinda rabbihim rabban<u>a</u> ab<u>s</u>arn<u>a</u> wasamiAAn<u>a</u> faarjiAAn<u>a</u> naAAmal <u>sa</u>li<u>h</u>an inn<u>a</u> mooqinoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "If only you could see the evil-doers hanging their heads in shame before their Lord, \"Our Lord, we have seen and we have heard, so send us back again and we will act rightly. For we do indeed now believe.\""
          ],
          "en.yusufali": [
            "If only thou couldst see when the guilty ones will bend low their heads before their Lord, (saying:) \"Our Lord! We have seen and we have heard: Now then send us back (to the world): we will work righteousness: for we do indeed (now) believe.\""
          ],
          "fa.ansarian": [
            "و اگر ببینی زمانی که [این] مجرمان [منکر قیامت] نزد پروردگارشان سرهایشان را به زیر افکنده اند [می بینی که می گویند:] پروردگارا! [به آنچه ما را وعده داده بودی] بینا شدیم و [به دعوت حق] شنوا گشتیم، پس ما را به دنیا برگردان تا کار شایسته انجام دهیم، بی تردید ما باور کننده [همه حقایق] هستیم."
          ],
          "fa.ayati": [
            "تو را عبرت است آنگاه كه مجرمان را در نزد پروردگارشان سرافكنده بينى. گويند: اى پروردگار ما، ديديم و شنيديم. اكنون ما را بازگردان تا كارى شايسته كنيم، كه اينك به يقين رسيده‌ايم."
          ],
          "fa.bahrampour": [
            "و اگر مى‌ديدى هنگامى كه مجرمان در پيشگاه پروردگارشان سرها را به زير افكنده [مى‌گويند]: پروردگارا! [آنچه وعده كرده بودى‌] ديديم و شنيديم، پس ما را بازگردان تا كار شايسته كنيم، كه اينك ما به يقين رسيده‌ايم"
          ],
          "fa.fooladvand": [
            "و كاش هنگامى را كه مجرمان پيش پروردگارشان سرهاشان را به زير افكنده‌اند مى‌ديدى [كه مى‌گويند:] «پروردگارا، ديديم و شنيديم؛ ما را بازگردان تا كار شايسته كنيم، چرا كه ما يقين داريم.»"
          ],
          "fa.ghomshei": [
            "و اگر تو حال بدکاران را (در قیامت) ببینی که چگونه در حضور خدای خود سر به زیر و ذلیلند (و با آه و ناله حسرت) گویند: پروردگارا، اینک (عذاب تو را) به چشم دیدیم و (سخن رسولانت را) به گوش گرفتیم، پس ما را (به دنیا) باز گردان تا صالح و نیکوکار شویم که اکنون (وعده تو را) به چشم یقین مشاهده کردیم!"
          ],
          "fa.khorramdel": [
            "اگر (می‌شد) ببینی گناهکاران را در آن هنگامی که در پیشگاه پروردگارشان (برای حساب و کتاب گرد آورده شده‌اند، و ایشان از خجالت) سر به زیر افکنده‌اند و می‌گویند: پروردگارا! دیدیم (آنچه خود را از آن به کوری زده بودیم) و شنیدیم (آنچه خود را از آن به کری زده بودیم. هم اینک پشیمانیم) پس ما را (به جهان) بازگردان تا عمل صالح انجام دهیم (و سرافراز به خدمت برگردیم). ما (به قیامت و فرموده‌ی پیغمبرانت) یقین کامل داریم. [[«نَاکِسُو رُؤُوسِهِمْ»: جمع ناکس، سر به زیر. «أَبْصَرْنَا»: دیدیم.]]"
          ],
          "fa.khorramshahi": [
            "و چون گناهکاران را نزد پروردگارشان سرافکنده بینی [گویند] پروردگارا چشم بینا و گوش شنوا یافتیم پس ما را بازگردان که کاری شایسته پیشه کنیم، ما [دیگر] اهل یقینیم‌"
          ],
          "fa.makarem": [
            "و اگر ببینی مجرمان را هنگامی که در پیشگاه پروردگارشان سر به زیر افکنده، می‌گویند: «پروردگارا! آنچه وعده کرده بودی دیدیم و شنیدیم؛ ما را بازگردان تا کار شایسته‌ای انجام دهیم؛ ما (به قیامت) یقین داریم!»"
          ],
          "fa.moezzi": [
            "و اگر بینی هنگامی که گنهکاران سرافکندگانند نزد پروردگارشان پروردگارا دیدیم و شنیدیم پس برگردان ما را تا بکنیم کاری شایسته همانا مائیم یقین‌دارندگان‌"
          ],
          "fa.mojtabavi": [
            "و اگر ببينى آنگاه كه اين بزهكاران سرهاى خويش نزد خداوندشان [به خوارى و شرم‌] در پيش افكنده باشند [گويند:] بار خدايا، ديديم و شنيديم، ما را بازگردان تا كارى نيك و شايسته كنيم، كه ما بى‌گمان باوردارنده‌ايم."
          ],
          "fa.sadeqi": [
            "و ای کاش ببینی چون مجرمان، سرافکندگان نزد پروردگارشانند (گویند): «پروردگارمان! دیدیم و شنیدیم‌؛ پس ما را بازگردان تا کار شایسته‌ای کنیم. ما (اکنون) همواره (از) یقین‌آورندگانیم.‌»"
          ]
        }
      },
      {
        "index": 3516,
        "local_index": 13,
        "part_type": "Verse",
        "path": "/books/quran:32:13",
        "text": [
          "وَ لَوْ شِئْنَا لَآتَيْنَا کُلَ‌ نَفْسٍ‌ هُدَاهَا وَ لٰکِنْ‌ حَقَ‌ الْقَوْلُ‌ مِنِّي‌ لَأَمْلَأَنَ‌ جَهَنَّمَ‌ مِنَ‌ الْجِنَّةِ وَ النَّاسِ‌ أَجْمَعِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Had We intended We could have given every soul its guidance; but inevitable is My word that I will fill up Hell with men and jinns together."
          ],
          "en.ahmedraza": [
            "And had We willed We would have given every soul its guidance, but My Word is decreed that I will certainly fill hell with these jinns and men, combined."
          ],
          "en.arberry": [
            "'If We had so willed, We could have given every soul its guidance; but now My Word is realized -- \" Assuredly I shall fill Gehenna with jinn and men all together.\""
          ],
          "en.daryabadi": [
            "And had We listed surely We could have given every soul its guidance; but true must be the word from Me; I shall surely fill Hell with the Jinn and mankind together."
          ],
          "en.hilali": [
            "And if We had willed, surely! We would have given every person his guidance, but the Word from Me took effect (about evil-doers), that I will fill Hell with jinn and mankind together."
          ],
          "en.itani": [
            "Had We willed, We could have given every soul its guidance, but the declaration from Me will come true: “I will fill Hell with jinn and humans, altogether.”"
          ],
          "en.maududi": [
            "(They will be told): “If We had so willed, We could have bestowed guidance on every person. But the Word from Me that I will fill Hell with men and jinn, all together, has been fulfilled."
          ],
          "en.mubarakpuri": [
            "And if We had willed, surely We would have given every person his guidance, but the Word from Me took effect, that I will fill Hell with Jinn and mankind together."
          ],
          "en.pickthall": [
            "And if We had so willed, We could have given every soul its guidance, but the word from Me concerning evildoers took effect: that I will fill hell with the jinn and mankind together."
          ],
          "en.qarai": [
            "Had We wished We would have given every soul its guidance, but My word became due [against the faithless]: ‘Surely I will fill hell with all the [guilty] jinn and humans.’"
          ],
          "en.qaribullah": [
            "Had We Willed, We would have guided every soul. But My Word shall be realized, 'I will fill Gehenna (Hell) with jinn and people all together'"
          ],
          "en.sahih": [
            "And if We had willed, We could have given every soul its guidance, but the word from Me will come into effect [that] \"I will surely fill Hell with jinn and people all together."
          ],
          "en.sarwar": [
            "Had We wanted, We could have given guidance to every soul, but My decree, that hell will be filled-up with jinn and people, has already been executed."
          ],
          "en.shakir": [
            "And if We had pleased We would certainly have given to every soul its guidance, but the word (which had gone forth) from Me was just: I will certainly fill hell with the jinn and men together."
          ],
          "en.transliteration": [
            "Walaw shin<u>a</u> la<u>a</u>tayn<u>a</u> kulla nafsin hud<u>a</u>h<u>a</u> wal<u>a</u>kin <u>h</u>aqqa alqawlu minnee laamlaanna jahannama mina aljinnati wa<b>al</b>nn<u>a</u>si ajmaAAeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "Yet had We so willed, We could indeed have imposed Our guidance upon every human being: but My word shall come true: \"I will fill Hell with jinns and men all together.\""
          ],
          "en.yusufali": [
            "If We had so willed, We could certainly have brought every soul its true guidance: but the Word from Me will come true, \"I will fill Hell with Jinns and men all together.\""
          ],
          "fa.ansarian": [
            "و اگر می خواستیم، هدایت هرکسی را [از روی اجبار] به او عطا می کردیم، [اما همه را آزاد و مختار آفریدیم تا راه هدایت یا گمراهی را خود انتخاب کنند] ولی فرمان من بر عذاب لازم و حتم شده است که بی تردید دوزخ را از همه جنّیان و آدمیان [که آیات من را تکذیب کردند] پر خواهم کرد."
          ],
          "fa.ayati": [
            "اگر مى‌خواستيم، هدايت هر كس را به او ارزانى مى‌داشتيم. ولى وعده من كه جهنم را از همه جنيان و آدميان پر مى‌كنم، حق است."
          ],
          "fa.bahrampour": [
            "و اگر مى‌خواستيم، به هر كسى [از روى جبر] هدايتش را مى‌داديم، ليكن اين سخن از جانب من حتمى شده است كه به يقين جهنم را از همه جنّيان و آدميان [كه به اختيار خود خلاف مى‌كنند] آكنده سازم"
          ],
          "fa.fooladvand": [
            "و اگر مى‌خواستيم، حتماً به هر كسى [از روى جبر] هدايتش را مى‌داديم، ليكن سخن من محقَقَ گرديده كه: «هر آينه جهنم را از همه جنيان و آدميان خواهم آكند.»"
          ],
          "fa.ghomshei": [
            "و اگر ما (به مشیّت ازلی) می‌خواستیم، هر نفسی را به کمال هدایتش (به جبر و الزام) می‌رسانیدیم و لیکن وعده حقّ و حتمی من است که دوزخ را البته از همه (کافران) جنّ و انس پر سازم."
          ],
          "fa.khorramdel": [
            "اگر ما می‌خواستیم به هر انسانی هدایت لازمه‌اش را می‌دادیم، ولیکن (انسان را صاحب اراده و مکلّف به تکالیف و مسؤول در برابر اعمال خود، و قابل هدایت به وسیله‌ی پیغمبران آفریدیم و) من مقرّر کردم که دوزخ را از جملگی افراد (بی‌ایمان و گناهکار) جنّ و انس پر کنم. [[«وَ لَوْ شِئْنَا»: (نگا: انعام / 39، هود / 118). «حَقَّ الْقَوْلُ»: (نگا: نمل / 82). «لأَمَلاَنَّ جَهَنَّمَ ...»: (نگا: اعراف / 18).]]"
          ],
          "fa.khorramshahi": [
            "و اگر خواهیم به هر انسانی هدایتش را ارزانی می‌داریم، ولی وعده من تحقق یافته است که جهنم را از جن و انس، همگان، آکنده سازم‌"
          ],
          "fa.makarem": [
            "و اگر می‌خواستیم به هر انسانی هدایت لازمش را (از روی اجبار بدهیم) می‌دادیم؛ ولی (من آنها را آزاد گذارده‌ام و) سخن و وعده‌ام حق است که دوزخ را (از افراد بی‌ایمان و گنهکار) از جنّ و انس همگی پر کنم!"
          ],
          "fa.moezzi": [
            "و اگر می‌خواستیم هر آینه می‌دادیم به هر کس رهبریش را و لیکن استوار گشت سخن از من که همانا پر سازم دوزخ را از پریان و مردم همگی‌"
          ],
          "fa.mojtabavi": [
            "و اگر مى‌خواستيم، هر آينه به هر كسى رهنمونى‌اش را مى‌داديم و ليكن اين سخن از من براستى [از پيش‌] رفته است كه همانا دوزخ را از پريان و آدميان همگى پُر كنم- يعنى همه كسانى را كه گمراهى را بر راه راست برگزيدند و سزاوار عذاب شدند-."
          ],
          "fa.sadeqi": [
            "و اگر می‌خواستیم، همانا به هر کسی (ناگزیر) هدایتش را می‌دادیم، لیکن این سخن از من محقّق گردیده که: «هر آینه به‌راستی جهنّم را از همه‌ی جنّیان و آدمیان خواهم آکند.»"
          ]
        }
      },
      {
        "index": 3517,
        "local_index": 14,
        "part_type": "Verse",
        "path": "/books/quran:32:14",
        "text": [
          "فَذُوقُوا بِمَا نَسِيتُمْ‌ لِقَاءَ يَوْمِکُمْ‌ هٰذَا إِنَّا نَسِينَاکُمْ‌ وَ ذُوقُوا عَذَابَ‌ الْخُلْدِ بِمَا کُنْتُمْ‌ تَعْمَلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "So now suffer. As you forgot the meeting of this your Day of Doom, so have We forgotten you. Now taste the everlasting punishment for your deeds."
          ],
          "en.ahmedraza": [
            "“Therefore taste the recompense of your forgetting the confronting of this day of yours; We have abandoned you – now taste the everlasting punishment, the recompense of your deeds!”"
          ],
          "en.arberry": [
            "So now taste, for that you forgot the encounter of this your day! We indeed have forgotten you. Taste the chastisement of eternity for that you were doing!'"
          ],
          "en.daryabadi": [
            "So taste ye the sequel, for as much as ye forgat the meeting of this your day, verily We have forgotten you. Taste the torment abiding for that which ye have been working."
          ],
          "en.hilali": [
            "Then taste you (the torment of the Fire) because of your forgetting the Meeting of this Day of yours, (and) surely! We too will forget you, so taste you the abiding torment for what you used to do."
          ],
          "en.itani": [
            "So taste, because you forgot the meeting of this Day of yours; We have forgotten you; so taste the eternal torment for what you used to do."
          ],
          "en.maududi": [
            "So taste the chastisement on account of your forgetting the encounter of this Day. We, too, have forgotten you. Taste the eternal chastisement as a requital for your misdeeds.”"
          ],
          "en.mubarakpuri": [
            "Then taste because of your forgetting the meeting of this Day of yours. Surely, We too will forget you, so taste you the abiding torment for what you used to do."
          ],
          "en.pickthall": [
            "So taste (the evil of your deeds). Forasmuch as ye forgot the meeting of this your day, lo! We forget you. Taste the doom of immortality because of what ye used to do."
          ],
          "en.qarai": [
            "So taste [the punishment] for your having forgotten the encounter of this day of yours. We [too] have forgotten you. Taste the everlasting punishment because of what you used to do."
          ],
          "en.qaribullah": [
            "(We shall say to them): 'Now taste, for you forgot the encounter of this Day, We have forgotten you. Taste Our eternal punishment, for that which you were doing'"
          ],
          "en.sahih": [
            "So taste [punishment] because you forgot the meeting of this, your Day; indeed, We have [accordingly] forgotten you. And taste the punishment of eternity for what you used to do.\""
          ],
          "en.sarwar": [
            "They will be told, \"Suffer on this Day of Judgment. For your having ignored it, We have ignored you. Suffer everlasting torment for your evil deeds.\""
          ],
          "en.shakir": [
            "So taste, because you neglected the meeting of this day of yours; surely We forsake you; and taste the abiding chastisement for what you did."
          ],
          "en.transliteration": [
            "Fa<u>th</u>ooqoo bim<u>a</u> naseetum liq<u>a</u>a yawmikum h<u>atha</u> inn<u>a</u> naseen<u>a</u>kum wa<u>th</u>ooqoo AAa<u>tha</u>ba alkhuldi bim<u>a</u> kuntum taAAmaloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "We shall say to them, \"Taste this -- for you forgot you would ever meet this Day. We too will forget you -- taste the chastisement of Eternity for your [evil] deeds!\""
          ],
          "en.yusufali": [
            "\"Taste ye then - for ye forgot the Meeting of this Day of yours, and We too will forget you - taste ye the Penalty of Eternity for your (evil) deeds!\""
          ],
          "fa.ansarian": [
            "پس [به آنان گویند:] به کیفر آنکه دیدار امروزتان را فراموش کردید [عذاب دوزخ را] بچشید، که ما [هم] شما را واگذاشته ایم، و به کیفر آنچه همواره انجام می دادید، عذاب جاودانه را بچشید."
          ],
          "fa.ayati": [
            "به كيفر آنكه ديدار چنين روزى را فراموش كرده بوديد، اكنون بچشيد. ما نيز شما را از ياد برده‌ايم. به سزاى كارهايى كه مى‌كرده‌ايد عذاب جاويد را بچشيد."
          ],
          "fa.bahrampour": [
            "پس به [سزاى‌] آن كه ديدار اين روزتان را از ياد برديد [عذاب را] بچشيد. ما نيز شما را از ياد برده‌ايم، و بچشيد عذاب هميشگى را به خاطر اعمالى كه انجام مى‌داديد"
          ],
          "fa.fooladvand": [
            "پس به [سزاى‌] آنكه ديدار اين روزتان را از ياد برديد [عذاب را] بچشيد؛ ما [نيز] فراموشتان كرديم، و به [سزاى‌] آنچه انجام مى‌داديد عذاب جاودان را بچشيد."
          ],
          "fa.ghomshei": [
            "پس (خطاب رسد: امروز) شما ای کافران (عذاب را) به کیفر غفلت از ملاقات این روزتان بچشید که ما هم شما را فراموش کردیم (یعنی از نظر لطف انداختیم) و اینک عذاب ابدی را به پاداش اعمال زشتی که می‌کردید بچشید."
          ],
          "fa.khorramdel": [
            "بچشید (عذاب جهنّم را) به خاطر این که ملاقات امروز خود را (با پروردگارتان برای حساب و کتاب) فراموش کرده‌اید، و ما نیز شما را (در میان عذاب رها و) به دست فراموشی می‌سپاریم، و بچشید عذاب همیشگی را به سبب اعمالی که (در دنیا) انجام می‌داده‌اید. [[«نَسِیتُمْ»: فراموش کرده‌اید. مراد از فراموشی، ترک اعمالی است که سبب نجات می‌گردند. «نَسِینَاکُمْ»: شما را فراموش کرده‌ایم. مراد رها ساختن در عذاب است. «الْخُلْدِ»: جاودانگی. همیشگی.]]"
          ],
          "fa.khorramshahi": [
            "پس به خاطر آنکه دیدار این روزتان را فراموش کردید [عذاب را] بچشید ما نیز \"فراموشتان\" کرده‌ایم و عذاب جاویدان را به خاطر کار و کردار پیشینتان بچشید"
          ],
          "fa.makarem": [
            "(و به آنها می‌گویم:) بچشید (عذاب جهنم را)! بخاطر اینکه دیدار امروزتان را فراموش کردید، ما نیز شما را فراموش کردیم؛ و بچشید عذاب جاودان را به خاطر اعمالی که انجام می‌دادید!"
          ],
          "fa.moezzi": [
            "پس بچشید بدانچه فراموش کردید رسیدن را به روزتان این همانا ما فراموشتان کردیم و بچشید عذاب دوزخ را بدانچه بودید می‌کردید"
          ],
          "fa.mojtabavi": [
            "پس [عذاب را] بچشيد به سزاى آنكه ديدار اين روزتان را فراموش كرديد، ما هم شما را به فراموشى سپرديم- فرو گذاشتيم- و عذاب جاويدان را به سزاى آنچه مى‌كرديد بچشيد."
          ],
          "fa.sadeqi": [
            "«پس به (سزای) آنکه دیدار این روزتان را نادیده گرفتید (عذاب را) بچشید؛ به‌راستی ما (نیز) فراموشتان کردیم و به (سزای) آنچه انجام می‌داده‌اید عذاب جاودان را بچشید.»"
          ]
        }
      },
      {
        "index": 3518,
        "local_index": 15,
        "part_type": "Verse",
        "path": "/books/quran:32:15",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:3:4:64:11"
          ]
        },
        "sajda_type": "obligatory",
        "text": [
          "إِنَّمَا يُؤْمِنُ‌ بِآيَاتِنَا الَّذِينَ‌ إِذَا ذُکِّرُوا بِهَا خَرُّوا سُجَّداً وَ سَبَّحُوا بِحَمْدِ رَبِّهِمْ‌ وَ هُمْ‌ لاَ يَسْتَکْبِرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Only they believe in Our revelations who, when they are reminded, bow in adoration, and give praise to their Lord, and do not become arrogant."
          ],
          "en.ahmedraza": [
            "Only those believe in Our signs who, when they are reminded of them, fall down in prostration and proclaim the Purity of their Lord while praising Him, and are not conceited. (Command of prostration # 9)."
          ],
          "en.arberry": [
            "Only those believe in Our signs who, when they are reminded of them, fall down prostrate and proclaim the praise of their Lord, not waxing proud."
          ],
          "en.daryabadi": [
            "They alone believe in Our revelations who, when they are reminded thereof, fall down prostrate and hallow the praise of their Lord, and they are not stiff-necked."
          ],
          "en.hilali": [
            "Only those believe in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), who, when they are reminded of them fall down prostrate, and glorify the Praises of their Lord, and they are not proud."
          ],
          "en.itani": [
            "They believe in Our communications, those who, when reminded of them, fall down prostrate, and glorify their Lord with praise, and are not proud."
          ],
          "en.maududi": [
            "None believes in Our Signs except those who, when they are given good counsel through Our verses, fall down prostrate and celebrate the praise of their Lord and do not wax proud."
          ],
          "en.mubarakpuri": [
            "Only those believe in Our Ayat, who, when they are reminded of them, fall down prostrate, and glorify the praises of their Lord, and they are not proud."
          ],
          "en.pickthall": [
            "Only those believe in Our revelations who, when they are reminded of them, fall down prostrate and hymn the praise of their Lord, and they are not scornful,"
          ],
          "en.qarai": [
            "Only those believe in Our signs who, when they are reminded of them, fall down in prostration and celebrate the praise of their Lord, and they are not arrogant."
          ],
          "en.qaribullah": [
            "Only those who believe in Our verses, when reminded of them, prostrate themselves and exalt with the praise of their Lord in humility;"
          ],
          "en.sahih": [
            "Only those believe in Our verses who, when they are reminded by them, fall down in prostration and exalt [Allah] with praise of their Lord, and they are not arrogant."
          ],
          "en.sarwar": [
            "The only people who believe in Our revelations are those who, when reminded about them, bow down in prostration and glorify their Lord with His praise without pride."
          ],
          "en.shakir": [
            "Only they believe in Our communications who, when they are reminded of them, fall down in prostration and celebrate the praise of their Lord, and they are not proud."
          ],
          "en.transliteration": [
            "Innam<u>a</u> yuminu bi<u>a</u>y<u>a</u>tin<u>a</u> alla<u>th</u>eena i<u>tha</u> <u>th</u>ukkiroo bih<u>a</u> kharroo sujjadan wasabba<u>h</u>oo bi<u>h</u>amdi rabbihim wahum l<u>a</u> yastakbiroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "The people who truly believe in Our messages are those who fall to the ground in prostration when they are reminded of them, and glorify their Lord with praise and are not arrogant."
          ],
          "en.yusufali": [
            "Only those believe in Our Signs, who, when they are recited to them, fall down in prostration, and celebrate the praises of their Lord, nor are they (ever) puffed up with pride."
          ],
          "fa.ansarian": [
            "فقط کسانی به آیات ما ایمان می آورند که وقتی به وسیله آن آیات به آنان تذکر داده شود، سجده کنان به رو در می افتند و همراه با سپاس، پروردگارشان را از هر عیب و نقصی تنزیه می کنند در حالی که [از سجده و سپاس و تنزیه] تکبّر و سرکشی نمی ورزند؛"
          ],
          "fa.ayati": [
            "تنها كسانى به آيات ما ايمان آورده‌اند كه چون آيات ما را بشنوند به سجده بيفتند و پروردگارشان را به پاكى بستايند و سركشى نكنند."
          ],
          "fa.bahrampour": [
            "تنها كسانى به آيات ما مى‌گروند كه چون آن را به ايشان يادآورى كنند، به حال سجده مى‌افتند و به ستايش پروردگارشان تسبيح مى‌گويند و آنها بزرگى نمى‌فروشند"
          ],
          "fa.fooladvand": [
            "تنها كسانى به آيات ما مى‌گروند كه چون آن [آيات‌] را به ايشان يادآورى كنند، سجده‌كنان به روى درمى‌افتند، و به ستايش پروردگارشان تسبيح مى‌گويند و آنان بزرگى نمى‌فروشند."
          ],
          "fa.ghomshei": [
            "تنها کسانی به آیات ما ایمان می‌آورند که چون متذکّر آیات ما شوند به سجده رخ بر خاک نهند و تسبیح و تنزیه و ستایش پروردگار کنند و ابدا به کبر و نخوت سر از فرمان حق نکشند."
          ],
          "fa.khorramdel": [
            "تنها کسانی به آیات ما ایمان دارند که هر وقت بدانها پند داده شوند، (برای خدا) به سجده می‌افتند، و ستایشگرانه به تسبیح پروردگارشان می‌پردازند و تکبّر نمی‌ورزند. [[«ذُکِّرُوا بِهَا»: بدان پند داده شدند. «سُجَّداً»: جمع ساجِد، سجده کنندگان. «بِحَمْدِ رَبِّهِمْ»: متلبّس به حمد و ستایش پروردگارشان هستند. حرف (ب) برای ملابسه و جار و مجرور در موضع حال است.]]"
          ],
          "fa.khorramshahi": [
            "به آیات ما فقط کسانی ایمان آورند که چون آنها را فرایادشان آرند، به سجده درافتند و پروردگارشان را شاکرانه تسبیح گویند و تکبرنورزند"
          ],
          "fa.makarem": [
            "تنها کسانی که به آیات ما ایمان می‌آورند که هر وقت این آیات به آنان یادآوری شود به سجده می‌افتند و تسبیح و حمد پروردگارشان را بجا می‌آورند، و تکبّر نمی‌کنند."
          ],
          "fa.moezzi": [
            "جز این نیست که ایمان آرند به آیتهای ما آنان که هر گاه یادآوری شوند بدانها بیفتد سجده‌کنان و تسبیح گویند به سپاس پروردگار خویش و ایشانند کبرناورزندگان‌"
          ],
          "fa.mojtabavi": [
            "جز اين نيست كه كسانى به آيات ما ايمان مى‌آورند كه چون بدانها يادآورى شوند سجده‌كنان بيفتند و پروردگار خويش را همراه با سپاس و ستايش به پاكى ياد كنند و گردنكشى نكنند"
          ],
          "fa.sadeqi": [
            "تنها کسانی به آیاتمان می‌گروند که اگر هنگامی آنها را به ایشان یادآوری کنند، سجده‌کنان به روی درمی‌افتند و با ستایش پروردگارشان، تسبیح می‌گویند، حال آنکه ایشان کبرجو نیستند."
          ]
        }
      },
      {
        "index": 3519,
        "local_index": 16,
        "part_type": "Verse",
        "path": "/books/quran:32:16",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:2:1:13:15"
          ]
        },
        "text": [
          "تَتَجَافَى‌ جُنُوبُهُمْ‌ عَنِ‌ الْمَضَاجِعِ‌ يَدْعُونَ‌ رَبَّهُمْ‌ خَوْفاً وَ طَمَعاً وَ مِمَّا رَزَقْنَاهُمْ‌ يُنْفِقُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Their backs do not rest on their beds, and they pray to their Lord in fear and hope, and spend of what We have given them (in charity)."
          ],
          "en.ahmedraza": [
            "Their sides stay detached from their beds and they pray to their Lord with fear and hope – and they spend from what We have bestowed upon them."
          ],
          "en.arberry": [
            "Their sides shun their couches as they call on their Lord in fear and hope; and they expend of that We have provided them."
          ],
          "en.daryabadi": [
            "Their sides leave off the couches calling upon their Lord in fear and in desire, and of that wherewith We have provided them they expend."
          ],
          "en.hilali": [
            "Their sides forsake their beds, to invoke their Lord in fear and hope, and they spend (charity in Allah's Cause) out of what We have bestowed on them."
          ],
          "en.itani": [
            "Their sides shun their beds, as they pray to their Lord, out of reverence and hope; and from Our provisions to them, they give."
          ],
          "en.maududi": [
            "Their sides forsake their beds, and they call upon their Lord in fear and hope, and expend (in charity) out of the sustenance We have granted them."
          ],
          "en.mubarakpuri": [
            "Their sides forsake their beds, to invoke their Lord in fear and hope, and they spend out of what We have bestowed on them."
          ],
          "en.pickthall": [
            "Who forsake their beds to cry unto their Lord in fear and hope, and spend of that We have bestowed on them."
          ],
          "en.qarai": [
            "Their sides vacate their beds to supplicate their Lord in fear and hope, and they spend out of what We have provided them."
          ],
          "en.qaribullah": [
            "whose sides forsake their couches as they supplicate to their Lord in fear and hope; who give in charity of that which We have given them."
          ],
          "en.sahih": [
            "They arise from [their] beds; they supplicate their Lord in fear and aspiration, and from what We have provided them, they spend."
          ],
          "en.sarwar": [
            "Their sides give-up rest in beds in order to pray before their Lord in fear and hope. They spend for the cause of God out of what we have given them."
          ],
          "en.shakir": [
            "Their sides draw away from (their) beds, they call upon their Lord in fear and in hope, and they spend (benevolently) out of what We have given them."
          ],
          "en.transliteration": [
            "Tataj<u>a</u>f<u>a</u> junoobuhum AAani alma<u>da</u>jiAAi yadAAoona rabbahum khawfan wa<u>t</u>amaAAan wamimm<u>a</u> razaqn<u>a</u>hum yunfiqoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "They forsake their beds, calling upon their Lord in fear and in hope, and spend out of what We have provided them with."
          ],
          "en.yusufali": [
            "Their limbs do forsake their beds of sleep, the while they call on their Lord, in Fear and Hope: and they spend (in charity) out of the sustenance which We have bestowed on them."
          ],
          "fa.ansarian": [
            "[ملازم بستر استراحت و خواب نیستند، بلکه] پهلوهایشان از خوابگاه هایشان دور می شود در حالی که همواره پروردگارشان را به علت بیم [از عذاب] و امید [به رحمت و پاداش] می خوانند و از آنچه آنان را روزی داده ایم، انفاق می کنند."
          ],
          "fa.ayati": [
            "از بستر خواب پهلو تهى مى‌كنند، پروردگارشان را با بيم و اميد مى‌خوانند و از آنچه به آنها داده‌ايم انفاق مى‌كنند."
          ],
          "fa.bahrampour": [
            "از بسترهاى خواب [براى عبادت شب‌] پهلو تهى مى‌كنند و پروردگارشان را با خوف و رجا مى‌خوانند و از آنچه روزيشان كرده‌ايم انفاق مى‌كنند"
          ],
          "fa.fooladvand": [
            "پهلوهايشان از خوابگاهها جدا مى‌گردد [و] پروردگارشان را از روى بيم و طمع مى‌خوانند، و از آنچه روزيشان داده‌ايم انفاق مى‌كنند."
          ],
          "fa.ghomshei": [
            "(شبها) پهلو از بستر خواب تهی کنند و با بیم و امید (و ناله اشتیاق در نماز شب) خدای خود را بخوانند و آنچه روزی آنها کرده‌ایم (به مسکینان) انفاق کنند."
          ],
          "fa.khorramdel": [
            "پهلوهایش از بسترها به دور می‌شود (و خواب شیرین را ترک گفته و به عبادت پروردگارشان می‌پردازند و) پروردگار خود را با بیم و امید به فریاد می‌خوانند، و از چیزهائی که بدیشان داده‌ایم می‌بخشند. [[«تَتَجَافی»: رها و به دور می‌شوند. مراد برخاستن از خواب خوش و ترک بستر نرم و گرم است. «الْمَضَاجِعِ»: جمع مَضْجَع، بسترها، رختخوابها. «خَوْفاً وَ طَمَعاً»: با بیم و امید. در حال خوف و رجا. مفعول مطلق فعل محذوف بوده و تقدیر چنین است: یَخَافُونَ خَوْفاً وَ یَطْمَعُونَ طَمَعاً. یا این که حال ضمیر (و) است و به معنی خَآئِفِینَ وَ طَامِعِینَ می‌باشند.]]"
          ],
          "fa.khorramshahi": [
            "پهلوهایشان از بسترها جدا شود [و به نیایش شبانه برخیزند و] پروردگارشان را با بیم و امید بخوانند و از آنچه روزیشان کرده‌ایم ببخشند"
          ],
          "fa.makarem": [
            "پهلوهایشان از بسترها در دل شب دور می‌شود (و بپا می‌خیزند و رو به درگاه خدا می آورند) و پروردگار خود را با بیم و امید می‌خوانند، و از آنچه به آنان روزی داده‌ایم انفاق می‌کنند!"
          ],
          "fa.moezzi": [
            "دوری گزیند پهلوهای ایشان از خوابگاه‌ها خوانند پروردگار خویش را بیمی و امیدی و از آنچه روزیشان دادیم ببخشند"
          ],
          "fa.mojtabavi": [
            "پهلوهاشان از بسترها [براى نماز شب‌] دور مى‌شود، پروردگار خويش را با بيم و اميد مى‌خوانند و از آنچه روزيشان داده‌ايم انفاق مى‌كنند."
          ],
          "fa.sadeqi": [
            "پهلوهایشان از خوابگاه‌ها(شان) جدا می‌گردد حال آنکه پروردگارشان را از روی بیم و طمع می‌خوانند و از آنچه روزیشان دادیم انفاق می‌کنند."
          ]
        }
      },
      {
        "index": 3520,
        "local_index": 17,
        "part_type": "Verse",
        "path": "/books/quran:32:17",
        "text": [
          "فَلاَ تَعْلَمُ‌ نَفْسٌ‌ مَا أُخْفِيَ‌ لَهُمْ‌ مِنْ‌ قُرَّةِ أَعْيُنٍ‌ جَزَاءً بِمَا کَانُوا يَعْمَلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "No soul knows what peace and joy lie hidden from them as reward for what they have done."
          ],
          "en.ahmedraza": [
            "So no soul knows the comfort of the eyes that is kept hidden for them*; the reward of their deeds. (Paradise)"
          ],
          "en.arberry": [
            "No soul knows what comfort is laid up for them secretly, as a recompense for that they were doing."
          ],
          "en.daryabadi": [
            "No soul knoweth that which is kept hidden for them of perfect comfort as a recompense for that which they have been working."
          ],
          "en.hilali": [
            "No person knows what is kept hidden for them of joy as a reward for what they used to do."
          ],
          "en.itani": [
            "No soul knows what eye’s delight awaits them—a reward for what they used to do."
          ],
          "en.maududi": [
            "No one knows what delights of the eyes are kept hidden for them as a reward for their deeds."
          ],
          "en.mubarakpuri": [
            "No person knows what is kept hidden for them of delights of eyes as a reward for what they used to do."
          ],
          "en.pickthall": [
            "No soul knoweth what is kept hid for them of joy, as a reward for what they used to do."
          ],
          "en.qarai": [
            "No one knows what delights have been kept hidden for them [in the Hereafter] as a reward for what they used to do."
          ],
          "en.qaribullah": [
            "No soul knows what pleases the eye is in store for them as a recompense for what they used to do."
          ],
          "en.sahih": [
            "And no soul knows what has been hidden for them of comfort for eyes as reward for what they used to do."
          ],
          "en.sarwar": [
            "No soul knows what delight awaits them as the reward for their deeds."
          ],
          "en.shakir": [
            "So no soul knows what is hidden for them of that which will refresh the eyes; a reward for what they did."
          ],
          "en.transliteration": [
            "Fal<u>a</u> taAAlamu nafsun m<u>a</u> okhfiya lahum min qurrati aAAyunin jaz<u>a</u>an bim<u>a</u> k<u>a</u>noo yaAAmaloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "No soul knows what joy is kept hidden in store for them as a reward for their labours."
          ],
          "en.yusufali": [
            "Now no person knows what delights of the eye are kept hidden (in reserve) for them - as a reward for their (good) deeds."
          ],
          "fa.ansarian": [
            "پس هیچ کس نمی داند چه چیزهایی که مایه شادمانی و خوشحالی آنان است به پاداش اعمالی که همواره انجام می داده اند، برای آنان پنهان داشته اند."
          ],
          "fa.ayati": [
            "و هيچ كس از آن مايه شادمانى خبر ندارد كه به پاداش كارهايى كه مى‌كرده برايش اندوخته شده است."
          ],
          "fa.bahrampour": [
            "پس هيچ كس نمى‌داند چه چيزى از روشنى چشم‌ها به پاداش آنچه انجام مى‌دادند برايشان نهفته شده است"
          ],
          "fa.fooladvand": [
            "هيچ كس نمى‌داند چه چيز از آنچه روشنى‌بخش ديدگان است به [پاداش‌] آنچه انجام مى‌دادند براى آنان پنهان كرده‌ام."
          ],
          "fa.ghomshei": [
            "پس هیچ کس نمی‌داند که به پاداش نیکوکاریشان چه نعمت و لذّتهای بی‌نهایت که روشنی‌بخش (دل و) دیده است در عالم غیب برایشان ذخیره شده است."
          ],
          "fa.khorramdel": [
            "هیچ کس نمی‌داند، در برابر کارهائی که (مؤمنان) انجام می‌دهند، چه چیزهای شادی‌آفرین و مسرّت‌بخشی برای ایشان پنهان شده است. [[«مَآ أُخْفِیَ لَهُمْ»: چیزهائی که برای آنان پنهان شده است. مراد مواهب عظیم و نعمتهای فراوانی است که برای مؤمنان تهیّه دیده شده است. «قُرَّةِ أَعْیُنٍ»: مایه روشنایی چشم. مراد چیزهائی شادی‌آفرین و مسرّت‌بخش است (نگا: طه / 40). «جَزَآءً»: مفعول له است.]]"
          ],
          "fa.khorramshahi": [
            "آری هیچ کسی نداند که چه بسیار مایه روشنی چشمها برای آنان نهفته است، که جزای کار و کردار پیشینشان است‌"
          ],
          "fa.makarem": [
            "هیچ کس نمی‌داند چه پاداشهای مهمّی که مایه روشنی چشمهاست برای آنها نهفته شده، این پاداش کارهائی است که انجام می‌دادند!"
          ],
          "fa.moezzi": [
            "پس نمی‌داند کسی چه نهان شده است برای ایشان از روشنی‌چشم پاداشی بدانچه بودند می‌کردند"
          ],
          "fa.mojtabavi": [
            "پس هيچ كس نمى‌داند آنچه از روشنى چشمها براى ايشان نهفته شده، به پاداش آنچه مى‌كردند."
          ],
          "fa.sadeqi": [
            "پس هیچ کسی نمی‌داند، چه چیزی از روشنی‌بخش دیدگان - به (پاداش) آنچه انجام می‌دادند- برایشان پنهان شده است."
          ]
        }
      },
      {
        "index": 3521,
        "local_index": 18,
        "part_type": "Verse",
        "path": "/books/quran:32:18",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:2:1:17:1"
          ]
        },
        "text": [
          "أَ فَمَنْ‌ کَانَ‌ مُؤْمِناً کَمَنْ‌ کَانَ‌ فَاسِقاً لاَ يَسْتَوُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Is one who is a believer like one who is a transgressor? No, they are not alike."
          ],
          "en.ahmedraza": [
            "So will the believer ever be equal to the one who is lawless? They are not equal!"
          ],
          "en.arberry": [
            "What? Is he who has been a believer like unto him who has been ungodly? They are not equal."
          ],
          "en.daryabadi": [
            "Shall he, therefore, who is a believer, be like unto him who is a transgressor? They are not equal."
          ],
          "en.hilali": [
            "Is then he who is a believer like him who is Fasiq (disbeliever and disobedient to Allah)? Not equal are they."
          ],
          "en.itani": [
            "Is someone who is faithful like someone who is a sinner? They are not equal."
          ],
          "en.maududi": [
            "Would a true believer be like him who was an evil-doer? Surely they are not equal."
          ],
          "en.mubarakpuri": [
            "Is then he who is a believer like him who is rebellious Not equal are they."
          ],
          "en.pickthall": [
            "Is he who is a believer like unto him who is an evil-liver? They are not alike."
          ],
          "en.qarai": [
            "Is someone who is faithful like someone who is a transgressor? They are not equal."
          ],
          "en.qaribullah": [
            "Can he, then, who is a believer, be compared to he who is wicked? They are not equal."
          ],
          "en.sahih": [
            "Then is one who was a believer like one who was defiantly disobedient? They are not equal."
          ],
          "en.sarwar": [
            "Is a believer equal to an evil-doer? They are not equal at all."
          ],
          "en.shakir": [
            "Is he then who is a believer like him who is a transgressor? They are not equal."
          ],
          "en.transliteration": [
            "Afaman k<u>a</u>na muminan kaman k<u>a</u>na f<u>a</u>siqan l<u>a</u> yastawoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "So, is someone who believes equal to someone who defies God? No, they are not equal."
          ],
          "en.yusufali": [
            "Is then the man who believes no better than the man who is rebellious and wicked? Not equal are they."
          ],
          "fa.ansarian": [
            "با این حال آیا کسانی که مؤمن اند مانند کسانی هستند که فاسق اند؟ [نه هرگز این دو گروه] مساوی و یکسان نیستند."
          ],
          "fa.ayati": [
            "آيا آن كس كه ايمان آورده همانند كسى است كه عصيان مى‌ورزد؟ نه، برابر نيستند."
          ],
          "fa.bahrampour": [
            "پس آيا كسى كه مؤمن است مانند كسى است كه نافرمان است؟ برابر نيستند"
          ],
          "fa.fooladvand": [
            "آيا كسى كه مؤمن است، چون كسى است كه نافرمان است؟ يكسان نيستند."
          ],
          "fa.ghomshei": [
            "آیا آن کس که ایمان آورده (حالش در قیامت) مانند کسی است که کافر بوده؟ هرگز یکسان نخواهند بود."
          ],
          "fa.khorramdel": [
            "آیا کسی که مؤمن بوده است، همچون کسی است که فاسق بوده است؟! (نه، هرگز! این دو) برابر نیستند. [[«فَاسِقاً»: خارج از دین خدا. کافر. «لا یَسْتَوُونَ»: برابر و یکسان نیستند. چون مراد از (مَنْ) دسته و گروه است، این فعل به صورت صیغه جمع آورده شده است.]]"
          ],
          "fa.khorramshahi": [
            "آیا کسی که مؤمن است همانند کسی است که فاسق است؟ [هرگز] برابر نیستند"
          ],
          "fa.makarem": [
            "آیا کسی که باایمان باشد همچون کسی است که فاسق است؟! نه، هرگز این دو برابر نیستند."
          ],
          "fa.moezzi": [
            "پس آیا آنکه مؤمن است مانند آنی است که نابفرمان است نیستند یکسان‌"
          ],
          "fa.mojtabavi": [
            "آيا كسى كه مؤمن است همچون كسى است كه از فرمان [خداى‌] بيرون رفته؟ هرگز برابر نيستند."
          ],
          "fa.sadeqi": [
            "آیا پس کسی که مؤمن بوده، چون کسی است که نافرمان بوده‌؟ (نه! اینان) یکسان نیستند."
          ]
        }
      },
      {
        "index": 3522,
        "local_index": 19,
        "part_type": "Verse",
        "path": "/books/quran:32:19",
        "text": [
          "أَمَّا الَّذِينَ‌ آمَنُوا وَ عَمِلُوا الصَّالِحَاتِ‌ فَلَهُمْ‌ جَنَّاتُ‌ الْمَأْوَى‌ نُزُلاً بِمَا کَانُوا يَعْمَلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "As for those who believe and do the right, there are gardens for abode as welcome for what they had done."
          ],
          "en.ahmedraza": [
            "Those who accepted faith and did good deeds – for them are the Gardens of (everlasting) stay; a welcome in return for what they did."
          ],
          "en.arberry": [
            "As for those who believe, and do deeds of righteousness, there await them the Gardens of the Refuge, in hospitality for that they were doing."
          ],
          "en.daryabadi": [
            "And as for those who believe and work rigteous works--for them are Gardens of Abode: an entertainment for that which they have been working."
          ],
          "en.hilali": [
            "As for those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, for them are Gardens (Paradise) as an entertainment, for what they used to do."
          ],
          "en.itani": [
            "As for those who believe and do righteous deeds, for them are the Gardens of Shelter—hospitality for what they used to do."
          ],
          "en.maududi": [
            "As for those who believe and act righteously, theirs shall be Gardens to dwell in, a hospitality to reward them for their deeds."
          ],
          "en.mubarakpuri": [
            "As for those who believe and do righteous good deeds, for them are Gardens of Abode as an entertainment for what they used to do."
          ],
          "en.pickthall": [
            "But as for those who believe and do good works, for them are the Gardens of Retreat - a welcome (in reward) for what they used to do."
          ],
          "en.qarai": [
            "As for those who have faith and do righteous deeds, for them will be the gardens of the Abode—a hospitality for what they used to do."
          ],
          "en.qaribullah": [
            "As for those who believe and do good works, there are for them the Gardens of Refuge, in hospitality for that which they have done."
          ],
          "en.sahih": [
            "As for those who believed and did righteous deeds, for them will be the Gardens of Refuge as accommodation for what they used to do."
          ],
          "en.sarwar": [
            "The righteously striving believers will have Paradise for their dwelling as the reward of their good deeds."
          ],
          "en.shakir": [
            "As for those who believe and do good, the gardens are their abiding-place; an entertainment for what they did."
          ],
          "en.transliteration": [
            "Amm<u>a</u> alla<u>th</u>eena <u>a</u>manoo waAAamiloo a<b>l</b><u>ssa</u>li<u>ha</u>ti falahum jann<u>a</u>tu almaw<u>a</u> nuzulan bim<u>a</u> k<u>a</u>noo yaAAmaloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Those who believe and do good deeds shall be lodged in the Gardens of Paradise as a reward for what they have done."
          ],
          "en.yusufali": [
            "For those who believe and do righteous deeds are Gardens as hospitable homes, for their (good) deeds."
          ],
          "fa.ansarian": [
            "اما کسانی که ایمان آورده و کارهای شایسته انجام داده اند، پس برای آنان بهشت هایی که اقامت گاه دائمی است خواهد بود [که به آنان] به پاداش اعمالی که همواره انجام می دادند، پیشکش می شود."
          ],
          "fa.ayati": [
            "اما آنان كه ايمان آورده‌اند و كارهاى شايسته كرده‌اند، به پاداش اعمالى كه مى‌كرده‌اند منزلگاهى در باغهاى بهشت خواهند يافت."
          ],
          "fa.bahrampour": [
            "اما كسانى كه ايمان آوردند و كارهاى شايسته كردند، ايشان را براى پذيرايى، به خاطر آنچه انجام مى‌دادند منزلگاه‌هاى بهشت است"
          ],
          "fa.fooladvand": [
            "اما كسانى كه ايمان آورده و كارهاى شايسته كرده‌اند، به [پاداش‌] آنچه انجام مى‌دادند در باغهايى كه در آن جايگزين مى‌شوند، پذيرايى مى‌گردند."
          ],
          "fa.ghomshei": [
            "اما آنان که (در دنیا) با ایمان و نیکو کار بودند به پاداش اعمال صالح منزلگاه پر نعمت در بهشت ابد یابند."
          ],
          "fa.khorramdel": [
            "و امّا کسانی که ایمان آورده‌اند و کارهای شایسته انجام داده‌اند، باغهای بهشت که جای زندگی است، از آن ایشان خواهد بود، به عنوان محلّ پذیرائی (خدا از ایشان) در برابر کارهائی که (در دنیا) انجام می‌داده‌اند. [[«جَنَّاتُ الْمَأْوی»: باغهای محلّ زندگی. یعنی دنیا جایگاه سفر است، ولی بهشت جایگاه ماندن و زندگی کردن. «نُزُلاً»: مکانی که مهمان محترم را در آنجا می‌نشانند. محلّ پذیرائی. چیزی که برای پذیرائی از مهمان آماده می‌کنند. مراد این است که بهشت محلّ پذیرائی از مؤمنان است و دائماً همچون مهمان از ایشان پذیرائی می‌شود. حال (جَنَّات) است، و یا جمع (نَازِل) و حال ضمیر (الَّذِینَ آمَنُوا) است.]]"
          ],
          "fa.khorramshahi": [
            "اما کسانی که ایمان آورده‌اند و کارهای شایسته کرده‌اند، جنةالماوی دارند که به خاطر کار و کردار پیشینشان پیشکش [آنان‌] است‌"
          ],
          "fa.makarem": [
            "امّا کسانی که ایمان آوردند و کارهای شایسته انجام دادند، باغهای بهشت جاویدان از آن آنها خواهد بود، این وسیله پذیرایی (خداوند) از آنهاست به پاداش آنچه انجام می‌دادند."
          ],
          "fa.moezzi": [
            "اما آنان که ایمان آوردند و کردار شایسته کردند پس ایشان را باغستان جایگاه پیشکشی بدانچه بودند می‌کردند"
          ],
          "fa.mojtabavi": [
            "اما آنان كه ايمان آوردند و كارهاى نيك و شايسته كردند، ايشان را بهشتهايى است كه براى پذيرايى در آنها جاى مى‌گزينند، به پاداش آنچه مى كردند."
          ],
          "fa.sadeqi": [
            "امّا کسانی که ایمان آورده و کارهای شایسته(ی ایمان) کرده‌اند، پس برایشان - به آنچه می‌کرده‌اند - باغ‌های با درختانِ سردرهم، جایگاه‌هایی است مهمان‌سرا."
          ]
        }
      },
      {
        "index": 3523,
        "local_index": 20,
        "part_type": "Verse",
        "path": "/books/quran:32:20",
        "text": [
          "وَ أَمَّا الَّذِينَ‌ فَسَقُوا فَمَأْوَاهُمُ‌ النَّارُ کُلَّمَا أَرَادُوا أَنْ‌ يَخْرُجُوا مِنْهَا أُعِيدُوا فِيهَا وَ قِيلَ‌ لَهُمْ‌ ذُوقُوا عَذَابَ‌ النَّارِ الَّذِي‌ کُنْتُمْ‌ بِهِ‌ تُکَذِّبُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "As for those who disobey, their abode is Hell. Whensoever they wish to escape from it they would be dragged back into it, and told: \"Taste the torment of the Fire which you used to call a lie.\""
          ],
          "en.ahmedraza": [
            "And those who are lawless – their destination is the fire; whenever they wish to come out of it, they will be returned into it, and it will be said to them, “Taste the punishment of the fire you used to deny!”"
          ],
          "en.arberry": [
            "But as for the ungodly, their refuge shall be the Fire; as often as they desire to come forth from it, they shall be restored into it, and it shall be said to them, 'Taste the chastisement of the Fire, which you cried lies to.'"
          ],
          "en.daryabadi": [
            "And as for those who transgress their abode is the Fire. So oft as they desire to get thereout, they shall be sent back thereto; and it will be said unto them: taste the torment of the Fire which ye were wont to belie."
          ],
          "en.hilali": [
            "And as for those who are Fasiqun (disbelievers and disobedient to Allah), their abode will be the Fire, every time they wish to get away therefrom, they will be put back thereto, and it will be said to them: \"Taste you the torment of the Fire which you used to deny.\""
          ],
          "en.itani": [
            "But as for those who transgressed, their shelter is the Fire. Every time they try to get out of it, they will be brought back into it, and it will be said to them, “Taste the suffering of the Fire which you used to deny.”"
          ],
          "en.maududi": [
            "As for the evil-doers, their refuge shall be the Fire. Every time they want to escape from it they shall be driven back and shall be told: “Taste the chastisement of the Fire which you used to reject as a lie.”"
          ],
          "en.mubarakpuri": [
            "And as for those who rebel, their abode will be the Fire, every time they wish to get away therefrom, they will be put back thereto, and it will be said to them: \"Taste you the torment of the Fire which you used to deny.\""
          ],
          "en.pickthall": [
            "And as for those who do evil, their retreat is the Fire. Whenever they desire to issue forth from thence, they are brought back thither. Unto them it is said: Taste the torment of the Fire which ye used to deny."
          ],
          "en.qarai": [
            "As for those who have transgressed, their refuge will be the Fire. Whenever they seek to leave it, they will be turned back into it and told: ‘Taste the punishment of the Fire which you used to deny.’"
          ],
          "en.qaribullah": [
            "But those who do evil their refuge is the Fire. As often as they desire to come out of it they shall be driven back, and it will be said to them: 'Taste the punishment of the Fire, which you have belied'"
          ],
          "en.sahih": [
            "But as for those who defiantly disobeyed, their refuge is the Fire. Every time they wish to emerge from it, they will be returned to it while it is said to them, \"Taste the punishment of the Fire which you used to deny.\""
          ],
          "en.sarwar": [
            "However, the dwelling of the sinful ones will be hell fire. Each time they try to come out, they will be turned back with this remark, \"Suffer the torment of the fire which you had called a lie\"."
          ],
          "en.shakir": [
            "And as for those who transgress, their abode is the fire; whenever they desire to go forth from it they shall be brought back into it, and it will be said to them: Taste the chastisement of the fire which you called a lie."
          ],
          "en.transliteration": [
            "Waamm<u>a</u> alla<u>th</u>eena fasaqoo famaw<u>a</u>humu a<b>l</b>nn<u>a</u>ru kullam<u>a</u> ar<u>a</u>doo an yakhrujoo minh<u>a</u> oAAeedoo feeh<u>a</u> waqeela lahum <u>th</u>ooqoo AAa<u>tha</u>ba a<b>l</b>nn<u>a</u>ri alla<u>th</u>ee kuntum bihi tuka<u>thth</u>iboon<b>a</b>"
          ],
          "en.wahiduddin": [
            "As for those who defy God, their home shall be the Fire. Whenever they try to escape it, they shall be driven back into it, and they shall be told, \"Taste the torment of the Fire, which you have persistently denied.\""
          ],
          "en.yusufali": [
            "As to those who are rebellious and wicked, their abode will be the Fire: every time they wish to get away therefrom, they will be forced thereinto, and it will be said to them: \"Taste ye the Penalty of the Fire, the which ye were wont to reject as false.\""
          ],
          "fa.ansarian": [
            "اما کسانی که نافرمانی کرده اند اقامتگاهشان آتش است، هرگاه بخواهند از آن بیرون آیند در آن بازگردانده می شوند، و به آنان گویند: عذاب آتش را که همواره آن را تکذیب می کردید، بچشید."
          ],
          "fa.ayati": [
            "و اما عصيان‌پيشگان، منزلگاهشان آتش است. هرگاه كه بخواهند از آن بيرون آيند، بار ديگر آنها را به درون آتش باز گردانند و بگويندشان: بچشيد عذاب آتشى را كه دروغش مى‌پنداشتيد."
          ],
          "fa.bahrampour": [
            "و اما كسانى كه نافرمانى كردند، جايگاهشان آتش است. هر بار كه بخواهند از آن بيرون بيايند به درون آن بازگردانده مى‌شوند و به آنها گفته مى‌شود: بچشيد عذاب آتشى را كه دروغش مى‌پنداشتيد"
          ],
          "fa.fooladvand": [
            "و اما كسانى كه نافرمانى كرده‌اند، پس جايگاهشان آتش است. هر بار كه بخواهند از آن بيرون بيايند، در آن بازگردانيده مى‌شوند و به آنان گفته مى‌شود: «عذاب آن آتشى را كه دروغش مى‌پنداشتيد بچشيد.»"
          ],
          "fa.ghomshei": [
            "و اما آنان که سر از طاعت حق کشیده و فاسق شدند منزلگاهشان در آتش دوزخ است و هر چه کوشند و خواهند که از آن آتش بیرون آیند باز (فرشتگان عذاب) بدان دوزخ برگردانندشان و گویند: عذاب آتشی را که (در دنیا) تکذیب می‌کردید اینک بچشید."
          ],
          "fa.khorramdel": [
            "و امّا کسانی که (از فرمان خدا و اطاعت از او) به در رفته (و راه کفر در پیش گرفته‌اند) جایگاه ایشان آتش دوزخ است. هر زمان که بخواهند از آن بدر آیند، ایشان بدانجا بازگردانده می‌شوند و بدیشان گفته می‌شود: بچشید عذاب آتشی را که آن را دروغ می‌پنداشتید! [[«أُعِیدُوا»: برگردانده شدند (نگا: حجّ / 22).]]"
          ],
          "fa.khorramshahi": [
            "و اما کسانی که سرپیچی کرده‌اند سرا و سرانجامشان آتش دوزخ است، هرگاه که خواهند از آن بیرون روند، به آن بازگردانده شوند، و به ایشان گفته شود، عذاب آتشی را که منکرش بودید، بچشید"
          ],
          "fa.makarem": [
            "و امّا کسانی که فاسق شدند (و از اطاعت خدا سرباز زدند)، جایگاه همیشگی آنها آتش است؛ هر زمان بخواهند از آن خارج شوند، آنها را به آن بازمی‌گردانند و به آنان گفته می‌شود: «بچشید عذاب آتشی را که انکار می‌کردید!»"
          ],
          "fa.moezzi": [
            "و اما آنان که نافرمانی کردند پس جایگاه ایشان است آتش هر گاه خواهند برون آیند از آن بازگردانیده شوند در آن و گفته شود برای ایشان بچشید عذاب آتشی را که بودید بدان تکذیب می‌کردید"
          ],
          "fa.mojtabavi": [
            "و اما آنان كه از فرمان بيرون شدند جايگاهشان آتش- دوزخ- است، هر گاه بخواهند از آن بيرون آيند به آن برگردانده مى‌شوند، و گويندشان: بچشيد عذاب آتشى را كه دروغ مى‌انگاشتيد."
          ],
          "fa.sadeqi": [
            "و امّا کسانی که نافرمانی کردند، پس پناهگاهشان آتش است. هربار که بخواهند از آن بیرون بیایند، در آن بازگردانیده می‌شوند و به آنان گفته می‌شود: «عذابِ آتش را -که دروغش می‌پنداشتید- بچشید.»"
          ]
        }
      },
      {
        "index": 3524,
        "local_index": 21,
        "part_type": "Verse",
        "path": "/books/quran:32:21",
        "text": [
          "وَ لَنُذِيقَنَّهُمْ‌ مِنَ‌ الْعَذَابِ‌ الْأَدْنَى‌ دُونَ‌ الْعَذَابِ‌ الْأَکْبَرِ لَعَلَّهُمْ‌ يَرْجِعُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "But We shall make them taste the affliction of this world before the greater torment, so that they may retract."
          ],
          "en.ahmedraza": [
            "And We shall indeed make them taste the smaller punishment before the greater punishment, so that they may return."
          ],
          "en.arberry": [
            "And We shall surely let them taste the nearer chastisement, before the greater; haply so they will return."
          ],
          "en.daryabadi": [
            "And surely We shall make them taste of the smaller torment prior to the greater torment, that haply they may yet return."
          ],
          "en.hilali": [
            "And verily, We will make them taste of the near torment (i.e. the torment in the life of this world, i.e. disasters, calamities, etc.) prior to the supreme torment (in the Hereafter), in order that they may (repent and) return (i.e. accept Islam)."
          ],
          "en.itani": [
            "We will make them taste the lesser torment, prior to the greater torment, so that they may return."
          ],
          "en.maududi": [
            "We shall certainly have them taste some chastisement in this world in addition to the greater chastisement (of the Hereafter); perhaps they will retract (from their transgression)."
          ],
          "en.mubarakpuri": [
            "And verily, We will make them taste of the near lighter torment prior to the greater torment, in order that they may return."
          ],
          "en.pickthall": [
            "And verily We make them taste the lower punishment before the greater, that haply they may return."
          ],
          "en.qarai": [
            "We shall surely make them taste the nearer punishment prior to the greater punishment, so that they may come back."
          ],
          "en.qaribullah": [
            "But We will let them taste the nearest punishment (in this life) before the greater punishment, so that they may return (to faith)."
          ],
          "en.sahih": [
            "And we will surely let them taste the nearer punishment short of the greater punishment that perhaps they will repent."
          ],
          "en.sarwar": [
            "We shall certainly make them suffer worldly torment before suffering the great torment so that perhaps they may return to Us."
          ],
          "en.shakir": [
            "And most certainly We will make them taste of the nearer chastisement before the greater chastisement that haply they may turn."
          ],
          "en.transliteration": [
            "Walanu<u>th</u>eeqannahum mina alAAa<u>tha</u>bi aladn<u>a</u> doona alAAa<u>tha</u>bi alakbari laAAallahum yarjiAAoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "And most surely We will make them taste a lesser punishment before the greater punishment, so that perhaps they may return to Us in repentance."
          ],
          "en.yusufali": [
            "And indeed We will make them taste of the Penalty of this (life) prior to the supreme Penalty, in order that they may (repent and) return."
          ],
          "fa.ansarian": [
            "و بی تردید آنان را غیر از عذاب بزرگ تر [در قیامت] از عذاب نزدیک تر [در دنیا] می چشانیم، باشد که [از فسق و فجور] برگردند."
          ],
          "fa.ayati": [
            "و عذاب دنيا را پيش از آن عذاب بزرگ‌تر به ايشان بچشانيم، باشد كه باز گردند."
          ],
          "fa.bahrampour": [
            "و قطعا پيش از عذاب بزرگ‌تر، از عذاب نزديك‌تر [اين دنيا] به آنها مى‌چشانيم، شايد كه آنها [به خدا] بازگردند"
          ],
          "fa.fooladvand": [
            "و قطعاً غير از آن عذاب بزرگتر، از عذاب اين دنيا [نيز] به آنان مى‌چشانيم، اميد كه آنها [به خدا] بازگردند."
          ],
          "fa.ghomshei": [
            "و البته ما کافران را عذاب نزدیک‌تر (و کمتر به بلاهای دنیا یا در برزخ) بچشانیم غیر آن عذاب بزرگتر و شدیدتر (قیامت یا قیام حجّت عصر علیه السّلام) تا مگر (متنبّه و پشیمان از کفر و عصیان شوند و به سوی خدا) باز گردند."
          ],
          "fa.khorramdel": [
            "ما قطعاً عذاب نزدیک‌تر (دنیا) را پیش از عذاب بزرگ‌تر (آخرت) بدیشان می‌چشانیم، شاید (از کفر و معاصی دست بکشند، و به سوی خدا) برگردند. [[«الْعَذَابِ الأدْنی»: عذاب نزدیکتر. عذاب کمتر. مراد مصائب و بلایا و آفات دنیوی است، همچون: زیانها و ضررها، بیماریها و ناخوشیها، خشکسالیها، دردها و رنجها، که بیدارباشها و هشدارهای خدائی بشمارند. «دُونَ»: قبل از. پیش از. «الْعَذَابِ الأکْبَرِ»: عذاب بزرگتر. مراد عذاب اخروی جهنّم است (نگا: رعد / 34، زمر / 26).]]"
          ],
          "fa.khorramshahi": [
            "و به ایشان عذاب کوچکتر را غیر از عذاب بزرگتر، می‌چشانیم باشد که بازگردند"
          ],
          "fa.makarem": [
            "به آنان از عذاب نزدیک (عذاب این دنیا) پیش از عذاب بزرگ (آخرت) می‌چشانیم، شاید بازگردند!"
          ],
          "fa.moezzi": [
            "و همانا بچشانیمشان از شکنجه نزدیک نارسیده به شکنجه بزرگ باشد ایشان بازگردند"
          ],
          "fa.mojtabavi": [
            "و هر آينه آنان را از عذاب نزديكتر و كهتر- خوارى و فروماندگى يا قحط و گزند- پيش از عذاب بزرگتر بچشانيم باشد كه بازگردند."
          ],
          "fa.sadeqi": [
            "و بی‌‌گمان (و) بی‌چون آنان را از عذاب کمتر (که) ناچیزتر از عذاب بزرگ‌تر است می‌چشانیم، شاید آنها (به خدا) بازگردند."
          ]
        }
      },
      {
        "index": 3525,
        "local_index": 22,
        "part_type": "Verse",
        "path": "/books/quran:32:22",
        "text": [
          "وَ مَنْ‌ أَظْلَمُ‌ مِمَّنْ‌ ذُکِّرَ بِآيَاتِ‌ رَبِّهِ‌ ثُمَ‌ أَعْرَضَ‌ عَنْهَا إِنَّا مِنَ‌ الْمُجْرِمِينَ‌ مُنْتَقِمُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Who is more wicked than he who is reminded of his Lord's revelations yet turns away from them; We will surely requite the sinners."
          ],
          "en.ahmedraza": [
            "And who is more unjust than one who is preached to from the verses his Lord, then he turns away from them? We will indeed take revenge from the guilty."
          ],
          "en.arberry": [
            "And who does greater evil than he who is reminded of the signs of his Lord, then turns away from them? We shall take vengeance upon the sinners."
          ],
          "en.daryabadi": [
            "And who is a greater wrong-doer than he who is reminded of His signs, then he turneth aside therefrom? Verily unto the culprits We are going to be Avenger."
          ],
          "en.hilali": [
            "And who does more wrong than he who is reminded of the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of his Lord, then he turns aside therefrom? Verily, We shall exact retribution from the Mujrimun (criminals, disbelievers, polytheists, sinners, etc.)."
          ],
          "en.itani": [
            "Who is more wrong than he, who, when reminded of his Lord’s revelations, turns away from them? We will certainly wreak vengeance upon the criminals."
          ],
          "en.maududi": [
            "And who is more unjust than he who is given good counsel through the Signs of his Lord and yet he turns away from them? Surely We will exact full retribution from such criminals."
          ],
          "en.mubarakpuri": [
            "And who does more wrong than he who is reminded of the Ayat of his Lord, then turns aside therefrom Verily, We shall exact retribution from the criminals."
          ],
          "en.pickthall": [
            "And who doth greater wrong than he who is reminded of the revelations of his Lord, then turneth from them. Lo! We shall requite the guilty."
          ],
          "en.qarai": [
            "Who is a greater wrongdoer than him who is reminded of his Lord’s signs, whereat he disregards them? Indeed, We shall take vengeance upon the guilty."
          ],
          "en.qaribullah": [
            "And who is more wicked than he who, when reminded of the verses of his Lord turns away from them? We take revenge on the sinners."
          ],
          "en.sahih": [
            "And who is more unjust than one who is reminded of the verses of his Lord; then he turns away from them? Indeed We, from the criminals, will take retribution."
          ],
          "en.sarwar": [
            "Who are more unjust than those who are reminded of the revelation of their Lord, but have ignored them? We will take revenge on the criminal."
          ],
          "en.shakir": [
            "And who is more unjust than he who is reminded of the communications of his Lord, then he turns away from them? Surely We will give punishment to the guilty."
          ],
          "en.transliteration": [
            "Waman a<i><u>th</u></i>lamu mimman <u>th</u>ukkira bi<u>a</u>y<u>a</u>ti rabbihi thumma aAAra<u>d</u>a AAanh<u>a</u> inn<u>a</u> mina almujrimeena muntaqimoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Who does greater wrong than someone who, when revelations of his Lord are recited to him, turns away from them? We shall inflict retribution on the guilty."
          ],
          "en.yusufali": [
            "And who does more wrong than one to whom are recited the Signs of his Lord, and who then turns away therefrom? Verily from those who transgress We shall exact (due) Retribution."
          ],
          "fa.ansarian": [
            "ستمکارتر از کسی که به وسیله آیات پروردگارش تذکر داده شود، سپس از آنها روی برگرداند، کیست؟ بی تردید ما از مجرمان انتقام می گیریم."
          ],
          "fa.ayati": [
            "كيست ستمكارتر از آن كسى كه او را به آيات پروردگارش پند دهند ولى اعراض كند؟ ما از مجرمان انتقام مى‌گيريم."
          ],
          "fa.bahrampour": [
            "و كيست ظالم‌تر از آن كس كه به آيات پروردگارش توجه داده شود و آن‌گاه از آن روى بگرداند؟ قطعا ما از مجرمان انتقام خواهيم گرفت"
          ],
          "fa.fooladvand": [
            "و كيست بيدادگرتر از آن كس كه به آيات پروردگارش پند داده شود [و] آنگاه از آن روى بگرداند؟ قطعاً ما از مجرمان انتقام‌كِشنده‌ايم."
          ],
          "fa.ghomshei": [
            "و کدامین کس در عالم از آن کس که به آیات خدا پند و تذکّرش دادند و باز اعراض کرد ستمکارتر است؟ البته ما از بدکاران انتقام خواهیم کشید."
          ],
          "fa.khorramdel": [
            "چه کسی ستمکارتر از آن کسی است که به آیات پروردگارش پند داده شود، و او از آنها روی بگرداند؟ مسلّماً ما همگیِ بزهکاران را کیفر خواهیم داد. [[«ذُکِّرَ»: پند داده شد. یادآور گردید. «أَعْرَضَ»: روی گرداند. پشت کرد. «مُنتَقِمُونَ»: انتقام گیرندگان. مراد از انتقام خدا در قرآن، مجازات کردن و کیفر دادن است (نگا: اعراف / 136، حجر / 79، مائده / 95).]]"
          ],
          "fa.khorramshahi": [
            "و کیست ستمکارتر از کسی که به آیات پروردگارش پند داده شود، سپس از آن رو بگرداند، ما از گناهکاران انتقام می‌گیریم‌"
          ],
          "fa.makarem": [
            "چه کسی ستمکارتر است از آن کس که آیات پروردگارش به او یادآوری شده و او از آن اعراض کرده است؟! مسلّماً ما از مجرمان انتقام خواهیم گرفت!"
          ],
          "fa.moezzi": [
            "و کیست ستمگرتر از آنکه یادآوری شود به آیتهای پروردگار خویش پس روی برتابد از آنها همانا مائیم از گنهکاران کین‌کشندگان‌"
          ],
          "fa.mojtabavi": [
            "و كيست ستمكارتر از كسى كه به آيات پروردگارش يادآورى شده سپس از آن روى بگردانيد؟ همانا ما از بزهكاران انتقام گيرنده‌ايم."
          ],
          "fa.sadeqi": [
            "و کیست بیدادگرتر از آن کس که به آیات پروردگارش یادآوری شده، پس آن‌گاه از آن روی بگرداند؟ ما بی‌گمان از مجرمان انتقام‌کشنده‌ایم."
          ]
        }
      },
      {
        "index": 3526,
        "local_index": 23,
        "part_type": "Verse",
        "path": "/books/quran:32:23",
        "text": [
          "وَ لَقَدْ آتَيْنَا مُوسَى‌ الْکِتَابَ‌ فَلاَ تَکُنْ‌ فِي‌ مِرْيَةٍ مِنْ‌ لِقَائِهِ‌ وَ جَعَلْنَاهُ‌ هُدًى‌ لِبَنِي‌ إِسْرَائِيلَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Verily We gave Moses the Book; so be not in doubt about his having received it; and We made it a guidance for the children of Israel."
          ],
          "en.ahmedraza": [
            "And indeed We bestowed the Book to Moosa, therefore have no doubt in its acquisition, and made it a guidance for the Descendants of Israel."
          ],
          "en.arberry": [
            "Indeed, We gave Moses the Book; so he not in doubt concerning the encounter with him; and We appointed it for a guidance to the Children of Israel."
          ],
          "en.daryabadi": [
            "Assuredly We vouchsafed the Book Unto Musa; so be thou not in doubt in thy receiving it. And We appointed it to be a guidance unto the Children of Is'rail."
          ],
          "en.hilali": [
            "And indeed We gave Musa (Moses) the Scripture [the Taurat (Torah)]. So be not you in doubt of meeting him [i.e. when you met Musa (Moses) during the night of Al-Isra' and Al-Mi'raj over the heavens]. And We made it [the Taurat (Torah)] a guide to the Children of Israel."
          ],
          "en.itani": [
            "We gave Moses the Book; so do not be in doubt regarding His encounter; and We made it a guidance for the Children of Israel."
          ],
          "en.maududi": [
            "Verily We bestowed the Book upon Moses. So entertain no doubt if (the Prophet Muhammad) received the same. We had made that Book a guidance for the Children of Israel,"
          ],
          "en.mubarakpuri": [
            "And indeed We gave Musa the Scripture. So, be not you in doubt of meeting him. And We made it a guide to the Children of Israel."
          ],
          "en.pickthall": [
            "We verily gave Moses the Scripture; so be not ye in doubt of his receiving it; and We appointed it a guidance for the Children of Israel."
          ],
          "en.qarai": [
            "Certainly We gave Moses the Book, [declaring], ‘Do not be in doubt about the encounter with Him,’ and We made it a [source of] guidance for the Children of Israel."
          ],
          "en.qaribullah": [
            "We have given the Book to Moses, so (Prophet Muhammad) do not be in doubt concerning the meeting with him (Prophet Moses) and made it a guidance to the Children of Israel."
          ],
          "en.sahih": [
            "And We certainly gave Moses the Scripture, so do not be in doubt over his meeting. And we made the Torah guidance for the Children of Israel."
          ],
          "en.sarwar": [
            "We gave the Book to Moses - do not have any doubt about the Day of Judgment - and made it a guide for the children of Israel."
          ],
          "en.shakir": [
            "And certainly We gave the Book to Musa, so be not in doubt concerning the receiving of it, and We made it a guide for the children of Israel."
          ],
          "en.transliteration": [
            "Walaqad <u>a</u>tayn<u>a</u> moos<u>a</u> alkit<u>a</u>ba fal<u>a</u> takun fee miryatin min liq<u>a</u>ihi wajaAAaln<u>a</u>hu hudan libanee isr<u>a</u>eel<b>a</b>"
          ],
          "en.wahiduddin": [
            "We gave Moses the Scripture, so [Muhammad] do not doubt that you are receiving it, just as We made it a guide for the Children of Israel."
          ],
          "en.yusufali": [
            "We did indeed aforetime give the Book to Moses: be not then in doubt of its reaching (thee): and We made it a guide to the Children of Israel."
          ],
          "fa.ansarian": [
            "و به راستی ما به موسی کتاب دادیم، پس تو در دریافت کتاب [به وسیله موسی] هیچ تردیدی نداشته باش، و آن را برای بنی اسرائیل هدایت قرار دادیم،"
          ],
          "fa.ayati": [
            "هرآينه به موسى كتاب داديم. از ديدار او در ترديد مباش. و آن را راهنماى بنى‌اسرائيل قرار داديم."
          ],
          "fa.bahrampour": [
            "و به راستى [ما] به موسى كتاب داديم پس در ديدار با او ترديد مكن و آن [كتاب‌] را راهنماى بنى اسرائيل قرار داديم"
          ],
          "fa.fooladvand": [
            "و به راستى [ما] به موسى كتاب داديم. پس در لقاى او [با خدا]ترديد مكن، و آن [كتاب‌] را براى فرزندان اسرائيل [مايه‌] هدايت قرار داديم."
          ],
          "fa.ghomshei": [
            "و همانا ما به موسی کتاب (تورات) را عطا کردیم پس تو در ملاقات او (یعنی ملاقات موسی با خدا در قیامت یا شب معراج با تو) هیچ شک مدار، و ما او را سبب هدایت بنی اسرائیل قرار دادیم."
          ],
          "fa.khorramdel": [
            "ما برای موسی کتاب (تورات) را فرو فرستادیم، و شکّ نداشته باش که موسی تورات را دریافت داشت، و ما آن را رهنمون و راهنمای بنی‌اسرائیل گرداندیم. [[«الْکِتَابَ»: مراد تورات است. «مِرْیَةٍ»: شکّ و تردید. «لِقَآئِهِ»: دریافت کردن موسی تورات را. ضمیر (ه) به (الکتاب) باز می‌گردد. «لا تَکُن فِی مِرْیَةٍ مِّن لِّقَآئِهِ»: مخاطب پیغمبر اسلام است و مراد دیگران (نگا: المصحف المیسّر). «هُدیً»: هدایت. هادی. راهنمای به حق و حقیقت.]]"
          ],
          "fa.khorramshahi": [
            "و به راستی به موسی کتاب آسمانی بخشیدیم، پس در لقای او شک نداشته باش، و آن را رهنمود بنی‌اسرائیل گرداندیم‌"
          ],
          "fa.makarem": [
            "ما به موسی کتاب آسمانی دادیم؛ و شک نداشته باش که او آیات الهی را دریافت داشت؛ و ما آن را وسیله هدایت بنی اسرائیل قرار دادیم!"
          ],
          "fa.moezzi": [
            "و همانا دادیم به موسی کتاب را پس نباش در شکی از ملاقاتش و گردانیدیمش رهبریی برای بنی‌اسرائیل‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه موسى را كتاب- تورات- داديم. پس، از ديدار او- يعنى ديدار خداوند، كنايه از رستاخيز- در شك مباش و آن"
          ],
          "fa.sadeqi": [
            "و به‌راستی ما به موسی کتاب (تورات) را به‌درستی دادیم: «پس، از لقای با خدا تردید مکن.» و آن کتاب را برای فرزندان اسرائیل رهنمودی قرار دادیم."
          ]
        }
      },
      {
        "index": 3527,
        "local_index": 24,
        "part_type": "Verse",
        "path": "/books/quran:32:24",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:2:1:47:3"
          ]
        },
        "text": [
          "وَ جَعَلْنَا مِنْهُمْ‌ أَئِمَّةً يَهْدُونَ‌ بِأَمْرِنَا لَمَّا صَبَرُوا وَ کَانُوا بِآيَاتِنَا يُوقِنُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "When they persevered and firmly believed Our revelations We appointed learned men among them who guided them by Our command."
          ],
          "en.ahmedraza": [
            "And We made some leaders among them, guiding by Our command, when they had persevered; and they used to accept faith in Our signs."
          ],
          "en.arberry": [
            "And We appointed from among them leaders guiding by Our command, when they endured patiently, and had sure faith in Our signs."
          ],
          "en.daryabadi": [
            "And We appointed, from amongst them, leaders guiding others by Our command, when they had persevered, and of Our signs they were convinced."
          ],
          "en.hilali": [
            "And We made from among them (Children of Israel), leaders, giving guidance under Our Command, when they were patient and used to believe with certainty in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.)."
          ],
          "en.itani": [
            "And We appointed leaders from among them, guiding by Our command, as long as they persevered and were certain of Our communications."
          ],
          "en.maududi": [
            "and when they remained steadfast and firmly believed in Our Signs, We created among them leaders who guided people by Our command."
          ],
          "en.mubarakpuri": [
            "And We made from among them, leaders, giving guidance under Our command, when they were patient and used to believe with certainty in Our Ayat."
          ],
          "en.pickthall": [
            "And when they became steadfast and believed firmly in Our revelations, We appointed from among them leaders who guided by Our command."
          ],
          "en.qarai": [
            "When they had been patient and had conviction in Our signs, We appointed amongst them imams to guide [the people] by Our command."
          ],
          "en.qaribullah": [
            "When they were patient, We made from them leaders, guiding with Our Command and they were certain of Our verses."
          ],
          "en.sahih": [
            "And We made from among them leaders guiding by Our command when they were patient and [when] they were certain of Our signs."
          ],
          "en.sarwar": [
            "We appointed some of the Israelites as leaders for their exercising patience to guide the others to Our commands. They had firm belief in Our revelations."
          ],
          "en.shakir": [
            "And We made of them Imams to guide by Our command when they were patient, and they were certain of Our communications."
          ],
          "en.transliteration": [
            "WajaAAaln<u>a</u> minhum aimmatan yahdoona biamrin<u>a</u> lamm<u>a</u> <u>s</u>abaroo wak<u>a</u>noo bi<u>a</u>y<u>a</u>tin<u>a</u> yooqinoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "We appointed leaders from among them, guiding by Our command when they were steadfast and when they had firm faith in Our signs."
          ],
          "en.yusufali": [
            "And We appointed, from among them, leaders, giving guidance under Our command, so long as they persevered with patience and continued to have faith in Our Signs."
          ],
          "fa.ansarian": [
            "و برخی از آنان را چون [در برابر مشکلات، سختی ها و حادثه های تلخ و شیرین] صبر کردند و همواره به آیات ما یقین داشتند، پیشوایانی قرار دادیم که به فرمان ما [مردم را] هدایت می کردند."
          ],
          "fa.ayati": [
            "از ميان آن قوم پيشوايانى پديد آورديم كه چون صبورى پيشه كردند و به آيات ما يقين داشتند، به فرمان ما به هدايت مردم پرداختند."
          ],
          "fa.bahrampour": [
            "و نظر به اين كه شكيبايى كردند و به آيات ما يقين داشتند از آنها پيشوايانى قرار داديم كه به فرمان ما [مردم را] هدايت مى‌كردند"
          ],
          "fa.fooladvand": [
            "و چون شكيبايى كردند و به آيات ما يقين داشتند، برخى از آنان را پيشوايانى قرار داديم كه به فرمان ما [مردم را] هدايت مى‌كردند."
          ],
          "fa.ghomshei": [
            "و برخی از آن بنی اسرائیل را امام و پیشوایانی که خلق را به امر ما (نه به امر خلق) هدایت کنند قرار دادیم برای آنکه (در راه حق) صبر کردند و در آیات ما مقام یقین یافتند."
          ],
          "fa.khorramdel": [
            "و از میان بنی‌اسرائیل پیشوایانی را پدیدار کردیم که به فرمان ما (و برابر قوانین ما، مردمان را) راهنمائی می‌نمودند، بدان گاه که بنی‌اسرائیل (در راه خدا بر تحمّل سختیها) شکیبائی ورزیدند و به آیات ما ایمان کامل پیدا کردند. [[«أَئِمَّةً»: امامان و پیشوایان. مراد انبیاء خدا، یا پیشوایان دینی است که پس از پیغمبران کار امر به معروف و نهی از منکر را به عهده می‌گیرند. «بِأَمْرِنَا»: به فرمان ما و برابر دستور ما. طبق موازین و قوانین ما. «لَمَّا صَبَرُوا وَ ...»: وقتی که بنی‌اسرائیل مشقّات تکالیف و دشواریهای راه خدا را تحمّل و بر آن استقامت و شکیبائی کردند. دو چیز انسانها را به پیشوائی می‌رساند: نخست ایمان و یقین به آیات الهی، دیگر شکیبائی و پایداری.]]"
          ],
          "fa.khorramshahi": [
            "و از ایشان چون شکیبایی ورزیدند و به آیات ما ایقان یافتند، پیشوایانی برگماشتیم که به فرمان ما هدایت می‌کردند"
          ],
          "fa.makarem": [
            "و از آنان امامان (و پیشوایانی) قرار دادیم که به فرمان ما (مردم را) هدایت می‌کردند؛ چون شکیبایی نمودند، و به آیات ما یقین داشتند."
          ],
          "fa.moezzi": [
            "و گردانیدیم از ایشان پیشوایانی که راهنمائی می‌کنند به فرمان ما چنانکه شکیبائی کردند و بودند به آیتهای ما یقین‌دارندگان‌"
          ],
          "fa.mojtabavi": [
            "و از آنان پيشوايانى قرار داديم كه به فرمان ما راه مى‌نمودند، از آن رو كه شكيبايى ورزيدند و آيات ما را بى‌گمان باور مى داشتند."
          ],
          "fa.sadeqi": [
            "و هنگامی که شکیبایی کردند و به آیات ما یقین داشتند، برخی از آنان را پیشوایانی قرار دادیم که به فرمان ما (مردم را) هدایت کنند."
          ]
        }
      },
      {
        "index": 3528,
        "local_index": 25,
        "part_type": "Verse",
        "path": "/books/quran:32:25",
        "text": [
          "إِنَ‌ رَبَّکَ‌ هُوَ يَفْصِلُ‌ بَيْنَهُمْ‌ يَوْمَ‌ الْقِيَامَةِ فِيمَا کَانُوا فِيهِ‌ يَخْتَلِفُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Surely your Lord will decide between them about what they were at variance, on the Day of Resurrection."
          ],
          "en.ahmedraza": [
            "Indeed your Lord will judge between them on the Day of Resurrection concerning the matters in which they used to differ."
          ],
          "en.arberry": [
            "Surely thy Lord will distinguish between them on the Resurrection Day, touching that whereon they were at variance."
          ],
          "en.daryabadi": [
            "Verily thy Lord! He shall decide between them on the Day of Judgment concerning that wherein they have been differing."
          ],
          "en.hilali": [
            "Verily, your Lord will judge between them on the Day of Resurrection, concerning that wherein they used to differ."
          ],
          "en.itani": [
            "Your Lord will judge between them on the Day of Resurrection regarding everything they had disputed."
          ],
          "en.maududi": [
            "Surely your Lord will judge among them on the Day of Resurrection concerning the matters about which the Children of Israel used to differ."
          ],
          "en.mubarakpuri": [
            "Verily, your Lord will judge between them on the Day of Resurrection, concerning that wherein they used to differ."
          ],
          "en.pickthall": [
            "Lo! thy Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ."
          ],
          "en.qarai": [
            "Indeed your Lord will judge between them on the Day of Resurrection concerning that about which they used to differ."
          ],
          "en.qaribullah": [
            "On the Day of Resurrection your Lord will distinguish between them that on which they varied."
          ],
          "en.sahih": [
            "Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ."
          ],
          "en.sarwar": [
            "Your Lord will issue His decree about their (believers and disbeliever's) differences on the Day of Judgment."
          ],
          "en.shakir": [
            "Surely your Lord will judge between them on the day of resurrection concerning that wherein they differ."
          ],
          "en.transliteration": [
            "Inna rabbaka huwa yaf<u>s</u>ilu baynahum yawma alqiy<u>a</u>mati feem<u>a</u> k<u>a</u>noo feehi yakhtalifoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Surely your Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ."
          ],
          "en.yusufali": [
            "Verily thy Lord will judge between them on the Day of Judgment, in the matters wherein they differ (among themselves)"
          ],
          "fa.ansarian": [
            "یقیناً پروردگارت روز قیامت، خود میان آنان درباره آنچه همواره در آن اختلاف می کردند، داوری خواهد کرد."
          ],
          "fa.ayati": [
            "هرآينه پروردگار تو در روز قيامت در آنچه اختلاف مى‌كردند ميانشان داورى خواهد كرد."
          ],
          "fa.bahrampour": [
            "البته پروردگار تو خودش روز قيامت در آنچه اختلاف مى‌كردند، ميانشان داورى خواهد نمود"
          ],
          "fa.fooladvand": [
            "در حقيقت، پروردگار تو، خود روز قيامت در آنچه با يكديگر در باره آن اختلاف مى‌كردند، ميانشان داورى خواهد كرد."
          ],
          "fa.ghomshei": [
            "البته خدای تو به روز قیامت در آنچه این مردم (از آیات و احکام الهی) اختلاف کلمه می‌انگیختند حکم خواهد کرد."
          ],
          "fa.khorramdel": [
            "پروردگار تو، روز قیامت، میان آنان درباره‌ی چیزهای مورد اختلاف ایشان (از قبیل: مسائل دین، رستاخیز، ثواب، و عقاب) داوری می‌کند (و هر یک را به جزا و سزای خود می‌رساند). [[«یَفْصِلُ»: قضاوت می‌نماید. داوری می‌کند. «بَیْنَهُمْ»: میان بنی‌اسرائیل. میان انبیاء و بنی‌اسرائیل. میان کفّار و مؤمنین.]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان پروردگارت در میان آنان در روز قیامت در آنچه در آن اختلاف داشتند، داوری خواهد کرد"
          ],
          "fa.makarem": [
            "البتّه پروردگار تو میان آنان روز قیامت در آنچه اختلاف داشتند داوری می‌کند (و هر کس را به سزای اعمالش می‌رساند)!"
          ],
          "fa.moezzi": [
            "و همانا پروردگارت جدائی افکند میانشان روز رستاخیز در آنچه بودند در آن اختلاف می‌کردند"
          ],
          "fa.mojtabavi": [
            "همانا پروردگار تو در روز رستاخيز ميان آنان در آنچه اختلاف مى كردند- در باره دين- داورى مى‌كند."
          ],
          "fa.sadeqi": [
            "به‌راستی، پروردگارت، (هم)او روز قیامت در آنچه با یکدیگر درباره‌ی آن اختلاف می‌کرده‌اند، میانشان جداسازی خواهد کرد."
          ]
        }
      },
      {
        "index": 3529,
        "local_index": 26,
        "part_type": "Verse",
        "path": "/books/quran:32:26",
        "text": [
          "أَ وَ لَمْ‌ يَهْدِ لَهُمْ‌ کَمْ‌ أَهْلَکْنَا مِنْ‌ قَبْلِهِمْ‌ مِنَ‌ الْقُرُونِ‌ يَمْشُونَ‌ فِي‌ مَسَاکِنِهِمْ‌ إِنَ‌ فِي‌ ذٰلِکَ‌ لَآيَاتٍ‌ أَ فَلاَ يَسْمَعُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Did they not find guidance in the many generations We had destroyed before them, over whose dwellings they (now) walk? There were indeed signs in this. Will they even then not listen?"
          ],
          "en.ahmedraza": [
            "And did they not obtain guidance by the fact that We did destroy many generations before them, so now they walk in their houses? Indeed in this are signs; so do they not heed?"
          ],
          "en.arberry": [
            "Is it not a guidance to them, how many generations We destroyed before them in whose dwelling-places they walk? Surely in that are signs; what, will they not hear?"
          ],
          "en.daryabadi": [
            "Hath this not guided them: how many generations We have destroyed before them amidst whose dwellings they walk? Verily therein are signs; will they not therefore hearken?"
          ],
          "en.hilali": [
            "Is it not a guidance for them, how many generations We have destroyed before them in whose dwellings they do walk about? Verily, therein indeed are signs. Would they not then listen?"
          ],
          "en.itani": [
            "Is it not a lesson for them, how many generations We have destroyed before them, in whose habitations they walk? Surely in that are signs. Do they not hear?"
          ],
          "en.maududi": [
            "Did (these historical events) not make them realise that We destroyed many nations before them amidst whose dwellings they now move about? Surely there are many Signs in this. Are they unable to hear?"
          ],
          "en.mubarakpuri": [
            "Is it not a guidance for them: how many generations We have destroyed before them in whose dwellings they do walk about Verily, therein indeed are signs. Would they not then listen"
          ],
          "en.pickthall": [
            "Is it not a guidance for them (to observe) how many generations We destroyed before them, amid whose dwelling places they do walk? Lo! therein verily are portents! Will they not then heed?"
          ],
          "en.qarai": [
            "Does it not dawn upon them how many generations We have destroyed before them, amid [the ruins of] whose dwellings they walk? There are indeed signs in that. Will they not then listen?"
          ],
          "en.qaribullah": [
            "Is it not a guidance to them, how many generations We destroyed before them in whose dwelling places they walk? Surely, in this there are signs. Will they not then hear!"
          ],
          "en.sahih": [
            "Has it not become clear to them how many generations We destroyed before them, [as] they walk among their dwellings? Indeed in that are signs; then do they not hear?"
          ],
          "en.sarwar": [
            "Was it not a lesson for them, (the unbelievers), that We destroyed the many generations living before them among whose ruined dwellings they are now walking. In this there is many evidence (of the truth). Will they not then listen?"
          ],
          "en.shakir": [
            "Does it not point out to them the right way, how many of the generations, in whose abodes they go about, did We destroy before them? Most surely there are signs in this; will they not then hear?"
          ],
          "en.transliteration": [
            "Awalam yahdi lahum kam ahlakn<u>a</u> min qablihim mina alqurooni yamshoona fee mas<u>a</u>kinihim inna fee <u>tha</u>lika la<u>a</u>y<u>a</u>tin afal<u>a</u> yasmaAAoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Does it not guide them [to see] how many generations We destroyed before them, among whose ruined dwellings they now walk about? There truly are signs in this -- will they not listen?"
          ],
          "en.yusufali": [
            "Does it not teach them a lesson, how many generations We destroyed before them, in whose dwellings they (now) go to and fro? Verily in that are Signs: Do they not then listen?"
          ],
          "fa.ansarian": [
            "آیا مشرکان را [داستان] بسیاری از ملت هایی که ما پیش از آنان هلاک کردیم که [اینان] در مسکن هایشان قدم می زنند هدایت نکرد [و برای آنان روشن نساخت که سرانجام کفرپیشگان هلاکت است؟] همانا در این [سرگذشت ها] عبرت هاست، آیا نمی شنوند؟!"
          ],
          "fa.ayati": [
            "آيا آن همه مردمى را كه پيش از ايشان هلاك كرديم و اكنون اينان در خانه‌هايشان راه مى‌روند سبب هدايتشان نشد؟ در اين عبرتهاست، چرا نمى‌شنوند؟"
          ],
          "fa.bahrampour": [
            "آيا آنها را راه ننمود كه چه بسيار نسل‌ها را پيش از آنها نابود كرديم كه [اينان‌] در خانه‌هاى [ويران شده‌ى‌] آنها راه مى‌روند؟ قطعا در اين [امر] عبرت‌هاست. آيا نمى‌شنوند"
          ],
          "fa.fooladvand": [
            "آيا براى آنان روشن نگرديده كه چه بسيار نسلها را پيش از آنها نابود گردانيديم [كه اينان‌] در سراهايشان راه مى‌روند؟ قطعاً در اين [امر] عبرتهاست، مگر نمى‌شنوند؟"
          ],
          "fa.ghomshei": [
            "آیا آن طوایف و قبایلی را که ما پیش از این مردم کنونی هلاک کردیم و اینان اینک در دیارشان به جای آنها رفت و آمد می‌کنند هلاک آنها موجب هدایت و عبرت اینان نگردید؟ البته در این هلاک پیشینیان آیاتی (از پند و عبرت خلق) است، آیا باز هم سخن نمی‌شنوند؟"
          ],
          "fa.khorramdel": [
            "آیا برای ایشان روشن نشده است که پیش از آنان ما مردمان نسلهای فراوانی را هلاک کرده‌ایم و (ایشان هم اینک) در مسکن و (مأوی و جا و) مکان آنان راه می‌روند (و در سفرهای خود ویرانه‌های منازلشان را می‌بینند؟). واقعاً در این (دیدار دیار متروک و خالی از سکنه‌ی جبّاران و تبهکاران تاریخ) نشانه‌هائی (از قدرت خدا، و درسهای عبرتی از گذشتگان) است. آیا (این اندرزهای الهی، و پندهای عبرت را از زبان حال کاخهای ویران و کنگره‌های سر به فلک سایان) نمی‌شنوند؟ [[«لَمْ یَهْدِ لَهُمْ؟»: برای آنان روشن و آشکار نشده است؟ (نگا: اعراف / 100). فاعل (لَمْ یَهْدِ) مضمون جمله (کَمْ أَهْلَکْنَا مِن قَبْلِهِم مِّنَ الْقُرُونِ) است. «الْقُرُونِ»: مردمان نسلهای گوناگون (نگا: انعام / 6). «أَفَلا یَسْمَعُونَ»: آیا نمی‌شنوند؟ مراد از شنیدن، تدبّر و تفکّر و عبرت گرفتن است.]]"
          ],
          "fa.khorramshahi": [
            "آیا برای ایشان روشن نشده است که پیش از آنان چه بسیار نسلهایی را نابود کردیم که [اینان‌] بر خانه و کاشانه‌هایشان می‌گذرند، بی‌گمان در این مایه‌های عبرت است، آیا [به گوش دل‌] نمی‌شنوند؟"
          ],
          "fa.makarem": [
            "آیا برای هدایت آنها همین کافی نیست که افراد زیادی را که در قرن پیش از آنان زندگی داشتند هلاک کردیم؟! اینها در مساکن (ویران شده) آنان راه می‌روند؛ در این آیاتی است (از قدرت خداوند و مجازات دردناک مجرمان)؛ آیا نمی‌شنوند؟!"
          ],
          "fa.moezzi": [
            "آیا رهبریشان نکرد که بسا نابود ساختیم پیش از ایشان از قرنهائی که روانند در آرامگاه‌های آنان همانا در این است آیتهائی آیا نمی‌شنوند"
          ],
          "fa.mojtabavi": [
            "و آيا آنان را راه ننمود و برايشان روشن نساخت كه پيش از ايشان چه اندازه مردمانى را هلاك كرديم كه اكنون در خانه‌هاى آنها راه مى‌روند؟ هر آينه در اين نشانه‌ها و عبرتهاست آيا [به گوش دل‌] نمى‌شنوند؟"
          ],
          "fa.sadeqi": [
            "آیا و برای آنان رهنمون نشده است (که) چه بسیار نسل‌ها را پیش از آنها نابود گردانیدیم، حال آنکه اینان در سراهای آنان راه می‌روند؟ بی‌گمان در این (امر) نشانه‌هایی است. پس مگر نمی‌شنوند؟"
          ]
        }
      },
      {
        "index": 3530,
        "local_index": 27,
        "part_type": "Verse",
        "path": "/books/quran:32:27",
        "text": [
          "أَ وَ لَمْ‌ يَرَوْا أَنَّا نَسُوقُ‌ الْمَاءَ إِلَى‌ الْأَرْضِ‌ الْجُرُزِ فَنُخْرِجُ‌ بِهِ‌ زَرْعاً تَأْکُلُ‌ مِنْهُ‌ أَنْعَامُهُمْ‌ وَ أَنْفُسُهُمْ‌ أَ فَلاَ يُبْصِرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Do they not see that We drive the rain towards a land that is dry, then grow grain from it which their cattle and they themselves eat? Will they not see even then?"
          ],
          "en.ahmedraza": [
            "And do they not see that We send the water to the barren land and produce crops with it, so their animals and they themselves eat from it? So do they not perceive?"
          ],
          "en.arberry": [
            "Have they not seen how We drive the water to the dry land and bring forth crops therewith whereof their cattle and themselves eat? What, will they not see?"
          ],
          "en.daryabadi": [
            "Observe they not that We drive water unto a land bare, and bring forth therewith crops whereof their cattle and they themselves eat? Will they not therefore be enlightened?"
          ],
          "en.hilali": [
            "Have they not seen how We drive water (rain clouds) to the dry land without any vegetation, and therewith bring forth crops providing food for their cattle and themselves? Will they not then see?"
          ],
          "en.itani": [
            "Do they not see how We conduct the water to a dry land, and with it We produce vegetation, from which their livestock eat, and themselves? Do they not see?"
          ],
          "en.maududi": [
            "Have they not seen that We drive water to the parched land, thereby bringing forth crops which they and their cattle eat? Are they unable to see?"
          ],
          "en.mubarakpuri": [
            "Have they not seen how We drive water to the dry land that has no vegetation, and therewith bring forth crops providing food for their cattle and themselves Will they not then see"
          ],
          "en.pickthall": [
            "Have they not seen how We lead the water to the barren land and therewith bring forth crops whereof their cattle eat, and they themselves? Will they not then see?"
          ],
          "en.qarai": [
            "Do they not see that We carry water to the parched earth and with it We bring forth crops, from which they eat, themselves and their cattle? Will they not then see?"
          ],
          "en.qaribullah": [
            "Do they not see how We drive the water to the parched lands and bring forth therefrom crops from which their cattle and themselves eat? Will they not see!"
          ],
          "en.sahih": [
            "Have they not seen that We drive the water [in clouds] to barren land and bring forth thereby crops from which their livestock eat and [they] themselves? Then do they not see?"
          ],
          "en.sarwar": [
            "Have they not seen that We drive the water to the barren land and cause crops to grow which they and their cattle consume? Why, then, they will not see?"
          ],
          "en.shakir": [
            "Do they not see that We drive the water to a land having no herbage, then We bring forth thereby seed-produce of which their cattle and they themselves eat; will they not then see?"
          ],
          "en.transliteration": [
            "Awalam yaraw ann<u>a</u> nasooqu alm<u>a</u>a il<u>a</u> alar<u>d</u>i aljuruzi fanukhriju bihi zarAAan takulu minhu anAA<u>a</u>muhum waanfusuhum afal<u>a</u> yub<u>s</u>iroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Have they not seen that We drive the water to the barren land and produce thereby crops of which their cattle and they themselves eat? Will they not then see?"
          ],
          "en.yusufali": [
            "And do they not see that We do drive rain to parched soil (bare of herbage), and produce therewith crops, providing food for their cattle and themselves? Have they not the vision?"
          ],
          "fa.ansarian": [
            "آیا ندانسته اند که ما آب را به سوی زمین بی گیاه می رانیم و به وسیله آن زراعتی را بیرون می آوریم که دام هایشان و خودشان از آن می خورند؟ پس آیا [آثار رحمت خدا را] نمی بینند؟!"
          ],
          "fa.ayati": [
            "آيا نمى‌بينند كه آب را به زمين خشك و بى‌گياه روانه مى‌سازيم تا كشتزارها برويانيم و چارپايان و خودشان از آن بخورند؟ چرا نمى‌بينند؟"
          ],
          "fa.bahrampour": [
            "آيا ننگريستند كه ما باران را به سوى زمين باير مى‌رانيم و بدان كشتزارى را بر مى‌آوريم كه دام‌هايشان و خودشان از آن مى‌خورند؟ آيا نمى‌بينند"
          ],
          "fa.fooladvand": [
            "آيا ننگريسته‌اند كه ما باران را به سوى زمين باير مى‌رانيم، و به وسيله آن كِشته‌اى را برمى‌آوريم كه دامهايشان و خودشان از آن مى‌خورند؟ مگر نمى‌بينند؟"
          ],
          "fa.ghomshei": [
            "آیا ندیدند که ما آب باران را به سوی زمین خشک بی‌آب و گیاه می‌بریم آن گاه حاصلی که خود و چهارپایانشان از آن بخورند می‌رویانیم؟ آیا باز هم چشم بصیرت نمی‌گشایند (تا لطف رحمت واسع خدا را به خلق بنگرند)."
          ],
          "fa.khorramdel": [
            "آیا نمی‌بینند که ما آب را (در لابلای ابرها و بر پشت بادها) به سوی سرزمینهای خشک و برهوت می‌رانیم و به وسیله‌ی آن کشتزارها می‌رویانیم که از آن هم چارپایانشان می‌خورند، و هم خودشان تغذیه می‌نمایند؟ آیا نمی‌بینند؟ [[«نَسُوقُ»: می‌رانیم. «الْجُزُرِ»: زمین لخت و برهوت و بدون گیاه (نگا: کهف / 8). «زَرْعاً»: کشتزار (نگا: انعام / 141، کهف / 32). زرع، در اینجا می‌تواند شامل هر گونه گیاه و درختی باشد.]]"
          ],
          "fa.khorramshahi": [
            "آیا نیندیشیده‌اند که ما آب [ابرهای بارانی‌] را به سوی سرزمین سترون می‌رانیم و بدان کشتزاری برمی‌آوریم که چارپایانشان و خودشان از آن می‌خورند، آیا [به چشم بصیرت‌] نمی‌نگرند؟"
          ],
          "fa.makarem": [
            "آیا ندیدند که ما آب را بسوی زمینهای خشک می‌رانیم و بوسیله آن زراعتهایی می‌رویانیم که هم چهارپایانشان از آن می‌خورند و هم خودشان تغذیه می‌کنند؛ آیا نمی بینند؟!"
          ],
          "fa.moezzi": [
            "آیا ندیدند که روان می‌سازیم آب را بسوی زمینی خشکزار پس برون آریم بدان کشتی را که می‌خورند از آن دامهای ایشان و ایشان پس آیا نمی‌نگرند"
          ],
          "fa.mojtabavi": [
            "آيا نديدند كه ما آب را به سوى زمين خشك و بى‌گياه مى‌رانيم، پس بدان كشتى را بيرون مى‌آريم كه چهارپايانشان و خودشان از آن مى‌خورند؟ آيا نمى‌بينند؟!"
          ],
          "fa.sadeqi": [
            "آیا و ننگریسته‌اند که ما همواره باران را سوی زمین بایر می‌رانیم، پس به آن کِشته‌ای را برون می‌آوریم، که دام‌هایشان و خودهاشان از آن می‌خورند؟ پس مگر نمی‌نگرند؟"
          ]
        }
      },
      {
        "index": 3531,
        "local_index": 28,
        "part_type": "Verse",
        "path": "/books/quran:32:28",
        "text": [
          "وَ يَقُولُونَ‌ مَتَى‌ هٰذَا الْفَتْحُ‌ إِنْ‌ کُنْتُمْ‌ صَادِقِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Yet they say: \"When will this decree come, if you speak the truth?\""
          ],
          "en.ahmedraza": [
            "And they say, “When will this decision take place, if you are truthful?”"
          ],
          "en.arberry": [
            "They also say, 'When shall be this Victory, if you speak truly?'"
          ],
          "en.daryabadi": [
            "And they say: When will this Decision arrive if ye are truthtellers?"
          ],
          "en.hilali": [
            "They say: \"When will this Al-Fath (Decision) be (between us and you, i.e. the Day of Resurrection), if you are telling the truth?\""
          ],
          "en.itani": [
            "And they say, “When is this victory, if you are truthful?”"
          ],
          "en.maududi": [
            "They say: “If you are truthful, (tell us) when will the Judgement come?”"
          ],
          "en.mubarakpuri": [
            "They say: \"When will this Fath be, if you are telling the truth\""
          ],
          "en.pickthall": [
            "And they say: When cometh this victory (of yours) if ye are truthful?"
          ],
          "en.qarai": [
            "They say, ‘When will this judgement be, if you are truthful?’"
          ],
          "en.qaribullah": [
            "They also ask: 'When will this Opening come, if what you say is true'"
          ],
          "en.sahih": [
            "And they say, \"When will be this conquest, if you should be truthful?\""
          ],
          "en.sarwar": [
            "They say, \"If what you say is true, when will the final triumph come?\""
          ],
          "en.shakir": [
            "And they say: When will this judgment take place, If you are truthful?"
          ],
          "en.transliteration": [
            "Wayaqooloona mat<u>a</u> h<u>atha</u> alfat<u>h</u>u in kuntum <u>sa</u>diqeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "And they say, \"When will this judgement come, if you are telling the truth?\""
          ],
          "en.yusufali": [
            "They say: \"When will this decision be, if ye are telling the truth?\""
          ],
          "fa.ansarian": [
            "و [مشرکان از روی مسخره به مؤمنان] می گویند: اگر راست می گویید این فتح و پیروزی [که به خود وعده می دهید و به آن دلخوش هستید] کی خواهد بود؟"
          ],
          "fa.ayati": [
            "مى‌گويند: اگر راست مى‌گوييد، پيروزى چه وقت خواهد بود؟"
          ],
          "fa.bahrampour": [
            "و مى‌گويند: اين پيروزى [شما] كى خواهد بود اگر راست مى‌گوييد"
          ],
          "fa.fooladvand": [
            "و مى‌پرسند: «اگر راست مى‌گوييد، اين پيروزى [شما] چه وقت است؟»"
          ],
          "fa.ghomshei": [
            "و کافران می‌گویند: این فتح و گشایش (یعنی روز قیامت یا فتح مکه به دست مسلمین که وعد و وعید می‌دهید) کی خواهد بود اگر راست می‌گویید؟"
          ],
          "fa.khorramdel": [
            "کافران می‌گویند: اگر راستگوئید، این روز فیصله (ی کار) و قضاوت (پروردگار در میان کافران و مؤمنان) کی خواهد بود؟! (چرا عذاب استیصال دنیوی، یا عذاب سرمدی اخروی، هر چه زودتر فرا نمی‌رسد و دامنگیر ما نمی‌شود؟!). [[«الْفَتْحِ»: داوری میان مردم. مراد دو چیز است: نخست روز عذاب استیصال دنیوی، یعنی عذابی که کفّار را ریشه‌کن می‌سازد و مجال و فرصت ایمان آوردن از آنان سلب می‌شود. مثل عذاب فرعون و فرعونیان، قوم هود، قوم نوح (نگا: انعام / 8 و 40 - 44، فرقان / 36 - 38). دوم روز عذاب سرمدی اخروی که روز داوری اصلی است و به کسی مهلت گریز از عذاب داده نمی‌شود (نگا: بقره / 162، نحل / 85، انبیاء / 40 سبأ / 26، صافّات / 21، دخان / 40). و امّا فتح را جنگ بدر یا روز فتح مکّه دانستن، اشتباه است. چرا که ایمان آوردن کفّار پذیرفته و مقبول بوده است. از جمله در فتح مکّه در حدود دو هزار نفر طلقاء ایمان آورده‌اند (نگا: تفسیر قاسمی).]]"
          ],
          "fa.khorramshahi": [
            "و گویند اگر راست می‌گویید این داوری کی خواهد بود؟"
          ],
          "fa.makarem": [
            "آنان می‌گویند: «اگر راست می‌گویید، این پیروزی شما کی خواهد بود؟!»"
          ],
          "fa.moezzi": [
            "و گویند کی است این گشایش (یا پیروزی) اگر هستید راستگویان‌"
          ],
          "fa.mojtabavi": [
            "و مى‌گويند: اگر راستگوييد اين پيروزى- يعنى پيروزى مؤمنان بر كافران كه به مؤمنان وعده داده شده- كى خواهد بود؟"
          ],
          "fa.sadeqi": [
            "و می‌گویند: «اگر (از) راستان بوده‌اید، این گشایش (شما) چه وقت است‌؟»"
          ]
        }
      },
      {
        "index": 3532,
        "local_index": 29,
        "part_type": "Verse",
        "path": "/books/quran:32:29",
        "text": [
          "قُلْ‌ يَوْمَ‌ الْفَتْحِ‌ لاَ يَنْفَعُ‌ الَّذِينَ‌ کَفَرُوا إِيمَانُهُمْ‌ وَ لاَ هُمْ‌ يُنْظَرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"Of no use will be the acceptance of belief to unbelievers on the Day of Decision, nor will they be granted respite."
          ],
          "en.ahmedraza": [
            "Proclaim, “On the Day of Decision*, the disbelievers will not benefit from their accepting faith, nor will they get respite.” (* Of death or of resurrection)"
          ],
          "en.arberry": [
            "Say: 'On the Day of Victory their faith shall not profit the unbelievers, nor shall they be respited.'"
          ],
          "en.daryabadi": [
            "Say thou: on the day of the Decision their belief will not profit those who have disbelieved; nor will they be respited."
          ],
          "en.hilali": [
            "Say: \"On the Day of Al-Fath (Decision), no profit will it be to those who disbelieve if they (then) believe! Nor will they be granted a respite.\""
          ],
          "en.itani": [
            "Say, “On the day of victory, the faith of those who disbelieved will be of no avail to them, and they will not be granted respite.”"
          ],
          "en.maududi": [
            "Tell them: “If the unbelievers were to believe on the Day of Judgement that will not avail them. For then they will be granted no respite.”"
          ],
          "en.mubarakpuri": [
            "Say: \"On the Day of Al-Fath, no profit will it be to those who disbelieve if they (then) believe! Nor will they be granted a respite.\""
          ],
          "en.pickthall": [
            "Say (unto them): On the day of the victory the faith of those who disbelieve (and who then will believe) will not avail them, neither will they be reprieved."
          ],
          "en.qarai": [
            "Say, ‘On the day of judgement their [newly found] faith will not avail the faithless, nor will they be granted any respite.’"
          ],
          "en.qaribullah": [
            "Say: 'On the Day of Opening the faith of the unbelievers will not benefit them, nor shall they be respited'"
          ],
          "en.sahih": [
            "Say, [O Muhammad], \"On the Day of Conquest the belief of those who had disbelieved will not benefit them, nor will they be reprieved.\""
          ],
          "en.sarwar": [
            "Say, \"On the day of the final triumph, the faith of the disbelievers will be of no avail to them, nor will they be given any respite\"."
          ],
          "en.shakir": [
            "Say: On the day of judgment the faith of those who (now) disbelieve will not profit them, nor will they be respited."
          ],
          "en.transliteration": [
            "Qul yawma alfat<u>h</u>i l<u>a</u> yanfaAAu alla<u>th</u>eena kafaroo eem<u>a</u>nuhum wal<u>a</u> hum yun<i><u>th</u></i>aroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Say, \"On the Day of Judgement it will be of no benefit to those who were bent on denying the truth, if they [then] believe! They will be granted no respite.\""
          ],
          "en.yusufali": [
            "Say: \"On the Day of Decision, no profit will it be to Unbelievers if they (then) believe! nor will they be granted a respite.\""
          ],
          "fa.ansarian": [
            "بگو: روز فتح و پیروزی [حتمی مؤمنان] کسانی که کفر ورزیده اند، نه ایمان آوردنشان سودشان دهد و نه به آنان مهلت داده می شود؛"
          ],
          "fa.ayati": [
            "بگو: در روز پيروزى، ايمان آوردن كافران سودشان ندهد، و مهلتشان ندهند."
          ],
          "fa.bahrampour": [
            "بگو: روز فتح، ايمان كسانى كه كافر شدند سودى نمى‌دهد و مهلت داده نمى‌شوند"
          ],
          "fa.fooladvand": [
            "بگو: «روز پيروزى، ايمان كسانى كه كافر شده‌اند سود نمى‌بخشد و آنان مهلت نمى‌يابند.»"
          ],
          "fa.ghomshei": [
            "بگو که (امروز باید ایمان آرید که) روز فتح، ایمان آنان که کافر بودند سود نبخشد و آنها را مهلت ندهند."
          ],
          "fa.khorramdel": [
            "بگو: در روز فیصله (ی کار) و قضاوت (پروردگار، کار از کار می‌گذرد و) ایمان آوردن کفّار سودی به حالشان ندارد و (لحظه‌ای از دست عذاب) بدیشان مهلت داده نمی‌شود. [[«یَوْمَ الْفَتْحِ»: (نگا: سجده / 28).]]"
          ],
          "fa.khorramshahi": [
            "بگو روز داوری کافران را ایمانشان سود ندهد و به آنان مهلت ندهند"
          ],
          "fa.makarem": [
            "بگو: «روز پیروزی، ایمان آوردن، سودی به حال کافران نخواهد داشت؛ و به آنها هیچ مهلت داده نمی‌شود!»"
          ],
          "fa.moezzi": [
            "بگو روز پیروزی سود ندهد آنان را که کفر ورزیدند ایمانشان و نه مهلت داده شوند"
          ],
          "fa.mojtabavi": [
            "بگو: در روز پيروزى، آنان را كه كافر شدند ايمان آوردنشان سود ندهد و نه مهلت داده شوند."
          ],
          "fa.sadeqi": [
            "بگو: «روز گشایش، ایمانِ کسانی که کافر شده‌اند سودی نمی‌بخشد و آنان مهلت (هم) نمی‌یابند.»"
          ]
        }
      },
      {
        "index": 3533,
        "local_index": 30,
        "part_type": "Verse",
        "path": "/books/quran:32:30",
        "text": [
          "فَأَعْرِضْ‌ عَنْهُمْ‌ وَ انْتَظِرْ إِنَّهُمْ‌ مُنْتَظِرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Therefore turn away from them and wait as they are waiting."
          ],
          "en.ahmedraza": [
            "Therefore turn away from them and wait – indeed they too have to wait."
          ],
          "en.arberry": [
            "So turn thou away from them, and wait; they too are waiting."
          ],
          "en.daryabadi": [
            "Wherefore turn aside thou from them, and await; verily they are awaiting."
          ],
          "en.hilali": [
            "So turn aside from them (O Muhammad SAW) and await, verily they (too) are awaiting."
          ],
          "en.itani": [
            "So turn away from them, and wait. They too are waiting."
          ],
          "en.maududi": [
            "So (leave them to themselves and) turn away from them and wait; they too are waiting."
          ],
          "en.mubarakpuri": [
            "So turn aside from them and await, verily, they (too) are awaiting."
          ],
          "en.pickthall": [
            "So withdraw from them (O Muhammad), and await (the event). Lo! they (also) are awaiting (it)."
          ],
          "en.qarai": [
            "So turn away from them, and wait. They too are waiting."
          ],
          "en.qaribullah": [
            "Therefore turn away from them, and wait, they are waiting."
          ],
          "en.sahih": [
            "So turn away from them and wait. Indeed, they are waiting."
          ],
          "en.sarwar": [
            "Turn away from them and wait. They are, also, waiting."
          ],
          "en.shakir": [
            "Therefore turn away from them and wait, surely they too are waiting."
          ],
          "en.transliteration": [
            "FaaAAri<u>d</u> AAanhum wa<b>i</b>nta<i><u>th</u></i>ir innahum munta<i><u>th</u></i>iroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "So turn away from them and wait. They too are waiting."
          ],
          "en.yusufali": [
            "So turn away from them, and wait: they too are waiting."
          ],
          "fa.ansarian": [
            "بنابراین از آنان روی برگردان و منتظر [رسیدن پیروزی] باش که آنان هم [به گمان خود] منتظرند [که بر شما پیروز شوند.]"
          ],
          "fa.ayati": [
            "پس، از ايشان اعراض كن و منتظر باش، كه آنها نيز در انتظارند."
          ],
          "fa.bahrampour": [
            "پس، از ايشان روى برتاب و منتظر باش كه آنها نيز در انتظارند"
          ],
          "fa.fooladvand": [
            "پس، از ايشان روى برتاب و منتظر باش كه آنها نيز در انتظارند."
          ],
          "fa.ghomshei": [
            "پس از آن کافران اعراض و دوری کن و منتظر (فتح و فیروزی خدا) باش، که آنها هم منتظر (قوّت خویش و ضعف و شکست تو) هستند."
          ],
          "fa.khorramdel": [
            "(ای پیغمبر! اکنون که چنین است و استهزاء و تمسخر، کار همیشگی کافرین است) به ایشان اهمّیّت مده (و به تبلیغ خود ادامه بده) و منتظر (یاری خدا و شکست مشرکان) باش، چرا که ایشان هم منتظر (شکست و هلاک تو و مؤمنان) هستند. [[«أَعْرِضْ عَنْهُمْ»: از آنان روی بگردان. بدیشان اهمّیّت مده.]]"
          ],
          "fa.khorramshahi": [
            "پس از آنان روی بگردان و منتظر باش که آنان نیز منتظرند"
          ],
          "fa.makarem": [
            "حال که چنین است، از آنها روی بگردان و منتظر باش؛ آنها نیز منتظرند! (تو منتظر رحمت خدا و آنها هم منتظر عذاب او!)"
          ],
          "fa.moezzi": [
            "پس روی برتاب از ایشان و منتظر باش که ایشانند منتظران‌"
          ],
          "fa.mojtabavi": [
            "پس، از آنها روى بگردان و منتظر باش، كه آنان نيز منتظرند."
          ],
          "fa.sadeqi": [
            "پس، از ایشان روی برتاب و منتظر باش. بی‌گمان آنان (نیز) منتظرانند."
          ]
        }
      }
    ]
  },
  "index": "quran:32",
  "kind": "verse_list"
}