{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/quran:46",
        "titles": {
          "ar": "الأحقاف",
          "en": "The Dunes",
          "ent": "Al-Ahqaf"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 46,
    "local_index": 46,
    "order": 66,
    "part_type": "Chapter",
    "path": "/books/quran:46",
    "reveal_type": "Meccan",
    "rukus": 4,
    "titles": {
      "ar": "الأحقاف",
      "en": "The Dunes",
      "ent": "Al-Ahqaf"
    },
    "verse_count": 35,
    "verse_start_index": 4510,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 4511,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:46:1",
        "text": [
          "حم‌"
        ],
        "translations": {
          "en.ahmedali": [
            "HA MIM."
          ],
          "en.ahmedraza": [
            "Ha-Meem. (Alphabets of the Arabic language – Allah, and to whomever He reveals, know their precise meanings.)"
          ],
          "en.arberry": [
            "Ha Mim"
          ],
          "en.daryabadi": [
            "Ha. Mim."
          ],
          "en.hilali": [
            "Ha-Mim. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings]."
          ],
          "en.itani": [
            "Ha, Meem."
          ],
          "en.maududi": [
            "Ha'. Mim."
          ],
          "en.mubarakpuri": [
            "Ha Mim."
          ],
          "en.pickthall": [
            "Ha. Mim."
          ],
          "en.qarai": [
            "Ha, Meem."
          ],
          "en.qaribullah": [
            "HaMeem."
          ],
          "en.sahih": [
            "Ha, Meem."
          ],
          "en.sarwar": [
            "Ha. Mim."
          ],
          "en.shakir": [
            "Ha Mim."
          ],
          "en.transliteration": [
            "<u>Ha</u>meem"
          ],
          "en.wahiduddin": [
            "Ha Mim"
          ],
          "en.yusufali": [
            "Ha-Mim."
          ],
          "fa.ansarian": [
            "حم"
          ],
          "fa.ayati": [
            "حا، ميم."
          ],
          "fa.bahrampour": [
            "حا، ميم"
          ],
          "fa.fooladvand": [
            "حاء، ميم."
          ],
          "fa.ghomshei": [
            "حم (قسم به خدای حمید و مجید که)"
          ],
          "fa.khorramdel": [
            "حا. میم. [[«حم»: (نگا: بقره / 1).]]"
          ],
          "fa.khorramshahi": [
            "حم [حا میم‌]"
          ],
          "fa.makarem": [
            "حم‌"
          ],
          "fa.moezzi": [
            "حم‌"
          ],
          "fa.mojtabavi": [
            "حاميم."
          ],
          "fa.sadeqi": [
            "حم."
          ]
        }
      },
      {
        "index": 4512,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:46:2",
        "text": [
          "تَنْزِيلُ‌ الْکِتَابِ‌ مِنَ‌ اللَّهِ‌ الْعَزِيزِ الْحَکِيمِ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "The revelation of this Book is from God, the mighty and all-wise."
          ],
          "en.ahmedraza": [
            "The sending down of this Book is from Allah the Most Honourable, the Wise."
          ],
          "en.arberry": [
            "The sending down of the Book is from God, the All-mighty, the All-wise."
          ],
          "en.daryabadi": [
            "The revelation of the Book is from Allah, the Mighty, the Wise."
          ],
          "en.hilali": [
            "The revelation of the Book (this Quran) is from Allah, the All-Mighty, the All-Wise."
          ],
          "en.itani": [
            "The sending down of the Scripture is from God, the Honorable, the Wise."
          ],
          "en.maududi": [
            "The revelation of this Book is from Allah, the Most Mighty, the Most Wise."
          ],
          "en.mubarakpuri": [
            "The revelation of the Book is from Allah, the Almighty, the All-Wise."
          ],
          "en.pickthall": [
            "The revelation of the Scripture is from Allah the Mighty, the Wise."
          ],
          "en.qarai": [
            "The [gradual] sending down of the Book is from Allah, the All-mighty, the All-wise."
          ],
          "en.qaribullah": [
            "The sending down of the Book is from Allah, the Almighty, the Wise."
          ],
          "en.sahih": [
            "The revelation of the Book is from Allah, the Exalted in Might, the Wise."
          ],
          "en.sarwar": [
            "This Book is revealed from God the Majestic and All-wise."
          ],
          "en.shakir": [
            "The revelation of the Book is from Allah, the Mighty, the Wise."
          ],
          "en.transliteration": [
            "Tanzeelu alkit<u>a</u>bi mina All<u>a</u>hi alAAazeezi al<u>h</u>akeem<b>i</b>"
          ],
          "en.wahiduddin": [
            "This Book is sent down from God, the Almighty, the Wise One."
          ],
          "en.yusufali": [
            "The Revelation of the Book is from Allah the Exalted in Power, Full of Wisdom."
          ],
          "fa.ansarian": [
            "این کتاب نازل شده از سوی خدای توانای شکست ناپذیر حکیم است."
          ],
          "fa.ayati": [
            "نازل شدن اين كتاب از جانب خداى پيروزمند و حكيم است."
          ],
          "fa.bahrampour": [
            "اين كتاب از جانب خداى شكست ناپذير حكيم نازل شده است"
          ],
          "fa.fooladvand": [
            "فرو فرستادن اين كتاب، از جانب خداى ارجمند حكيم است."
          ],
          "fa.ghomshei": [
            "تنزیل این قرآن عظیم از جانب خدای مقتدر حکیم است."
          ],
          "fa.khorramdel": [
            "این کتاب (قرآن نام) از سوی خداوند باعزّت و باحکمت نازل می‌گردد. [[«تَنزِیلُ الْکِتَابِ ...»: (نگا: زمر / 1، غافر / 2، جاثیه / 2).]]"
          ],
          "fa.khorramshahi": [
            "کتابی است فروفرستاده از سوی خداوند پیروزمند فرزانه‌"
          ],
          "fa.makarem": [
            "این کتاب از سوی خداوند عزیز و حکیم نازل شده است!"
          ],
          "fa.moezzi": [
            "فرستادن کتاب از خداوند عزّتمند حکیم‌"
          ],
          "fa.mojtabavi": [
            "فروفرستادن اين كتاب از سوى خداى تواناى بى‌همتا و داناى با حكمت است."
          ],
          "fa.sadeqi": [
            "فرو فرستادن تدریجی این کتاب، از جانب خدای عزیز حکیم است."
          ]
        }
      },
      {
        "index": 4513,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:46:3",
        "text": [
          "مَا خَلَقْنَا السَّمَاوَاتِ‌ وَ الْأَرْضَ‌ وَ مَا بَيْنَهُمَا إِلاَّ بِالْحَقِ‌ وَ أَجَلٍ‌ مُسَمًّى‌ وَ الَّذِينَ‌ کَفَرُوا عَمَّا أُنْذِرُوا مُعْرِضُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "We have not created the heavens and the earth and all that lies between them but with a purpose for an appointed time. Yet the unbelievers turn away from the warning."
          ],
          "en.ahmedraza": [
            "We did not create the heavens and the earth and all that is between them except with the truth, and for a fixed term; and the disbelievers have turned away from what they are warned!"
          ],
          "en.arberry": [
            "We have not created the heavens and the earth, and what between them is, save with the truth and a stated term; but the unbelievers are turning away from that they were warned of."
          ],
          "en.daryabadi": [
            "We created not the heavens and the earth and whatsoever is in-between the twain save with truth, and for a term stated. And those who disbelieve are from that whereof they are warned backsliders."
          ],
          "en.hilali": [
            "We created not the heavens and the earth and all that is between them except with truth, and for an appointed term. But those who disbelieve turn away from that whereof they are warned."
          ],
          "en.itani": [
            "We did not create the heavens and the earth and what lies between them except with reason, and for a finite period. But the blasphemers continue to ignore the warnings they receive."
          ],
          "en.maududi": [
            "We have created the heavens and the earth and all that is between them in Truth and for an appointed term. But those who disbelieve have turned away from what they were warned against."
          ],
          "en.mubarakpuri": [
            "We created not the heavens and the earth and all that is between them except with truth, and for a specified term. But those who disbelieve, turn away from that whereof they are warned."
          ],
          "en.pickthall": [
            "We created not the heavens and the earth and all that is between them save with truth, and for a term appointed. But those who disbelieve turn away from that whereof they are warned."
          ],
          "en.qarai": [
            "We did not create the heavens and the earth and whatever is between them except with consummate wisdom and for a specified term. Yet the faithless are disregardful of what they are warned."
          ],
          "en.qaribullah": [
            "It was in truth that We created the heavens and the earth, and all that is between them, for an appointed term. Yet the unbelievers do not turn away from that which they were warned."
          ],
          "en.sahih": [
            "We did not create the heavens and earth and what is between them except in truth and [for] a specified term. But those who disbelieve, from that of which they are warned, are turning away."
          ],
          "en.sarwar": [
            "We have created the heavens and the earth and all that is between them ONLY for a genuine purpose and an appointed time. The unbelievers ignore that of which they have been warned."
          ],
          "en.shakir": [
            "We did not create the heavens and the earth and what is between them two save with truth and (for) an appointed term; and those who disbelieve turn aside from what they are warned of."
          ],
          "en.transliteration": [
            "M<u>a</u> khalaqn<u>a</u> a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>a wam<u>a</u> baynahum<u>a</u> ill<u>a</u> bi<b>a</b>l<u>h</u>aqqi waajalin musamman wa<b>a</b>lla<u>th</u>eena kafaroo AAamm<u>a</u> on<u>th</u>iroo muAAri<u>d</u>oon<b>a</b>"
          ],
          "en.wahiduddin": [
            "We created the heavens and the earth and all that lies between them purely for just ends, and for a specific term, but those who reject Faith turn away from what they have been warned of."
          ],
          "en.yusufali": [
            "We created not the heavens and the earth and all between them but for just ends, and for a Term Appointed: But those who reject Faith turn away from that whereof they are warned."
          ],
          "fa.ansarian": [
            "ما آسمان ها و زمین و آنچه را میان آن دوست، جز به حقّ و تا سرآمدی معین نیافریدیم، و کافران از آنچه بیمشان داده اند، روی گردانند."
          ],
          "fa.ayati": [
            "ما آسمانها و زمين و آنچه را كه در ميان آن دوست جز به حق و در مدتى معين نيافريده‌ايم. و كافران از آنچه بيمشان مى‌دهند اعراض مى‌كنند."
          ],
          "fa.bahrampour": [
            "[ما] آسمان‌ها و زمين و آنچه را كه ميان آن دو است جز به حق و تا سر آمدى معين نيافريديم، و كسانى كه كافر شدند، از هشدارهايى كه داده مى‌شوند رو گردانند"
          ],
          "fa.fooladvand": [
            "[ما] آسمانها و زمين و آنچه را كه ميان آن دو است جز به حق و [تا] زمانى معيّن نيافريديم، و كسانى كه كافر شده‌اند، از آنچه هشدار داده شده‌اند رويگردانند."
          ],
          "fa.ghomshei": [
            "ما آسمانها و زمین و آنچه را بین آنهاست جز به حق (و برای حکمت و مصلحت خلق) و جز در وقت معیّن نیافریده‌ایم و آنان که کافرند از هر چه پند و اندرزشان کنند و بیمشان دهند روی می‌گردانند."
          ],
          "fa.khorramdel": [
            "ما آسمانها و زمین و آنچه در میان این دو است جز به حق و برای سرآمد معیّنی نیافریده‌ایم. (در مجموعه‌ی عالم خلقت، چیزی ناموزون و ناسنجیده و مخالف حق یافته نمی‌شود، و این مجموعه، همان گونه که سرآغازی داشته است، سرانجامی نیز دارد، و با فرا رسیدن آن دنیا فانی می‌شود، و به دنبال آن جهان دیگری شروع می‌گردد، و نتائج اعمال در آن بررسی، و پاداش و پادافره داده می‌شود) ولیکن کافران (که این حقیقت را نمی‌پذیرند و) از آنچه از آن بیم داده می‌شوند (که فرا رسیدن دادگاه بزرگ قیامت و شقاوت آخرت است) روی می‌گردانند. [[«أَجَلٍ مُّسَمّیً»: سرآمد معیّن که قیامت است (نگا: یونس / 4، روم / 8). عطف بر (الْحَقِّ) است. «عَمَّآ أُنذِرُوا»: از آنچه بیم داده شده‌اند. مراد رستاخیز و دادگاهی و حسابرسی و مکافات و مجازات آخرت است که با کتاب مقروء و تدوینی قرآن، و با کتاب منظور و تکوینی جهان، کافران هشدار و بیم داده می‌شوند، ولی نه به این توجّهی می‌کنند و نه به آن.]]"
          ],
          "fa.khorramshahi": [
            "آسمانها و زمین و آنچه در میان آنهاست، جز به حق و سرآمدی معین نیافریده‌ایم و کافران از آنچه هشدار می‌یابند رویگردانند"
          ],
          "fa.makarem": [
            "ما آسمانها و زمین و آنچه را در میان این دو است جز بحق و برای سرآمد معیّنی نیافریدیم؛ امّا کافران از آنچه انذار می‌شوند روی گردانند!"
          ],
          "fa.moezzi": [
            "نیافریدیم آسمانها و زمین و آنچه میان آنها است جز به حقّ و سرآمدی نامبرده و آنان که کفر ورزیدند هستند از آنچه بیم داده شدند روی‌گردانان‌"
          ],
          "fa.mojtabavi": [
            "ما آسمانها و زمين و آنچه را ميان آنهاست نيافريديم مگر بحق و [تا] سرآمدى نامبرده، و كسانى كه كافر شدند از آنچه بيم‌داده شدند رويگردانند."
          ],
          "fa.sadeqi": [
            "(ما) آسمان‌ها و زمین و آنچه را که میان آن دو است جز به حقّ و (تا) زمانی معیّن نیافریدیم‌. و آنان که کافر شدند، از آنچه هشدار داده شده‌اند رویگردانند."
          ]
        }
      },
      {
        "index": 4514,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:46:4",
        "text": [
          "قُلْ‌ أَ رَأَيْتُمْ‌ مَا تَدْعُونَ‌ مِنْ‌ دُونِ‌ اللَّهِ‌ أَرُونِي‌ مَا ذَا خَلَقُوا مِنَ‌ الْأَرْضِ‌ أَمْ‌ لَهُمْ‌ شِرْکٌ‌ فِي‌ السَّمَاوَاتِ‌ ائْتُونِي‌ بِکِتَابٍ‌ مِنْ‌ قَبْلِ‌ هٰذَا أَوْ أَثَارَةٍ مِنْ‌ عِلْمٍ‌ إِنْ‌ کُنْتُمْ‌ صَادِقِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"Have you thought of those you invoke apart from God? Show me what they have created of the earth, or, do they have a share in the heavens? Bring me an earlier Book than this, or inherited knowledge, if you are truthful.\""
          ],
          "en.ahmedraza": [
            "Proclaim, (O dear Prophet Mohammed – peace and blessings be upon him), “What is your opinion – regarding those whom you worship other than Allah – show me which part of the earth they have created, or do they own any portion of the heavens? Bring to me a Book preceding this (Qur’an), or some remnants of knowledge, if you are truthful.”"
          ],
          "en.arberry": [
            "Say: 'Have you considered that you call upon apart from God? Show me what they have created of the earth; or have they a partnership in the heavens? Bring me a Book before this, or some remnant of a knowledge, if you speak truly.'"
          ],
          "en.daryabadi": [
            "Say thou: bethink ye: whatsoever ye call upon beside Allah- show me whatsoever they have created of the earth? Or have they any partnership in the heavens? Bring me a Book before this, Or some trace of knowledges if ye say sooth."
          ],
          "en.hilali": [
            "Say (O Muhammad SAW to these pagans): \"Think! All that you invoke besides Allah show me! What have they created of the earth? Or have they a share in (the creation of) the heavens? Bring me a Book (revealed before this), or some trace of knowledge (in support of your claims), if you are truthful!\""
          ],
          "en.itani": [
            "Say, “Have you considered those you worship instead of God? Show me which portion of the earth they have created. Or do they own a share of the heavens? Bring me a scripture prior to this one, or some trace of knowledge, if you are truthful.”"
          ],
          "en.maududi": [
            "Tell them, (O Prophet): “Did you consider those whom you call upon beside Allah? Show me, which part of the earth they created? Or do they have any share in creating the heavens? Bring to me any Scripture earlier than this one, or any vestige of knowledge (in support of your belief) if you are truthful."
          ],
          "en.mubarakpuri": [
            "Say: \"Think you about all that you invoke besides Allah Show me what have they created of the earth Or have they a share in (the creation of) the heavens Bring me a scripture prior to this or some trace of knowledge, if you are truthful!\""
          ],
          "en.pickthall": [
            "Say (unto them, O Muhammad): Have ye thought on all that ye invoke beside Allah? Show me what they have created of the earth. Or have they any portion in the heavens? Bring me a scripture before this (Scripture), or some vestige of knowledge (in support of what ye say), if ye are truthful."
          ],
          "en.qarai": [
            "Say, ‘Tell me about those you invoke besides Allah. Show me what [part] of the earth have they created. Do they have any share in the heavens? Bring me a scripture [revealed] before this, or some vestige of [divine] knowledge, if you are truthful.’"
          ],
          "en.qaribullah": [
            "Say: 'Have you seen those whom you call upon, other than Allah? Show me what they have created from the earth! Or, do they have a partnership in theheavens? Bring me a Book before this or some other remnant of knowledge, if what you say is true'"
          ],
          "en.sahih": [
            "Say, [O Muhammad], \"Have you considered that which you invoke besides Allah? Show me what they have created of the earth; or did they have partnership in [creation of] the heavens? Bring me a scripture [revealed] before this or a [remaining] trace of knowledge, if you should be truthful.\""
          ],
          "en.sarwar": [
            "(Muhammad), ask them, \"Have you thought about what you worship besides God? Show me which part of the earth they have created. Do they have a share in the creation of the heavens? Bring me a Book, revealed before this Quran, or any other proof based on knowledge to support your belief, if indeed you are truthful\"."
          ],
          "en.shakir": [
            "Say: Have you considered what you call upon besides Allah? Show me what they have created of the earth, or have they a share in the heavens? Bring me a book before this or traces of knowledge, if you are truthful."
          ],
          "en.transliteration": [
            "Qul araaytum m<u>a</u> tadAAoona min dooni All<u>a</u>hi aroonee m<u>atha</u> khalaqoo mina alar<u>d</u>i am lahum shirkun fee a<b>l</b>ssam<u>a</u>w<u>a</u>ti eetoonee bikit<u>a</u>bin min qabli h<u>atha</u> aw ath<u>a</u>ratin min AAilmin in kuntum <u>sa</u>diqeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "Say, \"Have you thought about those you call upon apart from God? Show me what they have created on the earth. Or do they have a share in the heavens? Bring me a Book revealed before this or some other vestige of knowledge, if you are telling the truth."
          ],
          "en.yusufali": [
            "Say: \"Do ye see what it is ye invoke besides Allah? Show me what it is they have created on earth, or have they a share in the heavens bring me a book (revealed) before this, or any remnant of knowledge (ye may have), if ye are telling the truth!"
          ],
          "fa.ansarian": [
            "[به مشرکان] بگو: به من خبر دهید [و نشانم دهید] معبودانی که به جای خدا می پرستید چه چیزی از زمین را آفریده اند یا مگر آنان را در آفرینش آسمان ها مشارکتی است؟ اگر راستگو هستید کتابی پیش از این قرآن یا بازمانده ای از دانش استواری [که ادعای شما را تصدیق کند] برای من بیاورید؛"
          ],
          "fa.ayati": [
            "بگو: از آنهايى كه جُز اللّه به خدايى مى‌خوانيد خبر دهيد. به من نشان دهيد كه از اين زمين چه چيز را آفريده‌اند؟ يا در خلقت آسمانها شركت داشته‌اند؟ اگر راست مى‌گوييد، براى من كتابى كه پيش از اين قرآن آمده باشد يا اگر دانشى از پيشينيان مانده است، بياوريد."
          ],
          "fa.bahrampour": [
            "بگو: به من خبر دهيد، آنچه را غير از خدا مى‌خوانيد، به من نشان دهيد كه چه چيزى از زمين را آفريده‌اند و يا در [خلقت‌] آسمان‌ها شركت داشته‌اند؟ اگر راست مى‌گوييد [دليلى از] كتابى كه پيش از اين [قرآن‌] است يا اثرى علمى [از پيشينيان‌] براى من بياوريد [كه ا"
          ],
          "fa.fooladvand": [
            "بگو: «به من خبر دهيد، آنچه را به جاى خدا فرا مى‌خوانيد به من نشان دهيد كه چه چيزى از زمين [را] آفريده يا [مگر] آنان را در [كار] آسمانها مشاركتى است؟ اگر راست مى‌گوييد، كتابى پيش از اين [قرآن ]يا بازمانده‌اى از دانش نزد من آوريد.»"
          ],
          "fa.ghomshei": [
            "بگو: جز خدا همه آن بتهایی که به خدایی می‌خوانید به من نشان دهید که آیا در زمین چیزی آفریده‌اند؟ یا شرکتی با خدا در خلقت آسمانها دارند؟ اگر از کتب آسمانی پیشین دلیلی بر خدایی بتان دارید یا کمتر اثر و نشان بر درستی عقیده شرک یافته‌اید اگر راست می‌گویید بر من بیاورید."
          ],
          "fa.khorramdel": [
            "بگو: آیا دقّت کرده‌اید درباره‌ی چیزهائی که بجز خدا به فریاد می‌خوانید و می‌پرستید؟ به من نشان دهید چه چیزی از زمین را آفریده‌اند؟ یا اصلاً در (آفرینش و گردش و چرخش) آسمانها مشارکتی داشته‌اند؟ (اگر فرضاً می‌گوئید بلی آنها شرکت داشته‌اند) کتابی (از کتابهای آسمانی) پیش از این (قرآن که گفتار شما را تصدیق کند) یا یک اثر علمی (و باستانی از علمای گذشته که گواهی دهد بر راستی چنین ادّعائی) برای من بیاورید، اگر راست می‌گوئید. [[«أَرَأَیْتُمْ»: آیا دیده‌اید و دقّت کرده‌اید؟ بیان کنید و مرا از پرسشِ: (چه چیزی را آفریده‌اند؟) آگاه سازید (نگا: فاطر / 40، زمر / 38). «أَرُونِی»: نشانم دهید. به من بنمائید. «شِرْکٌ»: مشارکت. شرکت (نگا: سبأ / 22، فاطر / 40) «أَثَارَةٍ»: باقیمانده و اثری که روایت گردد و گفته شود. «إِئْتُونِی بِکِتَابٍ مِّن قَبْلِ هذا»: در این قسمت، از کفّار دلیل نقلی منقول از زبان وحی آسمانی خواسته شده است. «أَثَارَةٍ مِّنْ عِلْمٍ»: در این بخش، از کفّار دلیل عقلی و منطقی منقول از دانشمندان خواسته شده است.]]"
          ],
          "fa.khorramshahi": [
            "بگو آیا شریکانی را که به جای خداوند قائل هستید، نگریسته‌اید، به من بنمایانید که چه چیزی را در زمین آفریده‌اند، یا آیا در [آفرینش‌] آسمانها شرکتی داشته‌اند، اگر راست می‌گویید کتابی پیش از این [کتاب‌]، یا نشانه‌ای از علم بیاورید"
          ],
          "fa.makarem": [
            "به آنان بگو: «این معبودهایی را که غیر از خدا پرستش می‌کنید به من نشان دهید چه چیزی از زمین را آفریده‌اند، یا شرکتی در آفرینش آسمانها دارند؟ کتابی آسمانی پیش از این، یا اثر علمی از گذشتگان برای من بیاورید (که دلیل صدق گفتار شما باشد) اگر راست می‌گویید!»"
          ],
          "fa.moezzi": [
            "بگو آیا دیدید آنچه را خوانید جز خدا بنمائیدم چه چیز آفریدند از زمین یا ایشان را است شرکتی در آسمانها بیاریدم به کتابی از پیش از این یا بازمانده‌ای از دانش اگر هستید راستگویان‌"
          ],
          "fa.mojtabavi": [
            "بگو: مرا گوييد كه آنچه جز خدا مى‌خوانيد به من بنماييد كه چه چيز از اين زمين- يا كدام بخش زمين- را آفريده‌اند يا مگر در [آفرينش‌] آسمانها شركت داشته‌اند؟! اگر راستگوييد، براى من [دليلى از] كتابى كه پيش از اين [قرآن‌] آمده باشد يا بازمانده‌اى از دانش [پيشينيان‌] بياريد."
          ],
          "fa.sadeqi": [
            "بگو: «آیا آنچه را به جای خدا فرا می‌خوانید دیده (و دریافته)اید؟ به من نشان دهید (که) چه چیزی از زمین را آفریده‌اند، یا (مگر) آنان را در (کار) آسمان‌ها (با خدا) مشارکتی است‌؟ اگر راست می‌گویید، کتابی پیش از این [:قرآن] یا اثر و بازمانده‌ای از دانشی (وحیانی) نزد من آرید.»"
          ]
        }
      },
      {
        "index": 4515,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:46:5",
        "text": [
          "وَ مَنْ‌ أَضَلُ‌ مِمَّنْ‌ يَدْعُو مِنْ‌ دُونِ‌ اللَّهِ‌ مَنْ‌ لاَ يَسْتَجِيبُ‌ لَهُ‌ إِلَى‌ يَوْمِ‌ الْقِيَامَةِ وَ هُمْ‌ عَنْ‌ دُعَائِهِمْ‌ غَافِلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Who is more astray than he who calls on those, apart from God, who cannot answer their prayers till the Day of Resurrection, and are even unaware of being called."
          ],
          "en.ahmedraza": [
            "And who is more astray than one who worships those, instead of Allah, who cannot listen to their prayer until* the Day of Resurrection, and who do not even know of their worship! (Will never listen.)"
          ],
          "en.arberry": [
            "And who is further astray than he who calls, apart from God, upon such a one as shall not answer him till the Day of Resurrection? Such as are heedless of their calling,"
          ],
          "en.daryabadi": [
            "And who is more astray than he who calleth beside Allah, Unto such as will answer it not till the Day of Resurrection and who are of their call unaware."
          ],
          "en.hilali": [
            "And who is more astray than one who calls (invokes) besides Allah, such as will not answer him till the Day of Resurrection, and who are (even) unaware of their calls (invocations) to them?"
          ],
          "en.itani": [
            "Who is more wrong than him who invokes, besides God, those who will not answer him until the Day of Resurrection, and are heedless of their prayers?"
          ],
          "en.maududi": [
            "Who is farther strayed from the Right Path than he who calls upon others than Allah that cannot answer his call till the Day of Resurrection, the while they are not even conscious that callers are calling upon them?"
          ],
          "en.mubarakpuri": [
            "And who is more astray than those who invoke besides Allah others who will not answer them until the Day of Resurrection, and who are unaware of their invocations to them"
          ],
          "en.pickthall": [
            "And who is further astray than those who, instead of Allah, pray unto such as hear not their prayer until the Day of Resurrection, and are unconscious of their prayer,"
          ],
          "en.qarai": [
            "Who is more astray than him who invokes besides Allah such [entities] as would not respond to him until the Day of Resurrection, and who are oblivious of their invocation?"
          ],
          "en.qaribullah": [
            "Who is further astray than he who calls upon, other than Allah, those who will never answer him till the Day of Resurrection, who are indeed, heedless of their supplication?"
          ],
          "en.sahih": [
            "And who is more astray than he who invokes besides Allah those who will not respond to him until the Day of Resurrection, and they, of their invocation, are unaware."
          ],
          "en.sarwar": [
            "Who is more astray than one who prays to things besides God; things that would not be able to answer his prayers even if he would wait till the Day of Judgment. They are not even aware of his prayers."
          ],
          "en.shakir": [
            "And who is in greater error than he who calls besides Allah upon those that will not answer him till the day of resurrection and they are heedless of their call?"
          ],
          "en.transliteration": [
            "Waman a<u>d</u>allu mimman yadAAoo min dooni All<u>a</u>hi man l<u>a</u> yastajeebu lahu il<u>a</u> yawmi alqiy<u>a</u>mati wahum AAan duAA<u>a</u>ihim gh<u>a</u>filoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "And who is more misguided than one who invokes, besides God, such as will not answer him until the Day of Resurrection, and who [in fact] are not even aware of his call,"
          ],
          "en.yusufali": [
            "And who is more astray than one who invokes besides Allah, such as will not answer him to the Day of Judgment, and who (in fact) are unconscious of their call (to them)?"
          ],
          "fa.ansarian": [
            "و چه کسانی گمراه ترند از کسانی که به جای خدا معبودانی را می خوانند که تا روز قیامت پاسخشان را نمی دهند و آنان از خواندنشان بی خبرند؟"
          ],
          "fa.ayati": [
            "و كيست گمراه‌تر از آن كه به جز اللّه چيزى را به خدايى مى‌خواند كه تا روز قيامت به او جواب نمى‌دهد، كه بتان از دعاى بت پرستان بى‌خبرند."
          ],
          "fa.bahrampour": [
            "و كيست گمراه‌تر از آن كس كه به جاى خدا كسى را مى‌خواند كه تا روز قيامت هم او را پاسخ نخواهد داد و آنها از دعايشان بى‌خبرند"
          ],
          "fa.fooladvand": [
            "و كيست گمراه‌تر از آن كس كه به جاى خدا كسى را مى‌خواند كه تا روز قيامت او را پاسخ نمى‌دهد، و آنها از دعايشان بى‌خبرند؟"
          ],
          "fa.ghomshei": [
            "و کیست گمراه‌تر از آن که جز خدا کسی را بپرستد که هیچ در حوائج تا قیامت او را اجابت نکند و از هر چه بخوانندشان خود بی خبر باشند؟"
          ],
          "fa.khorramdel": [
            "چه کسی گمراه‌تر از کسی است که افرادی را به فریاد بخواند و پرستش کند که (اگر) تا روز قیامت (هم ایشان را به فریاد بخواند و پرستش کند) پاسخش نمی‌گویند؟ (نه تنها پاسخش را نمی‌دهند، بلکه سخنانش را هم نمی‌شنوند) و اصلاً آنان از پرستشگران و به فریادخواهندگان غافل و بی‌خبرند. [[«یَدْعُو»: به فریاد بخواند. عبادت کند. الف زائدی در رسم‌الخطّ قرآنی دارد (نگا: حجّ / 12، نحل / 20، اسراء / 57). «دُعَآءِ»: به فریاد خواستن. عبادت کردن (نگا: فاطر / 13 و 14).]]"
          ],
          "fa.khorramshahi": [
            "و کیست گمراه‌تر از کسی که موجودی را به دعا خواند که تا روز قیامت پاسخش را ندهد، و ایشان از دعای آنان بی‌خبرند"
          ],
          "fa.makarem": [
            "چه کسی گمراهتر است از آن کس که معبودی غیر خدا را می‌خواند که تا قیامت هم به او پاسخ نمی‌گوید و از خواندن آنها (کاملا) ً بی‌خبر است؟! (و صدای آنها را هیچ نمی‌شنود!)"
          ],
          "fa.moezzi": [
            "و کیست گمراه‌تر از آنکه خواند جز خدا آن را که نپذیرد برایش تا روز رستاخیز و ایشانند از خواندن آنان ناآگاهان‌"
          ],
          "fa.mojtabavi": [
            "و كيست گمراه‌تر از كسى كه به جاى خدا كسى- يا چيزى- را مى‌خواند كه تا روز رستاخيز او را پاسخ نمى‌دهد و آنها از خواندن اينان بى‌خبرند؟"
          ],
          "fa.sadeqi": [
            "و چه کسی گمراه‌تر از کسی است، که جز خدا را می‌خواند؛ کسی را که تا روز قیامت (به آنان) پاسخ نمی‌دهد، حال آنکه آنان (هم) از درخواست اینان غافلانند؟"
          ]
        }
      },
      {
        "index": 4516,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:46:6",
        "text": [
          "وَ إِذَا حُشِرَ النَّاسُ‌ کَانُوا لَهُمْ‌ أَعْدَاءً وَ کَانُوا بِعِبَادَتِهِمْ‌ کَافِرِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "When all men are gathered together (on that Day) they will become their enemies and deny their worship."
          ],
          "en.ahmedraza": [
            "And on the day when people are gathered, they will become their enemies, and will reject their worshippers. (The idols will give testimony against the polytheists.)"
          ],
          "en.arberry": [
            "and when mankind are mustered, shall be enemies to them, and shall deny their service."
          ],
          "en.daryabadi": [
            "And when mankind will be gathered they will become Unto them enemies and of their worship they will become deniers."
          ],
          "en.hilali": [
            "And when mankind are gathered (on the Day of Resurrection), they (false deities) will become enemies for them and will deny their worshipping."
          ],
          "en.itani": [
            "And when humanity is gathered, they will be enemies to them, and will renounce their worship of them."
          ],
          "en.maududi": [
            "When all human beings will be gathered together those who had been called upon will become the enemies to their votaries and will disown their worship."
          ],
          "en.mubarakpuri": [
            "And when mankind are gathered, they (false deities) will become their enemies and will deny their worship."
          ],
          "en.pickthall": [
            "And when mankind are gathered (to the Judgment) will become enemies for them, and will become deniers of having been worshipped."
          ],
          "en.qarai": [
            "When mankind are mustered [on Judgement’s Day] they will be their enemies, and they will disavow their worship."
          ],
          "en.qaribullah": [
            "And, when mankind are gathered, those will become their enemies and disown their worship."
          ],
          "en.sahih": [
            "And when the people are gathered [that Day], they [who were invoked] will be enemies to them, and they will be deniers of their worship."
          ],
          "en.sarwar": [
            "When people will be resurrected, such gods will become their enemies and will reject their worship."
          ],
          "en.shakir": [
            "And when men are gathered together they shall be their enemies, and shall be deniers of their worshipping (them)."
          ],
          "en.transliteration": [
            "Wai<u>tha</u> <u>h</u>ushira a<b>l</b>nn<u>a</u>su k<u>a</u>noo lahum aAAd<u>a</u>an wak<u>a</u>noo biAAib<u>a</u>datihim k<u>a</u>fireen<b>a</b>"
          ],
          "en.wahiduddin": [
            "and when mankind are gathered together, they will become their enemies, and will deny their worship?"
          ],
          "en.yusufali": [
            "And when mankind are gathered together (at the Resurrection), they will be hostile to them and reject their worship (altogether)!"
          ],
          "fa.ansarian": [
            "و هنگامی که مردم را [در قیامت] گرد آورند [معبودانشان] با آنان دشمن باشند و پرستش آنان را انکار کنند،"
          ],
          "fa.ayati": [
            "و چون در قيامت مردم را گردآرند، بتان با پرستندگان خويش دشمن باشند و عبادتشان را انكار كنند."
          ],
          "fa.bahrampour": [
            "و زمانى كه مردم محشور گردند، [اين معبودان‌] دشمنان آنها شوند و عبادتشان را انكار كنند"
          ],
          "fa.fooladvand": [
            "و چون مردم محشور گردند، دشمنان آنان باشند و به عبادتشان انكار ورزند."
          ],
          "fa.ghomshei": [
            "و چون در قیامت خلق محشور شوند آنجا معبودان باطل با مشرکان دشمن و از پرستش آنها بیزارند."
          ],
          "fa.khorramdel": [
            "و زمانی که مردمان (در قیامت) گرد آورده می‌شوند، چنین پرستش‌شدگان و به فریاد خواسته‌شدگانی، دشمنان پرستشگران و به فریاد خواهندگان می‌گردند (و از ایشان بیزاری می‌جویند) و عبادت ایشان را نفی می‌کنند و نمی‌پذیرند. [[«عِبَادَةِ»: پرستش (نگا: مریم / 92). دعا. اگر (دَعَآءِ) آیه قبلی در این آیه، به صورت (عِبَادَةِ) آمده است، بدین علّت است که دعا از زمره مهمّترین عبادات است. چرا که رسول خدا فرموده است: أَلدُّعَآءُ مُخُّ الْعِبَادَةِ. «دعا مغز عبادت است». «کَافِرِینَ»: انکارکنندگان. مراد بیزاری جویندگان است (نگا: قصص / 63). می‌گویند: ما بدیشان اجازه چنین کاری را نداده‌ایم و از پرستش و به فریاد خواستن آنان اطّلاعی نداشته‌ایم (نگا: مائده / 116 و 117).]]"
          ],
          "fa.khorramshahi": [
            "و چون مردم گرد آورده شوند، [آن معبودان باطل‌] دشمنان ایشان باشند، و عبادتشان را منکر شوند"
          ],
          "fa.makarem": [
            "و هنگامی که مردم محشور می‌شوند، معبودهای آنها دشمنانشان خواهند بود؛ حتّی عبادت آنها را انکار می‌کنند!"
          ],
          "fa.moezzi": [
            "و گاهی که گردآورده شوند مردم باشند ایشان را دشمنانی و باشند به پرستش ایشان کافران‌"
          ],
          "fa.mojtabavi": [
            "و چون مردم [در رستاخيز] برانگيخته و فراهم شوند، [پرستيدگان‌] دشمن آنان- پرستندگان- باشند و پرستش ايشان را انكار كنند."
          ],
          "fa.sadeqi": [
            "و هنگامی که مردمان (در آن هنگامه) گرد هم شوند (اینان) دشمنان آنانند و عبادتشان را انکار می‌کنند."
          ]
        }
      },
      {
        "index": 4517,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:46:7",
        "text": [
          "وَ إِذَا تُتْلَى‌ عَلَيْهِمْ‌ آيَاتُنَا بَيِّنَاتٍ‌ قَالَ‌ الَّذِينَ‌ کَفَرُوا لِلْحَقِ‌ لَمَّا جَاءَهُمْ‌ هٰذَا سِحْرٌ مُبِينٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "When Our clear revelations are read out to them, the infidels say of the truth, when it has come to them: \"This is pure magic.\""
          ],
          "en.ahmedraza": [
            "And when Our clear verses are recited to them, the disbelievers say regarding the Truth that has come to them, “This is an obvious magic!”"
          ],
          "en.arberry": [
            "And when Our signs are recited to them, clear signs, the unbelievers say to the truth when it has come to them, 'This is manifest sorcery.'"
          ],
          "en.daryabadi": [
            "And when Our manifest revelations are rehearsed Unto them those who disbelieve say of the truth when it hath come to them: this is magic manifest."
          ],
          "en.hilali": [
            "And when Our Clear Verses are recited to them, the disbelievers say of the truth (this Quran), when it reaches them: \"This is plain magic!\""
          ],
          "en.itani": [
            "When Our revelations are recited to them, plain and clear, those who disbelieve say of the truth when it has come to them, “This is obviously magic.”"
          ],
          "en.maududi": [
            "When Our Clear Messages are rehearsed to them, the unbelievers exclaim about the Truth when it came to them: “This is plain sorcery.”"
          ],
          "en.mubarakpuri": [
            "And when Our Clear Ayat are recited to them, the disbelievers say of the truth when it reaches them: \"This is plain magic!\""
          ],
          "en.pickthall": [
            "And when Our clear revelations are recited unto them, those who disbelieve say of the Truth when it reacheth them: This is mere magic."
          ],
          "en.qarai": [
            "When Our manifest signs are recited to them, the faithless say of the truth when it comes to them: ‘This is plain magic.’"
          ],
          "en.qaribullah": [
            "When Our clear verses are recited to them, the unbelievers say of the truth that came to them: 'This is clear sorcery'"
          ],
          "en.sahih": [
            "And when Our verses are recited to them as clear evidences, those who disbelieve say of the truth when it has come to them, \"This is obvious magic.\""
          ],
          "en.sarwar": [
            "When Our enlightening revelations are recited to them, the disbelievers, of the truth which has come to them, say, \"This is plain magic\"."
          ],
          "en.shakir": [
            "And when Our clear communications are recited to them, those who disbelieve say with regard to the truth when it comes to them: This is clear magic."
          ],
          "en.transliteration": [
            "Wai<u>tha</u> tutl<u>a</u> AAalayhim <u>a</u>y<u>a</u>tun<u>a</u> bayyin<u>a</u>tin q<u>a</u>la alla<u>th</u>eena kafaroo lil<u>h</u>aqqi lamm<u>a</u> j<u>a</u>ahum h<u>atha</u> si<u>h</u>run mubeen<b>un</b>"
          ],
          "en.wahiduddin": [
            "And whenever Our clear revelations are recited to them and the Truth is brought to them, those who deny the truth say, \"This is plain magic.\""
          ],
          "en.yusufali": [
            "When Our Clear Signs are rehearsed to them, the Unbelievers say, of the Truth when it comes to them: \"This is evident sorcery!\""
          ],
          "fa.ansarian": [
            "و چون آیات روشن ما را بر آنان بخوانند، کافران درباره حقّی که به سویشان آمده می گویند: این جادویی آشکار است."
          ],
          "fa.ayati": [
            "چون آيات ما به روشنى بر آنان خوانده شود، كافران حقيقتى را كه بر ايشان نازل شده است، گويند: جادويى آشكار است."
          ],
          "fa.bahrampour": [
            "و چون آيات روشن ما بر ايشان تلاوت شود، منكران حق، وقتى حق به سويشان آيد، گويند: اين سحرى آشكار است"
          ],
          "fa.fooladvand": [
            "و چون آيات روشن ما بر ايشان خوانده شود، آنان كه چون حقيقت به سويشان آمد منكر آن شدند، گفتند: «اين سحرى آشكار است.»"
          ],
          "fa.ghomshei": [
            "و هر گاه آیات روشن ما را بر مردم تلاوت کنند آنان که کافر شدند چون آیات الهی آمد گویند که این کتاب سحر آشکارایی است."
          ],
          "fa.khorramdel": [
            "هنگامی که آیه‌های روشن ما بر آنان خوانده می‌شود، کافران به محض این که حق و حقیقت بدیشان می‌رسد فوراً درباره‌ی آن می‌گویند: این جادوی آشکاری است. [[«بَیِّنَاتٍ»: روشن و آشکار. حال (آیات) است. «الْحَقِّ»: مراد آیات قرآن است. «لَمَّا جَآءَهُمْ»: زمانی که بدیشان می‌رسد. این بخش می‌رساند که کافران به محض شنیدن آیات، بدون هیچ گونه تدبّر و تفکّری، به آن نسبت سحر و جادو داده‌اند. «لِلْحَقِّ»: حرف لام به معنی (عَنْ) است.]]"
          ],
          "fa.khorramshahi": [
            "و چون آیات روشنگر ما بر آنان خوانده شود، کافران درباره حق چون فراز آیدشان گویند، این جادوی آشکار است‌"
          ],
          "fa.makarem": [
            "هنگامی که آیات روشن ما بر آنان خوانده می‌شود، کافران در برابر حقّی که برای آنها آمده می‌گویند: «این سحری آشکار است!»"
          ],
          "fa.moezzi": [
            "و گاهی که خوانده شود بر ایشان آیتهای ما روشن گویند آنان که کفر ورزیدند به حقّ گاهی که بیامدشان این است جادوئی آشکار"
          ],
          "fa.mojtabavi": [
            "و چون آيات روشن ما بر آنان خوانده شود، كافران [سخن‌] حق- قرآن- را آنگاه كه بديشان آيد، گويند: اين جادويى است آشكار."
          ],
          "fa.sadeqi": [
            "و زمانی که آیاتمان به روشنی بر ایشان خوانده شود، آنان که کفر ورزیدند - هنگامی که حق سویشان آمد - گویند: «این سحری آشکارگر است.»"
          ]
        }
      },
      {
        "index": 4518,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:46:8",
        "text": [
          "أَمْ‌ يَقُولُونَ‌ افْتَرَاهُ‌ قُلْ‌ إِنِ‌ افْتَرَيْتُهُ‌ فَلاَ تَمْلِکُونَ‌ لِي‌ مِنَ‌ اللَّهِ‌ شَيْئاً هُوَ أَعْلَمُ‌ بِمَا تُفِيضُونَ‌ فِيهِ‌ کَفَى‌ بِهِ‌ شَهِيداً بَيْنِي‌ وَ بَيْنَکُمْ‌ وَ هُوَ الْغَفُورُ الرَّحِيمُ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Do they say: \"He has fabricated it?\" Tell them: \"If I have fabricated it, you have no power to save me from God. He knows what you are busy with concerning this. He is sufficient as witness between you and me; yet He is forgiving, ever-merciful.\""
          ],
          "en.ahmedraza": [
            "What! They dare say, “He has fabricated it”? Say (O dear Prophet Mohammed – peace and blessings be upon him), “If I have fabricated it, then (I know that) you have no power to support me against Allah; He well knows the matters you are involved in; He is Sufficient as a Witness between me and you; and He only is the Oft Forgiving, the Most Merciful.”"
          ],
          "en.arberry": [
            "Or do they say, 'He has forged it'? Say: 'If I have forged it, you have no power to help me against God. He knows very well what you are pressing upon; He suffices as a witness between me and you; He is the All-forgiving, the All-compassionate.'"
          ],
          "en.daryabadi": [
            "Say they: he hath fabricated it. Say thou: if I have fabricated it, then ye cannot avail me against Allah in aught. He is the Knower of that which ye utter thereof; He sufficeth as a witness between me and you; and He is Forgiving, Merciful."
          ],
          "en.hilali": [
            "Or say they: \"He (Muhammad SAW) has fabricated it.\" Say: \"If I have fabricated it, still you have no power to support me against Allah. He knows best of what you say among yourselves concerning it (i.e. this Quran)! Sufficient is He for a witness between me and you! And He is the Oft-Forgiving, the Most Merciful.\""
          ],
          "en.itani": [
            "Or do they say, “He invented it himself”? Say, “If I invented it myself, there is nothing you can do to protect me from God. He knows well what you are engaged in. He is sufficient witness between me and you. He is the Forgiver, the Merciful.”"
          ],
          "en.maududi": [
            "Do they claim that the Messenger himself has fabricated it? (If so), tell them: “If I have fabricated it, then you have no power to protect me from Allah's chastisement. He knows well the idle talk in which you indulge. He suffices as a witness between me and you. He is Most Forgiving, Most Merciful.”"
          ],
          "en.mubarakpuri": [
            "Or say they: \"He has fabricated it.\" Say: \"If I have fabricated it, still you have no power to support me against Allah. He knows best of what you say among yourselves concerning it! Sufficient is He as a witness between me and you! And He is the Oft--Forgiving, the Most Merciful.\""
          ],
          "en.pickthall": [
            "Or say they: He hath invented it? Say (O Muhammad): If I have invented it, still ye have no power to support me against Allah. He is Best Aware of what ye say among yourselves concerning it. He sufficeth for a witness between me and you. And He is the Forgiving, the Merciful."
          ],
          "en.qarai": [
            "Or they say, ‘He has fabricated it.’ Say, ‘Should I have fabricated it, you would not avail me anything against Allah. He best knows what you gossip concerning it. He suffices as a witness between me and you, and He is the All-forgiving, the All-merciful.’"
          ],
          "en.qaribullah": [
            "Or, do they say: 'He has forged it' Say: 'If I have forged it, then you have no power to help me against Allah, He knows what you say. It is sufficient that Heis the Witness between me and you. He is the Forgiving, the Most Merciful'"
          ],
          "en.sahih": [
            "Or do they say, \"He has invented it?\" Say, \"If I have invented it, you will not possess for me [the power of protection] from Allah at all. He is most knowing of that in which you are involved. Sufficient is He as Witness between me and you, and He is the Forgiving the Merciful.\""
          ],
          "en.sarwar": [
            "They say, \"(Muhammad) has invented it (Quran) by himself.\" Say, \"Had I invented it, you would not have been able to rescue me from God. He knows best what you say about it. He is our witness and He is All-forgiving and All-merciful\"."
          ],
          "en.shakir": [
            "Nay! they say: He has forged it. Say: If I have forged it, you do not control anything for me from Allah; He knows best what you utter concerning it; He is enough as a witness between me and you, and He is the Forgiving, the Merciful."
          ],
          "en.transliteration": [
            "Am yaqooloona iftar<u>a</u>hu qul ini iftaraytuhu fal<u>a</u> tamlikoona lee mina All<u>a</u>hi shayan huwa aAAlamu bim<u>a</u> tufee<u>d</u>oona feehi kaf<u>a</u> bihi shaheedan baynee wabaynakum wahuwa alghafooru a<b>l</b>rra<u>h</u>eem<b>u</b>"
          ],
          "en.wahiduddin": [
            "Do they mean to say that the Messenger himself has fabricated it? Say [O Muhammad], \"If I have fabricated it myself, you will not be able to do anything to save me from God. He knows quite well what talk you indulge in. He is enough as a witness between me and you; and He is the Forgiving, the Merciful One.\""
          ],
          "en.yusufali": [
            "Or do they say, \"He has forged it\"? Say: \"Had I forged it, then can ye obtain no single (blessing) for me from Allah. He knows best of that whereof ye talk (so glibly)! Enough is He for a witness between me and you! And he is Oft-Forgiving, Most Merciful.\""
          ],
          "fa.ansarian": [
            "بلکه می گویند: این قرآن را از نزد خود ساخته و به خدا نسبت داده است. بگو: اگر آن را از نزد خود ساخته و به خدا نسبت داده باشم [و خدا بخواهد برای این کار مرا به عذابی سخت گرفتار کند] شما نمی توانید برای من چیزی از عذاب خدا را دفع کنید، خدا به باطلی که در آن فرو می روید [و آن طعنه زدن به قرآن و جادو خواندن آن است] داناتر است، و کافی است که خدا میان من و شما گواه باشد، و او بسیار آمرزنده و مهربان است."
          ],
          "fa.ayati": [
            "يا مى‌گويند: اين كتاب، دروغى است كه خود بافته است. بگو: اگر من آن را چون دروغى به هم بافته باشم، شما نمى‌توانيد خشم خدا را از من بازداريد. خدا از آن طعنها كه بدان مى‌زنيد آگاه‌تر است. و شهادت او ميان من و شما كافى است. و اوست آمرزنده مهربان."
          ],
          "fa.bahrampour": [
            "آيا مى‌گويند: اين [كتاب‌] را به دروغ بافته است؟ بگو: اگر آن را بافته باشم [بايد مجازات شوم و] شما نمى‌توانيد خشم خدا را از من بازداريد. او به آنچه [با طعنه‌] به آن مى‌پردازيد [و جادويش مى‌خوانيد] آگاه‌تر است، و شهادت او ميان من و شما كافى است و اوست آ"
          ],
          "fa.fooladvand": [
            "يا مى‌گويند: «اين [كتاب‌] را بربافته است.» بگو: «اگر آن را بربافته باشم؛ در برابر خدا اختيار چيزى براى من نداريد. او آگاه‌تر است به آنچه [با طعنه‌] در آن فرو مى‌رويد. گواه بودن او ميان من و شما بس است، و اوست آمرزنده مهربان.»"
          ],
          "fa.ghomshei": [
            "بلکه کافران می‌گویند که (محمّد) خود این آیات قرآن را فرا بافته است. بگو: اگر این قرآن را من از خود بافته باشم شما از قهر خدا هیچ قدرت بر نجات من ندارید، او به افکاری که در آن فرو می‌روید داناتر است، گواه میان من و شما هم او کافی است و اوست خدای بسیار آمرزنده و مهربان."
          ],
          "fa.khorramdel": [
            "آیا آنان می‌گویند که: (محمّد) قرآن را از پیش خود ساخته است (و به دروغ آن را به خدا نسبت داده است؟ بدیشان) بگو: اگر من قرآن را از پیش خود ساخته باشم و آن را به دروغ به خدا نسبت داده باشم، (قطعاً خدا مرا به مجازات می‌رساند و) شما نمی‌توانید کمترین کاری در برابر خدا برایم بکنید (و مرا از عقاب و عذاب او برهانید. پس چگونه من چنین کاری را می‌کنم و بدین وسیله خویشتن را برای شما در معرض عذاب الهی قرار می‌دهم؟!). خداوند از هر کس دیگری بهتر می‌داند که به چه سخنانی (برای رخنه گرفتن از قرآن) فرو می‌روید (و گاهی آن را شعر، و گاهی سحر، و زمانی ساخته و بافته‌ی بشر می‌نامید، و بدان نسبتهای ناروای دیگری می‌دهید). همین بس که خداوند میان من و شما گواه باشد. (خدا صدق دعوت و تلاش در ابلاغ رسالت مرا می‌داند، و کارشکنیها و دروغ‌پردازیهای شما را نیز می‌بیند، و همین برای من و شما کافی است. از این کارها دست بکشید و به سوی خدا برگردید. خدا توبه‌کاران را می‌بخشد، و آنان را مشمول رحمت واسعه‌ی خود می‌سازد. چرا که) او بسیار بخشاینده و مهربان است. [[«أَمْ»: بلکه. آیا. «إِفْتَرَاهُ»: (نگا: یونس / 38، هود / 13 و 35). «مَا تُفِیضُونَ فِیهِ»: واژه (مَا) ممکن است موصوله بوده و به معنی نسبتهای ناروائی باشد که به پیغمبر می‌دادند. در این صورت ضمیر (ه) به (ما) برمی‌گردد. و ممکن است مصدریّه باشد، در این صورت ضمیر (ه) به قرآن یا حق برمی‌گردد، و (تُفِیضُونَ) به معنی ورود در کاری به قصد افساد است. «تُفِیضُونَ»: در آن فرو می‌روید (نگا: یونس / 61). «شَهِیداً»: گواه. مطّلع (نگا: فصّلت / 53).]]"
          ],
          "fa.khorramshahi": [
            "یا گویند آن را بر ساخته است بگو اگر آن را برساخته باشم، در برابر خداوند چیزی به سود من ندارید، او به آنچه به آن می‌پردازید آگاه‌تر است، خداوند در میان من و شما گواه بس، و او آمرزگار مهربان است‌"
          ],
          "fa.makarem": [
            "بلکه می‌گویند: «این آیات را بر خدا افترا بسته است!» بگو: «اگر من آن را بدروغ به خدا نسبت داده باشم (لازم است مرا رسوا کند و) شما نمی‌توانید در برابر خداوند از من دفاع کنید! او کارهایی را که شما در آن وارد می‌شوید بهتر می‌داند؛ همین بس که خداوند گواه میان من و شما باشد؛ و او آمرزنده و مهربان است!»"
          ],
          "fa.moezzi": [
            "یا گویند به دروغش آوردی بگو اگر دروغش آرم دارا نباشید برای من از خدا چیزی را او داناتر است بدانچه فروروید در آن بس است او گواهی میان من و شما و او است آمرزگار مهربان‌"
          ],
          "fa.mojtabavi": [
            "بلكه مى‌گويند كه آن"
          ],
          "fa.sadeqi": [
            "یا می‌گویند: «این (کتاب) را (بر خدا) افترا زده است.‌» بگو: «اگر آن را افترا زده‌ام‌، پس شما از (سوی) خدا برایم مالک چیزی نیستید. او آگاه‌تر است به آنچه در آن (افترا) پر و لبریز (از باطل) می‌کنید. گواهی او میان من و شما بس است، و اوست بسی پوشنده‌ی رحمتگر بر ویژگان.»"
          ]
        }
      },
      {
        "index": 4519,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:46:9",
        "text": [
          "قُلْ‌ مَا کُنْتُ‌ بِدْعاً مِنَ‌ الرُّسُلِ‌ وَ مَا أَدْرِي‌ مَا يُفْعَلُ‌ بِي‌ وَ لاَ بِکُمْ‌ إِنْ‌ أَتَّبِعُ‌ إِلاَّ مَا يُوحَى‌ إِلَيَ‌ وَ مَا أَنَا إِلاَّ نَذِيرٌ مُبِينٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"I am not a new Messenger to come, nor do I know what is to be done to me or you. I only follow what is revealed to me. My duty is only to warn you clearly.\""
          ],
          "en.ahmedraza": [
            "Say, “I am not something new* among the Noble Messengers, nor do I know (on my own) what will happen to me** or with you; I only follow that which is divinely revealed to me, and I am purely a Herald of clear warning. (* I am like the earlier ones. ** My knowledge comes due to divine revelations.)"
          ],
          "en.arberry": [
            "Say: 'I am not an innovation among the Messengers, and I know not what shall be done with me or with you. I only follow what is revealed to me; I am only a clear warner.'"
          ],
          "en.daryabadi": [
            "Say thou: I am not an innovator among the apostles, nor I know whatsoever shall be done with me or with you; I only follow that which is revealed Unto me, and am but a warner manifest."
          ],
          "en.hilali": [
            "Say (O Muhammad SAW):\"I am not a new thing among the Messengers (of Allah) (i.e. I am not the first Messenger) nor do I know what will be done with me or with you. I only follow that which is revealed to me, and I am but a plain warner.\""
          ],
          "en.itani": [
            "Say, “I am not different from the other messengers; and I do not know what will be done with me, or with you. I only follow what is inspired in me, and I am only a clear warner.”"
          ],
          "en.maududi": [
            "Tell them: “I am not the first of the Messengers; and I do not know what shall be done with me or with you. I follow only what is revealed to me, and I am nothing but a plain warner.”"
          ],
          "en.mubarakpuri": [
            "Say: \"I am not a new thing among the Messengers, nor do I know what will be done with me or you. I only follow that which is revealed to me, and I am but a plain warner.\""
          ],
          "en.pickthall": [
            "Say: I am no new thing among the messengers (of Allah), nor know I what will be done with me or with you. I do but follow that which is inspired in me, and I am but a plain warner."
          ],
          "en.qarai": [
            "Say, ‘I am not a novelty among the apostles, nor do I know what will be done with me, or with you. I just follow whatever is revealed to me, and I am just a manifest warner.’"
          ],
          "en.qaribullah": [
            "Say: 'I am not an innovation among the Messengers; nor know what will be done with me or you. I follow only what is revealed to me; I am only a clearwarner'"
          ],
          "en.sahih": [
            "Say, \"I am not something original among the messengers, nor do I know what will be done with me or with you. I only follow that which is revealed to me, and I am not but a clear warner.\""
          ],
          "en.sarwar": [
            "Say, \"I am not the first Messenger. I do not know what will be done to me or to you. I follow only what has been revealed to me and my duty is only to give clear warning\"."
          ],
          "en.shakir": [
            "Say: I am not the first of the apostles, and I do not know what will be done with me or with you: I do not follow anything but that which is revealed to me, and I am nothing but a plain warner."
          ],
          "en.transliteration": [
            "Qul m<u>a</u> kuntu bidAAan mina a<b>l</b>rrusuli wam<u>a</u> adree m<u>a</u> yufAAalu bee wal<u>a</u> bikum in attabiAAu ill<u>a</u> m<u>a</u> yoo<u>ha</u> ilayya wam<u>a</u> an<u>a</u> ill<u>a</u> na<u>th</u>eerun mubeen<b>un</b>"
          ],
          "en.wahiduddin": [
            "Say, \"I am not the first of God's messengers, and I do not know what will be done with me or with you: I do not follow anything but what is revealed to me, and I am merely a plain warner.\""
          ],
          "en.yusufali": [
            "Say: \"I am no bringer of new-fangled doctrine among the messengers, nor do I know what will be done with me or with you. I follow but that which is revealed to me by inspiration; I am but a Warner open and clear.\""
          ],
          "fa.ansarian": [
            "بگو: از میان فرستادگان خدا فرستاده ای نوظهور نیستم [که گفتار و کردارم مخالف گفتار و کردار آنان باشد، بلکه به من هم چون آنان وحی می شود] و نمی دانم با من و شما [در دنیا و آخرت] چه خواهد شد، من فقط از آنچه به من وحی شده پیروی می کنم، و من جز بیم دهنده ای آشکار نیستم."
          ],
          "fa.ayati": [
            "بگو: من از ميان ديگر پيامبران بدعتى تازه نيستم و نمى‌دانم كه بر من، يا بر شما چه خواهد رفت. من از چيزى جز آنچه به من وحى مى‌شود، پيروى نمى‌كنم و من جز بيم‌دهنده‌اى آشكار نيستم."
          ],
          "fa.bahrampour": [
            "بگو: من از [ميان‌] پيامبران، پيامبر نوظهورى نيستم، و نمى‌دانم با من و شما چه معامله‌اى خواهد شد. جز آنچه را كه به من وحى مى‌شود پيروى نمى‌كنم، و من جز هشدار دهنده‌اى آشكار نيستم"
          ],
          "fa.fooladvand": [
            "بگو: «من از [ميان‌] پيامبران، نودرآمدى نبودم و نمى‌دانم با من و با شما چه معامله‌اى خواهد شد. جز آنچه را كه به من وحى مى‌شود، پيروى نمى‌كنم؛ و من جز هشداردهنده‌اى آشكار [بيش‌] نيستم.»"
          ],
          "fa.ghomshei": [
            "بگو: من از بین رسولان، اولین پیغمبر نیستم (که تازه در جهان آوازه رسالت بلند کرده باشم تا تعجب و انکار کنید) و نمی‌دانم که با من و شما عاقبت چه می‌کنند؟ من جز آنچه بر من وحی می‌شود پیروی نمی‌کنم و جز آنکه با بیان روشن (خلق را آگاه کنم و از خدا) بترسانم وظیفه‌ای ندارم."
          ],
          "fa.khorramdel": [
            "بگو: من نوبرِ پیغمبران و نخستین فرد ایشان نیستم (و چیزی را با خود نیاورده‌ام که کسی پیش از من آن را نیاورده باشد. بلکه پیغمبران بیشماری پیش از من آمده‌اند و توحید و مکارم اخلاق را به انسانها رسانده‌اند و من آخرین فرد آنان و ادامه‌دهنده‌ی خطّ سیر ایشانم) و نمی‌دانم (در دنیا) خداوند با من چه می‌کند، و با شما چه خواهد کرد. (آیا سرنوشت من و شما در همین دنیا چگونه خواهد بود؟ زندگی چگونه خواهد گذشت؟ من پیش از شما و یا شما پیش از من می‌میرید؟ من ایمان آوردن همه شما و یا اکثر شما را می‌بینم و یا نمی‌بینم؟ لحظه‌ها و روزها و هفته‌ها و ماهها و سالهای آینده غیب است و من غیب نمی‌دانم). من جز از چیزی که به من وحی می‌شود پیروی نمی‌کنم، و من جز بیم‌دهنده‌ی آشکاری نیستم. [[«بِدْعاً»: نوبر. نوظهور. نخستین چیزی که پیش از آن چنین چیزی دیده نشده باشد. «بِدْعاً مِّنَ الرُّسُلِ»: نوبر و نخستین فرد پیغمبران. «مَآ أَدْرِی مَا یُفْعَلُ بِی وَ لا بِکُمْ»: این بخش از آیه بیانگر بشریّت پیغمبر است، و او بنده‌ای از بندگان است و غیب نمی‌داند، و مالک نفع و ضرری برای خود و برای دیگران نمی‌باشد جز بدان اندازه که خدا بخواهد (نگا: انعام / 50، اعراف / 188، هود / 31، نمل / 65). «نَذیرٌ مُبینٌ»: (نگا: اعراف / 184، حجر / 89، حجّ / 49).]]"
          ],
          "fa.khorramshahi": [
            "بگو [من‌] پدیده‌ای نو ظهور در میان پیامبران نیستم، و نمی‌دانم بر من و بر شما چه خواهد رفت، جز از وحیی که به من می‌شود، از چیزی پیروی نمی‌کنم، و من جز هشداردهنده‌ای آشکار نیستم‌"
          ],
          "fa.makarem": [
            "بگو: «من پیامبر نوظهوری نیستم؛ و نمی‌دانم با من و شما چه خواهد شد؛ من تنها از آنچه بر من وحی می‌شود پیروی می‌کنم، و جز بیم‌دهنده آشکاری نیستم!»"
          ],
          "fa.moezzi": [
            "بگو نیستم من نوظهوری (تازه درآمدی) از پیغمبران و ندانم چه کرده می‌شود به من و نه به شما پیروی نکنم جز آنچه را وحی شود بسویم و نیستم من جز ترساننده آشکار"
          ],
          "fa.mojtabavi": [
            "بگو: من نوآمده‌اى از پيامبران نيستم- نخستين پيامبرى نيستم كه مبعوث شده‌ام پيش از من پيامبران بوده‌اند-، و نمى‌دانم كه با من و با شما چه خواهند كرد. پيروى نمى‌كنم مگر آنچه را كه به من وحى مى‌شود، و من جز بيم‌دهنده‌اى آشكار نيستم."
          ],
          "fa.sadeqi": [
            "بگو: «من از (میان) پیامبران، نودرآمدی (بی‌مانند) نبوده‌ام و نمی‌دانم با من و با شما چه معامله‌ای خواهد شد (و) جز آنچه را که به من وحی می‌شود، پیروی نمی‌کنم‌؛ و من جز هشداردهنده‌ای روشنگر (بیش) نیستم.»"
          ]
        }
      },
      {
        "index": 4520,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:46:10",
        "text": [
          "قُلْ‌ أَ رَأَيْتُمْ‌ إِنْ‌ کَانَ‌ مِنْ‌ عِنْدِ اللَّهِ‌ وَ کَفَرْتُمْ‌ بِهِ‌ وَ شَهِدَ شَاهِدٌ مِنْ‌ بَنِي‌ إِسْرَائِيلَ‌ عَلَى‌ مِثْلِهِ‌ فَآمَنَ‌ وَ اسْتَکْبَرْتُمْ‌ إِنَ‌ اللَّهَ‌ لاَ يَهْدِي‌ الْقَوْمَ‌ الظَّالِمِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Tell them: \"Think (of the consequence) if this is from God and you deny it when a witness from the people of Israel had testified to the like of it and come to believe, while you spurn it?\" Assuredly God does not guide a wicked people."
          ],
          "en.ahmedraza": [
            "Say, “What is your opinion – if the Qur’an is from Allah and you have rejected faith in it, and a witness among the Descendants of Israel has already testified upon this and accepted faith, while you became arrogant? Indeed Allah does not guide the unjust.”"
          ],
          "en.arberry": [
            "Say: 'Have you considered? If it be from God, and you disbelieve in it, and a witness from among the Children of Israel hears witness to its like, and believes, and you wax proud, God guides not the people of the evildoers."
          ],
          "en.daryabadi": [
            "Say thou: bethink ye: if it is from Allah while ye disbelieve therein and a witness from the Children of Isra'il beareth witness to the like thereof and believeth, while ye are still stiff necked, then who is further astray than you? Verily Allah guideth not a wrong-doing people."
          ],
          "en.hilali": [
            "Say: \"Tell me! If this (Quran) is from Allah, and you deny it, and a witness from among the Children of Israel ('Abdullah bin Salam) testifies that this Quran is from Allah [like the Taurat (Torah)], so he believed (embraced Islam) while you are too proud (to believe).\" Verily! Allah guides not the people who are Zalimun (polytheists, disbelievers and wrong-doing)."
          ],
          "en.itani": [
            "Say, “Have you considered? What if it is from God and you disbelieve in it? A witness from the Children of Israel testified to its like, and has believed, while you turned arrogant. God does not guide the unjust people.”"
          ],
          "en.maududi": [
            "Tell them, (O Prophet): “Did you consider (what would be your end) if this Qur'an were indeed from Allah and yet you rejected it? And this even though a witness from the Children of Israel has testified to the like of it. But he believed, while you waxed arrogant. Verily Allah does not guide such wrong-doers to the Right Way."
          ],
          "en.mubarakpuri": [
            "Say: \"Tell me! If it was from Allah and you disbelieved it, (at the same time), a witness from among the Children of Israel has testified to something similar and believed while you rejected (the truth)!\" Verily, Allah does not guide the wrongdoing people."
          ],
          "en.pickthall": [
            "Bethink you: If it is from Allah and ye disbelieve therein, and a witness of the Children of Israel hath already testified to the like thereof and hath believed, and ye are too proud (what plight is yours)? Lo! Allah guideth not wrong-doing folk."
          ],
          "en.qarai": [
            "Say, ‘Tell me, if it is from Allah and you disbelieve in it, and a witness from the Children of Israel has testified to its like and believed [in it], while you are disdainful [of it]?’ Indeed Allah does not guide the wrongdoing lot."
          ],
          "en.qaribullah": [
            "Say: 'Consider, if this (Koran) is from Allah and you disbelieve in it, and a witness from the Children of Israel testifies to its like and believes, while you areproud! Indeed, Allah does not guide the harmdoers'"
          ],
          "en.sahih": [
            "Say, \"Have you considered: if the Qur'an was from Allah, and you disbelieved in it while a witness from the Children of Israel has testified to something similar and believed while you were arrogant...?\" Indeed, Allah does not guide the wrongdoing people."
          ],
          "en.sarwar": [
            "Say, \"What do you think will happen if this Quran is from God and you have rejected it? Besides, a witness from among the Israelites has testified to the divinity of a Book like it and believed in it (Quran) while you have arrogantly denied it. God does not guide the unjust."
          ],
          "en.shakir": [
            "Say: Have you considered if it is from Allah, and you disbelieve in it, and a witness from among the children of Israel has borne witness of one like it, so he believed, while you are big with pride; surely Allah does not guide the unjust people."
          ],
          "en.transliteration": [
            "Qul araaytum in k<u>a</u>na min AAindi All<u>a</u>hi wakafartum bihi washahida sh<u>a</u>hidun min banee isr<u>a</u>eela AAal<u>a</u> mithlihi fa<u>a</u>mana wa<b>i</b>stakbartum inna All<u>a</u>ha l<u>a</u> yahdee alqawma a<b>l</b><i><u>thth</u></i><u>a</u>limeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "Say, \"Have you thought: what if this Quran really is from God and you reject it? What if one of the Children of Israel testifies to its similarity to earlier scripture and believes in it, and yet you are too arrogant to do the same? God certainly does not guide evil-doers.\""
          ],
          "en.yusufali": [
            "Say: \"See ye? If (this teaching) be from Allah, and ye reject it, and a witness from among the Children of Israel testifies to its similarity (with earlier scripture), and has believed while ye are arrogant, (how unjust ye are!) truly, Allah guides not a people unjust.\""
          ],
          "fa.ansarian": [
            "بگو: به من خبر دهید که اگر این قرآن از ناحیه خدا باشد و شما به آن کفر ورزیده باشید و شاهدی هم از بنی اسرائیل به نظیر آن [که تورات واقعی و تصدیق کننده قرآن است] شهادت داده باشد [که همان طوری که تورات وحی خداست، قرآن هم وحی خداست و] پس [از شهادتش به قرآن] ایمان آورده باشد و شما از ایمان به آن تکبّر ورزیده باشید [آیا گمراه نبوده اید؟] بی تردید خدا گروه ستمکار را هدایت نمی کند."
          ],
          "fa.ayati": [
            "بگو: چه مى‌كنيد اگر قرآن از جانب خدا باشد و شما بدان ايمان نياوريد؟ يكى از بنى‌اسرائيل بدان شهادت داد و ايمان آورد. ولى شما گردنكشى مى‌كنيد. خدا مردم ستمكار را هدايت نمى‌كند."
          ],
          "fa.bahrampour": [
            "بگو: به من خبر دهيد، اگر اين [قرآن‌] از نزد خدا باشد و شما بدان كافر شويد و شاهدى از بنى اسرائيل [مانند عبد اللّه بن سلام‌] بر [حقانيت‌] مثل آن گواهى دهد و ايمان آورد و شما تكبر كنيد [آيا در اين صورت ستمكار نيستيد؟] البته خدا قوم ستمگر را هدايت نمى‌ك"
          ],
          "fa.fooladvand": [
            "بگو: «به من خبر دهيد، اگر اين [قرآن‌] از نزد خدا باشد و شما بدان كافر شده باشيد و شاهدى از فرزندان اسرائيل به مشابهت آن [با تورات‌] گواهى داده و ايمان آورده باشد، و شما تكبّر نموده باشيد [آيا باز هم شما ستمكار نيستيد؟] البته خدا قوم ستمگر را هدايت نمى‌كند.»"
          ],
          "fa.ghomshei": [
            "بگو: چه تصور می‌کنید، اگر از جانب خدا باشد و شما به آن کافر شوید در صورتی که از بنی اسرائیل شاهدی (چون عبد الله سلام عالمی) بر حق بودن قرآن گواهی دهد و ایمان آرد و شما تکبر ورزید (جز آن است که به عذاب خدا گرفتار می‌شوید)؟ آری البته خدا مردم ستمکار را هدایت نخواهد کرد."
          ],
          "fa.khorramdel": [
            "بگو: به من خبر دهید اگر این قرآن از سوی خدا باشد و شما بدان ایمان نیاورید، و کسانی از بنی‌اسرائیل بر همچون کتابی گواهی دهند و ایمان بیاورند، و شما تکبّر بورزید (و خویشتن را بزرگتر از این بدانید که از آن پیروی کنید، آیا شما به خود ظلم نمی‌کنید؟). بی‌گمان خداوند ظالمان را (به سوی خیر و به راه سعادت) رهنمود نمی‌سازد. (ظالمانی که راستای راه حق را می‌بینند و آن را در پیش نمی‌گیرند). [[«کَانَ»: ضمیر مستتر در (کَانَ) و (ه) در واژه‌های (بِهِ) و (مِثْلِهِ) به قرآن برمی‌گردد. «شَهِدَ شَاهِدٌ»: برخی گفته‌اند مراد یکی از علمای برجسته یهود به نام عبدالّله بن سلام است که بعدها در مدینه ایمان آورد و این آیه مدنی است و به فرمان رسول در اینجا قرار داده شده است. ولی اصل این است که مراد از (شاهد) یک گواه، یا نفر نبوده بلکه مراد بیش از یکی، یعنی گروهی و جماعتی است (نگا: شربینی). چرا که مشرکان مکّه می‌گفتند که اگر کتابی برای ایشان نازل شود، از اهل کتاب راهیاب‌تر خواهند بود (نگا: انعام / 157). «عَلی مِثْلِهِ»: در پرتو رهنمودهای کتابی همچون قرآن که مراد تورات است. همچون قرآن، یعنی خود قرآن. «إِن کَانَ مِنْ عِندِاللهِ وَ کَفَرْتُم بِهِ»: جواب شرط محذوف است، مثل: أَلَیْسَ قَدْ ظَلَمْتُمْ؟ أَلَسْتُمْ ظَالِمِینَ؟]]"
          ],
          "fa.khorramshahi": [
            "بگو بیندیشید اگر [قرآن‌] از سوی خداوند باشد و سپس به آن انکار ورزید، [آیا ستمگر نیستید؟] و گواهی از بنی‌اسرائیل بر همانند آن گواهی داده است، آنگاه او ایمان آورده و شما استکبار ورزیدید، بی‌گمان خداوند قوم ستمکاران را هدایت نمی‌کند"
          ],
          "fa.makarem": [
            "بگو: «به من خبر دهید اگر این قرآن از سوی خدا باشد و شما به آن کافر شوید، در حالی که شاهدی از بنی اسرائیل بر آن شهادت دهد، و او ایمان آورد و شما استکبار کنید (چه کسی گمراهتر از شما خواهد بود)؟! خداوند گروه ستمگر را هدایت نمی‌کند!»"
          ],
          "fa.moezzi": [
            "بگو آیا دیدید اگر باشد از نزد خدا و کفر ورزیدید بدان و گواهی دهد گواهی از بنی‌اسرائیل بر مانند آن پس ایمان آورد و شما کبر ورزیدید همانا خدا رهبری نکند گروه ستمگران را"
          ],
          "fa.mojtabavi": [
            "بگو: مرا گوييد كه اگر آن"
          ],
          "fa.sadeqi": [
            "بگو: «آیا دیدید اگر این (قرآن) از نزد خدا باشد و شما بدان کافر شده باشید و شاهدی از فرزندان اسرائیل بر همانندیِ (وحیانی بودن) آن (با تورات و انجیل) گواهی داده، پس (بدان) ایمان آورده باشد و شما تکّبر نموده باشید (آیا باز هم شما ستمکار نیستید)؟ البته خدا گروه ستمگران را هدایت نمی‌کند.»"
          ]
        }
      },
      {
        "index": 4521,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:46:11",
        "text": [
          "وَ قَالَ‌ الَّذِينَ‌ کَفَرُوا لِلَّذِينَ‌ آمَنُوا لَوْ کَانَ‌ خَيْراً مَا سَبَقُونَا إِلَيْهِ‌ وَ إِذْ لَمْ‌ يَهْتَدُوا بِهِ‌ فَسَيَقُولُونَ‌ هٰذَا إِفْکٌ‌ قَدِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Those who deny say of those who believe: \"Had there been any good in it they would not have preceded us in coming to it.\" Since they have not taken guidance from it, they will say: \"This is the same old lie.\""
          ],
          "en.ahmedraza": [
            "And the disbelievers said regarding the Muslims, “If there were any good in it, the Muslims would not have surpassed us in achieving it!”; and since they did not receive guidance with it, they will now say, “This is an old slander.”"
          ],
          "en.arberry": [
            "The unbelievers say, as regards the believers, 'If it had been aught good, they had not outstripped us to it.' And since they are not guided by it, certainly they will say, 'This is an old calumny!'"
          ],
          "en.daryabadi": [
            "And those who disbelieve say of those who believe: had it been good, they would not have preceded us thereto. And when they have not let themselves be guided thereby, they say: this is an ancient falsehood."
          ],
          "en.hilali": [
            "And those who disbelieve (strong and wealthy) say of those who believe (weak and poor): \"Had it (Islamic Monotheism to which Muhammad SAW is inviting mankind) been a good thing, they (weak and poor) would not have preceded us thereto!\" And when they have not let themselves be guided by it (this Quran), they say: \"This is an ancient lie!\""
          ],
          "en.itani": [
            "Those who disbelieve say to those who believe, “If it were anything good, they would not have preceded us to it.” And since they were not guided by it, they will say, “This is an ancient lie.”"
          ],
          "en.maududi": [
            "The unbelievers say to the believers: If there was any good in this Book, others would not have beaten us to its acceptance.” But since they have not been guided to it, they will certainly say: “This is an old fabrication.”"
          ],
          "en.mubarakpuri": [
            "And those who disbelieve say of those who believe: \"Had it been a good thing, they (the poor believers) would not have preceded us to it!\" And when they have not been guided by it, they say: \"This is ancient falsehood!\""
          ],
          "en.pickthall": [
            "And those who disbelieve say of those who believe: If it had been (any) good, they would not have been before us in attaining it. And since they will not be guided by it, they say: This is an ancient lie;"
          ],
          "en.qarai": [
            "The faithless say about the faithful, ‘Had it been [anything] good, they would not have taken the lead over us toward [accepting] it.’ And since they could not find the way to it, they will say, ‘It is an ancient lie.’"
          ],
          "en.qaribullah": [
            "The unbelievers say of the believers: 'Had it been any good they would not have believed in it before us' And because they are not guided by it they say: 'This is an ancient falsehood'"
          ],
          "en.sahih": [
            "And those who disbelieve say of those who believe, \"If it had [truly] been good, they would not have preceded us to it.\" And when they are not guided by it, they will say, \"This is an ancient falsehood.\""
          ],
          "en.sarwar": [
            "The disbelievers have said about the believers, \"Had there been anything good in it (Quran), they could not have accepted it before us\" Since they do not benefit from its guidance, they say, \"It (Quran) is only a fabricated legend\"."
          ],
          "en.shakir": [
            "And those who disbelieve say concerning those who believe: If it had been a good, they would not have gone ahead of us therein. And as they do not seek to be rightly directed thereby, they say: It is an old lie."
          ],
          "en.transliteration": [
            "Waq<u>a</u>la alla<u>th</u>eena kafaroo lilla<u>th</u>eena <u>a</u>manoo law k<u>a</u>na khayran m<u>a</u> sabaqoon<u>a</u> ilayhi wai<u>th</u> lam yahtadoo bihi fasayaqooloona h<u>atha</u> ifkun qadeem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Those who deny the truth say of the believers, \"If there were any good in this Quran, they would not have believed in it before we did.\" And since they refuse to be guided by it, they say, \"This is an ancient fabrication.\""
          ],
          "en.yusufali": [
            "The Unbelievers say of those who believe: \"If (this Message) were a good thing, (such men) would not have gone to it first, before us!\" And seeing that they guide not themselves thereby, they will say, \"this is an (old,) falsehood!\""
          ],
          "fa.ansarian": [
            "و کافران درباره مؤمنان گفتند: اگر [آیین محمّد] بهتر [از آیین ما] بود [آنان در پذیرفتنش] بر ما نسبت به آن پیشی نمی گرفتند [بلکه خود ما زودتر از آنان به این کتاب ایمان می آوردیم]. و چون [خودشان به خاطر کبر و عنادشان] به وسیله آن هدایت نیافتند، به زودی خواهند گفت: این یک دروغ قدیمی است."
          ],
          "fa.ayati": [
            "كافران مؤمنان را گفتند: اگر در آن خيرى مى‌بود، اينان در پذيرفتنش بر ما سبقت نمى‌گرفتند. و چون بدان راه نيافته‌اند خواهند گفت كه اين دروغى ديرينه است."
          ],
          "fa.bahrampour": [
            "و كافران در حق مؤمنان گفتند: اگر [اين قرآن‌] چيز خوبى بود، به [پذيرفتن‌] آن بر ما پيشى نگرفته بودند، و چون خود به وسيله آن هدايت نيافته‌اند به زودى خواهند گفت: اين يك دروغ كهنه است"
          ],
          "fa.fooladvand": [
            "و كسانى كه كافر شدند، به آنان كه گرويده‌اند گفتند: «اگر [اين دين‌] خوب بود، بر ما بدان پيشى نمى‌گرفتند.» و چون بدان هدايت نيافته‌اند، به زودى خواهند گفت: «اين دروغى كهنه است.»"
          ],
          "fa.ghomshei": [
            "و کافران گفتند: اگر دین اسلام بهتر (از بت‌پرستی) بود مردم (فقیر زبونی) از ما در ایمان به آن سبقت نمی‌گرفتند. و آنها چون به قرآن هدایت نمی‌شوند خواهند گفت که این کتاب دروغی از گفتار پیشینیان است."
          ],
          "fa.khorramdel": [
            "کافران (تمسخرکنان) درباره‌ی مؤمنان می‌گویند: اگر (قرآن که برنامه‌ی اسلام است) چیز خوبی بود، هرگز آنان برای رسیدن به آن از ما پیشی نمی‌گرفتند (و ما قبل از ایشان به اسلام می‌گرویدیم و به قرآن ایمان می‌آوردیم. چرا که ما سران قوم بوده و از عقل برتری و خردمندی بیشتری برخورداریم). چون خودشان به وسیله‌ی آن هدایت و راهیاب نشده‌اند، می‌گویند: این همان دروغهای قدیمی است (و از افسانه‌های کهن فراهم آمده است). [[«لِلَّذِینَ آمَنُوا»: در حق مؤمنین. درباره مؤمنان. حرف لام به معنی (عَنْ) است (نگا: آیه 7). «لَوْ کَانَ خَیْراً»: اگر قرآن چیز خوبی بود. «إِذْ»: چرا که. واژه (إِذْ) به معنی لام تعلیل است (نگا: کهف / 16، زخرف / 39). «إِذْ لَمْ یَهْتَدُوا بِهِ»: به خاطر عدم هدایتشان به قرآن. «إِفْکٌ قَدِیمٌ»: دروغ قدیمی. مرادشان افسانه‌ای از نوع افسانه‌های پیشینیان است.]]"
          ],
          "fa.khorramshahi": [
            "و کافران در حق مؤمنان گویند اگر خیر بود آنان بر ما در زمینه آن پیشی نمی‌گرفتند، و چون به آن راهیاب نشدند، گویند این برساخته‌ای کهن است‌"
          ],
          "fa.makarem": [
            "کافران درباره مؤمنان چنین گفتند: «اگر (اسلام) چیز خوبی بود، هرگز آنها (در پذیرش آن) بر ما پیشی نمی‌گرفتند!» و چون خودشان بوسیله آن هدایت نشدند می‌گویند: «این یک دروغ قدیمی است!»"
          ],
          "fa.moezzi": [
            "و گفتند آنان که کفر ورزیدند بدانان که ایمان آوردند اگر خوبی می‌بود پیشی نمی‌گرفتند از ما بدان و چون رهبری نشدند بدان زود است گویند آن است دروغی کهن‌"
          ],
          "fa.mojtabavi": [
            "و كافران در باره مؤمنان گفتند: اگر [دين مسلمانى‌] بهتر بود [اينان‌] به سوى آن بر ما پيشى نمى‌گرفتند- بلكه ما پيشى مى‌گرفتيم- و چون به آن راه نيافته‌اند خواهند گفت كه اين دروغى است كهن."
          ],
          "fa.sadeqi": [
            "و کسانی که کافر شدند – برای کسانی که ایمان آوردند – گفتند: «اگر این ایمان خوب بود، آنان بر ما (در آن) بدان پیشی نمی‌گرفتند.» و چون (اینان) بدان هدایت نیافته‌اند، پس به زودی خواهند گفت: «این (خود) گمراهی سابقه‌داری است.»"
          ]
        }
      },
      {
        "index": 4522,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:46:12",
        "text": [
          "وَ مِنْ‌ قَبْلِهِ‌ کِتَابُ‌ مُوسَى‌ إِمَاماً وَ رَحْمَةً وَ هٰذَا کِتَابٌ‌ مُصَدِّقٌ‌ لِسَاناً عَرَبِيّاً لِيُنْذِرَ الَّذِينَ‌ ظَلَمُوا وَ بُشْرَى‌ لِلْمُحْسِنِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "There was the Book of Moses before this, a guide and a mercy; and here is this Book confirming it in lucid language, warning those who are wicked, and giving happy tidings to the righteous."
          ],
          "en.ahmedraza": [
            "And whereas before this exists the Book of Moosa, a guide and a mercy; and this is a Book giving testimony, in the Arabic language, to warn the unjust; and to give glad tidings to the virtuous."
          ],
          "en.arberry": [
            "Yet before it was the Book of Moses for a model and a mercy; and this is a Book confirming, in Arabic tongue, to warn the evildoers, and good tidings to the good-doers."
          ],
          "en.daryabadi": [
            "And before it there hath been the Book of Musa, a guide and a mercy. And this a Book confirming it, in Arabic speech, that it may warn those who have done wrong and as glad tidings Unto the well-doers."
          ],
          "en.hilali": [
            "And before this was the Scripture of Musa (Moses) as a guide and a mercy. And this is a confirming Book (the Quran) in the Arabic language, to warn those who do wrong, and as glad tidings to the Muhsinun (good-doers - see V. 2:112)."
          ],
          "en.itani": [
            "And before it was the Book of Moses, a model and a mercy. And this is a confirming Book, in the Arabic language, to warn those who do wrong—and good news for the doers of good."
          ],
          "en.maududi": [
            "Yet before this the Book was revealed to Moses as a guide and a mercy. This Book, which confirms it, is in the Arabic tongue to warn the wrong-doers and to give good tidings to those who do good."
          ],
          "en.mubarakpuri": [
            "And before this was the Scripture of Musa as a guide and a mercy. And this is a Book confirming in the Arabic tongue, to warn those who do wrong, and as glad tidings for the doers of good."
          ],
          "en.pickthall": [
            "When before it there was the Scripture of Moses, an example and a mercy; and this is a confirming Scripture in the Arabic language, that it may warn those who do wrong and bring good tidings for the righteous."
          ],
          "en.qarai": [
            "Yet before it the Book of Moses was a guide and mercy, and this is a Book in the Arabic language, which confirms it, [sent] to warn the wrongdoers, and is a [bearer of] good news for the virtuous."
          ],
          "en.qaribullah": [
            "Yet before it there was the Book of Moses which was an authority, and a mercy. This (Koran) is the Book confirming it (the other untampered Books) in theArabic tongue, to warn the harmdoers and to give glad tidings to those who do good."
          ],
          "en.sahih": [
            "And before it was the scripture of Moses to lead and as a mercy. And this is a confirming Book in an Arabic tongue to warn those who have wronged and as good tidings to the doers of good."
          ],
          "en.sarwar": [
            "Before this (Quran), the Book of Moses was a guide and a blessing. This Book confirms the Torah. It is in the Arabic language so that it may warn the unjust people, and give glad news to the righteous ones."
          ],
          "en.shakir": [
            "And before it the Book of Musa was a guide and a mercy: and this is a Book verifying (it) in the Arabic language that it may warn those who are unjust and as good news for the doers of good."
          ],
          "en.transliteration": [
            "Wamin qablihi kit<u>a</u>bu moos<u>a</u> im<u>a</u>man wara<u>h</u>matan wah<u>atha</u> kit<u>a</u>bun mu<u>s</u>addiqun lis<u>a</u>nan AAarabiyyan liyun<u>th</u>ira alla<u>th</u>eena <i><u>th</u></i>alamoo wabushr<u>a</u> lilmu<u>h</u>sineen<b>a</b>"
          ],
          "en.wahiduddin": [
            "Yet the scripture of Moses was revealed before it as a guide and a blessing; and this is a Book in the Arabic language, fulfilling [previous prophecies], to forewarn those who do evil and to bring good news to those who do good."
          ],
          "en.yusufali": [
            "And before this, was the Book of Moses as a guide and a mercy: And this Book confirms (it) in the Arabic tongue; to admonish the unjust, and as Glad Tidings to those who do right."
          ],
          "fa.ansarian": [
            "[چگونه یک دروغ قدیمی است] در حالی که پیش از آن کتاب موسی پیشوا و رحمت بود [و از نزول آن بر پیامبر اسلام خبر داده]، و این قرآن تصدیق کننده [آن] است در حالی که به زبان عربی [فصیح و گویا] ست تا ستمکاران را بیم دهد، و برای نیکوکاران بشارتی باشد."
          ],
          "fa.ayati": [
            "و پيش از آن كتاب موسى راهنما و رحمت بود. و اين، كتابى است تصديق‌كننده آن، به زبان عربى، تا ستمكاران را بيمى و نيكوكاران را مژده‌اى باشد."
          ],
          "fa.bahrampour": [
            "و [حال آن كه‌] پيش از آن، كتاب موسى راهنما و رحمتى بود، و اين [قرآن‌] كتابى به زبان عربى است كه تصديق كننده [ى آن‌] است، تا كسانى را كه ستم كردند هشدار دهد و نيكوكاران را مژده‌اى باشد"
          ],
          "fa.fooladvand": [
            "و [حال آنكه‌] پيش از آن، كتاب موسى، راهبر و [مايه‌] رحمتى بود؛ و اين [قرآن‌] كتابى است به زبان عربى كه تصديق‌كننده [آن‌] است، تا كسانى را كه ستم كرده‌اند هشدار دهد و براى نيكوكاران مژده‌اى باشد."
          ],
          "fa.ghomshei": [
            "و پیش از قرآن کتاب تورات بر موسی که امام و پیشوای مهربان خلق بود نازل گردید و این کتاب قرآن مصدّق کتب آسمانی پیشین به زبان فصیح عربی نازل شده تا ستمکاران عالم را (از عذاب خدا) بترساند و نیکوکاران را بشارت (به رحمت ایزد) دهد."
          ],
          "fa.khorramdel": [
            "پیش از قرآن، کتاب موسی (تورات) پیشوا و رحمت بوده، و (هم‌اینک) این (قرآن) کتاب (دین و شریعت) است که تصدیق‌کننده (ی تورات و سایر کتابهای آسمانی) و به زبان عربی است تا وسیله‌ی بیم دادن ستمگران و مژده دادن نیکوکاران باشد. [[«مِن قَبْلِهِ»: پیش از قرآن. «إِمَاماً وَ رَحْمَةً»: پیشوا و رحمت. حال (کِتَابٌ) است (نگا: هود / 17). یعنی وسیله اقتدا در دین و شریعت، و مایه و سبب رحمت برای مردمان بوده است. «هذا کِتَابٌ»: این قرآن دین و شریعت است. (هذا) مبتدا و (کِتَابٌ) خبر است. «مُصَدِّقٌ»: تصدیق‌کننده تورات و کتابهای آسمانی پیشین. صفت کتاب است (نگا: انعام / 92). «لِسَاناً عَرَبِیّاً»: به زبان عربی. (لِسَاناً) حال، و (عَرَبِیِّاً) صفت است (نگا: نحل / 103، شعراء / 195). واژه (لِسَاناً) می‌تواند منصوب به نزع خافض باشد. «لِیُنذِرَ ...»: محلاًّ منصوب و مفعول‌له است. «بُشْری»: تقدیراً منصوب، عطف بر محل (لِیُنذِرَ) است.]]"
          ],
          "fa.khorramshahi": [
            "و پیش از آن کتاب موسی رهنما و رحمت بود، و این کتابی است همخوان [با آن‌]، به زبان عربی [/شیوا]، تا ستم‌پیشگان [مشرک‌] را هشدار دهد، و بشارتی برای نیکوکاران باشد"
          ],
          "fa.makarem": [
            "و پیش از آن، کتاب موسی که پیشوا و رحمت بود (نشانه‌های آن را بیان کرده)، و این کتاب هماهنگ با نشانه‌های تورات است در حالی که به زبان عربی و فصیح و گویاست، تا ظالمان را بیم دهد و برای نیکوکاران بشارتی باشد!"
          ],
          "fa.moezzi": [
            "و از پیشش کتاب موسی پیشوا و رحمتی و این است کتابی تصدیق‌کننده به زبان عربی تا بترساند آنان را که ستم کردند و مژده است برای نکوکاران‌"
          ],
          "fa.mojtabavi": [
            "و حال آنكه پيش از آن، كتاب موسى راهنما و رحمت بود، و اين كتاب است باوردارنده [آن‌] به زبان تازى تا كسانى را كه ستم كردند بيم دهد و نيكوكاران را نويد باشد."
          ],
          "fa.sadeqi": [
            "حال آنکه پیش از آن، کتاب موسی، به حال راهبری(شان) و (مایه‌ی) رحمتی (برایشان) بود. و این (قرآن) کتابی است به زبانی آشکارا که تصدیق‌کننده‌(ی آن) است، تا کسانی را که ستم کردند هشدار دهد و برای نیکوکاران مژده‌ای باشد."
          ]
        }
      },
      {
        "index": 4523,
        "local_index": 13,
        "part_type": "Verse",
        "path": "/books/quran:46:13",
        "text": [
          "إِنَ‌ الَّذِينَ‌ قَالُوا رَبُّنَا اللَّهُ‌ ثُمَ‌ اسْتَقَامُوا فَلاَ خَوْفٌ‌ عَلَيْهِمْ‌ وَ لاَ هُمْ‌ يَحْزَنُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Surely for those who say, \"God is our Lord,\" and then remain firm, there is no fear or regret."
          ],
          "en.ahmedraza": [
            "Indeed those who said, “Allah is our Lord”, and then remained steadfast – upon them is neither any fear nor shall they grieve."
          ],
          "en.arberry": [
            "Surely those who say, 'Our Lord is God' and then go straight, no fear shall be on them, neither shall they sorrow."
          ],
          "en.daryabadi": [
            "Verily those who say: our Lord is Allah, and thereafter stand fast thereto, no fear shall come upon them, nor shall they grieve."
          ],
          "en.hilali": [
            "Verily, those who say: \"Our Lord is (only) Allah,\" and thereafter Istaqamu (i.e. stood firm and straight on the Islamic Faith of Monotheism by abstaining from all kinds of sins and evil deeds which Allah has forbidden and by performing all kinds of good deeds which He has ordained), on them shall be no fear, nor shall they grieve."
          ],
          "en.itani": [
            "Those who say, “Our Lord is God,” then lead a righteous life—they have nothing to fear, nor shall they grieve."
          ],
          "en.maududi": [
            "Surely those who said: “Our Lord is Allah” and then remained steadfast shall have nothing to fear nor to grieve."
          ],
          "en.mubarakpuri": [
            "Verily, those who say: \"Our Lord is (only) Allah,\" and thereafter stand firm, on them shall be no fear, nor shall they grieve."
          ],
          "en.pickthall": [
            "Lo! those who say: Our Lord is Allah, and thereafter walk aright, there shall no fear come upon them neither shall they grieve."
          ],
          "en.qarai": [
            "Those who say, ‘Our Lord is Allah,’ and then remain steadfast, they will have no fear, nor will they grieve."
          ],
          "en.qaribullah": [
            "Those who say: 'Our Lord is Allah' and follow the Straight Path shall have nothing to fear nor shall they sorrow."
          ],
          "en.sahih": [
            "Indeed, those who have said, \"Our Lord is Allah,\" and then remained on a right course - there will be no fear concerning them, nor will they grieve."
          ],
          "en.sarwar": [
            "Those who have said, \"Our Lord is God,\" and are steadfast in their belief need have no fear or be grieved."
          ],
          "en.shakir": [
            "Surely those who say, Our Lord is Allah, then they continue on the right way, they shall have no fear nor shall they grieve."
          ],
          "en.transliteration": [
            "Inna alla<u>th</u>eena q<u>a</u>loo rabbun<u>a</u> All<u>a</u>hu thumma istaq<u>a</u>moo fal<u>a</u> khawfun AAalayhim wal<u>a</u> hum ya<u>h</u>zanoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Surely those who say, \"Our Lord is God,\" and remain firm [on that path] shall feel no fear, nor shall they grieve:"
          ],
          "en.yusufali": [
            "Verily those who say, \"Our Lord is Allah,\" and remain firm (on that Path),- on them shall be no fear, nor shall they grieve."
          ],
          "fa.ansarian": [
            "بی تردید کسانی که گفتند: پروردگار ما الله است، سپس [در میدان عمل بر این حقیقت] استقامت ورزیدند، نه بیمی بر آنان است و نه اندوهگین می شوند."
          ],
          "fa.ayati": [
            "هر آينه آنان كه گفتند كه پروردگار ما اللّه است و سپس پايدارى ورزيدند، بيمى بر آنها نيست و اندوهگين نمى‌شوند."
          ],
          "fa.bahrampour": [
            "محققا كسانى كه گفتند: پروردگار ما خداست و استقامت كردند، نه بيمى بر آنهاست و نه غمگين مى‌شوند"
          ],
          "fa.fooladvand": [
            "محققاً كسانى كه گفتند: «پروردگار ما خداست» سپس ايستادگى كردند، بيمى بر آنان نيست و غمگين نخواهند شد."
          ],
          "fa.ghomshei": [
            "آنان که گفتند: آفریننده ما خداست و بر این سخن پایدار و ثابت ماندند بر آنها هیچ ترس و بیمی و حزن و اندوهی (در دنیا و عقبی) نخواهد بود."
          ],
          "fa.khorramdel": [
            "کسانی که می‌گویند: پروردگار ما تنها یزدان است، سپس (بر این توحید و یکتاپرستی) ماندگار می‌مانند، نه ترسی بر آنان است و نه غمگین می‌گردند. [[«إِنَّ الَّذِینَ ...»: (نگا: فصّلت / 30).]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان کسانی که گفتند پروردگار ما خداوند است، سپس [در این راه‌] پایداری ورزیدند، نه بیمی بر آنان است و نه اندوهگین می‌شوند"
          ],
          "fa.makarem": [
            "کسانی که گفتند: «پروردگار ما اللّه است»، سپس استقامت کردند، نه ترسی برای آنان است و نه اندوهگین می‌شوند."
          ],
          "fa.moezzi": [
            "همانا آنان که گفتند پروردگار ما خدا است و سپس پایدار ماندند نیست بیمی بر ایشان و نه اندوهگین شوند"
          ],
          "fa.mojtabavi": [
            "همانا كسانى كه گفتند: پروردگار ما خداى يكتاست و سپس [بر آن‌] استوار و پايدار ماندند پس نه بيمى بر آنهاست و نه اندوهگين شوند."
          ],
          "fa.sadeqi": [
            "بی‌گمان کسانی که گفتند: «پروردگار ما خداست‌» سپس (در گفتار و کردارشان) ایستادگی کردند، نه بیمی بر آنان است و نه ایشان غمگین می‌شوند."
          ]
        }
      },
      {
        "index": 4524,
        "local_index": 14,
        "part_type": "Verse",
        "path": "/books/quran:46:14",
        "text": [
          "أُولٰئِکَ‌ أَصْحَابُ‌ الْجَنَّةِ خَالِدِينَ‌ فِيهَا جَزَاءً بِمَا کَانُوا يَعْمَلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They are men of Paradise where they will abide for ever as a recompense for what they had done."
          ],
          "en.ahmedraza": [
            "They are the People of Paradise, abiding in it forever; the reward of their deeds."
          ],
          "en.arberry": [
            "Those are the inhabitants of Paradise, therein dwelling forever, as a recompense for that they have been doing."
          ],
          "en.daryabadi": [
            "Those are the fellows of the Carden: abiders therein: a recompense for that which they have been working."
          ],
          "en.hilali": [
            "Such shall be the dwellers of Paradise, abiding therein (forever), a reward for what they used to do."
          ],
          "en.itani": [
            "These are the inhabitants of Paradise, where they will dwell forever—a reward for what they used to do."
          ],
          "en.maududi": [
            "They are the people of Paradise. They shall remain in it forever as a reward for their deeds."
          ],
          "en.mubarakpuri": [
            "Such shall be the dwellers of Paradise, abiding therein (forever) -- a reward for what they used to do."
          ],
          "en.pickthall": [
            "Such are rightful owners of the Garden, immortal therein, as a reward for what they used to do."
          ],
          "en.qarai": [
            "They shall be the inhabitants of paradise, remaining in it [forever]—a reward for what they used to do."
          ],
          "en.qaribullah": [
            "Those, they shall be for ever the inhabitants of Paradise, a recompense for what they did."
          ],
          "en.sahih": [
            "Those are the companions of Paradise, abiding eternally therein as reward for what they used to do."
          ],
          "en.sarwar": [
            "They will be the dwellers of Paradise wherein they will live forever as a reward for what they have done."
          ],
          "en.shakir": [
            "These are the dwellers of the garden, abiding therein: a reward for what they did."
          ],
          "en.transliteration": [
            "Ol<u>a</u>ika a<u>s</u><u>ha</u>bu aljannati kh<u>a</u>lideena feeh<u>a</u> jaz<u>a</u>an bim<u>a</u> k<u>a</u>noo yaAAmaloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "it is they who are the people of Paradise, they shall abide therein as a reward for all that they have done."
          ],
          "en.yusufali": [
            "Such shall be Companions of the Gardens, dwelling therein (for aye): a recompense for their (good) deeds."
          ],
          "fa.ansarian": [
            "اینان اهل بهشت اند که به پاداش اعمال شایسته ای که همواره انجام می دادند، در آن جاودانه اند. …."
          ],
          "fa.ayati": [
            "اينان به پاداش اعمالشان اهل بهشتند و در آنجا جاودانه‌اند."
          ],
          "fa.bahrampour": [
            "ايشان اهل بهشتند و براى هميشه در آن ماندگارند [اين‌] پاداشى است به خاطر آنچه انجام مى‌دادند"
          ],
          "fa.fooladvand": [
            "ايشان اهل بهشتند كه به پاداش آنچه انجام مى‌دادند جاودانه در آن مى‌مانند."
          ],
          "fa.ghomshei": [
            "آنان اهل بهشتند و به پاداش اعمال نیک همیشه در بهشت ابد مخلّد خواهند بود."
          ],
          "fa.khorramdel": [
            "آنان به پاداش کارهائی که می‌کنند، ساکنان بهشت بوده و جاودانه در آن می‌مانند. [[«جَزَآءً»: مفعول‌له است (نگا: اعراب القرآن انباری).]]"
          ],
          "fa.khorramshahi": [
            "اینان بهشتیانند که جاودانه در آنند، که پاداش کاری است که کرده‌اند"
          ],
          "fa.makarem": [
            "آنها اهل بهشتند و جاودانه در آن می‌مانند؛ این پاداش اعمالی است که انجام می‌دادند."
          ],
          "fa.moezzi": [
            "آنانند یاران بهشت جاودانان در آن پاداشی برابر آنچه بودند می‌کردند"
          ],
          "fa.mojtabavi": [
            "اينان اهل بهشت‌اند كه در آن جاودانه‌اند، به پاداش آنچه مى‌كردند."
          ],
          "fa.sadeqi": [
            "ایشان بهشتیانند که به پاداش آنچه انجام می‌دادند جاودانه در آن می‌مانند."
          ]
        }
      },
      {
        "index": 4525,
        "local_index": 15,
        "part_type": "Verse",
        "path": "/books/quran:46:15",
        "text": [
          "وَ وَصَّيْنَا الْإِنْسَانَ‌ بِوَالِدَيْهِ‌ إِحْسَاناً حَمَلَتْهُ‌ أُمُّهُ‌ کُرْهاً وَ وَضَعَتْهُ‌ کُرْهاً وَ حَمْلُهُ‌ وَ فِصَالُهُ‌ ثَلاَثُونَ‌ شَهْراً حَتَّى‌ إِذَا بَلَغَ‌ أَشُدَّهُ‌ وَ بَلَغَ‌ أَرْبَعِينَ‌ سَنَةً قَالَ‌ رَبِ‌ أَوْزِعْنِي‌ أَنْ‌ أَشْکُرَ نِعْمَتَکَ‌ الَّتِي‌ أَنْعَمْتَ‌ عَلَيَ‌ وَ عَلَى‌ وَالِدَيَ‌ وَ أَنْ‌ أَعْمَلَ‌ صَالِحاً تَرْضَاهُ‌ وَ أَصْلِحْ‌ لِي‌ فِي‌ ذُرِّيَّتِي‌ إِنِّي‌ تُبْتُ‌ إِلَيْکَ‌ وَ إِنِّي‌ مِنَ‌ الْمُسْلِمِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "We have enjoined on man to be good to his parents: His mother carries him in her womb with hardship, and gives birth to him in pain. Thirty months is the period of her carrying and weaning him. When he attains to manhood and the age of forty, he says: \"O Lord, guide me to thank You for the favours You have bestowed on me and my parents, and to do things good as may please You, and give me a righteous off-spring. I turn to You in penitence and submit.\""
          ],
          "en.ahmedraza": [
            "And We have commanded man to be good towards parents; his mother bore him with hardship, and delivered him with hardship; and carrying him and weaning him is for thirty months; until when he* reached maturity and became forty years of age, he said, “My Lord! Inspire me to be thankful for the favours you bestowed upon me and my parents, and that I may perform the deeds pleasing to You, and keep merit among my offspring; I have inclined towards you and I am a Muslim.” (* This verse was revealed concerning S. Abu Bakr – the first caliph, R. A. A)"
          ],
          "en.arberry": [
            "We have charged man, that he be kind to his parents; his mother bore him painfully, and painfully she gave birth to him; his bearing and his weaning are thirty months. Until, when he is fully grown, and reaches forty years, he says, 'O my Lord, dispose me that I may be thankful for Thy blessing wherewith Thou hast blessed me and my father and mother, and that I may do righteousness well-pleasing to Thee; and make me righteous also in my seed. Behold, I repent to Thee, and am among those that surrender.'"
          ],
          "en.daryabadi": [
            "And We have enjoined upon man kindness Unto the parents: with hardship his mother beareth him and with hardship she bringeth him forth, and the bearing of him and the weaning of him is thirty months, until, when he attaineth his full strength and attaineth the age of forty years, he saith: my Lord! grant me that may give thanks for the favour wherewith. Thou hast favoured me and my parents and that may work righteously such as Thou mayest approve; and be Thou good Unto me in my progeny, verily have turned Unto Thee repentant, and verily I am of those who submit."
          ],
          "en.hilali": [
            "And We have enjoined on man to be dutiful and kind to his parents. His mother bears him with hardship and she brings him forth with hardship, and the bearing of him, and the weaning of him is thirty (30) months, till when he attains full strength and reaches forty years, he says: \"My Lord! Grant me the power and ability that I may be grateful for Your Favour which You have bestowed upon me and upon my parents, and that I may do righteous good deeds, such as please You, and make my off-spring good. Truly, I have turned to You in repentance, and truly, I am one of the Muslims (submitting to Your Will).\""
          ],
          "en.itani": [
            "We have enjoined upon man kindness to his parents. His mother carried him with difficulty, and delivered him with difficulty. His bearing and weaning takes thirty months. Until, when he has attained his maturity, and has reached forty years, he says, “Lord, enable me to appreciate the blessings You have bestowed upon me and upon my parents, and to act with righteousness, pleasing You. And improve my children for me. I have sincerely repented to You, and I am of those who have surrendered.”"
          ],
          "en.maududi": [
            "We have enjoined man to be kind to his parents. In pain did his mother bear him and in pain did she give birth to him. The carrying of the child to his weaning is a period of thirty months. And when he is grown to full maturity and reaches the age of forty, he prays: “My Lord, dispose me that I may give thanks for the bounty that You have bestowed upon me and my parents, and dispose me that I may do righteous deeds that would please You, and also make my descendants righteous. I repent to You, and I am one of those who surrender themselves to You.”"
          ],
          "en.mubarakpuri": [
            "And We have enjoined on man to be dutiful and kind to his parents. His mother bears him with hardship. And she delivers him with hardship. And (the period of) his gestation and the weaning of him is thirty months, till when he attains full strength and reaches forty years, he says: \"My Lord! Grant me the power and ability that I may be grateful for Your favor which You have bestowed upon me and upon my parents, and that I may do righteous good deeds, such as please You, and make my offspring good. Truly, I have turned to You in repentance, and truly, I am one of the Muslims.\""
          ],
          "en.pickthall": [
            "And We have commended unto man kindness toward parents. His mother beareth him with reluctance, and bringeth him forth with reluctance, and the bearing of him and the weaning of him is thirty months, till, when he attaineth full strength and reacheth forty years, he saith: My Lord! Arouse me that I may give thanks for the favour wherewith Thou hast favoured me and my parents, and that I may do right acceptable unto Thee. And be gracious unto me in the matter of my seed. Lo! I have turned unto Thee repentant, and lo! I am of those who surrender (unto Thee)."
          ],
          "en.qarai": [
            "We have enjoined man to be kind to his parents. His mother has carried him in travail, and bore him in travail, and his gestation and weaning take thirty months. When he comes of age and reaches forty years, he says, ‘My Lord! Inspire me to give thanks for Your blessing with which You have blessed me and my parents, and that I may do righteous deeds which please You, and invest my descendants with righteousness. Indeed I have turned to you in penitence, and I am one of the Muslims.’"
          ],
          "en.qaribullah": [
            "We have charged the human to be kind to his parents. With much pain his mother bore him, and with much pain she gave birth to him; his bearing andweaning are thirty months. When he grows to manhood and attains his fortieth year, he says: 'Make me so disposed My Lord, so that I give thanks for the favorswith which You have blessed me, my father and mother, and that I will do good deeds that will please You. And, make me righteous and also my descendants. To You I repent, and I am among those who surrender'"
          ],
          "en.sahih": [
            "And We have enjoined upon man, to his parents, good treatment. His mother carried him with hardship and gave birth to him with hardship, and his gestation and weaning [period] is thirty months. [He grows] until, when he reaches maturity and reaches [the age of] forty years, he says, \"My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.\""
          ],
          "en.sarwar": [
            "We have advised the human being to be kind to his parents; his mother bore him with hardship and delivered him while suffering a great deal of pain. The period in which his mother bore and weaned him lasted for thirty months. When he grew-up to manhood and became forty years old, he then said, \"Lord, inspire me to give You thanks for the bounties you have granted to me and my parents, and to act righteously to please You. Lord, make my offspring virtuous. Lord I turn to you in repentance; I am a Muslim\"."
          ],
          "en.shakir": [
            "And We have enjoined on man doing of good to his parents; with trouble did his mother bear him and with trouble did she bring him forth; and the bearing of him and the weaning of him was thirty months; until when he attains his maturity and reaches forty years, he says: My Lord! grant me that I may give thanks for Thy favor which Thou hast bestowed on me and on my parents, and that I may do good which pleases Thee and do good to me in respect of my offspring; surely I turn to Thee, and surely I am of those who submit."
          ],
          "en.transliteration": [
            "Wawa<u>ss</u>ayn<u>a</u> alins<u>a</u>na biw<u>a</u>lidayhi i<u>h</u>s<u>a</u>nan <u>h</u>amalathu ommuhu kurhan wawa<u>d</u>aAAathu kurhan wa<u>h</u>amluhu wafi<u>sa</u>luhu thal<u>a</u>thoona shahran <u>h</u>att<u>a</u> i<u>tha</u> balagha ashuddahu wabalagha arbaAAeena sanatan q<u>a</u>la rabbi awziAAnee an ashkura niAAmataka allatee anAAamta AAalayya waAAal<u>a</u> w<u>a</u>lidayya waan aAAmala <u>sa</u>li<u>h</u>an tar<u>da</u>hu waa<u>s</u>li<u>h</u> lee fee <u>th</u>urriyyatee innee tubtu ilayka wainnee mina almuslimeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "We have enjoined on man kindness to his parents: his mother bore him, in pain and in pain she gave birth to him, and his bearing and weaning takes thirty months. At length, when he reaches the age of full maturity and attains forty years, he says, \"O my Lord! Help me to be grateful for Your favours which You have bestowed upon me, and upon both my parents, and to do good deeds that will please You. Grant me righteousness in my offspring. Truly, I have turned to You and, truly, I submit to You.\""
          ],
          "en.yusufali": [
            "We have enjoined on man kindness to his parents: In pain did his mother bear him, and in pain did she give him birth. The carrying of the (child) to his weaning is (a period of) thirty months. At length, when he reaches the age of full strength and attains forty years, he says, \"O my Lord! Grant me that I may be grateful for Thy favour which Thou has bestowed upon me, and upon both my parents, and that I may work righteousness such as Thou mayest approve; and be gracious to me in my issue. Truly have I turned to Thee and truly do I bow (to Thee) in Islam.\""
          ],
          "fa.ansarian": [
            "و انسان را درباره پدر و مادرش به نیکی سفارش کردیم. مادرش او را با تحمل رنج و زحمت باردار شد و با رنج و زحمت او را زایید. و دوران بارداری و باز گرفتنش از شیر سی ماه است، تا زمانی که به رشد و نیرومندی خود و به چهل سالگی برسد، گوید: پروردگارا! به من الهام کن تا نعمتت را که بر من و پدر و مادرم عطا کرده ای سپاس گزارم، و کار شایسته ای که آن را می پسندی انجام دهم و ذریه و نسل مرا برای من صالح و شایسته گردان که من به سوی تو بازگشتم و به یقین از تسلیم شدگان [به فرمان ها و احکام] توام."
          ],
          "fa.ayati": [
            "آدمى را به نيكى كردن با پدر و مادر خود سفارش كرديم. مادرش بار او را به دشوارى برداشت و به دشوارى بر زمين نهاد. و مدت حمل تا از شير بازگرفتنش سى ماه است تا چون به سن جوانى رسد و به چهل سالگى درآيد، گويد: اى پروردگار من، به من بياموز تا شكر نعمتى كه بر من و بر پدر و مادرم ارزانى داشته‌اى به جاى آرم. كارى شايسته بكنم كه تو از آن خشنود شوى و فرزندان مرا به صلاح آور. من به تو بازگشتم و از تسليم‌شدگانم."
          ],
          "fa.bahrampour": [
            "و انسان را به نيكى كردن به پدر و مادر خود سفارش كرديم. مادرش با تحمل رنج به او باردار شد و با تحمل رنج او را بر زمين نهاد، و [دوران‌] حمل و از شير گرفتن او سى ماه است، تا آن كه به رشد كامل خود برسد و به چهل سال برسد، مى‌گويد: پروردگارا! بر دلم بيفكن"
          ],
          "fa.fooladvand": [
            "و انسان را [نسبت‌] به پدر و مادرش به احسان سفارش كرديم. مادرش با تحمّل رنج به او باردار شد و با تحمّل رنج او را به دنيا آورد. و باربرداشتن و از شيرگرفتن او سى ماه است، تا آنگاه كه به رشد كامل خود برسد و به چهل سال برسد، مى‌گويد: «پروردگارا، بر دلم بيفكن تا نعمتى را كه به من و به پدر و مادرم ارزانى داشته‌اى سپاس گويم و كار شايسته‌اى انجام دهم كه آن را خوش دارى، و فرزندانم را برايم شايسته گردان؛ در حقيقت، من به درگاه تو توبه آوردم و من از فرمان‌پذيرانم.»"
          ],
          "fa.ghomshei": [
            "و ما انسان را به احسان در حق پدر و مادر خود سفارش کردیم، که مادر با رنج و زحمت بار حمل او کشید و باز با درد و مشقّت وضع حمل نمود و سی ماه تمام مدت حمل و شیرخواری او بود تا وقتی که طفل به حد رشد رسید و آدمی چهل ساله گشت (و عقل و کمال یافت آن گاه سزد که) عرض کند: بار خدایا، مرا بر نعمتی که به من و پدر و مادر من عطا فرمودی شکر بیاموز و به کار شایسته‌ای که رضا و خشنودی تو در آن است موفق دار و فرزندان مرا صالح گردان، من به درگاه تو باز آمدم و از تسلیمان فرمان تو شدم."
          ],
          "fa.khorramdel": [
            "ما به انسان دستور می‌دهیم که به پدر و مادر خود نیکی کند. چرا که مادرش او را با رنج و مشقّت حمل می‌کند، و با رنج و مشقّت وضع می‌کند، و دوران حمل و از شیر بازگرفتن او سی ماه طول می‌کشد. (آن گاه دوران سخت مراقبت و پاسخگوئی به نازها و نیازهای کودکانه و جوانانه و مخارج ازدواج و تهیّه‌ی کار و مسکن و غیره فرا می‌رسد) تا زمانی که به کمال قدرت و رشد عقلانی می‌رسد، و به چهل سالگی پا می‌گذارد. (بدین هنگام انسان لایق و باایمان رو به آستانه‌ی آفریدگار جهان می‌کند و) می‌گوید: پروردگارا! به من توفیق عطاء فرما تا شکر نعمتی را به جای آورم که به من و پدر و مادرم ارزانی داشته‌ای، و کارهای نیکوئی را انجام دهم که می‌پسندی و مایه‌ی خوشنودی تو است، و فرزندانم را صالح گردان و صلاح و نیکوئی را در میان دودمانم تداوم‌بخش. من توبه می‌کنم و به سوی تو برمی‌گردم، و من از زمره‌ی مسلمانان و تسلیم‌شدگان فرمان یزدانم. [[«وَصَّیْنَا»: سفارش کردیم. در اینجا مفهوم امری دارد و معنی چنین می‌شود: دستور مؤکّد می‌دهیم. «إِحْسَاناً»: مفعول مطلق فعل محذوفی و تقدیر چنین است: وَ وَصَّیْنَا الإِنسَانَ بِوَالِدَیْهِ أَن یُحْسِنَ اِحْسَاناً. «حَمَلَتْهُ أُمُّهُ کُرْهاً»: مادرش او را با ناراحتی و مشقّت حمل کرده است. این که قرآن در اینجا تنها از ناراحتیهای مادر سخن به میان آورده و سخنی از پدر در میان نیست، بدان خاطر است که مادر سهم بیشتری در تحمّل مشکلات فرزند دارد. واژه (کُرْهاً) حال (أُمُّ) است. «وَ حَمْلُهُ وَ فِصالُهُ ثَلاثُونَ شَهْراً»: در حالی که حمل او و از شیر بازگرفتن او روی هم سی ماه است. این بخش با توجّه به آیه 233 سوره بقره بیانگر این حکم است که حدّاقلّ حمل شش ماه است و با موازین علم پزشکی هم سازگار است (نگا: المنتخب، نمونه). «فِصَال»: از شیر بازگرفتن (نگا: لقمان / 14). «أَوْزِعْنی»: توفیقم ده. به من الهام کن. شور و شوق آن را در من به وجود آور (نگا: نمل / 19). «أَصْلِحْ لِی فِی ذُرِّیَّتِی»: فرزندانم را شایسته و نیکو گردان، و نیک بودن و خوب بودن را در میان دودمانم تداوم بخش.]]"
          ],
          "fa.khorramshahi": [
            "و به انسان سفارش کرده‌ایم که در حق پدر و مادرش نیکی کند [چرا که‌] مادرش به دشواری او را آبستن بوده و به دشواری او را زاده است، و [دوران‌] بارگرفتن و از شیر گرفتن او سی‌ماه است، تا آنکه به کمال رشدش برسد و به چهل‌سالگی برسد گوید پروردگارا مرا توفیق ده که نعمتی را که بر من و بر پدر و مادرم ارزانی داشتی سپاس بگزارم، و کارهای شایسته‌ای کنم که آن را بپسندی، و زاد و رود مرا نیز به صلاح‌آور، من به درگاه تو توبه کرده‌ام و من از مسلمانانم‌"
          ],
          "fa.makarem": [
            "ما به انسان توصیه کردیم که به پدر و مادرش نیکی کند، مادرش او را با ناراحتی حمل می‌کند و با ناراحتی بر زمین می‌گذارد؛ و دوران حمل و از شیر بازگرفتنش سی ماه است؛ تا زمانی که به کمال قدرت و رشد برسد و به چهل سالگی بالغ گردد می‌گوید: «پروردگارا! مرا توفیق ده تا شکر نعمتی را که به من و پدر و مادرم دادی بجا آورم و کار شایسته‌ای انجام دهم که از آن خشنود باشی، و فرزندان مرا صالح گردان؛ من به سوی تو بازمی‌گردم و توبه می‌کنم، و من از مسلمانانم!»"
          ],
          "fa.moezzi": [
            "و پند دادیم انسان را در باره پدر و مادرش به نیکی بارور شد بدو مادرش به ناخواه و بنهادش به ناخواه و باروریش و از شیر گرفتنش سی ماه تا گاهی که رسید نیروهای خود را و رسید به چهل سال گفت پروردگارا رهنمونم باش تا سپاس گزارم نعمتت را آن را که ارزانی داشتی به من و به پدر و مادرم و تا کنم کرداری شایسته که بپسندیش و اصلاح کن برایم در فرزندانم همانا بازگشتم بسوی تو و همانا منم از اسلام‌آرندگان‌"
          ],
          "fa.mojtabavi": [
            "و آدمى را به نيكوكارى با پدر و مادر خويش سفارش كرديم [بويژه مادر، زيرا كه‌] مادرش او را به دشوارى بار برداشت و به دشوارى بنهاد، و بار برداشتن و از شير گرفتن او سى‌ماه شد. تا آنگاه كه به نيروى جوانى خود رسيد و به چهل سالگى رسيد، گفت: پروردگارا، بر دلم افكن- مرا الهام كن و توفيق ده- تا نعمت تو را كه بر من و بر پدر و مادرم ارزانى داشتى سپاس گزارم و تا كارى نيك و شايسته كنم كه بپسندى، و براى من در فرزندانم شايستگى پديد آر، همانا من سوى تو بازگشتم و همانا من از مسلمانانم- از گردن‌نهادگان و فرمانبردارانم-."
          ],
          "fa.sadeqi": [
            "و انسان را (نسبت) به پدر و مادرش به احسانی (بسیار) سفارش کردیم (که) مادرش با تحمل رنجی شدید به او باردار شد و با تحمل رنجی شدید او را به دنیا آورد، و باربرداشتن و از شیرگرفتن او سی ماه است. تا آن‌گاه که به رشدهای خود دست یافت و به چهل‌‌سالگی رسید. می‌گوید: «پروردگارم! مرا همی پاس‌دار، تا نعمتی را که به من و به پدر و مادرم ارزانی داشته‌ای سپاس گزارم و اینکه کار شایسته‌ای انجام دهم که آن را خوش داری و در (باره‌ی) فرزندانم برایم اصلاح فرمای. همواره من سوی تو روی‌آورده‌ام و به‌راستی من از تسلیم‌شدگان (در برابر تو) می‌باشم.»"
          ]
        }
      },
      {
        "index": 4526,
        "local_index": 16,
        "part_type": "Verse",
        "path": "/books/quran:46:16",
        "text": [
          "أُولٰئِکَ‌ الَّذِينَ‌ نَتَقَبَّلُ‌ عَنْهُمْ‌ أَحْسَنَ‌ مَا عَمِلُوا وَ نَتَجَاوَزُ عَنْ‌ سَيِّئَاتِهِمْ‌ فِي‌ أَصْحَابِ‌ الْجَنَّةِ وَعْدَ الصِّدْقِ‌ الَّذِي‌ کَانُوا يُوعَدُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They are those from whom We accept the very best of what they have done, and overlook their faults. They will be among the inmates of Paradise: A true promise they have been made."
          ],
          "en.ahmedraza": [
            "These are the ones whose good deeds We will accept, and overlook their shortfalls – among the People of Paradise; a true promise which is being given to them."
          ],
          "en.arberry": [
            "Those are they from whom We shall accept the best of what they have done, and We shall pass over their evil deeds. They are among the inhabitants of Paradise -- the promise of the very truth, which they were promised."
          ],
          "en.daryabadi": [
            "Those are they from whom We shall accept the best of that which they have worked, and their misdeeds We shall pass by: among the fellows of the Garden: a true promise this, which they have been promised."
          ],
          "en.hilali": [
            "They are those from whom We shall accept the best of their deeds and overlook their evil deeds. (They shall be) among the dwellers of Paradise, a promise of truth, which they have been promised."
          ],
          "en.itani": [
            "Those are they from whom We accept the best of their deeds, and We overlook their misdeeds, among the dwellers of Paradise—the promise of truth which they are promised."
          ],
          "en.maududi": [
            "Such are those from whom We accept their best deeds and whose evil deeds We overlook. They will be among the people of Paradise in consonance with the true promise made to them."
          ],
          "en.mubarakpuri": [
            "They are those from whom We shall accept the best of their deeds and overlook their evil deeds. (They shall be) among the dwellers of Paradise. That is a promise of truth that they had been promised."
          ],
          "en.pickthall": [
            "Those are they from whom We accept the best of what they do, and overlook their evil deeds. (They are) among the owners of the Garden. This is the true promise which they were promised (in the world)."
          ],
          "en.qarai": [
            "Such are the ones from whom We accept the best of what they do, and overlook their misdeeds, [who will be] among the inhabitants of paradise—a true promise which they had been given."
          ],
          "en.qaribullah": [
            "Such are those from whom We will accept the best of what they have done and whose evil deeds We shall overlook. Those, they are among the inhabitants of Paradise; true is the promise that has been promised them."
          ],
          "en.sahih": [
            "Those are the ones from whom We will accept the best of what they did and overlook their misdeeds, [their being] among the companions of Paradise. [That is] the promise of truth which they had been promised."
          ],
          "en.sarwar": [
            "These are the ones from whom We accept righteous deeds and ignore their bad deeds. They will be among the dwellers of Paradise. It is the true promise which was given to them."
          ],
          "en.shakir": [
            "These are they from whom We accept the best of what they have done and pass over their evil deeds, among the dwellers of the garden; the promise of truth which they were promised."
          ],
          "en.transliteration": [
            "Ol<u>a</u>ika alla<u>th</u>eena nataqabbalu AAanhum a<u>h</u>sana m<u>a</u> AAamiloo wanataj<u>a</u>wazu AAan sayyi<u>a</u>tihim fee a<u>s</u><u>ha</u>bi aljannati waAAda a<b>l</b><u>ss</u>idqi alla<u>th</u>ee k<u>a</u>noo yooAAadoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "We accept from such people the best of what they do and We overlook their bad deeds. They will be among the people of Paradise -- this is a true promise that has been given to them."
          ],
          "en.yusufali": [
            "Such are they from whom We shall accept the best of their deeds and pass by their ill deeds: (They shall be) among the Companions of the Garden: a promise! of truth, which was made to them (in this life)."
          ],
          "fa.ansarian": [
            "اینانند کسانی که ما از آنان بهترین اعمالی که انجام داده اند می پذیریم، و از گناهانشان در زمره اهل بهشت در می گذریم؛ [خدا وعده داد] وعده درست و راست که همواره به آن وعده داده می شدند؛"
          ],
          "fa.ayati": [
            "اينان كسانى هستند كه كارهاى نيكشان را مى‌پذيريم و از گناهشان درمى‌گذريم. در زمره اهل بهشتند. هر وعده‌اى كه به آنها داده شده راست است."
          ],
          "fa.bahrampour": [
            "آنان كسانى‌اند كه بهترين عملى را كه انجام داده‌اند از ايشان مى‌پذيريم و از بدى‌هايشان در زمره بهشتيان در مى‌گذريم وعده‌ى راستى كه وعده داده مى‌شدند"
          ],
          "fa.fooladvand": [
            "اينانند كسانى كه بهترين آنچه را انجام داده‌اند از ايشان خواهيم پذيرفت و از بديهايشان درخواهيم گذشت؛ در [زمره‌] بهشتيانند؛ [همان‌] وعده راستى كه بدانان وعده داده مى‌شده است."
          ],
          "fa.ghomshei": [
            "این بندگانند که به نیکوترین اعمال خود مقبول درگاه ما شده و در زمره اهل بهشت از گناهانشان می‌گذریم. این وعده صدقی است که به آنها بشارت می‌داده‌اند."
          ],
          "fa.khorramdel": [
            "آنان کسانیند که کارهای خوبشان را می‌پذیریم و کلّیّه‌ی اعمال نیکشان را همسان نیک‌ترین آنها می‌گیریم، و همچون سایر بهشتیان از بدیها و گناهانشان درمی‌گذریم، این وعده‌ی راستینی است که پیوسته بدیشان داده شده است. [[«نَتَقَبَّلُ عَنْهُمْ أَحْسَنَ مَا عَمِلُوا»: مراد این است که خداوند از روی لطف، خوب و خوبتر و خوبترین اعمالشان را به حساب خوبترین کردارشان می‌گیرد و پاداش می‌دهد (نگا: نور / 38، عنکبوت / 7، زمر / 35). «فِی أَصْحَابِ الْجَنَّةِ»: همراه با سایر بهشتیان. حرف (فِی) به معنی (مَعَ) است. «وَعْدَ»: مفعول مطلق فعل محذوفی است و تقدیر چنین است: وَعَدَهُمُ اللهُ وَعْدَ الصِّدْقِ. «الصِّدْقِ»: صادق و راستین.]]"
          ],
          "fa.khorramshahi": [
            "اینانند که نیکوترین کاری را که کرده‌اند، از ایشان می‌پذیریم، و در میان بهشتیان از گناهانشان در می‌گذریم، [این‌] وعده راستینی است که به آنان نوید داده شده است‌"
          ],
          "fa.makarem": [
            "آنها کسانی هستند که ما بهترین اعمالشان را قبول می‌کنیم و از گناهانشان می‌گذریم و در میان بهشتیان جای دارند؛ این وعده راستی است که وعده داده می‌شدند."
          ],
          "fa.moezzi": [
            "آنانند که پذیریم از ایشان بهتر آنچه را کردند و درگذریم از بدیهای ایشان در یاران بهشت وعده راستی که بودند وعده داده می‌شدند"
          ],
          "fa.mojtabavi": [
            "اينانند كه از ايشان نيكوترين آنچه را كرده‌اند مى‌پذيريم و از بديهاشان درمى‌گذريم، در زمره بهشتيان، وعده راستى است كه به آنها داده مى‌شد."
          ],
          "fa.sadeqi": [
            "اینانند کسانی‌که در میان بهشتیان، بهترینِ آنچه را انجام داده‌اند از ایشان - به خوبی - خواهیم پذیرفت و از گناهان کوچکشان در می‌گذریم‌؛ (یعنی) وعده‌ی راستین که بدان وعده داده می‌شده‌اند."
          ]
        }
      },
      {
        "index": 4527,
        "local_index": 17,
        "part_type": "Verse",
        "path": "/books/quran:46:17",
        "text": [
          "وَ الَّذِي‌ قَالَ‌ لِوَالِدَيْهِ‌ أُفٍ‌ لَکُمَا أَ تَعِدَانِنِي‌ أَنْ‌ أُخْرَجَ‌ وَ قَدْ خَلَتِ‌ الْقُرُونُ‌ مِنْ‌ قَبْلِي‌ وَ هُمَا يَسْتَغِيثَانِ‌ اللَّهَ‌ وَيْلَکَ‌ آمِنْ‌ إِنَ‌ وَعْدَ اللَّهِ‌ حَقٌ‌ فَيَقُولُ‌ مَا هٰذَا إِلاَّ أَسَاطِيرُ الْأَوَّلِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "But he who says to his parents: \"Shame on you: You intimidate me that I will be resurrected when many generations will have passed before me?\" And (the parents) would implore God's help: \"Woe to you. You better believe. The promise of God is certainly true.\" Yet he answers: \"These are only fables of long ago.\""
          ],
          "en.ahmedraza": [
            "And the one who said to his parents, “Uff – I am fed up with both of you! What! You promise me that I will be raised again whereas generations have passed away before me?” And they both seek Allah’s help and say to him, “May you be ruined, accept faith! Indeed Allah’s promise is true”; he therefore answers, “This is nothing except stories of former people.”"
          ],
          "en.arberry": [
            "But he who says to his father and his mother, 'Fie upon you! Do you promise me that I shall be brought forth, when already generations have passed away before me?' while they call upon God for succour -- 'Woe upon thee! Believe; surely God's promise is true'; then he says, 'This is naught but the fairy-tales of the ancients' --"
          ],
          "en.daryabadi": [
            "And he who saith Unto his parents: fie upon you both! threaten me ye that I shall be taken forth, whereas generations have passed away before me? and the twain implore Allah's assistance woe Unto thee! come to believe! verily the promise of Allah is true; yet he saith: naught is this but fables of the ancients.\""
          ],
          "en.hilali": [
            "But he who says to his parents: \"Fie upon you both! Do you hold out the promise to me that I shall be raised up (again) when generations before me have passed away (without rising)?\" While they (father and mother) invoke Allah for help (and rebuke their son): \"Woe to you! Believe! Verily, the Promise of Allah is true.\" But he says: \"This is nothing but the tales of the ancient.\""
          ],
          "en.itani": [
            "As for him who says to his parents, “Enough of you! Are you promising me that I will be raised up, when generations have passed away before me?” While they cry for God’s help, “Woe to you! Believe! The promise of God is true!” But he says, “These are nothing but tales of the ancients.”"
          ],
          "en.maududi": [
            "But he who says to his parents: “Fie on you! Do you threaten me that I shall be resurrected, although myriad generations have passed away before me (and not one of them was resurrected)?” The parents beseech Allah (and say to their child): “Woe to you, have faith. Surely Allah's promise is true.” But he says: “All this is nothing but fables of olden times.”"
          ],
          "en.mubarakpuri": [
            "But he who says to his parents: \"Uff to you! Do you promise me that I will be raised up when generations before me have passed\" While they invoke Allah for help: \"Woe to you! Believe! Verily, the promise of Allah is true.\" But he says: \"This is nothing but the legends of the ancient.\""
          ],
          "en.pickthall": [
            "And whoso saith unto his parents: Fie upon you both! Do ye threaten me that I shall be brought forth (again) when generations before me have passed away? And they twain cry unto Allah for help (and say): Woe unto thee! Believe! Lo! the promise of Allah is true. But he saith: This is naught save fables of the men of old:"
          ],
          "en.qarai": [
            "As for him who says to his parents, ‘Fie on you! Do you promise me that I shall be raised [from the dead] when generations have passed away before me?’ And they invoke Allah’s help [and say]: ‘Woe to you! Believe! Indeed Allah’s promise is true.’ But he says, ‘These are nothing but myths of the ancients.’"
          ],
          "en.qaribullah": [
            "But he who says to his father and his mother, 'Fie on you! Do you promise me that I shall be brought forth, when entire generations have passed away before me' Yet they supplicate to Allah for help 'Woe to you! Believe, surely the promise of Allah is true' Then he says: 'This is nothing but fairytales of the ancients'"
          ],
          "en.sahih": [
            "But one who says to his parents, \"Uff to you; do you promise me that I will be brought forth [from the earth] when generations before me have already passed on [into oblivion]?\" while they call to Allah for help [and to their son], \"Woe to you! Believe! Indeed, the promise of Allah is truth.\" But he says, \"This is not but legends of the former people\" -"
          ],
          "en.sarwar": [
            "There are people who say to their parents, \"Fie upon you! Are you telling us that we shall be raised from our graves? So many people have died before us and (none of them have been raised)\" Their parents plead to God and say to their child, \"Woe to you! Have faith; the promise of God is certainly true\" They reply, \"What you say is only ancient legends\"."
          ],
          "en.shakir": [
            "And he who says to his parents: Fie on you! do you threaten me that I shall be brought forth when generations have already passed away before me? And they both call for Allah's aid: Woe to you! believe, surely the promise of Allah is true. But he says: This is nothing but stories of the ancients."
          ],
          "en.transliteration": [
            "Wa<b>a</b>lla<u>th</u>ee q<u>a</u>la liw<u>a</u>lidayhi offin lakum<u>a</u> ataAAid<u>a</u>ninee an okhraja waqad khalati alquroonu min qablee wahum<u>a</u> yastagheeth<u>a</u>ni All<u>a</u>ha waylaka <u>a</u>min inna waAAda All<u>a</u>hi <u>h</u>aqqun fayaqoolu m<u>a</u> h<u>atha</u> ill<u>a</u> as<u>at</u>eeru alawwaleen<b>a</b>"
          ],
          "en.wahiduddin": [
            "But he who says to his parents, \"Shame upon you! Do you threaten me with being taken out of the grave after death while many a generation has passed away before me and none has risen from among them?\" The parents both cry for God's help and say to him, \"Believe! Alas for you! God's promise is true.\" But he says, \"These are nothing but ancient fables.\""
          ],
          "en.yusufali": [
            "But (there is one) who says to his parents, \"Fie on you! Do ye hold out the promise to me that I shall be raised up, even though generations have passed before me (without rising again)?\" And they two seek Allah's aid, (and rebuke the son): \"Woe to thee! Have faith! for the promise of Allah is true.\" But he says, \"This is nothing but tales of the ancients!\""
          ],
          "fa.ansarian": [
            "و کسی که به پدر و مادرش گفت: اُف بر شما! [من از شما متنفر و دلتنگم]، آیا به من وعده می دهید که [پس از مرگ] زنده خواهم شد، در حالی که پیش از من اقوام بسیاری در گذشتند، [و هیچ کدام از آنان زنده نشدند]. و آن دو همواره [برای بازگشت فرزندشان] از خدا یاری می خواهند [و به فرزندشان می گویند:] وای بر تو ایمان بیاور، بی تردید وعده خدا [درباره سعادت و رستگاری مؤمنان در قیامت و شقاوت و بدبختی کافران] حق است. [ولی او در پاسخشان] می گوید: این [وعده ها] جز افسانه های گذشتگان نیست!!"
          ],
          "fa.ayati": [
            "و آن كه به پدر و مادرش گفت: اف بر شما، آيا به من وعده مى‌دهيد كه از گورم برخيزانند و حال آنكه مردمى پيش از من بوده‌اند كه برنخاسته‌اند؟ و آن دو به درگاه خدا استغاثه مى‌كنند و گويند: واى بر تو ايمان بياور كه وعده خدا حق است. مى‌گويد: اينها چيزى جز همان افسانه پيشينيان نيست."
          ],
          "fa.bahrampour": [
            "و آن كه به پدر و مادر خود گفت: اف بر شما! آيا به من وعده مى‌دهيد كه [از قبر] بيرون آورده مى‌شوم و حال آن كه پيش از من نسل‌ها گذشتند [و برنخاستند]، و آن دو به [درگاه‌] خدا زارى مى‌كنند كه: واى بر تو! ايمان بياور، وعده‌ى خدا حق است، و او پاسخ مى‌دهد: ا"
          ],
          "fa.fooladvand": [
            "و آن كس كه به پدر و مادر خود گويد: «اف بر شما، آيا به من وعده مى‌دهيد كه زنده خواهم شد و حال آنكه پيش از من نسلها سپرى [و نابود] شدند.» و آن دو به [درگاه‌] خدا زارى مى‌كنند: «واى بر تو، ايمان بياور. وعده [و تهديد] خدا حق است.» و[لى پسر] پاسخ مى‌دهد: «اينها جز افسانه‌هاى گذشتگان نيست.»"
          ],
          "fa.ghomshei": [
            "و (چقدر ناخلف است) فرزندی که پدر و مادر را گفت: افّ بر شما باد، آیا به من وعده می‌دهید که پس از مرگ مرا زنده کرده و از قبر بیرون می‌آرند در صورتی که پیش از من گروه و طوایف بسیاری رفتند (و یکی باز نیامد)؟ آن گاه پدر و مادر به خداست غاثه کنند (که پروردگارا، تو فرزند ما را هدایت کن و به او گویند) که وای بر تو، ایمان بیار، البته وعده خدا بر حق و حقیقت است، باز (آن نا اهل فرزند) گوید: این سخنان جز افسانه و اوهام پیشینیان نیست."
          ],
          "fa.khorramdel": [
            "کسی که به پدر و مادرش (که او را دعوت به ایمان و باور به آخرت می‌کنند) می‌گوید: وای بر شما! آیا به من خبر می‌دهید که من (زنده گردانده می‌شوم و از گور) بیرون آورده می‌شوم؟ در حالی که پیش از من اقوام و ملّتهائی از جهان رفته‌اند (و هرگز زنده نشده‌اند و به زندگی دوباره برنگشته‌اند). آنان پیوسته خدا را به یاری می‌خوانند (و به سبب گناهان زیاد و سخنان کفرآمیزش، خدایا خدایا می‌کنند، و فرزندشان را به ایمان دعوت می‌نمایند و می‌گویند:) وای بر تو! وعده‌ی خدا حق است، ایمان بیاور. او می‌گوید: این سخنها چیزی جز افسانه‌های پیشینیان نیست. [[«الَّذِی قَالَ لِوَالِدَیْهِ»: آن کسی که به پدر و مادر خود گفت. مراد شخص معیّنی نیست. بلکه مراد همه کسانی است که چنین صفاتی داشته باشند. یعنی ناباور و پرخاشگر و یاوه‌سرا باشند. «خَلَتْ»: گذشته است. رفته است. «الْقُرُون»: قومها و ملّتها و نسلها (نگا: یونس / 13، هود / 116، اسراء / 17). «هُمَا یَسْتَغِیثَانِ اللهَ»: آنان خدا را به کمک و یاری می‌طلبند. ایشان به سبب سخنان کفرآمیز و گناه آلود او، خدایا خدایا می‌کنند و از خدا می‌خواهند او را به پذیرش دین و ایمان رهنمود فرماید.]]"
          ],
          "fa.khorramshahi": [
            "و کسی که به پدر و مادرش می‌گفت اف بر شما آیا به من وعده می‌دهید که [از گور زنده‌] بیرون آورده شوم، حال آنکه نسلهای [بسیاری‌] پیش از من بوده‌اند [و زنده نشده‌اند]، و آن دو به درگاه خداوند استغاثه می‌کنند [و به او می‌گویند] وای بر تو، ایمان بیاور بی‌گمان وعده الهی راست است، و [او] گوید این جز افسانه‌های پیشینیان نیست‌"
          ],
          "fa.makarem": [
            "و کسی که به پدر و مادرش می‌گوید: «اف بر شما! آیا به من وعده می‌دهید که من روز قیامت مبعوث می‌شوم؟! در حالی که پیش از من اقوام زیادی بودند (و هرگز مبعوث نشدند)! و آن دو پیوسته فریاد می‌کشند و خدا را به یاری می‌طلبند که: وای بر تو، ایمان بیاور که وعده خدا حق است امّا او پیوسته می‌گوید:» اینها چیزی جز افسانه‌های پیشینیان نیست!"
          ],
          "fa.moezzi": [
            "و آن که گفت به پدر و مادر خویش وای بر شما (آوخ از شما) آیا وعده دهیدم (بیم دهیدم) که برون آورده شوم حالی که گذشتند قرنها پیش از من و آنان (پدر و مادر) به فریاد می‌خواندند خدا را که وای بر تو ایمان آر زیرا وعده خدا است حق پس گفت نیست این جز افسانه‌های پیشینیان‌"
          ],
          "fa.mojtabavi": [
            "و آن كه به پدر و مادرش [آنگاه كه او را به ايمان به آخرت مى‌خواندند] گفت: اف بر شما، آيا به من وعده مى‌دهيد كه [از گور] بيرون آورده شوم و حال آنكه پيش از من مردمان بسيار بگذشته‌اند [و كسى باز نيامده است‌]؟! و آن دو از خدا فرياد مى‌خواستند [و به فرزند كافر خود مى‌گفتند:] واى بر تو، ايمان بيار، همانا وعده خدا- روز رستاخيز- راست است و او مى‌گفت: اين [وعده‌] جز افسانه‌هاى پيشينيان نيست"
          ],
          "fa.sadeqi": [
            "و آن کس که به پدر و مادر خود گفت: «اف بر شما! آیا به من وعده می‌دهید که (از گور) برون خواهم شد؟ و حال آنکه همواره پیش از من نسل‌ها سپری (و نابود) شده‌اند.» در حالی که آن دو خدا را به یاری همی طلبند (‌گویند): « وای بر تو! ایمان بیاور. به‌راستی وعده‌‌ی (عذاب) خدا حق است‌.» پس پسر می‌گوید: «این‌ها جز افسانه‌های پراکنده‌ی گذشتگان نخستین نیست.»"
          ]
        }
      },
      {
        "index": 4528,
        "local_index": 18,
        "part_type": "Verse",
        "path": "/books/quran:46:18",
        "text": [
          "أُولٰئِکَ‌ الَّذِينَ‌ حَقَ‌ عَلَيْهِمُ‌ الْقَوْلُ‌ فِي‌ أُمَمٍ‌ قَدْ خَلَتْ‌ مِنْ‌ قَبْلِهِمْ‌ مِنَ‌ الْجِنِ‌ وَ الْإِنْسِ‌ إِنَّهُمْ‌ کَانُوا خَاسِرِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They are those on whom the sentence of God would be justified as on communities of jinns and men before them. They will surely perish."
          ],
          "en.ahmedraza": [
            "It is these upon whom the Word has proved true, among the nations that passed away before them, of jinns and men; indeed they were losers."
          ],
          "en.arberry": [
            "such men are they against whom has been realized the Word concerning nations that passed away before them, men and jinn alike; they were losers."
          ],
          "en.daryabadi": [
            "Those are they upon whom hath been justified the saying about the communities of the Jinn and mankind who have passed away before them; verily they are ever the losers."
          ],
          "en.hilali": [
            "They are those against whom the Word (of torment) is justified among the previous generations of jinns and mankind that have passed away. Verily! They are ever the losers."
          ],
          "en.itani": [
            "Those are they upon whom the sentence is justified, among the communities that have passed away before them, of jinn and humans. They are truly losers."
          ],
          "en.maududi": [
            "It is against such that Allah's sentence (of punishment) has become due. They will join the communities of humans and jinn that have preceded them. Verily all of them will court utter loss."
          ],
          "en.mubarakpuri": [
            "They are those against whom the Word (of torment) has justified among the previous generations of Jinn and mankind that have passed away. Verily, they are ever the losers."
          ],
          "en.pickthall": [
            "Such are those on whom the Word concerning nations of the jinn and mankind which have passed away before them hath effect. Lo! they are the losers."
          ],
          "en.qarai": [
            "Such are the ones against whom the word has become due, along with the nations of jinn and humans that have passed away before them. They were the losers."
          ],
          "en.qaribullah": [
            "Such are they against whom the statement is realized concerning the nations of humans and jinn alike that passed away before them; they were the losers."
          ],
          "en.sahih": [
            "Those are the ones upon whom the word has come into effect, [who will be] among nations which had passed on before them of jinn and men. Indeed, they [all] were losers."
          ],
          "en.sarwar": [
            "Such people will be subject to the punishment of God, which was also decreed for many human beings and jinn before them. These people are certainly lost."
          ],
          "en.shakir": [
            "These are they against whom the word has proved true among nations of the jinn and the men that have already passed away before them; surely they are losers."
          ],
          "en.transliteration": [
            "Ol<u>a</u>ika alla<u>th</u>eena <u>h</u>aqqa AAalayhimu alqawlu fee umamin qad khalat min qablihim mina aljinni wa<b>a</b>linsi innahum k<u>a</u>noo kh<u>a</u>sireen<b>a</b>"
          ],
          "en.wahiduddin": [
            "It is against such as these that the word of God has proved true, along with all the communities that went before them, jinns and humans: surely they are losers."
          ],
          "en.yusufali": [
            "Such are they against whom is proved the sentence among the previous generations of Jinns and men, that have passed away; for they will be (utterly) lost."
          ],
          "fa.ansarian": [
            "اینانند کسانی که [به خاطر انکار وعده های حق] فرمان عذاب درباره آنان در زمره گروه هایی از جن و انس که پیش از آنان در گذشتند، محقق و ثابت شده است؛ زیرا آنان زیانکار بودند."
          ],
          "fa.ayati": [
            "در باره اينان همان سخن كه در باره امتهاى پيشين از جن و انس گفته شده بود به حقيقت مى‌پيوندد. اينان زيان‌كنندگانند."
          ],
          "fa.bahrampour": [
            "آنان كسانى‌اند كه وعده‌ى عذاب بر آنها در [زمره‌ى‌] گروه‌هايى از جنّ و انس كه پيش از آنها بگذشتند حتمى شد كه بى‌ترديد آنها زيانكار بودند"
          ],
          "fa.fooladvand": [
            "آنان كسانى‌اند كه گفتار [خدا] عليه ايشان -همراه با امتهايى از جنيان و آدميان كه پيش از آنان روزگار به سر بردند- به حقيقت پيوست، بى‌گمان آنان زيانكار بودند."
          ],
          "fa.ghomshei": [
            "اینان در میان طوایف بسیاری از جن و انس که از این پیش (به کفر) مردند کسانی هستند که وعده عذاب خدا بر آنها حتم است و اینها به حقیقت زیانکاران عالمند."
          ],
          "fa.khorramdel": [
            "آنان کسانیند که فرمان عذاب الهی راجع بدیشان و همه‌ی ملّتهای انسان و پری پیش از ایشان صادر شده است. واقعاً آنان زیانمندند. (چرا که آخرت را باخته‌اند). [[«حَقَّ عَلَیْهِمُ الْقَوْلُ فِی أُمَمٍ»: (نگا: فصّلت / 25).]]"
          ],
          "fa.khorramshahi": [
            "اینانند که در میان امتهای جن و انس که پیش از ایشان بوده‌اند، حکم [عذاب‌] بر آنان تعلق گرفته است، اینانند که زیانکارند"
          ],
          "fa.makarem": [
            "آنها کسانی هستند که فرمان عذاب درباره آنان همراه اقوام (کافری) که پیش از آنان از جنّ و انس بودند مسلّم شده، چرا که همگی زیانکار بودند!"
          ],
          "fa.moezzi": [
            "آنانند که راست آمد (فرود آمد) بر ایشان سخن در ملّتهائی که گذشتند پیش از ایشان از پری و آدمی که ایشانند همانا زیانکاران‌"
          ],
          "fa.mojtabavi": [
            "اينانند كه آن گفتار- وعده عذاب- بر آنان در زمره گروه‌هايى از پريان و آدميان كه پيش از آنها بگذشتند سزا گشت، همانا ايشان زيانكار بودند."
          ],
          "fa.sadeqi": [
            "اینان کسانی هستند که گفته‌ی (خدا) علیه ایشان - همراه با امّت‌هایی از جنّیان و امت‌هایی که همواره پیش از آنان (روزگارانی) به سر بردند - به حقیقت پیوست. بی‌گمان آنان زیانکاران بوده‌اند."
          ]
        }
      },
      {
        "index": 4529,
        "local_index": 19,
        "part_type": "Verse",
        "path": "/books/quran:46:19",
        "text": [
          "وَ لِکُلٍ‌ دَرَجَاتٌ‌ مِمَّا عَمِلُوا وَ لِيُوَفِّيَهُمْ‌ أَعْمَالَهُمْ‌ وَ هُمْ‌ لاَ يُظْلَمُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Each will have a position in accordance with his deeds; and no wrong will be done to them."
          ],
          "en.ahmedraza": [
            "And for all persons are ranks according to their deeds; and so that He may repay them in full for their deeds, and they will not be wronged."
          ],
          "en.arberry": [
            "All shall have their degrees, according to what they have wrought, and that He may pay them in full for their works, and they not being wronged."
          ],
          "en.daryabadi": [
            "And for each are ranks according to that which they have worked, that He may repay them in full for their works; and they shall not be wronged."
          ],
          "en.hilali": [
            "And for all, there will be degrees according to that which they did, that He (Allah) may recompense them in full for their deeds. And they will not be wronged."
          ],
          "en.itani": [
            "There are degrees for everyone, according to what they have done, and He will repay them for their works in full, and they will not be wronged."
          ],
          "en.maududi": [
            "Of these all have ranks according to their deeds so that Allah may fully recompense them for their deeds. They shall not be wronged."
          ],
          "en.mubarakpuri": [
            "And for all, there will be degrees according to that which they did, so that He might fully recompense for their deeds. And they will not be wronged."
          ],
          "en.pickthall": [
            "And for all there will be ranks from what they do, that He may pay them for their deeds; and they will not be wronged."
          ],
          "en.qarai": [
            "For everyone there are degrees [of merit] pertaining to what he has done: He will recompense them fully for their works, and they will not be wronged."
          ],
          "en.qaribullah": [
            "Each shall have their degrees, according to what they have done, so that He will recompense them for their works, and they shall not be wronged."
          ],
          "en.sahih": [
            "And for all there are degrees [of reward and punishment] for what they have done, and [it is] so that He may fully compensate them for their deeds, and they will not be wronged."
          ],
          "en.sarwar": [
            "Everyone will have a position proportionate to the degree of his deeds. Finally, God will recompense them for their deeds and they will not be wronged."
          ],
          "en.shakir": [
            "And for all are degrees according to what they did, and that He may pay them back fully their deeds and they shall not be wronged."
          ],
          "en.transliteration": [
            "Walikullin daraj<u>a</u>tun mimm<u>a</u> AAamiloo waliyuwaffiyahum aAAm<u>a</u>lahum wahum l<u>a</u> yu<i><u>th</u></i>lamoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "All will be ranked according to their deeds. We will requite them in full for their actions and they will not be wronged."
          ],
          "en.yusufali": [
            "And to all are (assigned) degrees according to the deeds which they (have done), and in order that (Allah) may recompense their deeds, and no injustice be done to them."
          ],
          "fa.ansarian": [
            "برای هر کدام [از گروه مؤمنان و کافران] بر پایه اعمالی که انجام داده اند درجاتی است [که در آن قرار می گیرند]، و تا خدا اعمالشان را به طور کامل به آنان بدهد؛ و آنان مورد ستم قرار نمی گیرند."
          ],
          "fa.ayati": [
            "و هر يك را نسبت به كارى كه كرده است درجتى است تا خدا پاداش كارهايشان را به تمامى بدهد و به آنان ستم نمى‌شود."
          ],
          "fa.bahrampour": [
            "و براى هر يك [از مؤمن و كافر] بر حسب آنچه انجام داده‌اند درجاتى است، و تا [خدا پاداش‌] اعمالشان را تمام بدهد، و آنها مورد ستم واقع نخواهند شد"
          ],
          "fa.fooladvand": [
            "و براى هر يك در [نتيجه‌] آنچه انجام داده‌اند درجاتى است، و تا [خدا پاداش‌] اعمالشان را تمام بدهد؛ و آنان مورد ستم قرار نخواهند گرفت."
          ],
          "fa.ghomshei": [
            "و برای تمام (مردم مؤمن و کافر) به مقتضای اعمالشان درجاتی معین است (در عالم قیامت تا عدل خدا درباره آنها آشکار شود) و تا همه را به پاداش و مزد اعمال خود کاملا برساند و هیچ ستمی به آنها نخواهد شد."
          ],
          "fa.khorramdel": [
            "همه (ی مؤمنان و کافران) دارای درجاتی (و درکاتی) هستند بر طبق اعمالی که انجام داده‌اند، تا بدین‌وسیله خداوند جزا و سزای رفتار و کردارشان را به تمام و کمال و بی کم و کاست بدهد و هیچ گونه ستمی بدیشان نشود. [[«لِکُلٍّ»: برای هر یک از دو گروه کافر و مؤمن. «دَرَجَاتٌ»: از باب تغلیب، مراد هم درجات بهشتیان و هم درکات دوزخیان است. «لِیُوَفِّیَهُمْ أَعْمَالَهُمْ وَ هُمْ لایُظْلَمُونَ»: حرف (ل) برای تعلیل است. (یُوَفِّیَهُمْ) منصوب به (أَنْ) مقدّر است. جار و مجرور متعلّق به محذوفی است و تقدیر چنین است: جَازَاهُمُ اللهُ بِذلِکَ لِیُوَفِّیَهُمْ. حرف (و) حالیّه، و جمله (هُمْ لا یُظْلَمُونَ) حال مؤکّده است.]]"
          ],
          "fa.khorramshahi": [
            "و هر یک را بر حسب آنچه کرده‌اند درجاتی است، و تا سرانجام جزای اعمالشان را به تمام و کمال بدهد، و بر ایشان ستم نرود"
          ],
          "fa.makarem": [
            "و برای هر کدام از آنها درجاتی است بر طبق اعمالی که انجام داده‌اند، تا خداوند کارهایشان را بی‌کم و کاست به آنان تحویل دهد؛ و به آنها هیچ ستمی نخواهد شد!"
          ],
          "fa.moezzi": [
            "و هر کدام را پایه‌هائی است از آنچه عمل کردند و تا سراسر دهد بدیشان کردارهای ایشان را و ایشان ستم نشوند"
          ],
          "fa.mojtabavi": [
            "و هر كدام [از دو گروه مؤمن و كافر] را پايه‌هايى است از آنچه كرده‌اند [تا عدل خدا در باره آنها آشكار شود] و تا به آنان [پاداش‌] كارهايشان را تمام بدهد و به ايشان ستم نخواهد شد."
          ],
          "fa.sadeqi": [
            "و برای هر یک در نتیجه‌ی آنچه انجام داده‌اند درجاتی است و تا (خدا) اعمالشان را بهره‌ای وافی دهد؛ حال آنکه آنان ستم (هم) نمی‌شوند."
          ]
        }
      },
      {
        "index": 4530,
        "local_index": 20,
        "part_type": "Verse",
        "path": "/books/quran:46:20",
        "text": [
          "وَ يَوْمَ‌ يُعْرَضُ‌ الَّذِينَ‌ کَفَرُوا عَلَى‌ النَّارِ أَذْهَبْتُمْ‌ طَيِّبَاتِکُمْ‌ فِي‌ حَيَاتِکُمُ‌ الدُّنْيَا وَ اسْتَمْتَعْتُمْ‌ بِهَا فَالْيَوْمَ‌ تُجْزَوْنَ‌ عَذَابَ‌ الْهُونِ‌ بِمَا کُنْتُمْ‌ تَسْتَکْبِرُونَ‌ فِي‌ الْأَرْضِ‌ بِغَيْرِ الْحَقِ‌ وَ بِمَا کُنْتُمْ‌ تَفْسُقُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "The day the unbelievers are brought to the Fire, (it will be said): \"You wasted all your good deeds in the life of the world, and enjoyed them to the full. You will now be requited with a shameful punishment, for you behaved with arrogance for no reason on the earth, and acted wickedly.\""
          ],
          "en.ahmedraza": [
            "And on the day when the disbelievers will be presented upon the fire; it will be said to them, “You have wasted your portion of the good things in the life of this world and enjoyed them; so this day you will be repaid with the disgraceful punishment, the recompense of your wrongfully priding yourself in the land, and because you used to disobey.”"
          ],
          "en.arberry": [
            "Upon the day when the unbelievers are exposed to the Fire: 'You dissipated your good things in your present life, and you took your enjoyment in them; therefore today you shall be recompensed with the chastisement of humiliation for that you waxed proud in the earth without right, and for your ungodliness."
          ],
          "en.daryabadi": [
            "And on the Day whereon those who disbelieve shall be placed before the Fire: ye made away with your good things in your life of the world, and ye enjoyed yourselves therewith so Today ye shall be requited with the torment of ignominy, for that ye have been growing stiff-necked on the earth without justification, and for that ye have been transgressing."
          ],
          "en.hilali": [
            "On the Day when those who disbelieve (in the Oneness of Allah Islamic Monotheism) will be exposed to the Fire (it will be said): \"You received your good things in the life of the world, and you took your pleasure therein. Now this Day you shall be recompensed with a torment of humiliation, because you were arrogant in the land without a right, and because you used to rebel and disobey (Allah)."
          ],
          "en.itani": [
            "On the Day when the faithless will be paraded before the Fire: “You have squandered your good in your worldly life, and you took pleasure in them. So today you are being repaid with the torment of shame, because of your unjust arrogance on earth, and because you used to sin.”"
          ],
          "en.maududi": [
            "And on the Day when the unbelievers will be exposed to the Fire, they will be told: “You have exhausted your share of the bounties in the life of the world, and you took your fill of enjoyments. So, degrading chastisement shall be yours on this Day for you waxed arrogant in the earth without justification and acted iniquitously.”"
          ],
          "en.mubarakpuri": [
            "On the Day when those who disbelieve will be exposed to the Fire (it will be said): \"You received your good things in the life of the world, and you took your pleasure therein. Today, you will be recompensed with the torment of extreme humiliation, because you were arrogant upon the earth without a right, and because you used to rebel against Allah's command."
          ],
          "en.pickthall": [
            "And on the day when those who disbelieve are exposed to the Fire (it will be said): Ye squandered your good things in the life of the world and sought comfort therein. Now this day ye are rewarded with the doom of ignominy because ye were disdainful in the land without a right, and because ye used to transgress."
          ],
          "en.qarai": [
            "The day when the faithless are exposed to the Fire, [they will be told,] ‘You have exhausted your good things in the life of the world and enjoyed them. So today you will be requited with a humiliating punishment for your acting arrogantly in the earth unduly, and because you used to transgress.’"
          ],
          "en.qaribullah": [
            "Upon the Day when the unbelievers are brought before the Fire, (We shall say to them): 'You squandered your good things in your earthly life and took your fill of enjoyment in them, therefore today you shall be recompensed with a humiliating punishment, because you were unrightfully proud in the earth and for that you were debauchers'"
          ],
          "en.sahih": [
            "And the Day those who disbelieved are exposed to the Fire [it will be said], \"You exhausted your pleasures during your worldly life and enjoyed them, so this Day you will be awarded the punishment of [extreme] humiliation because you were arrogant upon the earth without right and because you were defiantly disobedient.\""
          ],
          "en.sarwar": [
            "On the day when the disbelievers will be exposed to the fire, they will be told, \"You have spent your happy days during your worldly life and enjoyed them. On this day you will suffer a humiliating torment for your unreasonably arrogant manners on earth and for the evil deeds which you have committed\"."
          ],
          "en.shakir": [
            "And on the day when those who disbelieve shall be brought before the fire: You did away with your good things in your life of the world and you enjoyed them for a while, so today you shall be rewarded with the punishment of abasement because you were unjustly proud in the land and because you transgressed."
          ],
          "en.transliteration": [
            "Wayawma yuAAra<u>d</u>u alla<u>th</u>eena kafaroo AAal<u>a</u> a<b>l</b>nn<u>a</u>ri a<u>th</u>habtum <u>t</u>ayyib<u>a</u>tikum fee <u>h</u>ay<u>a</u>tikumu a<b>l</b>dduny<u>a</u> wa<b>i</b>stamtaAAtum bih<u>a</u> fa<b>a</b>lyawma tujzawna AAa<u>tha</u>ba alhooni bim<u>a</u> kuntum tastakbiroona fee alar<u>d</u>i bighayri al<u>h</u>aqqi wabim<u>a</u> kuntum tafsuqoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "On the Day when those who deny the truth are brought before the Fire, it will be said to them, \"You have had the good things of the life of this world, and you enjoyed them. Now this Day you shall be requited with humiliating punishment, because you were arrogant in the land without justification, and because you acted rebelliously.\""
          ],
          "en.yusufali": [
            "And on the Day that the Unbelievers will be placed before the Fire, (It will be said to them): \"Ye received your good things in the life of the world, and ye took your pleasure out of them: but today shall ye be recompensed with a Penalty of humiliation: for that ye were arrogant on earth without just cause, and that ye (ever) transgressed.\""
          ],
          "fa.ansarian": [
            "و روزی که کافران را بر آتش عرضه کنند [به آنان گویند:] نعمت های پاکیزه خود را [که می توانست وسیله آبادی آخرتتان باشد] در زندگی دنیایتان مصرف کردید و [همانجا] از آن برخوردار شدید؛ بنابراین امروز به سبب اینکه به ناحق در زمین تکبّر می ورزیدید و در برابر اینکه همواره نافرمانی می کردید با عذاب خفّت بار کیفر می یابید."
          ],
          "fa.ayati": [
            "و روزى كه كافران را بر آتش عرضه كنند: در زندگى دنيوى از چيزهاى پاكيزه و خوش بهره‌مند شديد، امروز به عذاب خوارى پاداشتان مى‌دهند. و اين بدان سبب است كه در زمين بى هيچ حقى گردنكشى مى‌كرديد و عصيانگرى پيش گرفته بوديد."
          ],
          "fa.bahrampour": [
            "و آن روز كه كافران بر آتش عرضه شوند، [به آنها گفته شود:] نعمت‌هاى پاكيزه [و خوشى‌هاى‌] خود را در زندگى دنيايتان [از بين‌] برديد و از آنها برخوردار شديد، پس امروز به سزاى آن كه در زمين به ناحق سركشى مى‌كرديد و به سبب آن كه نافرمانى مى‌كرديد به عذابى خ"
          ],
          "fa.fooladvand": [
            "و آن روز كه آنهايى را كه كفر ورزيده‌اند، بر آتش عرضه مى‌دارند [به آنان مى گويند:] «نعمتهاى پاكيزه خود را در زندگى دنيايتان [خودخواهانه‌] صَرف كرديد و از آنها برخوردار شديد؛ پس امروز به [سزاى ]آنكه در زمين بناحق سركشى مى‌نموديد و به سبب آنكه نافرمانى مى‌كرديد، به عذاب خفت‌[آور] كيفر مى‌يابيد.»"
          ],
          "fa.ghomshei": [
            "و روزی که کافران را بر آتش دوزخ عرضه کنند (فرشتگان قهر و عذاب به آنها گویند) شما (لذّات بهشتی و) خوشیهایتان را در زندگانی دنیا (به شهوت رانی و ظلم و عصیان) از بین بردید و بدان لذّات دنیوی بر خوردار و دلباخته بودید، پس امروز به عذاب ذلّت و خواری مجازات می‌شوید چون در زمین به ناحق تکبر می‌کردید و راه فسق و تبهکاری پیش می‌گرفتید."
          ],
          "fa.khorramdel": [
            "روزی (را خاطرنشان ساز که در آن) کافران به آتش دوزخ نزدیک گردانده می‌شوند و به آن عرضه می‌گردند. (در این وقت بدیشان گفته می‌شود:) شما لذائذ و خوشیهای خود را در زندگی دنیای خویش برده‌اید و کام برگرفته‌اید (و برای امروز چیزی باقی نگذاشته‌اید. لذا حالا بهره‌ای از نعمتها و خوشیها ندارید، و) امروزه شما به سبب استکباری که به ناحق در زمین می‌کردید، و به علّت گناهان و تمرّدی که می‌ورزیدید، با عذاب خوارکننده و ذلّت‌باری جزا داده می‌شوید. [[«یُعْرَضُ»: عرضه می‌گردند. «أَذْهَبْتُمْ»: برده‌اید. «عَذَابَ الْهُونِ»: (نگا: انعام / 93، فصّلت / 17). «کُنتُمْ تَسْتَکْبِرُونَ»: تکبّر می‌ورزیدید. خویشتن را بالاتر از آن می‌دیدید که ایمان بیاورید و دین خدا را بپذیرید.]]"
          ],
          "fa.khorramshahi": [
            "و روزی که کافران را به نزدیک آتش [دوزخ‌] بدارند [و گویند] خیر و خوشیهایتان را در زندگانی دنیویتان به پایان بردید، و از آن بهره‌مند شدید، پس امروز به خاطر آنکه در روی زمین به ناحق استکبار می‌ورزیدید و به خاطر آنکه نافرمانی می‌کردید، عذاب خوارکننده را کیفر برید"
          ],
          "fa.makarem": [
            "آن روز که کافران را بر آتش عرضه می‌کنند (به آنها گفته می‌شود:) از طیّبات و لذائذ در زندگی دنیا خود استفاده کردید و از آن بهره گرفتید؛ اما امروز عذاب ذلّت‌بار بخاطر استکباری که در زمین بناحق کردید و بخاطر گناهانی که انجام می‌دادید؛ جزای شما خواهد بود!"
          ],
          "fa.moezzi": [
            "و روزی که عرضه شوند آنان که کفر ورزیدند بر آتش بردید (به پایان رسانیدید) خوشیهای خویش را در زندگانی دنیای خویش و کامیاب شدید بدانها پس امروز کیفر داده شوید عذاب خواری را بدانچه بودید برتری می‌جستید در زمین به ناروا و بدانچه بودید نافرمانی می‌کردید"
          ],
          "fa.mojtabavi": [
            "و روزى كه كافران را بر آتش عرضه كنند، [به آنان گفته شود:] خوشيها و لذتهاى خود را در زندگى دنياتان برديد و بدانها بهره‌مند شديد، پس امروز عذاب خوارى پاداش داده مى‌شويد به سزاى آنكه در زمين به ناروا گردنكشى مى‌نموديد و به كيفر آنكه از فرمان [حق‌] بيرون مى‌شديد."
          ],
          "fa.sadeqi": [
            "و (به یاد آور) روزی را که آنهایی که کفر ورزیده‌اند، بر آتش نمایش داده می‌شوند (به آنان گفته شود:) «نعمت‌های پاکیزه‌ی خود را در زندگی دنیاتان (خودخواهانه) از میان بردید و با آنها برخوردار شدید؛ پس امروز به (سزای) آنچه در زمین به ناحق سرکشی می‌نموده‌اید و به آنچه نافرمانی می‌کرده‌اید، به عذاب خفّت‌بار گرفتار شوید.»"
          ]
        }
      },
      {
        "index": 4531,
        "local_index": 21,
        "part_type": "Verse",
        "path": "/books/quran:46:21",
        "text": [
          "وَ اذْکُرْ أَخَا عَادٍ إِذْ أَنْذَرَ قَوْمَهُ‌ بِالْأَحْقَافِ‌ وَ قَدْ خَلَتِ‌ النُّذُرُ مِنْ‌ بَيْنِ‌ يَدَيْهِ‌ وَ مِنْ‌ خَلْفِهِ‌ أَلاَّ تَعْبُدُوا إِلاَّ اللَّهَ‌ إِنِّي‌ أَخَافُ‌ عَلَيْکُمْ‌ عَذَابَ‌ يَوْمٍ‌ عَظِيمٍ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Remember (Hud) the brother of 'Ad. When he warned his people in Ahqaf -- though many a warner had come and gone before and after him: \"Do not worship any one but God, for I fear the punishment of an awful day for you,\""
          ],
          "en.ahmedraza": [
            "And remember the fellowman of the tribe of A’ad; when he warned his nation in the Ahqaf* – and indeed Heralds of warning passed away before and after him – that, “Do not worship anyone except Allah; indeed I fear the punishment of a Great Day upon you. (* A country among sand dunes.)"
          ],
          "en.arberry": [
            "And remember the brother of Ad, when he warned his people beside the sand-dunes -- and already warners had passed away alike before him and behind him -- saying, 'Serve none but God! Truly I fear for you the chastisement of a dreadful day."
          ],
          "en.daryabadi": [
            "And remember thou the brother of the Aad when We warned his people in the sandhills - and surely there have passed away warners before him and after him - saying: worship none save Allah, verily I fear for you the torment of a mighty Day."
          ],
          "en.hilali": [
            "And remember (Hud) the brother of 'Ad, when he warned his people in Al-Ahqaf (the curved sand-hills in the southern part of Arabian Peninsula). And surely, there have passed away warners before him and after him (saying): \"Worship none but Allah; truly, I fear for you the torment of a mighty Day.\""
          ],
          "en.itani": [
            "And mention the brother of Aad, as he warned his people at the dunes. Warnings have passed away before him, and after him: “Worship none but God; I fear for you the punishment of a tremendous Day.”"
          ],
          "en.maududi": [
            "Recount to them the story of (Hud), the brother of (the tribe of) 'Ad. Hud warned his people beside the sand-dunes -- and there have been other warners before him and since his time -- saying: “Serve none but Allah. Verily I fear that the chastisement of an awesome day shall come upon you.”"
          ],
          "en.mubarakpuri": [
            "And remember the brother of `Ad, when he warned his people in Al-Ahqaf. And surely, warners had already passed on before him and after him (saying): \"Worship none but Allah; truly, I fear for you the torment of a mighty Day.\""
          ],
          "en.pickthall": [
            "And make mention (O Muhammad) of the brother of A'ad when he warned his folk among the wind-curved sandhills - and verily warners came and went before and after him - saying: Serve none but Allah. Lo! I fear for you the doom of a tremendous Day."
          ],
          "en.qarai": [
            "And mention [Hud] the brother of ‘Ad, when he warned his people at Ahqaf—and warners have passed away before and after him—saying, ‘Do not worship anyone but Allah. Indeed I fear for you the punishment of a tremendous day.’"
          ],
          "en.qaribullah": [
            "Remember Aad's brother who warned his nation in (the valley of) Al Ahqaf. Warners had already preceded and succeeded him saying: 'Worship noneexcept Allah! (he said) 'Indeed, I fear for you the punishment of a Dreadful Day'"
          ],
          "en.sahih": [
            "And mention, [O Muhammad], the brother of 'Aad, when he warned his people in the [region of] al-Ahqaf - and warners had already passed on before him and after him - [saying], \"Do not worship except Allah. Indeed, I fear for you the punishment of a terrible day.\""
          ],
          "en.sarwar": [
            "(Muhammad), recall the brother of the people of Ad, when he warned his people in the valley of al-ahqaf saying, \"There existed many warners before and after him. Do not worship anything other than God. I am afraid for you about the torment of the great Day\"."
          ],
          "en.shakir": [
            "And mention the brother of Ad; when he warned his people in the sandy plains,-- and indeed warners came before him and after him-- saying Serve none but Allah; surely I fear for you the punishment of a grievous day."
          ],
          "en.transliteration": [
            "Wa<b>o</b><u>th</u>kur akh<u>a</u> AA<u>a</u>din i<u>th</u> an<u>th</u>ara qawmahu bi<b>a</b>la<u>h</u>q<u>a</u>fi waqad khalati a<b>l</b>nnu<u>th</u>uru min bayni yadayhi wamin khalfihi all<u>a</u> taAAbudoo ill<u>a</u> All<u>a</u>ha innee akh<u>a</u>fu AAalaykum AAa<u>tha</u>ba yawmin AAa<i><u>th</u></i>eem<b>in</b>"
          ],
          "en.wahiduddin": [
            "Tell of the brother of 'Ad; when he warned his people in the sand dunes -- and indeed warners came and went before him and after him -- saying, \"Worship none but God; surely I fear for you the punishment of an awful Day,\""
          ],
          "en.yusufali": [
            "Mention (Hud) one of 'Ad's (own) brethren: Behold, he warned his people about the winding Sand-tracts: but there have been warners before him and after him: \"Worship ye none other than Allah: Truly I fear for you the Penalty of a Mighty Day.\""
          ],
          "fa.ansarian": [
            "و [سرگذشت هود] برادر قوم عاد را یاد کن، هنگامی که قومش را در سرزمین احقاف بیم داد، و بی تردید بیم دهندگانی پیش از او و پس از او [در آن سرزمین] گذشته بودند که فقط خدا را بپرستید؛ زیرا من بر شما از عذاب روزی بزرگ می ترسم."
          ],
          "fa.ayati": [
            "برادر قوم عاد را به ياد بياور كه چون قوم خود را در احقاف بيم داد -و پيش از او پيامبرانى بودند و رفتند و پس از او پيامبرانى آمدند- كه جز خداى يكتا را نپرستيد كه من از عذاب روزى بزرگ بر شما بيمناكم."
          ],
          "fa.bahrampour": [
            "و برادر عاديان را به ياد آور، آن‌گاه كه قوم خويش را در [سرزمين‌] احقاف هشدار داد، با آن كه پيش از او و پس از او نيز هشدار دهندگانى بودند كه: جز خدا را مپرستيد. واقعا من بر شما از عذاب روزى هولناك مى‌ترسم"
          ],
          "fa.fooladvand": [
            "و برادر عاديان را به ياد آور، آنگاه كه قوم خويش را در ريگستان بيم داد -در حالى كه پيش از او و پس از او [نيز] قطعاً هشداردهندگانى گذشته بودند- كه: «جز خدا را مپرستيد؛ واقعاً من بر شما از عذاب روزى هولناك مى‌ترسم.»"
          ],
          "fa.ghomshei": [
            "و یاد آر حال هود پیغمبر قوم عاد را که چون در سرزمین احقاف امتش را وعظ و اندرز کرد و (از قهر خدا) بترسانید و پیش از هود و بعد از او هم بسیار پیمبر بر انذار خلق آمد. باری هود قومش را گفت: هرگز جز خدای عالم کسی را نپرستید که من بر شما از عذاب روز بزرگ قیامت می‌ترسم."
          ],
          "fa.khorramdel": [
            "(ای محمّد! برای مشرکان مکّه بیان کن سرگذشت هود) برادر (دلسوز و مهربان قوم خود) عاد را. بدان گاه که در سرزمین ریگستان احقاف (واقع در جنوب جزیره‌ی عربستان و نزدیکی یمن) قوم خود را (از عذاب خدا) بیم داد و گفت: جز خداوند یگانه را نپرستید، چرا که از عذاب روز بزرگ، بر شما هراسناکم. پیش از او هم در گذشته‌های نزدیک و دور پیغمبرانی آمده بودند (و مردمان را از عذاب استیصال دنیوی و عقاب اخروی ترسانده بودند). [[«الأحْقَافِ»: نام سرزمینی است در جنوب شرقی جزیرة‌العرب، برخی از باستان‌شناسان، از روی نوشته‌هائی که به دست آمده است، احقاف را در شرق عَقَبه می‌دانند و با إرَم مذکور در قرآن یکی می‌شمارند (نگا: المنتخب). احقاف، از لحاظ لغوی، جمع حِقْف، ریگزار. دارای شنهای روان. «مِن بَیْنِ یَدَیْهِ»: مراد گذشته‌های نزدیک است. یا مراد پیغمبرانی است که هم‌عصر با او بوده و از همان چیزهائی قوم خود را بیم داده‌اند که او بیم داده است. «مِنْ خَلْفِهِ»: مراد گذشته‌های دور است. «عَذَابَ یَوْمٍ عَظِیمٍ»: عذاب ریشه‌کن‌کننده و از میان برنده دنیوی، یا عذاب سخت و طاقت‌فرسای اخروی.]]"
          ],
          "fa.khorramshahi": [
            "و از برادر عادیان [ هود] یاد کن که قومش را در احقاف هشدار داد، و پیشاپیش وی و پس از وی هشداردهندگانی به میان آمده بودند [و گفت‌] جز خداوند را مپرستید، که من بر شما از عذاب روزی سهمگین می‌ترسم‌"
          ],
          "fa.makarem": [
            "(سرگذشت هود) برادر قوم عاد را یاد کن، آن زمان که قومش را در سرزمین «احقاف» بیم داد در حالی که پیامبران زیادی قبل از او در گذشته‌های دور و نزدیک آمده بودند که: جز خدای یگانه را نپرستید! (و گفت:) من بر شما از عذاب روزی بزرگ می‌ترسم!"
          ],
          "fa.moezzi": [
            "و یاد کن برادر عاد را گاهی که ترسانید قومش را در اَحقاف و هر آینه گذشته بودند ترسانندگان از پیش رویش و از پشت سرش که پرستش نکنید جز خدا را همانا می‌ترسم بر شما از عذاب روزی بزرگ‌"
          ],
          "fa.mojtabavi": [
            "و ياد كن برادر قوم عاد- هود- را آنگاه كه قوم خود را در سرزمين احقاف بيم مى‌داد- و پيش از او و پس از او بيم‌كنندگان بگذشتند- كه جز خداى را نپرستيد، كه من بر شما از عذاب روزى بزرگ مى‌ترسم."
          ],
          "fa.sadeqi": [
            "و (هود) برادر عادیان را به یاد آر، چون قوم خویش را در ریگستان‌ها بیم داد - حال آنکه از روبه‌رویش و از پشت سرش همواره هشداردهندگان گذشته‌اند - که: «جز خدا را مپرستید؛ همواره من بر شما از عذاب روزی بزرگ بیمناکم.»"
          ]
        }
      },
      {
        "index": 4532,
        "local_index": 22,
        "part_type": "Verse",
        "path": "/books/quran:46:22",
        "text": [
          "قَالُوا أَ جِئْتَنَا لِتَأْفِکَنَا عَنْ‌ آلِهَتِنَا فَأْتِنَا بِمَا تَعِدُنَا إِنْ‌ کُنْتَ‌ مِنَ‌ الصَّادِقِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They said: \"Have you come to turn us away from our gods? Then bring upon us what you predict for us, if you are a man of truth.\""
          ],
          "en.ahmedraza": [
            "They said, “Have you come to us in order to turn us away from our Gods? Therefore bring upon us what you promise us, if you are truthful.”"
          ],
          "en.arberry": [
            "They said, 'What, hast thou come to pervert us from our gods? Then bring us that thou promisest us, if indeed thou speakest truly.'"
          ],
          "en.daryabadi": [
            "They said: art thou come Unto us that thou mayest turn us aside from our gods? then bring thou upon us that wherewith thou threatenest us, if thou art of the truth-tellers."
          ],
          "en.hilali": [
            "They said: \"Have you come to turn us away from our aliha (gods)? Then bring us that with which you threaten us, if you are one of the truthful!\""
          ],
          "en.itani": [
            "They said, “Did you come to us to divert us from our gods? Then bring us what you threaten us with, if you are being truthful.”"
          ],
          "en.maududi": [
            "They said: “Have you come to us to turn us away from our gods? Then, bring upon us the scourge that you threaten us with. Do so if you are truthful.”"
          ],
          "en.mubarakpuri": [
            "They said: \"Have you come to delude us from our gods Then bring us that with which you threaten us, if you are one of the truthful!\""
          ],
          "en.pickthall": [
            "They said: Hast come to turn us away from our gods? Then bring upon us that wherewith thou threatenest us, if thou art of the truthful."
          ],
          "en.qarai": [
            "They said, ‘Have you come to turn us away from our gods? Then bring us what you threaten us with, if you are truthful."
          ],
          "en.qaribullah": [
            "'Have you come to turn us away from our gods (they replied)? If what you say is true then bring down that which you promise us'"
          ],
          "en.sahih": [
            "They said, \"Have you come to delude us away from our gods? Then bring us what you promise us, if you should be of the truthful.\""
          ],
          "en.sarwar": [
            "They said, \"Have you come to turn us away from our gods? Show us that with which you threaten us if you are truthful\"."
          ],
          "en.shakir": [
            "They said: Have you come to us to turn us away from our gods; then bring us what you threaten us with, if you are of the truthful ones."
          ],
          "en.transliteration": [
            "Q<u>a</u>loo ajitan<u>a</u> litafikan<u>a</u> AAan <u>a</u>lihatin<u>a</u> fatin<u>a</u> bim<u>a</u> taAAidun<u>a</u> in kunta mina a<b>l</b><u>ssa</u>diqeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "but they said, \"Have you come to us to turn us away from our deities? Then bring down upon us what you threaten us with, if you are truthful.\""
          ],
          "en.yusufali": [
            "They said: \"Hast thou come in order to turn us aside from our gods? Then bring upon us the (calamity) with which thou dost threaten us, if thou art telling the truth?\""
          ],
          "fa.ansarian": [
            "گفتند: آیا آمده ای تا ما را از [پرستش] معبودانمان بر گردانی، پس اگر راستگویی عذابی که ما را تهدید می کنی بیاور!"
          ],
          "fa.ayati": [
            "گفتند: آيا آمده‌اى تا ما را از خدايانمان رويگردان سازى؟ اگر راست مى‌گويى، هر چه به ما وعده داده‌اى بياور."
          ],
          "fa.bahrampour": [
            "گفتند: آيا به سوى ما آمده‌اى كه ما را از خدايانمان برگردانى؟ پس آنچه به ما وعده مى‌دهى بياور اگر راست مى‌گويى"
          ],
          "fa.fooladvand": [
            "گفتند: «آيا آمده‌اى كه ما را از خدايانمان برگردانى؟ پس اگر راست مى‌گويى، آنچه به ما وعده مى‌دهى [بر سرمان‌] بياور.»"
          ],
          "fa.ghomshei": [
            "قوم هود در پاسخ گفتند: آیا تو آمده‌ای ما را از پرستش بتان که خدایان ما هستند منع کنی؟! پس تو (زود) وعده عذابی را که به ما می‌دهی بیار اگر راست می‌گویی."
          ],
          "fa.khorramdel": [
            "(قوم عاد بدو پاسخ دادند و) گفتند: آیا تو آمده‌ای که با دروغهای خود، ما را از خدایانمان برگردانی؟! اگر از راستگویانی، عذابی را که ما را از وقوع آن می‌ترسانی بر سر ما بیاور. [[«لِتَأْفِکَنَا»: تا ما را منصرف کنی و برگردانی.]]"
          ],
          "fa.khorramshahi": [
            "گفتند آیا به سراغ ما آمده‌ای که ما را از خدایانمان باز داری، پس اگر از راستگویان هستی، آنچه به ما وعده داده‌ای به میان بیاور"
          ],
          "fa.makarem": [
            "آنها گفتند: «آیا آمده‌ای که ما را (با دروغهایت) از معبودانمان بازگردانی؟! اگر راست می‌گویی عذابی را که به ما وعده می‌دهی بیاور!»"
          ],
          "fa.moezzi": [
            "گفتند آیا آمدی ما را تا فریب دهی ما را از خدایان ما پس بیار ما را آنچه بیم دهی ما را اگر هستی از راستگویان‌"
          ],
          "fa.mojtabavi": [
            "گفتند: آيا نزد ما آمده‌اى تا ما را از خدايانمان بگردانى؟ پس آنچه را به ما وعده مى‌دهى بيار اگر راستگويى."
          ],
          "fa.sadeqi": [
            "گفتند: «آیا آمده‌ای که ما را از خدایانمان - با دروغ‌پردازی - برانی و برگردانی‌؟ پس اگر از راستان بوده‌ای، آنچه به ما وعده می‌دهی برایمان بیاور.»"
          ]
        }
      },
      {
        "index": 4533,
        "local_index": 23,
        "part_type": "Verse",
        "path": "/books/quran:46:23",
        "text": [
          "قَالَ‌ إِنَّمَا الْعِلْمُ‌ عِنْدَ اللَّهِ‌ وَ أُبَلِّغُکُمْ‌ مَا أُرْسِلْتُ‌ بِهِ‌ وَ لٰکِنِّي‌ أَرَاکُمْ‌ قَوْماً تَجْهَلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "He said: \"Only God has the knowledge. I only convey to you what I have been sent with. But I see you are a foolish people.\""
          ],
          "en.ahmedraza": [
            "He said, “Its knowledge is only with Allah; and I convey to you the messages of my Lord, but I perceive that you are an ignorant nation.”"
          ],
          "en.arberry": [
            "He said, 'Knowledge is only with God, and I deliver to you the Message with which I was sent; but I see you are an ignorant people.'"
          ],
          "en.daryabadi": [
            "He said: the knowledge is only with Allah, and I preach Unto you that wherewith I have been sent, but I see you are a people given to ignorance."
          ],
          "en.hilali": [
            "He said: \"The knowledge (of the time of its coming) is with Allah only, and I convey to you that wherewith I have been sent, but I see that you are a people given to ignorance!\""
          ],
          "en.itani": [
            "He said, “The knowledge is only with God, and I inform you of what I was sent with; but I see you are an ignorant people.”"
          ],
          "en.maududi": [
            "He replied: “Allah alone knows about this. I only convey to you the Message that I have been sent with. But I see that you are an ignorant people.”"
          ],
          "en.mubarakpuri": [
            "He said: \"The knowledge (of that) is only with Allah. And I convey to you that wherewith I have been sent, but I see that you are a people given to ignorance!\""
          ],
          "en.pickthall": [
            "He said: The knowledge is with Allah only. I convey unto you that wherewith I have been sent, but I see you are a folk that know not."
          ],
          "en.qarai": [
            "He said, ‘The knowledge [of when that threat will be carried out] is with Allah alone. I communicate to you what I have been sent with. But I see that you are a senseless lot.’"
          ],
          "en.qaribullah": [
            "'Allah alone has the knowledge' he said, 'I am sent to deliver to you the Message. But I can see that you are ignorant people'"
          ],
          "en.sahih": [
            "He said, \"Knowledge [of its time] is only with Allah, and I convey to you that with which I was sent; but I see you [to be] a people behaving ignorantly.\""
          ],
          "en.sarwar": [
            "He said, \"Only God has the knowledge (of the coming of such torment). I preach to you the message that I have brought, but I can see that you are an ignorant people\"."
          ],
          "en.shakir": [
            "He said: The knowledge is only with Allah, and I deliver to you the message with which I am sent, but I see you are a people who are ignorant."
          ],
          "en.transliteration": [
            "Q<u>a</u>la innam<u>a</u> alAAilmu AAinda All<u>a</u>hi waoballighukum m<u>a</u> orsiltu bihi wal<u>a</u>kinnee ar<u>a</u>kum qawman tajhaloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "He said, \"God alone knows when it will come, and I deliver to you the message with which I am sent, but I see you are a people who are ignorant.\""
          ],
          "en.yusufali": [
            "He said: \"The Knowledge (of when it will come) is only with Allah: I proclaim to you the mission on which I have been sent: But I see that ye are a people in ignorance!\".."
          ],
          "fa.ansarian": [
            "گفت: آگاهی [به کیفیت عذاب و زمان آمدنش] فقط نزد خداست، و من آیینی را که به آن فرستاده شده ام به شما ابلاغ می کنم، ولی من شما را گروهی می دانم که همواره نادانی می کنید."
          ],
          "fa.ayati": [
            "گفت: اين را خدا مى‌داند و من آنچه را بدان مبعوث شده‌ام به شما مى‌رسانم. ولى مى‌بينم كه مردمى نادان هستيد."
          ],
          "fa.bahrampour": [
            "گفت: جز اين نيست كه آگاهى [از زمان وقوع عذاب‌] نزد خداست، و من آنچه را بدان فرستاده شده‌ام به شما ابلاغ مى‌كنم، ولى شما را مردمى جاهل مى‌بينم"
          ],
          "fa.fooladvand": [
            "گفت: «آگاهى فقط نزد خداست، و آنچه را بدان فرستاده شده‌ام به شما مى‌رسانم، ولى من شما را گروهى مى‌بينم كه در جهل اصرار مى‌ورزيد.»"
          ],
          "fa.ghomshei": [
            "هود در جواب گفت: علمش نزد خداست و من آنچه را که بر آن رسالت داشتم به شما ابلاغ کردم و لیکن شما را بسیار مردم نادانی می‌بینم."
          ],
          "fa.khorramdel": [
            "هود گفت: این را تنها خدا می‌داند و بس. من چیزی را به شما می‌رسانم که برای آن فرستاده شده‌ام. (وظیفه‌ی من ابلاغ رسالت و رساندن پیام آسمانی است) ولیکن می‌بینم که شما مردمان نادانی هستید (چرا که وظیفه‌ی پیغمبران را نمی‌دانید، و عجیب‌تر این که خواستار زود فرا رسیدن عذاب و بلای کردگارید). [[«الْعِلْمُ»: آگاهی. مراد آگاهی از وقوع قیامت، یا اطّلاع از موعد عذاب استیصال دنیوی است. «تَجْهَلُونَ»: نمی‌دانید. یعنی وظیفه انبیاء را نمی‌دانید، یا چون نادانید شتاب دارید که عذاب خدا هرچه زودتر در رسد.]]"
          ],
          "fa.khorramshahi": [
            "گفت همانا علم نزد خداوند است، و من رسالتم را به شما می‌رسانم، ولی شما را قومی می‌بینم که نادانی می‌کنید"
          ],
          "fa.makarem": [
            "گفت: «علم (آن) تنها نزد خداست (و او می‌داند چه زمانی شما را مجازات کند)؛ من آنچه را به آن فرستاده شده‌ام به شما می‌رسانم، (وظیفه من همین است!) ولی شما را قومی می‌بینیم که پیوسته در نادانی هستید!»"
          ],
          "fa.moezzi": [
            "گفت جز این نیست که دانش نزد خدا است و می‌رسانم به شما آنچه فرستاده شدم بدان و لیکن بینم شما را گروهی نادانان‌"
          ],
          "fa.mojtabavi": [
            "گفت: همانا دانش [اين كه عذاب كى خواهد بود] نزد خداست، و من آنچه را بدان فرستاده شده‌ام به شما مى‌رسانم، و ليكن شما را مردمى مى‌بينم كه نادانى مى‌كنيد."
          ],
          "fa.sadeqi": [
            "گفت: «تمامی علم تنها نزد خداست و آنچه را بدان فرستاده شده‌ام به شما به‌درستی می‌رسانم. ولی من شما را گروهی می‌بینم که نادانی می‌کنید.»"
          ]
        }
      },
      {
        "index": 4534,
        "local_index": 24,
        "part_type": "Verse",
        "path": "/books/quran:46:24",
        "text": [
          "فَلَمَّا رَأَوْهُ‌ عَارِضاً مُسْتَقْبِلَ‌ أَوْدِيَتِهِمْ‌ قَالُوا هٰذَا عَارِضٌ‌ مُمْطِرُنَا بَلْ‌ هُوَ مَا اسْتَعْجَلْتُمْ‌ بِهِ‌ رِيحٌ‌ فِيهَا عَذَابٌ‌ أَلِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "So when they saw it as a cloud advancing towards their valleys, they said: \"This is just a passing cloud that will bring us rain.\" \"No. It is what you were trying to hasten: The wind which carries the grievous punishment!"
          ],
          "en.ahmedraza": [
            "So when they saw the punishment coming towards their valleys, spread like a cloud on the horizon, they said, “That is a cloud which will shower rain upon us”; said Hud “In fact this is what you were being impatient for; a windstorm carrying a painful punishment.”"
          ],
          "en.arberry": [
            "Then, when they saw it as a sudden cloud coming towards their valleys, they said, 'This is a cloud, that shall give us rain!' 'Not so; rather it is that you sought to hasten -- a wind, wherein is a painful chastisement,"
          ],
          "en.daryabadi": [
            "Then when they beheld it as an overpeering cloud tending toward their valleys they said: yonder is an overpeering cloud bringing us rain. Nay it is that which ye sought to be hastened: a wind wherein is a torment afflictive."
          ],
          "en.hilali": [
            "Then, when they saw it as a dense cloud coming towards their valleys, they said: \"This is a cloud bringing us rain!\" Nay, but it is that (torment) which you were asking to be hastened! a wind wherein is a painful torment!"
          ],
          "en.itani": [
            "Then, when they saw a cloud approaching their valley, they said, “This is a cloud that will bring us rain.” “In fact, it is what you were impatient for: a wind in which is grievous suffering.”"
          ],
          "en.maududi": [
            "When they saw the scourge advancing towards their valleys, they said: “This is a cloud that will bring much rain to us.” “By no means; it is what you had sought to hasten -- a wind-storm bearing a grievous chastisement"
          ],
          "en.mubarakpuri": [
            "Then, when they saw it as a dense cloud approaching their valleys, they said: \"This is a cloud bringing us rain!\" Nay, but it is that which you were asking to be hastened - a wind wherein is a painful torment!"
          ],
          "en.pickthall": [
            "Then, when they beheld it as a dense cloud coming toward their valleys, they said: Here is a cloud bringing us rain. Nay, but it is that which ye did seek to hasten, a wind wherein is painful torment,"
          ],
          "en.qarai": [
            "When they saw it as a cloud advancing toward their valleys, they said, ‘This cloud brings us rain.’ ‘No, it is what you sought to hasten: a hurricane carrying a painful punishment,"
          ],
          "en.qaribullah": [
            "And when they saw it as a sudden cloud heading for their valley they said: 'This is a cloud that will bring us rain' 'Rather' (he replied): 'it is that which you have sought to hasten, a wind in which there is a painful punishment."
          ],
          "en.sahih": [
            "And when they saw it as a cloud approaching their valleys, they said, \"This is a cloud bringing us rain!\" Rather, it is that for which you were impatient: a wind, within it a painful punishment,"
          ],
          "en.sarwar": [
            "When they saw the torment as a cloud proceeding to their valleys, they said, \"This cloud will bring us rain.\" He said, \"No, it is the torment which you wanted to suffer immediately. It is a wind bearing and painful torment."
          ],
          "en.shakir": [
            "So when they saw it as a cloud appearing in the sky advancing towards their valleys, they said: This is a cloud which will give us rain. Nay! it is what you sought to hasten on, a blast of wind in which is a painful punishment,"
          ],
          "en.transliteration": [
            "Falamm<u>a</u> raawhu AA<u>a</u>ri<u>d</u>an mustaqbila awdiyatihim q<u>a</u>loo h<u>atha</u> AA<u>a</u>ri<u>d</u>un mum<u>t</u>irun<u>a</u> bal huwa m<u>a</u> istaAAjaltum bihi ree<u>h</u>un feeh<u>a</u> AAa<u>tha</u>bun aleem<b>un</b>"
          ],
          "en.wahiduddin": [
            "So, when they saw it in the shape of a dense cloud approaching their valleys, they exclaimed, \"This is only a heavy cloud which will bring us [welcome] rain!\" [But Hud said]: \"By no means! It is the very thing which you sought to hasten -- a wind bearing grievous suffering"
          ],
          "en.yusufali": [
            "Then, when they saw the (Penalty in the shape of) a cloud traversing the sky, coming to meet their valleys, they said, \"This cloud will give us rain!\" \"Nay, it is the (Calamity) ye were asking to be hastened!- A wind wherein is a Grievous Penalty!"
          ],
          "fa.ansarian": [
            "پس هنگامی که عذاب را [در پهنه فضا] به صورت ابری گسترده دیدند که به سوی درّه ها و آبگیرهایشان روی آورده، گفتند: این ابری باران زا برای ماست. [هود گفت: نه] بلکه این همان چیزی است که آن را به شتاب خواستید، بادی است که در آن عذابی دردناک است؛"
          ],
          "fa.ayati": [
            "چون ابرى ديدند كه از جانب رودخانه‌هاشان مى‌آيد، گفتند: اين ابرى باران‌زاست. نه، اين همان چيزى است كه آن را به شتاب مى‌طلبيديد. باد است و در آن باد عذابى دردآور،"
          ],
          "fa.bahrampour": [
            "پس چون آن [عذاب‌] را ديدند كه به صورت ابرى به طرف وادى‌هايشان روى آورده، گفتند: اين ابرى است كه بر ما خواهد باريد. [گفته شد: نه،] بلكه اين همان چيزى است كه شتاب در آن را مى‌خواستيد تندبادى است كه در آن عذابى دردناك است"
          ],
          "fa.fooladvand": [
            "پس چون آن [عذاب‌] را [به صورت‌] ابرى روى‌آورنده به سوى واديهاى خود ديدند، گفتند: «اين ابرى است كه بارش‌دهنده ماست.» [هود گفت: «نه،] بلكه همان چيزى است كه به شتاب خواستارش بوديد: بادى است كه در آن عذابى پر درد [نهفته‌] است."
          ],
          "fa.ghomshei": [
            "پس چون آن عذاب را به شکل ابری دیدند که بر رودخانه‌هاشان روی آورد گفتند: این ابری است که بر ما باران می‌بارد. (هود به آنها گفت: چنین نیست) بلکه اثر عذابی است که به تعجیل درخواستید، این باد سختی است که در آن عذابی دردناک است."
          ],
          "fa.khorramdel": [
            "هنگامی که ابری را دیدند که در افق آسمان گسترده می‌شود و به سوی سرزمینهای ایشان رو می‌آورد (خوشحال شدند و) گفتند: این ابر بر ما باران را می‌باراند. (هود بدیشان گفت: چنین نیست). بلکه این همان چیزی است که آن را بشتاب می‌خواستید. تندبادی است که عذاب دردناکی به همراه آورده است! [[«عَارِضاً»: ابر. ابری که در عرض آسمان، یعنی در کرانه‌های افق پهن می‌شود و سپس بالا می‌آید. چه بسا از نشانه‌های ابرهای باران‌زا باشد. «مُسْتَقْبِلَ»: روآورنده. آینده. «أَوْدِیَة»: جمع وادی، دره‌ها (نگا: رعد. 17). مراد سرزمینها است (نگا: ابراهیم / 37، نمل / 18، قصص / 30، توبه / 121). «مُمْطِر»: بارنده.]]"
          ],
          "fa.khorramshahi": [
            "آنگاه چون آن [عذاب‌] را به هیئت ابری دیدند که رو به [دشت و] دره‌هایشان نهاده بود، گفتند این ابری است بارنده بر ما، نه بلکه آن چیزی است که به شتابش می‌خواستید، بادی است که در آن عذابی دردناک است‌"
          ],
          "fa.makarem": [
            "هنگامی که آن (عذاب الهی) را بصورت ابر گسترده‌ای دیدند که بسوی درّه‌ها و آبگیرهای آنان در حرکت است (خوشحال شدند) گفتند: «این ابری است که بر ما می‌بارد!» (ولی به آنها گفته شد:) این همان چیزی است که برای آمدنش شتاب می‌کردید، تندبادی است (وحشتناک) که عذاب دردناکی در آن است!"
          ],
          "fa.moezzi": [
            "تا گاهی که نگریستندش ابری روی‌آرنده بسوی درّه‌هاشان گفتند این است ابری بارنده بر ما بلکه آن است آنچه شتاب می‌خواستید بدان بادی است در آن عذابی دردناک‌"
          ],
          "fa.mojtabavi": [
            "پس چون آن [ابر عذاب‌] را ديدند كه روى به واديهاى آنها نهاده، گفتند: اين براى ما ابرى باران‌زاست. [نه،] بلكه اين همان [عذابى‌] است كه به شتاب مى‌خواستيد، بادى است كه در آن عذابى دردناك است"
          ],
          "fa.sadeqi": [
            "پس هنگامی که آن (عذاب) را (به صورت) نمادین (چون) ابری سوی وادی‌های خود دیدند، گفتند: «این ابری نمادین است که برای ما باران‌آور است.‌» (هود گفت:) «بلکه آن چیزی است که بدان بسی شتاب می‌کردید. (این ابرنما) بادی است که در آن عذابی پر درد است.»"
          ]
        }
      },
      {
        "index": 4535,
        "local_index": 25,
        "part_type": "Verse",
        "path": "/books/quran:46:25",
        "text": [
          "تُدَمِّرُ کُلَ‌ شَيْ‌ءٍ بِأَمْرِ رَبِّهَا فَأَصْبَحُوا لاَ يُرَى‌ إِلاَّ مَسَاکِنُهُمْ‌ کَذٰلِکَ‌ نَجْزِي‌ الْقَوْمَ‌ الْمُجْرِمِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "It will destroy everything at the bidding of its Lord.\" So in the morning there was nothing but their empty dwellings to be seen. That is how We requite the sinners."
          ],
          "en.ahmedraza": [
            "“That destroys all things by the command of its Lord” – so at morning none could be seen except their empty houses; this is the sort of punishment We mete out to the guilty."
          ],
          "en.arberry": [
            "destroying everything by the commandment of its Lord.' So in the morning there was naught to be seen but their dwelling-places. Even so do We recompense the people of the sinners."
          ],
          "en.daryabadi": [
            "It shall annihilate everything by the command of its Lord. Wherefore they became such that naught could be seen save their dwellings Thus We requite a nation of the culprits."
          ],
          "en.hilali": [
            "Destroying everything by the Command of its Lord! So they became such that nothing could be seen except their dwellings! Thus do We recompense the people who are Mujrimun (polytheists, disbelievers, sinners, etc.)!"
          ],
          "en.itani": [
            "It will destroy everything by the command of its Lord. And when the morning came upon them, there was nothing to be seen except their dwellings. Thus We requite the guilty people."
          ],
          "en.maududi": [
            "that will destroy everything by the command of its Lord.” Thereafter nothing was left to be seen except their dwellings. Thus do We requite the wrong-doers."
          ],
          "en.mubarakpuri": [
            "Destroying everything by the command of its Lord! So they became such that nothing could be seen except their dwellings! Thus do We recompense the criminal people!"
          ],
          "en.pickthall": [
            "Destroying all things by commandment of its Lord. And morning found them so that naught could be seen save their dwellings. Thus do We reward the guilty folk."
          ],
          "en.qarai": [
            "destroying everything by its Lord’s command.’ So they became such that nothing could be seen except their dwellings. Thus do We requite the guilty lot."
          ],
          "en.qaribullah": [
            "It will destroy everything by the command of its Lord' And when morning came there was nothing to be seen except their dwellings. As such Werecompense sinful people."
          ],
          "en.sahih": [
            "Destroying everything by command of its Lord. And they became so that nothing was seen [of them] except their dwellings. Thus do We recompense the criminal people."
          ],
          "en.sarwar": [
            "It will destroy everything by the will of its Lord\" (Not very long after) nothing could be seen of them except their dwellings. Thus do We recompense the sinful people."
          ],
          "en.shakir": [
            "Destroying everything by the command of its Lord, so they became such that naught could be seen except their dwellings. Thus do We reward the guilty people."
          ],
          "en.transliteration": [
            "Tudammiru kulla shayin biamri rabbih<u>a</u> faa<u>s</u>ba<u>h</u>oo l<u>a</u> yur<u>a</u> ill<u>a</u> mas<u>a</u>kinuhum ka<u>tha</u>lika najzee alqawma almujrimeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "which will destroy everything at its Lord's behest!\" And in the morning there was nothing left to be seen save their [empty] dwellings: thus We repay the evil-doers."
          ],
          "en.yusufali": [
            "\"Everything will it destroy by the command of its Lord!\" Then by the morning they - nothing was to be seen but (the ruins of) their houses! thus do We recompense those given to sin!"
          ],
          "fa.ansarian": [
            "[چنان بادی است که] همه چیز را به فرمان پروردگارش در هم می کوبد و نابود می کند. پس آنان [به سبب آن عذاب] چنان شدند که جز خانه هایشان دیده نمی شد. این گونه مردم گناهکار را کیفر می دهیم."
          ],
          "fa.ayati": [
            "به فرمان پروردگارش همه چيز را هلاك مى‌كند. چنان شدند كه اكنون جز خانه‌هاشان را نبينى. و ما مجرمان را اين سان پاداش مى‌دهيم."
          ],
          "fa.bahrampour": [
            "همه چيز را به فرمان پروردگارش ريشه كن مى‌كند. پس چنان شدند كه چيزى جز خانه‌هايشان ديده نمى‌شد. [آرى‌]، اين چنين مردم مجرم را سزا مى‌دهيم"
          ],
          "fa.fooladvand": [
            "همه چيز را به دستور پروردگارش بنيان‌كن مى‌كند.» پس چنان شدند كه جز سراهايشان ديده نمى‌شد. اين چنين گروه بدكاران را سزا مى‌دهيم."
          ],
          "fa.ghomshei": [
            "این بادی است که هر چیزی را به امر خدای خود نابود و هلاک می‌سازد. پس شبی صبح کردند که جز خانه‌های ویران آنها دیده نمی‌شد (و اثری از آنان نماند). بلی ما بدین گونه قوم بدکار را کیفر می‌دهیم."
          ],
          "fa.khorramdel": [
            "(تندبادی است که) همه چیز را به فرمان پروردگارش درهم می‌کوبد و نابود می‌سازد. پس (از چندی، تندباد ایشان را دربر گرفت و هلاک گشتند و) به گونه‌ای درآمدند که جز خانه‌هایشان چیزی به چشم نمی‌خورد! ما این سان مردمان بزهکار را سزا و کیفر می‌دهیم. [[«تُدَمِّرُ»: درهم می‌کوبد. ویران و نابود می‌سازد. «أَصْبَحُوا»: گشتند و شدند.]]"
          ],
          "fa.khorramshahi": [
            "که به فرمان پروردگارش همه چیز را نابود می‌کند، و چنان شدند که چیزی جز خانه‌هایشان دیده نمی‌شد، بدین‌سان قوم گناهکاران را کیفر می‌دهیم‌"
          ],
          "fa.makarem": [
            "همه چیز را بفرمان پروردگارش در هم میکوبد و نابود میکند (آری) آنها صبح کردند در حالی که چیزی جز خانه‌هایشان به چشم نمی‌خورد؛ ما این‌گونه گروه مجرمان را کیفر می‌دهیم!"
          ],
          "fa.moezzi": [
            "سرنگون سازد هر چیز را به فرمان پروردگار خویش پس بامداد کردند دیده نمی‌شد جز نشیمنهای آنان بدینگونه پاداش دهیم به گروه گنهکاران‌"
          ],
          "fa.mojtabavi": [
            "كه به فرمان پروردگارش هر چيز را [كه بر آن بگذرد] هلاك مى‌كند پس چنان گشتند كه بجز خانه‌هايشان ديده نمى‌شد. اينچنين مردم بزهكار را كيفر مى‌دهيم."
          ],
          "fa.sadeqi": [
            "«همه چیز را به دستور پروردگارش از بنیان بر می‌کند.» پس چنان شدند که جز جایگاه‌هاشان دیده نمی‌شد. این چنین گروه مجرمان را سزا می‌دهیم."
          ]
        }
      },
      {
        "index": 4536,
        "local_index": 26,
        "part_type": "Verse",
        "path": "/books/quran:46:26",
        "text": [
          "وَ لَقَدْ مَکَّنَّاهُمْ‌ فِيمَا إِنْ‌ مَکَّنَّاکُمْ‌ فِيهِ‌ وَ جَعَلْنَا لَهُمْ‌ سَمْعاً وَ أَبْصَاراً وَ أَفْئِدَةً فَمَا أَغْنَى‌ عَنْهُمْ‌ سَمْعُهُمْ‌ وَ لاَ أَبْصَارُهُمْ‌ وَ لاَ أَفْئِدَتُهُمْ‌ مِنْ‌ شَيْ‌ءٍ إِذْ کَانُوا يَجْحَدُونَ‌ بِآيَاتِ‌ اللَّهِ‌ وَ حَاقَ‌ بِهِمْ‌ مَا کَانُوا بِهِ‌ يَسْتَهْزِءُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "We had strengthened them as We have not strengthened you, had given them ears and eyes and hearts; but nothing stood them in good stead, neither their ears nor eyes nor hearts, for they rejected the signs of God, and were seized by what they had mocked."
          ],
          "en.ahmedraza": [
            "And We had indeed given them the means which We have not given you, and made ears and eyes and hearts for them; so their ears and eyes and hearts did not benefit them at all because they used to deny the signs of Allah, and the punishment they used to mock at encompassed them."
          ],
          "en.arberry": [
            "And We had established them in that wherein We have not established you, and We appointed for them hearing, and sight, and hearts; and yet their hearing, their sight and their hearts availed them nothing, since they denied the signs of God, and they were encompassed by that they mocked at."
          ],
          "en.daryabadi": [
            "And assuredly We had established them in that flourishing condition wherein We have not established you, and We had appointed for them hearing and sight and hearts; yet their hearing and sight and heart availed them not at all, they became wont to gainsay the revelations of Allah, and surrounded them that whereat they had been mocking."
          ],
          "en.hilali": [
            "And indeed We had firmly established them with that wherewith We have not established you (O Quraish)! And We had assigned them the (faculties of) hearing (ears), seeing (eyes), and hearts, but their hearing (ears), seeing (eyes), and their hearts availed them nothing since they used to deny the Ayat (Allah's Prophets and their Prophethood, proofs, evidences, verses, signs, revelations, etc.) of Allah, and they were completely encircled by that which they used to mock at!"
          ],
          "en.itani": [
            "We had empowered them in the same way as We empowered you; and We gave them the hearing, and the sight, and the minds. But neither their hearing, nor their sight, nor their minds availed them in any way. That is because they disregarded the revelations of God; and so they became surrounded by what they used to ridicule."
          ],
          "en.maududi": [
            "We had established them firmly in a manner We have not established you. We had given them ears and eyes and hearts. But nothing availed them -- neither their ears, nor their eyes, nor their hearts, for they denied the Signs of Allah. Then what they had mocked at encompassed them."
          ],
          "en.mubarakpuri": [
            "And indeed We had firmly established them with that wherewith We have not established you! We also gave them hearing, vision, and hearts. But their hearing, vision, and hearts availed them nothing since they used to deny the Ayat of Allah, and they were completely encircled by that which they used to ridicule!"
          ],
          "en.pickthall": [
            "And verily We had empowered them with that wherewith We have not empowered you, and had assigned them ears and eyes and hearts; but their ears and eyes and hearts availed them naught since they denied the revelations of Allah; and what they used to mock befell them."
          ],
          "en.qarai": [
            "Certainly We had granted them power in respects that We have not granted you, and We had vested them with hearing and sight and hearts. But neither their hearing availed them in any way nor did their sight, nor their hearts when they used to impugn the signs of Allah. So they were besieged by what they used to deride."
          ],
          "en.qaribullah": [
            "And We had established them in that which We have not established you, and We made for them hearing, sight, and hearts, but their hearing, sight, andhearts did not help them a thing, because they disbelieved the signs of Allah. And what they mocked encompassed them."
          ],
          "en.sahih": [
            "And We had certainly established them in such as We have not established you, and We made for them hearing and vision and hearts. But their hearing and vision and hearts availed them not from anything [of the punishment] when they were [continually] rejecting the signs of Allah; and they were enveloped by what they used to ridicule."
          ],
          "en.sarwar": [
            "We had established them more firmly in the land than you are. We had given them ears, eyes, and hearts but none of their ears, eyes, and hearts proved to be of any benefit to them; they rejected the revelations of God and the torment which they mocked brought upon them utter destruction."
          ],
          "en.shakir": [
            "And certainly We had established them in what We have not established you in, and We had given-- them ears and eyes and hearts, but neither their ears, nor their eyes, nor their hearts availed them aught, since they denied the communications of Allah, and that which they mocked encompassed them."
          ],
          "en.transliteration": [
            "Walaqad makkann<u>a</u>hum feem<u>a</u> in makkann<u>a</u>kum feehi wajaAAaln<u>a</u> lahum samAAan waab<u>sa</u>ran waafidatan fam<u>a</u> aghn<u>a</u> AAanhum samAAuhum wal<u>a</u> ab<u>sa</u>ruhum wal<u>a</u> afidatuhum min shayin i<u>th</u> k<u>a</u>noo yaj<u>h</u>adoona bi<u>a</u>y<u>a</u>ti All<u>a</u>hi wa<u>ha</u>qa bihim m<u>a</u> k<u>a</u>noo bihi yastahzioon<b>a</b>"
          ],
          "en.wahiduddin": [
            "We had empowered them to an extent which We have not empowered you, [O people of later times]; and We had endowed them with hearing, and sight, and hearts: but neither their hearing, nor their sight, nor their hearts were of the least avail to them, since they went on rejecting God's revelations; and they were overwhelmed by the very thing which they had been wont to deride."
          ],
          "en.yusufali": [
            "And We had firmly established them in a (prosperity and) power which We have not given to you (ye Quraish!) and We had endowed them with (faculties of) hearing, seeing, heart and intellect: but of no profit to them were their (faculties of) hearing, sight, and heart and intellect, when they went on rejecting the Signs of Allah; and they were (completely) encircled by that which they used to mock at!"
          ],
          "fa.ansarian": [
            "همانا ما به آنان در اموری قدرت و تمکن داده بودیم که شما را در آن امور چنان قدرت و نیرویی نداده ایم، و برای آنان گوش و چشم و دل قرار داده بودیم، ولی گوش و چشم و دلشان چیزی از عذاب را از آنان برطرف نکرد؛ زیرا همواره [با داشتن آن ابزار تشخیص] آیات ما را انکار می کردند، و سرانجام عذابی که همواره آن را مسخره می کردند، آنان را احاطه کرد."
          ],
          "fa.ayati": [
            "به آنها چنان مكانتى داده بوديم كه به شما نداده‌ايم. برايشان گوش و چشم و دل قرار داديم. ولى گوش و چشم و دلشان به حالشان هيچ سود نكرد، زيرا آيات خدا را انكار مى‌كردند تا آنچه به مسخره‌اش مى‌گرفتند آنها را فروگرفت."
          ],
          "fa.bahrampour": [
            "و البته به آنها در چيزهايى قدرت و تمكّن داده بوديم كه شما را در آن تمكّن نداده‌ايم، و براى آنان شنوايى و ديده‌ها و دل‌هايى [نيرومندتر از شما] قرار داده بوديم، ولى چون آيات الهى را انكار كردند، نه شنوايى‌شان و نه ديدگانشان و نه دل‌هايشان به هيچ وجه ب"
          ],
          "fa.fooladvand": [
            "و به راستى در چيزهايى به آنان امكانات داده بوديم كه به شما در آنها [چنان‌] امكاناتى نداده‌ايم، و براى آنان گوش و ديده‌ها و دلهايى [نيرومندتر از شما] قرار داده بوديم، و[لى‌] چون به نشانه‌هاى خدا انكار ورزيدند [نه‌] گوششان و نه ديدگانشان و نه دلهايشان، به هيچ وجه به دردشان نخورد، و آنچه ريشخندش مى‌كردند به سرشان آمد."
          ],
          "fa.ghomshei": [
            "و به آن قوم عاد تمکین و قوتی دادیم که شما امت را چنان نیروی بدنی ندادیم و با آنکه بر آنها گوش و چشم و قلب مدرک قرار دادیم (تا با قوای ادراکی خداشناس شوند) هیچ این قوای مدرکه آنها را از عذاب نرهانید بدین جهت که آیات خدا را انکار می‌کردند، و آن عذابی که بدان استهزا می‌کردند به آنها فرا رسید."
          ],
          "fa.khorramdel": [
            "ما قوم عاد را از امکاناتی برخوردار کرده بودیم که چنین امکاناتی را به شما نداده‌ایم. ما بدیشان گوشها و چشمها و دلهائی داده بودیم (که در درک و دید و تشخیص واقعیّتها آنان را قویتر از دیگران می‌کرد). امّا گوشها و چشمها و دلهایشان سودی بدانان نبخشید، چرا که آیات خدا را تکذیب می‌کردند و (رهنمودهای پیغمبران را نمی‌پذیرفتند. سرانجام همان) چیزی ایشان را فرو گرفت که مسخره‌اش می‌دانستند (و آن عذاب خدا بود). [[«مَکَّنَّاهُمْ»: مکانت و قدرتشان دادیم. از امکاناتی برخوردارشان کردیم. مراد قدرت مادی و معنوی است. از نظر ثروت و دارائی، و از لحاظ فرهنگ و دانش، برتر از اهل مکّه و بسیاری از مردم بودند (نگا: فجر 6 - 8). «إِنْ»: حرف نافیه است و به معنی (ما). «إِذْ»: چرا که. زیرا که. «حَاقَ»: فرو گرفت (نگا: انعام / 10، هود / 8، نحل / 34).]]"
          ],
          "fa.khorramshahi": [
            "و به راستی به آنان در چیزهایی تمکن داده بودیم که شما را آن تمکن نداده بودیم، و برای آنان گوشها و چشمها و دلها آفریده بودیم، اما گوشها و چشمها و دلهایشان سودی به حالشان نداد، چرا که آیات الهی را انکار می‌کردند و آنچه ریشخندش می‌کردند، ایشان را فروگرفت‌"
          ],
          "fa.makarem": [
            "ما به آنها [= قوم عاد] قدرتی دادیم که به شما ندادیم، و برای آنان گوش و چشم و دل قرار دادیم؛ (امّا به هنگام نزول عذاب) نه گوشها و چشمها و نه عقلهایشان برای آنان هیچ سودی نداشت، چرا که آیات خدا را انکار می‌کردند؛ و سرانجام آنچه را استهزا می‌کردند بر آنها وارد شد!"
          ],
          "fa.moezzi": [
            "و هر آینه فرمانرواشان ساختیم در آنچه فرمانروا نساختیم شما را در آن و قرار دادیم برای ایشان گوشی و دیدگانی و دلهائی پس بی‌نیاز نکرد از ایشان گوششان و نه دیدگانشان و نه دلهاشان چیزی را گاهی که بودند برابری (پایمال) کردند آیتهای خدا را و فرود آمد بدیشان آنچه بودند بدان مسخره می‌کردند"
          ],
          "fa.mojtabavi": [
            "و هر آينه آنان"
          ],
          "fa.sadeqi": [
            "و به‌راستی همچنان در چیزی به آنان امکان دادیم، که به شما در آن (چنان) امکانی ندادیم و برای آنان گوش‌ها و دیده‌ها و دل‌هایی شعله‌‌ور [:نیرومندتر از شما] قرار دادیم و چون به نشانه‌های خدا انکار می‌ورزیدند، نه گوش‌هاشان و نه دیدگانشان و نه دل‌های شعله‌ورشان به هیچ وجه از چیزی بی‌نیازشان نکرد و آنچه بدان ریشخندش می‌کردند آنان را فراگرفت."
          ]
        }
      },
      {
        "index": 4537,
        "local_index": 27,
        "part_type": "Verse",
        "path": "/books/quran:46:27",
        "text": [
          "وَ لَقَدْ أَهْلَکْنَا مَا حَوْلَکُمْ‌ مِنَ‌ الْقُرَى‌ وَ صَرَّفْنَا الْآيَاتِ‌ لَعَلَّهُمْ‌ يَرْجِعُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "We have destroyed habitations all around you, having explained Our signs in different ways to them that they may turn back."
          ],
          "en.ahmedraza": [
            "And We indeed destroyed townships surrounding you, and brought several signs so that they may desist."
          ],
          "en.arberry": [
            "And We destroyed the cities about you, and We turned about the signs, that haply they would return."
          ],
          "en.daryabadi": [
            "And assuredly We have destroyed the cities round about you. and We have variously propounded our signs, that haply they might return."
          ],
          "en.hilali": [
            "And indeed We have destroyed towns (populations) round about you, and We have (repeatedly) shown (them) the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) in various ways that they might return (to the truth and believe in the Oneness of Allah - Islamic Monotheism)."
          ],
          "en.itani": [
            "We have destroyed many townships around you, and diversified the signs, so that they may return."
          ],
          "en.maududi": [
            "Surely We destroyed many a town around you. We sent Our Messages to them repeatedly and in diverse forms that they may eschew (their evil ways) and return (to Allah)."
          ],
          "en.mubarakpuri": [
            "And indeed We have destroyed towns round about you, and We have shown (them) the signs in various ways so that they might return."
          ],
          "en.pickthall": [
            "And verily We have destroyed townships round about you, and displayed (for them) Our revelation, that haply they might return."
          ],
          "en.qarai": [
            "Certainly We have destroyed the towns that were around you, and We have variously paraphrased the signs so that they may come back."
          ],
          "en.qaribullah": [
            "We destroyed the villages around you and We repeated Our signs so that they might return."
          ],
          "en.sahih": [
            "And We have already destroyed what surrounds you of [those] cities, and We have diversified the signs [or verses] that perhaps they might return [from disbelief]."
          ],
          "en.sarwar": [
            "We destroyed some towns around you and showed you the evidence (of the Truth) so that perhaps you would turn (to God)."
          ],
          "en.shakir": [
            "And certainly We destroyed the towns which are around you, and We repeat the communications that they might turn."
          ],
          "en.transliteration": [
            "Walaqad ahlakn<u>a</u> m<u>a</u> <u>h</u>awlakum mina alqur<u>a</u> wa<u>s</u>arrafn<u>a</u> al<u>a</u>y<u>a</u>ti laAAallahum yarjiAAoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "We have also destroyed other towns that once [flourished] around you, We had given them various signs so that they might return [to the right path],"
          ],
          "en.yusufali": [
            "We destroyed aforetime populations round about you; and We have shown the Signs in various ways, that they may turn (to Us)."
          ],
          "fa.ansarian": [
            "و به راستی ما [اهل] آبادی هایی را که پیرامون شما [اهل مکه] بودند [به کیفر طغیانشان] هلاک کردیم و آیات خود را به صورت های گوناگون [برای آنان] بیان داشتیم، باشد که برگردند."
          ],
          "fa.ayati": [
            "ما همه قريه‌هايى را كه اطراف شما بوده‌اند هلاك كرده‌ايم و آيات را گونه‌گون بيان كرديم، باشد كه بازگردند."
          ],
          "fa.bahrampour": [
            "و بى‌گمان، شهرهايى را كه پيرامون شما بود هلاك كرديم و آيات خود را [به صورت‌هاى‌] گوناگون بيان داشتيم به اميد آن كه برگردند"
          ],
          "fa.fooladvand": [
            "و بى‌گمان، همه شهرهاى پيرامون شما را هلاك كرده و آيات خود را گونه‌گون بيان داشته‌ايم، اميد كه آنان بازگردند."
          ],
          "fa.ghomshei": [
            "و ما چه بسیار اهل شهر و دیار را که در اطراف شما بودند (به کیفر کفر) همه را هلاک کردیم و آیات (عبرت برای مردم) را به گونه‌های مختلف بیان داشتیم تا مگر (از کفر و گناه به درگاه خدا) باز گردند."
          ],
          "fa.khorramdel": [
            "(ای اهل مکّه!) ما برخی از اقوامی را هلاک کرده‌ایم که در گرداگرد شما می‌زیسته‌اند، و ما آیات خود را به صورتهای گوناگون (برای آنان) بیان می‌داشته‌ایم تا (از کفر و فسق و فجور) برگردند (و آنان نمی‌پذیرفته و سرکشی می‌کرده‌اند). [[«مَا حَوْلَکُم مِّنَ الْقُری»: از قبیل، عاد در احقاف در قسمت جنوبی جزیرة‌العرب، قوم ثمود در حجر واقع در شمال جزیره، قوم سبأ در یمن، قوم شعیب در مدین که بر سر راه شام است، و قوم لوط در نواحی شام. «صَرَّفْنَا»: به گونه‌های مختلف و شیوه‌های گوناگون بیان داشته‌ایم.]]"
          ],
          "fa.khorramshahi": [
            "و به راستی چه بسیار از شهرهایی را که پیرامونتان بود، نابود کردیم و آیات [خود] را گونه‌گون بیان کردیم، باشد که بازآیند"
          ],
          "fa.makarem": [
            "ما آبادیهایی را که پیرامون شما بودند نابود ساختیم، و آیات خود را بصورتهای گوناگون (برای مردم آنها) بیان کردیم شاید بازگردند!"
          ],
          "fa.moezzi": [
            "و همانا نابود ساختیم آنچه پیرامون شما است از شهرها و گردانیدیم (زیر و رو کردیم) آیتها را باشد آنان بازگردند"
          ],
          "fa.mojtabavi": [
            "و هر آينه [مردم‌] آباديهايى را كه پيرامون شما- اهل مكه- بودند هلاك ساختيم، و آيات را گونه‌گون بيان كرديم شايد كه بازگردند."
          ],
          "fa.sadeqi": [
            "و بی‌گمان، گروه‌هایی (در) پیرامونتان را بی‌چون هلاک کردیم، و آیات خود را (برایشان) گونه‌گون بیان داشتیم، شاید آنان (از بیراهه‌شان به راه خدا) بازگردند."
          ]
        }
      },
      {
        "index": 4538,
        "local_index": 28,
        "part_type": "Verse",
        "path": "/books/quran:46:28",
        "text": [
          "فَلَوْ لاَ نَصَرَهُمُ‌ الَّذِينَ‌ اتَّخَذُوا مِنْ‌ دُونِ‌ اللَّهِ‌ قُرْبَاناً آلِهَةً بَلْ‌ ضَلُّوا عَنْهُمْ‌ وَ ذٰلِکَ‌ إِفْکُهُمْ‌ وَ مَا کَانُوا يَفْتَرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Why then did the gods they had taken apart from God as propitiators, not come to their aid? In fact they strayed away from them. It was all a lie what they had contrived!"
          ],
          "en.ahmedraza": [
            "So why did they – the ones whom they had chosen as Gods as a means of attaining Allah’s proximity – not help them? In fact the disbelievers lost them; and this is just their slander and fabrication."
          ],
          "en.arberry": [
            "Then why did those not help them that they had taken to themselves as mediators, gods apart from God? Not so; but they went astray from them, and that was their calumny, and what they had been forging."
          ],
          "en.daryabadi": [
            "Then wherefore succoured them not those whom they had taken for gods beside Allah, as a means of approach? Aye! they failed them. And that was their lie, that which they had been fabricating."
          ],
          "en.hilali": [
            "Then why did those whom they had taken for aliha (gods) besides Allah, as a way of approach (to Allah) not help them? Nay, but they vanished completely from them (when there came the torment). And that was their lie, and their inventions which they had been inventing (before their destruction)."
          ],
          "en.itani": [
            "Why then did the idols, whom they worshiped as means of nearness to God, not help them? In fact, they abandoned them. It was their lie, a fabrication of their own making."
          ],
          "en.maududi": [
            "So why did those whom they had set up as gods apart from Allah, hoping that they would bring them nearer to Him, not come to their aid? Instead, they failed them. This was the end of the lie they had fabricated and the false beliefs they had invented."
          ],
          "en.mubarakpuri": [
            "As for those whom they had taken for gods besides Allah, as the means of approach to Him, why then did they not aid them Nay, but they vanished completely from them. And that was their falsehood, and what they were fabricating."
          ],
          "en.pickthall": [
            "Then why did those whom they had chosen for gods as a way of approach (unto Allah) not help them? Nay, but they did fail them utterly. And (all) that was their lie, and what they used to invent."
          ],
          "en.qarai": [
            "So why did not those [fake deities] help them whom they had taken as gods besides Allah, as a means of nearness [to Him]? Indeed, they forsook them; that was their lie and what they used to fabricate."
          ],
          "en.qaribullah": [
            "Why did not those who they took, other than Allah, as mediating gods help them! Indeed, they went astray from them! Such were their lies and what they were forging."
          ],
          "en.sahih": [
            "Then why did those they took besides Allah as deities by which to approach [Him] not aid them? But they had strayed from them. And that was their falsehood and what they were inventing."
          ],
          "en.sarwar": [
            "Why did the idols, whom they worshipped as a means of pleasing God, not help them? In fact, they proved to be the cause of their going astray and it were lies which they had falsely invented lies."
          ],
          "en.shakir": [
            "Why did not then those help them whom they took for gods besides Allah to draw (them) nigh (to Him)? Nay! they were lost to them; and this was their lie and what they forged."
          ],
          "en.transliteration": [
            "Falawl<u>a</u> na<u>s</u>arahumu alla<u>th</u>eena ittakha<u>th</u>oo min dooni All<u>a</u>hi qurb<u>a</u>nan <u>a</u>lihatan bal <u>d</u>alloo AAanhum wa<u>tha</u>lika ifkuhum wam<u>a</u> k<u>a</u>noo yaftaroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "so why did their gods not help them, those they set up as gods besides God to bring them nearer to Him? No indeed! They failed them utterly: it was all a lie, a fabrication of their own making."
          ],
          "en.yusufali": [
            "Why then was no help forthcoming to them from those whom they worshipped as gods, besides Allah, as a means of access (to Allah)? Nay, they left them in the lurch: but that was their falsehood and their invention."
          ],
          "fa.ansarian": [
            "پس چرا معبودانی که به جای خدا انتخاب کردند به گمان اینکه آنان را به خدا نزدیک کند، آنان را [هنگام نزول عذاب] یاری نکردند بلکه [گم شده] از دستشان رفتند، و این بود [سرانجام و نتیجه] دروغشان و آنچه را همواره افترا می زدند."
          ],
          "fa.ayati": [
            "از چه روى آن خدايانى كه سواى اللّه براى تقرب، به خدايى گرفته بودند ياريشان نكردند، بلكه از نظرشان گم شدند؟ اين است دروغ و افترايشان."
          ],
          "fa.bahrampour": [
            "پس چرا كسانى را كه جز خدا براى تقرب، به خدايى گرفته بودند ياريشان نكردند، بلكه از نظرشان ناپديد شدند؟ و اين بود [نتيجه‌ى‌] دروغ آنها و آنچه افترا مى‌بستند"
          ],
          "fa.fooladvand": [
            "پس چرا آن كسانى را كه غير از خدا، به منزله معبودانى، براى تقرّب [به خدا] اختيار كرده بودند، آنان را يارى نكردند بلكه از دستشان دادند؟ و اين بود دروغ آنان و آنچه برمى‌بافتند."
          ],
          "fa.ghomshei": [
            "پس چرا جز خدا معبودانی که به آنها تقرب می‌جستند هیچ آنها را یاری نکردند؟ بلکه از نظرشان محو و نابود شدند؟ و این خدایی آن بتها سخنان بی حقیقت و دروغی بود که خود می‌بافتند."
          ],
          "fa.khorramdel": [
            "پس چرا آن معبودهائی که سوای الله برای نزدیکی به الله، به خدائی گرفته بودند، (در این لحظات سخت و حسّاس) یاریشان نکردند؟! (نه تنها آنان را یاری ندادند) بلکه از ایشان گم و گور شدند! این (چیزی که بر سرشان آمد نتیجه‌ی) دروغ و افترای ایشان بود. [[«فَلَوْ لا»: پس چرا؟ از چه روی؟ «قُرْبَاناً»: برای تقرّب و نزدیکی به خدا. مفعول‌له، یا حال است. «آلِهَةً»: مفعول دوم (إِتَّخَذُوا) است و مفعول اوّل آن محذوف است که (آلِهَةً) است. یعنی إِتَّخَذُوا آلِهَتَهُمْ ... آلِهَةً.]]"
          ],
          "fa.khorramshahi": [
            "پس چرا کسانی که به جای خداوند به پرستششان گرفته بودند، که مایه تقربشان شود، یعنی آن خدایان یاریشان ندادند؟ بلکه از دید آنان گم و گور شدند، و این است افترای ایشان و آنچه بر می‌ساختند"
          ],
          "fa.makarem": [
            "پس چرا معبودانی را که غیر از خدا برگزیدند -به گمان اینکه به خدا نزدیکشان سازد- آنها را یاری نکردند؟! بلکه از میانشان گم شدند! این بود نتیجه دروغ آنها و آنچه افترا می‌بستند!"
          ],
          "fa.moezzi": [
            "پس چرا یاریشان نکردند آنان که برگرفتند جز خدا برای نزدیک شدن به خدا خدایانی بلکه گم شدند از ایشان و این است دروغ ایشان (تهمت ایشان) و آنچه بودند دروغ می‌آوردند"
          ],
          "fa.mojtabavi": [
            "پس چرا آنهايى- خدايانى- كه به جاى خدا براى تقرب [به خدا] به خدايى گرفتند آنان را يارى نكردند؟ بلكه از آنان گم شدند، و اين بود [سرانجام‌] دروغ و بافته‌هاى آنان."
          ],
          "fa.sadeqi": [
            "پس چرا کسانی را که فروتر از خدا را، به منزله‌ی معبودانی، برای تقرّب (به خدا) اختیار کرده بودند، آنان را یاری نکردند، بلکه از آنان پنهان شدند؟ و این بود دروغشان و آنچه به گزاف برمی‌بافته‌اند."
          ]
        }
      },
      {
        "index": 4539,
        "local_index": 29,
        "part_type": "Verse",
        "path": "/books/quran:46:29",
        "text": [
          "وَ إِذْ صَرَفْنَا إِلَيْکَ‌ نَفَراً مِنَ‌ الْجِنِ‌ يَسْتَمِعُونَ‌ الْقُرْآنَ‌ فَلَمَّا حَضَرُوهُ‌ قَالُوا أَنْصِتُوا فَلَمَّا قُضِيَ‌ وَلَّوْا إِلَى‌ قَوْمِهِمْ‌ مُنْذِرِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "And (remember), when We turned a company of jinns towards you to listen to the Qur'an, they arrived when it was being recited, and they said: \"Keep silent.\" When it was over they came back to their people, warning them:"
          ],
          "en.ahmedraza": [
            "And when We sent a number of jinns towards you (O dear Prophet Mohammed – peace and blessings be upon him), listening attentively to the Qur’an; so when they presented themselves there, they said to each other, “Listen quietly!”; and when the recitation finished, they turned back to their people, giving them warning."
          ],
          "en.arberry": [
            "And when We turned to thee a company of jinn giving ear to the Koran; and when they were in its presence they said, 'Be silent!' Then, when it was finished, they turned back to their people, warning."
          ],
          "en.daryabadi": [
            "And recall what time We turned towards thee a company Of the Jinns hearkening Unto the Qur'an. So when they came in the presence thereof they said: give ear. Then when it was ended, they turned back to their people as warners."
          ],
          "en.hilali": [
            "And (remember) when We sent towards you (Muhammad SAW) Nafran (three to ten persons) of the jinns, (quietly) listening to the Quran, when they stood in the presence thereof, they said: \"Listen in silence!\" And when it was finished, they returned to their people, as warners."
          ],
          "en.itani": [
            "Recall when We dispatched towards you a number of jinn, to listen to the Quran. When they came in its presence, they said, “Pay attention!” Then, when it was concluded, they rushed to their people, warning them."
          ],
          "en.maududi": [
            "And call to mind when We sent to you a party of the jinn that they may listen to the Qur'an. When they reached the place (where you were reciting the Qur'an), they said to one another: “Be silent (and listen).” And when the recitation ended, they went back to their people as warners."
          ],
          "en.mubarakpuri": [
            "And (remember) when We sent toward you a group of the Jinn, to listen to the Qur'an. When they attended it, they said: \"Listen quietly!\" And when it was concluded, they returned to their people, as warners."
          ],
          "en.pickthall": [
            "And when We inclined toward thee (Muhammad) certain of the jinn, who wished to hear the Qur'an and, when they were in its presence, said: Give ear! and, when it was finished, turned back to their people, warning."
          ],
          "en.qarai": [
            "When We dispatched toward you a team of jinn listening to the Quran, when they were in its presence, they said, ‘Be silent!’ When it was finished, they went back to their people as warners."
          ],
          "en.qaribullah": [
            "(Remember) how We sent to you (Prophet Muhammad) a company of jinn who, when they came and listened to the Koran, said to each other: 'Be silent' Then, when it was finished, they returned to their nation and warned them."
          ],
          "en.sahih": [
            "And [mention, O Muhammad], when We directed to you a few of the jinn, listening to the Qur'an. And when they attended it, they said, \"Listen quietly.\" And when it was concluded, they went back to their people as warners."
          ],
          "en.sarwar": [
            "We turned a party of jinn towards you to listen to the Quran. When they attended a Quranic recitation, they said to each other, \"Be silent,\" and, when it was over, they turned back to their people, in warning,"
          ],
          "en.shakir": [
            "And when We turned towards you a party of the jinn who listened to the Quran; so when they came to it, they said: Be silent; then when it was finished, they turned back to their people warning (them)."
          ],
          "en.transliteration": [
            "Wai<u>th</u> <u>s</u>arafn<u>a</u> ilayka nafaran mina aljinni yastamiAAoona alqur<u>a</u>na falamm<u>a</u> <u>h</u>a<u>d</u>aroohu q<u>a</u>loo an<u>s</u>itoo falamm<u>a</u> qu<u>d</u>iya wallaw il<u>a</u> qawmihim mun<u>th</u>ireen<b>a</b>"
          ],
          "en.wahiduddin": [
            "Remember how We sent to you a band of jinn who wished to hear the Quran and as they listened to its recitation, they said to one another, \"Be silent and listen,\" and, then when it was finished, they went back to their people, to give them warning."
          ],
          "en.yusufali": [
            "Behold, We turned towards thee a company of Jinns (quietly) listening to the Qur'an: when they stood in the presence thereof, they said, \"Listen in silence!\" When the (reading) was finished, they returned to their people, to warn (them of their sins)."
          ],
          "fa.ansarian": [
            "و [یاد کن] هنگامی که گروهی از جن را به سوی تو متوجه کردیم که قرآن را بشنوند، پس وقتی که نزد قرائت آن حاضر شدند، گفتند: [برای شنیدن قرآن] خاموش باشید. پس چون قرائت پایان یافت به سوی قومشان در حالی که گفتند: بیم دهنده بودند، بازگشتند. شنیدیم که"
          ],
          "fa.ayati": [
            "و گروهى از جن را نزد تو روانه كرديم تا قرآن را بشنوند. چون به حضرتش رسيدند گفتند: گوش فرادهيد. چون به پايان آمد، همانند بيم‌دهندگانى نزد قوم خود بازگشتند."
          ],
          "fa.bahrampour": [
            "و چون تنى چند از جنّيان را به سوى تو روانه كرديم كه قرآن را مى‌شنيدند پس وقتى بر آن حضور يافتند، [به يكديگر] گفتند: ساكت باشيد و بشنويد و چون به پايان رسيد، براى هشدار به سوى قوم خود بازگشتند"
          ],
          "fa.fooladvand": [
            "و چون تنى چند از جِن را به سوى تو روانه كرديم كه قرآن را بشنوند؛ پس چون بر آن حاضر شدند [به يكديگر] گفتند: «گوش فرا دهيد.» و چون به انجام رسيد، هشداردهنده به سوى قوم خود بازگشتند."
          ],
          "fa.ghomshei": [
            "و (یاد آر) وقتی که ما تنی چند از جنّیان را متوجه تو گردانیدیم که استماع آیات قرآن کنند، چون نزد رسول رسیدند با هم گفتند: گوش فرا دهید. چون قرائت تمام شد به سوی قومشان برای هشدار (و تبلیغ و هدایت) باز گردیدند."
          ],
          "fa.khorramdel": [
            "(ای پیغمبر! خاطرنشان ساز) زمانی را که گروهی از جنّیان را به سوی تو روانه کردیم تا قرآن را بشنوند. هنگامی که حاضر آمدند، به یکدیگر گفتند: خاموش باشید و گوش فرا دهید. هنگامی که (تلاوت قرآن) به پایان آمد، به عنوان مبلّغان و دعوت‌کنندگان (همجنسان خود، به آئین آسمانی) به سوی قوم خود برگشتند. [[«صَرَفْنَا»: متوجّه ساختیم. «نَفَراً»: جماعت. گروه. تعدادی میان سه تا چهل کس (نگا: المصحف المیسّر). «أَنصِتُوا»: از مصدر (إنصَات) یعنی خاموش بودن برای گوش فرا دادن (نگا: اعراف / 204). «حَضَرُوهُ»: در خدمتش حاضر آمدند. ضمیر (ه) به قرآن و یا پیغمبر برمی‌گردد. «مُنذِرینَ»: بیم‌دهندگان. یعنی این گروه با شنیدن قرآن مسلمان شدند و برای تبلیغ اسلام و اشاعه خبر دین جدید به سوی همنوعان خود برگشتند و داعیان الی‌الله شدند.]]"
          ],
          "fa.khorramshahi": [
            "و چنین بود که گروهی از جن را متوجه تو ساختیم که به قرآن گوش سپارند، و چون نزد او حضور یافتند گفتند خاموش باشید [و گوش دهید]، و چون سپری شد، هشدارگر به سوی قومشان بازگشتند"
          ],
          "fa.makarem": [
            "(به یاد آور) هنگامی که گروهی از جنّ را به سوی تو متوجّه ساختیم که قرآن را بشنوند؛ وقتی حضور یافتند به یکدیگر گفتند: «خاموش باشید و بشنوید!» و هنگامی که پایان گرفت، به سوی قوم خود بازگشتند و آنها را بیم دادند!"
          ],
          "fa.moezzi": [
            "و گاهی که روی‌آور ساختیم بسویت تنی چند از پریان که قرآن را شنوند پس هنگامی که نزدش آمدند (حضورش را دریافتند) گفتند خموش باشید تا گاهی که پایان یافت بازگشتند بسوی قوم خویش بیم‌دهندگان‌"
          ],
          "fa.mojtabavi": [
            "و [ياد كن‌] آنگاه كه گروهى از پريان را به سوى تو روانه كرديم كه قرآن را مى‌شنيدند، و چون نزدش حاضر آمدند گفتند: خاموش باشيد و گوش فراداريد، و چون [خواندن قرآن‌] به پايان رسيد، براى بيم‌دادن به سوى قوم خود بازگشتند."
          ],
          "fa.sadeqi": [
            "و چون تنی چند از جنّیان را سوی تو روانه کردیم، حال آنکه قرآن را به‌خوبی می‌شنوند؛ پس هنگامی که به محضرش رسیدند (به یکدیگر) گفتند: «(خودتان و دیگران را) ساکت کنید.» و چون به انجام رسید، هشداردهندگان سوی قوم خود بازگشتند."
          ]
        }
      },
      {
        "index": 4540,
        "local_index": 30,
        "part_type": "Verse",
        "path": "/books/quran:46:30",
        "text": [
          "قَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا کِتَاباً أُنْزِلَ‌ مِنْ‌ بَعْدِ مُوسَى‌ مُصَدِّقاً لِمَا بَيْنَ‌ يَدَيْهِ‌ يَهْدِي‌ إِلَى‌ الْحَقِ‌ وَ إِلَى‌ طَرِيقٍ‌ مُسْتَقِيمٍ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "\"O our people:\" they said: \"we have listened to a Book which has come down after Moses, confirming what was (sent down) before it, showing the way to the truth and a path that is straight."
          ],
          "en.ahmedraza": [
            "They said, “O our people! We have indeed heard a Book, sent down after Moosa, which confirms the Books preceding it, and guides towards the Truth and the Straight Path.”"
          ],
          "en.arberry": [
            "They said, 'Our people, we have heard a Book that was sent down after Moses, confirming what was before it, guiding to the truth and to a straight path."
          ],
          "en.daryabadi": [
            "They said: O our people! verily we have hearkened Unto a Book sent down after Musa, confirming that which was before it, guiding Unto the truth and a straight path."
          ],
          "en.hilali": [
            "They said: \"O our people! Verily! We have heard a Book (this Quran) sent down after Musa (Moses), confirming what came before it, it guides to the truth and to a Straight Path (i.e. Islam)."
          ],
          "en.itani": [
            "They said, “O our people, we have heard a Scripture, sent down after Moses, confirming what came before it. It guides to the truth, and to a straight path."
          ],
          "en.maududi": [
            "They said: “Our people, We have heard a Scripture revealed after Moses, verifying the Scriptures revealed before it; it guides to the Truth and to the Straight Way."
          ],
          "en.mubarakpuri": [
            "They said: \"O our people! Verily, we have heard a Book sent down after Musa, confirming what came before it, it guides to the truth and to the straight path.\""
          ],
          "en.pickthall": [
            "They said: O our people! Lo! we have heard a scripture which hath been revealed after Moses, confirming that which was before it, guiding unto the truth and a right road."
          ],
          "en.qarai": [
            "They said, ‘O our people! Indeed, we have heard a Book, which has been sent down after Moses, confirming what was before it. It guides to the truth and to a straight path."
          ],
          "en.qaribullah": [
            "'Our nation' they said: 'we have just been listening to a Book sent down after Moses confirming what came before it and guiding to the truth and to aStraight Path."
          ],
          "en.sahih": [
            "They said, \"O our people, indeed we have heard a [recited] Book revealed after Moses confirming what was before it which guides to the truth and to a straight path."
          ],
          "en.sarwar": [
            "and said, \"Our people, we have listened to the recitation of a Book revealed after Moses. It confirms the Books revealed before and guides to the Truth and the right path."
          ],
          "en.shakir": [
            "They said: O our people! we have listened to a Book revealed after Musa verifying that which is before it, guiding to the truth and to a right path:"
          ],
          "en.transliteration": [
            "Q<u>a</u>loo y<u>a</u> qawman<u>a</u> inn<u>a</u> samiAAn<u>a</u> kit<u>a</u>ban onzila min baAAdi moos<u>a</u> mu<u>s</u>addiqan lim<u>a</u> bayna yadayhi yahdee il<u>a</u> al<u>h</u>aqqi wail<u>a</u> <u>t</u>areeqin mustaqeem<b>in</b>"
          ],
          "en.wahiduddin": [
            "They said, \"O our people, we have heard a Book, which has been sent down after Moses, fulfilling the predictions existing in previous scriptures; it guides to the truth, and to the right path."
          ],
          "en.yusufali": [
            "They said, \"O our people! We have heard a Book revealed after Moses, confirming what came before it: it guides (men) to the Truth and to a Straight Path."
          ],
          "fa.ansarian": [
            "ای قوم ما! به راستی ما کتابی را شنیدیم که پس از موسی نازل شده است، تصدیق کننده همه کتاب های پیش از خود است، به سوی حق و به سوی راه راست هدایت می کند."
          ],
          "fa.ayati": [
            "گفتند: اى قوم ما، ما كتابى شنيديم كه بعد از موسى نازل شده، كتابهاى پيشين را تصديق مى‌كند و به حق و راه راست راه مى‌نمايد."
          ],
          "fa.bahrampour": [
            "گفتند: اى قوم ما! ما كتابى را شنيديم كه بعد از موسى نازل شده و [كتاب‌هاى‌] پيش از خود را تصديق مى‌كند و به سوى حق و به راهى راست هدايت مى‌كند"
          ],
          "fa.fooladvand": [
            "گفتند: «اى قوم ما، ما كتابى را شنيديم كه بعد از موسى نازل شده [و] تصديق‌كننده [كتابهاى‌] پيش از خود است، و به سوى حق و به سوى راهى راست راهبرى مى‌كند."
          ],
          "fa.ghomshei": [
            "گفتند: ای طایفه ما، ما (آیات) کتابی را شنیدیم که پس از موسی نازل شده در حالی که کتب آسمانی تورات و انجیل را که در مقابل او بود به راستی تصدیق می‌کرد و (خلق را) به سوی حق و طریق راست هدایت می‌فرمود."
          ],
          "fa.khorramdel": [
            "اینان گفتند: ای قوم ما! ما به کتابی گوش فرا دادیم که بعد از موسی فرستاده شده است و کتابهای پیش از خود را تصدیق می‌کند (و هماهنگ با کتابهای آسمانی پیشین است)، و به سوی حق رهنمود می‌کند و به راه راست راه می‌نماید. [[«أُنزِلَ مِن بَعْدِ مُوسی»: این که می‌بینیم سخنی از کتاب عیسی یعنی انجیل در میان نیست، بدان خاطر است که تورات کتاب اصلی و متّفق علیه یهودیان و مسیحیان است و انجیل تابع تورات است و حتّی مسیحیان احکام شرائع خود را از آن گرفته و می‌گیرند. بعضی هم گفته‌اند، این گروه از جنّیان از بعثت عیسی و نزول انجیل آگاه نبوده‌اند.]]"
          ],
          "fa.khorramshahi": [
            "گفتند ای هم قومان ما، [آیات‌] کتابی را شنیدیم که پس از موسی فروفرستاده شده، [و] همخوان [کتابهای‌] پیشاپیش خویش است، و به حق و راهی راست رهنمون است‌"
          ],
          "fa.makarem": [
            "گفتند: «ای قوم ما! ما کتابی را شنیدیم که بعد از موسی نازل شده، هماهنگ با نشانه‌های کتابهای پیش از آن، که به سوی حقّ و راه راست هدایت می‌کند."
          ],
          "fa.moezzi": [
            "گفتند ای قوم ما همانا شنیدیم کتابی را فرستاده شده بود پس از موسی تصدیق‌کننده آنچه پیش روی آن است رهبری کند بسوی حقّ و بسوی راهی راست‌"
          ],
          "fa.mojtabavi": [
            "گفتند: اى قوم ما، همانا ما كتابى را شنيديم كه پس از موسى فرو فرستاده شده، باوردارنده كتابهايى است كه در پيش آن است، به حق و به راه راست راه مى‌نمايد"
          ],
          "fa.sadeqi": [
            "گفتند: «ای قوم ما! همانا ما کتابی را شنیدیم. که بعد از موسی نازل شده، حال آنکه تصدیق‌کننده‌ی کتاب‌هایی برابر اوست و سوی حقّ و سوی راهی راست راهبری می‌کند.»"
          ]
        }
      },
      {
        "index": 4541,
        "local_index": 31,
        "part_type": "Verse",
        "path": "/books/quran:46:31",
        "text": [
          "يَا قَوْمَنَا أَجِيبُوا دَاعِيَ‌ اللَّهِ‌ وَ آمِنُوا بِهِ‌ يَغْفِرْ لَکُمْ‌ مِنْ‌ ذُنُوبِکُمْ‌ وَ يُجِرْکُمْ‌ مِنْ‌ عَذَابٍ‌ أَلِيمٍ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O our people, hearken to the summoner of God, and believe in him, so that He may forgive you your sins and save you from a painful doom."
          ],
          "en.ahmedraza": [
            "“O our people! Listen to Allah’s caller and accept faith in Him, so that He may forgive you some of your sins and save you from the painful punishment.”"
          ],
          "en.arberry": [
            "O our people, answer God's summoner, and believe in Him, and He will forgive you some of your sins, and protect you from a painful chastisement."
          ],
          "en.daryabadi": [
            "O our people! answer Allah's summoner and believe in him; He shall forgive you your sins and shall shelter you from a torment afflictive."
          ],
          "en.hilali": [
            "O our people! Respond (with obedience) to Allah's Caller (i.e. Allah's Messenger Muhammad SAW), and believe in him (i.e. believe in that which Muhammad SAW has brought from Allah and follow him). He (Allah) will forgive you of your sins, and will save you from a painful torment (i.e. Hell-fire)."
          ],
          "en.itani": [
            "O our people! Answer the caller to God, and believe in Him; and He will forgive you your sins, and will save you from a painful punishment.”"
          ],
          "en.maududi": [
            "Our people, respond to the call of him who calls you to Allah and believe in him. Allah will forgive your sins and will protect you from a grievous chastisement.”"
          ],
          "en.mubarakpuri": [
            "\"O our people! Respond to Allah's Caller, and believe in him. He (Allah) will forgive you some of your sins, and protect you from a painful torment.\""
          ],
          "en.pickthall": [
            "O our people! respond to Allah's summoner and believe in Him. He will forgive you some of your sins and guard you from a painful doom."
          ],
          "en.qarai": [
            "O our people! Respond to Allah’s summoner and have faith in Him. He will forgive you some of your sins and shelter you from a painful punishment.’"
          ],
          "en.qaribullah": [
            "Our nation, answer the Caller of Allah and believe in Him! He (Allah) will forgive you some of your sins and protect you from a painful punishment."
          ],
          "en.sahih": [
            "O our people, respond to the Messenger of Allah and believe in him; Allah will forgive for you your sins and protect you from a painful punishment."
          ],
          "en.sarwar": [
            "Our people, respond favorably to the Messenger of God and believe in Him. He will forgive your sins and rescue you from the painful torment."
          ],
          "en.shakir": [
            "O our people! accept the Divine caller and believe in Him, He will forgive you of your faults and protect you from a painful punishment."
          ],
          "en.transliteration": [
            "Y<u>a</u> qawman<u>a</u> ajeeboo d<u>a</u>AAiya All<u>a</u>hi wa<u>a</u>minoo bihi yaghfir lakum min <u>th</u>unoobikum wayujirkum min AAa<u>tha</u>bin aleem<b>in</b>"
          ],
          "en.wahiduddin": [
            "Our people, respond to the one who calls you to God. Believe in him! God will forgive you your sins and protect you from a painful punishment."
          ],
          "en.yusufali": [
            "\"O our people, hearken to the one who invites (you) to Allah, and believe in him: He will forgive you your faults, and deliver you from a Penalty Grievous."
          ],
          "fa.ansarian": [
            "ای قوم ما! دعوت کننده [به سوی] خدا [پیامبر اسلام] را اجابت کنید و به او ایمان آورید تا خدا برخی از گناهانتان را بیامرزد و از عذابی دردناک پناهتان دهد؛"
          ],
          "fa.ayati": [
            "اى قوم ما، اين دعوت‌كننده به خدا را پاسخ گوييد و به او ايمان بياوريد تا خدا گناهانتان را بيامرزد و شما را از عذابى دردآور در امان دارد."
          ],
          "fa.bahrampour": [
            "اى قوم ما! دعوت كننده‌ى الهى را اجابت كنيد و به او ايمان آوريد تا [خدا] از گناهانتان بگذرد و شما را از عذابى دردناك پناه دهد"
          ],
          "fa.fooladvand": [
            "اى قوم ما، دعوت‌كننده خدا را پاسخ [مثبت‌] دهيد و به او ايمان آوريد تا [خدا] برخى از گناهانتان را بر شما ببخشايد و از عذابى پر درد پناهتان دهد."
          ],
          "fa.ghomshei": [
            "ای طایفه ما، شما هم داعی حق (محمد مصطفی ص) را اجابت کنید و به او ایمان آرید تا خدا از گناهانتان در گذرد و شما را از عذاب دردناک قیامت نگاه دارد."
          ],
          "fa.khorramdel": [
            "ای قوم ما! سخنان فراخواننده‌ی الهی را بپذیرید، و به او ایمان بیاورید، تا خدا گناهانتان را بیامرزد و شما را در پناه خویش (محفوظ و مصون از عذاب سخت آخرت) دارد. [[«أَجِیبُوا»: پاسخ مثبت دهید. «دَاعِیَ اللهِ»: مراد از داعی الهی، پیغمبر اسلام است. «یَغْفِرْ»: فاعل این فعل، خدا است (نگا: آل‌عمران. 31 و 135). «مِن ذُنُوبِکُمْ»: حرف (مِنْ) زائد است و برای تأکید می‌باشد.]]"
          ],
          "fa.khorramshahi": [
            "ای هم قومان ما دعوتگر الهی را بپذیرید و به او ایمان آورید، تا از گناهانتان درگذرد و شما را از عذابی دردناک در امان دارد"
          ],
          "fa.makarem": [
            "ای قوم ما! دعوت کننده الهی را اجابت کنید و به او ایمان آورید تا گناهانتان را ببخشد و شما را از عذابی دردناک پناه دهد!"
          ],
          "fa.moezzi": [
            "ای قوم ما بپذیرید دعوت‌کننده خدا را و ایمان آرید بدو بیامرزد برای شما از گناهان شما و پناه دهد شما را از عذابی دردناک‌"
          ],
          "fa.mojtabavi": [
            "اى قوم ما، خواننده [به سوى‌] خدا- پيامبر- را اجابت كنيد و به او ايمان آوريد تا [خدا] برخى از گناهانتان را بيامرزد و شما را از عذابى دردناك پناه دهد"
          ],
          "fa.sadeqi": [
            "«ای قوم ما! دعوت‌کننده‌ی (سوی) خدا را اجابت کنید و به او ایمان آرید، تا خدا برخی از گناهانِ دنباله‌دارتان را برایتان بپوشاند و از عذابی پر درد پناهتان دهد.»"
          ]
        }
      },
      {
        "index": 4542,
        "local_index": 32,
        "part_type": "Verse",
        "path": "/books/quran:46:32",
        "text": [
          "وَ مَنْ‌ لاَ يُجِبْ‌ دَاعِيَ‌ اللَّهِ‌ فَلَيْسَ‌ بِمُعْجِزٍ فِي‌ الْأَرْضِ‌ وَ لَيْسَ‌ لَهُ‌ مِنْ‌ دُونِهِ‌ أَوْلِيَاءُ أُولٰئِکَ‌ فِي‌ ضَلاَلٍ‌ مُبِينٍ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "He who does not listen to the summoner of God cannot weaken (the power of) God on earth, nor will he have protectors other than Him. They are clearly in the wrong.\""
          ],
          "en.ahmedraza": [
            "“And whoever does not listen to Allah’s caller cannot escape in the earth, and he has no supporters against Allah; they are in open error.”"
          ],
          "en.arberry": [
            "Whosoever answers not God's summoner cannot frustrate God in the earth, and he has no protectors apart from Him; those are in manifest error."
          ],
          "en.daryabadi": [
            "And whosoever answereth not Allah's summoner, he cannot frustrate His vengeAnce on the earth, and for him there will be, beside Him, no patrons. Those are in error manifest."
          ],
          "en.hilali": [
            "And whosoever does not respond to Allah's Caller, he cannot escape on earth, and there will be no Auliya' (protectors) for him besides Allah (from Allah's Punishment). Those are in manifest error."
          ],
          "en.itani": [
            "He who does not answer the caller to God will not escape on earth, and has no protectors besides Him. Those are in obvious error."
          ],
          "en.maududi": [
            "And he who does not respond to the one who calls to Allah will not be able to frustrate Him on earth, nor will they have anyone to protect them from Allah. Such people are in manifest error."
          ],
          "en.mubarakpuri": [
            "\"And whosoever does not respond to Allah's Caller, he cannot escape on earth, and he will not have besides Allah any protectors. Those are in manifest error.\""
          ],
          "en.pickthall": [
            "And whoso respondeth not to Allah's summoner he can nowise escape in the earth, and he hath no protecting friends instead of Him. Such are in error manifest."
          ],
          "en.qarai": [
            "Those who do not respond to Allah’s summoner cannot frustrate [Allah] on the earth, and they will not find any protectors besides Him. They are in manifest error."
          ],
          "en.qaribullah": [
            "Those who do not answer the Caller of Allah cannot frustrate Allah in the earth, nor shall any one protect them other than Him; those are in clear error'"
          ],
          "en.sahih": [
            "But he who does not respond to the Caller of Allah will not cause failure [to Him] upon earth, and he will not have besides Him any protectors. Those are in manifest error.\""
          ],
          "en.sarwar": [
            "Those who do not favorably respond to the Messenger of God should know that they cannot challenge God on earth and will not have anyone as their guardian besides Him. Such people are in plain error\"."
          ],
          "en.shakir": [
            "And whoever does not accept the-Divine caller, he shall not escape in the earth and he shall not have guardians besides Him, these are in manifest error."
          ],
          "en.transliteration": [
            "Waman l<u>a</u> yujib d<u>a</u>AAiya All<u>a</u>hi falaysa bimuAAjizin fee alar<u>d</u>i walaysa lahu min doonihi awliy<u>a</u>a ol<u>a</u>ika fee <u>d</u>al<u>a</u>lin mubeen<b>in</b>"
          ],
          "en.wahiduddin": [
            "But he who does not respond to God's calls can never elude [Him] on earth, nor can he have any protector against Him. Such people have clearly gone far astray.\""
          ],
          "en.yusufali": [
            "\"If any does not hearken to the one who invites (us) to Allah, he cannot frustrate (Allah's Plan) on earth, and no protectors can he have besides Allah: such men (wander) in manifest error.\""
          ],
          "fa.ansarian": [
            "و آنان که دعوت کننده خدا را اجابت نکنند نمی توانند [خدا را] در زمین عاجز کنند [تا از دسترس قدرت او بیرون روند] و آنان را در برابر خدا یاورانی نیست [که عذاب را از آنان دفع کند]، اینان در گمراهی آشکاری هستند."
          ],
          "fa.ayati": [
            "و هر كس كه به اين دعوت‌كننده جواب نگويد نمى‌تواند در روى زمين از خداى بگريزد و او را جز خدا هيچ ياورى نيست و در گمراهى آشكارى است."
          ],
          "fa.bahrampour": [
            "و هر كه دعوت كننده‌ى الهى را اجابت نكند، عاجز كننده‌ى خدا در زمين نيست و در برابر او هيچ دوست و حمايتگرى نخواهد داشت [و] آنها در گمراهى آشكارند"
          ],
          "fa.fooladvand": [
            "و كسى كه دعوت‌كننده خدا را اجابت نكند، در زمين درمانده‌كننده [خدا] نيست و در برابر او دوستانى ندارد. آنان در گمراهى آشكارى‌اند."
          ],
          "fa.ghomshei": [
            "و هر که داعی حق را اجابت نکند در زمین مفر و پناهی از قهر خدا نتواند یافت و جز او هیچ یار و یاوری نخواهد داشت و چنین کسان در ضلالت و گمراهی آشکار هستند."
          ],
          "fa.khorramdel": [
            "هر کس هم سخنان فراخواننده‌ی الهی را نپذیرد، نمی‌تواند خدای را از دستیابی به خود در زمین ناتوان کند (و خویشتن را از چنگال عذاب الهی پناه دهد، و از دست انتقام او بگریزد)، و برای او جز خدا هیچ ولیها و یاورهائی نیست. چنین کسانی در گمراهی آشکاری هستند. [[«لَیْسَ بِمُعْجِزٍ فِی‌الأرْضِ»: (نگا: هود / 20، نور / 57، عنکبوت / 22).]]"
          ],
          "fa.khorramshahi": [
            "و هر کس دعوتگر الهی را نپذیرد، بداند که در [این سر] زمین گزیر و گریزی ندارد، و در برابر او سرورانی ندارد، اینانند که در گمراهی آشکارند"
          ],
          "fa.makarem": [
            "و هر کس به دعوت کننده الهی پاسخ نگوید، هرگز نمی‌تواند از چنگال عذاب الهی در زمین فرار کند، و غیر از خدا یار و یاوری برای او نیست؛ چنین کسانی در گمراهی آشکارند!»"
          ],
          "fa.moezzi": [
            "و آنکه اجابت نکند دعوت خدا را پس نیست عاجزکننده در زمین و نیستش جز او دوستانی آنانند در گمراهی آشکار"
          ],
          "fa.mojtabavi": [
            "و هر كه خواننده خداى را اجابت نكند، پس [بداند كه‌] در زمين ناتوان‌كننده [خداى از عذاب‌كردن‌] نيست، و او را جز او"
          ],
          "fa.sadeqi": [
            "«و هر کس دعوت‌کننده‌ی سوی خدا را اجابت نکند، در زمین درمانده‌کننده‌ی (خدا و خداییان) نیست و پس از او اولیایی ندارد. اینان در گمراهی آشکارگرند.»"
          ]
        }
      },
      {
        "index": 4543,
        "local_index": 33,
        "part_type": "Verse",
        "path": "/books/quran:46:33",
        "text": [
          "أَ وَ لَمْ‌ يَرَوْا أَنَ‌ اللَّهَ‌ الَّذِي‌ خَلَقَ‌ السَّمَاوَاتِ‌ وَ الْأَرْضَ‌ وَ لَمْ‌ يَعْيَ‌ بِخَلْقِهِنَ‌ بِقَادِرٍ عَلَى‌ أَنْ‌ يُحْيِيَ‌ الْمَوْتَى‌ بَلَى‌ إِنَّهُ‌ عَلَى‌ کُلِ‌ شَيْ‌ءٍ قَدِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "Do they not realise that God who created the heavens and the earth, and did not tire creating them, is able to bring the dead to life? And why not? He has the power over everything."
          ],
          "en.ahmedraza": [
            "Have they not realised that Allah, Who did not tire in creating the heavens and the earth and in creating them, is Able to revive the dead? Surely yes, why not? Indeed He is Able to do all things."
          ],
          "en.arberry": [
            "What, have they not seen that God who created the heavens and earth, not being wearied by creating them, is able to give life to the dead? Yes indeed; He is powerful over everything."
          ],
          "en.daryabadi": [
            "Bethink they not that Allah Who created the heavens and the earth and was not fatigued with the creation thereof, is able to quicken the dead? Aye! verily He is over everything Potent."
          ],
          "en.hilali": [
            "Do they not see that Allah, Who created the heavens and the earth, and was not wearied by their creation, is Able to give life to the dead? Yes, He surely is Able to do all things."
          ],
          "en.itani": [
            "Do they not realize that God, who created the heavens and the earth, and was never tired by creating them, is Able to revive the dead? Yes indeed; He is Capable of everything."
          ],
          "en.maududi": [
            "Do they not see that Allah, Who created the heavens and the earth -- and creating them did not wear Him out -- has the power to bring the dead back to life? Why not! He certainly has the power over everything."
          ],
          "en.mubarakpuri": [
            "Do they not see that Allah, Who created the heavens and the earth, and was not wearied by their creation, is Able to give life to the dead Yes, He surely is Able to do all things."
          ],
          "en.pickthall": [
            "Have they not seen that Allah, Who created the heavens and the earth and was not wearied by their creation, is Able to give life to the dead? Aye, He verily is Able to do all things."
          ],
          "en.qarai": [
            "Do they not see that Allah, who created the heavens and the earth and [who] was not exhausted by their creation, is able to revive the dead? Yes, indeed He has power over all things."
          ],
          "en.qaribullah": [
            "Have they not seen that it is Allah who created the heavens and the earth and was not wearied by their creation, and that He is Able to restore the dead tolife? Yes, He has power over all things!"
          ],
          "en.sahih": [
            "Do they not see that Allah, who created the heavens and earth and did not fail in their creation, is able to give life to the dead? Yes. Indeed, He is over all things competent."
          ],
          "en.sarwar": [
            "Have they not seen that God has created the heavens and the earth and that He experienced no fatigue in doing this. He has the power to bring the dead back to life. Certainly He has power over all things."
          ],
          "en.shakir": [
            "Have they not considered that Allah, Who created the heavens and the earth and was not tired by their creation, is able to give life to the dead? Aye! He has surely power over all things."
          ],
          "en.transliteration": [
            "Awalam yaraw anna All<u>a</u>ha alla<u>th</u>ee khalaqa a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>a walam yaAAya bikhalqihinna biq<u>a</u>dirin AAal<u>a</u> an yu<u>h</u>yiya almawt<u>a</u> bal<u>a</u> innahu AAal<u>a</u> kulli shayin qadeer<b>un</b>"
          ],
          "en.wahiduddin": [
            "Have they not seen that God, who created the heavens and the earth and was not wearied by their creation, has the power to bring the dead back to life? Yes, indeed, He has power over all things."
          ],
          "en.yusufali": [
            "See they not that Allah, Who created the heavens and the earth, and never wearied with their creation, is able to give life to the dead? Yea, verily He has power over all things."
          ],
          "fa.ansarian": [
            "آیا ندانسته اند خدایی که آسمان ها و زمین را آفرید و از آفرینش آنها درمانده و خسته نشد، قدرت دارد که مردگان را زنده کند؟ آری، او بر هر کاری تواناست؛"
          ],
          "fa.ayati": [
            "آيا نمى‌بينند كه خداى يكتاست آن كه آسمانها و زمين را بيافريد و در آفريدن آنها در نماند. او مى‌تواند مردگان را زنده كند. بلى او بر هر كارى تواناست."
          ],
          "fa.bahrampour": [
            "آيا نديدند آن خدايى كه آسمان‌ها و زمين را آفريد و در آفريدن آنها درمانده نشد، قادر است مردگان را زنده كند؟ آرى! او بر هر كارى تواناست"
          ],
          "fa.fooladvand": [
            "مگر ندانسته‌اند كه آن خدايى كه آسمانها و زمين را آفريده و در آفريدن آنها درمانده نگرديد؛ مى‌تواند مردگان را [نيز] زنده كند؟ آرى، اوست كه بر همه چيز تواناست."
          ],
          "fa.ghomshei": [
            "آیا کافران ندیدند خدایی که آسمانها و زمین را آفرید و هیچ از آفرینش آنها فرو نماند البته هم او قادر بر آن است که مردگان را باز زنده کند؟ آری البته او بر هر چیز قادر است."
          ],
          "fa.khorramdel": [
            "آیا نمی‌دانند خدائی که آسمانها و زمین را آفریده است و در آفرینش آنها خسته و درمانده نشده است، می‌تواند مردگان را زنده کند؟! آری، او بر هر کاری توانا است. [[«لَمْ یَعْیَ»: درمانده نشده است. از ماده (عیی).]]"
          ],
          "fa.khorramshahi": [
            "آیا نیندیشیده‌اند که خداوندی که آسمانها و زمین را آفریده است، و در آفرینش آنها در نمانده است، توانای آن است که مردگان را زنده بدارد، آری او بر هر کاری تواناست‌"
          ],
          "fa.makarem": [
            "آیا آنها نمی‌دانند خداوندی که آسمانها و زمین را آفریده و از آفرینش آنها ناتوان نشده است، می‌تواند مُردگان را زنده کند؟! آری او بر هر چیز تواناست!"
          ],
          "fa.moezzi": [
            "آیا ندیدند آنکه خداوندی که آفرید آسمانها و زمین را و خسته نگردید از آفریدن آنها توانا است که زنده کند مُردگان را بلی همانا او است بر همه چیز توانا"
          ],
          "fa.mojtabavi": [
            "آيا نديده‌ايد- ندانسته‌اند- كه آن خداى كه آسمانها و زمين را آفريد و در آفريدن آنها ناتوان و وامانده نشد تواناست بر اينكه مردگان را زنده كند؟ آرى، او بر هر چيزى تواناست."
          ],
          "fa.sadeqi": [
            "آیا و ندانستند آن خدایی که آسمان‌ها و زمین را آفرید -حال آنکه در آفریدن آنها درمانده نگردید- می‌تواند مردگان را (نیز) زنده کند؟ آری، همواره اوست که بر همه چیزی بسیار تواناست."
          ]
        }
      },
      {
        "index": 4544,
        "local_index": 34,
        "part_type": "Verse",
        "path": "/books/quran:46:34",
        "text": [
          "وَ يَوْمَ‌ يُعْرَضُ‌ الَّذِينَ‌ کَفَرُوا عَلَى‌ النَّارِ أَ لَيْسَ‌ هٰذَا بِالْحَقِ‌ قَالُوا بَلَى‌ وَ رَبِّنَا قَالَ‌ فَذُوقُوا الْعَذَابَ‌ بِمَا کُنْتُمْ‌ تَکْفُرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "The day the unbelievers will be stood before the Fire, (they will be asked:) \"Is this not the reality?\" They will answer: \"In truth, by our Lord!\" It will be said: \"Then taste the torment of what you had denied.\""
          ],
          "en.ahmedraza": [
            "And on the day when the disbelievers are presented upon the fire; it will be said, “Is this not a reality?” They will answer, “By oath of our Lord, surely yes, why not?”; it will be said, “Therefore taste the punishment, the recompense of your disbelief.”"
          ],
          "en.arberry": [
            "Upon the day when the unbelievers are exposed to the Fire: 'Is not this the truth?' They shall say, 'Yes, by our Lord!' He shall say, 'Then taste the chastisement of your unbelief!'"
          ],
          "en.daryabadi": [
            "And on the Day whereon those who disbelieve will be placed before the Fire: is this not real? They will say: yea, by our Lord. He will say: taste wherefore the torment, for ye have been disbelieving."
          ],
          "en.hilali": [
            "And on the Day when those who disbelieve will be exposed to the Fire (it will be said to them): \"Is this not the truth?\" They will say: \"Yes, By our Lord!\" He will say: \"Then taste the torment, because you used to disbelieve!\""
          ],
          "en.itani": [
            "On the Day when those who disbelieved are presented to the Fire: “Is this not real?” They will say, “Yes, indeed, by our Lord.” He will say, “Then taste the suffering for having disbelieved.”"
          ],
          "en.maududi": [
            "On the Day when the unbelievers will be brought within sight of the Fire, they will be asked: “Is this not the Truth?” and they will answer “Yes, by Our Lord (this is the Truth).” Allah will say: “Then suffer the chastisement as a requital for your disbelieving.”"
          ],
          "en.mubarakpuri": [
            "And on the Day when those who disbelieve will be exposed to the Fire (it will be said to them): \"Is this not the truth\" They will say: \"Yes, by our Lord!\" He will say: \"Then taste the torment, because you used to disbelieve!\""
          ],
          "en.pickthall": [
            "And on the day when those who disbelieve are exposed to the Fire (they will be asked): Is not this real? They will say: Yea, by our Lord. He will say: Then taste the doom for that ye disbelieved."
          ],
          "en.qarai": [
            "The day when the faithless are exposed to the Fire, [He will say,] ‘Is this not a fact?’ They will say, ‘Yes, by our Lord!’ He will say, ‘So taste the punishment because of what you used to disbelieve.’"
          ],
          "en.qaribullah": [
            "On the Day when the unbelievers are brought before the Fire they shall be asked: 'Is this not the truth' 'Yes, by our Lord' they will answer. He will say:'Then taste the punishment, for you were unbelievers'"
          ],
          "en.sahih": [
            "And the Day those who disbelieved are exposed to the Fire [it will be said], \"Is this not the truth?\" They will say, \"Yes, by our Lord.\" He will say, \"Then taste the punishment because you used to disbelieve.\""
          ],
          "en.sarwar": [
            "On the day when the disbelievers will be exposed to the fire, they will be asked, \"Is this not real?\" They will say, \"Yes, Our Lord, it is real\" He will say, \"Suffer the torment for your disbelief\"."
          ],
          "en.shakir": [
            "And on the day when those who disbelieve shall be brought before the fire: Is it not true? They shall say: Aye! by our Lord! He will say: Then taste the punishment, because you disbelieved."
          ],
          "en.transliteration": [
            "Wayawma yuAAra<u>d</u>u alla<u>th</u>eena kafaroo AAal<u>a</u> a<b>l</b>nn<u>a</u>ri alaysa h<u>atha</u> bi<b>a</b>l<u>h</u>aqqi q<u>a</u>loo bal<u>a</u> warabbin<u>a</u> q<u>a</u>la fa<u>th</u>ooqoo alAAa<u>tha</u>ba bim<u>a</u> kuntum takfuroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "On the Day when those who deny the truth will be brought before the Fire, they shall be asked, \"Is this not the truth?\" They will reply, \"Yes, by our Lord.\" He will say, \"Then taste the punishment, because of your denial of the truth.\""
          ],
          "en.yusufali": [
            "And on the Day that the Unbelievers will be placed before the Fire, (they will be asked,) \"Is this not the Truth?\" they will say, \"Yea, by our Lord!\" (One will say:) \"Then taste ye the Penalty, for that ye were wont to deny (Truth)!\""
          ],
          "fa.ansarian": [
            "و روزی که کافران را بر آتش عرضه می کنند [از آنان می پرسند:] آیا این حق نیست؟ می گویند: آری! سوگند به پروردگارمان حق است، [پرسش کننده] می گوید: پس این عذاب را برای آنکه همواره کفر می ورزیدید، بچشید."
          ],
          "fa.ayati": [
            "روزى كه كافران به آتش عرضه شوند: آيا اين حقيقت نيست؟ گويند: بلى، به پروردگارمان سوگند. گويد: به خاطر كفرى كه مى‌ورزيده‌ايد، اينك عذاب را بچشيد."
          ],
          "fa.bahrampour": [
            "و روزى كه كافران بر آتش عرضه شوند [منادى گويد:] آيا اين [آتش‌] حق نيست؟ گويند: چرا، به پروردگارمان سوگند [كه حق است‌]. گويد: پس به سزاى اين كه انكار مى‌كرديد عذاب را بچشيد"
          ],
          "fa.fooladvand": [
            "و روزى كه كافران بر آتش عرضه مى‌شوند [از آنان مى‌پرسند:] «آيا اين راست نيست؟» مى‌گويند: «سوگند به پروردگارمان كه آرى.» مى‌فرمايد: «پس به [سزاى‌] آنكه انكار مى‌كرديد عذاب را بچشيد.»"
          ],
          "fa.ghomshei": [
            "و روزی که کافران را بر آتش دوزخ عرضه کنند (به آنها گویند) آیا این وعده دوزخ حقیقت نبود؟ گویند: بلی به پروردگارمان سوگند که حق بود. خدا گوید: پس امروز به کیفر کفرتان سختی عذاب دوزخ را بچشید."
          ],
          "fa.khorramdel": [
            "روزی کافران را به کنار دوزخ می‌برند و ایشان را بر آن عرضه می‌کنند (و بدیشان گفته می‌شود:) آیا این حقیقت ندارد؟! می‌گویند: بلی، سوگند به پروردگارمان. خدا بدیشان می‌گوید: پس به سبب کفر و ناباوریتان عذاب را بچشید. [[«یُعْرَضُ»: (نگا: غافر / 46، احقاف / 20).]]"
          ],
          "fa.khorramshahi": [
            "و روزی که کافران را به نزدیک آتش [دوزخ‌] بدارند [و از ایشان بپرسند] آیا این [وعده‌] حق نیست؟ گویند چرا سوگند به پروردگارمان گوید پس عذاب را به خاطر آنکه [انکار و] کفرمی‌ورزیدید بچشید"
          ],
          "fa.makarem": [
            "روزی را به یاد آور که کافران را بر آتش عرضه می‌دارند (و به آنها گفته می‌شود:) آیا این حقّ نیست؟! می‌گویند: «آری، به پروردگارمان سوگند (که حقّ است)!» (در این هنگام خداوند) می‌گوید: «پس عذاب را بخاطر کفرتان بچشید!»"
          ],
          "fa.moezzi": [
            "و روزی که عرضه شوند کافران بر آتش آیا نیست این حقّ گفتند بلی سوگند به پروردگار ما گفت پس بچشید عذاب را بدانچه بودید کفر می‌ورزیدید"
          ],
          "fa.mojtabavi": [
            "و روزى كه كافران را بر آتش دوزخ عرضه كنند [به آنها گويند:] آيا اين حق نيست- كه شما آن را انكار مى‌كرديد-؟ گويند: آرى، به پروردگارمان سوگند [كه حق است خداى‌] گويد: پس بچشيد عذاب را به سزاى آنكه كفر مى‌ورزيديد."
          ],
          "fa.sadeqi": [
            "و روزی که کافران بر آتش نمایش داده می‌شوند (از آنان پرسیده شود:) «آیا این حق نیست‌؟» گویند: «سوگند به پروردگارمان (که) آری!‌» فرمود: «پس به (سزای) آنچه کفر می‌ورزیده‌اید عذاب را بچشید.»"
          ]
        }
      },
      {
        "index": 4545,
        "local_index": 35,
        "part_type": "Verse",
        "path": "/books/quran:46:35",
        "text": [
          "فَاصْبِرْ کَمَا صَبَرَ أُولُوا الْعَزْمِ‌ مِنَ‌ الرُّسُلِ‌ وَ لاَ تَسْتَعْجِلْ‌ لَهُمْ‌ کَأَنَّهُمْ‌ يَوْمَ‌ يَرَوْنَ‌ مَا يُوعَدُونَ‌ لَمْ‌ يَلْبَثُوا إِلاَّ سَاعَةً مِنْ‌ نَهَارٍ بَلاَغٌ‌ فَهَلْ‌ يُهْلَکُ‌ إِلاَّ الْقَوْمُ‌ الْفَاسِقُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "So bear with patience, as the apostles who were constant, bore; and do not be hasty (in demanding punishment) for them. On the day they see what they had been foretold, (they will realise) that they did not stay in the world but only an hour of the day. This is the message to be conveyed: Shall any perish but the ungodly?"
          ],
          "en.ahmedraza": [
            "Therefore patiently endure (O dear Prophet Mohammed – peace and blessings be upon him) like the courageous Noble Messengers had endured, and do not be impatient for them; on the day when they see what they are promised, it will be as if they had not stayed on earth except part of a day; this is to be conveyed; will anyone be destroyed, except the disobedient?"
          ],
          "en.arberry": [
            "So be thou patient, as the Messengers possessed of constancy were also patient. Seek not to hasten it for them -- it shall be as if on the day they see that they are promised, they had not tarried but for an hour of a single day. A Message to be delivered! And shall any be destroyed but the people of the ungodly?"
          ],
          "en.daryabadi": [
            "Bear thou then with patience even as the apostles, endued with resolution bear with patience, and seek not to hasten on for them. On the Day whereon they will behold that wherewith they are threatened, it will seem to them as though they had tarried but an hour of the day. A proclamation this: so none will be destroyed save the nation of transgressors."
          ],
          "en.hilali": [
            "Therefore be patient (O Muhammad SAW) as did the Messengers of strong will and be in no haste about them (disbelievers). On the Day when they will see that (torment) with which they are promised (i.e. threatened, it will be) as if they had not stayed more than an hour in a single day. (O mankind! This Quran is sufficient as) a clear Message (or proclamation to save yourself from destruction). But shall any be destroyed except the people who are Al-Fasiqun (the rebellious, disobedient to Allah)."
          ],
          "en.itani": [
            "So be patient, as the messengers with resolve were patient, and do not be hasty regarding them. On the Day when they witness what they are promised, it will seem as if they had lasted only for an hour of a day. A proclamation: Will any be destroyed except the sinful people?"
          ],
          "en.maududi": [
            "So bear with patience, (O Prophet), even as the Messengers endowed with firmness of resolve (before you) bore with patience, and do not be hasty in their regard. The Day when they see what they had been warned against they will feel as though they had remained in the world no more than an hour of a day. (The Truth has been conveyed.) Will any, then, suffer perdition except those who disobey?"
          ],
          "en.mubarakpuri": [
            "Therefore be patient as did those of determination among the Messengers and be in no hurry for them. On the Day when they will see what they are promised, it will be as though they had not remained (in the world) except an hour in a day. (This is) a clear Message. But will any be destroyed except the defiantly rebellious people"
          ],
          "en.pickthall": [
            "Then have patience (O Muhammad) even as the stout of heart among the messengers (of old) had patience, and seek not to hasten on (the doom) for them. On the day when they see that which they are promised (it will seem to them) as though they had tarried but an hour of daylight. A clear message. Shall any be destroyed save evil-living folk?"
          ],
          "en.qarai": [
            "So be patient just as the resolute among the apostles were patient, and do not seek to hasten [the punishment] for them. The day when they see what they are promised, [it will be] as though they had remained [in the world] only an hour of a day. This is a proclamation. So shall anyone be destroyed except the transgressing lot?"
          ],
          "en.qaribullah": [
            "Be patient, as the Messengers of might were patient, and do not hasten it for them. On the Day when they see what they have been promised, it will be as if they did not stay except an hour of a day. (This Koran is) a Conveyance! Shall any be destroyed except the nation of evildoers?"
          ],
          "en.sahih": [
            "So be patient, [O Muhammad], as were those of determination among the messengers and do not be impatient for them. It will be - on the Day they see that which they are promised - as though they had not remained [in the world] except an hour of a day. [This is] notification. And will [any] be destroyed except the defiantly disobedient people?"
          ],
          "en.sarwar": [
            "(Muhammad), exercise patience as did the steadfast Messengers. Do not try to make them suffer the torment immediately; on the day when they will see the torment with which they were threatened, they will think that they had lived no more than an hour. The message has been delivered. No one else will be destroyed except the evil doing people."
          ],
          "en.shakir": [
            "Therefore bear up patiently as did the apostles endowed with constancy bear up with patience and do not seek to hasten for them (their doom). On the day that they shall see what they are promised they shall be as if they had not tarried save an hour of the day. A sufficient exposition! Shall then any be destroyed save the transgressing people?"
          ],
          "en.transliteration": [
            "Fa<b>i</b><u>s</u>bir kam<u>a</u> <u>s</u>abara oloo alAAazmi mina a<b>l</b>rrusuli wal<u>a</u> tastaAAjil lahum kaannahum yawma yarawna m<u>a</u> yooAAadoona lam yalbathoo ill<u>a</u> s<u>a</u>AAatan min nah<u>a</u>rin bal<u>a</u>ghun fahal yuhlaku ill<u>a</u> alqawmu alf<u>a</u>siqoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Have patience, then, as had the steadfast Messengers before you; and be in no haste about them. On the Day when they see what they are threatened with, it will appear to them as though they had not tarried longer than an hour of a day. [Your responsibility is] to deliver the message: and none but the disobedient shall be destroyed."
          ],
          "en.yusufali": [
            "Therefore patiently persevere, as did (all) messengers of inflexible purpose; and be in no haste about the (Unbelievers). On the Day that they see the (Punishment) promised them, (it will be) as if they had not tarried more than an hour in a single day. (Thine but) to proclaim the Message: but shall any be destroyed except those who transgress?"
          ],
          "fa.ansarian": [
            "پس صبر کن همان گونه که پیامبران اولوالعزم صبر کردند، و برای آنان در [نزول عذاب] شتاب مکن، روزی که آنان آنچه را که وعده داده می شوند ببینند، گویی فقط ساعتی از یک روز [در دنیا] درنگ داشتند؛ [این قرآن] ابلاغی است برای همه؛ پس آیا جز مردم نافرمان هلاک می شوند؟"
          ],
          "fa.ayati": [
            "پس پايدارى كن، همچنان كه پيامبران اُولوالعزم پايدارى كرده بودند. و در عقوبتشان شتاب مكن. آن روز كه آن وعده‌اى را كه به آنها داده شده بنگرند، پندارند كه جز به قدر ساعتى از روز در گور درنگ نكرده‌اند. اين تبليغ رسالت است. آيا جز نافرمانان به هلاكت مى‌رسند؟"
          ],
          "fa.bahrampour": [
            "پس صبر كن همان‌گونه كه پيامبران اولو العزم صبر كردند، و شتاب [در عقوبت‌] آنان مكن. روزى كه آنچه را وعده داده مى‌شوند ببينند، [احساس مى‌كنند كه‌] گويى جز ساعتى از يك روز [در دنيا] نبوده‌اند. [اين‌] ابلاغى است. پس آيا جز مردم نافرمان هلاك مى‌شوند"
          ],
          "fa.fooladvand": [
            "پس همان گونه كه پيامبران نستوه، صبر كردند، صبر كن، و براى آنان شتابزدگى به خرج مده. روزى كه آنچه را وعده داده مى‌شوند بنگرند، گويى كه آنان جز ساعتى از روز را [در دنيا] نمانده‌اند؛ [اين‌] ابلاغى است. پس آيا جز مردم نافرمان هلاكت خواهند يافت؟"
          ],
          "fa.ghomshei": [
            "(ای رسول ما) تو هم مانند پیغمبران اولوا العزم (در تبلیغ دین خدا و تحمل اذیّت امت) صبور باش و بر امت به عذاب تعجیل مکن تا روزی که آنچه وعده داده شده به چشم ببینند آن روز پندارند که (در دنیا) به جز ساعتی از روز درنگ نداشتند. (این قرآن و آیات وعده و وعیدش) تبلیغ رسالت و اتمام حجتی است، پس آیا (به قیامت) جز مردم (شهوت پرست) فاسق هیچ کس هلاک خواهد شد؟"
          ],
          "fa.khorramdel": [
            "پس (در برابر اذیّت و آزار کافران) شکیبائی کن، آن گونه که پیغمبران أُولُواالعزم (در سختیها) شکیبائی کرده‌اند، و برای (عذاب) آنان شتاب مکن. روزی که ایشان چیزی را مشاهده می‌کنند که بدیشان وعده داده می‌شد، انگار که آنان مدّتی از یک روز در دنیا مانده‌اند (و زندگی کرده‌اند. این قرآن) ابلاغ است و بسنده است. مگر جز مردمان گناهکار و سرکش از اطاعت خدا، هلاک می‌گردند؟! [[«اِصْبِرْ»: شکیبائی کن. مراد از صبر مطلوب در اینجا علاوه از تحمّل رنجها و دردها، مهلت و فرصت دادن به مردمان و انتظار کشیدن است. یعنی ایشان را نفرین نکردن و درخواست عذاب استیصال ننمودن و با عجله مرگ و نابودیشان را خواستار نشدن. «اَلْعَزْم»: اراده محکم و استوار. تصمیم. ثابت و پایدار. «أُوْلُواْ الْعَزْمِ مِنَ الرُّسُلِ»: پیغمبرانی که دارای اراده استوار و ثبات و پایداری بوده‌اند. حرف (مِنْ) تبعیضیّه است، و اشاره به گروه خاصّی از پیغمبران بزرگ است که صاحب شریعت جدید و آئین تازه بوده‌اند و با گرفتاریها و مشکلات بیشتری روبرو شده‌اند. برخی آنان را پنج نفر می‌دانند که عبارتند از: نوح، ابراهیم، موسی، عیسی، محمّد: بعضی تعداد آنان را بیشتر دانسته‌اند. بعضی هم (مِنْ) را بیانیّه به حساب آورده و همه پیغمبران را أُولُواالعزم بشمار آورده‌اند. «لَمْ یَلْبَثُوا ...»: (نگا: روم / 55، یونس / 45). «بَلاغٌ»: ابلاغ. تبلیغ. بسنده. خبر مبتدای محذوف است: هذَا الْقُرْآنُ بَلاغٌ. این قران تبلیغ آسمانی و بسنده برای زندگی مردمان است. این قرآن آخرین ابلاغ و اخطار است! بپائید به سوی خدا برگردید و بیائید.]]"
          ],
          "fa.khorramshahi": [
            "پس همان گونه که پیامبران نستوه، صبر کردند، صبر کن، و برای آنان [عذاب را] به شتاب مخواه زیرا روزی که آنچه وعده‌شان داده شده است، بنگرند، گویی جز ساعتی از یک روز به سر نبرده‌اند، [این‌] پیامی است، پس به نابودی کشانده نخواهند شد جز قوم نافرمانان‌"
          ],
          "fa.makarem": [
            "پس صبر کن آن‌گونه که پیامبران «اُولو العزم» صبر کردند، و برای (عذاب) آنان شتاب مکن! هنگامی که وعده‌هایی را که به آنها داده می‌شود ببینند، احساس می‌کنند که گویی فقط ساعتی از یک روز (در دنیا) توقّف داشتند؛ این ابلاغی است برای همگان؛ آیا جز قوم فاسق هلاک می‌شوند؟!"
          ],
          "fa.moezzi": [
            "پس شکیبا شو چنانکه شکیبا شدند دارندگان عزم از پیمبران و شتاب نخواه برای ایشان گوئیا ایشان روزی که بنگرند آنچه را وعده داده شوند نمانده‌اند جز ساعتی از روز ابلاغی (رساندنی) است پس آیا نابود شوند جز گروه نافرمانان‌"
          ],
          "fa.mojtabavi": [
            "پس شكيبايى كن، همچنان كه پيامبران أولو العزم- خداوندان آهنگ استوار و جد و پايدارى، يا صاحبان شريعت و كتاب- شكيبايى كردند و براى آنها [عذاب را] به شتاب مخواه. آن روز كه آنچه را وعده داده مى‌شوند ببينند چنان است كه گويى جز ساعتى از يك روز- در دنيا- درنگ نكرده‌اند. [اين قرآن‌] رسانيدن پيام [خدا] است، پس آيا جز مردم بدكار نافرمان هلاك مى‌شوند؟"
          ],
          "fa.sadeqi": [
            "پس چنان که پیامبران اولوالعزم صبر کردند، صبر کن و برای (عذاب) آنان [:کافران] شتابزده مباش. روزی که آنچه را وعده داده می‌شوند بنگرند، گویی آنان جز ساعتی از روز را (در گذشته) نمانده‌اند؛ (این خود) رسانه‌ای (بزرگ) است. پس آیا جز گروه نافرمانان هلاک می‌شوند؟"
          ]
        }
      }
    ]
  },
  "index": "quran:46",
  "kind": "verse_list"
}