{"data": {"crumbs": [{"indexed_titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}, "path": "/books/quran", "titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}}, {"indexed_titles": {"en": "Chapter 47"}, "path": "/books/quran:47", "titles": {"ar": "محمد", "en": "Muhammad", "ent": "Muhammad"}}], "index": 47, "local_index": 47, "order": 95, "part_type": "Chapter", "path": "/books/quran:47", "reveal_type": "Medinan", "rukus": 4, "titles": {"ar": "محمد", "en": "Muhammad", "ent": "Muhammad"}, "verse_count": 38, "verse_start_index": 4545, "verses": [{"index": 4546, "local_index": 1, "part_type": "Verse", "path": "/books/quran:47:1", "text": "الَّذِينَ‌ کَفَرُوا وَ صَدُّوا عَنْ‌ سَبِيلِ‌ اللَّهِ‌ أَضَلَ‌ أَعْمَالَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آنان که کفر ورزیدند و [مردم را] از راه خدا باز داشتند خدا اعمالشان را باطل و تباهساخت؛"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا اعمال كسانى را كه كافر شدند و مردم را از راه خدا باز داشتند باطل ساخته است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "كسانى كه كافر شدند و از راه خدا بازداشتند، [خدا] اعمالشان را تباه كرد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "كسانى كه كفر ورزيدند و [مردم را] از راه خدا باز داشتند، [خدا] اعمال آنان را تباه خواهد كرد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آنان که کافر شدند و راه دین خدا را (بر خلق) بستند خداوند اعمال آنها را تباه و باطل ساخت."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کسانی که کافر می‌گردند و مردمان را از راه خدا باز می‌دارند، خدا همه‌ی کارهای (نیک) ایشان را باطل (قلمداد و بی‌اجر) می‌نماید. [[«صَدُّوا»: بازداشتند. ممانعت بعمل آوردند. «أَضَلَّ»: خدا باطل کرد و سود و اجر آن را از میان برد (نگا: فرقان / 23).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "کسانی که کفرورزیدند و [مردمان را] از راه خدا بازداشتند، [خداوند] اعمالشان را تباه [و بی‌ارزش‌] کرد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کسانی که کافر شدند و (مردم را) از راه خدا بازداشتند، (خداوند) اعمالشان را نابود می‌کند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آنان که کفر ورزیدند و بازداشتند از راه خدا گمراه کرد کردار ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "كسانى كه كافر شدند و [مردم را] از راه خدا باز داشتند [خدا] كردارشان را گم و تباه گردانيد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "کسانی که کفر ورزیدند و (مردمان را) از راه خدا باز داشتند (خدا) اعمال آنان را (تباه و) گمراه کرد."}, {"lang": "en", "name": "Ahmed Ali", "text": "THOSE WHO DISBELIEVE and obstruct (others) from the way of God will have wasted their deeds."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Allah has destroyed the deeds of those who disbelieved and prevented from Allah’s way."}, {"lang": "en", "name": "A. J. Arberry", "text": "Those who disbelieve and bar from God's way, God will send their works astray."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Those who disbelieve and hinder others from the way of Allah, He shall send their works astray."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Those who disbelieve [in the Oneness of Allah, and in the Message of Prophet Muhammad SAW], and hinder (men) from the Path of Allah (Islamic Monotheism), He will render their deeds vain."}, {"lang": "en", "name": "Talal Itani", "text": "Those who disbelieve and repel from the path of God—He nullifies their works."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Allah has caused the works of those who disbelieve and hinder people from the way of Allah to go to waste."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Those who disbelieve and hinder (men) from the path of Allah, He will render their deeds vain."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Those who disbelieve and turn (men) from the way of Allah, He rendereth their actions vain."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Those who are [themselves] faithless and bar [others] from the way of Allah—He has rendered their works fruitless."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Those who disbelieve and bar from the way of Allah, Allah will cause their deeds go astray."}, {"lang": "en", "name": "Saheeh International", "text": "Those who disbelieve and avert [people] from the way of Allah - He will waste their deeds."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God has made devoid of all virtue the deeds of those who have disbelieved and prevented others from the way of God."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "(As for) those who disbelieve and turn away from Allah's way, He shall render their works ineffective."}, {"lang": "en", "name": "English Transliteration", "text": "Alla<u>th</u>eena kafaroo wa<u>s</u>addoo AAan sabeeli All<u>a</u>hi a<u>d</u>alla aAAm<u>a</u>lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "God will bring to naught all the good deeds of those who are bent on denying the truth and bar [others] from the path of God."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Those who reject Allah and hinder (men) from the Path of Allah,- their deeds will Allah render astray (from their mark)."}]}, {"index": 4547, "local_index": 2, "part_type": "Verse", "path": "/books/quran:47:2", "text": "وَ الَّذِينَ‌ آمَنُوا وَ عَمِلُوا الصَّالِحَاتِ‌ وَ آمَنُوا بِمَا نُزِّلَ‌ عَلَى‌ مُحَمَّدٍ وَ هُوَ الْحَقُ‌ مِنْ‌ رَبِّهِمْ‌ کَفَّرَ عَنْهُمْ‌ سَيِّئَاتِهِمْ‌ وَ أَصْلَحَ‌ بَالَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و کسانی که ایمان آورده و کارهای شایسته انجام داده اند و به آنچه بر محمّد نازل شده که از سوی پروردگارشان حق است گرویدند، خدا گناهانشان را از آنان محو کرد و حالشان را اصلاح نمود."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا گناه كسانى را كه ايمان آورده‌اند و كارهاى شايسته كرده‌اند و بدانچه بر محمد نازل شده -كه آن حق است و از جانب پروردگارشان- ايمان آورده‌اند، از آنها زدود و كارهايشان را به صلاح آورد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و آنان كه ايمان آوردند و كارهاى شايسته كردند و به آنچه بر محمد نازل شده- كه آن حق و از جانب پروردگارشان است- ايمان آوردند، [خداوند] بدى‌هايشان را بزدود و كار و بارشان را سامان بخشيد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و آنان كه ايمان آورده و كارهاى شايسته كرده‌اند و به آنچه بر محمد [ص‌] نازل آمده گرويده‌اند -[كه‌] آن خود حق [و] از جانب پروردگارشان است- [خدا نيز] بديهايشان را زدود و حال [و روز]شان را بهبود بخشيد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و آنان که گرویدند و نیکوکار شدند و به قرآنی که بر محمّد (صلی اللّه علیه و آله و سلم) نازل شد که البته بر حق و از جانب خدایشان بود ایمان آوردند خدا از گناهانشان درگذشت و امر (دنیا و دین) آنها را اصلاح فرمود."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "و اما کسانی که ایمان بیاورند و کارهای نیک و شایسته بکنند، و چیزی را باور دارند که بر محمد نازل شده است - و آن هم حق است و از سوی پروردگارشان آمده است - خداوند گناهانشان را می‌بخشاید و بدیهایشان را نادیده می‌گیرد، و حال و وضعشان را خوب می‌سازد. [[«وَ آمَنُوا بِمَا نُزِّلَ عَلی مُحَمَّدٍ»: عطف خاص بر عام است. یعنی خصوصاً ایمان بیاورند به چیزی که بر محمد نازل شده است که قرآن است. «وَ هُوَ الْحَقُّ مِن رَّبِّهِمْ»: جمله معترضه و برای حصر است. یعنی در حال حاضر آنچه حق است و دست نخورده مانده است و درست همان چیزی است که از جانب پروردگارشان آمده است. «بَالَ»: حال. وضع (نگا: یوسف / 50، طه / 51).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و کسانی که ایمان آوردند و کارهای شایسته کردند، و به آنچه بر محمد فروفرستاده شده -که حق است و از جانب پروردگارشانباور داشتند، گناهانشان را زدود و کار و بار ایشان به صلاح آورد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و کسانی که ایمان آوردند و کارهای شایسته انجام دادند و به آنچه بر محمد (ص) نازل شده -و همه حقّ است و از سوی پروردگارشان- نیز ایمان آوردند، خداوند گناهانشان را می‌بخشد و کارشان را اصلاح می‌کند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنان که ایمان آوردند و کردار شایسته کردند و ایمان آوردند بدانچه فرستاده شد بر محمد «ص» و آن است حقّ از پروردگارشان بسترد از ایشان بدیهای ایشان را و بساز آفریدگار بار ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و كسانى كه ايمان آوردند و كارهاى شايسته كردند و به آنچه بر محمد"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و کسانی که ایمان آورده و کارهای شایسته کردند و به آنچه تدریجاً بر محمد (ص)فرود آمد گرویدند - حال آنکه آن (تمامی) حقّ از جانب پروردگارشان است- (خدا نیز) بدی‌های‌شان را زدود و (خاطره‌ی) مهمشان را اصلاح کرد."}, {"lang": "en", "name": "Ahmed Ali", "text": "But those who believe and do the right, and believe what has been revealed to Muhammad, which is the truth from their Lord, will have their faults condoned by Him and their state improved."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And those who accepted faith and did good deeds and believed in what has been sent down upon Mohammed (peace and blessings be upon him) – and that is the truth from their Lord – Allah has relieved them of some of their evils and refined their condition."}, {"lang": "en", "name": "A. J. Arberry", "text": "But those who believe and do righteous deeds and believe in what is sent down to Muhammad -- and it is the truth from their Lord -- He will acquit them of their evil deeds, and dispose their minds aright."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And those who believe and work righteous works and believe in that which hath been revealed Unto Muhammad -and it is the truth from their Lord- He shall expiate their misdeeds from them and shall make good their state."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "But those who believe and do righteous good deeds, and believe in that which is sent down to Muhammad (SAW), for it is the truth from their Lord, He will expiate from them their sins, and will make good their state."}, {"lang": "en", "name": "Talal Itani", "text": "While those who believe, and work righteousness, and believe in what was sent down to Muhammad—and it is the truth from their Lord—He remits their sins, and relieves their concerns."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "As for those who attained to faith and did righteous works and believed in what was revealed to Muhammad -- which indeed is the Truth from their Lord -- Allah has remitted their evil deeds and has set their condition right."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "But those who believe and do righteous good deeds, and believe in that which is sent down to Muhammad -- for it is the truth from their Lord -- He expiates from them their sins and amends their Bal."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And those who believe and do good works and believe in that which is revealed unto Muhammad - and it is the truth from their Lord - He riddeth them of their ill-deeds and improveth their state."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "But those who have faith and do righteous deeds and believe in what has been sent down to Muhammad—and it is the truth from their Lord—He shall absolve them of their misdeeds and set right their affairs."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "As for the believers who do good works and believe in what is sent down to Muhammad which is the truth from their Lord He will acquit them of their sinsand repair their condition."}, {"lang": "en", "name": "Saheeh International", "text": "And those who believe and do righteous deeds and believe in what has been sent down upon Muhammad - and it is the truth from their Lord - He will remove from them their misdeeds and amend their condition."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God forgives the sins and reforms the hearts of the righteously striving believers who have faith in what is revealed to Muhammad - which is the Truth from his Lord."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And (as for) those who believe and do good, and believe in what has been revealed to Muhammad, and it is the very truth from their Lord, He will remove their evil from them and improve their condition."}, {"lang": "en", "name": "English Transliteration", "text": "Wa<b>a</b>lla<u>th</u>eena <u>a</u>manoo waAAamiloo a<b>l</b><u>ssa</u>li<u>ha</u>ti wa<u>a</u>manoo bim<u>a</u> nuzzila AAal<u>a</u> mu<u>h</u>ammadin wahuwa al<u>h</u>aqqu min rabbihim kaffara AAanhum sayyi<u>a</u>tihim waa<u>s</u>la<u>h</u>a b<u>a</u>lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "As for those who believe and do good deeds and believe in what has been revealed to Muhammad, and it is the truth from their Lord, God will remove their sins from them and set their condition right."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "But those who believe and work deeds of righteousness, and believe in the (Revelation) sent down to Muhammad - for it is the Truth from their Lord,- He will remove from them their ills and improve their condition."}]}, {"index": 4548, "local_index": 3, "part_type": "Verse", "path": "/books/quran:47:3", "text": "ذٰلِکَ‌ بِأَنَ‌ الَّذِينَ‌ کَفَرُوا اتَّبَعُوا الْبَاطِلَ‌ وَ أَنَ‌ الَّذِينَ‌ آمَنُوا اتَّبَعُوا الْحَقَ‌ مِنْ‌ رَبِّهِمْ‌ کَذٰلِکَ‌ يَضْرِبُ‌ اللَّهُ‌ لِلنَّاسِ‌ أَمْثَالَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "این به سبب آن است که کافران از باطل پیروی کردند، و مؤمنان از حق که از سوی پروردگار آنان است، پیروی نمودند. این گونه خدا برای مردم اوصافشان را بیان می کند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و اين بدان سبب است كه كافران از باطل پيروى كردند و آنان كه ايمان آوردند از حقى كه از جانب پروردگارشان آمده بود، پيروى كردند. خدا براى مردم اينچنين مثَل مى‌زند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اين بدان سبب است كه آنها كه كافر شدند، از باطل پيروى كردند، و كسانى كه ايمان آوردند از حق كه از جانب پروردگارشان است پيروى نمودند. بدين‌سان خداوند براى مردم وصف حالشان را بيان مى‌كند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اين بدان سبب است كه آنان كه كفر ورزيدند، از باطل پيروى كردند، و كسانى كه ايمان آوردند از همان حق -كه از جانب پروردگارشان است- پيروى كردند. اين گونه خدا براى [بيدارى‌] مردم مثالهايشان را مى‌زند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "این (تباهی حال کافران و اصلاح مؤمنان) بدان سبب است که کافران پیرو (آراء و عقاید اهل) باطل گردیدند و اهل ایمان پیرو (قرآن) حق که از جانب خدایشان نازل گردید شدند. این گونه صریح خدا مثال حال مردم را بیان می‌کند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "این بدان خاطر است که کافران از باطل پیروی می‌کنند و مؤمنان از حقی پیروی می‌کنند که از سوی پروردگارشان آمده است. اینگونه خدا برای مردم مثالهای (حسنات یا سیّئات) ایشان را بیان می‌دارد. [[«ذلِکَ»: اشاره به ابطال اعمال کافران، و عفو سیئات و اصلاح حال مؤمنان است. «أَمْثَالَهُمْ»: ضرب‌المثلهای احوال و اوصاف دو گروه کافر و مؤمن. چرا که برای همگان روشن است که کافر دائماً از حق گریزان و به دنبال باطل روان است. و مؤمن همیشه از حق پیروی می‌کند و متمسک بدان است. سرانجام آن، زیان و نقمت، و سرانجام این، سود و نعمت است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "این از آن است که کافران از باطل پیروی کرده‌اند، و[لی‌] مؤمنان از حق پیروی کرده‌اند که از جانب پروردگارشان است، بدین‌سان خداوند برای مردم مثلهایشان را می‌زند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "این بخاطر آن است که کافران از باطل پیروی کردند، و مؤمنان از حقّی که از سوی پروردگارشان بود تبعیّت نمودند؛ این‌گونه خداوند برای مردم مثَلهای (زندگی) آنان را بیان می‌کند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "این بدانست که آنان که کفر ورزیدند پیروی کردند باطل را و آنان که ایمان آوردند پیروی کردند حقّ را از پروردگارشان بدینسان زند خدا برای مردم مثَلهای ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اين از آن روست كه كسانى كه كافر شدند باطل را پيروى كردند و كسانى كه ايمان آوردند حق را كه از پروردگارشان است پيروى كردند. بدين سان خداوند براى مردم حالهاشان را بيان مى‌كند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "این بدین سبب است که آنان که کفر ورزیدند، بی‌گمان از باطل پیروی کردند. و کسانی که ایمان آوردند از (تمامی) حق - که از جانب پروردگارشان است - به‌راستی پیروی کردند. این‌گونه خدا برای (بیداری) مردمان مثال‌هایشان را می‌زند."}, {"lang": "en", "name": "Ahmed Ali", "text": "That is because those who refuse to believe only follow what is false; but those who believe follow the truth from their Lord. That is how God gives men precepts of wisdom."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "This is because the disbelievers followed falsehood and the believers followed the Truth which is from their Lord; this is how Allah illustrates the examples of people to them."}, {"lang": "en", "name": "A. J. Arberry", "text": "That is because those who disbelieve follow falsehood, and those who believe follow the truth from their Lord. Even so God strikes their similitudes for men."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "That is because those who disbelieve follow the falsehood, and those who believe follow the truth from their Lord. And thus Allah propoundeth Unto mankind their similitude."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "That is because those who disbelieve follow falsehood, while those who believe follow the truth from their Lord. Thus does Allah set forth their parables for mankind."}, {"lang": "en", "name": "Talal Itani", "text": "That is because those who disbelieve follow falsehoods, while those who believe follow the truth from their Lord. God thus cites for the people their examples."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "That is because those who disbelieved followed falsehood whereas those who believed followed the Truth that came to them from their Lord. Thus does Allah set forth to people parables showing their true state."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "That is because those who disbelieve follow falsehood, while those who believe follow the truth from their Lord. Thus does Allah set forth for mankind their parables."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "That is because those who disbelieve follow falsehood and because those who believe follow the truth from their Lord. Thus Allah coineth their similitudes for mankind."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "That is because the faithless follow falsehood, and the faithful follow the truth from their Lord. That is how Allah draws comparisons for mankind."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "This is because the unbelievers follow falsehood while the believers follow the truth from their Lord. As such Allah sets forth for people their examples."}, {"lang": "en", "name": "Saheeh International", "text": "That is because those who disbelieve follow falsehood, and those who believe follow the truth from their Lord. Thus does Allah present to the people their comparisons."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "This is because the disbelievers have followed falsehood and the believers have followed the Truth from their Lord. Thus God explains to the human being their own prospects."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "That is because those who disbelieve follow falsehood, and have given them their dowries, taking (them) in marriage, not fornicating nor taking them for paramours in secret; and whoever denies faith, his work indeed is of no account, and in the hereafter he shall be one of the losers."}, {"lang": "en", "name": "English Transliteration", "text": "<u>Tha</u>lika bianna alla<u>th</u>eena kafaroo ittabaAAoo alb<u>at</u>ila waanna alla<u>th</u>eena <u>a</u>manoo ittabaAAoo al<u>h</u>aqqa min rabbihim ka<u>tha</u>lika ya<u>d</u>ribu All<u>a</u>hu li<b>l</b>nn<u>a</u>si amth<u>a</u>lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "That is because the ones who deny the truth follow falsehood, while those who believe follow the Truth from their Lord. Thus God sets forth comparisons for mankind."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "This because those who reject Allah follow vanities, while those who believe follow the Truth from their Lord: Thus does Allah set forth for men their lessons by similitudes."}]}, {"index": 4549, "local_index": 4, "part_type": "Verse", "path": "/books/quran:47:4", "text": "فَإِذَا لَقِيتُمُ‌ الَّذِينَ‌ کَفَرُوا فَضَرْبَ‌ الرِّقَابِ‌ حَتَّى‌ إِذَا أَثْخَنْتُمُوهُمْ‌ فَشُدُّوا الْوَثَاقَ‌ فَإِمَّا مَنّاً بَعْدُ وَ إِمَّا فِدَاءً حَتَّى‌ تَضَعَ‌ الْحَرْبُ‌ أَوْزَارَهَا ذٰلِکَ‌ وَ لَوْ يَشَاءُ اللَّهُ‌ لاَنْتَصَرَ مِنْهُمْ‌ وَ لٰکِنْ‌ لِيَبْلُوَ بَعْضَکُمْ بِبَعْضٍ‌ وَ الَّذِينَ‌ قُتِلُوا فِي‌ سَبِيلِ‌ اللَّهِ‌ فَلَنْ‌ يُضِلَ‌ أَعْمَالَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "پس هنگامی که [در میدان جنگ] با کافران روبرو شدید، گردن هایشان را به شدت بزنید تا آن گاه که بسیاری از آنان را با سختی و غلظت از پای درآورید، در این هنگام [از دشمن اسیر بگیرید و] آنان را محکم ببندید، [پس از اسیر گرفتن] یا بر آنان منت نهید [و آزادشان کنید]، یا از آنان [در برابر آزاد کردنشان] فدیه و عوض بگیرید تا آنجا که جنگ بارهای سنگینش را بر زمین نهد. این است [فرمان خدا]؛ و اگر خدا می خواست [خود بدون فرمان جنگ] از آنان انتقام می گرفت [ولی به جنگ فرمان داد] تا برخی از شما را به وسیله برخی دیگر بیازماید، و کسانی که در راه خدا به شهادت رسیده اند، خدا هرگز اعمالشان را باطل و تباه نمی کند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "چون با كافران روبرو شديد، گردنشان را بزنيد. و چون آنها را سخت فرو كوفتيد، اسيرشان كنيد و سخت ببنديد. آنگاه يا به منت آزاد كنيد يا به فديه. تا آنگاه كه جنگ به پايان آيد. و اين است حكم خدا. و اگر خدا مى‌خواست، از آنان انتقام مى‌گرفت، ولى خواست تا شما را به يكديگر بيازمايد. و آنان كه در راه خدا كشته شده‌اند اعمالشان را باطل نمى‌كند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "پس چون با كافران روبه رو شديد [مهلت ندهيد و] گردن‌ها را بزنيد، تا چون آنها را از پاى در آورديد، بندها [ى اسيران‌] را محكم كنيد، آن‌گاه يا به منّت [آزادشان كنيد] يا به فديه، تا جنگ بارهايش را فرو نهد. اين [فرمان خداست‌]، و اگر خدا مى‌خواست خود از ايشا"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "پس چون با كسانى كه كفر ورزيده‌اند برخورد كنيد، گردنها[يشان‌] را بزنيد. تا چون آنان را [در كشتار] از پاى درآورديد، پس [اسيران را] استوار در بند كشيد؛ سپس يا [بر آنان‌] منّت نهيد [و آزادشان كنيد] و يا فديه [و عوض از ايشان بگيريد]، تا در جنگ، اسلحه بر زمين گذاشته شود. اين است [دستور خدا]؛ و اگر خدا مى‌خواست، از ايشان انتقام مى‌كشيد، ولى [فرمان پيكار داد] تا برخى از شما را به وسيله برخى [ديگر] بيازمايد، و كسانى كه در راه خدا كشته شده‌اند، هرگز كارهايشان را ضايع نمى‌كند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "شما مؤمنان چون (در میدان جنگ) با کافران رو به رو شوید باید (شجاعانه) آنها را گردن زنید تا آن گاه که از خونریزی بسیار دشمن را از پا در آوردید پس از آن، اسیران جنگ را محکم به بند کشید که بعدا یا بر آنها منّت نهید (و آنها را آزاد گردانید) یا فدا گیرید تا در نتیجه جنگ سختیهای خود را فروگذارد. این حکم فعلی است، و اگر خدا بخواهد خود از کافران انتقام می‌کشد (و همه را بی زحمت جنگ شما هلاک می‌کند) و لیکن (با این جنگ کفر و ایمان) می‌خواهد شما را به یکدیگر امتحان کند، و آنان که در راه خدا کشته شدند خدا هرگز اعمالشان را ضایع نگرداند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "هنگامی که با کافران (در میدان جنگ) روبه‌رو می‌شوید، گردنهایشان را بزنید، و همچنان ادامه دهید تا به اندازه‌ی کافی دشمن را (با کشتن و زخمی‌کردن) ضعیف و درهم می‌کوبید. در این هنگام (اسیران را) محکم ببندید، بعدها یا بر آنان منّت می‌گذارید (و بدون عوض آزادشان می‌کنید) و یا (در برابر آزادی از آنان) فدیه می‌گیرید (خواه با معاوضه‌ی اسراء و خواه با دریافت اموال. این وضع همچنان ادامه خواهد داشت) تا جنگ بارهای سنگین خود را بر زمین می‌نهد و نبرد پایان می‌گیرد. برنامه این است، و اگر خدا می‌خواست خودش (از طریقهای دیگری همچون طوفان و زلزله و سیل و غرق و به زمین فرو بردن، و سایر بلایا و مصائب، بدون جنگ شما) از آنان انتقام می‌گرفت. امّا خدا خواسته است بعضی از شما را با بعضی دیگر بیازماید (و مؤمنان راستین را با جهاد با کافران امتحان نماید). کسانی که در راه خدا کشته می‌شوند، خداوند هرگز کارهایشان را نادیده نمی‌گیرد و بی‌مزد نمی‌گذارد. [[«فَضَرْبَ الرِّقَابِ»: مصدر در معنی امر است. یعنی گردنهایشان را بزنید و ایشان را بکشید. مفعول مطلق فعل محذوفی است. «الْوَثَاقَ»: ریسمان و طنابی که اسیران و بندیان با آن محکم بسته می‌شوند. «مَنّاً»: منّت نهادن. مراد آزاد کردن اسیر بدون عوض و تاوان و غرامت جنگی از دشمن است. مفعول مطلق فعل محذوفی است. «فِدَآءً»: فدیه. تاوان و غرامت جنگی. «أَثْخَنتُمُوهُمْ»: ایشان را با کشتن و مجروح کردن ضعیف کردید و از پای درآوردید (نگا: انفال / 67). «أَوْزَار»: جمع وِزْر، بارهای سنگین (نگا: نحل / 25، طه / 87). «حَتّی تَضَعَ الْحَرْبُ أَوْزَارَهَا»: تا جنگ به پایان می‌رسد. «ذلِکَ»: برنامه این است. به همین منوال است. «إِنتَصَرَ مِنْهُمْ»: بر آنان چیره و از ایشان انتقام گرفت. «فَلَن یُضِلَّ ...»: (نگا: محمد / 1).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "پس چون با کافران [حربی‌] رو به رو شوید، گردنهایشان را بزنید تا آنکه ایشان را به زانو در آورید [و در دست شما اسیر شوند] آنگاه بندهایشان را سخت استوار کنید، و پس از آن یا منت نهید [و رها کنید بدون فدیه‌] یا فدیه بستانید [و رها کنید]، تا اهل کارزار بارهای [سلاح‌] خود را فرو گذارد، چنین است [حکم الهی‌]، و اگر خداوند می‌خواست از ایشان انتقام می‌کشید، ولی [چنین کرد] تا بعضی از شما را به بعضی دیگر بیازماید، و کسانی که در راه خدا کشته شده‌اند، هرگز [خداوند] اعمالشان را تباه [و بی‌ارزش‌] نخواهد کرد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و هنگامی که با کافران (جنایت‌پیشه) در میدان جنگ روبه‌رو شدید گردنهایشان را بزنید، (و این کار را همچنان ادامه دهید) تا به اندازه کافی دشمن را در هم بکوبید؛ در این هنگام اسیران را محکم ببندید؛ سپس یا بر آنان منّت گذارید (و آزادشان کنید) یا در برابر آزادی از آنان فدیه [= غرامت‌] بگیرید؛ (و این وضع باید همچنان ادامه یابد) تا جنگ بار سنگین خود را بر زمین نهد، (آری) برنامه این است! و اگر خدا می‌خواست خودش آنها را مجازات می‌کرد، اما می‌خواهد بعضی از شما را با بعضی دیگر بیازماید؛ و کسانی که در راه خدا کشته شدند، خداوند هرگز اعمالشان را از بین نمی‌برد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "پس هر گاه رسیدید بدانان که کفر ورزیدند پس زدن گردنها تا گاهی که بخون آغشته سازیدشان پس استوار کنید بستن را سپس یا منّت نهادنی پس از این و یا فدیه گرفتنی تا بگذارد جنگ بارهای خود را این و اگر می‌خواست خدا هر آینه پیروزی می‌جست برایشان و لیکن تا بیازماید گروهی از شما را به گروهی و آنان که کشته شدند و در راه خدا گم نکند هرگز کردار ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "پس چون با كافران [در كارزار] روبرو شديد، گردنها [شان‌] را بزنيد تا آنگاه كه [با كشتنشان‌] بر آنها چيره شويد پس [اسير گيريد و] بند را استوار كنيد- تا نگريزند- آنگاه يا منّت نهيد [و آزادشان كنيد] و يا [آنها را] بازفروشيد- به مال يا معاوضه اسيران- تا جنگ بارهاى خود را بنهد- به پايان رسد-. اين است [فرمان خدا]، و اگر خدا مى‌خواست از آنان كين مى‌ستاند- بى‌آنكه شما را فرمان جنگ دهد- و ليكن خواست تا برخى‌تان را به برخى بيازمايد. و كسانى كه در راه خدا كشته شدند، كردارهاشان را هرگز گم و تباه نمى‌كند"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس چون با کسانی که کفر ورزیده‌اند برخورد کنید، پس (باید همتتان) زدن گردن‌هاشان و گردن‌کشانشان (باشد) تا هنگامی که آنان را (در کشتار) از پای درآوردید. پس (اسیران را) به شدت در بند کشید؛ در نتیجه یا (بر آنان) منّت نهید (و آزادشان کنید) و یا فدیه بگیرید (که عوضشان را از اسیرانتان بازپس گیرید) تا جنگ، سنگینی‌ها‌یش را فرونهد. این است (دستور خدا) و اگر خدا بخواهد، از ایشان انتقام می‌کشد، ولی (فرمان پیکار داد) تا برخی از شما را به وسیله‌ی برخی (دیگر) بیازماید. و کسانی که در راه خدا کشته شده‌اند، هرگز (خدا) کارهایشان را ضایع نمی‌کند."}, {"lang": "en", "name": "Ahmed Ali", "text": "So, when you clash with the unbelievers, smite their necks until you overpower them, then hold them in bondage. Then either free them graciously or after taking a ransom, until war shall have come to end. If God had pleased He could have punished them (Himself), but He wills to test some of you through some others. He will not allow the deeds of those who are killed in the cause of God to go waste."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "So when you confront the disbelievers, strike at their necks; until when you have slain them in plenty, tie them up firmly; then after that, you may either release them as a favour or take ransom, until the war lays down its ordeal; this is it; and had Allah willed He Himself could have taken revenge from them, but this is to test some of you with others; and Allah will surely never waste the deeds of those who were killed in His way."}, {"lang": "en", "name": "A. J. Arberry", "text": "When you meet the unbelievers, smite their necks, then, when you have made wide slaughter among them, tie fast the bonds; then set them free, either by grace or ransom, till the war lays down its loads. So it shall be; and if God had willed, He would have avenged Himself upon them; but that He may try some of you by means of others. And those who are slain in the way of God, He will not send their works astray."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Now when ye meet those who disbelieve, smite their necks until when ye have slain them greatly, then make fast the bonds; then, thereafter let them off either freely or by ransom, until the war layeth down the burthens thereof. That ye shall do. And had Allah willed, He would have vindicated Himself against them, but He ordained fighting in order that He may prove you one by the other. And those who are slain in the way of Allah, He shall not send their works astray."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "So, when you meet (in fight Jihad in Allah's Cause), those who disbelieve smite at their necks till when you have killed and wounded many of them, then bind a bond firmly (on them, i.e. take them as captives). Thereafter (is the time) either for generosity (i.e. free them without ransom), or ransom (according to what benefits Islam), until the war lays down its burden. Thus [you are ordered by Allah to continue in carrying out Jihad against the disbelievers till they embrace Islam (i.e. are saved from the punishment in the Hell-fire) or at least come under your protection], but if it had been Allah's Will, He Himself could certainly have punished them (without you). But (He lets you fight), in order to test you, some with others. But those who are killed in the Way of Allah, He will never let their deeds be lost,"}, {"lang": "en", "name": "Talal Itani", "text": "When you encounter those who disbelieve, strike at their necks. Then, when you have routed them, bind them firmly. Then, either release them by grace, or by ransom, until war lays down its burdens. Had God willed, He could have defeated them Himself, but He thus tests some of you by means of others. As for those who are killed in the way of God, He will not let their deeds go to waste."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "When you meet the unbelievers (in battle), smite their necks until you have crushed them, then bind your captives firmly; thereafter (you are entitled to) set them free, either by an act of grace, or against ransom, until the war ends. That is for you to do. If Allah had so willed, He would have Himself exacted retribution from them. (But He did not do so) that He may test some of you by means of others. As for those who are slain in the way of Allah, He shall never let their works go to waste."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "So, when you meet those who disbelieve (in battle), smite (their) necks until you have fully defeated them, then tighten their bonds. Thereafter (is the time) either for generosity or ransom, until the war lays down its burden. Thus, and had Allah so willed, He could have taken vengeance against them;--but (He lets you struggle) so as to test with one another. But those who are killed in the way of Allah, He will never let their deeds be lost."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Now when ye meet in battle those who disbelieve, then it is smiting of the necks until, when ye have routed them, then making fast of bonds; and afterward either grace or ransom till the war lay down its burdens. That (is the ordinance). And if Allah willed He could have punished them (without you) but (thus it is ordained) that He may try some of you by means of others. And those who are slain in the way of Allah, He rendereth not their actions vain."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "When you meet the faithless in battle, strike their necks. When you have thoroughly decimated them, bind the captives firmly. Thereafter either oblige them [by setting them free] or take ransom, until the war lays down its burdens. That [is Allah’s ordinance]. Had Allah wished He could have taken vengeance on them, but that He may test some of you by means of others. As for those who were slain in the way of Allah, He will not let their works go fruitless."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Therefore, when you meet the unbelievers smite their necks, then, when you have killed many of them, tie the bonds. Then, either free them by grace orransom until war shall lay down its loads, in this way, it shall be. Had Allah willed, He would have been victorious over them; except that He might test you, the oneby the means of others. As for those who are killed in the Way of Allah, He will not let their works to go astray."}, {"lang": "en", "name": "Saheeh International", "text": "So when you meet those who disbelieve [in battle], strike [their] necks until, when you have inflicted slaughter upon them, then secure their bonds, and either [confer] favor afterwards or ransom [them] until the war lays down its burdens. That [is the command]. And if Allah had willed, He could have taken vengeance upon them [Himself], but [He ordered armed struggle] to test some of you by means of others. And those who are killed in the cause of Allah - never will He waste their deeds."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "If you encounter the disbelievers in a battle, strike-off their heads. Take them as captives when they are defeated. Then you may set them free as a favor to them, with or without a ransom, when the battle is over. This is the Law. Had God wanted, He could have granted them (unbelievers) victory, but He wants to test you through each other. The deeds of those who are killed for the cause of God will never be without virtuous results."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "So when you meet in battle those who disbelieve, then smite the necks until when you have overcome them, then make (them) prisoners, and afterwards either set them free as a favor or let them ransom (themselves) until the war terminates. That (shall be so); and if Allah had pleased He would certainly have exacted what is due from them, but that He may try some of you by means of others; and (as for) those who are slain in the way of Allah, He will by no means allow their deeds to perish."}, {"lang": "en", "name": "English Transliteration", "text": "Fai<u>tha</u> laqeetumu alla<u>th</u>eena kafaroo fa<u>d</u>arba a<b>l</b>rriq<u>a</u>bi <u>h</u>att<u>a</u> i<u>tha</u> athkhantumoohum fashuddoo alwath<u>a</u>qa faimm<u>a</u> mannan baAAdu waimm<u>a</u> fid<u>a</u>an <u>h</u>att<u>a</u> ta<u>d</u>aAAa al<u>h</u>arbu awz<u>a</u>rah<u>a</u> <u>tha</u>lika walaw yash<u>a</u>o All<u>a</u>hu la<b>i</b>nta<u>s</u>ara minhum wal<u>a</u>kin liyabluwa baAA<u>d</u>akum bibaAA<u>d</u>in wa<b>a</b>lla<u>th</u>eena qutiloo fee sabeeli All<u>a</u>hi falan yu<u>d</u>illa aAAm<u>a</u>lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "When you meet those who deny the truth in battle, strike them in the neck, and once they are defeated, make [them] prisoners, and afterwards either set them free as an act of grace, or let them ransom [themselves] until the war is finally over. Thus you shall do; and if God had pleased, He would certainly have exacted retribution from them, but His purpose is to test some of you by means of others. As for those who are killed in God's cause, He will never let their deeds be in vain;"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Therefore, when ye meet the Unbelievers (in fight), smite at their necks; At length, when ye have thoroughly subdued them, bind a bond firmly (on them): thereafter (is the time for) either generosity or ransom: Until the war lays down its burdens. Thus (are ye commanded): but if it had been Allah's Will, He could certainly have exacted retribution from them (Himself); but (He lets you fight) in order to test you, some with others. But those who are slain in the Way of Allah,- He will never let their deeds be lost."}]}, {"index": 4550, "local_index": 5, "part_type": "Verse", "path": "/books/quran:47:5", "text": "سَيَهْدِيهِمْ‌ وَ يُصْلِحُ‌ بَالَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "[خدا] آنان را به زودی [به سرمنزل خوشبختی و کرامت] هدایت می کند و حالشان را اصلاح می نماید؛"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "زودا كه هدايتشان كند و كارهايشان را به صلاح آورد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "به زودى آنها را [به بهشت‌] هدايت مى‌كند و حالشان را نيكو مى‌گرداند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "به زودى آنان را راه مى‌نمايد و حالشان را نيكو مى‌گرداند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آنها را البته به راه سعادت هدایت کند و امورشان را اصلاح فرماید."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "به زودی خداوند آنان را (به سوی مقامات عالیه‌ی بهشت و گفتار نیک و کردار پسندیده) رهنمود می‌کند و حال و وضعشان را خوب و عالی می‌نماید. [[«سَیَهْدِیهِمْ»: (نگا: حج / 23 و 24).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "به زودی ایشان را هدایت می‌کند و کار و بارشان را به صلاح می‌آورد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "بزودی آنان را هدایت نموده و کارشان را اصلاح می‌کند؛"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "زود است رهبریشان کند و ساز آرد سامان ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "زود باشد كه ايشان را راه نمايد و حال و كارشان را به سامان آورد"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "به زودی آنان را راه می‌نماید و یادآوری مهمشان را اصلاح می‌کند."}, {"lang": "en", "name": "Ahmed Ali", "text": "He will show them the way, and better their state,"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "He will soon guide them (towards Paradise) and make them succeed."}, {"lang": "en", "name": "A. J. Arberry", "text": "He will guide them, and dispose their minds aright,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Anon He shall guide them, and shall make good their state."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "He will guide them and set right their state."}, {"lang": "en", "name": "Talal Itani", "text": "He will guide them, and will improve their state of mind."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "He will guide them and set their condition right"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "He will guide them and amend their condition."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "He will guide them and improve their state,"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "He will guide them and set right their affairs,"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "He will guide them and repair their condition;"}, {"lang": "en", "name": "Saheeh International", "text": "He will guide them and amend their condition"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God will lead them to everlasting happiness and improve their condition."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "He will guide them and improve their condition."}, {"lang": "en", "name": "English Transliteration", "text": "Sayahdeehim wayu<u>s</u>li<u>h</u>u b<u>a</u>lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "He will guide them and improve their condition;"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Soon will He guide them and improve their condition,"}]}, {"index": 4551, "local_index": 6, "part_type": "Verse", "path": "/books/quran:47:6", "text": "وَ يُدْخِلُهُمُ‌ الْجَنَّةَ عَرَّفَهَا لَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و آنان را در بهشتی که در دنیا به آنان شناسانده در می آورد."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و به بهشتى كه برايشان وصف كرده است داخلشان سازد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و در بهشتى كه براى آنها معرفى كرده داخلشان مى‌كند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و در بهشتى كه براى آنان وصف كرده، آنان را درمى‌آورد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و در بهشتی که قبلا به منزل و مقاماتشان همه را شناسا کرده وارد کند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "و آنان را به بهشتی داخل خواهد کرد که آن را بدیشان معرفی کرده است (واوصافش را توسّط پیغمبران و کتابهای آسمانی بازگو نموده است). [[«عَرَّفَهَا لَهُمْ»: توسط پیغمبران و کتابهای آسمانی بهشت را بدیشان شناسانده است. منزلها و کاخهای ویژه هر یک را با الهام بدیشان معرفی نموده است، بگونه‌ای که هر کس جایگاه زندگی پرنعمت خود را در بهشت می‌داند، و به هنگام ورود به بهشت یکسره به سوی مقام و مکان خود می‌رود. بهشت را برای ایشان خوشبو کرده است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و به بهشتی که به آنان شناسانده است، در می‌آوردشان‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و آنها را در بهشت (جاویدانش) که اوصاف آن را برای آنان بازگو کرده وارد می‌کند."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و درآردشان ببهشت آراسته است آن را برای ایشان (شناسا ساخته است)"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و به بهشتى درآوردشان كه آن را بديشان شناسانده است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و در بهشتی که آن را برایشان شناسایی داده، ایشان را درمی‌آورد."}, {"lang": "en", "name": "Ahmed Ali", "text": "And will admit them into gardens with which he has acquainted them."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And He will admit them into Paradise – they have been made familiar with it."}, {"lang": "en", "name": "A. J. Arberry", "text": "and He will admit them to Paradise, that He has made known to them."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And He shall make them enter the Garden; He shall have made it known, Unto them."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And admit them to Paradise which He has made known to them (i.e. they will know their places in Paradise more than they used to know their houses in the world)."}, {"lang": "en", "name": "Talal Itani", "text": "And will admit them into Paradise, which He has identified for them."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and will admit them to Paradise with which He has acquainted them."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And admit them to Paradise, which He has made known to them."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And bring them in unto the Garden which He hath made known to them."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "and admit them into paradise, with which He has acquainted them."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "and He will admit them to the Paradise He has made known to them."}, {"lang": "en", "name": "Saheeh International", "text": "And admit them to Paradise, which He has made known to them."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "He will admit them into the Paradise which He has made known to them."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And cause them to enter the garden which He has made known to them."}, {"lang": "en", "name": "English Transliteration", "text": "Wayudkhiluhumu aljannata AAarrafah<u>a</u> lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "He will admit them into the Garden He has already made known to them."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "And admit them to the Garden which He has announced for them."}]}, {"index": 4552, "local_index": 7, "part_type": "Verse", "path": "/books/quran:47:7", "text": "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا إِنْ‌ تَنْصُرُوا اللَّهَ‌ يَنْصُرْکُمْ‌ وَ يُثَبِّتْ‌ أَقْدَامَکُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای مؤمنان! اگر خدا را یاری کنید، خدا هم شما را یاری می کند و گام هایتان را محکم و استوار می سازد؛"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى كسانى كه ايمان آورده‌ايد، اگر خدا را يارى كنيد، شما را يارى خواهد كرد و پايدارى خواهد بخشيد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى كسانى كه ايمان آورده‌ايد! اگر خدا را يارى كنيد، ياريتان مى‌كند و گام‌هايتان را استوار مى‌دارد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى كسانى كه ايمان آورده‌ايد، اگر خدا را يارى كنيد ياريتان مى‌كند و گامهايتان را استوار مى‌دارد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "ای اهل ایمان، شما اگر خدا را یاری کنید (یعنی دین و پیغمبر خدا را) خدا هم شما را یاری کند و ثابت قدم گرداند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای مؤمنان! اگر (دین) خدا را یاری کنید، خدا شما را یاری می‌کند (و بر دشمنانتان پیروز می‌گرداند) و گامهایتان را استوار می‌دارد (و کار و بارتان را استقرار می‌بخشد). [[«یُثَبِّتْ»: (نگا: بقره / 250، آل‌عمران / 147، انفال / 11 و 12).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای کسانی که ایمان آورده‌اید اگر [دین‌] خدا را یاری دهید، شما را یاری می‌دهد و گامهایتان را استوار می‌دارد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای کسانی که ایمان آورده‌اید! اگر (آیین) خدا را یاری کنید، شما را یاری می‌کند و گامهایتان را استوار می‌دارد."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای آنانکه ایمان آوردید اگر یاری کنید خدا را یاریتان کند و استوار سازد قدمهای شما را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى كسانى كه ايمان آورده‌ايد، اگر خداى را يارى كنيد- با يارى‌كردن دينش-، شما را يارى كند و گامهاى شما را استوار بدارد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای کسانی که ایمان آوردید! اگر (دین) خدا را یاری کنید، خدا (هم) یاریتان می‌کند، و گام‌هایتان را استوار می‌دارد."}, {"lang": "en", "name": "Ahmed Ali", "text": "O you who believe, if you help (in the cause of) God He will surely come to your aid, and firmly plant your feet."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O People who Believe! If you help the religion of Allah, He will help you and will stabilise you."}, {"lang": "en", "name": "A. J. Arberry", "text": "O believers, if you help God, He will help you, and confirm your feet."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "O ye who believe! if ye and shall succour Allah, He shall succour you make firm your feet."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O you who believe! If you help (in the cause of) Allah, He will help you, and make your foothold firm."}, {"lang": "en", "name": "Talal Itani", "text": "O you who believe! If you support God, He will support you, and will strengthen your foothold."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Believers, if you aid Allah, He will come to your aid and will plant your feet firmly."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O you who believe! If you support (in the cause of) Allah, He will support you, and make your foothold firm."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O ye who believe! If ye help Allah, He will help you and will make your foothold firm."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O you who have faith! If you help Allah, He will help you and make your feet steady."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believers, if you help Allah, He will help you and strengthen your feet."}, {"lang": "en", "name": "Saheeh International", "text": "O you who have believed, if you support Allah, He will support you and plant firmly your feet."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Believers, if you help God, He will help you and make you steadfast (in your faith)."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O you who believe! if you help (the cause of) Allah, He will help you and make firm your feet."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo in tan<u>s</u>uroo All<u>a</u>ha yan<u>s</u>urkum wayuthabbit aqd<u>a</u>makum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believers! If you succour God, He will succour you and make your footsteps firm."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O ye who believe! If ye will aid (the cause of) Allah, He will aid you, and plant your feet firmly."}]}, {"index": 4553, "local_index": 8, "part_type": "Verse", "path": "/books/quran:47:8", "text": "وَ الَّذِينَ‌ کَفَرُوا فَتَعْساً لَهُمْ‌ وَ أَضَلَ‌ أَعْمَالَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و بر کافران هلاکت و نابودی باد و [خدا] اعمالشان را باطل و تباه ساخت."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "هلاكت و شوربختى باد بر كافران. خدا اعمالشان را باطل كرده است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و كسانى كه كافر شدند، مرگ بر آنها، و [خدا] اعمالشان را نابود كرد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و كسانى كه كفر ورزيدند، نگونسارى بر آنان باد؛ و [خدا] اعمالشان را برباد داد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و آنان که کافر شدند نابود و هلاک شوند و خدا اعمالشان را ضایع و باطل سازد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کافران، مرگ بر آنان باد، و خداوند اعمال (نیک) ایشان را باطل و بیسود گرداناد! [[«الَّذِینَ»: مبتدا و خبر آن محذوف است. تقدیر چنین است: الِّذِینَ کَفَرُوا، أتْعَسَهُمُ اللهُ. یا مفعول به مقدم است. «تَعْساً»: هلاک و نابودی. مفعول مطلق فعل محذوف (أَتْعَسَ) است. «أَضَلَّ»: (نگا: محمد / 1). عطف بر فعل محذوف (أَتْعَسَ) است. جمله دعائی است. یا این که (فَتَعْساً لَّهُمْ) انشائی، و (أَضَلَّ أَعْمَالَهُمْ) اخباری است، و معنی آیه چنین می‌شود: کافران، مرگ بر آنان باد، و خداوند اعمال (نیک) ایشان را باطل و بیسود می‌گرداند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و کسانی که کفرورزیده‌اند بدا به حالشان، [خداوند] اعمالشان را تباه کرده است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و کسانی که کافر شدند، مرگ بر آنان! و اعمالشان نابود باد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنان که کفر ورزیدند پس وای بر ایشان (زشت بادشان) و گم کرد کارهای آنان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و كسانى كه كفر ورزيدند پس نگونسارى و هلاكت باد بر آنان و [خدا] كارهاشان را گم و تباه گردانيد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و کسانی که کفر ورزیدند، پس (خدا) نگونساری بر ایشان نهاد و اعمالشان را بر باد داد."}, {"lang": "en", "name": "Ahmed Ali", "text": "As for the unbelievers, they will suffer misfortunes, and their deeds will be rendered ineffective."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And for those who disbelieve – may they be ruined, and may Allah destroy all their deeds!"}, {"lang": "en", "name": "A. J. Arberry", "text": "But as for the unbelievers, ill chance shall befall them! He will send their works astray."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And those who disbelieve, downfall shall be theirs, and He shall send astray their Works."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "But those who disbelieve (in the Oneness of Allah Islamic Monotheism), for them is destruction, and (Allah) will make their deeds vain."}, {"lang": "en", "name": "Talal Itani", "text": "But as for those who disbelieve, for them is perdition, and He will waste their deeds."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "As to those who disbelieve, perdition lies in store for them and Allah has reduced their works to nought."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "But as for those who disbelieve, misery awaits them, and (Allah) will make their deeds vain."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And those who disbelieve, perdition is for them, and He will make their actions vain."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "As for the faithless, their lot will be to fall [into ruin], and He will render their works fruitless."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "But the unbelievers shall be the destroyed losers. He will bring their deeds to nothing."}, {"lang": "en", "name": "Saheeh International", "text": "But those who disbelieve - for them is misery, and He will waste their deeds."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "The fate of the disbelievers will be to stumble and their deeds will have no virtuous results;"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And (as for) those who disbelieve, for them is destruction and He has made their deeds ineffective."}, {"lang": "en", "name": "English Transliteration", "text": "Wa<b>a</b>lla<u>th</u>eena kafaroo fataAAsan lahum waa<u>d</u>alla aAAm<u>a</u>lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "But as for those who are bent on denying the truth, destruction will be their lot, and [God] will make their deeds come to nothing."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "But those who reject (Allah),- for them is destruction, and (Allah) will render their deeds astray (from their mark)."}]}, {"index": 4554, "local_index": 9, "part_type": "Verse", "path": "/books/quran:47:9", "text": "ذٰلِکَ‌ بِأَنَّهُمْ‌ کَرِهُوا مَا أَنْزَلَ‌ اللَّهُ‌ فَأَحْبَطَ أَعْمَالَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "این برای آن است که آنان آنچه را خدا نازل کرده است خوش نداشتند، پس خدا هم اعمالشان را تباه و بی اثر کرد."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "زيرا آنان چيزى را كه خدا نازل كرده است ناخوش دارند. خدا نيز اعمالشان را نابود كرد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اين بدان سبب است كه آنها آنچه را خدا نازل كرده است خوش نداشتند و [خدا نيز] كارهايشان را نابود كرد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اين بدان سبب است كه آنان آنچه را خدا نازل كرده است خوش نداشتند، و [خدا نيز] كارهايشان را باطل كرد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "این (هلاک کفار) بدان سبب است که آنها از قرآنی که خدا نازل فرمود کراهت و اعراض داشتند پس خدا اعمالشان را محو و نابود فرمود."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "این بدان خاطر است که چیزی را که خداوند فرو فرستاده است دوست نمی‌دارند، و لذا خدا کارهای (نیک) ایشان را هم باطل و بیسود می‌گرداند. [[«ذلِکَ»: این هلاک کافران و پوچ شدن اعمال ایشان. «مَا»: قرآن و تکالیف آسمانی.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "چرا که [وحی‌] فرو فرستاده الهی را ناخوش دارند، پس اعمالشان را تباه [و بی‌ارزش‌] گرداند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "این بخاطر آن است که از آنچه خداوند نازل کرده کراهت داشتند؛ از این رو خدا اعمالشان را حبط و نابود کرد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "این بدان است که ایشان ناخوش داشتند آنچه را فرستاد خدا پس تباه ساخت کارهای ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اين [هلاكت و نگونسارى‌] از آن روست كه آنچه را خدا فروفرستاده است ناخوش داشتند، پس كردارهاشان را تباه و ناچيز ساخت."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "این همواره بدین سبب است که اینان آنچه را خدا نازل کرده هرگز خوش نداشتند، پس (خدا نیز) کارهایشان را فرو ریخت و بی‌ثمر کرد."}, {"lang": "en", "name": "Ahmed Ali", "text": "That is so as they were averse to what has been revealed by God, and their actions will be nullified."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "This is because they disliked what Allah has sent down – He has therefore squandered all their deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "That is because they have been averse to what God has sent down, so He has made their works to fail."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "That is because they detest that which Allah hath sent down, and so He shall make of non-effect their works."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "That is because they hate that which Allah has sent down (this Quran and Islamic laws, etc.), so He has made their deeds fruitless."}, {"lang": "en", "name": "Talal Itani", "text": "That is because they hated what God revealed, so He nullified their deeds."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "That was because they were averse to what Allah had revealed; so He let their works go to waste."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "That is because they hate that which Allah has sent down; so He has made their deeds fruitless."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "That is because they are averse to that which Allah hath revealed, therefor maketh He their actions fruitless."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "That is because they loathed what Allah has sent down, so He made their works fail."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "That is because they hated what Allah has sent down, so He annulled their deeds."}, {"lang": "en", "name": "Saheeh International", "text": "That is because they disliked what Allah revealed, so He rendered worthless their deeds."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "they have hated God's revelation, and thus, He has made their deeds devoid of all virtue."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "That is because they hated what Allah revealed, so He rendered their deeds null."}, {"lang": "en", "name": "English Transliteration", "text": "<u>Tha</u>lika biannahum karihoo m<u>a</u> anzala All<u>a</u>hu faa<u>h</u>ba<u>t</u>a aAAm<u>a</u>lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "It is because they are averse to what God has revealed that He has rendered their deeds futile."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "That is because they hate the Revelation of Allah; so He has made their deeds fruitless."}]}, {"index": 4555, "local_index": 10, "part_type": "Verse", "path": "/books/quran:47:10", "text": "أَ فَلَمْ‌ يَسِيرُوا فِي‌ الْأَرْضِ‌ فَيَنْظُرُوا کَيْفَ‌ کَانَ‌ عَاقِبَةُ الَّذِينَ‌ مِنْ‌ قَبْلِهِمْ‌ دَمَّرَ اللَّهُ‌ عَلَيْهِمْ‌ وَ لِلْکَافِرِينَ‌ أَمْثَالُهَا", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آیا در زمین گردش نکردند تا با تأمل بنگرند که سرانجام کسانی که پیش از آنان بودند، چگونه بود؟ خدا آنان را درهم کوبید و نابود کرد و نیز برای این کافران همانند آنان [عذابی قطعی و ثابت] است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا در زمين سير نكرده‌اند تا بنگرند كه عاقبت كسانى كه پيش از آنها بوده‌اند چگونه بوده است؟ خدا هلاكشان كرد و كافران نيز عاقبتى آنچنان خواهند داشت."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آيا در زمين سير نكردند تا ببينند فرجام كسانى كه پيش از آنها بودند چگونه شد؟ خدا زير و رويشان كرد و كافران را نظاير آن خواهد بود"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "مگر در زمين نگشته‌اند، تا ببينند فرجام كسانى كه پيش از آنها بودند به كجا انجاميده است؟ خدا زير و زبرشان كرد و كافران را نظاير [همين كيفرها در پيش‌] است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آیا در زمین به سیر و سفر نمی‌روند تا به چشم خود عاقبت حال پیشینیان را مشاهده کنند که چگونه آنها را خدا هلاک کرد؟ و این کافران هم مانند آنها به کیفر کفر خود البته می‌رسند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آیا در زمین به گشت و گذار نپرداخته‌اند تا ببینند عاقبت کسانی که پیش از ایشان بوده‌اند به کجا کشیده و چه شده است؟ خداوند آنان را نابود ساخته است (و دمار از روزگارشان را بدر آورده است)، و برای کافران امثال این عواقب و مجازاتها خواهد بود. [[«دَمَّرَ»: هلاک و نابود ساخته است (نگا: اعراف / 137، شعراء / 172، نمل / 51). «أَمْثَالُهَا»: امثال چنین عاقبت یا عقوبتی. ضمیر (هَا) به (عَاقِبَة) برمی‌گردد.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آیا در زمین سیر و سفر نکرده‌اند که بنگرند سرانجام کسانی که پیش از آنان بوده‌اند چگونه بود، که خداوند نابودشان کرد، و سرنوشت کافران همانند آن است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آیا در زمین سیر نکردند تا ببینند عاقبت کسانی که قبل از آنان بودند چگونه بود؟! خداوند آنها را هلاک کرد؛ و برای کافران امثال این مجازاتها خواهد بود!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آیا نگشتند در زمین تا بنگرند چگونه بود فرجام آنان که پیش از ایشان بودند واژگون ساخت خدا بر ایشان و کافران را است نمونه‌های آنها"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آيا در زمين گردش نكردند تا بنگرند سرانجام كسانى كه پيش از آنان بودند چگونه بود؟ خدا آنها را نابود كرد و براى اين كافران نيز همانند آن است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس مگر در زمین نگشته‌اند تا بنگرند فرجام کسانی که پیش از آنها بودند، چگونه بود‌؟ خدا بر (سروسامان)شان هلاکتی ویرانگر فرود آورد، و برای کافران همانندهایش می‌باشد."}, {"lang": "en", "name": "Ahmed Ali", "text": "Have they not journeyed in the land and seen the fate of those before them? Destroyed they were utterly by God; and a similar (fate) awaits the unbelievers."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "So did they not travel in the land to see what sort of fate befell those who preceded them? Allah poured ruin upon them; and for the disbelievers are several like it."}, {"lang": "en", "name": "A. J. Arberry", "text": "What, have they not journeyed in the land and beheld how was the end of those before them? God destroyed them; the unbelievers shall have the likes thereof."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Have they not travelled then on the earth so that they might see how hath been the end of those before them! Allah annihilated them. And for the infidels theirs shall be the like fate therefore."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Have they not travelled through the earth, and seen what was the end of those before them? Allah destroyed them completely and a similar (fate awaits) the disbelievers."}, {"lang": "en", "name": "Talal Itani", "text": "Have they not journeyed through the earth and seen the consequences for those before them? God poured destruction upon them, and for the unbelievers is something comparable."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Have they not journeyed through the land to see the end of those who went before them? Allah utterly destroyed them. These unbelievers are doomed to the same end."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Have they not traveled through the earth and seen what happened in the end to those before them Allah destroyed them completely, and a similar (awaits) the disbelievers."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Have they not travelled in the land to see the nature of the consequence for those who were before them? Allah wiped them out. And for the disbelievers there will be the like thereof."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Have they not travelled through the land so that they may observe how was the fate of those who were before them? Allah destroyed them, and a similar [fate] awaits these faithless."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Have they never journeyed through the land and seen what was the end of those who had gone before them? Allah destroyed them! Likewise it is for theunbelievers,"}, {"lang": "en", "name": "Saheeh International", "text": "Have they not traveled through the land and seen how was the end of those before them? Allah destroyed [everything] over them, and for the disbelievers is something comparable."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Have they not travelled through the land and seen the terrible end of those who lived before them? God brought upon them utter destruction and the disbelievers will also faced similar perdition."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Have they not then journeyed in the land and seen how was the end of those before them: Allah brought down destruction upon them, and the unbelievers shall have the like of it."}, {"lang": "en", "name": "English Transliteration", "text": "Afalam yaseeroo fee alar<u>d</u>i fayan<i><u>th</u></i>uroo kayfa k<u>a</u>na AA<u>a</u>qibatu alla<u>th</u>eena min qablihim dammara All<u>a</u>hu AAalayhim walilk<u>a</u>fireena amth<u>a</u>luh<u>a</u>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Have they not travelled the earth and seen how those before them met their end? God destroyed them utterly: a similar fate awaits those who deny the truth."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Do they not travel through the earth, and see what was the End of those before them (who did evil)? Allah brought utter destruction on them, and similar (fates await) those who reject Allah."}]}, {"index": 4556, "local_index": 11, "part_type": "Verse", "path": "/books/quran:47:11", "text": "ذٰلِکَ‌ بِأَنَ‌ اللَّهَ‌ مَوْلَى‌ الَّذِينَ‌ آمَنُوا وَ أَنَ‌ الْکَافِرِينَ‌ لاَ مَوْلَى‌ لَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "این [پیروزی مؤمنان و نابودی کافران] به سبب این است که خدا سرپرست و یاور کسانی است که ایمان آورده اند، و کافران را سرپرست و یاری نیست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اين بدان سبب است كه خدا ياور كسانى است كه ايمان آورده‌اند. و كافران را هيچ ياورى نيست."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اين بدان سبب است كه خدا دوستدار و مولاى كسانى است كه ايمان آوردند، ولى كافران را مولايى نيست"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "چرا كه خدا سرپرست كسانى است كه ايمان آورده‌اند، ولى كافران را سرپرست [و يارى‌] نيست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "این (معامله خدا با کافران و مؤمنان) بدان سبب است که البته خدا یار و مولای مؤمنان است و کافران هیچ مولا و یاور و یاری ندارند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "این (عاقبت نیک مؤمنان و عاقبت سوء کافران) بدان خاطر است که خداوند سرپرست و یاور مؤمنان است، ولیکن کافران هیچ گونه سرپرست و یاوری ندارند. [[«مَوْلی»: (نگا: انفال / 40، حج / 13 و 78، دخان / 41).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "این از آن است که خداوند سرور مؤمنان است و کافران سروری ندارند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "این برای آن است که خداوند مولا و سرپرست کسانی است که ایمان آوردند؛ امّا کافران مولایی ندارند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "این بدان است که خدا دوست آنانی است که ایمان آوردند و کافران را نیست دوستی (سرپرستی)"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اين از آن روست كه خدا يار و ياور مؤمنان است و كافران را يار و ياورى نيست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "این همواره برای آن است که خدا مولا و سرپرست کسانی است که ایمان آورده‌اند. همانا کافران را هیچ مولایی (ربّانی) نیست."}, {"lang": "en", "name": "Ahmed Ali", "text": "This is so for God is the friend of those who believe while the unbelievers have no friend."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "This is because Allah is the Supporter of the believers, whereas the disbelievers do not have any supporter."}, {"lang": "en", "name": "A. J. Arberry", "text": "That is because God is the Protector of the believers, and that the unbelievers have no protector."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "That is because Allah is the patron of those who believe, and because the infidels! no patron is theirs."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "That is because Allah is the Maula (Lord, Master, Helper, Protector, etc.) of those who believe, and the disbelievers have no Maula (lord, master, helper, protector, etc.)."}, {"lang": "en", "name": "Talal Itani", "text": "That is because God is the Master of those who believe, while the disbelievers have no master."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "That is because Allah is the Protector of the believers whereas the unbelievers have none to protect them."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "That is because Allah is the Protector of those who believe, whereas the disbelievers have no protector."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "That is because Allah is patron of those who believe, and because the disbelievers have no patron."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "That is because Allah is the protector of the faithful, and because the faithless have no protector."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "that is because Allah is the Guardian of the believers, and the unbelievers have no guardian."}, {"lang": "en", "name": "Saheeh International", "text": "That is because Allah is the protector of those who have believed and because the disbelievers have no protector."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God is the guardian of the believers, but the disbelievers have no guardian."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "That is because Allah is the Protector of those who believe, and because the unbelievers shall have no protector for them."}, {"lang": "en", "name": "English Transliteration", "text": "<u>Tha</u>lika bianna All<u>a</u>ha mawl<u>a</u> alla<u>th</u>eena <u>a</u>manoo waanna alk<u>a</u>fireena l<u>a</u> mawl<u>a</u> lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "That is because God is the protector of the believers, and those who deny the truth have no protector at all."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "That is because Allah is the Protector of those who believe, but those who reject Allah have no protector."}]}, {"index": 4557, "local_index": 12, "part_type": "Verse", "path": "/books/quran:47:12", "text": "إِنَ‌ اللَّهَ‌ يُدْخِلُ‌ الَّذِينَ‌ آمَنُوا وَ عَمِلُوا الصَّالِحَاتِ‌ جَنَّاتٍ‌ تَجْرِي‌ مِنْ‌ تَحْتِهَا الْأَنْهَارُ وَ الَّذِينَ‌ کَفَرُوا يَتَمَتَّعُونَ‌ وَ يَأْکُلُونَ‌ کَمَا تَأْکُلُ‌ الْأَنْعَامُ‌ وَ النَّارُ مَثْوًى‌ لَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بی تردید خدا کسانی را که ایمان آورده و کارهای شایسته انجام داده اند، در بهشت هایی کهاز زیرِ [درختانِ] آن نهرها جاری است در می آورد، و در حالی که کافران همواره سرگرم بهره گیری از [کالا و لذت های زودگذر] دنیایند و می خورند، همان گونه که چهارپایان می خورند و جایگاهشان آتش است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا كسانى را كه ايمان آورده‌اند و كارهاى شايسته مى‌كنند، به بهشتهايى كه نهرها در آن جارى است داخل خواهد كرد. ولى كافران از اين جهان متمتع مى‌شوند و چون چارپايان مى‌خورند و جايگاهشان آتش است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "همانا خدا كسانى را كه ايمان آوردند و كارهاى شايسته كردند، به باغ‌هايى داخل مى‌كند كه از پاى درختانش نهرها جارى است. و كسانى كه كافر شدند، [چند صباحى‌] بهره مى‌جويند و مى‌خورند همان گونه كه چهارپايان مى‌خورند، و [سر انجام‌] جايگاهشان آتش است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "خدا كسانى را كه ايمان آورده و كارهاى شايسته كرده‌اند، در باغهايى كه از زير [درختان‌] آنها نهرها روان است درمى‌آورد، و [حال آنكه‌] كسانى كه كافر شده‌اند، [در ظاهر] بهره مى‌برند و همان گونه كه چارپايان مى‌خورند، مى‌خورند، و[لى ]جايگاه آنها آتش است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "البته خدا آنان را که ایمان آورده و نیکوکار شوند در بهشتی که زیر درختانش نهرها جاری است داخل گرداند و آنان که به راه کفر شتافتند به تمتّع و شهوت‌رانی و شکم‌پرستی مانند حیوانات پردازند و عاقبت منزل آنها آتش دوزخ خواهد بود."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "خداوند کسانی را که ایمان بیاورند و کارهای شایسته و بایسته بکنند، به باغهائی از بهشت داخل می‌گرداند که رودبارها و چشمه‌سارها در زیر (کاخها و درختهای) آن روان است. در حالی که کافران (چند روزی از نعمتهای زودگذر جهان) بهره و لذّت می‌برند و همچون چهارپایان (بی‌خبر و غافل از سرانجام کار) می‌چرند و می‌خورند، و (پس از بدرود حیات و گام نهادن به آخرت) آتش دوزخ جایگاه ایشان است. [[«یَتَمَتَّعُونَ»: بهره‌مند می‌شوند. لذت می‌برند و خوش می‌گذرانند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بی‌گمان خداوند کسانی را که ایمان آورده‌اند و کارهای شایسته کرده‌اند، به بوستانهایی در می‌آورد که جویباران از فرودست آن جاری است، و کافران [از ظواهر زندگی‌] بهره بر می‌گیرند و همان گونه که چارپایان می‌خورند، می‌خورند و [می‌خوابند] و آتش [دوزخ‌] جایگاه ایشان است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "خداوند کسانی را که ایمان آوردند و اعمال صالح انجام دادند وارد باغهایی از بهشت می‌کند که نهرها از زیر (درختانش) جاری است؛ در حالی که کافران از متاع زودگذر دنیا بهره می‌گیرند و همچون چهارپایان می‌خورند، و سرانجام آتش دوزخ جایگاه آنهاست!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "همانا خدا درآورد آنان را که ایمان آوردند و کردارهای شایسته کردند باغهائی که روان است زیر آنها جویها و آنان که کفر ورزیدند کامرانی کنند و خورند بدانسان که خورند دامها و آتش است جایگاهی برای آنان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "همانا خدا كسانى را كه ايمان آوردند و كارهاى نيك و شايسته كردند به بهشتهايى درآرد كه از زير آنها جويها روان است. و كسانى كه كافر شدند [از دنيا] كام و بهره مى‌گيرند و همانند چارپايان مى‌خورند و آتش دوزخ جايگاهشان است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "خدا بی‌گمان کسانی را که ایمان آورده و کارهای شایسته(ی ایمانشان) کرده‌اند، در باغ‌هایی که از زیر(درختان سر درهم)‌شان نهرها روان است در می‌آورد. و کسانی که کافر شدند، بهره(ی حیوانی) می‌برند و همان‌گونه که چارپایان می‌خورند، می‌خورند و جایگاه و پایگاهشان آتش است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Verily God will admit those who believe and do the right into gardens with streams of water running by. But the unbelievers revel and carouse and subsist like beasts, and Hell will be their residence."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Allah will indeed admit those who believed and did good deeds into Gardens beneath which rivers flow; and the disbelievers enjoy, and they eat like the cattle eat, and their destination is in the fire."}, {"lang": "en", "name": "A. J. Arberry", "text": "God shall surely admit those who believe and do righteous deeds into gardens underneath which rivers flow. As for the unbelievers, they take their enjoyment and eat as cattle eat; and the Fire shall be their lodging."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Verily Allah shall cause those who believe and work righteous works to enter Gardens whereunder rivers flow. And those who disbelieve enjoy themselves and eat even as the cattle eat, and the Fire shall be the abode for them."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Certainly! Allah will admit those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, to Gardens under which rivers flow (Paradise), while those who disbelieve enjoy themselves and eat as cattle eat, and the Fire will be their abode."}, {"lang": "en", "name": "Talal Itani", "text": "God will admit those who believe and do good deeds into gardens beneath which rivers flow. As for those who disbelieve, they enjoy themselves, and eat as cattle eat, and the Fire will be their dwelling."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Allah shall admit those who believe and do righteous works to the Gardens beneath which rivers flow. As for the unbelievers, they enjoy the pleasures of this transient life and eat as cattle eat. The Fire shall be their resort."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Certainly Allah will admit those who believe and do righteous good deeds, into Gardens under which rivers flow (Paradise); while those who disbelieve enjoy their life and eat as cattle eat; but the Fire will be their abode."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Lo! Allah will cause those who believe and do good works to enter Gardens underneath which rivers flow; while those who disbelieve take their comfort in this life and eat even as the cattle eat, and the Fire is their habitation."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Indeed Allah will admit those who have faith and do righteous deeds into gardens with streams running in them. As for the faithless, they enjoy and eat like the cattle do, and the Fire will be their [final] abode."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Allah will indeed admit those who believe and do good works into Gardens underneath which rivers flow. As for the unbelievers, they take their fill of pleasure and eat as the cattle eat, but the Fire shall be their lodging!"}, {"lang": "en", "name": "Saheeh International", "text": "Indeed, Allah will admit those who have believed and done righteous deeds to gardens beneath which rivers flow, but those who disbelieve enjoy themselves and eat as grazing livestock eat, and the Fire will be a residence for them."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God will admit the righteously striving believers into the gardens wherein streams flow. However, the disbelievers who enjoyed themselves and ate like cattle will have for their dwelling hell fire."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Surely Allah will make those who believe and do good enter gardens beneath which rivers flow; and those who disbelieve enjoy themselves and eat as the beasts eat, and the fire is their abode."}, {"lang": "en", "name": "English Transliteration", "text": "Inna All<u>a</u>ha yudkhilu alla<u>th</u>eena <u>a</u>manoo waAAamiloo a<b>l</b><u>ssa</u>li<u>ha</u>ti jann<u>a</u>tin tajree min ta<u>h</u>tih<u>a</u> alanh<u>a</u>ru wa<b>a</b>lla<u>th</u>eena kafaroo yatamattaAAoona wayakuloona kam<u>a</u> takulu alanAA<u>a</u>mu wa<b>al</b>nn<u>a</u>ru mathwan lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "God will admit those who believe and do good deeds to Gardens through which rivers flow. Those who deny the truth may take their fill of pleasure in this world, and eat as cattle do, but the Fire will be their ultimate abode."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Verily Allah will admit those who believe and do righteous deeds, to Gardens beneath which rivers flow; while those who reject Allah will enjoy (this world) and eat as cattle eat; and the Fire will be their abode."}]}, {"index": 4558, "local_index": 13, "part_type": "Verse", "path": "/books/quran:47:13", "text": "وَ کَأَيِّنْ‌ مِنْ‌ قَرْيَةٍ هِيَ‌ أَشَدُّ قُوَّةً مِنْ‌ قَرْيَتِکَ‌ الَّتِي‌ أَخْرَجَتْکَ‌ أَهْلَکْنَاهُمْ‌ فَلاَ نَاصِرَ لَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "چه بسیار آبادی هایی که [اهلش] از [اهل] آبادی تو که تو را بیرون کرده اند نیرومندتر بودند، ما آنان را هلاک کردیم و یاوری [در برابر عذاب] برای آنان نبود."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "چه قريه‌هايى كه مردمش از مردم قريه تو، كه از آن بيرونت كردند، بسى نيرومندتر بودند كه هلاكشان كرديم و هيچ يارى‌كننده‌اى نداشتند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و بسا شهرها كه نيرومندتر از آن شهرى بود كه تو را بيرون كرد كه ما هلاكشان كرديم و براى آنها هيچ ياورى نبود"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و بسا شهرها كه نيرومندتر از آن شهرى بود كه تو را [از خود] بيرون راند، كه ما هلاكشان كرديم و براى آنها يار [و ياورى‌] نبود."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "چه شهرهای بسیار که از (شهر مکّه) وطن تو که کفّار از آن خارجت کردند محکم بنیان‌تر بود ما اهلش را هلاک کردیم و بر نجات خود هیچ یاوری نداشتند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "چه شهرهای زیادی که (اهالی) آنها از (اهالی) شهری که تو را از آن بیرون کرده‌اند، قدرتمندتر و پرزورتر بوده‌اند، و ما آنان را هلاک و نابود کرده‌ایم، و هیچ یار و یاوری نداشته‌اند (که بدیشان کمک کند و آنان را از دست قهر ما برهاند). [[«کَأَیِّن مِّن قَرْیَةٍ»: (نگا: حج / 45 و 48). «قَرْیَتِکَ»: شهر تو ای محمد که مکه است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و چه بسیار [مردم‌] شهرها که از شهر تو که آواره‌ات کرد نیرومندتر بودند، نابودشان کردیم، و یاوری نداشتند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و چه بسیار شهرهایی که از شهری که تو را بیرون کرد نیرومندتر بودند؛ ما همه آنها را نابود کردیم و هیچ یاوری نداشتند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و بسا شهری که سخت‌تر بود در نیرو از شهر تو که برون راندت نابودشان ساختیم پس نیست یاوری ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و بسا شهرها كه [مردمش‌] از [مردم‌] شهر تو كه بيرونت كردند نيرومندتر بودند، هلاكشان كرديم و هيچ ياورى نداشتند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و چه بسیار از گروه‌هایی که- نیرومندتر از آن گروهی بودند که تو را از قریه‌ات بیرون راندند- ما هلاکشان کردیم. پس برایشان هرگز یاوری نیست."}, {"lang": "en", "name": "Ahmed Ali", "text": "How many were the habitations, mightier than your city which has turned you out, which We destroyed; and they did not have a helper."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And many a township existed which was stronger than your town (O dear Prophet Mohammed – peace and blessings be upon him) – those who removed you from your town – We destroyed them, so they do not have a supporter!"}, {"lang": "en", "name": "A. J. Arberry", "text": "How many a city that was stronger in might than thy city which has expelled thee have We destroyed! And there was no helper for them."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And many a city, mightier In strength than the city which drave thee forth, We destroyed them, and there was no helper of theirs."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And many a town, stronger than your town (Makkah) (O Muhammad SAW) which has driven you out We have destroyed. And there was none to help them."}, {"lang": "en", "name": "Talal Itani", "text": "How many a town was more powerful than your town which evicted you? We destroyed them, and there was no helper for them."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "(O Prophet), how many are the cities that had greater power than your city that drove you out? We destroyed them and there was none to protect them."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And how many a town mightier than your town that has driven you out We have destroyed, with none to help them!"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And how many a township stronger than thy township (O Muhammad) which hath cast thee out, have We destroyed, and they had no helper!"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "How many a town We have destroyed which was more powerful than your town which expelled you, and they had no helper."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "How many a village mightier than your own village, which has expelled you, We have destroyed there was none to help them!"}, {"lang": "en", "name": "Saheeh International", "text": "And how many a city was stronger than your city [Makkah] which drove you out? We destroyed them; and there was no helper for them."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "(Muhammad), how many towns, much more powerful than the one from which you have been expelled, have We destroyed and left helpless?"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And how many a town which was far more powerful than the town of yours which has driven you out: We destroyed them so there was no helper for them."}, {"lang": "en", "name": "English Transliteration", "text": "Wakaayyin min qaryatin hiya ashaddu quwwatan min qaryatika allatee akhrajatka ahlakn<u>a</u>hum fal<u>a</u> n<u>as</u>ira lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "How many towns We have destroyed, greater in strength than your city which has driven you out, and there was no one to help them."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "And how many cities, with more power than thy city which has driven thee out, have We destroyed (for their sins)? and there was none to aid them."}]}, {"index": 4559, "local_index": 14, "part_type": "Verse", "path": "/books/quran:47:14", "text": "أَ فَمَنْ‌ کَانَ‌ عَلَى‌ بَيِّنَةٍ مِنْ‌ رَبِّهِ‌ کَمَنْ‌ زُيِّنَ‌ لَهُ‌ سُوءُ عَمَلِهِ‌ وَ اتَّبَعُوا أَهْوَاءَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آیا کسانی که بر دلیل روشنی از پروردگار خویش اند، مانند کسانی هستند که عمل زشتشان برای آنان آراسته شده و از هواهای نفسانی خود پیروی کرده اند؟"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا كسى كه از جانب پرردگارش دليل روشنى دارد، همانند كسانى است كه كردار بدشان در نظرشان آراسته شده و از پى هواهاى خود مى‌روند؟"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "پس آيا كسى كه از جانب پروردگارش بر راه روشنى قرار دارد، مانند كسى است كه زشتى عملش براى او زينت داده شده و از هوس‌هاى خود پيروى كرده‌اند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آيا كسى كه بر حجتى از جانب پروردگار خويش است، چون كسى است كه بدى كردارش براى او زيبا جلوه داده شده و هوسهاى خود را پيروى كرده‌اند؟"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آیا آن کس که از خدای خود حجت علمی و برهانی (مانند قرآن) در دست دارد مانند کسانی است که عمل زشتشان در نظر زیبا جلوه کرده و پیرو هوای نفسانی خود شدند؟"}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آیا کسانی که از دلائل روشن و براهین قطعی پروردگارشان برخوردارند، همسان کسانیند که اعمال زشتشان در نظرشان آراسته و پیراسته شده است و از هواها و هوسهای خود پیروی می‌کنند؟ [[«عَلی بَیِّنَةٍ مِّن رَّبِّهِ»: شناخت کامل و صحیحی از پروردگار خود دارد. دلائل و براهین قوی از سوی پروردگار خود دارد که رهنمودهای آسمانی است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آیا کسی که به طریقه روشنی از جانب پروردگار خویش است، همانند کسی است که بد عملی‌اش در نظرش آراسته جلوه داده شده و از هوی و هوسهایشان پیروی می‌کنند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آیا کسی که دلیل روشنی از سوی پروردگارش دارد، همانند کسی است که زشتی اعمالش در نظرش آراسته شده و از هوای نفسشان پیروی می‌کنند؟!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آیا آنکه او است بر روشنائی (یا نشانی) از پروردگار خویش مانند آن است که بیاراست برایش زشتی کردارش و پیروی کردند هوسهای خود را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آيا كسى كه بر حجتى روشن از پروردگار خويش است مانند كسى است كه كردار بدش در نظرش آراسته شده، و آرزوها و خواهشهاى دل خويش را پيروى كرده‌اند؟"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "آیا پس کسی که بر حجّتی روشن از جانب پروردگار خویش بوده است، چون کسی است که بدی کردارش برای او زیبا جلوه داده شده‌؟ و (اینان) هوس‌های خودشان را پیروی کردند؟"}, {"lang": "en", "name": "Ahmed Ali", "text": "Can one who stands on a clear proof from his Lord, be like one enamoured of his evil deeds and follows his inane desires?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "So will one who is upon on a clear proof from his Lord, ever be like any of those whose evil deeds are made to appear good to them and they follow their own desires?"}, {"lang": "en", "name": "A. J. Arberry", "text": "What, is he who is upon a clear sign from his Lord like unto such a one unto whom his evil deeds have been decked out fair, and they have followed their caprices?"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Is he then who standeth, on an evidence from his Lord like Unto him whose evil of work is made fair-seeming for him and those who follow their lusts?"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Is he who is on a clear proof from his Lord, like those for whom their evil deeds that they do are beautified for them, while they follow their own lusts (evil desires)?"}, {"lang": "en", "name": "Talal Itani", "text": "Is he who stands upon evidence from his Lord, like someone whose evil deed is made to appear good to him? And they follow their own desires?"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Then, can he, who is on a Clear Guidance from His Lord, be like him whose evil deeds have been embellished to him, and who pursued their lusts?"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Can then he, who stands on clear evidence from his Lord, be like those for whom their evil deeds are beautified for them, while they follow their own lusts"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Is he who relieth on a clear proof from his Lord like those for whom the evil that they do is beautified while they follow their own lusts?"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Is he who stands on a manifest proof from his Lord like those to whom the evil of their conduct is made to seem decorous and who follow their desires?"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Is he who has clear proof from his Lord to be compared to him whose evil deeds are made to seem fair to him, so that they followed their desires?"}, {"lang": "en", "name": "Saheeh International", "text": "So is he who is on clear evidence from his Lord like him to whom the evil of his work has been made attractive and they follow their [own] desires?"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Can the one who follows the authority of his Lord be considered equal to the one whose evil deeds are made to seem attractive to him and who follows his own desires?"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "What! is he who has a clear argument from his Lord like him to whom the evil of his work is made fairseeming: and they follow their low desires."}, {"lang": "en", "name": "English Transliteration", "text": "Afaman k<u>a</u>na AAal<u>a</u> bayyinatin min rabbihi kaman zuyyina lahu sooo AAamalihi wa<b>i</b>ttabaAAoo ahw<u>a</u>ahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Can then he who takes his stand on clear evidence from his God be likened to those for whom the evil that they do is made to look beautiful, and who follow their own desires?"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Is then one who is on a clear (Path) from his Lord, no better than one to whom the evil of his conduct seems pleasing, and such as follow their own lusts?"}]}, {"index": 4560, "local_index": 15, "part_type": "Verse", "path": "/books/quran:47:15", "text": "مَثَلُ‌ الْجَنَّةِ الَّتِي‌ وُعِدَ الْمُتَّقُونَ‌ فِيهَا أَنْهَارٌ مِنْ‌ مَاءٍ غَيْرِ آسِنٍ‌ وَ أَنْهَارٌ مِنْ‌ لَبَنٍ‌ لَمْ‌ يَتَغَيَّرْ طَعْمُهُ‌ وَ أَنْهَارٌ مِنْ‌ خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ‌ وَ أَنْهَارٌ مِنْ‌ عَسَلٍ‌ مُصَفًّى‌ وَ لَهُمْ‌ فِيهَا مِنْ‌ کُلِ‌ الثَّمَرَاتِ‌ وَ مَغْفِرَةٌ مِنْ‌ رَبِّهِمْ‌ کَمَنْ‌ هُوَ خَالِدٌ فِي‌ النَّارِ وَ سُقُوا مَاءً حَمِيماً فَقَطَّعَ‌ أَمْعَاءَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "صفت بهشتی که به پرهیزکاران وعده داده شده [چنین است:] در آن نهرهایی است از آبی که مزه و رنگش برنگشته و نهرهایی از شیر که طعمش دگرگون نشده و نهرهایی از شراب که برای نوشندگان مایه لذت است و نهرهایی از عسل خالص است، و در آن از هر گونه میوه ای برای آنان فراهم است، و نیز آمرزشی از سوی پروردگارشان [ویژه آنان است. آیا اینان] مانند کسانی هستند که در آتش همیشگی و جاودانه اند، واز آبی جوشان به آنان می نوشانند که روده هایشان را متلاشی می کند؟!"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "وصف بهشتى كه به پرهيزگاران وعده داده شده اين است كه در آن نهرهايى است از آبهايى تغييرناپذير و نهرهايى از شيرى كه طعمش دگرگون نمى‌شود و نهرهايى از شراب كه آشامندگان از آن لذت مى‌برند و نهرهايى از عسل مصفى. و در آنجا هرگونه ميوه كه بخواهند هست و نيز آمرزش پروردگارشان. آيا بهشتيان همانند كسانى هستند كه در آتش جاودانه‌اند و آنان را از آبى جوشان مى‌آشامانند چنان كه روده‌هايشان تكه‌تكه مى‌شود؟"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "وصف بهشتى كه به پرهيزگاران وعده داده شده [اين است كه‌] در آن نهرهايى است از آبى كه [رنگ و بو و طعمش‌] برنگردد، و نهرهايى از شيرى كه مزه‌اش دگرگون نشود، و نهرهايى از شراب كه براى نوشندگان لذّتى است، و نهرهايى از عسل مصفا. و در آن جا هر گونه محصول [كه"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "مَثَل بهشتى كه به پرهيزگاران وعده داده شده [چون باغى است كه‌] در آن نهرهايى است از آبى كه [رنگ و بو و طعمش‌] برنگشته؛ و جويهايى از شيرى كه مزه‌اش دگرگون نشود؛ و رودهايى از باده‌اى كه براى نوشندگان لذتى است؛ و جويبارهايى از انگبين ناب. و در آنجا از هر گونه ميوه براى آنان [فراهم‌] است و [از همه بالاتر] آمرزش پروردگار آنهاست. [آيا چنين كسى در چنين باغى دل‌انگيز] مانند كسى است كه جاودانه در آتش است و آبى جوشان به خوردشان داده مى‌شود [تا] روده‌هايشان را از هم فرو پاشد؟"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "داستان بهشتی که به متقیان وعده دادند این است که در آن باغ بهشت نهرهایی از آب زلال دگرگون ناشدنی است و نهرها از شیر بی آنکه هرگز طعمش تغییر کند و نهرها از شراب ناب که نوشندگان را به حد کمال لذّت بخشد و نهرها از عسل مصفّی و تمام انواع میوه‌ها بر آنان مهیّاست و (فوق همه لذّات) مغفرت و لطف پروردگارشان، (آیا حال آن که در این بهشت ابد است) مانند کسی است که در آتش مخلّد است و آب جوشنده حمیم به خوردشان دهند تا اندرونشان را پاره پاره گرداند؟"}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "وصف بهشتی که به پرهیزگاران وعده داده شده است (چنین است که) در آن رودبارهائی از آبی (زلال و خالص) است که گندیده و بدبو نگشته است، و رودبارهائی از شیری است که طعم و مزه‌ی آن متغیّر نشده است، و رودبارهائی از شرابی است که سراپا لذّت برای نوشندگان است، و رودبارهائی از عسلی است که خالص و پالوده است، و در آنجا آنان هرگونه میوه‌ای دارند، و (از همه بالاتر) از آمرزش پروردگارشان برخوردارند (آیا چنین کسانی) همانند کسانیند که در آتش دوزخ جاویدان می‌مانند و از آب داغ و جوشان نوشانده می‌شوند، (آبی که به محض نوشیدن) اندرونه و روده‌های ایشان را پاره پاره می‌کند و از هم می‌گسلد. [[«مَثَلُ»: وصف. صفت. توصیف (نگا: رعد / 35). «غَیْرِ آسِنٍ»: غیر متغیر. فاسد نشده. «لَذَّةٍ»: متلذذ. لذیذ. مصدر است و به معنی اسم فاعل است، و یا این که مؤنث (لَذّ) به معنی لذیذ است. «مُصَفّیً»: خالص. پالوده. عسل بدون موم و لِرد و خاشاک. «أَمْعَآءَ»: جمع مِعیً، روده. اندرونه.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "وصف بهشتی که به پرهیزگاران وعده داده شده است [چنین است که‌] در آن جویهایی از آب ناگندا، و جویهایی از شیری که مزه‌اش تغییرناپذیر است، و جویهایی از شراب لذت‌بخش آشامندگان، و جویهایی از عسل پالوده [روان‌] است، و برایشان در آنجا همه گونه میوه هست، و نیز آمرزشی از جانب پروردگارشان، [آیا چنین کسی‌] همانند کسی است که جاودانه در آتش [دوزخ‌] است؟ و به آنان آبی جوشان نوشانده می‌شود که دل و روده‌هایشان را پاره پاره می‌کند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "توصیف بهشتی که به پرهیزگاران وعده داده شده، چنین است: در آن نهرهایی از آب صاف و خالص که بدبو نشده، و نهرهایی از شیر که طعم آن دگرگون نگشته، و نهرهایی از شراب (طهور) که مایه لذّت نوشندگان است، و نهرهایی از عسل مصفّاست، و برای آنها در آن از همه انواع میوه‌ها وجود دارد؛ و (از همه بالاتر) آمرزشی است از سوی پروردگارشان! آیا اینها همانند کسانی هستند که همیشه در آتش دوزخند و از آب جوشان نوشانده می‌شوند که اندرونشان را از هم متلاشی می‌کند؟!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "مثَل بهشتی که وعده داده شدند پرهیزکاران در آن است جویهائی از آبی ناگشته‌رنگ و جویهائی از شیر ناگشته‌مزه و جویهائی از باده خوشکام برای نوشندگان و جویهائی از انگبین پالوده و ایشان را است از همه میوه‌ها و آمرزشی از پروردگارشان مانند آنکه او است جاودان در آتش و نوشانیده شدند آبی جوشان که پاره پاره ساخت روده‌های آنان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "وصف آن بهشتى كه پرهيزگاران را وعده داده‌اند اين است كه در آن جويهايى است از آبى دگرگون‌نشدنى- نگندد و بوى و مزه آن بر نگردد- و جويهايى از شيرى كه مزه‌اش بر نگردد و جويهايى از باده‌اى كه لذت‌بخش آشامندگان است و جويهايى از عسل ناب و ايشان را در آن"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "مَثَلِ بهشتی که پرهیزگاران (به آن) وعده داده شدند، (این است که) در آن نهرهایی است از آبی که رنگ و بو و طعمش برنگشته‌؛ و نهرهایی از شیری که مزه‌اش دگرگون نشده‌؛ و نهرهایی از باده‌هایی که برای نوشندگان لذّتی است (عاقلانه)؛ و نهرهایی از انگبینِ ناب. و در آنجا از هر گونه ثمراتی برایشان (فراهم) است و (از همه بالاتر) پوششی از پروردگار آنهاست‌. آیا چنین کسی (در چنین باغی دل‌انگیز) مانند کسی است که جاودانه در آتش است و (اینان) آبی جوشان به خوردشان داده شد، پس معده‌هایشان را از هم فرو پاشید؟"}, {"lang": "en", "name": "Ahmed Ali", "text": "The semblance of Paradise promised the pious and devout (is that of a garden) with streams of water that will not go rank, and rivers of milk whose taste will not undergo a change, and rivers of wine delectable to drinkers, and streams of purified honey, and fruits of every kind in them, and forgiveness of their Lord. Are these like those who will live for ever in the Fire and be given boiling water to drink which will cut their intestines to shreds?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "A description of the Garden which is promised to the pious; in it are rivers of water which shall never pollute; and rivers of milk the taste of which shall never change; and rivers of wine delicious to drink; and rivers of purified honey; and in it for them are fruits of all kinds, and the forgiveness of their Lord; so will such ever be equal to those who are to stay in the fire for ever and who will be given boiling water to drink so that it tears their guts apart?"}, {"lang": "en", "name": "A. J. Arberry", "text": "This is the similitude of Paradise which the godfearing have been promised: therein are rivers of water unstaling, rivers of milk unchanging in flavour, and rivers of wine -- a delight to the drinkers, rivers, too, of honey purified; and therein for them is every fruit, and forgiveness from their Lord -- Are they as he who dwells forever in the Fire, such as are given to drink boiling water, that tears their bowels asunder?"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "A likeness of the Garden which hath been promised to the God-fearing: therein are rivers of water incorruptible, and rivers of milk whereof the flavour changeth not, and rivers of wine: a joy Unto the drinkers; and rivers of honey clarified. theirs therein shall be every kind of fruit, and forgiveness from their Lord. ShAll Persons enjoying such bliss be like Unto those who are abiders in the Fire and are given to drink boiling water so that it mangleth their entrails?"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "The description of Paradise which the Muttaqun (pious - see V. 2:2) have been promised is that in it are rivers of water the taste and smell of which are not changed; rivers of milk of which the taste never changes; rivers of wine delicious to those who drink; and rivers of clarified honey (clear and pure) therein for them is every kind of fruit; and forgiveness from their Lord. (Are these) like those who shall dwell for ever in the Fire, and be given, to drink, boiling water, so that it cuts up their bowels?"}, {"lang": "en", "name": "Talal Itani", "text": "The likeness of the Garden promised to the righteous: in it are rivers of pure water, and rivers of milk forever fresh, and rivers of wine delightful to the drinkers, and rivers of strained honey. And therein they will have of every fruit, and forgiveness from their Lord. Like one abiding in the Fire forever, and are given to drink boiling water, that cuts-up their bowels?"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Here is the parable of Paradise which the God-fearing have been promised: in it shall be rivers of incorruptible water, rivers of milk unchanging in taste, and rivers of wine, a delight to those that drink; and rivers of pure honey. In it they will have every kind of fruit as well as forgiveness from their Lord. Can such be like those who will abide in the Fire and will be given a boiling water to drink that will tear their bowels apart?"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "The description of Paradise which is promised to those who have Taqwa, (is that) in it are rivers of water that are not Asin, rivers of milk the taste of which never changes, rivers of wine delicious to those who drink it, and rivers of refined honey; and therein for them are all kinds of fruits, and forgiveness from their Lord. Can this be likened to those who abide eternally in the Fire and are given to drink boiling water that severs their intestines"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "A similitude of the Garden which those who keep their duty (to Allah) are promised: Therein are rivers of water unpolluted, and rivers of milk whereof the flavour changeth not, and rivers of wine delicious to the drinkers, and rivers of clear-run honey; therein for them is every kind of fruit, with pardon from their Lord. (Are those who enjoy all this) like those who are immortal in the Fire and are given boiling water to drink so that it teareth their bowels?"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "A description of the paradise promised to the Godwary: therein are streams of unstaling water and streams of milk unchanging in flavour, and streams of wine delicious to the drinkers, and streams of purified honey; there will be every kind of fruit in it for them, and forgiveness from their Lord. [Are such ones] like those who abide in the Fire and are given to drink boiling water which cuts up their bowels?"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "The example of the Paradise which the cautious have been promised in it, there are rivers of unstaling water, and rivers of milk that never change in flavor, and rivers of wine, delectable to the drinkers, and rivers of pure, filtered honey. They shall have therein of every fruit and forgiveness from their Lord. Are they then like he who shall live in the Fire for ever and given boiling water to drink that tears his bowels apart!"}, {"lang": "en", "name": "Saheeh International", "text": "Is the description of Paradise, which the righteous are promised, wherein are rivers of water unaltered, rivers of milk the taste of which never changes, rivers of wine delicious to those who drink, and rivers of purified honey, in which they will have from all [kinds of] fruits and forgiveness from their Lord, like [that of] those who abide eternally in the Fire and are given to drink scalding water that will sever their intestines?"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "The garden, which is promised to the pious, is like one in which there are streams of unpolluted water, streams of milk of unchangeable taste, streams of delicious wine, and streams of crystal clear honey. Therein they will have all kinds of fruits and forgiveness from their Lord. On the other hand (can these people be considered like), those who will live forever in hell fire and will drink boiling water which will rip their intestines to bits?"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "A parable of the garden which those guarding (against evil) are promised: Therein are rivers of water that does not alter, and rivers of milk the taste whereof does not change, and rivers of drink delicious to those who drink, and rivers of honey clarified and for them therein are all fruits and protection from their Lord. (Are these) like those who abide in the fire and who are made to drink boiling water so it rends their bowels asunder."}, {"lang": "en", "name": "English Transliteration", "text": "Mathalu aljannati allatee wuAAida almuttaqoona feeh<u>a</u> anh<u>a</u>run min m<u>a</u>in ghayri <u>a</u>sinin waanh<u>a</u>run min labanin lam yataghayyar <u>t</u>aAAmuhu waanh<u>a</u>run min khamrin la<u>thth</u>atin li<b>l</b>shsh<u>a</u>ribeena waanh<u>a</u>run min AAasalin mu<u>s</u>affan walahum feeh<u>a</u> min kulli a<b>l</b>ththamar<u>a</u>ti wamaghfiratun min rabbihim kaman huwa kh<u>a</u>lidun fee a<b>l</b>nn<u>a</u>ri wasuqoo m<u>a</u>an <u>h</u>ameeman faqa<u>tt</u>aAAa amAA<u>a</u>ahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Here is a description of the Garden promised to the righteous: therein are rivers of water which is forever pure; and rivers of milk of which the taste never changes; and rivers of wine, a delight to those who drink it, and rivers of pure honey. And in it they will have all kinds of fruit, and will receive forgiveness from their Lord. Can those who enjoy such bliss be like those who abide in the Fire and who are given boiling water to drink so that it tears their bowels?"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "(Here is) a Parable of the Garden which the righteous are promised: in it are rivers of water incorruptible; rivers of milk of which the taste never changes; rivers of wine, a joy to those who drink; and rivers of honey pure and clear. In it there are for them all kinds of fruits; and Grace from their Lord. (Can those in such Bliss) be compared to such as shall dwell for ever in the Fire, and be given, to drink, boiling water, so that it cuts up their bowels (to pieces)?"}]}, {"index": 4561, "local_index": 16, "part_type": "Verse", "path": "/books/quran:47:16", "text": "وَ مِنْهُمْ‌ مَنْ‌ يَسْتَمِعُ‌ إِلَيْکَ‌ حَتَّى‌ إِذَا خَرَجُوا مِنْ‌ عِنْدِکَ‌ قَالُوا لِلَّذِينَ‌ أُوتُوا الْعِلْمَ‌ مَا ذَا قَالَ‌ آنِفاً أُولٰئِکَ‌ الَّذِينَ‌ طَبَعَ‌ اللَّهُ‌ عَلَى‌ قُلُوبِهِمْ‌ وَ اتَّبَعُوا أَهْوَاءَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "گروهی از آنان [که منافق اند در ظاهر به گفتارت] گوش می دهند، ولی هنگامی که از نزد تو بیرون روند به کسانی که آگاهی و معرفت به آنان داده شده [از روی مسخره] می گویند: هم اکنون چه گفت؟ [ما که گفته او را نفهمیدیم.] آنان کسانی هستند که خدا بر دل هایشان مهر [تیره بختی] نهاده واز هواهای نفسانی خود پیروی کرده اند،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "بعضى به تو گوش مى‌دهند، تا آنگاه كه از نزد تو بيرون روند از دانشمندان مى‌پرسند: اين چه سخنانى بود كه مى‌گفت؟ خدا بر دلهايشان مهر نهاده است و از پى هواهاى خود رفته‌اند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و از آنها كسانى هستند كه [در ظاهر] به تو گوش مى‌دهند ولى چون از نزد تو بيرون مى‌روند، به دانش يافتگان مى‌گويند: [اين پيامبر] هم اكنون چه گفت؟ اينان كسانى‌اند كه خدا بر دل‌هايشان مهر نهاده و از هوس‌هاى خود پيروى كرده‌اند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و از ميان [منافقان‌] كسانى‌اند كه [در ظاهر] به [سخنان‌] تو گوش مى‌دهند، ولى چون از نزد تو بيرون مى‌روند، به دانش يافتگان مى‌گويند: «هم اكنون چه گفت؟» اينان همانانند كه خدا بر دلهايشان مهر نهاده است و از هوسهاى خود پيروى كرده‌اند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و بعضی از مردم منافق به گفتارت کاملا گوش می‌دهند تا وقتی که از حضورت خارج شوند با اهل علم (اصحابت به تمسخر و اهانت) می‌گویند: رسول باز از سر نو چه گفت؟ اینان هستند که خدا بر دلهاشان مهر (قهر) نهاد و پیرو هوای نفس خود گردیدند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "در میان منافقان کسانی هستند که به سخنانت گوش فرا می‌دهند، امّا هنگامی که از نزد تو بیرون می‌روند، به کسانی (از علمای صحابه) که (از سوی خدا) بدیشان علم و دانش بخشیده شده است، می‌گویند: این مرد الآن چه گفت؟! (آنچه می‌گوید بی‌ارزش و یاوه است!) آنان کسانیند که خداوند بر دلهایشان مهر نهاده است، و از هواها و هوسهایشان پیروی می‌کنند. [[«مَن یَسْتَمِعُ»: مراد منافقانی است که در آیه 20 از آنان سخن می‌رود. «الَّذِینَ أُوتُوا الْعِلْمَ»: مراد علمای صحابه کرام، از قبیل: ابن‌عباس و ابن مسعود است. «هذَا ...»: مراد محمد است. «آنِفاً»: چند لحظه پیش. اکنون. «طَبَعَ اللهُ عَلی قُلُوبِهِمْ»: (نگا: توبه / 93، نحل / 108).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و از ایشان کسانی هستند که [ظاهرا] به تو گوش می‌سپارند، سپس که از نزدت بیرون می‌روند، به دانش یافتگان گویند هم اکنون چه گفت؟ اینان کسانی هستند که خداوند به دلهایشان مهر نهاده است و از هوی و هوسهایشان پیروی کرده‌اند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "گروهی از آنان به سخنانت گوش فرامی‌دهند، امّا هنگامی که از نزد تو خارج می‌شوند به کسانی که علم و دانش به آنان بخشیده شده (از روی استهزا) می‌گویند: «(این مرد) الان چه گفت؟!» آنها کسانی هستند که خداوند بر دلهایشان مُهر نهاده و از هوای نفسشان پیروی کرده‌اند (از این رو چیزی نمی‌فهمند)!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و از ایشان است آنکه گوش فرا دهد بسویت تا گاهی که برون روند از نزدت گویند بدانان که داده شدند دانش را چه گفت پیش آنانند که مُهر نهاد خدا بر دلهاشان و پیروی کردند هوسهای خویش را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و از آنان- منافقان- كسانى‌اند كه به [گفتار] تو گوش فرا مى‌دارند تا چون از نزد تو بيرون آيند به كسانى [از يارانت‌] كه دانش داده شده‌اند گويند: اكنون چه گفت؟- به ريشخند مى‌گفتند: ما نفهميديم چه گفت- اينانند كه خدا بر دلهاشان مهر نهاده، و هواهاى خويش را پيروى كرده‌اند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و از (میان) ایشان [:منافقان] کسانی‌اند که (در ظاهر) به (سخنان) تو همی گوش فرا می‌دهند، تا هنگامی که از نزد تو بیرون روند. به دانش‌یافتگان (وحیانی) گویند: «لحظاتی پیش چه گفت‌؟» اینان همانانند که خدا بر دل‌هایشان مُهْر زده است‌. و (اینان) هوس‌های خود را پیروی کردند."}, {"lang": "en", "name": "Ahmed Ali", "text": "There are some who listen to you; but as soon as they go from you they say to those who were given knowledge: \"What is this he is saying now?\" They are those whose hearts have been sealed by God, and they follow their own lusts."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And among them are some who listen to what you say; until when they go away from you, they say to those who have been given knowledge, “What did he say now?”; they are those whose hearts Allah has sealed, and they follow their own desires."}, {"lang": "en", "name": "A. J. Arberry", "text": "And some of them there are give ear to thee, till, when they go forth from thee, they say to those who have been given knowledge, 'What said he just now?' Those are they upon whose hearts God has set a seal, and they have followed their caprices."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Of them are some who listen to thee, until, when they go forth from before thee, they say Unto those who have been vouchsafed knowledge, what is that he hath said just now? Those are they whose hearts Allah hath sealed up and they follow their lusts."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And among them are some who listen to you (O Muhammad SAW) till, when they go out from you, they say to those who have received knowledge: \"What has he said just now? Such are men whose hearts Allah has sealed, and they follow their lusts (evil desires)."}, {"lang": "en", "name": "Talal Itani", "text": "Among them are those who listen to you, but when they leave your presence, they say to those given knowledge, “What did he say just now?” Those are they whose hearts God has sealed, and they follow their own desires."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Among them some give ear to you. But no sooner do they leave your presence than they ask those endowed with knowledge: “What is it that he said just now?” Such are those whose hearts Allah has sealed and who pursue their lusts."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And among them are some who listen to you till when they go out from you, they say to those who have received knowledge: \"What is it that he has said just now \"Such are men whose hearts Allah has sealed because they followed their lusts."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Among them are some who give ear unto thee (Muhammad) till, when they go forth from thy presence they say unto those who have been given knowledge: What was that he said just now? Those are they whose hearts Allah hath sealed, and they follow their own lusts."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "There are some among them who prick up their ears at you. But when they go out from your presence, they say to those who have been given knowledge, ‘What did he say just now?’ They are the ones on whose hearts Allah has set a seal, and they follow their own desires."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Some of them listen to you, but no sooner do they leave you they ask those to whom knowledge has been given: 'What did he say just now' Such are those whom Allah has set a seal upon their hearts and who follow their own desires."}, {"lang": "en", "name": "Saheeh International", "text": "And among them, [O Muhammad], are those who listen to you, until when they depart from you, they say to those who were given knowledge, \"What has he said just now?\" Those are the ones of whom Allah has sealed over their hearts and who have followed their [own] desires."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "(Muhammad), some of them listen to you, but when they leave you they ask those who have received knowledge, \"What did he say a few moments ago?\" God has sealed the hearts of such people who have followed their worldly desires."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And there are those of them who seek to listen to you, until when they go forth from you, they say to those who have been given the knowledge: What was it that he said just now? These are they upon whose hearts Allah has set a seal and they follow their low desires."}, {"lang": "en", "name": "English Transliteration", "text": "Waminhum man yastamiAAu ilayka <u>h</u>att<u>a</u> i<u>tha</u> kharajoo min AAindika q<u>a</u>loo lilla<u>th</u>eena ootoo alAAilma m<u>atha</u> q<u>a</u>la <u>a</u>nifan ol<u>a</u>ika alla<u>th</u>eena <u>t</u>abaAAa All<u>a</u>hu AAal<u>a</u> quloobihim wa<b>i</b>ttabaAAoo ahw<u>a</u>ahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Among them are those who listen to you, but then, when they leave your presence, say to those who have been given knowledge [Scripture], \"What was that he just said?\" Such are those whose hearts God has sealed, and who follow their own base desires."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "And among them are men who listen to thee, but in the end, when they go out from thee, they say to those who have received Knowledge, \"What is it he said just then?\" Such are men whose hearts Allah has sealed, and who follow their own lusts."}]}, {"index": 4562, "local_index": 17, "part_type": "Verse", "path": "/books/quran:47:17", "text": "وَ الَّذِينَ‌ اهْتَدَوْا زَادَهُمْ‌ هُدًى‌ وَ آتَاهُمْ‌ تَقْوَاهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و کسانی که هدایت یافته اند خدا بر هدایتشان افزوده و پرهیزکاری و تقوایشان را به آنان عطا کرده است؛"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آنان كه هدايت يافته‌اند، خدا به هدايتشان مى‌افزايد و پرهيزگاريشان ارزانى مى‌دارد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و آنها كه هدايت پذير شدند، [خدا] بر هدايتشان افزود و [روح‌] تقوايشان بخشيد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و[لى‌] آنان كه به هدايت گراييدند [خدا] آنان را هر چه بيشتر هدايت بخشيد و [توفيق‌] پرهيزگارى‌شان داد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و آنان که هدایت یافتند خدا بر هدایت و ایمانشان بیفزود و (پاداش) تقوای آنها را به آنان عطا فرمود."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کسانی که راهیاب شده‌اند، خداوند بر راهیابی ایشان می‌افزاید و تقوای لازم را بدیشان عطاء می‌نماید. [[«تَقْوَاهُمْ»: تقوائی که برای نجات ایشان از دوزخ و رسیدن آنان به بهشت لازم است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و رهیافتگان را هدایت افزود و [راه و رسم‌] پارسایی‌شان آموخت‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کسانی که هدایت یافته‌اند، خداوند بر هدایتشان می‌افزاید و روح تقوا به آنان می‌بخشد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنان که رهبری خواستند بیفزودشان رهبری و داد بدیشان پرهیزکاری ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و كسانى كه راه يافته‌اند، [خدا] ايشان را رهيابى بيفزايد و [مايه دوام و پاداش‌] پرهيزگاريشان را به آنان بدهد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و (اما) کسانی که به هدایت گراییدند (خدا) آنان را (هر چه) بیشتر هدایت کرد و (پاداش) پرهیزگاریشان را (شایسته‌ی هدایتشان) به آنان داد."}, {"lang": "en", "name": "Ahmed Ali", "text": "But those who are rightly guided will be given greater guidance by Him, and they will have their intrinsic piety."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And those who attained the right path – Allah increases the guidance for them and bestows their piety to them."}, {"lang": "en", "name": "A. J. Arberry", "text": "But those who are guided aright, them He increases in guidance, and gives them their godfearing."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And those who are guided He increaseth Unto them guidance, and giveth them their piety."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "While as for those who accept guidance, He increases their guidance, and bestows on them their piety."}, {"lang": "en", "name": "Talal Itani", "text": "As for those who are guided, He increases them in guidance, and He has granted them their righteousness."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "As for those who were led to the Guidance, Allah increases them in their guidance and causes them to grow in God-fearing."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And as for those who accept guidance, He increases them in guidance and bestows on them their Taqwa."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "While as for those who walk aright, He addeth to their guidance, and giveth them their protection (against evil)."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "As for those who are [rightly] guided, He enhances their guidance and invests them with their Godwariness."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "As for those who were guided, He increases their guidance and gives them their protection."}, {"lang": "en", "name": "Saheeh International", "text": "And those who are guided - He increases them in guidance and gives them their righteousness."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God will increase the guidance and piety of those who seek guidance."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And (as for) those who follow the right direction, He increases them in guidance and gives them their guarding (against evil)."}, {"lang": "en", "name": "English Transliteration", "text": "Wa<b>a</b>lla<u>th</u>eena ihtadaw z<u>a</u>dahum hudan wa<u>a</u>t<u>a</u>hum taqw<u>a</u>hum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "But as for those who follow guidance, He adds to their guidance, and shows them the way to righteousness."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "But to those who receive Guidance, He increases the (light of) Guidance, and bestows on them their Piety and Restraint (from evil)."}]}, {"index": 4563, "local_index": 18, "part_type": "Verse", "path": "/books/quran:47:18", "text": "فَهَلْ‌ يَنْظُرُونَ‌ إِلاَّ السَّاعَةَ أَنْ‌ تَأْتِيَهُمْ‌ بَغْتَةً فَقَدْ جَاءَ أَشْرَاطُهَا فَأَنَّى‌ لَهُمْ‌ إِذَا جَاءَتْهُمْ‌ ذِکْرَاهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "پس آیا [منافقان و منکران] جز این را انتظار می برند که ناگاه قیامت بر آنان فرا رسد؟ [در حالی که هم اکنون نشانه هایش آمده است]، پس هنگامی که قیامت بر آنان فرا رسد، متذکّر شدن و هوشیاری شان از کجا و چگونه به آنان سود بخشد؟"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا تنها منتظر آنند كه به ناگاه قيامت فرا رسد؟ هرآينه نشانهاى قيامت آشكار شده است. و چون فرا رسد پند گرفتنشان را چه فايده؟"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آيا [كافران‌] جز اين انتظار دارند كه قيامت به ناگاه بر آنان در رسد؟ اينك نشانه‌هاى آن آمده است. پس آنگاه كه [رستاخيز] بر آنان درآيد، پند گرفتنشان را چه سود"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آيا [كافران‌] جز اين انتظار مى‌برند كه رستاخيز به ناگاه بر آنان فرا رسد؟ و علامات آن اينك پديد آمده است. پس اگر [رستاخيز] بر آنان دررسد، ديگر كجا جاى اندرزشان است؟"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "(کافران که ایمان نمی‌آرند) باز انتظاری دارند جز آنکه ساعت قیامت ناگاه فرا رسد؟ که شروط و علائم قیامت بسیاری پدید آمد، و پس از آنکه قیامت بیاید در آن حال تذکر و یادآوری آنان چه فایده بخشد؟"}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "انگار (کافران و منافقان تا قیامت فرا نرسد ایمان نمی‌آورند، و برای ایمان آوردن خود) قیامت را چشم می‌دارند که ناگهان برپا می‌شود؟! هم‌اکنون علائم و نشانه‌های آن ظاهر شده است (که از جمله‌ی آنها بعثت خاتم‌الانبیاء است). امّا وقتی که قیامت فرا رسید، دیگر باور داشتن و اندرز گرفتن چه سودی به حالشان دارد؟! [[«هَلْ یَنظُرُونَ؟»: آیا چشم می‌دارند؟ مگر انتظاری جز این دارند؟ «أَشْرَاطُهَا»: اشراط، جمع شَرَط، علامتها و نشانه‌ها «فَأَنّی لَهُمْ»: (نگا: دخان / 13). «ذِکْری»: بیدار شدن و اندرز گرفتن. یادآور گشتن و به خود آمدن (نگا: زمر / 54 - 59).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "پس انتظار ندارند مگر قیامت را که به ناگهان به سراغشان آید، که به راستی نشانه‌های آن ظاهر شده است، پس آنگاه که فراز آیدشان، چه پندی می‌خواهند بگیرند؟"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آیا آنها [= کافران‌] جز این انتظاری دارند که قیامت ناگهان فرا رسد (آنگاه ایمان آورند)، در حالی که هم‌اکنون نشانه‌های آن آمده است؛ اما هنگامی که بیاید، تذکّر (و ایمان) آنها سودی نخواهد داشت!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آیا چشم براهند جز ساعت را که بیایدشان ناگاه چه همانا بیامد نشانیهای آن پس کجا برای ایشان است گاهی که بیایدشان یادآوریشان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "پس آيا جز رستاخيز را كه ناگهان بديشان آيد انتظار مى‌برند؟ همانا نشانه‌هاى آن آمده است. پس كجا و چگونه ايشان را يادكرد و پندگرفتنشان باشد آنگاه كه رستاخيز بديشان آيد؟"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس آیا (کافران) جز این انتظار می‌برند و می‌نگرند که رستاخیز به ناگهان آنان را در رسد؟ در صورتی که نشانه‌ها و شروطش اینک به‌راستی پدید آمده است. پس اگر (رستاخیز) آنان را در رسد، دیگر چه زمانی (جای) یادواره‌ی آنان است‌؟"}, {"lang": "en", "name": "Ahmed Ali", "text": "Do they wait for any thing but the Hour (of change), that it may come upon them suddenly? Its signs have already appeared. How then will they be warned when it has come upon them?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "So what are they waiting for, except that the Last Day suddenly come upon them? For its signs have already appeared; so when it does come, of what use is their realising it?"}, {"lang": "en", "name": "A. J. Arberry", "text": "Are they looking for aught but the Hour, that it shall come upon them suddenly? Already its tokens have come; so, when it has come to them, how shall they have their Reminder?"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Await they but the Hour, that it should come upon them on a sudden? Tokens thereof are already come, so how shall it be with them when there cometh Unto them their admonition!"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Do they then await (anything) other than the Hour, that it should come upon them suddenly? But some of its portents (indications and signs) have already come, and when it (actually) is on them, how can they benefit then by their reminder?"}, {"lang": "en", "name": "Talal Itani", "text": "Are they just waiting until the Hour comes to them suddenly? Its tokens have already come. But how will they be reminded when it has come to them?"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Are they waiting, then, for anything else than the Last Hour to suddenly come upon them? Already some of its tokens have come. But when it does actually come upon them, where will any time be left for them to take heed?"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Do they then await except that the Hour should come upon them suddenly But already there have come (some of) its portents; and when it (actually) is on them, how can they benefit then by their reminder"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Await they aught save the Hour, that it should come upon them unawares? And the beginnings thereof have already come. But how, when it hath come upon them, can they take their warning?"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Do they await anything except that the Hour should overtake them suddenly? Its portents have already come. When it overtakes them of what avail will the admonitions they were given?"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Are they looking except for the Hour to overtake them suddenly? Its signs have come. But how will they be reminded when it has come to them?"}, {"lang": "en", "name": "Saheeh International", "text": "Then do they await except that the Hour should come upon them unexpectedly? But already there have come [some of] its indications. Then what good to them, when it has come, will be their remembrance?"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Are they waiting for the Hour of Doom to suddenly approach them? Its signs have already appeared. How will they then come to their senses when the Hour itself will approach them?"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Do they then wait for aught but the hour that it should come to them all of a sudden? Now indeed the tokens of it have (already) come, but how shall they have their reminder when it comes on them?"}, {"lang": "en", "name": "English Transliteration", "text": "Fahal yan<i><u>th</u></i>uroona ill<u>a</u> a<b>l</b>ss<u>a</u>AAata an tatiyahum baghtatan faqad j<u>a</u>a ashr<u>at</u>uh<u>a</u> faann<u>a</u> lahum i<u>tha</u> j<u>a</u>athum <u>th</u>ikr<u>a</u>hum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Are they awaiting the Hour of Doom to come upon them suddenly? Its signs have already come. But of what avail will their admonition be to them when it has actually come upon them?"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Do they then only wait for the Hour,- that it should come on them of a sudden? But already have come some tokens thereof, and when it (actually) is on them, how can they benefit then by their admonition?"}]}, {"index": 4564, "local_index": 19, "part_type": "Verse", "path": "/books/quran:47:19", "text": "فَاعْلَمْ‌ أَنَّهُ‌ لاَ إِلٰهَ‌ إِلاَّ اللَّهُ‌ وَ اسْتَغْفِرْ لِذَنْبِکَ‌ وَ لِلْمُؤْمِنِينَ‌ وَ الْمُؤْمِنَاتِ‌ وَ اللَّهُ‌ يَعْلَمُ‌ مُتَقَلَّبَکُمْ‌ وَ مَثْوَاکُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "پس بدان که هیچ معبودی جز خدا نیست [بنابراین بر معرفت و آگاهیت نسبتِ به حق استوار باش]؛ و از میان رفتن [توطئه ها و موانعی که به وسیله دشمنان در راه پیشرفت دعوتت به اسلام] برای تو و مردان و زنان با ایمان ایجاد شده از خدا بخواه، و برای زنان و مردان مؤمن طلب آمرزش کن و خدا محل رفت و بازگشت شماو قرارگاهتان را می داند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "پس بدان كه هيچ خدايى جز اللّه نيست. از گناه خود و از گناه مردان و زنان مؤمن آمرزش بخواه. خدا مى‌داند كه روز به كجا مى‌رويد و شب به كجا مى‌آراميد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "پس بدان كه هيچ معبودى جز خدا نيست، و براى گناه خويش و براى مردان و زنان مؤمن آمرزش بخواه، و خداست كه آمد و شد و جايگاه [و وابستگى‌هاى فكرى و عملى‌] شما را مى‌داند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "پس بدان كه هيچ معبودى جز خدا نيست؛ و براى گناه خويش آمرزش جوى؛ و براى مردان و زنان با ايمان [طلب مغفرت كن‌]؛ و خداست كه فرجام و م‌آل [هر يك از] شما را مى‌داند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "باز هم بدان که هیچ خدایی جز خدای یکتا نیست و تو بر گناه خود [منظور از گناه آن حضرت نافرمانی خدا نیست، زیرا پیامبر (ص) معصوم است. به تفاسیر مراجعه شود. (م)] و برای مردان و زنان با ایمان آمرزش طلب، و خدا منازل انتقال شما به عالم آخرت و مسکن همیشگی شما همه را می‌داند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "بدان که قطعاً هیچ معبودی جز الله وجود ندارد. برای گناهان خود و مردان و زنان مؤمن آمرزش بخواه. خدا از حرکات و سکناتتان کاملاً آگاه است (و می‌داند به کجا می‌روید و در کجا زندگی می‌کنید و چه می‌کنید و چه نمی‌کنید). [[«إسْتَغْفِرْ لِذَنبِکَ»: (نگا: غافر / 55). «مُتَقَلَّبَ»: جایگاه گشت و گذار و مسیر حرکت. جنبش و حرکت. رفت و آمد. سیر و سیاحت. حال به حال شدن. این واژه می‌تواند اسم مکان، و یا مصدر میمی باشد. «مَثْوی»: جایگاه. اقامت گزیدن (نگا: یوسف / 21 و 23). «مُتَقَلَّبَکُمْ وَ مَثْوَاکُمْ»: جا و مکان، ظاهر و آشکار، درون و بیرون، راز و نجوا، نیت و اندیشه، رفت و آمد، سفر و حضر، کردار و رفتار، و بالاخره همه حرکات و سکنات شما.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بدان که فی‌الحقیقه خدایی جز خداوند نیست، و برای گناهت، و نیز برای مردان و زنان مؤمن آمرزش بخواه، و خداوند [جای‌] جنب و جوش و آرام و قرارتان را می‌داند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "پس بدان که معبودی جز «اللّه» نیست؛ و برای گناه خود و مردان و زنان باایمان استغفار کن! و خداوند محل حرکت و قرارگاه شما را می‌داند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "پس بدان که نیست خدائی جز خدا و آمرزش خواه برای گناه خویش و برای مردان و زنان مؤمن و خدا داند گردشگاه شما و آرامگاه شما را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "پس بدان كه هيچ خدايى جز خداى يكتا نيست، و براى گناه خود و براى مردان و زنان مؤمن آمرزش بخواه و خداوند رفت و آمد و آرميدن شما را مى‌داند- به تمام حالات شما آگاه است-."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس بدان که هیچ معبودی جز خدا نیست‌؛ و برای کار دنباله‌دار رسالتت (از شرّ کافران از خدا) پوششی بجوی و برای مردان و زنان باایمان (نیز) پوشش بخواه و خداست که جابه‌جایی و پناهگاه و جایگاه شما را می‌داند."}, {"lang": "en", "name": "Ahmed Ali", "text": "Know then, therefore, there is no god but He, and ask forgiveness for your sins and those of believing men and women. God knows your wanderings and your destination."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Therefore know (O dear Prophet Mohammed – peace and blessings be upon him) that there is none worthy of worship except Allah, and seek the forgiveness of sins of your close ones and for the common believing men and women; and Allah knows your movements during the day and your resting during the night."}, {"lang": "en", "name": "A. J. Arberry", "text": "Know thou therefore that there is no god but God, and ask forgiveness for thy sin, and for the believers, men and women. God knows your going to and fro, and your lodging."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "So know thou that there is no god save Allah, and ask forgiveness for thy fault and for believing men and believing women. And Allah knoweth well your moving about and your place of rest."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "So know (O Muhammad SAW) that La ilaha ill-Allah (none has the right to be worshipped but Allah), and ask forgiveness for your sin, and also for (the sin of) believing men and believing women. And Allah knows well your moving about, and your place of rest (in your homes)."}, {"lang": "en", "name": "Talal Itani", "text": "Know that there is no god but God, and ask forgiveness for your sin, and for the believing men and believing women. God knows your movements, and your resting-place."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Know, therefore, (O Prophet), that there is no god but Allah, and ask forgiveness for your shortcomings and also for (the shortcomings of) believing men and believing women. Allah knows the places where you move about and where you dwell."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "So know that La ilaha illallah and ask forgiveness for your sin, and also for (the sin of) believing men and women. And Allah knows well your moving about, and your place of rest."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "So know (O Muhammad) that there is no Allah save Allah, and ask forgiveness for thy sin and for believing men and believing women. Allah knoweth (both) your place of turmoil and your place of rest."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Know that there is no god except Allah, and plead [to Allah] for forgiveness of your sin and for the faithful, men and women. Allah knows your itinerary and your [final] abode."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Therefore, know that there is no god except Allah and ask for forgiveness of your sins and for the believers, men and women. Allah knows your going to and fro, and your lodging."}, {"lang": "en", "name": "Saheeh International", "text": "So know, [O Muhammad], that there is no deity except Allah and ask forgiveness for your sin and for the believing men and believing women. And Allah knows of your movement and your resting place."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Know that God is the only Lord. Ask forgiveness for your sins and for the sins of the believing men and women. God knows when you move and when you rest."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "So know that there is no god but Allah, and, ask protection for your fault and for the believing men and the believing women; and Allah knows the place of your returning and the place of your abiding."}, {"lang": "en", "name": "English Transliteration", "text": "Fa<b>i</b>AAlam annahu l<u>a</u> il<u>a</u>ha ill<u>a</u> All<u>a</u>hu wa<b>i</b>staghfir li<u>th</u>anbika walilmumineena wa<b>a</b>lmumin<u>a</u>ti wa<b>A</b>ll<u>a</u>hu yaAAlamu mutaqallabakum wamathw<u>a</u>kum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Know then that there is no god except God. Ask forgiveness for your wrongdoing, and for the men and women who believe. God knows both your movements and your lodging."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Know, therefore, that there is no god but Allah, and ask forgiveness for thy fault, and for the men and women who believe: for Allah knows how ye move about and how ye dwell in your homes."}]}, {"index": 4565, "local_index": 20, "part_type": "Verse", "path": "/books/quran:47:20", "text": "وَ يَقُولُ‌ الَّذِينَ‌ آمَنُوا لَوْ لاَ نُزِّلَتْ‌ سُورَةٌ فَإِذَا أُنْزِلَتْ‌ سُورَةٌ مُحْکَمَةٌ وَ ذُکِرَ فِيهَا الْقِتَالُ‌ رَأَيْتَ‌ الَّذِينَ‌ فِي‌ قُلُوبِهِمْ‌ مَرَضٌ‌ يَنْظُرُونَ‌ إِلَيْکَ‌ نَظَرَ الْمَغْشِيِ‌ عَلَيْهِ‌ مِنَ‌ الْمَوْتِ‌ فَأَوْلَى‌ لَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "مؤمنان می گویند: چرا سوره ای [در رابطه با فرمان جهاد] نازل نمی شود؟ ولی هنگامی که سوره ای محکم و بی شبهه نازل می شود و در آن از جهاد سخن به میان آمده است، آنان را که در دل هایشان بیماری است، می بینی مانند کسی که در بیهوشی مرگ افتاده، به تو می نگرند و سزاوارشان هم [به سبب بیماردلی] همین حالت است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "كسانى كه ايمان آورده‌اند مى‌گويند: چرا از جانب خدا سوره‌اى نازل نمى‌شود؟ چون سوره‌اى از محكمات نازل شود كه در آن سخن از جنگ رفته باشد، آنان را كه در دلشان مرضى هست بينى كه چون كسى كه بيهوشى مرگ بر او چيره شده به تو مى‌نگرند. پس برايشان شايسته‌تر"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و كسانى كه ايمان آورده‌اند مى‌گويند: چرا سوره‌اى [در باره‌ى جهاد] نازل نمى‌شود؟ اما وقتى سوره‌اى صريح نازل گردد و در آن سخن از كارزار رود، بيماردلان را مى‌بينى كه، مانند كسى كه به حال احتضار افتاده به تو مى‌نگرند، پس همان سزاوارشان است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و كسانى كه ايمان آورده‌اند مى‌گويند: «چرا سوره‌اى [در باره جهاد] نازل نمى شود؟» اما چون سوره‌اى صريح نازل شد و در آن نام كارزار آمد، آنان كه در دلهايشان مرضى هست، مانند كسى كه به حال بيهوشى مرگ افتاده به تو مى‌نگرند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و مؤمنان می‌گویند: چه شده که سوره‌ای (در حکم جهاد کفّار) نازل نشد؟ در صورتی که چون سوره‌ای محکم و صریح آید و در آن ذکر جنگ شود آنان را که دلهاشان مریض (نفاق) است بنگری که مانند کسی که از ترس، حال بی هوشی بر او دست می‌دهد در تو نگاه می‌کنند، آری مرگ و هلاک بر آنها سزاوارتر است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "مؤمنان می‌گویند: کاش! سوره‌ای فرود می‌آمد (و ما را به جنگ با دشمنان می‌خواند). زمانی که سوره‌ی محکمی نازل می‌گردد و جنگ در آن ذکر می‌شود (و روشن و آشکار به جنگ دستور می‌دهد) منافقان بیماردل را می‌بینی همچون کسی به تو نگاه می‌کنند که (در آستانه‌ی مرگ قرار گرفته است و) به سبب (سکرات) موت بیهوش افتاده است. پس مرگشان باد! [[«لَوْلا»: حرفی است که دالّ بر رغبت حصول بعد از خود است. «مُحْکَمَةٌ»: استوار و تغییرناپذیر. مراد روشن و بیانگر مقصود است؛ بگونه‌ای که توجیه و تفسیری جز جنگ را ندارد. «الْمَغْشِیِّ عَلَیْهِ»: بیهوش (نگا: احزاب / 19). «نَظَرَ الْمَغْشِیِّ عَلَیْهِ»: مراد خیره نگاه کردن و زل زدن با چشمانی است که حدقه‌ها و پلکها از کار ایستاده و باز و بی‌حرکت مانده باشد. «أَوْلی لَهُمْ»: مرگشان باد! عربها به هنگام تهدید کسی بدو می‌گویند: أَوْلی لَکَ! مرگت باد (نگا: قیامت / 34 و 35). «أَوْلی»: اسم تفضیل از ماده (ولی) به معنی قرب و نزدیکی است، در مقام دعا، برای تهدید به مرگ زودرس و نابودی قریب‌الوقوع بکار می‌رود.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و [بعضی از] مؤمنان گویند چرا سوره‌ای [شامل حکم جهاد] فرو فرستاده نمی‌شود، آنگاه چون سوره‌ای از محکمات فرو فرستاده می‌شود و در آن کارزار [با مشرکان‌] یاد می‌شود، بیماردلان را بینی که به تو با نگاه کسی که از [سکرات‌] مرگ بیهوش شده باشد، می‌نگرند، بدا به حال ایشان‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کسانی که ایمان آورده‌اند می‌گویند: «چرا سوره‌ای نازل نمی‌شود (که در آن فرمان جهاد باشد)؟!» امّا هنگامی که سوره واضح و روشنی نازل می‌گردد که در آن سخنی از جنگ است، منافقان بیماردل را می‌بینی که همچون کسی که در آستانه مرگ قرار گرفته به تو نگاه می‌کنند؛ پس مرگ و نابودی برای آنان سزاوارتر است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و گویند آنان که ایمان آوردند چرا فرود نیاید سوره‌ای پس هر گاه فرستاده شود سوره‌ای محکم و یادآوری شود در آن جنگ بینی آنان را که در دلهاشان بیماری است نگرند بسویت نگریستن بیهوش گشته از مرگ پس سزاوار باد ایشان را (مرگ بر ایشان)"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و كسانى كه ايمان آورده‌اند گويند چرا سوره‌اى [براى جهاد] فروفرستاده نمى‌شود؟ پس چون سوره‌اى محكم- يعنى از محكمات كه معناى آن روشن است- فرستاده شود و در آن از كارزار سخن رفته باشد، كسانى را كه در دلهاشان بيمارى- شك و نفاق- است بينى كه به تو مى‌نگرند همچون نگريستن كسى كه بيهوشى مرگ به او رسيده باشد پس ايشان را همان [مرگ‌] سزاوارتر است- يا: پس واى بر آنان-."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و کسانی که ایمان آوردند می‌گویند: «چرا سوره‌ای [:مجموعه‌ای از آیات درباره‌ی جهاد] نازل نشد‌؟» پس هنگامی‌که سوره‌ای محکم نازل شد و در آن نامِ کشتار آمد، آنان که در دل‌هاشان مرضی هست - مانند کسی که به حال بیهوشی مرگ افتاده - به تو می‌نگرند. پس (همین حالت) برایشان بهتراست."}, {"lang": "en", "name": "Ahmed Ali", "text": "Those who believe say: \"How is it no Surah was revealed?\" But when a categorical Surah is revealed that mentions war, you should see those who are sceptical staring at you like a man in the swoon of death. Alas the woe for them!"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And the Muslims say, “Why was not a chapter sent down?” So when a positive chapter was sent down, and war was commanded in it, you will see those in whose hearts is a disease looking at you with the dazed looks of a dying man; so it would be better for them. –"}, {"lang": "en", "name": "A. J. Arberry", "text": "Those who believe say, 'Why has a sura not been sent down?' Then, when a clear sura is sent down, and therein fighting is mentioned, thou seest those in whose hearts is sickness looking at thee as one who swoons of death; but better for them would be"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And those who believe say wherefore hath not a Surah been revealed? Then when there is sent down a Surah firmly constructed, and fighting is mentioned therein, thou seest those in whose hearts is a disease looking at thee with the look of one swooning Unto death. So also for them!"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Those who believe say: \"Why is not a Surah (chapter of the Quran) sent down (for us)? But when a decisive Surah (explaining and ordering things) is sent down, and fighting (Jihad - holy fighting in Allah's Cause) is mentioned (i.e. ordained) therein, you will see those in whose hearts is a disease (of hypocrisy) looking at you with a look of one fainting to death. But it was better for them (hypocrites, to listen to Allah and to obey Him)."}, {"lang": "en", "name": "Talal Itani", "text": "Those who believe say, “If only a chapter is sent down.” Yet when a decisive chapter is sent down, and fighting is mentioned in it, you see those in whose hearts is sickness looking at you with the look of someone fainting at death. So woe to them!"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "The believers used to say: “Why is a surah (that would ordain fighting) not revealed?” But when a definitive surah was revealed wherein fighting was mentioned, you saw that those in whose hearts there was a sickness looked at you as though they were about to faint at the approach of death. Pity on them!"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Those who believe say: \"Why is not a Surah sent down (for us)\" But now that a decisive Surah is sent down mentioning fighting, you can see those in whose hearts is disease (of hypocrisy) looking at you with the look of one who is about to faint for fear of death. But it was better for them."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And those who believe say: If only a surah were revealed! But when a decisive surah is revealed and war is mentioned therein, thou seest those in whose hearts is a disease looking at thee with the look of men fainting unto death. Therefor woe unto them!"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "The faithful say, ‘If only a surah were sent down!’ But when a conclusive surah is sent down and war is mentioned in it, you see those in whose hearts is a sickness looking upon you with the look of someone fainting at death. So woe to them!"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "The believers ask: 'Has a chapter been sent down' But when a clear chapter is sent down and fighting is mentioned in it, you see those in whose hearts is sickness looking towards you as one who swoons at death."}, {"lang": "en", "name": "Saheeh International", "text": "Those who believe say, \"Why has a surah not been sent down? But when a precise surah is revealed and fighting is mentioned therein, you see those in whose hearts is hypocrisy looking at you with a look of one overcome by death. And more appropriate for them [would have been]"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "The believers say, \"Why is a chapter about jihad - fighting for the cause of God - not revealed?\" But when such a chapter, with clear commands and a mention of jihad is revealed, you will see those whose hearts are sick look at you as if suffering the agony of death. One can expect nothing better from them!"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And those who believe say: Why has not a chapter been revealed? But when a decisive chapter is revealed, and fighting is mentioned therein you see those in whose hearts is a disease look to you with the look of one fainting because of death. Woe to them then!"}, {"lang": "en", "name": "English Transliteration", "text": "Wayaqoolu alla<u>th</u>eena <u>a</u>manoo lawl<u>a</u> nuzzilat sooratun fai<u>tha</u> onzilat sooratun mu<u>h</u>kamatun wa<u>th</u>ukira feeh<u>a</u> alqit<u>a</u>lu raayta alla<u>th</u>eena fee quloobihim mara<u>d</u>un yan<i><u>th</u></i>uroona ilayka na<i><u>th</u></i>ara almaghshiyyi AAalayhi mina almawti faawl<u>a</u> lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Those who believe ask why no chapter [about fighting] has been sent down. Yet when a decisive chapter that mentions fighting is sent down, you can see the sick of heart looking at you [Prophet] as if they were under the shadow of death. Therefore, woe to them!"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Those who believe say, \"Why is not a sura sent down (for us)?\" But when a sura of basic or categorical meaning is revealed, and fighting is mentioned therein, thou wilt see those in whose hearts is a disease looking at thee with a look of one in swoon at the approach of death. But more fitting for them-"}]}, {"index": 4566, "local_index": 21, "part_type": "Verse", "path": "/books/quran:47:21", "text": "طَاعَةٌ وَ قَوْلٌ‌ مَعْرُوفٌ‌ فَإِذَا عَزَمَ‌ الْأَمْرُ فَلَوْ صَدَقُوا اللَّهَ‌ لَکَانَ‌ خَيْراً لَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "[ولی] فرمانبرداری [از خدا و پیامبر] و سخن پسندیده و نیک [نه اظهار کراهت و ناخشنودی از جهاد] برای آنان شایسته تر است. پس اگر هنگامی که فرمان جهاد قطعی و مسلم شود با خدا از سر صدق و راستی درآیند، بی تردید برای آنان بهتر است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "فرمانبردارى است و سخن نيكو گفتن. و چون تصميم به جنگ گرفته شد، اگر با خدا صداقت ورزند برايشان بهتر است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "فرمان‌پذيرى و سخنى شايسته [بهتر است‌] و هنگامى كه كار [جهاد] قطعى شد، اگر با خدا راست مى‌گفتند برايشان بهتر بود"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "[ولى‌] فرمان‌پذيرى و سخنى شايسته برايشان بهتر است. و چون كار به تصميم كشد، قطعاً خير آنان در اين است كه با خدا راست‌[دل‌] باشند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "(راه سعادت) طاعت خدا و گفتار نیکو است و پس از آنکه امر (دین یا کار جنگ) به عزم و لزوم پیوست اگر (منافقین) با خدا به راستی رفتار کنند بر آنها بهتر خواهد بود."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "اطاعت (از خدا و پیغمبر) و بیان سخنان نیک (و سنجیده‌ای که شرع‌پسند باشد، برای آنان بهتر و به حالشان سودمندتر است). هنگامی که کار جدّی می‌شود (و جهادگران آماده‌ی حرکت به سوی رزمگاه می‌گردند) اگر با خدا راست باشند (و ایمان صادقانه و فرمانبرداری مخلصانه داشته باشند، از دوروئی و بزدلی) برای ایشان بهتر خواهد بود. [[«طَاعَةٌ»: مبتدا و خبر آن محذوف که (خَیْرٌ لَّهُمْ) است و ملفوظ آن یعنی (لَکَانَ خَیْراً لَّهُمْ) در آخر آیه بیانگر این امر است. «عَزَمَ»: جدّی شد.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "اطاعت باید و سخنی نیک، آنگاه چون کار قطعی شود، اگر با خداوند صادق باشند، بی‌شک برایشان بهتر است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "(ولی) اطاعت و سخن سنجیده برای آنان بهتر است؛ و اگر هنگامی که فرمان جهاد قطعی می‌شود به خدا راست گویند (و از در صدق و صفا درآیند) برای آنها بهتر می‌باشد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "فرمانبرداری و سخنی پسندیده تا گاهی که استوار شود کار پس اگر راست می‌گفتند خدا را هر آینه بهتر بود ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "[كارشان به ظاهر] فرمانبردارى و گفتار نيكوست، پس چون كار [جنگ‌] استوار شود اگر با خدا راست گويند- در وفاى به كارزار- هر آينه برايشان بهتر است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "فرمان‌پذیری و سخنی شایسته (برایشان بایسته) است و هنگامی که کار به تصمیم کشد، همواره خیر آنان در این است که با خدا در عمل و سخن راست باشند (که این) برایشان خوب و بهتر است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Obedience and modest speech (would have been more becoming). And when the matter has been determined it is best for them to be true to God."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "To obey and speak good; so when the manifest command came – it would have been better for them if they had remained faithful to Allah."}, {"lang": "en", "name": "A. J. Arberry", "text": "obedience, and words honourable. Then, when the matter is resolved, if they were true to God, it would be better for them."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Their obedience and speech are known. Then when the affair is determined, if even then they gave credence Unto Allah, it would have been better for them."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Obedience (to Allah) and good words (were better for them). And when the matter (preparation for Jihad) is resolved on, then if they had been true to Allah, it would have been better for them."}, {"lang": "en", "name": "Talal Itani", "text": "Obedience and upright speech. Then, when the matter is settled, being true to God would have been better for them."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "(They keep affirming their) obedience and saying good words. But when a course of action was clearly determined, it would have been better for them if they had proved true to Allah."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Obedience and good words. And when the matter is resolved, then if they had been true to Allah, it would have been better for them."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Obedience and a civil word. Then, when the matter is determined, if they are loyal to Allah it will be well for them."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Obedience and upright speech.... So when the matter has been resolved upon [concerning going to war], if they remain true to Allah that will surely be better for them."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Yet obedience and honorable words (would be better for them). Then, when the matter is decided, if they were true to Allah it would be better for them."}, {"lang": "en", "name": "Saheeh International", "text": "Obedience and good words. And when the matter [of fighting] was determined, if they had been true to Allah, it would have been better for them."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Since they have (pledged) Us obedience and to speak reasonably, it would be more proper for them, when it is decided (that everyone must take part in the battle), to remain true (in their pledge to God)."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Obedience and a gentle word (was proper); but when the affair becomes settled, then if they remain true to Allah it would certainly be better for them."}, {"lang": "en", "name": "English Transliteration", "text": "<u>Ta</u>AAatun waqawlun maAAroofun fai<u>tha</u> AAazama alamru falaw <u>s</u>adaqoo All<u>a</u>ha lak<u>a</u>na khayran lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Obedience and saying what is just would become them more; when the decision is taken, it would be better for them if they acted sincerely towards God."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Were it to obey and say what is just, and when a matter is resolved on, it were best for them if they were true to Allah."}]}, {"index": 4567, "local_index": 22, "part_type": "Verse", "path": "/books/quran:47:22", "text": "فَهَلْ‌ عَسَيْتُمْ‌ إِنْ‌ تَوَلَّيْتُمْ‌ أَنْ‌ تُفْسِدُوا فِي‌ الْأَرْضِ‌ وَ تُقَطِّعُوا أَرْحَامَکُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "پس اگر [از خدا و پیامبر] روی گردان شوید آیا از شما جز این انتظار می رود که در زمین فساد کنید و [بر سر مال و منال دنیا] قطع رحم نمایید؟"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا اگر به حكومت رسيديد، مى‌خواهيد در زمين فساد كنيد و پيوند خويشاونديتان را ببريد؟"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "پس [اى منافقان!] اگر روى گردانديد، آيا جز اين انتظار مى‌رود كه در زمين تباهى كنيد و قطع رحم نماييد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "پس [اى منافقان،] آيا اميد بستيد كه چون [از خدا] برگشتيد [يا سرپرست مردم شديد] در [روى‌] زمين فساد كنيد و خويشاونديهاى خود را از هم بگسليد؟"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "شما منافقان اگر (از فرمان خدا و اطاعت قرآن) روی بگردانید آیا جز این امید می‌برید که در زمین فساد و قطع رحم کنید؟"}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آیا اگر (از قرآن و برنامه‌ی اسلام) روی‌گردان شوید، جز این انتظار دارید که در زمین فساد کنید و پیوند خویشاوندی میان خویش را بگسلید؟ [[«عَسَیْتُمْ»: کلمه‌ای است که بیانگر انتظار حصول بعد از خود است. یعنی توقع و انتظار جز این را دارید. «فَهَلْ عَسَیْتُمْ إِن تَوَلَّیْتُمْ ...»: (تَوَلَّیْتُمْ) فعل شرط، جواب شرط محذوف و یا (عَسَیْتُمْ) مقدم است، و (أَن تُفْسِدُوا فِی‌الأرْضِ) خبر (عَسَیْتُمْ) است. بعضی هم مجموع جمله (فَهَلْ عَسَیْتُمْ أَن تُفْسِدُوا فِی الأرْضِ) را جزای شرط می‌دانند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "چه بسا چون دست یابید در این سرزمین فتنه و فساد کنید و پیوند خویشاوندانتان را بگسلید"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "اگر (از این دستورها) روی گردان شوید، جز این انتظار می‌رود که در زمین فساد و قطع پیوند خویشاوندی کنید؟!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "پس آیا امید دارید (چنین است) که هر گاه به سرپرستی گمارده شدید آنکه تبهکاری کنید در زمین و ببرید رشته خویشاوندیهای خویش را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "پس [اى منافقان‌] آيا [جز اين‌] انتظار مى‌داريد كه اگر سرپرست امور مردم شديد- به قدرت و حكومت رسيديد- در زمين تباهى كنيد و از خويشاوندانتان ببريد؟"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس (ای منافقان!) آیا امید بستید که اگر سرپرست مردم شدید، در زمین افساد کنید و خویشاوندی‌های خود را از هم بگسلید؟"}, {"lang": "en", "name": "Ahmed Ali", "text": "Is it possible that if placed in authority you will create disorder in the land and sever your bonds of relationship?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "So do you* portray that if you get governance, you would spread chaos in the land and sever your relations? (* The hypocrites)"}, {"lang": "en", "name": "A. J. Arberry", "text": "If you turned away, would you then haply work corruption in the land, and break your bonds of kin?"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Then, belike ye are, if ye turn to cause corruption in the earth away, and to sever your kinship."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Would you then, if you were given the authority, do mischief in the land, and sever your ties of kinship?"}, {"lang": "en", "name": "Talal Itani", "text": "If you turn away, you are likely to make mischief on earth, and sever your family ties."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Now, if you were to turn away, what else can be expected but that you will work corruption in the land and fly at each other's throats?"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "So would you perhaps, if you turned away, spread corruption on earth, and sever your ties of kinship"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Would ye then, if ye were given the command, work corruption in the land and sever your ties of kinship?"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "May it not be that if you were to wield authority you would cause corruption in the land and ill-treat your blood relations?"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Could it be, that if you turn away, you might make corruption in the land and break the ties of kinship?"}, {"lang": "en", "name": "Saheeh International", "text": "So would you perhaps, if you turned away, cause corruption on earth and sever your [ties of] relationship?"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "If you ignore the commands of God would you then also spread evil in the land and sever the ties of kinship?"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "But if you held command, you were sure to make mischief in the land and cut off the ties of kinship!"}, {"lang": "en", "name": "English Transliteration", "text": "Fahal AAasaytum in tawallaytum an tufsidoo fee alar<u>d</u>i watuqa<u>tt</u>iAAoo ar<u>ha</u>makum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Then if you turn away, you are likely to spread corruption on the earth and sever your ties of kinship."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Then, is it to be expected of you, if ye were put in authority, that ye will do mischief in the land, and break your ties of kith and kin?"}]}, {"index": 4568, "local_index": 23, "part_type": "Verse", "path": "/books/quran:47:23", "text": "أُولٰئِکَ‌ الَّذِينَ‌ لَعَنَهُمُ‌ اللَّهُ‌ فَأَصَمَّهُمْ‌ وَ أَعْمَى‌ أَبْصَارَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آنان [که روی گردانند] کسانی هستند که خدا لعنتشان کرده و گوش [دل] شان را کر و چشم [بصیرت] شان را کور کرده است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اينانند كه خدا لعنتشان كرده است و گوشهايشان را كر و چشمانشان را كور ساخته است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اينان كسانى هستند كه خدا لعنتشان كرده و گوش‌هايشان را كر و چشم‌هايشان را كور نموده است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اينان همان كسانند كه خدا آنان را لعنت نموده و [گوش دل‌] ايشان را ناشنوا و چشمهايشان را نابينا كرده است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "همین منافقانند که خدا آنها را لعن کرده و گوش و چشمشان را کر و کور گردانید (تا به جهل و شقاوت بمیرند)."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آنان کسانیند که خداوند ایشان را نفرین و از رحمت خویش بدور داشته است، لذا گوشهایشان را (از شنیدن حق) کر، و چشمانشان را (از دیدن راه هدایت و سعادت) کور کرده است. [[«أَصَمَّهُمْ»: ایشان را کر کرده است. «أَعْمی»: کور کرده است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "اینان کسانی هستند که خداوند لعنتشان کرده و [از شنیدن و دیدن حق‌] ناشنوا و نابیناشان ساخته است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آنها کسانی هستند که خداوند از رحمت خویش دورشان ساخته، گوشهایشان را کر و چشمهایشان را کور کرده است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آنانند که لعنشان کرد خدا پس کر ساختشان و کور ساخت دیدگان ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اينانند كه خدا لعنتشان كرده، پس آنان را كر ساخته و ديدگانشان را كور كرده است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "اینان (همان) کسانی‌اند که خدا آنان را لعنت کرده؛ پس گوش‌ها(ی جان‌ها)شان را کر و چشم‌ها(ی دل‌ها)شان را کور کرده است."}, {"lang": "en", "name": "Ahmed Ali", "text": "They are those who were condemned by God, whose ears were blocked by Him and their eyes blinded."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "It is these whom Allah has cursed, so He made them deaf to the Truth and blinded their eyes."}, {"lang": "en", "name": "A. J. Arberry", "text": "Those are they whom God has cursed, and so made them deaf, and blinded their eyes."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Those are they whom Allah hath cursed, and then hath deafened them and blinded their sights."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Such are they whom Allah has cursed, so that He has made them deaf and blinded their sight."}, {"lang": "en", "name": "Talal Itani", "text": "Those are they whom God has cursed. He made them deaf, and blinded their sight."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "It is these upon whom Allah has laid His curse: so He made them deaf and deprived them of their sight."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Such are the ones whom Allah has cursed, so that He has made them deaf and blinded their vision."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Such are they whom Allah curseth so that He deafeneth them and maketh blind their eyes."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "They are the ones whom Allah has cursed, so He made them deaf, and blinded their sight."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Such are those whom Allah has cursed, making them deaf and blinding their eyes."}, {"lang": "en", "name": "Saheeh International", "text": "Those [who do so] are the ones that Allah has cursed, so He deafened them and blinded their vision."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God has condemned these people and made them deaf, dumb, and blind."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Those it is whom Allah has cursed so He has made them deaf and blinded their eyes."}, {"lang": "en", "name": "English Transliteration", "text": "Ol<u>a</u>ika alla<u>th</u>eena laAAanahumu All<u>a</u>hu faa<u>s</u>ammahum waaAAm<u>a</u> ab<u>sa</u>rahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Such are those whom God has rejected, making their ears deaf and their eyes blind."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Such are the men whom Allah has cursed for He has made them deaf and blinded their sight."}]}, {"index": 4569, "local_index": 24, "part_type": "Verse", "path": "/books/quran:47:24", "text": "أَ فَلاَ يَتَدَبَّرُونَ‌ الْقُرْآنَ‌ أَمْ‌ عَلَى‌ قُلُوبٍ‌ أَقْفَالُهَا", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آیا در قرآن نمی اندیشند [تاحقایق را بفهمند] یا بر دل هایشان قفل هایی قرار دارد؟"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا در قرآن نمى‌انديشند يا بر دلهايشان قفلهاست؟"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آيا در قرآن تدبر نمى‌كنند يا بر دل‌ها [يشان‌] قفل‌هاى [عناد] است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آيا به آيات قرآن نمى‌انديشند؟ يا [مگر] بر دلهايشان قفلهايى نهاده شده است؟"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آیا منافقان در آیات قرآن تفکر نمی‌کنند یا بر دلهاشان خود قفل‌ها (ی جهل و نفاق) زده‌اند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آیا درباره‌ی قرآن نمی‌اندیشند (و مطالب و نکات آن را بررسی و وارسی نمی‌کنند؟) یا این که بر دلهائی قفلهای ویژه‌ای زده‌اند؟ [[«أَفَلا یَتَدَبَّرُونَ الْقُرْآنَ؟»: آیات مختلفی با صراحت فریاد می‌دارند که قرآن کتاب اندیشه و عمل است و باید آن را بررسی و وارسی کرد و تنها به تلاوت ظاهری اکتفاء نکرد (نگا: نساء / 82، اسراء / 89، فرقان / 30، ق / 45، قمر / 17 و 22 و 32، یوسف / 2) «أَمْ» یا این که. بلکه. با توجه به معنی دوم این واژه، مفهوم آیه چنین است: آیا درباره قرآن نمی‌اندیشند و به بررسی و وارسی آن نمی‌پردازند؟ بلکه بر دلهائی قفلهای ویژه است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آیا در قرآن تامل نمی‌کنند، یا بر دلها قفلها[ی غفلت‌]شان افتاده است؟"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آیا آنها در قرآن تدبّر نمی‌کنند، یا بر دلهایشان قفل نهاده شده است؟!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آیا فرونمی‌روند (تدبر نمی‌کنند) در قرآن یا بر دلهائی است قفلهای آنها"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آيا در قرآن نمى‌انديشند يا بر دلها [شان‌] قفلهاست؟"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "آیا پس آیات قرآن را با نگرشی جامع (درست) نمی‌اندیشند؟ یا (مگر) بر دل‌هایی قفل‌هایشان نهاده شده است‌؟"}, {"lang": "en", "name": "Ahmed Ali", "text": "Do they not ponder on what the Qur'an says? Or have their hearts been sealed with locks?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "So do they not ponder the Qur’an deeply, or are there locks on some of their hearts?"}, {"lang": "en", "name": "A. J. Arberry", "text": "What, do they not ponder the Koran? Or is it that there are locks upon their hearts?"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Ponder then they not on the Qur'an, or are on the hearts locks thereof?"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Do they not then think deeply in the Quran, or are their hearts locked up (from understanding it)?"}, {"lang": "en", "name": "Talal Itani", "text": "Will they not ponder the Quran? Or are there locks upon their hearts?"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Do they, then, not reflect on the Qur'an? Or are there locks on their hearts?"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Will they not then reflect upon the Qur'an, or are there locks upon their hearts"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Will they then not meditate on the Qur'an, or are there locks on the hearts?"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Do they not contemplate the Quran, or are there locks on the hearts?"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Will they not then contemplate on the Koran? Or are there locks upon their hearts!"}, {"lang": "en", "name": "Saheeh International", "text": "Then do they not reflect upon the Qur'an, or are there locks upon [their] hearts?"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Is it that they do not think about the Quran or are their hearts sealed?"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Do they not then reflect on the Quran? Nay, on the hearts there are locks."}, {"lang": "en", "name": "English Transliteration", "text": "Afal<u>a</u> yatadabbaroona alqur<u>a</u>na am AAal<u>a</u> quloobin aqf<u>a</u>luh<u>a</u>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Will they not, then, ponder over this Quran? Or are there locks upon their hearts?"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Do they not then earnestly seek to understand the Qur'an, or are their hearts locked up by them?"}]}, {"index": 4570, "local_index": 25, "part_type": "Verse", "path": "/books/quran:47:25", "text": "إِنَ‌ الَّذِينَ‌ ارْتَدُّوا عَلَى‌ أَدْبَارِهِمْ‌ مِنْ‌ بَعْدِ مَا تَبَيَّنَ‌ لَهُمُ‌ الْهُدَى‌ الشَّيْطَانُ‌ سَوَّلَ‌ لَهُمْ‌ وَ أَمْلَى‌ لَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بی تردید کسانی که پس از روشن شدن هدایت برای آنان [به همان عقاید باطل و کردار ناپسندشان] برگشتند [و دست از قرآن و پیامبر برداشتند] شیطان زشتی هایشان را در نظرشان آراست و آنان را در آرزوهای دور و دراز انداخت."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "شيطان اعمال كسانى را كه بعد از آشكارشدن راه هدايت مرتد شدند و بازگشتند، در نظرشان بياراست و آرزويشان دراز كرد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "بى‌گمان، كسانى كه پس از آن كه [راه‌] هدايت براى آنها روشن شد [به حقيقت‌] پشت كردند، شيطان آنها را فريفت و آرزويشان را دراز كرد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "بى‌گمان، كسانى كه پس از آنكه [راه‌] هدايت بر آنان روشن شد [به حقيقت‌] پشت كردند، شيطان آنان را فريفت و به آرزوهاى دور و درازشان انداخت."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آنان که پس از بیان شدن راه هدایت بر آنها باز به دین پشت کرده و مرتد شدند شیطان کفر را در نظرشان جلوه‌گر ساخت و به آمال و آرزوهای دراز فریبشان داد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کسانی که بعد از روشن شدن (راه حقیقت و) هدایت، به کفر و ضلال پیشین خود برمی‌گردند، بدان خاطر است که اهریمن کارهایشان را در نظرشان می‌آراید و ایشان را با آرزوهای طولانی فریفته می‌دارد. [[«إِرْتَدُّوا عَلی أَدْبَارِهِمْ»: عقب عقب برمی‌گردند. مراد این است که مرتد و کافر می‌گردند. «سَوَّلَ»: زینت داد. خوش‌آیند نمود (نگا: یوسف / 18 و 83، طه / 96). «أَمْلی لَهُمْ»: زندگی را طولانی و جاویدان در نظرشان جلوه داد. افسار آرزوها را برایشان شل کرد و به آرزوهای فراوانی آنان را سرگرم نمود.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بی‌گمان کسانی که پس از آنکه راه هدایت بر آنان روشن شده است، به آن پشت کردند [و به گذشته برگشتند]، شیطان آن را در چشمشان آراسته است و به آنان مهلت و میدان داده است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کسانی که بعد از روشن شدن هدایت برای آنها، پشت به حق کردند، شیطان اعمال زشتشان را در نظرشان زینت داده و آنان را با آرزوهای طولانی فریفته است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "همانا آنان که برگشتند بر پشتهای خویش از پس آنکه آشکار شد برای ایشان هدایت شیطان بیاراست برای ایشان و فریبشان داد"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "كسانى كه پس از آنكه راه راست برايشان روشن و آشكار شد، پشت كرده بازگشتند- مرتد و كافر شدند-، شيطان [باطل را] براى آنها بياراست و آنان را در آرزوهاى دراز نهاد"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بی‌گمان، کسانی که -پس از آنکه (راهِ) هدایت بر آنان روشن شد- به گذشته‌ها(ی باطل)شان برگشتند، شیطان برایشان (خواسته‌های شیطانیشان را) آراسته و به آرزوهای دور و درازشان انداخته است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Those who turn their backs after the way of guidance has been opened to them, have been surely tempted by Satan and beguiled by illusory hopes."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Indeed those who turn back after the guidance had become clear to them – Satan has deceived them; and made them optimistic of living for ages."}, {"lang": "en", "name": "A. J. Arberry", "text": "Those who have turned back in their traces after the guidance has become clear to them, Satan it was that tempted them, and God respited them."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Verily those who have apostated on their backs after the guidance had become manifest Unto them, the devil hath embellished this apostacy for them and hath given them false hopes."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Verily, those who have turned back (have apostated) as disbelievers after the guidance has been manifested to them, Shaitan (Satan) has beautified for them (their false hopes), and (Allah) prolonged their term (age)."}, {"lang": "en", "name": "Talal Itani", "text": "Those who reverted after the guidance became clear to them—Satan has enticed them, and has given them latitude."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Certainly those who have turned their backs on the True Guidance after it became manifest to them, Satan has embellished their ways for them and has buoyed them up with false hopes."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Verily, those who have turned back as disbelievers after guidance had become clear to them -- Shaytan has enticed them and filled them with false hopes."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Lo! those who turn back after the guidance hath been manifested unto them, Satan hath seduced them, and He giveth them the rein."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Indeed those who turned their backs after the guidance had become clear to them, it was Satan who had seduced them, and he had given them [far-flung] hopes."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "As for those who turn back in their footsteps after the guidance of Allah has become clear to them, it was satan who tempted them, and Allah has respited them."}, {"lang": "en", "name": "Saheeh International", "text": "Indeed, those who reverted back [to disbelief] after guidance had become clear to them - Satan enticed them and prolonged hope for them."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Those who have reverted to disbelief after guidance has become manifest to them, have been seduced and given false hopes by satan."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Surely (as for) those who return on their backs after that guidance has become manifest to them, the Shaitan has made it a light matter to them; and He gives them respite."}, {"lang": "en", "name": "English Transliteration", "text": "Inna alla<u>th</u>eena irtaddoo AAal<u>a</u> adb<u>a</u>rihim min baAAdi m<u>a</u> tabayyana lahumu alhud<u>a</u> a<b>l</b>shshay<u>ta</u>nu sawwala lahum waaml<u>a</u> lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Surely, those who turn their backs [on this message] after guidance has been shown to them, [do it because] Satan has embellished their fancies and God gives them respite;"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Those who turn back as apostates after Guidance was clearly shown to them,- the Evil One has instigated them and busied them up with false hopes."}]}, {"index": 4571, "local_index": 26, "part_type": "Verse", "path": "/books/quran:47:26", "text": "ذٰلِکَ‌ بِأَنَّهُمْ‌ قَالُوا لِلَّذِينَ‌ کَرِهُوا مَا نَزَّلَ‌ اللَّهُ‌ سَنُطِيعُکُمْ‌ فِي‌ بَعْضِ‌ الْأَمْرِ وَ اللَّهُ‌ يَعْلَمُ‌ إِسْرَارَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "این به سبب آن است که آنان به کسانی [چون مشرکان و کافران] که نازل شدن وحی را خوش نداشتند، گفتند: [ما] در بعضی از امور [که بر ضد مؤمنان است] از شما اطاعت خواهیم کرد. در حالی که خدا اسرارشان را می داند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و اين بدان سبب است كه به آن گروه كه آيات خدا را ناخوش مى‌داشتند، مى‌گفتند: ما در پاره‌اى از كارها فرمانبردار شما هستيم. و خدا از رازشان آگاه است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اين بدان سبب است كه آنها به كسانى كه نزول قرآن از جانب خدا را مكروه داشتند، گفتند: به زودى در برخى كارها از شما اطاعت خواهيم كرد. و خدا همداستانى سرّى آنها را مى‌داند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "چرا كه آنان به كسانى كه آنچه را خدا نازل كرده خوش نمى‌داشتند، گفتند: «ما در كار [مخالفت‌] تا حدودى از شما اطاعت خواهيم كرد.» و خدا از همداستانى آنان آگاه است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "این (برگشتن از دین) برای آن بود که آن منافقان به دشمنان قرآن (پنهانی) گفتند: ما البته با شما (بر مخالفت محمّد) تا بتوانیم موافقت می‌کنیم. و خدا از این سخن پنهانی آنها آگاه است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "این (چرخ زدن و از دین برگشتن) بدان خاطر است که به کسانی که دشمن چیزی هستند که خدا فرو فرستاده است، گفته بودند: در برخی از کارها از شما اطاعت و پیروی می‌کنیم! خدا آگاه از پنهان‌کاری ایشان می‌باشد. [[«الَّذِینَ کَرِهُوا ...»: مراد یهودیان بنی‌قریظه و بنی‌نضیر است (نگا: احزاب / 26 و 27). «کَرِهُوا»: دشمن داشته‌اند. نپسندیده‌اند. «بَعْضِ الأمْرِ»: (نگا: حشر / 11 و 12). «إِسرَار»: پنهانکاری. مراد پنهان کردن و مخفی داشتن مکر و کید است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "این از آن است که به کسانی که [وحی‌] فرو فرستاده الهی را ناخوش داشته‌اند، گویند زودا که در بعضی کارها از شما اطاعت کنیم، و خداوند پنهانکاریشان را می‌داند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "این بخاطر آن است که آنان به کسانی که نزول وحی الهی را کراهت داشتند گفتند: «ما در بعضی از امور از شما پیروی می‌کنیم؟» در حالی که خداوند پنهانکاری آنان را می‌داند."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "این بدان است که گفتند بدانان که ناخوش داشتند آنچه را خدا فرستاد زود است فرمانبرداری کنیم شما را در پاره‌ای از کار و خدا داند نهان‌داشتن آنان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اين همه از آن روست كه آنان به كسانى كه آنچه را خداى فرو فرستاده ناخوش داشتند گفتند: ما در برخى از كارها شما را فرمان خواهيم برد، و خدا نهان‌داشتن آنها- پنهان سخن‌گفتن و رازهاى آنان- را مى‌داند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "این به‌راستی بدین جهت است که آنان به کسانی که آنچه را خدا نازل کرده بسی بدحال و بدنوال بودند. گفتند: «ما در برخی کارها از شما اطاعت خواهیم کرد.» حال آنکه خدا از پنهان کردن رازشان آگاه است."}, {"lang": "en", "name": "Ahmed Ali", "text": "This was so because they said to those who disdain what God has revealed: \"We shall obey you in some things.\" But God knows their secret intentions well."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "This is because they said to those who dislike what Allah has sent down, “We will obey you regarding one matter*”; and Allah knows their secrets. (* To fight against the Holy Prophet)."}, {"lang": "en", "name": "A. J. Arberry", "text": "That is because they said to those who were averse to what God sent down, 'We will obey you in some of the affair'; and God knows their secrets."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "That is because they said Unto those who detest that which Allah hath revealed: we shall obey you in part of the affair; and Allah knoweth their talking in secret."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "This is because they said to those who hate what Allah has sent down: \"We will obey you in part of the matter,\" but Allah knows their secrets."}, {"lang": "en", "name": "Talal Itani", "text": "That is because they said to those who hated what God has revealed, “We will obey you in certain matters.” But God knows their secret thoughts."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "This, because they said to those who are averse to the faith that Allah has revealed: “In some matters we shall obey you.” Allah has full knowledge of their secret parleys."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "That is because they said to those who hate what Allah has sent down: \"We will obey you in part of the matter.\" And Allah knows their secrets."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "That is because they say unto those who hate what Allah hath revealed: We will obey you in some matters; and Allah knoweth their secret talk."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "That is because they said to those who loathed what Allah had sent down: ‘We shall obey you in some matters,’ and Allah knows their secret dealings."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "That is because they say to those averse to what Allah has sent down 'We shall obey you in some of the matters' Allah knows their secrets."}, {"lang": "en", "name": "Saheeh International", "text": "That is because they said to those who disliked what Allah sent down, \"We will obey you in part of the matter.\" And Allah knows what they conceal."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "This is because they have said to those who hate God's revelation, \"We shall obey you in some matters.\" But God knows all their secrets."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "That is because they say to those who hate what Allah has revealed: We will obey you in some of the affairs; and Allah knows their secrets."}, {"lang": "en", "name": "English Transliteration", "text": "<u>Tha</u>lika biannahum q<u>a</u>loo lilla<u>th</u>eena karihoo m<u>a</u> nazzala All<u>a</u>hu sanu<u>t</u>eeAAukum fee baAA<u>d</u>i alamri wa<b>A</b>ll<u>a</u>hu yaAAlamu isr<u>a</u>rahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "because they say to those who abhor what God has revealed, \"We will obey you in some matters.\" God knows their secrets."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "This, because they said to those who hate what Allah has revealed, \"We will obey you in part of (this) matter\"; but Allah knows their (inner) secrets."}]}, {"index": 4572, "local_index": 27, "part_type": "Verse", "path": "/books/quran:47:27", "text": "فَکَيْفَ‌ إِذَا تَوَفَّتْهُمُ‌ الْمَلاَئِکَةُ يَضْرِبُونَ‌ وُجُوهَهُمْ‌ وَ أَدْبَارَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "پس حال و وضعشان زمانی که فرشتگان جانشان را می گیرند در حالی که بر صورت و پشتشان [تازیانه عذاب] می زنند، چگونه خواهد بود؟!"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "چگونه‌اند آنگاه كه فرشتگان آنها را مى‌ميرانند و بر صورت و پشتهايشان مى‌زنند؟"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "پس چگونه‌اند هنگامى كه فرشتگان جانشان را مى‌گيرند در حالى كه بر صورت‌ها و پشت‌هايشان مى‌كوبند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "پس چگونه [تاب مى‌آورند] وقتى كه فرشتگان [عذاب‌]، جانشان را مى‌ستانند و بر چهره و پشت آنان تازيانه مى‌نوازند؟"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "پس با چه حال سختی اینان رو به رو شوند هنگامی که فرشتگان (عذاب) جانشان بگیرند و بر روی و پشت آنها (تازیانه قهر) زنند؟!"}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "حال آنان چگونه خواهد بود بدان هنگام که فرشتگان مأمور قبض ارواح به سراغشان می‌آیند و چهره‌ها و پشتها (و سایر اندامهای) ایشان را به زیر ضربات خود می‌گیرند؟! [[«تَوَفَّتْهُمْ»: ایشان را دریابند و قبض روح کنند. ایشان را از جهان برمی‌گیرند (نگا: نساء / 97، انعام / 61، اعراف / 37، نحل / 28 و 32). «یَضْرِبُونَ وُجُوهَهُمْ»: (نگا: انفال / 50).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "پس چگونه باشد حالشان آنگاه که فرشتگان جانشان را بگیرند و چهره‌ها و پشتهایشان را فرو کوبند؟"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "حال آنها چگونه خواهد بود هنگامی که فرشتگان (مرگ) بر صورت و پشت آنان می‌زنند و جانشان را می‌گیرند؟!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "پس چگونه است گاهی که بیابندشان فرشتگان زنند رویهای ایشان و پشتهای ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "پس چون‌اند [آن منافقان‌] آنگاه كه فرشتگان جانشان را مى‌گيرند بر رويها و پشتهاشان مى‌زنند؟!"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس چگونه است هنگامی که فرشتگان (عذاب) جانشان را می‌ستانند، حال آنکه بر چهره‌ها و پشت‌هاشان می‌زنند؟"}, {"lang": "en", "name": "Ahmed Ali", "text": "How will it be when the angels draw out their souls striking their faces and their backs?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "So how (dreadful) will it be when the angels remove their souls, striking at their faces and their backs!"}, {"lang": "en", "name": "A. J. Arberry", "text": "How shall it be, when the angels take them, beating their faces and their backs?"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "How then shall it be when the angels shall take them away at death smiting their faces and their backs!"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Then how (will it be) when the angels will take their souls at death, smiting their faces and their backs?"}, {"lang": "en", "name": "Talal Itani", "text": "How about when the angels take them at death, beating their faces and their backs?"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "But how will they fare when angels will take their souls at death and will carry them, striking their faces and backs?"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Then how (will it be) when the angels will take their souls at death, striking their faces and their backs"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Then how (will it be with them) when the angels gather them, smiting their faces and their backs!"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "But how will it be [with them] when the angels take them away, striking their faces and their backs?!"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "How shall it be when the angels (of death) take them and beat them on their face and back?"}, {"lang": "en", "name": "Saheeh International", "text": "Then how [will it be] when the angels take them in death, striking their faces and their backs?"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "How terrible it will be for them when the angels take away their souls by striking their faces and their backs."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "But how will it be when the angels cause them to die smiting their backs."}, {"lang": "en", "name": "English Transliteration", "text": "Fakayfa i<u>tha</u> tawaffathumu almal<u>a</u>ikatu ya<u>d</u>riboona wujoohahum waadb<u>a</u>rahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Then how will it be when the angels take their souls, beating them on their faces and their backs,"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "But how (will it be) when the angels take their souls at death, and smite their faces and their backs?"}]}, {"index": 4573, "local_index": 28, "part_type": "Verse", "path": "/books/quran:47:28", "text": "ذٰلِکَ‌ بِأَنَّهُمُ‌ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ‌ وَ کَرِهُوا رِضْوَانَهُ‌ فَأَحْبَطَ أَعْمَالَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "این عذاب برای این است که آنان از آنچه خدا را به خشم آورده پیروی کردند، و خشنودی او را خوش نداشتند در نتیجه اعمالشان را تباه و بی اثر کرد."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اين به كيفر آن است كه از آنچه خدا را به خشم مى‌آورد پيروى مى‌كرده‌اند و از آنچه خشنودش مى‌ساخته كراهت داشته‌اند. خدا نيز اعمالشان را نابود كرد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اين بدان سبب است كه آنها از آنچه خدا را به خشم آورده پيروى كردند و از خرسندى‌اش كراهت داشتند پس [خداوند] اعمالشان را نابود كرد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "زيرا آنان از آنچه خدا را به خشم آورده پيروى كرده‌اند و خرسنديش را خوش نداشتند؛ پس اعمالشان را باطل گردانيد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "این عذاب بدین سبب است که از پی راهی که موجب خشم خداست رفتند و راه رضا و خشنودی او را خوش نداشتند خدا هم اعمالشان را محو و باطل گردانید."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "این گونه (جان برگرفتن ایشان) بدان خاطر است که آنان بدنبال چیزی می‌روند که خدای را بر سر خشم می‌آورد، و از چیزی که موجب خوشنودی او است بدشان می‌آید، و لذا خداوند کارهای (نیک) ایشان را باطل و بیسود می‌گرداند. [[«أَسْخَطَ»: خشمگین گرداند. «رِضْوانَهُ»: رضایت و خوشنودی او.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "این از آن است که از آنچه خداوند را به خشم آورد پیروی می‌کنند و خشنودی او را ناخوش دارند، و [خداوند] اعمالشان را تباه [و بی‌ارزش‌] کند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "این بخاطر آن است که آنها از آنچه خداوند را به خشم می‌آورد پیروی کردند، و آنچه را موجب خشنودی اوست کراهت داشتند؛ از این رو (خداوند) اعمالشان را نابود کرد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "این بدان است که پیروی کردند آنچه را به خشم آورد خدا را و ناخوش داشتند خوش‌آیند او را پس تباه ساخت کردارهای ایشان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اين [عذاب‌] از آن روست كه آنان از آنچه خداى را به خشم آورد پيروى كردند و خشنودى او را خوش نداشتند، پس كارهاشان را تباه و بى‌اثر ساخت."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "این بدین سبب است که آنان از آنچه خدا را به خشم آورده پیروی کرده‌اند، و خوشامدش را بس ناخوش داشتند. پس اعمالشان را تباه و ناچیز کرد."}, {"lang": "en", "name": "Ahmed Ali", "text": "Because they followed what displeases God, and they were averse to pleasing Him. So We nullified their deeds."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "This is because they followed the matter which displeases Allah, and they disliked what pleases Him – He therefore squandered away all their deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "That is because they have followed what angers God, and have been averse to His good pleasure, so He has made their works to fail."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "That is because they followed that which angered Allah and detested His good-will; so He made their works of non-effect."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "That is because they followed that which angered Allah, and hated that which pleased Him. So He made their deeds fruitless."}, {"lang": "en", "name": "Talal Itani", "text": "That is because they pursued what displeases God, and they disliked His approval, so He nullified their works."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "That is because they have followed a way that angered Allah, and have been averse to His good pleasure. So He reduced all their works to nought."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "That is because they followed that which angered Allah and hated what earns His pleasure, so He rendered their deeds worthless."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "That will be because they followed that which angereth Allah, and hated that which pleaseth Him. Therefor He hath made their actions vain."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "That, because they pursued what displeased Allah, and loathed His pleasure. So He has made their works fail."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "That is because they follow what angers Allah and hate His pleasure, therefore He has annulled their deeds."}, {"lang": "en", "name": "Saheeh International", "text": "That is because they followed what angered Allah and disliked [what earns] His pleasure, so He rendered worthless their deeds."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "for their following that which had incurred God's anger, and their hatred to please God. Thus, God has made their deeds devoid of all virtue."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "That is because they follow what is displeasing to Allah and are averse to His pleasure, therefore He has made null their deeds."}, {"lang": "en", "name": "English Transliteration", "text": "<u>Tha</u>lika biannahumu ittabaAAoo m<u>a</u> askha<u>t</u>a All<u>a</u>ha wakarihoo ri<u>d</u>w<u>a</u>nahu faa<u>h</u>ba<u>t</u>a aAAm<u>a</u>lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "because they followed the way that made God wrathful, and hated to adopt the way of His pleasure? So He made their actions come to nothing."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "This because they followed that which called forth the Wrath of Allah, and they hated Allah's good pleasure; so He made their deeds of no effect."}]}, {"index": 4574, "local_index": 29, "part_type": "Verse", "path": "/books/quran:47:29", "text": "أَمْ‌ حَسِبَ‌ الَّذِينَ‌ فِي‌ قُلُوبِهِمْ‌ مَرَضٌ‌ أَنْ‌ لَنْ‌ يُخْرِجَ‌ اللَّهُ‌ أَضْغَانَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بلکه کسانی که در دل هایشان بیماری است، گمان کردند که خدا کینه هایشان را آشکار نخواهد کرد."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا آنان كه در دلشان مرضى است مى‌پندارند كه خدا كينه‌اى را كه در دل نهفته دارند آشكار نخواهد كرد؟"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آيا كسانى كه در دل‌هايشان بيمارى است، پنداشته‌اند كه خدا هرگز كينه‌هايشان را فاش نخواهد كرد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آيا كسانى كه در دلهايشان مرضى هست، پنداشتند كه خدا هرگز كينه آنان را آشكار نخواهد كرد؟"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آیا آنان که در دل مرض (نفاق پنهان) دارند پندارند که خدا کینه درونی آنها را آشکار نمی‌سازد؟"}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آیا کسانی که در دلهایشان بیماری (نفاق و کینه‌توزی اسلام) است، گمان می‌برند خدا کینه‌ها و دشمنانگیهای ایشان را (که از اسلام و مسلمین در دل دارند) ظاهر و برملا نمی‌گرداند؟ [[«أَضْغان»: جمع ضِعْن، حقد و کینه‌های شدید. «لَن یُخْرِجَ ...»: (نگا: توبه / 64).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آیا بیماردلان پنداشته‌اند که خداوند هرگز حقد و حسدهایشان را آشکار نمی‌سازد؟"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آیا کسانی که در دلهایشان بیماری است گمان کردند خدا کینه‌هایشان را آشکار نمی‌کند؟!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "یا پنداشتند آنان که در دلهاشان بیماری است که هرگز برون نیارد خدا کینه‌های آنان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "بلكه كسانى كه در دلهاشان بيماريى- شك و نفاق- است مى‌پندارند كه خدا كينه‌هاشان را آشكار نخواهد ساخت."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "یا کسانی که در دل‌هاشان مرضی هست، پنداشتند که خدا هرگز کینه‌هاشان را برون [:افشا] نخواهد کرد؟"}, {"lang": "en", "name": "Ahmed Ali", "text": "Do they whose minds are filled with doubt, think that God will not expose their malice?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "What! Do they, in whose hearts is a disease, fancy that Allah will not expose concealed enmities?"}, {"lang": "en", "name": "A. J. Arberry", "text": "Or did those in whose hearts is sickness think that God would not bring to light their rancour?"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Deem those in whose hearts is a disease that Allah will never bring to light their secret malevolence?"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Or do those in whose hearts is a disease (of hypocrisy), think that Allah will not bring to light all their hidden ill-wills?"}, {"lang": "en", "name": "Talal Itani", "text": "Do those in whose hearts is sickness think that God will not expose their malice?"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Or do they, in whose hearts there is a sickness, believe that Allah will not bring their failings to light?"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Or do those in whose hearts is a disease, think that Allah will not expose their ill--wills"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Or do those in whose hearts is a disease deem that Allah will not bring to light their (secret) hates?"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Do those in whose hearts is a sickness suppose that Allah will not expose their spite?"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Or, do those who have a disease in their hearts think that Allah will not reveal their hatred?"}, {"lang": "en", "name": "Saheeh International", "text": "Or do those in whose hearts is disease think that Allah would never expose their [feelings of] hatred?"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Do those whose hearts are sick think that God will never make their malice public?"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Or do those in whose hearts is a disease think that Allah will not bring forth their spite?"}, {"lang": "en", "name": "English Transliteration", "text": "Am <u>h</u>asiba alla<u>th</u>eena fee quloobihim mara<u>d</u>un an lan yukhrija All<u>a</u>hu a<u>d</u>gh<u>a</u>nahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Do the sick at heart imagine that God will not bring to light their malice?"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Or do those in whose hearts is a disease, think that Allah will not bring to light all their rancour?"}]}, {"index": 4575, "local_index": 30, "part_type": "Verse", "path": "/books/quran:47:30", "text": "وَ لَوْ نَشَاءُ لَأَرَيْنَاکَهُمْ‌ فَلَعَرَفْتَهُمْ‌ بِسِيمَاهُمْ‌ وَ لَتَعْرِفَنَّهُمْ‌ فِي‌ لَحْنِ‌ الْقَوْلِ‌ وَ اللَّهُ‌ يَعْلَمُ‌ أَعْمَالَکُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اگر بخواهیم یقیناً آنان را به تو نشان می دهیم تا آنان را از روی نشانه هایشان بشناسی، و بی تردید آنان را از شیوه سخن گفتن خواهی شناخت؛ و خدا کارهای شما را می داند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اگر بخواهيم، آنها را به تو مى‌نمايانيم و تو آنها را به سيمايشان يا از شيوه سخنشان خواهى شناخت، و خدا از اعمالتان آگاه است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و اگر مى‌خواستيم، قطعا آنها را به تو نشان مى‌داديم و در نتيجه ايشان را به سيمايشان مى‌شناختى، و البته تو آنها را در لحن [و زهر] كلامشان [به راحتى‌] مى‌شناسى، و خدا از [ظاهر و باطن‌] اعمالتان آگاه است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و اگر بخواهيم، قطعاً آنان را به تو مى‌نمايانيم، در نتيجه ايشان را به سيماى [حقيقى‌]شان مى‌شناسى و از آهنگ سخن به [حال‌] آنان پى خواهى برد؛ و خداست كه كارهاى شما را مى‌داند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "اگر ما می‌خواستیم حقیقت آنها را (به وحی) بر تو آشکار می‌ساختیم تا به باطن آنها از سیمای ظاهرشان پی برده و در طیّ سخن کاملا آنها را بشناسی. و (ای منافقان و ای مؤمنان) خدا به همه کارهای شما آگاه است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "اگر ما می‌خواستیم آنان را به تو نشان می‌دادیم و تو از روی قیافه و علامتشان ایشان را می‌شناختی. تو قطعاً آنان را از روی طرز سخن و نحوه‌ی گفتار می‌شناسی. خداوند آگاه از کارهایتان می‌باشد (و حقیقت پندار و گفتار و رفتارتان را می‌داند و همگان را خوب می‌شناسد و پاداش و پادافره لازم را به هر کسی خواهد داد). [[«بِسِیمَاهُمْ»: سیما، قیافه. علامت. «لَحْنِ الْقَوْلِ»: شیوه سخن. طرز سخن.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و اگر بخواهیم آنان را به تو می‌نمایانیم، آنگاه ایشان را به سیمایشان می‌شناسی، و آنان را از آهنگ سخنشان می‌شناسی، و خداوند [ظاهر و باطن‌] اعمالتان را می‌داند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اگر ما بخواهیم آنها را به تو نشان می‌دهیم تا آنان را با قیافه‌هایشان بشناسی، هر چند می‌توانی آنها را از طرز سخنانشان بشناسی؛ و خداوند اعمال شما را می‌داند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و اگر می‌خواستیم هر آینه می‌نمودیمت آنان را که بشناسیشان با چهره‌هاشان و بشناسیشان هر آینه در آهنگ گفتار و خدا داند کارهای شما را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و اگر خواهيم آنان را به تو مى‌نماييم پس آنها را به سيمايشان بازشناسى و هر آينه ايشان را از شيوه سخنشان خواهى شناخت، و خدا كارهاى شما را مى‌داند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و اگر بخواهیم، همواره آنان را به تو می‌نمایانیم، پس ایشان را به چهره‌هاشان همواره بشناسی. و به‌راستی در اشاره‌ی گزافِ سخن(شان)، به (حال) آنان به‌خوبی پی خواهی بُرد. و خداست که کارهای شما را می‌داند."}, {"lang": "en", "name": "Ahmed Ali", "text": "Had We pleased We could have shown them to you that you could know them by their marks, and recognise them from the way they twist their words. Yet God knows all your deeds."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And if We will, We can show them to you so that you may recognise them by their faces; and you will surely recognise them by the way they talk; and Allah knows your deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "Did We will, We would show them to thee, then thou wouldst know them by their mark; and thou shalt certainly know them in the twisting of their speech; and God knows your deeds."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And if We willed, We would surely shew them Unto thee, so that thou shouldst surely know them by their marks. And thou shalt surely know them by the mode of their speech. And Allah knoweth your works."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Had We willed, We could have shown them to you, and you should have known them by their marks, but surely, you will know them by the tone of their speech! And Allah knows all your deeds."}, {"lang": "en", "name": "Talal Itani", "text": "Had We willed, We could have shown them to you, and you would have recognized them by their marks. Yet you will recognize them by their tone of speech. And God knows your actions."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "If We were to so will, We could have shown them to you so that you would recognise them by their faces, and you would certainly know them by the manner of their speech. Allah knows all your deeds."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Had We so willed, We could have shown them clearly to you, so that you would know them by their marks; but you will know them by the tone of their speech! And Allah knows (all) your deeds."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And if We would, We could show them unto thee (Muhammad) so that thou shouldst know them surely by their marks. And thou shalt know them by the burden of their talk. And Allah knoweth your deeds."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "If We wish, We will show them to you so that you recognize them by their mark. Yet you will recognize them by their tone of speech, and Allah knows your deeds."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "If We willed, We would show them to you and you would recognize them by their marks. But you will surely know them by their twisted speech. Allahknows your deeds."}, {"lang": "en", "name": "Saheeh International", "text": "And if We willed, We could show them to you, and you would know them by their mark; but you will surely know them by the tone of [their] speech. And Allah knows your deeds."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Had We wanted, We could have made you recognize their faces. You will certainly recognize them by the tone of their speech. God knows all your deeds."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And if We please We would have made you know them so that you would certainly have recognized them by their marks and most certainly you can recognize them by the intent of (their) speech; and Allah knows your deeds."}, {"lang": "en", "name": "English Transliteration", "text": "Walaw nash<u>a</u>o laarayn<u>a</u>kahum falaAAaraftahum biseem<u>a</u>hum walataAArifannahum fee la<u>h</u>ni alqawli wa<b>A</b>ll<u>a</u>hu yaAAlamu aAAm<u>a</u>lakum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Now had We so willed, We could have shown them clearly to you, and then you could have identified them by their marks, but surely you will know them by the tone of their speech! God knows all that you do."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Had We so wiled, We could have shown them up to thee, and thou shouldst have known them by their marks: but surely thou wilt know them by the tone of their speech! And Allah knows all that ye do."}]}, {"index": 4576, "local_index": 31, "part_type": "Verse", "path": "/books/quran:47:31", "text": "وَ لَنَبْلُوَنَّکُمْ‌ حَتَّى‌ نَعْلَمَ‌ الْمُجَاهِدِينَ‌ مِنْکُمْ‌ وَ الصَّابِرِينَ‌ وَ نَبْلُوَ أَخْبَارَکُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "به یقین ما شما را امتحان می کنیم تا مجاهدان از شما و صابران را مشخص نماییم، و اخبار شما را نیز [که اعمال و اسرار شماست] می آزماییم [تا صدق و کذب شما را در همه امور معلوم بداریم.]"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و شما را مى‌آزماييم تا مجاهدان و صابرانتان را معلوم داريم و حديثتان را آشكار كنيم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و البته شما را مى‌آزماييم تا مجاهدان و صابران شما را بشناسيم و گزارش‌هاى [مربوط به‌] شما را رسيدگى و برملا كنيم"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و البته شما را مى‌آزماييم تا مجاهدان و شكيبايان شما را باز شناسانيم، و گزارشهاى [مربوط به‌] شما را رسيدگى كنيم."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و البته ما (به حکم جهاد) شما را در مقام امتحان می‌آوریم تا (مقام) آن را که در راه خدا جهاد و مجاهده و کوشش دارد و (بر رنج آن) صبر می‌کند معلوم سازیم و اخبار و اظهارات شما (منافقان) را نیز (به مقام عمل) بیازماییم."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ما همه‌ی شما را (با وجود آگاهی از اعمالتان) قطعاً آزمایش می‌کنیم، تا معلوم شود مجاهدان (واقعی) و صابران شما کیانند (و مجاهدنماها و ناشکیبایان سست‌عنصر کیان). و اخبار شما را بیازمائیم (که آیا در راه اسلام صادقانه سخن گفته‌اید یا خیر. دعوت مستمرّ و خستگی‌ناپذیر داشته‌اید و از اسلحه‌ی گفتار در قلع و قمع کفّار سود برده‌اید، یا از لوم لائم ترسیده‌اید). [[«حَتّی نَعْلَمَ»: (نگا: بقره / 143، آل‌عمران / 140، سبأ / 21). «نَبْلُوَ»: الف زائدی در رسم‌الخط قرآنی در آخر دارد. «أَخْبَارَکُمْ»: مراد از اخبار، هنرنمائی در شیوه بیان در کار تبلیغ و دعوت مردم به راه حق، و ضعف و قوت در این امر، و دوام و یا عدم دوام و فداکاری و یا عدم فداکاری در راه نشر دین است (نگا: تفسیر قاسمی). خبرهای اطاعت یا عدم اطاعت در جهاد. یا این که مراد از اخبار، اعمال بطور کلی است، اعم از خوب و بد.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و همه گونه می‌آزماییمتان تا از میان شما مجاهدان و صابران را معلوم بداریم، و احوالتان را بشناسانیم‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ما همه شما را قطعاً می‌آزمائیم تا معلوم شود مجاهدان واقعی و صابران از میان شما کیانند، و اخبار شما را بیازماییم!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "هر آینه بیازمائیم شما را تا بدانیم کوششگران را از شما و شکیبایان را و بیازمائیم داستانها (یا آگهیهای) شما را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و هر آينه شما را بيازماييم تا مجاهدان و شكيبايان- پايداران- شما را معلوم كنيم و خبرهاى شما- اعمالتان- را بيازماييم."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و به‌راستی شما را بی‌گمان می‌آزماییم، تا مجاهدان و شکیبایانِ از شما را نشانه نهیم و گزارش‌هایتان را ارزیابی کنیم."}, {"lang": "en", "name": "Ahmed Ali", "text": "We shall try you in order to know who are the fighters among you, and who are men of fortitude, and verify your histories."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And We shall indeed test you until We make known the warriors and the steadfast among you – and to test your proclamations."}, {"lang": "en", "name": "A. J. Arberry", "text": "And We shall assuredly try you until We know those of you who struggle and are steadfast, and try your tidings."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And of a surety We shall prove you all until We know the strivers among you and the steadfast, and We shall prove your states."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And surely, We shall try you till We test those who strive hard (for the Cause of Allah) and the patient ones, and We shall test your facts (i.e. the one who is a liar, and the one who is truthful)."}, {"lang": "en", "name": "Talal Itani", "text": "We will certainly test you, until We know those among you who strive, and those who are steadfast, and We will test your reactions."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "We shall certainly test you until We know those of you who truly strive and remain steadfast, and will ascertain about you."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And We will surely, try you until We know those who strive among you and the patient, and We will put to a test all your affairs."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And verily We shall try you till We know those of you who strive hard (for the cause of Allah) and the steadfast, and till We test your record."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "We will surely test you until We ascertain those of you who wage jihad and those who are steadfast, and We shall appraise your record."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Without doubt We shall test you until We know those who struggle and are patient among you, and make clear your news."}, {"lang": "en", "name": "Saheeh International", "text": "And We will surely test you until We make evident those who strive among you [for the cause of Allah] and the patient, and We will test your affairs."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "We shall certainly test you until We know those who strive hard for the cause of God and those who exercise patience. We will also examine your deeds."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And most certainly We will try you until We have known those among you who exert themselves hard, and the patient, and made your case manifest."}, {"lang": "en", "name": "English Transliteration", "text": "Walanabluwannakum <u>h</u>att<u>a</u> naAAlama almuj<u>a</u>hideena minkum wa<b>al</b><u>ssa</u>bireena wanabluwa akhb<u>a</u>rakum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Most certainly We will try you until We have discovered those among you who strive their hardest, and those who are steadfast, and will test your record."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "And We shall try you until We test those among you who strive their utmost and persevere in patience; and We shall try your reported (mettle)."}]}, {"index": 4577, "local_index": 32, "part_type": "Verse", "path": "/books/quran:47:32", "text": "إِنَ‌ الَّذِينَ‌ کَفَرُوا وَ صَدُّوا عَنْ‌ سَبِيلِ‌ اللَّهِ‌ وَ شَاقُّوا الرَّسُولَ‌ مِنْ‌ بَعْدِ مَا تَبَيَّنَ‌ لَهُمُ‌ الْهُدَى‌ لَنْ‌ يَضُرُّوا اللَّهَ‌ شَيْئاً وَ سَيُحْبِطُ أَعْمَالَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "مسلماً آنان که کفر ورزیدند و [مردم را] از راه خدا باز داشتند و پس از آنکه هدایت برای آنان روشن شد با پیامبر به شدت دشمنی نمودند، هرگز هیچ زیانی به خدا نمی رسانند و خدا به زودی اعمالشان را تباه و بی اثر می کند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "كسانى كه ايمان نياوردند و از راه خدا رويگردان شدند و با آنكه راه هدايت برايشان آشكار شده بود با پيامبر مخالفت ورزيدند، هيچ زيانى به خدا نخواهند رسانيد و خدا اعمالشان را نابود خواهد كرد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "[و] كسانى كه كافر شدند و [مردم را] از راه خدا بازداشتند و پس از آن كه راه هدايت براى آنها آشكار شد، با رسول [خدا] در افتادند، هرگز به خدا گزندى نمى‌رسانند، و [خدا] به زودى كرده‌هايشان را تباه مى‌كند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "كسانى كه كافر شدند و [مردم را] از راه خدا باز داشتند و پس از آنكه راه هدايت بر آنان آشكار شد، با پيامبر [خدا] در افتادند، هرگز به خدا گزندى نمى‌رسانند؛ و به زودى [خدا] كرده‌هايشان را تباه خواهد كرد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آنان که کافر شدند و راه خدا را (به روی خلق) بستند و با رسول او پس از آنکه راه هدایت بر آنها روشن شد باز مخالفت کردند به خدا ضرری نمی‌رسانند (و زیان مخالفت بر خود آنهاست) و اعمال آنها را خدا البته بی اثر و محو و نابود می‌گرداند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کسانی که کافر می‌شوند، و مردمان را از راه خدا بازمی‌دارند، و بدنبال آن که هدایت برایشان شناخته و روشن می‌گردد با پیغمبر به مخالفت و دشمنانگی می‌پردازند، هرگز کمترین زیانی به خدا نمی‌رسانند، و بلکه خدا کارهای (نیک) ایشان را هم باطل و بیسود می‌گرداند. [[«شَآقُّوا»: دشمنانگی کردند. به مخالفت پرداختند. «سَیُحْبِطُ أَعْمَالَهُمْ»: کارهای نیکشان را باطل می‌گرداند و فایده‌ای در آخرت عائدشان نمی‌نماید. کارهائی را که در راه جلوگیری از اسلام می‌کنند، خدا آنها را بی‌اثر می‌گرداند، و موانع ایشان را از سر راه اسلام برمی‌دارد.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بی‌گمان کسانی که کفرورزیده‌اند و [مردم را] از راه خدا باز داشته‌اند، و پس از آنکه راه هدایت بر آنان روشن شده است، با پیامبر مخالفت ورزیده‌اند، هرگز به خداوند زیانی نمی‌رسانند و زودا که [خداوند] اعمالشان را تباه و [بی‌ارزش‌] گرداند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آنان که کافر شدند و (مردم را) از راه خدا بازداشتند و بعد از روشن‌شدن هدایت برای آنان (باز) به مخالفت با رسول (خدا) برخاستند، هرگز زیانی به خدا نمی‌رسانند و (خداوند) بزودی اعمالشان را نابود می‌کند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "همانا آنان که کفر ورزیدند و بازداشتند از راه خدا و ستیزه کردند با پیمبر پس از آنکه روشن شد برای ایشان رهبری هرگز آسیب نرسانند خدا را به چیزی و زود است تباه سازد کارهای آنان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "همانا كسانى كه كافر شدند و [مردم را] از راه خدا بازداشتند- يا: و از راه خدا بگرديدند- و پس از آنكه راه راست برايشان روشن و هويدا شد با پيامبر مخالفت كردند هرگز به خدا هيچ گزندى نرسانند و زودا كه كارهاشان را بى‌اثر و نابود سازد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "همانا کسانی که کافر شدند و (مردم را) از راه خدا باز داشتند و پس از آنکه راه هدایت بر آنان آشکار شد، با پیامبر (خدا) به جدایی درافتادند، هرگز به خدا گزندی نمی‌رسانند؛ و به زودی (خدا) کرده‌هایشان را تباه خواهد کرد."}, {"lang": "en", "name": "Ahmed Ali", "text": "Surely those who do not believe, and obstruct others from the path of God, and oppose the Prophet after the way of guidance has been opened to them, will not hurt God in the least, and He will nullify all that they have done."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Indeed those who disbelieved and prevented others from Allah’s way, and opposed the Noble Messenger after the guidance had become clear to them – they cannot harm Allah in the least; and soon He will squander away their deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "Those who disbelieve and bar from God's way and make a breach with the Messenger after the guidance has become clear to them, they will nothing hurt God, and He will make their works to fail."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Verily those who have disbelieved and have hindered others from the way of Allah and have opposed the apostle after the guidance had become manifest Unto them, shall not hurt Allah at all, and anon He shall render their works of non effect."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Verily, those who disbelieve, and hinder (men) from the Path of Allah (i.e. Islam), and oppose the Messenger (SAW) (by standing against him and hurting him), after the guidance has been clearly shown to them, they will not hurt Allah in the least, but He will make their deeds fruitless,"}, {"lang": "en", "name": "Talal Itani", "text": "Those who disbelieve, and hinder from the path of God, and oppose the Messenger after guidance has become clear to them—they will not hurt God in the least, but He will nullify their deeds."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Those who disbelieved and barred others from Allah's Way and opposed the Messenger after the True Guidance had become manifest to them, they shall not be able to cause Allah the least harm; rather, Allah will reduce all their works to nought."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Verily, those who disbelieve, and hinder from the path of Allah, and oppose the Messenger, after the guidance has been clearly shown to them, they will not harm Allah in the least, but He will make their deeds fruitless,"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Lo! those who disbelieve and turn from the way of Allah and oppose the messenger after the guidance hath been manifested unto them, they hurt Allah not a jot, and He will make their actions fruitless."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Indeed those who are faithless and bar from the way of Allah and defy the Apostle after guidance has become clear to them, they will not hurt Allah in the least, and He shall make their works fail."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Those who disbelieve and bar from the Path of Allah, and break with the Messenger after guidance has been made clear to them shall not hurt Allah a thing, and He will annul their deeds."}, {"lang": "en", "name": "Saheeh International", "text": "Indeed, those who disbelieved and averted [people] from the path of Allah and opposed the Messenger after guidance had become clear to them - never will they harm Allah at all, and He will render worthless their deeds."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "The disbelievers who prevent others from the way of God and give the Messengers a hard time - even after the guidance has been made clear to them - will never be able to cause any harm to God, and He will turn their deeds devoid of all virtue."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Surely those who disbelieve and turn away from Allah's way and oppose the Apostle after that guidance has become clear to them cannot harm Allah in any way, and He will make null their deeds."}, {"lang": "en", "name": "English Transliteration", "text": "Inna alla<u>th</u>eena kafaroo wa<u>s</u>addoo AAan sabeeli All<u>a</u>hi wash<u>a</u>qqoo a<b>l</b>rrasoola min baAAdi m<u>a</u> tabayyana lahumu alhud<u>a</u> lan ya<u>d</u>uroo All<u>a</u>ha shayan wasayu<u>h</u>bi<u>t</u>u aAAm<u>a</u>lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Surely, they who are bent on denying the truth and on barring [others] from the path of God, and oppose the Messenger when they have been shown guidance, cannot harm God in any way. He will cause all their deeds to come to nothing."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Those who reject Allah, hinder (men) from the Path of Allah, and resist the Messenger, after Guidance has been clearly shown to them, will not injure Allah in the least, but He will make their deeds of no effect."}]}, {"index": 4578, "local_index": 33, "part_type": "Verse", "path": "/books/quran:47:33", "text": "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا أَطِيعُوا اللَّهَ‌ وَ أَطِيعُوا الرَّسُولَ‌ وَ لاَ تُبْطِلُوا أَعْمَالَکُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای اهل ایمان! خدا را اطاعت کنید و پیامبر را اطاعت کنید و اعمالتان را [با تخلف از دستورها خدا و پیامبر، شرک، نفاق، منت گذاری و ریا] باطل مکنید."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى كسانى كه ايمان آورده‌ايد، از خدا اطاعت كنيد و از پيامبر اطاعت كنيد و اعمال خويش را باطل مسازيد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى كسانى كه ايمان آورده‌ايد! اطاعت خدا كنيد و اطاعت رسول كنيد و اعمال خود را باطل نسازيد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى كسانى كه ايمان آورده‌ايد، خدا را اطاعت كنيد و از پيامبر [او نيز] اطاعت نماييد، و كرده‌هاى خود را تباه مكنيد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "ای اهل ایمان، خدا را اطاعت کنید و رسول او را اطاعت کنید و اعمال خود را ضایع و باطل نگردانید."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای مؤمنان! از خدا و پیغمبر اطاعت کنید، و کارهای خود را (با انجام معاصی) باطل مگردانید. [[«لا تُبْطِلُوا أَعْمَالَکُمْ»: کارهایتان را با انجام پلشتیها و زشتیها ضایع نگردانید.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای کسانی که ایمان آورده‌اید از خداوند و از پیامبر اطاعت کنید و اعمالتان را باطل مگردانید"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای کسانی که ایمان آورده‌اید! اطاعت کنید خدا را، و اطاعت کنید رسول (خدا) را، و اعمال خود را باطل نسازید!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای آنان که ایمان آوردید فرمان برید خدا را و فرمان برید پیمبر را و تباه نسازید کارهای خود را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى كسانى كه ايمان آورده‌ايد، خداى را فرمان بريد و پيامبر را فرمان بريد و كارهاتان را [به شك و نفاق و ريا و عجب‌] بيهوده و تباه مكنيد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای کسانی که ایمان آوردید! خدا را اطاعت کنید و پیامبرش را (نیز) اطاعت کنید و (با تخلفتان در این میان) اعمالتان را باطل مکنید."}, {"lang": "en", "name": "Ahmed Ali", "text": "O you who believe, obey God and the Prophet, and do not waste your deeds."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O People who Believe! Obey Allah and obey the Noble Messenger, and do not render your deeds void."}, {"lang": "en", "name": "A. J. Arberry", "text": "O believers, obey God, and obey the Messenger, and do not make your own works vain."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Ye who believe! obey Allah and obey the apostle, and render not Your works vain."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O you who believe! Obey Allah, and obey the Messenger (Muhammad SAW) and render not vain your deeds."}, {"lang": "en", "name": "Talal Itani", "text": "O you who believe! obey God, and obey the Messenger, and do not let your deeds go to waste."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Believers, obey Allah and obey the Messenger and do not cause your works to be nullified."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O you who believe! Obey Allah, and obey the Messenger and invalidate not your deeds."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O ye who believe! Obey Allah and obey the messenger, and render not your actions vain."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O you who have faith! Obey Allah and obey the Apostle, and do not render your works void."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believers, obey Allah and His Messenger and never let your labors go in vain!"}, {"lang": "en", "name": "Saheeh International", "text": "O you who have believed, obey Allah and obey the Messenger and do not invalidate your deeds."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Believers, obey God and the Messenger and do not invalidate your deeds."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O you who believe! obey Allah and obey the Apostle, and do not make your deeds of no effect."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo a<u>t</u>eeAAoo All<u>a</u>ha waa<u>t</u>eeAAoo a<b>l</b>rrasoola wal<u>a</u> tub<u>t</u>iloo aAAm<u>a</u>lakum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believers, obey God and obey the Messenger: do not let your deeds go to waste --"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O ye who believe! Obey Allah, and obey the messenger, and make not vain your deeds!"}]}, {"index": 4579, "local_index": 34, "part_type": "Verse", "path": "/books/quran:47:34", "text": "إِنَ‌ الَّذِينَ‌ کَفَرُوا وَ صَدُّوا عَنْ‌ سَبِيلِ‌ اللَّهِ‌ ثُمَ‌ مَاتُوا وَ هُمْ‌ کُفَّارٌ فَلَنْ‌ يَغْفِرَ اللَّهُ‌ لَهُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "مسلماً کسانی که کافر شدند و [مردم را] از راه خدا باز داشتند، سپس در حال کفر از دنیا رفتند، هرگز خدا آنان را نمی آمرزد."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا كسانى را كه كفر ورزيدند و مردم را از راه خدا باز داشتند و در كفر مردند، هرگز نخواهد آمرزيد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "محققا آنان كه كفر ورزيدند و مانع راه خدا شدند، سپس در حال كفر مردند، خدا هرگز آنها را نخواهد بخشيد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آنان كه كفر ورزيدند و مانع راه خدا شدند، سپس در حال كفر مردند، هرگز خدا از آنان درنخواهد گذشت."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آنان که کافر شدند و راه خدا را (به روی خلق) بستند و به حال کفر مردند دیگر ابدا خدا آنها را نخواهد بخشید."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کسانی که کافر گردند و مردمان را از راه خدا بازدارند و سپس بمیرند در حالی که کافر باشند، هرگز خداوند ایشان را نخواهد بخشید. [[«مَاتُوا وَ هُمْ کُفَّارٌ»: در حال کفر از جهان بروند و بمیرند. «لَن یَغْفِرَ اللهُ لَهُمْ»: خداوند ایشان را به سبب شرک و کفرشان هرگز نخواهد بخشید (نگا: نساء / 48).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بی‌گمان کسانی که کفرورزیده‌اند و [مردم را] از راه خدا باز داشته‌اند، سپس در حالی که کافر بوده‌اند در گذشته‌اند، هرگز خداوند آنان را نمی‌آمرزد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کسانی که کافر شدند و (مردم را) از راه خدا بازداشتند سپس در حال کفر از دنیا رفتند، خدا هرگز آنها را نخواهد بخشید."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "همانا آنان که کفر ورزیدند و بازداشتند از راه خدا پس مردند حالی که بودند کافران هرگز نیامرزد خدا آنان را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "همانا كسانى كه كافر شدند و از راه خدا بگرديدند- يا مردم را از راه خدا بازداشتند- سپس در حالى كه كافر بودند مردند، هرگز خداوند آنان را نخواهد آمرزيد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بی‌گمان آنان که کفر ورزیدند و از راه خدا جلوگیری کردند، سپس در حال کفر مردند، هرگز خدا از آنان درنخواهد گذشت."}, {"lang": "en", "name": "Ahmed Ali", "text": "Those who do not believe and obstruct others from the way of God, and die disbelieving, will not be pardoned by God."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Indeed those who disbelieved and prevented others from Allah’s way, and then died as disbelievers – so Allah will never forgive them."}, {"lang": "en", "name": "A. J. Arberry", "text": "Those who disbelieve and bar from God's way and then die disbelieving, them God will not forgive."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Verily those who disbelieve and hinder others from the way of Allah and then die as infidels, Allah shall by no means forgive them."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Verily, those who disbelieve, and hinder (men) from the Path of Allah (i.e. Islam); then die while they are disbelievers, Allah will not forgive them."}, {"lang": "en", "name": "Talal Itani", "text": "Those who disbelieve, and hinder from God’s path, and then die as disbelievers—God will not forgive them."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Verily Allah shall not forgive those who disbelieved and barred others from Allah's Way and clung to their unbelief until their death."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Verily, those who disbelieved and obstructed others from the path of Allah and then died as disbelievers -- never will Allah not forgive them."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Lo! those who disbelieve and turn from the way of Allah and then die disbelievers, Allah surely will not pardon them."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Indeed those who are faithless and bar from the way of Allah and then die faithless, Allah will never forgive them."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "As for those who disbelieve and bar (others) from the Path of Allah and then die as unbelievers? Allah will not forgive them."}, {"lang": "en", "name": "Saheeh International", "text": "Indeed, those who disbelieved and averted [people] from the path of Allah and then died while they were disbelievers - never will Allah forgive them."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God will never forgive the disbelievers who prevent others from the way of God and who die as disbelievers."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Surely those who disbelieve and turn away from Allah's way, then they die while they are unbelievers, Allah will by no means forgive them."}, {"lang": "en", "name": "English Transliteration", "text": "Inna alla<u>th</u>eena kafaroo wa<u>s</u>addoo AAan sabeeli All<u>a</u>hi thumma m<u>a</u>too wahum kuff<u>a</u>run falan yaghfira All<u>a</u>hu lahum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "surely those who reject the truth and bar others from the path of God, then die as deniers of the truth, will not be granted forgiveness by God."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Those who reject Allah, and hinder (men) from the Path of Allah, then die rejecting Allah,- Allah will not forgive them."}]}, {"index": 4580, "local_index": 35, "part_type": "Verse", "path": "/books/quran:47:35", "text": "فَلاَ تَهِنُوا وَ تَدْعُوا إِلَى‌ السَّلْمِ‌ وَ أَنْتُمُ‌ الْأَعْلَوْنَ‌ وَ اللَّهُ‌ مَعَکُمْ‌ وَ لَنْ‌ يَتِرَکُمْ‌ أَعْمَالَکُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "پس [با توجه به یاری و کارسازی خدا] سست نشوید و [کافران و مشرکان را] به آشتی و صلحی [که برای شما خفّت بار است] دعوت نکنید، در حالی که شما برتر هستید و خدا با شماست و هرگز از [ثواب و پاداش] اعمالتان نمی کاهد."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "سستى نورزيد تا دعوت به مصالحه كنيد. شما برتر هستيد و خدا با شماست و از پاداشهايتان نخواهد كاست."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "پس سست نشويد و [كافران را] به آشتى مخوانيد و شما برتريد و خدا با شماست و كارها [و تلاش‌] هاى شما را ناقص نخواهد گذاشت [و پيروزتان خواهد كرد]"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "پس سستى نورزيد و [كافران را] به آشتى مخوانيد [كه‌] شما برتريد و خدا با شماست و از [ارزش‌] كارهايتان هرگز نخواهد كاست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "پس (شما ای اهل ایمان در کار دین) سستی روا مدارید و (از ترس جنگ، کافران را) دعوت به صلح مکنید، که شما غالب و بلند مقام‌تر خواهید بود و خدا با شماست و از (ثواب) اعمال شما هیچ نمی‌کاهد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "سست مشوید، و (کافران را) به صلح مخوانید، چرا که شما برترید و خدا با شما است، و هرگز از (اجر و ثواب) اعمالتان نمی‌کاهد. [[«السَّلْمِ»: صلح. «تَدْعُوا إِلَی السَّلْمِ»: از کافران طلب صلح مکنید و ایشان را به صلح مخوانید. (تَدْعُوا) مجزوم و عطف بر (لاتَهِنُوا) می‌باشد. در اصل چنین است. لا تَهِنُوا وَ لا تَدْعُوا إِلَی السَّلْمِ. «الأعْلَوْنَ»: برتران. چیرگان. «لَن یَتِرَکُمْ»: از شما نمی‌کاهد. از ماده (وتر). این آیه مخالف با آیه 61 سوره انفال نیست که می‌فرماید: وَ إِن جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَهَا. چرا که مراد از آیه سوره محمد، درخواست صلح بی‌هنگام و بیجا از سوی مسلمانان است در زمانی که همه عوامل پیروزی در دست ایشان است، و مراد از آیه سوره انفال درخواست صلح از طرف دشمنان است و صلحی در میان است که منافع مسلمانان را در حال یا در آینده تأمین می‌کند. «وَ أَنتُمُ الأعْلَوْنَ»: در حالی که شما برتر و چیره‌اید، و خدا با شما است و هرگز از اجر و پاداش کارهایتان نمی‌کاهد. یا این که: سستی نکنید تا مجبور شوید دعوت به مصالحه کنید. شما برتر هستید و خدا با شما است و از پاداشهایتان نمی‌کاهد.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "پس سستی‌مورزید و از در صلح و سازش در نیایید که شما برتر و [چیره‌]اید و خداوند با شماست و [پاداش‌] اعمال شما را نمی‌کاهد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "پس هرگز سست نشوید و (دشمنان را) به صلح (ذلّت‌بار) دعوت نکنید در حالی که شما برترید، و خداوند با شماست و چیزی از (ثواب) اعمالتان را کم نمی‌کند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "پس زبون (سست) نشوید که خوانید بسوی آشتی و شمائید سرافرازان (چیره‌گان) و خدا با شما است و هرگز نکاهد از شما کارهای شما را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "پس سستى مكنيد و [كافران را] به آشتى مخوانيد و حال آنكه شما برتريد، و خدا با شماست و هرگز از [پاداش‌] كردار شما نخواهد كاست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس سستی نورزید حال آنکه (کافران را) به آشتی می‌خوانید، با آنکه شما (از آنان) برترید. و خدا با شماست و (ارزش) کارهایتان را هرگز نخواهد کاست."}, {"lang": "en", "name": "Ahmed Ali", "text": "So do not become weak-kneed and sue for peace, for you will have the upper hand as God is with you and will not overlook your deeds."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Therefore do not relax, nor call towards truce by yourself; and it is you who will dominate; and Allah is with you, and He will never cause a loss in your deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "So do not faint and call for peace; you shall be the upper ones, and God is with you, and will not deprive you of your works."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Wherefore faint not, nor cry out for peace; and ye shall be triumphant. And Allah is with you, and He will not defraud you of your works."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "So be not weak and ask not for peace (from the enemies of Islam), while you are having the upper hand. Allah is with you, and will never decrease the reward of your good deeds."}, {"lang": "en", "name": "Talal Itani", "text": "So do not waver and call for peace while you have the upper hand. God is with you, and He will not waste your efforts."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "So, be not faint-hearted and do not cry for peace. You shall prevail. Allah is with you and will not bring your works to nought."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "So do not lose heart and beg for peace while you are superior. Allah is with you and He will never deprive you of (the reward of) your deeds."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "So do not falter and cry out for peace when ye (will be) the uppermost, and Allah is with you, and He will not grudge (the reward of) your actions."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "So do not slacken and [do not] call for peace when you have the upper hand and Allah is with you, and He will not stint [the reward of] your works."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Therefore, do not be weakened and call out for peace, you shall be the upper ones, and Allah is with you and will not deprive you of your labors."}, {"lang": "en", "name": "Saheeh International", "text": "So do not weaken and call for peace while you are superior; and Allah is with you and will never deprive you of [the reward of] your deeds."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Do not be weak hearted and do not appeal for an (unjust) settlement; you have the upper hand. God is with you and He will never reduce the reward for your deeds."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And be not slack so as to cry for peace and you have the upper hand, and Allah is with you, and He will not bring your deeds to naught."}, {"lang": "en", "name": "English Transliteration", "text": "Fal<u>a</u> tahinoo watadAAoo il<u>a</u> a<b>l</b>ssalmi waantumu alaAAlawna wa<b>A</b>ll<u>a</u>hu maAAakum walan yatirakum aAAm<u>a</u>lakum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "So do not lose heart or appeal for peace when you have gained the upper hand. God is with you and will never let your works go to waste."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Be not weary and faint-hearted, crying for peace, when ye should be uppermost: for Allah is with you, and will never put you in loss for your (good) deeds."}]}, {"index": 4581, "local_index": 36, "part_type": "Verse", "path": "/books/quran:47:36", "text": "إِنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ‌ وَ لَهْوٌ وَ إِنْ‌ تُؤْمِنُوا وَ تَتَّقُوا يُؤْتِکُمْ‌ أُجُورَکُمْ‌ وَ لاَ يَسْأَلْکُمْ‌ أَمْوَالَکُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "زندگی دنیا فقط بازی و سرگرمی است، اگر ایمان بیاورید و پرهیزکاری کنید، خدا پاداش هایتان را می دهد و از شما نمی خواهد [که] اموالتان را [در راه خدا انفاق کنید؛]"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "جز اين نيست كه زندگى اينجهانى بازيچه و بيهودگى است. و اگر ايمان بياوريد و پرهيزگارى كنيد خدا پاداشهايتان را خواهد داد، و از شما اموالتان را نمى‌طلبد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "زندگى دنيا جز بازيچه و بيهودگى نيست، و اگر ايمان بياوريد و تقوا پيشه كنيد [خدا] پاداش شما را مى‌دهد و اموالتان را [به عوض‌] نمى‌خواهد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "زندگى اين دنيا لهو و لعبى بيش نيست، و اگر ايمان بياوريد و پروا بداريد [خدا] پاداش شما را مى‌دهد و اموالتان را [در عوض‌] نمى‌خواهد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "البته زندگانی دنیا به جز بازیچه و هوسرانی نیست و اگر ایمان آرید و پرهیزکار شوید پاداش اعمال شما را خواهد داد و از اموال شما چیزی (مزد هدایت) نمی‌خواهد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "زندگی دنیا بازی و سرگرمی بیش نیست، و اگر ایمان بیاورید و پرهیزگاری کنید، خداوند پاداش شما را (به نحو کامل) می‌دهد و دارائی شما را هم نمی‌خواهد. [[«لَعِبٌ وَ لَهْوٌ»: (نگا: انعام / 32 و 70، عنکبوت / 64). «لا یَسْأَلْکُمْ أَمْوَالَکُمْ»: خداوند بی‌نیاز است و اموال شما را از شما درخواست نمی‌کند. اموالی که به صورت زکات و صدقه می‌دهید و یا در راه جهاد خرج می‌کنید و به نام حقوق شرعی دیگر مصرف می‌نمائید، برای دفاع از امنیت و استقلال کشور اسلامی و برای کمک به مستمندان همنوع خود و تأمین نیازمندیها و آبادانی مملکت خودتان بوده و سود چنین اموالی عائد خودتان می‌گردد.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "همانا زندگانی دنیا [مانند] بازیچه و سرگرمی است و اگر ایمان داشته باشید و پروا و پرهیز بورزید، پاداشهایتان را به شما می‌پردازد، و [همه‌] اموال شما را از شما نمی‌گیرد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "زندگی دنیا تنها بازی و سرگرمی است؛ و اگر ایمان آورید و تقوا پیشه کنید، پاداشهای شما را می‌دهد و اموال شما را نمی‌طلبد،"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "جز این نیست که زندگانی دنیا بازی و هوسرانی است و اگر ایمان آرید و پرهیزکاری کنید بپردازد به شما مزدهای شما را و نپرسد از شما (نخواهد) خواسته‌های شما را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "همانا زندگانى اين جهان بازيچه و سرگرمى است، و اگر ايمان داشته باشيد و پرهيزگارى كنيد مزدتان را خواهد داد و مالهاتان را نخواهد خواست"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "زندگی این دنیا تنها بازی و بازدارنده‌ا‌ی (از حق) است و اگر ایمان بیاورید و (خدا را) پروا بدارید، خدا پاداش‌هاتان را می‌دهد و اموالتان را (در عوض) از شما نمی‌خواهد."}, {"lang": "en", "name": "Ahmed Ali", "text": "Verily the life of this world is no more than a sport and frivolity. If you believe and fear God, he will give you your reward, and will not ask for your possessions."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "The worldly life is just a sport and pastime; and if you accept faith and be pious, He will bestow your rewards to you, and not at all ask you for your wealth."}, {"lang": "en", "name": "A. J. Arberry", "text": "The present life is naught but a sport and a diversion; and if you believe and are godfearing, He will give you your wages, and will not ask of you your goods."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "The life of the world is but a sport and a pastime. And if ye believe and fear, He will give you your hire, and will not require of you your substance."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "The life of this world is but play and pastime, but if you believe (in the Oneness of Allah Islamic Monotheism), and fear Allah, and avoid evil, He will grant you your wages, and will not ask you your wealth."}, {"lang": "en", "name": "Talal Itani", "text": "The life of this word is nothing but play and pastime. But if you have faith and lead a righteous life, He will grant you your rewards, and He will not ask you for your possessions."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "The life of this world is but sport and amusement. If you believe and are God-fearing, He will grant you your reward, and will not ask you for your possessions."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "This worldly life is only amusement and diversion. And if you believe and have Taqwa of Allah, He will grant you your rewards, and will not ask from you (to sacrifice all of) your possessions."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "The life of the world is but a sport and a pastime. And if ye believe and ward off (evil). He will give you your wages, and will not ask of you your wordly wealth."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "The life of the world is just play and diversion, but if you are faithful and Godwary, He will give you your rewards, and will not ask your wealth [in return] from you."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "The life of this world is but play and an amusement. If you believe and are cautious, He will give you your wage, and will not ask for your possessions."}, {"lang": "en", "name": "Saheeh International", "text": "[This] worldly life is only amusement and diversion. And if you believe and fear Allah, He will give you your rewards and not ask you for your properties."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "The worldly life is only a childish game. If you have faith and piety, you will receive your rewards and God will not ask you to pay for them."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "The life of this world is only idle sport and play, and if you believe and guard (against evil) He will give you your rewards, and will not ask of you your possessions."}, {"lang": "en", "name": "English Transliteration", "text": "Innam<u>a</u> al<u>h</u>ay<u>a</u>tu a<b>l</b>dduny<u>a</u> laAAibun walahwun wain tuminoo watattaqoo yutikum ojoorakum wal<u>a</u> yasalkum amw<u>a</u>lakum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "The life of this world is only a game, a pastime, but if you believe and are mindful of God, He will recompense you and will not ask you for your wealth."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "The life of this world is but play and amusement: and if ye believe and guard against Evil, He will grant you your recompense, and will not ask you (to give up) your possessions."}]}, {"index": 4582, "local_index": 37, "part_type": "Verse", "path": "/books/quran:47:37", "text": "إِنْ‌ يَسْأَلْکُمُوهَا فَيُحْفِکُمْ‌ تَبْخَلُوا وَ يُخْرِجْ‌ أَضْغَانَکُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "اگر همه اموال شما را بخواهد و بر شما اصرار ورزد، بخل می کنید و [سبب می شود که] کینه های درونی شما را بیرون بریزد [و آن زمان است که گمراه می شوید.]"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اگر از شما مالى طلبد و به اصرار هم طلبد، آنگاه بخل مى‌ورزيد و كينه‌هاى نهفته‌تان را آشكار مى‌سازد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اگر از شما مالى طلب كند و اصرار نمايد، بخل مى‌ورزيد و كينه‌هاى شما را برملا مى‌سازد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اگر [اموال‌] شما را بخواهد و به اصرار از شما طلب كند بخل مى‌ورزيد، و كينه‌هاى شما را برملا مى‌كند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "اگر از مال شما خدا چیزی به اصرار هم بخواهد باز بخل می‌ورزید و کینه و خبث درونی شما را آشکار می‌سازد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "اگر خدا از شما اموالتان را درخواست کند، و حتّی اصرار هم بورزد، شما (به خاطر دلبستگی شدید و مال‌دوستی سرشتی انسان) بخل نشان خواهید داد و تنگچشمی‌خواهید کرد، و باعث بروز کینه‌هایتان می‌شود. (پس خدا که شما را می‌شناسد، چنین کاری را نمی‌کند). [[«یُحْفِکُمْ»: از شما اصرار بکند و مصرانه بخواهد. از مصدر (إحفاء) به معنی إلحاح و إصرار. «یُخْرِجْ أَضْغَانَکُمْ»: اشاره به دلبستگی شدید بسیاری از مردم به مسائل مالی است، و در حقیقت یک نوع ملامت و سرزنش آنان، و در عین حال تشویق به ترک این وابستگی است. همچنین بیانگر این واقعیت که دوستی اموال و عشق به دارائی، خمیره ذاتی و یک صفت سرشتی انسان است، تا آنجا که اگر خدا نیز از بسیاری از انسانها اموالشان را مطالبه کند، خشم و کینه او را به دل می‌گیرند!]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "اگر آن را از شما بطلبد و بر شما سخت بگیرد [چه بسا] بخل ورزید و ناهمدلی شما را آشکار سازد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "چرا که هر گاه اموال شما را مطالبه کند و حتّی اصرار نماید، بخل می‌ورزید؛ و کینه و خشم شما را آشکار می‌سازد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "اگر بپرسد آنها را از شما پس ایستادگی کند در خواستن (سختی ورزد) خودداری کنید و برون آرد (آشکار کند) کینه‌های شما را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اگر آن را از شما بخواهد و در خواستن پافشارى نمايد، آنگاه بخل مى‌ورزيد و [به سبب مالدوستى‌تان‌] كينه‌هاى شما را آشكار مى‌سازد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "اگر اموال شما را بخواهد، پس به اصرار و اجبار از شما طلب کند، بخل می‌ورزید. و (بدین ترتیب) کینه‌های شدیدتان را برملا می‌کند."}, {"lang": "en", "name": "Ahmed Ali", "text": "If He asks for all you possess and insist upon it, you will become niggardly, and it will bring out your malevolence."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Were He to ask it from you, and ask in plenty, you would be miserly, and the miserliness would expose the filth within your hearts."}, {"lang": "en", "name": "A. J. Arberry", "text": "If He asks you for them, and presses you, you are niggardly, and He brings to light your rancour."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "If He required it of you and importuned you, ye would be niggardly, and He will bring to light your secret malevolence."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "If He were to ask you of it, and press you, you would covetously withhold, and He will bring out all your (secret) ill-wills."}, {"lang": "en", "name": "Talal Itani", "text": "Were He to ask you for it, and press you, you would become tightfisted, and He would expose your unwillingness."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "If He were to ask you for your possessions and press you (in that regard), you would have grown niggardly, and Allah would have brought your failings to light."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "If He would demand of you all of it and urge you, you would withhold. And He will expose your (secret) ill--wills."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "If He should ask it of you and importune you, ye would hoard it, and He would bring to light your (secret) hates."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Should He ask it from you and press you, you will be stingy, and He will expose your spite."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "If He asked you for them, and presses you, you would be mean and He would expose your anger."}, {"lang": "en", "name": "Saheeh International", "text": "If He should ask you for them and press you, you would withhold, and He would expose your unwillingness."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Should He ask for your possessions you would be niggardly as it would be hard for you to give. Thus, He would make your malice become public."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "If He should ask you for it and urge you, you will be niggardly, and He will bring forth your malice."}, {"lang": "en", "name": "English Transliteration", "text": "In yasalkumooh<u>a</u> fayu<u>h</u>fikum tabkhaloo wayukhrij a<u>d</u>gh<u>a</u>nakum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "If He were to ask it [wealth] of you, and continued to press you, you would be niggardly, and this would show your ill-will."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "If He were to ask you for all of them, and press you, ye would covetously withhold, and He would bring out all your ill-feeling."}]}, {"index": 4583, "local_index": 38, "part_type": "Verse", "path": "/books/quran:47:38", "text": "هَا أَنْتُمْ‌ هٰؤُلاَءِ تُدْعَوْنَ‌ لِتُنْفِقُوا فِي‌ سَبِيلِ‌ اللَّهِ‌ فَمِنْکُمْ‌ مَنْ‌ يَبْخَلُ‌ وَ مَنْ‌ يَبْخَلْ‌ فَإِنَّمَا يَبْخَلُ‌ عَنْ‌ نَفْسِهِ‌ وَ اللَّهُ‌ الْغَنِيُ‌ وَ أَنْتُمُ‌ الْفُقَرَاءُ وَ إِنْ‌ تَتَوَلَّوْا يَسْتَبْدِلْ‌ قَوْماً غَيْرَکُمْ‌ ثُمَ‌ لاَ يَکُونُوا أَمْثَالَکُمْ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آگاه باشید! شما همان مردمی هستید که برای انفاق در راه خدا دعوت می شوید، پس برخی از شما بخل می ورزند، و هر که بخل پیشه کند، فقط نسبت به [سعادت و خوشبختی] خود بخیل است، و خدا [از انفاق و صدقات شما] بی نیاز است، و شمایید که نیازمند هستید؛ و اگر [از فرمان های او] روی بگردانید به جای شما گروه دیگری را می آورد که مانند شما [روی گردان، سست عقیده و بخیل] نخواهند بود."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آگاه باشيد كه شما را دعوت مى‌كنند تا در راه خدا انفاق كنيد. بعضى از شما بخل مى‌ورزند؛ و هر كس كه بخل ورزد، در حق خود بخل ورزيده است. زيرا خدا بى‌نياز است و شما نيازمندانيد. و اگر روى برتابيد، به جاى شما مردمى ديگر آرد كه هرگز همسان شما نباشند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آگاه باشيد! اين شماها هستيد كه براى انفاق در راه خدا دعوت مى‌شويد، سپس برخى از شما بخل مى‌ورزد. و هر كس بخل ورزد، فقط در حق خود بخل ورزيده و [گر نه‌] خدا بى‌نياز است و شما نيازمندانيد. و اگر روى برتابيد، خداوند قومى غير از شما را جانشين مى‌كند كه آنه"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "شما همان [مردمى‌] هستيد كه براى انفاق در راه خدا فرا خوانده شده‌ايد. پس برخى از شما بخل مى‌ورزند، و هر كس بخل ورزد تنها به زيان خود بخل ورزيده، و [گرنه‌] خدا بى‌نياز است و شما نيازمنديد؛ و اگر روى برتابيد [خدا] جاى شما را به مردمى غير از شما خواهد داد كه مانند شما نخواهند بود."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آری شما همان مردمید که برای انفاق در راه (تبلیغ دین) خدا دعوت می‌شوید باز بعضی از شما بخل می‌ورزند، و هر که بخل کند بر ضرر خود اوست و گرنه خدا (از خلق) بی نیاز است و شما فقیر و نیازمندید. و اگر شما روی بگردانید خدا قومی غیر شما که مانند شما (بخیل) نیستند (بلکه بسی از شما بهتر و فداکارترند) به جای شما پدید آرد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آگاه باشید که شما (از سوی آفریدگارتان) دعوت به انفاق در راه خدا می‌شوید. بعضی از شما بخل می‌ورزند. هر کس هم بخل بورزد، در حق خود بخل می‌ورزد (و زیان آن متوجّه خودش می‌گردد). زیرا خدا بی‌نیاز است و شما نیازمندید. اگر شما (از فرمان خدا سرپیچی کنید و) روی برتابید، مردمان دیگری را جایگزین شما می‌گرداند (و این مأموریّت را به گروه دیگری می‌سپارد) که هرگز همسان شما نخواهند بود (و از ایثار و فداکاری و بذل جان و مال خودداری نخواهند کرد و از فرمان یزدان روی‌گردان نخواهند شد). [[«هَآ أَنتُمْ هؤُلآءِ»: (نگا: آل‌عمران / 66 و 119، نساء / 109). «عَن نَّفْسِهِ»: در حق خود. «أَمْثَالَکُمْ»: همچون شما. همسان شما. (نگا: معارج / 41).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "همین شما هستید که از شما خواسته می‌شود که در راه خدا انفاق کنید، آنگاه بعضی از شما هستند که بخل می‌ورزند، و هر کس بخل ورزد همانا از خود دریغ می‌ورزد، و خداوند بی‌نیاز است و شما نیازمندانید، و اگر روی بگردانید قومی غیر شما را جانشین شما می‌سازد، آنگاه آنان مانند شما نخواهند بود"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آری، شما همان گروهی هستید که برای انفاق در راه خدا دعوت می‌شوید، بعضی از شما بخل می‌ورزند؛ و هر کس بخل ورزد، نسبت به خود بخل کرده است؛ و خداوند بی‌نیاز است و شما همه نیازمندید؛ و هرگاه سرپیچی کنید، خداوند گروه دیگری را جای شما می‌آورد پس آنها مانند شما نخواهند بود (و سخاوتمندانه در راه خدا انفاق می‌کنند)."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "اینک شمائید که خوانده می‌شوید به انفاق کردن در راه خدا پس از شما است آنکه خودداری کند (بخل ورزد) و هر که خودداری کند جز این نیست که بر جان خویش خودداری کند و خدا بی‌نیاز است و شمائید نیازمندان و اگر پشت کنید بگیرد بجای شما گروهی را جز شما پس نباشند مانندگان شما"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "هان شماييد كه خوانده مى‌شويد تا در راه خدا انفاق كنيد، ولى از شما كس هست كه بخل مى‌ورزد، و هر كه بخل ورزد جز اين نيست كه با خويشتن بخل مى‌ورزد، و خدا بى‌نياز است و شما نيازمنديد، و اگر روى بگردانيد گروهى ديگر جز شما را به جاى شما آرد كه همچون شما- سست ايمان و بخيل- نباشند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان! شما همان (مردمی) هستید (که) برای انفاق در راه خدا فرا خوانده می‌شوید. پس برخی از شما بخل می‌ورزد و هر کس بخل ورزد، تنها به زیان خود بخل می‌ورزد. و خدا بی‌نیاز است و شما نیازمندید. و اگر روی برتابید، خدا جای شما را به مردمی غیر از شما خواهد داد (و) سپس همانندتان نیستند."}, {"lang": "en", "name": "Ahmed Ali", "text": "Beware! You are called to spend in the way of God, yet some among you close their fists. But he who is niggardly is so for his own self: God is above need, and it is you who are needy. If you turn away then God will bring other people in your place who, moreover, will not be like you."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Yes, undoubtedly it is you who are being called, that you may spend in Allah’s way; so some among you act miserly; and whoever is miserly, is being a miser upon himself; and Allah is the Independent (Wealthy – Not requiring anything), whereas you all are needy; and if you renege, He will replace you with other people – and they will not be like you."}, {"lang": "en", "name": "A. J. Arberry", "text": "Ha, there you are; you are called upon to expend in God's way, and some of you are niggardly. Whoso is niggardly is niggardly only to his own soul. God is the All-sufficient; you are the needy ones. If you turn away, He will substitute another people instead of you, then they will not be your likes."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Behold! ye are those who are called to expend in the way of Allah, then there are of you some who are niggardly. And whosoever is niggardly is niggardly only to himself. And Allah is Self-sufficient, and ye are the needy. And if ye turn away, He will substitute for you another people, and then they will not be the likes of you."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Behold! You are those who are called to spend in the Cause of Allah, yet among you are some who are niggardly. And whoever is niggardly, it is only at the expense of his ownself. But Allah is Rich (Free of all wants), and you (mankind) are poor. And if you turn away (from Islam and the obedience of Allah), He will exchange you for some other people, and they will not be your likes."}, {"lang": "en", "name": "Talal Itani", "text": "Here you are, being called to spend in the cause of God. Among you are those who withhold; but whoever withholds is withholding against his own soul. God is the Rich, while you are the needy. And if you turn away, He will replace you with another people, and they will not be like you."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Behold, you are those who are called upon to spend in Allah's Way, but some of you are niggardly. Whoever is niggardly is in fact niggardly to himself. For Allah is All-Sufficient, whereas it is you who are in need of Him. If you turn away, He will replace you by a people other than you, and they will not be like you."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Here you are now invited to spend in Allah's cause; but among you are those who withhold (stingily). And whoever acts stingily is but stingy toward himself. For Allah is indeed free of needs, while you are the needy. And if you turn away, He will replace you with other people; then they will not be like you."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Lo! ye are those who are called to spend in the way of Allah, yet among you there are some who hoard. And as for him who hoardeth, he hoardeth only from his soul. And Allah is the Rich, and ye are the poor. And if ye turn away He will exchange you for some other folk, and they will not be the likes of you."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Ah! There you are, being invited to spend in the way of Allah; yet among you there are those who are stingy; and whoever is stingy is stingy only to himself. Allah is the All-sufficient, and you are all-needy, and if you turn away He will replace you with another people, and they will not be like you."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "There you are! You are called upon to spend in the Way of Allah. Some of you are mean; yet whoever is mean is mean only to his own soul. Allah is theRich and you are the poor. If you turn away, He will replace you with another nation, and they will not be like you."}, {"lang": "en", "name": "Saheeh International", "text": "Here you are - those invited to spend in the cause of Allah - but among you are those who withhold [out of greed]. And whoever withholds only withholds [benefit] from himself; and Allah is the Free of need, while you are the needy. And if you turn away, He will replace you with another people; then they will not be the likes of you."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "It is you who are asked to spend for the cause of God, but some of you behave in a niggardly way. Whoever behaves miserly does so against his own soul. God is Self-sufficient and you are poor. If you were to turn away from Him, He would just replace you with another people, who will not be like you."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Behold! you are those who are called upon to spend in Allah's way, but among you are those who are niggardly, and whoever is niggardly is niggardly against his own soul; and Allah is Self-sufficient and you have need (of Him), and if you turn back He will bring in your place another people, then they will not be like you."}, {"lang": "en", "name": "English Transliteration", "text": "H<u>a</u>antum h<u>a</u>ol<u>a</u>i tudAAawna litunfiqoo fee sabeeli All<u>a</u>hi faminkum man yabkhalu waman yabkhal fainnam<u>a</u> yabkhalu AAan nafsihi wa<b>A</b>ll<u>a</u>hu alghaniyyu waantumu alfuqar<u>a</u>o wain tatawallaw yastabdil qawman ghayrakum thumma l<u>a</u> yakoonoo amth<u>a</u>lakum"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Behold! You are those who are called upon to spend for God's cause, but among you are those who are niggardly, and whoever stints does so against his own self. Indeed, God is self-sufficient, but you stand in need [of Him], and if you turn back, He will bring in your place another people, who will not be like you."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Behold, ye are those invited to spend (of your substance) in the Way of Allah: But among you are some that are niggardly. But any who are niggardly are so at the expense of their own souls. But Allah is free of all wants, and it is ye that are needy. If ye turn back (from the Path), He will substitute in your stead another people; then they would not be like you!"}]}]}, "index": "quran:47", "kind": "verse_list"}