{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 48"
        },
        "path": "/books/quran:48",
        "titles": {
          "ar": "الفتح",
          "en": "The Victory",
          "ent": "Al-Fath"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 48,
    "local_index": 48,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 49"
        },
        "path": "/books/quran:49",
        "titles": {
          "ar": "الحجرات",
          "en": "The Inner Apartments",
          "ent": "Al-Hujuraat"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 47"
        },
        "path": "/books/quran:47",
        "titles": {
          "ar": "محمد",
          "en": "Muhammad",
          "ent": "Muhammad"
        }
      },
      "up": {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      }
    },
    "order": 111,
    "part_type": "Chapter",
    "path": "/books/quran:48",
    "reveal_type": "Medinan",
    "rukus": 4,
    "titles": {
      "ar": "الفتح",
      "en": "The Victory",
      "ent": "Al-Fath"
    },
    "verse_count": 29,
    "verse_start_index": 4583,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 4584,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:48:1",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:117:5"
          ]
        },
        "text": [
          "إِنَّا فَتَحْنَا لَکَ‌ فَتْحاً مُبِيناً"
        ],
        "translations": {
          "en.ahmedali": [
            "WE HAVE GIVEN you a splendent victory"
          ],
          "en.ahmedraza": [
            "We have indeed, for your sake (O dear Prophet Mohammed – peace and blessings be upon him), bestowed a clear victory."
          ],
          "en.arberry": [
            "Surely We have given thee a manifest victory,"
          ],
          "en.daryabadi": [
            "Verily We! a victory We have given thee, a manifest victory."
          ],
          "en.hilali": [
            "Verily, We have given you (O Muhammad SAW) a manifest victory."
          ],
          "en.itani": [
            "We have granted you a conspicuous victory."
          ],
          "en.maududi": [
            "(O Prophet), surely We have granted you a clear victory"
          ],
          "en.mubarakpuri": [
            "Verily, We have given you a manifest victory."
          ],
          "en.pickthall": [
            "Lo! We have given thee (O Muhammad) a signal victory,"
          ],
          "en.qarai": [
            "Indeed We have inaugurated for you a clear victory,"
          ],
          "en.qaribullah": [
            "Indeed, We have opened for you (Prophet Muhammad) a clear opening,"
          ],
          "en.sahih": [
            "Indeed, We have given you, [O Muhammad], a clear conquest"
          ],
          "en.sarwar": [
            "We have granted to you, (Muhammad), a manifest victory,"
          ],
          "en.shakir": [
            "Surely We have given to you a clear victory"
          ],
          "en.transliteration": [
            "Inn<u>a</u> fata<u>h</u>n<u>a</u> laka fat<u>h</u>an mubeen<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Truly, We have granted you a clear victory"
          ],
          "en.yusufali": [
            "Verily We have granted thee a manifest Victory:"
          ],
          "fa.ansarian": [
            "به راستی ما برای تو پیروزی آشکاری فراهم آوردیم؛"
          ],
          "fa.ayati": [
            "ما براى تو پيروزى نمايانى را مقدر كرده‌ايم."
          ],
          "fa.bahrampour": [
            "حقا ما تو را پيروزى بخشيديم، پيروزى درخشانى"
          ],
          "fa.fooladvand": [
            "ما تو را پيروزى بخشيديم [چه‌] پيروزى درخشانى!"
          ],
          "fa.ghomshei": [
            "(ای رسول ما غم مدارکه) البته ما تو را به فتح آشکاری فیروز می‌گردانیم (که نه بس شهر مکّه بلکه شهر دلهای اهل عالم را فتح کنی)."
          ],
          "fa.khorramdel": [
            "ما برای تو فتح آشکاری را فراهم ساخته‌ایم. [[«فَتَحْنَا»: گشوده‌ایم و پیش آورده‌ایم. ذکر فعل به صورت ماضی، به خاطر تحقق یا قطعیت موضوع است. «فَتْحاً مُّبِیناً»: مراد صلح حدیبیه است که به خاطر خیرات و برکات و فتوحات مترتب بر آن، فتح آشکار نامیده شده است. یا مراد فتح مکه است که دو سال بعد از صلح حدیبیه بوقوع پیوست و انتشار اسلام و شکوه مسلمانان را بدنبال داشت.]]"
          ],
          "fa.khorramshahi": [
            "همانا گشایشی آشکار در کار تو پدید آوردیم‌"
          ],
          "fa.makarem": [
            "ما برای تو پیروزی آشکاری فراهم ساختیم!..."
          ],
          "fa.moezzi": [
            "همانا پیروزی دادیم پیروزی آشکار (یا بگشودیم برایت گشایشی آشکار)"
          ],
          "fa.mojtabavi": [
            "ما براى تو گشايش و پيروزى نمايانى را بگشوديم."
          ],
          "fa.sadeqi": [
            "ما به‌راستی برای تو گشایش و پیروزی بخشیدیم، (چه) پیروزی روشنگری."
          ]
        }
      },
      {
        "index": 4585,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:48:2",
        "text": [
          "لِيَغْفِرَ لَکَ‌ اللَّهُ‌ مَا تَقَدَّمَ‌ مِنْ‌ ذَنْبِکَ‌ وَ مَا تَأَخَّرَ وَ يُتِمَ‌ نِعْمَتَهُ‌ عَلَيْکَ‌ وَ يَهْدِيَکَ‌ صِرَاطاً مُسْتَقِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "That God may save you from earlier and subsequent blames, and complete His favours on you, and guide you on the straight path,"
          ],
          "en.ahmedraza": [
            "So that Allah may forgive, for your sake, the sins of those before you and those after you, and complete His favours upon you, and to show you the Straight Path."
          ],
          "en.arberry": [
            "that God may forgive thee thy former and thy latter sins, and complete His blessing upon thee, and guide thee on a straight path,"
          ],
          "en.daryabadi": [
            "That Allah may forgive thee that which hath preceded of thy fault and that which may come later, and may accomplish the more His favour on thee, and may keep thee guided on the straight path."
          ],
          "en.hilali": [
            "That Allah may forgive you your sins of the past and the future, and complete His Favour on you, and guide you on the Straight Path;"
          ],
          "en.itani": [
            "That God may forgive you your sin, past and to come, and complete His favors upon you, and guide you in a straight path."
          ],
          "en.maududi": [
            "so that Allah may forgive you your shortcomings, whether earlier or later, and may complete His favours upon you and guide you to the Straight Way,"
          ],
          "en.mubarakpuri": [
            "That Allah may forgive you your sins of the past and the future, and complete His favor on you, and guide you on the straight path,"
          ],
          "en.pickthall": [
            "That Allah may forgive thee of thy sin that which is past and that which is to come, and may perfect His favour unto thee, and may guide thee on a right path,"
          ],
          "en.qarai": [
            "that Allah may forgive you what is past of your sin and what is to come, and that He may perfect His blessing upon you and guide you on a straight path,"
          ],
          "en.qaribullah": [
            "that Allah forgives your past and future sins, and completes His Favor to you, and guides you on a Straight Path,"
          ],
          "en.sahih": [
            "That Allah may forgive for you what preceded of your sin and what will follow and complete His favor upon you and guide you to a straight path"
          ],
          "en.sarwar": [
            "so that God will redeem the sins (which the pagans think you have committed against them) in the past or (you will commit) in the future. He will complete His favors to you, guide you to the right path,"
          ],
          "en.shakir": [
            "That Allah may forgive your community their past faults and those to follow and complete His favor to you and keep you on a right way,"
          ],
          "en.transliteration": [
            "Liyaghfira laka All<u>a</u>hu m<u>a</u> taqaddama min <u>th</u>anbika wam<u>a</u> taakhkhara wayutimma niAAmatahu AAalayka wayahdiyaka <u>s</u>ir<u>at</u>an mustaqeem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "so that God may forgive you your past and future sins and complete His favour to you and guide you to a straight path,"
          ],
          "en.yusufali": [
            "That Allah may forgive thee thy faults of the past and those to follow; fulfil His favour to thee; and guide thee on the Straight Way;"
          ],
          "fa.ansarian": [
            "تا خدا [با این پیروزی آشکار] آنچه را [به وسیله دشمنان از توطئه ها و موانع و مشکلات در راه پیشرفت دعوتت به اسلام] در گذشته پیش آمده و آینده پیش خواهد آمد از میان بردارد، و نعمتش را بر تو کامل کند، و به راهی راست راهنمایی ات نماید؛"
          ],
          "fa.ayati": [
            "تا خدا گناه تو را آنچه پيش از اين بوده و آنچه پس از اين باشد براى تو بيامرزد و نعمت خود را بر تو تمام كند و تو را به صراط مستقيم راه نمايد."
          ],
          "fa.bahrampour": [
            "تا خدا گناه گذشته و اخيرت را [كه به تو نسبت مى‌دادند] برطرف سازد و نعمتش را بر تو تمام كند و تو را به راهى راست هدايت نمايد"
          ],
          "fa.fooladvand": [
            "تا خداوند از گناه گذشته و آينده تو درگذرد و نعمت خود را بر تو تمام گرداند و تو را به راهى راست هدايت كند."
          ],
          "fa.ghomshei": [
            "تا خدا از گناه گذشته و آینده تو در گذرد (مفسرین در این آیه گویند: مراد از گناه پیغمبر گناه او بود به عقیده مشرکان که دعوت او را به توحید خدا بزرگترین گناه او می‌شمردند و مقصود از گناه گذشته و آینده دعوت قبل از هجرت و بعد از هجرت بود) و نعمت خود را بر تو به حد کمال رساند و تو را به راه مستقیم (شرع اسلام به وحی خود) هدایت کند."
          ],
          "fa.khorramdel": [
            "هدف این بود که خداوند گناهان پیشین و پسین تو را ببخشاید، و نعمت خود را بر تو تمام نماید، و به راه راست هدایتت فرماید. [[«لِیَغْفِرَ لَکَ اللهُ مَا ...»: حرف لام برای تعلیل است. فتح، سبب غفران بحساب آمده است، چرا که فتح، جهاد است، و جهاد عبادت است، و عبادت موجب عفو و بخشش. در اصل فتح را خدا کرده است، و جائزه‌اش را به پیغمبرش داده است. مغفرت، تکمیل نعمت، هدایت، نصرت. «ذَنبِکَ»: (نگا: یوسف / 29، غافر / 55، محمد / 19).]]"
          ],
          "fa.khorramshahi": [
            "تا سرانجام خداوند گناه نخستین و اخیر [امت‌] تو را برای تو بیامرزد و نعمتش را بر تو به کمال برساند و تو را به راهی راست هدایت فرماید"
          ],
          "fa.makarem": [
            "تا خداوند گناهان گذشته و آینده‌ای را که به تو نسبت می‌دادند ببخشد (و حقّانیت تو را ثابت نموده) و نعمتش را بر تو تمام کند و به راه راست هدایتت فرماید؛"
          ],
          "fa.moezzi": [
            "تا بیامرزد برایت خدا آنچه را که پیشی گرفت از گناهت و آنچه را پس آمد و انجام رساند نعمتش را بر تو و رهبریت کند به راهی راست‌"
          ],
          "fa.mojtabavi": [
            "تا خدا گناه تو- كارهاى ناروايى كه مشركان و دشمنان درباره تو روا داشتند- را، آنچه در گذشته بوده و آنچه اكنون و سپس‌تر باشد، بيامرزد- بپوشاند و بزدايد- و نعمت خود را بر تو تمام كند و تو را راه راست بنمايد،"
          ],
          "fa.sadeqi": [
            "تا خدا پی‌آمد خطرناک دنیوی کار (رسالت)تو را - گذشته و آینده‌اش - را بپوشاند و نعمت خود را بر تو تمام گرداند و تو را به راهی راست هدایت کند."
          ]
        }
      },
      {
        "index": 4586,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:48:3",
        "text": [
          "وَ يَنْصُرَکَ‌ اللَّهُ‌ نَصْراً عَزِيزاً"
        ],
        "translations": {
          "en.ahmedali": [
            "And help you with surpassing help."
          ],
          "en.ahmedraza": [
            "And so that Allah may provide you a great help."
          ],
          "en.arberry": [
            "and that God may help thee with mighty help."
          ],
          "en.daryabadi": [
            "And that Allah may succour thee with a mighty succour."
          ],
          "en.hilali": [
            "And that Allah may help you with strong help."
          ],
          "en.itani": [
            "And help you with an unwavering support."
          ],
          "en.maududi": [
            "and that Allah may bestow upon you a mighty help."
          ],
          "en.mubarakpuri": [
            "And that Allah may help you with strong help."
          ],
          "en.pickthall": [
            "And that Allah may help thee with strong help -"
          ],
          "en.qarai": [
            "and Allah will help you with a mighty help."
          ],
          "en.qaribullah": [
            "and that Allah helps you with a mighty help."
          ],
          "en.sahih": [
            "And [that] Allah may aid you with a mighty victory."
          ],
          "en.sarwar": [
            "and grant you a majestic triumph."
          ],
          "en.shakir": [
            "And that Allah might help you with a mighty help."
          ],
          "en.transliteration": [
            "Wayan<u>s</u>uraka All<u>a</u>hu na<u>s</u>ran AAazeez<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and so that God might bestow on you His mighty help."
          ],
          "en.yusufali": [
            "And that Allah may help thee with powerful help."
          ],
          "fa.ansarian": [
            "و خدا تو را به نصرتی توانمندانه و شکست ناپذیر یاری دهد."
          ],
          "fa.ayati": [
            "و خدا ياريت كند يارى‌كردنى پيروزمندانه."
          ],
          "fa.bahrampour": [
            "و تو را به نصرتى بى‌شكست يارى دهد"
          ],
          "fa.fooladvand": [
            "و تو را به نصرتى ارجمند يارى نمايد."
          ],
          "fa.ghomshei": [
            "و خدا تو را به نصرتی با عزت و کرامت یاری کند."
          ],
          "fa.khorramdel": [
            "و پیروزی نادر و نایابی بهره‌ی تو گرداند. [[«عَزِیزاً»: چیزی که نادر است و کمتر به دست می‌آید. نیرومند. مایه عزت. بدون شکست.]]"
          ],
          "fa.khorramshahi": [
            "و خداوند تو را به نصرتی پیروزمندانه یاری دهد"
          ],
          "fa.makarem": [
            "و پیروزی شکست‌ناپذیری نصیب تو کند."
          ],
          "fa.moezzi": [
            "و یاریت کند خدا یاریی سرفراز (عزّتمند)"
          ],
          "fa.mojtabavi": [
            "و خداى تو را يارى كند يارى‌كردنى توانمندانه- كه در آن عزت و پيروزى باشد-."
          ],
          "fa.sadeqi": [
            "و خدا تو را به نصرتی ارجمند یاری نماید."
          ]
        }
      },
      {
        "index": 4587,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:48:4",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:2:1:10:1",
            "/books/al-kafi:2:1:10:5",
            "/books/al-kafi:2:1:10:4"
          ]
        },
        "text": [
          "هُوَ الَّذِي‌ أَنْزَلَ‌ السَّکِينَةَ فِي‌ قُلُوبِ‌ الْمُؤْمِنِينَ‌ لِيَزْدَادُوا إِيمَاناً مَعَ‌ إِيمَانِهِمْ‌ وَ لِلَّهِ‌ جُنُودُ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ وَ کَانَ‌ اللَّهُ‌ عَلِيماً حَکِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "It is He who sent down the sense of security into the hearts of believers so that their faith may increase with belief, -- God's are the armies of the heavens and the earth; and God is all-knowing and all-wise; --"
          ],
          "en.ahmedraza": [
            "It is He Who instilled peace in the hearts of the believers, so that it may increase their strength of conviction; and to Allah only belong the armies of the heavens and the earth; and Allah is All Knowing, Wise."
          ],
          "en.arberry": [
            "It is He who sent down the Shechina (tranquillity) into the hearts of the believers, that they might add faith to their faith -- to God belong the hosts of the heavens and the earth; God is All-knowing, All-wise --"
          ],
          "en.daryabadi": [
            "He it is Who sent down tranquillity into the hearts of the believers that they might increase belief Unto their belief. And Allah's are the hosts of the heavens and the earth and Allah is ever Knowing, Wise."
          ],
          "en.hilali": [
            "He it is Who sent down As-Sakinah (calmness and tranquillity) into the hearts of the believers, that they may grow more in Faith along with their (present) Faith. And to Allah belong the hosts of the heavens and the earth, and Allah is Ever All-Knower, All-Wise."
          ],
          "en.itani": [
            "It is He who sent down tranquility into the hearts of the believers, to add faith to their faith. To God belong the forces of the heavens and the earth. God is Knowing and Wise."
          ],
          "en.maududi": [
            "He it is Who bestowed inner peace on the hearts of the believers so that they may grow yet more firm in their faith. To Allah belong the legions of the heavens and the earth; Allah is All-Knowing, Most Wise."
          ],
          "en.mubarakpuri": [
            "He it is Who sent down As-Sakinah into the hearts of the believers, that they may grow more in faith along with their faith. And to Allah belong the armies of the heavens and the earth, and Allah is Ever All-Knower, All-Wise."
          ],
          "en.pickthall": [
            "He it is Who sent down peace of reassurance into the hearts of the believers that they might add faith unto their faith. Allah's are the hosts of the heavens and the earth, and Allah is ever Knower, Wise -"
          ],
          "en.qarai": [
            "It is He who sent down composure into the hearts of the faithful that they might enhance in their faith. To Allah belong the hosts of the heavens and the earth, and Allah is all-knowing, all-wise."
          ],
          "en.qaribullah": [
            "It was He who sent down tranquility into the hearts of the believers so that they might add belief upon belief. To Allah belong the armies of the heavens and the earth. Allah is the Knower, the Wise."
          ],
          "en.sahih": [
            "It is He who sent down tranquillity into the hearts of the believers that they would increase in faith along with their [present] faith. And to Allah belong the soldiers of the heavens and the earth, and ever is Allah Knowing and Wise."
          ],
          "en.sarwar": [
            "It is God who has given confidence to the hearts of the believers to increase and strengthen their faith. To God belongs the armies of the heavens and the earth. He is All-knowing and All-wise."
          ],
          "en.shakir": [
            "He it is Who sent down tranquillity into the hearts of the believers that they might have more of faith added to their faith-- and Allah's are the hosts of the heavens and the earth, and Allah is Knowing, Wise--"
          ],
          "en.transliteration": [
            "Huwa alla<u>th</u>ee anzala a<b>l</b>ssakeenata fee quloobi almumineena liyazd<u>a</u>doo eem<u>a</u>nan maAAa eem<u>a</u>nihim walill<u>a</u>hi junoodu a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i wak<u>a</u>na All<u>a</u>hu AAaleeman <u>h</u>akeem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "It was He who sent down tranquillity into the hearts of the believers, to add faith to their faith -- the forces of the heavens and earth belong to Him; He is all knowing and all wise --"
          ],
          "en.yusufali": [
            "It is He Who sent down tranquillity into the hearts of the Believers, that they may add faith to their faith;- for to Allah belong the Forces of the heavens and the earth; and Allah is Full of Knowledge and Wisdom;-"
          ],
          "fa.ansarian": [
            "اوست که آرامش را در دل های مؤمنان نازل کرد، تا ایمانی بر ایمانشان بیفزاید. و سپاهیان آسمان و زمین فقط در سیطره مالکیّت و فرمانروایی خداست؛ و خدا همواره دانا و حکیم است."
          ],
          "fa.ayati": [
            "اوست كه بر دلهاى مؤمنان آرامش فرستاد تا بر ايمانشان پيوسته بيفزايد. و از آن خداست لشكرهاى آسمانها و زمين، و خدا دانا و حكيم است."
          ],
          "fa.bahrampour": [
            "او كسى است كه آرامش را در دل‌هاى مؤمنان نازل كرد تا ايمانى بر ايمانشان بيفزايند، و لشكريان آسمان‌ها و زمين از آن خداست و خداوند داناى حكيم است"
          ],
          "fa.fooladvand": [
            "اوست آن كس كه در دلهاى مؤمنان آرامش را فرو فرستاد تا ايمانى بر ايمان خود بيفزايند. و سپاهيان آسمانها و زمين از آن خداست، و خدا همواره داناى سنجيده‌كار است."
          ],
          "fa.ghomshei": [
            "اوست خدایی که سکینت و وقار بر دلهای مؤمنان آورد تا بر یقین و ایمانشان بیفزاید، و سپاه قوای آسمانها و زمین همه لشکر خداست و خدا دانا و به حکمت نظام آفرینش آگاه است."
          ],
          "fa.khorramdel": [
            "خدا است که به دلهای مؤمنان آرامش و اطمینان خاطر داده است تا ایمانی بر ایمان خود بیفزایند (و یقین و باور خویش را تقویت نمایند). لشکرهای آسمان و زمین از آن خدا است، و خداوند بس آگاه و فرزانه است. [[«السَّکِینَةَ»: آرامش. قوت قلب. طمأنینه. مراد اطمینان خاطری است که هرگونه شک و تردید و وحشت را از انسان زائل می‌کند و او را در طوفان حوادث ثابت قدم می‌دارد (نگا: توبه / 26). «جُنُودُ»: جمع جُنْد، لشکرها. سپاهها. مراد همه چیزهائی است که وسیله تنفیذ اوامر خدایند، از قبیل: فرشتگان، انسانها، سنگها، زلزله‌ها، رعد و برقها، و ... (نگا: احزاب / 9، مدثر / 31). مراد از لشکرها، همان سپاههائی است که در (توبه / 40) از آنان سخن رفته است.]]"
          ],
          "fa.khorramshahi": [
            "هموست که آرامش را در دلهای مؤمنان جای داد، تا ایمانی بر ایمانشان بیفزایند، و سپاههای آسمان و زمین خداوند راست، و خداوند دانای فرزانه است‌"
          ],
          "fa.makarem": [
            "او کسی است که آرامش را در دلهای مؤمنان نازل کرد تا ایمانی بر ایمانشان بیفزایند؛ لشکریان آسمانها و زمین از آن خداست، و خداوند دانا و حکیم است."
          ],
          "fa.moezzi": [
            "او است آنکه فرستاد آرامش را در دلهای مؤمنان تا بیفزایند ایمانی بر ایمانشان و خدا را است لشکرهای آسمانها و زمین و خدا است دانای حکیم‌"
          ],
          "fa.mojtabavi": [
            "اوست آن كه آرامش را در دلهاى مؤمنان فرو آورد تا ايمانى بر ايمان خويش بيفزايند. و خداى راست لشكرهاى آسمانها و زمين، و خدا دانا و با حكمت است."
          ],
          "fa.sadeqi": [
            "او کسی است که در دل‌های مؤمنان آرامش (ویژه) را فرو فرستاد تا ایمانی با (داشتنِ) ایمانشان بیفزایند. و سپاهیان آسمان‌ها و زمین تنها از خدایند. و خدا بس دانایی سنجیده‌کار بوده است."
          ]
        }
      },
      {
        "index": 4588,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:48:5",
        "text": [
          "لِيُدْخِلَ‌ الْمُؤْمِنِينَ‌ وَ الْمُؤْمِنَاتِ‌ جَنَّاتٍ‌ تَجْرِي‌ مِنْ‌ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ‌ فِيهَا وَ يُکَفِّرَ عَنْهُمْ‌ سَيِّئَاتِهِمْ‌ وَ کَانَ‌ ذٰلِکَ‌ عِنْدَ اللَّهِ‌ فَوْزاً عَظِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "And that He may admit men and women who believe into gardens with rivers running by, to live for ever there, and absolve their evil, -- This, in the sight of God, will be the great fulfilment --"
          ],
          "en.ahmedraza": [
            "In order to admit the believing men and believing women into Gardens beneath which rivers flow, in which they will abide, and to relieve them of their misdeeds; and this, in Allah’s sight, is the greatest success."
          ],
          "en.arberry": [
            "and that He may admit the believers, men and women alike, into gardens underneath which rivers flow, therein to dwell forever, and acquit them of their evil deeds; that is in God's sight a mighty triumph;"
          ],
          "en.daryabadi": [
            "He hath ordained war in order that He may cause the believing men and the believing women enter Gardens whereunder rivers flow, as abiders therein, and that He may expiate from them their misdeeds. And that is with Allah ever an achievement mighty."
          ],
          "en.hilali": [
            "That He may admit the believing men and the believing women to Gardens under which rivers flow (i.e. Paradise), to abide therein forever, and to expiate from them their sins, and that is with Allah, a supreme success,"
          ],
          "en.itani": [
            "He will admit the believers, male and female, into Gardens beneath which rivers flow, to abide therein forever, and He will remit their sins. That, with God, is a great triumph."
          ],
          "en.maududi": [
            "(He did this) to admit the believers, both men and women, to Gardens beneath which rivers flow, wherein they shall abide, and to efface their evil deeds from them. That, in Allah's sight, is the supreme triumph."
          ],
          "en.mubarakpuri": [
            "That He may admit the believing men and the believing women to Gardens under which rivers flow to abide therein forever, and He may expiate from them their sins; and that is with Allah supreme success,"
          ],
          "en.pickthall": [
            "That He may bring the believing men and the believing women into Gardens underneath which rivers flow, wherein they will abide, and may remit from them their evil deeds - That, in the sight of Allah, is the supreme triumph -"
          ],
          "en.qarai": [
            "That He may admit the faithful, men and women, into gardens with streams running in them, to remain in them [forever], and that He may absolve them of their misdeeds. That is a great success with Allah."
          ],
          "en.qaribullah": [
            "(From His Wisdom) He admits the believers, both men and women, into Gardens underneath which rivers flow, there to live for ever, and acquit them of their sins that with Allah is a mighty triumph"
          ],
          "en.sahih": [
            "[And] that He may admit the believing men and the believing women to gardens beneath which rivers flow to abide therein eternally and remove from them their misdeeds - and ever is that, in the sight of Allah, a great attainment -"
          ],
          "en.sarwar": [
            "So that He would admit the believers (both male and female) to the gardens wherein streams flow, to live therein forever. He will redeem them. This is the greatest triumph in the sight of God,"
          ],
          "en.shakir": [
            "That He may cause the believing men and the believing women to enter gardens beneath which rivers flow to abide therein and remove from them their evil; and that is a grand achievement with Allah"
          ],
          "en.transliteration": [
            "Liyudkhila almumineena wa<b>a</b>lmumin<u>a</u>ti jann<u>a</u>tin tajree min ta<u>h</u>tih<u>a</u> alanh<u>a</u>ru kh<u>a</u>lideena feeh<u>a</u> wayukaffira AAanhum sayyi<u>a</u>tihim wak<u>a</u>na <u>tha</u>lika AAinda All<u>a</u>hi fawzan AAa<i><u>th</u></i>eem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and so that He might admit the believers, men and women, into Gardens through which rivers flow, to dwell therein forever, and so that He may remove their evils from them, that is, indeed, a supreme triumph in God's eyes,"
          ],
          "en.yusufali": [
            "That He may admit the men and women who believe, to Gardens beneath which rivers flow, to dwell therein for aye, and remove their ills from them;- and that is, in the sight of Allah, the highest achievement (for man),-"
          ],
          "fa.ansarian": [
            "تا مردان و زنان مؤمن را در بهشت هایی درآورد که از زیرِ [درختانِ] آن نهرها جاری است در حالی که در آن جاودانه اند، و گناهانشان را از آنان محو کند، و این [سرانجام نیک] نزد خدا کامیابی بزرگ است."
          ],
          "fa.ayati": [
            "و تا مردان و زنان مؤمن را به بهشتهايى داخل كند كه در آن نهرها جارى است و در آنجا جاويدانند و گناهانشان را بزدايد. و اين در نزد خدا كاميابى بزرگى است."
          ],
          "fa.bahrampour": [
            "تا مردان و زنانى را كه ايمان آورده‌اند، به بهشت‌هايى داخل كند كه از پاى درختانش نهرها جارى است و در آن جاويدان بمانند و بدى‌هايشان را از آنها بپوشاند و اين در پيشگاه خدا كاميابى بزرگى است"
          ],
          "fa.fooladvand": [
            "تا مردان و زنانى را كه ايمان آورده‌اند در باغهايى كه از زير [درختان‌] آن جويبارها روان است، درآورد و در آن جاويدان بدارد، و بديهايشان را از آنان بزدايد؛ و اين [فرجام نيك‌] در پيشگاه خدا كاميابى بزرگى است."
          ],
          "fa.ghomshei": [
            "این (فتح یا فزودن ایمان) برای آن است که خدا می‌خواهد مردان و زنان مؤمن را تا ابد در بهشت‌هایی که زیر درختانش نهرها جاری است داخل گرداند و گناهانشان را تمام ببخشد و این به حقیقت نزد خدا فیروزی بزرگ است."
          ],
          "fa.khorramdel": [
            "(چنین کرد) تا مردان و زنان مؤمن را (در برابر فرمانبرداری و جهادشان) به باغهای بهشتی درآورد که در زیر (درختان و قصرهای) آن رودبارها روان است، و جاودانه در آن بسر می‌برند، و تا این که گناهان و بدیهایشان را بزداید و ببخشاید، و این در پیشگاه ایزدی (و در جهان ابدی، کامیابی سترگ و) رستگاری بزرگ بشمار است. [[«لِیُدْخِلَ الْمُؤْمِنینَ ...»: وجود لشکرهای آسمان و زمین بدان خاطر است که مؤمنین را به بهشت داخل کند، و ... بعضی (لِیُدْخِلَ) را متعلق وجود لشکرها، و برخی عطف بر (لِیَغْفِرَ) و جماعتی عطف بر (لِیَزْدَادُوا) می‌دانند.]]"
          ],
          "fa.khorramshahi": [
            "تا سرانجام مردان مؤمن و زنان مؤمن را به بوستانهایی که جویباران از فرو دست آن جاری است درآورد، که جاودانه در آنجا هستند، و سیئاتشان را از ایشان بزداید، و این نزد خداوند رستگاری بزرگی است‌"
          ],
          "fa.makarem": [
            "هدف (دیگر از آن فتح مبین) این بود که مردان و زنان با ایمان را در باغهایی (از بهشت) وارد کند که نهرها از زیر (درختانش) جاری است، در حالی که جاودانه در آن می‌مانند، و گناهانشان را می‌بخشد، و این نزد خدا رستگاری بزرگی است!"
          ],
          "fa.moezzi": [
            "تا درآرد مردان و زنان مؤمن را به بهشتهائی که روان است زیر آنها جویها جاودانان در آنها و بزداید از ایشان بدیهای ایشان را و آن است نزد خدا رستگاری بزرگ"
          ],
          "fa.mojtabavi": [
            "تا مردان و زنان مؤمن را به بهشتهايى درآرد كه از زير [درختان‌] آنها جويها روان است، در آنجا جاويدانند، و بديهاشان را از ايشان بزدايد. و اين در نزد خدا رستگارى و كاميابى بزرگى است."
          ],
          "fa.sadeqi": [
            "تا مردان و زنانی را که ایمان آورده‌اند در باغ‌هایی که از زیر (درختان)‌شان نهرها روان است، جاودانه در آوَرَد و بدی‌هایشان را از آنان بزداید؛ و این (فرجام نیک) در پیشگاه خدا به‌سلامتی کامیابی بزرگی بوده است."
          ]
        }
      },
      {
        "index": 4589,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:48:6",
        "text": [
          "وَ يُعَذِّبَ‌ الْمُنَافِقِينَ‌ وَ الْمُنَافِقَاتِ‌ وَ الْمُشْرِکِينَ‌ وَ الْمُشْرِکَاتِ‌ الظَّانِّينَ‌ بِاللَّهِ‌ ظَنَ‌ السَّوْءِ عَلَيْهِمْ‌ دَائِرَةُ السَّوْءِ وَ غَضِبَ‌ اللَّهُ‌ عَلَيْهِمْ‌ وَ لَعَنَهُمْ‌ وَ أَعَدَّ لَهُمْ‌ جَهَنَّمَ‌ وَ سَاءَتْ‌ مَصِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And that He may punish men and women (who are) hypocrites, and idolaters and idolatresses who entertain evil notions of God: It is against them that the wheel of misfortune will turn, and God will be wroth with them, and condemn them. For them He has prepared Hell, an evil destination!"
          ],
          "en.ahmedraza": [
            "And to punish the hypocrite men and hypocrite women, and the polytheist men and polytheist women, who think evilly about Allah; upon them only is the evil cycle of misfortune; and Allah has wreaked anger upon them, and has cursed them, and has prepared hell for them; and what an evil destination."
          ],
          "en.arberry": [
            "and that He may chastise the hypocrites, men and women alike, and the idolaters men and women alike, and those who think evil thoughts of God; against them shall be the evil turn of fortune. God is wroth with them, and has cursed them, and has prepared for them Gehenna -- an evil homecoming!"
          ],
          "en.daryabadi": [
            "And that He may chastise the hypocritical men and the hypocritical women and the associaters and the associatresses, the thinkers of evil thought concerning Allah. Unto them shall befell the evil turn of fortune, and Allah shall be wroth with them and shall curse them, and He hath gotten ready for them Hell: an ill destination!"
          ],
          "en.hilali": [
            "And that He may punish the Munafiqun (hypocrites), men and women, and also the Mushrikun men and women, who think evil thoughts about Allah, for them is a disgraceful torment, and the Anger of Allah is upon them, and He has cursed them and prepared Hell for them, and worst indeed is that destination."
          ],
          "en.itani": [
            "And He will punish the hypocrites, male and female, and the idolaters, male and female, those who harbor evil thoughts about God. They are surrounded by evil; and God is angry with them, and has cursed them, and has prepared for them Hell—a miserable destination."
          ],
          "en.maududi": [
            "(He also did this) to chastise the hypocrites, both men and women, and those who associate others in His Divinity, both men and women, and who harbour evil thoughts about Allah. They shall be afflicted with misfortune, Allah is wroth with them. He has laid His curse upon them and has prepared for them Hell. What an evil end!"
          ],
          "en.mubarakpuri": [
            "And that He may punish the hypocrites men and women, and also the idolators men and women, who think evil thoughts about Allah, for them is a disgraceful torment. And the anger of Allah is upon them, and He has cursed them and prepared Hell for them and worst indeed is that destination."
          ],
          "en.pickthall": [
            "And may punish the hypocritical men and the hypocritical women, and the idolatrous men and the idolatrous women, who think an evil thought concerning Allah. For them is the evil turn of fortune, and Allah is wroth against them and hath cursed them, and hath made ready for them hell, a hapless journey's end."
          ],
          "en.qarai": [
            "That He may punish the hypocrites, men and women, and the polytheists, men and women, who entertain a bad opinion of Allah. For them shall be an adverse turn of fortune: Allah is wrathful with them and He has cursed them, and prepared hell for them and it is an evil destination."
          ],
          "en.qaribullah": [
            "and that He might punish the hypocrites and the idolaters, both men and women, and those who think evil thoughts of Allah. An evil turn (of fortune) will befall them. The Wrath of Allah is on them, and He has cursed them and prepared for them Gehenna (Hell), an evil arrival!"
          ],
          "en.sahih": [
            "And [that] He may punish the hypocrite men and hypocrite women, and the polytheist men and polytheist women - those who assume about Allah an assumption of evil nature. Upon them is a misfortune of evil nature; and Allah has become angry with them and has cursed them and prepared for them Hell, and evil it is as a destination."
          ],
          "en.sarwar": [
            "so that He would punish the hypocrites and the pagans who have evil suspicions about God. It is they who are surrounded by evil and have become subject to the wrath and condemnation of God. He has prepared for them hell, a terrible place to live."
          ],
          "en.shakir": [
            "And (that) He may punish the hypocritical men and the hypocritical women, and the polytheistic men and the polytheistic women, the entertainers of evil thoughts about Allah. On them is the evil turn, and Allah is wroth with them and has cursed them and prepared hell for them, and evil is the resort."
          ],
          "en.transliteration": [
            "WayuAAa<u>thth</u>iba almun<u>a</u>fiqeena wa<b>a</b>lmun<u>a</u>fiq<u>a</u>ti wa<b>a</b>lmushrikeena wa<b>a</b>lmushrik<u>a</u>ti a<b>l</b><i><u>thth</u></i><u>a</u>nneena bi<b>A</b>ll<u>a</u>hi <i><u>th</u></i>anna a<b>l</b>ssawi AAalayhim d<u>a</u>iratu a<b>l</b>ssawi wagha<u>d</u>iba All<u>a</u>hu AAalayhim walaAAanahum waaAAadda lahum jahannama was<u>a</u>at ma<u>s</u>eer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and so that He might punish hypocritical men and women as well as the polytheists men and women who think evil thoughts about God; an evil turn of fortune will fall upon them, for God has become angry with them, and has rejected them and prepared Hell for them. How evil is such a destination."
          ],
          "en.yusufali": [
            "And that He may punish the Hypocrites, men and women, and the Polytheists men and women, who imagine an evil opinion of Allah. On them is a round of Evil: the Wrath of Allah is on them: He has cursed them and got Hell ready for them: and evil is it for a destination."
          ],
          "fa.ansarian": [
            "و مردان و زنان منافق و مردان و زنان مشرک را که به خدا گمان بد می برند عذاب کند؛ پیشامد بد زمانه فقط بر خودشان باد. خدا بر آنان خشم گرفته، و لعنتشان کرده است و دوزخ را برای آنان آماده نموده و بد بازگشت گاهی است."
          ],
          "fa.ayati": [
            "و مردان و زنان منافق و مردان و زنان مشرك را كه بر خدا بدگمانند عذاب كند. بر گردشان بدى حلقه زند و خدا بر آنها خشم گرفت و لعنتشان كرد و جهنم را برايشان آماده كرده است و جهنم بد سرانجامى است."
          ],
          "fa.bahrampour": [
            "و [تا] مردان و زنان نفاق پيشه و مردان و زنان مشرك را كه به خدا سوءظن دارند، عذاب كند. حوادث بد زمانه بر آنها باد، و خدا بر ايشان خشم گرفته و لعنتشان كرده و جهنم را براى آنها آماده كرده و چه بد سر انجامى است"
          ],
          "fa.fooladvand": [
            "و [تا] مردان و زنان نفاق‌پيشه و مردان و زنان مشرك را كه به خدا گمان بد برده‌اند، عذاب كند؛ بد زمانه بر آنان باد. و خدا بر ايشان خشم نموده و لعنتشان كرده و جهنم را براى آنان آماده گردانيده و [چه‌] بد سرانجامى است،"
          ],
          "fa.ghomshei": [
            "و نیز خدا خواهد تا همه منافقان و مشرکان را از مرد و زن عذاب کند که آنها به خدا بد گمان بودند (و وعده فتح خدا را دروغ پنداشتند) در صورتی که (وعده خدا صدق است و) روزگار بد و هلاکت ابد بر خود آنهاست و خدا بر آنان خشم و لعن کرد و جهنم را که بسیار بد منزلگاهی است بر ایشان مهیّا ساخت."
          ],
          "fa.khorramdel": [
            "و تا این که مردان و زنان منافق، و مردان و زنان مشرکی را عذاب کند که به خدا گمان بد می‌برند. بدیها و بلاها تنها ایشان را در برمی‌گیرد (و فقط بر آنان چنبره می‌زند) و خداوند بر ایشان خشمگین می‌گردد، و آنان را نفرین می‌کند (و از رحمت خود محروم می‌سازد) و دوزخ را برای ایشان آماده ساخته است، و دوزخ چه جایگاه نهائی بدی است! [[«یُعَذِّبَ»: عطف بر (لِیُدْخِلَ) است. «الظّآنِّینَ»: گمان‌برندگان (نگا: آیه 12). «ظَنَّ السَّوْءِ»: گمان بد. اضافه موصوف به صفت خود است. «دَآئِرَةُ»: در اصل به معنی چنبر و چنبره است که بعد به بلای فراگیر گفته شده است. اسم فاعل یا مصدر است. «دَآئِرَةُ السَّوْءِ». بلای فراگیر و همه‌جانبه. اضافه موصوف به صفت خود است. «مَصِیراً»: سرمنزل. مکان پایانی. جایگاه نهائی (نگا: نساء / 97 و 115). «عَلَیْهِمْ دَآئِرَةُ السَّوْءِ ... وَ أَعَدَّ لَهُمْ جَهَنَّمَ»: این عبارت می‌تواند دعائی هم باشد. یعنی: بلای فراگیر و همه‌جانبه بهره ایشان باد، و خدا بر آنان خشمناک شود و نفرینشان کند، و دوزخ را برایشان آماده سازد.]]"
          ],
          "fa.khorramshahi": [
            "و تا مردان منافق و زنان منافق و مردان مشرک و زنان مشرک را که درباره خداوند بداندیشند، عذاب کند، گردش بد روزگار بر آنان باد و خداوند بر آنان خشم گرفته و لعنت آورده و برایشان دوزخ را آماده ساخته است و بد سرانجامی است‌"
          ],
          "fa.makarem": [
            "و (نیز) مردان و زنان منافق و مردان و زنان مشرک را که به خدا گمان بد می‌برند مجازات کند؛ (آری) حوادث ناگواری (که برای مؤمنان انتظار می‌کشند) تنها بر خودشان نازل می‌شود! خداوند بر آنان غضب کرده و از رحمت خود دورشان ساخته و جهنم را برای آنان آماده کرده؛ و چه بد سرانجامی است!"
          ],
          "fa.moezzi": [
            "و عذاب کند مردان و زنان منافق (دوروی) و مردان و زنان مشرک را آنان که به خدا گمان بد برند بر ایشان بار گردش بد (پیش‌آمد بد) و خشم گیرد خدا بر ایشان و لعن کند ایشان را و آماده سازد برای ایشان دوزخ را و چه زشت است جایگاهی‌"
          ],
          "fa.mojtabavi": [
            "و مردان و زنان منافق و مردان و زنان مشرك را كه به خداى گمان بد مى‌برند عذاب كند. گردنده بد- پيشامد بد- بر آنان باد، و خداى بر آنان خشم گرفت و لعنتشان كرد و برايشان دوزخ را آماده ساخته است، و بد بازگشتگاهى است."
          ],
          "fa.sadeqi": [
            "و تا مردان و زنان نفاق‌پیشه و مردان و زنان مشرک بدگمان به خدا را عذاب کند، بر آن حالت گردونه‌ی بد (در نشیب و فراز زمان) است. و خدا بر ایشان خشم نموده و لعنتشان کرده و جهنّم را برای آنان آماده گردانیده و (چه) بد سرانجامی است!"
          ]
        }
      },
      {
        "index": 4590,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:48:7",
        "text": [
          "وَ لِلَّهِ‌ جُنُودُ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ وَ کَانَ‌ اللَّهُ‌ عَزِيزاً حَکِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "For God's are the armies of the heavens and the earth; and God is all-knowing and all-wise."
          ],
          "en.ahmedraza": [
            "And to Allah only belong the armies of the heavens and the earth; and Allah is Most Honourable, Wise."
          ],
          "en.arberry": [
            "To God belong the hosts of the heavens and the earth; God is All-mighty, All-wise."
          ],
          "en.daryabadi": [
            "And Allah's are the hosts of the heavens and the earth, and Allah is ever Mighty, Wise."
          ],
          "en.hilali": [
            "And to Allah belong the hosts of the heavens and the earth. And Allah is Ever All-Knower, All-Wise."
          ],
          "en.itani": [
            "To God belong the troops of the heavens and the earth. God is Mighty and Wise."
          ],
          "en.maududi": [
            "To Allah belong the legions of the heavens and the earth. Allah is Most Mighty, Most Wise."
          ],
          "en.mubarakpuri": [
            "And to Allah belong the armies of the heavens and the earth. And Allah is Ever All-Powerful, All-Wise."
          ],
          "en.pickthall": [
            "Allah's are the hosts of the heavens and the earth, and Allah is ever Mighty, Wise."
          ],
          "en.qarai": [
            "To Allah belong the hosts of the heavens and the earth, and Allah is all-mighty, all-wise."
          ],
          "en.qaribullah": [
            "To Allah belong the armies of the heavens and the earth. Allah is the Almighty and the Wise."
          ],
          "en.sahih": [
            "And to Allah belong the soldiers of the heavens and the earth. And ever is Allah Exalted in Might and Wise."
          ],
          "en.sarwar": [
            "To God belong the armies of the heavens and the earth. God is Majestic and All-wise."
          ],
          "en.shakir": [
            "And Allah's are the hosts of the heavens and the earth; and Allah is Mighty, Wise."
          ],
          "en.transliteration": [
            "Walill<u>a</u>hi junoodu a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i wak<u>a</u>na All<u>a</u>hu AAazeezan <u>h</u>akeem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "The forces of heavens and earth belong to God; He is almighty and all wise."
          ],
          "en.yusufali": [
            "For to Allah belong the Forces of the heavens and the earth; and Allah is Exalted in Power, Full of Wisdom."
          ],
          "fa.ansarian": [
            "سپاهیان آسمان ها و زمین فقط در سیطره مالکیّت و فرمانروایی خداست؛ و خدا همواره توانای شکست ناپذیر و حکیم است."
          ],
          "fa.ayati": [
            "از آن خداست لشكرهاى آسمانها و زمين، و خدا پيروزمند و حكيم است."
          ],
          "fa.bahrampour": [
            "جنود [و قواى‌] آسمان‌ها و زمين از آن خداست، و خدا شكست ناپذير حكيم است"
          ],
          "fa.fooladvand": [
            "و سپاهيان آسمانها و زمين از آن خداست، و خدا همواره شكست‌ناپذير سنجيده‌كار است."
          ],
          "fa.ghomshei": [
            "و سپاه قوای آسمانها و زمین لشکر خداست و خدا بسیار مقتدر و به تدبیر نظام عالم داناست."
          ],
          "fa.khorramdel": [
            "لشکرهای آسمانها و زمین از آن خدا است، و خدا مقتدری شکست‌ناپذیر و حکیمی فرزانه است. [[«وَ ِللهِ جُنُودُ ...»: (نگا: آیه 4).]]"
          ],
          "fa.khorramshahi": [
            "و سپاههای آسمان و زمین خداوند راست، و خداوند پیروزمند فرزانه است‌"
          ],
          "fa.makarem": [
            "لشکریان آسمانها و زمین تنها از آن خداست؛ و خداوند شکست‌ناپذیر و حکیم است.!"
          ],
          "fa.moezzi": [
            "و خدا را است لشکرهای آسمانها و زمین و خدا است عزّتمند حکیم‌"
          ],
          "fa.mojtabavi": [
            "و خداى راست لشكرهاى آسمانها و زمين، و خدا تواناى بى‌همتا و داناى استواركار است."
          ],
          "fa.sadeqi": [
            "و سپاهیان آسمان‌ها و زمین تنها از خدایند و خدا همواره عزیز سنجیده‌کار بوده است."
          ]
        }
      },
      {
        "index": 4591,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:48:8",
        "text": [
          "إِنَّا أَرْسَلْنَاکَ‌ شَاهِداً وَ مُبَشِّراً وَ نَذِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "We have sent you as witness (of the truth) and harbinger of good news and a warner,"
          ],
          "en.ahmedraza": [
            "We have indeed sent you (O dear Prophet Mohammed – peace and blessings be upon him) as a present witness and a Herald of glad tidings and warnings. (The Holy Prophet is a witness from Allah.)"
          ],
          "en.arberry": [
            "Surely We have sent thee as a witness, good tidings to bear, and warning,"
          ],
          "en.daryabadi": [
            "Verily We! We have sent thee as a witness and a bearer of glad tidings and a warner."
          ],
          "en.hilali": [
            "Verily, We have sent you (O Muhammad SAW) as a witness, as a bearer of glad tidings, and as a warner."
          ],
          "en.itani": [
            "We sent you as a witness, and a bearer of good news, and a warner."
          ],
          "en.maududi": [
            "(O Prophet), We have sent you forth as a witness, as a bearer of good news, and as a warner"
          ],
          "en.mubarakpuri": [
            "Verily, We have sent you as a witness, as a bearer of glad tidings, and as a warner."
          ],
          "en.pickthall": [
            "Lo! We have sent thee (O Muhammad) as a witness and a bearer of good tidings and a warner,"
          ],
          "en.qarai": [
            "Indeed We have sent you as a witness, and as a bearer of good news and warner,"
          ],
          "en.qaribullah": [
            "We have sent you (Prophet Muhammad) as a witness and as a bearer of glad tidings and warning,"
          ],
          "en.sahih": [
            "Indeed, We have sent you as a witness and a bringer of good tidings and a warner"
          ],
          "en.sarwar": [
            "We have sent you as a witness, a bearer of glad news, and a warner,"
          ],
          "en.shakir": [
            "Surely We have sent you as a witness and as a bearer of good news and as a warner,"
          ],
          "en.transliteration": [
            "Inn<u>a</u> arsaln<u>a</u>ka sh<u>a</u>hidan wamubashshiran wana<u>th</u>eer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "We have sent you forth as a witness and a bearer of good tidings and a warner,"
          ],
          "en.yusufali": [
            "We have truly sent thee as a witness, as a bringer of Glad Tidings, and as a Warner:"
          ],
          "fa.ansarian": [
            "ما تو را گواه [بر اعمال امت] و مژده رسان و بیم دهنده فرستادیم؛"
          ],
          "fa.ayati": [
            "تو را گواه و مژده‌دهنده و بيم‌دهنده فرستاده‌ايم."
          ],
          "fa.bahrampour": [
            "[اى پيامبر!] ما تو را گواه [بر اعمال آنها] و بشارتگر و هشدار دهنده فرستاديم"
          ],
          "fa.fooladvand": [
            "[اى پيامبر،] ما تو را [به سمت‌] گواه و بشارتگر و هشداردهنده‌اى فرستاديم."
          ],
          "fa.ghomshei": [
            "ما شخص تو را به عالم فرستادیم که شاهد (نیک و بد امت) باشی و (خلق را به لطف و رحمت حق) بشارت دهی و (از قهر و عذاب او) بترسانی."
          ],
          "fa.khorramdel": [
            "ما تو را به عنوان گواه و مژده‌رسان و بیم‌دهنده فرستاده‌ایم. [[«إِنَّآ أَرْسَلْنَاکَ ...»: (نگا: احزاب / 45).]]"
          ],
          "fa.khorramshahi": [
            "همانا ما تو را گواه و مژده‌بخش و هشداردهنده فرستاده‌ایم‌"
          ],
          "fa.makarem": [
            "به یقین ما تو را گواه (بر اعمال آنها) و بشارت‌دهنده و بیم‌دهنده فرستادیم،"
          ],
          "fa.moezzi": [
            "همانا فرستادیمت گواهی و مژده‌دهنده و ترساننده‌"
          ],
          "fa.mojtabavi": [
            "همانا تو را گواه- بر اعمال مردمان- و مژده‌دهنده و بيم‌كننده فرستاديم،"
          ],
          "fa.sadeqi": [
            "(ای پیامبر!) ما تو را همواره گواهی‌دهنده‌ای و بشارتگر‌ی و هشداردهنده‌ای فرستادیم."
          ]
        }
      },
      {
        "index": 4592,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:48:9",
        "text": [
          "لِتُؤْمِنُوا بِاللَّهِ‌ وَ رَسُولِهِ‌ وَ تُعَزِّرُوهُ‌ وَ تُوَقِّرُوهُ‌ وَ تُسَبِّحُوهُ‌ بُکْرَةً وَ أَصِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "So that (men) may believe in God and His Apostle, and honour Him and revere Him, and sing His praises morning and evening."
          ],
          "en.ahmedraza": [
            "In order that you, O people, may accept faith in Allah and His Noble Messenger, and honour and revere the Noble Messenger; and may say the Purity of Allah, morning and evening. (To honour the Holy Prophet – peace and blessings be upon him – is part of faith. To disrespect him is blasphemy.)"
          ],
          "en.arberry": [
            "that you may believe in God and His Messenger and succour Him, and reverence Him, and that you may give Him glory at the dawn and in the evening."
          ],
          "en.daryabadi": [
            "That ye may believe in Allah and His apostle, and may assist Him and honour Him, and may hallow Him at dawn and evening."
          ],
          "en.hilali": [
            "In order that you (O mankind) may believe in Allah and His Messenger (SAW), and that you assist and honour him (SAW), and (that you) glorify (Allah's) praises morning and afternoon."
          ],
          "en.itani": [
            "That you may believe in God and His Messenger, and support Him, and honor Him, and praise Him morning and evening."
          ],
          "en.maududi": [
            "so that (all of) you may all believe in Allah and His Messenger, and support him, and revere him, and celebrate Allah's glory, morning and evening."
          ],
          "en.mubarakpuri": [
            "In order that you (O mankind) may believe in Allah and His Messenger and that you Tu`azziruh and Tuwaqqiruh, and Tusabbihuh Bukrah and Asila."
          ],
          "en.pickthall": [
            "That ye (mankind) may believe in Allah and His messenger, and may honour Him, and may revere Him, and may glorify Him at early dawn and at the close of day."
          ],
          "en.qarai": [
            "that you may have faith in Allah and His Apostle, and that you may support him and revere him, and that you may glorify Him morning and evening."
          ],
          "en.qaribullah": [
            "so that you believe in Allah and His Messenger and that you support him, revere him (Prophet Muhammad), and exalt Him (Allah), at the dawn and in theevening."
          ],
          "en.sahih": [
            "That you [people] may believe in Allah and His Messenger and honor him and respect the Prophet and exalt Allah morning and afternoon."
          ],
          "en.sarwar": [
            "so that you (people) may believe in God and His Messenger, help, and respect God and glorify Him in the morning and the evening."
          ],
          "en.shakir": [
            "That you may believe in Allah and His Apostle and may aid him and revere him; and (that) you may declare His glory, morning and evening."
          ],
          "en.transliteration": [
            "Lituminoo bi<b>A</b>ll<u>a</u>hi warasoolihi watuAAazziroohu watuwaqqiroohu watusabbi<u>h</u>oohu bukratan waa<u>s</u>eel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "so that you may believe in God and His Messenger, and may help him, and honour him, and so that you may glorify God morning and evening."
          ],
          "en.yusufali": [
            "In order that ye (O men) may believe in Allah and His Messenger, that ye may assist and honour Him, and celebrate His praise morning and evening."
          ],
          "fa.ansarian": [
            "تا [همه شما مردم] به خدا و پیامبرش ایمان آورید و او را یاری دهید و بزرگش بشمارید و بامداد و شام گاه تسبیحش گویید."
          ],
          "fa.ayati": [
            "تا به خدا و پيامبرش ايمان بياوريد و ياريش كنيد و بزرگش داريد و خدا را صبحگاه و شامگاه تسبيح گوييد."
          ],
          "fa.bahrampour": [
            "تا به خدا و فرستاده‌اش ايمان آوريد و او را يارى كنيد و بزرگش داريد و خدا را صبح و شام به پاكى بستاييد"
          ],
          "fa.fooladvand": [
            "تا به خدا و فرستاده‌اش ايمان آوريد و او را يارى كنيد و ارجش نهيد، و [خدا] را بامدادان و شامگاهان به پاكى بستاييد."
          ],
          "fa.ghomshei": [
            "تا شما (صالحان امت) به خدا و رسول او ایمان آورده و (دین) او را یاری کنید و به تعظیم جلالش صبح و شام تسبیح او گویید."
          ],
          "fa.khorramdel": [
            "(ما محمّد را به سوی شما مردمان فرستاده‌ایم) تا به خدا و پیغمبرش ایمان بیاورید، و خدا را (با یاری دادن دینش) یاری کنید، و او را بزرگ دارید، و سحرگاهان و شامگاهان به تسبیح و تقدیسش بپردازید. [[«تُعَزِّرُوهُ»: تا خدا را یاری کنید. یاری دادن خدا هم با یاری دادن دین او میسر است. «تُوَقِّرُوهُ»: تا خدا را بزرگ دارید و تعظیمش کنید. «بُکْرَةً وَ أَصِیلاً»: (نگا: فرقان / 5، احزاب / 42).]]"
          ],
          "fa.khorramshahi": [
            "تا به خداوند و پیامبر او ایمان آورید و او [پیامبر] را گرامی دارید و بزرگ شمارید و [خداوند را] بامدادان و شامگاهان تسبیح گویید"
          ],
          "fa.makarem": [
            "تا (شما مردم) به خدا و رسولش ایمان بیاورید و از او دفاع کنید و او را بزرگ دارید، و خدا را صبح و شام تسبیح گویید."
          ],
          "fa.moezzi": [
            "تا ایمان آرید به خدا و پیمبرش و یاریش کنید (گرامیش دارید) و ارجمندش دارید و تسبیحش گویید بامدادان و شب‌هنگام‌"
          ],
          "fa.mojtabavi": [
            "تا [شما مردم‌] به خدا و پيامبرش ايمان بياوريد و او"
          ],
          "fa.sadeqi": [
            "تا (شما مکلفان) به خدا و فرستاده‌اش ایمان آورید و بزرگش بدارید و ارجش نهید و خدا را بامدادان و شامگاهان به پاکی بستایید."
          ]
        }
      },
      {
        "index": 4593,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:48:10",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:3:23:6"
          ]
        },
        "text": [
          "إِنَ‌ الَّذِينَ‌ يُبَايِعُونَکَ‌ إِنَّمَا يُبَايِعُونَ‌ اللَّهَ‌ يَدُ اللَّهِ‌ فَوْقَ‌ أَيْدِيهِمْ‌ فَمَنْ‌ نَکَثَ‌ فَإِنَّمَا يَنْکُثُ‌ عَلَى‌ نَفْسِهِ‌ وَ مَنْ‌ أَوْفَى‌ بِمَا عَاهَدَ عَلَيْهُ‌ اللَّهَ‌ فَسَيُؤْتِيهِ‌ أَجْراً عَظِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "Those who swear allegiance to you indeed swear allegiance to God; and God's protection is over them. Then whosoever breaks the promise breaks it to his own loss; but whosoever fulfills the promise made to God will receive a great reward from Him."
          ],
          "en.ahmedraza": [
            "Those who swear allegiance to you (O dear Prophet Mohammed – peace and blessings be upon him), do indeed in fact swear allegiance to Allah; Allah's Hand* of Power is above their hands; so whoever breaches his oath, has breached his own greater promise; and whoever fulfils the covenant he has with Allah – so very soon Allah will bestow upon him a great reward. (Used as a metaphor.)"
          ],
          "en.arberry": [
            "Those who swear fealty to thee swear fealty in truth to God; God's hand is over their hands. Then whosoever breaks his oath breaks it but to his own hurt; and whoso fulfils his covenant made with God, God will give him a mighty wage."
          ],
          "en.daryabadi": [
            "Verily those who swear fealty Unto thee, only swear fealty Unto Allah: the hand of Allah is over their hands. So whosoever breaketh his oath, breaketh it only to his soul's hurt; and whosoever fulfilleth that which he hath convenanted with Allah, him anon He shall give a mighty hire."
          ],
          "en.hilali": [
            "Verily, those who give Bai'a (pledge) to you (O Muhammad SAW) they are giving Bai'a (pledge) to Allah. The Hand of Allah is over their hands. Then whosoever breaks his pledge, breaks only to his own harm, and whosoever fulfills what he has covenanted with Allah, He will bestow on him a great reward."
          ],
          "en.itani": [
            "Those who pledge allegiance to you are pledging allegiance to God. The hand of God is over their hands. Whoever breaks his pledge breaks it to his own loss. And whoever fulfills his covenant with God, He will grant him a great reward."
          ],
          "en.maududi": [
            "Those who swore fealty to you, (O Prophet), in fact swore fealty to Allah. The Hand of Allah is above their hands. So whoever breaks his covenant breaks it to his own hurt; and whoever fulfils the covenant that he made with Allah, He will bestow on him a great reward."
          ],
          "en.mubarakpuri": [
            "Verily, those who give pledge to you, they are giving pledge to Allah. The Hand of Allah is over their hands. Then whosoever breaks his pledge, breaks it only to his own harm; and whosoever fulfills what he has the covenants he makes with Allah, He will bestow on him a great reward."
          ],
          "en.pickthall": [
            "Lo! those who swear allegiance unto thee (Muhammad), swear allegiance only unto Allah. The Hand of Allah is above their hands. So whosoever breaketh his oath, breaketh it only to his soul's hurt; while whosoever keepeth his covenant with Allah, on him will He bestow immense reward."
          ],
          "en.qarai": [
            "Indeed those who swear allegiance to you, swear allegiance only to Allah: the hand of Allah is above their hands. Then whosoever breaks his oath, breaks it only to his own detriment, and whoever fulfills the covenant he has made with Allah, He will give him a great reward."
          ],
          "en.qaribullah": [
            "Those who swear allegiance to you swear allegiance to Allah. The Hand of Allah is above their hands. He who breaks his oath breaks it against his self, but for he that keeps his covenant made with Allah, Allah shall give him a mighty wage."
          ],
          "en.sahih": [
            "Indeed, those who pledge allegiance to you, [O Muhammad] - they are actually pledging allegiance to Allah. The hand of Allah is over their hands. So he who breaks his word only breaks it to the detriment of himself. And he who fulfills that which he has promised Allah - He will give him a great reward."
          ],
          "en.sarwar": [
            "Those who pledge obedience to you are, in fact, pledging obedience to God. The hands of God are above their hands. As for those who disregard their pledge, they do so only against their own souls. Those who fulfill their promise to God will receive a great reward."
          ],
          "en.shakir": [
            "Surely those who swear allegiance to you do but swear allegiance to Allah; the hand of Allah is above their hands. Therefore whoever breaks (his faith), he breaks it only to the injury of his own soul, and whoever fulfills what he has covenanted with Allah, He will grant him a mighty reward."
          ],
          "en.transliteration": [
            "Inna alla<u>th</u>eena yub<u>a</u>yiAAoonaka innam<u>a</u> yub<u>a</u>yiAAoona All<u>a</u>ha yadu All<u>a</u>hi fawqa aydeehim faman nakatha fainnam<u>a</u> yankuthu AAal<u>a</u> nafsihi waman awf<u>a</u> bim<u>a</u> AA<u>a</u>hada AAalayhu All<u>a</u>ha fasayuteehi ajran AAa<i><u>th</u></i>eem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Behold, all who pledge their allegiance to you indeed pledge their allegiance to God: the hand of God is over their hands. Hence, he who breaks his oath, breaks it only to his own loss. Whereas he who remains true to what he has pledged to God, shall have a great reward bestowed upon him by God."
          ],
          "en.yusufali": [
            "Verily those who plight their fealty to thee do no less than plight their fealty to Allah: the Hand of Allah is over their hands: then any one who violates his oath, does so to the harm of his own soul, and any one who fulfils what he has covenanted with Allah,- Allah will soon grant him a great Reward."
          ],
          "fa.ansarian": [
            "به یقین کسانی که با تو بیعت می کنند، جز این نیست که با خدا بیعت می کنند؛ قدرت خدا بالاتر از همه قدرتهاست. پس کسی که پیمان می شکند فقط به زیان خود می شکند، و کسی که به پیمانی که با خدا بسته است وفا کند، خدا به زودی پاداشی بزرگ به او می دهد."
          ],
          "fa.ayati": [
            "آنان كه با تو بيعت مى‌كنند جز اين نيست كه با خدا بيعت مى‌كنند. دست خدا بالاى دستهايشان است. و هر كه بيعت را بشكند، به زيان خود شكسته است. و هر كه بدان بيعت كه با خدا بسته است وفا كند، او را مزدى كرامند دهد."
          ],
          "fa.bahrampour": [
            "كسانى كه با تو بيعت مى‌كنند، جز اين نيست كه با خدا بيعت مى‌كنند دست خدا بالاى دست‌هايشان است. پس هر كه پيمان بشكند، تنها به زيان خود مى‌شكند، و هر كه بر آنچه با خدا عهد بسته وفادار بماند، به زودى خدا پاداشى بزرگ به او مى‌بخشد"
          ],
          "fa.fooladvand": [
            "در حقيقت، كسانى كه با تو بيعت مى‌كنند، جز اين نيست كه با خدا بيعت مى‌كنند؛ دست خدا بالاى دستهاى آنان است. پس هر كه پيمان‌شكنى كند، تنها به زيان خود پيمان مى‌شكند، و هر كه بر آنچه با خدا عهد بسته وفادار بماند، به زودى خدا پاداشى بزرگ به او مى‌بخشد."
          ],
          "fa.ghomshei": [
            "همانا مؤمنانی که (در حدیبیّه) با تو بیعت می‌کنند به حقیقت با خدا بیعت می‌کنند (چون تو خلیفه خدایی و همانا دست تو) دست خداست بالای دست آنها، پس از آن هر که نقض بیعت کند بر زیان و هلاک خویش به حقیقت اقدام کرده و هر که به عهدی که با خدا بسته است وفا کند به زودی خدا به او پاداش بزرگ عطا خواهد کرد."
          ],
          "fa.khorramdel": [
            "بی‌گمان کسانی که (در بیعة‌الرضوانِ حدیبیّه) با تو پیمان (جان) می‌بندند، در حقیقت با خدا پیمان می‌بندند، و در اصل (دست خود را که در دست پیشوا و رهبرشان پیغمبر می‌گذارند، و دست رسول بالای دست ایشان قرار می‌گیرد، این دست به منزله‌ی دست خدا است و) دست خدا بالای دست آنان است! هر کس پیمان‌شکنی کند به زیان خود پیمان‌شکنی می‌کند، و آن کس که در برابر پیمانی که با خدا بسته است وفادار بماند و آن را رعایت بدارد، خدا پاداش بسیار بزرگی به او عطاء می‌کند. [[«إِنَّ الَّذِینَ یُبَایِعُونَکَ ...»: اشاره به تجدید بیعت اصحاب کرام - رَضِیَ اللهُ عَنْهُمْ - با پیغمبر (ص) است. مسلمانان در حدیبیه دست خود را در دست رهبرشان محمد (گذاشتند و با او پیمان بذل جان و فداکاری و وفاداری بستند. چنین پیمانی را خداوند پیمان بستن با خود نامیده است و به «بیعة‌الرضوان» مشهور گشته است. «یَدُ اللهِ فَوْقَ أَیْدِیهِمْ»: این تعبیر کنایه از آن است که بیعت با پیغمبر یک بیعت الهی است. انگار دست خدا بالای دست آنان قرار گرفته است و در دست ایشان گذارده شده است. یعنی نه تنها با پیغمبرش که با خدا بیعت می‌کنند. «نَکَثَ»: پیمان‌شکنی کرد.]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان کسانی که با تو بیعت می‌کنند، در واقع با خداوند بیعت می‌کنند، دست خداوند برفراز دست ایشان است، پس هر کس که پیمان شکند، همانا به زیان خویش پیمان شکسته است، و هر کس به آنچه با خداوند پیمان بسته است، وفا کند، زودا که به او پاداش بزرگ ببخشد"
          ],
          "fa.makarem": [
            "کسانی که با تو بیعت می‌کنند (در حقیّقت) تنها با خدا بیعت می‌نمایند، و دست خدا بالای دست آنهاست؛ پس هر کس پیمان‌شکنی کند، تنها به زیان خود پیمان شکسته است؛ و آن کس که نسبت به عهدی که با خدا بسته وفا کند، بزودی پاداش عظیمی به او خواهد داد."
          ],
          "fa.moezzi": [
            "همانا آنان که با تو پیمان بندند (دست بیعت به تو دهند) جز این نیست که با خدا پیمان بندند دست خدا است فراز دستهای ایشان پس هر که پیمان‌شکنی کند جز این نیست که بر خویش پیمان شکند و آنکه پایدار ماند (وفا کند) بر آنچه پیمان بست با خدا بر آن زود است بدو دهد پاداشی گران (بزرگ را)"
          ],
          "fa.mojtabavi": [
            "همانا كسانى كه با تو بيعت مى‌كنند جز اين نيست كه با خداى بيعت مى‌كنند دست خداى بالاى دستهاشان است. پس هر كه پيمان بشكند جز اين نيست كه به زيان خويش مى‌شكند، و هر كه بدانچه بر آن با خداى پيمان بسته است وفا كند پس او را مزدى بزرگ خواهد داد."
          ],
          "fa.sadeqi": [
            "بی‌گمان کسانی که با تو بیعت می‌کنند، به‌راستی تنها با خدا بیعت می‌کنند. دست خدا بالای دست‌های آنان است. پس هر کس پیمان شکند، تنها به زیان خود پیمان می‌شکند، و هر کسی بر آنچه با خدا بر عهده‌ی خود عهدی بسته وفادار بماند، زودا (که) خدا پاداشی بزرگ به او می‌بخشد."
          ]
        }
      },
      {
        "index": 4594,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:48:11",
        "text": [
          "سَيَقُولُ‌ لَکَ‌ الْمُخَلَّفُونَ‌ مِنَ‌ الْأَعْرَابِ‌ شَغَلَتْنَا أَمْوَالُنَا وَ أَهْلُونَا فَاسْتَغْفِرْ لَنَا يَقُولُونَ‌ بِأَلْسِنَتِهِمْ‌ مَا لَيْسَ‌ فِي‌ قُلُوبِهِمْ‌ قُلْ‌ فَمَنْ‌ يَمْلِکُ‌ لَکُمْ‌ مِنَ‌ اللَّهِ‌ شَيْئاً إِنْ‌ أَرَادَ بِکُمْ‌ ضَرّاً أَوْ أَرَادَ بِکُمْ‌ نَفْعاً بَلْ‌ کَانَ‌ اللَّهُ‌ بِمَا تَعْمَلُونَ‌ خَبِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "The Arabs of the desert who had stayed behind will now say to you: \"We were occupied with our flocks and herds and families, so ask forgiveness for us. They say with their tongues what is not in their hearts. Tell them: \"Who can prevail with God for you if He wish you harm or benefit? Surely God is well aware of what you do."
          ],
          "en.ahmedraza": [
            "The ignorant ones who had stayed behind will now say to you, “Our wealth and our families prevented us from going by keeping us pre-occupied, therefore seek forgiveness for us”; they utter with their tongues what is not in their hearts; say, “So does anyone have any control over you against Allah, if He wills to harm you or provide you benefit? In fact Allah is Aware of what you do.”"
          ],
          "en.arberry": [
            "The Bedouins who were left behind will say to thee, 'We were occupied by our possessions and our families; so ask forgiveness for us!' They say with their tongues what is not in their hearts. Say: 'Who can avail you aught against God, if He desires hurt for you, or desires profit for you? Nay, but God is ever aware of the things you do."
          ],
          "en.daryabadi": [
            "Those who lagged behind of the desert Arabs Will presently say Unto thee: our properties and our households kept us occupied, so ask thou forgiveness for Us. They say with their tongues that which is not in their hearts. Say thou: who can avail you in aught against Allah, if He intended you hurt or intended you benefit? Yea! Allah is of that which ye work ever Aware."
          ],
          "en.hilali": [
            "Those of the bedouins who lagged behind will say to you: \"Our possessions and our families occupied us, so ask forgiveness for us.\" They say with their tongues what is not in their hearts. Say: \"Who then has any power at all (to intervene) on your behalf with Allah, if He intends you hurt or intends you benefit? Nay, but Allah is Ever All-Aware of what you do."
          ],
          "en.itani": [
            "The Desert-Arabs who remained behind will say to you, “Our belongings and our families have preoccupied us, so ask forgiveness for us.” They say with their tongues what is not in their hearts. Say, “Who can avail you anything against God, if He desires loss for you, or desires gain for you?” In fact, God is Informed of what you do."
          ],
          "en.maududi": [
            "(O Prophet), the bedouins who were left behind say to you: “We were occupied with our goods and families. So ask forgiveness for us.” They say with their tongues what is not in their hearts. Say to them: “Who can be of any avail to you against Allah if He should intend to cause you any harm or confer upon you any benefit?” Allah is well aware of all that you do."
          ],
          "en.mubarakpuri": [
            "Those of the bedouins who lagged behind will say to you: \"Our possessions and our families occupied us, so ask forgiveness for us.\" They say with their tongues what is not in their hearts. Say: \"Who then has any power at all (to intervene) on your behalf with Allah, if He intends you hurt or intends you benefit Nay, but Allah is Aware of what you do."
          ],
          "en.pickthall": [
            "Those of the wandering Arabs who were left behind will tell thee: Our possessions and our households occupied us, so ask forgiveness for us! They speak with their tongues that which is not in their hearts. Say: Who can avail you aught against Allah, if He intend you hurt or intend you profit? Nay, but Allah is ever Aware of what ye do."
          ],
          "en.qarai": [
            "The Bedouins who had stayed back [from joining the Prophet in his ‘umrah journey to Makkah] will tell you, ‘Our possessions and families kept us occupied. So plead [to Allah] for our forgiveness!’ They will say with their tongues what is not in their hearts. Say, ‘Whether He desires to cause you harm or desires to bring you benefit, who can be of any avail to you against Allah[’s will]? Indeed Allah is well aware of what you do.’"
          ],
          "en.qaribullah": [
            "The Bedouins who lagged behind will say to you: 'We were occupied with our possessions and families, so ask Allah to forgive us' But they say with theirtongues what they do not mean in their hearts. Say: 'Who can help you against Allah if it is that He wills harm for you or desires benefit for you? Allah is Aware ofwhat you do'"
          ],
          "en.sahih": [
            "Those who remained behind of the bedouins will say to you, \"Our properties and our families occupied us, so ask forgiveness for us.\" They say with their tongues what is not within their hearts. Say, \"Then who could prevent Allah at all if He intended for you harm or intended for you benefit? Rather, ever is Allah, with what you do, Acquainted."
          ],
          "en.sarwar": [
            "The bedouins who lag behind in taking part in the battle say to you, \"Ask forgiveness for us; we were busy with our property and household.\" They speak what is not in their hearts. (Muhammad), tell them, \"Who will help you against God, if He intends to harm you, who will prevent Him from benefitting you? In fact, God is Well Aware of whatever you do\"."
          ],
          "en.shakir": [
            "Those of the dwellers of the desert who were left behind will say to you: Our property and our families kept us busy, so ask forgiveness for us. They say with their tongues what is not in their hearts. Say: Then who can control anything for you from Allah if He intends to do you harm or if He intends to do you good; nay, Allah is Aware of what you do:"
          ],
          "en.transliteration": [
            "Sayaqoolu laka almukhallafoona mina alaAAr<u>a</u>bi shaghalatn<u>a</u> amw<u>a</u>lun<u>a</u> waahloon<u>a</u> fa<b>i</b>staghfir lan<u>a</u> yaqooloona bialsinatihim m<u>a</u> laysa fee quloobihim qul faman yamliku lakum mina All<u>a</u>hi shayan in ar<u>a</u>da bikum <u>d</u>arran aw ar<u>a</u>da bikum nafAAan bal k<u>a</u>na All<u>a</u>hu bim<u>a</u> taAAmaloona khabeer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Those desert Arabs who remained behind will say to you, \"Our belongings and our families kept us occupied, so ask forgiveness for us.\" They will say with their tongues what is not in their hearts. Say, \"Who then has any power at all [to intervene] on your behalf with God, if His will is to do you harm, or if He intends to do you good? Indeed, God is well aware of all that you do.\""
          ],
          "en.yusufali": [
            "The desert Arabs who lagged behind will say to thee: \"We were engaged in (looking after) our flocks and herds, and our families: do thou then ask forgiveness for us.\" They say with their tongues what is not in their hearts. Say: \"Who then has any power at all (to intervene) on your behalf with Allah, if His Will is to give you some loss or to give you some profit? But Allah is well acquainted with all that ye do."
          ],
          "fa.ansarian": [
            "کسانی از بادیه نشینان که از جنگ [با دشمن] تخلف کردند به زودی [از روی بهانه جویی] به تو می گویند: اموال و خانواده مان ما را به خود مشغول کردند [به این سبب نتوانستیم به جنگ آییم]؛ پس برای ما آمرزش بخواه. با زبان هایشان چیزی می گویند که در دل هایشان نیست. بگو: اگر خدا زیانی یا سودی را برای شما بخواهد چه کسی می تواند در برابر خدا از شما دفاع کند؟ بلکه خدا همواره به آنچه انجام می دهید، آگاه است."
          ],
          "fa.ayati": [
            "از اعراب باديه نشين، آنان كه از جنگ تخلف كرده‌اند به تو خواهند گفت: دارايى و كسان ما، ما را از جنگ باز داشتند؛ پس براى ما آمرزش بخواه. به زبان چيزى مى‌گويند كه در دلشان نيست. بگو: اگر خدا برايتان زيانى بخواهد يا سودى بخواهد، چه كسى مى‌تواند در برابر خدا آن را ديگرگون كند؟ بلكه اوست كه به كارهايتان آگاه است."
          ],
          "fa.bahrampour": [
            "به زودى اعراب باديه نشين كه [از جنگ‌] وامانده‌اند به تو خواهند گفت: اموال ما و كسانمان ما را [از همراهى با شما] مشغول داشت، پس براى ما آمرزش بخواه. به زبان‌هايشان چيزى را مى‌گويند كه در دل‌هايشان نيست. بگو: چه كسى در برابر خدا براى شما اختيار چيزى ر"
          ],
          "fa.fooladvand": [
            "برجاى‌ماندگان باديه‌نشين به زودى به تو خواهند گفت: «اموال ما و كسانمان ما را گرفتار كردند، براى ما آمرزش بخواه.» چيزى را كه در دلهايشان نيست بر زبان خويش مى‌رانند. بگو: «اگر خدا بخواهد به شما زيانى يا سودى برساند چه كسى در برابر او براى شما اختيار چيزى را دارد؟ بلكه [اين‌] خداست كه به آنچه مى‌كنيد همواره آگاه است."
          ],
          "fa.ghomshei": [
            "اعراب بادیه که (از حضور در جنگها و در سفر فتح مکّه تخلّف می‌ورزند و) باز نهاده می‌شوند خواهند گفت که ما را (محافظت) اهل بیت و اموالمان (از آمدن در رکابت) بازداشت، اینک از خدا بر گناه ما آمرزش طلب. (این مردم منافق) چیزی که هیچ به دل عقیده ندارند به زبان می‌آورند، به آنها بگو: اگر خدا اراده کند که ضرر یا نفعی به شما رساند آن کیست که خلاف آن کاری تواند کرد؟ بلکه خدا به هر چه می‌کنید آگاه است."
          ],
          "fa.khorramdel": [
            "باز پس‌ماندگان عربهای بادیه‌نشین (که در سفر حدیبیّه، پیغمبر و اصحاب را همراهی نکرده‌اند) خواهند گفت: اموال و خانواده، ما را به خود سرگرم و مشغول داشت. برای ما آمرزش بخواه. آنان با زبانهایشان چیزی را می‌گویند که در دلهایشان نمی‌باشد. (در دل نفاق دارند و بر زبان ایمان). بگو: چه کسی می‌تواند کمترین کمکی در برابر خدا به شما بکند، اگر بخواهد به شما زیانی یا سودی برساند؟ (آن چنان نیست که گمان می‌برید و می‌گوئید) بلکه خدا آگاه از هر آن چیزی است که انجام می‌دهید. [[«الْمُخَلَّفُونَ»: بازپس‌ماندگان. واپس‌زدگان. مراد کسانی است که ایشان از همراهی با پیغمبر و اصحاب در سفر حدیبیه سرباز زدند و بگمان خود مؤمنان را مغلوب و مقهور و بلکه مقتول دست قریش می‌دیدند و به بهانه‌های مختلف از خانه و کاشانه خود بیرون نیامدند. «الأعْرابِ»: بادیه‌نشینان (نگا: توبه / 90). «شَغَلَتْنَا»: مشغولمان داشت. ما را به خود سرگرم کرد. وقت فراغی برای ما باقی نگذاشت. «فَمَن یَمْلِکُ مِنَ اللهِ شَیْئاً»: (نگا: مائده / 17).]]"
          ],
          "fa.khorramshahi": [
            "به زودی واپس‌ماندگان اعرابی [/جهادگریزان بادیه‌نشین‌] به تو گویند اموال ما و خانواده‌هایمان ما را [از همراهی با شما] مشغول داشت، پس برای ما آمرزش بخواه، به زبانهایشان چیزی را می‌گویند که در دلهایشان نیست، بگو پس چه کسی در برابر خداوند -اگر در حق شما زیانی یا در حق شما سودی بخواهداز شما حمایت خواهد کرد؟ آری خداوند به آنچه می‌کنید آگاه است‌"
          ],
          "fa.makarem": [
            "بزودی متخلّفان از اعراب بادیه‌نشین (عذرتراشی کرده) می‌گویند: «(حفظ) اموال و خانواده‌های ما، ما را به خود مشغول داشت (و نتوانستیم در سفر حدیبیّه تو را همراهی کنیم)، برای ما طلب آمرزش کن!» آنها به زبان خود چیزی می‌گویند که در دل ندارند! بگو: «چه کسی می‌تواند در برابر خداوند از شما دفاع کند هرگاه زیانی برای شما بخواهد، و یا اگر نفعی اراده کند (مانع گردد)؟! و خداوند به همه کارهایی که انجام می‌دهید آگاه است!»"
          ],
          "fa.moezzi": [
            "زود است به تو گویند بازنشستگان از دشت‌نشینان که سرگرم داشت ما را خواسته‌های ما و خاندانهای ما پس آمرزش خواه برای ما گویند با زبانهای خویش آنچه را نیست در دلهاشان بگو پس که دارا گردد برای شما از خدا چیزی را اگر بخواهد به شما زیانی را یا بخواهد به شما سودی را بلکه خدا است بدانچه می‌کنید آگاه‌"
          ],
          "fa.mojtabavi": [
            "واپس‌ماندگان [از جنگ‌]، از باديه‌نشينان، خواهند گفت: مالها و زنان و فرزندانمان ما را سرگرم داشتند- گرفتار آنها بوديم و از جنگ باز مانديم- پس براى ما آمرزش بخواه. به زبانهاشان چيزى مى‌گويند كه در دلهاشان نيست. بگو: اگر خدا درباره شما زيانى خواهد يا سودى، كيست كه براى شما در برابر [خواست‌] خدا چيزى در توان داشته باشد؟ بلكه خداوند از آنچه مى‌كنيد آگاه است."
          ],
          "fa.sadeqi": [
            "سر باز زدگان از جنگ، از بادیه‌نشینان، به زودی به تو خواهند گفت: «اموالمان و کسانمان ما را (به خود) مشغول داشتند، پس برای ما پوشش [:بخشش] بخواه‌.» چیزی را که در دل‌هایشان نیست بر زبان‌هایشان می‌رانند. بگو: «پس اگر خدا بخواهد به شما زیانی یا سودی برساند چه کسی از (عذاب) خدا برای شما اختیار چیزی را دارد؟ بلکه (این) خداست که به آنچه می‌کنید همواره آگاه بوده است.»"
          ]
        }
      },
      {
        "index": 4595,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:48:12",
        "text": [
          "بَلْ‌ ظَنَنْتُمْ‌ أَنْ‌ لَنْ‌ يَنْقَلِبَ‌ الرَّسُولُ‌ وَ الْمُؤْمِنُونَ‌ إِلَى‌ أَهْلِيهِمْ‌ أَبَداً وَ زُيِّنَ‌ ذٰلِکَ‌ فِي‌ قُلُوبِکُمْ‌ وَ ظَنَنْتُمْ‌ ظَنَ‌ السَّوْءِ وَ کُنْتُمْ‌ قَوْماً بُوراً"
        ],
        "translations": {
          "en.ahmedali": [
            "In fact you imagined that the Prophet and the faithful would never come back home; and this seemed pleasing to your hearts, and you entertained evil thoughts. You are a people lost."
          ],
          "en.ahmedraza": [
            "“Rather you had assumed that the Noble Messenger and the Muslims will never return to their homes, and you thought this as good within your hearts, whereas you had thought evilly; and you were a people about to be ruined.”"
          ],
          "en.arberry": [
            "Nay, but you thought that the Messenger and the believers would never return to their families, and that was decked out fair in your hearts, and you thought evil thoughts, and you were a people corrupt.'"
          ],
          "en.daryabadi": [
            "Yea! ye imagined that the apostle and the believers would never return to their households, and that became fair-seeming in your hearts, and ye bethought an evil thought, and ye became a people doomed."
          ],
          "en.hilali": [
            "\"Nay, but you thought that the Messenger (SAW) and the believers would never return to their families; and that was made fair-seeming in their hearts, and you did think an evil thought and you became a useless people going for destruction.\""
          ],
          "en.itani": [
            "But you thought that the Messenger and the believers will never return to their families, and this seemed fine to your hearts; and you harbored evil thoughts, and were uncivilized people."
          ],
          "en.maududi": [
            "(But the truth is not what you say.) You had imagined that the Messenger and the believers would never return to their families, and this notion was embellished in your hearts. You harboured an evil thought, and you are an immensely evil people.”"
          ],
          "en.mubarakpuri": [
            "Nay, but you thought that the Messenger and the believers would never return to their families, and that was made fair seeming in your hearts, and you did think an evil thought and you became a Bura.\""
          ],
          "en.pickthall": [
            "Nay, but ye deemed that the messenger and the believers would never return to their own folk, and that was made fairseeming in your hearts, and ye did think an evil thought, and ye were worthless folk."
          ],
          "en.qarai": [
            "Rather, you thought that the Apostle and the faithful will not ever return to their folks, and that was made to seem decorous to your hearts; you entertained evil thoughts, and you were a ruined lot."
          ],
          "en.qaribullah": [
            "No, you thought that the Messenger and the believers would never return to their families, and this was made to seem fair in your hearts so you harbored evil thoughts, and so you are a destroyed nation."
          ],
          "en.sahih": [
            "But you thought that the Messenger and the believers would never return to their families, ever, and that was made pleasing in your hearts. And you assumed an assumption of evil and became a people ruined.\""
          ],
          "en.sarwar": [
            "You thought the Messenger and the believers would never ever return to their families and this attracted your hearts and caused you to develop evil suspicions. You are a wrong doing people."
          ],
          "en.shakir": [
            "Nay! you rather thought that the Apostle and the believers would not return to their families ever, and that was made fairseeming to your hearts and you thought an evil thought and you were a people doomed to perish."
          ],
          "en.transliteration": [
            "Bal <i><u>th</u></i>anantum an lan yanqaliba a<b>l</b>rrasoolu wa<b>a</b>lmuminoona il<u>a</u> ahleehim abadan wazuyyina <u>tha</u>lika fee quloobikum wa<i><u>th</u></i>anantum <i><u>th</u></i>anna a<b>l</b>ssawi wakuntum qawman boor<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "No. You thought that the Messenger and the believers would never return to their families; this prospect seemed pleasing to your hearts, and you conceived evil thoughts, and thus were doomed to perish."
          ],
          "en.yusufali": [
            "\"Nay, ye thought that the Messenger and the Believers would never return to their families; this seemed pleasing in your hearts, and ye conceived an evil thought, for ye are a people lost (in wickedness).\""
          ],
          "fa.ansarian": [
            "[تخلف شما از جنگ، ربطی به اموال و خانواده تان نداشت] بلکه پنداشتید پیامبر و مؤمنان هرگز به کسان خود باز نمی گردند، و این پندار باطل در دل هایتان آراسته شد، و گمان بد بردید [که خدا پیامبر و مؤمنان را یاری نخواهد کرد] و شما [به سبب این پندار باطل و گمان بد] قومی نابودشدنی هستید."
          ],
          "fa.ayati": [
            "يا مى‌پنداشتيد كه پيامبر و مؤمنان هرگز نزد كسانشان باز نخواهند گشت و دل به اين خوش كرده بوديد. پندار بدى داشته‌ايد و مردمى سزاوار هلاكت بوده‌ايد."
          ],
          "fa.bahrampour": [
            "بلكه پنداشتيد كه پيامبر و مؤمنان هرگز به خانمان خود برنخواهند گشت، و اين [پندار] در دل‌هايتان زينت يافت و گمان بد برديد و مردمى هلاكت زده شديد"
          ],
          "fa.fooladvand": [
            "[نه چنان بود،] بلكه پنداشتيد كه پيامبر و مؤمنان هرگز به خانمان خود بر نخواهند گشت، و اين [پندار] در دلهايتان نمودى خوش يافت، و گمان بد كرديد، و شما مردمى در خور هلاكت بوديد.»"
          ],
          "fa.ghomshei": [
            "بلکه شما پنداشتید که رسول و مؤمنان به او (همه کشته می‌شوند و) به سوی (وطن و) اهل بیت خود دیگر بر نخواهند گشت و این خیال در دل شما به خطا جلوه کرد و بسیار گمان بد و اندیشه باطلی کردید و مردمی در خور قهر و هلاکت بودید."
          ],
          "fa.khorramdel": [
            "بلکه شما گمان می‌بردید که پیغمبر و مؤمنان هرگز به سوی خانواده‌ی خود برنمی‌گردند (و قطعاً قتل عام خواهند شد! آری) این (پندار غلط و این وسوسه‌های شیطانی) در دلهایتان آراسته گشته بود. و گمانهای بدی می‌کردید و مردمان تباه و بیسودی بودید. [[«لَن یَنقَلِبَ»: هرگز برنمی‌گردد. «بُوراً»: (نگا: فرقان / 18)]]"
          ],
          "fa.khorramshahi": [
            "حق این است که گمان می‌کردید که پیامبر و مؤمنان هرگز به سوی خانواده‌هایشان باز نمی‌گردند، و این امر در دلهایتان آراسته جلوه داده شد، و بداندیشی کردید و قومی ورشکسته شدید"
          ],
          "fa.makarem": [
            "ولی شما گمان کردید پیامبر و مؤمنان هرگز به خانواده‌های خود بازنخواهند گشت؛ و این (پندار غلط) در دلهای شما زینت یافته بود و گمان بد کردید؛ و سرانجام (در دام شیطان افتادید و) هلاک شدید!"
          ],
          "fa.moezzi": [
            "بلکه پنداشتید که هرگز بازنگردند پیمبر و مؤمنان بسوی کسانشان هیچگاه و بیاراست این در دلهای شما و گمان بردید گمان بد را و شدید قومی تباه‌"
          ],
          "fa.mojtabavi": [
            "بلكه پنداشتيد كه پيامبر و مؤمنان هرگز به نزد كسان خويش باز نخواهند گشت و اين پندار در دلهاتان آراسته شد- به آن دلخوش شديد- و گمان بد برديد- كه پيامبر و ياران او هلاك شوند و دين اسلام برافتد- و مردمى هلاك‌شده گشتيد."
          ],
          "fa.sadeqi": [
            "«(نه چنان بوده.) بلکه پنداشتید که پیامبر و مؤمنان هرگز به خاندان خود برنخواهند گشت، و این (پندار) در دل‌هایتان نمودی زیبا یافته بود و گمان بد کردید. شما مردمی بس زیان‌بار بوده‌اید.»"
          ]
        }
      },
      {
        "index": 4596,
        "local_index": 13,
        "part_type": "Verse",
        "path": "/books/quran:48:13",
        "text": [
          "وَ مَنْ‌ لَمْ‌ يُؤْمِنْ‌ بِاللَّهِ‌ وَ رَسُولِهِ‌ فَإِنَّا أَعْتَدْنَا لِلْکَافِرِينَ‌ سَعِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "He who does not believe in God and His Apostle (should know) We have prepared for unbelievers a blazing fire.\""
          ],
          "en.ahmedraza": [
            "And whoever does not accept faith in Allah and His Noble Messenger – We have indeed kept prepared a blazing fire for disbelievers."
          ],
          "en.arberry": [
            "Whoso believes not in God and His Messenger, We have prepared for the unbelievers a Blaze."
          ],
          "en.daryabadi": [
            "And whosoever believeth not in Allah and His apostle then verily We have gotten ready for the infidels a Blaze."
          ],
          "en.hilali": [
            "And whosoever does not believe in Allah and His Messenger (Muhammad SAW), then verily, We have prepared for the disbelievers a blazing Fire."
          ],
          "en.itani": [
            "He who does not believe in God and His Messenger—We have prepared for the disbelievers a Blazing Fire."
          ],
          "en.maududi": [
            "As for those who do not believe in Allah and His Messenger, for such unbelievers We have prepared a Blazing Fire."
          ],
          "en.mubarakpuri": [
            "And whosoever does not believe in Allah and His Messenger, then verily, We have prepared for the disbelievers a blazing Fire."
          ],
          "en.pickthall": [
            "And so for him who believeth not in Allah and His messenger - Lo! We have prepared a flame for disbelievers."
          ],
          "en.qarai": [
            "Those who have no faith in Allah and His Apostle [should know that] We have prepared a blaze for the faithless."
          ],
          "en.qaribullah": [
            "But whosoever disbelieves in Allah and His Messenger; We have prepared a Blazing Fire for the unbelievers."
          ],
          "en.sahih": [
            "And whoever has not believed in Allah and His Messenger - then indeed, We have prepared for the disbelievers a Blaze."
          ],
          "en.sarwar": [
            "Those who do not believe in God and His Messenger should know that We have prepared hell for the disbelievers."
          ],
          "en.shakir": [
            "And whoever does not believe in Allah and His Apostle, then surely We have prepared burning fire for the unbelievers."
          ],
          "en.transliteration": [
            "Waman lam yumin bi<b>A</b>ll<u>a</u>hi warasoolihi fainn<u>a</u> aAAtadn<u>a</u> lilk<u>a</u>fireena saAAeer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "For those who deny the truth, who do not believe in God and His Messenger, We have prepared a blazing Fire."
          ],
          "en.yusufali": [
            "And if any believe not in Allah and His Messenger, We have prepared, for those who reject Allah, a Blazing Fire!"
          ],
          "fa.ansarian": [
            "و هر کس به خدا و پیامبرش ایمان نیاورد [زیانی به خدا و پیامبر نمی رساند]، ما برای کافران آتشی سوزان آماده کرده ایم."
          ],
          "fa.ayati": [
            "و هر كس به خدا و پيامبرش ايمان نياورده است، بداند كه براى كافران آتشى سوزان آماده كرده‌ايم."
          ],
          "fa.bahrampour": [
            "و هر كس به خدا و پيامبر او ايمان نياورد، [بداند كه‌] ما براى كافران آتشى سوزان آماده كرده‌ايم"
          ],
          "fa.fooladvand": [
            "و هر كس به خدا و پيامبر او ايمان نياورده است [بداند كه‌] ما براى كافران آتشى سوزان آماده كرده‌ايم."
          ],
          "fa.ghomshei": [
            "و هر که به خدا و رسول او ایمان نیاورد ما هم بر آن کافران عذاب آتش دوزخ را مهیّا ساخته‌ایم."
          ],
          "fa.khorramdel": [
            "کسانی که به خدا و پیغمبرش ایمان نداشته باشند (کافرند و) ما برای کافران آتش سوزان و فروزانی را تهیّه دیده‌ایم. [[«مَنْ»: این واژه مبتدا است و می‌تواند شرطیه یا موصوله باشد. اگر شرطیه باشد، جواب شرط محذوف است که (فَإِنَّهُ کَافِرٌ ... فَهُوَ کَافِرٌ) است. خبر مبتدا (فَإِنَّا أَعْتَدْنَا لِلْکَافِرِینَ سَعِیراً) است.]]"
          ],
          "fa.khorramshahi": [
            "و هر کس به خداوند و پیامبر او ایمان نیاورد [بداند که‌] ما برای کافران آتشی افروخته آماده ساخته‌ایم‌"
          ],
          "fa.makarem": [
            "آن کس که به خدا و پیامبرش ایمان نیاورده (سرنوشتش دوزخ است)، چرا که ما برای کافران آتش فروزان آماده کرده‌ایم!"
          ],
          "fa.moezzi": [
            "و آنکه ایمان نیارد به خدا و پیمبرش همانا آماده ساختیم برای کافران آتش سوزان را"
          ],
          "fa.mojtabavi": [
            "و هر كه به خدا و پيامبر او ايمان نياورده باشد، پس [بداند كه‌] ما براى كافران آتشى افروخته آماده كرده‌ايم."
          ],
          "fa.sadeqi": [
            "و هر کس به خدا و پیامبرش ایمان نیاورد، ما برای کافران آتشی سوزان آماده کرده‌ایم."
          ]
        }
      },
      {
        "index": 4597,
        "local_index": 14,
        "part_type": "Verse",
        "path": "/books/quran:48:14",
        "text": [
          "وَ لِلَّهِ‌ مُلْکُ‌ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ يَغْفِرُ لِمَنْ‌ يَشَاءُ وَ يُعَذِّبُ‌ مَنْ‌ يَشَاءُ وَ کَانَ‌ اللَّهُ‌ غَفُوراً رَحِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "To God belongs the kingdom of the heavens and the earth; He may forgive whosoever He please, and afflict whosoever He will. Yet God is forgiving and kind."
          ],
          "en.ahmedraza": [
            "And for Allah only is the kingship of the heavens and the earth; He may forgive whomever He wills, and punish whomever He wills; and Allah is Oft Forgiving, Most Merciful."
          ],
          "en.arberry": [
            "To God belongs the kingdom of the heavens and of the earth; whomsoever He will He forgives, and whomsoever He will He chastises; God is All-forgiving, All-compassionate."
          ],
          "en.daryabadi": [
            "And Allah's is the dominion of the heavens and the earth. He forgivEth whomsoever He Will and tormenteth whomsoever he will; and Allah is ever Forgiving, Merciful."
          ],
          "en.hilali": [
            "And to Allah belongs the sovereignty of the heavens and the earth, He forgives whom He wills, and punishes whom He wills. And Allah is Ever Oft-Forgiving, Most Merciful."
          ],
          "en.itani": [
            "To God belongs the kingdom of the heavens and the earth. He forgives whomever He wills, and He punishes whomever He wills. God is Forgiving and Merciful."
          ],
          "en.maududi": [
            "To Allah belongs the kingdom of the heavens and the earth. He forgives whom He pleases and chastises whom He pleases. He is Most Forgiving, Most Compassionate."
          ],
          "en.mubarakpuri": [
            "And to Allah belongs the sovereignty of the heavens and the earth. He forgives whom He wills, and punishes whom He wills. And Allah is Forgiving, Most Merciful."
          ],
          "en.pickthall": [
            "And Allah's is the Sovereignty of the heavens and the earth. He forgiveth whom He will, and punisheth whom He will. And Allah is ever Forgiving, Merciful."
          ],
          "en.qarai": [
            "To Allah belongs the kingdom of the heavens and the earth: He forgives whomever He wishes, and punishes whomever He wishes, and Allah is all-forgiving, all-merciful."
          ],
          "en.qaribullah": [
            "To Allah belongs the Kingdom of the heavens and the earth. He forgives whom He will and punishes whom He will. Allah is Forgiving and Merciful."
          ],
          "en.sahih": [
            "And to Allah belongs the dominion of the heavens and the earth. He forgives whom He wills and punishes whom He wills. And ever is Allah Forgiving and Merciful."
          ],
          "en.sarwar": [
            "To God belongs the kingdom of the heavens and the earth. He forgives or punishes whomever He wants. God is All-forgiving and All-merciful."
          ],
          "en.shakir": [
            "And Allah's is the kingdom. of the heavens and the earth; He forgives whom He pleases and punishes whom He pleases, and Allah is Forgiving, Merciful."
          ],
          "en.transliteration": [
            "Walill<u>a</u>hi mulku a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i yaghfiru liman yash<u>a</u>o wayuAAa<u>thth</u>ibu man yash<u>a</u>o wak<u>a</u>na All<u>a</u>hu ghafooran ra<u>h</u>eem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "To God belongs the kingdom of the heavens and the earth. He forgives whom He pleases, and punishes whom He pleases. And God is most forgiving and merciful."
          ],
          "en.yusufali": [
            "To Allah belongs the dominion of the heavens and the earth: He forgives whom He wills, and He punishes whom He wills: but Allah is Oft-Forgiving, Most Merciful."
          ],
          "fa.ansarian": [
            "و مالکیّت و فرمانروایی آسمان ها و زمین فقط در سیطره خداست، هر کس را بخواهد می آمرزد و هر کس را بخواهد عذاب می کند؛ و خدا همواره بسیار آمرزنده و مهربان است."
          ],
          "fa.ayati": [
            "از آنِ خداست فرمانروايى آسمانها و زمين. هر كه را بخواهد مى‌آمرزد و هر كه را بخواهد عذاب مى‌كند، و خدا آمرزنده و مهربان است."
          ],
          "fa.bahrampour": [
            "و فرمانروايى آسمان‌ها و زمين از آن خداست. هر كه را بخواهد مى‌بخشايد و هر كه را بخواهد عذاب مى‌كند، و خدا آمرزنده‌ى مهربان است"
          ],
          "fa.fooladvand": [
            "و فرمانروايى آسمانها و زمين از آن خداست: هر كه را بخواهد مى‌بخشايد و هر كه را بخواهد عذاب مى‌كند، و خدا همواره آمرزنده مهربان است."
          ],
          "fa.ghomshei": [
            "و ملک آسمانها و زمین همه خاصّ خداست، او هر که را بخواهد می‌بخشد و هر که را بخواهد عذاب می‌کند و خدا بسیار آمرزنده و مهربان است."
          ],
          "fa.khorramdel": [
            "مملکت و شاهی آسمانها و زمین از آن خدا است. هر که را بخواهد می‌بخشد و هر که را که بخواهد عذاب می‌دهد. خداوند دارای مغفرت عظیم و صاحب مهر فراخ است. [[«ِللهِ مُلْکُ ...»: (نگا: آل‌عمران / 189، مائده / 17 و 18 و 120).]]"
          ],
          "fa.khorramshahi": [
            "و فرمانروایی آسمانها و زمین خداوند راست، که هر کس را بخواهد می‌آمرزد و هر کس را بخواهد عذاب می‌کند، و خداوند آمرزگار مهربان است‌"
          ],
          "fa.makarem": [
            "مالکیت و حاکمیت آسمانها و زمین از آن خداست؛ هر کس را بخواهد (و شایسته بداند) می‌بخشد، و هر کس را بخواهد مجازات می‌کند؛ و خداوند آمرزنده و رحیم است."
          ],
          "fa.moezzi": [
            "خدای را است پادشاهی آسمانها و زمین بیامرزد برای هر که خواهد و عذاب کند هر که را خواهد و خدا است آمرزنده مهربان‌"
          ],
          "fa.mojtabavi": [
            "و خداى راست پادشاهى آسمانها و زمين هر كه را خواهد- شايسته بيند- بيامرزد و هر كه را خواهد- سزاوار بيند- عذاب كند. و خدا آمرزگار و مهربان است."
          ],
          "fa.sadeqi": [
            "و فرمانروایی آسمان‌ها و زمین تنها از خداست. برای هر که بخواهد می‌پوشد و هر که را بخواهد عذاب می‌کند و خدا بی‌گمان بسی پوشنده‌ی رحمتگر بر ویژگان است."
          ]
        }
      },
      {
        "index": 4598,
        "local_index": 15,
        "part_type": "Verse",
        "path": "/books/quran:48:15",
        "text": [
          "سَيَقُولُ‌ الْمُخَلَّفُونَ‌ إِذَا انْطَلَقْتُمْ‌ إِلَى‌ مَغَانِمَ‌ لِتَأْخُذُوهَا ذَرُونَا نَتَّبِعْکُمْ‌ يُرِيدُونَ‌ أَنْ‌ يُبَدِّلُوا کَلاَمَ‌ اللَّهِ‌ قُلْ‌ لَنْ‌ تَتَّبِعُونَا کَذٰلِکُمْ‌ قَالَ‌ اللَّهُ‌ مِنْ‌ قَبْلُ‌ فَسَيَقُولُونَ‌ بَلْ‌ تَحْسُدُونَنَا بَلْ‌ کَانُوا لاَ يَفْقَهُونَ‌ إِلاَّ قَلِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "Those who had stayed behind will say: \"When you depart for taking the spoils, allow us to follow you.\" They wish to change the word of God. Tell them: \"You will not follow us. That is what God has already said before.\" They will say: \"You are envious of our gain.\" The fact is they understand but little."
          ],
          "en.ahmedraza": [
            "Those who had stayed behind will now say, “When you go to receive the war booty, let us also go with you”; they wish to change the Words of Allah; say “You shall never come with us – this is already decreed by Allah”; so they will now say, “But rather you envy us”; in fact they never understood except a little."
          ],
          "en.arberry": [
            "The Bedouins who were left behind will say, when you set forth after spoils, to take them, 'Let us follow you,' desiring to change God's words. Say: 'You shall not follow us; so God said before.' Then they will say, 'Nay, but you' are jealous of us.' Nay, but they have not understood except a little."
          ],
          "en.daryabadi": [
            "Those who lagged behind will presently, When ye march forth to take spoils, leave us, we shall follow say you. They intend to change the word of Allah. Say thou: ye shall by no means follow us; thus hath Allah said afore. Then they will say: Aye! ye envy us. Aye! little it is they are wont to understand."
          ],
          "en.hilali": [
            "Those who lagged behind will say, when you set forth to take the spoils, \"Allow us to follow you,\" They want to change Allah's Words. Say: \"You shall not follow us; thus Allah has said beforehand.\" Then they will say: \"Nay, you envy us.\" Nay, but they understand not except a little."
          ],
          "en.itani": [
            "Those who lagged behind will say when you depart to collect the gains, “Let us follow you.” They want to change the Word of God. Say, “You will not follow us; God has said so before.” Then they will say, “But you are jealous of us.” In fact, they understand only a little."
          ],
          "en.maududi": [
            "When you press forth for the spoils, those who were left behind will say: “Let us accompany you.” They want to change the command of Allah. Say to them (in clear words): “You shall not accompany us. Thus has Allah already said.” Then they will say: “Nay; but you are jealous of us.” The truth is that they understand little."
          ],
          "en.mubarakpuri": [
            "Those who lagged behind will say, when you set forth to take the spoils, \"Allow us to follow you.\" They want to change Allah's Words. Say: \"You shall not follow us; thus Allah has said beforehand.\" Then they will say: \"Nay, you envy us.\" Nay, but they understand not except a little."
          ],
          "en.pickthall": [
            "Those who were left behind will say, when ye set forth to capture booty: Let us go with you. They fain would change the verdict of Allah. Say (unto them, O Muhammad): Ye shall not go with us. Thus hath Allah said beforehand. Then they will say: Ye are envious of us. Nay, but they understand not, save a little."
          ],
          "en.qarai": [
            "[In the near future] when you will set out to capture booty, those who stayed behind [in this journey] will say, : ‘Let us follow you.’ They desire to change the word of Allah. Say, ‘You will never follow us! Allah has said thus beforehand.’ Then they will say, ‘You are envious of us.’ Indeed, they do not understand but a little."
          ],
          "en.qaribullah": [
            "When you set forth to take the spoils, those Bedouins who lagged behind will say: 'Let us follow you' They hope to change the Words of Allah. Say: 'Youshall not follow us. Allah has said so before' They will reply: 'No, you are envious of us' Rather, they have only understood a little!"
          ],
          "en.sahih": [
            "Those who remained behind will say when you set out toward the war booty to take it, \"Let us follow you.\" They wish to change the words of Allah. Say, \"Never will you follow us. Thus did Allah say before.\" So they will say, \"Rather, you envy us.\" But [in fact] they were not understanding except a little."
          ],
          "en.sarwar": [
            "The laggardly Bedouins will say, \"When you leave to collect the spoils, let us follow you.\" They want to alter the command of God (that only the participating believers are entitled to such benefit). Tell them, \"You can never follow us for such a purpose. God has said before and He will say again (what type of people you are). In fact, you are jealous of us.\" The truth is that they understand very little."
          ],
          "en.shakir": [
            "Those who are left behind will say when you set forth for the gaining of acquisitions: Allow us (that) we may follow you. They desire to change the world of Allah. Say: By no means shall you follow us; thus did Allah say before. But they will say: Nay! you are jealous of us. Nay! they do not understand but a little."
          ],
          "en.transliteration": [
            "Sayaqoolu almukhallafoona i<u>tha</u> in<u>t</u>alaqtum il<u>a</u> magh<u>a</u>nima litakhu<u>th</u>ooh<u>a</u> <u>th</u>aroon<u>a</u> nattabiAAkum yureedoona an yubaddiloo kal<u>a</u>ma All<u>a</u>hi qul lan tattabiAAoon<u>a</u> ka<u>tha</u>likum q<u>a</u>la All<u>a</u>hu min qablu fasayaqooloona bal ta<u>h</u>sudoonan<u>a</u> bal k<u>a</u>noo l<u>a</u> yafqahoona ill<u>a</u> qaleel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "When you [believers] set off to gather the spoils, those that stayed behind will say, \"Let us come with you.\" They want to change God's word, but tell them, \"You shall not follow us. God has declared this beforehand.\" Then they will say, \"You are jealous of us.\" But how little they understand!"
          ],
          "en.yusufali": [
            "Those who lagged behind (will say), when ye (are free to) march and take booty (in war): \"Permit us to follow you.\" They wish to change Allah's decree: Say: \"Not thus will ye follow us: Allah has already declared (this) beforehand\": then they will say, \"But ye are jealous of us.\" Nay, but little do they understand (such things)."
          ],
          "fa.ansarian": [
            "هنگامی که شما برای به دست آوردن غنایمی روانه [میدان جنگی] می شوید، متخلفان [از جنگ حدیبیه] به زودی خواهند گفت: بگذارید ما هم به دنبال شما بیاییم. [این سبک مغزان سودجو] می خواهند وعده خدا را [که به مؤمنان وعده پیروزی و غنیمت داد و به منافقان وعده محرومیت از غنیمت و رحمت داده است] تغییر دهند. بگو: هرگز دنبال ما نخواهید آمد؛ این گونه خدا پیش از این [درباره شما] فرموده است. اما [این گروه بی شرم] به زودی خواهند گفت: شما نسبت به ما حسد می ورزید، [چنین نیست] بلکه آنان جز اندکی نمی فهمند."
          ],
          "fa.ayati": [
            "چون براى گرفتن غنايم به راه بيفتيد، آنان كه از جنگ تخلف ورزيده‌اند خواهند گفت: بگذاريد تا ما هم از پى شما بياييم. مى‌خواهند سخن خدا را ديگرگون كنند. بگو: شما هرگز از پى ما نخواهيد آمد. خدا از پيش چنين گفته است. سپس خواهند گفت: بلكه بر ما حسد مى‌بريد؟ نه، اينان جز اندكى نمى‌فهمند."
          ],
          "fa.bahrampour": [
            "به زودى واماندگان، هنگامى كه شما به طرف غنايم [خيبر] حركت كنيد تا آن را به تصرف در آوريد، به شما خواهند گفت: بگذاريد ما [هم‌] به دنبال شما بياييم. [اين گونه‌] مى‌خواهند سخن خدا را تغيير دهند. بگو: هرگز از پى ما نخواهيد آمد. خدا از پيش چنين گفته است."
          ],
          "fa.fooladvand": [
            "چون به [قصد] گرفتن غنايم روانه شديد، به زودى برجاى‌ماندگان خواهند گفت: «بگذاريد ما [هم‌] به دنبال شما بياييم.» [اين گونه‌] مى‌خواهند دستور خدا را دگرگون كنند. بگو: «هرگز از پى ما نخواهيد آمد. آرى، خدا از پيش در باره شما چنين فرموده.» پس به زودى خواهند گفت: «[نه،] بلكه بر ما رشگ مى‌بريد.» [نه چنين است‌] بلكه جز اندكى درنمى‌يابند."
          ],
          "fa.ghomshei": [
            "کسانی که (در حدیبیّه تخلّف کردند و) باز نهاده شدند و همراهی با شما ننمودند باز چون برای (فتح خیبر و) گرفتن غنایم حرکت کنید خواهند گفت: بگذارید تا ما هم از شما تبعیت کنیم (و همراه شما بیاییم). غرضشان این است که سخن خدا را (که فرمود غنایم خیبر را تنها حاضران حدیبیّه خواهند گرفت) تغییر دهند. بگو: شما به حقیقت هرگز ما را پیروی نمی‌کنید، خدا از این پیش درباره شما چنین خبر داده. باز (آن مردم بی وفای بد عهد) خواهند گفت: (چنین نیست) بلکه شما با ما حسد می‌ورزید. بلکه ایشان جز عدّه قلیلی همه جاهل و نادانند."
          ],
          "fa.khorramdel": [
            "بازپس‌ماندگان، هنگامی که برای به دست آوردن غنائمی (که خدا به شما داده است) بیرون رفتید، خواهند گفت: بگذارید ما هم همراه شما شویم (و در این جهاد شرکت کنیم). آنان می‌خواهند سخن خدا را دگرگون کنند! (خدا وعده‌ی غنائم خیبر را تنها به شرکت‌کنندگان سفر حدیبیّه اختصاص داده است و بس). بگو: شما هرگز همراه ما نخواهید شد. خدایتان پیش از این (مراجعت به مدینه) چنین فرموده است. خواهند گفت: (این را خدا نگفته است و) بلکه شما نسبت به ما حسد می‌ورزید (و نمی‌گذارید از چنین غنائم نفیس و بی‌دردسری بهره ببریم. چنین نیست که گمان می‌برند) بلکه (از قانونگذاری خدا) جز مقدار اندکی را فهم نکرده‌اند. [[«إِذا»: ظرف ماقبل خود است؛ نه شرط مابعد (نگا: روح المعانی). «مَغَانِمَ»: مراد غنائم جنگ خیبر است که قبل از مراجعت به مدینه به مؤمنان وعده داده شده بود. «کَلامَ اللهِ»: مراد وعده مذکور در آیه‌های 18 و 19 است. «بَلْ کَانُوا لا یَفْقَهُونَ إِلاّ قَلِیلاً»: درباره امور دین چندان نمی‌فهمند. بلکه معلومات ایشان مربوط به ظواهری از امور دنیوی است (نگا: روم / 7).]]"
          ],
          "fa.khorramshahi": [
            "چون به سوی غنایم راه برید که آن را به دست آورید، زودا که واپس ماندگان گویند ما را بگذارید که از شما پیروی کنیم می‌خواهند حکم الهی را دگرگون کنند، بگو هرگز از ما پیروی نخواهید کرد، خداوند پیشاپیش درباره شما چنین گفته است، زودا که [در پاسخ شما] گویند خیر، شما به ما رشک می‌برید، حق این است جز اندکی در نمی‌یابند"
          ],
          "fa.makarem": [
            "هنگامی که شما برای به دست آوردن غنایمی حرکت کنید، متخلّفان (حدیبیّه) می‌گویند: «بگذارید ما هم در پی شما بیائیم، آنها می‌خواهند کلام خدا را تغییر دهند؛ بگو: «هرگز نباید بدنبال ما بیایید؛ این گونه خداوند از قبل گفته است!» آنها به زودی می‌گویند: «شما نسبت به ما حسد می‌ورزید!» ولی آنها جز اندکی نمی‌فهمند!"
          ],
          "fa.moezzi": [
            "زود است گویند بازنشستگان گاهی که روان شوید بسوی برده‌هائی که به چنگ زرید بگذارید از پی شما آئیم خواهند دگرگون کنند سخن خدا را بگو از پی ما نیائید هرگز بدینسان گفته است خدا از پیش زود است گویند بلکه شما به ما حسادت ورزید بلکه آنان درنیابند جز اندکی را"
          ],
          "fa.mojtabavi": [
            "واپس‌ماندگان، چون به سوى غنيمتها برويد تا آنها را بگيريد- در جنگ خيبر-، خواهند گفت: بگذاريد تا از پى شما بياييم. مى‌خواهند سخن خداى را دگرگون سازند. بگو: هرگز از پى ما نخواهيد آمد، خدا از پيش [درباره شما] چنين فرموده است. پس خواهند گفت: بلكه بر ما حسد مى‌بريد. [نه،] بلكه جز اندكى نمى‌فهمند."
          ],
          "fa.sadeqi": [
            "هنگامی که به (قصد) گرفتن غنایم روانه شدید، به زودی بر جای‌ماندگان متخلف خواهند گفت: «بگذارید ما (هم) به دنبال شما بیاییم‌.» (این‌گونه) می‌خواهند کلام خدا را تبدیل کنند. بگو: «هرگز از پی ما نخواهید آمد. خدا از پیش درباره‌ی شما چنین فرمود.» پس به زودی خواهند گفت: « (نه،) بلکه بر ما رشک می‌برید.» (نه چنین است.) بلکه جز اندکی در نمی‌یابند."
          ]
        }
      },
      {
        "index": 4599,
        "local_index": 16,
        "part_type": "Verse",
        "path": "/books/quran:48:16",
        "text": [
          "قُلْ‌ لِلْمُخَلَّفِينَ‌ مِنَ‌ الْأَعْرَابِ‌ سَتُدْعَوْنَ‌ إِلَى‌ قَوْمٍ‌ أُولِي‌ بَأْسٍ‌ شَدِيدٍ تُقَاتِلُونَهُمْ‌ أَوْ يُسْلِمُونَ‌ فَإِنْ‌ تُطِيعُوا يُؤْتِکُمُ‌ اللَّهُ‌ أَجْراً حَسَناً وَ إِنْ‌ تَتَوَلَّوْا کَمَا تَوَلَّيْتُمْ‌ مِنْ‌ قَبْلُ‌ يُعَذِّبْکُمْ‌ عَذَاباً أَلِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "Say to the desert Arabs who had stayed behind: \"You will be called against a formidable people. You will fight them till they surrender. If you obey, then He will give you a good reward; but if you turn back, as you had done before, He will punish you with a grievous affliction.\""
          ],
          "en.ahmedraza": [
            "Say to the ignorant who stayed behind, “You will soon be called against a nation of great military strength – to fight against them or that they become Muslims; so if you obey, Allah will give you an excellent reward; and if you turn away, the way you had turned away before, He will mete out a painful punishment to you.”"
          ],
          "en.arberry": [
            "Say to the Bedouins who were left behind: 'You shall be called against a people possessed of great might' to fight them, or they surrender. If you obey, God will give you a goodly wage; but if you turn your backs, as you turned your backs before, He will chastise you with a painful chastisement.'"
          ],
          "en.daryabadi": [
            "Say thou Unto those who lagged behind of the desert Arabs: surely ye shall be summoned against a people endued with exceeding violence then ye will fight them or they will submit. Then if ye obey, Allah will give ye a goodly hire; but if ye turn away even as ye turned away aforetime. He will torment you with a torment afflictive."
          ],
          "en.hilali": [
            "Say (O Muhammad SAW) to the bedouins who lagged behind: \"You shall be called to fight against a people given to great warfare, then you shall fight them, or they shall surrender. Then if you obey, Allah will give you a fair reward, but if you turn away as you did turn away before, He will punish you with a painful torment.\""
          ],
          "en.itani": [
            "Say to the Desert-Arabs who lagged behind, “You will be called against a people of great might; you will fight them, unless they submit. If you obey, God will give you a fine reward. But if you turn away, as you turned away before, He will punish you with a painful punishment.”"
          ],
          "en.maududi": [
            "Say to the bedouins who were left behind: “You will be called against those who possess great might and be asked to fight against them unless they surrender. If you obey (the command to fight), Allah will bestow upon you a goodly reward. But if you turn away, as you turned away before, He shall inflict upon you a grievous chastisement.”"
          ],
          "en.mubarakpuri": [
            "Say to the bedouins who lagged behind: \"You shall be called to fight against a people given to great warfare, then you shall fight them, or they shall surrender. Then if you obey, Allah will give you a fair reward; but if you turn away as you did turn away before, He will punish you with a painful torment.\""
          ],
          "en.pickthall": [
            "Say unto those of the wandering Arabs who were left behind: Ye will be called against a folk of mighty prowess, to fight them until they surrender; and if ye obey, Allah will give you a fair reward; but if ye turn away as ye did turn away before, He will punish you with a painful doom."
          ],
          "en.qarai": [
            "Say to the Bedouins who stayed behind, ‘[Later on] you will be called against a people of a great might: they will either embrace Islam, or you will fight them. So if you obey, Allah will give you a good reward; but if you turn away like you turned away before, He will punish you with a painful punishment.’"
          ],
          "en.qaribullah": [
            "Say to the Arabs who lagged behind: 'You shall be called upon to fight a mighty nation, unless they embrace Islam. If you are obedient you shall receive agood wage from Allah. But, if you turn away, as you turned your backs before, He will punish you with a painful punishment'"
          ],
          "en.sahih": [
            "Say to those who remained behind of the bedouins, \"You will be called to [face] a people of great military might; you may fight them, or they will submit. So if you obey, Allah will give you a good reward; but if you turn away as you turned away before, He will punish you with a painful punishment.\""
          ],
          "en.sarwar": [
            "Tell the laggardly Bedouins, \"You will be called to face strong people whom you will fight right to the end or who will submit to you. If you obey the Messenger, God will give you a good reward. But if you turn away as you did before, God will make you suffer a painful torment."
          ],
          "en.shakir": [
            "Say to those of the dwellers of the desert who were left behind: You shall soon be invited (to fight) against a people possessing mighty prowess; you will fight against them until they submit; then if you obey, Allah will grant you a good reward; and if you turn back as you turned back before, He will punish you with a painful punishment."
          ],
          "en.transliteration": [
            "Qul lilmukhallafeena mina alaAAr<u>a</u>bi satudAAawna il<u>a</u> qawmin olee basin shadeedin tuq<u>a</u>tiloonahum aw yuslimoona fain tu<u>t</u>eeAAoo yutikumu All<u>a</u>hu ajran <u>h</u>asanan wain tatawallaw kam<u>a</u> tawallaytum min qablu yuAAa<u>thth</u>ibkum AAa<u>tha</u>ban aleem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Say to the desert Arabs who stayed behind, \"You shall be called against a mighty people; then shall you fight, unless they submit. Then if you prove obedient, God will grant you a good reward, but if You turn back as you did before, He will inflict on you a painful punishment --"
          ],
          "en.yusufali": [
            "Say to the desert Arabs who lagged behind: \"Ye shall be summoned (to fight) against a people given to vehement war: then shall ye fight, or they shall submit. Then if ye show obedience, Allah will grant you a goodly reward, but if ye turn back as ye did before, He will punish you with a grievous Penalty.\""
          ],
          "fa.ansarian": [
            "به متخلفانِ بادیه نشین بگو: به زودی به سوی گروهی سرسخت و نیرومند دعوت خواهید شد که با آنان بجنگید، یا آنکه اسلام آورند؛ پس اگر اطاعت کنید خدا پاداش نیکی به شما خواهد داد، و اگر روی برگردانید، همان گونه که پیش از این روی گرداندید، شما را به عذابی دردناک عذاب خواهد کرد."
          ],
          "fa.ayati": [
            "به اعراب باديه‌نشين كه از جنگ تخلف ورزيده‌اند، بگو: به زودى براى جنگ با مردمى سخت نيرومند فراخوانده مى‌شويد كه با آنها بجنگيد يا مسلمان شوند. اگر اطاعت كنيد خدايتان پاداشى نيكو خواهد داد و اگر، همچنان كه پيش از اين سر برتافته‌ايد، سر برتابيد شما را به عذابى دردآور عذاب مى‌كند."
          ],
          "fa.bahrampour": [
            "به واماندگان باديه نشين بگو: به زودى به سوى قومى بسيار زورمند فراخوانده مى‌شويد كه يا با آنها مى‌جنگيد يا مسلمان مى‌شوند. پس اگر اطاعت كنيد، خدا شما را پاداشى نيكو مى‌بخشد و اگر روى بگردانيد، چنان كه قبلا نافرمانى كرديد، شما را به عذاب دردناكى عذاب م"
          ],
          "fa.fooladvand": [
            "به برجاى‌ماندگان باديه‌نشين بگو: «به زودى به سوى قومى سخت زورمند دعوت خواهيد شد كه با آنان بجنگيد يا اسلام آورند. پس اگر فرمان بريد خدا شما را پاداش نيك مى‌بخشد، و اگر -همچنان كه پيشتر پشت كرديد- [باز هم‌] روى بگردانيد، شما را به عذابى پردرد معذب مى‌دارد.»"
          ],
          "fa.ghomshei": [
            "با اعرابی که (از جنگ) باز نهاده شدند بگو: (اگر به حقیقت قصد متابعت دارید) به زودی برای جنگ با قومی شجاع و نیرومند (فارس و روم) دعوت می‌شوید که با آنها یا جنگ و مبارزه کنید یا آنکه مسلمان شوند. اگر اطاعت کردید خدا به شما اجر نیکو خواهد داد و اگر نافرمانی کنید چنانکه از این پیش (در حدیبیّه) مخالفت کردید خدا شما را به عذابی دردناک معذّب خواهد کرد."
          ],
          "fa.khorramdel": [
            "به بازپس‌ماندگان عربهای بادیه‌نشین بگو: از شما دعوت خواهد شد که به سوی قومی جنگجو و پرقدرت بیرون روید. با آنان پیکار می‌کنید یا این که مسلمان می‌شوند. (یعنی دو راه بیشتر در پیش نخواهند داشت: رزم با مسلمانان، یا پذیرش دین آنان). اگر فرمانبرداری کنید، خداوند پاداش خوبی به شما خواهد داد، و اگر سرپیچی کنید، همان گونه که قبلاً نیز سرپیچی کرده‌اید، خداوند با عذاب دردناکی عذابتان خواهد داد. [[«قَوْمٍ»: مراد بنوحنیفه، قوم مُسَیْلمه کذّاب، یعنی اهل رِدّه است که چهار سال بعد از نزول این آیات در زمان ابوبکر میان ایشان و مؤمنان جنگ سختی درگرفت. (نگا: التفسیر القرآنی للقرآن). «أُوْلِی بَأْسٍ»: (نگا: اسراء / 5، نمل / 33). «تُقَاتِلُونَهُمْ أَوْ یُسْلِمُونَ»: با آنان می‌جنگید یا مسلمان می‌شوند. یعنی باید با آنان بجنگید تا اسلام را می‌پذیرند. راه دیگری از ایشان پذیرفته نمی‌گردد.]]"
          ],
          "fa.khorramshahi": [
            "به واپس ماندگان اعرابی [/جهادگریزان بادیه‌نشین‌] بگو زودا که به سوی قومی ستیزه‌جوی سهمگین خوانده شوید که با ایشان کارزار کنید، یا آنکه آنان مسلمان شوند، پس اگر اطاعت کنید، خداوند پاداشی نیکو به شما بدهد و اگر روی برتابید، چنانکه پیشتر هم روی برتافته بودید، به عذابی دردناک عذابتان کند"
          ],
          "fa.makarem": [
            "به متخلّفان از اعراب بگو: «بزودی از شما دعوت می‌شود که بسوی قومی نیرومند و جنگجو بروید و با آنها پیکار کنید تا اسلام بیاورند؛ اگر اطاعت کنید، خداوند پاداش نیکی به شما می‌دهد؛ و اگر سرپیچی نمایید -همان گونه که در گذشته نیز سرپیچی کردید- شما را با عذاب دردناکی کیفر می‌دهد!»"
          ],
          "fa.moezzi": [
            "بگو به بازنشستگان از دشت‌نشینان زود است خوانده می‌شوید بسوی گروهی دارنده نیرویی سخت پیکارشان کنید یا (تا) اسلام آرند پس اگر فرمانبرداری کنید بدهد شما را خدا پاداش نیک و اگر پشت کنید بدانسان که پشت کردید از پیش عذاب کند شما را عذابی دردناک‌"
          ],
          "fa.mojtabavi": [
            "واپس‌ماندگان، از باديه‌نشينان، را بگو: بزودى به جنگ با مردمى سخت زورمند جنگاور فرا خوانده مى‌شويد كه با آنها كارزار كنيد يا آنكه مسلمان شوند. پس اگر فرمان بريد خدا شما را مزدى نيك بدهد، و اگر رويگردان شويد چنانكه پيش از اين رويگردان شديد شما را به عذابى دردناك عذاب كند."
          ],
          "fa.sadeqi": [
            "به بر جای ماندگان متخلف‌، از بادیه‌نشینان، بگو: «زودا سوی قومی (رزمنده‌ی) سخت زورمند دعوت خواهید شد (که) یا با آنان بجنگید یا اسلام آورند. پس اگر فرمان ببرید خدا شما را پاداشی نیک می‌دهد و اگر - همچنان که از پیش‌، پشت کردید - (باز هم) روی بگردانید، شما را به عذابی پر درد معذّب می‌دارد.»"
          ]
        }
      },
      {
        "index": 4600,
        "local_index": 17,
        "part_type": "Verse",
        "path": "/books/quran:48:17",
        "text": [
          "لَيْسَ‌ عَلَى‌ الْأَعْمَى‌ حَرَجٌ‌ وَ لاَ عَلَى‌ الْأَعْرَجِ‌ حَرَجٌ‌ وَ لاَ عَلَى‌ الْمَرِيضِ‌ حَرَجٌ‌ وَ مَنْ‌ يُطِعِ‌ اللَّهَ‌ وَ رَسُولَهُ‌ يُدْخِلْهُ‌ جَنَّاتٍ‌ تَجْرِي‌ مِنْ‌ تَحْتِهَا الْأَنْهَارُ وَ مَنْ‌ يَتَوَلَ‌ يُعَذِّبْهُ‌ عَذَاباً أَلِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "It is not binding on the blind, the lame or the sick (to follow this command); but those who obey God and His Apostle will be admitted by God to gardens with running streams; but those who turn back will suffer a painful doom."
          ],
          "en.ahmedraza": [
            "There is no reproach upon the blind, nor reproach against the lame, nor reproach upon the sick; and whoever obeys Allah and His Noble Messenger – Allah will admit him into Gardens beneath which rivers flow; and whoever turns away – He will mete out a painful punishment to him."
          ],
          "en.arberry": [
            "There is no fault in the blind, and there is no fault in the lame, and there is no fault in the sick. And whosoever obeys God and His Messenger, He will admit him into gardens underneath which rivers flow; but whosoever turns his back, him He will chastise with a painful chastisement."
          ],
          "en.daryabadi": [
            "There is no blame upon the blind, nor is there blame upon the lame, nor is there blame upon the sick. And whosoever obeyeth Allah and His apostle, He will cause him enter Gardens where under rivers flow; and whosoever turneth away, him He shall torment with a torment afflictive."
          ],
          "en.hilali": [
            "No blame or sin is there upon the blind, nor is there blame or sin upon the lame, nor is there blame or sin upon the sick (that they go not forth to war). And whosoever obeys Allah and His Messenger (Muhammad SAW), He will admit him to Gardens beneath which rivers flow (Paradise); and whosoever turns back, He will punish him with a painful torment."
          ],
          "en.itani": [
            "There is no blame on the blind, nor any blame on the lame, nor any blame on the sick. Whoever obeys God and His Messenger—He will admit him into gardens beneath which rivers flow; but whoever turns away—He will punish him with a painful punishment."
          ],
          "en.maududi": [
            "There is no blame on the blind, nor on the lame, nor on the sick (if they do not go forth to fight). Allah will admit those who obey Allah and His Messenger to the Gardens beneath which rivers flow and will inflict a grievous chastisement on those who turn away."
          ],
          "en.mubarakpuri": [
            "No blame or sin is there upon the blind, nor is there sin upon the lame, nor is there sin upon the sick. And whosoever obeys Allah and His Messenger, He will admit him to Gardens beneath which rivers flow; and whosoever turns back, He will punish him with a painful torment."
          ],
          "en.pickthall": [
            "There is no blame for the blind, nor is there blame for the lame, nor is there blame for the sick (that they go not forth to war). And whoso obeyeth Allah and His messenger, He will make him enter Gardens underneath which rivers flow; and whoso turneth back, him will He punish with a painful doom."
          ],
          "en.qarai": [
            "There is no blame on the blind, nor is there any blame on the lame, nor is there blame on the sick [if they are unable to go out with the troops to face the enemies]; and whoever obeys Allah and His Apostle, He will admit him into gardens with streams running in them, and whoever refuses to comply, He will punish him with a painful punishment."
          ],
          "en.qaribullah": [
            "There is no fault in the blind, or the lame, or the sick. He who obeys Allah and His Messenger He shall admit him to Gardens underneath which rivers flow; but he who turns away shall be punished with a painful punishment."
          ],
          "en.sahih": [
            "There is not upon the blind any guilt or upon the lame any guilt or upon the ill any guilt [for remaining behind]. And whoever obeys Allah and His Messenger - He will admit him to gardens beneath which rivers flow; but whoever turns away - He will punish him with a painful punishment."
          ],
          "en.sarwar": [
            "It is not an offense for the blind, the lame, or the sick not to take part in the battle. Whoever obeys God and His Messenger will be admitted to the gardens wherein streams flow. God will make whoever turns away suffer a painful torment."
          ],
          "en.shakir": [
            "There is no harm in the blind, nor is there any harm in the lame, nor is there any harm in the sick (if they do not go forth); and whoever obeys Allah and His Apostle, He will cause him to enter gardens beneath which rivers flow, and whoever turns back, He will punish him with a painful punishment."
          ],
          "en.transliteration": [
            "Laysa AAal<u>a</u> alaAAm<u>a</u> <u>h</u>arajun wal<u>a</u> AAal<u>a</u> alaAAraji <u>h</u>arajun wal<u>a</u> AAal<u>a</u> almaree<u>d</u>i <u>h</u>arajun waman yu<u>t</u>iAAi All<u>a</u>ha warasoolahu yudkhilhu jann<u>a</u>tin tajree min ta<u>h</u>tih<u>a</u> alanh<u>a</u>ru waman yatawalla yuAAa<u>thth</u>ibhu AAa<u>tha</u>ban aleem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "the blind, the lame, and the sick will not be blamed.\" God will admit anyone who obeys Him and His Messenger to Gardens through which rivers flow. But whoever turns back shall be severely punished by Him."
          ],
          "en.yusufali": [
            "No blame is there on the blind, nor is there blame on the lame, nor on one ill (if he joins not the war): But he that obeys Allah and his Messenger,- (Allah) will admit him to Gardens beneath which rivers flow; and he who turns back, (Allah) will punish him with a grievous Penalty."
          ],
          "fa.ansarian": [
            "بر نابینا و لنگ و بیمار [اگر در جنگ شرکت نکنند] گناهی نیست. و کسی که از خدا و پیامبرش اطاعت کند، او را در بهشت هایی درآورد که از زیرِ [درختانِ] آن نهرها جاری است، و هر کس روی بگرداند او را به عذابی دردناک عذاب می کند."
          ],
          "fa.ayati": [
            "بر كور حرجى نيست، و بر لنگ حرجى نيست و بر بيمار حرجى نيست. و هر كه از خدا و پيامبرش اطاعت كند، او را به بهشتهايى داخل مى‌كند كه در آن نهرها روان است. و هر كه سر برتابد به عذابى دردآورش عذاب مى‌كند."
          ],
          "fa.bahrampour": [
            "بر نابينا و لنگ و بيمار گناهى نيست [كه در جهاد شركت نكنند]. و هر كه اطاعت خدا و رسول او كند، وى را در باغ‌هايى داخل مى‌كند كه از پاى درختانش نهرها جارى است و هر كه سر بتابد، او را به عذابى دردناك عذاب مى‌كند"
          ],
          "fa.fooladvand": [
            "بر نابينا گناهى نيست و بر لنگ گناهى نيست و بر بيمار گناهى نيست [كه در جهاد شركت نكنند]؛ و هر كس خدا و پيامبر او را فرمان برد، وى را در باغهايى كه از زير [درختان‌] آن نهرهايى روان است درمى‌آورد، و هر كس روى برتابد، به عذابى دردناك معذبش مى‌دارد."
          ],
          "fa.ghomshei": [
            "برای شخص نابینا و لنگ و مریض (در تخلّف از جنگ) حرج و گناهی نیست، و هر که خدا و رسول او را فرمان برد او را به باغهای بهشتی داخل کند که زیر درختانش نهرها جاری است و هر که مخالفت کند او را به عذابی دردناک معذّب نماید."
          ],
          "fa.khorramdel": [
            "بر نابینا و لنگ و بیمار گناهی نیست (اگر در میدان جهاد شرکت نکنند). هر کس از خدا و فرستاده‌اش فرانبرداری کند، خدا او را به باغهای بهشتی وارد می‌سازد که رودبارها در زیر (کاخها و درختان) آن روان است، و هر کس که سرپیچی کند، خدا او را به عذاب دردناکی گرفتار می‌سازد. [[«حَرَجُ»: گناه (نگا: توبه / 91، نور / 61).]]"
          ],
          "fa.khorramshahi": [
            "[البته‌] بر نابینا ایرادی نیست، و بر لنگ ایرادی نیست، و بر بیمار هم ایرادی نیست، و هر کس از خداوند و پیامبرش اطاعت کند، به بوستانهایی که جویباران از فرو دست آن جاری است، درآوردشان، و هر کس روی برتابد، به عذابی دردناک عذابش کند"
          ],
          "fa.makarem": [
            "بر نابینا و لنگ و بیمار گناهی نیست (اگر در میدان جهاد شرکت نکنند)؛ و هر کس خدا و رسولش را اطاعت نماید، او را در باغهای (از بهشت) وارد می‌کند که نهرها از زیر (درختانش) جاری است؛ و آن کس که سرپیچی کند، او را به عذاب دردناکی گرفتار می‌سازد!"
          ],
          "fa.moezzi": [
            "نیست بر کور پروائی و نه بر لنگ پروائی و نه بر بیمار پروائی و آنکه فرمانبرداری کند خدا و پیمبرش را درآردش بهشتهائی که روان است زیرا آنها جویها و آنکه پشت کند عذابش کند عذابی دردناک‌"
          ],
          "fa.mojtabavi": [
            "بر نابينا تنگى و گناهى نيست و بر لنگ تنگى و گناهى نيست و بر بيمار تنگى و گناهى نيست [اگر به كارزار نروند]، و هر كه خداى و پيامبرش را فرمان برد او را به بهشتهايى در آورد كه از زير آنها جويها روان است، و هر كه روى بگرداند به عذابى دردناك عذابش كند."
          ],
          "fa.sadeqi": [
            "بر نابینا تنگنایی نیست و بر لنگ تنگنایی نیست و بر بیمار تنگنایی نیست (که در جهاد و مانندش شرکت نکنند). و هر کس خدا و پیامبرش را فرمان بَرَد وی را در باغ‌هایی که از زیر (درختان)شان نهرها روان است در می‌آورد و هر کس را (که) روی برتابد به عذابی دردناک معذّبش می‌دارد."
          ]
        }
      },
      {
        "index": 4601,
        "local_index": 18,
        "part_type": "Verse",
        "path": "/books/quran:48:18",
        "text": [
          "لَقَدْ رَضِيَ‌ اللَّهُ‌ عَنِ‌ الْمُؤْمِنِينَ‌ إِذْ يُبَايِعُونَکَ‌ تَحْتَ‌ الشَّجَرَةِ فَعَلِمَ‌ مَا فِي‌ قُلُوبِهِمْ‌ فَأَنْزَلَ‌ السَّکِينَةَ عَلَيْهِمْ‌ وَ أَثَابَهُمْ‌ فَتْحاً قَرِيباً"
        ],
        "translations": {
          "en.ahmedali": [
            "God was pleased with the believers when they swore allegiance to you under the tree, for He knew well what was in their hearts, and sent down tranquility on them, and rewarded them with an expeditious victory"
          ],
          "en.ahmedraza": [
            "Indeed Allah was truly pleased with the believers when they swore allegiance to you beneath the tree – so He knew what was in their hearts – He therefore sent down peace upon them, and rewarded them with an imminent victory."
          ],
          "en.arberry": [
            "God was well pleased with the believers when they were swearing fealty to thee under the tree, and He knew what was in their hearts, so He sent down the Shechina upon them, and rewarded them with a nigh victory"
          ],
          "en.daryabadi": [
            "Assuredly well-pleased was Allah with the believers when they sware fealty Unto thee under the tree, and he knew that which was in their hearts, wherefore He sent down tranquillity on them, and rewarded them with a victory near at hand."
          ],
          "en.hilali": [
            "Indeed, Allah was pleased with the believers when they gave their Bai'a (pledge) to you (O Muhammad SAW) under the tree, He knew what was in their hearts, and He sent down As-Sakinah (calmness and tranquillity) upon them, and He rewarded them with a near victory,"
          ],
          "en.itani": [
            "God was pleased with the believers, when they pledged allegiance to you under the tree. He knew what was in their hearts, and sent down serenity upon them, and rewarded them with an imminent conquest."
          ],
          "en.maududi": [
            "Allah was much pleased with the believers when they swore fealty to you under the tree. He knew what was in their hearts. So He bestowed inner peace upon them and rewarded them with a victory near at hand"
          ],
          "en.mubarakpuri": [
            "Indeed, Allah was pleased with the believers when they gave the pledge to you under the tree, He knew what was in their hearts, and He sent down As-Sakinah upon them, and He rewarded them with a near victory."
          ],
          "en.pickthall": [
            "Allah was well pleased with the believers when they swore allegiance unto thee beneath the tree, and He knew what was in their hearts, and He sent down peace of reassurance on them, and hath rewarded them with a near victory;"
          ],
          "en.qarai": [
            "Allah was certainly pleased with the faithful when they swore allegiance to you under the tree. He knew what was in their hearts, so He sent down composure on them, and requited them with a victory near at hand"
          ],
          "en.qaribullah": [
            "Allah was pleased with the believers when they swore allegiance to you under the tree and He knew what was in their hearts. Therefore, He sent downtranquility upon them and rewarded them with a victory close by"
          ],
          "en.sahih": [
            "Certainly was Allah pleased with the believers when they pledged allegiance to you, [O Muhammad], under the tree, and He knew what was in their hearts, so He sent down tranquillity upon them and rewarded them with an imminent conquest"
          ],
          "en.sarwar": [
            "God is pleased with the believers for their pledging obedience to you under the tree. He knew whatever was in their hearts, thus, He granted them confidence and rewarded them with an immediate victory"
          ],
          "en.shakir": [
            "Certainly Allah was well pleased with the believers when they swore allegiance to you under the tree, and He knew what was in their hearts, so He sent down tranquillity on them and rewarded them with a near victory,"
          ],
          "en.transliteration": [
            "Laqad ra<u>d</u>iya All<u>a</u>hu AAani almumineena i<u>th</u> yub<u>a</u>yiAAoonaka ta<u>h</u>ta a<b>l</b>shshajarati faAAalima m<u>a</u> fee quloobihim faanzala a<b>l</b>sakeenata AAalayhim waath<u>a</u>bahum fat<u>h</u>an qareeb<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "God was pleased with the believers when they swore allegiance to you [Prophet] under the tree: He knew what was in their hearts and so He sent tranquillity down to them and rewarded them with a victory near at hand"
          ],
          "en.yusufali": [
            "Allah's Good Pleasure was on the Believers when they swore Fealty to thee under the Tree: He knew what was in their hearts, and He sent down Tranquillity to them; and He rewarded them with a speedy Victory;"
          ],
          "fa.ansarian": [
            "یقیناً خدا از مؤمنان هنگامی که زیر آن درخت [که در منطقه حدیبیه بود] با تو بیعت می کردند خشنود شد، و خدا آنچه را [از خلوص نیّت و پاکی قصد] در دل هایشان بود می دانست، در نتیجه آرامش را بر آنان نازل کرد، و پیروزی نزدیکی را [که پیروزی در خیبر بود] به آنان پاداش داد."
          ],
          "fa.ayati": [
            "خدا از مؤمنان آن هنگام كه در زير درخت با تو بيعت كردند، خشنود گشت و دانست كه در دلشان چه مى‌گذرد. پس آرامش بر آنها نازل كرد و به فتحى نزديك پاداششان داد،"
          ],
          "fa.bahrampour": [
            "به راستى خدا هنگامى كه مؤمنان زير درخت با تو بيعت مى‌كردند از آنها راضى شد و از آنچه در دلشان [از صدق نيت‌] بود آگاه گرديد، پس آرامش را بر آنها نازل كرد و فتحى نزديك (فتح خيبر) را به آنها پاداش داد"
          ],
          "fa.fooladvand": [
            "به راستى خدا هنگامى كه مؤمنان، زير آن درخت با تو بيعت مى‌كردند از آنان خشنود شد، و آنچه در دلهايشان بود بازشناخت و بر آنان آرامش فرو فرستاد و پيروزى نزديكى به آنها پاداش داد."
          ],
          "fa.ghomshei": [
            "خدا از مؤمنانی که زیر درخت (معهود حدیبیّه) با تو بیعت کردند به حقیقت خشنود گشت و از وفا و خلوص قلبی آنها آگاه بود که وقار و اطمینان کامل بر ایشان نازل فرمود و به فتحی نزدیک (که فتح خیبر بود) پاداش داد."
          ],
          "fa.khorramdel": [
            "خداوند از مؤمنان راضی گردید همان دم که در زیر درخت با تو بیعت کردند. خدا می‌دانست آنچه را که در درون دلهایشان (از صداقت و ایمان و اخلاص و وفاداری به اسلام) نهفته بود، لذا اطمینان خاطری به دلهایشان داد، و فتح نزدیکی را (گذشته از نعمت سرمدی آخرت) پاداششان کرد. [[«إِذْ»: آن دم. بدانگاه. «الشَّجَرَةِ»: مراد درخت بزرگ و گشنی است که در حدیبیه بود و مؤمنان در زیر سایه آن با پیغمبر تجدید بیعت کردند و این پیمان به سبب خوشنودی خدا از آن مؤمنان «بَیْعَةُالرِّضْوان» نام گرفت. «السَّکِینَةَ»: (نگا: آیه 4). «أَثَابَهُمْ»: (نگا: آل‌عمران / 153، مائده / 85). «فَتْحاً قَرِیباً»: مراد صلح حدیبیه است که منشأ آزادی دعوت اسلام و فتوحات بیشمار گردید. برخی هم آن را فتح خیبر، و گروهی نیز فتح مکه می‌دانند.]]"
          ],
          "fa.khorramshahi": [
            "به راستی که خداوند از مؤمنان، چون با تو در زیر آن درخت بیعت کردند، خشنود شد، و می‌دانست که در دلهایشان چیست، و آنگاه آرامش [خود] را بر آنان نازل کرد و به پیروزی‌ای نزدیک پاداششان داد"
          ],
          "fa.makarem": [
            "خداوند از مؤمنان -هنگامی که در زیر آن درخت با تو بیعت کردند- راضی و خشنود شد؛ خدا آنچه را در درون دلهایشان (از ایمان و صداقت) نهفته بود می‌دانست؛ از این رو آرامش را بر دلهایشان نازل کرد و پیروزی نزدیکی بعنوان پاداش نصیب آنها فرمود؛"
          ],
          "fa.moezzi": [
            "همانا خوشنود شد خدا از مؤمنان گاهی که پیمان بستند (بیعت کردند) با تو زیر آن درخت پس دانست آنچه در دلهای ایشان است پس فرود آورد آرامش را بر ایشان و پاداش داد بدیشان پیروزئی نزدیک را"
          ],
          "fa.mojtabavi": [
            "هر آينه خداى از مؤمنان خشنود شد آنگاه كه با تو در زير آن درخت- در حديبيه- بيعت مى‌كردند، آنچه را در دلهاشان بود- از راستى و پاكى نيت و وفا- دانست، پس آرامش را بر آنان فرو آورد و ايشان را پيروزيى نزديك- فتح خيبر- پاداش داد،"
          ],
          "fa.sadeqi": [
            "خدا بی‌گمان هنگامی که مؤمنان، زیر (آن) درخت با تو بیعت می‌کردند از آنان خشنود شد. پس آنچه در دل‌هایشان بود دانست و بر آنان آرامش فرو فرستاد و پیروزی نزدیکی را به آنان پاداش داد."
          ]
        }
      },
      {
        "index": 4602,
        "local_index": 19,
        "part_type": "Verse",
        "path": "/books/quran:48:19",
        "text": [
          "وَ مَغَانِمَ‌ کَثِيرَةً يَأْخُذُونَهَا وَ کَانَ‌ اللَّهُ‌ عَزِيزاً حَکِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "And the many spoils that they were to take. God is all-mighty and all-wise."
          ],
          "en.ahmedraza": [
            "And plenty of war booty, to take; and Allah is Most Honourable, Wise."
          ],
          "en.arberry": [
            "and many spoils to take; and God is ever All-mighty, All-wise."
          ],
          "en.daryabadi": [
            "And spoils in abundance that they are taking. And Allah is ever Mighty, Wise."
          ],
          "en.hilali": [
            "And abundant spoils that they will capture. And Allah is Ever All-Mighty, All-Wise."
          ],
          "en.itani": [
            "And abundant gains for them to capture. God is Mighty and Wise."
          ],
          "en.maududi": [
            "and with abundant spoils which they shall acquire. Allah is Most Mighty, Most Wise."
          ],
          "en.mubarakpuri": [
            "And abundant spoils that they will capture. And Allah is Ever All-Mighty, All-Wise."
          ],
          "en.pickthall": [
            "And much booty that they will capture. Allah is ever Mighty, Wise."
          ],
          "en.qarai": [
            "and abundant spoils that they will capture, and Allah is all-mighty, all-wise."
          ],
          "en.qaribullah": [
            "and they took many spoils, and Allah is the Almighty, and the Wise."
          ],
          "en.sahih": [
            "And much war booty which they will take. And ever is Allah Exalted in Might and Wise."
          ],
          "en.sarwar": [
            "and the booty which they received from it (the Battle). God is Majestic and All-wise."
          ],
          "en.shakir": [
            "And many acquisitions which they will take; and Allah is Mighty, Wise."
          ],
          "en.transliteration": [
            "Wamagh<u>a</u>nima katheeratan yakhu<u>th</u>oonah<u>a</u> wak<u>a</u>na All<u>a</u>hu AAazeezan <u>h</u>akeem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and with many future gains -- God is mighty and wise."
          ],
          "en.yusufali": [
            "And many gains will they acquire (besides): and Allah is Exalted in Power, Full of Wisdom."
          ],
          "fa.ansarian": [
            "[و پاداش دیگر] غنیمت های فراوانی است که آن را به دست می آورید؛ و خدا همواره توانای شکست ناپذیر و حکیم است."
          ],
          "fa.ayati": [
            "و به غنيمتهاى بسيار كه به دست مى‌آورند. و خدا پيروزمند و حكيم است."
          ],
          "fa.bahrampour": [
            "و [نيز] غنيمت‌هاى فراوانى كه مى‌گيرند، و خدا شكست ناپذير حكيم است"
          ],
          "fa.fooladvand": [
            "و [نيز] غنيمتهاى فراوانى خواهند گرفت، و خدا همواره نيرومند سنجيده‌كار است."
          ],
          "fa.ghomshei": [
            "و به غنیمتهای فراوان که (از خیبریان) خواهند گرفت موفق داشت، و خدا مقتدر و داناست."
          ],
          "fa.khorramdel": [
            "همراه با غنیمتهای بسیاری که آن را بدست خواهند آورد. خداوند چیره‌ی شکست‌ناپذیر و فرزانه‌ای است که کارهایش بر اساس حکمت است. [[«مَغَانِمَ کَثِیرةً»: مراد همه غنیمتهائی است که تا روز آخرت مسلمانان بدست می‌آورند (نگا: المصحف المیسر).]]"
          ],
          "fa.khorramshahi": [
            "و نیز غنایمی بسیار که به آن دست‌یابند، و خداوند پیروزمند فرزانه است‌"
          ],
          "fa.makarem": [
            "و (همچنین) غنایم بسیاری که آن را به دست می‌آورید؛ و خداوند شکست ناپذیر و حکیم است!"
          ],
          "fa.moezzi": [
            "برده‌هائی فراوان که به چنگ آرند آنها را و خداست عزّتمند حکیم‌"
          ],
          "fa.mojtabavi": [
            "و نيز غنيمتهاى بسيار كه مى‌گيرند، و خدا تواناى بى‌همتا و داناى با حكمت است."
          ],
          "fa.sadeqi": [
            "و (نیز) غنیمت‌های فراوانی را (که آنها) می‌گیرند. و خدا همواره نیرومند سنجیده‌کار بوده است."
          ]
        }
      },
      {
        "index": 4603,
        "local_index": 20,
        "part_type": "Verse",
        "path": "/books/quran:48:20",
        "text": [
          "وَعَدَکُمُ‌ اللَّهُ‌ مَغَانِمَ‌ کَثِيرَةً تَأْخُذُونَهَا فَعَجَّلَ‌ لَکُمْ‌ هٰذِهِ‌ وَ کَفَ‌ أَيْدِيَ‌ النَّاسِ‌ عَنْکُمْ‌ وَ لِتَکُونَ‌ آيَةً لِلْمُؤْمِنِينَ‌ وَ يَهْدِيَکُمْ‌ صِرَاطاً مُسْتَقِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "God had promised you many spoils that you would capture; so He gave this soon enough to you, and stayed the hands of men from you that it may serve as a sign for believers, and guide you on the straight path;"
          ],
          "en.ahmedraza": [
            "Allah has promised you plenty of booty which you will take, and has bestowed this to you quickly, and restrained peoples’ hands from you; and in order that it may be a sign for the believers, and to guide you on the Straight Path."
          ],
          "en.arberry": [
            "God has promised you many spoils to take; these He has hastened to you, and has restrained the hands of men from you, and that it may be a sign to the believers, and to guide you on a straight path,"
          ],
          "en.daryabadi": [
            "Allah hath promised you abundant spoils that ye shall take, and these He hath hastened to you, and hath restrained the hands of people from you, that it may be a sign Unto the believers, and that He may guide you to a straight path."
          ],
          "en.hilali": [
            "Allah has promised you abundant spoils that you will capture, and He has hastened for you this, and He has restrained the hands of men from you, that it may be a sign for the believers, and that He may guide you to a Straight Path."
          ],
          "en.itani": [
            "God has promised you abundant gains, which you will capture. He has expedited this for you, and has restrained people’s hands from you; that it may be a sign to the believers, and that He may guide you on a straight path."
          ],
          "en.maududi": [
            "Allah has promised you abundant spoils which you shall acquire. He has instantly granted you this (victory) and has restrained the hands of people from you that it may be a Sign for the believers and He may guide you to a Straight Way."
          ],
          "en.mubarakpuri": [
            "Allah has promised you abundant spoils that you will capture, and He has hastened for you this, and He has restrained the hands of men from you, that it may be a sign for the believers, and that He may guide you to the straight path."
          ],
          "en.pickthall": [
            "Allah promiseth you much booty that ye will capture, and hath given you this in advance, and hath withheld men's hands from you, that it may be a token for the believers, and that He may guide you on a right path."
          ],
          "en.qarai": [
            "Allah has promised you abundant spoils, which you will capture. He has expedited this one for you, and withheld men’s hands from you, so that it may be a sign for the faithful, and that He may guide you to a straight path."
          ],
          "en.qaribullah": [
            "Allah has promised that you take many spoils. He has hastened this to you, and restrained the hands of people from you so that He makes it a sign to the believers and to guide you on a Straight Path."
          ],
          "en.sahih": [
            "Allah has promised you much booty that you will take [in the future] and has hastened for you this [victory] and withheld the hands of people from you - that it may be a sign for the believers and [that] He may guide you to a straight path."
          ],
          "en.sarwar": [
            "God has promised that you will receive much booty. He has enabled you to receive this at this time and has protected you from enemies to make it an evidence (of the Truth) for the believers. He will guide you to the right path."
          ],
          "en.shakir": [
            "Allah promised you many acquisitions which you will take, then He hastened on this one for you and held back the hands of men from you, and that it may be a sign for the believers and that He may guide you on a right path."
          ],
          "en.transliteration": [
            "WaAAadakumu All<u>a</u>hu magh<u>a</u>nima katheeratan takhu<u>th</u>oonah<u>a</u> faAAajjala lakum h<u>ath</u>ihi wakaffa aydiya a<b>l</b>nn<u>a</u>si AAankum walitakoona <u>a</u>yatan lilmumineena wayahdiyakum <u>s</u>ir<u>at</u>an mustaqeem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "God has promised you many future gains, and He has given you these in advance; and He has restrained the hands of men from harming you, so that it may be a sign for the believers, and so that He may guide you to a straight path."
          ],
          "en.yusufali": [
            "Allah has promised you many gains that ye shall acquire, and He has given you these beforehand; and He has restrained the hands of men from you; that it may be a Sign for the Believers, and that He may guide you to a Straight Path;"
          ],
          "fa.ansarian": [
            "خدا غنیمت های فراوانی را در آینده به شما وعده داده است که به دست می آورید، و این یک غنیمت را [که فتح خیبر است] برای شما پیش انداخت، و دست های [تجاوز و ستم] مردم را از شما باز داشت تا این [پیروزی ها] برای مؤمنان نشانه ای [از حقّانیّت دین و یاری خدا] باشد و تا شما را به راهی راست هدایت کند."
          ],
          "fa.ayati": [
            "خدا به شما وعده غنايم بسيار داده است كه به چنگ مى‌آوريد؛ و اين غنيمت را زودتر ارزانى داشت و شما را از آسيب مردمان امان بخشيد، تا براى مؤمنان عبرتى باشد و به راه راست هدايتتان كند."
          ],
          "fa.bahrampour": [
            "خدا به شما غنيمت‌هاى فراوانى را وعده داده است كه آنها را خواهيد گرفت ولى اين [غنايم خيبر] را زودتر به شما ارزانى داشت و دست [تعدى‌] مردم را از شما كوتاه ساخت تا براى مؤمنان نشانه‌اى باشد، و شما را به راه راست هدايت كند"
          ],
          "fa.fooladvand": [
            "و خدا به شما غنيمتهاى فراوان [ديگرى‌] وعده داده كه به زودى آنها را خواهيد گرفت، و اين [پيروزى‌] را براى شما پيش انداخت، و دستهاى مردم را از شما كوتاه ساخت، و تا براى مؤمنان نشانه‌اى باشد و شما را به راه راست هدايت كند."
          ],
          "fa.ghomshei": [
            "خدا به شما (لشکر اسلام) وعده گرفتن غنیمتهای بسیار داده که این (یک غنیمت خیبر) را برای شما تعجیل در انجام آن فرمود و دست مردم (کافر) را از سر شما کوتاه کرد (تا همپیمانان یهود عبرت گیرند) و تا (این فتح و غنیمت) آیت و دلیل اهل ایمان (بر صدق وعده خدا) باشد و خدا شما را به راه راست هدایت فرماید."
          ],
          "fa.khorramdel": [
            "خداوند غنیمتهای فراوانی را به شما وعده داده است که آنها را به چنگ می‌آورید، ولی این یکی را (که غنائم خیبر است) زودتر برایتان فراهم ساخت، و دست تعدّی مردمان (کینه‌توز و بدنهاد یهودی پیرامون مدینه) را از شما بازداشت، تا نشانه‌ای (بر وفای به عهد پروردگار) برای مؤمنان باشد، و شما را به راه راست رهنمود کند. [[«مَغَانِمَ کَثِیرةً»: (نگا: آیه 19). «هذِهِ»: غنیمتهای فتح خیبر مراد است که در سال هفتم هجری بعد از رجوع از حدیبیه دست داد (نگا: المصحف المیسر). «النَّاسِ»: مراد یهودیان اطراف مدینه است که خداوند در دلهایشان رعب و هراس افکند، و لذا جرأت نکردند در غیبت مسلمانان به هنگام حرکت به سوی مکه و انجام عمره در حدیبیه، آزاری به زنان و کودکان مسلمانان برسانند. «آیَةً»: علامت و نشانه صدق وعده خدا به مسلمانان. «وَ لِتَکُونَ آیَةً ...». حرف واو عاطفه است و مابعد خود را عطف بر مقدر مفهوم از مقام می‌کند. یعنی: عَجَّلَ لَکُمُ الْمَغَانِمَ وَ کَفَّ الْیَهُودَ، لِتَشْکُرُوهُ سُبْحانَهُ، وَ لِیَکُونَ ذلِکَ آیَةً. أَیْ دَلیلاً عَلی صِدْقِِ وَعْدِهِ سُبْحانَهُ.]]"
          ],
          "fa.khorramshahi": [
            "خداوند به شما غنایم بسیاری وعده کرده است که بر آن دست یابید، و این را برای شما پیش انداخت، و دستان مردم [مخالف‌] را از شما بازداشت، تا این امر نشانه عبرتی برای مؤمنان باشد، و شما را به راهی راست هدایت کند"
          ],
          "fa.makarem": [
            "خداوند غنایم فراوانی به شما وعده داده بود که آنها را به دست می‌آورید، ولی این یکی را زودتر برای شما فراهم ساخت؛ و دست تعدّی مردم [= دشمنان‌] را از شما بازداشت تا نشانه‌ای برای مؤمنان باشد و شما را به راه راست هدایت کند!"
          ],
          "fa.moezzi": [
            "وعده داد شما را خدا خواسته‌هائی (برده‌هائی) فراوان که به چنگ آرید آنها را پس شتافت برای شما در این و باز داشت دستهای مردم را از شما و تا باشد آیتی برای مؤمنان و رهبری کند شما را به راهی راست‌"
          ],
          "fa.mojtabavi": [
            "خدا به شما غنيمتهاى بسيار را وعده داده است كه مى‌گيريد، و اين را زود به شما ارزانى داشت و دستهاى مردم را از شما باز داشت [تا همپيمانان يهود ترسيده به جنگ بيرون نيايند]، و تا نشانه‌اى براى مؤمنان باشد و شما را به راهى راست رهبرى كند."
          ],
          "fa.sadeqi": [
            "خدا به شما غنیمت‌های فراوان (دیگری) وعده داده (که) آنها را خواهید گرفت. پس این (پیروزی) را برای شما پیش انداخت و دست‌های مردمان را از شما کوتاه ساخت، و تا برای مؤمنان نشانه‌ای باشد و شما را به راهی راست هدایت کند."
          ]
        }
      },
      {
        "index": 4604,
        "local_index": 21,
        "part_type": "Verse",
        "path": "/books/quran:48:21",
        "text": [
          "وَ أُخْرَى‌ لَمْ‌ تَقْدِرُوا عَلَيْهَا قَدْ أَحَاطَ اللَّهُ‌ بِهَا وَ کَانَ‌ اللَّهُ‌ عَلَى‌ کُلِ‌ شَيْ‌ءٍ قَدِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And other (benefits) which you have not yet obtained, are within the compass of God, for God has power over everything."
          ],
          "en.ahmedraza": [
            "And one more, not within your capacity, is within Allah’s hold; and Allah is Able to do all things."
          ],
          "en.arberry": [
            "and other spoils you were not able to take; God had encompassed them already. God is powerful over everything."
          ],
          "en.daryabadi": [
            "And He promiseth another victory, over which ye have as yet no power: Allah hath surely encompassed it; and Allah is over everything ever Potent."
          ],
          "en.hilali": [
            "And other (victories and much booty there are, He promises you) which are not yet within your power, indeed Allah compasses them, And Allah is Ever Able to do all things."
          ],
          "en.itani": [
            "And other things, of which you were incapable, but God has encompassed them. God is Capable of everything."
          ],
          "en.maududi": [
            "He also promises you other spoils which you have not yet taken, but Allah has encompassed them. Allah has power over everything."
          ],
          "en.mubarakpuri": [
            "And other (victories) which are not yet within your power; indeed Allah encompasses them. And Allah is Ever Able to do all things."
          ],
          "en.pickthall": [
            "And other (gain), which ye have not been able to achieve, Allah will compass it, Allah is Able to do all things."
          ],
          "en.qarai": [
            "And other [spoils as well] which you have not yet captured: Allah has comprehended them, and Allah has power over all things."
          ],
          "en.qaribullah": [
            "And there were (other spoils) which you were unable to take. Allah has encompassed it already, Allah is powerful over all things."
          ],
          "en.sahih": [
            "And [He promises] other [victories] that you were [so far] unable to [realize] which Allah has already encompassed. And ever is Allah, over all things, competent."
          ],
          "en.sarwar": [
            "Besides these, there were other gains which you could not receive, but God has full control over them. God has power over all things."
          ],
          "en.shakir": [
            "And others which you have not yet been able to achieve Allah has surely encompassed them, and Allah has power over all things."
          ],
          "en.transliteration": [
            "Waokhr<u>a</u> lam taqdiroo AAalayh<u>a</u> qad a<u>hat</u>a All<u>a</u>hu bih<u>a</u> wak<u>a</u>na All<u>a</u>hu AAal<u>a</u> kulli shayin qadeer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "And there are yet other [gains] which are still beyond your grasp, [but] which God has already encompassed [for you]: for God has power over all things."
          ],
          "en.yusufali": [
            "And other gains (there are), which are not within your power, but which Allah has compassed: and Allah has power over all things."
          ],
          "fa.ansarian": [
            "و [غنیمت ها و پیروزی های] دیگر [ی هست] که شما تا کنون بر آنها دست نیافته اید، بی تردید خدا بر آنها احاطه دارد [و به آسانی می تواند در دسترس شما قرار دهد]؛ و خدا همواره بر هر کاری تواناست."
          ],
          "fa.ayati": [
            "و غنايم ديگرى كه هنوز به آنها دست نيافته‌ايد. هر آينه خدا به آن احاطه دارد و او بر هر كارى تواناست."
          ],
          "fa.bahrampour": [
            "و [غنيمت‌هاى‌] ديگرى [نيز هست‌] كه به آنها دست نيافته‌ايد تنها خدا بر آنها احاطه دارد، و خدا بر هر چيزى قادر است"
          ],
          "fa.fooladvand": [
            "و [غنيمتهاى‌] ديگر[ى نيز هست‌] كه شما بر آنها دست نيافته‌ايد [و] خدا بر آنها نيك احاطه دارد، و همواره خداوند بر هر چيزى تواناست."
          ],
          "fa.ghomshei": [
            "و خدا به شما باز وعده غنیمتهای دیگری فرموده که هنوز بر آن قادر نیستید و علم خدا محیط بر آن است و خدا بر هر چیز تواناست."
          ],
          "fa.khorramdel": [
            "و غنیمتهای دیگری که شما قدرت بر آن را نداشته و ندارید، ولی خداوند قدرتش بر آن احاطه دارد (و آن را بهره‌ی شما می‌گرداند) و او بر هر چیزی توانا است. [[«أُخْری»: مراد غنائم بیشماری است که بعد از فتح مکه، در جنگ حنین از قبائل ثقیف و هوازن گرفته می‌شود (نگا: توبه / 25).]]"
          ],
          "fa.khorramshahi": [
            "و موردی دیگر که هنوز به آن دست نیافته‌اید، ولی خداوند به آن احاطه دارد، و خداوند بر همه چیز تواناست‌"
          ],
          "fa.makarem": [
            "و نیز غنایم و فتوحات دیگری (نصیبتان می‌کند) که شما توانایی آن را ندارید، ولی قدرت خدا به آن احاطه دارد؛ و خداوند بر همه چیز تواناست!"
          ],
          "fa.moezzi": [
            "و دیگری که توانا نبودید بر آن همانا خدا فراگرفت آن را و خدا است بر همه چیز توانا"
          ],
          "fa.mojtabavi": [
            "و غنيمتهاى ديگرى [هست‌] كه هنوز بر آنها دست نيافته‌ايد. همانا خداوند به آنها احاطه دارد- از آنها آگاه است- و خدا بر هر چيزى تواناست."
          ],
          "fa.sadeqi": [
            "و (غنیمت‌های) دیگری (نیز هست) که شما بر آنها دست نیافته‌اید (و) خدا بر آنها همواره احاطه داشته و خدا بر هر چیزی بسیار توانا بوده است."
          ]
        }
      },
      {
        "index": 4605,
        "local_index": 22,
        "part_type": "Verse",
        "path": "/books/quran:48:22",
        "text": [
          "وَ لَوْ قَاتَلَکُمُ‌ الَّذِينَ‌ کَفَرُوا لَوَلَّوُا الْأَدْبَارَ ثُمَ‌ لاَ يَجِدُونَ‌ وَلِيّاً وَ لاَ نَصِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "Had the unbelievers fought you they would have turned their backs and not found a protector or helper."
          ],
          "en.ahmedraza": [
            "And if the disbelievers were to fight you, they will turn away and flee, and then they will not find any supporter nor any aide."
          ],
          "en.arberry": [
            "If the unbelievers had fought you, they would have turned their backs, and then found neither protector nor helper;"
          ],
          "en.daryabadi": [
            "And had those who disbelieve fought against you, surely they would have turned their backs, and then they would have found no patron nor helper."
          ],
          "en.hilali": [
            "And if those who disbelieve fight against you, they certainly would have turned their backs, then they would have found neither a Wali (protector) nor a helper."
          ],
          "en.itani": [
            "If those who disbelieve had fought you, they would have turned back and fled, then found neither protector nor helper."
          ],
          "en.maududi": [
            "Had the unbelievers fought against you at that time, they would have turned their backs (in flight), and would have found none to protect or help them."
          ],
          "en.mubarakpuri": [
            "And if those who disbelieve fight against you, they certainly would have turned their backs; then they would have found neither a protector nor a helper."
          ],
          "en.pickthall": [
            "And if those who disbelieve join battle with you they will take to flight, and afterward they will find no protecting friend nor helper."
          ],
          "en.qarai": [
            "If the faithless fight you, they will turn their backs [to flee]. Then they will not find any protector or helper."
          ],
          "en.qaribullah": [
            "If the unbelievers had fought you they would have been put to flight, and found none to protect or help them."
          ],
          "en.sahih": [
            "And if those [Makkans] who disbelieve had fought you, they would have turned their backs [in flight]. Then they would not find a protector or a helper."
          ],
          "en.sarwar": [
            "Had the disbelievers fought against you, they would have run away from the battle and would have found no guardian or helper."
          ],
          "en.shakir": [
            "And if those who disbelieve fight with you, they would certainly turn (their) backs, then they would not find any protector or a helper."
          ],
          "en.transliteration": [
            "Walaw q<u>a</u>talakumu alla<u>th</u>eena kafaroo lawallawoo aladb<u>a</u>ra thumma l<u>a</u> yajidoona waliyyan wal<u>a</u> na<u>s</u>eer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "If those who deny the truth were to fight you, they would certainly turn their backs; then they would find neither protector nor helper:"
          ],
          "en.yusufali": [
            "If the Unbelievers should fight you, they would certainly turn their backs; then would they find neither protector nor helper."
          ],
          "fa.ansarian": [
            "اگر کافران با شما بجنگند حتماً پشت کنان می گریزند، آن گاه سرپرست و یاوری [که از آنان دفاع کند] نمی یابند."
          ],
          "fa.ayati": [
            "و اگر كافران با شما به جنگ برخيزند، پشت كرده بگريزند و ديگر هيچ دوست و ياريگرى نمى‌يابند."
          ],
          "fa.bahrampour": [
            "و اگر كسانى كه كافر شدند، [در حديبيّه‌] به جنگ با شما بر مى‌خاستند، قطعا [به شما] پشت مى‌كردند و يار و ياورى [براى خود] نمى‌يافتند"
          ],
          "fa.fooladvand": [
            "و اگر كسانى كه كافر شدند، به جنگ با شما برخيزند، قطعاً پشت خواهند كرد، و ديگر يار و ياورى نخواهند يافت."
          ],
          "fa.ghomshei": [
            "و اگر کافران با شما مسلمین به جنگ برخیزند از قتال شما پشت گردانیده و فرار کنند و دیگر هیچ ناصر و یاوری برای خود نیابند."
          ],
          "fa.khorramdel": [
            "اگر کافران (قریش، در سرزمین حدیبیه) با شما بجنگند، (از ترس شما) پشت می‌کنند و می‌گریزند، سپس سرپرستی (که کار و بار ایشان را بدست گیرد) و یاوری (که ایشان را کمک کند) پیدا نخواهند کرد. [[«قَاتَلَکُمْ»: با شما پیکار کنند و بجنگند. «الَّذِینَ کَفَرُوا»: مراد کفار مکه است. «وَلَّوُا الأَدْبَارَ»: (نگا: آل‌عمران / 111، انفال / 15، احزاب / 15).]]"
          ],
          "fa.khorramshahi": [
            "و اگر کافران با شما به کارزار برخیزند، بی‌شک به شما پشت خواهند کرد، سپس نه یاری و نه یاوری یابند"
          ],
          "fa.makarem": [
            "و اگر کافران (در سرزمین حدیبیّه) با شما پیکار می‌کردند بزودی فرار می‌کردند، سپس ولیّ و یاوری نمی‌یافتند!"
          ],
          "fa.moezzi": [
            "و اگر جنگ کنند با شما آنان که کفر ورزیدند هر آینه برگردانند پشتهای خویش را سپس نیابند دوست و نه یاوری را"
          ],
          "fa.mojtabavi": [
            "و اگر كسانى كه كافر شدند با شما كارزار كنند هر آينه پشت كرده بگريزند و آنگاه هيچ كارساز و ياورى نيابند."
          ],
          "fa.sadeqi": [
            "و اگر کسانی که کافر شدند، با شما کشتار کنند، بی‌چون (به شما) پشت خواهند کرد، سپس پشتوانه و یاوری نخواهند یافت."
          ]
        }
      },
      {
        "index": 4606,
        "local_index": 23,
        "part_type": "Verse",
        "path": "/books/quran:48:23",
        "text": [
          "سُنَّةَ اللَّهِ‌ الَّتِي‌ قَدْ خَلَتْ‌ مِنْ‌ قَبْلُ‌ وَ لَنْ‌ تَجِدَ لِسُنَّةِ اللَّهِ‌ تَبْدِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "This is the law of God, effective as before: You will not find any change in the law of God."
          ],
          "en.ahmedraza": [
            "The tradition of Allah, ongoing since before; and you will not find the tradition of Allah changing."
          ],
          "en.arberry": [
            "the wont of God, as in the past before, and thou shalt never find any changing the wont of God."
          ],
          "en.daryabadi": [
            "That hath been the dispensation of Allah with those who passed away aforetime; and thou shalt not find in the dispensation of Allah any change."
          ],
          "en.hilali": [
            "That has been the Way of Allah already with those who passed away before. And you will not find any change in the Way of Allah."
          ],
          "en.itani": [
            "It is God’s pattern, ongoing since the past. You will never find any change in God’s pattern."
          ],
          "en.maududi": [
            "Such is Allah's Way that has come down from the past. Never shall you find any change in the Way of Allah."
          ],
          "en.mubarakpuri": [
            "That has been the way of Allah already with those who passed away before. And you will not find any change in the way of Allah."
          ],
          "en.pickthall": [
            "It is the law of Allah which hath taken course aforetime. Thou wilt not find for the law of Allah aught of power to change."
          ],
          "en.qarai": [
            "[It is] Allah’s precedent that has passed before, and you will never find any change in Allah’s precedent."
          ],
          "en.qaribullah": [
            "Such is the way of Allah in days gone by, and you shall find no change in the ways of Allah."
          ],
          "en.sahih": [
            "[This is] the established way of Allah which has occurred before. And never will you find in the way of Allah any change."
          ],
          "en.sarwar": [
            "This is the tradition of God which existed before, and you will never find any change in His tradition."
          ],
          "en.shakir": [
            "Such has been the course of Allah that has indeed run before, and you shall not find a change in Allah's course."
          ],
          "en.transliteration": [
            "Sunnata All<u>a</u>hi allatee qad khalat min qablu walan tajida lisunnati All<u>a</u>hi tabdeel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "such was the law of God in the past; and you shall find no change in the law of God."
          ],
          "en.yusufali": [
            "(Such has been) the practice (approved) of Allah already in the past: no change wilt thou find in the practice (approved) of Allah."
          ],
          "fa.ansarian": [
            "خدا روشی ثابت و قطعی مقرّر کرده است که از پیش [بر پیروزی مؤمنان و شکست کافران] جاری بوده است، و هرگز برای روش خدا تغییر و تبدیلی نخواهی یافت."
          ],
          "fa.ayati": [
            "اين سنت خداست كه از پيش چنين بوده است و تو در سنت خدا دگرگونى نخواهى يافت."
          ],
          "fa.bahrampour": [
            "سنت الهى است كه در گذشته نيز بوده است، و هرگز براى سنت الهى تغييرى نخواهى يافت"
          ],
          "fa.fooladvand": [
            "سنّت الهى از پيش همين بوده، و در سنّت الهى هرگز تغييرى نخواهى يافت."
          ],
          "fa.ghomshei": [
            "سنّت الهی (و قانون نظام ربّانی) بر این بوده (که حق بر باطل غالب شود) و ابدا در سنّت خدا تغییری نخواهی یافت."
          ],
          "fa.khorramdel": [
            "این سنّت الهی است که در گذشته نیز بوده است، و هرگز برای سنّت الهی تغییر و تبدیلی نخواهی یافت. [[«سُنَّةَ اللهِ الَّتِی ...»: عادت خدا است که (نگا: احزاب / 38 و 62، غافر / 85).]]"
          ],
          "fa.khorramshahi": [
            "این سنت الهی است که پیشتر نیز جاری بوده است، و هرگز در سنت الهی تغییر و تبدیلی نخواهی یافت‌"
          ],
          "fa.makarem": [
            "این سنّت الهی است که در گذشته نیز بوده است؛ و هرگز برای سنّت الهی تغییر و تبدیلی نخواهی یافت!"
          ],
          "fa.moezzi": [
            "شیوه خدا که گذشت از پیش و هرگز نیابی برای شیوه خدا دگرگونی را"
          ],
          "fa.mojtabavi": [
            "نهاد خداست كه پيش از اين گذشته است، و هرگز براى نهاد خداى دگرگونى نخواهى يافت."
          ],
          "fa.sadeqi": [
            "سنّت الهی را (که) از پیش همین بوده (پاس‌دار و انتظار داشته باش) و برای سنّتِ الهی هرگز جایگزینی نخواهی یافت."
          ]
        }
      },
      {
        "index": 4607,
        "local_index": 24,
        "part_type": "Verse",
        "path": "/books/quran:48:24",
        "text": [
          "وَ هُوَ الَّذِي‌ کَفَ‌ أَيْدِيَهُمْ‌ عَنْکُمْ‌ وَ أَيْدِيَکُمْ‌ عَنْهُمْ‌ بِبَطْنِ‌ مَکَّةَ مِنْ‌ بَعْدِ أَنْ‌ أَظْفَرَکُمْ‌ عَلَيْهِمْ‌ وَ کَانَ‌ اللَّهُ‌ بِمَا تَعْمَلُونَ‌ بَصِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "It was He who restrained their hands from you in the heart of Makkah, and your hands from them, after He had given you victory over them, as God sees all that you do."
          ],
          "en.ahmedraza": [
            "And it is He Who restrained their hands from you, and your hands from them in the valley of Mecca, after having given you control over them; and Allah sees all what you do."
          ],
          "en.arberry": [
            "It is He who restrained their hands from you, and your hands from them, in the hollow of Mecca, after that He made you victors over them. God sees the things you do."
          ],
          "en.daryabadi": [
            "And He it is Who restrained their hands from you and Your hands from them, in the vale of Makka so, after He had made you superior to them; and Allah is of that which ye work ever a Beholder."
          ],
          "en.hilali": [
            "And He it is Who has withheld their hands from you and your hands from them in the midst of Makkah, after He had made you victors over them. And Allah is Ever the All-Seer of what you do."
          ],
          "en.itani": [
            "It is He who withheld their hands from you, and your hands from them, in the valley of Mecca, after giving you advantage over them. God is Observer of what you do."
          ],
          "en.maududi": [
            "He it is Who restrained their hands from you, and your hands from them in the valley of Makkah, even though He had made you victorious against them. Allah was watching all that you did."
          ],
          "en.mubarakpuri": [
            "And He it is Who has withheld their hands from you and your hands from them in the midst of Makkah, after He had made you victors over them. And Allah sees what you do."
          ],
          "en.pickthall": [
            "And He it is Who hath withheld men's hands from you, and hath withheld your hands from them, in the valley of Mecca, after He had made you victors over them. Allah is Seer of what ye do."
          ],
          "en.qarai": [
            "It is He who withheld their hands from you, and your hands from them, in the valley of Makkah, after He had given you victory over them, and Allah sees best what you do."
          ],
          "en.qaribullah": [
            "It was He who restrained their hands from you and your hands from them in the hollow (Hudaibiah) of Mecca after He had given you victory over them. Allah sees the things you do."
          ],
          "en.sahih": [
            "And it is He who withheld their hands from you and your hands from them within [the area of] Makkah after He caused you to overcome them. And ever is Allah of what you do, Seeing."
          ],
          "en.sarwar": [
            "It is He who kept peace between you and the people of the valley of Mecca after having given you a victory over them. God is Well Aware of what you do."
          ],
          "en.shakir": [
            "And He it is Who held back their hands from you and your hands from them in the valley of Mecca after He had given you victory over them; and Allah is Seeing what you do."
          ],
          "en.transliteration": [
            "Wahuwa alla<u>th</u>ee kaffa aydiyahum AAankum waaydiyakum AAanhum biba<u>t</u>ni makkata min baAAdi an a<i><u>th</u></i>farakum AAalayhim wak<u>a</u>na All<u>a</u>hu bim<u>a</u> taAAmaloona ba<u>s</u>eer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "It is He who withheld their hands from you, and your hands from them in the valley of Makkah, after giving you victory over them. God sees what you do."
          ],
          "en.yusufali": [
            "And it is He Who has restrained their hands from you and your hands from them in the midst of Makka, after that He gave you the victory over them. And Allah sees well all that ye do."
          ],
          "fa.ansarian": [
            "و اوست که پس از آنکه شما را [بی جنگ و خونریزی] بر دشمن پیروز و مسلط کرد، دست های آنان را از [جنگ با] شما و دست های شما را از [جنگ با] آنان در دل مکه [که منطقه حدیبیه است] باز داشت؛ و خدا همواره به آنچه انجام می دهید بیناست."
          ],
          "fa.ayati": [
            "اوست كه چون در بطن مكه بر آنها پيروزيتان داد، دست آنها را از شما و دست شما را از آنها بازداشت. و خدا به كارهايى كه مى‌كرديد آگاه و بينا بود."
          ],
          "fa.bahrampour": [
            "و اوست آن كه در دل مكه پس از پيروز كردن شما بر آنان، دست‌هاى آنها را از شما و دست‌هاى شما را از آنها كوتاه كرد [تا جنگى رخ ندهد كه مصلحت در اين بود]، و خدا به آنچه مى‌كنيد بيناست"
          ],
          "fa.fooladvand": [
            "و اوست همان كسى كه در دل مكه -پس از پيروزكردن شما بر آنان- دستهاى آنها را از شما و دستهاى شما را از ايشان كوتاه گردانيد، و خدا به آنچه مى‌كنيد همواره بيناست."
          ],
          "fa.ghomshei": [
            "و او خدایی است که دست کفّار را از سر شما و دست شما را هم به زمین مکّه پس از فیروزیتان از سر آنها کوتاه کرد (که به امر خدا پیغمبر روز فتح مکّه برای حفظ جان دشمنان خانه‌هایی را پناه قرار داد) و خدا به هر چه می‌کنید بیناست."
          ],
          "fa.khorramdel": [
            "او همان کسی است که در درون مکّه (و در زیر پنجه‌ی دشمن) دست کافران را از شما، و دست شما را از ایشان کوتاه کرد، بعد از آنکه (در جنگهای قبلی) شما را بر آنان پیروز گردانیده بود، و خداوند می‌بیند هرچیزی را که بکنید. [[«بَطْنِ مَکَّةَ»: وسط مکه. درون مکه. مراد سرزمین حدیبیه است که نزدیک مکه است. «أَظْفَرَکُمْ»: شما را پیروز گرداند.]]"
          ],
          "fa.khorramshahi": [
            "و هموست که پس از آنکه شما را بر ایشان پیروزی داد، در میان مکه دستان ایشان را از شما، و دستان شما را از ایشان بازداشت، و خداوند به آنچه می‌کنید بیناست‌"
          ],
          "fa.makarem": [
            "او کسی است که دست آنها را از شما، و دست شما را از آنان در دل مکّه کوتاه کرد، بعد از آنکه شما را بر آنها پیروز ساخت؛ و خداوند به آنچه انجام می‌دهید بیناست!"
          ],
          "fa.moezzi": [
            "و اوست آنکه باز داشت دستهای ایشان را از شما و دستهای شما را از ایشان در شکم مکّه از پس آنکه پیروزی داد شما را بر ایشان و خدا است بدانچه کنید بینا"
          ],
          "fa.mojtabavi": [
            "و اوست كه دستهاى آنان را از شما و دستهاى شما را از آنان در وادى مكه- زمين نزديك مكه در حديبيه- باز داشت پس از آنكه شما را بر آنها پيروزى داد- و توانستيد بى جنگ و خونريزى به سرزمين آنها در آييد- و خدا بدانچه مى‌كنيد بيناست."
          ],
          "fa.sadeqi": [
            "و اوست کسی که در دل مکّه - پس از پیروز کردنتان بر آنان - دست‌هایشان را از شما و دست‌هایتان را از ایشان بازداشت، پس از آنکه شما را بر آنان چیره ساخت. و خدا به آنچه می‌کنید بسی بینا بوده است."
          ]
        }
      },
      {
        "index": 4608,
        "local_index": 25,
        "part_type": "Verse",
        "path": "/books/quran:48:25",
        "text": [
          "هُمُ‌ الَّذِينَ‌ کَفَرُوا وَ صَدُّوکُمْ‌ عَنِ‌ الْمَسْجِدِ الْحَرَامِ‌ وَ الْهَدْيَ‌ مَعْکُوفاً أَنْ‌ يَبْلُغَ‌ مَحِلَّهُ‌ وَ لَوْ لاَ رِجَالٌ‌ مُؤْمِنُونَ‌ وَ نِسَاءٌ مُؤْمِنَاتٌ‌ لَمْ‌ تَعْلَمُوهُمْ‌ أَنْ‌ تَطَئُوهُمْ‌ فَتُصِيبَکُمْ‌ مِنْهُمْ‌ مَعَرَّةٌ بِغَيْرِ عِلْمٍ‌ لِيُدْخِلَ‌ اللَّهُ‌ فِي‌ رَحْمَتِهِ‌ مَنْ‌ يَشَاءُ لَوْ تَزَيَّلُوا لَعَذَّبْنَا الَّذِينَ‌ کَفَرُوا مِنْهُمْ‌ عَذَاباً أَلِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "It were those who disbelieved who hindered you from (going to) the Holy Mosque, preventing your offerings from arriving at the place of sacrifice. Had it not been for (the presence of) believers, men and women, (among the unbelievers) of whom you were unaware, and whom you might have trampled and thus incurred guilt unknowingly on account of them, (the matter would have been settled). (But this was not done) so that God may admit into His favour whom He willed. If these (believers) had been separated from them, He would have inflicted a grievous punishment on the unbelievers."
          ],
          "en.ahmedraza": [
            "It was these who disbelieved and prevented you from the Sacred Mosque, and stopped the sacrificial animals from reaching their place; and were it not for some Muslim men and Muslim women, whom you do not know – lest you may crush them and unintentionally incur some violation due to them – Allah would have permitted you to slay them; this relief for them, is so that Allah may admit into His mercy whomever He wills; and had they been separated, We would have indeed punished the disbelievers among them with a painful punishment."
          ],
          "en.arberry": [
            "They are the ones who disbelieved, and barred you from the Holy Mosque and the offering, detained so as not to reach its place of sacrifice. If it had not been for certain men believers and certain women believers whom you knew not, lest you should trample them, and there befall you guilt unwittingly on their account (that God may admit into His mercy whom He will), had they been separated clearly, then We would have chastised the unbelievers among them with a painful chastisement."
          ],
          "en.daryabadi": [
            "They were those who disbelieved and hindered you from the Sacred Mosque and hindered the detained offering that it should arrive at the goal thereof. And had it not been for believing men and believin women whom ye knew not, and that ye might have trampled on them and thus there might have befallen you crime on their account unwittingly. He had not restrained your hands from them. But this He did that He might bring into His mercy whomsoever He will. Had they been distinguished one from another, surely We had tormented those who disbelieved among them with a torment afflictive."
          ],
          "en.hilali": [
            "They are the ones who disbelieved (in the Oneness of Allah Islamic Monotheism), and hindered you from Al-Masjid-al-Haram (the sacred mosque of Makkah) and the sacrificial animals, detained from reaching their place of sacrifice. Had there not been believing men and believing women whom you did not know, that you may kill them, and on whose account a sin would have been committed by you without (your) knowledge, that Allah might bring into His Mercy whom He will, if they (the believers and the disbelievers) should have been apart, We verily had punished those of them who disbelieved, with painful torment."
          ],
          "en.itani": [
            "It is they who disbelieved, and barred you from the Sacred Mosque, and prevented the offering from reaching its destination. Were it not for faithful men and faithful women, whom you did not know, you were about to hurt them, and became guilty of an unintentional crime. Thus God admits into His mercy whomever He wills. Had they dispersed, We would have punished those who disbelieved among them with a painful penalty."
          ],
          "en.maududi": [
            "They are the ones who disbelieved and barred you from the Inviolable Mosque and prevented the animals you had designated for sacrifice from reaching the place of their offering. If it had not been for the believing men and believing women (who lived in Makkah and) whom you did not know, and had there not been the fear that you might trample on them and unwittingly incur blame on their account, (then fighting would not have been put to a stop. It was stopped so that) Allah may admit to His Mercy whomsoever He pleases. Had those believers been separated from the rest, We would certainly have inflicted a grievous chastise-ment on those of them [i.e. the Makkans) who disbelieved."
          ],
          "en.mubarakpuri": [
            "They are those who disbelieved and hindered you from Al-Masjid Al-Haram and detained the sacrificial animals, from reaching their place of sacrifice. Had there not been believing men and believing women whom you did not know, that you may kill and on whose account a sin would have been committed by you without (your) knowledge, that Allah might bring into His mercy whom He wills -- if they had been apart, We verily, would have punished with painful torment those of them who disbelieved."
          ],
          "en.pickthall": [
            "These it was who disbelieved and debarred you from the Inviolable Place of Worship, and debarred the offering from reaching its goal. And if it had not been for believing men and believing women, whom ye know not - lest ye should tread them under foot and thus incur guilt for them unknowingly; that Allah might bring into His mercy whom He will - If (the believers and the disbelievers) had been clearly separated We verily had punished those of them who disbelieved with painful punishment."
          ],
          "en.qarai": [
            "They are the ones who disbelieved and barred you from the Sacred Mosque, and kept the offering from reaching its destination. And were it not for [certain] faithful men and faithful women, whom you did not know—lest you should trample them, and thus the blame for [killing] them should fall on you unawares; [He held you back] so that Allah may admit into His mercy whomever He wishes. Had they been separate, We would have surely punished the faithless among them with a painful punishment."
          ],
          "en.qaribullah": [
            "They are those who disbelieved and barred you from the Holy Mosque and the offering detained so as not to reach its place of sacrifice if it had not been for certain believing men and certain believing women whom you did not know, you might have trampled upon them, and so sin reached you because of (killing) them while you did not know. In order that Allah admits into His Mercy whom He will, had they (the believers) been easy to distinguish, We would have punished the unbelievers among them with a painful punishment."
          ],
          "en.sahih": [
            "They are the ones who disbelieved and obstructed you from al-Masjid al-Haram while the offering was prevented from reaching its place of sacrifice. And if not for believing men and believing women whom you did not know - that you might trample them and there would befall you because of them dishonor without [your] knowledge - [you would have been permitted to enter Makkah]. [This was so] that Allah might admit to His mercy whom He willed. If they had been apart [from them], We would have punished those who disbelieved among them with painful punishment"
          ],
          "en.sarwar": [
            "It was the disbelievers who kept you from the Sacred Mosque and prevented your sacrificial offering from reaching its proper place. God would not have kept you from fighting the disbelievers, had there not been believing men and women (among them) whom you did not know and whom you might have unknowingly harmed. God did this because He grants mercy to whomever He wants. Had they been distinguishable from the believers, We would certainly have punished them with a painful torment."
          ],
          "en.shakir": [
            "It is they who disbelieved and turned you away from the Sacred Mosque and (turned off) the offering withheld from arriving at its destined place; and were it not for the believing men and the believing women, whom, not having known, you might have trodden down, and thus something hateful might have afflicted you on their account without knowledge-- so that Allah may cause to enter into His mercy whomsoever He pleases; had they been widely separated one from another, We would surely have punished those who disbelieved from among them with a painful punishment."
          ],
          "en.transliteration": [
            "Humu alla<u>th</u>eena kafaroo wa<u>s</u>addookum AAani almasjidi al<u>h</u>ar<u>a</u>mi wa<b>a</b>lhadya maAAkoofan an yablugha ma<u>h</u>illahu walawl<u>a</u> rij<u>a</u>lun muminoona wanis<u>a</u>on mumin<u>a</u>tun lam taAAlamoohum an ta<u>t</u>aoohum fatu<u>s</u>eebakum minhum maAAarratun bighayri AAilmin liyudkhila All<u>a</u>hu fee ra<u>h</u>matihi man yash<u>a</u>o law tazayyaloo laAAa<u>thth</u>abn<u>a</u> alla<u>th</u>eena kafaroo minhum AAa<u>tha</u>ban aleem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "It was they who were bent on denying the truth, and who debarred you from the Sacred Mosque and who prevented your offering from reaching its place of sacrifice. And had it not been for the believing men and believing women [in Makkah] whom you might unwittingly have trampled underfoot, and on whose account you might have, unknowingly, become guilty, [God would have commanded you to fight it out with them; but He ordained it thus] so that He may bring whoever He will into His mercy. If they [the believers] had been clearly separated, We would have punished those who were bent on denying the truth with a painful punishment."
          ],
          "en.yusufali": [
            "They are the ones who denied Revelation and hindered you from the Sacred Mosque and the sacrificial animals, detained from reaching their place of sacrifice. Had there not been believing men and believing women whom ye did not know that ye were trampling down and on whose account a crime would have accrued to you without (your) knowledge, (Allah would have allowed you to force your way, but He held back your hands) that He may admit to His Mercy whom He will. If they had been apart, We should certainly have punished the Unbelievers among them with a grievous Punishment."
          ],
          "fa.ansarian": [
            "آنان کسانی هستند که کفر ورزیدند و شما را از [ورود به] مسجدالحرام باز داشتند و نیز نگذاشتند قربانی هایی که با خود آورده بودید به محل قربانی اش برسد، و اگر مردان و زنان مؤمن ناشناسی در میان مکه نبودند، تا جنگ شما سبب کشته شدن آن بی گناهان شود و در نتیجه امر ناملایم و مکروهی [چون دیه] گریبان شما را بگیرد [شما را از جنگ باز نمی داشتیم، ولی بازداشتیم] تا خدا هرکه را [مانند مردان و زنان مومنی که برای شما ناشناخته بودند] بخواهد در رحمتش درآورد. [و] اگر مؤمنان از کافران جدا بودند یقیناً کافران [از اهل مکه] را به عذابی دردناک عذاب می کردیم"
          ],
          "fa.ayati": [
            "ايشان همانهايند كه كفر ورزيدند و شما را از مسجد الحرام بازداشتند و نگذاشتند كه قربانى به قربانگاهش برسد. اگر مردان مسلمان و زنان مسلمانى كه آنها را نمى‌شناسيد در ميان آنها نبودند و بيم آن نبود كه آنها را زير پاى درنورديد و نادانسته مرتكب گناه شويد، خدا دست شما را از آنها بازنمى‌داشت. و خدا هر كه را بخواهد مشمول رحمت خود گرداند. اگر از يكديگر جدا مى‌بودند، كافرانشان را به عذابى دردآور عذاب مى‌كرديم."
          ],
          "fa.bahrampour": [
            "آنها كسانى بودند كه كافر شدند و شما را از مسجد الحرام بازداشتند و نگذاشتند قربانى [شما] كه بازداشته شده بود به محلّش برسد. و اگر مردان و زنان مؤمنى كه شما آنها را نمى‌شناختيد [در ميان آنها] نبودند كه [ممكن بود] ندانسته آنها را بكوبيد و [از اين بابت‌"
          ],
          "fa.fooladvand": [
            "آنها بودند كه كفر ورزيدند و شما را از مسجد الحرام بازداشتند و نگذاشتند قربانى [شما] كه بازداشته شده بود به محلش برسد، و اگر [در مكه‌] مردان و زنان با ايمانى نبودند كه [ممكن بود] بى‌آنكه آنان را بشناسيد، ندانسته پايمالشان كنيد و تاوانشان بر شما بماند [فرمان حمله به مكه مى‌داديم‌] تا خدا هر كه را بخواهد در جوار رحمت خويش درآورد. اگر [كافر و مؤمن‌] از هم متمايز مى‌شدند، قطعاً كافران را به عذاب دردناكى معذب مى‌داشتيم."
          ],
          "fa.ghomshei": [
            "هم آنان بودند که کافر شدند و راه مسجد الحرام را بر شما بستند و قربانی شما را از رسیدن به محل خود (مکّه) منع کردند. و اگر مردان مؤمن و زنان مؤمنه‌ای که شما اکنون نمی‌شناسید (در مکه) وجود نداشتند که اگر حمله کنید آنها را ندانسته پامال هلاک می‌سازید پس دیه و غرامت خون آن مؤمنان به گردن شما می‌ماند (اگر این قضیّه نبود به شما اجازه حمله به مکه داده می‌شد و لیکن این اجازه به تأخیر افتاد) تا خدا هر که را بخواهد در رحمت خود داخل گرداند (و به نور اسلام هدایت کند). اگر (عناصر کفر و ایمان) از یکدیگر جدا بودند همانا کسانی از آنان را که کافرند به عذابی دردناک معذّب می‌ساختیم."
          ],
          "fa.khorramdel": [
            "آنان همانهائی هستند که کفر ورزیده‌اند، و از ورود شما به مسجدالحرام جلوگیری کرده‌اند، و نگذاشته‌اند قربانیهائی که با خود نگاه داشته‌اید به قربانگاه برسد. اگر مردان و زنان مؤمنی را لگدمال نمی‌کردید که (در میان آنان هستند و) شما ایشان را نمی‌شناسید و از این راه عیب و عار و زیان و ضرری ناآگاهانه به شما نمی‌رسید (خداوند هرگز مانع این جنگ نمی‌شد. دست شما را از ایشان کوتاه کرد) تا خدا هر که را بخواهد غرق رحمت خود سازد (و جامه‌ی ایمانِ به اسلام را به تن او کند). اگر (کافران و مؤمنان ضعیفی که در مکّه نهانی ایمان آورده‌اند) از یکدیگر جدا می‌بودند، کافران ایشان را (با غلبه‌ی شما بر آنان) به عذاب دردناکی گرفتار می‌کردیم. [[«الْهَدْیَ»: (نگا: بقره / 196، مائده / 2 و 95 و 97). «مَعْکُوفاً»: محبوس و ممنوع. در اینجا مراد نگاه داشته شده و اختصاص یافته به فقرای بیت‌الله است. «مَحِلَّهُ»: قربانگاه. محل ذبح (نگا: بقره / 196، حج / 33). «لَوْ لا ...»: جواب آن محذوف و تقدیر چنین است: لَأَذِنَ لَکُمْ فِی دُخُولِ مَکَّةَ، وَ لَسَلَّطَکُمْ عَلَی الْمُشْرِکینَ ... لَأَذِنَ لَکُمْ فِی الْفَتْحِ لَما کَفَّ أَیْدِیَکُمْ عَنْهُمْ. «رِجَالٌ ... وَ نِسَآءٌ ...»: مراد مردان و زنان مؤمن ضعیف و ناتوانی است که در مکه نهانی ایمان آورده بودند و در آنجا می‌زیستند. یا چه بسا مراد کسانی باشد که از خود قریشیان بعدها ایمان آوردند و در راه اسلام فداکاریها و جان‌نثاریها کردند. «أَن تَطَؤُوهُمْ»: اگر بیم آن نبود این که ایشان را لگدمال و نابود کنید. جمله بدل از رِجَالٌ وَ نِسَآءٌ یا بدل از ضمیر (هُمْ) در فعل (لَمْ تَعْلَمُوهُمْ) است. «مَعَرَّةٌ»: ننگ و عار. زیان و ضرر. در اینجا مراد کار ناپسندی است که موجب تأسف شود. «لِیُدْخِلَ ...»: علت برای چیزی است که جواب محذوف (لَوْ لا) دالّ بر آن است. یعنی: هدف این بود که داخل سازد به. «تَزَیَّلُوا»: جدا شده بودند. یعنی اگر مؤمنان و کافران جدا از هم می‌زیستند و قابل تشخیص از هم بودند.]]"
          ],
          "fa.khorramshahi": [
            "آنان بودند که کفرورزیدند و شما را از مسجدالحرام باز داشتند و نگذاشتند قربانی [شما] که باز داشته شده بود، به محل [قربانگاه‌]اش برسد، و اگر [در مکه‌] مردان و زنان [مستضعف‌] با ایمانی نبودند که [ممکن بود] بی‌آنکه آنان را بشناسید، ندانسته پایمالشان کنید و تاوانشان بر شما بماند [فرمان حمله به مکه می‌دادیم‌] تا خدا هر که را بخواهد در جوار رحمت خویش درآورد اگر [کافران و مؤمنان‌] از هم متمایز می‌شدند، قطعا از میان آنان کافران را به عذاب دردناکی معذب می‌داشتیم‌"
          ],
          "fa.makarem": [
            "آنها کسانی هستند که کافر شدند و شما را از (زیارت) مسجد الحرام و رسیدن قربانیهایتان به محل قربانگاه بازداشتند؛ و هرگاه مردان و زنان با ایمانی در این میان بدون آگاهی شما، زیر دست و پا، از بین نمی‌رفتند که از این راه عیب و عاری ناآگاهانه به شما می‌رسید، (خداوند هرگز مانع این جنگ نمی‌شد)! هدف این بود که خدا هر کس را می‌خواهد در رحمت خود وارد کند؛ و اگر مؤمنان و کفّار (در مکه) از هم جدا می‌شدند، کافران را عذاب دردناکی می‌کردیم!"
          ],
          "fa.moezzi": [
            "آنانند که کفر ورزیدند و بازداشتند شما را از مسجد حرام و قربانی را بسته از آنکه به جایگاه خود رسد و اگر نبود مردان مومن و زنان مؤمنه که نشناخته پایمال کنید پس برسد شما را از ایشان گنهی به نادانی تا درآرد خدا به رحمت خویش هر که را خواهد اگر جدا می‌شدند هر آینه عذاب می‌کردیم آنان را که کفر ورزیدند از ایشان عذابی دردناک‌"
          ],
          "fa.mojtabavi": [
            "ايشانند كه كافر شدند و شما را از مسجد الحرام- نمازگاه شكوهمند- بازداشتند و قربانى- شترانى كه براى قربانى آورده بوديد- را باز داشتند و نگذاشتند كه به قربانگاهش- منى- برسد، و اگر [در مكه‌] مردان و زنان مؤمنى نبودند كه شما ايشان را نمى‌شناختيد و بى‌آگاهى در زير پاى مى گرفتيد- مى‌كشتيد- پس، از آنان گزندى ناخوشايند- اندوهى به سبب قتل مؤمنان و پرداخت ديه كه كفاره كشتن مؤمن به خطاست- به شما مى‌رسيد، [خداوند دست شما را از آنان باز نمى‌داشت، ليكن شما را از كشتن اهل مكه باز داشت‌] تا خداى هر كه را خواهد به مهر و بخشايش خويش در آرد. اگر از هم جدا مى‌بودند هر آينه كافرانشان را عذاب مى‌كرديم عذابى دردناك."
          ],
          "fa.sadeqi": [
            "آنان کسانی می‌باشند که کافر شدند و از (ورود) شما (به) مسجدالحرام جلوگیری کردند و نگذاشتند قربانی نگه‌داشته‌ی شما را به محلش برسد و اگر (در مکّه) مردان و زنان باایمانی نبودند که (ممکن بود) بی‌آنکه آنان را بشناسید، ندانسته پایمالشان کنید. و عار و بی‌مقداری از ایشان برایتان بماند (فرمان حمله به مکّه می‌دادیم) تا خدا هر که را بخواهد در رحمت خویش آورد. اگر (کافر و مؤمن) از هم متمایز می‌شدند، همواره کافران را به عذاب دردناکی معذّب می‌داشتیم."
          ]
        }
      },
      {
        "index": 4609,
        "local_index": 26,
        "part_type": "Verse",
        "path": "/books/quran:48:26",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:2:1:10:5",
            "/books/al-kafi:4:3:228:1",
            "/books/al-kafi:6:8:34:5",
            "/books/al-kafi:4:3:230:1"
          ]
        },
        "text": [
          "إِذْ جَعَلَ‌ الَّذِينَ‌ کَفَرُوا فِي‌ قُلُوبِهِمُ‌ الْحَمِيَّةَ حَمِيَّةَ الْجَاهِلِيَّةِ فَأَنْزَلَ‌ اللَّهُ‌ سَکِينَتَهُ‌ عَلَى‌ رَسُولِهِ‌ وَ عَلَى‌ الْمُؤْمِنِينَ‌ وَ أَلْزَمَهُمْ‌ کَلِمَةَ التَّقْوَى‌ وَ کَانُوا أَحَقَ‌ بِهَا وَ أَهْلَهَا وَ کَانَ‌ اللَّهُ‌ بِکُلِ‌ شَيْ‌ءٍ عَلِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "When the unbelievers fostered a sense of honour in their hearts, a sense of pagan honour, God sent down a sense of tranquility on His Apostle and the believers, and obliged them to an act of self-restraint, for they were deserving and worthy of it. God is cognisant of everything."
          ],
          "en.ahmedraza": [
            "Whereas the disbelievers had set up in their hearts an obstinacy – the same obstinacy of the days of ignorance – so Allah sent down His solace upon His Noble Messenger and upon the believers, and decreed upon them the words of piety, and they were more deserving and suitable for it; and Allah is the All Knowing."
          ],
          "en.arberry": [
            "When the unbelievers set in their hearts fierceness, the fierceness of pagandom, then God sent down His Shechina upon His Messenger and the believers, and fastened to them the word of godfearing to which they have better right and are worthy of; and God has' knowledge of everything."
          ],
          "en.daryabadi": [
            "When those who disbelieve had put in their hearts a zeal, the zeal of Paganism, then Allah sent down His tranquillity upon His apostle and upon the believers, and kept them fixed on the way of piety, and they were worthy thereof and meet therefor; and Allah is of everything ever Knower."
          ],
          "en.hilali": [
            "When those who disbelieve had put in their hearts pride and haughtiness the pride and haughtiness of the time of ignorance, then Allah sent down His Sakinah (calmness and tranquillity) upon His Messenger (SAW) and upon the believers, and made them stick to the word of piety (i.e. none has the right to be worshipped but Allah), and they were well entitled to it and worthy of it. And Allah is the All-Knower of everything."
          ],
          "en.itani": [
            "Those who disbelieved filled their hearts with rage—the rage of the days of ignorance. But God sent His serenity down upon His Messenger, and upon the believers, and imposed on them the words of righteousness—of which they were most worthy and deserving. God is aware of everything."
          ],
          "en.maududi": [
            "(This is why) when the unbelievers set in their hearts a fierce bigotry -- the bigotry of ignorance -- Allah bestowed inner peace upon His Messenger and upon the believers and made the word of piety binding on them. They were more deserving and worthier thereof. Allah has knowledge of everything."
          ],
          "en.mubarakpuri": [
            "When those who disbelieve had put in their hearts pride and haughtiness -- the pride and haughtiness of the time of ignorance, -- then Allah sent down His calmness and tranquillity upon His Messenger and upon the believers, and made them stick to the word of Taqwa; and they were well entitled to it and worthy of it. And Allah is the All-Knower of everything."
          ],
          "en.pickthall": [
            "When those who disbelieve had set up in their hearts zealotry, the zealotry of the Age of Ignorance, then Allah sent down His peace of reassurance upon His messenger and upon the believers and imposed on them the word of self-restraint, for they were worthy of it and meet for it. And Allah is Aware of all things."
          ],
          "en.qarai": [
            "When the faithless nourished bigotry in their hearts, the bigotry of pagan ignorance, Allah sent down His composure upon His Apostle and the faithful, and made them abide by the word of Godwariness, for they were the worthiest of it and deserved it, and Allah has knowledge of all things."
          ],
          "en.qaribullah": [
            "And when the unbelievers established in their hearts fierce bigotry, the fierce bigotry of ignorance, Allah sent down His tranquility on His Messenger and the believers and firmly fastened to them the Word of 'taqwa' (there is no god except Allah, and Muhammad is His Messenger, as it is the cause of righteousness) to which they have better right and are worthy of it. Allah has knowledge of all things."
          ],
          "en.sahih": [
            "When those who disbelieved had put into their hearts chauvinism - the chauvinism of the time of ignorance. But Allah sent down His tranquillity upon His Messenger and upon the believers and imposed upon them the word of righteousness, and they were more deserving of it and worthy of it. And ever is Allah, of all things, Knowing."
          ],
          "en.sarwar": [
            "Since the disbelievers held zealous ignorance in their hearts, like that of the pre-Islamic age of darkness, God gave confidence to His Messenger and to the believers, binding them to the principle of piety which they deserve. God has the knowledge of all things."
          ],
          "en.shakir": [
            "When those who disbelieved harbored in their hearts (feelings of) disdain, the disdain of (the days of) ignorance, but Allah sent down His tranquillity on His Apostle and on the believers, and made them keep the word of guarding (against evil), and they were entitled to it and worthy of it; and Allah is Cognizant of all things."
          ],
          "en.transliteration": [
            "I<u>th</u> jaAAala alla<u>th</u>eena kafaroo fee quloobihimu al<u>h</u>amiyyata <u>h</u>amiyyata alj<u>a</u>hiliyyati faanzala All<u>a</u>hu sakeenatahu AAal<u>a</u> rasoolihi waAAal<u>a</u> almumineena waalzamahum kalimata a<b>l</b>ttaqw<u>a</u> wak<u>a</u>noo a<u>h</u>aqqa bih<u>a</u> waahlah<u>a</u> wak<u>a</u>na All<u>a</u>hu bikulli shayin AAaleem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "While those who deny the truth made it a prestige issue [in their hearts], the bigotry of the days of ignorance, God sent His tranquillity down on to His Messenger and believers and firmly established in them the principle of righteousness, for they were indeed better entitled to it and more worthy of it. God has full knowledge of all things."
          ],
          "en.yusufali": [
            "While the Unbelievers got up in their hearts heat and cant - the heat and cant of ignorance,- Allah sent down His Tranquillity to his Messenger and to the Believers, and made them stick close to the command of self-restraint; and well were they entitled to it and worthy of it. And Allah has full knowledge of all things."
          ],
          "fa.ansarian": [
            "[یاد کن] هنگامی را که کافران [پس از قرارداد صلح حدیبیه] دل هایشان را از تعصّب و خشم شدید جاهلی آکنده کردند، پس خدا هم آرامشش را بر پیامبرش و مؤمنان نازل کرد و روح تقوا را [که حقیقت و جان توحید است] ملازم آنان نمود، و آنان به [روح تقوا] سزاوارتر و شایسته آن بودند؛ و خدا همواره به هر چیز داناست."
          ],
          "fa.ayati": [
            "آنگاه كه كافران تصميم گرفتند كه دل به تعصب، تعصب جاهلى سپارند، خدا نيز آرامش خود را بر دل پيامبرش و مؤمنان فروفرستاد و به تقوى الزامشان كرد كه آنان به تقوى سزاوارتر و شايسته‌تر بودند و خدا بر هر چيزى داناست."
          ],
          "fa.bahrampour": [
            "آن‌گاه كه كافران در دل خود تعصب ورزيدند تعصب جاهليت، [و مانع ورود شما به مكه شدند]، پس خدا آرامش خود را بر فرستاده‌ى خويش و بر مؤمنان نازل كرد و آنها را پاى‌بند آرمان تقوا نمود كه آنها بدان سزاوارتر بودند و اهليت آن را داشتند، و خدا به هر چيزى داناست"
          ],
          "fa.fooladvand": [
            "آنگاه كه كافران در دلهاى خود، تعصّب [آن هم‌] تعصّب جاهليّت ورزيدند، پس خدا آرامش خود را بر فرستاده خويش و بر مؤمنان فرو فرستاد، و آرمان تقوا را ملازم آنان ساخت، و [در واقع‌] آنان به [رعايت ]آن [آرمان‌] سزاوارتر و شايسته [اتصاف به‌] آن بودند، و خدا همواره بر هر چيزى داناست."
          ],
          "fa.ghomshei": [
            "آن گاه که کافران در دلها ناموس و حمیّت، آن هم حمیّت جاهلیّت پروردند (که نگذاشتند در عهدنامه صلح حدیبیّه کلمه بسم اللّه و رسول اللّه بنویسند و مؤمنان را بر سر حمیّت و غیرت ایمانی آوردند) پس خدا وقار و اطمینان خاطر بر رسول خود و بر مؤمنان نازل کرد و آنان را با کلمه (اخلاص و مقام) تقوا ملازم کرد که آنها سزاوارتر بر این مقام بودند و اهلیّت آن داشتند و خدا به همه امور عالم داناست."
          ],
          "fa.khorramdel": [
            "آنگاه که کافران تعصّب و نخوت جاهلیّت را در دلهایشان جای دادند (و تصمیم گرفتند که مؤمنان را به مکّه راه ندهند)، خدا اطمینان خاطری بهره‌ی پیغمبرش و بهره‌ی مؤمنان کرد (و آرامشی خوش به دلهایشان راه داد، تا در پرتو آن، طوفان خشم و ناراحتی خویش را فرو نشانند، و راضی به قضای خدا، و گوش به فرمان پیشوای خود باشند، و سر به شورش برندارند). همچنین خدا ایشان را بر روح ایمان ماندگار کرد و (به حقیقت از هر کس دیگری) سزاوارتر برای روح ایمان و برازنده‌ی آن بودند، و خدا از هر چیزی آگاه و بر هر کاری توانا است. [[«الْحَمِیَّةَ»: تعصب و جانبداری. سر باز زدن. غیرت. «حَمِیَّةَ الْجَاهِلِیَّةِ»: تعصب ناشی از جهالت و نادانی. جانبداری جاهلانه و بدون دلیل و برهان. غیرت غیرمنطقی و تعصب بیجا. بدل از (الْحَمِیَّةَ) است. «کَلِمَةَ التَّقْوی»: سخن پرهیزگارانه. سخنی که با گفتن آن، انسان خویشتن را از عذاب می‌رهاند که سخن توحید یعنی: لآ إِلهَ إِلاَّ اللهُ است. روحیه پرهیزگاری (نگا: تفسیر نمونه). روح ایمان (نگا: مجادله / 22، نساء / 171، همچنین: تفسیر المیزان). «أَحَقَّ»: سزاوارتر و شایسته‌تر. «أَهْلَهَا»: درخور و برازنده آن. مستحق آن.]]"
          ],
          "fa.khorramshahi": [
            "چنین بود که کافران در دلهایشان حمیت -حمیت جاهلیتآوردند، ولی خداوند آرامشش را بر پیامبرش و بر مؤمنان نازل کرد و آنان را پایبند حکم تقوا ساخت، و به آن سزاوارتر و اهل آن بودند، و خداوند به همه‌چیز داناست‌"
          ],
          "fa.makarem": [
            "(به خاطر بیاورید) هنگامی را که کافران در دلهای خود خشم و نخوت جاهلیّت داشتند؛ و (در مقابل،) خداوند آرامش و سکینه خود را بر فرستاده خویش و مؤمنان نازل فرمود و آنها را به حقیقت تقوا ملزم ساخت، و آنان از هر کس شایسته‌تر و اهل آن بودند؛ و خداوند به همه چیز دانا است."
          ],
          "fa.moezzi": [
            "گاهی که نهادند آنان که کفر ورزیدند در دل خویش خون‌گرمی (غیرت) را خون‌گرمی جاهلیّت پس فرستاد خدا آرامش خویش را بر پیمبرش و بر مؤمنان و همراه ایشان داشت گفتار پرهیزکاری (کلمه تقوی) را و آنانند سزاوارتر بدان و اهل آن و خدا است به همه چیز دانا"
          ],
          "fa.mojtabavi": [
            "[به ياد آريد] آنگاه كه كافران [مكه‌] در دلهاى خويش تعصب جاهليت- خشم و كين و تكبر ناروا- را پروردند پس خداوند آرامش خود را بر پيامبرش و بر مؤمنان فروآورد- تا جنگ نكردند و به صلح تن دادند و به مدينه بازگشتند- و سخن پرهيزگارى- توحيد، وفادارى، روح ايمان- را با آنان همراه داشت و ايشان سزاوارتر به آن و اهل آن بودند، و خدا به هر چيزى داناست."
          ],
          "fa.sadeqi": [
            "چون کافران در دل‌های خود، تعصّب، (آن هم) تعصّب جاهلیت نهادند، پس خدا آرامشی از خود بر فرستاده‌ی خویش و بر مؤمنان فرو فرستاد و کلمه‌ی تقوا را ملازم آنان ساخت و (در واقع) آنان به (رعایت) آن سزاوارتر و (هم) اهل آن بودند. و خدا همواره بر هر چیزی بسی دانا بوده است."
          ]
        }
      },
      {
        "index": 4610,
        "local_index": 27,
        "part_type": "Verse",
        "path": "/books/quran:48:27",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:6:8:34:5"
          ]
        },
        "text": [
          "لَقَدْ صَدَقَ‌ اللَّهُ‌ رَسُولَهُ‌ الرُّؤْيَا بِالْحَقِ‌ لَتَدْخُلُنَ‌ الْمَسْجِدَ الْحَرَامَ‌ إِنْ‌ شَاءَ اللَّهُ‌ آمِنِينَ‌ مُحَلِّقِينَ‌ رُءُوسَکُمْ‌ وَ مُقَصِّرِينَ‌ لاَ تَخَافُونَ‌ فَعَلِمَ‌ مَا لَمْ‌ تَعْلَمُوا فَجَعَلَ‌ مِنْ‌ دُونِ‌ ذٰلِکَ‌ فَتْحاً قَرِيباً"
        ],
        "translations": {
          "en.ahmedali": [
            "God has truly made the vision of His Apostle come true: You will surely enter the Holy Mosque in security if God please, without any fear, having shaved your heads and cut your hair. He knew what you did not know, and has vouchsafed you, apart from this, a victory near at hand."
          ],
          "en.ahmedraza": [
            "Allah has indeed made the truthful dream of His Noble Messenger, come true; indeed you will all enter the Sacred Mosque, if Allah wills, in safety – with your heads shaven or hair cut short – without fear; so He knows what you do not know, and has therefore ordained another imminent victory before this."
          ],
          "en.arberry": [
            "God has indeed fulfilled the vision He vouchsafed to His Messenger truly: 'You shall enter the Holy Mosque, if God wills, in security, your heads shaved, your hair cut short, not fearing.' He knew what you knew not, and appointed ere that a nigh victory."
          ],
          "en.daryabadi": [
            "Assuredly did Allah shew a true vision to His apostle in very truth; ye shall surely enter the Sacred Mosque, if Allah willeth, secure, having your heads shaven and your hair cut, and ye shall not fear. He knoweth that which ye know not; wherefore He appointed, beside that, a victory near at hand."
          ],
          "en.hilali": [
            "Indeed Allah shall fulfil the true vision which He showed to His Messenger (SAW) [i.e. the Prophet SAW saw a dream that he has entered Makkah along with his companions, having their (head) hair shaved and cut short] in very truth. Certainly, you shall enter Al-Masjid-al-Haram; if Allah wills, secure, (some) having your heads shaved, and (some) having your head hair cut short, having no fear. He knew what you knew not, and He granted besides that a near victory."
          ],
          "en.itani": [
            "God has fulfilled His Messenger’s vision in truth: “You will enter the Sacred Mosque, God willing, in security, heads shaven, or hair cut short, not fearing. He knew what you did not know, and has granted besides that an imminent victory.”"
          ],
          "en.maududi": [
            "Allah indeed showed His Messenger the true vision, one fully in accord with reality. If Allah so wills you shall certainly enter the Inviolable Mosque, in full security, you will shave your heads and cut your hair short, and do so without any fear. He knew what you did not know, and He granted you a victory near at hand even before (the fulfilment of the vision)."
          ],
          "en.mubarakpuri": [
            "Indeed Allah shall fulfill the true vision which He showed to His Messenger in very truth. Certainly, you shall enter Al-Masjid Al-Haram, if Allah wills, secure, (some) having your heads shaved, and (some) having your hair cut short, having no fear. He knew what you knew not, and He granted besides that a near victory."
          ],
          "en.pickthall": [
            "Allah hath fulfilled the vision for His messenger in very truth. Ye shall indeed enter the Inviolable Place of Worship, if Allah will, secure, (having your hair) shaven and cut, not fearing. But He knoweth that which ye know not, and hath given you a near victory beforehand."
          ],
          "en.qarai": [
            "Certainly Allah has fulfilled His Apostle’s vision in all truth: You will surely enter the Sacred Mosque, God willing, in safety and without any fear, with your heads shaven or hair cropped. So He knew what you did not know, and He assigned [you] besides that a victory near at hand."
          ],
          "en.qaribullah": [
            "Indeed, Allah, in truth, has realized His Messenger's vision. You shall enter the Sacred Mosque in security if Allah wills, with hair shaven or cut short and without fear. He knew what you did not know, and granted you a near victory."
          ],
          "en.sahih": [
            "Certainly has Allah showed to His Messenger the vision in truth. You will surely enter al-Masjid al-Haram, if Allah wills, in safety, with your heads shaved and [hair] shortened, not fearing [anyone]. He knew what you did not know and has arranged before that a conquest near [at hand]."
          ],
          "en.sarwar": [
            "God made the dream of His Messenger come true for a genuine purpose. (In this he was told), \"If God wills You (believers) will enter the Sacred Mosque, in security, with your heads shaved, nails cut, and without any fear in your hearts.\" He knew what you did not know. Besides this victory, He will give you another immediate victory."
          ],
          "en.shakir": [
            "Certainly Allah had shown to His Apostle the vision with truth: you shall most certainly enter the Sacred Mosque, if Allah pleases, in security, (some) having their heads shaved and (others) having their hair cut, you shall not fear, but He knows what you do not know, so He brought about a near victory before that."
          ],
          "en.transliteration": [
            "Laqad <u>s</u>adaqa All<u>a</u>hu rasoolahu a<b>l</b>rruy<u>a</u> bi<b>a</b>l<u>h</u>aqqi latadkhulunna almasjida al<u>h</u>ar<u>a</u>ma in sh<u>a</u>a All<u>a</u>hu <u>a</u>mineena mu<u>h</u>alliqeena ruoosakum wamuqa<u>ss</u>ireena l<u>a</u> takh<u>a</u>foona faAAalima m<u>a</u> lam taAAlamoo fajaAAala min dooni <u>tha</u>lika fat<u>h</u>an qareeb<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "God has in all truth shown His Messenger a true vision in which He said, \"God willing, you will most certainly enter the Sacred Mosque in safety and without fear, shaven-headed or with hair cut short\" -- God knew what you did not; and has given you a victory beforehand."
          ],
          "en.yusufali": [
            "Truly did Allah fulfil the vision for His Messenger: ye shall enter the Sacred Mosque, if Allah wills, with minds secure, heads shaved, hair cut short, and without fear. For He knew what ye knew not, and He granted, besides this, a speedy victory."
          ],
          "fa.ansarian": [
            "بی تردید خدا رؤیای پیامبرش را به حق و درستی تحقق داد [که در رؤیا وعده داده بود] شما قطعاً در حال امن و امنیت در حالی که سرهایتان را تراشیده و موی [یا ناخن] کوتاه کرده اید و بیمی ندارید، وارد مسجدالحرام خواهید شد. خدا آنچه را که شما نمی دانستید [که وعده ورود به مسجدالحرام در سال آینده است] دانست و پیش از آن پیروزی نزدیکی [که صلح حدیبیه بود برای شما] قرارداد."
          ],
          "fa.ayati": [
            "خدا رؤياى پيامبرش را به صدق پيوست كه گفته بود: اگر خدا بخواهد، ايمن، گروهى سرتراشيده و گروهى موى كوتاه كرده، بى هيچ بيمى به مسجدالحرام داخل مى‌شويد. او چيزها مى‌دانست كه شما نمى‌دانستيد. و جز آن در همين نزديكى فتحى نصيب شما كرده بود."
          ],
          "fa.bahrampour": [
            "حقا خدا رؤياى پيامبر خود را راست كرد كه شما حتما به خواست خدا سر تراشيده و موى سر كوتاه كرده بدون هيچ ترسى با خاطره‌ى آسوده به مسجد الحرام وارد خواهيد شد پس خدا چيزهايى [از مصالح پشت پرده‌] مى‌دانست كه شما نمى‌دانستيد، لذا پيش از آن [براى شما با صلح"
          ],
          "fa.fooladvand": [
            "حقاً خدا رؤياى پيامبر خود را تحقّق بخشيد [كه ديده بود:] شما بدون شكّ، به خواست خدا در حالى كه سر تراشيده و موى [و ناخن‌] كوتاه كرده‌ايد، با خاطرى آسوده در مسجد الحرام درخواهيد آمد. خدا آنچه را كه نمى‌دانستيد دانست، و غير از اين، پيروزى نزديكى [براى شما] قرار داد."
          ],
          "fa.ghomshei": [
            "البته خدا صدق و حقیقت خواب رسولش را آشکار و محقق ساخت که در عالم رؤیا دید شما مؤمنان به خواست خدا البته به مسجد الحرام با دل ایمن وارد شوید و سرها بتراشید و اعمال تقصیر بی ترس و هراس به جای آرید، و خدا آنچه را (از مصالح صلح حدیبیه) شما نمی‌دانستید می‌دانست و قبل از آن (که فتح مکه کنید) فتح نزدیک (حدیبیّه و خیبر) را مقرر داشت."
          ],
          "fa.khorramdel": [
            "خداوند خواب را راست و درست به پیغمبر خود نشان داده است. به خواست خدا همه‌ی شما حتماً در امن و امان و سر تراشیده و مو کوتاه کرده و بدون ترس، داخل مسجدالحرام خواهید شد، ولی خداوند چیزهائی را می‌دانست که شما نمی‌دانستید، و به همین جهت (قبل از فتح مکّه) فتح نزدیکی (که صلح حدیبیّه است) پیش آورد. [[«الرُّؤْیَا»: خواب. مراد خوابی است که پیغمبر در مدینه دیده بود. و آن این که پیغمبر قبل از عزیمت به حدیبیه، در خواب دید که او و اصحاب داخل مکه شده‌اند و کعبه را طواف می‌کنند، سپس سرها را تراشیده و موها را کوتاه نموده‌اند. «آمِنِینَ»: جمع آمِن، در امن و امان. «مُحَلِّقِینَ»: سرتراشیدگان. «مُقَصِّرِینَ»: مو کوتاه‌کردگان. حاجیان پس از فراغت از انجام مناسک حج، با تراشیدن موی سر یا کوتاه کردن موی سر، از احرام بدر می‌آیند. «مَا»: مراد مصلحت نهفته در صلح حدیبیه که ورود به مکه است. «مِن دُونِ ذلِکَ»: پیش از آن، یعنی قبل از ورود شما به مکه. «فَتْحاً قَرِیباً»: مراد فتح خیبر، یا صلح حدیبیه، و یا هردوی آنها است. (نگا: صفوة البیان، لمعانی القرآن).]]"
          ],
          "fa.khorramshahi": [
            "به راستی که خداوند رؤیای پیامبرش را به حقیقت پیوست، که شما ان شاء الله در امن و امان و حلق و تقصیر کرده وارد مسجدالحرام خواهید شد بی‌آنکه بیمی داشته باشید، و او چیزی را که شما نمی‌دانید می‌داند و جز این نیز پیروزی‌ای نزدیک نصیب شما گردانده است‌"
          ],
          "fa.makarem": [
            "خداوند آنچه را به پیامبرش در عالم خواب نشان داد راست گفت؛ بطور قطع همه شما بخواست خدا وارد مسجد الحرام می‌شوید در نهایت امنیّت و در حالی که سرهای خود را تراشیده یا کوتاه کرده‌اید و از هیچ کس ترس و وحشتی ندارید؛ ولی خداوند چیزهایی را می‌دانست که شما نمی‌دانستید (و در این تأخیر حکمتی بود)؛ و قبل از آن، فتح نزدیکی (برای شما) قرار داده است."
          ],
          "fa.moezzi": [
            "همانا راست آورد خدا به پیمبر خویش خواب را به درست (به حق) ّ که درآئید در مسجد حرام اگر خدا خواهد آسودگان (ایمنان) تراشندگان سرهای خویش و کوتاه‌کنندگان (ناخن و موی) ناهراسندگان پس دانست آنچه را ندانستید پس گذارد نزدیک آن پیروزیی نزدیک را"
          ],
          "fa.mojtabavi": [
            "همانا خدا خواب پيامبرش را بحق راست آورد- تحقق بخشيد- كه اگر خداى خواهد هر آينه به مسجد الحرام درخواهيد آمد، در ايمنى و سر تراشيده و كوتاه موى، بى آنكه بيمى داشته باشيد. پس مى‌دانست آنچه شما نمى‌دانستيد- از صلاح كارتان در صلح حديبيه- و جز اين [براى شما] فتحى نزديك- فتح خيبر- قرار داد- تا دل مؤمنان به آن فتح شاد شد و اندوه تأخير عمره از ميان برفت-."
          ],
          "fa.sadeqi": [
            "به‌راستی خدا رؤیای پیامبر خود را به‌درستی تحقّق بخشید (که) شما بدون شک، به خواست خدا در حالی که سرهاتان را تراشیده و (موها یا ناخن‌های خود را) کوتاه کرده‌اید، همواره بدون ترسی در مسجدالحرام در خواهید آمد. خدا آنچه را که نمی‌دانستید دانست. در نتیجه پس از این، پیروزیِ نزدیکی (برای شما) قرار داد."
          ]
        }
      },
      {
        "index": 4611,
        "local_index": 28,
        "part_type": "Verse",
        "path": "/books/quran:48:28",
        "text": [
          "هُوَ الَّذِي‌ أَرْسَلَ‌ رَسُولَهُ‌ بِالْهُدَى‌ وَ دِينِ‌ الْحَقِ‌ لِيُظْهِرَهُ‌ عَلَى‌ الدِّينِ‌ کُلِّهِ‌ وَ کَفَى‌ بِاللَّهِ‌ شَهِيداً"
        ],
        "translations": {
          "en.ahmedali": [
            "It is He who has sent His Apostle with the guidance and the true faith, so that He may exalt it over every other creed. God is sufficient as a witness."
          ],
          "en.ahmedraza": [
            "It is He Who has sent His Noble Messenger with the guidance and the true religion, in order to make it prevail over all other religions; and Allah is sufficient as a Witness. (The Holy Prophet is a light from Allah.)"
          ],
          "en.arberry": [
            "It is He who has sent His Messenger with the guidance and the religion of truth, that He may uplift it above every religion. God suffices as a witness."
          ],
          "en.daryabadi": [
            "He it is Who hath sent His apostle with the guidance and the true religion that He may make it prevail over all other religions, and Allah sufficeth as a Witness."
          ],
          "en.hilali": [
            "He it is Who has sent His Messenger (Muhammad SAW) with guidance and the religion of truth (Islam), that He may make it (Islam) superior over all religions. And All-Sufficient is Allah as a Witness."
          ],
          "en.itani": [
            "It is He who sent His Messenger with the guidance and the religion of truth, to make it prevail over all religions. God suffices as Witness."
          ],
          "en.maududi": [
            "He it is Who sent His Messenger with the True Guidance and the Religion of Truth that He may make it prevail over every religion. Sufficient is Allah as a witness (to this)."
          ],
          "en.mubarakpuri": [
            "He it is Who has sent His Messenger with guidance and the religion of truth, that He may make it superior to all religions. And All-Sufficient is Allah as a Witness."
          ],
          "en.pickthall": [
            "He it is Who hath sent His messenger with the guidance and the religion of truth, that He may cause it to prevail over all religion. And Allah sufficeth as a Witness."
          ],
          "en.qarai": [
            "It is He who has sent His Apostle with guidance and the true religion, that He may make it prevail over all religions, and Allah suffices as witness."
          ],
          "en.qaribullah": [
            "It is He who has sent His Messenger with guidance and the religion of truth, so that He exalts it above all other religions. Allah is the Sufficient Witness."
          ],
          "en.sahih": [
            "It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion. And sufficient is Allah as Witness."
          ],
          "en.sarwar": [
            "It is He who has sent His Messenger with guidance and the true religion to make it prevail over all other religions. God is a Sufficient witness to this Truth\"."
          ],
          "en.shakir": [
            "He it is Who sent His Apostle with the guidance and the true religion that He may make it prevail over all the religions; and Allah is enough for a witness."
          ],
          "en.transliteration": [
            "Huwa alla<u>th</u>ee arsala rasoolahu bi<b>a</b>lhud<u>a</u> wadeeni al<u>h</u>aqqi liyu<i><u>th</u></i>hirahu AAal<u>a</u> a<b>l</b>ddeeni kullihi wakaf<u>a</u> bi<b>A</b>ll<u>a</u>hi shaheed<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "He is the One who has sent His Messenger with guidance and the true religion, so that He may have it prevail over all [other] religions. God suffices as a witness!"
          ],
          "en.yusufali": [
            "It is He Who has sent His Messenger with Guidance and the Religion of Truth, to proclaim it over all religion: and enough is Allah for a Witness."
          ],
          "fa.ansarian": [
            "اوست که پیامبرش را با هدایت و دین حق فرستاد تا آن را بر همه ادیان پیروز کند، و کافی است که خدا [بر وقوع این حقیقت] گواه باشد."
          ],
          "fa.ayati": [
            "اوست كه پيامبرش را به هدايت و دين حق فرستاد تا آن دين را بر همه اديان پيروز گرداند. و خدا شهادت را كافى است."
          ],
          "fa.bahrampour": [
            "او كسى است كه پيامبر خود را با هدايت و آيين درست [به سوى مردم‌] فرستاد تا آن را بر همه اديان پيروز گرداند، و گواهى خدا [بر حقانيت پيامبر] كفايت مى‌كند"
          ],
          "fa.fooladvand": [
            "اوست كسى كه پيامبر خود را به [قصد] هدايت، با آيين درست روانه ساخت، تا آن را بر تمام اديان پيروز گرداند و گواه‌بودن خدا كفايت مى‌كند."
          ],
          "fa.ghomshei": [
            "او خدایی است که رسول خود را با هدایت (قرآن) و دین حق فرستاد تا آن را بر همه ادیان دنیا غالب گرداند و (بر حقیقت این سخن) گواهی خدا کافی است."
          ],
          "fa.khorramdel": [
            "خدا است که پیغمبر خود را همراه با رهنمون و آئین راستین (اسلام به سوی جملگی مردمان) روانه کرده است تا آن را بر همه‌ی آئینها پیروز گرداند. کافی است که خدا گواه (این چنین سخن و مسأله‌ای) باشد. [[«لِیُظْهِرَهُ عَلَی الدِّینِ کُلِّهِ ...»: (نگا: توبه / 33، صف / 9). «کَفی بِاللهِ شَهِیداً»: (نگا: نساء / 79 و 166، عنکبوت / 52).]]"
          ],
          "fa.khorramshahi": [
            "او کسی است که پیامبرش را با هدایت و دین حق فرستاده است، تا آن را بر همه ادیان پیروز گرداند، و خداوند گواهی را بس‌"
          ],
          "fa.makarem": [
            "او کسی است که رسولش را با هدایت و دین حق فرستاده تا آن را بر همه ادایان پیروز کند؛ و کافی است که خدا گواه این موضوع باشد!"
          ],
          "fa.moezzi": [
            "او است آنکه فرستاد پیمبر خود را به رهبری و کیش حقّ تا چیره گرداندش بر کیشها همگی و بس است خدا گواهی‌"
          ],
          "fa.mojtabavi": [
            "اوست كه پيامبرش را با رهنمونى [به راه راست‌] و دين حق فرستاد تا آن را بر همه دينها چيره گرداند، و خدا گواهى بسنده است- بر صدق پيامبرش-."
          ],
          "fa.sadeqi": [
            "اوست کسی که پیامبر خود را به (تمامی) هدایت، با آیین پای‌برجای راستا، و سرشار از حق روانه ساخت، تا آن را بر تمام ادیان پیروز گرداند و گواه بودن خدا کافی بوده است."
          ]
        }
      },
      {
        "index": 4612,
        "local_index": 29,
        "part_type": "Verse",
        "path": "/books/quran:48:29",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:2:1:76:4",
            "/books/al-kafi:4:1:37:16",
            "/books/al-kafi:2:1:4:2",
            "/books/al-kafi:2:1:75:15",
            "/books/al-kafi:5:1:4:1"
          ]
        },
        "text": [
          "مُحَمَّدٌ رَسُولُ‌ اللَّهِ‌ وَ الَّذِينَ‌ مَعَهُ‌ أَشِدَّاءُ عَلَى‌ الْکُفَّارِ رُحَمَاءُ بَيْنَهُمْ‌ تَرَاهُمْ‌ رُکَّعاً سُجَّداً يَبْتَغُونَ‌ فَضْلاً مِنَ‌ اللَّهِ‌ وَ رِضْوَاناً سِيمَاهُمْ‌ فِي‌ وُجُوهِهِمْ‌ مِنْ‌ أَثَرِ السُّجُودِ ذٰلِکَ‌ مَثَلُهُمْ‌ فِي‌ التَّوْرَاةِ وَ مَثَلُهُمْ‌ فِي‌ الْإِنْجِيلِ‌ کَزَرْعٍ‌ أَخْرَجَ‌ شَطْأَهُ‌ فَآزَرَهُ‌ فَاسْتَغْلَظَ فَاسْتَوَى‌ عَلَى‌ سُوقِهِ‌ يُعْجِبُ‌ الزُّرَّاعَ‌ لِيَغِيظَ بِهِمُ‌ الْکُفَّارَ وَعَدَ اللَّهُ‌ الَّذِينَ‌ آمَنُوا وَ عَمِلُوا الصَّالِحَاتِ‌ مِنْهُمْ‌ مَغْفِرَةً وَ أَجْراً عَظِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "Muhammad is the Prophet of God; and those who are with him are severe with infidels but compassionate among themselves. You may see them kneeling and bowing in reverence, seeking His favour and acceptance. Their mark is on their foreheads from the effect of prostrations. Their likeness in the Torah, and their likeness in the Gospel, is like a seed that sends out a stalk, then makes it firm, and it becomes strong and rises straight upon its stem, gladdening the cultivator's heart, in order to fill the unbelievers with dismay. God has promised those who believe and do the right forgiveness and a great reward."
          ],
          "en.ahmedraza": [
            "Mohammed (peace and blessings be upon him) is the Noble Messenger of Allah; and his companions are stern with the disbelievers and merciful among themselves – you will see them bowing and falling in prostration, seeking Allah’s munificence and His pleasure; their signs are on their faces, from the effects of their prostration; this trait of theirs is mentioned in the Taurat; and their trait is mentioned in the Injeel; like a cultivation that sprouted its shoot, then strengthened it, then thickened and then stood firm upon its stem, pleasing the farmer – in order to enrage the disbelievers with them; Allah has promised forgiveness and a great reward to those among them who have faith and do good deeds."
          ],
          "en.arberry": [
            "Muhammad is the Messenger of God, and those who are with him are hard against the unbelievers, merciful one to another. Thou seest them bowing, prostrating, seeking bounty from God and good pleasure. Their mark is on their faces, the trace of prostration. That is their likeness in the Torah, and their likeness in the Gospel: as a seed that puts forth its shoot, and strengthens it, and it grows stout and rises straight upon its stalk, pleasing the sowers, that through them He may enrage the unbelievers. God has promised those of them who believe and do deeds of righteousness forgiveness and a mighty wage."
          ],
          "en.daryabadi": [
            "Muhammad is the apostle of Allah. And those who are with him are stern against the infidels and merciful among themselves; Thou beholdest them bowing down and falling prostrate, seeking grace from Allah and His goodWill Mark of them is on their faces from the effect of prostration: such is their similitude in the Taurat. And their similitude in the lnjil: like Unto a sown corn that putteth forth its shoot and strengtheneth it, and swelieth, and riseth upon the stalk thereof delighting the sowers. Such are the early Muslims described that He may enrage the infidels with them. Allah hath promised Unto those among them who believe and work righteous works, forgiveness and a mighty hire."
          ],
          "en.hilali": [
            "Muhammad (SAW) is the Messenger of Allah, and those who are with him are severe against disbelievers, and merciful among themselves. You see them bowing and falling down prostrate (in prayer), seeking Bounty from Allah and (His) Good Pleasure. The mark of them (i.e. of their Faith) is on their faces (foreheads) from the traces of (their) prostration (during prayers). This is their description in the Taurat (Torah). But their description in the Injeel (Gospel) is like a (sown) seed which sends forth its shoot, then makes it strong, it then becomes thick, and it stands straight on its stem, delighting the sowers that He may enrage the disbelievers with them. Allah has promised those among them who believe (i.e. all those who follow Islamic Monotheism, the religion of Prophet Muhammad SAW till the Day of Resurrection) and do righteous good deeds, forgiveness and a mighty reward (i.e. Paradise)."
          ],
          "en.itani": [
            "Muhammad is the Messenger of God. Those with him are stern against the disbelievers, yet compassionate amongst themselves. You see them kneeling, prostrating, seeking blessings from God and approval. Their marks are on their faces from the effects of prostration. Such is their description in the Torah, and their description in the Gospel: like a plant that sprouts, becomes strong, grows thick, and rests on its stem, impressing the farmers. Through them He enrages the disbelievers. God has promised those among them who believe and do good deeds forgiveness and a great reward."
          ],
          "en.maududi": [
            "Muhammad is Allah's Messenger, and those who are with him are firm with the unbelievers but compassionate with one another. You see them occupied in bowing and prostrating and in seeking Allah's bounty and good pleasure. They are distinguished from others by the marks of prostration on their faces. Thus are they described in the Torah. And their parable in the Gospel is that of a tilth that puts forth its shoot, then strengthens it so that it becomes stout and stands firmly on its stem. This is a sight pleasing to the sowers and one by which the unbelievers will be enraged. As for those who believe and do righteous deeds, Allah has promised them forgiveness and a great reward."
          ],
          "en.mubarakpuri": [
            "Muhammad is the Messenger of Allah. And those who are with him are severe against disbelievers, and merciful among themselves. You see them bowing falling down prostrate, seeking reward from Allah and acceptance. The mark of them is on their faces from the traces of prostration. This is their description in the Tawrah. But their description in the Injil is like a seed which sends forth its shoot, then makes it strong, and becomes thick and it stands straight on its stem, delighting the sowers, that He may enrage the disbelievers with them. Allah has promised those among them who believe and do righteous good deeds, forgiveness and a mighty reward."
          ],
          "en.pickthall": [
            "Muhammad is the messenger of Allah. And those with him are hard against the disbelievers and merciful among themselves. Thou (O Muhammad) seest them bowing and falling prostrate (in worship), seeking bounty from Allah and (His) acceptance. The mark of them is on their foreheads from the traces of prostration. Such is their likeness in the Torah and their likeness in the Gospel - like as sown corn that sendeth forth its shoot and strengtheneth it and riseth firm upon its stalk, delighting the sowers - that He may enrage the disbelievers with (the sight of) them. Allah hath promised, unto such of them as believe and do good works, forgiveness and immense reward."
          ],
          "en.qarai": [
            "Muhammad, the Apostle of Allah, and those who are with him are hard against the faithless and merciful amongst themselves. You see them bowing and prostrating [in worship], seeking Allah’s grace, and [His] pleasure. Their mark is [visible] on their faces, from the effect of prostration. Such is their description in the Torah and their description in the Evangel. Like a tillage that sends out its shoots and builds them up, and they grow stout and settle on their stalks, impressing the sowers, so that He may enrage the faithless by them. Allah has promised those of them who have faith and do righteous deeds forgiveness and a great reward."
          ],
          "en.qaribullah": [
            "Muhammad is the Messenger of Allah. Those who are with him are harsh against the unbelievers but merciful to one another. You see them bow andprostrate themselves seeking the bounty and pleasure of Allah. Their mark is on their faces from the trace of prostration. That is their likeness in the Torah and their likeness in the Gospel, as the seed which puts forth its shoot and strengthens it, so that it grows stout and rises straight upon its stalk, delighting the sowers, and through them He enrages the unbelievers. Allah has promised those of them who believe and do good deeds, forgiveness and a great wage."
          ],
          "en.sahih": [
            "Muhammad is the Messenger of Allah; and those with him are forceful against the disbelievers, merciful among themselves. You see them bowing and prostrating [in prayer], seeking bounty from Allah and [His] pleasure. Their mark is on their faces from the trace of prostration. That is their description in the Torah. And their description in the Gospel is as a plant which produces its offshoots and strengthens them so they grow firm and stand upon their stalks, delighting the sowers - so that Allah may enrage by them the disbelievers. Allah has promised those who believe and do righteous deeds among them forgiveness and a great reward."
          ],
          "en.sarwar": [
            "Muhammad is the Messenger of God and those with him are stern to the disbelievers yet kind among themselves. You can see them bowing and prostrating before God, seeking His favors and pleasure. Their faces (foreheads) are marked due to the effect of their frequent prostrations. That is their description in the Torah and in the Gospel they are mentioned as the seed which shoots out its stalk then becomes stronger, harder and stands firm on its stumps, attracting the farmers. Thus, God has described the believers to enrage the disbelievers. God has promised forgiveness and a great reward to the righteously striving believers."
          ],
          "en.shakir": [
            "Muhammad is the Apostle of Allah, and those with him are firm of heart against the unbelievers, compassionate among themselves; you will see them bowing down, prostrating themselves, seeking grace from Allah and pleasure; their marks are in their faces because of the effect of prostration; that is their description in the Taurat and their description in the Injeel; like as seed-produce that puts forth its sprout, then strengthens it, so it becomes stout and stands firmly on its stem, delighting the sowers that He may enrage the unbelievers on account of them; Allah has promised those among them who believe and do good, forgiveness and a great reward."
          ],
          "en.transliteration": [
            "Mu<u>h</u>ammadun rasoolu All<u>a</u>hi wa<b>a</b>lla<u>th</u>eena maAAahu ashidd<u>a</u>o AAal<u>a</u> alkuff<u>a</u>ri ru<u>h</u>am<u>a</u>o baynahum tar<u>a</u>hum rukkaAAan sujjadan yabtaghoona fa<u>d</u>lan mina All<u>a</u>hi wari<u>d</u>w<u>a</u>nan seem<u>a</u>hum fee wujoohihim min athari a<b>l</b>ssujoodi <u>tha</u>lika mathaluhum fee a<b>l</b>ttawr<u>a</u>ti wamathaluhum fee alinjeeli kazarAAin akhraja sha<u>t</u>ahu fa<u>a</u>zarahu fa<b>i</b>staghla<i><u>th</u></i>a fa<b>i</b>staw<u>a</u> AAal<u>a</u> sooqihi yuAAjibu a<b>l</b>zzurr<u>a</u>AAa liyaghee<i><u>th</u></i>a bihimu alkuff<u>a</u>ra waAAada All<u>a</u>hu alla<u>th</u>eena <u>a</u>manoo waAAamiloo a<b>l</b><u>ssa</u>li<u>ha</u>ti minhum maghfiratan waajran AAa<i><u>th</u></i>eem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Muhammad is the Messenger of God. Those who are with him are firm and unyielding towards those who deny the truth, but compassionate towards one another. You see them bowing and prostrating themselves, seeking the grace of God and His good will. Their marks are on their faces, the traces of their prostrations; they are described in the Torah and in the Gospel as being like a seed which sends forth its shoot, then makes it strong; it then becomes thick, and it stands firm on its own stem, delighting the sowers. He seeks to enrage the disbelievers through them. God has promised forgiveness and a great reward to those of them who believe and do good works."
          ],
          "en.yusufali": [
            "Muhammad is the messenger of Allah; and those who are with him are strong against Unbelievers, (but) compassionate amongst each other. Thou wilt see them bow and prostrate themselves (in prayer), seeking Grace from Allah and (His) Good Pleasure. On their faces are their marks, (being) the traces of their prostration. This is their similitude in the Taurat; and their similitude in the Gospel is: like a seed which sends forth its blade, then makes it strong; it then becomes thick, and it stands on its own stem, (filling) the sowers with wonder and delight. As a result, it fills the Unbelievers with rage at them. Allah has promised those among them who believe and do righteous deeds forgiveness, and a great Reward."
          ],
          "fa.ansarian": [
            "محمّد، فرستاده خداست و کسانی که با او هستند بر کافران سرسخت و در میان خودشان با یکدیگر مهربانند، همواره آنان را در رکوع و سجود می بینی که پیوسته فضل و خشنودی خدا را می طلبند؛ نشانه آنان در چهره شان از اثر سجود پیداست، این است توصیف آنان در تورات، و اما توصیفشان در انجیل این است که وجودشان چون زراعتی است که جوانه های خود را رویانده پس تقویتش کرده تا ستبر و ضخیم شده، و در نتیجه بر ساقه هایش [محکم و استوار] ایستاده است، به طوری که دهقانان را [از رشد و انبوهی خود] به تعجب می آورد تا خدا به وسیله [انبوهی و نیرومندی] مؤمنان، کافران را به خشم آورد. [و] خدا به کسانی از آنان که ایمان آورده و کارهای شایسته انجام داده اند، آمرزش و پاداشی بزرگ وعده داده است."
          ],
          "fa.ayati": [
            "محمد پيامبر خدا، و كسانى كه با او هستند بر كافران سختگيرند و با يكديگر مهربان. آنان را بينى كه ركوع مى‌كنند، به سجده مى‌آيند و جوياى فضل و خشنودى خدا هستند. نشانشان اثر سجده‌اى است كه بر چهره آنهاست. اين است وصفشان در تورات و در انجيل، كه چون كشته‌اى هستند كه جوانه بزند و آن جوانه محكم شود و بر پاهاى خود بايستد و كشاورزان را به شگفتى وادارد، تا آنجا كه كافران را به خشم آورد. خدا از ميان آنها كسانى را كه ايمان آورده‌اند و كارهاى شايسته كرده‌اند به آمرزش و پاداشى بزرگ وعده داده است."
          ],
          "fa.bahrampour": [
            "محمد صلّى الله عليه وآله وسلّم فرستاده‌ى خداست و كسانى كه با او هستند، بر كافران سختگير [و] با همديگر مهربانند. [همواره‌] آنها را در ركوع و سجود مى‌بينى كه فضل و خشنودى خدا را مى‌جويند. نشانه آنها اثر سجده‌اى است كه در چهره‌هايشان است. اين وصف ايشان"
          ],
          "fa.fooladvand": [
            "محمد [ص‌] پيامبر خداست؛ و كسانى كه با اويند، بر كافران، سختگير [و] با همديگر مهربانند. آنان را در ركوع و سجود مى‌بينى. فضل و خشنودى خدا را خواستارند. علامت [مشخصّه‌] آنان بر اثر سجود در چهره‌هايشان است. اين صفت ايشان است در تورات، و مثَل آنها در انجيل چون كشته‌اى است كه جوانه خود برآورد و آن را مايه دهد تا ستبر شود و بر ساقه‌هاى خود بايستد و دهقانان را به شگفت آورد، تا از [انبوهى‌] آنان [خدا] كافران را به خشم دراندازد. خدا به كسانى از آنان كه ايمان آورده و كارهاى شايسته كرده‌اند، آمرزش و پاداش بزرگى وعده داده‌است."
          ],
          "fa.ghomshei": [
            "محمد (صلی اللّه علیه و آله و سلم) فرستاده خداست و یاران و همراهانش بر کافران بسیار قویدل و سخت و با یکدیگر بسیار مشفق و مهربانند، آنان را در حال رکوع و سجود نماز بسیار بنگری که فضل و رحمت خدا و خشنودی او را می‌طلبند، بر رخسارشان از اثر سجده نشانه‌های نورانیّت پدیدار است. این وصف حال آنها در کتاب تورات و انجیل مکتوب است که (مثل حال آن رسول) به دانه‌ای ماند که چون نخست سر از خاک برآورد جوانه و شاخه‌ای نازک و ضعیف باشد بعد از آن قوّت یابد تا آنکه ستبر و قوی گردد و بر ساق خود راست و محکم بایستد که دهقانان را (در تماشای خود) حیران کند (همچنین محمد صلی اللّه علیه و آله و سلم و اصحابش از ضعف به قوّت رسند) تا کافران عالم را (از قدرت و قوّت خود) به خشم آرند. خدا وعده فرموده که هر کس از آنها ثابت ایمان و نیکوکار شود گناهانش ببخشد و اجر عظیم عطا کند."
          ],
          "fa.khorramdel": [
            "محمّد فرستاده‌ی خدا است، و کسانی که با او هستند در برابر کافران تند و سرسخت، و نسبت به یکدیگر مهربان و دلسوزند. ایشان را در حال رکوع و سجود می‌بینی. آنان همواره فضل خدای را می‌جویند و رضای او را می‌طلبند. نشانه‌ی ایشان بر اثر سجده در پیشانیهایشان نمایان است. این، توصیف آنان در تورات است، و امّا توصیف ایشان در انجیل چنین است که همانند کشتزاری هستند که جوانه‌های (خوشه‌های) خود را بیرون زده، و آنها را نیرو داده و سخت نموده و بر ساقه‌های خویش راست ایستاده باشد، بگونه‌ای که برزگران را به شگفت می‌آورد. (مؤمنان نیز همین گونه‌اند. آنی از حرکت بازنمی‌ایستند، و همواره جوانه می‌زنند، و جوانه‌ها پرورش می‌یابند و بارور می‌شوند، و باغبانانِ بشریّت را بشگفت می‌آورند. این پیشرفت و قوّت و قدرت را خدا نصیب مؤمنان می‌کند) تا کافران را به سبب آنان خشمگین کند. خداوند به کسانی از ایشان که ایمان بیاورند و کارهای شایسته بکنند آمرزش و پاداش بزرگی را وعده می‌دهد. [[«أَشِدَّآءُ»: جمع شَدید، تند و سرسخت. قوی و نیرومند. «رُحَمَآءُ»: جمع رَحیم، مهربان و دلسوز. «سِیمَا»: نشانه. علامت. «شَطْأَ»: جوانه. مراد سنبل و خوشه است. «إِسْتَوی»: راست ایستاد و پابرجا گردید. «سُوقِ»: جمع ساق، تنه. «آزَرَ»: یاری داد. نیرو داد. «إسْتَغْلَظَ»: سخت و سفت گردید. یعنی خوشه‌های نازک و ضعیف سخت و سفت شد. «الزُّرَّاعَ»: جمع زارِع، برزگران.]]"
          ],
          "fa.khorramshahi": [
            "محمد پیامبر الهی است و کسانی که با او هستند بر کافران سختگیر و با خودشان مهربانند، آنان را راکع و ساجد بینی که در طلب بخشش و خشنودی خداوند، نشانه آنان در چهره‌هایشان از اثر سجود [آشکار] است، و این است توصیف آنان در تورات، و توصیف آنان در انجیل هست، همانند نهالی که جوانه‌اش را برآورد، و آن را نیرومند سازد و ستبر گردد و بر ساقه‌هایش بایستد، و کشاورزان را شاد و شگفت‌زده سازد، تا از [دیدن‌] ایشان کافران را به خشم آورد، خداوند به کسانی از ایشان که ایمان آورده‌اند و کارهای شایسته کرده‌اند، آمرزش و پاداشی بزرگ وعده داده است‌"
          ],
          "fa.makarem": [
            "محمّد (ص) فرستاده خداست؛ و کسانی که با او هستند در برابر کفّار سرسخت و شدید، و در میان خود مهربانند؛ پیوسته آنها را در حال رکوع و سجود می‌بینی در حالی که همواره فضل خدا و رضای او را می‌طلبند؛ نشانه آنها در صورتشان از اثر سجده نمایان است؛ این توصیف آنان در تورات و توصیف آنان در انجیل است، همانند زراعتی که جوانه‌های خود را خارج ساخته، سپس به تقویت آن پرداخته تا محکم شده و بر پای خود ایستاده است و بقدری نموّ و رشد کرده که زارعان را به شگفتی وامی‌دارد؛ این برای آن است که کافران را به خشم آورد (ولی) کسانی از آنها را که ایمان آورده و کارهای شایسته انجام داده‌اند، خداوند وعده آمرزش و اجر عظیمی داده است."
          ],
          "fa.moezzi": [
            "محمد (صلی اللّه علیه و آله) فرستاده خدا است و آنان که با اویند سخت‌گیرانند بر کفار مهربانند به خویشتن ببینیشان رکوع‌گزاران و سجده‌کنان جویند فضلی از خدا و خوشنودی را نشانی (سیمای) ایشان در چهره‌های ایشان است از جای سجده این است مثَل آنان در تورات و مثَل آنان در انجیل چون کشتی است که برون دهد بوته‌های خود را پس استوارش کند تا سطبر گردد و بر پایه‌های خویش ایستد شگفت آرد برزگران را تا به خشم آرد بدیشان کافران را نوید داد خدا آنان را که ایمان آوردند و کردار شایسته کردند از ایشان آمرزشی و پاداشی بزرگ را"
          ],
          "fa.mojtabavi": [
            "محمد"
          ],
          "fa.sadeqi": [
            "محمّد پیامبر خداست‌؛ و کسانی که با اویند، بر کافران سختگیران و با خودهاشان مهربانانند. آنان را در رکوع و سجود می‌بینی (که) فضل و خشنودی خدا را همی جویند. علامت (مشخصه‌ی) آنان بر اثر و نمود سجود در چهره‌هایشان پیداست. این نماد ایشان است در تورات و نمادشان در انجیل. چون کِشته‌ای است که جوانه‌ی خود را بر آورده و آن را مایه دهد تا ستبر شود و بر ساقه‌های خود بایستد و زارعان را به شگفت آورد، تا از (انبوهی) آنها (خدا) کافران را به خشم در اندازد. خدا به کسانی از آنان که ایمان آورده و کارهای شایسته(ی ایمان) کرده‌اند، پوشش و پاداشی بزرگ وعده داده است."
          ]
        }
      }
    ]
  },
  "index": "quran:48",
  "kind": "verse_list"
}