{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 49"
        },
        "path": "/books/quran:49",
        "titles": {
          "ar": "الحجرات",
          "en": "The Inner Apartments",
          "ent": "Al-Hujuraat"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 49,
    "local_index": 49,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 50"
        },
        "path": "/books/quran:50",
        "titles": {
          "ar": "ق",
          "en": "The letter Qaaf",
          "ent": "Qaaf"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 48"
        },
        "path": "/books/quran:48",
        "titles": {
          "ar": "الفتح",
          "en": "The Victory",
          "ent": "Al-Fath"
        }
      },
      "up": {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      }
    },
    "order": 106,
    "part_type": "Chapter",
    "path": "/books/quran:49",
    "reveal_type": "Medinan",
    "rukus": 2,
    "titles": {
      "ar": "الحجرات",
      "en": "The Inner Apartments",
      "ent": "Al-Hujuraat"
    },
    "verse_count": 18,
    "verse_start_index": 4612,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 4613,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:49:1",
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا لاَ تُقَدِّمُوا بَيْنَ‌ يَدَيِ‌ اللَّهِ‌ وَ رَسُولِهِ‌ وَ اتَّقُوا اللَّهَ‌ إِنَ‌ اللَّهَ‌ سَمِيعٌ‌ عَلِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O YOU WHO believe, do not forestall the judgements of God and His Apostle, and have fear of God. Verily God hears all and knows everything."
          ],
          "en.ahmedraza": [
            "O People who Believe! Do not advance ahead of Allah and His Noble Messenger, and fear Allah; indeed Allah is All Hearing, All Knowing."
          ],
          "en.arberry": [
            "O believers, advance not before God and His Messenger; and fear God. God is All-hearing, All-knowing."
          ],
          "en.daryabadi": [
            "O ye who believe! be not forward in the presence of Allah and His apostle, and fear Allah; verily Allah is Hearing, Knowing."
          ],
          "en.hilali": [
            "O you who believe! Do not put (yourselves) forward before Allah and His Messenger (SAW), and fear Allah. Verily! Allah is All-Hearing, All-Knowing."
          ],
          "en.itani": [
            "O you who believe! Do not place your opinions above that of God and His Messenger, and fear God. God is Hearing and Knowing."
          ],
          "en.maududi": [
            "Believers, do not advance before Allah and His Messenger, and fear Allah. Verily Allah is All-Hearing, All-Knowing."
          ],
          "en.mubarakpuri": [
            "O you who believe! Make not (a decision) in advance before Allah and His Messenger, and have Taqwa of Allah. Verily, Allah is Hearing, Knowing."
          ],
          "en.pickthall": [
            "O ye who believe! Be not forward in the presence of Allah and His messenger, and keep your duty to Allah. Lo! Allah is Hearer, Knower."
          ],
          "en.qarai": [
            "O you who have faith! Do not venture ahead of Allah and His Apostle, and be wary of Allah. Indeed Allah is all-hearing, all-knowing."
          ],
          "en.qaribullah": [
            "Believers do not advance before Allah and His Messenger. Fear Allah. Allah is the Hearer, the Knower."
          ],
          "en.sahih": [
            "O you who have believed, do not put [yourselves] before Allah and His Messenger but fear Allah. Indeed, Allah is Hearing and Knowing."
          ],
          "en.sarwar": [
            "Believers, do not be presumptuous with the Messenger of God (in your deeds and in your words). Have fear of God; He is All-hearing and All-knowing."
          ],
          "en.shakir": [
            "O you who believe! be not forward in the presence of Allah and His Apostle, and be careful of (your duty to) Allah; surely Allah is Hearing, Knowing."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo l<u>a</u> tuqaddimoo bayna yadayi All<u>a</u>hi warasoolihi wa<b>i</b>ttaqoo All<u>a</u>ha inna All<u>a</u>ha sameeAAun AAaleem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Believers, do not push yourselves forward in the presence of God and His Messenger. Fear God -- God hears all and knows all."
          ],
          "en.yusufali": [
            "O Ye who believe! Put not yourselves forward before Allah and His Messenger; but fear Allah: for Allah is He Who hears and knows all things."
          ],
          "fa.ansarian": [
            "ای اهل ایمان! بر خدا و پیامبرش [در هیچ امری از امور دین و دنیا و آخرت] پیشی مگیرید و از خدا پروا کنید که خدا شنوا و داناست."
          ],
          "fa.ayati": [
            "اى كسانى كه ايمان آورده‌ايد، بر خدا و پيامبر او پيشى مگيريد و از خدا بترسيد، زيرا خدا شنوا و داناست."
          ],
          "fa.bahrampour": [
            "اى كسانى كه ايمان آورده‌ايد! در برابر خدا و رسولش [در هيچ كارى‌] جلو نيفتيد، و از خدا بترسيد. بى‌گمان خدا شنواى داناست"
          ],
          "fa.fooladvand": [
            "اى كسانى كه ايمان آورده‌ايد، در برابر خدا و پيامبرش [در هيچ كارى‌] پيشى مجوييد و از خدا پروا بداريد كه خدا شنواى داناست."
          ],
          "fa.ghomshei": [
            "ای کسانی که ایمان آورده‌اید (در هیچ کار) بر خدا و رسول تقدّم مجویید و از خدا پروا کنید، که خدا شنوا و داناست."
          ],
          "fa.khorramdel": [
            "ای کسانی که ایمان آورده‌اید! بر خدا و پیغمبرش پیشی مگیرید و پیشدستی مکنید، و از خدا بترسید و پروا داشته باشید، چرا که خدا شنوای (گفتارتان، و) آگاه (از کردارتان) می‌باشد. [[«لا تُقَدِّمُوا»: پیشی مگیرید. پیشدستی مکنید. بعضی این فعل را لازم و برخی آن را متعدی و مفعولش را محذوف دانسته‌اند، و مراد این است که هیچ حکمی را بر حکم خدا و پیغمبرش مقدم ندارید. پیش از فهم و دریافت سخن و دستور خدا و رسول درباره حکم چیزی، سخنی نگوئید. پیش از اخذ فرمان از خدا و پیغمبرش، عملی را انجام ندهید. در جائی که خدا و پیغمبرش حکمی‌دارند، شما حکم نکنید، یعنی حکمی نکنید مگر به حکم خدا و رسول او، و باید که همواره این ویژگی در شما باشد که پیرو و گوش بفرمان خدا و رسول باشید. «بَیْنَ یَدَیْ»: جلو. حضور. منظور مقام حکمرانی است که مختص به خدا و به رسول خدا - برابر رهنمود و با اجازه خدا - دارد (نگا: نساء / 64).]]"
          ],
          "fa.khorramshahi": [
            "ای مؤمنان بر حکم خداوند و پیامبر او پیشدستی نکنید، و از خداوند پروا داشته باشید، بی‌گمان خداوند شنوای داناست‌"
          ],
          "fa.makarem": [
            "ای کسانی که ایمان آورده‌اید! چیزی را بر خدا و رسولش مقدّم نشمرید (و پیشی مگیرید)، و تقوای الهی پیشه کنید که خداوند شنوا و داناست!"
          ],
          "fa.moezzi": [
            "ای آنان که ایمان آوردید پیش نیفتید پیش روی خدا و پیمبرش و بترسید خدا را که خدا است شنونده دانا"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه ايمان آورده‌ايد، [در هيچ كارى‌] فراپيش خدا و پيامبرش نرويد، و از خداى پروا كنيد، كه خدا شنوا و داناست."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که ایمان آوردید! در برابر خدا و پیامبر، (خود یا دیگران را) پیش نیندازید و خدا را پروا بدارید. همانا خدا بسی شنوای بسیار داناست."
          ]
        }
      },
      {
        "index": 4614,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:49:2",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:67:3"
          ]
        },
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا لاَ تَرْفَعُوا أَصْوَاتَکُمْ‌ فَوْقَ‌ صَوْتِ‌ النَّبِيِ‌ وَ لاَ تَجْهَرُوا لَهُ‌ بِالْقَوْلِ‌ کَجَهْرِ بَعْضِکُمْ‌ لِبَعْضٍ‌ أَنْ‌ تَحْبَطَ أَعْمَالُکُمْ‌ وَ أَنْتُمْ‌ لاَ تَشْعُرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O you who believe, do not raise your voices above the voice of the Prophet, and do not speak loudly to him as you do with one another lest your deeds are nullified unconsciously."
          ],
          "en.ahmedraza": [
            "O People who Believe! Do not raise your voices higher than the voice of the Prophet, nor speak to him loudly the way you shout to one another, lest your deeds go to waste whilst you are unaware. (Faith will go waste due to the slightest disrespect towards the Holy Prophet – peace and blessings be upon him. To honour him is part of faith. To disrespect him is blasphemy.)"
          ],
          "en.arberry": [
            "O believers, raise not your voices above the Prophet's voice, and be not loud in your speech to him, as you are loud one to another, lest your works fail while you are not aware."
          ],
          "en.daryabadi": [
            "Ye who believe raise not your voices above the voice of the prophet, nor shout loud Unto him in discourse as ye shout loud Unto one another, lest your works may be rendered of non-effect, while ye perceive not."
          ],
          "en.hilali": [
            "O you who believe! Raise not your voices above the voice of the Prophet (SAW), nor speak aloud to him in talk as you speak aloud to one another, lest your deeds may be rendered fruitless while you perceive not."
          ],
          "en.itani": [
            "O you who believe! Do not raise your voices above the voice of the Prophet, and do not speak loudly to him, as you speak loudly to one another, lest your works be in vain without you realizing."
          ],
          "en.maududi": [
            "Believers, do not raise your voices above the voice of the Prophet and when speaking to him do not speak aloud as you speak aloud to one another, lest all your deeds are reduced to nothing without your even realising it."
          ],
          "en.mubarakpuri": [
            "O you who believe! Raise not your voices above the voice of the Prophet, nor speak aloud to him in talk as you speak aloud to one another, lest your deeds should be thwarted while you perceive not."
          ],
          "en.pickthall": [
            "O ye who believe! Lift not up your voices above the voice of the Prophet, nor shout when speaking to him as ye shout one to another, lest your works be rendered vain while ye perceive not."
          ],
          "en.qarai": [
            "O you who have faith! Do not raise your voices above the voice of the Prophet, and do not speak aloud to him like you shout to one another, lest your works should fail without your being aware."
          ],
          "en.qaribullah": [
            "Believers, do not raise your voices above the voice of the Prophet, nor speak loudly to him as you do to one another lest your works should be annulledwithout your knowledge."
          ],
          "en.sahih": [
            "O you who have believed, do not raise your voices above the voice of the Prophet or be loud to him in speech like the loudness of some of you to others, lest your deeds become worthless while you perceive not."
          ],
          "en.sarwar": [
            "Believers, do not raise your voices above the voice of the Prophet, do not be too loud in speaking to him [as you may have been to one another], lest your deeds will be made devoid of all virtue without your realizing it."
          ],
          "en.shakir": [
            "O you who believe! do not raise your voices above the voice of the Prophet, and do not speak loud to him as you speak loud to one another, lest your deeds became null while you do not perceive."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo l<u>a</u> tarfaAAoo a<u>s</u>w<u>a</u>takum fawqa <u>s</u>awti a<b>l</b>nnabiyyi wal<u>a</u> tajharoo lahu bi<b>a</b>lqawli kajahri baAA<u>d</u>ikum libaAA<u>d</u>in an ta<u>h</u>ba<u>t</u>a aAAm<u>a</u>lukum waantum l<u>a</u> tashAAuroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Believers, do not raise your voices above the voice of the Prophet, and do not speak as loudly when speaking to him as you do when speaking to one another, lest your actions come to nothing without your realizing it."
          ],
          "en.yusufali": [
            "O ye who believe! Raise not your voices above the voice of the Prophet, nor speak aloud to him in talk, as ye may speak aloud to one another, lest your deeds become vain and ye perceive not."
          ],
          "fa.ansarian": [
            "ای مؤمنان! صدایتان را بلندتر از صدای پیامبر نکنید، و آن گونه که با یکدیگر بلند سخن می گویید با او بلند سخن نگویید، مبادا آنکه اعمالتان تباه و بی اثر شود و شما تباهی آن را درک نکنید."
          ],
          "fa.ayati": [
            "اى كسانى كه ايمان آورده‌ايد، صداى خود را از صداى پيامبر بلندتر مكنيد و همچنان كه با يكديگر بلند سخن مى‌گوييد با او به آواز بلند سخن مگوييد، كه اعمالتان ناچيز شود و آگاه نشويد."
          ],
          "fa.bahrampour": [
            "اى كسانى كه ايمان آورده‌ايد! صدايتان را بلندتر از صداى پيامبر نكنيد و با او بلند سخن نگوييد آن‌گونه كه با يكديگر بلند سخن مى‌گوييد، مبادا بى‌آن كه خود بفهميد اعمالتان تباه شود"
          ],
          "fa.fooladvand": [
            "اى كسانى كه ايمان آورده‌ايد، صدايتان را بلندتر از صداى پيامبر مكنيد، و همچنانكه بعضى از شما با بعضى ديگر بلند سخن مى‌گوييد با او به صداى بلند سخن مگوييد، مبادا بى‌آنكه بدانيد كرده‌هايتان تباه شود."
          ],
          "fa.ghomshei": [
            "ای اهل ایمان، فوق صوت پیغمبر صدا بلند مکنید و بر او فریاد بر مکشید چنانکه با یکدیگر بلند سخن می‌گویید، که اعمال نیکتان (در اثر بی ادبی) محو و باطل شود و شما فهم نکنید."
          ],
          "fa.khorramdel": [
            "ای کسانی که ایمان آورده‌اید! صدای خود را از صدای پیغمبر بلندتر مکنید، و همچنان که با یکدیگر سخن می‌گوئید، با او به آواز بلند سخن مگوئید، تا نادانسته اعمالتان بی‌اجر و ضایع نشود. [[«لا تَرْفَعُوا أَصْوَاتَکُمْ فَوْقَ صَوْتِ النَّبِیِّ»: صدای خود را فراتر از صدای پیغمبر نبرید. صدای خویش را بلندتر از صدای پیغمبر نکنید. مراد بلند سخن گفتن در محضر پیغمبر در حال حیات، و بعد از وفات آن حضرت، در کنار مرقد مبارک او، و بویژه بهنگام خواندن احادیث نبوی است (نگا: روح‌المعانی). «لا تَجْهَرُوا لَهُ بِالْقَوْلِ ...»: این بخش ناظر بدین امر است که طبق معمول با داد و فریاد با آن جناب صحبت نشود، بلکه متین و آرام و محترمانه او را مخاطب قرار دهند.]]"
          ],
          "fa.khorramshahi": [
            "ای کسانی که ایمان آورده‌اید صداهایتان را از صدای پیامبر بلندتر مسازید، و در سخن با او، مانند بلند حرف زدنتان با همدیگر، بلند حرف مزنید مبادا که اعمالتان تباه شود و آگاه نباشید"
          ],
          "fa.makarem": [
            "ای کسانی که ایمان آورده‌اید! صدای خود را فراتر از صدای پیامبر نکنید، و در برابر او بلند سخن مگویید (و داد و فریاد نزنید) آن گونه که بعضی از شما در برابر بعضی بلند صدا می‌کنند، مبادا اعمال شما نابود گردد در حالی که نمی‌دانید!"
          ],
          "fa.moezzi": [
            "ای آنان که ایمان آوردید بلند نکنید آواز خویش را بالای آواز پیمبر و بلند با وی سخن نگوئید مانند بلند سخن‌گفتن برخی از شما با برخی نبادا تباه شود کارهای شما و شما درنیابید"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه ايمان آورده‌ايد، آوازهاى خود را از آواز پيامبر بلندتر مكنيد، و با او بلند سخن مگوييد مانند بلند سخن‌گفتن برخى از شما با برخ ديگر، كه كردارهاى شما تباه و بيهوده مى‌شود و خود آگاه نيستيد."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که ایمان آوردید! صداهایتان را از صدای پیامبر بلندتر مکنید، و همچنان که بعضی از شما با بعضی دیگر بلند سخن می‌گویید با او به صدای بلند سخن مگویید، که کرده‌هایتان تباه شود، حال آنکه باریک‌بینی نمی‌کنید."
          ]
        }
      },
      {
        "index": 4615,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:49:3",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:67:3"
          ]
        },
        "text": [
          "إِنَ‌ الَّذِينَ‌ يَغُضُّونَ‌ أَصْوَاتَهُمْ‌ عِنْدَ رَسُولِ‌ اللَّهِ‌ أُولٰئِکَ‌ الَّذِينَ‌ امْتَحَنَ‌ اللَّهُ‌ قُلُوبَهُمْ‌ لِلتَّقْوَى‌ لَهُمْ‌ مَغْفِرَةٌ وَ أَجْرٌ عَظِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They who speak in a low voice in the presence of God's Apostle, have had their hearts tried by God for reverence. There is forgiveness for them and a great reward."
          ],
          "en.ahmedraza": [
            "Indeed those who suppress their voices in the presence of Allah’s Noble Messenger, are the ones whose hearts Allah has tested for piety; for them is forgiveness, and a great reward."
          ],
          "en.arberry": [
            "Surely those who lower their voices in the presence of God's Messenger, those are they whose hearts God has tested for godfearing; they shall have forgiveness and a mighty wage."
          ],
          "en.daryabadi": [
            "Verily those who lower their voices in the presence of the apostle of Allah -those are they whose hearts Allah hath disposed Unto piety: theirs will be forgiveness and a mighty hire."
          ],
          "en.hilali": [
            "Verily! Those who lower their voices in the presence of Allah's Messenger (SAW), they are the ones whose hearts Allah has tested for piety. For them is forgiveness and a great reward."
          ],
          "en.itani": [
            "Those who lower their voices before God’s Messenger—those are they whose hearts God has tested for piety. They will have forgiveness and a great reward."
          ],
          "en.maududi": [
            "The ones who lower their voices in the presence of the Messenger of Allah are those whose hearts Allah has tested for God-fearing. Theirs shall be forgiveness and a great reward."
          ],
          "en.mubarakpuri": [
            "Verily, those who lower their voices in the presence of Allah's Messenger, they are the ones whose hearts Allah has tested for Taqwa. For them is forgiveness and a great reward."
          ],
          "en.pickthall": [
            "Lo! they who subdue their voices in the presence of the messenger of Allah, those are they whose hearts Allah hath proven unto righteousness. Theirs will be forgiveness and immense reward."
          ],
          "en.qarai": [
            "Indeed those who lower their voices in the presence of the Apostle of Allah—they are the ones whose hearts Allah has tested for Godwariness. For them will be forgiveness and a great reward."
          ],
          "en.qaribullah": [
            "Those who lower their voice in the presence of the Messenger of Allah are those whose hearts Allah has tested for warding off (evil). They shall receiveforgiveness and a great wage."
          ],
          "en.sahih": [
            "Indeed, those who lower their voices before the Messenger of Allah - they are the ones whose hearts Allah has tested for righteousness. For them is forgiveness and great reward."
          ],
          "en.sarwar": [
            "The hearts of those who lower their voices in the presence of the Messenger of God are tested by God through piety. They will have forgiveness and a great reward."
          ],
          "en.shakir": [
            "Surely those who lower their voices before Allah's Apostle are they whose hearts Allah has proved for guarding (against evil); they shall have forgiveness and a great reward."
          ],
          "en.transliteration": [
            "Inna alla<u>th</u>eena yaghu<u>dd</u>oona a<u>s</u>w<u>a</u>tahum AAinda rasooli All<u>a</u>hi ol<u>a</u>ika alla<u>th</u>eena imta<u>h</u>ana All<u>a</u>hu quloobahum li<b>l</b>ttaqw<u>a</u> lahum maghfiratun waajrun AAa<i><u>th</u></i>eem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Those who lower their voices in the presence of God's Messenger are men whose hearts God has tested for piety, they shall have forgiveness and a great reward,"
          ],
          "en.yusufali": [
            "Those that lower their voices in the presence of Allah's Messenger,- their hearts has Allah tested for piety: for them is Forgiveness and a great Reward."
          ],
          "fa.ansarian": [
            "بی تردید کسانی که صدایشان را نزد رسول خدا پایین می آورند، همانان هستند که خدا دل هایشان را برای پرهیزکاری امتحان کرده، آنان را آمرزش و پاداشی بزرگ است."
          ],
          "fa.ayati": [
            "كسانى كه در نزد پيامبر خدا صدايشان را پايين مى‌آورند همانهايند كه خدا دلهايشان را به تقوى آزموده است. آنها راست آمرزش و مزد بسيار."
          ],
          "fa.bahrampour": [
            "مسلما كسانى كه نزد پيامبر خدا صدايشان را فرو مى‌كشند همان‌ها هستند كه خدا دل‌هايشان را براى پرهيزگارى خالص كرده است. آنان را آمرزش و پاداشى بزرگ است"
          ],
          "fa.fooladvand": [
            "كسانى كه پيش پيامبر خدا صدايشان را فرو مى‌كشند همان كسانند كه خدا دلهايشان را براى پرهيزگارى امتحان كرده است؛ آنان را آمرزش و پاداشى بزرگ است."
          ],
          "fa.ghomshei": [
            "آنان که نزد رسول خدا به صدای آرام و آهسته سخن گویند آنها هستند که در حقیقت خدا دلهایشان را برای تقوا آزموده. آنهایند که آمرزش و اجر عظیم دارند."
          ],
          "fa.khorramdel": [
            "آنان که صدای خود را نزد پیغمبر خدا پائین نموده و آهسته برمی‌آورند، کسانیند که خداوند دلهایشان را برای پرهیزگاری پاکیزه و ناب داشته است. ایشان آمرزش سترگ و پاداش بزرگی دارند. [[«یَغُضُّونَ»: پائین می‌آورند. آهسته برمی‌آورند. «إِمْتَحَنَ»: در بوته آزمایش آزموده است و پیراسته و پاکیزه کرده است. امتحان خدا نسبت به دل بنده، آن است که دلش را نشانه انواع محنتها و تکلیفها گردانیده تا صدق ایمانش به واسطه فرمانبرداری و صبر معلوم شود، و تقوای آن ظاهر گردد، و از کوره آزمایش، پاک و بیغش بیرون آید.]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان کسانی که صداهایشان را نزد پیامبر خدا [آهسته و] پوشیده می‌دارند، اینانند که خداوند دلهایشان را برای تقوا پالوده است، ایشان را آمرزش و پاداشی بزرگ است‌"
          ],
          "fa.makarem": [
            "آنها که صدای خود را نزد رسول خدا کوتاه می‌کنند همان کسانی هستند که خداوند دلهایشان را برای تقوا خالص نموده، و برای آنان آمرزش و پاداش عظیمی است!"
          ],
          "fa.moezzi": [
            "همانا آنان که فروکشند آوازهای خویش را نزد پیمبر خدا آنانند که بیازموده است خدا دلهای ایشان را برای پرهیزکاری ایشان را است آمرزشی و پاداشی بزرگ‌"
          ],
          "fa.mojtabavi": [
            "كسانى كه در نزد پيامبر خدا آوازهاى خود را فرومى‌دارند آنانند كه خداوند دلهاشان را براى پرهيزگارى بيازموده است- تا پاك و صافى شوند- ايشان را آمرزش و مزدى بزرگ است."
          ],
          "fa.sadeqi": [
            "بی‌گمان کسانی که نزد پیامبر خدا صدایشان را فرو می‌شکنند همان کسانند که خدا دل‌هایشان را برای پرهیزگاری آزموده (و) برایشان پوششی و پاداشی بزرگ است."
          ]
        }
      },
      {
        "index": 4616,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:49:4",
        "text": [
          "إِنَ‌ الَّذِينَ‌ يُنَادُونَکَ‌ مِنْ‌ وَرَاءِ الْحُجُرَاتِ‌ أَکْثَرُهُمْ‌ لاَ يَعْقِلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Many of those who call you from outside the apartments are not considerate."
          ],
          "en.ahmedraza": [
            "Indeed most of those who call you from outside the chambers do not have sense."
          ],
          "en.arberry": [
            "Surely those who call unto thee from behind the apartments, the most of them do not understand."
          ],
          "en.daryabadi": [
            "Verily those who call aloud Unto thee from without the inner apartments, most of them reflect not.\""
          ],
          "en.hilali": [
            "Verily! Those who call you from behind the dwellings, most of them have no sense."
          ],
          "en.itani": [
            "Those who call you from behind the chambers—most of them do not understand."
          ],
          "en.maududi": [
            "Surely most of those who call out to you, (O Prophet), from behind the apartments, are devoid of understanding."
          ],
          "en.mubarakpuri": [
            "Verily, those who call you from behind the dwellings, most of them have no sense."
          ],
          "en.pickthall": [
            "Lo! those who call thee from behind the private apartments, most of them have no sense."
          ],
          "en.qarai": [
            "Indeed those who call you from behind the apartments, most of them do not use their reason."
          ],
          "en.qaribullah": [
            "Whereas those who call out to you from behind the apartments, most of them lack understanding."
          ],
          "en.sahih": [
            "Indeed, those who call you, [O Muhammad], from behind the chambers - most of them do not use reason."
          ],
          "en.sarwar": [
            "Most of those who call you from behind the private chambers do not have any understanding."
          ],
          "en.shakir": [
            "(As for) those who call out to you from behind the private chambers, surely most of them do not understand."
          ],
          "en.transliteration": [
            "Inna alla<u>th</u>eena yun<u>a</u>doonaka min war<u>a</u>i al<u>h</u>ujur<u>a</u>ti aktharuhum l<u>a</u> yaAAqiloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "those who call out to you from outside your apartments are lacking in understanding."
          ],
          "en.yusufali": [
            "Those who shout out to thee from without the inner apartments - most of them lack understanding."
          ],
          "fa.ansarian": [
            "یقیناً کسانی که تو را از پشت اطاق ها صدا می کنند، بیشترشان معرفت و آگاهی [به حرمت و عظمت تو] ندارند."
          ],
          "fa.ayati": [
            "آنهايى كه از آن سوى حجره‌ها ندايت مى‌دهند بيشتر بى‌خردانند."
          ],
          "fa.bahrampour": [
            "بى‌ترديد كسانى كه تو را از پشت اتاق‌ها صدا مى‌زنند، بيشترشان نمى‌انديشند"
          ],
          "fa.fooladvand": [
            "كسانى كه تو را از پشت اتاقها[ى مسكونى تو] به فرياد مى‌خوانند، بيشترشان نمى‌فهمند."
          ],
          "fa.ghomshei": [
            "به حقیقت مردمی که تو را از پشت حجره‌هایت به صدای بلند می‌خوانند اکثر مردم بی عقل و شعوری هستند."
          ],
          "fa.khorramdel": [
            "بی‌گمان کسانی که تو را از بیرون اطاقها فریاد می‌زنند، اغلب ایشان نمی‌فهمند (که تو چه مقام والائی در پیش خدا داری و باید با تو محترمانه رفتار کنند). [[«الْحُجُرَاتِ»: جمع حُجْرَة، اطاقها. مراد اطاقهای همسران پاک پیغمبر است که در کنار مسجد پیغمبر تهیه دیده شده بود. افرادی از بیرون پیغمبر را صدا می‌زدند که بیرون بیا.]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان کسانی که تو را از پشت در حجره‌ها صدا می‌زنند، بیشترشان نابخردانند"
          ],
          "fa.makarem": [
            "(ولی) کسانی که تو را از پشت حجره‌ها بلند صدا می‌زنند، بیشترشان نمی‌فهمند!"
          ],
          "fa.moezzi": [
            "همانا آنان که خوانندت از پس غرفه‌ها بیشترشان خردمند نباشند"
          ],
          "fa.mojtabavi": [
            "كسانى كه از فراسوى حجره‌ها- اطاقها يا خانه‌هاى خرد- تو را آواز مى‌دهند، بيشترشان نابخردند- زيرا انسانيت و ادب نگاه نمى‌دارند-."
          ],
          "fa.sadeqi": [
            "بی‌گمان کسانی که از پشت اطاق‌ها(یت) تو را صدا می‌زنند بیشترشان خردورزی نمی‌کنند."
          ]
        }
      },
      {
        "index": 4617,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:49:5",
        "text": [
          "وَ لَوْ أَنَّهُمْ‌ صَبَرُوا حَتَّى‌ تَخْرُجَ‌ إِلَيْهِمْ‌ لَکَانَ‌ خَيْراً لَهُمْ‌ وَ اللَّهُ‌ غَفُورٌ رَحِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "If they had waited for you to come out it would have been better for them. But God is forgiving and kind."
          ],
          "en.ahmedraza": [
            "And had they been patient until you yourself came out to them, it would be better for them; and Allah is Oft Forgiving, Most Merciful."
          ],
          "en.arberry": [
            "And if they had patience, until thou comest out to them, that would be better for them; and God is All-forgiving, All-compassionate."
          ],
          "en.daryabadi": [
            "And had they had patience till thou camest forth Unto them, it had surely been best for them; and Allah is Forgiving, Merciful."
          ],
          "en.hilali": [
            "And if they had patience till you could come out to them, it would have been better for them. And Allah is Oft-Forgiving, Most Merciful."
          ],
          "en.itani": [
            "Had they remained patient until you came out to them, it would have been better for them. But God is Forgiving and Merciful."
          ],
          "en.maududi": [
            "If they were patient until you went out to them, that would have been better for them. Allah is Most Forgiving, Most Merciful."
          ],
          "en.mubarakpuri": [
            "And if they had patience till you could come out to them, it would have been better for them. And Allah is Forgiving, Most Merciful."
          ],
          "en.pickthall": [
            "And if they had had patience till thou camest forth unto them, it had been better for them. And Allah is Forgiving, Merciful."
          ],
          "en.qarai": [
            "Had they been patient until you came out for them, it would have been better for them, and Allah is all-forgiving, all-merciful."
          ],
          "en.qaribullah": [
            "If they had patience until you went out to them, it would have been better for them. But Allah is the Forgiving and the Most Merciful."
          ],
          "en.sahih": [
            "And if they had been patient until you [could] come out to them, it would have been better for them. But Allah is Forgiving and Merciful."
          ],
          "en.sarwar": [
            "Had they exercised patience until you had come out, it would have been better for them. God is All-forgiving and All-merciful."
          ],
          "en.shakir": [
            "And if they wait patiently until you come out to them, it would certainly be better for them, and Allah is Forgiving, Merciful."
          ],
          "en.transliteration": [
            "Walaw annahum <u>s</u>abaroo <u>h</u>att<u>a</u> takhruja ilayhim lak<u>a</u>na khayran lahum wa<b>A</b>ll<u>a</u>hu ghafoorun ra<u>h</u>eem<b>un</b>"
          ],
          "en.wahiduddin": [
            "If they waited patiently until you came out to see them, it would be better for them. But God is forgiving and merciful."
          ],
          "en.yusufali": [
            "If only they had patience until thou couldst come out to them, it would be best for them: but Allah is Oft-Forgiving, Most Merciful."
          ],
          "fa.ansarian": [
            "و اگر آنان صبر می کردند تا به سویشان بیرون آیی، یقیناً برای آنان بهتر بود، و خدا بسیار آمرزنده و مهربان است."
          ],
          "fa.ayati": [
            "اگر صبر مى‌كردند تا تو خود بيرون مى‌آمدى و نزد آنها مى‌رفتى برايشان بهتر مى‌بود، و خدا آمرزنده مهربان است."
          ],
          "fa.bahrampour": [
            "و اگر آنها صبر مى‌كردند تا تو [خود] به سراغشان آيى برايشان بهتر بود، و خدا آمرزنده‌ى مهربان است"
          ],
          "fa.fooladvand": [
            "و اگر صبر كنند تا بر آنان درآيى، مسلماً برايشان بهتر است و خدا آمرزنده و مهربان است."
          ],
          "fa.ghomshei": [
            "و اگر آنها صبر می‌کردند تا وقتی که تو بر ایشان خارج شوی بسیار بر آنها بهتر بود و (باز هم اگر توبه کنند) خدا بسیار آمرزنده و مهربان است."
          ],
          "fa.khorramdel": [
            "اگر آنان تأمّل کنند تا تو بیرون بیائی و به پیش ایشان روی، برای آنان بهتر خواهد بود. خداوند آمرزگار و مهربان است. [[«وَاللهُ غَفُورٌ رَّحِیمٌ»: این بخش به مرتکبان چنین اعمالی نوید می‌دهد که اگر توبه کنند مشمول مرحمت و مغفرت خدا واقع می‌شوند.]]"
          ],
          "fa.khorramshahi": [
            "و اگر آنان صبر می‌کردند که تو بر ایشان بیرون آیی، بی‌شک بر ایشان بهتر بود، و خداوند آمرزگار مهربان است‌"
          ],
          "fa.makarem": [
            "اگر آنها صبر می‌کردند تا خود به سراغشان آیی، برای آنان بهتر بود؛ و خداوند آمرزنده و رحیم است!"
          ],
          "fa.moezzi": [
            "و اگر ایشان صبر می‌کردند تا برون آئی برایشان هر آینه بهتر بود آنان را و خدا است آمرزگار مهربان‌"
          ],
          "fa.mojtabavi": [
            "و اگر صبر كنند تا به نزد آنان بيرون شوى هر آينه برايشان بهتر است، و خدا آمرزگار و مهربان است."
          ],
          "fa.sadeqi": [
            "و اگر اینان همواره صبر کنند تا بر آنان درآیی، همانا برایشان بهتر است. و خدا پوشنده‌ی رحمتگر بر ویژگان است."
          ]
        }
      },
      {
        "index": 4618,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:49:6",
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا إِنْ‌ جَاءَکُمْ‌ فَاسِقٌ‌ بِنَبَإٍ فَتَبَيَّنُوا أَنْ‌ تُصِيبُوا قَوْماً بِجَهَالَةٍ فَتُصْبِحُوا عَلَى‌ مَا فَعَلْتُمْ‌ نَادِمِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O you who believe, if a dissolute person brings some news, verify it first lest you attack a people ignorantly and later regret what you had done."
          ],
          "en.ahmedraza": [
            "O People who Believe! If any miscreant brings you some tidings, verify it, lest you unknowingly cause suffering to some people, and then remain repenting for what you did."
          ],
          "en.arberry": [
            "O believers, if an ungodly man comes to you with a tiding, make clear, lest you afflict a people unwittingly, and then repent of what you have done."
          ],
          "en.daryabadi": [
            "ye who believe! if an evil-doer Came Unto you with a report, then inquire strictly, lest ye hurt a people in ignorance and repent thereafter of that which ye have done."
          ],
          "en.hilali": [
            "O you who believe! If a rebellious evil person comes to you with a news, verify it, lest you harm people in ignorance, and afterwards you become regretful to what you have done."
          ],
          "en.itani": [
            "O you who believe! If a troublemaker brings you any news, investigate, lest you harm people out of ignorance, and you become regretful for what you have done."
          ],
          "en.maududi": [
            "Believers, when an ungodly person brings to you a piece of news, carefully ascertain its truth, lest you should hurt a people unwittingly and thereafter repent at what you did."
          ],
          "en.mubarakpuri": [
            "O you who believe! If a rebellious evil person comes to you with a news, verify it, lest you harm people in ignorance, and afterwards you become regretful to what you have done."
          ],
          "en.pickthall": [
            "O ye who believe! If an evil-liver bring you tidings, verify it, lest ye smite some folk in ignorance and afterward repent of what ye did."
          ],
          "en.qarai": [
            "O you who have faith! If a vicious character brings you some news, verify it, lest you should visit [harm] on some people out of ignorance, and then become regretful for what you have done."
          ],
          "en.qaribullah": [
            "Believers, if an evildoer brings you a piece of news, inquire first, in case you should unwittingly wrong others and then repent of what you have done."
          ],
          "en.sahih": [
            "O you who have believed, if there comes to you a disobedient one with information, investigate, lest you harm a people out of ignorance and become, over what you have done, regretful."
          ],
          "en.sarwar": [
            "Believers, if one who publicly commits sins brings you any news, ascertain its truthfulness carefully, lest you harm people through ignorance and then regret what you have done."
          ],
          "en.shakir": [
            "O you who believe! if an evil-doer comes to you with a report, look carefully into it, lest you harm a people in ignorance, then be sorry for what you have done."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo in j<u>a</u>akum f<u>a</u>siqun binabain fatabayyanoo an tu<u>s</u>eeboo qawman bijah<u>a</u>latin fatu<u>s</u>bi<u>h</u>oo AAal<u>a</u> m<u>a</u> faAAaltum n<u>a</u>dimeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "Believers, if an evil-doer brings you news, ascertain the correctness of the report fully, lest you unwittingly harm others, and then regret what you have done,"
          ],
          "en.yusufali": [
            "O ye who believe! If a wicked person comes to you with any news, ascertain the truth, lest ye harm people unwittingly, and afterwards become full of repentance for what ye have done."
          ],
          "fa.ansarian": [
            "ای اهل ایمان! اگر فاسقی خبری برایتان آورد، خبرش را بررسی و تحقیق کنید تا مبادا از روی ناآگاهی، گروهی را آسیب و گزند رسانید و بر کرده خود پشیمان شوید."
          ],
          "fa.ayati": [
            "اى كسانى كه ايمان آورده‌ايد، اگر فاسقى برايتان خبرى آورد تحقيق كنيد، مباد از روى نادانى به مردمى آسيب برسانيد، آنگاه از كارى كه كرده‌ايد پشيمان شويد."
          ],
          "fa.bahrampour": [
            "اى كسانى كه ايمان آورده‌ايد! اگر فاسقى برايتان خبرى آورد، نيك وارسى كنيد تا مبادا به نادانى، گروهى را آسيب رسانيد آن‌گاه بر آنچه كرده‌ايد پشيمان شويد"
          ],
          "fa.fooladvand": [
            "اى كسانى كه ايمان آورده‌ايد، اگر فاسقى برايتان خبرى آورد، نيك وارسى كنيد، مبادا به نادانى گروهى را آسيب برسانيد و [بعد،] از آنچه كرده‌ايد پشيمان شويد."
          ],
          "fa.ghomshei": [
            "ای مؤمنان، هر گاه فاسقی خبری برای شما آورد تحقیق کنید، مبادا از روی نادانی به قومی رنجی رسانید و سخت از کار خود پشیمان گردید."
          ],
          "fa.khorramdel": [
            "ای کسانی که ایمان آورده‌اید! اگر شخص فاسقی خبری را به شما رسانید درباره‌ی آن تحقیق کنید، مبادا به گروهی - بدون آگاهی (از حال و احوالشان و شناخت راستین ایشان -)آسیب برسانید، و از کرده‌ی خود پشیمان شوید. [[«فَاسِقٌ»: کافر (نگا: نور / 55). منافق (نگا: توبه / 67). کسی که متجاوز از حدود شریعت بوده و برابر قرآن عمل نکند (نگا: مائده / 47). در اینجا مراد کسی است که مجهول‌العداله بوده و صداقت او محرز نباشد. «بِجَهَالَةٍ»: از روی نادانی. به خاطر بی‌خبری و عدم آگاهی.]]"
          ],
          "fa.khorramshahi": [
            "ای مؤمنان اگر فرد فاسقی خبری برایتان آورد، [در آن‌] بررسی کنید مبادا نادانسته به قومی زیان رسانید، آنگاه به خاطر کاری که کرده‌اید پشیمان شوید"
          ],
          "fa.makarem": [
            "ای کسانی که ایمان آورده‌اید! اگر شخص فاسقی خبری برای شما بیاورد، درباره آن تحقیق کنید، مبادا به گروهی از روی نادانی آسیب برسانید و از کرده خود پشیمان شوید!"
          ],
          "fa.moezzi": [
            "ای آنان که ایمان آوردید اگر بیاید شما را گنهکاری (فاسقی) به آگهی پس بازرسی کنید نبادا بکشید قومی را به نادانی پس بامداد کنید بر آنچه کردید پشیمانان‌"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه ايمان آورده‌ايد، اگر دروغگويى برون شده از فرمان خداى به شما خبرى آورد نيك بررسى كنيد تا مبادا نادانسته به مردمى آسيب رسانيد، و آنگاه بر آنچه كرديد پشيمان گرديد."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که ایمان آوردید! اگر فاسقی برایتان خبری آورد، پس نیک وارسی و آشکارگری کنید، مبادا به نادانی، گروهی را آسیب برسانید؛ پس از آنچه کرده‌اید پشیمان شوید."
          ]
        }
      },
      {
        "index": 4619,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:49:7",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:108:70",
            "/books/al-kafi:2:1:60:5",
            "/books/al-kafi:1:4:108:71",
            "/books/al-kafi:8:1:17:3"
          ]
        },
        "text": [
          "وَ اعْلَمُوا أَنَ‌ فِيکُمْ‌ رَسُولَ‌ اللَّهِ‌ لَوْ يُطِيعُکُمْ‌ فِي‌ کَثِيرٍ مِنَ‌ الْأَمْرِ لَعَنِتُّمْ‌ وَ لٰکِنَ‌ اللَّهَ‌ حَبَّبَ‌ إِلَيْکُمُ‌ الْإِيمَانَ‌ وَ زَيَّنَهُ‌ فِي‌ قُلُوبِکُمْ‌ وَ کَرَّهَ‌ إِلَيْکُمُ‌ الْکُفْرَ وَ الْفُسُوقَ‌ وَ الْعِصْيَانَ‌ أُولٰئِکَ‌ هُمُ‌ الرَّاشِدُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Know that the Apostle of God is among you: If he agreed with you in most matters you would surely come to grief. But God has made faith more desirable to you, and attractive to your hearts, and rendered disbelief and sin and disobedience repugnant. They are those who are well directed"
          ],
          "en.ahmedraza": [
            "And know that Allah’s Noble Messenger is among you; in most of the affairs, were he to listen to you, you would surely fall into hardship, but Allah has made faith dear to you and has instilled it in your hearts, and has made disbelief and rebellion and disobedience abhorred by you; it is people like these who are on guidance."
          ],
          "en.arberry": [
            "And know that the Messenger of God is among you. If he obeyed you in much of the affair, you would suffer; but God has endeared to you belief, decking it fair in your hearts, and He has made detestable to you unbelief and ungodliness and disobedience. Those -- they are the right-minded,"
          ],
          "en.daryabadi": [
            "And know that verily among you is the apostle of Allah. Were he to obey you in many affairs, ye would surely be in trouble but Allah hath endeared belief to you and hath made it fair-seeming in your hearts, and hath rendered detestable Unto you infidelity and wickedness and disobedience. These! they are the men of rectitude."
          ],
          "en.hilali": [
            "And know that, among you there is the Messenger of Allah (SAW). If he were to obey you (i.e. follow your opinions and desires) in much of the matter, you would surely be in trouble, but Allah has endeared the Faith to you and has beautified it in your hearts, and has made disbelief, wickedness and disobedience (to Allah and His Messenger SAW) hateful to you. These! They are the rightly guided ones,"
          ],
          "en.itani": [
            "And know that among you is the Messenger of God. Had he obeyed you in many things, you would have suffered hardship. But God has given you the love of faith, and adorned it in your hearts, and made disbelief, mischief, and rebellion hateful to you. These are the rightly guided."
          ],
          "en.maududi": [
            "Know that Allah's Messenger is among you. Were he to follow you in many an affair, you yourselves would suffer. But Allah has endeared faith to you and has embellished it in your hearts, and has made unbelief and evil-doing and disobedience abhorrent to you. Such are those who are rightly guided,"
          ],
          "en.mubarakpuri": [
            "And know that among you there is the Messenger of Allah. If he were to obey you in much of the matter, you would surely be in trouble, but Allah has endeared the faith to you and has beautified it in your hearts, and has made disbelief, Fusuq and `Isyan hateful to you. Such are they who are the rightly guided."
          ],
          "en.pickthall": [
            "And know that the messenger of Allah is among you. If he were to obey you in much of the government, ye would surely be in trouble; but Allah hath endeared the faith to you and hath beautified it in your hearts, and hath made disbelief and lewdness and rebellion hateful unto you. Such are they who are the rightly guided."
          ],
          "en.qarai": [
            "Know that the Apostle of Allah is among you. Should he comply with you in many matters, you would surely suffer. But Allah has endeared faith to you and made it appealing in your hearts, and He has made hateful to you faithlessness, transgression and disobedience. It is such who are the right-minded—"
          ],
          "en.qaribullah": [
            "Know that the Messenger of Allah is among you. If he were to obey you in many matters, you would surely suffer. But Allah has endeared the Belief to youand beautified it in your hearts, and has made detestable to you disbelief, wrongdoing, and disobedience. Such are those who are righteous"
          ],
          "en.sahih": [
            "And know that among you is the Messenger of Allah. If he were to obey you in much of the matter, you would be in difficulty, but Allah has endeared to you the faith and has made it pleasing in your hearts and has made hateful to you disbelief, defiance and disobedience. Those are the [rightly] guided."
          ],
          "en.sarwar": [
            "Know that the Messenger of God is with you. Had he yielded to you on many of the matters, you would have been in great trouble. But God has endeared the faith to you and has made it attractive to your hearts. He has made disbelief, evil deeds and disobedience hateful to you. Such people will have the right guidance"
          ],
          "en.shakir": [
            "And know that among you is Allah's Apostle; should he obey you in many a matter, you would surely fall into distress, but Allah has endeared the faith to you and has made it seemly in your hearts, and He has made hateful to you unbelief and transgression and disobedience; these it is that are the followers of a right way."
          ],
          "en.transliteration": [
            "Wa<b>i</b>AAlamoo anna feekum rasoola All<u>a</u>hi law yu<u>t</u>eeAAukum fee katheerin mina alamri laAAanittum wal<u>a</u>kinna All<u>a</u>ha <u>h</u>abbaba ilaykumu aleem<u>a</u>na wazayyanahu fee quloobikum wakarraha ilaykumu alkufra wa<b>a</b>lfusooqa wa<b>a</b>lAAi<u>s</u>y<u>a</u>na ol<u>a</u>ika humu a<b>l</b>rr<u>a</u>shidoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "and know that the Messenger of God is among you. If he were to obey you in many things, you would suffer for it. However, God has endeared the faith to you, and beautified it in your hearts, and has made denial of the truth, wickedness, and disobedience hateful to you. People such as these are rightly guided"
          ],
          "en.yusufali": [
            "And know that among you is Allah's Messenger: were he, in many matters, to follow your (wishes), ye would certainly fall into misfortune: But Allah has endeared the Faith to you, and has made it beautiful in your hearts, and He has made hateful to you Unbelief, wickedness, and rebellion: such indeed are those who walk in righteousness;-"
          ],
          "fa.ansarian": [
            "و بدانید که پیامبر خدا در میان شماست [و بر شما واجب است در همه امور از او پیروی کنید]، اگر او در بسیاری از کارها از شما پیروی کند، قطعاً دچار گرفتاری و زحمت می شوید، ولی خدا ایمان را محبوب شما قرار داد و آن را در دل هایتان بیاراست، و کفر و بدکاری و نافرمانی را ناخوشایند شما ساخت، اینان [که دارای این ویژگی ها هستند] هدایت یافته اند."
          ],
          "fa.ayati": [
            "و بدانيد كه پيامبر خدا در ميان شماست. اگر در بسيارى از امور از شما فرمان ببرد به رنج مى‌افتيد. ولى خدا ايمان را محبوب شما ساخت و آن را در دلتان بياراست و كفر و فسق و عصيان را در نظرتان مكروه گردانيد. اينان خود راه‌يافتگانند."
          ],
          "fa.bahrampour": [
            "و بدانيد كه رسول خدا در ميان شماست. اگر در بسيارى از كارها از [رأى و ميل‌] شما پيروى مى‌كرد، دچار هلاك و زحمت مى‌شديد، ليكن خدا ايمان را محبوب شما كرد و آن را در دل‌هاى شما آراست و انكار و نافرمانى و عصيان را منفور شما گردانيد. آنها واقعا رشد يافتگانن"
          ],
          "fa.fooladvand": [
            "و بدانيد كه پيامبر خدا در ميان شماست. اگر در بسيارى از كارها از [رأى و ميل‌] شما پيروى كند، قطعاً دچار زحمت مى‌شويد، ليكن خدا ايمان را براى شما دوست‌داشتنى گردانيد و آن را در دلهاى شما بياراست و كفر و پليدكارى و سركشى را در نظرتان ناخوشايند ساخت. آنان [كه چنين‌اند] ره‌يافتگانند."
          ],
          "fa.ghomshei": [
            "و بدانید رسول خدا در میان شماست، که اگر در بسیاری از امور رأی شما را پیروی کند خود به رنج و زحمت می‌افتید و لیکن خدا مقام ایمان را محبوب شما گردانید و در دلهاتان نیکو بیاراست و کفر و فسق و معصیت را زشت و منفور در نظرتان ساخت. اینان به حقیقت اهل صواب و هدایتند."
          ],
          "fa.khorramdel": [
            "بدانید که پیغمبر خدا در میان شما است (قدر او را بدانید و بدو احترام بگذارید). هرگاه در بسیاری از کارها از شما اطاعت کند، به مشقّت خواهید افتاد. امّا خداوند ایمان را در نظرتان گرامی داشته است و آن را در دلهایتان آراسته است، و کفر و نافرمانی و گناه را در نظرتان زشت و ناپسند جلوه داده است، فقط آنان (که دارای این صفات هستند، یعنی ایمان در نظرشان محبوب و مزیّن، و کفر و فسق و عصیان در نظرشان منفور و مطرود است) راهیابند و بس. [[«لَعَنِتُّمْ»: قطعاً به مشقت می‌افتید. هلاک و نابود می‌گردید (نگا: آل‌عمران / 118، توبه / 128). «حَبَّبَ»: گرامی و دوست‌داشتنی کرده است. «کَرَّهَ»: زشت و ناپسند کرده است. «الْفُسُوقَ»: نافرمانی. خروج از حدود شریعت خدا. «الْعِصْیَانَ»: سرکشی. مخالفت با اوامر خدا. «أُولئِکَ»: آنان که مجمع این صفات و فضائلند. یعنی عاشقان ایمان و دوستداران فرمان یزدان، و بیزاران از کفر و فسق و عصیان.]]"
          ],
          "fa.khorramshahi": [
            "و بدانید که پیامبر خدا در میان شماست که اگر در بسیاری از امور از شما پیروی کند، به مشقت افتید، ولی خداوند ایمان را خوشایند شما قرار داد و آن را در دلهایتان آراست، و کفر و فسق و عصیان را برای شما ناخوشایند ساخت، اینانند که رهیافتگانند"
          ],
          "fa.makarem": [
            "و بدانید رسول خدا در میان شماست؛ هرگاه در بسیاری از کارها از شما اطاعت کند، به مشقّت خواهید افتاد؛ ولی خداوند ایمان را محبوب شما قرار داده و آن را در دلهایتان زینت بخشیده، و (به عکس) کفر و فسق و گناه را منفورتان قرار داده است؛ کسانی که دارای این صفاتند هدایت یافتگانند!"
          ],
          "fa.moezzi": [
            "و بدانید که در شما است پیمبر خدا اگر سخن شما را شنود (اطاعت شما کند) در بسی از کارها هر آینه به رنج افتید و لیکن خدا دوست (خوش‌آیند) کرد نزد شما ایمان را و بیاراستش در دلهای شما و ناخوش‌آیند کرد نزد شما کفر و نافرمانی و سرکشی را آنانند راه‌یافتگان‌"
          ],
          "fa.mojtabavi": [
            "و بدانيد كه پيامبر خدا در ميان شماست- و شما بايد از او فرمان بريد نه او از شما-، كه اگر در بسيارى از كارها شما را فرمان برد هر آينه به رنج افتيد و هلاك شويد، و ليكن خداوند ايمان را در نزد شما دوست‌داشتنى ساخت و آن را در دلهاى شما بياراست، و كفر و بدكردارى و نافرمانى را ناخوشايندتان داشت. ايشانند راه‌يافتگان."
          ],
          "fa.sadeqi": [
            "و بدانید که پیامبر خدا در میان شماست. اگر در بسیاری از کارها از (رأی و میل) شما پیروی کند، به‌راستی دچار زحمت می‌شوید. لیکن خدا ایمان را برای شما دوست‌‌داشتنی گردانید و آن را در دل‌های شما بیاراست و کفر و پلیدکاری و سرکشی را در نظرتان بس ناخوشایند ساخت. هم ایشان [:ایمان‌آورندگان] رشدیافتگانند."
          ]
        }
      },
      {
        "index": 4620,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:49:8",
        "text": [
          "فَضْلاً مِنَ‌ اللَّهِ‌ وَ نِعْمَةً وَ اللَّهُ‌ عَلِيمٌ‌ حَکِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "By God's benevolence and His grace. God is all-knowing and all-wise."
          ],
          "en.ahmedraza": [
            "The munificence and favour of Allah; and Allah is All Knowing, Wise."
          ],
          "en.arberry": [
            "by God's favour and blessing; God is All-knowing, All-wise."
          ],
          "en.daryabadi": [
            "Through grace from Allah and His favour; and Allah is Knowing, Wise."
          ],
          "en.hilali": [
            "(This is) a Grace from Allah and His Favour. And Allah is All-Knowing, All-Wise."
          ],
          "en.itani": [
            "A Grace and Favor from God. God is Knowing and Wise."
          ],
          "en.maududi": [
            "by Allah's favour and bounty. Allah is All-Knowing, All-Wise."
          ],
          "en.mubarakpuri": [
            "This is a grace from Allah and His favor. And Allah is All-Knowing, All-Wise."
          ],
          "en.pickthall": [
            "(It is) a bounty and a grace from Allah; and Allah is Knower, Wise."
          ],
          "en.qarai": [
            "a grace and blessing from Allah, and Allah is all-knowing, all-wise."
          ],
          "en.qaribullah": [
            "by the Favor and Blessing of Allah. Allah is the Knower and the Wise."
          ],
          "en.sahih": [
            "[It is] as bounty from Allah and favor. And Allah is Knowing and Wise."
          ],
          "en.sarwar": [
            "as a favor and a blessing from God. God is All-knowing and All-wise."
          ],
          "en.shakir": [
            "By grace from Allah and as a favor; and Allah is Knowing, Wise."
          ],
          "en.transliteration": [
            "Fa<u>d</u>lan mina All<u>a</u>hi waniAAmatan wa<b>A</b>ll<u>a</u>hu AAaleemun <u>h</u>akeem<b>un</b>"
          ],
          "en.wahiduddin": [
            "through God's bounty and favour; God is all knowing, and wise."
          ],
          "en.yusufali": [
            "A Grace and Favour from Allah; and Allah is full of Knowledge and Wisdom."
          ],
          "fa.ansarian": [
            "[این محبت و ناخوشایندی نسبت به حق و باطل] عطیه و نعمتی از سوی خداست؛ و خدا دانا و حکیم است."
          ],
          "fa.ayati": [
            "بخشش و نعمتى است از جانب خدا، و خدا دانا و حكيم است."
          ],
          "fa.bahrampour": [
            "[و اين‌] كرامت و نعمتى از جانب خداوند است و خدا داناى حكيم است"
          ],
          "fa.fooladvand": [
            "[و اين‌] بخششى از خدا و نعمتى [از اوست‌]، و خدا داناى سنجيده‌كار است."
          ],
          "fa.ghomshei": [
            "این مقام بر آنان به فضل خدا و نعمت الهی حاصل گردید و خدا (به احوال بندگان) دانا و (به صلاح نظام عالم) آگاه است."
          ],
          "fa.khorramdel": [
            "این، لطف و نعمتی از سوی خدا است (که بدانان ارزانی داشته است) و خداوند دارای آگاهی فراوان و فرزانگی بیشمار است (و می‌داند چه کسی شایسته‌ی هدایت، و بایسته‌ی مرحمت و نعمت است). [[«فَضْلاً»: مفعول مطلق برای فعل مقدری، یا مفعول له است.]]"
          ],
          "fa.khorramshahi": [
            "بخشش و نعمتی از جانب خداوند است، و خداوند دانای فرزانه است‌"
          ],
          "fa.makarem": [
            "(و این برای شما بعنوان) فضل و نعمتی از سوی خداست؛ و خداوند دانا و حکیم است.!"
          ],
          "fa.moezzi": [
            "فضلی است از خدا و نعمتی و خدا است دانای حکیم‌"
          ],
          "fa.mojtabavi": [
            "[و اين‌] از روى بخشش و نعمتى است از خداى، و خدا دانا و با حكمت است."
          ],
          "fa.sadeqi": [
            "حال آنکه بخششی از خدا و نعمتی است (از او که به شما داده). خدا بس دانای سنجیده‌کار است."
          ]
        }
      },
      {
        "index": 4621,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:49:9",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:39:9",
            "/books/al-kafi:5:1:4:1",
            "/books/al-kafi:5:1:3:2"
          ]
        },
        "text": [
          "وَ إِنْ‌ طَائِفَتَانِ‌ مِنَ‌ الْمُؤْمِنِينَ‌ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا فَإِنْ‌ بَغَتْ‌ إِحْدَاهُمَا عَلَى‌ الْأُخْرَى‌ فَقَاتِلُوا الَّتِي‌ تَبْغِي‌ حَتَّى‌ تَفِي‌ءَ إِلَى‌ أَمْرِ اللَّهِ‌ فَإِنْ‌ فَاءَتْ‌ فَأَصْلِحُوا بَيْنَهُمَا بِالْعَدْلِ‌ وَ أَقْسِطُوا إِنَ‌ اللَّهَ‌ يُحِبُ‌ الْمُقْسِطِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "If two groups of believers come to fight one another, promote peace between them. Then if one of them turns aggressive against the other, fight against the aggressive party till it returns to God's authority. If it does so, make peace among them equitably and be impartial. Verily God loves those who are just."
          ],
          "en.ahmedraza": [
            "And if two groups of Muslims fight against each other, reconcile them; and if one of them oppresses the other, fight against the oppressor till it returns to the command of Allah; then if it returns, reconcile between them with justice, and be fair; indeed Allah loves the equitable."
          ],
          "en.arberry": [
            "If two parties of the believers fight, put things right between them; then, if one of them is insolent against the other, fight the insolent one till it reverts to God's commandment. If it reverts, set things right between them equitably, and be just. Surely God loves the just."
          ],
          "en.daryabadi": [
            "And if two parties of the believers fall to mutual fighting, then make reconciliation between the twain. Then if one of them rebelleth against the other, fight that Party which rebelleth till it returneth Unto the affair of Allah; then if it returneth, make reconciliation between the twain with justice and be equitable; verily Allah loveth the equitable."
          ],
          "en.hilali": [
            "And if two parties or groups among the believers fall to fighting, then make peace between them both, but if one of them rebels against the other, then fight you (all) against the one that which rebels till it complies with the Command of Allah; then if it complies, then make reconciliation between them justly, and be equitable. Verily! Allah loves those who are equitable."
          ],
          "en.itani": [
            "If two groups of believers fight each other, reconcile between them. But if one group aggresses against the other, fight the aggressing group until it complies with God’s command. Once it has complied, reconcile between them with justice, and be equitable. God loves the equitable."
          ],
          "en.maududi": [
            "If two parties of the believers happen to fight, make peace between them. But then, if one of them transgresses against the other, fight the one that transgresses until it reverts to Allah's command. And if it does revert, make peace between them with justice, and be equitable for Allah loves the equitable."
          ],
          "en.mubarakpuri": [
            "And if two parties among the believers fall to fighting, then make peace between them both. But if one of them outrages against the other, then fight you (all) against the one that which outrages till it complies with the command of Allah. Then if it complies, then make reconciliation between them justly, and be equitable. Verily, Allah loves those who are the equitable."
          ],
          "en.pickthall": [
            "And if two parties of believers fall to fighting, then make peace between them. And if one party of them doeth wrong to the other, fight ye that which doeth wrong till it return unto the ordinance of Allah; then, if it return, make peace between them justly, and act equitably. Lo! Allah loveth the equitable."
          ],
          "en.qarai": [
            "If two groups of the faithful fight one another, make peace between them. But if one party of them aggresses against the other, fight the one which aggresses until it returns to Allah’s ordinance. Then, if it returns, make peace between them fairly, and do justice. Indeed Allah loves the just."
          ],
          "en.qaribullah": [
            "If two parties of believers fight, reform between them. If either of them is insolent against the other, fight the insolent one till they revert to the order of Allah. If they revert, reform between them with justice, and weigh with justice. Allah loves those who weigh with justice."
          ],
          "en.sahih": [
            "And if two factions among the believers should fight, then make settlement between the two. But if one of them oppresses the other, then fight against the one that oppresses until it returns to the ordinance of Allah. And if it returns, then make settlement between them in justice and act justly. Indeed, Allah loves those who act justly."
          ],
          "en.sarwar": [
            "If two parties among the believers start to fight against each other, restore peace among them. If one party rebels against the other, fight against the rebellious one until he surrenders to the command of God. When he does so, restore peace among them with justice and equality; God loves those who maintain justice."
          ],
          "en.shakir": [
            "And if two parties of the believers quarrel, make peace between them; but if one of them acts wrongfully towards the other, fight that which acts wrongfully until it returns to Allah's command; then if it returns, make peace between them with justice and act equitably; surely Allah loves those who act equitably."
          ],
          "en.transliteration": [
            "Wain <u>ta</u>ifat<u>a</u>ni mina almumineena iqtataloo faa<u>s</u>li<u>h</u>oo baynahum<u>a</u> fain baghat i<u>h</u>d<u>a</u>hum<u>a</u> AAal<u>a</u> alokhr<u>a</u> faq<u>a</u>tiloo allatee tabghee <u>h</u>att<u>a</u> tafeea il<u>a</u> amri All<u>a</u>hi fain f<u>a</u>at faa<u>s</u>li<u>h</u>oo baynahum<u>a</u> bi<b>a</b>lAAadli waaqsi<u>t</u>oo inna All<u>a</u>ha yu<u>h</u>ibbu almuqsi<u>t</u>een<b>a</b>"
          ],
          "en.wahiduddin": [
            "If two parties of believers fight against each other, make peace between them; then if after that one of them transgresses against the other, fight the party that transgresses until it submits to the command of God. Then if it complies, make peace between them with equity, and act justly. Truly, God loves the just."
          ],
          "en.yusufali": [
            "If two parties among the Believers fall into a quarrel, make ye peace between them: but if one of them transgresses beyond bounds against the other, then fight ye (all) against the one that transgresses until it complies with the command of Allah; but if it complies, then make peace between them with justice, and be fair: for Allah loves those who are fair (and just)."
          ],
          "fa.ansarian": [
            "و اگر دو گروه از مؤمنان با یکدیگر بجنگند میان آنها صلح و آشتی برقرار کنید، و اگر یکی از آن دو گروه بر دیگری تجاوز کند، با آن گروهی که تجاوز می کند، بجنگید تا به حکم خدا باز گردد. پس اگر بازگشت، میانشان به عدالت و انصاف، صلح و آشتی برقرار کنید؛ و همواره دادگری را پیشه سازید که خدا دادگران را دوست دارد."
          ],
          "fa.ayati": [
            "و اگر دو گروه از مؤمنان با يكديگر به جنگ برخاستند، ميانشان آشتى افكنيد. و اگر يك گروه بر ديگرى تعدى كرد، با آن كه تعدى كرده است بجنگيد تا به فرمان خدا باز گردد. پس اگر بازگشت، ميانشان صلحى عادلانه برقرار كنيد و عدالت ورزيد كه خدا عادلان را دوست دارد."
          ],
          "fa.bahrampour": [
            "و اگر دو طايفه از مؤمنان با هم جنگيدند، ميان آن دو را اصلاح كنيد و اگر يكى از آن دو بر ديگرى تعدى كرد، با آن كه تعدى مى‌كند بجنگيد تا به فرمان خدا بازگردد. پس اگر بازگشت، ميانشان به عدالت صلح دهيد و عدل و انصاف روا داريد، كه بى‌شك خداوند دادگران را دو"
          ],
          "fa.fooladvand": [
            "و اگر دو طايفه از مؤمنان با هم بجنگند، ميان آن دو را اصلاح دهيد، و اگر [باز] يكى از آن دو بر ديگرى تعدّى كرد، با آن [طايفه‌اى‌] كه تعدّى مى‌كند بجنگيد تا به فرمان خدا بازگردد. پس اگر باز گشت، ميان آنها را دادگرانه سازش دهيد و عدالت كنيد، كه خدا دادگران را دوست مى‌دارد."
          ],
          "fa.ghomshei": [
            "و اگر دو طایفه از اهل ایمان با هم به قتال و دشمنی برخیزند البته شما مؤمنان بین آنها صلح برقرار دارید و اگر یک قوم بر دیگری ظلم کرد با آن طایفه ظالم قتال کنید تا به فرمان خدا باز آید، پس هر گاه به حکم حق برگشت با حفظ عدالت میان آنها را صلح دهید و همیشه (با هر دوست و دشمنی) عدالت کنید که خدا بسیار اهل عدل و داد را دوست می‌دارد."
          ],
          "fa.khorramdel": [
            "هرگاه دو گروه از مؤمنان با هم به جنگ پرداختند، در میان آنان صلح برقرار سازید. اگر یکی از آنان در حق دیگری ستم کند و تعدّی ورزد (و صلح را پذیرا نشود)، با آن دسته‌ای که ستم می‌کند و تعدّی می‌ورزد بجنگید تا زمانی که به سوی اطاعت از فرمان خدا برمی‌گردد و حکم او را پذیرا می‌شود. هرگاه بازگشت و فرمان خدا را پذیرا شد، در میان ایشان دادگرانه صلح برقرار سازید و (در اجرای مواد و انجام شرائط آن) عدالت بکار برید، چرا که خدا عادلان را دوست دارد. [[«إِقْتَتَلُوا ... بَیْنَهُمَا»: ذکر فعل به صورت جمع با توجه به معنی (طَآئِفَتَانِ) و ذکر ضمیر به صورت مثنی با توجه به لفظ آن است. «بَغَتْ»: در طغیان از حدّ گذشت (نگا: المصحف المیسر). تعدی و تجاوز کرد. برتری‌جوئی کرد. ستمگری نمود. «تَفی‌ءَ»: برمی‌گردد. بازگشت می‌کند (نگا: بقره / 226). «أَقْسِطُوا»: دادگری کنید. مراد دادگری در پیاده کردن شرائط و مواد صلح در همه احوال و اعمال است.]]"
          ],
          "fa.khorramshahi": [
            "و اگر دو طایفه از مؤمنان با هم در افتند، میان آنان سازش دهید، و اگر یکی از آنها بر دیگری تعدی کرد، پس با آنکه تعدی پیشه کرده است کارزار کنید، تا آنکه به سوی امر الهی باز آید، و اگر باز آمد، آنگاه میان آنان دادگرانه سازش دهید، و به داد بکوشید که خداوند دادگران را دوست دارد"
          ],
          "fa.makarem": [
            "و هرگاه دو گروه از مؤمنان با هم به نزاع و جنگ پردازند، آنها را آشتی دهید؛ و اگر یکی از آن دو بر دیگری تجاوز کند، با گروه متجاوز پیکار کنید تا به فرمان خدا بازگردد؛ و هرگاه بازگشت (و زمینه صلح فراهم شد)، در میان آن دو به عدالت صلح برقرار سازید؛ و عدالت پیشه کنید که خداوند عدالت پیشگان را دوست می‌دارد."
          ],
          "fa.moezzi": [
            "و اگر دو گروه از مؤمنان کارزار کردند پس آشتی افکنید میان آنان و اگر ستم کرد یکیشان بر دیگری پس نبرد کنید با آن که ستمگر است تا برگردد بسوی فرمان خدا و اگر بازگشت پس آشتی افکنید میان آنان به داد و دادگری کنید که خدا دوست دارد دادگران را"
          ],
          "fa.mojtabavi": [
            "و اگر دو گروه از مؤمنان با هم كارزار كنند، ميانشان آشتى دهيد. پس اگر يكى از آن دو بر ديگرى ستم و تجاوز كند، با آن كه ستم و تجاوز مى‌كند بجنگيد تا به فرمان خداى بازگردد. پس اگر باز گشت ميانشان به عدل و داد آشتى دهيد، و دادگرى كنيد، كه خدا دادگران را دوست مى‌دارد."
          ],
          "fa.sadeqi": [
            "و اگر دو گروه از مؤمنان با یکدیگر کشتار کنند، پس میان آن دو را اصلاح کنید. پس اگر یکی از آنان بر دیگری تعدّی کرد، شما با آن (گروهی) که تعدّی می‌کند کشتار کنید تا به فرمان خدا بازگردد. پس اگر بازگشت، میان آنها را دادگرانه سازش دهید و تقسیمی شایسته کنید؛ خدا همواره دادگران را دوست می‌دارد."
          ]
        }
      },
      {
        "index": 4622,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:49:10",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:41:2",
            "/books/al-kafi:5:1:4:1",
            "/books/al-kafi:1:4:41:3"
          ]
        },
        "text": [
          "إِنَّمَا الْمُؤْمِنُونَ‌ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ‌ أَخَوَيْکُمْ‌ وَ اتَّقُوا اللَّهَ‌ لَعَلَّکُمْ‌ تُرْحَمُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "The faithful are surely brothers; so restore friendship among your brothers, and fear God that you may be favoured."
          ],
          "en.ahmedraza": [
            "The Muslims are brothers to each other, therefore make peace between your two brothers and fear Allah, so that you may gain mercy. (The entire Muslim nation is a single brotherhood, without any distinction for caste, creed or colour.)"
          ],
          "en.arberry": [
            "The believers indeed are brothers; so set things right between your two brothers, and fear God; haply so you will find mercy."
          ],
          "en.daryabadi": [
            "The believers are but brethren; wherefore make reconciliation between your brethren and fear Allah, that haply ye may be shewn mercy."
          ],
          "en.hilali": [
            "The believers are nothing else than brothers (in Islamic religion). So make reconciliation between your brothers, and fear Allah, that you may receive mercy."
          ],
          "en.itani": [
            "The believers are brothers, so reconcile between your brothers, and remain conscious of God, so that you may receive mercy."
          ],
          "en.maududi": [
            "Surely the believers are none but brothers unto one another, so set things right between your brothers, and have fear of Allah that you may be shown mercy."
          ],
          "en.mubarakpuri": [
            "The believers are but a brotherhood. So make reconciliation between your brothers, and have Taqwa of Allah that you may receive mercy."
          ],
          "en.pickthall": [
            "The believers are naught else than brothers. Therefore make peace between your brethren and observe your duty to Allah that haply ye may obtain mercy."
          ],
          "en.qarai": [
            "The faithful are indeed brothers. Therefore, make peace between your brothers and be wary of Allah, so that you may receive [His] mercy."
          ],
          "en.qaribullah": [
            "Believers are indeed brothers, therefore make things right among your two brothers and fear Allah, so that you will be subject to mercy."
          ],
          "en.sahih": [
            "The believers are but brothers, so make settlement between your brothers. And fear Allah that you may receive mercy."
          ],
          "en.sarwar": [
            "Believers are each other's brothers. Restore peace among your brothers. Have fear of God so that perhaps you will receive mercy."
          ],
          "en.shakir": [
            "The believers are but brethren, therefore make peace between your brethren and be careful of (your duty to) Allah that mercy may be had on you."
          ],
          "en.transliteration": [
            "Innam<u>a</u> almuminoona ikhwatun faa<u>s</u>li<u>h</u>oo bayna akhawaykum wa<b>i</b>ttaqoo All<u>a</u>ha laAAallakum tur<u>h</u>amoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Surely all believers are brothers. So make peace between your brothers, and fear God, so that mercy may be shown to you."
          ],
          "en.yusufali": [
            "The Believers are but a single Brotherhood: So make peace and reconciliation between your two (contending) brothers; and fear Allah, that ye may receive Mercy."
          ],
          "fa.ansarian": [
            "جز این نیست که همه مؤمنان با هم برادرند؛ بنابراین [در همه نزاع ها و اختلافات] میان برادرانتان صلح و آشتی برقرار کنید، و از خدا پروا نمایید که مورد رحمت قرار گیرید."
          ],
          "fa.ayati": [
            "هر آينه مؤمنان برادرانند. ميان برادرانتان آشتى بيفكنيد و از خدا بترسيد، باشد كه بر شما رحمت آرد."
          ],
          "fa.bahrampour": [
            "جز اين نيست كه مؤمنان با يكديگر برادرند، پس ميان برادرانتان را اصلاح كنيد و از خدا بترسيد، اميد كه مورد رحمت قرار گيريد"
          ],
          "fa.fooladvand": [
            "در حقيقت مؤمنان با هم برادرند، پس ميان برادرانتان را سازش دهيد و از خدا پروا بداريد، اميد كه مورد رحمت قرار گيريد."
          ],
          "fa.ghomshei": [
            "به حقیقت مؤمنان همه برادر یکدیگرند پس همیشه بین برادران ایمانی خود صلح دهید و خداترس و پرهیزکار باشید، باشد که مورد لطف و رحمت الهی گردید."
          ],
          "fa.khorramdel": [
            "فقط مؤمنان برادران همدیگرند، پس میان برادران خود صلح و صفا برقرار کنید، و از خدا ترس و پروا داشته باشید، تا به شما رحم شود. [[«إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ»: فقط مؤمنان برادران یکدیگرند.]]"
          ],
          "fa.khorramshahi": [
            "همانا مؤمنان [مسلمانان‌] بردارند، پس بین برادرانتان آشتی برقرار سازید، و از خداوند پروا کنید، باشد که مشمول رحمت شوید"
          ],
          "fa.makarem": [
            "مؤمنان برادر یکدیگرند؛ پس دو برادر خود را صلح و آشتی دهید و تقوای الهی پیشه کنید، باشد که مشمول رحمت او شوید!"
          ],
          "fa.moezzi": [
            "جز این نیست که مؤمنان برادرند پس آشتی افکنید میان برادران خویش و بترسید خدا را شاید رحم شوید"
          ],
          "fa.mojtabavi": [
            "همانا مؤمنان برادران [يكديگر] اند، پس ميان [آن دو گروه‌] برادرانتان آشتى افكنيد و از خداى پروا كنيد، باشد كه درخور رحمت گرديد."
          ],
          "fa.sadeqi": [
            "مؤمنان فقط با هم برادرند، پس میان برادرانتان را سازش دهید و از خدا پروا بدارید، شاید مورد رحمت قرار گیرید."
          ]
        }
      },
      {
        "index": 4623,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:49:11",
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا لاَ يَسْخَرْ قَوْمٌ‌ مِنْ‌ قَوْمٍ‌ عَسَى‌ أَنْ‌ يَکُونُوا خَيْراً مِنْهُمْ‌ وَ لاَ نِسَاءٌ مِنْ‌ نِسَاءٍ عَسَى‌ أَنْ‌ يَکُنَ‌ خَيْراً مِنْهُنَ‌ وَ لاَ تَلْمِزُوا أَنْفُسَکُمْ‌ وَ لاَ تَنَابَزُوا بِالْأَلْقَابِ‌ بِئْسَ‌ الاِسْمُ‌ الْفُسُوقُ‌ بَعْدَ الْإِيمَانِ‌ وَ مَنْ‌ لَمْ‌ يَتُبْ‌ فَأُولٰئِکَ‌ هُمُ‌ الظَّالِمُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O you who believe, men should not laugh at other men, for it may be they are better than them; and women should not laugh at other women, for they may perhaps be better than them. Do not slander one another, nor give one another nick-names. After believing, it is bad to give (another) a bad name. Those who do not repent behave wickedly."
          ],
          "en.ahmedraza": [
            "O People who Believe! Men must not ridicule other men for it could be that the ridiculed are better than the mockers, nor must the women ridicule other women for the ridiculed women may be better than the mockers; and do not insult one another, nor assign evil nicknames; how base it is to be called a sinner after being a Muslim! And whoever does not repent – then it is they who are unjust."
          ],
          "en.arberry": [
            "O believers, let not any people scoff at another people who may be better than they; neither let women scoff at women who may be better than themselves. And find not fault with one another, neither revile one another by nicknames. An evil name is ungodliness after belief. And whoso repents not, those -- they are the evildoers."
          ],
          "en.daryabadi": [
            "O ye who believe! let not one group scoff at another group, belike they may be better than they are, nor let some women scoff at other women, belike they may be better than they are. And traduce not one another, nor revile one another by odious appellations! ill is the name of sin after belief. And whosoever will not repent, then those, they are the wrong-doers."
          ],
          "en.hilali": [
            "O you who believe! Let not a group scoff at another group, it may be that the latter are better than the former; nor let (some) women scoff at other women, it may be that the latter are better than the former, nor defame one another, nor insult one another by nicknames. How bad is it, to insult one's brother after having Faith [i.e. to call your Muslim brother (a faithful believer) as: \"O sinner\", or \"O wicked\", etc.]. And whosoever does not repent, then such are indeed Zalimun (wrong-doers, etc.)."
          ],
          "en.itani": [
            "O you who believe! No people shall ridicule other people, for they may be better than they. Nor shall any women ridicule other women, for they may be better than they. Nor shall you slander one another, nor shall you insult one another with names. Evil is the return to wickedness after having attained faith. Whoever does not repent—these are the wrongdoers."
          ],
          "en.maududi": [
            "Believers, let not a group (of men) scoff at another group, it may well be that the latter (at whom they scoff) are better than they; nor let a group of women scoff at another group, it may well be that the latter are better than they. And do not taunt one another, nor revile one another by nicknames. It is an evil thing to gain notoriety for ungodliness after belief. Those who do not repent are indeed the wrong-doers."
          ],
          "en.mubarakpuri": [
            "O you who believe! Let not a group scoff at another group, it may be that the latter are better than the former. Nor let (some) women scoff at other women, it may be that the latter are better than the former. Nor defame yourselves, nor insult one another by nicknames. Evil is the name of wickedness after faith. And whosoever does not repent, then such are indeed wrongdoers."
          ],
          "en.pickthall": [
            "O ye who believe! Let not a folk deride a folk who may be better than they (are), not let women (deride) women who may be better than they are; neither defame one another, nor insult one another by nicknames. Bad is the name of lewdness after faith. And whoso turneth not in repentance, such are evil-doers."
          ],
          "en.qarai": [
            "O you who have faith! Let not any people ridicule another people: it may be that they are better than they are; nor let women [ridicule] women: it may be that they are better than they are. And do not defame one another, nor insult one another by [calling] nicknames. How evil are profane names subsequent to faith! As for those who are not penitent [of their past conduct]—such are the wrongdoers."
          ],
          "en.qaribullah": [
            "Believers, do not let people mock other people who may be better than themselves. Do not let women mock women, who may be better than themselves. Do not find fault with one another, nor abuse one another with nicknames. An evil name is disobedience after belief. Those who do not repent are the harmdoers."
          ],
          "en.sahih": [
            "O you who have believed, let not a people ridicule [another] people; perhaps they may be better than them; nor let women ridicule [other] women; perhaps they may be better than them. And do not insult one another and do not call each other by [offensive] nicknames. Wretched is the name of disobedience after [one's] faith. And whoever does not repent - then it is those who are the wrongdoers."
          ],
          "en.sarwar": [
            "Believers, let not a group of you mock another. Perhaps they are better than you. Let not women mock each other; perhaps one is better than the other. Let not one of you find faults in another nor let anyone of you defame another. How terrible is the defamation after having true faith. Those who do not repent are certainly unjust."
          ],
          "en.shakir": [
            "O you who believe! let not (one) people laugh at (another) people perchance they may be better than they, nor let women (laugh) at (other) women, perchance they may be better than they; and do not find fault with your own people nor call one another by nicknames; evil is a bad name after faith, and whoever does not turn, these it is that are the unjust."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo l<u>a</u> yaskhar qawmun min qawmin AAas<u>a</u> an yakoonoo khayran minhum wal<u>a</u> nis<u>a</u>on min nis<u>a</u>in AAas<u>a</u> an yakunna khayran minhunna wal<u>a</u> talmizoo anfusakum wal<u>a</u> tan<u>a</u>bazoo bi<b>a</b>lalq<u>a</u>bi bisa alismu alfusooqu baAAda aleem<u>a</u>ni waman lam yatub faol<u>a</u>ika humu a<b>l</b><i><u>thth</u></i><u>a</u>limoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Believers, let not some men among you ridicule others: it may be that the latter are better than the former: nor should some women laugh at others: it may be that the latter are better than the former: do not defame or be sarcastic to each other, or call each other by [offensive] nicknames. How bad it is to earn an evil reputation after accepting the faith! Those who do not repent are evil-doers."
          ],
          "en.yusufali": [
            "O ye who believe! Let not some men among you laugh at others: It may be that the (latter) are better than the (former): Nor let some women laugh at others: It may be that the (latter are better than the (former): Nor defame nor be sarcastic to each other, nor call each other by (offensive) nicknames: Ill-seeming is a name connoting wickedness, (to be used of one) after he has believed: And those who do not desist are (indeed) doing wrong."
          ],
          "fa.ansarian": [
            "ای اهل ایمان! نباید گروهی گروه دیگر را مسخره کنند، شاید مسخره شده ها از مسخره کنندگان بهتر باشند، ونباید زنانی زنان دیگر را [مسخره کنند] شاید مسخره شده ها از مسخره کنندگان بهتر باشند، و از یکدیگر عیب جویی نکنید و با لقب های زشت و ناپسند یکدیگر را صدا نزنید؛ بد نشانه و علامتی است اینکه انسانی را پس از ایمان آوردنش به لقب زشت علامت گذاری کنند. و کسانی که [از این امور ناهنجار و زشت] توبه نکنند، خود ستمکارند."
          ],
          "fa.ayati": [
            "اى كسانى كه ايمان آورده‌ايد، مباد كه گروهى از مردان گروه ديگر را مسخره كند، شايد آن مسخره‌شدگان بهتر از آنها باشند. و مباد كه گروهى از زنان گروه ديگر را مسخره كند، شايد آن مسخره‌شدگان بهتر از آنها باشند. و از هم عيبجويى مكنيد و يكديگر را به القاب زشت مخوانيد. بد است عنوان فسق پس از ايمان‌آوردن. و كسانى كه توبه نمى‌كنند خود ستمكارانند."
          ],
          "fa.bahrampour": [
            "اى كسانى كه ايمان آورده‌ايد! نبايد قومى قوم ديگر را استهزا كنند، شايد آنها از اينها بهتر باشند، و نه زنانى زنان [ديگر] را، شايد آنها از اينها بهتر باشند، و عيب يكديگر را به رخ نكشيد و همديگر را به لقب‌هاى زشت مخوانيد كه بدنامى است نام كفر و فسوق پس ا"
          ],
          "fa.fooladvand": [
            "اى كسانى كه ايمان آورده‌ايد، نبايد قومى قوم ديگر را ريشخند كند، شايد آنها از اينها بهتر باشند، و نبايد زنانى زنان [ديگر] را [ريشخند كنند ]، شايد آنها از اينها بهتر باشند، و از يكديگر عيب مگيريد، و به همديگر لقبهاى زشت مدهيد؛ چه ناپسنديده است نام زشت پس از ايمان. و هر كه توبه نكرد آنان خود ستمكارند."
          ],
          "fa.ghomshei": [
            "ای اهل ایمان، مؤمنان هرگز نباید قومی قوم دیگر را مسخره و استهزا کنند، شاید آن قوم که مسخره می‌کنند از خود آنان بهتر باشند. و نیز بین زنان با ایمان قومی دیگری را سخریّه نکنند که بسا آن قوم از خود آن زنان بهتر باشند، و هرگز عیبجویی (از همدینان) خود مکنید و به نام و لقب‌های زشت یکدیگر را مخوانید که پس از ایمان به خدا نام فسق (بر مؤمن نهادن) بسیار زشت است و هر که توبه نکند چنین کسان بسیار ظالم و ستمکارند."
          ],
          "fa.khorramdel": [
            "ای کسانی که ایمان آورده‌اید! نباید گروهی از مردان شما گروه دیگری را استهزاء کنند، شاید آنان بهتر از اینان باشند، و نباید زنانی زنان دیگری را استهزاء کنند، زیرا چه‌بسا آنان از اینان خوبتر باشند، و همدیگر را طعنه نزنید و مورد عیبجوئی قرار ندهید، و یکدیگر را با القاب زشت و ناپسند مخوانید و منامید. (برای مسلمان) چه بد است، بعد از ایمان آوردن، سخنان ناگوار و گناه‌آلود (دالّ بر تمسخر، و طعنه زدن و عیبجوئی کردن، و به القاب بد خواندن) گفتن و بر زبان راندن! کسانی که (از چنین اعمالی و اقوالی) دست برندارند و توبه نکنند، ایشان ستمگرند (و با سخنان نیشدار، و با خرده‌گیریها، و ملقّب گرداندن مردم به القاب زشت و توهین‌آمیز، به دیگران ظلم می‌کنند). [[«لا یَسْخَرْ»: مسخره نکند. مورد استهزاء قرار ندهد. «لا تَلْمِزُوا»: طعنه نزنید. عیبجوئی نکنید (نگا: توبه / 58 و 79). «لا تَنَابَزُوا»: ملقب به القاب قبیح و ناپسند مکنید. ذکر (القاب) بعد از چنین فعلی، برای تأکید است؛ همان گونه که واژه (جَناحَیْهِ) در (انعام / 38) چنین است. «الاِسْمُ»: نام. یاد کردن (نگا: قاسمی). صفت (نگا: المصحف المیسر). «الْفُسُوقُ»: (نگا: بقره / 197 و 282، حجرات / 7). «بِئْسَ الاِسْمُ الْفُسُوقُ بَعْدَ الإِیمَانِ»: چه بد است کسی را فاسق یا کافر نامید و او مؤمن باشد. برای مسلمانان چه بد است، بعد از ایمان آوردن، از یکدیگر به بدی یاد کنند، و بجای ذکر خیر، ذکر شر کنند.]]"
          ],
          "fa.khorramshahi": [
            "ای مؤمنان نباید که قومی، قوم دیگر را به ریشخند بگیرد، چه بسا اینان از آنان بهتر باشند، و نیز نباید زنانی زنان دیگر را [ریشخند کنند] چه بسا اینان از آنان بهتر باشند، و در میان خویش عیب‌جویی مکنید، و یکدیگر را به لقبهای بد مخوانید پس از ایمان، پرداختن به فسق، بد رسمی است، و هر کس [از این کار] بازنگردد، اینانند که ستمگرانند"
          ],
          "fa.makarem": [
            "ای کسانی که ایمان آورده‌اید! نباید گروهی از مردان شما گروه دیگر را مسخره کنند، شاید آنها از اینها بهتر باشند؛ و نه زنانی زنان دیگر را، شاید آنان بهتر از اینان باشند؛ و یکدیگر را مورد طعن و عیبجویی قرار ندهید و با القاب زشت و ناپسند یکدیگر را یاد نکنید، بسیار بد است که بر کسی پس از ایمان نام کفرآمیز بگذارید؛ و آنها که توبه نکنند، ظالم و ستمگرند!"
          ],
          "fa.moezzi": [
            "ای آنان که ایمان آوردید مسخره نکنند گروهی از گروهی شاید باشند بهتر از ایشان و نه زنانی از زنانی شاید باشند بهتر از ایشان و نکوهش نکنید خویشتن را و سرزنش نکنید همدیگر را به لقبها بد نامی است سرکشی پس از ایمان و آنکه توبه نکرد پس آنانند ستمگران‌"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه ايمان آورده‌ايد، گروهى [از مردان‌] گروه ديگر را مسخره نكنند، شايد آنان- كه مسخره شده‌اند- از اينان- كه مسخره كرده‌اند- بهتر باشند و نه زنانى زنان ديگر را، شايد آنان از اينان بهتر باشند. و از خودتان- از يكديگر- عيبجويى مكنيد و يكديگر را به لقبها [ى بد و ناخوش‌] مخوانيد. بد نامى است نام‌كردن [مردم‌] به بدكردارى پس از ايمان آوردن [آنها]. و هر كه توبه نكرد پس اينانند ستمكاران."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که ایمان آوردید! نباید گروهی (از مردان) گروه دیگر را مسخره کنند؛ شاید آنها از این‌ها بهتر باشند. و نه زنانی، زنانی (دیگر) را (مسخره کنند) شاید آنان از اینان بهتر باشند. و از خودهاتان عیب‌جویی مکنید و به همدیگر لقب‌های زشت ندهید؛ چه ناپسندیده است نام زشت پس از ایمان. پس هر کس توبه نکند آنان خودشان ستمکارانند."
          ]
        }
      },
      {
        "index": 4624,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:49:12",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:74:2"
          ]
        },
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا اجْتَنِبُوا کَثِيراً مِنَ‌ الظَّنِ‌ إِنَ‌ بَعْضَ‌ الظَّنِ‌ إِثْمٌ‌ وَ لاَ تَجَسَّسُوا وَ لاَ يَغْتَبْ‌ بَعْضُکُمْ‌ بَعْضاً أَ يُحِبُ‌ أَحَدُکُمْ‌ أَنْ‌ يَأْکُلَ‌ لَحْمَ‌ أَخِيهِ‌ مَيْتاً فَکَرِهْتُمُوهُ‌ وَ اتَّقُوا اللَّهَ‌ إِنَ‌ اللَّهَ‌ تَوَّابٌ‌ رَحِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O you who believe, avoid most suspicions: Some suspicions are indeed sins. So do not pry into others' secrets and do not backbite. Would any of you like to eat a dead brother's flesh? You would surely be revolted by it Then fear God. He is certainly forgiving and kind."
          ],
          "en.ahmedraza": [
            "O People who Believe! Avoid excessive assumptions; indeed assumption sometimes becomes a sin, and do not seek faults, and do not slander one another; would any one among you like to eat the flesh of his dead brother? So you will hate that! And fear Allah; indeed Allah is Most Acceptor of Repentance, Most Merciful."
          ],
          "en.arberry": [
            "O believers, eschew much suspicion; some suspicion is a sin. And do not spy, neither backbite one another; would any of you like to eat the flesh of his brother dead? You would abominate it. And fear you God; assuredly God turns, and He is All-compassionate."
          ],
          "en.daryabadi": [
            "O ye who believe! avoid much suspicion; verily some suspicion is a sin. And espy not, nor backbite one another: would any of you love to eat the flesh of his dead brother? Ye detest that. And fear Allah verily Allah is Relenting, Merciful."
          ],
          "en.hilali": [
            "O you who believe! Avoid much suspicions, indeed some suspicions are sins. And spy not, neither backbite one another. Would one of you like to eat the flesh of his dead brother? You would hate it (so hate backbiting). And fear Allah. Verily, Allah is the One Who accepts repentance, Most Merciful."
          ],
          "en.itani": [
            "O you who believe! Avoid most suspicion—some suspicion is sinful. And do not spy on one another, nor backbite one another. Would any of you like to eat the flesh of his dead brother? You would detest it. So remain mindful of God. God is Most Relenting, Most Merciful."
          ],
          "en.maududi": [
            "Believers, avoid being excessively suspicious, for some suspicion is a sin. Do not spy, nor backbite one another. Would any of you like to eat the flesh of his dead brother? You would surely detest it. Have fear of Allah. Surely Allah is much prone to accept repentance, is Most Compassionate."
          ],
          "en.mubarakpuri": [
            "O you who believe! Avoid much suspicion; indeed some suspicion is sin. And spy not, neither backbite one another. Would one of you like to eat the flesh of his dead brother You would hate it. And have Taqwa of Allah. Verily, Allah is the One Who forgives and accepts repentance, Most Merciful."
          ],
          "en.pickthall": [
            "O ye who believe! Shun much suspicion; for lo! some suspicion is a crime. And spy not, neither backbite one another. Would one of you love to eat the flesh of his dead brother? Ye abhor that (so abhor the other)! And keep your duty (to Allah). Lo! Allah is Relenting, Merciful."
          ],
          "en.qarai": [
            "O you who have faith! Avoid much suspicion; indeed some suspicions are sins. And do not spy on one another or backbite. Will any of you love to eat the flesh of his dead brother? You would hate it. Be wary of Allah; indeed Allah is all-clement, all-merciful."
          ],
          "en.qaribullah": [
            "Believers, abstain from most suspicion, some suspicion is a sin. Neither spy nor backbite one another would any of you like to eat the flesh of his deadbrother? Surely, you would loathe it. Fear Allah, without doubt Allah turns (in mercy) and He is the Merciful."
          ],
          "en.sahih": [
            "O you who have believed, avoid much [negative] assumption. Indeed, some assumption is sin. And do not spy or backbite each other. Would one of you like to eat the flesh of his brother when dead? You would detest it. And fear Allah; indeed, Allah is Accepting of repentance and Merciful."
          ],
          "en.sarwar": [
            "Believers, stay away from conjecture; acting upon some conjecture may lead to sin. Do not spy on one another or back-bite. Would any of you like to eat the disgusting dead flesh of your brother? Have fear of God; God accepts repentance and is All-merciful."
          ],
          "en.shakir": [
            "O you who believe! avoid most of suspicion, for surely suspicion in some cases is a sin, and do not spy nor let some of you backbite others. Does one of you like to eat the flesh of his dead brother? But you abhor it; and be careful of (your duty to) Allah, surely Allah is Oft-returning (to mercy), Merciful."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo ijtaniboo katheeran mina a<b>l</b><i><u>thth</u></i>anni inna baAA<u>d</u>a a<b>l</b><i><u>thth</u></i>anni ithmun wal<u>a</u> tajassasoo wal<u>a</u> yaghtab baAA<u>d</u>ukum baAA<u>d</u>an ayu<u>h</u>ibbu a<u>h</u>adukum an yakula la<u>h</u>ma akheehi maytan fakarihtumoohu wa<b>i</b>ttaqoo All<u>a</u>ha inna All<u>a</u>ha taww<u>a</u>bun ra<u>h</u>eem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Believers, avoid much suspicion. Indeed some suspicion is a sin. And do not spy on one another and do not backbite. Would any of you like to eat his dead brother's flesh? No, you would hate it. Fear God, God is ever forgiving and most merciful."
          ],
          "en.yusufali": [
            "O ye who believe! Avoid suspicion as much (as possible): for suspicion in some cases is a sin: And spy not on each other behind their backs. Would any of you like to eat the flesh of his dead brother? Nay, ye would abhor it... But fear Allah: For Allah is Oft-Returning, Most Merciful."
          ],
          "fa.ansarian": [
            "ای اهل ایمان! از بسیاری از گمان ها [در حقّ مردم] بپرهیزید؛ زیرا برخی از گمان ها گناه است، و [در اموری که مردم پنهان ماندنش را خواهانند] تفحص و پی جویی نکنید، و از یکدیگر غیبت ننمایید، آیا یکی از شما دوست دارد که گوشت برادر مرده اش را بخورد؟ بی تردید [از این کار] نفرت دارید، و از خدا پروا کنید که خدا بسیار توبه پذیر و مهربان است."
          ],
          "fa.ayati": [
            "اى كسانى كه ايمان آورده‌ايد، از گمان فراوان بپرهيزيد. زيرا پاره‌اى از گمانها در حد گناه است. و در كارهاى پنهانى يكديگر جست و جو مكنيد. و از يكديگر غيبت مكنيد. آيا هيچ يك از شما دوست دارد كه گوشت برادر مرده خود را بخورد؟ پس آن را ناخوش خواهيد داشت. و از خدا بترسيد، زيرا خدا توبه‌پذير و مهربان است."
          ],
          "fa.bahrampour": [
            "اى كسانى كه ايمان آورده‌ايد! از بسيارى گمان‌ها بپرهيزيد، چرا كه پاره‌اى از گمان‌ها گناه است، و [در كار ديگران‌] تجسّس نكنيد و كسى از شما غيبت ديگرى نكند آيا كسى از شما دوست دارد گوشت برادر مرده‌اش را بخورد؟ [بى‌شك همه شما] از آن كراهت داريد، [غيبت ني"
          ],
          "fa.fooladvand": [
            "اى كسانى كه ايمان آورده‌ايد، از بسيارى از گمانها بپرهيزيد كه پاره‌اى از گمانها گناه است، و جاسوسى مكنيد، و بعضى از شما غيبت بعضى نكند؛ آيا كسى از شما دوست دارد كه گوشت برادر مرده‌اش را بخورد؟ از آن كراهت داريد. [پس‌] از خدا بترسيد، كه خدا توبه‌پذير مهربان است."
          ],
          "fa.ghomshei": [
            "ای اهل ایمان، از بسیار پندارها در حق یکدیگر اجتناب کنید که برخی ظنّ و پندارها معصیت است و نیز هرگز (از حال درونی هم) تجسس مکنید و غیبت یکدیگر روا مدارید، هیچ یک از شما آیا دوست می‌دارد که گوشت برادر مرده خود را خورد؟ البته کراهت و نفرت از آن دارید (پس بدانید که مثل غیبت مؤمن به حقیقت همین است) و از خدا پروا کنید، که خدا بسیار توبه پذیر و مهربان است."
          ],
          "fa.khorramdel": [
            "ای کسانی که ایمان آورده‌اید! از بسیاری از گمانها بپرهیزید، که برخی از گمانها گناه است، و جاسوسی و پرده‌دری نکنید، و یکی از دیگری غیبت ننماید؛ آیا هیچ یک از شما دوست دارد که گوشت برادر مرده‌ی خود را بخورد؟ به یقین همه‌ی شما از مرده‌خواری بدتان می‌آید (و از آن بیزارید، غیبت نیز چنین است و از آن بپرهیزید و) از خدا پروا کنید، بی‌گمان خداوند بس توبه‌پذیر و مهربان است. [[«کَثِیراً»: مفعول‌به است. «مِنَ الظَّنِّ»: صفت (کَثیراً) است. «لا تَجَسَّسُوا»: عیبجوئی نکنید. در پی کشف اسرار و معایب مردم نباشید. «مَیْتاً»: حال (لَحْم) یا (أَخ) است. «لا یَغْتَبْ ... مَیْتاً»: غیبت پرده‌دری است و مرده‌خواری و لاشه‌دری. «فَکَرِهْتُمُوهُ»: جواب شرط (إِنْ) شرطیه است که هم خودش و هم (قَدْ) و هم فعل آن محذوف است. تقدیر چنین است: إِنْ عَرَضَ ذلِکَ فَقَدْ کَرِهْتُمُوهُ.]]"
          ],
          "fa.khorramshahi": [
            "ای مؤمنان از بسیاری از گمانها پرهیز کنید، چرا که بعضی از گمانها گناه است، و [در کار دیگران‌] تجسس مکنید، و بعضی از شما از بعضی دیگر غیبت نکند، آیا هیچ کدام از شما خوش دارد که گوشت برادر مرده‌اش را بخورد، که از آن تنفر دارید، و از خداوند پروا کنید که بی‌گمان خداوند توبه‌پذیر مهربان است‌"
          ],
          "fa.makarem": [
            "ای کسانی که ایمان آورده‌اید! از بسیاری از گمانها بپرهیزید، چرا که بعضی از گمانها گناه است؛ و هرگز (در کار دیگران) تجسّس نکنید؛ و هیچ یک از شما دیگری را غیبت نکند، آیا کسی از شما دوست دارد که گوشت برادر مرده خود را بخورد؟! (به یقین) همه شما از این امر کراهت دارید؛ تقوای الهی پیشه کنید که خداوند توبه‌پذیر و مهربان است!"
          ],
          "fa.moezzi": [
            "ای آنان که ایمان آوردید دوری گزینید از بسی گمانها چه پاره‌ای از گمانها گناه است و کاوش در کار مردم نکنید و زشت نستایند پشت سر برخی از شما برخی آیا دوست دارد یکی از شما که خورد گوشت برادر خویش را مرده همانا ناخوش داشتیدش و بترسید خدا را که خدا است فزون توبه پذیرنده مهربان‌"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه ايمان آورده‌ايد، از بسيارى از گمانها- گمانهاى بد- دور باشيد، زيرا برخى از گمانها گناه است. و [در احوال و عيب‌هاى پنهان مردم‌] كاوش مكنيد، و از پس يكديگر بدگويى- غيبت- مكنيد. آيا يكى از شما دوست دارد كه گوشت برادر مرده خود را بخورد؟ بى‌گمان آن را ناخوش و ناپسند مى‌داريد. و از خداى پروا كنيد، كه خدا توبه‌پذير و مهربان است."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که ایمان آوردید! از بسیاری گمان‌ها بپرهیزید که پاره‌ای از گمان‌ها بدفرجام است. و تجسس مکنید (و) بعضی از شما از بعضی دیگر غیبت نکند. آیا کسی از شما دوست دارد که گوشت برادر (مؤمن) مرده‌اش را بخورد؟ پس از آن بسی بدتان می‌آید و خدای را پروا بدارید. خدا بی‌گمان بسی برگشت‌‌کننده‌ی رحمتگر بر ویژگان است."
          ]
        }
      },
      {
        "index": 4625,
        "local_index": 13,
        "part_type": "Verse",
        "path": "/books/quran:49:13",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:39:10"
          ]
        },
        "text": [
          "يَا أَيُّهَا النَّاسُ‌ إِنَّا خَلَقْنَاکُمْ‌ مِنْ‌ ذَکَرٍ وَ أُنْثَى‌ وَ جَعَلْنَاکُمْ‌ شُعُوباً وَ قَبَائِلَ‌ لِتَعَارَفُوا إِنَ‌ أَکْرَمَکُمْ‌ عِنْدَ اللَّهِ‌ أَتْقَاکُمْ‌ إِنَ‌ اللَّهَ‌ عَلِيمٌ‌ خَبِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "O men, We created you from a male and female, and formed you into nations and tribes that you may recognise each other. He who has more integrity has indeed greater honour with God. Surely God is all-knowing and well-informed."
          ],
          "en.ahmedraza": [
            "O mankind! We have indeed created you from one man and one woman, and have made you into various nations and tribes so that you may know one another; indeed the more honourable among you, in the sight of Allah, is one who is more pious among you; indeed Allah is All Knowing, All Aware. (Piety is the basis of honour in Allah’s sight.)"
          ],
          "en.arberry": [
            "O mankind, We have created you male and female, and appointed you races and tribes, that you may know one another. Surely the noblest among you in the sight of God is the most godfearing of you. God is All-knowing, All-aware."
          ],
          "en.daryabadi": [
            "O Humankind verily We! We have created you Of a male and female, and We have made you nations and tribes that ye might know one another. Verily the noblest of you with Allah is the most God-fearing of you; verily Allah is Knowing, Aware,"
          ],
          "en.hilali": [
            "O mankind! We have created you from a male and a female, and made you into nations and tribes, that you may know one another. Verily, the most honourable of you with Allah is that (believer) who has At-Taqwa [i.e. one of the Muttaqun (pious - see V. 2:2). Verily, Allah is All-Knowing, All-Aware."
          ],
          "en.itani": [
            "O people! We created you from a male and a female, and made you races and tribes, that you may know one another. The best among you in the sight of God is the most righteous. God is All-Knowing, Well-Experienced."
          ],
          "en.maududi": [
            "Human beings, We created you all from a male and a female, and made you into nations and tribes so that you may know one another. Verily the noblest of you in the sight of Allah is the most God-fearing of you. Surely Allah is All-Knowing, All-Aware."
          ],
          "en.mubarakpuri": [
            "O mankind! We have created you from a male and a female, and made you into nations and tribes that you may know one another. Verily, the most honorable of you with Allah is that (believer) who has At-Taqwa. Verily, Allah is All-Knowing, All-Aware."
          ],
          "en.pickthall": [
            "O mankind! Lo! We have created you male and female, and have made you nations and tribes that ye may know one another. Lo! the noblest of you, in the sight of Allah, is the best in conduct. Lo! Allah is Knower, Aware."
          ],
          "en.qarai": [
            "O mankind! Indeed, We created you from a male and a female, and made you nations and tribes that you may identify yourselves with one another. Indeed the noblest of you in the sight of Allah is the most Godwary among you. Indeed Allah is all-knowing, all-aware."
          ],
          "en.qaribullah": [
            "People, We have created you from a male and a female, and made you into nations and tribes that you might know one another. The noblest of you before Allah is the most righteous of you. Allah is the Knower, the Aware."
          ],
          "en.sahih": [
            "O mankind, indeed We have created you from male and female and made you peoples and tribes that you may know one another. Indeed, the most noble of you in the sight of Allah is the most righteous of you. Indeed, Allah is Knowing and Acquainted."
          ],
          "en.sarwar": [
            "People, We have created you all male and female and have made you nations and tribes so that you would recognize each other. The most honorable among you in the sight of God is the most pious of you. God is All-knowing and All-aware."
          ],
          "en.shakir": [
            "O you men! surely We have created you of a male and a female, and made you tribes and families that you may know each other; surely the most honorable of you with Allah is the one among you most careful (of his duty); surely Allah is Knowing, Aware."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> a<b>l</b>nn<u>a</u>su inn<u>a</u> khalaqn<u>a</u>kum min <u>th</u>akarin waonth<u>a</u> wajaAAaln<u>a</u>kum shuAAooban waqab<u>a</u>ila litaAA<u>a</u>rafoo inna akramakum AAinda All<u>a</u>hi atq<u>a</u>kum inna All<u>a</u>ha AAaleemun khabeer<b>un</b>"
          ],
          "en.wahiduddin": [
            "Mankind! We have created you from a male and female, and made you into peoples and tribes, so that you might come to know each other. The noblest of you in God's sight is the one who fears God most. God is all knowing and all-aware."
          ],
          "en.yusufali": [
            "O mankind! We created you from a single (pair) of a male and a female, and made you into nations and tribes, that ye may know each other (not that ye may despise (each other). Verily the most honoured of you in the sight of Allah is (he who is) the most righteous of you. And Allah has full knowledge and is well acquainted (with all things)."
          ],
          "fa.ansarian": [
            "ای مردم! ما شما را از یک مرد و زن آفریدیم و ملت ها و قبیله ها قرار دادیم تا یکدیگر را بشناسید. بی تردید گرامی ترین شما نزد خدا پرهیزکارترین شماست. یقیناً خدا دانا و آگاه است."
          ],
          "fa.ayati": [
            "اى مردم، ما شما را از نرى و ماده‌اى بيافريديم. و شما را جماعتها و قبيله‌ها كرديم تا يكديگر را بشناسيد. هر آينه گرامى‌ترين شما نزد خدا، پرهيزگارترين شماست. خدا دانا و كاردان است."
          ],
          "fa.bahrampour": [
            "اى مردم! ما شما را از يك مرد و زن آفريديم، و شما را تيره‌ها و قبيله‌ها قرار داديم تا يكديگر را بشناسيد [و اينها ملاك امتياز نيست‌]، قطعا ارجمندترين شما نزد خدا پرهيزگارترين شماست. بى‌ترديد خداوند داناى آگاه است"
          ],
          "fa.fooladvand": [
            "اى مردم، ما شما را از مرد و زنى آفريديم، و شما را ملّت ملّت و قبيله قبيله گردانيديم تا با يكديگر شناسايى متقابل حاصل كنيد. در حقيقت ارجمندترين شما نزد خدا پرهيزگارترين شماست. بى‌ترديد، خداوند داناى آگاه است."
          ],
          "fa.ghomshei": [
            "ای مردم، ما همه شما را نخست از مرد و زنی آفریدیم و آن گاه شعبه‌های بسیار و فرق مختلف گردانیدیم تا یکدیگر را بشناسید، همانا بزرگوار و با افتخارترین شما نزد خدا با تقواترین شمایند، همانا خدا کاملا دانا و آگاه است."
          ],
          "fa.khorramdel": [
            "ای مردمان! ما شما را از مرد و زنی (به نام آدم و حوّاء) آفریده‌ایم، و شما را تیره تیره و قبیله قبیله نموده‌ایم تا همدیگر را بشناسید (و هر کسی با تفاوت و ویژگی خاص درونی و بیرونی از دیگری مشخّص شود، و در پیکره‌ی جامعه انسانی نقشی جداگانه داشته باشد). بی‌گمان گرامی‌ترین شما در نزد خدا متّقی‌ترین شما است. خداوند مسلّماً آگاه و باخبر (از پندار و کردار و گفتار شما، و از حال همه‌کس و همه چیز) است. [[«ذَکَرٍ وَ أُنثَی»: یک نر و یک ماده. مراد آدم و حواء است. «شُعُوباً»: جمع شَعْب، تیره‌ها و ملتها. جمع عظیمی از مردم که دارای اصل واحدی بوده و قبیله‌ها از آن منشعب می‌گردد. «لِتَعَارَفُوا»: تا یکدیگر را بشناسید و از هم جدا کنید. اشاره به این است که تفاوتهای بیرونی و درونی انسانها سبب شناسائی آنان است و اگر همه یکسان و شبیه همدیگر باشند، زندگی اجتماعی مردمان مختل و ناممکن می‌گردد.]]"
          ],
          "fa.khorramshahi": [
            "هان ای مردم همانا ما شما را از یک مرد و یک زن آفریده‌ایم و شما را به هیئت اقوام و قبایلی در آورده‌ایم تا با یکدیگر انس و آشنایی یابید، بی‌گمان گرامی‌ترین شما در نزد خداوند پرهیزگارترین شماست، که خداوند دانای آگاه است‌"
          ],
          "fa.makarem": [
            "ای مردم! ما شما را از یک مرد و زن آفریدیم و شما را تیره‌ها و قبیله‌ها قرار دادیم تا یکدیگر را بشناسید؛ (اینها ملاک امتیاز نیست،) گرامی‌ترین شما نزد خداوند با تقواترین شماست؛ خداوند دانا و آگاه است!"
          ],
          "fa.moezzi": [
            "ای مردم همانا ما آفریدیمتان از نری و ماده و گردانیدیم شما را شاخه‌هائی و تیره‌هائی تا شناسا شوید همانا گرامیترین شما نزد خدا پرهیزکارترین شما است همانا خدا است دانای آگاه‌"
          ],
          "fa.mojtabavi": [
            "اى مردم، ما شما را از يك مرد و زن بيافريديم، و شما را شاخه‌ها و تيره‌ها كرديم تا يكديگر را باز شناسيد. هر آينه گرامى‌ترين شما نزد خدا پرهيزگارترين شماست. همانا خدا دانا و آگاه است."
          ],
          "fa.sadeqi": [
            "هان ای مردمان! ما شما را به‌راستی از مرد و زنی آفریدیم و شما را ملّت‌هایی و قبیله‌هایی گردانیدیم تا یکدیگر را (متقابل) شناسایی کنید. همواره ارجمندترین شما نزد خدا پرهیزگارترین شماست. همانا به‌راستی خدا بسیار دانای بس آگاه است."
          ]
        }
      },
      {
        "index": 4626,
        "local_index": 14,
        "part_type": "Verse",
        "path": "/books/quran:49:14",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:2:1:14:5",
            "/books/al-kafi:2:1:15:5",
            "/books/al-kafi:2:1:14:3"
          ]
        },
        "text": [
          "قَالَتِ‌ الْأَعْرَابُ‌ آمَنَّا قُلْ‌ لَمْ‌ تُؤْمِنُوا وَ لٰکِنْ‌ قُولُوا أَسْلَمْنَا وَ لَمَّا يَدْخُلِ‌ الْإِيمَانُ‌ فِي‌ قُلُوبِکُمْ‌ وَ إِنْ‌ تُطِيعُوا اللَّهَ‌ وَ رَسُولَهُ‌ لاَ يَلِتْکُمْ‌ مِنْ‌ أَعْمَالِکُمْ‌ شَيْئاً إِنَ‌ اللَّهَ‌ غَفُورٌ رَحِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "The Arabs of the desert say: \"We believe.\" Tell them: \"You do not believe. Better say: 'We submit'; for belief has not yet penetrated your hearts.\" If you begin to obey God and His Apostle, He will not withhold the least (of the recompense) of your labour. Verily God is forgiving and kind.\""
          ],
          "en.ahmedraza": [
            "The ignorant said, “We have accepted faith”; say, (O dear Prophet Mohammed – peace and blessings be upon him), “You have surely not accepted faith, but you should say ‘We have submitted’, for faith has not yet entered your hearts; and if you obey* Allah and His Noble Messenger, He will not reduce the reward of any of your deeds; indeed Allah is Oft Forgiving, Most Merciful.” (* By accepting faith and then obeying the commands)."
          ],
          "en.arberry": [
            "The Bedouins say, 'We believe.' Say: 'You do not believe; rather say, \"We surrender\"; for belief has not yet entered your hearts. If you obey God and His Messenger, He will not diminish you anything of your works. God is All-forgiving, All-compassionate.'"
          ],
          "en.daryabadi": [
            "The desert Arabs say: we have believed. Say thou: believe not, but rather say: We have submitted; and belief hath not yet entered into your hearts. And if ye obey Allah and His apostle, He shall not diminish from you aught Of you, wOrks verily Allah is Forgiving, Merciful."
          ],
          "en.hilali": [
            "The bedouins say: \"We believe.\" Say: \"You believe not but you only say, 'We have surrendered (in Islam),' for Faith has not yet entered your hearts. But if you obey Allah and His Messenger (SAW), He will not decrease anything in reward for your deeds. Verily, Allah is Oft-Forgiving, Most Merciful.\""
          ],
          "en.itani": [
            "The Desert-Arabs say, “We have believed.” Say, “You have not believed; but say, ‘We have submitted,’ for faith has not yet entered into your hearts. But if you obey God and His Messenger, He will not diminish any of your deeds. God is Forgiving and Merciful.”"
          ],
          "en.maududi": [
            "The Bedouins say: “We believe.” (O Prophet), say to them: “You do not believe; you should rather say: 'We have submitted'”; for belief has not yet entered your hearts. If you obey Allah and His Messenger, He will not diminish anything from the reward of any of your deeds. Surely Allah is Most Forgiving, Most Compassionate."
          ],
          "en.mubarakpuri": [
            "The bedouins say: \"We believe.\" Say: \"You do not believe. But say, `We have submitted,' for Faith has not yet entered your hearts. But if you obey Allah and His Messenger, He will not decrease anything in reward for your deeds. Verily, Allah is Forgiving, Most Merciful.\""
          ],
          "en.pickthall": [
            "The wandering Arabs say: We believe. Say (unto them, O Muhammad): Ye believe not, but rather say \"We submit,\" for the faith hath not yet entered into your hearts. Yet, if ye obey Allah and His messenger, He will not withhold from you aught of (the reward of) your deeds. Lo! Allah is Forgiving, Merciful."
          ],
          "en.qarai": [
            "The Bedouins say, ‘We have faith.’ Say, ‘You do not have faith yet; rather, say, ‘‘We have embraced Islam,’’ for faith has not yet entered into your hearts. Yet if you obey Allah and His Apostle, He will not stint anything of [the reward of] your works. Indeed Allah is all-forgiving, all-merciful.’"
          ],
          "en.qaribullah": [
            "The Arabs declare: 'We believe' Say: 'You do not', rather, say: 'we submit' because belief has not yet found its way into your hearts. If you obey Allah and His Messenger, He will not reduce a thing from of your deeds. Allah is the Forgiving and the Most Merciful."
          ],
          "en.sahih": [
            "The bedouins say, \"We have believed.\" Say, \"You have not [yet] believed; but say [instead], 'We have submitted,' for faith has not yet entered your hearts. And if you obey Allah and His Messenger, He will not deprive you from your deeds of anything. Indeed, Allah is Forgiving and Merciful.\""
          ],
          "en.sarwar": [
            "The bedouin Arabs have said, \"We are believers.\" Tell them, \"You are not believers, but you should say that you are Muslims. In fact, belief has not yet entered your hearts. If you obey God and His Messenger, nothing will be reduced from your deeds. God is All-forgiving and All-merciful."
          ],
          "en.shakir": [
            "The dwellers of the desert say: We believe. Say: You do not believe but say, We submit; and faith has not yet entered into your hearts; and if you obey Allah and His Apostle, He will not diminish aught of your deeds; surely Allah is Forgiving, Merciful."
          ],
          "en.transliteration": [
            "Q<u>a</u>lati alaAAr<u>a</u>bu <u>a</u>mann<u>a</u> qul lam tuminoo wal<u>a</u>kin qooloo aslamn<u>a</u> walamm<u>a</u> yadkhuli aleem<u>a</u>nu fee quloobikum wain tu<u>t</u>eeAAoo All<u>a</u>ha warasoolahu l<u>a</u> yalitkum min aAAm<u>a</u>likum shayan inna All<u>a</u>ha ghafoorun ra<u>h</u>eem<b>un</b>"
          ],
          "en.wahiduddin": [
            "The Arabs of the desert say, \"We have believed.\" Say to them, \"You have not believed yet; say rather, \"We have submitted,\" for faith has not yet entered into your hearts. But if you will obey God and His Messenger, He will not detract anything from your good deeds. God is most forgiving and ever merciful.\""
          ],
          "en.yusufali": [
            "The desert Arabs say, \"We believe.\" Say, \"Ye have no faith; but ye (only) say, 'We have submitted our wills to Allah,' For not yet has Faith entered your hearts. But if ye obey Allah and His Messenger, He will not belittle aught of your deeds: for Allah is Oft-Forgiving, Most Merciful.\""
          ],
          "fa.ansarian": [
            "بادیه نشینان گفتند: ما [از عمق قلب] ایمان آوردیم. بگو: ایمان نیاورده اید، بلکه بگویید: اسلام آورده ایم؛ زیرا هنوز ایمان در دل هایتان وارد نشده است. و اگر خدا و پیامبرش را اطاعت کنید، چیزی از اعمالتان را نمی کاهد؛ زیرا خدا بسیار آمرزنده و مهربان است."
          ],
          "fa.ayati": [
            "اعراب باديه‌نشين گفتند: ايمان آورديم. بگو: ايمان نياورده‌ايد، بگوييد كه تسليم شده‌ايم، و هنوز ايمان در دلهايتان داخل نشده است. و اگر خدا و پيامبرش را اطاعت كنيد از ثواب اعمال شما كاسته نمى‌شود، زيرا خدا آمرزنده و مهربان است."
          ],
          "fa.bahrampour": [
            "باديه‌نشينان گفتند: ايمان آورديم. بگو: ايمان نياورده‌ايد، ولى [بهتر است‌] بگوييد: اسلام آورده‌ايم، و ايمان هنوز به دل‌هاى شما راه نيافته است، و اگر خدا و پيامبر او را فرمان ببريد، چيزى از [پاداش‌] كارهاى شما را نمى‌كاهد. همانا خدا آمرزنده‌ى مهربان اس"
          ],
          "fa.fooladvand": [
            "[برخى از] باديه‌نشينان گفتند: «ايمان آورديم.» بگو: «ايمان نياورده‌ايد، ليكن بگوييد: اسلام آورديم. و هنوز در دلهاى شما ايمان داخل نشده است. و اگر خدا و پيامبر او را فرمان بريد از [ارزش‌] كرده‌هايتان چيزى كم نمى‌كند. خدا آمرزنده مهربان است.»"
          ],
          "fa.ghomshei": [
            "اعراب (بر تو منّت گذارده و) گفتند: ما (بی جنگ و نزاع) ایمان آوردیم، بگو: شما که ایمانتان (از زبان) به قلب وارد نشده به حقیقت هنوز ایمان نیاورده‌اید لیکن بگویید ما اسلام آوردیم (و از خوف جان به ناچار تسلیم شدیم)، و اگر خدا و رسول وی را اطاعت کنید او از (اجر) اعمال شما هیچ نخواهد کاست (و از گناه گذشته می‌گذرد) که خدا بسیار آمرزنده و مهربان است."
          ],
          "fa.khorramdel": [
            "عربهای بادیه‌نشین می‌گویند: ایمان آورده‌ایم. بگو: شما ایمان نیاورده‌اید، بلکه بگوئید: تسلیم (ظاهری رسالت تو) شده‌ایم. چرا که ایمان هنوز به دلهایتان راه نیافته است (و نور ایمان سراچه‌ی قلوبتان را روشن نکرده است). اگر از خدا و پیغمبرش فرمانبرداری کنید، خدا از (پاداش) کارهایتان چیزی نمی‌کاهد. بی‌گمان خداوند آمرزگار و مهربان است. [[«الأعْرَابُ»: عربهای بادیه‌نشین (نگا: توبه / 90). «أَسْلَمْنَا»: مسلمان شده‌ایم. ظاهراً منقاد و تسلیم رسالت تو شده‌ایم. «لا یَلِتْکُمْ»: از شما نمی‌کاهیم. کم به شما نمی‌دهیم. از (لاتَ، یَلیتُ) است. مهموزالفاء این فعل نیز به همین معنی است (نگا: طور / 21).]]"
          ],
          "fa.khorramshahi": [
            "اعرابیان گفتند ایمان آورده‌ایم بگو هنوز ایمان [حقیقی‌] نیاورده‌اید، بهتر است بگویید اسلام آورده‌ایم چرا که هنوز ایمان به [ژرفنای‌] دلهایتان راه نیافته است، و اگر از خداوند و پیامبر او اطاعت کنید، چیزی از [پاداش‌] اعمال شما نمی‌کاهد، بی‌گمان خداوند آمرزگار مهربان است‌"
          ],
          "fa.makarem": [
            "عربهای بادیه‌نشین گفتند: «ایمان آورده‌ایم» بگو: «شما ایمان نیاورده‌اید، ولی بگویید اسلام آورده‌ایم، امّا هنوز ایمان وارد قلب شما نشده است! و اگر از خدا و رسولش اطاعت کنید، چیزی از پاداش کارهای شما را فروگذار نمی‌کند، خداوند، آمرزنده مهربان است.»"
          ],
          "fa.moezzi": [
            "گفتند دشت‌نشینان ایمان آوردیم بگو ایمان نیاوردید و لیکن گوئید اسلام آوردیم و هنوز درنیامد (درون نشد) ایمان به دلهای شما و اگر فرمان برید خدا و پیمبرش را نکاهد شما را از کارهای شما چیزی همانا خدا است آمرزنده مهربان‌"
          ],
          "fa.mojtabavi": [
            "باديه‌نشينان گفتند: ايمان آورديم. بگو: ايمان نياورده‌ايد، بلكه بگوييد: اسلام آورديم- به زبان تسليم شديم-، و هنوز ايمان در دلهاتان درنيامده است. و اگر خدا و پيامبرش را فرمان بريد، از [پاداش‌] كردارهاى شما جيزى نكاهد، همانا خدا آمرزگار و مهربان است."
          ],
          "fa.sadeqi": [
            "بادیه‌نشینان گفتند: «ایمان آوردیم‌.» بگو: «ایمان نیاوردید. لیکن بگویید اسلام آوردیم.‌» و هنوز در دل‌هایتان ایمان داخل نشده است و اگر خدا و پیامبر او را فرمان برید، او از (ارزش) کرده‌هایتان چیزی کم نمی‌کند. همواره خدا بسی پوشنده‌ی رحمتگر بر ویژگان است."
          ]
        }
      },
      {
        "index": 4627,
        "local_index": 15,
        "part_type": "Verse",
        "path": "/books/quran:49:15",
        "text": [
          "إِنَّمَا الْمُؤْمِنُونَ‌ الَّذِينَ‌ آمَنُوا بِاللَّهِ‌ وَ رَسُولِهِ‌ ثُمَ‌ لَمْ‌ يَرْتَابُوا وَ جَاهَدُوا بِأَمْوَالِهِمْ‌ وَ أَنْفُسِهِمْ‌ فِي‌ سَبِيلِ‌ اللَّهِ‌ أُولٰئِکَ‌ هُمُ‌ الصَّادِقُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They alone are believers who come to believe in God and His Apostle, then never doubt again, and struggle wealth and soul in the way of God. They are the truthful and sincere."
          ],
          "en.ahmedraza": [
            "The true believers are only those who accepted faith in Allah and His Noble Messenger and then did not have any doubt, and fought with their wealth and their lives in Allah’s way; it is they who are the truthful."
          ],
          "en.arberry": [
            "The believers are those who believe in God and His Messenger, then have not doubted, and have struggled with their possessions and their selves in the way of God; those -- they are the truthful ones."
          ],
          "en.daryabadi": [
            "The believers are only those who believed in Allah and His apostle and thereafter doubted not, and strave with their riches and their persons in the cause of Allah. Those! they are the truthful."
          ],
          "en.hilali": [
            "Only those are the believers who have believed in Allah and His Messenger, and afterward doubt not but strive with their wealth and their lives for the Cause of Allah. Those! They are the truthful."
          ],
          "en.itani": [
            "The believers are those who believe in God and His Messenger, and then have not doubted, and strive for God’s cause with their wealth and their persons. These are the sincere."
          ],
          "en.maududi": [
            "Indeed the ones possessed of true faith are those who believed in Allah and His Messenger and then they did not entertain any doubt and strove hard in the Way of Allah with their lives and their possessions. These are the truthful ones."
          ],
          "en.mubarakpuri": [
            "Only those are the believers who have believed in Allah and His Messenger, and afterward doubt not but strive with their wealth and their lives for the cause of Allah. Those! They are the truthful."
          ],
          "en.pickthall": [
            "The (true) believers are those only who believe in Allah and His messenger and afterward doubt not, but strive with their wealth and their lives for the cause of Allah. Such are the sincere."
          ],
          "en.qarai": [
            "The faithful are only those who have attained faith in Allah and His Apostle and then have never doubted, and who wage jihad with their possessions and their persons in the way of Allah. It is they who are the truthful."
          ],
          "en.qaribullah": [
            "The believers are those who believe in Allah and His Messenger and have not doubted, and who struggled in His Way with their possessions and themselves. Such are those who are truthful."
          ],
          "en.sahih": [
            "The believers are only the ones who have believed in Allah and His Messenger and then doubt not but strive with their properties and their lives in the cause of Allah. It is those who are the truthful."
          ],
          "en.sarwar": [
            "The believers are those who believe in God and His Messenger, who do not change their belief into doubt and who strive hard for the cause of God with their property and persons. They are the truthful ones\"."
          ],
          "en.shakir": [
            "The believers are only those who believe in Allah and His Apostle then they doubt not and struggle hard with their wealth and their lives in the way of Allah; they are the truthful ones."
          ],
          "en.transliteration": [
            "Innam<u>a</u> almuminoona alla<u>th</u>eena <u>a</u>manoo bi<b>A</b>ll<u>a</u>hi warasoolihi thumma lam yart<u>a</u>boo waj<u>a</u>hadoo biamw<u>a</u>lihim waanfusihim fee sabeeli All<u>a</u>hi ol<u>a</u>ika humu a<b>l</b><u>ssa</u>diqoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "The believers are only those who have faith in God and His Messenger and then doubt not, but strive, hard with their wealth and their persons for the cause of God. Such are the truthful ones."
          ],
          "en.yusufali": [
            "Only those are Believers who have believed in Allah and His Messenger, and have never since doubted, but have striven with their belongings and their persons in the Cause of Allah: Such are the sincere ones."
          ],
          "fa.ansarian": [
            "مؤمنان فقط کسانی اند که به خدا و پیامبرش ایمان آورده اند، آن گاه [در حقّانیّت آنچه به آن ایمان آورده اند] شک ننموده و با اموال و جان هایشان در راه خدا جهاد کرده اند؛ اینان [در گفتار و کردار] اهل صدق و راستی اند."
          ],
          "fa.ayati": [
            "مؤمنان كسانى هستند كه به خدا و پيامبر او ايمان آورده‌اند و ديگر شك نكرده‌اند، و با مال و جان خويش در راه خدا جهاد كرده‌اند. اينان راستگويانند."
          ],
          "fa.bahrampour": [
            "مؤمنان [واقعى‌] تنها كسانى‌اند كه به خدا و رسول او ايمان آوردند و هيچ‌گاه شك ننمودند و با مال و جانشان در راه خدا جهاد كردند، تنها آنان صادقند"
          ],
          "fa.fooladvand": [
            "در حقيقت، مؤمنان كسانى‌اند كه به خدا و پيامبر او گرويده و [ديگر] شكّ نياورده و با مال و جانشان در راه خدا جهاد كرده‌اند؛ اينانند كه راستكردارند."
          ],
          "fa.ghomshei": [
            "منحصرا مؤمنان واقعی آن کسانند که به خدا و رسول او ایمان آوردند و بعدا هیچ گاه شک و ریبی به دل راه ندادند و در راه خدا به مال و جانشان جهاد کردند. اینان به حقیقت راستگو هستند."
          ],
          "fa.khorramdel": [
            "مؤمنان (واقعی) تنها کسانیند که به خدا و پیغمبرش ایمان آورده‌اند، سپس هرگز شکّ و تردیدی به خود راه نداده‌اند، و با مال و جان خویش در راه خدا به تلاش ایستاده‌اند و به جهاد برخاسته‌اند. آنان (بلی آنان، در ایمان خود) درست و راستگویند. [[«لَمْ یَرْتَابُوا»: شک و تردید ننموده‌اند. گمان و دودلی به دل راه نداده‌اند.]]"
          ],
          "fa.khorramshahi": [
            "همانا مؤمنان کسانی هستند که به خداوند و پیامبر او ایمان آورده‌اند، سپس شک و شبهه نیاورده‌اند، و در راه خدا به مال و جانشان جهاد کرده‌اند، اینانند که راستگویانند"
          ],
          "fa.makarem": [
            "مؤمنان واقعی تنها کسانی هستند که به خدا و رسولش ایمان آورده‌اند، سپس هرگز شکّ و تردیدی به خود راه نداده و با اموال و جانهای خود در راه خدا جهاد کرده‌اند؛ آنها راستگویانند."
          ],
          "fa.moezzi": [
            "جز این نیست که مؤمنان آنانند که ایمان آوردند به خدا و پیمبرش و سپس شکّ نیاوردند و کوشیدند (جهاد کردند) به خواسته‌ها و جانهای خویش در راه خدا آنانند راستگویان‌"
          ],
          "fa.mojtabavi": [
            "جز اين نيست كه مؤمنان كسانى‌اند كه به خدا و پيامبر او ايمان آورده‌اند و سپس شك نكرده‌اند، و با مالها و جانهاى خويش در راه خدا جهاد كرده‌اند. ايشانند راستگويان."
          ],
          "fa.sadeqi": [
            "مؤمنان، تنها کسانی‌اند که به خدا و پیامبرش گرویده، سپس شک نیاورده و با مال و جانشان در راه خدا جهاد کردند. ایشان، (هم)اینان راستانند."
          ]
        }
      },
      {
        "index": 4628,
        "local_index": 16,
        "part_type": "Verse",
        "path": "/books/quran:49:16",
        "text": [
          "قُلْ‌ أَ تُعَلِّمُونَ‌ اللَّهَ‌ بِدِينِکُمْ‌ وَ اللَّهُ‌ يَعْلَمُ‌ مَا فِي‌ السَّمَاوَاتِ‌ وَ مَا فِي‌ الْأَرْضِ‌ وَ اللَّهُ‌ بِکُلِ‌ شَيْ‌ءٍ عَلِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"Are you trying to convince God of your faithfulness? But God knows all there is in the heavens and the earth, for God has knowledge of everything.\""
          ],
          "en.ahmedraza": [
            "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Are you teaching Allah your own religion? Whereas Allah knows all whatever is in the heavens and all whatever is in the earth; and Allah knows all things.”"
          ],
          "en.arberry": [
            "Say: 'What, would you teach God what your religion is, and God knows what is in the heavens and what is in the earth? And God has knowledge of everything.'"
          ],
          "en.daryabadi": [
            "Say thou: Would ye appraise Allah of your religion, whereas Allah knoweth whatsoever is in the heavens and whatsoever is in the earth, and Allah is of everything Aware!"
          ],
          "en.hilali": [
            "Say: \"Will you inform Allah about your religion? While Allah knows all that is in the heavens and all that is in the earth, and Allah is All-Aware of everything."
          ],
          "en.itani": [
            "Say, “Are you going to teach God about your religion, when God knows everything in the heavens and the earth, and God is aware of all things?”"
          ],
          "en.maududi": [
            "Say, (O Prophet), (to these pretenders to faith): “Are you apprising Allah of your faith? Allah knows all that is in the heavens and the earth. Allah has full knowledge of everything.”"
          ],
          "en.mubarakpuri": [
            "Say: \"Will you inform Allah of your religion while Allah knows all that is in the heavens and all that is on the earth, and Allah is All-Aware of everything.\""
          ],
          "en.pickthall": [
            "Say (unto them, O Muhammad): Would ye teach Allah your religion, when Allah knoweth all that is in the heavens and all that is in the earth, and Allah is Aware of all things?"
          ],
          "en.qarai": [
            "Say, ‘Will you inform Allah about your faith while Allah knows whatever there is in the heavens and whatever there is in the earth, and Allah has knowledge of all things?’"
          ],
          "en.qaribullah": [
            "Say: 'Would you teach Allah what your religion is, when Allah knows all that is in the heavens and the earth' Allah has knowledge of all things."
          ],
          "en.sahih": [
            "Say, \"Would you acquaint Allah with your religion while Allah knows whatever is in the heavens and whatever is on the earth, and Allah is Knowing of all things?\""
          ],
          "en.sarwar": [
            "(Muhammad), say, \"Do you teach God about your religion? God knows whatever is in the heavens and the earth. He has the knowledge of all things\"."
          ],
          "en.shakir": [
            "Say: Do you apprise Allah of your religion, and Allah knows what is in the heavens and what is in the earth; and Allah is Cognizant of all things."
          ],
          "en.transliteration": [
            "Qul atuAAallimoona All<u>a</u>ha bideenikum wa<b>A</b>ll<u>a</u>hu yaAAlamu m<u>a</u> fee a<b>l</b>ssam<u>a</u>w<u>a</u>ti wam<u>a</u> fee alar<u>d</u>i wa<b>A</b>ll<u>a</u>hu bikulli shayin AAaleem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Say, \"Do you presume to teach God your religion when God knows everything in the heavens and earth? God has knowledge of all things.\""
          ],
          "en.yusufali": [
            "Say: \"What! Will ye instruct Allah about your religion? But Allah knows all that is in the heavens and on earth: He has full knowledge of all things."
          ],
          "fa.ansarian": [
            "بگو: آیا خدا را از دین خود [به خیال اینکه آگاه نیست] خبر می دهید [که از عمق قلب ایمان آورده اید؟!] در حالی که خدا آنچه را در آسمان ها و آنچه را در زمین است می داند، و خدا به همه چیز داناست."
          ],
          "fa.ayati": [
            "بگو: آيا مى‌خواهيد خدا را از ديندارى خويش آگاه كنيد؟ حال آنكه خدا از هر چه در آسمانها و هر چه در زمين است آگاه است و او به هر چيزى عالم است."
          ],
          "fa.bahrampour": [
            "بگو: آيا خدا را از ديندارى خود باخبر مى‌سازيد؟ در صورتى كه خدا آنچه در آسمان‌ها و آنچه در زمين است مى‌داند، و خدا از همه چيز آگاه است"
          ],
          "fa.fooladvand": [
            "بگو: «آيا خدا را از دين‌[دارى‌] خود خبر مى‌دهيد؟ و حال آنكه خدا آنچه را كه در زمين است مى‌داند، و خدا به همه چيز داناست."
          ],
          "fa.ghomshei": [
            "بگو: آیا شما می‌خواهید خدا را به دین خود آگاه سازید (که اظهار دیانت می‌کنید)؟ و حال آنکه خدا آنچه در آسمانها و زمین است همه را می‌داند و به کلّیّه امور عالم داناست."
          ],
          "fa.khorramdel": [
            "بگو: آیا شما خدا را از ایمان خود باخبر می‌سازید، در حالی که خدا از تمام چیزهائی که در آسمانها و زمین است باخبر است؟! و خدا از همه‌چیز دقیقاً آگاه است. [[«أَتُعَلِّمُونَ»: آیا یاد می‌دهید؟ «وَاللهُ یَعْلَمُ»: حرف واو حالیه است.]]"
          ],
          "fa.khorramshahi": [
            "بگو آیا دینتان را به خداوند می‌شناسانید؟ حال آنکه خداوند آنچه در آسمانهاست و آنچه در زمین است، می‌داند، و خداوند به همه چیز داناست‌"
          ],
          "fa.makarem": [
            "بگو: «آیا خدا را از ایمان خود با خبر می‌سازید؟! او تمام آنچه را در آسمانها و زمین است می‌داند؛ و خداوند از همه چیز آگاه است!»"
          ],
          "fa.moezzi": [
            "بگو آیا می‌آموزید به خدا دین خویش را و خدا داند آنچه در آسمانها و آنچه در زمین است و خدا است به همه چیز دانا"
          ],
          "fa.mojtabavi": [
            "بگو: آيا مى‌خواهيد خداى را به دين خودتان آگاه كنيد؟ و حال آنكه خدا آنچه را در آسمانها و آنچه را در زمين است مى‌داند، و خدا به همه چيز داناست."
          ],
          "fa.sadeqi": [
            "بگو: «آیا خدا را به دین خود آگاهی می‌دهید؟ و حال آنکه خدا آنچه را که در آسمان‌ها و در زمین است می‌داند. و خدا به هر چیزی بسیار داناست.»"
          ]
        }
      },
      {
        "index": 4629,
        "local_index": 17,
        "part_type": "Verse",
        "path": "/books/quran:49:17",
        "text": [
          "يَمُنُّونَ‌ عَلَيْکَ‌ أَنْ‌ أَسْلَمُوا قُلْ‌ لاَ تَمُنُّوا عَلَيَ‌ إِسْلاَمَکُمْ‌ بَلِ‌ اللَّهُ‌ يَمُنُ‌ عَلَيْکُمْ‌ أَنْ‌ هَدَاکُمْ‌ لِلْإِيمَانِ‌ إِنْ‌ کُنْتُمْ‌ صَادِقِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They impress upon you that they have submitted. Tell them: \"Do not favour me with your submission. In fact God has favoured you by showing you the way to belief, if you are men of truth.\""
          ],
          "en.ahmedraza": [
            "They portray that they are doing a great favour to you (O dear Prophet Mohammed – peace and blessings be upon him) by having become Muslims; say, “Do not think that you have done me a favour by accepting Islam; in fact Allah has bestowed a favour upon you, for He guided you to Islam, if you are truthful.”"
          ],
          "en.arberry": [
            "They count it as a favour to thee that they have surrendered! Say: 'Do not count your surrendering as a favour to me; nay, but rather God confers a favour upon you, in that He has guided you to belief, if it be that you are truthful."
          ],
          "en.daryabadi": [
            "They make it a favour Unto thee that they have surrendered. Say thou: deem not your surrender a favour Unto me; nay! Allah hath conferred a favour Unto you inasmuch as He hath guided you to belief, if ye are sincere."
          ],
          "en.hilali": [
            "They regard as favour upon you (O Muhammad SAW) that they have embraced Islam. Say: \"Count not your Islam as a favour upon me. Nay, but Allah has conferred a favour upon you, that He has guided you to the Faith, if you indeed are true."
          ],
          "en.itani": [
            "They regarded it a favor to you that they have submitted. Say, “Do not consider your submission a favor to me; it is God who has done you a favor by guiding you to the faith, if you are sincere.”"
          ],
          "en.maududi": [
            "They count it as a favour to you that they accepted Islam. Say: “Do not regard your (accepting) Islam as a favour to me; rather, Allah has bestowed a favour on you by guiding you to faith, if you are truthful (in your claim to be believers)."
          ],
          "en.mubarakpuri": [
            "They regard as a favor to you that they have embraced Islam. Say: \"Do not count your Islam as a favor to me. Nay, but Allah has conferred a favor upon you that He has guided you to the Faith if you indeed are true. \""
          ],
          "en.pickthall": [
            "They make it a favour unto thee (Muhammad) that they have surrendered (unto Him). Say: Deem not your Surrender a favour unto me; but Allah doth confer a favour on you, inasmuch as He hath led you to the Faith, if ye are earnest."
          ],
          "en.qarai": [
            "They count it as a favour to you that they have embraced Islam. Say, ‘Do not count your embracing of Islam as a favour to me. No, it is Allah who has done you a favour in that He has guided you to faith, if you are truthful [in your claim]."
          ],
          "en.qaribullah": [
            "They regard it as a favor to you that they have submitted! Say: 'Do not regard your submission as a favor to me, rather, it is Allah who bestows upon you a favor by guiding you to belief, if you are truthful'"
          ],
          "en.sahih": [
            "They consider it a favor to you that they have accepted Islam. Say, \"Do not consider your Islam a favor to me. Rather, Allah has conferred favor upon you that He has guided you to the faith, if you should be truthful.\""
          ],
          "en.sarwar": [
            "(The bedouins tell you that) you owe them (a great deal) for their embracing Islam. Tell them, \"You are not doing me any favors by embracing Islam. In fact, it is God who has done you a great favor by guiding you to the faith. (Think about this) if you are people of truth."
          ],
          "en.shakir": [
            "They think that they lay you under an obligation by becoming Muslims. Say: Lay me not under obligation by your Islam: rather Allah lays you under an obligation by guiding you to the faith if you are truthful."
          ],
          "en.transliteration": [
            "Yamunnoona AAalayka an aslamoo qul l<u>a</u> tamunnoo AAalayya isl<u>a</u>makum bali All<u>a</u>hu yamunnu AAalaykum an had<u>a</u>kum lileem<u>a</u>ni in kuntum <u>sa</u>diqeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "They think they have done you a favour by becoming Muslims! Say, \"Do not consider your Islam a favour to me. No indeed! It is God who bestowed a favour on you by guiding you to the true faith. [Admit this], if you are telling the truth.\""
          ],
          "en.yusufali": [
            "They impress on thee as a favour that they have embraced Islam. Say, \"Count not your Islam as a favour upon me: Nay, Allah has conferred a favour upon you that He has guided you to the faith, if ye be true and sincere."
          ],
          "fa.ansarian": [
            "از اینکه اسلام آورده اند بر تو منت می گذارند؛ بگو: اگر [در ادعای مؤمن بودن] راستگویید، بر من از اسلام آوردن خود منت نگذارید، بلکه خداست که با هدایت شما به ایمان بر شما منت دارد."
          ],
          "fa.ayati": [
            "از اينكه اسلام آورده‌اند بر تو منت مى‌گذارند. بگو: به خاطر اسلامتان بر من منت مگذاريد، بلكه خدا بدان سبب كه شما را به ايمان راه نموده است بر شما منت مى‌نهد، اگر راست مى‌گوييد."
          ],
          "fa.bahrampour": [
            "بر تو منّت مى‌نهند كه اسلام آورده‌اند. بگو: به اسلام خويش بر من منت منهيد، بلكه اين خداست كه بر شما منّت مى‌نهد كه شما را به ايمان هدايت كرده است، اگر [در مدعاى خود] صادقيد"
          ],
          "fa.fooladvand": [
            "از اينكه اسلام آورده‌اند بر تو منّت مى‌نهند؛ بگو: «بر من از اسلام‌آوردنتان منّت مگذاريد، بلكه [اين‌] خداست كه با هدايت‌كردن شما به ايمان، بر شما منّت مى‌گذارد، اگر راستگو باشيد."
          ],
          "fa.ghomshei": [
            "آنها بر تو به مسلمان شدن منّت می‌گذارند، بگو: شما به اسلام خود بر من منّت منهید بلکه اگر راست می‌گویید (و ایمان حقیقی دارید) خدا بر شما منّت دارد که شما را به سوی ایمان هدایت فرموده است."
          ],
          "fa.khorramdel": [
            "آنان بر تو منّت می‌گذارند که اسلام آورده‌اند! بگو: با اسلام خود بر من منّت مگذارید، بلکه خدا بر شما منّت می‌گذارد که شما را به سوی ایمان آوردن رهنمود کرده است، اگر (در ادّعای ایمان) راست و درست هستید. [[«أَنْ أَسْلَمُوا»: از این که اسلام آورده‌اند. «إِسْلامَکُمْ»: اسلام مفعول به (لا تَمُنُّوا) و یا منصوب به نزع خافض است و اصل آن چنین است: بِإِسْلامِکُمْ. «إِن کُنتُمْ صَادِقِینَ»: جواب شرط محذوف است و ماقبل آن، دالّ بر آن است.]]"
          ],
          "fa.khorramshahi": [
            "بر تو منت می‌نهند که اسلام آورده‌اند، بگو اسلام آوردنتان را بر من منت منهید، بلکه خداوند است که اگر راست می‌گویید، بر شما منت می‌نهد که شما را به [راه‌] ایمان هدایت کرده است‌"
          ],
          "fa.makarem": [
            "آنها بر تو منّت می‌نهند که اسلام آورده‌اند؛ بگو: «اسلام آوردن خود را بر من منّت نگذارید، بلکه خداوند بر شما منّت می‌نهد که شما را به سوی ایمان هدایت کرده است، اگر (در ادّعای ایمان) راستگو هستید!"
          ],
          "fa.moezzi": [
            "منّت نهند بر تو که اسلام آوردند بگو منّت نگذارید بر من اسلام خویش را بلکه خدا منّت نهد بر شما که رهبریتان کرد بسوی ایمان اگر هستید راستگویان‌"
          ],
          "fa.mojtabavi": [
            "بر تو منت مى‌نهند كه اسلام آورده‌اند بگو: به اسلام خود بر من منت منهيد، بلكه خداى بر شما منت مى‌نهد كه شما را به ايمان راه نموده است اگر [در ايمان خود] راستگوييد."
          ],
          "fa.sadeqi": [
            "(اینان) از اینکه اسلام آورده‌اند بر تو منّت می‌نهند. بگو: «بر من از اسلام آوردنتان منّت مگذارید؛ بلکه خدا با هدایت کردنتان برای ایمان، بر شما منّت می‌نهد، اگر (از) راستان بوده‌اید.»"
          ]
        }
      },
      {
        "index": 4630,
        "local_index": 18,
        "part_type": "Verse",
        "path": "/books/quran:49:18",
        "text": [
          "إِنَ‌ اللَّهَ‌ يَعْلَمُ‌ غَيْبَ‌ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ وَ اللَّهُ‌ بَصِيرٌ بِمَا تَعْمَلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Verily God knows the unknown of the heavens and the earth; and God perceives all you do."
          ],
          "en.ahmedraza": [
            "Indeed Allah knows all the hidden of the heavens and the earth; and Allah is seeing your deeds."
          ],
          "en.arberry": [
            "God knows the Unseen of the heavens and of the earth; and God sees the things you do.'"
          ],
          "en.daryabadi": [
            "Verily Allah knoweth the Unseen of the heavens and the earth; and Allah is the Beholder of that which ye work."
          ],
          "en.hilali": [
            "Verily, Allah knows the unseen of the heavens and the earth. And Allah is the All-Seer of what you do."
          ],
          "en.itani": [
            "God knows the secrets of the heavens and the earth, and God is seeing of everything you do."
          ],
          "en.maududi": [
            "Surely Allah knows every hidden thing of the heavens and the earth. Allah sees all that you do."
          ],
          "en.mubarakpuri": [
            "\"Verily, Allah knows the Unseen of the heavens and the earth. And Allah is the All-Seer of what you do.\""
          ],
          "en.pickthall": [
            "Lo! Allah knoweth the Unseen of the heavens and the earth. And Allah is Seer of what ye do."
          ],
          "en.qarai": [
            "Indeed Allah knows the Unseen of the heavens and the earth, and Allah watches what you do.’"
          ],
          "en.qaribullah": [
            "Indeed, Allah knows the Unseen of the heavens and the earth, and Allah is the Seer of what you do'"
          ],
          "en.sahih": [
            "Indeed, Allah knows the unseen [aspects] of the heavens and the earth. And Allah is Seeing of what you do."
          ],
          "en.sarwar": [
            "God knows whatever is unseen in the heavens and in the earth. He is Well Aware of what you do\"."
          ],
          "en.shakir": [
            "Surely Allah knows the unseen things of the heavens and the earth; and Allah sees what you do."
          ],
          "en.transliteration": [
            "Inna All<u>a</u>ha yaAAlamu ghayba a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i wa<b>A</b>ll<u>a</u>hu ba<u>s</u>eerun bim<u>a</u> taAAmaloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "God knows the unseen things of the heavens and the earth. God sees all that you do."
          ],
          "en.yusufali": [
            "\"Verily Allah knows the secrets of the heavens and the earth: and Allah Sees well all that ye do.\""
          ],
          "fa.ansarian": [
            "یقیناً خدا نهان آسمان ها و زمین را می داند و خدا به آنچه انجام می دهید، بیناست."
          ],
          "fa.ayati": [
            "هر آينه خدا نهان آسمانها و زمين را مى‌داند و به هر كارى كه مى‌كنيد بيناست."
          ],
          "fa.bahrampour": [
            "همانا خدا غيب آسمان‌ها و زمين را مى‌داند، و خداوند به آنچه مى‌كنيد بيناست"
          ],
          "fa.fooladvand": [
            "خداست كه نهفته آسمانها و زمين را مى‌داند و خدا[ست كه‌] به آنچه مى‌كنيد بيناست.»"
          ],
          "fa.ghomshei": [
            "خدا اسرار غیب آسمانها و زمین را می‌داند و به آنچه شما بندگان می‌کنید بیناست."
          ],
          "fa.khorramdel": [
            "خداوند رازها و نهانیهای آسمانها و زمین را می‌داند، و او می‌بیند آنچه را که انجام می‌دهید. [[«غَیْبَ»: (نگا: انعام / 50، اعراف / 188، هود / 31، نمل / 65).]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان خداوند نهانیهای آسمان و زمین را می‌داند و خداوند به آنچه می‌کنید بیناست‌"
          ],
          "fa.makarem": [
            "خداوند غیبت آسمانها و زمین را می‌داند و نسبت به آنچه انجام می‌دهید بیناست!»"
          ],
          "fa.moezzi": [
            "همانا خدا داند ناپیدای آسمانها و زمین را و خدا بینا است بدانچه می‌کنید"
          ],
          "fa.mojtabavi": [
            "همانا خدا نهان آسمانها و زمين را مى‌داند، و خدا بدانچه مى‌كنيد بيناست."
          ],
          "fa.sadeqi": [
            "«همواره (این) خداست که نهفته‌ی آسمان‌ها و زمین را می‌داند و خدا(ست که) به آنچه می‌کنید بیناست.»"
          ]
        }
      }
    ]
  },
  "index": "quran:49",
  "kind": "verse_list"
}