{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 54"
        },
        "path": "/books/quran:54",
        "titles": {
          "ar": "القمر",
          "en": "The Moon",
          "ent": "Al-Qamar"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 54,
    "local_index": 54,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 55"
        },
        "path": "/books/quran:55",
        "titles": {
          "ar": "الرحمن",
          "en": "The Beneficent",
          "ent": "Ar-Rahmaan"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 53"
        },
        "path": "/books/quran:53",
        "titles": {
          "ar": "النجم",
          "en": "The Star",
          "ent": "An-Najm"
        }
      },
      "up": {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      }
    },
    "order": 37,
    "part_type": "Chapter",
    "path": "/books/quran:54",
    "reveal_type": "Meccan",
    "rukus": 3,
    "titles": {
      "ar": "القمر",
      "en": "The Moon",
      "ent": "Al-Qamar"
    },
    "verse_count": 55,
    "verse_start_index": 4846,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 4847,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:54:1",
        "text": [
          "اقْتَرَبَتِ‌ السَّاعَةُ وَ انْشَقَ‌ الْقَمَرُ"
        ],
        "translations": {
          "en.ahmedali": [
            "THE HOUR HAS come and split is the moon."
          ],
          "en.ahmedraza": [
            "The Last Day came near, and the moon split apart."
          ],
          "en.arberry": [
            "The Hour has drawn nigh: the moon is split."
          ],
          "en.daryabadi": [
            "The Hour hath drawn nigh, and the moon hath been rent in sunder.. And if they behold a sign, they turn away and say: magic continuous."
          ],
          "en.hilali": [
            "The Hour has drawn near, and the moon has been cleft asunder (the people of Makkah requested Prophet Muhammad SAW to show them a miracle, so he showed them the splitting of the moon)."
          ],
          "en.itani": [
            "The Hour has drawn near, and the moon has split."
          ],
          "en.maududi": [
            "The Hour of Resurrection drew near and the moon split asunder."
          ],
          "en.mubarakpuri": [
            "The Hour has drawn near, and the moon has been cleft asunder."
          ],
          "en.pickthall": [
            "The hour drew nigh and the moon was rent in twain."
          ],
          "en.qarai": [
            "The Hour has drawn near and the moon is split."
          ],
          "en.qaribullah": [
            "The Hour is drawing near, and the moon is split (in two)."
          ],
          "en.sahih": [
            "The Hour has come near, and the moon has split [in two]."
          ],
          "en.sarwar": [
            "The Hour of Doom is drawing near and the moon is rent asunder."
          ],
          "en.shakir": [
            "The hour drew nigh and the moon did rend asunder."
          ],
          "en.transliteration": [
            "Iqtarabati a<b>l</b>ss<u>a</u>AAatu wa<b>i</b>nshaqqa alqamar<b>u</b>"
          ],
          "en.wahiduddin": [
            "The Last Hour draws near and the moon is split asunder."
          ],
          "en.yusufali": [
            "The Hour (of Judgment) is nigh, and the moon is cleft asunder."
          ],
          "fa.ansarian": [
            "قیامت بسیار نزدیک شد، و ماه از هم شکافت."
          ],
          "fa.ayati": [
            "قيامت نزديك شد و ماه دو پاره گرديد."
          ],
          "fa.bahrampour": [
            "قيامت نزديك شد و ماه بشكافت"
          ],
          "fa.fooladvand": [
            "نزديك شد قيامت و از هم شكافت ماه."
          ],
          "fa.ghomshei": [
            "آن ساعت (قیامت یا قیام رسول حق) نزدیک آمد و ماه آسمان شکافته شد (این آیه راجع به شقّ القمر است که کفّار از رسول اکرم درخواست کردند)."
          ],
          "fa.khorramdel": [
            "قیامت هر چه زودتر فرا می‌رسد، و (در آن) ماه به دو نیم می‌گردد. [[«إِقْتَرَبَ»: نزدیک گشته است. ذکر فعل به صورت ماضی، برای تحقق وقوع است (نگا: نجم / 57، انبیاء / 1 و 97). «إِنشَقَّ»: دو نیم شد. مراد وقوع آن در آینده به هنگام فرا رسیدن قیامت است (نگا: حاقه / 16، رحمن / 37، انشقاق / 1). اکثر فعلهائی که برای رستاخیز و حساب و کتاب اخروی بکار رفته است، به شکل ماضی است (نگا: نحل / 1، زمر / 68 و 69 و 70، تکویر / 1 - 14). «إِنشَقَّ الْقَمَرُ»: ماه به دو نیم می‌گردد. ماه به دو نیم گشته است. معنی اخیر مبنی بر روایات متعددی است که می‌گویند پنج سال قبل از هجرت نبوی، اهل مکه از پیغمبر درخواست کردند که ماه را بعنوان معجزه برای ایشان دو نیم سازد و پیغمبر نیز با اشاره انگشت چنین کرد. بسیاری از مفسرین این امر را پذیرفته و بسیاری هم آن را نقد نموده و حادثه را مربوط به آینده می‌دانند (نگا: التفسیر القرآنی للقرآن، المراغی، المنتخب، المصحف المیسر).]]"
          ],
          "fa.khorramshahi": [
            "قیامت نزدیک شد و ماه دو پاره شد"
          ],
          "fa.makarem": [
            "قیامت نزدیک شد و ماه از هم شکافت!"
          ],
          "fa.moezzi": [
            "نزدیک شد ساعت و بشکافت ماه‌"
          ],
          "fa.mojtabavi": [
            "رستاخيز نزديك شد و ماه بشكافت."
          ],
          "fa.sadeqi": [
            "ساعت نزدیک شد و ماه (فرو) شکافت."
          ]
        }
      },
      {
        "index": 4848,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:54:2",
        "text": [
          "وَ إِنْ‌ يَرَوْا آيَةً يُعْرِضُوا وَ يَقُولُوا سِحْرٌ مُسْتَمِرٌّ"
        ],
        "translations": {
          "en.ahmedali": [
            "But if they see a sign they turn away, and say: \"This is the same old lie continuing,\""
          ],
          "en.ahmedraza": [
            "And when they see a sign, they turn away and say, “Just a customary magic!”"
          ],
          "en.arberry": [
            "Yet if they see a sign they turn away, and they say 'A continuous sorcery!'"
          ],
          "en.daryabadi": [
            "And if they behold a sign, they turn away and say: \"magic continous\""
          ],
          "en.hilali": [
            "And if they see a sign, they turn away, and say: \"This is continuous magic.\""
          ],
          "en.itani": [
            "Yet whenever they see a miracle, they turn away, and say, “Continuous magic.”"
          ],
          "en.maududi": [
            "(Regardless of any Signs these people see), they turn away and say: “This is an ongoing sorcery.”"
          ],
          "en.mubarakpuri": [
            "And if they see an Ayah, they turn away and say: \"This is magic, Mustamir.\""
          ],
          "en.pickthall": [
            "And if they behold a portent they turn away and say: Prolonged illusion."
          ],
          "en.qarai": [
            "If they see a sign, they turn away, and say, ‘An incessant magic!’"
          ],
          "en.qaribullah": [
            "Yet if they see a sign (the unbelievers) turn their backs and say: 'This is but a continuation of sorcery'"
          ],
          "en.sahih": [
            "And if they see a miracle, they turn away and say, \"Passing magic.\""
          ],
          "en.sarwar": [
            "Whenever they see a miracle, they turn away from it and say, \"This is just a powerful magic\"."
          ],
          "en.shakir": [
            "And if they see a miracle they turn aside and say: Transient magic."
          ],
          "en.transliteration": [
            "Wain yaraw <u>a</u>yatan yuAAri<u>d</u>oo wayaqooloo si<u>h</u>run mustamirr<b>un</b>"
          ],
          "en.wahiduddin": [
            "Yet, when they see a sign they [who deny the truth] turn their backs and say, \"The same old sorcery!\""
          ],
          "en.yusufali": [
            "But if they see a Sign, they turn away, and say, \"This is (but) transient magic.\""
          ],
          "fa.ansarian": [
            "و اگر معجزه ای را ببینند، روی بگردانند و گویند: [این] جادویی همیشگی است!"
          ],
          "fa.ayati": [
            "و اگر معجزه‌اى ببينند، روى بگردانند و گويند: جادويى بزرگ است."
          ],
          "fa.bahrampour": [
            "و اگر معجزه‌اى ببينند، روى بگردانند و گويند: سحرى دائمى است"
          ],
          "fa.fooladvand": [
            "و هر گاه نشانه‌اى ببينند روى بگردانند و گويند: «سحرى دايم است.»"
          ],
          "fa.ghomshei": [
            "و اگر کافران، بزرگ آیت و معجزی (چون شکافتن ماه) هم ببینند باز اعراض کرده و گویند که این سحری نیرومند و کامل است."
          ],
          "fa.khorramdel": [
            "و اگر مشرکان معجزه‌ی بزرگی را ببینند از آن روی‌گردان می‌گردند (و بدان ایمان نمی‌آورند) و می‌گویند: جادوی گذرا و ناپایداری است. [[«إِن یَرَوْا»: اگر ببینند. اگر بشنوند و بفهمند (نگا: المصحف المیسر). «آیَةً»: دلیل و برهانی دالّ بر وحدانیت خدا و صدق پیغمبرش (نگا: اعراف / 146). آیه قرآنی. چرا که مشرکان آیات قرآنی را سحر و جادو می‌نامیدند (نگا: سبأ / 43، زخرف / 30، مدثر / 24). معجزه بزرگ که مراد شق‌القمر است. «مُسْتَمِرٌّ»: همیشگی و پیاپی. گذرا و ناپایدار.]]"
          ],
          "fa.khorramshahi": [
            "و اگر معجزه‌ای بینند روی برتابند و گویند جادویی دنباله‌دار است‌"
          ],
          "fa.makarem": [
            "و هرگاه نشانه و معجزه‌ای را ببینند روی گردانده، می‌گویند: «این سحری مستمر است»!"
          ],
          "fa.moezzi": [
            "و اگر بینند آیتی روی برتابند و گویند جادوئی است گذران (یا نیرومند)"
          ],
          "fa.mojtabavi": [
            "و اگر نشانه‌اى- معجزه‌اى- ببينند روى بگردانند و گويند: اين جادويى است نيرومند."
          ],
          "fa.sadeqi": [
            "و اگر نشانه‌ای بینند روی گردانند و گویند: «سحری همیشگی است.»"
          ]
        }
      },
      {
        "index": 4849,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:54:3",
        "text": [
          "وَ کَذَّبُوا وَ اتَّبَعُوا أَهْوَاءَهُمْ‌ وَ کُلُ‌ أَمْرٍ مُسْتَقِرٌّ"
        ],
        "translations": {
          "en.ahmedali": [
            "And deny, and follow their own vain desires; but every matter is determined at its time."
          ],
          "en.ahmedraza": [
            "And they denied and followed their own desires, whereas each matter has been decided!"
          ],
          "en.arberry": [
            "They have cried lies, and followed their caprices; but every matter is settled."
          ],
          "en.daryabadi": [
            "And they belied, and they followed their lusts; and every affair cometh to a final goal."
          ],
          "en.hilali": [
            "They belied (the Verses of Allah, this Quran), and followed their own lusts. And every matter will be settled [according to the kind of deeds (for the doer of good deeds, his deeds will take him to Paradise, and similarly evil deeds will take their doers to Hell)]."
          ],
          "en.itani": [
            "They lied, and followed their opinions, but everything has its time."
          ],
          "en.maududi": [
            "They also gave the lie to (the splitting asunder of the moon) and only followed their desires. Yet everything is destined to reach an end."
          ],
          "en.mubarakpuri": [
            "They denied and followed their own lusts. And every matter will be settled."
          ],
          "en.pickthall": [
            "They denied (the Truth) and followed their own lusts. Yet everything will come to a decision"
          ],
          "en.qarai": [
            "They denied and followed their own desires, and every matter has a setting [appropriate to it]."
          ],
          "en.qaribullah": [
            "They have belied, and follow their own fancies. But, every issue will be settled!"
          ],
          "en.sahih": [
            "And they denied and followed their inclinations. But for every matter is a [time of] settlement."
          ],
          "en.sarwar": [
            "They have rejected it and have followed their own desires, but all matters will be settled (by God)."
          ],
          "en.shakir": [
            "And they call (it) a lie, and follow their low desires; and every affair has its appointed term."
          ],
          "en.transliteration": [
            "Waka<u>thth</u>aboo wa<b>i</b>ttabaAAoo ahw<u>a</u>ahum wakullu amrin mustaqirr<b>un</b>"
          ],
          "en.wahiduddin": [
            "They deny the truth and follow their own whims, every matter has its appointed time,"
          ],
          "en.yusufali": [
            "They reject (the warning) and follow their (own) lusts but every matter has its appointed time."
          ],
          "fa.ansarian": [
            "و [قرآن، رسالت پیامبر و معجزه را] انکار کردند و هواهای نفسانی خود را پیروی نمودند، در حالی که هر کاری [چه خیر و چه شر، چه حق و چه باطل در قرارگاه ویژه خود] قرار می گیرد [و اینان به زودی خواهند دانست که قرآن و پیامبر بر حق است یا معبودانشان؟]"
          ],
          "fa.ayati": [
            "و تكذيب مى‌كنند و از پى هواهاى خويش مى‌روند. و هر كارى را هدفى است."
          ],
          "fa.bahrampour": [
            "و [حقيقت را] تكذيب كردند و پيرو هوس‌هاى خود شدند، و هر امرى [به جاى خود] قرار گيرد [و حق و باطل روشن شود]"
          ],
          "fa.fooladvand": [
            "و به تكذيب دست زدند و هوسهاى خويش را دنبال كردند، و [لى‌] هر كارى را [آخر] قرارى است."
          ],
          "fa.ghomshei": [
            "و آنها (رسول حق را) تکذیب کرده و پیرو هوای نفس باطل خود شدند و هر (حق و باطل) امری را عاقبت (در بهشت یا دوزخ) مقرّی خواهد بود."
          ],
          "fa.khorramdel": [
            "آنان تکذیب می‌کنند و بدنبال هواهای خویش می‌روند. هر کاری هم ثابت و ماندگار می‌ماند (و هیچ چیز در جهان از میان نمی‌رود، و انسان جزا و سزای کردار بد و نیک خود را می‌بیند). [[«مُسْتَقِرٌّ»: ماندنی و ثابت. این تعبیر شاید به این حقیقت اشاره دارد که هیچ چیز در این عالم از میان نمی‌رود. لذا هر کار نیک و بدی ثابت و باقی می‌ماند و انسان مکافات عمل خویش را می‌بیند. هر کاری به غایتی و نهایتی می‌رسد که در آنجا آرام و قرار می‌گیرد، و خوبی یا بدی آن آشکار می‌گردد. نظیرآیات 1 و 2 و 3 این سوره را در آیات 1 و 2 و 3 سوره انبیاء بخوانید.]]"
          ],
          "fa.khorramshahi": [
            "و انکار پیشه کردند و از هوی و هوسهایشان پیروی کردند و هر کاری سرانجامی دارد"
          ],
          "fa.makarem": [
            "آنها (آیات خدا را) تکذیب کردند و از هوای نفسشان پیروی نمودند؛ و هر امری قرارگاهی دارد!"
          ],
          "fa.moezzi": [
            "و تکذیب کردند و پیروی کردند هوسهای خویش را و هر کاری است پایدار (جایگزین)"
          ],
          "fa.mojtabavi": [
            "و دروغ انگاشتند و پيرو خواهشهاى [دل‌] خويش شدند و هر كارى [به جاى خود] قرار مى‌گيرد- نيكى به نيكان و بدى به بدان-."
          ],
          "fa.sadeqi": [
            "و تکذیب نمودند و هوس‌های خویش را پیروی کردند. و هر امری [:فرمان، کار و چیزی] قرارگیرنده است."
          ]
        }
      },
      {
        "index": 4850,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:54:4",
        "text": [
          "وَ لَقَدْ جَاءَهُمْ‌ مِنَ‌ الْأَنْبَاءِ مَا فِيهِ‌ مُزْدَجَرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "Messages deterring them from evil had come to them,"
          ],
          "en.ahmedraza": [
            "And indeed the news which had a lot of deterrence, came to them."
          ],
          "en.arberry": [
            "And there have come to them such tidings as contain a deterrent --"
          ],
          "en.daryabadi": [
            "And assuredly there hath come Unto them tidings wherein is a deterrent."
          ],
          "en.hilali": [
            "And indeed there has come to them news (in this Quran) wherein there is (enough warning) to check (them from evil),"
          ],
          "en.itani": [
            "And there came to them news containing a deterrent."
          ],
          "en.maududi": [
            "Surely there came to them narratives (of the ancient nations) that should suffice to deter (them from transgression),"
          ],
          "en.mubarakpuri": [
            "And indeed there has come to them news wherein there is Muzdajar."
          ],
          "en.pickthall": [
            "And surely there hath come unto them news whereof the purport should deter,"
          ],
          "en.qarai": [
            "There have already come to them reports containing admonishment,"
          ],
          "en.qaribullah": [
            "Tidings containing a deterrent have come to them"
          ],
          "en.sahih": [
            "And there has already come to them of information that in which there is deterrence -"
          ],
          "en.sarwar": [
            "They have certainly received the kind of news in which there is a lesson and strong words of wisdom,"
          ],
          "en.shakir": [
            "And certainly some narratives have come to them wherein is prevention--"
          ],
          "en.transliteration": [
            "Walaqad j<u>a</u>ahum mina alanb<u>a</u>i m<u>a</u> feehi muzdajar<b>un</b>"
          ],
          "en.wahiduddin": [
            "there has come to them many a tiding wherein there are warnings,"
          ],
          "en.yusufali": [
            "There have already come to them Recitals wherein there is (enough) to check (them),"
          ],
          "fa.ansarian": [
            "بی تردید آنچه از خبرها [ی گذشتگان] که [در آن] مایه بازداشتن [از کفر و شرک و گناهان] است برای آنان آمده است."
          ],
          "fa.ayati": [
            "و برايشان خبرهايى آمده است كه از گناهشان بازمى‌دارد."
          ],
          "fa.bahrampour": [
            "و به تحقيق از اخبار [پيشينيان‌] آنچه در آن بازدارندگى است برايشان آمده است"
          ],
          "fa.fooladvand": [
            "و قطعاً از اخبار، آنچه در آن مايه انزجار [از كفر] است به ايشان رسيد."
          ],
          "fa.ghomshei": [
            "و اخباری که مایه عبرت و انزجار از معصیت است کاملا به مردم رسید."
          ],
          "fa.khorramdel": [
            "اخباری که بتوانند موجب بیزاری (و دوری ایشان از گناهها و بدیها) شود به اندازه‌ی کافی برای آنان آمده است. [[«الأنبَآءِ»: جمع نبأ، اخبار. مراد خبرهای طوائف و ملل پیشین است که به عذابهای گوناگون دچار آمده‌اند و با بلاهای بزرگی ریشه‌کن گشته‌اند، و نیز مراد وجود حقائق کونی و رهنمودهای پیغمبران و سخنان ایشان درباره مکافات و مجازات دنیا و آخرت است. «مُزْدَجَرٌ»: انزجار و ابتعاد از شرّ. دوری گزیدن و بیزاری جستن از گناهان و بدیها. مصدر میمی باب افتعال زجر است.]]"
          ],
          "fa.khorramshahi": [
            "و به راستی برای آنان از اخبار [پیشینیان‌] آنچه در آن درس عبرت هست، به میان آمده است‌"
          ],
          "fa.makarem": [
            "به اندازه کافی برای بازداشتن از بدیها اخبار (انبیا و امّتهای پیشین) به آنان رسیده است!"
          ],
          "fa.moezzi": [
            "و هر آینه بیامدشان از داستانها آنچه در آن است بازداشتی‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه از خبرها آنچه در آن، مايه [پندگرفتن و] بازايستادن است بديشان آمده است."
          ],
          "fa.sadeqi": [
            "و همواره به‌راستی از اخبار مهم آنچه را جایگاه انزجار (از کفر) است به ایشان رسید."
          ]
        }
      },
      {
        "index": 4851,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:54:5",
        "text": [
          "حِکْمَةٌ بَالِغَةٌ فَمَا تُغْنِ‌ النُّذُرُ"
        ],
        "translations": {
          "en.ahmedali": [
            "Containing consummate wisdom; yet warnings were of no avail."
          ],
          "en.ahmedraza": [
            "The pinnacle of wisdom – so how will the Heralds of warning provide any benefit?"
          ],
          "en.arberry": [
            "a Wisdom far-reaching; yet warnings do not avail."
          ],
          "en.daryabadi": [
            "Wisdom consummate. But warnings avail not."
          ],
          "en.hilali": [
            "Perfect wisdom (this Quran), but (the preaching of) warners benefit them not,"
          ],
          "en.itani": [
            "Profound wisdom—but warnings are of no avail."
          ],
          "en.maududi": [
            "narratives that are full of consummate wisdom. But warnings do not avail them."
          ],
          "en.mubarakpuri": [
            "Perfect wisdom, but warners benefit them not."
          ],
          "en.pickthall": [
            "Effective wisdom; but warnings avail not."
          ],
          "en.qarai": [
            "[and representing] far-reaching wisdom; but warnings are of no avail!"
          ],
          "en.qaribullah": [
            "which are full of wisdom; but the warnings do not help."
          ],
          "en.sahih": [
            "Extensive wisdom - but warning does not avail [them]."
          ],
          "en.sarwar": [
            "but the warnings have proved to have no effect on them."
          ],
          "en.shakir": [
            "Consummate wisdom-- but warnings do not avail;"
          ],
          "en.transliteration": [
            "<u>H</u>ikmatun b<u>a</u>lighatun fam<u>a</u> tughnee a<b>l</b>nnu<u>th</u>ur<b>u</b>"
          ],
          "en.wahiduddin": [
            "profound in wisdom, but all warnings have been of no avail:"
          ],
          "en.yusufali": [
            "Mature wisdom;- but (the preaching of) Warners profits them not."
          ],
          "fa.ansarian": [
            "[این خبرها] پندی رساست، ولی هشدارها [به این ستمکاران لجوج] سودی نمی بخشد."
          ],
          "fa.ayati": [
            "حكمتى است تمام. ولى بيم‌دهندگان سودشان ندهند."
          ],
          "fa.bahrampour": [
            "[آيات الهى‌] حكمتى رساست، ليكن هشدارها [حق ناپذيران را] فايده نمى‌دهد"
          ],
          "fa.fooladvand": [
            "حكمت بالغه [حق اين بود]، ولى هشدارها سود نكرد."
          ],
          "fa.ghomshei": [
            "(قرآن) حکمت بالغه خداست و (اگر از آن پند نگیرید) دیگر از این پس هیچ اندرز و پند (شما را) سودی نخواهد بخشید."
          ],
          "fa.khorramdel": [
            "(این آیات) عبرتهای بسنده و اندرزهای رسائی هستند (که می‌توانند در روح و جان شنوندگان و بینندگانی که آماده‌ی پذیرش حق و حقیقت باشند، اثر بگذارند) امّا بر حذر داشتنها و بیم دادنها (ی قرآنی برای افراد لجوج بیفایده است و به حال آنان) سودی ندارد. [[«حِکْمَةٌ»: سخنان پندآمیز. اندرزهای سودمند. خبر مبتدای محذوف است و تقدیر چنین است: هذِهِ الأشْیَآءُ الَّتی جَآءَ بِهَا الْقُرآنُ حِکْمَةٌ. «بَالِغَةٌ»: رسا. بسنده برای خردمندان. «النُّذُرُ»: (نگا: یونس / 101، قمر / 16 و 18 و 21 و 23 و 30 و 33 و 36 و 37 و 41). یا این که جمع نَذیر به معنی مُنذِر، یعنی پیغمبران الهی (نگا: احقاف / 21، نجم / 56). معنی دوم در سوره قمر چندان مناسب نیست.]]"
          ],
          "fa.khorramshahi": [
            "حکمتی است رسا، و هشدارها سودی نبخشیده است‌"
          ],
          "fa.makarem": [
            "این آیات، حکمت بالغه الهی است؛ امّا انذارها (برای افراد لجوج) فایده نمی‌دهد!"
          ],
          "fa.moezzi": [
            "حکمتی است رسا پس بی‌نیاز نکنند ترسانندگان‌"
          ],
          "fa.mojtabavi": [
            "[آن پندها] حكمتى است رسا، ولى بيم‌كنندگان [چون امتهاشان نشنوند و كار نبندند] چه سودى توانند رسانيد؟"
          ],
          "fa.sadeqi": [
            "حکمتی‌رسا(ست). پس ترسانندگان بی‌نیاز(شان) نمی‌کنند."
          ]
        }
      },
      {
        "index": 4852,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:54:6",
        "text": [
          "فَتَوَلَ‌ عَنْهُمْ‌ يَوْمَ‌ يَدْعُ‌ الدَّاعِ‌ إِلَى‌ شَيْ‌ءٍ نُکُرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "So turn away from them. When on the Day the crier calls to the painful business,"
          ],
          "en.ahmedraza": [
            "Therefore turn away from them; on the day when the announcer will call towards a severe unknown matter –"
          ],
          "en.arberry": [
            "So turn thou away from them. Upon the day when the Caller shall call unto a horrible thing,"
          ],
          "en.daryabadi": [
            "Wherefore withdrew thou from them. The Day whereon the sum- moner Will summon mankind Unto a thing unpleasant."
          ],
          "en.hilali": [
            "So (O Muhammad SAW) withdraw from them. The Day that the caller will call (them) to a terrible thing."
          ],
          "en.itani": [
            "So turn away from them. On the Day when the Caller calls to something terrible."
          ],
          "en.maududi": [
            "So turn away from them, (O Prophet). On the Day when a caller shall call them to a thing most terrible,"
          ],
          "en.mubarakpuri": [
            "So withdraw from them. The Day that the caller will call (them) to a terrible thing."
          ],
          "en.pickthall": [
            "So withdraw from them (O Muhammad) on the day when the Summoner summoneth unto a painful thing."
          ],
          "en.qarai": [
            "So turn away from them! The day when the Caller calls to a dire thing,"
          ],
          "en.qaribullah": [
            "Therefore, turn away from them. On the Day when the Caller summons them to a terrible thing,"
          ],
          "en.sahih": [
            "So leave them, [O Muhammad]. The Day the Caller calls to something forbidding,"
          ],
          "en.sarwar": [
            "(Muhammad), leave them alone. On the day when they will be called to a terrible punishment,"
          ],
          "en.shakir": [
            "So turn (your) back on them (for) the day when the inviter shall invite them to a hard task,"
          ],
          "en.transliteration": [
            "Fatawalla AAanhum yawma yadAAu a<b>l</b>dd<u>a</u>AAi il<u>a</u> shayin nukur<b>in</b>"
          ],
          "en.wahiduddin": [
            "so ignore them. On the Day when the Crier will call out about a horrible event,"
          ],
          "en.yusufali": [
            "Therefore, (O Prophet,) turn away from them. The Day that the Caller will call (them) to a terrible affair,"
          ],
          "fa.ansarian": [
            "بنابراین از آنان روی بگردان [و] روزی را [یاد کن] که آن دعوت کننده [یعنی اسرافیل] آنان را به امری بس دشوار و هولناک دعوت می کند."
          ],
          "fa.ayati": [
            "پس در آن روز كه آن دعوت‌كننده، آنان را به چيزى ناخوش فرامى‌خواند، از ايشان رويگردان شو."
          ],
          "fa.bahrampour": [
            "پس از آنان روى برتاب [و منتظر باش‌] روزى را كه داعى [حق‌] به سوى امرى دهشتناك دعوت كند [و به پاى حساب بكشد]"
          ],
          "fa.fooladvand": [
            "پس، از آنان روى برتاب. روزى كه داعى [حق‌] به سوى امرى دهشتناك دعوت مى‌كند،"
          ],
          "fa.ghomshei": [
            "پس روی از کافران بگردان (تا) روزی که ندا کننده‌ای (چون اسرافیل، خلق را) به عالمی حیرت آور و قیامتی هول‌انگیز دعوت کند."
          ],
          "fa.khorramdel": [
            "بنابراین از ایشان روی بگردان. آن روزی (را خاطر نشان ساز) که فرا خواننده (ی الهی برای گرد آمدن مردمان در محلّ حساب و کتاب قیامت ایشان را) به سوی چیز ناخوش‌آیندی فرا می‌خواند. [[«تَوَلَّ عَنْهُمْ»: از آنان روی بگردان. بدیشان اعتناء مکن. به ترک ایشان بگوی. «یَوْمَ»: مفعول به فعل محذوفی است، و یا ظرف فعل (یَخْرُجُونَ) در آیه بعدی است. «یَدْعُو»: فرا می‌خواند. واو آن در رسم‌الخط قرآنی، برای تخفیف حذف شده است. «الدَّاعی»: فرا خواننده. مراد اسرافیل است بدانگاه که برای بار دوم در صور می‌دمد و همگان را به سوی محکمه دادگاه قیامت فرا می‌خواند. یاء آن در رسم‌الخط قرآنی، برای تخفیف حذف شده است. «نُکُرٍ»: ناخوش‌آیند. ناپسند. مراد کار سخت و نامأنوس است که هول و هراس و دهشت و وحشت قیامت است.]]"
          ],
          "fa.khorramshahi": [
            "پس از آنان روی بر تاب [تا] روزی که آن دعوتگر به چیزی غریب و ناشناخته دعوت کند"
          ],
          "fa.makarem": [
            "بنابر این از آنها روی بگردان، و روزی را به یاد آور که دعوت کننده الهی مردم را به امر وحشتناکی دعوت می‌کند (دعوت به حساب اعمال)!"
          ],
          "fa.moezzi": [
            "پس روی برتاب از ایشان روزی که خواند خواننده به چیزی ناپسند"
          ],
          "fa.mojtabavi": [
            "پس، از آنان روى بگردان [و چشم مى‌دار] روزى را كه آن خواننده [آنان را] به چيزى سخت ناخوش- دوزخ- فرامى‌خواند،"
          ],
          "fa.sadeqi": [
            "پس روزی که داعیِ (حق) سوی امری دهشتناک (و ناشناخته) دعوت می‌کند، از آنان روی برتاب."
          ]
        }
      },
      {
        "index": 4853,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:54:7",
        "text": [
          "خُشَّعاً أَبْصَارُهُمْ‌ يَخْرُجُونَ‌ مِنَ‌ الْأَجْدَاثِ‌ کَأَنَّهُمْ‌ جَرَادٌ مُنْتَشِرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "They will come out of the graves with downcast eyes like an expanding swarm of locusts."
          ],
          "en.ahmedraza": [
            "They will come out from the graves with eyes lowered, as if they were spread locusts."
          ],
          "en.arberry": [
            "abasing their eyes, they shall come forth from the tombs as if they were scattered grasshoppers,"
          ],
          "en.daryabadi": [
            "With looks downcast they will come forth, from the tombs, as though they were locusts scattered abroad."
          ],
          "en.hilali": [
            "They will come forth, with humbled eyes from (their) graves as if they were locusts spread abroad,"
          ],
          "en.itani": [
            "Their eyes humiliated, they will emerge from the graves, as if they were swarming locusts."
          ],
          "en.maududi": [
            "with down-cast eyes they shall go forth from their graves, as though they were scattered locusts."
          ],
          "en.mubarakpuri": [
            "They will come forth, with humbled eyes from (their) graves as if they were locusts spread abroad,"
          ],
          "en.pickthall": [
            "With downcast eyes, they come forth from the graves as they were locusts spread abroad,"
          ],
          "en.qarai": [
            "they will emerge from the graves as if they were scattered locusts with a humbled look [in their eyes],"
          ],
          "en.qaribullah": [
            "their eyes will be humbled as they come out from their graves as if they were scattered locusts,"
          ],
          "en.sahih": [
            "Their eyes humbled, they will emerge from the graves as if they were locusts spreading,"
          ],
          "en.sarwar": [
            "they will come out of their graves, their eyes cast down, hastening towards their Summoner as locusts rushing about."
          ],
          "en.shakir": [
            "Their eyes cast down, going forth from their graves as if they were scattered locusts,"
          ],
          "en.transliteration": [
            "KhushshaAAan ab<u>sa</u>ruhum yakhrujoona mina alajd<u>a</u>thi kaannahum jar<u>a</u>dun muntashir<b>un</b>"
          ],
          "en.wahiduddin": [
            "with downcast eyes they shall come out of their graves, as if they were locusts milling about"
          ],
          "en.yusufali": [
            "They will come forth,- their eyes humbled - from (their) graves, (torpid) like locusts scattered abroad,"
          ],
          "fa.ansarian": [
            "در حالی که دیدگانشان [از شدت ترس] فرو افتاده، هم چون ملخ های پراکنده از گورها بیرون آیند."
          ],
          "fa.ayati": [
            "نشان ذلت در چشمانشان آشكار است. چون ملخهاى پراكنده از قبرها بيرون مى‌آيند."
          ],
          "fa.bahrampour": [
            "در حالى كه چشمانشان فرو شكسته، از قبرها بيرون مى‌آيند، گويى آنان ملخ‌هاى پراكنده‌اند"
          ],
          "fa.fooladvand": [
            "در حالى كه ديدگان خود را فروهشته‌اند، چون ملخهاى پراكنده از گورها[ى خود] برمى‌آيند."
          ],
          "fa.ghomshei": [
            "که (از هول آن) کافران به خواری چشم بر هم نهند و سر از قبرها بر آورده مانند ملخ به عرصه محشر منتشر شوند."
          ],
          "fa.khorramdel": [
            "با چشمانی فروهشته و به زیر انداخته (از شرمساری و خواری) از گورها بیرون می‌آیند (و به هر سو می‌روند و می‌دوند) انگار آنان ملخهای پراکنده‌اند (که در دسته‌ها و گروههای نامنظّم و بی‌هدف، راهی اینجا و آنجا می‌شوند). [[«خُشَّعاً»: جمع خاشِع، ذلیل و خوار. فرو افتاده و به زیر انداخته شده. حال ضمیر (و) در فعل (یَخْرُجُونَ) است. «أَبْصَارُ»: فاعل (خُشَّعاً) است (نگا: قلم / 43). «الأجْدَاثِ»: جمع جَدَث، قبرها. گورها. «جَرَادٌ»: ملخ. «مُنتَشِرٌ»: پخش و پراکنده.]]"
          ],
          "fa.khorramshahi": [
            "در حالی که دیدگانشان را فروداشته‌اند، از گورها بیرون آیند، گویی که ملخهای پراکنده‌اند"
          ],
          "fa.makarem": [
            "آنان در حالی که چشمهایشان از شدّت وحشت به زیر افتاده، همچون ملخهای پراکنده از قبرها خارج می‌شوند،"
          ],
          "fa.moezzi": [
            "سرافکنده است دیدگانشان برون آیند از گورها گوئیا آنانند ملخهای پراکنده‌"
          ],
          "fa.mojtabavi": [
            "چشمهاشان [از هول‌] فرو شده، از گورها بيرون آيند گويى ملخهايى پراكنده‌اند"
          ],
          "fa.sadeqi": [
            "در حالی که دیدگانشان بسی فروهشته است، چون ملخ‌های پراکنده از گورها(ی خود) بر می‌آیند."
          ]
        }
      },
      {
        "index": 4854,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:54:8",
        "text": [
          "مُهْطِعِينَ‌ إِلَى‌ الدَّاعِ‌ يَقُولُ‌ الْکَافِرُونَ‌ هٰذَا يَوْمٌ‌ عَسِرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "They will hasten forward to the caller, gazes fixed. And the unbelievers will say: \"This is the day of untold woe.\""
          ],
          "en.ahmedraza": [
            "Rushing towards the caller; the disbelievers will say, “This is a tough day.”"
          ],
          "en.arberry": [
            "running with outstretched necks to the Caller. The unbelievers shall say, 'This is a hard day!'"
          ],
          "en.daryabadi": [
            "Hastening toward the summoner. The infidels will say: this is a day diffrcult."
          ],
          "en.hilali": [
            "Hastening towards the caller, the disbelievers will say: \"This is a hard Day.\""
          ],
          "en.itani": [
            "Scrambling towards the Caller, the disbelievers will say, “This is a difficult Day.”"
          ],
          "en.maududi": [
            "They shall be hurrying forth towards the caller, and the unbelievers (who had once denied this Day), will say: “This is a woeful Day.”"
          ],
          "en.mubarakpuri": [
            "Hastening towards the caller. The disbelievers will say: \"This is a hard Day.\""
          ],
          "en.pickthall": [
            "Hastening toward the summoner; the disbelievers say: This is a hard day."
          ],
          "en.qarai": [
            "scrambling toward the summoner. The faithless will say, ‘This is a hard day!’"
          ],
          "en.qaribullah": [
            "running (with their necks extended) to the Caller. The unbelievers will say: 'This is indeed a harsh Day'"
          ],
          "en.sahih": [
            "Racing ahead toward the Caller. The disbelievers will say, \"This is a difficult Day.\""
          ],
          "en.sarwar": [
            "These disbelievers will say, \"This is a hard day\"."
          ],
          "en.shakir": [
            "Hastening to the inviter. The unbelievers shall say: This is a hard day."
          ],
          "en.transliteration": [
            "Muh<u>t</u>iAAeena il<u>a</u> a<b>l</b>dd<u>a</u>AAi yaqoolu alk<u>a</u>firoona h<u>atha</u> yawmun AAasir<b>un</b>"
          ],
          "en.wahiduddin": [
            "hastening towards the Crier. Those who deny the truth will cry, \"This is such a hard day!\""
          ],
          "en.yusufali": [
            "Hastening, with eyes transfixed, towards the Caller!- \"Hard is this Day!\", the Unbelievers will say."
          ],
          "fa.ansarian": [
            "شتابان به سوی آن دعوت کننده می روند و کافران می گویند: امروز روز بسیار سختی است."
          ],
          "fa.ayati": [
            "سرها را بالا گرفته به سوى آن دعوت‌كننده مى‌شتابند. كافران مى‌گويند: اين روز دشوارى است."
          ],
          "fa.bahrampour": [
            "گردن‌كشان به سرعت به سوى آن دعوتگر بشتابند كافران گويند: امروز روز سختى است"
          ],
          "fa.fooladvand": [
            "به سرعت سوى آن دعوتگر مى‌شتابند. كافران مى‌گويند: «امروز [چه‌] روز دشوارى است.»"
          ],
          "fa.ghomshei": [
            "در آن حال منادی محشر را ناچار به سرعت اجابت کنند، کافران با هم گویند: این روز همان روز سخت است (که ما انکار می‌کردیم)."
          ],
          "fa.khorramdel": [
            "شتابان به سوی فرا خواننده (ی الهی، اسرافیل) می‌روند (و بدو می‌نگرند و چشم از او بر نمی‌دارند). کافران می‌گویند: امروز روز بسیار سخت و هراس‌انگیزی است. [[«مُهْطِعِینَ»: جمع مُهْطِع، شتابان و دوان. یعنی باشتاب به سوی اسرافیل می‌روند و در دادگاه الهی برای حساب و کتاب حاضر می‌شوند. یا این که به معنی گردن کشنده و خیره نگاه کننده بوده، بدین معنی که انسانها چون صدای وحشتناک و شیپور جمع شدن را می‌شنوند، فوراً گردن بلند می‌کنند و به سوی اسرافیل خیره خیره می‌نگرند و می‌دوند (نگا: ابراهیم / 43). «عَسِرٌ»: سخت و دشوار. پر خوف و هراس (نگا: فرقان / 26، مدثر / 9). «الدَّاعی»: (نگا: قمر / 6).]]"
          ],
          "fa.khorramshahi": [
            "به سوی دعوتگر شتابند، و کافران گویند امروز روزی دشوار است‌"
          ],
          "fa.makarem": [
            "در حالی که (بر اثر وحشت و اضطراب) بسوی این دعوت کننده گردن می‌کشند؛ کافران می‌گویند: «امروز روز سخت و دردناکی است!»"
          ],
          "fa.moezzi": [
            "شتابندگان بسوی خواننده گویند کافران امروز است روزی سخت‌"
          ],
          "fa.mojtabavi": [
            "به سوى آن خواننده شتابانند. كافران گويند: اين روزى است دشوار."
          ],
          "fa.sadeqi": [
            "سوی آن دعوتگر، چشم دوخته و نگرانند. کافران می‌گویند: «این روزی دشوار است.»"
          ]
        }
      },
      {
        "index": 4855,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:54:9",
        "text": [
          "کَذَّبَتْ‌ قَبْلَهُمْ‌ قَوْمُ‌ نُوحٍ‌ فَکَذَّبُوا عَبْدَنَا وَ قَالُوا مَجْنُونٌ‌ وَ ازْدُجِرَ"
        ],
        "translations": {
          "en.ahmedali": [
            "The people of Noah had denied before them, and had called Our votary a liar, and said: \"He is possessed,\" and repulsed him."
          ],
          "en.ahmedraza": [
            "Before these, the people of Nooh denied and they belied Our bondman and said, “He is a madman” and rebuffed him."
          ],
          "en.arberry": [
            "The people of Noah cried lies before them; they cried lies to Our servant, and said, 'A man possessed!' And he was rejected."
          ],
          "en.daryabadi": [
            "There belied before them the people of Nuh. So they belied Our bondman Nuh and said: `a madman;' and moreover he was reproven."
          ],
          "en.hilali": [
            "The people of Nuh (Noah) denied (their Messenger) before them, they rejected Our slave, and said: \"A madman!\" and he was insolently rebuked and threatened."
          ],
          "en.itani": [
            "Before them the people of Noah disbelieved. They rejected Our servant, and said, “Crazy,” and he was rebuked."
          ],
          "en.maududi": [
            "Before them Noah's people also gave the lie (to his Message). They rejected Our servant as a liar, saying: “He is a madman”; and he was rebuffed."
          ],
          "en.mubarakpuri": [
            "The people of Nuh denied (their Messenger) before them. They rejected Our servant and said: \"A madman!\" Wazdujir."
          ],
          "en.pickthall": [
            "The folk of Noah denied before them, yea, they denied Our slave and said: A madman; and he was repulsed."
          ],
          "en.qarai": [
            "The people of Noah impugned before them. So they impugned Our servant and said, ‘A crazy man,’ and he was reviled."
          ],
          "en.qaribullah": [
            "(Long) before them the nation of Noah belied. They belied Our worshiper saying: 'Mad' and he was reprimanded."
          ],
          "en.sahih": [
            "The people of Noah denied before them, and they denied Our servant and said, \"A madman,\" and he was repelled."
          ],
          "en.sarwar": [
            "The people of Noah, who lived before them, had also rejected (Our guidance). They rejected Our servant and said, \"He is an insane person so let us drive him away\"."
          ],
          "en.shakir": [
            "Before them the people of Nuh rejected, so they rejected Our servant and called (him) mad, and he was driven away."
          ],
          "en.transliteration": [
            "Ka<u>thth</u>abat qablahum qawmu noo<u>h</u>in faka<u>thth</u>aboo AAabdan<u>a</u> waq<u>a</u>loo majnoonun wa<b>i</b>zdujir<b>a</b>"
          ],
          "en.wahiduddin": [
            "The people of Noah denied [the truth] before them. They belied Our messenger saying, \"He is mad!\" He was rebuffed,"
          ],
          "en.yusufali": [
            "Before them the People of Noah rejected (their messenger): they rejected Our servant, and said, \"Here is one possessed!\", and he was driven out."
          ],
          "fa.ansarian": [
            "پیش از آنان قوم نوح [پیامبران] را تکذیب کردند، پس بنده ما [نوح] را هم تکذیب کردند و گفتند: دیوانه است، و جن زده ای است [که آثاری از گزند جن در او می باشد.]"
          ],
          "fa.ayati": [
            "پيش از اينها قوم نوح تكذيب كرده بودند. بنده ما را تكذيب كردند و گفتند: ديوانه است. و به دشنامش راندند."
          ],
          "fa.bahrampour": [
            "پيش از آن قوم نوح تكذيب كردند و بنده‌ى ما را دروغگو خواندند و گفتند: ديوانه‌اى طرد شده [از اجتماع‌] است"
          ],
          "fa.fooladvand": [
            "پيش از آنان، قوم نوح [نيز] به تكذيب پرداختند و بنده ما را دروغزن خواندند و گفتند: «ديوانه‌اى است.» و [بسى‌] آزار كشيد."
          ],
          "fa.ghomshei": [
            "پیش از اینان هم قوم نوح بنده ما نوح را تکذیب کردند و گفتند: او مردی دیوانه است، و (با زجر و ستم بسیار که از آنها کشید از دعوت به حق) بازداشته شد."
          ],
          "fa.khorramdel": [
            "پیش از ایشان، قوم نوح، بنده‌ی ما (نوح) را تکذیب کردند (و دروغگویش نامیدند) و گفتند: دیوانه‌ای است و (از میان خردمندان) رانده شده است. [[«أُزْدُجِرَ»: رانده شده است. یعنی به عقیده سست کفار، نوح (ع) چون دیوانه است، عقلاء او را از میان خود رانده‌اند (نگا: التفسیر القرآنی للقرآن) یا جنیان و پریان بدو آسیب رسانده‌اند و از جامعه انسانیش رانده‌اند (نگا: روح‌البیان). یا این که: (وَازْدُجِرَ) جمله مستأنفه‌ای بوده و معنی چنین است: کافران نوح را از تبلیغ رسالت منع کردند و بازش داشتند و او هم چاره‌ای نداشت جز این که بجای تبلیغ به نجاری پردازد (نگا: هود / 36 و 37 و 38). اغلب تفاسیر بر عقیده دوم هستند.]]"
          ],
          "fa.khorramshahi": [
            "پیش از آنان قوم نوح انکار پیشه کردند و بنده ما را دروغ‌زن انگاشتند و گفتند دیوانه است و رانده شد"
          ],
          "fa.makarem": [
            "پیش از آنها قوم نوح تکذیب کردند، (آری) بنده ما (نوح) را تکذیب کرده و گفتند: «او دیوانه است!» و (با انواع آزارها از ادامه رسالتش) بازداشته شد."
          ],
          "fa.moezzi": [
            "تکذیب کردند پیش از ایشان قوم نوح پس تکذیب کردند بنده ما را و گفتند دیوانه است و آزرده شد"
          ],
          "fa.mojtabavi": [
            "پيش از اينان قوم نوح تكذيب كردند بنده ما را دروغگو شمردند و گفتند: ديوانه است. و [او از دعوت به حق‌] باز داشته شد- به سبب آزار و سنگ‌زدن و تهديد-."
          ],
          "fa.sadeqi": [
            "پیش از آنان، قوم نوح (نیز) به تکذیب پرداختند. پس بنده‌ی ما را تکذیب کردند و گفتند: «دیوانه‌ای است.‌» و بسی زجرکشیده."
          ]
        }
      },
      {
        "index": 4856,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:54:10",
        "text": [
          "فَدَعَا رَبَّهُ‌ أَنِّي‌ مَغْلُوبٌ‌ فَانْتَصِرْ"
        ],
        "translations": {
          "en.ahmedali": [
            "So he prayed to his Lord: \"I am helpless, deliver me.\""
          ],
          "en.ahmedraza": [
            "He therefore prayed to his Lord, “I am overpowered, therefore avenge me.”"
          ],
          "en.arberry": [
            "And so he called unto his Lord, saying, 'I am vanquished; do Thou succour me!'"
          ],
          "en.daryabadi": [
            "Thereupon he prayed Unto his Lord: verily am overcome, so vindicate me."
          ],
          "en.hilali": [
            "Then he invoked his Lord (saying): \"I have been overcome, so help (me)!\""
          ],
          "en.itani": [
            "So he appealed to his Lord, “I am overwhelmed, so help me.”"
          ],
          "en.maududi": [
            "Then he called upon His Lord: “Verily I am vanquished; so come You to my aid.”"
          ],
          "en.mubarakpuri": [
            "Then he invoked his Lord (saying): \"I have been overcome, so help (me)!\""
          ],
          "en.pickthall": [
            "So he cried unto his Lord, saying: I am vanquished, so give help."
          ],
          "en.qarai": [
            "Thereat he invoked his Lord, [saying,] ‘I have been overcome, so help [me].’"
          ],
          "en.qaribullah": [
            "Then he supplicated to his Lord, (saying): 'I am overcome, help me'"
          ],
          "en.sahih": [
            "So he invoked his Lord, \"Indeed, I am overpowered, so help.\""
          ],
          "en.sarwar": [
            "Noah prayed, \"Lord, help me; I am defeated\"."
          ],
          "en.shakir": [
            "Therefore he called upon his Lord: I am overcome, come Thou then to help."
          ],
          "en.transliteration": [
            "FadaAA<u>a</u> rabbahu annee maghloobun fa<b>i</b>nta<u>s</u>ir"
          ],
          "en.wahiduddin": [
            "so he cried out to his Lord, saying, \"I am overcome, so help me!\""
          ],
          "en.yusufali": [
            "Then he called on his Lord: \"I am one overcome: do Thou then help (me)!\""
          ],
          "fa.ansarian": [
            "پس پروردگارش را خواند که من مغلوب شده ام [و از ستم و زورگویی آنان دلتنگم] بنابراین انتقام [مرا از اینان] بگیر."
          ],
          "fa.ayati": [
            "و پروردگارش را خواند: من مغلوب شده‌ام، انتقام بكش."
          ],
          "fa.bahrampour": [
            "پس پروردگار خود را خواند كه: من مغلوبم پس انتقام گير"
          ],
          "fa.fooladvand": [
            "تا پروردگارش را خواند كه: «من مغلوب شدم؛ به داد من برس!»"
          ],
          "fa.ghomshei": [
            "تا آنکه به درگاه خدایش دعا کرد که من سخت مغلوب قوم شده‌ام تو مرا یاری فرما."
          ],
          "fa.khorramdel": [
            "تا آنجا که نوح پروردگار خود را بفریاد خواند (و عرض کرد:) پروردگارا! من شکست خورده‌ام پس مرا یاری و کمک فرما (و انتقام مرا از ایشان بگیر). [[«أَنِّی مَغْلُوبٌ ...»: اصل آن (بِأَنِّی مَغْلُوبٌ ...) است و منصوب به نزع خافض است.]]"
          ],
          "fa.khorramshahi": [
            "سپس پروردگارش را به دعا خواند که من درمانده‌ام [یاری کن و] انتقام [مرا] بگیر"
          ],
          "fa.makarem": [
            "او به درگاه پروردگار عرضه داشت: «من مغلوب (این قوم طغیانگر) شده‌ام، انتقام مرا از آنها بگیر!»"
          ],
          "fa.moezzi": [
            "پس خواند پروردگار خویش را که منم شکست‌خورده پس یاری کن‌"
          ],
          "fa.mojtabavi": [
            "پس پروردگار خويش را بخواند كه من شكست يافته‌ام، پس انتقام گير."
          ],
          "fa.sadeqi": [
            "پس پروردگارش را خواند که: «بسی مغلوب شده‌ام‌؛ پس بس یاری(ام) فرمای!»"
          ]
        }
      },
      {
        "index": 4857,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:54:11",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:44:31",
            "/books/al-kafi:8:1:44:30"
          ]
        },
        "text": [
          "فَفَتَحْنَا أَبْوَابَ‌ السَّمَاءِ بِمَاءٍ مُنْهَمِرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "And We opened up the flood gates of the sky with water pouring down in torrents,"
          ],
          "en.ahmedraza": [
            "We therefore opened the gates of heaven, with water flowing furiously."
          ],
          "en.arberry": [
            "Then We opened the gates of heaven unto water torrential,"
          ],
          "en.daryabadi": [
            "Then We opened the portals of heaven with water poured out."
          ],
          "en.hilali": [
            "So We opened the gates of heaven with water pouring forth."
          ],
          "en.itani": [
            "So We opened the floodgates of heaven with water pouring down."
          ],
          "en.maududi": [
            "Thereupon We opened the gates of the sky for water to pour down,"
          ],
          "en.mubarakpuri": [
            "So, We opened the gates of the heaven with water Munhamir."
          ],
          "en.pickthall": [
            "Then opened We the gates of heaven with pouring water"
          ],
          "en.qarai": [
            "Then We opened the gates of the sky with pouring waters,"
          ],
          "en.qaribullah": [
            "We opened the Gates of Heaven with torrential water"
          ],
          "en.sahih": [
            "Then We opened the gates of the heaven with rain pouring down"
          ],
          "en.sarwar": [
            "We opened the gates of the sky and water started to pour down."
          ],
          "en.shakir": [
            "So We opened the gates of the cloud with water pouring"
          ],
          "en.transliteration": [
            "Fafata<u>h</u>n<u>a</u> abw<u>a</u>ba a<b>l</b>ssam<u>a</u>i bim<u>a</u>in munhamir<b>in</b>"
          ],
          "en.wahiduddin": [
            "So We opened the gates of the sky with water pouring down in torrents,"
          ],
          "en.yusufali": [
            "So We opened the gates of heaven, with water pouring forth."
          ],
          "fa.ansarian": [
            "پس [در پاسخ درخواستش] درهای آسمان را به آبی بسیار فراوان و ریزان گشودیم،"
          ],
          "fa.ayati": [
            "و ما نيز درهاى آسمان را به روى آبى كه به شدت مى‌ريخت گشوديم."
          ],
          "fa.bahrampour": [
            "پس درهاى آسمان را به آبى سيل آسا گشوديم"
          ],
          "fa.fooladvand": [
            "پس درهاى آسمان را به آبى ريزان گشوديم."
          ],
          "fa.ghomshei": [
            "ما هم درهای آسمان گشودیم و سیلابی از آسمان فرو ریختیم."
          ],
          "fa.khorramdel": [
            "پس درهای آسمان را با آب تند ریزان و فراوانی از هم گشودیم. (بگونه‌ای که گوئی درهای آسمان همه باز شده و هر چه آب است فرو می‌بارد). [[«بِمَآءٍ»: حرف (ب) برای استعانت یا ملابست است. یعنی با ابزاری که آب نام داشت و یا به همراه آب. «مُنْهَمِرٍ»: تند بارنده. سخت ریزان. زیاد و فراوان.]]"
          ],
          "fa.khorramshahi": [
            "آنگاه درهای آسمان را به آبی سیل‌آسا گشودیم‌"
          ],
          "fa.makarem": [
            "در این هنگام درهای آسمان را با آبی فراوان و پی‌درپی گشودیم؛"
          ],
          "fa.moezzi": [
            "پس گشودیم درهای آسمان را به آبی ریزنده‌"
          ],
          "fa.mojtabavi": [
            "پس درهاى آسمان را به آبى ريزان بگشاديم."
          ],
          "fa.sadeqi": [
            "پس درهای آسمان را به آبی بس ریزان و فراوان (بر سروسامانشان) گشودیم."
          ]
        }
      },
      {
        "index": 4858,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:54:12",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:44:31",
            "/books/al-kafi:8:1:44:30"
          ]
        },
        "text": [
          "وَ فَجَّرْنَا الْأَرْضَ‌ عُيُوناً فَالْتَقَى‌ الْمَاءُ عَلَى‌ أَمْرٍ قَدْ قُدِرَ"
        ],
        "translations": {
          "en.ahmedali": [
            "And We opened up the springs of the earth; and the waters met for a decreed end."
          ],
          "en.ahmedraza": [
            "And caused springs to gush out from the earth, so that the two waters met totalling a quantity that had been destined."
          ],
          "en.arberry": [
            "and made the earth to gush with fountains, and the waters met for a matter decreed."
          ],
          "en.daryabadi": [
            "And We made the earth break forth with springs; SO that the water met for an affair already decreed."
          ],
          "en.hilali": [
            "And We caused the earth to gush forth with springs. So the waters (of the heaven and the earth) met for a matter predestined."
          ],
          "en.itani": [
            "And We made the earth burst with springs, and the waters met for a purpose already destined."
          ],
          "en.maududi": [
            "and We made the earth burst forth with springs, and all this water converged to fulfil that which had been decreed."
          ],
          "en.mubarakpuri": [
            "And We caused springs to gush forth from the earth. So, the waters met for a matter predestined."
          ],
          "en.pickthall": [
            "And caused the earth to gush forth springs, so that the waters met for a predestined purpose."
          ],
          "en.qarai": [
            "and We made the earth burst forth with springs, and the waters met for a preordained purpose."
          ],
          "en.qaribullah": [
            "and caused the earth to gush with springs, so that the waters met for a predestined matter."
          ],
          "en.sahih": [
            "And caused the earth to burst with springs, and the waters met for a matter already predestined."
          ],
          "en.sarwar": [
            "We caused the earth to burst forth with springs so that the waters could come together for a predestined purpose."
          ],
          "en.shakir": [
            "And We made water to flow forth in the land in springs, so the water gathered together according to a measure already ordained."
          ],
          "en.transliteration": [
            "Wafajjarn<u>a</u> alar<u>d</u>a AAuyoonan fa<b>i</b>ltaq<u>a</u> alm<u>a</u>o AAal<u>a</u> amrin qad qudir<b>a</b>"
          ],
          "en.wahiduddin": [
            "and We caused the earth to burst with gushing springs: so that the waters met for a purpose which had been decreed."
          ],
          "en.yusufali": [
            "And We caused the earth to gush forth with springs, so the waters met (and rose) to the extent decreed."
          ],
          "fa.ansarian": [
            "و زمین را به [جوشیدن] چشمه هایی [پر آب] شکافتیم؛ پس آبِ آسمان و زمین برای کاری که مقدّر شده بود به هم پیوستند،"
          ],
          "fa.ayati": [
            "و از زمين چشمه‌ها شكافتيم تا آب به آن مقدار كه مقدر شده بود گرد آمد."
          ],
          "fa.bahrampour": [
            "و زمين را به صورت چشمه‌هايى شكافتيم تا آب [زمين و آسمان‌] براى امرى كه تقدير شده بود به هم پيوست"
          ],
          "fa.fooladvand": [
            "و از زمين چشمه‌ها جوشانيديم تا آب [زمين و آسمان‌] براى امرى كه مقدّر شده بود به هم پيوستند."
          ],
          "fa.ghomshei": [
            "و در زمین چشمه‌ها جاری ساختیم تا آب آسمان و زمین با هم به طوفانی که مقدّر حتمی بود اجتماع یافت."
          ],
          "fa.khorramdel": [
            "و از زمین چشمه‌ساران زیادی برجوشاندیم (بگونه‌ای که گوئی تمام زمین یکپارچه به چشمه تبدیل شده است) و آبها در هم آمیختند، برای اجرای فرمانی که (از جانب خدا صادر و) مقدّر شده بود. [[«عُیُوناً»: جمع عَین، چشمه‌ها. تمییز است. «إِلْتَقَی»: بهم رسید. در هم آمیخت. مراد مخلوط شدن آبهای آسمان، و زمین و نواحی مختلف آن است. «الْمَآءُ»: جنس آب مراد است. «عَلی أَمْرٍ ...»: واژه (عَلی) به معنی لام تعلیل است، یعنی بخاطر (نگا: المصحف المیسر). مراد از (أَمْرٍ) غرق کردن قوم طاغی و یاغی نوح است. «قُدِرَ»: اندازه‌گیری شده بود. معین و مقدر گشته بود.]]"
          ],
          "fa.khorramshahi": [
            "و از زمین چشمه‌هایی بر شکافتیم، سپس آب [بسیار] برای کاری که مقدر بود، به هم بر آمد"
          ],
          "fa.makarem": [
            "و زمین را شکافتیم و چشمه‌های زیادی بیرون فرستادیم؛ و این دو آب به اندازه مقدّر با هم درآمیختند (و دریای وحشتناکی شد)!"
          ],
          "fa.moezzi": [
            "و بشکافتیم زمین را چشمه‌هائی پس به هم پیوستند آبها بر کاری مقدّرشده‌"
          ],
          "fa.mojtabavi": [
            "و زمين را به چشمه‌هاى روان بشكافتيم پس آب [آسمان و زمين‌] بر كارى مقدر فراهم آمد."
          ],
          "fa.sadeqi": [
            "و زمین را با انفجاری سراسری تبدیل به چشمه‌هایی کردیم. پس آب (فراگیر) بر کاری که به‌راستی مقدر شده بود در رسید."
          ]
        }
      },
      {
        "index": 4859,
        "local_index": 13,
        "part_type": "Verse",
        "path": "/books/quran:54:13",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:44:31",
            "/books/al-kafi:8:1:44:30"
          ]
        },
        "text": [
          "وَ حَمَلْنَاهُ‌ عَلَى‌ ذَاتِ‌ أَلْوَاحٍ‌ وَ دُسُرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "But We bore him on a (vessel made) of planks and oakum,"
          ],
          "en.ahmedraza": [
            "And We carried Nooh upon a ship of wooden planks and nails."
          ],
          "en.arberry": [
            "And We bore him upon a well-planked vessel well-caulked"
          ],
          "en.daryabadi": [
            "And We bare him on a thing of planks and nails."
          ],
          "en.hilali": [
            "And We carried him on a (ship) made of planks and nails,"
          ],
          "en.itani": [
            "And We carried him on a craft of planks and nails."
          ],
          "en.maududi": [
            "And We bore Noah on the vessel built of planks and nails,"
          ],
          "en.mubarakpuri": [
            "And We carried him on a (ship) made of planks and nails (Dusur)"
          ],
          "en.pickthall": [
            "And We carried him upon a thing of planks and nails,"
          ],
          "en.qarai": [
            "We bore him on a vessel made of planks and nails,"
          ],
          "en.qaribullah": [
            "We carried him in a well built, watertight vessel made from planks (of wood)"
          ],
          "en.sahih": [
            "And We carried him on a [construction of] planks and nails,"
          ],
          "en.sarwar": [
            "We carried him, (Noah), on a vessel built with boards fixed together with nails,"
          ],
          "en.shakir": [
            "And We bore him on that which was made of planks and nails"
          ],
          "en.transliteration": [
            "Wa<u>h</u>amaln<u>a</u>hu AAal<u>a</u> <u>tha</u>ti alw<u>ah</u>in wadusur<b>in</b>"
          ],
          "en.wahiduddin": [
            "We bore him on an [ark] which, made of planks and nails,"
          ],
          "en.yusufali": [
            "But We bore him on an (Ark) made of broad planks and caulked with palm-fibre:"
          ],
          "fa.ansarian": [
            "و او را بر کشتی که دارای تخته ها و میخ ها بود سوار کردیم،"
          ],
          "fa.ayati": [
            "و او را بر آن كشتى كه تخته‌ها و ميخها داشت سوار كرديم."
          ],
          "fa.bahrampour": [
            "و او را بر [كشتى ساخته شده‌] از تخته‌ها و ميخ‌ها حمل كرديم"
          ],
          "fa.fooladvand": [
            "و او را بر [كشتى‌] تخته‌دار و ميخ‌آجين سوار كرديم."
          ],
          "fa.ghomshei": [
            "و نوح را در کشتی محکم اساس برنشاندیم."
          ],
          "fa.khorramdel": [
            "و نوح را بر کشتی ساخته شده از تخته‌ها و میخها، سوار کردیم. [[«ذَاتِ»: دارای. «أَلْوَاحٍ»: جمع لَوْح، تخته‌ها. «دُسُرٍ»: جمع دِسار، میخها.]]"
          ],
          "fa.khorramshahi": [
            "و او [نوح‌] را بر [کشتی‌] ساخته و پرداخته از تخته‌ها و میخها سوار کردیم‌"
          ],
          "fa.makarem": [
            "و او را بر مرکبی از الواح و میخهایی ساخته شده سوار کردیم؛"
          ],
          "fa.moezzi": [
            "و سوارش کردیم بر دارنده تخته‌ها و میخهائی‌"
          ],
          "fa.mojtabavi": [
            "و او را بر [كشتى‌] داراى تخته‌ها و ميخها سوار كرديم"
          ],
          "fa.sadeqi": [
            "و او را بر (کشتیِ) دارای الوارهای میخ‌آجین سوار کردیم."
          ]
        }
      },
      {
        "index": 4860,
        "local_index": 14,
        "part_type": "Verse",
        "path": "/books/quran:54:14",
        "text": [
          "تَجْرِي‌ بِأَعْيُنِنَا جَزَاءً لِمَنْ‌ کَانَ‌ کُفِرَ"
        ],
        "translations": {
          "en.ahmedali": [
            "Which sailed right under Our eyes: A recompense for him who had been denied."
          ],
          "en.ahmedraza": [
            "Sailing in front of Our sight; as a reward for the sake of one who was rejected."
          ],
          "en.arberry": [
            "running before Our eyes-a recompense for him denied."
          ],
          "en.daryabadi": [
            "Moving forward under Our eyes: a requital for him who had been rejected."
          ],
          "en.hilali": [
            "Floating under Our Eyes, a reward for him who had been rejected!"
          ],
          "en.itani": [
            "Sailing before Our eyes; a reward for him who was rejected."
          ],
          "en.maududi": [
            "which sailed on under Our supervision: a reward for him who had been shown ingratitude."
          ],
          "en.mubarakpuri": [
            "Floating under Our Eyes, a reward for him who had been rejected!"
          ],
          "en.pickthall": [
            "That ran (upon the waters) in Our sight, as a reward for him who was rejected."
          ],
          "en.qarai": [
            "which sailed [over the flood waters] in Our sight, as a retribution for him who was met with disbelief."
          ],
          "en.qaribullah": [
            "that ran on under Our Eyes, a recompense for him because he had been disbelieved."
          ],
          "en.sahih": [
            "Sailing under Our observation as reward for he who had been denied."
          ],
          "en.sarwar": [
            "which floated on the water before Our very eyes. The flood was a recompense for the deeds of the disbelievers."
          ],
          "en.shakir": [
            "Sailing, before Our eyes, a reward for him who was denied."
          ],
          "en.transliteration": [
            "Tajree biaAAyunin<u>a</u> jaz<u>a</u>an liman k<u>a</u>na kufir<b>a</b>"
          ],
          "en.wahiduddin": [
            "floated on under Our eyes: a vindication of him who had been rejected."
          ],
          "en.yusufali": [
            "She floats under our eyes (and care): a recompense to one who had been rejected (with scorn)!"
          ],
          "fa.ansarian": [
            "که زیر نظر ما روان بود. [و این] پاداشی بود برای کسی که مورد تکذیب قرار گرفته بود."
          ],
          "fa.ayati": [
            "زير نظر ما روان شد. اين بود جزاى كسانى كه كفر ورزيدند."
          ],
          "fa.bahrampour": [
            "[كشتى‌] زير نظر ما مى‌رفت، [اين‌] پاداش كسى بود كه مورد انكار واقع شده بود"
          ],
          "fa.fooladvand": [
            "[كشتى‌] زير نظر ما روان بود. [اين‌] پاداش كسى بود كه مورد انكار واقع شده بود."
          ],
          "fa.ghomshei": [
            "که آن کشتی با نظر و حفظ و عنایت ما روان می‌گشت (و چنین کردیم) تا به نوح که مورد کفر و انکار قوم قرار گرفت پاداش دهیم."
          ],
          "fa.khorramdel": [
            "این کشتی تحت مراقبت و مواظبت ما حرکت می‌کرد، برای پاداش دادن به کسی که بدو ایمان آورده نشده بود و تصدیق نگشته بود (و نعمت وجود او کفران شده بود). [[«بِأَعْیُنِنَا»: (نگا: هود / 37، مؤمنون / 27، طور / 48). «جَزَآءً»: برای پاداش به. مفعول له است. «مَنْ»: مراد نوح (ع) است. «کَانَ کُفِرَ»: نسبت بدو کفر ورزیده شده بود. بدو ایمان آورده نشده بود. تصدیق نگشته بود. نعمت وجودش ناسپاس مانده بود و کفران شده بود.]]"
          ],
          "fa.khorramshahi": [
            "که زیر نظر ما روان بود، این پاداش کسی بود که به او ناسپاسی کرده بودند"
          ],
          "fa.makarem": [
            "مرکبی که زیر نظر ما حرکت می‌کرد! این کیفری بود برای کسانی که (به او) کافر شده بودند!"
          ],
          "fa.moezzi": [
            "روان می‌شد پیش چشم ما پاداشی برای آنکه کفران شد"
          ],
          "fa.mojtabavi": [
            "كه به ديدار ما- زير نظر ما- مى‌رفت، تا پاداش كسى باشد كه به او كافر شدند- يعنى نوح"
          ],
          "fa.sadeqi": [
            "حال آنکه (کشتی) زیر نظرهای (علم و توان و حکمت) ما روان است. (این) پاداش کسی بود که مورد انکار واقع شده بود."
          ]
        }
      },
      {
        "index": 4861,
        "local_index": 15,
        "part_type": "Verse",
        "path": "/books/quran:54:15",
        "text": [
          "وَ لَقَدْ تَرَکْنَاهَا آيَةً فَهَلْ‌ مِنْ‌ مُدَّکِرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "And We left it as a sign. Is there anyone who will be warned?"
          ],
          "en.ahmedraza": [
            "And We left it as a sign – so is there one who would ponder?"
          ],
          "en.arberry": [
            "And We left it for a sign. Is there any that will remember?"
          ],
          "en.daryabadi": [
            "And assuredly We left it for a sign. Is there then anyone who would be admonished?"
          ],
          "en.hilali": [
            "And indeed, We have left this as a sign, then is there any that will remember (or receive admonition)?"
          ],
          "en.itani": [
            "And We left it as a sign. Is there anyone who would take heed?"
          ],
          "en.maududi": [
            "And We left the Ark as a Sign. Is there, then, any who will take heed?"
          ],
          "en.mubarakpuri": [
            "And indeed, We have left this as a sign. Then is there any that will remember"
          ],
          "en.pickthall": [
            "And verily We left it as a token; but is there any that remembereth?"
          ],
          "en.qarai": [
            "Certainly We have left it as a sign; so is there anyone who will be admonished?"
          ],
          "en.qaribullah": [
            "We have left it as a sign. Is there any that will remember?"
          ],
          "en.sahih": [
            "And We left it as a sign, so is there any who will remember?"
          ],
          "en.sarwar": [
            "We made (the story of Noah) as evidence of the Truth. However, is there anyone who would take heed?"
          ],
          "en.shakir": [
            "And certainly We left it as a sign, but is there anyone who"
          ],
          "en.transliteration": [
            "Walaqad tarakn<u>a</u>h<u>a</u> <u>a</u>yatan fahal min muddakir<b>in</b>"
          ],
          "en.wahiduddin": [
            "We have left this as a sign: but will anyone take heed?"
          ],
          "en.yusufali": [
            "And We have left this as a Sign (for all time): then is there any that will receive admonition?"
          ],
          "fa.ansarian": [
            "و بی تردید آن سرگذشت را [برای آیندگان] مایه پند و عبرت باقی گذاشتیم، پس آیا پند گیرنده ای هست؟"
          ],
          "fa.ayati": [
            "و هر آينه آن كشتى را نشانه‌اى ساختيم. آيا هيچ پندگيرنده‌اى هست؟"
          ],
          "fa.bahrampour": [
            "و به راستى آن [سفينه‌] را بر جاى نهاديم تا عبرتى باشد، پس آيا پند گيرنده‌اى هست"
          ],
          "fa.fooladvand": [
            "و به راستى آن [سفينه‌] را بر جاى نهاديم [تا] عبرتى [باشد]؛ پس آيا پندگيرنده‌اى هست؟"
          ],
          "fa.ghomshei": [
            "و آن کشتی را محفوظ داشتیم تا آیت عبرت خلق شود، آیا کسی هست که از آن پند گیرد؟"
          ],
          "fa.khorramdel": [
            "ما این داستان را (که بیانگر غرق شدن کافران و نجات مؤمنان است) به عنوان درس عبرتی (در میان ملّتها) باقی گذاردیم. آیا هیچ پندگیرنده‌ای هست؟ [[«تَرَکْنَاهَا»: برجایش گذاشتیم. آن را باقی گذاردیم. مرجع ضمیر (ها) قصه طوفان نوح است. برخی مرجع آن را (سَفینَة) دانسته و معتقدند که در کوههای آرارات تا صدر اسلام و بلکه تا به امروز، تخته پاره‌هائی از این کشتی مانده است. «آیَةً»: عبرت. پند. حال یا مفعول دوم است. «مُدَّکِرٍ»: پند گیرنده. عبرت گیرنده. اسم فاعل باب افتعال (ذکر) است (نگا: یوسف / 45).]]"
          ],
          "fa.khorramshahi": [
            "و به راستی آن را به عنوان مایه عبرت باقی گذاردیم، پس آیا پندپذیری هست؟"
          ],
          "fa.makarem": [
            "ما این ماجرا را بعنوان نشانه‌ای در میان امّتها باقی گذاردیم؛ آیا کسی هست که پند گیرد؟!"
          ],
          "fa.moezzi": [
            "و همانا گذاردیم آن را آیتی پس آیا هست یادآورنده‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه آن"
          ],
          "fa.sadeqi": [
            "و به‌راستی آن (سفینه) را بی‌چون (بر جایی) نهادیم (تا) عبرتی مستمر (باشد)؛ پس آیا هیچ پندگیرنده‌ای هست‌؟"
          ]
        }
      },
      {
        "index": 4862,
        "local_index": 16,
        "part_type": "Verse",
        "path": "/books/quran:54:16",
        "text": [
          "فَکَيْفَ‌ کَانَ‌ عَذَابِي‌ وَ نُذُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "How was then My punishment and My commination!"
          ],
          "en.ahmedraza": [
            "So how did My punishment turn out, and My threats?"
          ],
          "en.arberry": [
            "How then were My chastisement and My warnings?"
          ],
          "en.daryabadi": [
            "So how dreadful have been My torment and My warning!"
          ],
          "en.hilali": [
            "Then how (terrible) was My Torment and My Warnings?"
          ],
          "en.itani": [
            "So how were My punishment and My warnings?"
          ],
          "en.maududi": [
            "So how awesome were My chastisement and My warnings!"
          ],
          "en.mubarakpuri": [
            "Then how (terrible) was My torment and My warnings"
          ],
          "en.pickthall": [
            "Then see how (dreadful) was My punishment after My warnings!"
          ],
          "en.qarai": [
            "So how were My punishment and warnings?"
          ],
          "en.qaribullah": [
            "How then were My punishment and My warnings!"
          ],
          "en.sahih": [
            "And how [severe] were My punishment and warning."
          ],
          "en.sarwar": [
            "How terrible was My torment and the result of (their disregard) of My warning."
          ],
          "en.shakir": [
            "How (great) was then My punishment and My warning!"
          ],
          "en.transliteration": [
            "Fakayfa k<u>a</u>na AAa<u>tha</u>bee wanu<u>th</u>ur<b>i</b>"
          ],
          "en.wahiduddin": [
            "How terrible then was My punishment and My warning."
          ],
          "en.yusufali": [
            "But how (terrible) was My Penalty and My Warning?"
          ],
          "fa.ansarian": [
            "پس عذاب و هشدارهایم چگونه بود؟"
          ],
          "fa.ayati": [
            "پس عذاب و بيم‌دادنهاى من چگونه بود؟"
          ],
          "fa.bahrampour": [
            "پس چگونه بود عذاب من و هشدارهاى من"
          ],
          "fa.fooladvand": [
            "پس چگونه بود عذاب من و هشدارها[ى من‌]؟"
          ],
          "fa.ghomshei": [
            "پس (ای بدکاران عالم بنگرید که) سختی عذاب و تنبیه من چگونه بود!"
          ],
          "fa.khorramdel": [
            "آیا عذاب و عقاب من، و بیم دادنها و برحذر داشتنهای من چگونه بوده است؟! (آیا واقعیّت داشته است، و یا افسانه بوده است؟). [[«فَکَیْفَ کَانَ ...»: آیه برای تهدید کافرانی است که راه کفار زمان نوح را می‌سپردند. استفهام برای دریافت اقرار از مخاطبان است. «نُذُرِی»: (نگا: قمر / 5). ضمیر متکلم (ی) برای تخفیف حذف شده است.]]"
          ],
          "fa.khorramshahi": [
            "بنگر تا عذاب و هشدار من چگونه بود"
          ],
          "fa.makarem": [
            "(اکنون بنگرید) عذاب و انذارهای من چگونه بود!"
          ],
          "fa.moezzi": [
            "پس چگونه بود عذابم و ترسانیدنم‌"
          ],
          "fa.mojtabavi": [
            "پس [بنگر كه‌] عذاب و بيم‌دادن من چگونه بود؟"
          ],
          "fa.sadeqi": [
            "پس چگونه بود عذابم و هشداردهندگان (از سوی) من‌؟"
          ]
        }
      },
      {
        "index": 4863,
        "local_index": 17,
        "part_type": "Verse",
        "path": "/books/quran:54:17",
        "text": [
          "وَ لَقَدْ يَسَّرْنَا الْقُرْآنَ‌ لِلذِّکْرِ فَهَلْ‌ مِنْ‌ مُدَّکِرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "Easy have We made the Qur'an to understand: So is there any one who will be warned?"
          ],
          "en.ahmedraza": [
            "And We have indeed made the Qur’an easy to memorise, so is there one who would remember?"
          ],
          "en.arberry": [
            "Now We have made the Koran easy for Remembrance. Is there any that will remember?"
          ],
          "en.daryabadi": [
            "And assuredly We have made the Qur'an easy for admonition; is there then any one who would be admonished?"
          ],
          "en.hilali": [
            "And We have indeed made the Quran easy to understand and remember, then is there any that will remember (or receive admonition)?"
          ],
          "en.itani": [
            "We made the Quran easy to learn. Is there anyone who would learn?"
          ],
          "en.maududi": [
            "We have made this Qur'an easy as a reminder. Is there, then, any who will take heed?"
          ],
          "en.mubarakpuri": [
            "And We have indeed made the Qur'an easy to understand and remember; then is there anyone who will remember"
          ],
          "en.pickthall": [
            "And in truth We have made the Qur'an easy to remember; but is there any that remembereth?"
          ],
          "en.qarai": [
            "Certainly We have made the Quran simple for the sake of admonishment. So is there anyone who will be admonished?"
          ],
          "en.qaribullah": [
            "We have made the Koran easy to remember, is there any that will remember!"
          ],
          "en.sahih": [
            "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?"
          ],
          "en.sarwar": [
            "We have made the Quran easy to understand, but is there anyone who would pay attention?"
          ],
          "en.shakir": [
            "And certainly We have made the Quran easy for remembrance, but is there anyone who will mind?"
          ],
          "en.transliteration": [
            "Walaqad yassarn<u>a</u> alqur<u>a</u>na li<b>l</b><u>thth</u>ikri fahal min muddakir<b>in</b>"
          ],
          "en.wahiduddin": [
            "We have made it easy to learn lessons from the Quran. Is there anyone who would receive admonition?"
          ],
          "en.yusufali": [
            "And We have indeed made the Qur'an easy to understand and remember: then is there any that will receive admonition?"
          ],
          "fa.ansarian": [
            "و یقیناً ما قرآن را برای پند گرفتن آسان کردیم، پس آیا پند گیرنده ای هست؟"
          ],
          "fa.ayati": [
            "و اين قرآن را آسان ادا كرديم تا از آن پند گيرند. آيا پندگيرنده‌اى هست؟"
          ],
          "fa.bahrampour": [
            "و قطعا قرآن را براى پند آموزى آسان كرديم، پس آيا پند گيرنده‌اى هست"
          ],
          "fa.fooladvand": [
            "و قطعاً قرآن را براى پندآموزى آسان كرده‌ايم؛ پس آيا پندگيرنده‌اى هست؟"
          ],
          "fa.ghomshei": [
            "و ما قرآن را برای وعظ و اندرز بر فهم آسان کردیم آیا کسی هست که از آن پند گیرد؟"
          ],
          "fa.khorramdel": [
            "ما قرآن را برای یاددادن ویادگرفتن وپنددادن وپندگرفتن آسان ساخته‌ایم، آیا پند پذیرنده و عبرت گیرنده‌ای هست؟ [[«یَسَّرْنا»: ساده نموده‌ایم. آسان ساخته‌ایم. یعنی قرآن لغز و چیستان نبوده و پیچیدگی ندارد و به سادگی قابل آموزش است و تأثیر عمیق و شگفت‌انگیزی نیز در دلهای آماده دارد. «الذِّکْرِ»: یاد کردن. پند دادن و پند گرفتن.]]"
          ],
          "fa.khorramshahi": [
            "و به راستی قرآن را قابل پند گیری گرداندیم، پس آیا پندپذیری هست؟"
          ],
          "fa.makarem": [
            "ما قرآن را برای تذکّر آسان ساختیم؛ آیا کسی هست که متذکّر شود؟!"
          ],
          "fa.moezzi": [
            "و همانا آسان ساختیم قرآن را برای یادآوردن پس آیا هست یادآورنده‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه قرآن را براى يادآورى و پندگرفتن آسان ساختيم، پس آيا يادآرنده و پندگيرنده‌اى هست؟"
          ],
          "fa.sadeqi": [
            "و قرآن را بی‌گمان برای هشداری آسان کردیم. پس آیا هیچ پندگیرنده‌ای هست‌؟"
          ]
        }
      },
      {
        "index": 4864,
        "local_index": 18,
        "part_type": "Verse",
        "path": "/books/quran:54:18",
        "text": [
          "کَذَّبَتْ‌ عَادٌ فَکَيْفَ‌ کَانَ‌ عَذَابِي‌ وَ نُذُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "The 'Ad had also disavowed. How was then My punishment and My commination!"
          ],
          "en.ahmedraza": [
            "The tribe of A’ad denied – so how did My punishment turn out, and My warnings?"
          ],
          "en.arberry": [
            "Ad cried lies. How then were My chastisement and My warnings?"
          ],
          "en.daryabadi": [
            "And there belied the 'A-ad; so how dreadful have been My torment and warning!"
          ],
          "en.hilali": [
            "'Ad (people) belied (their Prophet, Hud), then how (terrible) was My Torment and My Warnings?"
          ],
          "en.itani": [
            "Aad denied the truth. So how were My punishment and My warnings?"
          ],
          "en.maududi": [
            "'Ad also gave the lie (to Hud). So how awesome were My chastisement and My warnings!"
          ],
          "en.mubarakpuri": [
            "`Ad denied; then how was My torment and My warnings"
          ],
          "en.pickthall": [
            "(The tribe of) A'ad rejected warnings. Then how (dreadful) was My punishment after My warnings."
          ],
          "en.qarai": [
            "[The people of] ‘Ad impugned [their apostle]. So how were My punishment and warnings?"
          ],
          "en.qaribullah": [
            "Aad too belied. How then were My punishment and My warnings!"
          ],
          "en.sahih": [
            "'Aad denied; and how [severe] were My punishment and warning."
          ],
          "en.sarwar": [
            "The people of `Ad rejected Our guidance. How terrible was My torment and the result (of their disregard) of My warning."
          ],
          "en.shakir": [
            "Ad treated (the truth) as a lie, so how (great) was My punishment and My warning!"
          ],
          "en.transliteration": [
            "Ka<u>thth</u>abat AA<u>a</u>dun fakayfa k<u>a</u>na AAa<u>tha</u>bee wanu<u>th</u>ur<b>i</b>"
          ],
          "en.wahiduddin": [
            "The people of 'Ad too rejected the truth. How terrible was My punishment and My warning."
          ],
          "en.yusufali": [
            "The 'Ad (people) (too) rejected (Truth): then how terrible was My Penalty and My Warning?"
          ],
          "fa.ansarian": [
            "قوم عاد [پیامبرشان را] تکذیب کردند، پس عذاب و هشدارهایم چگونه بود؟"
          ],
          "fa.ayati": [
            "قوم عاد تكذيب كردند. پس عذاب و بيم‌دادنهاى من چگونه بود؟"
          ],
          "fa.bahrampour": [
            "عاديان [هود را] تكذيب كردند، پس چگونه بود عذاب من و هشدارهاى من"
          ],
          "fa.fooladvand": [
            "عاديان به تكذيب پرداختند. پس چگونه بود عذاب من و هشدارها[ى من‌]؟"
          ],
          "fa.ghomshei": [
            "قوم عاد نیز (پیغمبرشان هود را) تکذیب کردند، پس باز بنگرید که عذاب و تنبیه من چگونه سخت بود!"
          ],
          "fa.khorramdel": [
            "قوم عاد (هم پیغمبر خود، هود را) تکذیب کردند. آیا عذاب و عقاب من، و بیم دادنها و برحذر داشتنهای من به چه منوالی بوده است؟! [[«عَادٌ»: (نگا: هود / 50). «نُذُرِی»: (نگا: قمر / 16).]]"
          ],
          "fa.khorramshahi": [
            "[قوم‌] عاد تکذیب کردند، بنگر تا عذاب و هشدار من چگونه بود"
          ],
          "fa.makarem": [
            "قوم عاد (نیز پیامبر خود را) تکذیب کردند؛ پس (ببینید) عذاب و انذارهای من چگونه بود!"
          ],
          "fa.moezzi": [
            "تکذیب کردند عاد پس چگونه بود عذاب من و ترسانیدنم‌"
          ],
          "fa.mojtabavi": [
            "قوم عاد [هود را] دروغگو انگاشتند پس [بنگر كه‌] عذاب و بيم‌دادن من چگونه بود؟"
          ],
          "fa.sadeqi": [
            "عادیان به تکذیب پرداختند. پس چگونه بود عذابم و هشداردهندگان (از سوی) من‌؟"
          ]
        }
      },
      {
        "index": 4865,
        "local_index": 19,
        "part_type": "Verse",
        "path": "/books/quran:54:19",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:22:1"
          ]
        },
        "text": [
          "إِنَّا أَرْسَلْنَا عَلَيْهِمْ‌ رِيحاً صَرْصَراً فِي‌ يَوْمِ‌ نَحْسٍ‌ مُسْتَمِرٍّ"
        ],
        "translations": {
          "en.ahmedali": [
            "We let loose against them a violent roaring wind on a day of ill omen, continuous,"
          ],
          "en.ahmedraza": [
            "We indeed sent towards them a severe windstorm, on a day the ill luck of which lasted upon them forever."
          ],
          "en.arberry": [
            "We loosed against them a wind clamorous in a day of ill fortune continuous,"
          ],
          "en.daryabadi": [
            "Verily We! We sent against them a raging Wind On a day of calamity continuous."
          ],
          "en.hilali": [
            "Verily, We sent against them a furious wind of harsh voice on a day of evil omen and continuous calamity."
          ],
          "en.itani": [
            "We unleashed upon them a screaming wind, on a day of unrelenting misery."
          ],
          "en.maududi": [
            "We sent a tumultuous wind against them on a day of unremitting misfortune,"
          ],
          "en.mubarakpuri": [
            "Verily, We sent against them a violently cold (Sarsar) wind on a day of calamity, continuous."
          ],
          "en.pickthall": [
            "Lo! We let loose on them a raging wind on a day of constant calamity,"
          ],
          "en.qarai": [
            "Indeed We unleashed upon them an icy gale on an incessantly ill-fated day,"
          ],
          "en.qaribullah": [
            "And We sent against them a howling wind in a Day of continuous of ill fortune"
          ],
          "en.sahih": [
            "Indeed, We sent upon them a screaming wind on a day of continuous misfortune,"
          ],
          "en.sarwar": [
            "On an unfortunate day We sent upon them a continuous violent wind"
          ],
          "en.shakir": [
            "Surely We sent on them a tornado in a day of bitter ill-luck"
          ],
          "en.transliteration": [
            "Inn<u>a</u> arsaln<u>a</u> AAalayhim ree<u>h</u>an <u>s</u>ar<u>s</u>aran fee yawmi na<u>h</u>sin mustamirr<b>in</b>"
          ],
          "en.wahiduddin": [
            "We sent a raging wind against them on a day of continuous calamity."
          ],
          "en.yusufali": [
            "For We sent against them a furious wind, on a Day of violent Disaster,"
          ],
          "fa.ansarian": [
            "ما بر آنان در روزی شوم که شومی اش استمرار داشت، تندبادی سخت و بسیار سرد [به عنوان عذاب] فرستادیم،"
          ],
          "fa.ayati": [
            "ما بر آنها در روزى نحس و طولانى بادى سخت فرستاديم،"
          ],
          "fa.bahrampour": [
            "همانا ما بر [سر] آنها تندبادى سوزان در روزى پيوسته شوم فرستاديم"
          ],
          "fa.fooladvand": [
            "ما بر [سر] آنان در روز شومى، به طور مداوم، تندبادى توفنده فرستاديم،"
          ],
          "fa.ghomshei": [
            "ما بر هلاک آنها تند بادی در روز نحسی پایدار فرستادیم."
          ],
          "fa.khorramdel": [
            "ما تندباد وحشتناک و سردی را در یک روز شومی که (هفت شب و هشت روز) ادامه داشت، بر آنان وزان و روان کردیم. [[«صَرْصَراً»: تند و سرد. پر سر و صدا و شدید. (نگا: فصّلت / 16). «یَوْمٍ»: مراد آغاز وزیدن طوفانِ بلا و شروع آن است. والاّ هفت شب و هشت روز طوفان باد دوام داشته است (نگا: حاقه / 7). یا این که مراد از (یَوْمٍ) مطلق زمان است (نگا: آلوسی).]]"
          ],
          "fa.khorramshahi": [
            "ما بر آنان بادی سخت سرد در روزی شوم دنباله‌دار فرو فرستادیم‌"
          ],
          "fa.makarem": [
            "ما تندباد وحشتناک و سردی را در یک روز شوم مستمر بر آنان فرستادیم..."
          ],
          "fa.moezzi": [
            "همانا فرستادیم بر ایشان تندبادی در روزی شوم پیوسته‌"
          ],
          "fa.mojtabavi": [
            "ما بر آنها باد سرد و سخت را در روزى پيوسته شوم فرستاديم."
          ],
          "fa.sadeqi": [
            "ما بی‌گمان بر (سر و سامان)شان در روز شومی، به طور مداوم، تند بادی سخت سردِ توفنده فرو فرستادیم،"
          ]
        }
      },
      {
        "index": 4866,
        "local_index": 20,
        "part_type": "Verse",
        "path": "/books/quran:54:20",
        "text": [
          "تَنْزِعُ‌ النَّاسَ‌ کَأَنَّهُمْ‌ أَعْجَازُ نَخْلٍ‌ مُنْقَعِرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "Which snatched away men as though they were palm trees pulled out by the roots."
          ],
          "en.ahmedraza": [
            "Smashing down men as if they were uprooted trunks of date palms."
          ],
          "en.arberry": [
            "plucking up men as if they were stumps of uprooted palm-trees."
          ],
          "en.daryabadi": [
            "Carrying men away as though they were trunks of palm-trees uprooted."
          ],
          "en.hilali": [
            "Plucking out men as if they were uprooted stems of date-palms."
          ],
          "en.itani": [
            "Plucking the people away, as though they were trunks of uprooted palm-trees."
          ],
          "en.maududi": [
            "which tore people away and hurled them as though they were trunks of uprooted palm-trees."
          ],
          "en.mubarakpuri": [
            "Plucking out men as if they were uprooted stems of date palms."
          ],
          "en.pickthall": [
            "Sweeping men away as though they were uprooted trunks of palm-trees."
          ],
          "en.qarai": [
            "knocking down people as if they were trunks of uprooted palm trees."
          ],
          "en.qaribullah": [
            "and snatched people up as though they were stumps of uprooted palmtrees."
          ],
          "en.sahih": [
            "Extracting the people as if they were trunks of palm trees uprooted."
          ],
          "en.sarwar": [
            "which hurled people around like uprooted trunks of palm-trees."
          ],
          "en.shakir": [
            "Tearing men away as if they were the trunks of palm-trees torn up."
          ],
          "en.transliteration": [
            "TanziAAu a<b>l</b>nn<u>a</u>sa kaannahum aAAj<u>a</u>zu nakhlin munqaAAir<b>in</b>"
          ],
          "en.wahiduddin": [
            "It swept people away as if they were trunks of uprooted palm trees."
          ],
          "en.yusufali": [
            "Plucking out men as if they were roots of palm-trees torn up (from the ground)."
          ],
          "fa.ansarian": [
            "که مردم را [از زمین] برمی کند [و بعد از آن عذاب،] گویی تنه های نخلی بودند که ریشه کن شده اند."
          ],
          "fa.ayati": [
            "كه مردمان را از زمين، همانند ريشه‌هاى از جاى‌كنده نخل، برمى‌كند."
          ],
          "fa.bahrampour": [
            "[كه‌] مردم را از جا مى‌كند، گويى تنه‌هاى نخلى بودند كه ريشه كن شده‌اند"
          ],
          "fa.fooladvand": [
            "[كه‌] مردم را از جا مى‌كند؛ گويى تنه‌هاى نخلى بودند كه ريشه‌كن شده بودند."
          ],
          "fa.ghomshei": [
            "که آن باد مردم را از جا بر می‌کند چنانکه ساق درخت خرما از ریشه افکنند."
          ],
          "fa.khorramdel": [
            "بادی که مردمان را از زمین برمی‌داشت، بگونه‌ای که گوئی تنه‌های درختان خرمائی هستند که از جا کنده شده باشند. [[«تَنزِعُ»: برمی‌داشت. از جا بر می‌کند. «أَعْجَازُ»: جمع عَجُز، تنه‌ها. «مُنْقَعِرٍ»: از ریشه کنده شده. قلع شده. «کَأَنَّهُمْ أَعْجازُ نَخْلٍ ...»: مردمان آن روزی به سبب قد بلندی که داشته‌اند، به تنه درختان خرما تشبیه شده‌اند.]]"
          ],
          "fa.khorramshahi": [
            "که مردمان را از جا می‌کند، گویی که ایشان خرمابنان ریشه‌کن شده‌اند"
          ],
          "fa.makarem": [
            "که مردم را همچون تنه‌های نخل ریشه‌کن شده از جا برمی‌کند!"
          ],
          "fa.moezzi": [
            "برمی‌انداخت مردم را گوئیا آنانند بنهای نخلهای کنده‌شده‌"
          ],
          "fa.mojtabavi": [
            "مردمان را برمى‌كند، گويى كه آنها خرمابنهايى بودند از بيخ بركنده شده."
          ],
          "fa.sadeqi": [
            "(که) مردم را از جای می‌کَنَد؛ گویی تنه‌های نخلی بودند که ریشه کن شده‌اند."
          ]
        }
      },
      {
        "index": 4867,
        "local_index": 21,
        "part_type": "Verse",
        "path": "/books/quran:54:21",
        "text": [
          "فَکَيْفَ‌ کَانَ‌ عَذَابِي‌ وَ نُذُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "How was then My punishment and My commination!"
          ],
          "en.ahmedraza": [
            "So how did My punishment turn out, and My warnings?"
          ],
          "en.arberry": [
            "How then were My chastisement and My warnings?"
          ],
          "en.daryabadi": [
            "So how dreodful have been My torment and My warning."
          ],
          "en.hilali": [
            "Then, how (terrible) was My Torment and My Warnings?"
          ],
          "en.itani": [
            "So how were My punishment and My warnings?"
          ],
          "en.maududi": [
            "So how awesome were My chastisement and My warnings!"
          ],
          "en.mubarakpuri": [
            "Then, how was My torment and My warnings"
          ],
          "en.pickthall": [
            "Then see how (dreadful) was My punishment after My warnings!"
          ],
          "en.qarai": [
            "So how were My punishment and warnings?!"
          ],
          "en.qaribullah": [
            "How then were My punishment and My warnings!"
          ],
          "en.sahih": [
            "And how [severe] were My punishment and warning."
          ],
          "en.sarwar": [
            "How terrible was Our torment and the result of (their disregard) of Our warning."
          ],
          "en.shakir": [
            "How (great) was then My punishment and My warning!"
          ],
          "en.transliteration": [
            "Fakayfa k<u>a</u>na AAa<u>tha</u>bee wanu<u>th</u>ur<b>i</b>"
          ],
          "en.wahiduddin": [
            "How [dreadful] was My punishment and My warning!"
          ],
          "en.yusufali": [
            "Yea, how (terrible) was My Penalty and My Warning!"
          ],
          "fa.ansarian": [
            "پس عذاب و هشدارهایم چگونه بود؟"
          ],
          "fa.ayati": [
            "عذاب و بيم‌دادنهاى من چگونه بود؟"
          ],
          "fa.bahrampour": [
            "پس [بنگر] چگونه بود عذاب من و هشدارهاى من"
          ],
          "fa.fooladvand": [
            "پس چگونه بود عذاب من و هشدارها[ى من‌]؟"
          ],
          "fa.ghomshei": [
            "پس باز بنگرید که عذاب و تنبیه من چگونه سخت بود!"
          ],
          "fa.khorramdel": [
            "آیا عذاب و عقاب من، و بیم دادنها و برحذر داشتنهای من (درباره‌ی مخالفان) چگونه و به چه منوالی بوده است؟!"
          ],
          "fa.khorramshahi": [
            "بنگر تا عذاب و هشدار من چگونه بود"
          ],
          "fa.makarem": [
            "پس (ببینید) عذاب و انذارهای من چگونه بود!"
          ],
          "fa.moezzi": [
            "پس چگونه بود عذاب من و ترسانیدنم‌"
          ],
          "fa.mojtabavi": [
            "پس [بنگر كه‌] عذاب و بيم‌دادن من چگونه بود؟"
          ],
          "fa.sadeqi": [
            "پس چگونه بود عذاب من و هشداردهندگان (از سوی) من‌؟"
          ]
        }
      },
      {
        "index": 4868,
        "local_index": 22,
        "part_type": "Verse",
        "path": "/books/quran:54:22",
        "text": [
          "وَ لَقَدْ يَسَّرْنَا الْقُرْآنَ‌ لِلذِّکْرِ فَهَلْ‌ مِنْ‌ مُدَّکِرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "Easy have We made the Qur'an to understand: So is there any one who will pay heed?"
          ],
          "en.ahmedraza": [
            "And We have indeed made the Qur’an easy to memorise, so is there one who would remember?"
          ],
          "en.arberry": [
            "Now We have made the Koran easy for Remembrance. Is there any that will remember?"
          ],
          "en.daryabadi": [
            "And assuredly We have made the Qur'an easy for admonition; is therethen any one who would be admonished!"
          ],
          "en.hilali": [
            "And We have indeed made the Quran easy to understand and remember, then is there any that will remember (or receive admonition)?"
          ],
          "en.itani": [
            "We made the Quran easy to remember. Is there anyone who would remember?"
          ],
          "en.maududi": [
            "We have made the Qur'an easy to derive lessons from. Is there, then, any who will take heed?"
          ],
          "en.mubarakpuri": [
            "And We have indeed made the Qur'an easy to understand and remember; then is there any that will remember"
          ],
          "en.pickthall": [
            "And in truth We have made the Qur'an easy to remember; but is there any that remembereth?"
          ],
          "en.qarai": [
            "Certainly We have made the Quran simple for the sake of admonishment. So is there anyone who will be admonished?"
          ],
          "en.qaribullah": [
            "We have made the Koran easy to remember, is there any that will remember?"
          ],
          "en.sahih": [
            "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?"
          ],
          "en.sarwar": [
            "We have made the Quran easy to understand, but is there anyone who would pay attention?"
          ],
          "en.shakir": [
            "And certainly We have made the Quran easy for remembrance, but is there anyone who will mind?"
          ],
          "en.transliteration": [
            "Walaqad yassarn<u>a</u> alqur<u>a</u>na li<b>l</b><u>thth</u>ikri fahal min muddakir<b>in</b>"
          ],
          "en.wahiduddin": [
            "We have made it easy to learn lessons from the Quran: is there anyone who would receive admonition?"
          ],
          "en.yusufali": [
            "But We have indeed made the Qur'an easy to understand and remember: then is there any that will receive admonition?"
          ],
          "fa.ansarian": [
            "و یقیناً ما قرآن را برای پند گرفتن آسان کردیم، پس آیا پند گیرنده ای هست؟"
          ],
          "fa.ayati": [
            "و اين قرآن را آسان ادا كرديم تا از آن پند گيرند. آيا پندگيرنده‌اى هست؟"
          ],
          "fa.bahrampour": [
            "و قطعا قرآن را براى پندآموزى آسان كرديم، پس آيا پند گيرنده‌اى هست"
          ],
          "fa.fooladvand": [
            "و قطعاً قرآن را براى پندآموزى آسان كرده‌ايم، پس آيا پندگيرنده‌اى هست؟"
          ],
          "fa.ghomshei": [
            "و ما قرآن را برای وعظ و اندرز بر فهم آسان کردیم آیا کسی هست که از آن پند گیرد؟"
          ],
          "fa.khorramdel": [
            "ما قرآن را برای یاددادن ویادگرفتن وپنددادن وپندگرفتن ساده و آسان ساخته‌ایم، آیا پندپذیرنده و عبرت‌گیرنده ای هست؟"
          ],
          "fa.khorramshahi": [
            "و به راستی قرآن را قابل پندگیری گرداندیم، پس آیا پندپذیری هست؟"
          ],
          "fa.makarem": [
            "ما قرآن را برای تذکّر آسان ساختیم؛ آیا کسی هست که متذکّر شود!"
          ],
          "fa.moezzi": [
            "و همانا هموار ساختیم قرآن را برای یادآوردن پس آیا هست یادآورنده‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه قرآن را براى يادآورى و پندگرفتن آسان ساختيم، پس آيا يادآرنده و پندگيرنده‌اى هست؟"
          ],
          "fa.sadeqi": [
            "و ما قرآن را بی‌گمان برای پند‌گیری بس آسان کردیم‌؛ پس آیا هیچ پندگیرنده‌ای هست‌؟"
          ]
        }
      },
      {
        "index": 4869,
        "local_index": 23,
        "part_type": "Verse",
        "path": "/books/quran:54:23",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:39:21"
          ]
        },
        "text": [
          "کَذَّبَتْ‌ ثَمُودُ بِالنُّذُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "The Thamud rejected the warnings,"
          ],
          "en.ahmedraza": [
            "The tribe of Thamud denied the Noble Messengers."
          ],
          "en.arberry": [
            "Thamood cried lies to the warnings"
          ],
          "en.daryabadi": [
            "And the Thamud belied the warnings."
          ],
          "en.hilali": [
            "Thamud (people also) belied the warnings."
          ],
          "en.itani": [
            "Thamood rejected the warnings."
          ],
          "en.maududi": [
            "Thamud gave the lie to the warnings,"
          ],
          "en.mubarakpuri": [
            "Thamud denied the warnings."
          ],
          "en.pickthall": [
            "(The tribe of) Thamud rejected warnings"
          ],
          "en.qarai": [
            "[The people of] Thamud denied the warnings,"
          ],
          "en.qaribullah": [
            "Thamood, too, belied Our warnings."
          ],
          "en.sahih": [
            "Thamud denied the warning"
          ],
          "en.sarwar": [
            "The people of Thamud rejected Our warnings."
          ],
          "en.shakir": [
            "Samood rejected the warning."
          ],
          "en.transliteration": [
            "Ka<u>thth</u>abat thamoodu bi<b>al</b>nnu<u>th</u>ur<b>i</b>"
          ],
          "en.wahiduddin": [
            "The tribe of Thamud also rejected Our warnings:"
          ],
          "en.yusufali": [
            "The Thamud (also) rejected (their) Warners."
          ],
          "fa.ansarian": [
            "قوم ثمود بیم دهندگان را تکذیب کردند."
          ],
          "fa.ayati": [
            "قوم ثمود بيم‌دهندگان را تكذيب كردند."
          ],
          "fa.bahrampour": [
            "قوم ثمود بيم رسانان را تكذيب كردند"
          ],
          "fa.fooladvand": [
            "قوم ثمود هشداردهندگان را تكذيب كردند."
          ],
          "fa.ghomshei": [
            "قوم ثمود هم آیات حق را تکذیب کردند."
          ],
          "fa.khorramdel": [
            "قوم ثمود نیز بیم‌دادنها و برحذر داشتنهای (پیغمبر خود صالح) را تکذیب کردند و دروغشان نامیدند. [[«النُّذُرِ»: جمع نَذِیر، به معنی إنذار، بیم دادنها و بر حذر داشتنها. جمع نَذِیر، به معنی مُنْذِر، پیغمبران بیم‌رسان الهی. چرا که تکذیب پیغمبری تکذیب جملگی پیغمبران است (نگا: آلوسی).]]"
          ],
          "fa.khorramshahi": [
            "[قوم‌] ثمود هشداردهندگان را دروغ‌زن شمرد"
          ],
          "fa.makarem": [
            "طایفه ثمود (نیز) انذارهای الهی را تکذیب کردند،"
          ],
          "fa.moezzi": [
            "دروغ پنداشتند ثمود ترسانندگان مرا"
          ],
          "fa.mojtabavi": [
            "قوم ثمود نيز بيم‌كنندگان را دروغگو انگاشتند."
          ],
          "fa.sadeqi": [
            "ثمودیان به‌وسیله‌ی هشداردهندگان (همانان را) تکذیب کردند."
          ]
        }
      },
      {
        "index": 4870,
        "local_index": 24,
        "part_type": "Verse",
        "path": "/books/quran:54:24",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:39:21"
          ]
        },
        "text": [
          "فَقَالُوا أَ بَشَراً مِنَّا وَاحِداً نَتَّبِعُهُ إِنَّا إِذاً لَفِي‌ ضَلاَلٍ‌ وَ سُعُرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "And said: \"Should we follow only one man among us? In that case we shall he in error and insane."
          ],
          "en.ahmedraza": [
            "So they said, “What! Shall we follow a man from among us? If we do, we are indeed astray, and insane!”"
          ],
          "en.arberry": [
            "and said, 'What, shall we follow a mortal, one out of ourselves? Then indeed we should be in error and insanity!"
          ],
          "en.daryabadi": [
            "And they said: a mere humanbeing from amongst us, and single! shall we follow him! verily then we should fall in error and madness."
          ],
          "en.hilali": [
            "For they said: \"A man! Alone from among us, that we are to follow? Truly, then we should be in error and distress or madness!\""
          ],
          "en.itani": [
            "They said, “Are we to follow one of us, a human being? We would then go astray, and end up in Hell."
          ],
          "en.maududi": [
            "saying: “Are we to follow a single mortal, one from among ourselves? If we do that, we shall surely be in error and folly."
          ],
          "en.mubarakpuri": [
            "And they said: \"A man, alone among us -- shall we follow him Truly, then we should be in error and distress!\""
          ],
          "en.pickthall": [
            "For they said; Is it a mortal man, alone among us, that we are to follow? Then indeed we should fall into error and madness."
          ],
          "en.qarai": [
            "and they said, ‘Are we to follow a lone human from ourselves?! Indeed then we would be in error and madness.’"
          ],
          "en.qaribullah": [
            "They said: 'Are we to follow a mortal who is one of us? Then indeed, we would surely be in error and insane."
          ],
          "en.sahih": [
            "And said, \"Is it one human being among us that we should follow? Indeed, we would then be in error and madness."
          ],
          "en.sarwar": [
            "They said, \"Should we follow only one person among us. We shall be clearly in error and in trouble (if we do so)."
          ],
          "en.shakir": [
            "So they said: What! a single mortal from among us! Shall we follow him? Most surely we shall in that case be in sure error and distress:"
          ],
          "en.transliteration": [
            "Faq<u>a</u>loo abasharan minn<u>a</u> w<u>ah</u>idan nattabiAAuhu inn<u>a</u> i<u>th</u>an lafee <u>d</u>al<u>a</u>lin wasuAAur<b>in</b>"
          ],
          "en.wahiduddin": [
            "they said, \"Are we to follow a man from amongst ourselves? We would surely then fall into error and madness."
          ],
          "en.yusufali": [
            "For they said: \"What! a man! a Solitary one from among ourselves! shall we follow such a one? Truly should we then be straying in mind, and mad!"
          ],
          "fa.ansarian": [
            "پس گفتند: آیا ما بشری از جنس خود را که [تک و] تنهاست [و جمعیت و نیرویی با خود ندارد] پیروی کنیم؟! در این صورت در گمراهی و دیوانگی خواهیم بود."
          ],
          "fa.ayati": [
            "گفتند: اگر از انسانى همانند خود پيروى كنيم گمراه و ديوانه باشيم؛"
          ],
          "fa.bahrampour": [
            "پس گفتند: آيا بشرى يكه و تنها از خودمان را پيروى كنيم؟ در اين صورت ما واقعا در گمراهى و جنون خواهيم بود"
          ],
          "fa.fooladvand": [
            "و گفتند: «آيا تنها بشرى از خودمان را پيروى كنيم؟ در اين صورت، ما واقعاً در گمراهى و جنون خواهيم بود.»"
          ],
          "fa.ghomshei": [
            "و گفتند: آیا سزد که ما یک بشری از جنس خودمان را پیروی کنیم؟ در این صورت به گمراهی و جنون سخت در افتاده‌ایم."
          ],
          "fa.khorramdel": [
            "آنان گفتند: آیا از انسانی از خودمان پیروی کنیم که تنها (و بدون قوم و عشیره) هم هست؟ در صورت پیروی از او، ما گمراه و دیوانه خواهیم بود. [[«بَشَراً واحِداً»: انسان تنها و بی‌قوم و عشیره و از عامه مردم، نه از خاندان بزرگ و قبیله سترگ. یک فرد. ما همه از یک فرد ضعیف پیروی کنیم؟! «سُعُرٍ»: دیوانگی. (مسعور) به معنی مجنون، از این واژه است.]]"
          ],
          "fa.khorramshahi": [
            "و گفتند آیا از میان خود، از انسانی تک و تنها پیروی کنیم، در آن صورت دچار گمراهی و سردرگمی خواهیم بود"
          ],
          "fa.makarem": [
            "و گفتند: «آیا ما از بشری از جنس خود پیروی کنیم؟! اگر چنین کنیم در گمراهی و جنون خواهیم بود!"
          ],
          "fa.moezzi": [
            "پس گفتند آیا بشری را از خویش که یکتن است پیروی کنیمش همانا مائیم آن هنگام در گمراهی و آتشهایی‌"
          ],
          "fa.mojtabavi": [
            "و گفتند: آيا يك نفر آدمى از ميان خود- صالح- را پيروى كنيم؟! ما آنگاه در گمراهى و ديوانگى باشيم."
          ],
          "fa.sadeqi": [
            "پس گفتند: «آیا بشری از خودمان را (که) تنها (و بی‌‌یار و گواه است) پیروی کنیم‌؟ در این صورت، ما همواره در گمراهی و آتشباری هستیم.»"
          ]
        }
      },
      {
        "index": 4871,
        "local_index": 25,
        "part_type": "Verse",
        "path": "/books/quran:54:25",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:39:21"
          ]
        },
        "text": [
          "أَ أُلْقِيَ‌ الذِّکْرُ عَلَيْهِ‌ مِنْ‌ بَيْنِنَا بَلْ‌ هُوَ کَذَّابٌ‌ أَشِرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "Was he the one of all of us to have been given the exposition? He is surely an impudent liar.\""
          ],
          "en.ahmedraza": [
            "“What! Of all the men among us, the remembrance has come down upon him? In fact, he is a mischievous, great liar.”"
          ],
          "en.arberry": [
            "Has the Reminder been cast upon him alone among us? Nay, rather he is an impudent liar.'"
          ],
          "en.daryabadi": [
            "Hath the Admonition been laid upon him from amongst us! Aye! he is a liar insolent."
          ],
          "en.hilali": [
            "\"Is it that the Reminder is sent to him [Prophet Salih (Saleh)] alone from among us? Nay, he is an insolent liar!\""
          ],
          "en.itani": [
            "Was the message given to him, out of all of us? In fact, he is a wicked liar.”"
          ],
          "en.maududi": [
            "Was there none but he to whom the Reminder could be vouchsafed excluding all others? Nay; he is an insolent liar.”"
          ],
          "en.mubarakpuri": [
            "\"Is it that the Reminder is sent to him alone from among us Nay, he is an insolent liar!\""
          ],
          "en.pickthall": [
            "Hath the remembrance been given unto him alone among us? Nay, but he is a rash liar."
          ],
          "en.qarai": [
            "‘Has the Reminder been cast upon him from among us? No, he is a self-conceited liar.’"
          ],
          "en.qaribullah": [
            "Out of all of us has the Reminder been given to him alone? Rather, he is indeed an arrogant liar'"
          ],
          "en.sahih": [
            "Has the message been sent down upon him from among us? Rather, he is an insolent liar.\""
          ],
          "en.sarwar": [
            "How is it that he has received guidance? In fact, he is the most untruthfull and arrogant person\"."
          ],
          "en.shakir": [
            "Has the reminder been made to light upon him from among us? Nay! he is an insolent liar!"
          ],
          "en.transliteration": [
            "Aolqiya a<b>l</b><u>thth</u>ikru AAalayhi min baynin<u>a</u> bal huwa ka<u>ththa</u>bun ashir<b>un</b>"
          ],
          "en.wahiduddin": [
            "Has the [Divine] message been revealed to him alone of all of us? No, he is a boastful liar.\""
          ],
          "en.yusufali": [
            "\"Is it that the Message is sent to him, of all people amongst us? Nay, he is a liar, an insolent one!\""
          ],
          "fa.ansarian": [
            "آیا از میان ما فقط بر او وحی نازل شده است؟! [نه، چنین نیست] بلکه او بسیار دروغگو و پر افاده و متکبر است [که می خواهد بر ما بزرگی کند.]"
          ],
          "fa.ayati": [
            "آيا از ميان همه ما كلام خدا به او القا شده است؟ نه، او دروغگويى خودخواه است."
          ],
          "fa.bahrampour": [
            "آيا از ميان همه‌ى ما وحى بر او القا شده است؟ [نه،] بلكه او دروغگويى خودخواه است"
          ],
          "fa.fooladvand": [
            "«آيا از ميان ما [وحى‌] بر او القا شده است؟ [نه،] بلكه او دروغگويى گستاخ است.»"
          ],
          "fa.ghomshei": [
            "آیا بین ما افراد بشر تنها بر او وحی رسید؟! (چنین نیست) بلکه او مرد دروغگوی بی‌باک و خودپسندی است."
          ],
          "fa.khorramdel": [
            "آیا از میان همه‌ی ما (افراد بزرگ و محترم و دانا و دارا) وحی بدو شده است؟! (نه! چنین نیست). بلکه او بسیار دروغگو و خودخواه است (و با تکبّر و جاه‌طلبی می‌خواهد بر ما ریاست کند). [[«الذِّکْرُ»: وحی مراد است. «أَشِرٌ»: بسیار مغرور و متکبر. خودخواه و جاه‌طلب.]]"
          ],
          "fa.khorramshahi": [
            "آیا از میان همه ما کتاب آسمانی بر او فرود آمده است، نه بلکه او دروغ‌زن خودپسند است‌"
          ],
          "fa.makarem": [
            "آیا از میان ما تنها بر او وحی نازل شده؟! نه، او آدم بسیار دروغگوی هوسبازی است!"
          ],
          "fa.moezzi": [
            "آیا افکنده شد بر او ذکر از میان ما بلکه او است دروغ‌پردازی برتری‌جوی‌"
          ],
          "fa.mojtabavi": [
            "آيا از ميان همه ما ياد و پند- سخن و وحى خدا- بر او افكنده شده؟! بلكه او دروغ پردازى خودپسند و برترى‌جوست."
          ],
          "fa.sadeqi": [
            "«آیا از میان ما این یادواره (تنها) بر او القا شده است‌؟ (نه،) بلکه او بس دروغ‌پردازی بس خوشحال (و خودپسند) است.»"
          ]
        }
      },
      {
        "index": 4872,
        "local_index": 26,
        "part_type": "Verse",
        "path": "/books/quran:54:26",
        "text": [
          "سَيَعْلَمُونَ‌ غَداً مَنِ‌ الْکَذَّابُ‌ الْأَشِرُ"
        ],
        "translations": {
          "en.ahmedali": [
            "\"Tomorrow they will know who is the impudent liar!"
          ],
          "en.ahmedraza": [
            "It was said to Saleh, “They will soon realise tomorrow who is the mischievous great liar.”"
          ],
          "en.arberry": [
            "'They shall surely know tomorrow who is the impudent liar."
          ],
          "en.daryabadi": [
            "They shall know tomorrow whichsoever is a liar insolent."
          ],
          "en.hilali": [
            "Tomorrow they will come to know, who is the liar, the insolent one!"
          ],
          "en.itani": [
            "They will know tomorrow who the wicked liar is."
          ],
          "en.maududi": [
            "(We told Our Messenger): “Tomorrow they shall know who is the insolent liar."
          ],
          "en.mubarakpuri": [
            "Tomorrow they will come to know who is the liar, the insolent one!"
          ],
          "en.pickthall": [
            "(Unto their warner it was said): To-morrow they will know who is the rash liar."
          ],
          "en.qarai": [
            "‘Tomorrow they will know who is a self-conceited liar."
          ],
          "en.qaribullah": [
            "(To him We said): 'Tomorrow they shall know who is the arrogant liar."
          ],
          "en.sahih": [
            "They will know tomorrow who is the insolent liar."
          ],
          "en.sarwar": [
            "(We told Salih), \"Tomorrow they will know who is the most arrogant liar."
          ],
          "en.shakir": [
            "Tomorrow shall they know who is the liar, the insolent one."
          ],
          "en.transliteration": [
            "SayaAAlamoona ghadan mani alka<u>ththa</u>bu alashir<b>u</b>"
          ],
          "en.wahiduddin": [
            "[We said to him] \"Tomorrow they shall know who is the boastful liar,"
          ],
          "en.yusufali": [
            "Ah! they will know on the morrow, which is the liar, the insolent one!"
          ],
          "fa.ansarian": [
            "در فردای نزدیک خواهند دانست که بسیار دروغگو و پرافاده و متکبر کیست؟"
          ],
          "fa.ayati": [
            "فردا خواهند دانست كه دروغگوى خودخواه كيست."
          ],
          "fa.bahrampour": [
            "زودا كه فردا بدانند دروغگوى خودخواه كيست"
          ],
          "fa.fooladvand": [
            "به زودى فردا بدانند دروغگوى گستاخ كيست."
          ],
          "fa.ghomshei": [
            "این منکران به زودی فردای قیامت کاملا معلومشان شود که دروغگوی بی‌باک و خودپسند کیست."
          ],
          "fa.khorramdel": [
            "فردا خواهند دانست که بسیار دروغگوی متکبّر و خودخواه کیست. [[«غَداً»: فردای قیامت (نگا: حشر / 18). زمانی که عذاب دنیوی خدا گریبانگیرشان گردید.]]"
          ],
          "fa.khorramshahi": [
            "زودا که فردا بدانند که دروغ‌زن خودپسند کیست‌"
          ],
          "fa.makarem": [
            "ولی فردا می‌فهمند چه کسی دروغگوی هوسباز است!"
          ],
          "fa.moezzi": [
            "زود است بدانند فردا کیست دروغ‌پرداز برتری‌جوی‌"
          ],
          "fa.mojtabavi": [
            "فردا خواهند دانست كه دروغ‌پرداز خودپسند كيست."
          ],
          "fa.sadeqi": [
            "زودا خواهید دانست چه کسی بس دروغ‌پردازی، بس خوشحال است."
          ]
        }
      },
      {
        "index": 4873,
        "local_index": 27,
        "part_type": "Verse",
        "path": "/books/quran:54:27",
        "text": [
          "إِنَّا مُرْسِلُو النَّاقَةِ فِتْنَةً لَهُمْ‌ فَارْتَقِبْهُمْ‌ وَ اصْطَبِرْ"
        ],
        "translations": {
          "en.ahmedali": [
            "We shall send the she-camel to try them. So watch them, and be constant."
          ],
          "en.ahmedraza": [
            "“We shall send a she-camel to test them, therefore O Saleh, wait and have patience.”"
          ],
          "en.arberry": [
            "They shall send the She-camel as a trial for them; so watch thou them and keep patience."
          ],
          "en.daryabadi": [
            "Verify We are sending the she-camel as a test for them, so watch them thou and have patience."
          ],
          "en.hilali": [
            "Verily, We are sending the she-camel as a test for them. So watch them [O Salih (Saleh)], and be patient!"
          ],
          "en.itani": [
            "We are sending the she-camel as a test for them; so watch them and be patient."
          ],
          "en.maududi": [
            "We shall send the she-camel as a trial for them; so watch their end with patience."
          ],
          "en.mubarakpuri": [
            "Verily, We are sending the she-camel as a test for them. So watch them, and be patient!"
          ],
          "en.pickthall": [
            "Lo! We are sending the she-camel as a test for them; so watch them and have patience;"
          ],
          "en.qarai": [
            "We are sending the She-camel as a trial for them; so watch them and be steadfast."
          ],
          "en.qaribullah": [
            "We are sending to them as a trial, a shecamel, so watch them and have patience."
          ],
          "en.sahih": [
            "Indeed, We are sending the she-camel as trial for them, so watch them and be patient."
          ],
          "en.sarwar": [
            "We are sending the she-camel to them to test them. So watch them and be patient."
          ],
          "en.shakir": [
            "Surely We are going to send the she-camel as a trial for them; therefore watch them and have patience."
          ],
          "en.transliteration": [
            "Inn<u>a</u> mursiloo a<b>l</b>nn<u>a</u>qati fitnatan lahum fa<b>i</b>rtaqibhum wa<b>i</b><u>st</u>abir"
          ],
          "en.wahiduddin": [
            "for We are [going to] send the she-camel as a trial for them, so watch them and be patient."
          ],
          "en.yusufali": [
            "For We will send the she-camel by way of trial for them. So watch them, (O Salih), and possess thyself in patience!"
          ],
          "fa.ansarian": [
            "[به صالح گفتیم:] ما برای آزمایش آنان یقیناً آن ماده شتر [درخواست شده] را خواهیم فرستاد؛ پس در انتظار سرانجام آنان باش و شکیبایی پیشه کن."
          ],
          "fa.ayati": [
            "ما آن ماده‌شتر را براى آزمايششان مى‌فرستيم. پس مراقبشان باش و صبر كن."
          ],
          "fa.bahrampour": [
            "[به صالح گفتيم:] همانا ما اين ماده شتر را به امتحانشان مى‌فرستيم، پس مراقبشان باش و صبورى كن"
          ],
          "fa.fooladvand": [
            "ما براى آزمايش آنان [آن‌] ماده‌شتر را فرستاديم و [به صالح گفتيم:]«مراقب آنان باش و شكيبايى كن."
          ],
          "fa.ghomshei": [
            "ما (به صالح گفتیم که) برای امتحان آنها ناقه را (به درخواست آنها از سنگ) بیرون می‌فرستیم و تو مراقب حالشان باش و (بر آزارشان) صبر پیشه گیر."
          ],
          "fa.khorramdel": [
            "ما ماده شتر را برای امتحان ایشان خواهیم فرستاد، بنگر و ببین که چه می‌کند و بر سر آنان چه می‌آید و بسیار شکیبائی داشته باش (که خدا با تو است، و دستشان را از اذیّت و آزارت کوتاه خواهد کرد). [[«مُرْسِلُو»: اصل آن مُرْسِلُونَ، و نون جمع در حالت اضافه افتاده است. به معنی: فرستندگان (نگا: فاطر / 2، قصص / 45). «فِتْنَةً»: امتحان. آزمون. مفعول له است. «إِرْتَقِبْهُمْ»: ایشان را بپا و بنگر. مراقبشان باش. «إصْطَبِرْ»: زیاد تحمل داشته باش. بسی صبر کن.]]"
          ],
          "fa.khorramshahi": [
            "ما فرستنده ماده شتر [معجزه‌آسا] برای آزمایش ایشانیم، پس منتظر ایشان باش و شکیبایی کن‌"
          ],
          "fa.makarem": [
            "ما «ناقه» را برای آزمایش آنها می‌فرستیم؛ در انتظار پایان کار آنان باش و صبر کن!"
          ],
          "fa.moezzi": [
            "ما فرستنده‌ایم اشتر ماده را آزمایشی برای ایشان پس بنگر ایشان را و شکیبا شو"
          ],
          "fa.mojtabavi": [
            "ما ماده‌شترى براى آزمون آنان مى‌فرستيم پس [سرانجام‌] آنها را چشم مى‌دار و شكيبا باش."
          ],
          "fa.sadeqi": [
            "ما همواره برای آزمایش آتشینشان (آن) ماده شتر را فرستنده‌ایم‌. پس (به صالح گفتیم:) «منتظرشان باش و بسی شکیبایی کن.»"
          ]
        }
      },
      {
        "index": 4874,
        "local_index": 28,
        "part_type": "Verse",
        "path": "/books/quran:54:28",
        "text": [
          "وَ نَبِّئْهُمْ‌ أَنَ‌ الْمَاءَ قِسْمَةٌ بَيْنَهُمْ‌ کُلُ‌ شِرْبٍ‌ مُحْتَضَرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "Tell them that the water is to be apportioned between them (and her); and every turn of drinking will be fixed (for each).\""
          ],
          "en.ahmedraza": [
            "“And inform them that the water is to be shared between them; only those may come whose turn it is.”"
          ],
          "en.arberry": [
            "And tell them that the water is to be divided between them, each drink for each in turn."
          ],
          "en.daryabadi": [
            "And declare thou Unto them that water hath been divided between them; every drinking shall be by turns."
          ],
          "en.hilali": [
            "And inform them that the water is to be shared between (her and) them. Each one's right to drink being established (by turns)."
          ],
          "en.itani": [
            "And inform them that the water is to be shared between them; each share of drink made available."
          ],
          "en.maududi": [
            "Let them know that the water should be divided between them and the she-camel, each availing their turn.”"
          ],
          "en.mubarakpuri": [
            "And inform them that the water is to be shared between (her and) them, each one's right to drink being established (by turns)."
          ],
          "en.pickthall": [
            "And inform them that the water is to be shared between (her and) them. Every drinking will be witnessed."
          ],
          "en.qarai": [
            "Inform them that the water is to be shared between them; each of them showing up at his turn.’"
          ],
          "en.qaribullah": [
            "Tell them that the water is to be divided between them, a drink each for them in turn'"
          ],
          "en.sahih": [
            "And inform them that the water is shared between them, each [day of] drink attended [by turn]."
          ],
          "en.sarwar": [
            "Tell them that each one of them has the right to have a certain share of water\"."
          ],
          "en.shakir": [
            "And inform them that the water is shared between them; every share of the water shall be regulated."
          ],
          "en.transliteration": [
            "Wanabbihum anna alm<u>a</u>a qismatun baynahum kullu shirbin mu<u>h</u>ta<u>d</u>ar<b>un</b>"
          ],
          "en.wahiduddin": [
            "And tell them that the water [of the well] is to be divided between them, and that each one should drink in turn.\""
          ],
          "en.yusufali": [
            "And tell them that the water is to be divided between them: Each one's right to drink being brought forward (by suitable turns)."
          ],
          "fa.ansarian": [
            "و آنان را خبر ده که آب آشامیدنی میان آنان و ماده شتر تقسیم شده است؛ هریک در زمان نوبت خود بر سر آب حاضر شوند."
          ],
          "fa.ayati": [
            "و به آنها بگوى كه آب ميانشان تقسيم شده. نوبت هر كه باشد او به سر آب مى‌رود."
          ],
          "fa.bahrampour": [
            "و به آنان خبر ده كه آب، ميانشان [و ميان ناقه‌] تقسيم شده است، هر كدام در نوبت خود [بر سر آب‌] حاضر شود"
          ],
          "fa.fooladvand": [
            "و به آنان خبر ده كه آب ميانشان بخش شده‌است: هر كدام را آب به نوبت خواهد بود.»"
          ],
          "fa.ghomshei": [
            "و به آنها خبر ده که نوشیدن آب چشمه بین آنها و ناقه تقسیم شده (که یک روز سهم ناقه و روزی برای آنهاست) و هر یک بر سهم خود حاضر آیند."
          ],
          "fa.khorramdel": [
            "به آنان بگو که آب (چاهی که دارند، به فرمان خدا) میان ایشان و شتر تقسیم شده است (یک روز مال شما و یک روز متعلق به شتر است). نوبت هر کدام که باشد، بر سر آب می‌رود. [[«قِسْمَةٌ»: تقسیم شده است. مصدر به معنی اسم مفعول است. «بَیْنَهُمْ»: میان ایشان و شتر. استعمال ضمیر (هم) به خاطر تغلیب است. «شِرْبٍ»: نوبت نوشیدن و بهره‌برداری از آب (نگا: شعراء / 155). «مُحْتَضَرٌ»: محل حضور. به صیغه اسم مفعول، وصف نوبت است؛ نه وصف اهل آن.]]"
          ],
          "fa.khorramshahi": [
            "و به آنان خبر بده که آب در میان آنان تقسیم شده است، هر یک به حصه‌ای از آب حاضر باشند"
          ],
          "fa.makarem": [
            "و به آنها خبر ده که آب (قریه) باید در میانشان تقسیم شود، (یک روز سهم ناقه، و یک روز برای آنها) و هر یک در نوبت خود باید حاضر شوند!"
          ],
          "fa.moezzi": [
            "و آگهیشان ده که آب بخش است میان ایشان هر آبشخوری است حاضر شده‌"
          ],
          "fa.mojtabavi": [
            "و آنان را آگاه كن كه آب ميانشان [و ميان ماده‌شتر] بخش‌بندى شده، هر نوبت آبشخور [صاحبش‌] حاضر آيد- يك روز براى آنها و يك روز براى شتر-."
          ],
          "fa.sadeqi": [
            "«و به آنان (این) خبر مهم را بده که آب میانشان قسمت شده است: هرکدام را آشامیدنی (به نوبت آمده) و حاضر شده است.»"
          ]
        }
      },
      {
        "index": 4875,
        "local_index": 29,
        "part_type": "Verse",
        "path": "/books/quran:54:29",
        "text": [
          "فَنَادَوْا صَاحِبَهُمْ‌ فَتَعَاطَى‌ فَعَقَرَ"
        ],
        "translations": {
          "en.ahmedali": [
            "But they called their commander, who seized and hamstrung her."
          ],
          "en.ahmedraza": [
            "In response they called their companion – he therefore caught and hamstrung the she-camel."
          ],
          "en.arberry": [
            "Then they called their comrade, and he took in hand, and hamstrung her."
          ],
          "en.daryabadi": [
            "Then they called their fellow, and he took the sword and hamstrung her,"
          ],
          "en.hilali": [
            "But they called their comrade and he took (a sword) and killed (her)."
          ],
          "en.itani": [
            "But they called their friend, and he dared, and he slaughtered."
          ],
          "en.maududi": [
            "Eventually, they summoned their companion, and he undertook the (outrageous) task and hamstrung the she-camel."
          ],
          "en.mubarakpuri": [
            "But they called their comrade and he took (a sword) and killed (her)."
          ],
          "en.pickthall": [
            "But they call their comrade and he took and hamstrung (her)."
          ],
          "en.qarai": [
            "But they called their companion, and he took [a knife] and hamstrung [her]."
          ],
          "en.qaribullah": [
            "But they called their companion who took hold of her and hamstrung her."
          ],
          "en.sahih": [
            "But they called their companion, and he dared and hamstrung [her]."
          ],
          "en.sarwar": [
            "They called together their companions and agreed to slay the she-camel."
          ],
          "en.shakir": [
            "But they called their companion, so he took (the sword) and slew (her)."
          ],
          "en.transliteration": [
            "Fan<u>a</u>daw <u>sah</u>ibahum fataAA<u>ata</u> faAAaqar<b>a</b>"
          ],
          "en.wahiduddin": [
            "But they called their companion who took a sword and hamstrung her."
          ],
          "en.yusufali": [
            "But they called to their companion, and he took a sword in hand, and hamstrung (her)."
          ],
          "fa.ansarian": [
            "پس آنان یارشان را [که برای پی کردن ناقه آماده کرده بودند] فرا خواندند و [او] دست به کار شد و [ماده شتر را] پی کرد."
          ],
          "fa.ayati": [
            "يارشان را ندا دادند و او شمشير برگرفت و آن را پى كرد."
          ],
          "fa.bahrampour": [
            "پس رفيقشان را ندا دادند و او شمشير كشيد و [ناقه را] پى كرد"
          ],
          "fa.fooladvand": [
            "پس رفيقشان را صدا كردند و [او] شمشير كشيد و [شتر را] پى كرد."
          ],
          "fa.ghomshei": [
            "آن قوم شقی صاحب و رئیس خود را خواندند تا مجهز شد و ناقه را پی کرد."
          ],
          "fa.khorramdel": [
            "قوم ثمود، یار خود (قدار بن سالف) را صدا زدند (که بیا این شتر را بکش). او هم بی‌باکانه دست بکار شد و شتر را پی کرد. [[«تَعَاطَی»: کار کشتن را بدست گرفت. دست بکار شد. شمشیر را برگرفت. «عَقَرَ»: نحر کرد. پی کرد.]]"
          ],
          "fa.khorramshahi": [
            "آنگاه رفیقشان را ندا دادند، سپس او دست درازی کرد و [شتر را] پی کرد"
          ],
          "fa.makarem": [
            "آنها یکی از یاران خود را صدا زدند، او به سراغ این کار آمد و (ناقه را) پی کرد!"
          ],
          "fa.moezzi": [
            "پس خواندند یار خویش را پس بیامد پس پی کرد"
          ],
          "fa.mojtabavi": [
            "پس يار خود را آواز دادند تا [سلاح‌] برگرفت و [ماده‌شتر را] پى كرد- كشت-."
          ],
          "fa.sadeqi": [
            "پس (سرکرده‌ی) همگامشان را ندا در دادند. پس او شمشیر برگرفت و (شتر را) پی کرد و از پا درآورد."
          ]
        }
      },
      {
        "index": 4876,
        "local_index": 30,
        "part_type": "Verse",
        "path": "/books/quran:54:30",
        "text": [
          "فَکَيْفَ‌ کَانَ‌ عَذَابِي‌ وَ نُذُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "How was then My punishment of which they had been warned?"
          ],
          "en.ahmedraza": [
            "So how did My punishment turn out, and My warnings?"
          ],
          "en.arberry": [
            "How then were My chastisement and My warnings?"
          ],
          "en.daryabadi": [
            "So how dreadful have been My torment and My warnings."
          ],
          "en.hilali": [
            "Then, how (terrible) was My Torment and My Warnings?"
          ],
          "en.itani": [
            "So how were My punishment and My warnings?"
          ],
          "en.maududi": [
            "So how awesome were My chastisement and My warnings!"
          ],
          "en.mubarakpuri": [
            "Then, how was My torment and My warnings"
          ],
          "en.pickthall": [
            "Then see how (dreadful) was My punishment after My warnings!"
          ],
          "en.qarai": [
            "So how were My punishment and My warnings?!"
          ],
          "en.qaribullah": [
            "How then were My punishment and My warnings!"
          ],
          "en.sahih": [
            "And how [severe] were My punishment and warning."
          ],
          "en.sarwar": [
            "How terrible was My punishment and warning."
          ],
          "en.shakir": [
            "How (great) was then My punishment and My warning!"
          ],
          "en.transliteration": [
            "Fakayfa k<u>a</u>na AAa<u>tha</u>bee wanu<u>th</u>ur<b>i</b>"
          ],
          "en.wahiduddin": [
            "How [terrible] were My punishment and My warnings!"
          ],
          "en.yusufali": [
            "Ah! how (terrible) was My Penalty and My Warning!"
          ],
          "fa.ansarian": [
            "پس عذاب و هشدارهایم چگونه بود؟"
          ],
          "fa.ayati": [
            "عذاب و بيم‌دادنهاى من چگونه بود؟"
          ],
          "fa.bahrampour": [
            "پس [بنگر] چگونه بود عذاب من و هشدارهاى من"
          ],
          "fa.fooladvand": [
            "پس چگونه بود عذاب من و هشدارها[ى من‌]؟"
          ],
          "fa.ghomshei": [
            "پس (باز بنگرید که) عذاب و تنبیه من چگونه سخت بود!"
          ],
          "fa.khorramdel": [
            "آیا عذاب و عقاب من، و بیم دادنها و بر حذر داشتنهای من به چه منوالی بوده است (و به چه شکلی کافران را در بر گرفته است؟!). [[«کَیْفَ کَانَ ...»: (نگا: قمر / 16 و 18).]]"
          ],
          "fa.khorramshahi": [
            "بنگر عذاب و هشدار من چگونه بود"
          ],
          "fa.makarem": [
            "پس (بنگرید) عذاب و انذارهای من چگونه بود!"
          ],
          "fa.moezzi": [
            "پس چگونه بود عذاب من و ترسانندگان من‌"
          ],
          "fa.mojtabavi": [
            "پس [بنگر كه‌] عذاب و بيم‌دادن من چگونه بود؟"
          ],
          "fa.sadeqi": [
            "پس چگونه بود عذابم و هشداردهندگان (از سوی) من‌؟"
          ]
        }
      },
      {
        "index": 4877,
        "local_index": 31,
        "part_type": "Verse",
        "path": "/books/quran:54:31",
        "text": [
          "إِنَّا أَرْسَلْنَا عَلَيْهِمْ‌ صَيْحَةً وَاحِدَةً فَکَانُوا کَهَشِيمِ‌ الْمُحْتَظِرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "We sent a single blast against them, and they were reduced to husks of a decayed fence."
          ],
          "en.ahmedraza": [
            "Indeed We sent upon them a single Scream – thereupon they became like the barrier builder’s residual dry trampled hay."
          ],
          "en.arberry": [
            "We loosed against them one Cry, and they were as the wattles of a pen-builder."
          ],
          "en.daryabadi": [
            "Verily We We sent upon them one shout, and they became as the stubble of a fold-builder."
          ],
          "en.hilali": [
            "Verily, We sent against them a single Saihah (torment - awful cry, etc.), and they became like the dry stubble of a fold-builder."
          ],
          "en.itani": [
            "We sent against them a single Scream, and they became like crushed hay."
          ],
          "en.maududi": [
            "Behold, We sent a single Blast against them, and they became like the trampled twigs of a sheep pen-builder."
          ],
          "en.mubarakpuri": [
            "Verily, We sent against them a single Sayhah, and they became like straw Al-Muhtazir."
          ],
          "en.pickthall": [
            "Lo! We sent upon them one Shout, and they became as the dry twigs (rejected by) the builder of a cattle-fold."
          ],
          "en.qarai": [
            "We sent against them a single Cry, and they became like the dry sticks of a corral builder."
          ],
          "en.qaribullah": [
            "Then We sent against them one Shout and they became like the trampled twigs of the (sheep) penbuilder."
          ],
          "en.sahih": [
            "Indeed, We sent upon them one blast from the sky, and they became like the dry twig fragments of an [animal] pen."
          ],
          "en.sarwar": [
            "We sent upon them a single blast of sound and they were left like hay to be used by the cattle."
          ],
          "en.shakir": [
            "Surely We sent upon them a single cry, so they were like the dry fragments of trees which the maker of an enclosure collects."
          ],
          "en.transliteration": [
            "Inn<u>a</u> arsaln<u>a</u> AAalayhim <u>s</u>ay<u>h</u>atan w<u>ah</u>idatan fak<u>a</u>noo kahasheemi almu<u>h</u>ta<i><u>th</u></i>ir<b>i</b>"
          ],
          "en.wahiduddin": [
            "Then We sent a single blast against them and they became like dry stubble which has been trampled upon."
          ],
          "en.yusufali": [
            "For We sent against them a single Mighty Blast, and they became like the dry stubble used by one who pens cattle."
          ],
          "fa.ansarian": [
            "ما بر آنان یک فریاد مرگبار فرستادیم، پس همه آنان به صورت گیاه خشکی که در آغل چهارپایان جمع می کنند، درآمدند."
          ],
          "fa.ayati": [
            "ما بر آنها يك آواز سهمناك فرستاديم. پس همانند آن علفهاى خشك آغل گوسفند شدند."
          ],
          "fa.bahrampour": [
            "همانا ما بر سرشان يك صيحه [ى مرگبار] فرستاديم و همگى چون علف خشك، خرد و ريز شدند"
          ],
          "fa.fooladvand": [
            "ما بر [سر]شان يك فرياد [مرگبار] فرستاديم و چون گياه خشكيده [كومه‌ها] ريزريز شدند."
          ],
          "fa.ghomshei": [
            "ما بر هلاک آنها یک صیحه (عذاب آسمانی) فرستادیم و همه مانند گیاه خشک و خرد شدند."
          ],
          "fa.khorramdel": [
            "ما بر آنان یک صدای سهمناک سر دادیم و ایشان همگی به صورت گیاه خشکی درآمدند که صاحب چهارپایان در آغل جمع‌آوری می‌کند. [[«هَشِیمِ»: گیاه خشک و خرد شده. «الْمُحْتَظِرِ»: کسی که آغلی را برای گوسفندان و حیوانات درست می‌کند که مانع خروج آنها یا حمله حیوانات وحشی گردد، یا این که علوفه چهارپایان را در آن انبار می‌کند. «هَشِیمِ الْمُحْتَظِرِ»: علوفه خشک موجود در آغل شخص آغلدار.]]"
          ],
          "fa.khorramshahi": [
            "ما بر آنان بانگ مرگباری یگانه فرو فرستادیم، آنگاه مانند خار و خاشاکی شدند که از سایه‌بان‌ساز بازماند"
          ],
          "fa.makarem": [
            "ما فقط یک صیحه [= صاعقه عظیم‌] بر آنها فرستادیم و بدنبال آن همگی بصورت گیاه خشکی درآمدند که صاحب چهارپایان (در آغل) جمع‌آوری می‌کند!"
          ],
          "fa.moezzi": [
            "همانا فرستادیم بر ایشان خروشی را تا شدند مانند برگ خشکیده کوخ سازنده‌"
          ],
          "fa.mojtabavi": [
            "بر آنها تنها يك بانگ سخت فرستاديم، پس همچون كاهى كه صاحب آغل براى گوسفندان آماده مى‌كند- خرد و در هم شكسته- شدند."
          ],
          "fa.sadeqi": [
            "ما بر (سر و سامان)شان یک بانگ (مرگبار) فرو فرستادیم و چون گیاه خشکیده‌(ی کومه‌ها) ریز ریز و آماده‌(ی سوختن یا خوردن حیوانات) شدند."
          ]
        }
      },
      {
        "index": 4878,
        "local_index": 32,
        "part_type": "Verse",
        "path": "/books/quran:54:32",
        "text": [
          "وَ لَقَدْ يَسَّرْنَا الْقُرْآنَ‌ لِلذِّکْرِ فَهَلْ‌ مِنْ‌ مُدَّکِرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "Easy have We made the Qur'an to understand: So is there any one who will be warned?"
          ],
          "en.ahmedraza": [
            "And We have indeed made the Qur’an easy to memorise, so is there one who would remember?"
          ],
          "en.arberry": [
            "Now We have made the Koran easy for Remembrance. Is there any that will remember?"
          ],
          "en.daryabadi": [
            "And assuredly We have made the Qur'an eary for admanirion: is there then any one who would be admonished."
          ],
          "en.hilali": [
            "And indeed, We have made the Quran easy to understand and remember, then is there any that will remember (or receive admonition)?"
          ],
          "en.itani": [
            "We made the Quran easy to understand. Is there anyone who would understand?"
          ],
          "en.maududi": [
            "Surely We have made this Qur'an easy as a reminder. Is there, then, any who will take heed?"
          ],
          "en.mubarakpuri": [
            "And indeed, We have made the Qur'an easy to understand and remember; then is there any that will remember"
          ],
          "en.pickthall": [
            "And in truth We have made the Qur'an easy to remember; but is there any that remembereth?"
          ],
          "en.qarai": [
            "Certainly We have made the Quran simple for the sake of admonishment. So is there anyone who will be admonished?"
          ],
          "en.qaribullah": [
            "We have made the Koran an easy Remembrance, is there any that will remember!"
          ],
          "en.sahih": [
            "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?"
          ],
          "en.sarwar": [
            "We made the Quran easy to understand, but is there anyone who would take heed?"
          ],
          "en.shakir": [
            "And certainly We have made the Quran easy for remembrance, but is there anyone who will mind?"
          ],
          "en.transliteration": [
            "Walaqad yassarn<u>a</u> alqur<u>a</u>na li<b>l</b><u>thth</u>ikri fahal min muddakir<b>in</b>"
          ],
          "en.wahiduddin": [
            "Indeed, We have made the Quran easy to learn lessons from. Is there anyone who would receive admonition?"
          ],
          "en.yusufali": [
            "And We have indeed made the Qur'an easy to understand and remember: then is there any that will receive admonition?"
          ],
          "fa.ansarian": [
            "و یقیناً ما قرآن را برای پند گرفتن آسان کردیم، پس آیا پند گیرنده ای هست؟"
          ],
          "fa.ayati": [
            "و اين قرآن را آسان ادا كرديم تا از آن پند گيرند. آيا پندگيرنده‌اى هست؟"
          ],
          "fa.bahrampour": [
            "و قطعا قرآن را براى پندآموزى آسان كرديم، پس آيا پند گيرنده‌اى هست"
          ],
          "fa.fooladvand": [
            "و قطعاً قرآن را براى پندآموزى آسان كرديم؛ پس آيا پندگيرنده‌اى هست؟"
          ],
          "fa.ghomshei": [
            "و ما قرآن را برای وعظ و اندرز بر فهم آسان کردیم آیا کسی هست که از آن پند گیرد؟"
          ],
          "fa.khorramdel": [
            "ما قرآن را برای یاددادن ویادگرفتن وپنددادن وپندگرفتن ساده و آسان نموده‌ایم، آیا پندپذیرنده و عبرت‌گیرنده ای هست؟ [[«وَ لَقَدْ یَسَّرْنَا ...»: (نگا: قمر / 17).]]"
          ],
          "fa.khorramshahi": [
            "و به راستی قرآن را قابل پندگیری گرداندیم، پس آیا پندپذیری هست؟"
          ],
          "fa.makarem": [
            "ما قرآن را برای یادآوری آسان ساختیم؛ آیا کسی هست که متذکّر شود؟!"
          ],
          "fa.moezzi": [
            "و همانا آسان ساختیم قرآن را برای یادآوردن پس آیا هست یادآورنده‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه قرآن را براى يادآورى و پندگرفتن آسان ساختيم، پس آيا يادآرنده و پندگيرنده‌اى هست؟"
          ],
          "fa.sadeqi": [
            "و ما همواره قرآن را برای پند‌گیری(شان) آسان کردیم‌؛ پس آیا پند گیرنده‌ای هست‌؟"
          ]
        }
      },
      {
        "index": 4879,
        "local_index": 33,
        "part_type": "Verse",
        "path": "/books/quran:54:33",
        "text": [
          "کَذَّبَتْ‌ قَوْمُ‌ لُوطٍ بِالنُّذُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "The people of Lot rejected the warnings."
          ],
          "en.ahmedraza": [
            "The people of Lut denied the Noble Messengers."
          ],
          "en.arberry": [
            "The people of Lot cried lies to the warnings."
          ],
          "en.daryabadi": [
            "The people of Lut belied the warnings."
          ],
          "en.hilali": [
            "The people of Lout (Lot) belied the warnings."
          ],
          "en.itani": [
            "The people of Lot rejected the warnings."
          ],
          "en.maududi": [
            "Lot's people also gave the lie to the warnings,"
          ],
          "en.mubarakpuri": [
            "The people of Lut denied the warnings."
          ],
          "en.pickthall": [
            "The folk of Lot rejected warnings."
          ],
          "en.qarai": [
            "And the people of Lot denied the warnings."
          ],
          "en.qaribullah": [
            "The nation of Lot belied Our warnings."
          ],
          "en.sahih": [
            "The people of Lot denied the warning."
          ],
          "en.sarwar": [
            "The people of Lot rejected Our warning."
          ],
          "en.shakir": [
            "The people of Lut treated the warning. as a lie."
          ],
          "en.transliteration": [
            "Ka<u>thth</u>abat qawmu loo<u>t</u>in bi<b>al</b>nnu<u>th</u>ur<b>i</b>"
          ],
          "en.wahiduddin": [
            "The people of Lot rejected Our warnings."
          ],
          "en.yusufali": [
            "The people of Lut rejected (his) warning."
          ],
          "fa.ansarian": [
            "قوم لوط بیم دهندگان را تکذیب کردند."
          ],
          "fa.ayati": [
            "قوم لوط بيم‌دهندگان را تكذيب كردند."
          ],
          "fa.bahrampour": [
            "قوم لوط بيم رسانان را تكذيب كردند"
          ],
          "fa.fooladvand": [
            "قوم لوط هشداردهندگان را تكذيب كردند."
          ],
          "fa.ghomshei": [
            "قوم لوط نیز آیات و رسول حق را تکذیب کردند."
          ],
          "fa.khorramdel": [
            "قوم لوط نیز بیم دادنها و بر حذر داشتنهای (پیغمبر خود لوط) را تکذیب کردند. [[«کَذَّبَتْ ... بِالنُّذُرِ»: (نگا: قمر / 23).]]"
          ],
          "fa.khorramshahi": [
            "قوم لوط هشداردهندگان را دروغ‌زن شمردند"
          ],
          "fa.makarem": [
            "قوم لوط انذارها(ی پی‌درپی پیامبرشان) را تکذیب کردند؛"
          ],
          "fa.moezzi": [
            "تکذیب کردند قوم لوط ترسانندگان را"
          ],
          "fa.mojtabavi": [
            "قوم لوط بيم‌كنندگان را دروغگو شمردند."
          ],
          "fa.sadeqi": [
            "قوم لوط با هشداردهندگان (همان‌ها و ما را) را تکذیب کردند."
          ]
        }
      },
      {
        "index": 4880,
        "local_index": 34,
        "part_type": "Verse",
        "path": "/books/quran:54:34",
        "text": [
          "إِنَّا أَرْسَلْنَا عَلَيْهِمْ‌ حَاصِباً إِلاَّ آلَ‌ لُوطٍ نَجَّيْنَاهُمْ‌ بِسَحَرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "We sent a stone-hurtling storm against them, except the family of Lot whom We saved in the early hours of the morning"
          ],
          "en.ahmedraza": [
            "Indeed We sent a shower of stones upon them, except the family of Lut; We rescued them before dawn."
          ],
          "en.arberry": [
            "We loosed against them a squall of pebbles except the folk of Lot; We delivered them at the dawn --"
          ],
          "en.daryabadi": [
            "Verily We! We sent upon them a gravel-storm save the household of Lut; them We delivered at early dawn."
          ],
          "en.hilali": [
            "Verily, We sent against them a violent storm of stones (which destroyed them all), except the family of Lout (Lot), whom We saved in last hour of the night,"
          ],
          "en.itani": [
            "We unleashed upon them a shower of stones, except for the family of Lot; We rescued them at dawn."
          ],
          "en.maududi": [
            "and behold, We let loose upon them a tempest which rained stones upon them, except upon Lot's household whom We rescued in the last hours of the night"
          ],
          "en.mubarakpuri": [
            "Verily, We sent against them Hasib (a violent storm of stones), except the family of Lut, them We saved in the last hour of the night,"
          ],
          "en.pickthall": [
            "Lo! We sent a storm of stones upon them (all) save the family of Lot, whom We rescued in the last watch of the night,"
          ],
          "en.qarai": [
            "We unleashed upon them a rain of stones, excepting the family of Lot, whom We delivered at dawn"
          ],
          "en.qaribullah": [
            "We let loose on all of them a squall of claystones, except for the house of Lot whom We saved at dawn"
          ],
          "en.sahih": [
            "Indeed, We sent upon them a storm of stones, except the family of Lot - We saved them before dawn"
          ],
          "en.sarwar": [
            "We sent down upon them a violent sandstorm (which destroyed them all) except for the family of Lot, whom We saved in the early morning by Our favor."
          ],
          "en.shakir": [
            "Surely We sent upon them a stonestorm, except Lut's followers; We saved them a little before daybreak,"
          ],
          "en.transliteration": [
            "Inn<u>a</u> arsaln<u>a</u> AAalayhim <u>has</u>iban ill<u>a</u> <u>a</u>la loo<u>t</u>in najjayn<u>a</u>hum bisa<u>h</u>ar<b>in</b>"
          ],
          "en.wahiduddin": [
            "We sent a sandstorm against them which destroyed them all, except the family of Lot, whom We saved at the break of dawn,"
          ],
          "en.yusufali": [
            "We sent against them a violent Tornado with showers of stones, (which destroyed them), except Lut's household: them We delivered by early Dawn,-"
          ],
          "fa.ansarian": [
            "ما بر آنان توفانی سخت که با خود ریگ و سنگ می آورد فرستادیم [در نتیجه همه را هلاک کرد]، مگر خاندان لوط را که سحرگاهان نجاتشان دادیم."
          ],
          "fa.ayati": [
            "ما بر آنها بادى ريگ‌بار فرستاديم، مگر بر خاندان لوط كه آنها را سحرگاه رهانيديم."
          ],
          "fa.bahrampour": [
            "همانا ما بر سر آنها طوفانى سنگبار فرو فرستاديم، بجز خاندان لوط كه به وقت سحر نجاتشان داديم"
          ],
          "fa.fooladvand": [
            "ما بر [سر] آنان سنگبارانى [انفجارى‌] فروفرستاديم [و] فقط خانواده لوط بودند كه سحرگاهشان رهانيديم."
          ],
          "fa.ghomshei": [
            "ما هم جز خانواده لوط که به وقت سحر نجاتشان دادیم همه آنان را به سنگباران هلاک نابود کردیم."
          ],
          "fa.khorramdel": [
            "ما بر آنان تندبادی که ریگها را به حرکت در می‌آورد گماشتیم (و همگان را هلاک ساختیم) جز خاندان و پیروان لوط را که ما سحرگاهان ایشان را نجات دادیم (و از آن سرزمین بلازده رهائیشان بخشیدیم). [[«حَاصِباً»: بادی که سنگریزه را بردارد و پرت کند و ریگها را جابجا سازد (نگا: اسراء / 68، عنکبوت / 40). «بِسَحَرٍ»: در بامدادان. در سحرگاهان.]]"
          ],
          "fa.khorramshahi": [
            "ما بر آنان شن‌بادی فرو فرستادیم، مگر بر خاندان لوط که سحرگاهی نجاتشان دادیم‌"
          ],
          "fa.makarem": [
            "ما بر آنها تندبادی که ریگها را به حرکت درمی‌آورد فرستادیم (و همه را هلاک کردیم)، جز خاندان لوط را که سحرگاهان نجاتشان دادیم!"
          ],
          "fa.moezzi": [
            "همانا فرستادیم بر ایشان سنگریزه جز خاندان لوط که رهائیشان دادیم به سحر"
          ],
          "fa.mojtabavi": [
            "ما بر آنها بادى سنگبار فرستاديم مگر خاندان لوط را كه ايشان را سحرگاهان رهانيديم"
          ],
          "fa.sadeqi": [
            "ما بر (سر و سامان)شان سنگبارانی انفجاری فرو فرستادیم (و) فقط خانواده‌ی لوط بودند که سحرگاهان نجاتشان دادیم."
          ]
        }
      },
      {
        "index": 4881,
        "local_index": 35,
        "part_type": "Verse",
        "path": "/books/quran:54:35",
        "text": [
          "نِعْمَةً مِنْ‌ عِنْدِنَا کَذٰلِکَ‌ نَجْزِي‌ مَنْ‌ شَکَرَ"
        ],
        "translations": {
          "en.ahmedali": [
            "As a favour from Us. That is how We reward the grateful."
          ],
          "en.ahmedraza": [
            "As a reward from Us; this is how We reward one who gives thanks."
          ],
          "en.arberry": [
            "a blessing from Us; even so We recompense him who is thankful."
          ],
          "en.daryabadi": [
            "As a favour from us. Thus We recompense him who giveth thanks."
          ],
          "en.hilali": [
            "As a Favour from Us, thus do We reward him who gives thanks (by obeying Us)."
          ],
          "en.itani": [
            "A blessing from Us. Thus We reward the thankful."
          ],
          "en.maududi": [
            "as a favour from Us. Thus do We reward those who give thanks."
          ],
          "en.mubarakpuri": [
            "As a favor from Us. Thus do We reward him who gives thanks."
          ],
          "en.pickthall": [
            "As grace from Us. Thus We reward him who giveth thanks."
          ],
          "en.qarai": [
            "as a blessing from Us. Thus do We reward those who give thanks."
          ],
          "en.qaribullah": [
            "through Our Mercy. So it is that We recompense the thankful."
          ],
          "en.sahih": [
            "As favor from us. Thus do We reward he who is grateful."
          ],
          "en.sarwar": [
            "Thus do We recompense the grateful ones."
          ],
          "en.shakir": [
            "A favor from Us; thus do We reward him who gives thanks."
          ],
          "en.transliteration": [
            "NiAAmatan min AAindin<u>a</u> ka<u>tha</u>lika najzee man shakar<b>a</b>"
          ],
          "en.wahiduddin": [
            "as a blessing from Us: this is how We reward the thankful."
          ],
          "en.yusufali": [
            "As a Grace from Us: thus do We reward those who give thanks."
          ],
          "fa.ansarian": [
            "[این] نعمت و رحمتی از سوی ما بود، این گونه کسی را که سپاس گزار است، پاداش می دهیم."
          ],
          "fa.ayati": [
            "نعمتى بود از جانب ما و آنان را كه سپاس گويند چنين پاداش دهيم."
          ],
          "fa.bahrampour": [
            "[و اين‌] رحمتى از جانب ما بود. ما اين گونه هر كه را سپاس داشت پاداش مى‌دهيم"
          ],
          "fa.fooladvand": [
            "[و اين‌] رحمتى از جانب ما بود؛ هر كه سپاس دارد، بدين‌سان [او را] پاداش مى‌دهيم."
          ],
          "fa.ghomshei": [
            "نجات اهل بیت لوط هم به نعمت و لطف ما بود، بلی ما چنین شکرگزاران را پاداش می‌دهیم."
          ],
          "fa.khorramdel": [
            "این نعمتی بود از جانب ما (به آل لوط). ما اینگونه کسی را پاداش می‌دهیم که شکرگزار باشد. [[«نِعْمَةً»: مفعول له است.]]"
          ],
          "fa.khorramshahi": [
            "که نعمتی از جانب ما بود، بدین‌سان کسی را که سپاس گزارده است، جزا دهیم‌"
          ],
          "fa.makarem": [
            "این نعمتی بود از ناحیه ما؛ این گونه هر کسی را که شکر کند پاداش می‌دهیم!"
          ],
          "fa.moezzi": [
            "نعمتی از نزد ما بدینسان پاداش دهیم آن را که سپاسگزارد"
          ],
          "fa.mojtabavi": [
            "تا نعمتى باشد از نزد ما اينگونه هر كه را سپاسدار است پاداش مى‌دهيم."
          ],
          "fa.sadeqi": [
            "حال آنکه نعمتی از جانب ما بود. هر که پاس و سپاس دارد، بدین‌سان (او را) پاداش می‌دهیم."
          ]
        }
      },
      {
        "index": 4882,
        "local_index": 36,
        "part_type": "Verse",
        "path": "/books/quran:54:36",
        "text": [
          "وَ لَقَدْ أَنْذَرَهُمْ‌ بَطْشَتَنَا فَتَمَارَوْا بِالنُّذُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "He had warned them of Our might, but they passed over the warnings."
          ],
          "en.ahmedraza": [
            "And indeed he had warned them of Our seizure – in response they doubted the warnings."
          ],
          "en.arberry": [
            "He had warned them of Our assault, but they disputed the warnings."
          ],
          "en.daryabadi": [
            "And assuredly he had warned them of Our grasp, but: they doubted the warnings."
          ],
          "en.hilali": [
            "And he [Lout (Lot)] indeed had warned them of Our Grasp, but they did doubt the warnings!"
          ],
          "en.itani": [
            "He had warned them of Our onslaught, but they dismissed the warnings."
          ],
          "en.maududi": [
            "Surely Lot warned his people that We shall seize them (with Our chastisement), but they doubted the warnings."
          ],
          "en.mubarakpuri": [
            "And he indeed had warned them of Our punishment, but they doubted the warnings!"
          ],
          "en.pickthall": [
            "And he indeed had warned them of Our blow, but they did doubt the warnings."
          ],
          "en.qarai": [
            "He had already warned them of Our punishment, but they disputed the warnings."
          ],
          "en.qaribullah": [
            "He had warned them of Our assault but they disputed the warnings."
          ],
          "en.sahih": [
            "And he had already warned them of Our assault, but they disputed the warning."
          ],
          "en.sarwar": [
            "Lot warned them against Our torment, but they persistently disputed it."
          ],
          "en.shakir": [
            "And certainly he warned them of Our violent seizure, but they obstinately disputed the warning."
          ],
          "en.transliteration": [
            "Walaqad an<u>th</u>arahum ba<u>t</u>shatan<u>a</u> fatam<u>a</u>raw bi<b>al</b>nnu<u>th</u>ur<b>i</b>"
          ],
          "en.wahiduddin": [
            "Lot warned them of Our punishment, but they disputed the warnings --"
          ],
          "en.yusufali": [
            "And (Lut) did warn them of Our Punishment, but they disputed about the Warning."
          ],
          "fa.ansarian": [
            "به راستی لوط آنان را به مؤاخذه سخت ما بیم داده بود، ولی [آنان با وی] در بیمها و هشدارها [یش] سرسختانه مجادله و ستیزه کردند."
          ],
          "fa.ayati": [
            "از انتقام سخت ما ترسانيدشان ولى با بيم‌دهندگان به جدال برخاستند."
          ],
          "fa.bahrampour": [
            "و همانا [لوط] آنها را از عذاب سخت ما بيم داده بود، ولى با آن هشدارها به ستيزه برخاستند"
          ],
          "fa.fooladvand": [
            "و [لوط] آنها را از عذاب ما سخت بيم داده بود، و[لى‌] در تهديدها[ى ما] به جدال برخاستند."
          ],
          "fa.ghomshei": [
            "لوط آن قوم را از قهر و مؤاخذه ما ترسانید باز آنها در آیات ما شک و انکار کردند."
          ],
          "fa.khorramdel": [
            "لوط ایشان را از گرفتار کردن و کیفر دادن ما بیم داد، ولی آنان بر شک و گمان خود نسبت به بیم دادنها و برحذر داشتنها افزودند (و بدانها باور نکردند و بیراهه رفتند). [[«بَطْشَةَ»: فرو گرفتن و گرفتار ساختن. حمله کردن و کیفر دادن (نگا: دخان / 16). «تَمَارَوْا»: شک کردند و گمان ورزیدند. «النُّذُرِ»: (نگا: قمر / 5 و 23 و 33).]]"
          ],
          "fa.khorramshahi": [
            "و به راستی [لوط] آنان را از سختگیری ما هشدار داده بود، ولی در برابر هشدار گردنکشی می‌کردند"
          ],
          "fa.makarem": [
            "او آنها را از مجازات ما بیم داد، ولی بر آنها اصرار بر مجادله و القای شکّ داشتند!"
          ],
          "fa.moezzi": [
            "و هر آینه ترسانید ایشان را از خشم ما پس ستیزه کردند با بیم‌دهندگان‌"
          ],
          "fa.mojtabavi": [
            "و همانا [لوط] آنها را از عذاب سخت ما بيم داد، ولى با آن هشدارها- يا با بيم‌دهندگان- به ستيزه برخاستند."
          ],
          "fa.sadeqi": [
            "و (لوط) آنها را همواره از حمله‌ی ناگهانیمان سخت بیم داده بود. پس درباره‌ی تهدیدکنندگان تردید کرده‌، به جدال برخاستند."
          ]
        }
      },
      {
        "index": 4883,
        "local_index": 37,
        "part_type": "Verse",
        "path": "/books/quran:54:37",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:46:28",
            "/books/al-kafi:8:1:46:29"
          ]
        },
        "text": [
          "وَ لَقَدْ رَاوَدُوهُ‌ عَنْ‌ ضَيْفِهِ‌ فَطَمَسْنَا أَعْيُنَهُمْ‌ فَذُوقُوا عَذَابِي‌ وَ نُذُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "They lusted after his guests, so We put out their eyes (and said): \"Taste My punishment and My commination.\""
          ],
          "en.ahmedraza": [
            "And they tried to persuade him regarding his guests – We therefore blinded their eyes, “So taste My punishment, and My warnings.”"
          ],
          "en.arberry": [
            "Even his guests they had solicited of him; so We obliterated their eyes, saying, 'Taste now My chastisement and My warnings!'"
          ],
          "en.daryabadi": [
            "And assuredly they solicited him for his guests: then We wiped out their eyes: taste then My torment and My warnings."
          ],
          "en.hilali": [
            "And they indeed sought to shame his guest (by asking to commit sodomy with them). So We blinded their eyes, \"Then taste you My Torment and My Warnings.\""
          ],
          "en.itani": [
            "They even lusted for his guest, so We obliterated their eyes. “So taste My punishment and My warnings.”"
          ],
          "en.maududi": [
            "Then they even solicited his guests from him, whereupon We blotted out their eyes, (telling them): “Now have a taste of My chastisement and My warnings.”"
          ],
          "en.mubarakpuri": [
            "And they indeed sought to shame his guests. So, We blinded their eyes (saying), \"Then taste you My torment and My warnings.\""
          ],
          "en.pickthall": [
            "They even asked of him his guests for an ill purpose. Then We blinded their eyes (and said): Taste now My punishment after My warnings!"
          ],
          "en.qarai": [
            "They even solicited of him his guests, whereat We blotted out their eyes, [saying,] ‘Taste My punishment and My warnings!’"
          ],
          "en.qaribullah": [
            "They even solicited of him his guests, but We obliterated their eyes: 'Now, taste My punishment and My warnings'"
          ],
          "en.sahih": [
            "And they had demanded from him his guests, but We obliterated their eyes, [saying], \"Taste My punishment and warning.\""
          ],
          "en.sarwar": [
            "They demanded that he turn over his guests to them."
          ],
          "en.shakir": [
            "And certainly they endeavored to turn him from his guests, but We blinded their eyes; so taste My chastisement and My warning."
          ],
          "en.transliteration": [
            "Walaqad r<u>a</u>wadoohu AAan <u>d</u>ayfihi fa<u>t</u>amasn<u>a</u> aAAyunahum fa<u>th</u>ooqoo AAa<u>tha</u>bee wanu<u>th</u>ur<b>i</b>"
          ],
          "en.wahiduddin": [
            "they even wanted to seduce his guests -- but We blinded them, and said, \"Taste My punishment now that you have scorned My warnings!\" --"
          ],
          "en.yusufali": [
            "And they even sought to snatch away his guests from him, but We blinded their eyes. (They heard:) \"Now taste ye My Wrath and My Warning.\""
          ],
          "fa.ansarian": [
            "و از میهمانانش [که در حقیقت فرشتگان ما بودند] کام جویی خواستند، در نتیجه دیدگانشان را محو و نابینا کردیم؛ پس [گفتیم: طعمِ] عذاب و هشدارهایم را بچشید."
          ],
          "fa.ayati": [
            "از مهمان او كارى زشت خواستند. ما نيز چشمانشان را كور گردانيديم. پس بچشيد عذاب و بيم‌دادنهاى مرا."
          ],
          "fa.bahrampour": [
            "و از مهمانان او كام زشت خواستند، پس چشمانشان را كور كرديم [و گفتيم:] اينك بچشيد عذاب و هشدارهاى مرا"
          ],
          "fa.fooladvand": [
            "و از مهمان‌[هاى‌] او كام دل خواستند، پس فروغ ديدگانشان را سترديم و [گفتيم:] «[مزه‌] عذاب و هشدارهاى مرا بچشيد.»"
          ],
          "fa.ghomshei": [
            "و قوم از او مهمانانش را (که فرشتگانی زیبا بودند، بر سوء قصد) طلبیدند، ما هم چشم آنها را بی‌نور و نابینا کردیم (و گفتیم که) اینک عذاب قهر و انتقام مرا بچشید."
          ],
          "fa.khorramdel": [
            "و با لوط درباره‌ی مهمانانش سخن گفتند (و از او خواستند آنان را در اختیار ایشان برای انجام کار منافی عفت بگذارد). ما چشمانشان را کور کردیم، (و بدیشان گفتیم:) بچشید عذاب و عقاب مرا، و بیم دادنها و برحذر داشتنهای مرا. [[«رَاوَدُوهُ»: با او گفتگو کردند. «رَاوَدُوهُ عَن ضَیْفِهِ»: مراد این است که از لوط خواستند که از جانبداری مهمانان دست بردارد و ایشان را در اختیار آنان بگذارد، تا هر چه خواستند از اعمال منافی عفت نسبت بدیشان روا دارند (نگا: هود / 78، حجر / 68). «طَمَسْنَا»: از میان برداشتیم. محو و نابود کردیم (نگا: نساء / 47، یونس / 88، یس / 66). «نُذُرِ»: (نگا: قمر / 30).]]"
          ],
          "fa.khorramshahi": [
            "و به راستی از مهمانان او کام می‌خواستند، پس ایشان را نابینا ساختیم [و گفتیم‌] پس عذاب و هشدار مرا بچشید"
          ],
          "fa.makarem": [
            "آنها از لوط خواستند میهمانانش را در اختیارشان بگذارد؛ ولی ما چشمانشان را نابینا و محو کردیم (و گفتیم:) بچشید عذاب و انذارهای مرا!"
          ],
          "fa.moezzi": [
            "و همانا کام خواستندش از میهمانانش پس پوشیدیم دیدگان ایشان را پس بچشید عذاب من و ترسانندگان مرا"
          ],
          "fa.mojtabavi": [
            "و مهمانانش را از او خواستند- تا به آنان دست‌درازى كنند-، پس چشمانشان را كور كرديم، [و گفتيم:] اينك بچشيد عذاب و هشدارهاى مرا."
          ],
          "fa.sadeqi": [
            "و همواره از مهمان(های) او با حیله و مراوده بسی کام دل خواستند. پس فروغ دیدگانشان را ستردیم. پس عذاب مرا و هشداردهندگان مرا بچشید."
          ]
        }
      },
      {
        "index": 4884,
        "local_index": 38,
        "part_type": "Verse",
        "path": "/books/quran:54:38",
        "text": [
          "وَ لَقَدْ صَبَّحَهُمْ‌ بُکْرَةً عَذَابٌ‌ مُسْتَقِرٌّ"
        ],
        "translations": {
          "en.ahmedali": [
            "And early in the morning the decreed punishment came upon them."
          ],
          "en.ahmedraza": [
            "And indeed, the everlasting punishment overcame them early in the morning."
          ],
          "en.arberry": [
            "In the morning early there came upon them a settled chastisement:"
          ],
          "en.daryabadi": [
            "And assuredly there met them early in the morning a torment settled."
          ],
          "en.hilali": [
            "And verily, an abiding torment seized them early in the morning."
          ],
          "en.itani": [
            "Early morning brought upon them enduring punishment."
          ],
          "en.maududi": [
            "Indeed an abiding chastisement came upon them in the morning."
          ],
          "en.mubarakpuri": [
            "And verily, an abiding torment seized them early in the morning."
          ],
          "en.pickthall": [
            "And in truth the punishment decreed befell them early in the morning."
          ],
          "en.qarai": [
            "Early at dawn there visited them an abiding punishment:"
          ],
          "en.qaribullah": [
            "And at daybreak a determined punishment came upon them."
          ],
          "en.sahih": [
            "And there came upon them by morning an abiding punishment."
          ],
          "en.sarwar": [
            "We struck their faces, blinded them and said, \"Suffer Our torment of which you were warned\"."
          ],
          "en.shakir": [
            "And certainly a lasting chastisement overtook them in the morning."
          ],
          "en.transliteration": [
            "Walaqad <u>s</u>abba<u>h</u>ahum bukratan AAa<u>tha</u>bun mustaqirr<b>un</b>"
          ],
          "en.wahiduddin": [
            "and early in the morning the punishment decreed overtook them --"
          ],
          "en.yusufali": [
            "Early on the morrow an abiding Punishment seized them:"
          ],
          "fa.ansarian": [
            "به یقین در سپیده دم عذابی پیگیر و پایدار به آنان رسید."
          ],
          "fa.ayati": [
            "هر آينه بامدادان عذابى پايدار به سر وقتشان آمد."
          ],
          "fa.bahrampour": [
            "و همانا سپيده دم عذابى پايدار و ثابت بر سرشان آمد"
          ],
          "fa.fooladvand": [
            "و به راستى كه سپيده‌دم عذابى پيگير به سر وقت آنان آمد."
          ],
          "fa.ghomshei": [
            "و شبی به صبحگاه رسید که (مرگ آمد و) عذاب دایم (دوزخ) گریبانشان گرفت."
          ],
          "fa.khorramdel": [
            "بامدادان عذاب پیاپی و کوبنده و پایدار به سراغ ایشان آمد. [[«صَبَّحَهُمْ»: در فاصله طلوع فجر صادق و طلوع خورشید به سروقتشان آمد. «صَبَّحَ»: از مصدر تصبیح، بامدادان به پیش کسی آمدن. «بُکْرَةً»: صبح زود. اول صبح. «مُسْتَقِرٌّ»: دائم و همیشگی، چرا که عذاب دنیوی ایشان با عذاب برزخی آنان اتصال پیدا کرد. پیاپی و کاری، زیرا تا آنان را از میان نبرد، ادامه داشت (نگا: قمر / 3، نمل / 40).]]"
          ],
          "fa.khorramshahi": [
            "و به راستی بامدادی پگاه عذابی پایدار آنان را فرو گرفت‌"
          ],
          "fa.makarem": [
            "سرانجام صبحگاهان و در اول روز عذابی پایدار و ثابت به سراغشان آمد!"
          ],
          "fa.moezzi": [
            "و همانا بامداد کرد بر ایشان بگاه عذابی جایگزین‌"
          ],
          "fa.mojtabavi": [
            "و همانا بامداد عذابى پايدار بديشان رسيد."
          ],
          "fa.sadeqi": [
            "و به‌راستی صبحگاهان بی‌امان عذابی ماندنی به سراغ آنان آمد."
          ]
        }
      },
      {
        "index": 4885,
        "local_index": 39,
        "part_type": "Verse",
        "path": "/books/quran:54:39",
        "text": [
          "فَذُوقُوا عَذَابِي‌ وَ نُذُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "So now taste My punishment and My commination!"
          ],
          "en.ahmedraza": [
            "“So taste My punishment, and My warnings!”"
          ],
          "en.arberry": [
            "'Taste now My chastisement and My warnings!'"
          ],
          "en.daryabadi": [
            "Taste then My torment and My warnings."
          ],
          "en.hilali": [
            "\"Then taste you My Torment and My Warnings.\""
          ],
          "en.itani": [
            "So taste My punishment and My warnings."
          ],
          "en.maududi": [
            "So have a taste of My chastisement and My warnings."
          ],
          "en.mubarakpuri": [
            "Then taste you My torment and My warnings."
          ],
          "en.pickthall": [
            "Now taste My punishment after My warnings!"
          ],
          "en.qarai": [
            "‘Taste My punishment and warnings!’"
          ],
          "en.qaribullah": [
            "'Now, taste My punishment and My warnings'"
          ],
          "en.sahih": [
            "So taste My punishment and warning."
          ],
          "en.sarwar": [
            "One early morning Our torment brought upon them utter destruction. We said, \"Suffer Our torment of which you were warned\"."
          ],
          "en.shakir": [
            "So taste My chastisement and My warning."
          ],
          "en.transliteration": [
            "Fa<u>th</u>ooqoo AAa<u>tha</u>bee wanu<u>th</u>ur<b>i</b>"
          ],
          "en.wahiduddin": [
            "\"Taste My punishment now that you have scorned My warnings!\""
          ],
          "en.yusufali": [
            "\"So taste ye My Wrath and My Warning.\""
          ],
          "fa.ansarian": [
            "پس [گفتیم: طعمِ] عذاب و هشدارهایم را بچشید."
          ],
          "fa.ayati": [
            "پس عذاب من و بيم‌دادنهاى مرا بچشيد."
          ],
          "fa.bahrampour": [
            "پس عذاب و هشدارهاى مرا بچشيد"
          ],
          "fa.fooladvand": [
            "پس عذاب و هشدارهاى مرا بچشيد."
          ],
          "fa.ghomshei": [
            "(و گفتیم) اینک عذاب قهر و انتقام مرا بچشید."
          ],
          "fa.khorramdel": [
            "پس بچشید عذاب و عقاب مرا، و بیم دادنها و بر حذر داشتنهای مرا. [[«فَذُوقُوا ...»: (نگا: قمر / 37).]]"
          ],
          "fa.khorramshahi": [
            "[و گفتیم‌] پس عذاب و هشدار مرا بچشید"
          ],
          "fa.makarem": [
            "(و گفتیم:) پس بچشید عذاب و انذارهای مرا!"
          ],
          "fa.moezzi": [
            "پس بچشید عذاب من و ترسانندگان مرا"
          ],
          "fa.mojtabavi": [
            "پس بچشيد عذاب و هشدارهاى مرا."
          ],
          "fa.sadeqi": [
            "عذاب و هشداردهندگان مرا بچشید."
          ]
        }
      },
      {
        "index": 4886,
        "local_index": 40,
        "part_type": "Verse",
        "path": "/books/quran:54:40",
        "text": [
          "وَ لَقَدْ يَسَّرْنَا الْقُرْآنَ‌ لِلذِّکْرِ فَهَلْ‌ مِنْ‌ مُدَّکِرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "Easy have We made the Qur'an to understand: So is there any one who will be warned?"
          ],
          "en.ahmedraza": [
            "And We have indeed made the Qur’an easy to memorise, so is there one who would remember?"
          ],
          "en.arberry": [
            "Now We have made the Koran easy for Remembrance. Is there any that will remember?"
          ],
          "en.daryabadi": [
            "And assuredly We have made the Qur'an easy for admonition; is there then any one who would be admonished."
          ],
          "en.hilali": [
            "And indeed, We have made the Quran easy to understand and remember, then is there any that will remember (or receive admonition)?"
          ],
          "en.itani": [
            "We made the Quran easy to memorize. Is there anyone who would memorize?"
          ],
          "en.maududi": [
            "Surely We have made this Qur'an easy as a reminder. Is there, then, any who will take heed?"
          ],
          "en.mubarakpuri": [
            "And indeed, We have made the Qur'an easy to understand and remember; then is there any that will remember"
          ],
          "en.pickthall": [
            "And in truth We have made the Qur'an easy to remember; but is there any that remembereth?"
          ],
          "en.qarai": [
            "Certainly We have made the Quran simple for the sake of admonishment. So is there anyone who will be admonished?"
          ],
          "en.qaribullah": [
            "We have made the Koran an easy Remembrance, is there any that will remember!"
          ],
          "en.sahih": [
            "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?"
          ],
          "en.sarwar": [
            "We have made the Quran easy to understand, but is there anyone who would pay attention?"
          ],
          "en.shakir": [
            "And certainly We have made the Quran easy for remembrance, but is there anyone who will mind?"
          ],
          "en.transliteration": [
            "Walaqad yassarn<u>a</u> alqur<u>a</u>na li<b>l</b><u>thth</u>ikri fahal min muddakir<b>in</b>"
          ],
          "en.wahiduddin": [
            "We have made it easy indeed to learn lessons from the Quran. Is there anyone who would receive admonition?"
          ],
          "en.yusufali": [
            "And We have indeed made the Qur'an easy to understand and remember: then is there any that will receive admonition?"
          ],
          "fa.ansarian": [
            "و یقیناً ما قرآن را برای پند گرفتن آسان کردیم، پس آیا پند گیرنده ای هست؟"
          ],
          "fa.ayati": [
            "و اين قرآن را آسان ادا كرديم تا از آن پند گيرند. آيا پندگيرنده‌اى هست؟"
          ],
          "fa.bahrampour": [
            "و قطعا قرآن را براى پند آموزى آسان كرديم، پس آيا پند گيرنده‌اى هست"
          ],
          "fa.fooladvand": [
            "و قطعاً قرآن را براى پندآموزى آسان كرديم؛ پس آيا پندگيرنده‌اى هست؟"
          ],
          "fa.ghomshei": [
            "و ما قرآن را برای وعظ و اندرز بر فهم آسان کردیم آیا کسی هست که از آن پند گیرد؟"
          ],
          "fa.khorramdel": [
            "ما قرآن را برای یاددادن ویادگرفتن وپنددادن وپندگرفتن ساده و آسان نموده‌ایم، آیا پندپذیرنده و عبرت‌گیرنده ای هست؟ [[«وَ لَقَدْ یَسَّرْنَا ...»: (نگا: قمر / 17 و 32).]]"
          ],
          "fa.khorramshahi": [
            "و به راستی قرآن را قابل پندگیری گرداندیم، پس آیا پندپذیری هست؟"
          ],
          "fa.makarem": [
            "ما قرآن را برای یادآوری آسان ساختیم؛ آیا کسی هست که متذکّر شود؟!"
          ],
          "fa.moezzi": [
            "و همانا آماده ساختیم قرآن را برای یادآوردن پس آیا هست یادآورنده‌"
          ],
          "fa.mojtabavi": [
            "و همانا قرآن را براى يادآورى و پندگرفتن آسان ساختيم، پس آيا يادآرنده و پندگيرنده‌اى هست؟"
          ],
          "fa.sadeqi": [
            "و بی‌گمان قرآن را برای هشدار آسان کردیم‌؛ پس آیا هیچ هشدارگیرنده‌ای هست‌؟"
          ]
        }
      },
      {
        "index": 4887,
        "local_index": 41,
        "part_type": "Verse",
        "path": "/books/quran:54:41",
        "text": [
          "وَ لَقَدْ جَاءَ آلَ‌ فِرْعَوْنَ‌ النُّذُرُ"
        ],
        "translations": {
          "en.ahmedali": [
            "The warnings came to the people of Pharaoh."
          ],
          "en.ahmedraza": [
            "And indeed the Noble Messengers came to the people of Firaun."
          ],
          "en.arberry": [
            "The warnings came also to Pharaoh's folk."
          ],
          "en.daryabadi": [
            "And assuredly Unto the household of Fir'awn came the warning."
          ],
          "en.hilali": [
            "And indeed, warnings came to the people of Fir'aun (Pharaoh) [through Musa (Moses) and Harun (Aaron)]."
          ],
          "en.itani": [
            "The warnings also came to the people of Pharaoh."
          ],
          "en.maududi": [
            "Warnings also came to the Pharaonites,"
          ],
          "en.mubarakpuri": [
            "And indeed, warnings came to the people of Fir`awn."
          ],
          "en.pickthall": [
            "And warnings came in truth unto the house of Pharaoh"
          ],
          "en.qarai": [
            "Certainly the warnings did come to Pharaoh’s clan"
          ],
          "en.qaribullah": [
            "The warnings also came to Pharaoh's people,"
          ],
          "en.sahih": [
            "And there certainly came to the people of Pharaoh warning."
          ],
          "en.sarwar": [
            "The Pharaoh and his people had also received Our warning,"
          ],
          "en.shakir": [
            "And certainly the warning came to Firon's people."
          ],
          "en.transliteration": [
            "Walaqad j<u>a</u>a <u>a</u>la firAAawna a<b>l</b>nnu<u>th</u>ur<b>u</b>"
          ],
          "en.wahiduddin": [
            "Surely warners came to the people of Pharaoh."
          ],
          "en.yusufali": [
            "To the People of Pharaoh, too, aforetime, came Warners (from Allah)."
          ],
          "fa.ansarian": [
            "و همانا برای فرعونیان بیم دهندگان آمدند."
          ],
          "fa.ayati": [
            "بيم‌دهندگان نزد خاندان فرعون آمدند."
          ],
          "fa.bahrampour": [
            "و همانا بيم رسانان به جانب فرعونيان آمدند"
          ],
          "fa.fooladvand": [
            "و در حقيقت هشداردهندگان به جانب فرعونيان آمدند."
          ],
          "fa.ghomshei": [
            "و بر ارشاد فرعونیان هم رسول و آیات الهی آمد."
          ],
          "fa.khorramdel": [
            "بیدار باشها و هوشدارها (یکی پس از دیگری) به سراغ فرعونیان آمد. [[«النُّذُرُ»: (نگا: قمر / 5 و 23 و 33 و 36). «آلَ فِرْعَوْنَ»: خاندان و بستگان و همه پیروان فرعون.]]"
          ],
          "fa.khorramshahi": [
            "و به راستی هشداردهندگان به سراغ خاندان فرعون آمدند"
          ],
          "fa.makarem": [
            "و (همچنین) انذارها و هشدارها (یکی پس از دیگری) به سراغ آل فرعون آمد،"
          ],
          "fa.moezzi": [
            "و همانا بیامدند خاندان فرعون را ترسانندگان‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه فرعونيان را هشدارهاى من رسيد."
          ],
          "fa.sadeqi": [
            "و به‌درستی هشداردهندگان سوی فرعونیان آمدند."
          ]
        }
      },
      {
        "index": 4888,
        "local_index": 42,
        "part_type": "Verse",
        "path": "/books/quran:54:42",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:18:2"
          ]
        },
        "text": [
          "کَذَّبُوا بِآيَاتِنَا کُلِّهَا فَأَخَذْنَاهُمْ‌ أَخْذَ عَزِيزٍ مُقْتَدِرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "They rejected each one of Our signs. So We seized them with the grip of one mighty and powerful."
          ],
          "en.ahmedraza": [
            "They denied all Our signs, We therefore seized them – the seizure of the Most Honourable, the All Powerful."
          ],
          "en.arberry": [
            "They cried lies to Our signs, all of them, so We seized them with the seizing of One mighty, omnipotent."
          ],
          "en.daryabadi": [
            "They belied Our signs everyone thereof; whereof We laid hold of them with the grip of our Mighty, Powerful."
          ],
          "en.hilali": [
            "(They) belied all Our Signs, so We seized them with a Seizure of the All-Mighty, All-Capable to carry out what he Will (Omnipotent)."
          ],
          "en.itani": [
            "They rejected Our signs, all of them, so We seized them—the seizure of an Almighty Omnipotent."
          ],
          "en.maududi": [
            "but they gave the lie to Our Signs, to all of them. Thereupon We seized them with the seizing of the Most Mighty, the Most Powerful."
          ],
          "en.mubarakpuri": [
            "(They) denied all Our signs, so We seized them with a punishment of the Almighty, All-Capable."
          ],
          "en.pickthall": [
            "Who denied Our revelations, every one. Therefore We grasped them with the grasp of the Mighty, the Powerful."
          ],
          "en.qarai": [
            "who denied all of Our signs. So We seized them with the seizing of One [who is] all-mighty, Omnipotent."
          ],
          "en.qaribullah": [
            "but they belied all Our signs so We seized them with the seizing of the Mighty, Powerful."
          ],
          "en.sahih": [
            "They denied Our signs, all of them, so We seized them with a seizure of one Exalted in Might and Perfect in Ability."
          ],
          "en.sarwar": [
            "but they rejected all Our miracles. So We seized them in the way that a Majestic and All-powerful One would."
          ],
          "en.shakir": [
            "They rejected all Our communications, so We overtook them after the manner of a Mighty, Powerful One."
          ],
          "en.transliteration": [
            "Ka<u>thth</u>aboo bi<u>a</u>y<u>a</u>tin<u>a</u> kullih<u>a</u> faakha<u>th</u>n<u>a</u>hum akh<u>th</u>a AAazeezin muqtadir<b>in</b>"
          ],
          "en.wahiduddin": [
            "They, too, rejected all Our signs. So We seized them with the seizure of One Mighty, Omnipotent."
          ],
          "en.yusufali": [
            "The (people) rejected all Our Signs; but We seized them with such Penalty (as comes) from One Exalted in Power, able to carry out His Will."
          ],
          "fa.ansarian": [
            "[آنان] همه معجزات و آیات ما را تکذیب کردند؛ در نتیجه آنان را [به عذابی سخت] گرفتیم، گرفتن توانایی شکست ناپذیر و نیرومند."
          ],
          "fa.ayati": [
            "همه آيات ما را تكذيب كردند. ما نيز آنها را فرو گرفتيم چون فروگرفتن پيروزمندى مقتدر."
          ],
          "fa.bahrampour": [
            "[اما آنها] همه معجزات ما را تكذيب كردند، پس آنها را همچون گرفتن پيروزمندى مقتدر بگرفتيم"
          ],
          "fa.fooladvand": [
            "[اما آنها] همه معجزات ما را تكذيب كردند، تا چون زبردستى زورمند [گريبان‌] آنان را گرفتيم."
          ],
          "fa.ghomshei": [
            "آنها همه آیات ما را تکذیب کردند، ما هم به قهر و اقتدار خود از آنها سخت مؤاخذه کردیم."
          ],
          "fa.khorramdel": [
            "آنان همه آیات ما را تکذیب کردند، و ما هم ایشان را گرفتار کردیم و کیفر دادیم بسان گرفتار ساختن و کیفر دادن خدائی چیره و پیروز و قدرتمند و زبردست. [[«آیَاتِ»: آیه‌های کتاب آسمانی و معجزات پیغمبران.]]"
          ],
          "fa.khorramshahi": [
            "آنان همه معجزات ما را دروغ شمردند، آنگاه آنان را چنان فرو گرفتیم که پیروزمند توانمند گیرد"
          ],
          "fa.makarem": [
            "امّا آنها همه آیات ما را تکذیب کردند، و ما آنها را گرفتیم و مجازات کردیم، گرفتن شخصی قدرتمند و توانا!"
          ],
          "fa.moezzi": [
            "پس تکذیب کردند به آیتهای ما همگی آنها پس گرفتیمشان گرفتن مهتری نیرومند"
          ],
          "fa.mojtabavi": [
            "[ولى‌] همه نشانه‌هاى- سخنان و معجزه‌هاى- ما را دروغ انگاشتند، پس بگرفتيمشان گرفتن بى‌همتا تواناى نيرومند."
          ],
          "fa.sadeqi": [
            "(اما آنها) با همه‌ی نشانه‌های ما (همان‌ها و ما را) تکذیب کردند. پس ما با عزت و اقتدار (گریبان) آنان را فرو گرفتیم."
          ]
        }
      },
      {
        "index": 4889,
        "local_index": 43,
        "part_type": "Verse",
        "path": "/books/quran:54:43",
        "text": [
          "أَ کُفَّارُکُمْ‌ خَيْرٌ مِنْ‌ أُولٰئِکُمْ‌ أَمْ‌ لَکُمْ‌ بَرَاءَةٌ فِي‌ الزُّبُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "Are the unbelievers among you any better than they? Or is there immunity for you in the Scriptures?"
          ],
          "en.ahmedraza": [
            "Are your disbelievers better than they were, or have you been given exemption in the Books?"
          ],
          "en.arberry": [
            "What, are your unbelievers better than those? Or have you an immunity in the Scrolls?"
          ],
          "en.daryabadi": [
            "Are your infidels better than these? Or is there an immunity for you in the Writs?"
          ],
          "en.hilali": [
            "Are your disbelievers (O Quraish!) better than these [nations of Nuh (Noah), Lout (Lot), Salih (Saleh), and the people of Fir'aun (Pharaoh), etc., who were destroyed)? Or have you an immunity (against Our Torment) in the Divine Scriptures?"
          ],
          "en.itani": [
            "Are your unbelievers better than all those? Or do you have immunity in the scriptures?"
          ],
          "en.maududi": [
            "Are your unbelievers (of Makkah) any better than they? Or have you been granted any immunity in the Scriptures?"
          ],
          "en.mubarakpuri": [
            "Are your disbelievers better than these Or have you immunity in the Divine Scriptures"
          ],
          "en.pickthall": [
            "Are your disbelievers better than those, or have ye some immunity in the scriptures?"
          ],
          "en.qarai": [
            "Are your faithless better than those? Have you [been granted] [some sort of] immunity in the scriptures?"
          ],
          "en.qaribullah": [
            "What then, are your unbelievers better than those? Or do you have an immunity (written) in the Scrolls?"
          ],
          "en.sahih": [
            "Are your disbelievers better than those [former ones], or have you immunity in the scripture?"
          ],
          "en.sarwar": [
            "Are you disbelievers mightier than those of the nations which We destroyed before or have you received amnesty through the ancient Scriptures?"
          ],
          "en.shakir": [
            "Are the unbelievers of yours better than these, or is there an exemption for you in the scriptures?"
          ],
          "en.transliteration": [
            "Akuff<u>a</u>rukum khayrun min ol<u>a</u>ikum am lakum bar<u>a</u>atun fee a<b>l</b>zzubur<b>i</b>"
          ],
          "en.wahiduddin": [
            "Are your people who deny the truth better than those? Or have you been given immunity in the Scriptures?"
          ],
          "en.yusufali": [
            "Are your Unbelievers, (O Quraish), better than they? Or have ye an immunity in the Sacred Books?"
          ],
          "fa.ansarian": [
            "آیا کافران [شهر] شما از اقوامی که برشمردیم، بهتر و برترند [تا به سبب بهتری و برتری مصون از عذاب باشند؟] یا برای شما در کتاب های آسمانی امان نامه ای هست [که هر جرمی را مرتکب شوید عذابی نخواهید داشت؟!]"
          ],
          "fa.ayati": [
            "آيا كافران شما از ايشان نيرومندترند يا در كتابها آمده است كه در امان هستيد؟"
          ],
          "fa.bahrampour": [
            "آيا كافران شما [اهل مكه‌] از آنها [كه برشمرديم‌] برترند، يا شما را در نوشته‌ها [ى آسمانى‌] امان نامه‌اى است"
          ],
          "fa.fooladvand": [
            "آيا كافران شما، از اينان [كه برشمرديم‌] برترند، يا شما را در نوشته‌ها[ى آسمانى‌] خط امانى است؟"
          ],
          "fa.ghomshei": [
            "آیا کفار شما (مکّیان) بهتر (و قوی‌تر) از آن امم گذشته‌اند یا شما را برائت و امانی در کتب (آسمانی از عذاب خدا) هست؟"
          ],
          "fa.khorramdel": [
            "(ای قریشیان!) آیا کافران شما بهتر از آنانی هستند که برایتان روایت کردیم، (مثل: قوم نوح، عاد، ثمود، لوط، فرعون؟!). یا این که برای شما امان‌نامه‌ای در کتابها (از سوی خدا) نازل شده است (مبنی بر این که کافرانتان را عذاب نمی‌رسانیم؟!). [[«أَ کُفَّارُکُم ...»: استفهام انکاری است و برای تهدید و سرزنش قریشیان است، و بدیشان می‌فهماند که میان کافران معاصر و میان کافران پیشین تفاوتی نیست و چه بسا شما هم به سرنوشت دردناک ایشان گرفتار آئید. «بَرَآءَةٌ»: امان نامه. مصونیت از عذاب الهی. امان. «الزُّبُرِ»: جمع زَبور، به معنی مزبور، یعنی مکتوب است. مراد کتابهای آسمانی است (نگا: آل‌عمران / 184، نحل / 44، شعراء / 196).]]"
          ],
          "fa.khorramshahi": [
            "آیا کافران شما از همه اینان بهترند، یا برای شما امان نامه‌ای است در کتابهای آسمانی؟"
          ],
          "fa.makarem": [
            "آیا کفّار شما بهتر از آنانند یا برای شما امان‌نامه‌ای در کتب آسمانی نازل شده است؟!"
          ],
          "fa.moezzi": [
            "آیا کافران شما بهترند از اینان یا شما را است بیزاری در کتب‌"
          ],
          "fa.mojtabavi": [
            "آيا كافران شما- اهل مكه- از آنان بهترند يا براى شما در نبشته‌هاى آسمانى امان‌نامه‌اى [از عذاب‌] هست؟!"
          ],
          "fa.sadeqi": [
            "آیا کافرانتان، از اینان (که برشمردیم) برترند، یا شما را در نوشته‌ها(ی وحیانی‌‌تان) خط امانی (از تکلیف و عذاب) است‌؟"
          ]
        }
      },
      {
        "index": 4890,
        "local_index": 44,
        "part_type": "Verse",
        "path": "/books/quran:54:44",
        "text": [
          "أَمْ‌ يَقُولُونَ‌ نَحْنُ‌ جَمِيعٌ‌ مُنْتَصِرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "Or do they say: \"We are a well-accoutred army?\""
          ],
          "en.ahmedraza": [
            "Or they say, “We shall all take revenge as a group.”"
          ],
          "en.arberry": [
            "Or do they say, 'We are a congregation that shall be succoured?'"
          ],
          "en.daryabadi": [
            "Or is it that they say: we are a multitude prevailing!"
          ],
          "en.hilali": [
            "Or do they say: \"We are a great multitude, and we shall be victorious?\""
          ],
          "en.itani": [
            "Or do they say, “We are united, and we will be victorious”?"
          ],
          "en.maududi": [
            "Or do they say: “We are a strong legion, strong enough for victory?”"
          ],
          "en.mubarakpuri": [
            "Or say they: \"We are a great multitude, victorious\""
          ],
          "en.pickthall": [
            "Or say they: We are a host victorious?"
          ],
          "en.qarai": [
            "Do they say, ‘We are a confederate league’?"
          ],
          "en.qaribullah": [
            "Or do they say: 'We are a gathering that will be victorious'"
          ],
          "en.sahih": [
            "Or do they say, \"We are an assembly supporting [each other]\"?"
          ],
          "en.sarwar": [
            "Do they say, \"We shall be victorious because we are united?\""
          ],
          "en.shakir": [
            "Or do they say: We are a host allied together to help each other?"
          ],
          "en.transliteration": [
            "Am yaqooloona na<u>h</u>nu jameeAAun munta<u>s</u>ir<b>un</b>"
          ],
          "en.wahiduddin": [
            "Or do they say, \"We are a united group, and we are bound to prevail?\""
          ],
          "en.yusufali": [
            "Or do they say: \"We acting together can defend ourselves\"?"
          ],
          "fa.ansarian": [
            "یا [آنکه] می گویند: ما گروهی متحد و پشتیبان یکدیگریم [که هرکس بخواهد آسیبی به ما رساند، با قدرت هرچه تمام تر از او انتقام می گیریم؟]"
          ],
          "fa.ayati": [
            "يا مى‌گويند كه ما همگى به انتقام برمى‌خيزيم؟"
          ],
          "fa.bahrampour": [
            "يا مى‌گويند: ما جماعتى هستيم هميار و انتقامگير"
          ],
          "fa.fooladvand": [
            "يا مى‌گويند: «ما همگى انتقام‌گيرنده [و يار و ياور همديگر]يم!»"
          ],
          "fa.ghomshei": [
            "بلکه می‌گویند: ما با هم مجتمع و بسیاریم و پیروزیم."
          ],
          "fa.khorramdel": [
            "یا این که می‌گویند: ما جمعیّت متّحد و نیرومند شکست‌ناپذیری هستیم و همدیگر را یاری می‌دهیم و از دشمنان خود انتقام می‌گیریم. [[«جَمِیعٌ»: جمعیت متحد (نگا: شعراء / 56). «مُنتَصِرٌ»: نیرومند شکست‌ناپذیر. یاری دهنده همدیگر. انتقام گیرنده (نگا: کهف / 43، قصص / 81، ذاریات / 45).]]"
          ],
          "fa.khorramshahi": [
            "یا می‌گویند ما هم‌پشتیم [و] کین‌ستان‌"
          ],
          "fa.makarem": [
            "یا می‌گویند: «ما جماعتی متحّد و نیرومند و پیروزیم»؟!"
          ],
          "fa.moezzi": [
            "یا گویند مائیم همگی یاری‌شدگان‌"
          ],
          "fa.mojtabavi": [
            "بلكه مى‌گويند: ما گروهى هستيم هميار- يا انتقام گيرنده-."
          ],
          "fa.sadeqi": [
            "یا می‌گویند: «ما با یکدیگر پیوند و جمع‌ایم (که) از هم کمک یافته (و در نتیجه) چیره‌ایم!»"
          ]
        }
      },
      {
        "index": 4891,
        "local_index": 45,
        "part_type": "Verse",
        "path": "/books/quran:54:45",
        "text": [
          "سَيُهْزَمُ‌ الْجَمْعُ‌ وَ يُوَلُّونَ‌ الدُّبُرَ"
        ],
        "translations": {
          "en.ahmedali": [
            "The army will be routed and put to flight."
          ],
          "en.ahmedraza": [
            "The group will soon be routed, and will turn their backs to flee."
          ],
          "en.arberry": [
            "Certainly the host shall be routed, and turn their backs."
          ],
          "en.daryabadi": [
            "Anon will their multitude be vanquished, and they will turn the back."
          ],
          "en.hilali": [
            "Their multitude will be put to flight, and they will show their backs."
          ],
          "en.itani": [
            "The multitude will be defeated, and they will turn their backs."
          ],
          "en.maududi": [
            "Soon shall this legion be routed and shall turn their backs and flee."
          ],
          "en.mubarakpuri": [
            "Their multitude will be put to flight, and they will show their backs."
          ],
          "en.pickthall": [
            "The hosts will all be routed and will turn and flee."
          ],
          "en.qarai": [
            "The league will be routed and turn its back [to flee]."
          ],
          "en.qaribullah": [
            "Most certainly their gatherings shall be routed, and they will turn their backs."
          ],
          "en.sahih": [
            "[Their] assembly will be defeated, and they will turn their backs [in retreat]."
          ],
          "en.sarwar": [
            "(Let them know that) this united group will soon run away in defeat."
          ],
          "en.shakir": [
            "Soon shall the hosts be routed, and they shall turn (their) backs."
          ],
          "en.transliteration": [
            "Sayuhzamu aljamAAu wayuwalloona a<b>l</b>ddubur<b>a</b>"
          ],
          "en.wahiduddin": [
            "The hosts shall soon be routed and they shall be put to flight."
          ],
          "en.yusufali": [
            "Soon will their multitude be put to flight, and they will show their backs."
          ],
          "fa.ansarian": [
            "به زودی [این] گروه [متحد در جنگی که خود بر ضد مؤمنان تدارک می بینند] شکست می خورند و پشت کنان می گریزند."
          ],
          "fa.ayati": [
            "زودا كه آن جمع منهزم شود و پشت كرده بازگردند."
          ],
          "fa.bahrampour": [
            "زودا كه اين جمع درهم شكسته شود و پشت كرده بگريزند"
          ],
          "fa.fooladvand": [
            "زودا كه اين جمع در هم شكسته شود و پشت كنند."
          ],
          "fa.ghomshei": [
            "به زودی آن جماعت (در جنگ بدر) شکست خورده و به جنگ پشت کنند."
          ],
          "fa.khorramdel": [
            "جمعیّت ایشان به زودی شکست می‌خورند و پشت می‌کنند و می‌گریزند. [[«یُوَلُّونَ الدُّبُرَ»: پشت خواهند کرد و خواهند گریخت (نگا: آل‌عمران / 111، حشر / 12). در جنگ بدر چنین شد.]]"
          ],
          "fa.khorramshahi": [
            "زودا که آن جمع ورشکسته شود و همه پشت کنند"
          ],
          "fa.makarem": [
            "(ولی بدانند) که بزودی جمعشان شکست می‌خورد و پا به فرارمی‌گذارند!"
          ],
          "fa.moezzi": [
            "زود است شکست خورند گروه و بازگردانند پشتها را"
          ],
          "fa.mojtabavi": [
            "بزودى آن جمع شكست مى‌خورند و پشت‌كرده مى‌گريزند."
          ],
          "fa.sadeqi": [
            "زودا که این جمع در هم شکسته شوند و پشت کنند."
          ]
        }
      },
      {
        "index": 4892,
        "local_index": 46,
        "part_type": "Verse",
        "path": "/books/quran:54:46",
        "text": [
          "بَلِ‌ السَّاعَةُ مَوْعِدُهُمْ‌ وَ السَّاعَةُ أَدْهَى‌ وَ أَمَرُّ"
        ],
        "translations": {
          "en.ahmedali": [
            "Surely the Hour will be the moment of their promise, and that moment will be calamitous and distressing."
          ],
          "en.ahmedraza": [
            "In fact their promise is upon the Last Day – and the Last Day is very severe and very bitter!"
          ],
          "en.arberry": [
            "Nay, but the Hour is their tryst, and the Hour is very calamitous and bitter."
          ],
          "en.daryabadi": [
            "Aye! the Hour is their appointed term, and the Hour shall be far more grievous and far more bitter."
          ],
          "en.hilali": [
            "Nay, but the Hour is their appointed time (for their full recompense), and the Hour will be more grievous and more bitter."
          ],
          "en.itani": [
            "The Hour is their appointed time—the Hour is more disastrous, and most bitter."
          ],
          "en.maududi": [
            "Nay; the Hour of Doom is their appointed time, and the Hour shall be more calamitous and bitter."
          ],
          "en.mubarakpuri": [
            "Nay, but the Hour is their appointed time, and the Hour will be more grievous and more bitter."
          ],
          "en.pickthall": [
            "Nay, but the Hour (of doom) is their appointed tryst, and the Hour will be more wretched and more bitter (than their earthly failure)."
          ],
          "en.qarai": [
            "Indeed, the Hour is their tryst; and the Hour will be most calamitous and bitter."
          ],
          "en.qaribullah": [
            "Rather, the Hour is their encounter. And that Hour will be most calamitous and bitter."
          ],
          "en.sahih": [
            "But the Hour is their appointment [for due punishment], and the Hour is more disastrous and more bitter."
          ],
          "en.sarwar": [
            "In fact, the Hour of Doom is the time for them to suffer. The suffering of this hour is the most calamitous and the most bitter (of all suffering)."
          ],
          "en.shakir": [
            "Nay, the hour is their promised time, and the hour shall be most grievous and bitter."
          ],
          "en.transliteration": [
            "Bali a<b>l</b>ss<u>a</u>AAatu mawAAiduhum wa<b>al</b>ss<u>a</u>AAatu adh<u>a</u> waamar<b>ru</b>"
          ],
          "en.wahiduddin": [
            "Indeed, the Hour of Doom is their appointed time, and the Last Hour will be the most severe, and the most bitter."
          ],
          "en.yusufali": [
            "Nay, the Hour (of Judgment) is the time promised them (for their full recompense): And that Hour will be most grievous and most bitter."
          ],
          "fa.ansarian": [
            "بلکه وعده گاهشان قیامت است، و قیامت هولناک تر و تلخ تر است."
          ],
          "fa.ayati": [
            "بلكه وعده‌گاه آنها قيامت است و قيامت بلاخيزتر و تلختر است."
          ],
          "fa.bahrampour": [
            "بلكه موعدشان قيامت است، و [مجازات‌] قيامت هولناك‌تر و تلخ‌تر است"
          ],
          "fa.fooladvand": [
            "بلكه موعدشان قيامت است و قيامت [بسى‌] سخت‌تر و تلخ‌تر است."
          ],
          "fa.ghomshei": [
            "بلکه ساعت قیامت وعده‌گاه آنهاست و آن روزی بسیار سخت‌تر و ناگوارتر (از روز بدر) است."
          ],
          "fa.khorramdel": [
            "بلکه موعدشان قیامت است، و قیامت بلای آن عظیم‌تر و تلخ‌تر (از کشتن و اسارت این جهانی برای ایشان) است. [[«أَدْهَی»: دارای بلای اعظم، بگونه‌ای که نجات از آن ممکن نیست. «أَمَرُّ»: دارای مرارت و تلخی بیشتر.]]"
          ],
          "fa.khorramshahi": [
            "آری قیامت موعد [اصلی‌] ایشان است و قیامت سهمگین‌تر و تلخ‌تر است‌"
          ],
          "fa.makarem": [
            "(علاوه بر این) رستاخیز موعد آنهاست، و مجازات قیامت هولناکتر و تلختر است!"
          ],
          "fa.moezzi": [
            "بلکه ساعت است وعده‌گاه ایشان و ساعت است هراسناک‌تر و تلخ‌تر"
          ],
          "fa.mojtabavi": [
            "بلكه وعدگاهشان رستاخيز است و رستاخيز سخت‌تر و تلختر است."
          ],
          "fa.sadeqi": [
            "بلکه موعدشان‌، ساعت [:قیامت] است و ساعت‌، هراسناک‌تر و تلخ‌تر است."
          ]
        }
      },
      {
        "index": 4893,
        "local_index": 47,
        "part_type": "Verse",
        "path": "/books/quran:54:47",
        "text": [
          "إِنَ‌ الْمُجْرِمِينَ‌ فِي‌ ضَلاَلٍ‌ وَ سُعُرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "Surely the sinners are misguided and insane."
          ],
          "en.ahmedraza": [
            "Indeed the criminals are astray and insane."
          ],
          "en.arberry": [
            "Surely the sinners are in error and insanity!"
          ],
          "en.daryabadi": [
            "Verily the culprits shall be in great error and madness."
          ],
          "en.hilali": [
            "Verily, the Mujrimun (polytheists, disbelievers, sinners, criminals, etc.) are in error (in this world) and will burn (in the Hell-fire in the Hereafter)."
          ],
          "en.itani": [
            "The wicked are in confusion and madness."
          ],
          "en.maududi": [
            "The evil-doers are victims of error and madness."
          ],
          "en.mubarakpuri": [
            "Verily, the criminals are in error and will burn."
          ],
          "en.pickthall": [
            "Lo! the guilty are in error and madness."
          ],
          "en.qarai": [
            "Indeed the guilty are steeped in error and madness."
          ],
          "en.qaribullah": [
            "Indeed the wrongdoers are in error and a raging fire."
          ],
          "en.sahih": [
            "Indeed, the criminals are in error and madness."
          ],
          "en.sarwar": [
            "The sinful ones will face the destructive torment of hell"
          ],
          "en.shakir": [
            "Surely the guilty are in error and distress."
          ],
          "en.transliteration": [
            "Inna almujrimeena fee <u>d</u>al<u>a</u>lin wasuAAur<b>in</b>"
          ],
          "en.wahiduddin": [
            "The evil-doers are indeed sunk in error and folly --"
          ],
          "en.yusufali": [
            "Truly those in sin are the ones straying in mind, and mad."
          ],
          "fa.ansarian": [
            "بی تردید گنهکاران در گمراهی و انحراف و در آتش افروخته اند."
          ],
          "fa.ayati": [
            "مجرمان در گمراهى و جنونند."
          ],
          "fa.bahrampour": [
            "قطعا بزهكاران در گمراهى و شعله‌هاى آتشند"
          ],
          "fa.fooladvand": [
            "قطعاً بزهكاران در گمراهى و جنونند."
          ],
          "fa.ghomshei": [
            "البته بدکاران عالم (در دنیا) به گمراهی و (در آخرت) در آتش سوزان دوزخند."
          ],
          "fa.khorramdel": [
            "قطعاً گناهکاران، گمراه و دیوانه و گرفتار آتشند. [[«فِی ضَلالٍ وَ سُعُرٍ»: گمراه و دیوانه‌اند (نگا: قمر / 24). در گمراهی و آتشند. «سُعُرٍ»: دیوانگی و جنون. آتش سراپا شعله.]]"
          ],
          "fa.khorramshahi": [
            "آری که گناهکاران در گمراهی و سردرگمی‌اند"
          ],
          "fa.makarem": [
            "مجرمان در گمراهی و شعله‌های آتشند،"
          ],
          "fa.moezzi": [
            "همانا گنهکارانند در گمراهی و آتشهای سوزان‌"
          ],
          "fa.mojtabavi": [
            "بزهكاران در گمراهى و آتش سوزانند."
          ],
          "fa.sadeqi": [
            "مجرمان بی‌گمان در گمراهی و آتشِ زبانه‌دارند."
          ]
        }
      },
      {
        "index": 4894,
        "local_index": 48,
        "part_type": "Verse",
        "path": "/books/quran:54:48",
        "text": [
          "يَوْمَ‌ يُسْحَبُونَ‌ فِي‌ النَّارِ عَلَى‌ وُجُوهِهِمْ‌ ذُوقُوا مَسَ‌ سَقَرَ"
        ],
        "translations": {
          "en.ahmedali": [
            "On that Day they will be dragged into the fire faces foremost, (and told:) \"Taste the feel of Hell.\""
          ],
          "en.ahmedraza": [
            "On the day when they are dragged upon their faces in the fire – “Taste the heat of hell.”"
          ],
          "en.arberry": [
            "The day when they are dragged on their faces into the Fire: 'Taste now the touch of Sakar!'"
          ],
          "en.daryabadi": [
            "On the Day whereon they shall be dragged into the Fire upon their faces, it shall be said Unto them: taste the touch of the Scorching."
          ],
          "en.hilali": [
            "The Day they will be dragged in the Fire on their faces (it will be said to them): \"Taste you the touch of Hell!\""
          ],
          "en.itani": [
            "The Day when they are dragged upon their faces into the Fire: “Taste the touch of Saqar.”"
          ],
          "en.maududi": [
            "There shall come a Day when they will be dragged on their faces into the Fire and will be told: “Now taste the flame of Hell.”"
          ],
          "en.mubarakpuri": [
            "The Day they will be dragged on their faces into the Fire (it will be said to them): \"Taste you the touch of Hell!\""
          ],
          "en.pickthall": [
            "On the day when they are dragged into the Fire upon their faces (it is said unto them): Feel the touch of hell."
          ],
          "en.qarai": [
            "The day when they are dragged on their faces into the Fire, [it will be said to them,] ‘Taste the touch of hell!’"
          ],
          "en.qaribullah": [
            "On the Day when they are dragged on their faces into the Fire, (it will be said to them): 'Taste the touch of the Scorching'"
          ],
          "en.sahih": [
            "The Day they are dragged into the Fire on their faces [it will be said], \"Taste the touch of Saqar.\""
          ],
          "en.sarwar": [
            "when they will be dragged on their faces into the fire and will be told, \"Feel the touch of hell\"."
          ],
          "en.shakir": [
            "On the day when they shall be dragged upon their faces into the fire; taste the touch of hell."
          ],
          "en.transliteration": [
            "Yawma yus<u>h</u>aboona fee a<b>l</b>nn<u>a</u>ri AAal<u>a</u> wujoohihim <u>th</u>ooqoo massa saqar<b>a</b>"
          ],
          "en.wahiduddin": [
            "on the Day when they are dragged into the fire on their faces, it will be said to them, \"Now feel the touch of Hell!\""
          ],
          "en.yusufali": [
            "The Day they will be dragged through the Fire on their faces, (they will hear:) \"Taste ye the touch of Hell!\""
          ],
          "fa.ansarian": [
            "روزی که با صورت در آتش کشیده می شوند [و به آنان می گویند:] سوزندگی و عذاب دردناک دوزخ را بچشید."
          ],
          "fa.ayati": [
            "روزى كه آنها را، به صورت، در جهنم كشند كه: بچشيد عذاب سَقر را."
          ],
          "fa.bahrampour": [
            "روزى كه در آتش بر صورت‌هايشان كشانده شوند، [و گفته شود:] درد لمس كردن لهيب آتش را بچشيد"
          ],
          "fa.fooladvand": [
            "روزى كه در آتش به رو كشيده مى‌شوند [و به آنان گفته مى‌شود:] «لهيب آتش را بچشيد [و احساس كنيد].»"
          ],
          "fa.ghomshei": [
            "روزی که آنها را به رو در آتش دوزخ کشند (و گویند) اینک الم جهنم را بچشید!"
          ],
          "fa.khorramdel": [
            "روزی داخل آتش، بر رخساره، روی زمین کشیده می‌شوند (و بدیشان گفته می‌شود:) بچشید لمس و پسوده‌ی دوزخ را. [[«یُسْحَبُونَ»: روی زمین کشانده می‌شوند (نگا: غافر / 71). «مَسَّ»: لمس. پسوده. مراد رنج و الم و گرمی و حرارت آتش دوزخ است. «سَقَرَ»: اسم خاص دوزخ است و غیر منصرف.]]"
          ],
          "fa.khorramshahi": [
            "روزی که بر چهره‌هایشان در آتش کشیده شوند [و گویندشان‌] آسیب دوزخ را بچشید"
          ],
          "fa.makarem": [
            "در آن روز که در آتش دوزخ به صورتشان کشیده می‌شوند (و به آنها گفته می‌شود:) بچشید آتش دوزخ را!"
          ],
          "fa.moezzi": [
            "روزی که کشیده شوند در آتش بر رویهای خویش بچشید سودن دوزخ‌"
          ],
          "fa.mojtabavi": [
            "روزى كه آنان را بر رويهاشان در آتش مى‌كشند، [و گويندشان:] بچشيد عذاب سودن دوزخ را"
          ],
          "fa.sadeqi": [
            "روزی که در آتش به رو کشیده می‌شوند (و به آنان گفته شود:) «لهیب آتش‌سوزان (کبود کننده‌ی چهره و هلاکت‌بار) را بچشید و احساسش کنید.»"
          ]
        }
      },
      {
        "index": 4895,
        "local_index": 49,
        "part_type": "Verse",
        "path": "/books/quran:54:49",
        "text": [
          "إِنَّا کُلَ‌ شَيْ‌ءٍ خَلَقْنَاهُ‌ بِقَدَرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "We have indeed created all things by measure;"
          ],
          "en.ahmedraza": [
            "We have indeed created all things by a proper measure."
          ],
          "en.arberry": [
            "Surely We have created everything in measure."
          ],
          "en.daryabadi": [
            "Veriiy everything! We have created it by a measure."
          ],
          "en.hilali": [
            "Verily, We have created all things with Qadar (Divine Preordainments of all things before their creation, as written in the Book of Decrees Al-Lauh Al-Mahfuz)."
          ],
          "en.itani": [
            "Everything We created is precisely measured."
          ],
          "en.maududi": [
            "We have created everything in a determined measure."
          ],
          "en.mubarakpuri": [
            "Verily, We have created all things with Qadar."
          ],
          "en.pickthall": [
            "Lo! We have created every thing by measure."
          ],
          "en.qarai": [
            "Indeed We have created everything in a measure,"
          ],
          "en.qaribullah": [
            "Indeed, We have created all things according to a measure."
          ],
          "en.sahih": [
            "Indeed, all things We created with predestination."
          ],
          "en.sarwar": [
            "We have created everything to fulfill a certain purpose."
          ],
          "en.shakir": [
            "Surely We have created everything according to a measure."
          ],
          "en.transliteration": [
            "Inn<u>a</u> kulla shayin khalaqn<u>a</u>hu biqadar<b>in</b>"
          ],
          "en.wahiduddin": [
            "We have created everything in due measure;"
          ],
          "en.yusufali": [
            "Verily, all things have We created in proportion and measure."
          ],
          "fa.ansarian": [
            "ما هر چیزی را به اندازه آفریدیم."
          ],
          "fa.ayati": [
            "ما هر چيز را به اندازه آفريده‌ايم."
          ],
          "fa.bahrampour": [
            "همانا ما هر چيزى را به اندازه آفريده‌ايم"
          ],
          "fa.fooladvand": [
            "ماييم كه هر چيزى را به اندازه آفريده‌ايم."
          ],
          "fa.ghomshei": [
            "ما هر چه آفریدیم به اندازه آفریدیم."
          ],
          "fa.khorramdel": [
            "ما هر چیزی را به اندازه‌ی لازم و از روی حساب و نظام آفریده‌ایم. [[«بِقَدَرٍ»: به اندازه لازم. از روی حساب و اندازه‌گیری دقیق و برابر نظم و نظام محکم و استوار (نگا: رعد / 8، حجر / 19 و 21، فرقان / 2).]]"
          ],
          "fa.khorramshahi": [
            "ما هر چیز را به اندازه آفریده‌ایم‌"
          ],
          "fa.makarem": [
            "البته ما هر چیز را به اندازه آفریدیم!"
          ],
          "fa.moezzi": [
            "همانا ما همه چیز را آفریدیم به اندازه‌ای‌"
          ],
          "fa.mojtabavi": [
            "همانا ما هر چيزى را به اندازه آفريديم."
          ],
          "fa.sadeqi": [
            "به‌راستی ما هر چیزی را به اندازه‌ای (حکیمانه و آگاهانه) آفریده‌ایم."
          ]
        }
      },
      {
        "index": 4896,
        "local_index": 50,
        "part_type": "Verse",
        "path": "/books/quran:54:50",
        "text": [
          "وَ مَا أَمْرُنَا إِلاَّ وَاحِدَةٌ کَلَمْحٍ‌ بِالْبَصَرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "And Our command is but one (word) swift as the winking of an eye."
          ],
          "en.ahmedraza": [
            "And Our command is only a fleeting one – like the batting of an eyelid."
          ],
          "en.arberry": [
            "Our commandment is but one word, as the twinkling of an eye."
          ],
          "en.daryabadi": [
            "And Our commandment shall be but one, as the twinkling of an eye."
          ],
          "en.hilali": [
            "And Our Commandment is but one, as the twinkling of an eye."
          ],
          "en.itani": [
            "And Our command is but once, like the twinkling of an eye."
          ],
          "en.maududi": [
            "Our command consists of only one Word which is carried out in the twinkling of an eye."
          ],
          "en.mubarakpuri": [
            "And Our commandment is but one as the twinkling of an eye."
          ],
          "en.pickthall": [
            "And Our commandment is but one (commandment), as the twinkling of an eye."
          ],
          "en.qarai": [
            "and Our command is but a single [word], like the twinkling of an eye."
          ],
          "en.qaribullah": [
            "And Our Order is but one word like the flashing of an eye."
          ],
          "en.sahih": [
            "And Our command is but one, like a glance of the eye."
          ],
          "en.sarwar": [
            "It takes only a single command from Us (to bring the Day of Judgment) and that can be achieved within the twinkling of an eye."
          ],
          "en.shakir": [
            "And Our command is but one, as the twinkling of an eye."
          ],
          "en.transliteration": [
            "Wam<u>a</u> amrun<u>a</u> ill<u>a</u> w<u>ah</u>idatun kalam<u>h</u>in bi<b>a</b>lba<u>s</u>ar<b>i</b>"
          ],
          "en.wahiduddin": [
            "We command but once: Our will is done in the twinkling of an eye;"
          ],
          "en.yusufali": [
            "And Our Command is but a single (Act),- like the twinkling of an eye."
          ],
          "fa.ansarian": [
            "و فرمان ما جز فرمان واحدی نیست که مانند یک چشم بر هم زدن است."
          ],
          "fa.ayati": [
            "فرمان ما تنها يك فرمان است، آن هم چشم بر هم زدنى است."
          ],
          "fa.bahrampour": [
            "و فرمان ما جز يك فرمان نيست، چون چشم بر هم زدنى"
          ],
          "fa.fooladvand": [
            "و فرمان ما جز يك بار نيست [آن هم‌] چون چشم به هم زدنى."
          ],
          "fa.ghomshei": [
            "و فرمان ما (در همه عالم) یکی است (و هیچ تبدیل‌پذیر نیست چه در امر ایجاد و چه در کار معاد، و در سرعت) به مانند چشم به هم زدنی انجام یابد."
          ],
          "fa.khorramdel": [
            "(نه تنها اعمال ما از روی حکمت است، بلکه توأم با نهایت قدرت است. چرا که) فرمانی بیش نیست، (و چنان با سرعت انجام می‌گیرد که انگار همسان با یک چشم برهم زدن، و) همانند یک نگاه سریع و با عجله است. [[«أَمْرُنَا»: فرمان ما برای پیدایش چیزی و انجام کاری. «إِلاّ وَاحِدَةٌ»: مگر یک بار. جز یک کلمه (نگا: یس / 82). «لَمْحٍ»: نگاه سریع. چشم به هم زدن. طَرفة‌العین.]]"
          ],
          "fa.khorramshahi": [
            "و فرمان ما جز [فرمانی‌] یگانه نیست، مانند چشم برهم‌زدنی‌"
          ],
          "fa.makarem": [
            "و فرمان ما یک امر بیش نیست، همچون یک چشم بر هم زدن!"
          ],
          "fa.moezzi": [
            "و نیست کار ما جز یکی مانند دیدنی به چشم (بهم زدن چشم)"
          ],
          "fa.mojtabavi": [
            "و فرمان ما نيست جز يكى- يك سخن-، همچون يك چشم بر هم‌زدن."
          ],
          "fa.sadeqi": [
            "و فرمان ما جز یک (اراده) نیست‌، (آن هم) چون چشم بر هم زدنی (یا کمتر)."
          ]
        }
      },
      {
        "index": 4897,
        "local_index": 51,
        "part_type": "Verse",
        "path": "/books/quran:54:51",
        "text": [
          "وَ لَقَدْ أَهْلَکْنَا أَشْيَاعَکُمْ‌ فَهَلْ‌ مِنْ‌ مُدَّکِرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "We have destroyed the likes of you in the past: So is there any one who will be warned?"
          ],
          "en.ahmedraza": [
            "And We have indeed destroyed your kind, so is there one who would ponder?"
          ],
          "en.arberry": [
            "We have destroyed the likes of you; is there any that will remember?"
          ],
          "en.daryabadi": [
            "And assuredly We have destroyed your likes; so is there any one who shall be admonished?"
          ],
          "en.hilali": [
            "And indeed, We have destroyed your likes, then is there any that will remember (or receive admonition)?"
          ],
          "en.itani": [
            "We have destroyed your likes. Is there anyone who would ponder?"
          ],
          "en.maududi": [
            "We did indeed destroy many like you. Is there, then, any who will heed?"
          ],
          "en.mubarakpuri": [
            "And indeed, We have destroyed your likes; then is there any that will remember"
          ],
          "en.pickthall": [
            "And verily We have destroyed your fellows; but is there any that remembereth?"
          ],
          "en.qarai": [
            "Certainly We have destroyed your likes. So is there anyone who will be admonished?"
          ],
          "en.qaribullah": [
            "And We destroyed those like you, is there any that will remember!"
          ],
          "en.sahih": [
            "And We have already destroyed your kinds, so is there any who will remember?"
          ],
          "en.sarwar": [
            "We destroyed many people like you (disbelievers) but is there anyone who would take heed (of Our warning)?"
          ],
          "en.shakir": [
            "And certainly We have already destroyed the likes of you, but is there anyone who will mind?"
          ],
          "en.transliteration": [
            "Walaqad ahlakn<u>a</u> ashy<u>a</u>AAakum fahal min muddakir<b>in</b>"
          ],
          "en.wahiduddin": [
            "We have indeed destroyed many a people like you. Is there anyone who would receive admonition?"
          ],
          "en.yusufali": [
            "And (oft) in the past, have We destroyed gangs like unto you: then is there any that will receive admonition?"
          ],
          "fa.ansarian": [
            "بی تردید ما هم مسلکان شما را [که در گذشته به سر می بردند، به خاطر طغیانشان] هلاک کردیم؛ پس آیا پند گیرنده ای هست؟"
          ],
          "fa.ayati": [
            "كسانى را كه همانند شما بودند، هلاك كرديم. آيا پندگيرنده‌اى هست؟"
          ],
          "fa.bahrampour": [
            "و همفكران شما را سخت به هلاكت رسانديم، پس آيا پند گيرنده‌اى هست"
          ],
          "fa.fooladvand": [
            "و هم مسلكان شما را سخت به هلاكت رسانديم؛ پس آيا پندگيرنده‌اى هست؟"
          ],
          "fa.ghomshei": [
            "و ما بسیاری از پیشینیان امثال شما را هلاک کردیم آیا کسی هست که از آن پند و عبرت گیرد؟"
          ],
          "fa.khorramdel": [
            "ما اشخاص همچون شما را (در روزگاران پیشین) نابود و هلاک ساخته‌ایم، آیا پند پذیرنده و عبرت گیرنده‌ای هست؟! [[«أَشْیَاعَکُمْ»: پیروان شما. مراد امثال و همگون در پیروی از کفر و شرک و معاصی است (نگا: سبأ / 54).]]"
          ],
          "fa.khorramshahi": [
            "و به راستی همانندانتان را نابود کردیم، پس آیا پندپذیری هست؟"
          ],
          "fa.makarem": [
            "ما کسانی را که در گذشته شبیه شما بودند هلاک کردیم؛ آیا کسی هست که پند گیرد؟!"
          ],
          "fa.moezzi": [
            "و هر آینه نابود ساختیم پیروان شما را پس آیا هست یادآورنده‌ای‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه همانندان شما را- كه گمراه بودند- هلاك ساختيم، پس آيا يادآرنده و پندگيرنده‌اى هست؟"
          ],
          "fa.sadeqi": [
            "و همواره (هم‌مسلکان و) همراهان‌تان را سخت به هلاکت رساندیم. پس آیا هشدارگیرنده‌ای هست‌؟"
          ]
        }
      },
      {
        "index": 4898,
        "local_index": 52,
        "part_type": "Verse",
        "path": "/books/quran:54:52",
        "text": [
          "وَ کُلُ‌ شَيْ‌ءٍ فَعَلُوهُ‌ فِي‌ الزُّبُرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "All things they do are (recorded) in the books;"
          ],
          "en.ahmedraza": [
            "And all what they did is in the Books."
          ],
          "en.arberry": [
            "Every thing that they have done is in the Scrolls,"
          ],
          "en.daryabadi": [
            "And everything they have wrought is in the Writs."
          ],
          "en.hilali": [
            "And each and everything they have done is noted in (their) Records (of deeds)."
          ],
          "en.itani": [
            "Everything they have done is in the Books."
          ],
          "en.maududi": [
            "All their deeds are recorded in the Scrolls;"
          ],
          "en.mubarakpuri": [
            "And everything they have done is noted in Az-Zubur."
          ],
          "en.pickthall": [
            "And every thing they did is in the scriptures,"
          ],
          "en.qarai": [
            "Everything they have done is in the books,"
          ],
          "en.qaribullah": [
            "All their deeds are in the Scrolls,"
          ],
          "en.sahih": [
            "And everything they did is in written records."
          ],
          "en.sarwar": [
            "Whatever they have done has been recorded in the Books (records of the deeds)."
          ],
          "en.shakir": [
            "And everything they have done is in the writings."
          ],
          "en.transliteration": [
            "Wakullu shayin faAAaloohu fee a<b>l</b>zzubur<b>i</b>"
          ],
          "en.wahiduddin": [
            "All their deeds are recorded in their books:"
          ],
          "en.yusufali": [
            "All that they do is noted in (their) Books (of Deeds):"
          ],
          "fa.ansarian": [
            "و هر عملی را که انجام دادند در نامه های اعمالشان ثبت است."
          ],
          "fa.ayati": [
            "هر كارى كه كرده‌اند در دفترهاست."
          ],
          "fa.bahrampour": [
            "و هر چه كرده‌اند در نامه‌ها [ى اعمال‌] ثبت است"
          ],
          "fa.fooladvand": [
            "و هر چه كرده‌اند در كتابها[ى اعمالشان درج‌] است."
          ],
          "fa.ghomshei": [
            "و هر عملی که کردند در کتب‌نامه عملشان ثبت است."
          ],
          "fa.khorramdel": [
            "هر کاری را که کرده‌اند، در کتابها و نامه‌های اعمال (با دست فرشتگان مأمور، ثبت و ضبط و) موجود است. [[«الزُّبُرِ»: کتابها (نگا: قمر / 43). مراد نامه‌های اعمال و پرونده‌های کردار و رفتار و گفتار انسان است که توسط فرشتگان مأمور و مراقب، نگارش و نگاهداری می‌گردد (نگا: انفطار / 10 و 11 و 12).]]"
          ],
          "fa.khorramshahi": [
            "و هر چیزی که انجام داده‌اند در نامه‌های اعمال هست‌"
          ],
          "fa.makarem": [
            "و هر کاری را انجام دادند در نامه‌های اعمالشان ثبت است،"
          ],
          "fa.moezzi": [
            "و هر چیزی که کردند در کتابها است‌"
          ],
          "fa.mojtabavi": [
            "و هر كارى كه كرده‌اند در نبشته‌ها- نامه‌هاى اعمال- هست."
          ],
          "fa.sadeqi": [
            "و هر چه کردند در کتاب‌ها(ی اعمالشان و کتاب علم خدا) درج است."
          ]
        }
      },
      {
        "index": 4899,
        "local_index": 53,
        "part_type": "Verse",
        "path": "/books/quran:54:53",
        "text": [
          "وَ کُلُ‌ صَغِيرٍ وَ کَبِيرٍ مُسْتَطَرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "All things small or great have been written down."
          ],
          "en.ahmedraza": [
            "And every small and great thing is recorded."
          ],
          "en.arberry": [
            "and everything, great and small, is inscribed."
          ],
          "en.daryabadi": [
            "And everything, small and great, hath been written down."
          ],
          "en.hilali": [
            "And everything, small and big is written (in Al-Lauh Al-Mahfuz already beforehand i.e. before it befalls, or is done by its doer) (See the Quran V. 57:22)."
          ],
          "en.itani": [
            "Everything, small or large, is written down."
          ],
          "en.maududi": [
            "everything large or small, is duly inscribed."
          ],
          "en.mubarakpuri": [
            "And everything, small and large, is written down."
          ],
          "en.pickthall": [
            "And every small and great thing is recorded."
          ],
          "en.qarai": [
            "and everything big and small is committed to writing."
          ],
          "en.qaribullah": [
            "everything, be it great or small, is recorded."
          ],
          "en.sahih": [
            "And every small and great [thing] is inscribed."
          ],
          "en.sarwar": [
            "Every small or great deed is written down."
          ],
          "en.shakir": [
            "And everything small and great is written down."
          ],
          "en.transliteration": [
            "Wakullu <u>s</u>agheerin wakabeerin musta<u>t</u>ar<b>un</b>"
          ],
          "en.wahiduddin": [
            "every action, small or great, is noted down."
          ],
          "en.yusufali": [
            "Every matter, small and great, is on record."
          ],
          "fa.ansarian": [
            "و هر کوچک و بزرگی [از اعمالشان در آن] نوشته شده است."
          ],
          "fa.ayati": [
            "هر كار بزرگ و كوچكى مكتوب است."
          ],
          "fa.bahrampour": [
            "و هر خرد و كلانى [از اعمال‌] به قلم رفته است"
          ],
          "fa.fooladvand": [
            "و هر خرد و بزرگى [در آن‌] نوشته شده."
          ],
          "fa.ghomshei": [
            "و هر امر کوچک و بزرگ (در آنجا) نگاشته است."
          ],
          "fa.khorramdel": [
            "هر کار کوچک و بزرگی (که در دنیا کرده‌اند، در دفاتر مخصوص) نوشته شده است. [[«مُسْتَطَرٌ»: مکتوب. نوشته شده.]]"
          ],
          "fa.khorramshahi": [
            "و هر خرد و بزرگی نوشته شده است‌"
          ],
          "fa.makarem": [
            "و هر کار کوچک و بزرگی نوشته شده است."
          ],
          "fa.moezzi": [
            "و هر کوچکی و بزرگی است نوشته‌"
          ],
          "fa.mojtabavi": [
            "و هر [كار] خرد و كلانى نوشته شده است."
          ],
          "fa.sadeqi": [
            "و هر خُرد و بزرگی (در آن) به خوبی نوشته شده است."
          ]
        }
      },
      {
        "index": 4900,
        "local_index": 54,
        "part_type": "Verse",
        "path": "/books/quran:54:54",
        "text": [
          "إِنَ‌ الْمُتَّقِينَ‌ فِي‌ جَنَّاتٍ‌ وَ نَهَرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "Surely those who fear God and follow the straight path will be amidst gardens and light,"
          ],
          "en.ahmedraza": [
            "Indeed the pious are amidst Gardens and springs."
          ],
          "en.arberry": [
            "Surely the godfearing shall dwell amid gardens and a river"
          ],
          "en.daryabadi": [
            "Verily the God-fearing will be in Gardens and among rivers."
          ],
          "en.hilali": [
            "Verily, The Muttaqun (pious), will be in the midst of Gardens and Rivers (Paradise)."
          ],
          "en.itani": [
            "The righteous will be amidst gardens and rivers."
          ],
          "en.maududi": [
            "Surely those who shun disobedience will dwell amidst Gardens and running streams"
          ],
          "en.mubarakpuri": [
            "Verily, those who have Taqwa, will be in the midst of Gardens and Rivers."
          ],
          "en.pickthall": [
            "Lo! the righteous will dwell among gardens and rivers,"
          ],
          "en.qarai": [
            "Indeed the Godwary will be amid gardens and streams,"
          ],
          "en.qaribullah": [
            "Indeed, the cautious shall live amid gardens and a river,"
          ],
          "en.sahih": [
            "Indeed, the righteous will be among gardens and rivers,"
          ],
          "en.sarwar": [
            "The pious ones will live in Paradise wherein streams flow,"
          ],
          "en.shakir": [
            "Surely those who guard (against evil) shall be in gardens and rivers,"
          ],
          "en.transliteration": [
            "Inna almuttaqeena fee jann<u>a</u>tin wanahar<b>in</b>"
          ],
          "en.wahiduddin": [
            "The God-conscious will find themselves in gardens and rivers,"
          ],
          "en.yusufali": [
            "As to the Righteous, they will be in the midst of Gardens and Rivers,"
          ],
          "fa.ansarian": [
            "یقیناً پرهیزکاران در بهشت ها و [کنار] نهرها هستند؛"
          ],
          "fa.ayati": [
            "پرهيزگاران در باغها و كنار جويبارانند."
          ],
          "fa.bahrampour": [
            "محققا پارسايان در باغ‌ها و [كنار] نهرهايند"
          ],
          "fa.fooladvand": [
            "در حقيقت، مردم پرهيزگار در ميان باغها و نهرها،"
          ],
          "fa.ghomshei": [
            "محققا اهل تقوا در باغها و کنار نهرها (ی بهشت ابد) منزل گزینند."
          ],
          "fa.khorramdel": [
            "قطعاً پرهیزگاران در باغها و کنار جویباران بهشتی جای خواهند داشت. [[«نَهَرٍ»: نهر. رودبار. جویبار. مفرد است و مراد جمع، همچون واژه (طفل) در (حج / 5، نور / 31). فراخی جا و مکان و وفور نعمت.]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان پرهیزگاران در باغها و [جوار] جویبارها هستند"
          ],
          "fa.makarem": [
            "یقیناً پرهیزگاران در باغها و نهرهای بهشتی جای دارند،"
          ],
          "fa.moezzi": [
            "همانا پرهیزکارانند در باغها و چشمه‌هائی‌"
          ],
          "fa.mojtabavi": [
            "همانا پرهيزگاران در بوستانها و [كنار] جويها باشند."
          ],
          "fa.sadeqi": [
            "همواره پرهیزگاران در میان باغ‌ها و نهرها،"
          ]
        }
      },
      {
        "index": 4901,
        "local_index": 55,
        "part_type": "Verse",
        "path": "/books/quran:54:55",
        "text": [
          "فِي‌ مَقْعَدِ صِدْقٍ‌ عِنْدَ مَلِيکٍ‌ مُقْتَدِرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "At the still centre in the proximity of the King all-powerful."
          ],
          "en.ahmedraza": [
            "Seated in an assembly of the Truth, in the presence of Allah, the Omnipotent King."
          ],
          "en.arberry": [
            "in a sure abode, in the presence of a King Omnipotent."
          ],
          "en.daryabadi": [
            "In a good seat, near a Sovereign Omnipotent."
          ],
          "en.hilali": [
            "In a seat of truth (i.e. Paradise), near the Omnipotent King (Allah, the All-Blessed, the Most High, the Owner of Majesty and Honour)."
          ],
          "en.itani": [
            "In an assembly of virtue, in the presence of an Omnipotent King."
          ],
          "en.maududi": [
            "where they will be honourably seated in the presence of a King, Mighty in Power."
          ],
          "en.mubarakpuri": [
            "In a seat of truth, near the Muqtadir King."
          ],
          "en.pickthall": [
            "Firmly established in the favour of a Mighty King."
          ],
          "en.qarai": [
            "in the abode of truthfulness with an omnipotent King."
          ],
          "en.qaribullah": [
            "in a secure abode, in the presence of the Powerful King."
          ],
          "en.sahih": [
            "In a seat of honor near a Sovereign, Perfect in Ability."
          ],
          "en.sarwar": [
            "honorably seated in the presence of the All-dominant King."
          ],
          "en.shakir": [
            "In the seat of honor with a most Powerful King."
          ],
          "en.transliteration": [
            "Fee maqAAadi <u>s</u>idqin AAinda maleekin muqtadir<b>in</b>"
          ],
          "en.wahiduddin": [
            "in the seat of truth with an all-powerful sovereign."
          ],
          "en.yusufali": [
            "In an Assembly of Truth, in the Presence of a Sovereign Omnipotent."
          ],
          "fa.ansarian": [
            "در جایگاهی حق و پسندیده نزد پادشاهی توانا."
          ],
          "fa.ayati": [
            "در جايگاهى پسنديده، نزد فرمانروايى توانا."
          ],
          "fa.bahrampour": [
            "در جايگاه صدق، نزد پادشاهى با اقتدار"
          ],
          "fa.fooladvand": [
            "در قرارگاه صدق، نزد پادشاهى توانايند."
          ],
          "fa.ghomshei": [
            "در منزلگاه صدق و حقیقت نزد خداوند عزّت و سلطنت جاودانی متنعّمند."
          ],
          "fa.khorramdel": [
            "در مجلس راستینی (که یاوه‌سرائی و بزهکاری در آن جائی ندارد ... در) پیشگاه پادشاه بزرگ و توانائی (که آفریدگار و خداوندگار همه‌ی کائنات است). [[«مَقْعَدِ»: مجلس. جایگاه. «صِدْقٍ»: حق. راستین. «مَقْعَدِ صِدْقٍ»: مجلس حق. مجلس راستی و درستی خالی از دروغگوئی و بیهوده‌گوئی. «مَلِیکٍ»: پادشاه بزرگ. صیغه مبالغه است. «مُقْتَدِرٍ»: بسیار باقدرت و قوّت.]]"
          ],
          "fa.khorramshahi": [
            "در مقام و منزلتی راستین، نزد فرمانروای توانا"
          ],
          "fa.makarem": [
            "در جایگاه صدق نزد خداوند مالک مقتدر!"
          ],
          "fa.moezzi": [
            "در نشیمنی راست نزد پادشاهی نیرومند"
          ],
          "fa.mojtabavi": [
            "در نشستگاهى راستين- بهشت جاودان- نزد پادشاهى توانا- خداى متعال-."
          ],
          "fa.sadeqi": [
            "در نشست‌گاهی راستین نزد شاهنشاهی توانمندند."
          ]
        }
      }
    ]
  },
  "index": "quran:54",
  "kind": "verse_list"
}