{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 57"
        },
        "path": "/books/quran:57",
        "titles": {
          "ar": "الحديد",
          "en": "The Iron",
          "ent": "Al-Hadid"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 57,
    "local_index": 57,
    "order": 94,
    "part_type": "Chapter",
    "path": "/books/quran:57",
    "reveal_type": "Medinan",
    "rukus": 4,
    "titles": {
      "ar": "الحديد",
      "en": "The Iron",
      "ent": "Al-Hadid"
    },
    "verse_count": 29,
    "verse_start_index": 5075,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 5076,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:57:1",
        "text": [
          "سَبَّحَ‌ لِلَّهِ‌ مَا فِي‌ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ وَ هُوَ الْعَزِيزُ الْحَکِيمُ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "WHATSOEVER IS IN the heavens and the earth sings the praises of God. He is all-mighty and all-wise."
          ],
          "en.ahmedraza": [
            "All whatever is in the heavens and in the earth proclaims the Purity of Allah; and He only is the Most Honourable, the Wise."
          ],
          "en.arberry": [
            "All that is in the heavens and the earth magnifies God; He is the All-mighty, the All-wise."
          ],
          "en.daryabadi": [
            "Whatsoever is in the heavens and the earth halloweth Allah; and He is the Mighty, the Wise."
          ],
          "en.hilali": [
            "Whatsoever is in the heavens and the earth glorifies Allah, and He is the All-Mighty, All-Wise."
          ],
          "en.itani": [
            "Glorifying God is everything in the heavens and the earth. He is the Almighty, the Wise."
          ],
          "en.maududi": [
            "All that is in the heavens and the earth extols the glory of Allah. He is the Most Mighty, the Most Wise."
          ],
          "en.mubarakpuri": [
            "Whatever is in the heavens and the earth glorifies Allah -- and He is the Almighty, All-Wise."
          ],
          "en.pickthall": [
            "All that is in the heavens and the earth glorifieth Allah; and He is the Mighty, the Wise."
          ],
          "en.qarai": [
            "Whatever there is in the heavens and [whatever there is on] the earth glorifies Allah and He is the All-mighty, the All-wise."
          ],
          "en.qaribullah": [
            "All that is in the heavens and earth exalt Allah. He is the Almighty, the Wise."
          ],
          "en.sahih": [
            "Whatever is in the heavens and earth exalts Allah, and He is the Exalted in Might, the Wise."
          ],
          "en.sarwar": [
            "All that is in the heavens and the earth glorify God. He is Majestic and All-wise."
          ],
          "en.shakir": [
            "Whatever is in the heavens and the earth declares the glory of Allah, and He is the Mighty, the Wise."
          ],
          "en.transliteration": [
            "Sabba<u>h</u>a lill<u>a</u>hi m<u>a</u> fee a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i wahuwa alAAazeezu al<u>h</u>akeem<b>u</b>"
          ],
          "en.wahiduddin": [
            "Everything in the heavens and earth glorifies God -- He is the Mighty, the Wise One."
          ],
          "en.yusufali": [
            "Whatever is in the heavens and on earth,- let it declare the Praises and Glory of Allah: for He is the Exalted in Might, the Wise."
          ],
          "fa.ansarian": [
            "آنچه در آسمان ها و زمین است، خدا را [به پاک بودن از هر عیب و نقصی] می ستایند، و او توانای شکست ناپذیر و حکیم است."
          ],
          "fa.ayati": [
            "خداوند را تسبيح مى‌گويند، هر چه در آسمانها و زمين است، و او پيروزمند و حكيم است."
          ],
          "fa.bahrampour": [
            "آنچه در آسمان‌ها و زمين است خدا را به پاكى مى‌ستايند و او مقتدر حكيم است"
          ],
          "fa.fooladvand": [
            "آنچه در آسمانها و زمين است، خدا را به پاكى مى‌ستايند، و اوست ارجمند حكيم."
          ],
          "fa.ghomshei": [
            "هر چه در آسمانها و زمین است همه به تسبیح و ستایش یکتا خدایی که مقتدر و حکیم است مشغولند."
          ],
          "fa.khorramdel": [
            "هرآنچه در آسمانها و زمین است، خدای را تسبیح و تقدیس می‌کنند (و با کرنش و پرستش رضای او را می‌جویند) و خدا چیره‌ی کاردان است. [[«سَبَّحَ ِللهِ مَا ...»: (نگا: اسراء / 44، رعد / 13، نور / 41).]]"
          ],
          "fa.khorramshahi": [
            "آنچه در آسمانها و زمین است، خداوند را تسبیح می‌گوید، و اوست پیروزمند فرزانه‌"
          ],
          "fa.makarem": [
            "آنچه در آسمانها و زمین است برای خدا تسبیح می‌گویند؛ و او عزیز و حکیم است."
          ],
          "fa.moezzi": [
            "تسبیح گوید برای خدا آنچه در آسمانها و زمین است و او است عزّتمند حکیم‌"
          ],
          "fa.mojtabavi": [
            "هر چه در آسمانها و زمين است خداى را به پاكى مى‌ستايد، و اوست تواناى بى‌همتا و داناى با حكمت."
          ],
          "fa.sadeqi": [
            "آنچه در آسمان‌ها و زمین است، خدا را به پاکی ستوده‌اند و اوست عزیز حکیم."
          ]
        }
      },
      {
        "index": 5077,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:57:2",
        "text": [
          "لَهُ‌ مُلْکُ‌ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ يُحْيِي‌ وَ يُمِيتُ‌ وَ هُوَ عَلَى‌ کُلِ‌ شَيْ‌ءٍ قَدِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "His is the kingdom of the heavens and the earth, He is the giver of life and death, and He has power over everything."
          ],
          "en.ahmedraza": [
            "For Him only is the kingship of the heavens and the earth; He gives life and causes death; and He is Able to do all things."
          ],
          "en.arberry": [
            "To Him belongs the Kingdom of the heavens and the earth; He gives life, and He makes to die, and He is powerful over everything."
          ],
          "en.daryabadi": [
            "His is the dominion of the heavens and the earth; He giveth life and He causeth to die; and He is over everything Potent."
          ],
          "en.hilali": [
            "His is the kingdom of the heavens and the earth, It is He Who gives life and causes death; and He is Able to do all things."
          ],
          "en.itani": [
            "To Him belongs the kingdom of the heavens and the earth. He gives life and causes death, and He has power over all things."
          ],
          "en.maududi": [
            "His is the dominion of the heavens and the earth. He gives life and causes death, and He has power over everything."
          ],
          "en.mubarakpuri": [
            "His is the kingdom of the heavens and the earth. It is He Who gives life and causes death; and He is Able to do all things."
          ],
          "en.pickthall": [
            "His is the Sovereignty of the heavens and the earth; He quickeneth and He giveth death; and He is Able to do all things."
          ],
          "en.qarai": [
            "To Him belongs the kingdom of the heavens and the earth: He gives life and brings death, and He has power over all things."
          ],
          "en.qaribullah": [
            "To Him belongs the Kingdom in the heavens and earth. It is He who revives and causes to die, and He has power over all things."
          ],
          "en.sahih": [
            "His is the dominion of the heavens and earth. He gives life and causes death, and He is over all things competent."
          ],
          "en.sarwar": [
            "To Him belongs the Kingdom of the heavens and the earth. He gives life and causes things to die. He has power over all things."
          ],
          "en.shakir": [
            "His is the kingdom of the heavens and the earth; He gives life and causes death; and He has power over all things."
          ],
          "en.transliteration": [
            "Lahu mulku a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i yu<u>h</u>yee wayumeetu wahuwa AAal<u>a</u> kulli shayin qadeer<b>un</b>"
          ],
          "en.wahiduddin": [
            "He has sovereign control over the heavens and the earth. He gives life and brings death. He has power over all things."
          ],
          "en.yusufali": [
            "To Him belongs the dominion of the heavens and the earth: It is He Who gives Life and Death; and He has Power over all things."
          ],
          "fa.ansarian": [
            "مالکیّت و فرمانروایی آسمان ها و زمین فقط در سیطره اوست، زنده می کند و می میراند، و او بر هر کاری تواناست."
          ],
          "fa.ayati": [
            "فرمانروايى آسمانها و زمين از آن اوست. زنده مى‌كند و مى‌ميراند و بر هر چيز تواناست."
          ],
          "fa.bahrampour": [
            "فرمانروايى آسمان‌ها و زمين از آن اوست، زنده مى‌كند و مى‌ميراند و او بر هر چيزى تواناست"
          ],
          "fa.fooladvand": [
            "فرمانروايى آسمانها و زمين از آنِ اوست: زنده مى‌كند و مى‌ميراند، و او بر هر چيزى تواناست."
          ],
          "fa.ghomshei": [
            "آن خدایی که فرمانروایی آسمانها و زمین از آن اوست، او زنده می‌گرداند و باز می‌میراند و اوست که بر همه چیز تواناست."
          ],
          "fa.khorramdel": [
            "مالکیّت و حاکمیّت آسمانها و زمین از آن خدا است، و او زنده می‌گرداند و می‌میراند، و او بر هر چیزی توانا است. [[«لَهُ مُلْکُ السَّمَاوَاتِ ...»: (نگا: توبه / 116).]]"
          ],
          "fa.khorramshahi": [
            "او راست فرمانروایی آسمانها و زمین، که زنده می‌دارد و می‌میراند، و او بر هر کاری تواناست‌"
          ],
          "fa.makarem": [
            "مالکیّت (و حاکمیّت) آسمانها و زمین از آن اوست؛ زنده می‌کند و می‌میراند؛ و او بر هر چیز توانا است!"
          ],
          "fa.moezzi": [
            "وی را است پادشاهی آسمانها و زمین زنده کند و بمیراند و او است بر همه چیز توانا"
          ],
          "fa.mojtabavi": [
            "او راست پادشاهى آسمانها و زمين، زنده كند و بميراند، و او بر هر چيزى تواناست."
          ],
          "fa.sadeqi": [
            "فرماندهی آسمان و زمین تنها از اوست، و او بر هر چیزی بسی تواناست."
          ]
        }
      },
      {
        "index": 5078,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:57:3",
        "text": [
          "هُوَ الْأَوَّلُ‌ وَ الْآخِرُ وَ الظَّاهِرُ وَ الْبَاطِنُ‌ وَ هُوَ بِکُلِ‌ شَيْ‌ءٍ عَلِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "He is the first and He the last, the transcendent and the immanent; and He has knowledge of everything."
          ],
          "en.ahmedraza": [
            "He only is the First and He only the Last, and He only is the Evident and He only the Concealed; and it is He Who knows all things."
          ],
          "en.arberry": [
            "He is the First and the Last, the Outward and the Inward; He has knowledge of everything."
          ],
          "en.daryabadi": [
            "He is the First and the Last, and the OutWard and the inward, and He is of everything the Knower."
          ],
          "en.hilali": [
            "He is the First (nothing is before Him) and the Last (nothing is after Him), the Most High (nothing is above Him) and the Most Near (nothing is nearer than Him). And He is the All-Knower of every thing."
          ],
          "en.itani": [
            "He is the First and the Last, and the Outer and the Inner, and He has knowledge of all things."
          ],
          "en.maududi": [
            "He is the First and the Last, and the Manifest and the Hidden, and He has knowledge of everything."
          ],
          "en.mubarakpuri": [
            "He is Al-Awwal and Al-Akhir, Az-Zahir and Al-Batin. And He is the All-Knower of everything."
          ],
          "en.pickthall": [
            "He is the First and the Last, and the Outward and the Inward; and He is Knower of all things."
          ],
          "en.qarai": [
            "He is the First and the Last, the Manifest and the Hidden, and He has knowledge of all things."
          ],
          "en.qaribullah": [
            "He is the First and the Last, the Clear and the Hidden. He has knowledge of all things."
          ],
          "en.sahih": [
            "He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing."
          ],
          "en.sarwar": [
            "He is the First, the Last, the Manifest, and the Unseen and He knows all things."
          ],
          "en.shakir": [
            "He is the First and the Last and the Ascendant (over all) and the Knower of hidden things, and He is Cognizant of all things."
          ],
          "en.transliteration": [
            "Huwa alawwalu wa<b>a</b>l<u>a</u>khiru wa<b>al</b><i><u>thth</u></i><u>a</u>hiru wa<b>a</b>lb<u>at</u>inu wahuwa bikulli shayin AAaleem<b>un</b>"
          ],
          "en.wahiduddin": [
            "He is the First and the Last, the Outward and the Inward. He has knowledge of all things."
          ],
          "en.yusufali": [
            "He is the First and the Last, the Evident and the Immanent: and He has full knowledge of all things."
          ],
          "fa.ansarian": [
            "اوست اول و آخر و ظاهر و باطن، و او به همه چیز داناست."
          ],
          "fa.ayati": [
            "اوست اوّل و آخر و ظاهر و باطن، و او به هر چيزى داناست."
          ],
          "fa.bahrampour": [
            "اوست اول و آخر و ظاهر و باطن، و او به هر چيزى داناست"
          ],
          "fa.fooladvand": [
            "اوست اول و آخر و ظاهر و باطن، و او به هر چيزى داناست."
          ],
          "fa.ghomshei": [
            "اوّل و آخر هستی و پیدا و پنهان وجود همه اوست و او به همه امور عالم داناست."
          ],
          "fa.khorramdel": [
            "او پیشین و پسین و پیدا و ناپیدا است، و او آگاه از همه چیز است. [[«الأوَّلُ»: پیشین. بی‌آغاز. آن که بودنش پیش از بودن همه موجودات است. «الآخِرُ»: پسین. بی‌انتها. آن که پس از نابودی همه موجودات، باقی و برجای است. «الظَّاهِرُ»: پیدا و نمودار. آن که همه چیز جهان، بودن او را فریاد می‌دارند، و بر وجود او دلالت دارند. «الْبَاطِنُ»: ناپیدا. نهان. آن که حواس، او را احاطه نمی‌سازد، و عقول او را درک نمی‌کند.]]"
          ],
          "fa.khorramshahi": [
            "اوست اول و آخر و ظاهر و باطن و او به همه چیز داناست‌"
          ],
          "fa.makarem": [
            "اوّل و آخر و پیدا و پنهان اوست؛ و او به هر چیز داناست."
          ],
          "fa.moezzi": [
            "او است آغاز و انجام و پیدا و نهان و او است به همه چیز دانا"
          ],
          "fa.mojtabavi": [
            "اوست اول و آخر- پيش از هر چيز بوده و پس از هر چيز هم باشد- و پيدا- به هستى- و نهان- به چگونگى-، و او به همه چيز داناست."
          ],
          "fa.sadeqi": [
            "اوست اول و آخر و ظاهر و باطن و او به هر چیزی بسی داناست."
          ]
        }
      },
      {
        "index": 5079,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:57:4",
        "text": [
          "هُوَ الَّذِي‌ خَلَقَ‌ السَّمَاوَاتِ‌ وَ الْأَرْضَ‌ فِي‌ سِتَّةِ أَيَّامٍ‌ ثُمَ‌ اسْتَوَى‌ عَلَى‌ الْعَرْشِ‌ يَعْلَمُ‌ مَا يَلِجُ‌ فِي‌ الْأَرْضِ‌ وَ مَا يَخْرُجُ‌ مِنْهَا وَ مَا يَنْزِلُ‌ مِنَ‌ السَّمَاءِ وَ مَا يَعْرُجُ‌ فِيهَا وَ هُوَ مَعَکُمْ‌ أَيْنَ‌ مَا کُنْتُمْ‌ وَ اللَّهُ‌ بِمَا تَعْمَلُونَ‌ بَصِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "It is He who created the heavens and the earth in six stages, then assumed the throne. He knows whatsoever enters the earth, and whatsoever comes out of it, and what comes down from the sky and what goes up to it; and He is with you wheresoever you may be, and He perceives whatsoever you do."
          ],
          "en.ahmedraza": [
            "It is He Who created the heavens and the earth in six days, then ascended the Throne (of Control), in a manner befitting His Majesty; He knows all what goes into the earth and all what comes out of it, and all what descends from the sky and all that rises in it; and He is with you, wherever you may be; and Allah is seeing your deeds."
          ],
          "en.arberry": [
            "It is He that created the heavens and the earth in six days then seated Himself upon the Throne. He knows what penetrates into the earth, and what comes forth from it, -- what comes down from heaven, and what goes up unto it. He is with you wherever you are; and God sees the things you do."
          ],
          "en.daryabadi": [
            "He it is Who created the heavens and the earth in six days; then He established Himself on the Throne. He knoweth whatsoever plungeth into the earth and whatsoever cometh forth therefrom, and whatsoever descendeth from the heaven and whatsoever ascendeth thereto; and He is with you wheresoever ye be. And Allah is of whatsoever ye work a Beholder."
          ],
          "en.hilali": [
            "He it is Who created the heavens and the earth in six Days and then Istawa (rose over) the Throne (in a manner that suits His Majesty). He knows what goes into the earth and what comes forth from it, what descends from the heaven and what ascends thereto. And He is with you (by His Knowledge) wheresoever you may be. And Allah is the All-Seer of what you do."
          ],
          "en.itani": [
            "It is He who created the heavens and the earth in six days, then settled over the Throne. He knows what penetrates into the earth, and what comes out of it, and what descends from the sky, and what ascends to it. And He is with you wherever you may be. God is Seeing of everything you do."
          ],
          "en.maududi": [
            "He it is Who created the heavens and the earth in six days and then established Himself on the Throne. He knows all that enters the earth and all that comes forth from it, and all that comes down from the heaven and all that goes up to it. He is with you wherever you are. Allah sees all that you do."
          ],
          "en.mubarakpuri": [
            "He it is Who created the heavens and the earth in six Days and then rose (Istawa) over the Throne. He knows what goes into the earth and what comes forth from it, and what descends from the heaven and what ascends thereto. And He is with you wheresoever you may be. And Allah is the All-Seer of what you do."
          ],
          "en.pickthall": [
            "He it is Who created the heavens and the earth in six Days; then He mounted the Throne. He knoweth all that entereth the earth and all that emergeth therefrom and all that cometh down from the sky and all that ascendeth therein; and He is with you wheresoever ye may be. And Allah is Seer of what ye do."
          ],
          "en.qarai": [
            "It is He who created the heavens and the earth in six days; then settled on the Throne. He knows whatever enters the earth and whatever emerges from it and whatever descends from the sky and whatever ascends to it, and He is with you wherever you may be, and Allah watches what you do."
          ],
          "en.qaribullah": [
            "He created the heavens and the earth in six days, and willed to the Throne. He knows what penetrates the earth and all that emerges from it; all that descends from heaven and all that ascends to it. He is with you wherever you are. Allah sees the things you do."
          ],
          "en.sahih": [
            "It is He who created the heavens and earth in six days and then established Himself above the Throne. He knows what penetrates into the earth and what emerges from it and what descends from the heaven and what ascends therein; and He is with you wherever you are. And Allah, of what you do, is Seeing."
          ],
          "en.sarwar": [
            "It is He who created the heavens and the earth in six days and then established His Dominion over the Throne. He knows whatever enters into the earth, what comes out of it, what descends from the sky, and what ascends to it. He is with you wherever you may be and He is Well Aware of what you do."
          ],
          "en.shakir": [
            "He it is who created the heavens and the earth in six periods, and He is firm in power; He knows that which goes deep down into the earth and that which comes forth out of it, and that which comes down from the heaven and that which goes up into it, and He is with you wherever you are; and Allah sees what you do."
          ],
          "en.transliteration": [
            "Huwa alla<u>th</u>ee khalaqa a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>a fee sittati ayy<u>a</u>min thumma istaw<u>a</u> AAal<u>a</u> alAAarshi yaAAlamu m<u>a</u> yaliju fee alar<u>d</u>i wam<u>a</u> yakhruju minh<u>a</u> wam<u>a</u> yanzilu mina a<b>l</b>ssam<u>a</u>i wam<u>a</u> yaAAruju feeh<u>a</u> wahuwa maAAakum ayna m<u>a</u> kuntum wa<b>A</b>ll<u>a</u>hu bim<u>a</u> taAAmaloona ba<u>s</u>eer<b>un</b>"
          ],
          "en.wahiduddin": [
            "It was He who created the heavens and earth in six Days [periods] and then ascended the throne. He knows what enters the earth and what comes out of it; what descends from the sky and what ascends to it. He is with you wherever you are; He sees all that you do;"
          ],
          "en.yusufali": [
            "He it is Who created the heavens and the earth in Six Days, and is moreover firmly established on the Throne (of Authority). He knows what enters within the earth and what comes forth out of it, what comes down from heaven and what mounts up to it. And He is with you wheresoever ye may be. And Allah sees well all that ye do."
          ],
          "fa.ansarian": [
            "اوست که آسمان ها و زمین را در شش روز آفرید، سپس بر تخت فرمانروایی و تدبیر امور آفرینش چیره و مسلط شد. آنچه در زمین فرو می رود و آنچه از آن بیرون می آید و آنچه از آسمان نازل می شود، و آنچه در آن بالا می رود می داند. و او با شماست هرجا که باشید، و خدا به آنچه انجام می دهید، بیناست."
          ],
          "fa.ayati": [
            "اوست كه آسمانها و زمين را در شش روز آفريد. سپس به عرش پرداخت. هر چه را در زمين فرو رود و هر چه را از زمين بيرون آيد و هر چه را از آسمان فرو آيد و هر چه را در آسمان بالا رود، مى‌داند. و هر جا كه باشيد همراه شماست و به هر كارى كه مى‌كنيد بيناست."
          ],
          "fa.bahrampour": [
            "او كسى است كه آسمان‌ها و زمين را در شش روز آفريد، سپس [براى تدبير جهان‌] به عرش پرداخت. آنچه در زمين فرو رود و آنچه از آن بيرون آيد و آنچه از آسمان فرود آيد و آنچه در آن بالا رود [همه‌] را مى‌داند، و هر كجا باشيد او با شماست، و خدا به آنچه مى‌كنيد بين"
          ],
          "fa.fooladvand": [
            "اوست آن كس كه آسمانها و زمين را در شش هنگام آفريد؛ آنگاه بر عرش استيلا يافت. آنچه در زمين درآيد و آنچه از آن برآيد و آنچه در آن بالارود [همه را] مى‌داند. و هر كجا باشيد او با شماست، و خدا به هر چه مى‌كنيد بيناست."
          ],
          "fa.ghomshei": [
            "اوست خدایی که آسمانها و زمین را در شش روز (و شش مرتبه کلی ظهور وجود) بیافرید آن‌گاه بر عرش (تدبیر عالم) قرار گرفت، او هر چه در زمین فرو رود و هر چه از آن برآید و آنچه از آسمان نازل شود و آنچه به آن بالا رود همه را می‌داند و هر کجا باشید او با شماست و خدا به هر چه کنید بیناست."
          ],
          "fa.khorramdel": [
            "او است که آسمانها و زمین را در شش دوره آفرید و سپس بر تخت (فرمانروائی کائنات) قرار گرفت. و او می‌داند چه چیز به زمین نازل و از آن خارج می‌شود، و چه چیز از آسمان پائین می‌آید و بدان بالا می‌رود. و او در هر کجا که باشید، با شما است. و خدا می‌بیند هر چیزی را که می‌کنید. [[«سِتَّةِ أَیَّامٍ»: شش روز. مراد شش دوره است (نگا: اعراف / 54، یونس / 3، هود / 7). «إسْتَوی عَلَی الْعَرْشِ»: (نگا: اعراف / 54، یونس / 3، رعد / 2). «یَلِجُ»: (نگا: سبأ / 2).]]"
          ],
          "fa.khorramshahi": [
            "اوست که آسمانها و زمین را در شش روز آفرید و سپس بر عرش استیلاء یافت، می‌داند که چه چیزی وارد زمین می‌شود و چه چیزی از آن بیرون می‌رود، و آنچه از آسمان فرو می‌آید و آنچه به آن فرا می‌رود، و او هرجا که باشید با شماست، و خداوند به آنچه می‌کنید بیناست‌"
          ],
          "fa.makarem": [
            "او کسی است که آسمانها و زمین را در شش روز [= شش دوران‌] آفرید؛ سپس بر تخت قدرت قرار گرفت (و به تدبیر جهان پرداخت)؛ آنچه را در زمین فرو می‌رود می‌داند، و آنچه را از آن خارج می‌شود و آنچه از آسمان نازل می‌گردد و آنچه به آسمان بالا می‌رود؛ و هر جا باشید او با شما است، و خداوند نسبت به آنچه انجام می‌دهید بیناست!"
          ],
          "fa.moezzi": [
            "او است آنکه آفرید آسمانها و زمین را در شش روز سپس استوار شد بر عرش داند آنچه را فرو رود در زمین و آنچه برون آید از آن و آنچه فرود آید از آسمان و آنچه بالا رود در آن و او با شما است هر جا باشید و خدا است بدانچه می‌کنید بینا"
          ],
          "fa.mojtabavi": [
            "اوست كه آسمانها و زمين را در شش روز- شش دوره- بيافريد، سپس بر عرش- مقام فرمانروايى و تدبير امور- برآمد. آنچه در زمين فرو رود و آنچه از آن بيرون آيد، و هر چه از آسمان فرود آيد و هر چه در آن بالا رود، همه را مى‌داند، و او هر جا كه باشيد با شماست، و خدا بدانچه مى‌كنيد بيناست."
          ],
          "fa.sadeqi": [
            "اوست کسی که آسمان‌ها و زمین را در شش روز [:زمان] آفرید. سپس بر عرش (ربوبیت) چیره شد، در حالی‌که آنچه در زمین فرو رود و آنچه از آن برآید و آنچه از آسمان فرود آید و آنچه در آن بالا رود (همه را) می‌داند. و هر کجا بودید او با شماست و خدا به هر چه می‌کنید بسیار بیناست."
          ]
        }
      },
      {
        "index": 5080,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:57:5",
        "text": [
          "لَهُ‌ مُلْکُ‌ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ وَ إِلَى‌ اللَّهِ‌ تُرْجَعُ‌ الْأُمُورُ"
        ],
        "translations": {
          "en.ahmedali": [
            "His is the kingdom of the heavens and the earth, and all things will go back to Him."
          ],
          "en.ahmedraza": [
            "For Him only is the kingship of the heavens and the earth; and towards Allah only is the return of all matters."
          ],
          "en.arberry": [
            "To Him belongs the Kingdom of the heavens and the earth; and unto Him all matters are returned."
          ],
          "en.daryabadi": [
            "His is the dominion of the heavens and the earth, and Unto Allah will all affairs be brought back."
          ],
          "en.hilali": [
            "His is the kingdom of the heavens and the earth. And to Allah return all the matters (for decision)."
          ],
          "en.itani": [
            "To Him belongs the kingship of the heavens and the earth, and to God all matters are referred."
          ],
          "en.maududi": [
            "His is the dominion of the heavens and the earth, and to Him are all matters referred (for judgement)."
          ],
          "en.mubarakpuri": [
            "His is the kingdom of the heavens and the earth. And to Allah return all the matters."
          ],
          "en.pickthall": [
            "His is the Sovereignty of the heavens and the earth, and unto Allah (all) things are brought back."
          ],
          "en.qarai": [
            "To Him belongs the kingdom of the heavens and the earth, and to Allah all matters are returned."
          ],
          "en.qaribullah": [
            "To Him belongs the Kingdom of the heavens and the earth. To Him all matters shall return."
          ],
          "en.sahih": [
            "His is the dominion of the heavens and earth. And to Allah are returned [all] matters."
          ],
          "en.sarwar": [
            "To Him belong the heavens and the earth and to Him all things return."
          ],
          "en.shakir": [
            "His is the kingdom of the heavens and the earth; and to Allah are (all) affairs returned."
          ],
          "en.transliteration": [
            "Lahu mulku a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i wail<u>a</u> All<u>a</u>hi turjaAAu alomoor<b>u</b>"
          ],
          "en.wahiduddin": [
            "He has sovereignty over the heavens and the earth. All affairs will return to God."
          ],
          "en.yusufali": [
            "To Him belongs the dominion of the heavens and the earth: and all affairs are referred back to Allah."
          ],
          "fa.ansarian": [
            "مالکیّت و فرمانروایی آسمان ها و زمین فقط در سیطره اوست، و همه امور به خدا باز گردانده می شود."
          ],
          "fa.ayati": [
            "فرمانروايى آسمانها و زمين از آن اوست، و همه كارها به خدا بازمى‌گردد."
          ],
          "fa.bahrampour": [
            "فرمانروايى آسمان‌ها و زمين از آن اوست، و كارها به سوى خدا بازگردانده مى‌شود"
          ],
          "fa.fooladvand": [
            "فرمانروايى [مطلق‌] آسمانها و زمين از آن اوست، و [جمله‌] كارها به سوى خدا بازگردانيده مى‌شود."
          ],
          "fa.ghomshei": [
            "آسمانها و زمین همه ملک اوست و رجوع تمام امور عالم به سوی خداست."
          ],
          "fa.khorramdel": [
            "مالکیّت و حاکمیّت آسمانها و زمین از آن او است، و همه‌ی کارها بدو برگردانده می‌شود. [[«لَهُ مُلْکُ ...»: (نگا: آل‌عمران / 109).]]"
          ],
          "fa.khorramshahi": [
            "فرمانروایی آسمانها و زمین او راست، و کارها به خداوند باز گردانده شود"
          ],
          "fa.makarem": [
            "مالکیّت آسمانها و زمین از آن اوست؛ و همه کارها به سوی او بازمی‌گردد."
          ],
          "fa.moezzi": [
            "او را است پادشاهی آسمانها و زمین و بسوی خدا بازگردانیده شوند کارها"
          ],
          "fa.mojtabavi": [
            "او راست پادشاهى آسمانها و زمين، و كارها همه به خداى باز مى‌گردد."
          ],
          "fa.sadeqi": [
            "فرمانروایی (مطلق) آسمان‌ها و زمین تنها از اوست و همه‌ی چیزها تنها سوی خدا بازگردانیده می‌شوند."
          ]
        }
      },
      {
        "index": 5081,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:57:6",
        "text": [
          "يُولِجُ‌ اللَّيْلَ‌ فِي‌ النَّهَارِ وَ يُولِجُ‌ النَّهَارَ فِي‌ اللَّيْلِ‌ وَ هُوَ عَلِيمٌ‌ بِذَاتِ‌ الصُّدُورِ"
        ],
        "translations": {
          "en.ahmedali": [
            "He turns night into day, and turns day into night; and He knows whatsoever is in your hearts."
          ],
          "en.ahmedraza": [
            "He brings the night in a part of the day, and brings the day in a part of the night; and He knows what lies within the hearts."
          ],
          "en.arberry": [
            "He makes the night to enter into the day and makes the day to enter into the night. He knows the thoughts within the breasts."
          ],
          "en.daryabadi": [
            "He plungeth the night into the day, and plungeth the day into the night, and He is the Knower of whatsoever is in the breasts."
          ],
          "en.hilali": [
            "He merges night into day (i.e. the decrease in the hours of the night is added into the hours of the day), and merges day into night (i.e. the decrease in the hours of the day is added into the hours of the night), and He has full knowledge of whatsoever is in the breasts."
          ],
          "en.itani": [
            "He merges the night into the day, and He merges the day into the night; and He knows what the hearts contains."
          ],
          "en.maududi": [
            "He causes the night to pass into the day, and causes the day to pass into the night, and He fully knows all that is hidden in the breasts of people."
          ],
          "en.mubarakpuri": [
            "He merges night into day, and merges day into night, and He has full knowledge of whatsoever is in the breasts."
          ],
          "en.pickthall": [
            "He causeth the night to pass into the day, and He causeth the day to pass into the night, and He is knower of all that is in the breasts."
          ],
          "en.qarai": [
            "He makes the night pass into the day and makes the day pass into the night, and He knows best what is in the breasts."
          ],
          "en.qaribullah": [
            "He causes the night to enter into the day and the day to enter into the night. He has knowledge of the thoughts of the innermost of the chests."
          ],
          "en.sahih": [
            "He causes the night to enter the day and causes the day to enter the night, and he is Knowing of that within the breasts."
          ],
          "en.sarwar": [
            "He causes night to enter into day and day into night. He knows best what all hearts contain."
          ],
          "en.shakir": [
            "He causes the night to enter in upon the day, and causes the day to enter in upon the night, and He is Cognizant of what is in the hearts."
          ],
          "en.transliteration": [
            "Yooliju allayla fee a<b>l</b>nnah<u>a</u>ri wayooliju a<b>l</b>nnah<u>a</u>ra fee allayi wahuwa AAaleemun bi<u>tha</u>ti a<b>l</b><u>ss</u>udoor<b>i</b>"
          ],
          "en.wahiduddin": [
            "He causes the night to pass into the day and the day to pass into the night. And He knows all that is in the hearts of men."
          ],
          "en.yusufali": [
            "He merges Night into Day, and He merges Day into Night; and He has full knowledge of the secrets of (all) hearts."
          ],
          "fa.ansarian": [
            "شب را در روز در می آورد و روز را در شب در می آورد، و او به نیّات و اسرار سینه ها داناست."
          ],
          "fa.ayati": [
            "از شب مى‌كاهد و به روز مى‌افزايد و از روز مى‌كاهد و به شب مى‌افزايد. و به هر چه در دلها مى‌گذرد آگاه است."
          ],
          "fa.bahrampour": [
            "شب را در روز فرو مى‌برد [و روز بلند مى‌شود] و روز را در شب فرو مى‌برد [و شب بلند مى‌گردد]، و او به راز سينه‌ها داناست"
          ],
          "fa.fooladvand": [
            "شب را در روز درمى‌آورد و روز را [نيز] در شب درمى‌آورد، و او به راز دلها داناست."
          ],
          "fa.ghomshei": [
            "شب را در (پرده زرین) روز نهان کند و روز را در (خیمه سیاه) شب پنهان سازد و به اسرار دلهای خلق هم او آگاه است."
          ],
          "fa.khorramdel": [
            "او شب را در روز، و روز را در شب داخل می‌گرداند (و گاهی از شب می‌کاهد و بر روز می‌افزاید، و گاهی از روز می‌کاهد و بر شب می‌افزاید، و نور و ظلمت را بدنبال هم آهسته و آرام روان می‌دارد) و او از انسانها و رازهای سینه‌ها مطّلع و باخبر است. [[«یُولِجُ»: داخل می‌گرداند (نگا: حج / 61، لقمان / 29). «ذَاتِ الصُّدُورِ»: (نگا: آل‌عمران / 119 و 154، مائده / 7)]]"
          ],
          "fa.khorramshahi": [
            "از شب می‌کاهد و بر روز می‌افزاید و از روز می‌کاهد و بر شب می‌افزاید و او به راز دلها داناست‌"
          ],
          "fa.makarem": [
            "شب را در روز می‌کند و روز را در شب؛ و او به آنچه در دل سینه‌ها وجود دارد داناست."
          ],
          "fa.moezzi": [
            "فروبرد شب را در روز و فروبرد روز را در شب و او دانا است بدانچه در سینه‌ها است‌"
          ],
          "fa.mojtabavi": [
            "شب را در روز درمى‌آورد و روز را در شب- اشاره به كاهش و افزايش شب و روز- و او بدانچه در سينه‌هاست- از نيتها و قصدها- داناست."
          ],
          "fa.sadeqi": [
            "شب را در روز می‌آورد و روز را در شب می‌آورد. و او به (راز) ذاتی سینه‌ها بسی داناست."
          ]
        }
      },
      {
        "index": 5082,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:57:7",
        "text": [
          "آمِنُوا بِاللَّهِ‌ وَ رَسُولِهِ‌ وَ أَنْفِقُوا مِمَّا جَعَلَکُمْ‌ مُسْتَخْلَفِينَ‌ فِيهِ‌ فَالَّذِينَ‌ آمَنُوا مِنْکُمْ‌ وَ أَنْفَقُوا لَهُمْ‌ أَجْرٌ کَبِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "Believe in God and His Apostle, and spend of what He has given you as His trustee. And those of you who believe and spend in charity will have a great reward."
          ],
          "en.ahmedraza": [
            "Accept faith in Allah and His Noble Messenger, and spend in His cause from what He has made you the heirs of; so for those among you who accepted faith and spent in His cause, is a great reward."
          ],
          "en.arberry": [
            "Believe in God and His Messenger, and expend of that unto which He has made you successors. And those of you who believe and expend shall have a mighty wage."
          ],
          "en.daryabadi": [
            "Believe in Allah and His apostle, and expend of that whereof He hath made you successors to. Those of you who believe and expend - theirs shall be a great hire."
          ],
          "en.hilali": [
            "Believe in Allah and His Messenger (Muhammad SAW), and spend of that whereof He has made you trustees. And such of you as believe and spend (in Allah's Way), theirs will be a great reward."
          ],
          "en.itani": [
            "Believe in God and His Messenger, and spend from what He made you inherit. Those among you who believe and give will have a great reward."
          ],
          "en.maududi": [
            "Believe in Allah and in His Messenger and expend of what He has entrusted to you. A great reward awaits those of you who believe and spend their wealth."
          ],
          "en.mubarakpuri": [
            "Believe in Allah and His Messenger, and spend of that whereof He has made you trustees. And such of you as believe and spend, theirs will be a great reward."
          ],
          "en.pickthall": [
            "Believe in Allah and His messenger, and spend of that whereof He hath made you trustees; and such of you as believe and spend (aright), theirs will be a great reward."
          ],
          "en.qarai": [
            "Have faith in Allah and His Apostle, and spend out of that of which He has made you heirs. There is a great reward for those of you who have faith and spend [in Allah’s way]."
          ],
          "en.qaribullah": [
            "Believe in Allah and His Messenger and spend (in charity) of that which He has made you successors. Whosoever of you believes and spends shall have amighty wage."
          ],
          "en.sahih": [
            "Believe in Allah and His Messenger and spend out of that in which He has made you successors. For those who have believed among you and spent, there will be a great reward."
          ],
          "en.sarwar": [
            "Have faith in God and His Messenger and spend for His cause out of what is entrusted to you. Those who believe and spend for the cause of God will have a great reward."
          ],
          "en.shakir": [
            "Believe in Allah and His Apostle, and spend out of what He has made you to be successors of; for those of you who believe and spend shall have a great reward."
          ],
          "en.transliteration": [
            "<u>A</u>minoo bi<b>A</b>ll<u>a</u>hi warasoolihi waanfiqoo mimm<u>a</u> jaAAalakum mustakhlafeena feehi fa<b>a</b>lla<u>th</u>eena <u>a</u>manoo minkum waanfaqoo lahum ajrun kabeer<b>un</b>"
          ],
          "en.wahiduddin": [
            "Have faith in God and His Messenger and spend in charity from that of which He has made you trustees: those of you who believe and give alms shall be richly rewarded."
          ],
          "en.yusufali": [
            "Believe in Allah and His messenger, and spend (in charity) out of the (substance) whereof He has made you heirs. For, those of you who believe and spend (in charity),- for them is a great Reward."
          ],
          "fa.ansarian": [
            "به خدا و پیامبرش ایمان آورید، و از اموالی که خدا شما را در آن جانشین خود قرار داده، انفاق کنید؛ پس برای کسانی از شما که ایمان آورده و انفاق کرده اند، پاداش بزرگی خواهد بود."
          ],
          "fa.ayati": [
            "به خدا و پيامبرش ايمان بياوريد و از آن مال كه به وراثت به شما رسانده است انفاق كنيد. از ميان شما هر كه را ايمان آورده و انفاق كرده، مزدى فراوانش دهند."
          ],
          "fa.bahrampour": [
            "به خدا و پيامبر او ايمان آوريد و از اموالى كه شما را در آن جانشين [خود] قرار داده انفاق كنيد پس كسانى از شما كه ايمان آوردند و انفاق كردند برايشان پاداش بزرگى است"
          ],
          "fa.fooladvand": [
            "به خدا و پيامبر او ايمان آوريد، و از آنچه شما را در [استفاده از] آن، جانشين [ديگران‌] كرده، انفاق كنيد. پس كسانى از شما كه ايمان آورده و انفاق كرده باشند، پاداش بزرگى خواهند داشت."
          ],
          "fa.ghomshei": [
            "(الا ای بندگان) به خدا و رسول او ایمان آرید و از آنچه شما را در آن وارث گذشتگان گردانید (به راه خدا) انفاق کنید، پس بر آنان که از شما ایمان آوردند و انفاق کردند پاداش بزرگ (بهشت ابد) خواهد بود."
          ],
          "fa.khorramdel": [
            "به خدا و پیغمبرش ایمان بیاورید، و از چیزهائی ببخشید که شما را در آنها نماینده (ی خود در تصرّف، و جانشین دیگران در بدست گرفتن اموال) کرده است. زیرا کسانی که از شما ایمان بیاورند و (در راه خدا) بذل و بخشش کنند، پاداش بزرگی دارند. [[«مُسْتَخْلَفِینَ»: نمایندگان خدا در صرف اموال و دادن آن به افراد مستحق. جانشینان دیگران در بدست گرفتن اموال. اشاره به دو چیز است: الف - در حقیقت مالک اصلی خدا است و اموال سپرده و امانتی در پیش انسان است. ب - دسته‌ای می‌روند و دسته‌ای می‌آیند و به نوبت اموال را بدست می‌گیرند و امانتدار می‌شوند (نگا: انعام / 165، یونس / 14).]]"
          ],
          "fa.khorramshahi": [
            "به خداوند و پیامبر او ایمان بیاورید و از آنچه شما را در آن جانشین ساخته است انفاق کنید، آری کسانی از شما که ایمان آورده و انفاق کنند پاداش بزرگی دارند"
          ],
          "fa.makarem": [
            "به خدا و رسولش ایمان بیاورید و از آنچه شما را جانشین و نماینده (خود) در آن قرار داده انفاق کنید؛ (زیرا) کسانی که از شما ایمان بیاورند و انفاق کنند، اجر بزرگی دارند!"
          ],
          "fa.moezzi": [
            "ایمان آرید به خدا و پیمبرش و ببخشید از آنچه گردانید شما را جانشینان در آن پس آنان که ایمان آوردند از شما و بخشایش کردند ایشان را است مُزدی بزرگ‌"
          ],
          "fa.mojtabavi": [
            "به خدا و پيامبرش ايمان آريد، و از آنچه شما را در آن جانشين [گذشتگان‌] گردانيده- اموالتان- انفاق كنيد، پس كسانى از شما كه ايمان آورده و انفاق كرده‌اند مزدى بزرگ دارند."
          ],
          "fa.sadeqi": [
            "به خدا و پیامبرش ایمان آورید و از آنچه شما را در (استفاده از) آن، جانشین (دیگران) کرده، انفاق کنید. پس کسانی از شما که ایمان آورده و انفاق کردند، پاداشی بزرگ برایشان (مقرر) است."
          ]
        }
      },
      {
        "index": 5083,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:57:8",
        "text": [
          "وَ مَا لَکُمْ‌ لاَ تُؤْمِنُونَ‌ بِاللَّهِ‌ وَ الرَّسُولُ‌ يَدْعُوکُمْ‌ لِتُؤْمِنُوا بِرَبِّکُمْ‌ وَ قَدْ أَخَذَ مِيثَاقَکُمْ‌ إِنْ‌ کُنْتُمْ‌ مُؤْمِنِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "What has come upon you that you believe not in God, though the Prophet is calling you to believe in your Lord? And He has already taken your pledge, if you are believers."
          ],
          "en.ahmedraza": [
            "And what is the matter with you, that you should not accept faith in Allah? Whereas this Noble Messenger is calling you to believe in your Lord, and Allah has indeed already taken a covenant from you, if you believe."
          ],
          "en.arberry": [
            "How is it with you, that you believe not in God seeing that the Messenger is calling you to believe in your Lord, and He has taken compact with you, if you are believers?"
          ],
          "en.daryabadi": [
            "And what aileth you that ye believe not in Allah whereas the apostle is calling you to believe in your Lord, and He hath already taken your bond, if ye are going to be believers?"
          ],
          "en.hilali": [
            "And what is the matter with you that you believe not in Allah! While the Messenger (Muhammad SAW) invites you to believe in your Lord (Allah), and He (Allah) has indeed taken your covenant, if you are real believers."
          ],
          "en.itani": [
            "What is the matter with you that you do not believe in God, when the Messenger calls you to believe in your Lord, and He has received a pledge from you, if you are believers?"
          ],
          "en.maududi": [
            "How is it that you do not believe in Allah when the Messenger calls you to believe in your Lord and although he has taken a covenant from you, if indeed you are believers?"
          ],
          "en.mubarakpuri": [
            "And what is the matter with you that you believe not in Allah! While the Messenger invites you to believe in your Lord; and He has indeed taken your covenant, if you are real believers."
          ],
          "en.pickthall": [
            "What aileth you that ye believe not in Allah, when the messenger calleth you to believe in your Lord, and He hath already made a covenant with you, if ye are believers?"
          ],
          "en.qarai": [
            "Why should you not have faith in Allah when the Apostle invites you to have faith in your Lord, and He has certainly made a covenant with you, if you are [genuinely] faithful?"
          ],
          "en.qaribullah": [
            "Why is it that you do not believe in Allah, when the Messenger calls on you to believe in your Lord, and He has made a covenant with you if you arebelievers?"
          ],
          "en.sahih": [
            "And why do you not believe in Allah while the Messenger invites you to believe in your Lord and He has taken your covenant, if you should [truly] be believers?"
          ],
          "en.sarwar": [
            "If you are true indeed to this covenant, why do you not believe in God, when His Messenger invites you to believe in your Lord with whom you have made a solemn covenant?"
          ],
          "en.shakir": [
            "And what reason have you that you should not believe in Allah? And the Apostle calls on you that you may believe in your Lord, and indeed He has made a covenant with you if you are believers."
          ],
          "en.transliteration": [
            "Wam<u>a</u> lakum l<u>a</u> tuminoona bi<b>A</b>ll<u>a</u>hi wa<b>al</b>rrasoolu yadAAookum lituminoo birabbikum waqad akha<u>th</u>a meeth<u>a</u>qakum in kuntum mumineen<b>a</b>"
          ],
          "en.wahiduddin": [
            "What could be your reason for not believing in God, when the Messenger calls on you to have faith in your Lord and He has already made a covenant with you, if indeed you are true believers?"
          ],
          "en.yusufali": [
            "What cause have ye why ye should not believe in Allah?- and the Messenger invites you to believe in your Lord, and has indeed taken your Covenant, if ye are men of Faith."
          ],
          "fa.ansarian": [
            "و شما را چه شده که به خدا ایمان نمی آورید؟ در حالی که پیامبر، شما را دعوت می کند تا به پروردگارتان ایمان آورید، و بی تردید خدا [از طریق عقل و فطرت بر ایمان آوردنتان] پیمان گرفته است، اگر باور دارید."
          ],
          "fa.ayati": [
            "چيست شما را كه به خدا ايمان نمى‌آوريد و حال آنكه پيامبر شما را دعوت مى‌كند كه به پروردگارتان ايمان بياوريد، و اگر باور داريد از شما پيمان گرفته است؟"
          ],
          "fa.bahrampour": [
            "و شما را چه شده است كه به خدا ايمان نمى‌آوريد و حال آن كه پيامبر، شما را دعوت مى‌كند تا به پروردگارتان ايمان آوريد؟ در حالى كه [خدا] از شما پيمان گرفته است، اگر مؤمن هستيد"
          ],
          "fa.fooladvand": [
            "و شما را چه شده كه به خدا ايمان نمى‌آوريد و [حال آنكه‌] پيامبر [خدا] شما را دعوت مى‌كند تا به پروردگارتان ايمان آوريد، و اگر مؤمن باشيد، بى‌شك [خدا] از شما پيمان گرفته است."
          ],
          "fa.ghomshei": [
            "و برای چه شما به خدا ایمان نیاورید در صورتی که رسول حق شما را (به آیات و معجزات) به راه ایمان به پروردگارتان دعوت می‌کند و خدا هم (در فطرت و عقل) از شما پیمان ایمان گرفته است اگر (قابلیت) ایمان دارید."
          ],
          "fa.khorramdel": [
            "چرا نباید به خدا ایمان بیاورید؟ در حالی که پیغمبر، شما را (با دلائل قوی و معجزات روشن) برای ایمان به پروردگارتان دعوت می‌کند؟ و (خداوند هم) از شما پیمان (فطری و کَونی) گرفته است (و نشانه‌های ایمان آوردن به خود را در درونتان سرشته است و در بیرونتان به معرض تماشا گذاشته شده است) اگر خواهان ایمان آوردن هستید؟ [[«قَدْ أَخَذَ مِیثَاقَکُمْ»: خداوند از شما پیمان ایمان آوردن گرفته است. این پیمان غیر از طریق وحی و نقل، به دو شیوه از طریق درک و عقل، از هر انسانی گرفته شده است: الف - خدا انسان را بر فطرت سلیم خداشناسی سرشته است، و اگر حجاب مادیات و لذائذ دنیوی بگذارد، انسان ذاتاً خداشناس است، و ندای وجدان او را به پرستش یزدان فریاد می‌دارد (نگا: روم / 30). ب - خدا قوانین و ضوابط و عجائب و غرائبی را در جلو دیدگان انسان گذاشته است و جهانی را در پیش روی او گسترانیده است که از ذره تا کهکشان آن، دالّ بر وجود یزدان است (نگا: اعراف / 172). «إِن کُنتُم مُّؤْمِنِینَ»: اگر خواستار ایمان و حاضر برای پذیرش آن هستید. این بخش از آیه، در معنی مقدم بر دیگر قسمتهای آیه است، و در اصل چنین است: إِن کُنتُم مُّؤْمِنِینَ، مَا لَکُمْ لا تُؤْمِنُونَ بِاللهِ، وَ الرَّسُولُ یَدْعُوکُمْ لِتُؤْمِنُوا بِرَبِّکُمْ وَ قَدْ أَخَذَ مِیثَاقَکُمْ؟ (نگا: روح‌المعانی، التفسیر القرآنی للقرآن). پس منظور از (إِن کُنتُم مُّؤْمِنِینَ) این است که: اگر شما حاضر به ایمان آوردن به خدا و پذیرش دلائل هستید، اینجا جای آن است.]]"
          ],
          "fa.khorramshahi": [
            "و شما را چه می‌شود که به خداوند ایمان نمی‌آورید، حال آنکه پیامبر شما را دعوت می‌کند که به پروردگارتان ایمان آورید، و به راستی اگر ایمان داشته باشید از شما پیمانتان را گرفته است‌"
          ],
          "fa.makarem": [
            "چرا به خدا ایمان نیاورید در حالی که رسول (او) شما را می‌خواند که به پروردگارتان ایمان بیاورید، و از شما پیمان گرفته است (پیمانی از طریق فطرت و خِرد)، اگر آماده ایمان‌آوردنید."
          ],
          "fa.moezzi": [
            "و چه شود شما را ایمان نیارید به خدا و پیمبر همی خواندتان تا ایمان آرید به پروردگار خویش و همانا بگرفت پیمان شما را اگر هستید مؤمنان‌"
          ],
          "fa.mojtabavi": [
            "و شما را چيست كه به خداى ايمان نمى‌آوريد- ايمانى كه آثار آن، از جمله انفاق مال، نمودار باشد- و حال آنكه پيامبر شما را مى‌خواند تا به پروردگارتان ايمان بياوريد؟! و هر آينه [خداوند] از شما پيمان گرفته است- بر اقرار بر ربوبيت و وحدانيت خود-، اگر باوردارنده‌ايد."
          ],
          "fa.sadeqi": [
            "و شما را چیست (که) به خدا ایمان نمی‌آورید و حال آنکه پیامبر (خدا) شما را دعوت می‌کند تا به پروردگارتان ایمان آورید و اگر مؤمن بوده‌اید، و خدا بی‌گمان از شما پیمان گرفته است."
          ]
        }
      },
      {
        "index": 5084,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:57:9",
        "text": [
          "هُوَ الَّذِي‌ يُنَزِّلُ‌ عَلَى‌ عَبْدِهِ‌ آيَاتٍ‌ بَيِّنَاتٍ‌ لِيُخْرِجَکُمْ‌ مِنَ‌ الظُّلُمَاتِ‌ إِلَى‌ النُّورِ وَ إِنَ‌ اللَّهَ‌ بِکُمْ‌ لَرَءُوفٌ‌ رَحِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "It is He who sends down splendent revelations to His votary that he may take you out of darkness into light; for surely God is gracious and kind to you."
          ],
          "en.ahmedraza": [
            "It is He Who sends down clear verses upon His chosen bondman, in order to take you out from the realms of darkness towards light; and indeed Allah is Most Compassionate, Most Merciful upon you."
          ],
          "en.arberry": [
            "It is He who sends down upon His servant signs, clear signs, that He may bring you forth from the shadows into the light. Surely God is to you All-gentle, All-compassionate."
          ],
          "en.daryabadi": [
            "He it is Who sendeth down Unto His bondman manifest signs that He may bring you forth from darknesses into the light; and verily Allah is Unto you Tender, Merciful."
          ],
          "en.hilali": [
            "It is He Who sends down manifest Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) to His slave (Muhammad SAW) that He may bring you out from darkness into light. And verily, Allah is to you full of kindness, Most Merciful."
          ],
          "en.itani": [
            "It is He who sends down upon His servant clear revelations, to bring you out of darkness into the light. God is Gentle towards you, Most Compassionate."
          ],
          "en.maududi": [
            "He it is Who sends down Clear Signs to His servant so as to bring you out from darkness into light. Surely Allah is Most Kind and Most Compassionate to you."
          ],
          "en.mubarakpuri": [
            "It is He Who sends down manifest Ayat to His servant that He may bring you out from darkness into light. And verily, Allah is to you full of kindness, Most Merciful."
          ],
          "en.pickthall": [
            "He it is Who sendeth down clear revelations unto His slave, that He may bring you forth from darkness unto light; and lo! for you, Allah is Full of Pity, Merciful."
          ],
          "en.qarai": [
            "It is He who sends down manifest signs to His servant that He may bring you out of darkness into light, and indeed Allah is most kind and merciful to you."
          ],
          "en.qaribullah": [
            "It is He who sends down clear verses to His worshiper, so that He brings you out of the darkness into the light. Indeed, Allah is the Gentle, the Most Merciful to you."
          ],
          "en.sahih": [
            "It is He who sends down upon His Servant [Muhammad] verses of clear evidence that He may bring you out from darknesses into the light. And indeed, Allah is to you Kind and Merciful."
          ],
          "en.sarwar": [
            "It is He who sends illustrious revelations to His servant to take you out of darkness to light. God is Compassionate and All-merciful to you."
          ],
          "en.shakir": [
            "He it is who sends down clear communications upon His servant, that he may bring you forth from utter darkness into light; and most surely Allah is Kind, Merciful to you."
          ],
          "en.transliteration": [
            "Huwa alla<u>th</u>ee yunazzilu AAal<u>a</u> AAabdihi <u>a</u>y<u>a</u>tin bayyin<u>a</u>tin liyukhrijakum mina a<b>l</b><i><u>thth</u></i>ulum<u>a</u>ti il<u>a</u> a<b>l</b>nnoori wainna All<u>a</u>ha bikum laraoofun ra<u>h</u>eem<b>un</b>"
          ],
          "en.wahiduddin": [
            "It is He who sends down to His Servant clear revelations, so that He may lead you out of darkness into light. God is indeed compassionate and merciful to you."
          ],
          "en.yusufali": [
            "He is the One Who sends to His Servant Manifest Signs, that He may lead you from the depths of Darkness into the Light and verily Allah is to you most kind and Merciful."
          ],
          "fa.ansarian": [
            "اوست که بر بنده اش آیات روشنی نازل می کند تا شما را از تاریکی ها به سوی نور بیرون آورد. و یقیناً خدا نسبت به شما رؤوف و مهربان است."
          ],
          "fa.ayati": [
            "اوست آن خدايى كه بر بنده خود آيات روشن را نازل مى‌كند تا شما را از تاريكى به روشنايى آورد. زيرا خدا به شما مُشفق و مهربان است."
          ],
          "fa.bahrampour": [
            "او كسى است كه بر بنده‌ى خود آياتى روشن فرو مى‌فرستد تا شما را از تاريكى‌ها به روشنايى در آورد، و به راستى خداوند به شما سخت رئوف و مهربان است"
          ],
          "fa.fooladvand": [
            "او همان كسى است كه بر بنده خود آيات روشنى فرو مى‌فرستد، تا شما را از تاريكيها به سوى نور بيرون كشاند. و در حقيقت، خدا [نسبت‌] به شما سخت رئوف و مهربان است."
          ],
          "fa.ghomshei": [
            "اوست خدایی که بر بنده خود (محمّد مصطفی صلّی اللّه علیه و آله) آیات قرآن روشن بیان را نازل می‌کند تا شما را از ظلمات (جهل و عصیان) بیرون آرد و به نور (علم و ایمان) رهبری کند و خدا بسیار در حق شما مشفق و مهربان است."
          ],
          "fa.khorramdel": [
            "خدا است که آیه‌های واضح و روشن را بر بنده‌ی خود نازل می‌گرداند تا شما را از تاریکیها (ی جهالت و ضلالت برهاند، و) به نور (ایمان و هدایت) برساند. چرا که خدا نسبت به شما بسیار بامحبّت و دارای مهر فراوان است. [[«آیَاتٍ بَیِّنَاتٍ»: (نگا: بقره / 99، یونس / 15، نور / 1). «رَؤُوفٌ رَّحِیمٌ»: (نگا: بقره / 143، توبه / 117).]]"
          ],
          "fa.khorramshahi": [
            "اوست که بر بنده‌اش آیاتی روشنگر فرو فرستاده است تا شما را از تاریکیها[ی جهل و کفر] به سوی نور [علم و ایمان‌] بازبرد، و بی‌گمان خداوند در حق شما رئوف مهربان است‌"
          ],
          "fa.makarem": [
            "او کسی است که آیات روشنی بر بنده‌اش [= محمد] نازل می‌کند تا شما را از تاریکیها به سوی نور برد؛ و خداوند نسبت به شما مهربان و رحیم است."
          ],
          "fa.moezzi": [
            "او است آنکه فرستد بر بنده خویش آیتهای روشن را تا برون آرد شما را از تاریکیها بسوی روشنائی و همانا خدا است به شما نوازنده مهربان‌"
          ],
          "fa.mojtabavi": [
            "اوست آن كه بر بنده خود آيات روشن و هويدا فرومى‌فرستد تا شما را از تاريكيها به روشنايى در آورد، و هر آينه خداوند به شما رؤوف و مهربان است."
          ],
          "fa.sadeqi": [
            "او کسی است که بر بنده‌ی خود آیات روشنی (را) به‌تدریج فرو می‌فرستد، تا شما را از تاریکی‌ها به نور برون آورد و خدا همواره (نسبت) به شما بسی مهربان (و) رحمتگر بر ویژگان است."
          ]
        }
      },
      {
        "index": 5085,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:57:10",
        "text": [
          "وَ مَا لَکُمْ‌ أَلاَّ تُنْفِقُوا فِي‌ سَبِيلِ‌ اللَّهِ‌ وَ لِلَّهِ‌ مِيرَاثُ‌ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ لاَ يَسْتَوِي‌ مِنْکُمْ‌ مَنْ‌ أَنْفَقَ‌ مِنْ‌ قَبْلِ‌ الْفَتْحِ‌ وَ قَاتَلَ‌ أُولٰئِکَ‌ أَعْظَمُ‌ دَرَجَةً مِنَ‌ الَّذِينَ‌ أَنْفَقُوا مِنْ‌ بَعْدُ وَ قَاتَلُوا وَ کُلاًّ وَعَدَ اللَّهُ‌ الْحُسْنَى‌ وَ اللَّهُ‌ بِمَا تَعْمَلُونَ‌ خَبِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "What has come upon you that you do not spend in the way of God, when the heritage of the heavens and the earth belongs to God? Those of you who spent before the victory and fought, are not equal (to those who did not). They are higher in position than those who spent after (the victory) and fought. To each one God has made the promise of excellence, for God is aware of all you do."
          ],
          "en.ahmedraza": [
            "And what is the matter with you that you should not spend in Allah’s cause, whereas Allah is the Inheritor of all that is in the heavens and in the earth? Those among you who spent and fought before the conquest of Mecca are not equal to others; they are greater in rank than those who spent and fought after the conquest; and Allah has promised Paradise to all of them; and Allah well knows what you do."
          ],
          "en.arberry": [
            "How is it with you, that you expend not in the way of God, and to God belongs the inheritance of the heavens and the earth? Not equal is he among you who spent, and who fought before the victory; those are mightier in rank than they who spent and fought afterwards; and unto each God has promised the reward most fair; and God is aware of the things you do."
          ],
          "en.daryabadi": [
            "And what aileth you that ye expend not in the way of Allah, when Allah's shall be the inheritance of the heavens and the earth! Those among you who expended and fought before the victory shall not be held equal They are mightier in rank than those who expended and fought afterwards; Unto each hath Allah promised good; and Allah is of whatsoever ye work Aware."
          ],
          "en.hilali": [
            "And what is the matter with you that you spend not in the Cause of Allah? And to Allah belongs the heritage of the heavens and the earth. Not equal among you are those who spent and fought before the conquering (of Makkah) (with those among you who did so later). Such are higher in degree than those who spent and fought afterwards. But to all, Allah has promised the best (reward). And Allah is All-Aware of what you do."
          ],
          "en.itani": [
            "And why is it that you do not spend in the cause of God, when to God belongs the inheritance of the heavens and the earth? Not equal among you are those who contributed before the conquest, and fought. Those are higher in rank than those who contributed afterwards, and fought. But God promises both a good reward. God is Well Experienced in what you do."
          ],
          "en.maududi": [
            "How is it that you do not expend in the Way of Allah when to Allah belongs the inheritance of the heavens and the earth? Those who spent their wealth and took part in fighting before the Victory cannot be equated (with those who spent their wealth and took part in fighting afterwards). They are higher in rank than those who spent and fought afterwards. But to each Allah has promised a good reward. Allah is well aware of all that you do."
          ],
          "en.mubarakpuri": [
            "And what is the matter with you that you spend not in the cause of Allah And to Allah belongs the heritage of the heavens and the earth. Not equal among you are those who spent and fought before the conquering. Such are higher in degree than those who spent and fought afterwards. But to all Allah has promised the best. And Allah is All-Aware of what you do."
          ],
          "en.pickthall": [
            "And what aileth you that ye spend not in the way of Allah when unto Allah belongeth the inheritance of the heavens and the earth? Those who spent and fought before the victory are not upon a level (with the rest of you). Such are greater in rank than those who spent and fought afterwards. Unto each hath Allah promised good. And Allah is Informed of what ye do."
          ],
          "en.qarai": [
            "Why should you not spend in the way of Allah, when to Allah belongs the heritage of the heavens and the earth? Those of you who spent [their means] and fought before the victory are not equal [to others]. They are greater in rank than those who have spent and fought afterwards. Yet Allah has promised the best reward to each and Allah is well aware of what you do."
          ],
          "en.qaribullah": [
            "And why is it that you do not spend in the Way of Allah, when the inheritance of the heavens and earth belong to Allah alone? Those who spent before the victory and took part in the fighting are mightier in rank and are not equal to those who spent and fought thereafter. Yet, Allah has promised each a fine reward, and Allah is Aware of what you do."
          ],
          "en.sahih": [
            "And why do you not spend in the cause of Allah while to Allah belongs the heritage of the heavens and the earth? Not equal among you are those who spent before the conquest [of Makkah] and fought [and those who did so after it]. Those are greater in degree than they who spent afterwards and fought. But to all Allah has promised the best [reward]. And Allah, with what you do, is Acquainted."
          ],
          "en.sarwar": [
            "Why do you not spend for the cause of God when to Him belongs the heritage of the heavens and the earth? Those who spend for the cause of God and fight before victory will have higher positions than those who spend for the cause of God and fight after victory. However, to both parties God has promised good rewards. God is Well Aware of what you do."
          ],
          "en.shakir": [
            "And what reason have you that you should not spend in Allah's way? And Allah's is the inheritance of the heavens and the earth, not alike among you are those who spent before the victory and fought (and those who did not): they are more exalted in rank than those who spent and fought afterwards; and Allah has promised good to all; and Allah is Aware of what you do."
          ],
          "en.transliteration": [
            "Wam<u>a</u> lakum all<u>a</u> tunfiqoo fee sabeeli All<u>a</u>hi walill<u>a</u>hi meer<u>a</u>thu a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i l<u>a</u> yastawee minkum man anfaqa min qabli alfat<u>h</u>i waq<u>a</u>tala ol<u>a</u>ika aAA<i><u>th</u></i>amu darajatan mina alla<u>th</u>eena anfaqoo min baAAdu waq<u>a</u>taloo wakullan waAAada All<u>a</u>hu al<u>h</u>usn<u>a</u> wa<b>A</b>ll<u>a</u>hu bim<u>a</u> taAAmaloona khabeer<b>un</b>"
          ],
          "en.wahiduddin": [
            "Why should you not spend for the cause of God, when God alone holds the heritage of the heavens and the earth? Those of you who spent and fought before the victory will be higher in rank than those who spent and fought afterwards. Yet God has promised you all a good reward. He is aware of all that you do."
          ],
          "en.yusufali": [
            "And what cause have ye why ye should not spend in the cause of Allah?- For to Allah belongs the heritage of the heavens and the earth. Not equal among you are those who spent (freely) and fought, before the Victory, (with those who did so later). Those are higher in rank than those who spent (freely) and fought afterwards. But to all has Allah promised a goodly (reward). And Allah is well acquainted with all that ye do."
          ],
          "fa.ansarian": [
            "و شما را چه شده که در راه خدا انفاق نمی کنید؟ در حالی که میراث آسمان ها و زمین مخصوص خداست [و کسی مالک حقیقی چیزی نیست]. کسانی از شما که پیش از فتح [مکه] انفاق کردند و جهاد نمودند [با دیگران] یکسان نیستند، آنان از جهت درجه از کسانی که پس از فتح [مکه] انفاق کردند و جهاد نمودند، بلندپایه ترند. و خدا به هریک وعده نیکو داده است و خدا به آنچه انجام می دهید، آگاه است."
          ],
          "fa.ayati": [
            "و چرا در راه خدا انفاق نمى‌كنيد و حال آنكه از آنِ خداست ميراث آسمانها و زمين؟ از ميان شما آنان كه پيش از فتح انفاق كرده و به جنگ رفته با آنان كه بعد از فتح انفاق كرده‌اند و به جنگ رفته‌اند برابر نيستند. درَجت آنان فراتر است. و خدا به همه وعده نيك مى‌دهد. و به هر كارى كه مى‌كنيد آگاه است."
          ],
          "fa.bahrampour": [
            "و شما را چه شده است كه در راه خدا انفاق نمى‌كنيد و حال آن كه ميراث آسمان‌ها و زمين به خدا تعلق دارد؟ كسانى از شما كه پيش از فتح [مكه‌] انفاق و جهاد كرده‌اند [با ديگران‌] يكسان نيستند. آنها از حيث درجه بزرگ‌تر از كسانى‌اند كه بعدا به انفاق و جهاد پردا"
          ],
          "fa.fooladvand": [
            "و شما را چه شده كه در راه خدا انفاق نمى‌كنيد و [حال آنكه‌] ميراث آسمانها و زمين به خدا تعلق دارد؟ كسانى از شما كه پيش از فتح [مكه‌] انفاق و جهاد كرده‌اند، [با ديگران‌] يكسان نيستند. آنان از [حيث ]درجه بزرگتر از كسانى‌اند كه بعداً به انفاق و جهاد پرداخته‌اند. و خداوند به هر كدام وعده نيكو داده است، و خدا به آنچه مى‌كنيد آگاه است."
          ],
          "fa.ghomshei": [
            "و برای چه در راه خدا انفاق نکنید در صورتی که (شما با ملک و مالتان روز مرگ فانی شوید و) وارث تمام (اهل) آسمانها و زمین خداست؟! آن مسلمانانی که پیش از فتح (مکه زمان ضعف اسلام) در راه دین انفاق و جهاد کردند با دیگران مساوی نیستند، آنها اجر و مقامشان بسیار عظیم‌تر از کسانی است که بعد از فتح (و قدرت اسلام) انفاق و جهاد کردند و لیکن خدا به همه وعده نیکوترین پاداش را (که بهشت ابد است) داده و خدا به هر چه کنید آگاه است."
          ],
          "fa.khorramdel": [
            "چرا در راه خدا نباید ببخشید و خرج کنید، و حال این که (اموال شما امانتی بیش نیست و تا آخر در دست شما نمی‌ماند، و همه‌ی چیزهای) برجای مانده‌ی آسمانها و زمین به خدا می‌رسد؟ کسانی از شما که پیش از فتح (مکّه، به سپاه اسلام کمک کرده‌اند و از اموال خود) بخشیده‌اند و (در راه خدا) جنگیده‌اند، (با دیگران) برابر و یکسان نیستند. آنان درجه و مقامشان فراتر و برتر از درجه و مقام کسانی است که بعد از فتح (مکّه، در راه اسلام) بذل و بخشش نموده‌اند و جنگیده‌اند. امّا به هر حال، خداوند به همه، وعده‌ی پاداش نیکو می‌دهد، و او آگاه از هر آن چیزی است که می‌کنید. [[«مِیرَاثُ»: ترکه. مرده ریگ. «لِلّهِ مِیراثُ السَّمَاوَاتِ ...»: (نگا: آل‌عمران / 180، حجر / 23، انبیاء / 89، قصص / 58). «الْفَتْحِ»: فتح مکه. «الْحُسْنی»: جزا و پاداش نیکو که بهشت است.]]"
          ],
          "fa.khorramshahi": [
            "و شما را چه می‌شود که در راه خدا انفاق نمی‌کنید، و حال آنکه میراث آسمانها و زمین از خداوند است، و از میان شما کسی که پیش از پیروزی [فتح مکه‌] انفاق و کارزار کرده باشد [با دیگران‌] برابر نیست، اینان بلندمرتبه‌ترند از کسانی که بعد از آن انفاق و کارزار کرده‌اند، و همه را خداوند وعده نیکی [/بهشت‌] داده است، و خداوند به آنچه می‌کنید آگاه است‌"
          ],
          "fa.makarem": [
            "چرا در راه خدا انفاق نکنید در حالی که میراث آسمانها و زمین همه از آن خداست (و کسی چیزی را با خود نمی‌برد)! کسانی که قبل از پیروزی انفاق کردند و جنگیدند (با کسانی که پس از پیروزی انفاق کردند) یکسان نیستند؛ آنها بلندمقامتر از کسانی هستند که بعد از فتح انفاق نمودند و جهاد کردند؛ و خداوند به هر دو وعده نیک داده؛ و خدا به آنچه انجام می‌دهید آگاه است."
          ],
          "fa.moezzi": [
            "و چه شود شما را انفاق نکنید در راه خدا و خدا را است میراث آسمانها و زمین یکسان نیستند از شما است آنان که انفاق کردند پیش از پیروزی و کارزار کردند آنان بزرگتر در پایه از آنان که انفاق کردند پس از این و کارزار کردند و هر کدام را نوید داده است خدا نکوئی را و خدا است بدانچه می‌کنید آگاه‌"
          ],
          "fa.mojtabavi": [
            "و شما را چيست- چه عذر داريد- كه در راه خدا- هنگام جهاد- هزينه نمى‌كنيد و حال آنكه خداى راست ميراث آسمانها و زمين؟! كسانى از شما كه پيش از فتح- فتح مكه يا صلح حديبيه- انفاق و كارزار كرده‌اند [با ديگران‌] برابر نيستند، پايه ايشان بزرگتر است از آنان كه پس از آن"
          ],
          "fa.sadeqi": [
            "و شما را چیست که در راه خدا انفاق نمی‌کنید؟ حال آنکه میراث آسمان‌ها و زمین تنها از آنِ اوست. کسانی از شما که پیش از (آن) پیروزی (بزرگ)، انفاق و کشتار کردند، (با دیگران) یکسان نیستند. ایشان از حیث درجه بزرگ‌تر از کسانی‌اند که پس از فتح به انفاق و کشتار پرداخته‌اند. و خدا به هر کدام وعده‌ی نیکوترین (زندگی) را داده و خدا به آنچه می‌کنید بسی آگاه است."
          ]
        }
      },
      {
        "index": 5086,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:57:11",
        "text": [
          "مَنْ‌ ذَا الَّذِي‌ يُقْرِضُ‌ اللَّهَ‌ قَرْضاً حَسَناً فَيُضَاعِفَهُ‌ لَهُ‌ وَ لَهُ‌ أَجْرٌ کَرِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Who will give a goodly loan to God which He will double for him, and be for him a splendid reward?"
          ],
          "en.ahmedraza": [
            "Who will lend a handsome loan to Allah so that He may double it for him? And for such is an honourable reward."
          ],
          "en.arberry": [
            "Who is he that will lend to God a good loan, and He will multiply it for him, and his shall be a generous wage?"
          ],
          "en.daryabadi": [
            "Who is he that will lend Allah a goodly loan, so that He may multiply it for him, and his shall be a hire honourable?"
          ],
          "en.hilali": [
            "Who is he that will lend to Allah a goodly loan, then (Allah) will increase it manifold to his credit (in repaying), and he will have (besides) a good reward (i.e. Paradise)."
          ],
          "en.itani": [
            "Who is he who will lend God a loan of goodness, that He may double it for him, and will have a generous reward?"
          ],
          "en.maududi": [
            "Who is it that will give Allah a beautiful loan? A loan that Allah will repay after increasing it many times and grant him a generous reward."
          ],
          "en.mubarakpuri": [
            "Who is he that will lend Allah a handsome loan: then He will increase it manifold to his credit, and he will have a honorable reward."
          ],
          "en.pickthall": [
            "Who is he that will lend unto Allah a goodly loan, that He may double it for him and his may be a rich reward?"
          ],
          "en.qarai": [
            "Who is it that will lend Allah a good loan, that He may multiply it for him and [that] there may be a noble reward for him?"
          ],
          "en.qaribullah": [
            "Who will lend a generous loan to Allah? He will multiply it for him and he shall receive a generous wage."
          ],
          "en.sahih": [
            "Who is it that would loan Allah a goodly loan so He will multiply it for him and he will have a noble reward?"
          ],
          "en.sarwar": [
            "Whoever gives a virtuous loan to God will receive double from Him in addition to an honorable reward."
          ],
          "en.shakir": [
            "Who is there that will offer to Allah a good gift so He will double it for him, and he shall have an excellent reward."
          ],
          "en.transliteration": [
            "Man <u>tha</u> alla<u>th</u>ee yuqri<u>d</u>u All<u>a</u>ha qar<u>d</u>an <u>h</u>asanan fayu<u>da</u>AAifahu lahu walahu ajrun kareem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Who will offer God a generous loan? He will double it for him and give him a rich reward."
          ],
          "en.yusufali": [
            "Who is he that will Loan to Allah a beautiful loan? for (Allah) will increase it manifold to his credit, and he will have (besides) a liberal Reward."
          ],
          "fa.ansarian": [
            "کیست که به خدا وامی نیکو دهد تا خدا آن را برای او دو چندان کند و او را پاداشی نیکو و باارزش باشد؟"
          ],
          "fa.ayati": [
            "كيست كه خدا را قرض‌الحسنه دهد تا براى او دو چندانش كند، و او را پاداشى نيكو باشد."
          ],
          "fa.bahrampour": [
            "كيست آن كس كه به خدا وام دهد تا آن را براى وى دو چندان كند و او را [در آخرت‌] پاداشى كريمانه باشد"
          ],
          "fa.fooladvand": [
            "كيست آن كس كه به خدا وامى نيكو دهد تا [نتيجه‌اش را] براى وى دوچندان گرداند و او را پاداشى خوش باشد؟"
          ],
          "fa.ghomshei": [
            "آن کیست که به خدا قرض نیکو دهد (یعنی قرض الحسنه و صدقه دهد و احسان به فقیران کند) تا خدا بر او چندین برابر گرداند و او را پاداشی با لطف و کرامت باشد؟"
          ],
          "fa.khorramdel": [
            "کیست که به خدا قرض نیکوئی دهد (و از اموالی که بدو داده شده است ببخشد) تا آن را برای او چندین برابر گرداند، و پاداش ارزشمندی بدو رساند؟ [[«یُقْرِضُ اللهَ ...»: (نگا: بقره / 245، مائده / 12). «کَرِیمٌ»: پرارزش. گرانقدر.]]"
          ],
          "fa.khorramshahi": [
            "کیست که در راه خداوند قرض‌الحسنه دهد، تا برایش دوچندان سازد و برای او پاداشی ارجمند است‌"
          ],
          "fa.makarem": [
            "کیست که به خدا وام نیکو دهد (و از اموالی که به او ارزانی داشته انفاق کند) تا خداوند آن را برای او چندین برابر کند؟ و برای او پاداش پرارزشی است!"
          ],
          "fa.moezzi": [
            "کیست آنکه وامی دهد خدا را وام نکو سپس چند برابر کند برایش و او را است پاداشی گرامی‌"
          ],
          "fa.mojtabavi": [
            "كيست كه خداى را وام دهد وامى نيكو تا او را دوچندان- يا چند برابر- باز دهد و او را مزدى گرانمايه باشد"
          ],
          "fa.sadeqi": [
            "کیست آن کس که خدا را وامی نیکو دهد تا برای وی چندانش گرداند و او را پاداشی پرکرامت است."
          ]
        }
      },
      {
        "index": 5087,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:57:12",
        "text": [
          "يَوْمَ‌ تَرَى‌ الْمُؤْمِنِينَ‌ وَ الْمُؤْمِنَاتِ‌ يَسْعَى‌ نُورُهُمْ‌ بَيْنَ‌ أَيْدِيهِمْ‌ وَ بِأَيْمَانِهِمْ‌ بُشْرَاکُمُ‌ الْيَوْمَ‌ جَنَّاتٌ‌ تَجْرِي‌ مِنْ‌ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ‌ فِيهَا ذٰلِکَ‌ هُوَ الْفَوْزُ الْعَظِيمُ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "The day you see the believers, men and women, with their light advancing ahead and to the right of them, (they will be told:) \"There is good news for you this day, of gardens with rivers flowing by where you will live for ever.\" This will be the great attainment."
          ],
          "en.ahmedraza": [
            "The day when you will see the believing men and believing women, that their light runs before them and on their right – it being said to them, “This day, the best tidings for you are the Gardens beneath which rivers flow – abide in it forever; this is the greatest success.”"
          ],
          "en.arberry": [
            "Upon the day when thou seest the believers, men and women, their light running before them, and on their right hands. 'Good tidings for you today! Gardens underneath which rivers flow, therein to dwell for ever; that is indeed the mighty triumph.'"
          ],
          "en.daryabadi": [
            "Mention the Day whereon thou shalt see the believing men and believing women, their light running before them and on their right hands: glad tidings Unto you To-day: Gardens whereunder rivers flow, abiders therein they will be. That! it is the mighty achievement."
          ],
          "en.hilali": [
            "On the Day you shall see the believing men and the believing women their light running forward before them and by their right hands. Glad tidings for you this Day! Gardens under which rivers flow (Paradise), to dwell therein forever! Truly, this is the great success!"
          ],
          "en.itani": [
            "On the Day when you see the believing men and believing women—their light radiating ahead of them, and to their right: “Good news for you today: gardens beneath which rivers flow, dwelling therein forever. That is the great triumph.”"
          ],
          "en.maududi": [
            "On that Day you will see believing men and women that their light will be running before them and on their right hands. (They will be told): “A good tiding to you today.” There shall be Gardens beneath which rivers flow; therein they shall abide. That indeed is the great triumph."
          ],
          "en.mubarakpuri": [
            "On the Day you shall see the believing men and the believing women -- their light running forward before them and in their right hands. Glad tidings for you this Day! Gardens under which rivers flow (Paradise), to dwell therein forever! Truly, this is the great success!"
          ],
          "en.pickthall": [
            "On the day when thou (Muhammad) wilt see the believers, men and women, their light shining forth before them and on their right hands, (and wilt hear it said unto them): Glad news for you this day: Gardens underneath which rivers flow, wherein ye are immortal. That is the supreme triumph."
          ],
          "en.qarai": [
            "The day you will see the faithful, men and women, with their light moving swiftly in front of them and on their right, [and they are greeted with the words:] ‘There is good news for you today! Gardens with streams running in them, to remain in them [forever]. That is the great success.’"
          ],
          "en.qaribullah": [
            "The Day (will surely come) when you shall see believing men and women with their light running before them on their right hands, (it will be said to them):'Glad tidings for you this Day. You shall live for ever in Gardens underneath which rivers flow! That is indeed the mighty triumph."
          ],
          "en.sahih": [
            "On the Day you see the believing men and believing women, their light proceeding before them and on their right, [it will be said], \"Your good tidings today are [of] gardens beneath which rivers flow, wherein you will abide eternally.\" That is what is the great attainment."
          ],
          "en.sarwar": [
            "On the Day of Judgment you will see the believers with their light shining in front of them and to their right. They will be told, \"Paradise wherein streams flow is the glad news for you today. You will live therein forever. This is the greatest triumph\"."
          ],
          "en.shakir": [
            "On that day you will see the faithful men and the faithful women-- their light running before them and on their right hand-- good news for you today: gardens beneath which rivers flow, to abide therein, that is the grand achievement."
          ],
          "en.transliteration": [
            "Yawma tar<u>a</u> almumineena wa<b>a</b>lmumin<u>a</u>ti yasAA<u>a</u> nooruhum bayna aydeehim wabiaym<u>a</u>nihim bushr<u>a</u>kumu alyawma jann<u>a</u>tun tajree min ta<u>h</u>tih<u>a</u> alanh<u>a</u>ru kh<u>a</u>lideena feeh<u>a</u> <u>tha</u>lika huwa alfawzu alAAa<i><u>th</u></i>eem<b>u</b>"
          ],
          "en.wahiduddin": [
            "On the  Day, you [Prophet] shall see the faithful, both men and women, with their light streaming out before them and on their right hands, [and you shall hear a voice saying to them:] \"Glad tidings for you today! You shall enter gardens with rivers flowing through them wherein you shall forever dwell. That is the supreme triumph.\""
          ],
          "en.yusufali": [
            "One Day shalt thou see the believing men and the believing women- how their Light runs forward before them and by their right hands: (their greeting will be): \"Good News for you this Day! Gardens beneath which flow rivers! to dwell therein for aye! This is indeed the highest Achievement!\""
          ],
          "fa.ansarian": [
            "[این پاداش نیکو و باارزش در] روزی [است] که مردان و زنان باایمان را می بینی که نورشان پیش رو و از جانب راستشان شتابان حرکت می کند، [به آنان می گویند:] امروز شما را مژده باد به بهشت هایی که از زیرِ [درختانِ] آن نهرها جاری است، در آنها جاودانه اید، این است آن کامیابی بزرگ."
          ],
          "fa.ayati": [
            "روزى كه مردان مؤمن و زنان مؤمن را ببينى كه نورشان پيشاپيش و در سمت راستشان مى‌رود. در آن روز بشارتتان به بهشتهايى است كه در آن نهرها روان است و در آن جاويد خواهيد ماند، و اين كاميابى بزرگى است."
          ],
          "fa.bahrampour": [
            "روزى كه مردان و زنان مؤمن را مى‌بينى كه نورشان پيشاپيش آنها و به جانب راستشان شتابان مى‌رود، [به آنها گفته مى‌شود:] مژده‌ى شما امروز باغ‌هايى است كه از پاى درختانش نهرها جارى است، [و] در آنها جاويدانيد. اين همان كاميابى بزرگ است"
          ],
          "fa.fooladvand": [
            "آن روز كه مردان و زنان مؤمن را مى‌بينى كه نورشان پيشاپيششان و به جانب راستشان دوان است. [به آنان گويند:] «امروز شما را مژده باد به باغهايى كه از زير [درختان‌] آن نهرها روان است، در آنها جاودانيد. اين است همان كاميابى بزرگ."
          ],
          "fa.ghomshei": [
            "(ای رسول ما یاد آر) روزی که مردان و زنان مؤمن شعشعه نور ایمانشان پیش رو و سمت راست آنها بشتابد (و آنان را مژده دهند که) امروز شما را به بهشتی که نهرها زیر درختانش جاری است بشارت باد که در آن بهشت جاودان خواهید بود. این همان سعادت و فیروزی بزرگ است."
          ],
          "fa.khorramdel": [
            "روزی مردان مؤمن و زنان مؤمن را خواهی دید که (به سوی بهشت حرکت می‌کنند و) نور (ایمان و اعمال خوب) ایشان، پیشاپیش آنان و در سمت راستشان در تلألؤ و درخشش است (و فرشتگان بدیشان مبارک‌بادی می‌گویند و می‌فرمایند:) مژده باد! که امروز به بهشتی درمی‌آئید که در زیر (کاخها و درختان) آن، رودبارها جاری است و جاودانه در آنجا بسر می‌برید و می‌مانید. پیروزی بزرگ و رستگاری سترگ، این است (خوش باشید). [[«یَسْعی»: در حرکت است. «نُورُهُمْ»: نور ایمان و اعمال نیک آنان. «بَیْنَ أَیْدِیهِمْ»: جلو آنان. پیشاپیش ایشان. روبرویشان. «أَیْمَانِهِمْ»: أَیْمان، جمع یَمین، طرف راست. دست راست ایشان. هدف از روبرو و طرف راست همه جهات است، ولی ذکر این دو جهت به خاطر احترام و شرفی است که دارند (نگا: روح‌المعانی). «بُشْری»: (نگا: بقره / 97، آل‌عمران / 126، انفال / 10).]]"
          ],
          "fa.khorramshahi": [
            "روزی که مردان مؤمن و زنان مؤمن را بینی که نورشان پیشاپیش آنان و در سمت راستشان می‌شتابد، امروز بشارت شما باغهایی است که از فرودست آن جویباران جاری است و جاودانه در آن هستید، این همانا رستگاری بزرگ است‌"
          ],
          "fa.makarem": [
            "(این پاداش بزرگ) در روزی است که مردان و زنان باایمان را می‌نگری که نورشان پیش‌رو و در سمت راستشان بسرعت حرکت می‌کند (و به آنها می‌گویند:) بشارت باد بر شما امروز به باغهایی از بهشت که نهرها زیر (درختان) آن جاری است؛ جاودانه در آن خواهید ماند! و این همان رستگاری بزرگ است!"
          ],
          "fa.moezzi": [
            "روزی که بینی مردان و زنان مؤمن را می‌دود نورشان پیش روی ایشان و از سوی راست ایشان مژده باد شما را امروز باغهائی که روان است زیر آنها جویها جاودانان در آنها این است آن رستگاری بزرگ‌"
          ],
          "fa.mojtabavi": [
            "در روزى كه مردان و زنان مؤمن را ببينى كه نورشان در پيش ايشان و از راست ايشان شتابان مى‌رود- مى‌درخشد تا به آسانى بگذرند-. امروز شما را مژدگان بهشتهايى است كه از زير [درختان‌] آنها جويها روان است در حالى كه در آنجا جاويدان باشيد اين است كاميابى و رستگارى بزرگ."
          ],
          "fa.sadeqi": [
            "روزی که مردان و زنان مؤمن را می‌بینی که نورشان پیشاپیش آنها و از جانب راستشان می‌شتابد (به آنان گویند:) «امروز مژده‌ی شما باغ‌هایی است که از زیر (درختان)شان نهرها روان است حال آنکه در آن‌ها جاودانید. این است همان کامیابی سالم بزرگ.»"
          ]
        }
      },
      {
        "index": 5088,
        "local_index": 13,
        "part_type": "Verse",
        "path": "/books/quran:57:13",
        "text": [
          "يَوْمَ‌ يَقُولُ‌ الْمُنَافِقُونَ‌ وَ الْمُنَافِقَاتُ‌ لِلَّذِينَ‌ آمَنُوا انْظُرُونَا نَقْتَبِسْ‌ مِنْ‌ نُورِکُمْ‌ قِيلَ‌ ارْجِعُوا وَرَاءَکُمْ‌ فَالْتَمِسُوا نُوراً فَضُرِبَ‌ بَيْنَهُمْ‌ بِسُورٍ لَهُ‌ بَابٌ‌ بَاطِنُهُ‌ فِيهِ‌ الرَّحْمَةُ وَ ظَاهِرُهُ‌ مِنْ‌ قِبَلِهِ‌ الْعَذَابُ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "The day the hypocrites, men and women, will say to the believers: \"Wait for us that we may borrow a little light from your light,\" they will be told: \"Go back, and look for your light.\" A wall shall be raised between them in which there will be a door. Within it will be benevolence and retribution without."
          ],
          "en.ahmedraza": [
            "The day when hypocrite men and hypocrite women will say to the Muslims, “Look mercifully towards us, so that we may gain some of your light!”; it will be said to them, “Turn back, search light over there!”; so they will turn around, whereupon a wall will be erected between them, in which is a gate; inside the gate is mercy, and on the outer side is the punishment."
          ],
          "en.arberry": [
            "Upon the day when the hypocrites, men and women, shall say to those who have believed, 'Wait for us, so that we may borrow your light!' It shall be said, 'Return you back behind, and seek for a light!' And a wall shall be set up between them, having a door in the inward whereof is mercy, and against the outward thereof is chastisement."
          ],
          "en.daryabadi": [
            "It shall be the Day whereon the hypocritical men and hypocritical women will say Unto those who believe: wait for us that we may borrow some of your light. Then betwixt them there will be set a high wall, wherein will be a door, the inside whereof hath mercy, while the outside thereof is toward the torment."
          ],
          "en.hilali": [
            "On the Day when the hypocrites men and women will say to the believers: \"Wait for us! Let us get something from your light!\" It will be said: \"Go back to your rear! Then seek a light!\" So a wall will be put up between them, with a gate therein. Inside it will be mercy, and outside it will be torment.\""
          ],
          "en.itani": [
            "On the Day when the hypocritical men and hypocritical women will say to those who believed, “Wait for us; let us absorb some of your light.” It will be said, “Go back behind you, and seek light.” A wall will be raised between them, in which is a door; within it is mercy, and outside it is agony."
          ],
          "en.maududi": [
            "On that Day the hypocrites, both men and women, shall say to the believers: “Look at us that we may extract some light from your light.” They will be told: “Go back and seek light for yourselves elsewhere.” Then a wall shall be erected between them with a door in it. On the inside of it there will be mercy, and on the outside of it there will be chastisement."
          ],
          "en.mubarakpuri": [
            "On the Day when the hypocrites men and women will say to the believers: \"Wait for us! Let us get something from your light!\" It will be said: \"Go back to your rear! Then seek a light!\" So, a wall will be put up between them, with a gate therein. Inside it will be mercy, and outside it will be torment."
          ],
          "en.pickthall": [
            "On the day when the hypocritical men and the hypocritical women will say unto those who believe: Look on us that we may borrow from your light! it will be said: Go back and seek for light! Then there will separate them a wall wherein is a gate, the inner side whereof containeth mercy, while the outer side thereof is toward the doom."
          ],
          "en.qarai": [
            "The day the hypocrites, men and women, will say to the faithful, ‘Please wait, that we may glean something from your light!’ They will be told: ‘Go back and grope for light!’ Then there will be set up between them a wall with a gate, with mercy within and punishment without."
          ],
          "en.qaribullah": [
            "On that Day the hypocrites, both men and women, will say to the believers: 'Wait for us so that we can take from your light' But they will be answered: 'Go back and seek a light' And a wall with a door shall be between them. Inside it there is mercy, and outside will be the punishment."
          ],
          "en.sahih": [
            "On the [same] Day the hypocrite men and hypocrite women will say to those who believed, \"Wait for us that we may acquire some of your light.\" It will be said, \"Go back behind you and seek light.\" And a wall will be placed between them with a door, its interior containing mercy, but on the outside of it is torment."
          ],
          "en.sarwar": [
            "On that day the hypocrites will say to the believers, \"Please look at us so that we might benefit from your light.\" They will be told, \"Go back and search for your own light.\" A barrier with a door will be placed between them. Inside it there will be mercy but outside of it there will be torment."
          ],
          "en.shakir": [
            "On the day when the hypocritical men and the hypocritical women will say to those who believe: Wait for us, that we may have light from your light; it shall be said: Turn back and seek a light. Then separation would be brought about between them, with a wall having a door in it; (as for) the inside of it, there shall be mercy in it, and (as for) the outside of it, before it there shall be punishment."
          ],
          "en.transliteration": [
            "Yawma yaqoolu almun<u>a</u>fiqoona wa<b>a</b>lmun<u>a</u>fiq<u>a</u>tu lilla<u>th</u>eena <u>a</u>manoo on<i><u>th</u></i>uroon<u>a</u> naqtabis min noorikum qeela irjiAAoo war<u>a</u>akum fa<b>i</b>ltamisoo nooran fa<u>d</u>uriba baynahum bisoorin lahu b<u>a</u>bun b<u>at</u>inuhu feehi a<b>l</b>rra<u>h</u>matu wa<i><u>th</u></i><u>a</u>hiruhu min qibalihi alAAa<u>tha</u>b<b>u</b>"
          ],
          "en.wahiduddin": [
            "On that Day, the hypocrites, both men and women, will say to the faithful, \"Wait a while for us, so that we may have some of your light.\" They will be told, \"Turn back and look for a light elsewhere.\" A wall will then be raised between them. It will have a gate on the inside of which will be grace and mercy and on the outside of which will be punishment."
          ],
          "en.yusufali": [
            "One Day will the Hypocrites- men and women - say to the Believers: \"Wait for us! Let us borrow (a Light) from your Light!\" It will be said: \"Turn ye back to your rear! then seek a Light (where ye can)!\" So a wall will be put up betwixt them, with a gate therein. Within it will be Mercy throughout, and without it, all alongside, will be (Wrath and) Punishment!"
          ],
          "fa.ansarian": [
            "روزی که مردان و زنان منافق به کسانی که ایمان آورده اند، می گویند: ما را مهلت دهید تا [پرتویی] از نور شما بر گیریم. به آنان گویند: به پشت سرتان [دنیا] برگردید و [از آنجا برای خود] نوری بجویید. سپس میان آنان دیواری زده می شود که دارای دری است، درونش [که مؤمنان در آن درآیند] رحمت است و بیرونش که پیش روی منافقان قرار دارد عذاب است."
          ],
          "fa.ayati": [
            "روزى كه مردان منافق و زنان منافق به كسانى كه ايمان آورده‌اند مى‌گويند: درنگى كنيد تا از نورتان فروغى گيريم. گويند: به دنيا بازگرديد و از آنجا نور بطلبيد. ميانشان ديوارى برآورند كه بر آن ديوار درى باشد؛ درون آن رحمت باشد و بيرون آن عذاب."
          ],
          "fa.bahrampour": [
            "آن روز كه مردان و زنان منافق به كسانى كه ايمان آورده‌اند گويند: نظرى به ما بيفكنيد تا از نورتان فروغى برگيريم. گفته شود: به پشت سرتان [دنيا] بازگرديد و از آن جا نورى بطلبيد. آن‌گاه ميان آنها ديوارى زده شود كه آن را درى است كه اندرون آن رحمت است و بير"
          ],
          "fa.fooladvand": [
            "آن روز، مردان و زنان منافق به كسانى كه ايمان آورده‌اند مى‌گويند: «ما را مهلت دهيد تا از نورتان [اندكى‌] برگيريم.» گفته مى‌شود: «بازپس برگرديد و نورى درخواست كنيد.» آنگاه ميان آنها ديوارى زده مى‌شود كه آن را دروازه‌اى است: باطنش رحمت است و ظاهرش روى به عذاب دارد."
          ],
          "fa.ghomshei": [
            "و باز آن روز مردان و زنان منافق به اهل ایمان گویند: مشتابید و به ما فرصتی دهید تا ما هم از نور شما روشنایی برگیریم. در پاسخ به آنها گویند: واپس گردید (یعنی اگر می‌توانید به دنیا بازگردید) و از آنجا نور طلبید. در این گفتگو باشند که بین آن دوزخیان با اهل بهشت حصاری حایل گردد و بر آن حصار دری باشد که باطن و درون آن در، بهشت رحمت است و از جانب ظاهر آن عذاب جهنم خواهد بود."
          ],
          "fa.khorramdel": [
            "روزی مردان منافق و زنان منافق به مؤمنان می‌گویند: (با شتاب به سوی بهشت حرکت نکنید و) منتظرمان بمانید تا از نور شما فروغ و پرتوی (به ما بتابد و از آن) استفاده کنیم! بدیشان گفته می‌شود: به عقب برگردید (و مجدّداً به دنیا بروید) و نوری به دست بیاورید! در این حال ناگهان دیواری میان آنان کشیده می‌شود که دری دارد. داخل آن (که به طرف مؤمنان است) رو به رحمت است (که بهشت و نعمت سرمدی است) و خارج آن (که به طرف منافقان است) رو به عذاب است (که دوزخ و نقمت ابدی است). [[«أُنظُرُونَا»: منتظر ما بمانید و شتاب مکنید. به ما بنگرید تا از نور صورت شما بهره‌مند شویم و راه خود را پیدا کنیم (نگا: قاسمی). نظر لطف و محبتی به ما بیفکنید و سهمی از نور خود را به ما بدهید. «نَقْتَبِسْ»: شعله و پرتوی برگیریم (نگا: طه / 10). «إِرْجِعُوا وَرَآءَکُمْ»: به عقب برگردید. مراد برگشتن به دنیا است. «قِیلَ»: گویندگان آن مؤمنان یا فرشتگانند. «سُورٍ»: دیوار بلند. باره. بارو. «بابٌ»: در. دروازه. چه بسا مراد این باشد که چنین دیواری دروازه‌ای دارد که مؤمنان از آنجا وارد طرف بهشت می‌گردند و پس از ورود همه آنان، به روی منافقان بسته می‌شود. «بَاطِنُهُ»: داخل آن. قسمتی که مؤمنان در آنجا هستند. «ظَاهِرُهُ»: پشت دیوار. خارج دیوار. قسمتی که منافقان در آنجا هستند.]]"
          ],
          "fa.khorramshahi": [
            "روزی که مردان منافق و زنان منافق به مؤمنان گویند به خاطر ما درنگ کنید تا از نورتان روشنی فراگیریم، گفته شود پس پشت خویش باز گردید و نوری بجویید، سپس میان آنان دیواری زده شود که دری دارد، از درون‌سو در آن رحمت است و از برون سوی آن عذاب است‌"
          ],
          "fa.makarem": [
            "روزی که مردان و زنان منافق به مؤمنان می‌گویند: «نظری به ما بیفکنید تا از نور شما پرتوی برگیریم!» به آنها گفته می‌شود: «به پشت سر خود بازگردید و کسب نور کنید!» در این هنگام دیواری میان آنها زده می‌شود که دری دارد، درونش رحمت است و برونش عذاب!"
          ],
          "fa.moezzi": [
            "روزی که گویند مردان و زنان دوروی بدانان که ایمان آوردند بنگرید به ما تا بهره‌مند شویم به پرتوی از نور شما گفته شد بازگردید پشت سر خویش پس بجوئید پرتوی پس زده شد میانشان حصاری (دیواری) که آن را است در اندرونش رحمت و برونش از پیش آن است عذاب‌"
          ],
          "fa.mojtabavi": [
            "روزى كه مردان و زنان منافق به كسانى كه ايمان آورده‌اند گويند: به ما بنگريد- يا درنگ كنيد- تا از نور شما [روشنايى‌] فرا گيريم. گفته شود- مؤمنان يا فرشتگان گويند-: به پشت سر خويش- يعنى به دنيا- بازگرديد و [از آنجا] روشنايى بجوييد- يعنى روشنايى را بايد از دنيا با خود آورد-. پس ميانشان ديوارى برآرند كه آن را درى باشد در اندرون آن رحمت- بهشت- است و بيرون آن از پيشش عذاب- دوزخ- است."
          ],
          "fa.sadeqi": [
            "روزی که مردان و زنان منافق به کسانی که ایمان آورده‌اند گویند: «ما را بنگرید تا مقداری از نورتان را بهره برگیریم.‌» گفته شد: «واپس روید. پس نوری درخواست کنید.» پس میانشان دیواری زده شد که آن را دربی است: باطنش در (ژرفای) رحمت و از سوی ظاهرش عذاب است."
          ]
        }
      },
      {
        "index": 5089,
        "local_index": 14,
        "part_type": "Verse",
        "path": "/books/quran:57:14",
        "text": [
          "يُنَادُونَهُمْ‌ أَ لَمْ‌ نَکُنْ‌ مَعَکُمْ‌ قَالُوا بَلَى‌ وَ لٰکِنَّکُمْ‌ فَتَنْتُمْ‌ أَنْفُسَکُمْ‌ وَ تَرَبَّصْتُمْ‌ وَ ارْتَبْتُمْ‌ وَ غَرَّتْکُمُ‌ الْأَمَانِيُ‌ حَتَّى‌ جَاءَ أَمْرُ اللَّهِ‌ وَ غَرَّکُمْ‌ بِاللَّهِ‌ الْغَرُورُ"
        ],
        "translations": {
          "en.ahmedali": [
            "They will call to them: \"Were we not with you?\" They will answer: \"Certainly; but then you let yourselves be tempted, and waited in expectation but were suspicious and were deceived by vain desires, till the decree of God came to pass, and the deceiver duped you in respect of God."
          ],
          "en.ahmedraza": [
            "The hypocrites will call out to the Muslims, “Were we not with you?”; they will answer, “Yes you were, why not? But you had put your souls into trial, and you used to await misfortune for the Muslims, and you doubted, and false hopes deceived you until Allah’s command came – and the big cheat had made you conceited towards the command of Allah.”"
          ],
          "en.arberry": [
            "They shall be calling unto them, 'Were we not with you?' They shall say, 'Yes indeed; but you tempted yourselves, and you awaited, and you were in doubt, and fancies deluded you, until God's commandment came, and the Deluder deluded you concerning God."
          ],
          "en.daryabadi": [
            "They will cry unto them: have we not been with you? They will say: 'yea! but ye tempted your souls, and ye Waited, and ye dubitated, and your vain desires beguiled you until the affair of Allah came, and in respect to Allah the beguiler beguiled you."
          ],
          "en.hilali": [
            "(The hypocrites) will call the believers: \"Were we not with you?\" The believers will reply: \"Yes! But you led yourselves into temptations, you looked forward for our destruction; you doubted (in Faith); and you were deceived by false desires, till the Command of Allah came to pass. And the chief deceiver (Satan) deceived you in respect of Allah.\""
          ],
          "en.itani": [
            "They will call to them, “Were we not with you?” They will say, “Yes, but you cheated your souls, and waited, and doubted, and became deluded by wishful thinking, until the command of God arrived; and arrogance deceived you regarding God.”"
          ],
          "en.maududi": [
            "The hypocrites will call out to the believers: “Were we not with you?” The believers will reply: “Yes; but you allowed yourselves to succumb to temptations, and you wavered and you remained in doubt and false expectations deluded you until Allah's command came to pass, and the Deluder deluded you concerning Allah."
          ],
          "en.mubarakpuri": [
            "(The hypocrites) will call the believers: \"Were we not with you\" The believers will reply: \"Yes! But you led yourselves into temptations, you looked forward to our destruction; and you doubted, and you were deceived by false hopes, till the command of Allah came to pass. And the deceiver deceived you in regard to Allah.\""
          ],
          "en.pickthall": [
            "They will cry unto them (saying): Were we not with you? They will say: Yea, verily; but ye tempted one another, and hesitated, and doubted, and vain desires beguiled you till the ordinance of Allah came to pass; and the deceiver deceived you concerning Allah;"
          ],
          "en.qarai": [
            "They will call out to them, ‘Did we not use to be with you?’ They will say, ‘Yes! But you cast yourselves into perdition. You awaited and were skeptical, and [false] hopes deceived you until the edict of Allah came, and the Deceiver deceived you concerning Allah."
          ],
          "en.qaribullah": [
            "They will call out to them, saying: 'Were we not with you' 'Yes' they will reply, 'but you tempted yourselves, you waited (for problems to befall thebelievers), and you doubted, and were deluded by your own fancies until the Command of Allah came, and the deluder (satan) deluded you concerning Allah."
          ],
          "en.sahih": [
            "The hypocrites will call to the believers, \"Were we not with you?\" They will say, \"Yes, but you afflicted yourselves and awaited [misfortune for us] and doubted, and wishful thinking deluded you until there came the command of Allah. And the Deceiver deceived you concerning Allah."
          ],
          "en.sarwar": [
            "(Those outside) will call out, \"Were we not with you?\" (Those inside) will reply, \"Yes, you were with us but you spent your life in disbelief and hypocrisy, wished death to (Muhammad), had doubts about his message and let your longings deceive you until the decree of God came to pass. The devil deceived you about the mercy of God."
          ],
          "en.shakir": [
            "They will cry out to them: Were we not with you? They shall say: Yea! but you caused yourselves to fall into temptation, and you waited and doubted, and vain desires deceived you till the threatened punishment of Allah came, while the archdeceiver deceived you about Allah."
          ],
          "en.transliteration": [
            "Yun<u>a</u>doonahum alam nakun maAAakum q<u>a</u>loo bal<u>a</u> wal<u>a</u>kinnakum fatantum anfusakum watarabba<u>s</u>tum wa<b>i</b>rtabtum wagharratkumu alam<u>a</u>niyyu <u>h</u>att<u>a</u> j<u>a</u>a amru All<u>a</u>hi wagharrakum bi<b>A</b>ll<u>a</u>hi algharoor<b>u</b>"
          ],
          "en.wahiduddin": [
            "The hypocrites will call out to the faithful: \"Were we not on your side?\" They will reply, \"Yes, but you gave in to temptation, you wavered and doubted and were deceived by your wishful thinking until God's will was done; then the Deceiver [Satan] misled you about God.\""
          ],
          "en.yusufali": [
            "(Those without) will call out, \"Were we not with you?\" (The others) will reply, \"True! but ye led yourselves into temptation; ye looked forward (to our ruin); ye doubted (Allah's Promise); and (your false) desires deceived you; until there issued the Command of Allah. And the Deceiver deceived you in respect of Allah."
          ],
          "fa.ansarian": [
            "مؤمنان را ندا می دهند: آیا ما [در دنیا] با شما نبودیم؟ می گویند: چرا، ولی شما خود را [به سبب نفاق و دشمنی با خدا و رسول] در بلا و هلاکت افکندید و به انتظار [خاموش شدن چراغ اسلام و نابودی پیامبر] نشستید و [نسبت به حقایق] در تردید بودید و آرزوها [ی دور و دراز و بی پایه،] شما را فریفت، تا فرمان خدا [به نابودی شما] در رسید و [شیطان] فریبنده، شما را فریب داد."
          ],
          "fa.ayati": [
            "و آنها را ندا دهند كه آيا ما با شما همراه نبوديم؟ مى‌گويند: بلى، اما شما خويشتن را در بلا افكنديد و به انتظار نشستيد و در شك بوديد و آرزوها شما را بفريفت تا آنگاه كه فرمان خدا دررسيد و شيطان به خدا مغرورتان كرد."
          ],
          "fa.bahrampour": [
            "[منافقان‌] آنها را ندا دهند: آيا ما با شما نبوديم؟ مى‌گويند: چرا، ولى شما خود را در فتنه و گرفتارى افكنديد و به انتظار نشستيد و ترديد كرديد و آرزوها شما را فريفت، تا فرمان خدا [و مرگتان‌] فرا رسيد و فريبكار، شما را در باره‌ى خدا فريفت"
          ],
          "fa.fooladvand": [
            "[دو رويان،] آنان را ندا درمى‌دهند: «آيا ما با شما نبوديم؟» مى‌گويند: «چرا، ولى شما خودتان را در بلا افكنديد و امروز و فردا كرديد و ترديد آورديد و آرزوها شما را غرّه كرد تا فرمان خدا آمد و [شيطان ]مغروركننده، شما را در باره خدا بفريفت."
          ],
          "fa.ghomshei": [
            "باز منافقان (بهشتیان را) ندا کنند که آخر نه ما هم با شما بودیم؟ آنها جواب دهند: بلی راست می‌گویید لیکن شما (به نفاق با خدا) خود را به فتنه افکندید و انتظار (هلاکت مؤمنان) داشتید و (در کار دین) به شک و ریب بودید و آرزوهای دنیا فریبتان داد تا وقتی که امر خدا (یعنی مرگ) فرا رسید و شیطان فریبنده شما را غافل و مغرور گردانید."
          ],
          "fa.khorramdel": [
            "منافقان، مؤمنان را فریاد می‌دارند، مگر ما (در دنیا) با شما نبودیم؟ می‌گویند: بلی! ولیکن (با نفاق) خویشتن را گرفتار بلا کردید، و چشم به راه (مرگ پیغمبر، و نابودی مسلمانان، و برچیده شدن اسلام) ماندید و (درباره‌ی حقّانیّت دعوت پیغمبر و قرآن و وجود معاد و رستاخیز) شک و تردید ورزیدید، و آرزوها و پندارها شما را گول زد، تا این که فرمان خدا (دائر بر مرگتان) در رسید و اهریمن (بدکاره و نفس امّاره‌ی) فریبکار، شما را درباره‌ی خدا فریب داد. [[«فَتَنتُمْ»: در فتنه و بلا انداخته‌اید. «تَرَبَّصْتُمْ»: درنگ کرده‌اید. منتظر مانده‌اید. «إِرْتَبْتُمْ»: شک و تردید نموده‌اید. دودلی ورزیده‌اید. «غَرَّتْکُمْ»: (نگا: جاثیه / 35، انعام / 70 و 130، اعراف / 51). «الْغَرُورُ»: (نگا: لقمان / 33، فاطر / 5).]]"
          ],
          "fa.khorramshahi": [
            "آنان را ندا دهند که مگر ما با شما نبودیم؟ گویند چرا ولی شما خودتان را در بلا افکندید و چشم به راه [حوادث سوء برای مسلمانان‌] بودید و شک و شبهه ورزیدید و آرزوها شما را فریفت، تا آنکه فرمان الهی [/مرگ‌] در رسید، و [شیطان‌] فریبکار شما را در حق خداوند فریب داد"
          ],
          "fa.makarem": [
            "آنها را صدا می‌زنند: «مگر ما با شما نبودیم؟!» می‌گویند: «آری، ولی شما خود را به هلاکت افکندید و انتظار (مرگ پیامبر را) کشیدید، و (در همه چیز) شکّ و تردید داشتید، و آرزوهای دور و دراز شما را فریب داد تا فرمان خدا فرا رسید، و شیطان فریبکار شما را در برابر (فرمان) خداوند فریب داد!"
          ],
          "fa.moezzi": [
            "بانگ دهندشان آیا نبودیم با شما گفتند بلی و لیکن شما فریب دادید خویش را و درنگ‌کاری نمودید و شکّ آوردید و سرگرمتان داشت آرزوها تا بیامد امر خدا و فریب داد شما را به خدا فریبکار"
          ],
          "fa.mojtabavi": [
            "[منافقان‌] ايشان"
          ],
          "fa.sadeqi": [
            "(در آن روز) دو رویان، آنان را ندا در می‌دهند: «آیا ما با شما نبودیم‌؟» گفتند: «چرا ولی شما خودتان را در فتنه افکندید و امروز و فردا کردید و تردید آوردید، و آرزوها(ی باطل)، شما را مغرور کرد تا فرمان خدا آمد و (شیطانِ) غرورآفرین، شما را درباره‌ی خدا به غرور آورد.»"
          ]
        }
      },
      {
        "index": 5090,
        "local_index": 15,
        "part_type": "Verse",
        "path": "/books/quran:57:15",
        "text": [
          "فَالْيَوْمَ‌ لاَ يُؤْخَذُ مِنْکُمْ‌ فِدْيَةٌ وَ لاَ مِنَ‌ الَّذِينَ‌ کَفَرُوا مَأْوَاکُمُ‌ النَّارُ هِيَ‌ مَوْلاَکُمْ‌ وَ بِئْسَ‌ الْمَصِيرُ"
        ],
        "translations": {
          "en.ahmedali": [
            "So no ransom will be accepted of you on this day, or of those who refused to believe. Hell will be your refuge and the only friend -- and how evil a destination!\""
          ],
          "en.ahmedraza": [
            "“So this day no ransom is to be taken from you nor from the declared disbelievers; your destination is the fire; that is your companion; and what a wretched outcome!”"
          ],
          "en.arberry": [
            "Therefore today no ransom shall be taken from you, neither from those who disbelieved. Your refuge is the Fire, that is your master -- an evil homecoming!'"
          ],
          "en.daryabadi": [
            "To-day therefore no ransom will be accepted of you nor of those who openly disbelieved; your abode is the Fire; that is your companion; a hapless destination."
          ],
          "en.hilali": [
            "So this Day no ransom shall be taken from you (hypocrites), nor of those who disbelieved, (in the Oneness of Allah Islamic Monotheism). Your abode is the Fire, that is the proper place for you, and worst indeed is that destination."
          ],
          "en.itani": [
            "“Therefore, today no ransom will be accepted from you, nor from those who disbelieved. The Fire is your refuge. It is your companion—what an evil fate!”"
          ],
          "en.maududi": [
            "So no ransom shall be accepted from you today, nor from those who disbelieved. You are destined for the Fire. That will be your guardian. And that indeed is a grievous destination."
          ],
          "en.mubarakpuri": [
            "So, this Day no ransom shall be taken from you, nor of those who disbelieved. Your abode is the Fire. That is your protector, and worst indeed is that destination."
          ],
          "en.pickthall": [
            "So this day no ransom can be taken from you nor from those who disbelieved. Your home is the Fire; that is your patron, and a hapless journey's end."
          ],
          "en.qarai": [
            "So today no ransom shall be taken from you or the faithless. The Fire will be your abode: it is your [ultimate] refuge and an evil destination.’"
          ],
          "en.qaribullah": [
            "Today no ransom shall be accepted from you or from the unbelievers. Your shelter is the Fire, that is your sponsor, the worst arrival'"
          ],
          "en.sahih": [
            "So today no ransom will be taken from you or from those who disbelieved. Your refuge is the Fire. It is most worthy of you, and wretched is the destination."
          ],
          "en.sarwar": [
            "So on this day no ransom will be accepted from you nor from the disbelievers. Your dwelling will be fire. It will be your friend and a terrible end\"."
          ],
          "en.shakir": [
            "So today ransom shall not be accepted from you nor from those who disbelieved; your abode is the fire; it is your friend and evil is the resort."
          ],
          "en.transliteration": [
            "Fa<b>a</b>lyawma l<u>a</u> yukha<u>th</u>u minkum fidyatun wal<u>a</u> mina alla<u>th</u>eena kafaroo maw<u>a</u>kumu a<b>l</b>nn<u>a</u>ru hiya mawl<u>a</u>kum wabisa alma<u>s</u>eer<b>u</b>"
          ],
          "en.wahiduddin": [
            "So this Day no ransom can be taken from you nor from those who were bent on denying the truth. Your home is the fire; that is your companion, and a hapless journey's end."
          ],
          "en.yusufali": [
            "\"This Day shall no ransom be accepted of you, nor of those who rejected Allah.\" Your abode is the Fire: that is the proper place to claim you: and an evil refuge it is!\""
          ],
          "fa.ansarian": [
            "پس امروز از شما و از کافران فدیه و عوضی [در برابر نجات از عذاب] دریافت نخواهد شد، جایگاهتان آتش است، [و] همان سرپرست و یار شماست و بد بازگشت گاهی است."
          ],
          "fa.ayati": [
            "و امروز نه از شما فديه‌اى پذيرند و نه از كافران. جايگاهتان آتش است. آتش سزاوار شماست. و بد سرانجامى است."
          ],
          "fa.bahrampour": [
            "پس امروز نه از شما و نه از كسانى كه كافر شده‌اند عوضى پذيرفته نمى‌شود. جايگاهتان آتش است و همان سزاوار شما است، و بد سر انجامى است"
          ],
          "fa.fooladvand": [
            "پس امروز نه از شما و نه از كسانى كه كافر شده‌اند عوضى پذيرفته نمى‌شود: جايگاهتان آتش است؛ آن سزاوار شماست و چه بد سرانجامى است.»"
          ],
          "fa.ghomshei": [
            "پس امروز (بر نجات هیچ یک) از شما منافقان و کافران فدیه و عوض نپذیرند، همه منزلگاهتان آتش دوزخ است و آن آتش شما را سزاوارتر است و بسیار به بد منزلی باز می‌گردید."
          ],
          "fa.khorramdel": [
            "پس امروز، هم از شما، و هم از کافران، عوضی و غرامتی پذیرفته نمی‌شود. جایگاه شماها آتش دوزخ است. دوزخ سرپرستتان است (و پناهگاهی جز آن ندارید) و چه بد سرنوشتی و چه بد جایگاهی است! [[«فِدْیَةٌ»: عوض. غرامت. در قیامت تنها وسیله نجات ایمان و عمل صالح است. در آن روز تمام اسباب و وسائل مادی که در این جهان برای رسیدن به مقاصد معمول است از کار می‌افتد، و پیوندها بریده می‌شود (نگا: بقره / 48 و 254، دخان / 41، طور / 46، مؤمنون / 101، مدثر / 38). «مَأْوَاکُمُ النَّارُ»: (نگا: عنکبوت / 25، جاثیه / 34). «مَوْلی»: سرپرست. سرور. یار و یاور. در اینجا واژه آقا و یاور، جنبه ریشخند و تمسخر دارد. بدان می‌ماند که ستمگری به مهلکه بیفتد و طلب کمک کند و بدو گفته شود: یار و مددکار و ولی و سرپرست تو چوبه دار، و پرت کردن به میان آتش سوزان و قهار است. «بِئْسَ الْمَصِیرُ»: (نگا: بقره / 126، آل‌عمران / 162، انفال / 16).]]"
          ],
          "fa.khorramshahi": [
            "پس امروز نه از شما و نه از کافران، بدل و بلاگردانی پذیرفته نشود، سرا و سرانجام شما آتش [دوزخ‌] است، او پناه شماست و چه بد سرانجامی است‌"
          ],
          "fa.makarem": [
            "پس امروز نه از شما فدیه‌ای پذیرفته می‌شود، و نه از کافران؛ و جایگاهتان آتش است و همان سرپرستتان می‌باشد؛ و چه بد جایگاهی است!"
          ],
          "fa.moezzi": [
            "پس امروز گرفته نشود از شما بدلی و نه از آنان که کفر ورزیدند جایگاه شما آتش است آن است دوست شما و چه زشت است آن جایگاه‌"
          ],
          "fa.mojtabavi": [
            "پس امروز از شما و نه از كسانى كه كافر شدند بازخريدى نستانند. جايگاهتان آتش دوزخ است. آن به شما سزاوارتر و نزديكتر است، و بد بازگشتگاهى است."
          ],
          "fa.sadeqi": [
            "«پس امروز نه از شما و نه از کسانی که کافر شده‌اند عوضی گرفته نشود. پناهگاهتان آتش است. (هم) آن سرپرست و پشتوانه‌ی شماست و چه بد سرانجامی است.»"
          ]
        }
      },
      {
        "index": 5091,
        "local_index": 16,
        "part_type": "Verse",
        "path": "/books/quran:57:16",
        "text": [
          "أَ لَمْ‌ يَأْنِ‌ لِلَّذِينَ‌ آمَنُوا أَنْ‌ تَخْشَعَ‌ قُلُوبُهُمْ‌ لِذِکْرِ اللَّهِ‌ وَ مَا نَزَلَ‌ مِنَ‌ الْحَقِ‌ وَ لاَ يَکُونُوا کَالَّذِينَ‌ أُوتُوا الْکِتَابَ‌ مِنْ‌ قَبْلُ‌ فَطَالَ‌ عَلَيْهِمُ‌ الْأَمَدُ فَقَسَتْ‌ قُلُوبُهُمْ‌ وَ کَثِيرٌ مِنْهُمْ‌ فَاسِقُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Has the moment not yet come when the hearts of believers should be moved by the thought of God and the truth that has been sent down, so that they should not be like those who received the Book before them but whose hearts were hardened after a lapse of time, and many of them turned disobedient?"
          ],
          "en.ahmedraza": [
            "Has not the time come for the believers to surrender their hearts to Allah’s remembrance and to this truth that has come down? And do not be like those who were earlier given the Book(s) and when a long term passed over them, their hearts became hardened; and many of them are sinners."
          ],
          "en.arberry": [
            "Is it not time that the hearts of those who believe should be humbled to the Remembrance of God and the Truth which He has sent down, and that they should not be as those to whom the Book was given aforetime, and the term seemed over long to them, so that their hearts have become hard, and many of them are ungodly?"
          ],
          "en.daryabadi": [
            "Is not the time yet come unto those who believe, that their hearts should humble themselves to the admonition of Allah and to the truth which hath come down, and that they become not as those who were vouchsafed the Book aforetime, and the time become extended unto them, and so their hearts became hard? And many of them are transgressors"
          ],
          "en.hilali": [
            "Has not the time come for the hearts of those who believe (in the Oneness of Allah - Islamic Monotheism) to be affected by Allah's Reminder (this Quran), and that which has been revealed of the truth, lest they become as those who received the Scripture [the Taurat (Torah) and the Injeel (Gospel)] before (i.e. Jews and Christians), and the term was prolonged for them and so their hearts were hardened? And many of them were Fasiqun (rebellious, disobedient to Allah)."
          ],
          "en.itani": [
            "Is it not time for those who believe to surrender their hearts to the remembrance of God, and to the truth that has come down, and not be like those who were given the Book previously, but time became prolonged for them, so their hearts hardened, and many of them are sinners?"
          ],
          "en.maududi": [
            "Is the time not come that the hearts of the believers should be humbled to Allah's remembrance and to the Truth that He has revealed, and that they should not be like those who were vouchsafed the Book and then a long time elapsed so that their hearts were hardened? A great many of them are now evil-doers."
          ],
          "en.mubarakpuri": [
            "Has not the time yet come for the believers that their hearts should be humble for the remembrance of Allah And that which has been revealed of the truth, lest they become as those who received the Scripture before, and the term was prolonged for them and so their hearts were hardened And many of them were rebellious."
          ],
          "en.pickthall": [
            "Is not the time ripe for the hearts of those who believe to submit to Allah's reminder and to the truth which is revealed, that they become not as those who received the scripture of old but the term was prolonged for them and so their hearts were hardened, and many of them are evil-livers."
          ],
          "en.qarai": [
            "Is it not time yet for those who have faith that their hearts should be humbled for Allah’s remembrance and toward the truth which has come down [to them], and to be not like those who were given the Book before? Time took its toll on them and so their hearts were hardened, and many of them are transgressors."
          ],
          "en.qaribullah": [
            "Is it not time that the hearts of the believers be humbled to the Remembrance of Allah and the truth which He has sent down? They should not be like those who were given the Book before this, whose time became very long so that their hearts became hardened. Many of them were impious."
          ],
          "en.sahih": [
            "Has the time not come for those who have believed that their hearts should become humbly submissive at the remembrance of Allah and what has come down of the truth? And let them not be like those who were given the Scripture before, and a long period passed over them, so their hearts hardened; and many of them are defiantly disobedient."
          ],
          "en.sarwar": [
            "Is it not time for the hearts of the believers to become humbled by the remembrance of God and by the Truth which has been revealed so that they will not be like the followers of the Bible who lived before them and whose hearts have become hard like stone through the long years. Many of them are evil doers."
          ],
          "en.shakir": [
            "Has not the time yet come for those who believe that their hearts should be humble for the remembrance of Allah and what has come down of the truth? And that they should not be like those who were given the Book before, but the time became prolonged to them, so their hearts hardened, and most of them are transgressors."
          ],
          "en.transliteration": [
            "Alam yani lilla<u>th</u>eena <u>a</u>manoo an takhshaAAa quloobuhum li<u>th</u>ikri All<u>a</u>hi wam<u>a</u> nazala mina al<u>h</u>aqqi wal<u>a</u> yakoonoo ka<b>a</b>lla<u>th</u>eena ootoo alkit<u>a</u>ba min qablu fa<u>ta</u>la AAalayhimu alamadu faqasat quloobuhum wakatheerun minhum f<u>a</u>siqoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Has the time not come for the faithful when their hearts in all humility should engage in the remembrance of God and of the revelation of truth, so that they should not become like those who were given the Book before them, whose hearts with the passage of time became hardened and many of whom were disobedient?"
          ],
          "en.yusufali": [
            "Has not the Time arrived for the Believers that their hearts in all humility should engage in the remembrance of Allah and of the Truth which has been revealed (to them), and that they should not become like those to whom was given Revelation aforetime, but long ages passed over them and their hearts grew hard? For many among them are rebellious transgressors."
          ],
          "fa.ansarian": [
            "آیا برای اهل ایمان وقت آن نرسیده که دل هایشان برای یاد خدا و قرآنی که نازل شده نرم و فروتن شود؟ و مانند کسانی نباشند که پیش از این کتاب آسمانی به آنان داده شده بود، آن گاه روزگار [سرگرمی در امور دنیا و مشغول بودن به آرزوهای دور و دراز] بر آنان طولانی گشت، در نتیجه دل هایشان سخت و غیر قابل انعطاف شد، و بسیاری از آنان نافرمان بودند."
          ],
          "fa.ayati": [
            "آيا مؤمنان را وقت آن نرسيده است كه دلهايشان در برابر ياد خدا و آن سخن حق كه نازل شده است، خاشع شود؟ همانند آن مردمى نباشند كه پيش از اين كتابشان داديم و چون مدتى برآمد دلهايشان سخت شد و بسيارى نافرمان شدند."
          ],
          "fa.bahrampour": [
            "آيا براى كسانى كه ايمان آورده‌اند وقت آن نرسيده است كه دل‌هايشان به ياد خدا و آن حقيقتى كه نازل شده (قرآن) نرم و خاشع گردد و مانند كسانى نباشند كه در گذشته كتابشان داده شد پس زمان بر آنها طولانى شد و دل‌هايشان را قساوت گرفت و بسيارى از آنها فاسق بودن"
          ],
          "fa.fooladvand": [
            "آيا براى كسانى كه ايمان آورده‌اند هنگام آن نرسيده كه دلهايشان به ياد خدا و آن حقيقتى كه نازل شده نرم [و فروتن‌] گردد و مانند كسانى نباشند كه از پيش بدانها كتاب داده شد و [عمر و] انتظار بر آنان به درازا كشيد، و دلهايشان سخت گرديد و بسيارى از آنها فاسق بودند؟"
          ],
          "fa.ghomshei": [
            "آیا نوبت آن نرسید که گرویدگان (ظاهری از باطن به خدا بگروند و) دلهاشان به یاد خدا خاشع گردد و به آنچه از حق نازل شد بذل توجه کنند و مانند کسانی که پیش از این برایشان کتاب آسمانی آمد (یعنی یهود و نصاری) نباشند که دوره طولانی (زمان فترت) بر آنها گذشت و دلهاشان زنگ قساوت گرفت و بسیاری فاسق و نابکار شدند؟"
          ],
          "fa.khorramdel": [
            "آیا وقت آن برای مؤمنان فرا نرسیده است که دلهایشان به هنگام یاد خدا، و در برابر حق و حقیقتی که خدا فرو فرستاده است، بلرزد و کرنش برد؟ و آنان همچون کسانی نشوند که برای آنان قبلاً کتاب فرستاده شده است و سپس زمان طولانی بر آنان سپری گشته است، و دلهایشان سخت شده است، و بیشترشان فاسق و خارج (از حدود دین خدا) گشته‌اند. [[«أَلَمْ یَأْنِ ...»: آیا نزدیک نشده است؟ آیا وقت آن فرا نرسیده است؟ از ماده (أَنی، یَأْنی، أَنْیاً). «ذِکْرِ»: یاد. به خاطر آوردن. «لِذِکْرِ»: حرف (ل) به معنی (عِندَ) است (نگا: اسراء / 78). «مَا نَزَلَ ...»: مراد قرآن است. «الأمَدُ»: زمان. مدت. مراد فاصله زمانی ایشان با پیغمبران است.]]"
          ],
          "fa.khorramshahi": [
            "آیا مؤمنان را هنگام آن نرسیده است که دلهایشان به یاد خداوند، و آنچه از حق که نازل شده است، خشوع یابد، و مانند کسانی نباشند که پیشترها به آنان کتاب آسمانی داده شده است، و سپس روزگارشان دراز نمود، آنگاه دلهایشان سخت شد و بسیاری از آنان نافرمان بودند"
          ],
          "fa.makarem": [
            "آیا وقت آن نرسیده است که دلهای مؤمنان در برابر ذکر خدا و آنچه از حقّ نازل کرده است خاشع گردد؟! و مانند کسانی نباشند که در گذشته به آنها کتاب آسمانی داده شد، سپس زمانی طولانی بر آنها گذشت و قلبهایشان قساوت پیدا کرد؛ و بسیاری از آنها گنهکارند!"
          ],
          "fa.moezzi": [
            "آیا هنگام آن نشده است برای آنان که ایمان آوردند که فروتن گردد دلهاشان برای یاد خدا و آنچه بیامد از حقّ و نباشند مانند آنان که داده شدند کتاب را از پیش پس دراز شد بر ایشان روزگار پس سنگین شد دلهای آنان و بسیاری از ایشانند نافرمانان‌"
          ],
          "fa.mojtabavi": [
            "آيا كسانى را كه ايمان آورده‌اند هنگام آن نرسيده است كه دلهاى ايشان از ياد خدا و آنچه از سخن راست- وحى الهى- فروآمده نرم و ترسان شود؟ و مانند كسانى نباشند كه پيش از اين به آنها كتاب- تورات- داده شد، پس زمان بر آنان دراز گشت- مدتى گذشت- آنگاه دلهاشان سخت [و تاريك‌] شد، و بسياريشان نافرمان شدند."
          ],
          "fa.sadeqi": [
            "آیا برای کسانی که ایمان آورده‌اند هنگام آن نرسیده که دل‌هایشان به یاد خدا و آنچه از حق نازل شده خاشع گردد و مانند کسانی نباشند که از پیش به آنها کتاب داده شد و زمان بر آنان به درازا کشید، پس دل‌هایشان سخت گردید. در حالی که بسیاری از آنان فاسقانند."
          ]
        }
      },
      {
        "index": 5092,
        "local_index": 17,
        "part_type": "Verse",
        "path": "/books/quran:57:17",
        "text": [
          "اعْلَمُوا أَنَ‌ اللَّهَ‌ يُحْيِي‌ الْأَرْضَ‌ بَعْدَ مَوْتِهَا قَدْ بَيَّنَّا لَکُمُ‌ الْآيَاتِ‌ لَعَلَّکُمْ‌ تَعْقِلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Know that God enlivens the earth even after it has died. We have explained to you clearly Our signs that you may understand."
          ],
          "en.ahmedraza": [
            "Know that it is Allah Who revives the earth after its death; We have indeed illustrated the signs for you, for you to understand."
          ],
          "en.arberry": [
            "Know that God revives the earth after it was dead. We have indeed made clear for you the signs, that haply you will understand."
          ],
          "en.daryabadi": [
            "Know that Allah quickeneth earth after the death thereof. Surely We have propounded unto you the signs, that haply ye may reflect."
          ],
          "en.hilali": [
            "Know that Allah gives life to the earth after its death! Indeed We have made clear the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) to you, if you but understand."
          ],
          "en.itani": [
            "Know that God revives the earth after its death. We thus explain the revelations for you, so that you may understand."
          ],
          "en.maududi": [
            "Know well that Allah revives the earth after it becomes lifeless. We have clearly shown Our Signs to you, perchance you will use your reason."
          ],
          "en.mubarakpuri": [
            "Know that Allah gives life to the earth after its death! Indeed We have made clear the Ayat to you, if you but understand."
          ],
          "en.pickthall": [
            "Know that Allah quickeneth the earth after its death. We have made clear Our revelations for you, that haply ye may understand."
          ],
          "en.qarai": [
            "Know that Allah revives the earth after its death. We have certainly made the signs clear for you, so that you may exercise your reason."
          ],
          "en.qaribullah": [
            "Know that Allah revives the earth after it was dead. We have made plain to you the signs in order that you understand."
          ],
          "en.sahih": [
            "Know that Allah gives life to the earth after its lifelessness. We have made clear to you the signs; perhaps you will understand."
          ],
          "en.sarwar": [
            "Know that God brings the dead earth back to life. We have explained Our revelations to you so that you may perhaps have understanding."
          ],
          "en.shakir": [
            "Know that Allah gives life to the earth after its death; indeed, We have made the communications clear to you that you may understand."
          ],
          "en.transliteration": [
            "IAAlamoo anna All<u>a</u>ha yu<u>h</u>yee alar<u>d</u>a baAAda mawtih<u>a</u> qad bayyann<u>a</u> lakumu al<u>a</u>y<u>a</u>ti laAAallakum taAAqiloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Remember that God brings the earth back to life after its death. We have made Our signs clear to you, so that you may fully understand."
          ],
          "en.yusufali": [
            "Know ye (all) that Allah giveth life to the earth after its death! already have We shown the Signs plainly to you, that ye may learn wisdom."
          ],
          "fa.ansarian": [
            "بدانید که خدا زمین را پس از مردگی اش زنده می کند. همانا ما نشانه ها [ی ربوبیت و قدرت خود] را برای شما بیان کردیم تا بیندیشید."
          ],
          "fa.ayati": [
            "بدانيد كه خدا زمين را پس از مردنش زنده مى‌كند. ما آيات را برايتان به روشنى بيان كرديم، باشد كه به عقل دريابيد."
          ],
          "fa.bahrampour": [
            "بدانيد كه خدا زمين را پس از مرگش زنده مى‌گرداند. به تحقيق ما آيات [خود] را براى شما آشكار گردانديم، باشد كه بينديشيد"
          ],
          "fa.fooladvand": [
            "بدانيد كه خدا زمين را پس از مرگش زنده مى‌گرداند. به راستى آيات [خود] را براى شما روشن گردانيده‌ايم، باشد كه بينديشيد."
          ],
          "fa.ghomshei": [
            "بدانید که خداست که زمین را پس از مرگ (خزان) زنده می‌گرداند. ما آیات و ادلّه (قدرت خود) را برای شما بیان کردیم تا مگر فکر و عقل به کار بندید."
          ],
          "fa.khorramdel": [
            "بدانید که خداوند زمین مرده را زنده می‌کند. ما آیه‌ها را برای شما (با ذکر مثالها) روشن می‌گردانیم و بیان می‌داریم، تا این که شما (مطالب و مقاصد آنها را) فهم کنید. [[«یُحْیِ الأرْضَ ...»: (نگا: روم / 19 و 24 و 50).]]"
          ],
          "fa.khorramshahi": [
            "بدانید که خداوند زمین را پس از پژمردنش زنده می‌دارد، به راستی که آیات [خود] را برای شما به روشنی بیان کردیم، باشد که تعقل کنید"
          ],
          "fa.makarem": [
            "بدانید خداوند زمین را بعد از مرگ آن زنده می‌کند! ما آیات (خود) را برای شما بیان کردیم، شاید اندیشه کنید!"
          ],
          "fa.moezzi": [
            "بدانید که خدا زنده سازد زمین را پس از مرگش همانا بیان کردیم برای شما آیتها را شاید بخرد آئید"
          ],
          "fa.mojtabavi": [
            "بدانيد كه خدا زمين را پس از مردگى‌اش زنده مى‌كند- همچنان دلهاى مرده و سخت را زنده و نرم مى‌گرداند-. ما نشانه‌ها [ى قدرت خود] را براى شما روشن كرديم شايد خرد را كار بنديد."
          ],
          "fa.sadeqi": [
            "بدانید که خدا همانا زمین را پس از مرگش زنده می‌گرداند. به‌راستی آیات (خود) را برای شما روشن گردانیدیم، شاید شما خردورزی کنید."
          ]
        }
      },
      {
        "index": 5093,
        "local_index": 18,
        "part_type": "Verse",
        "path": "/books/quran:57:18",
        "text": [
          "إِنَ‌ الْمُصَّدِّقِينَ‌ وَ الْمُصَّدِّقَاتِ‌ وَ أَقْرَضُوا اللَّهَ‌ قَرْضاً حَسَناً يُضَاعَفُ‌ لَهُمْ‌ وَ لَهُمْ‌ أَجْرٌ کَرِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Surely the men and women who spend in charity and give a goodly loan to God, will have it doubled for them and will receive a generous reward."
          ],
          "en.ahmedraza": [
            "Indeed the charity-giving men and women, and those who lend an excellent loan to Allah – for them is double, and for them is an honourable reward."
          ],
          "en.arberry": [
            "Surely those, the men and the women, who make freewill offerings and have lent to God a good loan, it shall be multiplied for them, and theirs shall be a generous wage."
          ],
          "en.daryabadi": [
            "Verily the alms-giving men and alms-giving women--and they are lending unto Allah a goodly lone--it shall be multiplied for them and theirs shall be a hire honourable."
          ],
          "en.hilali": [
            "Verily, those who give Sadaqat (i.e. Zakat and alms, etc.), men and women, and lend to Allah a goodly loan, it shall be increased manifold (to their credit), and theirs shall be an honourable good reward (i.e. Paradise)."
          ],
          "en.itani": [
            "The charitable men and charitable women, who have loaned God a loan of righteousness—it will be multiplied for them, and for them is a generous reward."
          ],
          "en.maududi": [
            "Verily those who give alms -- be they men or women, -- and give Allah a beautiful loan shall be repaid after increasing it many times; and theirs shall be a generous reward."
          ],
          "en.mubarakpuri": [
            "Verily, those who give Sadaqat, men and women, and lend Allah handsome loan, it shall be increased manifold (to their credit), and theirs shall be an honorable good reward."
          ],
          "en.pickthall": [
            "Lo! those who give alms, both men and women, and lend unto Allah a goodly loan, it will be doubled for them, and theirs will be a rich reward."
          ],
          "en.qarai": [
            "Indeed the charitable men and women and those who lend Allah a good loan—it shall be multiplied for them, and there will be a noble reward for them."
          ],
          "en.qaribullah": [
            "Indeed, those who give in charity, be they men or women, and those who lend a good loan to Allah, shall be repaid in multiples. They shall receive agenerous wage."
          ],
          "en.sahih": [
            "Indeed, the men who practice charity and the women who practice charity and [they who] have loaned Allah a goodly loan - it will be multiplied for them, and they will have a noble reward."
          ],
          "en.sarwar": [
            "The charitable men and women who give a virtuous loan to God will receive double from Him in addition to their honorable reward."
          ],
          "en.shakir": [
            "Surely (as for) the charitable men and the charitable women and (those who) set apart for Allah a goodly portion, it shall be doubled for them and they shall have a noble reward."
          ],
          "en.transliteration": [
            "Inna almu<u>ss</u>addiqeena wa<b>a</b>lmu<u>ss</u>addiq<u>a</u>ti waaqra<u>d</u>oo All<u>a</u>ha qar<u>d</u>an <u>h</u>asanan yu<u>da</u>AAafu lahum walahum ajrun kareem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Alms-givers, both men and women, who give a generous loan to God, shall have it multiplied and shall have an honourable reward."
          ],
          "en.yusufali": [
            "For those who give in Charity, men and women, and loan to Allah a Beautiful Loan, it shall be increased manifold (to their credit), and they shall have (besides) a liberal reward."
          ],
          "fa.ansarian": [
            "بی تردید مردان و زنان انفاق کننده و آنان که به خدا وام نیکو داده اند، [وامشان در پیشگاه خدا] برای آنان دو چندان شود، و برای آنان پاداش باارزشی است."
          ],
          "fa.ayati": [
            "خدا به مردان صدقه‌دهنده و زنان صدقه‌دهنده‌اى كه به خدا قرض‌الحسنه مى‌دهند، دو چندان پاداش مى‌دهد؛ و نيز آنها را اجرى نيكوست."
          ],
          "fa.bahrampour": [
            "همانا مردان و زنان صدقه دهنده و [آنان كه‌] به خدا وام نيكو دادند، دو چندان داده مى‌شوند و برايشان [در آخرت‌] اجرى كريمانه است"
          ],
          "fa.fooladvand": [
            "در حقيقت، مردان و زنان صدقه‌دهنده و [آنان كه‌] به خدا وامى نيكو داده‌اند، ايشان را [پاداش‌] دو چندان گردد، و اجرى نيكو خواهند داشت."
          ],
          "fa.ghomshei": [
            "همانا مردان و زنانی که در راه خدا (به فقیران) صدقه و احسان کنند و به خدا قرض نیکو دهند (یعنی به محتاجان قرض الحسنه دهند) احسان آنها را چندین برابر سازند و پاداش با لطف و کرامت نیز خواهند داشت."
          ],
          "fa.khorramdel": [
            "مردان بخشنده و زنان بخشنده‌ای که (با دادن صدقات و انجام خیرات و حسنات) به خدا قرض نیکوئی می‌دهند (پاداش بخشش و وامشان) برای ایشان چندین برابر می‌شود، و مزد بزرگ و قابل توجّهی دارند. [[«الْمُصَّدِّقِینَ»: متصدّقین. صدقه‌دهندگان. انفاق‌کنندگان. (نگا: یوسف / 88، احزاب / 35). «یُضَاعَفُ لَهُمْ»: ثواب تصدق و قرض ایشان چندین برابر گردانده می‌شود (نگا: بقره / 261 و 245، نساء / 40). استعمال ضمیر (هم) در اینجا و ضمیر (و) در (أَحْسَنُوا) از راه تغلیب است و به مردان و زنان تعلق دارد.]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان مردان صدقه‌بخش و زنان صدقه‌بخش و کسانی که در راه خدا قرض‌الحسنه داده‌اند، برای آنان دوچندان شود، و برای آنان پاداشی ارجمند است‌"
          ],
          "fa.makarem": [
            "مردان و زنان انفاق‌کننده، و آنها که (از این راه) به خدا «قرض الحسنه» دهند، (این قرض الحسنه) برای آنان مضاعف می‌شود و پاداش پرارزشی دارند!"
          ],
          "fa.moezzi": [
            "همانا مردان تصدّق‌کننده و آنان تصدّق‌کننده و وام‌دهندگان به خدا وامی نکو افزوده شود برای ایشان و ایشان را است پاداشی ارجمند"
          ],
          "fa.mojtabavi": [
            "همانا مردان و زنان صدقه‌دهنده و آنان كه خداى را وام دادند وامى نيكو، به آنان دوچندان- افزون- بازداده شود و ايشان مزدى گرانمايه دارند."
          ],
          "fa.sadeqi": [
            "بی‌گمان، مردان و زنان صدقه‌دهنده حال آنکه به خدا وامی نیکو داده‌اند، ایشان را (رحمتی) مضاعف و برایشان پاداشی با کرامت است."
          ]
        }
      },
      {
        "index": 5094,
        "local_index": 19,
        "part_type": "Verse",
        "path": "/books/quran:57:19",
        "text": [
          "وَ الَّذِينَ‌ آمَنُوا بِاللَّهِ‌ وَ رُسُلِهِ‌ أُولٰئِکَ‌ هُمُ‌ الصِّدِّيقُونَ‌ وَ الشُّهَدَاءُ عِنْدَ رَبِّهِمْ‌ لَهُمْ‌ أَجْرُهُمْ‌ وَ نُورُهُمْ‌ وَ الَّذِينَ‌ کَفَرُوا وَ کَذَّبُوا بِآيَاتِنَا أُولٰئِکَ‌ أَصْحَابُ‌ الْجَحِيمِ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Those who believe in God and His apostles are true of word and deed; and by their Lord are considered testifiers of the truth. They have their guerdon and their light. As for those who do not believe and reject Our revelations, are the people of Hell."
          ],
          "en.ahmedraza": [
            "And those who believe in Allah and all His Noble Messengers, are the truly sincere; and are witness upon others, before their Lord; for them is their reward, and their light; and those who disbelieved and denied Our signs, are the people of hell."
          ],
          "en.arberry": [
            "And those who believe in God and His Messengers -- they are the just men and the martyrs in their Lord's sight; they have their wage, and their light. But the unbelievers, who have cried lies to Our signs, they are the inhabitants of Hell."
          ],
          "en.daryabadi": [
            "And those who believe in Allah and His apostles - those! they are the saints and martyrs in the sight of their Lord; theirs will be their full hire and their light. And those who disbelieved and belied Our signs--they shall be the fellows of the Blaze."
          ],
          "en.hilali": [
            "And those who believe in (the Oneness of) Allah and His Messengers, they are the Siddiqun (i.e. those followers of the Prophets who were first and foremost to believe in them), and the martyrs with their Lord, they shall have their reward and their light. But those who disbelieve (in the Oneness of Allah - Islamic Monotheism) and deny Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they shall be the dwellers of the blazing Fire."
          ],
          "en.itani": [
            "Those who believe in God and His messengers—these are the sincere and the witnesses with their Lord; they will have their reward and their light. But as for those who disbelieve and deny Our revelations—these are the inmates of the Blaze."
          ],
          "en.maududi": [
            "In Allah's sight only those who truly believe in Allah and His Messengers are utterly truthful and true bearers of witness (for the sake of Allah). For them is their reward and their light. As for those who gave the lie to Our Signs, they are the people of Hell."
          ],
          "en.mubarakpuri": [
            "And those who believe in Allah and His Messengers. they are the Siddiqun (true believers) and the martyrs with their Lord. They shall have their reward and their light. But those who disbelieve and deny Our Ayat -- they shall be the dwellers of the blazing Fire."
          ],
          "en.pickthall": [
            "And those who believe in Allah and His messengers, they are the loyal, and the martyrs are with their Lord; they have their reward and their light; while as for those who disbelieve and deny Our revelations, they are owners of hell-fire."
          ],
          "en.qarai": [
            "Those who have faith in Allah and His apostles—it is they who are the truthful and witnesses with their Lord; they shall have their reward and their light. But as for those who are faithless and deny Our signs, they shall be the inmates of hell."
          ],
          "en.qaribullah": [
            "Those who believe in Allah and His Messengers are the sincere and the martyrs before their Lord, they shall have their reward and their light. But those that disbelieve and belied Our verses are the inhabitants of Gehenna (Hell)."
          ],
          "en.sahih": [
            "And those who have believed in Allah and His messengers - those are [in the ranks of] the supporters of truth and the martyrs, with their Lord. For them is their reward and their light. But those who have disbelieved and denied Our verses - those are the companions of Hellfire."
          ],
          "en.sarwar": [
            "Those who believe in God and His Messenger are the truthful ones and are witness (to the deeds of others) before their Lord. They will have their reward and their light. Those who disbelieve and reject Our revelations shall be the dwellers of hell."
          ],
          "en.shakir": [
            "And (as for) those who believe in Allah and His apostles, these it is that are the truthful and the faithful ones in the sight of their Lord: they shall have their reward and their light, and (as for) those who disbelieve and reject Our communications, these are the inmates of the hell."
          ],
          "en.transliteration": [
            "Wa<b>a</b>lla<u>th</u>eena <u>a</u>manoo bi<b>A</b>ll<u>a</u>hi warusulihi ol<u>a</u>ika humu a<b>l</b><u>ss</u>iddeeqoona wa<b>al</b>shshuhad<u>a</u>o AAinda rabbihim lahum ajruhum wanooruhum wa<b>a</b>lla<u>th</u>eena kafaroo waka<u>thth</u>aboo bi<u>a</u>y<u>a</u>tin<u>a</u> ol<u>a</u>ika a<u>s</u><u>ha</u>bu alja<u>h</u>eem<b>i</b>"
          ],
          "en.wahiduddin": [
            "Those who believe in God and His messengers are the truthful ones and the witnesses in the sight of their Lord. They shall have their reward and their light. But those who are bent on denying the truth and reject Our signs shall be destined for Hell."
          ],
          "en.yusufali": [
            "And those who believe in Allah and His messengers- they are the Sincere (lovers of Truth), and the witnesses (who testify), in the eyes of their Lord: They shall have their Reward and their Light. But those who reject Allah and deny Our Signs,- they are the Companions of Hell-Fire."
          ],
          "fa.ansarian": [
            "و کسانی که به خدا و پیامبرش ایمان آوردند، آنانند که صدّیقان و گواهان [اعمال] نزد پروردگارشان هستند، [و] برای آنان است پاداش [اعمال] شان و نور [ایمان] شان و کسانی که کفر ورزیدند و آیات ما را انکار کردند، آنان اهل دوزخ اند."
          ],
          "fa.ayati": [
            "كسانى كه به خدا و پيامبرانش ايمان آورده‌اند، راستگويان و راستكارانند. و شهيدان در نزد پروردگارشان هستند. صاحب پاداش و نور خويشند. و آنها كه كافرند و آيات ما را تكذيب مى‌كنند، در جهنمند."
          ],
          "fa.bahrampour": [
            "و كسانى كه به خدا و پيامبران او ايمان آوردند، آنها صديقان و گواهان نزد پروردگارند كه اجر و نورشان براى آنها [محفوظ] است، و كسانى كه كافر شدند و آيات ما را تكذيب كردند، آنها اهل آتشند"
          ],
          "fa.fooladvand": [
            "و كسانى كه به خدا و پيامبران وى ايمان آورده‌اند، آنان همان راستينانند و پيش پروردگارشان گواه خواهند بود [و] ايشان راست اجر و نورشان؛ و كسانى كه كفر ورزيده و آيات ما را تكذيب كرده‌اند آنان همدمان آتشند."
          ],
          "fa.ghomshei": [
            "و آنان که به خدا و رسولانش ایمان آوردند به حقیقت راستگویان عالمند و برایشان نزد خدا اجر شهیدان است، پاداش اعمال و نور ایمانشان را (در بهشت) می‌یابند. و آنان که کافر شده و آیات ما را تکذیب کردند آنها اهل آتش دوزخند."
          ],
          "fa.khorramdel": [
            "کسانی که به خدا و به پیغمبرانش ایمان بیاورند، آنان راستان و گواهان پیشگاه پروردگارشانند و اجر خود را و نور خود را دارند. امّا کسانی که کافر بشوند و آیات ما را تکذیب کنند، آنان دوزخیانند. [[«الصِّدِّیقُونَ وَ الشُّهَدَآءُ»: (نگا: نساء / 69). «عِندَ ربِّهِمْ»: در پیشگاه پروردگارشان. به عقیده پروردگارشان.]]"
          ],
          "fa.khorramshahi": [
            "و کسانی که به خداوند و پیامبرانش ایمان آورده‌اند، اینانند که صدیقند، و شهیدان نزد پروردگارشان هستند، و اجرشان و نورشان را دارند، و کسانی که کفرورزیده‌اند و آیات ما را دروغ انگاشته‌اند اینانند که دوزخی‌اند"
          ],
          "fa.makarem": [
            "کسانی که به خدا و رسولانش ایمان آوردند، آنها صدّیقین و شهدا نزد پروردگارشانند؛ برای آنان است پاداش (اعمال) شان و نور (ایمان) شان؛ و کسانی که کافر شدند و آیات ما را تکذیب کردند، آنها دوزخیانند."
          ],
          "fa.moezzi": [
            "و آنان که ایمان آوردند به خدا و فرستادگانش آنانند راستگویان و گواهان نزد پروردگار خویش ایشان را است مزد ایشان و نورشان و آنان که کفر ورزیدند و تکذیب کردند به آیتهای ما آنانند یاران دوزخ‌"
          ],
          "fa.mojtabavi": [
            "و كسانى كه به خدا و پيامبرانش ايمان آورده‌اند، ايشانند راستى‌پيشگان و شهيدان- يا گواهان بر امتها- نزد پروردگارشان آنان راست پاداش و نورشان. و كسانى كه كافر شدند و آيات ما را دروغ انگاشتند اينان دوزخيانند."
          ],
          "fa.sadeqi": [
            "و کسانی که به خدا و پیامبرانش ایمان آوردند، ایشان، (هم)آنان راستان و گواهان نزد پروردگارشانند (و) ایشان راست پاداششان و نورشان‌. و کسانی که کفر ورزیده و به آیاتمان (همان‌ها و ما را) تکذیب کردند آنان همدمان آتشند."
          ]
        }
      },
      {
        "index": 5095,
        "local_index": 20,
        "part_type": "Verse",
        "path": "/books/quran:57:20",
        "text": [
          "اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ‌ وَ لَهْوٌ وَ زِينَةٌ وَ تَفَاخُرٌ بَيْنَکُمْ‌ وَ تَکَاثُرٌ فِي‌ الْأَمْوَالِ‌ وَ الْأَوْلاَدِ کَمَثَلِ‌ غَيْثٍ‌ أَعْجَبَ‌ الْکُفَّارَ نَبَاتُهُ‌ ثُمَ‌ يَهِيجُ‌ فَتَرَاهُ‌ مُصْفَرّاً ثُمَ‌ يَکُونُ‌ حُطَاماً وَ فِي‌ الْآخِرَةِ عَذَابٌ‌ شَدِيدٌ وَ مَغْفِرَةٌ مِنَ‌ اللَّهِ‌ وَ رِضْوَانٌ‌ وَ مَا الْحَيَاةُ الدُّنْيَا إِلاَّ مَتَاعُ‌ الْغُرُورِ"
        ],
        "translations": {
          "en.ahmedali": [
            "Know that the life of this world is only a frolic and mummery, an ornamentation, boasting and bragging among yourselves, and lust for multiplying wealth and children. It is like rain so pleasing to the cultivator for his vegetation which sprouts and swells, and then begins to wither, and you see it turn to yellow and reduced to chaff. There is severe punishment in the Hereafter, but also forgiveness from God, and acceptance. As for the life of this world, it is no more than merchandise of vanity."
          ],
          "en.ahmedraza": [
            "Know that the life of this world is nothing but play and pastime, and adornment, and boasting amongst yourselves, and the desire to surpass each other in wealth and children; like the rain the produce of which pleased the farmer, then dried so you see it yellow, and then turned into dry trampled hay; and in the Hereafter is a severe punishment, and the forgiveness from Allah and His pleasure; and the life of this world is nothing but counterfeit wealth."
          ],
          "en.arberry": [
            "Know that the present life is but a sport and a diversion, an adornment and a cause for boasting among you, and a rivalry in wealth and children. It is as a rain whose vegetation pleases the unbelievers; then it withers, and thou seest it turning yellow, then it becomes broken orts. And in the world to come there is a terrible chastisement, and forgiveness from God and good pleasure; and the present life is but the joy of delusion."
          ],
          "en.daryabadi": [
            "Know that the life of the world is but a play and a pastime, and an adornment and a self-glorification among you and vying in respect of riches and children; as the likeness of vegetation after rains whereof the growth pleaseth the husbandmen, then it withereth and thou seest it becoming yellow, then it becometh chaff. And in the Hereafter there is both a grievous torment and forgiveness from Allah and His pleasure, and the life of the world is but a vain bauble."
          ],
          "en.hilali": [
            "Know that the life of this world is only play and amusement, pomp and mutual boasting among you, and rivalry in respect of wealth and children, as the likeness of vegetation after rain, thereof the growth is pleasing to the tiller; afterwards it dries up and you see it turning yellow; then it becomes straw. But in the Hereafter (there is) a severe torment (for the disbelievers, evil-doers), and (there is) Forgiveness from Allah and (His) Good Pleasure (for the believers, good-doers), whereas the life of this world is only a deceiving enjoyment."
          ],
          "en.itani": [
            "Know that the worldly life is only play, and distraction, and glitter, and boasting among you, and rivalry in wealth and children. It is like a rainfall that produces plants, and delights the disbelievers. But then it withers, and you see it yellowing, and then it becomes debris. While in the Hereafter there is severe agony, and forgiveness from God, and acceptance. The life of this world is nothing but enjoyment of vanity."
          ],
          "en.maududi": [
            "Know well that the life of this world is merely sport and diversion and adornment and an object of your boasting with one another, and a rivalry in the multiplication of riches and children. Its likeness is that of rain: when it produces vegetation it delights the tillers. But then it withers and you see it turn yellow, and then it crumbles away. In the Hereafter there is (either) grievous chastisement (or) forgiveness from Allah and (His) good pleasure. The life of this world is nothing but delusion."
          ],
          "en.mubarakpuri": [
            "Know that the life of this world is only play and amusement, pomp and mutual boasting among you, and rivalry in respect of wealth and children. (It is) like a rain (Ghayth), thereof the growth is pleasing to the tiller; afterwards it dries up and you see it turning yellow; then it becomes straw. But in the Hereafter (there is) a severe torment, and (there is) forgiveness from Allah and (His) pleasure. And the life of this world is only a deceiving enjoyment."
          ],
          "en.pickthall": [
            "Know that the life of the world is only play, and idle talk, and pageantry, and boasting among you, and rivalry in respect of wealth and children; as the likeness of vegetation after rain, whereof the growth is pleasing to the husbandman, but afterward it drieth up and thou seest it turning yellow, then it becometh straw. And in the Hereafter there is grievous punishment, and (also) forgiveness from Allah and His good pleasure, whereas the life of the world is but matter of illusion."
          ],
          "en.qarai": [
            "Know that the life of this world is mere diversion and play, glamour and mutual vainglory among you and rivalry for wealth and children—like rain, whose growth impresses the farmer. Then it withers and you see it turn yellow, then it becomes chaff. Whereas in the Hereafter there is forgiveness from Allah and His approval and a severe punishment. The life of this world is nothing but the wares of delusion."
          ],
          "en.qaribullah": [
            "Know that the life of this world is but play and an amusement, and adornment, and a cause for boasting among you, a rivalry for greater riches and children. It is like rain whose vegetation pleases the unbelievers, but then it withers and turns yellow, becoming broken stubble. In the Everlasting Life is a terrible punishment, forgiveness, and great pleasure from Allah. The life of this world is nothing except the joy of delusion."
          ],
          "en.sahih": [
            "Know that the life of this world is but amusement and diversion and adornment and boasting to one another and competition in increase of wealth and children - like the example of a rain whose [resulting] plant growth pleases the tillers; then it dries and you see it turned yellow; then it becomes [scattered] debris. And in the Hereafter is severe punishment and forgiveness from Allah and approval. And what is the worldly life except the enjoyment of delusion."
          ],
          "en.sarwar": [
            "Know that the worldly life is only a game, a temporary attraction, a means of boastfulness among yourselves and a place for multiplying your wealth and children. It is like the rain which produces plants that are attractive to the unbelievers. These plants flourish, turn yellow, and then become crushed bits of straw. In the life hereafter there will be severe torment or forgiveness and mercy from God. The worldly life is only an illusion."
          ],
          "en.shakir": [
            "Know that this world's life is only sport and play and gaiety and boasting among yourselves, and a vying in the multiplication of wealth and children, like the rain, whose causing the vegetation to grow, pleases the husbandmen, then it withers away so that you will see it become yellow, then it becomes dried up and broken down; and in the hereafter is a severe chastisement and (also) forgiveness from Allah and (His) pleasure; and this world's life is naught but means of deception."
          ],
          "en.transliteration": [
            "IAAlamoo annam<u>a</u> al<u>h</u>ay<u>a</u>tu a<b>l</b>dduny<u>a</u> laAAibun walahwun wazeenatun wataf<u>a</u>khurun baynakum watak<u>a</u>thurun fee alamw<u>a</u>li wa<b>a</b>lawl<u>a</u>di kamathali ghaythin aAAjaba alkuff<u>a</u>ra nab<u>a</u>tuhu thumma yaheeju fatar<u>a</u>hu mu<u>s</u>farran thumma yakoonu <u>h</u>u<u>ta</u>man wafee al<u>a</u>khirati AAa<u>tha</u>bun shadeedun wamaghfiratun mina All<u>a</u>hi wari<u>d</u>w<u>a</u>nun wam<u>a</u> al<u>h</u>ay<u>a</u>tu a<b>l</b>dduny<u>a</u> ill<u>a</u> mat<u>a</u>AAu alghuroor<b>i</b>"
          ],
          "en.wahiduddin": [
            "Never forget that the life of this world is only a game and a passing delight, a show, and mutual boasting and trying to outrival each other in riches and children. It is like the growth of vegetation after the rain, which delights the planter, but which then withers away, turns yellow and becomes worthless stubble. In the life to come there will be a terrible punishment, or God's forgiveness and approval: the life of this world is nothing but means of deception."
          ],
          "en.yusufali": [
            "Know ye (all), that the life of this world is but play and amusement, pomp and mutual boasting and multiplying, (in rivalry) among yourselves, riches and children. Here is a similitude: How rain and the growth which it brings forth, delight (the hearts of) the tillers; soon it withers; thou wilt see it grow yellow; then it becomes dry and crumbles away. But in the Hereafter is a Penalty severe (for the devotees of wrong). And Forgiveness from Allah and (His) Good Pleasure (for the devotees of Allah). And what is the life of this world, but goods and chattels of deception?"
          ],
          "fa.ansarian": [
            "بدانید که زندگی دنیا [یی که دارنده اش از ایمان و عمل تهی است،] فقط بازی و سرگرمی و آرایش و فخرفروشیتان به یکدیگر، و افزون خواهی در اموال و اولاد است، [چنین دنیایی] مانند بارانی است که محصول [سبز و خوش منظره اش] کشاورزان را به شگفتی آورد، سپس پژمرده شود و آن را زرد بینی، سپس ریز ریز و خاشاک شود!! [که برای دنیاپرستان بی ایمان] در آخرت عذاب سختی است و [برای مؤمنان که دنیای خود را در راه اطاعت حق و خدمت به خلق به کار گرفتند] از سوی خدا آمرزش و خشنودی است، و زندگی دنیا جز کالای فریبنده نیست."
          ],
          "fa.ayati": [
            "بدانيد كه زندگى اينجهانى بازيچه است و بيهودگى و آرايش و فخرفروشى و افزون‌جويى در اموال و اولاد. همانند بارانى به وقت است كه روييدنيهايش كافران را به شگفت افكند. سپس پژمرده مى‌شود و بينى كه زرد گشته است و خاشاك شده است. و در آخرت نصيب گروهى عذاب سخت است و نصيب گروهى آمرزش خدا و خشنودى او. و زندگى دنيا جز متاعى فريبنده نيست."
          ],
          "fa.bahrampour": [
            "بدانيد كه زندگى دنيا بازى و سرگرمى و زينت و فخرفروشى شما به يكديگر و فزون خواهى در اموال و فرزندان است. [مثل آنها] مثل بارانى است كه رويش [گياهان‌] آن كشاورزان را به شگفت آورد، سپس خشك و پژمرده شود و ببينى كه زرد گشته و آن‌گاه خاشاك شود، و در آخرت [د"
          ],
          "fa.fooladvand": [
            "بدانيد كه زندگى دنيا، در حقيقت، بازى و سرگرمى و آرايش و فخرفروشى شما به يكديگر و فزون‌جويى در اموال و فرزندان است. [مثَل آنها] چون مثَل بارانى است كه كشاورزان را رستنى آن [باران‌] به شگفتى اندازد، سپس [آن كشت‌] خشك شود و آن را زرد بينى، آنگاه خاشاك شود. و در آخرت [دنيا پرستان را] عذابى سخت است و [مؤمنان را] از جانب خدا آمرزش و خشنودى است، و زندگانى دنيا جز كالاى فريبنده نيست."
          ],
          "fa.ghomshei": [
            "بدانید که زندگانی دنیا به حقیقت بازیچه‌ای است طفلانه و لهو و عیّاشی و زیب و آرایش و تفاخر و خودستایی با یکدیگر و حرص افزودن مال و فرزندان. در مثل مانند بارانی است که گیاهی در پی آن از زمین بروید که برزگران (یا کفار دنیاپرست) را به شگفت آرد و سپس بنگری که زرد و خشک شود و بپوسد. و در عالم آخرت (دنیا طلبان را) عذاب سخت جهنم و (مؤمنان را) آمرزش و خشنودی حق نصیب است. و باری، بدانید که زندگانی دنیا جز متاع فریب و غرور چیزی نیست."
          ],
          "fa.khorramdel": [
            "بدانید که زندگی دنیا تنها بازی، سرگرمی، آرایش و پیرایش، نازش در میان همدیگر، و مسابقه‌ی در افزایش اموال و اولاد است و بس. دنیا همچو باران است که گیاهان آن، کشاورزان را به شگفت می‌آورد، سپس گیاهان رشد و نمو می‌کنند، و بعد گیاهان را زرد و پژمرده خواهی دید، و آنگاه خرد و پرپر می‌گردند. در آخرت عذاب شدیدی (برای دنیاپرستان) و آمرزش و خوشنودی خدا (برای خداپرستان) است. اصلاً زندگی دنیا چیزی جز کالای فریب نیست. [[«لَعِبٌ وَ لَهْوٌ وَ زِینَةٌ»: (نگا: انعام / 32، عنکبوت / 64، محمد / 36). «تَفَاخُرٌ»: نازش بر یکدیگر. به خود بالیدن و خود را ستودن. «تَکَاثُرٌ»: مسابقه در افزایش مال و جاه، و نازش به دارائی و عزت و قدرت. «غَیْثٍ»: باران. «الْکُفَّارَ»: جمع کافِر، کشاورزان (نگا: فتح / 29). «ثُمَّ یَهِیجُ فَتَرَاهُ مُصْفَرّاً ثُمَّ یَکُونُ حُطَاماً»: (نگا: زمر / 21). «مَتَاعُ الْغُرُورِ»: (نگا: آل‌عمران. 185).]]"
          ],
          "fa.khorramshahi": [
            "بدانید که همانا زندگانی دنیا بازیچه و سرگرمی، و زیور و فخرفروشی در میان شما و افزون طلبی در اموال و اولاد است، همانند بارانی که کشاورزان را گیاه آن خوش آید، سپس پژمرده شود و آن را زرد شده بینی، سپس خرد و ریز شود، و در آخرت هم عذابی شدید هست و هم آمرزش و خشنودی از جانب خداوند، و زندگانی دنیا جز مایه فریب نیست‌"
          ],
          "fa.makarem": [
            "بدانید زندگی دنیا تنها بازی و سرگرمی و تجمّل پرستی و فخرفروشی در میان شما و افزون طلبی در اموال و فرزندان است، همانند بارانی که محصولش کشاورزان را در شگفتی فرو می‌برد، سپس خشک می‌شود بگونه‌ای که آن را زردرنگ می‌بینی؛ سپس تبدیل به کاه می‌شود! و در آخرت، عذاب شدید است یا مغفرت و رضای الهی؛ و (به هر حال) زندگی دنیا چیزی جز متاع فریب نیست!"
          ],
          "fa.moezzi": [
            "بدانید که زندگانی دنیا بازی و هوسرانی و خودآرائی و فخر کردن است بر همدیگر و بیشی جستن است در خواسته‌ها و فرزندان مانند بارانی که شگفت آورد کافران را رستنی آن پس خشک شود تا بینیش زردفام سپس کوبیده شود و در آخرت عذابی است سخت و آمرزشی از خدا و خوشنودیی و نیست زندگانی دنیا جز مایه فریب‌"
          ],
          "fa.mojtabavi": [
            "بدانيد كه زندگانى دنيا بازى و بيهودگى و آرايش و فخركردن با يكديگر و نازيدن- يا افزون‌جويى- در مالها و فرزندان است- همچون بارانى كه گياه رويانيدنش كشاورزان را خوش آيد و به شگفت آرد، سپس پژمرده شود و آن را زرد بينى و آنگاه خشك و شكسته و خرد گردد- و در آن جهان عذابى سخت و نيز آمرزشى از سوى خدا و خشنودى اوست. و زندگانى اين جهان جز كالاى فريبندگى نيست."
          ],
          "fa.sadeqi": [
            "بدانید که زندگی دنیا، تنها بازی و سرگرمی بازدارنده‌ی از حق و آرایش و فخرفروشی شما به یکدیگر، و فزون‌خواهی در اموال و فرزندان است. (مَثَل آنها) همچون بارانی است که کافر را رُستنی آن (باران) به شگفتی اندازد. سپس (آن کِشت،) به هیجان آید، پس تا آن را زرد بینی؛ سپس خاشاک شود. و در آخرت (دنیاپرستان را) عذابی سخت است و (مؤمنان را) از (جانب) خدا پوششی و خشنودی بزرگی است‌. و زندگانی دنیا جز کالایی فریبنده نیست."
          ]
        }
      },
      {
        "index": 5096,
        "local_index": 21,
        "part_type": "Verse",
        "path": "/books/quran:57:21",
        "text": [
          "سَابِقُوا إِلَى‌ مَغْفِرَةٍ مِنْ‌ رَبِّکُمْ‌ وَ جَنَّةٍ عَرْضُهَا کَعَرْضِ‌ السَّمَاءِ وَ الْأَرْضِ‌ أُعِدَّتْ‌ لِلَّذِينَ‌ آمَنُوا بِاللَّهِ‌ وَ رُسُلِهِ‌ ذٰلِکَ‌ فَضْلُ‌ اللَّهِ‌ يُؤْتِيهِ‌ مَنْ‌ يَشَاءُ وَ اللَّهُ‌ ذُو الْفَضْلِ‌ الْعَظِيمِ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Hasten for the forgiveness of your Lord and Paradise whose expanse is as wide as that of the heavens and the earth, which has been prepared for those who believe in God and His apostles. This is the bounty of God which He bestows on whosoever He please; and the bounty of God is infinite."
          ],
          "en.ahmedraza": [
            "Rush towards the forgiveness of your Lord and a Paradise wide as the expanse of the heavens and the earth – made for those who believe in Allah and all His Noble Messengers; this is Allah’s munificence, He may bestow it to whomever He wills; and Allah is Extremely Munificent."
          ],
          "en.arberry": [
            "Race to forgiveness from your Lord, and a Garden the breadth whereof is as the breadth of heaven and earth, made ready for those who believe in God and His Messengers. That is the bounty of God; He gives it unto whomsoever He will; and God is of bounty abounding."
          ],
          "en.daryabadi": [
            "Strive with one another in hastening toward forgiveness from your Lord and toward a Garden whereof the width is as the width of the heavens and the earth, gotten ready for those who beiieve in Allah and His apostles. This is the grace of Allah; He vouchsafeth It Unto whomsoever He will; and Allah is Owner of mighty grace."
          ],
          "en.hilali": [
            "Race one with another in hastening towards Forgiveness from your Lord (Allah), and towards Paradise, the width whereof is as the width of heaven and earth, prepared for those who believe in Allah and His Messengers. That is the Grace of Allah which He bestows on whom He pleases. And Allah is the Owner of Great Bounty."
          ],
          "en.itani": [
            "Race towards forgiveness from your Lord; and a Garden as vast as the heavens and the earth, prepared for those who believe in God and His messengers. That is the grace of God; He bestows it on whomever He wills. God is the Possessor of Immense Grace."
          ],
          "en.maududi": [
            "So vie with one another in seeking to attain your Lord's forgiveness and a Garden whose width is as the width of the heaven and the earth, one which has been prepared for those who believe in Allah and His Messengers. That is Allah's bounty which He bestows upon those whom He pleases. Allah is the Lord of abounding bounty."
          ],
          "en.mubarakpuri": [
            "Race with one another in hastening towards forgiveness from your Lord, and Paradise the width whereof is as the width of the heaven and the earth, prepared for those who believe in Allah and His Messengers. That is the grace of Allah which He bestows on whom He is pleased with. And Allah is the Owner of great bounty."
          ],
          "en.pickthall": [
            "Race one with another for forgiveness from your Lord and a Garden whereof the breadth is as the breadth of the heavens and the earth, which is in store for those who believe in Allah and His messengers. Such is the bounty of Allah, which He bestoweth upon whom He will, and Allah is of Infinite Bounty."
          ],
          "en.qarai": [
            "Take the lead towards forgiveness from your Lord and a paradise as vast as the heavens and the earth, prepared for those who have faith in Allah and His apostles. That is Allah’s grace, which He grants to whomever He wishes, and Allah is dispenser of a great grace."
          ],
          "en.qaribullah": [
            "Therefore, race for forgiveness from your Lord, and for a Garden as wide as heaven and earth, prepared for those who believe in Allah and His Messengers. Such is the Favor of Allah; He gives it to whom He will. Allah is the Owner of great favor."
          ],
          "en.sahih": [
            "Race toward forgiveness from your Lord and a Garden whose width is like the width of the heavens and earth, prepared for those who believed in Allah and His messengers. That is the bounty of Allah which He gives to whom He wills, and Allah is the possessor of great bounty."
          ],
          "en.sarwar": [
            "Compete with one another to achieve forgiveness from your Lord and to reach Paradise, which is as vast as the heavens and the earth, and is prepared for those who believe in God and His Messenger. This is the blessing of God and He grants it to whomever He wants. The blessings of God are great."
          ],
          "en.shakir": [
            "Hasten to forgiveness from your Lord and to a garden the extensiveness of which is as the extensiveness of the heaven and the earth; it is prepared for those who believe in Allah and His apostles; that is the grace of Allah: He gives it to whom He pleases, and Allah is the Lord of mighty grace."
          ],
          "en.transliteration": [
            "S<u>a</u>biqoo il<u>a</u> maghfiratin min rabbikum wajannatin AAar<u>d</u>uh<u>a</u> kaAAar<u>d</u>i a<b>l</b>ssam<u>a</u>i wa<b>a</b>lar<u>d</u>i oAAiddat lilla<u>th</u>eena <u>a</u>manoo bi<b>A</b>ll<u>a</u>hi warusulihi <u>tha</u>lika fa<u>d</u>lu All<u>a</u>hi yuteehi man yash<u>a</u>o wa<b>A</b>ll<u>a</u>hu <u>th</u>oo alfa<u>d</u>li alAAa<i><u>th</u></i>eem<b>i</b>"
          ],
          "en.wahiduddin": [
            "Vie with one another for your Lord's forgiveness and for a Paradise as vast as heaven and earth, which has been made ready for those who believe in God and His messengers. Such is God's grace. He bestows it upon whoever He pleases. There is no limit to God's bounty."
          ],
          "en.yusufali": [
            "Be ye foremost (in seeking) Forgiveness from your Lord, and a Garden (of Bliss), the width whereof is as the width of heaven and earth, prepared for those who believe in Allah and His messengers: that is the Grace of Allah, which He bestows on whom he pleases: and Allah is the Lord of Grace abounding."
          ],
          "fa.ansarian": [
            "سبقت جویید به آمرزشی از سوی پروردگارتان و بهشتی که پهنایش چون پهنای آسمان و زمین است، برای کسانی که به خدا و پیامبرانش ایمان آورده اند، آماده شده است؛ این فضل خداست که آن را به هرکس بخواهد عطا می کند و خدا دارای فضل بزرگ است."
          ],
          "fa.ayati": [
            "براى رسيدن به آمرزش پروردگارتان و بهشتى كه پهناى آن همسان پهناى آسمانها و زمين است، بر يكديگر پيشى گيريد. اين بهشت براى كسانى كه به خدا و پيامبرانش ايمان آورده‌اند، مهيا شده است. اين بخشايشى است از جانب خدا كه به هر كه مى‌خواهد ارزانيش مى‌دارد، كه خدا صاحب بخشايشى بزرگ است."
          ],
          "fa.bahrampour": [
            "به سوى آمرزشى از پروردگارتان و بهشتى كه پهناى آن چون پهناى آسمان و زمين است بر يكديگر پيشى گيريد. [اين بهشت‌] براى كسانى آماده شده كه به خدا و پيامبرانش ايمان آورده‌اند. اين فضل خداست كه به هر كس كه خواهد مى‌دهد و خداوند صاحب فضل بزرگ است"
          ],
          "fa.fooladvand": [
            "[براى رسيدن‌] به آمرزشى از پروردگارتان و بهشتى كه پهنايش چون پهناى آسمان و زمين است [و] براى كسانى آماده شده كه به خدا و پيامبرانش ايمان آورده‌اند، بر يكديگر سبقت جوييد. اين فضل خداست كه به هر كس بخواهد آن را مى‌دهد، و خداوند را فزون‌بخشى بزرگ است."
          ],
          "fa.ghomshei": [
            "به سوی آمرزش پروردگارتان بشتابید و به راه بهشتی که عرضش به قدر پهنای آسمان و زمین است و برای اهل ایمان به خدا و پیمبرانش مهیّا گردیده. این فضل خداست که به هر کس خواهد عطا می‌کند و خدا دارای فضل و کرم بسیار عظیم است."
          ],
          "fa.khorramdel": [
            "بر یکدیگر پیشی بگیرید برای رسیدن به آمرزش پروردگارتان و بهشتی که پهنای آن همسان پهنای آسمان و زمین است. برای کسانی آماده شده است که به خدا و پیغمبرانش ایمان داشته باشند. این، عطاء خدا است، و به هر کس که بخواهد آن را می‌دهد، و خدا دارای عطاء بزرگ و فراوان است. [[«سَابِقُوا»: با همدیگر مسابقه دهید. بر یکدیگر پیشی گیرید. «عَرْضُهَا ...»: (نگا: آل‌عمران / 133).]]"
          ],
          "fa.khorramshahi": [
            "به سوی آمرزشی از پروردگارتان، و بهشتی که پهنای آن همچند پهنای آسمان و زمین است و برای مؤمنان به خداوند و پیامبران او آماده شده است، بشتابید، این بخشش الهی است که به هر کس خواهد ارزانی‌اش دارد، و خداوند دارای بخشش و بخشایش بیکران است‌"
          ],
          "fa.makarem": [
            "به پیش تازید برای رسیدن به مغفرت پروردگارتان و بهشتی که پهنه آن مانند پهنه آسمان و زمین است و برای کسانی که به خدا و رسولانش ایمان آورده‌اند؛ آماده شده است، این فضل خداوند است که به هر کس بخواهد می‌دهد؛ و خداوند صاحب فضل عظیم است!"
          ],
          "fa.moezzi": [
            "پیشی جوئید بر همدیگر بسوی آمرزشی از پروردگار خویش و بهشتی که پهنایش چون پهنای آسمان و زمین است آماده شد برای آنان که ایمان آوردند به خدا و فرستادگانش این است فضل خدا دهدش به هر که خواهد و خدا است دارای فضلی بزرگی‌"
          ],
          "fa.mojtabavi": [
            "به سوى آمرزشى از پروردگارتان و بهشتى كه پهناى آن- يعنى وسعت و فراخى آن- همچون پهناى آسمان و زمين است [و] براى كسانى كه به خداى و پيامبرانش ايمان آورده‌اند آماده شده، [بر يكديگر] پيشى گيريد. اين فزون‌بخشى خداست كه آن را به هر كه خواهد مى‌دهد، و خدا داراى فزون‌بخشى بزرگ است."
          ],
          "fa.sadeqi": [
            "(برای رسیدن) فراسوی پوششی از پروردگارتان و بهشتی که پهنایش چون پهنای آسمان و زمین است (و) برای کسانی آماده شده که به خدا و پیامبرانش ایمان آوردند؛ بر یکدیگر سبقت جویید. این فضل خداست که به هر کس بخواهد آن را می‌دهد. و خدا کانون فزونی‌بخش بزرگی است."
          ]
        }
      },
      {
        "index": 5097,
        "local_index": 22,
        "part_type": "Verse",
        "path": "/books/quran:57:22",
        "text": [
          "مَا أَصَابَ‌ مِنْ‌ مُصِيبَةٍ فِي‌ الْأَرْضِ‌ وَ لاَ فِي‌ أَنْفُسِکُمْ‌ إِلاَّ فِي‌ کِتَابٍ‌ مِنْ‌ قَبْلِ‌ أَنْ‌ نَبْرَأَهَا إِنَ‌ ذٰلِکَ‌ عَلَى‌ اللَّهِ‌ يَسِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "There is no calamity that befalls the earth or your own selves but in accordance with the law (of causation) before We make it evident. This is indeed how the law of God works inevitably."
          ],
          "en.ahmedraza": [
            "There is no misfortune that reaches in the earth or in your selves but is mentioned in a Book, before We initiate it; indeed this is easy for Allah."
          ],
          "en.arberry": [
            "No affliction befalls in the earth or in yourselves, but it is in a Book, before We create it; that is easy for God;"
          ],
          "en.daryabadi": [
            "Naught of distress befalleth the earth or your persons but it is inscribed in the Book even before We have created them. Verily with Allahs that is easy."
          ],
          "en.hilali": [
            "No calamity befalls on the earth or in yourselves but is inscribed in the Book of Decrees (Al-Lauh Al-Mahfuz), before We bring it into existence. Verily, that is easy for Allah."
          ],
          "en.itani": [
            "No calamity occurs on earth, or in your souls, but it is in a Book, even before We make it happen. That is easy for God."
          ],
          "en.maududi": [
            "No misfortune ever befalls on earth, nor on yourselves but We have inscribed it in the Book before We make it manifest. Surely that is easy for Allah."
          ],
          "en.mubarakpuri": [
            "No calamity occurs in the earth nor in yourselves but it is inscribed in the Book of Decrees before We bring it into existence. Verily, that is easy for Allah."
          ],
          "en.pickthall": [
            "Naught of disaster befalleth in the earth or in yourselves but it is in a Book before we bring it into being - Lo! that is easy for Allah -"
          ],
          "en.qarai": [
            "No affliction visits the land or yourselves but it is in a Book before We bring it about—that is indeed easy for Allah—"
          ],
          "en.qaribullah": [
            "No affliction can befall either the earth, or yourself, except that it is (written) in a Book before We created it. That is easy for Allah;"
          ],
          "en.sahih": [
            "No disaster strikes upon the earth or among yourselves except that it is in a register before We bring it into being - indeed that, for Allah, is easy -"
          ],
          "en.sarwar": [
            "Whatever hardships you face on earth and in your souls were written in the Book before the creation of the souls. This is certainly easy for God"
          ],
          "en.shakir": [
            "No evil befalls on the earth nor in your own souls, but it is in a book before We bring it into existence; surely that is easy to Allah:"
          ],
          "en.transliteration": [
            "M<u>a</u> a<u>sa</u>ba min mu<u>s</u>eebatin fee alar<u>d</u>i wal<u>a</u> fee anfusikum ill<u>a</u> fee kit<u>a</u>bin min qabli an nabraah<u>a</u> inna <u>tha</u>lika AAal<u>a</u> All<u>a</u>hi yaseer<b>un</b>"
          ],
          "en.wahiduddin": [
            "No misfortune can affect the earth or your own selves without its first having been recorded in a book, before We bring it into being. That is easy for God to do;"
          ],
          "en.yusufali": [
            "No misfortune can happen on earth or in your souls but is recorded in a decree before We bring it into existence: That is truly easy for Allah:"
          ],
          "fa.ansarian": [
            "هیچ گزند و آسیبی در زمین [چون زلزله، سیل، توفان و قحطی] و در وجود خودتان [چون بیماری، رنج، تعب و از دست رفتن مال و ثروت،] روی نمی دهد مگر پیش از آنکه آن را به وجود آوردیم در کتابی [چون لوح محفوظ] ثبت است، بی تردید این [تقدیر حوادث و فرمان قطعی به پدید آمدنش] بر خدا آسان است."
          ],
          "fa.ayati": [
            "هيچ مصيبتى به مال يا به جانتان نرسد مگر پيش از آنكه بيافرينيمش، در كتابى نوشته شده است. و اين بر خدا آسان است؛"
          ],
          "fa.bahrampour": [
            "هيچ مصيبتى نه در زمين و نه در جانتان روى ندهد مگر پيش از آن كه آن را پديد آوريم در كتابى ثبت است. همانا اين [كار] بر خدا آسان است"
          ],
          "fa.fooladvand": [
            "هيچ مصيبتى نه در زمين و نه در نفسهاى شما [= به شما] نرسد، مگر آنكه پيش از آنكه آن را پديد آوريم، در كتابى است. اين [كار] بر خدا آسان است."
          ],
          "fa.ghomshei": [
            "هر رنج و مصیبتی که در زمین (از قحطی و آفت و فقر و ستم) یا در نفس خویش (چون ترس و غم و درد و الم) به شما رسد همه در کتاب (لوح محفوظ ما) پیش از آنکه همه را (در دنیا) ایجاد کنیم ثبت است و البته این کار بر خدا آسان است."
          ],
          "fa.khorramdel": [
            "هیچ رخدادی در زمین به وقوع نمی‌پیوندد، یا به شما دست نمی‌دهد، مگر این که پیش از آفرینش زمین و خود شما، در کتاب بزرگ و مهمّی (به نام لوح محفوظ، ثبت و ضبط) بوده است، و این کار برای خدا ساده و آسان است. [[«مُصِیبَةٍ»: رخداد در معنی عام خود (نگا: فی ظلال القرآن) اعم از خیر یا شر. «کِتَابٍ»: لوح محفوظ. علم خدا (نگا: انعام / 59، یس / 12). «نَبْرَأَهَا»: آن را بیافرینیم. مراد آفرینش زمین و انسانها و بطور کلی همه کائنات است. «یَسِیرٌ»: ساده. آسان. با قیاس به علم خدا، زمان گذشته و حال و آینده، و مشکل و مشکلتر و مشکلترین، و آسان و آسانتر و آسانترین، معنی ندارد. جهان برابر نقشه و طرح قبلی خدا ساخته شده است و همه چیز در آن دقیق و اندازه‌گیری گشته است، و لذا چیزی ناسنجیده و خودسرانه رخ نمی‌دهد و خارج از نقشه پیاده نمی‌گردد.]]"
          ],
          "fa.khorramshahi": [
            "هیچ مصیبتی در زمین [به جسم و مال‌] و به جانهای شما نرسد مگر آنکه پیش از آنکه آن را آفریده باشیم در کتابی [ثبت‌] است، بی‌گمان این امر بر خداوند آسان است‌"
          ],
          "fa.makarem": [
            "هیچ مصیبتی (ناخواسته) در زمین و نه در وجود شما روی نمی‌دهد مگر اینکه همه آنها قبل از آنکه زمین را بیافرینیم در لوح محفوظ ثبت است؛ و این امر برای خدا آسان است!"
          ],
          "fa.moezzi": [
            "نرسد مصیبتی در زمین و نه در خود شما جز در کتابی است پیش از آنکه آفریمش همانا آن است بر خدا آسان‌"
          ],
          "fa.mojtabavi": [
            "هيچ مصيبتى در زمين- چون تنگدستى و سختى و قحطى- و نه در جانهاتان- چون بيمارى و اندوه- نرسد مگر پيش از آنكه بيافرينمش در نبشته‌اى است اين بر خدا آسان است"
          ],
          "fa.sadeqi": [
            "هیچ مصیبتی نه در زمین و نه در خودهاتان به شما نرسید، مگر اینکه - پیش از آنکه شما را سازمان دهیم- (علمش) در کتابی است (ربانی). این (کار) همواره بر خدا آسان است."
          ]
        }
      },
      {
        "index": 5098,
        "local_index": 23,
        "part_type": "Verse",
        "path": "/books/quran:57:23",
        "text": [
          "لِکَيْلاَ تَأْسَوْا عَلَى‌ مَا فَاتَکُمْ‌ وَ لاَ تَفْرَحُوا بِمَا آتَاکُمْ‌ وَ اللَّهُ‌ لاَ يُحِبُ‌ کُلَ‌ مُخْتَالٍ‌ فَخُورٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "Lest you grieve for what you missed, or rejoice at what you received. God does not love the egoist and the braggart,"
          ],
          "en.ahmedraza": [
            "So that you may not be saddened upon losing something, nor rejoice upon what you are given; and Allah does not like any boastful, conceited person."
          ],
          "en.arberry": [
            "that you may not grieve for what escapes you, nor rejoice in what has come to you; God loves not any man proud and boastful,"
          ],
          "en.daryabadi": [
            "This is announced lest ye sorrow for the sake of that which hath escaped you, or exult over that which He hath vouchsafed Unto you: And Allah loveth not any vainglorious boaster:"
          ],
          "en.hilali": [
            "In order that you may not be sad over matters that you fail to get, nor rejoice because of that which has been given to you. And Allah likes not prideful boasters."
          ],
          "en.itani": [
            "That you may not sorrow over what eludes you, nor exult over what He has given you. God does not love the proud snob."
          ],
          "en.maududi": [
            "(We do so) that you may not grieve over the loss you suffer, nor exult over what He gave you. Allah does not love the vainglorious, the boastful,"
          ],
          "en.mubarakpuri": [
            "In order that you may not grieve at the things over that you fail to get, nor rejoice over that which has been given to you. And Allah likes not prideful boasters."
          ],
          "en.pickthall": [
            "That ye grieve not for the sake of that which hath escaped you, nor yet exult because of that which hath been given. Allah loveth not all prideful boasters,"
          ],
          "en.qarai": [
            "so that you may not grieve for what escapes you, nor boast for what comes your way, and Allah does not like any swaggering braggart."
          ],
          "en.qaribullah": [
            "so that you will not be saddened for whatever does not come to you, nor be overjoyed in what has come to you. Allah does not love those who are proudand boastful"
          ],
          "en.sahih": [
            "In order that you not despair over what has eluded you and not exult [in pride] over what He has given you. And Allah does not like everyone self-deluded and boastful -"
          ],
          "en.sarwar": [
            "so that you would not grieve over what you have lost nor become too happy about what God has granted to you. God does not love the arrogant boastful ones who are niggardly and who try to make other people also niggardly."
          ],
          "en.shakir": [
            "So that you may not grieve for what has escaped you, nor be exultant at what He has given you; and Allah does not love any arrogant boaster:"
          ],
          "en.transliteration": [
            "Likayl<u>a</u> tasaw AAal<u>a</u> m<u>a</u> f<u>a</u>takum wal<u>a</u> tafra<u>h</u>oo bim<u>a</u> <u>a</u>t<u>a</u>kum wa<b>A</b>ll<u>a</u>hu l<u>a</u> yu<u>h</u>ibbu kulla mukht<u>a</u>lin fakhoor<b>in</b>"
          ],
          "en.wahiduddin": [
            "so that you may not grieve for what has escaped you, nor be exultant over what you have gained. God loves neither the conceited nor the boastful,"
          ],
          "en.yusufali": [
            "In order that ye may not despair over matters that pass you by, nor exult over favours bestowed upon you. For Allah loveth not any vainglorious boaster,-"
          ],
          "fa.ansarian": [
            "تا [با یقین به اینکه هر گزند و آسیبی و هر عطا و منعی فقط به اراده خداست و شما را در آن اختیاری نیست] بر آنچه از دست شما رفت، تأسف نخورید، و بر آنچه به شما عطا کرده است، شادمان و دلخوش نشوید، و خدا هیچ گردنکش خودستا را [که به نعمت ها مغرور شده است] دوست ندارد."
          ],
          "fa.ayati": [
            "تا بر آنچه از دستتان مى‌رود اندوهگين نباشيد و بدانچه به دستتان مى‌آيد شادمانى نكنيد. و خدا هيچ متكبر خودستاينده‌اى را دوست ندارد:"
          ],
          "fa.bahrampour": [
            "تا بر آنچه از دست شما رفته است اندوه نخوريد و بدانچه به شما داده [دلبسته و] سرمست نباشيد، و خدا هيچ خودپسند فخرفروشى را دوست نمى‌دارد"
          ],
          "fa.fooladvand": [
            "تا بر آنچه از دست شما رفته اندوهگين نشويد و به [سبب‌] آنچه به شما داده است شادمانى نكنيد، و خدا هيچ خودپسند فخرفروشى را دوست ندارد:"
          ],
          "fa.ghomshei": [
            "(این تقدیر حق را بدانید) تا هرگز بر آنچه از دست شما رود دلتنگ نشوید و به آنچه به شما می‌دهد مغرور و دلشاد نگردید، و خدا دوستدار هیچ متکبر خودستایی نیست."
          ],
          "fa.khorramdel": [
            "این بدان خاطر است که شما نه بر از دست دادن چیزی غم بخورید که از دستتان بدر رفته است، و نه شادمان بشوید بر آنچه خدا به دستتان رسانده است. خداوند هیچ شخص متکبّر فخرفروشی را دوست نمی‌دارد. [[«لِکَیْ لا ...»: شما را بر این مسأله باخبر کردیم که تا. جهان را بدین خاطر چنین آفریدیم که تا. «فَاتَکُمْ»: از دست دادید. از دستتان بدر رفت (نگا: آل‌عمران / 153). «آتَاکُمْ»: به شما داد. به دستتان رساند. «مُخْتَالٍ فَخُورٍ»: (نگا: نساء / 36، لقمان / 18). مراد آیه این است که انسان بطور کلی غمگین یا شادمان نگردد، بلکه آیه انسان را رهنمود می‌فرماید به این که او دلبسته و شیفته و عبد و اسیر زرق و برق جهان نگردد، و خوشیها و ناخوشیهایش را گذرا بداند و آنها را جاودانه نپندارد، و مست ناز و نعمت، و یا زندانی بلا و مصیبت نشود، و بداند که او مسافری به سوی آخرت است و راه از نشیب و فراز برخوردار است.]]"
          ],
          "fa.khorramshahi": [
            "تا آنکه بر آنچه از دست شما رود اندوه مخورید و بر آنچه به شما بخشد شادمانی مکنید، و خداوند هیچ متکبر فخر فروشی را دوست ندارد"
          ],
          "fa.makarem": [
            "این بخاطر آن است که برای آنچه از دست داده‌اید تأسف نخورید، و به آنچه به شما داده است دلبسته و شادمان نباشید؛ و خداوند هیچ متکبّر فخرفروشی را دوست ندارد!"
          ],
          "fa.moezzi": [
            "تا دریغ نخورید (اندوهگین نشوید) بر آنچه از شما رود و نه شاد شوید بدانچه شما را آید و خدا دوست ندارد هر خرامان نازنده را"
          ],
          "fa.mojtabavi": [
            "تا بر آنچه از دست شما رفت اندوه مخوريد و بدانچه شما را داد شادمان نشويد، و خدا هيچ گردنكش خودستا را دوست ندارد،"
          ],
          "fa.sadeqi": [
            "تا بر آنچه از دست شما رفته اندوهگین نشوید، و به آنچه به شما داده است شادمانی نکنید. و خدا هیچ خودپسند فخرکننده‌ای را دوست نمی‌دارد؛"
          ]
        }
      },
      {
        "index": 5099,
        "local_index": 24,
        "part_type": "Verse",
        "path": "/books/quran:57:24",
        "text": [
          "الَّذِينَ‌ يَبْخَلُونَ‌ وَ يَأْمُرُونَ‌ النَّاسَ‌ بِالْبُخْلِ‌ وَ مَنْ‌ يَتَوَلَ‌ فَإِنَ‌ اللَّهَ‌ هُوَ الْغَنِيُ‌ الْحَمِيدُ"
        ],
        "translations": {
          "en.ahmedali": [
            "Who hold back what they possess and enjoin stinginess on others. Whoever turns away (from God, should remember) that God is self-sufficient, worthy of praise."
          ],
          "en.ahmedraza": [
            "Those who practice miserliness, and exhort others to miserliness; and whoever turns away, then (know that) Allah is the Independent, the Most Praiseworthy."
          ],
          "en.arberry": [
            "such as are niggardly, and bid men to be niggardly. And whosoever turns away, God is the All-sufficient, the All-laudable."
          ],
          "en.daryabadi": [
            "Ihey who are niggardly and command mankind to niggardliness. And whosoever turneth away, then verily Allah! He is the Self-sufficient, the praise-worthy."
          ],
          "en.hilali": [
            "Those who are misers and enjoin upon people miserliness (Allah is not in need of their charity). And whosoever turns away (from Faith Allah's Monotheism), then Allah is Rich (Free of all wants), Worthy of all praise."
          ],
          "en.itani": [
            "Those who are stingy, and induce people to be stingy. Whoever turns away—God is the Independent, the Praiseworthy."
          ],
          "en.maududi": [
            "those who are niggardly and bid others to be niggardly. And he who turns away, (should know that) Allah is Self-Sufficient, Immensely Praiseworthy."
          ],
          "en.mubarakpuri": [
            "Those who are misers and enjoin miserliness upon people. And whosoever turns away, then Allah is Rich, Worthy of all praise."
          ],
          "en.pickthall": [
            "Who hoard and who enjoin upon the people avarice. And whosoever turneth away, still Allah is the Absolute, the Owner of Praise."
          ],
          "en.qarai": [
            "Such as are [themselves] stingy and bid [other] people to be stingy. And whoever refuses to comply [should know that] indeed Allah is the All-sufficient, the All-laudable."
          ],
          "en.qaribullah": [
            "nor those who are mean, and encourage others to be mean. And he that turns away, (know) that Allah is Rich and Praised."
          ],
          "en.sahih": [
            "[Those] who are stingy and enjoin upon people stinginess. And whoever turns away - then indeed, Allah is the Free of need, the Praiseworthy."
          ],
          "en.sarwar": [
            "Those who turn away (from guidance) should know that God is Self-sufficient and Praiseworthy."
          ],
          "en.shakir": [
            "Those who are niggardly and enjoin niggardliness on men; and whoever turns back, then surely Allah is He Who is the Selfsufficient, the Praised."
          ],
          "en.transliteration": [
            "Alla<u>th</u>eena yabkhaloona wayamuroona a<b>l</b>nn<u>a</u>sa bi<b>a</b>lbukhli waman yatawalla fainna All<u>a</u>ha huwa alghaniyyu al<u>h</u>ameed<b>u</b>"
          ],
          "en.wahiduddin": [
            "nor those who, being miserly themselves, urge others to be miserly. He who turns his back should remember that God alone is self-sufficient and worthy of all praise."
          ],
          "en.yusufali": [
            "Such persons as are covetous and commend covetousness to men. And if any turn back (from Allah's Way), verily Allah is Free of all Needs, Worthy of all Praise."
          ],
          "fa.ansarian": [
            "همانان که همواره بخل می ورزند و مردم را به بخل وامی دارند، و هرکه [از انفاق] روی بگرداند [زیانی به خدا نمی رساند]؛ زیرا خدا بی نیاز و ستوده است."
          ],
          "fa.ayati": [
            "آنان كه بخل مى‌ورزند و مردم را به بخل وامى‌دارند. و هر كه رويگردان مى‌شود، بداند كه خدا بى‌نياز و ستودنى است."
          ],
          "fa.bahrampour": [
            "همان كسانى كه بخل مى‌ورزند و مردم را به بخل وا مى‌دارند. و هر كه [از فرمان‌] روى گرداند، قطعا خدا بى‌نياز ستوده است"
          ],
          "fa.fooladvand": [
            "همانان كه بخل مى‌ورزند و مردم را به بخل ورزيدن وامى‌دارند. و هر كه روى گرداند قطعاً خدا بى‌نياز ستوده است."
          ],
          "fa.ghomshei": [
            "همان متکبرانی که خودشان (در احسان به فقیران) بخل می‌ورزند و مردم را هم به بخل و منع احسان وا می‌دارند. و هر که روی (از اطاعت حق) بگرداند خدا به کلی بی‌نیاز و ستوده صفات است."
          ],
          "fa.khorramdel": [
            "همان کسانی که بخل می‌ورزند و مردم را نیز به بخل ورزیدن دعوت می‌کنند. هر کس که (از این فرمان) روی‌گردان شود (به خدا زیانی نمی‌رساند) چرا که خداوند بی‌نیاز و شایسته‌ی ستایش است. [[«الَّذِینَ ...»: بدل از (کُلَّ مُخْتَالٍ فَخُورٍ) است. یا خبر مبتدای محذوف است: هُمُ الَّذِینَ. و یا این که مبتدا است و خبر آن محذوف است: الَّذِینَ یَبْخَلُونَ وَ یَأْمُرُونَ النَّاسَ بِالْبُخْلِ، فَإِنَّهُمْ یَسْتَحِقُّونَ الْعَذَابَ. «یَأْمُرُونَ النَّاسَ بِالْبُخْلِ»: (نگا: نساء / 37).]]"
          ],
          "fa.khorramshahi": [
            "همان کسانی که بخل می‌ورزند و مردمان را نیز به بخل می‌فرمایند، و هر کس روی بر تابد، [بداند که‌] خداوند بی نیاز ستوده است‌"
          ],
          "fa.makarem": [
            "همانها که بخل می‌ورزند و مردم را به بخل دعوت می‌کنند؛ و هر کس (از این فرمان) روی‌گردان شود، (به خود زیان می‌رساند نه به خدا)، چرا که خداوند بی‌نیاز و شایسته ستایش است!"
          ],
          "fa.moezzi": [
            "آنان که بخل ورزند و فرمان دهند مردم را به بخل‌ورزیدن و هر که روی برتابد همانا خدا است بی‌نیاز ستوده‌"
          ],
          "fa.mojtabavi": [
            "آنان كه بخل مى‌ورزند و مردم را به بخل فرمان مى‌دهند. و هر كه روى بگرداند- از ايمان و انفاق-، پس [بداند كه‌] خداست بى‌نياز و ستوده."
          ],
          "fa.sadeqi": [
            "کسانی که بخل می‌ورزند و مردمان را به بخل ورزیدن فرمان می‌دهند. و هر که روی گرداند خدا بی‌گمان (هم) او بی‌نیاز ستوده است."
          ]
        }
      },
      {
        "index": 5100,
        "local_index": 25,
        "part_type": "Verse",
        "path": "/books/quran:57:25",
        "text": [
          "لَقَدْ أَرْسَلْنَا رُسُلَنَا بِالْبَيِّنَاتِ‌ وَ أَنْزَلْنَا مَعَهُمُ‌ الْکِتَابَ‌ وَ الْمِيزَانَ‌ لِيَقُومَ‌ النَّاسُ‌ بِالْقِسْطِ وَ أَنْزَلْنَا الْحَدِيدَ فِيهِ‌ بَأْسٌ‌ شَدِيدٌ وَ مَنَافِعُ‌ لِلنَّاسِ‌ وَ لِيَعْلَمَ‌ اللَّهُ‌ مَنْ‌ يَنْصُرُهُ‌ وَ رُسُلَهُ‌ بِالْغَيْبِ‌ إِنَ‌ اللَّهَ‌ قَوِيٌ‌ عَزِيزٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "We have surely sent apostles with clear signs, and sent with them the Book and the Balance, so that men may stand by justice; and We sent down iron which causes much distress but also has advantages for men, so that God may know who helps Him and His apostles in secret. Verily God is all-powerful and all-mighty."
          ],
          "en.ahmedraza": [
            "Indeed We sent Our Noble Messengers with proofs, and sent down the Book and the Balance of Justice along with them, so that people may stay upon justice; and We sent down iron having severe heat and benefits for mankind, and so that Allah may see him, who without seeing aides Him and His Noble Messengers; indeed Allah is Almighty, Dominant."
          ],
          "en.arberry": [
            "Indeed, We sent Our Messengers with the clear signs, and We sent down with them the Book and the Balance so that men might uphold justice. And We sent down iron, wherein is great might, and many uses for men, and so that God might know who helps Him, and His Messengers, in the Unseen. Surely God is All-strong, All-mighty."
          ],
          "en.daryabadi": [
            "Assuredly We sent Our apostles with evidences, and We sent down With them the book and the balance, that people might observe equity. And We sent down iron wherein is great violence and also advantages Unto mankind, and that Allah may know him who succoureth Him, unseen, and His apostles. Verily Allah is Strong, Mighty."
          ],
          "en.hilali": [
            "Indeed We have sent Our Messengers with clear proofs, and revealed with them the Scripture and the Balance (justice) that mankind may keep up justice. And We brought forth iron wherein is mighty power (in matters of war), as well as many benefits for mankind, that Allah may test who it is that will help Him (His religion), and His Messengers in the unseen. Verily, Allah is All-Strong, All-Mighty."
          ],
          "en.itani": [
            "We sent Our messengers with the clear proofs, and We sent down with them the Book and the Balance, that humanity may uphold justice. And We sent down iron, in which is violent force, and benefits for humanity. That God may know who supports Him and His messengers invisibly. God is Strong and Powerful."
          ],
          "en.maududi": [
            "Indeed We sent Our Messengers with Clear Signs, and sent down with them the Book and the Balance that people may uphold justice. And We sent down iron, wherein there is awesome power and many benefits for people, so that Allah may know who, without even having seen Him, helps Him and His Messengers. Surely Allah is Most Strong, Most Mighty."
          ],
          "en.mubarakpuri": [
            "Indeed We have sent Our Messengers with clear proofs, and revealed with them the Scripture and the Mizan that mankind may keep up justice. And We brought forth iron wherein is mighty power, as well as many benefits for mankind, that Allah may test who it is that will help Him (His religion) and His Messengers in the unseen. Verily, Allah is Powerful, Almighty."
          ],
          "en.pickthall": [
            "We verily sent Our messengers with clear proofs, and revealed with them the Scripture and the Balance, that mankind may observe right measure; and He revealed iron, wherein is mighty power and (many) uses for mankind, and that Allah may know him who helpeth Him and His messengers, though unseen. Lo! Allah is Strong, Almighty."
          ],
          "en.qarai": [
            "Certainly We sent Our apostles with manifest proofs, and We sent down with them the Book and the Balance, so that mankind may maintain justice; and We sent down iron, in which there is great might and uses for mankind, and so that Allah may know those who help Him and His apostles [with faith] in the Unseen. Indeed Allah is all-strong, all-mighty."
          ],
          "en.qaribullah": [
            "We have sent Our Messengers with proofs, and sent them with the Book and the Scales, so that people might establish the Scale (of justice). We have sent down iron in which there is great might and diverse benefit for people, so that Allah knows those who help Him and His Messengers in the Unseen. Indeed, Allah is the Strong, the Almighty."
          ],
          "en.sahih": [
            "We have already sent Our messengers with clear evidences and sent down with them the Scripture and the balance that the people may maintain [their affairs] in justice. And We sent down iron, wherein is great military might and benefits for the people, and so that Allah may make evident those who support Him and His messengers unseen. Indeed, Allah is Powerful and Exalted in Might."
          ],
          "en.sarwar": [
            "We sent Our Messengers with clear evidence (to support their truthfulness), and sent with them the Book and the Balance so that people would maintain justice. We sent down iron - in which there is strong power and benefit for the people - so that God would know who would help Him and His Messenger without seeing the unseen. God is All-powerful and Majestic."
          ],
          "en.shakir": [
            "Certainly We sent Our apostles with clear arguments, and sent down with them the Book and the balance that men may conduct themselves with equity; and We have made the iron, wherein is great violence and advantages to men, and that Allah may know who helps Him and His apostles in the secret; surely Allah is Strong, Mighty."
          ],
          "en.transliteration": [
            "Laqad arsaln<u>a</u> rusulan<u>a</u> bi<b>a</b>lbayyin<u>a</u>ti waanzaln<u>a</u> maAAahumu alkit<u>a</u>ba wa<b>a</b>lmeez<u>a</u>na liyaqooma a<b>l</b>nn<u>a</u>su bi<b>a</b>lqis<u>t</u>i waanzaln<u>a</u> al<u>h</u>adeeda feehi basun shadeedun waman<u>a</u>fiAAu li<b>l</b>nn<u>a</u>si waliyaAAlama All<u>a</u>hu man yan<u>s</u>uruhu warusulahu bi<b>a</b>lghaybi inna All<u>a</u>ha qawiyyun AAazeez<b>un</b>"
          ],
          "en.wahiduddin": [
            "We sent Our messengers with evidence and, with them, We sent down the Book and the Scales of Justice, so that men might act in all fairness. We sent down iron with its great inherent strength and its many benefits for mankind, so that God might know who would stand up for God, though unseen, and His messengers. God is powerful, and almighty."
          ],
          "en.yusufali": [
            "We sent aforetime our messengers with Clear Signs and sent down with them the Book and the Balance (of Right and Wrong), that men may stand forth in justice; and We sent down Iron, in which is (material for) mighty war, as well as many benefits for mankind, that Allah may test who it is that will help, Unseen, Him and His messengers: For Allah is Full of Strength, Exalted in Might (and able to enforce His Will)."
          ],
          "fa.ansarian": [
            "همانا ما پیامبران خود را با دلایل روشن فرستادیم و با آنان کتاب و ترازو [ی تشخیص حق از باطل] نازل کردیم تا مردم به عدالت بر خیزند، و آهن را که در آن برای مردم قوت و نیرویی سخت و سودهایی است، فرود آوردیم و تا خدا مشخص بدارد چه کسانی او و پیامبرانش را در غیاب پیامبران یاری می دهند؛ یقیناً خدا نیرومند و توانای شکست ناپذیر است."
          ],
          "fa.ayati": [
            "ما پيامبرانمان را با دليلهاى روشن فرستاديم و با آنها كتاب و ترازو را نيز نازل كرديم تا مردم به عدالت عمل كنند. و آهن را كه در آن نيرويى سخت و منافعى براى مردم است فروفرستاديم، تا خدا بداند چه كسى به ناديده، او و پيامبرانش را يارى مى‌كند. زيرا خدا توانا و پيروزمند است."
          ],
          "fa.bahrampour": [
            "به راستى [ما] پيامبران خود را با دلايل آشكار فرستاديم و با آنها كتاب و ميزان [حق و باطل‌] نازل نموديم تا مردم به عدل و انصاف برخيزند، و آهن را كه در آن نيرويى شديد و منافعى براى مردم است پديد آورديم، و تا خدا معلوم بدارد چه كسى در نهان، او و پيامبران"
          ],
          "fa.fooladvand": [
            "به راستى [ما] پيامبران خود را با دلايل آشكار روانه كرديم و با آنها كتاب و ترازو را فرود آورديم تا مردم به انصاف برخيزند، و آهن را كه در آن براى مردم خطرى سخت و سودهايى است، پديد آورديم، تا خدا معلوم بدارد چه كسى در نهان، او و پيامبرانش را يارى مى‌كند. آرى، خدا نيرومند شكست ناپذير است."
          ],
          "fa.ghomshei": [
            "همانا ما پیمبران خود را با ادلّه و معجزات فرستادیم و با ایشان کتاب و میزان عدل نازل کردیم تا مردم به راستی و عدالت گرایند، و آهن (و دیگر فلزات) را که در آن هم سختی (جنگ و کارزار) و هم منافع بسیار بر مردم است (نیز برای حفظ عدالت) آفریدیم، و تا معلوم شود که خدا و رسلش را با ایمان قلبی که یاری خواهد کرد؟ (هر چند) که خدا بسیار قوی و مقتدر (و از یاری خلق بی‌نیاز) است."
          ],
          "fa.khorramdel": [
            "ما پیغمبران خود را همراه با دلائل متقن و معجزات روشن (به میان مردم) روانه کرده‌ایم، و با آنان کتابهای (آسمانی و قوانین) و موازین (شناسائی حق و عدالت) نازل نموده‌ایم تا مردمان (برابر آن در میان خود) دادگرانه رفتار کنند. و آهن را پدیدار کرده‌ایم که دارای نیروی زیاد و سودهای فراوانی برای مردمان است. هدف (از ارسال انبیاء و نزول کتب آسمانی و همچنین آفرینش وسائلی چون آهن) این است که خداوند بداند چه کسانی او را و فرستادگانش را بگونه‌ی نهان و پنهان (از دیدگان مردمان) یاری می‌کنند. خداوند نیرومند و چیره است. [[«الْبَیِّنَاتِ»: (نگا: روم / 47، غافر / 22). «الْکِتَابَ»: جنس کتاب مراد است. یعنی همه کتابهای آسمانی. «الْمِیزَانَ»: (نگا: شوری / 17، رحمن / 7 و 8 و 9). «الْقِسْطِ»: عدل (نگا: آل‌عمران / 18 و 21، نساء / 127 و 135). «أَنزَلْنَا الحَدِیدَ»: آهن را آفریده‌ایم و پدیدار کرده‌ایم. «أَنزَلْنَا»: بوجود آورده‌ایم. خلق کرده‌ایم. (نگا: اعراف / 26، زمر / 6). «لِیَقُومَ»: تا عمل بکنند. تا دست بیازند (نگا: نساء / 127). «بَأْسُ»: قوت. نیرو. (نگا: نساء / 84، انعام / 65، اسراء / 5). «لِیَعْلَمَ اللهُ ...»: (نگا: بقره / 143، آل‌عمران / 140 و 142، کهف / 12). «بِالْغَیْبِ»: دور از چشم مردم. بعد از وفات انبیاء. بی‌آنکه خدا را ببینند.]]"
          ],
          "fa.khorramshahi": [
            "به راستی که پیامبرانمان را همراه با پدیده‌های روشنگر فرستادیم و همراه آنان کتاب آسمانی و سنجه فرو فرستادیم، تا مردم به دادگری برخیزند، و آهن را پدید آوردیم که در آن [مایه‌] ستیز و صلابت است و نیز سودهایی برای مردم، تا سرانجام خداوند معلوم بدارد که چه کسی در نهان [جانب‌] او و پیامبرانش را یاری می‌دهد، بی‌گمان خداوند نیرومند پیروزمند است‌"
          ],
          "fa.makarem": [
            "ما رسولان خود را با دلایل روشن فرستادیم، و با آنها کتاب (آسمانی) و میزان (شناسایی حقّ از باطل و قوانین عادلانه) نازل کردیم تا مردم قیام به عدالت کنند؛ و آهن را نازل کردیم که در آن نیروی شدید و منافعی برای مردم است، تا خداوند بداند چه کسی او و رسولانش را یاری می‌کند بی‌آنکه او را ببینند؛ خداوند قوّی و شکست‌ناپذیر است!"
          ],
          "fa.moezzi": [
            "همانا فرستادیم پیمبران خویش را به نشانیها و فرستادیم با ایشان کتاب و ترازو را تا قیام کنند مردم به داد و فرستادیم آهن را در آن نیروئی سخت و سودهائی برای مردم و تا بداند خدا آن را که یاری کند او و فرستادگانش را به نهان همانا خدا است توانای عزّتمند"
          ],
          "fa.mojtabavi": [
            "هر آينه پيامبرانمان را با حجتهاى روشن و هويدا فرستاديم و با ايشان كتاب- كه وسيله تمييز حق از باطل است- و ترازو فرو فرستاديم تا مردم به داد و انصاف برخيزند و آهن را فرو آورديم كه در آن نيرويى سخت- سلاح و وسايل كارزار و مانند آن- و سودهايى [ديگر] براى مردم است، و تا خدا كسى را كه او و پيامبرانش را به ناديده يارى مى‌كند بازشناسد. همانا خدا نيرومند و تواناى بى‌همتاست."
          ],
          "fa.sadeqi": [
            "(ما) پیامبرانمان را به‌راستی و درستی با (همه‌ی) دلایل آشکار فرستادیم و با آنها کتاب و میزان فرود آوردیم تا مردم به انصاف (عادلانه و فاضلانه) برخیزند. و آهن را که در آن برای مردمان نیرویی سخت و سودهایی است، فرو فرستادیم، تا خدا نشانه گذارد چه کسی در نهان، او و پیامبرانش را یاری می‌کند. خدا به‌راستی نیرومندی عزیز است."
          ]
        }
      },
      {
        "index": 5101,
        "local_index": 26,
        "part_type": "Verse",
        "path": "/books/quran:57:26",
        "text": [
          "وَ لَقَدْ أَرْسَلْنَا نُوحاً وَ إِبْرَاهِيمَ‌ وَ جَعَلْنَا فِي‌ ذُرِّيَّتِهِمَا النُّبُوَّةَ وَ الْکِتَابَ‌ فَمِنْهُمْ‌ مُهْتَدٍ وَ کَثِيرٌ مِنْهُمْ‌ فَاسِقُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "We sent Noah and Abraham, and gave prophethood to their progeny and the Book, and some of them are well-directed, but many of them are disobedient."
          ],
          "en.ahmedraza": [
            "And indeed We sent Nooh and Ibrahim, and placed Prophethood and the Book among their descendants, so some among them took to guidance; and many of them are sinners."
          ],
          "en.arberry": [
            "And We sent Noah, and Abraham, and We appointed the Prophecy and the Book to be among their seed; and some of them are guided, and many of them are ungodly."
          ],
          "en.daryabadi": [
            "And assuredly We sent Nuh and Ibrahim, and We placed in the posterity of the twain the prophecy and the Book. Then of them some are guided ones, and many of them are transgressors."
          ],
          "en.hilali": [
            "And indeed, We sent Nuh (Noah) and Ibrahim (Abraham), and placed in their offspring Prophethood and Scripture, and among them there is he who is guided, but many of them are Fasiqun (rebellious, disobedient to Allah)."
          ],
          "en.itani": [
            "We sent Noah and Abraham, and established in their line Prophethood and the Scripture. Some of them are guided, but many of them are sinners."
          ],
          "en.maududi": [
            "Indeed We sent forth Noah and Abraham and established in their line Prophecy and the Book. Then some of them embraced the guidance and many of them are wicked."
          ],
          "en.mubarakpuri": [
            "And indeed, We sent Nuh and Ibrahim, and placed in their offspring prophethood and Scripture. And among them there are some who are guided; but many of them are rebellious."
          ],
          "en.pickthall": [
            "And We verily sent Noah and Abraham and placed the prophethood and the scripture among their seed, and among them there is he who goeth right, but many of them are evil-livers."
          ],
          "en.qarai": [
            "Certainly We sent Noah and Abraham and We ordained among their descendants prophethood and the Book. Some of them are [rightly] guided, and many of them are transgressors."
          ],
          "en.qaribullah": [
            "We sent forth Noah and Abraham, and appointed the Prophethood and the Book to be given to their descendants. Some were guided, but many wereimpious."
          ],
          "en.sahih": [
            "And We have already sent Noah and Abraham and placed in their descendants prophethood and scripture; and among them is he who is guided, but many of them are defiantly disobedient."
          ],
          "en.sarwar": [
            "We sent Noah and Abraham and placed prophethood and the Book among their offsprings, some of whom have the right guidance. However, most of them are evil doers."
          ],
          "en.shakir": [
            "And certainly We sent Nuh and Ibrahim and We gave to their offspring the (gift of) prophecy and the Book; so there are among them those who go aright, and most of them are transgressors."
          ],
          "en.transliteration": [
            "Walaqad arsaln<u>a</u> noo<u>h</u>an waibr<u>a</u>heema wajaAAaln<u>a</u> fee <u>th</u>urriyyatihim<u>a</u> a<b>l</b>nnubuwwata wa<b>a</b>lkit<u>a</u>ba faminhum muhtadin wakatheerun minhum f<u>a</u>siqoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "We sent forth Noah and Abraham and bestowed upon their offspring prophethood and the Book. Some of them were rightly guided, but many others were transgressors."
          ],
          "en.yusufali": [
            "And We sent Noah and Abraham, and established in their line Prophethood and Revelation: and some of them were on right guidance. But many of them became rebellious transgressors."
          ],
          "fa.ansarian": [
            "به یقین ما نوح و ابراهیم را فرستادیم و در میان فرزندان آن دو نفر، نبوّت و کتاب قرار دادیم، پس برخی از آنان هدایت یافتند و بسیاری از آنان نافرمان بودند."
          ],
          "fa.ayati": [
            "ما نوح و ابراهيم را به رسالت فرستاديم و در ميان فرزندانشان نبوت و كتاب نهاديم. بعضيشان هدايت‌يافتگان بودند ولى بيشترينشان نافرمانان."
          ],
          "fa.bahrampour": [
            "و همانا نوح و ابراهيم را فرستاديم و در ميان فرزندان آن دو نبوت و كتاب نهاديم، پس برخى از آنها هدايت يافته و بسيارى از آنان فاسق بودند"
          ],
          "fa.fooladvand": [
            "و در حقيقت، نوح و ابراهيم را فرستاديم و در ميان فرزندان آن دو، نبوت و كتاب را قرار داديم: از آنها [برخى‌] راه‌ياب [شد]ند، و[لى‌] بسيارى از آنان بدكار بودند."
          ],
          "fa.ghomshei": [
            "و البته ما نوح و ابراهیم را فرستادیم و در میان فرزندانشان نبوت و کتاب آسمانی قرار دادیم، پس آنها برخی به راه حق هدایت یافتند و بسیاری به فسق و بدکاری شتافتند."
          ],
          "fa.khorramdel": [
            "ما نوح و ابراهیم را (پیغمبر، و به سوی مردم) روانه کرده‌ایم، و در دودمان آنان نبوّت و کتابها (ی آسمانی، از جمله تورات و انجیل و زبور و قرآن) را قرار دادیم. برخی از آنان راهیاب شدند، و بسیاری از ایشان (از راه راست خداشناسی، منحرف و) خارج شدند. [[«نُوحاً وَ إِبْرَاهِیمَ»: ذکر این دو پیغمبر اولوالعزم، بدان خاطر است که آنان پدر همه انبیاء بعد از خود هستند (نگا: عبدالکریم الخطیب) و نوح شیخ‌الانبیاء (نگا: صفوة التفاسیر) و پدر دوم نام گرفته است (نگا: شربینی)، و ابراهیم قهرمان توحید، و ابوالانبیاء بوده (نگا: صفوة التفاسیر) و عربها و رومیها و بنی‌اسرائیل از نژاد او هستند (نگا: شربینی). «الْکِتَابَ»: کتابهای آسمانی از جمله کتب اربعه: تورات و زبور و انجیل و قرآن. خط و نوشتن (نگا: شربینی، روح‌المعانی). «وَ لَقَدْ أَرْسَلْنَا نُوحاً وَ إِبْرَاهِیمَ ...»: عطف بر (لَقَدْ أَرْسَلْنَا رُسُلَنَا بِالْبَیِّنَاتِ) بوده و بخش پسین، تفصیل اجمال بخش پیشین است.]]"
          ],
          "fa.khorramshahi": [
            "و به راستی نوح و ابراهیم را به رسالت فرستادیم، و در زاد و رود آن دو، پیامبری و کتاب آسمانی قرار دادیم، آنگاه بعضی از آنان رهیافته و بسیاری از آنان نافرمانند"
          ],
          "fa.makarem": [
            "ما نوح و ابراهیم را فرستادیم، و در دودمان آن دو نبوّت و کتاب قرار دادیم؛ بعضی از آنها هدایت یافته‌اند و بسیاری از آنها گنهکارند."
          ],
          "fa.moezzi": [
            "و همانا فرستادیم نوح و ابراهیم را و نهادیم در نژادشان پیمبری و کتاب را پس از ایشان است رهبری و بسیاری از ایشانند نافرمانان‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه نوح و ابراهيم را فرستاديم و در ميان فرزندانشان پيامبرى و كتاب نهاديم. پس برخى‌شان رهيافته بودند و بسياريشان از فرمان [حق‌] بيرون شدند."
          ],
          "fa.sadeqi": [
            "و به‌راستی و درستی، نوح و ابراهیم را فرستادیم و در میان فرزندانشان نبّوت و کتاب را قرار دادیم. پس برخی از آنان راه‌یافته‌اند و بسیاری از آنان فاسقانند."
          ]
        }
      },
      {
        "index": 5102,
        "local_index": 27,
        "part_type": "Verse",
        "path": "/books/quran:57:27",
        "text": [
          "ثُمَ‌ قَفَّيْنَا عَلَى‌ آثَارِهِمْ‌ بِرُسُلِنَا وَ قَفَّيْنَا بِعِيسَى‌ ابْنِ‌ مَرْيَمَ‌ وَ آتَيْنَاهُ‌ الْإِنْجِيلَ‌ وَ جَعَلْنَا فِي‌ قُلُوبِ‌ الَّذِينَ‌ اتَّبَعُوهُ‌ رَأْفَةً وَ رَحْمَةً وَ رَهْبَانِيَّةً ابْتَدَعُوهَا مَا کَتَبْنَاهَا عَلَيْهِمْ‌ إِلاَّ ابْتِغَاءَ رِضْوَانِ‌ اللَّهِ‌ فَمَا رَعَوْهَا حَقَ‌ رِعَايَتِهَا فَآتَيْنَا الَّذِينَ‌ آمَنُوا مِنْهُمْ‌ أَجْرَهُمْ‌ وَ کَثِيرٌ مِنْهُمْ‌ فَاسِقُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Then in their train We sent Our apostles, and succeeding them Jesus, son of Mary, and gave him the Gospel, and put into the hearts of his followers compassion and kindness. But they created monasticism which had not been prescribed for them by Us except for seeking the pleasure of God; yet they did not observe it as it should have been rightly observed. So We gave those among them who were believers their reward; but most of them are disobedient."
          ],
          "en.ahmedraza": [
            "We then sent Our other Noble Messengers after them following their footsteps, and after them We sent Eisa, the son of Maryam, and bestowed the Injeel to him; and We instilled compassion and mercy in the hearts of his followers; and they invented monasticism which We had not ordained upon them only to seek Allah’s pleasure, then did not properly abide by it as it should have been rightfully abided; We therefore gave the believers among them their reward; and many of them are sinners."
          ],
          "en.arberry": [
            "Then We sent, following in their footsteps, Our Messengers; and We sent, following, Jesus son of Mary, and gave unto him the Gospel. And We set in the hearts of those who followed him tenderness and mercy. And monasticism they invented -- We did not prescribe it for them -- only seeking the good pleasure of God; but they observed it not as it should be observed. So We gave those of them who believed their wage; and many of them are ungodly."
          ],
          "en.daryabadi": [
            "Thereafter in their footsteps We caused Our apostles to follow, and We caused lsa, son Of Maryam, to follow them, and We vouchsafed Unto him the Injil, and We placed In the hearts of those who followed him tenderness and mercy. And asceticism! they innovated it- We prescribed it not for them Only seeking Allah's pleasure yet they tended it not with tendence due thereto. So We vouchsafed Unto such of them as believed their hire, and many of them are transgressors."
          ],
          "en.hilali": [
            "Then, We sent after them, Our Messengers, and We sent 'Iesa (Jesus) - son of Maryam (Mary), and gave him the Injeel (Gospel). And We ordained in the hearts of those who followed him, compassion and mercy. But the Monasticism which they invented for themselves, We did not prescribe for them, but (they sought it) only to please Allah therewith, but that they did not observe it with the right observance. So We gave those among them who believed, their (due) reward, but many of them are Fasiqun (rebellious, disobedient to Allah)."
          ],
          "en.itani": [
            "Then We sent in their wake Our messengers, and followed up with Jesus son of Mary, and We gave him the Gospel, and instilled in the hearts of those who followed him compassion and mercy. But as for the monasticism which they invented—We did not ordain it for them—only to seek God’s approval. But they did not observe it with its due observance. So We gave those of them who believed their reward, but many of them are sinful."
          ],
          "en.maududi": [
            "In their wake, We sent a succession of Our Messengers, and raised Jesus, son of Mary, after all of them, and bestowed upon him the Evangel, and We set tenderness and mercy in the hearts of those that followed him. As for monasticism, it is they who invented it; We did not prescribe it for them. They themselves invented it in pursuit of Allah's good pleasure, and then they did not observe it as it ought to have been observed. So We gave their reward to those of them that believed. But many of them are wicked."
          ],
          "en.mubarakpuri": [
            "Then, We sent after them Our Messengers, and We sent `Isa the son of Maryam, and gave him the Injil. And We ordained in the hearts of those who followed him, compassion and mercy. But the monasticism which they invented for themselves, We did not prescribe for them, but (they sought it) only to please Allah therewith, but that they did not observe it with the right observance. So, We gave those among them who believed, their (due) reward; but many of them are rebellious."
          ],
          "en.pickthall": [
            "Then We caused Our messengers to follow in their footsteps; and We caused Jesus, son of Mary, to follow, and gave him the Gospel, and placed compassion and mercy in the hearts of those who followed him. But monasticism they invented - We ordained it not for them - only seeking Allah's pleasure, and they observed it not with right observance. So We give those of them who believe their reward, but many of them are evil-livers."
          ],
          "en.qarai": [
            "Then We followed them up with Our apostles and We followed [them] with Jesus son of Mary, and We gave him the Evangel, and We put kindness and mercy into the hearts of those who followed him. But as for monasticism, they innovated it—We had not prescribed it for them—only seeking Allah’s pleasure. Yet they did not observe it with due observance. So We gave to the faithful among them their [due] reward, but many of them are transgressors."
          ],
          "en.qaribullah": [
            "Following them We sent Our (other) Messengers, and We sent following in their footsteps, (Prophet) Jesus, the son of Mary and gave him the Gospel, and put tenderness and mercy in the hearts of his followers. As for monasticism, they invented it thereby seeking the pleasure of Allah. We did not write it for them, and they did not observe it as it should be observed. We gave to those of them who believed their wage, but many of them are impious."
          ],
          "en.sahih": [
            "Then We sent following their footsteps Our messengers and followed [them] with Jesus, the son of Mary, and gave him the Gospel. And We placed in the hearts of those who followed him compassion and mercy and monasticism, which they innovated; We did not prescribe it for them except [that they did so] seeking the approval of Allah. But they did not observe it with due observance. So We gave the ones who believed among them their reward, but many of them are defiantly disobedient."
          ],
          "en.sarwar": [
            "Then We sent Our other Messengers to follow their traditions. After them We sent Jesus, the son of Mary, to whom We gave the Gospel. In the hearts of his followers We placed compassion and mercy. We did not command them to lead the monastic life. This was their own method of seeking the pleasure of God. Despite this intention, they did not properly observe it (the monastic life). To the believers among them, We gave their reward but many of them are evil-doers."
          ],
          "en.shakir": [
            "Then We made Our apostles to follow in their footsteps, and We sent Isa son of Marium afterwards, and We gave him the Injeel, and We put in the hearts of those who followed him kindness and mercy; and (as for) monkery, they innovated it-- We did not prescribe it to them-- only to seek Allah's pleasure, but they did not observe it with its due observance; so We gave to those of them who believed their reward, and most of them are transgressors."
          ],
          "en.transliteration": [
            "Thumma qaffayn<u>a</u> AAal<u>a</u> <u>a</u>th<u>a</u>rihim birusulin<u>a</u> waqaffayn<u>a</u> biAAees<u>a</u> ibni maryama wa<u>a</u>tayn<u>a</u>hu alinjeela wajaAAaln<u>a</u> fee quloobi alla<u>th</u>eena ittabaAAoohu rafatan wara<u>h</u>matan warahb<u>a</u>niyyatan ibtadaAAooh<u>a</u> m<u>a</u> katabn<u>a</u>h<u>a</u> AAalayhim ill<u>a</u> ibtigh<u>a</u>a ri<u>d</u>w<u>a</u>ni All<u>a</u>hi fam<u>a</u> raAAawh<u>a</u> <u>h</u>aqqa riAA<u>a</u>yatih<u>a</u> fa<u>a</u>tayn<u>a</u> alla<u>th</u>eena <u>a</u>manoo minhum ajrahum wakatheerun minhum f<u>a</u>siqoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Then, in their wake, We followed them up with [others of] Our messengers and after them Jesus, son of Mary. We gave him the Gospel and imbued the hearts of those who followed him with compassion and mercy. But We did not prescribe monasticism for them: that was their own innovation by which they sought to please God. But then, they did not observe it in the way that it should have been observed. So We rewarded only those who were truly faithful, for many of them were disobedient."
          ],
          "en.yusufali": [
            "Then, in their wake, We followed them up with (others of) Our messengers: We sent after them Jesus the son of Mary, and bestowed on him the Gospel; and We ordained in the hearts of those who followed him Compassion and Mercy. But the Monasticism which they invented for themselves, We did not prescribe for them: (We commanded) only the seeking for the Good Pleasure of Allah; but that they did not foster as they should have done. Yet We bestowed, on those among them who believed, their (due) reward, but many of them are rebellious transgressors."
          ],
          "fa.ansarian": [
            "سپس به دنبال آنان پیامبران خود را پی در پی آوردیم و پس از آنان عیسی پسر مریم را [به رسالت] فرستادیم و به او انجیل عطا کردیم و در قلب کسانی که از او پیروی می کردند رأفت و رحمت قرار دادیم، و رهبانیتی که از نزد خود ساخته بودند ما بر آنان مقرّر نکرده بودیم، ولی [خود آنان آن را] برای طلب خشنودی خدا [بر خود واجب کرده بودند]، اما آنگونه که باید حدود خودساخته را رعایت نکردند؛ پس پاداش کسانی از آنان را که ایمان آورده اند، عطا کردیم و بسیاری از آنان نافرمانند."
          ],
          "fa.ayati": [
            "سپس پيامبرانمان را پس از ايشان فرستاديم. و عيسى بن مريم را از پى آنها روانه كرديم و به او انجيل را داديم، و در دل پيروانش رأفت و رحمت نهاديم. و رهبانيتى كه به بدعت آورده‌اند ما بر آنها مقرر نكرده‌ايم، اما در آن خشنودى خدا مى‌جستند، ولى حق آن را بسزا نگزاردند. ما از آن ميان به كسانى كه ايمان آورده بودند، پاداش داديم ولى بيشترينشان نافرمان بودند."
          ],
          "fa.bahrampour": [
            "آن‌گاه به دنبال آنان پيامبران خود را پى‌درپى آورديم، و عيسى پسر مريم را از پى [آنها] فرستاديم و او را انجيل داديم، و در دل‌هاى كسانى كه از او پيروى كردند رأفت و رحمت نهاديم و ترك دنيايى كه از خود ساختند ما آن را بر ايشان مقرر نكرديم [و آنها] جز به طل"
          ],
          "fa.fooladvand": [
            "آنگاه به دنبال آنان پيامبران خود را، پى‌درپى، آورديم، و عيسى پسر مريم را در پى [آنان‌] آورديم و به او انجيل عطا كرديم، و در دلهاى كسانى كه از او پيروى كردند رأفت و رحمت نهاديم و [اما] ترك دنيايى كه از پيش خود درآوردند ما آن را بر ايشان مقرّر نكرديم مگر براى آنكه كسب خشنودى خدا كنند، با اين حال آن را چنانكه حقّ رعايت آن بود منظور نداشتند. پس پاداش كسانى از ايشان را كه ايمان آورده بودند بدانها داديم و[لى‌] بسيارى از آنان دستخوش انحرافند."
          ],
          "fa.ghomshei": [
            "و از پی آنان باز رسولان دیگر و سپس عیسی مریم را فرستادیم و به او کتاب آسمانی انجیل را عطا کردیم و در دل پیروان (حقیقی) او رأفت و مهربانی نهادیم و لیکن رهبانیّت و ترک دنیا را از پیش خود بدعت انگیختند، ما بر آنها جز آنکه رضا و خشنودی خدا را طلبند (در کتاب انجیل) ننوشتیم و باز آنها چنان که باید و شاید همه مراعات آن را نکردند، ما هم به آنان که ایمان آوردند پاداش و اجرشان را عطا کردیم و لیکن از آنها بسیاری به راه فسق و تبهکاری شتافتند."
          ],
          "fa.khorramdel": [
            "سپس به دنبال نوح و ابراهیم (و انبیاء پیشین و همعصر با ایشان) پیغمبرانی را روانه کردیم و بدنبال همه‌ی آنان، عیسی پسر مریم را فرستادیم و بدو انجیل عطاء نمودیم، و در دل پیروان عیسی مهر و عطوفت (مسلمانان) را قرار دادیم. پیروان او رهبانیّت سختی را پدید آوردند که ما آن را بر آنان واجب نکرده بودیم، ولیکن خودشان آن را برای بدست آوردن خوشنودی خدا پدید آورده بودند (و بر خویشتن نذر و واجب نموده بودند). امّا آنان چنانکه باید آن را مراعات نکردند. ما به کسانی که از ایشان (به محمّد) ایمان آوردند پاداش درخورشان را دادیم، ولی بیشترشان (از راه راست منحرف و) خارج شدند (و سزای اعمال بد خود را دیدند). [[«قَفَّیْنَا عَلی آثَارِهِمْ»: (نگا: مائده / 46). «جَعَلْنَا ... رَأفَةً وَ رَحْمَةً»: برخی گفته‌اند چنین رأفت و رحمت خدادادی خودشان، نسبت به خودشان، مراد است، همسان مهر و عطوفت مسلمانان در حق یکدیگر (نگا: آل‌عمران / 103). بعضی گفته‌اند مراد رأفت و رحمت مسیحیان حقیقی نسبت به مسلمانان است (نگا: مائده / 82). «رَهْبَانِیَّةً»: در آغاز به معنی ترس از خدا و بی‌اعتنائی نسبت به دنیا بود، ولی بعدها جنبه غارنشینی و دیرنشینی و دوری از مردمان و ترک ازدواج و پشت پا زدن به تمام نعمتها و خوشیهای دنیا را پیدا کرد. منصوب به اشتغال است. «إِلاَّ ابْتِغَآءَ»: مستثنی منقطع است و (إِلاّ) به معنی (لکِنَّ) است (نگا: کشاف). خلاصه: رهبانیت را کشیشان و مسیحیان برای رضای خدا پدیدار نمودند و بر خویشتن نذر و فرض کردند و بعدها آن را مراعات ننمودند، و به آئین تثلیث درآمدند. ناگفته نماند که رهبانیت در اسلام حرام است و پیغمبر فرموده است: لا رَهْبانِیَّةَ فِی الإِسْلامِ (نگا: المصحف المیسر).]]"
          ],
          "fa.khorramshahi": [
            "سپس از پی ایشان پیامبرانمان را آوردیم، و عیسی بن مریم را از پی آوردیم، و به او انجیل دادیم و در دل کسانی که از او پیروی کردند رأفت و رحمت قرار دادیم، و رهبانیتی را به صورت بدعتی در پیش گرفتند که ما آن را بر ایشان واجب نکرده بودیم، مگر آنکه در طلب خشنودی الهی آن را در پیش گرفته بودند، ولی چنانکه شایسته رعایت بود، رعایتش نکردند، آنگاه به مؤمنان آنان پاداششان را بخشیدیم و بسیاری از آنان نافرمانند"
          ],
          "fa.makarem": [
            "سپس در پی آنان رسولان دیگر خود را فرستادیم، و بعد از آنان عیسی بن مریم را مبعوث کردیم و به او انجیل عطا کردیم، و در دل کسانی که از او پیروی کردند رأفت و رحمت قرار دادیم؛ و رهبانیّتی را که ابداع کرده بودند، ما بر آنان مقرّر نداشته بودیم؛ گرچه هدفشان جلب خشنودی خدا بود، ولی حقّ آن را رعایت نکردند؛ از این‌رو ما به کسانی از آنها که ایمان آوردند پاداششان را دادیم؛ و بسیاری از آنها فاسقند!"
          ],
          "fa.moezzi": [
            "سپس از پی ایشان آوردیم فرستادگان خویش را و پشت سر ایشان آوردیم عیسی ابن مریم را و دادیم بدو انجیل را و نهادیم در دلهای آنان که پیرویش کردند مهربانی و ترحّمی را و گوشه گیریی که از خویش درآوردند (بدعت کردند) ننوشتیمش بر ایشان جز از پی خوشنودی خدا پس رعایتش نکردند حقّ رعایتش را پس دادیم بدانان که ایمان آوردند از ایشان مزدشان را و بسیاری از ایشانند نافرمانان‌"
          ],
          "fa.mojtabavi": [
            "سپس از پى ايشان- پيامبرانى كه ياد كرديم- پيامبران خود را فرستاديم، و عيسى پسر مريم را از پى درآورديم و به او انجيل داديم، و در دلهاى كسانى كه از او پيروى كردند مهربانى و نرمى نهاديم و رهبانيتى- گوشه‌گيرى- كه از خود ساختند، ما آن را بر آنان ننوشتيم- مقرر نكرديم- جز [آنكه آن را] براى جستن خشنودى خداى [اختراع كردند]، ولى آن را آنسان كه سزاوار است نگاه نداشتند، پس مزد كسانى از آنان را كه ايمان آوردند داديم، و بسيارى از آنها نافرمان بودند."
          ],
          "fa.sadeqi": [
            "سپس به دنبال آنان پیامبران خود را، پی در پی آوردیم. و عیسی پسر مریم را در پی (آنان) آوردیم و به او انجیل دادیم و در دل‌های کسانی که از او پیروی کردند رأفت و رحمت نهادیم‌. و (اما) رهبانیتی که از پیش خود در آوردند ما آن را بر ایشان مقرّر نکردیم مگر برای آنکه کسب خشنودی خدا کنند. پس آن را چنان که حقّ رعایتش بود منظور نداشتند. پس پاداش کسانی از ایشان را که ایمان آوردند به آنها دادیم‌. و بسیاری از آنان فاسقانند."
          ]
        }
      },
      {
        "index": 5103,
        "local_index": 28,
        "part_type": "Verse",
        "path": "/books/quran:57:28",
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا اتَّقُوا اللَّهَ‌ وَ آمِنُوا بِرَسُولِهِ‌ يُؤْتِکُمْ‌ کِفْلَيْنِ‌ مِنْ‌ رَحْمَتِهِ‌ وَ يَجْعَلْ‌ لَکُمْ‌ نُوراً تَمْشُونَ‌ بِهِ‌ وَ يَغْفِرْ لَکُمْ‌ وَ اللَّهُ‌ غَفُورٌ رَحِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O you who believe, have fear of displeasing God, and believe in His Prophet. He will give you twice as much of His bounty and place a light for you to walk in, and forgive you, for God is forgiving and kind;"
          ],
          "en.ahmedraza": [
            "O People who Believe (in the earlier Noble Messengers)! Fear Allah and accept faith in this Noble Messenger of His – He will bestow two portions of His mercy to you and will create a light for you to walk in it, and will forgive you; and Allah is Oft Forgiving, Most Merciful."
          ],
          "en.arberry": [
            "O believers, fear God, and believe in His Messenger, and He will give you a twofold portion of His mercy; and He will appoint for you a light whereby you shall walk, and forgive you; God is All-forgiving, All-compassionate;"
          ],
          "en.daryabadi": [
            "O ye who believe! fear Aliah and believe in His apostle; He will vouch safe Unto you two portions of His mercy and will appoint for you a light wherewith ye will walk, and He will forgive you. And Allah is Forgiving, Merciful."
          ],
          "en.hilali": [
            "O you who believe [in Musa (Moses) (i.e. Jews) and 'Iesa (Jesus) (i.e. Christians)]! Fear Allah, and believe too in His Messenger (Muhammad SAW), He will give you a double portion of His Mercy, and He will give you a light by which you shall walk (straight), and He will forgive you. And Allah is Oft-Forgiving, Most Merciful."
          ],
          "en.itani": [
            "O you who believe! Fear God, and believe in His Messenger: He will give you a double portion of His mercy, and will give you a light by which you walk, and will forgive you. God is Forgiving and Merciful."
          ],
          "en.maududi": [
            "Believers, have fear of Allah and believe in His Messenger, and He will grant you a two-fold portion of His Mercy, and will appoint for you a light whereby you shall walk; and He will forgive you. Allah is Most Forgiving, Most Compassionate."
          ],
          "en.mubarakpuri": [
            "O you who believe! Have Taqwa of Allah, and believe in His Messenger, He will give you a double portion of His mercy, and He will give you a light by which you shall walk (straight). And He will forgive you. And Allah is Oft-Forgiving, Most Merciful."
          ],
          "en.pickthall": [
            "O ye who believe! Be mindful of your duty to Allah and put faith in His messenger. He will give you twofold of His mercy and will appoint for you a light wherein ye shall walk, and will forgive you. Allah is Forgiving, Merciful;"
          ],
          "en.qarai": [
            "O you who have faith! Be wary of Allah and have faith in His Apostle. He will grant you a double share of His mercy and a light to walk by, and He will forgive you, and Allah is all-forgiving, all-merciful;"
          ],
          "en.qaribullah": [
            "Believers, fear Allah and believe in His Messenger (Prophet Muhammad), He will give you a double portion of His Mercy and He will make for you a light inwhich to walk, and forgive you; Allah is the Forgiver and the Most Merciful."
          ],
          "en.sahih": [
            "O you who have believed, fear Allah and believe in His Messenger; He will [then] give you a double portion of His mercy and make for you a light by which you will walk and forgive you; and Allah is Forgiving and Merciful."
          ],
          "en.sarwar": [
            "Believers, have fear of God and believe in His Messenger. God will grant you a double share of mercy, a light by which you can walk, and forgive your sins. God is All-forgiving and All-merciful."
          ],
          "en.shakir": [
            "O you who believe! be careful of (your duty to) Allah and believe in His Apostle: He will give you two portions of His mercy, and make for you a light with which you will walk, and forgive you, and Allah is Forgiving, Merciful;"
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo ittaqoo All<u>a</u>ha wa<u>a</u>minoo birasoolihi yutikum kiflayni min ra<u>h</u>matihi wayajAAal lakum nooran tamshoona bihi wayaghfir lakum wa<b>A</b>ll<u>a</u>hu ghafoorun ra<u>h</u>eem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Believers, fear God and believe in His messenger. He will show you mercy in double measure and will provide a light for you to walk in. God will grant you forgiveness. He is forgiving and merciful."
          ],
          "en.yusufali": [
            "O ye that believe! Fear Allah, and believe in His Messenger, and He will bestow on you a double portion of His Mercy: He will provide for you a Light by which ye shall walk (straight in your path), and He will forgive you (your past): for Allah is Oft-Forgiving, Most Merciful."
          ],
          "fa.ansarian": [
            "ای مؤمنان! از خدا پروا کنید و به پیامبرش ایمان آورید تا دو سهم از رحمتش را به شما عطا کند، و برای شما نوری قرار دهد که به وسیله آن [در میان مردم] راه سپارید و شما را بیامرزد، و خدا بسیار آمرزنده و مهربان است."
          ],
          "fa.ayati": [
            "اى كسانى كه ايمان آورده‌ايد، از خدا بترسيد و به پيامبرش ايمان بياوريد تا شما را از رحمت خويش دو بار مزد بدهد. و شما را نورى عطا كند كه در روشنايى آن راه بجوييد و بيامرزدتان كه خدا آمرزنده مهربان است."
          ],
          "fa.bahrampour": [
            "اى كسانى كه ايمان آورده‌ايد! از خدا پروا داريد و به پيامبر او ايمان آوريد تا دو سهم از رحمتش به شما ببخشد و براى شما نورى قرار دهد كه بدان راه [راست‌] رويد و شما را بيامرزد، و خداوند آمرزنده‌ى مهربان است"
          ],
          "fa.fooladvand": [
            "اى كسانى كه ايمان آورده‌ايد، از خدا پروا داريد و به پيامبر او بگرويد تا از رحمت خويش شما را دو بهره عطا كند و براى شما نورى قرار دهد كه به [بركت‌] آن راه سپريد و بر شما ببخشايد، و خدا آمرزنده مهربان است."
          ],
          "fa.ghomshei": [
            "ای کسانی که به حق گرویدید، اینک خداترس و متّقی شوید و به رسولش (محمّد مصطفی صلّی اللّه علیه و آله) نیز ایمان آرید تا خدا شما را از رحمتش دو بهره نصیب گرداند (یکی بر ایمان به رسولان پیشین و یکی بر ایمان به دین رسول ختمی مرتبت) و نوری شما را عطا کند که بدان نور راه (بهشت ابد) پیمایید و از گناه شما درگذرد، و خدا بسیار آمرزنده و مهربان است."
          ],
          "fa.khorramdel": [
            "ای کسانی که (از اهل کتاب بشمارید و به خدا و پیغمبران الهی و کتابهای تورات و انجیل) ایمان آورده‌اید! از خدا بترسید و به پیغمبر او (محمّدبن عبدالله، خاتم انبیاء، هم) ایمان بیاورید، تا خداوند دو پاداش از رحمت خود را به شما دهد (یکی پاداش ایمان به عیسی، و دیگری پاداش ایمان به محمّد)، و نیز برای شما نوری را پدیدار گرداند که در پرتو آن حرکت کنید، و شما را ببخشاید، چرا که خدا بسیار بخشاینده و مهربان است. [[«یَآ أَیُّهَا الَّذِینَ آمَنُوا ...»: مخاطب مسیحیانی هستند که به عیسی و همه انبیاء -صلوات‌الله علیهم - ایمان آورده و به خاتم‌الانبیاء نیز ایمان می‌آورند (نگا: المراغی). «کِفْلَیْنِ»: مثنی کِفْل است، به معنی نصیب و بهره و سهم (نگا: نساء / 85)، برخی آن را به مثنی محدود نکرده و بلکه برای کثرت می‌دانند (نگا: معجم‌الفاظ القرآن الکریم). در این صورت معنی: (یُؤْتِکُمْ کِفْلَیْنِ) چنین می‌شود: پاداش زیادی به شما می‌دهد. «نُوراً»: مراد نور قرآن در دنیا (نگا: مائده / 15) و یا نور ایمان در قیامت است (نگا: حدید / 12).]]"
          ],
          "fa.khorramshahi": [
            "ای مؤمنان از خداوند پروا کنید و به پیامبر او ایمان آورید، تا بهره دوچندان از رحمت خویش به شما ارزانی دارد، و برای شما نوری قرار دهد که با آن [به درستی‌] راه روید و شما را بیامرزد، و خداوند آمرزگار مهربان است‌"
          ],
          "fa.makarem": [
            "ای کسانی که ایمان آورده‌اید! تقوای الهی پیشه کنید و به رسولش ایمان بیاورید تا دو سهم از رحمتش به شما ببخشد و برای شما نوری قرار دهد که با آن (در میان مردم و در مسیر زندگی خود) راه بروید و گناهان شما را ببخشد؛ و خداوند غفور و رحیم است."
          ],
          "fa.moezzi": [
            "ای آنان که ایمان آوردید بترسید خدا را و ایمان آرید به پیمبرش دهد شما را دو بهره از رحمتش و قرار دهد برای شما تابشی که راه روید بدان و بیامرزد شما را و خدا است آمرزنده مهربان‌"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه ايمان آورده‌ايد، از خداى پروا كنيد و به پيامبر او ايمان آوريد تا شما را از بخشايش خود دو بهره دهد، و براى شما نورى قرار دهد كه بدان راه [راست‌] رويد و شما را بيامرزد، و خدا آمرزگار و مهربان است."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که ایمان آوردید! از خدا پروا بدارید و به پیامبر او بگروید تا از رحمت خویش شما را دو بهره‌ی کفالت‌‌کننده، عطا کند و برای شما نوری قرار دهد که به وسیله‌ی آن راه سپرید و (خطاهایتان را) برایتان بپوشاند و خدا بسی پوشنده‌ی رحمتگر بر ویژگان است."
          ]
        }
      },
      {
        "index": 5104,
        "local_index": 29,
        "part_type": "Verse",
        "path": "/books/quran:57:29",
        "text": [
          "لِئَلاَّ يَعْلَمَ‌ أَهْلُ‌ الْکِتَابِ‌ أَلاَّ يَقْدِرُونَ‌ عَلَى‌ شَيْ‌ءٍ مِنْ‌ فَضْلِ‌ اللَّهِ‌ وَ أَنَ‌ الْفَضْلَ‌ بِيَدِ اللَّهِ‌ يُؤْتِيهِ‌ مَنْ‌ يَشَاءُ وَ اللَّهُ‌ ذُو الْفَضْلِ‌ الْعَظِيمِ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "So that the people of the Book may know that they have not the least power over the bounty of God, and that the bounty is wholly in the hands of God to give whosoever He please, for God is the master of infinite bounty."
          ],
          "en.ahmedraza": [
            "This is so that the disbelievers among People given the Book(s) may know that they do not have any control over Allah’s munificence, and that the munificence is in Allah’s Hand (control) – He bestows to whomever He wills; and Allah is Extremely Munificent."
          ],
          "en.arberry": [
            "that the People of the Book may know that they have no power over anything of God's bounty, and that bounty is in the hand of God; He gives it unto whomsoever He will; and God is of bounty abounding."
          ],
          "en.daryabadi": [
            "This He will award that the people of the Book may know that they control naught of the grace of Allah, and that the grace is in Allah's hand; He vouchsafeth it Unto whomsoever He wilt, And Allah is Owner of mighty grace."
          ],
          "en.hilali": [
            "So that the people of the Scripture (Jews and Christians) may know that they have no power whatsoever over the Grace of Allah, and that (His) Grace is (entirely) in His Hand to bestow it on whomsoever He wills. And Allah is the Owner of Great Bounty."
          ],
          "en.itani": [
            "That the People of the Book may know that they have no power whatsoever over God’s grace, and that all grace is in God’s hand; He gives it to whomever He wills. God is Possessor of Great Grace."
          ],
          "en.maududi": [
            "(You should do this) so that the People of the Book know that they have no control over Allah's Bounty, and that all bounty is in Allah's Hand; He bestows it on whomsoever He pleases. Allah is the Lord of abounding bounty."
          ],
          "en.mubarakpuri": [
            "So that the People of the Scriptures may know that they have no power whatsoever over the grace of Allah, and that (His) grace is in His Hand to bestow it on whomsoever He wills. And Allah is the Owner of great bounty."
          ],
          "en.pickthall": [
            "That the People of the Scripture may know that they control naught of the bounty of Allah, but that the bounty is in Allah's hand to give to whom He will. And Allah is of Infinite Bounty."
          ],
          "en.qarai": [
            "so that the People of the Book may know that they do not control Allah grace in any wise and that in Allah’s hand is all grace, which He grants to whomever He wishes and Allah is dispenser of a mighty grace."
          ],
          "en.qaribullah": [
            "So that the People of the Book may know that they have no power over any of the favors of Allah; that the favors are in the Hand of Allah; He gives it towhom He will. The Favor of Allah is the Great."
          ],
          "en.sahih": [
            "[This is] so that the People of the Scripture may know that they are not able [to obtain] anything from the bounty of Allah and that [all] bounty is in the hand of Allah; He gives it to whom He wills. And Allah is the possessor of great bounty."
          ],
          "en.sarwar": [
            "(Have fear of God and believe in His Messenger) so that the followers of the Bible will know that they can receive no reward from God. They should know that all favors are in the hands of God. He grants them to whomever He wants. The favors of God are great."
          ],
          "en.shakir": [
            "So that the followers of the Book may know that they do not control aught of the grace of Allah, and that grace is in Allah's hand, He gives it to whom He pleases; and Allah is the Lord of mighty grace."
          ],
          "en.transliteration": [
            "Liall<u>a</u> yaAAlama ahlu alkit<u>a</u>bi all<u>a</u> yaqdiroona AAal<u>a</u> shayin min fa<u>d</u>li All<u>a</u>hi waanna alfa<u>d</u>la biyadi All<u>a</u>hi yuteehi man yash<u>a</u>o wa<b>A</b>ll<u>a</u>hu <u>th</u>oo alfa<u>d</u>li alAAa<i><u>th</u></i>eem<b>i</b>"
          ],
          "en.wahiduddin": [
            "The People of the Book should know that they have no power whatsoever over God's grace. His grace is entirely in His hand and He bestows it upon whoever He wills. God is truly infinite in His bounty."
          ],
          "en.yusufali": [
            "That the People of the Book may know that they have no power whatever over the Grace of Allah, that (His) Grace is (entirely) in His Hand, to bestow it on whomsoever He wills. For Allah is the Lord of Grace abounding."
          ],
          "fa.ansarian": [
            "تا اهل کتاب بدانند [که اگر به پیامبر اسلام ایمان نیاورند] بر چیزی از فضل خدا دسترسی نخواهند داشت؛ بی تردید همه فضل به دست خداست، آن را به هرکس بخواهد عطا می کند و خدا دارای فضل بزرگ است."
          ],
          "fa.ayati": [
            "تا اهل كتاب بدانند كه به بخشايش خداوند هيچ دسترس ندارند و اين بخشايش به دست اوست كه به هر كه خواهد ارزانى مى‌دارد، و خدا را بخشايشى عظيم است."
          ],
          "fa.bahrampour": [
            "[خدا به مؤمنان رحمت مضاعف داد] تا اهل كتاب [اين طور] ندانند كه مؤمنان به چيزى از فضل خدا دست نمى‌يابند و بى‌ترديد فضل و بخشش به دست خداست، آن را به هر كه خواهد عطا مى‌كند، و خدا صاحب فضل و بخشش بزرگ است"
          ],
          "fa.fooladvand": [
            "تا اهل كتاب بدانند كه به هيچ وجه فزون‌بخشى خدا در [حيطه‌] قدرت آنان نيست و فضل [و عنايت، تنها] در دست خداست: به هر كس بخواهد آن را عطا مى‌كند، و خدا داراى كرم بسيار است."
          ],
          "fa.ghomshei": [
            "تا آنان که اسلام نیاوردند از اهل کتاب بدانند که آنها هیچ به رحمت و فضل الهی دستی ندارند و هر فضلی و رحمتی به دست خداست، که او به هر که خواهد می‌بخشد و خدا دارای فضل و رحمت بزرگ و بی‌انتها است."
          ],
          "fa.khorramdel": [
            "تا اهل کتاب بدانند که (اگر به محمّد ایمان نیاورند) هیچ سهمی از فضل و عطاء الهی ندارند، و این که فضل و عطاء در دست خدا است، و آن را به هر کس که بخواهد مرحمت می‌کند، و خداوند دارای فضل و عطاء فراوان و بزرگ است. [[«لِئَلاّ یَعْلَمَ»: تا بدانند. حرف (لا) زائد و برای تأکید نفی است. «أَهْلُ الْکِتَابِ»: مراد کسانی است که به عیسی و سایر پیغمبران ایمان آورده، ولی به پیغمبر اسلام ایمان نداشته و بهشت را منحصر به خود می‌دانستند (نگا: بقره / 111 و 135). «الْفَضْلِ»: موهبت. مرحمت. عطیه. لطف (نگا: بقره / 64 و 105، آل‌عمران / 73 و 74).]]"
          ],
          "fa.khorramshahi": [
            "تا اهل کتاب بدانند که صاحب اختیار چیزی از بخشش و بخشایش الهی نیستند، و بخشش و بخشایش به دست خداوند است، به هر کس که خواهد ارزانی‌اش دارد، و خداوند دارای بخشش بیکران است‌"
          ],
          "fa.makarem": [
            "تا اهل کتاب بدانند که قادر بر چیزی از فضل خدا نیستند، و تمام فضل (و رحمت) به دست اوست، به هر کس بخواهد آن را می‌بخشد؛ و خداوند دارای فضل عظیم است!"
          ],
          "fa.moezzi": [
            "تا بدانند اهل کتاب که توانایی ندارند بر چیزی از فضل خدا و آنکه فضل به دست خدا است دهدش به هر که خواهد و خدا است دارنده فضلی بزرگ‌"
          ],
          "fa.mojtabavi": [
            "تا اهل كتاب- جهودان و ترسايان- بدانند كه بر هيچ چيز از فضل خدا- مانند پيامبرى- توانايى ندارند، و افزونى و بخشش به دست خداست، به هر كه خواهد مى‌دهد. و خدا، داراى فزون‌بخشى بزرگ است."
          ],
          "fa.sadeqi": [
            "تا اهل کتاب ندانند که به هیچ وجه فزون‌بخشی خدا در (حیطه‌ی) قدرت آنان نیست و اینکه بخشایشگری تنها در دست خداست؛ به هرکس بخواهد آن را می‌دهد و خدا دارای فزون‌‌بخشی بسیار است."
          ]
        }
      }
    ]
  },
  "index": "quran:57",
  "kind": "verse_list"
}