{"data": {"crumbs": [{"indexed_titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}, "path": "/books/quran", "titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}}, {"indexed_titles": {"en": "Chapter 58"}, "path": "/books/quran:58", "titles": {"ar": "المجادلة", "en": "The Pleading Woman", "ent": "Al-Mujaadila"}}], "index": 58, "local_index": 58, "order": 105, "part_type": "Chapter", "path": "/books/quran:58", "reveal_type": "Medinan", "rukus": 3, "titles": {"ar": "المجادلة", "en": "The Pleading Woman", "ent": "Al-Mujaadila"}, "verse_count": 22, "verse_start_index": 5104, "verses": [{"index": 5105, "local_index": 1, "part_type": "Verse", "path": "/books/quran:58:1", "text": "قَدْ سَمِعَ‌ اللَّهُ‌ قَوْلَ‌ الَّتِي‌ تُجَادِلُکَ‌ فِي‌ زَوْجِهَا وَ تَشْتَکِي‌ إِلَى‌ اللَّهِ‌ وَ اللَّهُ‌ يَسْمَعُ‌ تَحَاوُرَکُمَا إِنَ‌ اللَّهَ‌ سَمِيعٌ‌ بَصِيرٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "به راستی خدا گفتار [زنی] را که درباره همسرش با تو گفتگو داشت و به خدا شکایت می کرد، شنید و خدا گفتگوی شما را می شنود؛ زیرا خدا شنوا و بیناست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا سخن زنى را كه در باره شوهرش با تو به مجادله آمده است و به خدا شِكوه مى‌كند، شنيد. و خدا گفت و گوى شما را مى‌شنود، زيرا شنوا و بيناست."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "قطعا خدا سخن زنى را كه در باره‌ى شوهرش با تو مجادله مى‌كرد و به خدا شكايت مى‌نمود شنيد، و خدا گفت و گوى شما را مى‌شنود. همانا خدا شنواى بيناست"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "خدا گفتار [زنى‌] را كه در باره شوهرش با تو گفتگو و به خدا شكايت مى‌كرد شنيد؛ و خدا گفتگوى شما را مى‌شنود، زيرا خدا شنواى بيناست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "(ای رسول ما) خدا سخن آن زن را که درباره شوهرش با تو به مجادله برخاسته و شکوه او به خدا می‌برد محققا شنید و گفتگوهای شما را نیز خدا می‌شنود که خدا البته شنوا و بیناست. (اوس بن صامت با زن خود خوله بنت ثعلبه ظهار کرد یعنی گفت: «تو بر من چون مادری». و این کار در حکم طلاق و حرمت آور بود. زن نزد رسول آمد و حکم پرسید. رسول حکم به حرمت فرمود. زن باز مجادله کرد و آخر گفت: من به خدا شکوه می‌کنم از تنهایی و غربت خود. و آیه بعد راجع به حکم ظهار نازل شد و بر این فعل حرام کفّاره معیّن گردید)."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "خداوند گفتار آن زنی را می‌پذیرد که درباره‌ی شوهرش با تو بحث و مجادله می‌کند و به خدا شکایت می‌برد. خدا قطعاً گفتگوی شما دو نفر را می‌شنود، چرا که خدا شنوا و بینا است. [[«قَدْ سَمِعَ»: قطعاً شنید. شنیدن در اینجا به معنی پذیرفتن است. همان گونه که واژه (سَمِعَ) در حالت اعتدال نماز، در جمله سَمِعَ اللهُ لِمَنْ حَمِدَهُ به همین معنی است. آیه‌های نخستین این سوره درباره زنی به نام خَوْلَه است که از طرف شوهرش اوس بن صامت مورد بی‌مهری قرار می‌گیرد و او را ظهار می‌کند که نوعی طلاق غیرقابل بازگشت در زمان جاهلیت بوده است. خَوله به پیش پیغمبر می‌آید و قضیه را مطرح می‌کند و تقاضای رجوع به پیش شوهر پشیمان خود را می‌کند. لیکن رسول خدا بدو می‌فرمایند: تو بر او حرام شده‌ای. در اینجا است که حکم مسأله ظهار به پیغمبر وحی می‌گردد و مشکل خوله برطرف می‌شود. «تَشْتَکِی»: شکایت می‌برد و تقاضای حل مشکل می‌کند. «تَحَاوُرَ»: گفتگو.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "به راستی که خداوند سخن زنی را که با تو درباره همسرش مجادله می‌کرد و به خداوند شکایت حال خود می‌گفت، شنید، و خداوند گفت و گوی شما دو تن را می‌شنود، چرا که خداوند شنوای بیناست‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "خداوند سخن زنی را که درباره شوهرش به تو مراجعه کرده بود و به خداوند شکایت می‌کرد شنید (و تقاضای او را اجابت کرد)؛ خداوند گفتگوی شما را با هم (و اصرار آن زن را درباره حل مشکلش) می‌شنید؛ و خداوند شنوا و بیناست."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "هر آینه شنید خدا سخن آن زن را که با تو ستیزه می‌کرد درباره شویش و داوری می‌خواست از خدا و خدا می‌شنید گفتگوی شما را همانا خدا است شنوای بینا"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "هر آينه خدا سخن آن زن را كه در باره شوى خود با تو گفت‌وگو و چون و چرا مى‌كرد و به خداى ناله و شكايت مى‌نمود شنيد، و خداوند گفت و شنود شما را مى‌شنيد. همانا خدا شنوا و بيناست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "خدا به‌درستی گفته‌ی آن زنی را که درباره‌ی شوهرش با تو مجادله می‌نمود - در حالی‌که سوی خدا شکایت می‌بَرَد – شنید. خدا گفتگوی شما هر دو را می‌شنود. خدا همواره بسی شنوای بسیار بیناست."}, {"lang": "en", "name": "Ahmed Ali", "text": "GOD CERTAINLY HEARD what the woman who argued with you about her husband, said, and complained to God; and God heard your interrogation. Verily God hears all, and sees everything."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Allah has indeed heard the speech of the woman who is arguing with you (O dear Prophet Mohammed – peace and blessings be upon him) concerning her husband, and is complaining to Allah; and Allah hears the conversation of you both; indeed Allah is All Hearing, All Knowing."}, {"lang": "en", "name": "A. J. Arberry", "text": "God has heard the words of her that disputes with thee concerning her husband, and makes complaint unto God. God hears the two of you conversing together; surely God is All-hearing, All-seeing."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Of a surety Allah hath heard the saying of her that disputed with thee concerning her husband and bewailed Unto Allah; and Allah hath heard your mutual discourse. Verlly Allah Is Hearing, Beholding."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Indeed Allah has heard the statement of her (Khaulah bint Tha'labah) that disputes with you (O Muhammad SAW) concerning her husband (Aus bin As-Samit), and complains to Allah. And Allah hears the argument between you both. Verily, Allah is All-Hearer, All-Seer."}, {"lang": "en", "name": "Talal Itani", "text": "God has heard the statement of she who argued with you concerning her husband, as she complained to God. God heard your conversation. God is Hearing and Seeing."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Allah has surely heard the words of her who contends with you concerning her husband and complains to Allah. Allah hears what both of you say. Verily Allah is All- Hearing, All-Seeing."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Indeed Allah has heard the statement of her that disputes with you concerning her husband, and complains to Allah. And Allah hears the argument between you both. Verily, Allah is All-Hearer, All-Seer."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Allah hath heard the saying of her that disputeth with thee (Muhammad) concerning her husband, and complaineth unto Allah. And Allah heareth your colloquy. Lo! Allah is Hearer, Knower."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Allah has certainly heard the speech of her who pleads with you about her husband and complains to Allah. Allah hears the conversation between the two of you. Indeed Allah is all-hearing, all-seeing."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Allah has heard the words of her that reasons with you (Prophet Muhammad) concerning her husband and made her complaint to Allah. Allah has heard both of you discussing with one another. Indeed, Allah is the Hearer, the Seer."}, {"lang": "en", "name": "Saheeh International", "text": "Certainly has Allah heard the speech of the one who argues with you, [O Muhammad], concerning her husband and directs her complaint to Allah. And Allah hears your dialogue; indeed, Allah is Hearing and Seeing."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God has certainly heard the words of the woman who disputed with you about her husband and who (after not having received a favorable response from you) complained to God. God was listening to your argument. He is All-hearing and All-aware."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Allah indeed knows the plea of her who pleads with you about her husband and complains to Allah, and Allah knows the contentions of both of you; surely Allah is Hearing, Seeing."}, {"lang": "en", "name": "English Transliteration", "text": "Qad samiAAa All<u>a</u>hu qawla allatee tuj<u>a</u>diluka fee zawjih<u>a</u> watashtakee il<u>a</u> All<u>a</u>hi wa<b>A</b>ll<u>a</u>hu yasmaAAu ta<u>ha</u>wurakum<u>a</u> inna All<u>a</u>ha sameeAAun ba<u>s</u>eer<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "God has indeed heard the words of the woman who pleads with you about her husband and lays her complaint before God: God hears what the two of you have to say. God is all hearing, all seeing."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Allah has indeed heard (and accepted) the statement of the woman who pleads with thee concerning her husband and carries her complaint (in prayer) to Allah: and Allah (always) hears the arguments between both sides among you: for Allah hears and sees (all things)."}]}, {"index": 5106, "local_index": 2, "part_type": "Verse", "path": "/books/quran:58:2", "text": "الَّذِينَ‌ يُظَاهِرُونَ‌ مِنْکُمْ‌ مِنْ‌ نِسَائِهِمْ‌ مَا هُنَ‌ أُمَّهَاتِهِمْ‌ إِنْ‌ أُمَّهَاتُهُمْ‌ إِلاَّ اللاَّئِي‌ وَلَدْنَهُمْ‌ وَ إِنَّهُمْ‌ لَيَقُولُونَ‌ مُنْکَراً مِنَ‌ الْقَوْلِ‌ وَ زُوراً وَ إِنَ‌ اللَّهَ‌ لَعَفُوٌّ غَفُورٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "کسانی از شما که با زنان خود «ظهار» می کنند [یعنی بر پایه فرهنگ جاهلی می گویند: تو نسبت به من به منزله مادرم هستی، پس آمیزش با تو بر من حرام ابدی است] زنانشان مادرانشان نیستند، مادرانشان فقط زنانی هستند که آنان را زاده اند، و آنان بی تردید سخنی ناپسند و دروغ می گویند و مسلماً خدا بسیار باگذشت و بسیار آمرزنده است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "از ميان شما كسانى كه زنانشان را ظِهار مى‌كنند بدانند كه زنانشان مادرانشان نشوند؛ مادرانشان فقط زنانى هستند كه آنها را زاييده‌اند، و سخنى ناپسند و دروغ است كه مى‌گويند. و خدا از گناهان درگذرنده است و آمرزنده است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "از شما كسانى كه زنانشان را «ظهار» مى‌كنند [و مى‌گويند: تو نسبت به من به منزله مادرم هستى‌] آنها مادرانشان نيستند. مادرانشان تنها كسانى‌اند كه ايشان را زاده‌اند، و قطعا آنها سخنى زشت و باطل مى‌گويند، و البته خدا باگذشت و آمرزنده است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "از ميان شما كسانى كه زنانشان را «ظهار» مى‌كنند [و مى‌گويند: پشت تو چون پشت مادر من است‌] آنان مادرانشان نيستند. مادران آنها تنها كسانى‌اند كه ايشان را زاده‌اند، و قطعاً آنها سخنى زشت و باطل مى‌گويند، و[لى‌] خدا مسلماً درگذرنده آمرزنده است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "کسانی از شما که با زنان خود ظهار کنند آنها مادر حقیقی شوهران نخواهند شد بلکه مادر ایشان جز آن که آنها را زاییده نیست و این مردم سخنی ناپسند و باطل می‌گویند، و خدا را عفو و بخشش بسیار است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کسانی که زنان خود را ظهار می‌کنند (و بدیشان می‌گویند: شما برای ما همسان مادرانمان هستید)، آنان مادرانشان نمی‌گردند، و بلکه مادرانشان تنها زنانی هستند که ایشان را زائیده‌اند. چنین کسانی سخن ناهنجار و دروغی را می‌گویند (چرا که مادر و فرزند بودن، چیزی نیست که با سخن درست شود). خداوند بسیار باگذشت و آمرزگار است (و اگر مسلمانی پیش از نزول این آیات، مرتکب این عمل شده باشد، خداوند او را می‌بخشد). [[«یُظَاهِرُونَ»: ظهار می‌کنند. ظهار عبارت از این است که شوهر به همسر خود بگوید: أَنتِ عَلَیَّ کَظَهْرِ أُمِّی؛ تو برای من مادری. یعنی همان گونه که ازدواج با مادر خودم برایم حرام است، تو نیز تا ابد بر من حرام هستی. این جمله به منزله صیغه طلاق بود. البته ظهار تنها بدین شکل انجام نمی‌گیرد. بلکه تشبیه همسر - به قصد تحریم، نه به قصد تکریم - به یکی از زنانی که برای مرد ازدواج با ایشان حرام باشد، ظهار بشمار است. این تحریم چه از راه نسب باشد و چه از راه شیرخوارگی و یا دامادی. همچنین تشبیه اندام همسر به اندام چنین زنانی چه سراپای او باشد و چه پشت و چه اعضاء دیگر (نگا: المراغی). «زُوراً»: دروغ.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "کسانی که از میان شما با زنانشان ظهار می‌کنند، [بدانند که‌] آن زنان [با این ماجرا در حکم‌] مادران آنان نیستند، مادران آنان جز کسانی که آنان را زاده‌اند، نیستند، و ایشان [با این عمل‌] سخنی ناپسند و ناحق می‌گویند، و بی‌گمان خداوند بخشاینده آمرزگار است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کسانی که از شما نسبت به همسرانشان «ظهار» می‌کنند (و می‌گویند: «أَنتِ عَلیَّ کَظهَرِ أُمّی = تو نسبت به من بمنزله مادرم هستی»)، آنان هرگز مادرانشان نیستند؛ مادرانشان تنها کسانی‌اند که آنها را به دنیا آورده‌اند! آنها سخنی زشت و باطل می‌گویند؛ و خداوند بخشنده و آمرزنده است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آنان که ظهار می‌کنند از شما از زنان خویش نیستند آن زنان مادران ایشان نیستند مادرانشان مگر آنان که زائیدندشان و هر آینه گویند ناپسندی از سخن و دروغی را و همانا خدا است گذشت‌کننده آمرزشگر"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "كسانى از شما كه آنان خويش را ظهار كنند آن زنان مادرانشان نيستند. مادرانشان جز زنانى كه آنان را زاده‌اند نباشند و هر آينه آنان سخنى ناشايست و دروغ مى‌گويند، و خدا درگذرنده و آمرزگار است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "از میان شما کسانی که زنانشان را ظهار می‌کنند، آنان مادرانشان نیستند. مادران(حقیقی) آنان تنها کسانی‌اند که ایشان را زاده‌اند و همانا آنان سخنی ناپسند و دروغ می‌گویند. و خدا به‌راستی و درستی درگذرنده‌ی پوشاننده است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Those of you who divorce your wives by calling them 'mothers,' cannot (make them) their mothers. Their mothers are only those who gave birth to them. They surely utter what is unseemly and a lie. But God is forbearing and forgiving."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Those among you who have proclaimed their wives as their mothers – so their wives are not their mothers; their mothers are only those that gave them birth; and undoubtedly they utter evil and a blatant lie; and indeed Allah is Most Pardoning, Oft Forgiving."}, {"lang": "en", "name": "A. J. Arberry", "text": "Those of you who say, regarding their wives, 'Be as my mother's back,' they are not truly their mothers; their mothers are only those who gave them birth, and they are surely saying a dishonourable saying, and a falsehood. Yet surely God is All-pardoning, All-forgiving."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "As to those among you who put away their wives by pronouncing zihar their mothers they are not. Their mothers are but those who gave them birth; and verily they utter a saying disputable and false. And verily Allah is Pardoning, Forgiving."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Those among you who make their wives unlawful (Az-Zihar) to them by saying to them \"You are like my mother's back.\" They cannot be their mothers. None can be their mothers except those who gave them birth. And verily, they utter an ill word and a lie. And verily, Allah is Oft-Pardoning, Oft-Forgiving."}, {"lang": "en", "name": "Talal Itani", "text": "Those of you who estrange their wives by equating them with their mothers—they are not their mothers. Their mothers are none else but those who gave birth to them. What they say is evil, and a blatant lie. But God is Pardoning and Forgiving."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Those among you who divorce their wives by declaring them to be their mothers, such are not their mothers; none are their mothers except those who gave birth to them. Indeed what they say is highly contemptible and false. Verily Allah is Most Pardoning, Most Forgiving."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Those among you who make their wives unlawful to them by Zihar they cannot be their mothers. None can be their mothers except those who gave them birth. And verily, they utter an ill word and a lie. And verily, Allah is Oft-Pardoning, Oft-Forgiving."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Such of you as put away your wives (by saying they are as their mothers) - They are not their mothers; none are their mothers except those who gave them birth - they indeed utter an ill word and a lie. And lo! Allah is Forgiving, Merciful."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "As for those of you who repudiate their wives by zihar, they are not their mothers; their mothers are only those who bore them, and indeed they utter an outrage and a lie. Indeed Allah is all-excusing, all-forgiving."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Those of you who say to their wives, 'Be as my mother's back' indeed, they are not their mothers. Their mothers are only those who gave birth to them. Indeed they speak dishonorably and falsely. But Allah is the Pardoning, the Forgiving."}, {"lang": "en", "name": "Saheeh International", "text": "Those who pronounce thihar among you [to separate] from their wives - they are not [consequently] their mothers. Their mothers are none but those who gave birth to them. And indeed, they are saying an objectionable statement and a falsehood. But indeed, Allah is Pardoning and Forgiving."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Those who renounce their wives by calling them mothers should know that their wives could never become their mothers. Their mothers are those who have given birth to them. The words that they speak are certainly detestable and sinful. But God is Pardoning and All-forgiving."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "(As for) those of you who put away their wives by likening their backs to the backs of their mothers, they are not their mothers; their mothers are no others than those who gave them birth; and most surely they utter a hateful word and a falsehood and most surely Allah is Pardoning, Forgiving."}, {"lang": "en", "name": "English Transliteration", "text": "Alla<u>th</u>eena yu<i><u>th</u></i><u>a</u>hiroona minkum min nis<u>a</u>ihim m<u>a</u> hunna ommah<u>a</u>tihim in ommah<u>a</u>tuhum ill<u>a</u> all<u>a</u>ee waladnahum wainnahum layaqooloona munkaran mina alqawli wazooran wainna All<u>a</u>ha laAAafuwwun ghafoor<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Those who separate themselves from their wives by pronouncing, \"To me you are like my mother's back,\" must concede that they are not their mothers; none are their mothers except those who gave birth to them -- surely they utter an evil word and a lie. God is pardoning, forgiving."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "If any men among you divorce their wives by Zihar (calling them mothers), they cannot be their mothers: None can be their mothers except those who gave them birth. And in fact they use words (both) iniquitous and false: but truly Allah is one that blots out (sins), and forgives (again and again)."}]}, {"index": 5107, "local_index": 3, "part_type": "Verse", "path": "/books/quran:58:3", "text": "وَ الَّذِينَ‌ يُظَاهِرُونَ‌ مِنْ‌ نِسَائِهِمْ‌ ثُمَ‌ يَعُودُونَ‌ لِمَا قَالُوا فَتَحْرِيرُ رَقَبَةٍ مِنْ‌ قَبْلِ‌ أَنْ‌ يَتَمَاسَّا ذٰلِکُمْ‌ تُوعَظُونَ‌ بِهِ‌ وَ اللَّهُ‌ بِمَا تَعْمَلُونَ‌ خَبِيرٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و کسانی که با زنانشان ظهار می کنند، سپس از آنچه گفته اند برمی گردند، باید پیش از آمیزش با هم برده ای [در راه خدا] آزاد کنند. این [حکمی] است که به آن اندرز داده می شوید، و خدا بر آنچه انجام می دهید، آگاه است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آنهايى كه زنانشان را ظهار مى‌كنند، آنگاه از آنچه گفته‌اند پشيمان مى‌شوند، پيش از آنكه با يكديگر تماس يابند، بايد بنده‌اى آزاد كنند. اين پندى است كه به شما مى‌دهند و خدا به كارهايى كه مى‌كنيد آگاه است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و كسانى كه زنانشان را ظهار مى‌كنند، سپس از گفته خود باز مى‌گردند، بايد پيش از آن كه آميزش كنند، بنده‌اى را آزاد نمايند. اين [حكمى‌] است كه بدان پند داده مى‌شويد، و خدا بدانچه مى‌كنيد آگاه است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و كسانى كه زنانشان را ظهار مى‌كنند، سپس از آنچه گفته‌اند پشيمان مى‌شوند، بر ايشان [فرض‌] است كه پيش از آنكه با يكديگر همخوابگى كنند، بنده‌اى را آزاد گردانند. اين [حكمى‌] است كه بدان پند داده مى‌شويد، و خدا به آنچه انجام مى‌دهيد آگاه است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و آنان که با زنان خود ظهار کنند آن‌گاه از گفته خود برگردند، پیش از تماس و مجامعت باید برده‌ای آزاد کنند. به این عمل پند و موعظه می‌شوید (تا دیگر به این کار حرام اقدام نکنید) و خدا به تمام کردار شما آگاه است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کسانی که زنان خود را ظهار می‌کنند، سپس از آنچه گفته‌اند پشیمان می‌شوند، باید بنده‌ای را آزاد کنند، پیش از آنکه با یکدیگر نزدیکی و آمیزش انجام دهند. این درس و پندی است که به شما داده می‌شود، و خدا آگاه از آن چیزی است که می‌کنید. [[«یَعُودُونَ لِمَا قالُوا»: از گفته خود پشیمان می‌شوند. می‌خواهند جبران سخنی کنند که گفته‌اند. قصد بازگشت به زنان خود را دارند (نگا: التفسیر القرآنی للقرآن). «تَحْرِیرُ رَقَبَةٍ»: (نگا: نساء / 92، مائده / 89). «یَتَمَآسَّا»: مراد از تماس، نزدیکی و آمیزش جنسی، و هرگونه عملی است که منتهی بدان شود. از قبیل: بوسیدن، لمس کردن، در آغوش گرفتن.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و کسانی که با زنانشان ظهار می‌کنند، سپس از آنچه گفته‌اند برمی‌گردند [و می‌خواهند به همسر خود بازگردند] باید پیش از آنکه با همدیگر تماس گیرند، برده‌ای آزاد کنند، این اندرزی است که به شما داده می‌شود، و خداوند به آنچه می‌کنید آگاه است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کسانی که همسران خود را «ظِهار» می‌کنند، سپس از گفته خود بازمی‌گردند، باید پیش از آمیزش جنسی با هم، برده‌ای را آزاد کنند؛ این دستوری است که به آن اندرز داده می‌شوید؛ و خداوند به آنچه انجام می‌دهید آگاه است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنان که ظهار می‌کنند از زنان خویش پس بازمی‌گردند بدانچه گفتند پس آزاد کردن بنده پیش از آنکه به هم نزدیک شوند این را اندرز داده شوید بدان و خدا است بدانچه می‌کنید آگاه‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و كسانى كه زنان خويش را ظهار مى‌كنند و سپس از آنچه گفته‌اند برمى‌گردند- تا آن را بشكنند و به همسر خود بازگردند- پيش از آنكه به هم رسند آزادكردن برده‌اى بايد. اين است كه بدان پند داده مى‌شويد، و خداى بدانچه مى‌كنيد آگاه است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و کسانی که زنانشان را ظهار می‌کنند، سپس از آنچه گفته‌اند برمی‌گردند، پیش از آنکه با یکدیگر همخوابگی کنند آزاد کردن دربندی (برعهده‌ی آنان) است. این (حکمی) است که بدان پند داده می‌شوید و خدا به آنچه انجام می‌دهید بسیار آگاه است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Those who call their wives their mothers then revoke what they had said, should free a slave before having physical contact (with them). This is to warn you, as God is aware of what you do."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And those among you who have proclaimed their wives as their mothers and then wish to revert to the matter upon which they had uttered such an enormous word, must then free a slave before they touch one another; this is what you are advised; and Allah is Aware of your deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "And those who say, regarding their wives, 'Be as my mother's back,' and then retract what they have said, they shall set free a slave, before the two of them touch one another. By that you are admonished; and God is aware of the things you do."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Those who put away their wives by pronouncing zihar and thereafter would retract that which they have said, then upon them is the freeing of a slave before the twain touch each other. That is that wherewith ye are exhorted; and Allah is of whatsoever ye work Aware."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And those who make unlawful to them (their wives) (by Az-Zihar) and wish to free themselves from what they uttered, (the penalty) in that case (is) the freeing of a slave before they touch each other. That is an admonition to you (so that you may not return to such an ill thing). And Allah is All-Aware of what you do."}, {"lang": "en", "name": "Talal Itani", "text": "Those who estrange their wives by equating them with their mothers, then go back on what they said, must set free a slave before they may touch one another. To this you are exhorted, and God is well aware of what you do."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Those who declare their wives to be their mothers and thereafter go back on what they have said shall free a slave before they may touch each other. That is what you are exhorted to do. Allah is fully aware of all your deeds."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And those who make unlawful to them (their wives) by Zihar and wish to free themselves from what they uttered, (the penalty) in that case is the freeing of a slave before they touch each other. That is an admonition to you. And Allah is All-Aware of what you do."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Those who put away their wives (by saying they are as their mothers) and afterward would go back on that which they have said, (the penalty) in that case (is) the freeing of a slave before they touch one another. Unto this ye are exhorted; and Allah is Informed of what ye do."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Those who repudiate their wives by ³ih¡r and then retract what they have said, shall set free a slave before they may touch each other. This you are advised [to carry out], and Allah is well aware of what you do."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Those who say to their wives, 'Be as my mother's back' then retract their words thereafter shall set a person free before they touch each other again. By that you are admonished. Allah is Aware of all that you do."}, {"lang": "en", "name": "Saheeh International", "text": "And those who pronounce thihar from their wives and then [wish to] go back on what they said - then [there must be] the freeing of a slave before they touch one another. That is what you are admonished thereby; and Allah is Acquainted with what you do."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Those who renounce their wives by calling them mothers and then change their minds about what they have said will have to set free a slave as a ransom and only then will their carnal relations be lawful. This is what you have been commanded. God is Well Aware of whatever you do."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And (as for) those who put away their wives by likening their backs to the backs of their mothers then would recall what they said, they should free a captive before they touch each other; to that you are admonished (to conform); and Allah is Aware of what you do."}, {"lang": "en", "name": "English Transliteration", "text": "Wa<b>a</b>lla<u>th</u>eena yu<i><u>th</u></i><u>a</u>hiroona min nis<u>a</u>ihim thumma yaAAoodoona lim<u>a</u> q<u>a</u>loo fata<u>h</u>reeru raqabatin min qabli an yatam<u>a</u>ss<u>a</u> <u>tha</u>likum tooAAa<i><u>th</u></i>oona bihi wa<b>A</b>ll<u>a</u>hu bim<u>a</u> taAAmaloona khabeer<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Those who put away their wives by equating them with their mothers, and then wish to go back on what they have said, must set free a slave before the couple may touch one another again. This is what you are exhorted to do. God is fully aware of what you do,"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "But those who divorce their wives by Zihar, then wish to go back on the words they uttered,- (It is ordained that such a one) should free a slave before they touch each other: Thus are ye admonished to perform: and Allah is well-acquainted with (all) that ye do."}]}, {"index": 5108, "local_index": 4, "part_type": "Verse", "path": "/books/quran:58:4", "text": "فَمَنْ‌ لَمْ‌ يَجِدْ فَصِيَامُ‌ شَهْرَيْنِ‌ مُتَتَابِعَيْنِ‌ مِنْ‌ قَبْلِ‌ أَنْ‌ يَتَمَاسَّا فَمَنْ‌ لَمْ‌ يَسْتَطِعْ‌ فَإِطْعَامُ‌ سِتِّينَ‌ مِسْکِيناً ذٰلِکَ‌ لِتُؤْمِنُوا بِاللَّهِ‌ وَ رَسُولِهِ‌ وَ تِلْکَ‌ حُدُودُ اللَّهِ‌ وَ لِلْکَافِرِينَ‌ عَذَابٌ‌ أَلِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "کسی که توانایی [آزاد کردن برده را] ندارد، باید پیش از آنکه با هم آمیزش کنند، دو ماه پی در پی روزه بگیرد، و هر که نتواند باید شصت مسکین را طعام دهد؛ این حکم برای این است که به خدا و پیامبرش ایمان آورید [و از فرهنگ جاهلی دوری گزینید]؛ و اینها حدود خداست. و برای کافران عذابی دردناک است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اما كسانى كه بنده‌اى نيابند، پيش از آنكه با يكديگر تماس يابند، بايد دو ماه پى در پى روزه بدارند. و آن كه نتواند، شصت مسكين را طعام دهد. و اين بدان سبب است كه به خدا و پيامبرش ايمان بياوريد. اينها حدود خداست. و براى كافران عذابى است دردآور."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و هر كه [برده‌اى‌] نيابد، بايد پيش از آميزش، دو ماه پياپى روزه بدارد، و هر كس نتواند، شصت مستمند را اطعام كند. اين [حكم‌] براى آن است كه به خدا و پيامبرش ايمان بياوريد، و اين حدود خداست، و براى كافران عذابى دردناك است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و آن كس كه [بر آزادكردن بنده‌] دسترسى ندارد، بايد پيش از تماس [با زن خود] دو ماه پياپى روزه بدارد؛ و هر كه نتواند، بايد شصت بينوا را خوراك بدهد. اين [حكم‌] براى آن است كه به خدا و فرستاده او ايمان بياوريد، و اين است حدود خدا. و كافران را عذابى پردرد خواهد بود."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و هر که برده نیابد (یعنی بر آزاد کردن برده توانایی ندارد) باز باید پیش از جماع دو ماه پی در پی روزه بگیرد، و باز اگر نتواند باید شصت مسکین را طعام دهد. این (حکم کفّاره) برای آن است که شما به خدا و رسول او ایمان (کامل) آرید. و این احکام حدود الهی است و کافران را عذاب دردناک دوزخ مهیّاست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "اگر هم کسی بنده‌ای را نیابد و توانائی آزاد کردن او را نداشته باشد، باید دو ماه پیاپی و بدون فاصله روزه بگیرد، پیش از آنکه شوهر و همسر با همدیگر نزدیکی و آمیزش کنند. اگر هم نتوانست، باید شصت نفر فقیر را خوراک دهد. این (قانونگذاری) بدان خاطر است که بگونه‌ی لازم به خدا و پیغمبرش ایمان بیاورید (و برابر دستور اسلام، نه جاهلیّت، زندگی را بسر برید). اینها قوانین و مقرّرات خدا است (و آنها را مراعات دارید. هر که آنها را مراعات نکند و ناچیز انگارد، به سوی کفر رهسپار است) و کافران عذاب دردناکی دارند. [[«مُتَتَابِعَیْنِ»: پیاپی. مراد این است که دو ماه روزه باید بدون فاصله باشد. حتی اگر روزی روزه گرفته نشود، روزهای ماقبل هدر می‌رود و باید دو ماه را تکمیل کند. «ذلِکَ»: این قانونگذاری. این بیان و تعلیم احکام. یادآوری: کفاره ظهار به ترتیب: آزاد کردن بنده، دو ماه روزه گرفتن، و یا شصت نفر فقیر را طعام دادن است. رعایت ترتیب واجب است (نگا: التفسیر القرآنی للقرآن، المراغی).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و هر کس که [امکان آن را] نیافت، باید که پیش از آنکه با همدیگر تماس گیرند، دو ماه پی در پی روزه بگیرد، سپس [بازهم‌] اگر نتوانست [روزه بگیرد]، در آن صورت باید به اطعام شصت فقیر بپردازد، این [کفاره‌] برای آن است که به [امر] خداوند و پیامبر او ایمان آورید، و این احکام الهی است، و برای کافران عذابی دردناک [مقرر] است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و کسی که توانایی (آزاد کردن برده‌ای) نداشته باشد، دو ماه پیاپی قبل از آمیزش روزه بگیرد؛ و کسی که این را هم نتواند، شصت مسکین را اطعام کند؛ این برای آن است که به خدا و رسولش ایمان بیاورید؛ اینها مرزهای الهی است؛ و کسانی که با آن مخالفت کنند، عذاب دردناکی دارند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه نیافت پس روزه دو ماه پی‌درپی پیش از آنکه به هم نزدیک شوند و آنکه نتوانست پس خوراک شصت تن بینوا این تا ایمان آرید به خدا و پیمبرش و این است مرزهای خدا و کافران را است عذابی دردناک‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و هر كه [برده‌] نيابد- يا نتواند-، پس روزه‌داشتن دو ماه پياپى بايد، پيش از آنكه به هم رسند و هر كه نتواند، پس طعام‌دادن شصت مستمند ببايد. اين براى آن است كه به خدا و پيامبرش ايمان آوريد- و دست از احكام جاهليت برداريد- و اين مرزهاى- احكام- خداست، و كافران را عذابى است دردناك."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس کسی که (این را) نمی‌یابد، باید پیش از تماسشان دو ماه پیاپی روزه بدارد و هر که نتواند، خوراندن شصت بینوا برعهده‌ی او است. این (حکم) برای آن است که به خدا و فرستاده‌ی او (درست) ایمان بیاورید و این‌هاست حدود خدا و برای کافران عذابی دردناک است."}, {"lang": "en", "name": "Ahmed Ali", "text": "If one does not have the means (of doing so) then he should fast for two months continuously before he has physical contact; but any one who is unable to do so, should feed sixty needy persons. This (is enjoined) so that you may be faithful to God and His Apostle. These are the limits set by God. As for the unbelievers, there is painful punishment for them."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "So one who cannot find a slave, must then fast for two successive months before they touch one another; and one who cannot even fast, must then feed sixty needy ones; this is in order that you keep faith in Allah and His Noble Messenger; and these are the limits of Allah; and for the disbelievers is a painful punishment."}, {"lang": "en", "name": "A. J. Arberry", "text": "But whosoever finds not the means, then let him fast two successive months, before the two of them touch one another. And if any man is not able to, then let him feed sixty poor persons -- that, that you may believe in God and His Messenger. Those are God's bounds; and for the unbelievers there awaits yet a painful chastisement."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And whosoever findeth not a slave to free on him is the fasting for two months in succession before the twain touch each other, and on him who is not able to do so is the feeding of sixty needy ones. That is in order that ye may believe in Allah and His apostle; and these are the ordinances of Allah. And for the infidels is a torment afflictive."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And he who finds not (the money for freeing a slave) must fast two successive months before they both touch each other. And for him who is unable to do so, he should feed sixty of Miskin (poor). That is in order that you may have perfect Faith in Allah and His Messenger. These are the limits set by Allah. And for disbelievers, there is a painful torment."}, {"lang": "en", "name": "Talal Itani", "text": "But whoever cannot find the means must fast for two consecutive months before they may touch one another. And if he is unable, then the feeding of sixty needy people. This, in order that you affirm your faith in God and His Messenger. These are the ordinances of God. The unbelievers will have a painful punishment."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "And he who does not find a slave (to free), shall fast for two months consecutively before they may touch each other; and he who is unable to do so shall feed sixty needy people. All this is in order that you may truly believe in Allah and His Messenger. These are the bounds set by Allah; and a grievous chastisement awaits the unbelievers."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And he who finds not, must fast two successive months before they both touch each other. And he who is unable to do so, should feed sixty of the poor. That is in order that you may have perfect faith in Allah and His Messenger. These are the limits set by Allah. And for disbelievers, there is a painful torment."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And he who findeth not (the wherewithal), let him fast for two successive months before they touch one another; and for him who is unable to do so (the penance is) the feeding of sixty needy ones. This, that ye may put trust in Allah and His messenger. Such are the limits (imposed by Allah); and for disbelievers is a painful doom."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "He who cannot afford [to free a slave] shall fast for two successive months before they may touch each other. If he cannot [do so], he shall feed sixty needy persons. This, that you may have faith in Allah and His Apostle. These are Allah’s bounds, and there is a painful punishment for the faithless."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "He who is unable shall fast for two successive months before they touch one another. If he is unable to do this, let him feed sixty needy people that, so that you believe in Allah and His Messenger. Such are the bounds of Allah. There is a painful punishment awaiting the unbelievers."}, {"lang": "en", "name": "Saheeh International", "text": "And he who does not find [a slave] - then a fast for two months consecutively before they touch one another; and he who is unable - then the feeding of sixty poor persons. That is for you to believe [completely] in Allah and His Messenger; and those are the limits [set by] Allah. And for the disbelievers is a painful punishment."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "If one cannot set free a slave, he must fast for two consecutive months, and only then can he have lawful carnal relations. If this is also not possible, he must feed sixty destitute people. This is the command of God, so that perhaps you will have faith in God and His Messenger. Such are the Laws of God, and those who disbelieve them will suffer a painful torment."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "But whoever has not the means, let him fast for two months successively before they touch each other; then as for him who is not able, let him feed sixty needy ones; that is in order that you may have faith in Allah and His Apostle, and these are Allah's limits, and the unbelievers shall have a painful punishment."}, {"lang": "en", "name": "English Transliteration", "text": "Faman lam yajid fa<u>s</u>iy<u>a</u>mu shahrayni mutat<u>a</u>biAAayni min qabli an yatam<u>a</u>ss<u>a</u> faman lam yasta<u>t</u>iAA fai<u>t</u>AA<u>a</u>mu sitteena miskeenan <u>tha</u>lika lituminoo bi<b>A</b>ll<u>a</u>hi warasoolihi watilka <u>h</u>udoodu All<u>a</u>hi walilk<u>a</u>fireena AAa<u>tha</u>bun aleem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "and anyone who does not have the means must fast for two consecutive months before they touch each other, and who is not able to do that must feed sixty needy people. That is to affirm your faith in God and His messenger. These are the limits set by God. Those who deny the truth shall have a painful punishment."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "And if any has not (the wherewithal), he should fast for two months consecutively before they touch each other. But if any is unable to do so, he should feed sixty indigent ones, this, that ye may show your faith in Allah and His Messenger. Those are limits (set by) Allah. For those who reject (Him), there is a grievous Penalty."}]}, {"index": 5109, "local_index": 5, "part_type": "Verse", "path": "/books/quran:58:5", "text": "إِنَ‌ الَّذِينَ‌ يُحَادُّونَ‌ اللَّهَ‌ وَ رَسُولَهُ‌ کُبِتُوا کَمَا کُبِتَ‌ الَّذِينَ‌ مِنْ‌ قَبْلِهِمْ‌ وَ قَدْ أَنْزَلْنَا آيَاتٍ‌ بَيِّنَاتٍ‌ وَ لِلْکَافِرِينَ‌ عَذَابٌ‌ مُهِينٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بی تردید کسانی که با خدا و پیامبرش دشمنی و مخالفت می ورزند، خوار و سرنگون می شوند، چنان که کسانی که پیش از آنان بودند، خوار و سرنگون شدند، و همانا ما آیات روشنی نازل کردیم، و برای کافران عذابی خوارکننده است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "كسانى كه با خدا و پيامبرش مخالفت مى‌ورزند ذليل و خوار مى‌شوند، همچنان كه پيشينيانشان خوار شده‌اند. ما آياتى روشن نازل كرديم و كافران را عذابى است خواركننده."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "بى‌گمان كسانى كه با خدا و رسولش دشمنى و مخالفت مى‌كنند خوار و ذليل مى‌شوند، چنان كه پيشينيان آنها خوار و ذليل شدند و همانا آيات روشن [خود] را فرستاده‌ايم، و كافران را عذابى خفت‌بار است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "بى‌گمان، كسانى كه با خدا و فرستاده او مخالفت مى‌كنند ذليل خواهند شد، همان‌گونه كه آنان كه پيش از ايشان بودند ذليل شدند، و به راستى آيات روشن [خود] را فرستاده‌ايم، و كافران را عذابى خفت‌آور خواهد بود."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آنان که با خدا و رسول او سخت مخالفت می‌کنند آنها هم مانند کافران پیش به رو در (آتش عذاب) افتند. و ما آیات روشن بیان نازل کردیم، و کافران را عذاب ذلت و خواری مهیّاست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کسانی که با خدا و پیغمبرش دشمنی می‌کنند، خوار و ذلیل می‌شوند، همان گونه که پیش از ایشان پیشینیان خوار و ذلیل شدند. ما آیات روشن و دلائل متقنی را فرو فرستاده‌ایم (که دالّ بر حق و حقیقت، و واقعیّت و حقّانیّت اسلام هستند. کسانی که بدانها ایمان نیاورند کافرند) و کافران عذاب خوارکننده‌ای دارند. [[«یُحَآدُّونَ»: دشمنی می‌کنند (نگا: توبه / 63). «کُبِتُوا»: خوار و ذلیل گردانده شدند (نگا: آل‌عمران / 127). «مُهِینٌ»: (نگا: بقره / 90، آل‌عمران / 178).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بی‌گمان کسانی که با [امر] خداوند و پیامبر او مخالفت می‌کنند، سرنگون شوند، چنانکه پیشینیانشان هم سرنگون شدند، و به راستی آیاتی روشنگر فرو فرستاده‌ایم، و برای کافران عذابی خفت‌بار [درپیش‌] است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کسانی که با خدا و رسولش دشمنی می‌کنند خوار و ذلیل شدند آن‌گونه که پیشینیان خوار و ذلیل شدند؛ ما آیات روشنی نازل کردیم، و برای کافران عذاب خوارکننده‌ای است..."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "همانا آنان که دشمنی کنند با خدا و پیمبرش سرنگون شوند بدانسان که سرنگون شدند آنان که پیش از ایشان بودند و همانا فرستادیم آیتهائی روشن و کافران را است عذابی خوارکننده‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "همانا كسانى كه با خداى و پيامبر او دشمنى و مخالفت مى‌كنند خوار و نگونسار شوند چنانكه كسانى كه پيش از آنان بودند خوار و نگونسار شدند. و ما آياتى روشن و هويدا فروفرستاديم و كافران را عذابى است خواركننده"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بی‌گمان کسانی که با خدا و فرستاده‌ی او جدایی می‌کنند، ناچار با ذلت (به عقب) برگشت داده شده‌اند؛ همان گونه که آنان که پیش از ایشان بودند چنان شدند. و به‌راستی آیات روشن (خود) را فرستادیم و برای کافران عذابی خفّت‌بار است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Those who oppose God will be disgraced, as those before them were. We have sent down very clear signs. For unbelievers there is a shameful punishment."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Indeed those who oppose Allah and His Noble Messenger have been humiliated, like those before them who were humiliated, and We have indeed sent down clear verses; and for the disbelievers is a disgraceful punishment."}, {"lang": "en", "name": "A. J. Arberry", "text": "Surely those who oppose God and His Messenger shall be frustrated as those before them were frustrated. Now We have sent down signs, clear signs; and for the unbelievers awaits a humbling chastisement,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Verily those who oppose Allah and His apostle shall be abased even as those before them were abased; and of a surety We have sent down manifest signs. And for the infidels will be a torment ignominious."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Verily, those who oppose Allah and His Messenger (Muhammad SAW) will be disgraced, as those before them (among the past nation), were disgraced. And We have sent down clear Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.). And for the disbelievers is a disgracing torment."}, {"lang": "en", "name": "Talal Itani", "text": "Those who oppose God and His Messenger will be subdued, as those before them were subdued. We have revealed clear messages. The unbelievers will have a demeaning punishment."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Verily those who oppose Allah and His Messenger shall be brought low even as those before them were brought low. Surely We have sent down Clear Signs; and a humiliating chastisement awaits the unbelievers;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Verily, those who oppose Allah and His Messenger will be disgraced as those before them were disgraced. And We have sent down clear Ayat. And for the disbelievers is a disgraceful torment."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Lo! those who oppose Allah and His messenger will be abased even as those before them were abased; and We have sent down clear tokens, and for disbelievers is a shameful doom"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Indeed those who oppose Allah and His Apostle will be subdued just as those who passed before them were subdued. We have certainly sent down manifest signs, and there is a humiliating punishment for the faithless."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Those who oppose Allah and His Messenger shall be frustrated just as those before them were frustrated. We have sent down proofs and clear verses, and for the unbelievers, there is a humiliating punishment."}, {"lang": "en", "name": "Saheeh International", "text": "Indeed, those who oppose Allah and His Messenger are abased as those before them were abased. And We have certainly sent down verses of clear evidence. And for the disbelievers is a humiliating punishment."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Those who oppose God and His Messenger will be humiliated like those who lived before. We have sent illustrious revelations and those who disbelieve will suffer a humiliating torment."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Surely those who act in opposition to Allah and His Apostle shall be laid down prostrate as those before them were laid down prostrate; and indeed We have revealed clear communications, and the unbelievers shall have an abasing chastisement."}, {"lang": "en", "name": "English Transliteration", "text": "Inna alla<u>th</u>eena yu<u>ha</u>ddoona All<u>a</u>ha warasoolahu kubitoo kam<u>a</u> kubita alla<u>th</u>eena min qablihim waqad anzaln<u>a</u> <u>a</u>y<u>a</u>tin bayyin<u>a</u>tin walilk<u>a</u>fireena AAa<u>tha</u>bun muheen<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Those who oppose God and His Messenger will be humiliated, as were their predecessors. We have sent down clear revelations. A humiliating punishment awaits those who deny the truth."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Those who resist Allah and His Messenger will be humbled to dust, as were those before them: for We have already sent down Clear Signs. And the Unbelievers (will have) a humiliating Penalty,-"}]}, {"index": 5110, "local_index": 6, "part_type": "Verse", "path": "/books/quran:58:6", "text": "يَوْمَ‌ يَبْعَثُهُمُ‌ اللَّهُ‌ جَمِيعاً فَيُنَبِّئُهُمْ‌ بِمَا عَمِلُوا أَحْصَاهُ‌ اللَّهُ‌ وَ نَسُوهُ‌ وَ اللَّهُ‌ عَلَى‌ کُلِ‌ شَيْ‌ءٍ شَهِيدٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "در روزی که خدا همه آنان را برمی انگیزد، آن گاه به اعمالی که انجام داده اند، آگاهشان می کند، اعمالی که خدا حساب همه آنها را برشمرده است در حالی که [آنان] آن را فراموش کرده اند، و خدا بر هر چیز گواه است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "روزى كه خدا همگان را زنده مى‌كند، آنان را از كارى كه كرده‌اند آگاه مى‌سازد. خدا اعمال آنها را شماره كرده است، هر چند خود از ياد برده‌اند، و خدا ناظر بر هر چيزى است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "روزى كه خداوند همه آنان را برانگيزد و بدانچه كرده‌اند آگاهشان سازد. خدا حساب آن [اعمال‌] را نگه داشته و آنها فراموش كرده‌اند، و خدا بر هر چيزى گواه است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "روزى كه خداوند همه آنان را بر مى‌انگيزد و به آنچه كرده‌اند آگاهشان مى‌گرداند. خدا [كارهايشان را] برشمرده است و حال آنكه آنها آن را فراموش كرده‌اند، و خدا بر هر چيزى گواه است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "در روزی که خدا جمیع خلایق را (برای حساب) برانگیزد تا آنها را به (نتیجه) اعمالشان که او تمام را به شماره ضبط فرموده و آنها فراموش کرده‌اند آگاه سازد، و خدا بر همه موجودات عالم گواه است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "روزی خدا همگان را زنده می‌گرداند و آنان را از کارهائی که کرده‌اند آگاه می‌سازد. کارهائی که ایشان آنها را فراموش کرده‌اند، ولی خداوند آنها را شمارش کرده است (و به حساب آنان گرفته است). خدا حاضر و ناظر بر هر چیزی است. [[«یَبْعَثُهُمْ»: ایشان را زنده می‌گرداند. «أَحْصَاهُ»: آن را شمارش کرده است. مراد دستور به فرشتگان برای ثبت و ضبط اعمال بندگان است (نگا: کهف / 49، یس / 12، زخرف / 80). «شَهِیدٌ»: (نگا: آل‌عمران / 98، انعام / 19، حج / 17).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "روزی که خداوند همگی آنان را [از گور] برانگیزد، سپس آنان را به [حقیقت و نتیجه‌] آنچه کرده‌اند آگاه سازد، خداوند آن را در شمار آورده است اما [خود] آنان فراموشش کرده‌اند، و خداوند بر هر چیز گواه است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "در آن روز که خداوند همه آنها را برمی‌انگیزد و از اعمالی که انجام دادند با خبر می‌سازد، اعمالی که خداوند حساب آن را نگه داشته و آنها فراموشش کردند؛ و خداوند بر هر چیز شاهد و ناظر است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "روزی که برانگیزدشان خدا همگی پس آگهیشان دهد بدانچه کردند بشمردش خدا و فراموشش کردند و خدا است بر همه چیز گواه‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "در روزى كه خداوند همه آنان را بر انگيزد آنگاه بدانچه كرده‌اند آگاهشان سازد، كه خدا آن"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "روزی که خدا همه‌ی آنان را (از گورهاشان) برمی‌انگیزد پس به دستاوردهاشان آگاهی مهمشان می‌دهد. خدا کارشان را به خوبی برشمرده است، حال آنکه آنان، آن را فراموش کرده‌اند. و خدا بر هر چیزی بسی گواه است."}, {"lang": "en", "name": "Ahmed Ali", "text": "On the day when God will raise them up together, He will tell them what they did. God takes account of it although they forget, for all things are evident to God."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "The day when Allah will raise all of them together and inform them of their misdeeds; Allah has kept count of them, whereas they have forgotten them; and all things are present before Allah."}, {"lang": "en", "name": "A. J. Arberry", "text": "upon the day when God shall raise them up all together, then He shall tell them what they did."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "On the Day whereon Allah will raise them all together and declare Unto them that which they have worked. Allah hath taken count thereof, whilst they forget it. And Allah is over everything a Witness."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "On the Day when Allah will resurrect them all together (i.e. the Day of Resurrection) and inform them of what they did. Allah has kept account of it, while they have forgotten it. And Allah is Witness over all things."}, {"lang": "en", "name": "Talal Itani", "text": "On the Day when God resurrects them all, and informs them of what they did. God has kept count of it, but they have forgotten it. God is Witness over everything."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "a chastisement that shall come upon them on the Day when Allah will raise them all to a new life and will inform them of their deeds. Allah has recorded it all while they have forgotten it. Allah is a witness over everything."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "On the Day when Allah will resurrect them all together and inform them of what they did. Allah has kept account of it, while they have forgotten it. And Allah is Witness over all things."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "On the day when Allah will raise them all together and inform them of what they did. Allah hath kept account of it while they forgot it. And Allah is Witness over all things."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "The day when Allah will raise them all together, He will inform them about what they have done. Allah has kept account of it, while they have forgotten, and Allah is witness to all things."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "On the Day when Allah will raise them up all together He will inform them of what they did. Allah has taken count of it, although they have forgotten. Allah is Witness to all things."}, {"lang": "en", "name": "Saheeh International", "text": "On the Day when Allah will resurrect them all and inform them of what they did. Allah had enumerated it, while they forgot it; and Allah is, over all things, Witness."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "On the day when everyone will be resurrected, God will tell them about their deeds which He has recorded in their entirety - while they themselves have forgotten them. God is the witness over all things."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "On the day when Allah will raise them up all together, then inform them of what they did: Allah has recorded it while they have forgotten it; and Allah is a witness of all things."}, {"lang": "en", "name": "English Transliteration", "text": "Yawma yabAAathuhumu All<u>a</u>hu jameeAAan fayunabbiohum bim<u>a</u> AAamiloo a<u>hsa</u>hu All<u>a</u>hu wanasoohu wa<b>A</b>ll<u>a</u>hu AAal<u>a</u> kulli shayin shaheed<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "On the day God raises them all up from the dead, He will make them understand what they have done. God has taken everything into account, even though they have forgotten, for God is a witness to all things."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "On the Day that Allah will raise them all up (again) and show them the Truth (and meaning) of their conduct. Allah has reckoned its (value), though they may have forgotten it, for Allah is Witness to all things."}]}, {"index": 5111, "local_index": 7, "part_type": "Verse", "path": "/books/quran:58:7", "text": "أَ لَمْ‌ تَرَ أَنَ‌ اللَّهَ‌ يَعْلَمُ‌ مَا فِي‌ السَّمَاوَاتِ‌ وَ مَا فِي‌ الْأَرْضِ‌ مَا يَکُونُ‌ مِنْ‌ نَجْوَى‌ ثَلاَثَةٍ إِلاَّ هُوَ رَابِعُهُمْ‌ وَ لاَ خَمْسَةٍ إِلاَّ هُوَ سَادِسُهُمْ‌ وَ لاَ أَدْنَى‌ مِنْ‌ ذٰلِکَ‌ وَ لاَ أَکْثَرَ إِلاَّ هُوَ مَعَهُمْ‌ أَيْنَ‌ مَا کَانُوا ثُمَ‌ يُنَبِّئُهُمْ‌ بِمَا عَمِلُوا يَوْمَ‌ الْقِيَامَةِ إِنَ‌ اللَّهَ‌ بِکُلِ‌ شَيْ‌ءٍ عَلِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آیا ندانسته ای که خدا آنچه را در آسمان ها و آنچه را در زمین است، می داند؟ هیچ گفتگوی محرمانه ای میان سه نفر نیست مگر اینکه او چهارمی آنان است، و نه میان پنج نفر مگر اینکه او ششمی آنان است، و نه کمتر از آن و نه بیشتر مگر اینکه هر کجا باشند او با آنان است، سپس روز قیامت آنان را به اعمالی که انجام داده اند آگاه می کند؛ زیرا خدا به همه چیز داناست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا ندانسته‌اى كه خدا هر چه را در آسمانها و زمين است مى‌داند؟ هيچ سه كس با هم نجوا نكنند مگر آنكه خداوند چهارمين آنهاست و هيچ پنج كس نباشند مگر آنكه خداوند ششمين آنهاست. و نه كمتر از اين -هر جا كه باشند- و نه بيشتر از اين، مگر آنكه خدا با آنهاست. سپس همه را در روز قيامت به كارهايى كه كرده‌اند، آگاه مى‌كند. زيرا خدا بر همه چيز آگاه است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آيا ندانسته‌اى كه خدا آنچه را در آسمان‌ها و آنچه را در زمين است مى‌داند؟ [هيچ‌گاه‌] سه نفر با هم نجوا نمى‌كنند مگر اين كه او چهارمين آنهاست، و نه پنج نفر مگر اين كه او ششمين آنهاست، و نه كمتر از آن و نه بيشتر مگر اين كه هر كجا باشند او با آنهاست. آن‌گ"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آيا ندانسته‌اى كه خدا آنچه را كه در آسمانها و آنچه را كه در زمين است مى‌داند؟ هيچ گفتگوى محرمانه‌اى ميان سه تن نيست مگر اينكه او چهارمين آنهاست، و نه ميان پنج تن مگر اينكه او ششمين آنهاست، و نه كمتر از اين [عدد] و نه بيشتر، مگر اينكه هر كجا باشند او با آنهاست. آنگاه روز قيامت آنان را به آنچه كرده‌اند آگاه خواهد گردانيد، زيرا خدا به هر چيزى داناست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آیا ندیدی که آنچه در آسمانها و زمین است خدا بر آن آگاه است؟ هیچ رازی سه کس با هم نگویند جز آنکه خدا چهارم آنها و نه پنج کس جز آنکه خدا ششم آنها و نه کمتر از آن و نه بیشتر جز آنکه هر کجا باشند او با آنهاست سپس روز قیامت همه را به (نتیجه نیک و بد) اعمالشان آگاه خواهد ساخت که خدا به کلیه امور عالم داناست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "مگر ندیده‌ای که خداوند می‌داند چیزی را که در آسمانها و چیزی را که در زمین است؟ هیچ سه نفری نیست که با همدیگر رازگوئی کنند، مگر این که خدا چهارمین ایشان است، و نه پنج نفری مگر این که او ششمین ایشان است، و نه کمتر از این و نه بیشتر از این، مگر این که خدا با ایشان است در هر کجا که باشند (و رازشان را می‌داند). بعداً خدا در روز قیامت آنان را از چیزهائی که کرده‌اند آگاه می‌سازد. چرا که خدا از هر چیزی باخبر و آگاه است. [[«نَجْوی»: رازگوئی. درگوشی و نهانی صحبت کردن. «خَمْسَةٍ»: عطف بر (ثَلاثةٍ) است. «أَدْنی»: کمتر (نگا: نجم / 9).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آیا نیندیشیده‌ای که خداوند آنچه در آسمانها و آنچه در زمین است می‌داند، هیچ رازگویی سه تن نباشد مگر آنکه او چهارمین آنان است، و نه [رازگویی‌] پنج تن مگر آنکه او ششمین آنان است، و نه کمتر از این و نه بیشتر مگر آنکه او هر جا که باشند با ایشان است، سپس در روز قیامت آنان را به [نتیجه و حقیقت‌] کار و کردارشان آگاه می‌سازد، بی‌گمان خداوند به هر چیزی داناست‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آیا نمی‌دانی که خداوند آنچه را در آسمانها و آنچه را در زمین است می‌داند؛ هیچ گاه سه نفر با هم نجوا نمی‌کنند مگر اینکه خداوند چهارمین آنهاست، و هیچ گاه پنج نفر با هم نجوا نمی‌کنند مگر اینکه خداوند ششمین آنهاست، و نه تعدادی کمتر و نه بیشتر از آن مگر اینکه او همراه آنهاست هر جا که باشند، سپس روز قیامت آنها را از اعمالشان آگاه می‌سازد، چرا که خداوند به هر چیزی داناست!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آیا ننگریستی که خدا داند آنچه در آسمانها و آنچه در زمین است و نیست رازگوئی سه تن جز آنکه او است چهارمیشان و نه پنج تن جز آنکه او است ششمین ایشان و نه کمتر از این و نه بیشتر جز آنکه او است با ایشان هر جا باشند و سپس آگهیشان دهد به آنچه کردند روز رستاخیز همانا خدا است به هر چیزی دانا"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آيا نديده‌اى- ندانسته‌اى- كه خدا آنچه را در آسمانها و آنچه را در زمين است مى‌داند؟ راز گفتن هيچ سه تنى نيست مگر آنكه او چهارم ايشان است، و نه هيچ پنج تنى مگر آنكه او ششم ايشان باشد و نه كمتر از آن و نه بيشتر از آن مگر آنكه او با آنهاست هر جا كه باشند، سپس در روز رستاخيز آنان را بدانچه كرده‌اند آگاه مى‌كند، كه خدا به همه چيز داناست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "آیا ندیدی (که) خدا به‌راستی آنچه را که در آسمان‌ها و آنچه را در زمین است می‌داند؟ هیچ گفتگوی محرمانه‌ای میان سه تن نیست مگر آنکه او چهارمین آن‌ها است و نه پنج تن جز آنکه او ششمین آن‌ها است، و نه کمتر یا بیش‌تر جز آنکه او با آنهاست، هر جا (که) باشند. سپس روز قیامت آنان را به آنچه کرده‌اند آگاهی بس مهم خواهد داد. همواره خدا به هر چیزی بسی داناست."}, {"lang": "en", "name": "Ahmed Ali", "text": "Have you not considered that God knows whatever is in the heavens and the earth? No three persons confer secretly but He is the fourth among them, and no five but He is the sixth; and neither fewer nor more but He is with them wheresoever they be. And on the Day of Judgement He will announce their deeds to them. Verily God has knowledge of everything."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O listener! Did you not see that Allah knows all whatever is in the heavens and all whatever is in the earth? Wherever there is any discussion among three He is the fourth present with them, and among five He is the sixth, and there is no discussion among fewer or more except that He is with them wherever they may be; and then on the Day of Resurrection He will inform them of all what they did; indeed Allah knows all things."}, {"lang": "en", "name": "A. J. Arberry", "text": "God has numbered it, and they have forgotten it. God is witness over everything. Hast thou not seen that God knows whatsoever is in the heavens, and whatsoever is in the earth? Three men conspire not secretly together, but He is the fourth of them, neither five men, but He is the sixth of them, neither fewer than that, neither more, but He is with them, wherever they may be; then He shall tell them what they have done, on the Day of Resurrection. Surely God has knowledge of everything."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Observest thou not that Allah knoweth whatsoever is in the heavens and whatsoever is in the earth! There is no whispering among three but He is their fourth, nor among five but He is their sixth, nor fewer than that nor more but He is with them wheresoever they may be; and thereafter He will declare Unto them, on the Day of Judgment, that which they have worked. Verily Allah is of everything Knower."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Have you not seen that Allah knows whatsoever is in the heavens and whatsoever is on the earth? There is no Najwa (secret counsel) of three, but He is their fourth (with His Knowledge, while He Himself is over the Throne, over the seventh heaven), nor of five but He is their sixth (with His Knowledge), not of less than that or more, but He is with them (with His Knowledge) wheresoever they may be; and afterwards on the Day of Resurrection, He will inform them of what they did. Verily, Allah is the All-Knower of everything."}, {"lang": "en", "name": "Talal Itani", "text": "Do you not realize that God knows everything in the heavens and everything on earth? There is no secret counsel between three, but He is their fourth; nor between five, but He is their sixth; nor less than that, nor more, but He is with them wherever they may be. Then, on the Day of Resurrection, He will inform them of what they did. God has knowledge of everything."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Are you not aware that Allah knows whatever is in the heavens and whatever is in the earth? Never is there any whispering among three but He is their fourth; nor among five but He is their sixth; nor fewer nor more but He is with them wherever they may be. And then He will tell them on the Day of Judgement all that they have done. Surely Allah knows everything."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Have you not seen that Allah knows whatsoever is in the heavens and whatsoever is on the earth There is no Najwa of three but He is their fourth nor of five but He is their sixth nor of less than that or more but He is with them wheresoever they may be. And afterwards on the Day of Resurrection He will inform them of what they did. Verily, Allah is the All-Knower of everything."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Hast thou not seen that Allah knoweth all that is in the heavens and all that is in the earth? There is no secret conference of three but He is their fourth, nor of five but He is their sixth, nor of less than that or more but He is with them wheresoever they may be; and afterward, on the Day of Resurrection, He will inform them of what they did. Lo! Allah is Knower of all things."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Have you not regarded that Allah knows whatever there is in the heavens and whatever there is in the earth? There dost not takes place any secret talk among three, but He is their fourth [companion], nor among five but He is their sixth, nor when they are less than that or more but He is with them wherever they may be. Then He will inform them about what they have done on the Day of Resurrection. Indeed Allah has knowledge of all things."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Have you not seen that Allah knows that which is in the heavens and the earth? There is no secret talk between three but He is the fourth of them; nor between five but He is the sixth of them; nor between fewer or more but He is with them wherever they are. Then, on the Day of Resurrection, He will inform them of what they have done. Surely, Allah has knowledge of all things."}, {"lang": "en", "name": "Saheeh International", "text": "Have you not considered that Allah knows what is in the heavens and what is on the earth? There is in no private conversation three but that He is the fourth of them, nor are there five but that He is the sixth of them - and no less than that and no more except that He is with them [in knowledge] wherever they are. Then He will inform them of what they did, on the Day of Resurrection. Indeed Allah is, of all things, Knowing."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Have you not considered that God knows all that is in the heavens and the earth? There is not a single place wherein any secret counsel can take place between any three people without God being the fourth, nor five people without His being the sixth nor any gathering of more or less people, wherever it may be, without His being with them. On the Day of Judgment, He will tell them about their deeds. God has the knowledge of all things."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Do you not see that Allah knows whatever is in the heavens and whatever is in the earth? Nowhere is there a secret counsel between three persons but He is the fourth of them, nor (between) five but He is the sixth of them, nor less than that nor more but He is with them wheresoever they are; then He will inform them of what they did on the day of resurrection: surely Allah is Cognizant of all things."}, {"lang": "en", "name": "English Transliteration", "text": "Alam tara anna All<u>a</u>ha yaAAlamu m<u>a</u> fee a<b>l</b>ssam<u>a</u>w<u>a</u>ti wam<u>a</u> fee alar<u>d</u>i m<u>a</u> yakoonu min najw<u>a</u> thal<u>a</u>thatin ill<u>a</u> huwa r<u>a</u>biAAuhum wal<u>a</u> khamsatin ill<u>a</u> huwa s<u>a</u>disuhum wal<u>a</u> adn<u>a</u> min <u>tha</u>lika wal<u>a</u> akthara ill<u>a</u> huwa maAAahum ayna m<u>a</u> k<u>a</u>noo thumma yunabbiohum bim<u>a</u> AAamiloo yawma alqiy<u>a</u>mati inna All<u>a</u>ha bikulli shayin AAaleem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Do you not see that God knows all that is in the heavens and on the earth? There is not a secret consultation between three, but He makes the fourth among them -- nor between five but He makes the sixth -- nor between fewer nor more, but He is in their midst, wherever they may be: in the end He will tell them the truth about their conduct, on the Day of Judgement. For God has full knowledge of all things."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Seest thou not that Allah doth know (all) that is in the heavens and on earth? There is not a secret consultation between three, but He makes the fourth among them, - Nor between five but He makes the sixth,- nor between fewer nor more, but He is in their midst, wheresoever they be: In the end will He tell them the truth of their conduct, on the Day of Judgment. For Allah has full knowledge of all things."}]}, {"index": 5112, "local_index": 8, "part_type": "Verse", "path": "/books/quran:58:8", "text": "أَ لَمْ‌ تَرَ إِلَى‌ الَّذِينَ‌ نُهُوا عَنِ‌ النَّجْوَى‌ ثُمَ‌ يَعُودُونَ‌ لِمَا نُهُوا عَنْهُ‌ وَ يَتَنَاجَوْنَ‌ بِالْإِثْمِ‌ وَ الْعُدْوَانِ‌ وَ مَعْصِيَةِ الرَّسُولِ‌ وَ إِذَا جَاءُوکَ‌ حَيَّوْکَ‌ بِمَا لَمْ‌ يُحَيِّکَ‌ بِهِ‌ اللَّهُ‌ وَ يَقُولُونَ‌ فِي‌ أَنْفُسِهِمْ‌ لَوْ لاَ يُعَذِّبُنَا اللَّهُ‌ بِمَا نَقُولُ‌ حَسْبُهُمْ‌ جَهَنَّمُ‌ يَصْلَوْنَهَا فَبِئْسَ‌ الْمَصِيرُ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آیا کسانی را که از گفتگوی محرمانه منع شده بودند، ندیدی؟ که باز به کاری که از آن منع شده بودند باز می گردند، و با یکدیگر از روی گناه و دشمنی و سرپیچی از پیامبر، محرمانه گفتگو می کنند، و هنگامی که نزد تو آیند به صورتی تو را درود می گویند که خدا به تو درود نگفته است، و در دل خود می گویند: چرا خدا ما را به سبب آنچه می گوییم عذاب نمی کند؟! دوزخ برای آنان کافی است، در آن وارد می شوند، و بد بازگشت گاهی است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا آنها را كه از نجوا منع شده بودند نديدى كه كارى را كه از آن منع شده بودند از سر گرفتند و باز هم براى گناه و دشمنى و نافرمانى از پيامبر با هم نجوا مى‌كنند؟ و چون نزد تو مى‌آيند، به گونه‌اى تو را سلام مى‌گويند كه خدا تو را بدان گونه سلام نگفته است، و در دل مى‌گويند: چرا خدا ما را بدانچه مى‌گوييم عذاب نمى‌كند؟ جهنم برايشان كافى است. بدان داخل مى‌شوند، و اين بد سرانجامى است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آيا به كسانى كه از نجوا منع شده بودند نظر نيفكندى كه باز بدانچه از آن منع شده‌اند بر مى‌گردند و به [منظور] گناه و تعدى و مخالفت پيامبر با يكديگر نجوا مى‌كنند و چون نزد تو مى‌آيند تو را بدان شيوه كه خدا سلام و تحيّت نگفته است سلام مى‌دهند و در دل خود م"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آيا كسانى را كه از نجوا منع شده بودند، نديدى كه باز بدانچه از آن منع گرديده‌اند، برمى‌گردند و با همديگر به [منظور] گناه و تعدّى و سرپيچى از پيامبر، محرمانه گفتگو مى‌كنند و چون به نزد تو آيند، تو را بدانچه خدا به آن [شيوه‌] سلام نگفته سلام مى‌دهند و در دلهاى خود مى‌گويند: «چرا به آنچه مى‌گوييم خدا ما را عذاب نمى‌كند؟» جهنم براى آنان كافى است؛ در آن درمى‌آيند، و چه بد سرانجامى است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آیا آنان (یعنی یهود و منافقان) را که از نجوا و راز گفتن با هم ممنوع شدند ندیدی که باز هم با یکدیگر بر بزهکاری و دشمنی و مخالفت رسول راز گفتن از سرگرفتند؟ و هر گاه حضور تو آیند (از مکر و خدیعت) تو را سلام و تحیّتی گویند که خدا نفرموده است و پیش خود می‌گویند: (اگر این شخص رسول خداست) چرا خدا بر این سلام (تمسخر آمیزی) که به او می‌کنیم ما را عذاب نمی‌کند؟! عذاب دوزخ آنها را کفایت است که در آنجا که بسیار بد منزلگاهی است پیوسته معذّب خواهند شد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آیا ندیده‌ای کسانی را که از نجوا نهی شده‌اند، ولی آنان به سوی چیزی برمی‌گردند که از آن نهی گشته‌اند، و برای انجام گناه و دشمنانگی و نافرمانی از پیغمبر، با همدیگر به نجوا می‌پردازند، و هنگامی که به پیش تو می‌آیند بگونه‌ای تو را سلام می‌گویند که خدا تو را بدانگونه سلام نگفته است. در دل به خود می‌گویند: (اگر اعمال ما بد است و خدا می‌داند) پس چرا ما را به خاطر گفته‌هایمان کیفر نمی‌دهد؟! دوزخ بسنده‌ی ایشان است (و نیازی به مجازات دیگر نیست). داخل آن خواهند شد و با آتش آن خواهند سوخت، و چه بد سرانجامی و چه بد جایگاهی است! [[«الَّذِینَ نُهُوا ...»: گروهی از یهودیان و منافقان بودند. «حَیَّوْکَ»: تو را درود می‌گویند. بر تو سلام می‌کنند. «بِمَا لَمْ یُحَیِّکَ بِهِ اللهُ»: با واژه‌هائی به تو سلام می‌کنند که خداوند تو را بدان سلام نگفته است. یهودیان بجای (أَلسَّلامُ عَلَیْکَ) می‌گفتند (أَلسَّامُ عَلَیْکَ): مرگ بر تو! ملامت و خستگی بهره‌ات! «یَقُولُونَ فِی أَنفُسِهِمْ»: در دل به خود می‌گفتند. استهزاءکنان به همدیگر می‌گفتند. «یَصْلَوْنَهَا»: (نگا: ابراهیم / 29، ص / 56).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آیا ننگریسته‌ای در کار کسانی که از نجوا نهی شده‌اند، سپس به آنچه از آن نهی شده‌اند، باز می‌گردند و به گناه و ستمکاری و نافرمانی از پیامبر باهم نجوا می‌کنند، و چون به نزدت آیند به نحوی به تو درود می‌فرستند که خداوند آن گونه به تو درود نفرستاده است، و در دلهایشان گویند چرا به خاطر آنچه می‌گوییم خداوند عذابمان نمی‌کند؟ جهنم برایشان کافی است که به آن اندر آیند، و چه بد سرانجامی است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آیا ندیدی کسانی را که از نجوا [= سخنان درگوشی‌] نهی شدند، سپس به کاری که از آن نهی شده بودند بازمی‌گردند و برای انجام گناه و تعدّی و نافرمانی رسول خدا به نجوا می‌پردازند و هنگامی که نزد تو می‌آیند تو را تحیّتی (و خوشامدی) می‌گویند که خدا به تو نگفته است، و در دل می‌گویند: «چرا خداوند ما را بخاطر گفته‌هایمان عذاب نمی‌کند؟!» جهنم برای آنان کافی است، وارد آن می‌شوند، و چه بد فرجامی است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آیا ننگریستی بدانان که نهی شدند از رازگفتن (آهسته سر به گوشی سخن‌گفتن) پس بازگردند بدانچه نهی شدند از آن و راز گویند به گناه و دشمنی و نافرمانی پیمبر و هر گاه آیندت درودت گویند بدانچه درودت نگفت بدان خدا و گویند پیش خود چرا عذاب نکند ما را خدا بدانچه گوئیم بس است ایشان را دوزخ چشندش پس چه زشت است آن جایگاه‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آيا به كسانى- جهودان و منافقان- ننگريستى كه از رازگفتن بازداشته شدند و سپس بدانچه بازداشته شدند بازمى‌گردند و در باره گناه و ستم و نافرمانى پيامبر با يكديگر راز مى‌گويند، و چون نزد تو آيند تو را درود گويند نه بدان گونه كه خداى درود گفته است، و در دل خود مى‌گويند: چرا خدا ما را بدانچه مى‌گوييم عذاب نمى كند؟! بس است آنها را دوزخ كه بدان در آيند، و بد بازگشتگاهى است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "آیا کسانی را که از نجوا منع شدند، ندیدی (که) سپس به آنچه از آن منع گردیدند بر می‌گردند و با همدیگر به گناه دنباله‌دار و عدوان و عصیان پیامبر، محرمانه گفتگو می‌کنند و هنگامی که نزد تو آیند، تو را بدانچه خدا به آن (شیوه) زنده‌باد نگفته، زنده‌باد می‌گویند و در میان خودشان می‌گویند: «چرا به آنچه می‌گوییم خدا ما را عذاب نمی‌کند؟» جهنم برای آنان کافی است، آن را می‌افروزند. پس چه بد سرانجامی است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Have you not considered those who were forbidden to conspire, but reverted after a time to what was forbidden them, and conspired evil, rebellion and disobedience to the Prophet? Yet when they come to you they greet you with a greeting even God does not greet you with; and say to themselves, \"Why doesn't God punish us for what we say?\" Hell is sufficient for them, in which they will be burnt: And what an evil consequence!"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Did you not see those who were forbidden from conspiracy, yet they do what was forbidden, and consult each other for sinning, and for exceeding limits, and for disobeying the Noble Messenger? And when they come in your presence, they greet you with words not chosen by Allah for respectfully greeting you, and they inwardly say, “Why does not Allah punish us for what we say?”; hell is sufficient for them; they will sink into it; and what a wretched outcome!"}, {"lang": "en", "name": "A. J. Arberry", "text": "Hast thou not regarded those who were forbidden to converse secretly together, then they return to that they were forbidden, and they converse secretly together in sin and enmity, and in disobedience to the Messenger? Then, when they come to thee, they greet thee with a greeting God never greeted thee withal; and they say within themselves, 'Why does God not chastise us for what we say?' Sufficient for them shall be Gehenna, at which they, shall be roasted -- an evil homecoming!"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Observest thou not those who were forbidden whispering and they afterwards returned to that which they had been forbidden; and they whisper Unto each Other of sin, transgression and disobedience reward the apostle! And when they came Unto thee, they greet thee with that wherewith Allah greeteth thee not, and say within themselves: wherefore god tormented us not for that which we say? Sufficient Unto them is Hell, where in they will roast: a hapless destination!"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Have you not seen those who were forbidden to hold secret counsels, and afterwards returned to that which they had been forbidden, and conspired together for sin and wrong doing and disobedience to the Messenger (Muhammad SAW). And when they come to you, they greet you with a greeting wherewith Allah greets you not, and say within themselves: \"Why should Allah punish us not for what we say?\" Hell will be sufficient for them, they will burn therein, and worst indeed is that destination!"}, {"lang": "en", "name": "Talal Itani", "text": "Have you noted those who were prohibited from conspiring secretly, but then reverted to what they were prohibited from? They conspire to commit sin, and aggression, and defiance of the Messenger. And when they come to you, they greet you with a greeting that God never greeted you with. And they say within themselves, “Why does God not punish us for what we say?” Hell is enough for them. They will roast in it. What a miserable destiny!"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Have you not seen those who were forbidden to whisper and yet they engaged in what they had been forbidden? They secretly converse among themselves concerning sin and transgression and disobedience to the Messenger. And when they come to you, they greet you in a manner that Allah does not greet you, and say to themselves: “Why does Allah not chastise us for these utterances of ours?” Hell it is that shall suffice them, and in it will they burn. How woeful is their destination!"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Have you not seen those who were forbidden to hold secret counsels, and afterwards returned to that which they had been forbidden, and conspired together for sin and wrongdoing and disobedience to the Messenger. And when they come to you, they greet you with a greeting wherewith Allah greets you not, and say within themselves: \"Why should Allah punish us not for what we say\" Hell will be sufficient for them; they will enter therein. And worst indeed is that destination!"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Hast thou not observed those who were forbidden conspiracy and afterward returned to that which they had been forbidden, and (now) conspire together for crime and wrongdoing and disobedience toward the messenger? And when they come unto thee they greet thee with a greeting wherewith Allah greeteth thee not, and say within themselves: Why should Allah punish us for what we say? Hell will suffice them; they will feel the heat thereof - a hapless journey's end!"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Have you not regarded those who were forbidden from secret talks but again resumed what they had been forbidden from, and hold secret talks [imbued] with sin and transgression and disobedience to the Apostle? And when they come to you they greet you with words with which Allah never greeted you, and they say to themselves, ‘Why does not Allah punish us for what we say?!’ Let hell suffice them: they shall enter it, and it is an evil destination!"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Have you not seen those who were forbidden to talk in secrecy together? They return to that which they are forbidden and talk secretly together in sin andhatred, and in disobedience to the Messenger. Then, when they come to you they greet you with greetings with which Allah does not greet you, and they say within themselves: 'Why does Allah not punish us for what we say' Gehenna (Hell) suffices them, they shall be roasted, an evil arrival!"}, {"lang": "en", "name": "Saheeh International", "text": "Have you not considered those who were forbidden from private conversation, then they return to that which they were forbidden and converse among themselves about sin and aggression and disobedience to the Messenger? And when they come to you, they greet you with that [word] by which Allah does not greet you and say among themselves, \"Why does Allah not punish us for what we say?\" Sufficient for them is Hell, which they will [enter to] burn, and wretched is the destination."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Have you not seen those who have been forbidden to have secret counsels violate this prohibition and resume their secret counsels for sinful and hostile purposes and to disobey the Messenger? When they come to you (Muhammad), they greet you with a greeting with which even God has not greeted you and say to themselves, \"Why has God not punished us for what we say (if he is a true Prophet)?\" The heat of hell is a sufficient torment for them. This is the most terrible fate."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Have you not seen those who are forbidden secret counsels, then they return to what they are forbidden, and they hold secret counsels for sin and revolt and disobedience to the Apostle, and when they come to you they greet you with a greeting with which Allah does not greet you, and they say in themselves: Why does not Allah punish us for what we say? Hell is enough for them; they shall enter it, and evil is the resort."}, {"lang": "en", "name": "English Transliteration", "text": "Alam tara il<u>a</u> alla<u>th</u>eena nuhoo AAani a<b>l</b>nnajw<u>a</u> thumma yaAAoodoona lim<u>a</u> nuhoo AAanhu wayatan<u>a</u>jawna bi<b>a</b>lithmi wa<b>a</b>lAAudw<u>a</u>ni wamaAA<u>s</u>iyati a<b>l</b>rrasooli wai<u>tha</u> j<u>a</u>ooka <u>h</u>ayyawka bim<u>a</u> lam yu<u>h</u>ayyika bihi All<u>a</u>hu wayaqooloona fee anfusihim lawl<u>a</u> yuAAa<u>thth</u>ibun<u>a</u> All<u>a</u>hu bim<u>a</u> naqoolu <u>h</u>asbuhum jahannamu ya<u>s</u>lawnah<u>a</u> fabisa alma<u>s</u>eer<b>u</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Have you not seen how those who were forbidden to hold secret counsels yet revert to that which they were forbidden to do? And they conspire to indulge in wrongdoing, aggressive behaviour and disobedience to the Messenger. When they come to you, they greet you, but not in the words God would use, and inwardly they wonder, \"Why does God not punish us for what we say?\" Hell will be a fitting punishment for them: they will burn in its flames -- a wretched fate!"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Turnest thou not thy sight towards those who were forbidden secret counsels yet revert to that which they were forbidden (to do)? And they hold secret counsels among themselves for iniquity and hostility, and disobedience to the Messenger. And when they come to thee, they salute thee, not as Allah salutes thee, (but in crooked ways): And they say to themselves, \"Why does not Allah punish us for our words?\" Enough for them is Hell: In it will they burn, and evil is that destination!"}]}, {"index": 5113, "local_index": 9, "part_type": "Verse", "path": "/books/quran:58:9", "text": "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا إِذَا تَنَاجَيْتُمْ‌ فَلاَ تَتَنَاجَوْا بِالْإِثْمِ‌ وَ الْعُدْوَانِ‌ وَ مَعْصِيَةِ الرَّسُولِ‌ وَ تَنَاجَوْا بِالْبِرِّ وَ التَّقْوَى‌ وَ اتَّقُوا اللَّهَ‌ الَّذِي‌ إِلَيْهِ‌ تُحْشَرُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای اهل ایمان! هنگامی که محرمانه با یکدیگر گفتگو می کنید از روی گناه و دشمنی و سرپیچی از پیامبر با هم گفتگوی محرمانه نکنید، و بر پایه [تشویق یکدیگر به] نیکی و تقوا گفتگوی محرمانه کنید، و از خدایی که به سوی او محشور می شوید، پروا کنید."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى كسانى كه ايمان آورده‌ايد، اگر با يكديگر نجوا مى‌كنيد، در باب گناه و دشمنى و نافرمانى از پيامبر نجوا مكنيد، بلكه در باب نيكى و پرهيزگارى نجوا كنيد. از آن خدايى كه همگان نزد او گرد مى‌آييد بترسيد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى كسانى كه ايمان آورده‌ايد! چون با يكديگر نجوا مى‌كنيد، در باب گناه و تعدى و نافرمانى پيامبر نجوا نكنيد، و به نيكوكارى و پرهيزكارى نجوا كنيد، و از خدايى كه به سوى او محشور مى‌شويد پروا بداريد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى كسانى كه ايمان آورده‌ايد، چون با يكديگر محرمانه گفتگو مى‌كنيد، به [قصد] گناه و تعدى و نافرمانى پيامبر با همديگر محرمانه گفتگو نكنيد، و به نيكوكارى و پرهيزگارى نجوا كنيد، و از خدايى كه نزد او محشور خواهيد گشت پروا داريد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "ای کسانی که ایمان آورده‌اید، شما هر گاه با هم، سخنی به راز گویید هرگز بر بزهکاری و دشمنی و مخالفت رسول نگویید بلکه بر نیکویی و تقوا راز به میان آرید و از خدا که به سوی او محشور خواهید شد بترسید و پرهیزکار شوید."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای مؤمنان! هنگامی که به نجوا پرداختید، برای انجام گناه و دشمنانگی و نافرمانی از پیغمبر به نجوا نپردازید، و بلکه درباره‌ی نیکی و پرهیزگاری نجوا کنید، و از خدائی بترسید که در پیشگاه او گردآورده می‌شوید. [[«الْبِرِّ»: خوبی و نیکی. هرچه در آن خیر و صلاح باشد. «التَّقْوی»: مراد ترک معصیت است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای مؤمنان چون رازگویی کنید، به قصد گناه و ستمکاری و نافرمانی از پیامبر نجوا مکنید، و به قصد نیکی و تقوا نجوا کنید، و از خداوندی که نزد او محشور می‌گردید پروا کنید"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای کسانی که ایمان آورده‌اید! هنگامی که نجوا می‌کنید، و به گناه و تعدّی و نافرمانی رسول (خدا) نجوا نکنید، و به کار نیک و تقوا نجوا کنید، و از خدایی که همگی نزد او جمع می‌شوید بپرهیزید!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای آنان که ایمان آوردید گاهی که با هم راز گوئید راز نگوئید به گناه و دشمنی و نافرمانی پیمبر و راز گوئید به نیکوکاری و پرهیزکاری و بترسید خدائی را که بسویش گردآورده شوید"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى كسانى كه ايمان آورده‌ايد، چون با يكديگر راز گوييد رازى مگوييد كه در آن گناه و ستم و نافرمانى پيامبر باشد، و با يكديگر به نيكوكارى و پرهيزگارى راز گوييد. و از خدايى كه به سوى او برانگيخته و فراهم مى‌شويد پروا كنيد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای کسانی که ایمان آوردید! چون با یکدیگر محرمانه گفتگو کنید، به آنچه دارای پیامدی بد و یا تعدّی و نافرمانی پیامبر است با همدیگر محرمانه گفتگو نکنید و به نیکوکاری و پرهیزگاری نجوا کنید و از خدایی که سویش محشور خواهید شد پروا بدارید."}, {"lang": "en", "name": "Ahmed Ali", "text": "O you who believe, when you converse privately, do not talk of iniquity, rebellion, and disobedience to the Prophet, but talk of goodness and piety, and fear God before whom you will be gathered."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O People who Believe! When you consult each other, do not consult for sinning, nor for exceeding limits, nor for disobeying the Noble Messenger – and consult for righteousness and piety; and fear Allah, towards Whom you will be raised."}, {"lang": "en", "name": "A. J. Arberry", "text": "O believers, when you conspire secretly, then conspire not together in sin and enmity and disobedience to the Messenger, but conspire in piety and godfearing. Fear God, unto whom you shall be mustered."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "O ye who believe! when ye whisper together, whisper not of sin, transgression and disobedience toward the apostle; but whisper for virtue and piety. And fear Allah Unto Whom ye will be gathered."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O you who believe! When you hold secret counsel, do it not for sin and wrong-doing, and disobedience towards the Messenger (Muhammad SAW) but do it for Al-Birr (righteousness) and Taqwa (virtues and piety); and fear Allah unto Whom you shall be gathered."}, {"lang": "en", "name": "Talal Itani", "text": "O you who believe! When you converse secretly, do not converse in sin, and aggression, and disobedience of the Messenger; but converse in virtue and piety; And fear God, to Whom you will be gathered."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Believers, when you converse in secrecy, let that not be concerning sin and transgression and disobedience to the Messenger; rather, converse concerning virtue and piety. And fear Allah to Whom all of you shall be mustered."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O you who believe! When you hold secret counsel, do it not for sin and wrongdoing, and disobedience to the Messenger, but do it for Al-Birr and Taqwa; and have Taqwa of Allah unto Whom you shall be gathered."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O ye who believe! When ye conspire together, conspire not together for crime and wrongdoing and disobedience toward the messenger, but conspire together for righteousness and piety, and keep your duty toward Allah, unto whom ye will be gathered."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O you who have faith! When you converse secretly, do not hold private conversations [imbued] with sin and aggression and disobedience to the Apostle, but converse in [a spirit of] piety and Godfearing, and be wary of Allah toward whom you will be gathered."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believers, when you talk in secret do not talk together in sin and hatred, and disobedience towards the Messenger, but talk of piety and caution. Fear Allah before whom you shall be gathered."}, {"lang": "en", "name": "Saheeh International", "text": "O you who have believed, when you converse privately, do not converse about sin and aggression and disobedience to the Messenger but converse about righteousness and piety. And fear Allah, to whom you will be gathered."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Believers, when you hold a secret counsel, let it not be for a sinful, hostile purpose or to disobey the Messenger, but let your counsel take place for virtuous and pious reasons. Have fear of God in whose presence you will all be brought together."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O you who believe! when you confer together in private, do not give to each other counsel of sin and revolt and disobedience to the Apostle, and give to each other counsel of goodness and guarding (against evil); and be careful of (your duty to) Allah, to Whom you shall be gathered together."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo i<u>tha</u> tan<u>a</u>jaytum fal<u>a</u> tatan<u>a</u>jaw bi<b>a</b>lithmi wa<b>a</b>lAAudw<u>a</u>ni wamaAA<u>s</u>iyati a<b>l</b>rrasooli watan<u>a</u>jaw bi<b>a</b>lbirri wa<b>al</b>ttaqw<u>a</u> wa<b>i</b>ttaqoo All<u>a</u>ha alla<u>th</u>ee ilayhi tu<u>h</u>sharoon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believers, when you confer together in private, do not confer in support of sin and transgression and disobedience to the Messenger, but confer for the promotion of virtue and righteousness. Fear God, before whom you shall all be gathered."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O ye who believe! When ye hold secret counsel, do it not for iniquity and hostility, and disobedience to the Prophet; but do it for righteousness and self-restraint; and fear Allah, to Whom ye shall be brought back."}]}, {"index": 5114, "local_index": 10, "part_type": "Verse", "path": "/books/quran:58:10", "text": "إِنَّمَا النَّجْوَى‌ مِنَ‌ الشَّيْطَانِ‌ لِيَحْزُنَ‌ الَّذِينَ‌ آمَنُوا وَ لَيْسَ‌ بِضَارِّهِمْ‌ شَيْئاً إِلاَّ بِإِذْنِ‌ اللَّهِ‌ وَ عَلَى‌ اللَّهِ‌ فَلْيَتَوَکَّلِ‌ الْمُؤْمِنُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "جز این نیست که گفتگوی محرمانه [بی منطق و رازگویی بی دلیل] از [ناحیه] شیطان است تا مؤمنان را اندوهگین کند، ولی نمی تواند هیچ گزندی به آنان برساند مگر به فرمان خدا. و مؤمنان فقط باید بر خدا توکل کنند [که توکل کننده به خدا از گزند شیطان مصون است.]"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "هر آينه نجواكردن كار شيطان است كه مى‌خواهد مؤمنان را محزون كند و حال آنكه هيچ زيانى، جز به فرمان خداوند، به آنها نمى‌رساند. و مؤمنان بايد كه بر خدا توكل كنند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "جز اين نيست كه نجوا از شيطان است، تا كسانى را كه ايمان آورده‌اند محزون كند، ولى جز به اذن خدا هيچ آسيبى به آنها نمى‌رساند، و مؤمنان بايد تنها بر خدا توكل كنند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "چنان نجوايى صرفاً از [القاآت‌] شيطان است، تا كسانى را كه ايمان آورده‌اند دلتنگ گرداند، و[لى‌] جز به فرمان خدا هيچ آسيبى به آنها نمى‌رساند، و مؤمنان بايد بر خدا اعتماد كنند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "همیشه نجوا و راز گفتن از (نفوس شریره) شیطان است که می‌خواهد مؤمنان را دلتنگ و پریشان خاطر کند در صورتی که هیچ زیان به آنها نمی‌رساند جز آنکه امر خدا باشد، و مؤمنان باید همیشه بر خدا توکل کنند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "نجوا تنها از ناحیه‌ی اهریمن است و می‌خواهد مؤمنان را غمگین و اندوهناک سازد! امّا هیچ زیانی نمی‌تواند بدیشان برساند مگر این که اجازه‌ی خدا در میان باشد. پس مؤمنان باید به خدا توکّل کنند و بس. [[«لِیَحْزُنَ»: تا غمگین سازد. باب اوّل است و متعدی. «لَیْسَ بِضَآرِّهِمْ»: شیطان نمی‌تواند بدیشان زیان و ضرری برساند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "جز این نیست که نجوا از سوی شیطان است تا مؤمنان را غمگین کند، و هیچ زیان رسان به آنان نیست، مگر به اذن الهی، و مؤمنان باید فقط بر خداوند توکل کنند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "نجوا تنها از سوی شیطان است؛ می‌خواهد با آن مؤمنان غمگین شوند؛ ولی نمی تواند هیچ گونه ضرری به آنها برساند جز بفرمان خدا؛ پس مؤمنان تنها بر خدا توکّل کنند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "جز این نیست که رازگوئی از شیطان است تا اندوهگین سازد آنان را که ایمان آوردند و نیست زیان‌رساننده آنان به چیزی جز به دستور خدا و بر خدا پس باید توکّل کنند مؤمنان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "جز اين نيست كه راز گفتن- راز بد و بيهوده- از شيطان است تا كسانى را كه ايمان آورده‌اند اندوهگين كند و حال آنكه جز به اذن- علم و خواست- خدا هيچ زيانى به ايشان نمى‌رساند. و مؤمنان بايد بر خدا توكل كنند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "(اینگونه) نجوا بی‌گمان تنها از شیطان است، تا کسانی که ایمان آوردند غمگین شوند. و (این نجوا) جز به اذن خدا هیچ آسیبی به آنان نمی‌رساند. و مؤمنان باید تنها بر خدا اعتماد کنند."}, {"lang": "en", "name": "Ahmed Ali", "text": "Surely scheming is the work of Satan that he may cause the faithful grief; but he cannot harm them unless God dispense. So in God should the believers place their trust."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "The evil consultation is only from the devil in order that he may upset the believers, whereas he cannot harm them in the least without Allah’s command; and only upon Allah must the Muslims rely."}, {"lang": "en", "name": "A. J. Arberry", "text": "Conspiring secretly together is of Satan, that the believers may sorrow; but he will not hurt them anything, except by the leave of God. And in God let the believers put all their trust."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Whisper is only from the Satan that he may grieve those who believe; and he can harm them not at all save with the leave of Allah. Wherefore in Allah let the believers trust."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Secret counsels (conspiracies) are only from Shaitan (Satan), in order that he may cause grief to the believers. But he cannot harm them in the least, except as Allah permits, and in Allah let the believers put their trust."}, {"lang": "en", "name": "Talal Itani", "text": "Conspiracies are from Satan, that he may dishearten those who believe; but he will not harm them in the least, except by leave of God. So let the believers put their trust in God."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Whispering is an act of Satan, one that aims at causing grief to the believers; yet without Allah's leave no harm can be caused to them. So in Allah should the believers put all their trust."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Secret counsels are only from Shaytan, in order that he may cause grief to the believers. But he cannot harm them in the least, except as Allah permits. And in Allah let the believers put their trust."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Lo! Conspiracy is only of the devil, that he may vex those who believe; but he can harm them not at all unless by Allah's leave. In Allah let believers put their trust."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Indeed [malicious] secret talks are from Satan, that he may upset the faithful, but he cannot harm them in any way except by Allah’s leave, and in Allah let all the faithful put their trust."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Talking together maliciously in secret is from satan, so that believers should sorrow, yet he can not harm them at all, except by the permission of Allah. In Allah let the believers put their trust."}, {"lang": "en", "name": "Saheeh International", "text": "Private conversation is only from Satan that he may grieve those who have believed, but he will not harm them at all except by permission of Allah. And upon Allah let the believers rely."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Holding secret counsels for (evil purposes) is a work of satan to cause grief to the believers, but he can do no harm to them except by the will of God. Let the believers trust in God."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Secret counsels are only (the work) of the Shaitan that he may cause to grieve those who believe, and he cannot hurt them in the least except with Allah's permission, and on Allah let the believers rely."}, {"lang": "en", "name": "English Transliteration", "text": "Innam<u>a</u> a<b>l</b>nnajw<u>a</u> mina a<b>l</b>shshay<u>ta</u>ni liya<u>h</u>zuna alla<u>th</u>eena <u>a</u>manoo walaysa bi<u>da</u>rrihim shayan ill<u>a</u> bii<u>th</u>ni All<u>a</u>hi waAAal<u>a</u> All<u>a</u>hi falyatawakkali almuminoon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Conspiracy for evil purposes is the work of Satan, by which he means to bring grief to believers. But he cannot harm them in the least, unless it be by God's leave. Let the believers put their trust in God."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Secret counsels are only (inspired) by the Evil One, in order that he may cause grief to the Believers; but he cannot harm them in the least, except as Allah permits; and on Allah let the Believers put their trust."}]}, {"index": 5115, "local_index": 11, "part_type": "Verse", "path": "/books/quran:58:11", "text": "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا إِذَا قِيلَ‌ لَکُمْ‌ تَفَسَّحُوا فِي‌ الْمَجَالِسِ‌ فَافْسَحُوا يَفْسَحِ‌ اللَّهُ‌ لَکُمْ‌ وَ إِذَا قِيلَ‌ انْشُزُوا فَانْشُزُوا يَرْفَعِ‌ اللَّهُ‌ الَّذِينَ‌ آمَنُوا مِنْکُمْ‌ وَ الَّذِينَ‌ أُوتُوا الْعِلْمَ‌ دَرَجَاتٍ‌ وَ اللَّهُ‌ بِمَا تَعْمَلُونَ‌ خَبِيرٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای مؤمنان! هنگامی که گویند: در مجالس [برای نشستن دیگر برادرانتان] جا باز کنید، پس جا باز کنید، تا خدا برای شما [در بهشت] جا باز کند. و چون گویند: برخیزید، بی درنگ برخیزید تا خدا مؤمنان از شما را به درجه ای و دانشمندانتان را به درجاتی [عظیم و باارزش] بلند گرداند، و خدا به آنچه انجام می دهید، آگاه است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى كسانى كه ايمان آورده‌ايد، چون شما را گويند در مجالس جاى باز كنيد، جاى باز كنيد تا خدا در كار شما گشايش دهد. و چون گويند كه برخيزيد، برخيزيد. خدا آنهايى را كه ايمان آورده‌اند و كسانى را كه دانش يافته‌اند به درجاتى برافرازد، و خدا به كارهايى كه مى‌كنيد آگاه است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى كسانى كه ايمان آورده‌ايد! هرگاه به شما گفته شد در مجلس‌ها [براى برادرانتان‌] جاى باز كنيد، جاى باز كنيد تا خدا براى شما [در بهشت‌] جاى بگشايد. و چون گفته شد برخيزيد، برخيزيد تا خدا كسانى از شما را كه ايمان آورده و كسانى را كه دانش داده شده‌اند رتب"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى كسانى كه ايمان آورده‌ايد، چون به شما گفته شود: «در مجالس جاى باز كنيد»، پس جاى باز كنيد تا خدا براى شما گشايش حاصل كند، و چون گفته شود: «برخيزيد»، پس برخيزيد. خدا [رتبه‌] كسانى از شما را كه گرويده و كسانى را كه دانشمندند [بر حسب‌] درجات بلند گرداند، و خدا به آنچه مى‌كنيد آگاه است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "ای اهل ایمان، هرگاه شما را گفتند که در مجالس خود جای را (بر یکدیگر) فراخ دارید، جای باز کنید (و برای نشستن مکان بالاتر و نزدیک‌تر به پیغمبر تنازع و تزاحم مکنید) تا خدا بر توسعه (مکان و مقام و منزلت) شما بیفزاید و هرگاه گفتند که از جای خود (برای توسعه مجلس یا کار خیر دیگری) برخیزید، برخیزید، تا خدا مقام اهل ایمان و دانشمندان شما را (در دو جهان) رفیع گرداند، و خدا به هر چه کنید به همه آگاه است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای مؤمنان! هنگامی که به شما گفته شد: در مجالس جای باز کنید، جای باز کنید تا خدا در کار شما گشایش دهد، و هنگامی که به شما گفته شد: برخیزید! برخیزید. اگر چنین کنید خداوند به کسانی از شما که ایمان آورده‌اند و بهره از علم دارند، درجات بزرگی می‌بخشد. [[«یَرْفَعِ اللهُ الَّذِینَ آمَنُوا مِنکُمْ، وَالَّذِینَ أُوتُوا الْعِلْمَ دَرَجاتٍ»: عطف (الَّذِینَ أُوتُوا الْعِلْمَ) بر (الَّذِینَ آمَنُوا) از قبیل عطف خاص بر عام است. «تَفَسَّحُوا»: جای باز کنید. جمع و جور بنشینید و برای دیگران جا باز کنید. «أُنشُزُوا»: برخیزید. بلند شوید. مراد برخاستن از مجالس است تا جا برای دیگران پیدا شود.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای مؤمنان چون به شما گفته شود در مجالس جا باز کنید، باز کنید، که خداوند در کار شما گشایش آورد، و چون گفته شود برخیزید، برخیزید، خداوند از میان شما مؤمنان و دانش یافتگان را به درجاتی رفعت دهد و خداوند به آنچه می‌کنید آگاه است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای کسانی که ایمان آورده‌اید! هنگامی که به شما گفته شود: «مجلس را وسعت بخشید (و به تازه‌واردها جا دهید)»، وسعت بخشید، خداوند (بهشت را) برای شما وسعت می‌بخشد؛ و هنگامی که گفته شود: «برخیزید»، برخیزید؛ اگر چنین کنید، خداوند کسانی را که ایمان آورده‌اند و کسانی را که علم به آنان داده شده درجات عظیمی می‌بخشد؛ و خداوند به آنچه انجام می‌دهید آگاه است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای آنان که ایمان آوردید هر گاه گفته شود به شما جای باز کنید در نشستگاه‌ها پس جای دهید تا جای دهد شما را خدا و گاهی که گفته شود برخیزید پس برخیزید بالا برد خدا آنان را که ایمان آوردند از شما و آنان را که داده شدند دانش را پایه هائی و خدا است بدانچه کنید آگاه‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى كسانى كه ايمان آورده‌ايد، چون شما را گويند كه در مجلسها- مجالسى كه با پيامبر"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای کسانی که ایمان آوردید! چون به شما گفته شود: «در مجالس تا اندازه‌ی توان‌(تان برای دیگران) جای بگشایید»، پس جای گشایید، تا خدا برای شما گشایش دهد. و هنگامی که گفته شود: «برخیزید»، برخیزید. تا خدا کسانی از شما را که گرویده و کسانی را که دانش (ایمانی) داده شده‌اند به مراتبی بلند گرداند. و خدا به آنچه می‌کنید بسی آگاه است."}, {"lang": "en", "name": "Ahmed Ali", "text": "O you who believe, when you are told to make room in the assemblies, then make room; God will give you more room to spread. When you are told to rise, then rise; God will raise those of you who believe, and those who have knowledge, in position. God is aware of what you do."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O People who Believe! When you are told to give room in the assemblies, then do give room – Allah will give you room (in His mercy); and when it is said, “Stand up in reverence”, then do stand up – Allah will raise the believers among you, and those given knowledge, to high ranks; and Allah is Aware of your deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "O believers, when it is said to you 'Make room in the assemblies', then make room, and God will make room for you; and when it is said, 'Move up', move up, and God will raise up in rank those of you who believe and have been given knowledge. And God is aware of the things you do."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "O ye who believe! when it is said Unto you: make room in your assemblies, then make room; Allah will make room for you. And when it is said: rise up, then rise up; Allah will exalt those who believe among you and those who are vouchsafed knowledge, in degrees. And Allah is of whatsoever ye work Aware."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O you who believe! When you are told to make room in the assemblies, (spread out and) make room. Allah will give you (ample) room (from His Mercy). And when you are told to rise up [for prayers, Jihad (holy fighting in Allah's Cause), or for any other good deed], rise up. Allah will exalt in degree those of you who believe, and those who have been granted knowledge. And Allah is Well-Acquainted with what you do."}, {"lang": "en", "name": "Talal Itani", "text": "O you who believe! When you are told to make room in your gatherings, make room; God will make room for you. And when you are told to disperse, disperse. God elevates those among you who believe, and those given knowledge, many steps. God is Aware of what you do."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Believers, when you are told: “Make room for one another in your assemblies,” then make room; Allah will bestow amplitude on you. And when it is said: “Rise up,” then rise up; Allah will raise to high ranks those of you who believe and are endowed with knowledge. Allah is well aware of all that you do."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O you who believe! When you are told to make room in the assemblies, make room. Allah will give you room. And when you are told to rise up, then rise up. Allah will exalt in degress those of you who believe, and those who have been granted knowledge. And Allah is Well-Acquainted with what you do."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O ye who believe! when it is said unto you, Make room! in assemblies, then make room; Allah will make way for you (hereafter). And when it is said, Come up higher! go up higher; Allah will exalt those who believe among you, and those who have knowledge, to high ranks. Allah is Informed of what ye do."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O you who have faith! When you are told, ‘Make room,’ in sittings, then do make room; Allah will make room for you. And when you are told, ‘Rise up!’ Do rise up. Allah will raise in rank those of you who have faith and those who have been given knowledge, and Allah is well aware of what you do."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believers, make room in your sitting places when it is asked of you, and Allah will make room for you. When you are asked to move, so move, and Allahwill raise up in ranks those who believed among you and those who have been given knowledge. Allah is Aware of what you do."}, {"lang": "en", "name": "Saheeh International", "text": "O you who have believed, when you are told, \"Space yourselves\" in assemblies, then make space; Allah will make space for you. And when you are told, \"Arise,\" then arise; Allah will raise those who have believed among you and those who were given knowledge, by degrees. And Allah is Acquainted with what you do."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Believers, when you are told to make room in a meeting for others, do so. God will then make room for you. When you are told to disperse, do so. God will raise the position of the believers and of those who have received knowledge. God is Well-Aware of what you do."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O you who believe! when it is said to you, Make room in (your) assemblies, then make ample room, Allah will give you ample, and when it is said: Rise up, then rise up. Allah will exalt those of you who believe, and those who are given knowledge, in high degrees; and Allah is Aware of what you do."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo i<u>tha</u> qeela lakum tafassa<u>h</u>oo fee almaj<u>a</u>lisi fa<b>i</b>fsa<u>h</u>oo yafsa<u>h</u>i All<u>a</u>hu lakum wai<u>tha</u> qeela onshuzoo fa<b>o</b>nshuzoo yarfaAAi All<u>a</u>hu alla<u>th</u>eena <u>a</u>manoo minkum wa<b>a</b>lla<u>th</u>eena ootoo alAAilma daraj<u>a</u>tin wa<b>A</b>ll<u>a</u>hu bim<u>a</u> taAAmaloona khabeer<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believers, if you are told to make room for one another in your assemblies, then do so, and God will make room for you, and if you are told to rise up, do so: God will raise in rank those of you who believe and those who have been given knowledge: He is fully aware of all that you do."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O ye who believe! When ye are told to make room in the assemblies, (spread out and) make room: (ample) room will Allah provide for you. And when ye are told to rise up, rise up Allah will rise up, to (suitable) ranks (and degrees), those of you who believe and who have been granted (mystic) Knowledge. And Allah is well-acquainted with all ye do."}]}, {"index": 5116, "local_index": 12, "part_type": "Verse", "path": "/books/quran:58:12", "text": "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا إِذَا نَاجَيْتُمُ‌ الرَّسُولَ‌ فَقَدِّمُوا بَيْنَ‌ يَدَيْ‌ نَجْوَاکُمْ‌ صَدَقَةً ذٰلِکَ‌ خَيْرٌ لَکُمْ‌ وَ أَطْهَرُ فَإِنْ‌ لَمْ‌ تَجِدُوا فَإِنَ‌ اللَّهَ‌ غَفُورٌ رَحِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای مؤمنان! زمانی که می خواهید با پیامبر گفتگوی محرمانه کنید، پیش از گفتگوی محرمانه خود صدقه دهید، این برای شما بهتر و پاکیزه تر است، و اگر چیزی برای صدقه نیافتید [اجازه دارید محرمانه گفتگو کنید] زیرا خدا بسیار آمرزنده و مهربان است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى كسانى كه ايمان آورده‌ايد، چون خواهيد كه با پيامبر نجوا كنيد، پيش از نجواكردنتان صدقه بدهيد. اين براى شما بهتر و پاكيزه‌تر است. و اگر براى صدقه چيزى نيافتيد، خدا آمرزنده و مهربان است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى كسانى كه ايمان آورده‌ايد! چون [خواستيد] با پيامبر نجوا كنيد، پيش از نجوايتان صدقه‌اى تقديم داريد. اين [كار] براى شما بهتر و پاكيزه‌تر است پس اگر چيزى نيافتيد، بى‌گمان خدا آمرزنده‌ى مهربان است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى كسانى كه ايمان آورده‌ايد، هرگاه با پيامبر [خدا] گفتگوى محرمانه مى‌كنيد، پيش از گفتگوى محرمانه خود صدقه‌اى تقديم بداريد. اين [كار] براى شما بهتر و پاكيزه‌تر است؛ و اگر چيزى نيافتيد بدانيد كه خدا آمرزنده مهربان است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "ای اهل ایمان، هر گاه بخواهید که با رسول سخن سرّی گویید (یا سؤالی کنید) پیش از این کار باید مبلغی صدقه دهید که این صدقه برای شما بهتر و پاکیزه‌تر است (که شما را از سؤالات بی‌جا بر کنار و از بخل و لئامت پاک می‌گرداند) و اگر (از فقر) چیزی (برای صدقه) نیابید در این صورت خدا بسیار آمرزنده و مهربان است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای مؤمنان! هرگاه خواستید با پیغمبر نجوا و رازگوئی کنید، پیش از نجوای خود، صدقه‌ای بدهید. این کار برای شما بهتر و پاکیزه‌تر (برای زدودن حبّ مال از دلها) است. اگر هم چیزی را نیافتید (که با آن صدقه را انجام دهید) خداوند آمرزگار و مهربان است. [[«بَیْنَ یَدَیْ ...»: قبل از. پیشاپیش. «صَدَقَةً»: احسانی. بخششی. علت دادن صدقه پیش از گفتگوی نهانی با پیغمبر این بود که بسیاری از اعراب برای کسب افتخار همدمی، و تظاهر به تقرب بدان حضرت، بدون نیاز تقاضای نجوا و رازگوئی می‌کردند. به وسیله چنین صدقه‌ای، این کار تقلیل پذیرفت و پروردگار مهربان، آن را از میان برداشت (نگا: المصحف المیسر، روح المعانی). پرداخت چنین صدقه‌ای چه بسا آزمون موقتی برای گروه ویژه‌ای در آن مقطع تاریخی بوده است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای مؤمنان چون خواهید که با پیامبر راز گویید، پیش از نجوایتان صدقه‌ای تقدیم دارید این برای شما بهتر و پاکیزه‌تر است، اما اگر چیزی نیافتید، بی‌گمان خداوند آمرزگار مهربان است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای کسانی که ایمان آورده‌اید! هنگامی که می‌خواهید با رسول خدا نجوا کنید (و سخنان درگوشی بگویید)، قبل از آن صدقه‌ای (در راه خدا) بدهید؛ این برای شما بهتر و پاکیزه‌تر است و اگر توانایی نداشته باشید، خداوند غفور و رحیم است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای آنان که ایمان آوردید هر گاه راز گوئید با پیمبر پس پیش فرستید پیش روی رازگفتن خویش صدقه این بهتر است شما را و پاکتر پس اگر نداشتید همانا خدا است آمرزنده مهربان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى كسانى كه ايمان آورده‌ايد، چون [خواهيد كه‌] با پيامبر راز گوييد، پيش از رازگفتن خود صدقه‌اى بدهيد. اين براى شما بهتر و پاكتر است. پس اگر [صدقه‌اى‌] نيافتيد، همانا خدا آمرزگار و مهربان است- مى‌توانيد بى‌صدقه راز گوييد-."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای کسانی که ایمان آوردید! هنگامی که با پیامبر گفتگویی محرمانه می‌کنید، پیش از گفتگوی محرمانه‌ی خود صدقه‌ای پیشکش کنید. این برای شما بهتر و پاکیزه‌تر است. پس اگر چیزی نیافتید خدا بسی پوشنده‌ی رحمتگر بر ویژگان است."}, {"lang": "en", "name": "Ahmed Ali", "text": "O you who believe, if you confer with the Prophet in private, give alms in the name of God before you go to confer. This is better for you and becoming. If you do not have the means, then surely God is forgiving and kind."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O People who Believe! When you wish to humbly consult with the Noble Messenger, give some charity before you consult; that is much better and much purer for you; so if you do not have the means, then (know that) Allah is Oft Forgiving, Most Merciful."}, {"lang": "en", "name": "A. J. Arberry", "text": "O believers, when you conspire with the Messenger, before your conspiring advance a freewill offering; that is better for you and purer. Yet if you find not means, God is All-forgiving, All-compassionate."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "O ye who believe! when ye go to whisper with the apostle, offer alms before your whispering; that is better for you and purer. Then if ye find not the wherewith, then verily Allah is Forgiving, Merciful."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O you who believe! When you (want to) consult the Messenger (Muhammad SAW) in private, spend something in charity before your private consultation. That will be better and purer for you. But if you find not (the means for it), then verily, Allah is Oft-Forgiving, Most Merciful."}, {"lang": "en", "name": "Talal Itani", "text": "O you who believe! When you converse privately with the Messenger, offer something in charity before your conversation. That is better for you, and purer. But if you do not find the means—God is Forgiving and Merciful."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Believers, when you come to the Messenger for private consultation, offer some charity before your consultation with him. That is better for you and more conducive to purity. But if you find nothing to offer in charity, then know that Allah is Most Merciful, Most Compassionate."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O you who believe! When you (want to) consult the Messenger in private, spend something in charity before your private consultation. That will be better and purer for you. But if you find not (the means for it), then verily, Allah is Oft-Forgiving, Most Merciful."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O ye who believe! When ye hold conference with the messenger, offer an alms before your conference. That is better and purer for you. But if ye cannot find (the wherewithal) then lo! Allah is Forgiving, Merciful."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O you who have faith! When you converse privately with the Apostle, offer a charity before your private talk. That is better for you and purer. But if you cannot afford [to make the offering], then Allah is indeed all-forgiving, all-merciful."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believers, when you consult with the Messenger, present before your consultation a free will offering. That is best and purest for you. But if you lack themeans, Allah is the Forgiver and the Most Merciful."}, {"lang": "en", "name": "Saheeh International", "text": "O you who have believed, when you [wish to] privately consult the Messenger, present before your consultation a charity. That is better for you and purer. But if you find not [the means] - then indeed, Allah is Forgiving and Merciful."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Believers, whenever you consult the Prophet, offer charity before your consultation. This will be better for you and more pure. However, if you do not find anything to give in charity, then God is All-forgiving and All-merciful."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O you who believe! when you consult the Apostle, then offer something in charity before your consultation; that is better for you and purer; but if you do not find, then surely Allah is Forgiving, Merciful."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo i<u>tha</u> n<u>a</u>jaytumu a<b>l</b>rrasoola faqaddimoo bayna yaday najw<u>a</u>kum <u>s</u>adaqatan <u>tha</u>lika khayrun lakum waa<u>t</u>haru fain lam tajidoo fainna All<u>a</u>ha ghafoorun ra<u>h</u>eem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believers, when you come to consult the Messenger privately, give something in charity beforehand. That is best for you and most conducive to purity. But if you cannot find anything to give, know that God is Forgiving and Merciful."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O ye who believe! When ye consult the Messenger in private, spend something in charity before your private consultation. That will be best for you, and most conducive to purity (of conduct). But if ye find not (the wherewithal), Allah is Oft-Forgiving, Most Merciful."}]}, {"index": 5117, "local_index": 13, "part_type": "Verse", "path": "/books/quran:58:13", "text": "أَ أَشْفَقْتُمْ‌ أَنْ‌ تُقَدِّمُوا بَيْنَ‌ يَدَيْ‌ نَجْوَاکُمْ‌ صَدَقَاتٍ‌ فَإِذْ لَمْ‌ تَفْعَلُوا وَ تَابَ‌ اللَّهُ‌ عَلَيْکُمْ‌ فَأَقِيمُوا الصَّلاَةَ وَ آتُوا الزَّکَاةَ وَ أَطِيعُوا اللَّهَ‌ وَ رَسُولَهُ‌ وَ اللَّهُ‌ خَبِيرٌ بِمَا تَعْمَلُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آیا ترسیدید از اینکه پیش از گفتگوی محرمانه خود صدقاتی بپردازید؟ پس چون نپرداختید و خدا هم توبه شما را پذیرفت، پس نماز را برپا دارید و زکات بدهید و از خدا و پیامبرش اطاعت کنید، و خدا به اعمالی که انجام می دهید، آگاه است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا ترسيديد پيش از نجوا كردن صدقه‌ها بدهيد؟ حال كه صدقه نداده‌ايد و خدا هم توبه شما را پذيرفته است، پس نماز بگزاريد و زكات بدهيد و از خدا و پيامبرش اطاعت كنيد، كه خدا به كارهايى كه مى‌كنيد آگاه است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آيا [از فقر] ترسيديد كه پيش از نجوايتان صدقه‌هايى بدهيد؟ پس حالا كه عمل نكرديد و خدا هم بر شما بخشود، نماز برپا داريد و زكات دهيد و خدا و رسول او را اطاعت كنيد، و خدا به آنچه مى‌كنيد آگاه است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آيا ترسيديد كه پيش از گفتگوى محرمانه خود صدقه‌هايى تقديم داريد؟ و چون نكرديد و خدا [هم‌] بر شما بخشود، پس نماز را برپا داريد و زكات را بدهيد و از خدا و پيامبر او فرمان بريد، و خدا به آنچه مى‌كنيد آگاه است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آیا از اینکه پیش از راز گفتن با رسول صدقه دهید (از فقر) ترسیدید؟ پس حال که اداء صدقه نکردید و خدا هم شما را بخشید اینک نماز به پا دارید و زکات بدهید و خدا و رسول او را اطاعت کنید، و خدا به هر چه کنید آگاه است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آیا می‌ترسید که پیشاپیش نجوای خود صدقه‌هائی را بدهید (و مخارجی برای خود تولید کنید؟!). حال که چنین کاری را نکرده‌اید و خداوند هم شما را بخشیده است (و این رنج را از دوش شما برداشته است و اجازه داده است بدون دادن صدقه با پیغمبر به نجوا بپردازید) پس نماز را چنانکه باید بخوانید و زکات مال بدر کنید و از خدا و پیغمبرش فرمانبرداری نمائید. ایزد آگاه از همه‌ی کارهائی است که می‌کنید. [[«أَشْفَقْتُمْ»: ترسیدید.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "[سپس که کسی جز علی ع توفیق نیافت فرمود] آیا ترسیدید که پیش از نجوایتان صدقاتی تقدیم دارید؟ حال که چنین نکردید و خداوند هم از شما درگذشت، پس نماز را برپا دارید و زکات را بپردازید و از خداوند و پیامبرش اطاعت کنید، و خداوند به آنچه می‌کنید آگاه است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آیا ترسیدید فقیر شوید که از دادن صدقات قبل از نجوا خودداری کردید؟! اکنون که این کار را نکردید و خداوند توبه شما را پذیرفت، نماز را برپا دارید و زکات را ادا کنید و خدا و پیامبرش را اطاعت نمایید و (بدانید) خداوند از آنچه انجام می‌دهید با خبر است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آیا ترسیدید که پیش پردازید پیش روی رازگوئی خویش صدقه‌هائی اکنون که نکردید و توبه کرد خدا بر شما پس بپای دارید نماز را و بدهید زکات را و فرمان برید خدا و پیمبرش را و خدا است بدانچه کنید آگاه‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آيا ترسيديد كه پيش از رازگفتن خود صدقه‌ها بدهيد؟! پس چون نكرديد- يعنى نتوانستيد كرد و از دل و دستتان برنيامد- و خدا هم [به بخشايش خويش‌] بر شما بازگشت- اين حكم را برداشت-، پس نماز را برپا داريد و زكات بدهيد و خدا و پيامبر او را فرمان بريد و خدا بدانچه مى‌كنيد آگاه است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "آیا با بزرگداشت (حضرتش) ترسیدید که پیش از گفتگوی محرمانه‌ی خود صدقه‌هایی تقدیم دارید؟ پس چون (چنان) نکردید و خدا (هم) بر شما بازگشت (کرد)، پس نماز را بر پا بدارید و زکات را بدهید و خدا و پیامبرش را فرمان برید. و خدا به آنچه می‌کنید بسی آگاه است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Are you afraid of giving alms before confering? Then, if you cannot do this, and God forgives you, be constant in your devotional obligations and pay the due share of your wealth for the welfare of others, and obey God and His Prophet. God is aware of all you do."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Were you afraid to offer charity before you consult? So when you did not do this, and Allah has inclined towards you with His mercy, keep the prayers established and pay the obligatory charity and obey Allah and His Noble Messenger; and Allah is Aware of your deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "Are you afraid, before your conspiring, to advance freewill offerings? If you do not so, and God turns again unto you, then perform the prayer, and pay the alms, and obey God and His Messenger. God is aware of the things you do."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Shrink ye at your offering the alms before your whispering! Then, when ye could do it not, and Allah relented toward you, establish prayer and pay the poor-rate and obey Allah and His apostle. And Allah is Aware of that which ye work."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Are you afraid of spending in charity before your private consultation (with him)? If then you do it not, and Allah has forgiven you, then (at least) perform As-Salat (Iqamat-as-Salat) and give Zakat and obey Allah (i.e. do all what Allah and His Prophet SAW order you to do). And Allah is All-Aware of what you do."}, {"lang": "en", "name": "Talal Itani", "text": "Are you reluctant to offer charity before your conversation? If you do not do so, and God pardons you, then perform the prayer, and give alms, and obey God and His Messenger. God is Aware of what you do."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Are you afraid that you will have to offer charity when you hold private conversation with the Prophet? But if you are unable to do so and Allah pardons you, then establish Prayer and pay Zakah, and obey Allah and His Messenger. Allah is well aware of all that you do."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Are you afraid of spending in charity before your private consultation (with him) If then you do it not, and Allah has forgiven you, then perform Salah and give Zakah and obey Allah and His Messenger. And Allah is All-Aware of what you do."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Fear ye to offer alms before your conference? Then, when ye do it not and Allah hath forgiven you, establish worship and pay the poor-due and obey Allah and His messenger. And Allah is Aware of what ye do."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Were you dismayed by having to offer charities before your private talks? Since you did not do it, and Allah has excused you [for not be able to comply], now maintain the prayer and pay the zakat, and obey Allah and His Apostle. Allah is well aware of what you do."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Are you afraid to offer a freewill offering before your consultation? But if you do not, Allah will turn to you again, then establish the prayer and pay theobligatory charity, and be obedient to Allah and His Messenger. Allah is Aware of what you do."}, {"lang": "en", "name": "Saheeh International", "text": "Have you feared to present before your consultation charities? Then when you do not and Allah has forgiven you, then [at least] establish prayer and give zakah and obey Allah and His Messenger. And Allah is Acquainted with what you do."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Were you afraid that giving in charity before your consultation would make you poor? Since you did not offer such charity, God forgave you for this. At least be steadfast in prayer, pay the religious tax, and obey God and His Messenger. God is Well Aware of what you do."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Do you fear that you will not (be able to) give in charity before your consultation? So when you do not do it and Allah has turned to you (mercifully), then keep up prayer and pay the poor-rate and obey Allah and His Apostle; and Allah is Aware of what you do."}, {"lang": "en", "name": "English Transliteration", "text": "Aashfaqtum an tuqaddimoo bayna yaday najw<u>a</u>kum <u>s</u>adaq<u>a</u>tin fai<u>th</u> lam tafAAaloo wat<u>a</u>ba All<u>a</u>hu AAalaykum faaqeemoo a<b>l</b><u>ss</u>al<u>a</u>ta wa<u>a</u>too a<b>l</b>zzak<u>a</u>ta waa<u>t</u>eeAAoo All<u>a</u>ha warasoolahu wa<b>A</b>ll<u>a</u>hu khabeerun bim<u>a</u> taAAmaloon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Do you fear that you will not [be able to] give in charity before your consultation? Then if you are unable to do so, [know that] God has turned to you in His mercy; then observe your prayers and pay the prescribed alms and obey God and His Messenger. God is aware of all that you do."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Is it that ye are afraid of spending sums in charity before your private consultation (with him)? If, then, ye do not so, and Allah forgives you, then (at least) establish regular prayer; practise regular charity; and obey Allah and His Messenger. And Allah is well-acquainted with all that ye do."}]}, {"index": 5118, "local_index": 14, "part_type": "Verse", "path": "/books/quran:58:14", "text": "أَ لَمْ‌ تَرَ إِلَى‌ الَّذِينَ‌ تَوَلَّوْا قَوْماً غَضِبَ‌ اللَّهُ‌ عَلَيْهِمْ‌ مَا هُمْ‌ مِنْکُمْ‌ وَ لاَ مِنْهُمْ‌ وَ يَحْلِفُونَ‌ عَلَى‌ الْکَذِبِ‌ وَ هُمْ‌ يَعْلَمُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آیا به کسانی که قوم مورد خشم خدا را به دوستی گرفتند، ننگریستی؟ اینان نه از شمایند و نه از آنان، و به دروغ سوگند می خورند [که از شمایند] و خود آگاهند [که دروغ می گویند.]"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا نديده‌اى آن كسان را كه با مردمى كه خدا بر آنها خشم گرفته بود، دوستى ورزيدند؟ اينان نه از شمايند و نه از ايشان. و خود مى‌دانند كه بر دروغ سوگند مى‌خوردند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آيا نديدى كسانى را كه قومى را دوست گرفتند كه خدا بر آنها خشم گرفته است؟ اينان نه از شما هستند و نه از آنها، و به دروغ سوگند مى‌خورند [كه با شمايند] و خود مى‌دانند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آيا نديده‌اى كسانى را كه قومى را كه مورد خشم خدايند به دوستى گرفته‌اند؟ آنها نه از شمايند و نه از ايشان، و به دروغ سوگند ياد مى‌كنند و خودشان [هم‌] مى‌دانند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آیا آن (منافق) مردمی را ندیدی که با (یهود) قومی که خدا بر آنها غضب کرده است دوستی کردند؟ آنها به حقیقت نه از شما مسلمین و نه از فرقه یهودند و به دروغ قسم یاد می‌کنند (که ما اهل ایمانیم) در صورتی که خود می‌دانند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آیا آگاهی از کسانی که گروهی را به دوستی می‌گیرند که خدا بر آنان خشمگین است. اینان (منافقانی بیش نبوده و) نه از شمایند و نه از آنانند. چنین کسانی بگونه‌ی آگاهانه سوگند دروغ یاد می‌کنند! [[«تَوَلَّوْا»: به دوستی گرفتند. مراد منافقان است (نگا: حشر / 11). «هُمْ»: ایشان که منافقانند (نگا: نساء / 143). «وَ هُمْ یَعْلَمُونَ»: در حالی که می‌دانند که دروغ می‌گویند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آیا ننگریسته‌ای کسانی را که با قومی که خداوند بر آنان خشم آورده است، و نه از شما هستند و نه از آنان [یهودیان‌]، دوستی ورزیده‌اند؟ و آگاهانه به دروغ سوگند می‌خورند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آیا ندیدی کسانی را که طرح دوستی با گروهی که مورد غضب خدا بودند ریختند؟! آنها نه از شما هستند و نه از آنان! سوگند دروغ یاد می‌کنند (که از شما هستند) در حالی که خودشان می‌دانند (دروغ نمی‌گویند)!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آیا ننگریستی بدانان که دوستی کردند با گروهی که خشم گرفت خدا بر ایشان نیستند ایشان از شما و نه از ایشان و سوگند یاد کنند بر دروغ و خود می‌دانند"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آيا به كسانى ننگريستى كه با مردمى كه خدا بر آنها خشم گرفته است- يعنى جهودان- دوستى داشتند؟ اينان- منافقان- نه از شمايند و نه از آنها، و به دروغ سوگند مى‌خورند [كه ما با شماييم‌] و خود مى‌دانند [كه دروغ مى‌گويند]،"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "آیا کسانی را ننگریسته‌ای که گروهی را که خدا بر آنان خشم کرده به دوستی گرفته‌اند؟ آنان نه از شمایند و نه از ایشان و به دروغ سوگند یاد می‌کنند در حالی که خودشان (هم) می‌دانند."}, {"lang": "en", "name": "Ahmed Ali", "text": "Have you not seen those who have taken a people who have roused the wrath of God, as friends? They are neither of you nor of them, and swear to a lie, and knowingly."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Did you not see those who befriended those upon whom is Allah’s wrath? They are neither of you nor of these – and they swear a false oath, whereas they know."}, {"lang": "en", "name": "A. J. Arberry", "text": "Hast thou not regarded those who have taken for friends a people against whom God is wrathful? They belong neither to you nor to them; and they swear upon falsehood, and that wittingly."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Beholdest thou not those who take for friends a people with whom Allah is angered? They are neither of you nor of them, and they swear to a lie while they know."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Have you (O Muhammad SAW) not seen those (hypocrites) who take for friends a people upon whom is the Wrath of Allah (i.e. Jews)? They are neither of you (Muslims) nor of them (Jews), and they swear to a lie while they know."}, {"lang": "en", "name": "Talal Itani", "text": "Have you considered those who befriended a people with whom God has become angry? They are not of you, nor of them. And they swear to a lie while they know."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Do you not see those who took for friends a people whom Allah is wroth with? They neither belong to you nor you to them. They swear to a falsehood, and they do so knowingly."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Have you not seen those who take as friends a people upon whom is the wrath of Allah They are neither of you nor of them, and they swear to a lie while they know."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Hast thou not seen those who take for friends a folk with whom Allah is wroth? They are neither of you nor of them, and they swear a false oath knowingly."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Have you not regarded those who befriend a people at whom Allah is wrathful? They neither belong to you, nor to them, and they swear false oaths [that they are with you] and they know."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Do you see those who have been guided by a nation that incurred the Wrath of Allah? They belong neither to you, nor to them, and knowingly they swear to lies."}, {"lang": "en", "name": "Saheeh International", "text": "Have you not considered those who make allies of a people with whom Allah has become angry? They are neither of you nor of them, and they swear to untruth while they know [they are lying]."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Have you not seen those who have established friendship with the people who are subject to the wrath of God? They do not belong to you nor you to them, yet they knowingly try to prove their point by using false oaths."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Have you not seen those who befriend a people with whom Allah is wroth? They are neither of you nor of them, and they swear falsely while they know."}, {"lang": "en", "name": "English Transliteration", "text": "Alam tara il<u>a</u> alla<u>th</u>eena tawallaw qawman gha<u>d</u>iba All<u>a</u>hu AAalayhim m<u>a</u> hum minkum wal<u>a</u> minhum waya<u>h</u>lifoona AAal<u>a</u> alka<u>th</u>ibi wahum yaAAlamoon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Do you not see those who have befriended a people who have brought down upon themselves the wrath of God? They are neither with you nor with them and they wittingly swear to falsehood."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Turnest thou not thy attention to those who turn (in friendship) to such as have the Wrath of Allah upon them? They are neither of you nor of them, and they swear to falsehood knowingly."}]}, {"index": 5119, "local_index": 15, "part_type": "Verse", "path": "/books/quran:58:15", "text": "أَعَدَّ اللَّهُ‌ لَهُمْ‌ عَذَاباً شَدِيداً إِنَّهُمْ‌ سَاءَ مَا کَانُوا يَعْمَلُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "خدا برای آنان عذاب سختی آماده کرده است؛ زیرا آنچه را که همواره انجام می دادند، بسیار بد است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا بر ايشان عذابى سخت آماده كرده است. زيرا كارهايى كه مى‌كنند ناپسند است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "خدا براى آنها عذابى سخت فراهم كرده است. به راستى آنها بد عمل مى‌كردند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "خدا براى آنان عذابى سخت آماده كرده است. راستى كه چه بد مى‌كردند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "خدا بر آنها عذابی سخت مهیّا کرده، زیرا بسیار زشت کردارند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "خداوند عذاب سختی را برای ایشان آماده کرده و تهیّه دیده است. آنان چه کار بدی می‌کنند! [[«أَعَدَّ»: آماده کرده است. تهیه دیده است. «مَا»: چیزهائی که. مراد نفاق و دروغ است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "خداوند برای آنان عذابی سهمگین آماده ساخته است، آنان عملکردشان بد است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "خداوند عذاب شدیدی برای آنان فراهم ساخته، چرا که اعمال بدی انجام می‌دادند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آماده کرد خدا برای ایشان عذابی سخت همانا زشت است آنچه بودند می‌کردند"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "خداى برايشان عذابى سخت آماده ساخته است، زيرا كه بد است آنچه مى‌كردند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "خدا برایشان عذابی سخت آماده کرده است. بی‌گمان آنان چه بد می‌کرده‌اند."}, {"lang": "en", "name": "Ahmed Ali", "text": "God has reserved a severe punishment for them. Evil indeed are the things they do!"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Allah has kept prepared a severe punishment for them; indeed they commit extremely evil deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "God has made ready for them a chastisement terrible; surely they -- evil are the things they have been doing."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Allah hath gotten ready for them a torment grievous; verily vile is that which they have been working."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Allah has prepared for them a severe torment. Evil indeed is that which they used to do."}, {"lang": "en", "name": "Talal Itani", "text": "God has prepared for them a terrible punishment. Evil is what they used to do."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Allah has prepared for them a grievous chastisement. Indeed, evil are the acts in which they are engaged."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Allah has prepared for them a severe torment. Evil indeed is that which they used to do."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Allah hath prepared for them a dreadful doom. Evil indeed is that which they are wont to do."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Allah has prepared a severe punishment for them. Evil indeed is what they used to do."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Allah has prepared for them a grievous punishment. Evil indeed is that which they have done."}, {"lang": "en", "name": "Saheeh International", "text": "Allah has prepared for them a severe punishment. Indeed, it was evil that they were doing."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God has prepared a severe torment for them. What an evil deed they have committed!"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Allah has prepared for them a severe punishment; surely what they do is evil."}, {"lang": "en", "name": "English Transliteration", "text": "aAAadda All<u>a</u>hu lahum AAa<u>tha</u>ban shadeedan innahum s<u>a</u>a m<u>a</u> k<u>a</u>noo yaAAmaloon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "God has prepared a severe punishment for them; surely what they have done is evil."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Allah has prepared for them a severe Penalty: evil indeed are their deeds."}]}, {"index": 5120, "local_index": 16, "part_type": "Verse", "path": "/books/quran:58:16", "text": "اتَّخَذُوا أَيْمَانَهُمْ‌ جُنَّةً فَصَدُّوا عَنْ‌ سَبِيلِ‌ اللَّهِ‌ فَلَهُمْ‌ عَذَابٌ‌ مُهِينٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آنان سوگندهایشان را [برای تبرئه خود از خیانت به پیامبر و مؤمنان] سپر قرار داده اند، در نتیجه [مردم را] از راه خدا بازداشتند پس برای آنان عذابی خوارکننده است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "از سوگندهايشان سپرى ساخته‌اند. و از راه خدا رويگردان شده‌اند. پس براى آنهاست عذابى خواركننده."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "سوگندهاى خود را سپرى گرفتند و [مردم را] از راه خدا بازداشتند، پس براى ايشان عذابى خفت‌بار است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "سوگندهاى خود را [چون‌] سپرى قرار داده بودند و [مردم را] از راه خدا بازداشتند و [در نتيجه‌] براى آنان عذابى خفت‌آور است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آن مردم منافق سوگند و قسمهای خود را سپر قرار دادند پس (خلق را) از راه خدا بازداشتند، پس بر آنها کیفر عذاب ذلّت و خواری خواهد بود."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آنان سوگندهایشان را سپری (برای حفظ جان و مال خود) ساخته‌اند و بدین وسیله مردمان را از راه یزدان بازداشته‌اند، و لذا عذاب خوارکننده‌ای دارند. [[«جُنَّةً»: سپر.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "سوگندهایشان را سپر بلا کرده‌اند، و [مردمان را] از راه خدا باز می‌دارند، پس عذابی خفت‌بار [در پیش‌] دارند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آنها سوگندهای خود را سپری قرار دادند و مردم را از راه خدا بازداشتند؛ از این‌رو برای آنان عذاب خوارکننده‌ای است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "بگرفتند سوگندهای خود را سپری تا بازداشتند از راه خدا پس ایشان را است عذابی خوارکننده‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "سوگندهاشان را سپر گرفته‌اند و [مردم را] از راه خدا بگردانيده‌اند، پس آنان راست عذابى خواركننده."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "سوگندهای خود را (چون) سپری (برای خود) قرار دادند. پس از راه خدا باز داشتند. پس برایشان عذابی خفّت‌بار است."}, {"lang": "en", "name": "Ahmed Ali", "text": "They have made their oaths a shield, and obstruct people from the way of God. There is shameful punishment for them."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "They use their oaths as a shield therefore preventing from Allah’s way – so for them is a disgraceful punishment."}, {"lang": "en", "name": "A. J. Arberry", "text": "They have taken their oaths as a covering, and barred from God's way; so there awaits them a humbling chastisement."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "They have taken their oaths as a shield, and they have hindered others from the way of Allah; wherefore theirs shall be a torment ignominious."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "They have made their oaths a screen (for their evil actions). Thus they hinder (men) from the Path of Allah, so they shall have a humiliating torment."}, {"lang": "en", "name": "Talal Itani", "text": "They took their oaths as a screen, and prevented others from God’s path. They will have a shameful punishment."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "They have taken their oaths as a shield by means of which they hinder people from the Way of Allah. Theirs shall be a humiliating chastisement."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "They have made their oaths a screen. Thus they hinder (others) from the path of Allah, so they shall have a humiliating torment."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "They make a shelter of their oaths and turn (men) from the way of Allah; so theirs will be a shameful doom."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "They make a shield of their oaths and bar [people] from the way of Allah; so there is a humiliating punishment for them."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "They have taken their oaths as a disguise and bar from the Way of Allah, so a humiliating punishment awaits them."}, {"lang": "en", "name": "Saheeh International", "text": "They took their [false] oaths as a cover, so they averted [people] from the way of Allah, and for them is a humiliating punishment."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "They have made their oaths as a shield to obstruct others from the way of God. They will suffer a humiliating torment."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "They make their oaths to serve as a cover so they turn away from Allah's way; therefore they shall have an abasing chastisement."}, {"lang": "en", "name": "English Transliteration", "text": "Ittakha<u>th</u>oo aym<u>a</u>nahum junnatan fa<u>s</u>addoo AAan sabeeli All<u>a</u>hi falahum AAa<u>tha</u>bun muheen<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "They have used their oaths to cover up their misdeeds and have thus turned others away from the path of God. A humiliating punishment awaits them."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "They have made their oaths a screen (for their misdeeds): thus they obstruct (men) from the Path of Allah: therefore shall they have a humiliating Penalty."}]}, {"index": 5121, "local_index": 17, "part_type": "Verse", "path": "/books/quran:58:17", "text": "لَنْ‌ تُغْنِيَ‌ عَنْهُمْ‌ أَمْوَالُهُمْ‌ وَ لاَ أَوْلاَدُهُمْ‌ مِنَ‌ اللَّهِ‌ شَيْئاً أُولٰئِکَ‌ أَصْحَابُ‌ النَّارِ هُمْ‌ فِيهَا خَالِدُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "هرگز اموال و اولادشان چیزی از عذاب خدا را از آنان دفع نمی کند، آنان اهل آتش اند و در آن جاودانه اند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اموال و اولادشان برايشان در برابر خشم خدا سود نكند. اهل جهنمند و در آن جاودان."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "در برابر خدا نه اموالشان و نه اولادشان چيزى [از عذاب‌] را از آنها برطرف نمى‌سازد. آنها ياران آتشند و در آن جاودانن"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "در برابر خداوند نه از اموالشان و نه از اولادشان هرگز كارى ساخته نيست. آنها دوزخى‌اند [و] در آن جاودانه [مى‌مانند]."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و هرگز مال و فرزندان، آنان را از (عذاب قهر) خدا ابدا نرهاند، آنها اهل آتش دوزخند و در آن همیشه معذّبند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "اموالشان و اولادشان، به هیچ وجه ایشان را از دست خدا مصون و محفوظ نمی‌دارد. اینان دوزخیانند و در دوزخ جاودانه می‌مانند. [[«لَن تُغْنِیَ ...»: (نگا: آل‌عمران / 10 و 116).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "اموال و اولادشان به هیچ روی از [عذاب‌] خدا بازشان ندارد، اینان دوزخی‌اند و جاودانه در آنند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "هرگز اموال و اولادشان آنها را از عذاب الهی حفظ نمی‌کند؛ آنها اهل آتشند و جاودانه در آن می‌مانند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "بی‌نیاز نگرداند از ایشان خواسته‌های ایشان و نه فرزندانشان از خدا چیزی را آنانند یاران آتش ایشانند در آن جاودانان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "مالها و فرزندانشان آنان را در برابر [عذاب‌] خدا هيچ سود ندارد- عذاب خدا را از آنها باز ندارد-، اينان دوزخيانند، در آن جاودانه‌اند"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "از (عذاب‌) خدا نه از اموالشان و نه از اولادشان هرگز کاری ساخته نیست. آنان همگنان دوزخند، حال آنکه در آن جاودانه‌اند."}, {"lang": "en", "name": "Ahmed Ali", "text": "Neither their wealth nor children will avail them against God. They are the people of Hell, and there will abide for ever."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Their wealth and their children will be of no use to them before Allah; they are the people of hell; they are to remain in it forever."}, {"lang": "en", "name": "A. J. Arberry", "text": "Neither their riches nor their children shall avail them anything against God; those -- they are the inhabitants of the Fire, therein dwelling forever."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "There will not avail them against Allah their riches or their children at all. Th are the fellows of the Fire; therein they will be abiders."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Their children and their wealth will avail them nothing against Allah. They will be (the) dwellers of the Fire, to dwell therein forever."}, {"lang": "en", "name": "Talal Itani", "text": "Neither their possessions nor their children will avail them anything against God. These are the inhabitants of the Fire, dwelling therein forever."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Neither their possessions nor their offspring will be of any avail to them against Allah. They are the people of the Fire; therein they shall abide."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Their children and their wealth will avail them nothing against Allah. They will be the dwellers of the Fire to dwell therein forever."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Their wealth and their children will avail them naught against Allah. Such are rightful owners of the Fire; they will abide therein."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Their possessions and children will not avail them in any way against Allah. They shall be the inmates of the Fire and they shall remain in it [forever]."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Neither their wealth nor their children shall help them a thing against Allah. They are the inhabitants of the Fire, and there they shall live for ever."}, {"lang": "en", "name": "Saheeh International", "text": "Never will their wealth or their children avail them against Allah at all. Those are the companions of the Fire; they will abide therein eternally"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Neither their wealth nor their children will be able to protect them against God. They will be the dwellers of hell fire wherein they will live forever."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Neither their wealth nor their children shall avail them aught against Allah; they are the inmates of the fire, therein they shall abide."}, {"lang": "en", "name": "English Transliteration", "text": "Lan tughniya AAanhum amw<u>a</u>luhum wal<u>a</u> awl<u>a</u>duhum mina All<u>a</u>hi shayan ol<u>a</u>ika a<u>s</u><u>ha</u>bu a<b>l</b>nn<u>a</u>ri hum feeh<u>a</u> kh<u>a</u>lidoon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Neither their wealth nor their children will be of the least avail [in protecting them] against God -- they are the inheritors of Hell, and there they shall remain forever."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Of no profit whatever to them, against Allah, will be their riches nor their sons: they will be Companions of the Fire, to dwell therein (for aye)!"}]}, {"index": 5122, "local_index": 18, "part_type": "Verse", "path": "/books/quran:58:18", "text": "يَوْمَ‌ يَبْعَثُهُمُ‌ اللَّهُ‌ جَمِيعاً فَيَحْلِفُونَ‌ لَهُ‌ کَمَا يَحْلِفُونَ‌ لَکُمْ‌ وَ يَحْسَبُونَ‌ أَنَّهُمْ‌ عَلَى‌ شَيْ‌ءٍ أَلاَ إِنَّهُمْ‌ هُمُ‌ الْکَاذِبُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "روزی که خدا همه آنان را برمی انگیزد، پس همان گونه که برای شما سوگند دروغ می خوردند، برای خدا هم سوگند دروغ می خورند، و گمان می کنند که با سوگند دروغ می توانند در عرصه محشر، سودی را برای خود جلب کنند و زیانی را از خویش بگردانند، آگاه باش که آنان همان دورغگویانند!"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "روزى كه خدا همه آنها را زنده مى‌كند، همچنان كه براى شما قسم مى‌خوردند براى او هم قسم خواهند خورد. و مى‌پندارند كه سودى خواهند برد. آگاه باشيد كه دروغگويانند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "روزى كه خدا همه آنها را برمى‌انگيزد، پس براى خدا سوگند مى‌خورند، چنان كه [امروز] براى شما سوگند مى‌خورند [كه مسلمانند]، و مى‌پندارند كه بر چيزى هستند [يا اعتبارى دارند]. آگاه باش كه آنها همان دروغگويانند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "روزى كه خدا همه آنان را برمى‌انگيزد، همان‌گونه كه براى شما سوگند ياد مى‌كردند براى او [نيز] سوگند ياد مى‌كنند و چنان پندارند كه حق به جانب آنهاست. آگاه باش كه آنان همان دروغگويانند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "روزی که خدا همه آنها را (برای انتقام) برانگیزد پس چنان که برای شما قسم یاد می‌کنند برای خدا هم به دروغ سوگند می‌خورند و می‌پندارند که اثری بر آنها خواهد داشت. الا (ای اهل ایمان) بدانید که آنها بسیار مردم دروغگویی هستند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "روزی خداوند همه‌ی آنان را زنده می‌گرداند. آن روز برای خدا (به دروغ) سوگند می‌خورند همان گونه که (امروز به دروغ) برای شما سوگند می‌خورند، و گمان می‌برند که ایشان دارای چیزی (از هوش و زرنگی) هستند! (و با این سوگندهای دروغ، خویشتن را می‌رهانند و به جائی می‌رسانند). هان! ایشان دروغگویانند (و گرفتار خشم و عذاب یزدانند). [[«یَحْلِفُونَ لَهُ»: برای خدا سوگند یاد می‌کنند که منافق نبوده‌اند (نگا: انعام / 23، نحل / 28).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "روزی که خداوند همگی آنان را برانگیزد، آنگاه [مشرکان‌] برای او به همان گونه سوگند یاد می‌کنند که برای شما یاد می‌کنند و گمان می‌کنند که حقی در دست دارند، بدانید که آنان دروغگویانند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "(به خاطر بیاورید) روزی را که خداوند همه آنها را برمی‌انگیزد، آنها برای خدا نیز سوگند (دروغ) یاد می‌کنند همان‌گونه که (امروز) برای شما یاد می‌کنند؛ و گمان می‌کنند کاری می‌توانند انجام دهند؛ بدانید آنها دروغگویانند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "روزی که برانگیزدشان خدا همگی پس سوگند یاد کنند برایش چنانکه سوگند یاد کنند برای شما و گمان کنند که ایشانند بر چیزی همانا ایشانند دروغگویان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "روزى كه خدا همه آنان- منافقان- را برانگيزد، پس براى خدا سوگند مى‌خورند چنانكه [امروز] براى شما سوگند مى‌خورند، و مى‌پندارند كه بر چيزى دست دارند- يعنى از سوگند خود سودى مى‌برند- آگاه باشيد كه آنها دروغگويانند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "روزی که خدا همه‌ی آنان را (از گورهاشان) برمی‌انگیزد، پس همان گونه که برای شما سوگند یاد می‌کنند برای او (نیز) سوگند یاد کنند، و چنان پندارند که بر چیزی (از حق)اند. هان! آنان بی‌گمان، (هم)ایشان دروغگویانند."}, {"lang": "en", "name": "Ahmed Ali", "text": "On the day that God will raise them together, they will swear before Him as they swear before you, and imagine they are on the right path. Is it not they who are liars?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "The day when Allah will raise them all, they will swear in His presence the way they now swear in front of you, and they will assume that they have achieved something; pay heed! Indeed it is they who are the liars."}, {"lang": "en", "name": "A. J. Arberry", "text": "Upon the day when God shall raise them up all together, and they will swear to Him, as they swear to you, and think they are on something. Surely, they are the liars!"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "This shall befall on a Day whereon Allah shall raise them all together; then they will swear Unto Him even as they swear Unto you, deeming themselves up on aught. Lo! verily they! they are the liars."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "On the Day when Allah will resurrect them all together (for their account), then they will swear to Him as they swear to you (O Muslims). And they think that they have something (to stand upon). Verily, they are liars!"}, {"lang": "en", "name": "Talal Itani", "text": "On the Day when God will resurrect them altogether—they will swear to Him, as they swear to you, thinking that they are upon something. Indeed, they themselves are the liars."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "On the Day when Allah will raise them all from the dead they will swear before Him as they swear before you today, thinking that this will avail them. Behold, they are utter liars."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "On the Day when Allah will resurrect them all together; then they will swear to Him as they swear to you. And they think that they have something. Verily, they are liars!"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "On the day when Allah will raise them all together, then will they swear unto Him as they (now) swear unto you, and they will fancy that they have some standing. Lo! is it not they who are the liars?"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "The day when Allah will raise them all together, they will swear to Him, just like they swear to you [now], supposing that they stand on something. Look! They are indeed liars!"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "On the Day when Allah shall raise them all up, they will swear to Him as they now swear to you thinking that they are upon something. Indeed, they are the liars!"}, {"lang": "en", "name": "Saheeh International", "text": "On the Day Allah will resurrect them all, and they will swear to Him as they swear to you and think that they are [standing] on something. Unquestionably, it is they who are the liars."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "On the day when God will resurrect them all together, they will swear to Him as they swore to you and they will think that they have a good case but they are certainly liars."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "On the day that Allah will raise them up all, then they will swear to Him as they swear to you, and they think that they have something; now surely they are the liars."}, {"lang": "en", "name": "English Transliteration", "text": "Yawma yabAAathuhumu All<u>a</u>hu jameeAAan faya<u>h</u>lifoona lahu kam<u>a</u> ya<u>h</u>lifoona lakum waya<u>h</u>saboona annahum AAal<u>a</u> shayin al<u>a</u> innahum humu alk<u>ath</u>iboon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "On the day God raises them all up from the dead, they will swear to Him just as they have sworn to you, thinking that they are on firm ground. But surely they are liars."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "One day will Allah raise them all up (for Judgment): then will they swear to Him as they swear to you: And they think that they have something (to stand upon). No, indeed! they are but liars!"}]}, {"index": 5123, "local_index": 19, "part_type": "Verse", "path": "/books/quran:58:19", "text": "اسْتَحْوَذَ عَلَيْهِمُ‌ الشَّيْطَانُ‌ فَأَنْسَاهُمْ‌ ذِکْرَ اللَّهِ‌ أُولٰئِکَ‌ حِزْبُ‌ الشَّيْطَانِ‌ أَلاَ إِنَ‌ حِزْبَ‌ الشَّيْطَانِ‌ هُمُ‌ الْخَاسِرُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "شیطان بر آنان چیره و مسلط شده و یاد خدا را از خاطرشان برده است، آنان حزب شیطانند، آگاه باش که حزب شیطان یقیناً همان زیان کارانند!"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "شيطان بر آنها چيره شده است و نام خدا را از يادشان برده است. ايشان حزب شيطانند. آگاه باش كه حزب شيطان زيان‌كنندگانند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "شيطان بر آنها چيره شده و خدا را از يادشان برده است. آنها حزب شيطانند. آگاه باش كه حزب شيطان همان زيانكارانند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "شيطان بر آنان چيره شده و خدا را از يادشان برده است؛ آنان حزب شيطانند. آگاه باش كه حزب شيطان همان زيانكارانند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "شیطان بر (دل) آنها سخت احاطه کرده که فکر و ذکر خدا را به کلی از یادشان برده، آنان حزب شیطانند، الا (ای اهل ایمان) بدانید که حزب شیطان به حقیقت زیانکاران عالمند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "اهریمن بر آنان چیره گشته است (و با وسوسه‌های خود ایشان را از راستای راه بدر کرده است) و یاد خدا را از خاطرشان برده است. اینان حزب اهریمن هستند. هان! قطعاً حزب اهریمن زیانکار و زیانبارند. [[«إِسْتَحْوَذَ»: چیره گشته است. مسلط شده و غلبه یافته است. «حِزْبُ»: (نگا: مائده / 56، مؤمنون / 53، روم / 32).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "شیطان بر آنان دست یافت، سپس یاد خدا را از خاطر آنان برد، اینان حزب شیطانند، هان بی‌گمان حزب شیطان زیانکارانند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "شیطان بر آنان مسلّط شده و یاد خدا را از خاطر آنها برده؛ آنان حزب شیطانند! بدانید حزب شیطان زیانکارانند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "چیره شد بر ایشان شیطان پس فراموششان کرد یاد خدا را آنانند حزب شیطان همانا حزب شیطانند زیانکاران‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "شيطان بر آنان دست يافته است، پس يادكرد خداى را از يادشان برده است. اينان گروه شيطانند آگاه باشيد كه گروه شيطان زيانكارند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "شیطان بر آنان بس چیره شده. پس خدا را از یادشان برده. آنان حزب شیطانند؛ هان! حزب شیطان (هم)ایشان بی‌گمان زیانکارانند."}, {"lang": "en", "name": "Ahmed Ali", "text": "Satan has got the better of them. and made them forget to remember God. Indeed they belong to Satan's faction. Will not Satan's faction perish?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "The devil has overpowered them, so they forgot the remembrance of Allah; they are the devil’s group; pay heed! Indeed it is the devil’s group who are the losers."}, {"lang": "en", "name": "A. J. Arberry", "text": "Satan has gained the mastery over them, and caused them to forget God's Remembrance. Those are Satan's party; why, Satan's party, surely, they are the losers!"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "The Satan hath overpowered them, and so hath caused them to forget the remembrance of Allah. These are the band of the Satan. Lo! verily it is the Satan's band that shall be the losers."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Shaitan (Satan) has overtaken them. So he has made them forget the remembrance of Allah. They are the party of Shaitan (Satan). Verily, it is the party of Shaitan (Satan) that will be the losers!"}, {"lang": "en", "name": "Talal Itani", "text": "Satan has taken hold of them, and so has caused them to forget the remembrance of God. These are the partisans of Satan. Indeed, it is Satan’s partisans who are the losers."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Satan has gained mastery over them and has made them neglect remembering Allah. They are the party of Satan. Behold, the party of Satan will be the losers."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "The Shaytan has overpowered them. So he has made them forget the remembrance of Allah. They are the party of Shaytan. Verily, it is the party of Shaytan that will be the losers!."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "The devil hath engrossed them and so hath caused them to forget remembrance of Allah. They are the devil's party. Lo! is it not the devil's party who will be the losers?"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Satan has prevailed upon them, so he has caused them to forget the remembrance of Allah. They are Satan’s confederates. Look! Indeed, it is Satan’s confederates who are the losers!"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "satan has mastered them and caused them to forget the Remembrance of Allah. Those are satan's party; and satan's party shall assuredly be the losers."}, {"lang": "en", "name": "Saheeh International", "text": "Satan has overcome them and made them forget the remembrance of Allah. Those are the party of Satan. Unquestionably, the party of Satan - they will be the losers."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Satan has dominated them and has made them forget the guidance of God. They are Satan's party and the party of Satan will certainly suffer a great loss."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "The Shaitan has gained the mastery over them, so he has made them forget the remembrance of Allah; they are the Shaitan's party; now surely the Shaitan's party are the losers."}, {"lang": "en", "name": "English Transliteration", "text": "Ista<u>h</u>wa<u>th</u>a AAalayhimu a<b>l</b>shshay<u>ta</u>nu faans<u>a</u>hum <u>th</u>ikra All<u>a</u>hi ol<u>a</u>ika <u>h</u>izbu a<b>l</b>shshay<u>ta</u>ni al<u>a</u> inna <u>h</u>izba a<b>l</b>shshay<u>ta</u>ni humu alkh<u>a</u>siroon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Satan has got the better of them and has caused them to forget the remembrance of God. They have gone over to the side of the devil, and it is as the devil's partisans that they shall be the losers:"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "The Evil One has got the better of them: so he has made them lose the remembrance of Allah. They are the Party of the Evil One. Truly, it is the Party of the Evil One that will perish!"}]}, {"index": 5124, "local_index": 20, "part_type": "Verse", "path": "/books/quran:58:20", "text": "إِنَ‌ الَّذِينَ‌ يُحَادُّونَ‌ اللَّهَ‌ وَ رَسُولَهُ‌ أُولٰئِکَ‌ فِي‌ الْأَذَلِّينَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بی تردید کسانی که با خدا و پیامبرش دشمنی و مخالفت می کنند، در زمره خوارترینان هستند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "كسانى كه با خدا و پيامبرش مخالفت مى‌ورزند در زمره ذليل‌شدگانند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "بى‌ترديد، كسانى كه با خدا و رسولش دشمنى و مخالفت مى‌كنند، آنها در [زمره‌ى‌] خوارترين افرادند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "در حقيقت، كسانى كه با خدا و پيامبر او به دشمنى برمى‌خيزند، آنان در [زمره‌] زبونان خواهند بود."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آنان که با خدا و رسول او عناد و مخالفت می‌کنند آنها در میان (خلق) خوار و ذلیل‌ترین مردمند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "مسلّماً کسانی که با خدا و پیغمبرش دشمنی می‌کنند، از زمره‌ی پست‌ترین و خوارترین (مردمان) خواهند بود. [[«یُحَآدُّونَ»: (نگا: مجادله / 5). «الأذَلِّینَ»: ذلیل‌ترین و خوارترین و رسواترین انسانها.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بی‌گمان کسانی که با [امر] خداوند و پیامبر او مخالفت می‌کنند، اینان از زمره فرومایگانند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کسانی که با خدا و رسولش دشمنی می‌کنند، آنها در زُمره ذلیل‌ترین افرادند.!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "همانا آنان که دشمنی کنند با خدا و پیمبرش آنانند در جرگه سرافکندگان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "همانا كسانى كه با خداى و پيامبرش دشمنى و مخالفت مى‌كنند آنان در ميان خوارترين [مردمان‌] اند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "کسانی که با خدا و پیامبرش جدایی می‌طلبد، آنان همواره در (زمره‌ی) خوارترین (مردمان)اند."}, {"lang": "en", "name": "Ahmed Ali", "text": "Surely those who oppose God and His Prophet will be among the vilest."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Indeed those who oppose Allah and His Noble Messenger, are among the most despicable."}, {"lang": "en", "name": "A. J. Arberry", "text": "Surely those who oppose God and His Messenger, those are among the most abject."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Verily those; who oppose Allah and His apostle - they are among the lowest."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Those who oppose Allah and His Messenger (Muhammad SAW), they will be among the lowest (most humiliated)."}, {"lang": "en", "name": "Talal Itani", "text": "Those who oppose God and His Messenger are among the lowliest."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Verily those who oppose Allah and His Messenger will be among the most abject beings."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Those who oppose Allah and His Messenger, they will be among those most humiliated."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Lo! those who oppose Allah and His messenger, they will be among the lowest."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Indeed those who oppose Allah and His Apostle—they will be among the most abased."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Those who oppose Allah and His Messenger shall be among the humiliated."}, {"lang": "en", "name": "Saheeh International", "text": "Indeed, the ones who oppose Allah and His Messenger - those will be among the most humbled."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Disgrace will strike those who oppose God and His Messenger."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Surely (as for) those who are in opposition to Allah and His Apostle; they shall be among the most abased."}, {"lang": "en", "name": "English Transliteration", "text": "Inna alla<u>th</u>eena yu<u>ha</u>ddoona All<u>a</u>ha warasoolahu ol<u>a</u>ika fee ala<u>th</u>alleen<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "those who oppose God and His Messenger will [on Judgement Day] be among the most abased."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Those who resist Allah and His Messenger will be among those most humiliated."}]}, {"index": 5125, "local_index": 21, "part_type": "Verse", "path": "/books/quran:58:21", "text": "کَتَبَ‌ اللَّهُ‌ لَأَغْلِبَنَ‌ أَنَا وَ رُسُلِي‌ إِنَ‌ اللَّهَ‌ قَوِيٌ‌ عَزِيزٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "خدا لازم و مقرّر کرده است که بی تردید من و پیامبرانم پیروزیم. همانا خدا نیرومند و توانای شکست ناپذیر است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا مقرر داشته كه: البته من و پيامبرانم پيروز مى‌شويم. زيرا خدا توانا و پيروزمند است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "خدا مقرر داشته است كه: قطعا پيروز مى‌شوم من و رسولانم [نيز]. همانا خداوند، قوى و شكست ناپذير است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "خدا مقرّر كرده است كه: «حتماً من و فرستادگانم چيره خواهيم گرديد.» آرى، خدا نيرومند شكست‌ناپذير است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "خدا (در لوح محفوظ) نگاشته و حتم گردانیده که البته من و رسولانم (بر دشمنان) غالب شویم، که خدا بسیار قوی و مقتدر است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "خداوند چنین مقدّر کرده است که من و پیغمبرانم قطعاً پیروز می‌گردیم. بی‌گمان خداوند نیرومند چیره است. [[«کَتَبَ»: مقدر کرده است. قضا و قدرش در لوح محفوظ چنین افتاده است (نگا: رعد / 39).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "خداوند مقرر داشته است که من و پیامبرانم پیروز گردیم، بی‌گمان خداوند نیرومند پیروزمند است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "خداوند چنین مقرر داشته که من و رسولانم پیروز می‌شویم؛ چرا که خداوند قوّی و شکست‌ناپذیر است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "نوشت خدا که پیروز می‌شوم من و فرستادگانم همانا خدا است توانای عزیز"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "خداى نوشته- حكم كرده- است كه من و فرستادگانم البته پيروز خواهيم شد همانا خدا نيرومند و تواناى بى‌همتاست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "خدا (چنان) نبشته است که: «حتماً من و فرستادگانم چیره خواهیم گشت.» آری، خدا نیرومندی عزیز است."}, {"lang": "en", "name": "Ahmed Ali", "text": "God has decreed: \"I will prevail, I and My apostles.\" Verily God is powerful and all-mighty."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Allah has already decreed that, “I will indeed be victorious, and My Noble Messengers”; indeed Allah is Almighty, the Most Honourable."}, {"lang": "en", "name": "A. J. Arberry", "text": "God has written, 'I shall assuredly be the victor, I and My Messengers.' Surely God is All-strong, All-mighty."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Allah hath prescribed: surely shall overcome, and My apostles. Verily Allah is strong, Mighty."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Allah has decreed: \"Verily! It is I and My Messengers who shall be the victorious.\" Verily, Allah is All-Powerful, All-Mighty."}, {"lang": "en", "name": "Talal Itani", "text": "God has written: “I will certainly prevail, I and My messengers.” God is Strong and Mighty."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Allah has written: “Surely I will prevail; I and My Messengers.” Verily Allah is Most Strong, Most Mighty."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Allah has decreed: \"Verily, I and My Messengers shall be the victorious.\" Verily, Allah is All-Powerful, Almighty."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Allah hath decreed: Lo! I verily shall conquer, I and My messengers. Lo! Allah is Strong, Almighty."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Allah has ordained: ‘I shall surely prevail, I and My apostles.’ Indeed Allah is all-strong, all-mighty."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Allah has written: 'I will surely be the Victor, I and My Messengers' Surely, Allah is the Strong, the Almighty."}, {"lang": "en", "name": "Saheeh International", "text": "Allah has written, \"I will surely overcome, I and My messengers.\" Indeed, Allah is Powerful and Exalted in Might."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God has decreed, \"I and My Messenger shall certainly triumph.\" God is All-powerful and Majestic."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Allah has written down: I will most certainly prevail, I and My apostles; surely Allah is Strong, Mighty."}, {"lang": "en", "name": "English Transliteration", "text": "Kataba All<u>a</u>hu laaghlibanna an<u>a</u> warusulee inna All<u>a</u>ha qawiyyun AAazeez<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "God has decreed, \"I and My messengers shall most certainly prevail.\" Truly God is Powerful and Almighty."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Allah has decreed: \"It is I and My messengers who must prevail\": For Allah is One full of strength, able to enforce His Will."}]}, {"index": 5126, "local_index": 22, "part_type": "Verse", "path": "/books/quran:58:22", "text": "لاَ تَجِدُ قَوْماً يُؤْمِنُونَ‌ بِاللَّهِ‌ وَ الْيَوْمِ‌ الْآخِرِ يُوَادُّونَ‌ مَنْ‌ حَادَّ اللَّهَ‌ وَ رَسُولَهُ‌ وَ لَوْ کَانُوا آبَاءَهُمْ‌ أَوْ أَبْنَاءَهُمْ‌ أَوْ إِخْوَانَهُمْ‌ أَوْ عَشِيرَتَهُمْ‌ أُولٰئِکَ‌ کَتَبَ‌ فِي‌ قُلُوبِهِمُ‌ الْإِيمَانَ‌ وَ أَيَّدَهُمْ‌ بِرُوحٍ‌ مِنْهُ‌ وَ يُدْخِلُهُمْ‌ جَنَّاتٍ‌ تَجْرِي‌ مِنْ‌ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ‌ فِيهَا رَضِيَ‌ اللَّهُ‌ عَنْهُمْ‌ وَ رَضُوا عَنْهُ‌ أُولٰئِکَ‌ حِزْبُ‌ اللَّهِ‌ أَلاَ إِنَ‌ حِزْبَ‌ اللَّهِ‌ هُمُ‌ الْمُفْلِحُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "گروهی را که به خدا و روز قیامت ایمان دارند، نمی یابی که با کسانی که با خدا و پیامبرش دشمنی و مخالفت دارند، دوستی برقرار کنند، گرچه پدرانشان یا فرزاندانشان یا برادرانشان یا خویشانشان باشند. اینانند که خدا ایمان را در دل هایشان ثابت و پایدار کرده، و به روحی از جانب خود نیرومندشان ساخته، و آنان را به بهشت هایی که از زیرِ [درختانِ] آن نهرها جاری است درمی آورد، در آنجا جاودانه اند، خدا از آنان خشنود است و آنان هم از خدا خشنودند. اینان حزب خدا هستند، آگاه باش که بی تردید حزب خدا همان رستگارانند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "نمى‌يابى مردمى را كه به خدا و روز قيامت ايمان آورده باشند، ولى با كسانى كه با خدا و پيامبرش مخالفت مى‌ورزند دوستى كنند، هر چند آن مخالفان، پدران يا فرزندان يا برادران و يا قبيله آنها باشند. خدا بر دلشان رقم ايمان زده و به روحى از خود ياريشان كرده است و آنها را به بهشتهايى كه در آن نهرها جارى است درآورد. در آنجا جاودانه باشند. خدا از آنها خشنود است و آنان نيز از خدا خشنودند. اينان حزب خدايند، آگاه باش كه حزب خدا رستگارانند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "هيچ قومى را نيابى كه به خدا و روز واپسين ايمان آورده باشند در حالى كه با كسانى كه با خدا و رسولش مخالفت كرده‌اند دوستى كنند، هر چند پدرانشان يا پسرانشان يا برادرانشان يا عشيره‌ى آنها باشند. آنانند كه [خدا] ايمان را در دل‌هايشان رقم زده و با روحى از ج"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "قومى را نيابى كه به خدا و روز بازپسين ايمان داشته باشند [و] كسانى را كه با خدا و رسولش مخالفت كرده‌اند -هر چند پدرانشان يا پسرانشان يا برادرانشان يا عشيره آنان باشند- دوست بدارند. در دل اينهاست كه [خدا] ايمان را نوشته و آنها را با روحى از جانب خود تأييد كرده است، و آنان را به بهشتهايى كه از زير [درختان‌] آن جويهايى روان است در مى‌آورد؛ هميشه در آنجا ماندگارند؛ خدا از ايشان خشنود و آنها از او خشنودند؛ اينانند حزب خدا. آرى، حزب خداست كه رستگارانند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "هرگز مردمی را که ایمان به خدا و روز قیامت آورده‌اند چنین نخواهی یافت که دوستی با دشمنان خدا و رسول او کنند هر چند آن دشمنان پدران یا فرزندان یا برادران یا خویشان آنها باشند. این مردم پایدارند که خدا بر دلهاشان (نور) ایمان نگاشته و به روح (قدسی) خود آنها را مؤید و منصور گردانیده و آنها را به بهشتی داخل کند که نهرها زیر درختانش جاری است و جاودان در آنجا متنعّمند، خدا از آنها خشنود و آنها هم از خدا خشنودند، اینان به حقیقت حزب خدا هستند، الا (ای اهل ایمان) بدانید که حزب خدا رستگاران عالمند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "مردمانی را نخواهی یافت که به خدا و روز قیامت ایمان داشته باشند، ولی کسانی را به دوستی بگیرند که با خدا و پیغمبرش دشمنی ورزیده باشند، هرچند که آنان پدران، یا پسران، یا برادران، و یا قوم و قبیله‌ی ایشان باشند. چرا که مؤمنان، خدا بر دلهایشان رقم ایمان زده است، و با نفخه‌ی ربّانی خود یاریشان داده است و تقویتشان کرده است، و ایشان را به باغهای بهشتی داخل می‌گرداند که از زیر (کاخها و درختان) آنها رودبارها روان است، و جاودانه در آنجا می‌مانند. خدا از آنان خوشنود، و ایشان هم از خدا خوشنودند. اینان حزب یزدانند. هان! حزب یزدان، قطعاً پیروز و رستگار است. [[«کَتَبَ»: نگاشته است و رقم زده است. مراد مستقر کردن و جایگزین نمودن است. «أَیَّدَ»: یاری داد. تقویت کرد (نگا: بقره / 87 و 253، مائده / 110، انفال / 26 و 62). «رُوحٍ»: نفخه. نیروی معنوی الهی، از قبیل: آرامش درون، نور بصیرت (نگا: فتح / 4).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "قومی نیابی که به خداوند و روز بازپسین ایمان داشته باشند و با کسانی که با خداوند و پیامبر او مخالفت می‌ورزند، دوستی کنند، ولو آنکه پدرانشان یا فرزندانشان یا برادرانشان یا خاندانشان باشند اینانند که [خداوند] در دلهایشان [نقش‌] ایمان نگاشته است، و به فیضی از جانب خویش استوارشان داشته است، و [ایشان را] به بوستانهایی درآورد که جویباران از فرودست آن جاری است، جاودانه در آنند، خداوند از آنان خشنود است، و آنان هم از او خشنودند، اینان خدا خواهانند، بدانید که خدا خواهان رستگارانند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "هیچ قومی را که ایمان به خدا و روز رستاخیز دارند نمی‌یابی که با دشمنان خدا و رسولش دوستی کنند، هر چند پدران یا فرزندان یا برادران یا خویشاوندانشان باشند؛ آنان کسانی هستند که خدا ایمان را بر صفحه دلهایشان نوشته و با روحی از ناحیه خودش آنها را تقویت فرموده، و آنها را در باغهایی از بهشت وارد می‌کند که نهرها از زیر (درختانش) جاری است، جاودانه در آن می‌مانند؛ خدا از آنها خشنود است، و آنان نیز از خدا خشنودند؛ آنها «حزب اللّه» اند؛ بدانید «حزب اللّه» پیروزان و رستگارانند."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "نیابی گروهی را که ایمان آرند به خدا و روز بازپسین دوستی کنند با آنکه دشمنی کند با خدا و پیمبرش و هر چند باشند پدرانشان یا پسرانشان یا برادرانشان یا خویشاوندانشان آنان نوشت در دلهاشان ایمان را و کمک کرد ایشان را با روحی از خویش و درآردشان باغهائی که روان است زیر آنها جویها جاودانان در آنها خوشنود باشد خدا از ایشان و خوشنود باشند از او آنانند حزب خدا همانا حزب خداوندند رستگاران‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "مردمى را نيابى كه به خداى و روز واپسين ايمان آورند در حالى كه با كسانى كه با خداى و پيامبرش دشمنى و مخالفت كرده‌اند دوستى بدارند اگر چه پدران يا پسران يا برادران يا خويشانشان باشند، اينانند كه [خداوند] ايمان را در دلهاشان نوشته- پايدار ساخته- است و ايشان را به روحى از نزد خويش نيرومند گردانيده و به بهشتهايى در آورد كه از زير آنها جويها روان است، در آنجا جاويدانند خدا از آنها خشنود است و ايشان از خدا خشنودند. ايشانند گروه خدا آگاه باشيد كه گروه خدا رستگارانند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "(هرگز) گروهی را نخواهی یافت که به خدا و روز بازپسین ایمان می‌آورند (ولی) با کسانی (که‌) با خدا و رسولش جدایی می‌کنند، طرح دوستی افکنند؛ هر چند پدرانشان یا پسرانشان یا برادرانشان یا عشیره‌ی آنان باشند. این‌هایند (که) خدا ایمان را در دل‌هایشان نقشی پای‌برجا داده و آنها را با روحی (ایمانی) از جانب خود تأیید کرده، و آنان را به باغ‌هایی که از زیر (درختان)شان نهرها روان است در می‌آورد، حال آنکه (آنجا) ماند‌گارند. خدا از ایشان خشنود و آنها از او خشنودند. اینانند حزب خدا. آری، حزب خدا همان رستگارکنندگانند."}, {"lang": "en", "name": "Ahmed Ali", "text": "You will not find those who believe in God and the Day of Resurrection, loving those who oppose God and His Prophet, even though they be their fathers, sons, or brothers or their kin. God has inscribed on their hearts belief, and has succoured them with His own grace, and will admit them to gardens with rivers flowing by, where they will abide for ever, God accepting them, and they, happy in the pleasure of God. They are verily the army of God. Will not the army of God be victorious?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "You will not find the people who believe in Allah and the Last Day, befriending those who oppose Allah and His Noble Messenger, even if they are their fathers or their sons or their brothers or their tribesmen; it is these upon whose hearts Allah has ingrained faith, and has aided them with a Spirit from Himself; and He will admit them into Gardens beneath which rivers flow, abiding in them forever; Allah is pleased with them, and they are pleased with Him; this is Allah’s group; pay heed! Indeed it is Allah’s group who are the successful."}, {"lang": "en", "name": "A. J. Arberry", "text": "Thou shalt not find any people who believe in God and the Last Day who are loving to anyone who opposes. God and His Messenger, not though they were their fathers, or their sons, or their brothers, or their clan. Those -- He has written faith upon their hearts, and He has confirmed them with a Spirit from Himself; and He shall admit them into gardens underneath which rivers flow, therein to dwell forever, God being well-pleased with them, and they well-pleased with Him. Those are God's party; why, surely God's party -- they are the prosperers."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Thou shalt not find a people who believe in Allah and the Last Day befriending those who oppose Allah and His apostle, even though they be their fathers or their sons or their brethren or their kindred. These! He hath inscribed faith on their hearts and hath strengthened them with a spirit from Him: and He shall make them enter Gardens whereunder rivers flow as abiders therein. Allah is well pleased with them, and they are well pleased with Him. These are Allah's band. Lo! verily it is the Allah's band that are the blissful."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "You (O Muhammad SAW) will not find any people who believe in Allah and the Last Day, making friendship with those who oppose Allah and His Messenger (Muhammad SAW), even though they were their fathers, or their sons, or their brothers, or their kindred (people). For such He has written Faith in their hearts, and strengthened them with Ruh (proofs, light and true guidance) from Himself. And We will admit them to Gardens (Paradise) under which rivers flow, to dwell therein (forever). Allah is pleased with them, and they with Him. They are the Party of Allah. Verily, it is the Party of Allah that will be the successful."}, {"lang": "en", "name": "Talal Itani", "text": "You will not find a people who believe in God and the Last Day, loving those who oppose God and His Messenger, even if they were their parents, or their children, or their siblings, or their close relatives. These—He has inscribed faith in their hearts, and has supported them with a spirit from Him. And He will admit them into Gardens beneath which rivers flow, wherein they will dwell forever. God is pleased with them, and they are pleased with Him. These are the partisans of God. Indeed, it is God’s partisans who are the successful."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "You shall not find a people who believe in Allah and the Last Day befriending those who oppose Allah and His Messenger even though they be their fathers or their sons or their brothers or their kindred. He has inscribed faith in their hearts and has strengthened them with a spirit from Him, and He shall make them enter Gardens beneath which rivers flow. Therein they shall abide. Allah is well-pleased with them, and they are well-pleased with Him. They belong to Allah's party. Verily Allah's party shall prosper."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "You will not find any people who believe in Allah and the Last Day, making friendship with those who oppose Allah and His Messenger, even though they were their fathers or their sons or their brothers or their kindred. For such He has written faith in their hearts, and strengthened them with Ruh from Himself. And He will admit them to Gardens under which rivers flow, to dwell therein (forever). Allah is well pleased with them, and they are well pleased with Him. They are the party of Allah. Verily, the party of Allah will be the successful."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Thou wilt not find folk who believe in Allah and the Last Day loving those who oppose Allah and His messenger, even though they be their fathers or their sons or their brethren or their clan. As for such, He hath written faith upon their hearts and hath strengthened them with a Spirit from Him, and He will bring them into Gardens underneath which rivers flow, wherein they will abide. Allah is well pleased with them, and they are well pleased with Him. They are Allah's party. Lo! is it not Allah's party who are the successful?"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "You will not find a people believing in Allah and the Last Day endearing those who oppose Allah and His Apostle even though they were their own parents, or children, or brothers, or kinsfolk. [For] such, He has written faith into their hearts and strengthened them with a spirit from Him. He will admit them into gardens with streams running in them, to remain in them [forever], Allah is pleased with them, and they are pleased with Him. They are Allah’s confederates. Look! The confederates of Allah are indeed felicitous!"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "You shall find no nation believing in Allah and the Last Day loving anyone that opposes Allah and His Messenger, even though they be their fathers, theirsons, their brothers, or their tribe. Those, He has written upon their hearts faith and strengthened them with a spirit from Him. He will admit them to the Gardensunderneath which rivers flow, where they shall live for ever. Allah is pleased with them and they are pleased with Him. They are the Party of Allah; and the Party ofAllah are the winners."}, {"lang": "en", "name": "Saheeh International", "text": "You will not find a people who believe in Allah and the Last Day having affection for those who oppose Allah and His Messenger, even if they were their fathers or their sons or their brothers or their kindred. Those - He has decreed within their hearts faith and supported them with spirit from Him. And We will admit them to gardens beneath which rivers flow, wherein they abide eternally. Allah is pleased with them, and they are pleased with Him - those are the party of Allah. Unquestionably, the party of Allah - they are the successful."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "You will not find any people of faith in God and the Day of Judgment who would establish friendship with those who oppose God and His Messenger, even if it would be in the interest of their fathers, sons, brothers, and kinsmen. God has established faith in their hearts and supported them by a Spirit from Himself. He will admit them to Paradise wherein streams flow to live therein forever. God is pleased with them and they are pleased with God. These are members of the party of God and the party of God will certainly have everlasting happiness."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "You shall not find a people who believe in Allah and the latter day befriending those who act in opposition to Allah and His Apostle, even though they were their (own) fathers, or their sons, or their brothers, or their kinsfolk; these are they into whose hearts He has impressed faith, and whom He has strengthened with an inspiration from Him: and He will cause them to enter gardens beneath which rivers flow, abiding therein; Allah is well-pleased with them and they are well-pleased with Him these are Allah's party: now surely the party of Allah are the successful ones."}, {"lang": "en", "name": "English Transliteration", "text": "L<u>a</u> tajidu qawman yuminoona bi<b>A</b>ll<u>a</u>hi wa<b>a</b>lyawmi al<u>a</u>khiri yuw<u>a</u>ddoona man <u>ha</u>dda All<u>a</u>ha warasoolahu walaw k<u>a</u>noo <u>a</u>b<u>a</u>ahum aw abn<u>a</u>ahum aw ikhw<u>a</u>nahum aw AAasheeratahum ol<u>a</u>ika kataba fee quloobihimu aleem<u>a</u>na waayyadahum biroo<u>h</u>in minhu wayudkhiluhum jann<u>a</u>tin tajree min ta<u>h</u>tih<u>a</u> alanh<u>a</u>ru kh<u>a</u>lideena feeh<u>a</u> ra<u>d</u>iya All<u>a</u>hu AAanhum wara<u>d</u>oo AAanhu ol<u>a</u>ika <u>h</u>izbu All<u>a</u>hi al<u>a</u> inna <u>h</u>izba All<u>a</u>hi humu almufli<u>h</u>oon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "You will find no believers in God and the Last Day consorting with those who oppose God and His Messenger, even though they be their fathers, their sons, their brothers or their close relatives. He has engraved faith on their very hearts and has strengthened them with a spirit of His own. He will usher them into Gardens through which rivers flow where they shall dwell forever. God is well-pleased with them and they are well pleased with Him. They are God's party. God's party shall surely enter into a state of bliss."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Thou wilt not find any people who believe in Allah and the Last Day, loving those who resist Allah and His Messenger, even though they were their fathers or their sons, or their brothers, or their kindred. For such He has written Faith in their hearts, and strengthened them with a spirit from Himself. And He will admit them to Gardens beneath which Rivers flow, to dwell therein (for ever). Allah will be well pleased with them, and they with Him. They are the Party of Allah. Truly it is the Party of Allah that will achieve Felicity."}]}]}, "index": "quran:58", "kind": "verse_list"}