{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 59"
        },
        "path": "/books/quran:59",
        "titles": {
          "ar": "الحشر",
          "en": "The Exile",
          "ent": "Al-Hashr"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 59,
    "local_index": 59,
    "order": 101,
    "part_type": "Chapter",
    "path": "/books/quran:59",
    "reveal_type": "Medinan",
    "rukus": 3,
    "titles": {
      "ar": "الحشر",
      "en": "The Exile",
      "ent": "Al-Hashr"
    },
    "verse_count": 24,
    "verse_start_index": 5126,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 5127,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:59:1",
        "text": [
          "سَبَّحَ‌ لِلَّهِ‌ مَا فِي‌ السَّمَاوَاتِ‌ وَ مَا فِي‌ الْأَرْضِ‌ وَ هُوَ الْعَزِيزُ الْحَکِيمُ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "WHATEVER IS IN the heavens and the earth sings the praises of God. He is all-mighty and all-wise."
          ],
          "en.ahmedraza": [
            "All whatever is in the heavens and all whatever is in the earth proclaims the Purity of Allah; and He only is the Most Honourable, the Wise."
          ],
          "en.arberry": [
            "All that is in the heavens and the earth magnifies God; He is the All-mighty, the All-wise."
          ],
          "en.daryabadi": [
            "Whatsoever is in the heavens and whatsoever is in the earth halloweth Allah, and He is the Mighty, the Wise."
          ],
          "en.hilali": [
            "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. And He is the All-Mighty, the All-Wise."
          ],
          "en.itani": [
            "Glorifying God is all that exists in the heavens and the earth. He is the Almighty, the Most Wise."
          ],
          "en.maududi": [
            "All that is in the heavens and all that is in the earth extols Allah's Glory: He is the Most Mighty, the Most Wise."
          ],
          "en.mubarakpuri": [
            "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. And He is the Almighty, the All-Wise."
          ],
          "en.pickthall": [
            "All that is in the heavens and all that is in the earth glorifieth Allah, and He is the Mighty, the Wise."
          ],
          "en.qarai": [
            "Whatever there is in the heavens and whatever there is in the earth glorifies Allah, and He is the All-mighty, the All-wise."
          ],
          "en.qaribullah": [
            "All that is in heavens and earth exalt Allah. He is the Almighty, the Wise."
          ],
          "en.sahih": [
            "Whatever is in the heavens and whatever is on the earth exalts Allah, and He is the Exalted in Might, the Wise."
          ],
          "en.sarwar": [
            "All that is in the heavens and the earth glorify God. He is the Majestic and All-wise."
          ],
          "en.shakir": [
            "Whatever is in the heavens and whatever is in the earth declares the glory of Allah, and He is the Mighty, the Wise."
          ],
          "en.transliteration": [
            "Sabba<u>h</u>a lill<u>a</u>hi m<u>a</u> fee a<b>l</b>ssam<u>a</u>w<u>a</u>ti wam<u>a</u> fee alar<u>d</u>i wahuwa alAAazeezu al<u>h</u>akeem<b>u</b>"
          ],
          "en.wahiduddin": [
            "Everything in the heavens and on the earth glorifies God. He is the Almighty, the All Wise."
          ],
          "en.yusufali": [
            "Whatever is in the heavens and on earth, let it declare the Praises and Glory of Allah: for He is the Exalted in Might, the Wise."
          ],
          "fa.ansarian": [
            "آنچه در آسمان ها و آنچه در زمین است، خدا را به پاک بودن از هر عیب و نقصی می ستایند، و او توانای شکست ناپذیر و حکیم است."
          ],
          "fa.ayati": [
            "خداوند را تسبيح گويند هر چه در آسمانها و هر چه در زمين است. و اوست پيروزمند و حكيم."
          ],
          "fa.bahrampour": [
            "آنچه در آسمان‌ها و آنچه در زمين است خدا را تسبيح مى‌گويند، و او شكست ناپذير حكيم است"
          ],
          "fa.fooladvand": [
            "آنچه در آسمانها و در زمين است تسبيح‌گوى خداى هستند، و اوست شكست‌ناپذير سنجيده‌كار."
          ],
          "fa.ghomshei": [
            "هر چه در آسمانها و زمین است همه به تسبیح و ستایش یکتا خدای عالم که مقتدر و حکیم است مشغولند."
          ],
          "fa.khorramdel": [
            "به تسبیح و تقدیس خدا مشغولند تمام چیزهائی که در آسمانها و در زمین هستند، و خدا چیره‌ی کار بجا است. [[«سَبَّحَ ِللهِ ما ...»: (نگا: حدید / 1).]]"
          ],
          "fa.khorramshahi": [
            "آنچه در آسمانها و آنچه در زمین است خداوند را تسبیح می‌گوید، و او پیروزمند فرزانه است‌"
          ],
          "fa.makarem": [
            "آنچه در آسمانها و آنچه در زمین است، برای خدا تسبیح می‌گوید؛ و او عزیز و حکیم است!"
          ],
          "fa.moezzi": [
            "تسبیح گفت خدا را آنچه در آسمانها و آنچه در زمین است و او است عزّتمند حکیم‌"
          ],
          "fa.mojtabavi": [
            "آنچه در آسمانها و آنچه در زمين است خداى را به پاكى مى‌ستايند، و اوست تواناى بى‌همتا و داناى با حكمت."
          ],
          "fa.sadeqi": [
            "آنچه در آسمان‌ها و آنچه در زمین است تسبیح‌گوی خدا بوده‌اند و اوست عزیز سنجیده‌کار."
          ]
        }
      },
      {
        "index": 5128,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:59:2",
        "text": [
          "هُوَ الَّذِي‌ أَخْرَجَ‌ الَّذِينَ‌ کَفَرُوا مِنْ‌ أَهْلِ‌ الْکِتَابِ‌ مِنْ‌ دِيَارِهِمْ‌ لِأَوَّلِ‌ الْحَشْرِ مَا ظَنَنْتُمْ‌ أَنْ‌ يَخْرُجُوا وَ ظَنُّوا أَنَّهُمْ‌ مَانِعَتُهُمْ‌ حُصُونُهُمْ‌ مِنَ‌ اللَّهِ‌ فَأَتَاهُمُ‌ اللَّهُ‌ مِنْ‌ حَيْثُ‌ لَمْ‌ يَحْتَسِبُوا وَ قَذَفَ‌ فِي‌ قُلُوبِهِمُ‌ الرُّعْبَ‌ يُخْرِبُونَ‌ بُيُوتَهُمْ‌ بِأَيْدِيهِمْ‌ وَ أَيْدِي‌ الْمُؤْمِنِينَ‌ فَاعْتَبِرُوا يَا أُولِي‌ الْأَبْصَارِ"
        ],
        "translations": {
          "en.ahmedali": [
            "It is He who drove those among the people of the Book who refused to believe, from their homes for the first confrontation. You did not think that they would go away, and they imagined that their forts would protect them against God. But God came upon them from where they did not suspect, and filled their hearts with terror, so that they destroyed their homes with their own hands (or were destroyed) by the hands of believers. So take heed, O men of sight!"
          ],
          "en.ahmedraza": [
            "It is He Who expelled the disbelievers among the People given the Book(s) from their homes, for their first gathering; you did not expect them to leave, whereas they assumed that their fortresses would save them from Allah, so Allah’s command came to them from a place they had not imagined; and He instilled awe in their hearts, so they ruin their own houses by their own hands and at the hands of the Muslims; therefore learn a lesson, O those who can perceive!"
          ],
          "en.arberry": [
            "It is He who expelled from their habitations the unbelievers among the People of the Book at the first mustering. You did not think that they would go forth, and they thought that their fortresses would defend them against God; then God came upon them from whence they had not reckoned, and He cast terror into their hearts as they destroyed their houses with their own hands, and the hands of the believers; therefore take heed, you who have eyes!"
          ],
          "en.daryabadi": [
            "He it is that drave forth those of the people of the Book who disbelieved from their homes at the first gathering, Ye imagined no that they would go -forth; and they imagined that their fortresses would protect them against Allah. Wherefore Allah came upon them whence they reckoned not, and cast terror in their hearts so that they made their houses desolate with their own hands and the hands of the believers. So learn a lesson. O ye endued with insight!"
          ],
          "en.hilali": [
            "He it is Who drove out the disbelievers among the people of the Scripture (i.e. the Jews of the tribe of Bani An-Nadir) from their homes at the first gathering. You did not think that they would get out. And they thought that their fortresses would defend them from Allah! But Allah's (Torment) reached them from a place whereof they expected it not, and He cast terror into their hearts, so that they destroyed their own dwellings with their own hands and the hands of the believers. Then take admonition, O you with eyes (to see)."
          ],
          "en.itani": [
            "It is He who evicted those who disbelieved among the People of the Book from their homes at the first mobilization. You did not think they would leave, and they thought their fortresses would protect them from God. But God came at them from where they never expected, and threw terror into their hearts. They wrecked their homes with their own hands, and by the hands of the believers. Therefore, take a lesson, O you who have insight."
          ],
          "en.maududi": [
            "He it is Who in the first assault drove forth the People of the Book that disbelieved from their homes at the first gathering of forces. You did not believe that they would leave; while they too thought that their fortresses would defend them against Allah. Then Allah came upon them from whence they did not even imagine, casting such terror into their hearts that they destroyed their homes by their own hands and their destruction was also caused by the hands of the believers. So learn a lesson from this, O you who have perceptive eyes!"
          ],
          "en.mubarakpuri": [
            "He it is Who drove out the disbelievers among the People of the Scripture from their homes at the first gathering. You did not think that they would get out. And they thought that their fortresses would defend them from Allah! But Allah reached them from a place whereof they expected it not, and He cast terror into their hearts so that they demolished their own dwellings with their own hands and the hands of the believers. Then take admonition, O you with eyes."
          ],
          "en.pickthall": [
            "He it is Who hath caused those of the People of the Scripture who disbelieved to go forth from their homes unto the first exile. Ye deemed not that they would go forth, while they deemed that their strongholds would protect them from Allah. But Allah reached them from a place whereof they recked not, and cast terror in their hearts so that they ruined their houses with their own hands and the hands of the believers. So learn a lesson, O ye who have eyes!"
          ],
          "en.qarai": [
            "It is He who expelled the faithless belonging to the People of the Book from their homes at the outset of [their] en masse banishment. You did not think that they would go out, and they thought their fortresses would protect them from Allah. But Allah came at them from whence they did not suppose and He cast terror into their hearts. They demolish their houses with their own hands and the hands of the faithful. So take lesson, O you who have insight!"
          ],
          "en.qaribullah": [
            "It was He who expelled the unbelievers among the People of the Book from their homes into the first exile. You did not think that they would go out, and they thought their fortresses would protect them from Allah. But Allah came upon them from where they did not expect, casting terror into their hearts that their homes were destroyed by their own hands as well as by the hands of the believers. Therefore, take heed you that have eyes."
          ],
          "en.sahih": [
            "It is He who expelled the ones who disbelieved among the People of the Scripture from their homes at the first gathering. You did not think they would leave, and they thought that their fortresses would protect them from Allah; but [the decree of] Allah came upon them from where they had not expected, and He cast terror into their hearts [so] they destroyed their houses by their [own] hands and the hands of the believers. So take warning, O people of vision."
          ],
          "en.sarwar": [
            "It is He who drove the disbelievers among the followers of the Bible out of their homes (in the Arabian Peninsula) as the first time exiles. You did not think that they would leave their homes and they thought that their fortresses would save them from God. The decree of God came upon them in a way that even they did not expect. He caused such terror to enter their hearts that they started to destroy their own homes by their own hands and by those of the believers. People of vision, learn from this a lesson."
          ],
          "en.shakir": [
            "He it is Who caused those who disbelieved of the followers of the Book to go forth from their homes at the first banishment you did not think that they would go forth, while they were certain that their fortresses would defend them against Allah; but Allah came to them whence they did not expect, and cast terror into their hearts; they demolished their houses with their own hands and the hands of the believers; therefore take a lesson, O you who have eyes!"
          ],
          "en.transliteration": [
            "Huwa alla<u>th</u>ee akhraja alla<u>th</u>eena kafaroo min ahli alkit<u>a</u>bi min diy<u>a</u>rihim liawwali al<u>h</u>ashri m<u>a</u> <i><u>th</u></i>anantum an yakhrujoo wa<i><u>th</u></i>annoo annahum m<u>a</u>niAAatuhum <u>h</u>u<u>s</u>oonuhum mina All<u>a</u>hi faat<u>a</u>humu All<u>a</u>hu min <u>h</u>aythu lam ya<u>h</u>tasiboo waqa<u>th</u>afa fee quloobihimu a<b>l</b>rruAAba yukhriboona buyootahum biaydeehim waaydee almumineena fa<b>i</b>AAtabiroo y<u>a</u> olee alab<u>sa</u>r<b>i</b>"
          ],
          "en.wahiduddin": [
            "It was He who turned those People of the Book who denied the truth out of their homes in the first banishment. You never thought they would go, and they thought their strongholds would protect them against God. But God came upon them from where they least expected and cast such terror into their hearts that their houses were pulled down by their own hands as well as by the hands of the believers. Learn a lesson, then, you who are endowed with insight."
          ],
          "en.yusufali": [
            "It is He Who got out the Unbelievers among the People of the Book from their homes at the first gathering (of the forces). Little did ye think that they would get out: And they thought that their fortresses would defend them from Allah! But the (Wrath of) Allah came to them from quarters from which they little expected (it), and cast terror into their hearts, so that they destroyed their dwellings by their own hands and the hands of the Believers, take warning, then, O ye with eyes (to see)!"
          ],
          "fa.ansarian": [
            "اوست که کافرانِ از اهل کتاب را در نخستین بیرون راندن دسته جمعی از خانه هایشان بیرون راند. [شما اهل ایمان] رفتنشان را گمان نمی بردید، و خودشان پنداشتند که حصارها و دژهای استوارشان در برابر خدا [از تبعید و در به دری آنان] جلوگیری خواهد کرد ولی [اراده کوبنده] خدا از آنجا که گمان نمی کردند به سراغشان آمد و در دل هایشان رعب و ترس افکند به گونه ای که خانه هایشان را به دست خود و به دست مؤمنان ویران کردند. پس ای صاحبان بینش و بصیرت! عبرت گیرید."
          ],
          "fa.ayati": [
            "اوست آن خدايى كه نخستين بار كسانى از اهل كتاب را كه كافر بودند، از خانه‌هايشان بيرون راند و شما نمى‌پنداشتيد كه بيرون روند. آنها نيز مى‌پنداشتند حصارهاشان را توان آن هست كه در برابر خدا نگهدارشان باشد. خدا از سويى كه گمانش را نمى‌كردند بر آنها تاخت آورد و در دلشان وحشت افكند، چنان كه خانه‌هاى خود را به دست خود و به دست مؤمنان خراب مى‌كردند. پس اى اهل بصيرت، عبرت بگيريد."
          ],
          "fa.bahrampour": [
            "اوست آن كه كافران اهل كتاب (بنى نضير) را براى نخستين تبعيد دسته جمعى از خانه‌هايشان بيرون راند. شما گمان نمى‌كرديد كه [به اين آسانى‌] بيرون روند، و خودشان هم مى‌پنداشتند كه قلعه‌هايشان نگهدارشان از [خشم‌] خداست، اما خدا از آن جايى كه تصور نمى‌كردند ب"
          ],
          "fa.fooladvand": [
            "اوست كسى كه، از ميان اهل كتاب كسانى را كه كفر ورزيدند در نخستين اخراج [از مدينه‌] بيرون كرد. گمان نمى‌كرديد كه بيرون روند و خودشان گمان داشتند كه دژهايشان در برابر خدا مانع آنها خواهد بود، و[لى‌] خدا از آنجايى كه تصوّر نمى‌كردند بر آنان درآمد و در دلهايشان بيم افكند، [به طورى كه‌] خود به دست خود و دست مؤمنان خانه‌هاى خود را خراب مى‌كردند. پس اى ديده‌وران، عبرت گيريد."
          ],
          "fa.ghomshei": [
            "اوست خدایی که کافران اهل کتاب را (یعنی یهود بنی نضیر را که به مکر، قصد قتل پیغمبر صلّی اللّه علیه و آله کردند) برای اولین بار همگی را از دیارشان بیرون کرد و هرگز شما مسلمین گمان نمی‌کردید که آنها از دیار خود بیرون روند و آنها هم حصارهای محکم خود را نگهبان خود از (قهر و انتقام) خدا می‌پنداشتند تا آنکه (عذاب) خدا از آنجا که گمان نمی‌بردند بدانها فرا رسید و در دلشان (از سپاه اسلام) ترس افکند تا به دست خود و به دست مؤمنان خانه‌هاشان را ویران می‌کردند، پس ای هوشیاران عالم پند و عبرت گیرید."
          ],
          "fa.khorramdel": [
            "او کسی است که کافران اهل کتاب را در نخستین گردهمآئی (و لشکرکشی مسلمانان و برخورد با ایشان در پیرامون مدینه) از سرزمینشان بیرون راند (و به خیبر کوچاند). شما گمان نمی‌بردید که آنان بیرون روند، و ایشان هم گمان می‌بردند که دژهایشان آنان را از عذاب خدا بدور می‌دارد. امّا خدا از جانبی به سراغشان رفت که فکرش را نمی‌کردند (از آن جانب بر آنان بتازند). به دلهایشان هراس انداخت، بگونه‌ای که با دستهای خود و با دستهای مؤمنان خانه‌های خویش را ویران می‌کردند! ای خردمندان! درس عبرت بگیرید. [[«أَهْلِ الْکِتابِ»: مراد یهودیان بنی‌نضیر است که در دو میلی مدینه زندگی می‌کردند. به هنگام هجرت پیغمبر به مدینه، با آن حضرت پیمان بستند که بی‌طرف بمانند و به نفع و یا به زیان مسلمانان کار نکنند. بعد از شکست مسلمانان در جنگ احد، بنای بدرفتاری نهادند و حتی در صدد قتل پیغمبر برآمدند و با قریشیان علیه مسلمانان پیمان بستند. به دستور پیغمبر رئیس ایشان کعب پسر اشرف به قتل رسید، و بنی‌نضیر از پیرامون مدینه بیرون رانده شدند و آنان به خیبر رفتند. «حَشْر»: گردهمآئی مردم و لشکرکشی ایشان بر سر قومی. گردآوردن مردمانی و بیرون کردن آنان از جائی. «لاَِوَّلِ الْحَشْرِ»: هنگام نخستین گردهمآئی، و جمع‌آوری کسانی و بیرون راندن آنان، واژه (ل) به معنی (عِندَ) یعنی (هنگام) است (نگا: اسراء / 78). اضافه (اوّل) به (الْحَشْر) اضافه صفت به موصوف است. حشر اوّل، اخراج بنی‌نضیر از اطراف مدینه به خیبر است. حشر ثانی، اخراج بنی‌نضیر و همه یهودیان دیگر است از جزیرةالعرب به شام در زمان امیرالمؤمنین عمر.]]"
          ],
          "fa.khorramshahi": [
            "اوست که کافران اهل کتاب [یهودیان بنی‌نضیر] را از خانه و کاشانه‌شان در آغاز هنگامه رهسپاری انبوه آواره کرد، گمان نمی‌بردید که بیرون روند، و [خودشان هم‌] گمان می‌کردند که دژهایشان باز دارنده آنان در برابر امر و عقوبت الهی است، و امر [/عذاب‌] الهی از جایی که گمانش را نمی‌بردند بر آنان فرود آمد و در دلهایشان هراس انداخت، [چندانکه‌] خانه‌هایشان را به دستهای خود و دستان مؤمنان ویران می‌کردند، پس ای دیده‌وران عبرت گیرید"
          ],
          "fa.makarem": [
            "او کسی است که کافران اهل کتاب را در نخستین برخورد (با مسلمانان) از خانه‌هایشان بیرون راند! گمان نمی‌کردید آنان خارج شوند، و خودشان نیز گمان می‌کردند که دِژهای محکمشان آنها را از عذاب الهی مانع می‌شود؛ امّا خداوند از آنجا که گمان نمی‌کردند به سراغشان آمد و در دلهایشان ترس و وحشت افکند، بگونه‌ای که خانه‌های خود را با دست خویش و با دست مؤمنان ویران می‌کردند؛ پس عبرت بگیرید ای صاحبان چشم!"
          ],
          "fa.moezzi": [
            "او است آنکه برون آورد آنان را که کفر ورزیدند از اهل کتاب از خانه‌های خویش در آغاز گردآوردن گمان نمی‌کردید که برون روند و می‌پنداشتند که بازدارنده است آنان را دژهای ایشان از خدا پس بیامدشان خدا از جائی که نمی‌پنداشتند و افکند در دلهای ایشان هراس را ویران می‌کردند خانه‌های خود را با دستهای خود و دستهای مؤمنان پس عبرت گیرید ای دارندگان خردها (یا دیدگان)"
          ],
          "fa.mojtabavi": [
            "اوست آن كه كسانى از اهل كتاب- جهودان بنى النضير- را كه كفر ورزيدند در نخستين بيرون‌راندن دسته‌جمعى از خانه‌شان بيرون راند. شما گمان نداشتيد كه [به اين آسانى‌] بيرون روند و خود پنداشتند كه باروهاشان بازدارنده آنها از [فرمان‌] خداست، پس [فرمان‌] خداى از آنجا كه گمان نمى‌بردند بديشان آمد- گرفتارشان كرد- و در دلهاشان بيم افكند، خانه‌هاى خويش را به دستهاى خودشان و دستهاى مؤمنان ويران مى‌كردند، پس اى خداوندان بينش، عبرت گيريد."
          ],
          "fa.sadeqi": [
            "اوست کسی که، از میان اهل کتاب کسانی را که کافر شدند در نخستین جمع (از مدینه) بیرون راند، (حال آنکه) گمان نمی‌کردید که بیرون روند و خودشان همواره گمان داشتند که دژهایشان از (عذاب) خدا نگهبانشان است. پس خدا از جایی که هرگز گمان نمی‌کردند بر آنان درآمد و در دل‌هایشان بیم افکند، در حالی که خودشان به دست‌های خودشان و دست‌های مؤمنان خانه‌های خود را خراب می‌کنند. پس ای صاحب‌نظران! عبرت گیرید."
          ]
        }
      },
      {
        "index": 5129,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:59:3",
        "text": [
          "وَ لَوْ لاَ أَنْ‌ کَتَبَ‌ اللَّهُ‌ عَلَيْهِمُ‌ الْجَلاَءَ لَعَذَّبَهُمْ‌ فِي‌ الدُّنْيَا وَ لَهُمْ‌ فِي‌ الْآخِرَةِ عَذَابُ‌ النَّارِ"
        ],
        "translations": {
          "en.ahmedali": [
            "Had God not decreed the expulsion for them He would have punished them in this world, and in the next the punishment of Hell would have been theirs."
          ],
          "en.ahmedraza": [
            "And had Allah not decreed exile for them, He would have surely punished them in this world; and for them in the Hereafter is the punishment of the fire."
          ],
          "en.arberry": [
            "Had God not prescribed dispersal for them, He would have chastised them in this world; and there awaits them in the world to come the chastisement of the Fire."
          ],
          "en.daryabadi": [
            "And had not Allahg prescribed banishment for them, surely He would have tormented them in the world; and theirs in the Hereafter is the torment of the Fire."
          ],
          "en.hilali": [
            "And had it not been that Allah had decreed exile for them, He would certainly have punished them in this world, and in the Hereafter theirs shall be the torment of the Fire."
          ],
          "en.itani": [
            "Had God not decreed exile for them, He would have punished them in this life. But in the Hereafter they will have the punishment of the Fire."
          ],
          "en.maududi": [
            "If Allah had not decreed banishment for them, He would certainly have chastised them in this world. As for the Hereafter, the chastisement of the Fire awaits them."
          ],
          "en.mubarakpuri": [
            "And had it not been that Allah had decreed exile for them, He would certainly have punished them in this world; and in the Hereafter theirs shall be the torment of the Fire."
          ],
          "en.pickthall": [
            "And if Allah had not decreed migration for them, He verily would have punished them in the world, and theirs in the Hereafter is the punishment of the Fire."
          ],
          "en.qarai": [
            "If Allah had not ordained banishment for them, He would have surely punished them in this world, and in the Hereafter, there is the punishment of the Fire for them."
          ],
          "en.qaribullah": [
            "Had it been that Allah had not decreed that they should be dispersed, He would have surely punished them in this world. And in the Everlasting Life thepunishment of the Fire awaits them,"
          ],
          "en.sahih": [
            "And if not that Allah had decreed for them evacuation, He would have punished them in [this] world, and for them in the Hereafter is the punishment of the Fire."
          ],
          "en.sarwar": [
            "Had God not decreed exile for them, He would have certainly punished them (in some other way). In this life and in the next life they would have suffered the torment of hell fire."
          ],
          "en.shakir": [
            "And had it not been that Allah had decreed for them the exile, He would certainly have punished them in this world, and in the hereafter they shall have chastisement of the fire."
          ],
          "en.transliteration": [
            "Walawl<u>a</u> an kataba All<u>a</u>hu AAalayhimu aljal<u>a</u>a laAAa<u>thth</u>abahum fee a<b>l</b>dduny<u>a</u> walahum fee al<u>a</u>khirati AAa<u>tha</u>bu a<b>l</b>nn<u>a</u>r<b>i</b>"
          ],
          "en.wahiduddin": [
            "If God had not prescribed exile for them, He would surely have punished them in this world. But they shall have the torment of Fire in the Hereafter,"
          ],
          "en.yusufali": [
            "And had it not been that Allah had decreed banishment for them, He would certainly have punished them in this world: And in the Hereafter they shall (certainly) have the Punishment of the Fire."
          ],
          "fa.ansarian": [
            "اگر خدا فرمان ترک وطن را بر آنان لازم و مقرّر نکرده بود، قطعاً در همین دنیا عذابشان می کرد و برای آنان در آخرت عذاب آتش است."
          ],
          "fa.ayati": [
            "اگر نه آن بود كه خدا ترك ديار را بر آنها مقرر كرده بود، در دنيا به عذاب گرفتارشان مى‌كرد و در آخرتشان عذاب آتش است."
          ],
          "fa.bahrampour": [
            "و اگر خدا جلاى وطن را بر آنها مقرر نكرده بود، قطعا آنها را در دنيا عذاب مى‌كرد، و آنها را در آخرت عذاب آتش است"
          ],
          "fa.fooladvand": [
            "و اگر خدا اين جلاى وطن را بر آنان مقرّر نكرده بود، قطعاً آنها را در دنيا عذاب مى‌كرد و در آخرت [هم‌] عذاب آتش داشتند."
          ],
          "fa.ghomshei": [
            "و اگر خدا بر آنها حکم جلاء وطن نمی‌کرد (سخت‌تر از آن) در دنیا (به قتل و اسارت مانند کفار بدر) معذّبشان می‌کرد و (به هر حال) عذاب آتش در آخرت بر آنها خواهد بود."
          ],
          "fa.khorramdel": [
            "اگر خداوند ترک دیار را بر آنان مقرّر نمی‌کرد، در دنیا ایشان را به عذاب (سخت‌تر از اخراج) گرفتار می‌نمود. (بدا به حالشان! گذشته از این خفّت اخراج دنیوی) آنان در آخرت عذاب آتش دوزخ دارند. [[«الْجَلآءَ»: کوچ از شهر و دیار. ترک خانه و کاشانه.]]"
          ],
          "fa.khorramshahi": [
            "و اگر خداوند جلای وطن را بر آنان مقرر نداشته بود، در دنیا [به عذابی سهمگین‌] معذبشان می‌داشت، و برای آنان در آخرت عذاب آتش دوزخ است‌"
          ],
          "fa.makarem": [
            "و اگر نه این بود که خداوند ترک وطن را بر آنان مقرّر داشته بود، آنها را در همین دنیا مجازات می‌کرد؛ و برای آنان در آخرت نیز عذاب آتش است!"
          ],
          "fa.moezzi": [
            "و اگر نبود اینکه نوشته است خدا بر ایشان کوچ را هر آینه شکنجه می‌کرد ایشان را در دنیا و ایشان را است در آخرت عذاب آتش‌"
          ],
          "fa.mojtabavi": [
            "و اگر نه اين بود كه خدا بيرون‌شدن از خانمان- جلاى وطن- را بر آنان نوشته بود هر آينه در اين جهان عذابشان مى‌كرد، و آنها را در آن جهان عذاب دوزخ است."
          ],
          "fa.sadeqi": [
            "و اگر خدا جلای وطن را بر آنان مقرّر نکرده بود، همواره آنان را در دنیا عذاب می‌کرد و در آخرت (هم) برایشان عذاب آتش است."
          ]
        }
      },
      {
        "index": 5130,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:59:4",
        "text": [
          "ذٰلِکَ‌ بِأَنَّهُمْ‌ شَاقُّوا اللَّهَ‌ وَ رَسُولَهُ‌ وَ مَنْ‌ يُشَاقِ‌ اللَّهَ‌ فَإِنَ‌ اللَّهَ‌ شَدِيدُ الْعِقَابِ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "For they had opposed God and His Apostle; and whosoever opposes God, then God is severe in retribution."
          ],
          "en.ahmedraza": [
            "This is because they remained opposed to Allah and His Noble Messenger; and whoever remains opposed to Allah, (and His Noble Messenger) – then indeed Allah’s punishment is severe."
          ],
          "en.arberry": [
            "That is because they made a breach with God and His Messenger; and whosoever makes a breach with God, God is terrible in retribution."
          ],
          "en.daryabadi": [
            "That is because they opposed Allah and His apostle, and whosoever opposeth Allah, then verily Allah is Stern in chastisement."
          ],
          "en.hilali": [
            "That is because they opposed Allah and His Messenger (Muhammad SAW). And whosoever opposes Allah, then verily, Allah is Severe in punishment."
          ],
          "en.itani": [
            "That is because they opposed God and His Messenger. Whoever opposes God—God is stern in retribution."
          ],
          "en.maududi": [
            "That is because they set themselves against Allah and His Messenger; and whoever sets himself against Allah should know that Allah is surely Most Stern in retribution."
          ],
          "en.mubarakpuri": [
            "That is because they opposed Allah and His Messenger. And whosoever opposes Allah, then verily, Allah is Severe in punishment."
          ],
          "en.pickthall": [
            "That is because they were opposed to Allah and His messenger; and whoso is opposed to Allah, (for him) verily Allah is stern in reprisal."
          ],
          "en.qarai": [
            "That is because they defied Allah and His Apostle; and whoever defies Allah, Allah is indeed severe in retribution."
          ],
          "en.qaribullah": [
            "because they broke their promise with Allah and His Messenger; and whosoever breaks their promise with Allah Allah is Stern in retribution."
          ],
          "en.sahih": [
            "That is because they opposed Allah and His Messenger. And whoever opposes Allah - then indeed, Allah is severe in penalty."
          ],
          "en.sarwar": [
            "This is because they opposed God and His Messenger and whoever opposes God should know that God's retribution is severe."
          ],
          "en.shakir": [
            "That is because they acted in opposition to Allah and His Apostle, and whoever acts in opposition to Allah, then surely Allah is severe in retributing (evil)."
          ],
          "en.transliteration": [
            "<u>Tha</u>lika biannahum sh<u>a</u>qqoo All<u>a</u>ha warasoolahu waman yush<u>a</u>qqi All<u>a</u>ha fainna All<u>a</u>ha shadeedu alAAiq<u>a</u>b<b>i</b>"
          ],
          "en.wahiduddin": [
            "because they set themselves against God and His Messenger: God is stern in His punishment of anyone who sets himself against Him."
          ],
          "en.yusufali": [
            "That is because they resisted Allah and His Messenger: and if any one resists Allah, verily Allah is severe in Punishment."
          ],
          "fa.ansarian": [
            "این [در به دری و تبعید] برای این است که آنان با خدا و پیامبرش دشمنی و مخالفت کردند، و هر کس با خدا دشمنی و مخالفت کند [بداند که] خدا سخت کیفر است."
          ],
          "fa.ayati": [
            "و اين به كيفر آن بود كه با خدا و پيامبرش مخالفت ورزيدند؛ و هر كه با خدا مخالفت مى‌ورزد بداند كه خدا به سختى عقوبت مى‌كند."
          ],
          "fa.bahrampour": [
            "اين [جلاى وطن‌] براى آن بود كه آنها با خدا و رسولش در افتادند، و هر كس با خدا درافتد، [بداند كه‌] خدا سخت كيفر است"
          ],
          "fa.fooladvand": [
            "اين [عقوبت‌] براى آن بود كه آنها با خدا و پيامبرش در افتادند؛ و هر كس با خدا درافتد؛ [بداند كه‌] خدا سخت‌كيفر است."
          ],
          "fa.ghomshei": [
            "این (جلاء وطن و آوارگی آنها) برای این بود که آنان با خدا و رسول او سخت دشمنی و مخالفت کردند و هر که با خدا (و رسولش) دشمنی آغازد عقاب خدا بسیار سخت است."
          ],
          "fa.khorramdel": [
            "این (کیفر دنیوی و اخروی) بدان خاطر است که آنان با خدا و پیغمبرش دشمنی ورزیده‌اند، و هر کس با خدا دشمنی ورزد (خدا او را به اشدّ مجازات می‌رساند) چرا که خدا سخت عذاب می‌دهد. [[«مَن یُشَآقِّ اللهَ ...»: هر کس با خدا دشمنی ورزد. جزای (مَنْ) محذوف است، و یا این که جمله (فَإِنَّ اللهَ شَدِیدُ الْعِقَابِ) جزای آن است و عائد آن محذوف است.]]"
          ],
          "fa.khorramshahi": [
            "این از آن است که با [امر] خداوند و پیامبرش مخالفت کردند، و هر کس با امر خداوند مخالفت کند، بی‌گمان خداوند سخت کیفر است‌"
          ],
          "fa.makarem": [
            "این به خاطر آن است که آنها با خدا و رسولش دشمنی کردند؛ و هر کس با خدا دشمنی کند (باید بداند) که خدا مجازات شدیدی دارد!"
          ],
          "fa.moezzi": [
            "این بدان است که ستیزه کردند با خدا و پیمبرش و آنکه بستیزد با خدا همانا خدا است سخت‌عقوبت‌"
          ],
          "fa.mojtabavi": [
            "اين [عذاب‌] به كيفر آنست كه با خداى و پيامبرش دشمنى و مخالفت ورزيدند، و هر كه با خداى دشمنى و مخالفت ورزد پس [بداند كه‌] خدا سخت كيفر است."
          ],
          "fa.sadeqi": [
            "این (دربه‌دری) برای آن بود که آنان همواره با خدا و پیامبرش جدایی کردند و هر که با خدا جدایی کند همانا خدا سخت‌کیفر است."
          ]
        }
      },
      {
        "index": 5131,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:59:5",
        "text": [
          "مَا قَطَعْتُمْ‌ مِنْ‌ لِينَةٍ أَوْ تَرَکْتُمُوهَا قَائِمَةً عَلَى‌ أُصُولِهَا فَبِإِذْنِ‌ اللَّهِ‌ وَ لِيُخْزِيَ‌ الْفَاسِقِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "The palm trees that you cut down or left standing intact was by God's dispensation, so that He might disgrace the transgressors."
          ],
          "en.ahmedraza": [
            "The trees you had cut down or left standing on their roots was all by Allah’s permission, and in order to disgrace the sinners."
          ],
          "en.arberry": [
            "Whatever palm-trees you cut down, or left standing upon their roots, that was by God's leave, and that He might degrade the ungodly."
          ],
          "en.daryabadi": [
            "Whatsoever fine palms ye cut down or left standing on roots there of, it was by the leave of Allah, and in order that He might abase the transgressors."
          ],
          "en.hilali": [
            "What you (O Muslims) cut down of the palm-trees (of the enemy), or you left them standing on their stems, it was by Leave of Allah, and in order that He might disgrace the Fasiqun (rebellious, disobedient to Allah)."
          ],
          "en.itani": [
            "Whether you cut down a tree, or leave it standing on its trunk, it is by God’s will. He will surely disgrace the sinners."
          ],
          "en.maududi": [
            "The palm-trees that you cut down or those that you left standing on their roots, it was by Allah's leave that you did so. (Allah granted you this leave) in order that He might humiliate the evil-doers."
          ],
          "en.mubarakpuri": [
            "What you cut down of the Linah, or you left them standing on their stems, it was by leave of Allah, and in order that He might disgrace the rebellious."
          ],
          "en.pickthall": [
            "Whatsoever palm-trees ye cut down or left standing on their roots, it was by Allah's leave, in order that He might confound the evil-livers."
          ],
          "en.qarai": [
            "Whatever palm trees you cut down or left standing on their roots, it was by Allah’s will and in order that He may disgrace the transgressors."
          ],
          "en.qaribullah": [
            "Whatever palmtree you cut down or left standing upon its roots, it is by the permission of Allah, so that He might humiliate the impious."
          ],
          "en.sahih": [
            "Whatever you have cut down of [their] palm trees or left standing on their trunks - it was by permission of Allah and so He would disgrace the defiantly disobedient."
          ],
          "en.sarwar": [
            "All the productive palm-trees (of the Jews hostile to you) which you cut down or left untouched were the will of God to bring disgrace upon the evil-doers."
          ],
          "en.shakir": [
            "Whatever palm-tree you cut down or leave standing upon its roots, It is by Allah's command, and that He may abase the transgressors."
          ],
          "en.transliteration": [
            "M<u>a</u> qa<u>t</u>aAAtum min leenatin aw taraktumooh<u>a</u> q<u>a</u>imatan AAal<u>a</u> o<u>s</u>oolih<u>a</u> fabii<u>th</u>ni All<u>a</u>hi waliyukhziya alf<u>a</u>siqeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "Whatever palm trees you cut down or left standing on their roots, it was by God's leave, so that He might disgrace the transgressors."
          ],
          "en.yusufali": [
            "Whether ye cut down (O ye Muslim!) The tender palm-trees, or ye left them standing on their roots, it was by leave of Allah, and in order that He might cover with shame the rebellious transgresses."
          ],
          "fa.ansarian": [
            "آنچه از درخت خرما [که در مالکیّت این دشمنان غدّار بود] بریدید یا آنها را بر ریشه ها و تنه هایش رها کردید، به فرمان خدا بود، تا نافرمانان را زبون و رسوا کند."
          ],
          "fa.ayati": [
            "هر درخت خرمايى را كه بريديد، يا آن را بر ريشه‌اش باقى گذارديد، به فرمان خدا بود تا نافرمانان خوار گردند."
          ],
          "fa.bahrampour": [
            "هر نخله‌اى را كه قطع كرديد يا آن را بر ريشه‌هايش ايستاده وا نهاديد، همه به خواست خدا بود، و تا فاسقان را خوار كند"
          ],
          "fa.fooladvand": [
            "آنچه درخت خرما بريديد يا آنها را [دست نخورده‌] بر ريشه‌هايشان بر جاى نهاديد، به فرمان خدا بود، تا نافرمانان را خوار گرداند."
          ],
          "fa.ghomshei": [
            "آنچه از درختان خرما را (که در دیار بنی نضیر) بریدید و آنچه را بر پا گذاشتید همه به امر خدا (و صلاح اسلام) و برای خواری و سرکوبی جهودان فاسق نابکار بود."
          ],
          "fa.khorramdel": [
            "هر درخت خرمائی را که بریدید، یا بر پایه‌ها و ریشه‌های خود برجای گذاشتید، به فرمان خدا و اجازه‌ی او بوده است (و گناهی متوجّه شما مسلمانان نمی‌باشد. خدا این کار را کرده است) تا بیرون‌روندگان (از دستورات الهی و منحرفان از شرائع آسمانی) را خوار و رسوا گرداند. [[«لِینَةٍ»: درخت خرما. نوع خوب و ممتاز درخت خرما. «أُصُول»: جمع أَصْل، پایه. ریشه. «لِیُخْزِیَ الْفَاسِقِینَ»: متعلق به محذوفی مثل (أَذِنَ) است. أَذِنَ فِی قَطْعِ الأشْجَارِ لِیُخْزِیَ.]]"
          ],
          "fa.khorramshahi": [
            "هر چه از درختان خرما بریدید یا آن را ایستاده با ریشه‌هایش باقی گذاردید، همه به اذن الهی بود تا نافرمانان را خوار بدارد"
          ],
          "fa.makarem": [
            "هر درخت باارزش نخل را قطع کردید یا آن را به حال خود واگذاشتید، همه به فرمان خدا بود؛ و برای این بود که فاسقان را خوار و رسوا کند!"
          ],
          "fa.moezzi": [
            "آنچه بریدید از خرمابنها یا بازگذاردید آنها را ایستاده بر بنهای خود پس به دستور خدا است و تا خوار سازد نافرمانان را"
          ],
          "fa.mojtabavi": [
            "آنچه از درختان خرما بريديد يا آنها را ايستاده بر پاى خود واگذاشتيد همه به خواست و فرمان خدا بود [تا شما را يارى دهد و پيروز گرداند] و تا بدكاران نافرمان- جهودان- را خوار و رسوا كند."
          ],
          "fa.sadeqi": [
            "آنچه از نهال (خرما) بریدید یا آنها را (دست نخورده) بر ریشه‌هایشان بر جای نهادید، به اذن خداست و برای اینکه (خدا) نافرمانان را خوار گرداند."
          ]
        }
      },
      {
        "index": 5132,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:59:6",
        "text": [
          "وَ مَا أَفَاءَ اللَّهُ‌ عَلَى‌ رَسُولِهِ‌ مِنْهُمْ‌ فَمَا أَوْجَفْتُمْ‌ عَلَيْهِ‌ مِنْ‌ خَيْلٍ‌ وَ لاَ رِکَابٍ‌ وَ لٰکِنَ‌ اللَّهَ‌ يُسَلِّطُ رُسُلَهُ‌ عَلَى‌ مَنْ‌ يَشَاءُ وَ اللَّهُ‌ عَلَى‌ کُلِ‌ شَيْ‌ءٍ قَدِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "You did not charge with horse or camel for whatever (spoils) God gave His Apostle from them. In any case, God gives authority to His Apostle over whomsoever He please. God has power over everything."
          ],
          "en.ahmedraza": [
            "And from them, the booty which Allah gave to His Noble Messenger – so you had not raced your horses or camels against them, but it is Allah Who gives whomever He wills within the control of His Noble Messengers; and Allah is Able to do all things."
          ],
          "en.arberry": [
            "And whatever spoils of war God has given unto His Messenger from them, against that you pricked neither horse nor camel; but God gives authority to His Messengers over whomsoever He will. God is powerful over everything."
          ],
          "en.daryabadi": [
            "And as to that which Allah restored Unto His apostle from them, ye rushed neither horse nor camel upon it but Allah giveth His apostles mastery over whomsoever He will. And Allah Is -over everything potent."
          ],
          "en.hilali": [
            "And what Allah gave as booty (Fai') to His Messenger (Muhammad SAW) from them, for which you made no expedition with either cavalry or camelry. But Allah gives power to His Messengers over whomsoever He wills. And Allah is Able to do all things."
          ],
          "en.itani": [
            "Whatever God has bestowed upon His Messenger from them; you spurred neither horse nor camel for them, but God gives authority to His messengers over whomever He will. God is Able to do all things."
          ],
          "en.maududi": [
            "Whatever Allah has taken away from them and bestowed (as spoils) on His Messenger for which you spurred neither horses nor camels; but Allah grants authority to His Messengers over whomsoever He pleases. Allah has power over everything."
          ],
          "en.mubarakpuri": [
            "And what Allah gave as booty (Fai') to His Messenger from them -- for this you made no expedition with either cavalry or camelry. But Allah gives power to His Messengers over whomsoever He wills. And Allah is Able to do all things."
          ],
          "en.pickthall": [
            "And that which Allah gave as spoil unto His messenger from them, ye urged not any horse or riding-camel for the sake thereof, but Allah giveth His messenger lordship over whom He will. Allah is Able to do all things."
          ],
          "en.qarai": [
            "The spoils that Allah gave to His Apostle from them, you did not spur any horse for its sake, nor any riding camel, but Allah makes His apostles prevail over whomever He wishes, and Allah has power over all things."
          ],
          "en.qaribullah": [
            "And whatever spoils of war Allah has given to His Messenger from them, you hastened on neither horse nor camel against them, but Allah gives HisMessengers authority over whom He will. Allah is Powerful over all things."
          ],
          "en.sahih": [
            "And what Allah restored [of property] to His Messenger from them - you did not spur for it [in an expedition] any horses or camels, but Allah gives His messengers power over whom He wills, and Allah is over all things competent."
          ],
          "en.sarwar": [
            "Since you did not have to exhaust your horses and camels or (even fight), God granted to His Messenger their property. God gives authority to His Messenger over whomever He wants. God has power over all things."
          ],
          "en.shakir": [
            "And whatever Allah restored to His Apostle from them you did not press forward against it any horse or a riding camel but Allah gives authority to His apostles against whom He pleases, and Allah has power over all things."
          ],
          "en.transliteration": [
            "Wam<u>a</u> af<u>a</u>a All<u>a</u>hu AAal<u>a</u> rasoolihi minhum fam<u>a</u> awjaftum AAalayhi min khaylin wal<u>a</u> rik<u>a</u>bin wal<u>a</u>kinna All<u>a</u>ha yusalli<u>t</u>u rusulahu AAal<u>a</u> man yash<u>a</u>o wa<b>A</b>ll<u>a</u>hu AAal<u>a</u> kulli shayin qadeer<b>un</b>"
          ],
          "en.wahiduddin": [
            "Whatever God has given to His Messenger as spoils from them is by His grace; you spurred neither horse nor camel for them, but God gives power to His messengers over anyone He wills. God has power over all things --"
          ],
          "en.yusufali": [
            "What Allah has bestowed on His Messenger (and taken away) from them - for this ye made no expedition with either cavalry or camelry: but Allah gives power to His messengers over any He pleases: and Allah has power over all things."
          ],
          "fa.ansarian": [
            "اموال و زمین هایی را که خدا به عنوان غنیمت به پیامبرش بازگرداند، شما برای به دست آوردنش اسب و شتری نتازاندید [و در نتیجه به زحمت نیفتادید]، ولی خدا پیامبرانش را بر هر که بخواهد مسلط و چیره می کند، و خدا بر هر کاری تواناست."
          ],
          "fa.ayati": [
            "و آنچه خدا از داراييشان به پيامبر خود غنيمت داد، آن نبود كه شما با اسب يا شترى بر آن تاخته بوديد؛ بلكه خدا پيامبرانش را بر هر كه بخواهد مسلط مى‌سازد، و خدا بر هر چيزى قادر است."
          ],
          "fa.bahrampour": [
            "و آنچه را خدا از [اموال‌] آنان (يهوديان) به رسم «فيى‌ء» عايد پيامبر خود گردانيد، شما [براى به دست آوردن آن‌] هيچ اسب و شترى بر آن نتاختيد [پس در آن حقى نداريد] و ليكن خداست كه فرستادگان خود را بر هر كه بخواهد چيره مى‌گرداند، و خدا بر هر كارى تواناست"
          ],
          "fa.fooladvand": [
            "و آنچه را خدا از آنان به رسم غنيمت عايد پيامبر خود گردانيد، [شما براى تصاحب آن‌] اسب يا شترى بر آن نتاختيد، ولى خدا فرستادگانش را بر هر كه بخواهد چيره مى‌گرداند، و خدا بر هر كارى تواناست."
          ],
          "fa.ghomshei": [
            "و آنچه را که خدا از (مال) آنها به رسم غنیمت به رسول خود باز داد (متعلق به رسول است، زیرا) شما سپاهیان اسلام بر آن هیچ اسب و شتری نتاختید و لیکن خدا رسولانش را بر هر که خواهد مسلّط می‌گرداند و خدا بر هر چیز تواناست."
          ],
          "fa.khorramdel": [
            "چیزهائی را که خدا از دارائی ایشان (یعنی بنی‌نضیر) به پیغمبر خود ارمغان داشته است شما اسبانی و شترانی را برای آن به تاخت درنیاورده‌اید (و با جنگ تصرّف ننموده‌اید) و بلکه خداوند پیغمبران خود را بر هر کس که بخواهد چیره می‌گرداند، و خدا بر هر کاری توانا است. [[«مَا»: چیزهائی که. مبتدا است و جمله (فَمَآ أَوْجَفْتُمْ عَلَیْهِ مِنْ خَیْلٍ وَ لا رِکَابٍ) خبر آن است. «أَفَآءَ»: عطاء کرد. عائد کرد. ارمغان داشت (نگا: احزاب / 50). (فَیْء) از این ماده است و به معنی غنیمتی است که بدون جنگ بدست آید. برخلاف (غَنیمت) که با جنگ بدست می‌آید. «مَآ أَوْجَفْتُمْ»: نتاخته‌اید. ندوانده‌اید. به شتاب و جولان درنیاورده‌اید. «خَیْلٍ»: اسبان. «رِکَابٍ»: شتران. خیل و رکاب، اسم جمع بوده و از لفظ خود دارای مفرد نمی‌باشند.]]"
          ],
          "fa.khorramshahi": [
            "و هر چه خداوند از ایشان به [صورت فی‌ء] عاید پیامبرش گرداند، شما در آن نه اسبان را به تاخت در آوردید و نه شتران را، بلکه خداوند پیامبرانش را بر هر کس که خواهد سلطه دهد، و خداوند بر هر کاری تواناست‌"
          ],
          "fa.makarem": [
            "و آنچه را خدا از آنان [= یهود] به رسولش بازگردانده (و بخشیده) چیزی است که شما برای به دست آوردن آن (زحمتی نکشیدید،) نه اسبی تاختید و نه شتری؛ ولی خداوند رسولان خود را بر هر کس بخواهد مسلّط می‌سازد؛ و خدا بر هر چیز توانا است!"
          ],
          "fa.moezzi": [
            "و آنچه بهره داد خدا پیمبر خویش را از ایشان پس نتاختید بر آن اسبان و نه اشترانی و لیکن خدا چیره گرداند فرستادگانش را بر هر که خواهد و خدا است بر همه چیز توانا"
          ],
          "fa.mojtabavi": [
            "و آنچه خداى از [مال و زمين‌] آنها- جهودان- به پيامبر خود باز گردانيد- يعنى به غنيمت به وى ارزانى داشت- شما هيچ اسبى و شترى بر آن نتاخته بوديد- از اين رو حقى در آن نداريد-، و ليكن خداست كه پيامبران خود را بر هر كه خواهد چيره مى‌گرداند، و خدا بر هر چيزى تواناست."
          ],
          "fa.sadeqi": [
            "و آنچه را خدا از آنان (به رسم غنیمت) بر پیامبر خود برگردانید، شما (برای تصاحب آن) اسب یا سواری (دگری) بر آن نتاختید. ولی خدا فرستادگانش را بر هر که بخواهد چیره می‌گرداند. و خدا بر هر چیزی بس تواناست."
          ]
        }
      },
      {
        "index": 5133,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:59:7",
        "text": [
          "مَا أَفَاءَ اللَّهُ‌ عَلَى‌ رَسُولِهِ‌ مِنْ‌ أَهْلِ‌ الْقُرَى‌ فَلِلَّهِ‌ وَ لِلرَّسُولِ‌ وَ لِذِي‌ الْقُرْبَى‌ وَ الْيَتَامَى‌ وَ الْمَسَاکِينِ‌ وَ ابْنِ‌ السَّبِيلِ‌ کَيْ‌ لاَ يَکُونَ‌ دُولَةً بَيْنَ‌ الْأَغْنِيَاءِ مِنْکُمْ‌ وَ مَا آتَاکُمُ‌ الرَّسُولُ‌ فَخُذُوهُ‌ وَ مَا نَهَاکُمْ‌ عَنْهُ‌ فَانْتَهُوا وَ اتَّقُوا اللَّهَ‌ إِنَ‌ اللَّهَ‌ شَدِيدُ الْعِقَابِ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Whatever booty God gives to His Apostle from the people of the cities, is for God and His Apostle, the near relations, the orphans, the needy and wayfarers, so that it does not concentrate in the hands of those who are rich among you. Accept what the Apostle gives you, and refrain from what he forbids, and take heed for yourself and fear God. Surely God is severe of retribution."
          ],
          "en.ahmedraza": [
            "The booty which Allah gave to His Noble Messenger from the people of the townships, is for Allah and His Noble Messenger, and for the relatives, and the orphans, and the needy and the travellers – so that it does not become the wealth of the rich among you; and accept whatever the Noble Messenger gives you; and refrain from whatever he forbids you; and fear Allah; indeed Allah’s punishment is severe."
          ],
          "en.arberry": [
            "Whatsoever spoils of war God has given to His Messenger from the people of the cities belongs to God, and His Messenger, and the near kinsman, orphans, the needy and the traveller, so that it be not a thing taken in turns among the rich of you. Whatever the Messenger gives you, take; whatever he forbids you, give over. And fear God; surely God is terrible in retribution."
          ],
          "en.daryabadi": [
            "Whatsoever Allah may restore Unto His apostle from the people of the cities is due Unto Allah and Unto the apostle and Unto the near of kin and the orphans and the needy and the wayfarer, so that it may not be confined to the rich among you. And whatsoever the apostle giveth you, take; and whatsoever he forbiddeth you, refrain from. And fear Allah; verily Allah is Stern in chastisement."
          ],
          "en.hilali": [
            "What Allah gave as booty (Fai') to His Messenger (Muhammad SAW) from the people of the townships, - it is for Allah, His Messenger (Muhammad SAW), the kindred (of Messenger Muhammad SAW), the orphans, Al-Masakin (the poor), and the wayfarer, in order that it may not become a fortune used by the rich among you. And whatsoever the Messenger (Muhammad SAW) gives you, take it, and whatsoever he forbids you, abstain (from it), and fear Allah. Verily, Allah is Severe in punishment."
          ],
          "en.itani": [
            "Whatever God restored to His Messenger from the inhabitants of the villages belongs to God, and to the Messenger, and to the relatives, and to the orphans, and to the poor, and to the wayfarer; so that it may not circulate solely between the wealthy among you. Whatever the Messenger gives you, accept it; and whatever he forbids you, abstain from it. And fear God. God is severe in punishment."
          ],
          "en.maududi": [
            "Whatever (from the possessions of the towns people) Allah has bestowed on His Messenger belongs to Allah, and to the Messenger, and to his kinsfolk, and to the orphans, and to the needy, and to the wayfarer so that it may not merely circulate between the rich among you. So accept whatever the Messenger gives you, and refrain from whatever he forbids you. And fear Allah: verily Allah is Most Stern in retribution."
          ],
          "en.mubarakpuri": [
            "What Allah gave as booty (Fai') to His Messenger from the people of the townships -- it is for Allah, His Messenger, the kindred, the orphans, the poor, and the wayfarer, in order that it may not become a fortune used by the rich among you. And whatsoever the Messenger gives you, take it; and whatsoever he forbids you, abstain (from it). And have Taqwa of Allah, verily, Allah is Severe in punishment."
          ],
          "en.pickthall": [
            "That which Allah giveth as spoil unto His messenger from the people of the townships, it is for Allah and His messenger and for the near of kin and the orphans and the needy and the wayfarer, that it become not a commodity between the rich among you. And whatsoever the messenger giveth you, take it. And whatsoever he forbiddeth, abstain (from it). And keep your duty to Allah. Lo! Allah is stern in reprisal."
          ],
          "en.qarai": [
            "The spoils that Allah gave to His Apostle from the people of the townships, are for Allah and the Apostle, the relatives and the orphans, the needy and the traveller, so that they do not circulate among the rich among you. Take whatever the Apostle gives you, and refrain from whatever he forbids you, and be wary of Allah. Indeed Allah is severe in retribution."
          ],
          "en.qaribullah": [
            "The spoils of war taken from the villagers and given by Allah to His Messenger belong to Allah, His Messenger and the near kinsmen, the orphans, the needy and the destitute traveler, so that it is not something taken in turns by the rich among you. Whatever the Messenger gives you, accept it; and whatever he forbids you, abstain. And fear Allah; surely, Allah is Stern in retribution."
          ],
          "en.sahih": [
            "And what Allah restored to His Messenger from the people of the towns - it is for Allah and for the Messenger and for [his] near relatives and orphans and the [stranded] traveler - so that it will not be a perpetual distribution among the rich from among you. And whatever the Messenger has given you - take; and what he has forbidden you - refrain from. And fear Allah; indeed, Allah is severe in penalty."
          ],
          "en.sarwar": [
            "Whatever God grants to His Messenger (out of the property) of the people of the towns, belongs to God, the Messenger, the kinsfolk, the orphans, the destitute and to those who may become needy while on a journey, so that it will not circulate only in the hands of rich ones among them. Take only what the Messenger gives to you and desist from what he forbids you. Have fear of God; God is severe in His retribution."
          ],
          "en.shakir": [
            "Whatever Allah has restored to His Apostle from the people of the towns, it is for Allah and for the Apostle, and for the near of kin and the orphans and the needy and the wayfarer, so that it may not be a thing taken by turns among the rich of you, and whatever the Apostle gives you, accept it, and from whatever he forbids you, keep back, and be careful of (your duty to) Allah; surely Allah is severe in retributing (evil):"
          ],
          "en.transliteration": [
            "M<u>a</u> af<u>a</u>a All<u>a</u>hu AAal<u>a</u> rasoolihi min ahli alqur<u>a</u> falill<u>a</u>hi wali<b>l</b>rrasooli wali<u>th</u>ee alqurb<u>a</u> wa<b>a</b>lyat<u>a</u>m<u>a</u> wa<b>a</b>lmas<u>a</u>keeni wa<b>i</b>bni a<b>l</b>ssabeeli kay l<u>a</u> yakoona doolatan bayna alaghniy<u>a</u>i minkum wam<u>a</u> <u>a</u>t<u>a</u>kumu a<b>l</b>rrasoolu fakhu<u>th</u>oohu wam<u>a</u> nah<u>a</u>kum AAanhu fa<b>i</b>ntahoo wa<b>i</b>ttaqoo All<u>a</u>ha inna All<u>a</u>ha shadeedu alAAiq<u>a</u>b<b>i</b>"
          ],
          "en.wahiduddin": [
            "whatever gains God has assigned to His Messenger from the inhabitants of the town is for God and for the Messenger and for his kinsfolk and for orphans and the needy and the wayfarer, so that they may not become the property of those of you who are rich. Whatever the Messenger gives you, take it; and whatever he forbids you, abstain from it. Fear God; surely, God is severe in retribution."
          ],
          "en.yusufali": [
            "What Allah has bestowed on His Messenger (and taken away) from the people of the townships,- belongs to Allah,- to His Messenger and to kindred and orphans, the needy and the wayfarer; In order that it may not (merely) make a circuit between the wealthy among you. So take what the Messenger assigns to you, and deny yourselves that which he withholds from you. And fear Allah; for Allah is strict in Punishment."
          ],
          "fa.ansarian": [
            "آنچه خدا از [اموال و زمین های] اهل آن آبادی ها به پیامبرش بازگرداند اختصاص به خدا و پیامبر و اهل بیت پیامبر و یتیمان و مستمندان و در راه ماندگان دارد، تا میان ثرومندان شما دست به دست نگردد. و [از اموال و احکام و معارف دینی] آنچه را پیامبر به شما عطا کرد بگیرید و از آنچه شما را نهی کرد، باز ایستید و از خدا پروا کنید؛ زیرا خدا سخت کیفر است."
          ],
          "fa.ayati": [
            "آن غنيمتى كه خدا از مردم قريه‌ها نصيب پيامبرش كرده است از آن خداست و پيامبر و خويشاوندان و يتيمان و مسكينان و مسافران در راه مانده، تا ميان توانگرانتان دست به دست نشود. هر چه پيامبر به شما داد بستانيد، و از هر چه شما را منع كرد اجتناب كنيد. و از خدا بترسيد كه خدا سخت عقوبت است."
          ],
          "fa.bahrampour": [
            "آنچه خدا [به صورت فيى‌ء] از اموال ساكنان آن قريه‌ها عايد پيامبرش گردانيد، خاص خدا و پيامبر و خويشاوندان [او] و يتيمان و مستمندان و در راه مانده است، تا ميان توانگران شما دست به دست نگردد. و آنچه را فرستاده [ى او] به شما داد بگيريد و از آنچه شما را باز"
          ],
          "fa.fooladvand": [
            "آنچه خدا از [دارايى‌] ساكنان آن قريه‌ها عايد پيامبرش گردانيد، از آن خدا و از آن پيامبر [او] و متعلق به خويشاوندان نزديك [وى‌] و يتيمان و بينوايان و درراه‌ماندگان است، تا ميان توانگران شما دست به دست نگردد. و آنچه را فرستاده [او] به شما داد، آن را بگيريد و از آنچه شما را باز داشت، بازايستيد و از خدا پروا بداريد كه خدا سخت‌كيفر است."
          ],
          "fa.ghomshei": [
            "آنچه را که خدا از اموال کافران دیار به رسول خود غنیمت داد آن متعلق به خدا و رسول و (ائمه) خویشاوندان رسول و یتیمان و فقیران و در راه ماندگان (ایشان) است. این حکم برای آن است که غنایم، دولت توانگران را نیفزاید (بلکه به مبلغان دین و فقیران اسلام تخصیص یابد) و شما آنچه رسول حق دستور دهد (و منع یا عطا کند) بگیرید و هر چه نهی کند واگذارید و از خدا بترسید که عقاب خدا بسیار سخت است."
          ],
          "fa.khorramdel": [
            "چیزهائی را که خداوند از اهالی این آبادیها به پیغمبرش ارمغان داشته است، متعلّق به خدا و پیغمبر و خویشاوندان (پیغمبر) و یتیمان و مستمندان و مسافران در راه مانده می‌باشد. این بدان خاطر است که اموال تنها در میان اشخاص ثروتمند شما دست بدست نگردد (و نیازمندان از آن محروم نشوند). چیزهائی را که پیغمبر برای شما (از احکام الهی) آورده است اجراء کنید، و از چیزهائی که شما را از آن بازداشته است، دست بکشید. از خدا بترسید که خدا عقوبت سختی دارد. [[«أَهْلِ الْقُری»: اهالی آبادیها. «فَلِلّهِ وَ لِلرَّسُولِ ...»: (نگا: انفال / 41). «دُولَةً»: چیزی را که مردمان میان خود دست بدست می‌گردانند. با واژه (تداول) همریشه و تقریباً هم‌معنی است.]]"
          ],
          "fa.khorramshahi": [
            "آنچه خداوند [به صورت فی‌ء] از اموال اهل آبادیها عاید پیامبرش گرداند، خاص خداوند و پیامبر و خویشاوندان و یتیمان و بینوایان و در راه ماندگان است، تا در میان توانگران شما دستگردان نشود، و آنچه پیامبر شما را دهد آن را بپذیرید و آنچه شما را از آن بازدارد، از آن دست بدارید، و از خداوند پروا کنید، که بی‌گمان خداوند سخت کیفر است‌"
          ],
          "fa.makarem": [
            "آنچه را خداوند از اهل این آبادیها به رسولش بازگرداند، از آن خدا و رسول و خویشاوندان او، و یتیمان و مستمندان و در راه ماندگان است، تا (این اموال عظیم) در میان ثروتمندان شما دست به دست نگردد! آنچه را رسول خدا برای شما آورده بگیرید (و اجرا کنید)، و از آنچه نهی کرده خودداری نمایید؛ و از (مخالفت) خدا بپرهیزید که خداوند کیفرش شدید است!"
          ],
          "fa.moezzi": [
            "و آنچه ارزانی داشت خدا بر پیمبرش از اهل شهرها پس از آن خدا است و از آن پیمبر و از آن نزدیکان (خویشاوندان) و یتیمان و بینوایان و درماندگان راه تا نباشد دستخوش گردشی میان توانگران شما و آنچه داد به شما پیمبر پس بگیریدش و آنچه بازداشت شما را از آن پس باز ایستید و بترسید خدا را که خدا است سخت‌عقوبت‌"
          ],
          "fa.mojtabavi": [
            "آنچه خدا از [مال و زمين‌] مردم آباديها به پيامبرش باز گردانيد از آن خدا و پيامبر و خويشاوندان و يتيمان و مستمندان و در راه‌ماندگان- همه از ذريه پيامبر- است تا ميان توانگرانتان دست‌گردان نباشد. و آنچه را پيامبر به شما داد بگيريد و از آنچه شما را بازداشت باز ايستيد و از خدا پروا كنيد، كه خدا سخت كيفر است."
          ],
          "fa.sadeqi": [
            "آنچه خدا از (دارایی) ساکنان آن قریه‌ها بر پیامبرش برگردانید، از آنِ خدا و از آنِ پیامبرش و از آنِ خویشاوندان نزدیکتر(ش) و (برای) یتیمان و بینوایان و در راه مانده(ها) است، تا میان توانگرانتان دست به دست نگردد. و آنچه را فرستاده‌(ی او) برایتان آورد (هم) آن را بگیرید، و از آنچه شما را از آن بازداشت، باز ایستید. و از خدا پروا بدارید که خدا سخت‌کیفر است."
          ]
        }
      },
      {
        "index": 5134,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:59:8",
        "text": [
          "لِلْفُقَرَاءِ الْمُهَاجِرِينَ‌ الَّذِينَ‌ أُخْرِجُوا مِنْ‌ دِيَارِهِمْ‌ وَ أَمْوَالِهِمْ‌ يَبْتَغُونَ‌ فَضْلاً مِنَ‌ اللَّهِ‌ وَ رِضْوَاناً وَ يَنْصُرُونَ‌ اللَّهَ‌ وَ رَسُولَهُ‌ أُولٰئِکَ‌ هُمُ‌ الصَّادِقُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "The spoils are also for the poor emigrants who were deprived of their homes and possessions and are seeking the bounty and protection of God, and are helping God and His Apostle. They are the ones who are true of word and deed."
          ],
          "en.ahmedraza": [
            "And (the booty is) also for the poor migrants who were expelled from their homes and their wealth, seeking Allah’s munificence and His pleasure, and aiding Allah and His Noble Messenger; it is they who are the truthful."
          ],
          "en.arberry": [
            "It is for the poor emigrants, who were expelled from their habitations and their possessions, seeking bounty from God and good pleasure, and helping God and His Messenger; those -- they are the truthful ones."
          ],
          "en.daryabadi": [
            "And it is due Unto the poor Muhajirs who have been driven forth from their homes and their substance, seeking grace from Allah and His goodwill and succouring Allah and His apostle. These! they are the truthful."
          ],
          "en.hilali": [
            "(And there is also a share in this booty) for the poor emigrants, who were expelled from their homes and their property, seeking Bounties from Allah and to please Him. And helping Allah (i.e. helping His religion) and His Messenger (Muhammad SAW). Such are indeed the truthful (to what they say);"
          ],
          "en.itani": [
            "To the poor refugees who were driven out of their homes and their possessions, as they sought the favor of God and His approval, and came to the aid of God and His Messenger. These are the sincere."
          ],
          "en.maududi": [
            "It also belongs to the poor Emigrants who have been driven out of their homes and their possessions, those who seek Allah's favour and good pleasure and help Allah and His Messenger. Such are the truthful ones."
          ],
          "en.mubarakpuri": [
            "(And there is also a share in this booty) for the poor emigrants, who were expelled from their homes and their property, seeking bounties from Allah and (His) good pleasure, and helping Allah and His Messenger. Such are indeed the truthful."
          ],
          "en.pickthall": [
            "And (it is) for the poor fugitives who have been driven out from their homes and their belongings, who seek bounty from Allah and help Allah and His messenger. They are the loyal."
          ],
          "en.qarai": [
            "[They are also] for the poor Emigrants who have been expelled from their homes and [wrested of] their possessions, who seek grace from Allah and [His] pleasure and help Allah and His Apostle. It is they who are the truthful."
          ],
          "en.qaribullah": [
            "(A share of the spoils shall also be given) to the poor emigrants who were expelled from their homes and their possessions, who seek the Favor and Pleasure of Allah, and help Allah and His Messenger. These are they that are truthful."
          ],
          "en.sahih": [
            "For the poor emigrants who were expelled from their homes and their properties, seeking bounty from Allah and [His] approval and supporting Allah and His Messenger, [there is also a share]. Those are the truthful."
          ],
          "en.sarwar": [
            "The poor immigrants who were deprived of their homes and property, who seek favors and pleasures from God, and help Him and His Messenger will also have (a share in the said property). These people are the truthful ones."
          ],
          "en.shakir": [
            "(It is) for the poor who fled their homes and their possessions, seeking grace of Allah and (His) pleasure, and assisting Allah and His Apostle: these it is that are the truthful."
          ],
          "en.transliteration": [
            "Lilfuqar<u>a</u>i almuh<u>a</u>jireena alla<u>th</u>eena okhrijoo min diy<u>a</u>rihim waamw<u>a</u>lihim yabtaghoona fa<u>d</u>lan mina All<u>a</u>hi wari<u>d</u>w<u>a</u>nan wayan<u>s</u>uroona All<u>a</u>ha warasoolahu ol<u>a</u>ika humu a<b>l</b><u>ssa</u>diqoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "It is for the poor refugees who were driven from their homes and possessions, desiring the favour and the pleasure of God and supporting God and His Messenger. Such people are the truthful."
          ],
          "en.yusufali": [
            "(Some part is due) to the indigent Muhajirs, those who were expelled from their homes and their property, while seeking Grace from Allah and (His) Good Pleasure, and aiding Allah and His Messenger: such are indeed the sincere ones:-"
          ],
          "fa.ansarian": [
            "[بخشی از غنایم] برای فقیران مهاجری است که از دیار و اموالشان بیرون رانده شده اند، در حالی که فضل و خشنودی خدا را می جویند وخدا وپیامبرش را یاری می کنند، اینان همان راستگویانند."
          ],
          "fa.ayati": [
            "نيز غنايم از آن مهاجران فقيرى است كه از سرزمينشان رانده شده‌اند و آنها در طلب فضل و خشنودى خدايند و خدا و پيامبرش را يارى مى‌كنند، اينان راستگويانند."
          ],
          "fa.bahrampour": [
            "[و نيز اين غنايم‌] براى مهاجران نيازمندى است كه از ديارشان و اموالشان رانده شده‌اند و در طلب فضل خدا و رضاى اويند و خدا و رسولش را يارى مى‌كنند. هم اينان راستگويانند"
          ],
          "fa.fooladvand": [
            "[اين غنايم، نخست‌] اختصاص به بينوايان مهاجرى دارد كه از ديارشان و اموالشان رانده شدند: خواستار فضل خدا و خشنودى [او] مى‌باشند و خدا و پيامبرش را يارى مى‌كنند. اينان همان مردم درست كردارند."
          ],
          "fa.ghomshei": [
            "مقام بلند (یا غنائم) خاصّ فقیران مهاجرین است که آنها را از وطن و اموالشان به دیار غربت راندند در صورتی که (چشم از خانه پوشیده و) در طلب فضل و خشنودی خدا می‌کوشند و خدا و رسول او را یاری می‌کنند، اینان به حقیقت راستگویان عالمند."
          ],
          "fa.khorramdel": [
            "همچنین غنائم از آنِ فقرای مهاجرینی است که از خانه و کاشانه و اموال خود بیرون رانده شده‌اند. آن کسانی که فضل خدا و خوشنودی او را می‌خواهند، و خدا و پیغمبرش را یاری می‌دهند. اینان راستانند. [[«یَبْتَغُونَ فَضْلاً مِّنَ اللهِ وَ رِضْوَاناً»: (نگا: مائده / 2، فتح / 29). «الصَّادِقُونَ»: راستان. مؤمنانی که واقعاً ایمان دارند و راست و درست هستند.]]"
          ],
          "fa.khorramshahi": [
            "برای بینوایان از مهاجران است که از خانه و کاشانه‌هایشان و ملک و مالهایشان رانده شده‌اند، و در طلب بخشش و خشنودی خداوندند و [دین‌] خداوند و پیامبر او را یاری می‌دهند، اینانند که راستگویانند"
          ],
          "fa.makarem": [
            "این اموال برای فقیران مهاجرانی است که از خانه و کاشانه و اموال خود بیرون رانده شدند در حالی که فضل الهی و رضای او را می‌طلبند و خدا و رسولش را یاری می‌کنند؛ و آنها راستگویانند!"
          ],
          "fa.moezzi": [
            "برای بینوایان از مهاجرانی است که برون رانده شدند از خانه‌ها و خواسته‌های خویش در پی فضلی از خدا و خوشنودیی و یاری کنند خدا و پیمبرش را آنانند راستگویان‌"
          ],
          "fa.mojtabavi": [
            "[و نيز آن غنيمت‌] براى نيازمندان هجرت‌كننده است كه از خانه‌ها و مالهاى خود بيرون رانده شدند در حالى كه فضل- روزى- خداى و خشنودى او را مى‌جويند و [دين‌] خداى و پيامبر او را يارى مى‌كنند، ايشانند راستگويان"
          ],
          "fa.sadeqi": [
            "(این غنایم، نخست) اختصاص به بینوایان از مهاجران دارد که از دیارشان و اموالشان رانده شدند، در حالی‌که فضلی از خدا و خشنودی‌ای از او می‌جویند و خدا و پیامبرش را یاری می‌کنند. اینان (هم)اینان راستانند."
          ]
        }
      },
      {
        "index": 5135,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:59:9",
        "text": [
          "وَ الَّذِينَ‌ تَبَوَّءُوا الدَّارَ وَ الْإِيمَانَ‌ مِنْ‌ قَبْلِهِمْ‌ يُحِبُّونَ‌ مَنْ‌ هَاجَرَ إِلَيْهِمْ‌ وَ لاَ يَجِدُونَ‌ فِي‌ صُدُورِهِمْ‌ حَاجَةً مِمَّا أُوتُوا وَ يُؤْثِرُونَ‌ عَلَى‌ أَنْفُسِهِمْ‌ وَ لَوْ کَانَ‌ بِهِمْ‌ خَصَاصَةٌ وَ مَنْ‌ يُوقَ‌ شُحَ‌ نَفْسِهِ‌ فَأُولٰئِکَ‌ هُمُ‌ الْمُفْلِحُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Those who came to the city and to faith before them, love those who take refuge with them, and do not feel for themselves any need for what is given them, and give them preference over themselves even if they are indigent. Whoever preserves himself from his own greed will be prosperous."
          ],
          "en.ahmedraza": [
            "And those who accepted this city as their home and accepted faith before them, befriend those who migrated towards them, and in their breasts do not find any need for what they have been given, and prefer the migrants above themselves even if they themselves are in dire need; and whoever is saved from the greed of his soul – it is they who are the successful."
          ],
          "en.arberry": [
            "And those who made their dwelling in the abode, and in belief, before them; love whosoever has emigrated to them, not finding in their breasts any need for what they have been given, and preferring others above themselves, even though poverty be their portion. And whoso is guarded against the avarice of his own soul, those -- they are the prosperers."
          ],
          "en.daryabadi": [
            "And it is also due Unto those who are settled in the dwelling and the faith before them, loving those who have migrated Unto them, and finding in their breasts no desire for that which hath been given them, and preferring them above themselves even though there was want amongst them. And whosoever is Preserved from covetousness of his soul, then those! - they are the blissful."
          ],
          "en.hilali": [
            "And those who, before them, had homes (in Al-Madinah) and had adopted the Faith, love those who emigrate to them, and have no jealousy in their breasts for that which they have been given (from the booty of Bani An-Nadir), and give them (emigrants) preference over themselves, even though they were in need of that. And whosoever is saved from his own covetousness, such are they who will be the successful."
          ],
          "en.itani": [
            "And those who, before them, had settled in the homeland, and had accepted faith. They love those who emigrated to them, and find no hesitation in their hearts in helping them. They give them priority over themselves, even if they themselves are needy. Whoever is protected from his natural greed—it is they who are the successful."
          ],
          "en.maududi": [
            "It also belongs to those who were already settled in this abode (of Hijrah) having come to faith before the (arrival of the) Muhajirun (Emigrants). They love those who have migrated to them and do not covet what has been given them; they even prefer them above themselves though poverty be their own lot. And whosoever are preserved from their own greed, such are the ones that will prosper."
          ],
          "en.mubarakpuri": [
            "And (it is also for) those who, before them, had homes and had adopted the faith, love those who emigrate to them, and have no jealousy in their breasts for that which they have been given, and give them preference over themselves even though they were in need of that. And whosoever is saved from his own greed, such are they who will be the successful."
          ],
          "en.pickthall": [
            "Those who entered the city and the faith before them love those who flee unto them for refuge, and find in their breasts no need for that which hath been given them, but prefer (the fugitives) above themselves though poverty become their lot. And whoso is saved from his own avarice - such are they who are successful."
          ],
          "en.qarai": [
            "[They are as well] for those who were settled in the land and [abided] in faith before them, who love those who migrate toward them, and do not find in their breasts any privation for that which is given to them, but prefer [the Immigrants] to themselves, though poverty be their own lot. And those who are saved from their own greed—it is they who are the felicitous."
          ],
          "en.qaribullah": [
            "And those before them who had made their dwelling in the abode (the City of Madinah), and because of their belief love those who have emigrated to them; they do not find any (envy) in their chests for what they have been given and prefer them above themselves, even though they themselves have a need. Whosoever is saved from the greed of his own soul, they are the ones who win."
          ],
          "en.sahih": [
            "And [also for] those who were settled in al-Madinah and [adopted] the faith before them. They love those who emigrated to them and find not any want in their breasts of what the emigrants were given but give [them] preference over themselves, even though they are in privation. And whoever is protected from the stinginess of his soul - it is those who will be the successful."
          ],
          "en.sarwar": [
            "Those who established a community center and embraced the faith before the arrival of the immigrants love those who have come to their town. They are not jealous of what is given to the immigrants. They give preference to them over themselves - even concerning the things that they themselves urgently need. Whoever controls his greed will have everlasting happiness."
          ],
          "en.shakir": [
            "And those who made their abode in the city and in the faith before them love those who have fled to them, and do not find in their hearts a need of what they are given, and prefer (them) before themselves though poverty may afflict them, and whoever is preserved from the niggardliness of his soul, these it is that are the successful ones."
          ],
          "en.transliteration": [
            "Wa<b>a</b>lla<u>th</u>eena tabawwaoo a<b>l</b>dd<u>a</u>ra wa<b>a</b>leem<u>a</u>na min qablihim yu<u>h</u>ibboona man h<u>a</u>jara ilayhim wal<u>a</u> yajidoona fee <u>s</u>udoorihim <u>ha</u>jatan mimm<u>a</u> ootoo wayuthiroona AAal<u>a</u> anfusihim walaw k<u>a</u>na bihim kha<u>sas</u>atun waman yooqa shu<u>hh</u>a nafsihi faol<u>a</u>ika humu almufli<u>h</u>oon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Those who were already settled in the city [Madinah] and firmly rooted in faith, love those who migrated to them for refuge, and harbour no desire in their hearts for what has been given to the [latter]. They give them preference over themselves, even if they too are needy: those who are saved from their own souls' greed are truly successful."
          ],
          "en.yusufali": [
            "But those who before them, had homes (in Medina) and had adopted the Faith,- show their affection to such as came to them for refuge, and entertain no desire in their hearts for things given to the (latter), but give them preference over themselves, even though poverty was their (own lot). And those saved from the covetousness of their own souls,- they are the ones that achieve prosperity."
          ],
          "fa.ansarian": [
            "و [برای] کسانی [از انصار است] که پیش از مهاجران در سرای هجرت و ایمان [یعنی مدینه] جای گرفتند، [و] کسانی را که به سوی آنان هجرت کرده اند دوست دارند، و در سینه های خود نیاز و چشم داشتی به آنچه به مهاجران داده شده است نمی یابند، و آنان را بر خود ترجیح می دهند، گرچه خودشان را نیاز شدیدی [به مال و متاع] باشد. و کسانی را که از بخل و حرصشان بازداشته اند، اینان همان رستگارانند."
          ],
          "fa.ayati": [
            "و كسانى كه پيش از آمدن مهاجران در ديار خود بوده‌اند و ايمان آورده‌اند، آنهايى را كه به سويشان مهاجرت كرده‌اند دوست مى‌دارند. و از آنچه مهاجران را داده مى‌شود در دل احساس حسد نمى‌كنند، و ديگران را بر خويش ترجيح مى‌دهند هر چند خود نيازمند باشند. و آنان كه از بخل خويش در امان مانده باشند رستگارانند."
          ],
          "fa.bahrampour": [
            "و كسانى [از انصار] كه پيش از آنها خانه و ايمان [خويش‌] را آماده كردند، كسانى را كه به سويشان هجرت كردند دوست دارند، و نسبت به آنچه به آنها داده شده در دل خود احساس نياز نمى‌كنند و [آنها را] بر خود مقدم مى‌دارند، هر چند خود بدان نياز مبرمى داشته باشند"
          ],
          "fa.fooladvand": [
            "و [نيز] كسانى كه قبل از [مهاجران‌] در [مدينه‌] جاى گرفته و ايمان آورده‌اند؛ هر كس را كه به سوى آنان كوچ كرده دوست دارند؛ و نسبت به آنچه به ايشان داده شده است در دلهايشان حسدى نمى‌يابند؛ و هر چند در خودشان احتياجى [مبرم ]باشد، آنها را بر خودشان مقدّم مى‌دارند. و هر كس از خسّت نفس خود مصون ماند، ايشانند كه رستگارانند."
          ],
          "fa.ghomshei": [
            "و هم آن جماعت انصار که پیش از (هجرت) مهاجرین (در مکّه به رسول ایمان آوردند و) مدینه را خانه ایمان گردانیدند و مهاجرین را که به سوی آنها آمدند دوست می‌دارند و در دل خود هیچ حاجتی (و حسد و بخلی) نسبت به آنچه (از غنائم بنی نضیر) که به آنها داده شد نمی‌یابند و هر چند به چیزی نیازمند باشند باز مهاجران را بر خویش مقدم می‌دارند (و جانشان به کلی از بخل و حسد و حرص دنیا پاک است) و هر کس را از خوی بخل و حرص دنیا نگاه دارند آنان به حقیقت رستگاران عالمند."
          ],
          "fa.khorramdel": [
            "آنانی که پیش از آمدن مهاجران خانه و کاشانه (ی آئین اسلام) را آماده کردند و ایمان را (در دل خود استوار داشتند) کسانی را دوست می‌دارند که به پیش ایشان مهاجرت کرده‌اند، و در درون احساس و رغبت نیازی نمی‌کنند به چیزهائی که به مهاجران داده شده است، و ایشان را بر خود ترجیح می‌دهند، هرچند که خود سخت نیازمند باشند. کسانی که از بخل نفس خود، نگاهداری و مصون و محفوظ گردند، ایشان قطعاً رستگارند. [[«الَّذِینَ»: مراد انصار است. مبتدا، و خبر آن (یُحِبُّونَ مَنْ هَاجَرَ إِلَیْهِمْ) است. «تَبَوَّءُوا»: منزل و مأوی را آماده کرده‌اند. یعنی مدینه را برای آئین اسلام آماده کرده‌اند. یا این که منازل و خانه‌هائی تدارک دیده‌اند. «حَاجَةً»: نیاز. در اینجا به معنی میل و رغبت است. «خَصَاصَةٌ»: احتیاج شدید. نیاز زیاد. «شُحَّ»: بخل (نگا: نساء / 128). برخی گویند: شُحّ یکی از ویژگیهای نفس انسان است و او را به دلبستگی زیاد به مال، و حرص و آز بر آن وامی‌دارد. بخل دست بازداشتن از بخشش و خرج مال است و اثری از آثار شُحّ است (نگا: المصحف المیسر).]]"
          ],
          "fa.khorramshahi": [
            "و کسانی که پیش از آنان در سرای اسلام [مدینه‌] جای گرفتند و ایمان را پذیرفتند، کسانی را که به سوی آنان هجرت کرده‌اند، دوست می‌دارند و نسبت به آنچه به ایشان داده شده است، در دل خود احساس نیاز نمی‌کنند، و [آنان را] ولو خود نیازمندی داشته باشند، بر خود بر می‌گزینند، و کسانی که از آزمندی نفس خویش در امان مانند، آنانند که رستگارانند"
          ],
          "fa.makarem": [
            "و برای کسانی است که در این سرا [= سرزمین مدینه‌] و در سرای ایمان پیش از مهاجران مسکن گزیدند و کسانی را که به سویشان هجرت کنند دوست می‌دارند، و در دل خود نیازی به آنچه به مهاجران داده شده احساس نمی‌کنند و آنها را بر خود مقدّم می‌دارند هر چند خودشان بسیار نیازمند باشند؛ کسانی که از بخل و حرص نفس خویش باز داشته شده‌اند رستگارانند!"
          ],
          "fa.moezzi": [
            "و آنان که جایگزین شدند خانه و ایمان را پیش از ایشان دوست دارند آنان را که هجرت کنند بسوی ایشان و نیابند در سینه‌های خویش نیازمندی بدانچه داده شدند و برگزینند بر خویش و هر چند باشد بدیشان تنگدستی و آنکه نگهداشته شود از بخل خویش پس آنانند رستگاران‌"
          ],
          "fa.mojtabavi": [
            "و نيز كسانى راست كه در سراى هجرت و ايمان- يعنى مدينه- پيش از ايشان جاى گرفته‌اند- يعنى انصار كه در ديار خود ايمان آوردند-، هر كه را كه به سوى آنان هجرت كرده است دوست مى‌دارند و در سينه‌هاى خويش از آنچه به آنان"
          ],
          "fa.sadeqi": [
            "و (نیز) کسانی که پیش از مهاجران در مدینه جای امان و ایمان گرفته‌اند (و) هر کس را سوی آنان کوچ کرده دوست دارند، و نسبت به آنچه به ایشان داده شده است در سینه‌هایشان نیازی نمی‌یابند، و هر چند برای خودشان احتیاجی مبرم باشد، آنها را بر خودشان مقدّم می‌دارند. و هر کس از خسّت نفس خود مصون مانَد، ایشان (هم) ایشان (راست‌‌کاران و) رستگارکنندگانند."
          ]
        }
      },
      {
        "index": 5136,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:59:10",
        "text": [
          "وَ الَّذِينَ‌ جَاءُوا مِنْ‌ بَعْدِهِمْ‌ يَقُولُونَ‌ رَبَّنَا اغْفِرْ لَنَا وَ لِإِخْوَانِنَا الَّذِينَ‌ سَبَقُونَا بِالْإِيمَانِ‌ وَ لاَ تَجْعَلْ‌ فِي‌ قُلُوبِنَا غِلاًّ لِلَّذِينَ‌ آمَنُوا رَبَّنَا إِنَّکَ‌ رَءُوفٌ‌ رَحِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "(And the spoils are for) those who came after them, who say: \"O Lord, forgive us and our brothers who came to faith before us, and do not put a grudge in our hearts against those who believe O Lord, You are compassionate and kind.\""
          ],
          "en.ahmedraza": [
            "And those who came after them say, “O our Lord! Forgive us, and our brothers who accepted faith before us, and do not keep any malice in our hearts towards the believers – O our Lord! Indeed You only are the Most Compassionate, Most Merciful.”."
          ],
          "en.arberry": [
            "And as for those who came after them, they say, 'Our Lord, forgive us and our brothers, who preceded us in belief, and put Thou not into our hearts any rancour towards those who believe. Our Lord, surely Thou art the All-gentle, the All-compassionate.'"
          ],
          "en.daryabadi": [
            "And it is also due Unto those who came after them, saying: 'Our Lord! forgive us and our brethren who have preceded us in the faith, and place not in our hearts any rancour toward those who had believed. Our Lord! verily Thou art Tender, Merciful.'"
          ],
          "en.hilali": [
            "And those who came after them say: \"Our Lord! Forgive us and our brethren who have preceded us in Faith, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful."
          ],
          "en.itani": [
            "And those who came after them, saying, “Our Lord, forgive us, and our brethren who preceded us in faith, and leave no malice in our hearts towards those who believe. Our Lord, You are Clement and Merciful.”"
          ],
          "en.maududi": [
            "(And it also belongs to) those who came after them, and who pray: “Lord, forgive us and our brethren who have preceded us in faith, and do not put in our hearts any rancour towards those who believe. Lord, You are the Most Tender, the Most Compassionate.”"
          ],
          "en.mubarakpuri": [
            "And those who came after them say: \"Our Lord! Forgive us and our brethren who have preceded us in faith, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful."
          ],
          "en.pickthall": [
            "And those who came (into the faith) after them say: Our Lord! Forgive us and our brethren who were before us in the faith, and place not in our hearts any rancour toward those who believe. Our Lord! Thou art Full of Pity, Merciful."
          ],
          "en.qarai": [
            "And [also for] those who came in after them, who say, ‘Our Lord, forgive us and our brethren who were our forerunners in the faith, and do not put any rancour in our hearts toward the faithful. Our Lord, You are indeed most kind and merciful.’"
          ],
          "en.qaribullah": [
            "Those who came after them say: 'Forgive us our Lord, and forgive our brothers who were believers before us. Do not put in our hearts any spite towards those who believe. Lord, You are the Gentle, the Most Merciful'"
          ],
          "en.sahih": [
            "And [there is a share for] those who came after them, saying, \"Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.\""
          ],
          "en.sarwar": [
            "Those who migrated later (to Medina) say, \"Lord, forgive us and our brothers who preceded us in the faith, and clear our hearts of any ill will against the believers. Lord, You are Compassionate and All-merciful\"."
          ],
          "en.shakir": [
            "And those who come after them say: Our Lord! forgive us and those of our brethren who had precedence of us in faith, and do not allow any spite to remain in our hearts towards those who believe, our Lord! surely Thou art Kind, Merciful."
          ],
          "en.transliteration": [
            "Wa<b>a</b>lla<u>th</u>eena j<u>a</u>oo min baAAdihim yaqooloona rabban<u>a</u> ighfir lan<u>a</u> waliikhw<u>a</u>nin<u>a</u> alla<u>th</u>eena sabaqoon<u>a</u> bi<b>a</b>leem<u>a</u>ni wal<u>a</u> tajAAal fee quloobin<u>a</u> ghillan lilla<u>th</u>eena <u>a</u>manoo rabban<u>a</u> innaka raoofun ra<u>h</u>eem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Those who came [into the faith] after them say, \"Our Lord, forgive us and our brothers who preceded us in the faith and leave no malice in our hearts towards those who believe. Lord, You are indeed compassionate and merciful.\""
          ],
          "en.yusufali": [
            "And those who came after them say: \"Our Lord! Forgive us, and our brethren who came before us into the Faith, and leave not, in our hearts, rancour (or sense of injury) against those who have believed. Our Lord! Thou art indeed Full of Kindness, Most Merciful.\""
          ],
          "fa.ansarian": [
            "و نیز کسانی که بعد از آنان [انصار و مهاجرین] آمدند در حالی که می گویند: پروردگارا! ما و برادرانمان را که به ایمان بر ما پیشی گرفتند بیامرز، و در دل هایمان نسبت به مؤمنان، خیانت و کینه قرار مده. پروردگارا! یقیناً تو رؤوف و مهربانی."
          ],
          "fa.ayati": [
            "كسانى كه از پس ايشان آمده‌اند، مى‌گويند: اى پروردگار ما، ما و برادران ما را كه پيش از ما ايمان آورده‌اند بيامرز و كينه كسانى را كه ايمان آورده‌اند، در دل ما جاى مده. اى پروردگار ما، تو مشفق و مهربان هستى."
          ],
          "fa.bahrampour": [
            "و كسانى كه پس از آنان [و بعد از فتح مكه‌] آمدند، مى‌گويند: پروردگارا! ما و آن برادران ما را كه در ايمان بر ما پيشى گرفتند بيامرز، و در دل‌هايمان نسبت به كسانى كه ايمان آورده‌اند [هيچ گونه‌] كينه‌اى مگذار. پروردگارا! به راستى تو رئوف و مهربانى"
          ],
          "fa.fooladvand": [
            "و [نيز] كسانى كه بعد از آنان [=مهاجران و انصار] آمده‌اند [و] مى‌گويند: «پروردگارا، بر ما و بر آن برادرانمان كه در ايمان آوردن بر ما پيشى گرفتند ببخشاى، و در دلهايمان نسبت به كسانى كه ايمان آورده‌اند [هيچ گونه‌] كينه‌اى مگذار! پروردگارا، راستى كه تو رئوف و مهربانى.»"
          ],
          "fa.ghomshei": [
            "و آنان که پس از مهاجرین و انصار آمدند (یعنی تابعین و سایر مؤمنین تا روز قیامت) دایم به درگاه خدا عرض می‌کنند: پروردگارا، بر ما و برادران دینی‌مان که در ایمان پیش از ما شتافتند ببخش و در دل ما هیچ کینه و حسد مؤمنان قرار مده، پروردگارا، تویی که بسیار رؤوف و مهربانی."
          ],
          "fa.khorramdel": [
            "کسانی که پس از مهاجرین و انصار به دنیا می‌آیند، می‌گویند: پروردگارا! ما را و برادران ما را که در ایمان آوردن بر ما پیشی گرفته‌اند بیامرز. و کینه‌ای نسبت به مؤمنان در دلهایمان جای مده، پروردگارا! تو دارای رأفت و رحمت فراوانی هستی. [[«الَّذِینَ جَآءُوا ...»: مراد تابعین و همه مؤمنانی است که تا دامنه قیامت به دنیا می‌آیند و آئین اسلام را می‌پذیرند. «غِلاًّ»: کینه. کینه‌توزی و دشمنانگی.]]"
          ],
          "fa.khorramshahi": [
            "و کسانی که پس از آنان آمده‌اند گویند پروردگارا ما و برادرانمان را که در ایمان بر ما سبقت دارند، بیامرز، و در دلهای ما نسبت به مؤمنان کینه‌ای مگذار، پروردگارا تویی که رئوف مهربانی‌"
          ],
          "fa.makarem": [
            "(همچنین) کسانی که بعد از آنها [= بعد از مهاجران و انصار] آمدند و می‌گویند: «پروردگارا! ما و برادرانمان را که در ایمان بر ما پیشی گرفتند بیامرز، و در دلهایمان حسد و کینه‌ای نسبت به مؤمنان قرار مده! پروردگارا، تو مهربان و رحیمی!»"
          ],
          "fa.moezzi": [
            "و آنان که آمدند از پس ایشان گویند پروردگارا بیامرز برای ما و برای برادران ما آنان که پیشی گرفتند ما را به ایمان و نگذار در دلهای ما کینی برای آنان که ایمان آوردند پروردگارا همانا توئی نوازنده مهربان‌"
          ],
          "fa.mojtabavi": [
            "و نيز كسانى راست كه پس از آنان آمدند- پس از فتح مكه مهاجرت كردند- مى‌گويند: پروردگارا، ما و آن برادران ما را كه به ايمان بر ما پيشى گرفته اند بيامرز، و در دلهاى ما بدخواهى كسانى را كه ايمان آورده‌اند منه پروردگارا، همانا تو رؤوف و مهربانى."
          ],
          "fa.sadeqi": [
            "و (نیز) کسانی که بعد از آنان [:مهاجران و انصار] آمدند گویند: «پروردگارمان! برایمان و برای آن برادرانمان که در ایمان آوردن بر ما پیشی گرفتند بپوشان، و در دل‌هایمان نسبت به کسانی که ایمان آورده‌اند (هیچ گونه) کینه‌ای وامگذار. پروردگارمان! راستی که تو مهربانِ رحمتگر بر ویژگانی.»"
          ]
        }
      },
      {
        "index": 5137,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:59:11",
        "text": [
          "أَ لَمْ‌ تَرَ إِلَى‌ الَّذِينَ‌ نَافَقُوا يَقُولُونَ‌ لِإِخْوَانِهِمُ‌ الَّذِينَ‌ کَفَرُوا مِنْ‌ أَهْلِ‌ الْکِتَابِ‌ لَئِنْ‌ أُخْرِجْتُمْ‌ لَنَخْرُجَنَ‌ مَعَکُمْ‌ وَ لاَ نُطِيعُ‌ فِيکُمْ‌ أَحَداً أَبَداً وَ إِنْ‌ قُوتِلْتُمْ‌ لَنَنْصُرَنَّکُمْ‌ وَ اللَّهُ‌ يَشْهَدُ إِنَّهُمْ‌ لَکَاذِبُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Have you never considered the hypocrites? They say to their brethren among the people of the Book who do not believe: \"If you are driven out we shall go with you, and will not listen to any one in what concerns you; and if there is war against you, we shall aid you.\" But God is witness they are liars."
          ],
          "en.ahmedraza": [
            "Did you not see the hypocrites, that they say to their disbelieving brothers among the People given the Book(s), “If you are expelled, then we will definitely go out with you, and we will not listen to anyone in your matters, and if you are fought against we will surely help you”; and Allah testifies that they are indeed liars."
          ],
          "en.arberry": [
            "Hast thou not regarded the hypocrites, saying to their brothers of the People of the Book who disbelieve, 'If you are expelled, we will go forth with you, and we will never obey anyone in regard to you. If you are fought against, we will help you.' And God bears witness that they are truly liars."
          ],
          "en.daryabadi": [
            "Beholdest thou not: those who dissemble saying Unto their brethren who disbelieve among the people of the Book: if ye are driven forth we shall surely go forth with you, and we, shall not ever obey anyone in your respect, and if ye are attacked, we shall surely succour you. And Allah beareth witness that surely they are liars."
          ],
          "en.hilali": [
            "Have you (O Muhammad SAW) not observed the hypocrites who say to their friends among the people of the Scripture who disbelieve: \"(By Allah) If you are expelled, we (too) indeed will go out with you, and we shall never obey any one against you, and if you are attacked (in fight), we shall indeed help you.\" But Allah is Witness, that they verily, are liars."
          ],
          "en.itani": [
            "Have you not considered those who act hypocritically? They say to their brethren who disbelieved among the People of the Book, “If you are evicted, we will leave with you, and will not obey anyone against you; and should anyone fight you, we will certainly support you.” But God bears witness that they are liars."
          ],
          "en.maududi": [
            "Did you not see the hypocrites say to their brethren, the unbelievers among the People of the Book: “If you are banished we too will go with you and will not listen to anyone concerning you; and if war is waged against you, we will come to your aid.” But Allah bears witness that they are liars."
          ],
          "en.mubarakpuri": [
            "Have you not observed the hypocrites who say to their disbelieving brethren among the People of the Scripture, \"If you are expelled, we indeed will go out with you, and we shall never obey anyone against you; and if you are attacked, we shall indeed help you.\" But Allah is Witness that they verily are liars."
          ],
          "en.pickthall": [
            "Hast thou not observed those who are hypocrites, (how) they tell their brethren who disbelieve among the People of the Scripture: If ye are driven out, we surely will go out with you, and we will never obey anyone against you, and if ye are attacked we verily will help you. And Allah beareth witness that they verily are liars."
          ],
          "en.qarai": [
            "Have you not regarded the hypocrites who say to their brethren, the faithless from among the People of the Book, ‘If you are expelled, we will surely go out with you, and we will never obey anyone against you, and if you are fought against we will surely help you,’ and Allah bears witness that they are indeed liars."
          ],
          "en.qaribullah": [
            "Have you not seen the hypocrites? They say to their brothers among the People of the Book who disbelieve, 'If they expel you, we will go with you. We willnever obey anyone against you. If they fight against you we will certainly help you' But Allah bears witness that they are, without doubt, liars."
          ],
          "en.sahih": [
            "Have you not considered those who practice hypocrisy, saying to their brothers who have disbelieved among the People of the Scripture, \"If you are expelled, we will surely leave with you, and we will not obey, in regard to you, anyone - ever; and if you are fought, we will surely aid you.\" But Allah testifies that they are liars."
          ],
          "en.sarwar": [
            "Have you not seen the hypocrites who say to their disbelieving brothers among the People of the Book, \"If you are driven out, we shall, also, leave the town with you and we shall never obey whoever seeks to harm you. If you are attacked, we shall help you.\" God testifies that they are liars."
          ],
          "en.shakir": [
            "Have you not seen those who have become hypocrites? They say to those of their brethren who disbelieve from among the followers of the Book: If you are driven forth, we shall certainly go forth with you, and we will never obey any one concerning you, and if you are fought against, we will certainly help you, and Allah bears witness that they are most surely liars."
          ],
          "en.transliteration": [
            "Alam tara il<u>a</u> alla<u>th</u>eena n<u>a</u>faqoo yaqooloona liikhw<u>a</u>nihimu alla<u>th</u>eena kafaroo min ahli alkit<u>a</u>bi lain okhrijtum lanakhrujanna maAAakum wal<u>a</u> nu<u>t</u>eeAAu feekum a<u>h</u>adan abadan wain qootiltum lanan<u>s</u>urannakum wa<b>A</b>ll<u>a</u>hu yashhadu innahum lak<u>ath</u>iboon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Have you not seen those who act hypocritically? They say to their disbelieving companions from among the People of the Book, \"If you are driven out we shall surely go out with you, and we shall never listen to anyone against you, and if war is waged against you, we shall help you.\" God bears witness that they are indeed liars."
          ],
          "en.yusufali": [
            "Hast thou not observed the Hypocrites say to their misbelieving brethren among the People of the Book? - \"If ye are expelled, we too will go out with you, and we will never hearken to any one in your affair; and if ye are attacked (in fight) we will help you\". But Allah is witness that they are indeed liars."
          ],
          "fa.ansarian": [
            "آیا کسانی را که نفاق ورزیدند، ندیدی؟ که به برادران کافرشان از اهل کتاب می گویند: اگر شما را [از خانه و دیارتان] بیرون کردند، ما هم قطعاً با شما بیرون می آییم، و هرگز فرمان کسی را بر ضد شما اطاعت نمی کنیم، و اگر با شما جنگیدند، همانا شما را یاری می کنیم. و خدا گواهی می دهد که آنان دروغگویند."
          ],
          "fa.ayati": [
            "آيا منافقان را نديده‌اى كه به ياران خود از اهل كتاب كه كافر بودند مى‌گفتند: اگر شما را اخراج كنند، ما نيز با شما بيرون مى‌آييم و به زيان شما از هيچ كس اطاعت نخواهيم كرد و اگر با شما جنگيدند ياريتان مى‌كنيم؟ و حال آنكه خدا مى‌داند كه دروغ مى‌گويند."
          ],
          "fa.bahrampour": [
            "آيا كسانى را كه به نفاق برخاستند نديدى كه به برادران كافرشان از اهل كتاب مى‌گفتند: اگر شما اخراج شديد، حتما با شما بيرون خواهيم آمد و در باره‌ى شما هرگز از كسى فرمان نخواهيم برد، و اگر با شما جنگيدند حتما شما را يارى خواهيم كرد؟ و خدا گواهى مى‌دهد ك"
          ],
          "fa.fooladvand": [
            "مگر كسانى را كه به نفاق برخاستند نديدى كه به برادران اهل كتاب خود -كه از در كفر درآمده بودند- مى‌گفتند: «اگر اخراج شديد، حتماً با شما بيرون خواهيم آمد، و بر عليه شما هرگز از كسى فرمان نخواهيم برد؛ و اگر با شما جنگيدند، حتماً شما را يارى خواهيم كرد.» و خدا گواهى مى‌دهد كه قطعاً آنان دروغگويانند."
          ],
          "fa.ghomshei": [
            "(ای رسول) آیا آنان را که نفاق ورزیدند ندیدی؟ که با برادرانشان همان یهود اهل کتاب که کافر شدند (در پیوسته و) گویند: اگر شما از دیارتان اخراج شوید البته ما هم به همراهی شما خارج خواهیم شد و در راه حمایت شما از احدی ابدا اطاعت نخواهیم کرد و اگر (مسلمانان) با شما جنگ کردند البته شما را مدد می‌کنیم، و خدا گواهی دهد که محققا آنها دروغ می‌گویند."
          ],
          "fa.khorramdel": [
            "آیا منافقانی را ندیده‌ای که پیوسته به برادران کافر اهل کتاب خود می‌گویند: هرگاه شما را بیرون کنند، ما هم با شما بیرون خواهیم آمد، و هرگز به زیان شما از سخن کسی فرمانبرداری نخواهیم کرد، و اگر با شما جنگ و پیکار شود، قطعاً به کمکتان شتافته و یاریتان خواهیم داد. خدا گواهی می‌دهد که آنان دروغ می‌گویند (و به عهد خود وفا نمی‌کنند). [[«أَلَمْ تَرَ ...»: برای تعجب است. «أَهْلِ الْکِتَابِ»: مراد بنی‌نضیر و چه‌بسا یهودیان بنی‌قریظه هم باشد. «لا نُطِیعُ فِیکُمْ»: مراد اطاعت از فرمان جنگ درباره یهودیان است. «أَحَداً»: مراد پیغمبر و یکایک مسلمانان است. «قُوتِلْتُمْ»: با شما قتال گردید. با شما جنگ و پیکار درگرفت.]]"
          ],
          "fa.khorramshahi": [
            "آیا ننگریسته‌ای کسانی را که نفاق ورزیدند به دوستانشان از اهل کتاب که کفرورزیدند، گفتند اگر شما رانده شوید، ما نیز همراه شما بیرون می‌آییم، و به زیان شما هرگز از امر هیچ کس اطاعت نخواهیم کرد، و اگر با شما کارزار شود، حتما شما را یاری خواهیم کرد، خداوند شاهد است که آنان دروغگو هستند"
          ],
          "fa.makarem": [
            "آیا منافقان را ندیدی که پیوسته به برادران کفارشان از اهل کتاب می‌گفتند: «هرگاه شما را (از وطن) بیرون کنند، ما هم با شما بیرون خواهیم رفت و هرگز سخن هیچ کس را درباره شما اطاعت نخواهیم کرد؛ و اگر با شما پیکار شود، یاریتان خواهیم نمود!» خداوند شهادت می‌دهد که آنها دروغگویانند!"
          ],
          "fa.moezzi": [
            "آیا ننگریستی بدانان که نفاق ورزیدند گویند به برادران خویش آنان که کفر ورزیدند از اهل کتاب اگر برون رانده شوید برون آئیم با شما و فرمان نبریم در شما کسی را هیچگاه و اگر کارزار با شما شود هر آینه یاری کنیم شما را و خدا گواهی دهد که ایشانند همانا دروغگویان‌"
          ],
          "fa.mojtabavi": [
            "آيا به كسانى كه نفاق ورزيدند ننگريستى كه به برادران كافرشان از اهل كتاب- جهودان- مى‌گفتند: اگر شما را بيرون كردند هر آينه با شما بيرون مى آييم و در باره شما هيچ كس را فرمان نمى‌بريم و اگر با شما جنگ كردند بى‌گمان شما را يارى مى‌كنيم و خدا گواهى مى‌دهد كه آنان دروغگويند."
          ],
          "fa.sadeqi": [
            "آیا فراسوی کسانی که دورویی کردند ننگریستی (که) به برادرانشان از اهل کتاب - که کافر شدند - می‌گویند: «اگر همانا اخراج شدید، همواره با شما بی‌چون بیرون خواهیم آمد و درباره‌ی شما هرگز از کسی فرمان نخواهیم برد و اگر کشتار شدید به‌راستی حتماً یاریتان خواهیم کرد.» و خدا گواهی می‌دهد که همانا آنان‌، بس دروغگویانند."
          ]
        }
      },
      {
        "index": 5138,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:59:12",
        "text": [
          "لَئِنْ‌ أُخْرِجُوا لاَ يَخْرُجُونَ‌ مَعَهُمْ‌ وَ لَئِنْ‌ قُوتِلُوا لاَ يَنْصُرُونَهُمْ‌ وَ لَئِنْ‌ نَصَرُوهُمْ‌ لَيُوَلُّنَ‌ الْأَدْبَارَ ثُمَ‌ لاَ يُنْصَرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "If they are driven out, they will not go with them; and if they are attacked, they will not aid them. And even if they aided them, they will turn their backs, then they will not be helped."
          ],
          "en.ahmedraza": [
            "If they are expelled, the hypocrites will not go out with them; and if they are fought against they will not help them; and even if they were to help them, they would turn their backs and flee; and then they will not be helped."
          ],
          "en.arberry": [
            "If those are expelled, they will not go forth with them, and if they are fought against, they will not help them. Even if they helped them, they would surely turn their backs, then they would not be helped."
          ],
          "en.daryabadi": [
            "Surely if they are driven forth, they shall not; go forth with them, and surely if they are attacked, they shall succour them, not, and even ifs they succoured them they would turn their backs; and then they shall not be succoured."
          ],
          "en.hilali": [
            "Surely, if they (the Jews) are expelled, never will they (hypocrites) go out with them, and if they are attacked, they will never help them. And if they do help them, they (hypocrites) will turn their backs, so they will not be victorious."
          ],
          "en.itani": [
            "If they are evicted, they will not leave with them; and if anyone fights them, they will not support them; and if they go to their aid, they will turn their backs and flee; then they will receive no support."
          ],
          "en.maududi": [
            "To be sure, if they are banished, they will not go with them and if war is waged against them, they will not aid them; and even if they provide any aid to them, they will still turn their backs, and thereafter no aid will be forthcoming to them."
          ],
          "en.mubarakpuri": [
            "Surely, if they (the Jews) are expelled, never will they (hypocrites) go out with them; and if they are attacked, they will never help them. And (even) if they do help them, they (hypocrites) will turn their backs, and they will not be victorious."
          ],
          "en.pickthall": [
            "(For) indeed if they are driven out they go not out with them, and indeed if they are attacked they help them not, and indeed if they had helped them they would have turned and fled, and then they would not have been victorious."
          ],
          "en.qarai": [
            "Surely, if they were expelled they will not go out with them, and if they were fought against they will not help them, and [even if] they were to help them they will turn their backs [to flee] and eventually they will not be helped."
          ],
          "en.qaribullah": [
            "If they are expelled or fought against, they will not go with them, nor will they will help them. Indeed, if they helped them, they would turn their backs andthen they would not be helped."
          ],
          "en.sahih": [
            "If they are expelled, they will not leave with them, and if they are fought, they will not aid them. And [even] if they should aid them, they will surely turn their backs; then [thereafter] they will not be aided."
          ],
          "en.sarwar": [
            "If they were to be expelled, they would not go with them. If they were to be attacked they would not help them. Even if they were to help them, they would run away from the battle and leave them helpless."
          ],
          "en.shakir": [
            "Certainly if these are driven forth, they will not go forth with them, and if they are fought against, they will not help them, and even if they help-them, they will certainly turn (their) backs, then they shall not be helped."
          ],
          "en.transliteration": [
            "Lain okhrijoo l<u>a</u> yakhrujoona maAAahum walain qootiloo l<u>a</u> yan<u>s</u>uroonahum walain na<u>s</u>aroohum layuwallunna aladb<u>a</u>ra thumma l<u>a</u> yun<u>s</u>aroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "If they are driven out, they will not go with them, nor, if they are attacked, will they help them. Indeed, if they go to their help, they will turn their backs in flight, and then they will not be helped."
          ],
          "en.yusufali": [
            "If they are expelled, never will they go out with them; and if they are attacked (in fight), they will never help them; and if they do help them, they will turn their backs; so they will receive no help."
          ],
          "fa.ansarian": [
            "اگر [کافران از اهل کتاب را] بیرون کنند با آنان بیرون نمی روند، و اگر با آنان بجنگند آنان را یاری نمی دهند، و اگر یاری دهند در گرماگرم جنگ پشت کنان می گریزند، سپس [کافران اهل کتاب] یاری نمی شوند."
          ],
          "fa.ayati": [
            "اگر آنها را اخراج كنند، با آنها بيرون نشوند. و اگر به جنگشان بيايند ياريشان نمى‌كنند، و اگر هم به ياريشان برخيزند به دشمن پشت مى‌كنند. پس روى يارى نبينند."
          ],
          "fa.bahrampour": [
            "اگر [يهود] اخراج شوند، آنها با ايشان بيرون نخواهند رفت، و اگر با آنان جنگى شود آنها را يارى نخواهند كرد، و اگر هم ياريشان كنند حتما پشت مى‌كنند [و تنهايشان مى‌گذارند] و آن‌گاه يارى نمى‌شوند"
          ],
          "fa.fooladvand": [
            "اگر [يهود] اخراج شوند، آنها با ايشان بيرون نخواهند رفت، و اگر با آنان جنگيده شود [منافقان،] آنها را يارى نخواهند كرد، و اگر ياريشان كنند حتماً [در جنگ‌] پشت خواهند كرد و [ديگر] يارى نيابند."
          ],
          "fa.ghomshei": [
            "اگر آنها اخراج شوند هرگز منافقان با آنها خارج نمی‌شوند و اگر (مسلمانان) به جنگشان آیند هرگز یاریشان نمی‌کنند و اگر هم یاریشان کنند البته به جنگ پشت کنند و دیگر نصرت نخواهند یافت."
          ],
          "fa.khorramdel": [
            "هرگاه اخراج شوند با آنان بیرون نمی‌روند، و اگر با ایشان جنگ و پیکار شود، به کمکشان نمی‌شتابند و یاریشان نمی‌دهند، و اگر هم (فرضاً) به کمک و یاریشان روند، پشت می‌کنند و می‌گریزند، و دیگر کمک و یاری نخواهند شد (و خدا ایشان را هلاک می‌گرداند). [[«لَئِن نَّصَرُوهُمْ ...»: اگر هم فرضاً کمک کنند و یاری دهند. «ثُمَّ لا یُنصَرُونَ»: دیگر، منافقان روی یاری و پیروزی نخواهند دید و خدا آنان را نابود می‌گرداند (نگا: المختصر). از آن به بعد چنین یهودیانی یاری و کمک نخواهند شد (نگا: صفوه التفاسیر).]]"
          ],
          "fa.khorramshahi": [
            "اگر آنان [یهودیان بنی‌نضیر] رانده شوند، ایشان همراه آنان بیرون نروند، و اگر با آنان کارزار شود، ایشان را یاری ندهند، و اگر بخواهند یاریشان دهند، پشت کنند، سپس از هیچ کس یاری نیابند"
          ],
          "fa.makarem": [
            "اگر آنها را بیرون کنند با آنان بیرون نمی‌روند، و اگر با آنها پیکار شود یاریشان نخواهند کرد، و اگر یاریشان کنند پشت به میدان کرده فرار می‌کنند؛ سپس کسی آنان را یاری نمی‌کند!"
          ],
          "fa.moezzi": [
            "اگر برون رانده شوند برون نروند با ایشان و اگر نبرد با ایشان شود یاریشان نکنند و اگر یاریشان کنند برتابند پشتها را سپس یاری نشوند"
          ],
          "fa.mojtabavi": [
            "اگر بيرونشان كنند، با آنان بيرون نشوند و اگر با آنها كارزار كنند ياريشان ندهند و اگر هم به ياريشان بيايند هر آينه پشت كرده برگردند- بگريزند- و آنگاه يارى نشوند- يعنى آن جهودان-."
          ],
          "fa.sadeqi": [
            "به‌راستی اگر (یهودیان) اخراج شوند، آنان با ایشان بیرون نخواهند رفت و اگر کشتار شدند، (منافقان) آنان را یاری نخواهند کرد و اگر (هم) یاریشان کنند بی‌چون (در جنگ) بی‌امان پشت خواهند کرد (و) سپس یاری نمی‌شوند."
          ]
        }
      },
      {
        "index": 5139,
        "local_index": 13,
        "part_type": "Verse",
        "path": "/books/quran:59:13",
        "text": [
          "لَأَنْتُمْ‌ أَشَدُّ رَهْبَةً فِي‌ صُدُورِهِمْ‌ مِنَ‌ اللَّهِ‌ ذٰلِکَ‌ بِأَنَّهُمْ‌ قَوْمٌ‌ لاَ يَفْقَهُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Surely they have greater fear of you in their hearts than of God, because they do not understand."
          ],
          "en.ahmedraza": [
            "Indeed in their hearts is a greater fear of you than that of Allah; this is because they are a people who do not understand."
          ],
          "en.arberry": [
            "Why, you arouse greater fear in their hearts than God; that is because they are a people who understand not."
          ],
          "en.daryabadi": [
            "Surely ye are more awful in their breasts than Allah. That is because they are a people who understand not."
          ],
          "en.hilali": [
            "Verily, you (believers in the Oneness of Allah - Islamic Monotheism) are more awful as a fear in their (Jews of Bani An-Nadir) breasts than Allah. That is because they are a people who comprehend not (the Majesty and Power of Allah)."
          ],
          "en.itani": [
            "Fear of you is more intense in their hearts than fear of God. That is because they are a people who do not understand."
          ],
          "en.maududi": [
            "Surely they have greater dread for you in their hearts than for Allah. That is because they are a people who are devoid of understanding."
          ],
          "en.mubarakpuri": [
            "Verily, you are more fearful in their breasts than Allah. That is because they are a people who comprehend not."
          ],
          "en.pickthall": [
            "Ye are more awful as a fear in their bosoms than Allah. That is because they are a folk who understand not."
          ],
          "en.qarai": [
            "Indeed they have a greater awe of you in their hearts than of Allah. That is because they are a lot who do not understand."
          ],
          "en.qaribullah": [
            "Their fear of you in their hearts is greater than their fear of Allah; that is because they are a people who do not understand."
          ],
          "en.sahih": [
            "You [believers] are more fearful within their breasts than Allah. That is because they are a people who do not understand."
          ],
          "en.sarwar": [
            "They are more afraid of you than of God. They are a people who lack understanding."
          ],
          "en.shakir": [
            "You are certainly greater in being feared in their hearts than Allah; that is because they are a people who do not understand"
          ],
          "en.transliteration": [
            "Laantum ashaddu rahbatan fee <u>s</u>udoorihim mina All<u>a</u>hi <u>tha</u>lika biannahum qawmun l<u>a</u> yafqahoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "They are more in dread of you than of God, because they are people devoid of understanding."
          ],
          "en.yusufali": [
            "Of a truth ye are stronger (than they) because of the terror in their hearts, (sent) by Allah. This is because they are men devoid of understanding."
          ],
          "fa.ansarian": [
            "[آری منافقان، کافران از اهل کتاب را در گرماگرم جنگ به هنگام خطر رها می کنند و می گریزند؛ زیرا] ترس آنان از شما در دل هایشان بیش از ترس از خداست؛ چون آنان قومی هستند که [حقایق را به خاطر کوردلی] نمی فهمند."
          ],
          "fa.ayati": [
            "وحشت شما در دل آنها بيشتر از بيم خداست. زيرا مردمى هستند كه به فهم در نمى‌يابند."
          ],
          "fa.bahrampour": [
            "البته شما در دل‌هاى آنان از خداوند پر مهابت‌تريد، چرا كه آنها مردمى هستند كه نمى‌فهمند"
          ],
          "fa.fooladvand": [
            "شما قطعاً در دلهاى آنان بيش از خدا مايه هراسيد، چرا كه آنان مردمانى‌اند كه نمى‌فهمند."
          ],
          "fa.ghomshei": [
            "این مردم منافق در دلشان از شما بیشتر ترس دارند تا از خدا، زیرا آنها مردمی هستند که هیچ فهم و شعوری ندارند."
          ],
          "fa.khorramdel": [
            "هراس شما در سینه‌های ایشان، بیش از هراس آنان از خدا است! این بدان خاطر است که ایشان مردمان نفهم و نادانی هستند (و عظمت خدای را درک نمی‌کنند). [[«رَهْبَةً»: خوف و هراس. ترس و بیم. تمییز است. «بِأَنَّهُمْ»: به علت آنکه ایشان. بدان خاطر که آنان.]]"
          ],
          "fa.khorramshahi": [
            "بی‌شک شما در دلهای آنان هراس‌انگیزترید از خداوند، این از آن است که ایشان قومی بی‌تمیزند"
          ],
          "fa.makarem": [
            "وحشت از شما در دلهای آنها بیش از ترس از خداست؛ این به خاطر آن است که آنها گروهی نادانند!"
          ],
          "fa.moezzi": [
            "همانا شما ترسناکترید در سینه‌های ایشان از خدا این بدان است که ایشانند گروهی نادریابندگان‌"
          ],
          "fa.mojtabavi": [
            "هر آينه بيمى كه از شما در دل دارند از ترس از خدا بيشتر است. اين از آن‌روست كه گروهى نافهمند."
          ],
          "fa.sadeqi": [
            "شما بی‌گمان در سینه‌های آنان بیش از خدا هراسناکید، چرا که آنان گروهی‌اند که دقت و بررسی نمی‌کنند."
          ]
        }
      },
      {
        "index": 5140,
        "local_index": 14,
        "part_type": "Verse",
        "path": "/books/quran:59:14",
        "text": [
          "لاَ يُقَاتِلُونَکُمْ‌ جَمِيعاً إِلاَّ فِي‌ قُرًى‌ مُحَصَّنَةٍ أَوْ مِنْ‌ وَرَاءِ جُدُرٍ بَأْسُهُمْ‌ بَيْنَهُمْ‌ شَدِيدٌ تَحْسَبُهُمْ‌ جَمِيعاً وَ قُلُوبُهُمْ‌ شَتَّى‌ ذٰلِکَ‌ بِأَنَّهُمْ‌ قَوْمٌ‌ لاَ يَعْقِلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They will not fight you in a body except in fortified cities, or from behind the walls. Their enmity among themselves is great. You think they are united, but divided are their hearts. That is because these people are devoid of sense,"
          ],
          "en.ahmedraza": [
            "They will not fight you even if they all come together, except in barricaded cities or from behind walls; they are severe fighters among themselves; you will assume them to be one, whereas their hearts are divided; this is because they are a people who do not have any sense."
          ],
          "en.arberry": [
            "They will not fight against you all together except in fortified cities, or from behind walls. Their valour is great, among themselves; you think of them as a host; but their hearts are scattered; that is because they are a people who have no sense."
          ],
          "en.daryabadi": [
            "They shall not fight against you, not even together, except in fenced townships or from behind walls. Their violence among themselves is strong; thou deemest them enjoined, whereas their hearts are diverse. That is because they are a people who reflect not."
          ],
          "en.hilali": [
            "They fight not against you even together, except in fortified townships, or from behind walls. Their enmity among themselves is very great. You would think they were united, but their hearts are divided, that is because they are a people who understand not."
          ],
          "en.itani": [
            "They will not fight you all together except from fortified strongholds, or from behind walls. Their hostility towards each other is severe. You would think they are united, but their hearts are diverse. That is because they are a people who do not understand."
          ],
          "en.maududi": [
            "They will never fight against you as a body (in an open battlefield); and if they fight against you they will fight only in fortified townships or from behind walls. Intense is their hostility to one another. You reckon them united while their hearts are divided. That is because they are a people devoid of reason."
          ],
          "en.mubarakpuri": [
            "They fight not against you even together, except in fortified townships, or from behind walls. Their enmity among themselves is very great. You would think they were united, but their hearts are divided. That is because they are a people who understand not."
          ],
          "en.pickthall": [
            "They will not fight against you in a body save in fortified villages or from behind walls. Their adversity among themselves is very great. Ye think of them as a whole whereas their hearts are divers. That is because they are a folk who have no sense."
          ],
          "en.qarai": [
            "They will not fight against you together except in fortified townships or from behind walls. Their fierceness is great only within themselves. You suppose them to be united, but their hearts are divided. That is because they are a lot who do not exercise their reason,"
          ],
          "en.qaribullah": [
            "They will never fight against you all together except from fortified villages or from behind walls. Their courage is great among themselves; you think them to be united, yet their hearts are not united. That is because they are a people who have no sense."
          ],
          "en.sahih": [
            "They will not fight you all except within fortified cities or from behind walls. Their violence among themselves is severe. You think they are together, but their hearts are diverse. That is because they are a people who do not reason."
          ],
          "en.sarwar": [
            "They will not fight you united except with the protection of fortified towns or from behind walls. They are strong among themselves. You think that they are united, but in fact, their hearts are divided. They are a people who have no understanding."
          ],
          "en.shakir": [
            "They will not fight against you in a body save in fortified towns or from behind walls; their fighting between them is severe, you may think them as one body, and their hearts are disunited; that is because they are a people who have no sense."
          ],
          "en.transliteration": [
            "L<u>a</u> yuq<u>a</u>tiloonakum jameeAAan ill<u>a</u> fee quran mu<u>h</u>a<u>ss</u>anatin aw min war<u>a</u>i judurin basuhum baynahum shadeedun ta<u>h</u>sabuhum jameeAAan waquloobuhum shatt<u>a</u> <u>tha</u>lika biannahum qawmun l<u>a</u> yaAAqiloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "They will never fight against you in a body except from within fortified strongholds or from behind walls. There is much hostility between them. You think they are united, but their hearts are divided, because they are a people devoid of reason."
          ],
          "en.yusufali": [
            "They will not fight you (even) together, except in fortified townships, or from behind walls. Strong is their fighting (spirit) amongst themselves: thou wouldst think they were united, but their hearts are divided: that is because they are a people devoid of wisdom."
          ],
          "fa.ansarian": [
            "همه آنان [به صورت متحد و یک پارچه] با شما نمی جنگند مگر در آبادی هایی که دارای حصار و قلعه و دژ هستند، یا از پشت دیوارها، دلاوری آنان میان خودشان شدید است [ولی از رویارویی با شما می ترسند]، آنان را متحد و هم دست می پنداری در حالی که دل هایشان پراکنده است؛ زیرا آنان گروهی هستند که تعقّل نمی کنند."
          ],
          "fa.ayati": [
            "آنان همگى با شما جنگ نپيوندند مگر در قريه‌هايى كه بارويشان باشد، يا از پس ديوار. آنها سخت با يكديگر دشمنند. تو يكدل مى‌پنداريشان و حال آنكه دلهاشان از هم جداست، كه مردمى بى‌خردند."
          ],
          "fa.bahrampour": [
            "آنها با شما به صورت گروهى [و در يك صف متحد] نمى‌جنگند مگر در قريه‌هاى قلعه‌دار يا از پس ديوارها. زورمندى ايشان در ميان خودشان سخت است [اما در مقابل شما ضعيفند]. آنها را متحد مى‌پندارى ولى دل‌هايشان پراكنده است. اين بدان سبب است كه آنان مردمى هستند ك"
          ],
          "fa.fooladvand": [
            "[آنان، به صورت‌] دسته جمعى، جز در قريه‌هايى كه داراى استحكاماتند، يا از پشت ديوارها، با شما نخواهند جنگيد. جنگشان ميان خودشان سخت است. آنان را متحد مى‌پندارى و[لى‌] دلهايشان پراكنده است، زيرا آنان مردمانى‌اند كه نمى‌انديشند."
          ],
          "fa.ghomshei": [
            "(یهودان از ترس) بر جنگ با شما جمع نمی‌شوند مگر در قریه‌های محکم حصار یا از پس دیوار (دشمنی مکر و حیله و جاسوسی)، کارزار بین خودشان سخت است، شما آنها را جمع و متّفق می‌پندارید در صورتی که دلهاشان سخت متفرق است، زیرا آن قوم دارای فهم و عقل نیستند."
          ],
          "fa.khorramdel": [
            "یهودیان هرگز با شما به صورت دسته‌جمعی جز در پس دژهای محکم و یا از پشت دیوارها نمی‌جنگند. عداوت و دشمنی در میان خودشان شدّت دارد. تو ایشان را متّحد می‌بینی، ولی پراکنده دل بوده و همآهنگ نمی‌باشند. این بدان خاطر است که مردمان بیشعور و ناآگاهی هستند. [[«قُریً مُّحَصَّنَةٍ»: آبادیهای محکم. مراد دژهای استوار است. «جُدُرٍ»: جمع جِدار، دیوارها. سورها. «بَأْسُهُم بَیْنَهُمْ شَدِیدٌ»: جنگ و عداوت در میان خودشان سخت است و متحد و متفق نیستند. در جنگ با یکدیگر توانا و نیرومندند، ولی در مقابل مؤمنان راستین ترسو و ضعیف می‌باشند.]]"
          ],
          "fa.khorramshahi": [
            "هرگز همگی با شما کارزار نکنند مگر در میان برزنهای محصور، یا از پشت دیوارها، ستیز و صلابت آنان در میان خودشان سخت است، آنان را همدست می‌انگاری، حال آنکه دلهایشان پراکنده است، این از آن است که قومی نابخردند"
          ],
          "fa.makarem": [
            "آنها هرگز با شما بصورت گروهی نمی‌جنگند جز در دژهای محکم یا از پشت دیوارها! پیکارشان در میان خودشان شدید است، (امّا در برابر شما ضعیف!) آنها را متّحد می‌پنداری، در حالی که دلهایشان پراکنده است؛ این به خاطر آن است که آنها قومی هستند که تعقّل نمی‌کنند!"
          ],
          "fa.moezzi": [
            "پیکار نکنند با شما همگی جز در شهرهای بارودار یا از پشت دیوارها ترس ایشان میان ایشان است سخت پنداریشان پیوسته و دلهاشان پراکنده است این بدان است که ایشانند گروهی نابخردان‌"
          ],
          "fa.mojtabavi": [
            "همه آنها- منافقان و جهودان- با شما كارزار نمى‌كنند مگر در آباديهاى استوارشده- به خندق و برج و بارو- يا از پس ديوارها- به سنگ و تير-. زورمندى آنها در ميان خودشان سخت است- ولى در برابر مسلمانان سست است و ياراى رويارويى دارند-. آنان را با هم و به هم ساخته مى‌پندارى ولى دلهاشان پراكنده است. اين بدان سبب است كه مردمى بيخردند."
          ],
          "fa.sadeqi": [
            "آنان، دسته‌‌جمعی - جز در قریه‌هایی که دارای استحکاماتی است، یا از پشت دیوارها- با شما کشتار نمی‌کنند. گرفتاریشان میان خودهاشان سخت است. آنان را متّحد می‌پنداری حال آنکه دل‌هایشان پراکنده است، زیرا آنان گروهی‌اند که درنمی‌یابند (و نمی‌فهمند)."
          ]
        }
      },
      {
        "index": 5141,
        "local_index": 15,
        "part_type": "Verse",
        "path": "/books/quran:59:15",
        "text": [
          "کَمَثَلِ‌ الَّذِينَ‌ مِنْ‌ قَبْلِهِمْ‌ قَرِيباً ذَاقُوا وَبَالَ‌ أَمْرِهِمْ‌ وَ لَهُمْ‌ عَذَابٌ‌ أَلِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Like those who had tasted the gravity of their actions a little before them. There is a grievous punishment for them."
          ],
          "en.ahmedraza": [
            "Like the example of those who were before them not long ago – they tasted the evil result of their deeds; and for them is a painful punishment."
          ],
          "en.arberry": [
            "Like those who a short time before them tasted the mischief of their action; there awaits them a painful chastisement."
          ],
          "en.daryabadi": [
            "They are like those a little before them; they tasted the ill-effect of their affair, and theirs shall be a torment afflictive."
          ],
          "en.hilali": [
            "They are like their immediate predecessors (the Jews of Bani Qainuqa', who suffered), they tasted the evil result of their conduct, and (in the Hereafter, there is) for them a painful torment;"
          ],
          "en.itani": [
            "Like those shortly before them. They experienced the consequences of their decisions. For them is a painful punishment."
          ],
          "en.maududi": [
            "They are like those who tasted the evil consequences of their deeds a short while before. A grievous chastisement awaits them."
          ],
          "en.mubarakpuri": [
            "They are like their immediate predecessors; they tasted the evil result of their conduct, and for them a painful torment."
          ],
          "en.pickthall": [
            "On the likeness of those (who suffered) a short time before them, they taste the ill-effects of their own conduct, and theirs is painful punishment."
          ],
          "en.qarai": [
            "just like those who tasted the evil consequence of their conduct recently before them, and there is a painful punishment for them."
          ],
          "en.qaribullah": [
            "Just as those who, not long before, tasted the mischief of their actions, there awaits for them a painful punishment."
          ],
          "en.sahih": [
            "[Theirs is] like the example of those shortly before them: they tasted the bad consequence of their affair, and they will have a painful punishment."
          ],
          "en.sarwar": [
            "They are like those who, a short time before, suffered the consequences of their deeds. They, too, will suffer a painful torment."
          ],
          "en.shakir": [
            "Like those before them shortly; they tasted the evil result of their affair, and they shall have a painful punishment."
          ],
          "en.transliteration": [
            "Kamathali alla<u>th</u>eena min qablihim qareeban <u>tha</u>qoo wab<u>a</u>la amrihim walahum AAa<u>tha</u>bun aleem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Like those who went just before them, they have tasted the evil consequences of their doings. And they shall have a painful punishment."
          ],
          "en.yusufali": [
            "Like those who lately preceded them, they have tasted the evil result of their conduct; and (in the Hereafter there is) for them a grievous Penalty;-"
          ],
          "fa.ansarian": [
            "[داستان این یهودی های نابکار بنی نظیر] مانند کسانی است که اندکی پیش از اینان [در پیرامون مدینه] بودند که سرانجام وخیم کارشان را چشیدند، و برای آنان عذابی دردناک است."
          ],
          "fa.ayati": [
            "همانند آنهايى هستند كه چندى پيش وبال گناه خويش را چشيدند. و به عذابى دردآور نيز گرفتار خواهند شد."
          ],
          "fa.bahrampour": [
            "درست مانند كسانى كه چندى پيش از آنها [در واقعه بدر] سزاى كار خود را چشيدند، و براى آنها عذابى دردناك است"
          ],
          "fa.fooladvand": [
            "درست مانند همان كسانى كه اخيرا [در واقعه بدر] سزاى كار [بد] خود را چشيدند؛ و آنان را عذاب دردناكى خواهد بود."
          ],
          "fa.ghomshei": [
            "مثل حال اینان هم مانند همان قوم کافر پیشین است (یعنی یهود قینقاع یا کفّار بدر) که (در دنیا) بدین زودی کیفر کردارشان را چشیدند و (در قیامت) هم عذاب دردناک بر آنها مهیّاست."
          ],
          "fa.khorramdel": [
            "سرگذشت اینان به سرگذشت کسانی می‌ماند که چندی پیش از اینان (در جنگ بدر) طعم تلخ کار بد خود را چشیدند، و (گذشته از این، در آخرت نیز) عذاب دردناکی دارند. [[«الَّذِینَ ...»: مراد مشرکان قریش است که در غزوه بدر شکست خوردند (نگا: انفال / 12 - 24). برخی آنان را یهودیان بنی‌قریظه می‌دانند. «وَ بَالَ»: نتیجه بدِ کار (نگا: مائده / 95).]]"
          ],
          "fa.khorramshahi": [
            "همانند پیشینیان نزدیکشان که عقوبت کار [نادرست‌]شان را چشیدند و عذابی دردناک [در پیش‌] دارند"
          ],
          "fa.makarem": [
            "کار این گروه از یهود همانند کسانی است که کمی قبل از آنان بودند، طعم تلخ کار خود را چشیدند و برای آنها عذابی دردناک است!"
          ],
          "fa.moezzi": [
            "مانند آنان که پیش از ایشان بودند به نزدیک چشیدند بد فرجامی کار خویش را و ایشان را است عذابی دردناک‌"
          ],
          "fa.mojtabavi": [
            "[داستان آنها]- جهودان- همچون داستان كسانى است كه اندك زمانى پيش از آنها بودند- جهودان بنى قينقاع يا كافران مكه- كه فرجام بد كار خود را چشيدند، و آنان را عذابى است دردناك."
          ],
          "fa.sadeqi": [
            "(درست) مانند کسانی‌که اخیراً (در واقعه‌ی بدر) سزای کار (بد) خود را چشیدند و برایشان عذابی دردناک است."
          ]
        }
      },
      {
        "index": 5142,
        "local_index": 16,
        "part_type": "Verse",
        "path": "/books/quran:59:16",
        "text": [
          "کَمَثَلِ‌ الشَّيْطَانِ‌ إِذْ قَالَ‌ لِلْإِنْسَانِ‌ اکْفُرْ فَلَمَّا کَفَرَ قَالَ‌ إِنِّي‌ بَرِي‌ءٌ مِنْکَ‌ إِنِّي‌ أَخَافُ‌ اللَّهَ‌ رَبَ‌ الْعَالَمِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "(They are) like Satan who says to man: \"Do not believe;\" and when he becomes a disbeliever, he says: \"I have nothing to do with you. I fear God, the Lord of all the worlds.\""
          ],
          "en.ahmedraza": [
            "The example of the devil – when he said to man “Disbelieve”; so when he has rejected faith, he says, “I am unconcerned with you – indeed I fear Allah, the Lord of The Creation.”"
          ],
          "en.arberry": [
            "Like Satan, when he said to man, 'Disbelieve'; then, when he disbelieved, he said, 'Surely I am quit of you. Surely I fear God, the Lord of all Being.'"
          ],
          "en.daryabadi": [
            "They are like the Satan, when he saith Unto man: 'disbelieve,' then, when he disbelieveth, saith: verily I am quit of thee, verily I fear Allah, the Lord of the Worlds."
          ],
          "en.hilali": [
            "(Their allies deceived them) like Shaitan (Satan), when he says to man: \"Disbelieve in Allah.\" But when (man) disbelieves in Allah, Shaitan (Satan) says: \"I am free of you, I fear Allah, the Lord of the 'Alamin (mankind, jinns and all that exists)!\""
          ],
          "en.itani": [
            "Like the devil, when he says to the human being, “Disbelieve.” But when he has disbelieved, he says, “I am innocent of you; I fear God, the Lord of the Worlds.”"
          ],
          "en.maududi": [
            "Their parable is that of Satan when he says to man: “Disbelieve,” but when he disbelieves, he says: “I am quit of you. Verily I fear Allah, the Lord of the Universe.”"
          ],
          "en.mubarakpuri": [
            "Like Shaytan, when he says to man: \"Disbelieve.\" But when he disbelieves, Shaytan says: \"I am free of you, I fear Allah, the Lord of all that exists!\""
          ],
          "en.pickthall": [
            "(And the hypocrites are) on the likeness of the devil when he telleth man to disbelieve, then, when he disbelieveth saith: Lo! I am quit of thee. Lo! I fear Allah, the Lord of the Worlds."
          ],
          "en.qarai": [
            "[The hypocrites are] like Satan when he tells man to disbelieve, but when he disbelieves, he says, ‘I am absolved of you. Indeed I fear Allah, the Lord of all the worlds.’"
          ],
          "en.qaribullah": [
            "Like satan when he said to the human, 'Disbelieve'; then as soon as he disbelieved, he said, 'Indeed, I am innocent of you, surely, I fear Allah, the Lord of all the Worlds'"
          ],
          "en.sahih": [
            "[The hypocrites are] like the example of Satan when he says to man, \"Disbelieve.\" But when he disbelieves, he says, \"Indeed, I am disassociated from you. Indeed, I fear Allah, Lord of the worlds.\""
          ],
          "en.sarwar": [
            "They are like satan who said to people, \"Reject the faith,\" but when the people rejected the faith he said, \"I have nothing to do with you. I fear the Lord of the Universe\"."
          ],
          "en.shakir": [
            "Like the Shaitan when he says to man: Disbelieve, but when he disbelieves, he says: I am surely clear of you; surely I fear Allah, the Lord of the worlds."
          ],
          "en.transliteration": [
            "Kamathali a<b>l</b>shshay<u>ta</u>ni i<u>th</u> q<u>a</u>la lilins<u>a</u>ni okfur falamm<u>a</u> kafara q<u>a</u>la innee bareeon minka innee akh<u>a</u>fu All<u>a</u>ha rabba alAA<u>a</u>lameen<b>a</b>"
          ],
          "en.wahiduddin": [
            "They are like Satan, who says to man, \"Deny the truth!\" but when man denied the truth, said, \"I disown you; I fear God, the Lord of the Universe.\""
          ],
          "en.yusufali": [
            "(Their allies deceived them), like the Evil One, when he says to man, \"Deny Allah\": but when (man) denies Allah, (the Evil One) says, \"I am free of thee: I do fear Allah, the Lord of the Worlds!\""
          ],
          "fa.ansarian": [
            "[داستان منافقان که کافران از اهل کتاب را با وعده های دروغ فریفتند] چون داستان شیطان است که به انسان گفت: کافر شو. هنگامی که کافر شد، گفت: من از تو بیزارم، من از خدا که پروردگار جهانیان است، می ترسم."
          ],
          "fa.ayati": [
            "همانند شيطان كه به آدمى گفت: كافر شو. چون كافر شد، گفت: من از تو بيزارم. من از خدا، آن پروردگار جهانيان مى‌ترسم."
          ],
          "fa.bahrampour": [
            "[وعده‌ى منافقان به يهوديان‌] همچون حكايت شيطان است آنگاه كه به آدمى گويد: كافر شو! و چون كافر شود، گويد: من از تو بيزارم، زيرا من از خدا، پروردگار جهانيان مى‌ترسم"
          ],
          "fa.fooladvand": [
            "چون حكايت شيطان كه به انسان گفت: «كافر شو.» و چون [وى‌] كافر شد، گفت: «من از تو بيزارم، زيرا من از خدا، پروردگار جهانيان، مى‌ترسم.»"
          ],
          "fa.ghomshei": [
            "(این منافقان) در مثل مانند شیطانند که انسان را گفت: به خدا کافر شو، پس از آنکه آدمی کافر شد بدو گوید: از تو بیزارم، که من از (عقاب) پروردگار عالمیان سخت می‌ترسم."
          ],
          "fa.khorramdel": [
            "(داستان منافقان با یهودیان) همچون داستان اهریمن است که به انسان می‌گوید: کافر شو (تا مشکلات تو حلّ شود). امّا هنگامی که (بر اثر وسوسه‌های اهریمن) کافر می‌گردد، اهریمن می‌گوید: من از تو بیزار و گریزانم! چرا که من از خدا، یعنی پروردگار جهانیان می‌ترسم. [[«قَالَ لِلإِنسَانِ»: به انسان، هر نوع انسانی، آمرانه دستور می‌دهد. البته دستور شیطان، وسوسه‌های او است و بس (نگا: ابراهیم / 22، حجر / 42). «بَرِی‌ءٌ»: بیزار. گریزان (نگا: انفال / 48).]]"
          ],
          "fa.khorramshahi": [
            "همانند شیطان که به انسان گوید کافر شو، و چون کافر شود، گوید من از تو بری و بر کنارم، که من از خداوند -پروردگار جهانیانمی‌ترسم‌"
          ],
          "fa.makarem": [
            "کار آنها همچون شیطان است که به انسان گفت: «کافر شو (تا مشکلات تو را حل کنم)!» امّا هنگامی که کافر شد گفت: «من از تو بیزارم، من از خداوندی که پروردگار عالمیان است بیم دارم!»"
          ],
          "fa.moezzi": [
            "مانند شیطان گاهی که گفت به انسان کافر شو پس هنگامی که کفر ورزید گفت همانا من بیزارم از تو همانا من ترسم خدا را پروردگار جهانیان‌"
          ],
          "fa.mojtabavi": [
            "[داستان منافقان با جهودان‌] همانند داستان شيطان است آنگاه كه به آدمى گفت: كافر شو، و چون كافر شد، گفت: من از تو بيزارم من از خداى، پروردگار جهانيان، مى‌ترسم."
          ],
          "fa.sadeqi": [
            "همانند شیطان، چون به انسان گفت: «کافر شو!» پس چون کافر شد، گفت: «من همواره از تو بیزارم، زیرا من به‌راستی از خدا، پروردگار جهانیان، می‌ترسم.»"
          ]
        }
      },
      {
        "index": 5143,
        "local_index": 17,
        "part_type": "Verse",
        "path": "/books/quran:59:17",
        "text": [
          "فَکَانَ‌ عَاقِبَتَهُمَا أَنَّهُمَا فِي‌ النَّارِ خَالِدَيْنِ‌ فِيهَا وَ ذٰلِکَ‌ جَزَاءُ الظَّالِمِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Both of them will end up in Hell, where they will abide for ever. This is the punishment for the wicked."
          ],
          "en.ahmedraza": [
            "So the fate of them both is that they are both in the fire, to remain in it forever; and this is the proper punishment for the unjust."
          ],
          "en.arberry": [
            "Their end is, both are in the Fire, there dwelling forever; that is the recompense of the evildoers."
          ],
          "en.daryabadi": [
            "Wherefore the end of the twain will be that they will be in the Fire, as abiders there in; that is the meed of the wrong-doers."
          ],
          "en.hilali": [
            "So the end of both will be that they will be in the Fire, abiding therein. Such is the recompense of the Zalimun (i.e. polytheists, wrong-doers, disbelievers in Allah and in His Oneness, etc.)."
          ],
          "en.itani": [
            "The ultimate end for both of them is the Fire, where they will dwell forever. Such is the requital for the wrongdoers."
          ],
          "en.maududi": [
            "In the end both will be in the Fire, and will abide in it. That is the recompense of the wrong-doers."
          ],
          "en.mubarakpuri": [
            "So, the end of both will be that they will be in the Fire, abiding therein. Such is the recompense of the wrongdoers."
          ],
          "en.pickthall": [
            "And the consequence for both will be that they are in the Fire, therein abiding. Such is the reward of evil-doers."
          ],
          "en.qarai": [
            "So the fate of both is that they will be in the Fire, to remain in it [forever]. Such is the requital of the wrongdoers."
          ],
          "en.qaribullah": [
            "Their end shall be that they live for ever in the Fire. That is the recompense of the harmdoers."
          ],
          "en.sahih": [
            "So the outcome for both of them is that they will be in the Fire, abiding eternally therein. And that is the recompense of the wrong-doers."
          ],
          "en.sarwar": [
            "The fate of both of them will be hell fire wherein they will live forever. Thus will be the recompense for the unjust."
          ],
          "en.shakir": [
            "Therefore the end of both of them is that they are both in the fire to abide therein, and that is the reward of the unjust."
          ],
          "en.transliteration": [
            "Fak<u>a</u>na AA<u>a</u>qibatahum<u>a</u> annahum<u>a</u> fee a<b>l</b>nn<u>a</u>ri kh<u>a</u>lidayni feeh<u>a</u> wa<u>tha</u>lika jaz<u>a</u>o a<b>l</b><i><u>thth</u></i><u>a</u>limeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "Thus, in the end, both will find themselves in the Fire, therein to abide: that is the reward of evil-doers."
          ],
          "en.yusufali": [
            "The end of both will be that they will go into the Fire, dwelling therein for ever. Such is the reward of the wrong-doers."
          ],
          "fa.ansarian": [
            "سرانجامشان این شد که هر دو در آتش اند؛ و در آن جاودانه اند و این است کیفر ستمکاران."
          ],
          "fa.ayati": [
            "سرانجامشان آن شد كه هر دو به آتش افتند و جاودانه در آن باشند. اين است كيفر ستمكاران."
          ],
          "fa.bahrampour": [
            "پس فرجام آن دو اين است كه هر دو جاودانه در آتش باشند، و سزاى ستمگران همين است"
          ],
          "fa.fooladvand": [
            "و فرجام هردوشان آن است كه هر دو در آتش، جاويد مى‌مانند؛ و سزاى ستمگران اين است."
          ],
          "fa.ghomshei": [
            "پس عاقبت شیطان و آدمی که به امر او کافر شد این است که هر دو در آتش دوزخ مخلّدند و آن دوزخ کیفر ستمکاران عالم است."
          ],
          "fa.khorramdel": [
            "سرانجام کار (اهریمن و کسی که او گمراهش کرده است) بدانجا می‌انجامد که هر دو تا در آتش دوزخ جاودانه می‌مانند، و این سزای ستمگران است. [[«عَاقِبَتُهُمَا»: خبر مقدم (کانَ) و جمله (أَنَّهُمَا خَالِدَیْنِ فِیهَا) محلاً مرفوع اسم کانَ است.]]"
          ],
          "fa.khorramshahi": [
            "و سرانجام آن دو چنین است که هر دو در آتش جهنم‌اند، و جاودانه در آنند، و این جزای ستمکاران [مشرک‌] است‌"
          ],
          "fa.makarem": [
            "سرانجام کارشان این شد که هر دو در آتش دوزخ خواهند بود، جاودانه در آن می‌مانند؛ و این است کیفر ستمکاران!"
          ],
          "fa.moezzi": [
            "پس شد فرجام آنان که هر دو در آتشند جاودان در آن و این است کیفر ستمکاران‌"
          ],
          "fa.mojtabavi": [
            "پس سرانجام آن دو اين شد كه هر دو جاودانه در آتش باشند و اين است كيفر ستمكاران."
          ],
          "fa.sadeqi": [
            "پس فرجامشان آن بود که هر دو بی‌گمان در آتش جاودانند، و همان سزای ستمگران است."
          ]
        }
      },
      {
        "index": 5144,
        "local_index": 18,
        "part_type": "Verse",
        "path": "/books/quran:59:18",
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا اتَّقُوا اللَّهَ‌ وَ لْتَنْظُرْ نَفْسٌ‌ مَا قَدَّمَتْ‌ لِغَدٍ وَ اتَّقُوا اللَّهَ‌ إِنَ‌ اللَّهَ‌ خَبِيرٌ بِمَا تَعْمَلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O you who believe, be fearful of God. Let each soul consider what it has sent (of good deeds) in advance for the morrow, and fear God. Surely God is aware of what you do."
          ],
          "en.ahmedraza": [
            "O People who Believe! Fear Allah, and every soul must see what it has sent ahead for tomorrow; and fear Allah; indeed Allah is Aware of your deeds."
          ],
          "en.arberry": [
            "O believers, fear God. Let every soul consider what it has forwarded for the morrow. And fear God; God is aware of the things you do."
          ],
          "en.daryabadi": [
            "O ye who believe! fear Allah, and let every soul look to that which it sendeth forward for the morrow. And fear Allah; veril Allah is Aware of that which ye work."
          ],
          "en.hilali": [
            "O you who believe! Fear Allah and keep your duty to Him. And let every person look to what he has sent forth for the morrow, and fear Allah. Verily, Allah is All-Aware of what you do."
          ],
          "en.itani": [
            "O you who believe! Fear God, and let every soul consider what it has forwarded for the morrow, and fear God. God is Aware of what you do."
          ],
          "en.maududi": [
            "Believers, fear Allah and let every person look to what he sends forward for the morrow. Fear Allah; Allah is well aware of all that you do."
          ],
          "en.mubarakpuri": [
            "O you who believe! Have Taqwa of Allah and let every person look to what he has sent forth for tomorrow, and fear Allah. Verily, Allah is All-Aware of what you do."
          ],
          "en.pickthall": [
            "O ye who believe! Observe your duty to Allah. And let every soul look to that which it sendeth on before for the morrow. And observe your duty to Allah. Lo! Allah is Informed of what ye do."
          ],
          "en.qarai": [
            "O you who have faith! Be wary of Allah, and let every soul consider what it sends ahead for Tomorrow, and be wary of Allah. Allah is indeed well aware of what you do"
          ],
          "en.qaribullah": [
            "Believers, fear Allah. Let every soul look to what it has forwarded for the future, and fear Allah, for Allah is Aware of the things you do."
          ],
          "en.sahih": [
            "O you who have believed, fear Allah. And let every soul look to what it has put forth for tomorrow - and fear Allah. Indeed, Allah is Acquainted with what you do."
          ],
          "en.sarwar": [
            "Believers, have fear of God. A soul must see what it has done for the future. Have fear of God for He is All-aware of what you do."
          ],
          "en.shakir": [
            "O you who believe! be careful of (your duty to) Allah, and let every soul consider what it has sent on for the morrow, and be careful of (your duty to) Allah; surely Allah is Aware of what you do."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo ittaqoo All<u>a</u>ha waltan<i><u>th</u></i>ur nafsun m<u>a</u> qaddamat lighadin wa<b>i</b>ttaqoo All<u>a</u>ha inna All<u>a</u>ha khabeerun bim<u>a</u> taAAmaloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Believers! Fear God, and let every soul look to what it lays up for the future. Fear God: God is aware of what you do."
          ],
          "en.yusufali": [
            "O ye who believe! Fear Allah, and let every soul look to what (provision) He has sent forth for the morrow. Yea, fear Allah: for Allah is well-acquainted with (all) that ye do."
          ],
          "fa.ansarian": [
            "ای اهل ایمان! از خدا پروا کنید؛ و هر کسی باید با تأمل بنگرد که برای فردای خود چه چیزی پیش فرستاده است، و از خدا پروا کنید؛ یقیناً خدا به آنچه انجام می دهید، آگاه است."
          ],
          "fa.ayati": [
            "اى كسانى كه ايمان آورده‌ايد، از خدا بترسيد. و هر كس بايد بنگرد كه براى فردايش چه فرستاده است. از خدا بترسيد كه خدا به كارهايى كه مى‌كنيد آگاه است."
          ],
          "fa.bahrampour": [
            "اى كسانى كه ايمان آورده‌ايد! از خدا پروا داريد، و انسان بايد بنگرد كه براى فردا چه پيش فرستاده است، و از خدا بترسيد. بى‌ترديد خدا بدانچه مى‌كنيد آگاه است"
          ],
          "fa.fooladvand": [
            "اى كسانى كه ايمان آورده‌ايد، از خدا پروا داريد؛ و هر كسى بايد بنگرد كه براى فردا[ى خود] از پيش چه فرستاده است؛ و [باز] از خدا بترسيد. در حقيقت، خدا به آنچه مى‌كنيد آگاه است."
          ],
          "fa.ghomshei": [
            "الا ای اهل ایمان، خداترس شوید و هر نفسی نیک بنگرد تا چه عملی برای فردای قیامت خود پیش می‌فرستد، و از خدا بترسید که او به همه کردارتان به خوبی آگاه است."
          ],
          "fa.khorramdel": [
            "ای مؤمنان! از خدا بترسید و هر کسی باید بنگرد که چه چیزی را برای فردا (ی قیامت خود) پیشاپیش فرستاده است. از خدا بترسید، خدا آگاه از هر آن چیزی است که می‌کنید. [[«نَفْسٌ»: هرکسی. هر شخصی. «غَدٍ»: فردا. مراد فردای قیامت است. «مَا قَدَّمَتْ لِغَدٍ»: واژه (مَا) می‌تواند موصوله یا استفهامیه باشد.]]"
          ],
          "fa.khorramshahi": [
            "ای مؤمنان از خداوند پروا کنید و هر کس بنگرد که برای فردا چه پیش اندیشی کرده است، و از خداوند پروا کنید، چرا که خداوند به آنچه می‌کنید آگاه است‌"
          ],
          "fa.makarem": [
            "ای کسانی که ایمان آورده‌اید از (مخالفت) خدا بپرهیزید؛ و هر کس باید بنگرد تا برای فردایش چه چیز از پیش فرستاده؛ و از خدا بپرهیزید که خداوند از آنچه انجام می‌دهید آگاه است!"
          ],
          "fa.moezzi": [
            "ای آنان که ایمان آوردید بترسید خدا را و باید بنگرد هر کس چه چیز پیش فرستاده است برای فردا و بترسد خدا را که خدا آگاه است بدانچه کنید"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه ايمان آورده‌ايد، از خدا پروا كنيد، و هر كسى بايد بنگرد كه براى فردا- روز رستاخيز- چه پيش فرستاده است و از خدا پروا داشته باشيد، كه خدا بدانچه مى‌كنيد آگاه است."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که ایمان آوردید! از خدا پروا بدارید و هر کس باید بنگرد که برای فردایی از پیش چه فرستاده است، و (باز) از خدا پروا بدارید خدا همواره به آنچه می‌کنید بسی آگاه است."
          ]
        }
      },
      {
        "index": 5145,
        "local_index": 19,
        "part_type": "Verse",
        "path": "/books/quran:59:19",
        "text": [
          "وَ لاَ تَکُونُوا کَالَّذِينَ‌ نَسُوا اللَّهَ‌ فَأَنْسَاهُمْ‌ أَنْفُسَهُمْ‌ أُولٰئِکَ‌ هُمُ‌ الْفَاسِقُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "And be not like those who have forgotten God, so that God has made them forget themselves. Such are the reprobates."
          ],
          "en.ahmedraza": [
            "And do not be like those who forgot Allah – He therefore put them into hardship making them forget themselves; it is they who are the sinners."
          ],
          "en.arberry": [
            "Be not as those who forgot God, and so He caused them to forget their souls; those -- they are the ungodly."
          ],
          "en.daryabadi": [
            "And be not as those who forgot Allah, wherefore He caused them to forget their own souls. Those! they are the transgressors."
          ],
          "en.hilali": [
            "And be not like those who forgot Allah (i.e. became disobedient to Allah) and He caused them to forget their ownselves, (let them to forget to do righteous deeds). Those are the Fasiqun (rebellious, disobedient to Allah)."
          ],
          "en.itani": [
            "And do not be like those who forgot God, so He made them forget themselves. These are the sinners."
          ],
          "en.maududi": [
            "And be not like those who forgot Allah and so He made them oblivious of themselves. They are the wicked ones."
          ],
          "en.mubarakpuri": [
            "And be not like those who forgot Allah, and He caused them to forget themselves. Those are the rebellious."
          ],
          "en.pickthall": [
            "And be not ye as those who forgot Allah, therefor He caused them to forget their souls. Such are the evil-doers."
          ],
          "en.qarai": [
            "Do not be like those who forget Allah, so He makes them forget their own souls. It is they who are the transgressors."
          ],
          "en.qaribullah": [
            "Do not be like those who have forgotten Allah so that He has caused them to forget their souls. Those, they are the evildoers."
          ],
          "en.sahih": [
            "And be not like those who forgot Allah, so He made them forget themselves. Those are the defiantly disobedient."
          ],
          "en.sarwar": [
            "Do not be like those who forget about God. He will make them forget themselves. These are the sinful people."
          ],
          "en.shakir": [
            "And be not like those who forsook Allah, so He made them forsake their own souls: these it is that are the transgressors."
          ],
          "en.transliteration": [
            "Wal<u>a</u> takoonoo ka<b>a</b>lla<u>th</u>eena nasoo All<u>a</u>ha faans<u>a</u>hum anfusahum ol<u>a</u>ika humu alf<u>a</u>siqoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Do not be like those who forgot God, so that He caused them to forget their own souls [their own true interests]. It is they who are the rebellious ones."
          ],
          "en.yusufali": [
            "And be ye not like those who forgot Allah; and He made them forget their own souls! Such are the rebellious transgressors!"
          ],
          "fa.ansarian": [
            "و مانند کسانی مباشید که خدا را فراموش کردند، پس خدا هم آنان را دچار خودفراموشی کرد؛ اینان همان فاسقانند."
          ],
          "fa.ayati": [
            "از آن كسان مباشيد كه خدا را فراموش كردند و خدا نيز چنان كرد تا خود را فراموش كنند. ايشان نافرمانند."
          ],
          "fa.bahrampour": [
            "و مانند كسانى نباشيد كه خدا را فراموش كردند پس خدا هم خودشان را از يادشان برد. آنان همان فاسقانند"
          ],
          "fa.fooladvand": [
            "و چون كسانى مباشيد كه خدا را فراموش كردند و او [نيز] آنان را دچار خودفراموشى كرد؛ آنان همان نافرمانانند."
          ],
          "fa.ghomshei": [
            "و مانند آنان نباشید که به کلی خدا را فراموش کردند، خدا هم (حظّ روحانی و بهره ابدی) نفوس آنها را از یادشان برد، آنان به حقیقت بدکاران عالمند."
          ],
          "fa.khorramdel": [
            "و همسان کسانی نباشید که خدا را از یاد بردند، و خدا هم خودشان را از یاد خودشان برد! آنان بیرون روندگان (از حدود شرائع الهی) و خارج شوندگان (از دائره‌ی ایمان) هستند. [[«نَسُوا اللهَ»: خدا را فراموش کردند و طاعت و عبادت را از یاد بردند. «فَأَنسَاهُمْ أَنفُسَهُمْ»: در نتیجه خدا هم ایشان را از یاد خودشان برد. یعنی خدا فراموشی، منتهی به خود فراموشی می‌گردد. چرا که افراد بی‌دین، در خوشیها به ناز نعمت و قدرت مبتلا می‌شوند و متکبر می‌گردند، و در ناخوشیها، به سردرگمی و ناسپاسی دچار می‌آیند، و در هر دو صورت، هدف آفرینش خود، یا به عبارت دیگر هویت و انسانیت خویش را فراموش می‌کنند، و همه تلاششان خور و خواب و لذت و شهوت می‌گردد، و مبدأ و معاد و عبودیت و الوهیت، در نظرشان واژه‌های نامفهومی می‌شوند، و از این خواب سنگین غفلت تا نمیرند بیدار نمی‌شوند.]]"
          ],
          "fa.khorramshahi": [
            "و همانند کسانی که خداوند را فراموش کردند، مباشید که خداوند هم [تیمار] خودشان را از یادشان برد، اینانند که نافرمانند"
          ],
          "fa.makarem": [
            "و همچون کسانی نباشید که خدا را فراموش کردند و خدا نیز آنها را به «خود فراموشی» گرفتار کرد، آنها فاسقانند."
          ],
          "fa.moezzi": [
            "و نباشید مانند آنان که فراموش کردند خدا را پس فراموششان ساخت خویشتن را ایشانند نافرمانان‌"
          ],
          "fa.mojtabavi": [
            "و مانند كسانى مباشيد كه خداى را فراموش كردند و خدا خودشان- يعنى تدبير حال خويشتن- را فراموششان ساخت. اينانند بدكاران نافرمان."
          ],
          "fa.sadeqi": [
            "و همانند کسانی مباشید که خدا را فراموش کردند، پس خدا نیز آنان را از یاد خودهاشان ببرد (و) آنان همان نافرمانانند."
          ]
        }
      },
      {
        "index": 5146,
        "local_index": 20,
        "part_type": "Verse",
        "path": "/books/quran:59:20",
        "text": [
          "لاَ يَسْتَوِي‌ أَصْحَابُ‌ النَّارِ وَ أَصْحَابُ‌ الْجَنَّةِ أَصْحَابُ‌ الْجَنَّةِ هُمُ‌ الْفَائِزُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Alike are not the inmates of Hell and the residents of Paradise. The men of Paradise will be felicitous."
          ],
          "en.ahmedraza": [
            "The People of hell and the People of Paradise are not equal; it is only the People of Paradise who have succeeded."
          ],
          "en.arberry": [
            "Not equal are the inhabitants of the Fire and the inhabitants of Paradise. The inhabitants of Paradise -- they are the triumphant."
          ],
          "en.daryabadi": [
            "Not equal are the fellows of the Fire and the fellows of the Garden. Fellows of the Garden! they are the achievers!"
          ],
          "en.hilali": [
            "Not equal are the dwellers of the Fire and the dwellers of the Paradise. It is the dwellers of Paradise that will be successful."
          ],
          "en.itani": [
            "Not equal are the inhabitants of the Fire and the inhabitants of Paradise. It is the inhabitants of Paradise who are the winners."
          ],
          "en.maududi": [
            "Those destined for the Fire and those destined for Paradise cannot be alike. Verily it is those destined for Paradise who shall triumph."
          ],
          "en.mubarakpuri": [
            "Not equal are the dwellers of the Fire and the dwellers of the Paradise. It is the dwellers of Paradise that will be successful."
          ],
          "en.pickthall": [
            "Not equal are the owners of the Fire and the owners of the Garden. The owners of the Garden, they are the victorious."
          ],
          "en.qarai": [
            "Not equal are the inmates of the Fire and the inhabitants of paradise. It is the inhabitants of paradise who are the successful ones."
          ],
          "en.qaribullah": [
            "The inhabitants of the Fire and the inhabitants of Paradise are not equal. The inhabitants of Paradise shall be triumphant."
          ],
          "en.sahih": [
            "Not equal are the companions of the Fire and the companions of Paradise. The companions of Paradise - they are the attainers [of success]."
          ],
          "en.sarwar": [
            "The Companions of the Fire and the Companions of the Garden are not equal. The Companions of the Garden will achieve felicity."
          ],
          "en.shakir": [
            "Not alike are the inmates of the fire and the dwellers of the garden: the dwellers of the garden are they that are the achievers."
          ],
          "en.transliteration": [
            "L<u>a</u> yastawee a<u>s</u><u>ha</u>bu a<b>l</b>nn<u>a</u>ri waa<u>s</u><u>ha</u>bu aljannati a<u>s</u><u>ha</u>bu aljannati humu alf<u>a</u>izoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "The people of the Fire and the people of Paradise are not equal. The people of Paradise are the victorious ones."
          ],
          "en.yusufali": [
            "Not equal are the Companions of the Fire and the Companions of the Garden: it is the Companions of the Garden, that will achieve Felicity."
          ],
          "fa.ansarian": [
            "دوزخیان و بهشتیان یکسان نیستند، بهشتیان همان رستگارانند."
          ],
          "fa.ayati": [
            "اهل آتش و اهل بهشت با هم برابر نيستند. اهل بهشت خود كاميافتگانند."
          ],
          "fa.bahrampour": [
            "دوزخيان با بهشتيان يكسان نيستند، بهشتيانند كه كاميابند"
          ],
          "fa.fooladvand": [
            "دوزخيان با بهشتيان يكسان نيستند؛ بهشتيانند كه كاميابانند."
          ],
          "fa.ghomshei": [
            "هرگز اهل جهنم و اهل بهشت با هم یکسان نیستند، اهل بهشت به حقیقت سعادتمندان عالمند."
          ],
          "fa.khorramdel": [
            "بهشتیان و دوزخیان یکسان و برابر نیستند. بهشتیان (به همه‌ی آرزوهای خود رسیده‌اند و) رستگار و پیروزند. [[«هُمُ الْفَآئِزُونَ»: (نگا: توبه / 20، مؤمنون / 111، نور / 52)]]"
          ],
          "fa.khorramshahi": [
            "دوزخیان و بهشتیان برابر نیستند، بهشتیانند که رستگارند"
          ],
          "fa.makarem": [
            "هرگز دوزخیان و بهشتیان یکسان نیستند؛ اصحاب بهشت رستگار و پیروزند!"
          ],
          "fa.moezzi": [
            "یکسان نیستند یاران آتش و یاران بهشت یاران بهشتند رستگاران‌"
          ],
          "fa.mojtabavi": [
            "دوزخيان و بهشتيان برابر نيستند بهشتيان همان رستگارانند."
          ],
          "fa.sadeqi": [
            "دوزخیان با بهشتیان یکسان نیستند. بهشتیان همان کامیابانند."
          ]
        }
      },
      {
        "index": 5147,
        "local_index": 21,
        "part_type": "Verse",
        "path": "/books/quran:59:21",
        "text": [
          "لَوْ أَنْزَلْنَا هٰذَا الْقُرْآنَ‌ عَلَى‌ جَبَلٍ‌ لَرَأَيْتَهُ‌ خَاشِعاً مُتَصَدِّعاً مِنْ‌ خَشْيَةِ اللَّهِ‌ وَ تِلْکَ‌ الْأَمْثَالُ‌ نَضْرِبُهَا لِلنَّاسِ‌ لَعَلَّهُمْ‌ يَتَفَکَّرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "If We had sent down this Qur'an to a mountain you would have seen it turn desolate and split into two for fear of God. We offer these examples to men that they may think and reflect."
          ],
          "en.ahmedraza": [
            "Had We sent down this Qur’an upon a mountain, you would have then surely seen it bowed down, blown to bits by the fear of Allah; and We illustrate such examples for people, for them to ponder."
          ],
          "en.arberry": [
            "If We had sent down this Koran upon a mountain, thou wouldst have seen it humbled, split asunder out of the fear of God. And those similitudes -- We strike them for men; haply they will reflect."
          ],
          "en.daryabadi": [
            "Had We sent down this Qur'an upon a mountain, thou wouldst surely have seen it humbling itself and cleaving in sunder for fear of Allah. Such similitudes We propound Unto mankind that haply they may reflect."
          ],
          "en.hilali": [
            "Had We sent down this Quran on a mountain, you would surely have seen it humbling itself and rending asunder by the fear of Allah. Such are the parables which We put forward to mankind that they may reflect."
          ],
          "en.itani": [
            "Had We sent this Quran down on a mountain, you would have seen it trembling, crumbling in awe of God. These parables We cite for the people, so that they may reflect."
          ],
          "en.maududi": [
            "Had We sent down this Qur'an upon a mountain you would indeed have seen it humbling itself and breaking asunder out of fear of Allah. We propound such parables to people that they may reflect."
          ],
          "en.mubarakpuri": [
            "Had We sent down this Qur'an on a mountain, you would surely have seen it humbling itself and rent asunder by the fear of Allah. Such are the parables which We put forward to mankind that they may reflect."
          ],
          "en.pickthall": [
            "If We had caused this Qur'an to descend upon a mountain, thou (O Muhammad) verily hadst seen it humbled, rent asunder by the fear of Allah. Such similitudes coin We for mankind that haply they may reflect."
          ],
          "en.qarai": [
            "Had We sent down this Quran upon a mountain, you would have seen it humbled [and] go to pieces with the fear of Allah. We draw such comparisons for mankind, so that they may reflect."
          ],
          "en.qaribullah": [
            "Had We sent down this Koran upon a mountain, you would have seen it humble itself and split asunder for fear of Allah. Such are the parables we strike for people so that they will reflect."
          ],
          "en.sahih": [
            "If We had sent down this Qur'an upon a mountain, you would have seen it humbled and coming apart from fear of Allah. And these examples We present to the people that perhaps they will give thought."
          ],
          "en.sarwar": [
            "The people of Paradise and hell are not alike; the people of Paradise are the successful ones. Had We sent down this Quran on a mountain, you would have seen it humbled and rent asunder for fear of God. These are parables which We tell to people so that perhaps they will think."
          ],
          "en.shakir": [
            "Had We sent down this Quran on a mountain, you would certainly have seen it falling down, splitting asunder because of the fear of Allah, and We set forth these parables to men that they may reflect."
          ],
          "en.transliteration": [
            "Law anzaln<u>a</u> h<u>atha</u> alqur<u>a</u>na AAal<u>a</u> jabalin laraaytahu kh<u>a</u>shiAAan muta<u>s</u>addiAAan min khashyati All<u>a</u>hi watilka alamth<u>a</u>lu na<u>d</u>ribuh<u>a</u> li<b>l</b>nn<u>a</u>si laAAallahum yatafakkaroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Had We sent down this Quran on a mountain, you would certainly have seen it falling down and splitting asunder, because of the fear of God. We set forth these parables to men so that they may reflect."
          ],
          "en.yusufali": [
            "Had We sent down this Qur'an on a mountain, verily, thou wouldst have seen it humble itself and cleave asunder for fear of Allah. Such are the similitudes which We propound to men, that they may reflect."
          ],
          "fa.ansarian": [
            "اگر این قرآن را بر کوهی نازل می کردیم، قطعاً آن را از ترس خدا فروتن و از هم پاشیده می دیدی. و این مثل ها را برای مردم می زنیم تا بیندیشند."
          ],
          "fa.ayati": [
            "اگر اين قرآن را بر كوه نازل مى‌كرديم، از خوف خدا آن را ترسيده و شكاف خورده مى‌ديدى. و اين مثالهايى است كه براى مردم مى‌آوريم، شايد به فكر فرو روند."
          ],
          "fa.bahrampour": [
            "اگر اين قرآن را بر كوهى نازل مى‌كرديم، بى‌شك آن را از بيم خدا خاكسار و متلاشى مى‌ديدى، و اين مثل‌ها را براى مردم مى‌زنيم، باشد كه آنها فكر كنند"
          ],
          "fa.fooladvand": [
            "اگر اين قرآن را بر كوهى فرومى‌فرستاديم، يقيناً آن [كوه‌] را از بيم خدا فروتن [و] از هم‌پاشيده مى‌ديدى. و اين مَثَلها را براى مردم مى‌زنيم، باشد كه آنان بينديشند."
          ],
          "fa.ghomshei": [
            "اگر ما این قرآن (عظیم الشأن) را (به جای دلهای خلق) بر کوه نازل می‌کردیم مشاهده می‌کردی که کوه از ترس و عظمت خدا خاشع و ذلیل و متلاشی می‌گشت. و این امثال را برای مردم بیان می‌کنیم باشد که اهل (عقل و) فکرت شوند."
          ],
          "fa.khorramdel": [
            "اگر ما این قرآن را برای کوهی فرو می‌فرستادیم، کوه را از ترس خدا، کرنش‌کنان و شکافته می‌دیدی! ما این مثالها را برای مردمان بیان می‌داریم، شاید که ایشان بیندیشند (و با دید بینا و بینش آگاه به آیات قرآنی بنگرند و دل سنگین خود را با برق قرآن منفجر و آن را به تکان و لرزه آورند). [[«لَوْ أَنزَلْنَا ...»: این آیه اشاره دارد به این حقیقت که نفوذ قرآن به قدری عمیق است که اگر بر کوهها نازل می‌شد آنها را با همه صلابت و استحکامی که دارند تکان می‌داد و متلاشی می‌کرد، اما عجب از انسانهای سنگدلی است که آیات آن را می‌شنوند و تکان نمی‌خورند و کمترین تغییری نمی‌کنند (نگا: بقره / 74). «مُتَصَدِّعاً»: شکافته. «تِلْکَ الأمْثَالُ»: (نگا: بقره / 261 و 264 و 265، رعد / 17، حج / 73).]]"
          ],
          "fa.khorramshahi": [
            "اگر این قرآن را بر کوهی فرو فرستاده بودیم، بی‌شک آن را از ترس خداوند خاکسار و فرو پاشیده می‌دیدی، و اینها مثلهایی است که برای مردم می‌زنیم باشد که اندیشه کنند"
          ],
          "fa.makarem": [
            "اگر این قرآن را بر کوهی نازل می‌کردیم، می‌دیدی که در برابر آن خاشع می‌شود و از خوف خدا می‌شکافد! اینها مثالهایی است که برای مردم می‌زنیم، شاید در آن بیندیشید!"
          ],
          "fa.moezzi": [
            "اگر می‌فرستادیم این قرآن را بر کوهی هر آینه می‌دیدیش سرافکنده از هم پاشیده از ترس خدا و این مثَلها را همی‌زنیم برای مردم شاید اندیشه کنند"
          ],
          "fa.mojtabavi": [
            "اگر اين قرآن را بر كوهى فرو مى‌فرستاديم هر آينه آن را از بيم خدا ترسان و شكافته مى‌ديدى. و اين مثَلها را براى مردم مى‌آوريم شايد بينديشند."
          ],
          "fa.sadeqi": [
            "اگر این قرآن را بر کوهی فرو می‌فرستادیم، همواره آن کوه را از بیم خدا فروتن (و) از هم پاشیده می‌دیدی. و این مَثَلها را برای مردمان می‌زنیم، شاید آنان بیندیشند."
          ]
        }
      },
      {
        "index": 5148,
        "local_index": 22,
        "part_type": "Verse",
        "path": "/books/quran:59:22",
        "text": [
          "هُوَ اللَّهُ‌ الَّذِي‌ لاَ إِلٰهَ‌ إِلاَّ هُوَ عَالِمُ‌ الْغَيْبِ‌ وَ الشَّهَادَةِ هُوَ الرَّحْمٰنُ‌ الرَّحِيمُ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "He is God; there is no god but He, the knower of the unknown and the known. He is the benevolent, ever-merciful."
          ],
          "en.ahmedraza": [
            "It is Allah, except Whom there is no God; the Knowing of all – the hidden and the evident; He only is the Most Gracious, the Most Merciful."
          ],
          "en.arberry": [
            "He is God; there is no god but He. He is the knower of the Unseen and the Visible; He is the All-merciful, the All-compassionate."
          ],
          "en.daryabadi": [
            "He is Allah, there is no God but He; Knower of the unseen and the seen. He is the Compassionate, the Merciful."
          ],
          "en.hilali": [
            "He is Allah, than Whom there is La ilaha illa Huwa (none has the right to be worshipped but He) the All-Knower of the unseen and the seen (open). He is the Most Beneficent, the Most Merciful."
          ],
          "en.itani": [
            "He is God. There is no god but He, the Knower of secrets and declarations. He is the Compassionate, the Merciful."
          ],
          "en.maududi": [
            "He is Allah: there is no god but He; the Knower of the unseen and the manifest, He is the Most Merciful, the Most Compassionate."
          ],
          "en.mubarakpuri": [
            "He is Allah, beside Whom La ilaha illa Huwa, the All-Knower of the unseen and the seen. He is the Most Gracious, the Most Merciful."
          ],
          "en.pickthall": [
            "He is Allah, than Whom there is no other Allah, the Knower of the Invisible and the Visible. He is the Beneficent, Merciful."
          ],
          "en.qarai": [
            "He is Allah—there is no god except Him—Knower of the sensible and the Unseen, He is the All-beneficent, the All-merciful."
          ],
          "en.qaribullah": [
            "He is Allah, there is no god except He. He knows the Unseen and the Visible. He is the Merciful, the Most Merciful."
          ],
          "en.sahih": [
            "He is Allah, other than whom there is no deity, Knower of the unseen and the witnessed. He is the Entirely Merciful, the Especially Merciful."
          ],
          "en.sarwar": [
            "He is God, the only Lord, Who knows the unseen and the seen. He is the Beneficent and All-merciful One."
          ],
          "en.shakir": [
            "He is Allah besides Whom there is no god; the Knower of the unseen and the seen; He is the Beneficent, the Merciful"
          ],
          "en.transliteration": [
            "Huwa All<u>a</u>hu alla<u>th</u>ee l<u>a</u> il<u>a</u>ha ill<u>a</u> huwa AA<u>a</u>limu alghaybi wa<b>al</b>shshah<u>a</u>dati huwa a<b>l</b>rra<u>h</u>m<u>a</u>nu a<b>l</b>rra<u>h</u>eem<b>u</b>"
          ],
          "en.wahiduddin": [
            "He is God: there is no deity save Him. He knows the unseen and the visible. He is the Compassionate, the Merciful."
          ],
          "en.yusufali": [
            "Allah is He, than Whom there is no other god;- Who knows (all things) both secret and open; He, Most Gracious, Most Merciful."
          ],
          "fa.ansarian": [
            "اوست خدایی که جز او هیچ معبودی نیست، دانای نهان و آشکار است، او رحمان و رحیم است."
          ],
          "fa.ayati": [
            "اوست خدايى يگانه. هيچ خدايى جز او نيست. داناى نهان و آشكار و بخشاينده و مهربان است."
          ],
          "fa.bahrampour": [
            "او خدايى است كه غير از او معبودى نيست، داننده‌ى نهان و آشكار است، اوست هستى بخش مهربان"
          ],
          "fa.fooladvand": [
            "اوست خدايى كه غير از او معبودى نيست، داننده غيب و آشكار است، اوست رحمتگر مهربان."
          ],
          "fa.ghomshei": [
            "اوست خدای یکتایی که غیر او خدایی نیست که دانای نهان و آشکار عالم است، اوست بخشنده و مهربان."
          ],
          "fa.khorramdel": [
            "خدا کسی است که جز او پروردگار و معبودی نیست. آگاه از جهان نهان و آشکار است (و ناپیدا و پیدا در برابر دانشش یکسان است). او دارای مرحمت عامّه (در این جهان، در حق همگان)، و دارای مرحمت خاصّه (در آن جهان، نسبت به مؤمنان) است. [[«عَالِمُ الْغَیْبِ وَالشَّهَادَةِ»: آگاه از دنیای پنهان از دیدگان و خرد انسان، و مطلع از جهان عیان برای بینش و دانش مردمان است. «الرَّحْمَنُ الرَّحِیمُ»: (نگا: فاتحه / 1).]]"
          ],
          "fa.khorramshahi": [
            "او خداوندی است که خدایی جز او نیست، دانای پنهان و پیدا، اوست خدای رحمان مهربان‌"
          ],
          "fa.makarem": [
            "او خدایی است که معبودی جز او نیست، دانای آشکار و نهان است، و او رحمان و رحیم است!"
          ],
          "fa.moezzi": [
            "او است خدائی که نیست خدائی جز او دانای نهان و هویدا او است بخشنده مهربان‌"
          ],
          "fa.mojtabavi": [
            "اوست خداى يكتا كه جز او خدايى نيست داناى نهان و آشكارا اوست بخشاينده و مهربان."
          ],
          "fa.sadeqi": [
            "او خدایی است که جز او معبودی نیست؛ داننده‌ی پنهان و آشکار است؛ اوست رحمتگر بر آفریدگان‌، رحمتگر بر ویژگان."
          ]
        }
      },
      {
        "index": 5149,
        "local_index": 23,
        "part_type": "Verse",
        "path": "/books/quran:59:23",
        "text": [
          "هُوَ اللَّهُ‌ الَّذِي‌ لاَ إِلٰهَ‌ إِلاَّ هُوَ الْمَلِکُ‌ الْقُدُّوسُ‌ السَّلاَمُ‌ الْمُؤْمِنُ‌ الْمُهَيْمِنُ‌ الْعَزِيزُ الْجَبَّارُ الْمُتَکَبِّرُ سُبْحَانَ‌ اللَّهِ‌ عَمَّا يُشْرِکُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "He is God; there is no god but He, the King, the Holy, the Preserver, Protector, Guardian, the Strong, the Powerful, Omnipotent. Far too exalted is God for what they associate with Him."
          ],
          "en.ahmedraza": [
            "It is Allah, except Whom there is no God; the King, the Pure, the Giver of Peace, the Bestower of Safety, the Protector, the Most Honourable, the Compeller, the Proud; Purity is to Allah from all what they ascribe as partners (to Him)!"
          ],
          "en.arberry": [
            "He is God; there is no god but He. He is the King, the All-holy, the All-peaceable, the All-faithful, the All-preserver, the All-mighty, the All-compeller, the All-sublime. Glory be to God, above that they associate!"
          ],
          "en.daryabadi": [
            "He is Allah, there is no God but He, the Sovereign, the Holy, the Author of Safety, the Giver of Peace, the Protector, the Mighty, the Mender, the Majestic. Hallowed be Allah from all that they associate!"
          ],
          "en.hilali": [
            "He is Allah than Whom there is La ilaha illa Huwa (none has the right to be worshipped but He) the King, the Holy, the One Free from all defects, the Giver of security, the Watcher over His creatures, the All-Mighty, the Compeller, the Supreme. Glory be to Allah! (High is He) above all that they associate as partners with Him."
          ],
          "en.itani": [
            "He is God; besides Whom there is no god; the Sovereign, the Holy, the Peace-Giver, the Faith-Giver, the Overseer, the Almighty, the Omnipotent, the Overwhelming. Glory be to God, beyond what they associate."
          ],
          "en.maududi": [
            "He is Allah: there is no god but He: the King, the Holy, the All-Peace, the Giver of security, the Overseer, the Most Mighty, the Overpowering, the All-Great. Exalted be He from whatever they associate with Him."
          ],
          "en.mubarakpuri": [
            "He is Allah, beside Whom La ilaha illa Huwa, Al-Malik, Al-Quddus, As-Salam, Al-Mu`min, Al-Muhaymin, Al-`Aziz, Al-Jabbar, Al-Mutakabbir. Glory be to Allah! Above all that they associate as partners with Him."
          ],
          "en.pickthall": [
            "He is Allah, than Whom there is no other Allah, the Sovereign Lord, the Holy One, Peace, the Keeper of Faith, the Guardian, the Majestic, the Compeller, the Superb. Glorified be Allah from all that they ascribe as partner (unto Him)."
          ],
          "en.qarai": [
            "He is Allah—there is no god except Him—the Sovereign, the All-holy, the All-benign, the Securer, the All-conserver, the All-mighty, the All-compeller, and the All-magnanimous. Clear is Allah of any partners that they may ascribe [to Him]!"
          ],
          "en.qaribullah": [
            "He is Allah, there is no god except He. He is the King, the Pure, the Peace, the Confirmer, the Watchful, the Almighty, the Compeller, the Sublime. Exalted is Allah, above all that they associate!"
          ],
          "en.sahih": [
            "He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him."
          ],
          "en.sarwar": [
            "He is the only Lord, the King, the Holy, the Peace, the Forgiver, the Watchful Guardian, the Majestic, the Dominant, and the Exalted. God is too exalted to have any partner."
          ],
          "en.shakir": [
            "He is Allah, besides Whom there is no god; the King, the Holy, the Giver of peace, the Granter of security, Guardian over all, the Mighty, the Supreme, the Possessor of every greatness Glory be to Allah from what they set up (with Him)."
          ],
          "en.transliteration": [
            "Huwa All<u>a</u>hu alla<u>th</u>ee l<u>a</u> il<u>a</u>ha ill<u>a</u> huwa almaliku alquddoosu a<b>l</b>ssal<u>a</u>mu almuminu almuhayminu alAAazeezu aljabb<u>a</u>ru almutakabbiru sub<u>ha</u>na All<u>a</u>hi AAamm<u>a</u> yushrikoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "He is God, there is no deity save Him, the Sovereign, the Most Pure, the Source of Peace, the Granter of Security, the Protector, the Mighty, the Subduer, the Supreme, Glory be to God, who is far above what they associate with Him."
          ],
          "en.yusufali": [
            "Allah is He, than Whom there is no other god;- the Sovereign, the Holy One, the Source of Peace (and Perfection), the Guardian of Faith, the Preserver of Safety, the Exalted in Might, the Irresistible, the Supreme: Glory to Allah! (High is He) above the partners they attribute to Him."
          ],
          "fa.ansarian": [
            "اوست خدایی که جز او هیچ معبودی نیست، همان فرمانروای پاک، سالم از هر عیب و نقص، ایمنی بخش، چیره و مسلط، شکست ناپذیر، جبران کننده، شایسته بزرگی و عظمت است. خدا از آنچه شریک او قرار می دهند، منزّه است."
          ],
          "fa.ayati": [
            "اوست خداى يگانه كه هيچ خداى ديگرى جز او نيست، فرمانروا است، پاك است، عارى از هر عيب است، ايمنى‌بخش است، نگهبان است، پيروزمند است، باجبروت است و بزرگوار است. و از هر چه براى او شريك قرار مى‌دهند منزه است."
          ],
          "fa.bahrampour": [
            "او خدايى است كه جز او معبودى نيست، فرمانرواست، پاك است، عارى از هر نقصى است، ايمنى بخش است، نگاهبان، شكست ناپذير، قدرت مدار و با كبرياست. خداوند از هر چه شريك او كنند منزه است"
          ],
          "fa.fooladvand": [
            "اوست خدايى كه جز او معبودى نيست، همان فرمانرواى پاك سلامت‌[بخش، و] مؤمن [به حقيقت حقه خود كه‌] نگهبان، عزيز، جبّار [و] متكبّر [است‌]. پاك است خدا از آنچه [با او] شريك مى‌گردانند."
          ],
          "fa.ghomshei": [
            "اوست خدای یکتایی که غیر او خدایی نیست، سلطان مقتدر عالم، پاک از هر نقص و آلایش، منزّه از هر عیب و ناشایست، ایمنی بخش دلهای هراسان، نگهبان جهان و جهانیان، غالب و قاهر بر همه خلقان، با جبروت و عظمت، بزرگوار و برتر (از حدّ فکرت)، زهی منزّه و پاک خدای یکتا که از هر چه بر او شریک پندارند منزّه و (از آنچه در وهم و خیال و عقل اندیشند) مبرّ است."
          ],
          "fa.khorramdel": [
            "خدا کسی است که جز او پروردگار و معبودی نیست. او فرمانروا، منزّه، بی‌عیب و نقص، امان‌دهنده و امنیّت بخشنده، محافظ و مراقب، قدرتمند چیره، بزرگوار و شکوهمند، و والامقام و فرازمند است. خداوند دور و فرا از چیزهائی است که انباز او می‌کنند. [[«الْمَلِکُ»: فرمانفرما. فرمانروا (نگا: طه / 114، مؤمنون / 116). «الْقُدُّوسُ»: پاک و منزه. «السَّلامُ»: بی‌عیب و نقص. «الْمُؤْمِنُ»: امنیّت بخشنده. امان دهنده. «الْمُهَیْمِنُ»: محافظ و مراقب. «الْجَبَّارُ»: شکوهمند. دارای جبروت. «الْمُتَکَبِّرُ»: والامقام. فرازمند.]]"
          ],
          "fa.khorramshahi": [
            "اوست خداوندی که خدایی جز او نیست، فرمانروای قدوس سلام مؤمن مهیمن پیروزمند جبار صاحب کبریاست، پاک و برتر است خداوند از آنچه برای او شریک می‌انگارند"
          ],
          "fa.makarem": [
            "و خدایی است که معبودی جز او نیست، حاکم و مالک اصلی اوست، از هر عیب منزّه است، به کسی یتم نمی‌کند، امنیّت بخش است، مراقب همه چیز است، قدرتمندی شکست‌ناپذیر که با اراده نافذ خود هر امری را اصلاح می‌کند، و شایسته عظمت است؛ خداوند منزّه است از آنچه شریک برای او قرارمی‌دهند!"
          ],
          "fa.moezzi": [
            "او است خدائی که نیست خدائی جز او پادشاه پاک سلام امان‌دهنده نگهبان عزّتمند فرمانفرمای بزرگ‌جوی منزّه است خدا از آنچه شرک ورزند"
          ],
          "fa.mojtabavi": [
            "اوست خداى يكتا كه جز او خدايى نيست پادشاه [بسزا و راستين‌]، پاك از هر عيب- و وصفى كه در خور نباشد-، ايمنى‌بخش، نگاهبان [بر همه چيز]، تواناى بى‌همتا، بر همه چيره، در خور كبريا و بزرگى، پاك و منزه است خداى از آنچه [با او] انباز مى‌گيرند."
          ],
          "fa.sadeqi": [
            "او خدایی است که جز او معبودی نیست‌؛ همان فرمانروای دارای قداست و پاکی بسیار، امن‌دهنده‌ی پناهندگان، نگهبان (آفریدگان)، عزیز، پیونددهنده‌ی گسسته‌ها (و) متکبّر (به حقیقت کبریایی راستین). پاک است خدا از آنچه با او شریک می‌گردانند."
          ]
        }
      },
      {
        "index": 5150,
        "local_index": 24,
        "part_type": "Verse",
        "path": "/books/quran:59:24",
        "text": [
          "هُوَ اللَّهُ‌ الْخَالِقُ‌ الْبَارِئُ‌ الْمُصَوِّرُ لَهُ‌ الْأَسْمَاءُ الْحُسْنَى‌ يُسَبِّحُ‌ لَهُ‌ مَا فِي‌ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ وَ هُوَ الْعَزِيزُ الْحَکِيمُ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "He is God, the Creator, the Maker, the Fashioner. His are all the names beautiful. Whatever is in the heavens and the earth sings His praises. He is all-mighty and all-wise."
          ],
          "en.ahmedraza": [
            "It is Allah only, Who is the Creator, the Initiator, the Designer of all – His only are all the good names; all whatever is in the heavens and in the earth proclaims His Purity; and He only is the Most Honourable, the Wise."
          ],
          "en.arberry": [
            "He is God, the Creator, the Maker, the Shaper. To Him belong the Names Most Beautiful. All that is in the heavens and the earth magnifies Him; He is the All-mighty, the All-wise."
          ],
          "en.daryabadi": [
            "He is Allah, the Creator, the Maker, the Fashioner; His are the excellent names. Him halloweth whatsoever is in the heavens and the earth, and He is the Mighty, the Wise."
          ],
          "en.hilali": [
            "He is Allah, the Creator, the Inventor of all things, the Bestower of forms. To Him belong the Best Names. All that is in the heavens and the earth glorify Him. And He is the All-Mighty, the All-Wise."
          ],
          "en.itani": [
            "He is God; the Creator, the Maker, the Designer. His are the Most Beautiful Names. Whatever is in the heavens and the earth glorifies Him. He is the Majestic, the Wise."
          ],
          "en.maududi": [
            "He is Allah, the Planner, Executer and Fashioner of creation. His are the names most beautiful. Whatever is in the heavens and the earth extols His Glory. He is the Most Mighty, the Most Wise."
          ],
          "en.mubarakpuri": [
            "He is Allah, Al-Khaliq, Al-Bari, Al-Musawwir. To Him belong the Best Names. All that is in the heavens and the earth glorify Him. And He is the Almighty, the All-Wise."
          ],
          "en.pickthall": [
            "He is Allah, the Creator, the Shaper out of naught, the Fashioner. His are the most beautiful names. All that is in the heavens and the earth glorifieth Him, and He is the Mighty, the Wise."
          ],
          "en.qarai": [
            "He is Allah, the Creator, the Maker, and the Former. To Him belong the Best Names. Whatever there is in the heavens and the earth glorifies Him and He is the All-mighty, the All-wise."
          ],
          "en.qaribullah": [
            "He is Allah, the Creator, the Originator, the Shaper. To Him belong the Most Beautiful Names. All that is in the heavens and earth exalt Him. He is theAlmighty, the Wise."
          ],
          "en.sahih": [
            "He is Allah, the Creator, the Inventor, the Fashioner; to Him belong the best names. Whatever is in the heavens and earth is exalting Him. And He is the Exalted in Might, the Wise."
          ],
          "en.sarwar": [
            "He is the Creator, the Designer, the Modeler, and to Him belong all virtuous names. All that is in the heavens and the earth glorify Him. He is All-majestic and All-wise."
          ],
          "en.shakir": [
            "He is Allah the Creator, the Maker, the Fashioner; His are the most excellent names; whatever is in the heavens and the earth declares His glory; and He is the Mighty, the Wise."
          ],
          "en.transliteration": [
            "Huwa All<u>a</u>hu alkh<u>a</u>liqu alb<u>a</u>rio almu<u>s</u>awwiru lahu alasm<u>a</u>o al<u>h</u>usn<u>a</u> yusabbi<u>h</u>u lahu m<u>a</u> fee a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i wahuwa alAAazeezu al<u>h</u>akeem<b>u</b>"
          ],
          "en.wahiduddin": [
            "He is God -- the Creator, the Originator, the Giver of Form. His are the most excellent names. Everything in the heavens and earth declares His glory. He is the Mighty, the Wise One."
          ],
          "en.yusufali": [
            "He is Allah, the Creator, the Evolver, the Bestower of Forms (or Colours). To Him belong the Most Beautiful Names: whatever is in the heavens and on earth, doth declare His Praises and Glory: and He is the Exalted in Might, the Wise."
          ],
          "fa.ansarian": [
            "اوست خدا، آفریننده، نوساز، صورتگر، همه نام های نیکو ویژه اوست. آنچه در آسمان ها و زمین است همواره برای او تسبیح می گویند، و او توانای شکست ناپذیر و حکیم است."
          ],
          "fa.ayati": [
            "اوست خدايى كه آفريدگار است، موجد و صورت‌بخش است، اسمهاى نيكو از آن اوست. هر چه در آسمانها و زمين است تسبيحگوى او هستند و او پيروزمند و حكيم است."
          ],
          "fa.bahrampour": [
            "او خداى خالق هستى بخش صورتگر است كه بهترين نام‌ها و صفات از آن اوست. آنچه در آسمان‌ها و زمين است [جمله‌] تسبيح او گويند، و او شكست ناپذير حكيم است"
          ],
          "fa.fooladvand": [
            "اوست خداى خالق نوساز صورتگر [كه‌] بهترين نامها [و صفات‌] از آنِ اوست. آنچه در آسمانها و زمين است [جمله‌] تسبيح او مى‌گويند و او عزيز حكيم است."
          ],
          "fa.ghomshei": [
            "اوست خدای آفریننده عالم امکان و پدید آرنده جهان و جهانیان، نگارنده صورت خلقان، او را نامهای نیکو بسیار است، آنچه در آسمانها و زمین است همه به تسبیح و ستایش او مشغولند و اوست یکتا خدای مقتدر حکیم."
          ],
          "fa.khorramdel": [
            "او خداوندی است که طرّاح هستی و آفریدگار آن از نیستی و صورتگر جهان است. دارای نامهای نیک و زیبا است. چیزهائی که در آسمانها و زمین هستند، تسبیح و تقدیس او می‌گویند، و او چیره‌ی کار بجا است. [[«الْخَالِقُ»: اندازه‌گیرنده اشیاء در کمیت و کیفیت لازم، طرّاح هستی (نگا: مؤمنون / 14). «الْبَارِئُ»: آفریدگار جهان از نیستی. «الْمُصَوِّرُ»: صورتگر. شکل‌دهنده جهان بدینگونه که هست.]]"
          ],
          "fa.khorramshahi": [
            "اوست خداوند آفریدگار پدیدآور صورتگر، او راست نامهای نیک، آنچه در آسمانها و زمین است او را تسبیح می‌گوید، و اوست پیروزمند فرزانه‌"
          ],
          "fa.makarem": [
            "او خداوندی است خالق، آفریننده‌ای بی‌سابقه، و صورتگری (بی‌نظیر)؛ برای او نامهای نیک است؛ آنچه در آسمانها و زمین است تسبیح او می‌گویند؛ و او عزیز و حکیم است!"
          ],
          "fa.moezzi": [
            "او است خداوند آفریدگار پدیدآرنده پیکرساز او را است نامهای نکو تسبیح گویدش آنچه در آسمانها و زمین است و او است عزّتمند حکیم‌"
          ],
          "fa.mojtabavi": [
            "اوست خداى آفريدگار، هستى‌بخش، نگارنده صورتها، او راست نامهاى بهين آنچه در آسمانها و زمين است او را به پاكى مى‌ستايند، و اوست تواناى بى‌همتا و داناى با حكمت."
          ],
          "fa.sadeqi": [
            "اوست خدای خالق سازنده‌ی صورتگر (که) بهترین نام‌ها از اوست. آنچه در آسمان‌ها و زمین است (جمله) برای او تسبیح می‌گویند، و او عزیز حکیم است."
          ]
        }
      }
    ]
  },
  "index": "quran:59",
  "kind": "verse_list"
}