{"data": {"crumbs": [{"indexed_titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}, "path": "/books/quran", "titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}}, {"indexed_titles": {"en": "Chapter 60"}, "path": "/books/quran:60", "titles": {"ar": "الممتحنة", "en": "She that is to be examined", "ent": "Al-Mumtahana"}}], "index": 60, "local_index": 60, "order": 91, "part_type": "Chapter", "path": "/books/quran:60", "reveal_type": "Medinan", "rukus": 2, "titles": {"ar": "الممتحنة", "en": "She that is to be examined", "ent": "Al-Mumtahana"}, "verse_count": 13, "verse_start_index": 5150, "verses": [{"index": 5151, "local_index": 1, "part_type": "Verse", "path": "/books/quran:60:1", "text": "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا لاَ تَتَّخِذُوا عَدُوِّي‌ وَ عَدُوَّکُمْ‌ أَوْلِيَاءَ تُلْقُونَ‌ إِلَيْهِمْ‌ بِالْمَوَدَّةِ وَ قَدْ کَفَرُوا بِمَا جَاءَکُمْ‌ مِنَ‌ الْحَقِ‌ يُخْرِجُونَ‌ الرَّسُولَ‌ وَ إِيَّاکُمْ‌ أَنْ‌ تُؤْمِنُوا بِاللَّهِ‌ رَبِّکُمْ‌ إِنْ‌ کُنْتُمْ‌ خَرَجْتُمْ‌ جِهَاداً فِي‌ سَبِيلِي‌ وَ ابْتِغَاءَ مَرْضَاتِي‌ تُسِرُّونَ‌ إِلَيْهِمْ‌ بِالْمَوَدَّةِ وَ أَنَا أَعْلَمُ‌ بِمَا أَخْفَيْتُمْ‌ وَ مَا أَعْلَنْتُمْ‌ وَ مَنْ‌ يَفْعَلْهُ‌ مِنْکُمْ‌ فَقَدْ ضَلَ‌ سَوَاءَ السَّبِيلِ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای اهل ایمان! دشمنان من و دشمنان خودتان را دوستان خود مگیرید، شما با آنان اظهار دوستی می کنید، در حالی که آنان به طور یقین به آنچه از حق برای شما آمده کافرند، و پیامبر و شما را به خاطر ایمانتان به خدا که پروردگار شماست [از وطن] بیرون می کنند، [پس آنان را دوستان خود مگیرید] اگر برای جهاد در راه من و طلب خشنودیم بیرون آمده اید [چرا] مخفیانه به آنان پیام می دهید که دوستشان دارید؟ در حالی که من به آنچه پنهان می داشتید و آنچه آشکار کردید داناترم، و هر کس از شما با دشمنان من رابطه دوستی برقرار کند، مسلماً از راه راست منحرف شده است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى كسانى كه ايمان آورده‌ايد، دشمن من و دشمن خود را به دوستى اختيار مكنيد. شما با آنان طرح دوستى مى‌افكنيد و حال آنكه ايشان به سخن حقى كه بر شما آمده است ايمان ندارند. و بدان سبب كه به خدا، پروردگار خويش ايمان آورده بوديد، پيامبر و شما را بيرون راندند. اگر براى جهاد در راه من و طلب رضاى من بيرون آمده‌ايد، در نهان با آنها دوستى مكنيد؛ و من به هر چه پنهان مى‌داريد يا آشكار مى‌سازيد آگاهترم. و هر كه چنين كند، از راه راست منحرف گشته است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى كسانى كه ايمان آورده‌ايد! دشمن من و دشمن خودتان را دوست نگيريد- كه نسبت به آنها اظهار محبت كنيد در حالى كه قطعا به آن حقيقت كه براى شما آمده [يعنى قرآن‌] كافر شدند و به اين علت كه به خدا، پروردگارتان ايمان آورده‌ايد، پيامبر و شما را [از ديارتان‌] ب"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى كسانى كه ايمان آورده‌ايد، دشمن من و دشمن خودتان را به دوستى برمگيريد [به طورى‌] كه با آنها اظهار دوستى كنيد، و حال آنكه قطعاً به آن حقيقت كه براى شما آمده كافرند [و] پيامبر [خدا] و شما را [از مكه‌] بيرون مى‌كنند كه [چرا ]به خدا، پروردگارتان ايمان آورده‌ايد، اگر براى جهاد در راه من و طلب خشنودى من بيرون آمده‌ايد. [شما] پنهانى با آنان رابطه دوستى برقرار مى‌كنيد در حالى كه من به آنچه پنهان داشتيد و آنچه آشكار نموديد داناترم. و هر كس از شما چنين كند، قطعاً از راه درست منحرف گرديده است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "ای کسانی که به خدا ایمان آورده‌اید، هرگز نباید کافران را که دشمن من و شمایند یاران خود برگرفته و طرح دوستی با آنها افکنید در صورتی که آنان به کتابی که بر شما آمد یعنی قرآن حق سخت کافر شدند، رسول خدا و شما مؤمنان را به جرم ایمان به خدا از وطن خود آواره می‌کنند، پس نباید اگر شما برای جهاد در راه من و طلب رضا و خشنودی من بیرون آمده‌اید پنهانی با آنها دوستی کنید، و من به اسرار نهان و اعمال آشکار شما داناترم، و هر که از شما چنین کند سخت به راه ضلالت شتافته است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای مؤمنان! دشمنان من و دشمنان خویش را به دوستی نگیرید. شما نسبت بدیشان محبّت می‌کنید و مودّت می‌ورزید، در حالی که آنان به حق و حقیقتی ایمان ندارند که برای شما آمده است. پیغمبر و شما را به خاطر ایمان آوردن به خدا که پروردگارتان است (از شهر و دیارتان) بیرون می‌رانند. اگر شما برای جهاد در راه من و طلب خوشنودیم (هجرت کرده‌اید و از زادگاه خویشتن) بیرون آمده‌اید (با ایشان پیوند دوستی برقرار نسازید). در نهان با آنان دوستی می‌کنید، در حالی که من نسبت به هرچه پنهان می‌دارید یا آشکار می‌سازید (از همگان) مطّلع‌تر و آگاه‌تر هستم. هر کس از شما چنین کاری را بکند، از راستای راه منحرف گشته است. [[«لا تَتَّخِذُوا ...»: (نگا: آل‌عمران / 28 و 118، مائده / 57). «وَ قَدْ کَفَرُوا ...»: حرف واو حالیه است. «عَدُوّ»: این واژه برای مفرد و جمع بکار می‌رود (نگا: طه / 117، کهف / 50). «اَن تُؤْمِنُوا بِاللهِ»: بدان سبب که به خدا ایمان دارید. مفعولٌ‌له است. «إِن کُنتُمْ ...»: جواب شرط محذوف است و (لا تَتَّخِذُوا) پیشین بر آن دلالت دارد. «جِهَاداً»: مفعولٌ‌له است. «وَ أَنَا أَعْلَمُ»: حرف واو حالیه است. «سَوَآءَ السَّبِیلِ»: (نگا: بقره / 108، مائده / 12 و 60 و 77).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای مؤمنان اگر برای جهاد در راه من و طلب خشنودی من از [وطن خود] بیرون آمده‌اید، دشمن من و دشمن خودتان را دوست مگیرید، که به آنها مهربانی کنید، و حال آنکه آنان به دین حقی که برای شما آمده است، کفر و انکار ورزیده‌اند و پیامبر و شما را آواره کرده‌اند، چرا که به خداوند -پروردگارتانایمان دارید، [شمایید که‌] با آنان سر و سر دوستانه دارید و من به آنچه پنهان دارید و آنچه آشکار دارید، آگاه‌ترم، و هر کس از شما که چنین کند به راستی که از راه راست گم گشته است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای کسانی که ایمان آورده‌اید! دشمن من و دشمن خودتان را دوست نگیرید! شما نسبت به آنان اظهار محبّت می‌کنید، در حالی که آنها به آنچه از حقّ برای شما آمده کافر شده‌اند و رسول اللّه و شما را به خاطر ایمان به خداوندی که پروردگار همه شماست از شهر و دیارتان بیرون می‌رانند؛ اگر شما برای جهاد در راه من و جلب خشنودیم هجرت کرده‌اید؛ (پیوند دوستی با آنان برقرار نسازید!) شما مخفیانه با آنها رابطه دوستی برقرار می‌کنید در حالی که من به آنچه پنهان یا آشکار می‌سازید از همه داناترم! و هر کس از شما چنین کاری کند، از راه راست گمراه شده است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای آنان که ایمان آوردید نگیرید دشمن من و دشمن خویش را دوستانی که افکنید با ایشان دوستی را و آنان کفر ورزیدند بدانچه بیامد شما را از حقّ برون رانند پیمبر را با شما از آن رو که ایمان آورید به پروردگار خویش اگر هستید شما برون‌آیندگان برای جهاد در راه من و در پی خوشنودیهای من می‌نمائیدشان پنهان دوستی را و منم داناتر بدانچه نهان دارید و آنچه آشکار سازید و آنکو بکند این را از شما همانا گم کرده است راه راست را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى كسانى كه ايمان آورده‌ايد، دشمنان من و دشمنان خود را دوست مگيريد اگر [از خانمان و وطن خويش‌] براى جهاد در راه من و جستن خشنودى من بيرون آمده‌ايد با آنها طرح دوستى مى‌افكنيد و حال آنكه آنان به سخن راستى كه به شما آمده است- يعنى قرآن- كافر شدند، پيامبر و شما را از آن رو كه به خداى، پروردگارتان، ايمان آورده‌ايد بيرون مى‌كنند به پنهانى با آنان دوستى مى‌كنيد و حال آنكه من به آنچه پنهان مى‌داريد و آنچه آشكار مى‌كنيد داناترم. و از شما هر كه چنين كند همانا راه راست را گم كرده است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای کسانی که ایمان آوردید! دشمن من و دشمن خودتان را اولیا(ی خود) مگیرید، در حالی‌که (خودتان و دیگران را) فراسوی‌شان (با اَسراری از مسلمانان) با مودت می‌افکنید، حال آنکه بی‌گمان به آن حقیقت که برایتان آمده کافرند؛ در حالی که پیامبر (خدا) و شما را (از مکّه) بیرون می‌کنند، (چرا) که به خدا - پروردگارتان - ایمان می‌آورید. اگر برای جهاد در راه راهوار من و طلب خشنودی‌ام برون آمده‌اید (شما) پنهانی با آنان رابطه‌ی دوستی برقرار می‌کنید، حال آنکه من به آنچه پنهان داشتید و آنچه آشکار نمودید داناترم و هر که از شما چنین کند، همواره راه راست را گم کرده است."}, {"lang": "en", "name": "Ahmed Ali", "text": "O YOU WHO BELIEVE, do not take My enemies and your enemies as friends. You show kindness to them, but they reject the true way that has come to you. They expelled the Prophet and you, for you believe in God your Lord. If you have come out to struggle in My cause having sought My acceptance, (do not be) friendly with them in secret. I know what you hide and what you disclose. Whoever of you does this will have gone astray from the right path."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O People who Believe! Do not befriend My and your enemy – you reveal secrets to them out of friendship whereas they disbelieve in the truth which has come to you! It is they who remove the Noble Messenger and you from your homes, upon your believing in Allah, your Lord; if you have come out to fight for My cause, and to gain My pleasure, then do not befriend them; you send them secret messages of friendship – and I well know all what you hide and all what you disclose; and whoever among you does it, has indeed strayed away from the right path."}, {"lang": "en", "name": "A. J. Arberry", "text": "O believers, take not My enemy and your enemy for friends, offering them love, though they have disbelieved in the truth that has come to you, expelling the Messenger and you because you believe in God your Lord. If you go forth to struggle in My way and seek My good pleasure, secretly loving them, yet I know very well what you conceal and what you publish; and whosoever of you does that, has gone astray from the right way."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "O ye who believe! take not Mine enemy and your enemy for friends, showing affection toward them, whilst they of a surety disbelieve in that which hath come Unto you of the truth, and have driven forth the apostle and yourselves because ye believe in Allah, your Lord, if ye have come forth to strive in My way and to seek My goodwill. Ye secretly show them affection, while I am best Knower of that which ye conceal and that which ya make known! And whosoever of you doth this, he hath surely strayed from the straight path."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O you who believe! Take not My enemies and your enemies (i.e. disbelievers and polytheists, etc.) as friends, showing affection towards them, while they have disbelieved in what has come to you of the truth (i.e. Islamic Monotheism, this Quran, and Muhammad SAW), and have driven out the Messenger (Muhammad SAW) and yourselves (from your homeland) because you believe in Allah your Lord! If you have come forth to strive in My Cause and to seek My Good Pleasure, (then take not these disbelievers and polytheists, etc., as your friends). You show friendship to them in secret, while I am All-Aware of what you conceal and what you reveal. And whosoever of you (Muslims) does that, then indeed he has gone (far) astray, (away) from the Straight Path."}, {"lang": "en", "name": "Talal Itani", "text": "O you who believe! Do not take My enemies and your enemies for supporters, offering them affection, when they have disbelieved in what has come to you of the Truth. They have expelled the Messenger, and you, because you believed in God, your Lord. If you have mobilized to strive for My cause, seeking My approval, how can you secretly love them? I know what you conceal and what you reveal. Whoever among you does that has strayed from the right way."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Believers, if you have left (your homes and) have come forth to struggle in My Way and to seek My good pleasure, do not make friends with My enemies and your enemies. You befriend them whereas they have spurned the Truth that has come to you; and (such is their enmity that) they expel the Messenger and yourselves for no other reason than that you believe in Allah, your Lord. You send to them messages of friendship in secrecy, although I know well whatever you do, be it secretly or publicly. And whosoever of you does so has indeed strayed far away from the Straight Path."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O you who believe! Take not My enemies and your enemies as protecting friends, showing affection towards them, while they have disbelieved in what has come to you of the truth, and have driven out the Messenger and yourselves because you believe in Allah, your Lord! If you have come forth to strive in My cause and to seek My good pleasure. You show friendship to them in secret, while I am All-Aware of what you conceal and what you reveal. And whosoever of you (Muslims) does that, then indeed he has gone (far) astray from the straight path."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O ye who believe! Choose not My enemy and your enemy for allies. Do ye give them friendship when they disbelieve in that truth which hath come unto you, driving out the messenger and you because ye believe in Allah, your Lord? If ye have come forth to strive in My way and seeking My good pleasure, (show them not friendship). Do ye show friendship unto them in secret, when I am Best Aware of what ye hide and what ye proclaim? And whosoever doeth it among you, he verily hath strayed from the right way."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O you who have faith! Do not take My enemy and your enemy for friends, [secretly] offering them affection, if you have set out for jihad in My way and to seek My pleasure, for they have certainly denied whatever has come to you of the truth, expelling the Apostle and you, because you have faith in Allah, your Lord. You secretly nourish affection for them, while I know well whatever you hide and whatever you disclose, and whoever among you does that has certainly strayed from the right way."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believers, do not take My enemy and your enemy for your guides, offering them love when they have disbelieved the truth that has come to you, who expelthe Messenger and yourselves because you believe in Allah, your Lord! If you go out to struggle in My way seeking My pleasure, but secretly love them, I know well what you conceal and what you reveal; whosoever of you does this will have gone astray from the Right Path."}, {"lang": "en", "name": "Saheeh International", "text": "O you who have believed, do not take My enemies and your enemies as allies, extending to them affection while they have disbelieved in what came to you of the truth, having driven out the Prophet and yourselves [only] because you believe in Allah, your Lord. If you have come out for jihad in My cause and seeking means to My approval, [take them not as friends]. You confide to them affection, but I am most knowing of what you have concealed and what you have declared. And whoever does it among you has certainly strayed from the soundness of the way."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Believers, do not choose My enemies and your own enemies for friends, and offer them strong love. They have rejected the Truth which has come to you, and have expelled the Messenger and you from your homes because of your belief in your Lord. When you go to fight for My cause and seek My pleasure, you secretly express your love of them. I know best what you reveal or conceal. Whichever of you does this has indeed gone astray from the right path."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O you who believe! do not take My enemy and your enemy for friends: would you offer them love while they deny what has come to you of the truth, driving out the Apostle and yourselves because you believe in Allah, your Lord? If you go forth struggling hard in My path and seeking My pleasure, would you manifest love to them? And I know what you conceal and what you manifest; and whoever of you does this, he indeed has gone astray from the straight path."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo l<u>a</u> tattakhi<u>th</u>oo AAaduwwee waAAaduwwakum awliy<u>a</u>a tulqoona ilayhim bi<b>a</b>lmawaddati waqad kafaroo bim<u>a</u> j<u>a</u>akum mina al<u>h</u>aqqi yukhrijoona a<b>l</b>rrasoola waiyy<u>a</u>kum an tuminoo bi<b>A</b>ll<u>a</u>hi rabbikum in kuntum kharajtum jih<u>a</u>dan fee sabeelee wa<b>i</b>btigh<u>a</u>a mar<u>da</u>tee tusirroona ilayhim bi<b>a</b>lmawaddati waan<u>a</u> aAAlamu bim<u>a</u> akhfaytum wam<u>a</u> aAAlantum waman yafAAalhu minkum faqad <u>d</u>alla saw<u>a</u>a a<b>l</b>ssabeel<b>i</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believers! Do not offer friendship to those who are enemies of Mine and of yours. Would you show them affection when they have rejected the truth you have received; when they have driven you and the Messenger out [simply] because you believe in God, your Lord. If you have left your homes to strive for My cause and out of a desire to seek My goodwill, how can you secretly offer them friendship?  I know all that you conceal and all that you reveal. Whoever of you does this will surely stray from the right path."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O ye who believe! Take not my enemies and yours as friends (or protectors),- offering them (your) love, even though they have rejected the Truth that has come to you, and have (on the contrary) driven out the Prophet and yourselves (from your homes), (simply) because ye believe in Allah your Lord! If ye have come out to strive in My Way and to seek My Good Pleasure, (take them not as friends), holding secret converse of love (and friendship) with them: for I know full well all that ye conceal and all that ye reveal. And any of you that does this has strayed from the Straight Path."}]}, {"index": 5152, "local_index": 2, "part_type": "Verse", "path": "/books/quran:60:2", "text": "إِنْ‌ يَثْقَفُوکُمْ‌ يَکُونُوا لَکُمْ‌ أَعْدَاءً وَ يَبْسُطُوا إِلَيْکُمْ‌ أَيْدِيَهُمْ‌ وَ أَلْسِنَتَهُمْ‌ بِالسُّوءِ وَ وَدُّوا لَوْ تَکْفُرُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "اگر بر شما چیره شوند، دشمنانتان خواهند بود، و دست هایشان را [به اسارت، آزار و کشتن] و زبان هایشان را به [بدگویی، تحقیر و ناسزا] بر ضد شما می گشایند، و آرزو دارند که ای کاش شما هم کافر شوید."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اگر بر شما دست يابند، دشمنى مى‌كنند و به آزارتان دست و زبان مى‌گشايند و دوست دارند كه شما نيز كافر گرديد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اگر بر شما دست يابند، دشمن شما خواهند بود و به آزارتان دست مى‌يازند و زبانشان را به سوى شما به بدى مى‌گشايند و دوست دارند كه شما [نيز] كافر شويد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اگر بر شما دست يابند، دشمن شما باشند و بر شما به بدى دست و زبان بگشايند و آرزو دارند كه كافر شويد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "هر گاه آنها بر شما تسلط یابند باز همان دشمن دیرینند و هر چه بتوانند به دست و زبان بر عداوت شما می‌کوشند و چقدر دوست می‌دارند که شما کافر شوید."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "اگر بر شما دست یابند، دشمنان شما می‌گردند، و دست تعدّی به سویتان دراز می‌کنند، و زبان را در حق شما به بدی می‌گشایند، و آرزو می‌کنند که کاش می‌شد کافر شوید! [[«إِن یَثْقَفُوکُمْ»: اگر بر شما دست یابند. اگر بر شما ظفر یابند و چیره شوند (نگا: انفال / 57). «یَبْسُطُوا»: می‌گشایند. مراد گشودن دست تعدی و ستمگری، و دراز کردن نیش زبان برای زورگوئی و بدگوئی‌است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "اگر بر شما دست یابند دشمنان شما خواهند بود و دست و زبانشان را به بدی در حق شما می‌گشایند، و خوش دارند که شما کفر بورزید"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "اگر آنها بر شما مسلّط شوند، دشمنانتان خواهند بود و دست و زبان خود را به بدی کردن نسبت به شما می‌گشایند، و دوست دارند شما به کفر بازگردید!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "اگر دست یابند بر شما باشند برای شما دشمنانی و باز کنند بسوی شما دستهای خویش و زبانهای خویش را به بدی و دوست دارند کاش می‌شدید کافران‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اگر شما را بيابند دشمنان شما باشند و دستها و زبانهاى خود را به بدى- آزار و گزند- به سوى شما مى‌گشايند و دوست دارند كه كاش شما هم كافر شويد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "اگر بر شما با کاوش دست یابند، دشمنان شمایند. و سویتان به بدی دست‌هاشان و زبان‌هاشان را می‌گشایند و دوست دارند (که ای) کاش کافر شوید."}, {"lang": "en", "name": "Ahmed Ali", "text": "If they gain ascendancy over you, they will become your enemies, and employ their hands and tongues with evil designs, and wish that you also became disbelievers."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "If they gain dominance over you they will be your enemies, and will extend their hands and their tongues towards you with evil, and they wish that in some way you turn disbelievers."}, {"lang": "en", "name": "A. J. Arberry", "text": "If they come on you, they will be enemies to you, and stretch against you their hands and their tongues, to do you evil, and they wish that you may disbelieve."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Should they come upon you, they will be enemies Unto you and will stretch out against you their hands and their tongues with evil; and fain would they that ye should disbelieve."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Should they gain the upper hand over you, they would behave to you as enemies, and stretch forth their hands and their tongues against you with evil, and they desire that you should disbelieve."}, {"lang": "en", "name": "Talal Itani", "text": "Whenever they encounter you, they treat you as enemies, and they stretch their hands and tongues against you with malice. They wish that you would disbelieve."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "If they could overcome you, they would act as your foes and would hurt you by their hands and tongues, and would love to see you become unbelievers."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Should they gain the upper hand over you, they would behave to you as enemies, and stretch forth their hands and their tongues against you with evil, and they desire that you should disbelieve."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "If they have the upper hand of you, they will be your foes, and will stretch out their hands and their tongues toward you with evil (intent), and they long for you to disbelieve."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "If they were to confront you they would be your enemies, and would stretch out against you their hands and [unleash] their tongues with evil [intentions], and they are eager that you [too] should be faithless."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "If they come upon you, they will be your enemies, and stretch out their hands and tongues to do evil to you. They wish that you would disbelieve."}, {"lang": "en", "name": "Saheeh International", "text": "If they gain dominance over you, they would be to you as enemies and extend against you their hands and their tongues with evil, and they wish you would disbelieve."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "If they find an opportunity to turn against you, they will become your enemies and will stretch out their hands and tongues at you with evil intent. They would love to see you turn away from your faith."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "If they find you, they will be your enemies, and will stretch forth towards you their hands and their tongues with evil, and they ardently desire that you may disbelieve."}, {"lang": "en", "name": "English Transliteration", "text": "In yathqafookum yakoonoo lakam aAAd<u>a</u>an wayabsu<u>t</u>oo ilaykum aydiyahum waalsinatahum bi<b>al</b>ssooi wawaddoo law takfuroon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "If they gain ascendancy over you, they will behave towards you as enemies and stretch out their hands as well as their tongues with evil intent; they long for you to renounce your faith."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "If they were to get the better of you, they would behave to you as enemies, and stretch forth their hands and their tongues against you for evil: and they desire that ye should reject the Truth."}]}, {"index": 5153, "local_index": 3, "part_type": "Verse", "path": "/books/quran:60:3", "text": "لَنْ‌ تَنْفَعَکُمْ‌ أَرْحَامُکُمْ‌ وَ لاَ أَوْلاَدُکُمْ‌ يَوْمَ‌ الْقِيَامَةِ يَفْصِلُ‌ بَيْنَکُمْ‌ وَ اللَّهُ‌ بِمَا تَعْمَلُونَ‌ بَصِيرٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "روز قیامت [که کیفر دوستی با دشمنان داده شود] خویشان و فرزندانتان سودی به حال شما ندارند، خدا میان شما و آنان جدایی می اندازد، و خدا به آنچه انجام می دهید، بیناست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "در روز قيامت نه خويشاوندان برايتان سود كنند، نه فرزندانتان. خدا ميانتان جدايى مى‌افكند و اعمالتان را مى‌بيند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "روز قيامت نه خويشان شما و نه فرزندانتان هرگز به شما سودى نمى‌رسانند. [خدا] ميان شما جدايى مى‌اندازد و خداوند به آنچه مى‌كنيد بيناست"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "روز قيامت نه خويشان شما و نه فرزندانتان هرگز به شما سود نمى‌رسانند. [خدا] ميانتان فيصله مى‌دهد، و خدا به آنچه انجام مى‌دهيد بيناست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "هرگز روز قیامت خویشان و فرزندان شما (اگر مؤمن نباشند) هیچ سودی برایتان ندارند که در آن روز خدا میان شما به کلی جدایی می‌افکند و خدا به هر چه کنید بیناست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "هرگز خویشاوندان و فرزندانتان سودی به حالتان نخواهند داشت. روز قیامت، خدا در میانتان قضاوت و داوری خواهد کرد. خدا می‌بیند هر کاری را که خواهید کرد. [[«أَرْحَام»: جمع رَحِم، خویشی و خویشاوندی. در اینجا کنایه از خویش و خویشاوند است. یا این که مضاف (ذَوُو) پیش از آن محذوف است (نگا: روح‌المعانی). «یَفْصِلُ بَیْنَکُمْ»: در میان شما قضاوت می‌کند و به داوری خواهد نشست (نگا: حج / 17، سجده / 25). شما را از یکدیگر جدا می‌کند و هر یکی جدا از دیگری خواهید بود و خویشاوندیها و فرزندیها در میان نخواهد بود. (نگا: انعام / 94، مریم / 95، مؤمنون / 101، عبس / 34 - 37).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "خویشاوندانتان و همچنین فرزندانتان به شما سود نمی‌رسانند [و] در روز قیامت در میان شما داوری کند و خداوند به آنچه می‌کنید بیناست‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "هرگز بستگان و فرزندانتان روز قیامت سودی به حالتان نخواهند داشت؛ میان شما جدایی می‌افکند؛ و خداوند به آنچه انجام می‌دهید بیناست."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "سود ندهد شما را خویشاوندیهای شما و نه فرزندان شما روز قیامت جدائی افکند میان شما و خدا بدانچه کنید بینا است‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "خويشان و فرزندانتان- كه به خاطر آنها خدا و پيامبرش را نافرمانى مى‌كنيد- در روز رستاخيز هرگز شما را سودى ندارند، [خدا] ميان شما جدايى مى افكند، و خدا بدانچه مى‌كنيد بيناست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "نه خویشانتان و نه فرزندانتان به شما هرگز سودی نمی‌رسانند. (خدا) روز رستاخیز میانتان جدایی می‌افکند، و خدا به آنچه انجام می‌دهید بیناست."}, {"lang": "en", "name": "Ahmed Ali", "text": "Neither your blood relations nor your children will be of any avail to you on the Day of Resurrection. He will judge between you, for God sees what you do."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Neither your relations nor your offspring will in the least benefit you, on the Day of Resurrection; He will separate you from them; and Allah is seeing your deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "Neither your blood-kindred nor your children shall profit you upon the Day of Resurrection; He shall distinguish between you. And God sees the things you do."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "There will profit you neither your kindred nor your children on the Day of Resurrection. He shall decide between; and Allah is of that which ye you work Beholder."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Neither your relatives nor your children will benefit you on the Day of Resurrection (against Allah). He will judge between you. And Allah is the All-Seer of what you do."}, {"lang": "en", "name": "Talal Itani", "text": "Neither your relatives nor your children will benefit you on the Day of Resurrection. He will separate between you. God is Observant of what you do."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "On the Day of Resurrection neither your blood-kindred nor your own offspring will avail you. (On that Day) He will separate you. Allah sees all that you do."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Neither your relatives nor your children will benefit you on the Day of Resurrection. He will judge between you. And Allah is the All-Seer of what you do."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Your ties of kindred and your children will avail you naught upon the Day of Resurrection. He will part you. Allah is Seer of what ye do."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Your relatives and children will not avail you on the Day of Resurrection: He will separate you [from one another], and Allah watches what you do."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "On the Day of Resurrection neither your blood relatives nor your children shall be of benefit to you. Allah will differentiate between you, and Allah sees thethings you do."}, {"lang": "en", "name": "Saheeh International", "text": "Never will your relatives or your children benefit you; the Day of Resurrection He will judge between you. And Allah, of what you do, is Seeing."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Your relatives and children will never be of any benefit to you on the Day of Judgment. God will separate you from them. He is All-aware of what you do."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Your relationship would not profit you, nor your children on the day of resurrection; He will decide between you; and Allah sees what you do."}, {"lang": "en", "name": "English Transliteration", "text": "Lan tanfaAAakum ar<u>ha</u>mukum wal<u>a</u> awl<u>a</u>dukum yawma alqiy<u>a</u>mati yaf<u>s</u>ilu baynakum wa<b>A</b>ll<u>a</u>hu bim<u>a</u> taAAmaloona ba<u>s</u>eer<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Neither your relatives nor your children will be of any help to you on the Day of Resurrection. He will judge between you, and God sees all that you do."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Of no profit to you will be your relatives and your children on the Day of Judgment: He will judge between you: for Allah sees well all that ye do."}]}, {"index": 5154, "local_index": 4, "part_type": "Verse", "path": "/books/quran:60:4", "text": "قَدْ کَانَتْ‌ لَکُمْ‌ أُسْوَةٌ حَسَنَةٌ فِي‌ إِبْرَاهِيمَ‌ وَ الَّذِينَ‌ مَعَهُ‌ إِذْ قَالُوا لِقَوْمِهِمْ‌ إِنَّا بُرَآءُ مِنْکُمْ‌ وَ مِمَّا تَعْبُدُونَ‌ مِنْ‌ دُونِ‌ اللَّهِ‌ کَفَرْنَا بِکُمْ‌ وَ بَدَا بَيْنَنَا وَ بَيْنَکُمُ‌ الْعَدَاوَةُ وَ الْبَغْضَاءُ أَبَداً حَتَّى‌ تُؤْمِنُوا بِاللَّهِ‌ وَحْدَهُ‌ إِلاَّ قَوْلَ‌ إِبْرَاهِيمَ‌ لِأَبِيهِ‌ لَأَسْتَغْفِرَنَ‌ لَکَ‌ وَ مَا أَمْلِکُ‌ لَکَ‌ مِنَ‌ اللَّهِ‌ مِنْ‌ شَيْ‌ءٍ رَبَّنَا عَلَيْکَ‌ تَوَکَّلْنَا وَ إِلَيْکَ‌ أَنَبْنَا وَ إِلَيْکَ‌ الْمَصِيرُ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "مسلماً برای شما در ابراهیم و کسانی که با اویند سرمشقی نیکوست، آن گاه که به قوم خود گفتند: ما از شما و آنچه به جای خدا می پرستید بیزاریم، ما به شما کافریم و میان ما و شما دشمنی و کینه همیشگی پدیدار شده است، تا آن زمان که به خدای یگانه ایمان آورید. [آری، ابراهیم و مؤمنان جز اعلام بیزاری سخنی با بت پرستان نداشتند] مگر سخن ابراهیم به پدرش که گفت: من برای تو [در صورتی که دست از دشمنی و کینه با حق برداری] آمرزش خواهم خواست و در برابر خدا به سود تو اختیار چیزی را ندارم. پروردگارا! بر تو توکل کردیم، و به سوی تو بازگشتیم، و بازگشت به سوی توست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "ابراهيم و كسانى كه با وى بودند، آنگاه كه به قوم خود گفتند كه ما از شما و از آنچه جز خداى يكتا مى‌پرستيد بيزاريم و شما را كافر مى‌شمريم و ميان ما و شما هميشه دشمنى و كينه‌توزى خواهد بود تا وقتى كه به خداى يكتا ايمان بياوريد، برايتان نيكو مقتدايى بودند. مگر آنگاه كه ابراهيم پدرش را گفت كه براى تو آمرزش مى‌طلبم، زيرا نمى‌توانم عذاب خدا را از تو دفع كنم. اى پروردگار ما، بر تو توكل كرديم و به تو روى آورديم و سرانجام تو هستى."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "قطعا براى شما در [حالات‌] ابراهيم و كسانى كه با او بودند سرمشق خوبى است، آن گاه كه به قوم خود گفتند: ما از شما و از آنچه به جاى خدا مى‌پرستيد بيزاريم و [آيين‌] شما را منكريم، و ميان ما و شما براى هميشه دشمنى و كينه پديد آمده است تا وقتى كه به خداى يگا"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "قطعاً براى شما در [پيروى از] ابراهيم و كسانى كه با اويند سرمشقى نيكوست: آنگاه كه به قوم خود گفتند: «ما از شما و از آنچه به جاى خدا مى‌پرستيد بيزاريم. به شما كفر مى‌ورزيم و ميان ما و شما دشمنى و كينه هميشگى پديدار شده تا وقتى كه فقط به خدا ايمان آوريد.» جز [در] سخن ابراهيم [كه‌] به [نا]پدر[ى‌] خود [گفت:] «حتماً براى تو آمرزش خواهم خواست، با آنكه در برابر خدا اختيار چيزى را براى تو ندارم.» «اى پروردگار ما! بر تو اعتماد كرديم و به سوى تو بازگشتيم و فرجام به سوى توست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "برای شما مؤمنان بسیار پسندیده و نیکوست که به ابراهیم و اصحابش اقتدا کنید که آنها به قوم (مشرک) خود گفتند: ما از شما و بتهای شما که به جای خدا می‌پرستید به کلی بیزاریم، ما مخالف و منکر شماییم و همیشه میان ما و شما کینه و دشمنی خواهد بود تا وقتی که تنها به خدای یگانه ایمان آرید، الاّ آنکه ابراهیم به پدر (یعنی عموی) خود گفت: (اگر ایمان آری) من برای تو از خدا آمرزش می‌طلبم (که از شرک و عصیان گذشته تو درگذرد) و (هر گاه ایمان نیاوری) دیگر من بر نجات تو از (قهر و غضب) خدا هیچ کاری نتوانم کرد، بار الها، ما بر تو توکل کردیم و رو به درگاه تو آوردیم و بازگشت تمام خلق به سوی توست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "(رفتار و کردار) ابراهیم و کسانی که بدو گرویده بودند، الگوی خوبی برای شما است، بدانگاه که به قوم خود گفتند: ما از شما و از چیزهائی که بغیر از خدا می‌پرستید، بیزار و گریزانیم، و شما را قبول نداریم و در حق شما بی‌اعتنائیم، و دشمنانگی و کینه‌توزی همیشگی میان ما و شما پدیدار آمده است، تا زمانی که به خدای یگانه ایمان می‌آورید و او را به یگانگی می‌پرستید. (کردار و رفتار ابراهیم و گروندگان بدو، سرمشق خوبی برای شما است) مگر سخنی که ابراهیم به پدر خود گفت: من قطعاً برای تو طلب آمرزش می‌کنم، و در عین حال برای تو در پیشگاه خدا هیچ کار دیگری نمی‌توانم بکنم. (این سخن، چیزی نیست که بدان اقتداء کنید). پروردگارا! به تو توکّل می‌کنیم، و به تو روی می‌آوریم، و بازگشت به سوی تو است (و همه‌ی راهها سر به جانب تو دارد و به تو منتهی می‌گردد). [[«الَّذِینَ مَعَهُ»: گروندگان به ابراهیم. انبیاء و پیغمبران بعد از ابراهیم که همه در خط سیر همدیگرند (نگا: المصحف المیسر). «أُسْوَةٌ»: الگو. سرمشق. اقتداء و تأسی. پیروی و دنباله‌روی. «بُرَآؤُ»: جمع بَری‌ءٌ، بیزار و گریزان. متنفر. «کَفَرْنَا بِکُمْ»: شما را نمی‌پذیریم و قبول نداریم. چه بسا از راه تغلیب مراد معتقدات خودشان باشد. «إِلاّ قَوْلَ ...»: (نگا: توبه / 114). «أَنَبْنَا»: با توبه کردن و کارهای نیکو انجام دادن برمی‌گردیم (نگا: رعد / 27، لقمان / 15، ص / 24).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "برای شما در ابراهیم و همراهان او سرمشقی نیکوست، آنگاه که به قومشان گفتند و ما از شما و آنچه به جای خداوند می‌پرستید، بری و برکناریم، ما منکر شماییم و همواره در میان ما و شما دشمنی و کینه پدید آمده است تا آنکه فقط به خداوند ایمان آورید، مگر در این سخن ابراهیم به پدرش که حتما برای تو آمرزش خواهم طلبید، و برای تو در برابر خداوند صاحب اختیار چیزی نیستم، پروردگارا بر تو توکل کرده‌ایم و به تو روی آورده‌ایم و سیر و سرانجام [همه‌] به سوی توست‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "برای شما سرمشق خوبی در زندگی ابراهیم و کسانی که با او بودند وجود داشت، در آن هنگامی که به قوم (مشرک) خود گفتند: «ما از شما و آنچه غیر از خدا می‌پرستید بیزاریم؛ ما نسبت به شما کافریم؛ و میان ما و شما عداوت و دشمنی همیشگی آشکار شده است؛ تا آن زمان که به خدای یگانه ایمان بیاورید! -جز آن سخن ابراهیم که به پدرش [= عمویش آزر] گفت (و وعده داد) که برای تو آمرزش طلب می‌کنم، و در عین حال در برابر خداوند برای تو مالک چیزی نیستم (و اختیاری ندارم)!- پروردگارا! ما بر تو توکّل کردیم و به سوی تو بازگشتیم، و همه فرجامها بسوی تو است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "همانا بود برای شما پیروی نکوئی در ابراهیم و آنان که با اویند گاهی که گفتند به قوم خویش مائیم بیزاران از شما و از آنچه پرستید جز خدا کفر ورزیدیم به شما و پدیدار شد میان ما و شما دشمنی و کین همیشه مگر آنکه ایمان آرید به خدا تنها بجز گفتار ابراهیم به پدرش که آمرزش خواهم البته برایت و دارا نیستم برای تو از خدا چیزی را پروردگارا بر تو توکّل کردیم و بسوی تو بازگشتیم و بسوی تو است بازگشت‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "همانا براى شما در [روش‌] ابراهيم و كسانى كه با او بودند پيروى نيكوست، آنگاه كه به قوم خود گفتند: ما از شما و از آنچه جز خدا مى‌پرستيد بيزاريم، به [آيين و پرستيده‌] شما كافر و ناباوريم، و ميان ما و شما براى هميشه دشمنى و كين پديد آمده تا به خداى يگانه ايمان آوريد، مگر گفتار ابراهيم به پدر خود- سرپرست خود آزر- كه براى تو آمرزش خواهم خواست و براى تو از خداى هيچ چيز در توان ندارم- كه عذاب را از تو باز دارم-. پروردگارا، بر تو توكل كرديم و به سوى تو بازگشتيم، و بازگشت [همه‌] به سوى توست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "همواره برای شما در (قصّه‌ی رسالتی) ابراهیم و کسانی که با اویند سرمشقی نیکو بوده است؛ چون به قوم خود گفتند: «ما از شما و از آنچه به جای خدا می‌پرستید بیزاریم. به شما کفر ورزیدیم و میان ما و شما دشمنی و کینه‌ی همیشگی پدیدار شد، تا تنها به خدا ایمان آورید.» جز (در این) سخن ابراهیم (که) به (نا)پدر(ی) خود (گفت:) «همانا به‌راستی برایت (از خدا) پوشش می‌خواهم و از طرف خدا برایت هیچ چیزی در دست ندارم. پروردگارمان! بر تو توکل کردیم و سوی تو – بارها – بازگشتیم و فرجام تنها سوی توست.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "You have an excellent model in Abraham and those who were with him, when he said to his people: \"We are through with you, and those you worship other than God. We reject you. Enmity and hate have come between you and us for ever, unless you believe in God the One,\" -- except for what he said to his father: \"I shall ask forgiveness for you, but I have no power to prevail with God for you.\" \"O Lord, we place our trust in You, and turn to You in penitence, and to You is our returning."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Indeed in Ibrahim, and those along with him, lay a good example for you follow – when they said to their people, “Indeed we are unconcerned with you and all what you worship besides Allah; we reject you, and between us and you has surfaced enmity and hatred for ever until you accept faith in the One Allah” – except the saying of Ibrahim to his father, “I will surely seek forgiveness for you, and I do not possess any power to benefit you against Allah”; “O our Lord! We have relied only upon You, and towards You only we have inclined and only towards You is the return”."}, {"lang": "en", "name": "A. J. Arberry", "text": "You have had a good example in Abraham, and those with him, when they said to their people, 'We are quit of you and that you serve, apart from God. We disbelieve in you, and between us and you enmity has shown itself, and hatred for ever, until you believe in God alone. (Except that Abraham said unto his father, 'Certainly I shall ask pardon for thee; but I have no power to do aught for thee against God.') 'Our Lord, in Thee we trust; to Thee we turn; to Thee is the homecoming."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Surely there hath been an excellent pattern for you in Ibrahim and those with him, when they said Unto their people; verily we are quit of you and of that which ye worship beside Allah; we renounce you; and surely there hath appeared between us and you hostility and hatred for evermore until ye believe in Allah alone, - except the saying of Ibrahim Unto his father: surely I shall beg forgiveness for thee, and I have no power with Allah for thee at all. Our Lord! in Thee we put our trust, and Unto Thee we turn, and Unto Thee is the journeying."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Indeed there has been an excellent example for you in Ibrahim (Abraham) and those with him, when they said to their people: \"Verily, we are free from you and whatever you worship besides Allah, we have rejected you, and there has started between us and you, hostility and hatred for ever, until you believe in Allah Alone,\" except the saying of Ibrahim (Abraham) to his father: \"Verily, I will ask for forgiveness (from Allah) for you, but I have no power to do anything for you before Allah.\" Our Lord! In You (Alone) we put our trust, and to You (Alone) we turn in repentance, and to You (Alone) is (our) final Return,"}, {"lang": "en", "name": "Talal Itani", "text": "You have had an excellent example in Abraham and those with him; when they said to their people, “We are quit of you, and what you worship apart from God. We denounce you. Enmity and hatred has surfaced between us and you, forever, until you believe in God alone.” Except for the words of Abraham to his father, “I will ask forgiveness for you, though I have no power from God to do anything for you.” “Our Lord, in You we trust, and to You we repent, and to You is the ultimate resort."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "You have a good example in Abraham and his companions: they said to their people: “We totally dissociate ourselves from you, and from the deities that you worship instead of Allah. We renounce you and there has come to be enmity and hatred between us and you until you believe in Allah, the One True God.” (But you may not emulate) Abraham's saying to his father: “Certainly I will ask pardon for you, although I have no power over Allah to obtain anything on your behalf.” (And Abraham and his companions prayed): “Our Lord, in You have we put our trust, and to You have we turned, and to You is our ultimate return."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Indeed there has been an excellent example for you in Ibrahim and those with him, when they said to their people: \"Verily, we are free from you and whatever you worship besides Allah, we have rejected you, and there has started between us and you, hostility and hatred forever until you believe in Allah alone,\" -- except the saying of Ibrahim to his father: \"Verily, I will ask forgiveness for you, but I have no power to do anything for you before Allah.\" \"Our Lord! In You we put our trust, and to You we turn in repentance, and to You is the final Return.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "There is a goodly pattern for you in Abraham and those with him, when they told their folk: Lo! we are guiltless of you and all that ye worship beside Allah. We have done with you. And there hath arisen between us and you hostility and hate for ever until ye believe in Allah only - save that which Abraham promised his father (when he said): I will ask forgiveness for thee, though I own nothing for thee from Allah - Our Lord! In Thee we put our trust, and unto Thee we turn repentant, and unto Thee is the journeying."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "There is certainly a good exemplar for you in Abraham and those who were with him, when they said to their own people, ‘Indeed we repudiate you and whatever you worship besides Allah. We disown you, and enmity and hate have appeared between you and us for ever, unless you come to have faith in Allah alone,’ apart from Abraham’s saying to his father, ‘I will surely plead forgiveness for you, though I cannot avail you anything against Allah.’ ‘Our Lord! In You do we put our trust, and to You do we turn penitently, and toward You is the destination."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "You have a good example in Abraham and those with him. They said to their nation: 'We are quit of you, and that which you worship, other than Allah. We disbelieve you, enmity and hatred has shown itself between us for ever until you believe in Allah alone' Except that Abraham said to his father: 'Surely, I shall supplicate to ask for forgiveness for you although I have no power to do anything for you with Allah' ' Our Lord, in You we have put our trust; to You we turn, and to You is the arrival,"}, {"lang": "en", "name": "Saheeh International", "text": "There has already been for you an excellent pattern in Abraham and those with him, when they said to their people, \"Indeed, we are disassociated from you and from whatever you worship other than Allah. We have denied you, and there has appeared between us and you animosity and hatred forever until you believe in Allah alone\" except for the saying of Abraham to his father, \"I will surely ask forgiveness for you, but I have not [power to do] for you anything against Allah. Our Lord, upon You we have relied, and to You we have returned, and to You is the destination."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Abraham and those with him are the best examples for you to follow. They told the people, \"We have nothing to do with you and with those whom you worship besides God. We have rejected you. Enmity and hatred will separate us forever unless you believe in One God.\" Abraham told his father, \"I shall ask forgiveness for you only, but I shall not be of the least help to you before God\"."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Indeed, there is for you a good example in Ibrahim and those with him when they said to their people: Surely we are clear of you and of what you serve besides Allah; we declare ourselves to be clear of you, and enmity and hatred have appeared between us and you forever until you believe in Allah alone-- but not in what Ibrahim said to his father: I would certainly ask forgiveness for you, and I do not control for you aught from Allah-- Our Lord! on Thee do we rely, and to Thee do we turn, and to Thee is the eventual coming:"}, {"lang": "en", "name": "English Transliteration", "text": "Qad k<u>a</u>nat lakum oswatun <u>h</u>asanatun fee ibr<u>a</u>heema wa<b>a</b>lla<u>th</u>eena maAAahu i<u>th</u> q<u>a</u>loo liqawmihim inn<u>a</u> bura<u>a</u>o minkum wamimm<u>a</u> taAAbudoona min dooni All<u>a</u>hi kafarn<u>a</u> bikum wabad<u>a</u> baynan<u>a</u> wabaynakumu alAAad<u>a</u>watu wa<b>a</b>lbagh<u>da</u>o abadan <u>h</u>att<u>a</u> tuminoo bi<b>A</b>ll<u>a</u>hi wa<u>h</u>dahu ill<u>a</u> qawla ibr<u>a</u>heema liabeehi laastaghfiranna laka wam<u>a</u> amliku laka mina All<u>a</u>hi min shayin rabban<u>a</u> AAalayka tawakkaln<u>a</u> wailayka anabn<u>a</u> wailayka alma<u>s</u>eer<b>u</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Indeed you have an excellent example in Abraham and those who followed him, when they said to their people, \"We disown you and whatever you worship besides God. We renounce you. Enmity and hatred shall endure between us and you, until you believe in the one God.\" [The exception was] when Abraham said to his father, \"I shall indeed pray for [God\"s] forgiveness for you; although I do not have it in my power to obtain anything from God on your behalf.\" They prayed, \"O our Lord, in You we have placed our trust and to You we turn in repentance and to You is the final return."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "There is for you an excellent example (to follow) in Abraham and those with him, when they said to their people: \"We are clear of you and of whatever ye worship besides Allah: we have rejected you, and there has arisen, between us and you, enmity and hatred for ever,- unless ye believe in Allah and Him alone\": But not when Abraham said to his father: \"I will pray for forgiveness for thee, though I have no power (to get) aught on thy behalf from Allah.\" (They prayed): \"Our Lord! in Thee do we trust, and to Thee do we turn in repentance: to Thee is (our) Final Goal."}]}, {"index": 5155, "local_index": 5, "part_type": "Verse", "path": "/books/quran:60:5", "text": "رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِلَّذِينَ‌ کَفَرُوا وَ اغْفِرْ لَنَا رَبَّنَا إِنَّکَ‌ أَنْتَ‌ الْعَزِيزُ الْحَکِيمُ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "پروردگارا! ما را وسیله آزمایش [و هدف آزار، چیرگی و سلطه] برای کافران قرار مده، و پروردگارا! ما را بیامرز که همانا تو توانای شکست ناپذیر و حکیمی."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى پروردگار ما، ما را چنان مكن كه كافران خوار دارندمان. و ما را بيامرز كه تو پيروزمند و حكيمى."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "پروردگارا! ما را مورد آزار و آزمايش كسانى كه كافر شدند قرار مده و ما را بيامرز، پروردگارا! به درستى كه تو مقتدر و حكيمى"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "پروردگارا، ما را وسيله آزمايش [و آماج آزار] براى كسانى كه كفر ورزيده‌اند مگردان، و بر ما ببخشاى كه تو خود تواناى سنجيده‌كارى.»"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "پروردگارا، ما را مایه فتنه و امتحان کافران مگردان و پروردگارا، ما را بیامرز که تنها تویی که (بر هر کار) بسیار مقتدری و (به صلاح خلق) کاملا آگاهی."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "پروردگارا! ما را گرفتار دست کافران مکن، پروردگارا! ما را بیامرز که تو چیره‌ی کار بجائی. [[«فِتْنَةً»: مفتون و گرفتار. وسیله آزمون (نگا: یونس / 85، اسراء / 60، حج / 53). «رَبَّنَا»: تکرار این واژه برای مبالغه در تضرع و زاری است. می‌تواند ملحق به ماقبل و یا به مابعد شود (نگا: روح‌البیان).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "پروردگارا ما را زیردست کافران مگردان و ما را بیامرز، پروردگارا تویی که پیروزمند فرزانه‌ای‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "پروردگارا! ما را مایه گمراهی کافران قرار مده، و ما را ببخش، ای پروردگار ما که تو عزیز و حکیمی!»"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "پروردگارا نساز ما را دستخوش آنان که کفر ورزیدند و بیامرز ما را پروردگارا توئی همانا عزّتمند حکیم‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "پروردگارا، ما را مايه آزمون كافران مكن و ما را، بارخدايا، بيامرز، كه همانا تويى تواناى بى‌همتا و داناى با حكمت."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«پروردگارمان! ما را وسیله‌ی آزمایشی آتش‌‌بار برای کسانی که کفر ورزیدند مگردان و برایمان بپوشان که تو خود عزیز حکیمی.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "O Lord, make us not an example of punishment for infidels, and forgive us, O Lord. You are all-mighty and all-wise.\""}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "“O our Lord! Do not put us into the trial of the disbelievers, and forgive us, O our Lord! Indeed You only are the Most Honourable, the Wise.”"}, {"lang": "en", "name": "A. J. Arberry", "text": "Our Lord, make us not a temptation to those who disbelieve; and forgive us. Our. Lord, Thou art the All-mighty, the All-wise.'"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Our Lord! make us not a trial for those who disbelieve, and forgive us, our Lord! verily Thou! Thou art the Mighty, the Wise."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "\"Our Lord! Make us not a trial for the disbelievers, and forgive us, Our Lord! Verily, You, only You are the All-Mighty, the All-Wise.\""}, {"lang": "en", "name": "Talal Itani", "text": "Our Lord, do not make us a target for those who disbelieve, and forgive us, our Lord. You are indeed the Mighty and Wise.”"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Our Lord, do not make us a test for the unbelievers, and forgive us, our Lord. Surely You are Most Mighty, Most Wise.”"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "\"Our Lord! Make us not a trial for the disbelievers, and forgive us, Our Lord! Verily, You, only You, are the Almighty, the All-Wise.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Our Lord! Make us not a prey for those who disbelieve, and forgive us, our Lord! Lo! Thou, only Thou, are the Mighty, the Wise."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Our Lord! Do not make us a test for the faithless, and forgive us. Our Lord! Indeed You are the All-mighty, the All-wise.’"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Our Lord, do not make us a temptation for the unbelievers and forgive us. Our Lord, You are the Almighty, the Wise'"}, {"lang": "en", "name": "Saheeh International", "text": "Our Lord, make us not [objects of] torment for the disbelievers and forgive us, our Lord. Indeed, it is You who is the Exalted in Might, the Wise.\""}, {"lang": "en", "name": "Muhammad Sarwar", "text": "They prayed, \"Lord, we have trust in You, turned to You in repentance, and to You we shall all return. Lord, save us from the evil intentions of the disbelievers. Our Lord, forgives us. You are Majestic and All-wise\"."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Our Lord! do not make us a trial for those who disbelieve, and forgive us, our Lord! surely Thou art the Mighty, the Wise."}, {"lang": "en", "name": "English Transliteration", "text": "Rabban<u>a</u> l<u>a</u> tajAAaln<u>a</u> fitnatan lilla<u>th</u>eena kafaroo wa<b>i</b>ghfir lan<u>a</u> rabban<u>a</u> innaka anta alAAazeezu al<u>h</u>akeem<b>u</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Our Lord, do not make us a prey for those who deny the truth, and forgive us our Lord. For You alone are the Mighty, the Wise One.\""}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "\"Our Lord! Make us not a (test and) trial for the Unbelievers, but forgive us, our Lord! for Thou art the Exalted in Might, the Wise.\""}]}, {"index": 5156, "local_index": 6, "part_type": "Verse", "path": "/books/quran:60:6", "text": "لَقَدْ کَانَ‌ لَکُمْ‌ فِيهِمْ‌ أُسْوَةٌ حَسَنَةٌ لِمَنْ‌ کَانَ‌ يَرْجُو اللَّهَ‌ وَ الْيَوْمَ‌ الْآخِرَ وَ مَنْ‌ يَتَوَلَ‌ فَإِنَ‌ اللَّهَ‌ هُوَ الْغَنِيُ‌ الْحَمِيدُ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بی تردید برای شما در [روش و شیوه] آنان سرمشقی نیکوست، برای کسی که به خدا و روز قیامت امید دارد. و هر کس [از اقتدای به آن روش و شیوه] روی برگرداند [زیانی به خدا نمی رساند]؛ زیرا خدا همان بی نیاز و ستوده است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آنها، نيكو مقتدايى هستند براى شما: براى كسانى كه به خدا و روز قيامت اميد دارند. و هر كه رويگردان شود، خدا بى‌نياز و ستودنى است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "قطعا براى شما در [رفتار] آنها سرمشقى نيكوست، براى كسى كه به خدا و روز واپسين اميد دارد. و هر كه روى برتابد [به خود زيان زده است‌] زيرا خداوند خود بى‌نياز ستوده است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "قطعاً براى شما در [پيروى از] آنان سرمشقى نيكوست [يعنى‌] براى كسى كه به خدا و روز بازپسين اميد مى‌بندد. و هر كس روى برتابد [بداند كه‌] خدا همان بى‌نياز ستوده‌[صفات‌] است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "البته برای شما مؤمنان هر که به خدا و (ثواب) عالم آخرت امیدوار است اقتداء به ابراهیم و یارانش نیکوست، و هر که روی (از خدا) بگرداند خدا (از طاعت خلق) کاملا بی‌نیاز و به ذات خود ستوده صفات است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "(برنامه‌ی زندگی) ابراهیم و گرویدگان بدو، الگوی زیبائی برای شما است. برای شما کسانی که خدا و آخرت را در مدّ نظر دارید. هر کس هم (از چنین الگوئی) رویگردان شود (به خود ستم می‌کند و) خدا بی‌نیاز و شایسته‌ی هرگونه ستایش است. [[«لِمَن کَانَ یَرْجُو ...»: بدل از ضمیر (کُمْ) است (نگا: روح‌المعانی). در رسم‌الخط قرآنی، الف زائدی در آخر واژه (یَرْجُو) است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "به راستی برای شما در آنان سرمشقی نیکوست، برای کسی که به خداوند و روز بازپسین امید داشته باشد، و هر کس روی برتابد [بداند] که خداوند بی‌نیاز ستوده است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "(آری) برای شما در زندگی آنها اسوه حسنه (و سرمشق نیکویی) بود، برای کسانی که امید به خدا و روز قیامت دارند؛ و هر کس سرپیچی کند به خویشتن ضرر زده است، زیرا خداوند بی‌نیاز و شایسته ستایش است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "همانا بود برای شما در ایشان پیرویی نکو برای آنکه امید دارد خدا و روز بازپسین را و آنکه پشت کند همانا خدا است بی‌نیاز ستوده‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "هر آينه شما را در [روش‌] آنها پيروى نيكوست، براى كسى كه به [پاداش‌] خداى و روز واپسين اميد مى‌دارد و هر كه روى بگرداند پس [بداند كه‌] خداست بى‌نياز و ستوده."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بی‌گمان برایتان در (پیروی از) آنان به‌راستی سر مشقی نیکو بوده است؛ برای آنان که به خدا و روز بازپسین امید داشته‌اند. و هر کس روی برتابد خدا - (هم) او- بی‌نیاز ستوده است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Those of you who have hope in God and the Last Day have certainly a good example in them. But whosoever turns away, then surely God is above concern, worthy of praise."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Indeed in them lay a good example for you to follow – for one who looks forward to (meeting) Allah and the Last Day; and whoever turns away – then (know that) indeed Allah only is the Independent, the Most Praiseworthy."}, {"lang": "en", "name": "A. J. Arberry", "text": "You have had a good example in them for whoever hopes for God and the Last Day. And whosoever turns away, surely God is the All-sufficient, the All-laudable."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Assuredly there hath been in them for you an excellent pattern-for him who hopeth for Allah and the last Day. And whosoever turneth away, then verily Allah! He is the Self-sufficient, the Praiseworthy."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Certainly, there has been in them an excellent example for you to follow, for those who look forward to (the Meeting with) Allah (for the reward from Him) and the Last Day. And whosoever turn away, then verily, Allah is Rich (Free of all wants), Worthy of all Praise."}, {"lang": "en", "name": "Talal Itani", "text": "There is an excellent example in them for you—for anyone who seeks God and the Last Day. But whoever turns away—God is the Self-Sufficient, the Most Praised."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Indeed there is a good example for you in them; a good example for anyone who looks forward to Allah and the Last Day. As for him who turns away, Allah is All-Sufficient, Immensely Praiseworthy."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Certainly, there has been in them an excellent example for you to follow - for those who look forward to (the meeting with) Allah and the Last Day. And whosoever turns away, then verily, Allah is Al-Ghani, Al-Hamid."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Verily ye have in them a goodly pattern for everyone who looketh to Allah and the Last Day. And whosoever may turn away, lo! still Allah, He is the Absolute, the Owner of Praise."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "There is certainly a good exemplar for you in them—for those who look forward to Allah and the Last Day—and anyone who refuses to comply [should know that] indeed Allah is the All-sufficient, the All-laudable."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "In those there is a good example for whosoever hopes for Allah and the Last Day. Whosoever turns away, indeed, Allah is the Rich and the Praised."}, {"lang": "en", "name": "Saheeh International", "text": "There has certainly been for you in them an excellent pattern for anyone whose hope is in Allah and the Last Day. And whoever turns away - then indeed, Allah is the Free of need, the Praiseworthy."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "They are the best examples for those who have hope in God and the Day of Judgment. Whoever turn away should know that God is Self-sufficient and Praiseworthy."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Certainly there is for you in them a good example, for him who fears Allah and the last day; and whoever turns back, then surely Allah is the Self-sufficient, the Praised."}, {"lang": "en", "name": "English Transliteration", "text": "Laqad k<u>a</u>na lakum feehim oswatun <u>h</u>asanatun liman k<u>a</u>na yarjoo All<u>a</u>ha wa<b>a</b>lyawma al<u>a</u>khira waman yatawalla fainna All<u>a</u>ha huwa alghanniyyu al<u>h</u>ameed<b>u</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Surely, there is a good example in them for you; for those who place their hopes in God and the Last Day. Whoever turns away will surely learn that God is self-sufficient and worthy of all praise."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "There was indeed in them an excellent example for you to follow,- for those whose hope is in Allah and in the Last Day. But if any turn away, truly Allah is Free of all Wants, Worthy of all Praise."}]}, {"index": 5157, "local_index": 7, "part_type": "Verse", "path": "/books/quran:60:7", "text": "عَسَى‌ اللَّهُ‌ أَنْ‌ يَجْعَلَ‌ بَيْنَکُمْ‌ وَ بَيْنَ‌ الَّذِينَ‌ عَادَيْتُمْ‌ مِنْهُمْ‌ مَوَدَّةً وَ اللَّهُ‌ قَدِيرٌ وَ اللَّهُ‌ غَفُورٌ رَحِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "امید است خدا میان شما و کسانی از کافران که با آنان دشمنی داشتید [به وسیله اسلام آوردنشان] دوستی قرار دهد، و خدا تواناست، و خدا بسیار آمرزنده و مهربان است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "شايد خدا ميان شما و كسانى كه با آنها دشمنى مى‌ورزيد دوستى پديد آورد. خدا قادر است و خدا آمرزنده و مهربان است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اميد است كه خدا ميان شما و كسانى از آنان كه [ايشان را] دشمن داشتيد [با اسلام آوردنشان‌] دوستى برقرار كند، و خدا تواناست، و خدا آمرزنده‌ى مهربان است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اميد است كه خدا ميان شما و ميان كسانى از آنان كه [ايشان را] دشمن داشتيد، دوستى برقرار كند، و خدا تواناست، و خدا آمرزنده مهربان است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "امید است که خدا دوستی میان شما و دشمنانتان (به فتوحات اسلام و ایمان کفّار) برقرار گرداند و خدا قادر و خدا بسیار آمرزنده و مهربان است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "امید است خدا میان شما و میان دشمنانتان (با توفیق دادن آنان به ایمان و پذیرش اسلام) پیوند محبّت برقرار سازد، چرا که خدا بسیار توانا است، و او آمرزنده‌ی مهربان است. [[«عَسی»: امید است. یعنی باید امیدوار باشید که. «عَادَیْتُمْ»: دشمنی ورزیده‌اید.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "چه بسا خداوند در میان شما و کسانی از آنان که باهم دشمنی دارید، مهربانی پدید آورد، و خداوند تواناست، و خداوند آمرزگار مهربان است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "امید است خدا میان شما و کسانی از مشرکین که با شما دشمنی کردند (از راه اسلام) پیوند محبّت برقرار کند؛ خداوند تواناست و خداوند آمرزنده و مهربان است."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "امید است خدا نهد میان شما و میان آنان که دشمنی کردید از ایشان دوستیی و خدا توانا است و خدا است آمرزنده مهربان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اميد است كه خدا ميان شما و كسانى از آنان كه با آنها دشمنى داريد دوستى پديد آرد- با اسلام‌آوردن آنها- و خدا تواناست- كه دشمنى را به دوستى بدل كند-، و خدا آمرزگار و مهربان است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "شاید خدا میان شما و میان کسانی از آنان که (ایشان را) دشمن داشتید، نوعی دوستی برقرار کند، و خدا تواناست و خدا پوشنده‌ای رحمتگر بر ویژگان است."}, {"lang": "en", "name": "Ahmed Ali", "text": "It maybe that God will create love between you and your enemies. God is all-powerful, and God is forgiving, ever-merciful."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "It is likely that Allah may create friendship between you and those among them who are now your enemies; and Allah is All Able; and Allah is Oft Forgiving, Most Merciful."}, {"lang": "en", "name": "A. J. Arberry", "text": "It may be God will yet establish between you and those of them with whom you are at enmity love. God is All-powerful; God is All-forgiving, All-compassionate."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Belike Allah may appoint between you and those of them whom ye hold as enemies affection. And Allah is Potent, and Allah is Forgiving, Merciful."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Perhaps Allah will make friendship between you and those whom you hold as enemies. And Allah has power (over all things), and Allah is Oft-Forgiving, Most Merciful."}, {"lang": "en", "name": "Talal Itani", "text": "Perhaps God will plant affection between you and those of them you consider enemies. God is Capable. God is Forgiving and Merciful."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "It may well be that Allah will implant love between you and those with whom you have had enmity. Allah is Most Powerful; and Allah is Most Forgiving, Most Compassionate."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Perhaps Allah will make friendship between you and those whom you hold as enemies. And Allah has power (over all things), and Allah is Oft-Forgiving, Most Merciful."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "It may be that Allah will ordain love between you and those of them with whom ye are at enmity. Allah is Mighty, and Allah is Forgiving, Merciful."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "It may be that Allah will bring about affection between you and those with whom you are at enmity, and Allah is all-powerful, and Allah is all-forgiving, all-merciful."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "It may be that Allah establishes love between you and those with whom you are at enmity. Allah is the Powerful, Allah is the Forgiving and the Most Merciful."}, {"lang": "en", "name": "Saheeh International", "text": "Perhaps Allah will put, between you and those to whom you have been enemies among them, affection. And Allah is competent, and Allah is Forgiving and Merciful."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God will perhaps bring about love between you and those of the disbelievers with whom you were enemies. God is All-powerful, All-merciful, and All-forgiving."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "It may be that Allah will bring about friendship between you and those whom you hold to be your enemies among them; and Allah is Powerful; and Allah is Forgiving, Merciful."}, {"lang": "en", "name": "English Transliteration", "text": "AAas<u>a</u> All<u>a</u>hu an yajAAala baynakum wabayna alla<u>th</u>eena AA<u>a</u>daytum minhum mawaddatan wa<b>A</b>ll<u>a</u>hu qadeerun wa<b>A</b>ll<u>a</u>hu ghafoorun ra<u>h</u>eem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "It may well be that God will create goodwill between you and those of them with whom you are now at enmity -- for God is all powerful, most forgiving and merciful."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "It may be that Allah will grant love (and friendship) between you and those whom ye (now) hold as enemies. For Allah has power (over all things); And Allah is Oft-Forgiving, Most Merciful."}]}, {"index": 5158, "local_index": 8, "part_type": "Verse", "path": "/books/quran:60:8", "text": "لاَ يَنْهَاکُمُ‌ اللَّهُ‌ عَنِ‌ الَّذِينَ‌ لَمْ‌ يُقَاتِلُوکُمْ‌ فِي‌ الدِّينِ‌ وَ لَمْ‌ يُخْرِجُوکُمْ‌ مِنْ‌ دِيَارِکُمْ‌ أَنْ‌ تَبَرُّوهُمْ‌ وَ تُقْسِطُوا إِلَيْهِمْ‌ إِنَ‌ اللَّهَ‌ يُحِبُ‌ الْمُقْسِطِينَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "خدا شما را از نیکی کردن و عدالت نسبت به کسانی که درکار دین با شما نجنگیدند و شما را از دیارتان بیرون نکردند باز نمی دارد؛ زیرا خدا عدالت پیشگان را دوست دارد."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا شما را از نيكى‌كردن و عدالت‌ورزيدن با آنان كه با شما در دين نجنگيده‌اند و از سرزمينتان بيرون نرانده‌اند، باز نمى‌دارد. خدا كسانى را كه به عدالت رفتار مى‌كنند دوست دارد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "خداوند شما را از نيكى كردن و دادگرى با كسانى كه در [امر] دين با شما نجنگيده و شما را از ديارتان بيرون نكرده‌اند منعت نمى‌كند. بى‌ترديد خداوند دادگران را دوست مى‌دارد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "[اما] خدا شما را از كسانى كه در [كار] دين با شما نجنگيده و شما را از ديارتان بيرون نكرده‌اند، باز نمى‌دارد كه با آنان نيكى كنيد و با ايشان عدالت ورزيد، زيرا خدا دادگران را دوست مى‌دارد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "خدا شما را از آنان که با شما در دین قتال و دشمنی نکرده و شما را از دیارتان بیرون ننمودند نهی نمی‌کند که با آنان نیکی کنید و به عدالت و انصاف رفتار نمایید، که خدا مردم با عدل و داد را بسیار دوست می‌دارد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "خداوند شما را باز نمی‌دارد از این که نیکی و بخشش بکنید به کسانی که به سبب دین با شما نجنگیده‌اند و از شهر و دیارتان شما را بیرون نرانده‌اند. خداوند نیکوکاران را دوست می‌دارد. [[«أَن تُقْسِطُوا إِلَیْهِمْ»: از این که به آنان بخشی از اموال خود را بدهید و بدیشان احسان کنید. این فعل از (قسط) به معنی بخش و بهره است؛ نه (قسط) به معنی عدالت و دادگری (نگا: المصحف المیسر). چرا که عدالت و دادگری نسبت به دوست و دشمن واجب است (نگا: مائده / 8). عطف (تُقْسِطُوا) بر (تَبَرُّوهُمْ) از قبیل عطف خاص بر عام است. «الْمُقْسِطِینَ»: نیکوکاران. بخشندگان.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "خداوند شما را از کسانی که با شما در کار دین کارزار نکرده‌اند، و شما را از خانه و کاشانه‌تان آواره نکرده‌اند، نهی نمی‌کند از اینکه در حقشان نیکی کنید و با آنان دادگرانه رفتار کنید، بی‌گمان خداوند دادگران را دوست دارد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "خدا شما را از نیکی کردن و رعایت عدالت نسبت به کسانی که در راه دین با شما پیکار نکردند و از خانه و دیارتان بیرون نراندند نهی نمی‌کند؛ چرا که خداوند عدالت‌پیشگان را دوست دارد."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "بازندارد شما را خدا از آنان که جنگ با شما نکردند در دین و برون نراندند شما را از خانه‌های خویش که نیکی کنید با آنان و از در دادگری با آنان درآئید همانا خدا دوست دارد دادگران را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "خداوند شما را از نيكى‌كردن و دادگرى‌نمودن با كسانى كه در دين با شما كارزار نكردند و شما را از خانمانتان بيرون نراندند، باز نمى‌دارد. همانا خدا دادگران را دوست دارد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "خدا شما را از (دوستی با) کسانی که در دین با شما کشتار نکرده و شما را از دیارتان بیرون نکرده‌اند، باز نمی‌دارد، که با آنان نیکی کنید، و با ایشان عدالت - و فراتر از آن- ورزید. خدا بی‌گمان دادگران را دوست می‌دارد."}, {"lang": "en", "name": "Ahmed Ali", "text": "God does not forbid you from being kind and acting justly towards those who did not fight over faith with you, nor expelled you from your homes. God indeed loves those who are just."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Allah does not forbid you from those who did not fight against you because of religion and did not drive you out from your homes, that you should be kind towards them and deal with them fairly; indeed the equitable are the beloved of Allah."}, {"lang": "en", "name": "A. J. Arberry", "text": "God forbids you not, as regards those who have not fought you in religion's cause, nor expelled you from your habitations, that you should be kindly to them, and act justly towards them; surely God loves the just."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Allah forbiddeth you not that ye should deal benevolently and equitably with those who fought not against you on accouct of religion nor drave you out from your homes; verily Allah loveth the equitable,"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Allah does not forbid you to deal justly and kindly with those who fought not against you on account of religion and did not drive you out of your homes. Verily, Allah loves those who deal with equity."}, {"lang": "en", "name": "Talal Itani", "text": "As for those who have not fought against you for your religion, nor expelled you from your homes, God does not prohibit you from dealing with them kindly and equitably. God loves the equitable."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Allah does not forbid that you be kind and just to those who did not fight against you on account of religion, nor drove you out of your homes. Surely Allah loves those who are equitable."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Allah does not forbid you to deal justly and kindly with those who fought not against you on account of religion nor drove you out of your homes. Verily, Allah loves those who deal with equity."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Allah forbiddeth you not those who warred not against you on account of religion and drove you not out from your homes, that ye should show them kindness and deal justly with them. Lo! Allah loveth the just dealers."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Allah does not forbid you from dealing with kindness and justice with those [polytheists] who did not make war against you on account of religion and did not expel you from your homes. Indeed Allah loves the just."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Allah does not forbid you to be kind and to act justly to those who have neither made war on your Religion nor expelled you from your homes. Allah loves the just."}, {"lang": "en", "name": "Saheeh International", "text": "Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes - from being righteous toward them and acting justly toward them. Indeed, Allah loves those who act justly."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God does not forbid you to deal kindly and justly with those who have not fought against you about the religion or expelled you from your homes. God does not love the unjust people."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Allah does not forbid you respecting those who have not made war against you on account of (your) religion, and have not driven you forth from your homes, that you show them kindness and deal with them justly; surely Allah loves the doers of justice."}, {"lang": "en", "name": "English Transliteration", "text": "L<u>a</u> yanh<u>a</u>kumu All<u>a</u>hu AAani alla<u>th</u>eena lam yuq<u>a</u>tilookum fee a<b>l</b>ddeeni walam yukhrijookum min diy<u>a</u>rikum an tabarroohum watuqsi<u>t</u>oo ilayhim inna All<u>a</u>ha yu<u>h</u>ibbu almuqsi<u>t</u>een<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "He does not forbid you to deal kindly and justly with anyone who has not fought you on account of your faith or driven you out of your homes: God loves the just."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Allah forbids you not, with regard to those who fight you not for (your) Faith nor drive you out of your homes, from dealing kindly and justly with them: for Allah loveth those who are just."}]}, {"index": 5159, "local_index": 9, "part_type": "Verse", "path": "/books/quran:60:9", "text": "إِنَّمَا يَنْهَاکُمُ‌ اللَّهُ‌ عَنِ‌ الَّذِينَ‌ قَاتَلُوکُمْ‌ فِي‌ الدِّينِ‌ وَ أَخْرَجُوکُمْ‌ مِنْ‌ دِيَارِکُمْ‌ وَ ظَاهَرُوا عَلَى‌ إِخْرَاجِکُمْ‌ أَنْ‌ تَوَلَّوْهُمْ‌ وَ مَنْ‌ يَتَوَلَّهُمْ‌ فَأُولٰئِکَ‌ هُمُ‌ الظَّالِمُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "خدا فقط شما را از دوستی با کسانی نهی می کند که در کار دین با شما جنگیدند، و از دیارتان بیرون راندند، و در بیرون راندنتان به یکدیگر کمک کردند تا [به خاطر این سختگیری] با آنان دوستی کنید. و تنها کسانی که با آنان دوستی کنند، ستمکارانند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "جز اين نيست كه خدا از دوستى‌ورزيدن با كسانى كه با شما در دين جنگيده‌اند و از سرزمين خود بيرونتان رانده‌اند يا در بيرون‌راندنتان همدستى كرده‌اند شما را باز دارد. و هر كه با آنها دوستى ورزد از ستمكاران خواهد بود."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "خدا شما را تنها از [دوستى و رابطه با] كسانى باز مى‌دارد كه در [امر] دين با شما جنگيدند و شما را از خانه‌هايتان بيرون راندند و در بيرون راندنتان با يكديگر همدستى كردند. و هر كس با آنها دوستى كند آنان همان ستمگرانند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "فقط خدا شما را از دوستى با كسانى باز مى‌دارد كه در [كار] دين با شما جنگ كرده و شما را از خانه‌هايتان بيرون رانده و در بيرون‌راندنتان با يكديگر همپشتى كرده‌اند. و هر كس آنان را به دوستى گيرد، آنان همان ستمگرانند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و تنها شما را از دوستی کسانی نهی می‌کند که در دین با شما قتال کرده و از وطنتان بیرون کردند و بر بیرون کردن شما همدست شدند، زنهار آنها را دوست نگیرید و کسانی که با آنان دوستی و یاوری کنند ایشان به حقیقت ظالم و ستمکارند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "بلکه خداوند شما را بازمی‌دارد از دوستی ورزیدن با کسانی که به خاطر دین با شما جنگیده‌اند، و شما را از شهر و دیارتان بیرون رانده‌اند، و برای اخراج شما پشتیبانی کرده‌اند و یاری داده‌اند. کسانی که ایشان را به دوستی گیرند، ظالم و ستمگرند. [[«ظَاهَرُوا»: پشتیبانی کرده‌اند. کمک و یاری داده‌اند (نگا: توبه / 4، احزاب / 26).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "خداوند فقط شما را از کسانی که با شما در کار دین کارزار کرده‌اند و شما را از خانه و کاشانه‌تان آواره کرده‌اند و برای راندنتان [با دیگران‌] همدستی کرده‌اند، نهی می‌کند از اینکه دوستشان بدارید، و هر کس دوستشان بدارد، آنانند که ستمکار [مشرک‌] هستند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "تنها شما را از دوستی و رابطه با کسانی نهی می‌کند که در امر دین با شما پیکار کردند و شما را از خانه هایتان بیرون راندند یا به بیرون‌راندن شما کمک کردند و هر کس با آنان رابطه دوستی داشته باشد ظالم و ستمگر است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "جز این نیست که خدا باز دارد شما را از آنان که پیکار کردند با شما در دین و برون راندند شما را از خانه‌های خویش و پشتیبانی کردند بر برون‌راندن شما که دوستی با آنان کنید و آنکه دوستشان دارد همانا آنانند ستمکاران‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "جز اين نيست كه خدا شما را از دوستى‌كردن با آنان كه در دين با شما كارزار كردند و از خانمانتان بيرون راندند و بر بيرون‌كردنتان همپشتى نمودند باز مى‌دارد و هر كه با آنان دوستى بدارد، پس اينانند ستمكاران."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "تنها خدا شما را از دوستی با کسانی باز می‌دارد که در دین با شما کشتار کرده و شما را از خانه‌هایتان بیرون رانده، و در بیرون راندنتان با یکدیگر پشتیبانی کردند و هر کس آنان را به ولایت برگیرد، ایشان‌، (هم)اینان ستمگرانند."}, {"lang": "en", "name": "Ahmed Ali", "text": "He only forbids you from making friends with those who fought over faith with you and banished you from your homes, and aided in your exile. Whoever makes friends with them is a transgressor."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Allah forbids you only from those who fought against you because of religion or drove you out from your homes or helped others to drive you out, that you should befriend them; and whoever befriends them – it is they who are the unjust."}, {"lang": "en", "name": "A. J. Arberry", "text": "God only forbids you as to those who have fought you in religion's cause, and expelled you from your habitations, and have supported in your expulsion, that you should take them for friends. And whosoever takes them for friends, those -- they are the evildoers."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Allah only forbiddeth you with regard to those who fought against you on account of religion and drave you out from your homes and helped in driving you out, that ye should befriend them. And whosoever shall befriend them, then those! they are the wrong-doers."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "It is only as regards those who fought against you on account of religion, and have driven you out of your homes, and helped to drive you out, that Allah forbids you to befriend them. And whosoever will befriend them, then such are the Zalimun (wrong-doers those who disobey Allah)."}, {"lang": "en", "name": "Talal Itani", "text": "But God prohibits you from befriending those who fought against you over your religion, and expelled you from your homes, and aided in your expulsion. Whoever takes them for friends—these are the wrongdoers."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Allah only forbids you to be friends with those who have fought against you on account of religion and who have driven you out of your homes and have abetted in your expulsion. And any who make friends with them, they are the wrong-doers."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "It is only as regards those who fought against you on account of religion, and have driven you out of your homes, and helped to drive you out, that Allah forbids you to befriend them. And whosoever will befriend them, then such are the wrongdoers."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Allah forbiddeth you only those who warred against you on account of religion and have driven you out from your homes and helped to drive you out, that ye make friends of them. Whosoever maketh friends of them - (All) such are wrong-doers."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Allah forbids you only in regard to those who made war against you on account of religion and expelled you from your homes and supported [the polytheists of Makkah] in your expulsion, that you make friends with them, and whoever makes friends with them—it is they who are the wrongdoers."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "But Allah only forbids you to be guided by those who have fought against you in your religion's cause and expelled you from your homes or have supportedothers in your expulsion. Whosoever takes them as guides are harmdoers."}, {"lang": "en", "name": "Saheeh International", "text": "Allah only forbids you from those who fight you because of religion and expel you from your homes and aid in your expulsion - [forbids] that you make allies of them. And whoever makes allies of them, then it is those who are the wrongdoers."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "He only forbids you to be friends with those who have fought against you about the religion, expelled you from your homes or supported others in expelling you. Whoever loves these people are unjust."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Allah only forbids you respecting those who made war upon you on account of (your) religion, and drove you forth from your homes and backed up (others) in your expulsion, that you make friends with them, and whoever makes friends with them, these are the unjust."}, {"lang": "en", "name": "English Transliteration", "text": "Innam<u>a</u> yanh<u>a</u>kumu All<u>a</u>hu AAani alla<u>th</u>eena q<u>a</u>talookum fee a<b>l</b>ddeeni waakhrajookum min diy<u>a</u>rikum wa<i><u>th</u></i><u>a</u>haroo AAal<u>a</u> ikhr<u>a</u>jikum an tawallawhum waman yatawallahum faol<u>a</u>ika humu a<b>l</b><i><u>thth</u></i><u>a</u>limoon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "God only forbids you to make friends with those who have fought against you on account of your faith and driven you out of your homes or helped others to do so. Any of you who turn towards them in friendship will truly be transgressors."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Allah only forbids you, with regard to those who fight you for (your) Faith, and drive you out of your homes, and support (others) in driving you out, from turning to them (for friendship and protection). It is such as turn to them (in these circumstances), that do wrong."}]}, {"index": 5160, "local_index": 10, "part_type": "Verse", "path": "/books/quran:60:10", "text": "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا إِذَا جَاءَکُمُ‌ الْمُؤْمِنَاتُ‌ مُهَاجِرَاتٍ‌ فَامْتَحِنُوهُنَ‌ اللَّهُ‌ أَعْلَمُ‌ بِإِيمَانِهِنَ‌ فَإِنْ‌ عَلِمْتُمُوهُنَ‌ مُؤْمِنَاتٍ‌ فَلاَ تَرْجِعُوهُنَ‌ إِلَى‌ الْکُفَّارِ لاَ هُنَ‌ حِلٌ‌ لَهُمْ‌ وَ لاَ هُمْ‌ يَحِلُّونَ‌ لَهُنَ‌ وَ آتُوهُمْ‌ مَا أَنْفَقُوا وَ لاَ جُنَاحَ‌ عَلَيْکُمْ‌ أَنْ‌ تَنْکِحُوهُنَ‌ إِذَا آتَيْتُمُوهُنَ‌ أُجُورَهُنَ‌ وَ لاَ تُمْسِکُوا بِعِصَمِ‌ الْکَوَافِرِ وَ اسْأَلُوا مَا أَنْفَقْتُمْ‌ وَ لْيَسْأَلُوا مَا أَنْفَقُوا ذٰلِکُمْ‌ حُکْمُ‌ اللَّهِ‌ يَحْکُمُ‌ بَيْنَکُمْ‌ وَ اللَّهُ‌ عَلِيمٌ‌ حَکِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای مؤمنان! هنگامی که زنان باایمان [با جدا شدن از همسرانشان] هجرت کنان [از دیار کفر] به سوی شما می آیند، آنان را [از جهت ایمان] بیازمایید، البته خدا خود به ایمان آنان داناتر است. پس اگر آنان را باایمان تشخیص دادید، آنان را به سوی کافران [که همسرانشان هستند] باز مگردانید، نه این زنان بر کافران حلال اند، و نه آن کافران بر این زنان حلال اند، و مهریه ای که همسران کافر به زنان مؤمن خود داده اند به آنان بپردازید، و بر شما گناهی نیست در صورتی که مهریه شان را به آنان بدهید، با آنان ازدواج کنید، و به عقد و پیوندهای زنان کافر [تان که به کفار پیوسته اند] پای بند نباشید [که آن عقد و پیوند باطل شده و وظیفه شما رها کردن آنان است] و آنچه را شما [برای همسران مرتد و فراری خود که به کافران پناهنده شده اند] هزینه کرده اید [از کافران] بخواهید، و آنان هم باید آنچه را هزینه کرده اند از شما درخواست کنند؛ این حکم خداست که میان شما حکم می کند، و خدا دانا و حکیم است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى كسانى كه ايمان آورده‌ايد، چون زنان مؤمنى كه مهاجرت كرده‌اند به نزدتان آيند، بيازماييدشان. خدا به ايمانشان داناتر است. پس، اگر دانستيد كه ايمان آورده‌اند، نزد كافران بازشان مگردانيد. زيرا اينان بر مردان كافر حلال نيستند و مردان كافر نيز بر آنها حلال نيستند. و هر چه آن كافران براى اين گونه زنان هزينه كرده‌اند بپردازيد. و اگر آنها را نكاح كنيد و مهرشان را بدهيد مرتكب گناهى نشده‌ايد. و زنان كافر خود را نگه مداريد. و هر چه هزينه كرده‌ايد از مردان كافر بخواهيد و آنها نيز هر چه هزينه كرده‌اند از شما بخواهند. اين حكم خداست. خدا ميان شما حكم مى‌كند و او دانا و حكيم است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى كسانى كه ايمان آورده‌ايد! وقتى زنان با ايمان به عنوان هجرت نزد شما آمدند امتحانشان كنيد. خدا به [حقيقت‌] ايمانشان داناتر است. پس اگر آنها را مؤمن دانستيد آنها را به سوى كافران باز نگردانيد. نه اينان براى كفار حلالند و نه آنها براى اينان حلال و هر"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى كسانى كه ايمان آورده‌ايد، چون زنان با ايمان مهاجر، نزد شما آيند آنان را بيازماييد. خدا به ايمان آنان داناتر است. پس اگر آنان را باايمان تشخيص داديد، ديگر ايشان را به سوى كافران بازنگردانيد: نه آن زنان بر ايشان حلالند و نه آن [مردان‌] بر اين زنان حلال. و هر چه خرج [اين زنان‌] كرده‌اند به [شوهران‌] آنها بدهيد، و بر شما گناهى نيست كه -در صورتى كه مَهرشان را به آنان بدهيد- با ايشان ازدواج كنيد، و به پيوندهاى قبلى كافران متمسك نشويد [و پايبند نباشيد ]و آنچه را شما [براى زنان مرتد و فرارى خود كه به كفار پناهنده شده‌اند] خرج كرده‌ايد، [از كافران‌] مطالبه كنيد، و آنها هم بايد آنچه را خرج كرده‌اند [از شما] مطالبه كنند. اين حكم خداست [كه‌] ميان شما داورى مى‌كند، و خدا داناى حكيم است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "ای کسانی که ایمان آورده‌اید، زنانی که به عنوان اسلام و ایمان (از دیار خود) هجرت کرده و به سوی شما آمدند (ممکن است جاسوس باشند) شما از آنها تحقیق کرده و امتحانشان کنید و البته خدا به (صدق و کذب) ایمانشان داناتر است، اگر با ایمانشان شناختید آنها را دیگر به شوهران کافرشان بر مگردانید که هرگز این زنان مؤمن بر آن کفّار و آن شوهران کافر بر این زنان حلال نیستند ولی مهر و نفقه‌ای که شوهران مخارج آن زنان کرده‌اند به آنها بپردازید، و باکی نیست که شما با آنان نکاح کنید در صورتی که اجر و مهرشان را بدهید. و هرگز متوسل به حفاظت (و عقد و پیمان) زنان کافره نشوید و (اگر زنانتان از اسلام به کفر برگشتند و نزد کافران رفتند) از کفّار مهر و نفقه مطالبه کنید، آنها هم (اگر زنانشان ایمان آوردند و نزد شما آمدند) مهر و نفقه طلبند. این حکم خداست که میان شما حکم می‌کند و خدا (به حقایق امور) دانا و (به مصالح خلق) آگاه است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای مؤمنان! هنگامی که زنان مؤمن به سوی شما مهاجرت کردند، ایشان را بیازمائید - خداوند از ایمان آنان آگاه‌تر است (تا شما) - هرگاه ایشان را مؤمن یافتید، آنان را به سوی کافران برنگردانید. این زنان برای آن مردان، و آن مردان برای این زنان حلال نیستند. آنچه را که همسران ایشان (به عنوان مهریّه) خرج کرده‌اند، بدانان مستردّ دارید. گناهی بر شما نخواهد بود اگر چنین زنانی را به ازدواج خود درآورید و مهریّه‌ی ایشان را بپردازید. با زنان کافر (غیر اهل کتاب) ازدواج نکنید و همسران کافر را در همسری خود نگاه ندارید (چرا که با کفرِ شوهر یا همسر، رابطه‌ی زوجیّت به هم می‌خورد. اگر هم همسران شما کافر شدند و به دیار کفر گریختند، از کافران) چیزی را که (به عنوان مهریّه) خرج کرده‌اید درخواست کنید و مردان کافر نیز چیزی را که (به عنوان مهریّه) خرج کرده‌اند درخواست کنند. اینها حکم خدا است، و خدا است که در میانتان فرمانروائی و داوری می‌کند، و او آگاه کار بجا است. [[«مُهَاجِرَاتٍ»: هجرت‌کنندگان. حال است. «أُجُورَ»: جمع أَجْر، به معنی مهریه (نگا: نمونه، المیزان). «عِصَمِ»: جمع عِصْمَة، عقد نکاح. پیوند زناشوئی. «الْکَوَافِرِ»: جمع کافِرَة، زنان کافر و بی‌دین. «لا تُمْسِکُوا بِعِصَمِ الْکَوَافِرِ»: عقد ازدواج زنان کافر را نگاه ندارید و از ایشان بگسلید. مراد دو چیز است: الف - با زنان کافر ازدواج حرام است. ب - همسر کافر شده خود را رها کنید. چرا که مرتد شدن، عقد نکاح را باطل و پیوند زناشوئی را می‌گسلد. «ذلِکُمْ»: این احکام که گذشت. «یَحْکُمُ»: فرمان می‌راند. قضاوت و داوری می‌کند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای مؤمنان هر گاه زنان مؤمن مهاجر به نزد شما آیند، آنان را بیازمایید، خداوند به [حقیقت‌] ایمانشان آگاه‌تر است، پس اگر آنان را مؤمن شناختید دیگر آنان را به سوی کفار باز مگردانید، نه ایشان بر آنان حلال هستند و نه آنان برایشان حلالند، و به آنان آنچه خرج کرده‌اند بدهید، و بر شما گناهی نیست که پس از آنکه مهرهایشان را پرداختید، با آنان ازدواج کنید، و دست در دامان زنان کافر مزنید، و [چون زنان شما نزد آنان روند] آنچه خرج کرده‌اید از آنان [کافران‌] طلب کنید و آنان هم آنچه خرج کرده‌اند از شما طلب کنند، این حکم الهی است که در میان شما داوری می‌کند و خداوند دانای فرزانه است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای کسانی که ایمان آورده‌اید! هنگامی که زنان باایمان بعنوان هجرت نزد شما آیند، آنها را آزمایش کنید -خداوند به ایمانشان آگاهتر است- هرگاه آنان را مؤمن یافتید، آنها را بسوی کفّار بازنگردانید؛ نه آنها برای کفّار حلالند و نه کفّار برای آنها حلال؛ و آنچه را همسران آنها (برای ازدواج با این زنان) پرداخته‌اند به آنان بپردازید؛ و گناهی بر شما نیست که با آنها ازدواج کنید هرگاه مَهرشان را به آنان بدهید و هرگز زنان کافر را در همسری خود نگه ندارید (و اگر کسی از زنان شما کافر شد و به بلاد کفر فرار کرد،) حق دارید مَهری را که پرداخته‌اید مطالبه کنید همان‌گونه که آنها حق دارند مهر زنانشان را که از آنان جدا شده‌اند) از شما مطالبه کنند؛ این حکم خداوند است که در میان شما حکم می‌کند، و خداوند دانا و حکیم است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای آنان که ایمان آوردید اگر آمدند شما را زنان مؤمنان هجرت‌کنندگان پس بیازمائیدشان خدا داناتر است به ایمان آنان پس اگر دانستید ایشان را ایمان‌آرندگان بازنگردانیدشان بسوی کافران نه اینان حلالند آنان را و نه آنان حلالند اینان را و بدهید بدیشان آنچه را هزینه کردند و نیست پروائی بر شما که کابین بندید بر آنان هر گاه دهیدشان مزدهای ایشان را و چنگ نزنید (دل نبندید) به عصمتهای آنان کفرورزنده و بخواهید آنچه هزینه کردید و باید خواهند آنچه هزینه کردند این است حکم خدا که حکم کند میان شما و خدا است دانای حکیم‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى كسانى كه ايمان آورده‌ايد، هر گان زنان با ايمان هجرت‌كنان به نزد شما آيند پس آنان را بيازماييد خداى به ايمانشان داناتر است پس اگر آنان را با ايمان دانستيد، به سوى كافران بازشان مگردانيد. نه اينان براى آنان حلالند و نه آنان براى اينان حلال باشند، و آنچه هزينه كرده‌اند- كابينى كه به اين آنان داده‌اند- بازشان دهيد. و باكى بر شما نيست كه اينان را به زنى گيريد چنانچه كابينشان را به آنان بدهيد. و به عصمت‌هاى- نكاح- آنان كافر شده- و به ارتداد به مكه بازگشته- چنگ مزنيد- يعنى آنان كافر را نگاه مداريد و به همسرى آنها ادامه مدهيد- و آنچه هزينه كرده‌ايد [از آن مردان كافر] بخواهيد و آنها نيز آنچه هزينه كرده‌اند [از شما] بخواهند. اين حكم خداست كه ميان شما حكم مى‌كند و خدا دانا و با حكمت است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای کسانی که ایمان آوردید! هنگامی که زنان باایمان به حال مهاجرت نزدتان آیند، آنان را بیازمایید؛ خدا به ایمان آنان داناتر (از دیگران) است. پس اگر آنان را باایمان دانستید، دیگر ایشان را سوی کافران باز نگردانید؛ نه آن زنان برایشان حلالند و نه آن مردان برای این زنان حلالند. و هر چه خرج (این زنان) کرده‌اند، به شوهرانشان باز پس دهید، و بر شما هیچ گناهی نیست که - در صورتی که مَهرشان را به آنان بدهید - با ایشان ازدواج کنید و عصمت‌های زنان کافر را (در زناشویی خود) بر مگیرید و آنچه را شما (برای زنان کافر خود که به کفّار پناهنده شده‌اند) خرج کرده‌اید (از کافران) مطالبه کنید و آنها هم باید آنچه را (برای زنان هجرت کرده بر خود) خرج کرده‌اند (از شما) مطالبه کنند. این حکم خداست (که) میان شما داوری می‌کند و خدا بس دانایی حکیم است."}, {"lang": "en", "name": "Ahmed Ali", "text": "O believers, when believing women come over to you as refugees, then examine them. God alone is cognisant of their faith. If you find that they are believers, do not send them back to unbelievers. They are not lawful for them, nor are infidels lawful for believing women. Give the unbelievers what they have spent on them. There is no sin if you marry them provided you give their dowers to them. Do not retain your (marriage) ties with unbelieving women. Ask for the return of what you have spent (on them); and the unbelievers should ask for the return of what they have spent. This is the judgement of God. He judges between you. God is all-knowing and all-wise."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O People who Believe! When Muslim women leave the lands of disbelief and migrate towards you, examine them; Allah knows more about their faith; so if you judge the women to be believers, do not send them back to the disbelievers; neither are they lawful for the disbelievers, nor are the disbelievers lawful for them; and give their disbelieving husbands what they had spent; and there is no sin upon you to marry them if you give them their bridal money; and do not continue the marriage with disbelieving women – and ask for what you had spent, and the disbelievers may ask for what they had spent; this is Allah’s command; He judges between you; and Allah is All Knowing, Wise."}, {"lang": "en", "name": "A. J. Arberry", "text": "O believers, when believing women come to you as emigrants, test them. God knows very well their belief. Then, if you know them to be believers, return them not to the unbelievers. They are not permitted to the unbelievers, nor are the unbelievers permitted to them. Give the unbelievers what they have expended; and there is no fault in you to marry them when you have given them their wages. Do not hold fast to the ties of unbelieving women, and ask what you have expended, and let them ask what they have expended. That is God's judgment; He judges between you; and God is All-knowing, All-wise."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "O ye who believe! when believing women come Unto you as emigrants examine them. Allah is the best Knower of their faith. Then if ye know them to be true believers, send them not back Unto the infidels; they are not lawful Unto them, nor are they lawful Unto them. And give them that which they have expended. Nor is it any crime in you if ye marry them when ye have given their hires. And hold not to the ties of the infidel women, and ask back that which ye have expended, and let them ask back that which they have expended. That is the judgment of Allah; He judgeth between you, And Allah is Knowing, Wise."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O you who believe! When believing women come to you as emigrants, examine them, Allah knows best as to their Faith, then if you ascertain that they are true believers, send them not back to the disbelievers, they are not lawful (wives) for the disbelievers nor are the disbelievers lawful (husbands) for them. But give the disbelievers that (amount of money) which they have spent [as their Mahr] to them. And there will be no sin on you to marry them if you have paid their Mahr to them. Likewise hold not the disbelieving women as wives, and ask for (the return of) that which you have spent (as Mahr) and let them (the disbelievers, etc.) ask back for that which they have spent. That is the Judgement of Allah. He judges between you. And Allah is All-Knowing, All-Wise."}, {"lang": "en", "name": "Talal Itani", "text": "O you who believe! When believing women come to you emigrating, test them. God is Aware of their faith. And if you find them to be faithful, do not send them back to the unbelievers. They are not lawful for them, nor are they lawful for them. But give them what they have spent. You are not at fault if you marry them, provided you give them their compensation. And do not hold on to ties with unbelieving women, but demand what you have spent, and let them demand what they have spent. This is the rule of God; He rules among you. God is Knowing and Wise."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Believers, when believing women come to you as Emigrants (in the cause of faith), examine them. Allah fully knows (the truth) concerning their faith. And when you have ascertained them to be believing women, do not send them back to the unbelievers. Those women are no longer lawful to the unbelievers, nor are those unbelievers lawful to those (believing) women. Give their unbelieving husbands whatever they have spent (as bridal-dues); and there is no offence for you to marry those women if you give them their bridal-dues. Do not hold on to your marriages with unbelieving women: ask for the return of the bridal-due you gave to your unbelieving wives and the unbelievers may ask for the return of the bridal-due they had given to their believing wives. Such is Allah's command. He judges between you. Allah is All-Knowing, Most Wise."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O you who believe! When believing women come to you as emigrants, examine them; Allah knows best as to their faith, then if you ascertain that they are true believers, send them not back to the disbelievers. They are not lawful for the disbelievers nor are the disbelievers lawful for them. But give them (disbelievers) that which they have spent (on their dowery). And there will be no sin on you to marry them if you have paid their due to them. Likewise do not keep the disbelieving women, and ask for that which you have spent (on their dowery) and let them (the disbelievers) ask for that which they have spent. That is the judgement of Allah, He judges between you. And Allah is All-Knowing, All-Wise."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O ye who believe! When believing women come unto you as fugitives, examine them. Allah is Best Aware of their faith. Then, if ye know them for true believers, send them not back unto the disbelievers. They are not lawful for them (the disbelievers), nor are they (the disbelievers) lawful for them. And give them (the disbelievers) that which they have spent (upon them). And it is no sin for you to marry such women when ye have given them their dues. And hold not to the ties of disbelieving women; and ask for (the return of) that which ye have spent; and let them (the disbelievers) ask for that which they have spent. That is the judgment of Allah. He judgeth between you. Allah is Knower, Wise."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O you who have faith! When faithful women come to you as immigrants, test them. Allah knows best [the state of] their faith. Then, if you ascertain them to be [genuinely] faithful women, do not send them back to the faithless. They are not lawful for them, nor are they lawful for them, but give them what [dowry] they have spent [for them]. There is no sin upon you in marrying them when you have given them their dowries. Do not hold on to [conjugal] ties with faithless women. Demand [from the infidels] what you have spent [as dowries], and let the faithless demand [from you] what they have spent [as dowries]. That is Allah’s judgment; He judges between you, and Allah is all-knowing, all-wise."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believers, when believing women come to you as emigrants, test them. Allah best knows their belief. If you find them to be believers do not return them to the unbelievers; they are not permitted to the unbelievers, nor are the unbelievers permitted to them. But give back to the unbelievers what they have spent, and there is no fault in you to marry such women, provided you give them their dowries. Do not hold on to the ties with unbelieving women, ask what you have spent and let them ask what they have spent. Such is the Judgement of Allah; He judges between you; and Allah is the Knower, and the Wise."}, {"lang": "en", "name": "Saheeh International", "text": "O you who have believed, when the believing women come to you as emigrants, examine them. Allah is most knowing as to their faith. And if you know them to be believers, then do not return them to the disbelievers; they are not lawful [wives] for them, nor are they lawful [husbands] for them. But give the disbelievers what they have spent. And there is no blame upon you if you marry them when you have given them their due compensation. And hold not to marriage bonds with disbelieving women, but ask for what you have spent and let them ask for what they have spent. That is the judgement of Allah; He judges between you. And Allah is Knowing and Wise."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Believers, when believing immigrant women come to you, test them. God knows best about their faith. If you know that they are believers, do not return them to the disbelievers. Such women are not lawful for them and disbelievers are not lawful for such women. Give the disbelievers whatever they have spent (on such women for their dowry). There is no offense for you to marry them if you agree to give them their dowry. Do not hold unto your disbelieving wives; you may get back what you have spent on them for their dowry and the disbelievers may also ask for what they have spent. This is the command of God by which He judges you. God is All-knowing and All-wise."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O you who believe! when believing women come to you flying, then examine them; Allah knows best their faith; then if you find them to be believing women, do not send them back to the unbelievers, neither are these (women) lawful for them, nor are those (men) lawful for them, and give them what they have spent; and no blame attaches to you in marrying them when you give them their dowries; and hold not to the ties of marriage of unbelieving women, and ask for what you have spent, and let them ask for what they have spent. That is Allah's judgment; He judges between you, and Allah is Knowing, Wise."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo i<u>tha</u> j<u>a</u>akumu almumin<u>a</u>tu muh<u>a</u>jir<u>a</u>tin fa<b>i</b>mta<u>h</u>inoohunna All<u>a</u>hu aAAlamu bieem<u>a</u>nihinna fain AAalimtumoohunna mumin<u>a</u>tin fal<u>a</u> tarjiAAoohunna il<u>a</u> alkuff<u>a</u>ri l<u>a</u> hunna <u>h</u>illun lahum wal<u>a</u> hum ya<u>h</u>illoona lahunna wa<u>a</u>toohum m<u>a</u> anfaqoo wal<u>a</u> jun<u>ah</u>a AAalaykum an tanki<u>h</u>oohunna i<u>tha</u> <u>a</u>taytumoohunna ojoorahunna wal<u>a</u> tumsikoo biAAi<u>s</u>ami alkaw<u>a</u>firi wa<b>i</b>saloo m<u>a</u> anfaqtum walyasaloo m<u>a</u> anfaqoo <u>tha</u>likum <u>h</u>ukmu All<u>a</u>hi ya<u>h</u>kumu baynakum wa<b>A</b>ll<u>a</u>hu AAaleemun <u>h</u>akeem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believers! When believing women come to you as refugees, submit them to a test. Their faith is best known to God. Then if you find them to be true believers, do not send them back to those who deny the truth. These [women] are not lawful for them, nor are those who deny the truth lawful for these women. But hand back to those who deny the truth the dowers they gave them; nor is it an offence for you to marry such women, provided you give them their dowers. Do not maintain your marriages with those women who deny the truth: demand repayment of the dowers you have given them and let the disbelievers ask for the return of what they have spent. Such is God's judgement; He judges with justice between you. God is all knowing and all wise."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O ye who believe! When there come to you believing women refugees, examine (and test) them: Allah knows best as to their Faith: if ye ascertain that they are Believers, then send them not back to the Unbelievers. They are not lawful (wives) for the Unbelievers, nor are the (Unbelievers) lawful (husbands) for them. But pay the Unbelievers what they have spent (on their dower), and there will be no blame on you if ye marry them on payment of their dower to them. But hold not to the guardianship of unbelieving women: ask for what ye have spent on their dowers, and let the (Unbelievers) ask for what they have spent (on the dowers of women who come over to you). Such is the command of Allah: He judges (with justice) between you. And Allah is Full of Knowledge and Wisdom."}]}, {"index": 5161, "local_index": 11, "part_type": "Verse", "path": "/books/quran:60:11", "text": "وَ إِنْ‌ فَاتَکُمْ‌ شَيْ‌ءٌ مِنْ‌ أَزْوَاجِکُمْ‌ إِلَى‌ الْکُفَّارِ فَعَاقَبْتُمْ‌ فَآتُوا الَّذِينَ‌ ذَهَبَتْ‌ أَزْوَاجُهُمْ‌ مِثْلَ‌ مَا أَنْفَقُوا وَ اتَّقُوا اللَّهَ‌ الَّذِي‌ أَنْتُمْ‌ بِهِ‌ مُؤْمِنُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "اگر برخی از همسران شما با پیوستن به کفار از دست شما رفتند [و کافران مهریه مورد مطالبه شما را ندادند] و شما غنیمتی یافتید، پس به کسانی که همسرانشان را [به خاطر پیوستن به کفار] از دست داده اند، معادل مهریه ای که داده اند از غنایم بپردازید، و از خدایی که به او ایمان دارید پروا کنید."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و اگر يكى از زنان شما به كفار پيوست و آنگاه به انتقام از كافران برخاستيد، به كسانى كه زنانشان رفته‌اند به ميزان هزينه‌اى كه كرده‌اند بپردازيد و از خدايى كه به او ايمان آورده‌ايد بترسيد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و اگر يكى از همسران شما از دستتان رفت و به كفار پيوست و [آنها مهر مورد مطالبه شما را ندادند و شما از كفار] غنيمت يافتيد، پس به كسانى كه همسرانشان رفته‌اند معادل آنچه خرج كرده‌اند [از غنايم‌] بپردازيد. و از خدايى كه به او ايمان داريد بترسيد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و در صورتى كه [زنى‌] از همسران شما به سوى كفار رفت [و كفار مَهر مورد مطالبه شما را ندادند] و شما غنيمت يافتيد؛ پس به كسانى كه همسرانشان رفته‌اند، معادل آنچه خرج كرده‌اند بدهيد، و از آن خدايى كه به او ايمان داريد بترسيد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و اگر از زنان شما کسانی (مرتد شده) به سوی کافران رفتند و شما در مقام انتقام بر آمدید و غنیمت بردید، به مردانی که زنانشان رفته‌اند به قدر همان مهر و نفقه‌ای که خرج کرده‌اند بدهید، و از خدایی که به او ایمان آورده‌اید بترسید و پرهیزکار شوید."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "اگر همسری از همسرانتان به سوی کافران رفت (و مرتدّ گردید، و کافران مهریّه‌ی شما را بازپرداخت نکردند) و شما (با ایشان جنگیدید و مغلوبشان کردید و) به عقوبت گرفتارشان ساختید، (ای سران و سرداران مؤمنان، از غنائم آن کافران) مهریّه‌ای را که چنین مؤمنانی پرداخته‌اند به اینان بازپرداخت کنید، و از خداوندی بهراسید که شما بدو ایمان دارید. [[«فَاتَکُمْ»: از دست شما بدر رفت. «شَیْءٌ»: چیزی. مراد همسر نامحترم و ناقابلی است که به میان کفار گریخته است و کفر را بر دین ترجیح داده است. «عَاقَبْتُمْ»: به عقاب گرفتار کردید. یعنی جنگیدید و کافران را به عقوبتِ شکست و اسارت مبتلا ساختید. «آتُوا»: مخاطب، سران و رؤسای مؤمنین و کاربدستان مسلمین است (نگا: المصحف المیسر).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و اگر از دست شما زنی به سوی کافران رود، و سپس با آنان تلافی کردید و غنیمت گرفتید، آنگاه به کسانی که همسرانشان [به سوی کفار] رفته‌اند، معادل خرجی را که کرده‌اند [از غنایم‌] بپردازید، و از خداوندی که شما به او ایمان دارید پروا کنید"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اگر بعضی از همسران شما از دستتان بروند (و به سوی کفار بازگردند) و شما در جنگی بر آنان پیروز شدید و غنایمی گرفتید، به کسانی که همسرانشان رفته‌اند، همانند مهری را که پرداخته‌اند بدهید؛ و از (مخالفت) خداوندی که همه به او ایمان دارید بپرهیزید!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و اگر از دست شما رفت چیزی از زنان شما بسوی کافران پس در برابر از آنان برده گرفتید پس بپردازید بدانان که رفتند همسرانشان مانند آنچه را هزینه کردند و بترسید خداوندی را که شمائید بدو ایمان‌آرندگان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و اگر كسى از زنان شما سوى كافران رفت- به كفار پيوست و هزينه شما به دستتان نيامد- سپس غنيمتى [از كافران‌] به دست آورديد، پس به كسانى كه زنانشان رفته‌اند مانند آنچه هزينه كرده‌اند بدهيد، و از خداى كه به او ايمان داريد پروا كنيد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و اگر کسی از همسرانتان سوی کفّار رفت، پس پیگیری کردید، در نتیجه به کسانی که همسران‌شان (از دستشان) رفته‌اند، برابر آنچه خرج کرده‌اند بازدهید. و از آن خدایی که به او ایمان دارید بهراسید."}, {"lang": "en", "name": "Ahmed Ali", "text": "If any of your women go away to the unbelievers, and you succeed in your turn (and have a chance of getting spoils), then give to those whose wives have so gone away as much as they had spent on them; but take heed and fear God in whom you believe."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And if some women go away from the Muslims to the disbelievers – then when you punish the disbelievers, give from the war booty to the Muslims who lost their wives the amount they had spent; and fear Allah in Whom you believe."}, {"lang": "en", "name": "A. J. Arberry", "text": "And if any of your wives slips away from you to the unbelievers, and then you retaliate, give those whose wives have gone away the like of what they have expended. And fear God, in whom you believe."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And if any of your wives hath been left with the infidels, and then ye have retaliated, then give Unto those whose wives have gone away the like of that which they have expended, and fear Allah in whom ye are believers."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And if any of your wives have gone from you to the disbelievers, and you have an accession (by the coming over of a woman from the other side), then pay to those whose wives have gone, the equivalent of what they had spent (on their Mahr). And fear Allah in Whom you believe."}, {"lang": "en", "name": "Talal Itani", "text": "If any of your wives desert you to the unbelievers, and you decide to penalize them, give those whose wives have gone away the equivalent of what they had spent. And fear God, in whom you are believers."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "And if you fail to receive from the unbelievers a part of the bridal-due of your disbelieving wives, and then your turn comes, pay to those who have been left on the other side an amount the like of the bridal-due that they have paid. And have fear of Allah in Whom you believe."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And if any of your wives have gone from you to the disbelievers then you succeed over them (gain victory); then pay those whose wives have gone, the equivalent of what they had spent. And have Taqwa of Allah, the One in Whom you are believers."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And if any of your wives have gone from you unto the disbelievers and afterward ye have your turn (of triumph), then give unto those whose wives have gone the like of that which they have spent, and keep your duty to Allah in Whom ye are believers."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "If anything [of the dowries] pertaining to your wives is not reclaimed from the faithless and then you have your turn, then give to those whose wives have left the like of what they have spent, and be wary of Allah in whom you have faith."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "If any of your wives desert you to be with the unbelievers and you retaliate, give those whose wives who have deserted the equivalent of what they have spent. And fear Allah in whom you believe."}, {"lang": "en", "name": "Saheeh International", "text": "And if you have lost any of your wives to the disbelievers and you subsequently obtain [something], then give those whose wives have gone the equivalent of what they had spent. And fear Allah, in whom you are believers."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "If your wives go away from you to disbelievers who will not give you back the dowry which you spent on them, let the Muslims pay back such dowry from the property of the disbelievers which may come into their hands. Have fear of God in whom you believe."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And if anything (out of the dowries) of your wives has passed away from you to the unbelievers, then your turn comes, give to those whose wives have gone away the like of what they have spent, and be careful of (your duty to) Allah in Whom you believe."}, {"lang": "en", "name": "English Transliteration", "text": "Wain f<u>a</u>takum shayon min azw<u>a</u>jikum il<u>a</u> alkuff<u>a</u>ri faAA<u>a</u>qabtum fa<u>a</u>too alla<u>th</u>eena <u>th</u>ahabat azw<u>a</u>juhum mithla m<u>a</u> anfaqoo wa<b>i</b>ttaqoo All<u>a</u>ha alla<u>th</u>ee antum bihi muminoon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "If any of your wives desert you to go over to the disbelievers, and you subsequently have your turn, [by the coming over of a woman from the other side] give to those  who have been deserted by their wives the equivalent of the dowers they gave them. Fear God in whom you believe."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "And if any of your wives deserts you to the Unbelievers, and ye have an accession (by the coming over of a woman from the other side), then pay to those whose wives have deserted the equivalent of what they had spent (on their dower). And fear Allah, in Whom ye believe."}]}, {"index": 5162, "local_index": 12, "part_type": "Verse", "path": "/books/quran:60:12", "text": "يَا أَيُّهَا النَّبِيُ‌ إِذَا جَاءَکَ‌ الْمُؤْمِنَاتُ‌ يُبَايِعْنَکَ‌ عَلَى‌ أَنْ‌ لاَ يُشْرِکْنَ‌ بِاللَّهِ‌ شَيْئاً وَ لاَ يَسْرِقْنَ‌ وَ لاَ يَزْنِينَ‌ وَ لاَ يَقْتُلْنَ‌ أَوْلاَدَهُنَ‌ وَ لاَ يَأْتِينَ‌ بِبُهْتَانٍ‌ يَفْتَرِينَهُ‌ بَيْنَ‌ أَيْدِيهِنَ‌ وَ أَرْجُلِهِنَ‌ وَ لاَ يَعْصِينَکَ‌ فِي‌ مَعْرُوفٍ‌ فَبَايِعْهُنَ‌ وَ اسْتَغْفِرْ لَهُنَ‌ اللَّهَ‌ إِنَ‌ اللَّهَ‌ غَفُورٌ رَحِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای پیامبر! هنگامی که زنان باایمان نزد تو آیند تا [بر پایه این شرایط] با تو بیعت کنند که چیزی را با خدا شریک نگیرند، و دزدی نکنند، و مرتکب زنا نشوند، و فرزندان خود را نکشند، و طفل حرام زاده خود را به دروغ و افترا به شوهرانشان نبندند، و در هیچ کار پسندیده ای از تو سرپیچی نکنند، با آنان بیعت کن و از خدا برای آنان آمرزش بخواه؛ زیرا خدا بسیار آمرزنده و مهربان است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى پيامبر، اگر زنان مؤمن نزد تو آمدند تا بيعت كنند، بدين شرط كه هيچ كس را با خدا شريك نكنند و دزدى نكنند و زنا نكنند و فرزندان خود را نكشند و فرزندى را كه از آن شوهرشان نيست به دروغ به او نسبت ندهند و در كارهاى نيك نافرمانى تو نكنند، با آنها بيعت كن و برايشان از خدا آمرزش بخواه، كه خدا آمرزنده و مهربان است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى پيامبر! چون زنان با ايمان نزد تو آيند و با تو بيعت كنند كه چيزى را با خدا شريك نسازند و دزدى و زنا نكنند و فرزندان خود را نكشند و فرزندى نامشروع پيش دست و پاى خود نياورند كه به دروغ [به شوهران خود] ببندند، و در كار نيك نافرمانى تو نكنند، با آنها ب"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى پيامبر، چون زنان باايمان نزد تو آيند كه [با اين شرط] با تو بيعت كنند كه چيزى را با خدا شريك نسازند، و دزدى نكنند، و زنا نكنند، و فرزندان خود را نكشند، و بچه‌هاى حرامزاده پيش دست و پاى خود را با بهتان [و حيله‌] به شوهر نبندند، و در [كار] نيك از تو نافرمانى نكنند، با آنان بيعت كن و از خدا براى آنان آمرزش بخواه، زيرا خداوند آمرزنده مهربان است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "الا ای پیغمبر (گرامی) چون زنان مؤمن آیند که با تو بیعت کنند که دیگر هرگز شرک به خدا نیاورند و سرقت و زنا کاری نکنند و اولاد خود را به قتل نرسانند و بر کسی افترا و بهتان میان دست و پای خود نبندند (یعنی فرزندی را که میان دست و پای خود پرورده و علم به آن از انعقاد نطفه او دارند به دروغ به کسی غیر پدرش نبندند) و با تو در هیچ امر معروفی مخالفت نکنند، بدین شرایط با آنها بیعت کن و بر آنان از خدا آمرزش و غفران طلب، که خدا بسیار آمرزنده و مهربان است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای پیغمبر! هنگامی که زنان مؤمن، پیش تو بیایند و بخواهند با تو بیعت کنند و پیمان بندند بر این که: چیزی را شریک خدا نسازند، و دزدی نکنند، و مرتکب زنا نشوند، و فرزندانشان را نکشند، و به دروغ فرزندی را به خود و شوهر خود نسبت ندهند که زاده‌ی ایشان نیست، و در کار نیکی (که آنان را بدان فرامی‌خوانی) از تو نافرمانی نکنند، با ایشان بیعت کن و پیمان ببند و برایشان از خدا آمرزش بخواه. مسلّماً خدا آمرزگار و مهربان است (و مغفرت و مرحمت خود را شامل چنین بانوانی می‌گرداند). [[«وَ لا یَقْتُلْنَ أَوْلادَهُنَّ»: مراد زنده‌بگور کردن فرزندان، کشتن جنین در شکم، کشتن اولاد از ترس فقر و تنگدستی.و ... «بُهْتَانٍ»: در اینجا مراد فرزندی است که زن ادعاء کند که او از شوهرش می‌باشد و در حقیقت متعلق بدو نباشد. تهمت زنا. «بَیْنَ أَیْدِیهِنَّ وَ أَرْجُلِهِنَّ»: کنایه از این است که زن ادعاء کند که چنین فرزندی زاده او است و متعلق به شوهرش می‌باشد. چرا که فرزند در شکم حمل می‌گردد و شکم میان دو دست بوده و همچنین فرزند از میان دو پا، پای به دنیا می‌گذارد (نگا: المصحف المیسر، قاسمی). اصلاً دست و پا کنایه از خود شخص است. در این صورت معنی چنین نیز خواهد بود: از پیش خود تهمت زنا به کسی ندهند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای پیامبر چون زنان مؤمن به نزد تو آمدند که با تو بیعت کنند که برای خداوند شریکی نیاورند و دزدی نکنند و زنا نکنند و فرزندانشان را نکشند و فرزندی را از راه بهتان به دست نیاورند که نسبت آن را به دست و پای خویش دهند، و در کار خیری از تو نافرمانی نکنند، پس با آنان بیعت کن و برایشان از خداوند آمرزش بخواه، چرا که خداوند آمرزگار مهربان است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای پیامبر! هنگامی که زنان مؤمن نزد تو آیند و با تو بیعت کنند که چیزی را شریک خدا قرار ندهند، دزدی و زنا نکنند، فرزندان خود را نکشند، تهمت و افترایی پیش دست و پای خود نیاورند و در هیچ کار شایسته‌ای مخالفت فرمان تو نکنند، با آنها بیعت کن و برای آنان از درگاه خداوند آمرزش بطلب که خداوند آمرزنده و مهربان است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای پیمبر هر گاه آیندت زنان ایمان‌آورنده که با تو پیمان بندند (بیعت کنند) بر آنکه شرک نورزند به خدا چیزی را و نه دزدی کنند و نه زنا کنند و نکشند فرزندان خویش را و نیاورند دروغی (تهمتی) که بربندندش در باره دستهای خویش و پایهای خویش و نافرمانیت نکنند در خوبی پس پیمان بند (بیعت کن) با ایشان و آمرزش خواه برای ایشان از خدا همانا خدا است آمرزنده مهربان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى پيامبر، هر گاه زنان مؤمن نزد تو آيند كه با تو بيعت كنند بر اين شرط كه چيزى را با خداى انباز نگيرند و دزدى و زنا نكنند و فرزندان خود را نكشند و دروغى را كه در ميان دستها و پاهاشان فرابافته باشند پيش نيارند- يعنى به شوهرانشان جز فرزندان خود ايشان را نسبت ندهند- و در هيچ كار نيكو و پسنديده‌اى- كه ايشان را فرمايى- نافرمانى تو نكنند، پس با آنها بيعت كن و برايشان از خداى آمرزش بخواه، كه خدا آمرزگار و مهربان است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای پیامبر! هنگامی که زنان باایمان نزد تو آیند در حالی که با تو بیعت می‌کنند که چیزی را با خدا شریک نسازند و دزدی ننمایند و زنا نکنند و فرزندان خود را نکشند و (بچه‌های حرام‌زاده‌ی) پیش دست و پای خود را با بهتان (و حیله) به شوهرانشان نبندند. و در (کار) معروف و پسندیده‌ی ایمانی، تو را نافرمانی نکنند، پس با آنان بیعت کن و از خدا برایشان پوشش بخواه (که) بی‌گمان خدا بسی پوشنده‌ی رحمتگر بر ویژگان است."}, {"lang": "en", "name": "Ahmed Ali", "text": "O Prophet, when believing women come to you and swear on oath that they will not associate anything with God, nor steal, nor fornicate, nor kill their children, nor accuse others for what they have fabricated themselves, nor disobey you in any rightful thing, then you should accept their allegiance, and ask forgiveness of God for them. Certainly God is forgiving and kind."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O dear Prophet (Mohammed – peace and blessings be upon him)! If Muslim women come humbly to you to take oath of allegiance that they will neither ascribe any partner to Allah, nor steal, nor commit adultery, nor kill their children, nor bring the lie that they carry between their hands and feet, nor disobey you in any rightful matter – then accept their allegiance and seek forgiveness from Allah for them; indeed Allah is Oft Forgiving, Most Merciful."}, {"lang": "en", "name": "A. J. Arberry", "text": "O Prophet, when believing women come to thee, swearing fealty to thee upon the terms that they will not associate with God anything, and will not steal, neither commit adultery, nor slay their children, nor bring a calumny they forge between their hands and their feet, nor disobey thee in aught honourable, ask God's forgiveness for them; God is All-forgiving, All-compassionate."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "O Prophet! when believing women come Unto thee swearing fealty Unto thee, that they shall not associate aught with Allah, nor they shall steal, nor they shall commit fornication, nor they shall slay their children, nor they shall produce any falsehood that they have fabricated between their hands and feet, nor they shall disobey thee in anything reputable, then accept thou their fealty, and pray to Allah for their forgiveness. Verily Allah is Forgiving, Merciful."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O Prophet! When believing women come to you to give you the Bai'a (pledge), that they will not associate anything in worship with Allah, that they will not steal, that they will not commit illegal sexual intercourse, that they will not kill their children, that they will not utter slander, intentionally forging falsehood (i.e. by making illegal children belonging to their husbands), and that they will not disobey you in any Ma'ruf (Islamic Monotheism and all that which Islam ordains) then accept their Bai'a (pledge), and ask Allah to forgive them, Verily, Allah is Oft-Forgiving, Most Merciful."}, {"lang": "en", "name": "Talal Itani", "text": "O prophet! If believing women come to you, pledging allegiance to you, on condition that they will not associate anything with God, nor steal, nor commit adultery, nor kill their children, nor commit perjury as to parenthood, nor disobey you in anything righteous, accept their allegiance and ask God’s forgiveness for them. God is Forgiving and Merciful."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "O Prophet, when believing women come to you and pledge to you that they will not associate aught with Allah in His Divinity, that they will not steal, that they will not commit illicit sexual intercourse, that they will not kill their children, that they will not bring forth a calumny between their hands and feet, and that they will not disobey you in anything known to be good, then accept their allegiance and ask Allah to forgive them. Surely Allah is Most Forgiving, Most Compassionate."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O Prophet! When the believing women come to you pledging to you that they will not associate anything with Allah, and that they will not steal, and that they will not commit Zina, and that they will not kill their children, and that they will not utter slander, fabricating from between their hands and their feet, and that they will not disobey you in Ma`ruf (good), Allah said to the faithful believers,"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O Prophet! If believing women come unto thee, taking oath of allegiance unto thee that they will ascribe no thing as partner unto Allah, and will neither steal nor commit adultery nor kill their children, nor produce any lie that they have devised between their hands and feet, nor disobey thee in what is right, then accept their allegiance and ask Allah to forgive them. Lo! Allah is Forgiving, Merciful."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O Prophet! If faithful women come to you, to take the oath of allegiance to you, [pledging] that they shall not ascribe any partners to Allah, that they shall not steal, nor commit adultery, nor kill their children, nor utter any slander that they may have intentionally fabricated, nor disobey you in what is right, then accept their allegiance, and plead for them to Allah for forgiveness. Indeed Allah is all-forgiving, all-merciful"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "O Prophet, when believing women come to you and swear loyalty to you upon the condition that they will not associate anything with Allah, and will notsteal, nor commit adultery, nor slay their children, nor fabricate slander between their hands and their feet, nor disobey you in any honorable thing, supplicate to Allah for forgiveness for them, Allah is the Forgiving and the Most Merciful."}, {"lang": "en", "name": "Saheeh International", "text": "O Prophet, when the believing women come to you pledging to you that they will not associate anything with Allah, nor will they steal, nor will they commit unlawful sexual intercourse, nor will they kill their children, nor will they bring forth a slander they have invented between their arms and legs, nor will they disobey you in what is right - then accept their pledge and ask forgiveness for them of Allah. Indeed, Allah is Forgiving and Merciful."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Prophet, when believing women come to you pledging not to consider anything equal to God, not to steal, or to commit fornication, not to kill their children, or to bring false charges against anyone (such as ascribing others children to their husbands), and not to disobey you in lawful matters, accept their pledge, and ask forgiveness for them from God. God is All-forgiving and All-merciful."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O Prophet! when believing women come to you giving you a pledge that they will not associate aught with Allah, and will not steal, and will not commit fornication, and will not kill their children, and will not bring a calumny which they have forged of themselves, and will not disobey you in what is good, accept their pledge, and ask forgiveness for them from Allah; surely Allah is Forgiving, Merciful."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> a<b>l</b>nnabiyyu i<u>tha</u> j<u>a</u>aka almumin<u>a</u>tu yub<u>a</u>yiAAnaka AAal<u>a</u> an l<u>a</u> yushrikna bi<b>A</b>ll<u>a</u>hi shayan wal<u>a</u> yasriqna wal<u>a</u> yazneena wal<u>a</u> yaqtulna awl<u>a</u>dahunna wal<u>a</u> yateena bibuht<u>a</u>nin yaftareenahu bayna aydeehinna waarjulihinna wal<u>a</u> yaAA<u>s</u>eenaka fee maAAroofin fab<u>a</u>yiAAhunna wa<b>i</b>staghfir lahunna All<u>a</u>ha inna All<u>a</u>ha ghafoorun ra<u>h</u>eem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "O Prophet! When believing women come to you and pledge themselves not to associate in worship any other thing with God, not to steal or commit adultery or kill their children or indulge in slander, intentionally inventing falsehoods, and not to disobey you in that which is right, then accept their pledge of allegiance and pray to God to forgive them their sins, for God is forgiving and merciful."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O Prophet! When believing women come to thee to take the oath of fealty to thee, that they will not associate in worship any other thing whatever with Allah, that they will not steal, that they will not commit adultery (or fornication), that they will not kill their children, that they will not utter slander, intentionally forging falsehood, and that they will not disobey thee in any just matter,- then do thou receive their fealty, and pray to Allah for the forgiveness (of their sins): for Allah is Oft-Forgiving, Most Merciful."}]}, {"index": 5163, "local_index": 13, "part_type": "Verse", "path": "/books/quran:60:13", "text": "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا لاَ تَتَوَلَّوْا قَوْماً غَضِبَ‌ اللَّهُ‌ عَلَيْهِمْ‌ قَدْ يَئِسُوا مِنَ‌ الْآخِرَةِ کَمَا يَئِسَ‌ الْکُفَّارُ مِنْ‌ أَصْحَابِ‌ الْقُبُورِ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای مؤمنان! با قومی که خدا بر آنان خشم گرفته، دوستی نکنید. آنان به یقین از آخرت مأیوسند، همان گونه که کافران مدفون در قبرها [که به سرانجام شوم خود رسیده اند، از نجات خویش] مأیوسند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى كسانى كه ايمان آورده‌ايد، با مردمى كه خدا بر آنها خشم گرفته است دوستى مكنيد. اينان از آخرت نوميدند، همچنان كه آن كافرانى كه اينك در گورند از آخرت نوميدند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى كسانى كه ايمان آورده‌ايد! مردمى را كه خدا بر آنها خشم گرفته به دوستى مگيريد. همانا از آخرت نوميدند [چون منكر آنند]، همان گونه كه كافران از [باز آمدن‌] اهل قبور نوميدند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى كسانى كه ايمان آورده‌ايد، مردمى را كه خدا بر آنان خشم رانده، به دوستى مگيريد. آنها واقعاً از آخرت سلب اميد كرده‌اند، همان گونه كه كافران اهل گور قطع اميد نموده‌اند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "الا ای اهل ایمان، هرگز قومی را که خدا بر آنان غضب کرده (یعنی جهودان را) یار و دوستدار خود مگیرید که آنها از عالم آخرت به کلی مأیوسند چنانکه کافران از اهل قبور نومیدند (یعنی فرقی میان جهودان و اهل کتاب که خود را معتقد به خدا و قیامت می‌دانند با کافران بی‌عقیده در مقام عمل هیچ نیست که هیچ کدام طالب آخرت و در فکر قیامت ابدا نیستند)."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای مؤمنان! گروهی را به دوستی نگیرید که خدا بر آنان خشمگین است. (چرا که با حق و حقیقت دشمنی می‌ورزند، و با اسلام سر جنگ دارند، و به فساد و گناه افتخار می‌کنند). آن کافران بدان سان که از مردگان قطع امید کرده‌اند (که زنده نمی‌شوند و به دنیا برنمی‌گردند) از آخرت قطع امید کرده‌اند (و به وجود آن و طبعاً به حساب و کتاب و جزا و سزای در آن، ایمان ندارند). [[«قَوْماً»: مراد از چنین مردمانی کسانیند با دو صفت عمده: الف - خدا بر آنان خشمگین است. ب - به آخرت ایمان ندارند، بدان گونه که به برگشتن مردگان به پیش خود ایمان ندارند. «الْکُفَّارُ»: مراد همان قوم مغضوب و نومید از آخرت است. ذکر اسم ظاهر بجای ضمیر برای مسجّل کردن کفرشان و اشاره به خشم فراوان خدا بر آنان است. برخی هم آیه را چنین معنی کرده‌اند: ای مؤمنان! مردمانی را به دوستی نگیرید که خدا بر آنان خشمگین است. مردمانی که همچون کفار که از مردگان قطع امید کرده‌اند، آنان از آخرت قطع امید کرده‌اند. یا این که حرف (مِنْ) را بیانیه دانسته و گفته‌اند: ای مؤمنان! مردمانی را به دوستی نگیرید که خدا از آنان خشمگین است. مردمانی که از آخرت ناامیدند، همان گونه که کافران مرده و مدفون در گورستانها قبلاً بر این باور بودند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای مؤمنان قومی را که خداوند بر آنان خشم آورده است، به دوستی مگیرید، که از آخرت به همان گونه نومیدند که کافران از بازگشت در گور خفتگان‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای کسانی که ایمان آورده‌اید! با قومی که خداوند آنان را مورد غضب قرار داده دوستی نکنید؛ آنان از آخرت مأیوسند همان‌گونه که کفار مدفون در قبرها مأیوس می‌باشند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای آنان که ایمان آوردید دوستی نکنید با گروهی که خشم آورد خدا بر ایشان همانا نومید شدند از آخرت چنانکه نومید شدند کافران از یاران گورستان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى كسانى كه ايمان آورده‌ايد، گروهى را كه خداوند بر آنها خشم گرفته است- يعنى جهودان را- به دوستى مگيريد، همانا آنان از [پاداش‌] آن جهان نوميدند چنانكه كافران از اهل گورها- از بازآمدن مردگان خود- نوميدند- زيرا رستاخيز را باور ندارند-."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای کسانی که ایمان آوردید! مردمی را که خدا بر آنان خشم کرده هرگز به دوستی و سرپرستی برنگیرید. آنان بی‌گمان از آخرت نومید شدند، همان گونه که کافران از صاحبان گورها نومید شدند."}, {"lang": "en", "name": "Ahmed Ali", "text": "O you who believe, do not make friends with those who have suffered the anger of God by having become despondent of the life to come like those unbelievers who are despondent of those who are in the graves."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O People who Believe! Do not befriend the people upon whom is Allah’s wrath – they have lost hope in the Hereafter the way the disbelievers have lost hope in the people of the graves."}, {"lang": "en", "name": "A. J. Arberry", "text": "O believers, take not for friends a people against whom God is wrathful, and who have despaired of the world to come, even as the unbelievers have despaired of the inhabitants of the tombs."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "O ye who believe! befriend not a people against whom Allah is Wroth. Surely they have despaired of tHe Hereafter even as have despaired the entombed of the infidels. S"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O you who believe! Take not as friends the people who incurred the Wrath of Allah (i.e. the Jews). Surely, they have been in despair to receive any good in the Hereafter, just as the disbelievers have been in despair about those (buried) in graves (that they will not be resurrected on the Day of Resurrection)."}, {"lang": "en", "name": "Talal Itani", "text": "O you who believe! Do not befriend people with whom God has become angry, and have despaired of the Hereafter, as the faithless have despaired of the occupants of the graves."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Believers, do not make friends with those against whom Allah is wrathful and who are despaired of the Hereafter, as despaired as are the unbelievers lying in their graves."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O you who believe! Take not as friends the people who incurred the wrath of Allah. Surely, they have despaired of the Hereafter, just as the disbelievers have despaired of those (buried) in graves."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O ye who believe! Be not friendly with a folk with whom Allah is wroth, (a folk) who have despaired of the Hereafter as the disbelievers despair of those who are in the graves."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O you who have faith! Do not befriend a people at whom Allah is wrathful: they have despaired of the Hereafter, just as the faithless have despaired of the occupants of the graves."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believers, do not take as guides those who have incurred the Wrath of Allah and who despair of the Everlasting Life (to come), like the unbelieversdespaired of the inhabitants of the tombs (that they shall be resurrected)."}, {"lang": "en", "name": "Saheeh International", "text": "O you who have believed, do not make allies of a people with whom Allah has become angry. They have despaired of [reward in] the Hereafter just as the disbelievers have despaired of [meeting] the inhabitants of the graves."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Believers, do not establish friendship with the people who have become subject to the wrath of God. They do not have any hope in the life to come, just as the disbelievers have no hope in those who are in their graves."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O you who believe! do not make friends with a people with whom Allah is wroth; indeed they despair of the hereafter as the unbelievers despair of those in tombs."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo l<u>a</u> tatawallaw qawman gha<u>d</u>iba All<u>a</u>hu AAalayhim qad yaisoo mina al<u>a</u>khirati kam<u>a</u> yaisa alkuff<u>a</u>ru min a<u>s</u><u>ha</u>bi alquboor<b>i</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believers! Do not make friends with those who have incurred the wrath of God. Such men are indeed bereft of all hope of a life to come, just as those who deny the truth lying in their graves are bereft of all hopes."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O ye who believe! Turn not (for friendship) to people on whom is the Wrath of Allah, of the Hereafter they are already in despair, just as the Unbelievers are in despair about those (buried) in graves."}]}]}, "index": "quran:60", "kind": "verse_list"}