{"data": {"crumbs": [{"indexed_titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}, "path": "/books/quran", "titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}}, {"indexed_titles": {"en": "Chapter 62"}, "path": "/books/quran:62", "titles": {"ar": "الجمعة", "en": "Friday", "ent": "Al-Jumu'a"}}], "index": 62, "local_index": 62, "order": 110, "part_type": "Chapter", "path": "/books/quran:62", "reveal_type": "Medinan", "rukus": 2, "titles": {"ar": "الجمعة", "en": "Friday", "ent": "Al-Jumu'a"}, "verse_count": 11, "verse_start_index": 5177, "verses": [{"index": 5178, "local_index": 1, "part_type": "Verse", "path": "/books/quran:62:1", "text": "يُسَبِّحُ‌ لِلَّهِ‌ مَا فِي‌ السَّمَاوَاتِ‌ وَ مَا فِي‌ الْأَرْضِ‌ الْمَلِکِ‌ الْقُدُّوسِ‌ الْعَزِيزِ الْحَکِيمِ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آنچه در آسمان ها و آنچه در زمین است، خدا را [به پاک بودن از هر عیب و نقصی] می ستایند، خدایی که فرمانروای هستی و بی نهایت پاکیزه و توانای شکست ناپذیر و حکیم است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا را تسبيح مى‌گويند هر چه در آسمانها و هر چه در زمين است، آن فرمانرواى پاك از عيب را، آن پيروزمند حكيم را."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آنچه در آسمان‌ها و آنچه در زمين است تسبيح خدا مى‌گويند، خدايى كه فرمانرواى پاك و شكست ناپذير حكيم است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آنچه در آسمانها و آنچه در زمين است، خدايى را كه پادشاه پاك ارجمند فرزانه است، تسبيح مى‌گويند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "هر چه در آسمانها و زمین است همه به تسبیح و ستایش خدا که پادشاهی منزّه و پاک و مقتدر و حکیم است مشغولند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آنچه در آسمانها و آنچه در زمین است، به تسبیح و تقدیس خدا مشغول است. خدائی که مالک و حاکم (کلّ جهان) است، از هر نقص و عیبی مبرّا و منزّه است، و چیره‌ی کار بجا است. [[«یُسَبِّحُ ...»: (نگا: رعد / 13، اسراء / 44، نور / 41). «الْقُدُّوسِ»: (نگا: حشر / 23).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آنچه در آسمانها و آنچه در زمین است خداوند را نیایش کند، [خداوندی که‌] فرمانروای قدوس پیروزمند فرزانه است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آنچه در آسمانها و آنچه در زمین است همواره تسبیح خدا می‌گویند، خداوندی که مالک و حاکم است و از هر عیب و نقصی مبرا، و عزیز و حکیم است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "تسبیح گوید خدا را آنچه در آسمانها و آنچه در زمین است پادشاه پاک عزّتمند حکیم‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "هر چه در آسمانها و هر چه در زمين است خداى، آن پادشاه پاك تواناى بى‌همتا و داناى با حكمت، را به پاكى مى‌ستايد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "آنچه در آسمان‌ها و آنچه در زمین است، برای خدا تسبیح گویند. (خدایی که) تنها او پادشاهیِ بس مقدس (و) عزیز حکیم است."}, {"lang": "en", "name": "Ahmed Ali", "text": "ALL THAT IS in the heavens and the earth sings the praises of God the King, the Holy, Omnipotent, the Wise."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "All whatever is in the heavens and all whatever is in the earth proclaims the Purity of Allah, the King, the Most Pure, the Most Honourable, the Wise."}, {"lang": "en", "name": "A. J. Arberry", "text": "All that is in the heavens and the earth magnifies God, the King, the All-holy, the All-mighty, the All-wise."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Whatsoever is in the heavens and whatsoever is in the earth halloweth Allah, the Sovereign, the Holy, the Mighty, the Wise."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah, the King (of everything), the Holy, the All-Mighty, the All-Wise."}, {"lang": "en", "name": "Talal Itani", "text": "Everything in the heavens and the earth glorifies God the Sovereign, the Holy, the Almighty, the Wise."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "All that is in the heavens and all that is in the earth extols the glory of Allah, the Sovereign, the Holy, the All- Mighty, the All-Wise."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah -- the King, the Holy, the Almighty, the All-Wise."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "All that is in the heavens and all that is in the earth glorifieth Allah, the Sovereign Lord, the Holy One, the Mighty, the Wise."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Whatever there is in the heavens and in the earth glorifies Allah, the Sovereign, the All-holy, the All-mighty, the All-wise."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "All that is in heavens and earth exalt Allah, the King, the Pure, the Almighty, the Wise."}, {"lang": "en", "name": "Saheeh International", "text": "Whatever is in the heavens and whatever is on the earth is exalting Allah, the Sovereign, the Pure, the Exalted in Might, the Wise."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "All that is in the heavens and the earth glorify God, the King, the Holy, the Majestic and the All-wise."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Whatever is in the heavens and whatever is in the earth declares the glory of Allah, the King, the Holy, the Mighty, the Wise."}, {"lang": "en", "name": "English Transliteration", "text": "Yusabbi<u>h</u>u lill<u>a</u>hi m<u>a</u> fee a<b>l</b>ssam<u>a</u>w<u>a</u>ti wam<u>a</u> fee alar<u>d</u>i almaliki alquddoosi alAAazeezi al<u>h</u>akeem<b>i</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Whatever is in the heavens and on the earth glorifies God, the Sovereign Lord, the Holy One, the Mighty, the Wise."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Whatever is in the heavens and on earth, doth declare the Praises and Glory of Allah,- the Sovereign, the Holy One, the Exalted in Might, the Wise."}]}, {"index": 5179, "local_index": 2, "part_type": "Verse", "path": "/books/quran:62:2", "text": "هُوَ الَّذِي‌ بَعَثَ‌ فِي‌ الْأُمِّيِّينَ‌ رَسُولاً مِنْهُمْ‌ يَتْلُو عَلَيْهِمْ‌ آيَاتِهِ‌ وَ يُزَکِّيهِمْ‌ وَ يُعَلِّمُهُمُ‌ الْکِتَابَ‌ وَ الْحِکْمَةَ وَ إِنْ‌ کَانُوا مِنْ‌ قَبْلُ‌ لَفِي‌ ضَلاَلٍ‌ مُبِينٍ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "اوست که در میان مردم بی سواد، پیامبری از خودشان برانگیخت تا آیات او را بر آنان بخواند و آنان را [از آلودگی های فکری و روحی] پاکشان کند و به آنان کتاب و حکمت بیاموزد، و آنان به یقین پیش از این در گمراهی آشکاری بودند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اوست خدايى كه به ميان مردمى بى‌كتاب پيامبرى از خودشان مبعوث داشت تا آياتش را بر آنها بخواند و آنها را پاكيزه سازد و كتاب و حكمتشان بياموزد. اگر چه پيش از آن در گمراهى آشكار بودند،"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اوست آن كه در ميان درس ناخوانده‌ها پيامبرى از خودشان برانگيخت كه آيات او را بر آنها مى‌خواند و پاكشان مى‌سازد و كتاب و حكمتشان مى‌آموزد، و حقا كه از پيش در ضلالت آشكارى بودند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اوست آن كس كه در ميان بى‌سوادان فرستاده‌اى از خودشان برانگيخت، تا آيات او را بر آنان بخواند و پاكشان گرداند و كتاب و حكمت بديشان بياموزد، و [آنان‌] قطعاً پيش از آن در گمراهى آشكارى بودند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "اوست خدایی که میان عرب امّی (یعنی قومی که خواندن و نوشتن نمی‌دانستند) پیغمبری بزرگوار از همان مردم برانگیخت که بر آنان آیات وحی خدا تلاوت می‌کند و آنها را (از لوث جهل و اخلاق زشت) پاک می‌سازد و شریعت و احکام کتاب سماوی و حکمت الهی می‌آموزد و همانا پیش از این همه در ورطه جهالت و گمراهی آشکار بودند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "خدا کسی است که از میان بیسوادان پیغمبری را برانگیخته است و به سویشان گسیل داشته است، تا آیات خدا را برای ایشان بخواند، و آنان را پاک بگرداند. او بدیشان کتاب (قرآن) و شریعت (یزدان) را می‌آموزد. آنان پیش از آن تاریخ واقعاً در گمراهی آشکاری بودند. [[«بَعَثَ»: برانگیخته است. مبعوث کرده است. «الأُمِّیِّینَ»: افراد درس‌نخوان. بیسواد (نگا: بقره / 78، آل‌عمران / 20 و 75، اعراف / 157 و 158). «یُزَکِّیهِمْ»: (نگا: بقره / 129 و 151). «رَسُولاً مِّنْهُمْ ... ضَلالٍ مُبینٍ»: (نگا: آل‌عمران / 164). «وَ إِن کَانُوا»: حرف واو حالیه، و واژه (إِنْ) از حروف مشبهةٌ بالفعل است و مخفف از مثقله است (نگا: اعراب القرآن، محیی‌الدین درویش).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "اوست که در میان قوم بی‌کتاب [عرب‌] پیامبری از میان خودشان برانگیخت که آیات او را بر آنان می‌خواند و پاکیزه‌شان می‌دارد، و به آنان کتاب و حکمت می‌آموزد، و حقا که در گذشته در گمراهی آشکاری بودند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و کسی است که در میان جمعیت درس نخوانده رسولی از خودشان برانگیخت که آیاتش را بر آنها می‌خواند و آنها را تزکیه می‌کند و به آنان کتاب (قرآن) و حکمت می‌آموزد هر چند پیش از آن در گمراهی آشکاری بودند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "او است آن که برانگیخت در ناخوانان پیمبری را از ایشان بخواند بر ایشان آیتهای او را و پاک سازد ایشان را و بیاموزدشان کتاب و حکمت را اگر چه بودند پیش از آن همانا در گمراهی آشکار"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اوست آن كه در ميان مردم درس‌ناخوانده- عرب- پيامبرى از خودشان برانگيخت كه آيات او را بر آنان مى‌خواند و پاكشان مى‌سازد- از آلودگى كفر و اخلاق زشت- و كتاب- قرآن- و حكمت- انديشه و گفتار و كردار درست- به آنان مى‌آموزد، و هر آينه پيش از اين در گمراهى آشكار بودند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "کسی که در میان مادرزادگان [:بی‌بهرگان از وحی] فرستاده‌ای از خودشان برانگیخت‌، حال آنکه آیات او را بر آنان می‌خواند و پاکشان می‌گرداند و کتاب و حکمت بدیشان تعلیم می‌دهد. و گرچه آنان همواره پیش از آن در (ژرفای) گمراهی آشکارگری بوده‌اند."}, {"lang": "en", "name": "Ahmed Ali", "text": "It is He who raised among the gentiles an apostle from amongst them, who recites His revelations to them, reforms them and teaches them the Scripture and the Law, for before him they were clearly in error."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "It is He Who has sent among the unlettered people a Noble Messenger from themselves, who recites His verses to them and purifies them, and bestows them the knowledge of the Book and wisdom; and indeed before this, they were in open error."}, {"lang": "en", "name": "A. J. Arberry", "text": "It is He who has raised up from among the common people a Messenger from among them, to recite His signs to them and to purify them, and to teach them the Book and the Wisdom, though before that they were in manifest error,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "He it is Who hath raised amdist the unlettered ones an apostle from among themselves, rehearsing Unto them His revelations and purifying them and teaching them the Book and Wisdom, though they have been aforetime in error manifest."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "He it is Who sent among the unlettered ones a Messenger (Muhammad SAW) from among themselves, reciting to them His Verses, purifying them (from the filth of disbelief and polytheism), and teaching them the Book (this Quran, Islamic laws and Islamic jurisprudence) and Al-Hikmah (As-Sunnah: legal ways, orders, acts of worship, etc. of Prophet Muhammad SAW). And verily, they had been before in mainfest error;"}, {"lang": "en", "name": "Talal Itani", "text": "It is He who sent among the unlettered a messenger from themselves; reciting His revelations to them, and purifying them, and teaching them the Scripture and wisdom; although they were in obvious error before that."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "He it is Who has sent to the gentiles a Messenger from among themselves, one who rehearses to them His verses, purifies their lives, and imparts to them the Book and the Wisdom although before that they were in utter error;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "He it is Who sent among the unlettered ones a Messenger from among themselves, reciting to them His Ayat, purifying them, and teaching them the Book and the Hikmah. And verily, they had been before in manifest error."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "He it is Who hath sent among the unlettered ones a messenger of their own, to recite unto them His revelations and to make them grow, and to teach them the Scripture and wisdom, though heretofore they were indeed in error manifest,"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "It is He who sent to the unlettered [people] an apostle from among themselves, to recite to them His signs, to purify them, and to teach them the Book and wisdom, and earlier they had indeed been in manifest error."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "It is He who has raised among the illiterate (Arabs), a Messenger from themselves, to recite to them His verses, to purify them, and to teach them the Book and the Wisdom, though before that they were in clear error,"}, {"lang": "en", "name": "Saheeh International", "text": "It is He who has sent among the unlettered a Messenger from themselves reciting to them His verses and purifying them and teaching them the Book and wisdom - although they were before in clear error -"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "It is He who has sent to the illiterate a Messenger from among their own people to recite to them His revelations and purify them. He will teach the Book to them"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "He it is Who raised among the inhabitants of Mecca an Apostle from among themselves, who recites to them His communications and purifies them, and teaches them the Book and the Wisdom, although they were before certainly in clear error,"}, {"lang": "en", "name": "English Transliteration", "text": "Huwa alla<u>th</u>ee baAAatha fee alommiyyeena rasoolan minhum yatloo AAalayhim <u>a</u>y<u>a</u>tihi wayuzakkeehim wayuAAallimuhumu alkit<u>a</u>ba wa<b>a</b>l<u>h</u>ikmata wain k<u>a</u>noo min qablu lafee <u>d</u>al<u>a</u>lin mubeen<b>in</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "It is He who has raised among the unlettered people a messenger from among themselves who recites His revelations to them, and purifies them, and teaches them the Book and wisdom, for they had formerly been clearly misguided --"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "It is He Who has sent amongst the Unlettered a messenger from among themselves, to rehearse to them His Signs, to sanctify them, and to instruct them in Scripture and Wisdom,- although they had been, before, in manifest error;-"}]}, {"index": 5180, "local_index": 3, "part_type": "Verse", "path": "/books/quran:62:3", "text": "وَ آخَرِينَ‌ مِنْهُمْ‌ لَمَّا يَلْحَقُوا بِهِمْ‌ وَ هُوَ الْعَزِيزُ الْحَکِيمُ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و [نیز پیامبر را] بر مردمی دیگر [از عرب و غیر عرب] که هنوز به آنان نپیوسته اند [برانگیخت]. و او توانای شکست ناپذیر و حکیم است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و بر گروهى ديگر از ايشان كه هنوز به آنها نپيوسته‌اند. و اوست پيروزمند و حكيم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و گروه ديگرى از ايشان را نيز كه هنوز به آنها نپيوسته‌اند، [تعليم مى‌دهد] و او مقتدر حكيم است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و [نيز بر جماعتهايى‌] ديگر از ايشان كه هنوز به آنها نپيوسته‌اند. و اوست ارجمند سنجيده‌كار."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و نیز قوم دیگری از آنان را (که به روایت از پیغمبر مراد عجمند) که هنوز به عرب (در اسلام) ملحق نشده‌اند هدایت فرماید که او خدای مقتدر و همه کارش به حکمت و مصلحت است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "او مبعوث برای دیگران نیز هست، آنانی که هنوز به اینان نپیوسته‌اند (و بعدها به دنیا می‌آیند). خدا چیره‌ی کار بجا است. [[«آخَرِینَ»: دیگران. غیرعربها. عطف بر (الأُمِّیِّینَ) یا بر ضمیر (هُمْ) در فعل (یُعَلِّمُهُمْ) است. «مِنْهُمْ»: از أُمِّیِّین. از مسلمین. «آخَرِینَ مِنْهُمْ»: مسلمانان عرب و غیرعربی که بعدها به دنیا می‌آیند. ضمیر (هُمْ) درست است که به (أُمِّیِّین) برمی‌گردد، ولی هر کس که اسلام را بپذیرد از زمره ایشان می‌باشد، چرا که مسلمانان از هر نژادی که باشند، امت واحدی بشمارند و دوستان یکدیگرند (نگا: توبه / 71).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و دیگرانی از آنان که هنوز به آنان نپیوسته‌اند، و اوست پیروزمند فرزانه‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و (همچنین) رسول است بر گروه دیگری که هنوز به آنها ملحق نشده‌اند؛ و او عزیز و حکیم است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و دیگران از ایشان که هنوز نپیوستند بدانان و او است عزّتمند حکیم‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و [نيز آن پيامبر را برانگيخت به‌] ديگران از ايشان- مؤمنان- كه هنوز بديشان نپيوسته‌اند و اوست تواناى بى‌همتا و داناى با حكمت."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و (نیز) بر گروه‌هایی دیگر از ایشان، هنگامی که در پی‌شان می‌آیند و اوست (همان) عزیز حکیم."}, {"lang": "en", "name": "Ahmed Ali", "text": "And for others among them who have not joined them yet. He is all-mighty and all-wise."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And he (the Holy Prophet) bestows knowledge to others along with them, who have not yet joined them; and He only is the Most Honourable, the Wise."}, {"lang": "en", "name": "A. J. Arberry", "text": "and others of them who have not yet joined them. And He is the All-mighty, the All-wise."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And also others of them who have not yet joined them. And He is the Mighty; the Wise."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And He has sent him (Prophet Muhammad SAW) also to others among them (Muslims) who have not yet joined them (but they will come). And He (Allah) is the All-Mighty, the All-Wise."}, {"lang": "en", "name": "Talal Itani", "text": "And others from them, who have not yet joined them. He is the Glorious, the Wise."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and (He has also) sent him to those others who have not yet joined them. He is the Most Mighty, the Most Wise."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And others among them who have not yet joined them. And He is the Almighty, the All-Wise."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Along with others of them who have not yet joined them. He is the Mighty, the Wise."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "And to others from among them [as well] who have not yet joined them. And He is the All-mighty, the All-wise."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "together with others who have not as yet joined them. He is the Almighty, the Wise."}, {"lang": "en", "name": "Saheeh International", "text": "And [to] others of them who have not yet joined them. And He is the Exalted in Might, the Wise."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "and others who have not yet joined, and He will give them wisdom. Before this they had been in plain error. God is Majestic and All-wise."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And others from among them who have not yet joined them; and He is the Mighty, the Wise."}, {"lang": "en", "name": "English Transliteration", "text": "Wa<u>a</u>khareena minhum lamm<u>a</u> yal<u>h</u>aqoo bihim wahuwa alAAazeezu al<u>h</u>akeem<b>u</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "and to others also, from among them, who have not yet joined them. He is the Mighty, the Wise One."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "As well as (to confer all these benefits upon) others of them, who have not already joined them: And He is exalted in Might, Wise."}]}, {"index": 5181, "local_index": 4, "part_type": "Verse", "path": "/books/quran:62:4", "text": "ذٰلِکَ‌ فَضْلُ‌ اللَّهِ‌ يُؤْتِيهِ‌ مَنْ‌ يَشَاءُ وَ اللَّهُ‌ ذُو الْفَضْلِ‌ الْعَظِيمِ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "این [برانگیختن به پیامبری و مسؤولیت عظیم تعلیم و تربیت،] فضل خداست که آن را به هر کس بخواهد عطا می کند، و خدا صاحب فضل بزرگ است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اين بخشايش خداست كه به هر كه خواهد ارزانيش دارد و خدا را بخشايشى بزرگ است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اين [رسالت‌] فضل خداست، آن را به هر كه بخواهد عطا مى‌كند و خدا صاحب فضل بزرگ است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اين فضل خداست، آن را به هر كه بخواهد عطا مى‌كند و خدا داراى فضل بسيار است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "این (رسالت و نزول قرآن) فضل و کرامت خداست که به هر که بخواهد می‌دهد و خدا را فضل و رحمت نامنتهاست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "این (نعمت بعثت) فضل و کرم خدا است، آن را به هر کس که بخواهد (و لایق و شایسته‌اش بداند) می‌بخشد، و خدا دارای فضل و کرم بزرگی است. [[«ذلِکَ»: آن بعثت. این پیغمبری و مقام نبوّت.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "این بخشش الهی است که به هر کس خواهد ارزانی‌اش دارد، و خداوند دارای بخشش و بخشایش بیکران است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "این فضل خداست که به هر کس بخواهد (و شایسته بداند) می‌بخشد؛ و خداوند صاحب فضل عظیم است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "این است فضل خدا دهدش به هر که خواهد و خدا است دارای فضلی بزرگ‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اين [پيامبرى‌] فزون‌بخشى خداست كه به آن كس كه خواهد مى‌دهد، و خدا خداوند فزون‌بخشى بزرگ است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "این (بزرگ‌فضیلت) فضل خداست. آن را به هر که بخواهد می‌دهد و خدا دارای فضل بسیاری است."}, {"lang": "en", "name": "Ahmed Ali", "text": "This is the bounty of God, He gives whosoever He please. God is master of great bounty."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "This is Allah’s munificence, which He may give to whomever He wills; and Allah is Extremely Munificent."}, {"lang": "en", "name": "A. J. Arberry", "text": "That is the bounty of God; He gives it to whom He will, and God is of bounty abounding."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "That is the grace of Allah: He vouchsafeth it on whomsoever He will. And Allah is the Owner of mighty Grace."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "That is the Grace of Allah, which He bestows on whom He wills. And Allah is the Owner of Mighty Grace."}, {"lang": "en", "name": "Talal Itani", "text": "That is God’s grace, which He grants to whomever He wills. God is Possessor of limitless grace."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Such is Allah's favour: He bestows it on whomsoever He pleases. Allah is the Lord of abounding favour."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "That is the grace of Allah, which He bestows on whom He wills. And Allah is the Owner of mighty grace."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "That is the bounty of Allah; which He giveth unto whom He will. Allah is of Infinite Bounty."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "That is Allah’s grace, which He grants to whomever He wishes, and Allah is dispenser of a great grace."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Such is the Favor of Allah; He gives it to whom He will, and Allah is of abounding favors."}, {"lang": "en", "name": "Saheeh International", "text": "That is the bounty of Allah, which He gives to whom He wills, and Allah is the possessor of great bounty."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Such is the favor of God which He grants to whomever He wants. God's favor is great."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "That is Allah's grace; He grants it to whom He pleases, and Allah is the Lord of mighty grace."}, {"lang": "en", "name": "English Transliteration", "text": "<u>Tha</u>lika fa<u>d</u>lu All<u>a</u>hi yuteehi man yash<u>a</u>o wa<b>A</b>ll<u>a</u>hu <u>th</u>oo alfa<u>d</u>li alAAa<i><u>th</u></i>eem<b>i</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "That is God's grace; He bestows it on whom He pleases; for God is limitless in His grace."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Such is the Bounty of Allah, which He bestows on whom He will: and Allah is the Lord of the highest bounty."}]}, {"index": 5182, "local_index": 5, "part_type": "Verse", "path": "/books/quran:62:5", "text": "مَثَلُ‌ الَّذِينَ‌ حُمِّلُوا التَّوْرَاةَ ثُمَ‌ لَمْ‌ يَحْمِلُوهَا کَمَثَلِ‌ الْحِمَارِ يَحْمِلُ‌ أَسْفَاراً بِئْسَ‌ مَثَلُ‌ الْقَوْمِ‌ الَّذِينَ‌ کَذَّبُوا بِآيَاتِ‌ اللَّهِ‌ وَ اللَّهُ‌ لاَ يَهْدِي‌ الْقَوْمَ‌ الظَّالِمِينَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "وصف کسانی که عمل کردن به تورات به آنان تکلیف شده است، آن گاه به آن عمل نکردند، مانند درازگوشی است که کتاب هایی را [که هیچ آگاهی به محتویات آنها ندارد] حمل می کند. چه بد است سرگذشت مردمی که آیات خدا را تکذیب کردند. و خدا مردم ستمکار را هدایت نمی کند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "مثَل كسانى كه تورات به آنها داده شده و بدان عمل نمى‌كنند مثَل آن خر است كه كتابهايى را حمل مى‌كند. بد مثَلى است مثَل مردمى كه آيات خدا را دروغ مى‌شمرده‌اند. و خدا ستمكاران را هدايت نمى‌كند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "مثل كسانى كه به [پيروى از] از تورات مكلف شدند سپس به آن عمل نكردند، همچون مثل درازگوشى است كه كتاب‌هايى را حمل كند. بد است وصف آن قومى كه آيات خدا را تكذيب كردند! و خدا مردم ستمگر را هدايت نمى‌كند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "مثل كسانى كه [عمل به‌] تورات بر آنان بار شد [و بدان مكلف گرديدند] آنگاه آن را به كار نبستند، همچون مثل خرى است كه كتابهايى را برپشت مى‌كشد. [وه‌] چه زشت است وصف آن قومى كه آيات خدا را به دروغ گرفتند. و خدا مردم ستمگر را راه نمى‌نمايد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "وصف حال آنان که علم تورات بر آنان نهاده شد (و بدان مکلف شدند) ولی آن را حمل نکردند (و خلاف آن عمل نمودند) در مثل به حماری ماند که بار کتابها بر پشت کشد (و از آن هیچ نفهمد و بهره نبرد)، آری مثل قومی که حالشان این است که آیات خدا را تکذیب کردند بسیار بد است و خدا هرگز ستمکاران را (به راه سعادت) رهبری نخواهد کرد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کسانی که تورات بدیشان واگذار گردید، ولی بدان عمل نکردند و حق آن را ادا ننمودند، به درازگوشی می‌مانند که کتابهائی را برمی‌دارد (ولی از محتوای آنها خبر ندارد). مردمانی که آیات خدا را تکذیب می‌دارند، بدترین مثل را دارند. خداوند مردمان ستمکار را هدایت نمی‌دهد (و به سعادت هر دو سرا نائل نمی‌گرداند). [[«حُمِّلُوا»: بر دوش آنان گذاشته شده است. بدانان واگذار گشته است. اجرای احکام و تبلیغ آن برعهده ایشان گذارده شده است. «لَمْ یَحْمِلُوهَا»: بدان عمل نکردند. برابر آن نرفتند و حق آن را اداء ننمودند. «بِئْسَ مَثَلُ ...»: بدترین مثل را دارند! چه بد مثلی دارند! فعل ذم است و منظور نکوهش است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "داستان کسانی که [عمل به‌] تورات بر آنان تکلیف شد، سپس آن را [چنانکه باید و شاید] رعایت نکردند، همانند چارپایی بر او کتابی چند است، چه بد است وصف گروهی که آیات الهی را تکذیب کردند، و خداوند قوم ستمکار [مشرک‌] را هدایت نمی‌کند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کسانی که مکلف به تورات شدند ولی حق آن را ادا نکردند، مانند درازگوشی هستند که کتابهایی حمل می‌کند، (آن را بر دوش می‌کشد اما چیزی از آن نمی‌فهمد)! گروهی که آیات خدا را انکار کردند مثال بدی دارند، و خداوند قوم ستمگر را هدایت نمی‌کند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "مثَل آنان که بار شدند تورات را سپس برنداشتندش مانند خر است که بردارد کتابهائی زشت مثَل گروهی که تکذیب کردند آیتهای خدا را و خدا رهبری نکند گروه ستمگران را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "داستان كسانى كه تورات بر آنها نهاده شد- يعنى مكلف شدند كه آن را كار بندند- و آنگاه آن را برنداشتند- يعنى آن را كار نبستند- همچون داستان خرى است كه كتابهايى را بردارد بد [داستانى‌] است داستان گروهى كه آيات خداى را دروغ شمردند، و خدا گروه ستمكار را راه ننمايد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "مَثَل کسانی که (علم و عمل) تورات بر عهده‌ی آنان گذارده شد، سپس (با کوتاهی کردنشان) آن را بر دوشهاشان نگرفتند، هم‌چون مَثَل خری است که کتاب‌هایی را بر پشت می‌کشد. وه چه زشت است نماد آن قومی که با آیات خدا (همان‌ها و خدا را) تکذیب کردند. و خدا ستمگران را راه نمی‌نماید."}, {"lang": "en", "name": "Ahmed Ali", "text": "The likeness of those who were charged with (the law of) the Torah which they did not observe, is that of a donkey who carries a load of books (oblivious of what they contain). How wretched the semblance of the people who deny the words of God! God does not show an unjust people the way."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "The example of those who were entrusted with the Taurat, and did not carry out its commands, is like the donkey carrying books; what a wretched example is of the people who denied the signs of Allah; and Allah does not guide the unjust."}, {"lang": "en", "name": "A. J. Arberry", "text": "The likeness of those who have been loaded with the Torah then they have not carried it, is as the likeness of an ass carrying books. Evil is the likeness of the people who have cried lies to God's signs. God guides never the people of the evildoers."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "The likeness of those who were laden with the Taurat and then they bare it not, is as the likeness of the ass bearing tomes. Hapless is the likeness of the people who belie the signs of Allah. And Allah guideth not a wrong doing people. J"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "The likeness of those who were entrusted with the (obligation of the) Taurat (Torah) (i.e. to obey its commandments and to practise its legal laws), but who subsequently failed in those (obligations), is as the likeness of a donkey who carries huge burdens of books (but understands nothing from them). How bad is the example (or the likeness) of people who deny the Ayat (proofs, evidences, verses, signs, revelations, etc.) of Allah. And Allah guides not the people who are Zalimun (polytheists, wrong-doers, disbelievers, etc.)."}, {"lang": "en", "name": "Talal Itani", "text": "The example of those who were entrusted with the Torah, but then failed to uphold it, is like the donkey carrying works of literature. Miserable is the example of the people who denounce God’s revelations. God does not guide the wrongdoing people."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "The parable of those who were charged with the Torah and then they failed to live up to it is that of a donkey laden with books. Even more evil is the parable of the people who gave the lie to the Signs of Allah. Allah does not direct such wrong-doers to the Right Way."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "The likeness of those who were entrusted with the Tawrah, but did not carry it, is as the likeness of a donkey which carries huge burdens of books. How bad is the example of people who deny the Ayat of Allah. And Allah does not guide the people who are wrongdoers."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "The likeness of those who are entrusted with the Law of Moses, yet apply it not, is as the likeness of the ass carrying books. Wretched is the likeness of folk who deny the revelations of Allah. And Allah guideth not wrongdoing folk."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "The example of those who were charged with the Torah, then failed to carry it, is that of an ass carrying books. Evil is the example of the people who deny Allah’s signs, and Allah does not guide the wrongdoing lot."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "The likeness of those who were loaded with the Torah, but did not carry it, is like that of a donkey carrying books. Evil is the example of the people who have belied the verses of Allah. Allah does not guide the evildoers."}, {"lang": "en", "name": "Saheeh International", "text": "The example of those who were entrusted with the Torah and then did not take it on is like that of a donkey who carries volumes [of books]. Wretched is the example of the people who deny the signs of Allah. And Allah does not guide the wrongdoing people."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Those who were to carry the responsibility of the Torah but ignored, are like donkeys laden with books. How terrible is the example of the people who reject the revelations of God. God does not guide the unjust."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "The likeness of those who were charged with the Taurat, then they did not observe it, is as the likeness of the ass bearing books, evil is the likeness of the people who reject the communications of Allah; and Allah does not guide the unjust people."}, {"lang": "en", "name": "English Transliteration", "text": "Mathalu alla<u>th</u>eena <u>h</u>ummiloo a<b>l</b>ttawr<u>a</u>ta thumma lam ya<u>h</u>milooh<u>a</u> kamathali al<u>h</u>im<u>a</u>ri ya<u>h</u>milu asf<u>a</u>ran bisa mathalu alqawmi alla<u>th</u>eena ka<u>thth</u>aboo bi<u>a</u>y<u>a</u>ti All<u>a</u>hi wa<b>A</b>ll<u>a</u>hu l<u>a</u> yahdee alqawma a<b>l</b><i><u>thth</u></i><u>a</u>limeen<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Those who were charged with bearing the Torah, but did not do so are like an ass carrying a load of books. How unfortunate are those who belie the sign of God. God does not guide the wrongdoers."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "The similitude of those who were charged with the (obligations of the) Mosaic Law, but who subsequently failed in those (obligations), is that of a donkey which carries huge tomes (but understands them not). Evil is the similitude of people who falsify the Signs of Allah: and Allah guides not people who do wrong."}]}, {"index": 5183, "local_index": 6, "part_type": "Verse", "path": "/books/quran:62:6", "text": "قُلْ‌ يَا أَيُّهَا الَّذِينَ‌ هَادُوا إِنْ‌ زَعَمْتُمْ‌ أَنَّکُمْ‌ أَوْلِيَاءُ لِلَّهِ‌ مِنْ‌ دُونِ‌ النَّاسِ‌ فَتَمَنَّوُا الْمَوْتَ‌ إِنْ‌ کُنْتُمْ‌ صَادِقِينَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بگو: ای یهودیان! اگر گمان می کنید که فقط شما دوستان خدایید نه مردم دیگر، پس آرزوی مرگ کنید اگر راستگویید [چون دوستان خدا برای رسیدن به لقاء او مشتاق مرگ هستند.]"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "بگو: اى قوم يهود، هرگاه مى‌پنداريد كه شما دوستان خدا هستيد، نه مردم ديگر، پس تمناى مرگ كنيد اگر راست مى‌گوييد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "بگو: اى كسانى كه يهودى شديد! اگر گمان داريد كه شما دوستان خداييد نه ديگر مردمان، پس تمنّاى مرگ كنيد اگر راست مى‌گوييد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "بگو: «اى كسانى كه يهودى شده‌ايد، اگر پنداريد كه شما دوستان خداييد نه مردم ديگر، پس اگر راست مى‌گوييد درخواست مرگ كنيد.»"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "بگو: ای جماعت یهود، اگر پندارید که شما به حقیقت دوستداران خدایید نه مردم دیگر، پس تمنّای مرگ کنید اگر راست می‌گویید."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "بگو: ای یهودیان! اگر شما می‌پندارید که شما دوستان خدا هستید نه مردمان دیگر، اگر راست می‌گوئید خواستار مرگ شوید (تا از خانه‌ی بلا و محنت، به سرای نعمت و جنّت برسید، و دیدار جانان برای شما عاشقان میسّر شود). [[«هَادُوا»: (نگا: بقره / 62، نساء / 46 و 160، مائده / 41 و 44 و 69). «مِن دُونِ»: جدای از. غیر از. «فَتَمَنَّوُا الْمَوْتَ»: درخواست مرگ کردن از دو راه: با زبان دعا نمودن و تقاضای فرا رسیدن مرگ کردن، و دیگر در راه خدا جنگیدن و از کشتن نهراسیدن. «أَوْلِیَآءُ»: دوستان. عزیزان (نگا: مائده / 18).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بگو ای یهودیان اگر گمان می‌کنید که شما از میان همه مردم، دوستان خدا هستید، اگر راست می‌گویید آرزوی مرگ کنید"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "بگو: «ای یهودیان! اگر گمان می‌کنید که (فقط) شما دوستان خدائید نه سایر مردم، پس آرزوی مرگ کنید اگر راست می‌گویید (تا به لقای محبوبتان برسید)!»"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "بگو ای آنان که جهود شدید اگر پندارید که شما دوستانید خدا را جز مردم پس آرزو کنید مرگ را اگر هستید راستگویان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "بگو اى كسانى كه يهودى شديد، اگر پنداريد كه شما دوستان خداييد نه ديگر مردمان، پس آرزوى مرگ كنيد- تا شما را به او برساند- اگر راستگوييد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بگو: «ای کسانی که یهودی شده‌اید! اگر پنداشتید که (تنها) شما به‌راستی دوستان خدایید نه دیگر مردمان، اگر (از) راستان بوده‌اید، پس درخواست مرگ کنید.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Say: \"O you Jews, if you claim that you are the favourites of God apart from all men, then wish for death, if you speak the truth."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Say “O Jews! If you assume that you are Allah’s friends, others are not, then wish for death if you are truthful!”"}, {"lang": "en", "name": "A. J. Arberry", "text": "Say: 'You of Jewry, if you assert that you are the friends of God, apart from other men, then do you long for death, if you speak truly.'"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Say thou: O ye e who are Judaised! if ye imagine at ye are the friends of Allah above mankind, then wish for death if ye be truthful."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Say (O Muhammad SAW): \"O you Jews! If you pretend that you are friends of Allah, to the exclusion of (all) other mankind, then long for death if you are truthful.\""}, {"lang": "en", "name": "Talal Itani", "text": "Say, “O you who follow Judaism; if you claim to be the chosen of God, to the exclusion of the rest of mankind, then wish for death if you are sincere.”"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Tell them: “O you who have become Judaised, if you arrogantly fancy that you are Allah's favourites to the exclusion of all people, then wish for death, if you are truthful in your claim.”"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Say: \"O you Jews! If you pretend that you are friends of Allah, to the exclusion of (all) other people, then long for death if you are truthful.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Say (O Muhammad): O ye who are Jews! If ye claim that ye are favoured of Allah apart from (all) mankind, then long for death if ye are truthful."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Say, ‘O Jews! If you claim that you are Allah’s favourites, to the exclusion of other people, then long for death, should you be truthful.’"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Say: 'O you who are Jews, if you claim that of all people, you alone are the guided by Allah, then long for death if you are truthful'"}, {"lang": "en", "name": "Saheeh International", "text": "Say, \"O you who are Jews, if you claim that you are allies of Allah, excluding the [other] people, then wish for death, if you should be truthful.\""}, {"lang": "en", "name": "Muhammad Sarwar", "text": "(Muhammad), ask the Jews, \"If you believe that you are the chosen people of God to the exclusion of all other people, wish for death if you are truthful\"."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Say: O you who are Jews, if you think that you are the favorites of Allah to the exclusion of other people, then invoke death If you are truthful."}, {"lang": "en", "name": "English Transliteration", "text": "Qul y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena h<u>a</u>doo in zaAAamtum annakum awliy<u>a</u>o lill<u>a</u>hi min dooni a<b>l</b>nn<u>a</u>si fatamannawoo almawta in kuntum <u>sa</u>diqeen<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Say, \"You who are Jews, if you claim that you are favoured by God out of all people, then long for death, if you are truthful.\""}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Say: \"O ye that stand on Judaism! If ye think that ye are friends to Allah, to the exclusion of (other) men, then express your desire for Death, if ye are truthful!\""}]}, {"index": 5184, "local_index": 7, "part_type": "Verse", "path": "/books/quran:62:7", "text": "وَ لاَ يَتَمَنَّوْنَهُ‌ أَبَداً بِمَا قَدَّمَتْ‌ أَيْدِيهِمْ‌ وَ اللَّهُ‌ عَلِيمٌ‌ بِالظَّالِمِينَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ولی آنان به سبب گناهانی که مرتکب شده اند هرگز آروزی مرگ نمی کنند، و خدا به ستمکاران داناست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و آنان به سبب اعمالى كه پيش از اين مرتكب شده‌اند، هرگز تمناى مرگ نخواهند كرد. و خدا به ستمكاران داناست."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "ولى به سبب آنچه از پيش فرستاده‌اند هرگز آن را آرزو نخواهند كرد، و خداوند به ستمكاران آگاه است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و[لى‌] هرگز آن را به سبب آنچه از پيش به دست خويش كرده‌اند، آرزو نخواهند كرد، و خدا به [حال‌] ستمگران داناست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و حال آنکه در اثر آن کردار بد که به دست خود (برای آخرت خویش) پیش فرستاده‌اند ابدا آرزوی مرگ نخواهند کرد (بلکه از مرگ سخت ترسان و هراسانند) و خدا به (کردار) ستمکاران داناست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آنان به خاطر کارهائی که مرتکب شده‌اند هرگز مرگ را برای خود نمی‌خواهند، و خدا از حال ستمکاران به خوبی آگاه است (و سرانجام، ایشان را به کیفر اعمالشان می‌رساند). [[«بِمَا قَدَّمَتْ أَیْدِیهِمْ»: به سبب کارهائی که پیشتر کرده‌اند. به خاطر اعمالی که انجام داده‌اند و پیشاپیش به آخرت فرستاده‌اند (نگا: بقره / 95، آل‌عمران / 182، نساء / 62).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و به خاطر کار و کردار پیشینشان هرگز آن را آرزو نمی‌کنند، و خداوند به ستمکاران آگاه است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ولی آنان هرگز تمنای مرگ نمی‌کنند بخاطر اعمالی که از پیش فرستاده‌اند؛ و خداوند ظالمان را بخوبی می‌شناسد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آرزو نکنندش هرگز بدانچه پیش آورده است دستهای آنان و خدا دانا است به ستمگران‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و هرگز آن را آرزو نخواهند كرد به سبب آنچه دستهاشان پيش فرستاده است- يعنى كارهايى كه كرده‌اند- و خدا به ستمكاران داناست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و (اما) هرگز - به سبب آنچه از پیش با دست‌های خویش فرستاده‌اند - آرزوی مرگ نمی‌کنند. و خدا به (حال) ستمگران بسی داناست."}, {"lang": "en", "name": "Ahmed Ali", "text": "But they will never wish for death because of what they had done in the past, and God knows the sinners well."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And they will never wish for it because of the misdeeds their hands have sent ahead; and Allah well knows the unjust."}, {"lang": "en", "name": "A. J. Arberry", "text": "But they will never long for it, because of that their hands have forwarded; God knows the evildoers."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And they will never wish there for, because of that which their hands have sent forward. And Allah is the Knower of he wrong-doers."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "But they will never long for it (death), because of what (deeds) their hands have sent before them! And Allah knows well the Zalimun (polytheists, wrong-doers, disbelievers, etc.)."}, {"lang": "en", "name": "Talal Itani", "text": "But they will not wish for it, ever, due to what their hands have advanced. God knows well the wrongdoers."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "But they shall never wish for death because of the (evil) deeds they have committed. Allah is well aware of these evil-doers."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "But they will never long for it, because of what their hands have sent before them! And Allah knows well the wrongdoers."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "But they will never long for it because of all that their own hands have sent before, and Allah is Aware of evil-doers."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Yet they will never long for it, because of what their hands have sent ahead, and Allah knows best the wrongdoers."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "But, because of what their hands forwarded they will never long for it. Allah knows the harmdoers."}, {"lang": "en", "name": "Saheeh International", "text": "But they will not wish for it, ever, because of what their hands have put forth. And Allah is Knowing of the wrongdoers."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "They will never wish for death because of what they have done! God knows best about the unjust people."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And they will never invoke it because of what their hands have sent before; and Allah is Cognizant of the unjust."}, {"lang": "en", "name": "English Transliteration", "text": "Wal<u>a</u> yatamannawnahu abadan bim<u>a</u> qaddamat aydeehim wa<b>A</b>ll<u>a</u>hu AAaleemun bi<b>al</b><i><u>thth</u></i><u>a</u>limeen<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "They will never wish for it, because of what their hands have sent forward. God has full knowledge of evil-doers."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "But never will they express their desire (for Death), because of the (deeds) their hands have sent on before them! and Allah knows well those that do wrong!"}]}, {"index": 5185, "local_index": 8, "part_type": "Verse", "path": "/books/quran:62:8", "text": "قُلْ‌ إِنَ‌ الْمَوْتَ‌ الَّذِي‌ تَفِرُّونَ‌ مِنْهُ‌ فَإِنَّهُ‌ مُلاَقِيکُمْ‌ ثُمَ‌ تُرَدُّونَ‌ إِلَى‌ عَالِمِ‌ الْغَيْبِ‌ وَ الشَّهَادَةِ فَيُنَبِّئُکُمْ‌ بِمَا کُنْتُمْ‌ تَعْمَلُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بگو: بی تردید مرگی را که از آن می گریزید با شما دیدار خواهد کرد، سپس به سوی دانای نهان و آشکار بازگردانده می شوید، پس شما را به اعمالی که همواره انجام می دادید، آگاه خواهد کرد."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "بگو: آن مرگى كه از آن مى‌گريزيد شما را درخواهد يافت و سپس نزد آن داناى نهان و آشكارا برگردانده مى‌شويد تا به كارهايى كه كرده‌ايد آگاهتان سازد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "بگو: مرگى كه از آن مى‌گريزيد، قطعا به سراغ شما مى‌آيد، سپس به سوى داناى نهان و آشكار بازگردانده مى‌شويد، آن‌گاه شما را از آنچه انجام مى‌داديد خبر ميدهد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "بگو: «آن مرگى كه از آن مى‌گريزيد، قطعاً به سر وقت شما مى‌آيد؛ آنگاه به سوى داناى نهان و آشكار بازگردانيده خواهيد شد، و به آنچه [در روى زمين‌] مى‌كرديد، آگاهتان خواهد كرد.»"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "بگو: عاقبت مرگی که از آن می‌گریزید شما را البته ملاقات خواهد کرد و پس از مرگ به سوی خدایی که دانای پیدا و پنهان است بازگردانیده می‌شوید و او شما را به آنچه می‌کرده‌اید آگاه می‌سازد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "بگو: قطعاً مرگی که از آن می‌گریزید، سرانجام با شما رویاروی می‌گردد و شما را درمی‌یابد، بعد از آن به سوی کسی برگردانده می‌شوید که از پنهان و آشکار آگاه است، و شما را از آنچه کرده‌اید باخبر می‌گرداند. [[«الْغَیْبِ»: آنچه از دائره دید، و روح، و بُرد دانش بشری فراتر است. «الشَّهادَةِ»: آنچه در معرض دید، و نیروی روح و در فاصله بُرد دانش بشری است. «الْغَیْبِ وَ الشَّهادَةِ»: (نگا: انعام / 73، توبه / 94 و 105).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بگو همان مرگی که از آن می‌گریزید، روی آور به شماست، سپس به سوی دانای پنهان و پیدا بازگردانده شوید، آنگاه شما را به [نتیجه و حقیقت‌] آنچه کرده‌اید، آگاه می‌سازد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "بگو: «این مرگی که از آن فرار می‌کنید سرانجام با شما ملاقات خواهد کرد؛ سپس به سوی کسی که دانای پنهان و آشکار است بازگردانده می‌شوید؛ آنگاه شما را از آنچه انجام می‌دادید خبر می‌دهد!»"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "بگو همانا مرگی که از آن گریزانید رسنده است به شما سپس بازگردانیده شوید بسوی دانای نهان و هویدا تا آگهیتان دهد بدانچه بودید می‌کردید"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "بگو: همانا مرگى كه از آن مى‌گريزيد شما را ديدار مى‌كند، سپس به سوى داناى نهان و آشكارا بازگردانيده مى‌شويد آنگاه شما را بدانچه مى‌كرديد آگاه مى‌كند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بگو: «بی‌گمان مرگی که از آن می‌گریزید، بی‌چون همان گریبانگیرتان است‌؛ آن‌گاه سوی (خدای) دانای نهان و آشکار (جهان) برگردانیده خواهید شد؛ پس به آنچه - انجام می‌داده‌‌اید – به خوبی آگاهتان خواهد کرد.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Tell them: \"Death from which you run, will surely come to you. You will then be sent back to Him who knows the unknown and the known, who will tell you what you used to do."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Indeed death which you run away from will surely confront you, then you will be returned to Him Who knows all the hidden and the visible – He will then inform you of what you did.”"}, {"lang": "en", "name": "A. J. Arberry", "text": "Say: 'Surely death, from which you flee, shall encounter you; then you shall be returned to the Knower of the Unseen and the Visible, and He will tell you that you have been doing.'"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Say thou: verily the death which ye flee from! then verily it will meet you and thereafter ye will be brought back Unto the Knower of the unseen and the seen, and He will declare Unto you that which ye have been working."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Say (to them): \"Verily, the death from which you flee will surely meet you, then you will be sent back to (Allah), the All-Knower of the unseen and the seen, and He will tell you what you used to do.\""}, {"lang": "en", "name": "Talal Itani", "text": "Say, “The death from which you flee will catch up with you; then you will be returned to the Knower of the Invisible and the Visible, and He will inform you of what you used to do.”"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Tell them: “The death from which you flee will certainly overtake you. Then you will be returned to Him Who fully knows what is hidden and what is manifest. Thereupon He will let you know all that you used to do.”"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Say: \"Verily, the death from which you flee, will surely meet you, then you will be sent back to the Knower of the unseen and the seen, and He will inform you about what you used to do.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Say (unto them, O Muhammad): Lo! the death from which ye shrink will surely meet you, and afterward ye will be returned unto the Knower of the Invisible and the Visible, and He will tell you what ye used to do."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Say, ‘The death that you flee will indeed encounter you. Then you will be returned to the Knower of the sensible and the Unseen, and He will inform you about what you used to do.’"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Say: 'Death from which you flee is sure to reach you. Then you shall be returned to the Knower of the Unseen and the Visible, and He will tell you all that you have done'"}, {"lang": "en", "name": "Saheeh International", "text": "Say, \"Indeed, the death from which you flee - indeed, it will meet you. Then you will be returned to the Knower of the unseen and the witnessed, and He will inform you about what you used to do.\""}, {"lang": "en", "name": "Muhammad Sarwar", "text": "(Muhammad), tell them, \"The death from which you run away will certainly approach you. Then you will be returned to the One who knows the unseen and the seen, and He will tell you what you have done\"."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Say: (As for) the death from which you flee, that will surely overtake you, then you shall be sent back to the Knower of the unseen and the seen, and He will inform you of that which you did."}, {"lang": "en", "name": "English Transliteration", "text": "Qul inna almawta alla<u>th</u>ee tafirroona minhu fainnahu mul<u>a</u>qeekum thumma turaddoona il<u>a</u> AA<u>a</u>limi alghaybi wa<b>al</b>shshah<u>a</u>dati fayunabbiokum bim<u>a</u> kuntum taAAmaloon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "So say, \"The death you run away from will certainly meet you, and thereafter you will be brought back to the Knower of the unseen and the seen, and He will declare to you what you have done.\""}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Say: \"The Death from which ye flee will truly overtake you: then will ye be sent back to the Knower of things secret and open: and He will tell you (the truth of) the things that ye did!\""}]}, {"index": 5186, "local_index": 9, "part_type": "Verse", "path": "/books/quran:62:9", "text": "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا إِذَا نُودِيَ‌ لِلصَّلاَةِ مِنْ‌ يَوْمِ‌ الْجُمُعَةِ فَاسْعَوْا إِلَى‌ ذِکْرِ اللَّهِ‌ وَ ذَرُوا الْبَيْعَ‌ ذٰلِکُمْ‌ خَيْرٌ لَکُمْ‌ إِنْ‌ کُنْتُمْ‌ تَعْلَمُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای مؤمنان! چون برای نماز روز جمعه ندا دهند، به سوی ذکر خدا بشتابید، و خرید و فروش را رها کنید. که این [اقامه نماز جمعه و ترک خرید و فروش] برای شما بهتر است اگر [به پاداشش] معرفت و آگاهی داشتید."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى كسانى كه ايمان آورده‌ايد، چون نداى نماز روز جمعه دردهند، به نماز بشتابيد و داد و ستد را رها كنيد. اگر دانا باشيد، اين كار برايتان بهتر است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى كسانى كه ايمان آورده‌ايد! چون براى نماز روز جمعه ندا داده شد، به سوى ذكر خدا بشتابيد و داد و ستد را واگذاريد كه اين براى شما بهتر است، اگر مى‌دانستيد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى كسانى كه ايمان آورده‌ايد، چون براى نماز جمعه ندا درداده شد، به سوى ذكر خدا بشتابيد، و داد و ستد را واگذاريد. اگر بدانيد اين براى شما بهتر است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "ای کسانی که ایمان آورده‌اید، هر گاه (شما را) برای نماز روز جمعه بخوانند فی الحال به ذکر خدا بشتابید و کسب و تجارت رها کنید که این اگر بدانید برای شما بهتر خواهد بود."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای مؤمنان! هنگامی که روز آدینه برای نماز جمعه اذان گفته شد، به سوی ذکر و عبادت خدا بشتابید و داد و ستد را رها سازید. این (چیزی که بدان دستور داده می‌شوید) برای شما بهتر و سودمندتر است اگر متوجّه باشید. [[«نُودِیَ»: مجهول (نادی) از مصدر نِداء است. «مِن یَوْمِ الْجُمُعَةِ»: در روز جمعه. حرف (مِنْ) به معنی (فِی) است. مثل: أَرُونِی مَاذَا خَلَقُوا مِنَ الأرْضِ فَاطِرَ / 40 (نگا: روح‌المعانی). «ذِکْرِاللهِ»: اطاعت از خدا. مراد خطبه و نماز جمعه است (نگا: المصحف المیسر). «الْبَیْعَ»: معامله و تجارت. مراد هر نوع کسب و کار و پیشه است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای مؤمنان چون برای نماز روز جمعه بانگ [اذن‌] در داده شود، به سوی یاد کرد خداوند بشتابید و خرید و فروش را رها کنید، اگر بدانید این برایتان بهتر است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای کسانی که ایمان آورده‌اید! هنگامی که برای نماز روز جمعه اذان گفته شود، به سوی ذکر خدا بشتابید و خرید و فروش را رها کنید که این برای شما بهتر است اگر می‌دانستید!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای آنان که ایمان آوردید هر گاه بانگ داده شود برای نماز از روز جمعه (آدینه) پس بشتابید بسوی یاد خدا و رها کنید سوداگری را این بهتر است برای شما اگر بدانید"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى كسانى كه ايمان آورده‌ايد، چون براى نماز روز آدينه آواز دهند، به ذكر خدا- يعنى نماز جمعه- بشتابيد، و خريد و فروش را رها كنيد. اين براى شما بهتر است اگر دانسته باشيد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای کسانی که ایمان آوردید! هنگامی که برای نماز از روز جمعه ندا(ی اذان) در داده شد، سوی یاد خدا بشتابید و دادوستد را واگذارید. اگر می‌دانسته‌اید همین برای شما بهتر است."}, {"lang": "en", "name": "Ahmed Ali", "text": "O you who believe, when the call to prayer is made on the day of congregation, hasten to remember God, putting aside your business. This is better for you if you can understand."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O People who Believe! When the call for prayer is given on (Friday) the day of congregation, rush towards the remembrance of Allah and stop buying and selling; this is better for you if you understand."}, {"lang": "en", "name": "A. J. Arberry", "text": "O believers, when proclamation is made for prayer on the Day of Congregation, hasten to God's remembrance and leave trafficking aside; that is better for you, did you but know."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "O ye who believe! when the call to prayer is made on the day of Friday then repair Unto the remembrance of Allah and leave off bargaining. That is better for you if ye know"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O you who believe (Muslims)! When the call is proclaimed for the Salat (prayer) on the day of Friday (Jumu'ah prayer), come to the remembrance of Allah [Jumu'ah religious talk (Khutbah) and Salat (prayer)] and leave off business (and every other thing), that is better for you if you did but know!"}, {"lang": "en", "name": "Talal Itani", "text": "O you who believe! When the call is made for prayer on Congregation Day, hasten to the remembrance of God, and drop all business. That is better for you, if you only knew."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Believers, when the call for Prayer is made on Friday, hasten to the remembrance of Allah and give up all trading. That is better for you, if you only knew."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O you who believe! When the call is proclaimed for the Salah on Al-Jumu`ah (Friday), then hasten (Fas`aw) to the remembrance of Allah and leave off business. That is better for you if you did but know!"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O ye who believe! When the call is heard for the prayer of the day of congregation, haste unto remembrance of Allah and leave your trading. That is better for you if ye did but know."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O you who have faith! When the call is made for prayer on Friday, hurry toward the remembrance of Allah, and leave all business. That is better for you, should you know."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believers, when you are called to prayer on the Day of the Congregation (Friday), hasten to the Remembrance of Allah and put your trading to oneside. That is the best for you, if you but knew."}, {"lang": "en", "name": "Saheeh International", "text": "O you who have believed, when [the adhan] is called for the prayer on the day of Jumu'ah [Friday], then proceed to the remembrance of Allah and leave trade. That is better for you, if you only knew."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Believers, on Friday when the call for prayer is made, try to attend prayer (remembering God) and leave off all business. This would be better for you if only you knew it."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O you who believe! when the call is made for prayer on Friday, then hasten to the remembrance of Allah and leave off trading; that is better for you, if you know."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo i<u>tha</u> noodiya li<b>l</b><u>ss</u>al<u>a</u>ti min yawmi aljumuAAati fa<b>i</b>sAAaw il<u>a</u> <u>th</u>ikri All<u>a</u>hi wa<u>th</u>aroo albayAAa <u>tha</u>likum khayrun lakum in kuntum taAAlamoon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believers! When the call to prayer is made on the day of congregation, hasten to the remembrance of God, and leave all worldly commerce: this is for your own good, if you but knew it."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O ye who believe! When the call is proclaimed to prayer on Friday (the Day of Assembly), hasten earnestly to the Remembrance of Allah, and leave off business (and traffic): That is best for you if ye but knew!"}]}, {"index": 5187, "local_index": 10, "part_type": "Verse", "path": "/books/quran:62:10", "text": "فَإِذَا قُضِيَتِ‌ الصَّلاَةُ فَانْتَشِرُوا فِي‌ الْأَرْضِ‌ وَ ابْتَغُوا مِنْ‌ فَضْلِ‌ اللَّهِ‌ وَ اذْکُرُوا اللَّهَ‌ کَثِيراً لَعَلَّکُمْ‌ تُفْلِحُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و چون نماز پایان گیرد، در زمین پراکنده شوید و از فضل و رزق خدا جویا شوید و خدا را بسیار یاد کنید تا رستگار شوید."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و چون نماز پايان يافت، در زمين پراكنده شويد و رزق خدا را طلب كنيد و فراوانش ياد كنيد. باشد كه رستگار شويد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و چون نماز پايان گرفت، در زمين پراكنده شويد و از فضل خدا [روزى‌] بجوييد و خدا را بسيار ياد كنيد، باشد كه رستگار شويد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و چون نماز گزارده شد، در [روى‌] زمين پراكنده گرديد و فضل خدا را جويا شويد و خدا را بسيار ياد كنيد، باشد كه شما رستگار گرديد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "پس آن‌گاه که نماز پایان یافت (بعد از ظهر جمعه باز در پی کسب و کار خود رفته و) روی زمین منتشر شوید و از فضل و کرم خدا (روزی) طلبید، و یاد خدا بسیار کنید تا مگر رستگار و سعادتمند گردید."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آنگاه که نماز خوانده شد، در زمین پراکنده گردید و به دنبال رزق و روزی خدا بروید و خدای را (با دل و زبان) بسیار یاد کنید، تا این که رستگار شوید. [[«قُضِیَتْ»: اداء گردید و انجام پذیرفت. «إنتَشِرُوا»: پراکنده و متفرق شوید. «إبْتَغُوا»: جستجو کنید. بطلبید.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "سپس چون نماز گزارده شود، در زمین پراکنده شوید [و به راه خود بروید] و [روزی خود] از بخشش الهی بجویید، و خداوند را بسیار یاد کنید، باشد که رستگار شوید"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و هنگامی که نماز پایان گرفت (شما آزادید) در زمین پراکنده شوید و از فضل خدا بطلبید، و خدا را بسیار یاد کنید شاید رستگار شوید!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "سپس گاهی که پایان یافت نماز پس پراکنده شوید در زمین و بجوئید از فضل خدا و یاد کنید خدا را بسیار شاید رستگار شوید"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "پس چون نماز گزارده شد، [مى‌توانيد] در زمين پراكنده شويد و از فضل خدا بجوييد- يعنى با كسب و كار روزى بجوييد- و خداى را بسيار ياد كنيد، شايد كه رستگار شويد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس چون نماز گزارده شد در (روی) زمین (و زمینه‌ی کارتان) پراکنده گردید و از فضل خدا جویا شوید و خدا را بسیار یاد کنید، شاید شما رستگار کنید."}, {"lang": "en", "name": "Ahmed Ali", "text": "And when the service of prayer is over spread out in the land, and look for the bounty of God. and remember God a great deal that you may prosper."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And when the prayer ends, spread out in the land and seek Allah’s munificence, and profusely remember Allah, in the hope of attaining success."}, {"lang": "en", "name": "A. J. Arberry", "text": "Then, when the prayer is finished, scatter in the land and seek God's bounty, and remember God frequently; haply you will prosper."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Then, when the prayer is ended, disperse in the land and seek of Allah's grace, and remember Allah much, that haply ye may thrive."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Then when the (Jumu'ah) Salat (prayer) is finished, you may disperse through the land, and seek the Bounty of Allah (by working, etc.), and remember Allah much, that you may be successful."}, {"lang": "en", "name": "Talal Itani", "text": "Then, when the prayer is concluded, disperse through the land, and seek God’s bounty, and remember God much, so that you may prosper."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "But when the Prayer is ended, disperse in the land and seek Allah's Bounty, and remember Allah much so that you may prosper."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Then when the Salah is complete, you may disperse through the land, and seek the bounty of Allah, and remember Allah much, that you may be successful."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And when the prayer is ended, then disperse in the land and seek of Allah's bounty, and remember Allah much, that ye may be successful."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "And when the prayer is finished disperse through the land and seek Allah’s grace, and remember Allah much so that you may be felicitous."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Then, when the prayer has ended, disperse in the land and seek the favor of Allah, and, remember Allah often, so that you prosper."}, {"lang": "en", "name": "Saheeh International", "text": "And when the prayer has been concluded, disperse within the land and seek from the bounty of Allah, and remember Allah often that you may succeed."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "When the prayer ends, disperse through the land and seek the favor of God. Remember Him often so that perhaps you will have everlasting happiness."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "But when the prayer is ended, then disperse abroad in the land and seek of Allah's grace, and remember Allah much, that you may be successful."}, {"lang": "en", "name": "English Transliteration", "text": "Fai<u>tha</u> qu<u>d</u>iyati a<b>l</b><u>ss</u>al<u>a</u>tu fa<b>i</b>ntashiroo fee alar<u>d</u>i wa<b>i</b>btaghoo min fa<u>d</u>li All<u>a</u>hi wa<b>o</b><u>th</u>kuroo All<u>a</u>ha katheeran laAAallakum tufli<u>h</u>oon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "When the prayer is ended, disperse in the land and seek to obtain [something] of God's bounty; and remember God much, so that you may prosper."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "And when the Prayer is finished, then may ye disperse through the land, and seek of the Bounty of Allah: and celebrate the Praises of Allah often (and without stint): that ye may prosper."}]}, {"index": 5188, "local_index": 11, "part_type": "Verse", "path": "/books/quran:62:11", "text": "وَ إِذَا رَأَوْا تِجَارَةً أَوْ لَهْواً انْفَضُّوا إِلَيْهَا وَ تَرَکُوکَ‌ قَائِماً قُلْ‌ مَا عِنْدَ اللَّهِ‌ خَيْرٌ مِنَ‌ اللَّهْوِ وَ مِنَ‌ التِّجَارَةِ وَ اللَّهُ‌ خَيْرُ الرَّازِقِينَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و [برخی از مردم] چون تجارت یا مایه سرگرمی ببینند [از صف یک پارچه نماز] به سوی آن پراکنده شوند و تو را در حالی که [بر خطبه نماز] ایستاده ای، رها کنند. بگو: پاداش و ثوابی که نزد خداست از سرگرمی و تجارت بهتر است، و خدا بهترین روزی دهندگان است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و چون تجارتى يا بازيچه‌اى بينند پراكنده مى‌شوند و به جانب آن مى‌روند و تو را همچنان ايستاده رها مى‌كنند. بگو: آنچه در نزد خداست از بازيچه و تجارت بهتر است. و خدا بهترين روزى‌دهندگان است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و هنگامى كه داد و ستد يا سرگرمى‌اى ديدند به سوى آن پراكنده شدند و تو را به حال ايستاده رها كردند. بگو: آنچه نزد خداست از سرگرمى و تجارت بهتر است، و خدا بهترين روزى دهندگان است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و چون داد و ستد يا سرگرميى ببينند، به سوى آن روى‌آور مى‌شوند، و تو را در حالى كه ايستاده‌اى ترك مى‌كنند. بگو: «آنچه نزد خداست از سرگرمى و از داد و ستد بهتر است، و خدا بهترين روزى دهندگان است.»"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و این مردم (سست ایمان) چون تجارتی یا لهو و بازیچه‌ای ببینند بدان شتابند و تو را در نماز تنها گذارند؛ بگو که آنچه نزد خداست (یعنی ثواب آخرت و بهشت ابد) بسیار برای شما از لهو و لعب و تجارت (های دنیا) بهتر است و خدا بهترین روزی‌دهنده است. (در شأن نزول آیه جابر روایت کرد که قومی با رسول صلّی اللّه علیه و آله و سلّم نماز جمعه می‌خواندند، آواز طبل کاروان تجارت شنیدند، همه از پی تجارت و صدای لهو طبل رفتند جز هشت یا دوازده تن. رسول صلّی اللّه علیه و آله و سلّم فرمود: اگر این عده هم می‌رفتند عذاب خدا بر امت نازل می‌شد)"}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "(برخی از اصحاب، در یکی از جمعه‌ها) هنگامی که تجارت و یا سرگرمیی را دیدند از پیرامون تو پراکنده شدند، و تو را ایستاده (بر منبر، در حال خطبه) رها کردند! بگو: آنچه در پیش خدا (از فضل و ثواب) است، بهتر از سرگرمی و بازرگانی است، و خدا بهترین روزی‌رسان است. [[«تِجَارَةً»: مراد کاروانی است که در وقت خطبه‌های جمعه از شام آمده بود. «لَهْواً»: سرگرمی. مراد طبلی است که به هنگام آمدن کاروان برای آگهی نواخته می‌شد. «إنفَضُّوا»: پخش و پراکنده شدند. «إلَیْهَا»: مرجع (ها) تجارت است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و [غافلان‌] چون داد و ستدی یا سرگرمی‌ای ببینند، به سوی آن بشتابند و تو را ایستاده رها کنند، بگو آنچه نزد خداوند است از سرگرمی و از داد و ستد بهتر است، و خداوند بهترین روزی‌دهندگان است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "هنگامی که آنها تجارت یا سرگرمی و لهوی را ببینند پراکنده می‌شوند و به سوی آن می روند و تو را ایستاده به حال خود رها می‌کنند؛ بگو: آنچه نزد خداست بهتر از لهو و تجارت است، و خداوند بهترین روزی‌دهندگان است."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و هر گاه بینند سوداگریی یا هوسرانی بروند بسویش و بگذارندت ایستاده بگو آنچه نزد خدا است بهتر است از هوسرانی و از سوداگری و خدا است بهترین روزی‌دهندگان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و چون بازرگانيى- يعنى كاروان بازرگانى- يا سرگرميى را ببينند به سوى آن پراكنده مى‌شوند و تو را ايستاده- در حال خواندن خطبه- رها مى‌كنند! بگو: آنچه نزد خداست از سرگرمى و از بازرگانى بهتر است و خدا بهترين روزى‌دهندگان است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و هنگامی که دادوستد یا سرگرمی بازدارنده‌ی از خدا را ببینند، سوی آن پراکنده می‌شوند و تو را در حالی که ایستاده‌ای وا می‌نهند. بگو: «آنچه نزد خداست از لهو و (حتی) از دادوستد بهتر است و خدا بهترین روزی‌دهندگان است.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Yet when they see some buying and selling, or some sport, they go for it, leaving you standing. Tell them: \"What is with God is better than your sport and commerce. And God is the best of providers.\""}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And when they see some trade or sport, they move towards it and leave you standing delivering the sermon; proclaim, “That which is with Allah, is better than sport and trade; and the sustenance of Allah is the best.”"}, {"lang": "en", "name": "A. J. Arberry", "text": "But when they see merchandise or diversion they scatter off to it, and they leave thee standing. Say: 'What is with God is better than diversion and merchandise. God is the best of providers.'"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And when they beheld merchandise or sport, they flocked thereto, and left thee standing. Say thou: that which is with Allah is better than sport and better than merchandise; and Allah is the Best of providers."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And when they see some merchandise or some amusement [beating of Tambur (drum) etc.] they disperse headlong to it, and leave you (Muhammad SAW) standing [while delivering Jumu'ah's religious talk (Khutbah)]. Say \"That which Allah has is better than any amusement or merchandise! And Allah is the Best of providers.\""}, {"lang": "en", "name": "Talal Itani", "text": "Yet whenever they come across some business, or some entertainment, they scramble towards it, and leave you standing. Say, “What is with God is better than entertainment and business; and God is the Best of providers.”"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Yet no sooner than they saw some trading or amusement, they flocked to it and left you standing by yourself. Tell them: “That which is with Allah is far better than amusement and trading. Allah is the Best Provider of sustenance.”"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And when they see some merchandise or some amusement, they disperse headlong to it, and leave you standing. Say: \"That which Allah has is better than any amusement or merchandise! And Allah is the best of providers.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "But when they spy some merchandise or pastime they break away to it and leave thee standing. Say: That which Allah hath is better than pastime and than merchandise, and Allah is the Best of providers."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "When they sight a deal or a diversion, they scatter off towards it and leave you standing! Say, ‘What is with Allah is better than diversion and dealing, and Allah is the best of providers.’"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Yet when they see some commerce or amusement they flock to it, leaving you standing. Say: 'That which is with Allah is better than the amusement and commerce. Allah is the Best of Providers'"}, {"lang": "en", "name": "Saheeh International", "text": "But when they saw a transaction or a diversion, [O Muhammad], they rushed to it and left you standing. Say, \"What is with Allah is better than diversion and than a transaction, and Allah is the best of providers.\""}, {"lang": "en", "name": "Muhammad Sarwar", "text": "When they see some merchandise or some sport, they rush towards it and leave you alone standing. Say, \"(God's rewards for good deeds) are better than merriment or merchandise; God is the best Sustainer\"."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And when they see merchandise or sport they break up for It, and leave you standing. Say: What is with Allah is better than sport and (better) than merchandise, and Allah is the best of Sustainers."}, {"lang": "en", "name": "English Transliteration", "text": "Wai<u>tha</u> raaw tij<u>a</u>ratan aw lahwan infa<u>dd</u>oo ilayh<u>a</u> watarakooka q<u>a</u>iman qul m<u>a</u> AAinda All<u>a</u>hi khayrun mina allahwi wamina a<b>l</b>ttij<u>a</u>rati wa<b>A</b>ll<u>a</u>hu khayru a<b>l</b>rr<u>a</u>ziqeen<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Yet when they see some merchandise or entertainment, they break away to go to it and leave you standing. Say, \"That which God has in store is far better than any merchandise or entertainment.\" God is the most munificent Giver."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "But when they see some bargain or some amusement, they disperse headlong to it, and leave thee standing. Say: \"The (blessing) from the Presence of Allah is better than any amusement or bargain! and Allah is the Best to provide (for all needs).\""}]}]}, "index": "quran:62", "kind": "verse_list"}