{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 63"
        },
        "path": "/books/quran:63",
        "titles": {
          "ar": "المنافقون",
          "en": "The Hypocrites",
          "ent": "Al-Munaafiqoon"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 63,
    "local_index": 63,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 64"
        },
        "path": "/books/quran:64",
        "titles": {
          "ar": "التغابن",
          "en": "Mutual Disillusion",
          "ent": "At-Taghaabun"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/quran:62",
        "titles": {
          "ar": "الجمعة",
          "en": "Friday",
          "ent": "Al-Jumu'a"
        }
      },
      "up": {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      }
    },
    "order": 104,
    "part_type": "Chapter",
    "path": "/books/quran:63",
    "reveal_type": "Medinan",
    "rukus": 2,
    "titles": {
      "ar": "المنافقون",
      "en": "The Hypocrites",
      "ent": "Al-Munaafiqoon"
    },
    "verse_count": 11,
    "verse_start_index": 5188,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 5189,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:63:1",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:108:88",
            "/books/al-kafi:1:4:108:91"
          ]
        },
        "text": [
          "إِذَا جَاءَکَ‌ الْمُنَافِقُونَ‌ قَالُوا نَشْهَدُ إِنَّکَ‌ لَرَسُولُ‌ اللَّهِ‌ وَ اللَّهُ‌ يَعْلَمُ‌ إِنَّکَ‌ لَرَسُولُهُ‌ وَ اللَّهُ‌ يَشْهَدُ إِنَ‌ الْمُنَافِقِينَ‌ لَکَاذِبُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "WHEN THE HYPOCRITES come to you, they say: \"We affirm that you are the Apostle of God.\" God indeed knows you are His Apostle. God bears witness that the hypocrites are indeed liars."
          ],
          "en.ahmedraza": [
            "When the hypocrites come in your presence (O dear Prophet Mohammed – peace and blessings be upon him) they say, “We testify that you surely are Allah’s Noble Messenger”; and Allah knows that you indeed are His Noble Messenger, and Allah testifies that the hypocrites are indeed liars."
          ],
          "en.arberry": [
            "When the hypocrites come to thee they say, 'We bear witness that thou art indeed the Messenger of God.' And God knows that thou art indeed His Messenger, and God bears witness that the hypocrites are truly liars."
          ],
          "en.daryabadi": [
            "When the hypocrites come Unto thee, they say: we bear witness that thou art indeed the apostle of Allah. Allah knoweth that thou art indeed His apostle, and Allah beareth witness that; the hypocrites are indeed liars."
          ],
          "en.hilali": [
            "When the hypocrites come to you (O Muhammad SAW), they say: \"We bear witness that you are indeed the Messenger of Allah.\" Allah knows that you are indeed His Messenger and Allah bears witness that the hypocrites are liars indeed."
          ],
          "en.itani": [
            "When the hypocrites come to you, they say, “We bear witness that you are God’s Messenger.” God knows that you are His Messenger, and God bears witness that the hypocrites are liars."
          ],
          "en.maududi": [
            "(O Prophet), when the hypocrites come to you, they say: “We bear witness that you are certainly Allah's Messenger.” Allah certainly knows that you are His Messenger. But Allah also bears witness that the hypocrites are utter liars!"
          ],
          "en.mubarakpuri": [
            "When the hypocrites come to you, they say: \"We bear witness that you are indeed the Messenger of Allah.\" Allah knows that you are indeed His Messenger, and Allah bears witness that the hypocrites are liars indeed."
          ],
          "en.pickthall": [
            "When the hypocrites come unto thee (O Muhammad), they say: We bear witness that thou art indeed Allah's messenger. And Allah knoweth that thou art indeed His messenger, and Allah beareth witness that the hypocrites indeed are speaking falsely."
          ],
          "en.qarai": [
            "When the hypocrites come to you they say, ‘We bear witness that you are indeed the apostle of Allah.’ Allah knows that you are indeed His Apostle, and Allah bears witness that the hypocrites are indeed liars."
          ],
          "en.qaribullah": [
            "When the hypocrites come to you they say: 'We bear witness that you are the Messenger of Allah' Allah knows that you (Prophet Muhammad) are indeedHis Messenger, and Allah bears witness that the hypocrites are truly liars!"
          ],
          "en.sahih": [
            "When the hypocrites come to you, [O Muhammad], they say, \"We testify that you are the Messenger of Allah.\" And Allah knows that you are His Messenger, and Allah testifies that the hypocrites are liars."
          ],
          "en.sarwar": [
            "When the hypocrites come to you, they say, \"We testify that you are the Messenger of God.\" God knows that you are His Messenger. God testifies that they hypocrites are liars."
          ],
          "en.shakir": [
            "When the hypocrites come to you, they say: We bear witness that you are most surely Allah's Apostle; and Allah knows that you are most surely His Apostle, and Allah bears witness that the hypocrites are surely liars."
          ],
          "en.transliteration": [
            "I<u>tha</u> j<u>a</u>aka almun<u>a</u>fiqoona q<u>a</u>loo nashhadu innaka larasoolu All<u>a</u>hi wa<b>A</b>ll<u>a</u>hu yaAAlamu innaka larasooluhu wa<b>A</b>ll<u>a</u>hu yashhadu inna almun<u>a</u>fiqeena lak<u>ath</u>iboon<b>a</b>"
          ],
          "en.wahiduddin": [
            "When the hypocrites come to you, they say, \"We bear witness that you are indeed the Messenger of God.\" God knows that you are indeed His Messenger, but God bears witness that the hypocrites are surely liars --"
          ],
          "en.yusufali": [
            "When the Hypocrites come to thee, they say, \"We bear witness that thou art indeed the Messenger of Allah.\" Yea, Allah knoweth that thou art indeed His Messenger, and Allah beareth witness that the Hypocrites are indeed liars."
          ],
          "fa.ansarian": [
            "چون منافقان نزد تو آیند، می گویند: گواهی می دهیم که تو بی تردید فرستاده خدایی. و خدا می داند که تو بی تردید فرستاده اویی، و خدا گواهی می دهد که یقیناً منافقان دروغگویند."
          ],
          "fa.ayati": [
            "چون منافقان نزد تو آيند، گويند: شهادت مى‌دهيم كه تو پيامبر خدا هستى. خدا مى‌داند كه تو پيامبرش هستى و خدا شهادت مى‌دهد كه منافقان دروغگويند."
          ],
          "fa.bahrampour": [
            "چون منافقان نزد تو آيند گويند: گواهى مى‌دهيم كه تو واقعا رسول خدايى. و خدا مى‌داند كه تو واقعا رسول اويى، و خدا گواهى مى‌دهد كه منافقان قطعا دروغگويند"
          ],
          "fa.fooladvand": [
            "چون منافقان نزد تو آيند گويند: «گواهى مى‌دهيم كه تو واقعاً پيامبر خدايى.» و خدا [هم‌] مى‌داند كه تو واقعاً پيامبر او هستى، و خدا گواهى مى‌دهد كه مردم دوچهره سخت دروغگويند."
          ],
          "fa.ghomshei": [
            "(ای رسول ما) چون منافقان ریاکار نزد تو آیند گویند که ما به یقین و حقیقت گواهی می‌دهیم که تو رسول خدایی؛ و خدا می‌داند که تو رسول اویی و خدا هم گواهی می‌دهد که منافقان سخن دروغ می‌گویند."
          ],
          "fa.khorramdel": [
            "هنگامی که منافقان نزد تو می‌آیند، سوگند می‌خورند و می‌گویند: ما گواهی می‌دهیم که تو حتماً فرستاده‌ی خدا هستی! - خداوند می‌داند که تو فرستاده‌ی خدا می‌باشی - ولی خدا گواهی می‌دهد که منافقان در گفته‌ی خود دروغگو هستند (چرا که به سخنان خود ایمان ندارند). [[«نَشْهَدُ إِنَّکَ ...»: هنگامی که فرد عربی می‌گوید: أَشْهَدُ إِنَّ ... مقصودش قسم یاد کردن به خدا است که او در گفتار خود صادق است (نگا: المصحف المیسّر). «وَاللهُ یَعْلَمُ إِنَّکَ لَرَسُولُهُ»: جمله معترضه است.]]"
          ],
          "fa.khorramshahi": [
            "منافقان چون به نزد تو آیند گویند گواهی می‌دهیم که تو پیامبر خدا هستی، و خداوند می‌داند که تو پیامبرش هستی، و خداوند گواهی می‌دهد که منافقان دروغگو هستند"
          ],
          "fa.makarem": [
            "هنگامی که منافقان نزد تو آیند می‌گویند: «ما شهادت می‌دهیم که یقیناً تو رسول خدایی!» خداوند می‌داند که تو رسول او هستی، ولی خداوند شهادت می‌دهد که منافقان دروغگو هستند (و به گفته خود ایمان ندارند)."
          ],
          "fa.moezzi": [
            "هر گاه آیندت دورویان گویند گواهی دهیم که توئی پیمبر خدا و خدا داند که توئی فرستاده او و خدا گواهی دهد که دورویانند همانا دروغگویان‌"
          ],
          "fa.mojtabavi": [
            "چون منافقان- آنها كه دل و زبانشان يكى نيست- نزد تو آيند، گويند: گواهى مى‌دهيم كه هر آينه تو فرستاده خدايى. و خدا مى‌داند كه تو فرستاده اويى، و خدا گواهى مى‌دهد كه همانا منافقان دروغگويند."
          ],
          "fa.sadeqi": [
            "هنگامی که منافقان نزد تو آیند گویند: «گواهی می‌دهیم که تو همی به‌راستی پیامبر خدایی‌.» و خدا (هم) می‌داند که تو به‌راستی و درستی پیامبر او هستی، و خدا گواهی می‌دهد که مردم دورو بی‌گمان سخت دروغگویانند."
          ]
        }
      },
      {
        "index": 5190,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:63:2",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:108:88",
            "/books/al-kafi:1:4:108:91"
          ]
        },
        "text": [
          "اتَّخَذُوا أَيْمَانَهُمْ‌ جُنَّةً فَصَدُّوا عَنْ‌ سَبِيلِ‌ اللَّهِ‌ إِنَّهُمْ‌ سَاءَ مَا کَانُوا يَعْمَلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They have made their oaths a shield in order to obstruct others from the way of God. It is certainly evil what they do."
          ],
          "en.ahmedraza": [
            "They have taken their oaths as a shield, thereby prevented others from Allah’s way; indeed they commit extremely evil deeds."
          ],
          "en.arberry": [
            "They have taken their oaths as a covering, then they have barred from the way of God. Surely they -- evil are the things they have been doing."
          ],
          "en.daryabadi": [
            "They have taken their oaths for a shield; then they turn away men from the way of Allah. Verily vile is that which they have been working."
          ],
          "en.hilali": [
            "They have made their oaths a screen (for their hypocrisy). Thus they hinder (men) from the Path of Allah. Verily, evil is what they used to do."
          ],
          "en.itani": [
            "They treat their oaths as a cover, and so they repel others from God’s path. Evil is what they do."
          ],
          "en.maududi": [
            "They shelter behind their oath, and thus hinder their own selves and others from the Path of Allah. Evil indeed is what they do."
          ],
          "en.mubarakpuri": [
            "They have made their oaths a screen. Thus they hinder (others) from the path of Allah. Verily, evil is what they used to do."
          ],
          "en.pickthall": [
            "They make their faith a pretext so that they may turn (men) from the way of Allah. Verily evil is that which they are wont to do,"
          ],
          "en.qarai": [
            "They make a shield of their oaths, and bar from the way of Allah. Evil indeed is what they used to do."
          ],
          "en.qaribullah": [
            "They have taken their oaths as a cover and barred others from the Path of Allah. Evil is what they have done."
          ],
          "en.sahih": [
            "They have taken their oaths as a cover, so they averted [people] from the way of Allah. Indeed, it was evil that they were doing."
          ],
          "en.sarwar": [
            "They have chosen their oaths as a shield for them to obstruct others from the way of God. How terrible is what they do!"
          ],
          "en.shakir": [
            "They make their oaths a shelter, and thus turn away from Allah's way; surely evil is that which they do."
          ],
          "en.transliteration": [
            "Ittakha<u>th</u>oo aym<u>a</u>nahum junnatan fa<u>s</u>addoo AAan sabeeli All<u>a</u>hi innahum s<u>a</u>a m<u>a</u> k<u>a</u>noo yaAAmaloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "they use their oaths as a cover and thus they bar others from God's way: what they have been doing is truly evil --"
          ],
          "en.yusufali": [
            "They have made their oaths a screen (for their misdeeds): thus they obstruct (men) from the Path of Allah: truly evil are their deeds."
          ],
          "fa.ansarian": [
            "سوگندهایشان را [برای شناخته نشدن نفاقشان] سپر گرفته در نتیجه [مردم را] از راه خدا بازداشته اند. چه بد است آنچه را اینان همواره انجام می دهند!"
          ],
          "fa.ayati": [
            "از سوگندهاى خود سپرى ساختند و از راه خدا بازداشتند و به حقيقت، آنچه مى‌كنند ناپسند است."
          ],
          "fa.bahrampour": [
            "سوگندهاى خود را سپرى گرفته‌اند، و از راه خدا بازداشته‌اند. به راستى آنها بد عمل مى‌كنند"
          ],
          "fa.fooladvand": [
            "سوگندهاى خود را [چون‌] سپرى بر خود گرفته و [مردم را] از راه خدا بازداشته‌اند. راستى كه آنان چه بد مى‌كنند."
          ],
          "fa.ghomshei": [
            "قسمهای (دروغ) خود را سپر جان خویش (و مایه فریب خلق) قرار داده‌اند و بدین وسیله راه خدا را (به روی خلق) بسته‌اند، آنان آنچه می‌کنند بسیار بد می‌کنند."
          ],
          "fa.khorramdel": [
            "آنان سوگندهای (دروغین) خود را سپری (برای رهائی از گرفتار آمدن به دست عدالت، و پوشاندن چهره‌ی واقعی خویش) می‌گردانند، و (خود را و مردمان را) از راه خدا بازمی‌دارند. ایشان چه کار بدی می‌کنند! [[«جُنَّةً»: سپر (نگا: مجادله / 16). «صَدُّوا عَن سَبِیلِ اللهِ»: (نگا: نساء / 167، توبه / 9، نحل / 88).]]"
          ],
          "fa.khorramshahi": [
            "سوگندهایشان را سپر بلا گرفته‌اند، سپس [مردمان را] از راه خدا بازداشته‌اند، چه بد است کاری که آنان می‌کنند"
          ],
          "fa.makarem": [
            "آنها سوگندهایشان را سپر ساخته‌اند تا مردم را از راه خدا باز دارند، و کارهای بسیار بدی انجام می‌دهند!"
          ],
          "fa.moezzi": [
            "برگرفتند سوگندهای خویش را سپری پس بازداشتند از راه خدا همانا زشت است آنچه بودند می‌کردند"
          ],
          "fa.mojtabavi": [
            "سوگندهاى [دروغ‌] خود را سپرى گرفته‌اند، پس از راه خدا روى گردانده‌اند- يا مردم را از راه خدا بازداشته‌اند-. همانا بد است آنچه مى‌كردند- نفاق ورزى-."
          ],
          "fa.sadeqi": [
            "سوگندهای خود را (چون) سپری بر خود بر گرفته، پس (مکلفان را) از راه خدا باز داشته‌اند. به‌راستی که آنان چه بد می‌کرده‌اند."
          ]
        }
      },
      {
        "index": 5191,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:63:3",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:108:88",
            "/books/al-kafi:1:4:108:91"
          ]
        },
        "text": [
          "ذٰلِکَ‌ بِأَنَّهُمْ‌ آمَنُوا ثُمَ‌ کَفَرُوا فَطُبِعَ‌ عَلَى‌ قُلُوبِهِمْ‌ فَهُمْ‌ لاَ يَفْقَهُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "That is because they came to believe, and then renounced (their faith). So their hearts were sealed; and now they do not understand."
          ],
          "en.ahmedraza": [
            "That is because they accepted faith with their tongues then disbelieved with their hearts, therefore their hearts were sealed – so now they do not understand anything."
          ],
          "en.arberry": [
            "That is because they have believed, then they have disbelieved; therefore a seal has been set on their hearts, and they do not understand."
          ],
          "en.daryabadi": [
            "That is, because they believed, and thereafter disbelieved, wherefore their hearts are sealed, so that they understand not."
          ],
          "en.hilali": [
            "That is because they believed, then disbelieved, therefore their hearts are sealed, so they understand not."
          ],
          "en.itani": [
            "That is because they believed, and then disbelieved; so their hearts were sealed, and they cannot understand."
          ],
          "en.maududi": [
            "All that is because they first believed and then disbelieved, and therefore a seal was set on their hearts; as a result they understand nothing."
          ],
          "en.mubarakpuri": [
            "That is because they believed, and then disbelieved; therefore their hearts are sealed, so they understand not."
          ],
          "en.pickthall": [
            "That is because they believed, then disbelieved, therefore their hearts are sealed so that they understand not."
          ],
          "en.qarai": [
            "That is because they believed and then disbelieved, so their hearts were sealed. Hence, they do not understand."
          ],
          "en.qaribullah": [
            "That is because they believed, then disbelieved, because of this a seal has been set upon their hearts so they are unable to understand."
          ],
          "en.sahih": [
            "That is because they believed, and then they disbelieved; so their hearts were sealed over, and they do not understand."
          ],
          "en.sarwar": [
            "This is because they accepted the faith and then rejected it. God has sealed their hearts, thus, they do not have any understanding."
          ],
          "en.shakir": [
            "That is because they believe, then disbelieve, so a seal is set upon their hearts so that they do not understand."
          ],
          "en.transliteration": [
            "<u>Tha</u>lika biannahum <u>a</u>manoo thumma kafaroo fa<u>t</u>ubiAAa AAal<u>a</u> quloobihim fahum l<u>a</u> yafqahoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "that is because they believed and then rejected their faith: their hearts are sealed up, so that they are devoid of understanding."
          ],
          "en.yusufali": [
            "That is because they believed, then they rejected Faith: So a seal was set on their hearts: therefore they understand not."
          ],
          "fa.ansarian": [
            "این [صفت زشت نفاق و بدی اعمال] به سبب آن است که آنان [نخست] ایمان آوردند، سپس کافر شدند در نتیجه بر دل هایشان مهر [تیره بختی] زده شد، به این علّت [حقایق را] نمی فهمند."
          ],
          "fa.ayati": [
            "اين بدان سبب است كه ايمان آوردند، سپس كافر شدند. خدا نيز بر دلهاشان مُهر نهاد و آنان درنمى‌يابند."
          ],
          "fa.bahrampour": [
            "اين بدان سبب است كه آنها ايمان آوردند، سپس كافر شدند، در نتيجه بر دل‌هايشان مهر زده شد. از اين رو آنها نمى‌فهمند"
          ],
          "fa.fooladvand": [
            "اين بدان سبب است كه آنان ايمان آورده، سپس به انكار پرداخته‌اند و در نتيجه بر دلهايشان مُهر زده شده و [ديگر] نمى‌فهمند."
          ],
          "fa.ghomshei": [
            "این (نفاق و بدکاریشان) برای آن است که آنها (به زبان) ایمان آوردند و سپس (به دل) کافر شدند، پس مُهر (قهر و ظلمت) بر دلهاشان نهاده شد تا هیچ (از حقایق ایمان) درک نکنند."
          ],
          "fa.khorramdel": [
            "این (نفاق و دروغگوئی و بازداشتن از دین) بدان خاطر است که (نخست با زبان) ایمان آورده‌اند و سپس (با دل) کافر شده‌اند، پس بر دلهایشان مهر نهاده شد، و ایشان دیگر (حقیقت را درک نمی‌کنند، و از ایمان چیزی) نمی‌فهمند. [[«آمَنُوا ثُمَّ کَفَرُوا»: (نگا: نساء / 137). «ذلِکَ»: این نفاق و دروغ و جلوگیری از دین اسلام که بدان عادت گرفته‌اند. «طُبِعَ عَلی قُلُوبِهِمْ»: (نگا: توبه / 87 و 93، نحل / 108، محمّد / 16).]]"
          ],
          "fa.khorramshahi": [
            "این از آن است که ایشان ایمان آورده‌اند سپس کفر ورزیده‌اند، و بر دلهایشان مهر نهاده شده است، و ایشان در نمی‌یابند"
          ],
          "fa.makarem": [
            "این بخاطر آن است که نخست ایمان آوردند سپس کافر شدند؛ از این رو بر دلهای آنان مهر نهاده شده، و حقیقت را درک نمی‌کنند!"
          ],
          "fa.moezzi": [
            "این بدان است که ایشان ایمان آوردند سپس کافر شدند پس مُهر نهاد بر دلهاشان پس درنیابند"
          ],
          "fa.mojtabavi": [
            "اين [نفاق و بدكاريشان‌] بدان سبب است كه ايمان آوردند- به ظاهر- سپس كافر شدند- در نهان-، پس بر دلهاشان مُهر نهاده شد از اين رو [حق را] در نمى‌يابند."
          ],
          "fa.sadeqi": [
            "این بدین سبب است که آنان ایمان آورده، سپس کافر شدند، در نتیجه بر دل‌هایشان مُهر زده شد و (دیگر) نمی‌توانند بفهمند."
          ]
        }
      },
      {
        "index": 5192,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:63:4",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:2:21:1"
          ]
        },
        "text": [
          "وَ إِذَا رَأَيْتَهُمْ‌ تُعْجِبُکَ‌ أَجْسَامُهُمْ‌ وَ إِنْ‌ يَقُولُوا تَسْمَعْ‌ لِقَوْلِهِمْ‌ کَأَنَّهُمْ‌ خُشُبٌ‌ مُسَنَّدَةٌ يَحْسَبُونَ‌ کُلَ‌ صَيْحَةٍ عَلَيْهِمْ‌ هُمُ‌ الْعَدُوُّ فَاحْذَرْهُمْ‌ قَاتَلَهُمُ‌ اللَّهُ‌ أَنَّى‌ يُؤْفَکُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Pleasing seem their persons when you look at them; and when they talk, you listen to their speech. Yet they are like the wooden panelling of a wall. They imagine every rebuke to be directed against them. They are the enemies, beware of them. May God damn them, how pervert are they!"
          ],
          "en.ahmedraza": [
            "And when you see them, their appearance would please you; and when they speak, you would listen carefully to their speech; like wooden blocks propped against the wall; they assume every cry to be against them; they are the enemy, so beware of them; may Allah slay them! Where are they reverting!"
          ],
          "en.arberry": [
            "When thou seest them, their bodies please thee; but when they speak, thou listenest to their speech, and it is as they were propped-up timbers. They think every cry is against them. They are the enemy; so beware of them. God assail them! How they are perverted!"
          ],
          "en.daryabadi": [
            "And when thou beholdest them, their persons please thee: and if they speak, thou listenest to their discourse; they are as though they were blocks of wood propped up. They deem every shout to be against them. They are the enemy; so beware of them. Perish them Allah! whither are they deviating!"
          ],
          "en.hilali": [
            "And when you look at them, their bodies please you; and when they speak, you listen to their words. They are as blocks of wood propped up. They think that every cry is against them. They are the enemies, so beware of them. May Allah curse them! How are they denying (or deviating from) the Right Path."
          ],
          "en.itani": [
            "When you see them, their appearance impresses you. And when they speak, you listen to what they say. They are like propped-up timber. They think every shout is aimed at them. They are the enemy, so beware of them. God condemns them; how deluded they are!"
          ],
          "en.maududi": [
            "When you look at them, their persons are pleasing, and when they speak, you pay heed to what they say. But in truth they are (merely) beams of timber propped-up (against a wall). They consider every shout they hear to be directed against them. They are your utter enemies; guard against them. May Allah do away with them! How are they being turned away (from the Truth)?"
          ],
          "en.mubarakpuri": [
            "And when you look at them, their bodies please you; and when they speak, you listen to their words. They are as blocks of wood propped up. They think that every cry is against them. They are the enemies, so beware of them. May Allah curse them! How are they denying the right path"
          ],
          "en.pickthall": [
            "And when thou seest them their figures please thee; and if they speak thou givest ear unto their speech. (They are) as though they were blocks of wood in striped cloaks. They deem every shout to be against them. They are the enemy, so beware of them. Allah confound them! How they are perverted!"
          ],
          "en.qarai": [
            "When you see them, their bodies impress you, and if they speak, you listen to their speech. Yet they are like dry logs set reclining [against a wall]. They suppose every cry is directed against them. They are the enemy, so beware of them. May Allah assail them, where do they stray?!"
          ],
          "en.qaribullah": [
            "When you see them their bodies please you, but when they speak and you listen to their sayings, they are like proppedup timber. Every shout (they hear) they take it to be against them. They are the enemy be wary of them. Allah kills them! How perverse they are!"
          ],
          "en.sahih": [
            "And when you see them, their forms please you, and if they speak, you listen to their speech. [They are] as if they were pieces of wood propped up - they think that every shout is against them. They are the enemy, so beware of them. May Allah destroy them; how are they deluded?"
          ],
          "en.sarwar": [
            "Their physical appearance attracts you when you see them and when they speak, you carefully listen to them. In fact, they are like propped up hollow trunks of wood (They are so cowardly) they think that every cry which they hear is against them. They are the enemy, so beware of them. May God condemn them. Where are they turning to, leaving behind the Truth?"
          ],
          "en.shakir": [
            "And when you see them, their persons will please you, and If they speak, you will listen to their speech; (they are) as if they were big pieces of wood clad with garments; they think every cry to be against them. They are the enemy, therefore beware of them; may Allah destroy them, whence are they turned back?"
          ],
          "en.transliteration": [
            "Wai<u>tha</u> raaytahum tuAAjibuka ajs<u>a</u>muhum wain yaqooloo tasmaAA liqawlihim kaannahum khushubun musannadatun ya<u>h</u>saboona kulla <u>s</u>ay<u>h</u>atin AAalayhim humu alAAaduwwu fa<b>i</b><u>hth</u>arhum q<u>a</u>talahumu All<u>a</u>hu ann<u>a</u> yufakoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "When you see them, their outward appearance pleases you; when they speak, you listen to what they say. But they are like propped up blocks of timber. They think that every shout is directed against them. They are the [real] enemies, so beware of them. The curse of God be upon them! How they turn away!"
          ],
          "en.yusufali": [
            "When thou lookest at them, their exteriors please thee; and when they speak, thou listenest to their words. They are as (worthless as hollow) pieces of timber propped up, (unable to stand on their own). They think that every cry is against them. They are the enemies; so beware of them. The curse of Allah be on them! How are they deluded (away from the Truth)!"
          ],
          "fa.ansarian": [
            "چون آنان را ببینی جسم و ظاهرشان [از آراستگی و وقار] تو را به شگفت آورد، و اگر سخن گویند [به علت شیرینی و جذابیّت کلام] به سخنانشان گوش فرا می دهی [اما از پوچی باطن، سبک مغزی و دورویی] گویی چوب های خشکی هستند که به دیواری تکیه دارند [و در حقیقت اجسادی بی روح اند که در هیچ برنامه ای اطمینانی به آنان نیست، از شدت بزدلی] هر فریادی را به زیان خود می پندارند. اینان دشمن واقعی اند؛ از آنان بپرهیز؛ خدا آنان را بکشد؛ چگونه [با دیدن این همه دلایل روشن، از حق به باطل] منحرف می شوند."
          ],
          "fa.ayati": [
            "چون آنها را ببينى تو را از ظاهرشان خوش مى‌آيد، و چون سخن بگويند به سخنشان گوش مى‌دهى. گويى چوبهايى هستند به ديوار تكيه داده. هر آوازى را بر زيان خود مى‌پندارند. ايشان دشمنانند. از آنها حذر كن. خدايشان بكشد. به كجا منحرف مى‌شوند؟"
          ],
          "fa.bahrampour": [
            "و وقتى آنها را ببينى، [گيرايى‌] ظاهرشان تو را به شگفت مى‌آورد و اگر سخن گويند به گفتارشان گوش فرا مى‌دهى، گويى آنها چوب‌هاى خشكى هستند كه [به ديوارى‌] تكيه داده شده‌اند [و ريشه ندارند] هر فريادى را بر ضد خويش مى‌پندارند. آنها دشمنند، پس از ايشان بر حذ"
          ],
          "fa.fooladvand": [
            "و چون آنان را ببينى، هيكلهايشان تو را به تعجب وا مى‌دارد، و چون سخن گويند به گفتارشان گوش فرا مى‌دهى گويى آنان شمعك‌هايى پشت بر ديوارند [كه پوك شده و درخور اعتماد نيستند]: هر فريادى را به زيان خويش مى‌پندارند. خودشان دشمنند؛ از آنان بپرهيز؛ خدا بكشدشان؛ تا كجا [از حقيقت‌] انحراف يافته‌اند."
          ],
          "fa.ghomshei": [
            "تو چون آن منافقان را مشاهده کنی ظاهر و وجود جسمانی آنها (به آراستگی فریبنده) تو را به شگفت آرد و اگر سخن گویند (بس خوش‌گفتار و چرب زبانند) به سخن‌هاشان گوش فرا خواهی داد (ولی از باطن و درون) گویی که چوبی خشک تکیه کرده بر دیوارند (و هیچ عقل و ایمان و معرفت ندارند. و چون در باطن نادرست و بداندیشند) هر صدایی بشنوند بر زیان خویش پندارند. دشمنان به حقیقت اینان هستند، از ایشان بر حذر باش، خدایشان بکشد، (از حق) به کجا بازگردانیده می‌شوند؟"
          ],
          "fa.khorramdel": [
            "هنگامی که ایشان را می‌بینی، پیکر، و سیمایشان تو را می‌گیرد و به شگفت می‌آورد (و به خود می‌گوئی: چه انسانهای باوقار و برازنده‌ای!) و هنگامی که به سخن درمی‌آیند (به علّت حلاوت کلامشان) به سخنانشان گوش فرا می‌دهی. (با وجود این جذبه‌ی سیما و گیرائی گفتار) آنان انگار تخته‌هائی هستند که (بر دیوار) تکیه داده شده باشند (بی‌جان و بی‌ایمان، هیکلهای توخالی، درونهای بی‌نور و صفا، نقشهائی بر در و دیوارها). هر فریادی را بر ضدّ خود می‌پندارند و هر آوازی را به زیان خویش! آنان دشمنان بشمارند و از ایشان برحذر باش. خدایشان بکُشاد! چگونه (از حق) برگردانده می‌شوند (و منحرف می‌گردند؟!). [[«خُشُبٌ»: جمع خَشَب، تخته‌ها. «مُسَنَّدَةٌ»: تکیه داده شده. «صَیْحَةٍ»: فریاد. آواز. «قَاتَلَهُمُ اللهُ»: خدایشان بکُشاد! مراد از کشتن در اینجا، نفرین کردن و از رحمت محروم گرداندن است. «أَنَّی یُؤْفَکُونَ»: (نگا: توبه / 30، عنکبوت / 61، زخرف / 87).]]"
          ],
          "fa.khorramshahi": [
            "و چون ایشان را بنگری، بدنهای ایشان تو را به شگفت‌آورد، و چون سخن گویند به سخنانشان گوش دهی، گویی همانند الوارهای تکیه داده بر دیوارند، و هر بانگی را بر ضد خویش می‌انگارند، آنان دشمن‌اند، از آنان بر حذر باش، خداوند لعنتشان کند، چگونه بیراهه می‌روند؟"
          ],
          "fa.makarem": [
            "هنگامی که آنها را می‌بینی، جسم و قیافه آنان تو را در شگفتی فرو می‌برد؛ و اگر سخن بگویند، به سخنانشان گوش فرا می‌دهی؛ اما گویی چوبهای خشکی هستند که به دیوار تکیه داده شده‌اند! هر فریادی از هر جا بلند شود بر ضد خود می‌پندارند؛ آنها دشمنان واقعی تو هستند، پس از آنان بر حذر باش! خداوند آنها را بکشد، چگونه از حق منحرف می‌شوند؟!"
          ],
          "fa.moezzi": [
            "و هر گاه ببینیشان شگفت آردت کالبدهای آنان و اگر سخن گویند گوش دهی به گفتار ایشان گوئیا آنانند چوبهای تکیه داده شده پندارند هر فریادی را بر ایشان ایشانند دشمن پس بترسشان بکشدشان خدا کجا به دروغ رانده شوند"
          ],
          "fa.mojtabavi": [
            "و چون آنان را ببينى پيكرهاشان تو را به شگفت آرد، و اگر سخن گويند گفتارشان را بشنوى- از بس چرب‌زبانند-، [و حال آنكه‌] گويى چوبهايى‌اند به ديوار تكيه نهاده- بى‌ايمان و مردگانى بى‌روح‌اند-. هر بانگى را بر [زيان و هلاك‌] خود پندارند. اينان دشمن‌اند پس از آنها بر حذر باش. خدا بكشدشان- يا لعنت بر آنها باد- به كجا و چگونه [از حق‌] گردانيده مى‌شوند؟!"
          ],
          "fa.sadeqi": [
            "و چون آنان را ببینی، هیکل‌هایشان تو را به شگفتی در می‌آورد و چون سخن گویند به گفتارشان گوش فرا می‌‌داری‌. ایشان دشمن (حق)اند. پس از آنان بپرهیز. خدا با آنان کشتار کرده (که) به گزاف (از حق منحرف و کنده و) افکنده می‌شوند."
          ]
        }
      },
      {
        "index": 5193,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:63:5",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:108:88",
            "/books/al-kafi:1:4:108:91"
          ]
        },
        "text": [
          "وَ إِذَا قِيلَ‌ لَهُمْ‌ تَعَالَوْا يَسْتَغْفِرْ لَکُمْ‌ رَسُولُ‌ اللَّهِ‌ لَوَّوْا رُءُوسَهُمْ‌ وَ رَأَيْتَهُمْ‌ يَصُدُّونَ‌ وَ هُمْ‌ مُسْتَکْبِرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "When you tell them: \"Come, let the Apostle of God ask forgiveness for you,\" they turn their heads, and you see them turning away with arrogance."
          ],
          "en.ahmedraza": [
            "And when it is said to them, “Come! Allah’s Noble Messenger may seek forgiveness for you” – they turn heads away, and you will see them turning away in pride."
          ],
          "en.arberry": [
            "And when it is said to them, 'Come now, and God's Messenger will ask forgiveness for you,' they twist their heads, and thou seest them turning their faces away, waxing proud."
          ],
          "en.daryabadi": [
            "And when it is said Unto them: come! that the apostle of Allah may ask forgiveness for you, they twist their heads, and thou beholdest them retire, while they are stiff-necked."
          ],
          "en.hilali": [
            "And when it is said to them: \"Come, so that the Messenger of Allah may ask forgiveness from Allah for you\", they turn aside their heads, and you would see them turning away their faces in pride."
          ],
          "en.itani": [
            "And when it is said to them, “Come, the Messenger of God will ask forgiveness for you,” they bend their heads, and you see them turning away arrogantly."
          ],
          "en.maududi": [
            "When it is said to them: “Come, Allah's Messenger will seek forgiveness for you,” they (contemptuously) shake their heads and you see them holding back in pride."
          ],
          "en.mubarakpuri": [
            "And when it is said to them: \"Come, so that the Messenger of Allah may ask forgiveness from Allah for you,\" they twist their heads, and you would see them turning away their faces in pride."
          ],
          "en.pickthall": [
            "And when it is said unto them: Come! The messenger of Allah will ask forgiveness for you! they avert their faces and thou seest them turning away, disdainful."
          ],
          "en.qarai": [
            "When they are told, ‘Come, that Allah’s Apostle may plead for forgiveness for you,’ they twist their heads, and you see them turn away disdainfully."
          ],
          "en.qaribullah": [
            "When it is said to them: 'Come, the Messenger of Allah will ask forgiveness for you' they turn their heads in pride and you see them go away."
          ],
          "en.sahih": [
            "And when it is said to them, \"Come, the Messenger of Allah will ask forgiveness for you,\" they turn their heads aside and you see them evading while they are arrogant."
          ],
          "en.sarwar": [
            "When they are told, \"Come and let the Prophet of God seek forgiveness for you,\" they shake their heads and you can see them arrogantly turning away."
          ],
          "en.shakir": [
            "And when it is said to them: Come, the Apostle of Allah will ask forgiveness for you, they turn back their heads and you may see them turning away while they are big with pride."
          ],
          "en.transliteration": [
            "Wai<u>tha</u> qeela lahum taAA<u>a</u>law yastaghfir lakum rasoolu All<u>a</u>hi lawwaw ruoosahum waraaytahum ya<u>s</u>uddoona wahum mustakbiroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "When they are told, \"Come! The Messenger of God will ask forgiveness for you!\" they turn their heads away and you see them walking away arrogantly."
          ],
          "en.yusufali": [
            "And when it is said to them, \"Come, the Messenger of Allah will pray for your forgiveness\", they turn aside their heads, and thou wouldst see them turning away their faces in arrogance."
          ],
          "fa.ansarian": [
            "و چون به آنان گویند: بیایید تا پیامبر خدا برای شما آمرزش بخواهد [از روی کبر و غرور] سرهای خود را بر می گردانند، و آنان را می بینی که متکبرانه [از حق،] روی می گردانند."
          ],
          "fa.ayati": [
            "چون به آنها گفته شود كه بياييد تا پيامبر خدا برايتان آمرزش بخواهد، سرمى‌پيچند. مى‌بينى كه اعراض و گردنكشى مى‌كنند."
          ],
          "fa.bahrampour": [
            "و چون به آنها گفته شود: بياييد تا رسول خدا برايتان آمرزش بخواهد، سرهاى خود را بر مى‌گردانند، و مى‌بينى كه آنها متكبرانه روى بر مى‌تابند"
          ],
          "fa.fooladvand": [
            "و چون بديشان گفته شود: «بياييد تا پيامبر خدا براى شما آمرزش بخواهد»، سرهاى خود را بر مى‌گردانند، و آنان را مى‌بينى كه تكبركنان روى برمى‌تابند."
          ],
          "fa.ghomshei": [
            "و هر گاه به آنها گویند: بیایید تا رسول خدا برای شما (از حق) آمرزش طلبد سر بپیچند و بنگری که با تکبر و نخوت (از حق) روی می‌گردانند."
          ],
          "fa.khorramdel": [
            "چون به آنان گفته شود که بیائید تا پیغمبر خدا برایتان آمرزش بخواهد، سرهای خود را (از روی غرور و تکبّر، و به عنوان استهزاء) تکان می‌دهند وآنان راخواهی دید مستکبرانه روی می‌گردانند و می‌روند. [[«لَوَّوْا»: پیچ دادند. مراد تکان دادن سر به عنوان تکبّر و تمسخر است. «یَصُدُّونَ»: روی می‌گردانند. دوری می‌کنند از پذیرش دعوت پیغمبر.]]"
          ],
          "fa.khorramshahi": [
            "و چون به ایشان گفته شود بیایید که پیامبر خدا برای شما آمرزش بطلبد، سرهای خود را [به انکار] برگردانند، و بنگریشان که [از اعتذار و استغفار] رویگردانند و گردنکش‌اند"
          ],
          "fa.makarem": [
            "هنگامی که به آنان گفته شود: «بیایید تا رسول خدا برای شما استغفار کند!»، سرهای خود را (از روی استهزا و کبر و غرور) تکان می‌دهند؛ و آنها را می‌بینی که از سخنان تو اعراض کرده و تکبر می‌ورزند!"
          ],
          "fa.moezzi": [
            "و گاهی که گفته شود بدیشان بیائید آمرزش خواهد برای شما پیمبر خدا بازگردانند سرهای خویش را و بینیشان بازمی‌دارند (یا دوری گزینند) و ایشانند کبرورزندگان‌"
          ],
          "fa.mojtabavi": [
            "و چون به آنها گفته شود: بياييد تا پيامبر خدا برايتان آمرزش بخواهد، سرهاى خويش را بپيچانند و آنان را بينى كه [از حق‌] روى مى‌گردانند در حالى كه گردنكش‌اند."
          ],
          "fa.sadeqi": [
            "و هنگامی که برایشان گفته شود: «بیایید تا پیامبر خدا برایتان پوشش بخواهد»، سرهای خود را بر می‌گردانند، و آنان را می‌بینی که متکبرانه (از راه خدا) باز می‌دارند."
          ]
        }
      },
      {
        "index": 5194,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:63:6",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:108:88",
            "/books/al-kafi:1:4:108:91"
          ]
        },
        "text": [
          "سَوَاءٌ عَلَيْهِمْ‌ أَسْتَغْفَرْتَ‌ لَهُمْ‌ أَمْ‌ لَمْ‌ تَسْتَغْفِرْ لَهُمْ‌ لَنْ‌ يَغْفِرَ اللَّهُ‌ لَهُمْ‌ إِنَ‌ اللَّهَ‌ لاَ يَهْدِي‌ الْقَوْمَ‌ الْفَاسِقِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Whether you ask forgiveness for them or do not ask, it is all the same; God will not forgive them. Surely God does not show a disobedient people the way."
          ],
          "en.ahmedraza": [
            "It is the same for them, whether you seek forgiveness for them or do not seek forgiveness for them; Allah will never forgive them; indeed Allah does not guide the sinning people."
          ],
          "en.arberry": [
            "Equal it is for them, whether thou askest forgiveness for them or thou askest not forgiveness for them; God will never forgive them. God guides not the people of the ungodly."
          ],
          "en.daryabadi": [
            "Equal it is Unto them: whether thou askest forgiveness for them or askest not forgiveness for them, Allah shall forgive them not. Verily Allah guideth not a transgressing people."
          ],
          "en.hilali": [
            "It is equal to them whether you (Muhammad SAW) ask forgiveness or ask not forgiveness for them. Verily, Allah guides not the people who are the Fasiqin (rebellious, disobedient to Allah)."
          ],
          "en.itani": [
            "It is the same for them, whether you ask forgiveness for them, or do not ask forgiveness for them; God will not forgive them. God does not guide the sinful people."
          ],
          "en.maududi": [
            "It is all the same for them whether you ask forgiveness for them or not; for Allah shall never forgive them. Surely Allah does not direct the transgressing folk to the Right Way."
          ],
          "en.mubarakpuri": [
            "It is equal to them whether you ask forgiveness or ask not forgiveness for them, Allah will never forgive them. Verily, Allah guides not the people who are the rebellious."
          ],
          "en.pickthall": [
            "Whether thou ask forgiveness for them or ask not forgiveness for them is all one for them; Allah will not forgive them. Lo! Allah guideth not the evil-living folk."
          ],
          "en.qarai": [
            "It is the same for them whether you plead for forgiveness for them, or do not plead for forgiveness for them: Allah will never forgive them. Indeed Allah does not guide the transgressing lot."
          ],
          "en.qaribullah": [
            "It is equal for them whether you ask for their forgiveness or you do not ask for their forgiveness, Allah will not forgive them. Allah does not guide the evildoers."
          ],
          "en.sahih": [
            "It is all the same for them whether you ask forgiveness for them or do not ask forgiveness for them; never will Allah forgive them. Indeed, Allah does not guide the defiantly disobedient people."
          ],
          "en.sarwar": [
            "It is all the same whether you seek forgiveness for them or not; God will never forgive them. God does not guide the evil-doing people."
          ],
          "en.shakir": [
            "It is alike to them whether you beg forgiveness for them or do not beg forgiveness for them; Allah will never forgive them; surely Allah does not guide the transgressing people."
          ],
          "en.transliteration": [
            "Saw<u>a</u>on AAalayhim astaghfarta lahum am lam tastaghfir lahum lan yaghfira All<u>a</u>hu lahum inna All<u>a</u>ha l<u>a</u> yahdee alqawma alf<u>a</u>siqeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "It makes no difference whether you ask forgiveness for them or not. God will not forgive them: God does not guide such rebellious people."
          ],
          "en.yusufali": [
            "It is equal to them whether thou pray for their forgiveness or not. Allah will not forgive them. Truly Allah guides not rebellious transgressors."
          ],
          "fa.ansarian": [
            "برای آنان یکسان است چه برای آنان آمرزش بخواهی چه نخواهی، خدا هرگز آنان را نمی آمرزد. مسلماً خدا مردم فاسق را هدایت نمی کند."
          ],
          "fa.ayati": [
            "تفاوتى نكند، چه برايشان آمرزش بخواهى چه آمرزش نخواهى. خدايشان نخواهد آمرزيد. و خدا مردم نافرمان را هدايت نمى‌كند."
          ],
          "fa.bahrampour": [
            "براى آنها يكسان است، چه برايشان آمرزش بخواهى يا برايشان آمرزش نخواهى، خدا هرگز آنها را نمى‌آمرزد. مسلما خدا مردم فاسق را هدايت نمى‌كند"
          ],
          "fa.fooladvand": [
            "براى آنان يكسان است: چه برايشان آمرزش بخواهى يا برايشان آمرزش نخواهى، خدا هرگز بر ايشان نخواهد بخشود. خدا فاسقان را راهنمايى نمى‌كند."
          ],
          "fa.ghomshei": [
            "(ای رسول) تو (از خدا) بر آنان آمرزش بخواهی یا نخواهی به حالشان یکسان است خدا هرگز آنها را نمی‌بخشد که همانا قوم نابکار فاسق را خدا هیچ وقت (به راه سعادت) هدایت نخواهد کرد."
          ],
          "fa.khorramdel": [
            "برای آنان یکسان است چه برای ایشان آمرزش بخواهی، و چه آمرزش نخواهی، (چون آنان از نفاق خود دست نمی‌کشند) هرگز خدا ایشان را نخواهد بخشید. خداوند قطعاً مردمان فاسق را هدایت نمی‌دهد. [[«أَسْتَغْفَرْتَ»: اصل آن (أَإِسْتَغْفَرْتَ) است که همزه باب استفعال آن برای تخفیف حذف شده است. «الْقَوْمَ الْفَاسِقِینَ»: (نگا: مائده / 25 و 26 و 108).]]"
          ],
          "fa.khorramshahi": [
            "در حق آنان یکسان است چه برایشان آمرزش بخواهی، چه بر ایشان آمرزش نخواهی، هرگز خداوند آنان را نخواهد آمرزید، بی‌گمان خداوند نافرمانان را هدایت نمی‌کند"
          ],
          "fa.makarem": [
            "برای آنها تفاوت نمی‌کند، خواه استغفار برایشان کنی یا نکنی، هرگز خداوند آنان را نمی‌بخشد؛ زیرا خداوند قوم فاسق را هدایت نمی‌کند!"
          ],
          "fa.moezzi": [
            "یکسان است بر ایشان چه آمرزش خواهی برای ایشان یا آمرزش نخواهی برای ایشان هرگز نیامرزدشان خدا همانا خدا هدایت نکند گروه نافرمانان را"
          ],
          "fa.mojtabavi": [
            "بر آنها يكسان است چه برايشان آمرزش بخواهى يا آمرزش نخواهى هرگز خدا نيامرزدشان. همانا خدا مردم بدكار را راه ننمايد."
          ],
          "fa.sadeqi": [
            "بر آنان یکسان است: چه برایشان پوشش بخواهی، یا برایشان پوشش نخواهی، خدا هرگز برایشان نخواهد پوشاند. خدا بی‌گمان فاسقان را راهنمایی نمی‌کند."
          ]
        }
      },
      {
        "index": 5195,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:63:7",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:5:1:32:2",
            "/books/al-kafi:5:1:32:1",
            "/books/al-kafi:5:1:32:6"
          ]
        },
        "text": [
          "هُمُ‌ الَّذِينَ‌ يَقُولُونَ‌ لاَ تُنْفِقُوا عَلَى‌ مَنْ‌ عِنْدَ رَسُولِ‌ اللَّهِ‌ حَتَّى‌ يَنْفَضُّوا وَ لِلَّهِ‌ خَزَائِنُ‌ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ وَ لٰکِنَ‌ الْمُنَافِقِينَ‌ لاَ يَفْقَهُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They are the ones who say: \"Do not spend on those who are with the Apostle of God till they break away (from him).\" To God belong the treasures of the heavens and the earth; but the hypocrites do not understand."
          ],
          "en.ahmedraza": [
            "It is they who say, “Do not spend upon those who are with Allah’s Noble Messenger until they get distraught”; whereas to Allah only belong the treasures of the heavens and the earth, but the hypocrites do not have sense."
          ],
          "en.arberry": [
            "Those are they that say, 'Do not expend on them that are with God's Messenger until they scatter off'; yet unto God belong the treasuries of the heavens and of the earth, but the hypocrites do not understand."
          ],
          "en.daryabadi": [
            "They are the ones who say: expend not on those who are with Allah's apostle, that they may disperse; whereas Allah's are the treasures of the heavens and the earth; yet the hypocrites understand not."
          ],
          "en.hilali": [
            "They are the ones who say: \"Spend not on those who are with Allah's Messenger, until they desert him.\" And to Allah belong the treasures of the heavens and the earth, but the hypocrites comprehend not."
          ],
          "en.itani": [
            "It is they who say: “Do not spend anything on those who side with God’s Messenger, unless they have dispersed.” To God belong the treasures of the heavens and the earth, but the hypocrites do not understand."
          ],
          "en.maududi": [
            "It is they who say: “Give nothing to those who are with the Messenger of Allah so that they may disperse.” (They say so although) the treasures of the heavens and the earth belong to Allah. But the hypocrites do not understand."
          ],
          "en.mubarakpuri": [
            "They are the ones who say: \"Spend not on those who are with Allah's Messenger, until they desert him.\" And to Allah belong the treasures of the heavens and the earth, but the hypocrites comprehend not."
          ],
          "en.pickthall": [
            "They it is who say: Spend not on behalf of those (who dwell) with Allah's messenger that they may disperse (and go away from you); when Allah's are the treasures of the heavens and the earth; but the hypocrites comprehend not."
          ],
          "en.qarai": [
            "They are the ones who say, ‘Do not spend on those who are with the Apostle of Allah until they scatter off [from around him].’ Yet to Allah belong the treasuries of the heavens and the earth, but the hypocrites do not understand."
          ],
          "en.qaribullah": [
            "It is they that say: 'Spend nothing on those who follow the Messenger of Allah until they disperse' Yet to Allah belong the treasuries of heavens and the earth, but the hypocrites do not understand."
          ],
          "en.sahih": [
            "They are the ones who say, \"Do not spend on those who are with the Messenger of Allah until they disband.\" And to Allah belongs the depositories of the heavens and the earth, but the hypocrites do not understand."
          ],
          "en.sarwar": [
            "It is they who say, \"Give nothing to those who are around the Messenger of God so that they will desert him.\" To God belongs the treasures of the heavens and the earth, but the hypocrites have no understanding."
          ],
          "en.shakir": [
            "They it is who say: Do not spend upon those who are with the Apostle of Allah until they break up. And Allah's are the treasures of the heavens and the earth, but the hypocrites do not understand."
          ],
          "en.transliteration": [
            "Humu alla<u>th</u>eena yaqooloona l<u>a</u> tunfiqoo AAal<u>a</u> man AAinda rasooli All<u>a</u>hi <u>h</u>att<u>a</u> yanfa<u>dd</u>oo walill<u>a</u>hi khaz<u>a</u>inu a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i wal<u>a</u>kinna almun<u>a</u>fiqeena l<u>a</u> yafqahoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "They are the ones who say, \"Give nothing to those who follow God's Messenger, until they abandon him;\" but the treasures of the heavens and the earth belong to God, though the hypocrites do not understand this"
          ],
          "en.yusufali": [
            "They are the ones who say, \"Spend nothing on those who are with Allah's Messenger, to the end that they may disperse (and quit Medina).\" But to Allah belong the treasures of the heavens and the earth; but the Hypocrites understand not."
          ],
          "fa.ansarian": [
            "فقط آنانند که می گویند: به کسانی که نزد پیامبر خدایند، انفاق مکنید تا [از پیرامون او] پراکنده شوند. در حالی که خزانه های آسمان ها و زمین در سیطره خداست، ولی منافقان نمی فهمند."
          ],
          "fa.ayati": [
            "اينان همانهايند كه مى‌گويند: بر آنها كه گرد پيامبر خدايند، چيزى مدهيد تا از گردش پراكنده شوند. و حال آنكه خزاين آسمانها و زمين از آنِ خداست ولى منافقان نمى‌فهمند."
          ],
          "fa.bahrampour": [
            "آنها همان كسانند كه مى‌گويند: به كسانى كه نزد رسول خدايند انفاق نكنيد تا پراكنده شوند، و حال آن كه خزاين آسمان‌ها و زمين از آن خداست، ولى منافقان در نمى‌يابند"
          ],
          "fa.fooladvand": [
            "آنان كسانى‌اند كه مى‌گويند: «به كسانى كه نزد پيامبر خدايند انفاق مكنيد تا پراكنده شوند، و حال آنكه گنجينه‌هاى آسمانها و زمين از آنِ خداست ولى منافقان درنمى‌يابند."
          ],
          "fa.ghomshei": [
            "اینها همان مردم بدخواهند که می‌گویند: بر اصحاب رسول خدا انفاق مال مکنید تا (از گِردش) پراکنده شوند در صورتی که خدا را گنجهای آسمانها و زمین است لیکن منافقان درک آن نمی‌کنند."
          ],
          "fa.khorramdel": [
            "آنان کسانیند که می‌گویند: به آنانی که (از مکّه به مدینه مهاجرت کرده‌اند و) نزد فرستاده‌ی خدا هستند، بذل و بخششی نکنید و چیزی ندهید تا پراکنده شوند و بروند. (غافل از این که) گنجینه‌های آسمانها و زمین از آن خدا است (و به هر کس که بخواهد از آنها بدو عطاء می‌کند) ولیکن منافقان نمی‌فهمند. [[«مَنْ عِندَ ...»: مراد مهاجران فقیر مدینه است. «رَسُولِ اللهِ»: از روی استهزاء و تمسخر، منافقان می‌گفتند: پیغمبر خدا.]]"
          ],
          "fa.khorramshahi": [
            "ایشان کسانی هستند که می‌گویند برای کسانی که نزد پیامبر خدا هستند چیزی هزینه نکنید تا آنکه [از پیرامون او] پراکنده شوند، و حال آنکه خزانه‌های آسمان و زمین از آن خداوند است، ولی منافقان در نمی‌یابند"
          ],
          "fa.makarem": [
            "آنها کسانی هستند که می‌گویند: «به افرادی که نزد رسول خدا هستند انفاق نکنید تا پراکنده شوند!» (غافل از اینکه) خزاین آسمانها و زمین از آن خداست، ولی منافقان نمی‌فهمند!"
          ],
          "fa.moezzi": [
            "آنانند که گویند انفاق نکنید بر آنان که نزد پیمبر خدایند تا پراکنده شوند و خدا را است گنجهای آسمانها و زمین لیکن منافقان درنیابند"
          ],
          "fa.mojtabavi": [
            "اينان همان كسانند كه مى‌گويند: بر آنان كه نزد پيامبر خدايند هزينه مكنيد- به آنها چيزى ندهيد- تا [از نزد وى‌] پراكنده شوند و حال آنكه خداى راست گنجينه‌هاى آسمانها و زمين، و ليكن منافقان درنمى‌يابند."
          ],
          "fa.sadeqi": [
            "آنان (همان) کسانی‌اند که می‌گویند: «به کسانی که نزد پیامبر خدایند انفاق مکنید، تا (از گِردَش) پراکنده شوند حال آنکه تمامی گنجینه‌های آسمان‌ها و زمین از خداست ولی منافقان در نمی‌یابند."
          ]
        }
      },
      {
        "index": 5196,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:63:8",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:5:1:32:2",
            "/books/al-kafi:5:1:32:1",
            "/books/al-kafi:5:1:32:6"
          ]
        },
        "text": [
          "يَقُولُونَ‌ لَئِنْ‌ رَجَعْنَا إِلَى‌ الْمَدِينَةِ لَيُخْرِجَنَ‌ الْأَعَزُّ مِنْهَا الْأَذَلَ‌ وَ لِلَّهِ‌ الْعِزَّةُ وَ لِرَسُولِهِ‌ وَ لِلْمُؤْمِنِينَ‌ وَ لٰکِنَ‌ الْمُنَافِقِينَ‌ لاَ يَعْلَمُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "They say: \"If we now go back to Madina, the stronger will turn the weaker out.\" But power belongs to God, His Apostle and the faithful, though the hypocrites do not know."
          ],
          "en.ahmedraza": [
            "They say, “If we return to Medinah, then indeed the honourable group will soon expel the lowly one”; whereas all honour belongs to Allah and to His Noble Messenger and to the Muslims, but the hypocrites do not know."
          ],
          "en.arberry": [
            "They say, 'If we return to the City, the mightier ones of it will expel the more abased'; yet glory belongs unto God, and unto His Messenger and the believers, but the hypocrites do not know it."
          ],
          "en.daryabadi": [
            "They say: surely, if we return to Madina the mightier shall drive out the meaner thence: whereas might is Allah's and His apostle's and the believers; yet the hypocrites know not."
          ],
          "en.hilali": [
            "They (hyprocrites) say: \"If we return to Al-Madinah, indeed the more honourable ('Abdullah bin Ubai bin Salul, the chief of hyprocrites at Al-Madinah) will expel therefrom the meaner (i.e. Allah's Messenger SAW).\" But honour, power and glory belong to Allah, His Messenger (Muhammad SAW), and to the believers, but the hypocrites know not."
          ],
          "en.itani": [
            "They say, “If we return to the City, the more powerful therein will evict the weak.” But power belongs to God, and His Messenger, and the believers; but the hypocrites do not know."
          ],
          "en.maududi": [
            "They say: “When we return to Madinah, the honourable ones will drive out from it those that are abject.” In truth, all honour belongs to Allah, and to His Messenger, and to the believers. But the hypocrites do not know."
          ],
          "en.mubarakpuri": [
            "They say: \"If we return to Al-Madinah, indeed the more honorable will expel therefrom the weaker.\" But Al-`Izzah belongs to Allah, and to His Messenger, and to the believers, but the hypocrites know not."
          ],
          "en.pickthall": [
            "They say: Surely, if we return to Al-Madinah the mightier will soon drive out the weaker; when might belongeth to Allah and to His messenger and to the believers; but the hypocrites know not."
          ],
          "en.qarai": [
            "They say, ‘When we return to the city, the mighty will surely expel the weak from it.’ Yet all might belongs to Allah and His Apostle and the faithful, but the hypocrites do not know."
          ],
          "en.qaribullah": [
            "They say: 'If we return to the City, the strong will expel the humiliated' But the might belongs to Allah, and His Messenger and the believers, but thehypocrites do not know."
          ],
          "en.sahih": [
            "They say, \"If we return to al-Madinah, the more honored [for power] will surely expel therefrom the more humble.\" And to Allah belongs [all] honor, and to His Messenger, and to the believers, but the hypocrites do not know."
          ],
          "en.sarwar": [
            "They say, \"When we return to Medina, the honorable ones will certainly drive out the mean ones.\" Honor belongs to God, His Messenger and the believers, but the hypocrites do not know."
          ],
          "en.shakir": [
            "They say: If we return to Medina, the mighty will surely drive out the meaner therefrom; and to Allah belongs the might and to His Apostle and to the believers, but the hypocrites do not know."
          ],
          "en.transliteration": [
            "Yaqooloona lain rajaAAn<u>a</u> il<u>a</u> almadeenati layukhrijanna alaAAazzu minh<u>a</u> ala<u>th</u>alla walill<u>a</u>hi alAAizzatu walirasoolihi walilmumineena wal<u>a</u>kinna almun<u>a</u>fiqeena l<u>a</u> yaAAlamoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "[and] they say, \"Indeed, when we return to Madinah, [we] the ones most worthy of honour, will surely drive out from there the contemptible ones!\" [referring to poor Muslims]. However, all honour belongs to God, and to His Messenger and those who believe [in God]: but of this the hypocrites are not aware."
          ],
          "en.yusufali": [
            "They say, \"If we return to Medina, surely the more honourable (element) will expel therefrom the meaner.\" But honour belongs to Allah and His Messenger, and to the Believers; but the Hypocrites know not."
          ],
          "fa.ansarian": [
            "می گویند: اگر به مدینه بازگردیم، مسلماً آنکه عزیزتر است [یعنی عبدالله بن ابی سلول، رئیس منافقان] آن را که خوارتر است [یعنی پیامبر که هنوز به پندار آنان تمکن لازم را به دست نیاورده] از آنجا بیرون می کند. در حالی که عزت و اقتدار برای خدا و پیامبر او و مؤمنان است، ولی منافقان [به این حقیقت] معرفت و آگاهی ندارند."
          ],
          "fa.ayati": [
            "مى‌گويند: چون به مدينه بازگرديم، صاحبان عزت، ذليلان را از آنجا بيرون خواهند كرد. عزت از آنِ خدا و پيامبرش و مؤمنان است. ولى منافقان نمى‌دانند."
          ],
          "fa.bahrampour": [
            "مى‌گويند: اگر به مدينه برگرديم، قطعا عزيزتر، ذليل‌تر [يعنى مؤمنان‌] را از آن جا بيرون خواهد كرد، و حال آن كه عزت از آن خدا و از آن رسول او و از آن مؤمنان است، ليكن منافقان نمى‌دانند"
          ],
          "fa.fooladvand": [
            "مى‌گويند: «اگر به مدينه برگرديم، قطعاً آنكه عزتمندتر است آن زبون‌تر را از آنجا بيرون خواهد كرد.» و[لى‌] عزت از آن خدا و از آن پيامبر او و از آن مؤمنان است؛ ليكن اين دورويان نمى‌دانند."
          ],
          "fa.ghomshei": [
            "آنها (پنهانی با هم) می‌گویند: اگر به مدینه مراجعت کردیم البته اربابان عزّت و ثروت، مسلمانان ذلیل فقیر را از شهر بیرون کنند، و حال آنکه عزّت مخصوص خدا و رسول و اهل ایمان است (و ذلّت خاصّ کافران) ولیکن منافقان از این معنی آگه نیستند."
          ],
          "fa.khorramdel": [
            "می‌گویند: اگر (از غزوه‌ی بنی‌مصطلق) به مدینه برگشتیم، باید افراد باعزّت و قدرت، اشخاص خوار و ناتوان را از آنجا بیرون کنند. عزّت و قدرت از آن خدا و فرستاده‌ی او و مؤمنان است، ولیکن منافقان (این را درک نمی‌کنند و) نمی‌دانند. [[«الأَعَزُّ»: عزیزتر و گرامی‌تر. مقتدرتر و چیره‌تر. منافقان مرادشان خویشتن بود. «الأَذَلَّ»: خوارتر و پست‌تر. منظورشان رسول خدا و مؤمنان مهاجر بود. «للهِ الْعِزَّةُ وَ ...»: اشاره به این است که کلام منافقان قبول است. ولی باعزّت و باقدرت خدا و پیغمبر و مؤمنانند.]]"
          ],
          "fa.khorramshahi": [
            "می‌گویند چون به مدینه بازگردیم، بلندپایگان، فرومایگان را از آنجا بیرون خواهند کرد، حال آنکه عزت، خاص خداوند و پیامبر او و مؤمنان است، ولی منافقان نمی‌دانند"
          ],
          "fa.makarem": [
            "آنها می‌گویند: «اگر به مدینه بازگردیم، عزیزان ذلیلان را بیرون می‌کنند!» در حالی که عزت مخصوص خدا و رسول او و مؤمنان است؛ ولی منافقان نمی‌دانند!"
          ],
          "fa.moezzi": [
            "گویند اگر بازگشتیم بسوی شهر همانا برون راند گرامی‌تر (عزیزتر) از آن خوارتر را و از آنِ خدا است عزّت و از آن پیمبرش و از آن مؤمنان و لیکن منافقان نمی‌دانند"
          ],
          "fa.mojtabavi": [
            "گويند: چون به مدينه بازگرديم، آن كه عزيزتر است آن را كه خوارتر است از آنجا بيرون مى‌كند، و حال آنكه خداى راست عزّت- بزرگى و ارجمندى- و پيامبر او و مؤمنان راست، و ليكن منافقان نمى‌دانند."
          ],
          "fa.sadeqi": [
            "گویند: «اگر به مدینه بر گردیم همواره آنکه عزیزتر است‌، آن زبون‌تر را بی‌چون از آنجا بیرون خواهد راند.» حال آنکه عزت تنها برای خدا و پیامبر او و مؤمنان است‌؛ لیکن این دورویان نمی‌دانند."
          ]
        }
      },
      {
        "index": 5197,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:63:9",
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا لاَ تُلْهِکُمْ‌ أَمْوَالُکُمْ‌ وَ لاَ أَوْلاَدُکُمْ‌ عَنْ‌ ذِکْرِ اللَّهِ‌ وَ مَنْ‌ يَفْعَلْ‌ ذٰلِکَ‌ فَأُولٰئِکَ‌ هُمُ‌ الْخَاسِرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O you who believe, let not your wealth and children make you negligent of the remembrance of God. Those who do so will be losers."
          ],
          "en.ahmedraza": [
            "O People who Believe! May not your wealth or your children cause you to neglect the remembrance of Allah; and whoever does this – so it is they who are in a loss."
          ],
          "en.arberry": [
            "O believers, let not your possessions neither your children divert you from God's remembrance; whoso does that, they are the losers."
          ],
          "en.daryabadi": [
            "O ye who believe let not your riches or your children divert you from the remembrance of Allah. And whosoever doth that then those! they are the losers."
          ],
          "en.hilali": [
            "O you who believe! Let not your properties or your children divert you from the remembrance of Allah. And whosoever does that, then they are the losers."
          ],
          "en.itani": [
            "O you who believe! Let neither your possessions nor your children distract you from the remembrance of God. Whoever does that—these are the losers."
          ],
          "en.maududi": [
            "Believers, let your possessions and your offspring not make you negligent of Allah's remembrance. For whoso does that, they will be the losers."
          ],
          "en.mubarakpuri": [
            "O you who believe! Let not your properties or your children divert you from the remembrance of Allah. And whosoever does that, then they are the losers."
          ],
          "en.pickthall": [
            "O ye who believe! Let not your wealth nor your children distract you from remembrance of Allah. Those who do so, they are the losers."
          ],
          "en.qarai": [
            "O you who have faith! Do not let your possessions and children distract you from the remembrance of Allah, and whoever does that—it is they who are the losers."
          ],
          "en.qaribullah": [
            "Believers, do not let either your possessions or your children divert you from the Remembrance of Allah. Those who do that shall be the losers."
          ],
          "en.sahih": [
            "O you who have believed, let not your wealth and your children divert you from remembrance of Allah. And whoever does that - then those are the losers."
          ],
          "en.sarwar": [
            "Believers, do not let your wealth and children divert you from remembering God. Wwhoever is diverted will suffer a great loss."
          ],
          "en.shakir": [
            "O you who believe! let not your wealth, or your children, divert you from the remembrance of Allah; and whoever does that, these are the losers."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo l<u>a</u> tulhikum amw<u>a</u>lukum wal<u>a</u> awl<u>a</u>dukum AAan <u>th</u>ikri All<u>a</u>hi waman yafAAal <u>tha</u>lika faol<u>a</u>ika humu alkh<u>a</u>siroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "O believers! Do not let your wealth or your children distract you from remembrance of God. Those who do so will be the losers."
          ],
          "en.yusufali": [
            "O ye who believe! Let not your riches or your children divert you from the remembrance of Allah. If any act thus, the loss is their own."
          ],
          "fa.ansarian": [
            "ای مؤمنان! مبادا اموال و فرزندانتان شما را از یاد خدا غافل کنند، و آنان که [به خاطر مال و فرزند از یاد خدا] غافل می شوند، زیانکارند."
          ],
          "fa.ayati": [
            "اى كسانى كه ايمان آورده‌ايد، اموال و اولادتان شما را از ذكر خدا به خود مشغول ندارد، كه هر كه چنين كند زيانكار است."
          ],
          "fa.bahrampour": [
            "اى كسانى كه ايمان آورده‌ايد! مبادا اموال شما و فرزندانتان شما را از ياد خدا غافل سازد! و هر كس چنين كند پس آنها همان زيانكارانند"
          ],
          "fa.fooladvand": [
            "اى كسانى كه ايمان آورده‌ايد، [زنهار] اموال شما و فرزندانتان شما را از ياد خدا غافل نگرداند، و هر كس چنين كند، آنان خود زيانكارانند."
          ],
          "fa.ghomshei": [
            "الا ای اهل ایمان، مبادا هرگز مال و فرزندانتان شما را از یاد خدا غافل سازند، و البته کسانی که به امور دنیا از یاد خدا غافل شوند آنها به حقیقت زیانکاران عالمند."
          ],
          "fa.khorramdel": [
            "ای مؤمنان! اموالتان و اولادتان شما را از یاد خدا غافل نکند. کسانی که چنین کنند (و اموال و اولادشان، آنان را سرگرم و به خود مشغول دارد) ایشان زیانکارند. [[«لا تُلْهِکُمْ»: شما را سرگرم و غافل نکند (نگا: نور / 37، حجر / 3). «ذِکْرِ اللهِ»: یاد خدا و عبادت و پرستش او. اطاعت از خدا.]]"
          ],
          "fa.khorramshahi": [
            "ای مؤمنان اموال و اولادتان، شما را از یاد خداوند بازندارد، و هر کس چنین کند، آنانند که زیانکارانند"
          ],
          "fa.makarem": [
            "ای کسانی که ایمان آورده‌اید! اموال و فرزندانتان شما را از یاد خدا غافل نکند! و کسانی که چنین کنند، زیانکارانند!"
          ],
          "fa.moezzi": [
            "ای آنان که ایمان آوردید سرگرمتان نسازد خواسته‌های شما و نه فرزندان شما از یاد خدا و آنکه بکند این را پس آنانند زیانکاران‌"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه ايمان آورده‌ايد، مالها و فرزندانتان شما را از يادكرد خدا سرگرم نكنند و هر كه چنان كند- به سبب مال و فرزندان از طاعت خدا بازماند- ايشانند زيانكاران."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که ایمان آوردید! (زنهار که) اموالتان و فرزندانتان شما را از یاد خدا غافل نگردانند و هر کس چنان کند، پس هم‌آنان خودشان زیانکارانند."
          ]
        }
      },
      {
        "index": 5198,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:63:10",
        "text": [
          "وَ أَنْفِقُوا مِنْ‌ مَا رَزَقْنَاکُمْ‌ مِنْ‌ قَبْلِ‌ أَنْ‌ يَأْتِيَ‌ أَحَدَکُمُ‌ الْمَوْتُ‌ فَيَقُولَ‌ رَبِ‌ لَوْ لاَ أَخَّرْتَنِي‌ إِلَى‌ أَجَلٍ‌ قَرِيبٍ‌ فَأَصَّدَّقَ‌ وَ أَکُنْ‌ مِنَ‌ الصَّالِحِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Spend of what We have given you before death comes to one of you, when he will say: \"O Lord, why did you not defer my term for a while that I could give alms and be among the doers of good?\""
          ],
          "en.ahmedraza": [
            "And spend from what We have provided you before death approaches any one of you and he then says, “My Lord! Why did you not give me respite for a little while, so I would have given charity and become of the virtuous?”"
          ],
          "en.arberry": [
            "Expend of what We have provided you before that death comes upon one of you and he says, 'O my Lord, if only Thou wouldst defer me unto a near term, so that I may make freewill offering, and so I may become one of the righteous.'"
          ],
          "en.daryabadi": [
            "And expend of that wherewith We have provided you afore death cometh Unto one of you, and he saith: 'my Lord! wouldst Thou not defer me for a short term, so that I would give alms and become of the righteous."
          ],
          "en.hilali": [
            "And spend (in charity) of that with which We have provided you, before death comes to one of you and he says: \"My Lord! If only You would give me respite for a little while (i.e. return to the worldly life), then I should give Sadaqah (i.e. Zakat) of my wealth, and be among the righteous [i.e. perform Hajj (pilgrimage to Makkah)]."
          ],
          "en.itani": [
            "And give from what We have provided for you, before death approaches one of you, and he says, “My Lord, if only You would delay me for a short while, so that I may be charitable, and be one of the righteous.”"
          ],
          "en.maududi": [
            "And spend of what Allah has granted you by way of sustenance before death should come to any of you and he should say: “Lord, why did You not defer my return for a while so that I might give alms and be among the righteous?”"
          ],
          "en.mubarakpuri": [
            "And spend of that with which We have provided you before death comes to one of you, and he says: \"My Lord! If only You would give me respite for a little while, then I should give Sadaqah from my wealth, and be among the righteous."
          ],
          "en.pickthall": [
            "And spend of that wherewith We have provided you before death cometh unto one of you and he saith: My Lord! If only thou wouldst reprieve me for a little while, then I would give alms and be among the righteous."
          ],
          "en.qarai": [
            "Spend out of what We have provided you before death comes to any of you, whereat he might say, ‘My Lord, why did You not respite me for a short time so that I could give charity and become one of the righteous!’"
          ],
          "en.qaribullah": [
            "So spend of that with which We have provided you before death comes upon any of you and he then says: 'O my Lord, if only You would defer me to anear term, so that I could give in charity and be among the good doers'"
          ],
          "en.sahih": [
            "And spend [in the way of Allah] from what We have provided you before death approaches one of you and he says, \"My Lord, if only You would delay me for a brief term so I would give charity and be among the righteous.\""
          ],
          "en.sarwar": [
            "Spend for the cause of God out of what We have given you before death approaches you, and say, \"Lord, would that you would give me respite for a short time so that I could spend for Your cause and become one of those who do good\"."
          ],
          "en.shakir": [
            "And spend out of what We have given you before death comes to one of you, so that he should say: My Lord! why didst Thou not respite me to a near term, so that I should have given alms and been of the doers of good deeds?"
          ],
          "en.transliteration": [
            "Waanfiqoo min m<u>a</u> razaqn<u>a</u>kum min qabli an yatiya a<u>h</u>adakumu almawtu fayaqoola rabbi lawl<u>a</u> akhkhartanee il<u>a</u> ajalin qareebin faa<u>ss</u>addaqa waakun mina a<b>l</b><u>ssa</u>li<u>h</u>een<b>a</b>"
          ],
          "en.wahiduddin": [
            "And spend out of what We have provided you with before death comes to one of you and he says, \"My Lord! If only You would grant me respite for a little while, then I would give alms and be among the righteous.\""
          ],
          "en.yusufali": [
            "and spend something (in charity) out of the substance which We have bestowed on you, before Death should come to any of you and he should say, \"O my Lord! why didst Thou not give me respite for a little while? I should then have given (largely) in charity, and I should have been one of the doers of good\"."
          ],
          "fa.ansarian": [
            "و از آنچه روزی شما کرده ایم انفاق کنید، پیش از آنکه یکی از شما را مرگ در رسد و بگوید: چرا مرا تا مدتی نزدیک مهلت ندادی تا صدقه دهم و از شایستگان باشم؟!"
          ],
          "fa.ayati": [
            "از آنچه روزيتان داده‌ايم در راه خدا انفاق كنيد، پيش از آنكه يكى از شما را مرگ فرا رسد و بگويد: اى پروردگار من، چرا مرگ مرا اندكى به تأخير نينداختى تا صدقه دهم و از شايستگان باشم؟"
          ],
          "fa.bahrampour": [
            "و از آنچه روزيتان كرده‌ايم انفاق كنيد پيش از آن كه مرگ يكى از شما در رسد، پس بگويد: پروردگارا! چرا مرا تا مدتى نزديك مهلت ندادى تا صدقه دهم و از شايستگان شوم"
          ],
          "fa.fooladvand": [
            "و از آنچه روزى شما گردانيده‌ايم، انفاق كنيد، پيش از آنكه يكى از شما را مرگ فرا رسد و بگويد: «پروردگارا، چرا تا مدتى بيشتر [اجل‌] مرا به تأخير نينداختى تا صدقه دهم و از نيكوكاران باشم؟»"
          ],
          "fa.ghomshei": [
            "و از آنچه روزی شما کردیم (در راه خدا) انفاق کنید پیش از آنکه مرگ بر یکی از شما فرا رسد و در آن حال (به حسرت) بگوید: پروردگارا، چرا اجل مرا اندکی تأخیر نینداختی تا صدقه و احسان بسیار کنم و از نکوکاران شوم؟!"
          ],
          "fa.khorramdel": [
            "از چیزهائی که به شما داده‌ایم بذل و بخشش و صدقه و احسان کنید، پیش از آن که مرگ یکی از شما در رسد و بگوید: پروردگارا! چه می‌شود اگر مدّت کمی مرا به تأخیر اندازی و زنده‌ام بگذاری تا احسان و صدقه بدهم و در نتیجه از زمره‌ی صالحان و خوبان شوم؟! [[«قَبْلِ أَنْ یَأْتِیَ أَحَدَکُمُ الْمَوْتُ ...»: مراد فرا رسیدن مقدّمات مرگ یا سکرات و غمرات آن است. «لَوْ لا»: حرفی است که دلالت بر طلب حصول مابعد خود دارد و فعل ماضی بعد از خود را از لحاظ معنی به مضارع تبدیل می‌نماید. «أَکُنْ»: عطف بر محلّ (أَصَّدَّقَ) است.]]"
          ],
          "fa.khorramshahi": [
            "و پیش از آنکه مرگ به سراغ هر یک از شما بیاید و او بگوید پروردگارا چرا مرا تا مهلتی نزدیک باز پس نداشتی که بتوانم صدقه بدهم و از شایستگان باشم، از آنچه روزیتان کرده‌ایم، بخشش کنید"
          ],
          "fa.makarem": [
            "از آنچه به شما روزی داده‌ایم انفاق کنید، پیش از آنکه مرگ یکی از شما فرا رسد و بگوید: «پروردگارا! چرا (مرگ) مرا مدت کمی به تأخیر نینداختی تا (در راه خدا) صدقه دهم و از صالحان باشم؟!»"
          ],
          "fa.moezzi": [
            "و بدهید از آنچه روزی دادیم شما را پیش از آنکه آید یکی از شما را مرگ پس گوید پروردگارا کاش پس می‌انداختی مرا تا سرآمدی نزدیک تا تصدّق کنم و بشوم از شایستگان‌"
          ],
          "fa.mojtabavi": [
            "و از آنچه شما را روزى كرده‌ايم انفاق كنيد پيش از آنكه يكى از شما را مرگ فرا رسد پس گويد: پروردگارا، چرا مرا تا سرآمدى نزديك بازپس نداشتى- مرگ مرا اندكى به تأخير نيفكندى- تا صدقه دهم و از نيكان و شايستگان باشم؟"
          ],
          "fa.sadeqi": [
            "و از آنچه روزی شما گردانیدیم، انفاق کنید، پیش از آنکه یکی از شما را مرگ فرا رسد. پس بگوید: «پروردگارم! چرا تا مدتی نزدیک (مرگ) مرا به تأخیر نینداختی تا به‌راستی تصدیق کنم و از شایستگان باشم‌؟»"
          ]
        }
      },
      {
        "index": 5199,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:63:11",
        "text": [
          "وَ لَنْ‌ يُؤَخِّرَ اللَّهُ‌ نَفْساً إِذَا جَاءَ أَجَلُهَا وَ اللَّهُ‌ خَبِيرٌ بِمَا تَعْمَلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "But God does not grant a soul respite once its term has come to end. And God is aware of what you do."
          ],
          "en.ahmedraza": [
            "And Allah will never give respite to any soul when its promise arrives; and Allah is Aware of your deeds."
          ],
          "en.arberry": [
            "But God will never defer any soul when its term comes. And God is aware of the things you do."
          ],
          "en.daryabadi": [
            "And Allah deferreth not a soul when its term- hath come; and Allah is Aware of that which ye do."
          ],
          "en.hilali": [
            "And Allah grants respite to none when his appointed time (death) comes. And Allah is All-Aware of what you do."
          ],
          "en.itani": [
            "But God will not delay a soul when its time has come. God is Informed of what you do."
          ],
          "en.maududi": [
            "But when a person's term comes to an end, Allah never grants any respite. Allah is well aware of all that you do."
          ],
          "en.mubarakpuri": [
            "And Allah grants respite to none when his appointed time comes. And Allah is All-Aware of what you do."
          ],
          "en.pickthall": [
            "But Allah reprieveth no soul when its term cometh, and Allah is Informed of what ye do."
          ],
          "en.qarai": [
            "But Allah will never respite anyone when his time has come, and Allah is well aware of what you do."
          ],
          "en.qaribullah": [
            "But Allah will never defer any soul when its term comes. Allah is Aware of what you do."
          ],
          "en.sahih": [
            "But never will Allah delay a soul when its time has come. And Allah is Acquainted with what you do."
          ],
          "en.sarwar": [
            "God will never grant respite to any soul when its appointed time has come. God is Well-Aware of what you do."
          ],
          "en.shakir": [
            "And Allah does not respite a soul when its appointed term has come, and Allah is Aware of what you do."
          ],
          "en.transliteration": [
            "Walan yuakhkhira All<u>a</u>hu nafsan i<u>tha</u> j<u>a</u>a ajaluh<u>a</u> wa<b>A</b>ll<u>a</u>hu khabeerun bim<u>a</u> taAAmaloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "But God will not grant a reprieve to a soul when its appointed time has come; God is well-aware of what you do."
          ],
          "en.yusufali": [
            "But to no soul will Allah grant respite when the time appointed (for it) has come; and Allah is well acquainted with (all) that ye do."
          ],
          "fa.ansarian": [
            "و هرگز خدا کسی را چون اجلش فرا رسد، مهلت نمی دهد؛ و خدا به اعمالی که انجام می دهید، آگاه است."
          ],
          "fa.ayati": [
            "چون كسى اَجلش فرا رسد، خدا مرگ او را به تأخير نمى‌افكند. و خدا به كارهايى كه مى‌كنيد آگاه است."
          ],
          "fa.bahrampour": [
            "و خدا هرگز [مرگ‌] كسى را وقتى اجلش فرا رسيد به تأخير نمى‌اندازد، و خدا بدانچه مى‌كنيد آگاه است"
          ],
          "fa.fooladvand": [
            "و[لى‌] هر كس اجلش فرا رسد، هرگز خدا [آن را] به تأخير نمى‌افكند، و خدا به آنچه مى‌كنيد آگاه است."
          ],
          "fa.ghomshei": [
            "و خدا هرگز اجل هیچ کس را از وقتش که فرا رسد تأخیر نیفکند و خدا به هر چه کنید آگاه است."
          ],
          "fa.khorramdel": [
            "خداوند هرگز مرگ کسی را به تأخیر نمی‌اندازد هنگامی که اجلش فرا رسیده باشد. خداوند کاملاً آگاه از کارهائی است که انجام می‌دهید (و سزا و جزای شما را خواهد داد). [[«نَفْساً»: (نگا: بقره / 48 و 123 و 234).]]"
          ],
          "fa.khorramshahi": [
            "و خداوند هرگز کسی را چون اجلش فرا رسد، بازپس ندارد، و خداوند به آنچه می‌کنید آگاه است‌"
          ],
          "fa.makarem": [
            "خداوند هرگز مرگ کسی را هنگامی که اجلش فرا رسد به تأخیر نمی‌اندازد، و خداوند به آنچه انجام می‌دهید آگاه است."
          ],
          "fa.moezzi": [
            "و هرگز پس نیندازد خدا جائی را گاهی که بیاید سرآمدش و خدا آگاه است بدانچه می‌کنید"
          ],
          "fa.mojtabavi": [
            "و هرگز خدا كسى را چون سرآمدش رسيده باشد بازپس ندارد، و خدا بدانچه مى‌كنيد آگاه است."
          ],
          "fa.sadeqi": [
            "و هر کس اجلش فرا رسد، هرگز خدا آن را به تأخیر نمی‌افکند. و خدا به آنچه می‌کنید بسی آگاه است."
          ]
        }
      }
    ]
  },
  "index": "quran:63",
  "kind": "verse_list"
}