{"data": {"crumbs": [{"indexed_titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}, "path": "/books/quran", "titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}}, {"indexed_titles": {"en": "Chapter 64"}, "path": "/books/quran:64", "titles": {"ar": "التغابن", "en": "Mutual Disillusion", "ent": "At-Taghaabun"}}], "index": 64, "local_index": 64, "order": 108, "part_type": "Chapter", "path": "/books/quran:64", "reveal_type": "Medinan", "rukus": 2, "titles": {"ar": "التغابن", "en": "Mutual Disillusion", "ent": "At-Taghaabun"}, "verse_count": 18, "verse_start_index": 5199, "verses": [{"index": 5200, "local_index": 1, "part_type": "Verse", "path": "/books/quran:64:1", "text": "يُسَبِّحُ‌ لِلَّهِ‌ مَا فِي‌ السَّمَاوَاتِ‌ وَ مَا فِي‌ الْأَرْضِ‌ لَهُ‌ الْمُلْکُ‌ وَ لَهُ‌ الْحَمْدُ وَ هُوَ عَلَى‌ کُلِ‌ شَيْ‌ءٍ قَدِيرٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آنچه در آسمان ها و آنچه در زمین است، خدا را [به پاک بودن از هر عیب و نقصی] می ستایند. فرمانروایی ویژه اوست، همه ستایش ها مخصوص اوست، و او بر هر کاری تواناست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا را تسبيح مى‌گويند هر چه در آسمانها و هر چه در زمين است. فرمانروايى از آنِ اوست و حمد سزاوار اوست و او بر هر چيزى تواناست."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آنچه در آسمان‌ها و آنچه در زمين است خدا را تسبيح مى‌گويند. فرمانروايى از آن او و ستايش مختص اوست، و او بر هر چيزى تواناست"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "هر چه در آسمانها و هر چه در زمين است خدا را تسبيح مى‌گويند. او راست فرمانروايى و او راست سپاس و او بر هر چيزى تواناست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "هر چه در آسمانها و زمین است همه به تسبیح و ستایش خدا مشغولند که سلطنت ملک هستی و ستایش (اهل عالم) برای اوست و او بر هر چیز تواناست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آنچه در آسمانها و آنچه در زمین است، به تسبیح و تقدیس خدا مشغول است. حاکمیّت و مالکیّت از آن او است، و سپاس و ستایش خاصّ او است. او بر هر چیزی توانا است ... [[«یُسَبِّحُ» (نگا: رعد / 13، اِسراء / 44، نور / 41).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آنچه در آسمانها و آنچه در زمین است، خداوند را نیایش کند، فرمانروایی او راست، و سپاس او راست، و او بر هر کاری تواناست‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آنچه در آسمانها و آنچه در زمین است برای خدا تسبیح می‌گویند؛ مالکیت و حکومت از آن اوست و ستایش از آن او؛ و او بر همه چیز تواناست!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "تسبیح گوید برای خدا آنچه در آسمانها و آنچه در زمین است او را است پادشاهی و از آن وی است سپاس و او است بر همه چیز توانا"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آنچه در آسمانها و آنچه در زمين است خداى را به پاكى مى‌ستايند، او راست پادشاهى- پادشاهى حقيقى و مطلق- و او راست سپاس و ستايش، و او بر هر چيزى تواناست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هر چه در آسمان‌ها و هر چه در زمین است برای خدا تسبیح گویند و او راست پادشاهی و او راست (همه‌ی) سپاس و (هم)او بر هر چیزی بسیار تواناست."}, {"lang": "en", "name": "Ahmed Ali", "text": "ALL THAT THERE is in the heavens and the earth sings the praises of God. His the sovereignty and His is the praise, and He has power over everything."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "All whatever is in the heavens and all whatever is in the earth proclaims the Purity of Allah; His only is the kingship and His only is all praise; and He is Able to do all things."}, {"lang": "en", "name": "A. J. Arberry", "text": "All that is in the heavens and the earth magnifies God. His is the Kingdom, and His is the praise, and He is powerful over everything."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Whatsoever is in the heavens and whatsoever is in the earth halloweth Allah. His is the dominion; and His is the praise; and He is over everything potent."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. His is the dominion, and to Him belong all the praises and thanks, and He is Able to do all things."}, {"lang": "en", "name": "Talal Itani", "text": "Everything in the heavens and the earth praises God. To Him belongs the Kingdom, and to Him all praise is due, and He is Able to do all things."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "All that is in the heavens and all that is in the earth extols Allah's glory. His is the sovereignty and to Him is all praise due; He has power over everything."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. His is the dominion, and to Him belongs the praise, and He is Able to do all things."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "All that is in the heavens and all that is in the earth glorifieth Allah; unto Him belongeth Sovereignty and unto Him belongeth praise, and He is Able to do all things."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Whatever there is in the heavens and the earth glorifies Allah. To Him belongs all sovereignty and to Him belongs all praise, and He has power over all things."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "All that is in heavens and earth exalt Allah. His is the Kingdom, and His the Praise. He is powerful over all things."}, {"lang": "en", "name": "Saheeh International", "text": "Whatever is in the heavens and whatever is on the earth is exalting Allah. To Him belongs dominion, and to Him belongs [all] praise, and He is over all things competent."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "All that is in the heavens and the earth glorify God. To Him belongs the Kingdom and all praise. He has power over all things."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Whatever is in the heavens and whatever is in the earth declares the glory of Allah; to Him belongs the kingdom, and to Him is due (all) praise, and He has power over all things."}, {"lang": "en", "name": "English Transliteration", "text": "Yusabbi<u>h</u>u lill<u>a</u>hi m<u>a</u> fee a<b>l</b>ssam<u>a</u>w<u>a</u>ti wam<u>a</u> fee alar<u>d</u>i lahu almulku walahu al<u>h</u>amdu wahuwa AAal<u>a</u> kulli shayin qadeer<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "All that is in the heavens and on the earth extols the glory of God. To Him belongs the Kingdom and to Him all praise is due. He has power over all things."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Whatever is in the heavens and on earth, doth declare the Praises and Glory of Allah: to Him belongs dominion, and to Him belongs praise: and He has power over all things."}]}, {"index": 5201, "local_index": 2, "part_type": "Verse", "path": "/books/quran:64:2", "text": "هُوَ الَّذِي‌ خَلَقَکُمْ‌ فَمِنْکُمْ‌ کَافِرٌ وَ مِنْکُمْ‌ مُؤْمِنٌ‌ وَ اللَّهُ‌ بِمَا تَعْمَلُونَ‌ بَصِيرٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "اوست که شما را آفرید؛ گروهی از شما کافرند، و برخی مؤمن، و خدا به آنچه انجام می دهید، بیناست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اوست كه شما را بيافريد. بعضى از شما كافر، و بعضى مؤمنند. و كارهايى را كه مى‌كنيد مى‌بينيد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اوست كه شما را آفريد پس برخى از شما كافرند و برخى مؤمن، و خدا بدانچه مى‌كنيد بيناست"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اوست آن كس كه شما را آفريد؛ برخى از شما كافرند و برخى مؤمن و خدا به آنچه مى‌كنيد بيناست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "اوست خدایی که شما را آفرید، باز شما بندگان فرقه‌ای کافر ناسپاس و بعضی مؤمن خداشناس هستید و خدا به هر چه کنید کاملاً بیناست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "او کسی است که شما را آفریده است (و به شما آزادی و اختیار داده است). گروهی از شما کافر و گروهی از شما مؤمن می‌گردید. خدا می‌بیند هرچه را که می‌کنید. [[«فَمِنکُمْ کَافِرٌ وَ مِنکُم مُّؤْمِنٌ»: (نگا: کهف / 29، انسان / 3).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و اوست که شما را آفریده است، و بعضی از شما کافرند، و بعضی از شما مؤمن‌اند، و خداوند به آنچه می‌کنید بیناست‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "او کسی است که شما را آفرید (و به شما آزادی و اختیار داد)؛ گروهی از شما کافرید و گروهی مؤمن؛ و خداوند به آنچه انجام می‌دهید بیناست!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "او است آنکه آفرید شما را پس از شما است کافری و از شما است مؤمنی و خدا بدانچه کنید بینا است‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اوست كه شما را آفريد پس برخى از شما كافر و برخى از شما مؤمن‌ايد و خدا بدانچه مى‌كنيد بيناست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "اوست کسی که شما را آفرید؛ پس برخی از شما (به هنگام تکلیف) کافرند و برخی (درآن هنگام) مؤمنند، و خدا به آنچه می‌کنید بس بیناست."}, {"lang": "en", "name": "Ahmed Ali", "text": "It is He who created you, though one of you is an infidel and one of you a believer; yet God perceives what you do."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "It is He Who has created you, so among you one is a disbeliever whereas another is a Muslim; and Allah is seeing your deeds."}, {"lang": "en", "name": "A. J. Arberry", "text": "It is He who created you. One of you is an unbeliever, and one of you a believer; and God sees the things you do."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "He it is Who hath created you; then of you some are Infidels and of you some are believers; and Allah is of that which ye Work Beholder."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "He it is Who created you, then some of you are disbelievers and some of you are believers. And Allah is All-Seer of what you do."}, {"lang": "en", "name": "Talal Itani", "text": "It is He who created you. Some of you are unbelievers, and some of you are believers. And God perceives what you do."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "He it is Who has created you: and among you are those that deny the Truth and among you are those that believe in it. Allah observes all that you do."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "He it is Who created you, then some of you are disbelievers and some of you are believers. And Allah is All-Seer of what you do."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "He it is Who created you, but one of you is a disbeliever and one of you is a believer, and Allah is Seer of what ye do."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "It is He who created you. Then some of you are faithless and some of you are faithful, and Allah watches what you do."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "It is He who created you. Amongst you is an unbeliever and amongst you is a believer. Allah sees the things you do."}, {"lang": "en", "name": "Saheeh International", "text": "It is He who created you, and among you is the disbeliever, and among you is the believer. And Allah, of what you do, is Seeing."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "It is He who has created you all but some of you have accepted the faith and some of you have not. God is Well Aware of what you do."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "He it is Who created you, but one of you is an unbeliever and another of you is a believer; and Allah sees what you do."}, {"lang": "en", "name": "English Transliteration", "text": "Huwa alla<u>th</u>ee khalaqakum faminkum k<u>a</u>firun waminkum muminun wa<b>A</b>ll<u>a</u>hu bim<u>a</u> taAAmaloona ba<u>s</u>eer<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "It was He who created you; and some of you are those who deny this truth, and some who believe [in it]. God sees everything you do."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "It is He Who has created you; and of you are some that are Unbelievers, and some that are Believers: and Allah sees well all that ye do."}]}, {"index": 5202, "local_index": 3, "part_type": "Verse", "path": "/books/quran:64:3", "text": "خَلَقَ‌ السَّمَاوَاتِ‌ وَ الْأَرْضَ‌ بِالْحَقِ‌ وَ صَوَّرَکُمْ‌ فَأَحْسَنَ‌ صُوَرَکُمْ‌ وَ إِلَيْهِ‌ الْمَصِيرُ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آسمان ها و زمین را به حق آفرید، و شما را صورت گری کرد و صورت هایتان را نیکو آراست، و بازگشت به سوی اوست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آسمانها و زمين را به حق بيافريد و شما را تصوير كرد و نيكو تصوير كرد. و سرانجام همه به سوى اوست."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آسمان‌ها و زمين را به حق آفريد و شما را صورتگرى كرد و صورت‌هايتان را نيكو ساخت، و بازگشت [همه‌] به سوى اوست"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آسمانها و زمين را به حق آفريد و شما را صورتگرى كرد و صورتهايتان را نيكوآراست، و فرجام به سوى اوست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "خدا آسمانها و زمین را به حق (و نظم احسن اتقن) آفرید و شما آدمیان را به زیباترین صورت برنگاشت، و بازگشت همه خلایق به سوی اوست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "خداوند، آسمانها و زمین را به حق آفریده است (نه به باطل. در آفرینش آن، نظام دقیق و راستینی به کار رفته است، و دارای هدفی حکیمانه و مسیری درست است) و شما را شکل بخشیده است و شکلهای شما را خوب و زیبا کرده است. سرانجام بازگشت به سوی او است. [[«خَلَقَ السَّمَاوَاتِ و الأرْضَ بِالْحَقِّ»: (نگا: انعام / 73، ابراهیم / 19، نحل / 3). «صَوَّرَکُمْ فَأَحْسَنَ صُوَرَکُمْ»: (نگا: غافر / 64، اعراف / 11، آل‌عمران / 6).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آسمانها و زمین را به حق آفرید و شما را نقش و نگار کرد و پیکرهای شما را بر آراست، و سیر و سرانجام به سوی اوست‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آسمانها و زمین را بحق آفرید؛ و شما را (در عالم جنین) تصویر کرد، تصویری زیبا و دلپذیر؛ و سرانجام (همه) بسوی اوست."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آفرید آسمانها و زمین را به حقّ و پیکر ساخت شما را پس نکو ساخت پیکرهای شما را و بسوی او است بازگشت‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آسمانها و زمين را بحق آفريد و شما را صورت نگاشت پس صورتهاى شما را نيكو نگاشت، و بازگشت [همه‌] به سوى اوست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "آسمان‌ها و زمین را به (تمامی) حق آفرید و شما را صورتگری کرد و صورت‌هایتان را نیکو ساخت. و بازگشت تنها سوی اوست."}, {"lang": "en", "name": "Ahmed Ali", "text": "He created the heavens and the earth with deliberation, and gave you form, and shaped you well; and to Him is your returning."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "He created the heavens and the earth with the truth, and fashioned you thereby making you in best shapes; and towards Him only is the return."}, {"lang": "en", "name": "A. J. Arberry", "text": "He created the heavens and the earth with the truth, and He shaped you, and shaped you well; and unto Him is the homecoming."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "He hath created the heavens and the earth with truth, and hath formed you, and hath made-your forms goodly; and Unto Him Is the return."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "He has created the heavens and the earth with truth, and He shaped you and made good your shapes, and to Him is the final Return."}, {"lang": "en", "name": "Talal Itani", "text": "He created the heavens and the earth with truth, and He designed you, and designed you well, and to Him is the final return."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "He created the heavens and the earth with Truth and shaped you, giving you excellent shapes. And to Him is your ultimate return."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "He has created the heavens and the earth with truth, and He shaped you and made good your shapes. And to Him is the return."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "He created the heavens and the earth with truth, and He shaped you and made good your shapes, and unto Him is the journeying."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "He created the heavens and the earth with consummate wisdom, and He formed you and perfected your forms, and toward Him is your destination."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "He created the heavens and the earth in truth and He shaped you and gave you good shapes. To Him is the arrival."}, {"lang": "en", "name": "Saheeh International", "text": "He created the heavens and earth in truth and formed you and perfected your forms; and to Him is the [final] destination."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "He has created the heavens and the earth for a genuine purpose and has formed you in the best shape. To Him all things return."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "He created the heavens and the earth with truth, and He formed you, then made goodly your forms, and to Him is the ultimate resort."}, {"lang": "en", "name": "English Transliteration", "text": "Khalaqa a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>a bi<b>a</b>l<u>h</u>aqqi wa<u>s</u>awwarakum faa<u>h</u>sana <u>s</u>uwarakum wailayhi alma<u>s</u>eer<b>u</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "He created the heavens and the earth for a purpose. He formed you and gave you the best of forms. To Him you shall all return."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "He has created the heavens and the earth in just proportions, and has given you shape, and made your shapes beautiful: and to Him is the final Goal."}]}, {"index": 5203, "local_index": 4, "part_type": "Verse", "path": "/books/quran:64:4", "text": "يَعْلَمُ‌ مَا فِي‌ السَّمَاوَاتِ‌ وَ الْأَرْضِ‌ وَ يَعْلَمُ‌ مَا تُسِرُّونَ‌ وَ مَا تُعْلِنُونَ‌ وَ اللَّهُ‌ عَلِيمٌ‌ بِذَاتِ‌ الصُّدُورِ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آنچه را که در آسمان ها و زمین است می داند، و [نیز] آنچه را پنهان می کنید و آنچه را آشکار می نمایید، می داند و خدا به نیّات و اسرار سینه ها داناست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "هر چه را در آسمانها و زمين است مى‌داند و به آنچه پنهان مى‌داريد يا آشكار مى‌سازيد آگاه است، و خدا به هر چه در دلها مى‌گذرد عالم است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آنچه را كه در آسمان‌ها و زمين است مى‌داند، و آنچه را پنهان كنيد و آنچه را آشكار سازيد مى‌داند، و خدا به راز دل‌ها داناست"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آنچه را كه در آسمانها و زمين است مى‌داند، و آنچه را كه پنهان مى‌كنيد و آنچه را كه آشكار مى‌داريد [نيز] مى‌داند، و خدا به راز دلها داناست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "او آنچه را که در آسمانها و زمین است و آنچه را که شما پنهان و آشکار کنید همه را می‌داند و خدا به اسرار دلها هم داناست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "او می‌داند که در آسمانها و زمین چه چیزهائی است، و از آنچه شما پنهان یا آشکار می‌دارید با خبر است، و خدا بس آگاه از عقائد و نیّاتی است که در درون سینه‌ها است. [[«مَا تُسِرُّونَ وَ مَا تُعْلِنُونَ»: (نگا: نحل / 19).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آنچه در آسمانها و زمین است می‌داند و آنچه پنهان می‌دارید و آنچه آشکار می‌دارید، می‌داند، و خداوند به راز دلها داناست‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آنچه را در آسمانها و زمین است می‌داند، و از آنچه پنهان یا آشکار می‌کنید با خبر است؛ و خداوند از آنچه در درون سینه‌هاست آگاه است."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "داند آنچه در آسمانها و زمین است و می‌داند آنچه را نهان دارید و آنچه آشکار کنید و خدا دانا است بدانچه در سینه‌ها است‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آنچه را در آسمانها و زمين است مى‌داند، و آنچه را پنهان مى‌كنيد و آنچه را آشكار مى‌كنيد مى‌داند، و خدا به آنچه در سينه‌هاست- نيّتها و رازها- داناست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "آنچه را که در آسمان‌ها و زمین است می‌داند و آنچه را که پنهان می‌کنید و آنچه را که آشکار می‌دارید (نیز) می‌داند. و خدا به (راز) ذاتی سینه‌ها(تان) بسی داناست."}, {"lang": "en", "name": "Ahmed Ali", "text": "He knows what is in the heavens and the earth, and knows what you hide and what you disclose; God knows what is in the hearts."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "He knows all whatever is in the heavens and in the earth, and He knows all what you hide and all what you disclose; and Allah knows what lies within the hearts."}, {"lang": "en", "name": "A. J. Arberry", "text": "He knows whatever is in the heavens and the earth, and He knows what you conceal and what you publish. God knows the thoughts within the breasts."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "He knoweth whatsoever is In the heavens and the earth, and He knoweth whatsoever ye keep secret, and whatsoever ye make known; and Allah is the Knower of whatsoever is in the breasts."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "He knows what is in the heavens and on earth, and He knows what you conceal and what you reveal. And Allah is the All-Knower of what is in the breasts (of men)."}, {"lang": "en", "name": "Talal Itani", "text": "He knows everything in the heavens and the earth, and He knows what you conceal and what you reveal. And God knows what is within the hearts."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "He knows what is in the heavens and the earth, and knows what you conceal and what you disclose. Allah even knows what lies hidden in the breasts of people."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "He knows what is in the heavens and on earth, and He knows what you conceal and what you reveal. And Allah is the All-Knower of what is in the breasts."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "He knoweth all that is in the heavens and the earth, and He knoweth what ye conceal and what ye publish. And Allah is Aware of what is in the breasts (of men)."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "He knows whatever there is in the heavens and the earth, and He knows whatever you hide and whatever you disclose, and Allah knows best what is in your breasts."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "He knows whatever is in the heavens and the earth and He knows all what you conceal and what you reveal. Allah knows the innermost of the chests."}, {"lang": "en", "name": "Saheeh International", "text": "He knows what is within the heavens and earth and knows what you conceal and what you declare. And Allah is Knowing of that within the breasts."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "He knows all that is in the heavens and the earth and all that you reveal or conceal. God knows best whatever the hearts contain."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "He knows what is in the heavens and the earth, and He knows what you hide and what you manifest; and Allah is Cognizant of what is in the hearts."}, {"lang": "en", "name": "English Transliteration", "text": "YaAAlamu m<u>a</u> fee a<b>l</b>ssam<u>a</u>w<u>a</u>ti wa<b>a</b>lar<u>d</u>i wayaAAlamu m<u>a</u> tusirroona wam<u>a</u> tuAAlinoona wa<b>A</b>ll<u>a</u>hu AAaleemun bi<u>tha</u>ti a<b>l</b><u>ss</u>udoor<b>i</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "He knows whatever is in the heavens and the earth. He knows all that you conceal and all that you reveal. God is aware of what is in your hearts."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "He knows what is in the heavens and on earth; and He knows what ye conceal and what ye reveal: yea, Allah knows well the (secrets) of (all) hearts."}]}, {"index": 5204, "local_index": 5, "part_type": "Verse", "path": "/books/quran:64:5", "text": "أَ لَمْ‌ يَأْتِکُمْ‌ نَبَأُ الَّذِينَ‌ کَفَرُوا مِنْ‌ قَبْلُ‌ فَذَاقُوا وَبَالَ‌ أَمْرِهِمْ‌ وَ لَهُمْ‌ عَذَابٌ‌ أَلِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آیا خبر کسانی که پیش از این کافر شدند، پس عقوبت کفرشان را چشیدند و برای آنان عذابی دردناک است، به شما نرسیده است؟"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آيا شما را خبر كسانى كه از اين پيش كافر شده بودند نرسيده است؟ عقوبت عملشان را چشيدند و ايشان راست عذابى دردآور."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "آيا خبر كسانى كه پيش از اين كافر شدند و سزاى كارشان را چشيدند و عذابى دردناك خواهند داشت، به شما نرسيده است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "آيا خبر كسانى كه پيش از اين كفر ورزيدند، و فرجام بد كارشان را چشيدند و عذاب پر دردى خواهند داشت، به شما نرسيده است؟"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "آیا حکایت حال پیشینیان که کافر شدند به شما نرسید؟ که (هم در دنیا) به کیفر کردارشان رسیدند و (هم در آخرت) عذاب دردناک بر آنان مهیّاست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "آیا خبر کافرانی که در روزگاران پیشین می‌زیسته‌اند به شما نرسیده است؟ آنان عقوبت ناگوار کارهای خود را (در دنیا) چشیدند، و عذاب دردناکی (هم در آخرت) دارند. [[«نَبَأُ»: خبر ... الف زائدی در رسم الخطّ قرآنی در آخر دارد. «وَ بَالَ»: (نگا: مائده / 95، حشر / 15).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "آیا خبر کسانی که پیش از این کفرورزیدند به شما نرسیده است که عقوبت کارشان را چشیدند و برای آنان عذابی دردناک [در پیش‌] است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "آیا خبر کسانی که پیش از این کافر شدند به شما نرسیده است؟! (آری) آنها طعم کیفر گناهان بزرگ خود را چشیدند؛ و عذاب دردناک برای آنهاست!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "آیا نیامد شما را داستان آنان که کفر ورزیدند از پیش پس چشیدند بد فرجامی کار خود را و ایشان را است عذابی دردناک‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آيا خبر كسانى كه پيش از اين كافر شدند به شما نيامده است؟ كه سرانجام بدِ كارِ خويش چشيدند و آنان را عذابى است دردناك."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "آیا خبر مهم کسانی که پیش از این کافر شدند -پس فرجام سخت بدکاریشان را چشیدند، حال آنکه عذاب پر دردی برای آنان است- به شما نرسیده است‌؟"}, {"lang": "en", "name": "Ahmed Ali", "text": "Has not the account of those who disbelieved before come to you, who tasted the torment of their action, and for whom is grievous punishment?"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Did not the news of those who disbelieved before you reach you? So they tasted the evil outcome of their deeds, and for them is a painful punishment."}, {"lang": "en", "name": "A. J. Arberry", "text": "Has there not come to you the tidings of those that disbelieved before, then tasted the mischief of their action, and there yet awaits them a painful chastisement?"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Hath not the tidings reached you of those who disbelieved aforetime, and so tasted the evil consequence of their affair, and theirs will be a torment afflictive?"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Has not the news reached you of those who disbelieved aforetime? And so they tasted the evil result of their disbelief, and theirs will be a painful torment."}, {"lang": "en", "name": "Talal Itani", "text": "Has the news not reached you, of those who disbelieved before? They tasted the ill consequences of their conduct, and a painful torment awaits them."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Has the news of the unbelievers of the past not reached you? (They disbelieved) and then tasted its evil consequence. A grievous chastisement awaits them."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Has not the news reached you of those who disbelieved aforetime And so they tasted the evil result of their disbelief, and theirs will be a painful torment."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Hath not the story reached you of those who disbelieved of old and so did taste the ill-effects of their conduct, and theirs will be a painful doom."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Has there not come to you the account of those who were faithless before? They tasted the evil consequence of their conduct, and there is a painful punishment for them."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Have you not heard the news of those before you who disbelieved? They tasted the mischief of their action, and for them is a painful punishment."}, {"lang": "en", "name": "Saheeh International", "text": "Has there not come to you the news of those who disbelieved before? So they tasted the bad consequence of their affair, and they will have a painful punishment."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Have you not received the news about the disbelievers living before you who suffered the consequences of their deeds and will suffer a painful torment?"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Has there not come to you the story of those who disbelieved before, then tasted the evil result of their conduct, and they had a painful punishment?"}, {"lang": "en", "name": "English Transliteration", "text": "Alam yatikum nabao alla<u>th</u>eena kafaroo min qablu fa<u>tha</u>qoo wab<u>a</u>la amrihim walahum AAa<u>tha</u>bun aleem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Have you not heard about those who denied the truth before you and tasted the evil consequences of their conduct? They will have a painful punishment."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Has not the story reached you, of those who rejected Faith aforetime? So they tasted the evil result of their conduct; and they had a grievous Penalty."}]}, {"index": 5205, "local_index": 6, "part_type": "Verse", "path": "/books/quran:64:6", "text": "ذٰلِکَ‌ بِأَنَّهُ‌ کَانَتْ‌ تَأْتِيهِمْ‌ رُسُلُهُمْ‌ بِالْبَيِّنَاتِ‌ فَقَالُوا أَ بَشَرٌ يَهْدُونَنَا فَکَفَرُوا وَ تَوَلَّوْا وَ اسْتَغْنَى‌ اللَّهُ‌ وَ اللَّهُ‌ غَنِيٌ‌ حَمِيدٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "آن [عقوبت و عذاب دردناک] به سبب آن است که پیامبرانشان همواره دلایل روشن برای آنان آوردند، ولی گفتند: آیا بشر [ی مانند خودمان] ما را راهنمایی می کنند؟! پس کافر شدند و [از حق] روی گرداندند و خدا [از ایمان و طاعتشان] اظهار بی نیازی کرد، و خدا بی نیاز و ستوده است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اين به كيفر آن بود كه پيامبرانشان با دليلهاى روشن بر آنان مبعوث شدند. و آنها گفتند: آيا آدميان ما را هدايت مى‌كنند؟ پس انكار كردند و رويگردان گشتند و خدا بى‌نياز است، كه توانگر و در خور ستايش است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اين [بد فرجامى‌] از آن روست كه پيامبرانشان دلايل آشكار برايشان آوردند ولى آنها گفتند: آيا بشرى ما را هدايت مى‌كند؟ پس كافر شدند و روى گردانيدند، و خدا [از ايمانشان‌] بى‌نيازى نمود، و خدا بى‌نياز ستوده است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اين [بدفرجامى‌] از آن روى بود كه پيامبرانشان دلايل آشكار برايشان مى‌آوردند و[لى‌] آنان [مى‌]گفتند: «آيا بشرى ما را هدايت مى‌كند؟» پس كافر شدند و روى گردانيدند و خدا بى‌نيازى نمود، و خدا بى‌نياز ستوده‌است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "این (عذاب) برای آن بود که رسولان آنها با ادلّه و معجزات به سویشان می‌آمدند و آنها (به تکذیب و طعن) می‌گفتند: آیا بشرهایی (مانند ما) رهنمایی ما توانند کرد؟ پس کافر شدند و روی گردانیدند و البته خدا (از کفر و ایمان خلق) بی‌نیاز است که خدا غنیّ بالذّات و ستوده به جمیع صفات است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "این (سوء عاقبت و عذاب آخرت) بدان خاطر است که پیغمبرانشان به پیش ایشان می‌آمدند و معجزات روشن و دلائل متقن برای آنان می‌آوردند و ایشان می‌گفتند: آیا آدمیان، ما را هدایت می‌کنند؟ (مگر می‌شود انسانهائی همچون خودمان پیغمبران خدا شوند؟! پیغمبران باید فرشته باشند. بدین وسیله به مخالفت برمی‌خاستند و) کافر می‌گشتند و سر بر می‌تافتند و رویگردان می‌شدند، و خدا هم بی‌نیاز (از ایمان و اطاعت ایشان) بود و (همیشه هم) بی‌نیاز است و سزاوار ستایش و سپاس. [[«بَشَرٌ»: این واژه برای مفرد و مثنّی و جمع استعمال می‌گردد. در اینجا مراد انبیاء - علیهم‌السلام - است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "این از آن است که پیامبرانشان برای آنان پدیده‌های شگرف آوردند، و گفتند آیا بشری می‌خواهد هدایتمان کند، پس کفر [و انکار]ورزیدند و روی بر تافتند و خداوند بی‌نیازی نمود و خداوند بی‌نیاز ستوده است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "این بخاطر آن است که رسولان آنها (پیوسته) با دلایل روشن به سراغشان می‌آمدند، ولی آنها (از روی کبر و غرور) گفتند: «آیا بشرهایی (مثل ما) می‌خواهند ما را هدایت کنند؟!» از این رو کافر شدند و روی برگرداندند؛ و خداوند (از ایمان و طاعتشان) بی نیاز بود، و خدا غنی و شایسته ستایش است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "این بدان است که بودند می‌آمدندشان پیامبرانشان به نشانیها پس گفتند آیا بشری ما را رهبری کند پس کفر ورزیدند و پشت کردند و بی‌نیازی گرفت خدا و خدا است بی‌نیاز ستوده‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "آن [عذاب‌] از اين روست كه پيامبرانشان با حجتهاى روشن بديشان مى‌آمدند، ولى آنها مى‌گفتند: آيا آدميان ما را راه مى‌نمايند؟! پس كافر شدند و [از حق‌] برگشتند و خداى [از ايمانشان‌] بى‌نيازى نمود، و خدا بى‌نياز است و ستوده."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "این (بد فرجامی) از آن روست که بی‌گمان پیامبرانشان دلایل آشکار برایشان می‌آورده‌اند، پس آنان می‌گفتند: «آیا بشرهایی ما را هدایت می‌کنند؟» پس کافر شدند و روی گردانیدند، و خدا (از آنان) بی‌نیازی کرد. و خدا بی‌نیازی بس ستوده است."}, {"lang": "en", "name": "Ahmed Ali", "text": "This was so because their apostles came to them with clear proofs, but they said: \"What. Can a mortal show us the way?\" And they denied and turned away; but God was unconcerned. God is all-sufficient, worthy of praise."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "This is because their Noble Messengers used to bring clear proofs to them, in response they said, “What! Will humans show us the way?”; they therefore became disbelievers and turned away, and Allah acted independently; and Allah is the Independent, the Most Praiseworthy."}, {"lang": "en", "name": "A. J. Arberry", "text": "That is because their Messengers came to them with the clear signs, and then they said, 'What, shall mortals be our guides?' Therefore they disbelieved, and turned away; and God was in no need of them. And God is All-sufficient, All-laudable."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "That was because their apostles were wont to come Unto them with evidences, but they said: shall a mere human bein guide us? Wherefore they disbelieved and turned away; and Allah needed them not. And Allah is Self Sufficient, Praiseworthy."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "That was because there came to them their Messengers with clear proofs (signs), but they said: \"Shall mere men guide us?\" So they disbelieved and turned away (from the truth), and Allah was not in need (of them). And Allah is Rich (Free of all wants), Worthy of all praise."}, {"lang": "en", "name": "Talal Itani", "text": "That is because their messengers came to them with clear explanations, but they said, “Are human beings going to guide us?” So they disbelieved and turned away. But God is in no need. God is Independent and Praiseworthy."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "This was because their Messengers would come to them with Clear Signs, but they would say: “Shall mortals (like ourselves) guide us to the Right Way?” They rejected the Truth and turned away. Thereupon Allah became unconcerned with them, for Allah is Self-Sufficient, Innately Praiseworthy."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "That was because there came to them their Messengers with Bayyinat, but they said: \"Shall mere men guide us\" So they disbelieved and turned away. But Allah was not in need. And Allah is not in need, Worthy of all praise."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "That was because their messengers (from Allah) kept coming unto them with clear proofs (of Allah's Sovereignty), but they said: Shall mere mortals guide us? So they disbelieved and turned away, and Allah was independent (of them). Allah is Absolute, Owner of Praise."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "That was because their apostles would bring them manifest proofs, but they said, ‘Will humans be our guides?!’ So they disbelieved and turned away, and Allah had no need [of their faith] and Allah is all-sufficient, all-laudable."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "That is because, when their Messengers came to them with clear proofs they said: 'Shall humans be our guides' They disbelieved and turned away, but Allah was not in need (of them). Allah is the Rich and the Praised."}, {"lang": "en", "name": "Saheeh International", "text": "That is because their messengers used to come to them with clear evidences, but they said, \"Shall human beings guide us?\" and disbelieved and turned away. And Allah dispensed [with them]; and Allah is Free of need and Praiseworthy."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "This was because their messengers came to them with clear proof (to support their prophethood) and they said, \"Can mere mortals provide us with guidance?\" They rejected the Messengers and turned away. God does not need the worship of anyone. He is Self-sufficient and Praiseworthy."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "That is because there came to them their apostles with clear arguments, but they said: Shall mortals guide us? So they disbelieved and turned back, and Allah does not stand in need (of anything), and Allah is Self-sufficient, Praised."}, {"lang": "en", "name": "English Transliteration", "text": "<u>Tha</u>lika biannahu k<u>a</u>nat tateehim rusuluhum bi<b>a</b>lbayyin<u>a</u>ti faq<u>a</u>loo abasharun yahdoonan<u>a</u> fakafaroo watawallaw wa<b>i</b>staghn<u>a</u> All<u>a</u>hu wa<b>A</b>ll<u>a</u>hu ghaniyyun <u>h</u>ameed<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "That was because their messengers came to them with clear signs, but they replied, \"Shall mortals be our guides?\" And so they rejected the truth and turned away. God has no need of such people; God is self-sufficient and worthy of all praise."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "That was because there came to them messengers with Clear Signs, but they said: \"Shall (mere) human beings direct us?\" So they rejected (the Message) and turned away. But Allah can do without (them): and Allah is free of all needs, worthy of all praise."}]}, {"index": 5206, "local_index": 7, "part_type": "Verse", "path": "/books/quran:64:7", "text": "زَعَمَ‌ الَّذِينَ‌ کَفَرُوا أَنْ‌ لَنْ‌ يُبْعَثُوا قُلْ‌ بَلَى‌ وَ رَبِّي‌ لَتُبْعَثُنَ‌ ثُمَ‌ لَتُنَبَّؤُنَ‌ بِمَا عَمِلْتُمْ‌ وَ ذٰلِکَ‌ عَلَى‌ اللَّهِ‌ يَسِيرٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "کافران پنداشتند [که پس از مرگ] هرگز برانگیخته نخواهند شد. بگو: آری سوگند به پروردگارم مسلماً برانگیخته خواهید شد، سپس شما را به آنچه انجام داده اید، خبر خواهند داد، و این بر خدا آسان است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "كافران پنداشتند كه آنها را زنده نمى‌كنند. بگو: آرى، به پروردگارم سوگند كه شما را زنده مى‌كنند تا به كارهايى كه كرده‌ايد آگاه سازند. و اين بر خدا آسان است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "كسانى كه كافر شدند، پنداشتند كه هرگز برانگيخته نمى‌شوند. بگو: چرا، سوگند به پروردگارم كه حتما برانگيخته مى‌شويد، سپس از [حقيقت‌] آنچه كرده‌ايد قطعا خبردار مى‌شويد، و اين بر خدا آسان است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "كسانى كه كفر ورزيدند، پنداشتند كه هرگز برانگيخته نخواهند شد. بگو: «آرى، سوگند به پروردگارم، حتماً برانگيخته خواهيد شد، سپس شما را به [حقيقت‌] آنچه كرده‌ايد قطعاً واقف خواهند ساخت، و اين بر خدا آسان است.»"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "کافران گمان کردند که هرگز (پس از مرگ) برانگیخته نمی‌شوند. بگو: چرا، به خدای من سوگند که البته برانگیخته می‌شوید و سپس به (نتیجه) اعمال خود آگاهتان گردانند و این کار بر خدا بسیار آسان است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "کافران می‌پندارند که هرگز زنده و برانگیخته نخواهند گردید! بگو: چنین نیست که می‌پندارید، به پروردگارم سوگند! زنده و برانگیخته خواهید شد، و سپس از آن چیزهائی که می‌کرده‌اید با خبرتان خواهند کرد. و این کار برای خدا ساده و آسان است. [[«بَلی»: این حرف برای ابطال نفی کلام ماقبل است. یعنی سخن منفی پیشین را مثبت می‌سازد. «یَسِیرٌ»: ساده و آسان.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "کافران پنداشته‌اند که هرگز برانگیخته نمی‌شوند، بگو آری سوگند به پروردگارم که برانگیخته خواهید شد، سپس از [حقیقت‌] آنچه کرده‌اید، آگاهتان کنند، و این بر خداوند آسان است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "کافران پنداشتند که هرگز برانگیخته نخواهند شد، بگو: «آری به پروردگارم سوگند که همه شما (در قیامت) برانگیخته خواهید شد، سپس آنچه را عمل می‌کردید به شما خبر داده می‌شود، و این برای خداوند آسان است!»"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "پنداشتند آنان که کفر ورزیدند که هرگز برانگیخته نشوند بگو بلی سوگند به پروردگارم هر آینه برانگیخته شوید سپس آگاه شوید بدانچه کردید و آن است بر خدا آسان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "كسانى كه كافر شدند پنداشتند كه هرگز زنده و برانگيخته نمى‌شوند. بگو: چرا، به پروردگارم سوگند كه هر آينده زنده و برانگيخته مى‌شويد، سپس بدانچه كرده‌ايد خبر داده شويد و اين بر خدا آسان است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "کسانی که کافر شدند، پنداشتند که هرگز برانگیخته نخواهند شد. بگو: «آری، سوگند به پروردگارم، همانا به‌راستی برانگیخته خواهید شد. سپس شما همواره به آنچه کرده‌اید بی‌چون خبری مهم داده خواهید شد و این تنها بر خدا آسان است.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "The unbelievers claim that they will not be raised again. Tell them: \"Why not? By my Lord, you will certainly be raised again, and then informed of what you had done. That is how the law of God works inevitably.\""}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "The disbelievers alleged that they will surely not be raised again; proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Surely yes, why not? By oath of Lord, you will surely be raised again and you will then be informed of your misdeeds; and this is easy for Allah.”"}, {"lang": "en", "name": "A. J. Arberry", "text": "The unbelievers assert that they will never be raised up. Say: 'Yes indeed, by my Lord! You shall be raised up, then you shall be told the things you did. That is easy for God.'"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Those who dlsbelieve assert that they shall not be raised. Say thou 'Yea! by my Lord, ye shall surely be raised, and then Unto you shall be declared that which ye have worked; and that is for Allah easy."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "The disbelievers pretend that they will never be resurrected (for the Account). Say (O Muhammad SAW): \"Yes! By my Lord, you will certainly be resurrected, then you will be informed of (and recompensed for) what you did, and that is easy for Allah."}, {"lang": "en", "name": "Talal Itani", "text": "Those who disbelieve claim that they will not be resurrected. Say, “Yes indeed, by my Lord, you will be resurrected; then you will be informed of everything you did; and that is easy for God.”"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "The unbelievers have vehemently contended that they shall not be raised to life. Say to them: “Yes, by my Lord, you shall surely be raised to life, and you shall certainly be fully informed of all that you did. That is easy enough for Allah.”"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "The disbelievers pretend that they will never be resurrected. Say: \"Yes! By my Lord, you will certainly be resurrected, then you will be informed of what you did; and that is easy for Allah.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Those who disbelieve assert that they will not be raised again. Say (unto them, O Muhammad): Yea, verily, by my Lord! ye will be raised again and then ye will be informed of what ye did; and that is easy for Allah."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "The faithless claim that they will not be resurrected. Say, ‘Yes, by my Lord, you will surely be resurrected; then you will surely be informed of what you did, and that is easy for Allah.’"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "The unbelievers think that they will never be raised up. Say: 'By my Lord, yes indeed, you shall assuredly be raised up! Then you shall be told of all that you have done. That is easy for Allah'"}, {"lang": "en", "name": "Saheeh International", "text": "Those who disbelieve have claimed that they will never be resurrected. Say, \"Yes, by my Lord, you will surely be resurrected; then you will surely be informed of what you did. And that, for Allah, is easy.\""}, {"lang": "en", "name": "Muhammad Sarwar", "text": "The disbelievers have thought that they would never be resurrected (Muhammad). Say, \"I swear by my Lord that you will certainly be resurrected and will be told about all that you have done.\" All this is certainly very easy for God."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Those who disbelieve think that they shall never be raised. Say: Aye! by my Lord! you shall most certainly be raised, then you shall most certainly be informed of what you did; and that is easy to Allah."}, {"lang": "en", "name": "English Transliteration", "text": "ZaAAama alla<u>th</u>eena kafaroo an lan yubAAathoo qul bal<u>a</u> warabbee latubAAathunna thumma latunabbaonna bim<u>a</u> AAamiltum wa<u>tha</u>lika AAal<u>a</u> All<u>a</u>hi yaseer<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Those who deny the truth claim that they will never be raised up again. Say, \"By my Lord, most surely you will be raised up again and then you will be told of all that you have done; and that is easy enough for God.\""}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "The Unbelievers think that they will not be raised up (for Judgment). Say: \"Yea, By my Lord, Ye shall surely be raised up: then shall ye be told (the truth) of all that ye did. And that is easy for Allah.\""}]}, {"index": 5207, "local_index": 8, "part_type": "Verse", "path": "/books/quran:64:8", "text": "فَآمِنُوا بِاللَّهِ‌ وَ رَسُولِهِ‌ وَ النُّورِ الَّذِي‌ أَنْزَلْنَا وَ اللَّهُ‌ بِمَا تَعْمَلُونَ‌ خَبِيرٌ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "پس به خدا و پیامبرش و نوری که نازل کردیم، ایمان آورید و خدا به آنچه انجام می دهید، آگاه است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "پس به خدا و پيامبرش و اين نور كه نازل كرده‌ايم ايمان بياوريد. و خدا به كارهايى كه مى‌كنيد آگاه است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "پس به خدا و رسول او و نورى كه فرو فرستاده‌ايم ايمان بياوريد، و خدا به آنچه مى‌كنيد آگاه است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "پس به خدا و پيامبر او و آن نورى كه ما فرو فرستاديم ايمان آوريد، و خدا به آنچه مى‌كنيد آگاه است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "پس به خدا ایمان آرید و به رسول او و نور علم و حکمتی که (بندگان را در آیات قرآن) فرستاده‌ایم بگروید، و (بترسید که) خدا به هر چه کنید آگاه است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ایمان بیاورید به خدا و پیغمبرش و نوری که (قرآن نام دارد و آن را برای روشن کردن راه سعادت دنیا و آخرت شما انسانها) نازل کرده‌ایم. خداوند کاملاً آگاه از هر آن چیزی است که انجام می‌دهید. [[«النُّورِ»: قرآن (نگا: نساء / 174، شوری / 52).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "پس به خداوند و پیامبر او و نوری که فرو فرستاده‌ایم ایمان آورید، و خداوند به آنچه می‌کنید آگاه است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "حال که چنین است، به خدا و رسول او و نوری که نازل کرده‌ایم ایمان بیاورید؛ و بدانید خدا به آنچه انجام می‌دهید آگاه است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "پس ایمان آرید به خدا و پیمبرش و روشنائی که فرستادیم و خدا است بدانچه کنید آگاه‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "پس به خدا و پيامبرش و نورى كه فرو فرستاده‌ايم- قرآن- ايمان بياوريد. و خدا بدانچه مى‌كنيد آگاه است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس به خدا و پیامبر او و آن نوری که ما فرو فرستادیم ایمان آورید و خدا به آنچه می‌کنید بسیار آگاه است."}, {"lang": "en", "name": "Ahmed Ali", "text": "So believe in God, His Apostle and the Light We have sent down. God is well aware of what you do."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Therefore accept faith in Allah and His Noble Messenger and the light which We have sent down; and Allah is Well Aware of what you do."}, {"lang": "en", "name": "A. J. Arberry", "text": "Therefore believe in God and His Messenger, and in the Light which We have sent down. And God is aware of the things you do."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Wherefore believe in Allah and His apostle and the Light which We have sent down: And Allah is of that which ye work Aware."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Therefore, believe in Allah and His Messenger (Muhammad SAW), and in the Light (this Quran) which We have sent down. And Allah is All-Aware of what you do."}, {"lang": "en", "name": "Talal Itani", "text": "So believe in God and His Messenger, and the Light which We sent down. God is Aware of everything you do."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "So believe in Allah and in His Messenger and in the Light that We have sent down. Allah is fully aware of what you do."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Therefore, believe in Allah and His Messenger and in the Light which We have sent down. And Allah is All-Aware of what you do."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "So believe in Allah and His messenger and the light which We have revealed. And Allah is Informed of what ye do."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "So have faith in Allah and His Apostle and the light, which We have sent down, and Allah is well aware of what you do."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believe in Allah, and His Messenger, and in the Light which We have sent down. Allah is Aware of all that you do."}, {"lang": "en", "name": "Saheeh International", "text": "So believe in Allah and His Messenger and the Qur'an which We have sent down. And Allah is Acquainted with what you do."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Thus, have faith in God, His Messenger and the Light which We have revealed. God is Well-Aware of what you do."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Therefore believe in Allah and His Apostle and the Light which We have revealed; and Allah is Aware of what you do."}, {"lang": "en", "name": "English Transliteration", "text": "Fa<u>a</u>minoo bi<b>A</b>ll<u>a</u>hi warasoolihi wa<b>al</b>nnoori alla<u>th</u>ee anzaln<u>a</u> wa<b>A</b>ll<u>a</u>hu bim<u>a</u> taAAmaloona khabeer<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believe then in God and His Messenger, and in the light which We have sent down. God is fully aware of all that you do."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Believe, therefore, in Allah and His Messenger, and in the Light which we have sent down. And Allah is well acquainted with all that ye do."}]}, {"index": 5208, "local_index": 9, "part_type": "Verse", "path": "/books/quran:64:9", "text": "يَوْمَ‌ يَجْمَعُکُمْ‌ لِيَوْمِ‌ الْجَمْعِ‌ ذٰلِکَ‌ يَوْمُ‌ التَّغَابُنِ‌ وَ مَنْ‌ يُؤْمِنْ‌ بِاللَّهِ‌ وَ يَعْمَلْ‌ صَالِحاً يُکَفِّرْ عَنْهُ‌ سَيِّئَاتِهِ‌ وَ يُدْخِلْهُ‌ جَنَّاتٍ‌ تَجْرِي‌ مِنْ‌ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ‌ فِيهَا أَبَداً ذٰلِکَ‌ الْفَوْزُ الْعَظِيمُ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "[بی تردید برانگیخته می شوید در] روزی که شما را در روز اجتماع [که روز قیامت است] جمع می کند، آن روز، روز غبن و خسارت است؛ و هرکس به خدا ایمان بیاورد و کار شایسته انجام دهد، خدا گناهانش را از او محو می کند، و او را به بهشت هایی که از زیرِ [درختانِ] آن نهرها جاری است، درمی آورد، در آنها جاودانه و همیشگی اند. این است کامیابی بزرگ."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "روزى كه همه شما را در محشر گرد آورد، آن روز روز مغبونى است. و هر كه به خدا ايمان بياورد و كار شايسته كند، گناهانش را مى‌ريزد و به بهشتهايى كه در آن نهرها جارى است داخل كند. آنجا جاودانه خواهند بود. اين كاميابى بزرگى است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "روزى كه شما را براى روز حشر گرد مى‌آورد، آن روز، روز حسرت و زيان است. و هر كس به خدا ايمان بياورد و كار شايسته كند، بدى‌هايش را از او بزدايد و او را به باغ‌هايى كه از پاى درختانش نهرها جارى است در آورد، كه در آن جاودانه بمانند. اين كاميابى بزرگ است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "روزى كه شما را براى روز گردآورى، گرد مى‌آورد، آن [روز]، روز حسرت [خوردن‌] است، و هر كس به خدا ايمان آورده، و كار شايسته‌اى كرده باشد، بديهايش را از او بسترد، و او را در بهشتهايى كه از زير [درختان‌] آن جويبارها روان است درآورد. در آنجا بمانند. اين است همان كاميابى بزرگ."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "(یاد آرید) روزی که خدا همه شما را به عرصه محشر (برای حساب) جمع می‌گرداند و آن روز روز غبن و پشیمانی (بدکاران) است. و هر که به خدا ایمان آرد و نیکوکار شود خدا گناهانش بپوشد و در باغهای بهشتی که زیر درختانش نهرها جاری است داخل گرداند که در آن بهشت ابداً جاودان متنعّم باشند و این به حقیقت سعادت و رستگاری بزرگ خواهد بود."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "زمانی، خداوند شما را در روز گردهمآئی (جملگی پیشینیان و پسینیان) جمع می‌آورد. آن روز، روز زیانمندی (کافران، و سودمندی مؤمنان) است. کسانی که به خدا ایمان بیاورند و کارهای شایسته بکنند. خداوند بدیهای ایشان را می‌زداید، و آنان را به باغهای بهشتی داخل می‌گرداند که از زیر (کاخها و درختان) آن رودبارها جاری است، و در آنجا برای همیشه جاودانه می‌مانند. این است رستگاری سترگ و پیروزی بزرگ. [[«یَوْمَ الْجَمْعِ»: روز گردهمآئی که قیامت است (نگا: هود / 103، واقعه / 50، یس / 32 و 53). «تَغَابُن»: زیانمند گشتن گروهی و سودمند شدن گروهی ... در جهان، دسته‌ای آخرت را به دنیا می‌فروشند، و در آخرت زیانخورده و متضرّر می‌گردند (نگا: بقره / 16 و 102، آل‌عمران / 77 و 177). و دسته‌ای دنیا را به آخرت می‌فروشند و در آخرت سود می‌برند و رضای خدا و بهشت را از آن خود می‌کنند (نگا: بقره / 207، نساء / 74، توبه / 111). فراموش کردن همدیگر. چرا که در قیامت بر اثر هول و هراس آخرت، کسی به فکر کسی نیست، و هرکسی خود را می‌کوشد (نگا: حجّ / 2، معارج / 10، عبس / 33 - 37).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "روزی که برای روز محشر گردتان آورد، آن روز تغابن است و هر کس به خداوند ایمان آورد و نیکوکاری کند، گناهانش را از او می‌زداید، و او را به بوستانهایی که جویباران از فرودست آن جاری است، درآورد، که جاودانه در آن باشند، این رستگاری بزرگ است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "این در زمانی خواهد بود که همه شما را در روز اجتماع [= روز رستاخیز] گردآوری می‌کند؛ آن روز روز تغابن است (روز احساس خسارت و پشیمانی)! و هر کس به خدا ایمان بیاورد و عمل صالح انجام دهد، گناهان او را می‌بخشد و او را در باغهایی از بهشت که نهرها از زیر درختانش جاری است وارد می‌کند، جاودانه در آن می مانند؛ و این پیروزی بزرگ است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "روزی که گردآورد شما را برای روز گردآوردن آن است روز تغابن (بی‌بهره‌گی) و آنکه ایمان آرد به خدا و بکند کرداری شایسته بزداید از او بدیهایش را و درآردش باغهائی که روان است زیر آنها جویها جاودانان در آنها همیشه این است آن رستگاری بزرگ‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "[زنده و برانگيخته مى‌شويد در] روزى كه شما را در «روز فراهم آوردن»- روز رستاخيز- فراهم آورد. آن روز، روز زيان [و حسرت و افسوس‌]- زيان كافران و سود مؤمنان- است و هر كه به خدا ايمان آرد و كار نيك و شايسته كند بديهايش را از او بزدايد و او را به بهشتهايى درآرد كه جويها از زير آنها روان است، هميشه و جاودانه در آنجا خواهند بود، اين است رستگارى و كاميابى بزرگ."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هنگامی که شما را برای روز گردآوری (آخرت) گرد می‌آورد، آن (روز)، روز زیان‌باری و فریب‌خوردگی در میان شماست و هر کس به خدا ایمان آورد و کار شایسته‌ای کند، بدی‌هایش را از او بسترد، و او را در باغ‌هایی جاودانه (که) از زیر (درختان)شان نهرها روان است داخل کند. این است کامیابی بزرگ."}, {"lang": "en", "name": "Ahmed Ali", "text": "The day He will gather you together on the Day of Gathering, will be the day of Judgement. He who believed and did the right, will have his evil deeds expunged by God and admitted to gardens with rivers flowing by, and abide there perpetually. This will be the great achievement of success."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "The day when He will gather you, on the Day of Collective Assembly – that is the day when the loss of the losers will be laid bare; and whoever believes in Allah and does good deeds, Allah will relieve him of his sins and admit him into Gardens beneath which rivers flow, for them to abide in it forever; this is the greatest success."}, {"lang": "en", "name": "A. J. Arberry", "text": "Upon the day when He shall gather you for the Day of Gathering; that shall be the Day of Mutual Fraud. And whosoever believes in God, and does righteousness, God will acquit him of his evil deeds, and admit him into gardens underneath which rivers flow, therein to dwell for ever and ever; that is the mighty triumph."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Remember the Day whereon He shall assemble you, the Day of Assembly; that shall be the Day of Mutual Loss and Gain. And whosoever believeth in Allah and worketh righteously from him He will expiate His misdeeds and will make him enter Gardens whereunder rivers flow, as abiders therein for evermore. That is the mighty achievement."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "(And remember) the Day when He will gather you (all) on the Day of Gathering, that will be the Day of mutual loss and gain (i.e. loss for the disbelievers as they will enter the Hell-fire and gain for the believers as they will enter Paradise). And whosoever believes in Allah and performs righteous good deeds, He will remit from him his sins, and will admit him to Gardens under which rivers flow (Paradise) to dwell therein forever, that will be the great success."}, {"lang": "en", "name": "Talal Itani", "text": "The Day when He gathers you for the Day of Gathering—that is the Day of Mutual Exchange. Whoever believes in God and acts with integrity, He will remit his misdeeds, and will admit him into gardens beneath which rivers flow, to dwell therein forever. That is the supreme achievement."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "(You shall come to know that) when He will assemble you on the Day of Gathering. That shall be the Day (to determine) mutual gains and losses. Whoever believes in Allah and acts righteously, Allah will have his evil deeds expunged and will admit him to Gardens beneath which rivers flow. Therein they shall abide forever. That is the supreme triumph."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "The Day when He will gather you on the Day of Gathering, that will be the Day of At-Taghabun. And whosoever believes in Allah and performs righteous deeds, He will expiate from him his sins, and will admit him to Gardens beneath which rivers flow, to dwell therein forever; that will be the great success."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "The day when He shall gather you unto the Day of Assembling, that will be a day of mutual disillusion. And whoso believeth in Allah and doeth right, He will remit from him his evil deeds and will bring him unto Gardens underneath which rivers flow, therein to abide for ever. That is the supreme triumph."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "When He will you bring you together for the Day of Gathering, it will be a day of privation [and regret]. As for those who have faith in Allah and act righteously, He shall absolve them of their misdeeds and admit them into gardens with streams running in them, to remain in them forever. That is the great success."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "The Day on which He will gather you for the Day of Gathering; that is the Day of Loss and Gain. He who believes in Allah and does good deeds, Allah willacquit him of his evil deeds and admit him to Gardens underneath which rivers flow, where he shall live for ever. That is the mighty triumph."}, {"lang": "en", "name": "Saheeh International", "text": "The Day He will assemble you for the Day of Assembly - that is the Day of Deprivation. And whoever believes in Allah and does righteousness - He will remove from him his misdeeds and admit him to gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "On the day when We shall gather you all together (for the Day of Judgment), all cheating will be exposed. Those who believe in God and act righteously will receive forgiveness for their sins. They will be admitted into Paradise wherein streams flow and they will live forever. This certainly is the greatest triumph."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "On the day that He will gather you for the day of gathering, that is the day of loss and gain; and whoever believes in Allah and does good, He will remove from him his evil and cause him to enter gardens beneath which rivers flow, to abide therein forever; that is the great achievement."}, {"lang": "en", "name": "English Transliteration", "text": "Yawma yajmaAAukum liyawmi aljamAAi <u>tha</u>lika yawmu a<b>l</b>ttagh<u>a</u>buni waman yumin bi<b>A</b>ll<u>a</u>hi wayaAAmal <u>sa</u>li<u>h</u>an yukaffir AAanhu sayyi<u>a</u>tihi wayudkhilhu jann<u>a</u>tin tajree min ta<u>h</u>tih<u>a</u> alanh<u>a</u>ru kh<u>a</u>lideena feeh<u>a</u> abadan <u>tha</u>lika alfawzu alAAa<i><u>th</u></i>eem<b>u</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "When He shall gather you all for the Day of Gathering, that will be the Day of loss and gain; and whoever believes in God and does good deeds shall be forgiven their sins and admitted to Gardens through which rivers flow, where they shall dwell forever. That is the supreme triumph."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "The Day that He assembles you (all) for a Day of Assembly,- that will be a Day of mutual loss and gain (among you), and those who believe in Allah and work righteousness,- He will remove from them their ills, and He will admit them to Gardens beneath which Rivers flow, to dwell therein for ever: that will be the Supreme Achievement."}]}, {"index": 5209, "local_index": 10, "part_type": "Verse", "path": "/books/quran:64:10", "text": "وَ الَّذِينَ‌ کَفَرُوا وَ کَذَّبُوا بِآيَاتِنَا أُولٰئِکَ‌ أَصْحَابُ‌ النَّارِ خَالِدِينَ‌ فِيهَا وَ بِئْسَ‌ الْمَصِيرُ", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و آنان که کافر شدند و آیات ما را انکار کردند، اهل آتش اند و در آن جاودانه اند، و بد بازگشت گاهی است!"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و آنان كه كفر ورزيدند و آيات ما را تكذيب كردند اهل آتشند. در آن جاودانه‌اند و جهنم بد سرانجامى است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و كسانى كه كافر شده و آيات ما را تكذيب كردند اهل آتشند كه در آن ماندگار خواند بود، و بد سر انجامى است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و كسانى كه كفر ورزيده، و آيات ما را تكذيب كرده‌اند، آنان اهل آتشند [و ] در آن ماندگار خواهند بود، و چه بد سرانجامى است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و آنان که کافر شدند و آیات ما را تکذیب کردند آنها اهل آتش دوزخ و در آن جاودان مخلّدند و آنجا بسیار بد منزلگاهی است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "و کسانی که کافر بشوند و آیات ما را تکذیب بکنند، آنان دوزخیانند جاودانه در آنجا می‌مانند، و چه سرانجام و جایگاه بدی (که دارند!). [[«الْمَصِیرُ»: (نگا: بقره / 126، انفال / 16، توبه / 73).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و کسانی که به آیات ما کفر و انکار ورزیده‌اند، اینان دوزخیانند، جاودانه در آنند و بد سرانجامی است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "اما کسانی که کافر شدند و آیات ما را تکذیب کردند اصحاب دوزخند، جاودانه در آن می‌مانند، و (سرانجام آنها) سرانجام بدی است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنان که کفر ورزیدند و تکذیب کردند آیتهای ما را آنانند یاران آتش جاودانان در آن و چه زشت است آن جایگاه‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و كسانى كه كافر شدند و آيات ما را دروغ انگاشتند، اينانند دوزخيان كه در آن جاودانه‌اند، و بد بازگشتگاهى است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و کسانی که کافر شدند و با آیاتمان (همان‌ها و ما را) تکذیب کردند، آنان -جاودانه- همراهان آتشند. و چه بد سرانجامی است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Those who did not believe and denied Our revelations will be inmates of Hell, where they will abide for ever, and how evil a journey's end!"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And those who disbelieved and denied Our signs, are the people of the fire – to remain in it forever; and what a wretched outcome!"}, {"lang": "en", "name": "A. J. Arberry", "text": "And those who disbelieved and cried lies to Our signs, those shall be the inhabitants of the Fire. therein to dwell forever -- an evil homecoming!"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And they who disbelieve and belie Our Signs! those shall be fellows of the Fire, as abiders therein; a hapless destination."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "But those who disbelieved (in the Oneness of Allah - Islamic Monotheism) and denied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they will be the dwellers of the Fire, to dwell therein forever. And worst indeed is that destination."}, {"lang": "en", "name": "Talal Itani", "text": "But as for those who disbelieve and denounce Our revelations—these are the inmates of the Fire, dwelling therein forever; and what a miserable fate!"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "As for those who disbelieved and gave the lie to Our Signs: they shall be the inmates of the Fire, and will abide in it. That is a woeful resort!"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "But those who disbelieved and denied Our Ayat, they will be the dwellers of the Fire, to dwell therein forever. And worst indeed is that destination"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "But those who disbelieve and deny Our revelations, such are owners of the Fire; they will abide therein - a hapless journey's end!"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "But as for those who are faithless and deny Our signs, they will be the inmates of the Fire, to remain in it [forever], and it is an evil destination."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "As for those who disbelieved and belied Our verses, they shall be the inhabitants of the Fire and shall live therein for ever. Evil shall be their arrival."}, {"lang": "en", "name": "Saheeh International", "text": "But the ones who disbelieved and denied Our verses - those are the companions of the Fire, abiding eternally therein; and wretched is the destination."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "As for those who have disbelieved and rejected Our revelations, they will dwell forever in hell fire, a terrible fate."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And (as for) those who disbelieve and reject Our communications, they are the inmates of the fire, to abide therein and evil is the resort."}, {"lang": "en", "name": "English Transliteration", "text": "Wa<b>a</b>lla<u>th</u>eena kafaroo waka<u>thth</u>aboo bi<u>a</u>y<u>a</u>tin<u>a</u> ol<u>a</u>ika a<u>s</u><u>ha</u>bu a<b>l</b>nn<u>a</u>ri kh<u>a</u>lideena feeh<u>a</u> wabisa alma<u>s</u>eer<b>u</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "But those who denied the truth and rejected Our signs shall be the inmates of the Fire, there to remain -- what an evil destination!"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "But those who reject Faith and treat Our Signs as falsehoods, they will be Companions of the Fire, to dwell therein for aye: and evil is that Goal."}]}, {"index": 5210, "local_index": 11, "part_type": "Verse", "path": "/books/quran:64:11", "text": "مَا أَصَابَ‌ مِنْ‌ مُصِيبَةٍ إِلاَّ بِإِذْنِ‌ اللَّهِ‌ وَ مَنْ‌ يُؤْمِنْ‌ بِاللَّهِ‌ يَهْدِ قَلْبَهُ‌ وَ اللَّهُ‌ بِکُلِ‌ شَيْ‌ءٍ عَلِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "هیچ مصیبتی جز به فرمان خدا نرسد. و هر کس به خدا ایمان بیاورد، خدا قلبش را [به حقایق] راهنمایی می کند؛ و خدا به همه چیز داناست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "هيچ مصيبتى جز به فرمان خدا به كسى نمى‌رسد. و هر كه به خدا ايمان بياورد، خدا قلبش را هدايت مى‌كند. و خدا به هر چيزى داناست."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "هيچ مصيبتى جز به اذن خدا نرسد، و هر كه به خدا ايمان آورد، قلب وى را هدايت كند، و خدا به هر چيزى داناست"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "هيچ مصيبتى جز به اذن خدا نرسد، و كسى كه به خدا بگرود، دلش را به راه آورد، و خدا[ست كه‌] به هر چيزى داناست."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "هیچ رنج و مصیبتی (به شما) نرسد مگر به فرمان خدا، و هر که به خدا ایمان آرد خدا دلش را (به مقام عالی رضا و تسلیم) هدایت کند و خدا به همه امور عالم داناست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "هیچ واقعه و حادثه‌ای جز به فرمان و اجازه‌ی خدا رخ نمی‌دهد، و هر کس که به خدا ایمان داشته باشد، خدا دل او را (به ثبات و آرامش، و خوشنودی به قضا و قدر الهی می‌رساند و) رهنمود می‌گرداند، و خداوند از هر چیزی کاملاً آگاه است. [[«مَآ أَصَابَ مِن مُّصِیبَةٍ»: (نگا: حدید / 22). «یَهْدِ قَلْبَهُ»: دل او را رهنمود و رهبری می‌کند. زمام دل او را به دست می‌گیرد. دل او را به استقامت و اطمینان و آسایش و آرامش، و رضا به قضا رهنمود می‌گرداند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "هیچ مصیبتی [به کسی‌] نرسد مگر به اذن الهی، و هر کس به خداوند ایمان آورد [او] دلش را هدایت کند، و خداوند به هر چیزی داناست‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "هیچ مصیبتی رخ نمی‌دهد مگر به اذن خدا! و هر کس به خدا ایمان آورد، خداوند قلبش را هدایت می‌کند؛ و خدا به هر چیز داناست!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "نرسد پیش‌آمدی جز به دستور خدا و آنکه ایمان آرد به خدا رهبری کند دلش را و خدا است به همه چیز دانا"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "هيچ مصيبتى جز به خواست و فرمان خدا نرسد. و هر كه به خدا ايمان آرد [خدا] دلش را راه نمايد- به خشنودى و شكيبايى-، و خدا به هر چيزى داناست."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هیچ مصیبتی جز به اذن خدا نرسد، و هر که به خدا ایمان آورد دلش را به راه آورد. و خدا به هر چیزی بسی داناست."}, {"lang": "en", "name": "Ahmed Ali", "text": "No calamity befalls unless God dispenses. He guides the heart of whosoever believes in God; and God has knowledge of everything."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "No misfortune befalls except by Allah’s command; and Allah will guide the heart of whoever accepts faith in Him; and Allah knows all things."}, {"lang": "en", "name": "A. J. Arberry", "text": "No affliction befalls, except it be by the leave of God. Whosoever believes in God, He will guide his heart. And God has knowledge of everything."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "No calamity befalleth save by Allah's leave. And whosoever believeth in Allah, his heart He guideth. And Allah is of everything Knower."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "No calamity befalls, but with the Leave [i.e. decision and Qadar (Divine Preordainments)] of Allah, and whosoever believes in Allah, He guides his heart [to the true Faith with certainty, i.e. what has befallen him was already written for him by Allah from the Qadar (Divine Preordainments)], and Allah is the All-Knower of everything."}, {"lang": "en", "name": "Talal Itani", "text": "No disaster occurs except by God’s leave. Whoever believes in God, He guides his heart. God is Aware of everything."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "No misfortune ever befalls unless it be by Allah's leave. And whosoever has faith in Allah, Allah directs his heart along the Right Path. Allah has knowledge of everything."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "No calamity occurs, but by the permission of Allah, and whosoever believes in Allah, He guides his heart. And Allah is the All-Knower of everything."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "No calamity befalleth save by Allah's leave. And whosoever believeth in Allah, He guideth his heart. And Allah is Knower of all things."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "No affliction visits [anyone] except by Allah’s leave. Whoever has faith in Allah, He guides his heart, and Allah has knowledge of all things."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "No affliction falls except by the permission of Allah. For those who believe in Allah, Allah will guide his heart. Allah has knowledge of all things."}, {"lang": "en", "name": "Saheeh International", "text": "No disaster strikes except by permission of Allah. And whoever believes in Allah - He will guide his heart. And Allah is Knowing of all things."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "No one will be afflicted with any hardship without it being the will of God. The hearts of whoever believed in God will receive guidance. God has the knowledge of all things."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "No affliction comes about but by Allah's permission; and whoever believes in Allah, He guides aright his heart; and Allah is Cognizant of all things."}, {"lang": "en", "name": "English Transliteration", "text": "M<u>a</u> a<u>sa</u>ba min mu<u>s</u>eebatin ill<u>a</u> bii<u>th</u>ni All<u>a</u>hi waman yumin bi<b>A</b>ll<u>a</u>hi yahdi qalbahu wa<b>A</b>ll<u>a</u>hu bikulli shayin AAaleem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "No affliction can befall man but by God's permission -- He guides the hearts of those who believe in Him: God has knowledge of all things --"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "No kind of calamity can occur, except by the leave of Allah: and if any one believes in Allah, (Allah) guides his heart (aright): for Allah knows all things."}]}, {"index": 5211, "local_index": 12, "part_type": "Verse", "path": "/books/quran:64:12", "text": "وَ أَطِيعُوا اللَّهَ‌ وَ أَطِيعُوا الرَّسُولَ‌ فَإِنْ‌ تَوَلَّيْتُمْ‌ فَإِنَّمَا عَلَى‌ رَسُولِنَا الْبَلاَغُ‌ الْمُبِينُ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و از خدا اطاعت کنید و از پیامبر فرمان برید، و اگر روی برگردانید [بدانید که] بر عهده پیامبر فقط رساندن آشکار [پیام وحی] است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خدا را اطاعت كنيد، و پيامبر را اطاعت كنيد. پس اگر شما اعراض كنيد، بر فرستاده ما وظيفه‌اى جز رسانيدن پيام آشكار نيست."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و خدا را فرمان بريد و پيامبر را فرمان بريد، پس اگر روى بگردانيد، بر پيامبر ما فقط ابلاغ آشكار [پيام‌] است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و خدا را فرمان بريد و پيامبر [او] را اطاعت نماييد، و اگر روى بگردانيد، بر پيامبر ما فقط پيام‌رسانى آشكار است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و فرمان خدا و هم اوامر رسول حق را اطاعت کنید که اگر روی بگردانید بر رسول ما جز تبلیغ رسالت (و اتمام حجت) با بیان روشن تکلیفی نخواهد بود."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "از خدا و پیغمبر اطاعت کنید. اگر رویگردان شوید، بر فرستاده‌ی ما جز رساندن پیام روشن و آشکار نیست. [[«الْبَلاغُ الْمُبِینُ»: تبلیغ آشکار، رساندن پیام روشنگر (نگا: مائده / 92، نحل / 35 و 82، نور / 54).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و از خداوند اطاعت کنید، و از پیامبر [هم‌] اطاعت کنید، و اگر روی برتابید [بدانید که‌] بر پیامبر ما فقط پیام رسانی آشکار است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "اطاعت کنید خدا را، و اطاعت کنید پیامبر را؛ و اگر روی‌گردان شوید، رسول ما جز ابلاغ آشکار وظیفه‌ای ندارد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و فرمان برید خدا و فرمان برید پیمبر را پس اگر روی برتابید نباشد بر فرستاده ما جز رسانیدن آشکار"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و خداى را فرمان بريد و پيامبر را فرمان بريد پس اگر روى بگردانيد [بدانيد كه‌] بر پيامبر ما رساندن آشكار پيام است و بس."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و خدا را فرمان برید و پیامبر (او) را پیروی کنید. پس اگر روی بگردانید، بر (عهده‌ی) پیامبرمان، فقط پیام‌رسانیِ روشنگر است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Obey God and obey His Apostle. If you turn away, the duty of the Apostle is to convey the message clearly."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And obey Allah and obey His Noble Messenger; then if you turn away, know that the duty upon Our Noble Messenger is only to plainly convey."}, {"lang": "en", "name": "A. J. Arberry", "text": "And obey God, and obey the Messenger; but if you turn your backs, it is only for the Messenger to deliver the Manifest Message."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Obey Allah and obey the apostlle; then if ye turn away, on Our apostle is only the preaching manifest."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Obey Allah, and obey the Messenger (Muhammad SAW), but if you turn away, then the duty of Our Messenger is only to convey (the Message) clearly."}, {"lang": "en", "name": "Talal Itani", "text": "So obey God, and obey the Messenger. But if you turn away—it is only incumbent on Our Messenger to deliver the clear message."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Obey Allah and obey the Messenger. But if you turn away from obedience, (then know that) Our Messenger has no other duty than to clearly convey the Truth."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Obey Allah, and obey the Messenger; but if you turn away, then the duty of Our Messenger is only to convey clearly."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Obey Allah and obey His messenger; but if ye turn away, then the duty of Our messenger is only to convey (the message) plainly."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Obey Allah and obey the Apostle; but if you turn away, then Our Apostle’s duty is only to communicate in clear terms."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Obey Allah and obey the Messenger. But, if you turn away, Our Messenger's duty is only to deliver the Clear Message."}, {"lang": "en", "name": "Saheeh International", "text": "And obey Allah and obey the Messenger; but if you turn away - then upon Our Messenger is only [the duty of] clear notification."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Obey God and the Messenger, but if you turn away, know that the only duty of Our Messenger is to clearly preach."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And obey Allah and obey the Apostle, but if you turn back, then upon Our Apostle devolves only the clear delivery (of the message)."}, {"lang": "en", "name": "English Transliteration", "text": "Waa<u>t</u>eeAAoo All<u>a</u>ha waa<u>t</u>eeAAoo a<b>l</b>rrasoola fain tawallaytum fainnam<u>a</u> AAal<u>a</u> rasoolin<u>a</u> albal<u>a</u>ghu almubeen<b>u</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "obey God and obey the Messenger; but if you turn away, remember that Our Messenger is only responsible for clearly conveying the message."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "So obey Allah, and obey His Messenger: but if ye turn back, the duty of Our Messenger is but to proclaim (the Message) clearly and openly."}]}, {"index": 5212, "local_index": 13, "part_type": "Verse", "path": "/books/quran:64:13", "text": "اللَّهُ‌ لاَ إِلٰهَ‌ إِلاَّ هُوَ وَ عَلَى‌ اللَّهِ‌ فَلْيَتَوَکَّلِ‌ الْمُؤْمِنُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "خداست که هیچ معبودی جز او نیست، پس مؤمنان فقط باید بر او توکّل کنند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "خداى يكتاست كه هيچ خدايى جز او نيست. مؤمنان البته بر خداى يكتا توكل كنند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "خداوند [يكتا] معبودى جز او نيست، پس مؤمنان بايد تنها بر خدا توكل كنند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "خدا[ست كه‌] جز او معبودى نيست، و مؤمنان بايد تنها بر خدا اعتماد كنند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "خدای یکتاست که جز او خدایی نیست و تنها بر خدا اهل ایمان توکل باید کنند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "جز خدا معبودی نیست، پس مؤمنان باید بر خدا توکّل کنند و بس. [[«فَلْیَتَوَکَّلِ»: باید توکّل کنند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "خداوند است که خدایی جز او نیست، و مؤمنان فقط بر خداوند باید توکل کنند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "خداوند کسی است که هیچ معبودی جز او نیست، و مؤمنان باید فقط بر او توکل کنند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "خداوند نیست خدائی جز او و بر خدا باید توکّل کنند مؤمنان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "خداى يكتا جز او خدايى نيست، پس مؤمنان بايد بر او توكّل كنند و بس."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "خدا(ست که) جز او معبودی نیست. پس مؤمنان باید تنها بر خدا توکل کنند."}, {"lang": "en", "name": "Ahmed Ali", "text": "God: There is no god but He; and in God should believers place their trust."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Allah – there is none worthy of worship except Him; and only upon Allah must the Muslims rely."}, {"lang": "en", "name": "A. J. Arberry", "text": "God -- there is no god but He. And in God let the believers put their trust."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Allah! there is no God but He! In Allah, therefore, let the believers put their trust."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Allah! La ilaha illa Huwa (none has the right to be worshipped but He), and in Allah (Alone), therefore, let the believers put their trust."}, {"lang": "en", "name": "Talal Itani", "text": "God, there is no god but He; and in God let the believers put their trust."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Allah there is no god but He; in Allah should the believers put all their trust."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Allah! La ilaha illa Huwa. And in Allah therefore let the believers put their trust."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Allah! There is no Allah save Him. In Allah, therefore, let believers put their trust."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Allah—there is no god except Him—in Allah let all the faithful put their trust."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Allah, there is no god except He. In Allah let the believers put their trust."}, {"lang": "en", "name": "Saheeh International", "text": "Allah - there is no deity except Him. And upon Allah let the believers rely."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "God is the only Lord and in Him the believers should trust."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Allah, there is no god but He; and upon Allah, then, let the believers rely."}, {"lang": "en", "name": "English Transliteration", "text": "All<u>a</u>hu l<u>a</u> il<u>a</u>ha ill<u>a</u> huwa waAAal<u>a</u> All<u>a</u>hi falyatawakkali almuminoon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "God! There is no god but He, so let the faithful put their trust in Him."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Allah! There is no god but He: and on Allah, therefore, let the Believers put their trust."}]}, {"index": 5213, "local_index": 14, "part_type": "Verse", "path": "/books/quran:64:14", "text": "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا إِنَ‌ مِنْ‌ أَزْوَاجِکُمْ‌ وَ أَوْلاَدِکُمْ‌ عَدُوّاً لَکُمْ‌ فَاحْذَرُوهُمْ‌ وَ إِنْ‌ تَعْفُوا وَ تَصْفَحُوا وَ تَغْفِرُوا فَإِنَ‌ اللَّهَ‌ غَفُورٌ رَحِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ای اهل ایمان! به راستی برخی از همسران و فرزندانتان [به علت بازداشتن شما از اجرای فرمان های خدا و پیامبر] دشمن شمایند؛ بنابراین از [عمل به خواسته های بی جای] آنان [که مخالف احکام خداست] بپرهیزید، و اگر [از آزار و رنجی که به شما می دهند] چشم پوشی کنید و سرزنش کردن آنان را ترک نمایید و از آنان بگذرید [خدا هم شما را مورد الطاف بی کرانش قرار می دهد]؛ زیرا خدا بسیار آمرزنده و مهربان است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اى كسانى كه ايمان آورده‌ايد، بعضى از زنان و فرزندانتان دشمن شما هستند. از آنها حذر كنيد. و اگر عفو كنيد و چشم بپوشيد و گناهشان پوشيده داريد، خدا آمرزنده و مهربان است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اى كسانى كه ايمان آورده‌ايد! بى‌ترديد برخى از همسران شما و فرزندانتان [به خاطر ايمانتان‌] دشمن شمايند، از آنها برحذر باشيد. و اگر [از خلاف آنها] در گذريد و چشم بپوشيد و ببخشاييد، بى‌گمان خدا آمرزنده‌ى مهربان است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اى كسانى كه ايمان آورده‌ايد، در حقيقت برخى از همسران شما و فرزندان شما دشمن شمايند، از آنان بر حذر باشيد، و اگر ببخشاييد و درگذريد و بيامرزيد، به راستى خدا آمرزنده مهربان است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "الا ای اهل ایمان، زنان و فرزندان شما هم برخی (که شما را از طاعت و جهاد و هجرت در دین باز دارند) دشمن شما هستند، از آنان حذر کنید، و اگر (از عقاب آنها پس از توبه آنان) عفو و آمرزش و چشم‌پوشی کنید خدا هم (در حق همه شما) بسیار آمرزنده و مهربان است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ای مؤمنان! قطعاً بعضی از همسران و فرزندانتان دشمنان شما هستند. (شما را از راه خدا باز می‌دارند، و از عبادت و طاعت سست می‌گردانند) پس از ایشان خویشتن را بر حذر دارید. اگر عفو کنید و چشم پوشی نمائید و ببخشید (خدا هم شما را مشمول عفو و مرحمت و مغفرت خود می‌نماید) چرا که خداوند بخشاینده‌ی مهربان است. [[«مِنْ»: برای تبعیض است. «عَدُوّاً»: این واژه برای مفرد و مثنّی و جمع به کار می‌رود. اسم (إِنَّ) است. «إن تَعْفُوا وَ تَصْفَحُوا و تَغْفِرُوا»: (نگا: بقره / 109). این بخش از آیه، اشاره دارد به این که چه بسا همسران یا فرزندان که انسان را از مبرّات و خیرات منع و یا سست می‌کنند قصد سوء نداشته و بلکه از روی نادانی باشد، به هر حال باید کار بد ایشان را بخشید و نیّت سوء و قصد عداوت آنان را پخش نکرد، ولی به سخنانشان گوش نکرد و مواظب خود بود و محبّت ایشان انسان را از خدا پرستی و انجام خیرات و مبرات دور نسازد.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "ای مؤمنان بی‌گمان از میان همسران و فرزندانتان بعضی دشمن شما هستند، از آنان بر حذر باشید، و اگر گذشت و بخشایش پیشه کنید و درگذرید، خداوند هم آمرزگار مهربان است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "ای کسانی که ایمان آورده‌اید! بعضی از همسران و فرزندانتان دشمنان شما هستند، از آنها برحذر باشید؛ و اگر عفو کنید و چشم بپوشید و ببخشید، (خدا شما را می‌بخشد)؛ چرا که خداوند بخشنده و مهربان است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "ای آنان که ایمان آوردید هر آینه از زنان شما و فرزندان شما دشمنی است شما را پس بترسیدشان و اگر درگذرید و چشم‌پوشی کنید و بیامرزید همانا خدا است آمرزنده مهربان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اى كسانى كه ايمان آورده‌ايد، همانا برخى از همسران و فرزندانتان دشمن شمايند، پس از آنها حذر كنيد و اگر درگذريد و چشم بپوشيد و ببخشاييد، همانا خدا آمرزگار و مهربان است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "هان ای کسانی که ایمان آوردید! بی‌گمان برخی از همسرانتان و فرزندانتان دشمنان شمایند. پس از آنان بر حذر باشید و اگر ببخشایید و (از آنان) روی بگردانید و پوشش نهید (بهتر است). به‌راستی خدا بسی پوشنده‌ی رحمتگر بر ویژگان است."}, {"lang": "en", "name": "Ahmed Ali", "text": "O believers, some of your spouses and children are your enemies, so beware of them! Yet if you forbear, overlook, and forgive, God is indeed forgiving and kind."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "O People who Believe! Some of your wives and children are your enemies, therefore be wary of them; and if you pardon and overlook and forgive, then indeed Allah is Oft Forgiving, Most Merciful."}, {"lang": "en", "name": "A. J. Arberry", "text": "O believers, among your wives and children there is an enemy to you; so beware of them. But if you pardon, and overlook, and if you forgive, surely God is All-forgiving, All-compassionate."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "O ye who believe! verily of your wives and your children there is an enemy Unto you; wherefore beware of them. And if ye pardon and pass over and forgive, then verily Allah is Forgiving, Merciful."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "O you who believe! Verily, among your wives and your children there are enemies for you (i.e. may stop you from the obedience of Allah), therefore beware of them! But if you pardon (them) and overlook, and forgive (their faults), then verily, Allah is Oft-Forgiving, Most Merciful."}, {"lang": "en", "name": "Talal Itani", "text": "O you who believe! Among your wives and your children are enemies to you, so beware of them. But if you pardon, and overlook, and forgive—God is Forgiver and Merciful."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Believers, there are enemies to you from among your spouses and your off-spring, so beware of them. But if you forgive and overlook their offences and pardon them, then surely Allah is Most Forgiving, Most Compassionate."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "O you who believe! Verily, among your wives and your children there are enemies for you; therefore beware of them! But if you pardon (them) and overlook, and forgive, then verily, Allah is Oft-Forgiving, Most Merciful."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "O ye who believe! Lo! among your wives and your children there are enemies for you, therefor beware of them. And if ye efface and overlook and forgive, then lo! Allah is Forgiving, Merciful."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "O you who have faith! Indeed, you have enemies among your spouses and children; so beware of them. Yet if you excuse, forbear, and forgive, then Allah is indeed all-forgiving, all-merciful."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Believers, some of your wives and children are enemies; so beware of them. But if you pardon, overlook and forgive them, then Allah is the Forgiving, the Most Merciful."}, {"lang": "en", "name": "Saheeh International", "text": "O you who have believed, indeed, among your wives and your children are enemies to you, so beware of them. But if you pardon and overlook and forgive - then indeed, Allah is Forgiving and Merciful."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Believers, some of your wives and children may prove to be your enemies so beware of them. However, if you would pardon, ignore and forgive, know that God is All-forgiving and All-merciful."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "O you who believe! surely from among your wives and your children there is an enemy to you; therefore beware of them; and if you pardon and forbear and forgive, then surely Allah is Forgiving, Merciful."}, {"lang": "en", "name": "English Transliteration", "text": "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo inna min azw<u>a</u>jikum waawl<u>a</u>dikum AAaduwwan lakum fa<b>i</b><u>hth</u>aroohum wain taAAfoo wata<u>s</u>fa<u>h</u>oo wataghfiroo fainna All<u>a</u>ha ghafoorun ra<u>h</u>eem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Believers! [Even] among your wives and your children you have enemies: so beware of them. But if you overlook their offences and forgive and pardon them, then surely, God is most forgiving and merciful."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "O ye who believe! Truly, among your wives and your children are (some that are) enemies to yourselves: so beware of them! But if ye forgive and overlook, and cover up (their faults), verily Allah is Oft-Forgiving, Most Merciful."}]}, {"index": 5214, "local_index": 15, "part_type": "Verse", "path": "/books/quran:64:15", "text": "إِنَّمَا أَمْوَالُکُمْ‌ وَ أَوْلاَدُکُمْ‌ فِتْنَةٌ وَ اللَّهُ‌ عِنْدَهُ‌ أَجْرٌ عَظِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "اموال و فرزندانتان فقط وسیله آزمایش اند، و خداست که پاداشی بزرگ نزد اوست."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "جز اين نيست كه اموال و اولاد شما آزمايشى هستند. و حال آنكه مزد فراوان نزد خداست."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اموال شما و فرزندانتان صرفا [وسيله‌] آزمايشند، و پاداش بزرگ نزد خداوند است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اموال شما و فرزندانتان صرفاً [وسيله‌] آزمايشى [براى شما]يند، و خداست كه نزد او پاداشى بزرگ است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "به حقیقت، اموال و فرزندان شما اسباب فتنه و امتحان شما هستند (چندان به آنها دل نبندید) و (بدانید که) نزد خدا اجر عظیم (بهشت ابد) خواهد بود."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "قطعاً اموالتان و اولادتان، وسیله‌ی آزمایش شمایند، و (اگر در این میدان آزمایش، از عهده بر آئید، برای شما) اجر و پاداش بزرگی در پیشگاه خدا است. [[«فِتْنَةٌ»: امتحان. آزمایش (نگا: انفال / 28). مراد این است که اموال و اولاد زینت و نعمت جهان و مایه دستیابی به سعادت هستند، در صورتی که در مسیر خداشناسی انسان را کمک کنند. امّا اگر محبّت آنان بر فرمان و رضای یزدان ترجیح داده شود، مایه بدبختی می‌گردند (نگا: آل‌عمران / 14 و 15، توبه / 22 و 23 و 75).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "همانا اموال و اولاد شما مایه آزمون [و دردسر]اند، و پاداش بیکران فقط نزد خداوند است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "اموال و فرزندانتان فقط وسیله آزمایش شما هستند؛ و خداست که پاداش عظیم نزد اوست!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "جز این نیست که خواسته‌های شما و فرزندان شما آزمایشی است و خدا نزد او است پاداشی بزرگ‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "جز اين نيست كه مالها و فرزندانتان [براى شما] آزمون‌اند، و مزد بزرگ نزد خداوند است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "اموالتان و فرزندانتان تنها وسیله‌ی آزمایشی آتشینند، و خداست که نزد او پاداشی بزرگ است."}, {"lang": "en", "name": "Ahmed Ali", "text": "Your wealth and children are surely meant as trial for you: But with God is the great reward."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Your wealth and your children are just a test; and with Allah is a tremendous reward."}, {"lang": "en", "name": "A. J. Arberry", "text": "Your wealth and your children are only a trial; and with God is a mighty wage."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Your riches and your children are but a temptation; and Allah! with Him is a mighty hire."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Your wealth and your children are only a trial, whereas Allah! With Him is a great reward (Paradise)."}, {"lang": "en", "name": "Talal Itani", "text": "Your possessions and your children are a test, but with God is a splendid reward."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Your possessions and your offspring are nothing but a trial for you. And there awaits a great reward for you with Allah."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Your wealth and your children are only a Fitnah, whereas Allah! With Him is a great reward."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Your wealth and your children are only a temptation, whereas Allah! with Him is an immense reward."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Rather, your possessions, and children are a test, and Allah—with Him is a great reward!"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Your wealth and children are but a trial, and with Allah is a mighty wage."}, {"lang": "en", "name": "Saheeh International", "text": "Your wealth and your children are but a trial, and Allah has with Him a great reward."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Your property and children are a trial for you, but the reward (which one may receive from God) is great."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Your possessions and your children are only a trial, and Allah it is with Whom is a great reward."}, {"lang": "en", "name": "English Transliteration", "text": "Innam<u>a</u> amw<u>a</u>lukum waawl<u>a</u>dukum fitnatun wa<b>A</b>ll<u>a</u>hu AAindahu ajrun AAa<i><u>th</u></i>eem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Your wealth and your children are only a trial; God's reward is great:"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Your riches and your children may be but a trial: but in the Presence of Allah, is the highest, Reward."}]}, {"index": 5215, "local_index": 16, "part_type": "Verse", "path": "/books/quran:64:16", "text": "فَاتَّقُوا اللَّهَ‌ مَا اسْتَطَعْتُمْ‌ وَ اسْمَعُوا وَ أَطِيعُوا وَ أَنْفِقُوا خَيْراً لِأَنْفُسِکُمْ‌ وَ مَنْ‌ يُوقَ‌ شُحَ‌ نَفْسِهِ‌ فَأُولٰئِکَ‌ هُمُ‌ الْمُفْلِحُونَ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بنابراین به اندازه استطاعتی که دارید از خدا پروا کنید و [دعوت حق را] بشنوید و اطاعت نمایید و انفاق کنید که برای شما بهتر است؛ و کسانی که خود را از بخل و حرص بازدارند آنان رستگارند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "تا توانيد از خدا بترسيد و گوش فرا داريد و اطاعت كنيد و به سود خود از مالتان انفاق كنيد. و آنان كه از حرص نفس خويش در امان مانده‌اند رستگارند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "پس تا مى‌توانيد از خدا پروا كنيد و بشنويد و اطاعت كنيد، و انفاق نماييد كه براى خودتان بهتر است. و هر كه از حرص و آز نفس خويش نگاه داشته شود، چنين كسانى رستگار خواهند بود"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "پس تا مى‌توانيد از خدا پروا بداريد و بشنويد و فرمان ببريد، و مالى براى خودتان [در راه خدا] انفاق كنيد، و كسانى كه از خسّت نفس خويش مصون مانند، آنان رستگارانند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "پس تا بتوانید خدا ترس و پرهیزکار باشید و (سخن حق) بشنوید و اطاعت کنید و از مال خود برای (ذخیره آخرت) خویش (به فقیران) انفاق کنید. و کسانی که از خوی لئامت و بخل نفس خود محفوظ مانند آنها به حقیقت رستگاران عالمند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "پس آن قدر که در توان دارید از خدا بهراسید و پرهیزگاری کنید، و (درسها و اندرزهای آسمانی را) بشنوید و بپذیرید، و (از قوانین و فرمانهای خدا) اطاعت کنید. و (در راه خدا، صدقه و احسان و) بذل و بخشش کنید، (انجام این کارها) به سود شما خواهد بود. کسانی که از بخل و حرص نفس خویش، مصون داشته شوند، آنان قطعاً رستگارند. [[«مَا اسْتَطَعْتُمْ»: مادام که می‌توانید. تا آنجا که در توان دارید (نگا: بقره / 286، حجّ / 78). «خَیْراً»: مال و دارائی (نگا: بقره / 180). در این صورت مفعول (أَنفِقُوا) است، و معنی چنین است: از اموال و دارائی خود ببخشید. خوب و نیک. در این صورت خبر فعل ناقصه مقدّری است که تقدیر چنین است: یَکُنْ ذلِکَ خَیْراً ... «مَن یُوقَ شُحَّ نَفْسِهِ»: (نگا: حشر / 9).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "تا آنجا که بتوانید از خداوند پروا کنید و [حق را] بشنوید و اطاعت پیشه کنید و به انفاق بپردازید که به خیر خودتان است، و کسانی که از آزمندی نفس خویش در امان مانند رستگارند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "پس تا می‌توانید تقوای الهی پیشه کنید و گوش دهید و اطاعت نمایید و انفاق کنید که برای شما بهتر است؛ و کسانی که از بخل و حرص خویشتن مصون بمانند رستگارانند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "پس بترسید خدا را هر آنچه بتوانید و بشنوید و فرمانبرداری کنید و بخشایش کنید بهتر است برای شما و آنکو نگهداشته شود بخل‌ورزی خویش را همانا آنانند رستگاران‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "پس هر چه توانيد از خدا پروا كنيد و بشنويد و فرمان بريد و انفاق كنيد كه براى خودتان بهتر است، و هر كه از بخل و آز خويش نگاه داشته شود پس ايشانند رستگاران."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "پس تا می‌توانید از خدا پروا بدارید و بشنوید و فرمان ببرید و آنچه را برایتان خیر است (در راه خدا) انفاق کنید و کسی که خسّت نفسش نگهبانی شود، همانان رستگارکنندگانند."}, {"lang": "en", "name": "Ahmed Ali", "text": "So fear God as much as you can, and listen and obey, and spend in charity for your own good. He who is saved from his own avarice will be successful."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Therefore fear Allah as much as possible, and heed the commands, and obey, and spend in Allah’s cause, for your own good; and whoever is rescued from the greed of his own soul – is they who will be successful."}, {"lang": "en", "name": "A. J. Arberry", "text": "So fear God as far as you are able, and give ear, and obey, and expend well for yourselves. And whosoever is guarded against the avarice of his own soul, those -- they are the prosperers."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Wherefore fear Allah as much as ye are able, and hearken and obey, and expend, for the benefit of your souls. And whosoever is protected from niggardliness of his soul - those! they are the blissful."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "So keep your duty to Allah and fear Him as much as you can; listen and obey; and spend in charity, that is better for yourselves. And whosoever is saved from his own covetousness, then they are the successful ones."}, {"lang": "en", "name": "Talal Itani", "text": "So be conscious of God as much as you can, and listen, and obey, and give for your own good. He who is protected from his stinginess—these are the prosperous."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "So hold Allah in awe as much as you can, and listen and obey, and be charitable. This is for your own good. And whoever remains safe from his own greediness, it is such that will prosper."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "So have Taqwa of Allah as much as you can; listen and obey, and spend in charity; that is better for yourselves. And whosoever is saved from his own greed, then they are the successful ones."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "So keep your duty to Allah as best ye can, and listen, and obey, and spend; that is better for your souls. And whoso is saved from his own greed, such are the successful."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "So be wary of Allah, as much as you can, and listen and obey, and spend [in the way of Allah]; that is better for yourselves. Those who are saved from their own greed—it is they who are the felicitous."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Therefore fear Allah as much as you can, and listen, obey, and spend well for yourselves. And whosoever is saved from the greed of his own soul; those are the winners."}, {"lang": "en", "name": "Saheeh International", "text": "So fear Allah as much as you are able and listen and obey and spend [in the way of Allah]; it is better for your selves. And whoever is protected from the stinginess of his soul - it is those who will be the successful."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Have as much fear of God as best as you can. Listen to the Messenger, obey him, and spend for your own sake good things for the cause of God. Those who control their greed will have everlasting happiness."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Therefore be careful of (your duty to) Allah as much as you can, and hear and obey and spend, it is better for your souls; and whoever is saved from the greediness of his soul, these it is that are the successful."}, {"lang": "en", "name": "English Transliteration", "text": "Fa<b>i</b>ttaqoo All<u>a</u>ha m<u>a</u> ista<u>t</u>aAAtum wa<b>i</b>smaAAoo waa<u>t</u>eeAAoo waanfiqoo khayran lianfusikum waman yooqa shu<u>hh</u>a nafsihi faol<u>a</u>ika humu almufli<u>h</u>oon<b>a</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "so be mindful of God as best as you can; and listen, and obey; and spend in charity: it is for your own good. Those who guard themselves against their own greed will surely prosper:"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "So fear Allah as much as ye can; listen and obey and spend in charity for the benefit of your own soul and those saved from the covetousness of their own souls,- they are the ones that achieve prosperity."}]}, {"index": 5216, "local_index": 17, "part_type": "Verse", "path": "/books/quran:64:17", "text": "إِنْ‌ تُقْرِضُوا اللَّهَ‌ قَرْضاً حَسَناً يُضَاعِفْهُ‌ لَکُمْ‌ وَ يَغْفِرْ لَکُمْ‌ وَ اللَّهُ‌ شَکُورٌ حَلِيمٌ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "اگر به خدا وام نیکو دهید، آن را برای شما دو چندان می کند و شما را می آمرزد و خدا عطا کننده پاداش فراوان در برابر عمل اندک می باشد و بردبار است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اگر به خدا قرض‌الحسنه دهيد برايتان دو برابرش خواهد كرد. و شما را مى‌آمرزد كه او شكرپذيرنده و بردبار است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "اگر خدا را قرض الحسنه دهيد، آن را براى شما دو چندان مى‌گرداند و بر شما مى‌بخشايد، و خداوند بسيار قدرشناس و بردبار است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "اگر خدا را وامى نيكو دهيد، آن را براى شما دو چندان مى‌گرداند و بر شما مى‌بخشايد، و خدا[ست كه‌] سپاس‌پذير بردبار است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "اگر به خدا (یعنی بندگان محتاج خدا) قرض نیکو دهید خدا برای شما چندین برابر گرداند و هم از گناه شما در گذرد و خدا بر شکر و احسان خلق نیکو پاداش دهنده است و (بر گناهشان) بسیار بردبار است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "اگر به خدا قرض‌الحسنه‌ای بدهید، آن را برایتان چندین برابر می‌سازد، و شما را می‌آمرزد. خداوند سپاسگزار و بردبار است (و او از بندگانش به وسیله‌ی دادن پاداشهای عظیم تشکّر می‌نماید، و در پرتو بردباری خود، در عقوبت بندگان تعجیل نمی‌فرماید، و بلکه گناهانشان را می‌بخشاید). [[«إِن تُقْرِضُوا اللهَ قَرْضاً حَسَناً»: (نگا: بقره / 245، مائده / 12، حدید / 11 و 18).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "اگر در راه خداوند قرض‌الحسنه دهید، برای شما [اجرش را] دو چندان کند و شما را بیامرزد، و خداوند قدردان بردبار است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "اگر به خدا قرض‌الحسنه دهید، آن را برای شما مضاعف می‌سازد و شما را می‌بخشد؛ و خداوند شکرکننده و بردبار است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "اگر وام دهید خدا را وامی نکو بیفزایدش برای شما و بیامرزد شما را و خدا است سپاسگزار بردبار"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "اگر خداى را وام دهيد وامى نيكو- در راه خدا هزينه كنيد- آن را براى شما افزون- يا دو چندان- كند و شما را بيامرزد، و خدا سپاسدار و بردبار است"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "اگر خدا را وامی نیکو دهید، آن را برایتان افزون می‌گرداند و برای شما می‌پوشاند. و خدا بسی شکرگزار بسیار بردبار است."}, {"lang": "en", "name": "Ahmed Ali", "text": "If you lend a goodly loan to God, He will double it for you, and forgive you. God knows the worth of good deeds and is clement,"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "If you lend an excellent loan to Allah, He will double it for you and forgive you; and Allah is Most Appreciative, Most Forbearing."}, {"lang": "en", "name": "A. J. Arberry", "text": "If you lend to God a good loan, He will multiply it for you, and will forgive you. God is All-thankful, All-clement,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "If ye lend Unto Allah a goodly loan, He will multiply it Unto you and will forgive you; and Allah is Appreciator, Forbearing."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "If you lend to Allah a goodly loan (i.e. spend in Allah's Cause) He will double it for you, and will forgive you. And Allah is Most Ready to appreciate and to reward, Most Forbearing,"}, {"lang": "en", "name": "Talal Itani", "text": "If you lend God a good loan, He will multiply it for you, and will forgive you. God is Appreciative and Forbearing."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "If you give Allah a goodly loan, He will increase it for you several fold and will forgive you. Allah is Most Appreciative, Most Forbearing."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "If you lend to Allah a handsome loan, He will double it for you, and will forgive you. And Allah is Shakur, Halim,"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "If ye lend unto Allah a goodly loan, He will double it for you and will forgive you, for Allah is Responsive, Clement,"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "If you lend Allah a good loan, He shall multiply it for you and forgive you, and Allah is all-appreciative, all-forbearing,"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "If you lend a good loan to Allah He will multiply it for you and will forgive you. Allah is the Thankful, the Clement."}, {"lang": "en", "name": "Saheeh International", "text": "If you loan Allah a goodly loan, He will multiply it for you and forgive you. And Allah is Most Appreciative and Forbearing."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "If you give a virtuous loan to God, He will pay back double and forgive your sins. God is the Most Appreciating and the Most Forbearing."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "If you set apart for Allah a goodly portion, He will double it for you and forgive you; and Allah is the Multiplier (of rewards), Forbearing,"}, {"lang": "en", "name": "English Transliteration", "text": "In tuqri<u>d</u>oo All<u>a</u>ha qar<u>d</u>an <u>h</u>asanan yu<u>da</u>AAifhu lakum wayaghfir lakum wa<b>A</b>ll<u>a</u>hu shakoorun <u>h</u>aleem<b>un</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "if you give a good loan to God, He will multiply it for you and forgive you, for God is appreciative and forbearing;"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "If ye loan to Allah, a beautiful loan, He will double it to your (credit), and He will grant you Forgiveness: for Allah is most Ready to appreciate (service), Most Forbearing,-"}]}, {"index": 5217, "local_index": 18, "part_type": "Verse", "path": "/books/quran:64:18", "text": "عَالِمُ‌ الْغَيْبِ‌ وَ الشَّهَادَةِ الْعَزِيزُ الْحَکِيمُ‌", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "دانای نهان و آشکار و توانای شکست ناپذیر و حکیم است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "داناى نهان و آشكار است، پيروزمند و حكيم است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "داناى نهان و آشكار و مقتدر حكيم است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "داناى نهان و آشكار [و] ارجمند سنجيده‌كار است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "او دانای عوالم غیب و شهود و سلطان مقتدر ملک وجود و آگاه از صلاح نظام آفرینش است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "او آگاه از نهان و آشکار، و چیره‌ی کار بجا است. [[«عَالِمُ الْغَیْبِ و الشَّهَادَةِ»: (نگا: انعام / 73، توبه / 94 و 105، رعد / 9).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "دانای پنهان و پیدا [و] پیروزمند فرزانه است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "او دانای پنهان و آشکار است؛ و او عزیز و حکیم است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "دانای نهان و هویدا عزّتمند حکیم‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "داننده نهان و آشكارا، تواناى بى‌همتا و داناى با حكمت است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "دانای نهان و آشکار و عزیز حکیم است."}, {"lang": "en", "name": "Ahmed Ali", "text": "The knower of the unknown and the known, all-mighty and all-wise."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "The All Knowing of all things hidden and visible, the Most Honourable, the Wise."}, {"lang": "en", "name": "A. J. Arberry", "text": "Knower He of the Unseen and the Visible, the All-mighty, the All-wise."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Knower of the unseen and the seen, the Mighty, the Wise."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "All-Knower of the unseen and seen, the All-Mighty, the All-Wise."}, {"lang": "en", "name": "Talal Itani", "text": "The Knower of the Unseen and the Seen, the Almighty, the Wise."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "He knows that which is beyond the ken of perception as well as that which can be perceived. He is the Most Mighty, the Most Wise."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "All-Knower of the unseen and seen, the Almighty, the All-Wise."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Knower of the Invisible and the Visible, the Mighty, the Wise."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Knower of the sensible and the Unseen, the All-mighty, the All-wise."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "He is the Knower of the Unseen and the Visible, the Almighty, the Wise."}, {"lang": "en", "name": "Saheeh International", "text": "Knower of the unseen and the witnessed, the Exalted in Might, the Wise."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "He knows the unseen and the seen. He is the Majestic and All-wise."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "The Knower of the unseen and the seen, the Mighty, the Wise."}, {"lang": "en", "name": "English Transliteration", "text": "AA<u>a</u>limu alghaybi wa<b>al</b>shshah<u>a</u>dati alAAazeezu al<u>h</u>akeem<b>u</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "God is the Knower of the unseen and the seen: He is the Almighty, the Wise One."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Knower of what is open, Exalted in Might, Full of Wisdom."}]}]}, "index": "quran:64", "kind": "verse_list"}