{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 65"
        },
        "path": "/books/quran:65",
        "titles": {
          "ar": "الطلاق",
          "en": "Divorce",
          "ent": "At-Talaaq"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 65,
    "local_index": 65,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 66"
        },
        "path": "/books/quran:66",
        "titles": {
          "ar": "التحريم",
          "en": "The Prohibition",
          "ent": "At-Tahrim"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 64"
        },
        "path": "/books/quran:64",
        "titles": {
          "ar": "التغابن",
          "en": "Mutual Disillusion",
          "ent": "At-Taghaabun"
        }
      },
      "up": {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      }
    },
    "order": 99,
    "part_type": "Chapter",
    "path": "/books/quran:65",
    "reveal_type": "Medinan",
    "rukus": 2,
    "titles": {
      "ar": "الطلاق",
      "en": "Divorce",
      "ent": "At-Talaaq"
    },
    "verse_count": 12,
    "verse_start_index": 5217,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 5218,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:65:1",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:6:2:8:2",
            "/books/al-kafi:6:2:8:3",
            "/books/al-kafi:1:4:81:6",
            "/books/al-kafi:6:2:30:2",
            "/books/al-kafi:6:2:28:5",
            "/books/al-kafi:6:2:30:1",
            "/books/al-kafi:6:2:28:10",
            "/books/al-kafi:6:2:28:14"
          ]
        },
        "text": [
          "يَا أَيُّهَا النَّبِيُ‌ إِذَا طَلَّقْتُمُ‌ النِّسَاءَ فَطَلِّقُوهُنَ‌ لِعِدَّتِهِنَ‌ وَ أَحْصُوا الْعِدَّةَ وَ اتَّقُوا اللَّهَ‌ رَبَّکُمْ‌ لاَ تُخْرِجُوهُنَ‌ مِنْ‌ بُيُوتِهِنَ‌ وَ لاَ يَخْرُجْنَ‌ إِلاَّ أَنْ‌ يَأْتِينَ‌ بِفَاحِشَةٍ مُبَيِّنَةٍ وَ تِلْکَ‌ حُدُودُ اللَّهِ‌ وَ مَنْ‌ يَتَعَدَّ حُدُودَ اللَّهِ‌ فَقَدْ ظَلَمَ‌ نَفْسَهُ‌ لاَ تَدْرِي‌ لَعَلَ‌ اللَّهَ‌ يُحْدِثُ‌ بَعْدَ ذٰلِکَ‌ أَمْراً"
        ],
        "translations": {
          "en.ahmedali": [
            "O PROPHET WHEN you divorce women, divorce them at their appointed period, and calculate that period, and fear God, your Lord. Do not expel them from their houses, nor should they go away themselves, unless they are openly guilty of adultery. These are the limits set by God. Any one who exceeds the limits set by God sins against his own self. You never know that God may perchance lead to a new situation after this."
          ],
          "en.ahmedraza": [
            "O dear Prophet (Mohammed – peace and blessings be upon him)! When you people divorce women, divorce them at the time of their completing the appointed period, and keep count of the appointed period; and fear Allah, your Lord; do not expel them from their houses during the appointed period nor should they leave on their own, unless they bring about some matter of blatant lewdness; and these are the limits of Allah; and whoever crosses Allah’s limits has indeed wronged himself; do you not know, it is likely that Allah may send some new decree after this?"
          ],
          "en.arberry": [
            "O Prophet, when you divorce women, divorce them when they have reached their period. Count the period, and fear God your Lord. Do not expel them from their houses, nor let them go forth, except when they commit a flagrant indecency. Those are God's bounds; whosoever trespasses the bounds of God has done wrong to himself. Thou knowest not, perchance after that God will bring something new to pass."
          ],
          "en.daryabadi": [
            "O Prophet! when ye divorce women, divorce them before their waitrng-period; and count the waiting period; and fear Allah, your Lord. Drive them not out of their houses, nor should they go forth, unless they commit a manifest indecency. These are the bounds of Allah; and whosoever trespasseth the bounds of Allah, hath surely wronged himself. Thou knowest not, that haply Allah may hereafter bring something new to pass."
          ],
          "en.hilali": [
            "O Prophet (SAW)! When you divorce women, divorce them at their 'Iddah (prescribed periods), and count (accurately) their 'Iddah (periods). And fear Allah your Lord (O Muslims), and turn them not out of their (husband's) homes, nor shall they (themselves) leave, except in case they are guilty of some open illegal sexual intercourse. And those are the set limits of Allah. And whosoever transgresses the set limits of Allah, then indeed he has wronged himself. You (the one who divorces his wife) know not, it may be that Allah will afterward bring some new thing to pass (i.e. to return her back to you if that was the first or second divorce)."
          ],
          "en.itani": [
            "O Prophet! If any of you divorce women, divorce them during their period of purity, and calculate their term. And be pious before God, your Lord. And do not evict them from their homes, nor shall they leave, unless they have committed a proven adultery. These are the limits of God—whoever oversteps God’s limits has wronged his own soul. You never know; God may afterwards bring about a new situation."
          ],
          "en.maududi": [
            "O Prophet, when you divorce women, divorce them for their waiting-period, and compute the waiting period accurately, and hold Allah, your Lord, in awe. Do not turn them out of their homes (during the waiting period) – nor should they go away (from their homes) – unless they have committed a manifestly evil deed. Such are the bounds set by Allah; and he who transgresses the bounds set by Allah commits a wrong against himself. You do not know: maybe Allah will cause something to happen to pave the way (for reconciliation)."
          ],
          "en.mubarakpuri": [
            "O Prophet! When you divorce women, divorce them at their `Iddah and count their `Iddah. And have Taqwa of Allah, your Lord. And turn them not out of their homes nor shall they leave, except in case they are guilty of Fahishah Mubayyinah. And those are the set limits of Allah. And whosoever transgresses the set limits of Allah, then indeed he has wronged himself. You know not, it may be that Allah will afterward bring some new thing to pass."
          ],
          "en.pickthall": [
            "O Prophet! When ye (men) put away women, put them away for their (legal) period and reckon the period, and keep your duty to Allah, your Lord. Expel them not from their houses nor let them go forth unless they commit open immorality. Such are the limits (imposed by) Allah; and whoso transgresseth Allah's limits, he verily wrongeth his soul. Thou knowest not: it may be that Allah will afterward bring some new thing to pass."
          ],
          "en.qarai": [
            "O Prophet! When you divorce women, divorce them at [the conclusion of] their term and calculate the term, and be wary of Allah, your Lord. Do not turn them out from their homes, nor shall they go out, unless they commit a gross indecency. These are Allah’s bounds, and whoever transgresses the bounds of Allah certainly wrongs himself. You never know maybe Allah will bring off something new later on."
          ],
          "en.qaribullah": [
            "O (nation of the) Prophet, if you divorce your wives, divorce them after (the end of their) menstrual cycle. Count their waiting period and fear Allah your Lord. Do not drive them from their homes or let them go away unless they commit a proven immorality. Such are the bounds set by Allah, he that exceeds the bounds of Allah wrongs himself. You do not know, perhaps after that Allah will bring a new event."
          ],
          "en.sahih": [
            "O Prophet, when you [Muslims] divorce women, divorce them for [the commencement of] their waiting period and keep count of the waiting period, and fear Allah, your Lord. Do not turn them out of their [husbands'] houses, nor should they [themselves] leave [during that period] unless they are committing a clear immorality. And those are the limits [set by] Allah. And whoever transgresses the limits of Allah has certainly wronged himself. You know not; perhaps Allah will bring about after that a [different] matter."
          ],
          "en.sarwar": [
            "Prophet and believers, if you want to divorce your wives, you should divorce them at a time after which they can start their waiting period. Let them keep an account of the number of the days in the waiting period. Have fear of God, your Lord. (During their waiting period) do not expel them from their homes and they also must not go out of their homes, unless they commit proven indecency. These are the Laws of God. Whoever transgresses against the laws of God has certainly wronged himself. You never know, perhaps God will bring about some new situation."
          ],
          "en.shakir": [
            "O Prophet! when you divorce women, divorce them for~ their prescribed time, and calculate the number of the days prescribed, and be careful of (your duty to) Allah, your Lord. Do not drive them out of their houses, nor should they themselves go forth, unless they commit an open indecency; and these are the limits of Allah, and whoever goes beyond the limits of Allah, he indeed does injustice to his own soul. You do not know that Allah may after that bring about reunion."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> a<b>l</b>nnabiyyu i<u>tha</u> <u>t</u>allaqtumu a<b>l</b>nnis<u>a</u>a fa<u>t</u>alliqoohunna liAAiddatihinna waa<u>hs</u>oo alAAiddata wa<b>i</b>ttaqoo All<u>a</u>ha rabbakum l<u>a</u> tukhrijoohunna min buyootihinna wal<u>a</u> yakhrujna ill<u>a</u> an yateena bif<u>ah</u>ishatin mubayyinatin watilka <u>h</u>udoodu All<u>a</u>hi waman yataAAadda <u>h</u>udooda All<u>a</u>hi faqad <i><u>th</u></i>alama nafsahu l<u>a</u> tadree laAAalla All<u>a</u>ha yu<u>h</u>dithu baAAda <u>tha</u>lika amr<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "O Prophet! When any of you divorce your wives, divorce them during their period of purity and calculate the period carefully: be mindful of God, your Lord. Do not drive them out of their homes, nor should they themselves leave, unless they become openly guilty of immoral conduct. These are the bounds set by God. He who transgresses God's bounds wrongs his own soul. You never know, after that, God may well bring about some new situation."
          ],
          "en.yusufali": [
            "O Prophet! When ye do divorce women, divorce them at their prescribed periods, and count (accurately), their prescribed periods: And fear Allah your Lord: and turn them not out of their houses, nor shall they (themselves) leave, except in case they are guilty of some open lewdness, those are limits set by Allah: and any who transgresses the limits of Allah, does verily wrong his (own) soul: thou knowest not if perchance Allah will bring about thereafter some new situation."
          ],
          "fa.ansarian": [
            "ای پیامبر! زمانی که خواستید زنان را طلاق دهید، آنان را در زمان عدّه [آن زمانی که از عادت پاک شده و با همسر آمیزش نکرده باشند] طلاق دهید و حساب عدّه را نگه دارید، و از خدا پروردگارتان پروا کنید، و آنان را [در مدتی که عدّه خود را می گذرانند] از خانه هایشان بیرون مکنید، و آنان هم [در مدت عدّه] بیرون نروند مگر اینکه مرتکب عمل زشت آشکاری شوند [که در آن صورت بیرون کردنشان از خانه بی مانع است]. این حدود خداست؛ و هر که از حدود تجاوز کند، یقیناً به خودش ستم ورزیده است. تو نمی دانی شاید خدا پس از این [در عده طلاق،] کاری پدید آورد [تا وسیله صلح و سازشی میان آنان شود.]"
          ],
          "fa.ayati": [
            "اى پيامبر، اگر زنان را طلاق مى‌دهيد به وقت عده طلاقشان دهيد. و شمار عده را نگه داريد. و از خداى يكتا پروردگارتان بترسيد. و آنان را از خانه‌هايشان بيرون مكنيد. و از خانه بيرون نروند مگر آنكه به آشكارا مرتكب كارى زشت شوند. اينها احكام خداوند است، و هر كه از آن تجاوز كند به خود ستم كرده است. تو چه دانى، شايد خدا از اين پس امرى تازه پديد آورد."
          ],
          "fa.bahrampour": [
            "اى پيامبر! چون زنان را طلاق دهيد، آنها را به وقت عده‌شان [پس از پاك شدن از حيض‌] طلاق دهيد و حساب عده را نگه داريد و از خدا، پروردگارتان بترسيد. آنها را [در دوران عده‌] از خانه‌هايشان بيرون نكنيد و [آنها هم‌] بيرون نروند، مگر آن كه مرتكب كار زشت آشكار"
          ],
          "fa.fooladvand": [
            "اى پيامبر، چون زنان را طلاق گوييد، در [زمان‌بندى‌] عدّه آنان طلاقشان گوييد و حساب آن عدّه را نگه داريد، و از خدا، پروردگارتان بترسيد. آنان را از خانه‌هايشان بيرون مكنيد، و بيرون نروند مگر آنكه مرتكب كار زشت آشكارى شده باشند. اين است احكام الهى. و هر كس از مقررات خدا [پاى‌] فراتر نهد، قطعاً به خودش ستم كرده است. نمى‌دانى، شايد خدا پس از اين، پيشامدى پديد آورد."
          ],
          "fa.ghomshei": [
            "الا ای پیغمبر گرامی (امت را بگو) هر گاه زنان را طلاق دهید به وقت عدّه آنها (یعنی در زمان پاکی از خون حیض که در آن پاکی هم نزدیکی با آنها نکرده‌اید) طلاق دهید و زمان عدّه را (مدت سه پاکی) بشمارید، و از خدا که آفریننده شماست بترسید. و آن زنان را (تا در عدّه‌اند) از خانه بیرون مکنید و آنان نیز (بدون ضرورت) بیرون نروند مگر آنکه کار زشتی آشکار مرتکب شوند. و این احکام حدود شرع خداست و هر کس از حدود الهی تجاوز کند به خویشتن ستم کرده است. تو ندانی شاید خدا (پس از طلاق) کاری از نو پدید آرد (یعنی میل رجوع در شما حادث گرداند)."
          ],
          "fa.khorramdel": [
            "ای پیغمبر! وقتی که خواستید زنان را طلاق دهید، آنان را در وقت فرا رسیدن عدّه (یعنی آغاز پاک شدن زن از عادت ماهیانه‌ای که شوهرش در آن با او نزدیکی نکرده باشد) طلاق دهید، و حساب عدّه را نگاه دارید (و دقیقاً ملاحظه کنید که زن سه بار ایّام پاکی خود از حیض را به پایان رساند، تا نژادها آمیزه‌ی یکدیگر نشود)، و از خدا که پروردگار شما است بترسید و پرهیزگاری کنید (و اوامر و نواهی او را به کار بندید، به ویژه در طلاق و نگهداری زمان عدّه). زنان را (بعد از طلاق، در مدّت عدّه) از خانه‌هایشان بیرون نکنید، و زنان هم (تا پایان عدّه، از منازل شوهرانشان) بیرون نروند. مگر این که زنان کار زشت و پلشت آشکاری (همچون زنا و فحّاشی و ناسازگاری طاقت فرسا با شوهران یا اهل خانواده) انجام دهند (که ادامه‌ی حضور ایشان در منازل، باعث مشکلات بیشتر گردد). اینها قوانین و مقرّرات الهی است، و هرکس از قوانین و مقرّرات الهی پا فراتر نهد و تجاوز کند، به خویشتن ستم می‌کند. (چرا که خود را در معرض خشم خدا قرار می‌دهد و به سعادت خویش لطمه می‌زند). تو نمی‌دانی، چه بسا خداوند بعد از این حادثه، وضع تازه‌ای پیش آورد (و ماندن زن در خانه زمینه‌ساز پشیمانی شوهر و همسر و رجوع آنان به یکدیگر گردد، و ابرهای تیره و تار کینه و کدورت از آسمان زندگی ایشان به دور رود، و مهر و محبّت فضای سینه‌ها را لبریز کند، و فرزندان از دامن عطوفت مادری بی‌بهره نمانند). [[«إِذَا طَلَّقْتُمْ»: وقتی که خواستید طلاق دهید. مثل إِذَا قَرَأْتَ الْقُرْآنَ ... (نگا: نحل / 98). مخاطب در آیه پیغمبر است و مراد امت او. این خطاب بیانگر اهمّیّت مسأله است. «لِعِدَّتِهِنَّ»: وقت فرا رسیدن عدّه ایشان، حرف (ل) به معنی (عِندَ) است (نگا: إسراء / 78). منظور این است که باید صیغه طلاق در زمانی اجرا شود که زن از عادت ماهیانه پاک شده، و شوهرش با او نزدیکی نکرده باشد. «أَحْصُوا الْعِدَّةَ»: زمان عِدّه را نگهدارید و دقیقاً محاسبه کنید. یعنی باید سه بار ایّام پاکی خود ازحیض را به پایان رساند (نگا: بقره / 228). «لا یَخْرُجْنَ»: زنان جائز نیست از منزل بیرون بروند مگر با رضایت طرفین.. «تِلْکَ حُدُودُ اللهِ»: این بخش اشاره بدین است که باید مسلمانان در طلاق که مبغوض‌ترین حلال در نزد خدا است، قوانین الهی را مراعات کنند. زن را یا طلاق ندهند، و یا اگر ناچار به طلاق شدند، احکام این آیه را رعایت بکنند. متأسّفانه امروز به طلاق قرآنی کمترین اعتنائی نمی‌شود!!! تنها طلاق بِدعی در مدّ نظر است، و کُلُّ بِدْعَةٍ ضَلالَةٌ.]]"
          ],
          "fa.khorramshahi": [
            "ای پیامبر، چون خواهید زنان را طلاق گویید، از هنگامی که عده‌شان آغاز تواند شد [طهر غیر مواقعه‌]، طلاق دهید، و حساب عده را نگه دارید، و از خداوند، پروردگارتان، پروا کنید، آنان را از خانه‌هایشان بیرون مکنید، و خودشان هم بیرون نروند، مگر آنکه مرتکب کار ناشایست آشکاری شوند، و این احکام الهی است و هر کس از [حد و مرز] احکام الهی تجاوز کند، به راستی در حق خود ستم روا داشته است، ندانی باشد که خداوند بعد از این کاری تازه پدید آورد"
          ],
          "fa.makarem": [
            "ای پیامبر! هر زمان خواستید زنان را طلاق دهید، در زمان عدّه، آنها را طلاق گویید [= زمانی که از عادت ماهانه پاک شده و با همسرشان نزدیکی نکرده باشند]، و حساب عدّه را نگه دارید؛ و از خدایی که پروردگار شماست بپرهیزید؛ نه شما آنها را از خانه‌هایشان بیرون کنید و نه آنها (در دوران عدّه) بیرون روند، مگر آنکه کار زشت آشکاری انجام دهند؛ این حدود خداست، و هر کس از حدود الهی تجاوز کند به خویشتن ستم کرده؛ تو نمی‌دانی شاید خداوند بعد از این، وضع تازه (و وسیله اصلاحی) فراهم کند!"
          ],
          "fa.moezzi": [
            "ای پیمبر هر گاه طلاق گفتید زنان را پس طلاقشان گوئید برای عدّه آنان و بشمرید عدّه را و بترسید خدا را پروردگار خویش برونشان نرانید از خانه‌های خویش و برون نروند مگر آنکه بیارند فحشائی آشکار و این است مرزهای خدا و آنکه بگذرد از مرزهای خدا همانا ستم کرده است خویش را ندانی شاید خدا پدید آرد پس از این کاری را"
          ],
          "fa.mojtabavi": [
            "اى پيامبر، چون خواهيد زنان را طلاق دهيد پس آنان را به هنگام عدّه ايشان طلاق دهيد و شمار عدّه را نگاه داريد، و از خداى، پروردگارتان، پروا كنيد و آنان را از خانه هاشان بيرون مكنيد و [آنها هم‌] بيرون نروند مگر آنكه كار زشت آشكارى كرده باشند. و اين مرزهاى- احكام- خداست و هر كه از مرزهاى خدا درگذرد براستى به خود ستم كرده است. تو- اى طلاق‌دهنده- چه دانى، شايد خداوند پس از اين كارى پديد آرد."
          ],
          "fa.sadeqi": [
            "هان ای پیامبر برجسته! چون زنان را طلاق گویید، پس از (زمان‌بندی) عدّه‌ی آنان طلاقشان گویید و حساب عدّه را نگه دارید. و خدا - پروردگارتان - را پروا بدارید. آنان را از خانه‌هاشان بیرون مرانید و آنها هم از خانه‌هاشان بیرون نروند، مگر آنکه مرتکب فحشایی آشکارگر گردند. و این است مرزبندی‌های الهی و هر کس از مرزهای خدا پای فراتر نهد، بی‌چون به خودش ستم کرده. نمی‌دانی، شاید خدا پس از این، جریانی (خوشایند) پدید آورد."
          ]
        }
      },
      {
        "index": 5219,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:65:2",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:7:5:3:1",
            "/books/al-kafi:7:5:8:5",
            "/books/al-kafi:2:1:33:7",
            "/books/al-kafi:6:2:8:2",
            "/books/al-kafi:6:2:8:3",
            "/books/al-kafi:8:1:39:8",
            "/books/al-kafi:6:2:59:1",
            "/books/al-kafi:5:2:8:5",
            "/books/al-kafi:6:2:8:6"
          ]
        },
        "text": [
          "فَإِذَا بَلَغْنَ‌ أَجَلَهُنَ‌ فَأَمْسِکُوهُنَ‌ بِمَعْرُوفٍ‌ أَوْ فَارِقُوهُنَ‌ بِمَعْرُوفٍ‌ وَ أَشْهِدُوا ذَوَيْ‌ عَدْلٍ‌ مِنْکُمْ‌ وَ أَقِيمُوا الشَّهَادَةَ لِلَّهِ‌ ذٰلِکُمْ‌ يُوعَظُ بِهِ‌ مَنْ‌ کَانَ‌ يُؤْمِنُ‌ بِاللَّهِ‌ وَ الْيَوْمِ‌ الْآخِرِ وَ مَنْ‌ يَتَّقِ‌ اللَّهَ‌ يَجْعَلْ‌ لَهُ‌ مَخْرَجاً"
        ],
        "translations": {
          "en.ahmedali": [
            "When they have reached their appointed time, then either keep them lawfully or let them go honourably; but have two witnesses from among you, and give truthful evidence for (being acceptable to) God. This is to warn him who believes in God and the Last Day. God will furnish a way out for him who fears Him,"
          ],
          "en.ahmedraza": [
            "So when they are about to reach their appointed term, hold them back with kindness or separate them with kindness, and make two just men among you as witnesses, and establish the testimony for Allah; with this is advised whoever believes in Allah and the Last Day; and whoever fears Allah – Allah will create for him a way of deliverance."
          ],
          "en.arberry": [
            "Then, when they have reached their term, retain them honourably, or part from them honourably. And call in to witness two men of equity from among yourselves; and perform the witnessing to God Himself. By this then is admonished whosoever believes in God and the Last Day. And whosoever fears God, He will appoint for him a way out,"
          ],
          "en.daryabadi": [
            "Then when they have attained their term, either retain them reputably, or part from them reputably, and take as witnesses two just men from among you, and set up your testimony for Ailah. Thus is exhorted he who believeth in Allah and the Last Day. And whosoever feareth Allah He maketh for him an outlet."
          ],
          "en.hilali": [
            "Then when they are about to fulfil their term appointed, either take them back in a good manner or part with them in a good manner. And take for witness two just persons from among you (Muslims). And establish the witness for Allah. That will be an admonition given to him who believes in Allah and the Last Day. And whosoever fears Allah and keeps his duty to Him, He will make a way for him to get out (from every difficulty)."
          ],
          "en.itani": [
            "Once they have reached their term, either retain them honorably, or separate from them honorably. And call to witness two just people from among you, and give upright testimony for God. By that is exhorted whoever believes in God and the Last Day. And whoever fears God—He will make a way out for him."
          ],
          "en.maududi": [
            "And when they reach the end of their term (of waiting), then either honourably retain them (in the bond of wedlock) or honourably part with them, and call two persons of known probity as witnesses from among yourselves, and (let these witnesses) give upright testimony for the sake of Allah. That is to what all those that believe in Allah and the Last Day are exhorted. Allah will find a way out for him who fears Allah,"
          ],
          "en.mubarakpuri": [
            "Then when they are about to attain their term appointed, either take them back in a good manner or part with them in a good manner. And take as witness two just persons from among you. And establish the testimony for Allah. That will be an admonition given to him who believes in Allah and the Last Day. And whosoever has Taqwa of Allah, He will make a way for him to get out."
          ],
          "en.pickthall": [
            "Then, when they have reached their term, take them back in kindness or part from them in kindness, and call to witness two just men among you, and keep your testimony upright for Allah. Whoso believeth in Allah and the Last Day is exhorted to act thus. And whosoever keepeth his duty to Allah, Allah will appoint a way out for him,"
          ],
          "en.qarai": [
            "Then, when they have completed their term, either retain them honourably or separate from them honourably, and take the witness of two honest men from among yourselves, and bear witness for the sake of Allah. Whoever believes in Allah and the Last Day is advised to [comply with] this. Whoever is wary of Allah, He shall make for him a way out [of the adversities of the world and the Hereafter]"
          ],
          "en.qaribullah": [
            "When they have reached their term, either keep them honorably or part from them honorably. Call two honest men among you to witness and give yourwitnessing before Allah. Whoever believes in Allah and the Last Day is warned to do this. Whosoever fears Allah, He will appoint for him a way out,"
          ],
          "en.sahih": [
            "And when they have [nearly] fulfilled their term, either retain them according to acceptable terms or part with them according to acceptable terms. And bring to witness two just men from among you and establish the testimony for [the acceptance of] Allah. That is instructed to whoever should believe in Allah and the Last day. And whoever fears Allah - He will make for him a way out"
          ],
          "en.sarwar": [
            "When their waiting period is about to end, keep them or separate from them lawfully. Let two just people witness the divorce and let them bear witness for the sake of God. Thus does God command those who have faith in Him and the Day of Judgment."
          ],
          "en.shakir": [
            "So when they have reached their prescribed time, then retain them with kindness or separate them with kindness, and call to witness two men of justice from among you, and give upright testimony for Allah. With that is admonished he who believes in Allah and the latter day; and whoever is careful of (his duty to) Allah, He will make for him an outlet,"
          ],
          "en.transliteration": [
            "Fai<u>tha</u> balaghna ajalahunna faamsikoohunna bimaAAroofin aw f<u>a</u>riqoohunna bimaAAroofin waashhidoo <u>th</u>away AAadlin minkum waaqeemoo a<b>l</b>shshah<u>a</u>data lill<u>a</u>hi <u>tha</u>likum yooAAa<i><u>th</u></i>u bihi man k<u>a</u>na yuminu bi<b>A</b>ll<u>a</u>hi wa<b>a</b>lyawmi al<u>a</u>khiri waman yattaqi All<u>a</u>ha yajAAal lahu makhraj<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "And when their waiting term is ended, either keep them honourably or part with them in honour. Call to witness two reliable men from among you and bear true witness for God. This is an admonishment for those who believe in God and the Last Day. To one who fears God, He will grant a way out [of his difficulties],"
          ],
          "en.yusufali": [
            "Thus when they fulfil their term appointed, either take them back on equitable terms or part with them on equitable terms; and take for witness two persons from among you, endued with justice, and establish the evidence (as) before Allah. Such is the admonition given to him who believes in Allah and the Last Day. And for those who fear Allah, He (ever) prepares a way out,"
          ],
          "fa.ansarian": [
            "و چون به پایان زمان [عدّه] نزدیک شدند، آنان را [با رجوع به زوجیت] به صورتی شایسته [که رعایت همه حقوق همسرداری است] نگه دارید یا از آنان به طرزی شایسته [که پرداخت همه حقوق شرعیه اوست] جدا شوید، و [هنگام جدایی،] دو عادل از خودتان را گواه [طلاق] گیرید. [و شما ای گواهان!] گواهی را برای خدا اقامه کنید. به وسیله این [حقایق] به کسی که همواره به خدا و روز قیامت ایمان دارد، اندرز داده می شود و هر که از خدا پروا کند، خدا برای او راه بیرون شدن [از مشکلات و تنگناها را] قرار می دهد."
          ],
          "fa.ayati": [
            "و چون به پايان مدت رسيدند، يا به وجهى نيكو نگاهشان داريد يا به وجهى نيكو از آنها جدا شويد و دو تن عادل از خودتان را به شهادت گيريد. و براى خدا شهادت را به راستى ادا كنيد. هر كه را به خدا و روز قيامت ايمان دارد، اينچنين اندرز مى‌دهند. و هر كه از خدا بترسد، براى او راهى براى بيرون‌شدن قرار خواهد داد،"
          ],
          "fa.bahrampour": [
            "پس چون به آخر عدّه‌شان رسيدند، يا به شايستگى نگاهشان داريد و يا به شايستگى از آنها جدا شويد، و دو تن عادل از خودتان را گواه بگيريد و شهادت را براى خدا به پا داريد. با اين [دستورات‌] كسى كه به خدا و روز رستاخيز ايمان دارد موعظه مى‌شود. و هر كه از خدا پ"
          ],
          "fa.fooladvand": [
            "پس چون عدّه آنان به سر رسيد، [يا] به شايستگى نگاهشان داريد، يا به شايستگى از آنان جدا شويد، و دو تن [مرد] عادل را از ميان خود گواه گيريد، و گواهى را براى خدا به پا داريد. اين است اندرزى كه به آن كس كه به خدا و روز بازپسين ايمان دارد، داده مى‌شود، و هر كس از خدا پروا كند، [خدا] براى او راه بيرون‌شدنى قرار مى‌دهد."
          ],
          "fa.ghomshei": [
            "آن‌گاه که (نزدیک است) مدّت عدّه را به پایان رسانند باز یا به نیکویی نگاهشان دارید یا به خوشرفتاری رهاشان کنید و نیز (بر طلاق آنها) دو مرد مسلمان عادل گواه گیرید، و (شما شاهدان نیز) برای خدا شهادت را برپا کنید. بدین وعظ الهی آن کس که به خدا و روز قیامت ایمان آورد پند داده می‌شود، و هر کس خدا ترس و پرهیزکار شود خدا راه بیرون شدن (از عهده گناهان و بلا و حوادث سخت عالم) را بر او می‌گشاید."
          ],
          "fa.khorramdel": [
            "و هنگامی که مدّت عِدّه‌ی آنان نزدیک به پایان آمد، یا ایشان را به طرز شایسته‌ای نگاه دارید، و یا به طرز شایسته‌ای از ایشان جدا شوید، و بر (نگاهداری و یا جدائی) آنان دو مرد عادل از میان خودتان گواه کنید، (تا اگر در آینده اختلافی روی دهد، هیچ یک از شوهر و همسر نتوانند واقعیّت را انکار کنند) و گواهی دادن را برای خدا اداء کنید (و انگیزه‌ی شهادت محض رضای خدا باشد، و از هیچ کدام جانبداری ننمائید). این (احکام) چیزی است که کسی بدان پند و اندرز می‌گردد که به خدا و روز آخرت ایمان داشته باشد. هر کس هم از خدا بترسد و پرهیزگاری کند، خدا راه نجات (از هر تنگنائی) را برای او فراهم می‌سازد. [[«إذَا بَلَغْنَ أَجَلَهُنَّ»: زمانی که به مدّت پایان عدّه، نزدیک شدند. چرا که اگر زمان عدّه به پایان برسد، راه مراجعت بر روی شوهر بسته می‌گردد (نگا: أضواء البیان). یادآوری: زنان از لحاظ نگاه داشتنِ عدّه، به دو دسته تقسیم می‌شوند: 1) زنانی که شوهرانشان بمیرند. این گروه به دو دسته تقسیم می‌گردند: الف - زنانی که حامله‌اند. اینان تا وضع حمل عده نگاه می‌دارند. ب - زنانی که حامله نیستند. اینان چه با ایشان همبستری شده باشد و چه با آنان همبستری نشده باشد، چهار ماه و ده روز عده نگاه می‌دارند. 2) زنانی که شوهرانشان ایشان را طلاق داده باشند. اینان نیز دو گروهند: الف - زنانی که حامله‌اند. چنین زنانی تا وضع حمل عده نگاه می‌دارند. ب - زنانی که حامله نیستند. اینان هم دو دسته هستند: 1 - زنانی که با آنان همبستری نشده است. اینان عدّه‌ای ندارند. 2 - زنانی که با ایشان همبستری شده است. اینان اگر کسانی بوده که دارای عادت ماهیانه باشند، تنها سه عادت ماهیانه عدّه نگاه می‌دارند، و اگر کسانی بوده که دارای عادت ماهیانه نباشند، یعنی یائسه و یا صغیره باشند، سه ماه تمام عدّه نگاه می‌دارند (نگا: أضواء البیان).]]"
          ],
          "fa.khorramshahi": [
            "پس چون به پایان عده‌شان نزدیک شوند، یا به نیکویی نگاهشان دارید [و رجوع کنید]، یا با خیر و خوشی از آنان جدا شوید، و [بر این کار] دو [شاهد] عادل از میان خودتان را شاهد بگیرید، و شهادت را برای خداوند برپا دارید، این است که هر کس به خداوند و روز بازپسین ایمان دارد، بدان اندرز داده شود، و هر کس که از خداوند پروا [و پارسایی پیشه‌] کند، [خداوند] برای او بیرون‌شدی بگذارد"
          ],
          "fa.makarem": [
            "و چون عده آنها سرآمد، آنها را بطرز شایسته‌ای نگه دارید یا بطرز شایسته‌ای از آنان جدا شوید؛ و دو مرد عادل از خودتان را گواه گیرید؛ و شهادت را برای خدا برپا دارید؛ این چیزی است که مؤمنان به خدا و روز قیامت به آن اندرز داده می‌شوند! و هر کس تقوای الهی پیشه کند، خداوند راه نجاتی برای او فراهم می‌کند،"
          ],
          "fa.moezzi": [
            "تا گاهی که رسیدند سرآمد خویش را پس نگاهشان دارید به خوشی یا دوری گزینید از ایشان به خوشی و گواه گیرید دو تن عدالتمند را از شما و بپای دارید گواهی را برای خدا بدین اندرز داده شود آنکو ایمان آرد به خدا و روز آخر و آنکه بترسد خدا را نهد برایش برون‌شدنگاهی‌"
          ],
          "fa.mojtabavi": [
            "پس چون به سرآمد خويش نزديك شدند، يا به شيوه‌اى نيكو و پسنديده نگاهشان داريد يا از آنان بخوبى جدا شويد، و دو تن عادل از خودتان را گواه گيريد، و گواهى را براى خدا برپا داريد- ادا كنيد-، اين است كه به آن پند داده مى‌شود هر كه به خدا و روز بازپسين ايمان دارد، و هر كه از خدا پروا كند براى او راه بيرون شدن [از هر دشوارى و اندوهى‌] پديد آرد،"
          ],
          "fa.sadeqi": [
            "پس هنگامی که عدّه‌ی آنان سر رسید به شایستگی (پیش از پایان آن) نگاهشان دارید، یا به شایستگی از آنان جدا شوید و دو مرد عادل را از میان خود (بر طلاق یا رجوع) گواه گیرید و این گواهی را برای خدا به پا دارید. این است اندرزی که - به هر کس که به خدا و روز بازپسین ایمان می‌آورده - داده می‌شود. و هر کس از خدا پروا کند، خدا برای او راه بیرون‌شدنی (از گرفتاری‌ها) قرار می‌دهد،"
          ]
        }
      },
      {
        "index": 5220,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:65:3",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:39:8",
            "/books/al-kafi:2:1:32:5",
            "/books/al-kafi:2:1:32:6",
            "/books/al-kafi:5:2:8:5"
          ]
        },
        "text": [
          "وَ يَرْزُقْهُ‌ مِنْ‌ حَيْثُ‌ لاَ يَحْتَسِبُ‌ وَ مَنْ‌ يَتَوَکَّلْ‌ عَلَى‌ اللَّهِ‌ فَهُوَ حَسْبُهُ‌ إِنَ‌ اللَّهَ‌ بَالِغُ‌ أَمْرِهِ‌ قَدْ جَعَلَ‌ اللَّهُ‌ لِکُلِ‌ شَيْ‌ءٍ قَدْراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And provide for him from where he does not reckon. God is sufficient for him who places his trust in Him. Certainly God fulfills His purpose. God has indeed fixed a measure of everything."
          ],
          "en.ahmedraza": [
            "And will provide him sustenance from a place he had never expected; and whoever relies on Allah – then Allah is Sufficient for him; indeed Allah will accomplish His command; indeed Allah has set a proper measure for all things."
          ],
          "en.arberry": [
            "and He will provide for him from whence he never reckoned. And whosoever puts his trust in God, He shall suffice him. God attains his purpose. God has appointed a measure for everything."
          ],
          "en.daryabadi": [
            "And He provideth for him from whence he reckoneth not upon. And whosoever putteth his trust in Allah He will suffice him. Verily Allah is sure to attain His purpose, and Allah hath appointed Unto everything a measure."
          ],
          "en.hilali": [
            "And He will provide him from (sources) he never could imagine. And whosoever puts his trust in Allah, then He will suffice him. Verily, Allah will accomplish his purpose. Indeed Allah has set a measure for all things."
          ],
          "en.itani": [
            "And will provide for him from where he never expected. Whoever relies on God—He will suffice him. God will accomplish His purpose. God has set a measure to all things."
          ],
          "en.maududi": [
            "and will provide him sustenance from whence he never even imagined. Whoever puts his trust in Allah, He shall suffice him. Surely Allah brings about what He decrees; Allah has set a measure for everything."
          ],
          "en.mubarakpuri": [
            "And He will provide him from where he never could imagine. And whosoever puts his trust in Allah, then He will suffice him. Verily, Allah will accomplish his purpose. Indeed Allah has set a measure for all things."
          ],
          "en.pickthall": [
            "And will provide for him from (a quarter) whence he hath no expectation. And whosoever putteth his trust in Allah, He will suffice him. Lo! Allah bringeth His command to pass. Allah hath set a measure for all things."
          ],
          "en.qarai": [
            "and provide for him from whence he does not count upon. And whoever puts his trust in Allah, He will suffice him. Indeed Allah carries through His commands. Certainly, Allah has ordained a measure [and extent] for everything."
          ],
          "en.qaribullah": [
            "and provide for him from where he does not expect, Allah is Sufficient for whosoever puts his trust in Him. Indeed, Allah brings about whatever He decrees. Allah has set a measure for all things."
          ],
          "en.sahih": [
            "And will provide for him from where he does not expect. And whoever relies upon Allah - then He is sufficient for him. Indeed, Allah will accomplish His purpose. Allah has already set for everything a [decreed] extent."
          ],
          "en.sarwar": [
            "God will make a way (out of difficulty) for one who has fear of Him and will provide him with sustenance in a way that he will not even notice. God is Sufficient for the needs of whoever trusts in Him. He has full access to whatever He wants. He has prescribed a due measure for everything."
          ],
          "en.shakir": [
            "And give him sustenance from whence he thinks not; and whoever trusts in Allah, He is sufficient for him; surely Allah attains His purpose; Allah indeed has appointed a measure for everything."
          ],
          "en.transliteration": [
            "Wayarzuqhu min <u>h</u>aythu l<u>a</u> ya<u>h</u>tasibu waman yatawakkal AAal<u>a</u> All<u>a</u>hi fahuwa <u>h</u>asbuhu inna All<u>a</u>ha b<u>a</u>lighu amrihi qad jaAAala All<u>a</u>hu likulli shayin qadr<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and God will provide for him from an unexpected source; God suffices for anyone who puts his trust in Him. God will surely bring about what He decrees. He has set a measure for all things."
          ],
          "en.yusufali": [
            "And He provides for him from (sources) he never could imagine. And if any one puts his trust in Allah, sufficient is (Allah) for him. For Allah will surely accomplish his purpose: verily, for all things has Allah appointed a due proportion."
          ],
          "fa.ansarian": [
            "و او را از جایی که گمان نمی برد روزی می دهد، و کسی که بر خدا توکل کند، خدا برایش کافی است، [و] خدا فرمان و خواسته اش را [به هر کس که بخواهد] می رساند؛ یقیناً برای هر چیزی اندازه ای قرار داده است."
          ],
          "fa.ayati": [
            "و از جايى كه گمانش را ندارد روزى‌اش مى‌دهد. و هر كه بر خدا توكل كند، خدا او را كافى است. خدا كار خود را به اجرا مى‌رساند و هر چيز را اندازه‌اى قرار داده است."
          ],
          "fa.bahrampour": [
            "و او را از جايى كه گمان نمى‌برد روزى مى‌دهد. و هر كس بر خدا توكل كند او براى وى كافى است. همانا خدا [به ثمر] رساننده‌ى امر خويش است. بى‌ترديد خدا براى هر چيزى اندازه‌اى نهاده است"
          ],
          "fa.fooladvand": [
            "و از جايى كه حسابش را نمى‌كند، به او روزى مى‌رساند، و هر كس بر خدا اعتماد كند او براى وى بس است. خدا فرمانش را به انجام‌رساننده است. به راستى خدا براى هر چيزى اندازه‌اى مقرر كرده است."
          ],
          "fa.ghomshei": [
            "و از جایی که گمان نَبَرد به او روزی عطا کند، و هر که بر خدا توکل کند خدا او را کفایت خواهد کرد که خدا امرش را نافذ و روان می‌سازد و بر هر چیز قدر و اندازه‌ای مقرّر داشته است (و به هیچ تدبیری سر از تقدیرش نتوان پیچید)."
          ],
          "fa.khorramdel": [
            "و به او از جائی که تصوّرش نمی‌کند روزی می‌رساند. هر کس بر خداوند توکّل کند (و کار و بار خود را بدو واگذارد) خدا او را بسنده است. خداوند فرمان خویش را به انجام می‌رساند و هر چه را بخواهد بدان دسترسی پیدا می‌کند. خدا برای هر چیزی زمان و اندازه‌ای را قرار داده است. [[«مِنْ حَیْثُ»: از جائی که، به گونه‌ای که. «بَالِغُ أَمْرِهِ»: دستیابی دارد به هر چه بخواهد. فرمان خود را به انجام می‌رساند. «أَمْرِ»: کار، فرمان. «قَدْراً»: مدّت و اجل، اندازه و مقدار.]]"
          ],
          "fa.khorramshahi": [
            "و او را از جایی که گمان نمی‌برد، روزی رساند، و هر کس بر خداوند توکل کند، همو وی را کافی است، بی‌گمان خداوند سررشته‌دار کار خویش است، به راستی که خداوند برای هر چیز اندازه‌ای نهاده است‌"
          ],
          "fa.makarem": [
            "و او را از جایی که گمان ندارد روزی می‌دهد؛ و هر کس بر خدا توکّل کند، کفایت امرش را می‌کند؛ خداوند فرمان خود را به انجام می‌رساند؛ و خدا برای هر چیزی اندازه‌ای قرار داده است!"
          ],
          "fa.moezzi": [
            "و روزیش دهد از آنجا که در شمار نیارد و آنکو توکّل کند بر خدا پس باشدش همانا خدا است رسنده کار او هر آینه نهاده است خدا برای هر چیزی اندازه‌ای‌"
          ],
          "fa.mojtabavi": [
            "و او را از جايى كه گمان ندارد روزى مى‌دهد. و هر كه بر خدا توكل كند خدا او را بسنده است. همانا خدا كار خود را رساننده است [به آنجا كه خواهد]. براستى كه خداوند براى هر چيزى اندازه‌اى نهاده است."
          ],
          "fa.sadeqi": [
            "و از جایی که حسابش را نمی‌کند، (خدا) روزیش می‌دهد. و هر کس بر خدا توکل کند، پس (هم) او برایش بس است. خدا کار و فرمانش را انجام‌دهنده است. به‌راستی خدا برای هر چیزی ارزش و اندازه‌ای قرار داده است."
          ]
        }
      },
      {
        "index": 5221,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:65:4",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:3:2:1:2",
            "/books/al-kafi:6:2:34:8"
          ]
        },
        "text": [
          "وَ اللاَّئِي‌ يَئِسْنَ‌ مِنَ‌ الْمَحِيضِ‌ مِنْ‌ نِسَائِکُمْ‌ إِنِ‌ ارْتَبْتُمْ‌ فَعِدَّتُهُنَ‌ ثَلاَثَةُ أَشْهُرٍ وَ اللاَّئِي‌ لَمْ‌ يَحِضْنَ‌ وَ أُولاَتُ‌ الْأَحْمَالِ‌ أَجَلُهُنَ‌ أَنْ‌ يَضَعْنَ‌ حَمْلَهُنَ‌ وَ مَنْ‌ يَتَّقِ‌ اللَّهَ‌ يَجْعَلْ‌ لَهُ‌ مِنْ‌ أَمْرِهِ‌ يُسْراً"
        ],
        "translations": {
          "en.ahmedali": [
            "As for your women who have lost hope of menstruation, and in case you have a doubt, the prescribed period (of waiting) for them is three months, as also for those who have not menstruated yet. As for those who are pregnant, their prescribed period is until the delivery of the child. God will make things easy for him who is mindful of God."
          ],
          "en.ahmedraza": [
            "And for those of your women who have no hope of menstruation, if you doubt, the appointed period is three months – and also for those who have not yet had menstruation; and the appointed period for the pregnant women is up to the time they deliver their burden; and whoever fears Allah – Allah will create ease for him in his affairs."
          ],
          "en.arberry": [
            "As for your women who have despaired of further menstruating, if you are in doubt, their period shall be three months; and those who have not menstruated as yet. And those who are with child, their term is when they bring forth their burden. Whoso fears God, God will appoint for him, of His command, easiness."
          ],
          "en.daryabadi": [
            "And as to such of your women as have despaired of menstruation, if ye be in doubt thereof, their waiting period is three months, as also of those who have not yet menstruated. And as to those with burthens, their term is when they lay down their burthen. And whosoever feareth Allah, He maketh his affair Unto him easy."
          ],
          "en.hilali": [
            "And those of your women as have passed the age of monthly courses, for them the 'Iddah (prescribed period), if you have doubts (about their periods), is three months, and for those who have no courses [(i.e. they are still immature) their 'Iddah (prescribed period) is three months likewise, except in case of death]. And for those who are pregnant (whether they are divorced or their husbands are dead), their 'Iddah (prescribed period) is until they deliver (their burdens), and whosoever fears Allah and keeps his duty to Him, He will make his matter easy for him."
          ],
          "en.itani": [
            "As for those of your women who have reached menopause, if you have any doubts, their term shall be three months—and also for those who have not yet menstruated. As for those who are pregnant, their term shall be until they have delivered. Whoever fears God—He will make things easy for him."
          ],
          "en.maududi": [
            "The waiting period of those of your women who have lost all expectation of menstruation shall be three months in case you entertain any doubt; and the same shall apply to those who have not yet menstruated. As for pregnant women, their waiting period shall be until the delivery of their burden. Allah will create ease for him who fears Allah."
          ],
          "en.mubarakpuri": [
            "Those in menopause among your women, for them the `Iddah, if you have doubt, is three months; and for those who have no courses. And for those who are pregnant, their `Iddah is until they lay down their burden; and whosoever has Taqwa of Allah, He will make his matter easy for him."
          ],
          "en.pickthall": [
            "And for such of your women as despair of menstruation, if ye doubt, their period (of waiting) shall be three months, along with those who have it not. And for those with child, their period shall be till they bring forth their burden. And whosoever keepeth his duty to Allah, He maketh his course easy for him."
          ],
          "en.qarai": [
            "As for those of your wives who have ceased having menses—[or] if you have any doubts [concerning its cause, whether it’s is age or something else]—their term [of waiting] and of those who have not yet had menses, shall be three months. As for those who are pregnant, their term shall be until they deliver. And whoever is wary of Allah, He shall grant him ease in his affairs."
          ],
          "en.qaribullah": [
            "As for your women who have despaired of further menstruating, if you are in doubt, then their waiting period is three months as well as those who have not yet menstruated. As for those who are pregnant, their term shall be the time they deliver their burden. Allah will ease (matters) by His order for whosoever fears Him."
          ],
          "en.sahih": [
            "And those who no longer expect menstruation among your women - if you doubt, then their period is three months, and [also for] those who have not menstruated. And for those who are pregnant, their term is until they give birth. And whoever fears Allah - He will make for him of his matter ease."
          ],
          "en.sarwar": [
            "If you have any doubt whether your wives have reached the stage of menopause, the waiting period will be three months. This will also be the same for those who do not experience menstruation. The end of the waiting period for a pregnant woman is the delivery. God will make the affairs of one who fears Him easy."
          ],
          "en.shakir": [
            "And (as for) those of your women who have despaired of menstruation, if you have a doubt, their prescribed time shall be three months, and of those too who have not had their courses; and (as for) the pregnant women, their prescribed time is that they lay down their burden; and whoever is careful of (his duty to) Allah He will make easy for him his affair."
          ],
          "en.transliteration": [
            "Wa<b>a</b>ll<u>a</u>ee yaisna mina alma<u>h</u>ee<u>d</u>i min nis<u>a</u>ikum ini irtabtum faAAiddatuhunna thal<u>a</u>thatu ashhurin wa<b>a</b>ll<u>a</u>ee lam ya<u>h</u>i<u>d</u>na waol<u>a</u>tu ala<u>h</u>m<u>a</u>li ajaluhunna an ya<u>d</u>aAAna <u>h</u>amlahunna waman yattaqi All<u>a</u>ha yajAAal lahu min amrihi yusr<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "In the case of those of your wives who have passed the age of menstruation, if you have any doubt, know that their waiting period is three months; and that will apply likewise to those who have not yet menstruated; the waiting period of those who are pregnant will be until they deliver their burden [give birth]. God makes things easy for those who are mindful of Him."
          ],
          "en.yusufali": [
            "Such of your women as have passed the age of monthly courses, for them the prescribed period, if ye have any doubts, is three months, and for those who have no courses (it is the same): for those who carry (life within their wombs), their period is until they deliver their burdens: and for those who fear Allah, He will make their path easy."
          ],
          "fa.ansarian": [
            "و از زنان شما آنانی که از عادت ماهیانه ناامیدند، اگر شک دارید [که به سبب رسیدن به سن یائسگی یا عاملی دیگر است] عدّه آنان [پس از طلاق] سه ماه است. و [هم چنین عدّه] زنانی که [با وجود سن معمولی] عادت نشده اند [سه ماه است] و [پایان] عدّه زنان باردار، روزی است که وضع حمل می کنند. و هر که از خدا پروا کند برای او در کارش آسانی قرار می دهد."
          ],
          "fa.ayati": [
            "اگر در ترديد هستيد، از ميان زنانتان آنهايى كه از حيض مأيوس شده‌اند و آنهايى كه هنوز حيض نشده‌اند عِدّه‌شان سه ماه است. و عِدّه زنان آبستن همان وضع حمل است. و هر كه از خدا بترسد، خدا كارش را آسان خواهد كرد."
          ],
          "fa.bahrampour": [
            "و از زنان شما آنهايى كه از عادت ماهانه مأيوس شده‌اند، اگر در وضع آنها [از نظر باردارى و عوارض ديگر] شك داريد، عدّه‌ى آنها سه ماه است، و زنانى كه [با وجود اقتضاى سنّ‌] عادت ماهانه نديده‌اند [نيز عده‌شان سه ماه است‌]. و زنان باردار مدتشان اين است كه وض"
          ],
          "fa.fooladvand": [
            "و آن زنان شما كه از خون‌ديدن [ماهانه‌] نوميدند، اگر شك داريد [كه خون مى‌بينند يا نه؟] عدّه آنان سه ماه است، و [دخترانى‌] كه [هنوز] خون نديده‌اند [نيز عدّه‌شان سه ماه است‌]، و زنان آبستن مدّتشان اين است كه وضع حمل كنند، و هر كس از خدا پروا دارد [خدا] براى او در كارش تسهيلى فراهم سازد."
          ],
          "fa.ghomshei": [
            "و از زنان شما آنان که از حیض (و فرزند، به ظاهر) نومیدند اگر باز شک (در تحقق سنّ یأسشان) دارید عدّه (طلاق) آنان سه ماه است و نیز زنانی که حیض ندیده (لیکن در سنّ حیض باشند آنها هم سه ماه عدّه نگه دارند)، و زنان حامله مدّت عدّه‌شان تا وقت زاییدن است. و هر که متّقی و خداترس باشد خدا (مشکلات) کار او را آسان می‌گرداند."
          ],
          "fa.khorramdel": [
            "زنان شما وقتی که ناامید از عادت ماهیانه‌اند، و همچنین زنانی که هنوز عادت ماهیانه ندیده‌اند، اگر (درباره‌ی حکم عِدّه‌ی ایشان) متردّدید، بدانید که عدّه‌ی آنان سه ماه است، و عدّه‌ی زنان باردار، وضع حمل است. هر کس که از خدا بترسد و پرهیزگاری کند، خدا کار و بارش را ساده و آسان می‌سازد. [[«یَئِسْنَ»: ناامید شده‌اند. یائسه گشته‌اند. «إِنِ ارْتَبْتُمْ»: اگر متردّد شدید درباره حکم عدّه ایشان. اگر متردّد شدید در خونی که از ایشان بیرون می‌تراود که آیا خون حیض یا خون چیز دیگری است. اگر متردّد شدید که آیا به سن یائسگی رسیده‌اند یا خیر. «مِنْ أَمْرِهِ»: از کار و بارش. به فرمان و دستور خویش (نگا: نحل / 2، غافر / 15).]]"
          ],
          "fa.khorramshahi": [
            "و کسانی از زنان شما که از حیض مایوسند، اگر در کارشان شک دارید، بدانید که عده آنان سه ماه [/سه پاکی‌] است، همچنین [است امر] زنانی که حیض ندیده‌اند، و بارداران، سرآمد عده‌شان این است که وضع حمل کنند، و هر کس از خداوند پرواکند، در کارش آسانی پدید آورد"
          ],
          "fa.makarem": [
            "و از زنانتان، آنان که از عادت ماهانه مأیوسند، اگر در وضع آنها (از نظر بارداری) شک کنید، عده آنان سه ماه است، و همچنین آنها که عادت ماهانه ندیده‌اند؛ و عده زنان باردار این است که بار خود را بر زمین بگذارند؛ و هر کس تقوای الهی پیشه کند، خداوند کار را بر او آسان می‌سازد!"
          ],
          "fa.moezzi": [
            "و آنان که نومید شدند از خون دیدن از زنان شما اگر شکّ آوردید پس عدّه ایشان سه ماه است و آنان که حیض نشدند (خون ندیدند) و زنان باردار سرآمد ایشان آن است که نهند بار خود را و آنکو بترسد خدا را قرار دهد برای او از کارش گشایشی‌"
          ],
          "fa.mojtabavi": [
            "و آن زنانى از شما كه از حيض- قاعدگى- نااميد شده باشند، اگر شك داشتيد- علت آن ندانستيد- پس عده [طلاق‌] ايشان سه ماه است و نيز زنانى كه حيض نديده‌اند- با آنكه در سنين حيض‌ديدن هستند-. و زنان باردار سرآمدشان اين است كه بار خود را بنهند. و هر كه از خداى پروا كند- به طاعت او- او را در كارش آسانى پديد آرد."
          ],
          "fa.sadeqi": [
            "و آن زنان که از خون حیض (ماهانه) نومیدند، اگر شک دارید (که خون حیضی خواهند دید یا نه، ) عدّه‌ی آنان سه ماه است و دخترانی (هم) که هنوز خون حیض ندیده‌اند (در حالی‌که در سنِ خون دیدن‌اند نیز عدّه‌شان سه ماه است) و زنان باردارِ سرآمد (عده‌)شان این است که وضع حمل کنند. و هر کس از خدا پروا بدارد خدا برایش از کارش آسانی‌‌ای می‌نهد."
          ]
        }
      },
      {
        "index": 5222,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:65:5",
        "text": [
          "ذٰلِکَ‌ أَمْرُ اللَّهِ‌ أَنْزَلَهُ‌ إِلَيْکُمْ‌ وَ مَنْ‌ يَتَّقِ‌ اللَّهَ‌ يُکَفِّرْ عَنْهُ‌ سَيِّئَاتِهِ‌ وَ يُعْظِمْ‌ لَهُ‌ أَجْراً"
        ],
        "translations": {
          "en.ahmedali": [
            "This is the commandment of God that is sent down to you. God will forgive the ills of those who fear Him, and increase their reward."
          ],
          "en.ahmedraza": [
            "This is Allah’s command that He has sent down towards you; and whoever fears Allah – Allah will relieve his sins and bestow upon him a great reward."
          ],
          "en.arberry": [
            "That is God's command, that He has sent down unto you. And whosoever fears God, He will acquit him of his evil deeds, and He will give him a mighty wage."
          ],
          "en.daryabadi": [
            "That is the commandment of Allah which He hath sent down Unto you. And whosoever feareth Allah, He Will expiate his misdeeds from him, and will magnify for him his hire."
          ],
          "en.hilali": [
            "That is the Command of Allah, which He has sent down to you, and whosoever fears Allah and keeps his duty to Him, He will remit his sins from him, and will enlarge his reward."
          ],
          "en.itani": [
            "This is the ordinance of God, which He sent down to you. Whoever fears God—He will remit his sins, and will amplify his reward."
          ],
          "en.maududi": [
            "This is the commandment of Allah that He has revealed to you. Whoever fears Allah, He will expunge his evil deeds and will richly reward him."
          ],
          "en.mubarakpuri": [
            "That is the command of Allah, which He has sent down to you; and whosoever has Taqwa of Allah, He will expiate from him his sins, and will increase his reward."
          ],
          "en.pickthall": [
            "That is the commandment of Allah which He revealeth unto you. And whoso keepeth his duty to Allah, He will remit from him his evil deeds and magnify reward for him."
          ],
          "en.qarai": [
            "That is Allah’s ordinance, which He has sent down to you, and whoever is wary of Allah, He shall absolve him of his misdeeds and give him a great reward."
          ],
          "en.qaribullah": [
            "Such is the command of Allah that He has sent down to you. Whosoever fears Allah shall be relieved of his sins and given a mighty wage."
          ],
          "en.sahih": [
            "That is the command of Allah, which He has sent down to you; and whoever fears Allah - He will remove for him his misdeeds and make great for him his reward."
          ],
          "en.sarwar": [
            "This is the command of God which He has revealed to you. God will expiate the evil deeds of those who fear Him and will increase their rewards."
          ],
          "en.shakir": [
            "That is the command of Allah which He has revealed to you, and whoever is careful of (his duty to) Allah, He will remove from him his evil and give him a big reward."
          ],
          "en.transliteration": [
            "<u>Tha</u>lika amru All<u>a</u>hi anzalahu ilaykum waman yattaqi All<u>a</u>ha yukaffir AAanhu sayyi<u>a</u>tihi wayuAA<i><u>th</u></i>im lahu ajr<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Such is the commandment which God has revealed to you. He who fears God shall be forgiven his sins and richly rewarded."
          ],
          "en.yusufali": [
            "That is the Command of Allah, which He has sent down to you: and if any one fears Allah, He will remove his ills, from him, and will enlarge his reward."
          ],
          "fa.ansarian": [
            "این حقایق بیان شده احکام خداست که آنها را به سوی شما نازل کرده است؛ و هر کس از خدا پروا کند، گناهانش را از او محو می کند و پاداش او را بزرگ می دارد."
          ],
          "fa.ayati": [
            "اين فرمان خداست كه بر شما نازل كرده است. و هر كه از خدا بترسد، گناهانش را از او مى‌زدايد و او را پاداشى بزرگ مى‌دهد."
          ],
          "fa.bahrampour": [
            "اين فرمان خداست كه آن را به سوى شما فرو فرستاده است و هر كس از خدا پروا كند، بدى‌هايش را از او بزدايد و پاداش او را بزرگ سازد"
          ],
          "fa.fooladvand": [
            "اين است فرمان خدا كه آن را به سوى شما فرستاده است؛ و هر كس از خدا پروا كند، بديهايش را از او بزدايد و پاداشش را بزرگ گرداند."
          ],
          "fa.ghomshei": [
            "این احکام فرمان خداست که به شما نازل کرد و هر که از خدا بترسد خدا گناهانش بپوشد و او را پاداش بزرگ (بهشت ابد) عطا کند."
          ],
          "fa.khorramdel": [
            "این (قانونگذاری) فرمان خدا است که آن را برای شما فرستاده است. هر کس که از خدا بترسد و پرهیزگاری کند، بدیها و گناهان او را محو کرده و می‌زداید، و پاداش وی را بزرگ می‌نماید. [[«یُکَفِّرْ عَنْهُ سَیِّئَاتِهِ»: (نگا: بقره / 271، انفال / 29، زمر / 35).]]"
          ],
          "fa.khorramshahi": [
            "این امر الهی است که به سوی شما نازلش کرده است، و هر کس از خداوند پرواکند، گناهانش را از او می‌زداید و پاداش او را بزرگ گرداند"
          ],
          "fa.makarem": [
            "این فرمان خداست که بر شما نازل کرده؛ و هر کس تقوای الهی پیشه کند، خداوند گناهانش را می‌بخشد و پاداش او را بزرگ می‌دارد!"
          ],
          "fa.moezzi": [
            "این است امر خدا که فرستادش بسوی شما و آنکو بترسد خدا را بسترد از او گناهانش را و بزرگ کند برایش پاداش را"
          ],
          "fa.mojtabavi": [
            "اين فرمان خداست كه آن را به سوى شما فرو فرستاد، و هر كه از خداى پروا كند بديهايش را از او بزدايد و مزدش را بزرگ سازد."
          ],
          "fa.sadeqi": [
            "این است فرمان خدا که آن را سویتان فرستاده است‌. و هر کس از خدا پروا کند، بدی‌های کوچکش را از او بزداید، و پاداشش را بزرگ گرداند."
          ]
        }
      },
      {
        "index": 5223,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:65:6",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:6:2:50:1"
          ]
        },
        "text": [
          "أَسْکِنُوهُنَ‌ مِنْ‌ حَيْثُ‌ سَکَنْتُمْ‌ مِنْ‌ وُجْدِکُمْ‌ وَ لاَ تُضَارُّوهُنَ‌ لِتُضَيِّقُوا عَلَيْهِنَ‌ وَ إِنْ‌ کُنَ‌ أُولاَتِ‌ حَمْلٍ‌ فَأَنْفِقُوا عَلَيْهِنَ‌ حَتَّى‌ يَضَعْنَ‌ حَمْلَهُنَ‌ فَإِنْ‌ أَرْضَعْنَ‌ لَکُمْ‌ فَآتُوهُنَ‌ أُجُورَهُنَ‌ وَ أْتَمِرُوا بَيْنَکُمْ‌ بِمَعْرُوفٍ‌ وَ إِنْ‌ تَعَاسَرْتُمْ‌ فَسَتُرْضِعُ‌ لَهُ‌ أُخْرَى‌"
        ],
        "translations": {
          "en.ahmedali": [
            "House the (divorced) women where you live, according to your means; but do not harass them so as to reduce them to straitened circumstances. If they are pregnant, then spend on them until they give birth to the child. And if they suckle the child for you, then make the due payment to them, and consult each other appropriately. But if you find this difficult, let some other woman suckle (the child) for her."
          ],
          "en.ahmedraza": [
            "Accommodate them where you also reside, according to your means, and do not harass them to make it difficult upon them; and if they are pregnant, give them the provision till they deliver their burden; then if they suckle the child for you, pay them its due; and consult with each other in a reasonable manner; and if you create hardship for one another, the child will get another breast feeding nurse."
          ],
          "en.arberry": [
            "Lodge them where you are lodging, according to your means, and do not press them, so as to straiten their circumstances. If they are with child, expend upon them until they bring forth their burden. If they suckle for you, give them their wages, and consult together honourably. If you both make difficulties, another woman shall suckle for him."
          ],
          "en.daryabadi": [
            "Lodge them wheresoever ye lodge yourselves; according to your means; and hurt them not so as to straiten them. And if they are with burthen, expend on them until they lay down their burthen. Then, if they suckle their children for you, give them their hire, and take counsel together reputably. And if ye make hardship for one another, then another woman will suckle for him."
          ],
          "en.hilali": [
            "Lodge them (the divorced women) where you dwell, according to your means, and do not treat them in such a harmful way that they be obliged to leave. And if they are pregnant, then spend on them till they deliver. Then if they give suck to the children for you, give them their due payment, and let each of you accept the advice of the other in a just way. But if you make difficulties for one another, then some other woman may give suck for him (the father of the child)."
          ],
          "en.itani": [
            "Allow them to reside where you reside, according to your means, and do not harass them in order to make things difficult for them. If they are pregnant, spend on them until they give birth. And if they nurse your infant, give them their payment. And conduct your relation in amity. But if you disagree, then let another woman nurse him."
          ],
          "en.maududi": [
            "(During the waiting period) lodge them according to your means wherever you dwell, and do not harass them to make them miserable. And if they are pregnant, provide for them maintenance until they have delivered their burden. And if they suckle your offspring whom they bore you, then give them due recompense, and graciously settle the question of compensation between yourselves by mutual understanding. But if you experience difficulty (in determining the compensation for suckling) then let another woman suckle the child."
          ],
          "en.mubarakpuri": [
            "Lodge them where you dwell, according to what you have, and do not harm them so as to suppress them. And if they are pregnant, then spend on them till they lay down their burden. Then if they suckle the children for you, give them their due payment, and let each of you deal with each other in a mannerly way. But if you make difficulties for one another, then some other woman may suckle for him."
          ],
          "en.pickthall": [
            "Lodge them where ye dwell, according to your wealth, and harass them not so as to straiten life for them. And if they are with child, then spend for them till they bring forth their burden. Then, if they give suck for you, give them their due payment and consult together in kindness; but if ye make difficulties for one another, then let some other woman give suck for him (the father of the child)."
          ],
          "en.qarai": [
            "House them where you live, in accordance with your means, and do not harass them to put them in straits, and should they be pregnant, maintain them until they deliver. Then, if they suckle [the baby] for you, give them their wages and consult together honourably. But if you make things difficult for each other, then another woman will suckle [the baby] for him."
          ],
          "en.qaribullah": [
            "Lodge them in your home according to your means. Do not harass them so as to (make life) difficult for them. If they are with child, spend upon them until they deliver their burden; and if they suckle give them their wage and consult together honorably. But if you both make difficulties, let another woman suckle for him."
          ],
          "en.sahih": [
            "Lodge them [in a section] of where you dwell out of your means and do not harm them in order to oppress them. And if they should be pregnant, then spend on them until they give birth. And if they breastfeed for you, then give them their payment and confer among yourselves in the acceptable way; but if you are in discord, then there may breastfeed for the father another woman."
          ],
          "en.sarwar": [
            "Lodge them (your wives) where you lived together if you can afford it. Do not annoy them so as to make life intolerable for them. If they are pregnant, provide them with maintenance until their delivery. Pay their wage if they breast-feed your children and settle your differences lawfully. If you are unable to settle them, let another person breast-feed the child."
          ],
          "en.shakir": [
            "Lodge them where you lodge according to your means, and do not injure them in order that you may straiten them; and if they are pregnant, spend on them until they lay down their burden; then if they suckle for you, give them their recompense and enjoin one another among you to do good; and if you disagree, another (woman) shall suckle for him."
          ],
          "en.transliteration": [
            "Askinoohunna min <u>h</u>aythu sakantum min wujdikum wal<u>a</u> tu<u>da</u>rroohunna litu<u>d</u>ayyiqoo AAalayhinna wain kunna ol<u>a</u>ti <u>h</u>amlin faanfiqoo AAalayhinna <u>h</u>att<u>a</u> ya<u>d</u>aAAna <u>h</u>amlahunna fain ar<u>d</u>aAAna lakum fa<u>a</u>toohunna ojoorahunna watamiroo baynakum bimaAAroofin wain taAA<u>a</u>sartum fasatur<u>d</u>iAAu lahu okhr<u>a</u>"
          ],
          "en.wahiduddin": [
            "Let the women [who are undergoing a waiting period] live in the same manner as you live yourselves, in accordance with your means; and do not harass them in order to make their lives difficult. If they are pregnant, maintain them until they give birth; if they suckle your infants, pay them for it; discuss things among yourselves in all decency -- if you cannot bear with each other, let another woman suckle for you --"
          ],
          "en.yusufali": [
            "Let the women live (in 'iddat) in the same style as ye live, according to your means: Annoy them not, so as to restrict them. And if they carry (life in their wombs), then spend (your substance) on them until they deliver their burden: and if they suckle your (offspring), give them their recompense: and take mutual counsel together, according to what is just and reasonable. And if ye find yourselves in difficulties, let another woman suckle (the child) on the (father's) behalf."
          ],
          "fa.ansarian": [
            "زنان طلاق داده را [تا پایان عدّه] به اندازه توانگری خود آنجا سکونت دهید که خود سکونت دارید و به آنان [در نفقه و مسکن] آسیب و زیان نرسانید تا زندگی را بر آنان سخت و دشوار کنید [و آنان مجبور به ترک خانه شوند]، و اگر باردار باشند، هزینه آنان را تا زمانی که وضع حمل کنند، بپردازید و اگر [پس از جدایی،] کودک شما را شیر دادند، اجرتشان را بدهید، و در میان خود [درباره فرزند] به نیکی و شایستگی مشورت کنید [تا به توافقی عادلانه برسید و در نتیجه به حقّ زن و شوهر و فرزند زیانی نرسد] و اگر [کارتان در این زمینه] با یکدیگر به سختی کشید [و نهایتاً به توافق نرسیدید،] زنی دیگر کودک را [با هزینه پدر] شیر دهد."
          ],
          "fa.ayati": [
            "هر جا كه خود سكونت گزينيد آنها را نيز به قدر توانايى خود مسكن دهيد. و تا بر آنها تنگ گيريد ميازاريدشان. و اگر آبستن بودند، نفقه‌شان را بدهيد تا وضع حمل كنند. و اگر فرزند شما را شير مى‌دهند، مزدشان را بدهيد و به وجهى نيكو با يكديگر توافق كنيد. و اگر به توافق نرسيديد، از زنى ديگر بخواهيد كه كودك را شير دهد."
          ],
          "fa.bahrampour": [
            "در حد توان خود، آنان را [تا سر آمد عده‌شان‌] در همان جا كه خود ساكنيد سكونت دهيد و به آنها آسيب و زيان نرسانيد تا عرصه را بر آنان تنگ كنيد. و اگر بار دارند خرجشان را بدهيد تا وضع حمل كنند. پس اگر براى شما [فرزند را] شير دادند پاداش آنها را بپردازد و ["
          ],
          "fa.fooladvand": [
            "همانجا كه [خود] سكونت داريد، به قدر استطاعت خويش آنان را جاى دهيد و به آنها آسيب [و زيان‌] مرسانيد تا عرصه را بر آنان تنگ كنيد. و اگر باردارند خرجشان را بدهيد تا وضع حمل كنند. و اگر براى شما [بچه‌] شير مى‌دهند مزدشان را به ايشان بدهيد و به شايستگى ميان خود به مشورت پردازيد، و اگر كارتان [در اين مورد] با هم به دشوارى كشيد [زن‌] ديگرى [بچّه را] شير دهد."
          ],
          "fa.ghomshei": [
            "(زنانی که طلاق رجعی دهید تا در عدّه‌اند) آنها را در همان منزل خویش که میسّر شماست بنشانید و به ایشان (در نفقه و سکنی) آزار و زیان نرسانید تا آنان را در مضیقه و رنج در افکنید (که به ناچار از حق خود بگذرند) و به زنان مطلّقه اگر حامله باشند تا وقت وضع حمل نفقه دهید آن‌گاه اگر فرزند شما را شیر دهند اجرتشان را بپردازید و (در کار فرزند) میان خود به نیکی مشورت و سازش کنید. و اگر با هم سختگیری کنید (مادر صرف‌نظر کند تا) زن دیگری او را شیر دهد."
          ],
          "fa.khorramdel": [
            "زنان مطلّقه را در جائی سکونت دهید که خودتان در آنجا زندگی می‌کنید و در توان دارید، و بدیشان زیان نرسانید تا (با زیان رساندن خود بر آنان سختگیری کنید و) در تنگنایشان قرار دهید (و ایشان مجبور به ترک منزل شوند). اگر آنان باردار باشند، خرج و نفقه‌ی ایشان را بپردازید تا زمانی که وضع حمل می‌کنند. اگر آنان (حاضر شدند بعد از جدائی، فرزندان) شما را شیر دهند، مزدشان را به تمام و کمال بپردازید. با یکدیگر درباره‌ی سرنوشت فرزندان، زیبا و پسندیده مشورت کنید (و اجرتی متناسب با مقدار و زمان شیر دادن، بر حسب عرف و عادت، تعیین کرده، و به نوزادان و کودکان از هر نظر عنایت شود). اگر هم بر همدیگر سخت گرفتید و به توافق نرسیدید، دایه‌ای شیر دادن به کودک مرد را بر عهده می‌گیرد (تا نزاع و کشمکش ادامه نیابد). [[«مِنْ حَیْثُ»: آنجا که. هرگونه که. «وُجْد»: توانائی. وسع و طاقت. «لا تُضَآرُّوهُنَّ»: بدیشان زیان نرسانید، به ویژه در نفقه و مسکن. «أُوْلاتِ»: صاحبان. دارندگان. «إِئْتَمِرُوا»: مشاوره کنید. مشورت و رایزنی نمائید. «بِمَعْرُوفٍ»: زیبا و پسندیده. یعنی پدر مزد شیر دادن را محترمانه و متناسب با عرف و عادت بپردازد. مادر هم مواظبت لازم را از فرزند بنماید. «تَعَاسَرْتُمْ»: همدیگر را در تنگنا گذاشتید و بر یکدیگر سختگیری کردید و توافق حاصل نشد. «أُخْری»: زن دیگری. دایه‌ای.]]"
          ],
          "fa.khorramshahi": [
            "آنان را در همانجا که خود سکنا دارید، در حد وسعتان سکنا دهید، و به آنان زیان مرسانید که عرصه را بر آنان تنگ بگیرید، و اگر [مطلقات‌] باردار باشند، خرجشان را بدهید تا آنکه وضع حمل کنند، و اگر برای شما [نوزاد را] شیر دادند، پس اجرتشان را بپردازید، و در میان خود به نیکی رایزنی کنید، و اگر به توافق نرسیدید [زن‌] دیگری او را شیر دهد"
          ],
          "fa.makarem": [
            "آنها [= زنان مطلّقه‌] را هر جا خودتان سکونت دارید و در توانایی شماست سکونت دهید؛ و به آنها زیان نرسانید تا کار را بر آنان تنگ کنید (و مجبور به ترک منزل شوند)؛ و اگر باردار باشند، نفقه آنها را بپردازید تا وضع حمل کنند؛ و اگر برای شما (فرزند را) شیر می‌دهند، پاداش آنها را بپردازید؛ و (درباره فرزندان، کار را) با مشاوره شایسته انجام دهید؛ و اگر به توافق نرسیدید، آن دیگری شیردادن آن بچه را بر عهده می‌گیرد."
          ],
          "fa.moezzi": [
            "بنشانید زنان را آنجا که خود نشستید از دارائی خویش (یا از گشایش خویش) و نیازاریدشان که تنگ بر ایشان گیرید و اگر باشند بارداران پس هزینه کنید بر ایشان تا بنهند بار خود را و اگر شیر دادند برای شما بپردازید بدیشان مزدهای ایشان را و بسازید با همدیگر به خوشی و اگر سخت باشد شما را زود است شیر دهدش دیگری‌"
          ],
          "fa.mojtabavi": [
            "آنان- زنان طلاق‌داده- را [تا سر آمد عدّه‌شان‌] آنجا سكونت دهيد كه خود سكونت مى‌كنيد از همان توانايى كه داريد و به ايشان گزند مرسانيد- در نفقه و مسكن- تا بر آنها تنگ گيريد- كه از آنجا بيرون روند- و اگر بار دارند بر آنها هزينه كنيد تا بار خويش بنهند. پس اگر كودكان شما را شير دادند، مزدشان را بدهيد و با يكديگر به شايستگى و خوبى مشورت و سازش كنيد- در شيردادن مادر و پرداخت اجرت از سوى پدر- و اگر دشوارى كنيد- به توافق نرسيديد- زنى ديگر بايد او را شير دهد- پدر دايه بگيرد-."
          ],
          "fa.sadeqi": [
            "از آن‌گونه (مسکن) که (خود) سکونت داشتید - از موجودی و توانتان - آنان را سکنا دهید و به آنان آسیب (و زیان) مرسانید، تا عرصه را بر ایشان تنگ کنید و اگر باردارند نفقه‌شان را بدهید تا بارشان را فرونهند. پس اگر برای شما (فرزندانتان را) شیر دهند مزدشان را به ایشان بدهید، و (در این باره) به شایستگی میان خودتان مشورت کنید و اگر کارتان (در این مورد) با هم به دشواری کشید، به زودی زن دیگری برای او (انتخاب کنید)، پس او را شیر خواهد داد."
          ]
        }
      },
      {
        "index": 5224,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:65:7",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:5:3:152:7",
            "/books/al-kafi:6:8:2:12",
            "/books/al-kafi:1:3:32:5"
          ]
        },
        "text": [
          "لِيُنْفِقْ‌ ذُو سَعَةٍ مِنْ‌ سَعَتِهِ‌ وَ مَنْ‌ قُدِرَ عَلَيْهِ‌ رِزْقُهُ‌ فَلْيُنْفِقْ‌ مِمَّا آتَاهُ‌ اللَّهُ‌ لاَ يُکَلِّفُ‌ اللَّهُ‌ نَفْساً إِلاَّ مَا آتَاهَا سَيَجْعَلُ‌ اللَّهُ‌ بَعْدَ عُسْرٍ يُسْراً"
        ],
        "translations": {
          "en.ahmedali": [
            "Let the man of means spend according to his means, and he whose means are limited, should spend of what God has given him. God does not burden a soul beyond what He has given him. God will bring ease after hardship."
          ],
          "en.ahmedraza": [
            "Whoever has the capacity must give provisions according to his means; and the one whose sustenance is restricted upon him, must give provisions from what Allah has given him; Allah does not burden any soul except according to what He has given it; Allah will soon, after the hardship, create ease."
          ],
          "en.arberry": [
            "Let the man of plenty expend out of his plenty. As for him whose provision is stinted to him, let him expend of what God has given him. God charges no soul save with what He has given him. God will assuredly appoint, after difficulty, easiness."
          ],
          "en.daryabadi": [
            "Let the man of means expend according to his means; and whosoever is stinted in his subsistence let him expend of that which Allah hath given him. Allah tasketh not a soul except according to that which He hath vouchsafed it. Anon Allah will appoint after hardship ease."
          ],
          "en.hilali": [
            "Let the rich man spend according to his means, and the man whose resources are restricted, let him spend according to what Allah has given him. Allah puts no burden on any person beyond what He has given him. Allah will grant after hardship, ease."
          ],
          "en.itani": [
            "The wealthy shall spend according to his means; and he whose resources are restricted shall spend according to what God has given him. God never burdens a soul beyond what He has given it. God will bring ease after hardship."
          ],
          "en.maududi": [
            "Whoever has abundant means, let him spend according to his means; and he whose means are straitened, let him spend out of what Allah has given him. Allah does not burden any human being beyond the means that He has bestowed upon him. Possibly Allah will grant ease after hardship."
          ],
          "en.mubarakpuri": [
            "Let the rich man spend according to his means; and the man whose resources are restricted, let him spend according to what Allah has given him. Allah puts no burden on any person beyond what He has given him. Allah will grant after hardship, ease."
          ],
          "en.pickthall": [
            "Let him who hath abundance spend of his abundance, and he whose provision is measured, let him spend of that which Allah hath given him. Allah asketh naught of any soul save that which He hath given it. Allah will vouchsafe, after hardship, ease."
          ],
          "en.qarai": [
            "Let the affluent man spend out of his affluence, and let he whose provision has been tightened spend out of what Allah has given him. Allah does not task any soul except [according to] what He has given it. Allah will bring about ease after hardship."
          ],
          "en.qaribullah": [
            "Let the rich spend according to his wealth and for he whose provision is little, let him spend from what Allah has given him. Allah does not charge a soulexcept with that He has given him. Surely, Allah will bring ease after difficulty."
          ],
          "en.sahih": [
            "Let a man of wealth spend from his wealth, and he whose provision is restricted - let him spend from what Allah has given him. Allah does not charge a soul except [according to] what He has given it. Allah will bring about, after hardship, ease."
          ],
          "en.sarwar": [
            "Let the well-to-do people spend abundantly (for the mother and the child) and let the poor spend from what God has given them. God does not impose on any soul that which he cannot afford. God will bring about ease after hardship."
          ],
          "en.shakir": [
            "Let him who has abundance spend out of his abundance and whoever has his means of subsistence straitened to him, let him spend out of that which Allah has given him; Allah does not lay on any soul a burden except to the extent to which He has granted it; Allah brings about ease after difficulty."
          ],
          "en.transliteration": [
            "Liyunfiq <u>th</u>oo saAAatin min saAAatihi waman qudira AAalayhi rizquhu falyunfiq mimm<u>a</u> <u>a</u>t<u>a</u>hu All<u>a</u>hu l<u>a</u> yukallifu All<u>a</u>hu nafsan ill<u>a</u> m<u>a</u> <u>a</u>t<u>a</u>h<u>a</u> sayajAAalu All<u>a</u>hu baAAda AAusrin yusr<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "let the man of means spend in accordance with his means; and let him whose resources are restricted, spend in accordance with what God has given him. God does not burden any person with more than He has given him. God will soon bring about ease after hardship."
          ],
          "en.yusufali": [
            "Let the man of means spend according to his means: and the man whose resources are restricted, let him spend according to what Allah has given him. Allah puts no burden on any person beyond what He has given him. After a difficulty, Allah will soon grant relief."
          ],
          "fa.ansarian": [
            "بر توانگر است که از توانگری اش [همسر بچه دارش را در ایام عدّه] هزینه دهد، و هر که رزق و روزی اش تنگ باشد از همان که خدا به او عطا کرده هزینه دهد. خدا هیچ کس را جز به اندازه رزقی که به او عطا کرده است، تکلیف نمی کند. خدا به زودی پس از سختی و تنگنا، فراخی و گشایش قرار می دهد."
          ],
          "fa.ayati": [
            "هر مالدارى از مال خود نفقه دهد، و كسى كه تنگدست باشد، از هر چه خدا به او داده است نفقه دهد. خدا هيچ كسى را مگر به آن اندازه كه به او داده است مكلف نمى‌سازد، و زودا كه خدا پس از سختى آسانى پيش آورد."
          ],
          "fa.bahrampour": [
            "صاحب وسعت بايد از وسعت خود انفاق كند و هر كه تنگدست باشد، بايد از آنچه خدايش داده انفاق كند. خدا هيچ كس را جز به اندازه‌اى كه به او داده تكليف نمى‌كند. زودا كه خدا پس از دشوارى آسانى پيش آورد"
          ],
          "fa.fooladvand": [
            "بر توانگر است كه از دارايى خود هزينه كند، و هر كه روزى او تنگ باشد بايد از آنچه خدا به او داده خرج كند. خدا هيچ كس را جز [به قدر] آنچه به او داده است تكليف نمى‌كند. خدا به زودى پس از دشوارى آسانى فراهم مى‌كند."
          ],
          "fa.ghomshei": [
            "مرد دارا به وسعت و فراوانی نفقه زن شیرده دهد، و آن که نادار و تنگ معیشت است از آنچه خدا به او داده انفاق کند. که خدا هیچ کس را جز به مقدار آنچه (توانایی) داده تکلیف نمی‌کند، و خدا به زودی بعدِ هر سختی آسانی قرار دهد."
          ],
          "fa.khorramdel": [
            "آنان که دارا هستند، از دارائی خود (برای زن شیر دهنده، به اندازه‌ی توان خود) خرج کنند، و آنان که تنگدست هستند، از چیزی که خدا بدیشان داده است خرج کنند، خداوند هیچ کسی را جز بدان اندازه که بدو داده است مکلّف نمی‌سازد. خدا بعد از سختی و ناخوشی، گشایش و خوشی پیش می‌آورد. [[«ذُوسَعَةٍ»: دارا. ثروتمند. «قُدِرَ عَلَیْهِ رِزْقُهُ»: روزی او کم گردید و فقیر شد (رعد / 26، اسراء / 30، قصص / 82).]]"
          ],
          "fa.khorramshahi": [
            "تا توانگر بر وفق توان خود خرج کند و کسی که روزی‌اش تنگ شده است، در همان حد که خداوند به او بخشیده است خرج کند، خداوند بر هیچ کس جز بر وفق آنچه به او بخشیده است، تکلیف نمی‌کند، زودا که خداوند پس از تنگنا، آسایش مقرر دارد"
          ],
          "fa.makarem": [
            "آنان که امکانات وسیعی دارند، باید از امکانات وسیع خود انفاق کنند و آنها که تنگدستند، از آنچه که خدا به آنها داده انفاق نمایند؛ خداوند هیچ کس را جز به مقدار توانایی که به او داده تکلیف نمی‌کند؛ خداوند بزودی بعد از سختیها آسانی قرار می‌دهد!"
          ],
          "fa.moezzi": [
            "باید هزینه کند گشایشمند از گشایش خویش و آنکه تنگ شده است بر او روزی پس باید بدهد از آنچه خدایش داده است تکلیف نکند خدا کسی را جز آنچه بدادش زود است نهد خدا پس از تنگی گشایشی‌"
          ],
          "fa.mojtabavi": [
            "فراخدست از فراخدستى خود هزينه كند، و هر كه روزى‌اش بر او تنگ شده باشد از آنچه خداوند به او داده است هزينه كند- يعنى به اندازه توان خود- خدا هيچكس را تكليف نمى‌كند مگر [به اندازه‌] آنچه به او داده است. خداوند پس از سختى و دشوارى آسانى و فراخى پديد خواهد آورد."
          ],
          "fa.sadeqi": [
            "هر که دارای گشایش است باید از گشایشش هزینه کند و هر که روزیش تنگ شده، باید از آنچه خدا به او داده هزینه کند. خدا هیچ کس را جز (به اندازه‌ی) آنچه به او داده است تکلیف نمی‌کند. خدا به زودی پس از دشواری آسانی می‌نهد."
          ]
        }
      },
      {
        "index": 5225,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:65:8",
        "text": [
          "وَ کَأَيِّنْ‌ مِنْ‌ قَرْيَةٍ عَتَتْ‌ عَنْ‌ أَمْرِ رَبِّهَا وَ رُسُلِهِ‌ فَحَاسَبْنَاهَا حِسَاباً شَدِيداً وَ عَذَّبْنَاهَا عَذَاباً نُکْراً"
        ],
        "translations": {
          "en.ahmedali": [
            "How many habitations rebelled against their Lord's command and His apostles; but We took them to severe task, and punished them with the harshest punishment."
          ],
          "en.ahmedraza": [
            "And many a town existed that rebelled against the command of its Lord and His Noble Messengers, so We took a severe account from it – and struck them with a dreadful punishment."
          ],
          "en.arberry": [
            "How many a city turned in disdain from the commandment of its Lord and His Messengers; and then We made with it a terrible reckoning and chastised it with a horrible chastisement."
          ],
          "en.daryabadi": [
            "And how many a city trespassed the commandment of its Lord and His apostles! Wherefore We reckoned with them a stern reckoning, and We tormented them With a torment unheard of."
          ],
          "en.hilali": [
            "And many a town (population) revolted against the Command of its Lord and His Messengers, and We called it to a severe account (i.e. torment in this worldly life), and shall punish it with a horrible torment (in Hell, in the Hereafter)."
          ],
          "en.itani": [
            "How many a town defied the command of its Lord and His messengers? So We held it strictly accountable, and We punished it with a dreadful punishment."
          ],
          "en.maududi": [
            "How many towns rebelled against the commandment of their Lord and His Messengers. Then We called them to a stern accounting, and subjected them to a harrowing chastisement."
          ],
          "en.mubarakpuri": [
            "And many a town revolted against the command of its Lord and His Messengers; and We called it to a severe account, and We shall punish it with a horrible torment."
          ],
          "en.pickthall": [
            "And how many a community revolted against the ordinance of its Lord and His messengers, and We called it to a stern account and punished it with dire punishment,"
          ],
          "en.qarai": [
            "How many a town defied the command of its Lord and His apostles, then We called it to a severe account and punished it with a dire punishment."
          ],
          "en.qaribullah": [
            "How many a village has turned in its pride against the Order of their Lord and His Messengers! We made it a stern reckoning, and punished it with a horrible punishment."
          ],
          "en.sahih": [
            "And how many a city was insolent toward the command of its Lord and His messengers, so We took it to severe account and punished it with a terrible punishment."
          ],
          "en.sarwar": [
            "How many a town has disobeyed its Lord and His Messenger! For them Our questioning was strict and Our punishment severe."
          ],
          "en.shakir": [
            "And how many a town which rebelled against the commandment of its Lord and His apostles, so We called it to account severely and We chastised it (with) a stern chastisement."
          ],
          "en.transliteration": [
            "Wakaayyin min qaryatin AAatat AAan amri rabbih<u>a</u> warusulihi fa<u>ha</u>sabn<u>a</u>h<u>a</u> <u>h</u>is<u>a</u>ban shadeedan waAAa<u>thth</u>abn<u>a</u>h<u>a</u> AAa<u>tha</u>ban nukr<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "How many a town rebelled against the commands of its Lord and His messengers and We called them sternly to account and punished them severely,"
          ],
          "en.yusufali": [
            "How many populations that insolently opposed the Command of their Lord and of His messengers, did We not then call to account,- to severe account?- and We imposed on them an exemplary Punishment."
          ],
          "fa.ansarian": [
            "چه بسیار آبادی ها که [اهلش] از فرمان پروردگارشان و فرستادگانش روی برگرداندند، پس ما آنان را به حساب سختی محاسبه کردیم و به عذاب بسیار شدیدی عذاب نمودیم؛"
          ],
          "fa.ayati": [
            "چه بسا مردم قريه‌اى كه از فرمان پرردگارشان و پيامبرانش سرباز زدند. آنگاه ما سخت از آنها حساب كشيديم و به عذابى سهمناك عذابشان كرديم."
          ],
          "fa.bahrampour": [
            "و چه بسيار شهرها كه از فرمان پروردگار خود و پيامبرانش سرپيچيدند، پس از آنها حسابى سخت كشيديم و آنها را به عذابى شديد عذاب كرديم"
          ],
          "fa.fooladvand": [
            "و چه بسيار شهرها كه از فرمان پروردگار خود و پيامبرانش سر پيچيدند و از آنها حسابى سخت كشيديم و آنان را به عذابى [بس‌] زشت عذاب كرديم."
          ],
          "fa.ghomshei": [
            "و چه بسیار مردم دیاری که از امر خدا و رسولانش سرپیچیدند (و کافر شدند) ما هم آنان را به حساب سخت مؤاخذه کردیم و به عذاب بسیار شدید معذّب ساختیم."
          ],
          "fa.khorramdel": [
            "چه بسیار مردمان شهرها و آبادیهائی که از فرمان پروردگارشان و دستور پیغمبران او، سرپیچی و سرکشی کرده‌اند، و در نتیجه ما سخت به حسابشان رسیده‌ایم و به مجازات ناگوار و کیفر ناخوشایندشان رسانده‌ایم. [[«کَأَیِّن مِّن قَرْیَةٍ»: (نگا: حجّ / 45 و 48، محمّد / 13). «حَاسَبْنَاهَا»: از آن حساب کشیده‌ایم. به حسابشان رسیده‌ایم. «عَتَتْ»: سرکشی کرده‌اند (نگا: اعراف / 77 و 166، فرقان / 21). «نُکْراً»: (نگا: کهف / 74 و 87).]]"
          ],
          "fa.khorramshahi": [
            "و چه بسا شهرها که [اهالی آن‌] از فرمان پروردگارش و پیامبران او سرپیچید، آنگاه به سختی از آنان حساب کشیدیم، و به عذابی بی‌مانند معذبشان داشتیم‌"
          ],
          "fa.makarem": [
            "چه بسیار شهرها و آبادیها که اهل آن از فرمان خدا و رسولانش سرپیچی کردند و ما بشدّت به حسابشان رسیدیم و به مجازات کم‌نظیری گرفتار ساختیم!"
          ],
          "fa.moezzi": [
            "و بسا شهری که سرپیچید از فرمان پروردگار خود و فرستادگانش پس رسیدیم حسابش را حسابی سخت و شکنجه کردیمش شکنجه‌ای زشت‌"
          ],
          "fa.mojtabavi": [
            "و بسا [مردم‌] ديه و شهر كه از فرمان پروردگارشان و فرستادگان او سر باززدند پس سخت به حساب آنها رسيديم و عذابشان كرديم عذابى دشوار و ناشناخته."
          ],
          "fa.sadeqi": [
            "و چه بسیار (از) گروه‌ها که از فرمان پروردگارشان و از پیامبرانش سرپیچیدند. پس‌، از آنها حسابی سخت کشیدیم و آنان را به عذابی بس (ناهنجار و) منکر دچار کردیم."
          ]
        }
      },
      {
        "index": 5226,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:65:9",
        "text": [
          "فَذَاقَتْ‌ وَبَالَ‌ أَمْرِهَا وَ کَانَ‌ عَاقِبَةُ أَمْرِهَا خُسْراً"
        ],
        "translations": {
          "en.ahmedali": [
            "So they tasted the pain of their actions; and the consequence of their deeds was ruin."
          ],
          "en.ahmedraza": [
            "They therefore tasted the evil outcome of their deeds, and the outcome of their deeds was a loss."
          ],
          "en.arberry": [
            "So it tasted the mischief of its action, and the end of its affair was loss."
          ],
          "en.daryabadi": [
            "Wherefore they tasted the evil consequence of their affair, and the end of their affair was loss."
          ],
          "en.hilali": [
            "So it tasted the evil result of its disbelief, and the consequence of its disbelief was loss (destruction in this life and an eternal punishment in the Hereafter)."
          ],
          "en.itani": [
            "It tasted the result of its decisions, and the outcome of its decisions was perdition."
          ],
          "en.maududi": [
            "So they tasted the evil fruit of their deeds; and the fruit of their deeds was utter loss."
          ],
          "en.mubarakpuri": [
            "So it tasted the evil result of its affair, and the consequence of its affair was loss."
          ],
          "en.pickthall": [
            "So that it tasted the ill-effects of its conduct, and the consequence of its conduct was loss."
          ],
          "en.qarai": [
            "So it tasted the evil consequences of its conduct, and the outcome of its conduct was ruin."
          ],
          "en.qaribullah": [
            "So it tasted the mischief of its action, and the end of its matter was loss."
          ],
          "en.sahih": [
            "And it tasted the bad consequence of its affair, and the outcome of its affair was loss."
          ],
          "en.sarwar": [
            "They suffered the consequences of their deeds and their end was perdition."
          ],
          "en.shakir": [
            "So it tasted the evil result of its conduct, and the end of its affair was perdition."
          ],
          "en.transliteration": [
            "Fa<u>tha</u>qat wab<u>a</u>la amrih<u>a</u> wak<u>a</u>na AA<u>a</u>qibatu amrih<u>a</u> khusr<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "so they tasted the evil consequences of their conduct and the result of their conduct was ruin."
          ],
          "en.yusufali": [
            "Then did they taste the evil result of their conduct, and the End of their conduct was Perdition."
          ],
          "fa.ansarian": [
            "و آنان کیفر سنگین کفر و کبرشان را چشیدند و سرانجام کارشان خسارت بود."
          ],
          "fa.ayati": [
            "پس عقوبت عمل خود را چشيدند. عاقبت كارشان زيانكارى بود."
          ],
          "fa.bahrampour": [
            "پس سزاى كار خود را چشيدند و پايان كارشان خسران بود"
          ],
          "fa.fooladvand": [
            "تا كيفر زشت عمل خود را چشيدند، و پايان كارشان زيان بود."
          ],
          "fa.ghomshei": [
            "تا کیفر کردار خود چشیدند و عاقبت کارشان زیانکاری (و حسرت) گردید."
          ],
          "fa.khorramdel": [
            "و عقوبت اعمالشان را چشیده‌اند، و عاقبت کار و بارشان زیان و خسران بوده است. [[«وَ بَالَ»: (نگا: مائده / 95، حشر / 15، تغابن / 5). «خُسْراً»: زیان. زیانکاری.]]"
          ],
          "fa.khorramshahi": [
            "بدین‌سان عقوبت کار خود را چشید و عاقبت کارش زیان بود"
          ],
          "fa.makarem": [
            "آنها آثار سوء کار خود را چشیدند؛ و عاقبت کارشان خسران بود!"
          ],
          "fa.moezzi": [
            "پس چشید فرجام کار خویش را و شد پایان کار او زیانکاری‌"
          ],
          "fa.mojtabavi": [
            "پس سرانجامِ بدِ كارِ خود را چشيدند و عاقبت كارشان زيانكارى بود."
          ],
          "fa.sadeqi": [
            "پس کیفر زشت عمل خود را چشیدند و پایان کارشان زیان بود."
          ]
        }
      },
      {
        "index": 5227,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:65:10",
        "text": [
          "أَعَدَّ اللَّهُ‌ لَهُمْ‌ عَذَاباً شَدِيداً فَاتَّقُوا اللَّهَ‌ يَا أُولِي‌ الْأَلْبَابِ‌ الَّذِينَ‌ آمَنُوا قَدْ أَنْزَلَ‌ اللَّهُ‌ إِلَيْکُمْ‌ ذِکْراً"
        ],
        "translations": {
          "en.ahmedali": [
            "God has prepared for them severe punishment. So, you men of wisdom, and those who believe, take heed for yourselves and fear God. God has indeed sent down a Reminder for you,"
          ],
          "en.ahmedraza": [
            "Allah has kept prepared a severe punishment for them – therefore fear Allah, O men of intellect! O People who Believe! Allah has sent down a Remembrance (or an honour) for you. (The Holy Prophet is a Remembrance from Allah.)"
          ],
          "en.arberry": [
            "God prepared for them a terrible chastisement. So fear God, O men possessed of minds! Believers, God has sent down to you, for a remembrance,"
          ],
          "en.daryabadi": [
            "Allah hath gotten ready for them a grievous torment; so fear Allah, O men of understanding! those who have believed. Surely He hath sent down Unto you an admonition."
          ],
          "en.hilali": [
            "Allah has prepared for them a severe torment. So fear Allah and keep your duty to Him, O men of understanding who have believed! - Allah has indeed sent down to you a Reminder (this Quran)."
          ],
          "en.itani": [
            "God has prepared for them a severe retribution. So beware of God, O you who possess intellect and have faith. God has sent down to you a Reminder."
          ],
          "en.maududi": [
            "Allah has laid in store for them a grievous chastisement. So fear Allah, O people of understanding who have attained to faith. Allah has sent down to you an Exhortation,"
          ],
          "en.mubarakpuri": [
            "Allah has prepared for them a severe torment. So have Taqwa of Allah, O men of understanding, those who believe! Allah has indeed sent down to you a Reminder."
          ],
          "en.pickthall": [
            "Allah hath prepared for them stern punishment; so keep your duty to Allah, O men of understanding! O ye who believe! Now Allah hath sent down unto you a reminder,"
          ],
          "en.qarai": [
            "Allah has prepared for them a severe punishment. So be wary of Allah, O you who possess intellect and have faith! Allah has already sent down to you a reminder,"
          ],
          "en.qaribullah": [
            "Allah has prepared a severe punishment for them. So those possessing understanding fear Allah. Believers, Allah has sent this down for you as a Reminder,"
          ],
          "en.sahih": [
            "Allah has prepared for them a severe punishment; so fear Allah, O you of understanding who have believed. Allah has sent down to you the Qur'an."
          ],
          "en.sarwar": [
            "God has prepared severe retribution for them. People of understanding and believers, have fear of God. God has certainly sent you a reminder,"
          ],
          "en.shakir": [
            "Allah has prepared for them severe chastisement, therefore be careful of (your duty to) Allah, O men of understanding who believe! Allah has indeed revealed to you a reminder,"
          ],
          "en.transliteration": [
            "aAAadda All<u>a</u>hu lahum AAa<u>tha</u>ban shadeedan fa<b>i</b>ttaqoo All<u>a</u>ha y<u>a</u> olee alalb<u>a</u>bi alla<u>th</u>eena <u>a</u>manoo qad anzala All<u>a</u>hu ilaykum <u>th</u>ikr<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "God has prepared a severe punishment for them. So, fear God, O men of understanding, who have believed. God has sent down to you a Reminder"
          ],
          "en.yusufali": [
            "Allah has prepared for them a severe Punishment (in the Hereafter). Therefore fear Allah, O ye men of understanding - who have believed!- for Allah hath indeed sent down to you a Message,-"
          ],
          "fa.ansarian": [
            "خدا برای آنان [در آخرت] عذابی سخت آماده کرده است، پس ای خردمندان مؤمن! از خدا پروا کنید. به راستی خدا به سوی شما وسیله تذکر نازل کرده است."
          ],
          "fa.ayati": [
            "خداوند برايشان عذابى سخت آماده كرد. پس اى خردمندانى كه ايمان آورده‌ايد، از خدا بترسيد. خدا بر شما قرآن را نازل كرده است."
          ],
          "fa.bahrampour": [
            "خدا براى آنها عذابى سخت آماده كرده است. پس اى خردمندانى كه ايمان آورده‌ايد! از خدا بترسيد. همانا خدا به سوى شما تذكارى نازل كرده است"
          ],
          "fa.fooladvand": [
            "خدا براى آنان عذابى سخت آماده كرده است. پس اى خردمندانى كه ايمان آورده‌ايد، از خدا بترسيد. راستى كه خدا سوى شما تذكارى فرو فرستاده است:"
          ],
          "fa.ghomshei": [
            "(و) خدا بر آنان عذاب سخت (جهنم) مهیّا ساخت، پس شما ای خردمندانی که ایمان آورده‌اید از خدا بترسید (و راه طاعت پیش گیرید) که خدا برای (هدایت) شما ذکر (یعنی قرآن) نازل کرد."
          ],
          "fa.khorramdel": [
            "خداوند برای ایشان عذاب شدیدی را فراهم ساخته است، پس ای خردمندانی که مؤمن هستید، شما پرهیزگاری کنید و خویشتن را از (عذاب و خشم) خدا به دور دارید. خدا که برای شما قرآن را نازل فرموده است. [[«ذِکْراً»: قرآن (نگا: اعراف / 63 و 69، حجر / 6 و 9). «الَّذِینَ»: صفت یا بدل (أُوْلی‌الألْبَابِ) است.]]"
          ],
          "fa.khorramshahi": [
            "خداوند برای آنان عذابی سهمگین آماده کرده است، پس ای خردمندان مؤمن از خداوند پروا کنید، به راستی که خداوند به سوی شما پندآموزی فرستاده است‌"
          ],
          "fa.makarem": [
            "خداوند عذاب سختی برای آنها فراهم ساخته؛ پس از (مخالفت فرمان) خدا بپرهیزید ای خردمندانی که ایمان آورده‌اید! (زیرا) خداوند چیزی که مایه تذکّر است بر شما نازل کرده؛"
          ],
          "fa.moezzi": [
            "آماده کرد خدا برای ایشان عذابی سخت پس بترسید خدا را ای خردمندان آنان که ایمان آوردید همانا فرستاد خدا بسوی شما ذکری (یادداشتی)"
          ],
          "fa.mojtabavi": [
            "خداوند براى آنان- مشركان و كافران- عذابى سخت- عذاب دوزخ- آماده كرده است پس اى خردمندان كه ايمان آورده‌ايد از خداى پروا كنيد، همانا خدا به سوى شما ياد و پندى- قرآن- فروفرستاده است"
          ],
          "fa.sadeqi": [
            "خدا برای آنان عذابی سخت آماده کرده است. پس ای خردمندان که ایمان آوردید! از خدا پروا بدارید. به‌راستی خدا فراسوی شما یادواره‌ای فرو فرستاده است؛"
          ]
        }
      },
      {
        "index": 5228,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:65:11",
        "text": [
          "رَسُولاً يَتْلُو عَلَيْکُمْ‌ آيَاتِ‌ اللَّهِ‌ مُبَيِّنَاتٍ‌ لِيُخْرِجَ‌ الَّذِينَ‌ آمَنُوا وَ عَمِلُوا الصَّالِحَاتِ‌ مِنَ‌ الظُّلُمَاتِ‌ إِلَى‌ النُّورِ وَ مَنْ‌ يُؤْمِنْ‌ بِاللَّهِ‌ وَ يَعْمَلْ‌ صَالِحاً يُدْخِلْهُ‌ جَنَّاتٍ‌ تَجْرِي‌ مِنْ‌ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ‌ فِيهَا أَبَداً قَدْ أَحْسَنَ‌ اللَّهُ‌ لَهُ‌ رِزْقاً"
        ],
        "translations": {
          "en.ahmedali": [
            "An Apostle who recites before you the explicating revelations of God that He may bring those who believe and do the right out of darkness into light. Whosoever believes in God and does the right, He will admit into gardens with rivers flowing by, where they will abide for ever. How excellent a provision has God made for him"
          ],
          "en.ahmedraza": [
            "The Noble Messenger who recites the clear verses of Allah to you, so that he may take those who accept faith and do good deeds, away from the realms of darkness towards light; and whoever accepts faith in Allah and does good deeds, Allah will admit him into Gardens beneath which rivers flow, to abide in them for ever and ever; indeed Allah has kept an excellent sustenance for him."
          ],
          "en.arberry": [
            "a Messenger reciting to you the signs of God, clear signs, that He may bring forth those who believe and do righteous deeds from the shadows into the light. Whosoever believes in God, and does righteousness, He will admit him to gardens underneath which rivers flow; therein they shall dwell for ever and ever. God has made for him a goodly provision."
          ],
          "en.daryabadi": [
            "An apostle reciting Unto you the revelations of Allah as evidences, that he may bring forth those who believe and work righteous works from darknesses into light. And whosoever believeth in Allah and worketh righteously, him He will cause to enter Gardens whereunder rivers flow, as abiders for evermore. Surely Allah hath made for him an excellent provision."
          ],
          "en.hilali": [
            "(And has also sent to you) a Messenger (Muhammad SAW), who recites to you the Verses of Allah (the Quran) containing clear explanations, that He may take out, those who believe and do righteous good deeds from the darkness (of polytheism and disbelief) to the light (of Monotheism and true Faith). And whosoever believes in Allah and performs righteous good deeds, He will admit him into Gardens under which rivers flow (Paradise), to dwell therein forever. Allah has indeed granted for him an excellent provision."
          ],
          "en.itani": [
            "A messenger who recites to you God’s Verses, clear and distinct, that he may bring those who believe and work righteousness from darkness into light. Whoever believes in God and acts with integrity, He will admit him into gardens beneath which rivers flow, therein to abide forever. God has given him an excellent provision."
          ],
          "en.maududi": [
            "a Messenger who rehearses to you Allah's verses that clearly expound the Guidance so that He may bring out those that believe and act righteously, from every kind of darkness into light. He will admit whosoever believes in Allah and acts righteously to Gardens beneath which rivers flow. They shall abide in them forever. For such has Allah made an excellent provision."
          ],
          "en.mubarakpuri": [
            "A Messenger, who recites to you the Ayat of Allah containing clear explanations, that He may take out those who believe and do righteous good deeds, from the darkness to the light. And whosoever believes in Allah and performs righteous deeds, He will admit him into Gardens under which rivers flow, to dwell therein forever. Allah has indeed granted for him an excellent provision."
          ],
          "en.pickthall": [
            "A messenger reciting unto you the revelations of Allah made plain, that He may bring forth those who believe and do good works from darkness unto light. And whosoever believeth in Allah and doeth right, He will bring him into Gardens underneath which rivers flow, therein to abide for ever. Allah hath made good provision for him."
          ],
          "en.qarai": [
            "an apostle reciting to you the manifest signs of Allah that He may bring out those who have faith and do righteous deeds from darkness into light. And whoever has faith in Allah and does righteous deeds, He shall admit him into gardens with streams running in them, to remain in them forever. Allah has certainly granted him an excellent provision."
          ],
          "en.qaribullah": [
            "a Messenger reciting to you the verses, clear verses of Allah, so that he may bring forth those who believe and do good deeds from the darkness into thelight. Whosoever believes in Allah and does good deeds He will admit to Gardens underneath which rivers flow where they shall live for ever and ever. For those, Allah has made a goodly provision."
          ],
          "en.sahih": [
            "[He sent] a Messenger [Muhammad] reciting to you the distinct verses of Allah that He may bring out those who believe and do righteous deeds from darknesses into the light. And whoever believes in Allah and does righteousness - He will admit him into gardens beneath which rivers flow to abide therein forever. Allah will have perfected for him a provision."
          ],
          "en.sarwar": [
            "a Messenger who recites to you the illustrious revelations of God, to bring the righteously striving believers out of darkness into light. God will admit those who believe in Him and act righteously to Paradise wherein streams flow, and they will live therein forever. God will provide them with excellent sustenance."
          ],
          "en.shakir": [
            "An Apostle who recites to you the clear communications of Allah so that he may bring forth those who believe and do good deeds from darkness into light; and whoever believes in Allah and does good deeds, He will cause him to enter gardens beneath which rivers now, to abide therein forever, Allah has indeed given him a goodly sustenance."
          ],
          "en.transliteration": [
            "Rasoolan yatloo AAalaykum <u>a</u>y<u>a</u>ti All<u>a</u>hi mubayyin<u>a</u>tin liyukhrija alla<u>th</u>eena <u>a</u>manoo waAAamiloo a<b>l</b><u>ssa</u>li<u>ha</u>ti mina a<b>l</b><i><u>thth</u></i>ulum<u>a</u>ti il<u>a</u> a<b>l</b>nnoori waman yumin bi<b>A</b>ll<u>a</u>hi wayaAAmal <u>sa</u>li<u>h</u>an yudkhilhu jann<u>a</u>tin tajree min ta<u>h</u>tih<u>a</u> alanh<u>a</u>ru kh<u>a</u>lideena feeh<u>a</u> abadan qad a<u>h</u>sana All<u>a</u>hu lahu rizq<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and a messenger who conveys to you God's clear messages, so that he might lead those, who believe and do good deeds, out of darkness into light. God will admit those who believe in Him and do good deeds into Gardens with rivers flowing through them, where they will remain forever. God has indeed made excellent provision for them."
          ],
          "en.yusufali": [
            "An Messenger, who rehearses to you the Signs of Allah containing clear explanations, that he may lead forth those who believe and do righteous deeds from the depths of Darkness into Light. And those who believe in Allah and work righteousness, He will admit to Gardens beneath which Rivers flow, to dwell therein for ever: Allah has indeed granted for them a most excellent Provision."
          ],
          "fa.ansarian": [
            "[و آن] پیامبری [است] که آیات روشن خدا را بر شما می خواند، تا کسانی را که ایمان آورده و کارهای شایسته انجام داده اند از تاریکی ها به سوی نور بیرون آورد. و هر کس به خدا ایمان بیاورد و کار شایسته انجام دهد، او را در بهشت هایی که از زیرِ [درختانِ] آن نهرها جاری است، درآورد، در حالی که در آنها جاودانه اند. همانا رزق و روزی را برای او نیکو قرار داده است."
          ],
          "fa.ayati": [
            "و پيامبرى كه آيات روشن خدا را برايتان مى‌خواند تا كسانى را كه ايمان آورده‌اند و كارهاى شايسته كرده‌اند از تاريكى به روشنايى آورد. و هر كه را به خدا ايمان آورد و كار شايسته كند به بهشتهايى در آورد كه در آن نهرها جارى است، همواره در آنجا بمانند و خدا روزيشان را كرامند گرداند."
          ],
          "fa.bahrampour": [
            "پيامبرى را كه آيات روشنگر خدا را بر شما تلاوت مى‌كند تا كسانى را كه ايمان آورده و كارهاى شايسته كرده‌اند از تاريكى‌ها به سوى روشنايى بيرون برد. و هر كس به خدا بگرود و كار شايسته كند او را به باغ‌هايى كه از پاى درختانش نهرها جارى است در آورد كه جاودان"
          ],
          "fa.fooladvand": [
            "پيامبرى كه آيات روشنگر خدا را بر شما تلاوت مى‌كند، تا كسانى را كه ايمان آورده و كارهاى شايسته كرده‌اند از تاريكيها به سوى روشنايى بيرون برد، و هر كس به خدا بگرود و كار شايسته كند او را در باغهايى كه از زير [درختان‌] آن جويبارها روان است، درمى‌آورد، جاودانه در آن مى‌مانند. قطعاً خدا روزى را براى او خوش كرده است."
          ],
          "fa.ghomshei": [
            "(و نیز فرستاد) رسول بزرگواری را که برای شما آیات روشن بیان خدا را تلاوت می‌کند تا آنان را که ایمان آورده و نیکوکار شدند از ظلمات (جهل) به سوی نور (معرفت و ایمان) باز آرد، و هر کس به خدا ایمان آورده و نیکوکار شود خدا او را در باغهای بهشتی در آرد که نهرها زیر درختانش جاری است و همیشه در آن بهشت ابد متنعّمند، که خدا (در آنجا) رزق بسیار نیکو بر او مهیّا ساخته است."
          ],
          "fa.khorramdel": [
            "و پیغمبری را به میانتان روانه کرده است که آیات روشن خدا را برایتان می‌خواند تا کسانی را که ایمان آورده‌اند و کارهای شایسته کرده‌اند از تاریکی (بطالت و ضلالت) بیرون آورد و به روشنائی (حقیقت و هدایت) در آورد. کسانی که به خدا ایمان بیاورند و کارهای پسندیده بکنند، خدا آنان را به باغهای بهشتی داخل می‌گرداند که از زیر (کاخها و درختان) آن رودبارها روان است. برای همیشه در آنجا ماندگار می‌مانند، و خدا روزیشان را خوب و نیکو می‌گرداند. [[«رَسُولاً»: مفعولٌ‌به برای فعل محذوفی است که مقام دلالت بر آن دارد. تقدیر چنین است: أَرْسَلَ رَسُولاً. «یَتْلُو»: در رسم‌الخطّ قرآنی الف زائدی به دنبال دارد. «أَبَداً»: ذکر این واژه پس از (خَالِدِینَ) تأکیدی بر خلود و ماندگاری محسوب است.]]"
          ],
          "fa.khorramshahi": [
            "پیامبری که آیات روشنگر الهی را بر شما می‌خواند، تا کسانی را که ایمان آورده‌اند و کارهای شایسته کرده‌اند، از تاریکیها به سوی روشنایی برآورد، و هر کس به خداوند ایمان آورد و نیکوکاری کند، او را به بوستانهایی که جویباران از فرودست آن جاری است، درآورد، و جاودانه در آنند، به راستی که خداوند روزی او را نیکو گردانده است‌"
          ],
          "fa.makarem": [
            "رسولی به سوی شما فرستاده که آیات روشن خدا را بر شما تلاوت می‌کند تا کسانی را که ایمان آورده و کارهای شایسته انجام داده‌اند، از تاریکیها بسوی نور خارج سازد! و هر کس به خدا ایمان آورده و اعمال صالح انجام دهد، او را در باغهایی از بهشت وارد سازد که از زیر (درختانش) نهرها جاری است، جاودانه در آن می‌مانند، و خداوند روزی نیکویی برای او قرار داده است!"
          ],
          "fa.moezzi": [
            "پیمبری که بسراید بر شما آیتهای خدا را روشن تا برون آورد آنان را که ایمان آوردند و کردار شایسته کردند از تاریکیها بسوی روشنائی و آنکه ایمان آرد به خدا و بکند کاری شایسته درآردش باغهائی که روان است زیر آنها جویها جاودانان در آن همیشه به راستی نکو کرده است خدا برایش روزی را"
          ],
          "fa.mojtabavi": [
            "[و نيز بفرستاد] پيامبرى كه آيات روشن و روشنگر خدا را بر شما مى‌خواند تا كسانى را كه ايمان آورده‌اند و كارهاى شايسته كرده‌اند از تاريكيها به روشنايى بيرون آرد. و هر كه به خدا ايمان آورد و كار شايسته كند او را به بهشتهايى درآرد كه از زير آنها جويها روان است، هميشه در آنجا جاودانه اند. همانا خدا روزى او را نيكو ساخته است."
          ],
          "fa.sadeqi": [
            "فرستاده‌ای که آیات روشنگر خدا را بر شما تلاوت می‌کند، تا کسانی را که ایمان آوردند و کارهای شایسته(ی ایمان) کردند از تاریکی‌ها سوی روشنایی بیرون برد و هر کس به خدا بگرود و کار شایسته کند او را در باغ‌هایی- سردرهم- که از زیر (درختان)شان نهرها روان است، در می‌آورد (که) جاودانه برای همیشه در آن هم‌چنان ماندنی هستند. بی‌گمان خدا روزی‌ای را برایش به‌خوبی آورده است."
          ]
        }
      },
      {
        "index": 5229,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:65:12",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:35:1"
          ]
        },
        "text": [
          "اللَّهُ‌ الَّذِي‌ خَلَقَ‌ سَبْعَ‌ سَمَاوَاتٍ‌ وَ مِنَ‌ الْأَرْضِ‌ مِثْلَهُنَ‌ يَتَنَزَّلُ‌ الْأَمْرُ بَيْنَهُنَ‌ لِتَعْلَمُوا أَنَ‌ اللَّهَ‌ عَلَى‌ کُلِ‌ شَيْ‌ءٍ قَدِيرٌ وَ أَنَ‌ اللَّهَ‌ قَدْ أَحَاطَ بِکُلِ‌ شَيْ‌ءٍ عِلْماً"
        ],
        "translations": {
          "en.ahmedali": [
            "It is God who created several skies, and as many earths. The commandment is sent down among them so that you may know that God has power over everything, and everything is held within the knowledge of God."
          ],
          "en.ahmedraza": [
            "It is Allah Who has created the seven heavens, and seven earthly worlds like them; the command descends within them, so that you may know that Allah is Able to do all things, and that Allah’s knowledge encompasses everything."
          ],
          "en.arberry": [
            "It is God who created seven heavens, and of earth their like, between them the Command descending, that you may know that God is powerful over everything and that God encompasses everything in knowledge."
          ],
          "en.daryabadi": [
            "Allah it is Who hath created seven heavens, and of the earth the like thereof; the commandment cometh down between them, that ye may know that Allah is over everything Potent, and that Allah! He encompasseth everything in knowledge."
          ],
          "en.hilali": [
            "It is Allah Who has created seven heavens and of the earth the like thereof (i.e. seven). His Command descends between them (heavens and earth), that you may know that Allah has power over all things, and that Allah surrounds (comprehends) all things in (His) Knowledge."
          ],
          "en.itani": [
            "God is He Who created seven heavens, and their like of earth. The command descends through them, so that you may know that God is Capable of everything, and that God Encompasses everything in knowledge."
          ],
          "en.maududi": [
            "Allah it is He Who created seven heavens, and, like them, the earth. His commandment descends among them. (All this is being stated so that you know) that Allah has power over everything, and that Allah encompasses all things in His knowledge."
          ],
          "en.mubarakpuri": [
            "It is Allah Who has created seven heavens and of the earth the like thereof. His command descends between them, that you may know that Allah has power over all things, and that Allah surrounds all things with (His) knowledge."
          ],
          "en.pickthall": [
            "Allah it is who hath created seven heavens, and of the earth the like thereof. The commandment cometh down among them slowly, that ye may know that Allah is Able to do all things, and that Allah surroundeth all things in knowledge."
          ],
          "en.qarai": [
            "It is Allah who has created seven heavens, and of the earth [a number] similar to them. The command gradually descends through them, that you may know that Allah has power over all things, and that Allah comprehends all things in knowledge."
          ],
          "en.qaribullah": [
            "It is Allah who has created the seven heavens, and of the earth their like, and the Command descends between them so that you know Allah is powerful over all things, and that Allah encompasses everything in knowledge."
          ],
          "en.sahih": [
            "It is Allah who has created seven heavens and of the earth, the like of them. [His] command descends among them so you may know that Allah is over all things competent and that Allah has encompassed all things in knowledge."
          ],
          "en.sarwar": [
            "It is God who has created the seven heavens and a like number of earths. His commandments are sent between them, so that you would know that God has power over all things and that His knowledge encompasses all."
          ],
          "en.shakir": [
            "Allah is He Who created seven heavens, and of the earth the like of them; the decree continues to descend among them, that you may know that Allah has power over all things and that Allah indeed encompasses all things in (His) knowledge."
          ],
          "en.transliteration": [
            "All<u>a</u>hu alla<u>th</u>ee khalaqa sabAAa sam<u>a</u>w<u>a</u>tin wamina alar<u>d</u>i mithlahunna yatanazzalu alamru baynahunna litaAAlamoo anna All<u>a</u>ha AAal<u>a</u> kulli shayin qadeerun waanna All<u>a</u>ha qad a<u>hat</u>a bikulli shayin AAilm<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "It is God who created the seven heavens and the same number of earths. His commandment descends among them, so that you may know that God has power over all things;  and that He encompasses all things with His knowledge."
          ],
          "en.yusufali": [
            "Allah is He Who created seven Firmaments and of the earth a similar number. Through the midst of them (all) descends His Command: that ye may know that Allah has power over all things, and that Allah comprehends, all things in (His) Knowledge."
          ],
          "fa.ansarian": [
            "خداست که هفت آسمان و نیز مثل آنها هفت زمین را آفرید. همواره فرمان او در میان آنها نازل می شود تا بدانید که خدا بر هر کاری تواناست و اینکه یقیناً علم خدا به همه چیز احاطه دارد."
          ],
          "fa.ayati": [
            "خداست آن كه هفت آسمان و همانند آنها زمين بيافريد. فرمان او ميان آسمانها و زمين جارى است تا بدانيد كه خدا بر هر چيز قادر است و به علم بر همه چيز احاطه دارد."
          ],
          "fa.bahrampour": [
            "خدا كسى است كه هفت آسمان را آفريد و از زمين نيز همانند آنها را. فرمان [خدا] در ميان آنها فرود مى‌آيد [و تدبير مى‌كند] تا بدانيد كه خدا بر هر چيزى تواناست و اين كه علم او همه چيز را احاطه كرده است"
          ],
          "fa.fooladvand": [
            "خدا همان كسى است كه هفت آسمان و همانند آنها هفت زمين آفريد. فرمان [خدا] در ميان آنها فرود مى‌آيد، تا بدانيد كه خدا بر هر چيزى تواناست، و به راستى دانش وى هر چيزى را در بر گرفته است."
          ],
          "fa.ghomshei": [
            "خدا آن کسی است که هفت آسمان را آفرید و مانند آن آسمان‌ها از (هفت طبقه) زمین خلق فرمود؛ امر نافذ او در بین هفت آسمان و زمین نازل می‌شود تا بدانید که خدا بر هر چیز توانا و به احاطه علمی بر همه امور عالم آگاه است."
          ],
          "fa.khorramdel": [
            "خدا همان است که هفت آسمان را و همانند آن زمین را آفریده است. فرمان (خدا) همواره در میان آنها جاری است (و تدبیر هدایت و رهبری او، لحظه‌ای از جهان بزرگ هستی برداشته نمی‌شود، این آفرینش عظیم بدان خاطر است) تا بدانید خداوند بر هر چیزی توانا است، و آگاهی او همه چیز را فرا گرفته است. [[«خَلَقَ سَبْعَ سَمَاوَاتٍ وَ مِنَ الأرْضِ مِثْلَهُنَّ»: هفت آسمان و به اندازه آن، زمین را آفریده است. عدد هفت برای کثرت است، و در این صورت منظور از هفت آسمان و هفت زمین، تعداد بیشمار و خارج از اندازه کواکب آسمانی و کراتی مشابه زمین است. (نگا: بقره / 29، اسراء / 44، مؤمنون / 86، فصّلت / 12). امّا اگر عدد هفت برای شماره محدود باشد، آنچه ما می‌بینیم و دانش بشر به آن احاطه دارد، همه مربوط به آسمان و زمین اوّل است، و ماورای این ثوابت و سیّارات، شش عالم دیگر وجود دارد که از دسترس علم ما بیرون است (نگا: صافّات / 6، فصّلت / 12، ملک / 5). «مِثْلَهُنَّ»: اشاره به زمینهای متعدّدی است که در عالم هستی وجود دارد. تا آنجا که بعضی از دانشمندان ستاره‌شناس می‌گویند، تعداد کراتی که مشابه کره زمین بر گرد خورشیدها در پهنه هستی گردش می‌کنند حدّاقلّ سیصد میلیون کُره است (نگا: المراغی). «یَتَنَزَّلُ الأمْرُ بَیْنَهُنَّ»: فرمان خدا و قضا و قدر او در میان آنها جاری و حکمفرما است. خدا است که حکم خود را درباره آنها به مرحله اجرا در می‌آورد و کار و بار جهان را می‌گرداند. (نگا: سجده / 4).]]"
          ],
          "fa.khorramshahi": [
            "خداوند کسی است که هفت آسمان را آفریده است، و از زمین نیز همانند آن را، فرمان او از میان آنها نازل می‌گردد، تا بدانید که خداوند بر هر کاری توانا است، و اینکه خداوند بر هر چیز احاطه علمی دارد"
          ],
          "fa.makarem": [
            "خداوند همان کسی است که هفت آسمان را آفرید، و از زمین نیز همانند آنها را؛ فرمان او در میان آنها پیوسته فرود می‌آید تا بدانید خداوند بر هر چیز تواناست و اینکه علم او به همه چیز احاطه دارد!"
          ],
          "fa.moezzi": [
            "خدا است آنکه آفرید هفت آسمان و از زمین مانند آنها فرود آید کار میان آنها تا بدانید که خدا بر همه چیز است توانا و آنکه خدا فراگرفته است همه چیز را به دانش‌"
          ],
          "fa.mojtabavi": [
            "خداى همان است كه هفت آسمان و از زمين همانند آن- هفت زمين- بيافريد فرمان [او] ميان آنها فرو مى‌آيد- جارى است- تا بدانيد كه خداى بر هر چيزى تواناست و دانش خدا همه چيز را فراگرفته است."
          ],
          "fa.sadeqi": [
            "خدا کسی است که هفت آسمان را و همانند آنها (هفت) زمین را آفرید. فرمان (تکوین و تشریع خدا) در میان آنها به تدریج فرود می‌آید تا بدانید که خدا به‌درستی بر هر چیزی بسیار تواناست و به‌راستی علمش همواره هر چیزی را در بر گرفته است."
          ]
        }
      }
    ]
  },
  "index": "quran:65",
  "kind": "verse_list"
}