{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 66"
        },
        "path": "/books/quran:66",
        "titles": {
          "ar": "التحريم",
          "en": "The Prohibition",
          "ent": "At-Tahrim"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 66,
    "local_index": 66,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 67"
        },
        "path": "/books/quran:67",
        "titles": {
          "ar": "الملك",
          "en": "The Sovereignty",
          "ent": "Al-Mulk"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 65"
        },
        "path": "/books/quran:65",
        "titles": {
          "ar": "الطلاق",
          "en": "Divorce",
          "ent": "At-Talaaq"
        }
      },
      "up": {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      }
    },
    "order": 107,
    "part_type": "Chapter",
    "path": "/books/quran:66",
    "reveal_type": "Medinan",
    "rukus": 2,
    "titles": {
      "ar": "التحريم",
      "en": "The Prohibition",
      "ent": "At-Tahrim"
    },
    "verse_count": 12,
    "verse_start_index": 5229,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 5230,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:66:1",
        "refs": {
          "Mentioned In": [
            "/books/al-kafi:7:7:16:4",
            "/books/al-kafi:6:2:59:1"
          ]
        },
        "text": [
          "يَا أَيُّهَا النَّبِيُ‌ لِمَ‌ تُحَرِّمُ‌ مَا أَحَلَ‌ اللَّهُ‌ لَکَ‌ تَبْتَغِي‌ مَرْضَاةَ أَزْوَاجِکَ‌ وَ اللَّهُ‌ غَفُورٌ رَحِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O PROPHET, WHY should you forbid (yourself) what God has made lawful for you, in order to please your wives? Yet God is forgiving and kind."
          ],
          "en.ahmedraza": [
            "O dear Prophet (Mohammed – peace and blessings be upon him)! Why do you forbid for yourself the things that Allah has made lawful for you? You wish to please some of your wives; and Allah is Oft Forgiving, Most Merciful."
          ],
          "en.arberry": [
            "O Prophet, why forbiddest thou what God has made lawful to thee, seeking the good pleasure of thy wives? And God is All-forgiving, All-compassionate."
          ],
          "en.daryabadi": [
            "O prophet! why makest thou unlawful that which Allah hath made lawful Unto thee, seeking the good-will of thy wives! And Allah is Forgiving, Merciful."
          ],
          "en.hilali": [
            "O Prophet! Why do you ban (for yourself) that which Allah has made lawful to you, seeking to please your wives? And Allah is Oft-Forgiving, Most Merciful."
          ],
          "en.itani": [
            "O prophet! Why do you prohibit what God has permitted for you, seeking to please your wives? God is Forgiving and Merciful."
          ],
          "en.maududi": [
            "O Prophet, why do you forbid what Allah has made lawful for you? Is it to please your wives? Allah is Most Forgiving, Most Compassionate."
          ],
          "en.mubarakpuri": [
            "O Prophet! Why do you forbid that which Allah has allowed to you, seeking to please your wives And Allah is Oft-Forgiving, Most Merciful."
          ],
          "en.pickthall": [
            "O Prophet! Why bannest thou that which Allah hath made lawful for thee, seeking to please thy wives? And Allah is Forgiving, Merciful."
          ],
          "en.qarai": [
            "O Prophet! Why do you disallow [yourself] what Allah has made lawful for you, seeking to please your wives? And Allah is all-forgiving, all-merciful."
          ],
          "en.qaribullah": [
            "O Prophet, why do you forbid that which Allah has made lawful to you. Do you seek to please your wives' Allah is the Forgiving, the Most Merciful."
          ],
          "en.sahih": [
            "O Prophet, why do you prohibit [yourself from] what Allah has made lawful for you, seeking the approval of your wives? And Allah is Forgiving and Merciful."
          ],
          "en.sarwar": [
            "Prophet, in seeking the pleasure of your wives, why do you make unlawful that which God has made lawful. God is All-forgiving and All-merciful."
          ],
          "en.shakir": [
            "O Prophet! why do you forbid (yourself) that which Allah has made lawful for you; you seek to please your wives; and Allah is Forgiving, Merciful."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> a<b>l</b>nnabiyyu lima tu<u>h</u>arrimu m<u>a</u> a<u>h</u>alla All<u>a</u>hu laka tabtaghee mar<u>da</u>ta azw<u>a</u>jika wa<b>A</b>ll<u>a</u>hu ghafoorun ra<u>h</u>eem<b>un</b>"
          ],
          "en.wahiduddin": [
            "Prophet, why in your desire to please your wives, do you impose a ban on what God has made lawful to you? God is forgiving and merciful."
          ],
          "en.yusufali": [
            "O Prophet! Why holdest thou to be forbidden that which Allah has made lawful to thee? Thou seekest to please thy consorts. But Allah is Oft-Forgiving, Most Merciful."
          ],
          "fa.ansarian": [
            "ای پیامبر! چرا آنچه را که خدا بر تو حلال کرده برای به دست آوردن خشنودی همسرانت بر خود حرام می کنی؟ و خدا بسیار آمرزنده و مهربان است."
          ],
          "fa.ayati": [
            "اى پيامبر، چرا چيزى را كه خدا بر تو حلال كرده است، به خاطر خشنودساختن زنانت بر خود حرام مى‌كنى؟ و خدا آمرزنده و مهربان است."
          ],
          "fa.bahrampour": [
            "اى پيامبر! چرا براى كسب خشنودى همسرانت چيزى را كه خدا براى تو حلال كرده حرام مى‌كنى؟ و خداوند آمرزنده‌ى مهربان است"
          ],
          "fa.fooladvand": [
            "اى پيامبر، چرا براى خشنودى همسرانت، آنچه را خدا براى تو حلال گردانيده حرام مى‌كنى؟ خدا[ست كه‌] آمرزنده مهربان است."
          ],
          "fa.ghomshei": [
            "ای پیغمبر گرامی برای چه آن را که خدا بر تو حلال فرمود تو بر خود حرام می‌کنی تا زنانت را از خود خشنود سازی؟ در صورتی که خدا بسیار آمرزنده و مهربان است (بر هیچ کس خصوص بر تو رسول گرامیش سخت نخواهد گرفت. در تفسیر وارد است که روزی حَفْصه با اجازه رسول خدا صلّی اللّه علیه و آله و سلّم به خانه پدرش عمر رفت، پیغمبر با ماریه در حجره حَفْصه خلوت کرد. ناگه او رسید و غوغا انگیخت که تو در حجره من با کنیزی خلوت کردی و آبروی مرا نزد زنانت بردی. حضرت برای خشنودی او فرمود: من ماریه را بر خود حرام کردم ولی این سرّ نزد تو است با هیچ کس مگوی. او به فور عایشه را هم آگه ساخت، او هم با رسول راجع به ماریه گفتگو کرد. حضرت سوگند خورد که ماریه را ترک گوید. آن دو زن شاد شدند و این آیه نازل گردید)."
          ],
          "fa.khorramdel": [
            "ای پیغمبر! چرا چیزی را که خدا بر تو حلال کرده است، به خاطر خوشنود ساختن همسرانت، بر خود حرام می‌کنی؟ خداوند آمرزگار مهربانی است (و تو را و همسران تو را می‌بخشاید). [[«لِمَ تُحَرِّمُ مَا»: چیزی که پیغمبر آن را بر خود حرام فرمود، خوردن عسل، یا نزدیکی با ماریه قبطی، و یا نزدیکی با همه همسران به مدّت یک ماه بود. این تحریم، تحریم شرعی نبود و بلکه پیغمبر سوگند می‌خورد که از این به بعد عسل نخورد، و یا به مدّت یک ماه از آمیزش با همسران دوری بکند. چکیده روایت چنین است: همسر پیغمبر، زینب دختر جحش که عمّه‌زاده رسول و صاحب وجاهت بود، اغلب از عسلی که خویشاوندانش برای او هدیّه می‌آوردند، به شوهر محبوب خود می‌خورانید. خویشاوندی و زیبائی او سبب گردید بنا به سرشت انسانی، امّ‌المؤمنین حفصه، و امّ‌المؤمنین عائشه بدو رشک برند. این دو با یکدیگر قرار می‌گذارند، وقتی که پیغمبر به پیش هر یک از آن دو تشریف فرما شوند، بدو عرض کنند: از وجود مبارک او بوی مغافیر به مشام می‌رسد. مغافیر صمغ بدبوئی است که از درختی به نام عرفط تراوش می‌کند. هنگامی که پیغمبر به پیش حفصه تشریف می‌آورد، بدو عرض می‌کند: بوی مغافیر استشمام می‌شود! رسول خدا می‌فرماید که او عسل خورده است؛ نه مغافیر. آن حضرت سوگند می‌خورد، دیگر عسل نخورد. نکند که زنبوران عسل احتمالاً از مغافیر تغذیه کنند! از حفصه می‌خواهد این سخن، رازی در میان ایشان باشد، تا دیگران نشنوند، و عسل را به پیروی از قدوه خود بر خویشتن حرام نکنند. ولی مسأله پخش می‌گردد، و پیغمبر سوگند می‌خورد که تا یک ماه با همسران خویش نزدیکی نخواهد کرد. روایت دیگر می‌گوید که: پیغمبر به ماریه قبطی علاقه وافر داشت و این امر باعث حسودی برخی از امّ‌المؤمنین گردید، و آن حضرت سوگند یاد کرد که با ماریه نزدیکی نکند. به هر حال خداوند دستور می‌دهند که کسی حق ندارد، حلال خدا را حرام، و حرام خدا را حلال سازد، چرا که قانونگذار تنها او است و بس. رسول اکرم برده‌ای را آزاد می‌نماید و قضیّه فیصله می‌یابد. «مَرْضَاة»: رضایت. خوشنودی. مصدر میمی است و در رسم‌الخطّ قرآنی با تاء کشیده نوشته شده است.]]"
          ],
          "fa.khorramshahi": [
            "ای پیامبر چرا در طلب خشنودی [بعضی از] همسرانت چیزی را که خداوند بر تو حلال گردانده است، تحریم می‌کنی؟ و خداوند [در همه حال‌] آمرزگار مهربان است‌"
          ],
          "fa.makarem": [
            "ای پیامبر! چرا چیزی را که خدا بر تو حلال کرده بخاطر جلب رضایت همسرانت بر خود حرام می‌کنی؟! و خداوند آمرزنده و رحیم است."
          ],
          "fa.moezzi": [
            "ای پیمبر چرا حرام می‌کنی آنچه را حلال کرد خدا برایت خواهی خشنودی همسران خویش را و خدا است آمرزنده مهربان‌"
          ],
          "fa.mojtabavi": [
            "اى پيامبر، چرا آنچه را خدا براى تو حلال كرده [بر خود] حرام مى‌كنى؟ [با اين كار] خشنودى همسران خود را مى‌خواهى، و خدا آمرزگار و مهربان است."
          ],
          "fa.sadeqi": [
            "هان ای پیامبر برجسته! چرا آنچه را خدا برای تو حلال گردانیده (بر خود) حرام می‌کنی؟ حال آنکه خشنودی همسرانت را می‌طلبی. و خدا بسی پوشنده‌ی رحمتگر بر ویژگان است."
          ]
        }
      },
      {
        "index": 5231,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:66:2",
        "refs": {
          "Mentioned In": [
            "/books/al-kafi:7:7:16:4"
          ]
        },
        "text": [
          "قَدْ فَرَضَ‌ اللَّهُ‌ لَکُمْ‌ تَحِلَّةَ أَيْمَانِکُمْ‌ وَ اللَّهُ‌ مَوْلاَکُمْ‌ وَ هُوَ الْعَلِيمُ‌ الْحَکِيمُ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Surely God has sanctioned the dissolution of your vows. God is your Lord: He is all-knowing, and all-wise."
          ],
          "en.ahmedraza": [
            "Allah has ordained expiation for your oaths; and Allah is your Master; and Allah is the All Knowing, the Wise."
          ],
          "en.arberry": [
            "God has ordained for you the absolution of your oaths. God is your Protector, and He is the All-knowing, the All-wise."
          ],
          "en.daryabadi": [
            "Surely Allah hath ordained for you absolution from your oaths; and Allah is your Patron and He is the Knower, the Wise."
          ],
          "en.hilali": [
            "Allah has already ordained for you (O men), the dissolution of your oaths. And Allah is your Maula (Lord, or Master, or Protector, etc.) and He is the All-Knower, the All-Wise."
          ],
          "en.itani": [
            "God has decreed for you the dissolution of your oaths. God is your Master. He is the All-Knowing, the Most Wise."
          ],
          "en.maududi": [
            "Allah has prescribed for you a way for the absolution of your oaths. Allah is your Guardian. He is All-Knowing, Most Wise."
          ],
          "en.mubarakpuri": [
            "Allah has already ordained for you (O men) the absolution from your oaths. And Allah is your Protector and He is the All-Knower, the All-Wise."
          ],
          "en.pickthall": [
            "Allah hath made lawful for you (Muslims) absolution from your oaths (of such a kind), and Allah is your Protector. He is the Knower, the Wise."
          ],
          "en.qarai": [
            "Allah has certainly made lawful for you the dissolution of your oaths, and Allah is your master and He is the All-knowing, the All-wise."
          ],
          "en.qaribullah": [
            "Allah has absolved you from your oaths. Allah is your Guardian, the Knowing, the Wise."
          ],
          "en.sahih": [
            "Allah has already ordained for you [Muslims] the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise."
          ],
          "en.sarwar": [
            "God has shown you how to absolve yourselves of your oaths. He is your Guardian and is All-knowing and All-wise."
          ],
          "en.shakir": [
            "Allah indeed has sanctioned for you the expiation of your oaths and Allah is your Protector, and He is the Knowing the Wise."
          ],
          "en.transliteration": [
            "Qad fara<u>d</u>a All<u>a</u>hu lakum ta<u>h</u>illata aym<u>a</u>nikum wa<b>A</b>ll<u>a</u>hu mawl<u>a</u>kum wahuwa alAAaleemu al<u>h</u>akeem<b>u</b>"
          ],
          "en.wahiduddin": [
            "God has already ordained that you be absolved of such oaths. God is your patron. He is the All Knowing, the Wise One."
          ],
          "en.yusufali": [
            "Allah has already ordained for you, (O men), the dissolution of your oaths (in some cases): and Allah is your Protector, and He is Full of Knowledge and Wisdom."
          ],
          "fa.ansarian": [
            "به یقین خدا راه گشودن [و شکستن] سوگندهایتان را [در مواردی] برای شما مقرّر کرده است، [و آن اینکه سوگندها را با کفاره دادن بشکنید تا از محدودیت و تنگنا درآیید] و خدا سرپرست و یار شماست، و او دانا و حکیم است."
          ],
          "fa.ayati": [
            "خدا براى شما گشودن سوگندهايتان را مقرر داشته است. خداست ياور شما، و اوست دانا و حكيم."
          ],
          "fa.bahrampour": [
            "در حقيقت، خدا براى شما [راه‌] شكستن سوگندهايتان را [به كفّاره‌] معين داشته، و خدا مولاى شماست، و او داناى حكيم است"
          ],
          "fa.fooladvand": [
            "قطعاً خدا براى شما [راه‌] گشودن سوگندهايتان را مقرر داشته است، و خدا سرپرست شماست، و اوست داناى حكيم."
          ],
          "fa.ghomshei": [
            "خدا مقرر کرد برای شما که سوگندهای خود را (به کفّاره) بگشایید، و خدا مولای شما بندگان (و حکمش نافذ) است و هم او (به هر چیز عالم) دانا و به حکمت (تمام امور خلق) آگاه است."
          ],
          "fa.khorramdel": [
            "خداوند راه گشودن سوگندانتان را برای شما مقرّر می‌دارد. (بدین نحو که کفّاره‌ی قسم را می‌دهید و خود را از زیر بار مسؤولیّت آن بیرون می‌آورید). خدا یاور و سرور شما است، و او بس آگاه و کار بجا است. [[«فَرَضَ»: اجازه داده است. مقرّر داشته است. واژه (فَرَضَ) اگر با (عَلی) همراه باشد، به معنی (وجوب) است، و اگر با (ل) باشد، به معنی مقرّر و مشخّص داشتن و اجازه دادن است (نگا: بقره / 236 و 237، احزاب / 38). «تَحِلَّةَ»: گشودن. حلال کردن. مراد کفّاره دادن و از زیر بار مسؤولیّت سوگند به در آمدن است (نگا: مائده / 89).]]"
          ],
          "fa.khorramshahi": [
            "به راستی که خداوند شکستن سوگندهایتان را [با دادن کفاره‌] بر شما روا داشته است، و خداوند سرور شماست و او دانای فرزانه است‌"
          ],
          "fa.makarem": [
            "خداوند راه گشودن سوگندهایتان را (در این گونه موارد) روشن ساخته؛ و خداوند مولای شماست و او دانا و حکیم است."
          ],
          "fa.moezzi": [
            "همانا خدا بایسته داشت بر شما حلال بودن سوگندهای شما را و خدا است دوست شما و او است دانای حکیم‌"
          ],
          "fa.mojtabavi": [
            "همانا خدا براى شما گشودن سوگندهاتان را [به كفاره‌] مقرر كرد و خدا سرپرست و كارساز شماست، و اوست داناى با حكمت."
          ],
          "fa.sadeqi": [
            "خدا بی‌گمان برایتان باز کردن (این‌گونه) سوگندهایتان را اکیداً واجب کرده است. و خدا سرپرست شماست، و اوست بسیار دانای حکیم."
          ]
        }
      },
      {
        "index": 5232,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:66:3",
        "text": [
          "وَ إِذْ أَسَرَّ النَّبِيُ‌ إِلَى‌ بَعْضِ‌ أَزْوَاجِهِ‌ حَدِيثاً فَلَمَّا نَبَّأَتْ‌ بِهِ‌ وَ أَظْهَرَهُ‌ اللَّهُ‌ عَلَيْهِ‌ عَرَّفَ‌ بَعْضَهُ‌ وَ أَعْرَضَ‌ عَنْ‌ بَعْضٍ‌ فَلَمَّا نَبَّأَهَا بِهِ‌ قَالَتْ‌ مَنْ‌ أَنْبَأَکَ‌ هٰذَا قَالَ‌ نَبَّأَنِيَ‌ الْعَلِيمُ‌ الْخَبِيرُ"
        ],
        "translations": {
          "en.ahmedali": [
            "When the Prophet told one of his wives something in confidence and she disclosed it, God revealed this to him. So he made some of it known to her, and held back some. When, however, he informed her about it, she asked: \"Who told you this?\" He said: \"I was told this by the All-knowing, All-Informed.\""
          ],
          "en.ahmedraza": [
            "And when the Holy Prophet confided a matter to one of his wives; so when she disclosed it and Allah conveyed this to the Holy Prophet, he told her part of it and held back a part; so when the Holy Prophet informed her about it, she said, “Who informed you?”; he said, “The All Knowing, the All Aware has informed me.”"
          ],
          "en.arberry": [
            "And when the Prophet confided to one of his wives a certain matter; and then, when she told of it, and God disclosed that to him, he made known part of it, and turned aside from part; then, when he told her of it, she said, 'Who told thee this?' He said, 'I was told of it by the All-knowing, the All-aware.'"
          ],
          "en.daryabadi": [
            "And recall what time the Prophet confided a story Unto one of his spouses, then she disclosed it, and Allah apprised him thereof, he made known part thereof and Withheld part. Then, when he had apprised her of it, she said: who hath acquainted thee therewith! He said the Knower, the Aware hath acquainted me."
          ],
          "en.hilali": [
            "And (remember) when the Prophet (SAW) disclosed a matter in confidence to one of his wives (Hafsah), so when she told it (to another i.e. 'Aishah), and Allah made it known to him, he informed part thereof and left a part. Then when he told her (Hafsah) thereof, she said: \"Who told you this?\" He said: \"The All-Knower, the All-Aware (Allah) has told me\"."
          ],
          "en.itani": [
            "The Prophet told something in confidence to one of his wives. But when she disclosed it, and God made it known to him; he communicated part of it, and he avoided another part. Then, when he informed her of it, she said, “Who informed you of this?” He said, “The All-Knowing, the All-Informed, informed me.”"
          ],
          "en.maududi": [
            "The Prophet confided something to one of his wives and then she disclosed it (to another); so after Allah revealed to the Prophet (that she had disclosed that secret), he made a part of it known to her and passed over a part of it. And when he told her about this (i.e., that she had disclosed the secret entrusted to her), she asked: “Who informed you of this?” He said: “I was told of it by He Who is All-Knowing, All-Aware.”"
          ],
          "en.mubarakpuri": [
            "And (remember) when the Prophet disclosed a matter in confidence to one of his wives, then she told it. And Allah made it known to him; he informed part thereof and left a part. Then when he told her thereof, she said: \"Who told you this\" He said: \"The All-Knower, the All-Aware has told me.\""
          ],
          "en.pickthall": [
            "When the Prophet confided a fact unto one of his wives and when she afterward divulged it and Allah apprised him thereof, he made known (to her) part thereof and passed over part. And when he told it her she said: Who hath told thee? He said: The Knower, the Aware hath told me."
          ],
          "en.qarai": [
            "When the Prophet confided a matter to one of his wives, but when she divulged it [instead of guarding the secret] and Allah apprised him about it, he acquainted [her] with part of the matter and ignored part of it. So when he told her about it, she said, ‘Who informed you about it?’ He said, ‘The All-knowing and the All-aware has informed me.’"
          ],
          "en.qaribullah": [
            "The Prophet confided a certain matter to one of his wives but thereafter she disclosed it, then Allah revealed what she had done to him. He made part of it known and another part not. And when he acquainted her with it, she said: 'Who has told you this' He replied: 'I was told of it by the Knower, the Aware'"
          ],
          "en.sahih": [
            "And [remember] when the Prophet confided to one of his wives a statement; and when she informed [another] of it and Allah showed it to him, he made known part of it and ignored a part. And when he informed her about it, she said, \"Who told you this?\" He said, \"I was informed by the Knowing, the Acquainted.\""
          ],
          "en.sarwar": [
            "The Prophet told a secret to one of his wives telling her not to mention it to anyone else. When she divulged it, God informed His Prophet about this. The Prophet told his wife part of the information which he had received from God and ignored the rest. Then she asked, \"Who informed you about this?\" He replied, \"The All-aware and All-knowing one has told me\"."
          ],
          "en.shakir": [
            "And when the prophet secretly communicated a piece of information to one of his wives-- but when she informed (others) of it, and Allah made him to know it, he made known part of it and avoided part; so when he informed her of it, she said: Who informed you of this? He said: The Knowing, the one Aware, informed me."
          ],
          "en.transliteration": [
            "Wai<u>th</u> asarra a<b>l</b>nnabiyyu il<u>a</u> baAA<u>d</u>i azw<u>a</u>jihi <u>h</u>adeethan falamm<u>a</u> nabbaat bihi waa<i><u>th</u></i>harahu All<u>a</u>hu AAalayhi AAarrafa baAA<u>d</u>ahu waaAAra<u>d</u>a AAan baAA<u>d</u>in falamm<u>a</u> nabbaah<u>a</u> bihi q<u>a</u>lat man anbaaka h<u>atha</u> q<u>a</u>la nabbaaniya alAAaleemu alkhabeer<b>u</b>"
          ],
          "en.wahiduddin": [
            "The Prophet once told one of his wives something in confidence. She did not keep it secret and God informed him of this; he made known a part of it, and avoided [mentioning] part of it. When he spoke to his wife of this, she asked him who had told him about it. He replied, \"The All Knowing, the All Aware One.\""
          ],
          "en.yusufali": [
            "When the Prophet disclosed a matter in confidence to one of his consorts, and she then divulged it (to another), and Allah made it known to him, he confirmed part thereof and repudiated a part. Then when he told her thereof, she said, \"Who told thee this? \"He said, \"He told me Who knows and is well-acquainted (with all things).\""
          ],
          "fa.ansarian": [
            "و هنگامی که پیامبر، رازی را به یکی از همسرانش گفت و او آن راز را [نزد زن دیگر] فاش کرد، و خدا پیامبر را از افشای آن آگاه نمود، پیامبر بخشی از آن [راز افشا شده] را به آن زن گوشزد کرد و از گفتن بخشی دیگر [برای آنکه فاش کننده بیشتر شرمنده نشود] خودداری نمود. آن زن گفت: چه کسی فاش کردن راز را [به وسیله من] به تو خبر داده است؟ پیامبر گفت: دانای آگاه، به من خبر داد."
          ],
          "fa.ayati": [
            "آنگاه كه پيامبر با يكى از زنان خود رازى در ميان نهاد، چون آن زن آن راز با ديگرى باز گفت، خدا پيامبر را از آن آگاه ساخت و او پاره‌اى از آن راز را بر آن زن آشكار كرد و از افشاى پاره‌اى ديگر سرباز آد. چون او را از آن خبر داد، گفت: چه كسى تو را از اين ماجرا آگاه كرده است؟ گفت: آن خداى داناى آگاه به من خبر داده است."
          ],
          "fa.bahrampour": [
            "و آن‌گاه كه پيامبر با يكى از همسرانش [حفصه‌] سخنى را به راز گفت، همين كه وى آن را [به عايشه‌] خبر داد و خدا [پيامبر] را از آن [افشاى راز] آگاه ساخت، [پيامبر] گوشه‌اى از اين [خيانت‌] را به وى اعلام و از برخى صرف نظر كرد. پس هنگامى كه [پيامبر] به وى خب"
          ],
          "fa.fooladvand": [
            "و چون پيامبر با يكى از همسرانش سخنى نهانى گفت، و همين كه وى آن را [به زن ديگر] گزارش داد و خدا [پيامبر] را بر آن مطلع گردانيد [پيامبر] بخشى از آن را اظهار كرد و از بخشى [ديگر] اعراض نمود. پس چون [مطلب‌] را به آن [زن‌] خبر داد، وى گفت: «چه كسى اين را به تو خبر داده؟» گفت: «مرا آن داناى آگاه خبر داده است.»"
          ],
          "fa.ghomshei": [
            "وقتی پیغمبر با بعضی زنان خود (یعنی با حفصه راجع به ماریه یا راجع به ریاست ابوبکر و عمر) سخنی به راز گفت و آن زن (چون خیانت کرده و دیگری یعنی عایشه را) بر سرّ پیغمبر آگه ساخت و خدا به رسولش خبر داد او بر آن زن برخی را اظهار کرد و به رویش آورد و برخی را پرده‌داری نمود و اظهار نکرد؛ چون او را از افشاء آن سرّ آگاه ساخت آن زن گفت: رسولا، تو را که واقف ساخت (که من سرّ تو بر کسی فاش کرده‌ام)؟ رسول گفت: مرا خدای دانای آگاه خبر داد."
          ],
          "fa.khorramdel": [
            "خاطرنشان ساز وقتی را که پیغمبر با یکی از همسرانش (به نام حفصه) رازی را در میان نهاد، و او آن راز را (به عایشه) خبر داد، و خداوند پیغمبرش را از این (افشای سرّ) آگاه ساخت. پیغمبر برخی از آن (رازگوئی) را (برای همسر رازگویش حفصه) بازگو کرد و از برخی دیگر خودداری کرد. هنگامی که همسرش را از آن (رازگوئی) مطّلع کرد، او گفت: چه کسی تو را از این (موضوع) آگاه کرده است؟ پیغمبر گفت: خداوند بس دانا و آگاه مرا با خبر کرده است. [[«أَسَرَّ»: پنهانی بیان کرد. به گونه راز بیان داشت. «بَعْضِ»: یکی. فردی. مراد حفصه است. «حَدِیثاً»: سخن. کلام. مراد، فرموده پیغمبر مبنی بر نخوردن عسل، و یا عدم نزدیکی با ماریه قبطی است. «نَبَّأَتْ بِهِ»: حفصه راز را به عایشه خبر داد. «أَظْهَرَهُ»: آن را اطّلاع داد. «عَرَّفَ»: شناساند. بازگو نمود.]]"
          ],
          "fa.khorramshahi": [
            "و چنین بود که پیامبر سخنی را پوشیده‌وار به بعضی از همسرانش گفت، و چون آن را [آن زن به زن دیگر] خبر داد، و خداوند او را از آن آگاه کرد، بخشی از آن را [در عتاب خود به آنان‌] بیان داشت و از بخش دیگر صرفنظر کرد، و چون آن زن [صاحب راز و افشاءگر آن‌] را از آن آگاه کرد، گفت چه کسی تو را از این خبر داد؟ فرمود مرا خداوند دانای آگاه با خبر کرد"
          ],
          "fa.makarem": [
            "(به خاطر بیاورید) هنگامی را که پیامبر یکی از رازهای خود را به بعضی از همسرانش گفت، ولی هنگامی که وی آن را افشا کرد و خداوند پیامبرش را از آن آگاه ساخت، قسمتی از آن را برای او بازگو کرد و از قسمت دیگر خودداری نمود؛ هنگامی که پیامبر همسرش را از آن خبر داد، گفت: «چه کسی تو را از این راز آگاه ساخت؟» فرمود: «خداوند عالم و آگاه مرا باخبر ساخت!»"
          ],
          "fa.moezzi": [
            "و گاهی که نهان داشت پیمبر بسوی بعضی از زنان خویش داستانی را پس گاهی که آگهیش داد بدان و فاش ساختش خدا بر او شناسانید پاره‌ای از آن را و روی برتافت از پاره‌ای و هنگامی که آگهیش داد بدان گفت که تو را آگهی داده است بدین گفت آگهیم داده است خداوند دانای آگاه‌"
          ],
          "fa.mojtabavi": [
            "و [ياد كنيد] آنگاه كه پيامبر با يكى از زنان خويش سخنى به راز گفت، پس چون آن زن- حفصه- آن راز را فاش كرد- به عايشه باز گفت- و خدا او"
          ],
          "fa.sadeqi": [
            "و چون (این) پیامبر برجسته با یکی از همسرانش سخنی گفت، همین که وی آن را به برخی (از همسران‌) گزارشی مهم داد و خدا او را بر آن مطّلع گردانید، (حضرتش‌) بخشی از آن را اظهار کرد و از بخشی (دیگر) اعراض نمود. پس چون همان را به آن زن خبری مهم داد، وی گفت: «چه کسی این خبر مهم را به تو داده‌؟» گفت: «مرا آن دانای آگاه (این‌گونه) خبر مهمی داده است.»"
          ]
        }
      },
      {
        "index": 5233,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:66:4",
        "text": [
          "إِنْ‌ تَتُوبَا إِلَى‌ اللَّهِ‌ فَقَدْ صَغَتْ‌ قُلُوبُکُمَا وَ إِنْ‌ تَظَاهَرَا عَلَيْهِ‌ فَإِنَ‌ اللَّهَ‌ هُوَ مَوْلاَهُ‌ وَ جِبْرِيلُ‌ وَ صَالِحُ‌ الْمُؤْمِنِينَ‌ وَ الْمَلاَئِکَةُ بَعْدَ ذٰلِکَ‌ ظَهِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "If both of you two (women) turn to God in penitence (it would be better). Your hearts have been impaired; and if you assist one another against him, then surely his helper is God, and Gabriel and the righteous believers, and, besides them, the angels are his helpers."
          ],
          "en.ahmedraza": [
            "If you both, the wives of the Holy Prophet, incline towards Allah, for indeed your hearts have deviated a little; and if you come together against him (the Holy Prophet – peace and blessings be upon him) then indeed Allah is his Supporter, and Jibreel and the virtuous believers are also his aides; and in addition the angels are also his aides. (Allah has created several supporters for the believers.)"
          ],
          "en.arberry": [
            "If you two repent to God, yet your hearts certainly inclined; but if you support one another against him, God is his Protector, and Gabriel, and the righteous among the believers; and, after that, the angels are his supporters."
          ],
          "en.daryabadi": [
            "If ye twain turn Unto Allah repentant, it is well, surely your hearts are so inclined, and if ye support each other against him, then verily Allah! his friend is He and Jibril and so are the righteous believers; and furthermore the angels are his aiders."
          ],
          "en.hilali": [
            "If you two (wives of the Prophet SAW, namely 'Aishah and Hafsah) turn in repentance to Allah, (it will be better for you), your hearts are indeed so inclined (to oppose what the Prophet SAW likes), but if you help one another against him (Muhammad SAW), then verily, Allah is his Maula (Lord, or Master, or Protector, etc.), and Jibrael (Gabriel), and the righteous among the believers, and furthermore, the angels are his helpers."
          ],
          "en.itani": [
            "If you repent to God, then your hearts have listened. But if you band together against him, then God is his Ally, as is Gabriel, and the righteous believers. In addition, the angels will assist him."
          ],
          "en.maududi": [
            "If the two of you turn in repentance to Allah (that is better for you), for the hearts of both of you have swerved from the Straight Path. But if you support one another against the Prophet, then surely Allah is his Protector; and after that Gabriel and all righteous believers and the angels are all his supporters."
          ],
          "en.mubarakpuri": [
            "If you two turn in repentance to Allah, your hearts are indeed so inclined; but if you help one another against him, then verily, Allah is his Protector, and Jibril, and the righteous among the believers; and after that the angels are his helpers."
          ],
          "en.pickthall": [
            "If ye twain turn unto Allah repentant, (ye have cause to do so) for your hearts desired (the ban); and if ye aid one another against him (Muhammad) then lo! Allah, even He, is his Protecting Friend, and Gabriel and the righteous among the believers; and furthermore the angels are his helpers."
          ],
          "en.qarai": [
            "If the two of you repent to Allah... for your hearts have certainly swerved, and if you back each other against him, then [know that] Allah is indeed his guardian, and his supporters are Gabriel, the righteous among the faithful and, thereafter, the angels."
          ],
          "en.qaribullah": [
            "If both of you (wives) turn to Allah in repentance, even though your hearts inclined; but if you support one another against him, (know that) Allah is hisGuardian, and Gabriel, and the righteous among the believers; and thereafter the angels are his reinforcers."
          ],
          "en.sahih": [
            "If you two [wives] repent to Allah, [it is best], for your hearts have deviated. But if you cooperate against him - then indeed Allah is his protector, and Gabriel and the righteous of the believers and the angels, moreover, are [his] assistants."
          ],
          "en.sarwar": [
            "Would that you two (wives of the Prophet) had turned to God in repentance. Your hearts have sinned. If you conspire with each other against him, know that God is his Guardian. Gabriel, the righteous (ones) among the believers and the angels will all support him."
          ],
          "en.shakir": [
            "If you both turn to Allah, then indeed your hearts are already inclined (to this); and if you back up each other against him, then surely Allah it is Who is his Guardian, and Jibreel and -the believers that do good, and the angels after that are the aiders."
          ],
          "en.transliteration": [
            "In tatoob<u>a</u> il<u>a</u> All<u>a</u>hi faqad <u>s</u>aghat quloobukum<u>a</u> wain ta<i><u>th</u></i><u>a</u>har<u>a</u> AAalayhi fainna All<u>a</u>ha huwa mawl<u>a</u>hu wajibreelu wa<u>sa</u>li<u>h</u>u almumineena wa<b>a</b>lmal<u>a</u>ikatu baAAda <u>tha</u>lika <i><u>th</u></i>aheer<b>un</b>"
          ],
          "en.wahiduddin": [
            "If only both of you would turn to God in repentance -- and your hearts are already so inclined. But if you uphold each other against him, then surely God is his protector, and Gabriel and the righteous among the believers; and the angels too are his helpers."
          ],
          "en.yusufali": [
            "If ye two turn in repentance to Him, your hearts are indeed so inclined; But if ye back up each other against him, truly Allah is his Protector, and Gabriel, and (every) righteous one among those who believe,- and furthermore, the angels - will back (him) up."
          ],
          "fa.ansarian": [
            "اگر شما دو زن از کار خود به پیشگاه خدا توبه کنید [خدا توبه شما را می پذیرد]، چون دل شما دو نفر از حق و درستی منحرف شده است، و اگر بر ضدِّ پیامبر به یکدیگر کمک دهید [راه به جایی نخواهید برد]؛ زیرا خدا و جبرئیل و صالح مؤمنان [که علی بن ابی طالب است] یار اویند، و فرشتگان نیز بعد از آنان پشتیبان او خواهند بود."
          ],
          "fa.ayati": [
            "اگر شما دو زن توبه كنيد بهتر است، زيرا دلهايتان از حق باز گشته است. و اگر براى آزارش همدست شويد، خدا ياور اوست و نيز جبرئيل و مؤمنان شايسته و فرشتگان از آن پس ياور او خواهند بود."
          ],
          "fa.bahrampour": [
            "اگر [شما دو زن‌] به درگاه خدا توبه كنيد [به نفع شماست، زيرا] واقعا دل‌هايتان از حق برگشته است، و اگر بر ضدّ او همدست شويد، بى‌ترديد خداوند خود ياور اوست، و گذشته از اين جبرئيل و نيكوكار مؤمنان [على «ع»] و فرشتگان هم پشتيبانند"
          ],
          "fa.fooladvand": [
            "اگر [شما دو زن‌] به درگاه خدا توبه كنيد [بهتر است‌]، واقعاً دلهايتان انحراف پيدا كرده است. و اگر عليه او به يكديگر كمك كنيد، در حقيقت، خدا خود سرپرست اوست، و جبرئيل و صالح مؤمنان [نيز ياور اويند] و گذشته از اين، فرشتگان [هم ]پشتيبان [او] خواهند بود."
          ],
          "fa.ghomshei": [
            "اینک اگر هر دو زن به درگاه خدا توبه کنید (رواست که) البته دلهای شما (خلاف رضای پیغمبر) میل کرده است، و اگر با هم بر آزار او اتفاق کنید خدا یار و نگهبان اوست و جبریل امین و مردان صالح با ایمان (یعنی علی علیه السّلام به روایت عامّه و خاصّه) و فرشتگان حق یار و مددکار اویند."
          ],
          "fa.khorramdel": [
            "اگر به سوی خدا برگردید و توبه کنید (خداوند برگشت و توبه‌ی شما را می‌پذیرد) چرا که دلهایتان (از حفظ سرّ که پیغمبر دوست می‌داشت) منحرف گشته است. و اگر بر ضدّ او همدست شوید (و برای آزارش بکوشید، باکی نیست) خدا یاور او است، و علاوه از خدا، جبرئیل، و مؤمنان خوب و شایسته، و فرشتگان پشتیبان او هستند. [[«إن تَتُوبَا ...»: مخاطب حفصه و عائشه (علیهما السلام) است. جواب شرط محذوف است و تقدیر چنین است: إن تَتُوبَا یَتُبْ عَلَیْکُمَا. «صَغَتْ»: منحرف گشته است. بگردیده است. «إن تَظَاهَرا»: اگر همدستی و هم‌پشتی کنید. فعل مضارع است و اصل آن (إن تَتَظَاهَرا) است که یکی از دو تاء را حذف کرده‌اند. «صَالِحُ الْمُؤْمِنِینَ»: مؤمنان شایسته و بایسته. واژه (صالح) مفرد است و در معنی جمع استعمال شده است و مراد جنس صالح است یعنی فردفرد مسلمانان خوب و متّقی. مثل: لا یَفْعَلُ هَذا، الصَّالِحُ مِنَ الَنَّاسِ. «ظَهِیرٌ»: پشتیبان (نگا: اسراء / 88، فرقان / 55، قصص / 17 و 86، سبأ / 22).]]"
          ],
          "fa.khorramshahi": [
            "اگر شما دو زن به درگاه خداوند توبه کنید، و به راستی هم دلهای شما [از طاعت خداوند و پیامبر او در این امر] برگشته است [از گناه شما در می‌گذرد]، و اگر در برابر او همدستی کنید، بدانید که خداوند دوست اوست و جبرئیل و صالح‌[ترین‌] مؤمنان، و علاوه بر آن فرشتگان هم پشتیبانند"
          ],
          "fa.makarem": [
            "اگر شما (همسران پیامبر) از کار خود توبه کنید (به نفع شماست، زیرا) دلهایتان از حق منحرف گشته؛ و اگر بر ضدّ او دست به دست هم دهید، (کاری از پیش نخواهید برد) زیرا خداوند یاور اوست و همچنین جبرئیل و مؤمنان صالح، و فرشتگان بعد از آنان پشتیبان اویند."
          ],
          "fa.moezzi": [
            "اگر توبه کنید ای دو زن بسوی خدا هر آینه گرویده است دلهای شما و اگر چیرگی کنید بر او همانا خدا است دوست او و جبرئیل و شایستگان از مؤمنان و فرشتگانند پس از آن پشتیبان‌"
          ],
          "fa.mojtabavi": [
            "اگر [شما دو زن‌] به خداى بازگرديد- توبه كنيد- [بجاست‌]، زيرا كه دلهاى شما به كژى و گناه- فاش‌كردن سِرّ پيامبر"
          ],
          "fa.sadeqi": [
            "اگر شما دو زن سوی خدا بازگشت کنید (که) بس. بی‌گمان دل‌هایتان انحراف پیدا کرده است و اگر علیه او با یکدیگر تظاهر کنید، به‌راستی خدا خود سرپرست اوست و (نیز) جبرئیل و صالح مؤمنان و فرشتگان (هم) پس از این (ولایت ربانی) پشتیبان اویند."
          ]
        }
      },
      {
        "index": 5234,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:66:5",
        "text": [
          "عَسَى‌ رَبُّهُ‌ إِنْ‌ طَلَّقَکُنَ‌ أَنْ‌ يُبْدِلَهُ‌ أَزْوَاجاً خَيْراً مِنْکُنَ‌ مُسْلِمَاتٍ‌ مُؤْمِنَاتٍ‌ قَانِتَاتٍ‌ تَائِبَاتٍ‌ عَابِدَاتٍ‌ سَائِحَاتٍ‌ ثَيِّبَاتٍ‌ وَ أَبْکَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "In case he divorces you, his Lord will give him better wives in return, who will be modest, true believers, obedient to God, repentant, observant of prayer and fasting, both widows and virgins."
          ],
          "en.ahmedraza": [
            "It is likely that, if he divorces you, his Lord will give him wives better than you in your place -widows and maidens who are obedient, believing, respectful, penitent, serving and fasting."
          ],
          "en.arberry": [
            "It is possible that, if he divorces you, his Lord will give him in exchange wives better than you, women who have surrendered, believing, obedient, penitent, devout, given to fasting, who have been married and virgins too."
          ],
          "en.daryabadi": [
            "Belike his Lord, if he divorce you, will give him in exchange wives better than you, Muslims, believers, devout, penitent, worshippers, given to fasting, both non-virgins and virgins."
          ],
          "en.hilali": [
            "It may be if he divorced you (all) that his Lord will give him instead of you, wives better than you, Muslims (who submit to Allah), believers, obedient to Allah, turning to Allah in repentance, worshipping Allah sincerely, fasting or emigrants (for Allah's sake), previously married and virgins."
          ],
          "en.itani": [
            "Perhaps, if he divorces you, his Lord will give him in exchange wives better than you: submissive, believing, obedient, penitent, devout, fasting—previously married, or virgins."
          ],
          "en.maududi": [
            "Maybe if he were to divorce you, your Lord might grant him in exchange wives better than you – those who truly submit to Allah, are full of faith, obedient, disposed to repentance, and given to worship and fasting – both previously wedded ones and virgins."
          ],
          "en.mubarakpuri": [
            "Maybe his Lord, if he divorces you, will give him instead of you, wives better than you - submitting, believers, obedient, turning to Allah in repentance, worshipping Allah sincerely, Sa'ihat, previously married, and virgins."
          ],
          "en.pickthall": [
            "It may happen that his Lord, if he divorce you, will give him in your stead wives better than you, submissive (to Allah), believing, pious, penitent, devout, inclined to fasting, widows and maids."
          ],
          "en.qarai": [
            "It may be that if he divorces you his Lord will give him, in [your] stead, wives better than you: [such as are] muslim, faithful, obedient, penitent, devout and given to fasting, virgins and non-virgins."
          ],
          "en.qaribullah": [
            "It may be that if he divorces you his Lord will give him in your place better wives than yourselves, women who have surrendered, believing, obedient, penitent worshippers and given to fasting; who were (previously) married, and virgins too."
          ],
          "en.sahih": [
            "Perhaps his Lord, if he divorced you [all], would substitute for him wives better than you - submitting [to Allah], believing, devoutly obedient, repentant, worshipping, and traveling - [ones] previously married and virgins."
          ],
          "en.sarwar": [
            "If he divorces you, perhaps his Lord will replace you with better wives, either widows or virgins who will be Muslims: believers, faithful, obedient, repentant, and devout in prayer and fasting."
          ],
          "en.shakir": [
            "Maybe, his Lord, if he divorce you, will give him in your place wives better than you, submissive, faithful, obedient, penitent, adorers, fasters, widows and virgins."
          ],
          "en.transliteration": [
            "AAas<u>a</u> rabbuhu in <u>t</u>allaqakunna an yubdilahu azw<u>a</u>jan khayran minkunna muslim<u>a</u>tin mumin<u>a</u>tin q<u>a</u>nit<u>a</u>tin t<u>a</u>ib<u>a</u>tin AA<u>a</u>bid<u>a</u>tin s<u>a</u>i<u>ha</u>tin thayyib<u>a</u>tin waabk<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Were he to divorce you, his Lord might well replace you with better wives -- submissive [to God], believing, pious, penitent, devout in worship, given to fasting -- previously married and virgins."
          ],
          "en.yusufali": [
            "It may be, if he divorced you (all), that Allah will give him in exchange consorts better than you,- who submit (their wills), who believe, who are devout, who turn to Allah in repentance, who worship (in humility), who travel (for Faith) and fast,- previously married or virgins."
          ],
          "fa.ansarian": [
            "اگر پیامبر، شما را طلاق دهد امید است که پروردگارش همسرانی بهتر از شما که مسلمان، مؤمن، فرمانبر، توبه کار، خداپرست، روزه دار، غیر باکره و باکره باشند، به او عوض دهد."
          ],
          "fa.ayati": [
            "شايد اگر شما را طلاق گويد پروردگارش به جاى شما زنانى بهتر از شمايش بدهد. زنانى مسلمان، مؤمن، فرمانبردار، توبه‌كننده، اهل عبادت و روزه‌گرفتن، خواه شوهركرده، خواه باكره."
          ],
          "fa.bahrampour": [
            "اگر شما را طلاق دهد چه بسا پروردگارش همسرانى بهتر از شما به او عوض دهد همسرانى مسلمان، مؤمن، مطيع، توبه كار، عبادتگر، روزه‌گير، بيوه و دوشيزه"
          ],
          "fa.fooladvand": [
            "اگر پيامبر، شما را طلاق گويد، اميد است پروردگارش همسرانى بهتر از شما: مسلمان، مؤمن، فرمانبر، توبه كار، عابد، روزه‌دار، بيوه و دوشيزه به او عوض دهد."
          ],
          "fa.ghomshei": [
            "امید است که اگر پیغمبر شما را طلاق داد خدا زنانی بهتر از شما به جایتان با او همسر کند که همه با مقام تسلیم و ایمان و خضوع اطاعت کنند و اهل توبه و عبادت باشند و رهسپار (طریق معرفت)، چه بکر چه غیر بکر."
          ],
          "fa.khorramdel": [
            "اگر پیغمبر شما را طلاق دهد، چه بسا پروردگارش به جای شما همسرانی را نصیب او گرداند که بهتر از شما باشند. زنان دوشیزه یا غیر دوشیزه‌ی فرمانبردار، با ایمان، فروتن، توبه کار، پرستشگر، و گردنده (و پر تحرّک در جهان اندیشه و در مسیر طاعت و عبادت). [[«مُسْلِمَاتٍ»: جمع مُسْلِمَة، مسلمان و فرمانبردار. «قَانِتَاتٍ»: جمع قَانِتَة، خاشع و خاضع. فروتن (نگا: نساء / 34، احزاب / 35). «سَآئِحَاتٍ»: جمع سَآئِحَة، روزه‌دار، گردنده (نگا: توبه / 112). «ثَیِّبَاتٍ»: جمع ثَیِّبْ، غیر دوشیزه. بیوه. «أَبْکَاراً»: جمع بِکْر، دوشیزه (نگا: واقعه / 36).]]"
          ],
          "fa.khorramshahi": [
            "چه بسا اگر شما را طلاق دهد، پروردگارش برای او همسرانی بهتر از شما جانشین گرداند که زنانی مسلمان، مؤمن، فرمانبردار، توبه‌کار، پرستشگر خداوند، روزه‌دار، اعم از بیوه و دوشیزه باشند"
          ],
          "fa.makarem": [
            "امید است که اگر او شما را طلاق دهد، پروردگارش به جای شما همسرانی بهتر برای او قرار دهد، همسرانی مسلمان، مؤمن، متواضع، توبه کار، عابد، هجرت‌کننده، زنانی غیرباکره و باکره!"
          ],
          "fa.moezzi": [
            "امید است پروردگار او اگر طلاق گوید شما را تبدیلش کند زنانی نکوتر از شما مسلمانانی مؤمنانی فروتنانی توبه‌کنندگانی و پرستندگانی رهروانی بیوه‌گانی و شوی‌نادیدگانی‌"
          ],
          "fa.mojtabavi": [
            "اگر شما را طلاق دهد شايد پروردگارش همسرانى بهتر از شما به او عوض دهد: مسلمان، مؤمن، فرمانبر، توبه‌كننده، خداپرست، روزه‌دار، شوهركرده و دوشيزه."
          ],
          "fa.sadeqi": [
            "اگر پیامبر، شما را طلاق گوید، امید است پروردگارش همسرانی بهتر از شما، مسلمان، مؤمن، فرمانبر، توبه‌‌کار، عابد، روزه‌دار، بیوه و دوشیزه را به او عوض دهد."
          ]
        }
      },
      {
        "index": 5235,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:66:6",
        "refs": {
          "Mentioned In": [
            "/books/al-kafi:5:1:30:1",
            "/books/al-kafi:2:1:93:1",
            "/books/al-kafi:5:1:30:3",
            "/books/al-kafi:5:1:30:2"
          ]
        },
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا قُوا أَنْفُسَکُمْ‌ وَ أَهْلِيکُمْ‌ نَاراً وَقُودُهَا النَّاسُ‌ وَ الْحِجَارَةُ عَلَيْهَا مَلاَئِکَةٌ غِلاَظٌ شِدَادٌ لاَ يَعْصُونَ‌ اللَّهَ‌ مَا أَمَرَهُمْ‌ وَ يَفْعَلُونَ‌ مَا يُؤْمَرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "O you who believe, save yourselves and your families from the Fire whose fuel is men and rocks, over which are appointed angels stern and severe as wardens who never disobey what God commands them, and do what they are commanded;"
          ],
          "en.ahmedraza": [
            "O People who Believe! Save yourselves and your families from the fire, the fuel of which is men and stones – appointed over it are the extremely strict angels, who do not refuse the command of Allah and carry out whatever they are commanded."
          ],
          "en.arberry": [
            "Believers, guard yourselves and your families against a Fire whose fuel is men and stones, and over which are harsh, terrible angels who disobey not God in what He commands them and do what they are commanded."
          ],
          "en.daryabadi": [
            "O ye who believe! protect yourselves and your households from a Fire the fuel whereof is mankind and stones, over which are angels, stern, strong; they disobey not Allah in that which He commandeth them, and do that which they are commanded."
          ],
          "en.hilali": [
            "O you who believe! Ward off from yourselves and your families a Fire (Hell) whose fuel is men and stones, over which are (appointed) angels stern (and) severe, who disobey not, (from executing) the Commands they receive from Allah, but do that which they are commanded."
          ],
          "en.itani": [
            "O you who believe! Protect yourselves and your families from a Fire, whose fuel is people and stones. Over it are angels, fierce and powerful. They never disobey God in anything He commands them, and they carry out whatever they are commanded."
          ],
          "en.maududi": [
            "Believers, guard yourselves and your kindred against a Fire whose fuel is human beings and stones, a Fire held in the charge of fierce and stern angels who never disobey what He has commanded them, and always do what they are bidden."
          ],
          "en.mubarakpuri": [
            "O you who believe! Protect yourselves and your families against a Fire (Hell) whose fuel is men and stones, over which are (appointed) angels stern (and) severe, who disobey not the commands they receive from Allah, but do that which they are commanded."
          ],
          "en.pickthall": [
            "O ye who believe! Ward off from yourselves and your families a Fire whereof the fuel is men and stones, over which are set angels strong, severe, who resist not Allah in that which He commandeth them, but do that which they are commanded."
          ],
          "en.qarai": [
            "O you who have faith! Save yourselves and your families from a Fire whose fuel will be people and stones, over which are [assigned] severe and mighty angels, who do not disobey whatever Allah commands them and carry out what they are commanded."
          ],
          "en.qaribullah": [
            "Believers, guard yourselves and your families against the Fire the fuel of which is people and stones, over which there are harsh, and stern angels who never disobey Allah in that which He orders and do what they are ordered."
          ],
          "en.sahih": [
            "O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded."
          ],
          "en.sarwar": [
            "Believers, save yourselves and your families from the fire which is fueled by people and stones and is guarded by stern angels who do not disobey God's commands and do whatever they are ordered to do."
          ],
          "en.shakir": [
            "O you who believe! save yourselves and your families from a fire whose fuel is men and stones; over it are angels stern and strong, they do not disobey Allah in what He commands them, and do as they are commanded."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo qoo anfusakum waahleekum n<u>a</u>ran waqooduh<u>a</u> a<b>l</b>nn<u>a</u>su wa<b>a</b>l<u>h</u>ij<u>a</u>ratu AAalayh<u>a</u> mal<u>a</u>ikatun ghil<u>a</u><i><u>th</u></i>un shid<u>a</u>dun l<u>a</u> yaAA<u>s</u>oona All<u>a</u>ha m<u>a</u> amarahum wayafAAaloona m<u>a</u> yumaroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Believers, safeguard yourselves and your families from a Fire fuelled by people and stones, and watched over by angels, stern and strong: angels who never disobey God's commands to them, but promptly do as they are commanded."
          ],
          "en.yusufali": [
            "O ye who believe! save yourselves and your families from a Fire whose fuel is Men and Stones, over which are (appointed) angels stern (and) severe, who flinch not (from executing) the Commands they receive from Allah, but do (precisely) what they are commanded."
          ],
          "fa.ansarian": [
            "ای مؤمنان! خود و خانواده خود را از آتشی که هیزم آن انسان ها و سنگ ها است، حفظ کنید. بر آن فرشتگانی خشن و سخت گیر گمارده شده اند که از آنچه خدا به آنان دستور داده، سرپیچی نمی کنند، و آنچه را به آن مأمورند، همواره انجام می دهند."
          ],
          "fa.ayati": [
            "اى كسانى كه ايمان آورده‌ايد، خود و خانواده خود را از آتشى كه هيزم آن مردم و سنگها هستند نگه داريد. فرشتگانى درشت‌گفتار و سختگير بر آن آتش موكّلند. هر چه خدا بگويد نافرمانى نمى‌كنند و همان مى‌كنند كه به آن مأمور شده‌اند."
          ],
          "fa.bahrampour": [
            "اى كسانى كه ايمان آورده‌ايد! خود و خانواده‌ى خويش را از آتشى كه هيزم آن، مردم و سنگ‌ها هستند حفظ كنيد كه بر آن فرشتگانى خشن و سختگير نگهبانند و از آنچه خدا به آنان دستور داده سرپيچى نمى‌كنند و آنچه را كه مأمور شده‌اند انجام مى‌دهند"
          ],
          "fa.fooladvand": [
            "اى كسانى كه ايمان آورده‌ايد، خودتان و كسانتان را از آتشى كه سوخت آن، مردم و سنگهاست حفظ كنيد: بر آن [آتش‌] فرشتگانى خشن [و] سختگير [گمارده شده‌] اند. از آنچه خدا به آنان دستور داده سرپيچى نمى‌كنند و آنچه را كه مأمورند انجام مى‌دهند."
          ],
          "fa.ghomshei": [
            "ای کسانی که ایمان آورده‌اید، خود را با خانواده خویش از آتش دوزخ نگاه دارید چنان آتشی که مردم (دل‌سخت کافر) و سنگ (خارا) آتش‌افروز اوست و بر آن دوزخ فرشتگانی بسیار درشت‌خو و دل‌سخت مأمورند که هرگز نافرمانی خدا را (در اجرای قهر و غضب حق) نخواهند کرد و آنچه به آنها حکم شود انجام دهند."
          ],
          "fa.khorramdel": [
            "ای مؤمنان! خود و خانواده خویش را از آتش دوزخی بر کنار دارید که افروزینه‌ی آن انسانها و سنگها است. فرشتگانی بر آن گمارده شده‌اند که خشن و سختگیر، و زورمند و توانا هستند. از خدا در آنچه بدیشان دستور داده است نافرمانی نمی‌کنند، و همان چیزی را انجام می‌دهند که بدان مأمور شده‌اند. [[«قُوا»: مصون و محفوظ دارید. «أَهْلِیکُمْ»: (نگا: مائده / 98). «وَقُودُ»: افروزینه (نگا: بقره / 24، آل‌عمران / 10). «غِلاظٌ»: جمع غَلیظ، خشن، تندخو. «شِدَادٌ»: جمع شَدید، زورمند. سختگیر. توانا در انجام کارهای دشوار.]]"
          ],
          "fa.khorramshahi": [
            "ای مؤمنان خود و خانواده‌تان را از آتشی حفظ کنید که هیزم آن مردم و سنگها هستند و فرشتگانی درشت‌خو و سخت‌رو بر آن گمارده‌اند که از خداوند در آنچه فرمانشان دهد سرپیچی نمی‌کنند، و هر چه به ایشان فرمان داده می‌شود، انجام دهند"
          ],
          "fa.makarem": [
            "ای کسانی که ایمان آورده‌اید خود و خانواده خویش را از آتشی که هیزم آن انسانها و سنگهاست نگه دارید؛ آتشی که فرشتگانی بر آن گمارده شده که خشن و سختگیرند و هرگز فرمان خدا را مخالفت نمی‌کنند و آنچه را فرمان داده شده‌اند (به طور کامل) اجرا می‌نمایند!"
          ],
          "fa.moezzi": [
            "ای آنان که ایمان آوردید بازدارید خود و خاندان خویش را از آتشی که سوخت آن مردمان است و سنگ بر آن است فرشتگانی دژم (درشت خوی) سخت‌گیرانی که نافرمانی نکنند خدا را آنچه فرمایدشان و بکنند آنچه را که فرموده شوند"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه ايمان آورده‌ايد، خود و خانواده خود را از آتشى كه هيمه آن مردم و سنگ- كافران و بتها- باشند نگاه داريد كه بر آن فرشتگانى درشت خو و سختگير نگهبانند كه خداى را در آنچه به آنان فرمايد نافرمانى نكنند و هر چه فرمايندشان همان كنند."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که ایمان آوردید! خودهاتان و کسانتان را از آتشی که سوختِ آن، مردم و سنگ است نگه دارید. بر آن (آتش) فرشتگانی خشن (و) سختگیر (گمارده شده)اند (که) از آنچه خدا به آنان دستور داده سرپیچی نمی‌کنند و آنچه را که مأمور می‌شوند انجام می‌دهند."
          ]
        }
      },
      {
        "index": 5236,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:66:7",
        "refs": {
          "Mentioned In": [
            "/books/al-kafi:5:2:8:5"
          ]
        },
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ کَفَرُوا لاَ تَعْتَذِرُوا الْيَوْمَ‌ إِنَّمَا تُجْزَوْنَ‌ مَا کُنْتُمْ‌ تَعْمَلُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "(And say:) \"O you who do not believe, make no excuses today. You will be requited only for what you had done.\""
          ],
          "en.ahmedraza": [
            "“O disbelievers! Do not feign excuses this day; you will only be repaid what you used to do.”"
          ],
          "en.arberry": [
            "'O you unbelievers, do not excuse yourselves today; you are only being recompensed for what you were doing.'"
          ],
          "en.daryabadi": [
            "O ye who disbelieve! excuse not yourselves To-day; ye are only being requited for that which ye have been working."
          ],
          "en.hilali": [
            "(It will be said in the Hereafter) O you who disbelieve (in the Oneness of Allah - Islamic Monotheism)! Make no excuses this Day! You are being requited only for what you used to do."
          ],
          "en.itani": [
            "O you who disbelieved! Make no excuses today. You are being repaid for what you used to do."
          ],
          "en.maududi": [
            "(It will then be said): “Unbelievers, make no excuses today. You are being recompensed for nothing else but your deeds.”"
          ],
          "en.mubarakpuri": [
            "(It will be said in the Hereafter) O you who disbelieve! Make no excuses this Day! You are being requited only for what you used to do."
          ],
          "en.pickthall": [
            "(Then it will be said): O ye who disbelieve! Make no excuses for yourselves this day. Ye are only being paid for what ye used to do."
          ],
          "en.qarai": [
            "[They will call out to the faithless:] ‘O faithless ones! Do not make any excuses today. You are being requited only for what you used to do.’"
          ],
          "en.qaribullah": [
            "Unbelievers, make no excuse for yourselves this Day. You shall be recompensed only according to your deeds."
          ],
          "en.sahih": [
            "O you who have disbelieved, make no excuses that Day. You will only be recompensed for what you used to do."
          ],
          "en.sarwar": [
            "Disbelievers (will be told on the Day of Judgment), \"Do not make any excuses on this day; you are only receiving recompense for what you have done\"."
          ],
          "en.shakir": [
            "O you who disbelieve! do not urge excuses today; you shall be rewarded only according to what you did."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena kafaroo l<u>a</u> taAAta<u>th</u>iroo alyawma innam<u>a</u> tujzawna m<u>a</u> kuntum taAAmaloon<b>a</b>"
          ],
          "en.wahiduddin": [
            "You who are bent on denying the truth, make no excuses today: you are only being rewarded according to your deeds."
          ],
          "en.yusufali": [
            "(They will say), \"O ye Unbelievers! Make no excuses this Day! Ye are being but requited for all that ye did!\""
          ],
          "fa.ansarian": [
            "[آن روز گویند:] ای کافران! امروز عذرخواهی مکنید، فقط آنچه را همواره انجام می دادید، جزا داده می شوید."
          ],
          "fa.ayati": [
            "اى كافران، در آن روز پوزش مخواهيد. جز اين نيست كه برابر كارى كه كرده‌ايد كيفر داده شويد."
          ],
          "fa.bahrampour": [
            "اى كسانى كه كافر شده‌ايد! امروز عذر مخواهيد، جز اين نيست كه شما بدانچه مى‌كرده‌ايد مجازات مى‌شويد"
          ],
          "fa.fooladvand": [
            "اى كسانى كه كافر شده‌ايد، امروز عذر نياوريد، در واقع به آنچه مى‌كرديد كيفر مى‌يابيد."
          ],
          "fa.ghomshei": [
            "(به کافران گویند) ای کافران، امروز عذرخواهی مکنید (که پذیرفته نیست) تنها آنچه (در دنیا) می‌کرده‌اید به آن مجازات می‌شوید."
          ],
          "fa.khorramdel": [
            "(در روز قیامت خطاب به بی‌دینان گفته می‌شود): ای کافران! امروزه پوزش مخواهید و عذر خواهی مکنید، چرا که تنها در برابر کارهائی که (در دنیا) می‌کرده‌اید کیفر داده می‌شوید. [[«لا تَعْتَذِرُوا»: (نگا: روم / 57، غافر / 52).]]"
          ],
          "fa.khorramshahi": [
            "ای کافران امروز عذرخواهی مکنید، فقط در برابر کاری که کرده‌اید جزا یابید"
          ],
          "fa.makarem": [
            "ای کسانی که کافر شده‌اید امروز عذرخواهی نکنید، چرا که تنها به اعمالتان جزا داده می‌شوید!"
          ],
          "fa.moezzi": [
            "ای آنان که کفر ورزیدند بهانه نیارید امروز جز این نیست که پاداش داده شوید آنچه را بودید می‌کردید"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه كافر شديد امروز- روز رستاخيز- عذر مخواهيد، جز اين نيست كه آنچه مى‌كرده‌ايد كيفر داده مى‌شويد."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که کافر شدید! امروز عذر نیاورید، تنها همان را که عمل می‌کرده‌اید کیفر می‌یابید."
          ]
        }
      },
      {
        "index": 5237,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:66:8",
        "refs": {
          "Mentioned In": [
            "/books/al-kafi:2:1:191:3",
            "/books/al-kafi:2:1:191:4",
            "/books/al-kafi:5:1:4:1"
          ]
        },
        "text": [
          "يَا أَيُّهَا الَّذِينَ‌ آمَنُوا تُوبُوا إِلَى‌ اللَّهِ‌ تَوْبَةً نَصُوحاً عَسَى‌ رَبُّکُمْ‌ أَنْ‌ يُکَفِّرَ عَنْکُمْ‌ سَيِّئَاتِکُمْ‌ وَ يُدْخِلَکُمْ‌ جَنَّاتٍ‌ تَجْرِي‌ مِنْ‌ تَحْتِهَا الْأَنْهَارُ يَوْمَ‌ لاَ يُخْزِي‌ اللَّهُ‌ النَّبِيَ‌ وَ الَّذِينَ‌ آمَنُوا مَعَهُ‌ نُورُهُمْ‌ يَسْعَى‌ بَيْنَ‌ أَيْدِيهِمْ‌ وَ بِأَيْمَانِهِمْ‌ يَقُولُونَ‌ رَبَّنَا أَتْمِمْ‌ لَنَا نُورَنَا وَ اغْفِرْ لَنَا إِنَّکَ‌ عَلَى‌ کُلِ‌ شَيْ‌ءٍ قَدِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "O you who believe, turn to God truly in repentance. Perhaps your Lord may forgive your ills and admit you to gardens with rivers flowing by on the day when God will not humiliate the Prophet and those who believe with him. Their light will move in front of them and to their right, and they will say: \"O Lord, perfect our light and forgive us. You have power over every thing.\""
          ],
          "en.ahmedraza": [
            "O People who Believe! Incline towards Allah in a repentance that becomes a guidance for the future; it is likely that your Lord will relieve you of your sins and admit you into Gardens beneath which rivers flow – on the day when Allah will not humble the Prophet and the believers along with him; their light will be running ahead of them and on their right; they will say, “Our Lord! Perfect our light for us, and forgive us; indeed You are Able to do all things.”"
          ],
          "en.arberry": [
            "Believers, turn to God in sincere repentance; it may be that your Lord will acquit you of your evil deeds, and will admit you into gardens underneath which rivers flow. Upon the day when God will not degrade the Prophet and those who believe with him, their light running before them, and on their right hands; and they say, 'Our 'Lord, perfect for us our light, and forgive us; surely Thou art powerful over everything.'"
          ],
          "en.daryabadi": [
            "O ye who believe! turn Unto Allah with a sincere repentance. Belike your Lord will expiate from you your misdeeds and cause you to enter Gardens whereunder rivers flow, on the Day whereon Allah will not humiliate the prophet and those who believe with him. Their light will be running before them and on their right hands, and they will say: our Lord! perfect for us our light, and forgive us; verily Thou art over everything Potent."
          ],
          "en.hilali": [
            "O you who believe! Turn to Allah with sincere repentance! It may be that your Lord will remit from you your sins, and admit you into Gardens under which rivers flow (Paradise) the Day that Allah will not disgrace the Prophet (Muhammad SAW) and those who believe with him, their Light will run forward before them and with (their Records Books of deeds) in their right hands they will say: \"Our Lord! Keep perfect our Light for us [and do not put it off till we cross over the Sirat (a slippery bridge over the Hell) safely] and grant us forgiveness. Verily, You are Able to do all things.\""
          ],
          "en.itani": [
            "O you who believe! Repent to God with sincere repentance. Perhaps your Lord will remit your sins, and admit you into gardens beneath which rivers flow, on the Day when God will not disappoint the Prophet and those who believed with him. Their light streaming before them, and to their right, they will say, “Our Lord, complete our light for us, and forgive us; You are capable of all things.”"
          ],
          "en.maududi": [
            "Believers, turn to Allah in sincere repentance; maybe your Lord will expunge your evil deeds and admit you to the Gardens beneath which rivers flow. This will be on the Day when Allah will not disgrace the Prophet and those who have embraced faith and are with him; their light will be running before them and on their right hands, and they will say: “Our Lord, perfect for us our light and forgive us. Surely You have power over everything.”"
          ],
          "en.mubarakpuri": [
            "O you who believe! Turn to Allah with sincere repentance! It may be that your Lord will expiate from you your sins, and admit you into Gardens under which rivers flow -- the Day that Allah will not disgrace the Prophet and those who believe with him. Their light will run forward before them and in their right hands. They will say: \"Our Lord! Keep perfect our light for us and grant us forgiveness. Verily, You are Able to do all things.\""
          ],
          "en.pickthall": [
            "O ye who believe! Turn unto Allah in sincere repentance! It may be that your Lord will remit from you your evil deeds and bring you into Gardens underneath which rivers flow, on the day when Allah will not abase the Prophet and those who believe with him. Their light will run before them and on their right hands; they will say: Our Lord! Perfect our light for us, and forgive us! Lo! Thou art Able to do all things."
          ],
          "en.qarai": [
            "O you who have faith! Repent to Allah with sincere repentance! Maybe your Lord will absolve you of your misdeeds and admit you into gardens with streams running in them, on the day when Allah will not let down the Prophet and the faithful who are with him. Their light will move swiftly before them and on their right. They will say, ‘Our Lord! Perfect our light for us, and forgive us! Indeed You have power over all things.’"
          ],
          "en.qaribullah": [
            "Believers, turn to Allah in sincere repentance. Your Lord may acquit you of your sins, and admit you to Gardens underneath which rivers flow on a Day whenAllah will not degrade the Prophet and those who believe with him. Their light will run before them and on their right hands, and they will say: 'Our Lord, completeour light for us and forgive us. Surely, You have power over all things'"
          ],
          "en.sahih": [
            "O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow [on] the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will proceed before them and on their right; they will say, \"Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.\""
          ],
          "en.sarwar": [
            "Believers, turn to God in repentance with the intention of never repeating the same sin. Perhaps your Lord will expiate your evil deeds and admit you to Paradise wherein streams flow. On the Day of Judgment, God will not disgrace the Prophet and those who have believed in him. Their lights will shine in front of them and to their right. They will say, \"Our Lord, perfect our light for us and forgive our sins. You have power over all things\"."
          ],
          "en.shakir": [
            "O you who believe! turn to Allah a sincere turning; maybe your Lord will remove from you your evil and cause you to enter gardens beneath which rivers flow, on the day on which Allah will not abase the Prophet and those who believe with him; their light shall run on before them and on their right hands; they shall say: Our Lord! make perfect for us our light, and grant us protection, surely Thou hast power over all things."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> alla<u>th</u>eena <u>a</u>manoo tooboo il<u>a</u> All<u>a</u>hi tawbatan na<u>s</u>oo<u>h</u>an AAas<u>a</u> rabbukum an yukaffira AAankum sayyi<u>a</u>tikum wayudkhilakum jann<u>a</u>tin tajree min ta<u>h</u>tih<u>a</u> alanh<u>a</u>ru yawma l<u>a</u> yukhzee All<u>a</u>hu a<b>l</b>nnabiyya wa<b>a</b>lla<u>th</u>eena <u>a</u>manoo maAAahu nooruhum yasAA<u>a</u> bayna aydeehim wabiaym<u>a</u>nihim yaqooloona rabban<u>a</u> atmim lan<u>a</u> nooran<u>a</u> wa<b>i</b>ghfir lan<u>a</u> innaka AAal<u>a</u> kulli shayin qadeer<b>un</b>"
          ],
          "en.wahiduddin": [
            "Believers, turn to God in sincere repentance. Your Lord may well forgive your bad deeds and admit you into gardens watered by running streams, on a Day when God will not abase the Prophet and those who have believed with him. Their light will shine out ahead of them and on their right, and they will say: \"Lord perfect our light for us, and forgive us; You have power over all things.\""
          ],
          "en.yusufali": [
            "O ye who believe! Turn to Allah with sincere repentance: In the hope that your Lord will remove from you your ills and admit you to Gardens beneath which Rivers flow,- the Day that Allah will not permit to be humiliated the Prophet and those who believe with him. Their Light will run forward before them and by their right hands, while they say, \"Our Lord! Perfect our Light for us, and grant us Forgiveness: for Thou hast power over all things.\""
          ],
          "fa.ansarian": [
            "ای مؤمنان! به پیشگاه خدا توبه کنید، توبه ای خالص [که شما را از بازگشت به گناه بازدارد]؛ امید است پروردگارتان گناهانتان را از شما محو کند و شما را به بهشت هایی که از زیرِ [درختانِ] آن نهرها جاری است، درآورد، در آن روزی که خدا پیامبر و کسانی که با او ایمان آورده اند، خوار نمی کند، نورشان پیشاپیش آنان و از سوی راستشان شتابان حرکت می کند، می گویند: پروردگارا! نور ما را برای ما کامل کن و ما را بیامرز که تو بر هر کاری توانایی."
          ],
          "fa.ayati": [
            "اى كسانى كه ايمان آورده‌ايد، به درگاه خدا توبه كنيد؛ توبه‌اى از روى اخلاص. باشد كه پروردگارتان گناهانتان را محو كند و شما را به بهشتهايى داخل كند كه در آن نهرها جارى است. در آن روز، خدا پيامبر و كسانى را كه با او ايمان آورده‌اند فرو نگذارد، و نورشان پيشاپيش و سمت راستشان در حركت باشد. مى‌گويند: اى پروردگار ما، نور ما را براى ما به كمال رسان و ما را بيامرز، كه تو بر هر كارى توانا هستى."
          ],
          "fa.bahrampour": [
            "اى كسانى كه ايمان آورده‌ايد! به درگاه خدا توبه كنيد، توبه‌اى راستين و خالص، اميد است كه پروردگار شما بدى‌هايتان را از شما بزدايد و شما را به باغ‌هايى كه از پاى درختانش نهرها جارى است در آورد. روزى كه خدا، پيامبر و كسانى را كه با او ايمان آورده‌اند خوا"
          ],
          "fa.fooladvand": [
            "اى كسانى كه ايمان آورده‌ايد، به درگاه خدا توبه‌اى راستين كنيد، اميد است كه پروردگارتان بديهايتان را از شما بزدايد و شما را به باغهايى كه از زير [درختان‌] آن جويبارها روان است درآورد. در آن روز خدا پيامبر [خود] و كسانى را كه با او ايمان آورده بودند خوار نمى‌گرداند: نورشان از پيشاپيش آنان، و سمت راستشان، روان است. مى‌گويند: «پروردگارا، نور ما را براى ما كامل گردان و بر ما ببخشاى، كه تو بر هر چيز توانايى.»"
          ],
          "fa.ghomshei": [
            "الا ای مؤمنان، به درگاه خدا توبه نصوح (با خلوص و دوام) کنید، باشد که پروردگارتان گناهانتان را مستور گرداند و شما را در باغهای بهشتی که زیر درختانش نهرها جاری است داخل کند در آن روزی که خدا پیغمبر خود و گرویدگان به او را ذلیل نسازد (بلکه عزیز و سرفراز ابد گرداند، در آن روز) نور (ایمان و عبادت) آنها در پیش رو و سمت راست ایشان می‌رود (و راه بهشتشان می‌نماید) و در آن حال (به شوق و نشاط) گویند: پروردگارا، تو نور ما را به حد کمال رسان و ما را (به لطف و کرم خود) ببخش که البته تو بر هر چیز توانایی."
          ],
          "fa.khorramdel": [
            "ای مؤمنان! به درگاه خدا برگردید و توبه‌ی خالصانه‌ای بکنید، شاید پروردگارتان گناهانتان را محو نماید و بزداید، و شما را به باغهای بهشتی داخل گرداند که از زیر (کاخها و درختان) آن رودبارها روان است. این کار در روزی خواهد بود که خداوند پیغمبر و کسانی را خوار و سبک نمی‌دارد که با او ایمان آورده‌اند. (بلکه ایشان را والا می‌گرداند و به درجات بالا می‌رساند). نور (ایمان و عمل صالح) ایشان، پیشاپیش و سوی راستشان (رو به جانب بهشت) در حرکت است. (وقتی که خاموش شدن نور منافقان را می‌بینند، رو به درگاه خدا می‌کنند و) می‌گویند: پروردگارا! نور ما را کامل گردان (تا در پرتو آن به بهشت برسیم) و ما را ببخشای، چرا که تو بر هر چیزی بس توانائی. [[«نَصُوحاً»: از روی اخلاص. خالصانه. صیغه مبالغه است. توبه نَصُوح، باید این ویژگیها را داشته باشد، ترک گناه، پشیمان شدن از گناه، تصمیم بر برنگشتن به گناه، ردّ مظالم و بازپرداخت حق به صاحبان آن. «نُورُهُمْ یَسْعی»: (نگا: حدید / 12 و 13). «أَتْمِمْ لَنَا نُورَنَا»: درخواست تکمیل نور یا از سوی همه مؤمنان است، و این تقاضا وقتی است که نور منافقان خاموش می‌گردد. مؤمنان از خدای متعال می‌خواهند که تا رسیدن به بهشت نورشان بماند. یا این که نور برخی از مؤمنان، ضعیف بوده و درخواست می‌نمایند که نورشان پرتو و تابندگی بیشتری داشته باشد.]]"
          ],
          "fa.khorramshahi": [
            "ای مؤمنان به درگاه خداوند توبه‌ای خالصانه کنید، چه بسا پروردگارتان گناهانتان را از شما بزداید و شما را به بوستانهایی که جویباران از فرودست آن جاری است، در آورد [در] روزی که خداوند پیامبر و ایمان آوردگان همراه او را فرو نگذارد، نورشان در پیشاپیش و سمت راستشان می‌شتابد، گویند پروردگارا نور ما را برای ما به کمال برسان، و ما را بیامرز، که تو بر هر کاری توانایی‌"
          ],
          "fa.makarem": [
            "ای کسانی که ایمان آورده‌اید بسوی خدا توبه کنید، توبه‌ای خالص؛ امید است (با این کار) پروردگارتان گناهانتان را ببخشد و شما را در باغهایی از بهشت که نهرها از زیر درختانش جاری است وارد کند، در آن روزی که خداوند پیامبر و کسانی را که با او ایمان آوردند خوار نمی‌کند؛ این در حالی است که نورشان پیشاپیش آنان و از سوی راستشان در حرکت است، و می‌گویند: «پروردگارا! نور ما را کامل کن و ما را ببخش که تو بر هر چیز توانائی!»"
          ],
          "fa.moezzi": [
            "ای آنان که ایمان آوردید توبه کنید بسوی خدا توبه نصوح امید است پروردگار شما بسترد از شما بدیهای شما را و درآرد شما را باغهائی که روان است زیر آنها جویها روزی که خوار نگرداند خدا پیمبر و آنان را که ایمان آوردند با او پرتو ایشان می‌دود پیش روی ایشان و بر سوی راستشان گویند پروردگارا تمام گردان برای ما نور ما را و بیامرز ما را که توئی بر همه چیز توانا"
          ],
          "fa.mojtabavi": [
            "اى كسانى كه ايمان آورده‌ايد، به خداى بازگرديد- توبه كنيد- بازگشتى به صدق و اخلاص- كه از روى پشيمانى بر گناه و ترك آن و استغفار باشد- اميد است پروردگارتان بديهاتان را از شما بزدايد و شما را به بهشتهايى درآرد كه از زير آنها جويها روان است، روزى كه خدا پيامبر و كسانى را كه با او ايمان آورده‌اند خوار نسازد- بلكه با واردكردنشان به بهشت گرامى‌شان دارد-، نورشان پيشاپيش ايشان و از سوى راستشان مى‌رود، مى‌گويند: پروردگارا، نور ما را براى ما كامل ساز و ما را بيامرز، كه تو بر هر چيزى توانايى."
          ],
          "fa.sadeqi": [
            "هان ای کسانی که ایمان آوردید! سوی خدا بازگشتی بسیار ناصحا‌نه کنید. امید است که پروردگارتان بدی‌هایتان را از شما بزداید و شما را به باغ‌هایی که از زیر (درختان)شان نهرها روان است در آورد. روزی که خدا پیامبر برجسته(ی خود) و کسانی را که با او ایمان آورده بودند خوار نمی‌گرداند، نورشان از پیشاپیش آنان و سمت راستشان می‌شتابد، گویند: «پروردگارمان! نورمان را برایمان کامل گردان و برایمان (گناهانمان را) بپوشان، که تو بر هر چیزی بسیار توانایی.»"
          ]
        }
      },
      {
        "index": 5238,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:66:9",
        "refs": {
          "Mentioned In": [
            "/books/al-kafi:2:1:171:2"
          ]
        },
        "text": [
          "يَا أَيُّهَا النَّبِيُ‌ جَاهِدِ الْکُفَّارَ وَ الْمُنَافِقِينَ‌ وَ اغْلُظْ عَلَيْهِمْ‌ وَ مَأْوَاهُمْ‌ جَهَنَّمُ‌ وَ بِئْسَ‌ الْمَصِيرُ"
        ],
        "translations": {
          "en.ahmedali": [
            "O Prophet, fight the unbelievers and the hypocrites, and be severe with them. Their abode is Hell, an evil destination?"
          ],
          "en.ahmedraza": [
            "O dear Prophet (Mohammed – peace and blessings be upon him), wage holy war against the disbelievers and the hypocrites, and be strict with them; and their destination is hell; and what a wretched outcome!"
          ],
          "en.arberry": [
            "O Prophet, struggle with the unbelievers and the hypocrites, and be thou harsh with them; their refuge shall be Gehenna -- an evil homecoming!"
          ],
          "en.daryabadi": [
            "O Prophet! strive hard against the infidels and the hypocrites, and be stern Unto them. And their abode is Hell: a hapless destination!"
          ],
          "en.hilali": [
            "O Prophet (Muhammad SAW)! Strive hard against the disbelievers and the hypocrites, and be severe against them, their abode will be Hell, and worst indeed is that destination."
          ],
          "en.itani": [
            "O prophet! Strive hard against the disbelievers and the hypocrites, and be stern with them. Their abode is Hell. What a miserable destination!"
          ],
          "en.maududi": [
            "O Prophet, strive against the unbelievers and the hypocrites, and be severe with them. Hell shall be their resort. What a grievous end!"
          ],
          "en.mubarakpuri": [
            "O Prophet! Strive hard against the disbelievers and the hypocrites, and be severe against them; their abode will be Hell, and worst indeed is that destination."
          ],
          "en.pickthall": [
            "O Prophet! Strive against the disbelievers and the hypocrites, and be stern with them. Hell will be their home, a hapless journey's end."
          ],
          "en.qarai": [
            "O Prophet! Wage jihad against the faithless and the hypocrites, and be severe with them. Their refuge will be hell, and it is an evil destination."
          ],
          "en.qaribullah": [
            "O Prophet, struggle with the unbelievers and the hypocrites and deal harshly with them. Gehenna (Hell) shall be their refuge, an evil arrival!"
          ],
          "en.sahih": [
            "O Prophet, strive against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination."
          ],
          "en.sarwar": [
            "Prophet, fight against the disbelievers and the hypocrites and be stern against them. Their dwelling will be hell fire, the most terrible fate."
          ],
          "en.shakir": [
            "O Prophet! strive hard against the unbelievers and the hypocrites, and be hard against them; and their abode is hell; and evil is the resort."
          ],
          "en.transliteration": [
            "Y<u>a</u> ayyuh<u>a</u> a<b>l</b>nnabiyyu j<u>a</u>hidi alkuff<u>a</u>ra wa<b>a</b>lmun<u>a</u>fiqeena wa<b>o</b>ghlu<i><u>th</u></i> AAalayhim wamaw<u>a</u>hum jahannamu wabisa alma<u>s</u>eer<b>u</b>"
          ],
          "en.wahiduddin": [
            "Prophet, exert yourself to the utmost against those who deny the truth and the hypocrites. Deal severely with them. Hell will be their abode -- a vile destination."
          ],
          "en.yusufali": [
            "O Prophet! Strive hard against the Unbelievers and the Hypocrites, and be firm against them. Their abode is Hell,- an evil refuge (indeed)."
          ],
          "fa.ansarian": [
            "ای پیامبر! با کافران و منافقان جنگ کن و بر آنان سخت بگیر و جایگاهشان دوزخ است و بد بازگشت گاهی است."
          ],
          "fa.ayati": [
            "اى پيامبر، با كفار و منافقان جهاد كن و بر آنها سخت بگير. جايگاهشان جهنم است كه بد سرانجامى است."
          ],
          "fa.bahrampour": [
            "اى پيامبر! با كافران و منافقان جهاد كن و بر آنها سخت گير كه جايگاهشان جهنم است و چه بد سر انجامى است"
          ],
          "fa.fooladvand": [
            "اى پيامبر، با كافران و منافقان جهاد كن و بر آنان سخت گير [كه‌] جاى ايشان در جهنّم خواهد بود و چه بد سرانجامى است."
          ],
          "fa.ghomshei": [
            "الا ای رسول گرامی، اینک با کفار و منافقان به جهاد و کارزار پرداز و بر آنها (تا ایمان نیاورده‌اند) سخت گیر و (بدان که) مأوای آنها دوزخ است که بسیار بد منزلگاهی است."
          ],
          "fa.khorramdel": [
            "ای پیغمبر! با کافران و منافقان جهاد و پیکار کن (تا ایشان را از کفر و نفاق به دور داری) و بر آنان سخت بگیر و (با ایشان خشن باش. این مجازات کنونی ایشان است، و در آخرت) جایگاهشان دوزخ است و چه بد سرنوشت و چه زشت جایگاهی است! [[«یَآ أَیُّهَا النَّبِیُّ جَاهِدِ»: (نگا: توبه / 73، فرقان / 52). مراد جهاد با کفّار، با قوّت و قدرت تمام، و با منافقان با حجّت و برهان است.]]"
          ],
          "fa.khorramshahi": [
            "ای پیامبر با کافران و منافقان جهاد کن، و با آنان درشتی کن که سرا و سرانجامشان جهنم است و بد سرانجامی است‌"
          ],
          "fa.makarem": [
            "ای پیامبر! با کفّار و منافقین پیکار کن و بر آنان سخت بگیر! جایگاهشان جهنم است، و بد فرجامی است!"
          ],
          "fa.moezzi": [
            "ای پیمبر جهاد کن با کافران و منافقان و درشتی کن بر ایشان و جایگاه ایشان است دوزخ و چه زشت است آن جایگاه‌"
          ],
          "fa.mojtabavi": [
            "اى پيامبر، با كافران و منافقان كارزار كن و بر آنها درشتى و سختگيرى نما، و جايشان دوزخ است، و بد بازگشتگاهى است."
          ],
          "fa.sadeqi": [
            "هان ای پیامبر برجسته! با کافران و منافقان جهاد کن و بر آنان سخت بگیر. و پناه‌گاهشان جهنم است و چه بد سرانجامی است."
          ]
        }
      },
      {
        "index": 5239,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:66:10",
        "refs": {
          "Mentioned In": [
            "/books/al-kafi:2:1:171:2",
            "/books/al-kafi:5:3:27:12"
          ]
        },
        "text": [
          "ضَرَبَ‌ اللَّهُ‌ مَثَلاً لِلَّذِينَ‌ کَفَرُوا امْرَأَةَ نُوحٍ‌ وَ امْرَأَةَ لُوطٍ کَانَتَا تَحْتَ‌ عَبْدَيْنِ‌ مِنْ‌ عِبَادِنَا صَالِحَيْنِ‌ فَخَانَتَاهُمَا فَلَمْ‌ يُغْنِيَا عَنْهُمَا مِنَ‌ اللَّهِ‌ شَيْئاً وَ قِيلَ‌ ادْخُلاَ النَّارَ مَعَ‌ الدَّاخِلِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "God advances the example of Noah's wife and the wife of Lot for those who do not believe. They were married to Our two pious devotees, but they were unfaithful to them, and even (the apostles) could not avail them in the least against God; and it was said to them: \"Enter Hell with those (who are condemned) to enter it.\""
          ],
          "en.ahmedraza": [
            "Allah illustrates the example of the disbelievers – the wife of Nooh and the wife of Lut; they were bonded in marriage to two of Our bondmen deserving Our proximity – they then betrayed them so they did not benefit them the least against Allah and it was declared, “Both of you women enter the fire, along with others who enter.”"
          ],
          "en.arberry": [
            "God has struck a similitude for the unbelievers -- the wife of Noah, and the wife of Lot; for they were under two of Our righteous servants, but they betrayed them, so they availed them nothing whatsoever against God; so it was said, 'Enter, you two, the Fire with those who enter.'"
          ],
          "en.daryabadi": [
            "Allah propoundeth for those who disbelieve the similitude of the wife of Nuh and the wife of Lut. They were under two of our righteous bondmen; then they defrauded them. Wherefore the twain availed them naught against Allah, and it was said: enter ye twain the Fire with those who enter."
          ],
          "en.hilali": [
            "Allah sets forth an example for those who disbelieve, the wife of Nuh (Noah) and the wife of Lout (Lot). They were under two of our righteous slaves, but they both betrayed their (husbands by rejecting their doctrine) so they [Nuh (Noah) and Lout (Lot)] benefited them (their respective wives) not, against Allah, and it was said: \"Enter the Fire along with those who enter!\""
          ],
          "en.itani": [
            "God illustrates an example of those who disbelieve: the wife of Noah and the wife of Lot. They were under two of Our righteous servants, but they betrayed them. They availed them nothing against God, and it was said, “Enter the Fire with those who are entering.”"
          ],
          "en.maududi": [
            "Allah has set forth for the unbelievers the parable of the wives of Noah and Lot. They were wedded to two of Our righteous servants, but each acted treacherously with her husband, and their husbands could be of no avail to them against Allah. The two of them were told: “Enter the Fire with all the others who enter it.”"
          ],
          "en.mubarakpuri": [
            "Allah sets forth an example for those who disbelieve: the wife of Nuh and the wife of Lut. They were under two of our righteous servants, but they both betrayed them. So, they availed them not against Allah and it was said: \"Enter the Fire along with those who enter!\""
          ],
          "en.pickthall": [
            "Allah citeth an example for those who disbelieve: the wife of Noah and the wife of Lot, who were under two of Our righteous slaves yet betrayed them so that they (the husbands) availed them naught against Allah and it was said (unto them): Enter the Fire along with those who enter."
          ],
          "en.qarai": [
            "Allah cites an example of the faithless: the wife of Noah and the wife of Lot. They were under two of our righteous servants, yet they betrayed them. So they did not avail them in any way against Allah, and it was said [to them], ‘Enter the Fire, along with those who enter [it].’"
          ],
          "en.qaribullah": [
            "Allah has given as an example for the unbelievers, the wife of Noah and the wife of Lot. They were married to two of Our righteous worshipers, but theybetrayed them. It was not for (Noah and Lot) to avail them a thing. It was said to them both: 'Enter the Fire with those who shall enter'"
          ],
          "en.sahih": [
            "Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, \"Enter the Fire with those who enter.\""
          ],
          "en.sarwar": [
            "God has told the disbelievers the story of the wives of Noah and Lot as a parable. They were married to two of Our righteous servants but were unfaithful to them. Nothing could protect them from the (wrath) of God and they were told to enter hell fire with the others."
          ],
          "en.shakir": [
            "Allah sets forth an example to those who disbelieve the wife of Nuh and the wife of Lut: they were both under two of Our righteous servants, but they acted treacherously towards them so they availed them naught against Allah, and it was said: Enter both the fire with those who enter."
          ],
          "en.transliteration": [
            "<u>D</u>araba All<u>a</u>hu mathalan lilla<u>th</u>eena kafaroo imraata noo<u>h</u>in wa<b>i</b>mraata loo<u>t</u>in k<u>a</u>nat<u>a</u> ta<u>h</u>ta AAabdayni min AAib<u>a</u>din<u>a</u> <u>sa</u>li<u>h</u>ayni fakh<u>a</u>nat<u>a</u>hum<u>a</u> falam yughniy<u>a</u> AAanhum<u>a</u> mina All<u>a</u>hi shayan waqeela odkhul<u>a</u> a<b>l</b>nn<u>a</u>ra maAAa a<b>l</b>dd<u>a</u>khileen<b>a</b>"
          ],
          "en.wahiduddin": [
            "As an example to those who are bent on denying the truth, God cited the wife of Noah and the wife of Lot, who were married to two of Our righteous servants, but who betrayed them. So they could not help them against God, and they were told, \"Enter the Fire along with all the others.\""
          ],
          "en.yusufali": [
            "Allah sets forth, for an example to the Unbelievers, the wife of Noah and the wife of Lut: they were (respectively) under two of our righteous servants, but they were false to their (husbands), and they profited nothing before Allah on their account, but were told: \"Enter ye the Fire along with (others) that enter!\""
          ],
          "fa.ansarian": [
            "خدا برای کافران، زن نوح و زن لوط را مثل زده که تحت سرپرستی و زوجیت دو بنده شایسته از بندگان ما بودند، ولی [در امر دین و دین داری] به آن دو [بنده شایسته ما] خیانت ورزیدند، و آن دو [پیامبر] چیزی از عذاب خدا را از آن دو زن دفع نکردند و [هنگام مرگ] به آن دو گفته شد: با وارد شوندگان وارد آتش شوید."
          ],
          "fa.ayati": [
            "خدا براى كافران مثَل زن نوح و زن لوط را مى‌آورد كه هر دو در نكاح دو تن از بندگان صالح ما بودند و به آن دو خيانت ورزيدند. و آنها نتوانستند از زنان خود دفع عذاب كنند و گفته شد: با ديگران به آتش درآييد."
          ],
          "fa.bahrampour": [
            "خدا براى كسانى كه كافر شده‌اند، زن نوح و زن لوط را مثل آورده كه هر دو در نكاح دو بنده‌ى شايسته از بندگان ما بودند و به آنها خيانت كردند، و آن دو [پيامبر] نتوانستند در برابر خدا كارى براى آن دو [زن‌] انجام دهند و گفته شد: با داخل شوندگان، داخل آتش شوي"
          ],
          "fa.fooladvand": [
            "خدا براى كسانى كه كفر ورزيده‌اند، آن نوح و آن لوط را مَثَل آورده [كه‌] هر دو در نكاح دو بنده از بندگان شايسته ما بودند و به آنها خيانت كردند، و كارى از دست [شوهران‌] آنها در برابر خدا ساخته نبود، و گفته شد: «با داخل شوندگان داخل آتش شويد.»"
          ],
          "fa.ghomshei": [
            "خدا برای کافران زن نوح و زن لوط را مثال آورد که تحت (فرمان) دو بنده صالح ما بودند و به آنها (نفاق و) خیانت کردند و آن دو شخص (با وجود مقام نبوت) نتوانستند آنها را از (قهر) خدا برهانند و به آنها حکم شد که با دوزخیان در آتش درآیید."
          ],
          "fa.khorramdel": [
            "خداوند از میان کافران، زن نوح و زن لوط را مثل زده است. آنان در حباله‌ی نکاح دو تن از بندگان خوب ما بودند و (با ساخت و پاخت با قوم خود، و گزارش اسرار و اخبار بدیشان) به آن دو خیانت کردند و آن دو نتوانستند در پیشگاه الهی کمترین کاری برای ایشان بکنند و (آنان را از عذاب خانمانسوز دنیوی، و سخت کمرشکن اخروی نجات دهند. به هنگام مرگ توسّط فرشتگان بدیشان) گفته شد: به دوزخ درآئید همراه با همه‌ی کسانی که بدان در می‌آیند. [[«إمْرَأَةَ»: در رسم‌الخطّ قرآنی با تاء کشیده نوشته شده است. مفعولٌ‌به اوّل فعل (ضَرَبَ) و (مَثَلاً) مفعولٌ‌به دوم آن است. «تَحْتَ»: این واژه، کنایه از تحت سرپرستی و زیر نکاح است. «خَانَتَاهُمَا»: خیانت این دو همسرِ بدشگون، همکاری با دشمنان و گزارش اخبار و پخش اسرار خانواده و مؤمنان بود. خیانت ایشان انحراف از جاده عفّت نبود. زیرا هرگز همسر هیچ پیغمبری آلوده به بی‌عفّتی نشده است (نگا: نمونه، جلد 24، صفحه 301). «أُدْخُلاَ النَّارَ»: به هنگام مرگ، فرشتگان به بدان یا نیکان خبر ورود آتی ایشان به دوزخ یا به بهشت را می‌دهند (نگا: المصحف المیسّر). «فَلَمْ یُغْنِیا»: در آخرت همه رابطه‌های دنیوی جز رابطه ایدئولوژی گسیخته می‌گردد (نگا: بقره / 48 و 123، لقمان / 33، ممتحنه / 3، انفطار / 19).]]"
          ],
          "fa.khorramshahi": [
            "خداوند درباره کافران مثلی می‌زند، و آن همسر نوح است و همسر لوط که در حباله دو بنده از بندگان شایسته ما بودند، سپس به ایشان خیانت کردند، و آن دو [پیامبر] در برابر امر [و عذاب‌] الهی چیزی را از آنان باز نداشتند، و [به آنان‌] گفته شود، همراه سایر وارد شوندگان، وارد آتش [جهنم‌] شوید"
          ],
          "fa.makarem": [
            "خداوند برای کسانی که کافر شده‌اند به همسر نوح و همسر لوط مثَل زده است، آن دو تحت سرپرستی دو بنده از بندگان صالح ما بودند، ولی به آن دو خیانت کردند و ارتباط با این دو (پیامبر) سودی به حالشان (در برابر عذاب الهی) نداشت، و به آنها گفته شد: «وارد آتش شوید همراه کسانی که وارد می‌شوند!»"
          ],
          "fa.moezzi": [
            "زده است خدا مثَلی برای آنان که کفر ورزیدند زن نوح و زن لوط بودند زیر فرمان دو بنده‌ای از بندگان ما شایستگانی پس خیانت کردند با آنان پس بی‌نیاز نساختندشان از خدا چیزی را و گفته شد به آتش درآئید با درآیندگان‌"
          ],
          "fa.mojtabavi": [
            "خدا براى كسانى كه كافر شدند مَثَلى آورده است: زن نوح و زن لوط را، كه اين دو زير [فرمان‌] دو بنده از بندگان شايسته ما بودند، پس به آن دو خيانت كردند، و آن دو [پيامبر] در برابر خدا هيچ سودى براى آن دو [زن‌] نداشتند- عذاب را از آنها دور نكردند- و [به آنان‌] گفته شد: به آتش در آييد با در آيندگان."
          ],
          "fa.sadeqi": [
            "خدا برای کسانی که کافر شدند، زن نوح و زن لوط را مَثَل آورده (که) هر دو تحت (نکاح) دو بنده‌ی شایسته از بندگان ما بودند. پس (اینان) به آنان خیانت کردند. و کاری از دست آن دو [:شوهرانشان] درباره‌ی آنان از (عذاب) خدا ساخته نبود. و (به آن دو زن) گفته شد: «با داخل‌شوندگان، در آتش داخل شوید.»"
          ]
        }
      },
      {
        "index": 5240,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:66:11",
        "refs": {
          "Mentioned In": [
            "/books/al-kafi:5:3:27:12"
          ]
        },
        "text": [
          "وَ ضَرَبَ‌ اللَّهُ‌ مَثَلاً لِلَّذِينَ‌ آمَنُوا امْرَأَةَ فِرْعَوْنَ‌ إِذْ قَالَتْ‌ رَبِ‌ ابْنِ‌ لِي‌ عِنْدَکَ‌ بَيْتاً فِي‌ الْجَنَّةِ وَ نَجِّنِي‌ مِنْ‌ فِرْعَوْنَ‌ وَ عَمَلِهِ‌ وَ نَجِّنِي‌ مِنَ‌ الْقَوْمِ‌ الظَّالِمِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "And God presents the example of Pharaoh's wife for those who believe, when she said: \"O Lord, build me a house in Paradise, and save me from Pharaoh and his deeds, and save me from a wicked people;\""
          ],
          "en.ahmedraza": [
            "And Allah illustrates an example of the Muslims – the wife of Firaun; when she prayed, “My Lord! Build a house for me near You, in Paradise, and deliver me from Firaun and his works, and rescue me from the unjust people.”"
          ],
          "en.arberry": [
            "God has struck a similitude for the believers -- the wife of Pharaoh, when she said, 'My Lord, build for me a house in Paradise, in Thy presence, and deliver me from Pharaoh and his work, and do Thou deliver me from the people of the evildoers.'"
          ],
          "en.daryabadi": [
            "And Allah propoundeth for those who believe the similitude of the wife Of Fir'awn, when she said: 'my Lord! build me in Thine presence a house in the Garden, and deliver me from Fir'awn and his handiwork, and deliver me from the transgressing people."
          ],
          "en.hilali": [
            "And Allah has set forth an example for those who believe, the wife of Fir'aun (Pharaoh), when she said: \"My Lord! Build for me a home with You in Paradise, and save me from Fir'aun (Pharaoh) and his work, and save me from the people who are Zalimun (polytheists, wrong-doers and disbelievers in Allah)."
          ],
          "en.itani": [
            "And God illustrates an example of those who believe: the wife of Pharaoh, when she said, “My Lord, build for me, with you, a house in Paradise, and save me from Pharaoh and his works, and save me from the wrongdoing people.”"
          ],
          "en.maududi": [
            "Allah has set forth for the believers the parable of Pharaoh's wife. She prayed: “My Lord, build for me a house with You in Paradise and deliver me from Pharaoh and his misdeeds; and deliver me from the iniquitous people.”"
          ],
          "en.mubarakpuri": [
            "And Allah has set forth an example for those who believe: the wife of Fir`awn, when she said: \"My Lord! Build for me a home with You in Paradise, and save me from Fir`awn and his work, and save me from the people who are wrongdoers."
          ],
          "en.pickthall": [
            "And Allah citeth an example for those who believe: the wife of Pharaoh when she said: My Lord! Build for me a home with thee in the Garden, and deliver me from Pharaoh and his work, and deliver me from evil-doing folk;"
          ],
          "en.qarai": [
            "Allah cites an example of the faithful: the wife of Pharaoh, when she said, ‘My Lord! Build me a home near You in paradise, and deliver me from Pharaoh and his conduct, and deliver me from the wrongdoing lot.’"
          ],
          "en.qaribullah": [
            "But to those who believe Allah has given as an example Pharaoh's wife, who said: 'My Lord, build me a house before You in Paradise and save me fromPharaoh and his work, and save me from a harmdoing nation'"
          ],
          "en.sahih": [
            "And Allah presents an example of those who believed: the wife of Pharaoh, when she said, \"My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.\""
          ],
          "en.sarwar": [
            "To the believers, as a parable, God has told the story of the wife of the Pharaoh who said, \"Lord, establish for me a house in Paradise in your presence. Rescue me from Pharaoh and his deeds and save me from the unjust people."
          ],
          "en.shakir": [
            "And Allah sets forth an example to those who believe the wife of Firon when she said: My Lord! build for me a house with Thee in the garden and deliver me from Firon and his doing, and deliver me from the unjust people:"
          ],
          "en.transliteration": [
            "Wa<u>d</u>araba All<u>a</u>hu mathalan lilla<u>th</u>eena <u>a</u>manoo imraata firAAawna i<u>th</u> q<u>a</u>lat rabbi ibni lee AAindaka baytan fee aljannati wanajjinee min firAAawna waAAamalihi wanajjinee mina alqawmi a<b>l</b><i><u>thth</u></i><u>a</u>limeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "To the believers God has given the example of Pharaoh's wife who said: \"My Lord, build me a house in nearness to You in Paradise and save me from Pharaoh and his misdeeds. Save me from all evil-doers.\""
          ],
          "en.yusufali": [
            "And Allah sets forth, as an example to those who believe the wife of Pharaoh: Behold she said: \"O my Lord! Build for me, in nearness to Thee, a mansion in the Garden, and save me from Pharaoh and his doings, and save me from those that do wrong\";"
          ],
          "fa.ansarian": [
            "و خدا برای مؤمنان همسر فرعون را مثل زده است هنگامی که گفت: پروردگارا! برای من نزد خودت خانه ای در بهشت بنا کن ومرا از فرعون وکردارش رهایی بخش ومرا از مردم ستمکار نجات ده."
          ],
          "fa.ayati": [
            "و خدا براى كسانى كه ايمان آورده‌اند، آن فرعون را مثَل مى‌زند آنگاه كه گفت: اى پروردگار من، براى من در بهشت نزد خود خانه‌اى بنا كن و مرا از فرعون و عملش نجات ده و مرا از مردم ستمكاره برهان."
          ],
          "fa.bahrampour": [
            "و خدا براى كسانى كه ايمان آورده‌اند، همسر فرعون را مثل آورده، آن‌گاه كه گفت: پروردگارا! براى من نزد خويش در بهشت خانه‌اى بساز و مرا از [شرّ] فرعون و عمل او نجات ده و مرا از مردم ستمكار برهان"
          ],
          "fa.fooladvand": [
            "و براى كسانى كه ايمان آورده‌اند، خدا همسر فرعون را مثل آورده، آنگاه كه گفت: «پروردگارا، پيش خود در بهشت خانه‌اى برايم بساز، و مرا از فرعون و كردارش نجات ده، و مرا از دست مردم ستمگر برهان.»"
          ],
          "fa.ghomshei": [
            "و باز خدا برای مؤمنان (آسیه) زن فرعون را مَثَل آورد هنگامی که (از شوهر کافرش بیزاری جست و) عرض کرد: بار الها (من از قصر فرعونی و عزت دنیوی او گذشتم) تو خانه‌ای برای من نزد خود در بهشت بنا کن و مرا از شرّ فرعون (کافر) و کردارش و از قوم ستمکار نجات بخش."
          ],
          "fa.khorramdel": [
            "و خدا از میان مؤمنان، زن فرعون را مثل زده است. وقتی (از اوقات) گفت: پروردگارا! برای من در بهشت، نزد خودت خانه‌ای بنا کن، و مرا از فرعون و کارهایش رهائی‌بخش، و از این مردمان ستمکاره نجات بده. [[«إِبْنِ»: بنا کن. بساز.]]"
          ],
          "fa.khorramshahi": [
            "و نیز خداوند درباره مؤمنان مثلی می‌زند و آن همسر فرعون است که [در اوج سختی کشیدن‌] گفت پروردگارا برای من در نزد خودت، خانه‌ای در بهشت بنا کن، و مرا از شر فرعون و عمل او رهایی ده، و از قوم ستمکار نجاتم بخش‌"
          ],
          "fa.makarem": [
            "و خداوند برای مؤمنان، به همسر فرعون مثَل زده است، در آن هنگام که گفت: «پروردگارا! خانه‌ای برای من نزد خودت در بهشت بساز، و مرا از فرعون و کار او نجات ده و مرا از گروه ستمگران رهایی بخش!»"
          ],
          "fa.moezzi": [
            "و زده است خدا مثلی برای آنان که ایمان آوردند زن فرعون را گاهی که گفت پروردگارا بساز برایم نزد خویش خانه‌ای در بهشت و برهانم از فرعون و کردارش و برهانم از گروه ستمگران‌"
          ],
          "fa.mojtabavi": [
            "و خدا براى كسانى كه ايمان آورده‌اند مَثَلى آورده است: زن فرعون را، آنگاه كه گفت: پروردگارا، براى من نزد خويش در بهشت خانه‌اى بساز و مرا از فرعون و كردار او برهان، و مرا از گروه ستمكاران برهان"
          ],
          "fa.sadeqi": [
            "و برای کسانی که ایمان آورده‌اند، خدا همسر فرعون را مَثَل آورد، آن‌گاه که گفت: «پروردگارم! نزد خود در بهشت خانه‌ای برایم بساز و مرا از فرعون و کردارش نجات ده و مرا از دست گروه ستمگران برهان.»"
          ]
        }
      },
      {
        "index": 5241,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:66:12",
        "text": [
          "وَ مَرْيَمَ‌ ابْنَةَ عِمْرَانَ‌ الَّتِي‌ أَحْصَنَتْ‌ فَرْجَهَا فَنَفَخْنَا فِيهِ‌ مِنْ‌ رُوحِنَا وَ صَدَّقَتْ‌ بِکَلِمَاتِ‌ رَبِّهَا وَ کُتُبِهِ‌ وَ کَانَتْ‌ مِنَ‌ الْقَانِتِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "And of Mary, daughter of 'Imran, who guarded her chastity, so that We breathed into her a new life from Us, and she believed the words of her Lord and His Books, and was among the obedient."
          ],
          "en.ahmedraza": [
            "And the example of Maryam the daughter of Imran, who guarded her chastity – We therefore breathed into her a Spirit from Ourselves – and she testified for the Words of her Lord and His Books, and was among the obedient."
          ],
          "en.arberry": [
            "And Mary, Imran's daughter, who guarded her virginity, so We breathed into her of Our Spirit, and she confirmed the Words of her Lord and His Books, and became one of the obedient."
          ],
          "en.daryabadi": [
            "And the similitude of Maryram daughter of lmran, who preserved her chastity, wherefore We breathed in it Of Our Spirit. And she testified to the words of her Lord and His Books and she was of the devout."
          ],
          "en.hilali": [
            "And Maryam (Mary), the daughter of 'Imran who guarded her chastity; and We breathed into (the sleeve of her shirt or her garment) through Our Ruh [i.e. Jibrael (Gabriel)], and she testified to the truth of the Words of her Lord [i.e. believed in the Words of Allah: \"Be!\" and he was; that is 'Iesa (Jesus) - son of Maryam (Mary); as a Messenger of Allah], and (also believed in) His Scriptures, and she was of the Qanitin (i.e. obedient to Allah)."
          ],
          "en.itani": [
            "And Mary, the daughter of Imran, who guarded her womb, and so We breathed into her of Our Spirit; and she believed in the truth of her Lord’s Words and His Books, and was one of the devout."
          ],
          "en.maududi": [
            "Allah has also set forth the parable of Mary, the daughter of Imran, who guarded her chastity, and into whom We breathed of Our Spirit, and who testified to the words of her Lord and His Books. She was among the obedient."
          ],
          "en.mubarakpuri": [
            "And Maryam, the daughter of `Imran who guarded her chastity (private part). And We breathed into it through Our Ruh, and she testified to the truth of her Lords Kalimat, and His Kutub, and she was of the Qanitin."
          ],
          "en.pickthall": [
            "And Mary, daughter of 'Imran, whose body was chaste, therefor We breathed therein something of Our Spirit. And she put faith in the words of her Lord and His scriptures, and was of the obedient."
          ],
          "en.qarai": [
            "And Mary, daughter of Imran, who guarded the chastity of her womb, so We breathed into it of Our spirit. She confirmed the words of her Lord and His Books, and she was one of the obedient."
          ],
          "en.qaribullah": [
            "And, Mary, 'Imran's daughter, who guarded her chastity so We breathed into her of Our Spirit (Gabriel); and she put her trust in the Words of her Lord andHis Books, and was among the devout."
          ],
          "en.sahih": [
            "And [the example of] Mary, the daughter of 'Imran, who guarded her chastity, so We blew into [her garment] through Our angel, and she believed in the words of her Lord and His scriptures and was of the devoutly obedient."
          ],
          "en.sarwar": [
            "He has also told, as a parable, the story of Mary, daughter of Imran who preserved her virginity and (into whose womb) We breathed Our spirit. She made the words of her Lord and the predictions in His Books come true. She was an obedient woman."
          ],
          "en.shakir": [
            "And Marium, the daughter of Imran, who guarded her chastity, so We breathed into her of Our inspiration and she accepted the truth of the words of her Lord and His books, and she was of, the obedient ones."
          ],
          "en.transliteration": [
            "Wamaryama ibnata AAimr<u>a</u>na allatee a<u>hs</u>anat farjah<u>a</u> fanafakhn<u>a</u> feehi min roo<u>h</u>in<u>a</u> wa<u>s</u>addaqat bikalim<u>a</u>ti rabbih<u>a</u> wakutubihi wak<u>a</u>nat mina alq<u>a</u>niteen<b>a</b>"
          ],
          "en.wahiduddin": [
            "[God gave another example in the story of] Mary, 'Imran's daughter, who preserved her chastity and We breathed Our spirit into her; she testified to the words of her Lord and His Scriptures, and was truly devout."
          ],
          "en.yusufali": [
            "And Mary the daughter of 'Imran, who guarded her chastity; and We breathed into (her body) of Our spirit; and she testified to the truth of the words of her Lord and of His Revelations, and was one of the devout (servants)."
          ],
          "fa.ansarian": [
            "و [نیز] مریم دختر عمران [را مثل زده است] که دامان خود را پاک نگه داشت و در نتیجه از روح خود در او دمیدیم و کلمات پروردگارش و کتاب های او را تصدیق کرد و از اطاعت کنندگان [فرمان های خدا] بود."
          ],
          "fa.ayati": [
            "و مريم دختر عمران را كه شرمگاه خويش را از زنا نگه داشت و ما از روح خود در آن دميديم. و او كلمات پروردگار خود و كتابهايش را تصديق كرد و او از فرمانبرداران بود."
          ],
          "fa.bahrampour": [
            "و مريم دختر عمران را [مثل آورده‌] كه دامان خود را پاك نگاه داشت پس ما از روح خود در آن دميديم و او سخنان پروردگار خود و كتاب‌هاى او را تصديق نمود و از فرمانبرداران بود"
          ],
          "fa.fooladvand": [
            "و مريم دخت عمران را، همان كسى كه خود را پاكدامن نگاه داشت و در او از روح خود دميديم و سخنان پروردگار خود و كتابهاى او را تصديق كرد و از فرمانبرداران بود."
          ],
          "fa.ghomshei": [
            "و نیز مریم دخت عمران را (مَثَل آورد) که رَحِمش را پاکیزه داشت و ما در آن از روح قدسی خویش بدمیدیم، و او کلمات پروردگار خود و کتب آسمانی او را (با کمال ایمان) تصدیق کرد و از بندگان مطیع خدا به شمار بود."
          ],
          "fa.khorramdel": [
            "همچنین خداوند (از میان مؤمنان، دومین الگو) مریم دختر عمران را مثل زده است که دامن به گناه نیالود و خود را پاک نگاه داشت، و ما از روح متعلّق به خود در او دمیدیم، و او سخنان پروردگارش و کتابهایش را تصدیق کرد، و از زمره‌ی مطیعان و فرمانبرداران خدا بود. [[«أَحْصَنَتْ»: استوار داشت. مصون و محفوظ داشت. «فَرْج»: عورت. شرمگاه (نگا: مؤمنون / 5، نور / 30 و 31، احزاب / 35). «أَحْصَنَتْ فَرْجَهَا»: (نگا: انبیاء / 91). «مِن رُّوحِنَا»: از روح متعلّق به خود. از روح ساخت خود (نگا: انبیاء / 91، سجده / 9، حجر / 29، ص / 72). «کَلِمَاتِ»: مراد اوامر و نواهی و وعده‌ها و وعیدهای الهی است. «کُتُبِ»: کتابهای تورات موسی، و زبور داود، و صحف ابراهیم، و سایر کتابهای آسمانی. «الْقَانِتِینَ»: مطیعان و فرمانبرداران الهی، مواظبان طاعت و عبادت. مذکّر آمدن آن، جنبه تغلیب دارد.]]"
          ],
          "fa.khorramshahi": [
            "و نیز مریم دختر عمران را که ناموس خود را محفوظ داشت، آنگاه از روح خویش در آن دمیدیم، و سخنان و کتابهای پروردگارش را استوار گرفت، و از فرمانبرداران بود"
          ],
          "fa.makarem": [
            "و همچنین به مریم دختر عمران که دامان خود را پاک نگه داشت، و ما را از روح خود در آن دمیدیم؛ او کلمات پروردگار و کتابهایش را تصدیق کرد و از مطیعان فرمان خدا بود!"
          ],
          "fa.moezzi": [
            "و مریم دخت عمران را که نگهداشت فرج خویش را تا دمیدیم در آن از روح خویش و تصدیق کرد به سخنان پروردگار خود و کتابهای او و گشت از فروتنان‌"
          ],
          "fa.mojtabavi": [
            "و مريم دختر عمران را كه دامن خويش [از حرام‌] نگاه داشت، پس ما از روح خود در آن دميديم. و او كلمات پروردگار خويش و كتابهايش را باور داشت و از فرمانبرداران بود."
          ],
          "fa.sadeqi": [
            "و مریم‌، دخت عمران را، همان کسی که عورت خود را (پاک) نگاه داشت. پس در آن از روح ویژه‌مان (از میان آفریدگان) دمیدیم و (وی) سخنان پروردگار خود و کتاب‌های او را تصدیق کرد و از عابدان مخلص بود."
          ]
        }
      }
    ]
  },
  "index": "quran:66",
  "kind": "verse_list"
}