{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 67"
        },
        "path": "/books/quran:67",
        "titles": {
          "ar": "الملك",
          "en": "The Sovereignty",
          "ent": "Al-Mulk"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 67,
    "local_index": 67,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 68"
        },
        "path": "/books/quran:68",
        "titles": {
          "ar": "القلم",
          "en": "The Pen",
          "ent": "Al-Qalam"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 66"
        },
        "path": "/books/quran:66",
        "titles": {
          "ar": "التحريم",
          "en": "The Prohibition",
          "ent": "At-Tahrim"
        }
      },
      "up": {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      }
    },
    "order": 77,
    "part_type": "Chapter",
    "path": "/books/quran:67",
    "reveal_type": "Meccan",
    "rukus": 2,
    "titles": {
      "ar": "الملك",
      "en": "The Sovereignty",
      "ent": "Al-Mulk"
    },
    "verse_count": 30,
    "verse_start_index": 5241,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 5242,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:67:1",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:4:3:2:1",
            "/books/al-kafi:2:1:17:1"
          ]
        },
        "text": [
          "تَبَارَکَ‌ الَّذِي‌ بِيَدِهِ‌ الْمُلْکُ‌ وَ هُوَ عَلَى‌ کُلِ‌ شَيْ‌ءٍ قَدِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "BLESSED BE HE who holds the (reins of) Kingship in His hand, who has power over everything,"
          ],
          "en.ahmedraza": [
            "Most Auspicious is He in Whose control is the entire kingship; and He is Able to do all things."
          ],
          "en.arberry": [
            "Blessed be He in whose hand is the Kingdom -- He is powerful over everything --"
          ],
          "en.daryabadi": [
            "Blest be He in whose hand is the dominion, and He is over everything Potent."
          ],
          "en.hilali": [
            "Blessed is He in Whose Hand is the dominion, and He is Able to do all things."
          ],
          "en.itani": [
            "Blessed is He in whose hand is the sovereignty, and Who has power over everything."
          ],
          "en.maududi": [
            "Blessed is He in Whose Hand is the dominion of the Universe, and Who has power over everything;"
          ],
          "en.mubarakpuri": [
            "Blessed be He in Whose Hand is the dominion; and He is Able to do all things."
          ],
          "en.pickthall": [
            "Blessed is He in Whose hand is the Sovereignty, and, He is Able to do all things."
          ],
          "en.qarai": [
            "Blessed is He in whose hands is all sovereignty, and He has power over all things."
          ],
          "en.qaribullah": [
            "Blessed be He in whose Hand is the Kingdom, He is powerful over all things,"
          ],
          "en.sahih": [
            "Blessed is He in whose hand is dominion, and He is over all things competent -"
          ],
          "en.sarwar": [
            "Blessed is He in whose hands is the Kingdom and who has power over all things."
          ],
          "en.shakir": [
            "Blessed is He in Whose hand is the kingdom, and He has power over all things,"
          ],
          "en.transliteration": [
            "Tab<u>a</u>raka alla<u>th</u>ee biyadihi almulku wahuwa AAal<u>a</u> kulli shayin qadeer<b>un</b>"
          ],
          "en.wahiduddin": [
            "Blessed is He in whose hand is the Kingdom: He has power over all things;"
          ],
          "en.yusufali": [
            "Blessed be He in Whose hands is Dominion; and He over all things hath Power;-"
          ],
          "fa.ansarian": [
            "همیشه سودمند و با برکت است آنکه فرمانروایی [همه هستی] به دست اوست و او بر هر کاری تواناست."
          ],
          "fa.ayati": [
            "بزرگوار و متعالى است خداوندى كه فرمانروايى به دست اوست و او بر هر چيزى تواناست."
          ],
          "fa.bahrampour": [
            "پرخير و پاينده است آن كه فرمانروايى به دست اوست و او بر هر چيزى تواناست"
          ],
          "fa.fooladvand": [
            "بزرگوار [و خجسته‌] است آنكه فرمانروايى به دست اوست و او بر هر چيزى تواناست."
          ],
          "fa.ghomshei": [
            "بزرگوار خدایی که سلطنت ملک هستی به دست قدرت اوست و بر همه چیز تواناست."
          ],
          "fa.khorramdel": [
            "بزرگوار و دارای برکات بسیار، آن کسی که فرمانروائی (جهان هستی) از آن او است و او بر هر چیزی کاملاً قادر و توانا است. [[«تَبَارَکَ»: والا مقام است. خجسته است. دارای برکات بسیار است (نگا: اعراف / 54، مؤمنون / 14، فرقان / 1 و 10 و 61). «الْمُلْکُ»: حکومت. فرماندهی.]]"
          ],
          "fa.khorramshahi": [
            "بزرگا کسی که فرمانروایی به دست اوست و او بر هر کاری تواناست‌"
          ],
          "fa.makarem": [
            "پربرکت و زوال‌ناپذیر است کسی که حکومت جهان هستی به دست اوست، و او بر هر چیز تواناست."
          ],
          "fa.moezzi": [
            "خجسته باد آنکه به دستش پادشاهی است و او است بر همه چیز توانا"
          ],
          "fa.mojtabavi": [
            "بزرگ و بزرگوار است آن كه پادشاهى به دست اوست و او بر هر چيزى تواناست"
          ],
          "fa.sadeqi": [
            "مبارک است کسی که فرمانروایی (جهان) تنها به دست اوست، و (هم) او بر هر چیزی بسی تواناست."
          ]
        }
      },
      {
        "index": 5243,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:67:2",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:2:1:11:4"
          ]
        },
        "text": [
          "الَّذِي‌ خَلَقَ‌ الْمَوْتَ‌ وَ الْحَيَاةَ لِيَبْلُوَکُمْ‌ أَيُّکُمْ‌ أَحْسَنُ‌ عَمَلاً وَ هُوَ الْعَزِيزُ الْغَفُورُ"
        ],
        "translations": {
          "en.ahmedali": [
            "Who created death and life in order to try you to see who of you are best of deed. He is all-mighty and forgiving,"
          ],
          "en.ahmedraza": [
            "The One Who created death and life to test you – who among you has the better deeds; and He only is the Most Honourable, the Oft Forgiving."
          ],
          "en.arberry": [
            "who created death and life, that He might try you which of you is fairest in works; and He is the All-mighty, the All-forgiving --"
          ],
          "en.daryabadi": [
            "Who hath created death and life that He might prove you, as to which of you is excellent in work. And He is the Mighty, the Forgiver."
          ],
          "en.hilali": [
            "Who has created death and life, that He may test you which of you is best in deed. And He is the All-Mighty, the Oft-Forgiving;"
          ],
          "en.itani": [
            "He who created death and life—to test you—as to which of you is better in conduct. He is the Almighty, the Forgiving."
          ],
          "en.maududi": [
            "Who created death and life that He might try you as to which of you is better in deed. He is the Most Mighty, the Most Forgiving;"
          ],
          "en.mubarakpuri": [
            "Who has created death and life that He may test you which of you is best in deed. And He is the Almighty, the Oft-Forgiving;"
          ],
          "en.pickthall": [
            "Who hath created life and death that He may try you which of you is best in conduct; and He is the Mighty, the Forgiving,"
          ],
          "en.qarai": [
            "He, who created death and life that He may test you [to see] which of you is best in conduct. And He is the All-mighty, the All-forgiving."
          ],
          "en.qaribullah": [
            "who created death and life that He might examine which of you is best in deeds, and He is the Almighty, the Forgiving,"
          ],
          "en.sahih": [
            "[He] who created death and life to test you [as to] which of you is best in deed - and He is the Exalted in Might, the Forgiving -"
          ],
          "en.sarwar": [
            "It is He who has created death and life to put you to the test and see which of you is most virtuous in your deeds. He is Majestic and All-forgiving."
          ],
          "en.shakir": [
            "Who created death and life that He may try you-- which of you is best in deeds; and He is the Mighty, the Forgiving,"
          ],
          "en.transliteration": [
            "Alla<u>th</u>ee khalaqa almawta wa<b>a</b>l<u>h</u>ay<u>a</u>ta liyabluwakum ayyukum a<u>h</u>sanu AAamalan wahuwa alAAazeezu alghafoor<b>u</b>"
          ],
          "en.wahiduddin": [
            "He created death and life so that He might test you, and find out which of you is best in conduct. He is the Mighty, the Most Forgiving One."
          ],
          "en.yusufali": [
            "He Who created Death and Life, that He may try which of you is best in deed: and He is the Exalted in Might, Oft-Forgiving;-"
          ],
          "fa.ansarian": [
            "آنکه مرگ و زندگی را آفرید تا شما را بیازماید که کدامتان نیکوکارترید، و او توانای شکست ناپذیر و بسیار آمرزنده است."
          ],
          "fa.ayati": [
            "آن كه مرگ و زندگى را بيافريد، تا بيازمايدتان كه كدام يك از شما به عمل نيكوتر است و اوست پيروزمند و آمرزنده."
          ],
          "fa.bahrampour": [
            "همان كه مرگ و زندگى را بيافريد تا شما را بيازمايد كه كدامتان به عمل نيكوتر است، و او شكست ناپذير آمرزنده است"
          ],
          "fa.fooladvand": [
            "همانكه مرگ و زندگى را پديد آورد تا شما را بيازمايد كه كدامتان نيكوكارتريد، و اوست ارجمند آمرزنده."
          ],
          "fa.ghomshei": [
            "خدایی که مرگ و زندگانی را آفرید که شما بندگان را بیازماید تا کدام نیکوکارتر (و خلوص اعمالش بیشتر) است و او مقتدر و بسیار آمرزنده است."
          ],
          "fa.khorramdel": [
            "همان کسی که مرگ و زندگی را پدید آورده است تا شما را بیازماید کدامتان کارتان بهتر و نیکوتر خواهد بود. او چیره و توانا، و آمرزگار و بخشاینده است. [[«خَلَقَ الْمَوْتَ وَ الْحَیَاةَ»: مرگ و زندگی را مقدّر کرده و پدید آورده است. «لِیبْلُوَکُمْ»: (نگا: مائده / 48، انعام / 165، هود / 7).]]"
          ],
          "fa.khorramshahi": [
            "کسی که مرگ و زندگی را آفرید تا شما را بیازماید که کدامیک نیکو کردارترید، و او پیروزمند آمرزگار است‌"
          ],
          "fa.makarem": [
            "آن کس که مرگ و حیات را آفرید تا شما را بیازماید که کدام یک از شما بهتر عمل می‌کنید، و او شکست‌ناپذیر و بخشنده است."
          ],
          "fa.moezzi": [
            "آنکه آفرید مرگ و زندگی را تا بیازماید شما را کدامین نکوترید در کردار و او است عزّتمند آمرزگار"
          ],
          "fa.mojtabavi": [
            "آن كه مرگ و زندگى را بيافريد تا شما را بيازمايد كه كدام يك از شما نيكوكارتر است، و اوست تواناى بى‌همتا و آمرزگار."
          ],
          "fa.sadeqi": [
            "کسی که مرگ و زندگی را آفرید، تا شما را بیازماید (که) کدامتان نیکوکارترید. و اوست عزیزی بس پوشنده."
          ]
        }
      },
      {
        "index": 5244,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:67:3",
        "text": [
          "الَّذِي‌ خَلَقَ‌ سَبْعَ‌ سَمَاوَاتٍ‌ طِبَاقاً مَا تَرَى‌ فِي‌ خَلْقِ‌ الرَّحْمٰنِ‌ مِنْ‌ تَفَاوُتٍ‌ فَارْجِعِ‌ الْبَصَرَ هَلْ‌ تَرَى‌ مِنْ‌ فُطُورٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "Who created the seven skies one above the other. Do you see any disproportion in the creations of Ar-Rahman? Turn your eyes again. Do you see any fissures?"
          ],
          "en.ahmedraza": [
            "The One Who created the seven heavens atop each other; do you see any discrepancy in the creation of the Most Gracious? Therefore lift your gaze – do you see any cracks?"
          ],
          "en.arberry": [
            "who created seven heavens one upon another. Thou seest not in the creation of the All-merciful any imperfection. Return thy gaze; seest thou any fissure?"
          ],
          "en.daryabadi": [
            "Who hath created seven heavens in storeys. Thou shalt not behold in the Compassionates creation any over-sight; then repeat thy look, beholdest thou any crack?"
          ],
          "en.hilali": [
            "Who has created the seven heavens one above another, you can see no fault in the creations of the Most Beneficent. Then look again: \"Can you see any rifts?\""
          ],
          "en.itani": [
            "He who created seven heavens in layers. You see no discrepancy in the creation of the Compassionate. Look again. Can you see any cracks?"
          ],
          "en.maududi": [
            "Who created the seven heavens one upon another. You will see no incongruity in the Merciful One's creation. Turn your vision again, can you see any flaw?"
          ],
          "en.mubarakpuri": [
            "Who has created the seven heavens one above the other; you can see no fault in the creation of the Most Gracious. Then look again. Can you see any rifts"
          ],
          "en.pickthall": [
            "Who hath created seven heavens in harmony. Thou (Muhammad) canst see no fault in the Beneficent One's creation; then look again: Canst thou see any rifts?"
          ],
          "en.qarai": [
            "He created seven heavens in layers. You do not see any discordance in the creation of the All-beneficent. Look again! Do you see any flaw?"
          ],
          "en.qaribullah": [
            "who created the seven heavens, one above the other. You cannot see any inconsistency in the creation of the Merciful. Return your gaze, do you see anycrack!"
          ],
          "en.sahih": [
            "[And] who created seven heavens in layers. You do not see in the creation of the Most Merciful any inconsistency. So return [your] vision [to the sky]; do you see any breaks?"
          ],
          "en.sarwar": [
            "It is He who has created seven heavens, one above the other. You can see no flaw in the creation of the Beneficent God. Look again. Can you see faults?"
          ],
          "en.shakir": [
            "Who created the seven heavens one above another; you see no incongruity in the creation of the Beneficent Allah; then look again, can you see any disorder?"
          ],
          "en.transliteration": [
            "Alla<u>th</u>ee khalaqa sabAAa sam<u>a</u>w<u>a</u>tin <u>t</u>ib<u>a</u>qan m<u>a</u> tar<u>a</u> fee khalqi a<b>l</b>rra<u>h</u>m<u>a</u>ni min taf<u>a</u>wutin fa<b>i</b>rjiAAi alba<u>s</u>ara hal tar<u>a</u> min fu<u>t</u>oor<b>in</b>"
          ],
          "en.wahiduddin": [
            "He created seven heavens one above the other in layers. You will not find any flaw in the creation of the Gracious One. Then look once again: can you see any flaw?"
          ],
          "en.yusufali": [
            "He Who created the seven heavens one above another: No want of proportion wilt thou see in the Creation of (Allah) Most Gracious. So turn thy vision again: seest thou any flaw?"
          ],
          "fa.ansarian": [
            "آنکه هفت آسمان را بر فراز یکدیگر آفرید. در آفرینش [خدای] رحمان، خلل و نابسامانی و ناهمگونی نمی بینی، پس بار دیگر بنگر آیا هیچ خلل و نابسامانی و ناهمگونی می بینی؟"
          ],
          "fa.ayati": [
            "آن كه هفت آسمان طبقه طبقه را بيافريد. در آفرينش خداى رحمان هيچ خلل و بى‌نظمى نمى‌بينى. پس بار ديگر نظركن، آيا در آسمان شكافى مى‌بينى؟"
          ],
          "fa.bahrampour": [
            "همان كه هفت آسمان را بالاى هم بيافريد. در آفرينش [آن خداى‌] هستى بخش هيچ گونه تفاوت و اختلافى نمى‌بينى. پس چشم بگردان، آيا خلل و نقصانى مى‌بينى"
          ],
          "fa.fooladvand": [
            "همان كه هفت آسمان را طبقه طبقه بيافريد. در آفرينش آن [خداى‌] بخشايشگر هيچ گونه اختلاف [و تفاوتى‌] نمى‌بينى. بازبنگر، آيا خلل [و نقصانى‌] مى‌بينى؟"
          ],
          "fa.ghomshei": [
            "آن خدایی که هفت آسمان بلند را به طبقاتی منظم بیافرید و هیچ در نظم خلقت خدای رحمان بی‌نظمی و نقصان نخواهی یافت، باز بارها به دیده عقل بنگر تا هیچ نقص و خلل هرگز در آن توانی یافت؟"
          ],
          "fa.khorramdel": [
            "آن که هفت آسمان را بالای یکدیگر و همآهنگ آفریده است. اصلاً در آفرینش و آفریده‌های خداوند مهربان خلل و تضادّ و عدم تناسبی نمی‌بینی (و بلکه هستی با تمام عظمتی که دارد، از انسجام و استحکام شگفت برخوردار است، و نظم و نظام عجیب و قوانین و روابط دقیق بر ذرّه ذرّه‌ی کائنات حکمفرما است). پس دیگر باره بنگر (و با دقّت جهان را وارسی کن) آیا هیچ گونه خلل و رخنه‌ای می‌بینی؟ [[«سَبْعَ سَمَاوَاتٍ»: (نگا: بقره / 29، اسراء / 44، مؤمنون / 86). «طِبَاقاً»: جمع طَبَق، یا طَبَقَه، یکی فوق دیگری. یکی برتر از دیگری.. یا این که همچون مُطابقه، مصدر باب مفاعله است و به معنی موافق و مرتبط و همآهنگ و هم‌آوا با یکدیگر است. «تَفَاوُتٍ»: عیب و نقص. خلل و رخنه. ناسازگاری و ناخوانی. نظم و نظام شگفت‌انگیز بر الکترون، پروتون، اتم، زمین، منظومه شمسی، منظومه‌های دیگر، کهکشان راه شیری، کهکشانهای دیگر، و ... حاکم است، و همه جا قانون است و حساب، و همه جا نظم است و برنامه ... هرچه ای انسان در جهان آفرینش دقّت کنی کمترین خلل و ناموزونی در آن نمی‌بینی. «فُطُورٍ»: جمع فَطْر، درز و شکاف. مراد خلل و رخنه است.]]"
          ],
          "fa.khorramshahi": [
            "کسی که هفت آسمان را توبرتو آفرید، در آفرینش خداوند رحمان، هیچ گونه نابسامانی نمی‌بینی، باز چشم بگردان آیا هیچ رخنه‌ای می‌بینی؟"
          ],
          "fa.makarem": [
            "همان کسی که هفت آسمان را بر فراز یکدیگر آفرید؛ در آفرینش خداوند رحمان هیچ تضادّ و عیبی نمی‌بینی! بار دیگر نگاه کن، آیا هیچ شکاف و خللی مشاهده می‌کنی؟!"
          ],
          "fa.moezzi": [
            "آنکه آفرید هفت آسمان تودرتو (یا پی‌درپی) نبینی در آفرینش خدای مهربان تفاوتی (کم و بیشی) پس بگشای دیده را آیا بینی شکافی را"
          ],
          "fa.mojtabavi": [
            "آن كه هفت آسمان را مطابق- يا بر- يكديگر بيافريد. در آفرينش خداى رحمان هيچ تفاوت- اختلاف و خلل و بى‌نظمى- نمى‌بينى پس ديگر بار ديده را بگردان و بنگر، آيا هيچ شكافى- خلل و نقصى- مى‌بينى؟"
          ],
          "fa.sadeqi": [
            "کسی که هفت آسمان را، طبقاتی (روی هم) بیافرید. در آفرینش (خدای) رحمان هیچ‌گونه (تضاد و) تفاوتی نمی‌بینی. پس باز (هم) بنگر، آیا هیچ‌گونه سستی (در آن) می‌بینی‌؟"
          ]
        }
      },
      {
        "index": 5245,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:67:4",
        "text": [
          "ثُمَ‌ ارْجِعِ‌ الْبَصَرَ کَرَّتَيْنِ‌ يَنْقَلِبْ‌ إِلَيْکَ‌ الْبَصَرُ خَاسِئاً وَ هُوَ حَسِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "Turn your eyes again and again. Your gaze turns back dazed and tired."
          ],
          "en.ahmedraza": [
            "Then lift your gaze again, your gaze will return towards you, unsuccessful and weak."
          ],
          "en.arberry": [
            "Then return thy gaze again, and again, and thy gaze comes back to thee dazzled, aweary."
          ],
          "en.daryabadi": [
            "Then repeat thy look twice over, and thy look will return Unto thee dim and It will have become wearied out."
          ],
          "en.hilali": [
            "Then look again and yet again, your sight will return to you in a state of humiliation and worn out."
          ],
          "en.itani": [
            "Then look again, and again, and your sight will return to you dazzled and exhausted."
          ],
          "en.maududi": [
            "Then turn your vision again, and then again; in the end your vision will come back to you, worn out and frustrated."
          ],
          "en.mubarakpuri": [
            "Then look again and yet again, your sight will return to you Khasi', and worn out."
          ],
          "en.pickthall": [
            "Then look again and yet again, thy sight will return unto thee weakened and made dim."
          ],
          "en.qarai": [
            "Look again, once more. Your look will return to you humbled and weary."
          ],
          "en.qaribullah": [
            "Then return your gaze once more and yet again, your gaze comes back to you dazzled, and tired."
          ],
          "en.sahih": [
            "Then return [your] vision twice again. [Your] vision will return to you humbled while it is fatigued."
          ],
          "en.sarwar": [
            "Look twice (and keep on looking), your eyes will only become dull and tired."
          ],
          "en.shakir": [
            "Then turn back the eye again and again; your look shall come back to you confused while it is fatigued."
          ],
          "en.transliteration": [
            "Thumma irjiAAi alba<u>s</u>ara karratayni yanqalib ilayka alba<u>s</u>aru kh<u>a</u>sian wahuwa <u>h</u>aseer<b>un</b>"
          ],
          "en.wahiduddin": [
            "Then look again and again. Your gaze will come back to you confused and exhausted."
          ],
          "en.yusufali": [
            "Again turn thy vision a second time: (thy) vision will come back to thee dull and discomfited, in a state worn out."
          ],
          "fa.ansarian": [
            "سپس بار دیگر بنگر تا دیده ات در حالی که خسته و کم سو شده [و از یافتن خلل، نابسامانی و ناهمگونی فرو مانده] و درمانده گشته است، به سویت باز گردد."
          ],
          "fa.ayati": [
            "بار ديگر نيز چشم باز كن و بنگر. نگاه تو خسته و درمانده به نزد تو باز خواهد گشت."
          ],
          "fa.bahrampour": [
            "باز دوباره چشم بگردان [و بنگر، ولى‌] چشم، ناكام و خسته [از يافتن عيب‌] به سوى تو باز مى‌گردد"
          ],
          "fa.fooladvand": [
            "باز دوباره بنگر تا نگاهت زبون و درمانده به سويت بازگردد."
          ],
          "fa.ghomshei": [
            "باز دوباره به چشم بصیرت دقت کن تا دیده خرد زبون و خسته (نقصی نیافته) به سوی تو باز گردد."
          ],
          "fa.khorramdel": [
            "باز هم (دیده‌ی خود را بگشای و به عالم هستی بنگر و) بارها و بارها بنگر و ورانداز کن. دیده سرانجام فروهشته و حیران، و درمانده و ناتوان، به سویت باز می‌گردد. [[«کَرَّتَیْنِ»: دو بار. در اینجا تثنیه برای کثرت است. یعنی بارها و بارها. «یَنقَلِبْ»: باز می‌گردد. بر می‌گردد. «خَاسِئاً»: فروهشته. حیران. «حَسِیرٌ»: خسته و درمانده. از کار افتاده. مراد این است که انسان هر اندازه بنگرد، خلل و رخنه‌ای پیدا نمی‌کند، و هر بار که به تحقیق بپردازد و بر معلومات خود بیفزاید، دچار سرگشتگی و حیرت بیشتر می‌گردد.]]"
          ],
          "fa.khorramshahi": [
            "سپس دوباره چشم بگردان، چشمت خسته و مانده باز می‌گردد"
          ],
          "fa.makarem": [
            "بار دیگر (به عالم هستی) نگاه کن، سرانجام چشمانت (در جستجوی خلل و نقصان ناکام مانده) به سوی تو باز می‌گردد در حالی که خسته و ناتوان است!"
          ],
          "fa.moezzi": [
            "پس برگردان دیده را دوبار بازگردد بسویت چشم سرافکنده حالی که آن است کند (یا خوار)"
          ],
          "fa.mojtabavi": [
            "سپس بار ديگر نيز ديده بگردان و بنگر تا ديده‌ات خوار و فرومانده به سويت بازگردد- بى‌آنكه عيب و نقصى در آسمانها بيابد-."
          ],
          "fa.sadeqi": [
            "سپس بار دیگر بنگر، تا دیده‌ات زبون و به حال درماندگی سویت بازگردد."
          ]
        }
      },
      {
        "index": 5246,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:67:5",
        "text": [
          "وَ لَقَدْ زَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ‌ وَ جَعَلْنَاهَا رُجُوماً لِلشَّيَاطِينِ‌ وَ أَعْتَدْنَا لَهُمْ‌ عَذَابَ‌ السَّعِيرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "We have adorned the lowest sky with lamps, and made them missiles against the devils, for whom We have prepared a torment of most intense fire."
          ],
          "en.ahmedraza": [
            "And indeed We have beautified the lower heaven with lamps, and have made them weapons against the devils, and have kept prepared for them the punishment of the blazing fire."
          ],
          "en.arberry": [
            "And We adorned the lower heaven with lamps, and made them things to stone Satans; and We have prepared for them the chastisement of the Blaze."
          ],
          "en.daryabadi": [
            "And assuredly We have bedecked the nearest heaven with lamps, and We have made them missiles for satans: and for them We have gotten ready the torment of the Blaze."
          ],
          "en.hilali": [
            "And indeed We have adorned the nearest heaven with lamps, and We have made such lamps (as) missiles to drive away the Shayatin (devils), and have prepared for them the torment of the blazing Fire."
          ],
          "en.itani": [
            "We have adorned the lower heaven with lanterns, and made them missiles against the devils; and We have prepared for them the punishment of the Blaze."
          ],
          "en.maududi": [
            "We have adorned the lower heaven with lamps, and have made them a means to drive away the satans. We have prepared for them the chastisement of the Blazing Fire."
          ],
          "en.mubarakpuri": [
            "And indeed We have adorned the nearest heaven with lamps, and We have made such lamps (as) missiles to drive away the Shayatin, and have prepared for them the torment of the blazing Fire."
          ],
          "en.pickthall": [
            "And verily We have beautified the world's heaven with lamps, and We have made them missiles for the devils, and for them We have prepared the doom of flame."
          ],
          "en.qarai": [
            "We have certainly adorned the lowest heaven with lamps, and made them [the means of pelting] missiles against the devils, and We have prepared for them a punishment of the Blaze."
          ],
          "en.qaribullah": [
            "We have adorned the lower heaven with lamps, and We made them a stoning for the satans, We have prepared the punishment of the Blaze for them."
          ],
          "en.sahih": [
            "And We have certainly beautified the nearest heaven with stars and have made [from] them what is thrown at the devils and have prepared for them the punishment of the Blaze."
          ],
          "en.sarwar": [
            "We have decked the lowest heavens with torches. With these torches We have stoned the devils and We have prepared for them the torment of hell."
          ],
          "en.shakir": [
            "And certainly We have adorned this lower heaven with lamps and We have made these missiles for the Shaitans, and We have prepared for them the chastisement of burning."
          ],
          "en.transliteration": [
            "Walaqad zayyann<u>a</u> a<b>l</b>ssam<u>a</u>a a<b>l</b>dduny<u>a</u> bima<u>sa</u>bee<u>h</u>a wajaAAaln<u>a</u>h<u>a</u> rujooman li<b>l</b>shshay<u>at</u>eeni waaAAtadn<u>a</u> lahum AAa<u>tha</u>ba a<b>l</b>ssaAAeer<b>i</b>"
          ],
          "en.wahiduddin": [
            "We have adorned the lowest heaven with lamps, and We have made them for driving away devils. For them We have prepared the punishment of the blazing Fire."
          ],
          "en.yusufali": [
            "And we have, (from of old), adorned the lowest heaven with Lamps, and We have made such (Lamps) (as) missiles to drive away the Evil Ones, and have prepared for them the Penalty of the Blazing Fire."
          ],
          "fa.ansarian": [
            "همانا ما آسمان دنیا را با چراغ هایی آراستیم و آنها را تیرهایی برای راندن شیطان ها قرار دادیم، و برای آنان [در آخرت] آتشی افروخته، آماده کرده ایم؛"
          ],
          "fa.ayati": [
            "ما آسمان فرودين را به چراغهايى بياراستيم و آن چراغها را وسيله راندن شياطين گردانيديم و برايشان شكنجه آتش سوزان آماده كرده‌ايم."
          ],
          "fa.bahrampour": [
            "و همانا آسمان نزديك‌تر را با چراغ‌هايى زينت داديم و آنها را مايه‌ى راندن شياطين قرار داديم، و براى آنها عذاب آتش فروزان آماده كرده‌ايم"
          ],
          "fa.fooladvand": [
            "و در حقيقت، آسمان دنيا را با چراغهايى زينت داديم و آن را مايه طرد شياطين [= قواى مزاحم‌] گردانيديم و براى آنها عذاب آتش فروزان آماده كرده‌ايم."
          ],
          "fa.ghomshei": [
            "و ما آسمان دنیا را به چراغهای انجم رخشان زیب و زیور دادیم و به تیر شهاب آن ستارگان شیاطین را راندیم و عذاب آتش فروزان را بر آنها مهیّا ساختیم."
          ],
          "fa.khorramdel": [
            "ما آسمان نزدیک (به شما) را با چراغهائی (به نام ستارگان) آراسته‌ایم، و آنها را وسیله‌ی راندن اهریمنان ساخته‌ایم، و برای ایشان عذاب آتش سوزانی را آماده کرده‌ایم. [[«السَّمَآءَ الدُّنْیَا»: آسمان نزدیک. آسمان فُرودین (نگا: صافّات / 6). «زَیَّنَّا السَّمَآءَ الدُّنْیَا بِمَصَابِیحَ»: (نگا: فصّلت / 12). «رُجُوماً»: جمع رَجْم، مصدر است و به معنی اسم مفعول، یعنی چیزی که همچون سنگ انداخته می‌شود. اشاره به شهابها است که باقیمانده ستارگانی است که طیّ حوادثی متلاشی شده‌اند و از یک سوی آسمان به سوی دیگر پرتاب می‌شوند (نگا: حجر / 16 و 18، صافّات / 6 - 10).]]"
          ],
          "fa.khorramshahi": [
            "و به راستی آسمان دنیا را به چراغهای [ستارگان‌] آراستیم و آنها را رماننده شیاطین گرداندیم و برای آنان عذاب آتش افروخته، آماده ساختیم‌"
          ],
          "fa.makarem": [
            "ما آسمان پایین (نزدیک) را با چراغهای فروزانی زینت بخشیدیم، و آنها [= شهابها] را تیرهایی برای شیاطین قرار دادیم، و برای آنان عذاب آتش فروزان فراهم ساختیم!"
          ],
          "fa.moezzi": [
            "و هرآینه آراستیم آسمان نزدیک را به چراغهائی و گردانیدیم آنها را پرتابهائی برای دیوان (شیاطین) و آماده ساختیم برای ایشان عذابی سوزان‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه آسمان دنيا- نزديكتر به زمين- را به چراغهايى- ستارگان- بياراستيم و آنها"
          ],
          "fa.sadeqi": [
            "و همانا ما نزدیکترین آسمان (به زمین) را همواره با چراغ‌هایی زینت دادیم و آنها را (مراکزی) برای سنگباران‌هایی برای شیطان‌ها نهادیم و برایشان عذابی بس سوزان آماده کردیم."
          ]
        }
      },
      {
        "index": 5247,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:67:6",
        "text": [
          "وَ لِلَّذِينَ‌ کَفَرُوا بِرَبِّهِمْ‌ عَذَابُ‌ جَهَنَّمَ‌ وَ بِئْسَ‌ الْمَصِيرُ"
        ],
        "translations": {
          "en.ahmedali": [
            "For those who believe not in their Lord there is the punishment of Hell; and what a wretched destination"
          ],
          "en.ahmedraza": [
            "And for those who disbelieved in their Lord, is the punishment of hell; and what a wretched outcome!"
          ],
          "en.arberry": [
            "And for those who disbelieve in their Lord there awaits the chastisement of Gehenna -- an evil homecoming!"
          ],
          "en.daryabadi": [
            "And for those who disbelieve in their Lord will be the torment of Hell; and a hapless destination!"
          ],
          "en.hilali": [
            "And for those who disbelieve in their Lord (Allah) is the torment of Hell, and worst indeed is that destination."
          ],
          "en.itani": [
            "For those who reject their Lord, there is the torment of Hell. What an evil destination!"
          ],
          "en.maududi": [
            "The chastisement of Hell awaits those who disbelieve in their Lord. What a wretched destination!"
          ],
          "en.mubarakpuri": [
            "And for those who disbelieve in their Lord is the torment of Hell, and worst indeed is that destination."
          ],
          "en.pickthall": [
            "And for those who disbelieve in their Lord there is the doom of hell, a hapless journey's end!"
          ],
          "en.qarai": [
            "For those who defy their Lord is the punishment of hell, and it is an evil destination."
          ],
          "en.qaribullah": [
            "And for those who disbelieve in their Lord there awaits the punishment of Gehenna (Hell) an evil arrival!"
          ],
          "en.sahih": [
            "And for those who disbelieved in their Lord is the punishment of Hell, and wretched is the destination."
          ],
          "en.sarwar": [
            "For those who have disbelieved in their Lord, We have prepared the torment of hell, the most terrible place to return."
          ],
          "en.shakir": [
            "And for those who disbelieve in their Lord is the punishment of hell, and evil is the resort."
          ],
          "en.transliteration": [
            "Walilla<u>th</u>eena kafaroo birabbihim AAa<u>tha</u>bu jahannama wabisa alma<u>s</u>eer<b>u</b>"
          ],
          "en.wahiduddin": [
            "Those who are bent on blaspheming against their Lord will have the punishment of Hell: an evil destination."
          ],
          "en.yusufali": [
            "For those who reject their Lord (and Cherisher) is the Penalty of Hell: and evil is (such), Destination."
          ],
          "fa.ansarian": [
            "و برای کسانی که به پروردگارشان کافر شدند، عذاب دوزخ است و بد بازگشت گاهی است."
          ],
          "fa.ayati": [
            "و براى كسانى كه به پروردگارشان كافر شده‌اند عذاب جهنم باشد و جهنم بد سرانجامى است."
          ],
          "fa.bahrampour": [
            "و براى كسانى كه به پروردگارشان كافر شدند عذاب جهنم است، و بد سر انجامى است"
          ],
          "fa.fooladvand": [
            "و كسانى كه به پروردگارشان انكار آوردند، عذاب آتش جهنم خواهند داشت و چه بد سرانجامى است."
          ],
          "fa.ghomshei": [
            "و بر آنان که به خدای خود کافر شدند عذاب جهنّم که بسیار بد منزلگاهی است مهیّاست."
          ],
          "fa.khorramdel": [
            "کسانی که به پروردگار خود ایمان نداشته باشند، عذاب دوزخ دارند، و چه بد جایگاهی است! [[«بِئْسَ الْمَصِیرُ»: (نگا: بقره / 126، آل‌عمران / 162).]]"
          ],
          "fa.khorramshahi": [
            "و برای کسانی که به پروردگارشان کفرورزیدند عذاب جهنم [آماده‌] است، و چه بد سرانجامی است‌"
          ],
          "fa.makarem": [
            "و برای کسانی که به پروردگارشان کافر شدند عذاب جهنّم است، و بد فرجامی است!"
          ],
          "fa.moezzi": [
            "و آنان را که کفر ورزیدند به پروردگار خویش عذاب دوزخ است و چه زشت است آن جایگاه‌"
          ],
          "fa.mojtabavi": [
            "و كسانى را كه به پروردگارشان كافر شدند عذاب دوزخ است، و بد بازگشتگاهى است"
          ],
          "fa.sadeqi": [
            "و برای کسانی که به پروردگارشان کافر شدند، عذاب جهنم است و چه بد سرانجامی است."
          ]
        }
      },
      {
        "index": 5248,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:67:7",
        "text": [
          "إِذَا أُلْقُوا فِيهَا سَمِعُوا لَهَا شَهِيقاً وَ هِيَ‌ تَفُورُ"
        ],
        "translations": {
          "en.ahmedali": [
            "When they are cast into it, they will hear it roar and raging"
          ],
          "en.ahmedraza": [
            "They will hear it hissing when they will be thrown into it, and it is boiling."
          ],
          "en.arberry": [
            "When they are cast into it they will hear it sighing, the while it boils"
          ],
          "en.daryabadi": [
            "When they will be cast thereinto, they will hear thereof a braying even as it balleth up,"
          ],
          "en.hilali": [
            "When they are cast therein, they will hear the (terrible) drawing in of its breath as it blazes forth."
          ],
          "en.itani": [
            "When they are thrown into it, they will hear it roaring, as it seethes."
          ],
          "en.maududi": [
            "When they will be cast into it, they will hear it roar as it boils,"
          ],
          "en.mubarakpuri": [
            "When they are cast therein, they will hear its Shahiq while it is simmering."
          ],
          "en.pickthall": [
            "When they are flung therein they hear its roaring as it boileth up,"
          ],
          "en.qarai": [
            "When they are thrown in it, they hear it blaring, as it seethes,"
          ],
          "en.qaribullah": [
            "When they are cast into it they shall hear it sighing, while it boils"
          ],
          "en.sahih": [
            "When they are thrown into it, they hear from it a [dreadful] inhaling while it boils up."
          ],
          "en.sarwar": [
            "When they are thrown into hell, they will hear its roaring while it boils."
          ],
          "en.shakir": [
            "When they shall be cast therein, they shall hear a loud moaning of it as it heaves,"
          ],
          "en.transliteration": [
            "I<u>tha</u> olqoo feeh<u>a</u> samiAAoo lah<u>a</u> shaheeqan wahiya tafoor<b>u</b>"
          ],
          "en.wahiduddin": [
            "When they are cast into it, they will hear its roaring as it boils up,"
          ],
          "en.yusufali": [
            "When they are cast therein, they will hear the (terrible) drawing in of its breath even as it blazes forth,"
          ],
          "fa.ansarian": [
            "هنگامی که در آن افکنده شوند از آن در حالی که در جوش و فوران است، صدایی هولناک و دلخراش می شنوند."
          ],
          "fa.ayati": [
            "چون در جهنم افكنده شوند، به جوش آيد و بانگ زشتش را بشنوند،"
          ],
          "fa.bahrampour": [
            "چون در آن جا افكنده شوند، از آن در حالى كه فوران مى‌كند خروشى سهمگين مى‌شنوند"
          ],
          "fa.fooladvand": [
            "چون در آنجا افكنده شوند، از آن خروشى مى‌شنوند در حالى كه مى‌جوشد."
          ],
          "fa.ghomshei": [
            "که چون به آن جهنّم در افتند فریاد منکری چون شهیق خران از آتش چون دیگ جوشان می‌شنوند."
          ],
          "fa.khorramdel": [
            "هر زمان که به دوزخ انداخته شوند، تنوره می‌زند و غُرّشی از آن می‌شنوند. [[«شَهِیقاً»: صدای وحشتناک. فریاد هراس انگیز. غُرِّش. «تَفُورُ»: تنوره می‌زند. فوران می‌کند. به غلیان در می‌آید.]]"
          ],
          "fa.khorramshahi": [
            "چون در آنجا افکنده شوند، نعره آن را می‌شنوند، و آن بر می‌جوشد"
          ],
          "fa.makarem": [
            "هنگامی که در آن افکنده شوند صدای وحشتناکی از آن می‌شنوند، و این در حالی است که پیوسته می‌جوشد!"
          ],
          "fa.moezzi": [
            "گاهی که افکنده شوند در آن بشنوند برایش دمیدنی (یا خروشی) و آن است جوشان‌"
          ],
          "fa.mojtabavi": [
            "چون در آن افكنده شوند، در حالى كه مى‌جوشد- و آنها را فرو مى‌برد- آوازى دلخراش مانند آواز خران از آن بشنوند"
          ],
          "fa.sadeqi": [
            "هنگامی‌که در آنجا افکنده شوند، از آن خروشی (خراش‌دار) می‌شنوند، در حالی که زبانه می‌کشد."
          ]
        }
      },
      {
        "index": 5249,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:67:8",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:2:1:17:1"
          ]
        },
        "text": [
          "تَکَادُ تَمَيَّزُ مِنَ‌ الْغَيْظِ کُلَّمَا أُلْقِيَ‌ فِيهَا فَوْجٌ‌ سَأَلَهُمْ‌ خَزَنَتُهَا أَ لَمْ‌ يَأْتِکُمْ‌ نَذِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "As though it would burst with fury. Every time a crowd is thrown into it, its wardens will ask: \"Did no warner come to you?\""
          ],
          "en.ahmedraza": [
            "As if about to explode with rage; whenever a group is thrown into it, the guardians of hell will ask them, “Did not a Herald of Warning come to you?”"
          ],
          "en.arberry": [
            "and wellnigh bursts asunder with rage. As often as a troop is cast into it, its keepers ask them, 'Came there no warner to you?';"
          ],
          "en.daryabadi": [
            "Well-nigh it bursteth with rage. So oft as a company is cast thereinto, the keepers thereof will ask them: came there not Unto you a warner?"
          ],
          "en.hilali": [
            "It almost bursts up with fury. Every time a group is cast therein, its keeper will ask: \"Did no warner come to you?\""
          ],
          "en.itani": [
            "It almost bursts with fury. Every time a batch is thrown into it, its keepers will ask them, “Has no warner come to you?”"
          ],
          "en.maududi": [
            "as though it will burst with rage. Every time a multitude is cast into it, its keepers will ask them: “Did no warner come to you?”"
          ],
          "en.mubarakpuri": [
            "It almost bursts up with fury. Every time a group is cast therein, its keepers will ask: \"Did no warner come to you\""
          ],
          "en.pickthall": [
            "As it would burst with rage. Whenever a (fresh) host is flung therein the wardens thereof ask them: Came there unto you no warner?"
          ],
          "en.qarai": [
            "almost exploding with rage. Whenever a group is thrown in it, its keepers will ask them, ‘Did not any warner come to you?’"
          ],
          "en.qaribullah": [
            "nearly bursting apart out of rage. Every time a host is cast therein, its keepers will ask them: 'Did no one come to warn you'"
          ],
          "en.sahih": [
            "It almost bursts with rage. Every time a company is thrown into it, its keepers ask them, \"Did there not come to you a warner?\""
          ],
          "en.sarwar": [
            "It almost explodes in rage. Whenever a group is thrown into it, its keepers will ask them, \"Did no one come to warn you?\""
          ],
          "en.shakir": [
            "Almost bursting for fury. Whenever a group is cast into it, its keeper shall ask them: Did there not come to you a warner?"
          ],
          "en.transliteration": [
            "Tak<u>a</u>du tamayyazu mina alghay<i><u>th</u></i>i kullam<u>a</u> olqiya feeh<u>a</u> fawjun saalahum khazanatuh<u>a</u> alam yatikum na<u>th</u>eer<b>un</b>"
          ],
          "en.wahiduddin": [
            "as though bursting with rage. Each time a group is cast into it, its keepers will ask them, \"Did no warner come to you?\""
          ],
          "en.yusufali": [
            "Almost bursting with fury: Every time a Group is cast therein, its Keepers will ask, \"Did no Warner come to you?\""
          ],
          "fa.ansarian": [
            "نزدیک است که از شدت خشم متلاشی و پاره پاره شود. هرگاه گروهی در آن افکنده شوند، نگهبانانش از آنان می پرسند: آیا شما را بیم دهنده ای نیامد؟"
          ],
          "fa.ayati": [
            "نزديك است كه از خشم پاره‌پاره شود. و چون فوجى را در آن افكنند، خازنانش گويندشان: آيا شما را بيم‌دهنده‌اى نيامد؟"
          ],
          "fa.bahrampour": [
            "نزديك است كه از خشم پاره پاره شود. هر بار كه گروهى در آن افكنده شوند، نگاهبانان آن از ايشان پرسند: آيا شما را هشدار دهنده‌اى نيامد"
          ],
          "fa.fooladvand": [
            "نزديك است كه از خشم شكافته شود. هر بار كه گروهى در آن افكنده شوند، نگاهبانان آن از ايشان پرسند: «مگر شما را هشدار دهنده‌اى نيامد؟»"
          ],
          "fa.ghomshei": [
            "(دوزخ از خشم کافران) نزدیک است شکافته و قطعه قطعه شود، هر فوجی را که به آتش در افکنند خازنان جهنّم از آنها پرسند: آیا پیغمبری برای راهنمایی شما نیامد؟"
          ],
          "fa.khorramdel": [
            "دوزخ از شدّت خشم (بر ایشان)، نزدیک است بترکد و پاره‌پاره شود. هر زمان که گروهی بدان انداخته می‌شوند، دوزخبانان از آنان می‌پرسند: آیا پیغمبر بیم دهنده‌ای به میان شما نیامده است (تا شما را از چنین روزی و وضعی بترساند؟). [[«تَکَادُ تَمَیَّزُ»: نزدیک است از هم شکافته و پاره‌پاره شود. کمی‌مانده است که بترکد. «مِنَ الْغَیْظِ»: بر اثر خشم. «خَزَنَتُهَا»: نگهبانان دوزخ (نگا: تحریم / 6).]]"
          ],
          "fa.khorramshahi": [
            "نزدیک است که از خشم پاره پاره گردد، هرگاه که گروهی در آن افکنده شوند، نگهبانانش از ایشان پرسند آیا هشداردهنده‌ای نزد شما نیامد؟"
          ],
          "fa.makarem": [
            "نزدیک است (دوزخ) از شدّت غضب پاره پاره شود؛ هر زمان که گروهی در آن افکنده می‌شوند، نگهبانان دوزخ از آنها می‌پرسند: «مگر بیم‌دهنده الهی به سراغ شما نیامد؟!»"
          ],
          "fa.moezzi": [
            "نزدیک است جدا شود از خشم هر گاه افکنده شوند در آن فوجی پرسندشان نگهبانانش آیا نیامد شما را ترساننده‌ای‌"
          ],
          "fa.mojtabavi": [
            "نزديك است كه از خشم پاره پاره شود. هر گاه گروهى- از دوزخيان- در آن افكنده شوند، نگهبانانش [به نكوهش و سرزنش‌] از آنها پرسند: مگر شما را بيم‌كننده‌اى نيامد؟"
          ],
          "fa.sadeqi": [
            "نزدیک است از خشم شکافته شود. هر بار گروهی در آن افکنده شوند، نگاهبانان آن از ایشان پرسند: «مگر شما را هشداردهنده‌ای نیامد؟»"
          ]
        }
      },
      {
        "index": 5250,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:67:9",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:2:1:17:1"
          ]
        },
        "text": [
          "قَالُوا بَلَى‌ قَدْ جَاءَنَا نَذِيرٌ فَکَذَّبْنَا وَ قُلْنَا مَا نَزَّلَ‌ اللَّهُ‌ مِنْ‌ شَيْ‌ءٍ إِنْ‌ أَنْتُمْ‌ إِلاَّ فِي‌ ضَلاَلٍ‌ کَبِيرٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "And they will answer: \"Surely; a warner came to us, but we denied him, and said: 'God did not send down any thing; you are greatly deluded, in fact.'\""
          ],
          "en.ahmedraza": [
            "They will say, “Yes, why not – indeed a Herald of Warning did come to us – in response we denied and said ‘Allah has not sent down anything – you are not except in a great error’.”"
          ],
          "en.arberry": [
            "They say, 'Yes indeed, a warner came to us; but we cried lies, saying, \"God has not sent down anything; you are only in great error."
          ],
          "en.daryabadi": [
            "They will say: yea! surely there came a warner Unto us, but we belied, and said: God hath not sent down aught, are naught but in a great error."
          ],
          "en.hilali": [
            "They will say: \"Yes indeed; a warner did come to us, but we belied him and said: 'Allah never sent down anything (of revelation), you are only in great error.'\""
          ],
          "en.itani": [
            "They will say, “Yes, a warner did come to us, but we disbelieved, and said, ‘God did not send down anything; you are very much mistaken.’”"
          ],
          "en.maududi": [
            "They will say: “Yes, a warner came to us, but we gave the lie to him and said: 'Allah has revealed nothing. You are surely in huge error.'"
          ],
          "en.mubarakpuri": [
            "They will say: \"Yes, indeed a warner did come to us, but we rejected him and said: `Allah never sent down anything; you are only in great error.\"'"
          ],
          "en.pickthall": [
            "They say: Yea, verily, a warner came unto us; but we denied and said: Allah hath naught revealed; ye are in naught but a great error."
          ],
          "en.qarai": [
            "They will say, ‘Yes, a warner did come to us, but we impugned [him] and said, ‘Allah did not send down anything; you are only in great error.’"
          ],
          "en.qaribullah": [
            "'Yes, indeed' they will reply, 'but we belied the Warner (Messenger) saying: 'Allah has not sent down anything, you are but in great error'"
          ],
          "en.sahih": [
            "They will say,\" Yes, a warner had come to us, but we denied and said, 'Allah has not sent down anything. You are not but in great error.'\""
          ],
          "en.sarwar": [
            "They will say, \"Yes, someone did come to warn us, but we rejected him saying, 'God has revealed nothing. You are in great error\"."
          ],
          "en.shakir": [
            "They shall say: Yea! indeed there came to us a warner, but we rejected (him) and said: Allah has not revealed anything, you are only in a great error."
          ],
          "en.transliteration": [
            "Q<u>a</u>loo bal<u>a</u> qad j<u>a</u>an<u>a</u> na<u>th</u>eerun faka<u>thth</u>abn<u>a</u> waquln<u>a</u> m<u>a</u> nazzala All<u>a</u>hu min shayin in antum ill<u>a</u> fee <u>d</u>al<u>a</u>lin kabeer<b>in</b>"
          ],
          "en.wahiduddin": [
            "They will say, \"Of course, a warner did come to us, but we belied him and we said, 'God has revealed nothing; you are in gross error.'\""
          ],
          "en.yusufali": [
            "They will say: \"Yes indeed; a Warner did come to us, but we rejected him and said, 'Allah never sent down any (Message): ye are nothing but an egregious delusion!'\""
          ],
          "fa.ansarian": [
            "می گویند: چرا، بیم دهنده آمد، ولی او را انکار کردیم و گفتیم: خدا هیچ چیز نازل نکرده است؛ شما بیم دهندگان جز در گمراهی بزرگی نیستید؛"
          ],
          "fa.ayati": [
            "گويند: چرا، بيم‌دهنده آمد ولى تكذيبش كرديم و گفتيم: خدا هيچ چيز نازل نكرده است؛ شما در گمراهى بزرگى هستيد."
          ],
          "fa.bahrampour": [
            "گويند: چرا البته هشدار دهنده‌اى به سوى ما آمد، ولى تكذيب كرديم و گفتيم: خدا چيزى نفرستاده است جز اين نيست كه شما در گمراهى بزرگى هستيد"
          ],
          "fa.fooladvand": [
            "گويند: «چرا، هشدار دهنده‌اى به سوى ما آمد و[لى‌] تكذيب كرديم و گفتيم: خدا چيزى فرو نفرستاده است، شما جز در گمراهى بزرگ نيستيد.»"
          ],
          "fa.ghomshei": [
            "آنها در جواب گویند: آری، ما را رسول بیم دهنده حق آمد ولی ما تکذیب او کردیم و گفتیم که خدا چیزی (از آسمان) نفرستاده و جز اینکه شما رسولان سخت به گمراهی و ضلالتید هیچ نیست."
          ],
          "fa.khorramdel": [
            "می‌گویند: آری! پیغمبران بیم دهنده‌ای به میان ما آمدند و ما دروغگویشان نامیدیم و گفتیم: خداوند به هیچ وجه چیزی را (به نام وحی، برای کسی) نفرستاده است، و شما دچار گمراهی بزرگی هستید. [[«ضَلالٍ کَبِیرٍ»: گمراهی عظیم. سرگشتگی فراوان.]]"
          ],
          "fa.khorramshahi": [
            "گویند چرا، هشداردهنده‌ای نزد ما آمد، آنگاه [او را] تکذیب کردیم و گفتیم خداوند چیزی فرو نفرستاده است، شما جز در گمراهی بزرگ نیستید"
          ],
          "fa.makarem": [
            "می‌گویند: «آری، بیم‌دهنده به سراغ ما آمد، ولی ما او را تکذیب کردیم و گفتیم: خداوند هرگز چیزی نازل نکرده، و شما در گمراهی بزرگی هستید!»"
          ],
          "fa.moezzi": [
            "گفتند بلی بیامد ما را ترساننده‌ای پس تکذیب کردیم و گفتیم نفرستاده است خدا چیزی نیستید شما مگر در گمراهی گران‌"
          ],
          "fa.mojtabavi": [
            "گويند: چرا، همانا ما را بيم‌كننده آمد، ولى تكذيب كرديم و گفتيم: خدا هيچ چيز فرونفرستاده است، شما جز در گمراهى بزرگ نيستيد."
          ],
          "fa.sadeqi": [
            "گفتند: «چرا، بی‌گمان هشداردهنده‌ای سویمان آمد، پس تکذیب(اش) کردیم و گفتیم خدا چیزی فرو نفرستاده است‌؛ شما جز در گمراهی بزرگی نیستید.»"
          ]
        }
      },
      {
        "index": 5251,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:67:10",
        "text": [
          "وَ قَالُوا لَوْ کُنَّا نَسْمَعُ‌ أَوْ نَعْقِلُ‌ مَا کُنَّا فِي‌ أَصْحَابِ‌ السَّعِيرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "They will say: \"If we had listened and been wise, we would not have been among the inmates of Hell.\""
          ],
          "en.ahmedraza": [
            "And they will say, “Had we listened or understood, we would not have been among the people of hell.”"
          ],
          "en.arberry": [
            "They also say, 'If we had only heard, or had understood, we would not have been of the inhabitants of the Blaze.'"
          ],
          "en.daryabadi": [
            "And they will say: had we been wont to hearken or to reflect, we had not been among the fellows of the Blaze."
          ],
          "en.hilali": [
            "And they will say: \"Had we but listened or used our intelligence, we would not have been among the dwellers of the blazing Fire!\""
          ],
          "en.itani": [
            "And they will say, “Had we listened or reasoned, we would not have been among the inmates of the Blaze.”"
          ],
          "en.maududi": [
            "They will say: 'If we had only listened and understood, we would not be among the inmates of the Blazing Fire.'”"
          ],
          "en.mubarakpuri": [
            "And they will say: \"Had we but listened or used our intelligence, we would not have been among the dwellers of the blazing Fire!\""
          ],
          "en.pickthall": [
            "And they say: Had we been wont to listen or have sense, we had not been among the dwellers in the flames."
          ],
          "en.qarai": [
            "And they will say, ‘Had we listened or applied reason, we would not have been among inmates of the Blaze.’"
          ],
          "en.qaribullah": [
            "And they will then say: 'If only we had listened and understood we should not now be among the inhabitants of the Blaze'"
          ],
          "en.sahih": [
            "And they will say, \"If only we had been listening or reasoning, we would not be among the companions of the Blaze.\""
          ],
          "en.sarwar": [
            "They will also say, \"Had We listened or used our minds, we would not have become the dwellers of hell\"."
          ],
          "en.shakir": [
            "And they shall say: Had we but listened or pondered, we should not have been among the inmates of the burning fire."
          ],
          "en.transliteration": [
            "Waq<u>a</u>loo law kunn<u>a</u> nasmaAAu aw naAAqilu m<u>a</u> kunn<u>a</u> fee a<u>s</u><u>ha</u>bi a<b>l</b>ssaAAeer<b>i</b>"
          ],
          "en.wahiduddin": [
            "They will say, \"If we had only listened or understood, we should not now be among the inmates of Hell,\""
          ],
          "en.yusufali": [
            "They will further say: \"Had we but listened or used our intelligence, we should not (now) be among the Companions of the Blazing Fire!\""
          ],
          "fa.ansarian": [
            "و می گویند: اگر ما [دعوت سعادت بخش آنان را] شنیده بودیم، یا [در حقایقی که برای ما آوردند] تعقّل کرده بودیم، در میان [آتش] اهل آتش سوزان نبودیم."
          ],
          "fa.ayati": [
            "و مى‌گويند: اگر ما مى‌شنيديم يا تعقل مى‌كرديم، اهل اين آتش سوزنده نمى‌بوديم."
          ],
          "fa.bahrampour": [
            "و گويند: اگر مى‌شنيديم يا تعقل مى‌كرديم در زمره‌ى دوزخيان نبوديم"
          ],
          "fa.fooladvand": [
            "و گويند: «اگر شنيده [و پذيرفته‌] بوديم يا تعقل كرده بوديم در [ميان‌] دوزخيان نبوديم.»"
          ],
          "fa.ghomshei": [
            "و گویند: اگر ما در دنیا (سخن انبیا) می‌شنیدیم یا به دستور عقل رفتار می‌کردیم (امروز) از دوزخیان نبودیم."
          ],
          "fa.khorramdel": [
            "و می‌گویند: اگر ما گوش شنوا می‌داشتیم، و یا عقل خود را به کار می‌گرفتیم، هرگز از زمره‌ی دوزخیان نمی‌گشتیم. [[«نَسْمَعُ»: مراد از شنیدن، شنیدن آگاهانه است (نگا: / 37).]]"
          ],
          "fa.khorramshahi": [
            "و گویند اگر [سخنان آنان را] به سمع قبول می‌شنیدیم یا تعقل می‌کردیم، از زمره دوزخیان نبودیم‌"
          ],
          "fa.makarem": [
            "و می‌گویند: «اگر ما گوش شنوا داشتیم یا تعقّل می‌کردیم، در میان دوزخیان نبودیم!»"
          ],
          "fa.moezzi": [
            "و گفتند اگر بودیم می‌شنیدیم یا بخرد می‌یافتیم نمی‌شدیم در یاران آتش سوزان‌"
          ],
          "fa.mojtabavi": [
            "و گويند: اگر ما مى‌شنيديم و خِرَد را كار مى‌بستيم در زمره دوزخيان نبوديم."
          ],
          "fa.sadeqi": [
            "و گفتند: «اگر شنیده بودیم، یا خردورزی می‌کردیم، در (میان) دوزخیان نبودیم.»"
          ]
        }
      },
      {
        "index": 5252,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:67:11",
        "text": [
          "فَاعْتَرَفُوا بِذَنْبِهِمْ‌ فَسُحْقاً لِأَصْحَابِ‌ السَّعِيرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "So will they confess their guilt. Deprived (of all joys) will be the inmates of Hell."
          ],
          "en.ahmedraza": [
            "So now they admit their sins! Therefore accursed be the people of hell!"
          ],
          "en.arberry": [
            "So they confess their sins. Curse the inhabitants of the Blaze!"
          ],
          "en.daryabadi": [
            "So they shall confess their sin. Far away they-be, the fellows of the Blaze!"
          ],
          "en.hilali": [
            "Then they will confess their sin. So, away with the dwellers of the blazing Fire."
          ],
          "en.itani": [
            "So they will acknowledge their sins. So away with the inmates of the Blaze."
          ],
          "en.maududi": [
            "Thus will they confess their sins. Damned are these inmates of the Blazing Fire."
          ],
          "en.mubarakpuri": [
            "Then they will confess their sin. So, away with the dwellers of the blazing Fire!"
          ],
          "en.pickthall": [
            "So they acknowledge their sins; but far removed (from mercy) are the dwellers in the flames."
          ],
          "en.qarai": [
            "Thus they will admit their sin. So away with the inmates of the Blaze!"
          ],
          "en.qaribullah": [
            "So it is that they confess their sins. Curse the inhabitants of the Blaze!"
          ],
          "en.sahih": [
            "And they will admit their sin, so [it is] alienation for the companions of the Blaze."
          ],
          "en.sarwar": [
            "They will confess to their sins, but the dwellers of hell will be far away from God's (mercy)."
          ],
          "en.shakir": [
            "So they shall acknowledge their sins, but far will be (forgiveness) from the inmates of the burning fire."
          ],
          "en.transliteration": [
            "Fa<b>i</b>AAtarafoo bi<u>th</u>anbihim fasu<u>h</u>qan lia<u>s</u><u>ha</u>bi a<b>l</b>ssaAAeer<b>i</b>"
          ],
          "en.wahiduddin": [
            "and thus they will confess their sin; far from God's mercy are the inmates of Hell."
          ],
          "en.yusufali": [
            "They will then confess their sins: but far will be (Forgiveness) from the Companions of the Blazing Fire!"
          ],
          "fa.ansarian": [
            "پس به گناه خود اعتراف می کنند. و مرگ و دوری از رحمت بر اهل آتش سوزان باد."
          ],
          "fa.ayati": [
            "پس به گناه خود اعتراف مى‌كنند. اى لعنت باد بر آنها كه اهل آتش سوزنده‌اند."
          ],
          "fa.bahrampour": [
            "آرى به گناه خود اعتراف مى‌كنند، پس طرد و هلاكت باد بر اهل جهنم"
          ],
          "fa.fooladvand": [
            "پس به گناه خود اقرار مى‌كنند. و مرگ باد بر اهل جهنم"
          ],
          "fa.ghomshei": [
            "آنجا به گناه خود معترف شوند (که سودی ندارد و خطاب قهر فرا رسد) که اهل آتش افروخته (قهر، از رحمت حق) دور باد."
          ],
          "fa.khorramdel": [
            "اینجا است که به گناه خود اعتراف می‌کنند. پس دوری (از رحمت خدا) بهره‌ی دوزخیان باد! [[«سُحْقاً»: دور شدن از رحمت خدا. مفعول مطلق فعل محذوفی است، و تقدیر چنین است: سَحَقَهُمُ اللهُ سُحْقاً.]]"
          ],
          "fa.khorramshahi": [
            "و بدین‌سان به گناهشان اعتراف می‌کنند، لعنت باد دوزخیان را"
          ],
          "fa.makarem": [
            "اینجاست که به گناه خود اعتراف می‌کنند؛ دور باشند دوزخیان از رحمت خدا!"
          ],
          "fa.moezzi": [
            "پس اقرار کردند به گناه خویش پس دور باد برای یاران آتش سوزان‌"
          ],
          "fa.mojtabavi": [
            "پس به گناه خويش اقرار كنند، پس نابودى باد اهل آتش افروخته را!"
          ],
          "fa.sadeqi": [
            "پس به گناه خود اعتراف کردند. پس برای جهنمیان بس فروپاشی (و نابسامانی) مقرر است."
          ]
        }
      },
      {
        "index": 5253,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:67:12",
        "text": [
          "إِنَ‌ الَّذِينَ‌ يَخْشَوْنَ‌ رَبَّهُمْ‌ بِالْغَيْبِ‌ لَهُمْ‌ مَغْفِرَةٌ وَ أَجْرٌ کَبِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "For those who fear their Lord in secret is forgiveness and a great reward."
          ],
          "en.ahmedraza": [
            "Indeed for those who fear their Lord without seeing is forgiveness, and a great reward."
          ],
          "en.arberry": [
            "Surely those who fear their Lord in the Unseen -- there awaits them forgiveness and a great wage."
          ],
          "en.daryabadi": [
            "Verily those who dread their Lord unseen, theirs shall be forgiveness and a great hire."
          ],
          "en.hilali": [
            "Verily! Those who fear their Lord unseen (i.e. they do not see Him, nor His Punishment in the Hereafter, etc.), theirs will be forgiveness and a great reward (i.e. Paradise)."
          ],
          "en.itani": [
            "As for those who fear their Lord in secret—for them is forgiveness and a great reward."
          ],
          "en.maududi": [
            "Surely forgiveness and a mighty reward await those who fear Allah without seeing Him."
          ],
          "en.mubarakpuri": [
            "Verily, those who fear their Lord unseen, theirs will be forgiveness and a great reward."
          ],
          "en.pickthall": [
            "Lo! those who fear their Lord in secret, theirs will be forgiveness and a great reward."
          ],
          "en.qarai": [
            "Indeed for those who fear their Lord in secret there will be forgiveness and a great reward."
          ],
          "en.qaribullah": [
            "But those who fear their Lord in the Unseen, for them there is forgiveness and a great wage."
          ],
          "en.sahih": [
            "Indeed, those who fear their Lord unseen will have forgiveness and great reward."
          ],
          "en.sarwar": [
            "Those who fear their Lord in secret will receive forgiveness and a great reward."
          ],
          "en.shakir": [
            "(As for) those who fear their Lord in secret, they shall surely have forgiveness and a great reward."
          ],
          "en.transliteration": [
            "Inna alla<u>th</u>eena yakhshawna rabbahum bi<b>a</b>lghaybi lahum maghfiratun waajrun kabeer<b>un</b>"
          ],
          "en.wahiduddin": [
            "As for those who fear their Lord in the unseen will have forgiveness and a rich reward."
          ],
          "en.yusufali": [
            "As for those who fear their Lord unseen, for them is Forgiveness and a great Reward."
          ],
          "fa.ansarian": [
            "بی تردید کسانی که در نهان از پروردگارشان می ترسند، برای آنان آمرزش و پاداشی بزرگ است."
          ],
          "fa.ayati": [
            "براى كسانى كه ناديده از پروردگارشان مى‌ترسند، آمرزش و مزد فراوان است."
          ],
          "fa.bahrampour": [
            "كسانى كه در نهان از پروردگارشان مى‌ترسند، آنها را آمرزش و پاداشى بزرگ است"
          ],
          "fa.fooladvand": [
            "كسانى كه در نهان از پروردگارشان مى‌ترسند، آنان را آمرزش و پاداشى بزرگ خواهد بود."
          ],
          "fa.ghomshei": [
            "همانا آنان که از خدای خود در پنهان می‌ترسند آنها را آمرزش و پاداش بزرگ (بهشت ابد) خواهد بود."
          ],
          "fa.khorramdel": [
            "کسانی که در نهان، از پروردگار خود می‌ترسند، آمرزش و پاداش بزرگ و فراوانی دارند. [[«بِالْغَیْبِ»: در نهان. دور از چشم مردمان. بدون این که خدا را ببینند.]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان کسانی که به نهان از پروردگارشان می‌هراسند، برای آنان آمرزش و پاداشی بزرگ است‌"
          ],
          "fa.makarem": [
            "(امّا) کسانی که از پروردگارشان در نهان می‌ترسند، مسلّماً آمرزش و پاداش بزرگی دارند!"
          ],
          "fa.moezzi": [
            "همانا آنان که بترسند پروردگار خویش را به نهان آنان را است آمرزشی و مزدی بزرگ‌"
          ],
          "fa.mojtabavi": [
            "همانا كسانى كه از پروردگارشان در نهان مى‌ترسند، آمرزش و مزد بزرگ دارند."
          ],
          "fa.sadeqi": [
            "بی‌گمان کسانی که از پروردگارشان در نهان با احترام می‌هراسند، برایشان همواره پوششی و پاداشی بزرگ است."
          ]
        }
      },
      {
        "index": 5254,
        "local_index": 13,
        "part_type": "Verse",
        "path": "/books/quran:67:13",
        "text": [
          "وَ أَسِرُّوا قَوْلَکُمْ‌ أَوِ اجْهَرُوا بِهِ‌ إِنَّهُ‌ عَلِيمٌ‌ بِذَاتِ‌ الصُّدُورِ"
        ],
        "translations": {
          "en.ahmedali": [
            "Whether you say a thing secretly or openly, He knows the innermost secrets of your hearts."
          ],
          "en.ahmedraza": [
            "And whether you speak softly or proclaim it aloud; He indeed knows what lies within the hearts!"
          ],
          "en.arberry": [
            "Be secret in your speech, or proclaim it, He knows the thoughts within the breasts."
          ],
          "en.daryabadi": [
            "And whather ye keep your discourse secret or publish it, verily He is the Knower of that which is in the breasts."
          ],
          "en.hilali": [
            "And whether you keep your talk secret or disclose it, verily, He is the All-Knower of what is in the breasts (of men)."
          ],
          "en.itani": [
            "Whether you keep your words secret, or declare them—He is Aware of the inner thoughts."
          ],
          "en.maududi": [
            "Whether you speak in secrecy or aloud, (it is all the same to Allah). He even knows the secrets that lie hidden in the breasts of people."
          ],
          "en.mubarakpuri": [
            "And whether you keep your talk secret or disclose it, verily, He is the All-Knower of what is in the breasts."
          ],
          "en.pickthall": [
            "And keep your opinion secret or proclaim it, lo! He is Knower of all that is in the breasts (of men)."
          ],
          "en.qarai": [
            "Speak secretly, or do so openly, indeed He knows well what is in the breasts."
          ],
          "en.qaribullah": [
            "(Whether you) speak in secret or aloud, He knows the innermost of the chests."
          ],
          "en.sahih": [
            "And conceal your speech or publicize it; indeed, He is Knowing of that within the breasts."
          ],
          "en.sarwar": [
            "Whether you conceal what you say or reveal it, God knows best all that the hearts contain."
          ],
          "en.shakir": [
            "And conceal your word or manifest it; surely He is Cognizant of what is in the hearts."
          ],
          "en.transliteration": [
            "Waasirroo qawlakum awi ijharoo bihi innahu AAaleemun bi<u>tha</u>ti a<b>l</b><u>ss</u>udoor<b>i</b>"
          ],
          "en.wahiduddin": [
            "Whether you speak in secret or aloud, He knows what is in every heart."
          ],
          "en.yusufali": [
            "And whether ye hide your word or publish it, He certainly has (full) knowledge, of the secrets of (all) hearts."
          ],
          "fa.ansarian": [
            "و گفتارتان را پنهان کنید یا آن را آشکار سازید، مسلماً او به نیّات و اسرار سینه ها داناست."
          ],
          "fa.ayati": [
            "چه به راز سخن گوييد و چه آشكارا، او به هر چه در دلها مى‌گذرد داناست."
          ],
          "fa.bahrampour": [
            "و [اگر] گفتارتان را پنهان داريد يا آشكار نماييد، بى‌گمان او به راز دل‌ها آگاه است"
          ],
          "fa.fooladvand": [
            "و [اگر] سخن خود را پنهان داريد، يا آشكارش نماييد، در حقيقت وى به راز دلها آگاه است."
          ],
          "fa.ghomshei": [
            "و شما سخن پنهان گویید یا آشکار، در علم حق یکسان است، که خدا به اسرار دلها هم البته داناست."
          ],
          "fa.khorramdel": [
            "چه سخنان خود را آهسته گوئید و زمزمه کنید، وچه بلند گوئید و آشکار سازید، (برای خدا یکسان و عیان است). چرا که او کاملاً آگاه از اسرار و خفایای سینه‌ها است. [[«أَسِرُّوا»: لفظاً امر است و در معنی خبر.]]"
          ],
          "fa.khorramshahi": [
            "و سخنتان را چه پوشیده دارید چه آشکار، او به راز دلها داناست‌"
          ],
          "fa.makarem": [
            "گفتار خود را پنهان کنید یا آشکار (تفاوتی نمی‌کند)، او به آنچه در سینه‌هاست آگاه است!"
          ],
          "fa.moezzi": [
            "و نهان کنید سخن خویش را یا آشکارش سازید همانا او است دانا بدانچه در سینه‌ها است‌"
          ],
          "fa.mojtabavi": [
            "و گفتارتان را چه پنهان داريد يا آن را آشكار كنيد، همانا او بدانچه در سينه‌هاست داناست."
          ],
          "fa.sadeqi": [
            "و سخنتان را (چه) پنهان بدارید، یا آشکارش نمایید، خدا همواره به (راز) ذاتی سینه‌ها بسی آگاه است."
          ]
        }
      },
      {
        "index": 5255,
        "local_index": 14,
        "part_type": "Verse",
        "path": "/books/quran:67:14",
        "text": [
          "أَ لاَ يَعْلَمُ‌ مَنْ‌ خَلَقَ‌ وَ هُوَ اللَّطِيفُ‌ الْخَبِيرُ"
        ],
        "translations": {
          "en.ahmedali": [
            "Can He who has created not know (His creation)? He is all-penetrating, all-aware."
          ],
          "en.ahmedraza": [
            "What! Will He Who has created not know? Whereas He knows every detail, the All Aware!"
          ],
          "en.arberry": [
            "Shall He not know, who created? And He is the All-subtle, the All-aware."
          ],
          "en.daryabadi": [
            "Shall not He Who hath created know? And He is the Subtile, the Aware."
          ],
          "en.hilali": [
            "Should not He Who has created know? And He is the Most Kind and Courteous (to His slaves) All-Aware (of everything)."
          ],
          "en.itani": [
            "Would He not know, He Who created? He is the Refined, the Expert."
          ],
          "en.maududi": [
            "Would He not know, He Who has created, when He is All-Subtle, All-Aware?"
          ],
          "en.mubarakpuri": [
            "Should not He Who has created know And He is the Most Kind and Courteous, All-Aware."
          ],
          "en.pickthall": [
            "Should He not know what He created? And He is the Subtile, the Aware."
          ],
          "en.qarai": [
            "Would He who has created not know? And He is the All-attentive, the All-aware."
          ],
          "en.qaribullah": [
            "Shall He who has created (all things) not know? He is the Subtle, the Aware."
          ],
          "en.sahih": [
            "Does He who created not know, while He is the Subtle, the Acquainted?"
          ],
          "en.sarwar": [
            "Does the One Who is Subtle, All-aware, and Who created all things not know all about them?"
          ],
          "en.shakir": [
            "Does He not know, Who created? And He is the Knower of the subtleties, the Aware."
          ],
          "en.transliteration": [
            "Al<u>a</u> yaAAlamu man khalaqa wahuwa alla<u>t</u>eefu alkhabeer<b>u</b>"
          ],
          "en.wahiduddin": [
            "How could He who created not know His own creation, when He alone is the Most Subtle in His wisdom and the All Aware?"
          ],
          "en.yusufali": [
            "Should He not know,- He that created? and He is the One that understands the finest mysteries (and) is well-acquainted (with them)."
          ],
          "fa.ansarian": [
            "آیا کسی که [همه موجودات را] آفریده است، نمی داند؟ و حال آنکه او لطیف و آگاه است."
          ],
          "fa.ayati": [
            "آيا آن كه آفريده نمى‌داند؟ حال آنكه او باريك‌بين و آگاه است."
          ],
          "fa.bahrampour": [
            "آيا كسى كه آفريده است نمى‌داند؟ حال آن كه او باريك‌بين آگاه است"
          ],
          "fa.fooladvand": [
            "آيا كسى كه آفريده است نمى‌داند؟ با اينكه او خود باريك بين آگاه است."
          ],
          "fa.ghomshei": [
            "آیا آن خدایی که خلق را آفریده عالم به اسرار آنها نیست؟ و حال آنکه او بر باطن و ظاهر همه امور عالم آگاه است."
          ],
          "fa.khorramdel": [
            "مگر کسی که (مردمان را) می‌آفریند (حال و وضع ایشان را) نمی‌داند، و حال این که او دقیق و باریک بین بس آگاهی است؟! [[«أَلا یَعْلَمُ؟»: مگر نمی‌داند؟ استفهام انکاری است.]]"
          ],
          "fa.khorramshahi": [
            "آیا کسی که آفریده است، علم ندارد؟ و اوست باریک‌بین آگاه‌"
          ],
          "fa.makarem": [
            "آیا آن کسی که موجودات را آفریده از حال آنها آگاه نیست؟! در حالی که او (از اسرار دقیق) باخبر و آگاه است!"
          ],
          "fa.moezzi": [
            "آیا نداند آنکه بیافریده است و او است تیزبین کارآگاه‌"
          ],
          "fa.mojtabavi": [
            "آيا كسى كه آفريده است نمى‌داند- آيا آفريدگار از آفريده خود با خبر نيست-، و حال آنكه باريكدان و آگاه است؟!"
          ],
          "fa.sadeqi": [
            "آیا کسی که (جهان را) آفریده است نمی‌داند؟ در حالی که او بس باریک‌بینِ آگاه است‌."
          ]
        }
      },
      {
        "index": 5256,
        "local_index": 15,
        "part_type": "Verse",
        "path": "/books/quran:67:15",
        "text": [
          "هُوَ الَّذِي‌ جَعَلَ‌ لَکُمُ‌ الْأَرْضَ‌ ذَلُولاً فَامْشُوا فِي‌ مَنَاکِبِهَا وَ کُلُوا مِنْ‌ رِزْقِهِ‌ وَ إِلَيْهِ‌ النُّشُورُ"
        ],
        "translations": {
          "en.ahmedali": [
            "It is He who made the earth subservient to you that you may travel all around it, and eat of things He has provided; and to Him will be your resurrection."
          ],
          "en.ahmedraza": [
            "It is He Who subjected the earth for you, therefore tread its paths and eat from Allah’s sustenance; and towards Him is the resurrection."
          ],
          "en.arberry": [
            "It is He who made the earth submissive to you; therefore walk in its tracts, and eat of His provision; to Him is the Uprising."
          ],
          "en.daryabadi": [
            "He it is Who hath made the earth Unto you subservient, so go forth in the regions thereof, and eat of His provision. And Unto Him is the Resurrection."
          ],
          "en.hilali": [
            "He it is, Who has made the earth subservient to you (i.e. easy for you to walk, to live and to do agriculture on it, etc.), so walk in the path thereof and eat of His provision, and to Him will be the Resurrection."
          ],
          "en.itani": [
            "It is He who made the earth manageable for you, so travel its regions, and eat of His provisions. To Him is the Resurgence."
          ],
          "en.maududi": [
            "He it is Who made the earth subservient to you. So traverse in its tracks and partake of the sustenance He has provided. To Him will you be resurrected."
          ],
          "en.mubarakpuri": [
            "He it is Who has made the earth subservient to you; so walk in the paths thereof and eat of His provision. And to Him will be the resurrection."
          ],
          "en.pickthall": [
            "He it is Who hath made the earth subservient unto you, so Walk in the paths thereof and eat of His providence. And unto Him will be the resurrection (of the dead)."
          ],
          "en.qarai": [
            "It is He who made the earth tractable for you; so walk on its flanks and eat of His provision, and towards Him is the resurrection."
          ],
          "en.qaribullah": [
            "It is He who has made the earth submissive to you. Walk about in its land and eat of His provision. To Him is the Resurrection."
          ],
          "en.sahih": [
            "It is He who made the earth tame for you - so walk among its slopes and eat of His provision - and to Him is the resurrection."
          ],
          "en.sarwar": [
            "It is He who has made the earth subservient to you. You walk through its vast valleys and eat of its sustenance. Before Him you will all be resurrected."
          ],
          "en.shakir": [
            "He it is Who made the earth smooth for you, therefore go about in the spacious sides thereof, and eat of His sustenance, and to Him is the return after death."
          ],
          "en.transliteration": [
            "Huwa alla<u>th</u>ee jaAAala lakumu alar<u>d</u>a <u>th</u>aloolan fa<b>i</b>mshoo fee man<u>a</u>kibih<u>a</u> wakuloo min rizqihi wailayhi a<b>l</b>nnushoor<b>u</b>"
          ],
          "en.wahiduddin": [
            "It is He who has made the earth subservient to you, so traverse its regions and eat its provisions. To Him you shall all be resurrected."
          ],
          "en.yusufali": [
            "It is He Who has made the earth manageable for you, so traverse ye through its tracts and enjoy of the Sustenance which He furnishes: but unto Him is the Resurrection."
          ],
          "fa.ansarian": [
            "اوست که زمین را برای شما رام قرار داد، بنابراین بر اطراف و جوانب آن راه روید و از روزی خدا بخورید، و برانگیختن مردگان و رستاخیز به سوی اوست."
          ],
          "fa.ayati": [
            "اوست كه زمين را رام شما گردانيد. پس بر روى آن سير كنيد، و از رزق خدا بخوريد. چون از قبر بيرون آييد به سوى او مى‌رويد."
          ],
          "fa.bahrampour": [
            "او كسى است كه زمين را براى شما رام كرد، پس در اطراف و اكناف آن قدم برداريد و از روزى او بخوريد و [بدانيد كه‌] برانگيخته شدن [شما] به سوى اوست"
          ],
          "fa.fooladvand": [
            "اوست كسى كه زمين را براى شما رام گردانيد، پس در فراخناى آن رهسپار شويد و از روزى [خدا] بخوريد و رستاخيز به سوى اوست."
          ],
          "fa.ghomshei": [
            "او آن خدایی است که زمین را برای شما نرم و هموار گردانید پس شما در پست و بلندی‌های آن حرکت کنید و از روزی او خورید و (بدانید که) بازگشت همه خلایق به سوی اوست."
          ],
          "fa.khorramdel": [
            "او کسی است که زمین را رام شما گردانیده است. در اطراف و جوانب آن راه بروید، و از روزی خدا بخورید. زنده شدن دوباره در دست او است. [[«ذَلُولاً»: رام. مسخّر (نگا: بقره / 71). «مَنَاکِب». جمع مَنْکِب، دوش. مراد جوانب و اطراف زمین است. «النُّشُورُ»: زنده شدن مردگان. رستاخیز مردگان. «إلَیْهِ»: حرف إلی به معنی (لَ) است، مانند: أَلأمْرُ إِلَیْکَ (نگا: مغنی لبیب). برخی (نُشور) را به معنی (بازگشت) دانسته‌اند (نگا: نمونه، روح‌البیان، روح‌المعانی).]]"
          ],
          "fa.khorramshahi": [
            "اوست کسی که زمین را برای شما رام گردانید، پس در گوشه و کنار آن رهسپار شوید و از روزی او بخورید، و رستاخیز به امر [و در پیشگاه‌] اوست‌"
          ],
          "fa.makarem": [
            "او کسی است که زمین را برای شما رام کرد، بر شانه‌های آن راه بروید و از روزیهای خداوند بخورید؛ و بازگشت و اجتماع همه به سوی اوست!"
          ],
          "fa.moezzi": [
            "او است آنکه گردانید برای شما زمین را رام پس روان شوید به هر سویش و بخورید از روزیش و بسوی او است گردآمدن‌"
          ],
          "fa.mojtabavi": [
            "اوست كه زمين را براى شما رام كرد پس در اطراف و كنارهاى آن راه رويد و از روزى او بخوريد و [بدانيد كه‌] برانگيختن- در روز رستاخيز- به سوى اوست."
          ],
          "fa.sadeqi": [
            "اوست کسی که زمین را (همچون حیوانی راهوار) برای شما رام گردانید. پس در فراخناهای آن رهسپار شوید و از روزیش بخورید. و رستاخیز تنها فراسوی اوست‌."
          ]
        }
      },
      {
        "index": 5257,
        "local_index": 16,
        "part_type": "Verse",
        "path": "/books/quran:67:16",
        "text": [
          "أَ أَمِنْتُمْ‌ مَنْ‌ فِي‌ السَّمَاءِ أَنْ‌ يَخْسِفَ‌ بِکُمُ‌ الْأَرْضَ‌ فَإِذَا هِيَ‌ تَمُورُ"
        ],
        "translations": {
          "en.ahmedali": [
            "Are you so unafraid that He who is in Heaven will not open up the earth to swallow you, when it will begin to tremble?"
          ],
          "en.ahmedraza": [
            "Have you become unafraid of the One Who controls the heavens, that He will not cause you to sink into the earth when it trembles?"
          ],
          "en.arberry": [
            "Do you feel secure that He who is in heaven will not cause the earth to swallow you, the while it rocks?"
          ],
          "en.daryabadi": [
            "Are ye secure that He who is in the heaven will not sink the earth with you and then it should quake?"
          ],
          "en.hilali": [
            "Do you feel secure that He, Who is over the heaven (Allah), will not cause the earth to sink with you, then behold it shakes (as in an earthquake)?"
          ],
          "en.itani": [
            "Are you confident that the One in heaven will not cause the earth to collapse beneath you as it spins?"
          ],
          "en.maududi": [
            "Do you feel secure that He Who is in the heaven will not cause the earth to cave in with you, and then suddenly it will begin to rock violently?"
          ],
          "en.mubarakpuri": [
            "Do you feel secure that He, Who is over the heaven, will not cause the earth to sink with you, and then it should quake"
          ],
          "en.pickthall": [
            "Have ye taken security from Him Who is in the heaven that He will not cause the earth to swallow you when lo! it is convulsed?"
          ],
          "en.qarai": [
            "Are you secure that He who is in the sky will not make the earth swallow you while it quakes?"
          ],
          "en.qaribullah": [
            "Do you feel secure that He who is in the heaven will not cause the earth to swallow you up while it shakes?"
          ],
          "en.sahih": [
            "Do you feel secure that He who [holds authority] in the heaven would not cause the earth to swallow you and suddenly it would sway?"
          ],
          "en.sarwar": [
            "Do you feel secure that the One in the heavens will not cause you to sink into the earth when it is violently shaking?"
          ],
          "en.shakir": [
            "Are you secure of those in the heaven that He should not make the earth to swallow you up? Then lo! it shall be in a state of commotion."
          ],
          "en.transliteration": [
            "Aamintum man fee a<b>l</b>ssam<u>a</u>i an yakhsifa bikumu alar<u>d</u>a fai<u>tha</u> hiya tamoor<b>u</b>"
          ],
          "en.wahiduddin": [
            "Do you feel secure that He who is in heaven will not cause the earth to sink beneath you and then begin to quake?"
          ],
          "en.yusufali": [
            "Do ye feel secure that He Who is in heaven will not cause you to be swallowed up by the earth when it shakes (as in an earthquake)?"
          ],
          "fa.ansarian": [
            "آیا از کسی که [حاکمیت و فرمانروایی اش] در آسمان قطعی است [چه رسد در زمین] خود را در امان دیده اید، از اینکه [با شکافتن زمین] شما را در آن فرو برد در حالی که زلزله و جنبش موج آسایش را ادامه دهد؟"
          ],
          "fa.ayati": [
            "آيا از آن كه در آسمان است ايمن نشسته‌ايد كه ناگاه زمين را به لرزش درآورد و زمين شما را در خود فرو برد؟"
          ],
          "fa.bahrampour": [
            "آيا از آن كس كه در آسمان است ايمن شده‌ايد كه شما را به زمين فرو برد، پس به ناگاه زمين بلرزد"
          ],
          "fa.fooladvand": [
            "آيا از آن كس كه در آسمان است ايمن شده‌ايد كه شما را در زمين فرو برد، پس بناگاه [زمين‌] به تپيدن افتد؟"
          ],
          "fa.ghomshei": [
            "آیا از (قهر) خدایی که در آسمان مقتدر و حکمفرماست ایمنید که شما را به زمین فرو برد در حالی که زمین به موج و اضطراب در افتد؟"
          ],
          "fa.khorramdel": [
            "آیا از کسی که در آسمان است، خود را در امان می‌دانید که دستور بدهد زمین بشکافد و شما را فرو ببرد، و آن گاه بلرزد و بجنبد و حرکت بکند؟ [[«مَن فِی السَّمَآءِ»: کسی که در آسمان است. مراد خدا است. بودن او در آسمان، اشاره به زبردستی و بالادستی خدا و سلطه کامل و فراگیر او است. منظور محدود ساختن پروردگار به جا و مکان نیست. «یَخْسِفَ بِکُمْ»: شما را به زمین فرو ببرد (نگا: قصص / 81، عنکبوت / 40، سبأ / 9، نحل / 45). «تَمُورُ»: حرکت می‌کند، به جنبش و لرزش می‌افتد (نگا: طور / 9).]]"
          ],
          "fa.khorramshahi": [
            "آیا از آن که در آسمان است ایمنید که شما را در زمین فرو برد، در حالتی که آن ناگاه می‌جنبد؟"
          ],
          "fa.makarem": [
            "آیا خود را از عذاب کسی که حاکم بر آسمان است در امان می‌دانید که دستور دهد زمین بشکافد و شما را فرو برد و به لرزش خود ادامه دهد؟!"
          ],
          "fa.moezzi": [
            "آیا ایمن شدید از آنکه در آسمان است که فروبرد شما را در زمین ناگاه آن است لرزنده‌"
          ],
          "fa.mojtabavi": [
            "آيا از آن كه در آسمان است ايمن شده‌ايد از اينكه شما را به زمين فروبرد و آنگاه آن"
          ],
          "fa.sadeqi": [
            "آیا از آن کس که در آسمان (قدرت و علم و عدالت) است، ایمن شدید (از این) که شما را در زمین فرو برد؟ پس زمین (در آن هنگامه) ناگهان روان گردد."
          ]
        }
      },
      {
        "index": 5258,
        "local_index": 17,
        "part_type": "Verse",
        "path": "/books/quran:67:17",
        "text": [
          "أَمْ‌ أَمِنْتُمْ‌ مَنْ‌ فِي‌ السَّمَاءِ أَنْ‌ يُرْسِلَ‌ عَلَيْکُمْ‌ حَاصِباً فَسَتَعْلَمُونَ‌ کَيْفَ‌ نَذِيرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "Or have you become so unafraid that He who is in Heaven will not send a violent wind to shower stones at you? Then you will know the import of My commination!"
          ],
          "en.ahmedraza": [
            "Or have you become unafraid of the One Who controls the heavens, that He will not send a torrent of stones upon you? So now you will realise, how My warning turned out!"
          ],
          "en.arberry": [
            "Do you feel secure that He who is in heaven will not loose against you a squall of pebbles, then you shall know how My warning is?"
          ],
          "en.daryabadi": [
            "Or are ye secure that He Who is in the heaven will not send against you a whirlwind? Anon ye shall know what wise hath been My warning."
          ],
          "en.hilali": [
            "Or do you feel secure that He, Who is over the heaven (Allah), will not send against you a violent whirlwind? Then you shall know how (terrible) has been My Warning?"
          ],
          "en.itani": [
            "Or are you confident that the One in Heaven will not unleash against you a violent storm? Then you will know what My warning is like."
          ],
          "en.maududi": [
            "Do you feel secure that He Who is in the heaven will not let loose upon you a storm of stones? Then shall you know what My warning is like!"
          ],
          "en.mubarakpuri": [
            "Or do you feel secure that He, Who is over the heaven, will not send against you a Hasib Then you shall know how has been My warning."
          ],
          "en.pickthall": [
            "Or have ye taken security from Him Who is in the heaven that He will not let loose on you a hurricane? But ye shall know the manner of My warning."
          ],
          "en.qarai": [
            "Are you secure that He who is in the sky will not unleash upon you a rain of stones? Soon you will know how My warning has been!"
          ],
          "en.qaribullah": [
            "Do you feel secure that He who is in the heaven will not loose against you a squall of pebbles then you shall know how was My warning."
          ],
          "en.sahih": [
            "Or do you feel secure that He who [holds authority] in the heaven would not send against you a storm of stones? Then you would know how [severe] was My warning."
          ],
          "en.sarwar": [
            "Do you feel secure that the One in the heavens will not strike you with a sandstorm? You will soon know, with the coming of the torment, how serious Our warning was."
          ],
          "en.shakir": [
            "Or are you secure of those in the heaven that He should not send down upon you a punishment? Then shall you know how was My warning."
          ],
          "en.transliteration": [
            "Am amintum man fee a<b>l</b>ssam<u>a</u>i an yursila AAalaykum <u>has</u>iban fasataAAlamoona kayfa na<u>th</u>eer<b>i</b>"
          ],
          "en.wahiduddin": [
            "Do you feel secure that the One in heaven will not send against you a whirlwind to pelt you with stones, so that you will know how [true] My warning was?"
          ],
          "en.yusufali": [
            "Or do ye feel secure that He Who is in Heaven will not send against you a violent tornado (with showers of stones), so that ye shall know how (terrible) was My warning?"
          ],
          "fa.ansarian": [
            "آیا از کسی که حاکمیت و فرمانروایی اش در آسمان قطعی است [چه رسد در زمین] خود را در امان دیده اید از اینکه توفانی سخت [که با خود ریگ و سنگ می آورد] بر شما فرستد؟ پس به زودی خواهید دانست که بیم دادن من چگونه است!"
          ],
          "fa.ayati": [
            "يا از آن كه در آسمان است ايمن نشسته‌ايد كه ناگاه بادى همراه با سنگريزه بر سر شما فرستد؟ به زودى خواهيد دانست كه بيم‌دادن من چگونه است."
          ],
          "fa.bahrampour": [
            "يا از آن كس كه در آسمان است ايمن شده‌ايد كه بر سر شما تندبادى سنگبار فرو فرستد؟ پس زودا كه بدانيد بيم دادن من چگونه است"
          ],
          "fa.fooladvand": [
            "يا از آن كس كه در آسمان است ايمن شده‌ايد كه بر [سر] شما تندبادى از سنگريزه فرو فرستد؟ پس به زودى خواهيد دانست كه بيم دادن من چگونه است"
          ],
          "fa.ghomshei": [
            "آیا از قهر خدای مقتدری که در (زمین و) آسمان حکمفرماست ایمنید که تندبادی بفرستد و بر سر شما سنگ ببارد تا بدانید که وعده عذاب من چگونه است؟"
          ],
          "fa.khorramdel": [
            "یا این که از کسی که در آسمان است خود را در امان می‌دانید که طوفان شن بر شما گمارد (و شما را در زیر ریگهای روان دفن نماید؟). آن گاه خواهید دانست که تهدید من چگونه است. [[«حَاصِباً»: تند بادی که توده‌های شن و سنگریزه را با خود حرکت می‌دهد و از جائی به جائی می‌برد (نگا: اسراء / 68، عنکبوت / 40). «نَذِیرِ»: بیم دادن من. تهدید من. واژه نذیر در اینجا به معنی تحذیراست.]]"
          ],
          "fa.khorramshahi": [
            "یا از آن که در آسمان است ایمنید که بر شما شن‌بادی بفرستد، زودا که بدانید هشدار من چگونه است‌"
          ],
          "fa.makarem": [
            "یا خود را از عذاب خداوند آسمان در امان می‌دانید که تندبادی پر از سنگریزه بر شما فرستد؟! و بزودی خواهید دانست تهدیدهای من چگونه است!"
          ],
          "fa.moezzi": [
            "یا ایمن شدید از آنکه در آسمان است که بفرستد بر شما سنگ ریزه پس زود است بدانید چگونه بوده است ترساننده من‌"
          ],
          "fa.mojtabavi": [
            "يا از آن كه در آسمان است ايمن شده‌ايد از اينكه بر شما بادى سنگبار فرستد؟ پس بزودى خواهيد دانست كه بيم‌دادن من چگونه است."
          ],
          "fa.sadeqi": [
            "یا از آن کسی که در آسمان است ایمن شدید، که بر شما (تندبادی با) سنگریزه‌ای فرو فرستد؟ پس به زودی خواهید دانست که بیم‌دهنده‌ی (از سوی) من چگونه است!"
          ]
        }
      },
      {
        "index": 5259,
        "local_index": 18,
        "part_type": "Verse",
        "path": "/books/quran:67:18",
        "text": [
          "وَ لَقَدْ کَذَّبَ‌ الَّذِينَ‌ مِنْ‌ قَبْلِهِمْ‌ فَکَيْفَ‌ کَانَ‌ نَکِيرِ"
        ],
        "translations": {
          "en.ahmedali": [
            "Those before them had also denied. And how was My punishment then!"
          ],
          "en.ahmedraza": [
            "And indeed those before them had denied – therefore how did My rejection turn out!"
          ],
          "en.arberry": [
            "Those that were before them also cried lies; then how was My horror!"
          ],
          "en.daryabadi": [
            "And assuredly those before them belied; then what wise hath been My wrath!"
          ],
          "en.hilali": [
            "And indeed those before them belied (the Messengers of Allah), then how terrible was My denial (punishment)?"
          ],
          "en.itani": [
            "Those before them also denied the truth; and how was My disapproval?"
          ],
          "en.maududi": [
            "Those who came before them also gave the lie (to the Messengers): then how awesome was My chastisement!"
          ],
          "en.mubarakpuri": [
            "And indeed those before them rejected, then how terrible was My reproach"
          ],
          "en.pickthall": [
            "And verily those before them denied, then (see) the manner of My wrath (with them)!"
          ],
          "en.qarai": [
            "Certainly those who were before them had impugned [My apostles]; but then how was My rebuttal!"
          ],
          "en.qaribullah": [
            "Those who have gone before you also belied (their Messengers) then how was My disapproval!"
          ],
          "en.sahih": [
            "And already had those before them denied, and how [terrible] was My reproach."
          ],
          "en.sarwar": [
            "Those who lived before them had also rejected Our warning, and how terrible was Our retribution!"
          ],
          "en.shakir": [
            "And certainly those before them rejected (the truth), then how was My disapproval."
          ],
          "en.transliteration": [
            "Walaqad ka<u>thth</u>aba alla<u>th</u>eena min qablihim fakayfa k<u>a</u>na nakeer<b>i</b>"
          ],
          "en.wahiduddin": [
            "Those who went before them belied [the truth]: then how great was My rejection of them."
          ],
          "en.yusufali": [
            "But indeed men before them rejected (My warning): then how (terrible) was My rejection (of them)?"
          ],
          "fa.ansarian": [
            "و مسلماً کسانی که پیش از آنان بودند [آیات خدا و پیامبران را انکار کردند]، پس [بنگر] عذاب من چگونه بود!"
          ],
          "fa.ayati": [
            "هر آينه كسانى كه پيش از آنها بودند، پيامبران را تكذيب كردند. پس عذاب من چگونه بود."
          ],
          "fa.bahrampour": [
            "و البته كسانى هم كه پيش از آنها بودند به تكذيب پرداختند، پس [بنگر] عذاب من چگونه بود"
          ],
          "fa.fooladvand": [
            "و پيش از آنان [نيز] كسانى به تكذيب پرداختند پس عذاب من چگونه بود؟"
          ],
          "fa.ghomshei": [
            "و همانا امم پیش از اینها نیز (رسولان ما را) تکذیب کردند پس (بنگرید) چگونه سخت آنها را هلاک کردم."
          ],
          "fa.khorramdel": [
            "کسانی که پیش از اینان بوده‌اند (آیات و پیغمبران مرا) تکذیب کرده‌اند، ببین که خشم و کینه‌ی من بر سر ایشان چه آورده است و چه کرده است؟! [[«نَکیرِ»: بد آمدن من از ایشان. خشم و کینه‌ام. واژه (نکیر) به معنی (انکار) است.]]"
          ],
          "fa.khorramshahi": [
            "و به راستی که پیشینیان آنان تکذیب پیشه کردند پس [بنگر که‌] عقوبت من چگونه بود"
          ],
          "fa.makarem": [
            "کسانی که پیش از آنان بودند (آیات الهی را) تکذیب کردند، امّا (ببین) مجازات من چگونه بود!"
          ],
          "fa.moezzi": [
            "و همانا تکذیب کردند آنان که پیش از ایشان بودند پس چگونه بود کین کشیدن من‌"
          ],
          "fa.mojtabavi": [
            "و هر آينه كسانى كه پيش از آنان بودند تكذيب كردند، پس انكار [و كيفر] من چگونه بود؟"
          ],
          "fa.sadeqi": [
            "و همانا پیش از آنان (نیز) بی‌گمان کسانی تکذیب کردند. پس انکار (و انگار) من چگونه بود؟"
          ]
        }
      },
      {
        "index": 5260,
        "local_index": 19,
        "part_type": "Verse",
        "path": "/books/quran:67:19",
        "text": [
          "أَ وَ لَمْ‌ يَرَوْا إِلَى‌ الطَّيْرِ فَوْقَهُمْ‌ صَافَّاتٍ‌ وَ يَقْبِضْنَ‌ مَا يُمْسِکُهُنَ‌ إِلاَّ الرَّحْمٰنُ‌ إِنَّهُ‌ بِکُلِ‌ شَيْ‌ءٍ بَصِيرٌ"
        ],
        "translations": {
          "en.ahmedali": [
            "Do they not see the birds above them flying wings spread out or folded? Nothing holds them aloft but God. All things are within His purview."
          ],
          "en.ahmedraza": [
            "And did they not see the birds above them, spreading and closing their wings? None except the Most Gracious holds them up; indeed He sees all things."
          ],
          "en.arberry": [
            "Have they not regarded the birds above them spreading their wings, and closing them? Naught holds them but the All-merciful. Surely He sees everything."
          ],
          "en.daryabadi": [
            "Behold they not the birds above them, outstretching their wings and they also withdraw them? Naught holdeth them except the Compassionate. Verily He is of everything Beholder."
          ],
          "en.hilali": [
            "Do they not see the birds above them, spreading out their wings and folding them in? None upholds them except the Most Beneficent (Allah). Verily, He is the All-Seer of everything."
          ],
          "en.itani": [
            "Have they not seen the birds above them, spreading their wings, and folding them? None holds them except the Compassionate. He is Perceiver of everything."
          ],
          "en.maududi": [
            "Have they not seen birds above them spreading and closing their wings, with none holding them except the Merciful One? He oversees everything."
          ],
          "en.mubarakpuri": [
            "Do they not see the birds above them, spreading out their wings and folding them in None upholds them except the Most Gracious. Verily, He is the All-Seer of everything."
          ],
          "en.pickthall": [
            "Have they not seen the birds above them spreading out their wings and closing them? Naught upholdeth them save the Beneficent. Lo! He is Seer of all things."
          ],
          "en.qarai": [
            "Have they not regarded the birds above them spreading and closing their wings? No one sustains them except the All-beneficent. Indeed, He watches all things."
          ],
          "en.qaribullah": [
            "Do they not observe the birds above them, spreading their wings and folding them? None, except the Merciful holds them. Surely, He sees all things."
          ],
          "en.sahih": [
            "Do they not see the birds above them with wings outspread and [sometimes] folded in? None holds them [aloft] except the Most Merciful. Indeed He is, of all things, Seeing."
          ],
          "en.sarwar": [
            "Did they not see the birds above them, stretching out, and flapping their wings. No one keeps them up in the sky except the Beneficent God. He certainly watches over all things."
          ],
          "en.shakir": [
            "Have they not seen the birds above them expanding (their wings) and contracting (them)? What is it that withholds them save the Beneficent Allah? Surely He sees everything."
          ],
          "en.transliteration": [
            "Awalam yaraw il<u>a</u> a<b>l</b><u>tt</u>ayri fawqahum <u>sa</u>ff<u>a</u>tin wayaqbi<u>d</u>na m<u>a</u> yumsikuhunna ill<u>a</u> a<b>l</b>rra<u>h</u>m<u>a</u>nu innahu bikulli shayin ba<u>s</u>eer<b>un</b>"
          ],
          "en.wahiduddin": [
            "Do they not see the birds above them spreading and closing their wings? None save the Merciful sustains them. Surely, He observes all things."
          ],
          "en.yusufali": [
            "Do they not observe the birds above them, spreading their wings and folding them in? None can uphold them except (Allah) Most Gracious: Truly (Allah) Most Gracious: Truly it is He that watches over all things."
          ],
          "fa.ansarian": [
            "آیا ندانسته اند که پرندگان بالای سرشان را در حالی که بال می گشایند و می بندند، فقط [خدای] رحمان در فضا نگه می دارد؟ یقیناً او بر همه چیز بیناست."
          ],
          "fa.ayati": [
            "آيا پرندگانى را كه بال گشوده يا بال فراهم‌كشيده بر فراز سرشان در پروازند، نديده‌اند؟ آنها را جز خداى رحمان كسى در هوا نگاه نتواند داشت. اوست كه به همه چيز بيناست."
          ],
          "fa.bahrampour": [
            "آيا به پرندگان بالاى سرشان ننگريسته‌اند كه بال‌هايشان را باز و بسته مى‌كنند؟ آنها را جز [خداى‌] رحمان نگاه نمى‌دارد. مسلما او به هر چيزى بيناست"
          ],
          "fa.fooladvand": [
            "آيا در بالاى سرشان به پرندگان ننگريسته‌اند [كه گاه‌] بال مى‌گسترند و [گاه‌] بال مى‌آنند؟ جز خداى رحمان [كسى‌] آنها را نگاه نمى‌دارد، او به هر چيزى بيناست."
          ],
          "fa.ghomshei": [
            "آیا مرغان هوا را نمی‌نگرند که بالای سرشان پر گشوده، گاه بی‌حرکت و گاه با حرکت بال پرواز می‌کنند؟ کسی جز خدای مهربان آنها را (در فضا) نگاه نمی‌دارد، که او به احوال همه موجودات کاملا بیناست."
          ],
          "fa.khorramdel": [
            "آیا پرندگانی را نگاه نکرده‌اند که بالای سر آنان (در پروازند و) گاهی بالهای خود را گسترده و گاهی جمع می‌کنند؟! جز خداوند مهربان کسی آنها را (بر فراز آسمان) نگاه نمی‌دارد، چرا که او هر چیزی را می‌بیند (و می‌داند هر آفریده‌ای برای ادامه‌ی زندگی خود نیازمند چیست). [[«صَآفَّاتٍ»: گسترده بالان (نگا: نور / 41). «یَقْبِضْنَ»: بالها را فراهم می‌آورند. بالها را باز و بسته می‌کنند. «مَا یُمْسِکُهُنَّ»: (نگا: نحل / 79).]]"
          ],
          "fa.khorramshahi": [
            "آیا به پرندگان بر فراز سرشان ننگریسته‌اند، که بال گشاده‌اند و فرو بندند [آن را]، هیچ کس جز خداوند رحمان آنها را نگه نمی‌دارد، که او به هر چیزی بیناست‌"
          ],
          "fa.makarem": [
            "آیا به پرندگانی که بالای سرشان است، و گاه بالهای خود را گسترده و گاه جمع می‌کنند، نگاه نکردند؟! جز خداوند رحمان کسی آنها را بر فراز آسمان نگه نمی‌دارد، چرا که او به هر چیز بیناست!"
          ],
          "fa.moezzi": [
            "آیا ننگریستند مرغان بر فراز ایشان بال‌گشایندگان و بازدارندگان بالهای خویش نگاه نداردشان جز خداوند مهربان همانا او است به همه چیز بینا"
          ],
          "fa.mojtabavi": [
            "و آيا به مرغان بر فراز سرشان ننگريسته‌اند كه بالها گشايند و به هم آرند؟ [تا ببينند كه‌] هيچ كس آنها را [در هوا] جز خداى رحمان نگاه نمى‌دارد همانا او به هر چيزى بيناست."
          ],
          "fa.sadeqi": [
            "آیا و بالای سرشان، سوی پرندگان ننگریسته‌اند، حال آنکه صف کشیدگان و نگهبانان (خود)اند (و) جز (خدای) رحمان (کسی) آنها را نگه نمی‌دارد؟ به‌راستی او به هر چیزی بسیار بیناست."
          ]
        }
      },
      {
        "index": 5261,
        "local_index": 20,
        "part_type": "Verse",
        "path": "/books/quran:67:20",
        "text": [
          "أَمَّنْ‌ هٰذَا الَّذِي‌ هُوَ جُنْدٌ لَکُمْ‌ يَنْصُرُکُمْ‌ مِنْ‌ دُونِ‌ الرَّحْمٰنِ‌ إِنِ‌ الْکَافِرُونَ‌ إِلاَّ فِي‌ غُرُورٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "What other army do you have to help you apart from Ar-Rahman? The unbelievers are surely lost in delusion."
          ],
          "en.ahmedraza": [
            "Or which army do you have that will help you against the Most Gracious? The disbelievers are in nothing except an illusion."
          ],
          "en.arberry": [
            "Or who is this that shall be a host for you to help you, apart from the All-merciful? The unbelievers are only in delusion."
          ],
          "en.daryabadi": [
            "Who. is he that can be an army Unto you and succour you, beside the Compassionate! The infidelsjb are but in delusion."
          ],
          "en.hilali": [
            "Who is he besides the Most Beneficent that can be an army to you to help you? The disbelievers are in nothing but delusion."
          ],
          "en.itani": [
            "Or who is this who is a force for you to protect you against the Compassionate? The disbelievers are in nothing but delusion."
          ],
          "en.maududi": [
            "Which is your army that will come to your aid against the Merciful Lord? But the unbelievers are in utter delusion."
          ],
          "en.mubarakpuri": [
            "Who is it besides the Most Gracious that can be an army to you to help you The disbelievers are in nothing but delusion."
          ],
          "en.pickthall": [
            "Or who is he that will be an army unto you to help you instead of the Beneficent? The disbelievers are in naught but illusion."
          ],
          "en.qarai": [
            "Who is it that is your host who may help you, besides the All-beneficent? The faithless only dwell in delusion."
          ],
          "en.qaribullah": [
            "Or, who is it that shall be your host to help you, other than the Merciful? Indeed, the unbelievers are only deluded."
          ],
          "en.sahih": [
            "Or who is it that could be an army for you to aid you other than the Most Merciful? The disbelievers are not but in delusion."
          ],
          "en.sarwar": [
            "Do you have any armies who will help you against the Beneficent God? The disbelievers are certainly deceived (by satan)."
          ],
          "en.shakir": [
            "Or who is it that will be a host for you to assist you besides the Beneficent Allah? The unbelievers are only in deception."
          ],
          "en.transliteration": [
            "Amman h<u>atha</u> alla<u>th</u>ee huwa jundun lakum yan<u>s</u>urukum min dooni a<b>l</b>rra<u>h</u>m<u>a</u>ni ini alk<u>a</u>firoona ill<u>a</u> fee ghuroor<b>in</b>"
          ],
          "en.wahiduddin": [
            "Who is there to defend you like an army, besides the Lord of Mercy? Those who deny the truth are in deception."
          ],
          "en.yusufali": [
            "Nay, who is there that can help you, (even as) an army, besides (Allah) Most Merciful? In nothing but delusion are the Unbelievers."
          ],
          "fa.ansarian": [
            "آیا آن کیست [از] سپاهتان که شما را به هنگام نزول عذاب در برابر خدای رحمان یاری دهد؟ کافران جز دچار فریب [شیطان] نیستند."
          ],
          "fa.ayati": [
            "آيا آنان كه ياران شمايند توانند در برابر خدا ياريتان كنند؟ كافران در فريبى بيش نيستند."
          ],
          "fa.bahrampour": [
            "آيا كيست آن كسى كه او سپاه [و پشتوانه‌] شماست و شما را در برابر [خداى‌] رحمان يارى مى‌كند؟ كافران جز دچار فريب نيستند"
          ],
          "fa.fooladvand": [
            "يا آن كسى كه خود براى شما [چون‌] سپاهى است كه ياريتان مى‌كند، جز خداى رحمان كيست؟ كافران جز گرفتار فريب نيستند."
          ],
          "fa.ghomshei": [
            "آیا آن کیست که سپاه و مددکار شما باشد و همه‌گونه شما را در برابر خدای مهربان یاری تواند کرد؟ پس کافران جز در غرور و فریبی بیش نیستند."
          ],
          "fa.khorramdel": [
            "آخر کدام اشخاص و افرادند که لشکر شمایند و جدای از خداوند مهربان به شما کمک می‌کنند و از شما مواظبت می‌نمایند؟! کافران گرفتار غرورند و بس. [[«جُندٌ»: لشکر. سپاه. اسم جمع است و در معنی جمع می‌باشد. ذکر اسم اشاره و موصول و فعل آیه به شکل مفرد، با توجّه به لفظ جند است. «مِن دُونِ الرَّحْمنِ»: سوای خداوند مهربان. در برابر خداوند مهربان. با توجّه به معنی اخیر، مفهوم آیه چنین است: آخر چه کسانی هستند آنان که لشکر شمایند و در برابر خداوند مهربان از شما دفاع و به شما کمک می‌نمایند؟ «إِنْ»: حرف نافیه است. «غُرُورٍ»: گول خوردن. فریب.]]"
          ],
          "fa.khorramshahi": [
            "یا کیست آنکه سپاه شماست که شما را در برابر خدای رحمان یاری دهد؟ کافران جز در [توهم و] فریب خوردگی نیستند"
          ],
          "fa.makarem": [
            "آیا این کسی که لشکر شماست می‌تواند شما را در برابر خداوند یاری دهد؟ ولی کافران تنها گرفتار فریبند!"
          ],
          "fa.moezzi": [
            "آیا آنکه اوست سپاهی برای شما یاریتان کند جز خدای مهربان نیستند کافران مگر در فریب‌"
          ],
          "fa.mojtabavi": [
            "يا كيست آن كه سپاه شما باشد كه شما را در برابر خداى رحمان يارى كند؟ كافران جز در فريفتگى- فريب‌خورده شيطان- نيستند."
          ],
          "fa.sadeqi": [
            "یا آن‌که برایتان سپاهی است تا از (عذاب) رحمان یاریتان کند؟ کافران جز در (ژرفای) فریب نیستند."
          ]
        }
      },
      {
        "index": 5262,
        "local_index": 21,
        "part_type": "Verse",
        "path": "/books/quran:67:21",
        "text": [
          "أَمَّنْ‌ هٰذَا الَّذِي‌ يَرْزُقُکُمْ‌ إِنْ‌ أَمْسَکَ‌ رِزْقَهُ‌ بَلْ‌ لَجُّوا فِي‌ عُتُوٍّ وَ نُفُورٍ"
        ],
        "translations": {
          "en.ahmedali": [
            "Who is there to give you food in case He withholds His bounty? Yet they persist in rebellion and aversion."
          ],
          "en.ahmedraza": [
            "Or who is such that will give you sustenance if Allah stops His sustenance? In fact they persist in rebellion and hatred."
          ],
          "en.arberry": [
            "Or who is this that shall provide for you if He withholds His provision? No, but they persist in disdain and aversion."
          ],
          "en.daryabadi": [
            "Who is he that can provide for you, should He withhold His provision? Aye! they persists in perverseness and aversion."
          ],
          "en.hilali": [
            "Who is he that can provide for you if He should withhold His provision? Nay, but they continue to be in pride, and (they) flee (from the truth)."
          ],
          "en.itani": [
            "Or who is this that will provide for you, if He withholds His provision? Yet they persist in defiance and aversion."
          ],
          "en.maududi": [
            "Who shall provide for you if He withholds His sustenance? Nay; but they persist in rebellion and aversion."
          ],
          "en.mubarakpuri": [
            "Who is it that can provide for you if He should withhold His provision Nay, but they continue to be in pride, and flee."
          ],
          "en.pickthall": [
            "Or who is he that will provide for you if He should withhold His providence? Nay, but they are set in pride and frowardness."
          ],
          "en.qarai": [
            "Who is it that may provide for you if He withholds His provision? Indeed, they persist in defiance and aversion."
          ],
          "en.qaribullah": [
            "Or, who is it that shall provide for you if He withholds His provision? Yet they persist in arrogance and aversion."
          ],
          "en.sahih": [
            "Or who is it that could provide for you if He withheld His provision? But they have persisted in insolence and aversion."
          ],
          "en.sarwar": [
            "Is there anyone who will provide you with sustenance if God were to deny you sustenance? In fact, they obstinately persist in their transgression and hatred."
          ],
          "en.shakir": [
            "Or who is it that will give you sustenance if He should withhold His sustenance? Nay! they persist in disdain and aversion."
          ],
          "en.transliteration": [
            "Amman h<u>atha</u> alla<u>th</u>ee yarzuqukum in amsaka rizqahu bal lajjoo fee AAutuwwin wanufoor<b>in</b>"
          ],
          "en.wahiduddin": [
            "Who can provide for you, if He withholds His provision? Yet they obstinately persist in rebellion and avoidance of the truth."
          ],
          "en.yusufali": [
            "Or who is there that can provide you with Sustenance if He were to withhold His provision? Nay, they obstinately persist in insolent impiety and flight (from the Truth)."
          ],
          "fa.ansarian": [
            "یا کیست آنکه به شما روزی دهد، اگر خدا روزی اش را از شما باز دارد؟ [نه اینکه حقیقت را نمی دانند] بلکه در سرکشی و نفرتِ [از حق سرسختی و] پافشاری می کنند."
          ],
          "fa.ayati": [
            "آيا كيست آن كه به شما روزى دهد اگر او روزى خويش باز دارد؟ نه، در سركشى و دورى از حق لجاج مى‌ورزند."
          ],
          "fa.bahrampour": [
            "آيا كيست آن كه اگر [خدا] روزى خود را از شما باز دارد روزيتان مى‌دهد؟ [ولى آنها پند نمى‌گيرند،] بلكه در سركشى و فرار از حق اصرار مى‌ورزند"
          ],
          "fa.fooladvand": [
            "يا كيست آن كه به شما روزى دهد اگر [خدا] روزى خود را [از شما] باز دارد؟ [نه‌] بلكه در سركشى و نفرت پافشارى كردند."
          ],
          "fa.ghomshei": [
            "آیا آن کیست که اگر خدا از شما رزق خود باز گیرد او روزی به شما تواند داد؟ بلکه کافران دانسته در طغیان و عصیان لجاج ورزند و از حق اعراض می‌کنند."
          ],
          "fa.khorramdel": [
            "یا این که چه کسانیند که اگر خداوند روزی خود را باز دارد بتوانند به شما روزی برسانند؟! اصلاً کافران در سرکشی و گریز پافشاری می‌کنند. [[«عُتُوّ»: سرکشی، طغیان. تکبّر. «نُفُورٍ»: گریز، فرار از حق و حقیقت.]]"
          ],
          "fa.khorramshahi": [
            "یا کیست آنکه اگر [خداوند] روزی‌اش را باز گیرد، شما را روزی دهد؟، حق این است که در گردنکشی و رمیدگی پای می‌فشرند"
          ],
          "fa.makarem": [
            "یا آن کسی که شما را روزی می‌دهد، اگر روزیش را بازدارد (چه کسی می‌تواند نیاز شما را تأمین کند)؟! ولی آنها در سرکشی و فرار از حقیقت لجاجت می‌ورزند!"
          ],
          "fa.moezzi": [
            "آیا آنکه او روزیتان همی‌دهد اگر باز دارد روزی خویش را بلکه خیره‌گی کردند در سرکشی و رمیدنی‌"
          ],
          "fa.mojtabavi": [
            "يا كيست آن كه شما را روزى دهد، اگر او روزى خويش بازگيرد؟ بلكه اينان در سركشى و رميدن [خويش‌] فرورفته‌اند."
          ],
          "fa.sadeqi": [
            "یا کیست آن کس که شما را روزی می‌دهد، اگر (خدا) روزی خود را (از شما) باز دارد؟ (نه!) بلکه در سرکشی و نفرت‌، لجاجت و پافشاری کردند."
          ]
        }
      },
      {
        "index": 5263,
        "local_index": 22,
        "part_type": "Verse",
        "path": "/books/quran:67:22",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:2:1:185:2",
            "/books/al-kafi:8:1:44:43",
            "/books/al-kafi:8:1:44:42",
            "/books/al-kafi:1:4:108:91",
            "/books/al-kafi:1:4:108:88"
          ]
        },
        "text": [
          "أَ فَمَنْ‌ يَمْشِي‌ مُکِبّاً عَلَى‌ وَجْهِهِ‌ أَهْدَى‌ أَمَّنْ‌ يَمْشِي‌ سَوِيّاً عَلَى‌ صِرَاطٍ مُسْتَقِيمٍ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Will he find the way who grovels flat on his face, or he who walks straight on the right path?"
          ],
          "en.ahmedraza": [
            "So is one who walks inverted upon his face more rightly guided, or one who walks upright on the Straight Path?"
          ],
          "en.arberry": [
            "What, is he who walks prone upon his face better guided than he who walks upright on a straight path?"
          ],
          "en.daryabadi": [
            "Is he, then, who goeth about grovelling upon his face better directed, or he who walketh evenly on a straight path?"
          ],
          "en.hilali": [
            "Is he who walks without seeing on his face, more rightly guided, or he who (sees and) walks on a Straight Way (i.e. Islamic Monotheism)."
          ],
          "en.itani": [
            "Is he who walks bent on his own design better guided, or he who walks upright on a straight path?"
          ],
          "en.maududi": [
            "Who is better guided: he who walks grovelling on his face, or he who walks upright on a Straight Path?"
          ],
          "en.mubarakpuri": [
            "Is he who walks prone on his face, more rightly guided, or he who walks upright on a straight path"
          ],
          "en.pickthall": [
            "Is he who goeth groping on his face more rightly guided, or he who walketh upright on a straight road?"
          ],
          "en.qarai": [
            "Is he who walks prone on his face better guided, or he who walks upright on a straight path?"
          ],
          "en.qaribullah": [
            "What, is he who walks, falling upon his face, more guided than he who walks upright on a Straight Path!"
          ],
          "en.sahih": [
            "Then is one who walks fallen on his face better guided or one who walks erect on a straight path?"
          ],
          "en.sarwar": [
            "Can one who walks with his head hanging down be better guided that one who walks with his head upright?"
          ],
          "en.shakir": [
            "What! is he who goes prone upon his face better guided or he who walks upright upon a straight path?"
          ],
          "en.transliteration": [
            "Afaman yamshee mukibban AAal<u>a</u> wajhihi ahd<u>a</u> amman yamshee sawiyyan AAal<u>a</u> <u>s</u>ir<u>at</u>in mustaqeem<b>in</b>"
          ],
          "en.wahiduddin": [
            "Is he who walks grovelling upon his face better guided, or he who walks upright upon a straight path?"
          ],
          "en.yusufali": [
            "Is then one who walks headlong, with his face grovelling, better guided,- or one who walks evenly on a Straight Way?"
          ],
          "fa.ansarian": [
            "آیا کسی که نگونسار و به صورت افتاده حرکت می کند، هدایت یافته تر است یا آنکه راست قامت بر راه راست می رود؟"
          ],
          "fa.ayati": [
            "آيا آن كس كه نگونسار بر روى افتاده راه مى‌رود، هدايت يافته‌تر است يا آن كه بر پاى ايستاده و بر راه راست مى‌رود؟"
          ],
          "fa.bahrampour": [
            "پس آيا آن كه نگونسار بر صورت خويش مى‌رود هدايت يافته‌تر است يا آن كسى كه راست قامت بر راه راست مى‌رود"
          ],
          "fa.fooladvand": [
            "پس آيا آن كس كه نگونسار راه مى‌پيمايد هدايت يافته تر است يا آن كس كه ايستاده بر راه راست مى‌رود؟"
          ],
          "fa.ghomshei": [
            "آیا آن کس که (در کفر و جهالت) سرنگون به رو در افتاده یا آن که با قامت راست به راه راست (ایمان) است کدام بهتر هدایت یافته‌اند؟"
          ],
          "fa.khorramdel": [
            "آیا آن کسی که نگونسار و بر رخساره راه می‌رود راهیاب‌تر است، یا کسی که بر پا ایستاده و درست در راه راست گام بر می‌دارد؟ [[«مُکِبّاً»: نگونسار، بر رو افتاده. «سَوِیّاً»: راست قامت، راست و درست.]]"
          ],
          "fa.khorramshahi": [
            "آیا کسی که به رو در افتاده نگونسار می‌رود، رهیافته‌تر است، یا کسی که استوار بر راه راست ره می‌سپارد؟"
          ],
          "fa.makarem": [
            "آیا کسی که به رو افتاده حرکت می‌کند به هدایت نزدیکتر است یا کسی که راست‌قامت در صراط مستقیم گام برمی‌دارد؟!"
          ],
          "fa.moezzi": [
            "آیا آنکه روان است افتاد به روی خویش رهنمون تر است یا آنکه می‌رود استوار بر راهی راست‌"
          ],
          "fa.mojtabavi": [
            "آيا كسى كه نگونسار بر روى خود مى‌رود راه‌يافته‌تر است يا آن كه راست ايستاده بر راه راست مى‌رود؟"
          ],
          "fa.sadeqi": [
            "آیا پس آن کس که نگونسار بر چهره‌اش راه می‌پیماید راه‌یافته‌تر است، یا آن کس که (راستا) بر راهی بس راست می‌رود؟"
          ]
        }
      },
      {
        "index": 5264,
        "local_index": 23,
        "part_type": "Verse",
        "path": "/books/quran:67:23",
        "text": [
          "قُلْ‌ هُوَ الَّذِي‌ أَنْشَأَکُمْ‌ وَ جَعَلَ‌ لَکُمُ‌ السَّمْعَ‌ وَ الْأَبْصَارَ وَ الْأَفْئِدَةَ قَلِيلاً مَا تَشْکُرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"It is He who raised you and gave you ears and eyes and hearts. How little are the thanks you offer!\""
          ],
          "en.ahmedraza": [
            "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “It is He Who created you, and made ears and eyes and hearts for you; very little thanks do you offer!”"
          ],
          "en.arberry": [
            "Say: 'It is He who produced you, and appointed for you hearing and sight and hearts; little thanks you show!'"
          ],
          "en.daryabadi": [
            "Say thou: He it is who hath brought you forth and hath endowed you with hearing and sights and hearts. Little thanks it is ye give!"
          ],
          "en.hilali": [
            "Say it is He Who has created you, and endowed you with hearing (ears), seeing (eyes), and hearts. Little thanks you give."
          ],
          "en.itani": [
            "Say, “It is He who produced you; and made for you the hearing, and the vision, and the organs. But rarely do you give thanks.”"
          ],
          "en.maududi": [
            "Say: “He it is Who has brought you into being, and has given you hearing and sight, and has given you hearts to think and understand. How seldom do you give thanks!”"
          ],
          "en.mubarakpuri": [
            "Say: \"It is He Who has created you, and endowed you with hearing and seeing, and hearts. Little thanks you give.\""
          ],
          "en.pickthall": [
            "Say (unto them, O Muhammad): He it is who gave you being, and hath assigned unto you ears and eyes and hearts. Small thanks give ye!"
          ],
          "en.qarai": [
            "Say, ‘It is He who created you, and made for you hearing, eyesight, and hearts. Little do you thank.’"
          ],
          "en.qaribullah": [
            "Say: 'It is He who has created you and given to you hearing, sight and hearts but little is it that you thank'"
          ],
          "en.sahih": [
            "Say, \"It is He who has produced you and made for you hearing and vision and hearts; little are you grateful.\""
          ],
          "en.sarwar": [
            "(Muhammad), say, \"It is God who has brought you into being and made ears, eyes, and hearts for you, but you give very little thanks\"."
          ],
          "en.shakir": [
            "Say: He it is Who brought you into being and made for you the ears and the eyes and the hearts: little is it that you give thanks."
          ],
          "en.transliteration": [
            "Qul huwa alla<u>th</u>ee anshaakum wajaAAala lakumu a<b>l</b>ssamAAa wa<b>a</b>lab<u>sa</u>ra wa<b>a</b>lafidata qaleelan m<u>a</u> tashkuroon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Say, \"It is He who brought you into being, and made ears and eyes and hearts for you, yet you are seldom grateful.\""
          ],
          "en.yusufali": [
            "Say: \"It is He Who has created you (and made you grow), and made for you the faculties of hearing, seeing, feeling and understanding: little thanks it is ye give."
          ],
          "fa.ansarian": [
            "بگو: اوست که شما را آفرید و برای شما گوش و دیده و دل قرار داد، ولی اندکی سپاس می گزارید."
          ],
          "fa.ayati": [
            "بگو: اوست كه شما را آفريده است و گوش و چشم و دل داده است. چه اندك سپاس مى‌گزاريد."
          ],
          "fa.bahrampour": [
            "بگو: اوست آن كس كه شما را آفريد و براى شما شنوايى و ديدگان و دل‌ها پديد آورد. [ولى‌] كم سپاس مى‌گزاريد"
          ],
          "fa.fooladvand": [
            "بگو: «اوست آن كس كه شما را پديد آورده و براى شما گوش و ديدگان و دلها آفريده است. چه كم سپاسگزاريد.»"
          ],
          "fa.ghomshei": [
            "بگو: اوست خدایی که شما را از نیستی به هستی آورد و دو گوش و چشم (شنوا و بینا) و دل (هوشیار) به شما عطا کرد (تا شکر نعمتش گویید) حال آنکه بسیار کم از نعم او شکرگزاری می‌کنید."
          ],
          "fa.khorramdel": [
            "خدا کسی است که شما را (از عدم) آفریده است، و برای شما گوش و چشم و دل درست کرده است (که وسیله‌ی کار و سعادت شما هستند. امّا شما این نعمتها را) کمتر سپاسگزاری می‌کنید. [[«قَلِیلاً مَّا تَشْکُرُونَ»: (نگا: اعراف / 10، مؤمنون / 78، سجده / 9).]]"
          ],
          "fa.khorramshahi": [
            "بگو او کسی است که شما را پدید آورده است و برای شما گوش [ها] و چشم [ها] و قلب [ها] آفریده است، چه اندکمایه سپاس می‌گزارید"
          ],
          "fa.makarem": [
            "بگو: «او کسی است که شما را آفرید و برای شما گوش و چشم و قلب قرار داد؛ امّا کمتر سپاسگزاری می‌کنید!»"
          ],
          "fa.moezzi": [
            "بگو او است آنکه پدید آورد شما را و نهاد برای شما گوش و دیدگان و دلها را به کمی سپاس گزارید"
          ],
          "fa.mojtabavi": [
            "بگو: اوست كه شما را آفريد و براى شما گوش و ديدگان و دلها پديد آورد. [ولى‌] اندك سپاس مى‌گزاريد."
          ],
          "fa.sadeqi": [
            "بگو: «اوست آن کسی که شما را پدید آورد، و برای شما گوش‌ها و دیده‌ها و دل‌هایی فروزان آفرید. چه کم سپاسگزارید.»"
          ]
        }
      },
      {
        "index": 5265,
        "local_index": 24,
        "part_type": "Verse",
        "path": "/books/quran:67:24",
        "text": [
          "قُلْ‌ هُوَ الَّذِي‌ ذَرَأَکُمْ‌ فِي‌ الْأَرْضِ‌ وَ إِلَيْهِ‌ تُحْشَرُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"It is He who dispersed you all over the earth, and to Him you will be gathered.\""
          ],
          "en.ahmedraza": [
            "Say, “It is He Who has spread you out in the earth, and towards Him you will be raised.”"
          ],
          "en.arberry": [
            "Say: 'It is He who scattered you in the earth, and unto Him you shall be mustered.'"
          ],
          "en.daryabadi": [
            "Say thou: He it is Who hath spread you over the earth, and Unto Him ye shall be gathered."
          ],
          "en.hilali": [
            "Say: \"It is He Who has created you from the earth, and to Him shall you be gathered (in the Hereafter).\""
          ],
          "en.itani": [
            "Say, “It is He who scattered you on earth, and to Him you will be rounded up.”"
          ],
          "en.maududi": [
            "Say: “Allah it is Who multiplied you in the earth and to Him you will be mustered.”"
          ],
          "en.mubarakpuri": [
            "Say: \"It is He Who has created you on the earth, and to Him shall you be gathered.\""
          ],
          "en.pickthall": [
            "Say: He it is Who multiplieth you in the earth, and unto Whom ye will be gathered."
          ],
          "en.qarai": [
            "Say, ‘It is He who created you on the earth, and toward Him you will be mustered.’"
          ],
          "en.qaribullah": [
            "Say: 'It was He who created you, dispersing you in the earth, and to Him you shall be gathered'"
          ],
          "en.sahih": [
            "Say, \"It is He who has multiplied you throughout the earth, and to Him you will be gathered.\""
          ],
          "en.sarwar": [
            "Say, \"It is God who has settled you on the earth and to Him you will be resurrected\"."
          ],
          "en.shakir": [
            "Say: He it is Who multiplied you in the earth and to Him you shall be gathered."
          ],
          "en.transliteration": [
            "Qul huwa alla<u>th</u>ee <u>th</u>araakum fee alar<u>d</u>i wailayhi tu<u>h</u>sharoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "Say, \"It is He who has scattered you on the earth; and it is to Him that you shall all be gathered [on the Day of Resurrection]."
          ],
          "en.yusufali": [
            "Say: \"It is He Who has multiplied you through the earth, and to Him shall ye be gathered together.\""
          ],
          "fa.ansarian": [
            "بگو: اوست که شما را در زمین آفرید و به سوی او محشور می شوید."
          ],
          "fa.ayati": [
            "بگو: اوست كه شما را در زمين آفريد و در قيامت نزد او گرد آورده مى‌شويد."
          ],
          "fa.bahrampour": [
            "بگو: اوست كه شما را در زمين پراكنده ساخته و به سوى او محشور مى‌شويد"
          ],
          "fa.fooladvand": [
            "بگو: «اوست كه شما را در زمين پراكنده كرده، و به نزد او [ست كه‌] گرد آورده خواهيد شد.»"
          ],
          "fa.ghomshei": [
            "بگو: اوست خدایی که شما را در زمین (از خاک) برانگیخت و (پس از مرگ) باز به سوی او محشور می‌شوید."
          ],
          "fa.khorramdel": [
            "بگو: او کسی است که شما را در زمین تولید و تکثیر کرده و پخش و پراکنده نموده است، و در پیش او گرد آورده می‌شوید. [[«ذَرَأَکُمْ»: شما را پدیدار کرده است. مراد زاد و ولد دادن و افزایش بخشیدن و در زمین پراکندن است (نگا: اعراف / 179).]]"
          ],
          "fa.khorramshahi": [
            "بگو او کسی است که شما را در زمین پدید آورد، و به نزد او محشور می‌شوید"
          ],
          "fa.makarem": [
            "بگو: «او کسی است که شما را در زمین آفرید و به سوی او محشور می‌شوید!»"
          ],
          "fa.moezzi": [
            "بگو او است آنکه آفرید شما را در زمین و بسویش بازگردانیده شوید"
          ],
          "fa.mojtabavi": [
            "بگو: اوست كه شما را در زمين بيافريد و به سوى او برانگيخته و فراهم مى‌شويد."
          ],
          "fa.sadeqi": [
            "بگو: «اوست آن کس که شما را در زمین پدیدار (و) آشکار کرد و تنها فراسوی او(ست که) گرد آورده خواهید شد.»"
          ]
        }
      },
      {
        "index": 5266,
        "local_index": 25,
        "part_type": "Verse",
        "path": "/books/quran:67:25",
        "text": [
          "وَ يَقُولُونَ‌ مَتَى‌ هٰذَا الْوَعْدُ إِنْ‌ کُنْتُمْ‌ صَادِقِينَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "But they say: \"When will this promise come to pass, if what you say is true?\""
          ],
          "en.ahmedraza": [
            "And they say, “When will this promise come, if you are truthful?”"
          ],
          "en.arberry": [
            "They say, 'When shall this promise come to pass, if you speak truly?'"
          ],
          "en.daryabadi": [
            "And they say: when will this promise be fulfilled, if ye say sooth?"
          ],
          "en.hilali": [
            "They say: \"When will this promise (i.e. the Day of Resurrection) come to pass? if you are telling the truth.\""
          ],
          "en.itani": [
            "And they say, “When will this promise be fulfilled, if you are truthful?”"
          ],
          "en.maududi": [
            "They say: “If you are truthful, tell us when will this promise (of the Hereafter) be fulfilled?”"
          ],
          "en.mubarakpuri": [
            "They say: \"When will this promise come to pass, if you are telling the truth\""
          ],
          "en.pickthall": [
            "And they say: When (will) this promise (be fulfilled), if ye are truthful?"
          ],
          "en.qarai": [
            "They say, ‘When will this promise be fulfilled, if you are truthful?’"
          ],
          "en.qaribullah": [
            "They ask: 'When will this promise come, if you speak truthfully'"
          ],
          "en.sahih": [
            "And they say, \"When is this promise, if you should be truthful?\""
          ],
          "en.sarwar": [
            "They say, \"When will this torment take place if what you say is true?\""
          ],
          "en.shakir": [
            "And they say: When shall this threat be (executed) if you are truthful?"
          ],
          "en.transliteration": [
            "Wayaqooloona mat<u>a</u> h<u>atha</u> alwaAAdu in kuntum <u>sa</u>diqeen<b>a</b>"
          ],
          "en.wahiduddin": [
            "They ask, \"When will this promise be fulfilled, if you are truthful?\""
          ],
          "en.yusufali": [
            "They ask: When will this promise be (fulfilled)? - If ye are telling the truth."
          ],
          "fa.ansarian": [
            "و می گویند: اگر راستگویید این وعده وقوع [رستاخیز] کی خواهد بود؟"
          ],
          "fa.ayati": [
            "مى‌گويند: اگر راست مى‌گوييد، اين وعده چه وقت فرا مى‌رسد؟"
          ],
          "fa.bahrampour": [
            "و مى‌گويند: اين وعده كى خواهد بود اگر راست مى‌گوييد"
          ],
          "fa.fooladvand": [
            "و مى‌گويند: «اگر راست مى‌گوييد، اين وعده كى خواهد بود؟»"
          ],
          "fa.ghomshei": [
            "و کافران (به تمسخر) گویند: این وعده قیامت کی خواهد بود اگر شما راست می‌گویید؟"
          ],
          "fa.khorramdel": [
            "می‌گویند: اگر راست می‌گوئید، این وعده‌ای که می‌دهید، کی خواهد بود؟ [[«الْوَعْدُ»: مراد فرا رسیدن عذاب استیصال دنیوی، و یا فرا رسیدن رستاخیز و عذاب شدید اخروی است.]]"
          ],
          "fa.khorramshahi": [
            "و می‌گویند اگر راست می‌گویید، پس کی این وعده فرا می‌رسد؟"
          ],
          "fa.makarem": [
            "آنها می‌گویند: «اگر راست می‌گویید این وعده قیامت چه زمانی است؟!»"
          ],
          "fa.moezzi": [
            "و گویند کی است این وعده اگر هستید راستگویان‌"
          ],
          "fa.mojtabavi": [
            "و مى‌گويند: اين وعده كى خواهد بود، اگر راستگوييد؟"
          ],
          "fa.sadeqi": [
            "و می‌گویند: «اگر (از) راستان بوده‌اید، (تحقق) این وعده کی خواهد بود؟»"
          ]
        }
      },
      {
        "index": 5267,
        "local_index": 26,
        "part_type": "Verse",
        "path": "/books/quran:67:26",
        "text": [
          "قُلْ‌ إِنَّمَا الْعِلْمُ‌ عِنْدَ اللَّهِ‌ وَ إِنَّمَا أَنَا نَذِيرٌ مُبِينٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"God alone has knowledge. My duty is only to warn you clearly.\""
          ],
          "en.ahmedraza": [
            "Proclaim, “Surely Allah has its knowledge; and I am only a Herald of plain warning.”"
          ],
          "en.arberry": [
            "Say: 'The knowledge is with God; I am only a clear warner.'"
          ],
          "en.daryabadi": [
            "Say thou: the knowledge is only with Allah, and but a warner manifest."
          ],
          "en.hilali": [
            "Say (O Muhammad SAW): \"The knowledge (of its exact time) is with Allah only, and I am only a plain warner.\""
          ],
          "en.itani": [
            "Say, “Knowledge is with God, and I am only a clear warner.”"
          ],
          "en.maududi": [
            "Say: “Allah alone knows about that; and I am no more than a plain warner.”"
          ],
          "en.mubarakpuri": [
            "Say: \"The knowledge is with Allah only, and I am only a plain warner.\""
          ],
          "en.pickthall": [
            "Say: The knowledge is with Allah only, and I am but a plain warner;"
          ],
          "en.qarai": [
            "Say, ‘Its knowledge is only with Allah; I am only a manifest warner.’"
          ],
          "en.qaribullah": [
            "Say: 'The knowledge (of that) is with Allah; I am only a clear warner'"
          ],
          "en.sahih": [
            "Say, \"The knowledge is only with Allah, and I am only a clear warner.\""
          ],
          "en.sarwar": [
            "Say, \"God knows best. I am only one who gives warning\"."
          ],
          "en.shakir": [
            "Say: The knowledge (thereof is only with Allah and I am only a plain warner."
          ],
          "en.transliteration": [
            "Qul innam<u>a</u> alAAilmu AAinda All<u>a</u>hi wainnam<u>a</u> an<u>a</u> na<u>th</u>eerun mubeen<b>un</b>"
          ],
          "en.wahiduddin": [
            "Say, \"God alone has knowledge of that; and I am only a plain warner.\""
          ],
          "en.yusufali": [
            "Say: \"As to the knowledge of the time, it is with Allah alone: I am (sent) only to warn plainly in public.\""
          ],
          "fa.ansarian": [
            "بگو: دانش و آگاهی [این حقیقت] فقط نزد خداست و من تنها بیم دهنده ای آشکارم."
          ],
          "fa.ayati": [
            "بگو: علم آن نزد خداست و من بيم‌دهنده‌اى آشكارم."
          ],
          "fa.bahrampour": [
            "بگو: علم آن فقط نزد خداست و من صرفا هشداردهنده‌اى آشكارم"
          ],
          "fa.fooladvand": [
            "بگو: «علم [آن‌] فقط پيش خداست و من صرفاً هشدار دهنده‌اى آشكارم.»"
          ],
          "fa.ghomshei": [
            "بگو: علم آن تنها نزد خداست و من منحصرا وظیفه‌ام این است که شما را (از عذاب حق) بترسانم."
          ],
          "fa.khorramdel": [
            "بگو: اطّلاع و آگاهی (از فرا رسیدن مجازات دنیوی و یا وقوع قیامت) متعلّق به خدا است و بس. من فقط و فقط بیم دهنده‌ی آشکاری هستم. [[«نَذِیرٌ مُّبِینٌ»: بیم دهنده‌ای که آشکارا بیم می‌دهد و به صراحت از عذاب خدا سخن می‌گوید.]]"
          ],
          "fa.khorramshahi": [
            "بگو آگاهی از آن فقط نزد خداوند است، و من فقط هشداردهنده‌ای آشکارم‌"
          ],
          "fa.makarem": [
            "بگو: «علم آن تنها نزد خداست؛ و من فقط بیم‌دهنده آشکاری هستم!»"
          ],
          "fa.moezzi": [
            "بگو جز این نیست که علم نزد خدا است و جز این نیست که منم ترساننده آشکار"
          ],
          "fa.mojtabavi": [
            "بگو: همانا دانش [آن‌] نزد خداست و من بيم‌كننده‌اى آشكارم و بس."
          ],
          "fa.sadeqi": [
            "بگو: «(تمامی) علم تنها نزد خداست و من تنها هشداردهنده‌ای روشنگرم.»"
          ]
        }
      },
      {
        "index": 5268,
        "local_index": 27,
        "part_type": "Verse",
        "path": "/books/quran:67:27",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:8:1:44:1",
            "/books/al-kafi:8:1:44:43",
            "/books/al-kafi:8:1:44:42",
            "/books/al-kafi:1:4:108:68",
            "/books/al-kafi:1:4:108:67"
          ]
        },
        "text": [
          "فَلَمَّا رَأَوْهُ‌ زُلْفَةً سِيئَتْ‌ وُجُوهُ‌ الَّذِينَ‌ کَفَرُوا وَ قِيلَ‌ هٰذَا الَّذِي‌ کُنْتُمْ‌ بِهِ‌ تَدَّعُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "When they realise it has come upon them, distraught will be the faces of unbelievers. They will be told: \"This is what you asked for.\""
          ],
          "en.ahmedraza": [
            "So when they will see it close, the faces of the disbelievers will become ghastly, and it will be declared, “This is what you were demanding.”"
          ],
          "en.arberry": [
            "Then, when they see it nigh at hand, the faces of the unbelievers will be vexed, and it will be said, 'This is what you were promised.'"
          ],
          "en.daryabadi": [
            "But when they will behold it proximating sad will be the countenances of those who disbelieve, and it will be said: this is that which ye have been calling for."
          ],
          "en.hilali": [
            "But when they will see it (the torment on the Day of Resurrection) approaching, the faces of those who disbelieve will be different (black, sad, and in grieve), and it will be said (to them): \"This is (the promise) which you were calling for!\""
          ],
          "en.itani": [
            "But when they see it approaching, the faces of those who disbelieved will turn gloomy, and it will be said, “This is what you used to call for.”"
          ],
          "en.maududi": [
            "When they will see it near at hand, the faces of all those who had denied it will be distraught, and then they will be told: “This is the doom which you used to ask for.”"
          ],
          "en.mubarakpuri": [
            "But when they will see it approaching, the faces of those who disbelieve will be sad and grievous, and it will be said: \"This is what you were calling for!\""
          ],
          "en.pickthall": [
            "But when they see it nigh, the faces of those who disbelieve will be awry, and it will be said (unto them): This is that for which ye used to call."
          ],
          "en.qarai": [
            "When they see it brought near, the countenances of the faithless will be contorted, and [they will be] told, ‘This is what you were asking for!’"
          ],
          "en.qaribullah": [
            "Then, when they see it drawing near, the faces of the unbelievers will be blackened, and it is said: 'This is what you were promised'"
          ],
          "en.sahih": [
            "But when they see it approaching, the faces of those who disbelieve will be distressed, and it will be said, \"This is that for which you used to call.\""
          ],
          "en.sarwar": [
            "When they see the torment approaching, the faces of the disbelievers will blacken and they will be told, \"This is what you wanted to (experience)\"."
          ],
          "en.shakir": [
            "But when they shall see it nigh, the faces of those who disbelieve shall be sorry, and it shall be said; This is that which you used to call for."
          ],
          "en.transliteration": [
            "Falamm<u>a</u> raawhu zulfatan seeat wujoohu alla<u>th</u>eena kafaroo waqeela h<u>atha</u> alla<u>th</u>ee kuntum bihi taddaAAoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "But when they see it drawing near, the faces of those who deny the truth will turn gloomy and they will be told, \"This is what you were calling for.\""
          ],
          "en.yusufali": [
            "At length, when they see it close at hand, grieved will be the faces of the Unbelievers, and it will be said (to them): \"This is (the promise fulfilled), which ye were calling for!\""
          ],
          "fa.ansarian": [
            "پس زمانی که آن [وعده داده شده] را از نزدیک ببینند، چهره کافران درهم و زشت گردد [و به آنان گویند:] این است همان چیزی که آن را [از روی مسخره] می خواستید."
          ],
          "fa.ayati": [
            "كافران چون نزديكش بنگرند، چهره‌شان گرفته شود. و به آنها گفته مى‌شود: اين است آنچه باطلش مى‌خوانديد."
          ],
          "fa.bahrampour": [
            "و چون آن [لحظه موعود] را نزديك ببينند، چهره‌هاى كسانى كه كافر شده‌اند درهم رود و گفته شود: اين همان چيزى است كه طلب مى‌كرديد"
          ],
          "fa.fooladvand": [
            "و آنگاه كه آن [لحظه موعود] را نزديك ببينند، چهره‌هاى كسانى كه كافر شده‌اند در هم رود، و گفته شود: «اين است همان چيزى كه آن را فرا مى‌خوانديد»"
          ],
          "fa.ghomshei": [
            "که چون کافران آن عذاب سخت را نزدیک خود به چشم مشاهده کنند رخسار آنها (از خوف) زشت و سیاه شود و به آنها گویند: این همان عذابی است که جدّا درخواست می‌کردید."
          ],
          "fa.khorramdel": [
            "هنگامی که این وعده‌ی الهی را از نزدیک مشاهده کردند، چهره‌های کافران درهم و زشت می‌گردد، و بدیشان گفته می‌شود: این همان چیزی است که خود می‌خواستید (و در فرا رسیدن و دیدن آن شتاب می‌ورزیدید). [[«زُلْفَةً»: نزدیک. قریب. مصدر است و مراد اسم فاعل. «سِیئَتْ»: (نگا: هود / 77، عنکبوت / 23). «تَدَّعُونَ»: با زور و از روی استهزاء درخواست وقوع فوری آن را داشتید (نگا: ص / 16، شوری / 18).]]"
          ],
          "fa.khorramshahi": [
            "و چون آن را نزدیک بینند، چهره‌های کافران اندوهگین شود، و [به آنان‌] گفته شود، این همان است که [در دنیا از ما به شتاب‌] می‌طلبیدید"
          ],
          "fa.makarem": [
            "هنگامی که آن (وعده الهی) را از نزدیک می‌بینند، صورت کافران زشت و سیاه می‌گردد، و به آنها گفته می‌شود: «این همان چیزی است که تقاضای آن را داشتید»!"
          ],
          "fa.moezzi": [
            "تا هنگامی که دیدندش جایگزین (یا نزدیک) دژم گشت چهره‌های آنان که کفر ورزیدند و گفته شد این است آنچه بودیدش به سختی می‌خواستید"
          ],
          "fa.mojtabavi": [
            "پس چون آن [وعده‌] را نزديك‌شده بينند، روى آنان كه كافر شدند بد- زشت و تاريك و ناخوش- گردد و گفته شود: اين است آنچه مى‌خواستيد- مى طلبيديد-."
          ],
          "fa.sadeqi": [
            "پس آن‌گاه که آن (لحظه‌ی موعود) را نزدیک دیدند، چهره‌های آنانی که کافر شدند، بسی به نابسامانی در هم رفت و گفته شد: «این همان چیزی است که آن را فرا می‌خوانده‌اید.»"
          ]
        }
      },
      {
        "index": 5269,
        "local_index": 28,
        "part_type": "Verse",
        "path": "/books/quran:67:28",
        "text": [
          "قُلْ‌ أَ رَأَيْتُمْ‌ إِنْ‌ أَهْلَکَنِيَ‌ اللَّهُ‌ وَ مَنْ‌ مَعِيَ‌ أَوْ رَحِمَنَا فَمَنْ‌ يُجِيرُ الْکَافِرِينَ‌ مِنْ‌ عَذَابٍ‌ أَلِيمٍ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"Just think: If God destroys me and those with me, or is benevolent to us, who will then protect the unbelievers from a painful doom?\""
          ],
          "en.ahmedraza": [
            "Say (O dear Prophet Mohammed – peace and blessings be upon him), “What is your opinion –Allah may either destroy me and those with me, or have mercy on us – so who is such that will protect the disbelievers from the painful punishment?”"
          ],
          "en.arberry": [
            "Say: 'What think you? If God destroys me and those with me, or has mercy on us, then who will protect the unbelievers from a painful chastisement?'"
          ],
          "en.daryabadi": [
            "Say thou: bethink ye if Allah destroy me and those with me; or have mercy on us, who will protect the infidels from a torment afflictive?"
          ],
          "en.hilali": [
            "Say (O Muhammad SAW): \"Tell me! If Allah destroys me, and those with me, or He bestows His Mercy on us, - who can save the disbelievers from a painful torment?\""
          ],
          "en.itani": [
            "Say, “Have you considered? Should God make me perish, and those with me; or else He bestows His mercy on us; who will protect the disbelievers from an agonizing torment?”"
          ],
          "en.maududi": [
            "Say to them: “Did you ever consider: whether Allah destroys me and those that are with me, or shows mercy to us, who can protect the unbelievers from a grievous chastisement?”"
          ],
          "en.mubarakpuri": [
            "Say: \"Tell me! If Allah destroys me, and those with me, or He bestows His mercy on us - who can save the disbelievers from a painful torment\""
          ],
          "en.pickthall": [
            "Say (O Muhammad): Have ye thought: Whether Allah causeth me (Muhammad) and those with me to perish or hath mercy on us, still, who will protect the disbelievers from a painful doom?"
          ],
          "en.qarai": [
            "Say, ‘Tell me, whether Allah destroys me and those who are with me, or He has mercy on us, who will shelter the faithless from a painful punishment?’"
          ],
          "en.qaribullah": [
            "Say: 'What do you think, if Allah destroys me and those with me, or has mercy upon us, who then will protect the unbelievers from the painful punishment'"
          ],
          "en.sahih": [
            "Say, [O Muhammad], \"Have you considered: whether Allah should cause my death and those with me or have mercy upon us, who can protect the disbelievers from a painful punishment?\""
          ],
          "en.sarwar": [
            "(Muhammad), say, \"Have you not considered that regardless whether God forgives me and my followers or grants us mercy, but who will protect the disbelievers from a painful torment?"
          ],
          "en.shakir": [
            "Say: Have you considered if Allah should destroy me and those with me-- rather He will have mercy on us; yet who will protect the unbelievers from a painful punishment?"
          ],
          "en.transliteration": [
            "Qul araaytum in ahlakaniya All<u>a</u>hu waman maAAiya aw ra<u>h</u>iman<u>a</u> faman yujeeru alk<u>a</u>fireena min AAa<u>tha</u>bin aleem<b>in</b>"
          ],
          "en.wahiduddin": [
            "Say, \"Have you thought: if God destroys me and those who are with me, or treats us mercifully, then who will protect those who deny the truth from a painful chastisement?\""
          ],
          "en.yusufali": [
            "Say: \"See ye?- If Allah were to destroy me, and those with me, or if He bestows His Mercy on us,- yet who can deliver the Unbelievers from a grievous Penalty?\""
          ],
          "fa.ansarian": [
            "بگو: به من خبر دهید اگر خدا من را و هر که را با من است هلاک کند، یا مورد رحمت قرار دهد، پس چه کسی کافران را از عذاب دردناک پناه خواهد داد؟"
          ],
          "fa.ayati": [
            "بگو: گيرم كه خدا مرا و همراهانم را هلاك كند يا بر ما رحمت آورد، چه كسى كافران را از عذاب دردآور مى‌رهاند؟"
          ],
          "fa.bahrampour": [
            "بگو: به من خبر دهيد، اگر خدا مرا و هر كه را با من است هلاك كند يا ما را مورد رحمت قرار دهد، چه كسى كافران را از عذابى دردناك پناه مى‌دهد"
          ],
          "fa.fooladvand": [
            "بگو: «به من خبر دهيد، اگر خدا مرا و هر كه را با من است هلاك كند يا ما را مورد رحمت قرار دهد، چه كسى كافران را از عذابى پر درد پناه خواهد داد؟»"
          ],
          "fa.ghomshei": [
            "بگو: چه تصور می‌کنید؟ اگر خدا من و مؤمنانی که با منند همه را هلاک کند یا لطف و رحمت فرماید آیا آنان که کافرند چه کسی از عذاب دردناک (دوزخ) نجاتشان خواهد داد؟"
          ],
          "fa.khorramdel": [
            "بگو به من خبردهید اگر خداوند مرا و تمام کسانی را که با من هستند (و ایمان آورده‌اند) هلاک سازد، و یا به ما رحم نماید (و ما را فعلاً نکشد، به هر حال ما چه حال بمیریم و چه در آینده، اهل نجات هستیم). امّا چه کسی کافران را از عذاب دردناک (دوزخ می‌رهاند و) در پناه خود می‌دارد؟ [[«أَرَأَیْتُمْ»: (نگا: انعام / 46، یونس / 50 و 59، هود / 28). «إِنْ أَهْلَکَنِی»: جواب (إنْ) جمله «فَمَن یَأْتِیکُم بِمَآءٍ مَّعِینٍ» است. «یُجِیرُ»: پناه می‌دهد.]]"
          ],
          "fa.khorramshahi": [
            "بگو ملاحظه کنید، اگر خداوند مرا و همراهانم را نابود کند، یا بر ما رحمت آورد، پس کیست که کافران را از عذابی دردناک پناه دهد؟"
          ],
          "fa.makarem": [
            "بگو: «به من خبر دهید اگر خداوند مرا و تمام کسانی را که با من هستند هلاک کند، یا مورد ترحّم قرار دهد، چه کسی کافران را از عذاب دردناک پناه می‌دهد؟!»"
          ],
          "fa.moezzi": [
            "بگو آیا دیدید اگر نابود سازدم خدا و آنکو با من است یا رحم کند بر ما که پناه دهد کافران را از عذابی دردناک‌"
          ],
          "fa.mojtabavi": [
            "بگو: مرا گوييد كه اگر خداى مرا و كسانى را كه با من‌اند هلاك كند يا بر ما مِهر و بخشايش آرد، چه كسى [شما] كافران را از عذاب دردناك پناه مى دهد؟"
          ],
          "fa.sadeqi": [
            "بگو: «آیا دیدید، اگر خدا مرا و هر که را با من است هلاک کند، یا ما را مورد رحمت قرار دهد، پس چه کسی کافران را از عذابی پردرد (فراسوی خود) پناه خواهد داد؟»"
          ]
        }
      },
      {
        "index": 5270,
        "local_index": 29,
        "part_type": "Verse",
        "path": "/books/quran:67:29",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:1:4:108:44",
            "/books/al-kafi:1:4:108:45"
          ]
        },
        "text": [
          "قُلْ‌ هُوَ الرَّحْمٰنُ‌ آمَنَّا بِهِ‌ وَ عَلَيْهِ‌ تَوَکَّلْنَا فَسَتَعْلَمُونَ‌ مَنْ‌ هُوَ فِي‌ ضَلاَلٍ‌ مُبِينٍ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"He is the benevolent; in Him do we believe, and in Him do we place our trust. You will now realise who is in manifest error.\""
          ],
          "en.ahmedraza": [
            "Proclaim, “He only is the Most Gracious – we have accepted faith in Him and have relied only upon Him; so you will now realise who is in open error.”"
          ],
          "en.arberry": [
            "Say: 'He is the All-merciful. We believe in Him, and in Him we put all our trust. Assuredly, you will soon, know who is in manifest error."
          ],
          "en.daryabadi": [
            "Say thou: He is the Compassionate; in Him we have believed, and in Him we have put our trust. -And anon ye will know who it is that is in error manifest."
          ],
          "en.hilali": [
            "Say: \"He is the Most Beneficent (Allah), in Him we believe, and in Him we put our trust. So you will come to know who is it that is in manifest error.\""
          ],
          "en.itani": [
            "Say, “He is the Compassionate. We have faith in Him, and in Him we trust. Soon you will know who is in evident error.”"
          ],
          "en.maududi": [
            "Say to them: “He is Merciful, and it is in Him that we believe, and it is in Him that we put all our trust. Soon will you know who is in manifest error.”"
          ],
          "en.mubarakpuri": [
            "Say: \"He is the Most Gracious, in Him we believe, and upon Him we rely. So, you will come to know who it is that is in manifest error.\""
          ],
          "en.pickthall": [
            "Say: He is the Beneficent. In Him we believe and in Him we put our trust. And ye will soon know who it is that is in error manifest."
          ],
          "en.qarai": [
            "Say, ‘He is the All-beneficent; we have faith in Him, and in Him do we trust. Soon you will know who is in manifest error.’"
          ],
          "en.qaribullah": [
            "Say: 'He is the Merciful. In Him we believe and in Him we put all our trust. Indeed, you shall soon know who is in clear error'"
          ],
          "en.sahih": [
            "Say, \"He is the Most Merciful; we have believed in Him, and upon Him we have relied. And you will [come to] know who it is that is in clear error.\""
          ],
          "en.sarwar": [
            "Say, \"He is the Beneficent One in whom we have faith and trust. You will soon know who is in manifest error\"."
          ],
          "en.shakir": [
            "Say: He is the Beneficent Allah, we believe in Him and on Him do we rely, so you shall come to know who it is that is in clear error."
          ],
          "en.transliteration": [
            "Qul huwa a<b>l</b>rra<u>h</u>m<u>a</u>nu <u>a</u>mann<u>a</u> bihi waAAalayhi tawakkaln<u>a</u> fasataAAlamoona man huwa fee <u>d</u>al<u>a</u>lin mubeen<b>in</b>"
          ],
          "en.wahiduddin": [
            "Say, \"He is the Most Gracious: we believe in Him and we put our trust in Him. You will soon come to know who is in evident error.\""
          ],
          "en.yusufali": [
            "Say: \"He is (Allah) Most Gracious: We have believed in Him, and on Him have we put our trust: So, soon will ye know which (of us) it is that is in manifest error.\""
          ],
          "fa.ansarian": [
            "بگو: اوست رحمان، به او ایمان آوردیم، و بر او توکل کردیم، پس به زودی خواهید دانست چه کسی در گمراهی آشکار است."
          ],
          "fa.ayati": [
            "بگو: او خداى رحمان است. به او ايمان آورديم و بر او توكل كرديم. و زودا كه خواهيد دانست چه كسى در گمراهى آشكار است."
          ],
          "fa.bahrampour": [
            "بگو: او [خداى‌] رحمان است به او ايمان آورديم و تنها بر او توكل كرديم. پس به زودى خواهيد دانست چه كسى در گمراهى آشكار است"
          ],
          "fa.fooladvand": [
            "بگو: «اوست خداى بخشايشگر، به او ايمان آورديم، و بر او توكل كرديم. و به زودى خواهيد دانست چه كسى است كه خود در گمراهى آشكارى است.»"
          ],
          "fa.ghomshei": [
            "بگو: (آن که من شما را به سوی او می‌خوانم) او خدای مهربان است که ما به او ایمان آورده و بر او توکل کردیم و به زودی شما را معلوم شود کیست که آشکارا به ضلالت و گمراهی است؟"
          ],
          "fa.khorramdel": [
            "بگو: خدا مهربان است و بدو ایمان آورده‌ایم و بدو پشت بسته‌ایم، لذا خواهید دانست که چه کسی (از ما و شما) در گمراهی و سرگشتگی آشکاری است. [[«آمَنَّا بِهِ وَ عَلَیْهِ تَوَکَّلْنَا»: این بخش اشاره ضمنی دارد به این که: ما به خدا ایمان آورده‌ایم، ولی شما بدو ایمان نیاورده‌اید، و ما بدو پشت بسته‌ایم، امّا شما به بتها و چیزهای دیگری پشت بسته‌اید و دلخوش هستید.]]"
          ],
          "fa.khorramshahi": [
            "بگو او خداوند رحمان است، که به او ایمان آورده‌ایم و بر او توکل کرده‌ایم، زودا بدانید که چه کسی در گمراهی آشکار است‌"
          ],
          "fa.makarem": [
            "بگو: «او خداوند رحمان است، ما به او ایمان آورده و بر او توکّل کرده‌ایم؛ و بزودی می‌دانید چه کسی در گمراهی آشکار است!»"
          ],
          "fa.moezzi": [
            "بگو او است خدای مهربان ایمان آوردیم بدو و بر او توکل کردیم زود است بدانید کیست آنکه او است در گمراهی آشکار"
          ],
          "fa.mojtabavi": [
            "بگو: او خداى رحمان است، به او ايمان آورديم و بر او توكل كرديم. پس بزودى خواهيد دانست چه كسى در گمراهى آشكار است."
          ],
          "fa.sadeqi": [
            "بگو: «او تنها رحمتگر بر آفریدگان است. به او ایمان آوردیم و تنها بر او توکل کردیم، پس به زودی خواهید دانست چه کسی است که خود در گمراهی آشکارگری است.»"
          ]
        }
      },
      {
        "index": 5271,
        "local_index": 30,
        "part_type": "Verse",
        "path": "/books/quran:67:30",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:1:4:80:14"
          ]
        },
        "text": [
          "قُلْ‌ أَ رَأَيْتُمْ‌ إِنْ‌ أَصْبَحَ‌ مَاؤُکُمْ‌ غَوْراً فَمَنْ‌ يَأْتِيکُمْ‌ بِمَاءٍ مَعِينٍ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "Say: \"Just think: If your water were to dry up in the morning who will bring you water from a fresh, flowing stream?\""
          ],
          "en.ahmedraza": [
            "Say, “What is your opinion – if in the morning all your water were to sink into the earth, then who is such who can bring you water flowing before you?”"
          ],
          "en.arberry": [
            "Say: 'What think you? If in the morning your water should have vanished into the earth, then who would bring you running water?'"
          ],
          "en.daryabadi": [
            "Say thou: bethink ye, were your water to be sunk away, who then could bring you water welling-up?"
          ],
          "en.hilali": [
            "Say (O Muhammad SAW): \"Tell me! If (all) your water were to be sunk away, who then can supply you with flowing (spring) water?\""
          ],
          "en.itani": [
            "Say, “Have you considered? If your water drains away, who will bring you pure running water?”"
          ],
          "en.maududi": [
            "Say to them: “Did you even consider: if all the water that you have (in the wells) were to sink down into the depths of the earth, who will produce for you clear, flowing water?”"
          ],
          "en.mubarakpuri": [
            "Say: \"Tell me! If (all) your water were to sink away, who then can supply you with flowing water\""
          ],
          "en.pickthall": [
            "Say: Have ye thought: If (all) your water were to disappear into the earth, who then could bring you gushing water?"
          ],
          "en.qarai": [
            "Say, ‘Tell me, should your water sink down [into the ground], who will bring you running water?’"
          ],
          "en.qaribullah": [
            "Say: 'What do you think. If your water should sink into the earth in the morning, who then would bring you running water'"
          ],
          "en.sahih": [
            "Say, \"Have you considered: if your water was to become sunken [into the earth], then who could bring you flowing water?\""
          ],
          "en.sarwar": [
            "Say, \"Have you not thought that if your water was to dry up, who would bring you water from the spring?\""
          ],
          "en.shakir": [
            "Say: Have you considered if your water should go down, who is it then that will bring you flowing water?"
          ],
          "en.transliteration": [
            "Qul araaytum in a<u>s</u>ba<u>h</u>a m<u>a</u>okum ghawran faman yateekum bim<u>a</u>in maAAeen<b>in</b>"
          ],
          "en.wahiduddin": [
            "Say, \"Have you considered if your water were to sink  into the ground, who could then bring you flowing water?\""
          ],
          "en.yusufali": [
            "Say: \"See ye?- If your stream be some morning lost (in the underground earth), who then can supply you with clear-flowing water?\""
          ],
          "fa.ansarian": [
            "بگو: به من خبر دهید اگر آب مورد بهره برداری شما [چون آب رودها، چشمه ها، سدها و چاه ها] در زمین فرو رود [تا آنجا که از دسترس شما خارج گردد] پس کیست که برایتان آب روان و گوارا بیاورد؟!"
          ],
          "fa.ayati": [
            "بگو: اگر آبتان در زمين فرو رود، چه كسى شما را آب روان خواهد داد؟"
          ],
          "fa.bahrampour": [
            "بگو: به من خبر دهيد، اگر آب شما [در زمين‌] فرو رود، چه كسى آب روان برايتان خواهد آورد"
          ],
          "fa.fooladvand": [
            "بگو: «به من خبر دهيد، اگر آب [آشاميدنى‌] شما [به زمين‌] فرو رود، چه كسى آب روان برايتان خواهد آورد؟»"
          ],
          "fa.ghomshei": [
            "بگو: چه تصوّر می‌کنید؟ اگر آب (که مایه زندگانی) شما (است) همه به زمین فرو رود (جز خدا) کیست که باز آب روان و گوارا برای شما پدید آرد؟"
          ],
          "fa.khorramdel": [
            "بگو: مرا خبر دهید، اگر آبهای (مورد استفاده‌ی) شما به زمین فرو رود، چه کسی می‌تواند آب روان در دسترس شما مردمان قرار دهد؟! [[«غَوْراً»: فرو رفتن در زمین. مصدر است و مراد اسم فاعل، یعنی غائر است و به معنی فرو رونده است (نگا: کهف / 41). «مَعِینٍ»: جاری، روان (نگا: مؤمنون / 50، صافّات / 45، واقعه / 18).]]"
          ],
          "fa.khorramshahi": [
            "بگو ملاحظه کنید، اگر آب شما در زمین فرو رود [و ناپدید گردد] چه کسی برای شما آب روان می‌آورد؟"
          ],
          "fa.makarem": [
            "بگو: «به من خبر دهید اگر آبهای (سرزمین) شما در زمین فرو رود، چه کسی می‌تواند آب جاری و گوارا در دسترس شما قرار دهد؟!»"
          ],
          "fa.moezzi": [
            "بگو آیا دیدید اگر بامداد کند آب شما فرو رفته کیست که آورد شما را به آبی نمایان‌"
          ],
          "fa.mojtabavi": [
            "بگو: مرا گوييد كه اگر آب شما [به زمين‌] فرو شود، چه كسى شما را آب روان مى‌آورد؟"
          ],
          "fa.sadeqi": [
            "بگو: «آیا دیدید اگر آبِ شما، فروکشد، پس چه کس برایتان آبی جاری خواهد آورد؟»"
          ]
        }
      }
    ]
  },
  "index": "quran:67",
  "kind": "verse_list"
}