{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 71"
        },
        "path": "/books/quran:71",
        "titles": {
          "ar": "نوح",
          "en": "Noah",
          "ent": "Nooh"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 71,
    "local_index": 71,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 72"
        },
        "path": "/books/quran:72",
        "titles": {
          "ar": "الجن",
          "en": "The Jinn",
          "ent": "Al-Jinn"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 70"
        },
        "path": "/books/quran:70",
        "titles": {
          "ar": "المعارج",
          "en": "The Ascending Stairways",
          "ent": "Al-Ma'aarij"
        }
      },
      "up": {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      }
    },
    "order": 71,
    "part_type": "Chapter",
    "path": "/books/quran:71",
    "reveal_type": "Meccan",
    "rukus": 2,
    "titles": {
      "ar": "نوح",
      "en": "Noah",
      "ent": "Nooh"
    },
    "verse_count": 28,
    "verse_start_index": 5419,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 5420,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:71:1",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:5:2:159:49"
          ]
        },
        "text": [
          "إِنَّا أَرْسَلْنَا نُوحاً إِلَى‌ قَوْمِهِ‌ أَنْ‌ أَنْذِرْ قَوْمَکَ‌ مِنْ‌ قَبْلِ‌ أَنْ‌ يَأْتِيَهُمْ‌ عَذَابٌ‌ أَلِيمٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "SENT NOAH to his people to warn them before the painful punishment came upon them."
          ],
          "en.ahmedraza": [
            "Indeed We sent Nooh towards his people saying that, “Warn your people before the painful punishment comes upon them.”"
          ],
          "en.arberry": [
            "We sent Noah to his people, saying, 'Warn thy people, ere there come on them a painful chastisement.'"
          ],
          "en.daryabadi": [
            "Verily We! We sent Nuh Unto his people saying: warn thy people ere there come Unto them torment afflictive."
          ],
          "en.hilali": [
            "Verily, We sent Nuh (Noah) to his people (Saying): \"Warn your people before there comes to them a painful torment.\""
          ],
          "en.itani": [
            "We sent Noah to his people: “Warn your people before there comes upon them a painful punishment.”"
          ],
          "en.maududi": [
            "We sent Noah to his people (and directed him): “Warn your people before a grievous chastisement comes upon them.”"
          ],
          "en.mubarakpuri": [
            "Verily, We sent Nuh to his people (saying): \"Warn your people before there comes to them a painful torment.\""
          ],
          "en.pickthall": [
            "Lo! We sent Noah unto his people (saying): Warn thy people ere the painful doom come unto them."
          ],
          "en.qarai": [
            "Indeed We sent Noah to his people, [saying,] ‘Warn your people before a painful punishment overtakes them.’"
          ],
          "en.qaribullah": [
            "We sent Noah to his nation, saying: 'Give warning to your nation before a painful punishment overtakes them'"
          ],
          "en.sahih": [
            "Indeed, We sent Noah to his people, [saying], \"Warn your people before there comes to them a painful punishment.\""
          ],
          "en.sarwar": [
            "We sent Noah to his people telling him, \"Warn your people before a painful torment approaches them\"."
          ],
          "en.shakir": [
            "Surely We sent Nuh to his people, saying: Warn your people before there come upon them a painful chastisement."
          ],
          "en.transliteration": [
            "Inn<u>a</u> arsaln<u>a</u> noo<u>h</u>an il<u>a</u> qawmihi an an<u>th</u>ir qawmaka min qabli an yatiyahum AAa<u>tha</u>bun aleem<b>un</b>"
          ],
          "en.wahiduddin": [
            "We sent Noah forth to his people, saying, \"Warn your people before there comes upon them a grievous punishment.\""
          ],
          "en.yusufali": [
            "We sent Noah to his People (with the Command): \"Do thou warn thy People before there comes to them a grievous Penalty.\""
          ],
          "fa.ansarian": [
            "ما نوح را به سوی قومش فرستادیم که قوم خود را پیش از آنکه عذابی دردناکبه آنان رسد، بیم ده."
          ],
          "fa.ayati": [
            "ما نوح را به سوى قومش فرستاديم كه: قوم خود را پيش از آنكه عذابى دردآور بر سرشان فرودآيد، بيم ده."
          ],
          "fa.bahrampour": [
            "همانا ما نوح را به سوى قومش فرستاديم كه قومت را هشدار ده پيش از آن كه عذابى دردناك به سراغشان آيد"
          ],
          "fa.fooladvand": [
            "ما نوح را به سوى قومش فرستاديم كه: «قومت را، پيش از آنكه عذابى دردناك به آنان رسد، هشدار ده.»"
          ],
          "fa.ghomshei": [
            "ما نوح را به سوی قومش (به رسالت) فرستادیم که قوم خود را (از قهر خدا) به اندرز و پند بترسان از آنکه بر آنان عذاب دردناک فرا رسد."
          ],
          "fa.khorramdel": [
            "ما نوح را به سوی قومش فرستادیم (و بدو دستور دادیم) که قوم خود را (از عذاب خدا) بترسان، پیش از آن که عذاب دردناکی به سراغ ایشان بیاید. [[«عَذَابٌ أَلِیمٌ»: این عذاب دردناک ممکن است عذاب دنیا باشد یا عذاب آخرت، یا هر دو.]]"
          ],
          "fa.khorramshahi": [
            "ما نوح را به سوی قومش فرستاده‌ایم که قومت را پیش از آنکه عذابی دردناک بر سرشان بیاید، هشدار ده‌"
          ],
          "fa.makarem": [
            "ما نوح را به سوی قومش فرستادیم و گفتیم: «قوم خود را انذار کن پیش از آنکه عذاب دردناک به سراغشان آید!»"
          ],
          "fa.moezzi": [
            "همانا فرستادیم نوح را بسوی قومش که بترسان قومت را پیش از آنکه بیامدشان عذابی دردناک‌"
          ],
          "fa.mojtabavi": [
            "همانا نوح را به سوى قومش فرستاديم كه قوم خود را بيم ده پيش از آنكه عذابى دردناك بديشان آيد."
          ],
          "fa.sadeqi": [
            "ما نوح را به‌راستی سوی قومش فرستادیم که: «قومت را پیش از آنکه عذابی دردناک به آنان در رسد، هشدار ده.»"
          ]
        }
      },
      {
        "index": 5421,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:71:2",
        "text": [
          "قَالَ‌ يَا قَوْمِ‌ إِنِّي‌ لَکُمْ‌ نَذِيرٌ مُبِينٌ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "He said: \"O my people, I warn you clearly"
          ],
          "en.ahmedraza": [
            "He said, “O my people! I am indeed a Herald of clear warnings to you.”"
          ],
          "en.arberry": [
            "He said, 'O my people, I am unto you a clear warner,"
          ],
          "en.daryabadi": [
            "He said: O my people! verily I am Unto you a warner manifest."
          ],
          "en.hilali": [
            "He said: \"O my people! Verily, I am a plain warner to you,"
          ],
          "en.itani": [
            "He said, “O my people, I am to you a clear warner."
          ],
          "en.maududi": [
            "Noah said: “My people, I have certainly been sent as a clear warner to you,"
          ],
          "en.mubarakpuri": [
            "He said: \"O my people! Verily, I am a plain warner to you,\""
          ],
          "en.pickthall": [
            "He said: O my people! Lo! I am a plain warner unto you"
          ],
          "en.qarai": [
            "He said, ‘O my people! Indeed, I am a manifest warner to you."
          ],
          "en.qaribullah": [
            "He said: 'My nation, I am a clear warner for you."
          ],
          "en.sahih": [
            "He said, \"O my people, indeed I am to you a clear warner,"
          ],
          "en.sarwar": [
            "Noah said, \"My people, I am warning you plainly."
          ],
          "en.shakir": [
            "He said: O my people! Surely I am a plain warner to you:"
          ],
          "en.transliteration": [
            "Q<u>a</u>la y<u>a</u> qawmi innee lakum na<u>th</u>eerun mubeen<b>un</b>"
          ],
          "en.wahiduddin": [
            "[Noah] said, \"My people! I am but a plain warner to you,"
          ],
          "en.yusufali": [
            "He said: \"O my People! I am to you a Warner, clear and open:"
          ],
          "fa.ansarian": [
            "گفت: ای قوم من! همانا من شما را بیم دهنده ایآشکارم،"
          ],
          "fa.ayati": [
            "گفت: اى قوم من، من بيم‌دهنده‌اى روشنگرم،"
          ],
          "fa.bahrampour": [
            "گفت: اى قوم من! همانا من شما را هشدار دهنده‌اى آشكارم"
          ],
          "fa.fooladvand": [
            "[نوح‌] گفت: «اى قوم من، من شما را هشدار دهنده‌اى آشكارم،"
          ],
          "fa.ghomshei": [
            "نوح گفت: ای قوم، من برای شما رسولی هستم که شما را با بیانی روشن از عذاب قهر خدا می‌ترسانم."
          ],
          "fa.khorramdel": [
            "گفت: ای قوم من! من برای شما بیم دهنده‌ی روشن و روشنگرم. [[«نَذِیرٌ مُّبِینٌ»: (نگا: اعراف / 184، هود / 25، حجر / 89).]]"
          ],
          "fa.khorramshahi": [
            "گفت ای قوم من، من هشداردهنده آشکار شما هستم‌"
          ],
          "fa.makarem": [
            "گفت: «ای قوم! من برای شما بیم‌دهنده آشکاری هستم،"
          ],
          "fa.moezzi": [
            "گفت ای قوم همانا منم برای شما ترساننده آشکار"
          ],
          "fa.mojtabavi": [
            "گفت: اى قوم من، همانا من شما را بيم‌كننده‌اى آشكارم،"
          ],
          "fa.sadeqi": [
            "(نوح) گفت: «ای قوم من! همواره من برای شما بیم‌دهنده‌ای روشنگرم‌؛»"
          ]
        }
      },
      {
        "index": 5422,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:71:3",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:2:1:17:1"
          ]
        },
        "text": [
          "أَنِ‌ اعْبُدُوا اللَّهَ‌ وَ اتَّقُوهُ‌ وَ أَطِيعُونِ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "That you should worship God and fear Him, and follow me"
          ],
          "en.ahmedraza": [
            "“That you must worship Allah and fear Him, and obey me.”"
          ],
          "en.arberry": [
            "saying, \"Serve God, and fear Him, and obey you me,"
          ],
          "en.daryabadi": [
            "Worship Allah, and fear Him, and obey me."
          ],
          "en.hilali": [
            "\"That you should worship Allah (Alone), be dutiful to Him, and obey me,"
          ],
          "en.itani": [
            "Worship God and reverence Him, and obey me."
          ],
          "en.maududi": [
            "that you serve Allah and fear Him, and follow me;"
          ],
          "en.mubarakpuri": [
            "\"That you should worship Allah, and have Taqwa of Him, and obey me,\""
          ],
          "en.pickthall": [
            "(Bidding you): Serve Allah and keep your duty unto Him and obey me,"
          ],
          "en.qarai": [
            "Worship Allah and be wary of Him, and obey me,"
          ],
          "en.qaribullah": [
            "Worship Allah, fear Him, and obey me."
          ],
          "en.sahih": [
            "[Saying], 'Worship Allah, fear Him and obey me."
          ],
          "en.sarwar": [
            "Worship God, have fear of Him and obey me."
          ],
          "en.shakir": [
            "That you should serve Allah and be careful of (your duty to) Him and obey me:"
          ],
          "en.transliteration": [
            "Ani oAAbudoo All<u>a</u>ha wa<b>i</b>ttaqoohu waa<u>t</u>eeAAoon<b>i</b>"
          ],
          "en.wahiduddin": [
            "that you should worship God [alone] and be conscious of Him. Pay heed to me."
          ],
          "en.yusufali": [
            "\"That ye should worship Allah, fear Him and obey me:"
          ],
          "fa.ansarian": [
            "که خدا را بپرستید و از او پروا کنید و از من اطاعت نمایید،"
          ],
          "fa.ayati": [
            "خدا را بپرستيد، و از او بترسيد و از من اطاعت كنيد،"
          ],
          "fa.bahrampour": [
            "كه خدا را بپرستيد و از او پروا داريد و مرا اطاعت كنيد"
          ],
          "fa.fooladvand": [
            "كه خدا را بپرستيد و از او پروا داريد و مرا فرمان بريد."
          ],
          "fa.ghomshei": [
            "(و از راه خیر خواهی به شما می‌گویم) که خدای را به یکتایی بپرستید و از او بترسید و پرهیزکار باشید و مرا پیروی کنید."
          ],
          "fa.khorramdel": [
            "خدا را بپرستید، و از او بترسید، و از من فرمانبرداری کنید. [[«أَنْ»: حرف تفسیریّه است.]]"
          ],
          "fa.khorramshahi": [
            "که خداوند را بپرستید و از او پروا و از من پیروی کنید"
          ],
          "fa.makarem": [
            "که خدا را پرستش کنید و از مخالفت او بپرهیزید و مرا اطاعت نمایید!"
          ],
          "fa.moezzi": [
            "که پرستش کنید خدا را و بترسیدش و مرا فرمان برید"
          ],
          "fa.mojtabavi": [
            "كه خداى يكتا را بپرستيد و از او پروا كنيد و مرا فرمان بريد،"
          ],
          "fa.sadeqi": [
            "«که خدا را بپرستید و از او پروا بدارید و مرا فرمان ببرید.»"
          ]
        }
      },
      {
        "index": 5423,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:71:4",
        "text": [
          "يَغْفِرْ لَکُمْ‌ مِنْ‌ ذُنُوبِکُمْ‌ وَ يُؤَخِّرْکُمْ‌ إِلَى‌ أَجَلٍ‌ مُسَمًّى‌ إِنَ‌ أَجَلَ‌ اللَّهِ‌ إِذَا جَاءَ لاَ يُؤَخَّرُ لَوْ کُنْتُمْ‌ تَعْلَمُونَ‌"
        ],
        "translations": {
          "en.ahmedali": [
            "That He may forgive some of your sins and prolong your term till an appointed time. Surely when God's appointed time is come it will not be put off, if only you knew!"
          ],
          "en.ahmedraza": [
            "“He will forgive you some of your sins, and give you respite up to an appointed term; indeed the promise of Allah cannot be averted when it arrives; if only you knew.”"
          ],
          "en.arberry": [
            "and He will forgive you your sins, and defer you to a stated term; God's term, when it comes, cannot be deferred, did you but know.\"'"
          ],
          "en.daryabadi": [
            "He will forgive you your sins, and will defer you to an appointed term. Verily the term of Allah when it cometh shall not be deferred, if ye but knew."
          ],
          "en.hilali": [
            "\"He (Allah) will forgive you of your sins and respite you to an appointed term. Verily, the term of Allah when it comes, cannot be delayed, if you but knew.\""
          ],
          "en.itani": [
            "And He will forgive you of your sins, and reprieve you until a stated term. God’s term cannot be deferred once it has arrived, if you only knew.”"
          ],
          "en.maududi": [
            "He will forgive your sins and will grant you respite until an appointed term. Indeed when Allah's appointed term comes, it cannot be deferred; if you only knew!”"
          ],
          "en.mubarakpuri": [
            "\"He will forgive you of your sins and respite you to an appointed term. Verily, the term of Allah when it comes, cannot be delayed, if you but know.\""
          ],
          "en.pickthall": [
            "That He may forgive you somewhat of your sins and respite you to an appointed term. Lo! the term of Allah, when it cometh, cannot be delayed, if ye but knew."
          ],
          "en.qarai": [
            "that He may forgive you some of your sins and respite you until a specified time. Indeed when Allah’s [appointed] time comes, it cannot be deferred, if you know.’"
          ],
          "en.qaribullah": [
            "He will forgive you your sins and respite you till an appointed term. When the term of Allah arrives it cannot be deferred; if you but knew'"
          ],
          "en.sahih": [
            "Allah will forgive you of your sins and delay you for a specified term. Indeed, the time [set by] Allah, when it comes, will not be delayed, if you only knew.' \""
          ],
          "en.sarwar": [
            "He will forgive your sins and give you a respite for an appointed time. When the time which God has appointed arrives, none will be able to postpone it. Would that you knew this!\""
          ],
          "en.shakir": [
            "He will forgive you some of your faults and grant you a delay to an appointed term; surely the term of Allah when it comes is not postponed; did you but know!"
          ],
          "en.transliteration": [
            "Yaghfir lakum min <u>th</u>unoobikum wayuakhkhirkum il<u>a</u> ajalin musamman inna ajala All<u>a</u>hi i<u>tha</u> j<u>a</u>a l<u>a</u> yuakhkharu law kuntum taAAlamoon<b>a</b>"
          ],
          "en.wahiduddin": [
            "He will forgive your sins and will grant you respite till an appointed time. When the time appointed by God arrives, it cannot be postponed, if you only knew.\""
          ],
          "en.yusufali": [
            "\"So He may forgive you your sins and give you respite for a stated Term: for when the Term given by Allah is accomplished, it cannot be put forward: if ye only knew.\""
          ],
          "fa.ansarian": [
            "تا خدا گناهانتان را بیامرزد و شما را تا زمانی معین مهلت دهد. اگر آگاهی داشته باشید [توجه خواهید کرد که] بی تردید هنگامی که اجل خدایی فرا رسد، تأخیر نخواهد داشت."
          ],
          "fa.ayati": [
            "تا گناهانتان را بيامرزد، و شما را تا مدتى معين مهلت دهد؛ زيرا آن مدت خدايى چون به سر آيد -اگر بدانيد- ديگر به تأخير نيفتد."
          ],
          "fa.bahrampour": [
            "تا [برخى‌] از گناهانتان را بر شما ببخشايد و [اجل‌] شما را تا وقتى معين به تأخير اندازد، كه اگر مى‌دانستيد، وقتى اجل مقرر خدا برسد ديگر به تأخير نيفتد"
          ],
          "fa.fooladvand": [
            "[تا] برخى از گناهانتان را بر شما ببخشايد و [اجل‌] شما را تا وقتى معين به تأخير اندازد. اگر بدانيد، چون وقت مقرر خدا برسد، تأخير بر نخواهد داشت."
          ],
          "fa.ghomshei": [
            "تا خدا به لطف و کرم از گناهان شما در گذرد و اجلتان را تا وقت (عمر طبیعی) معیّن به تأخیر افکند، که اجل الهی چون وقتش فرا رسد اگر بدانید دگر هیچ تأخیر نیفتد."
          ],
          "fa.khorramdel": [
            "(اگر دعوت مرا بپذیرید) خداوند گناهان شما را می‌آمرزد، و تا اجل نهائی مرگ شما را به تأخیر می‌اندازد. امّا اگر متوجّه باشید، هنگامی که اجل نهائی الهی فرا رسد، تأخیر پیدا نمی‌کند. [[«یُؤَخِّرْکُمْ»: شما را به تأخیر می‌اندازد. مراد طول عمر بخشیدن و به آن برکت دادن است. حکمت خدا مقتضی آن است که ملّتی که ایمان داشته باشد و جاده عدل و داد را در پیش گیرد، بیشتر زیست کند و از طول عمر برخوردار شود، و ملّتی که کفر و فساد و ظلم و زور را در پیش گیرد، هرچه زودتر نابود گردد (نگا: المصحف‌المیسّر). امّا در هر صورت، سر رسید عمر یا اجل نهائی در وقت خود فرا می‌رسد و پَسی و پیشی در آن نیست. به عبارت دیگر، انسان دارای دو اجل است: یکی اجل معلّق، که مشروط به عوامل و اسباب بوده و قابل تغییر است، و دیگری اجل مُبْرَم، که حتمی است و مقیّد به چیزی نبوده و قابل تغییر و تعجیل و تأخیر نیست (نگا: نمونه. التفسیر القرآنی للقرآن). «أَجَلٍ مُّسَمّیً»: (نگا: انعام / 2، اعراف / 34، یونس / 49، هود / 3).]]"
          ],
          "fa.khorramshahi": [
            "تا گناهانتان را برای شما بیامرزد و شما را تا سرآمدی معین واپس‌بدارد، چرا که اگر بدانید اجل الهی، چون فرا رسد، بازپس داشته نمی‌شود"
          ],
          "fa.makarem": [
            "اگر چنین کنید، خدا گناهانتان را می‌آمرزد و تا زمان معیّنی شما را عمر می‌دهد؛ زیرا هنگامی که اجل الهی فرا رسد، تأخیری نخواهد داشت اگر می‌دانستید!»"
          ],
          "fa.moezzi": [
            "تا بیامرزد برای شما از گناهانتان و پس اندازد شما را تا سرآمدی نامبرده که هر گاه سرآمد خدا بیاید پس انداخته نشود اگر بدانید"
          ],
          "fa.mojtabavi": [
            "تا گناهانتان را بيامرزد و شما را تا سرآمدى نامبرده واپس دارد، كه سرآمد خداى چون فرا رسد واپس نيفتد، اگر مى‌دانستيد."
          ],
          "fa.sadeqi": [
            "«تا برخی از از گناهانتان را بر شما بپوشاند. و شما را سوی اجلی نامبرده ]:ناگزیر و ناگریز[ به تأخیر اندازد. اگر می‌دانستید، چون وقت مقرّر خدا در رسد، هرگز تأخیر نخواهد داشت.»"
          ]
        }
      },
      {
        "index": 5424,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:71:5",
        "text": [
          "قَالَ‌ رَبِ‌ إِنِّي‌ دَعَوْتُ‌ قَوْمِي‌ لَيْلاً وَ نَهَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "He said: \"O Lord, I called my people night and day,"
          ],
          "en.ahmedraza": [
            "He said, “My Lord! I invited my people night and day.”"
          ],
          "en.arberry": [
            "He said; 'My Lord, I have called my people by night and by day,"
          ],
          "en.daryabadi": [
            "He said: my Lord! verily have called my people night and day."
          ],
          "en.hilali": [
            "He said: \"O my Lord! Verily, I have called my people night and day (i.e. secretly and openly to accept the doctrine of Islamic Monotheism)."
          ],
          "en.itani": [
            "He said, “My Lord, I have called my people night and day."
          ],
          "en.maududi": [
            "He said: “My Lord, I called my people by night and by day,"
          ],
          "en.mubarakpuri": [
            "He said: O my Lord! Verily, I have called to my people night and day,"
          ],
          "en.pickthall": [
            "He said: My Lord! Lo! I have called unto my people night and day"
          ],
          "en.qarai": [
            "He said, ‘My Lord! Indeed, I have summoned my people night and day"
          ],
          "en.qaribullah": [
            "'My Lord' said he, 'night and day I have called my nation,"
          ],
          "en.sahih": [
            "He said, \"My Lord, indeed I invited my people [to truth] night and day."
          ],
          "en.sarwar": [
            "Noah said, \"My Lord, I have been preaching to my people, night and day,"
          ],
          "en.shakir": [
            "He said: O my Lord! surely I have called my people by night and by day!"
          ],
          "en.transliteration": [
            "Q<u>a</u>la rabbi innee daAAawtu qawmee laylan wanah<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "He said, \"My Lord! I have called my people night and day"
          ],
          "en.yusufali": [
            "He said: \"O my Lord! I have called to my People night and day:"
          ],
          "fa.ansarian": [
            "گفت: پروردگارا! همانا قوم خود را شب و روز [به آیین توحید] دعوت کردم،"
          ],
          "fa.ayati": [
            "گفت: اى پروردگار من، من قوم خود را شب و روز دعوت كردم،"
          ],
          "fa.bahrampour": [
            "[نوح‌] گفت: پروردگارا! من قوم خود را شب و روز دعوت كردم"
          ],
          "fa.fooladvand": [
            "[نوح‌] گفت: «پروردگارا، من قوم خود را شب و روز دعوت كردم،"
          ],
          "fa.ghomshei": [
            "(و او به درگاه خدا نالید و) گفت: بارالها، من قوم خود را شب و روز دعوت کردم."
          ],
          "fa.khorramdel": [
            "نوح گفت: پروردگارا! من قوم خود را شب و روز (به سوی ایمان به تو) فرا خوانده‌ام. [[«لَیْلاً وَ نَهَاراً»: شب و روز. مراد استمرار در دعوت است.]]"
          ],
          "fa.khorramshahi": [
            "گفت پروردگارا من قومم را شب و روز [به خداپرستی‌] دعوت کردم‌"
          ],
          "fa.makarem": [
            "(نوح) گفت: «پروردگارا! من قوم خود را شب و روز (بسوی تو) دعوت کردم،"
          ],
          "fa.moezzi": [
            "گفت پروردگارا همانا خواندم قوم خویش را شب و روز"
          ],
          "fa.mojtabavi": [
            "گفت: پروردگارا، همانا من قوم خود را شب و روز خواندم،"
          ],
          "fa.sadeqi": [
            "(نوح) گفت: «پروردگارم! من قوم خود را همواره شب و روز (پیاپی) دعوت کردم.»"
          ]
        }
      },
      {
        "index": 5425,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:71:6",
        "text": [
          "فَلَمْ‌ يَزِدْهُمْ‌ دُعَائِي‌ إِلاَّ فِرَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "But the more I called, they only ran the farther away."
          ],
          "en.ahmedraza": [
            "“So for them, my calling them increased their fleeing away.”"
          ],
          "en.arberry": [
            "but my calling has only increased them in flight."
          ],
          "en.daryabadi": [
            "And my calling hath only increased them in fleeing."
          ],
          "en.hilali": [
            "\"But all my calling added nothing but to (their) flight (from the truth)."
          ],
          "en.itani": [
            "But my call added only to their flight."
          ],
          "en.maududi": [
            "but the more I called, the farther they fled."
          ],
          "en.mubarakpuri": [
            "But all my calling added nothing but to (their) flight."
          ],
          "en.pickthall": [
            "But all my calling doth but add to their repugnance;"
          ],
          "en.qarai": [
            "but my summons only increases their evasion."
          ],
          "en.qaribullah": [
            "but my call has only increased them in running away."
          ],
          "en.sahih": [
            "But my invitation increased them not except in flight."
          ],
          "en.sarwar": [
            "but it has had no effect on them except to make them run away."
          ],
          "en.shakir": [
            "But my call has only made them flee the more:"
          ],
          "en.transliteration": [
            "Falam yazidhum duAA<u>a</u>ee ill<u>a</u> fir<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "but my pleas have only increased their aversion."
          ],
          "en.yusufali": [
            "\"But my call only increases (their) flight (from the Right)."
          ],
          "fa.ansarian": [
            "ولی دعوت من جز بر فرارشان نیفزود،"
          ],
          "fa.ayati": [
            "و دعوت من جز به فرارشان نيفزود."
          ],
          "fa.bahrampour": [
            "و دعوت من جز بر گريزشان نيفزود"
          ],
          "fa.fooladvand": [
            "و دعوت من جز بر گريزشان نيفزود."
          ],
          "fa.ghomshei": [
            "اما دعوت و نصیحتم جز بر فرار و اعراض آنها نیفزود."
          ],
          "fa.khorramdel": [
            "امّا دعوت و فرا خواندنم تنها بر گریز ایشان افزود! [[«دُعَآئِی»: دعوت من. فرا خواندن و رهنمود کردن من.]]"
          ],
          "fa.khorramshahi": [
            "ولی دعوت من جز بر گریزشان نیفزود"
          ],
          "fa.makarem": [
            "امّا دعوت من چیزی جز فرار از حقّ بر آنان نیفزود!"
          ],
          "fa.moezzi": [
            "پس نیفزودشان خواندنم جز گریختنی‌"
          ],
          "fa.mojtabavi": [
            "پس خواندن من آنان را جز رميدن و گريختن نيفزود"
          ],
          "fa.sadeqi": [
            "«پس دعوت من جز بر گریزشان نیفزود.»"
          ]
        }
      },
      {
        "index": 5426,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:71:7",
        "text": [
          "وَ إِنِّي‌ کُلَّمَا دَعَوْتُهُمْ‌ لِتَغْفِرَ لَهُمْ‌ جَعَلُوا أَصَابِعَهُمْ‌ فِي‌ آذَانِهِمْ‌ وَ اسْتَغْشَوْا ثِيَابَهُمْ‌ وَ أَصَرُّوا وَ اسْتَکْبَرُوا اسْتِکْبَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And every time I called them that You may forgive them, they thrust their fingers into their ears, and covered themselves with their garments, and became wayward, and behaved with downright insolence."
          ],
          "en.ahmedraza": [
            "“And whenever I called them, so that You may forgive them, they always thrust their fingers into their ears, and covered themselves with their clothes, and remained stubborn and were extremely haughty.”"
          ],
          "en.arberry": [
            "And whenever I called them, that Thou mightest forgive them, they put their fingers in their ears, and wrapped them in their garments, and persisted, and waxed very proud."
          ],
          "en.daryabadi": [
            "And verily so oft as I call them, that Thou mayest forgive them, they place their fingers into their ears, and wrap themselves with their garments, and persist, and are stiff-necked."
          ],
          "en.hilali": [
            "\"And verily! Every time I called unto them that You might forgive them, they thrust their fingers into their ears, covered themselves up with their garments, and persisted (in their refusal), and magnified themselves in pride."
          ],
          "en.itani": [
            "Whenever I called them to Your forgiveness, they thrust their fingers into their ears, and wrapped themselves in their garments, and insisted, and became more and more arrogant."
          ],
          "en.maududi": [
            "And every time I called them so that You might forgive them, they thrust their fingers into their ears and wrapped up their faces with their garments and obstinately clung to their attitude, and waxed very proud."
          ],
          "en.mubarakpuri": [
            "And verily, every time I called unto them that You might forgive them, they thrust their fingers into their ears, covered themselves up with their garments, and persisted, and magnified themselves in pride."
          ],
          "en.pickthall": [
            "And lo! whenever I call unto them that Thou mayst pardon them they thrust their fingers in their ears and cover themselves with their garments and persist (in their refusal) and magnify themselves in pride."
          ],
          "en.qarai": [
            "Indeed whenever I have summoned them, so that You might forgive them, they would put their fingers into their ears and draw their cloaks over their heads, and they were persistent [in their unfaith], and disdainful in [their] arrogance."
          ],
          "en.qaribullah": [
            "Each time I called them so that You might forgive them, they thrust their fingers in their ears and wrapped themselves in their garments, and persisted becomingvery proud."
          ],
          "en.sahih": [
            "And indeed, every time I invited them that You may forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were arrogant with [great] arrogance."
          ],
          "en.sarwar": [
            "Evert time I invite them to Your (guidance) so that You can forgive them, they put their fingers into their ears, cover their heads with their clothes, persist in their disbelief and display extreme arrogance."
          ],
          "en.shakir": [
            "And whenever I have called them that Thou mayest forgive them, they put their fingers in their ears, cover themselves with their garments, and persist and are puffed up with pride:"
          ],
          "en.transliteration": [
            "Wainnee kullam<u>a</u> daAAawtuhum litaghfira lahum jaAAaloo a<u>sa</u>biAAahum fee <u>atha</u>nihim wa<b>i</b>staghshaw thiy<u>a</u>bahum waa<u>s</u>arroo wa<b>i</b>stakbaroo istikb<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Every time I have called to them, so that You might forgive them, they have only thrust their fingers into their ears, covered themselves up with their garments, grown obstinate, and given themselves up to arrogance."
          ],
          "en.yusufali": [
            "\"And every time I have called to them, that Thou mightest forgive them, they have (only) thrust their fingers into their ears, covered themselves up with their garments, grown obstinate, and given themselves up to arrogance."
          ],
          "fa.ansarian": [
            "و من هرگاه آنان را دعوت کردم تا آنان را بیامرزی، انگشتان خود را در گوش هایشان کردند و جامه هایشان را به سر کشیدند و بر انکار خود پافشاری ورزیدند و به شدت تکبّر کردند،"
          ],
          "fa.ayati": [
            "و من هر بار كه دعوتشان كردم تا تو آنها را بيامرزى، انگشتها در گوشهاى خود كردند و جامه در سر كشيدند و پاى فشردند و هر چه بيشتر سركشى كردند."
          ],
          "fa.bahrampour": [
            "و من هر بار كه آنها را دعوت كردم تا ايشان را بيامرزى، انگشتانشان را در گوش‌هاى خود كردند و جامه‌هاى خويش بر سر كشيدند و [بر كفر خويش‌] پاى فشردند و هر چه بيشتر بر تكبر خود افزودند"
          ],
          "fa.fooladvand": [
            "و من هر بار كه آنان را دعوت كردم تا ايشان را بيامرزى، انگشتانشان را در گوشهايشان كردند و رداى خويشتن بر سر كشيدند و اصرار ورزيدند و هر چه بيشتر بر كبر خود افزودند."
          ],
          "fa.ghomshei": [
            "و هر چه آنان را به مغفرت و آمرزش تو خواندم انگشت بر گوش نهادند و جامه به رخسار افکندند (تا مرا نبینند و سخنم را نشنوند) و (بر کفر) اصرار و لجاج ورزیدند و سخت راه تکبر و نخوت پیمودند."
          ],
          "fa.khorramdel": [
            "من هر زمان که ایشان را دعوت کرده‌ام تا (ایمان بیاورند و) تو آنان را بیامرزی، انگشتهای خود را به گوشهایشان فرو کرده‌اند (تا ندای حق را نشنوند) و جامه‌هایشان را بر سر کشیده‌اند (تا قیافه‌ی مرا نبینند) و (در فسق و فجور و ظلم و زور بیشتر فرو رفته‌اند و بر کفر) پافشاری کرده‌اند و سخت سرکشی نموده و بزرگی فروخته‌اند. [[«جَعَلُوا أَصَابِعَهُمْ فِی آذَانِهِمْ»: (نگا: بقره / 19). انگشت در گوش فرو کردن، کنایه از گوش فرا ندادن، و خود را از شنیدن حق کر کردن است. «إسْتَغْشَوْا»: جامه بر سر کشیدند. جامه بر خود پیچیدن و خویشتن را به زیر جامه کردن، کنایه از نفرت و عداوت است. «إِسْتَکْبَرُوا»: (نگا: نساء / 173، اعراف / 36 و 40).]]"
          ],
          "fa.khorramshahi": [
            "و من هرچه دعوتشان می‌کنم تا سرانجام آنان را بیامرزی، انگشتانشان را در گوشهایشان می‌گذارند، و خود را در جامه‌هایشان می‌پوشانند و [در کفر] پای می‌فشرند و سخت گردنکشی می‌کنند"
          ],
          "fa.makarem": [
            "و من هر زمان آنها را دعوت کردم که (ایمان بیاورند و) تو آنها را بیامرزی، انگشتان خویش را در گوشهایشان قرار داده و لباسهایشان را بر خود پیچیدند، و در مخالفت اصرار ورزیدند و به شدّت استکبار کردند!"
          ],
          "fa.moezzi": [
            "و آنکه هر گاه خواندمشان تا بیامرزی برای ایشان نهادند انگشتان خویش را در گوشهای خویش و پوشیدند خویشتن را با جامه‌های خویش و اصرار کردند و کبر ورزیدند کبرورزیدنی‌"
          ],
          "fa.mojtabavi": [
            "و هر گاه كه ايشان را بخواندم تا آنها را بيامرزى انگشتان خويش در گوشهاشان كردند- تا نشنوند- و جامه‌هاى خود را بر سر كشيدند- تا مرا نبينند- و [بر كفر خويش‌] پاى فشردند و بسى سركشى و بزرگ‌منشى نمودند."
          ],
          "fa.sadeqi": [
            "«و من بی‌قرار، هربار که آنان را دعوت کردم تا برایشان (گناهانشان را) ‌بپوشانی، انگشتانشان را در گوش‌هایشان نهادند و لباس‌هاشان را بر (سرها)شان کشیدند و (بر کفرشان) اصرار ورزیدند و هر چه بیشتر بر کبر خود افزودند.»"
          ]
        }
      },
      {
        "index": 5427,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:71:8",
        "text": [
          "ثُمَ‌ إِنِّي‌ دَعَوْتُهُمْ‌ جِهَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "Then I called them loudly and more openly,"
          ],
          "en.ahmedraza": [
            "“I then called them openly.”"
          ],
          "en.arberry": [
            "Then indeed I called them openly;"
          ],
          "en.daryabadi": [
            "Then verily have called Unto them publicly:"
          ],
          "en.hilali": [
            "\"Then verily, I called to them openly (aloud);"
          ],
          "en.itani": [
            "Then I called them openly."
          ],
          "en.maududi": [
            "Then I summoned them openly,"
          ],
          "en.mubarakpuri": [
            "Then verily, I called to them openly (aloud)."
          ],
          "en.pickthall": [
            "And lo! I have called unto them aloud,"
          ],
          "en.qarai": [
            "Again I summoned them aloud,"
          ],
          "en.qaribullah": [
            "I called to them clearly,"
          ],
          "en.sahih": [
            "Then I invited them publicly."
          ],
          "en.sarwar": [
            "\"I preached to them aloud, in public."
          ],
          "en.shakir": [
            "Then surely I called to them aloud:"
          ],
          "en.transliteration": [
            "Thumma innee daAAawtuhum jih<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Then I called them openly,"
          ],
          "en.yusufali": [
            "\"So I have called to them aloud;"
          ],
          "fa.ansarian": [
            "آن گاه آنان را آشکارا دعوت کردم،"
          ],
          "fa.ayati": [
            "پس به آواز بلند دعوتشان كردم."
          ],
          "fa.bahrampour": [
            "سپس من آنها را به آواز بلند دعوت كردم"
          ],
          "fa.fooladvand": [
            "سپس من آشكارا آنان را دعوت كردم."
          ],
          "fa.ghomshei": [
            "باز هم آنها را به صدای بلند دعوت کردم."
          ],
          "fa.khorramdel": [
            "سپس من آنان را آشکارا و با صدای بلند (به یکتاپرستی و ایمان راستین) دعوت کرده‌ام. [[«جِهَاراً»: آشکارا. با صدای بلند. مفعول مطلق است چون به معنی نوعی دعوت است. یا صفت مصدر محذوفی است، و یا در معنی (مُجَاهِراً) و حال است (نگا: روح‌المعانی).]]"
          ],
          "fa.khorramshahi": [
            "سپس باز ایشان را آشکارا دعوت کردم‌"
          ],
          "fa.makarem": [
            "سپس من آنها را با صدای بلند (به اطاعت فرمان تو) دعوت کردم،"
          ],
          "fa.moezzi": [
            "سپس هر آینه بخواندمشان من به آواز بلند (آشکارا)"
          ],
          "fa.mojtabavi": [
            "و آنگاه آنان را آشكارا به آواز بلند بخواندم،"
          ],
          "fa.sadeqi": [
            "سپس آشکارا آنان را دعوت کردم.»"
          ]
        }
      },
      {
        "index": 5428,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:71:9",
        "text": [
          "ثُمَ‌ إِنِّي‌ أَعْلَنْتُ‌ لَهُمْ‌ وَ أَسْرَرْتُ‌ لَهُمْ‌ إِسْرَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And declared to them in public and in private,"
          ],
          "en.ahmedraza": [
            "“Then I also told them publicly and also spoke to them softly in private.”"
          ],
          "en.arberry": [
            "then indeed I spoke publicly unto them, and I spoke unto them secretly,"
          ],
          "en.daryabadi": [
            "Then verily spake Unto them openly, and secretly also I addressed them."
          ],
          "en.hilali": [
            "\"Then verily, I proclaimed to them in public, and I have appealed to them in private,"
          ],
          "en.itani": [
            "Then I appealed to them publicly, and I spoke to them privately."
          ],
          "en.maududi": [
            "and preached to them in public, and also addressed them in secret."
          ],
          "en.mubarakpuri": [
            "Then verily, I proclaimed to them in public, and I have appealed to them in private."
          ],
          "en.pickthall": [
            "And lo! I have made public proclamation unto them, and I have appealed to them in private."
          ],
          "en.qarai": [
            "and again appealed to them publicly and confided with them privately,"
          ],
          "en.qaribullah": [
            "and indeed, I spoke to them both publicly and in secret:"
          ],
          "en.sahih": [
            "Then I announced to them and [also] confided to them secretly"
          ],
          "en.sarwar": [
            "Then I conveyed the message to them, again, both in public and in private,"
          ],
          "en.shakir": [
            "Then surely I spoke to them in public and I spoke to them in secret:"
          ],
          "en.transliteration": [
            "Thumma innee aAAlantu lahum waasrartu lahum isr<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and spoke to them in public and in private.\""
          ],
          "en.yusufali": [
            "\"Further I have spoken to them in public and secretly in private,"
          ],
          "fa.ansarian": [
            "سپس آشکار و پنهان آنان را خواندم."
          ],
          "fa.ayati": [
            "باز به آشكار گفتم و در نهان گفتم."
          ],
          "fa.bahrampour": [
            "و آن‌گاه باز من به آنها علنى گفتم و در خلوت و خصوصى نيز به ايشان گفتم"
          ],
          "fa.fooladvand": [
            "باز من به آنان اعلام نمودم و در خلوت [و] پوشيده نيز به ايشان گفتم."
          ],
          "fa.ghomshei": [
            "و آن گاه آشکار و علنی خواندم و در خلوت و پنهانی خواندم (به هیچ وجه اثری نکرد)."
          ],
          "fa.khorramdel": [
            "گذشته از این، به گونه‌ی علنی و (جمعی)، و به صورت نهانی (و فردی، دعوت آسمانی را) بدیشان رسانده‌ام. [[«أَعْلَنتُ»: علنی و آشکارا بیان کرده‌ام. مراد بیشتر دعوت جمعی و گروهی است. «أَسْرَرْتُ»: پنهان و نهان کرده‌ام. منظور بیشتر دعوت فردی و شخصی است. به طور کلّی، مراد از فرموده نوح انواع و اقسام دعوت و گونه‌های مختلف تبلیغ است.]]"
          ],
          "fa.khorramshahi": [
            "آنگاه آشکارا به ایشان گفتم و پنهانی به ایشان گفتم‌"
          ],
          "fa.makarem": [
            "سپس آشکارا و نهان (حقیقت توحید و ایمان را) برای آنان بیان داشتم!"
          ],
          "fa.moezzi": [
            "پس آشکار ساختم برای ایشان و نهان داشتم نهان‌داشتنی‌"
          ],
          "fa.mojtabavi": [
            "باز آنها را آشكارا بگفتم و در نهان بگفتم."
          ],
          "fa.sadeqi": [
            "«سپس به‌درستی برایشان اعلان کردم و در نهان و پنهان برایشان همی اندرز دادم.»"
          ]
        }
      },
      {
        "index": 5429,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:71:10",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:6:1:4:4",
            "/books/al-kafi:6:1:4:5"
          ]
        },
        "text": [
          "فَقُلْتُ‌ اسْتَغْفِرُوا رَبَّکُمْ‌ إِنَّهُ‌ کَانَ‌ غَفَّاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And I told them: 'Ask your Lord to forgive you. He is verily forgiving."
          ],
          "en.ahmedraza": [
            "“I therefore told them, ‘Seek forgiveness from your Lord; He is indeed Most Forgiving.’"
          ],
          "en.arberry": [
            "and I said, \"Ask you forgiveness of your Lord; surely He is ever All-forgiving,"
          ],
          "en.daryabadi": [
            "And I said: ask forgiveness of your Lord; verily He is ever Most Forgiving."
          ],
          "en.hilali": [
            "\"I said (to them): 'Ask forgiveness from your Lord; Verily, He is Oft-Forgiving;"
          ],
          "en.itani": [
            "I said, ‘Ask your Lord for forgiveness; He is Forgiving."
          ],
          "en.maududi": [
            "I said to them: “Ask forgiveness from your Lord; surely He is Most Forgiving."
          ],
          "en.mubarakpuri": [
            "I said (to them): Ask forgiveness from your Lord, verily, He is Oft-Forgiving;"
          ],
          "en.pickthall": [
            "And I have said: Seek pardon of your Lord. Lo! He was ever Forgiving."
          ],
          "en.qarai": [
            "telling [them]: ‘‘Plead to your Lord for forgiveness. Indeed, He is all-forgiving."
          ],
          "en.qaribullah": [
            "\"Ask for forgiveness of your Lord,\" I said. \"Surely, He is the Forgiver."
          ],
          "en.sahih": [
            "And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver."
          ],
          "en.sarwar": [
            "and told them, \"Ask forgiveness from your Lord; He is All-forgiving\"."
          ],
          "en.shakir": [
            "Then I said, Ask forgiveness of your Lord, surely He is the most Forgiving:"
          ],
          "en.transliteration": [
            "Faqultu istaghfiroo rabbakum innahu k<u>a</u>na ghaff<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Then I said, \"Ask forgiveness of your Lord. Surely He is the most forgiving."
          ],
          "en.yusufali": [
            "\"Saying, 'Ask forgiveness from your Lord; for He is Oft-Forgiving;"
          ],
          "fa.ansarian": [
            "پس [به آنان] گفتم: از پروردگارتان آمرزش بخواهید که او همواره بسیار آمرزنده است."
          ],
          "fa.ayati": [
            "سپس گفتم: از پروردگارتان آمرزش بخواهيد كه او آمرزنده است،"
          ],
          "fa.bahrampour": [
            "و گفتم: از پروردگارتان آمرزش بخواهيد كه او قطعا آمرزنده است"
          ],
          "fa.fooladvand": [
            "و گفتم: از پروردگارتان آمرزش بخواهيد كه او همواره آمرزنده است."
          ],
          "fa.ghomshei": [
            "باز گفتم: به درگاه خدای خود توبه کنید و آمرزش طلبید که او بسیار خدای آمرزنده‌ای است."
          ],
          "fa.khorramdel": [
            "و بدیشان گفته‌ام: از پروردگار خویش طلب آمرزش کنید که او بسیار آمرزنده است (و شما را می‌بخشاید)."
          ],
          "fa.khorramshahi": [
            "سپس گفتم از پروردگارتان آمرزش بخواهید چرا که او آمرزگار است‌"
          ],
          "fa.makarem": [
            "به آنها گفتم: «از پروردگار خویش آمرزش بطلبید که او بسیار آمرزنده است..."
          ],
          "fa.moezzi": [
            "پس گفتم آمرزش خواهید از پروردگار خویش همانا او است بسیار آمرزنده‌"
          ],
          "fa.mojtabavi": [
            "پس گفتم: از پروردگارتان آمرزش بخواهيد كه او آمرزگار است،"
          ],
          "fa.sadeqi": [
            "« پس گفتم: “از پروردگارتان پوشش بخواهید که او به‌راستی بسی پوشاننده بوده است.”»"
          ]
        }
      },
      {
        "index": 5430,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:71:11",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:6:1:4:5"
          ]
        },
        "text": [
          "يُرْسِلِ‌ السَّمَاءَ عَلَيْکُمْ‌ مِدْرَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "He will send you abundant rain from the sky,"
          ],
          "en.ahmedraza": [
            "‘He will send down abundant rain for you from the sky.’"
          ],
          "en.arberry": [
            "and He will loose heaven upon you in torrents"
          ],
          "en.daryabadi": [
            "He will send the heaven upon you copiously;"
          ],
          "en.hilali": [
            "'He will send rain to you in abundance;"
          ],
          "en.itani": [
            "He will let loose the sky upon you in torrents."
          ],
          "en.maududi": [
            "He will shower upon you torrents from heaven,"
          ],
          "en.mubarakpuri": [
            "He will send rain to you Midrar,"
          ],
          "en.pickthall": [
            "He will let loose the sky for you in plenteous rain,"
          ],
          "en.qarai": [
            "He will send for you abundant rains from the sky,"
          ],
          "en.qaribullah": [
            "He will let loose the sky upon you in abundance"
          ],
          "en.sahih": [
            "He will send [rain from] the sky upon you in [continuing] showers"
          ],
          "en.sarwar": [
            "He will send you abundant"
          ],
          "en.shakir": [
            "He will send down upon you the cloud, pouring down abundance of rain:"
          ],
          "en.transliteration": [
            "Yursili a<b>l</b>ssam<u>a</u>a AAalaykum midr<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "He will send down abundant rain from the sky for you,"
          ],
          "en.yusufali": [
            "\"'He will send rain to you in abundance;"
          ],
          "fa.ansarian": [
            "تا بر شما از آسمان باران پی در پی و با برکت فرستد،"
          ],
          "fa.ayati": [
            "تا از آسمان برايتان پى‌درپى باران فرستد،"
          ],
          "fa.bahrampour": [
            "تا بر شما از آسمان باران پى‌درپى فرستد"
          ],
          "fa.fooladvand": [
            "[تا] بر شما از آسمان باران پى در پى فرستد."
          ],
          "fa.ghomshei": [
            "تا باران آسمان بر شما فراوان نازل کند."
          ],
          "fa.khorramdel": [
            "(اگر چنین کنید) خدا از آسمان بارانهای پر خیر و برکت را پیاپی می‌باراند. [[«یُرْسِلْ»: جواب شرط محذوفی است: إِن تَسْتَغْفِرُوا یُرْسِلِ الْسَّمَآءَ. «السَّمَآءَ»: مراد ابر آسمان، و باران آن است (نگا: المصحف‌المیسّر، روح‌البیان). «مِدْرَاراً»: فراوان و پیاپی. صیغه مبالغه بوده و حال واقع شده است.]]"
          ],
          "fa.khorramshahi": [
            "تا بر شما از آسمان بارانی پیوسته و پیگیر بفرستد"
          ],
          "fa.makarem": [
            "تا بارانهای پربرکت آسمان را پی در پی بر شما فرستد،"
          ],
          "fa.moezzi": [
            "فرستد آسمان را بر شما ریزنده‌"
          ],
          "fa.mojtabavi": [
            "تا آسمان- ابر- را بر شما بارنده فرستد."
          ],
          "fa.sadeqi": [
            "«تا (خدا باران و برفِ) آسمان را بر (سروسامان)تان بسی ریزان بفرستد»"
          ]
        }
      },
      {
        "index": 5431,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:71:12",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:6:1:4:4",
            "/books/al-kafi:6:1:4:5"
          ]
        },
        "text": [
          "وَ يُمْدِدْکُمْ‌ بِأَمْوَالٍ‌ وَ بَنِينَ‌ وَ يَجْعَلْ‌ لَکُمْ‌ جَنَّاتٍ‌ وَ يَجْعَلْ‌ لَکُمْ‌ أَنْهَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And will give you increase of wealth and sons, and give you gardens and springs of water."
          ],
          "en.ahmedraza": [
            "‘And will aid you with wealth and sons, and will create gardens for you and cause rivers to flow for you.’"
          ],
          "en.arberry": [
            "and will succour you with wealth and sons, and will appoint for you gardens, and will appoint for you rivers."
          ],
          "en.daryabadi": [
            "And He will add Unto you riches and children and will appoint Unto you gardens and will appoint Unto you rivers."
          ],
          "en.hilali": [
            "'And give you increase in wealth and children, and bestow on you gardens and bestow on you rivers.\""
          ],
          "en.itani": [
            "And provide you with wealth and children, and allot for you gardens, and allot for you rivers."
          ],
          "en.maududi": [
            "and will provide you with wealth and children, and will bestow upon you gardens and rivers."
          ],
          "en.mubarakpuri": [
            "And give you increase in wealth and children, and bestow on you gardens and bestow on you rivers."
          ],
          "en.pickthall": [
            "And will help you with wealth and sons, and will assign unto you Gardens and will assign unto you rivers."
          ],
          "en.qarai": [
            "and aid you with wealth and sons, and provide you with gardens and provide you with streams."
          ],
          "en.qaribullah": [
            "and give to you wealth and sons, and provide you with gardens and rivers."
          ],
          "en.sahih": [
            "And give you increase in wealth and children and provide for you gardens and provide for you rivers."
          ],
          "en.sarwar": [
            "rain from the sky,"
          ],
          "en.shakir": [
            "And help you with wealth and sons, and make for you gardens, and make for you rivers."
          ],
          "en.transliteration": [
            "Wayumdidkum biamw<u>a</u>lin wabaneena wayajAAal lakum jann<u>a</u>tin wayajAAal lakum anh<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "increase your wealth and sons; and grant you gardens and waterways."
          ],
          "en.yusufali": [
            "\"'Give you increase in wealth and sons; and bestow on you gardens and bestow on you rivers (of flowing water)."
          ],
          "fa.ansarian": [
            "و شما را با اموال و فرزندان یاری کند، و برایتان باغ ها و نهرها قرار دهد،"
          ],
          "fa.ayati": [
            "و شما را به اموال و فرزندان مدد كند و برايتان بستانها و نهرها بيافريند."
          ],
          "fa.bahrampour": [
            "و شما را به اموال و پسران مدد كند، و برايتان باغ‌ها قرار دهد و نهرها پديد آورد"
          ],
          "fa.fooladvand": [
            "و شما را به اموال و پسران، يارى كند، و برايتان باغها قرار دهد و نهرها براى شما پديد آورد."
          ],
          "fa.ghomshei": [
            "و شما را به مال بسیار و پسران متعدد مدد فرماید و باغهای خرّم و نهرهای جاری به شما عطا کند."
          ],
          "fa.khorramdel": [
            "و با اعطاء دارائی و فرزندان، شما را کمک می‌کند و یاری می‌دهد، و باغهای سرسبز و فراوان بهره‌ی شما می‌سازد، و رودبارهای پر آب در اختیارتان می‌گذارد. [[«جَنَّاتٍ ... أَنْهَاراً»: تنوین این واژه‌ها بیانگرِ وفور نعمت آنها است.]]"
          ],
          "fa.khorramshahi": [
            "و شما را با بخشیدن اموال و پسران مدد رساند و برای شما باغها و برای شما جویبارها پدید آورد"
          ],
          "fa.makarem": [
            "و شما را با اموال و فرزندان فراوان کمک کند و باغهای سرسبز و نهرهای جاری در اختیارتان قرار دهد!"
          ],
          "fa.moezzi": [
            "و کمک کند شما را به خواسته‌ها و فرزندان و قرار دهد برای شما باغهایی و قرار دهد برای شما جویهایی‌"
          ],
          "fa.mojtabavi": [
            "و شما را به مالها و پسران يارى كند و به شما بوستانها دهد و برايتان جويها پديد آرد."
          ],
          "fa.sadeqi": [
            "«و شما را به اموال و پسرانی، امداد نماید و برایتان باغ‌هایی (با درختان سردر هم) قرار دهد و برایتان نهرها نهد.»"
          ]
        }
      },
      {
        "index": 5432,
        "local_index": 13,
        "part_type": "Verse",
        "path": "/books/quran:71:13",
        "text": [
          "مَا لَکُمْ‌ لاَ تَرْجُونَ‌ لِلَّهِ‌ وَقَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "What has come upon you that you do not fear the majesty of God,"
          ],
          "en.ahmedraza": [
            "‘What is the matter with you, that you do not desire honour from Allah?’"
          ],
          "en.arberry": [
            "What ails you, that you look not for majesty in God,"
          ],
          "en.daryabadi": [
            "What aileth you that ye expect not in Allah majesty!"
          ],
          "en.hilali": [
            "What is the matter with you, [that you fear not Allah (His punishment), and] you hope not for reward (from Allah or you believe not in His Oneness)."
          ],
          "en.itani": [
            "What is the matter with you, that you do not appreciate God’s Greatness?"
          ],
          "en.maududi": [
            "What is amiss with you that you do not look forward to the majesty of Allah"
          ],
          "en.mubarakpuri": [
            "What is the matter with you, that you do not hope for any Waqar from Allah"
          ],
          "en.pickthall": [
            "What aileth you that ye hope not toward Allah for dignity"
          ],
          "en.qarai": [
            "What is the matter with you that you do not look upon Allah with veneration,"
          ],
          "en.qaribullah": [
            "What is the matter with you that you do not want the Greatness of Allah,"
          ],
          "en.sahih": [
            "What is [the matter] with you that you do not attribute to Allah [due] grandeur"
          ],
          "en.sarwar": [
            "strengthen you by (providing) you wealth and children, and make gardens and streams for you. What is the matter with you that you are not afraid of the greatness of God"
          ],
          "en.shakir": [
            "What is the matter with you that you fear not the greatness of Allah?"
          ],
          "en.transliteration": [
            "M<u>a</u> lakum l<u>a</u> tarjoona lill<u>a</u>hi waq<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "What is the matter with you that you deny the greatness of God,"
          ],
          "en.yusufali": [
            "\"'What is the matter with you, that ye place not your hope for kindness and long-suffering in Allah,-"
          ],
          "fa.ansarian": [
            "شما را چه شده که [ربوبیت خدا را نفی کرده و در نتیجه از بندگی اش دست برداشته و] به عظمت و بزرگی خدا امید ندارید؟"
          ],
          "fa.ayati": [
            "شما را چه مى‌شود كه از شكوه خداوند نمى‌ترسيد،"
          ],
          "fa.bahrampour": [
            "چيست شما را كه براى خدا عظمت قائل نمى‌شويد"
          ],
          "fa.fooladvand": [
            "شما را چه شده است كه از شكوه خدا بيم نداريد؟"
          ],
          "fa.ghomshei": [
            "چرا شما مردم خدای را به عظمت و وقار باور ندارید؟"
          ],
          "fa.khorramdel": [
            "شما را چه می‌شود که برای خدا عظمت و شکوهی قائل نیستید؟ [[«لا تَرْجُونَ»: در نظر نمی‌گیرید. قائل نیستید. «وَقَاراً»: سنگینی و شکوه. در اینجا بزرگی و عظمت مراد است (نگا: روح‌البیان). منظور آیه، این است که: چرا شما در برابر عظمت خدا خاضع نبوده و از او نمی‌ترسید؟]]"
          ],
          "fa.khorramshahi": [
            "شما را چه می‌شود که از عظمت خداوند نمی‌ترسید؟"
          ],
          "fa.makarem": [
            "چرا شما برای خدا عظمت قائل نیستید؟!"
          ],
          "fa.moezzi": [
            "چه شود شما را امید ندارید برای خدا وقاری (شکوهی)"
          ],
          "fa.mojtabavi": [
            "چيست شما را كه خداى را به بزرگى باور نداريد- يا از عظمت خدا نمى‌ترسيد-؟"
          ],
          "fa.sadeqi": [
            "«شما را چه (بیماری) است که هیچ امیدی به وقار و شکوهی برای خدا ندارید؟»"
          ]
        }
      },
      {
        "index": 5433,
        "local_index": 14,
        "part_type": "Verse",
        "path": "/books/quran:71:14",
        "text": [
          "وَ قَدْ خَلَقَکُمْ‌ أَطْوَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "Knowing that He has created you by various stages?"
          ],
          "en.ahmedraza": [
            "‘Whereas it is He Who created you in different stages?’"
          ],
          "en.arberry": [
            "seeing He created you by stages?"
          ],
          "en.daryabadi": [
            "And surely He hath created you by stages."
          ],
          "en.hilali": [
            "While He has created you in (different) stages [i.e. first Nutfah, then 'Alaqah and then Mudghah, see (VV. 23:13, 14) the Quran]."
          ],
          "en.itani": [
            "Although He created you in stages."
          ],
          "en.maududi": [
            "when He has created you in stages?"
          ],
          "en.mubarakpuri": [
            "While He has created you (in) Atwar (stages)."
          ],
          "en.pickthall": [
            "When He created you by (divers) stages?"
          ],
          "en.qarai": [
            "though He has created you in [various] stages?"
          ],
          "en.qaribullah": [
            "He has created you by stages!"
          ],
          "en.sahih": [
            "While He has created you in stages?"
          ],
          "en.sarwar": [
            "who has created you in several stages?"
          ],
          "en.shakir": [
            "And indeed He has created you through various grades:"
          ],
          "en.transliteration": [
            "Waqad khalaqakum a<u>t</u>w<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "when He has created you through different stages of existence?"
          ],
          "en.yusufali": [
            "\"'Seeing that it is He that has created you in diverse stages?"
          ],
          "fa.ansarian": [
            "در حالی که شما را مرحله به مرحله [خاک، نطفه، علقه، مضغه، گوشت، استخوان و...] آفریده است"
          ],
          "fa.ayati": [
            "حال آنكه شما را به گونه‌هاى مختلف بيافريد."
          ],
          "fa.bahrampour": [
            "و حال آنكه شما را به گونه‌هاى مختلف آفريده است"
          ],
          "fa.fooladvand": [
            "و حال آنكه شما را مرحله به مرحله خلق كرده است."
          ],
          "fa.ghomshei": [
            "و حال آنکه او شما را (از نطفه‌ای) به انواع خلقت و اطوار گوناگون (ارمتب آدمیّت) بیافرید."
          ],
          "fa.khorramdel": [
            "در حالی که خدا شما را در مراحل مختلف خلقت به گونه‌های گوناگونی آفریده است (و در هر گام شما را رهبری و هدایت کرده، و به شما لطف و عنایت نموده است). [[«أَطْوَاراً»: جمع طَوْر، حال و وضع. مراحل و حالات (نگا: مؤمنون / 12 و 14).]]"
          ],
          "fa.khorramshahi": [
            "و حال آنکه شما را گونه‌گون آفریده است‌"
          ],
          "fa.makarem": [
            "در حالی که شما را در مراحل مختلف آفرید (تا از نطفه به انسان کامل رسیدید)!"
          ],
          "fa.moezzi": [
            "و هر آینه بیافریدتان گوناگون‌"
          ],
          "fa.mojtabavi": [
            "و حال آنكه شما را گوناگون- به مراحل يا از حالى پس از حالى- آفريده است."
          ],
          "fa.sadeqi": [
            "«و حال آنکه (خدا) شما را به‌راستی گوناگون آفریده است.»"
          ]
        }
      },
      {
        "index": 5434,
        "local_index": 15,
        "part_type": "Verse",
        "path": "/books/quran:71:15",
        "text": [
          "أَ لَمْ‌ تَرَوْا کَيْفَ‌ خَلَقَ‌ اللَّهُ‌ سَبْعَ‌ سَمَاوَاتٍ‌ طِبَاقاً"
        ],
        "translations": {
          "en.ahmedali": [
            "Do you not see how God has fashioned seven skies one above the other,"
          ],
          "en.ahmedraza": [
            "‘Do you not see how Allah has created the seven heavens atop each other?’"
          ],
          "en.arberry": [
            "Have you not regarded how God created seven heavens one upon another,"
          ],
          "en.daryabadi": [
            "Behold ye not in what wise Allah hath created seven heavens in storeys."
          ],
          "en.hilali": [
            "See you not how Allah has created the seven heavens one above another,"
          ],
          "en.itani": [
            "Do you not realize that God created seven heavens in layers?"
          ],
          "en.maududi": [
            "Do you not see how Allah has created seven heavens, one upon the other,"
          ],
          "en.mubarakpuri": [
            "See you not how Allah has created the seven heavens in tiers"
          ],
          "en.pickthall": [
            "See ye not how Allah hath created seven heavens in harmony,"
          ],
          "en.qarai": [
            "Have you not seen how Allah has created the seven heavens in layers,"
          ],
          "en.qaribullah": [
            "Have you not seen how Allah created the seven heavens one above the other,"
          ],
          "en.sahih": [
            "Do you not consider how Allah has created seven heavens in layers"
          ],
          "en.sarwar": [
            "\"Have you not seen that God has created the seven heavens one above the other"
          ],
          "en.shakir": [
            "Do you not see how Allah has created the seven heavens, one above another,"
          ],
          "en.transliteration": [
            "Alam taraw kayfa khalaqa All<u>a</u>hu sabAAa sam<u>a</u>w<u>a</u>tin <u>t</u>ib<u>a</u>q<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Do you not see how God has created the seven heavens one above another,"
          ],
          "en.yusufali": [
            "\"'See ye not how Allah has created the seven heavens one above another,"
          ],
          "fa.ansarian": [
            "آیا ندانسته اید که خدا هفت آسمان را چگونه بر فراز یکدیگر آفرید؟"
          ],
          "fa.ayati": [
            "آيا نمى‌بينيد چگونه خدا هفت آسمان طبقه طبقه را بيافريد؟"
          ],
          "fa.bahrampour": [
            "آيا نديده‌ايد كه چگونه خدا هفت آسمان را بالاى هم آفريد"
          ],
          "fa.fooladvand": [
            "مگر ملاحظه نكرده‌ايد كه چگونه خدا هفت آسمان را تُوبرتُو آفريده است؟"
          ],
          "fa.ghomshei": [
            "آیا ندیدید که خدا چگونه هفت آسمان را به طبقاتی (بسیار منظم و محکم) خلق کرد،"
          ],
          "fa.khorramdel": [
            "مگر نمی‌بینید که خداوند چگونه هفت آسمان را یکی بالای دیگر آفریده است؟ [[«طِبَاقاً»: (نگا: ملک / 3). «سَبْعَ سَمَاوَاتٍ»: (نگا: بقره / 29، اسراء / 44، مؤمنون / 86).]]"
          ],
          "fa.khorramshahi": [
            "آیا نیندیشیده‌اید که خداوند چگونه هفت آسمان را توبرتو آفریده است؟"
          ],
          "fa.makarem": [
            "آیا نمی‌دانید چگونه خداوند هفت آسمان را یکی بالای دیگری آفریده است،"
          ],
          "fa.moezzi": [
            "آیا ندیدید چگونه آفرید خدا هفت آسمان را تودرتو"
          ],
          "fa.mojtabavi": [
            "آيا نديده‌ايد كه خدا هفت آسمان را چگونه مطابق- يا بر- يكديگر آفريد،"
          ],
          "fa.sadeqi": [
            "مگر ندیدید [:ندانستید] (که) چگونه خدا هفت آسمان را طبقاتی بر روی هم آفریده است‌؟»"
          ]
        }
      },
      {
        "index": 5435,
        "local_index": 16,
        "part_type": "Verse",
        "path": "/books/quran:71:16",
        "text": [
          "وَ جَعَلَ‌ الْقَمَرَ فِيهِنَ‌ نُوراً وَ جَعَلَ‌ الشَّمْسَ‌ سِرَاجاً"
        ],
        "translations": {
          "en.ahmedali": [
            "And has placed the moon therein, an illumination, and has placed the sun, a lighted lamp?"
          ],
          "en.ahmedraza": [
            "‘And in them, has illuminated the moon, and made the sun a lamp?’"
          ],
          "en.arberry": [
            "and set the moon therein for a light and the sun for a lamp?"
          ],
          "en.daryabadi": [
            "And hath placed the moon therein for a light, and hath made the sun a lamp?"
          ],
          "en.hilali": [
            "And has made the moon a light therein, and made the sun a lamp?"
          ],
          "en.itani": [
            "And He set the moon in their midst for light, and He made the sun a lamp."
          ],
          "en.maududi": [
            "and has placed the moon in them as a light, and the sun as a radiant lamp?"
          ],
          "en.mubarakpuri": [
            "And has made the moon a light therein, and made the sun a lamp"
          ],
          "en.pickthall": [
            "And hath made the moon a light therein, and made the sun a lamp?"
          ],
          "en.qarai": [
            "and has made therein the moon for a light and the sun for a lamp?"
          ],
          "en.qaribullah": [
            "setting in them the moon as a light and the sun as a lantern?"
          ],
          "en.sahih": [
            "And made the moon therein a [reflected] light and made the sun a burning lamp?"
          ],
          "en.sarwar": [
            "and placed therein the moon as a light"
          ],
          "en.shakir": [
            "And made the moon therein a light, and made the sun a lamp?"
          ],
          "en.transliteration": [
            "WajaAAala alqamara feehinna nooran wajaAAala a<b>l</b>shshamsa sir<u>a</u>j<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and made the moon therein a light, and made the sun a lamp,"
          ],
          "en.yusufali": [
            "\"'And made the moon a light in their midst, and made the sun as a (Glorious) Lamp?"
          ],
          "fa.ansarian": [
            "و ماه را در میان آنها روشنی بخش، و خورشید را چراغ فروزان قرار داد،"
          ],
          "fa.ayati": [
            "و ماه را روشنى آنها، و خورشيد را چراغشان گردانيد."
          ],
          "fa.bahrampour": [
            "و ماه را در ميان آنها روشنى بخش گردانيد و خورشيد را چراغى قرار داد"
          ],
          "fa.fooladvand": [
            "و ماه را در ميان آنها روشنايى‌بخش گردانيد و خورشيد را [چون‌] چراغى قرار داد."
          ],
          "fa.ghomshei": [
            "و در آن آسمانها ماه شب را فروغی تابان و خورشید روز را چراغی فروزان ساخت؟"
          ],
          "fa.khorramdel": [
            "و ماه را در میان آنها تابان، و خورشید را چراغ (درخشان) کرده است؟ [[«نُوراً»: (نگا: یونس / 5). «سِرَاجاً»: (نگا: فرقان / 61).]]"
          ],
          "fa.khorramshahi": [
            "و ماه را در آن پرتوافشان و خورشید را [چون‌] چراغی قرار داده است‌"
          ],
          "fa.makarem": [
            "و ماه را در میان آسمانها مایه روشنایی، و خورشید را چراغ فروزانی قرار داده است؟!"
          ],
          "fa.moezzi": [
            "و گردانید ماه را در آنها نوری و گردانید مهر را چراغی‌"
          ],
          "fa.mojtabavi": [
            "و ماه را در آنها تابان ساخت و خورشيد را چراغ درخشان كرد؟"
          ],
          "fa.sadeqi": [
            "«و ماه را در میانشان روشنایی‌بخش گردانید و خورشید را چراغی (بسی روشن) قرار داد.»"
          ]
        }
      },
      {
        "index": 5436,
        "local_index": 17,
        "part_type": "Verse",
        "path": "/books/quran:71:17",
        "text": [
          "وَ اللَّهُ‌ أَنْبَتَکُمْ‌ مِنَ‌ الْأَرْضِ‌ نَبَاتاً"
        ],
        "translations": {
          "en.ahmedali": [
            "God produced you from the earth like a vegetable growth;"
          ],
          "en.ahmedraza": [
            "‘And it is Allah Who made you grow like vegetation from the earth.’"
          ],
          "en.arberry": [
            "And God caused you to grow out of the earth,"
          ],
          "en.daryabadi": [
            "And Allah hath caused you to grow from the earth as a growth."
          ],
          "en.hilali": [
            "And Allah has brought you forth from the (dust of) earth. [Tafsir At-Tabari, Vol. 29, Page 97]."
          ],
          "en.itani": [
            "And God germinated you from the earth like plants."
          ],
          "en.maududi": [
            "And Allah has caused you to grow out of the earth so wondrously,"
          ],
          "en.mubarakpuri": [
            "And Allah has brought you forth from the (dust of) earth"
          ],
          "en.pickthall": [
            "And Allah hath caused you to grow as a growth from the earth,"
          ],
          "en.qarai": [
            "Allah made you grow from the earth, with a [vegetable] growth."
          ],
          "en.qaribullah": [
            "Allah has caused you to grow out of the earth,"
          ],
          "en.sahih": [
            "And Allah has caused you to grow from the earth a [progressive] growth."
          ],
          "en.sarwar": [
            "and the sun as a torch."
          ],
          "en.shakir": [
            "And Allah has made you grow out of the earth as a growth:"
          ],
          "en.transliteration": [
            "Wa<b>A</b>ll<u>a</u>hu anbatakum mina alar<u>d</u>i nab<u>a</u>t<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "how God has produced you from the earth and caused you to grow,"
          ],
          "en.yusufali": [
            "\"'And Allah has produced you from the earth growing (gradually),"
          ],
          "fa.ansarian": [
            "و خدا شما را از زمین [مانند] گیاهی رویانید،"
          ],
          "fa.ayati": [
            "و خدا شما را چون نباتى از زمين برويانيد."
          ],
          "fa.bahrampour": [
            "و خداست كه شما را [چون گياه‌] به طرز خاصى از زمين رويانيد"
          ],
          "fa.fooladvand": [
            "و خدا[ست كه‌] شما را [مانند] گياهى از زمين رويانيد؛"
          ],
          "fa.ghomshei": [
            "و خدا شما را مانند نباتات مختلف از زمین برویانید."
          ],
          "fa.khorramdel": [
            "خدا است که شما را از زمین به گونه‌ی شگفتی آفریده است. [[«أَنبَتَکُمْ»: شما را رویانده است. مراد از رویاندن، هستی بخشیدن و پدید آوردن است (نگا: حجر / 19). «نَبَاتاً»: (نگا: آل‌عمران / 37).]]"
          ],
          "fa.khorramshahi": [
            "و خداوند شما را مانند گیاهی از زمین رویاند"
          ],
          "fa.makarem": [
            "و خداوند شما را همچون گیاهی از زمین رویانید،"
          ],
          "fa.moezzi": [
            "و خدا رویانید شما را از زمین روئیدنی‌"
          ],
          "fa.mojtabavi": [
            "و خدا شما را از زمين برويانيد روييدنى- چون گياه-."
          ],
          "fa.sadeqi": [
            "«و خدا شما را از زمین رویانید روییدنی (ممتاز).»"
          ]
        }
      },
      {
        "index": 5437,
        "local_index": 18,
        "part_type": "Verse",
        "path": "/books/quran:71:18",
        "text": [
          "ثُمَ‌ يُعِيدُکُمْ‌ فِيهَا وَ يُخْرِجُکُمْ‌ إِخْرَاجاً"
        ],
        "translations": {
          "en.ahmedali": [
            "He will then return you back to it, and bring you out again."
          ],
          "en.ahmedraza": [
            "‘And He will then take you back to it, and again remove you from it.”"
          ],
          "en.arberry": [
            "then He shall return you into it, and bring you forth."
          ],
          "en.daryabadi": [
            "And thereafter He will cause you to return thereinto, and He will bring you forth a forthbringing."
          ],
          "en.hilali": [
            "Afterwards He will return you into it (the earth), and bring you forth (again on the Day of Resurrection)?"
          ],
          "en.itani": [
            "Then He will return you into it, and will bring you out again."
          ],
          "en.maududi": [
            "and He will later cause you to return to it and will then again bring you out of it."
          ],
          "en.mubarakpuri": [
            "Afterwards He will return you into it (the earth), and bring you forth."
          ],
          "en.pickthall": [
            "And afterward He maketh you return thereto, and He will bring you forth again, a (new) forthbringing."
          ],
          "en.qarai": [
            "Then He makes you return to it, and He will bring you forth [without fail]."
          ],
          "en.qaribullah": [
            "and to it He will return you. Then, He will bring you forth."
          ],
          "en.sahih": [
            "Then He will return you into it and extract you [another] extraction."
          ],
          "en.sarwar": [
            "God made you grow from the earth. He will make you return to it and then take you out of it again."
          ],
          "en.shakir": [
            "Then He returns you to it, then will He bring you forth a (new) bringing forth:"
          ],
          "en.transliteration": [
            "Thumma yuAAeedukum feeh<u>a</u> wayukhrijukum ikhr<u>a</u>j<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "how He will then return you to it and bring you forth again,"
          ],
          "en.yusufali": [
            "\"'And in the End He will return you into the (earth), and raise you forth (again at the Resurrection)?"
          ],
          "fa.ansarian": [
            "سپس شما را در آن باز می گرداند و باز به صورتی ویژه بیرون می آورد،"
          ],
          "fa.ayati": [
            "باز شما را بدان باز مى‌گرداند و باز از آن بيرون مى‌آورد."
          ],
          "fa.bahrampour": [
            "سپس شما را در آن باز مى‌گرداند و باز به طرزى عجيب بيرون مى‌آورد"
          ],
          "fa.fooladvand": [
            "سپس شما را در آن بازمى‌گرداند و بيرون مى‌آورد بيرون‌آوردنى [عجيب‌]!"
          ],
          "fa.ghomshei": [
            "آن گاه بار دیگر (پس از مرگ) به زمین باز گرداند و دیگر بار هم شما را (از خاک به روز حساب) برانگیزد."
          ],
          "fa.khorramdel": [
            "سپس شما را به همان زمین بر می‌گرداند، و بعد شما را به گونه‌ی شگفتی (زنده می‌گرداند و) از زمین بیرون می‌آورد. [[«یُخْرِجُکُمْ إِخْراجاً»: ذکر مفعول مطلق، بیانگر غرابت و شگفتی نوع بیرون آوردن و زندگی دوباره بخشیدن است.]]"
          ],
          "fa.khorramshahi": [
            "سپس شما را به آن باز می‌گرداند، و [پس از آن‌] شما را [دوباره‌] بیرون می‌آورد"
          ],
          "fa.makarem": [
            "سپس شما را به همان زمین بازمی‌گرداند، و بار دیگر شما را خارج می‌سازد!"
          ],
          "fa.moezzi": [
            "سپس بازگرداند شما را در آن و برون آورد شما را برون‌آوردنی‌"
          ],
          "fa.mojtabavi": [
            "سپس شما را به آن بازگرداند و باز شما را بيرون آرد بيرون آوردنى- به هنگام رستاخيز-."
          ],
          "fa.sadeqi": [
            "«سپس شما را در آن بازمی‌گرداند و بیرون می‌آورد، برون آوردنی.»"
          ]
        }
      },
      {
        "index": 5438,
        "local_index": 19,
        "part_type": "Verse",
        "path": "/books/quran:71:19",
        "text": [
          "وَ اللَّهُ‌ جَعَلَ‌ لَکُمُ‌ الْأَرْضَ‌ بِسَاطاً"
        ],
        "translations": {
          "en.ahmedali": [
            "God has made the earth for you a spreading,"
          ],
          "en.ahmedraza": [
            "‘And it is Allah Who made the earth a bed for you.’"
          ],
          "en.arberry": [
            "And God has laid the earth for you as a carpet,"
          ],
          "en.daryabadi": [
            "And Allah hath made the earth Unto you an expanse."
          ],
          "en.hilali": [
            "And Allah has made for you the earth wide spread (an expanse)."
          ],
          "en.itani": [
            "And God made the earth a spread for you."
          ],
          "en.maududi": [
            "Allah has made the earth a wide expanse for you"
          ],
          "en.mubarakpuri": [
            "And Allah has made for you the earth a wide expanse."
          ],
          "en.pickthall": [
            "And Allah hath made the earth a wide expanse for you"
          ],
          "en.qarai": [
            "Allah has made the earth a vast expanse for you"
          ],
          "en.qaribullah": [
            "Allah has made the earth spread out for you"
          ],
          "en.sahih": [
            "And Allah has made for you the earth an expanse"
          ],
          "en.sarwar": [
            "God has spread out the earth"
          ],
          "en.shakir": [
            "And Allah has made for you the earth a wide expanse,"
          ],
          "en.transliteration": [
            "Wa<b>A</b>ll<u>a</u>hu jaAAala lakumu alar<u>d</u>a bis<u>ata</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "how God has spread the earth out for you"
          ],
          "en.yusufali": [
            "\"'And Allah has made the earth for you as a carpet (spread out),"
          ],
          "fa.ansarian": [
            "و خدا زمین را برای شما فرشی گسترده قرار داد،"
          ],
          "fa.ayati": [
            "و خدا زمين را چون فرشى برايتان بگسترد،"
          ],
          "fa.bahrampour": [
            "و خدا زمين را براى شما فرشى [گسترده‌] ساخت"
          ],
          "fa.fooladvand": [
            "و خدا زمين را براى شما فرشى [گسترده‌] ساخت،"
          ],
          "fa.ghomshei": [
            "و خدا زمین را برای شما چون بساط (پرنعمت) بگسترانید."
          ],
          "fa.khorramdel": [
            "خداوند زمین را برای شما گسترده و فراخ کرده است. [[«بِسَاطاً»: پهن. گسترده و فراخ.]]"
          ],
          "fa.khorramshahi": [
            "و خداوند زمین را زیرانداز شما کرد"
          ],
          "fa.makarem": [
            "و خداوند زمین را برای شما فرش گسترده‌ای قرار داد..."
          ],
          "fa.moezzi": [
            "و گردانید خدا برای شما زمین را بستری (گسترشی)"
          ],
          "fa.mojtabavi": [
            "و خدا زمين را براى شما بسترى گسترده كرد،"
          ],
          "fa.sadeqi": [
            "«و خدا زمین را برای شما فرشی (گسترده) ساخت.»"
          ]
        }
      },
      {
        "index": 5439,
        "local_index": 20,
        "part_type": "Verse",
        "path": "/books/quran:71:20",
        "text": [
          "لِتَسْلُکُوا مِنْهَا سُبُلاً فِجَاجاً"
        ],
        "translations": {
          "en.ahmedali": [
            "So that you may walk upon its spacious paths.'"
          ],
          "en.ahmedraza": [
            "‘So that you may tread the wide roads in it.’”"
          ],
          "en.arberry": [
            "that thereof you may thread ways, ravines.\""
          ],
          "en.daryabadi": [
            "That of it ye may traverse the ways open."
          ],
          "en.hilali": [
            "That you may go about therein in broad roads."
          ],
          "en.itani": [
            "That you may travel its diverse roads.’”"
          ],
          "en.maududi": [
            "so that you may tread its spacious paths.”"
          ],
          "en.mubarakpuri": [
            "That you may go about therein in broad roads."
          ],
          "en.pickthall": [
            "That ye may thread the valley-ways thereof."
          ],
          "en.qarai": [
            "so that you may travel over its spacious ways.’’ ’"
          ],
          "en.qaribullah": [
            "so that you walk in its spacious paths.'"
          ],
          "en.sahih": [
            "That you may follow therein roads of passage.' \""
          ],
          "en.sarwar": [
            "for you, so that you may walk along its wide roads\"."
          ],
          "en.shakir": [
            "That you may go along therein in wide paths."
          ],
          "en.transliteration": [
            "Litaslukoo minh<u>a</u> subulan fij<u>a</u>j<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "so that you may walk along its spacious paths?\""
          ],
          "en.yusufali": [
            "\"'That ye may go about therein, in spacious roads.'\""
          ],
          "fa.ansarian": [
            "تا از راه ها و جاده های وسیع آن [هر جا که خواستید] بروید؟"
          ],
          "fa.ayati": [
            "تا بر راه‌هاى پهناور آن برويد."
          ],
          "fa.bahrampour": [
            "تا در راه‌هاى وسيع آن تردّد كنيد"
          ],
          "fa.fooladvand": [
            "تا در راههاى فراخ آن برويد.»"
          ],
          "fa.ghomshei": [
            "تا در زمین راههای مختلف وسیع بپیمایید."
          ],
          "fa.khorramdel": [
            "تا از جاده‌های وسیع آن بگذرید. [[«فِجَاج»: جمع فَجّ، راههای فراخ و جاده‌های گشاد (نگا: انبیاء / 31).]]"
          ],
          "fa.khorramshahi": [
            "تا به شاهراههای گشاده آن راه یابید"
          ],
          "fa.makarem": [
            "تا از راههای وسیع و دره‌های آن بگذرید (و به هر جا می‌خواهید بروید)!»"
          ],
          "fa.moezzi": [
            "تا بروید در آن راه‌هائی گشوده (شکافته)"
          ],
          "fa.mojtabavi": [
            "تا از آن به راه‌هاى فراخ- گشاده يا مختلف- برويد."
          ],
          "fa.sadeqi": [
            "«تا از راه‌های فراخ و پست و بلند آن راهوار راه یابید.»"
          ]
        }
      },
      {
        "index": 5440,
        "local_index": 21,
        "part_type": "Verse",
        "path": "/books/quran:71:21",
        "text": [
          "قَالَ‌ نُوحٌ‌ رَبِ‌ إِنَّهُمْ‌ عَصَوْنِي‌ وَ اتَّبَعُوا مَنْ‌ لَمْ‌ يَزِدْهُ‌ مَالُهُ‌ وَ وَلَدُهُ‌ إِلاَّ خَسَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "But they did not listen to me,\" Noah said, \"and followed him whose wealth and children only added to his ruin."
          ],
          "en.ahmedraza": [
            "Prayed Nooh, “O my Lord! They have disobeyed me, and they follow the one whose wealth and children increase nothing for him except ruin.”"
          ],
          "en.arberry": [
            "Noah said, 'My Lord, they have rebelled against me, and followed him whose wealth and children increase him only in loss,"
          ],
          "en.daryabadi": [
            "Nuh said. my Lord! verily they have disobeyed me and followed them whose riches and children have only increased them in loss."
          ],
          "en.hilali": [
            "Nuh (Noah) said: \"My Lord! They have disobeyed me, and followed one whose wealth and children give him no increase but only loss."
          ],
          "en.itani": [
            "Noah said, “My Lord, they have defied me, and followed him whose wealth and children increase him only in perdition.”"
          ],
          "en.maududi": [
            "Noah said: “My Lord, they did not pay heed to what I said, and followed those (nobles) whose possession of wealth and children has led them to an even greater loss."
          ],
          "en.mubarakpuri": [
            "Nuh said: \"My Lord! They have disobeyed me, and followed one whose wealth and children give him no increase but loss.\""
          ],
          "en.pickthall": [
            "Noah said: My Lord! Lo! they have disobeyed me and followed one whose wealth and children increase him in naught save ruin;"
          ],
          "en.qarai": [
            "Noah said, ‘My Lord! They have disobeyed me, following someone whose wealth and children only add to his loss,"
          ],
          "en.qaribullah": [
            "Noah said: 'My Lord, they have rebelled against me and followed he whose wealth and offspring increase him only in loss,"
          ],
          "en.sahih": [
            "Noah said, \"My Lord, indeed they have disobeyed me and followed him whose wealth and children will not increase him except in loss."
          ],
          "en.sarwar": [
            "Noah said, \"Lord, they have disobeyed me and followed those whose wealth and children will only bring about destruction for them."
          ],
          "en.shakir": [
            "Nuh said: My Lord! surely they have disobeyed me and followed him whose wealth and children have added to him nothing but loss."
          ],
          "en.transliteration": [
            "Q<u>a</u>la noo<u>h</u>un rabbi innahum AAa<u>s</u>awnee wa<b>i</b>ttabaAAoo man lam yazidhu m<u>a</u>luhu wawaladuhu ill<u>a</u> khas<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Noah supplicated, \"Lord, they have disobeyed me, and followed those whose wealth and children have only added to their ruin;"
          ],
          "en.yusufali": [
            "Noah said: \"O my Lord! They have disobeyed me, but they follow (men) whose wealth and children give them no increase but only Loss."
          ],
          "fa.ansarian": [
            "نوح گفت: پروردگارا! آنان از من نافرمانی کردند و از کسانی [چون سردمداران کفر و متولیان بتخانه] پیروی نمودند که اموال و فرزندانشان جز خسارت و زیانی بر آنان نیفزود!"
          ],
          "fa.ayati": [
            "نوح گفت: اى پروردگار من، آنها فرمان من نبردند، و از كسى پيروى كردند كه مال و فرزندش جز به زيانش نيفزود."
          ],
          "fa.bahrampour": [
            "نوح گفت: پروردگارا! آنها مرا نافرمانى كردند و كسى را پيروى نمودند كه مال و فرزندش جز بر زيانكارى وى نيفزود"
          ],
          "fa.fooladvand": [
            "نوح گفت: «پروردگارا، آنان نافرمانى من كردند و كسى را پيروى نمودند كه مال و فرزندش جز بر زيان وى نيفزود."
          ],
          "fa.ghomshei": [
            "نوح گفت: پروردگارا (با این همه تبلیغ و دعوت و اتمام حجت باز) این قوم مرا مخالفت کردند و پیرو کسی (از ثروتمندان) شدند که او خود مال و فرزندش هم جز بر زیانش نیفزود."
          ],
          "fa.khorramdel": [
            "نوح (بعد از یأس و نومیدی از ایشان به آستان الهی عرضه داشت و) گفت: پروردگارا! آنان از من نافرمانی کرده‌اند، و از کسانی پیروی نموده‌اند که اموال و اولادشان جز زیان و خسران (برای ایشان پدید نیاورده است و) بر آنان نیفزوده است. [[«عَصَوْنِی»: از من نافرمانی کرده‌اند. «مَنْ»: مراد رؤساء و اغنیاء است که ضعفاء و فقراء به فرمانشان گوش می‌دادند و بدیشان امید می‌بستند. رؤساء و اغنیائی که قدرت مادی ایشان مایه زیان و بدبختی خودشان شده بود. چرا که اندوختن اموال از راه حرام، مصرف آن در فساد، به وجود آوردن فرزندان بی‌دین و ناصالح، سرکشی و طغیان در برابر فرمان یزدان، و تحمیل افکار هیچ و پوچ خود بر توده‌های مستضعف، جز زیان و خسران نیست.]]"
          ],
          "fa.khorramshahi": [
            "نوح گفت پروردگارا آنان از من نافرمانی کردند و از کسی که مال و فرزندش جز به زیانکاریش نیفزوده است، پیروی کردند"
          ],
          "fa.makarem": [
            "نوح (بعد از نومیدی از هدایت آنان) گفت: «پروردگارا! آنها نافرمانی من کردند و از کسانی پیروی نمودند که اموال و فرزندانشان چیزی جز زیانکاری بر آنها نیفزوده است!"
          ],
          "fa.moezzi": [
            "گفت نوح پروردگارا اینان عصیانم کردند و پیروی کردند آن را که نیفزودش مالش و فرزندش به جز زیانی‌"
          ],
          "fa.mojtabavi": [
            "نوح گفت: پروردگارا، اينان مرا نافرمانى كردند و از كسى پيروى كردند كه وى را مال و فرزندانش جز زيانكارى نيفزود."
          ],
          "fa.sadeqi": [
            "نوح گفت: «پروردگارم! آنان مرا نافرمانی کردند و کسی را پیروی نمودند که مال و فرزندش جز بر زیان وی نیفزود.»"
          ]
        }
      },
      {
        "index": 5441,
        "local_index": 22,
        "part_type": "Verse",
        "path": "/books/quran:71:22",
        "text": [
          "وَ مَکَرُوا مَکْراً کُبَّاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And they contrived a plot of great magnitude,"
          ],
          "en.ahmedraza": [
            "“And they carried out a very sinister scheme.”"
          ],
          "en.arberry": [
            "and have devised a mighty device"
          ],
          "en.daryabadi": [
            "And who have plotted a tremendous plot"
          ],
          "en.hilali": [
            "\"And they have plotted a mighty plot."
          ],
          "en.itani": [
            "And they schemed outrageous schemes."
          ],
          "en.maududi": [
            "They contrived a plot of great magnitude."
          ],
          "en.mubarakpuri": [
            "\"And they have plotted a mighty plot.\""
          ],
          "en.pickthall": [
            "And they have plotted a mighty plot,"
          ],
          "en.qarai": [
            "and they have devised an outrageous plot."
          ],
          "en.qaribullah": [
            "they have devised a mighty plot,"
          ],
          "en.sahih": [
            "And they conspired an immense conspiracy."
          ],
          "en.sarwar": [
            "They have arrogantly plotted evil plans against me,"
          ],
          "en.shakir": [
            "And they have planned a very great plan."
          ],
          "en.transliteration": [
            "Wamakaroo makran kubb<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and they have hatched a mighty plot,"
          ],
          "en.yusufali": [
            "\"And they have devised a tremendous Plot."
          ],
          "fa.ansarian": [
            "و [این پیشوایان گمراهی، برای گمراه نگاه داشتن این مردم] نیرنگی بزرگ به کار گرفتند،"
          ],
          "fa.ayati": [
            "مكر كردند - مكرى بزرگ."
          ],
          "fa.bahrampour": [
            "و دست به نيرنگى بس بزرگ زدند"
          ],
          "fa.fooladvand": [
            "و دست به نيرنگى بس بزرگ زدند."
          ],
          "fa.ghomshei": [
            "و (بر ضد من) بزرگترین مکر و حیله به کار بردند."
          ],
          "fa.khorramdel": [
            "(چنین رهبران گمراهی) نیرنگ بزرگی به کار برده‌اند. [[«کُبَّاراً»: بزرگ. صیغه مبالغه است.]]"
          ],
          "fa.khorramshahi": [
            "و نیرنگی سترگ در کار آوردند"
          ],
          "fa.makarem": [
            "و (این رهبران گمراه) مکر عظیمی به کار بردند..."
          ],
          "fa.moezzi": [
            "و نیرنگ آوردند نیرنگ گرانی‌"
          ],
          "fa.mojtabavi": [
            "و نيرنگ ساختند نيرنگى بزرگ- در دين خدا، يا در هلاكت من-."
          ],
          "fa.sadeqi": [
            "«و دست به نیرنگی بس بزرگ زدند؛»"
          ]
        }
      },
      {
        "index": 5442,
        "local_index": 23,
        "part_type": "Verse",
        "path": "/books/quran:71:23",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:3:4:84:1"
          ]
        },
        "text": [
          "وَ قَالُوا لاَ تَذَرُنَ‌ آلِهَتَکُمْ‌ وَ لاَ تَذَرُنَ‌ وَدّاً وَ لاَ سُوَاعاً وَ لاَ يَغُوثَ‌ وَ يَعُوقَ‌ وَ نَسْراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And said: 'Do not abandon your gods, and do not abandon Wadda or Suwa', or Yaghuth, Ya'uq or Nasr.'"
          ],
          "en.ahmedraza": [
            "“And they said, ‘Do not ever abandon your Gods – and never abandon Wadd, or Suwa – or Yaghuth or Yauq or Nasr.’”"
          ],
          "en.arberry": [
            "and have said, \"Do not leave your gods, and do not leave Wadd, nor Suwa', Yaghuth, Ya'uq, neither Nasr.\""
          ],
          "en.daryabadi": [
            "And who have said: ye shall not leave your gods; nor Shall ye leave Wadd nor Suwa', nor Yaghuth, nor Ya'uq nor Nasr."
          ],
          "en.hilali": [
            "\"And they have said: 'You shall not leave your gods, nor shall you leave Wadd, nor Suwa', nor Yaghuth, nor Ya'uq, nor Nasr (names of the idols);"
          ],
          "en.itani": [
            "And they said, “Do not give up your gods; do not give up Wadd, nor Souwa, nor Yaghoos, and Yaooq, and Nassr."
          ],
          "en.maududi": [
            "They said: “Do not abandon your deities; do not abandon Wadd, nor Suwa, nor Yaghuth, nor Yauq, nor Nasr."
          ],
          "en.mubarakpuri": [
            "\"And they have said: `You shall not leave your gods, nor shall you leave Wadd, nor Suwa`, nor Yaghuth, and Ya`uq and Nasr.' \""
          ],
          "en.pickthall": [
            "And they have said: Forsake not your gods. Forsake not Wadd, nor Suwa', nor Yaghuth and Ya'uq and Nasr."
          ],
          "en.qarai": [
            "They say, ‘‘Do not abandon your gods. Do not abandon Wadd, nor Suwa, nor Yaghuth, Ya‘uq and Nasr,’’"
          ],
          "en.qaribullah": [
            "and said: 'Do not renounce your gods, do not leave waddan or suwa'an or yaghutha, or ya'uqa, or nasra'"
          ],
          "en.sahih": [
            "And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr."
          ],
          "en.sarwar": [
            "and have said to each other, 'Do not give-up your idols. Do not renounce Wadd, Suwa`, Yaghuth, Ya`uq and Nasr (names of certain idols)."
          ],
          "en.shakir": [
            "And they say: By no means leave your gods, nor leave Wadd, nor Suwa; nor Yaghus, and Yauq and Nasr."
          ],
          "en.transliteration": [
            "Waq<u>a</u>loo l<u>a</u> ta<u>th</u>arunna <u>a</u>lihatakum wal<u>a</u> ta<u>th</u>arunna waddan wal<u>a</u> suw<u>a</u>AAan wal<u>a</u> yaghootha wayaAAooqa wanasr<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and they said [to their followers], \"Do not ever abandon your deities: abandon neither Wadd, nor Suwa', and neither Yaghuth, nor Yauq nor Nasr!\""
          ],
          "en.yusufali": [
            "\"And they have said (to each other), 'Abandon not your gods: Abandon neither Wadd nor Suwa', neither Yaguth nor Ya'uq, nor Nasr';-"
          ],
          "fa.ansarian": [
            "و گفتند: دست از معبودانتان بر ندارید، و هرگز [بت های] وَدّ و سواع و یغوث و یعوق و نسر را رها نکنید؛"
          ],
          "fa.ayati": [
            "و گفتند: خدايانتان را وامگذاريد. وَدّ و سُواع و يَغوث و يَعوق و نَسر را ترك مكنيد."
          ],
          "fa.bahrampour": [
            "و گفتند: زنهار، خدايان خود را رها مكنيد، و هرگز «ودّ» و «سواع» و «يغوث» و «يعوق» و «نسر» را وانگذاريد"
          ],
          "fa.fooladvand": [
            "و گفتند: زنهار، خدايان خود را رها مكنيد، و نه «وَدّ» را واگذاريد و نه «سُواع» و نه «يَغُوث» و نه «يَعُوق» و نه «نَسْر» را."
          ],
          "fa.ghomshei": [
            "و گفتند: هرگز خدایان خود را رها نکنید و به خصوص دست از پرستش (این پنج بت) ودّ و سواع و یغوث و یعوق و نسر هرگز برمدارید."
          ],
          "fa.khorramdel": [
            "به آنان گفته‌اند: معبودهای خود را وامگذارید، و وَدّ، سُواع، یَغوث، یعوق، و نَسر را رها نسازید. [[«وَدّ»: وَدّ، سُواع، یَغوث، یَعوق، نَسر، پنج بتی بوده‌اند که از سایر بتها در نزد بت‌پرستان مشهورتر و بزرگتر بودند. گویا هر یک از اینها نام انسان خداشناس و صالحی بوده و بعد از فوت آنان، گنبدها و بارگاهها بر سر قبر ایشان برپا نموده و بعدها بتشان ساخته، و واسطه و شفیعشان شمرده‌اند (نگا: المصحف المیسّر).]]"
          ],
          "fa.khorramshahi": [
            "و گفتند نه هرگز دست از خدایانتان و نه هرگز دست از ود و سواع و یغوث و یعوق و نسر بردارید"
          ],
          "fa.makarem": [
            "و گفتند: دست از خدایان و بتهای خود برندارید (به خصوص) بتهای «وَد»، «سواع»، «یغوث»، «یعوق» و «نسر» را رها نکنید!"
          ],
          "fa.moezzi": [
            "و گفتند رها نکنید خدایان خویش را و رها نکنید وَد را و نه سُواع را و نه یغوث را و نه یَعوق را و نه نَسر را"
          ],
          "fa.mojtabavi": [
            "و گفتند: خدايانتان را وامگذاريد، و وَدّ و سُواع و يَغوث و يَعوق و نَسر را رها مكنيد."
          ],
          "fa.sadeqi": [
            "«و گفتند: “زنهار! خدایان خود را رها مکنید و نه هرگز ودّ را و نه سواع و نه یغوث و یعوق و نسر را.”»"
          ]
        }
      },
      {
        "index": 5443,
        "local_index": 24,
        "part_type": "Verse",
        "path": "/books/quran:71:24",
        "text": [
          "وَ قَدْ أَضَلُّوا کَثِيراً وَ لاَ تَزِدِ الظَّالِمِينَ‌ إِلاَّ ضَلاَلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "And they misled many. So do not give the evil-doers increase but in error."
          ],
          "en.ahmedraza": [
            "“And they have misled a large number; and (I pray that) You increase nothing for the unjust except error.”"
          ],
          "en.arberry": [
            "And they have led many astray. Increase Thou not the evildoers save in error!'"
          ],
          "en.daryabadi": [
            "And surely they have misled many. And increase Thou these wrong-doers in naught save error."
          ],
          "en.hilali": [
            "\"And indeed they have led many astray. And (O Allah): 'Grant no increase to the Zalimun (polytheists, wrong-doers, and disbelievers, etc.) save error.\""
          ],
          "en.itani": [
            "They have misled many, so do not increase the wrongdoers except in confusion.”"
          ],
          "en.maududi": [
            "They have misled many. So do not enable these evildoers to increase in anything except straying (from the Right Way).”"
          ],
          "en.mubarakpuri": [
            "\"And indeed they have led many astray. And (O Allah): `Grant no increase to the wrongdoers save error.\"'"
          ],
          "en.pickthall": [
            "And they have led many astray, and Thou increasest the wrong-doers in naught save error."
          ],
          "en.qarai": [
            "and already they have led many astray. Do not increase the wrongdoers in anything but error.’"
          ],
          "en.qaribullah": [
            "And they have led many astray. (Noah supplicated saying): 'Allah, do not increase the harmdoers except in error'"
          ],
          "en.sahih": [
            "And already they have misled many. And, [my Lord], do not increase the wrongdoers except in error.\""
          ],
          "en.sarwar": [
            "They have misled many and the unjust will achieve nothing but more error\"."
          ],
          "en.shakir": [
            "And indeed they have led astray many, and do not increase the unjust in aught but error."
          ],
          "en.transliteration": [
            "Waqad a<u>d</u>alloo katheeran wal<u>a</u> tazidi a<b>l</b><i><u>thth</u></i><u>a</u>limeena ill<u>a</u> <u>d</u>al<u>a</u>l<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "They have led many astray; so lead the wrongdoers to further error.\""
          ],
          "en.yusufali": [
            "\"They have already misled many; and grant Thou no increase to the wrong-doers but in straying (from their mark).\""
          ],
          "fa.ansarian": [
            "همانا بسیاری را گمراه کردند. و [پروردگارا!] ستمکاران را جز گمراهی میفزا."
          ],
          "fa.ayati": [
            "بسيارى را گمراه كردند و تو جز بر گمراهى ستمكاران ميفزاى."
          ],
          "fa.bahrampour": [
            "و تحقيقا بسيارى را گمراه كردند. و [بار خدايا!] ظالمان را جز ضلالت ميفزاى"
          ],
          "fa.fooladvand": [
            "و بسيارى را گمراه كرده‌اند. [بار خدايا،] جز بر گمراهى ستمكاران ميفزاى.»"
          ],
          "fa.ghomshei": [
            "و آنها بسیاری از خلق را گمراه کردند، و تو ستمکاران را هیچ جز بر ضلالت و عذابشان میفزای."
          ],
          "fa.khorramdel": [
            "و بدین وسیله بسیاری از مردم را گمراه ساخته‌اند! (پروردگارا! این خودخواهان گمراهند گمراه‌ترشان گردان) و جز گمراهی بر ستمکاران میفزا! [[«لا تَزِدْ»: جملات پیشین جنبه مقدّمه دعا دارد، و در اینجا حضرت نوح از خداوند متعال درخواست می‌نماید از کافران خودخواه و گمراه سلب توفیق بفرماید و بر بدبختی ایشان بیفزاید.]]"
          ],
          "fa.khorramshahi": [
            "و بسیاری را بیراه کردند و جز بر بیراهی ستمکاران [مشرک‌] میفزای‌"
          ],
          "fa.makarem": [
            "و آنها گروه بسیاری را گمراه کردند! خداوندا، ظالمان را جز ضلالت میفزا!»"
          ],
          "fa.moezzi": [
            "و به درست گمراه کردند بیشی را و نیفزای ستمگران را جز گمراهی‌"
          ],
          "fa.mojtabavi": [
            "و براستى كه بسيارى را گمراه كردند، و [بار خدايا،] ستمكاران- يعنى كافران- را جز گمراهى ميفزاى."
          ],
          "fa.sadeqi": [
            "«و بسیاری را همواره گمراه کرده‌اند و جز بر گمراهی ستمکاران میفزای.»"
          ]
        }
      },
      {
        "index": 5444,
        "local_index": 25,
        "part_type": "Verse",
        "path": "/books/quran:71:25",
        "text": [
          "مِمَّا خَطِيئَاتِهِمْ‌ أُغْرِقُوا فَأُدْخِلُوا نَاراً فَلَمْ‌ يَجِدُوا لَهُمْ‌ مِنْ‌ دُونِ‌ اللَّهِ‌ أَنْصَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "They were drowned because of their habitual sinfulness, and sent to Hell, and did not find any helper other than God."
          ],
          "en.ahmedraza": [
            "Because of their sins they were drowned and then put into the fire; so they did not find any supporter for themselves against Allah. (Punishment in the grave is proven by this verse.)"
          ],
          "en.arberry": [
            "And because of their transgressions they were drowned, and admitted into a Fire, for they found not, apart from God, any to help them."
          ],
          "en.daryabadi": [
            "And because of their misdeeds they were drowned, and then they were made to enter a Fire. Then they found not for themselves, beside Allah, any helpers."
          ],
          "en.hilali": [
            "Because of their sins they were drowned, then were made to enter the Fire, and they found none to help them instead of Allah."
          ],
          "en.itani": [
            "Because of their wrongs, they were drowned, and were hurled into a Fire. They did not find apart from God any helpers."
          ],
          "en.maududi": [
            "And so they were drowned on account of their sins, and then cast into the Fire, and did not find any other than Allah, to come forth to their help."
          ],
          "en.mubarakpuri": [
            "Because of their sins they were drowned, then were made to enter the Fire. And they found none to help them instead of Allah."
          ],
          "en.pickthall": [
            "Because of their sins they were drowned, then made to enter a Fire. And they found they had no helpers in place of Allah."
          ],
          "en.qarai": [
            "They were drowned because of their iniquities, then made to enter a Fire, and they did not find any helpers for themselves besides Allah."
          ],
          "en.qaribullah": [
            "So because of their sins they were drowned and admitted into the Fire. They found none to help them other than Allah."
          ],
          "en.sahih": [
            "Because of their sins they were drowned and put into the Fire, and they found not for themselves besides Allah [any] helpers."
          ],
          "en.sarwar": [
            "Because of their sins, they were drowned and made to enter hell. They could find no one to help them besides God."
          ],
          "en.shakir": [
            "Because of their wrongs they were drowned, then made to enter fire, so they did not find any helpers besides Allah."
          ],
          "en.transliteration": [
            "Mimm<u>a</u> kha<u>t</u>ee<u>a</u>tihim oghriqoo faodkhiloo n<u>a</u>ran falam yajidoo lahum min dooni All<u>a</u>hi an<u>sa</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "They were drowned and sent to Hell for their misdeeds; they found no one to help them against God."
          ],
          "en.yusufali": [
            "Because of their sins they were drowned (in the flood), and were made to enter the Fire (of Punishment): and they found- in lieu of Allah- none to help them."
          ],
          "fa.ansarian": [
            "[همه آنان] به سبب گناهانشان غرق شدند و بی درنگ در آتشی درآورده شدند که [از آن] در برابر خدا برای خود یاورانی نیافتند،"
          ],
          "fa.ayati": [
            "به كيفر گناهانشان غرقه شدند و به آتش رفتند و جز خدا براى خود يارى نيافتند."
          ],
          "fa.bahrampour": [
            "[تا] در اثر گناهانشان غرقه گشتند و در آتش در آورده شدند، پس براى خود، در برابر خدا هيچ ياورى نيافتند"
          ],
          "fa.fooladvand": [
            "[تا] به سبب گناهانشان غرقه گشتند و [پس از مرگ‌] در آتشى درآورده شدند و براى خود، در برابر خدا يارانى نيافتند."
          ],
          "fa.ghomshei": [
            "آن قوم از کثرت کفر و گناه عاقبت به آب دریا غرق شدند و به آتش دوزخ در افتادند و جز خدا بر خود هیچ یار و یاری نیافتند."
          ],
          "fa.khorramdel": [
            "(سرانجام، همگی) به خاطر گناهانشان (در طوفان) غرق شدند، و به دوزخ در افتادند، و جز خدا برای خود یار و یاوری نیافتند (که بتواند از ایشان دفاع کند و از دوزخشان برهاند). [[«مِمَّا»: بر اثرِ. به خاطرِ. حرف (مِنْ) سببیّه است، و واژه (ما) را بعضی زائد دانسته، و برخی مصدریّه گرفته‌اند، و گروهی مجرور به حرف جرّ شمرده، و (خَطِیئَاتِ) را بدل آن حساب کرده‌اند. به هر حال بیانگر بزرگی گناهان و بزهکاریهای کافران، و تأکید علّت و سبب است. «مِن دُونِ اللهِ»: بجز خدا. سوای خدا. معلوم است که خدا هم یار و یاورشان نبوده و نخواهد بود.]]"
          ],
          "fa.khorramshahi": [
            "بر اثر گناهانشان بود که به غرق کشیده شدند، سپس به آتشی درآورده شدند و برای خود در برابر خداوند یاوری نیافتند"
          ],
          "fa.makarem": [
            "(آری، سرانجام) همگی بخاطر گناهانشان غرق شدند و در آتش دوزخ وارد گشتند، و جز خدا یاورانی برای خود نیافتند!"
          ],
          "fa.moezzi": [
            "پس از گناهانشان غرق شدند پس درآورده شدند آتشی را و نیافتند برای خویش جز از خدا یارانی‌"
          ],
          "fa.mojtabavi": [
            "به سزاى گناهانشان غرق شدند- به طوفان- و به آتشى- آتش دوزخ- درآورده شدند، پس به جاى خدا براى خود هيچ ياورانى نيافتند."
          ],
          "fa.sadeqi": [
            "از (اثر) گناهانشان غرق گشتند ، پس (همان جا) داخل آتش شدند، پس برای خودشان از غیر خدا یارانی نیافتند."
          ]
        }
      },
      {
        "index": 5445,
        "local_index": 26,
        "part_type": "Verse",
        "path": "/books/quran:71:26",
        "text": [
          "وَ قَالَ‌ نُوحٌ‌ رَبِ‌ لاَ تَذَرْ عَلَى‌ الْأَرْضِ‌ مِنَ‌ الْکَافِرِينَ‌ دَيَّاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "Noah said: \"O Lord, do not leave a single habitation of unbelievers on the earth."
          ],
          "en.ahmedraza": [
            "And prayed Nooh, “O my Lord! Do not leave any of the disbelievers dwelling in the land.”"
          ],
          "en.arberry": [
            "And Noah said, 'My Lord, leave not upon the earth of the unbelievers even one."
          ],
          "en.daryabadi": [
            "And Nuh said: my Lord! leave not upon the earth of the infidels one inhabitant."
          ],
          "en.hilali": [
            "And Nuh (Noah) said: \"My Lord! Leave not one of the disbelievers on the earth!"
          ],
          "en.itani": [
            "Noah said, “My Lord, do not leave of the unbelievers a single dweller on earth."
          ],
          "en.maududi": [
            "Noah said: “My Lord, do not leave out of these unbelievers even a single dweller on earth,"
          ],
          "en.mubarakpuri": [
            "And Nuh said: \"My Lord! Leave not one of the disbelievers on the earth Dayyar!\""
          ],
          "en.pickthall": [
            "And Noah said: My Lord! Leave not one of the disbelievers in the land."
          ],
          "en.qarai": [
            "And Noah said, ‘My Lord! ‘Do not leave on the earth any inhabitant from among the faithless."
          ],
          "en.qaribullah": [
            "And Noah (supplicated) saying: 'My Lord, do not leave a single unbeliever upon the earth."
          ],
          "en.sahih": [
            "And Noah said, \"My Lord, do not leave upon the earth from among the disbelievers an inhabitant."
          ],
          "en.sarwar": [
            "Noah said, \"Lord, do not leave a single disbeliever on earth;"
          ],
          "en.shakir": [
            "And Nuh said: My Lord! leave not upon the land any dweller from among the unbelievers:"
          ],
          "en.transliteration": [
            "Waq<u>a</u>la noo<u>h</u>un rabbi l<u>a</u> ta<u>th</u>ar AAal<u>a</u> alar<u>d</u>i mina alk<u>a</u>fireena dayy<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Noah prayed, \"O my Lord! Do not leave on earth a single one of those who deny the truth --"
          ],
          "en.yusufali": [
            "And Noah, said: \"O my Lord! Leave not of the Unbelievers, a single one on earth!"
          ],
          "fa.ansarian": [
            "و نوح گفت: پروردگارا! هیچ یک از کافران را بر روی زمین باقی مگذار"
          ],
          "fa.ayati": [
            "و نوح گفت: اى پروردگار من، بر روى زمين هيچ يك از كافران را مگذار،"
          ],
          "fa.bahrampour": [
            "و نوح گفت: پروردگارا! احدى از كافران را بر روى زمين باقى مگذار"
          ],
          "fa.fooladvand": [
            "و نوح گفت: «پروردگارا، هيچ كس از كافران را بر روى زمين مگذار،"
          ],
          "fa.ghomshei": [
            "و نوح عرض کرد: پروردگارا از این کافران دیّاری بر روی زمین باقی مگذار."
          ],
          "fa.khorramdel": [
            "نوح (به دعای خود ادامه داد و) گفت: پروردگارا! هیچ احدی از کافران را بر روی زمین زنده باقی مگذار. [[«دَیَّاراً»: کسی. فردی. در اصل به معنی کسی است که بیاید و برود و بگردد و بچرخد. یعنی جنبنده انسان نامی.]]"
          ],
          "fa.khorramshahi": [
            "و نوح گفت پروردگارا بر روی زمین از کافران دیاری باقی مگذار"
          ],
          "fa.makarem": [
            "نوح گفت: «پروردگارا! هیچ یک از کافران را بر روی زمین باقی مگذار!"
          ],
          "fa.moezzi": [
            "و گفت نوح پروردگارا نگذار بر زمین از کافران دیّاری‌"
          ],
          "fa.mojtabavi": [
            "و نوح گفت: پروردگارا، بر روى زمين از اين كافران هيچ كسى را مگذار،"
          ],
          "fa.sadeqi": [
            "و نوح گفت: «پروردگارم! هیچ کس از کافران را بر روی زمین باقی مگذار.»"
          ]
        }
      },
      {
        "index": 5446,
        "local_index": 27,
        "part_type": "Verse",
        "path": "/books/quran:71:27",
        "text": [
          "إِنَّکَ‌ إِنْ‌ تَذَرْهُمْ‌ يُضِلُّوا عِبَادَکَ‌ وَ لاَ يَلِدُوا إِلاَّ فَاجِراً کَفَّاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "If you leave them, they will lead Your creatures astray, and beget but iniquitous and ungrateful offspring."
          ],
          "en.ahmedraza": [
            "“Indeed, if You spare them, they will mislead your bondmen – and their descendants, if any, will be none except the wicked, very ungrateful.”"
          ],
          "en.arberry": [
            "Surely, if Thou leavest them, they will lead Thy servants astray, and will beget none but unbelieving libertines."
          ],
          "en.daryabadi": [
            "Verily if Thou shouldst leave them, they Will mislead Thine bondmen and will beget not save sinning infidels,"
          ],
          "en.hilali": [
            "\"If You leave them, they will mislead Your slaves, and they will beget none but wicked disbelievers.\""
          ],
          "en.itani": [
            "If You leave them, they will mislead your servants, and will breed only wicked unbelievers."
          ],
          "en.maududi": [
            "for certainly if You should leave them (alive), they will mislead Your servants, and will beget none but sinners and utter unbelievers."
          ],
          "en.mubarakpuri": [
            "\"If You leave them, they will mislead Your servants, and they will beget none but wicked disbelievers.\""
          ],
          "en.pickthall": [
            "If Thou shouldst leave them, they will mislead Thy slaves and will beget none save lewd ingrates."
          ],
          "en.qarai": [
            "If You leave them, they will lead astray Your servants, and will beget none except vicious ingrates."
          ],
          "en.qaribullah": [
            "Surely, if You leave them they will mislead Your worshipers and father none but the immoral, and unbelievers."
          ],
          "en.sahih": [
            "Indeed, if You leave them, they will mislead Your servants and not beget except [every] wicked one and [confirmed] disbeliever."
          ],
          "en.sarwar": [
            "if You do, they will mislead Your servants and will only give birth to ungrateful sinners."
          ],
          "en.shakir": [
            "For surely if Thou leave them they will lead astray Thy servants, and will not beget any but immoral, ungrateful (children)"
          ],
          "en.transliteration": [
            "Innaka in ta<u>th</u>arhum yu<u>d</u>illoo AAib<u>a</u>daka wal<u>a</u> yalidoo ill<u>a</u> f<u>a</u>jiran kaff<u>a</u>r<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "if You leave any, they will misguide Your servants, and they will beget none but sinners and deniers of truth --"
          ],
          "en.yusufali": [
            "\"For, if Thou dost leave (any of) them, they will but mislead Thy devotees, and they will breed none but wicked ungrateful ones."
          ],
          "fa.ansarian": [
            "که اگر آنان را باقی گذاری، بندگانت را گمراه می کنند و جز نسلی بدکار و ناسپاس زاد و ولد نمی کنند."
          ],
          "fa.ayati": [
            "كه اگر بگذاريشان، بندگانت را گمراه مى‌كنند و جز فرزندانى فاجر و كافر نياورند."
          ],
          "fa.bahrampour": [
            "كه اگر تو آنها را باقى گذارى، بندگانت را گمراه مى‌كنند و جز پليدكار ناسپاس نمى‌زايند"
          ],
          "fa.fooladvand": [
            "چرا كه اگر تو آنان را باقى گذارى، بندگانت را گمراه مى‌كنند و جز پليدكار ناسپاس نزايند."
          ],
          "fa.ghomshei": [
            "که اگر از آنها هر که را باقی گذاری بندگان (پاک با ایمان) تو را گمراه می‌کنند و فرزندی هم جز بدکار و کافر از آنان به ظهور نمی‌رسد."
          ],
          "fa.khorramdel": [
            "که اگر ایشان را رها کنی، بندگانت را گمراه می‌سازند، و جز فرزندان بزهکار و کافرِ سرسخت نمی‌زایند و به دنیا نمی‌آورند. [[«کَفَّاراً»: بسیار کفر پیشه. بسیار ناسپاس.]]"
          ],
          "fa.khorramshahi": [
            "چرا که اگر باقیشان گذاری، بندگانت را گمراه کنند و جز فاجر کفران‌پیشه‌ای به بار نیاورند"
          ],
          "fa.makarem": [
            "چرا که اگر آنها را باقی بگذاری، بندگانت را گمراه می‌کنند و جز نسلی فاجر و کافر به وجود نمی‌آورند!"
          ],
          "fa.moezzi": [
            "که اگر بگذاریشان گمراه کنند بندگانت را و نزایند جز گنهکار ناسپاسی‌"
          ],
          "fa.mojtabavi": [
            "كه اگر بگذاريشان، بندگان تو را گمراه مى‌كنند و جز بدكار و كافر نمى‌زايند."
          ],
          "fa.sadeqi": [
            "«بی‌گمان اگر تو آنان را رها کنی، بندگانت را گمراه می‌کنند و جز فاجرِ بسی کافر نسلی به وجود نیاورند.»"
          ]
        }
      },
      {
        "index": 5447,
        "local_index": 28,
        "part_type": "Verse",
        "path": "/books/quran:71:28",
        "refs": {
          "Al-Kafi": [
            "/books/al-kafi:1:4:108:53",
            "/books/al-kafi:1:4:108:54"
          ]
        },
        "text": [
          "رَبِ‌ اغْفِرْ لِي‌ وَ لِوَالِدَيَ‌ وَ لِمَنْ‌ دَخَلَ‌ بَيْتِيَ‌ مُؤْمِناً وَ لِلْمُؤْمِنِينَ‌ وَ الْمُؤْمِنَاتِ‌ وَ لاَ تَزِدِ الظَّالِمِينَ‌ إِلاَّ تَبَاراً"
        ],
        "translations": {
          "en.ahmedali": [
            "O Lord, forgive me, my parents, and any one who enters my house as a believer, and all believing men and women, and do not give the evil-doers increase save in ruin."
          ],
          "en.ahmedraza": [
            "“O my Lord! Forgive me, and my parents, and the believers who are in my house, and all other Muslim men and Muslim women; and do not increase anything for the unjust except ruin.”"
          ],
          "en.arberry": [
            "My Lord, forgive me and my parents and whosoever enters my house as a believer, and the believers, men and women alike; and do Thou not increase the evildoers save in ruin!'"
          ],
          "en.daryabadi": [
            "My Lord! forgive me and my parents and him who entereth my house as a believer, and believing men and believing women, and increase not the wrong-doers in aught save ruin!"
          ],
          "en.hilali": [
            "\"My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the Zalimun (polytheists, wrong-doers, and disbelievers, etc.) grant You no increase but destruction!\""
          ],
          "en.itani": [
            "My Lord! Forgive me and my parents, and anyone who enters my home in faith, and all the believing men and believing women; and do not increase the wrongdoers except in perdition.”"
          ],
          "en.maududi": [
            "My Lord, forgive me and my parents, and whoever enters my house as a believer, and forgive all believers, both men and women, and do not increase the wrong-doers in anything except perdition.”"
          ],
          "en.mubarakpuri": [
            "\"My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the wrongdoers grant You no increase but destruction!\") Allah says,"
          ],
          "en.pickthall": [
            "My Lord! Forgive me and my parents and him who entereth my house believing, and believing men and believing women, and increase not the wrong-doers in aught save ruin."
          ],
          "en.qarai": [
            "My Lord! Forgive me and my parents, and whoever enters my house in faith, and the faithful men and women, and do not increase the wrongdoers in anything but ruin.’"
          ],
          "en.qaribullah": [
            "Forgive me, My Lord, and my parents, and whosoever seeks refuge in my house as a believer, and the believers men and women alike, and do not increase the harmdoers except in ruin'"
          ],
          "en.sahih": [
            "My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.\""
          ],
          "en.sarwar": [
            "Lord, forgive me, my parents, the believers who have entered my home and all believing men and women. Give nothing to the unjust but destruction."
          ],
          "en.shakir": [
            "My Lord! forgive me and my parents and him who enters my house believing, and the believing men and the believing women; and do not increase the unjust in aught but destruction!"
          ],
          "en.transliteration": [
            "Rabbi ighfir lee waliw<u>a</u>lidayya waliman dakhala baytiya muminan walilmumineena wa<b>a</b>lmumin<u>a</u>ti wal<u>a</u> tazidi a<b>l</b><i><u>thth</u></i><u>a</u>limeena ill<u>a</u> tab<u>a</u>ran"
          ],
          "en.wahiduddin": [
            "Lord! Forgive me and my parents and every true believer who enters my house, forgive all the believing men and believing women; and bestow no increase upon the wrongdoers except in ruin?"
          ],
          "en.yusufali": [
            "\"O my Lord! Forgive me, my parents, all who enter my house in Faith, and (all) believing men and believing women: and to the wrong-doers grant Thou no increase but in perdition!\""
          ],
          "fa.ansarian": [
            "پروردگارا! مرا و پدر و مادرم را و هر کس که با ایمان به خانه ام درآید و همه مردان و زنان با ایمان را بیامرز، و ستمکاران را جز هلاکت میفزای."
          ],
          "fa.ayati": [
            "اى پروردگار من، مرا و پدر و مادرم را و هر كه را با ايمان به خانه من وارد شود و نيز مردان مؤمن و زنان مؤمن را بيامرز و ستمكاران را جز به هلاكتشان ميفزاى."
          ],
          "fa.bahrampour": [
            "پروردگارا! بر من و بر پدر و مادرم و هر كس كه با ايمان به خانه من در آيد و بر مردان و زنان با ايمان ببخشاى و ظالمان را جز هلاكت و تباهى ميفزاى"
          ],
          "fa.fooladvand": [
            "پروردگارا، بر من و پدر و مادرم و هر مؤمنى كه در سرايم درآيد، و بر مردان و زنان با ايمان ببخشاى، و جز بر هلاكت ستمگران ميفزاى.»"
          ],
          "fa.ghomshei": [
            "بار الها، مرا و پدر و مادر من و هر که با ایمان به خانه (یا به کشتی) من داخل شود و همه مردان و زنان با ایمان عالم را ببخش و بیامرز و ستمکاران را جز بر هلاک و عذابشان میفزای."
          ],
          "fa.khorramdel": [
            "پروردگارا! مرا، و پدر و مادرم را، و همه‌ی کسانی را که مؤمنانه و باورمندانه به خانه‌ی من در می‌آیند و سایر مردان و زنان با ایمان را بیامرز! و کافران را جز هلاک و نابودی میفزا! [[«بَیْتِیَ»: خانه من. مراد از (بَیْت) چهار چیز می‌تواند باشد: خانه شخصی نوح، مسجد نوح، کشتی نوح، و آئین و شریعت او ... متبادر به ذهن منزل است، ولیکن چهارمی بهتر و با آئین آسمانی سازگارتر است. چرا که نوح قطعاً برای همه پیروان خود دعا می‌کند، و پیروانِ شخص، جزو اهل و تبار او است؛ نه زادگان بی ایمان او. دیگر این که به صورت استعاره گفته می‌شود: قبّه دین، بارگاه دین. و خود دین مراد است. «الْمُؤْمِنِینَ وَ الْمُؤْمِنَاتِ»: شامل همه مؤمنان در تمام امکنه و ازمنه می‌گردد (نگا: التفسیر القرآنی للقرآن).]]"
          ],
          "fa.khorramshahi": [
            "پروردگارا مرا و پدر و مادرم را و هر کس را که مؤمن به خانه من درآید و نیز مردان مؤمن و زنان مؤمن را بیامرز، و جز بر تباهی ستمکاران [مشرک‌] میفزای‌"
          ],
          "fa.makarem": [
            "پروردگارا! مرا، و پدر و مادرم و تمام کسانی را که با ایمان وارد خانه من شدند، و جمیع مردان و زنان باایمان را بیامرز؛ و ظالمان را جز هلاکت میفزا!»"
          ],
          "fa.moezzi": [
            "پروردگارا بیامرز مرا و پدر و مادرم را و آن را که به خانه‌ام درآید مؤمن و مردان مؤمن و زنان مؤمنه را و نیفزای ستمگران را مگر تباهی‌"
          ],
          "fa.mojtabavi": [
            "پروردگارا، مرا و پدر و مادرم را و هر كه را كه با ايمان به خانه من در آمده باشد و همه مردان و زنان مؤمن را بيامرز و ستمكاران را جز هلاكت و نابودى ميفزاى."
          ],
          "fa.sadeqi": [
            "«پروردگارم! برای من و پدر و مادرم و برای هر که در سرایم به حالت ایمان درآمد و برای (کل) مردان و زنان باایمان بپوشان و جز بر هلاکت ستمکاران میفزای.»"
          ]
        }
      }
    ]
  },
  "index": "quran:71",
  "kind": "verse_list"
}