{"data": {"crumbs": [{"indexed_titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}, "path": "/books/quran", "titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}}, {"indexed_titles": {"en": "Chapter 72"}, "path": "/books/quran:72", "titles": {"ar": "الجن", "en": "The Jinn", "ent": "Al-Jinn"}}], "index": 72, "local_index": 72, "order": 40, "part_type": "Chapter", "path": "/books/quran:72", "reveal_type": "Meccan", "rukus": 2, "titles": {"ar": "الجن", "en": "The Jinn", "ent": "Al-Jinn"}, "verse_count": 28, "verse_start_index": 5447, "verses": [{"index": 5448, "local_index": 1, "part_type": "Verse", "path": "/books/quran:72:1", "text": "قُلْ‌ أُوحِيَ‌ إِلَيَ‌ أَنَّهُ‌ اسْتَمَعَ‌ نَفَرٌ مِنَ‌ الْجِنِ‌ فَقَالُوا إِنَّا سَمِعْنَا قُرْآناً عَجَباً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بگو: به من وحی شده که گروهی از جنّ [به قرآن] گوش دادند و گفتند: همانا ما قرآن شگفت آوری شنیدیم،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "بگو: به من وحى شده است كه گروهى از جن گوش فرا دادند، و گفتند كه ما قرآنى شگفت شنيديم؛"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "بگو: به من وحى شده است كه تنى چند از جنّيان [به وحى آسمانى‌] گوش فرا داشتند و گفتند: به راستى ما قرآنى شگفت‌آور شنيديم"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "بگو: «به من وحى شده است كه تنى چند از جنّيان گوش فرا داشتند و گفتند: راستى ما قرآنى شگفت‌آور شنيديم."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "(ای رسول ما) بگو: مرا وحی رسیده که گروهی از جنّیان (آیات قرآن را هنگام قرائت من) استماع کرده‌اند و پس از شنیدن گفته‌اند که ما از قرآن آیات عجیبی شنیدیم."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "(ای محمّد! به امت خود) بگو: به من وحی شده است که گروهی از پریان (به‌تلاوت قرآن من) گوش فرا داده‌اند و (پس از مراجعت به میان قوم خود، بدیشان) گفته‌اند: ما قرآن زیبا و شگفتی را شنیده‌ایم. [[«الْجِنّ»: پری. آفریدگانی از آفریدگان خدا هستند که از آتش آفریده شده‌اند (نگا: حجر / 27). دارای عقل و شعور و فهم و درک، و تکلیف و مسؤولیّت، و آشنائی به زبان بوده، و مخاطب کتابهای آسمانی و از جمله قرآن می‌باشند (نگا: احقاف / 30)، و موظّف به تبلیغ حق هستند. آنها پیش از انسانها آفریده شده‌اند (نگا: حجر / 27) و می‌توانند برخی از کارهای مورد نیاز بشر را انجام دهند (نگا: سبأ / 12 و 13، نمل / 39). وجود جنّ حتمی و قطعی است، ولی ما چیزی از نحوه زندگی و ماهیّت ایشان - جز آنچه قرآن فرموده است - نمی‌دانیم. لیکن باید انسان مؤمن به دنبال خرافات و موهومات راه نرود و ناآگاهانه افسانه‌هائی را درباره ایشان از خود نبافد. این را هم بداند که جای تعجّب نیست که چه بسا انواع و اقسام موجودات زنده‌ای در این عالم وجود داشته باشند و ما با حواسّ محدود و دانش اندک خود با آنها آشنا نباشیم، همان گونه که رنگها و صداهای فراوانی در جهان ما است، ولی مقدار ناچیزی از آنها را می‌بینیم و می‌شنویم. «نَفَرٌ»: گروه (نگا: اعراف / 27، احقاف / 29 - 32). «عَجَباً»: عجیب و بی‌نظیر. یعنی این کلام، از نظر لفظ و معنی اعجاز انگیز است، و با سخنان دیگر متفاوت است. مصدر است و برای مبالغه، صفت شده است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بگو به من وحی فرستاده شده است که گروهی از جن گوش [به قرآن‌] سپردند، سپس گفتند ما قرآنی شگرف را شنیده‌ایم‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "بگو: به من وحی شده است که جمعی از جنّ به سخنانم گوش فراداده‌اند، سپس گفته‌اند: «ما قرآن عجیبی شنیده‌ایم..."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "بگو وحی شد بسویم که گوش فراداشتند تنی چند از جن (پریان) پس گفتند همانا ما شنیدیم قرآنی شگفت را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "بگو: به من وحى شده است كه گروهى از پريان [به اين قرآن‌] گوش فرا داشتند، پس گفتند كه ما قرآنى شگفت- بسيار فصيح كه مانند سخن بشر نيست- شنيديم"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بگو: «به من وحی شده است که به‌راستی تنی چند از جنّیان گوش فرا داشتند. پس گفتند: به‌درستی ما قرآنی شگفت‌آور را شنیدیم،»"}, {"lang": "en", "name": "Ahmed Ali", "text": "SAY: \"I HAVE been informed that a number of jinns had listened; then said: 'We have heard the wondrous Qur'an,"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “I have received the divine revelation that some jinns attentively listened to my recitation, so they said, ‘We have heard a unique Qur’an.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "Say: 'It has been revealed to me that a company of the jinn gave ear, then they said, \"We have indeed heard a Koran wonderful,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Say thou: it hath been revealed Unto me that a company of the Jinn listened, and said, verily we have listened to a Recitation wondrous."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Say (O Muhammad SAW): \"It has been revealed to me that a group (from three to ten in number) of jinns listened (to this Quran). They said: 'Verily! We have heard a wonderful Recital (this Quran)!"}, {"lang": "en", "name": "Talal Itani", "text": "Say, “It was revealed to me that a band of jinn listened in, and said, ‘We have heard a wondrous Quran."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Say, (O Prophet), it was revealed to me that a band of jinn attentively listened to (the recitation of the Qur'an) and then (went back to their people) and said:"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Say: \"It has been revealed to me that a group of Jinn listened. They said: `Verily, we have heard a wonderful Recitation!'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Say (O Muhammad): It is revealed unto me that a company of the Jinn gave ear, and they said: Lo! we have heard a marvellous Qur'an,"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Say, ‘It has been revealed to me that a team of the jinn listened [to the Quran] and they said, “Indeed we heard a wonderful Quran,"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Say: 'It is revealed to me that a party of jinn listened then said: \"We have indeed heard a wonderful Koran,"}, {"lang": "en", "name": "Saheeh International", "text": "Say, [O Muhammad], \"It has been revealed to me that a group of the jinn listened and said, 'Indeed, we have heard an amazing Qur'an."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "(Muhammad), say, \"It has been revealed to me that a party of jinn has listened (to the recitation) of the Quran and has told (their people), \"We heard an amazing reading"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Say: It has been revealed to me that a party of the jinn listened, and they said: Surely we have heard a wonderful Quran,"}, {"lang": "en", "name": "English Transliteration", "text": "Qul oo<u>h</u>iya ilayya annahu istamaAAa nafarun mina aljinni faq<u>a</u>loo inn<u>a</u> samiAAn<u>a</u> qur<u>a</u>nan AAajab<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Say, \"It has been revealed to me that a band of the jinn listened [to the Quran] and they said, \"We have heard a really wonderful recital,"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Say: It has been revealed to me that a company of Jinns listened (to the Qur'an). They said, 'We have really heard a wonderful Recital!"}]}, {"index": 5449, "local_index": 2, "part_type": "Verse", "path": "/books/quran:72:2", "text": "يَهْدِي‌ إِلَى‌ الرُّشْدِ فَآمَنَّا بِهِ‌ وَ لَنْ‌ نُشْرِکَ‌ بِرَبِّنَا أَحَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "که به سوی راه راست هدایت می کند، پس به آن ایمان آوردیم و هرگز احدی را شریک پروردگارمان قرار نخواهیم داد،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "به راه راست هدايت مى‌كند. پس ما بدان ايمان آورديم و هرگز كسى را شريك پروردگارمان نمى‌سازيم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "كه به راه راست هدايت مى‌كند پس به آن ايمان آورديم، و هرگز كسى را شريك پروردگارمان قرار نخواهيم داد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "[كه‌] به راه راست هدايت مى‌كند. پس به آن ايمان آورديم و هرگز كسى را شريك پروردگارمان قرار نخواهيم داد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "که به راه خیر و صلاح هدایت می‌کند، بدین سبب ما به آن ایمان آورده و دیگر هرگز به خدای خود مشرک نخواهیم شد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "همگان را به راه راست رهنمود می‌سازد، و ما بدان ایمان آورده‌ایم (و دیگر از ایمان خود بر نمی‌گردیم و یکتاپرستی را در پیش می‌گیریم، و) کسی را انباز پروردگارمان نمی‌سازیم. [[«الرُّشْدِ»: راه راست و درستی که پویندگان را به سر منزل سعادت و کمال می‌رساند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "که به راستی راه می‌نماید، آنگاه به آن ایمان آوردیم، و هرگز برای پروردگارمان کسی را شریک نمی‌آوریم‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "که به راه راست هدایت می‌کند، پس ما به آن ایمان آورده‌ایم و هرگز کسی را شریک پروردگارمان قرارنمی‌دهیم!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "که رهبری می‌کرد بسوی راستی (خردمندی) پس ایمان آوردیم بدان و هرگز شرک نورزیم به پروردگار خویش کسی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "كه به راه راست [و كمال‌] راه مى‌نمايد، پس به آن ايمان آورديم و هرگز كسى را به پروردگارمان انباز نگيريم"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«(که) به راه راست هدایت می‌کند، پس به آن ایمان آوردیم و هرگز احدی را شریک پروردگارمان قرار نخواهیم داد.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Which guides to the right path; and we have come to believe in it, and will not associate any one with our Lord."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘That guides to the path of goodness, we have therefore accepted faith in it; and we shall never ascribe anyone as a partner to our Lord.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "guiding to rectitude. We believe in it, and we will not associate with our Lord anyone."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Guiding Unto rectitude; wherefore we have believed therein, and we shall by no means associate with our Lord anyone."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'It guides to the Right Path, and we have believed therein, and we shall never join (in worship) anything with our Lord (Allah)."}, {"lang": "en", "name": "Talal Itani", "text": "It guides to rectitude, so we have believed in it; and we will never associate anyone with our Lord."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "“We have indeed heard a wonderful Qur'an which guides to the Right Way; so we have come to believe in it, and we will not associate aught with Our Lord in His Divinity”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`It guides to the right path, and we have believed therein, and we shall never join anything with our Lord.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Which guideth unto righteousness, so we believe in it and we ascribe no partner unto our Lord."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "which guides to rectitude. Hence, we have believed in it and we will never ascribe any partner to our Lord."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "that guides to the Right Path. We believe in it and we will not associate anyone with our Lord."}, {"lang": "en", "name": "Saheeh International", "text": "It guides to the right course, and we have believed in it. And we will never associate with our Lord anyone."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "which guides people to the right path and we believe in it. We shall never consider anyone equal to our Lord;"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Guiding to the right way, so we believe in it, and we will not set up any one with our Lord:"}, {"lang": "en", "name": "English Transliteration", "text": "Yahdee il<u>a</u> a<b>l</b>rrushdi fa<u>a</u>mann<u>a</u> bihi walan nushrika birabbin<u>a</u> a<u>h</u>ad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "which guides to the right path; so we have believed in it and we will not associate anyone with our Lord,"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'It gives guidance to the Right, and we have believed therein: we shall not join (in worship) any (gods) with our Lord."}]}, {"index": 5450, "local_index": 3, "part_type": "Verse", "path": "/books/quran:72:3", "text": "وَ أَنَّهُ‌ تَعَالَى‌ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَ لاَ وَلَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و [این حقایق را اعتراف و اقرار می کنیم:] اینکه برتر و بلند است عظمت پروردگارمان، و او هرگز برای خود همسری و فرزندی نگرفته است،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "عظمت پروردگار ما متعالى است. نه همسرى گيرد و نه فرزندى دارد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و اين كه شأن و عظمت پروردگار ما بلند است، نه همسرى گرفته و نه فرزندى"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و اينكه او، پروردگار والاى ما، همسر و فرزندى اختيار نكرده است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و همانا بسیار بلند مرتبه است شأن و اقتدار پروردگار ما، او همجفت و فرزندی هرگز نگرفته (و از این آلایشهای جسمانی پاک و مبرّا) است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "جلال و عظمت پروردگار ما والا است، او همسر و فرزندی بر نگرفته است. [[«أَنَّهُ»: عطف بر (إِنَّا سَمِعْنَا) با تقدیر فعل مناسب همچون (نَعْلَمُ) است: فَقَالُوا وَ نَعْلَمُ أَنَّهُ تَعَالی. یا این که عطف بر ضمیر (ه) است: فَآمَنَّا بِأَنَّهُ. «جَدُّ»: جلال و عظمت. فاعل فعل (تَعالی) است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و حقا که بلند است شان پروردگار ما، نه همسری برگزیده است، و نه فرزندی‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه بلند است مقام باعظمت پروردگار ما، و او هرگز برای خود همسر و فرزندی انتخاب نکرده است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه برتر شد پایه پروردگار ما که نگرفت همسری و نه فرزندی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و همانا برتر است بزرگى و شكوه پروردگارمان كه نه همسرى گرفته و نه فرزندى"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه پروردگار بسی والاست، (و) همسر و فرزندی اختیار نکرده است.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Exalted is the glory of our Lord; He has neither wife nor son."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And that our Lord’s Majesty is Supreme – He has neither chosen a wife nor a child.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "He -- exalted be our Lord's majesty! has not taken to Himself either consort or a son."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And He - exalted be the majesty of our Lord!-hath taken neither a spouse nor a son."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And exalted be the Majesty of our Lord, He has taken neither a wife, nor a son (or offspring or children)."}, {"lang": "en", "name": "Talal Itani", "text": "And Exalted is the Grandeur of our Lord—He never had a mate, nor a child."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “He – exalted be His Majesty – has not taken to Himself either a wife or a son”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And He, exalted be the Jadd of our Lord, has taken neither a wife nor a son.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And (we believe) that He - exalted be the glory of our Lord! - hath taken neither wife nor son,"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Exalted be the majesty of our Lord; He has taken neither any spouse nor son."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "He exalted be the Majesty of our Lord, who has neither taken to Himself a wife, nor a son!"}, {"lang": "en", "name": "Saheeh International", "text": "And [it teaches] that exalted is the nobleness of our Lord; He has not taken a wife or a son"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "our Lord is too exalted to have either a wife or son."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that He-- exalted be the majesty of our Lord-- has not taken a consort, nor a son:"}, {"lang": "en", "name": "English Transliteration", "text": "Waannahu taAA<u>a</u>l<u>a</u> jaddu rabbin<u>a</u> m<u>a</u> ittakha<u>th</u>a <u>sah</u>ibatan wal<u>a</u> walad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "and exalted is the majesty of our Lord, He has taken neither a wife nor a son."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'And Exalted is the Majesty of our Lord: He has taken neither a wife nor a son."}]}, {"index": 5451, "local_index": 4, "part_type": "Verse", "path": "/books/quran:72:4", "text": "وَ أَنَّهُ‌ کَانَ‌ يَقُولُ‌ سَفِيهُنَا عَلَى‌ اللَّهِ‌ شَطَطاً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اینکه سبک مغز و نادان ما همواره درباره خدا سخنی دور از حق می گفت [که او دارای همسر و فرزند است!]"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و سفيه ما در باره خدا سخنانى به ناحق مى‌گفت."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و اين كه كم خرد ما، در باره‌ى خدا پريشان مى‌گفت و دروغ مى‌بست"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و [شگفت‌] آنكه كم خرد ما، در باره خدا سخنانى ياوه مى‌سرايد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و البته سفیهان و بی‌خردان ما به خدا دروغ می‌بستند (که به او فرزندی مسیح و عزیر و فرشتگان را نسبت دادند)."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "نادانان ما درباره‌ی خداوند سخنان ناروائی می‌گفته‌اند. [[«سَفِیهُ»: نادان. مراد جنس سفیه است. لذا شامل اهریمن و سپاهیان او می‌گردد (نگا: المصحف المیسّر). «شَطَطاً»: سخنان دور از حقیقت. اقوال نادرست (نگا: الکهف / 14).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و نادان ما بود که در حق خداوند، پریشان می‌گفت‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه سفیه ما (ابلیس) درباره خداوند سخنان ناروا می‌گفت!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه بود می‌گفت کم‌خرد ما بر خدا یاوه (بیهده) را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و همانا نابخرد از ما بر خدا دروغ و ناروا گفت- نسبت زن و فرزند به او داد-"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه بی‌گمان کم‌‌خردمان، درباره‌ی خدا سخنانی یاوه و پراکنده می‌سراییده است.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Certainly the foolish among us say preposterous things of God."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And that the fool among us used to utter false exaggerations against Allah.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "The fool among us spoke against God outrage,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And the foolish among us were wont to forge lie against Allah exceedingly."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And that the foolish among us [i.e. Iblis (Satan) or the polytheists amongst the jinns] used to utter against Allah that which was wrong and not right."}, {"lang": "en", "name": "Talal Itani", "text": "But the fools among us used to say nonsense about God."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “the foolish among us have been wont to say outrageous things about Allah”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And that the foolish among us used to utter against Allah that which was an enormity in falsehood.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And that the foolish one among us used to speak concerning Allah an atrocious lie."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "The foolish ones among us used to speak atrocious lies concerning Allah."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "The ignorant fool among us has spoken outrageously against Allah,"}, {"lang": "en", "name": "Saheeh International", "text": "And that our foolish one has been saying about Allah an excessive transgression."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "The dimwit one (the devil) among us has been telling confused lies about God."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that the foolish amongst us used to forge extravagant things against Allah:"}, {"lang": "en", "name": "English Transliteration", "text": "Waannahu k<u>a</u>na yaqoolu safeehun<u>a</u> AAal<u>a</u> All<u>a</u>hi sha<u>t</u>a<u>ta</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "And [now we know] that the foolish among us have been saying outrageous things about God."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'There were some foolish ones among us, who used to utter extravagant lies against Allah;"}]}, {"index": 5452, "local_index": 5, "part_type": "Verse", "path": "/books/quran:72:5", "text": "وَ أَنَّا ظَنَنَّا أَنْ‌ لَنْ‌ تَقُولَ‌ الْإِنْسُ‌ وَ الْجِنُ‌ عَلَى‌ اللَّهِ‌ کَذِباً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اینکه گمان می کردیم، هرگز انس و جن بر خدا دروغ نمی بندند،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و ما مى‌پنداشتيم كه آدمى و جن در باره خدا دروغ نمى‌گويند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و ما پنداشته بوديم كه انس و جن هرگز بر خدا دروغ نمى‌بندند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و ما پنداشته بوديم كه انس و جن هرگز به خدا دروغ نمى‌بندند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و ما چنین می‌پنداشتیم که هرگز هیچ قومی از جنّ و انس بر خدای متعال دروغ و افترا نخواهد گفت."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "و ما (پیش از این) چنین می‌پنداشتیم که آدمیان و پریان هرگز بر خدا دروغ نمی‌بندند (و از زبان خدا دروغ نمی‌گویند و بدو نسبتهای ناروائی - همچون داشتن زن و فرزند - نمی‌دهند). [[«لَن تَقُولَ ... کَذِباً»: این سخن ممکن است اشاره به تقلید کورکورانه‌ای باشد که این گروه از پریان قبلاً از دیگران داشته‌اند و برای خدا انباز و همگون و زن و فرزند قرار می‌داده‌اند.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و ما چنین می‌پنداشتیم که انس و جن هرگز بر خداوند دروغ نمی‌بندند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه ما گمان می‌کردیم که انس و جنّ هرگز بر خدا دروغ نمی‌بندند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه ما پنداشتیم هرگز نگویند آدمی و پری بر خدا دروغی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و ما مى‌پنداشتيم كه هرگز آدمى و پرى بر خدا سخن دروغ نگويند"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و اینکه ما بسی پنداشتیم که انس و جنّ هرگز بر خدا دروغی نمی‌بندند.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "We had in fact thought that men and jinns would never speak a lie about God,"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘Whereas we thought that men and jinns would never fabricate a lie against Allah!’"}, {"lang": "en", "name": "A. J. Arberry", "text": "and we had thought that men and jinn would never speak against God a lie."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And verily we! we had imagined that humankind and Jinn would never forge against Allah a lie."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And verily, we thought that men and jinns would not utter a lie against Allah."}, {"lang": "en", "name": "Talal Itani", "text": "And we thought that humans and jinn would never utter lies about God."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “we had thought that men and jinn would never speak a lie about Allah”,"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And verily, we thought that men and Jinn would not utter a lie against Allah.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And lo! we had supposed that humankind and jinn would not speak a lie concerning Allah -"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "We thought that humans and jinn would never utter any falsehood concerning Allah."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "we never thought that either human or jinn would ever tell a lie against Allah!'"}, {"lang": "en", "name": "Saheeh International", "text": "And we had thought that mankind and the jinn would never speak about Allah a lie."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "We thought that no man or jinn could ever tell lies about God."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that we thought that men and jinn did not utter a lie against Allah:"}, {"lang": "en", "name": "English Transliteration", "text": "Waann<u>a</u> <i><u>th</u></i>anann<u>a</u> an lan taqoola alinsu wa<b>a</b>ljinnu AAal<u>a</u> All<u>a</u>hi ka<u>th</u>ib<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "We had supposed that men and jinn would never utter a lie against God."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'But we do think that no man or spirit should say aught that untrue against Allah."}]}, {"index": 5453, "local_index": 6, "part_type": "Verse", "path": "/books/quran:72:6", "text": "وَ أَنَّهُ‌ کَانَ‌ رِجَالٌ‌ مِنَ‌ الْإِنْسِ‌ يَعُوذُونَ‌ بِرِجَالٍ‌ مِنَ‌ الْجِنِ‌ فَزَادُوهُمْ‌ رَهَقاً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اینکه مردانی از آدمیان به مردانی از جن پناه می بردند، پس [مردان جن] بر طغیان و تباهی آنان افزودند،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و نيز مردانى بودند از آدميان كه به مردانى از جن پناه مى‌بردند و بر طغيانشان مى‌افزودند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و مردانى از آدميان به مردانى از جن پناه مى‌بردند و بر سركشى آنها مى‌افزودند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و مردانى از آدميان به مردانى از جن پناه مى‌بردند و بر سركشى آنها مى‌افزودند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و همانا مردانی از نوع بشر به مردانی از گروه جنّ پناه می‌بردند (و خود را در بیابانها به جنّیان می‌سپردند) و جنّیان بر غرور و جهل آنها سخت می‌افزودند (آیه چنین تفسیر شده که زمان جاهلیّت عرب در بیابان پناه به بزرگ جنّیان آنجا می‌برد تا ایمن باشد آن‌گاه آسوده می‌خفت و مال و جانش به خطر می‌افتاد)."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "و کسانی از انسانها به کسانی از پریها پناه می‌آوردند، و بدین وسیله بر گمراهی و سرکشی ایشان می‌افزودند. [[«رَهَقاً»: سفاهت و جهالت. گمراهی و سرکشی. «فَزَادَهُمْ رَهَقاً»: پناه بردن انسانها به پریان، بر سفاهت و سرکشی و گمراهسازی بیشتر پریها می‌افزوده است. برخی گفته‌اند: پناه بردن انسانها به پریها، بر گمراهی و سرکشی و بزهکاری خود انسانها می‌افزوده است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و چنین بود که مردانی از انسانها به مردانی از جنیان پناه می‌بردند، و بر سرکشی آنان می‌افزودند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه مردانی از بشر به مردانی از جنّ پناه می‌بردند، و آنها سبب افزایش گمراهی و طغیانشان می‌شدند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه بودند مردانی از آدمیان پناه می‌بردند به مردانی از پریان پس بیفزودندشان گناه‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و همانا مردانى از آدميان به مردانى از پريان پناه مى‌بردند پس بر سركشى و گناهكارى آنان"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه مردانی از آدمیان به مردانی از جنّیان بسی پناه می‌برده‌اند، پس قاهرانه (در گمراهیشان) افزودند.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "But some men used to seek refuge with some jinns, and this increased their waywardness;"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And indeed some men among humans used to take the protection of some men among jinns, so it further increased their haughtiness.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "But there were certain men of mankind who would take refuge with certain men of the jinn, and they increased them in vileness,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And persons among humankind have been seeking refuge with persons of the Jinn, so that they increased them in evil disposition."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And verily, there were men among mankind who took shelter with the masculine among the jinns, but they (jinns) increased them (mankind) in sin and disbelief."}, {"lang": "en", "name": "Talal Itani", "text": "Some individual humans used to seek power through some individual jinn, but they only increased them in confusion."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “some from among the humans used to seek protection of some among the jinn, and thus they increased the arrogance of the jinn”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And verily, there were men among mankind who took shelter with the males among the Jinn, but they increased them in Rahaq.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And indeed (O Muhammad) individuals of humankind used to invoke the protection of individuals of the jinn, so that they increased them in revolt against Allah);"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Indeed some persons from the humans would seek the protection of some persons from the jinn, thus only adding to their rebellion."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "But there were certain men from mankind who would take refuge with certain males from the jinn and they increased them in tyranny."}, {"lang": "en", "name": "Saheeh International", "text": "And there were men from mankind who sought refuge in men from the jinn, so they [only] increased them in burden."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "\"Certain human beings sought refuge with certain jinn and this increased the rebelliousness of those jinn."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that persons from among men used to seek refuge with persons from among jinn, so they increased them in wrongdoing:"}, {"lang": "en", "name": "English Transliteration", "text": "Waannahu k<u>a</u>na rij<u>a</u>lun mina alinsi yaAAoo<u>th</u>oona birij<u>a</u>lin mina aljinni faz<u>a</u>doohum rahaq<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Some men used to seek refuge with the jinn in the past, but that only increased their insolence."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'True, there were persons among mankind who took shelter with persons among the Jinns, but they increased them in folly."}]}, {"index": 5454, "local_index": 7, "part_type": "Verse", "path": "/books/quran:72:7", "text": "وَ أَنَّهُمْ‌ ظَنُّوا کَمَا ظَنَنْتُمْ‌ أَنْ‌ لَنْ‌ يَبْعَثَ‌ اللَّهُ‌ أَحَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و مردانی از انس پنداشتند چنان که شما [جنیان] پنداشتید که خدا هرگز کسی را [به نبوّت] برنمی انگیزد!"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "همچنان كه شما مى‌پنداشتيد آنها هم مى‌پنداشتند كه خدا هيچ كس را دوباره زنده نمى‌سازد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و آنها (انسان‌ها) نيز آن گونه كه شما پنداشته‌ايد، گمان بردند كه خدا هرگز كسى را [به پيامبرى‌] مبعوث نمى‌كند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و آنها [نيز] آن گونه كه [شما] پنداشته‌ايد، گمان بردند كه خدا هرگز كسى را زنده نخواهد گردانيد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و آنها هم مانند شما (آدمیان گروهی کافر شده و) گمان کردند که خدا احدی را (به قیامت) زنده نخواهد کرد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "و (انسانهای کافر) گمان برده‌اند، همان گونه که شما (پریهای کافر) گمان برده‌اید، که خداوند هرگز کسی را پیغمبر نمی‌سازد، و کسی را دوباره زنده نمی‌گرداند. [[«لَن یَبْعَثَ اللهُ أَحَداً»: خداوند هرگز کسی را پیغمبر نمی‌سازد و برای تبلیغ روانه نمی‌دارد. خداوند هرگز کسی را پس از مرگ زندگی دوباره نمی‌بخشد و قیامت و رستاخیزی در میان نمی‌باشد.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و آنان نیز می‌پنداشتند همچنانکه شما می‌پندارید که خداوند هرگز کسی را [به حشر یا پیامبری‌] بر نمی‌انگیزد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه آنها گمان کردند -همان‌گونه که شما گمان می‌کردید- که خداوند هرگز کسی را (به نبوّت) مبعوث نمی‌کند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه آنان پنداشتند چنانکه پنداشتید که هرگز برنیانگیزد خدا کسی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و چنانكه شما پنداشتيد آنها نيز پنداشتند كه خداوند هرگز كسى را برنينگيزد- به پيامبرى يا به زندگى ديگر-"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه آنان (نیز) آن‌گونه که (شما) پنداشته‌اید، همواره گمان بردند که خدا هرگز کسی را زنده نخواهد گردانید.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "So they began to think, even as you do, that God would not resurrect any one."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And that they assumed, like you humans assume, that Allah would not send any Noble Messenger.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "and they thought, even as you also thought, that God would never raise up anyone."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And indeed they imagined, even as ye imagined, that Allah will not raise any one."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And they thought as you thought, that Allah will not send any Messenger (to mankind or jinns)."}, {"lang": "en", "name": "Talal Itani", "text": "They thought, as you thought, that God would never resurrect anyone."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “they thought, even as you thought, that Allah would never raise anyone (as a Messenger)”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And they thought as you thought, that Allah will not send any Messenger.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And indeed they supposed, even as ye suppose, that Allah would not raise anyone (from the dead) -"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "They thought, just as you think, that Allah will not raise anyone from the dead."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Like you, they thought that Allah would never raise the dead."}, {"lang": "en", "name": "Saheeh International", "text": "And they had thought, as you thought, that Allah would never send anyone [as a messenger]."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Those people thought, like you, that God would never send down a Messenger."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that they thought as you think, that Allah would not raise anyone:"}, {"lang": "en", "name": "English Transliteration", "text": "Waannahum <i><u>th</u></i>annoo kam<u>a</u> <i><u>th</u></i>anantum an lan yabAAatha All<u>a</u>hu a<u>h</u>ad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "They thought, as you did, that God would never raise up anyone from the dead."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'And they (came to) think as ye thought, that Allah would not raise up any one (to Judgment)."}]}, {"index": 5455, "local_index": 8, "part_type": "Verse", "path": "/books/quran:72:8", "text": "وَ أَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ‌ حَرَساً شَدِيداً وَ شُهُباً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اینکه [برای کسب خبر] به آسمان نزدیک شدیم، پس آن را پر از نگهبانان نیرومند و تیرهای شهاب یافتیم،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "ما به آسمان رسيديم و آن را پر از نگهبانان قدرتمند و شهابها يافتيم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و اين كه ما به آسمان دست يافتيم و آن را پر از نگهبانان قدرتمند (فرشتگان) و تيرهاى شهاب يافتيم"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و ما بر آسمان دست يافتيم و آن را پر از نگهبانان توانا و تيرهاى شهاب يافتيم."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و جنّیان گفتند ما به آسمان بر شدیم (تا اسرار وحی را استراق کنیم) لیکن یافتیم که آنجا فرشته نگهبان با قدرت و تیر شهاب آتشبار فراوان است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ما قصد آسمان کردیم، و همه جای آن را پر از محافظان و نگهبانان نیرومند (ملائکه) و شهابها (ی سوزنده) یافتیم. [[«لَمَسْنَا»: قصد کریم. طلبیدیم و جستجو کردیم. لمس به معنی مس کردن و پسودن است، ولی در اینجا مراد قصد کردن و رو نمودن است. «حَرَساً»: اسم جمع است، و یا جمع حارِس است: محافظان. نگهبانان. مراد فرشتگان است. «شُهُب»: جمع شِهاب، آذرخشها (نگا: حجر / 18). «شَدِیداً»: وزن فَعِیل، مفرد و جمع در آن یکسان است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و ما در آسمان جستیم و آن را سرشار از نگهبانان نیرومند و شهابها یافتیم‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه ما آسمان را جستجو کردیم و همه را پر از محافظان قوّی و تیرهای شهاب یافتیم!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه ما آسمان را سودیم پس یافتیمش پر شده است نگهبانانی سرسخت و شهابهائی‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و ما آسمان را بسوديم- كنايه از اينكه به آسمان بالا رفتيم- پس آن را پر از نگهبانان نيرومند- يعنى فرشتگان- و شهابها- درخشها يا تيرهاى آتشين- يافتيم"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه ما بی‌گمان بر آسمان دست یافتیم، پس آن را پر شده از نگهبانان و پاسداران توانا و نیزه‌های آتشین یافتیم.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "We sought to pry into the secrets of the heavens, but found it full of fierce guards and shooting flames."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And we reached the sky, so we found it strongly guarded and filled with comets.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "And we stretched towards heaven, but we found it filled with terrible guards and meteors."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And we sought to reach the heaven; then we found it filled with a strong guard and darting meteors."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And we have sought to reach the heaven; but found it filled with stern guards and flaming fires."}, {"lang": "en", "name": "Talal Itani", "text": "We probed the heaven, and found it filled with stern guards and projectiles."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “we tried to pry (the secrets of) the heaven, but we found it full of terrible guards and shooting meteors”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And we have sought to reach the heaven; but we found it filled with stern guards and flaming fires.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And (the Jinn who had listened to the Qur'an said): We had sought the heaven but had found it filled with strong warders and meteors."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Indeed we made for the heaven and found it full of mighty sentries and flames."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "(The jinn continued saying): \"We made our way towards heaven, but we found it filled with stern guards and a flame."}, {"lang": "en", "name": "Saheeh International", "text": "And we have sought [to reach] the heaven but found it filled with powerful guards and burning flames."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "\"We went near the heavens but found it to be full of strong guards and shooting flames."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that we sought to reach heaven, but we found it filled with strong guards and flaming stars."}, {"lang": "en", "name": "English Transliteration", "text": "Waann<u>a</u> lamasn<u>a</u> a<b>l</b>ssam<u>a</u>a fawajadn<u>a</u>h<u>a</u> muliat <u>h</u>arasan shadeedan washuhub<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "We sought to reach heaven, but found it filled with strong guards and flames --"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'And we pried into the secrets of heaven; but we found it filled with stern guards and flaming fires."}]}, {"index": 5456, "local_index": 9, "part_type": "Verse", "path": "/books/quran:72:9", "text": "وَ أَنَّا کُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ‌ فَمَنْ‌ يَسْتَمِعِ‌ الْآنَ‌ يَجِدْ لَهُ‌ شِهَاباً رَصَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اینکه ما در آسمان برای شنیدن [خبرهای ملکوتی و سخنان فرشتگان] در نشست گاه هایی می نشستیم، ولی اکنون هر که بخواهد استراق سمع کند، شهابی را در کمین خود می یابد!"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "ما در آنجايها كه مى‌توان گوش فرا داد مى‌نشستيم. اما هر كه اكنون گوش نشيند، شهابى را در كمين خود يابد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و اين كه ما [سابقا] از آسمان در محل‌هايى براى شنيدن [اخبار آسمانى‌] مى‌نشستيم، اما اكنون هر كه بخواهد به گوش باشد، تير شهابى در كمين خود مى‌يابد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و در [آسمان‌] براى شنيدن، به كمين مى‌نشستيم، [اما] اكنون هر كه بخواهد به گوش باشد، تير شهابى در كمين خود مى‌يابد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و ما (پیش از نزول قرآن) در کمین شنیدن سخنان آسمانی و اسرار وحی می‌نشستیم اما اینک هر که (از اسرار وحی الهی) سخنی بخواهد شنید تیر شهاب در کمینگاه اوست."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ما (پیش از این) در گوشه‌ها و کنارهای آسمان برای استراق سمع می‌نشستیم (و کسب خبر می‌کردیم) ولی اکنون هر کس بخواهد گوش فرا دهد، شهاب آماده‌ای را در کمین خود می‌یابد که به سوی او نشانه می‌رود. [[«مَقَاعِدَ»: جمع مَقْعَد، نشیمنگاهها. جایگاهها. مراد اطراف و اکنافی است که بشود در آنجاها نشست و کمین کرد. «رَصَداً»: آماده و نشانه گرفته شده. مصدر است و در معنی اسم مفعول، یعنی مَرْصُود به کار رفته است. یا این که به معنی راصِد، یعنی نگهبان است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و ما خود در نشستنگاههایی برای [دزدیده‌] شنیدن از آن می‌نشستیم، اما اکنون هر کس گوش بسپارد، شهابی در کمین خود یابد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه ما پیش از این به استراق سمع در آسمانها می‌نشستیم؛ امّا اکنون هر کس بخواهد استراق سمع کند، شهابی را در کمین خود می‌یابد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه ما بودیم می‌نشستیم از ایشان نشستگاه‌هائی برای شنیدن پس هر کس گوش فرادارد اکنون بیابد برای خویش شهابی را به کمین‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و ما در آنجا"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه، به‌راستی (در آسمان) برای شنیدن، همواره در جایگاه‌هایی (به کمین) می‌نشسته‌ایم، پس اکنون هر که بخواهد به گوش باشد، (تیر) شهابی در کمین خود می‌یابد.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "We sat in observatories to listen; but any one who listened found a shooting star in wait for him."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And that we sometimes used to sit in some places in the sky, to listen; so whoever now listens finds a fiery comet waiting for him.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "We would sit there on seats to hear; but any listening now finds a meteor in wait for him."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And we were wont to sit on seats therein to listen; but whosoever listeneth now findeth for him a dartin meteor in wait."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And verily, we used to sit there in stations, to (steal) a hearing, but any who listens now will find a flaming fire watching him in ambush."}, {"lang": "en", "name": "Talal Itani", "text": "We used to take up positions to listen in; but whoever listens now finds a projectile in wait for him."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “we would take up stations in the heaven to try to hear but anyone who now attempts to listen finds a shooting meteor in wait for him”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And verily, we used to sit there in stations, to (steal) a hearing, but any who listens now will find a flaming fire watching him in ambush.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And we used to sit on places (high) therein to listen. But he who listeneth now findeth a flame in wait for him;"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "We used to sit in its positions to eavesdrop, but anyone listening now finds a flame waiting for him."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "There, we would sit to eavesdrop, but now an eavesdropper finds a flame in wait for him."}, {"lang": "en", "name": "Saheeh International", "text": "And we used to sit therein in positions for hearing, but whoever listens now will find a burning flame lying in wait for him."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "We used to sit near by and try to listen to the heavens, but shooting flames now await those who try to do that."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that we used to sit in some of the sitting-places thereof to steal a hearing, but he who would (try to) listen now would find a flame lying in wait for him:"}, {"lang": "en", "name": "English Transliteration", "text": "Waann<u>a</u> kunn<u>a</u> naqAAudu minh<u>a</u> maq<u>a</u>AAida li<b>l</b>ssamAAi faman yastamiAAi al<u>a</u>na yajid lahu shih<u>a</u>ban ra<u>s</u>ad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "we used to take up a position to listen, but whoever listens now finds a flaming fire lying in wait for him --"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'We used, indeed, to sit there in (hidden) stations, to (steal) a hearing; but any who listen now will find a flaming fire watching him in ambush."}]}, {"index": 5457, "local_index": 10, "part_type": "Verse", "path": "/books/quran:72:10", "text": "وَ أَنَّا لاَ نَدْرِي‌ أَ شَرٌّ أُرِيدَ بِمَنْ‌ فِي‌ الْأَرْضِ‌ أَمْ‌ أَرَادَ بِهِمْ‌ رَبُّهُمْ‌ رَشَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اینکه ما نمی دانیم آیا درباره کسانی که در زمین هستند گزند و شری خواسته شده یا پروردگارشان برای آنان هدایت خواسته است؟"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "از اين روى نمى‌دانيم كه آيا براى كسانى كه در روى زمين هستند بدى مقدر مى‌شود، يا پروردگارشان مى‌خواهد به راه راستشان ببرد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و ما [درست‌] نمى‌دانيم كه آيا براى ساكنان زمين شرّى اراده شده يا پروردگارشان براى آنها هدايتى خواسته است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و ما [درست‌] نمى‌دانيم كه آيا براى كسانى كه در زمينند بدى خواسته شده يا پروردگارشان برايشان هدايت خواسته است؟"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و ما هنوز نمی‌دانیم که آیا عاقبت برای مردم زمین (با این مذاهب و اعمال مختلف که دارند) شرّ و فساد خواسته‌اند یا که خدای آنها بر هدایت آنان رشد و خیر و صلاح آنها را منظور دارد؟"}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ما نمی‌دانیم که آیا برای ساکنان زمین شرّ و بلا در نظر گرفته شده است، و یا این که پروردگارشان خیر و هدایت ایشان را خواسته است؟ [[«أُرِیدَ»: اراده شده است. مقدّر گشته است. «رَشَداً»: هدایت و رهنمود. مراد خیر و برکت مادی و معنوی است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و ما خود نمی‌دانیم که در حق زمینیان شر خواسته شده است، یا پروردگارشان در حق آنان رهیافت خواسته است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه (با این اوضاع) ما نمی‌دانیم آیا اراده شرّی درباره اهل زمین شده یا پروردگارشان خواسته است آنان را هدایت کند؟!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه ما ندانیم آیا بدی خواسته شده است با آنان که در زمینند یا خواسته است با ایشان پروردگارشان نیکی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و ما نمى‌دانيم كه آيا در باره كسانى كه در زمين‌اند- آدميان- بدى خواسته شده، يا پروردگارشان براى آنها رهيابى [به نيكى و راه راست‌] خواسته است"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه ما به درستی نمی‌دانیم آیا برای کسانی که در زمینند، بدی خواسته شده یا پروردگارشان برایشان رشد و نموی خواسته است‌؟»"}, {"lang": "en", "name": "Ahmed Ali", "text": "We do not know if this means ill for the dwellers of the earth, or their Lord wishes guidance for them."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And we do not know whether harm is intended for those on the earth, or whether their Lord intends goodness for them.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "And so we know not whether evil is intended for those in the earth, or whether their Lord intends for them rectitude."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And we know not whether evil is boded for those who are on the earth, or whether their Lord intendeth for them a right direction."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And we know not whether evil is intended for those on earth, or whether their Lord intends for them a Right Path."}, {"lang": "en", "name": "Talal Itani", "text": "We do not know whether ill is intended for those on earth, or if their Lord intends goodness for them."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “we do not know whether evil is intended for those on the earth, or whether their Lord intends to direct them to the Right Way”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And we know not whether evil is intended for those on the earth, or whether their Lord intends for them guidance.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And we know not whether harm is boded unto all who are in the earth, or whether their Lord intendeth guidance for them."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "We do not know whether ill is intended for those who are on the earth, or whether their Lord intends good for them."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "And so we do not know whether evil is intended for those on earth, or whether their Lord intends to guide them."}, {"lang": "en", "name": "Saheeh International", "text": "And we do not know [therefore] whether evil is intended for those on earth or whether their Lord intends for them a right course."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "We do not know whether by this arrangement God intends benefit and guidance for the people of the earth or only evil."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that we know not whether evil is meant for those who are on earth or whether their Lord means to bring them good:"}, {"lang": "en", "name": "English Transliteration", "text": "Waann<u>a</u> l<u>a</u> nadree asharrun oreeda biman fee alar<u>d</u>i am ar<u>a</u>da bihim rabbuhum rashad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "we cannot tell if this bodes evil to those who dwell on earth or whether their Lord intends to guide them."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'And we understand not whether ill is intended to those on earth, or whether their Lord (really) intends to guide them to right conduct."}]}, {"index": 5458, "local_index": 11, "part_type": "Verse", "path": "/books/quran:72:11", "text": "وَ أَنَّا مِنَّا الصَّالِحُونَ‌ وَ مِنَّا دُونَ‌ ذٰلِکَ‌ کُنَّا طَرَائِقَ‌ قِدَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "واینکه از ما برخی شایسته وبرخی غیر شایسته اند، [و] ما بر مذاهب گوناگون ومتفاوتی هستیم،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "برخى از ما صالحند و برخى جز آن، و ما فرقه‌هايى گوناگونيم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و اين كه از ميان ما برخى صالحند و برخى غير آن، ما گروههايى در راههاى گوناگونى بوديم"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و از ميان ما برخى درستكارند و برخى غير آن، و ما فرقه‌هايى گوناگونيم."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و همانا برخی از ما صالح و نیکوکار هستیم و برخی بر خلاف آن، عقیده و اعمال ما هم بسیار متفرق و مختلف است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "برخی از ما تسلیم فرمان خدا و پرهیزگارند، و بعضی از ما جز این، (یعنی نافرمان و بی‌دین). اصلاً ما فرقه‌ها و گروههای متفاوت و گوناگونی هستیم. [[«دُونَ»: جز. سوای. «طَرَآئِقَ»: جمع طریقه، راهها و روشها. مراد مردمان صاحب راهها و روشهای گوناگون است. «قِدَداً»: جمع قِدَّة: فِرقه. دسته. گروه.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و از میان ما هم صالحان هست و هم از میان ما جز این، ما [روندگان‌] راههای گوناگونیم‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه در میان ما، افرادی صالح و افرادی غیر صالحند؛ و ما گروه‌های متفاوتی هستیم!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه از ما شایستگانند و از ما کمتر از آن بوده‌ایم گروه‌هائی گوناگون‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و همانا از ما برخى نيك و شايسته‌اند و برخى جز اين. ما گروه‌هايى به راه‌هاى گوناگون بوديم"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه به‌راستی از میان ما برخی شایستگانند و برخی دونشان [:ناشایستگان]. ما فرقه‌هایی جدای از یکدیگر بوده‌ایم.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "For some of us are upright and some otherwise: Surely we follow different ways."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And among us some are virtuous and some are the other type; we are split into several branches.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "And some of us are the righteous, and some of us are otherwise; we are sects differing."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And of us there are some righteous, and of us are some otherwise; we have been following very diverse."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'There are among us some that are righteous, and some the contrary; we are groups each having a different way (religious sect, etc.)."}, {"lang": "en", "name": "Talal Itani", "text": "Some of us are righteous, but some of us are less than that; we follow divergent paths."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “some of us are upright and some of us are otherwise for we follow widely divergent paths”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`There are among us some that are righteous, and some the contrary; we are groups having different ways.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And among us there are righteous folk and among us there are far from that. We are sects having different rules."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Among us some are righteous and some are otherwise: we are various sects."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Some of us are righteous, but some are otherwise, we are sects that differ."}, {"lang": "en", "name": "Saheeh International", "text": "And among us are the righteous, and among us are [others] not so; we were [of] divided ways."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "As for us, some of us are righteous and others are not. We have all followed different ways."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that some of us are good and others of us are below that: we are sects following different ways:"}, {"lang": "en", "name": "English Transliteration", "text": "Waann<u>a</u> minn<u>a</u> a<b>l</b><u>ssa</u>li<u>h</u>oona waminn<u>a</u> doona <u>tha</u>lika kunn<u>a</u> <u>t</u>ar<u>a</u>iqa qidad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Some of us are righteous, while others are not; we follow divergent paths."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'There are among us some that are righteous, and some the contrary: we follow divergent paths."}]}, {"index": 5459, "local_index": 12, "part_type": "Verse", "path": "/books/quran:72:12", "text": "وَ أَنَّا ظَنَنَّا أَنْ‌ لَنْ‌ نُعْجِزَ اللَّهَ‌ فِي‌ الْأَرْضِ‌ وَ لَنْ‌ نُعْجِزَهُ‌ هَرَباً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اینکه ما یقین داریم که هرگز نمی توانیم خدا را در زمین عاجز و درمانده کنیم و هرگز نمی توانیم [با گریختن و فرار] از دسترس قدرت او بیرون رویم،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "ما مى‌دانيم كه خدا را در زمين ناتوان نمى‌كنيم و با گريختن نيز ناتوانش نسازيم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و ما اعتقاد داريم كه هرگز نمى‌توانيم خدا را در زمين عاجز كنيم و هرگز نمى‌توانيم با گريختن، او را عاجز كنيم"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و ما مى‌دانيم كه هرگز نمى‌توانيم در زمين خداى را به ستوه آوريم، و هرگز او را با گريز [خود] درمانده نتوانيم كرد"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و ما چنین دانسته‌ایم که هرگز در زمین بر قدرت خدا غلبه و از محیط اقتدارش فرار نتوانیم کرد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ما یقین داریم که هرگز نمی‌توانیم بر اراده‌ی خداوند در زمین غالب شویم، و نمی‌توانیم از پنجه‌ی قدرت او فرار کنیم. (بنابراین، وقتی که نه راه غلبه وجود دارد، و نه راه گریز، چاره‌ای جز تسلیم فرمان دادگرانه‌ی او نیست). [[«ظَنَنَّا»: یقین داریم. قطعاً دانسته‌ایم. «هَرَباً»: گریز. فرار. مصدر است و به معنی اسم فاعل، یعنی (هَارِبِینَ) بوده و حال است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و ما یقین داشتیم که هرگز در زمین از خداوند گزیر و گریزی نداریم‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه ما یقین داریم هرگز نمی‌توانیم بر اراده خداوند در زمین غالب شویم و نمی‌توانیم از (پنجه قدرت) او بگریزیم!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه ما دانستیم که هرگز به عجز نیاریم خدا را در زمین و هرگز به عجزش نیاریم به گریختن‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و ما مى‌دانستيم كه هرگز خداى را در زمين ناتوان نتوانيم ساخت و با گريختن- از عذاب او- ناتوانش نتوانيم كرد"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه ما گمان شایسته‌ای داشتیم که هرگز نمی‌توانیم در زمین خدای را به ستوه آوریم و هرگز او را با گریز(مان) درمانده نتوانیم کرد.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "We realised that we could not weaken the power of God on earth, nor outpace Him by running away."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And we are certain that we cannot defeat Allah in the earth, nor can we run out of His grasp.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "Indeed, we thought that we should never be able to frustrate God in the earth, neither be able to frustrate Him by flight."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And we known that we cannot frustrate Allah in the earth, nor can we frustrate Him by flight."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And we think that we cannot escape (from the punishment of) Allah in the earth, nor can we escape (from the punishment) by flight."}, {"lang": "en", "name": "Talal Itani", "text": "We realized that we cannot defeat God on earth, and that we cannot escape Him by fleeing."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “we thought that we will neither be able to frustrate Allah on earth, nor frustrate Him by flight”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And we think that we cannot escape Allah in the earth, nor can we escape Him by flight.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And we know that we cannot escape from Allah in the earth, nor can we escape by flight."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "We know that we cannot frustrate Allah on the earth, nor can we frustrate Him by fleeing."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "We know that we cannot frustrate Allah in the earth, nor can we frustrate Him by flight."}, {"lang": "en", "name": "Saheeh International", "text": "And we have become certain that we will never cause failure to Allah upon earth, nor can we escape Him by flight."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "We knew that we could never challenge God whether we stayed on earth or fled elsewhere."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that we know that we cannot escape Allah in the earth, nor can we escape Him by flight:"}, {"lang": "en", "name": "English Transliteration", "text": "Wann<u>a</u> <i><u>th</u></i>anann<u>a</u> an lan nuAAjiza All<u>a</u>ha fee alar<u>d</u>i walan nuAAjizahu harab<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "We have realized that we could never thwart God on earth and that we would never be able to thwart Him by flight."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'But we think that we can by no means frustrate Allah throughout the earth, nor can we frustrate Him by flight."}]}, {"index": 5460, "local_index": 13, "part_type": "Verse", "path": "/books/quran:72:13", "text": "وَ أَنَّا لَمَّا سَمِعْنَا الْهُدَى‌ آمَنَّا بِهِ‌ فَمَنْ‌ يُؤْمِنْ‌ بِرَبِّهِ‌ فَلاَ يَخَافُ‌ بَخْساً وَ لاَ رَهَقاً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اینکه چون هدایت قرآن را شنیدیم به آن ایمان آوردیم؛ زیرا کسی که به پروردگارش ایمان آورد نه از کاسته شدن ثواب می ترسد و نه از اینکه عذاب و سختی و مشقت و رنج او را احاطه کند،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و چون سخن هدايت شنيديم، بدان ايمان آورديم. و هر كه به پروردگارش ايمان آورد نه از نقصان مى‌ترسد و نه از ستم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و ما همين كه هدايت [قرآن‌] را شنيديم بدان گرويديم پس هر كه به پروردگار خود ايمان آورد، نه از نقصان [پاداش خود] مى‌ترسد و نه از ستمى"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و ما چون هدايت را شنيديم بدان گرويديم؛ پس كسى كه به پروردگار خود ايمان آورد، از كمى [پاداش‌] و سختى بيم ندارد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و ما چون به سخنان هدایت (یعنی آیات قرآن) گوش فرا دادیم (برخی) ایمان آوردیم و هر که به خدای خود ایمان آورد دیگر از نقصان خیر و ثواب و از احاطه رنج و عذاب بر خود هیچ نترسد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "ما هنگامی که رهنمود (قرآن را) شنیدیم، بدان ایمان آوردیم. هر کس که به پروردگارش ایمان بیاورد، نه از کاستی (پاداش) می‌ترسد، و نه از ستم (حاصل از افزودن بر بدیهایش). [[«الْهُدی»: رهنمود. مراد قرآن است (نگا: بقره / 185). «بَخْساً»: نقصان. کاهش. مراد کاستن از حسنات است. «رَهَقاً»: ستم. مراد افزایش بر سیّئات، و دچار ساختن به خواری و ذلّت آخرت است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و ما چون [پیام‌] هدایت را شنیدیم، به آن ایمان آوردیم، پس هر کس به پروردگارش ایمان آورد، نه از نقصانی بیم داشته باشد، و نه از ستمی‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه ما هنگامی که هدایت قرآن را شنیدیم به آن ایمان آوردیم؛ و هر کس به پروردگارش ایمان بیاورد، نه از نقصان می‌ترسد و نه از ظلم!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه ما گاهی که شنیدیم راهنمائی را ایمان آوردیم بدان پس هر که ایمان آورد به پروردگار خویش نترسد کاهش و نه ستمی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و چون رهنمونى [به راه راست‌]- قرآن- را شنيديم به آن ايمان آورديم، كه هر كه به پروردگار خويش ايمان آورد نه از كاستى- در پاداش- ترسد و نه از ستم- در كيفر-"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه ما چون هدایت را شنیدیم، به د‌رستی بدان گرویدیم. پس هر کس که به پروردگار خود ایمان آورد، از هیچ‌گونه کاستی ستمگرانه و نه در برگیری قاهرانه، بیم نداریم.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "So when we heard the guidance we believed in it; and he who believes in his Lord will neither fear loss nor force."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And that when we heard the guidance, we accepted faith in it; so whoever accepts faith in his Lord, has no fear – neither of any loss nor of any injustice.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "When we heard the guidance, we believed in it; and whosoever believes in his Lord, he shall fear neither paltriness nor vileness."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And when we heard the Message of guidance, we believed therein; and whosoever believeth in his Lord, he shall fear neither diminution nor wrong."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And indeed when we heard the Guidance (this Quran), we believed therein (Islamic Monotheism), and whosoever believes in his Lord shall have no fear, either of a decrease in the reward of his good deeds or an increase in punishment for his sins."}, {"lang": "en", "name": "Talal Itani", "text": "And when we heard the guidance, we believed in it. Whoever believes in his Lord fears neither loss, nor burden."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “when we heard the teaching of the Right Way we came to believe in it; he who believes in His Lord shall have no fear of suffering loss or being subjected to any injustice”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And indeed when we heard the Guidance, we believed therein, and whosoever believes in his Lord shall have no fear, either of a decrease in the reward of his good deeds or an increase in the punishment for his sins.'"}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And when we heard the guidance, we believed therein, and whoso believeth in his Lord, he feareth neither loss nor oppression."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "When we heard the [message of] guidance, we believed in it. Whoever that has faith in his Lord will fear neither privation nor oppression."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "When we heard the Guidance, we believed in it, and whosoever believes in his Lord shall fear neither shortage nor injustice."}, {"lang": "en", "name": "Saheeh International", "text": "And when we heard the guidance, we believed in it. And whoever believes in his Lord will not fear deprivation or burden."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Now that we have listened to the guidance, we believe in it. Whoever believes in his Lord does not need to fear loss or oppression."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that when we heard the guidance, we believed in it; so whoever believes in his Lord, he should neither fear loss nor being overtaken (by disgrace):"}, {"lang": "en", "name": "English Transliteration", "text": "Waann<u>a</u> lamm<u>a</u> samiAAn<u>a</u> alhud<u>a</u> <u>a</u>mann<u>a</u> bihi faman yumin birabbihi fal<u>a</u> yakh<u>a</u>fu bakhsan wal<u>a</u> rahaq<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "When we heard the call to guidance, we believed in it. He who believes in his Lord has no fear of loss or of injustice."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'And as for us, since we have listened to the Guidance, we have accepted it: and any who believes in his Lord has no fear, either of a short (account) or of any injustice."}]}, {"index": 5461, "local_index": 14, "part_type": "Verse", "path": "/books/quran:72:14", "text": "وَ أَنَّا مِنَّا الْمُسْلِمُونَ‌ وَ مِنَّا الْقَاسِطُونَ‌ فَمَنْ‌ أَسْلَمَ‌ فَأُولٰئِکَ‌ تَحَرَّوْا رَشَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اینکه گروهی از ما تسلیم [فرمان ها و احکام] خدایند، و برخی منحرف اند، پس کسانی که تسلیم شدند در صدد یافتن حقیقت و راه مستقیم اند،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و بعضى از ما مسلمانند و بعضى از حق دور. و آنان كه اسلام آورده‌اند در جست و جوى راه راست بوده‌اند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و از ميان ما برخى تسليم [امر خدا] و برخى منحرفند پس هر كه تسليم خدا گردد، آنهايند كه راه رشد را در پيش گرفته‌اند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و از ميان ما برخى فرمانبردار و برخى از ما منحرفند: پس كسانى كه به فرمانند، آنان در جستجوى راه درستند،"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و از ما جنّیان هم بعضی مسلمان و بی‌آزار و برخی کافر و ستمکارند، و آنان که اسلام آوردند راستی به راه رشد و صواب شتافتند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "در میان ما، فرمانبرداران، و منحرفان و بیدادگرانند. آنان که فرمانبردارند، هدایت و خیر را برگزیده‌اند. [[«الْمُسْلِمُونَ»: (نگا: بقره / 132 و 133 و 136). «الْقَاسِطُونَ»: کج‌روان و منحرفان. ستمگران و بیدادگران. «تَحَرَّوْا»: قصد کردند و گرائیدند. برگزیدند. تحرّی، به معنی تلاش برای شناخت چیزی که راست‌تر و بهتر است (نگا: معجم‌الفاظ القرآن‌الکریم).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و جمعی از میان ما مسلمان است، و جمعی کژراه، پس کسانی که اسلام آورند، آنانند که هدایت جسته‌اند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه گروهی از ما مسلمان و گروهی ظالمند؛ هر کس اسلام را اختیار کند راه راست را برگزیده است،"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه از ما مسلمانانند و از ما کجروان پس آنکو اسلام آورد آنانند که در پی بوده‌اند راستی و درستی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و همانا از ما برخى مسلمانند و برخى بيدادگر. پس هر كه [فرمان خداى را] گردن نهاد اينانند كه راه راست را جسته و يافته‌اند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«و اینکه برخی از ما بی‌گمان مسلمان و برخی (هم) نامسلمانند. پس هر کس تسلیم (خدا) شد آنان در جستجوی راهی راهوار بوده‌اند.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Some of us have come to submission, and some of us are iniquitous.'\" Those who have submitted have taken the right course;"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And that some among us are Muslims and some are the unjust; and whoever has accepted Islam – it is they who have thought rightly.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "And some of us have surrendered, and some of us have deviated. Those who have surrendered sought rectitude;"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And of us some are Muslims, and of us some are deviators. Then whosoever hath embraced Islam - such have endeavoured after a Path of rectitude."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "'And of us some are Muslims (who have submitted to Allah, after listening to this Quran), and of us some are Al-Qasitun (disbelievers those who have deviated from the Right Path)'. And whosoever has embraced Islam (i.e. has become a Muslim by submitting to Allah), then such have sought the Right Path.\""}, {"lang": "en", "name": "Talal Itani", "text": "Among us are those who are submitting, and among us are the compromisers. As for those who have submitted—it is they who pursue rectitude."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “among us some are Muslims (Those who have submitted to Allah), and some of us are deviant. So those who became Muslims found the Right Course;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "`And of us some are Muslims, and of us some are Al-Qasitun. And whosoever has embraced Islam, then such have sought the right path.' \""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And there are among us some who have surrendered (to Allah) and there are among us some who are unjust. And whoso hath surrendered to Allah, such have taken the right path purposefully."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Among us some are Muslims and some of us are perverse.” ’ Those who submit [to Allah]—it is they who pursue rectitude."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Some of us have surrendered (Muslims) and some of us have deviated. Those who surrendered sought the Right Path,"}, {"lang": "en", "name": "Saheeh International", "text": "And among us are Muslims [in submission to Allah], and among us are the unjust. And whoever has become Muslim - those have sought out the right course."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Some of us are Muslims and some of us have deviated from the Truth. Whoever has embraced Islam has followed the right guidance."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that some of us are those who submit, and some of us are the deviators; so whoever submits, these aim at the right way:"}, {"lang": "en", "name": "English Transliteration", "text": "Waann<u>a</u> minn<u>a</u> almuslimoona waminn<u>a</u> alq<u>a</u>si<u>t</u>oona faman aslama faol<u>a</u>ika ta<u>h</u>arraw rashad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Some of us are obedient while others are wrongdoers; it is the obedient who have found the right path,"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'Amongst us are some that submit their wills (to Allah), and some that swerve from justice. Now those who submit their wills - they have sought out (the path) of right conduct:"}]}, {"index": 5462, "local_index": 15, "part_type": "Verse", "path": "/books/quran:72:15", "text": "وَ أَمَّا الْقَاسِطُونَ‌ فَکَانُوا لِجَهَنَّمَ‌ حَطَباً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "ولی منحرفان هیزم دوزخ اند،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "اما آنان كه از حق دورند هيزم جهنم خواهند بود."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "ولى منحرفان، هيزم جهنم خواهند بود"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "ولى منحرفان، هيزم جهنم خواهند بود.»"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و اما ستمکاران ما هیزم بر آتش جهنّم گردیدند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "و امّا آنان که ستمگر و بیدادگرند، هیزم و هیمه‌ی دوزخ هستند. [[«حَطَباً»: هیزم. هیمه.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و اما کژراهان همانا هیزم جهنمند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و امّا ظالمان آتشگیره و هیزم دوزخند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و اما کجروان پس بوده‌اند دوزخ را هیزم‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و اما بيدادگران، پس دوزخ را هيمه باشند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و اما بخش‌کنندگان (میان خدا و آفریدگان) ، پس هیزم جهنم بوده‌اند."}, {"lang": "en", "name": "Ahmed Ali", "text": "But those who are iniquitous will be fuel for Hell."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And as for the unjust – they are the fuel of hell.’”"}, {"lang": "en", "name": "A. J. Arberry", "text": "but as for those who have deviated, they have become firewood for Gehenna!\"'"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And as for the deviators, for Hell they shall be fuel."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And as for the Qasitun (disbelievers who deviated from the Right Path), they shall be firewood for Hell,"}, {"lang": "en", "name": "Talal Itani", "text": "But as for the compromisers—they will be firewood for Hell.’”"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "but those who deviated from the Truth, will be the fuel for Hell.”"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And as for the Qasitun, they shall be firewood for Hell."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And as for those who are unjust, they are firewood for hell."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "As for the perverse, they will be firewood for hell."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "but those who have deviated shall become the fuel of Gehenna (Hell)."}, {"lang": "en", "name": "Saheeh International", "text": "But as for the unjust, they will be, for Hell, firewood.'"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "However, the deviators from the Truth will be the fuel for hell\"."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And as to the deviators, they are fuel of hell:"}, {"lang": "en", "name": "English Transliteration", "text": "Waam<u>a</u> alq<u>a</u>si<u>t</u>oona fak<u>a</u>noo lijahannama <u>h</u>a<u>t</u>ab<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "but those who are wrongdoers will become the fuel of Hell.\""}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "'But those who swerve,- they are (but) fuel for Hell-fire'-"}]}, {"index": 5463, "local_index": 16, "part_type": "Verse", "path": "/books/quran:72:16", "text": "وَ أَنْ‌ لَوِ اسْتَقَامُوا عَلَى‌ الطَّرِيقَةِ لَأَسْقَيْنَاهُمْ‌ مَاءً غَدَقاً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اگر [انس و جن] بر طریقه حق پایداری کنند حتماً آنان را از آب فراوانی سیراب خواهیم کرد،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و اگر بر طريقه راست پايدارى كنند، از آبى فراوان سيرابشان كنيم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و اگر [جن و انس‌] در راه درست پايدارى كنند، قطعا آبى گوارا بديشان مى‌نوشانيم [و روزى فراوان به آنان مى‌دهيم‌]"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و اگر [مردم‌] در راه درست، پايدارى ورزند، قطعاً آب گوارايى بديشان نوشانيم."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و اگر بر طریقه (اسلام و ایمان) پایدار بودند آب (علم و رحمت و رزق) فراوان نصیبشان البته می‌گردانیدیم."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "اگر آدمیان و پریان بر راستای راه (یکتاپرستی و فرمانبرداری از اوامر و نواهی الهی) ماندگار بمانند، آب زیاد (و نعمت فراوان) بهره‌ی ایشان می‌گردانیم. [[«الطَّرِیقَهِ»: راه. مراد راه خداشناسی و فرمانبرداری، یا به عبارت دیگر، آئین اسلام است. «غَدَقاً»: فراوان. زیاد. «مَآءً غَدَقاً»: آب فراوان، که نماد و سبب نعمت فراوان است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و اگر در شیوه‌[ی ناصواب‌] پایداری ورزند [از روی استدراج‌] آنان را آب [و امکانات‌] فراوان ارزانی می‌داریم‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه اگر آنها [= جنّ و انس‌] در راه (ایمان) استقامت ورزند، با آب فراوان سیرابشان می‌کنیم!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه اگر پایدار می‌شدند بر روش هر آینه می‌نوشانیدیمشان آبی فراوان‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و [به من وحى شده كه‌] اگر [آدميان و پريان‌] بر راه راست پايدارى كنند، هر آينه از آبى فراوان- كنايه از روزى فراوان- سيرابشان كنيم،"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و اینکه اگر بر راه (خدا) پایداری کنند، همواره آنان را آبی بسیار گوارا بنوشانیم."}, {"lang": "en", "name": "Ahmed Ali", "text": "(Say): \"If they keep to the right path We shall give them water in abundance to drink"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "And proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “I have received the divine revelation that ‘Had they remained upright on the straight path, We would have given them abundant water.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "Would they but go straight on the way, We would give them to drink of water copious,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And had they kept to the path surely We would have watered them with rain plenteous."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "If they (non-Muslims) had believed in Allah, and went on the Right Way (i.e. Islam) We should surely have bestowed on them water (rain) in abundance."}, {"lang": "en", "name": "Talal Itani", "text": "Had they kept true to the Path, We would have given them plenty water to drink."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "If people were to keep firmly to the Right Way, We would have vouchsafed them abundant rain"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "If they had believed in Allah, and went on the way, We would surely have bestowed on them water in abundance."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "If they (the idolaters) tread the right path, We shall give them to drink of water in abundance"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "If they are steadfast on the path [of Allah], We shall provide them with abundant water,"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "If they had followed the Path We would give to them abundant water to drink,"}, {"lang": "en", "name": "Saheeh International", "text": "And [Allah revealed] that if they had remained straight on the way, We would have given them abundant provision"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Had they (jinn and mankind) remained steadfast in their religion (Islam), We would certainly have given them abundant water to drink"}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that if they should keep to the (right) way, We would certainly give them to drink of abundant water,"}, {"lang": "en", "name": "English Transliteration", "text": "Waallawi istaq<u>a</u>moo AAal<u>a</u> a<b>l</b><u>tt</u>areeqati laasqayn<u>a</u>hum m<u>a</u>an ghadaq<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "If they had followed the right path, We would have provided them with abundant rain --"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "(And Allah's Message is): \"If they (the Pagans) had (only) remained on the (right) Way, We should certainly have bestowed on them Rain in abundance."}]}, {"index": 5464, "local_index": 17, "part_type": "Verse", "path": "/books/quran:72:17", "text": "لِنَفْتِنَهُمْ‌ فِيهِ‌ وَ مَنْ‌ يُعْرِضْ‌ عَنْ‌ ذِکْرِ رَبِّهِ‌ يَسْلُکْهُ‌ عَذَاباً صَعَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "تا آنان را در زمینه فراوانی نعمت بیازماییم و کسی که از یاد پروردگارش روی برگرداند، او را در عذابی بسیار سخت و روز افزون درخواهد آورد،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "تا آنها را بيازماييم. و هر كه از ذكر پروردگارش اعراض كند او را به عذابى دشوار دراندازد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "تا آنها را در اين [نعمت فراوان‌] بيازماييم. و هر كس از ياد پروردگار خود روى بگرداند، وى را در عذابى روز افزون بكشاند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "تا در اين باره آنان را بيازماييم، و هر كس از ياد پروردگار خود دل بگرداند، وى را در قيد عذابى [روز]افزون درآورد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "تا به آن نعمت آنها را امتحان و آزمایش کنیم، و هر که از یاد خدای خود اعراض کند خدا او را به عذابی بسیار سخت درآورد."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "هدف این است که ما آنان را با این نعمت فراوان بیازمائیم، و هر کس از ذکر و یاد پروردگارش روی‌گردان گردد، او را به عذاب سخت و طاقت فرسائی داخل می‌گرداند. [[«یَسْلُکْهُ»: داخل می‌گرداند (نگا: قصص / 32، حاقّه / 32). «صَعَداً»: سخت. غیر قابل تحمّل. طاقت‌فرسا.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "تا سرانجام در آن بیازماییمشان، و هر کس از یاد پروردگارش دل بگرداند، او را به عذابی سهمگین بکشاند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "هدف این است که ما آنها را با این نعمت فراوان بیازماییم؛ و هر کس از یاد پروردگارش روی گرداند، او را به عذاب شدید و فزاینده‌ای گرفتار می‌سازد!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "تا بیازماییمشان در آن و آنکو روی برتابد از یاد پروردگار خویش ببردش در عذابی سخت‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "تا در باره آن بيازماييمشان، و هر كه از ياد و پند پروردگارش روى بگرداند او را به عذابى سخت درآرد."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "تا در این‌باره آنان را آزمایشی آتشین بنماییم و هرکس از یاد پروردگارش روی گرداند وی را در قید عذابی بسی بالا و بلند فرو می‌نهد."}, {"lang": "en", "name": "Ahmed Ali", "text": "In order to try them through it. But whoever turns away from the remembrance of his Lord, will be given increasing torment by Him.\""}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘In order to test them with it; and whoever turns away from the remembrance of his Lord – He will put him in a punishment that keeps on increasing.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "that We might try them therein. And whosoever turns away from the Remembrance of his Lord, He will thrust him into chastisement rigorous."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "That We might try them there by. And whosoever turneth aside from the remembrance of his Lord, him He shall thrust into a torment vehement."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "That We might try them thereby. And whosoever turns away from the Reminder of his Lord (i.e. this Quran, and practice not its laws and orders), He will cause him to enter in a severe torment (i.e. Hell)."}, {"lang": "en", "name": "Talal Itani", "text": "To test them with it. Whoever turns away from the remembrance of his Lord, He will direct him to torment ever mounting."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "so that We might try them through this bounty. Whoso turns away from the remembrance of his Lord, He will cause him to suffer a grievous chastisement;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "That We might try them thereby. And whosoever turns away from the Reminder of his Lord, He will cause him to enter in a Sa`ad torment."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "That We may test them thereby, and whoso turneth away from the remembrance of his Lord; He will thrust him into ever-growing torment."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "so that We may test them therein, and whoever turns away from the remembrance of his Lord, He will let him into an escalating punishment."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "and tested them with it. And whosoever turns away from his Lord's Remembrance, He will hurl him into a stern punishment."}, {"lang": "en", "name": "Saheeh International", "text": "So We might test them therein. And whoever turns away from the remembrance of his Lord He will put into arduous punishment."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "as a trial for them. God will make those who disregard the guidance from their Lord suffer increasing torment."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "So that We might try them with respect to it; and whoever turns aside from the reminder of his Lord, He will make him enter into an afflicting chastisement:"}, {"lang": "en", "name": "English Transliteration", "text": "Linaftinahum feehi waman yuAAri<u>d</u> AAan <u>th</u>ikri rabbihi yaslukhu AAa<u>tha</u>ban <u>s</u>aAAad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "so that We may test them by it -- whoever turns away from the remembrance of his Lord shall be sternly punished."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "\"That We might try them by that (means). But if any turns away from the remembrance of his Lord, He will cause him to undergo a severe Penalty."}]}, {"index": 5465, "local_index": 18, "part_type": "Verse", "path": "/books/quran:72:18", "text": "وَ أَنَ‌ الْمَسَاجِدَ لِلَّهِ‌ فَلاَ تَدْعُوا مَعَ‌ اللَّهِ‌ أَحَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و مساجد ویژه خداست، پس هیچ کس را با خدا مپرستید،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "و مسجدها از آنِ خداست. و با وجود خداى يكتا كسى را به خدايى مخوانيد."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و اين كه مساجد ويژه‌ى خداست، پس هيچ كس را با خدا نخوانيد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و مساجد ويژه خداست، پس هيچ كس را با خدا مخوانيد."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و مساجد مخصوص (پرستش ذات یکتای) خداست پس نباید با خدا احدی غیر او را پرستش کنید."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "مسجدها مختصّ پرستش خدا است، و (در آنها) کسی را با خدا پرستش نکنید. [[«أَنَّ الْمَسَاجِدَ لِلّهِ»: مساجد از آن خدا است. مراد این است که مساجد مختصّ عبادت خدا است، لذا در آنها کسی را با خدا عبادت نکنید. «لا تَدْعُوا»: مپرستید. عبادت نکنید.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و همه مسجدها خاص خداوند است، پس در جنب خداوند هیچ کس را [به پرستش‌] مخوان‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه مساجد از آن خداست، پس هیچ کس را با خدا نخوانید!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه سجده‌گاه‌ها از آن خدا است پس نخوانید با خدا کسی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و همانا مسجدها- يا اندامهاى سجده- براى خداست، پس با خداى يكتا كسى را مخوانيد- نپرستيد-."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و اینکه مساجد، به‌راستی ویژه‌ی خداست. پس هیچ کس را با خدا مخوانید."}, {"lang": "en", "name": "Ahmed Ali", "text": "All places of worship are for God; so do not invoke any one with God."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And that the mosques are for Allah only – therefore do not worship anyone along with Allah.’"}, {"lang": "en", "name": "A. J. Arberry", "text": "The places of worship belong to God; so call not, along with God, upon anyone."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And the prostrations are for Allah; wherefore call not along with Allah anyone."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "And the mosques are for Allah (Alone), so invoke not anyone along with Allah."}, {"lang": "en", "name": "Talal Itani", "text": "The places of worship are for God. So do not call, besides God, upon anyone else."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and that “mosques belong to Allah, so do not invoke anyone with Him”;"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And the Masjids are for Allah, so invoke not anyone along with Allah."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And the places of worship are only for Allah, so pray not unto anyone along with Allah."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "The places of worship belong to Allah, so do not invoke anyone along with Allah."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Mosques belong to Allah, so do not call to anyone else, other than Allah."}, {"lang": "en", "name": "Saheeh International", "text": "And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "All the parts of the body to be placed on the ground during prostration belong to God."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that the mosques are Allah's, therefore call not upon any one with Allah:"}, {"lang": "en", "name": "English Transliteration", "text": "Waanna almas<u>a</u>jida lill<u>a</u>hi fal<u>a</u> tadAAoo maAAa All<u>a</u>hi a<u>h</u>ad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "The mosques are for God's worship -- so do not invoke anyone else along with God --"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "\"And the places of worship are for Allah (alone): So invoke not any one along with Allah;"}]}, {"index": 5466, "local_index": 19, "part_type": "Verse", "path": "/books/quran:72:19", "text": "وَ أَنَّهُ‌ لَمَّا قَامَ‌ عَبْدُ اللَّهِ‌ يَدْعُوهُ‌ کَادُوا يَکُونُونَ‌ عَلَيْهِ‌ لِبَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "و اینکه هنگامی که بنده خدا [محمّد] برمی خاست تا خدا را عبادت کند [از جنیان به اندازه ای به سویش هجوم می بردند که] نزدیک بود جمعیت انبوه و متراکمی بر سر او بریزد،"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "چون بنده خدا براى پرستش او بر پاى ايستاد، گرد او را گرفتند."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "و اين كه چون بنده‌ى خدا [پيامبر به عبادت‌] برخاست تا او را بخواند، نزديك بود كه [به ازدحام‌] بر سر او فرو افتند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "و همين كه «بنده خدا» برخاست تا او را بخواند، چيزى نمانده بود كه بر سر وى فرو افتند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و چون بنده خاصّ خدا (محمّد صلّی اللّه علیه و آله و سلّم) قیام کرد و خدا را می‌خواند طایفه جنّیان (برای استماع قرآن) چنان گرد او ازدحام کردند که نزدیک بود بر سر هم فرو ریزند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "(به من وحی شده است که) چون بنده‌ی خدا (محمّد) بر پای ایستاد (و شروع به نماز و خواندن قرآن در آن کرد) و به پرستش خداوند پرداخت، کافران پیرامون او تنگِ یکدیگر ازدحام کردند. [[«عَبْدُاللهِ»: مراد حضرت محمّد است. «لِبَد»: جمع لِبْدَة، متراکم و انباشته. مجازاً به معنی گروه و دسته تنگ یکدیگر و پشت سر هم است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "و چنین بود که چون بنده خدا [محمد -ص-] او را به نیایش می‌خواند، نزدیکشان بود که بر سر او بریزند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "و اینکه هنگامی که بنده خدا [= محمّد (ص)] به عبادت برمی‌خاست و او را می‌خواند، گروهی پیرامون او بشدّت ازدحام می‌کردند!»"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "و آنکه هنگامی که بپای خاست بنده خدا تا بخواندش نزدیک بود بشوند بر او انبوه‌هایی‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "و چون بنده خدا- پيامبر"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "و اینکه چون بنده‌ی خدا به‌راستی، برخاست، حال آنکه خدا را می‌خواند، چیزی نمانده بود که بر سر و رویش فرو افتند."}, {"lang": "en", "name": "Ahmed Ali", "text": "When the devotee of God stood up to invoke Him (the jinns) crowded upon him (to listen)."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "‘And that when Allah’s bondman stood up to worship Him, the jinns had almost crowded upon him.’”"}, {"lang": "en", "name": "A. J. Arberry", "text": "When the servant of God stood calling on Him, they were wellnigh upon him in swarms."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "And when the bondman of Allah stood calling upon Him, they well nigh pressed on him stifling."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "(It has been revealed to me that) When the slave of Allah (Muhammad SAW) stood up invoking (his Lord Allah) in prayer to Him they (the jinns) just made round him a dense crowd as if sticking one over the other (in order to listen to the Prophet's recitation)."}, {"lang": "en", "name": "Talal Itani", "text": "And when the servant of God got up calling on Him, they almost fell on him in a mass."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "and when Allah's servant stood up to call on Him, they well-nigh swarmed him."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "And when the servant of Allah stood up invoking Him in prayer they just made round him a dense crowd as if sticking one over the other."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "And when the slave of Allah stood up in prayer to Him, they crowded on him, almost stifling."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "When the servant of Allah rose to pray to Him, they almost crowded around him."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "When the worshiper of Allah stood supplicating to Him, they swarmed around him (Prophet Muhammad)."}, {"lang": "en", "name": "Saheeh International", "text": "And that when the Servant of Allah stood up supplicating Him, they almost became about him a compacted mass.\""}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Do not prostrate before anyone other than Him. When the servant of God (Muhammad) preached (his message) the jinn would all crowd around him."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "And that when the servant of Allah stood up calling upon Him, they wellnigh crowded him (to death)."}, {"lang": "en", "name": "English Transliteration", "text": "Waannahu lamm<u>a</u> q<u>a</u>ma AAabdu All<u>a</u>hi yadAAoohu k<u>a</u>doo yakoonoona AAalayhi libad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "when God's servant stood up to pray to Him, they pressed close to him in great numbers, almost stifling him."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "\"Yet when the Devotee of Allah stands forth to invoke Him, they just make round him a dense crowd.\""}]}, {"index": 5467, "local_index": 20, "part_type": "Verse", "path": "/books/quran:72:20", "text": "قُلْ‌ إِنَّمَا أَدْعُو رَبِّي‌ وَ لاَ أُشْرِکُ‌ بِهِ‌ أَحَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بگو: من فقط پروردگارم را می پرستم، و هیچ کس را شریک او قرار نمی دهم."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "بگو: تنها پروردگارم را مى‌خوانم و هيچ كس را شريك او نمى‌سازم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "بگو: تنها پروردگار خود را مى‌خوانم و كسى را شريك او نمى‌كنم"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "بگو: «من تنها پروردگار خود را مى‌خوانم و كسى را با او شريك نمى‌گردانم.»"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "بگو: من تنها خدای خود را می‌پرستم و هرگز احدی را با او شریک نمی‌گردانم."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "بگو: تنها پروردگارم را می‌پرستم و کسی را انباز او نمی‌کنم. [[«أَدْعُو»: می‌پرستم. به کمک می‌طلبم. الف زائدی در رسم‌الخطّ قرآنی در آخر دارد.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بگو فقط پروردگارم را به نیایش می‌خوانم و هیچ کس را شریک او نمی‌شمارم‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "بگو: «من تنها پروردگارم را می‌خوانم و هیچ کس را شریک او قرار نمی‌دهم!»"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "بگو جز این نیست که خوانم پروردگار خویش را و شرک نورزم بدو کسی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "بگو: همانا من تنها پروردگارم را مى‌خوانم- مى‌پرستم- و هيچ كس را با وى انباز نمى‌گيرم."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بگو: «من تنها پروردگار خود را می‌خوانم و احدی را با او شریک نمی‌گردانم.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Say: \"I call on my Lord alone and I do not associate any one with Him.\""}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “I worship only Allah, and I do not ascribe any partner to Him.”"}, {"lang": "en", "name": "A. J. Arberry", "text": "Say: 'I call only upon my Lord, and I do not associate with Him anyone."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Say thou: I simply call upon Allah, and I associate not with Him any-one."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Say (O Muhammad SAW): \"I invoke only my Lord (Allah Alone), and I associate none as partners along with Him.\""}, {"lang": "en", "name": "Talal Itani", "text": "Say, “I pray only to my Lord, and I never associate anyone with Him.”"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Say, (O Prophet): “I call on my Lord alone, and I do not associate aught with Him in His Divinity.”"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Say: \"I invoke only my Lord, and I associate none as partners along with Him.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Say (unto them, O Muhammad): I pray unto Allah only, and ascribe unto Him no partner."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Say, ‘I pray only to my Lord, and I do not ascribe any partner to Him.’"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Say: 'I supplicate only to my Lord and I do not associate any with Him'"}, {"lang": "en", "name": "Saheeh International", "text": "Say, [O Muhammad], \"I only invoke my Lord and do not associate with Him anyone.\""}, {"lang": "en", "name": "Muhammad Sarwar", "text": "(Muhammad), say, \"I worship only my Lord and do not consider anyone equal to Him\"."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Say: I only call upon my Lord, and I do not associate any one with Him."}, {"lang": "en", "name": "English Transliteration", "text": "Qul innam<u>a</u> adAAoo rabbee wal<u>a</u> oshriku bihi a<u>h</u>ad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Say, \"I call only upon my Lord and do not associate anyone else with Him.\""}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Say: \"I do no more than invoke my Lord, and I join not with Him any (false god).\""}]}, {"index": 5468, "local_index": 21, "part_type": "Verse", "path": "/books/quran:72:21", "text": "قُلْ‌ إِنِّي‌ لاَ أَمْلِکُ‌ لَکُمْ‌ ضَرّاً وَ لاَ رَشَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بگو: من اختیار زیان و هدایتی را برای شما ندارم."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "بگو: من نمى‌توانم به شما زيانى برسانم يا شما را به صلاح آورم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "بگو: بى‌ترديد من [از جانب خودم‌] براى شما اختيار هيچ زيانى و هيچ رشد و هدايتى را ندارم"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "بگو: «من براى شما اختيار زيان و هدايتى را ندارم.»"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "و باز بگو: من مالک و قادر بر خیر و شرّ شما نیستم."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "بگو: من نمی‌توانم هیچ گونه زیانی و سودی به شما برسانم، و به هیچوجه نمی‌توانم گمراهتان سازم یا هدایتتان دهم. [[«ضَرّاً»: زیان. گمراهی. «رَشَداً»: خیر و خوبی. هدایت و توفیق. «لآ أَمْلِکُ لَکُمْ»: من نمی‌توانم زیان و ضرری را از شما دفع و برطرف کنم، و نمی‌توانم خیر و خوبی را به شما برسانم (نگا: زاد المسیر).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بگو من نه صاحب اختیار زیانی برای شما هستم، نه سامانی‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "بگو: «من مالک زیان و هدایتی برای شما نیستم!»"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "بگو همانا من ندارم برای شما زیان و نه سودی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "بگو: من براى شما نه هيچ زيانى را در توان دارم و نه هيچ رهنمونى به خير و صلاح و كمالى را [بى‌هدايت خدا]."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بگو: «من هرگز برای شما مالک هیچ زیان و سودی نیستم.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Say: \"Neither is your loss within my power nor bringing you to guidance.\""}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “I am not the master of any harm or benefit for you.”"}, {"lang": "en", "name": "A. J. Arberry", "text": "Say: 'Surely I possess no power over you, either for hurt or for rectitude.'"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Say thou: 'verily own not for you power of hurt nor of benefit"}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Say: \"It is not in my power to cause you harm, or to bring you to the Right Path.\""}, {"lang": "en", "name": "Talal Itani", "text": "Say, “It is not in my power to harm you, nor to bring you to right conduct.”"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Say: “Surely neither it is in my power to hurt you nor to bring you to the Right Way.”"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Say: \"It is not in my power to cause you harm, or to bring you to the right path.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Say: Lo! I control not hurt nor benefit for you."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Say, ‘I have no power to bring you any harm or good [of my own accord].’"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Say: 'Indeed, I possess no power over you, either for harm or for guidance'"}, {"lang": "en", "name": "Saheeh International", "text": "Say, \"Indeed, I do not possess for you [the power of] harm or right direction.\""}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Say, \"I do not possess any power to harm or benefit you\"."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Say: I do not control for you evil or good."}, {"lang": "en", "name": "English Transliteration", "text": "Qul innee l<u>a</u> amliku lakum <u>d</u>arran wal<u>a</u> rashad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Say, \"It is not in my power to cause you either harm or good?\""}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Say: \"It is not in my power to cause you harm, or to bring you to right conduct.\""}]}, {"index": 5469, "local_index": 22, "part_type": "Verse", "path": "/books/quran:72:22", "text": "قُلْ‌ إِنِّي‌ لَنْ‌ يُجِيرَنِي‌ مِنَ‌ اللَّهِ‌ أَحَدٌ وَ لَنْ‌ أَجِدَ مِنْ‌ دُونِهِ‌ مُلْتَحَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بگو: [اگر از او نافرمانی کنم] هرگز کسی در برابر [عذاب] خدا مرا پناه نمی دهد، و هرگز پناهگاهی غیر او نمی یابم."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "بگو: هيچ كس مرا از عقوبت خدا پناه ندهد و من جز او پناهگاهى نمى‌يابم."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "بگو: هرگز كسى مرا از [عقوبت‌] خدا پناه نمى‌دهد، و هرگز پناهگاهى جز او نخواهم يافت"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "بگو: «هرگز كسى مرا در برابر خدا پناه نمى‌دهد و هرگز پناهگاهى غير از او نمى‌يابم."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "باز بگو که (اگر خدا بر من قهر و غضب کند) ابدا کسی مرا از (قهر) خدا در پناه نتواند گرفت و به غیر او هیچ گریز گاهی هرگز نخواهم یافت."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "بگو: (اگر من از خدا نافرمانی کنم) هیچ کس مرا در برابر (خشم) خدا پناه نمی‌دهد، و پناهگاهی (برای حفظ خود از عذاب خدا) جز خدا نمی‌یابم. [[«لَن یُجِیرَنِی»: هرگز پناهم نمی‌دهد. هیچ وقت مرا در جوار خود نمی‌گیرد (نگا: مؤمنون / 88، احقاف / 31، ملک / 28). «مُلْتَحَداً»: پناهگاه. ملجأ (نگا: کهف / 27).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بگو هیچ کس نیست که هرگز مرا در برابر خداوند پناه دهد، و هرگز بجز او پناهی نمی‌یابم‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "بگو: «(اگر من نیز بر خلاف فرمانش رفتار کنم) هیچ کس مرا در برابر او حمایت نمی‌کند و پناهگاهی جز او نمی‌یابم؛"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "بگو همانا مرا پناه ندهد هرگز از خدا کسی و نه هرگز یابم جز او پناهگاهی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "بگو: همانا مرا هيچ كس از [عذاب‌] خداى پناه و زنهار ندهد- اگر در باره من عذابى خواسته باشد- و هرگز جز او پناهگاهى نيابم،"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بگو: «هرگز کسی مرا در برابر خدا پناه نمی‌دهد و هرگز پناهگاهی غیر از او نمی‌یابم.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Say: \"No one can save me from God, nor can I find a place of refuge apart from Him,"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Say, “No one will ever save me from Allah, and other than Him, I will not find any refuge.”"}, {"lang": "en", "name": "A. J. Arberry", "text": "Say: 'From God shall protect me not anyone, and I shall find, apart from Him, no refuge,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Say thou: 'verily none can protect me from Allah, nor can I find beside Him any refuge."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Say (O Muhammad SAW): \"None can protect me from Allah's punishment (if I were to disobey Him), nor should I find refuge except in Him."}, {"lang": "en", "name": "Talal Itani", "text": "Say, “No one can protect me from God, and I will not find any refuge except with Him."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Say: “None can protect me from Allah, nor can I find a refuge apart from Him."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Say: \"None can protect me from Allah's punishment, nor can I find refuge except in Him.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Say: Lo! none can protect me from Allah, nor can I find any refuge beside Him"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Say, ‘Neither can anyone shelter me from Allah, nor can I find any refuge besides Him."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Say: 'None shall protect me from Allah, and other than Him, I will find no refuge,"}, {"lang": "en", "name": "Saheeh International", "text": "Say, \"Indeed, there will never protect me from Allah anyone [if I should disobey], nor will I find in other than Him a refuge."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "Say, \"No one can protect me from God, nor can I find any place of refuge but with him."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Say: Surely no one can protect me against Allah, nor can I find besides Him any place of refuge:"}, {"lang": "en", "name": "English Transliteration", "text": "Qul innee lan yujeeranee mina All<u>a</u>hi a<u>h</u>adun walan ajida min doonihi multa<u>h</u>ad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Say, \"Surely no one can protect me against God, nor can I find besides Him any place of refuge."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Say: \"No one can deliver me from Allah (If I were to disobey Him), nor should I find refuge except in Him,"}]}, {"index": 5470, "local_index": 23, "part_type": "Verse", "path": "/books/quran:72:23", "text": "إِلاَّ بَلاَغاً مِنَ‌ اللَّهِ‌ وَ رِسَالاَتِهِ‌ وَ مَنْ‌ يَعْصِ‌ اللَّهَ‌ وَ رَسُولَهُ‌ فَإِنَ‌ لَهُ‌ نَارَ جَهَنَّمَ‌ خَالِدِينَ‌ فِيهَا أَبَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "[وظیفه من] فقط رساندن [برنامه های سعادت بخش] از سوی خدا و [رساندن] پیام های اوست. و آنان که از خدا و پیامبرش نافرمانی کنند، مسلماً آتش دوزخ برای آنان است و در آن جاودانه و همیشگی اند."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "آنچه مى‌توانم جز رساندن پيام او و انجام دادن رسالتهاى او نيست. و هر كه خدا و پيامبرش را نافرمانى كند، نصيب او آتش جهنم است كه همواره در آن خواهند بود،"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "[آنچه مى‌توانم‌] تنها ابلاغى از جانب خدا و رساندن پيام‌هاى اوست. و هر كه خدا و رسولش را نافرمانى كند، قطعا براى او آتش جهنم است كه جاودانه در آن خواهند ماند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "[وظيفه من‌] تنها ابلاغى از خدا و [رساندن‌] پيامهاى اوست.» و هر كس خدا و پيامبرش را نافرمانى كند قطعاً آتش دوزخ براى اوست و جاودانه در آن خواهند ماند."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "تنها مأمن و پناه من ابلاغ احکام خدا و رسانیدن پیغام الهی است، و آنان که نافرمانی خدا و رسول او کنند البته کیفرشان آتش دوزخ است که در آن تا ابد مخلّد باشند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "لیکن (تنها کاری که می‌توانم بکنم) تبلیغ از سوی خدا، و رساندن پیامهای او است. هر کس از خدا و پیغمبرش نافرمانی کند، نصیب او آتش دوزخ است و جاودانه در آن می‌ماند. [[«بَلاغاً»: ابلاغ تبلیغ. مستثنی از (لآ أَمْلِکُ) است و جملات میان آنها معترضه و برای تأکیدِ عدم استطاعت است (نگا: قاسمی). یا این که مفعول مطلق فعل محذوفی است. «رِسَالاتِهِ»: مراد از رسالتهای خدا توضیح مسائل مجمل قرآنی، در پرتو رهنمودهای آسمانی است. مثل توضیح و بیان احکام نماز و زکات و حجّ، و غیره (نگا: المصحف‌المیسّر).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "[در اختیار ندارم‌] مگر پیامی از جانب خداوند و رسالت او، و هر کس از خداوند و پیامبر او سرپیچی کند، او راست آتش دوزخ که جاودانه در آن ماند"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "تنها وظیفه من ابلاغ از سوی خدا و رساندن رسالات اوست؛ و هر کس نافرمانی خدا و رسولش کند، آتش دوزخ از آن اوست و جاودانه در آن می‌مانند!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "جز رساندنی از خدا و پیامهایش و آنکه نافرمانی کند خدا و پیمبرش را هر آینه او را است آتش دوزخ جاودان در آن همیشه‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "جز تبليغى از جانب خداى و رساندن پيامهاى او- كه تنها پناه من است-. و آنان كه خداى و پيامبرش را نافرمانى كنند، ايشان راست آتش دوزخ كه براى هميشه در آن جاويدان باشند."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«(وظیفه‌ی من) تنها ابلاغی از سوی خدا و (رساندن) پیام‌های اوست و هر کس خدا و پیامبرش را نافرمانی کند، بی‌گمان برای او آتش دوزخ جاودانه است.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Unless I convey from God and deliver His message.\" For those who disobey God and His Apostle is the fire of Hell, where they will abide for ever;"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "“I only convey the commands from Allah, and His messages; and whoever disobeys the commands of Allah and His Noble Messenger – then indeed for him is the fire of hell, in which they will remain for ever and ever.”"}, {"lang": "en", "name": "A. J. Arberry", "text": "excepting a Deliverance from God and His Messages. And whoso rebels against God and His messenger, for him there awaits the Fire of Gehenna; therein they shall dwell forever.'"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Mine is but the publishing from Allah and His messages; and whosoever disobeyeth Allah and His apostle, his portion verily is the Hell-Fire as abiders therein for evermore."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "\"(Mine is) but conveyance (of the truth) from Allah and His Messages (of Islamic Monotheism), and whosoever disobeys Allah and His Messenger, then verily, for him is the Fire of Hell, he shall dwell therein forever.\""}, {"lang": "en", "name": "Talal Itani", "text": "Except for a proclamation from God and His messages. He who defies God and His Messenger—for him is the Fire of Hell, in which they will dwell forever.”"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "(My task is no more than) to deliver Allah's proclamation and His messages. And whoever disobeys Allah and His Messenger, surely the Fire of Hell awaits him; therein he will abide in perpetuity.”"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "\"(Mine is) but conveyance from Allah and His Messages, and whosoever disobeys Allah and His Messenger, then verily, for him is the fire of Hell, he shall dwell therein forever.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "(Mine is) but conveyance (of the Truth) from Allah, and His messages; and whoso disobeyeth Allah and His messenger, lo! his is fire of hell, wherein such dwell for ever."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "[I have no duty] except to transmit from Allah, and [to communicate] His messages; and whoever disobeys Allah and His apostle, there will indeed be for him the fire of hell, to remain in it forever.’"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "except a deliverance from Allah and His Messages. He who disobeys Allah and His Messenger, for him is the Fire of Gehenna, which he will be in for ever."}, {"lang": "en", "name": "Saheeh International", "text": "But [I have for you] only notification from Allah, and His messages.\" And whoever disobeys Allah and His Messenger - then indeed, for him is the fire of Hell; they will abide therein forever."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "My only (means of protection) is to convey the message of God. Whoever disobeys God and His Messenger will go to hell, wherein he will live forever\"."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "(It is) only a delivering (of communications) from Allah and His messages; and whoever disobeys Allah and His Apostle surely he shall have the fire of hell to abide therein for a long time."}, {"lang": "en", "name": "English Transliteration", "text": "Ill<u>a</u> bal<u>a</u>ghan mina All<u>a</u>hi waris<u>a</u>l<u>a</u>tihi waman yaAA<u>s</u>i All<u>a</u>ha warasoolahu fainna lahu n<u>a</u>ra jahannama kh<u>a</u>lideena feeh<u>a</u> abad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "My duty is only to convey that which I receive from Him and His messages.\" For those who disobey God and His Messenger there is the fire of hell, wherein they will abide forever."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "\"Unless I proclaim what I receive from Allah and His Messages: for any that disobey Allah and His Messenger,- for them is Hell: they shall dwell therein for ever.\""}]}, {"index": 5471, "local_index": 24, "part_type": "Verse", "path": "/books/quran:72:24", "text": "حَتَّى‌ إِذَا رَأَوْا مَا يُوعَدُونَ‌ فَسَيَعْلَمُونَ‌ مَنْ‌ أَضْعَفُ‌ نَاصِراً وَ أَقَلُ‌ عَدَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "[اینان همواره شما را ضعیف و ناتوان و بی یار می شمارند] تا زمانی که آنچه را [از عذاب] وعده داده می شوند ببینند، پس به زودی آگاه می شوند چه کسی یاورش ناتوان تر و نفراتش کمتر است؟"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "تا آنگاه كه آنچه را به آنها وعده داده بودند بنگرند. پس خواهند دانست چه كسى را ياران ناتوان‌تر و شمار كمتر بوده است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "تا آن‌گاه كه آنچه را وعده داده مى‌شوند ببينند، پس به زودى خواهند دانست چه كسى از جهت [داشتن‌] ياور ضعيف‌تر و در عدد كم جمعيت‌تر است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "[باش‌] تا آنچه را وعده داده مى‌شوند ببينند، آنگاه دريابند كه ياور چه كسى ضعيف‌تر و كدام يك شماره‌اش كمتر است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "(ای رسول، کافران را رها کن) تا روزی که عذاب موعود خود را به چشم ببینند، آن زمان خواهند دانست که (تو و آنها) کدامتان یارانش ضعیف و ناتوان‌تر و سپاهش کمتر است؟"}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "(کافران همواره به استهزاء خود ادامه می‌دهند) تا زمانی که مشاهده خواهند کرد چیزی را که بدانان وعده داده شده است. آن گاه خواهند دانست که چه کسی (از کافر و مؤمن) یاورانش ناتوانتر، و شماره و تعدادش کمتر است. [[«حَتّی إِذَا رَأَوْا»: (نگا: مریم / 75). «نَاصِراً»: تمییز است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "تا هنگامی رسد که آنچه به آنان وعده داده شده است، ببینند، و زودا بدانند که چه کسی سست یاورتر و اندک سپاه‌تر است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "(این کار شکنی کفّار همچنان ادامه می‌یابد) تا آنچه را به آنها وعده داده شده ببینند؛ آنگاه می‌دانند چه کسی یاورش ضعیفتر و جمعیّتش کمتر است!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "تا گاهی که دیدند آنچه را وعده داده شوند زود است بدانند کیست ناتوان‌تر یاور و کیست کمتر بشمار"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "تا آنگاه كه آنچه به آنها وعده داده شده ببينند خواهند دانست كه چه كسى را يارانى ناتوان‌تر و به شمار كمتر است."}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "«تا هنگامی‌که آن چه را وعده داده می‌شوند ببینند. پس به زودی دریابند که یاور چه کسی کمکش ضعیف‌تر و کدام یک شمار‌ش کمتر است.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Until they see what they are promised, when they will understand who is weaker in aid and poorer in numbers."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Till the time when they will see what they are promised – so they will now come to know whose aide is weak, and who is lesser in number."}, {"lang": "en", "name": "A. J. Arberry", "text": "Until, when they see that which they are promised, then they will know who is weaker in helpers and fewer in numbers."}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "They shall go on denying until they; behold that which they are promised wherefore then they shall know who were weaker in protectors and fewer in number."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Till, when they see that which they are promised, then they will know who it is that is weaker concerning helpers and less important concerning numbers."}, {"lang": "en", "name": "Talal Itani", "text": "Until, when they see what they were promised, they will know who is weaker in helpers, and fewer in numbers."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "(They shall not change their ways) until they see that against which they had been warned, and then they will know whose helpers are weaker and whose supporters are fewer in number."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Till, when they see that which they are promised, then they will know who it is that is weaker concerning helpers and less important concerning numbers."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Till (the day) when they shall behold that which they are promised (they may doubt); but then they will know (for certain) who is weaker in allies and less in multitude."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "When they see what they are promised, they will know who is weaker in supporters and fewer in numbers."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "When they see that which they were promised they shall know who is weaker in helpers and fewer in numbers."}, {"lang": "en", "name": "Saheeh International", "text": "[The disbelievers continue] until, when they see that which they are promised, then they will know who is weaker in helpers and less in number."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "(On the Day of Judgment) when the disbelievers witness that with which they have been threatened, they will then know whose helpers are weaker and fewer in number."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Until when they see what they are threatened with, then shall they know who is weaker in helpers and fewer in number."}, {"lang": "en", "name": "English Transliteration", "text": "<u>H</u>att<u>a</u> i<u>tha</u> raaw m<u>a</u> yooAAadoona fasayaAAlamoona man a<u>d</u>AAafu n<u>as</u>iran waaqallu AAadad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "When they are confronted by what they have been promised, they will realize who is weaker in helpers and fewer in numbers."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "At length, when they see (with their own eyes) that which they are promised,- then will they know who it is that is weakest in (his) helper and least important in point of numbers."}]}, {"index": 5472, "local_index": 25, "part_type": "Verse", "path": "/books/quran:72:25", "text": "قُلْ‌ إِنْ‌ أَدْرِي‌ أَ قَرِيبٌ‌ مَا تُوعَدُونَ‌ أَمْ‌ يَجْعَلُ‌ لَهُ‌ رَبِّي‌ أَمَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "بگو: نمی دانم آیا آنچه را وعده داده می شوید نزدیک است یا پروردگارم برای آن زمانی طولانی قرار خواهد داد؟"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "بگو: من نمى‌دانم كه آيا آن وعده‌اى كه به شما داده‌اند نزديك است، يا پروردگار من براى آن زمانى نهاده است؟"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "بگو: من نمى‌دانم كه آيا آنچه وعده داده مى‌شويد نزديك است يا پروردگارم براى آن مدتى قرار مى‌دهد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "بگو: «نمى‌دانم آنچه را كه وعده داده شده‌ايد نزديك است يا پروردگارم براى آن زمانى نهاده است؟»"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "بگو: من خود ندانم که عذاب موعود شما وقتش نزدیک است یا خدا تا آن روز مدتی (بسیار) قرار داده است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "بگو: (ای کافران!) من نمی‌دانم آیا چیزی که به شما وعده داده می‌شود، نزدیک است، یا این که پروردگارم زمان طولانی و زیادی را برای آن در نظر گرفته است. [[«مَا تُوعَدُونَ»: آنچه به شما وعده داده می‌شود، مراد قیامت و عذاب آن است. «أَمَداً»: مدّت زمان طولانی (نگا: آل‌عمران / 30، کهف / 12، حدید / 16).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "بگو نمی‌دانم آنچه به شما وعده داده‌اند نزدیک است، یا پروردگار من برای آن فاصله‌ای [دراز] قرار داده است‌"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "بگو: «من نمی‌دانم آنچه به شما وعده داده شده نزدیک است یا پروردگارم زمانی برای آن قرارمی‌دهد؟!"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "بگو ندانم آیا نزدیک است آنچه وعده داده شوید یا برنهد برایش پروردگارم سرآمدی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "بگو: نمى‌دانم كه آيا آنچه وعده داده مى‌شويد- عذاب- نزديك است يا پروردگارم براى آن مدتى مى‌نهد"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "بگو: «من نمی‌دانم آن چه وعده داده می‌شوید، نزدیک است یا خدا برایش مدتی دور قرار می‌دهد.»"}, {"lang": "en", "name": "Ahmed Ali", "text": "Say: \"I do not know if what is promised you is near, or if my Lord prolongs its term."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “I do not know whether what you are promised is close or if my Lord will postpone it for a while.”"}, {"lang": "en", "name": "A. J. Arberry", "text": "Say: 'I do not know whether that which you are promised is nigh, or whether my Lord will appoint for it a space;"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Say thou: know not whather that which ye are promised is nigh, or whether my Lord hath appointed for it a distant term."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Say (O Muhammad SAW): \"I know not whether (the punishment) which you are promised is near or whether my Lord will appoint for it a distant term."}, {"lang": "en", "name": "Talal Itani", "text": "Say, “I do not know whether what you are promised is near, or whether my Lord will extend it for a period.”"}, {"lang": "en", "name": "Abul Ala Maududi", "text": "Say: “I know not whether what you are promised is near or whether my Lord will prolong its term."}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Say: \"I know not whether that which you are promised is near or whether my Lord will appoint for it a distant term.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Say (O Muhammad, unto the disbelievers): I know not whether that which ye are promised is nigh, or if my Lord hath set a distant term for it."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Say, ‘I do not know if what you are promised is near, or if my Lord has set a [long] term for it.’"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "Say: 'I do not know whether that which you are promised is near, or whether my Lord will set for it a time."}, {"lang": "en", "name": "Saheeh International", "text": "Say, \"I do not know if what you are promised is near or if my Lord will grant for it a [long] period.\""}, {"lang": "en", "name": "Muhammad Sarwar", "text": "(Muhammad), say, \"I do not know whether that with which you have been threatened is close by or whether my Lord will prolong the time of its coming."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Say: I do not know whether that with which you are threatened be nigh or whether my Lord will appoint for it a term:"}, {"lang": "en", "name": "English Transliteration", "text": "Qul in adree aqareebun m<u>a</u> tooAAadoona am yajAAalu lahu rabbee amad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "Say, \"I do not know whether what you are promised is imminent, or whether my Lord has set for it a far-off day."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "Say: \"I know not whether the (Punishment) which ye are promised is near, or whether my Lord will appoint for it a distant term."}]}, {"index": 5473, "local_index": 26, "part_type": "Verse", "path": "/books/quran:72:26", "text": "عَالِمُ‌ الْغَيْبِ‌ فَلاَ يُظْهِرُ عَلَى‌ غَيْبِهِ‌ أَحَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "[او] دانای غیب است و هیچ کس را بر غیب خود آگاه نمی کند؛"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "او داناى غيب است و غيب خود را بر هيچ كس آشكار نمى‌سازد،"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "[او] داناى غيب است و كسى را بر غيب خود آگاه نمى‌كند"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "داناى نهان است، و كسى را بر غيب خود آگاه نمى‌كند،"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "او دانای غیب عالم است و هیچ کس را بر غیب خود آگاه نمی‌کند."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "داننده‌ی غیب خدا است، و هیچ کسی را بر غیب خود آگاه نمی‌سازد. [[«عَالِمُ»: خبر مبتدای محذوف (هُوَ) یا بدل از (رَبّ) است. «فَلا یُظْهِرُ عَلی غَیْبِهِ»: (نگا: انعام / 59، نمل / 65).]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "اوست دانای [راز] پنهان، که هیچ کس را از غیب خویش آگاه نمی‌سازد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "دانای غیب اوست و هیچ کس را بر اسرار غیبش آگاه نمی‌سازد،"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "دانای نهان پس آگاه (یا چیره) نگرداند بر نهان خویش کسی را"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "داناى نهان و ناپيداست، پس كسى را بر غيب خود آگاه نسازد،"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "(خدا) عالِم (کل) غیب‌(ها) است، پس احدی را بر غیبش آگاه نمی‌کند."}, {"lang": "en", "name": "Ahmed Ali", "text": "He is the knower of the Unknown, and He does not divulge His secret to any one"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "The All Knowing of all the hidden does not give anyone the control over His secrets."}, {"lang": "en", "name": "A. J. Arberry", "text": "Knower He of the Unseen, and He discloses not His Unseen to anyone,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "He is the Knower of the unseen, and He discloseth not His unseen Unto anyone."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "\"(He Alone) the All-Knower of the Gha'ib (unseen), and He reveals to none His Gha'ib (unseen).\""}, {"lang": "en", "name": "Talal Itani", "text": "The Knower of the Invisible; He does not disclose His Invisible to anyone."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "He is the Knower of the Unseen, and He does not disclose His Unseen to anyone"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "\"The All-Knower of the Unseen, and He reveals to none His Unseen.\""}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "(He is) the Knower of the Unseen, and He revealeth unto none His secret,"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "Knower of the Unseen, He does not disclose His [knowledge of the] Unseen to anyone,"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "He is the Knower of the Unseen and does not disclose His Unseen to anyone,"}, {"lang": "en", "name": "Saheeh International", "text": "[He is] Knower of the unseen, and He does not disclose His [knowledge of the] unseen to anyone"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "He knows the unseen and He does not allow anyone to know His secrets except those of His Messengers whom He chooses."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "The Knower of the unseen! so He does not reveal His secrets to any,"}, {"lang": "en", "name": "English Transliteration", "text": "AA<u>a</u>limu alghaybi fal<u>a</u> yu<i><u>th</u></i>hiru AAal<u>a</u> ghaybihi a<u>h</u>ad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "He alone has knowledge of what is hidden. He reveals this to none,"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "\"He (alone) knows the Unseen, nor does He make any one acquainted with His Mysteries,-"}]}, {"index": 5474, "local_index": 27, "part_type": "Verse", "path": "/books/quran:72:27", "text": "إِلاَّ مَنِ‌ ارْتَضَى‌ مِنْ‌ رَسُولٍ‌ فَإِنَّهُ‌ يَسْلُکُ‌ مِنْ‌ بَيْنِ‌ يَدَيْهِ‌ وَ مِنْ‌ خَلْفِهِ‌ رَصَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "مگر پیامبرانی را که [برای آگاه شدن از غیب] برگزیده است، پس نگهبانانی [برای محافظت از آنان] از پیش رو و پشت سرشان می گمارد"}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "مگر بر آن پيامبرى كه از او خشنود باشد كه براى نگهبانى از او پيش روى و پشت سرش نگهبانى مى‌گمارد،"}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "مگر پيامبرى را كه [براى اين امر] بپسندد كه از پيش رو و پشت سرش مراقبانى گسيل مى‌دارد"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "جز پيامبرى را كه از او خشنود باشد، كه [در اين صورت‌] براى او از پيش رو و از پشت سرش نگاهبانانى بر خواهد گماشت،"}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "مگر آن کس را که به پیامبری برگزیده است که فرشتگان را از پیش رو و پشت سر او می‌فرستد (تا اسرار وحی را شیاطین به سرقت گوش نربایند)."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "مگر پیغمبری که خدا از او خوشنود باشد. خدا (برای حفظ آن مقدار غیبی که او را از آن مطّلع می‌کند، از میان فرشتگان) محافظان و نگهبانانی در پیش و پس او روان می‌دارد. [[«إِلاّ مَنِ ارْتَضی مِن رَّسُولٍ»: مگر پیغمبری که از او راضی باشد. خداوند تنها برخی از پیغمبران را بر بعضی از امور غیب مطّلع می‌سازد، آن هم بدان اندازه که بیانگر معجزات ایشان بوده و به مأموریّت و دعوتشان مربوط باشد (نگا: آل‌عمران / 49 و 179). «إِرْتَضی»: (نگا: انبیاء / 28، نور / 55). «یَسْلُکُ»: داخل می‌کند. روان می‌سازد (نگا: جنّ / 17). «بَیْنَ یَدَیْهِ وَ مِنْ خَلْفِهِ»: مراد همه جوانب و اطراف است. در وقت نزول غیب، خدا توسّط فرشتگان، پیغمبران را از هر سو می‌پاید، و از شیاطین و پریان و وسوسه‌های ایشان مراقبت و مواظبت می‌نماید (نگا: حجر / 9، شعراء / 212). «رَصَداً»: جمع راصِد، نگهبانان و مراقبان.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "مگر پیامبری که او بپسندد، که پیشاپیش و پشت سر او نگهبانانی راه دهد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "مگر رسولانی که آنان را برگزیده و مراقبینی از پیش رو و پشت سر برای آنها قرار می‌دهد..."}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "جز آنکو پسندد از فرستاده‌ای که می‌رود پیش رویش و از پشت سرش نگهبانی‌"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "مگر آن را كه به پيامبرى پسندد و برگزيند، زيرا كه از پيش روى و از پشت سرش نگهبانانى گسيل مى‌دارد"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "مگر کسی از رسولان را. پس او بی‌گمان از پیش و پس او مترصد است،"}, {"lang": "en", "name": "Ahmed Ali", "text": "Other than an apostle He has chosen, when He makes a sentinel walk in front of him and a sentinel behind,"}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "Except to His chosen Noble Messengers – so He appoints guards in front and behind him. (Allah gave the knowledge of the hidden to the Holy Prophet – peace and blessings be upon him.)"}, {"lang": "en", "name": "A. J. Arberry", "text": "save only to such a Messenger as He is well-pleased with; then He despatches before him and behind him watchers,"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "Save Unto an apostle chosen. And then He causeth to go before him and behind him a guard."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "Except to a Messenger (from mankind) whom He has chosen (He informs him of unseen as much as He likes), and then He makes a band of watching guards (angels) to march before him and behind him."}, {"lang": "en", "name": "Talal Itani", "text": "Except to a Messenger of His choosing. He then dispatches guards before him and behind him."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "other than to a Messenger whom He chooses (for the bestowal of any part of the knowledge of the Unseen), whereafter He appoints guards who go before him and behind him,"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Except to a Messenger whom He has chosen, and then He makes a band of watching guards to march before him and behind him."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "Save unto every messenger whom He hath chosen, and then He maketh a guard to go before him and a guard behind him"}, {"lang": "en", "name": "Ali Quli Qarai", "text": "except to an apostle He approves of. Then He dispatches a sentinel before and behind him"}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "except only to a Messenger that He has chosen, and He sends guardians before him and behind him,"}, {"lang": "en", "name": "Saheeh International", "text": "Except whom He has approved of messengers, and indeed, He sends before each messenger and behind him observers"}, {"lang": "en", "name": "Muhammad Sarwar", "text": "He causes angelic guards to march before and after him."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "Except to him whom He chooses as an apostle; for surely He makes a guard to march before him and after him,"}, {"lang": "en", "name": "English Transliteration", "text": "Ill<u>a</u> mani irta<u>da</u> min rasoolin fainnahu yasluku min bayni yadayhi wamin khalfihi ra<u>s</u>ad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "except the messenger whom He has chosen. He sends down guardians who walk before them and behind them,"}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "\"Except a messenger whom He has chosen: and then He makes a band of watchers march before him and behind him,"}]}, {"index": 5475, "local_index": 28, "part_type": "Verse", "path": "/books/quran:72:28", "text": "لِيَعْلَمَ‌ أَنْ‌ قَدْ أَبْلَغُوا رِسَالاَتِ‌ رَبِّهِمْ‌ وَ أَحَاطَ بِمَا لَدَيْهِمْ‌ وَ أَحْصَى‌ کُلَ‌ شَيْ‌ءٍ عَدَداً", "translations": [{"lang": "fa", "name": "Hussain Ansarian", "text": "تا مشخص کند که پیام های پروردگارشان را [به طور کامل به مردم] رسانده اند و او به آنچه نزد آنان است احاطه دارد، و همه چیز را از جهت عدد، شماره و احصا کرده است."}, {"lang": "fa", "name": "AbdolMohammad Ayati", "text": "تا بداند كه آنها پيامهاى پروردگارشان را رسانيده‌اند و خدا به آنچه در نزد آنهاست احاطه دارد و همه چيز را به عدد شمار كرده است."}, {"lang": "fa", "name": "Abolfazl Bahrampour", "text": "تا بداند كه محققا پيام‌هاى پروردگار خود را رسانده‌اند و [خدا] بدانچه نزد ايشان است احاطه دارد و هر چيزى را به عدد بر شمرده است"}, {"lang": "fa", "name": "Mohammad Mahdi Fooladvand", "text": "تا معلوم بدارد كه پيامهاى پروردگار خود را رسانيده‌اند؛ و [خدا] بدانچه نزد ايشان است احاطه دارد و هر چيزى را به عدد شماره كرده است."}, {"lang": "fa", "name": "Mahdi Elahi Ghomshei", "text": "تا بداند (و معلوم سازد) که آن رسولان پیغامهای پروردگار خود را به خلق کاملا رسانیده‌اند، و البته خدا به آنچه نزد رسولان است احاطه کامل دارد و به شماره هر چیز در عالم به خوبی آگاه است."}, {"lang": "fa", "name": "Mostafa Khorramdel", "text": "تا خدا بداند که پیغمبران پیامهای پروردگارشان را رسانده‌اند، هر چند که خدا از همه‌ی چیزهائی که نزدیک ایشان است (و در درون و بیرون آنان است) کاملاً آگاه بوده و بدانها احاطه دارد، و هر چیزی را دانه‌دانه سرشماری کرده است و دقیقاً می‌داند. [[«لِیَعْلَمَ»: (نگا: بقره / 143، آل‌عمران / 140). «عَدَداً»: شماره. شمرده. شمرنده. یکی‌یکی. تمییز است، و یا به معنی (إحصاء) و مفعول مطلق است، و یا این که در معنی (مَعْدُوداً) و حال (کُلَّ شَیْءٍ) و یا به معنی (عادّاً) و حال فاعل فعل (أَحْصی) است.]]"}, {"lang": "fa", "name": "Baha'oddin Khorramshahi", "text": "تا معلوم بدارد که رسالت پروردگارشان را گزارده‌اند و به آنچه نزد آنان است احاطه دارد، و هر چیز را به شماره می‌شمارد"}, {"lang": "fa", "name": "Naser Makarem Shirazi", "text": "تا بداند پیامبرانش رسالتهای پروردگارشان را ابلاغ کرده‌اند؛ و او به آنچه نزد آنهاست احاطه دارد و همه چیز را احصاء کرده است!»"}, {"lang": "fa", "name": "Mohammad Kazem Moezzi", "text": "تا بداند که همانا رساندند پیامهای پروردگار خویش را و فراگرفته است بدانچه نزد ایشان است و بشمرد (یا بپایان رساند) است همه چیز را بشمار"}, {"lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi", "text": "تا معلوم كند كه پيامهاى پروردگارشان را رسانده‌اند، و [خداى‌] آنچه را نزد ايشان"}, {"lang": "fa", "name": "Mohammad Sadeqi Tehrani", "text": "تا نشانه نهد که به‌درستی، رسالت‌های پروردگارشان را ابلاغ کرده‌اند. حال آنکه به آن چه نزدشان است، احاطه کرده و عدد هر چیزی (به‌خوبی) را برشمرده است."}, {"lang": "en", "name": "Ahmed Ali", "text": "So that He may know if they have delivered their Lord's messages. He comprehends all that has been given them, and keeps count of everything."}, {"lang": "en", "name": "Ahmed Raza Khan", "text": "In order to see that they have conveyed the messages of their Lord – and His knowledge encompasses all whatever they have, and He has kept all things accounted for."}, {"lang": "en", "name": "A. J. Arberry", "text": "that He may know they have delivered the Messages of their Lord; and He encompasses all that is with them, and He has numbered everything in numbers.'"}, {"lang": "en", "name": "Abdul Majid Daryabadi", "text": "That He may know that they have preached the message of their Lord. And He comprehendeth whatever is with them, and He keepeth count of everything numbered."}, {"lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan", "text": "[He (Allah) protects them (the Messengers)], till He sees that they (the Messengers) have conveyed the Messages of their Lord (Allah). And He (Allah) surrounds all that which is with them, and He (Allah) keeps count of all things (i.e. He knows the exact number of everything)."}, {"lang": "en", "name": "Talal Itani", "text": "That He may know that they have conveyed the messages of their Lord. He encompasses what they have, and has tallied everything by number."}, {"lang": "en", "name": "Abul Ala Maududi", "text": "so that He may know that they have delivered the messages of their Lord. He encompasses in His knowledge their surroundings and keeps a count of all things.”"}, {"lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri", "text": "Till he knows that they have conveyed the Messages of their Lord. And He surrounds all that which is with them, and He keeps count of all things."}, {"lang": "en", "name": "Mohammed Marmaduke William Pickthall", "text": "That He may know that they have indeed conveyed the messages of their Lord. He surroundeth all their doings, and He keepeth count of all things."}, {"lang": "en", "name": "Ali Quli Qarai", "text": "so that He may ascertain that they have communicated the messages of their Lord, and He encompasses all that is with them, and He keeps an count of all things."}, {"lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish", "text": "so that He may know that they have delivered the Messages of their Lord and He encompasses all that is with them, and He has counted everything innumbers'"}, {"lang": "en", "name": "Saheeh International", "text": "That he may know that they have conveyed the messages of their Lord; and He has encompassed whatever is with them and has enumerated all things in number."}, {"lang": "en", "name": "Muhammad Sarwar", "text": "(Messenger) so that He would know that the Messengers have conveyed the message of their Lord. He encompasses all that is with them and He keeps a precise account of all things\"."}, {"lang": "en", "name": "Mohammad Habib Shakir", "text": "So that He may know that they have truly delivered the messages of their Lord, and He encompasses what is with them and He records the number of all things."}, {"lang": "en", "name": "English Transliteration", "text": "LiyaAAlama an qad ablaghoo ris<u>a</u>l<u>a</u>ti rabbihim waa<u>hat</u>a bim<u>a</u> ladayhim waa<u>hsa</u> kulla shayin AAadad<u>a</u><b>n</b>"}, {"lang": "en", "name": "Wahiduddin Khan", "text": "so that He may know that the messengers have delivered the messages of their Lord. He encompasses all that is with them and He keeps count of all things."}, {"lang": "en", "name": "Abdullah Yusuf Ali", "text": "\"That He may know that they have (truly) brought and delivered the Messages of their Lord: and He surrounds (all the mysteries) that are with them, and takes account of every single thing.\""}]}]}, "index": "quran:72", "kind": "verse_list"}