{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 76"
        },
        "path": "/books/quran:76",
        "titles": {
          "ar": "الانسان",
          "en": "Man",
          "ent": "Al-Insaan"
        }
      }
    ],
    "default_verse_translation_ids": {
      "en": "en.qarai",
      "fa": "fa.makarem"
    },
    "index": 76,
    "local_index": 76,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 77"
        },
        "path": "/books/quran:77",
        "titles": {
          "ar": "المرسلات",
          "en": "The Emissaries",
          "ent": "Al-Mursalaat"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 75"
        },
        "path": "/books/quran:75",
        "titles": {
          "ar": "القيامة",
          "en": "The Resurrection",
          "ent": "Al-Qiyaama"
        }
      },
      "up": {
        "indexed_titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        },
        "path": "/books/quran",
        "titles": {
          "ar": "القرآن الكريم",
          "en": "The Holy Quran"
        }
      }
    },
    "order": 98,
    "part_type": "Chapter",
    "path": "/books/quran:76",
    "reveal_type": "Medinan",
    "rukus": 2,
    "titles": {
      "ar": "الانسان",
      "en": "Man",
      "ent": "Al-Insaan"
    },
    "verse_count": 31,
    "verse_start_index": 5591,
    "verse_translations": [
      {
        "id": "fa.ansarian",
        "lang": "fa",
        "name": "Hussain Ansarian"
      },
      {
        "id": "fa.ayati",
        "lang": "fa",
        "name": "AbdolMohammad Ayati"
      },
      {
        "id": "fa.bahrampour",
        "lang": "fa",
        "name": "Abolfazl Bahrampour"
      },
      {
        "id": "fa.fooladvand",
        "lang": "fa",
        "name": "Mohammad Mahdi Fooladvand"
      },
      {
        "id": "fa.ghomshei",
        "lang": "fa",
        "name": "Mahdi Elahi Ghomshei"
      },
      {
        "id": "fa.khorramdel",
        "lang": "fa",
        "name": "Mostafa Khorramdel"
      },
      {
        "id": "fa.khorramshahi",
        "lang": "fa",
        "name": "Baha'oddin Khorramshahi"
      },
      {
        "id": "fa.makarem",
        "lang": "fa",
        "name": "Naser Makarem Shirazi"
      },
      {
        "id": "fa.moezzi",
        "lang": "fa",
        "name": "Mohammad Kazem Moezzi"
      },
      {
        "id": "fa.mojtabavi",
        "lang": "fa",
        "name": "Sayyed Jalaloddin Mojtabavi"
      },
      {
        "id": "fa.sadeqi",
        "lang": "fa",
        "name": "Mohammad Sadeqi Tehrani"
      },
      {
        "id": "en.ahmedali",
        "lang": "en",
        "name": "Ahmed Ali"
      },
      {
        "id": "en.ahmedraza",
        "lang": "en",
        "name": "Ahmed Raza Khan"
      },
      {
        "id": "en.arberry",
        "lang": "en",
        "name": "A. J. Arberry"
      },
      {
        "id": "en.daryabadi",
        "lang": "en",
        "name": "Abdul Majid Daryabadi"
      },
      {
        "id": "en.hilali",
        "lang": "en",
        "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"
      },
      {
        "id": "en.itani",
        "lang": "en",
        "name": "Talal Itani"
      },
      {
        "id": "en.maududi",
        "lang": "en",
        "name": "Abul Ala Maududi"
      },
      {
        "id": "en.mubarakpuri",
        "lang": "en",
        "name": "Safi-ur-Rahman al-Mubarakpuri"
      },
      {
        "id": "en.pickthall",
        "lang": "en",
        "name": "Mohammed Marmaduke William Pickthall"
      },
      {
        "id": "en.qarai",
        "lang": "en",
        "name": "Ali Quli Qarai"
      },
      {
        "id": "en.qaribullah",
        "lang": "en",
        "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"
      },
      {
        "id": "en.sahih",
        "lang": "en",
        "name": "Saheeh International"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Muhammad Sarwar"
      },
      {
        "id": "en.shakir",
        "lang": "en",
        "name": "Mohammad Habib Shakir"
      },
      {
        "id": "en.transliteration",
        "lang": "en",
        "name": "English Transliteration"
      },
      {
        "id": "en.wahiduddin",
        "lang": "en",
        "name": "Wahiduddin Khan"
      },
      {
        "id": "en.yusufali",
        "lang": "en",
        "name": "Abdullah Yusuf Ali"
      }
    ],
    "verses": [
      {
        "index": 5592,
        "local_index": 1,
        "part_type": "Verse",
        "path": "/books/quran:76:1",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:3:24:5"
          ]
        },
        "text": [
          "هَلْ‌ أَتَى‌ عَلَى‌ الْإِنْسَانِ‌ حِينٌ‌ مِنَ‌ الدَّهْرِ لَمْ‌ يَکُنْ‌ شَيْئاً مَذْکُوراً"
        ],
        "translations": {
          "en.ahmedali": [
            "WAS THERE NOT a time in the life of man when he was not even a mentionable thing?"
          ],
          "en.ahmedraza": [
            "Indeed there has been a time for man, when even his name did not exist anywhere."
          ],
          "en.arberry": [
            "Has there come on man a while of time when he was a thing unremembered?"
          ],
          "en.daryabadi": [
            "Surely there hath come upon man a space of time when he was not a thing worth mentioning."
          ],
          "en.hilali": [
            "Has there not been over man a period of time, when he was nothing to be mentioned?"
          ],
          "en.itani": [
            "Has there come upon man a period of time when he was nothing to be mentioned?"
          ],
          "en.maududi": [
            "Was there a period of time when man was not even worthy of a mention?"
          ],
          "en.mubarakpuri": [
            "Has there not been over man a period of time, when he was not a thing worth mentioning"
          ],
          "en.pickthall": [
            "Hath there come upon man (ever) any period of time in which he was a thing unremembered?"
          ],
          "en.qarai": [
            "Has there been a period of time for man when he was not anything worthy of mention?"
          ],
          "en.qaribullah": [
            "Indeed, there came upon the human a period of time when he was an unremembered thing."
          ],
          "en.sahih": [
            "Has there [not] come upon man a period of time when he was not a thing [even] mentioned?"
          ],
          "en.sarwar": [
            "There was certainly a time when there was no mention of the human being."
          ],
          "en.shakir": [
            "There surely came over man a period of time when he was a thing not worth mentioning."
          ],
          "en.transliteration": [
            "Hal at<u>a</u> AAal<u>a</u> alins<u>a</u>ni <u>h</u>eenun mina a<b>l</b>ddahri lam yakun shayan ma<u>th</u>koor<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Was there not a period of time when man was nothing worth mentioning?"
          ],
          "en.yusufali": [
            "Has there not been over Man a long period of Time, when he was nothing - (not even) mentioned?"
          ],
          "fa.ansarian": [
            "آیا بر انسان زمانی از روزگار گذشت که چیزی در خور ذکر نبود؟"
          ],
          "fa.ayati": [
            "هرآينه بر انسان مدتى از زمان گذشت و او چيزى در خور ذكر نبود."
          ],
          "fa.bahrampour": [
            "مگر نه اين است كه مدت زمانى بر انسان گذشت كه چيز قابل ذكرى نبود"
          ],
          "fa.fooladvand": [
            "آيا زمانى طولانى بر انسان گذشت كه چيز قابل ذكرى نبود؟!"
          ],
          "fa.ghomshei": [
            "آیا بر انسان روزگارانی نگذشت که چیزی هیچ لایق ذکر نبود؟"
          ],
          "fa.khorramdel": [
            "آیا (جز این است که) مدّت زمانی بر انسان (در شکم مادر، به گونه‌ی نطفه و جنین) گذشته است و او چیز قابل ذکر و شایسته‌ی توجّه نبوده است؟! [[«هَلْ أَتی ...»: = قَدْ أَتی. استفهام تقریری است و مراد تحقّق و تذکّر است، یعنی بلی که چنین زمانی بوده است. «مَذْکُوراً»: قابل ذکر. دارای نام و نشان.]]"
          ],
          "fa.khorramshahi": [
            "آری مدتی از روزگار بر انسان گذشت که هنوز چیزی قابل ذکر نبود"
          ],
          "fa.makarem": [
            "آیا زمانی طولانی بر انسان گذشت که چیز قابل ذکری نبود؟!"
          ],
          "fa.moezzi": [
            "آیا گذشت بر انسان گاهی از روزگار که نبود چیزی یادآورده‌"
          ],
          "fa.mojtabavi": [
            "آيا بر آدمى روزگارى بر آمد كه چيزى يادكردنى نبود؟"
          ],
          "fa.sadeqi": [
            "آیا زمانی از دهر [:طول زمان جهان] بر انسان گذشت که چیزی قابل ذکر نبود؟!"
          ]
        }
      },
      {
        "index": 5593,
        "local_index": 2,
        "part_type": "Verse",
        "path": "/books/quran:76:2",
        "text": [
          "إِنَّا خَلَقْنَا الْإِنْسَانَ‌ مِنْ‌ نُطْفَةٍ أَمْشَاجٍ‌ نَبْتَلِيهِ‌ فَجَعَلْنَاهُ‌ سَمِيعاً بَصِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "Verily We created man from a sperm yoked (to the ovum) to bring out his real substance, then gave him hearing and sight."
          ],
          "en.ahmedraza": [
            "Indeed We have created man from mixed semen; in order to test him – We therefore made him hearing, knowing."
          ],
          "en.arberry": [
            "We created man of a sperm-drop, a mingling, and We made him hearing, seeing."
          ],
          "en.daryabadi": [
            "Verily We! We created man from a sperm of mixtures, that We might prove him, wherefore We made him hearing, seeing."
          ],
          "en.hilali": [
            "Verily, We have created man from Nutfah drops of mixed semen (discharge of man and woman), in order to try him, so We made him hearer, seer."
          ],
          "en.itani": [
            "We created man from a liquid mixture, to test him; and We made him hearing and seeing."
          ],
          "en.maududi": [
            "Verily We created man out of a drop of intermingled sperm so that We might try him, and We therefore endowed him with hearing and sight."
          ],
          "en.mubarakpuri": [
            "Verily, We have created man from Nutfah Amshaj, in order to try him, so, We made him hearer and seer."
          ],
          "en.pickthall": [
            "Lo! We create man from a drop of thickened fluid to test him; so We make him hearing, knowing."
          ],
          "en.qarai": [
            "Indeed We created man from the drop of a mixed fluid so that We may put him to test, so We endowed with hearing and sight."
          ],
          "en.qaribullah": [
            "We have created the human from a (sperm) drop, a mixture, testing him; We made him to hear and see."
          ],
          "en.sahih": [
            "Indeed, We created man from a sperm-drop mixture that We may try him; and We made him hearing and seeing."
          ],
          "en.sarwar": [
            "We created the human being from the union of sperm and egg to test him. We gave him hearing and vision."
          ],
          "en.shakir": [
            "Surely We have created man from a small life-germ uniting (itself): We mean to try him, so We have made him hearing, seeing."
          ],
          "en.transliteration": [
            "Inn<u>a</u> khalaqn<u>a</u> alins<u>a</u>na min nu<u>t</u>fatin amsh<u>a</u>jin nabtaleehi fajaAAaln<u>a</u>hu sameeAAan ba<u>s</u>eer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "We created man from a drop of mingled fluid so that We might try him; We gave him hearing and sight;"
          ],
          "en.yusufali": [
            "Verily We created Man from a drop of mingled sperm, in order to try him: So We gave him (the gifts), of Hearing and Sight."
          ],
          "fa.ansarian": [
            "ما انسان را از نطفه آمیخته و مختلطی [از مواد و عناصر] آفریدیم و او را از حالتی به حالتی و شکلی به شکلی [از نطفه به علقه، از علقه به مضغه، از مضغه به استخوان تا طفلی کامل] درآوردیم، پس او را شنوا و بینا قرار دادیم."
          ],
          "fa.ayati": [
            "ما آدمى را از نطفه‌اى آميخته بيافريده‌ايم، تا او را امتحان كنيم. و شنوا و بينايش ساخته‌ايم."
          ],
          "fa.bahrampour": [
            "همانا ما انسان را از نطفه‌اى آميخته آفريديم، كه او را خواهيم آزمود، پس وى را شنوا و بينا گردانيديم"
          ],
          "fa.fooladvand": [
            "ما انسان را از نطفه مختلطى آفريديم، و او را مى‌آزماييم؛ (بدين جهت) او را شنوا و بينا قرار داديم!"
          ],
          "fa.ghomshei": [
            "ما انسان را از آب نطفه مختلط (بی حس و شعور) خلق کردیم و او را می‌آزماییم و بدین سبب دارای قوای چشم و گوش (و مشاعر و عقل و هوش) گردانیدیم."
          ],
          "fa.khorramdel": [
            "ما انسان را از نطفه‌ی آمیخته (از اسپرماتوزوئید و اوول) آفریده‌ایم، و چون او را (با وظائف و تکالیفی، بعدها) می‌آزمائیم، وی را شنوا و بینا، (به عبارت دیگر عاقل و دانا) کرده‌ایم. [[«أَمْشَاجٍ»: جمع مَشَِج یا مَشیج، آمیخته. آمیزه. مراد ترکیبی از موادّ و عناصر مختلف، یا آمیزه‌ای از اسپرماتوزوئید و اوول است. صفت (نُطْفَةٍ) است، چرا که مراد از نطفه، مجموع اسپرماتوزوئید و اوول، یا اجزاء مختلفه است و موصوف به منزله جمع گرفته شده است (نگا: روح‌المعانی). «نَبْتَلِیهِ»: او را با وظائف و تکالیف و عبادات می‌آزمائیم. «فَجَعَلْنَاهُ»: حرف (فَ) سببیّه است، و اصل جمله بدین شکل است: فَجَعَلْنَاهُ سَمِیعاً بَصِیراً لِنَبْتَلِیَهُ (نگا: تفسیرالقرآنی للقرآن).]]"
          ],
          "fa.khorramshahi": [
            "ما انسان را از نطفه‌ای آمیخته آفریده‌ایم و به آزمونش کشانده‌ایم، و او را شنوا و بینا ساخته‌ایم‌"
          ],
          "fa.makarem": [
            "ما انسان را از نطفه مختلطی آفریدیم، و او را می‌آزماییم؛ (بدین جهت) او را شنوا و بینا قرار دادیم!"
          ],
          "fa.moezzi": [
            "همانا ما آفریدیم انسان را از چکّه آبی به هم آمیخته که می‌آزمودیمش پس گردانیدیمش شنوائی بینا"
          ],
          "fa.mojtabavi": [
            "ما آدمى را از نطفه‌اى آميخته- نطفه مرد و زن- بيافريديم، او را مى‌آزماييم و از اين رو شنوا و بينايش ساختيم"
          ],
          "fa.sadeqi": [
            "ما بی‌گمان انسان را از نطفه‌ای همسازان [:مخلوط] آفریدیم -‌حال آنکه او را همواره می‌آزماییم‌- پس شنوا و بینایش کردیم."
          ]
        }
      },
      {
        "index": 5594,
        "local_index": 3,
        "part_type": "Verse",
        "path": "/books/quran:76:3",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:2:1:165:4",
            "/books/al-kafi:1:3:32:3"
          ]
        },
        "text": [
          "إِنَّا هَدَيْنَاهُ‌ السَّبِيلَ‌ إِمَّا شَاکِراً وَ إِمَّا کَفُوراً"
        ],
        "translations": {
          "en.ahmedali": [
            "We surely showed him the way that he may either be grateful or deny."
          ],
          "en.ahmedraza": [
            "We have indeed shown him the way – whether he is grateful or ingrate."
          ],
          "en.arberry": [
            "Surely We guided him upon the way whether he be thankful or unthankful."
          ],
          "en.daryabadi": [
            "Verily We! We shewed him the way; then he becometh either thankful or ingrate."
          ],
          "en.hilali": [
            "Verily, We showed him the way, whether he be grateful or ungrateful."
          ],
          "en.itani": [
            "We guided him to the way, be he appreciative or unappreciative."
          ],
          "en.maududi": [
            "Surely We showed him the Right Path, regardless of whether he chooses to be thankful or unthankful (to his Lord)."
          ],
          "en.mubarakpuri": [
            "Verily, We guided him to the way, whether he be grateful or ungrateful."
          ],
          "en.pickthall": [
            "Lo! We have shown him the way, whether he be grateful or disbelieving."
          ],
          "en.qarai": [
            "Indeed We have guided him to the way, be he grateful or ungrateful."
          ],
          "en.qaribullah": [
            "Indeed, We have guided him to the path, he is either grateful or ungrateful."
          ],
          "en.sahih": [
            "Indeed, We guided him to the way, be he grateful or be he ungrateful."
          ],
          "en.sarwar": [
            "We showed him the right path whether he would be grateful or ungrateful."
          ],
          "en.shakir": [
            "Surely We have shown him the way: he may be thankful or unthankful."
          ],
          "en.transliteration": [
            "Inn<u>a</u> hadayn<u>a</u>hu a<b>l</b>ssabeela imm<u>a</u> sh<u>a</u>kiran waimm<u>a</u> kafoor<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "We showed him the way, whether he be grateful or ungrateful."
          ],
          "en.yusufali": [
            "We showed him the Way: whether he be grateful or ungrateful (rests on his will)."
          ],
          "fa.ansarian": [
            "ما راه را به او نشان دادیم یا سپاس گزار خواهد بود یا ناسپاس."
          ],
          "fa.ayati": [
            "راه را به او نشان داده‌ايم. يا سپاسگزار باشد يا ناسپاس."
          ],
          "fa.bahrampour": [
            "ما راه را به او نشان داديم، يا سپاسگزار است [مى‌پذيرد] و يا كفران [مى‌كند]"
          ],
          "fa.fooladvand": [
            "ما راه را به او نشان داديم، خواه شاكر باشد (و پذيرا گردد) يا ناسپاس!"
          ],
          "fa.ghomshei": [
            "ما به حقیقت راه (حق و باطل) را به او نمودیم حال خواهد (هدایت پذیرد و) شکر (این نعمت) گوید و خواهد (آن نعمت را) کفران کند."
          ],
          "fa.khorramdel": [
            "ما راه را بدو نموده‌ایم، چه او سپاسگزار باشد یا بسیار ناسپاس. [[«إِنَّا هَدَیْنَاهُ السَّبِیلَ»: خدا راه را به انسانها نشان داده است. خرد را بدو بخشیده است، و کتاب هستی را در مقابل دیدگانش باز کرده است، و پیغمبرانی برای او روانه نموده است، و بالاخره راه خوب و راه بد را بدو نشان داده است (نگا: بلد / 10). این، انسان است که به اختیار و انتخاب خود راه سعادت یا راه شقاوت می‌پوید و بهشت یا دوزخ را می‌جوید (نگا: فصّلت / 17). «شَاکِراً»: حال ضمیر (ه) است. برخی هم احتمال می‌دهند که خبر (یَکُونُ) محذوفی بوده و تقدیر چنین است: إمَّا یَکُونُ شَاکِراً وَ إمَّا یَکُونُ کَفُوراً.]]"
          ],
          "fa.khorramshahi": [
            "ما او را به راه آورده‌ایم، چه سپاسگزار باشد، چه ناسپاس‌"
          ],
          "fa.makarem": [
            "ما راه را به او نشان دادیم، خواه شاکر باشد (و پذیرا گردد) یا ناسپاس!"
          ],
          "fa.moezzi": [
            "همانا رهبریش کردیم راه را یا سپاسگزار و یا ناسپاس‌"
          ],
          "fa.mojtabavi": [
            "ما راه را به او بنموديم، يا سپاسگزار باشد و يا ناسپاس."
          ],
          "fa.sadeqi": [
            "ما همانا راه را به او نشان دادیم، خواه سپاسگزار باشد یا بسی ناسپاس!"
          ]
        }
      },
      {
        "index": 5595,
        "local_index": 4,
        "part_type": "Verse",
        "path": "/books/quran:76:4",
        "text": [
          "إِنَّا أَعْتَدْنَا لِلْکَافِرِينَ‌ سَلاَسِلَ‌ وَ أَغْلاَلاً وَ سَعِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "We have prepared for unbelievers chains and collars and a blazing fire."
          ],
          "en.ahmedraza": [
            "We have indeed kept prepared chains, and shackles and a blazing fire for the disbelievers."
          ],
          "en.arberry": [
            "Surely We have prepared for the unbelievers chains, fetters, and a Blaze."
          ],
          "en.daryabadi": [
            "Verily We! We have gotten ready for the infidels chains and collars and a Blaze."
          ],
          "en.hilali": [
            "Verily, We have prepared for the disbelievers iron chains, iron collars, and a blazing Fire."
          ],
          "en.itani": [
            "We have prepared for the faithless chains, and yokes, and a Searing Fire."
          ],
          "en.maududi": [
            "For the unbelievers, We have kept ready chains and fetters and a Blazing Fire."
          ],
          "en.mubarakpuri": [
            "Verily, We have prepared for the disbelievers iron chains, iron collars, and Sa`ir."
          ],
          "en.pickthall": [
            "Lo! We have prepared for disbelievers manacles and carcans and a raging fire."
          ],
          "en.qarai": [
            "Indeed for the faithless We have prepared chains, iron collars, and a blaze."
          ],
          "en.qaribullah": [
            "Indeed, for the unbelievers We have prepared chains, fetters and a Blazing (Fire)."
          ],
          "en.sahih": [
            "Indeed, We have prepared for the disbelievers chains and shackles and a blaze."
          ],
          "en.sarwar": [
            "We have prepared chains, shackles, and flaming fire (for the disbelievers)."
          ],
          "en.shakir": [
            "Surely We have prepared for the unbelievers chains and shackles and a burning fire."
          ],
          "en.transliteration": [
            "Inn<u>a</u> aAAtadn<u>a</u> lilk<u>a</u>fireena sal<u>a</u>sila waaghl<u>a</u>lan wasaAAeer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "[Now,] behold, for those who deny the truth, We have prepared chains, iron collars and a blazing fire, but"
          ],
          "en.yusufali": [
            "For the Rejecters we have prepared chains, yokes, and a blazing Fire."
          ],
          "fa.ansarian": [
            "ما برای کافران زنجیرها و بندها و آتش فروزان آماده کرده ایم."
          ],
          "fa.ayati": [
            "ما براى كافران زنجيرها و غلها و آتش افروخته آماده كرده‌ايم."
          ],
          "fa.bahrampour": [
            "بى‌گمان، ما براى كافران زنجيرها و بندها و شعله‌هاى سوزان آماده كرده‌ايم"
          ],
          "fa.fooladvand": [
            "ما براى كافران، زنجيرها و غُلها و شعله‌هاى سوزان آتش آماده كرده‌ايم!"
          ],
          "fa.ghomshei": [
            "ما برای (کیفر) کافران غل و زنجیرها و آتش سوزان مهیّا ساخته‌ایم."
          ],
          "fa.khorramdel": [
            "ما برای کافران زنجیرها و غلّها و آتش فروزان دوزخ را آماده کرده‌ایم. [[«سَلاسِلَ»: جمع سِلْسِلَة، زنجیرها. در رسم‌الخطّ قرآنی الف زائدی در آخر دارد. «أَغْلالاً»: (نگا: اعراف / 157، رعد / 5، غافر / 71).]]"
          ],
          "fa.khorramshahi": [
            "ما برای کافران زنجیرها و بندها و آتش فروزان آماده ساخته‌ایم‌"
          ],
          "fa.makarem": [
            "ما برای کافران، زنجیرها و غلها و شعله‌های سوزان آتش آماده کرده‌ایم!"
          ],
          "fa.moezzi": [
            "همانا ما آماده ساختیم برای کافران زنجیرهائی و گندهائی و آتشی سوزان‌"
          ],
          "fa.mojtabavi": [
            "ما براى كافران زنجيرها و بندها و آتش سوزان آماده ساخته‌ايم."
          ],
          "fa.sadeqi": [
            "ما برای کافران، زنجیرها و غل‌ها و شعله‌های سوزان آتش را آماده کرده‌ایم!"
          ]
        }
      },
      {
        "index": 5596,
        "local_index": 5,
        "part_type": "Verse",
        "path": "/books/quran:76:5",
        "text": [
          "إِنَ‌ الْأَبْرَارَ يَشْرَبُونَ‌ مِنْ‌ کَأْسٍ‌ کَانَ‌ مِزَاجُهَا کَافُوراً"
        ],
        "translations": {
          "en.ahmedali": [
            "Surely the devotees will drink cups flavoured with palm blossoms"
          ],
          "en.ahmedraza": [
            "Indeed the virtuous will drink from a cup, containing a mixture of Kafoor."
          ],
          "en.arberry": [
            "Surely the pious shall drink of a cup whose mixture is camphor,"
          ],
          "en.daryabadi": [
            "Verily the pious shall drink of a cup whereof the admixture is like Unto camphor."
          ],
          "en.hilali": [
            "Verily, the Abrar (pious, who fear Allah and avoid evil), shall drink a cup (of wine) mixed with water from a spring in Paradise called Kafur."
          ],
          "en.itani": [
            "But the righteous will drink from a cup whose mixture is aroma."
          ],
          "en.maududi": [
            "The virtuous shall drink from a cup tempered with camphor water."
          ],
          "en.mubarakpuri": [
            "Verily, the Abrar (righteous believers) shall drink of a cup mixed with Kafur."
          ],
          "en.pickthall": [
            "Lo! the righteous shall drink of a cup whereof the mixture is of Kafur,"
          ],
          "en.qarai": [
            "Indeed the pious will drink from a cup seasoned with Kafur,"
          ],
          "en.qaribullah": [
            "But the righteous shall drink of a goblet mixed with camphor;"
          ],
          "en.sahih": [
            "Indeed, the righteous will drink from a cup [of wine] whose mixture is of Kafur,"
          ],
          "en.sarwar": [
            "The virtuous ones will drink from a cup containing camphor"
          ],
          "en.shakir": [
            "Surely the righteous shall drink of a cup the admixture of which is camphor"
          ],
          "en.transliteration": [
            "Inna alabr<u>a</u>ra yashraboona min kasin k<u>a</u>na miz<u>a</u>juh<u>a</u> k<u>a</u>foor<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "the righteous shall drink from a cup mixed with the coolness of kafur,"
          ],
          "en.yusufali": [
            "As to the Righteous, they shall drink of a Cup (of Wine) mixed with Kafur,-"
          ],
          "fa.ansarian": [
            "همانا نیکان همواره از جامی می نوشند که نوشیدنی اش آمیخته به کافور [آن ماده سرد، سپید و معطر] است."
          ],
          "fa.ayati": [
            "نيكان از جامهايى مى‌نوشند كه آميخته به كافور است:"
          ],
          "fa.bahrampour": [
            "همانا نيكان از جامى نوشند كه با عطر خوشى آميخته است"
          ],
          "fa.fooladvand": [
            "به يقين ابرار (و نيكان) از جامى مى‌نوشند كه با عطر خوشى آميخته است،"
          ],
          "fa.ghomshei": [
            "نکوکاران عالم (که در این آیه حضرت علی و فاطمه و حسنین علیهم السّلام و شیعیانشان به اجماع خاصّه و اخبار عامّه مقصودند) در بهشت از جام شرابی نوشند که طبعش (در لطف و رنگ و بوی) کافور است."
          ],
          "fa.khorramdel": [
            "نیکان، جامهای شرابی را سر می‌کشند و می‌نوشند که آمیخته به کافور است. [[«کَأْسٍ»: جام پر از شراب. «مِزَاجُ»: آمیزه. آمیخته. چیزی که در جام است که خود شراب است. «کَافُوراً»: گیاه خوشبوئی است که عربها آن را به داخل شراب می‌ریختند تا معطّر گردد (نگا: فی‌ظلال القرآن). ولی در اینجا اسم آبی است در بهشت. تشبیه آن به کافور از لحاظ سفیدی و خوشبوئی است. «کَانَ مِزَاجُهَا کَافُوراً»: آمیخته به کافور است. محتوای آن از آبی به نام کافور است. شراب آن، خوشبو و سفید همچو کافور است.]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان نیکان از جامی که آمیزه آن کافور است، می‌نوشند"
          ],
          "fa.makarem": [
            "به یقین ابرار (و نیکان) از جامی می‌نوشند که با عطر خوشی آمیخته است،"
          ],
          "fa.moezzi": [
            "همانا نیکان می‌آشامند از جامی که آمیزش آن است کافور"
          ],
          "fa.mojtabavi": [
            "همانا نيكوكاران از جامى مى‌نوشند كه آميزه آن كافور است- سرد و خوشبوست-."
          ],
          "fa.sadeqi": [
            "همانا ابرار [:نیکان] از جامی می‌نوشند که با آمیزه‌ای عطرآگین (آمیخته) بوده است."
          ]
        }
      },
      {
        "index": 5597,
        "local_index": 6,
        "part_type": "Verse",
        "path": "/books/quran:76:6",
        "text": [
          "عَيْناً يَشْرَبُ‌ بِهَا عِبَادُ اللَّهِ‌ يُفَجِّرُونَهَا تَفْجِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "From a spring of which the votaries of God will drink and make it flow in abundance."
          ],
          "en.ahmedraza": [
            "The Kafoor is a spring, from which the chosen bondmen of Allah will drink, causing it to flow wherever they wish inside their palaces."
          ],
          "en.arberry": [
            "a fountain whereat drink the servants of God, making it to gush forth plenteously."
          ],
          "en.daryabadi": [
            "From a fountain whence the bondmen of Allah will drink, causing it to gush abundantly."
          ],
          "en.hilali": [
            "A spring wherefrom the slaves of Allah will drink, causing it to gush forth abundantly."
          ],
          "en.itani": [
            "A spring from which the servants of God will drink, making it gush abundantly."
          ],
          "en.maududi": [
            "This will be a gushing spring wherefrom Allah's servants shall drink wine, a spring from which they will take out channels wherever they wish."
          ],
          "en.mubarakpuri": [
            "A spring wherefrom the servants of Allah will drink, causing it to gush forth abundantly."
          ],
          "en.pickthall": [
            "A spring wherefrom the slaves of Allah drink, making it gush forth abundantly,"
          ],
          "en.qarai": [
            "a spring where Allah’s servants will drink, making it gush forth as they please."
          ],
          "en.qaribullah": [
            "a fountain at which the worshipers of Allah drink and make it gush forth abundantly;"
          ],
          "en.sahih": [
            "A spring of which the [righteous] servants of Allah will drink; they will make it gush forth in force [and abundance]."
          ],
          "en.sarwar": [
            "which flows from a spring from which the servants of God will drink."
          ],
          "en.shakir": [
            "A fountain from which the servants of Allah shall drink; they make it to flow a (goodly) flowing forth."
          ],
          "en.transliteration": [
            "AAaynan yashrabu bih<u>a</u> AAib<u>a</u>du All<u>a</u>hi yufajjiroonah<u>a</u> tafjeer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "a spring from which God's servants will drink, making it gush forth in branches."
          ],
          "en.yusufali": [
            "A Fountain where the Devotees of Allah do drink, making it flow in unstinted abundance."
          ],
          "fa.ansarian": [
            "آن جام از چشمه ای است که همواره بندگان خدا از آن می نوشند و آن را به دلخواهشان هرگونه که بخواهند جاری می نمایند."
          ],
          "fa.ayati": [
            "چشمه‌اى كه بندگان خدا از آن مى‌نوشند و آن را به هر جاى كه خواهند روان مى‌سازند."
          ],
          "fa.bahrampour": [
            "چشمه‌اى كه بندگان [خاص‌] خدا از آن بنوشند و [هر جا بخواهند] جارى‌اش سازند"
          ],
          "fa.fooladvand": [
            "چشمه‌اى كه بندگان خدا از آن مى‌نوشند و [به دلخواه خويش‌] جاريش مى‌كنند."
          ],
          "fa.ghomshei": [
            "از سرچشمه گوارایی آن بندگان خاص خدا می‌نوشند که به اختیارشان هر کجا خواهند جاریش سازند."
          ],
          "fa.khorramdel": [
            "(این جامها پر می‌شود از) چشمه‌ای که بندگان خدا از آن می‌نوشند و هرجا که بخواهند با خود روان می‌کنند و می‌برند. [[«عَیْناً»: چشمه‌ای. بدل از (کافُوراً) یا مفعول به فعل محذوف (أَعْنی) یا (أَخُصُّ) است. «یُفَجِّرُونَهَا تَفْجِیراً»: به گونه شگفتی از آن مصرف می‌کنند و می‌نوشند. جاری و روان می‌کنند. بر می‌جوشانند و به فوران در می‌آورند.]]"
          ],
          "fa.khorramshahi": [
            "چشمه‌ای که بندگان [درستکار] خداوند از آن می‌آشامند و روان می‌کنندش هرگونه بخواهند"
          ],
          "fa.makarem": [
            "از چشمه‌ای که بندگان خاص خدا از آن می‌نوشند، و از هر جا بخواهند آن را جاری می‌سازند!"
          ],
          "fa.moezzi": [
            "چشمه‌ای که نوشند از آن بندگان خدا بشکافندش شکافتنی‌"
          ],
          "fa.mojtabavi": [
            "چشمه‌اى كه بندگان خدا از آن مى‌آشامند هر گونه و به هر جا كه بخواهند روانش مى‌سازند."
          ],
          "fa.sadeqi": [
            "چشمه‌ای را (که) بندگان خدا از آن می‌نوشند، حال آنکه آن را به شدت روان می‌کنند، روان کردنی."
          ]
        }
      },
      {
        "index": 5598,
        "local_index": 7,
        "part_type": "Verse",
        "path": "/books/quran:76:7",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:108:5",
            "/books/al-kafi:1:4:108:88",
            "/books/al-kafi:1:4:108:91"
          ]
        },
        "text": [
          "يُوفُونَ‌ بِالنَّذْرِ وَ يَخَافُونَ‌ يَوْماً کَانَ‌ شَرُّهُ‌ مُسْتَطِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "Those who fulfil their vows and fear the Day whose evil shall be diffused far and wide,"
          ],
          "en.ahmedraza": [
            "They fulfil their pledges, and fear a day the evil of which is widespread."
          ],
          "en.arberry": [
            "They fulfil their vows, and fear a day whose evil is upon the wing;"
          ],
          "en.daryabadi": [
            "They fulfill their vow and dread a Day the evil whereof shall be widespreading."
          ],
          "en.hilali": [
            "They (are those who) fulfill (their) vows, and they fear a Day whose evil will be wide-spreading."
          ],
          "en.itani": [
            "They fulfill their vows, and dread a Day whose ill is widespread."
          ],
          "en.maududi": [
            "These will be the ones who fulfil their vows and dread the Day whose woe shall be spread far and wide;"
          ],
          "en.mubarakpuri": [
            "They fulfill (their) vows, and they fear a Day whose evil will be wide-spreading."
          ],
          "en.pickthall": [
            "(Because) they perform the vow and fear a day whereof the evil is wide-spreading,"
          ],
          "en.qarai": [
            "They fulfill their vows and fear a day whose ill will be widespread."
          ],
          "en.qaribullah": [
            "they who keep their vows and fear a Day whose evil is spread;"
          ],
          "en.sahih": [
            "They [are those who] fulfill [their] vows and fear a Day whose evil will be widespread."
          ],
          "en.sarwar": [
            "The servants of God fulfill their vows and are afraid of the day in which there will be widespread terror."
          ],
          "en.shakir": [
            "They fulfill vows and fear a day the evil of which shall be spreading far and wide."
          ],
          "en.transliteration": [
            "Yoofoona bi<b>al</b>nna<u>th</u>ri wayakh<u>a</u>foona yawman k<u>a</u>na sharruhu musta<u>t</u>eer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "They keep their vows and fear a day the woe of which will spread far and wide;"
          ],
          "en.yusufali": [
            "They perform (their) vows, and they fear a Day whose evil flies far and wide."
          ],
          "fa.ansarian": [
            "[همانان که] همواره نذرشان را وفا می کنند، و از روزی که آسیب و گزندش گسترده است، می ترسند،"
          ],
          "fa.ayati": [
            "به نذر وفا مى‌كنند و از روزى كه شر آن همه جا را گرفته است مى‌ترسند."
          ],
          "fa.bahrampour": [
            "[آنها] به نذر خود وفا كنند و از روزى كه شرّ آن فراگير است بترسند"
          ],
          "fa.fooladvand": [
            "[همان بندگانى كه‌] به نذر خود وفا مى‌كردند، و از روزى كه گزند آن فراگيرنده است مى‌ترسيدند."
          ],
          "fa.ghomshei": [
            "به عهد و نذر خود وفا می‌کنند و از روزی که شر و سختیش همه اهل محشر را فراگیرد می‌ترسند."
          ],
          "fa.khorramdel": [
            "(بندگانی که در جهان اعمال و اوصافی این چنین، در پیش می‌گرفتند:) به نذر خود وفا می‌کردند، و از روزی می‌هراسیدند که شرّ و بلای آن گسترده و فراگیر است. [[«النَّذْرِ»: مراد دو چیز است: نخست، چیزی که انسان برای خوشنودی خدا بر خود واجب می‌کند، دیگر چیزی که خدا بر انسان واجب گردانده است (نگا: تفهیم‌القرآن). «مُسْتَطِیراً»: پران و گسترده. فراگیر و پراکنده.]]"
          ],
          "fa.khorramshahi": [
            "آنان به نذر خود وفا می‌کنند و از روزی که شرش دامن‌گستر است، بیم دارند"
          ],
          "fa.makarem": [
            "آنها به نذر خود وفا می‌کنند، و از روزی که شرّ و عذابش گسترده است می‌ترسند،"
          ],
          "fa.moezzi": [
            "پایدار مانند بر نذر و ترسند روزی را که بدی آن است پرزنان‌"
          ],
          "fa.mojtabavi": [
            "به نذر [خود] وفا مى‌كنند و از روزى كه بدى و سختى آن فراگير است مى‌ترسند."
          ],
          "fa.sadeqi": [
            "(همان بندگانی که) به نذر (خود) وفا می‌کنند، و از روزی که گزند آن جویای پرواز بوده است ، می‌ترسند."
          ]
        }
      },
      {
        "index": 5599,
        "local_index": 8,
        "part_type": "Verse",
        "path": "/books/quran:76:8",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:5:2:1:1",
            "/books/al-kafi:4:1:7:3",
            "/books/al-kafi:3:5:1:9"
          ]
        },
        "text": [
          "وَ يُطْعِمُونَ‌ الطَّعَامَ‌ عَلَى‌ حُبِّهِ‌ مِسْکِيناً وَ يَتِيماً وَ أَسِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And feed the needy for the love of Him, and the orphans and the captives,"
          ],
          "en.ahmedraza": [
            "And out of His love, they give food to the needy, the orphan and the prisoner."
          ],
          "en.arberry": [
            "they give food, for the love of Him, to the needy, the orphan, the captive:"
          ],
          "en.daryabadi": [
            "And they feed with food, for love of Him, the needy, and the orphan and the captive."
          ],
          "en.hilali": [
            "And they give food, inspite of their love for it (or for the love of Him), to Miskin (poor), the orphan, and the captive,"
          ],
          "en.itani": [
            "And they feed, for the love of Him, the poor, and the orphan, and the captive."
          ],
          "en.maududi": [
            "those who, for the love of Him, feed the needy, and the orphan, and the captive,"
          ],
          "en.mubarakpuri": [
            "And they give food, inspite of their love for it, to the poor, the orphan and the captive,"
          ],
          "en.pickthall": [
            "And feed with food the needy wretch, the orphan and the prisoner, for love of Him,"
          ],
          "en.qarai": [
            "For the love of Him, they feed the needy, the orphan and the prisoner,"
          ],
          "en.qaribullah": [
            "who give food, for the love of Him to the needy, the orphan, and the captive,"
          ],
          "en.sahih": [
            "And they give food in spite of love for it to the needy, the orphan, and the captive,"
          ],
          "en.sarwar": [
            "They feed the destitute, orphans, and captives for the love of God, saying,"
          ],
          "en.shakir": [
            "And they give food out of love for Him to the poor and the orphan and the captive:"
          ],
          "en.transliteration": [
            "Wayu<u>t</u>AAimona a<b>l</b><u>tt</u>aAA<u>a</u>ma AAal<u>a</u> <u>h</u>ubbihi miskeenan wayateeman waaseer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "they give food, despite their love for it, to the poor and orphans and captives,"
          ],
          "en.yusufali": [
            "And they feed, for the love of Allah, the indigent, the orphan, and the captive,-"
          ],
          "fa.ansarian": [
            "و غذا را در عین دوست داشتنش، به مسکین و یتیم و اسیر انفاق می کنند."
          ],
          "fa.ayati": [
            "و طعام را در حالى كه خود دوستش دارند به مسكين و يتيم و اسير مى‌خورانند:"
          ],
          "fa.bahrampour": [
            "و طعام را با آن كه دوستش دارند، به مستمند و يتيم و اسير دهند"
          ],
          "fa.fooladvand": [
            "و به [پاس‌] دوستى [خدا]، بينوا و يتيم و اسير را خوراك مى‌دادند."
          ],
          "fa.ghomshei": [
            "و هم بر دوستی او (یعنی خدا) به فقیر و طفل یتیم و اسیر طعام می‌دهند."
          ],
          "fa.khorramdel": [
            "و خوراک می‌دادند به بینوا و یتیم و اسیر، به خاطر دوست داشت خدا. [[«عَلی حُبِّهِ»: به خاطر دوست داشت خدا و عشق به الله، با وجود دوست داشت خوراک و نیاز خود بدان. ضمیر (ه) به خدا بر می‌گردد که از سیاق کلام پیدا است (نگا: کهف / 28، روم / 39). و یا به طعام برمی‌گردد (نگا: آل‌عمران / 92).]]"
          ],
          "fa.khorramshahi": [
            "و خوراک را با وجود دوست داشتنش به بینوا و یتیم و اسیر اطعام کنند"
          ],
          "fa.makarem": [
            "و غذای (خود) را با اینکه به آن علاقه (و نیاز) دارند، به «مسکین» و «یتیم» و «اسیر» می‌دهند!"
          ],
          "fa.moezzi": [
            "و خورانند خوراک را با دوست داشتنش به بینوائی و یتیمی و برده‌ای‌"
          ],
          "fa.mojtabavi": [
            "و طعام را با دوستى آن- با آنكه خود به آن مايل‌تر و نيازمندترند- به بينوا و يتيم و اسير مى‌خورانند"
          ],
          "fa.sadeqi": [
            "و بر (مبنای) دوستی خدا (و طعامشان)، آن را به بینوا و یتیم و اسیر می‌خورانند."
          ]
        }
      },
      {
        "index": 5600,
        "local_index": 9,
        "part_type": "Verse",
        "path": "/books/quran:76:9",
        "text": [
          "إِنَّمَا نُطْعِمُکُمْ‌ لِوَجْهِ‌ اللَّهِ‌ لاَ نُرِيدُ مِنْکُمْ‌ جَزَاءً وَ لاَ شُکُوراً"
        ],
        "translations": {
          "en.ahmedali": [
            "(Saying): \"We feed you for the sake of God, desiring neither recompense nor thanks."
          ],
          "en.ahmedraza": [
            "They say to them, “We give you food, only for the sake of Allah – we do not seek any reward or thanks from you.”"
          ],
          "en.arberry": [
            "'We feed you only for the Face of God; we desire no recompense from you, no thankfulness;"
          ],
          "en.daryabadi": [
            "Saying: we feed you only for the sake of Allah; we desire not from you any recompense or thanks."
          ],
          "en.hilali": [
            "(Saying): \"We feed you seeking Allah's Countenance only. We wish for no reward, nor thanks from you."
          ],
          "en.itani": [
            "“We only feed you for the sake of God. We want from you neither compensation, nor gratitude."
          ],
          "en.maududi": [
            "(saying): “We feed you only for Allah's sake; we do not seek of you any recompense or thanks,"
          ],
          "en.mubarakpuri": [
            "(Saying): \"We feed you seeking Allah's Face only. We wish for no reward, nor thanks from you.\""
          ],
          "en.pickthall": [
            "(Saying): We feed you, for the sake of Allah only. We wish for no reward nor thanks from you;"
          ],
          "en.qarai": [
            "[saying,] ‘We feed you only for the sake of Allah. We desire no reward from you, nor thanks."
          ],
          "en.qaribullah": [
            "(saying): 'We feed you only desirous of the Face of Allah; we seek of you neither recompense nor thanks,"
          ],
          "en.sahih": [
            "[Saying], \"We feed you only for the countenance of Allah. We wish not from you reward or gratitude."
          ],
          "en.sarwar": [
            "\"We only feed you for the sake of God and we do not want any reward or thanks from you."
          ],
          "en.shakir": [
            "We only feed you for Allah's sake; we desire from you neither reward nor thanks:"
          ],
          "en.transliteration": [
            "Innam<u>a</u> nu<u>t</u>AAimukum liwajhi All<u>a</u>hi l<u>a</u> nureedu minkum jaz<u>a</u>an wal<u>a</u> shukoor<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "saying, \"We feed you for the sake of God alone, we seek neither recompense nor thanks from you."
          ],
          "en.yusufali": [
            "(Saying),\"We feed you for the sake of Allah alone: no reward do we desire from you, nor thanks."
          ],
          "fa.ansarian": [
            "[و می گویند:] ما شما را فقط برای خشنودی خدا اطعام می کنیم و انتظار هیچ پاداش و سپاسی را از شما نداریم."
          ],
          "fa.ayati": [
            "جز اين نيست كه شما را براى خدا اطعام مى‌كنيم و از شما نه پاداشى مى‌خواهيم نه سپاسى."
          ],
          "fa.bahrampour": [
            "[و در دل گويند:] ما فقط براى رضاى خدا شما را اطعام مى‌كنيم و هيچ پاداش و سپاسى از شما نمى‌خواهيم"
          ],
          "fa.fooladvand": [
            "«ما براى خشنودى خداست كه به شما مى‌خورانيم و پاداش و سپاسى از شما نمى‌خواهيم."
          ],
          "fa.ghomshei": [
            "(و گویند) ما فقط برای رضای خدا به شما طعام می‌دهیم و از شما هیچ پاداش و سپاسی هم نمی‌طلبیم."
          ],
          "fa.khorramdel": [
            "(به زبان حال، بدیشان می‌گویند:) ما شما را تنها به خاطر ذات خدا خوراک می‌دهیم، و از شما پاداش و سپاسگزاری نمی‌خواهیم. [[«إِنَّمَا نُطْعِمُکُمْ ...»: این آیه از زبان حال نیکان و نیکوکاران است؛ نه این که محسنان چنین سخنی را هربار به مستمندان گفته باشند (نگا: التفسیر القرآنی للقرآن). «لِوَجْهِ اللهِ»: به خاطر ذات پاک یزدان. برای رضای خدا. مراد از وجه، ذات است (نگا: بقره / 115 و 272، رعد / 22، روم / 38 و 39).]]"
          ],
          "fa.khorramshahi": [
            "[و در دل گویند] ما فقط برای خشنودی خداوند شما را اطعام می‌کنیم، از شما نه پاداشی می‌خواهیم، و نه سپاسی‌"
          ],
          "fa.makarem": [
            "(و می‌گویند:) ما شما را بخاطر خدا اطعام می‌کنیم، و هیچ پاداش و سپاسی از شما نمی‌خواهیم!"
          ],
          "fa.moezzi": [
            "جز این نیست که می‌خورانیم شما را برای روی خدا نخواهیم از شما پاداشی و نه سپاسی‌"
          ],
          "fa.mojtabavi": [
            "[زبان حالشان اين است كه‌] همانا شما را براى خشنودى خداى مى‌خورانيم از شما پاداش و سپاسى نمى‌خواهيم"
          ],
          "fa.sadeqi": [
            "(و به آنان می‌گویند:) «ما تنها برای خشنودی خداست که به شما می‌خورانیم و پاداش و سپاسی (هم) از شما نمی‌خواهیم.»"
          ]
        }
      },
      {
        "index": 5601,
        "local_index": 10,
        "part_type": "Verse",
        "path": "/books/quran:76:10",
        "text": [
          "إِنَّا نَخَافُ‌ مِنْ‌ رَبِّنَا يَوْماً عَبُوساً قَمْطَرِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "We fear the dismal day calamitous from our Lord.\""
          ],
          "en.ahmedraza": [
            "“Indeed we fear from our Lord a day which is extremely bitter, most severe.”"
          ],
          "en.arberry": [
            "for we fear from our Lord a frowning day, inauspicious."
          ],
          "en.daryabadi": [
            "Verily we dread from our Lord a Day grim and distressful."
          ],
          "en.hilali": [
            "\"Verily, We fear from our Lord a Day, hard and distressful, that will make the faces look horrible (from extreme dislikeness to it).\""
          ],
          "en.itani": [
            "We dread from our Lord a frowning grim Day.”"
          ],
          "en.maududi": [
            "we fear from our Lord a Day that shall be long and distressful.”"
          ],
          "en.mubarakpuri": [
            "\"Verily, We fear from our Lord a Day that is `Abus and Qamtarir.\""
          ],
          "en.pickthall": [
            "Lo! we fear from our Lord a day of frowning and of fate."
          ],
          "en.qarai": [
            "Indeed we fear a frowning and fateful day from our Lord.’"
          ],
          "en.qaribullah": [
            "for we fear from our Lord a stern, frownful Day'"
          ],
          "en.sahih": [
            "Indeed, We fear from our Lord a Day austere and distressful.\""
          ],
          "en.sarwar": [
            "We are afraid of our Lord and the bitterly distressful day\"."
          ],
          "en.shakir": [
            "Surely we fear from our Lord a stern, distressful day."
          ],
          "en.transliteration": [
            "Inn<u>a</u> nakh<u>a</u>fu min rabbin<u>a</u> yawman AAaboosan qam<u>t</u>areer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Truly, we fear from our Lord a woefully grim Day.\""
          ],
          "en.yusufali": [
            "\"We only fear a Day of distressful Wrath from the side of our Lord.\""
          ],
          "fa.ansarian": [
            "ما از پروردگارمان در روزی که روز عبوس و بسیار هولناکی است می ترسیم."
          ],
          "fa.ayati": [
            "ما از پروردگار خود مى‌ترسيم، در روزى كه آن روز عبوس و سخت و هولناك است."
          ],
          "fa.bahrampour": [
            "ما از پروردگار خود از روزى كه سخت غمبار است هراسانيم"
          ],
          "fa.fooladvand": [
            "ما از پروردگارمان از روز عبوسى سخت، هراسناكيم.»"
          ],
          "fa.ghomshei": [
            "ما از (قهر) پروردگار خود به روزی که (از رنج و سختی آن رخسار خلق) در هم و غمگین است می‌ترسیم."
          ],
          "fa.khorramdel": [
            "ما (از عذاب) پروردگارمان می‌ترسیم؛ از (عذاب) روز بس ترشرو و سخت اخموئی (که قیامت نام دارد). [[«یَوْماً»: مفعولٌ‌به است (نگا: اعراب القرآن درویش، روح‌البیان) و (مِن رَبِّنَا) حال متقدّم آن است، یا (مِن رَبِّنَا) مفعولٌ‌به است و (یَوْماً) بدل از محلّ آن است (نگا: روح‌البیان). «عَبُوساً»: بس ترشرو و چهره در هم کشیده. «قَمْطَرِیراً»: سخت اخمو. بسیار سخت و شدید.]]"
          ],
          "fa.khorramshahi": [
            "ما از پروردگارمان در روزی که دژم و دشوار است، می‌ترسیم‌"
          ],
          "fa.makarem": [
            "ما از پروردگارمان خائفیم در آن روزی که عبوس و سخت است!"
          ],
          "fa.moezzi": [
            "همانا ترسیم از پروردگار خویش روزی را دژم‌خوی آشفته‌روی‌"
          ],
          "fa.mojtabavi": [
            "ما از پروردگارمان در روزى كه گرفته و دژم و سخت و سهمگين است مى‌ترسيم."
          ],
          "fa.sadeqi": [
            "«ما از پروردگارمان، از روزی (که) با چهره‌ای درهم نهاده است سخت هراسناکیم.»"
          ]
        }
      },
      {
        "index": 5602,
        "local_index": 11,
        "part_type": "Verse",
        "path": "/books/quran:76:11",
        "text": [
          "فَوَقَاهُمُ‌ اللَّهُ‌ شَرَّ ذٰلِکَ‌ الْيَوْمِ‌ وَ لَقَّاهُمْ‌ نَضْرَةً وَ سُرُوراً"
        ],
        "translations": {
          "en.ahmedali": [
            "So God will protect them from the evil of that day, and grant them happiness and joy,"
          ],
          "en.ahmedraza": [
            "So Allah saved them from the evil of that day, and gave them freshness and joy."
          ],
          "en.arberry": [
            "So God has guarded them from the evil of that day, and has procured them radiancy and gladness,"
          ],
          "en.daryabadi": [
            "Wherefore Allah shall preserve them from the evil of that Day, and shall cause them to meet brightness and joy."
          ],
          "en.hilali": [
            "So Allah saved them from the evil of that Day, and gave them Nadratan (a light of beauty) and joy."
          ],
          "en.itani": [
            "So God will protect them from the ills of that Day, and will grant them radiance and joy."
          ],
          "en.maududi": [
            "So Allah shall guard them against the woe of that Day, and will procure them freshness and joy,"
          ],
          "en.mubarakpuri": [
            "So, Allah saved them from the evil of that Day, and gave them Nadrah (a light of beauty) and joy."
          ],
          "en.pickthall": [
            "Therefor Allah hath warded off from them the evil of that day, and hath made them find brightness and joy;"
          ],
          "en.qarai": [
            "So Allah saved them from that day’s ills and graced them with freshness [on this faces] and joy [in their hearts]."
          ],
          "en.qaribullah": [
            "So Allah will save them from the evil of that Day and has secured for them radiance and joyfulness,"
          ],
          "en.sahih": [
            "So Allah will protect them from the evil of that Day and give them radiance and happiness"
          ],
          "en.sarwar": [
            "God will certainly rescue them from the terror of that day and will meet them with joy and pleasure."
          ],
          "en.shakir": [
            "Therefore Allah win guard them from the evil of that day and cause them to meet with ease and happiness;"
          ],
          "en.transliteration": [
            "Fawaq<u>a</u>humu All<u>a</u>hu sharra <u>tha</u>lika alyawmi walaqq<u>a</u>hum na<u>d</u>ratan wasuroor<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Therefore, God will ward off from them the woes of that Day, and make them find brightness and joy,"
          ],
          "en.yusufali": [
            "But Allah will deliver them from the evil of that Day, and will shed over them a Light of Beauty and (blissful) Joy."
          ],
          "fa.ansarian": [
            "پس خدا نگه دار آنان از آسیب و گزند آن روز است و شادابی و شادمانی به آنان عطا می کند."
          ],
          "fa.ayati": [
            "خدا ايشان را از شر آن روز نگه داشت و آنان را طراوت و شادمانى بخشيد."
          ],
          "fa.bahrampour": [
            "پس خدا آنها را از شرّ آن روز نگاه دارد و بهجت و سرور به آنها ارزانى دارد"
          ],
          "fa.fooladvand": [
            "پس خدا [هم‌] آنان را از آسيب آن روز نگاه داشت و شادابى و شادمانى به آنان ارزانى داشت."
          ],
          "fa.ghomshei": [
            "خدا هم از شر و فتنه آن روز آنان را محفوظ داشت و به آنها روی خندان و دل شادمان عطا نمود."
          ],
          "fa.khorramdel": [
            "به همین خاطر، خداوند آنان را از شرّ و بلای آن روز محفوظ می‌دارد، و ایشان را به خرّمی و شادمانی می‌رساند. [[«شَرَّ»: بلایا و شدائد قیامت. مفعولٌ‌به دوم است. «لَقَاهُمْ»: ایشان را می‌رساند به. بدیشان می‌رساند و می‌بخشد. «نَضْرَةً»: سرسبزی و خرّمی. شادی و شادمانی (نگا: مطفّفین / 24).]]"
          ],
          "fa.khorramshahi": [
            "سپس خداوند آنان را از شر آن روز در امان دارد و به ایشان تازگی و خرمی بنمایاند"
          ],
          "fa.makarem": [
            "(بخاطر این عقیده و عمل) خداوند آنان را از شرّ آن روز نگه می‌دارد و آنها را می‌پذیرد در حالی که غرق شادی و سرورند!"
          ],
          "fa.moezzi": [
            "پس نگهداشتشان خدا از بدی آن روز و بدیشان ارزانی داشت خرّمی و شادمانی‌"
          ],
          "fa.mojtabavi": [
            "پس خداى ايشان را از بدى و سختى آن روز نگاه دارد و ايشان را تازگى و شادمانى پيش آرد."
          ],
          "fa.sadeqi": [
            "پس خدا (هم) آنان را از آسیب آن روز نگه داشت‌، و شادابی و شادمانی به آنان بسی ارزانی داشت."
          ]
        }
      },
      {
        "index": 5603,
        "local_index": 12,
        "part_type": "Verse",
        "path": "/books/quran:76:12",
        "text": [
          "وَ جَزَاهُمْ‌ بِمَا صَبَرُوا جَنَّةً وَ حَرِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And reward them for their perseverence Paradise and silken robes,"
          ],
          "en.ahmedraza": [
            "And gave them Paradise and silk clothes, as a reward for their patience."
          ],
          "en.arberry": [
            "and recompensed them for their patience with a Garden, and silk;"
          ],
          "en.daryabadi": [
            "And shall recompense them for that which they patiently bare with a Garden and silken garment."
          ],
          "en.hilali": [
            "And their recompense shall be Paradise, and silken garments, because they were patient."
          ],
          "en.itani": [
            "And will reward them for their patience with a Garden and silk."
          ],
          "en.maududi": [
            "and will reward them for their steadfastness with Paradise and robes of silk."
          ],
          "en.mubarakpuri": [
            "And their recompense shall be Paradise, and silken garments, because they were patient."
          ],
          "en.pickthall": [
            "And hath awarded them for all that they endured, a Garden and silk attire;"
          ],
          "en.qarai": [
            "He rewarded them for their patience with a garden and [garments of] silk,"
          ],
          "en.qaribullah": [
            "and recompense them for their patience with a Garden, and robes of silk."
          ],
          "en.sahih": [
            "And will reward them for what they patiently endured [with] a garden [in Paradise] and silk [garments]."
          ],
          "en.sarwar": [
            "For their patience, He will reward them with Paradise and silk."
          ],
          "en.shakir": [
            "And reward them, because they were patient, with garden and silk,"
          ],
          "en.transliteration": [
            "Wajaz<u>a</u>hum bim<u>a</u> <u>s</u>abaroo jannatan wa<u>h</u>areer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and their reward for being patient will be a Garden and silk [clothing]."
          ],
          "en.yusufali": [
            "And because they were patient and constant, He will reward them with a Garden and (garments of) silk."
          ],
          "fa.ansarian": [
            "و آنان را برای اینکه [در برابر تکالیف دینی و حوادث روزگار] شکیبایی ورزیدند، بهشتی [عنبرسرشت] و لباسی ابریشمین پاداش می دهد."
          ],
          "fa.ayati": [
            "به پاداش صبرى كه كرده‌اند پاداششان را بهشت و حرير داد."
          ],
          "fa.bahrampour": [
            "و به پاس آن كه صبر كردند، بهشت و حرير پاداششان دهد"
          ],
          "fa.fooladvand": [
            "و به [پاس‌] آنكه صبر كردند، بهشت و پرنيان پاداششان داد."
          ],
          "fa.ghomshei": [
            "و پاداش آن صبر کامل بر ایثارشان باغ بهشت و لباس حریر بهشتی لطف فرمود."
          ],
          "fa.khorramdel": [
            "و در برابر صبری که نموده‌اند، خداوند بهشت و جامه‌ی ابریشمین را پاداششان می‌کند. [[«حَرِیراً»: ابریشم که جامه بهشتیان است (نگا: حجّ / 23، فاطر / 33).]]"
          ],
          "fa.khorramshahi": [
            "و به آنان به خاطر شکیبی که ورزیده‌اند بوستانی [بهشتی‌] و [جامه‌] ابریشم پاداش دهد"
          ],
          "fa.makarem": [
            "و در برابر صبرشان، بهشت و لباسهای حریر بهشتی را به آنها پاداش می‌دهد!"
          ],
          "fa.moezzi": [
            "و پاداششان داد بدانچه شکیبا شدند بهشتی و حریری‌"
          ],
          "fa.mojtabavi": [
            "و ايشان را به سبب آنكه شكيبايى كردند بهشت و پرنيان پاداش دهد."
          ],
          "fa.sadeqi": [
            "و به (پاس) آنکه صبر کردند، بهشت و پرنیان پاداششان داد."
          ]
        }
      },
      {
        "index": 5604,
        "local_index": 13,
        "part_type": "Verse",
        "path": "/books/quran:76:13",
        "text": [
          "مُتَّکِئِينَ‌ فِيهَا عَلَى‌ الْأَرَائِکِ‌ لاَ يَرَوْنَ‌ فِيهَا شَمْساً وَ لاَ زَمْهَرِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "Where they will recline on couches feeling neither heat of the sun nor intense cold."
          ],
          "en.ahmedraza": [
            "Reclining in it, upon thrones; they will not see the hot sunshine in it, nor the bitter cold."
          ],
          "en.arberry": [
            "therein they shall recline upon couches, therein they shall see neither sun nor bitter cold;"
          ],
          "en.daryabadi": [
            "Reclining therein upon couches, they shall behold therein neither sun nor hurting cold."
          ],
          "en.hilali": [
            "Reclining therein on raised thrones, they will see there neither the excessive heat of the sun, nor the excessive bitter cold, (as in Paradise there is no sun and no moon)."
          ],
          "en.itani": [
            "Reclining therein on the thrones; experiencing therein neither sun, nor frost."
          ],
          "en.maududi": [
            "There they will recline on elevated couches and will be subjected neither to the burning heat of the sun nor to bitter cold."
          ],
          "en.mubarakpuri": [
            "Reclining therein on raised couches, they will see there neither the excessive heat, nor the excessive cold."
          ],
          "en.pickthall": [
            "Reclining therein upon couches, they will find there neither (heat of) a sun nor bitter cold."
          ],
          "en.qarai": [
            "reclining therein on couches, without facing any [scorching] sun, or [biting] cold."
          ],
          "en.qaribullah": [
            "Reclining there upon couches, they shall see neither the sun nor the moon."
          ],
          "en.sahih": [
            "[They will be] reclining therein on adorned couches. They will not see therein any [burning] sun or [freezing] cold."
          ],
          "en.sarwar": [
            "They will recline therein on couches and they will find neither excessive heat nor cold."
          ],
          "en.shakir": [
            "Reclining therein on raised couches, they shall find therein neither (the severe heat of) the sun nor intense cold."
          ],
          "en.transliteration": [
            "Muttakieena feeh<u>a</u> AAal<u>a</u> alar<u>a</u>iki l<u>a</u> yarawna feeh<u>a</u> shamsan wal<u>a</u> zamhareer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Reclining upon couches, they will find therein neither the heat of the sun nor bitter, biting cold,"
          ],
          "en.yusufali": [
            "Reclining in the (Garden) on raised thrones, they will see there neither the sun's (excessive heat) nor (the moon's) excessive cold."
          ],
          "fa.ansarian": [
            "در آنجا بر تخت ها تکیه می زنند، در حالی که آفتابی [که از گرمایش ناراحت شوند] و سرمایی [که از سختی اش به زحمت افتند] نمی بینند،"
          ],
          "fa.ayati": [
            "در آنجا بر تختها تكيه زده‌اند نه هيچ آفتابى مى‌بينند و نه سرمايى."
          ],
          "fa.bahrampour": [
            "كه در آن جا بر تخت‌ها تكيه زنند. در آن جا نه [گرماى‌] آفتاب بينند و نه سرما"
          ],
          "fa.fooladvand": [
            "در آن [بهشت‌] بر تختها[ى خويش‌] تكيه زنند. در آنجا نه آفتابى بينند و نه سرمايى."
          ],
          "fa.ghomshei": [
            "که در آن بهشت بر تختها (ی عزت) تکیه زنند و آنجا نه آفتابی سوزان بینند و نه سرمای ز مهریر (بلکه در هوایی بسیار خوش و باغی وسیع و دلکش تفرج کنند)."
          ],
          "fa.khorramdel": [
            "در بهشت بر تختهای زیبا و مجلّل تکیه می‌کنند، و نه (گرمای) آفتابی و نه سوز سرمائی در آنجا می‌یابند. [[«مُتَّکِئِینَ»: تکیه‌زنندگان. حال ضمیر (هم) در آیه پیشین است. «الأرَائِکِ»: جمع أَریکَة، تختهای زیبا و مبلمان مجلّل. (نگا: کهف / 31، یس / 56). «زَمْهَرِیراً»: سوز سرما. شدّت سرما.]]"
          ],
          "fa.khorramshahi": [
            "در آنجا بر اورنگها تکیه زده، در آنجا نه [گرمای‌] خورشیدی بینند و نه سرمای سختی‌"
          ],
          "fa.makarem": [
            "این در حالی است که در بهشت بر تختهای زیبا تکیه کرده‌اند، نه آفتاب را در آنجا می‌بینند و نه سرما را!"
          ],
          "fa.moezzi": [
            "تکیه‌کنانند در آن بر بالینها نبینند در آن آفتابی و نه سرمائی‌"
          ],
          "fa.mojtabavi": [
            "در آنجا بر تختها [ى آراسته‌] تكيه زنند، در آنجا نه [گرمى‌] آفتابى بينند و نه سرمايى."
          ],
          "fa.sadeqi": [
            "حال آنکه در آن (بهشت) بر تخت‌ها(ی خویش) تکیه‌زنندگانند. در آن‌جا نه (حرارت) آفتابی بینند و نه سرمایی طاقت‌فرسا."
          ]
        }
      },
      {
        "index": 5605,
        "local_index": 14,
        "part_type": "Verse",
        "path": "/books/quran:76:14",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:24:1"
          ]
        },
        "text": [
          "وَ دَانِيَةً عَلَيْهِمْ‌ ظِلاَلُهَا وَ ذُلِّلَتْ‌ قُطُوفُهَا تَذْلِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "The shadows will bend over them, and low will hang the clusters of grapes."
          ],
          "en.ahmedraza": [
            "And its shade will cover them, and its fruit clusters brought down low for them."
          ],
          "en.arberry": [
            "near them shall be its shades, and its clusters hung meekly down,"
          ],
          "en.daryabadi": [
            "And close upon them will be the shades thereof, and low will hang the clusters thereof greatly."
          ],
          "en.hilali": [
            "And the shade thereof is close upon them, and the bunches of fruit thereof will hang low within their reach."
          ],
          "en.itani": [
            "Its shade hovering over them, and its fruit brought low within reach."
          ],
          "en.maududi": [
            "The shades of Paradise will bend over them, and its fruits will be brought within their easy reach;"
          ],
          "en.mubarakpuri": [
            "And the shade thereof is close upon them, and the bunches of fruit thereof will hang low within their reach."
          ],
          "en.pickthall": [
            "The shade thereof is close upon them and the clustered fruits thereof bow down."
          ],
          "en.qarai": [
            "Its shades will be close over them and its clusters [of fruits] will be hanging low."
          ],
          "en.qaribullah": [
            "Near them shall be its shades with its clusters hung gently down,"
          ],
          "en.sahih": [
            "And near above them are its shades, and its [fruit] to be picked will be lowered in compliance."
          ],
          "en.sarwar": [
            "The shades of the garden will be closely spread over them and it will be easy for them to reach the fruits."
          ],
          "en.shakir": [
            "And close down upon them (shall be) its shadows, and its fruits shall be made near (to them), being easy to reach."
          ],
          "en.transliteration": [
            "Wad<u>a</u>niyatan AAalayhim <i><u>th</u></i>il<u>a</u>luh<u>a</u> wa<u>th</u>ullilat qu<u>t</u>oofuh<u>a</u> ta<u>th</u>leel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "the shading branches of trees will come down low over them, and their clusters of fruit, will hang down where they are the easiest to reach."
          ],
          "en.yusufali": [
            "And the shades of the (Garden) will come low over them, and the bunches (of fruit), there, will hang low in humility."
          ],
          "fa.ansarian": [
            "و سایه های درختان به آنان نزدیک و میوه هایش به آسانی در دسترس است،"
          ],
          "fa.ayati": [
            "سايه‌هاى درختانش بر سرشان افتاده و ميوه‌هايش به فرمانشان باشد."
          ],
          "fa.bahrampour": [
            "و سايه‌ها [ى درختان‌] بر آنها نزديك و ميوه‌هايش [براى چيدن‌] بسيار آسان است"
          ],
          "fa.fooladvand": [
            "و سايه‌ها[ى درختان‌] به آنان نزديك است، و ميوه‌هايش [براى چيدن‌] رام."
          ],
          "fa.ghomshei": [
            "و سایه درختان بهشتی بر سر آنها و میوه‌هایش در دسترس و به اختیار آنهاست."
          ],
          "fa.khorramdel": [
            "سایه‌های (درختان) بهشتی بر آنان فرو می‌افتد، و میوه‌های آنجا سهل‌الوصول و در دسترس است. [[«دَانِیَةً»: نزدیک. فرو افتاده. «قُطُوفُ»: جمع قِطْف، میوه رسیده (نگا: حاقّه / 22 و 23).]]"
          ],
          "fa.khorramshahi": [
            "و سایه‌های آن به ایشان نزدیک باشد، و میوه‌های آن در کمال دسترس پذیری باشد"
          ],
          "fa.makarem": [
            "و در حالی است که سایه‌های درختان بهشتی بر آنها فرو افتاده و چیدن میوه‌هایش بسیار آسان است!"
          ],
          "fa.moezzi": [
            "و نزدیک است بدیشان سایه‌هایش و رام گردیدند میوه‌هایش رام‌شدنی‌"
          ],
          "fa.mojtabavi": [
            "و سايه‌هاى [درختان‌] آن بر آنان نزديك باشد و ميوه‌هايش به آسانى رام گشته- در دسترس- است."
          ],
          "fa.sadeqi": [
            "حال آنکه سایه‌ها(ی درختان) بر آنان نزدیک است و چیدنی‌هایش (به‌گونه‌ای شگفت‌آور) رام."
          ]
        }
      },
      {
        "index": 5606,
        "local_index": 15,
        "part_type": "Verse",
        "path": "/books/quran:76:15",
        "text": [
          "وَ يُطَافُ‌ عَلَيْهِمْ‌ بِآنِيَةٍ مِنْ‌ فِضَّةٍ وَ أَکْوَابٍ‌ کَانَتْ‌ قَوَارِيرَا"
        ],
        "translations": {
          "en.ahmedali": [
            "Passed round will be silver flagons and goblets made of glass,"
          ],
          "en.ahmedraza": [
            "Rounds of silver cups and silver beakers, looking like glass, will be presented upon them."
          ],
          "en.arberry": [
            "and there shall be passed around them vessels of silver, and goblets of crystal,"
          ],
          "en.daryabadi": [
            "And brought round amongst them will be vessels of silver and also goblets of glass."
          ],
          "en.hilali": [
            "And amongst them will be passed round vessels of silver and cups of crystal,"
          ],
          "en.itani": [
            "Passing around them are vessels of silver, and cups of crystal."
          ],
          "en.maududi": [
            "and there shall be passed around them vessels of silver and goblets of crystal,"
          ],
          "en.mubarakpuri": [
            "And among them will be passed round vessels of silver and cups of crystal --"
          ],
          "en.pickthall": [
            "Goblets of silver are brought round for them, and beakers (as) of glass"
          ],
          "en.qarai": [
            "They will be served around with vessels of silver and goblets of crystal"
          ],
          "en.qaribullah": [
            "and passed around them shall be silver vessels, and crystal goblets,"
          ],
          "en.sahih": [
            "And there will be circulated among them vessels of silver and cups having been [created] clear [as glass],"
          ],
          "en.sarwar": [
            "They will be served with silver dishes and crystal clear goblets."
          ],
          "en.shakir": [
            "And there shall be made to go round about them vessels of silver and goblets which are of glass,"
          ],
          "en.transliteration": [
            "Wayu<u>ta</u>fu AAalayhim bi<u>a</u>niyatin min fi<u>dd</u>atin waakw<u>a</u>bin k<u>a</u>nat qaw<u>a</u>reer<u>a</u>"
          ],
          "en.wahiduddin": [
            "Vessels of silver and goblets of pure crystal will be passed round among them"
          ],
          "en.yusufali": [
            "And amongst them will be passed round vessels of silver and goblets of crystal,-"
          ],
          "fa.ansarian": [
            "و ظرف هایی از نقره فام، و قدح هایی بلورین [که پر از غذا و نوشیدنی است] پیرامون آنان می گردانند؛"
          ],
          "fa.ayati": [
            "كاسه‌هاى سيمين و كوزه‌هاى شراب ميانشان به گردش در مى‌آيد."
          ],
          "fa.bahrampour": [
            "و ظروف سيمين و جام‌هاى بلورين بر آنها بگردانند"
          ],
          "fa.fooladvand": [
            "و ظروف سيمين و جامهاى بلورين، پيرامون آنان گردانده مى‌شود."
          ],
          "fa.ghomshei": [
            "و (ساقیان زیبای حور و غلمان) با جامهای سیمین و کوزه‌های بلورین بر آنها دور زنند."
          ],
          "fa.khorramdel": [
            "جامه‌های سیمین شراب و قدحهای بلورینِ می میانشان به گردش در می‌آید. [[«أَکْوَابٍ»: جمع کُوب، قَدَح (نگا: زخرف / 71، واقعه / 18). «قَوَارِیرَ»: جمع قَارُورَة، ظرف بلورین و شیشه‌ای. در رسم‌الخطّ قرآنی الف زائدی در آخر وجود دارد.]]"
          ],
          "fa.khorramshahi": [
            "و بر ایشان ظرفهایی سیمین و کوزه‌هایی که آبگینه است می‌گردانند"
          ],
          "fa.makarem": [
            "و در گرداگرد آنها ظرفهایی سیمین و قدحهایی بلورین می‌گردانند (پر از بهترین غذاها و نوشیدنی‌ها)،"
          ],
          "fa.moezzi": [
            "و گردش داده شود بر ایشان جامهائی از سیم و پیاله‌ها (صراحیهائی) که باشند آبگینه‌هائی‌"
          ],
          "fa.mojtabavi": [
            "و جامهايى از نقره و سبوهايى از آبگينه بر ايشان مى‌گردانند"
          ],
          "fa.sadeqi": [
            "و ظروفی سیمین و جام‌هایی که بلورین بوده، بر (پیرامون) آنان گردانده می‌شود."
          ]
        }
      },
      {
        "index": 5607,
        "local_index": 16,
        "part_type": "Verse",
        "path": "/books/quran:76:16",
        "text": [
          "قَوَارِيرَ مِنْ‌ فِضَّةٍ قَدَّرُوهَا تَقْدِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And crystal clear bottles of silver, of which they will determine the measure themselves."
          ],
          "en.ahmedraza": [
            "Glass made from silver, which the servers have filled up to the measure."
          ],
          "en.arberry": [
            "crystal of silver that they have measured -- very exactly."
          ],
          "en.daryabadi": [
            "Godblets of silver, they shall have filled them to exact measure."
          ],
          "en.hilali": [
            "Crystal-clear, made of silver. They will determine the measure thereof according to their wishes."
          ],
          "en.itani": [
            "Crystal of silver—they measured them exactly."
          ],
          "en.maududi": [
            "goblets bright as crystal but made of silver, filled to exact measure."
          ],
          "en.mubarakpuri": [
            "(Qawarir) Crystal-clear, made of silver. They will determine the measure thereof."
          ],
          "en.pickthall": [
            "(Bright as) glass but (made) of silver, which they (themselves) have measured to the measure (of their deeds)."
          ],
          "en.qarai": [
            "—crystal of silver— [from] which they will dispense in a precise measure."
          ],
          "en.qaribullah": [
            "goblets of silver that they have precisely measured."
          ],
          "en.sahih": [
            "Clear glasses [made] from silver of which they have determined the measure."
          ],
          "en.sarwar": [
            "Also there will be crystal clear goblets of silver containing the exact measure of drink which they desire."
          ],
          "en.shakir": [
            "(Transparent as) glass, made of silver; they have measured them according to a measure."
          ],
          "en.transliteration": [
            "Qaw<u>a</u>reera min fi<u>dd</u>atin qaddarooh<u>a</u> taqdeer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and gleaming silver goblets which have been filled to the exact measure,"
          ],
          "en.yusufali": [
            "Crystal-clear, made of silver: they will determine the measure thereof (according to their wishes)."
          ],
          "fa.ansarian": [
            "جام هایی از نقره که آنها را به اندازه مناسب اندازه گیری کرده اند،"
          ],
          "fa.ayati": [
            "كوزه‌هايى از سيم كه آنها را به اندازه پُر كرده‌اند."
          ],
          "fa.bahrampour": [
            "جام‌هايى بلورين از نقره كه درست به اندازه باشند"
          ],
          "fa.fooladvand": [
            "جامهايى از سيم كه درست به اندازه [و با كمال ظرافت‌] آنها را از كار در آورده‌اند."
          ],
          "fa.ghomshei": [
            "که آن بلورین کوزه‌ها به رنگ نقره خام و به اندازه و تناسب (اهلش) مقدر کرده‌اند."
          ],
          "fa.khorramdel": [
            "قدحهای بلورینی که از نقره‌اند. (خدمتکاران بهشتی) آنها را درست به اندازه‌ی لازم پیموده‌اند. [[«قَوَارِیرَ مِن فِضَّةٍ ...»: ظرفهای بلورینی که سیمین هستند! در جهان ما چنین ظرفی مطلقاً وجود ندارد. یا این که مراد شفّافیّت بی‌حدّ ظروف است. «قَدَّرُوهَا»: خدمتکاران بهشتی آنها را به اندازه لازم و برابر ذوق و طبع و خواست بهشتیان تهیّه دیده‌اند و پیموده‌اند (نگا: فرقان / 2).]]"
          ],
          "fa.khorramshahi": [
            "آبگینه‌هایی از سیم که آنها را به اندازه پیموده باشند"
          ],
          "fa.makarem": [
            "ظرفهای بلورینی از نقره، که آنها را به اندازه مناسب آماده کرده‌اند!"
          ],
          "fa.moezzi": [
            "آبگینه هائی از سیم که پرداختندش پرداختنی‌"
          ],
          "fa.mojtabavi": [
            "آبگينه‌هايى از سيم- سفيد و شفاف به صفاى آبگينه- كه [فراخور نوشندگان‌] به اندازه كرده باشند."
          ],
          "fa.sadeqi": [
            "جام‌هایی از نقره را که درست به‌اندازه (و با کمال ظرافت) آنها را از کار درآورده‌اند."
          ]
        }
      },
      {
        "index": 5608,
        "local_index": 17,
        "part_type": "Verse",
        "path": "/books/quran:76:17",
        "text": [
          "وَ يُسْقَوْنَ‌ فِيهَا کَأْساً کَانَ‌ مِزَاجُهَا زَنْجَبِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "There will they drink a cup flavoured with ginger"
          ],
          "en.ahmedraza": [
            "And in Paradise they will be given to drink cups, filled with a mixture of ginger."
          ],
          "en.arberry": [
            "And therein they shall be given to drink a cup whose mixture is ginger,"
          ],
          "en.daryabadi": [
            "And therein they shall be given to drink of a cup whereof the admixture will be ginger."
          ],
          "en.hilali": [
            "And they will be given to drink there a cup (of wine) mixed with Zanjabil (ginger, etc.),"
          ],
          "en.itani": [
            "They will be served therein with a cup whose flavor is Zanjabeel."
          ],
          "en.maududi": [
            "Therein they shall be served a cup flavoured with ginger,"
          ],
          "en.mubarakpuri": [
            "And they will be given to drink there of a cup (of wine) mixed with Zanjabil (ginger),"
          ],
          "en.pickthall": [
            "There are they watered with a cup whereof the mixture is of Zanjabil,"
          ],
          "en.qarai": [
            "They will be served therein with a cup of a drink seasoned with Zanjabeel,"
          ],
          "en.qaribullah": [
            "And they shall be given to drink from a cup whose mixture is ginger,"
          ],
          "en.sahih": [
            "And they will be given to drink a cup [of wine] whose mixture is of ginger"
          ],
          "en.sarwar": [
            "They will drink cups containing (soft flowing) sparkling water"
          ],
          "en.shakir": [
            "And they shall be made to drink therein a cup the admixture of which shall be ginger,"
          ],
          "en.transliteration": [
            "Wayusqawna feeh<u>a</u> kasan k<u>a</u>na miz<u>a</u>juh<u>a</u> zanjabeel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and they will be given a cup to drink flavoured with ginger,"
          ],
          "en.yusufali": [
            "And they will be given to drink there of a Cup (of Wine) mixed with Zanjabil,-"
          ],
          "fa.ansarian": [
            "و در آنجا جامی که نوشیدنی اش آمیخته به زنجبیل است، به آنان می نوشانند،"
          ],
          "fa.ayati": [
            "در آنجا جامى بنوشانندشان كه آميخته با زنجبيل باشد،"
          ],
          "fa.bahrampour": [
            "و در آن جا از جامى كه آميزه‌ى زنجبيل دارد به آنان مى‌نوشانند"
          ],
          "fa.fooladvand": [
            "و در آنجا از جامى كه آميزه زنجبيل دارد به آنان مى‌نوشانند."
          ],
          "fa.ghomshei": [
            "و آنجا شرابی که طبعش چون زنجبیل (گرم و عطرآگین) است به آنها بنوشانند."
          ],
          "fa.khorramdel": [
            "در آنجا از جامهای شرابی بدیشان می‌دهند که آمیزه‌ی آن زنجبیل است. [[«مِزَاجُهَا»: (نگا: انسان / 5). «زَنجَبِیلاً»: اسم گیاهی است که در مناطق گرمسیر می‌روید. عربها زنجبیل را به خاطر نشاط‌آور و محرک و خوشبو بودن در شراب می‌ریختند.]]"
          ],
          "fa.khorramshahi": [
            "و در آنجا به آنان جامی بنوشانند که آمیزه آن زنجبیل است‌"
          ],
          "fa.makarem": [
            "و در آنجا از جامهایی سیراب می‌شوند که لبریز از شراب طهوری آمیخته با زنجبیل است،"
          ],
          "fa.moezzi": [
            "و نوشانیده شوند در آن جامی که باشد آمیزش آن زنجبیل‌"
          ],
          "fa.mojtabavi": [
            "و در آنجا جامى بنوشانندشان كه آميزه آن زنجبيل است."
          ],
          "fa.sadeqi": [
            "و در آن‌جا از جامی که آمیزه‌ی زنجبیل داشته به آنان می‌نوشانند،"
          ]
        }
      },
      {
        "index": 5609,
        "local_index": 18,
        "part_type": "Verse",
        "path": "/books/quran:76:18",
        "text": [
          "عَيْناً فِيهَا تُسَمَّى‌ سَلْسَبِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "From a spring by the name of Ever-flowing-Salsabil."
          ],
          "en.ahmedraza": [
            "Which is a spring in Paradise called Salsabeel."
          ],
          "en.arberry": [
            "therein a fountain whose name is called Salsabil."
          ],
          "en.daryabadi": [
            "From a fountain therein, named Salsabil."
          ],
          "en.hilali": [
            "A spring there, called Salsabil."
          ],
          "en.itani": [
            "A spring therein named Salsabeel."
          ],
          "en.maududi": [
            "drawn from a spring (in Paradise) called Salsabil."
          ],
          "en.mubarakpuri": [
            "A spring there, called Salsabil."
          ],
          "en.pickthall": [
            "(The water of) a spring therein, named Salsabil."
          ],
          "en.qarai": [
            "from a spring in it named Salsabeel."
          ],
          "en.qaribullah": [
            "from a fountain called Salsabila."
          ],
          "en.sahih": [
            "[From] a fountain within Paradise named Salsabeel."
          ],
          "en.sarwar": [
            "from a spring named salsabil."
          ],
          "en.shakir": [
            "(Of) a fountain therein which is named Salsabil."
          ],
          "en.transliteration": [
            "AAaynan feeh<u>a</u> tusamm<u>a</u> salsabeel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "from a flowing spring called Salsabil."
          ],
          "en.yusufali": [
            "A fountain there, called Salsabil."
          ],
          "fa.ansarian": [
            "از چشمه ای در آنجا که «سلسبیل» نامیده شود،"
          ],
          "fa.ayati": [
            "از چشمه‌اى كه آن را سلسبيل مى‌گويند."
          ],
          "fa.bahrampour": [
            "از چشمه‌اى در بهشت كه «سلسبيل» ناميده مى‌شود"
          ],
          "fa.fooladvand": [
            "از چشمه‌اى در آنجا كه «سلسبيل» ناميده مى‌شود."
          ],
          "fa.ghomshei": [
            "در آنجا چشمه‌ای است که سلسبیلش نامند."
          ],
          "fa.khorramdel": [
            "(این جامها پر می‌شوند از) چشمه‌ای که در بهشت است و سلسبیل نامیده می‌شود. [[«عَیْناً»: (نگا: انسان / 6). «سَلْسَبِیلاً»: در لغت، به معنی آب روان و خوشگوار است. در اینجا اسم خاصّ است.]]"
          ],
          "fa.khorramshahi": [
            "از چشمه‌ای در آنجا که سلسبیل نامیده می‌شود"
          ],
          "fa.makarem": [
            "از چشمه‌ای در بهشت که نامش سلسبیل است!"
          ],
          "fa.moezzi": [
            "چشمه‌ای در آن که نامیده شود سلسبیل‌"
          ],
          "fa.mojtabavi": [
            "[از] چشمه‌اى در آنجا كه سلسبيل- روان و گوارا- نامند."
          ],
          "fa.sadeqi": [
            "چشمه‌ای در آن‌جا که سلسبیل نامیده می‌شود."
          ]
        }
      },
      {
        "index": 5610,
        "local_index": 19,
        "part_type": "Verse",
        "path": "/books/quran:76:19",
        "text": [
          "وَ يَطُوفُ‌ عَلَيْهِمْ‌ وِلْدَانٌ‌ مُخَلَّدُونَ‌ إِذَا رَأَيْتَهُمْ‌ حَسِبْتَهُمْ‌ لُؤْلُؤاً مَنْثُوراً"
        ],
        "translations": {
          "en.ahmedali": [
            "And boys of everlasting youth will go about attending them. Looking at them you would think that they were pearls dispersed."
          ],
          "en.ahmedraza": [
            "Immortal youths shall surround them, waiting upon them; when you see them, you would think they are scattered pearls."
          ],
          "en.arberry": [
            "Immortal youths shall go about them; when thou seest them, thou supposest them scattered pearls,"
          ],
          "en.daryabadi": [
            "And there shall go round Unto them youths ever-young. When thou seest them thou wouldst deem them pearls unstrung."
          ],
          "en.hilali": [
            "And round about them will (serve) boys of everlasting youth. If you see them, you would think them scattered pearls."
          ],
          "en.itani": [
            "Passing among them are eternalized youths. If you see them, you would think them sprinkled pearls."
          ],
          "en.maududi": [
            "There boys of everlasting youth shall go about attending them: when you see them, you would think that they are scattered pearls."
          ],
          "en.mubarakpuri": [
            "And round about them will (serve) boys of everlasting youth. If you see them, you would think them scattered pearls."
          ],
          "en.pickthall": [
            "There wait on them immortal youths, whom, when thou seest, thou wouldst take for scattered pearls."
          ],
          "en.qarai": [
            "They will be waited upon by immortal youths, whom, were you to see them, you will suppose them to be scattered pearls."
          ],
          "en.qaribullah": [
            "Immortal youths will go about them, when you see them, you would suppose them to be scattered pearls."
          ],
          "en.sahih": [
            "There will circulate among them young boys made eternal. When you see them, you would think them [as beautiful as] scattered pearls."
          ],
          "en.sarwar": [
            "They will be served by immortal youths who look like scattered pearls."
          ],
          "en.shakir": [
            "And round about them shall go youths never altering in age; when you see them you will think them to be scattered pearls."
          ],
          "en.transliteration": [
            "Waya<u>t</u>oofu AAalayhim wild<u>a</u>nun mukhalladoona i<u>tha</u> raaytahum <u>h</u>asibtahum luluan manthoor<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "They will be attended by youths who will not age -- when you see them you will think them to be like sprinkled pearls --"
          ],
          "en.yusufali": [
            "And round about them will (serve) youths of perpetual (freshness): If thou seest them, thou wouldst think them scattered Pearls."
          ],
          "fa.ansarian": [
            "و پیرامونشان نوجوانانی جاودانی [برای پذیرایی از آنان] می گردند، که چون آنان را ببینی پنداری مرواریدی پراکنده اند،"
          ],
          "fa.ayati": [
            "همواره پسرانى به گردشان مى‌چرخند كه چون آنها را ببينى، پندارى مرواريد پراكنده‌اند."
          ],
          "fa.bahrampour": [
            "و بر گرد آنها پسرانى هميشه جوان بگردند كه چون آنها را ببينى، پنداريشان كه مرواريدهايى پراكنده‌اند"
          ],
          "fa.fooladvand": [
            "و بر گرد آنان پسرانى جاودانى مى‌گردند. چون آنها را ببينى، گويى كه مرواريدهايى پراكنده‌اند."
          ],
          "fa.ghomshei": [
            "و دور آن بهشتیان پسرانی زیبا که تا ابد نوجوانند و خوش سیما به خدمت می‌گردند که در آنها چو بنگری (از فرط صفا) گمان بری که لؤلؤ منثورند."
          ],
          "fa.khorramdel": [
            "همواره نوجوانان جاودانه‌ای میانشان می‌گردند (و به خدمتشان می‌پردازند) که هرگاه ایشان را بنگری چنین می‌انگاری که مروارید غلتانند. [[«وِلْدانٌ مُّخَلَّدُونَ»: (نگا: واقعه / 17). «مَنثُوراً»: پراکنده. «لؤْلُؤاً مَّنثُوراً»: مروارید پراکنده. مروارید غلتان. اشاره به زیبائی و درخشندگی و جذّابیّت غلامان خدمتگزار است.]]"
          ],
          "fa.khorramshahi": [
            "و پسرانی جاویدان برگرد آنان گردند، که چون بنگریشان، پنداریشان که مروارید پراکنده‌اند"
          ],
          "fa.makarem": [
            "و بر گردشان (برای پذیرایی) نوجوانانی جاودانی می‌گردند که هرگاه آنها را ببینی گمان می‌کنی مروارید پراکنده‌اند!"
          ],
          "fa.moezzi": [
            "و گردش کنند بر ایشان پسرانی جاودانی گاهی که بنگریشان پنداریشان مرواریدهای پوشیده‌"
          ],
          "fa.mojtabavi": [
            "و پسرانى جاودانى و پاينده بر گردشان مى‌گردند- به خدمت- كه چون آنان را ببينى پندارى كه مرواريد پراكنده‌اند."
          ],
          "fa.sadeqi": [
            "و بر گِردشان پسرانی جاودان می‌گردند. هنگامی که آنان را ببینی، گویی که مرواریدهایی (بر گرد خود) پراکنده‌اند."
          ]
        }
      },
      {
        "index": 5611,
        "local_index": 20,
        "part_type": "Verse",
        "path": "/books/quran:76:20",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:24:1"
          ]
        },
        "text": [
          "وَ إِذَا رَأَيْتَ‌ ثَمَ‌ رَأَيْتَ‌ نَعِيماً وَ مُلْکاً کَبِيراً"
        ],
        "translations": {
          "en.ahmedali": [
            "When you look around, you will see delights and great dominion."
          ],
          "en.ahmedraza": [
            "And when you look towards it, you will see serenity and a great kingdom."
          ],
          "en.arberry": [
            "when thou seest them then thou seest bliss and a great kingdom."
          ],
          "en.daryabadi": [
            "And when thou lookest them thou shalt behold delight and a dominion magnificent."
          ],
          "en.hilali": [
            "And when you look there (in Paradise), you will see a delight (that cannot be imagined), and a great dominion."
          ],
          "en.itani": [
            "Wherever you look, you see bliss, and a vast kingdom."
          ],
          "en.maududi": [
            "Whitherto you look around, you will see an abundance of bliss and the glories of a great kingdom."
          ],
          "en.mubarakpuri": [
            "And when you look there (in Paradise), you will see a delight (that cannot be imagined), and a great dominion."
          ],
          "en.pickthall": [
            "When thou seest, thou wilt see there bliss and high estate."
          ],
          "en.qarai": [
            "As you look on, you will see there bliss and a great kingdom."
          ],
          "en.qaribullah": [
            "When you see them, you see bliss, and a great Kingdom."
          ],
          "en.sahih": [
            "And when you look there [in Paradise], you will see pleasure and great dominion."
          ],
          "en.sarwar": [
            "If you were to see it, you would find it to be a great kingdom with great bounty."
          ],
          "en.shakir": [
            "And when you see there, you shall see blessings and a great kingdom."
          ],
          "en.transliteration": [
            "Wai<u>tha</u> raayta thamma raayta naAAeeman wamulkan kabeer<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "wherever you look, you will see bliss and a great kingdom:"
          ],
          "en.yusufali": [
            "And when thou lookest, it is there thou wilt see a Bliss and a Realm Magnificent."
          ],
          "fa.ansarian": [
            "و چون آنجا را ببینی، نعمتی فراوان و کشوری بزرگ بینی،"
          ],
          "fa.ayati": [
            "چون بنگرى، هر چه بنگرى نعمت فراوان است و فرمانروايى بزرگ."
          ],
          "fa.bahrampour": [
            "و چون آن جا را بنگرى، ناز و نعمت [فراوان‌] و ملكى بى‌كران ببينى"
          ],
          "fa.fooladvand": [
            "و چون بدانجا نگرى [سرزمينى از] نعمت و كشورى پهناور مى‌بينى."
          ],
          "fa.ghomshei": [
            "و چون آن جایگاه نیکو را مشاهده کنی عالمی پر نعمت و کشوری بی نهایت بزرگ خواهی یافت."
          ],
          "fa.khorramdel": [
            "هنگامی که بنگری، در آنجا نعمت فراوانی و سرزمین فراخی و پادشاهی بزرگی را خواهی دید. [[«ثَمَّ»: آنجا. مراد بهشت است. «مُلْکاً کَبِیراً»: سرزمین بزرگ و وسیع. مملکت فراخ. پادشاهی و سلطنت عظیم (نگا: تفسیر کبیر).]]"
          ],
          "fa.khorramshahi": [
            "و چون آنجا را بنگری، ناز و نعمت [فراوان‌] و ملک بیکران بینی‌"
          ],
          "fa.makarem": [
            "و هنگامی که آنجا را ببینی نعمتها و ملک عظیمی را می‌بینی!"
          ],
          "fa.moezzi": [
            "و گاهی که بنگری آنجا بینی نعمتهائی و پادشاهی بزرگ‌"
          ],
          "fa.mojtabavi": [
            "و چون به آنجا بنگرى نعمتها بينى- كه در وصف نگنجد- و پادشاهيى بزرگ."
          ],
          "fa.sadeqi": [
            "و هنگامی که بدانجا نگری، (سرزمینی از) نعمتی (بارور) و کشوری پهناور می‌بینی."
          ]
        }
      },
      {
        "index": 5612,
        "local_index": 21,
        "part_type": "Verse",
        "path": "/books/quran:76:21",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:8:1:24:1"
          ]
        },
        "text": [
          "عَالِيَهُمْ‌ ثِيَابُ‌ سُنْدُسٍ‌ خُضْرٌ وَ إِسْتَبْرَقٌ‌ وَ حُلُّوا أَسَاوِرَ مِنْ‌ فِضَّةٍ وَ سَقَاهُمْ‌ رَبُّهُمْ‌ شَرَاباً طَهُوراً"
        ],
        "translations": {
          "en.ahmedali": [
            "On their bodies will be garments of the finest green silk and brocade, and they will be adorned with bracelets of silver; and their Lord will give them a purest draught to drink."
          ],
          "en.ahmedraza": [
            "In it they adorn clothes of fine green silk and gold embroidery; and they are given silver bracelets to wear; and their Lord gave them pure wine to drink."
          ],
          "en.arberry": [
            "Upon them shall be green garments of silk and brocade; they are adorned with bracelets of silver, and their Lord shall give them to drink a pure draught."
          ],
          "en.daryabadi": [
            "Upon them shall be garments of fine green silk and of brocades. And adorned they shall be with bracelets of silver: and their Lord shall give them drink a beverage pure."
          ],
          "en.hilali": [
            "Their garments will be of fine green silk, and gold embroidery. They will be adorned with bracelets of silver, and their Lord will give them a pure drink."
          ],
          "en.itani": [
            "Upon them are garments of green silk, and satin. And they will be adorned with bracelets of silver. And their Lord will offer them a pure drink."
          ],
          "en.maududi": [
            "They [i.e., the virtuous] shall be attired in garments of fine green silk and rich brocade and will be adorned with bracelets of silver. Their Lord will give them a pure wine to drink."
          ],
          "en.mubarakpuri": [
            "Their garments will be of fine green silk, and Istabraq. They will be adorned with bracelets of silver, and their Lord will give them a purifying drink."
          ],
          "en.pickthall": [
            "Their raiment will be fine green silk and gold embroidery. Bracelets of silver will they wear. Their Lord will slake their thirst with a pure drink."
          ],
          "en.qarai": [
            "Upon them will be cloaks of green silk and brocade and they will be adorned with bracelets of silver. Their Lord will give them to drink a pure drink."
          ],
          "en.qaribullah": [
            "Upon them there will be garments of green silk, rich brocade, and they will be adorned with bracelets of silver. Their Lord will give them a pure beverage to drink."
          ],
          "en.sahih": [
            "Upon the inhabitants will be green garments of fine silk and brocade. And they will be adorned with bracelets of silver, and their Lord will give them a purifying drink."
          ],
          "en.sarwar": [
            "They will have fine green silk and brocade, and they will be decked with bracelets of silver. Their Lord will provide them with a drink of pure wine."
          ],
          "en.shakir": [
            "Upon them shall be garments of fine green silk and thick silk interwoven with gold, and they shall be adorned with bracelets of silver, and their Lord shall make them drink a pure drink."
          ],
          "en.transliteration": [
            "AA<u>a</u>liyahum thiy<u>a</u>bu sundusin khu<u>d</u>run waistabraqun wa<u>h</u>ulloo as<u>a</u>wira min fi<u>dd</u>atin wasaq<u>a</u>hum rabbuhum shar<u>a</u>ban <u>t</u>ahoor<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "they will wear green garments of fine silk and rich brocade. They will be adorned with silver bracelets. And their Lord will give them a pure drink."
          ],
          "en.yusufali": [
            "Upon them will be green Garments of fine silk and heavy brocade, and they will be adorned with Bracelets of silver; and their Lord will give to them to drink of a Wine Pure and Holy."
          ],
          "fa.ansarian": [
            "بر اندامشان جامه هایی از حریر نازک و سبز رنگ و دیبای ستبر است و با دستبندهایی از نقره آراسته شده اند، و پروردگارشان باده طهور به آنان می نوشاند."
          ],
          "fa.ayati": [
            "بر تنشان جامه‌هايى است از سُندس سبز و استبرق. و به دستبندهايى از سيم زينت شده‌اند. و پروردگارشان از شرابى پاكيزه سيرابشان سازد."
          ],
          "fa.bahrampour": [
            "بر تنشان جامه‌هاى ابريشمى سبز و ديباى ستبر است و با دستبندهاى سيمين آراسته شده‌اند، و پروردگارشان باده‌اى پاك به آنان بنوشاند"
          ],
          "fa.fooladvand": [
            "[بهشتيان را] جامه‌هاى ابريشمى سبز و ديباى ستبر در بر است و پيرايه آنان دستبندهاى سيمين است و پروردگارشان باده‌اى پاك به آنان مى‌نوشاند."
          ],
          "fa.ghomshei": [
            "بر بالای بهشتیان، لطیف دیبای سبز و حریر ستبر است و بر دستهاشان دستبند نقره خام، و خدایشان شرابی پاک (و گوارا از کوثر عنایت) بنوشاند."
          ],
          "fa.khorramdel": [
            "بر تن ایشان، لباسهای ابریشم نازک سبز و دیبای ضخیم است، و با دستبندها و النگوهای سیمین، زیب و زینت شده‌اند، و پروردگارشان بدیشان شراب پاک می‌نوشاند. [[«عَالِیَهُمْ»: بر اندام ایشان است. به تن ایشان است. واژه عالی، حال ضمیر (هم) در (عَلَیْهِم)، یا مفعول‌فیه است، هرچند که در قالب اسم فاعل است. مثل: (خارج، داخل، باطن، ظاهر). می‌توان گفت: جَلَسْتُ خَارِجَ الدَّارِ. «سُندُسٍ ... إِسْتَبْرَقٌ»: (نگا: کهف / 31، دخان / 53). «حُلُّوا»: آراسته گشته‌اند. زینت شده‌اند. فعل ماضی مجهول از مصدر تحلیه است. «أَسَاوِرَ»: (نگا: کهف / 31، حجّ / 23، فاطر / 33). «طَهُوراً»: بسیار پاک و پاکیزه (نگا: فرقان / 48). این شراب عالی‌ترین نوع شراب بوده و غیر از شراب مذکور در آیات پنجم و هفدهم است.]]"
          ],
          "fa.khorramshahi": [
            "بر بالای آنان جامه‌هایی از ابریشم نازک سبز و ابریشم ستبر است، و به دستبندهای سیمین آراسته‌اند، و پروردگارشان به آنان شرابی پاکیزه نوشاند"
          ],
          "fa.makarem": [
            "بر اندام آنها [= بهشتیان‌] لباسهایی است از حریر نازک سبزرنگ، و از دیبای ضخیم، و با دستبندهایی از نقره آراسته‌اند، و پروردگارشان شراب طهور به آنان می‌نوشاند!"
          ],
          "fa.moezzi": [
            "بر ایشان (فراز ایشان) است جامه‌های سُندس سبزی و استبرقی و زیب داده شدند با دست‌بندهائی از سیم و نوشانیدشان پروردگارشان نوشابه پاک‌کننده‌"
          ],
          "fa.mojtabavi": [
            "بر بالايشان جامه‌هاى سبز از ديباى نازك و ستبر است، و با دستواره‌هاى سيمين زيور شده‌اند، و پروردگارشان شرابى پاكيزه بنوشاندشان."
          ],
          "fa.sadeqi": [
            "جامه‌های ابریشمین سبز و دیبای ستبر در بَرشان است و با دست‌بندهای سیمین زینت شده، و پروردگارشان آشامیدنی‌ای پاک‌کننده به آنان نوشانید."
          ]
        }
      },
      {
        "index": 5613,
        "local_index": 22,
        "part_type": "Verse",
        "path": "/books/quran:76:22",
        "text": [
          "إِنَ‌ هٰذَا کَانَ‌ لَکُمْ‌ جَزَاءً وَ کَانَ‌ سَعْيُکُمْ‌ مَشْکُوراً"
        ],
        "translations": {
          "en.ahmedali": [
            "\"This in truth is your recompense, and acceptance of your endeavours.\""
          ],
          "en.ahmedraza": [
            "It will be said to them, “This is your reward – indeed your efforts have been appreciated.”"
          ],
          "en.arberry": [
            "Behold, this is a recompense for you, and your striving is thanked.'"
          ],
          "en.daryabadi": [
            "Verily this is for you by way of recompense, and your endeavour hath been accepted."
          ],
          "en.hilali": [
            "(And it will be said to them): \"Verily, this is a reward for you, and your endeavour has been accepted.\""
          ],
          "en.itani": [
            "“This is a reward for you. Your efforts are well appreciated.”"
          ],
          "en.maududi": [
            "Behold, this is your recompense and your endeavour has been appreciated."
          ],
          "en.mubarakpuri": [
            "(And it will be said to them): \"Verily, this is a reward for you, and your endeavor has been accepted.\""
          ],
          "en.pickthall": [
            "(And it will be said unto them): Lo! this is a reward for you. Your endeavour (upon earth) hath found acceptance."
          ],
          "en.qarai": [
            "[They will be told]: ‘This is your reward, and your efforts have been well-appreciated.’"
          ],
          "en.qaribullah": [
            "'See, this is your recompense, your striving is thanked'"
          ],
          "en.sahih": [
            "[And it will be said], \"Indeed, this is for you a reward, and your effort has been appreciated.\""
          ],
          "en.sarwar": [
            "This will be their reward and their efforts will be appreciated."
          ],
          "en.shakir": [
            "Surely this is a reward for you, and your striving shall be recompensed."
          ],
          "en.transliteration": [
            "Inna h<u>atha</u> k<u>a</u>na lakum jaz<u>a</u>an wak<u>a</u>na saAAyukum mashkoor<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "This is your reward. Your endeavour is fully acknowledged."
          ],
          "en.yusufali": [
            "\"Verily this is a Reward for you, and your Endeavour is accepted and recognised.\""
          ],
          "fa.ansarian": [
            "[به آنان گوید:] یقیناً این [نعمت ها] پاداش شماست و تلاشتان مقبول افتاده است؛"
          ],
          "fa.ayati": [
            "اين پاداش شماست و از كوششتان سپاسگزارى شده است."
          ],
          "fa.bahrampour": [
            "همانا اين پاداشى براى شماست و از تلاش شما سپاسگزارى شده است"
          ],
          "fa.fooladvand": [
            "اين [پاداش‌] براى شماست و كوشش شما مقبول افتاده است."
          ],
          "fa.ghomshei": [
            "این بهشت به حقیقت پاداش (اعمال) شماست و سعی و اشتیاقتان (در راه طاعت حق) مشکور و مقبول است."
          ],
          "fa.khorramdel": [
            "این (نعمتهای فراوان) پاداش (کارهای پسندیده‌ی دنیوی) شما است، و (بدین وسیله) از تلاش و کوشش شما قدردانی و سپاسگزاری می‌شود. [[«مَشْکُوراً»: مورد تشکّر (نگا: اسراء / 19).]]"
          ],
          "fa.khorramshahi": [
            "این پاداشی برای شماست و سعی شما مشکور است‌"
          ],
          "fa.makarem": [
            "این پاداش شماست، و سعی و تلاش شما مورد قدردانی است!"
          ],
          "fa.moezzi": [
            "همانا این است شما را پاداشی و بوده است کوشش شما سپاسگزارده‌"
          ],
          "fa.mojtabavi": [
            "همانا اين براى شما پاداشى است و كوشش شما پذيرفته و سپاس داشته است."
          ],
          "fa.sadeqi": [
            "«همانا این برای شما پاداشی بوده است و کوشش شما مشکور بوده است.»"
          ]
        }
      },
      {
        "index": 5614,
        "local_index": 23,
        "part_type": "Verse",
        "path": "/books/quran:76:23",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:108:88",
            "/books/al-kafi:1:4:108:91"
          ]
        },
        "text": [
          "إِنَّا نَحْنُ‌ نَزَّلْنَا عَلَيْکَ‌ الْقُرْآنَ‌ تَنْزِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "We have revealed the Qur'an to you gradually;"
          ],
          "en.ahmedraza": [
            "Indeed We have sent down the Qur’an upon you, in stages."
          ],
          "en.arberry": [
            "Surely We have sent down the Koran on thee, a sending down;"
          ],
          "en.daryabadi": [
            "Verily We! it is We Who have revealed Unto thee the Qur'an, a gradual revelation."
          ],
          "en.hilali": [
            "Verily! It is We Who have sent down the Quran to you (O Muhammad SAW) by stages."
          ],
          "en.itani": [
            "It is We who sent down the Quran upon you—a gradual revelation."
          ],
          "en.maududi": [
            "(O Prophet), indeed We have revealed the Qur'an to you in portions."
          ],
          "en.mubarakpuri": [
            "Verily, it is We Who have sent down the Qur'an to you by stages."
          ],
          "en.pickthall": [
            "Lo! We, even We, have revealed unto thee the Qur'an, a revelation;"
          ],
          "en.qarai": [
            "Indeed We have sent down to you the Quran in a gradual descent."
          ],
          "en.qaribullah": [
            "We have indeed, sent down to you the Koran, a (clear) sending,"
          ],
          "en.sahih": [
            "Indeed, it is We who have sent down to you, [O Muhammad], the Qur'an progressively."
          ],
          "en.sarwar": [
            "(Muhammad), We have revealed the Quran to you in gradual steps."
          ],
          "en.shakir": [
            "Surely We Ourselves have revealed the Quran to you revealing (it) in portions."
          ],
          "en.transliteration": [
            "Inn<u>a</u> na<u>h</u>nu nazzaln<u>a</u> AAalayka alqur<u>a</u>na tanzeel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Truly, it is We who have revealed to you the Quran, a gradual revelation."
          ],
          "en.yusufali": [
            "It is We Who have sent down the Qur'an to thee by stages."
          ],
          "fa.ansarian": [
            "به راستی ما قرآن را به تدریج بر تو نازل کردیم؛"
          ],
          "fa.ayati": [
            "ما قرآن را بر تو نازل كرديم، نازل‌كردنى نيكو."
          ],
          "fa.bahrampour": [
            "به تحقيق ما قرآن را آن طور كه بايد بر تو نازل كرديم"
          ],
          "fa.fooladvand": [
            "در حقيقت، ما قرآن را بر تو به تدريج فرو فرستاديم."
          ],
          "fa.ghomshei": [
            "محققا ما این قرآن (عظیم الشأن) را بر تو فرو فرستادیم."
          ],
          "fa.khorramdel": [
            "ما خودمان قرآن را به تدریج بر تو نازل کرده‌ایم. [[«نَزَّلْنَا ... تَنزِیلاً»: (نگا: اسراء / 106، فرقان / 25). ذکر مفعول مطلق، اشاره به نزول تدریجی قرآن است، و تأکیدی بر نزول قرآن از سوی یزدان جهان.]]"
          ],
          "fa.khorramshahi": [
            "ما خود قرآن را بر تو چنانکه باید و شاید فرو فرستاده‌ایم‌"
          ],
          "fa.makarem": [
            "مسلّماً ما قرآن را بر تو نازل کردیم!"
          ],
          "fa.moezzi": [
            "همانا ما فرستادیم بر تو قرآن را فرستادنی‌"
          ],
          "fa.mojtabavi": [
            "همانا ما قرآن را بر تو فرو فرستاديم، فرستادنى- به تدريج، سوره سوره و آيه آيه-."
          ],
          "fa.sadeqi": [
            "در حقیقت ما قرآن را بر تو به تدریج فروفرستادیم فرستادنی (رسا)."
          ]
        }
      },
      {
        "index": 5615,
        "local_index": 24,
        "part_type": "Verse",
        "path": "/books/quran:76:24",
        "text": [
          "فَاصْبِرْ لِحُکْمِ‌ رَبِّکَ‌ وَ لاَ تُطِعْ‌ مِنْهُمْ‌ آثِماً أَوْ کَفُوراً"
        ],
        "translations": {
          "en.ahmedali": [
            "So wait for your Lord's command, and do not follow any sinner or disbeliever among them."
          ],
          "en.ahmedraza": [
            "Therefore stay patient upon your Lord’s command, and do not listen to any of the sinners or ingrates among them."
          ],
          "en.arberry": [
            "so be thou patient under the judgment of thy Lord, and obey not one of them, sinner or unbeliever."
          ],
          "en.daryabadi": [
            "Wherefore persevere thou with the commandment of thy Lord, and obey not thou of them, any sinner or ingrate."
          ],
          "en.hilali": [
            "Therefore be patient (O Muhammad SAW) and submit to the Command of your Lord (Allah, by doing your duty to Him and by conveying His Message to mankind), and obey neither a sinner nor a disbeliever among them."
          ],
          "en.itani": [
            "So be patient for the decision of your Lord, and do not obey the sinner or the blasphemer among them."
          ],
          "en.maududi": [
            "So persevere with the command of your Lord and do not pay any heed to the wicked and the unbelieving,"
          ],
          "en.mubarakpuri": [
            "Therefore be patient with constancy to the command of your Lord, and obey neither a sinner nor a disbeliever among them."
          ],
          "en.pickthall": [
            "So submit patiently to thy Lord's command, and obey not of them any guilty one or disbeliever."
          ],
          "en.qarai": [
            "So submit patiently to the judgement of your Lord and do not obey any sinner or ingrate from among them,"
          ],
          "en.qaribullah": [
            "therefore be patient under the Judgement of your Lord, and do not obey either the sinner or the unbeliever."
          ],
          "en.sahih": [
            "So be patient for the decision of your Lord and do not obey from among them a sinner or ungrateful [disbeliever]."
          ],
          "en.sarwar": [
            "So wait patiently for the command of your Lord and do not yield to any sinful or disbelieving person among them (people)."
          ],
          "en.shakir": [
            "Therefore wait patiently for the command of your Lord, and obey not from among them a sinner or an ungrateful one."
          ],
          "en.transliteration": [
            "Fa<b>i</b><u>s</u>bir li<u>h</u>ukmi rabbika wal<u>a</u> tu<u>t</u>iAA minhum <u>a</u>thiman aw kafoor<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "So wait patiently for the command of your Lord, and do not yield to anyone among them who is sinful or ungrateful;"
          ],
          "en.yusufali": [
            "Therefore be patient with constancy to the Command of thy Lord, and hearken not to the sinner or the ingrate among them."
          ],
          "fa.ansarian": [
            "پس در برابر فرمان پروردگارت شکیبا باش، و از هیچ گنهکار یا کافری از آنان اطاعت مکن،"
          ],
          "fa.ayati": [
            "در برابر فرمان پروردگارت صابر باش و از هيچ گناهكار يا ناسپاسى اطاعت مكن."
          ],
          "fa.bahrampour": [
            "پس براى حكم پروردگارت صبور باش، و از آنها هيچ گناه پيشه يا ناسپاسى را اطاعت مكن"
          ],
          "fa.fooladvand": [
            "پس در برابر فرمان پروردگارت شكيبايى كن، و از آنان گناهكار يا ناسپاسگزار را فرمان مبر."
          ],
          "fa.ghomshei": [
            "پس بر اطاعت حکم پروردگارت صبور و شکیبا باش و هیچ از مردم بدکار کفر کیش اطاعت مکن."
          ],
          "fa.khorramdel": [
            "حال که چنین است در طریق تبلیغ و اجرای احکام پروردگارت شکیبا باش، و از هیچ کدام از گناهکاران و بی‌دینانشان فرمانبرداری مکن. [[«فَاصْبِرْ لِحُکْمِ رَبِّکَ»: (نگا: قلم / 48). «آثِم»: گناهکار. «کَفُوراً»: بسیار بی‌دین. غرق در کفر. بسیار ناسپاس (نگا: تفهیم القرآن). «لا تُطِعْ مِنْهُمْ ...»: یعنی از تهدیدشان نترس، و تحت تأثیر کردار و گفتارشان قرار نگیر، و فرمان خدا را بدون کم و کاست و ملاحظه این و آن برسان.]]"
          ],
          "fa.khorramshahi": [
            "به انتظار حکم پروردگارت شکیبا باش و از آنان از هیچ گناهکار یا ناسپاسی اطاعت مکن‌"
          ],
          "fa.makarem": [
            "پس در (تبلیغ و اجرای) حکم پروردگارت شکیبا (و با استقامت) باش، و از هیچ گنهکار یا کافری از آنان اطاعت مکن!"
          ],
          "fa.moezzi": [
            "پس شکیبا شو برای حکم پروردگار خویش و فرمانبرداری نکن از ایشان گنهکاری را یا ناسپاسی‌"
          ],
          "fa.mojtabavi": [
            "پس بر فرمان پروردگارت شكيبايى كن و از آنان هيچ گنه‌پيشه يا ناسپاسى را فرمان مبر."
          ],
          "fa.sadeqi": [
            "پس برای (رسیدن) فرمان پروردگارت شکیبایی کن و از (میان) آنان گناهکاری یا بسی ناسپاس را فرمان مبر."
          ]
        }
      },
      {
        "index": 5616,
        "local_index": 25,
        "part_type": "Verse",
        "path": "/books/quran:76:25",
        "text": [
          "وَ اذْکُرِ اسْمَ‌ رَبِّکَ‌ بُکْرَةً وَ أَصِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "Meditate upon the name of your Lord morning and evening;"
          ],
          "en.ahmedraza": [
            "And remember the name of your Lord morning and evening."
          ],
          "en.arberry": [
            "And remember the Name of thy Lord at dawn and in the evening"
          ],
          "en.daryabadi": [
            "And remember thou the name of thy Lord in the morning and in the evening."
          ],
          "en.hilali": [
            "And remember the Name of your Lord every morning and afternoon [i.e. offering of the Morning (Fajr), Zuhr, and 'Asr prayers]."
          ],
          "en.itani": [
            "And mention the Name of your Lord, morning and evening."
          ],
          "en.maududi": [
            "and remember the name of your Lord, morning and evening;"
          ],
          "en.mubarakpuri": [
            "And remember the Name of your Lord every morning and afternoon."
          ],
          "en.pickthall": [
            "Remember the name of thy Lord at morn and evening."
          ],
          "en.qarai": [
            "and celebrate the Name of your Lord morning and evening,"
          ],
          "en.qaribullah": [
            "And, remember the Name of your Lord at the dawn and in the evening;"
          ],
          "en.sahih": [
            "And mention the name of your Lord [in prayer] morning and evening"
          ],
          "en.sarwar": [
            "Mention the Name of your Lord, mornings and evenings."
          ],
          "en.shakir": [
            "And glorify the name of your Lord morning and evening."
          ],
          "en.transliteration": [
            "Wa<b>o</b><u>th</u>kuri isma rabbika bukratan waa<u>s</u>eel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and glorify your Lord morning and evening;"
          ],
          "en.yusufali": [
            "And celebrate the name of thy Lord morning and evening,"
          ],
          "fa.ansarian": [
            "و صبح و شام نام پروردگارت را یاد کن."
          ],
          "fa.ayati": [
            "و بامدادان و شامگاهان نام پروردگارت را بر زبان بياور."
          ],
          "fa.bahrampour": [
            "و هر صبح و شام نام پروردگارت را ياد كن"
          ],
          "fa.fooladvand": [
            "و نام پروردگارت را بامدادان و شامگاهان ياد كن."
          ],
          "fa.ghomshei": [
            "و نام خدایت را صبح و شام (به عظمت) یاد کن."
          ],
          "fa.khorramdel": [
            "بامدادان و شامگاهان نام پروردگارت را ورد زبان ساز. [[«بُکْرَةً»: بامدادان. اشاره‌ای به ادای نماز صبح در سپیده‌دمان نیز دارد. «أَصِیلاً»: شامگاهان. به فاصله میان ظهر و غروب آفتاب نیز اطلاق می‌شود، و لذا اشاره‌ای هم به ادای نمازهای ظهر و عصر دارد.]]"
          ],
          "fa.khorramshahi": [
            "و هر بامداد و شامگاهی نام پروردگارت را یاد کن‌"
          ],
          "fa.makarem": [
            "و نام پروردگارت را هر صبح و شام به یاد آور!"
          ],
          "fa.moezzi": [
            "و ببر نام پروردگارت را بامدادان و شب‌هنگام‌"
          ],
          "fa.mojtabavi": [
            "و نام پروردگارت را بامداد و شبانگاه ياد كن- در نماز و بيرون نماز-."
          ],
          "fa.sadeqi": [
            "و نام پروردگارت را بامدادان و شامگاهان یاد کن."
          ]
        }
      },
      {
        "index": 5617,
        "local_index": 26,
        "part_type": "Verse",
        "path": "/books/quran:76:26",
        "text": [
          "وَ مِنَ‌ اللَّيْلِ‌ فَاسْجُدْ لَهُ‌ وَ سَبِّحْهُ‌ لَيْلاً طَوِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "And bow in homage part of the night, and glorify Him far into the night."
          ],
          "en.ahmedraza": [
            "And prostrate for Him in a part of the night, and proclaim His purity into the long night."
          ],
          "en.arberry": [
            "and part of the night; bow down before Him and magnify Him through the long night."
          ],
          "en.daryabadi": [
            "And during the night - worship Him; and hallow Him the livelong night."
          ],
          "en.hilali": [
            "And during night, prostrate yourself to Him (i.e. the offering of Maghrib and 'Isha' prayers), and glorify Him a long night through (i.e. Tahajjud prayer)."
          ],
          "en.itani": [
            "And for part of the night, prostrate yourself to Him, and glorify Him long into the night."
          ],
          "en.maududi": [
            "and prostrate yourself before Him at night, and extol His Glory during the long watches of the night."
          ],
          "en.mubarakpuri": [
            "And during the night, prostrate yourself to Him, and glorify Him a long night through."
          ],
          "en.pickthall": [
            "And worship Him (a portion) of the night. And glorify Him through the livelong night."
          ],
          "en.qarai": [
            "and worship Him for a watch of the night and glorify Him the night long."
          ],
          "en.qaribullah": [
            "and in the night prostrate to Him; and exalt Him for a long night."
          ],
          "en.sahih": [
            "And during the night prostrate to Him and exalt Him a long [part of the] night."
          ],
          "en.sarwar": [
            "Prostrate before Him and glorify Him extensively during the night."
          ],
          "en.shakir": [
            "And during part of the night adore Him, and give glory to Him (a) long (part of the) night."
          ],
          "en.transliteration": [
            "Wamina allayli fa<b>o</b>sjud lahu wasabbi<u>h</u>hu laylan <u>t</u>aweel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "and during the night prostrate ourself before Him, and extol His glory for a long part of the night."
          ],
          "en.yusufali": [
            "And part of the night, prostrate thyself to Him; and glorify Him a long night through."
          ],
          "fa.ansarian": [
            "و پاره ای از شب را سر به سجده گذار، و او را در شب طولانی تسبیح گوی."
          ],
          "fa.ayati": [
            "در پاره‌اى از شب سجده‌اش كن و در همه درازناى شب تسبيحش گوى."
          ],
          "fa.bahrampour": [
            "و پاسى از شب را براى او سجده كن و بخشى طولانى از شب او را تسبيح گوى"
          ],
          "fa.fooladvand": [
            "و بخشى از شب را در برابر او سجده كن و شب‌[هاى‌] دراز، او را به پاكى بستاى."
          ],
          "fa.ghomshei": [
            "و شب را برخی (در نماز) به سجده خدا پرداز و شام دراز به تسبیح و ستایش او صبح گردان."
          ],
          "fa.khorramdel": [
            "و شبانگاهان برای خدا سجده و کرنش ببر، و در شب خیلی او را تسبیح و تقدیس کن. [[«مِنَ الَّیْلِ»: حرف (مِنْ) تبعیضیّه است. «فَاسْجُدْ لَهُ»: علاوه از عبادت شبانه، اشاره‌ای هم به ادای نماز مغرب و عشاء دارد. «سَبِّحْهُ لَیْلاً طَوِیلاً»: علاوه از ذکر و تسبیح شبانه، اشاره‌ای هم به نماز تهجّد دارد که از اهمّیّت خاصّی برخوردار است. واژه (طَوِیلاً) به ظاهر صفت (الَّیْلِ) است. ولی ذکر این قید برای این نیست که در شبهای کوتاه نماز تهجّد اداء نگردد، بلکه مراد این است که شب هر اندازه هم باشد دراز است و باید برای تقویت اراده و تهذیب نفس و افزایش ایمان، از آن استفاده کرد. یا این که (طَویلاً) صفت مصدر محذوف (تَسْبیحاً) است. یعنی خیلی خدا را در شب تسبیح و تقدیس کن (نگا: التفسیر القرآنی للقرآن). به هر حال این مقدار در (مزّمّل / 1 - 4) مشخّص شده است. به هر حال آیات 25 و 26 در حقیقت بیانگر لزوم توجّه شبانه‌روزی و مستمرّ به ذات اقدس پروردگار و ذکر او به زبان حال و قال است.]]"
          ],
          "fa.khorramshahi": [
            "و در بخشی از شب برای او [به نماز] سجده کن و در بخشی بلند از شب او را نیایش کن‌"
          ],
          "fa.makarem": [
            "و در شبانگاه برای او سجده کن، و مقداری طولانی از شب، او را تسبیح گوی!"
          ],
          "fa.moezzi": [
            "و از شب پس سجده کن برایش و تسبیحش گوی شبی دراز"
          ],
          "fa.mojtabavi": [
            "و در پاسى از شب او را سجده آر- نماز بگزار- و شبى دراز او را به پاكى بستاى."
          ],
          "fa.sadeqi": [
            "و پاسی از شب را پس برایش سجده کن، و شبی دراز او را به پاکی بستای."
          ]
        }
      },
      {
        "index": 5618,
        "local_index": 27,
        "part_type": "Verse",
        "path": "/books/quran:76:27",
        "text": [
          "إِنَ‌ هٰؤُلاَءِ يُحِبُّونَ‌ الْعَاجِلَةَ وَ يَذَرُونَ‌ وَرَاءَهُمْ‌ يَوْماً ثَقِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "Surely men love what hastes away and forget the grievous day (ahead)."
          ],
          "en.ahmedraza": [
            "Indeed these people love what they have, the fleeting one, and have forsaken the immensely important day behind them."
          ],
          "en.arberry": [
            "Surely these men love the hasty world, and leave be behind them a heavy day."
          ],
          "en.daryabadi": [
            "Verily those love the Herein, and leave in front of them a heavy day."
          ],
          "en.hilali": [
            "Verily! These (disbelievers) love the present life of this world, and put behind them a heavy Day (that will be hard)."
          ],
          "en.itani": [
            "As for these: they love the fleeting life, and leave behind a Heavy Day."
          ],
          "en.maududi": [
            "Verily they love (the good of this world) that is hastily obtainable and are oblivious of the burdensome Day ahead of them."
          ],
          "en.mubarakpuri": [
            "Verily, these love the present life of this world, and put behind them a heavy Day."
          ],
          "en.pickthall": [
            "Lo! these love fleeting life, and put behind them (the remembrance of) a grievous day."
          ],
          "en.qarai": [
            "Indeed they love this transitory life, and disregard a heavy day that is ahead of them."
          ],
          "en.qaribullah": [
            "Indeed, these love the hasty life, and are heedless and leave behind them a heavy Day."
          ],
          "en.sahih": [
            "Indeed, these [disbelievers] love the immediate and leave behind them a grave Day."
          ],
          "en.sarwar": [
            "These people (disbelievers) love the worldly life and neglect the terrifying day which will come."
          ],
          "en.shakir": [
            "Surely these love the transitory and neglect a grievous day before them."
          ],
          "en.transliteration": [
            "Inna h<u>a</u>ol<u>a</u>i yu<u>h</u>ibboona alAA<u>a</u>jilata waya<u>th</u>aroona war<u>a</u>ahum yawman thaqeel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "Those people [who are unmindful of God] aspire for immediate gains, and put behind them a Heavy Day."
          ],
          "en.yusufali": [
            "As to these, they love the fleeting life, and put away behind them a Day (that will be) hard."
          ],
          "fa.ansarian": [
            "بی تردید اینان [که گنهکار و ناسپاس اند] دنیای زودگذر را دوست دارند [و فقط برای به دست آوردن آن می کوشند] و روز هولناک و سختی را که پیش رو دارند وامی گذارند."
          ],
          "fa.ayati": [
            "اينان اين دنياى زودگذر را دوست دارند و آن روز دشوار را پس پشت مى‌افكنند."
          ],
          "fa.bahrampour": [
            "به تحقيق اينان دنياى زود گذر را دوست مى‌دارند و روزى گرانبار را پشت سرشان رها مى‌كنند [و به فراموشى مى‌سپارند]"
          ],
          "fa.fooladvand": [
            "اينان دنياى زودگذر را دوست دارند، و روزى گرانبار را [به غفلت‌] پشت سر مى‌افكنند."
          ],
          "fa.ghomshei": [
            "این مردم کافر غافل همه دنیای نقد عاجل را دوست می‌دارند و آن روز (قیامت) سخت سنگین را به کلی از یاد می‌برند."
          ],
          "fa.khorramdel": [
            "این (کافران و مشرکان) زندگی زودگذر دنیا را دوست می‌دارند، و روز سخت و دشوار آخرت را پسِ پشت خود می‌افکنند. [[«یَذَرُونَ»: رها می‌سازند. ترک می‌گویند. «وَرَآءَهُمْ»: پشت سر خود. مقابل و جلو خود (نگا: المصحف المیسّر). «ثَقِیلاً»: سخت و پر دردسر. دشوار و ناگوار. مراد قیامت است.]]"
          ],
          "fa.khorramshahi": [
            "بی‌گمان اینان بهره [زودیاب‌] دنیوی را دوست دارند و روزی سنگین را که در پیش دارند، رها می‌کنند"
          ],
          "fa.makarem": [
            "آنها زندگی زودگذر دنیا را دوست دارند، در حالی که روز سختی را پشت سر خود رها می‌کنند!"
          ],
          "fa.moezzi": [
            "همانا اینان دوست دارند شتابان را و بگذارند پشت سر خویش روزی سنگین را"
          ],
          "fa.mojtabavi": [
            "همانا اينان اين [دنياى‌] شتابان و زودگذر را دوست مى‌دارند و روزى گران- يعنى رستاخيز- را پشت سرشان مى‌افكنند- فراموش مى‌كنند-."
          ],
          "fa.sadeqi": [
            "اینان همواره (دنیای) شتابانِ زودگذر را دوست دارند و روزی گرانبار را (به غفلت) پشت (سر) می‌افکنند."
          ]
        }
      },
      {
        "index": 5619,
        "local_index": 28,
        "part_type": "Verse",
        "path": "/books/quran:76:28",
        "text": [
          "نَحْنُ‌ خَلَقْنَاهُمْ‌ وَ شَدَدْنَا أَسْرَهُمْ‌ وَ إِذَا شِئْنَا بَدَّلْنَا أَمْثَالَهُمْ‌ تَبْدِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "We created them and fixed their bones and joints; and We could replace them when We like with others like them."
          ],
          "en.ahmedraza": [
            "It is We Who created them, and strengthened their skeleton; and We can replace them with others like them, whenever We will."
          ],
          "en.arberry": [
            "We created them, and We strengthened their joints; and, when We will, We shall exchange their likes."
          ],
          "en.daryabadi": [
            "It it We Who creared them and made them firm of make. And whenever We list, We can replace them with others like Unto them."
          ],
          "en.hilali": [
            "It is We Who created them, and We have made them of strong built. And when We will, We can replace them with others like them with a complete replacement."
          ],
          "en.itani": [
            "We created them, and strengthened their frame; and whenever We will, We can replace them with others like them."
          ],
          "en.maududi": [
            "We created them and strengthened their joints; and whenever We wish, We can change their faces entirely."
          ],
          "en.mubarakpuri": [
            "It is We Who created them, and We have made them of strong build. And when We will, We can replace them with others like them with a complete replacement."
          ],
          "en.pickthall": [
            "We, even We, created them, and strengthened their frame. And when We will, We can replace them, bringing others like them in their stead."
          ],
          "en.qarai": [
            "We created them and strengthened their joints, and We will replace them with others like them whenever We like."
          ],
          "en.qaribullah": [
            "We created them, and We strengthened their joints, but, when We will, We shall indeed exchange their likes."
          ],
          "en.sahih": [
            "We have created them and strengthened their forms, and when We will, We can change their likenesses with [complete] alteration."
          ],
          "en.sarwar": [
            "We have created them and have given them strength. Had We wanted, We could have replaced them with another people like them."
          ],
          "en.shakir": [
            "We created them and made firm their make, and when We please We will bring in their place the likes of them by a change."
          ],
          "en.transliteration": [
            "Na<u>h</u>nu khalaqn<u>a</u>hum washadadn<u>a</u> asrahum wai<u>tha</u> shin<u>a</u> baddaln<u>a</u> amth<u>a</u>lahum tabdeel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "It was We who created them and made their constitution strong, but if We wish we can replace them with others like them."
          ],
          "en.yusufali": [
            "It is We Who created them, and We have made their joints strong; but, when We will, We can substitute the like of them by a complete change."
          ],
          "fa.ansarian": [
            "ما آنان را آفریدیم و مفاصلشان را [با رشته های اعصاب و عضلات] محکم و استوار کردیم، و هرگاه بخواهیم [آنان را نابود می کنیم و] امثال و نظایرشان را [که مطیع و فرمانبردارند] به جای آنان قرار می دهیم."
          ],
          "fa.ayati": [
            "ما آدميان را آفريديم و اعضا و مفاصلشان را نيرومند گردانيديم و اگر خواهيم، به جاى آنها قومى همانندشان بياوريم."
          ],
          "fa.bahrampour": [
            "ما آنها را آفريديم و بندبندشان را استوار كرديم، و هر وقت بخواهيم [آنها را مى‌بريم و] به راحتى امثالشان را جايگزين مى‌كنيم"
          ],
          "fa.fooladvand": [
            "ماييم كه آنان را آفريده و پيوند مفاصل آنها را استوار كرده‌ايم، و چون بخواهيم، [آنان را] به نظايرشان تبديل مى‌كنيم."
          ],
          "fa.ghomshei": [
            "ما اینان را آفریدیم و محکم بنیان ساختیم و هرگاه بخواهیم همه را فانی ساخته و مانندشان قوم دیگر خلق می‌کنیم."
          ],
          "fa.khorramdel": [
            "ما ایشان را آفریده‌ایم و بندها و پیوندهای اندامشان را سفت بهم بسته و استوار داشته‌ایم، و هر وقت بخواهیم (ایشان را نابود می‌کنیم و) انسانهای دیگری را جایگزین آنان می‌سازیم. [[«أَسْرَ»: مفصل. بند. پیوند. ساختمان بدن. ترکیب بند تن. یا مراد رباط و اعصاب است که ریسمان و طناب بدن و وسیله ارتباط اندامها بشمارند. «بَدَّلْنَآ أَمْثَالَهُمْ تَبْدِیلاً»: (نگا: توبه / 39، محمّد / 38، واقعه / 61).]]"
          ],
          "fa.khorramshahi": [
            "ما آنان را آفریده‌ایم و پیوندشان را استوار داشته‌ایم، و چون خواهیم آنان را به همانندانشان جانشین می‌سازیم‌"
          ],
          "fa.makarem": [
            "ما آنها را آفریدیم و پیوندهای وجودشان را محکم کردیم، و هر زمان بخواهیم جای آنان را به گروه دیگری می‌دهیم!"
          ],
          "fa.moezzi": [
            "ما آفریدیمشان و استوار ساختیم آفرینش ایشان را و هر گاه خواهیم تبدیل کنیم بمانندگان ایشان تبدیلی‌"
          ],
          "fa.mojtabavi": [
            "ما ايشان را آفريديم و آفرينش- يا بندهاى اندامهاى- آنان را استوار ساختيم، و هر گاه بخواهيم به جاى آنها مانندشان را بياوريم آوردنى- كه از آن ناتوان نيستيم-."
          ],
          "fa.sadeqi": [
            "ما آنان را آفریده و پیوند (مفاصل) آنها را استوار کردیم و هنگامی که بخواهیم، آنان را به مانندهاشان تبدیل می‌کنیم."
          ]
        }
      },
      {
        "index": 5620,
        "local_index": 29,
        "part_type": "Verse",
        "path": "/books/quran:76:29",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:108:88",
            "/books/al-kafi:1:4:108:91"
          ]
        },
        "text": [
          "إِنَ‌ هٰذِهِ‌ تَذْکِرَةٌ فَمَنْ‌ شَاءَ اتَّخَذَ إِلَى‌ رَبِّهِ‌ سَبِيلاً"
        ],
        "translations": {
          "en.ahmedali": [
            "This surely is a reminder: Therefore whosoever desires may take the way to his Lord."
          ],
          "en.ahmedraza": [
            "This is indeed an advice; so whoever wishes may take the path towards his Lord."
          ],
          "en.arberry": [
            "Surely this is a Reminder; so he who will, takes unto his Lord a way."
          ],
          "en.daryabadi": [
            "Verily this is an admonition; then whosoever Will, may choose a way Unto his Lord."
          ],
          "en.hilali": [
            "Verily! This (Verses of the Quran) is an admonition, so whosoever wills, let him take a Path to his Lord (Allah)."
          ],
          "en.itani": [
            "This is a reminder; so whoever wills, let him take a path to his Lord."
          ],
          "en.maududi": [
            "Verily this is an Exhortation; so let him who so will take a way to his Lord."
          ],
          "en.mubarakpuri": [
            "Verily, this is an admonition, so whosoever wills, let him take a path to his Lord."
          ],
          "en.pickthall": [
            "Lo! this is an Admonishment, that whosoever will may choose a way unto his Lord."
          ],
          "en.qarai": [
            "This is indeed a reminder. So let anyone who wishes take the way toward his Lord."
          ],
          "en.qaribullah": [
            "This is indeed a Reminder, so that he who will, takes a path to his Lord."
          ],
          "en.sahih": [
            "Indeed, this is a reminder, so he who wills may take to his Lord a way."
          ],
          "en.sarwar": [
            "This chapter is a reminder. Let those who want, seek guidance from their Lord."
          ],
          "en.shakir": [
            "Surely this is a reminder, so whoever pleases takes to his Lord a way."
          ],
          "en.transliteration": [
            "Inna h<u>ath</u>ihi ta<u>th</u>kiratun faman sh<u>a</u>a ittakha<u>th</u>a il<u>a</u> rabbihi sabeel<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "This is a reminder. Let whoever wishes, take the right path to his Lord."
          ],
          "en.yusufali": [
            "This is an admonition: Whosoever will, let him take a (straight) Path to his Lord."
          ],
          "fa.ansarian": [
            "همانا این [آیات قرآن] تذکر و هشداری است؛ پس هر کس بخواهد راهی به سوی پروردگارش [با تکیه بر این آیات] برگزیند،"
          ],
          "fa.ayati": [
            "اين اندرزى است. پس هر كه خواهد، راهى به سوى پروردگار خويش برگزيند."
          ],
          "fa.bahrampour": [
            "مسلما اين [آيات‌] تذكارى است، پس هر كه خواهد راهى به سوى پروردگار خود در پيش گيرد"
          ],
          "fa.fooladvand": [
            "اين [آيات،] پندنامه‌اى است. تا هر كه خواهد، راهى به سوى پروردگار خود پيش گيرد."
          ],
          "fa.ghomshei": [
            "این آیات پند و تذکری است، پس هر که (سعادت و حسن عاقبت) بخواهد راهی به سوی خدای خود پیش گیرد."
          ],
          "fa.khorramdel": [
            "این (آیه‌ها) اندرز و یادآوری (برای جهانیان) است، و هرکس که بخواهد (می‌تواند با استفاده از آن) راهی به سوی پروردگارش برگزیند، (راهی که او را به آمرزش و بهشت خدا می‌رساند). [[«هذِهِ»: این آیات پیشین. «تَذْکِرَةٌ»: (نگا: طه / 3، واقعه / 73، حاقّه / 12 و 48). «إِتَّخَذَ إِلی رَبِّهِ سَبِیلاً»: (نگا: نساء / 137، فرقان / 57، مزّمّل / 19).]]"
          ],
          "fa.khorramshahi": [
            "این پندآموزی است، پس هر کس که خواهد راهی به سوی پروردگارش در پیش گیرد"
          ],
          "fa.makarem": [
            "این یک تذکر و یادآوری است، و هر کس بخواهد (با استفاده از آن) راهی به سوی پروردگارش برمی‌گزیند!"
          ],
          "fa.moezzi": [
            "همانا این است یادآوریی تا هر که خواهد برگیرد بسوی پروردگار خویش راهی را"
          ],
          "fa.mojtabavi": [
            "همانا اين- آيات قرآن يا اين سوره- يادآورى و پند است، پس هر كه خواهد به سوى پروردگار خويش راهى فرا گيرد."
          ],
          "fa.sadeqi": [
            "بی‌گمان این (آیات) یادواره‌ای است. پس هر کس بخواهد، راهی سوی پروردگارش برگیرد."
          ]
        }
      },
      {
        "index": 5621,
        "local_index": 30,
        "part_type": "Verse",
        "path": "/books/quran:76:30",
        "text": [
          "وَ مَا تَشَاءُونَ‌ إِلاَّ أَنْ‌ يَشَاءَ اللَّهُ‌ إِنَ‌ اللَّهَ‌ کَانَ‌ عَلِيماً حَکِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "But you will not desire except as God wills. Verily He is all-knowing and all-wise."
          ],
          "en.ahmedraza": [
            "And what will you wish, except if Allah wills; indeed Allah is All Knowing, Wise."
          ],
          "en.arberry": [
            "But you will not unless God wills; surely God is ever All-knowing, All-wise."
          ],
          "en.daryabadi": [
            "And ye will not, unless Allah willeth. Verily Allah is ever Knowing, Wise.'"
          ],
          "en.hilali": [
            "But you cannot will, unless Allah wills. Verily, Allah is Ever All-Knowing, All-Wise."
          ],
          "en.itani": [
            "Yet you cannot will, unless God wills. God is Knowing and Wise."
          ],
          "en.maududi": [
            "But your willing shall be of no avail until Allah Himself so wills. Surely Allah is All-Knowing, Most Wise."
          ],
          "en.mubarakpuri": [
            "But you cannot will, unless Allah wills. Verily, Allah is Ever All-Knowing, All-Wise."
          ],
          "en.pickthall": [
            "Yet ye will not, unless Allah willeth. Lo! Allah is Knower, Wise."
          ],
          "en.qarai": [
            "But you will not wish unless it is willed by Allah. Indeed Allah is all-knowing, all-wise."
          ],
          "en.qaribullah": [
            "Yet you will not unless Allah wills; surely, Allah is the Knower, the Wise."
          ],
          "en.sahih": [
            "And you do not will except that Allah wills. Indeed, Allah is ever Knowing and Wise."
          ],
          "en.sarwar": [
            "(The virtuous mentioned in this chapter) want only what God wants. God is All-knowing and All-wise."
          ],
          "en.shakir": [
            "And you do not please except that Allah please, surely Allah is Knowing, Wise;"
          ],
          "en.transliteration": [
            "Wam<u>a</u> tash<u>a</u>oona ill<u>a</u> an yash<u>a</u>a All<u>a</u>hu inna All<u>a</u>ha k<u>a</u>na AAaleeman <u>h</u>akeem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "But you cannot will it unless God wills [to show you that way] -- God is indeed all-knowing and wise --"
          ],
          "en.yusufali": [
            "But ye will not, except as Allah wills; for Allah is full of Knowledge and Wisdom."
          ],
          "fa.ansarian": [
            "و تا خدا نخواهد، نخواهید خواست؛ یقیناً خدا همواره دانا و حکیم است."
          ],
          "fa.ayati": [
            "و شما جز آن نمى‌خواهيد كه خدا خواسته باشد، زيرا خدا دانا و حكيم است."
          ],
          "fa.bahrampour": [
            "و [اين را] نمى‌خواهيد مگر آن كه خدا بخواهد، قطعا خدا داناى حكيم است"
          ],
          "fa.fooladvand": [
            "و تا خدا نخواهد، [شما] نخواهيد خواست؛ قطعاً خدا داناى حكيم است."
          ],
          "fa.ghomshei": [
            "و شما (کافران، راه حق را) نمی‌خواهید مگر خدای بخواهد (و به قهر شما را به این راه بدارد)، که البته خدا دانا و به صلاح بندگان آگاه است."
          ],
          "fa.khorramdel": [
            "شما نمی‌توانید بخواهید، مگر این که خدا بخواهد. بی‌گمان خداوند بس آگاه و کاربجا است. [[«مَآ تَشَآءُونَ إِلّآ أَن یَشَآءَ اللهُ»: مراد این است که از خواستنتان چیزی ساخته نیست، تا وقتی که خدا نخواسته باشد. یعنی اراده کردن و خواستن وظیفه انسان است و در برابرش سزا و جزا می‌بیند، و توفیق دادن و نتیجه بخشیدن در دست خدا است، و خدا قادر مطلق است. خلاصه، مشیّت بندگان در گرو مشیّت خدا است، یا به عبارت دیگر: حرکت کار بندگان، و برکت کار یزدان است. مثلاً به هنگام گرسنگی، نان خوردن کار انسان و سیر کردن کار خدا است. در وقت بیماری، دوا خوردن کار آفریدگان و شفا دادن کار خدای سبحان است.]]"
          ],
          "fa.khorramshahi": [
            "و [چنین چیزی‌] نخواهید مگر آنکه خدا خواهد، بی‌گمان خداوند دانای فرزانه است‌"
          ],
          "fa.makarem": [
            "و شما هیچ چیز را نمی‌خواهید مگر اینکه خدا بخواهد، خداوند دانا و حکیم بوده و هست!"
          ],
          "fa.moezzi": [
            "و نخواهید جز آنکه خواهد خدا همانا بوده است خدا دانشمند حکیم‌"
          ],
          "fa.mojtabavi": [
            "و شما نمى‌خواهيد مگر آنكه خداى بخواهد. همانا خداوند دانا و با حكمت است."
          ],
          "fa.sadeqi": [
            "و تا خدا نخواهد، (شما) نخواهید خواست‌؛ همواره خدا بسیار دانای حکیم بوده است."
          ]
        }
      },
      {
        "index": 5622,
        "local_index": 31,
        "part_type": "Verse",
        "path": "/books/quran:76:31",
        "relations": {
          "Mentioned In": [
            "/books/al-kafi:1:4:108:88",
            "/books/al-kafi:1:4:108:91"
          ]
        },
        "text": [
          "يُدْخِلُ‌ مَنْ‌ يَشَاءُ فِي‌ رَحْمَتِهِ‌ وَ الظَّالِمِينَ‌ أَعَدَّ لَهُمْ‌ عَذَاباً أَلِيماً"
        ],
        "translations": {
          "en.ahmedali": [
            "He admits whosoever He will to His benevolence. But for the evil-doers He has prepared a painful punishment."
          ],
          "en.ahmedraza": [
            "He admits into His mercy, whomever He wills; and for the unjust He has kept prepared a painful punishment."
          ],
          "en.arberry": [
            "For He admits into His mercy whomsoever He will; as for the evildoers, He has prepared for them a painful chastisement."
          ],
          "en.daryabadi": [
            "He maketh whomsoever He listeth to enter His mercy. And the wrong-doers! for them He hath gotten ready a torment afflective."
          ],
          "en.hilali": [
            "He will admit to His Mercy whom He will and as for the Zalimun, (polytheists, wrong-doers, etc.) He has prepared a painful torment."
          ],
          "en.itani": [
            "He admits into His mercy whomever He wills. But as for the wrongdoers, He has prepared for them a painful punishment."
          ],
          "en.maududi": [
            "He admits to His Mercy whomsoever He pleases. As for the wrong-doers, He has prepared for them a grievous chastisement."
          ],
          "en.mubarakpuri": [
            "He will admit to His mercy whom He wills and as for the wrongdoers -- He has prepared a painful torment."
          ],
          "en.pickthall": [
            "He maketh whom He will to enter His mercy, and for evil-doers hath prepared a painful doom."
          ],
          "en.qarai": [
            "He admits whomever He wishes into His mercy, and He has prepared a painful punishment for the wrongdoers."
          ],
          "en.qaribullah": [
            "He is Merciful to whom He will; but, for the harmdoers He has prepared for them a painful punishment."
          ],
          "en.sahih": [
            "He admits whom He wills into His mercy; but the wrongdoers - He has prepared for them a painful punishment."
          ],
          "en.sarwar": [
            "He admits to His mercy whomever He wants. For the unjust He has prepared a painful punishment."
          ],
          "en.shakir": [
            "He makes whom He pleases to enter into His mercy; and (as for) the unjust, He has prepared for them a painful chastisement."
          ],
          "en.transliteration": [
            "Yudkhilu man yash<u>a</u>o fee ra<u>h</u>matihi wa<b>al</b><i><u>thth</u></i><u>a</u>limeena aAAadda lahum AAa<u>tha</u>ban aleem<u>a</u><b>n</b>"
          ],
          "en.wahiduddin": [
            "He admits whoever He will into His grace and has prepared a painful punishment for the evil doers."
          ],
          "en.yusufali": [
            "He will admit to His Mercy whom He will; But the wrong-doers,- for them has He prepared a grievous Penalty."
          ],
          "fa.ansarian": [
            "هر کس را بخواهد در رحمتش درآورد و برای ستمکاران عذابی دردناک آماده کرده است."
          ],
          "fa.ayati": [
            "هر كس را كه بخواهد مشمول رحمت خود سازد، و براى ستمكاران عذابى دردآور آماده كرده است."
          ],
          "fa.bahrampour": [
            "هر كه را خواهد به رحمت خويش درمى‌آورد و براى ظالمان عذابى دردناك آماده كرده است"
          ],
          "fa.fooladvand": [
            "هر كه را خواهد، به رحمت خويش در مى‌آورد، و براى ظالمان عذابى پردرد آماده كرده است."
          ],
          "fa.ghomshei": [
            "هر که را بخواهد در (بهشت) رحمت خود داخل گرداند و برای ستمکاران عالم عذاب دردناک مهیّا ساخته است."
          ],
          "fa.khorramdel": [
            "خداوند هرکس را بخواهد (مشمول رحمت خود می‌سازد و) به بهشت خویش داخل می‌گرداند، ولی برای ستمکاران عذاب دردناکی را فراهم ساخته است. [[«الظَّالِمِینَ»: مفعولٌ‌به فعل محذوفی است که فعل ملفوظ مابعدش، آن را بیان می‌دارد. «رَحْمَتِهِ»: رحمت او. مراد بهشت خدا است.]]"
          ],
          "fa.khorramshahi": [
            "هر کس را که خواهد به جوار رحمت خویش در آورد، و برای ستمکاران [مشرک‌] عذابی دردناک آماده ساخته است‌"
          ],
          "fa.makarem": [
            "و هر کس را بخواهد (و شایسته بداند) در رحمت (وسیع) خود وارد می‌کند، و برای ظالمان عذاب دردناکی آماده ساخته است!"
          ],
          "fa.moezzi": [
            "درآرد هر که را خواهد به رحمت خویش و ستمگران را آماده ساخت برای ایشان عذابی دردناک‌"
          ],
          "fa.mojtabavi": [
            "هر كه را خواهد در مهر و بخشايش خويش درآرد و ستمكاران را عذابى دردناك آماده ساخته است."
          ],
          "fa.sadeqi": [
            "هر که را بخواهد، در رحمت خویش در آورد، و برای ظالمان عذابی پردرد آماده کرده است."
          ]
        }
      }
    ]
  },
  "index": "quran:76",
  "kind": "verse_list"
}