{"data": {"crumbs": [{"indexed_titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}, "path": "/books/quran", "titles": {"ar": "القرآن الكريم", "en": "The Holy Quran"}}, {"indexed_titles": {"en": "Chapter 98"}, "path": "/books/quran:98", "titles": {"ar": "البينة", "en": "The Evidence", "ent": "Al-Bayyina"}}], "default_verse_translation_ids": {"en": "en.qarai", "fa": "fa.makarem"}, "index": 98, "local_index": 98, "order": 100, "part_type": "Chapter", "path": "/books/quran:98", "reveal_type": "Medinan", "rukus": 1, "titles": {"ar": "البينة", "en": "The Evidence", "ent": "Al-Bayyina"}, "verse_count": 8, "verse_start_index": 6130, "verse_translations": [{"id": "fa.ansarian", "lang": "fa", "name": "Hussain Ansarian"}, {"id": "fa.ayati", "lang": "fa", "name": "AbdolMohammad Ayati"}, {"id": "fa.bahrampour", "lang": "fa", "name": "Abolfazl Bahrampour"}, {"id": "fa.fooladvand", "lang": "fa", "name": "Mohammad Mahdi Fooladvand"}, {"id": "fa.ghomshei", "lang": "fa", "name": "Mahdi Elahi Ghomshei"}, {"id": "fa.khorramdel", "lang": "fa", "name": "Mostafa Khorramdel"}, {"id": "fa.khorramshahi", "lang": "fa", "name": "Baha'oddin Khorramshahi"}, {"id": "fa.makarem", "lang": "fa", "name": "Naser Makarem Shirazi"}, {"id": "fa.moezzi", "lang": "fa", "name": "Mohammad Kazem Moezzi"}, {"id": "fa.mojtabavi", "lang": "fa", "name": "Sayyed Jalaloddin Mojtabavi"}, {"id": "fa.sadeqi", "lang": "fa", "name": "Mohammad Sadeqi Tehrani"}, {"id": "en.ahmedali", "lang": "en", "name": "Ahmed Ali"}, {"id": "en.ahmedraza", "lang": "en", "name": "Ahmed Raza Khan"}, {"id": "en.arberry", "lang": "en", "name": "A. J. Arberry"}, {"id": "en.daryabadi", "lang": "en", "name": "Abdul Majid Daryabadi"}, {"id": "en.hilali", "lang": "en", "name": "Muhammad Taqi-ud-Din al-Hilali and Muhammad Muhsin Khan"}, {"id": "en.itani", "lang": "en", "name": "Talal Itani"}, {"id": "en.maududi", "lang": "en", "name": "Abul Ala Maududi"}, {"id": "en.mubarakpuri", "lang": "en", "name": "Safi-ur-Rahman al-Mubarakpuri"}, {"id": "en.pickthall", "lang": "en", "name": "Mohammed Marmaduke William Pickthall"}, {"id": "en.qarai", "lang": "en", "name": "Ali Quli Qarai"}, {"id": "en.qaribullah", "lang": "en", "name": "Hasan al-Fatih Qaribullah and Ahmad Darwish"}, {"id": "en.sahih", "lang": "en", "name": "Saheeh International"}, {"id": "en.sarwar", "lang": "en", "name": "Muhammad Sarwar"}, {"id": "en.shakir", "lang": "en", "name": "Mohammad Habib Shakir"}, {"id": "en.transliteration", "lang": "en", "name": "English Transliteration"}, {"id": "en.wahiduddin", "lang": "en", "name": "Wahiduddin Khan"}, {"id": "en.yusufali", "lang": "en", "name": "Abdullah Yusuf Ali"}], "verses": [{"index": 6131, "local_index": 1, "part_type": "Verse", "path": "/books/quran:98:1", "text": ["لَمْ‌ يَکُنِ‌ الَّذِينَ‌ کَفَرُوا مِنْ‌ أَهْلِ‌ الْکِتَابِ‌ وَ الْمُشْرِکِينَ‌ مُنْفَکِّينَ‌ حَتَّى‌ تَأْتِيَهُمُ‌ الْبَيِّنَةُ"], "translations": {"en.ahmedali": ["THOSE AMONG THE people of the Book who disbelieve, and the idolaters, would not have been freed (from false beliefs) until the clear proof came to them --"], "en.ahmedraza": ["The disbelieving People of the Book(s) and the polytheists would not have left their religion until the clear proof came to them."], "en.arberry": ["The unbelievers of the People of the Book and the idolaters would never leave off; till the Clear Sign came to them,"], "en.daryabadi": ["Those who disbelieved from among the People of the Book and the associaters could not break off, until there had come Unto them the evidence."], "en.hilali": ["Those who disbelieve from among the people of the Scripture (Jews and Christians) and among Al-Mushrikun, were not going to leave (their disbelief) until there came to them clear evidence."], "en.itani": ["Those who disbelieved among the People of the Scripture, and the Polytheists, were not apart, until the Clear Evidence came to them."], "en.maududi": ["Those who disbelieved – be they from the People of the Book or from those who associated others with Allah in His Divinity – will not desist from unbelief until the Clear Proof should come to them;"], "en.mubarakpuri": ["Those who disbelieve from among the People of the Scripture and the idolators, were not going to leave until there came to them the Bayyinah."], "en.pickthall": ["Those who disbelieve among the People of the Scripture and the idolaters could not have left off (erring) till the clear proof came unto them,"], "en.qarai": ["The faithless from among the People of the Book and the polytheists were not set apart [from the community of the faithful] until the proof had come to them:"], "en.qaribullah": ["The unbelievers among the People of the Book and the idolaters would never desist until the Clear Proof came to them."], "en.sahih": ["Those who disbelieved among the People of the Scripture and the polytheists were not to be parted [from misbelief] until there came to them clear evidence -"], "en.sarwar": ["The disbelievers among the People of the Book and the pagans disbelieved (in Islam) only after receiving divine testimony:"], "en.shakir": ["Those who disbelieved from among the followers of the Book and the polytheists could not have separated (from the faithful) until there had come to them the clear evidence:"], "en.transliteration": ["Lam yakuni alla<u>th</u>eena kafaroo min ahli alkit<u>a</u>bi wa<b>a</b>lmushrikeena munfakkeena <u>h</u>att<u>a</u> tatiyahumu albayyina<b>tu</b>"], "en.wahiduddin": ["The deniers of truth from among the People of the Book and the polytheists would not desist from disbelief until they received clear evidence --"], "en.yusufali": ["Those who reject (Truth), among the People of the Book and among the Polytheists, were not going to depart (from their ways) until there should come to them Clear Evidence,-"], "fa.ansarian": ["کافران از اهل کتاب و مشرکان [از آیین خود] جدا نمی شدند تا آن دلیل روشن برای آنان بیاید."], "fa.ayati": ["كافران اهل كتاب و مشركان دست برندارند تا برايشان برهانى روشن بيايد:"], "fa.bahrampour": ["كافران اهل كتاب و مشركان [از آيين خود] دست بردار نبودند تا اين كه دليل روشنى برايشان بيايد"], "fa.fooladvand": ["كافران اهل كتاب و مشركان، دست‌بردار نبودند تا دليلى آشكار بر ايشان آيد:"], "fa.ghomshei": ["کافران اهل کتاب و مشرکان (از کفر و عصیان) منفک نبودند (و به راه صواب هدایت نمی‌یافتند) تا آنکه برهان و حجت حق بر آنها بیاید."], "fa.khorramdel": ["کافران اهل کتاب، و مشرکان، تا زمانی که حجّت بدیشان نرسد (و برابر سنّت الهی با آنان اتمام حجّت نگردد) به حال خود رها نمی‌شوند. [[«الَّذِینَ کَفَرُوا مِنْ أَهْلِ الْکِتَابِ»: مراد همه کسانی است که از پیروان انبیاء بوده ولیکن بر اثر فاصله زیاد زمانی از آئین آسمانی منحرف شده‌اند و به کفر و شرک افتاده‌اند. واژه (مِنْ) برای بیان است. «الْمُشْرِکِینَ»: مراد همه کسانی است که بت یا آتش و مانند اینها را پرستیده‌اند و کتاب الهی هم نداشته‌اند. «مُنفَکِّینَ»: به حال خود رهاشدگان (نگا: المصحف المیسّر). یعنی کسانی که خدا پیغمبری برای ایشان نفرستاده باشد و به سوی حق و حقیقت رهنمودشان نکرده باشد. «حَتّی تَأْتِیَهُمُ الْبَیِّنَةُ»: تا زمانی که حجّت بدیشان برسد. مگر این که حجّت بدیشان برسد. یعنی حتماً خدا پیغمبری را برای آنان می‌فرستد و بدین وسیله با ایشان اتمام حجّت می‌کند (نگا: طه / 133 و 134). «الْبَیِّنَةُ»: حجّت و برهان. در اینجا مراد پیغمبری از پیغمبرانی است که مشعل آئین آسمانی را فرا راه کاروان بشری می‌دارد (نگا: المصحف المیسّر. پرتوی از قرآن).]]"], "fa.khorramshahi": ["کافران از میان اهل کتاب و مشرکان، دست بردار نبودند، تا آنکه برایشان حجت هویدا آمد"], "fa.makarem": ["کافران از اهل کتاب و مشرکان (می‌گفتند:) دست از آیین خود برنمی‌دارند تا دلیل روشنی برای آنها بیاید،"], "fa.moezzi": ["نبودند آنان که کفر ورزیدند از اهل کتاب و مشرکان دست بردارندگان تا بیایدشان نشانی‌"], "fa.mojtabavi": ["كسانى از اهل كتاب- جهودان و ترسايان- و مشركان كه [اكنون به اسلام‌] كافر شدند، [از آيين خود] جدا نمى‌شدند- باز نمى‌ايستادند- تا آن حجت روشن- پيامبر"], "fa.sadeqi": ["کافران -از اهل کتاب و مشرکان‌- (از انحراف‌شان) دست‌بردار نبودند تا ایشان را حجتی آشکار آید."]}}, {"index": 6132, "local_index": 2, "part_type": "Verse", "path": "/books/quran:98:2", "text": ["رَسُولٌ‌ مِنَ‌ اللَّهِ‌ يَتْلُو صُحُفاً مُطَهَّرَةً"], "translations": {"en.ahmedali": ["An Apostle from God, reading out hallowed pages"], "en.ahmedraza": ["(The clear proof is) the Noble Messenger from Allah, who reads the pure pages."], "en.arberry": ["a Messenger from God, reciting pages purified,"], "en.daryabadi": ["An apostle from Allah rehearsing Writs cleansed."], "en.hilali": ["A Messenger (Muhammad (Peace be upon him)) from Allah, reciting (the Quran) purified pages [purified from Al-Batil (falsehood, etc.)]."], "en.itani": ["A messenger from God reciting purified scripts."], "en.maududi": ["a Messenger from Allah, reciting from Purified Scrolls;"], "en.mubarakpuri": ["A Messenger from Allah reciting purified pages."], "en.pickthall": ["A messenger from Allah, reading purified pages"], "en.qarai": ["an apostle from Allah reciting impeccable scriptures,"], "en.qaribullah": ["A Messenger from Allah reciting Purified Pages"], "en.sahih": ["A Messenger from Allah, reciting purified scriptures"], "en.sarwar": ["a Messenger (Muhammad) from God, reciting to them parts of the purified,"], "en.shakir": ["An apostle from Allah, reciting pure pages,"], "en.transliteration": ["Rasoolun mina All<u>a</u>hi yatloo <u>s</u>u<u>h</u>ufan mu<u>t</u>ahhara<b>tan</b>"], "en.wahiduddin": ["a messenger from God, reciting to them pure scriptures,"], "en.yusufali": ["An messenger from Allah, rehearsing scriptures kept pure and holy:"], "fa.ansarian": ["[آن دلیل روشن] فرستاده ای [چون پیامبر اسلام] از سوی خداست که صحیفه هایی پاک را می خواند."], "fa.ayati": ["پيامبرى از جانب خدا كه صحيفه‌هاى پاك را مى‌خواند."], "fa.bahrampour": ["پيامبرى از جانب خدا كه صحيفه‌هاى پاكى را بر آنها بخواند"], "fa.fooladvand": ["فرستاده‌اى از جانب خدا كه [بر آنان‌] صحيفه‌هايى پاك را تلاوت كند،"], "fa.ghomshei": ["رسولی از جانب خدا (چون محمّد صلّی اللّه علیه و آله و سلّم) که کتب آسمانی پاک و منزه (از خطا و تحریف) را بر آنها تلاوت کند."], "fa.khorramdel": ["(و آن حجّت)، پیغمبری از سوی خدا است که کتابهای پاک (الهی) را (بر آنان) می‌خواند (و قوانین و احکام آسمانی را بدیشان می‌رساند). [[«یَتْلُو»: می‌خواند. در رسم‌الخطّ قرآنی، الف زائدی در آخر دارد. «صُحُفاً»: جمع صحیفه. اوراق. کتابها (نگا: طه / 133، عبس / 13). «مُطَهَّرَةً»: پاک از باطل و تحریف.]]"], "fa.khorramshahi": ["پیامبری از سوی خداوند که بر آنان صحیفه‌های پاک [آسمانی‌] می‌خواند"], "fa.makarem": ["پیامبری از سوی خدا (بیاید) که صحیفه‌های پاکی را (بر آنها) بخواند،"], "fa.moezzi": ["فرستاده‌ای از خدا که خواند نامه‌هائی پاک شده‌"], "fa.mojtabavi": ["فرستاده‌اى از خداى كه نامه‌هايى پاك- پاره‌هايى از قرآن- را بر آنان مى‌خواند،"], "fa.sadeqi": ["فرستاده‌ای از جانب خدا که بر آنان صحیفه‌هایی بسی پاک شده‌ی [:وحیانی] را تلاوت کند."]}}, {"index": 6133, "local_index": 3, "part_type": "Verse", "path": "/books/quran:98:3", "text": ["فِيهَا کُتُبٌ‌ قَيِّمَةٌ"], "translations": {"en.ahmedali": ["Containing firm decrees."], "en.ahmedraza": ["In which are written proper affairs."], "en.arberry": ["therein true Books."], "en.daryabadi": ["Wherein are discourses eternal."], "en.hilali": ["Containing correct and straight laws from Allah."], "en.itani": ["In them are valuable writings."], "en.maududi": ["in writings wherein are scriptures, absolutely true and unerring."], "en.mubarakpuri": ["Wherein are upright Books."], "en.pickthall": ["Containing correct scriptures."], "en.qarai": ["wherein are upright writings."], "en.qaribullah": ["in which there are valuable Books."], "en.sahih": ["Within which are correct writings."], "en.sarwar": ["holy Book which contain eternal laws of guidance."], "en.shakir": ["Wherein are all the right ordinances."], "en.transliteration": ["Feeh<u>a</u> kutubun qayyima<b>tun</b>"], "en.wahiduddin": ["containing upright precepts."], "en.yusufali": ["Wherein are laws (or decrees) right and straight."], "fa.ansarian": ["در آنها نوشته هایی استوار و باارزش است؛"], "fa.ayati": ["در آنها نوشته‌هايى است راست و درست."], "fa.bahrampour": ["كه در آن، نوشته‌هاى صحيح و استوارى است [اما ايمان نياوردند]"], "fa.fooladvand": ["كه در آنها نوشته‌هاى استوار است."], "fa.ghomshei": ["که در آن کتب نامه‌های حقیقت و راستی (و نگهبان سنّت عدل الهی) مسطور است."], "fa.khorramdel": ["در آنها نوشته‌های راست و درست و پرارزش و والائی است. [[«کُتُبٌ»: جمع کِتاب. به معنی مکتوب، نوشته‌ها (نگا: انبیاء / 104). «قَیِّمَةٌ»: درست. پرارزش (نگا: توبه / 36، یوسف / 40، کهف / 2).]]"], "fa.khorramshahi": ["که در آنها نوشته‌های استواری هست‌"], "fa.makarem": ["و در آن نوشته‌های صحیح و پرارزشی باشد! (ولی هنگامی که آمد ایمان نیاوردند، مانند اهل کتاب)."], "fa.moezzi": ["در آنها است نوشته‌هائی استوار"], "fa.mojtabavi": ["كه در آنها نوشته‌هايى است راست و درست."], "fa.sadeqi": ["در آنها نوشته‌هایی استوار، پای‌برجا و پر بهاست."]}}, {"index": 6134, "local_index": 4, "part_type": "Verse", "path": "/books/quran:98:4", "text": ["وَ مَا تَفَرَّقَ‌ الَّذِينَ‌ أُوتُوا الْکِتَابَ‌ إِلاَّ مِنْ‌ بَعْدِ مَا جَاءَتْهُمُ‌ الْبَيِّنَةُ"], "translations": {"en.ahmedali": ["The people of the Book were not divided among themselves till after the clear proof had come to them."], "en.ahmedraza": ["Nor did the People of the Book(s) get divided until after the clear proof came to them."], "en.arberry": ["And they scattered not, those that were given the Book, excepting after the Clear Sign came to them."], "en.daryabadi": ["And those who are vouchsafed the Book divided not save after there had come Unto them the evidence."], "en.hilali": ["And the people of the Scripture (Jews and Christians) differed not until after there came to them clear evidence. (i.e. Prophet Muhammad (Peace be upon him) and whatever was revealed to him)."], "en.itani": ["Those who were given the Scripture did not splinter, except after the Clear Evidence came to them."], "en.maududi": ["Nor did those to whom the Book had been given split up until after the Proof (of the Right Way) had come to them."], "en.mubarakpuri": ["And the People of the Scripture differed not until after there came to them the Bayyinah."], "en.pickthall": ["Nor were the People of the Scripture divided until after the clear proof came unto them."], "en.qarai": ["Those who were given the Book did not divide except after the proof had come to them."], "en.qaribullah": ["Those to whom the Book was given did not divide themselves until the Clear Proof came to them."], "en.sahih": ["Nor did those who were given the Scripture become divided until after there had come to them clear evidence."], "en.sarwar": ["Nor did the People of the Book disagreed among themselves until after receiving the ancient divine testaments."], "en.shakir": ["And those who were given the Book did not become divided except after clear evidence had come to them."], "en.transliteration": ["Wam<u>a</u> tafarraqa alla<u>th</u>eena ootoo alkit<u>a</u>ba ill<u>a</u> min baAAdi m<u>a</u> j<u>a</u>athumu albayyina<b>tu</b>"], "en.wahiduddin": ["Those who were given the Book did not become divided except after clear evidence was given to them."], "en.yusufali": ["Nor did the People of the Book make schisms, until after there came to them Clear Evidence."], "fa.ansarian": ["و اهل کتاب درباره دین، [گروه گروه و] پراکنده نشدند مگر پس از آنکه آن دلیل روشن برای آنان آمد [و به طور کامل نسبت به آنان اتمام حجت شد.]"], "fa.ayati": ["و اهل كتاب پراكنده نشدند مگر از آن پس كه برايشان برهانى روشن آمد."], "fa.bahrampour": ["ولى اهل كتاب پراكنده نشدند مگر پس از آن كه اين دليل روشن برايشان آمد [كه پيامبر و قرآن است‌]"], "fa.fooladvand": ["و اهل كتاب دستخوش پراكندگى نشدند، مگر پس از آنكه برهان آشكار براى آنان آمد."], "fa.ghomshei": ["و اهل کتاب (در حق این رسول گرامی) راه تفرقه و خلاف نپیمودند مگر پس از آنکه آنها را حجت کامل (در کتب آسمانی بر حقانیت رسول) آمد (و دانسته بر انکار او لجاج و عناد ورزیدند)."], "fa.khorramdel": ["اهل کتاب پراکنده نشده‌اند (و گروه گروه و دسته دسته نگشته‌اند) مگر آن زمانی که پیغمبری به پیش ایشان آمده است (و دستورات خدا را بدیشان رسانده است. آن وقت کم‌کم دچار تفرّق و اختلاف شده‌اند و فروع و مذاهبی را در دین خدا پدیدار کرده‌اند). [[«مَا تَفَرَّقَ ...»: (نگا: بقره / 213 و 253، آل‌عمران / 19، یونس / 93، شوری / 13 - 15). مراد این است که هر وقت پیغمبری از پیغمبران برای رهنمود مردمان آمده است، انقلابی در میان انسانها پدیدار کرده است. خاصیت انقلاب هم جداسازی صف‌های حقگرایان و باطلگرایان، و پدیدآوردن دسته‌ها و گروههای مختلف مؤمنان و منافقان و دشمنان هدف انقلاب است. در میان مؤمنان به انقلاب هم به تدریج خطها پدیدار می‌شود که تنها خطی از آنها در راستای آرمان راستین است و بس. انسان عاقل باید سعی کند که دنباله‌رو آن خط بوده و جان و مال را بر سر آن نهد.]]"], "fa.khorramshahi": ["و اهل کتاب تفرقه پیشه نکردند، مگر بعد از آنکه برایشان حجت هویدا آمد"], "fa.makarem": ["اهل کتاب (نیز در دین خدا) اختلاف نکردند مگر بعد از آنکه دلیل روشن برای آنان آمد!"], "fa.moezzi": ["و پراکنده نشدند آنان که داده شدند کتاب را مگر پس از آنکه بیامدشان نشانی‌"], "fa.mojtabavi": ["و كسانى كه به آنها كتاب داده شده- جهودان و ترسايان- پراكنده نشدند- اختلاف نكردند- مگر پس از آنكه ايشان را حجت روشن- پيامبر و قرآن- آمد."], "fa.sadeqi": ["و اهل کتاب دستخوش پراکندگی نشدند، مگر پس از آنکه ایشان را (برهان) آشکار آمد."]}}, {"index": 6135, "local_index": 5, "part_type": "Verse", "path": "/books/quran:98:5", "text": ["وَ مَا أُمِرُوا إِلاَّ لِيَعْبُدُوا اللَّهَ‌ مُخْلِصِينَ‌ لَهُ‌ الدِّينَ‌ حُنَفَاءَ وَ يُقِيمُوا الصَّلاَةَ وَ يُؤْتُوا الزَّکَاةَ وَ ذٰلِکَ‌ دِينُ‌ الْقَيِّمَةِ"], "translations": {"en.ahmedali": ["They were commanded only to serve God with all-exclusive faith in Him, to be upright, and to fulfil their devotional obligations, and to give zakat; for this is the even way."], "en.ahmedraza": ["And they were ordered only to worship Allah, believing purely in Him – devoted solely (to Him), and to establish the prayer and to pay the obligatory charity – and this is the straight religion."], "en.arberry": ["They were commanded only to serve God, making the religion His sincerely, men of pure faith, and to perform the prayer, and pay the alms -- that is the religion of the True."], "en.daryabadi": ["And they were commanded not but that they should worship Allah, keeping religion pure for him, as upright men, and that they should establish prayer and give the poor-rate, And that is the right religion."], "en.hilali": ["And they were commanded not, but that they should worship Allah, and worship none but Him Alone (abstaining from ascribing partners to Him), and perform As-Salat (Iqamat-as-Salat) and give Zakat: and that is the right religion."], "en.itani": ["They were commanded only to worship God, devoting their faith to Him alone, and to practice regular prayer, and to give alms. That is the upright religion."], "en.maududi": ["Yet all that they had been commanded was that they serve Allah, with utter sincerity, devoting themselves exclusively to Him, and that they establish Prayer and pay Zakah. That is the Right Faith."], "en.mubarakpuri": ["And they were commanded not, but that they should worship Allah, making religion purely for Him alone, Hunafa', and that they perform Salah and give Zakah, and that is the right religion."], "en.pickthall": ["And they are ordered naught else than to serve Allah, keeping religion pure for Him, as men by nature upright, and to establish worship and to pay the poor-due. That is true religion."], "en.qarai": ["Though they were not commanded except to worship Allah, dedicating their faith to Him as men of pure faith, and to maintain the prayer and pay the zakat. That is the upright religion."], "en.qaribullah": ["Yet they were ordered to worship Allah alone, making the Religion His sincerely, upright, and to establish their prayers and to pay the obligatory charity. That is indeed the Religion of Straightness."], "en.sahih": ["And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth, and to establish prayer and to give zakah. And that is the correct religion."], "en.sarwar": ["They were only commanded to worship God, be uprightly devoted to His religion, steadfast in prayer and pay the zakat. This is truly the eternal religion."], "en.shakir": ["And they were not enjoined anything except that they should serve Allah, being sincere to Him in obedience, upright, and keep up prayer and pay the poor-rate, and that is the right religion."], "en.transliteration": ["Wam<u>a</u> omiroo ill<u>a</u> liyaAAbudoo All<u>a</u>ha mukhli<u>s</u>eena lahu a<b>l</b>ddeena <u>h</u>unaf<u>a</u>a wayuqeemoo a<b>l</b><u>ss</u>al<u>a</u>ta wayutoo a<b>l</b>zzak<u>a</u>ta wa<u>tha</u>lika deenu alqayyima<b>ti</b>"], "en.wahiduddin": ["They were commanded only to worship God, offering Him sincere devotion, to be sincere in their faith, to pray regularly; and to give alms, for that is the right religion."], "en.yusufali": ["And they have been commanded no more than this: To worship Allah, offering Him sincere devotion, being true (in faith); to establish regular prayer; and to practise regular charity; and that is the Religion Right and Straight."], "fa.ansarian": ["در حالی که فرمان نیافته بودند جز آنکه خدا را بپرستند، و ایمان و عبادت را برای او از هرگونه شرکی خالص کنند، و حق گرا باشند، و نماز را برپا دارند، و زکات بپردازند؛ و این است آیین استوار و ثابت."], "fa.ayati": ["و آنان را جز اين فرمان ندادند كه خدا را بپرستند در حالى كه در دين او اخلاص مى‌ورزند. و نماز گزارند و زكات دهند. اين است دين درست و راست."], "fa.bahrampour": ["و آنها دستور نداشتند جز اين كه خداى يگانه را بپرستند و دين را ويژه‌ى او كنند و موحّد باشند و نماز را بر پا دارند و زكات دهند و اين است دين پايدار"], "fa.fooladvand": ["و فرمان نيافته بودند جز اينكه خدا را بپرستند، و در حالى كه به توحيد گراييده‌اند، دين [خود] را براى او خالص گردانند، و نماز برپا دارند و زكات بدهند، و دين [ثابت و] پايدار همين است."], "fa.ghomshei": ["در صورتی که (در کتب آسمانی) امر نشده بودند مگر بر اینکه خدا را به اخلاص کامل در دین (اسلام) پرستش کنند و از غیر دین حق روی بگردانند و نماز به پا دارند و زکات (به فقیران) بدهند. این است دین درست."], "fa.khorramdel": ["در حالی که جز این بدیشان دستور داده نشده است که مخلصانه و حقگرایانه خدای را بپرستند و تنها شریعت او را آئین (خود) بدانند، و نماز را چنان که باید بخوانند، و زکات را (به تمام و کمال) بپردازند. آئین راستین و ارزشمند این است و بس. [[«وَ مَآ أُمِرُوا إِلاّ لِیَعْبُدُوا اللهَ»: حرف واو، حالیّه است. حرف (لِ) به معنی (أَنْ) است، و تقدیر چنین است: إِلاّ بِأَنْ یَعْبُدُوا اللهَ. «مُخْلِصِینَ»: مخلصانه (نگا: اعراف / 29، یونس / 22، عنکبوت / 65). «حُنَفَآءَ»: حقگرایانه (نگا: حجّ / 31). «مُخْلِصِینَ ... حُنَفَآءَ»: حال اوّل و دوم ضمیر فاعلی (و) هستند. «دِینُ الْقَیِّمَةِ»: آئین راست و درست. دین ارزشمند. اضافه موصوف به صفت است. مانند مسجدالجامع، مسجدالحرام، دارالآخره (نگا: یوسف / 109، نحل / 30)، عذاب الحریق (نگا: آل‌عمران / 181، انفال / 50). ذکر (ه) برای مبالغه است (نگا: روح‌البیان. روح‌المعانی).]]"], "fa.khorramshahi": ["و جز این فرمان نیافته بودند که خداوند را بپرستند و پاکدینانه دین خود را برای او خالص دارند، و نماز را بر پا دارند و زکات را بپردازند، و این دین استوار است‌"], "fa.makarem": ["و به آنها دستوری داده نشده بود جز اینکه خدا را بپرستند در حالی که دین خود را برای او خالص کنند و از شرک به توحید بازگردند، نماز را برپا دارند و زکات را بپردازند؛ و این است آیین مستقیم و پایدار!"], "fa.moezzi": ["و فرموده نشدند مگر آنکه بپرستند خدا را پاک‌دارندگان برای او دین را یکتاپرستان و بپای دارند نماز را و بدهند زکات را و این است دین استوار"], "fa.mojtabavi": ["و آنان را جز اين نفرموده بودند كه خداى را بپرستند در حالى كه دين را ويژه او كنند و حق‌گراى باشند و نماز را برپا دارند و زكات بدهند، و اين است آيين [آن نوشته‌هاى‌] راست و استوار- يا: اين است دين راست و استوار-."], "fa.sadeqi": ["و فرمان نیافتند جز اینکه خدا را بپرستند، حال آنکه دین (خود) را برای او خالص‌کننده‌اند (و) از غیر خدا رویگرداننده‌اند و نماز را بر پا بدارند و زکات را بدهند. و دین استوار، پربها و پایدار همین است."]}}, {"index": 6136, "local_index": 6, "part_type": "Verse", "path": "/books/quran:98:6", "text": ["إِنَ‌ الَّذِينَ‌ کَفَرُوا مِنْ‌ أَهْلِ‌ الْکِتَابِ‌ وَ الْمُشْرِکِينَ‌ فِي‌ نَارِ جَهَنَّمَ‌ خَالِدِينَ‌ فِيهَا أُولٰئِکَ‌ هُمْ‌ شَرُّ الْبَرِيَّةِ"], "translations": {"en.ahmedali": ["Surely the unbelievers among the people of the Book and the idolaters, will abide in the fire of Hell. They are the worst of creatures."], "en.ahmedraza": ["Indeed all disbelievers, the People of the Book(s) and the polytheists, are in the fire of hell – they will remain in it for ever; it is they who are the worst among the creation."], "en.arberry": ["The unbelievers of the People of the Book and the idolaters shall be in the Fire of Gehenna, therein dwelling forever; those are the worst of creatures."], "en.daryabadi": ["Verily those who disbelieve from among the people of the Book and the associaters shall be cast into the Hell-fire, as abiders therein. These! they are the worst of the creation."], "en.hilali": ["Verily, those who disbelieve (in the religion of Islam, the Quran and Prophet Muhammad (Peace be upon him)) from among the people of the Scripture (Jews and Christians) and Al-Mushrikun will abide in the Fire of Hell. They are the worst of creatures."], "en.itani": ["Those who disbelieve among the People of the Scripture, and the Polytheists, will be in the Fire of Hell, where they will abide forever. These are the worst of creatures."], "en.maududi": ["Those who disbelieved – be they from among the People of the Book or among those who associated others with Allah in His Divinity– shall be in the Fire, and will abide in it. They are the worst of creatures."], "en.mubarakpuri": ["Verily, those who disbelieve from among the People of the Scripture and idolators, will abide in the fire of Hell. They are the worst of creatures."], "en.pickthall": ["Lo! those who disbelieve, among the People of the Scripture and the idolaters, will abide in fire of hell. They are the worst of created beings."], "en.qarai": ["Indeed the faithless from among the People of the Book and the polytheists will be in the fire of hell, to remain in it [forever]. It is they who are the worst of creatures."], "en.qaribullah": ["The unbelievers among the People of the Book and the idolaters shall be for ever in the Fire of Gehenna (Hell). They are the worst of all creatures."], "en.sahih": ["Indeed, they who disbelieved among the People of the Scripture and the polytheists will be in the fire of Hell, abiding eternally therein. Those are the worst of creatures."], "en.sarwar": ["The disbelievers among the People of the Book and the pagans will dwell forever in hell; they are the worst of all creatures."], "en.shakir": ["Surely those who disbelieve from among the followers of the Book and the polytheists shall be in the fire of hell, abiding therein; they are the worst of men."], "en.transliteration": ["Inna alla<u>th</u>eena kafaroo min ahli alkit<u>a</u>bi wa<b>a</b>lmushrikeena fee n<u>a</u>ri jahannama kh<u>a</u>lideena feeh<u>a</u> ol<u>a</u>ika hum sharru albariyya<b>ti</b>"], "en.wahiduddin": ["Those of the deniers of truth among the People of the Book and the polytheists will dwell forever in Hell-fire. They are the worst of creatures."], "en.yusufali": ["Those who reject (Truth), among the People of the Book and among the Polytheists, will be in Hell-Fire, to dwell therein (for aye). They are the worst of creatures."], "fa.ansarian": ["به یقین کافرانِ از اهل کتاب و مشرکان در آتش دوزخ اند و در آن جاودانه اند؛ اینانند که بدترین مخلوقاتند."], "fa.ayati": ["از اهل كتاب، آنها كه كافرند و نيز مشركان، در آتش جهنمند و در آن همواره خواهند بود. اينان بدترين آفريدگانند."], "fa.bahrampour": ["بى‌ترديد كسانى از اهل كتاب كه كافر شدند و مشركان، براى هميشه در آتش دوزخند و آنها بدترين آفريدگانند"], "fa.fooladvand": ["كسانى از اهل كتاب كه كفر ورزيده‌اند و [نيز] مشركان در آتش دوزخند، [و] در آن همواره مى‌مانند؛ اينانند كه بدترين آفريدگانند."], "fa.ghomshei": ["محقّقا آنان که از اهل کتاب کافر شدند (و عیسی و عزیر و رهبانان و احبار را به مقام ربوبیت خواندند) آنها با مشرکان همه در آتش دوزخند و در آن همیشه معذبند، آنها به حقیقت بدترین خلقند."], "fa.khorramdel": ["مسلّماً کافرانِ اهل کتاب، و مشرکان، جاودانه در میان آتش دوزخ خواهند ماند! آنان بدون شک بدترین انسانها هستند. [[«الَّذِینَ کَفَرُوا ... الْمُشْرِکِینَ»: مراد کافران اهل کتاب و مشرکان سراسر تاریخ بشریّت است. «شَرُّ»: بدترین. «الْبَرِیَّةِ»: انسانها.]]"], "fa.khorramshahi": ["کافران از میان اهل کتاب و مشرکان در آتش جهنمند، و جاودانه در آنند، اینانند که خود بدترین آفریدگانند"], "fa.makarem": ["کافران از اهل کتاب و مشرکان در آتش دوزخند، جاودانه در آن می‌مانند؛ آنها بدترین مخلوقاتند!"], "fa.moezzi": ["همانا آنان که کفر ورزیدند از اهل کتاب و مشرکان در آتش دوزخند جاودانان در آن آنانند بدترین جهانیان‌"], "fa.mojtabavi": ["همانا كافران اهل كتاب و مشركان در آتش دوزخ جاويدانند، اينانند بدترين آفريدگان."], "fa.sadeqi": ["بی‌امان کسانی از اهل کتاب که کفر ورزیده‌اند -و (نیز) مشرکان - در آتش دوزخند، حال آنکه در آن ماندگارند؛ اینانند، (هم)ایشان بدترین آفریدگان."]}}, {"index": 6137, "local_index": 7, "part_type": "Verse", "path": "/books/quran:98:7", "text": ["إِنَ‌ الَّذِينَ‌ آمَنُوا وَ عَمِلُوا الصَّالِحَاتِ‌ أُولٰئِکَ‌ هُمْ‌ خَيْرُ الْبَرِيَّةِ"], "translations": {"en.ahmedali": ["But those who believe and do the right are surely the best of created beings,"], "en.ahmedraza": ["Indeed those who accepted faith and did good deeds – it is they who are the best among the creation."], "en.arberry": ["But those who believe, and do righteous deeds, those are the best of creatures;"], "en.daryabadi": ["Verily those who believe and work righteous works - these! they are the best of the creation."], "en.hilali": ["Verily, those who believe [in the Oneness of Allah, and in His Messenger Muhammad (Peace be upon him)) including all obligations ordered by Islam] and do righteous good deeds, they are the best of creatures."], "en.itani": ["As for those who believe and lead a righteous life—these are the best of creatures."], "en.maududi": ["But those that believe and work righteous deeds, they are the best of creatures."], "en.mubarakpuri": ["Verily, those who believe and do righteous good deeds, they are the best of creatures."], "en.pickthall": ["(And) lo! those who believe and do good works are the best of created beings."], "en.qarai": ["Indeed those who have faith and do righteous deeds—it is they who are the best of creatures."], "en.qaribullah": ["But those who believe and do good deeds are the best of all creatures."], "en.sahih": ["Indeed, they who have believed and done righteous deeds - those are the best of creatures."], "en.sarwar": ["The righteously striving believers are the best of all creatures."], "en.shakir": ["(As for) those who believe and do good, surely they are the -best of men."], "en.transliteration": ["Inna alla<u>th</u>eena <u>a</u>manoo waAAamiloo a<b>l</b><u>ssa</u>li<u>ha</u>ti ol<u>a</u>ika hum khayru albariyya<b>ti</b>"], "en.wahiduddin": ["Truly, those who believe and do good works are the best of creatures."], "en.yusufali": ["Those who have faith and do righteous deeds,- they are the best of creatures."], "fa.ansarian": ["مسلماً کسانی که ایمان آورده و کارهای شایسته انجام داده اند، اینانند که بهترین مخلوقاتند."], "fa.ayati": ["كسانى كه ايمان آورده‌اند و كارهاى شايسته مى‌كنند بهترين آفريدگانند."], "fa.bahrampour": ["البته كسانى كه ايمان آورده و اعمال شايسته كردند، آنهايند كه بهترين آفريدگانند"], "fa.fooladvand": ["در حقيقت كسانى كه گرويده و كارهاى شايسته كرده‌اند، آنانند كه بهترين آفريدگانند."], "fa.ghomshei": ["آنان که ایمان آوردند و نیکوکار شدند آنها به حقیقت بهترین اهل عالمند."], "fa.khorramdel": ["بی‌گمان کسانی که مؤمنند و کارهای شایسته و بایسته می‌کنند، آنان مسلّماً خوبترین انسانها هستند. [[«خَیْرُ»: بهترین. خوبترین. مراد ایمانداران پرهیزگار و نیکوکار سراسر تاریخ بشریّت است.]]"], "fa.khorramshahi": ["کسانی که ایمان آورده‌اند و کارهای شایسته کرده‌اند، اینانند که خود بهترین آفریدگانند"], "fa.makarem": ["(امّا) کسانی که ایمان آوردند و اعمال صالح انجام دادند، بهترین مخلوقات (خدا) یند!"], "fa.moezzi": ["همانا آنان که ایمان آوردند و کردار شایسته کردند آنانند بهترین جهانیان‌"], "fa.mojtabavi": ["همانا كسانى كه ايمان آوردند و كارهاى نيك و شايسته كردند، ايشانند بهترين آفريدگان."], "fa.sadeqi": ["بی‌گمان کسانی که ایمان آورده و کارهای شایسته‌ی (ایمان) کردند، اینان، (هم)ایشان بهترین آفریدگانند."]}}, {"index": 6138, "local_index": 8, "part_type": "Verse", "path": "/books/quran:98:8", "text": ["جَزَاؤُهُمْ‌ عِنْدَ رَبِّهِمْ‌ جَنَّاتُ‌ عَدْنٍ‌ تَجْرِي‌ مِنْ‌ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ‌ فِيهَا أَبَداً رَضِيَ‌ اللَّهُ‌ عَنْهُمْ‌ وَ رَضُوا عَنْهُ‌ ذٰلِکَ‌ لِمَنْ‌ خَشِيَ‌ رَبَّهُ‌"], "translations": {"en.ahmedali": ["Whose reward is with their Lord -- gardens of Eden with rivers flowing by, where they will abide for ever, God pleased with their service, they with obedience to Him. This (awaits) him who stands in awe of his Lord."], "en.ahmedraza": ["Their reward is – with their Lord – everlasting Gardens of Eden beneath which rivers flow, in which they will abide for ever and ever; Allah is pleased with them and they are pleased with Him; this is for one who fears his Lord."], "en.arberry": ["their recompense is with their Lord-Gardens of Eden, underneath which rivers flow, therein dwelling for ever and ever. God is well-pleased with them, and they are well-pleased with Him; that is for him who fears his Lord."], "en.daryabadi": ["Their recompense with their Lord shall be Gardens Everlasting, whereunder rivers flow - as abiders therein for evermore. Well-pleases will be Allah with them and well-pleased will be they with Him, That is for him who feareth his Lord."], "en.hilali": ["Their reward with their Lord is 'Adn (Eden) Paradise (Gardens of Eternity), underneath which rivers flow, they will abide therein forever, Allah Well-Pleased with them, and they with Him. That is for him who fears his Lord."], "en.itani": ["Their reward is with their Lord: Gardens of Eternity beneath which rivers flow, where they will abide forever. God is pleased with them, and they are pleased with Him. That is for whoever fears His Lord."], "en.maududi": ["Their recompense lies with their Lord: Gardens of eternity beneath which rivers flow; therein they shall dwell, forever and ever. Allah is well-pleased with them, and they are well-pleased with Him. All this is for him who fears his Lord."], "en.mubarakpuri": ["Their reward with their Lord is Eternal Gardens, underneath which rivers flow. They will abide therein forever, Allah will be pleased with them, and they well-pleased with Him. That is for him who fears his Lord."], "en.pickthall": ["Their reward is with their Lord: Gardens of Eden underneath which rivers flow, wherein they dwell for ever. Allah hath pleasure in them and they have pleasure in Him. This is (in store) for him who feareth his Lord."], "en.qarai": ["Their reward, near their Lord, is the Gardens of Eden, with streams running in them, to remain in them forever. Allah is pleased with them, and they are pleased with Him. That is for those who fear their Lord."], "en.qaribullah": ["Their recompense is with their Lord; Gardens of Eden, underneath which rivers flow, where they shall live for ever. Allah is wellpleased with them, and theyare wellpleased with Him. That is for he who fears his Lord!"], "en.sahih": ["Their reward with Allah will be gardens of perpetual residence beneath which rivers flow, wherein they will abide forever, Allah being pleased with them and they with Him. That is for whoever has feared his Lord."], "en.sarwar": ["Their reward from their Lord will be the gardens of Eden wherein streams flow and wherein they will live forever. God will be pleased with them and they will be pleased with Him. This (reward) is for those who fear their Lord."], "en.shakir": ["Their reward with their Lord is gardens of perpetuity beneath which rivers flow, abiding therein for ever; Allah is well pleased with them and they are well pleased with Him; that is for him who fears his Lord."], "en.transliteration": ["Jaz<u>a</u>ohum AAinda rabbihim jann<u>a</u>tu AAadnin tajree min ta<u>h</u>tih<u>a</u> alanh<u>a</u>ru kh<u>a</u>lideena feeh<u>a</u> abadan ra<u>d</u>iya All<u>a</u>hu AAanhum wara<u>d</u>oo AAanhu <u>tha</u>lika liman khashiya rabbah<b>u</b>"], "en.wahiduddin": ["God has a reward in store for them: Gardens of eternity, through which rivers flow; they will dwell therein forever. God is well pleased with them and they are well pleased with Him. Thus shall the God-fearing be rewarded."], "en.yusufali": ["Their reward is with Allah: Gardens of Eternity, beneath which rivers flow; they will dwell therein for ever; Allah well pleased with them, and they with Him: all this for such as fear their Lord and Cherisher."], "fa.ansarian": ["پاداششان نزد پروردگارشان بهشت های پاینده ای است که از زیرِ [درختانِ] آن نهرها جاری است، در آنها جاودانه اند، خدا از آنان خشنود است و آنان هم از خدا خشنودند؛ این [پاداش] برای کسی است که از پروردگارش بترسد."], "fa.ayati": ["پاداششان در نزد پروردگارشان بهشتهايى است جاويد كه در آن نهرها جارى است. تا ابد در آنجايند. خدا از آنها خشنود است و آنها از خدا خشنودند. و اين خاص كسى است كه از پروردگارش بترسد."], "fa.bahrampour": ["پاداش آنها نزد پروردگارشان بهشت‌هاى پاينده‌اى است كه از پاى درختانش نهرها جارى است و تا ابد در آن بمانند، هم خدا از آنها خشنود است و هم آنها از خدا خشنود، اين [مقام والا] براى كسى است كه از پروردگار خود پروا كند"], "fa.fooladvand": ["پاداش آنان نزد پروردگارشان باغهاى هميشگى است كه از زير [درختان‌] آن، نهرها روان است، جاودانه در آن «همى» مانند؛ خدا از آنان خشنود است و [آنان نيز] از او خشنود، اين [پاداش‌] براى كسى است كه از پروردگارش بترسد."], "fa.ghomshei": ["پاداش آنها نزد خدایشان باغهای بهشت عدن است که نهرها زیر درختانش جاری است و در آن بهشت ابد جاودان متنعّمند، خدا از آنها خشنود و آنها هم از خدا خشنودند. این بهشت مخصوص کسی است که از خدا ترسد (و به طاعت او پردازد)."], "fa.khorramdel": ["پاداش آنان در پیشگاه پروردگارشان باغهای بهشتی است که جای ماندگاری است و رودبارها در زیر (کاخها و درختهای) آن روان است. جاودانه برای همیشه در آنجا خواهند ماند. خدا از ایشان راضی و ایشان هم از خدا خوشنودند! این (همه نعمت و خوشی) از آنِ کسی خواهد بود که از پروردگار خویش بهراسد. [[«عَدْنٍ»: اقامت. ماندن (نگا: توبه / 72، رعد / 23، نحل / 31). «رَضِیَ اللهُ ...»: رضایت خدا به خاطر فرمانبرداری و نیکوکاری مؤمنان از خدا، در حقیقت رضایت از اجر و پاداش و انعام و الطاف بی‌حدّ و حصر خدا است که بسی بالاتر از خیال و دورتر از انتظار ایشان است.]]"], "fa.khorramshahi": ["پاداش آنان در نزد پروردگارشان بهشتهای عدن است که جویباران از فرودست آن جاری است، و جاودانه در آنند، خداوند از ایشان خشنود است و آنان هم از او خشنودند، این از آن کسی است که از پروردگارش بترسد"], "fa.makarem": ["پاداش آنها نزد پروردگارشان باغهای بهشت جاویدان است که نهرها از زیر درختانش جاری است؛ همیشه در آن می‌مانند! (هم) خدا از آنها خشنود است و (هم) آنها از خدا خشنودند؛ و این (مقام والا) برای کسی است که از پروردگارش بترسد!"], "fa.moezzi": ["پاداششان نزد پروردگارشان بهشتهای جاودانی است که روان است از زیر آنها جویها جاودانان در آنها همیشه خشنود شد خدا از ایشان و خشنود شدند از او این برای آن است که بترسد از پروردگارش‌"], "fa.mojtabavi": ["پاداش ايشان نزد پروردگارشان بهشتهايى پاينده است كه از زير آنها جويها روان است، در آنجا هميشه جاودانه باشند خداى از آنان خشنود است و آنان از خدا خشنودند اين [پاداش‌] براى كسى است كه از پروردگار خود بترسد."], "fa.sadeqi": ["پاداششان نزد پروردگارشان باغ‌هایی (با درختان) سردرهم جاودان است، که از زیر (درختان)شان، نهرها روان است. جاودانه و بی‌پایان در آن همی می‌مانند. خدا از آنان خشنود است و (آنان نیز) از او خشنودند. این (پاداش) برای کسی است که دلباخته‌ی پروردگارش بوده با بزرگ‌داشتش (از او) بهراسد."]}}]}, "index": "quran:98", "kind": "verse_list"}