{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:3:5:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب فَرْضِ الزَّكَاةِ</span> وَ مَا يَجِبُ فِي الْمَالِ مِنَ الْحُقُوقِ",
          "en": "Chapter 1 – The Obligation of Zakāt, and what is Obligated in the wealth, from the rights"
        }
      }
    ],
    "index": 771,
    "local_index": 1,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:3:5:2",
        "titles": {
          "ar": "باب مَنْعِ الزَّكَاةِ",
          "en": "Chapter 2 – Prevention of the Zakāt"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:1",
    "titles": {
      "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب فَرْضِ الزَّكَاةِ</span> وَ مَا يَجِبُ فِي الْمَالِ مِنَ الْحُقُوقِ",
      "en": "Chapter 1 – The Obligation of Zakāt, and what is Obligated in the wealth, from the rights"
    },
    "verse_count": 19,
    "verse_start_index": 5687,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/5)"
        ],
        "index": 5688,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:1",
        "refs": {
          "Quran": [
            "/books/quran:9:60"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ أَنَّهُمَا قَالَا لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَ رَأَيْتَ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ إِنَّمَا الصَّدَقاتُ لِلْفُقَراءِ وَ الْمَساكِينِ وَ الْعامِلِينَ عَلَيْها وَ الْمُؤَلَّفَةِ قُلُوبُهُمْ وَ فِي الرِّقابِ وَ الْغارِمِينَ وَ فِي سَبِيلِ اللَّهِ وَ ابْنِ السَّبِيلِ فَرِيضَةً مِنَ اللَّهِ أَ كُلُّ هَؤُلَاءِ يُعْطَى وَ إِنْ كَانَ لَا يَعْرِفُ فَقَالَ إِنَّ الْإِمَامَ يُعْطِي هَؤُلَاءِ جَمِيعاً لِأَنَّهُمْ يُقِرُّونَ لَهُ بِالطَّاعَةِ",
          "قَالَ قُلْتُ فَإِنْ كَانُوا لَا يَعْرِفُونَ فَقَالَ يَا زُرَارَةُ لَوْ كَانَ يُعْطِي مَنْ يَعْرِفُ دُونَ مَنْ لَا يَعْرِفُ لَمْ يُوجَدْ لَهَا مَوْضِعٌ وَ إِنَّمَا يُعْطِي مَنْ لَا يَعْرِفُ لِيَرْغَبَ فِي الدِّينِ فَيَثْبُتَ عَلَيْهِ فَأَمَّا الْيَوْمَ فَلَا تُعْطِهَا أَنْتَ وَ أَصْحَابُكَ إِلَّا مَنْ يَعْرِفُ فَمَنْ وَجَدْتَ مِنْ هَؤُلَاءِ الْمُسْلِمِينَ عَارِفاً فَأَعْطِهِ دُونَ النَّاسِ",
          "ثُمَّ قَالَ سَهْمُ الْمُؤَلَّفَةِ قُلُوبُهُمْ وَ سَهْمُ الرِّقَابِ عَامٌّ وَ الْبَاقِي خَاصٌّ ",
          "قَالَ قُلْتُ فَإِنْ لَمْ يُوجَدُوا قَالَ لَا تَكُونُ فَرِيضَةٌ فَرَضَهَا اللَّهُ عَزَّ وَ جَلَّ لَا يُوجَدُ لَهَا أَهْلٌ",
          "قَالَ قُلْتُ فَإِنْ لَمْ تَسَعْهُمُ الصَّدَقَاتُ فَقَالَ إِنَّ اللَّهَ فَرَضَ لِلْفُقَرَاءِ فِي مَالِ الْأَغْنِيَاءِ مَا يَسَعُهُمْ وَ لَوْ عَلِمَ أَنَّ ذَلِكَ لَا يَسَعُهُمْ لَزَادَهُمْ إِنَّهُمْ لَمْ يُؤْتَوْا مِنْ قِبَلِ فَرِيضَةِ اللَّهِ وَ لَكِنْ أُتُوا مِنْ مَنْعِ مَنْ مَنَعَهُمْ حَقَّهُمْ لَا مِمَّا فَرَضَ اللَّهُ لَهُمْ وَ لَوْ أَنَّ النَّاسَ أَدَّوْا حُقُوقَهُمْ لَكَانُوا عَائِشِينَ بِخَيْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Zurara and Muhammad Bin Muslim, ",
            "who both said to Abu Abdullah<sup>asws</sup>, ‘What is your<sup>asws</sup> view of the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h60\">[9:60]</a> But rather, the charities are only for the poor and the needy, and the officials (appointed) over them, and those whose hearts are made to incline (to Truth) and the (ransoming of) captives and those in debts and in the Way of Allah and the wayfarer; an Ordinance from Allah</span>, would all of them be given it and even to one who does not recognise (the Wilayah)?’ So he<sup>asws</sup> said: ‘The Imam<sup>asws</sup> would give to all of them, altogether, because they are acknowledging him<sup>asws</sup> with the obedience’.",
            "He (the narrator) said, ‘I said, ‘Supposing they are not recognising (the Wilayah)?’ So he<sup>asws</sup> said: ‘Were he<sup>asws</sup> to give to the ones who do recognise (the Wilayah) besides the ones who do not recognise, he<sup>asws</sup> would not find a place for it, and rather he<sup>asws</sup> would give to the one who does not recognise (the Wilayah), for him to incline in the Religion, so he would be steadfast upon it. But, as for today, so you should not give it, you and your companions, except to the ‘one’ who does recognise (the Wilayah). So the one whom you find from these Muslims having recognised (the Wilayah), so give to him, among the rest (of people)’. ",
            "Then he<sup>asws</sup> said: ‘The share of those whose hearts incline (towards the Wilayah), and the share of the slaves, are of a general nature, and the remainder are specific’. ",
            "He (the narrator) said, ‘I said, ‘Supposing one cannot find them?’ He<sup>asws</sup> said: ‘It cannot happen that an Obligation which Allah<sup>azwj</sup> Mighty and Majestic has Obligated, a deserving one cannot be found for it’.",
            "He (the narrator) said, ‘I said, ‘Supposing the charities are insufficient for them?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Obligated for the poor, in the wealth of the rich, what would suffice them, and had He<sup>azwj</sup> Known that it would not suffice the, He<sup>azwj</sup> would have Increased it for them. It (poverty) did not come to them from the direction of the Obligation of Allah<sup>azwj</sup>, but they are deficient due to the one who prevents their rights (to be given to them), not from what Allah<sup>azwj</sup> has Obligated for them; and had the people paid their rights, they (the poor) would all be living a good life’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Zurarah and Muhammad ibn Muslim who has said the following: “Once we both asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, most Majestic, most Glorious, in the following verse of the Holy Quran. ‘Charity funds (zakat) are only for the poor, the destitute, and the tax collectors. (It is also for the) people whose hearts are inclined (toward Islam), the slaves, those who cannot pay their debts, for the cause of Allah, and for those who have become needy on a journey. Paying zakat is an obligation that Allah has decreed. Allah is All-knowing and All-wise. ’<a href=\"/#/books/quran:9#h60\">[9:60]</a> ‘Can all the people and cases mentioned in this verse receive zakat even though they may not believe (in Divine Authority of ’A’immah)?’ He replied, ‘The Imam gives charity to all of them; they announce their obedience to him.’ I (the narrator) then asked, ‘Even if they do not acknowledge (his Divine Authority)?’ He then said, ‘O Zurarah, were he to give charity only to those who acknowledge (his Divine Authority) and not to others, there would remain no one or cases as recipient of (zakat) charity. He gives charity to those who do not acknowledge (his divine authority) so they incline to religion to become strong (in faith). However, today you and your friends give zakat only to those who acknowledge (our Divine Authority) if you find one who believes (in our Divine Authority).’ He then said, ‘The share of those who show interest in Islam and the share of slaves to be emancipated are of general nature and other shares in a charity are for certain people but not for everyone.’ I (the narrator) then asked, ‘What happens if there is no recipient of zakat?’ He replied, ‘Allah, the Most Majestic, the Most Glorious, has not made any charity compulsory without any recipient.’ I (the narrator) then asked, ‘What happens if charity is not enough?’ He replied, ‘The amount of compulsory charity Allah has sanctioned in the properties of affluent people for the poor ones is enough. If He knew that it is not enough, He would sanction a greater amount. Shortages do not come from the amount Allah has made compulsory but it comes from non-payment. There are those who do not pay what belongs to the needy, thus, shortages are not due to the degree of Allah’s sanctioned charity for the needy. Had people paid the rights of the needy, they would have lived happy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/6)"
        ],
        "index": 5689,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:2",
        "refs": {
          "Quran": [
            "/books/quran:9:103"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَمَّا أُنْزِلَتْ آيَةُ الزَّكَاةِ خُذْ مِنْ أَمْوالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَ تُزَكِّيهِمْ بِها وَ أُنْزِلَتْ فِي شَهْرِ رَمَضَانَ فَأَمَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مُنَادِيَهُ فَنَادَى فِي النَّاسِ أَنَّ اللَّهَ فَرَضَ عَلَيْكُمُ الزَّكَاةَ كَمَا فَرَضَ عَلَيْكُمُ الصَّلَاةَ ",
          "فَفَرَضَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِمْ مِنَ الذَّهَبِ وَ الْفِضَّةِ وَ فَرَضَ الصَّدَقَةَ مِنَ الْإِبِلِ وَ الْبَقَرِ وَ الْغَنَمِ وَ مِنَ الْحِنْطَةِ وَ الشَّعِيرِ وَ التَّمْرِ وَ الزَّبِيبِ فَنَادَى فِيهِمْ بِذَلِكَ فِي شَهْرِ رَمَضَانَ وَ عَفَا لَهُمْ عَمَّا سِوَى ذَلِكَ ",
          "قَالَ ثُمَّ لَمْ يَفْرِضْ لِشَيْ‏ءٍ مِنْ أَمْوَالِهِمْ حَتَّى حَالَ عَلَيْهِمُ الْحَوْلُ مِنْ قَابِلٍ فَصَامُوا وَ أَفْطَرُوا فَأَمَرَ مُنَادِيَهُ فَنَادَى فِي الْمُسْلِمِينَ أَيُّهَا الْمُسْلِمُونَ زَكُّوا أَمْوَالَكُمْ تُقْبَلْ صَلَاتُكُمْ قَالَ ثُمَّ وَجَّهَ عُمَّالَ الصَّدَقَةِ وَ عُمَّالَ الطَّسُوقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ahmad Bin Muhammad, altogether from Ibn Mahboub, form Abdullah Bin Sinan who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When the Verse of <span class=\"iTxt\">Zakāt</span> was Revealed <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h103\">[9:103]</a> Take charity out from their wealth, you would cleanse them and purify them thereby</span>, and it was Revealed during a Month of Ramazan, so Rasool-Allah<sup>saww</sup> ordered his<sup>saww</sup> caller, so he called out among the people, ‘Allah<sup>azwj</sup> has imposed the <span class=\"iTxt\">Zakāt</span> upon you just as He<sup>azwj</sup> has Imposed the <span class=\"iTxt\">Salāt</span> upon you all!’ ",
            "Allah<sup>azwj</sup> Mighty and Majestic Obligated it upon them from the gold, and the silver, and Obligated the charity from the camels, and the cows, and sheep, and from the wheat, and the barley, and the dates, and the raisins. So he called out among them with that during a Month of Ramazan, and Excused for them from what is besides that’. ",
            "He<sup>asws</sup> said: ‘Then He<sup>azwj</sup> did not Impose anything from their wealth until a year passed by on them the next year. So they observed <span class=\"iTxt\">‘Soām’</span> (Fasted), and they broke their Fasts. So his<sup>saww</sup> caller called out among the Muslims, ‘O you Muslims! Purify your wealth, your <span class=\"iTxt\">Salāts</span> would be Accepted!’ Then he<sup>saww</sup> sent the office bearers of the charities, and the office bearers of the tax (<span class=\"iTxt\">Zakāt</span>) (i.e. to collect these)’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad all from ibn Mahbub from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, has said that once this verse of the Holy Quran was revealed to the Messenger of Allah. ‘Collect religious tax (zakat) from them to purify and cleanse them . . .’ <a href=\"/#/books/quran:9#h103\">[9:103]</a> It was revealed in the month of Ramadan, the Messenger of Allah commanded his announcer to announce among people that Allah has made it compulsory on you to pay zakat (charity) just as He has made obligatory upon you to perform Salah (prayer). Allah, the Most Majestic, the Most Glorious, has made it compulsory to pay zakat on gold and silver; and on cattle: camel, cows, sheep; and on grains: wheat, barley, dates and raisins. The announcer announced it in the month of Ramadan. He exempted them from payment of zakat on other forms of properties.’ The Imam then said, ‘Besides, He did not make it compulsory to pay zakat on their properties before the end of the year. They completed fasting. He then commanded his announcer to announce among the Muslims, “O Muslims, pay zakat on your properties; your Salah (prayer) will be accepted.’” He said, ‘Then he (the Messenger of Allah) sent his land assessor and tax collectors among people to collect zakat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/7)"
        ],
        "index": 5690,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ رِفَاعَةَ بْنِ مُوسَى أَنَّهُ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَا فَرَضَ اللَّهُ عَلَى هَذِهِ الْأُمَّةِ شَيْئاً أَشَدَّ عَلَيْهِمْ مِنَ الزَّكَاةِ وَ فِيهَا تَهْلِكُ عَامَّتُهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from hammad Bin Usman, from Rifa’at Bin Musa that, ",
            "‘He heard Abu Abdullah<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> has not Necessitated upon this community anything more difficult upon them than the <span class=\"iTxt\">Zakāt</span>, and regarding it the common folk get destroyed’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr from Hammad ibn ‘Uthman from Rifa‘ah ibn Musa who has said the following: “I heard abu ’Abd Allah, ‘Alayhi al-Salam, say, ‘No other obligation that Allah has made compulsory upon this nation is of more intensity than zakat. In the matter of zakat most of them face their destruction.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/7)"
        ],
        "index": 5691,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنِ ابْنِ مُسْكَانَ وَ غَيْرِ وَاحِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ جَلَّ وَ عَزَّ جَعَلَ لِلْفُقَرَاءِ فِي أَمْوَالِ الْأَغْنِيَاءِ مَا يَكْفِيهِمْ وَ لَوْ لَا ذَلِكَ لَزَادَهُمْ وَ إِنَّمَا يُؤْتَوْنَ مِنْ مَنْعِ مَنْ مَنَعَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Ibn Muskan and someone else,",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Made for the poor, in the wealth of the rich, what would suffice them, and had it not been that, He<sup>azwj</sup> would have Increased it for them, and rather they are poor due to the prevention of the ones who prevented it from them’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from ibn Muskan and more than one person who have said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Allah, the Most Majestic, the Most Glorious, has assigned in properties of affluent people a share for the needy that is sufficient to meet their need; otherwise, He would have increased such share. Shortages come from non-payment of those who do not pay.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/7)"
        ],
        "index": 5692,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ وَ أَبِي بَصِيرٍ وَ بُرَيْدٍ وَ فُضَيْلٍ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَا فَرَضَ اللَّهُ الزَّكَاةَ مَعَ الصَّلَاةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim, and Abu Baseer, and Bureyd and Fuzayl, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having said: ‘Allah<sup>azwj</sup> Imposed the <span class=\"iTxt\">Zakāt</span> along with the <span class=\"iTxt\">Salāt</span>’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Muhammad ibn Muslim and abu Basir, Burayd and Fudayl who have said the following: “Abu Ja‘far and abu ‘Abd Allah, ‘Alayhim al-Salam, have said that Allah has made zakat obligatory along with Salah (prayer).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/8)"
        ],
        "index": 5693,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ مُبَارَكٍ الْعَقَرْقُوفِيِّ قَالَ قَالَ أَبُو الْحَسَنِ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ وَضَعَ الزَّكَاةَ قُوتاً لِلْفُقَرَاءِ وَ تَوْفِيراً لِأَمْوَالِكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Mubarak Al Aqarquqy who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Placed the <span class=\"iTxt\">Zakāt</span> as a livelihood for the poor, and a multiplication for your wealth’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from Isma’il ibn Marrar from Mubarak al-‘Aqarqufiy who has said the following: “Abu al-Hassan, ‘Alayhi al-Salam, has said, ‘Allah, the Most Majestic, the Most Glorious, has made zakat as means of living for the needy and to increase your properties.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/8)"
        ],
        "index": 5694,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ الزَّكَاةَ كَمَا فَرَضَ الصَّلَاةَ وَ لَوْ أَنَّ رَجُلًا حَمَلَ الزَّكَاةَ فَأَعْطَاهَا عَلَانِيَةً لَمْ يَكُنْ عَلَيْهِ فِي ذَلِكَ عَيْبٌ وَ ذَلِكَ أَنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ فِي أَمْوَالِ الْأَغْنِيَاءِ لِلْفُقَرَاءِ مَا يَكْتَفُونَ بِهِ الْفُقَرَاءُ وَ لَوْ عَلِمَ أَنَّ الَّذِي فَرَضَ لَهُمْ لَا يَكْفِيهِمْ لَزَادَهُمْ وَ إِنَّمَا يُؤْتَى الْفُقَرَاءُ فِيمَا أُتُوا مِنْ مَنْعِ مَنْ مَنَعَهُمْ حُقُوقَهُمْ لَا مِنَ الْفَرِيضَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Imposed the <span class=\"iTxt\">Zakāt</span> just as He<sup>azwj</sup> Imposed the <span class=\"iTxt\">Salāt</span>; and if a man were to carry the <span class=\"iTxt\">Zakāt</span> and give it publicly, there would not be a fault upon him, and that is because Allah<sup>azwj</sup> Mighty and Majestic Imposed in the wealth of the rich for the poor, what the poor would be sufficing with, and had He<sup>azwj</sup> Known, that what He<sup>azwj</sup> has Imposed for them would not suffice them. He<sup>azwj</sup> would Have Increased it for them, and rather the poor are coming into what they are in (poverty), it is due to the prevention of the one who prevents their rights from them, and not from the (rate of <span class=\"iTxt\">Zakāt</span>) Imposed’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn al-Suwayd from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Allah, the Most Majestic, the Most Glorious, has made paying zakat compulsory as He has made performing of Salah (prayer) obligatory. If a man pays zakat publicly, it is not a blamable thing to do. It is because Allah, the Most Majestic, the Most Glorious, has assigned a share in the properties of affluent people for the needy enough to meet their needs. If it were in His knowledge that such share is not enough for them, He would have increased it. What the needy people face is because of withholding payment of zakat which is denying the rights of the needy, not because of the degree of the amount made compulsory.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/8)"
        ],
        "index": 5695,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:8",
        "refs": {
          "Quran": [
            "/books/quran:70:24",
            "/books/quran:14:31",
            "/books/quran:13:20",
            "/books/quran:57:18",
            "/books/quran:13:21",
            "/books/quran:70:25"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ بْنِ مِهْرَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ لِلْفُقَرَاءِ فِي أَمْوَالِ الْأَغْنِيَاءِ فَرِيضَةً لَا يُحْمَدُونَ إِلَّا بِأَدَائِهَا وَ هِيَ الزَّكَاةُ بِهَا حَقَنُوا دِمَاءَهُمْ وَ بِهَا سُمُّوا مُسْلِمِينَ",
          "وَ لَكِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ فِي أَمْوَالِ الْأَغْنِيَاءِ حُقُوقاً غَيْرَ الزَّكَاةِ فَقَالَ عَزَّ وَ جَلَّ وَ الَّذِينَ فِي أَمْوالِهِمْ حَقٌّ مَعْلُومٌ فَالْحَقُّ الْمَعْلُومُ مِنْ غَيْرِ الزَّكَاةِ وَ هُوَ شَيْ‏ءٌ يَفْرِضُهُ الرَّجُلُ عَلَى نَفْسِهِ فِي مَالِهِ يَجِبُ عَلَيْهِ أَنْ يَفْرِضَهُ عَلَى قَدْرِ طَاقَتِهِ وَ سَعَةِ مَالِهِ فَيُؤَدِّي الَّذِي فَرَضَ عَلَى نَفْسِهِ إِنْ شَاءَ فِي كُلِّ يَوْمٍ وَ إِنْ شَاءَ فِي كُلِّ جُمْعَةٍ وَ إِنْ شَاءَ فِي كُلِّ شَهْرٍ",
          "وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ أَيْضاً أَقْرَضُوا اللَّهَ قَرْضاً حَسَناً وَ هَذَا غَيْرُ الزَّكَاةِ وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ أَيْضاً يُنْفِقُوا مِمَّا رَزَقْناهُمْ سِرًّا وَ عَلانِيَةً وَ الْمَاعُونَ أَيْضاً وَ هُوَ الْقَرْضُ يُقْرِضُهُ وَ الْمَتَاعُ يُعِيرُهُ وَ الْمَعْرُوفُ يَصْنَعُهُ وَ مِمَّا فَرَضَ اللَّهُ عَزَّ وَ جَلَّ أَيْضاً فِي الْمَالِ مِنْ غَيْرِ الزَّكَاةِ قَوْلُهُ عَزَّ وَ جَلَّ الَّذِينَ يَصِلُونَ ما أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ ",
          "وَ مَنْ أَدَّى مَا فَرَضَ اللَّهُ عَلَيْهِ فَقَدْ قَضَى مَا عَلَيْهِ وَ أَدَّى شُكْرَ مَا أَنْعَمَ اللَّهُ عَلَيْهِ فِي مَالِهِ إِذَا هُوَ حَمِدَهُ عَلَى مَا أَنْعَمَ اللَّهُ عَلَيْهِ فِيهِ مِمَّا فَضَّلَهُ بِهِ مِنَ السَّعَةِ عَلَى غَيْرِهِ وَ لِمَا وَفَّقَهُ لِأَدَاءِ مَا فَرَضَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ وَ أَعَانَهُ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at Bin Mihran, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Imposed for the poor in the wealth of the rich, an imposition they would not be praiseworthy with except by paying it, and it is the <span class=\"iTxt\">Zakāt</span>. By it, their blood is saved, and by it they are named as Muslims. ",
            "But, Allah<sup>azwj</sup> Mighty and Majestic Imposed in the wealth of the rich certain rights apart from the <span class=\"iTxt\">Zakāt</span>, so the Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:70#h24\">[70:24]</a> And those in whose wealth there is a known right</span>. So the ‘known right’ is from other than the <span class=\"iTxt\">Zakāt</span>, and it is something which the man imposes upon himself with regards to his wealth. It is Obligated upon him that he imposes upon himself in accordance to his strength and capacity of his wealth. Therefore, he would pay, that which he had imposed upon himself, if he so desires to, during every day, and if he so desires to, during every Friday, and if he so desires to, during every month. ",
            "And Allah<sup>azwj</sup> Mighty and Majestic has Said as well <span class=\"ibTxt\"><a href=\"/#/books/quran:57#h18\">[57:18]</a> and the lenders to Allah of a goodly loan</span>, and this is other than the <span class=\"iTxt\">Zakāt</span>. And Allah<sup>azwj</sup> Mighty as Majestic has Said as well <span class=\"ibTxt\"><a href=\"/#/books/quran:14#h31\">[14:31]</a> and spend out of what We have Given them secretly and openly</span>. And the acts of kindness as well, and it is the loan which he lends (to Allah<sup>azwj</sup>); and the chattels (property) than one lends, and the act of goodness one does. And from what Allah<sup>azwj</sup> Mighty and Majestic has Imposed as well in the wealth, from other than the <span class=\"iTxt\">Zakāt</span>, is as per the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:13#h21\">[13:21]</a> And those who join what Allah has Bidden to be joined</span>, if he does (help the relatives). ",
            "And the one who pays what Allah<sup>azwj</sup> has Imposed upon him, so he has fulfilled whatever was upon him, and he would have paid his gratefulness of what Allah<sup>azwj</sup> had Favoured upon him in his wealth, when he Praises Him<sup>azwj</sup> upon what Allah<sup>azwj</sup> had Favoured upon him from what He<sup>azwj</sup> had Preferred him with from the (financial) capacity over the others, and due to Inclining him to pay what Allah<sup>azwj</sup> Mighty and Majestic has Imposed upon him, and Supported him upon it’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah ibn Mehran who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Allah, the Most Majestic, the Most Glorious, has made it compulsory on affluent people to pay the share of the needy people from their properties and the affluent people will not be praised unless they pay the share of needy people. This share is zakat. Paying zakat protects their lives and because of paying zakat, they are called Muslims. However, Allah, the Most Majestic, the Most Glorious, has assigned other shares in the properties of the affluent people, which are other than zakat. This is what a man considers necessary to pay from his property as Allah, the Most Majestic, the Most Glorious, has mentioned in His book: ‘They are those who assign a certain share of their property <a href=\"/#/books/quran:70#h24\">[70:24]</a> for the needy and the deprived <a href=\"/#/books/quran:70#h25\">[70:25]</a>.’ The ‘certain share’ is something other than zakat. It is what one considers necessary to pay to the needy. He must, however, do so according to his financial abilities and then pay what he has considered necessary. He may pay every day, every Friday or every month. Allah, the Most Majestic, the Most Glorious, has also said, ‘The charitable men and women who give a virtuous loan to Allah will receive double from Him in addition to their honorable reward.’ <a href=\"/#/books/quran:57#h18\">[57:18]</a> This also is something other than zakat. Allah, the Most Majestic, the Most Glorious, has said again, ‘. . . My believing servants . . . spend for the cause of their Lord, both in private and in public, out of what We have given them. . . .’ <a href=\"/#/books/quran:14#h31\">[14:31]</a> Assistance is a form of loan, borrowing a certain item or lending a helping hand are also of matters Allah, the Most Majestic, the Most Glorious, has made necessary and they are other than zakat. Allah, the Most Majestic, the Most Glorious, has said, ‘Those who fulfill their promise to and covenant with Allah <a href=\"/#/books/quran:13#h20\">[13:20]</a>, who maintain all the proper relations that Allah has commanded them to maintain, who have fear of their Lord and the hardships of the Day of Judgment’ <a href=\"/#/books/quran:13#h21\">[13:21]</a>. Those who pay what Allah has made compulsory have fulfilled their duties and have paid thanks to Allah for His bounties in his properties. In this way he has thanked Allah for what Allah has granted him and has given him preference over others as wealthier than others and has given him the opportunity to fulfill his duty toward Allah, the Most Majestic, the Most Glorious, and has helped him to do so.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/9)"
        ],
        "index": 5696,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:9",
        "refs": {
          "Quran": [
            "/books/quran:70:24",
            "/books/quran:2:270",
            "/books/quran:2:273",
            "/books/quran:2:271",
            "/books/quran:107:7",
            "/books/quran:76:8",
            "/books/quran:70:25",
            "/books/quran:2:274"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ أَبِي الْمَغْرَاءِ عَنْ أَبِي بَصِيرٍ قَالَ كُنَّا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ مَعَنَا بَعْضُ أَصْحَابِ الْأَمْوَالِ فَذَكَرُوا الزَّكَاةَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الزَّكَاةَ لَيْسَ يُحْمَدُ بِهَا صَاحِبُهَا وَ إِنَّمَا هُوَ شَيْ‏ءٌ ظَاهِرٌ إِنَّمَا حَقَنَ بِهَا دَمَهُ وَ سُمِّيَ بِهَا مُسْلِماً وَ لَوْ لَمْ يُؤَدِّهَا لَمْ تُقْبَلْ لَهُ صَلَاةٌ وَ إِنَّ عَلَيْكُمْ فِي أَمْوَالِكُمْ غَيْرَ الزَّكَاةِ",
          "فَقُلْتُ أَصْلَحَكَ اللَّهُ وَ مَا عَلَيْنَا فِي أَمْوَالِنَا غَيْرُ الزَّكَاةِ فَقَالَ سُبْحَانَ اللَّهِ أَ مَا تَسْمَعُ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فِي كِتَابِهِ وَ الَّذِينَ فِي أَمْوالِهِمْ حَقٌّ مَعْلُومٌ. لِلسَّائِلِ وَ الْمَحْرُومِ قَالَ قُلْتُ مَا ذَا الْحَقُّ الْمَعْلُومُ الَّذِي عَلَيْنَا قَالَ هُوَ الشَّيْ‏ءُ يَعْمَلُهُ الرَّجُلُ فِي مَالِهِ يُعْطِيهِ فِي الْيَوْمِ أَوْ فِي الْجُمْعَةِ أَوْ فِي الشَّهْرِ قَلَّ أَوْ كَثُرَ غَيْرَ أَنَّهُ يَدُومُ عَلَيْهِ",
          "وَ قَوْلَهُ عَزَّ وَ جَلَّ وَ يَمْنَعُونَ الْماعُونَ قَالَ هُوَ الْقَرْضُ يُقْرِضُهُ وَ الْمَعْرُوفُ يَصْطَنِعُهُ وَ مَتَاعُ الْبَيْتِ يُعِيرُهُ وَ مِنْهُ الزَّكَاةُ فَقُلْتُ لَهُ إِنَّ لَنَا جِيرَاناً إِذَا أَعَرْنَاهُمْ مَتَاعاً كَسَرُوهُ وَ أَفْسَدُوهُ فَعَلَيْنَا جُنَاحٌ إِنْ نَمْنَعْهُمْ فَقَالَ لَا لَيْسَ عَلَيْكُمْ جُنَاحٌ إِنْ تَمْنَعُوهُمْ إِذَا كَانُوا كَذَلِكَ ",
          "قَالَ قُلْتُ لَهُ وَ يُطْعِمُونَ الطَّعامَ عَلى حُبِّهِ مِسْكِيناً وَ يَتِيماً وَ أَسِيراً قَالَ لَيْسَ مِنَ الزَّكَاةِ قُلْتُ قَوْلُهُ عَزَّ وَ جَلَّ الَّذِينَ يُنْفِقُونَ أَمْوالَهُمْ بِاللَّيْلِ وَ النَّهارِ سِرًّا وَ عَلانِيَةً قَالَ لَيْسَ مِنَ الزَّكَاةِ قَالَ فَقُلْتُ قَوْلُهُ عَزَّ وَ جَلَّ إِنْ تُبْدُوا الصَّدَقاتِ فَنِعِمَّا هِيَ وَ إِنْ تُخْفُوها وَ تُؤْتُوهَا الْفُقَراءَ فَهُوَ خَيْرٌ لَكُمْ قَالَ لَيْسَ مِنَ الزَّكَاةِ وَ صِلَتُكَ قَرَابَتَكَ لَيْسَ مِنَ الزَّكَاةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Abu Al Magra’a, from Abu Baseer who said, ",
            "‘We were in the presence of Abu Abdullah<sup>asws</sup>, and with us was an owner of the wealth (rich man), and they mentioned the <span class=\"iTxt\">Zakāt</span>, so Abu Abdullah<sup>asws</sup> said: ‘The <span class=\"iTxt\">Zakāt</span> is not something which its payer is praised by, and rather it is something which is apparent. But rather, his blood is saved by it and he is named as a Muslim by it, and if were he not to pay it, <span class=\"iTxt\">Salāt</span> would not be Acceptable from him, and that upon you, regarding your wealth, is other than the <span class=\"iTxt\">Zakāt</span>’.",
            "So I said, ‘May Allah<sup>azwj</sup> Keep you well! And what is (imposed) upon us regarding our wealth, apart from the <span class=\"iTxt\">Zakāt</span>?’ So he<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! Have you not heard Allah<sup>azwj</sup> Mighty and Majestic Saying in His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:70#h24\">[70:24]</a> And those in whose wealth there is a known right <a href=\"/#/books/quran:70#h25\">[70:25]</a> For him who asks and for him who is denied</span>?’ I said, ‘What is that ‘known right’ which is upon us?’ He<sup>asws</sup> said: ‘It is something which the man works for regarding his wealth which he gives during the day, or during the Friday, or during the month, little or more, apart from that he is persistent upon it.",
            "And the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:107#h7\">[107:7]</a> And withhold the necessaries of life</span>. It (necessaries of life) is the loan which he lends out, and the goodness of lending the chattels of his house, and from it is the <span class=\"iTxt\">Zakāt</span>’. So I said to him<sup>asws</sup>, ‘There are neighbours of ours when we lend chattels, they break it, and spoil it. So would there be a blame upon us if were to withhold from them?’ So he<sup>asws</sup> said: ‘No, there is no blame upon you if you were to withhold from them when they were like that’. ",
            "He (the narrator) said, ‘I said to him<sup>asws</sup>, ‘(What about) <span class=\"ibTxt\"><a href=\"/#/books/quran:76#h8\">[76:8]</a> And they give food out of love for Him to the poor and the orphan and the captive</span>?’ He<sup>asws</sup> said: ‘Not from the <span class=\"iTxt\">Zakāt</span>’. I said, ‘The Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h274\">[2:274]</a> (As for) those who are spending their property by the night and by the day, secretly and openly</span>?’ He<sup>asws</sup> said: ‘Not from the <span class=\"iTxt\">Zakāt</span>’. I said, ‘The Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h271\">[2:271]</a> If you give alms openly, it is good, and if you hide it and give it to the poor, it is better for you</span>?’ He<sup>asws</sup> said: ‘Not from the <span class=\"iTxt\">Zakāt</span>; and your helping the relatives is not from the <span class=\"iTxt\">Zakāt</span>’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from af-Husayn ibn Sa‘id from Fadalah ibn Ayyub from abu af-Maghra’ from abu Basir who has said the following: “Once we were in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam. With us, there were certain wealthier persons. People spoke about zakat. Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘One does not become very much praiseworthy for paying zakat, although it is something purifying. Obviously, he has only protected his life and because of such payment is called a Muslim. Were he not to pay zakat his Salah (prayer) would not receive acceptance. However, on your properties, payments other than zakat are also due.’ I (the narrator) than asked, ‘I pray to Allah to keep you well, what other payments, besides zakat, are due on our properties?’ He replied, ‘Allah is free of all defects. Have you not heard the words of Allah, the Most Majestic, the Most Glorious, in His book, “They are those who assign a certain share of their property <a href=\"/#/books/quran:70#h24\">[70:24]</a> for the needy and the deprived.” <a href=\"/#/books/quran:70#h25\">[70:25]</a> I (the narrator) then asked, ‘What is the “certain share,” in our properties, due on us?’ He replied, ‘It is the amount that one pays from his property every day, or every Friday or every month in small amounts or large amounts and continues doing so. It also is mentioned in the words of Allah, the Most Majestic, the Most Glorious, “. . . and refuse to help the needy.” <a href=\"/#/books/quran:107#h7\">[107:7]</a> This kind of help is what one considers necessary to pay as a loan, or a favor or household items borrowed and of this kind is zakat.’ I then said, ‘We have such neighbors that on lending things to them they may break or destroy them. Is it alright if we deny them such things?’ He replied, ‘In such case you are not blamed.’ I then asked about the words of Allah, ‘They feed the destitute, orphans, and captives for the love of Allah. . .’ <a href=\"/#/books/quran:76#h8\">[76:8]</a> He said, ‘That is not of zakat.’ I then asked about the words of Allah, Allah, most Majestic, most Glorious, ‘. . . they spent their property during the night and day, publicly or privately’ <a href=\"/#/books/quran:2#h273\">[2:273]</a> He said, ‘It is not of zakat.’ I then asked about the words of Allah, Allah, most Majestic, most Glorious, ‘It is alright if you pay charity publicly but if you pay to the needy privately it is better for you.’ <a href=\"/#/books/quran:2#h270\">[2:270]</a> The Imam said, ‘It is not of zakat. Keeping good relations with your relatives is not of zakat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/10)"
        ],
        "index": 5697,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:10",
        "refs": {
          "Quran": [
            "/books/quran:70:24",
            "/books/quran:70:25"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ الَّذِينَ فِي أَمْوالِهِمْ حَقٌّ مَعْلُومٌ. لِلسَّائِلِ وَ الْمَحْرُومِ أَ هُوَ سِوَى الزَّكَاةِ فَقَالَ هُوَ الرَّجُلُ يُؤْتِيهِ اللَّهُ الثَّرْوَةَ مِنَ الْمَالِ فَيُخْرِجُ مِنْهُ الْأَلْفَ وَ الْأَلْفَيْنِ وَ الثَّلَاثَةَ الْآلَافِ وَ الْأَقَلَّ وَ الْأَكْثَرَ فَيَصِلُ بِهِ رَحِمَهُ وَ يَحْمِلُ بِهِ الْكَلَّ عَنْ قَوْمِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Abdullah, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Ismail Bin Jabir, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Might and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:70#h24\">[70:24]</a> And those in whose wealth there is a known right <a href=\"/#/books/quran:70#h25\">[70:25]</a> For him who asks and for him who is denied</span>, ‘Is it besides the <span class=\"iTxt\">Zakāt</span>?’ So he<sup>asws</sup> said: ‘It is the man whom Allah<sup>azwj</sup> has Given the fortune from the wealth, so he extracts from it the thousand, and the two thousand, and the three thousand, and the less and the more, so he helps his relatives with it, and carries by it the burdens from his people’."
          ],
          "en.sarwar": [
            "10. Ali ibn Muhammad has narrated from Ahmad ibn Muhammad from ibn Khalid from ‘Uthman from ibn ‘Isa from Isma’il ibn Jabir who has said the following: “In the following words of Allah, the Most Majestic, the Most Glorious, there is the expression, ‘certain share’: ‘They are those who assign a certain share of their property <a href=\"/#/books/quran:70#h24\">[70:24]</a> for the needy and the deprived.’ <a href=\"/#/books/quran:70#h25\">[70:25]</a> Whether ’certain share’ stands for zakat or something else, the Imam said, ‘It is the property that Allah gives to an affluent person who pays a thousand or two or three or less or more to keep good relations with relatives or relieve the burdens of his people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/10)"
        ],
        "index": 5698,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:11",
        "refs": {
          "Quran": [
            "/books/quran:70:24",
            "/books/quran:70:25",
            "/books/quran:6:124"
          ]
        },
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ الْأَنْصَارِيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ رَجُلًا جَاءَ إِلَى أَبِي عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) فَقَالَ لَهُ أَخْبِرْنِي عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ الَّذِينَ فِي أَمْوالِهِمْ حَقٌّ مَعْلُومٌ. لِلسَّائِلِ وَ الْمَحْرُومِ مَا هَذَا الْحَقُّ الْمَعْلُومُ فَقَالَ لَهُ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) الْحَقُّ الْمَعْلُومُ الشَّيْ‏ءُ يُخْرِجُهُ الرَّجُلُ مِنْ مَالِهِ لَيْسَ مِنَ الزَّكَاةِ وَ لَا مِنَ الصَّدَقَةِ الْمَفْرُوضَتَيْنِ ",
          "قَالَ فَإِذَا لَمْ يَكُنْ مِنَ الزَّكَاةِ وَ لَا مِنَ الصَّدَقَةِ فَمَا هُوَ فَقَالَ هُوَ الشَّيْ‏ءُ يُخْرِجُهُ الرَّجُلُ مِنْ مَالِهِ إِنْ شَاءَ أَكْثَرَ وَ إِنْ شَاءَ أَقَلَّ عَلَى قَدْرِ مَا يَمْلِكُ فَقَالَ لَهُ الرَّجُلُ فَمَا يَصْنَعُ بِهِ قَالَ يَصِلُ بِهِ رَحِماً وَ يَقْرِي بِهِ ضَيْفاً وَ يَحْمِلُ بِهِ كَلًّا أَوْ يَصِلُ بِهِ أَخاً لَهُ فِي اللَّهِ أَوْ لِنَائِبَةٍ تَنُوبُهُ فَقَالَ الرَّجُلُ اللَّهُ يَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَاتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Abdul Rahman Bin Al Hajjaj, from Al Qasim Bin Abdul Rahman Al Ansary who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘A man came over to my<sup>asws</sup> father<sup>asws</sup> Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> and he said to him<sup>asws</sup>, ‘Inform me about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:70#h24\">[70:24]</a> And those in whose wealth there is a known right <a href=\"/#/books/quran:70#h25\">[70:25]</a> For him who asks and for him who is denied</span>. What is this ‘known right’?’ So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to him: ‘The ‘known right’ is something which the man takes out from his wealth, it neither being from the <span class=\"iTxt\">Zakāt</span> nor from the charity, the two Imposed ones’.",
            "He said, ‘So when neither happens to be from the <span class=\"iTxt\">Zakāt</span>, nor from the charity, so what is it?’ So he<sup>asws</sup> said: ‘It is something which the man takes out from his wealth, if he so desires to, more, and if he so desires to, less, upon a measurement of what he owns’. So the man said to him<sup>asws</sup>, ‘And what should he do with it?’ He<sup>asws</sup> said: ‘Help his relatives with it, and entertain guests with it, and carries a burden with it, or helps his brother with it for the Sake of Allah<sup>azwj</sup> or repel (a problem) on his behalf’. So the man said: ‘Allah<sup>azwj</sup> Knows where He<sup>azwj</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h124\">[6:124]</a> Allah best Knows where He Places His Message</span>’."
          ],
          "en.sarwar": [
            "11. It is a narration from him (narrator of previous Hadith) by Ahmad ibn Muhammad from af-Hassan ibn Mahbub from ‘Abd al-Rahman ibn al-Hajjaj from al-Qasim ibn ‘Abd al-Rahman af-Ansariy who has said the following: “I heard abu Ja‘far, ‘Alayhi al-Salam, say, ‘Once a man came to my father, Ali ibn al-Husayn, ‘Alayhi al-Salam, and said, “Please tell me about the expression ‘certain share’. The words of Allah, the Most Majestic, the Most Glorious, say, ‘They are those who assign a certain share of their property <a href=\"/#/books/quran:70#h24\">[70:24]</a> for the needy and the deprived.’ <a href=\"/#/books/quran:70#h25\">[70:25]</a> What is this ‘certain share’?”’ Ali ibn al-Husayn, Alayhi al- Salam, said to him, ‘The ‘certain share’ is what a man pays from his property. It is not zakat or obligatory charity.’ He then asked, ‘If it is not of zakat or obligatory charity, then what is it?’ The Imam replied, ‘It is what a person pays from his property in small or larger amounts according to his ability.’ The man then asked, ‘What does he do with it?’ The Imam replied, ‘He thereby keeps good relation with relatives, entertains guest, relieves a burden, keeps good relations with a brother in faith, for the sake of Allah or fends off thereby a misfortune.’ The man then said, ‘Allah knows best where to keep (whom to entrust with) His message.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول وآخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/10)"
        ],
        "index": 5699,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:12",
        "refs": {
          "Quran": [
            "/books/quran:70:24",
            "/books/quran:70:25"
          ]
        },
        "text": [
          "وَ عَنْهُ عَنِ ابْنِ فَضَّالٍ عَنْ صَفْوَانَ الْجَمَّالِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ عَزَّ وَ جَلَّ لِلسَّائِلِ وَ الْمَحْرُومِ قَالَ الْمَحْرُومُ الْمُحَارَفُ الَّذِي قَدْ حُرِمَ كَدَّ يَدِهِ فِي الشِّرَاءِ وَ الْبَيْعِ .",
          "وَ فِي رِوَايَةٍ أُخْرَى عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُمَا قَالَا الْمَحْرُومُ الرَّجُلُ الَّذِي لَيْسَ بِعَقْلِهِ بَأْسٌ وَ لَمْ يُبْسَطْ لَهُ فِي الرِّزْقِ وَ هُوَ مُحَارَفٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ibn Fazzal, from Safwan Al Jammal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:70#h25\">[70:25]</a> For him who asks and for him who is denied</span>. He<sup>asws</sup> said: ‘The denied one is the constrained one who is denied the toil of his hands regarding the buying and the selling’.",
            "And in another report, from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup>, both having said: ‘The deprived is the man, there is nothing wrong with his intellect, but the livelihood is not extensive for him, and he is constrained’."
          ],
          "en.sarwar": [
            "12. It is a narration from him (narrator of previous Hadith) by ibn Faddal from Safwan al-Jammal who has said the following: “In the following words of Allah there is the expression ‘deprived’: ‘They are those who assign a certain share of their property <a href=\"/#/books/quran:70#h24\">[70:24]</a> for the needy and the deprived.’ <a href=\"/#/books/quran:70#h25\">[70:25]</a> Abu ‘Abd Allah, Alayhi al-Salam, has said, ‘“Deprived” is a professional who no longer is able to benefit from the labor of his hands in business transactions.’” “In another Hadith it is narrated from abu Ja‘far and abu ‘Abd Allah, Alayhim al-Salam, who have said, ‘Deprived is a person who has no problem in his understanding but is very tight in means of living.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/11)"
        ],
        "index": 5700,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:13",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْمُفَضَّلِ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلَهُ رَجُلٌ فِي كَمْ تَجِبُ الزَّكَاةُ مِنَ الْمَالِ فَقَالَ لَهُ الزَّكَاةُ الظَّاهِرَةُ أَمِ الْبَاطِنَةُ تُرِيدُ فَقَالَ أُرِيدُهُمَا جَمِيعاً فَقَالَ أَمَّا الظَّاهِرَةُ فَفِي كُلِّ أَلْفٍ خَمْسَةٌ وَ عِشْرُونَ وَ أَمَّا الْبَاطِنَةُ فَلَا تَسْتَأْثِرْ عَلَى أَخِيكَ بِمَا هُوَ أَحْوَجُ إِلَيْهِ مِنْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from the one who mentioned it, from Muhammad Bin Khalid, from Muhammad Bin Sinan, from Al Mufazzal who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, and a man asked him<sup>asws</sup>, ‘With regards to how much is the <span class=\"iTxt\">Zakāt</span> Obligated from the wealth?’ So he<sup>asws</sup> said to him: ‘Is it the apparent <span class=\"iTxt\">Zakāt</span> or the hidden <span class=\"iTxt\">Zakāt</span> are you intending?’ So he said, ‘I intend both of them together’. So he<sup>asws</sup> said: ‘As for the apparent, so it is twenty-five in every thousand, and as for the hidden, so not (considering as too much) preferring your brother with what he is more needy to it than you are’."
          ],
          "en.sarwar": [
            "13. Ali ibn Muhammad has narrated from those whom he has mentioned (in his book) from Muhammad ibn Khalid from Muhammad ibn Sinan from al-Mufaddal who has said the following: “Once I was in the presence of abu ‘Abd Allah, Alayhi al-Salam, when a man asked him, ‘For how much property is it compulsory to pay zakat?’ The Imam asked him, ‘Do you mean thereby the apparent or unapparent zakat?’ He replied, ‘I mean both kinds.’ The Imam said, ‘The apparent kind is twenty-five due upon every one thousand. The unapparent kind is what you should not spare from your brother what he needs more than you do.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن والسند الثاني مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/11)"
        ],
        "index": 5701,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:14",
        "refs": {
          "Quran": [
            "/books/quran:17:26",
            "/books/quran:17:27"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ عَامِرِ بْنِ جُذَاعَةَ قَالَ جَاءَ رَجُلٌ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ يَا أَبَا عَبْدِ اللَّهِ قَرْضٌ إِلَى مَيْسَرَةٍ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِلَى غَلَّةٍ تُدْرَكُ فَقَالَ الرَّجُلُ لَا وَ اللَّهِ قَالَ فَإِلَى تِجَارَةٍ تُؤَبُّ قَالَ لَا وَ اللَّهِ قَالَ فَإِلَى عُقْدَةٍ تُبَاعُ فَقَالَ لَا وَ اللَّهِ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَأَنْتَ مِمَّنْ جَعَلَ اللَّهُ لَهُ فِي أَمْوَالِنَا حَقّاً ثُمَّ دَعَا بِكِيسٍ فِيهِ دَرَاهِمُ فَأَدْخَلَ يَدَهُ فِيهِ فَنَاوَلَهُ مِنْهُ قَبْضَةً ثُمَّ قَالَ لَهُ اتَّقِ اللَّهَ وَ لَا تُسْرِفْ وَ لَا تَقْتُرْ وَ لَكِنْ بَيْنَ ذَلِكَ قَوَاماً إِنَّ التَّبْذِيرَ مِنَ الْإِسْرَافِ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ لا تُبَذِّرْ تَبْذِيراً .",
          "الْحَسَنُ بْنُ مَحْبُوبٍ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Al Hassan Bin Mahboub, from Malik Bin Atiyya, from Aamir Bin Juza’at who said, ",
            "‘A man came over to Abu Abdullah<sup>asws</sup>, and he said to him<sup>asws</sup>, ‘O Abu Abdullah<sup>asws</sup>! Lend me (some money) up to (my) financial ease’. So Abu Abdullah<sup>asws</sup> said to him: ‘Up to you realising a harvest?’ So the man said, ‘No, by Allah<sup>azwj</sup>’. He<sup>asws</sup> said: ‘So up to your profit in a trade?’ He said, ‘No, by Allah<sup>azwj</sup>’. He<sup>asws</sup>: ‘So up to a contract being fulfilled?’ So he said, ‘No, by Allah<sup>azwj</sup>’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘Thus, you are from the ones for whom, in our<sup>asws</sup> wealth, there is a right’. Then he<sup>asws</sup> called for a bag wherein were some Dirhams, and he<sup>asws</sup> inserted his<sup>asws</sup> hand in it and took out a handful from it, then said to him: ‘Fear Allah<sup>azwj</sup> and neither be extravagant nor be stingy, but be upright in between that. The squandering is from the extravagance. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h26\">[17:26]</a> and do not squander wastefully</span>’.",
            "Al Hassan Bin Mahboub, from Sa’dan Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> – similar to that’."
          ],
          "en.sarwar": [
            "14. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from al-Hassan ibn Mahbub from Malik ibn ‘Atiyyah from ‘Amir ibn Juza‘ah who has said the following: “Once a man came in the presence of abu ‘Abd Allah, Alayhi al-Salam, and appealed, ‘O abu ‘Abd Allah, grant me a loan until I am able to pay back.’ Abu ‘Abd Allah, Alayhi al-Salam, asked, ‘Do you want to borrow until the time you harvest your plantation?’ The man answered, ‘No, by Allah, (I do not have any plantation).’ The Imam then asked, ‘Do you want until you make a business gain?’ He replied ‘No, by Allah, (I do not have any business).’ The Imam then asked, ‘Do you want to borrow until you receive profit from a contract you have made?’ He replied, ‘No, by Allah, (I do not have any such contract)’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘You then are of those for whom Allah has set a share in our properties.’ He then asked to bring for him a bag with dirhams in it. He then picked up a handful of money there-from and gave it to him saying, ‘Observe piety before Allah. Do not spend it extravagantly or miserly but spend it in a balanced manner. Spending in a wasteful manner is extravagance and Allah, the Most Majestic, the Most Glorious, forbids it, “Do not squander your belongings wastefully. . . <a href=\"/#/books/quran:17#h27\">[17:27]</a>’” Al-Hassan ibn Mahbub has narrated from Sa‘dan ibn Muslim from abu ‘Abd Allah, ‘Alayhi al-Salam, a similar Hadith.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/11)"
        ],
        "index": 5702,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:15",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ رَجُلٍ مِنْ أَهْلِ سَابَاطَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِعَمَّارٍ السَّابَاطِيِّ يَا عَمَّارُ أَنْتَ رَبُّ مَالٍ كَثِيرٍ قَالَ نَعَمْ جُعِلْتُ فِدَاكَ قَالَ فَتُؤَدِّي مَا افْتَرَضَ اللَّهُ عَلَيْكَ مِنَ الزَّكَاةِ فَقَالَ نَعَمْ قَالَ فَتُخْرِجُ الْحَقَّ الْمَعْلُومَ مِنْ مَالِكَ قَالَ نَعَمْ قَالَ فَتَصِلُ قَرَابَتَكَ قَالَ نَعَمْ قَالَ وَ تَصِلُ إِخْوَانَكَ قَالَ نَعَمْ فَقَالَ يَا عَمَّارُ إِنَّ الْمَالَ يَفْنَى وَ الْبَدَنَ يَبْلَى وَ الْعَمَلَ يَبْقَى وَ الدَّيَّانَ حَيٌّ لَا يَمُوتُ يَا عَمَّارُ إِنَّهُ مَا قَدَّمْتَ فَلَنْ يَسْبِقَكَ وَ مَا أَخَّرْتَ فَلَنْ يَلْحَقَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Bin Abdullah and someone else, from Ahmad Bin Abu Abdullah, from his father, from Abdullah Bin Al Qasim, from a man from the people of Sabata who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to Ammar Al-Sabaty: ‘O Ammar! You are a lord of a lot of wealth?’ He said, ‘Yes, may I be sacrificed for you<sup>asws</sup>’. He<sup>asws</sup> said: ‘So do you pay what Allah<sup>azwj</sup> has Imposed upon you, from the <span class=\"iTxt\">Zakāt</span>?’ So he said, ‘Yes’. He<sup>asws</sup> said: ‘So you do take out the ‘known right’ from your wealth?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘So you do help your relatives?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘And you do help your brothers’. He said, ‘Yes’. So he<sup>asws</sup> said: ‘O Ammar! The wealth perishes, and the body wears out, and the deeds remain, and the Judge (Allah<sup>azwj</sup>) is Living and will not be dying. O Ammar! Whatever you send forward, so it will never preceded you (leave you behind), and whatever you delay (not perform), so it will never join you’."
          ],
          "en.sarwar": [
            "15. Ahmad ibn Muhammad ibn ‘Abd Allah and others have narrated from Ahmad ibn abu ‘Abd Allah from his father from ‘Abd Allah ibn al-Qasim from a man of the people of Sabat who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once said to ‘Ammar al-Sabatiy, ‘O ‘Ammar, do you own a great wealth?’ He replied, ‘Yes, I pray to Allah to keep my soul in service for your cause.’ The Imam then asked, ‘Do you pay what Allah has made compulsory in the form of zakat?’ He replied, ‘Yes, I pay.’ The Imam then asked, ‘Do you pay “certain share” out of your wealth?’ He replied, ‘Yes, I pay.’ The Imam then asked, ‘Do you maintain good relations with your relatives?’ He replied, ‘Yes, I do so.’ The Imam asked, ‘Do you keep good relations with your brothers in faith?’ He replied, ‘Yes, I do so.’ The Imam then said, ‘O ‘Ammar, wealth goes away, bodies become old but deeds remain. The One who rewards for good deeds lives forever and never dies. O ‘Ammar, what you save as good deeds do not leave you behind and what you postponed never come to join you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/12)"
        ],
        "index": 5703,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:16",
        "refs": {
          "Quran": [
            "/books/quran:9:60"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِنَّمَا الصَّدَقاتُ لِلْفُقَراءِ وَ الْمَساكِينِ قَالَ الْفَقِيرُ الَّذِي لَا يَسْأَلُ النَّاسَ وَ الْمِسْكِينُ أَجْهَدُ مِنْهُ وَ الْبَائِسُ أَجْهَدُهُمْ فَكُلُّ مَا فَرَضَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْكَ فَإِعْلَانُهُ أَفْضَلُ مِنْ إِسْرَارِهِ وَ كُلُّ مَا كَانَ تَطَوُّعاً فَإِسْرَارُهُ أَفْضَلُ مِنْ إِعْلَانِهِ وَ لَوْ أَنَّ رَجُلًا يَحْمِلُ زَكَاةَ مَالِهِ عَلَى عَاتِقِهِ فَقَسَمَهَا عَلَانِيَةً كَانَ ذَلِكَ حَسَناً جَمِيلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Abdullah Bin Yahya, from Abdullah Bin Muskan, from Abu Baseer who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘(What about) the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h60\">[9:60]</a> But rather, the charities are only for the poor and the needy</span>?’ He<sup>asws</sup> said: ‘The ‘poor’ is the one who does not ask the people, and the needy is even more straitened than him, and the wretch is even more straitened than them. Thus, everything what Allah<sup>azwj</sup> Mighty and Majestic has Imposed upon you, so its public (giving) is superior than its secretive (giving), and everything what was voluntary, so its secretive (giving) is superior than its publicly (giving), and even if a man were to carry the <span class=\"iTxt\">Zakāt</span> of his wealth upon his shoulders and distribute it publicly, that would be good, beautiful’."
          ],
          "en.sarwar": [
            "16. Ali ibn Ibrahim has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from ‘Abd Allah ibn Yahya from ‘Abd Allah ibn Muskan from abu Basir who has said the following: “I asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, the Most Majestic, the Most Glorious, ‘Charities are for the poor and the destitute. . .’ <a href=\"/#/books/quran:9#h60\">[9:60]</a> The Imam said, ‘Poor is one who does not ask people for help, destitute is one of a worse condition, and hopeless is even of a worse condition. Paying, what Allah, the Most Majestic, the Most Glorious, has made compulsory upon you, publicly is better than paying privately. It is better to pay privately what is paid voluntarily. A person’s carrying zakat that he must pay, on his shoulders that he then distributes in public is just fine and beautiful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/12)"
        ],
        "index": 5704,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:17",
        "refs": {
          "Quran": [
            "/books/quran:2:273",
            "/books/quran:2:271"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ إِنْ تُخْفُوها وَ تُؤْتُوهَا الْفُقَراءَ فَهُوَ خَيْرٌ لَكُمْ فَقَالَ هِيَ سِوَى الزَّكَاةِ إِنَّ الزَّكَاةَ عَلَانِيَةٌ غَيْرُ سِرٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h271\">[2:271]</a> If you give alms openly, it is good, and if you hide it and give it to the poor, it is better for you</span>. So he<sup>asws</sup> said: ‘It is besides the <span class=\"iTxt\">Zakāt</span>. The (giving) of <span class=\"iTxt\">Zakāt</span> is publicly, without being secretive’."
          ],
          "en.sarwar": [
            "17. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Ishaq ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, the Most Majestic, the Most Glorious, ‘. . . If you pay it privately to the needy, it is better for you. . . .’ <a href=\"/#/books/quran:2#h273\">[2:273]</a>, has said, ‘This payment is a payment other than compulsory zakat which is paid publicly and not privately.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/12)"
        ],
        "index": 5705,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:18",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) أَنَّهُ سَأَلَهُ عَنِ الْفَقِيرِ وَ الْمِسْكِينِ فَقَالَ الْفَقِيرُ الَّذِي لَا يَسْأَلُ وَ الْمِسْكِينُ الَّذِي هُوَ أَجْهَدُ مِنْهُ الَّذِي يَسْأَلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Hassan, from Safwan in Yahya, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), that he<sup>asws</sup> was asked about the poor and the needy, so he<sup>asws</sup> said: ‘The poor is the one who does not ask, and the needy is the one who is more straitened that he does ask for’."
          ],
          "en.sarwar": [
            "18. Muhammad ibn Yahya has narrated from Muhammad ibn al-Hassan from Safwan ibn Yahya from al-‘Ala’ ibn Razin from Muhammad ibn Muslim from one of them (the two Imam): “Someone asked the Imam, ‘Alayhi al-Salam, about poor and destitute. He replied, ‘Poor is one who does not ask for help. Destitute is of a worse condition and he asks for help.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/13)"
        ],
        "index": 5706,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:1:19",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ ذَكَرْتُ لِلرِّضَا ( عليه السلام ) شَيْئاً فَقَالَ اصْبِرْ فَإِنِّي أَرْجُو أَنْ يَصْنَعَ اللَّهُ لَكَ إِنْ شَاءَ اللَّهُ ثُمَّ قَالَ فَوَ اللَّهِ مَا أَخَّرَ اللَّهُ عَنِ الْمُؤْمِنِ مِنْ هَذِهِ الدُّنْيَا خَيْرٌ لَهُ مِمَّا عَجَّلَ لَهُ فِيهَا ثُمَّ صَغَّرَ الدُّنْيَا وَ قَالَ أَيُّ شَيْ‏ءٍ هِيَ ",
          "ثُمَّ قَالَ إِنَّ صَاحِبَ النِّعْمَةِ عَلَى خَطَرٍ إِنَّهُ يَجِبُ عَلَيْهِ حُقُوقُ اللَّهِ فِيهَا وَ اللَّهِ إِنَّهُ لَتَكُونُ عَلَيَّ النِّعَمُ مِنَ اللَّهِ عَزَّ وَ جَلَّ فَمَا أَزَالُ مِنْهَا عَلَى وَجَلٍ وَ حَرَّكَ يَدَهُ حَتَّى أَخْرُجَ مِنَ الْحُقُوقِ الَّتِي تَجِبُ لِلَّهِ عَلَيَّ فِيهَا فَقُلْتُ جُعِلْتُ فِدَاكَ أَنْتَ فِي قَدْرِكَ تَخَافُ هَذَا قَالَ نَعَمْ فَأَحْمَدُ رَبِّي عَلَى مَا مَنَّ بِهِ عَلَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I mentioned something to Al-Reza<sup>asws</sup>, so he<sup>asws</sup> said: ‘Be patient, for I<sup>asws</sup> am hoping that Allah<sup>azwj</sup> would do something for you, Allah<sup>azwj</sup> Willing’. Then he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! Allah<sup>azwj</sup> does not delay from the Believer from this world what is good for him, from what He<sup>azwj</sup> Hastens or him in it’. Then he<sup>asws</sup> belittled the world and said: ‘Which thing is it?’ ",
            "Then he<sup>asws</sup> said: ‘The favoured one is upon a danger that there is Obligated upon him the Rights of Allah<sup>azwj</sup> in it. By Allah<sup>azwj</sup>! If there happens to be the Bounty upon me<sup>asws</sup> from Allah<sup>azwj</sup> Mighty and Majestic, so I<sup>asws</sup> would not cease to be apprehensive from it’, and he moved his<sup>asws</sup> hand, ‘Until I<sup>asws</sup> take out the rights which are Obligated for the Sake of Allah<sup>azwj</sup> upon me<sup>asws</sup> with regards to it’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! You<sup>asws</sup> are within your<sup>asws</sup> powers (and) you<sup>asws</sup> are fearing this?’ He<sup>asws</sup> said: ‘Yes, so I<sup>asws</sup> can Praise my<sup>asws</sup> Lord<sup>azwj</sup> upon what He<sup>azwj</sup> Favoured with upon me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "19. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Ahmad ibn Muhammad ibn abu Nasr who has said the following: “I mentioned something before al-Rida, ‘Alayhi al-Salam, and he said, ’Exercise patience. I hope Allah will do something good for you if He so wills.’ He then said, ’By Allah, He does not delay anything from a believer of the worldly things unless it is better for him than to do it for him quickly.’ He then belittled worldly things and said, ‘It is worthless.’ He then said, ‘An affluent person faces the danger of owing compulsory payments of the rights of Allah. By Allah, I may receive bounties from Allah, most Majestic, most Glorious, and I continue to be afraid’ - moving his hand- ’until I pay off what Allah has made compulsory upon me to pay.’ I then said, ’I pray to Allah to keep my soul in service for your cause, why you fear with such a prominent position before Allah?’ He replied, ‘Yes, I do and I am thankful to Allah for what He has granted me.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:1",
  "kind": "verse_list"
}