{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:3:5:11",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب زَكَاةِ الْمَالِ</span> الْغَائِبِ وَ الدَّيْنِ وَ الْوَدِيعَةِ",
          "en": "Chapter 11 – Zakāt of the hidden wealth, and the debts, and the deposits"
        }
      }
    ],
    "index": 781,
    "local_index": 11,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:11",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب زَكَاةِ الْمَالِ</span> الْغَائِبِ وَ الدَّيْنِ وَ الْوَدِيعَةِ",
      "en": "Chapter 11 – Zakāt of the hidden wealth, and the debts, and the deposits"
    },
    "verse_count": 13,
    "verse_start_index": 5774,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/37)"
        ],
        "index": 5775,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ سَدِيرٍ الصَّيْرَفِيِّ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) مَا تَقُولُ فِي رَجُلٍ كَانَ لَهُ مَالٌ فَانْطَلَقَ بِهِ فَدَفَنَهُ فِي مَوْضِعٍ فَلَمَّا حَالَ عَلَيْهِ الْحَوْلُ ذَهَبَ لِيُخْرِجَهُ مِنْ مَوْضِعِهِ فَاحْتَفَرَ الْمَوْضِعَ الَّذِي ظَنَّ أَنَّ الْمَالَ فِيهِ مَدْفُونٌ فَلَمْ يُصِبْهُ فَمَكَثَ بَعْدَ ذَلِكَ ثَلَاثَ سِنِينَ ثُمَّ إِنَّهُ احْتَفَرَ الْمَوْضِعَ الَّذِي مِنْ جَوَانِبِهِ كُلِّهِ فَوَقَعَ عَلَى الْمَالِ بِعَيْنِهِ كَيْفَ يُزَكِّيهِ قَالَ يُزَكِّيهِ لِسَنَةٍ وَاحِدَةٍ لِأَنَّهُ كَانَ غَائِباً عَنْهُ وَ إِنْ كَانَ احْتَبَسَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Al A’ala Bin Razeyn, from Sadeyr Al Sayrafi who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding a man who used to have wealth for him, so he went and buried it in a place (for safekeeping). So when a year passed by over it, he went to take it out from its place. So he dug the place in which he thought that the wealth was buried in, but could not attain it. So it remained like that for three years. Then he dug the places by all its sides, and he came across the wealth exactly. How should he purify it (pay <span class=\"iTxt\">Zakāt</span>)?’ He<sup>asws</sup> said: ‘He should purify it (pay <span class=\"iTxt\">Zakāt</span>) for one year, except it was absent (hidden) from him, and even if he had withheld it’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from al-‘Ala’ ibn Razin from Sadir al-Sayrafiy who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about a man who buries a certain amount of his wealth in a certain place and after one year goes to find out. He searches and digs around in the area but fails to find it. He then after three years goes to search again and finds the amount of wealth that was lost. He (the Imam) said, ‘He pays only one year’s Zakat because it was absent from him even though he had placed it in hold.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/38)"
        ],
        "index": 5776,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِفَاعَةَ بْنِ مُوسَى قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَغِيبُ عَنْهُ مَالُهُ خَمْسَ سِنِينَ ثُمَّ يَأْتِيهِ فَلَا يُرَدُّ رَأْسُ الْمَالِ كَمْ يُزَكِّيهِ قَالَ سَنَةً وَاحِدَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Rifa’at Bin Musa who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man whose wealth was hidden from him for five years, then it came to him, so he did not reject the capital wealth. How much should he purify (pay <span class=\"iTxt\">Zakāt</span> on)?’ He<sup>asws</sup> said: ‘One year’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Rifa’ah ibn Musa who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man whose wealth remains lost for five years. He then finds it and does not reject the capital. How much Zakat is he required to pay? He (the Imam) said, ‘He pays one year’s Zakat only.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/38)"
        ],
        "index": 5777,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ دُرُسْتَ عَنْ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَيْسَ فِي الدَّيْنِ زَكَاةٌ إِلَّا أَنْ يَكُونَ صَاحِبُ الدَّيْنِ هُوَ الَّذِي يُؤَخِّرُهُ فَإِذَا كَانَ لَا يَقْدِرُ عَلَى أَخْذِهِ فَلَيْسَ عَلَيْهِ زَكَاةٌ حَتَّى يَقْبِضَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Dorost, from Umar Bin Yazeed, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is no <span class=\"iTxt\">Zakāt</span> regarding the debts, except if it so happens that it is the lender who is delaying it. But if he was not able upon taking it, so there is no <span class=\"iTxt\">Zakāt</span> upon it until he takes possession of it’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ’Isma‘il ibn Marrar from Yunus from Durust from ‘Umar ibn Yazid who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Zakat is not due on loan unless the lender delays acceptance of payment. If he is not able to achieve payment, then Zakat is not due until payment is received.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/38)"
        ],
        "index": 5778,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَكُونُ لَهُ الدَّيْنُ عَلَى النَّاسِ يَحْتَبِسُ فِيهِ الزَّكَاةَ قَالَ لَيْسَ عَلَيْهِ فِيهِ زَكَاةٌ حَتَّى يَقْبِضَهُ فَإِذَا قَبَضَهُ فَعَلَيْهِ الزَّكَاةُ وَ إِنْ هُوَ طَالَ حَبْسُهُ عَلَى النَّاسِ حَتَّى يَتِمَّ لِذَلِكَ سِنُونَ فَلَيْسَ عَلَيْهِ زَكَاةٌ حَتَّى يَخْرُجَ فَإِذَا هُوَ خَرَجَ زَكَّاهُ لِعَامِهِ ذَلِكَ وَ إِنْ هُوَ كَانَ يَأْخُذُ مِنْهُ قَلِيلًا قَلِيلًا فَلْيُزَكِّ مَا خَرَجَ مِنْهُ أَوَّلًا فَأَوَّلً",
          "فَإِنْ كَانَ مَتَاعُهُ وَ دَيْنُهُ وَ مَالُهُ فِي تِجَارَتِهِ الَّتِي يَتَقَلَّبُ فِيهَا يَوْماً بِيَوْمٍ يَأْخُذُ وَ يُعْطِي وَ يَبِيعُ وَ يَشْتَرِي فَهُوَ يُشْبِهُ الْعَيْنَ فِي يَدِهِ فَعَلَيْهِ الزَّكَاةُ وَ لَا يَنْبَغِي لَهُ أَنْ يُغَيِّرَ ذَلِكَ إِذَا كَانَ حَالُ مَتَاعِهِ وَ مَالِهِ عَلَى مَا وَصَفْتُ لَكَ فَيُؤَخِّرَ الزَّكَاةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Usman Bin Isa, from Sama’at who said, ",
            "‘I asked him<sup>asws</sup> about the man who happens to have the debts upon the people (owing him), ‘Would the <span class=\"iTxt\">Zakāt</span> be reckoned in it?’ He<sup>asws</sup> said: ‘There is no <span class=\"iTxt\">Zakāt</span> upon him with regards to it until he takes possession of it. So when he does take the possession of it, then upon him would be the <span class=\"iTxt\">Zakāt</span>; and if its withholding is prolonged by the people until complete years go by, so there would be no <span class=\"iTxt\">Zakāt</span> upon him until it comes out (to him). So when it does come, there would be <span class=\"iTxt\">Zakāt</span> for that year of his; and if it was so that he had taken a little by little, so let him purify (pay <span class=\"iTxt\">Zakāt</span>) what comes out from it firstly. ",
            "And if it was so that his chattels, and his debts and his wealth were in a business which changes day by day, he takes and he gives, and he sells and he buys, so it would be like the essence in his hand, so the <span class=\"iTxt\">Zakāt</span> would be upon him. And it is not befitting for him that he changes that when the state of his chattels and his wealth upon what I<sup>asws</sup> have described to you, so he would delay the <span class=\"iTxt\">Zakāt</span>’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about a man to whom people owe loans and do not pay. Is there Zakat on such loans? He (the Imam) said, ‘Zakat is not due until he receives payment. Once he receives payment, there is Zakat on him. If he does not receive payment and it remains for many years, still Zakat is not due on him until payment is received. Once payment is received he pays Zakat of that year. If he receives payment gradually, he pays Zakat of whatever is received by the order it comes. If his wealth, loan and goods are in business, then it is his business, which is at work, and in give and take, buying and selling, thus it is like the substance in his hand and he is required to pay Zakat. It is not proper for him to change the process if his case is as the case I just mentioned.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/38)"
        ],
        "index": 5779,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:5",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ اسْتَقْرَضَ مَالًا فَحَالَ عَلَيْهِ الْحَوْلُ وَ هُوَ عِنْدَهُ قَالَ إِنْ كَانَ الَّذِي أَقْرَضَهُ يُؤَدِّي زَكَاتَهُ فَلَا زَكَاةَ عَلَيْهِ وَ إِنْ كَانَ لَا يُؤَدِّي أَدَّى الْمُسْتَقْرِضُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan Bin Yahya, from Mansour Bin Hazim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who borrow some wealth, and a year passes by over it and it is still in his possession. He<sup>asws</sup> said: ‘If it was so that then one who lent it to him did pay his <span class=\"iTxt\">Zakāt</span>, so there would be no <span class=\"iTxt\">Zakāt</span> upon him; but if it was so that he had not paid, the borrower would pay’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mansur ibn Hazim who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who borrows a certain amount of wealth and it remains with him for one year. He (the Imam) said, ‘If the person from whom he has borrowed pays Zakat for such wealth then Zakat is not due on the borrower but if the lender does not pay then he (the borrower) pays Zakat for such wealth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/39)"
        ],
        "index": 5780,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ دَفَعَ إِلَى رَجُلٍ مَالًا قَرْضاً عَلَى مَنْ زَكَاتُهُ عَلَى الْمُقْرِضِ أَوْ عَلَى الْمُقْتَرِضِ قَالَ لَا بَلْ زَكَاتُهَا إِنْ كَانَتْ مَوْضُوعَةً عِنْدَهُ حَوْلًا عَلَى الْمُقْتَرِضِ قَالَ قُلْتُ فَلَيْسَ عَلَى الْمُقْرِضِ زَكَاتُهَا قَالَ لَا يُزَكَّى الْمَالُ مِنْ وَجْهَيْنِ فِي عَامٍ وَاحِدٍ وَ لَيْسَ عَلَى الدَّافِعِ شَيْ‏ءٌ لِأَنَّهُ لَيْسَ فِي يَدِهِ شَيْ‏ءٌ إِنَّمَا الْمَالُ فِي يَدِ الْآخِذِ فَمَنْ كَانَ الْمَالُ فِي يَدِهِ زَكَّاهُ",
          "قَالَ قُلْتُ أَ فَيُزَكِّي مَالَ غَيْرِهِ مِنْ مَالِهِ فَقَالَ إِنَّهُ مَالُهُ مَا دَامَ فِي يَدِهِ وَ لَيْسَ ذَلِكَ الْمَالُ لِأَحَدٍ غَيْرِهِ ثُمَّ قَالَ يَا زُرَارَةُ أَ رَأَيْتَ وَضِيعَةَ ذَلِكَ الْمَالِ وَ رِبْحَهُ لِمَنْ هُوَ وَ عَلَى مَنْ قُلْتُ لِلْمُقْتَرِضِ قَالَ فَلَهُ الْفَضْلُ وَ عَلَيْهِ النُّقْصَانُ وَ لَهُ أَنْ يَنْكِحَ وَ يَلْبَسَ مِنْهُ وَ يَأْكُلَ مِنْهُ وَ لَا يَنْبَغِي لَهُ أَنْ يُزَكِّيَهُ بَلْ يُزَكِّيهِ فَإِنَّهُ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Zurara who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man hands over some wealth to a man on loan upon a stipulation that the (payment of) <span class=\"iTxt\">Zakāt</span> would be upon the lender, or the borrower’. He<sup>asws</sup> said: ‘No, but its <span class=\"iTxt\">Zakāt</span> (would be paid) by the one with whom it would be for a year, upon the borrower’. I said, ‘So there is no <span class=\"iTxt\">Zakāt</span> upon its lender?’ He<sup>asws</sup> said: ‘The wealth would not be purified (<span class=\"iTxt\">Zakāt</span> paid on) from two aspects in one year, and there is nothing upon the one handing over because there is nothing in his hand. But rather, the wealth is in the hand of the one who possesses it. Thus, the one in whose hand is the wealth would purify (pay <span class=\"iTxt\">Zakāt</span>)’.",
            "He (the narrator) said, ‘I said, ‘So he would be purifying (paying <span class=\"iTxt\">Zakāt</span>) from a wealth other than his own wealth?’ So he<sup>asws</sup> said: ‘It is his wealth so long as it is in his hands, and that wealth is not for anyone other than him’. Then he<sup>asws</sup> said: ‘O Zurara! What is your view if that wealth is lost or profited from, for whom would it (the profit) be, and upon whom would be (the loss)?’ I said, ‘The borrower’. He<sup>asws</sup> said: ‘So for him is the excess, and upon him is the deficiency, and for him is that he marries, and wears (clothes) from it, and eat from it; and it is not befitting for him that he purifies it, but he has to purify it, for it is upon him’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from Zurarah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who gives a certain amount of asset to another person as loan with the condition that Zakat is on lender or borrower. He (the Imam) said, ‘No, Zakat is due on borrower if it remains with him for one year.’ He (the Imam) said, ‘Zakat is not paid twice for the same thing in one year. Zakat is not due on lender because it is not in his hands. The asset is in the hands of the borrower. Whoever has the asset in his hand pays Zakat.’ I then asked is he required to pay Zakat of the asset that belongs to someone else? He (the Imam) said, ‘ 0 Zurarah, consider the position of that asset. In whose hand is it and who gets its profits and whose liability is it?’ I (Zurarah) said, ‘It is the borrower.’ He (the Imam) said, ‘He then is responsible for its increase and decrease. He can marry thereby and pay thereby for his food. Is he not supposed to pay its Zakat? In fact, he is required to pay its Zakat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/39)"
        ],
        "index": 5781,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:7",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ عَلَيْهِ دَيْنٌ وَ فِي يَدِهِ مَالٌ لِغَيْرِهِ هَلْ عَلَيْهِ زَكَاةٌ فَقَالَ إِذَا كَانَ قَرْضاً فَحَالَ عَلَيْهِ الْحَوْلُ فَزَكَّاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban Bin Usman, from Abdul Rahman Bin Abu Abdullah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man upon whom are debts and in his hand is wealth of theirs’. Is the <span class=\"iTxt\">Zakāt</span> upon him?’ So he<sup>asws</sup> said: ‘When it was a loan, and a year passes by over it, so he should purify it (pay <span class=\"iTxt\">Zakāt</span>)’."
          ],
          "en.sarwar": [
            "7. Humayd ibn Ziyad has narrated from al-Husayn ibn Muhammad from Sama‘ah and from more than one person from Aban ibn ‘Uthman from ‘Abd al-Rahman ibn abu ‘Abd Alfah who has said the foiiowing: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who owes a loan and in his hands is the assets of another person. Is he required to pay Zakat for the asset of other people? He (the Imam) said, ‘If it is loan and it has remained in his hand for one year, he then is required to pay its Zakat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/39)"
        ],
        "index": 5782,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:8",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الْحَمِيدِ بْنِ سَعْدٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ رَجُلٍ بَاعَ بَيْعاً إِلَى ثَلَاثِ سِنِينَ مِنْ رَجُلٍ مَلِيٍّ بِحَقِّهِ وَ مَالِهِ فِي ثِقَةٍ يُزَكِّي ذَلِكَ الْمَالَ فِي كُلِّ سَنَةٍ تَمُرُّ بِهِ أَوْ يُزَكِّيهِ إِذَا أَخَذَهُ فَقَالَ لَا بَلْ يُزَكِّيهِ إِذَا أَخَذَهُ قُلْتُ لَهُ لِكَمْ يُزَكِّيهِ قَالَ قَالَ لِثَلَاثِ سِنِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abdul Hameed Bin Sa’ad, said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about a man who buys goods for up to three years (delayed payment), from a man who trusts his right and his wealth for long period, would he have to purify that wealth every year which passes by, or would he purify it when he takes it. So he<sup>asws</sup> said: ‘But, he who takes it would purify it (pay <span class=\"iTxt\">Zakāt</span>)’. I said to him<sup>asws</sup>, ‘For how long would he purify it (pay <span class=\"iTxt\">Zakāt</span>)?’ He<sup>asws</sup> said: ‘Three years’."
          ],
          "en.sarwar": [
            "8. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Abd af-Majid ibn Sa‘d who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who buys something to pay for after three years from a man who trusts him in his right and asset. Is he required to pay its Zakat every year or he pays it because he has the asset in his hands? He (the Imam) said, ‘He who has taken it pays its Zakat.’ I then asked, ‘For how long he pays it?’ He (the Imam) said, ‘He pays it for three years.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/40)"
        ],
        "index": 5783,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ أَبَانِ بْنِ عُثْمَانَ عَمَّنْ أَخْبَرَهُ قَالَ سَأَلْتُ أَحَدَهُمَا ( عليهما السلام ) عَنْ رَجُلٍ عَلَيْهِ دَيْنٌ وَ فِي يَدِهِ مَالٌ وَفَى بِدَيْنِهِ وَ الْمَالُ لِغَيْرِهِ هَلْ عَلَيْهِ زَكَاةٌ فَقَالَ إِذَا اسْتَقْرَضَ فَحَالَ عَلَيْهِ الْحَوْلُ فَزَكَاتُهُ عَلَيْهِ إِذَا كَانَ فِيهِ فَضْلٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Sazalat Bin Ayoub, from Aban Bin Usman, from the one who informed him who said, ",
            "‘I asked one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) about a man upon whom are debts, and in his hand is wealth to fulfil his debts, and the wealth belongs to someone else. Is there <span class=\"iTxt\">Zakāt</span> upon it?’ So he<sup>asws</sup> said: ‘When he borrows and a year passes by over it, so the <span class=\"iTxt\">Zakāt</span> is upon him, where there was an excess in it’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from Aban ibn ‘Uthman from those who narrated to him who has said the following: “I once asked one of the two the Imam, ‘Alayhim al-Salam, about a man who owes a loan and in his hand is an asset that is sufficient to pay the loan but it belongs to someone else. Is he required to pay Zakat? He (the Imam) said, ‘If he has borrowed and one year has passed, then its Zakat is on him if there is anything extra.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/40)"
        ],
        "index": 5784,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنْ كَانَ عِنْدَكَ وَدِيعَةٌ تُحَرِّكُهَا فَعَلَيْكَ الزَّكَاةُ فَإِنْ لَمْ تُحَرِّكْهَا فَلَيْسَ عَلَيْكَ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If there was a deposit with you and you move (use) it, so upon you would be the <span class=\"iTxt\">Zakāt</span>. But if you do not move (use) it, so there would be nothing upon you’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Ali ibn abu Hamzah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If a certain asset is deposited with you and you are allowed to make it work its Zakat is on you but if you are not allowed to make it work then you do not owe anything.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/40)"
        ],
        "index": 5785,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:11",
        "text": [
          "غَيْرُ وَاحِدٍ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ كَتَبْتُ إِلَيْهِ أَسْأَلُهُ عَنْ رَجُلٍ عَلَيْهِ مَهْرُ امْرَأَتِهِ لَا تَطْلُبُهُ مِنْهُ إِمَّا لِرِفْقٍ بِزَوْجِهَا وَ إِمَّا حَيَاءً فَمَكَثَ بِذَلِكَ عَلَى الرَّجُلِ عُمُرَهُ وَ عُمُرَهَا يَجِبُ عَلَيْهِ زَكَاةُ ذَلِكَ الْمَهْرِ أَمْ لَا فَكَتَبَ لَا يَجِبُ عَلَيْهِ الزَّكَاةُ إِلَّا فِي مَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Someone else from our companions, from Sahl Bin Ziyad, from Ali Bin Mahziyar who said, ",
            "‘I wrote to him<sup>asws</sup> asking him<sup>asws</sup> about a man upon whom is a dower of his wife, she not seeking it from him, either from kindness with her husband, or from embarrassment. So it remains like that upon the man for his life and her life. Would the <span class=\"iTxt\">Zakāt</span> be Obligated upon that dower or not?’ So he<sup>asws</sup> wrote: ‘The <span class=\"iTxt\">Zakāt</span> would not be Obligated upon him except with regards to his wealth’."
          ],
          "en.sarwar": [
            "11. More than one person of our people has narrated from Sahl ibn Ziyad from Ali ibn Mahziyar from who has said the following: “I once wrote to him (the Imam), ‘Alayhi al-Salam, about a man who owes Mahr of his woman who does not ask for payment due to sympathy or shyness. It goes on for their lifetime. Is he required to pay Zakat for that Mahr? He (the Imam) wrote, ‘Zakat is not due on him except for his assets.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/40)"
        ],
        "index": 5786,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:12",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يَنْسَى أَوْ يُعِينُ فَلَا يَزَالُ مَالُهُ دَيْناً كَيْفَ يَصْنَعُ فِي زَكَاتِهِ قَالَ يُزَكِّيهِ وَ لَا يُزَكِّي مَا عَلَيْهِ مِنَ الدَّيْنِ إِنَّمَا الزَّكَاةُ عَلَى صَاحِبِ الْمَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Ali Bin Al Numan, from Abu Al Sabbah Al Kinany, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who forgets or assists (the borrower) and his wealth does not cease to remain as outstanding debts. How should he deal with his <span class=\"iTxt\">Zakāt</span>?’ He<sup>asws</sup> said: ‘He should purify it (pay <span class=\"iTxt\">Zakāt</span>), and he would not pay for what is upon him from the debts. But rather, the <span class=\"iTxt\">Zakāt</span> is upon the owner of the wealth’."
          ],
          "en.sarwar": [
            "12. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Ali ibn al-Nu‘man from ibn al- Sabbah al-Kinaniy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who does not collect what he has lent because of forgetfulness or the desire to help his borrowers so his assets continue to remain as loans.How must he deal with Zakat? He (the owner of the assets) not the borrower pays Zakat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/41)"
        ],
        "index": 5787,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:11:13",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) وَ ضُرَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُمَا قَالَا أَيُّمَا رَجُلٍ كَانَ لَهُ مَالٌ مَوْضُوعٌ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ فَإِنَّهُ يُزَكِّيهِ وَ إِنْ كَانَ عَلَيْهِ مِنَ الدَّيْنِ مِثْلُهُ وَ أَكْثَرُ مِنْهُ فَلْيُزَكِّ مَا فِي يَدِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin isa, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, and Zureys from Abu Abdullah<sup>asws</sup>, both having said: ‘Whichever man who has wealth placed for him until a year passes by over it, so he would be purifying it (paying <span class=\"iTxt\">Zakāt</span>); and even though there may be debts upon him of the likes of it, and more than it. So let him purify (pay <span class=\"iTxt\">Zakāt</span>) on what is in his hands’."
          ],
          "en.sarwar": [
            "13. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Zurarah from abu Ja‘far and Durays who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said that the two Imam, ‘Alayhim al-Salam, have said, ‘Whoever has an asset that remains with him for one year, he is required to pay its Zakat even if he owes to others an equal amount of asset or more. He is required to pay Zakat for what is in his hand.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:11",
  "kind": "verse_list"
}