{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:3:5:12",
        "titles": {
          "ar": "باب أَوْقَاتِ الزَّكَاةِ",
          "en": "Chapter 12 – Timings of the Zakāt"
        }
      }
    ],
    "index": 782,
    "local_index": 12,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:3:5:13",
        "titles": {
          "ar": "باب",
          "en": "Chapter 13 – A Chapter"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:3:5:11",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب زَكَاةِ الْمَالِ</span> الْغَائِبِ وَ الدَّيْنِ وَ الْوَدِيعَةِ",
          "en": "Chapter 11 – Zakāt of the hidden wealth, and the debts, and the deposits"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:12",
    "titles": {
      "ar": "باب أَوْقَاتِ الزَّكَاةِ",
      "en": "Chapter 12 – Timings of the Zakāt"
    },
    "verse_count": 9,
    "verse_start_index": 5787,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول وقيل حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/41)"
        ],
        "index": 5788,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:12:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ إِدْرِيسَ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ حَكِيمٍ عَنْ خَالِدِ بْنِ الْحَجَّاجِ الْكَرْخِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الزَّكَاةِ فَقَالَ انْظُرْ شَهْراً مِنَ السَّنَةِ فَانْوِ أَنْ تُؤَدِّيَ زَكَاتَكَ فِيهِ فَإِذَا دَخَلَ ذَلِكَ الشَّهْرُ فَانْظُرْ مَا نَضَّ يَعْنِي مَا حَصَلَ فِي يَدِكَ مِنْ مَالِكَ فَزَكِّهِ فَإِذَا حَالَ الْحَوْلُ مِنَ الشَّهْرِ الَّذِي زَكَّيْتَ فِيهِ فَاسْتَقْبِلْ بِمِثْلِ مَا صَنَعْتَ لَيْسَ عَلَيْكَ أَكْثَرُ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Safwan Bin Yahya, from Muhammad Bin Hakeym, from Khalid Bin Al Hajjaj Al Karkhy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the <span class=\"iTxt\">Zakāt</span>, so he<sup>asws</sup> said: ‘Look at a month from the year and intend that you would be paying your <span class=\"iTxt\">Zakāt</span> during it. So when that month comes up, so look at what is in your hands from your wealth, and purify it (pay <span class=\"iTxt\">Zakāt</span>). So when the year passes by from the month in which you purified (paid <span class=\"iTxt\">Zakāt</span>), so face it with the likes of what you did. There is nothing more upon you than it’."
          ],
          "en.sarwar": [
            "1. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar and Muhammad ibn ’Isma‘il from al-Fadl ibn Shadhan all from Safwan ibn Yahya from Muhammad ibn Hakim from Khalid ibn al-Hajjaj al-Karkhiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about Zakat. He (the Imam) said, ‘You can choose one of the months of the year and decide to pay Zakat in that month. In that month you must find out what are your assets and pay Zakat thereof. After one year you must do the same thing again and you are not required to do anything more than this.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/42)"
        ],
        "index": 5789,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:12:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ هَلْ لِلزَّكَاةِ وَقْتٌ مَعْلُومٌ تُعْطَى فِيهِ فَقَالَ إِنَّ ذَلِكَ لَيَخْتَلِفُ فِي إِصَابَةِ الرَّجُلِ الْمَالَ وَ أَمَّا الْفِطْرَةُ فَإِنَّهَا مَعْلُومَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, raising it, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Is there a known time for the <span class=\"iTxt\">Zakāt</span> to be given during it?’ So he<sup>asws</sup> said: ‘That is different (based upon) the attain of the wealth by the man; and as for Al-Fitra, so it is known (time)’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad in a marfu‘ manner from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, Is there a definite time to pay Zakat? He (the Imam) said, ‘That depends on one’s earnings. However, the time for al-Fitrah is definite.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/42)"
        ],
        "index": 5790,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:12:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) زَكَاتِي تَحِلُّ عَلَيَّ فِي شَهْرٍ أَ يَصْلُحُ لِي أَنْ أَحْبِسَ مِنْهَا شَيْئاً مَخَافَةَ أَنْ يَجِيئَنِي مَنْ يَسْأَلُنِي فَقَالَ إِذَا حَالَ الْحَوْلُ فَأَخْرِجْهَا مِنْ مَالِكَ لَا تَخْلُطْهَا بِشَيْ‏ءٍ ثُمَّ أَعْطِهَا كَيْفَ شِئْتَ ",
          "قَالَ قُلْتُ فَإِنْ أَنَا كَتَبْتُهَا وَ أَثْبَتُّهَا يَسْتَقِيمُ لِي قَالَ لَا يَضُرُّكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Yunus Bin Yaqoub who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘My <span class=\"iTxt\">Zakāt</span> is resolved upon me in a particular month. Would it be correct for me that I withhold something from it, fearing that there might be someone coming over asking me for it?’ So he<sup>asws</sup> said ‘When the year passes by, so extract it from your wealth, not mixing it with anything (else). Then give it however you so desire to’. ",
            "He (the narrator) said, ‘I said, ‘Supposing I write it out and affirm it to be correct for me?’ He<sup>asws</sup> said: ‘It would not harm you’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali from Yunus ibn Ya’qub who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that there is a certain month in which I pay Zakat. Can I keep a certain amount separate for an emergency, in case, someone comes asking? He (the Imam) said, ‘Once the year is complete, you must pay Zakat of your asset and you must not mix it with anything, and then give whatever you want.’ I then asked, ’Can I write it down and keep a record to make it straight? He (the Imam) said, ‘That is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/43)"
        ],
        "index": 5791,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:12:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ الْبَرْقِيِّ عَنْ سَعْدِ بْنِ سَعْدٍ الْأَشْعَرِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ سَأَلْتُ عَنِ الرَّجُلِ تَحِلُّ عَلَيْهِ الزَّكَاةُ فِي السَّنَةِ فِي ثَلَاثِ أَوْقَاتٍ أَ يُؤَخِّرُهَا حَتَّى يَدْفَعَهَا فِي وَقْتٍ وَاحِدٍ فَقَالَ مَتَى حَلَّتْ أَخْرَجَهَا ",
          "وَ عَنِ الزَّكَاةِ فِي الْحِنْطَةِ وَ الشَّعِيرِ وَ التَّمْرِ وَ الزَّبِيبِ مَتَى تَجِبُ عَلَى صَاحِبِهَا قَالَ إِذَا مَا صَرَمَ وَ إِذَا مَا خَرَصَ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Khalid Al Barqy, from Sa’ad Bin Sa’ad Al Ashary, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I asked about the man, the <span class=\"iTxt\">Zakāt</span> being determined upon him during the year in three timings. Can he delay it until he hands it over during one time?’ So he<sup>asws</sup> said: ‘When it is determined, he should extract it’.",
            "And about the <span class=\"iTxt\">Zakāt</span> regarding the wheat, and the barley, and the dates, and the raisins, ‘When would it be Obligated upon its owner?’ He<sup>asws</sup> said: ‘When he cuts it (harvests), and when he evaluates it’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid al-Barqiy from Sa‘d ibn Sa‘d al- Ash’ariy who has said the following: “I once asked abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, about a man whose accounting time comes three times in a year. Can he delay to make them all at one time? He (the Imam) said, ‘Whenever it comes he must pay Zakat.’ I then asked, ‘When it is the time to pay Zakat of wheat, barley, dates and raisins? He (the Imam) said, ‘It is when he cuts and estimates.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/43)"
        ],
        "index": 5792,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:12:5",
        "text": [
          "وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ حَمْزَةَ عَنِ الْأَصْفَهَانِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَكُونُ لِي عَلَى الرَّجُلِ مَالٌ فَأَقْبِضُهُ مِنْهُ مَتَى أُزَكِّيهِ قَالَ إِذَا قَبَضْتَهُ فَزَكِّهِ قُلْتُ فَإِنِّي أَقْبِضُ بَعْضَهُ فِي صَدْرِ السَّنَةِ وَ بَعْضَهُ بَعْدَ ذَلِكَ قَالَ فَتَبَسَّمَ ثُمَّ قَالَ مَا أَحْسَنَ مَا دَخَلْتَ فِيهَا ",
          "ثُمَّ قَالَ مَا قَبَضْتَهُ مِنْهُ فِي السِّتَّةِ الْأَشْهُرِ الْأُولَى فَزَكِّهِ لِسَنَتِهِ وَ مَا قَبَضْتَهُ بَعْدُ فِي السِّتَّةِ الْأَشْهُرِ الْأَخِيرَةِ فَاسْتَقْبِلْ بِهِ فِي السَّنَةِ الْمُسْتَقْبَلَةِ وَ كَذَلِكَ إِذَا اسْتَفَدْتَ مَالًا مُنْقَطِعاً فِي السَّنَةِ كُلِّهَا فَمَا اسْتَفَدْتَ مِنْهُ فِي أَوَّلِ السَّنَةِ إِلَى سِتَّةِ أَشْهُرٍ فَزَكِّهِ فِي عَامِكَ ذَلِكَ كُلِّهِ وَ مَا اسْتَفَدْتَ بَعْدَ ذَلِكَ فَاسْتَقْبِلْ بِهِ السَّنَةَ الْمُسْتَقْبَلَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Muhammad Bin Hamza, from Al Isfahany who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘There happened to be some wealth for me upon the man, and I took possession from him. When should I purify it (pay <span class=\"iTxt\">Zakāt</span>)?’ He<sup>asws</sup> said: ‘When you take possession of it, so purify it (pay <span class=\"iTxt\">Zakāt</span>)’. I said, ‘Supposing I take possession of some of it in the middle of the year, and some of it after that?’ So he<sup>asws</sup> smiled, then said: ‘How wonderful is what you are involved in’. ",
            "Then he<sup>asws</sup> said: ‘Whatever you take possession from him during the first six months, so purify it (pay <span class=\"iTxt\">Zakāt</span>) for its year, and whatever you take possession of afterwards during the last six months, so face with it during the next year; and similar to that is when you benefit with wealth piece-meal during the year, all of it. So whatever you benefit from during the first six months, so purify it (pay <span class=\"iTxt\">Zakāt</span>) in that year of yours, all of it; and whatever you benefit after that, so face with it the next year’."
          ],
          "en.sarwar": [
            "5. It is narrated from him (narrator of previous Hadith) Muhammad ibn Hamzah from al-Asfahaniy who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that if I collect what I have lent to someone when must I pay Zakat? He (the Imam) said, ‘Pay when you collect it.’ I then said, ‘I collect a certain amount in a certain time of the year and another amount in another time of the year. He (the Imam) smiled and then said, ‘How good is the deal in which you are involved!’ He (the Imam) then said, ‘What you collect in the first six months, pay its Zakat after a year and what you collect in the other six months, pay its Zakat in the coming year. So also is the case with your earning, which you gain in separate times during a whole year. What you earn in the first six months pay its Zakat in that year and what you earn thereafter pay its Zakat in the coming year.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/43)"
        ],
        "index": 5793,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:12:6",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ يَكُونُ نِصْفُ مَالِهِ عَيْناً وَ نِصْفُهُ دَيْناً فَتَحِلُّ عَلَيْهِ الزَّكَاةُ قَالَ يُزَكِّي الْعَيْنَ وَ يَدَعُ الدَّيْنَ قُلْتُ فَإِنَّهُ اقْتَضَاهُ بَعْدَ سِتَّةِ أَشْهُرٍ قَالَ يُزَكِّيهِ حِينَ اقْتَضَاهُ ",
          "قُلْتُ فَإِنْ هُوَ حَالَ عَلَيْهِ الْحَوْلُ وَ حَلَّ الشَّهْرُ الَّذِي كَانَ يُزَكِّي فِيهِ وَ قَدْ أَتَى لِنِصْفِ مَالِهِ سَنَةٌ وَ لِنِصْفِهِ الْآخَرِ سِتَّةُ أَشْهُرٍ قَالَ يُزَكِّي الَّذِي مَرَّتْ عَلَيْهِ سَنَةٌ وَ يَدَعُ الْآخَرَ حَتَّى تَمُرَّ عَلَيْهِ سَنَتُهُ قُلْتُ فَإِنِ اشْتَهَى أَنْ يُزَكِّيَ ذَلِكَ قَالَ مَا أَحْسَنَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Muhammad Bin Yahya, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man whose half wealth happens to be in front of his eyes and half of it as debts outstanding. So the <span class=\"iTxt\">Zakāt</span> becomes due upon him. He<sup>asws</sup> said: ‘He should purify (pay <span class=\"iTxt\">Zakāt</span>) on the cash and leave the outstanding debts’. I said, ‘Supposing it becomes due after six months?’ He<sup>asws</sup> said: ‘He should purify it when it becomes due’. ",
            "I said, ‘Supposing a year passes by upon him and the month during which he pays <span class=\"iTxt\">Zakāt</span> comes up, and for half his wealth there has been a year, and for the other half it has been six months?’ He<sup>asws</sup> said: ‘He should purify that upon which a year has passed by, and leave the other (half) until a year passes by upon it’. I said, ‘Supposing he desires to purify (pay <span class=\"iTxt\">Zakāt</span> on) that?’ He<sup>asws</sup> said: ‘How wonderful that is!’"
          ],
          "en.sarwar": [
            "6. Ahmad ibn Muhammad from Ali ibn al-Hakam from Muhammad ibn Yahya from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man whose asset is half in substance and half as loan. The time of paying Zakat comes. He (the Imam) said, ‘He is required to pay Zakat of the substance and leave the loan.’ I then said that he receives payment after six months. He (the Imam) said, ‘He is required to pay its Zakat when he receives payment.’ I then said, ‘The year is complete and the month of paying Zakat comes but one half of his asset has remained with him for one year and the other half for six months.’ He (the Imam) said, ‘He must pay Zakat for what has been with him for one year and leave the other half until one year is passed.’ I then asked, ‘Can he pay its Zakat if he wants?’ He (the Imam) said, ‘That is very good.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/44)"
        ],
        "index": 5794,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:12:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ فِي الرَّجُلِ يُخْرِجُ زَكَاتَهُ فَيَقْسِمُ بَعْضَهَا وَ يُبْقِي بَعْضَهَا يَلْتَمِسُ بِهَا الْمَوْضِعَ فَيَكُونُ مِنْ أَوَّلِهِ إِلَى آخِرِهِ ثَلَاثَةُ أَشْهُرٍ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding the man who extracts his <span class=\"iTxt\">Zakāt</span>, so he distributes some of it and there remains some of it, seeking the placing of it. So it happens from its beginning up to its end (distribution), three months, he<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ’Abd Allah ibn af-Mughirah from ’Abd Allah ibn Sinan who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who pays his Zakat. He distributes a certain amount of it and keeps a certain amount to find proper recipient and this takes three months altogether. He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/44)"
        ],
        "index": 5795,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:12:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَكُونُ عِنْدَهُ الْمَالُ أَ يُزَكِّيهِ إِذَا مَضَى نِصْفُ السَّنَةِ قَالَ لَا وَ لَكِنْ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ وَ يَحِلَّ عَلَيْهِ إِنَّهُ لَيْسَ لِأَحَدٍ أَنْ يُصَلِّيَ صَلَاةً إِلَّا لِوَقْتِهَا وَ كَذَلِكَ الزَّكَاةُ وَ لَا يَصُومُ أَحَدٌ شَهْرَ رَمَضَانَ إِلَّا فِي شَهْرِهِ إِلَّا قَضَاءً وَ كُلُّ فَرِيضَةٍ إِنَّمَا تُؤَدَّى إِذَا حَلَّتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Umar Bin Yazeed who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The man happens to have some wealth in his possession, can he purify it (pay <span class=\"iTxt\">Zakāt</span>) when half the year passes by?’ He<sup>asws</sup> said: ‘No, but until the year passes by over it, and it becomes due upon him. It is not for anyone that he prays <span class=\"iTxt\">Salāt</span> except in its timing, and similar to that is the <span class=\"iTxt\">Zakāt</span>; and no one can Fast for a Month of Ramazan except during its Month, except for paying back the outstanding Fast; and every Obligation, but rather, is rendered when due’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from ‘Umar ibn Yazid who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who pays Zakat when half of the year passes. He (the Imam) said, ‘No, he must allow one year to pass. Just as it is not permissible to perform Salah (prayer) before its time, so also is Zakat. No one can fast for the month of Ramadan in a month other than the month of Ramadan. Every obligation is fulfilled when it is time for such obligation.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/45)"
        ],
        "index": 5796,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:12:9",
        "text": [
          "حَمَّادُ بْنُ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَ يُزَكِّي الرَّجُلُ مَالَهُ إِذَا مَضَى ثُلُثُ السَّنَةِ قَالَ لَا أَ يُصَلِّي الْأُولَى قَبْلَ الزَّوَالِ .",
          "وَ قَدْ رُوِيَ أَيْضاً أَنَّهُ يَجُوزُ إِذَا أَتَاهُ مَنْ يَصْلُحُ لَهُ الزَّكَاةُ أَنْ يُعَجِّلَ لَهُ قَبْلَ وَقْتِ الزَّكَاةِ إِلَّا أَنَّهُ يَضْمَنُهَا إِذَا جَاءَ وَقْتُ الزَّكَاةِ وَ قَدْ أَيْسَرَ الْمُعْطَى أَوِ ارْتَدَّ أَعَادَ الزَّكَاةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Hammad Bin Isa, from Hareyz, from Zurara who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘Can the man purify his wealth (pay <span class=\"iTxt\">Zakāt</span>) when a third of the year passes by?’ He<sup>asws</sup> said: ‘No. Can one pray the first (Al-Zohr) <span class=\"iTxt\">Salāt</span> before the midday?’ ",
            "And it has been reported as well that he<sup>asws</sup> allowed it when he gives the <span class=\"iTxt\">Zakāt</span> to the one whom it is correct for, that he can hasten it for him before the due time for <span class=\"iTxt\">Zakāt</span>, except that he would be responsible when the due time for the <span class=\"iTxt\">Zakāt</span> comes up and the recipient has become affluent or turned apostate (not deserving anymore), he would have to repeat the <span class=\"iTxt\">Zakāt</span>’."
          ],
          "en.sarwar": [
            "9. Hammad ibn ‘Isa has narrated from Hariz from Zurarah who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, ‘Can one pay Zakat after one-third of the year passes?’ He (the Imam) said, ‘No, can one perform al-Dhuhr before Zawal (declining of the sun toward the west at noontime)?”’ “It is also narrated that it is permissible if deserving recipient is present and to pay to him before the time for Zakat, except that he is responsible for it if at the time of Zakat, the recipient becomes affluent or an apostate, in which case he must pay Zakat again.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:12",
  "kind": "verse_list"
}