{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:3:5:14",
        "titles": {
          "ar": "باب الْمَالِ الَّذِي لَا يَحُولُ عَلَيْهِ الْحَوْلُ فِي يَدِ صَاحِبِهِ",
          "en": "Chapter 14 – The wealth on which a year has not passed upon in the hand of its owner"
        }
      }
    ],
    "index": 784,
    "local_index": 14,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:3:5:15",
        "titles": {
          "ar": "باب مَا يَسْتَفِيدُ الرَّجُلُ مِنَ الْمَالِ بَعْدَ أَنْ يُزَكِّيَ مَا عِنْدَهُ مِنَ الْمَالِ",
          "en": "Chapter 15 – What the man benefits from the wealth after having purified (paid Zakāt) on what was with him from the wealth"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:3:5:13",
        "titles": {
          "ar": "باب",
          "en": "Chapter 13 – A Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:14",
    "titles": {
      "ar": "باب الْمَالِ الَّذِي لَا يَحُولُ عَلَيْهِ الْحَوْلُ فِي يَدِ صَاحِبِهِ",
      "en": "Chapter 14 – The wealth on which a year has not passed upon in the hand of its owner"
    },
    "verse_count": 5,
    "verse_start_index": 5798,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالموثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/46)"
        ],
        "index": 5799,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:14:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ إِسْمَاعِيلَ</span> عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ لَهُ الْوُلْدُ فَيَغِيبُ بَعْضُ وُلْدِهِ فَلَا يَدْرِي أَيْنَ هُوَ وَ مَاتَ الرَّجُلُ فَكَيْفَ يُصْنَعُ بِمِيرَاثِ الْغَائِبِ مِنْ أَبِيهِ ",
          "قَالَ يُعْزَلُ حَتَّى يَجِي‏ءَ قُلْتُ فَعَلَى مَالِهِ زَكَاةٌ فَقَالَ لَا حَتَّى يَجِي‏ءَ قُلْتُ فَإِذَا هُوَ جَاءَ أَ يُزَكِّيهِ فَقَالَ لَا حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ فِي يَدِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad in Ismail, from Al Fazl Bin Shazaan, from Safwan Bin Yahya, from Is’haq Bin Ammar who said, ",
            "‘I asked Abu Ibrahim<sup>asws</sup> about the man who happens to have children for him, so one of his children is absent, and he does not know where he is, and the man dies. So how would one deal with the inheritance of the absentee from his father?’ ",
            "He<sup>asws</sup> said: ‘It would be isolated until he comes over’. I said, ‘So, upon his wealth would be the <span class=\"iTxt\">Zakāt</span>?’ So he<sup>asws</sup> said: ‘No, until he comes over’. I said, ‘So when he does come over he would purify (pay <span class=\"iTxt\">Zakāt</span>)?’ So he<sup>asws</sup> said: ‘No, until a year passes by over it, being it in his hand’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Ishaq ibn ‘Ammar who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about a man who has a certain number of children, a certain one of them disappears and he does not know where he is. The man dies. How his legacy is dealt with? He (the Imam) said, ‘His share is kept aside until he comes? I then asked, ‘Is there Zakat on his share?’ He (the Imam) said, ‘No, until he comes.’ I then asked, ‘Is he required to pay Zakat as soon as he comes?’ He (the Imam) said, ‘No, until one year passes with the asset in his hands.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/46)"
        ],
        "index": 5800,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:14:2",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ صَفْوَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يُفِيدُ الْمَالَ قَالَ لَا يُزَكِّيهِ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Safwan, from Abdullah Bin Muskan, from Muhammad Al Halby who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who benefits the wealth, said: ‘He would not purify it (pay <span class=\"iTxt\">Zakāt</span>) until a year passes by over it’."
          ],
          "en.sarwar": [
            "2. Through the same chain of narrators as that of the previous Hadith it is narrated from Safwan from ‘Abd Allah ibn Muskan from Muhammad al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who earns a certain amount of wealth. He (the Imam) said, ‘He does not pay its Zakat until one year passes.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/46)"
        ],
        "index": 5801,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:14:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ كَانَ لَهُ مَالٌ مَوْضُوعٌ حَتَّى إِذَا كَانَ قَرِيباً مِنْ رَأْسِ الْحَوْلِ أَنْفَقَهُ قَبْلَ أَنْ يَحُولَ عَلَيْهِ أَ عَلَيْهِ صَدَقَةٌ قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Abdullah Bin Sinan who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who had some wealth for him, deposited, until when it was the head of the year, he spends it before a year passes by over it. Is charity (<span class=\"iTxt\">Zakāt</span>) upon him?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah ‘Abd Allah ibn Sinan who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who has a certain amount of asset and it is about the end of the year when he spends it just before the year is complete. Is there Zakat on him? He (the Imam) said, ‘No, he is not required to pay Zakat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/46)"
        ],
        "index": 5802,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:14:4",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزِ بْنِ عَبْدِ اللَّهِ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) رَجُلٌ كَانَ عِنْدَهُ مِائَتَا دِرْهَمٍ غَيْرَ دِرْهَمٍ أَحَدَ عَشَرَ شَهْراً ثُمَّ أَصَابَ دِرْهَماً بَعْدَ ذَلِكَ فِي الشَّهْرِ الثَّانِي عَشَرَ فَكَمَلَتْ عِنْدَهُ مِائَتَا دِرْهَمٍ أَ عَلَيْهِ زَكَاتُهَا قَالَ لَا حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ وَ هِيَ مِائَتَا دِرْهَمٍ فَإِنْ كَانَتْ مِائَةً وَ خَمْسِينَ دِرْهَماً فَأَصَابَ خَمْسِينَ بَعْدَ أَنْ يَمْضِيَ شَهْرٌ فَلَا زَكَاةَ عَلَيْهِ حَتَّى يَحُولَ عَلَى الْمِائَتَيْنِ الْحَوْلُ قُلْتُ فَإِنْ كَانَتْ عِنْدَهُ مِائَتَا دِرْهَمٍ غَيْرَ دِرْهَمٍ فَمَضَى عَلَيْهَا أَيَّامٌ قَبْلَ أَنْ يَنْقَضِيَ الشَّهْرُ ثُمَّ أَصَابَ دِرْهَماً فَأَتَى عَلَى الدَّرَاهِمِ مَعَ الدِّرْهَمِ حَوْلٌ أَ عَلَيْهِ زَكَاةٌ قَالَ نَعَمْ وَ إِنْ لَمْ يَمْضِ عَلَيْهَا جَمِيعاً الْحَوْلُ فَلَا شَيْ‏ءَ عَلَيْهِ فِيهَا ",
          "قَالَ وَ قَالَ زُرَارَةُ وَ مُحَمَّدُ بْنُ مُسْلِمٍ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَيُّمَا رَجُلٍ كَانَ لَهُ مَالٌ وَ حَالَ عَلَيْهِ الْحَوْلُ فَإِنَّهُ يُزَكِّيهِ قُلْتُ لَهُ فَإِنْ هُوَ وَهَبَهُ قَبْلَ حَلِّهِ بِشَهْرٍ أَوْ بِيَوْمٍ قَالَ لَيْسَ عَلَيْهِ شَيْ‏ءٌ أَبَداً ",
          "قَالَ وَ قَالَ زُرَارَةُ عَنْهُ ( عليه السلام ) أَنَّهُ قَالَ إِنَّمَا هَذَا بِمَنْزِلَةِ رَجُلٍ أَفْطَرَ فِي شَهْرِ رَمَضَانَ يَوْماً فِي إِقَامَتِهِ ثُمَّ خَرَجَ فِي آخِرِ النَّهَارِ فِي سَفَرٍ فَأَرَادَ بِسَفَرِهِ ذَلِكَ إِبْطَالَ الْكَفَّارَةِ الَّتِي وَجَبَتْ عَلَيْهِ",
          "وَ قَالَ إِنَّهُ حِينَ رَأَى الْهِلَالَ الثَّانِيَ عَشَرَ وَجَبَتْ عَلَيْهِ الزَّكَاةُ وَ لَكِنَّهُ لَوْ كَانَ وَهَبَهَا قَبْلَ ذَلِكَ لَجَازَ وَ لَمْ يَكُنْ عَلَيْهِ شَيْ‏ءٌ بِمَنْزِلَةِ مَنْ خَرَجَ ثُمَّ أَفْطَرَ إِنَّمَا لَا يَمْنَعُ مَا حَالَ عَلَيْهِ فَأَمَّا مَا لَمْ يَحُلْ فَلَهُ مَنْعُهُ وَ لَا يَحِلُّ لَهُ مَنْعُ مَالِ غَيْرِهِ فِيمَا قَدْ حَلَّ عَلَيْهِ ",
          "قَالَ زُرَارَةُ وَ قُلْتُ لَهُ رَجُلٌ كَانَتْ لَهُ مِائَتَا دِرْهَمٍ فَوَهَبَهَا لِبَعْضِ إِخْوَانِهِ أَوْ وُلْدِهِ أَوْ أَهْلِهِ فِرَاراً بِهَا مِنَ الزَّكَاةِ فَعَلَ ذَلِكَ قَبْلَ حَلِّهَا بِشَهْرٍ فَقَالَ إِذَا دَخَلَ الشَّهْرُ الثَّانِيَ عَشَرَ فَقَدْ حَالَ عَلَيْهَا الْحَوْلُ وَ وَجَبَتْ عَلَيْهِ فِيهَا الزَّكَاةُ قُلْتُ لَهُ فَإِنْ أَحْدَثَ فِيهَا قَبْلَ الْحَوْلِ قَالَ جَائِزٌ ذَلِكَ لَهُ قُلْتُ إِنَّهُ فَرَّ بِهَا مِنَ الزَّكَاةِ قَالَ مَا أَدْخَلَ عَلَى نَفْسِهِ أَعْظَمُ مِمَّا مَنَعَ مِنْ زَكَاتِهَا ",
          "فَقُلْتُ لَهُ إِنَّهُ يَقْدِرُ عَلَيْهَا قَالَ فَقَالَ وَ مَا عِلْمُهُ أَنَّهُ يَقْدِرُ عَلَيْهَا وَ قَدْ خَرَجَتْ مِنْ مِلْكِهِ قُلْتُ فَإِنَّهُ دَفَعَهَا إِلَيْهِ عَلَى شَرْطٍ فَقَالَ إِنَّهُ إِذَا سَمَّاهَا هِبَةً جَازَتِ الْهِبَةُ وَ سَقَطَ الشَّرْطُ وَ ضَمِنَ الزَّكَاةَ قُلْتُ لَهُ وَ كَيْفَ يَسْقُطُ الشَّرْطُ وَ تَمْضِي الْهِبَةُ وَ يَضْمَنُ الزَّكَاةَ فَقَالَ هَذَا شَرْطٌ فَاسِدٌ وَ الْهِبَةُ الْمَضْمُونَةُ مَاضِيَةٌ وَ الزَّكَاةُ لَهُ لَازِمَةٌ عُقُوبَةً لَهُ",
          "ثُمَّ قَالَ إِنَّمَا ذَلِكَ لَهُ إِذَا اشْتَرَى بِهَا دَاراً أَوْ أَرْضاً أَوْ مَتَاعاً ",
          "ثُمَّ قَالَ زُرَارَةُ قُلْتُ لَهُ إِنَّ أَبَاكَ قَالَ لِي مَنْ فَرَّ بِهَا مِنَ الزَّكَاةِ فَعَلَيْهِ أَنْ يُؤَدِّيَهَا قَالَ صَدَقَ أَبِي عَلَيْهِ أَنْ يُؤَدِّيَ مَا وَجَبَ عَلَيْهِ وَ مَا لَمْ يَجِبْ عَلَيْهِ فَلَا شَيْ‏ءَ عَلَيْهِ فِيهِ ",
          "ثُمَّ قَالَ أَ رَأَيْتَ لَوْ أَنَّ رَجُلًا أُغْمِيَ عَلَيْهِ يَوْماً ثُمَّ مَاتَ فَذَهَبَتْ صَلَاتُهُ أَ كَانَ عَلَيْهِ وَ قَدْ مَاتَ أَنْ يُؤَدِّيَهَا قُلْتُ لَا إِلَّا أَنْ يَكُونَ أَفَاقَ مِنْ يَوْمِهِ",
          "ثُمَّ قَالَ لَوْ أَنَّ رَجُلًا مَرِضَ فِي شَهْرِ رَمَضَانَ ثُمَّ مَاتَ فِيهِ أَ كَانَ يُصَامُ عَنْهُ قُلْتُ لَا قَالَ فَكَذَلِكَ الرَّجُلُ لَا يُؤَدِّي عَنْ مَالِهِ إِلَّا مَا حَالَ عَلَيْهِ الْحَوْلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Hammad Bin Isa, from Hareyz Bin Abdullah, from Zurara who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘A man has two hundred Dirhams apart from one Dirham (199) for ten months. The he attains one Dirham after that during the twelfth month, thus completing two hundred Dirhams with him. Is its <span class=\"iTxt\">Zakāt</span> upon him?’ He<sup>asws</sup> said: ‘No, until there passes by a year over it, and it is two hundred Dirhams. So if it was one hundred and fifty Dirham, and he attains fifty after the passing of a month, so there would be no <span class=\"iTxt\">Zakāt</span> upon him until there passes by a year upon the two hundred’. I said, ‘Supposing there were two hundred Dirhams with him apart from one, and days pass by over it before the passing of the month. Then he attains one Dirham, so there come up the Dirhams, along with the one Dirham, a year over it. Would the <span class=\"iTxt\">Zakāt</span> be upon him?’ He<sup>asws</sup> said: ‘Yes, and if the year does not pass over the whole, so there would be nothing upon him’. ",
            "He (Hareyz) said, ‘And Zurara said, and Muhammad Bin Muslim, ‘Abu Abdullah<sup>asws</sup> said: ‘Whichever man has wealth for him and the year passes by over it, so he should purify it (pay <span class=\"iTxt\">Zakāt</span>)’. I said to him<sup>asws</sup>, ‘Supposing he gifts it before its due day, by a month or by a day?’ He<sup>asws</sup> said: ‘There would be nothing upon him, ever!’ ",
            "He (Hareyz) said, ‘And Zurara said from him<sup>asws</sup> that he<sup>asws</sup> said: ‘But rather, this is at the status of a man who breaks (does not Fast) during a Month of Ramazan by one day during his stay, then he goes out at the end of the day in a journey, intending by that journey of his, invalidation of the expiation which would be Obligated upon him’. ",
            "And he<sup>asws</sup> said: ‘He, when he sees the crescent of the twelfth month, the <span class=\"iTxt\">Zakāt</span> would be Obligated upon him, but if he were to gift it before that, it is allowed, and there be nothing upon him, being at the status of the one who goes out, then breaks (does not Fast). But rather, he cannot prevent what a year has passed upon, but as for what a year has not passed upon, so it is for him to prevent, and it is not Permissible for him to prevent the wealth of others with regards to what a year has passed upon it’.",
            "Zurara said, ‘And I said to him<sup>asws</sup>, ‘A man who has two hundred Dirhams for him, so he gifts it to one of his brothers, or his children, or his wife, (in order) to flee from the <span class=\"iTxt\">Zakāt</span> by it. He does that before its due date by a month’. So he<sup>asws</sup> said: ‘When the twelfth month comes by, so a year has passed over it and the <span class=\"iTxt\">Zakāt</span> is Obligated upon him with regards to it’. I said, ‘Supposing he does something new in it before the year’. He<sup>asws</sup> said: ‘That is allowed for him’. I said, ‘He is fleeing from the <span class=\"iTxt\">Zakāt</span> by it’. He<sup>asws</sup> said: ‘What he has entered upon himself is more grievous than what he prevented from its <span class=\"iTxt\">Zakāt</span>’.",
            "So I said to him<sup>asws</sup>, ‘He is able upon it (getting it back)’. So he<sup>asws</sup> said: ‘And what is his knowledge that he is able upon it, and it has gone out from his ownership?’ I said, ‘but he could hand it over to him upon a stipulation (that he would get it back)’. So he<sup>asws</sup> said: ‘When he named it as a gift, the gift is allowed, and the stipulation drops (becomes invalidated), and the <span class=\"iTxt\">Zakāt</span> is ensured’. I said to him<sup>asws</sup>, ‘And how come the stipulation drops (becomes invalid), and the gift proceeds, and the <span class=\"iTxt\">Zakāt</span> is ensured?’ So he<sup>asws</sup> said: ‘This is an invalid stipulation, and the gift is ensured, having passed, and the <span class=\"iTxt\">Zakāt</span> is necessary for him as a punishment for him’.",
            "Then he<sup>asws</sup> said: ‘But rather that is for him when he buys a house with it, or a land, or chattels’. ",
            "Then Zurara said, ‘I said to him<sup>asws</sup>, ‘Your<sup>asws</sup> father<sup>asws</sup> said to me: ‘The one who flees from the <span class=\"iTxt\">Zakāt</span> by it, so upon him is that he pays it’. He<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> spoke the truth, that he should pay whatever is Obligated upon him, and whatever is not Obligated upon him, so there is nothing upon him with regards to it’. ",
            "Then he<sup>asws</sup> said ‘What is your view if a man were to have fainting upon him one day, then he dies, so his <span class=\"iTxt\">Salāt</span> would have gone (missed out on), would it be upon him to pay it back and he has died?’ I said, ‘No, unless he happens to be awake from his day’.",
            "Then he<sup>asws</sup> said: ‘If a man was sick during a Month of Ramazan, then dies during it, would Fasting be done on his behalf?’ I said, ‘No’. He<sup>asws</sup> said: ‘So similar to that is the man who does not pay from his wealth except what a year has passed over it’."
          ],
          "en.sarwar": [
            "4. It is a narration from him (narrator of previous Hadith) by Hammad ibn ‘Isa from Hariz ibn ‘Abd Allah from Zurarah who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about a man who has two hundred dirham less one dirham for eleven months, then he gains one more dirham thereafter during the twelfth month to complete the two hundred. Is there Zakat on him? He (the Imam) said, ‘No, Zakat is not due on him until a year passes and it is two hundred dirham. If it was one hundred fifty dirham and after one month he finds a fifty dirham, in this case also, Zakat is not due on him until one year passes with two hundred dirham.’ I then asked, ‘If one has two hundred dirham less one dirham and after several days and before passing of a month he finds one dirham and then one year passes with the rest of dirham with him, is there Zakat on him? He (the Imam) said, ‘Yes, (there is Zakat on him). If all of it has not remained with him for one complete year Zakat is not obligatory.’ “Zurarah and Muhammad ibn Muslim have said that abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one has a certain amount of asset which remains with him for one year, he is required to pay its Zakat.’ I then asked him (the Imam), ‘What happens if he gives it as gift to someone, one month before the passing of one year or one day? He (the Imam) said, ‘Zakat is not due on him ever.’ Zurarah has narrated from him (the Imam) that he (the Imam) said, ‘This is like the case of one who in the month of Ramadan is at home and then travels in the end of the day intending to avoid the penalty which becomes obligatory on him.’ He (the Imam) said, ‘When he sees the crescent of the twelfth month Zakat becomes obligatory on him.’ He (the Imam) has said, ‘When he sees the crescent of the twelfth month Zakat is due but if he gives it as a gift earlier, it is permissible, and he is not obligated for anything in this matter like the case of one who travels and then discontinues his fast. He cannot refuse once the year passes, but he can refuse if one year is not passed. He cannot refuse to pay what belongs to others. It applies to the asset on which one year has passed.’ Zurarah has said that he then asked, ‘A man had two hundred dirham and he gives it as gift to his brothers or children or his family to avoid Zakat. He did it one month before a year is complete.’ He (the Imam) said, ’Once the twelfth month comes one year is complete and Zakat is obligatory.’ I (Zurarah) then asked, ‘Can he use it (like giving as gift) before the year is complete?’ He (the Imam) said, ‘Yes, it is permissible for him.’I then said, ‘He is avoiding Zakat.’ He (the Imam) said, ‘What he has allowed into his soul is greater than avoiding payment of Zakat.’ I said, ‘He can get it back (from the recipient of gift).’ He (the Imam) said, ‘How can you tell if he can get it back? It is out of his hand (possession) already.’ I said, ‘He can give it as conditional gift.’ He (the Imam) said, ‘Once he calls it a gift it becomes a lawful commitment, the condition falls (is invalid) and he is held responsible for Zakat.’ I then asked, ‘Why does the condition fall, the gift is approved and he is responsible for Zakat?’ He (the Imam) said, ‘This is an invalid condition, commitment for the gift is made and punishment of non-payment of Zakat is necessary.’ He (the Imam) then said, ‘It is for him if he purchases therewith a house or land or goods.’ Zurarah has said that he then said, ‘Your father said to me that if one by doing so avoids Zakat he must pay it.’ He (the Imam) said, ‘My father has spoken the truth. He must pay what is obligatory on him and he is not required to pay what is not obligatory up on him.’ He (the Imam) said, ‘Think about a man who faints for a day, then dies and his Salah (prayer) is missed. Is there any Salah (prayer) on him now that he is dead?’ I replied, ‘No, Salah (prayer) is not obligatory on him unless he gains consciousness on the same day.’ He (the Imam) then said, ‘If a man becomes ill in the month of Ramadan and dies in that month, will there be fasting on his behalf?’ I replied, ‘No, it is not necessary.’ He (the Imam) said, ‘In the same way, a man is not required to pay Zakat until a year is complete.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/49)"
        ],
        "index": 5803,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:14:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ وَرِثَ مَالًا وَ الرَّجُلُ غَائِبٌ هَلْ عَلَيْهِ زَكَاةٌ قَالَ لَا حَتَّى يَقْدَمَ قُلْتُ أَ يُزَكِّيهِ حِينَ يَقْدَمُ قَالَ لَا حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ وَ هُوَ عِنْدَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin marrar, from Yunus, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about a man who inherited some wealth, and the man was absent, ‘Would there be <span class=\"iTxt\">Zakāt</span> upon him?’ He<sup>asws</sup> said: ‘No, until he comes back’. I said, ‘Would he purify when he comes back?’ He<sup>asws</sup> said: ‘No, until a year has passed over it and it is in his possession’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ’Isma‘ii ibn Marrar from Yunus from Ishaq ibn ‘Ammar who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about a man who is absent but has inherited a certain asset. Is there Zakat on him? He (the Imam) said, ‘No, Zakat is not due on him until he comes.’ I then asked, ‘Is he required to pay Zakat as soon as he comes?’ He (the Imam) said, ‘No, until one year passes.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:14",
  "kind": "verse_list"
}