{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 5"}, "path": "/books/al-kafi:3:5", "titles": {"ar": "كِتَابُ الزَّكَاةِ", "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "}}, {"indexed_titles": {"en": "Chapter 18"}, "path": "/books/al-kafi:3:5:18", "titles": {"ar": "باب صَدَقَةِ الْإِبِلِ", "en": "Chapter 18 – Charity (Zakāt) of the camels"}}], "index": 788, "local_index": 18, "part_type": "Chapter", "path": "/books/al-kafi:3:5:18", "titles": {"ar": "باب صَدَقَةِ الْإِبِلِ", "en": "Chapter 18 – Charity (Zakāt) of the camels"}, "verse_count": 3, "verse_start_index": 5821, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 5822, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:5:18:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ وَ أَبِي بَصِيرٍ وَ بُرَيْدٍ الْعِجْلِيِّ وَ الْفُضَيْلِ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( صلوات الله عليهما ) قَالَا فِي صَدَقَةِ الْإِبِلِ فِي كُلِّ خَمْسٍ شَاةٌ إِلَى أَنْ تَبْلُغَ خَمْساً وَ عِشْرِينَ فَإِذَا بَلَغَتْ ذَلِكَ فَفِيهَا ابْنَةُ مَخَاضٍ ثُمَّ لَيْسَ فِيهَا شَيْ‏ءٌ حَتَّى تَبْلُغَ خَمْساً وَ ثَلَاثِينَ فَإِذَا بَلَغَتْ خَمْساً وَ ثَلَاثِينَ فَفِيهَا ابْنَةُ لَبُونٍ ثُمَّ لَيْسَ فِيهَا شَيْ‏ءٌ حَتَّى تَبْلُغَ خَمْساً وَ أَرْبَعِينَ فَإِذَا بَلَغَتْ خَمْساً وَ أَرْبَعِينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْفَحْلِ ثُمَّ لَيْسَ فِيهَا شَيْ‏ءٌ حَتَّى تَبْلُغَ سِتِّينَ فَإِذَا بَلَغَتْ سِتِّينَ فَفِيهَا جَذَعَةٌ ", "ثُمَّ لَيْسَ فِيهَا شَيْ‏ءٌ حَتَّى تَبْلُغَ خَمْساً وَ سَبْعِينَ فَإِذَا بَلَغَتْ خَمْساً وَ سَبْعِينَ فَفِيهَا ابْنَتَا لَبُونٍ ثُمَّ لَيْسَ فِيهَا شَيْ‏ءٌ حَتَّى تَبْلُغَ تِسْعِينَ فَإِذَا بَلَغَتْ تِسْعِينَ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْفَحْلِ ثُمَّ لَيْسَ فِيهَا شَيْ‏ءٌ حَتَّى تَبْلُغَ عِشْرِينَ وَ مِائَةً فَإِذَا بَلَغَتْ عِشْرِينَ وَ مِائَةً فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْفَحْلِ ", "فَإِذَا زَادَتْ وَاحِدَةٌ عَلَى عِشْرِينَ وَ مِائَةٍ فَفِي كُلِّ خَمْسِينَ حِقَّةٌ وَ فِي كُلِّ أَرْبَعِينَ ابْنَةُ لَبُونٍ ثُمَّ تَرْجِعُ الْإِبِلُ عَلَى أَسْنَانِهَا وَ لَيْسَ عَلَى النَّيِّفِ شَيْ‏ءٌ وَ لَا عَلَى الْكُسُورِ شَيْ‏ءٌ وَ لَيْسَ عَلَى الْعَوَامِلِ شَيْ‏ءٌ إِنَّمَا ذَلِكَ عَلَى السَّائِمَةِ الرَّاعِيَةِ ", "قَالَ قُلْتُ مَا فِي الْبُخْتِ السَّائِمَةِ شَيْ‏ءٌ قَالَ مِثْلُ مَا فِي الْإِبِلِ الْعَرَبِيَّةِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Zurara and Muhammad Bin Muslim, and Abu Baseer, and Bureyd Al Ijaly, and Al Fuzayl, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having said: ‘Regarding charity (<span class=\"iTxt\">Zakāt</span>) of the camels - in every five, one sheep, until it reaches twenty five (camels). So when it reaches that, so regarding these would be one female newborn. Then there would be nothing regarding it until it reaches thirty-five. So when it does reach thirty five, so regarding these would be a two year old female camel giving milk. Then there would be nothing regarding it until it reaches forty-five. So when it does reach forty-five, so regarding these would be a three year old female camel left with a stallion. Then there would be nothing regarding it until it reaches sixty. So when it does reach sixty, so regarding these would be a four year old female camel.", "Then there would be nothing regarding these until it reaches seventy-five. So when it reaches seventy five, so regarding these would be two two-year old females giving milk. Then there would be nothing regarding these until it reaches ninety. So when it does reach ninety, so regarding these would be two three-year old female camels left with a stallion. Then there would be nothing regarding these until it reaches one hundred and twenty. So when it does reach one hundred and twenty, so regarding these would be two three year old females left with a stallion. ", "So when one increases upon one hundred and twenty, so regarding every fifty would be a three year old female camel, and regarding every forty would be a two year old female camel giving milk. Then the camel would be returned upon its years. And there would be nothing upon the in between numbers and the fractions, and there would be nothing upon the working camels. But rather, that is upon the ones left to pasture’. ", "He (the narrator) said, ‘I said, ‘What is regarding the running camels, anything?’ He<sup>asws</sup> said: ‘Similar to what is regarding the Arabian camels’."]}}, {"index": 5823, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:5:18:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي خَمْسِ قَلَائِصَ شَاةٌ وَ لَيْسَ فِيمَا دُونَ الْخَمْسِ شَيْ‏ءٌ وَ فِي عَشْرٍ شَاتَانِ وَ فِي خَمْسَ عَشْرَةَ ثَلَاثُ شِيَاهٍ وَ فِي عِشْرِينَ أَرْبَعٌ وَ فِي خَمْسٍ وَ عِشْرِينَ خَمْسٌ وَ فِي سِتَّةٍ وَ عِشْرِينَ بِنْتُ مَخَاضٍ إِلَى خَمْسٍ وَ ثَلَاثِين.", "وَ قَالَ عَبْدُ الرَّحْمَنِ هَذَا فَرْقٌ بَيْنَنَا وَ بَيْنَ النَّاسِ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِيهَا بِنْتُ لَبُونٍ إِلَى خَمْسٍ وَ أَرْبَعِينَ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِيهَا حِقَّةٌ إِلَى سِتِّينَ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِيهَا جَذَعَةٌ إِلَى خَمْسٍ وَ سَبْعِينَ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِيهَا بِنْتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا كَثُرَتِ الْإِبِلُ فَفِي كُلِّ خَمْسِينَ حِقَّةٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Regarding every five young camels is a sheep, and there is nothing regarding less than five; and regarding ten are two sheep, and regarding fifteen are three sheep, and regarding twenty are four (sheep), and regarding twenty five are five (sheep), and regarding twenty six is a new-born camel up to thirty five’.", "And Abdul Rahman said, ‘There is a difference between us and the people. So when it is increased by one, so regarding these would be a two year old female camels giving milk up to forty five. So when it is increased by one, so regarding these would be a three year old female camel up to sixty. So when it increases by one, so regarding these would be a four year old female camel up to seventy-five. So when it increases by one, so regarding these would be two two-year old female camels giving milk, up to ninety. So when there are more camels, so regarding every fifty would be a three-year old female camel’."]}}, {"index": 5824, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:5:18:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَيْسَ فِي صِغَارِ الْإِبِلِ شَيْ‏ءٌ حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمِ تُنْتَجُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said ‘There is nothing regarding the young camels until the year passes by over them from the day they were born’."]}}]}, "index": "al-kafi:3:5:18", "kind": "verse_list"}