{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:3:5:19",
        "titles": {
          "ar": "باب )أَسْنَانُ الْإِبِلِ(",
          "en": "Chapter 19 – A Chapter (The ages of the camels)"
        }
      }
    ],
    "index": 789,
    "local_index": 19,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:3:5:20",
        "titles": {
          "ar": "باب صَدَقَةِ الْبَقَرِ",
          "en": "Chapter 20 – Charity (Zakāt) of the cows"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:3:5:18",
        "titles": {
          "ar": "باب صَدَقَةِ الْإِبِلِ",
          "en": "Chapter 18 – Charity (Zakāt) of the camels"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:19",
    "titles": {
      "ar": "باب )أَسْنَانُ الْإِبِلِ(",
      "en": "Chapter 19 – A Chapter (The ages of the camels)"
    },
    "verse_count": 1,
    "verse_start_index": 5824,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 5825,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:19:1",
        "text": [
          "أَسْنَانُ الْإِبِلِ مِنْ أَوَّلِ يَوْمٍ تَطْرَحُهُ أُمُّهُ إِلَى تَمَامِ السَّنَةِ حُوَارٌ فَإِذَا دَخَلَ فِي الثَّانِيَةِ سُمِّيَ ابْنَ مَخَاضٍ لِأَنَّ أُمَّهُ قَدْ حَمَلَتْ فَإِذَا دَخَلَتْ فِي السَّنَةِ الثَّالِثَةِ يُسَمَّى ابْنَ لَبُونٍ وَ ذَلِكَ أَنَّ أُمَّهُ قَدْ وَضَعَتْ وَ صَارَ لَهَا لَبَنٌ فَإِذَا دَخَلَ فِي السَّنَةِ الرَّابِعَةِ يُسَمَّى الذَّكَرُ حِقّاً وَ الْأُنْثَى حِقَّةً لِأَنَّهُ قَدِ اسْتَحَقَّ أَنْ يُحْمَلَ عَلَيْهِ ",
          "فَإِذَا دَخَلَ فِي السَّنَةِ الْخَامِسَةِ يُسَمَّى جَذَعاً فَإِذَا دَخَلَ فِي السَّادِسَةِ يُسَمَّى ثَنِيّاً لِأَنَّهُ قَدْ أَلْقَى ثَنِيَّتَهُ فَإِذَا دَخَلَ فِي السَّابِعَةِ أَلْقَى رَبَاعِيَتَهُ وَ يُسَمَّى رَبَاعِياً فَإِذَا دَخَلَ فِي الثَّامِنَةِ أَلْقَى السِّنَّ الَّذِي بَعْدَ الرَّبَاعِيَةِ وَ سُمِّيَ سَدِيساً فَإِذَا دَخَلَ فِي التَّاسِعَةِ وَ طَرَحَ نَابَهُ سُمِّيَ بَازِلًا فَإِذَا دَخَلَ فِي الْعَاشِرَةِ فَهُوَ مُخْلِفٌ وَ لَيْسَ لَهُ بَعْدَ هَذَا اسْمٌ وَ الْأَسْنَانُ الَّتِي تُؤْخَذُ مِنْهَا فِي الصَّدَقَةِ مِنْ بِنْتِ مَخَاضٍ إِلَى الْجَذَعِ ."
        ],
        "translations": {
          "en.hubeali": [
            "The years of the camel – From the first day its mother gives it birth up to the completion of the year (it is name as) ‘Al-Huwarun’. So when it enters into the second, it is named as ‘Ibn Makhaaz’, because its mother had carried it. So when it enter into the third years, it is named as ‘Ibn Laboun’, and that is because its mother had placed (gave birth) and milk has come for her. So when it enters into the fourth year, it’s male is named as ‘Hiqqa’, and its female as ‘Hiqqat’, because it is rightful that it be burdened upon. ",
            "So when it enters into the fifth year, it is named as ‘Jaz’an’. So when it enters into the sixth year, it is named as ‘Saniyya’, because it had cast its front teeth. So when it enters into the seventh year, it casts its four (teeth) and it is named as ‘Rubaiya’. And when it enters into the eight, it casts the teeth which are after the four, and it is named as ‘Sadeysa’. So when it enters into the ninth year and drops its canines, it is named a ‘Bazila’. So when it enters into the tenth year, so it is left behind, and there is no name for it after that. And the years which it would be seized from with regards to the charity (<span class=\"iTxt\">Zakāt</span>), is from ‘Bint Makhaaz’ up to ‘Al Jaza’a’’. (P.s. – This is an explanation of the terminology and is not a Hadeeth)."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:19",
  "kind": "verse_list"
}